{"wiki_id": "http://www.wikidata.org/entity/Q348920", "itemLabel": "John Hegley", "itemDescription": "British writer, musician and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hegley", "wikipedia_page": {"main": "John Richard Hegley (born 1 October 1953) is an English performance poet, comedian, musician and songwriter.", "link_mentions": [{"page": "List of comedians", "response": ["* John Hegley (born 1953)"]}, {"page": "List of English-language poets", "response": ["*John Hegley (born 1953, E)"]}, {"page": "Luton", "response": ["* John Hegley, poet"]}, {"page": "List of poets", "response": ["*John Hegley (born 1953), English performance poet, comedian and songwriter"]}, {"page": "List of British comedians", "response": ["*John Hegley (born 1953), also performs as half of the Popticians", "*John Hegley"]}, {"page": "Performance poetry", "response": ["However, the emergence of performed poetry as a popular art form can probably be linked to Allen Ginsberg's performance at the Albert Hall in 1965 at the International Poetry Incarnation. Horovitz, Brown and Mitchell would join Ginsberg and Beat colleagues Lawrence Ferlinghetti and Gregory Corso and other European poets at that landmark London occasion. These developments were also connected to the emergence of the Liverpool Poets, which referred mainly to the poets Roger McGough, Adrian Henri and Brian Patten who fired up audiences across the UK in the 70s and then the likes of John Hegley emerged in the 80s, influenced as much by stand-up comedy as a love for wordplay, creating the template for what became recognised as contemporary British performance poetry - a format still exemplified by the work of acts such as Murray Lachlan Young, Francesca Beard and Gerard McKeown."]}, {"page": "List of performance poets", "response": ["*John Hegley"]}, {"page": "University of Bradford", "response": ["* John Hegley – performance poet"]}, {"page": "Mac McDonald", "response": ["At about this time McDonald joined another company, this time presenting children's shows in conjunction with the Inner London Education Authority. In 1982 he and another member, Hilary, left to form a three-person musical comedy troupe, The Cheap Shots, with McDonald's close friend Sakal providing the music. The threesome developed \"The Chip Shop Show\", a series of spoof musicals popular on the newly burgeoning London alternative comedy circuit, making many appearances at London's The Comedy Store alongside Ronnie Golden, John Hegley and others, including several future Red Dwarf players."]}, {"page": "List of BBC Radio 4 programmes", "response": ["*Hearing with Hegley, sketch show with poet John Hegley"]}, {"page": "Simon Munnery", "response": ["In 1999, together with John Hegley, he made a comedy series for BBC Radio 4 called The Adventures of John and Tony."]}, {"page": "Liverpool poets", "response": ["The Liverpool poets paved the way for a subsequent flourishing of performance and pop-based work by poets such as John Cooper Clarke, Attila the Stockbroker, John Hegley and Benjamin Zephaniah."]}, {"page": "Trevor and Simon", "response": ["Following a suggestion by John Hegley, the duo were persuaded to relocate to London from Manchester. Later they were approached by a BBC producer for Saturday Superstore who \"said they were looking for a double act to represent the new style of comedy, but for children”. Their appearances on Going Live would result in the creation of some well loved sketches and catchphrases, such as the Singing Corner's \"Swing Your Pants\" and \"We don't do duvets.\""]}, {"page": "The Mersey Sound (anthology)", "response": ["The three poets in The Mersey Sound paved the way for later performance and \"people's\" poets, such as John Cooper Clarke, Benjamin Zephaniah, Linton Kwesi Johnson, Attila the Stockbroker, John Hegley and others who \"have pursued the goal of creating poetry for a wide audience\"."]}, {"page": "List of Edinburgh Comedy Award winners", "response": ["|John Hegley – Can I Come Down Now Dad?  Al and George – Unscheduled Stop  Will Durst Live Bed Show The World of Les and Robert"]}, {"page": "Chain Reaction (radio programme)", "response": ["*Phill Jupitus interviewing John Hegley", "*John Hegley interviewing Jack Dee"]}, {"page": "28 Acts in 28 Minutes", "response": ["* John Hegley"]}, {"page": "The Dentists", "response": ["In 1992, the Dentists released three seven-inch singles - \"See No Evil\", \"Hear No Evil\", and \"Speak No Evil\" - simultaneously on three different record labels. Each single consisted of two songs by the band and an eponymous poem by John Hegley, read by the poet."]}, {"page": "Glastonbury Festival line-ups", "response": ["* John Hegley"]}, {"page": "Luton Sixth Form College", "response": ["* John Hegley, performance poet (briefly)"]}, {"page": "1990 in poetry", "response": ["* John Hegley, Glad to Wear Glasses (glad to have ears)"]}, {"page": "1984 in poetry", "response": ["* John Hegley, Visions of the Bone Idol (Poems about Dogs and Glasses)"]}, {"page": "1953 in poetry", "response": ["* October 1 – John Hegley, English performance poet"]}, {"page": "Stratford Circus", "response": ["Artists who have performed their work at Stratford Circus include Andy Hamilton, Billy Bragg, John Hegley, Seun Kuti, and 60x60.  60x60 Dance held its European debut at Stratford Circus in 2010.The 60-second dance fest Lyndsey Winship Time Out London 22–28 July 2010Sixty seconds to make an impact  University of Bedfordshire 21 July 201060 dances in 60 minutes Big Dance Wednesday 21 July 201060x60 Dance  Big Dance The event featured more than 150 dancers with 60 choreographers creating dances to each of the 60 one-minute works in the 60x60 project."]}, {"page": "The Shuttleworths", "response": ["|rowspan=\"5\"|1||1||Leo Sayer, John Hegley||3 November 1998"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|John Hegley and Kate Thornton [9]"]}, {"page": "Great Lives", "response": ["|John Hegley, poet"]}, {"page": "Saint and Blurry", "response": ["Saint and Blurry is an album by John Hegley released in 1993 by Rykodisc."]}, {"page": "Malvern Fringe Festival", "response": ["*John Hegley"]}, {"page": "Morden Tower", "response": ["Other poets to have read there include Allen Ginsberg, Ted Hughes, Lawrence Ferlinghetti, Gregory Corso, Seamus Heaney, Tom Raworth, Carol Ann Duffy, Fleur Adcock and Liz Lochhead.  Despite a lack of funding Morden Tower is still a popular venue for poets and experimental musicians, such as John Hegley and A Hawk and a Hacksaw."]}, {"page": "French migration to the United Kingdom", "response": ["Famous British people who can trace their ancestry back to France include Isambard Kingdom Brunel, Michel Roux Jr, Joanne Harris, Dustin Demri-Burns, Davina McCall, John Hegley, Simon Le Bon, Noel Fielding and Emma Watson. Top French chief executives attracted to Britain have been: Xavier Rolet (LSE) and Vincent de Rivaz (EDF Energy). In the kitchen chefs working in the UK include Raymond Blanc, who has spent most of his working life in Britain and presents cookery programmes on British television. Brothers Albert and Michel Roux, were the first chefs in Britain to be awarded three Michelin stars in 1982 for their restaurant, Le Gavroche. At the start of the 2011–12 season, aside from home-grown and Irish talent, there were more French-born footballers in the Premier League than any other nationality. Frenchman Arsène Wenger was the Premier League's longest serving manager, since assuming the role at Arsenal F.C. in October 1996 before retiring in May 2018."]}, {"page": "Pen Pusher", "response": ["As well as championing new writing, the magazine featured more well-known literary names. Contributors to the magazine include Simon Callow, Hugo Williams, Simon Munnery, Joe Dunthorne, Josie Long and John Hegley."]}, {"page": "The Chefs", "response": ["Greenwood was the first to leave the band in 1982, eventually joining John Hegley as one of the Popticians.  With Bron Buick as drummer, Skat \"limped through a final few more gigs before calling it a day\". Evans went on to form the cowpunk band, Yip Yip Coyote, writing pop songs influenced by club beats and spaghetti western music.  Like Evans, McCallum also wore western clothes, but her new band, Helen and the Horns, was closer to jazz and country music. James McCallum left the music business to retrain as a lawyer."]}, {"page": "Chortle Awards", "response": ["* Award for artistic integrity: John Hegley"]}, {"page": "List of Peel sessions", "response": ["* John Hegley: (1 session, 1996)"]}, {"page": "Bonkersfest", "response": ["The festival was first held in 2006, and again in June 2007, and July 2008. The venue in Camberwell Green was chosen because of the nearby Maudesley hospital, one of London's best known psychiatric institutions. The festival is organized by a group of arts and mental health organizations led by Creative Routes and in 2006 was opened by the mayor of Southwark. Artists appearing at the 2007 festival included Lol Coxhill, John Hegley, and Steve Beresford."]}, {"page": "The Adventures of John and Tony", "response": ["The Adventures of John and Tony was a radio programme that aired in September 1999 on BBC Radio 4.  There was one series of four thirty-minute episodes made.  It starred John Hegley and Simon Munnery."]}, {"page": "Anthony Howell (performance artist)", "response": ["In the 2000s Howell toured Tango Art - a fusion of the tango and performance art - shown at the SKC Belgrade, in Montenegro and at the Irish Centre, London.  His books of poems included Dancers in Daylight (Anvil 2003). He started Tottenham Arts and Dance centre The Room. From 2005-7 he curated \"Poetry@TheRoom\", an Arts Council-funded series, with poet Richard Tyrone Jones. Among others it featured Peter Porter, Fleur Adcock, John Hegley, Hugo Williams, Annie Freud, Roddy Lumsden, Zena Edwards, Tim Key, David J, Alan Jenkins and Clark Coolidge at a packed US abstract special. Poetry@TheRoom is scheduled to recommence in 2014."]}, {"page": "Nathan Penlington", "response": ["Penlington was co-organiser and resident host of London's weekly spoken word venue Shortfuse, from April 2000 to September 2007, with its reputation for an eclectic fusion of stand-up poetry, performance comedy and music, and presenting up-and-coming performers alongside established names such as John Hegley, Stewart Lee, Kevin Eldon and Simon Munnery, while forging links with performers across the US, Canada and Europe. Shortfuse became renowned for new formats, including Bards in their Eyes, Speed Cabaret, and Poetry Idol. The tongue-in-cheek Poetry Idol helped many up-and-coming poets and performers, including Scroobius Pip, Stephen Howarth, Suzanne Andrade, Joshua Idehen and Musa Okwanga."]}]}}