{"wiki_id": "http://www.wikidata.org/entity/Q3484238", "itemLabel": "Simon Chandler", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Chandler", "wikipedia_page": {"main": "Simon Chandler (born 1953) is a British film, television and theatre actor. He often plays senior establishment figures such as Members of Parliament and senior civil servants.", "link_mentions": [{"page": "The Bounty (1984 film)", "response": ["* Simon Chandler as David Nelson"]}, {"page": "1997 in film", "response": ["| The Man Who Knew Too Little || Warner Bros. Pictures / Regency Enterprises || Jon Amiel (director); Robert Farrar, Howard Franklin (screenplay); Bill Murray, Peter Gallagher, Joanne Whalley, Alfred Molina, Richard Wilson, Geraldine James, John Standing, Anna Chancellor, Nicholas Woodeson, Simon Chandler, John Thomson, Cliff Parisi, Dexter Fletcher, Sheila Reid, Eddie Marsan || Comedy || Live action"]}, {"page": "1998 in film", "response": ["| Incognito || Warner Bros. Pictures || John Badham (director); Jordan Katz (screenplay); Jason Patric, Irène Jacob, Thomas Lockyer, Ian Richardson, Rod Steiger, Ian Holm, Togo Igawa, Simon Chandler, Pip Torrens, Michael Cochrane, Joseph Blatchley, Paul Brennen, Olivier Pierre, Peter Gale, David Marrick, Dudley Sutton, Adam Fogerty, Ricardo Montez, Walter van Dyk || Crime, Thriller || Live action"]}, {"page": "1984 in film", "response": ["| The Bounty || Orion Pictures Corporation / Thorn EMI Screen Entertainment || Roger Donaldson (director); Robert Bolt (screenplay); Mel Gibson, Anthony Hopkins, Laurence Olivier, Edward Fox, Daniel Day-Lewis, Bernard Hill, Philip Davis, Liam Neeson, Wi Kuki Kaa, Tevaite Vernette, Philip Martin Brown, Simon Chandler, Malcolm Terris, John Sessions, Andrew Wilde, Neil Morrissey, Richard Graham, Dexter Fletcher, Pete Lee-Wilson, Jon Gadsby, Barry Dransfield, Steve Fletcher, Jack May || History, Drama || Live action"]}, {"page": "The Lord of the Rings (1978 film)", "response": ["Decades later, during Bilbo's birthday celebration, the wizard Gandalf (William Squire) tells him to leave the Ring for his nephew Frodo (Christopher Guard). Bilbo reluctantly agrees, and departs for Rivendell. Seventeen years pass, during which Gandalf learns that evil forces have discovered that the Ring is in the possession of a Baggins. Gandalf meets Frodo to explain the Ring's history and the danger it poses; and Frodo leaves his home, taking the Ring with him. He is accompanied by three hobbits, his cousins, Pippin (Dominic Guard), Merry (Simon Chandler), and his gardener Sam (Michael Scholes). After a narrow escape from the Ringwraiths, the hobbits eventually come to Bree, from which Aragorn (John Hurt) leads them to Rivendell. Frodo is stabbed atop Weathertop mountain by the chief of the Ringwraiths, and becomes sickened as the journey progresses. The Ringwraiths catch up with them shortly after they meet the elf Legolas (Anthony Daniels); and at a standoff at the ford of Rivendell, the Ringwraiths are swept away by the river.", "* Merry – Simon Chandler"]}, {"page": "Vera Drake", "response": ["* Simon Chandler as Mr. Wells"]}, {"page": "Mangal Pandey: The Rising", "response": ["| Simon Chandler || Officer Lockwood"]}, {"page": "Play of the Month", "response": ["|Jonathan Scott-Taylor,Simon Chandler,Ann Beach,Eric Porter,Diana FairfaxMichele Dotrice,Kenneth Waller"]}, {"page": "The Man Who Knew Too Little", "response": ["The contact, Sir Roger Daggenhurst (Richard Wilson), mistakes Wallace for Spencer, the hitman he has hired and Wallace assumes the identity. The real Spencer (Terry O'Neill) picks up the phone call meant for Wallace and murders one of the actors, prompting a police investigation. Daggenhurst, his assistant Hawkins (Simon Chandler), British Defense Minister Gilbert Embleton (John Standing), and Russian intelligence agent Sergei (Nicholas Woodeson) plan to detonate an explosive device (hidden in a Matryoshka doll) during a dinner between British and Russian dignitaries, in order to rekindle the Cold War and replace their aging technology.", "* Simon Chandler"]}, {"page": "Jonny Briggs", "response": ["Mr. Hobbs (Simon Chandler)"]}, {"page": "Murder Rooms: Mysteries of the Real Sherlock Holmes", "response": ["* Simon Chandler as Inspector Warner"]}, {"page": "Judge John Deed", "response": ["Sir John Deed (played by Martin Shaw) is a recently appointed High Court judge who actively seeks justice in the cases before him, while at the same time trying to rekindle an old romance with former pupil Jo Mills QC (played by Jenny Seagrove), who regularly appears in his court. Deed is described by creator and writer G.F. Newman as a character who \"speaks out against all the petty rules and bureaucracy that frustrates us all but that most of us don't speak out against\". Because of Deed's unorthodox actions, he is often hampered in his pursuit of justice by several more conventional-minded characters, including his ex-wife, barrister Georgina \"George\" Channing QC (played by Caroline Langrishe); her father Appeals Court Judge, Lord Justice (Sir Joseph) Channing (played by Sir Donald Sinden), fellow High Court Judges Mr Justice (Sir Monty) Everard (played by Simon Ward) and Mr Justice (Sir Michael) Niven (played by Trevor Bowen), the Permanent Secretary to the Lord Chancellor's Department (LCD, later Department of Constitutional Affairs) Sir Ian Rochester (played by Simon Chandler); and later the Home Secretary Neil Haughton MP (played by Nick Reding and later Aneirin Hughes)."]}, {"page": "Lace (miniseries)", "response": ["* Nick Cliffe (Simon Chandler)", "Lace was followed by a two-part sequel, Lace II, which aired on ABC from May 5–6, 1985. The principal cast was identical to Lace, with two exceptions: Deborah Raffin replaces Bess Armstrong in the role of Judy Hale, and Michael Fitzpatrick replaced Simon Chandler as Nick Cliffe. The plot of Lace II involves Lili's search for the identity of her father. It used the marketing line \"Which one of you bastards is my father?\". The opening theme of the miniseries, \"No More Lies\" was composed by Nick Bicât and performed by Deniece Williams. We learn in the end that Lili's father is Prince Abdullah of Sydon, who raped Judy on her way back to school after a one-night stand with Nick Cliffe, who was already engaged."]}, {"page": "List of Bergerac episodes", "response": ["| Warren Saire, Melanie Thaw, Kenneth Cranham, Simon Chandler, David Hargreaves, Paula Topham, Lawrence Davidson"]}, {"page": "List of Bergerac cast members", "response": ["*Simon Chandler"]}, {"page": "Incognito (1997 film)", "response": ["* Simon Chandler as Ian Hill"]}, {"page": "List of American films of 2004", "response": ["| Vera Drake || Fine Line Features || Mike Leigh (director/screenplay); Imelda Staunton, Richard Graham, Eddie Marsan, Anna Keaveney, Sally Hawkins, Alex Kelly, Daniel Mays, Phil Davis, Sandra Voe, Adrian Scarborough, Heather Craney, Ruth Sheen, Lesley Sharp, Liz White, Peter Wight, Martin Savage, Jim Broadbent, Simon Chandler, Lesley Manville, Marion Bailey || Drama ||"]}, {"page": "Just William (1977 TV series)", "response": ["* Simon Chandler as Robert Brown"]}, {"page": "List of British actors", "response": ["* Simon Chandler (born 1953)"]}, {"page": "Letters of last resort", "response": ["David Greig's 2012 play The Letter of Last Resort deals with the consequences and paradoxes of the letters.David Greig, The Letter of Last Resort (full text of play), front-step.co.uk (David Greig's official website), posted 30 September 2015. The play was first staged in February 2012 as a part of a cycle of plays on \"The Bomb\" at the Tricycle Theatre in London, directed by Nicolas Kent, with Belinda Lang playing the role of the incoming prime minister and Simon Chandler her advisor.Michael Billington, The Bomb - review, The Guardian, 21 February 2012 The production was also seen at the Traverse Theatre in Edinburgh, for the Edinburgh Fringe later the same year.Edinburgh Transfer: The Letter of Last Resort, Tricycle Theatre, August 2012 The following year it was broadcast on BBC Radio 4, with the same cast, first transmitted on 1 June 2013."]}, {"page": "Merry Brandybuck", "response": ["In Ralph Bakshi's 1978 animated version of The Lord of the Rings, Merry was voiced by Simon Chandler. "]}, {"page": "Chandler (surname)", "response": ["*Simon Chandler (born 1953), British film, television and theatre actor"]}, {"page": "The King's Speech", "response": ["* Simon Chandler as Lord Dawson of Penn"]}, {"page": "List of American films of 2010", "response": ["| The King's Speech || The Weinstein Company || Tom Hooper (director); David Seidler (screenplay); Colin Firth, Geoffrey Rush, Helena Bonham Carter, Guy Pearce, Timothy Spall, Derek Jacobi, Jennifer Ehle, Michael Gambon, Freya Wilson, Ramona Marquez, Patrick Ryecart, Simon Chandler, Claire Bloom, Orlando Wells, Eve Best, Anthony Andrews"]}, {"page": "House of Anubis", "response": ["||Ade Rutter|| style=\"text-align:center;\"|Simon Chandler || style=\"text-align:center;\" |11–33|| style=\"text-align:center;\" |1"]}, {"page": "List of House of Anubis characters", "response": ["Ade Rutter is portrayed by Simon Chandler."]}, {"page": "Cause Célèbre (play)", "response": ["* John Davenport .... Simon Chandler"]}, {"page": "Middle-earth in film", "response": ["| Simon Chandler"]}, {"page": "The Politician's Husband", "response": ["*Simon Chandler as Cliff Lyman, Chair of the Business, Innovation and Skills Committee"]}, {"page": "Mr. Turner", "response": ["* Simon Chandler as Sir Augustus Wall Callcott: landscape artist. "]}, {"page": "The Enfield Haunting", "response": ["* Simon Chandler as John Beloff"]}, {"page": "The Imitation Game (play)", "response": ["*Simon Chandler as Tony"]}, {"page": "The Cherub Company London", "response": ["The Cherub Company London was an English theatre company, founded by Andrew Visnevski and Simon Chandler in 1973 as an ensemble of young actors, designers and composers introducing rare classics and continental plays to the stage in a style that proved unconventional and brilliantly visual.  In its first twenty-five years it produced thirty plays, toured nine times in the UK, and visited twelve counties on three continents."]}]}}