{"wiki_id": "http://www.wikidata.org/entity/Q3484280", "itemLabel": "Simon Frith", "itemDescription": "British sociomusicologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Frith", "wikipedia_page": {"main": "Simon Webster Frith  (born 1946) is a British sociomusicologist, and former rock critic, who specializes in popular music culture. He is Tovey Chair of Music at University of Edinburgh.\n\n", "link_mentions": [{"page": "Disco", "response": ["In Beautiful Things in Popular Culture, Simon Frith highlights the sociability of disco and its roots in 1960s counterculture. \"The driving force of the New York underground dance scene in which disco was forged was not simply that city's complex ethnic and sexual culture but also a 1960s notion of community, pleasure and generosity that can only be described as hippie\", he says. \"The best disco music contained within it a remarkably powerful sense of collective euphoria.\"Alan McKee, Beautiful Things in Popular Culture. John Wiley & Sons, April 15, 2008, p.196"]}, {"page": "Funk", "response": ["The term \"avant-funk\" has been used to describe acts who combined funk with art rock's concerns. Simon Frith described the style as an application of progressive rock mentality to rhythm rather than melody and harmony. Simon Reynolds characterized avant-funk as a kind of psychedelia in which \"oblivion was to be attained not through rising above the body, rather through immersion in the physical, self loss through animalism.\""]}, {"page": "Heavy metal music", "response": ["The lead role of the guitar in heavy metal often collides with the traditional \"frontman\" or bandleader role of the vocalist, creating a musical tension as the two \"contend for dominance\" in a spirit of \"affectionate rivalry\". Heavy metal \"demands the subordination of the voice\" to the overall sound of the band. Reflecting metal's roots in the 1960s counterculture, an \"explicit display of emotion\" is required from the vocals as a sign of authenticity.Weinstein (2000), p. 26 Critic Simon Frith claims that the metal singer's \"tone of voice\" is more important than the lyrics.Cited in Weinstein (2000), p. 26"]}, {"page": "Pop music", "response": ["From about 1967, the term “pop music” was increasingly used in opposition to the term rock music, a division that gave generic significance to both terms.Kenneth Gloag in The Oxford Companion to Music (Oxford: Oxford University Press, 2001), , p. 983. While rock aspired to authenticity and an expansion of the possibilities of popular music, pop was more commercial, ephemeral, and accessible.T. Warner, Pop Music: Technology and Creativity: Trevor Horn and the Digital Revolution (Aldershot: Ashgate, 2003), , pp. 3–4. According to British musicologist Simon Frith, pop music is produced \"as a matter of enterprise not art\", and is \"designed to appeal to everyone\" but \"doesn't come from any particular place or mark off any particular taste\". Frith adds that it is \"not driven by any significant ambition except profit and commercial reward [...] and, in musical terms, it is essentially conservative\". It is, \"provided from on high (by record companies, radio programmers, and concert promoters) rather than being made from below ... Pop is not a do-it-yourself music but is professionally produced and packaged\". "]}, {"page": "Rock music", "response": ["Since the term \"rock\" started being used in preference to \"rock and roll\" from the late-1960s, it has usually been contrasted with pop music, with which it has shared many characteristics, but from which it is often distanced by an emphasis on musicianship, live performance, and a focus on serious and progressive themes as part of an ideology of authenticity that is frequently combined with an awareness of the genre's history and development.T. Warner, Pop Music: Technology and Creativity: Trevor Horn and the Digital Revolution (Aldershot: Ashgate, 2003), , pp. 3–4. According to Simon Frith, rock was \"something more than pop, something more than rock and roll\" and \"[r]ock musicians combined an emphasis on skill and technique with the romantic concept of art as artistic expression, original and sincere\"."]}, {"page": "Pet Shop Boys", "response": ["In 1992, Pet Shop Boys were the subjects of a South Bank Show documentary on ITV. This included interviews with Neil and Chris, and contributions from Liza Minnelli, Eric Watson (photographer and video director), Simon Frith (music critic), David Alden and David Fielding."]}, {"page": "Slavko Avsenik", "response": ["Slavko Avsenik (November 26, 1929 – July 2, 2015) was a Slovene composer and musician. Beginning in 1953 with the formation of the Avsenik Brothers Ensemble, Avsenik produced more than 1,000 songs and enjoyed success both in Slovenia and in other parts of Europe and America, and is viewed as a Slovenian cultural icon.Simon Frith, ed., World Music, Politics and Social Change: Papers from the International Association for the Study of Popular Music (Manchester University Press, 1991), , pp. 76–78. Excerpts available at Google Books.Leopoldina Plut-Pregelj, Carole Rogel, The A to Z of Slovenia (Rowman & Littlefield, 2010), , p. 314. Excerpts available at Google Books.Dieter Schulze, Slowenien (Baedeker, 2011), , p. 65. Excerpts available at Google Books."]}, {"page": "Sgt. Pepper's Lonely Hearts Club Band", "response": ["American radio stations interrupted their regular scheduling, playing the album virtually non-stop, often from start to finish.: radio stations interrupted their regular scheduling; : some played the album from start to finish. Emphasising its identity as a self-contained work, none of the songs were issued as singles at the time or available on spin-off EPs. Instead, the Beatles released \"All You Need Is Love\" as a single in July, after performing the song on the Our World satellite broadcast on 25 June before an audience estimated at 400 million. According to sociomusicologist Simon Frith, the international broadcast served to confirm \"the Beatles' evangelical role\" amid the public's embrace of Sgt. Pepper. Available at Rock's Backpages  (subscription required). In the UK, Our World also quelled the furore that followed McCartney's repeated admission in mid June that he had taken LSD. In Norman's description, this admission was indicative of how \"invulnerable\" McCartney felt after Sgt. Pepper; it made the band's drug-taking public knowledge and confirmed the link between the album and drugs.", "Sgt. Pepper informed Frank Zappa's parody of the counterculture and flower power on the Mothers of Invention's 1968 album We're Only in It for the Money. By 1968, according to music critic Greil Marcus, Sgt. Pepper appeared shallow against the emotional backdrop of the political and social upheavals of American life. Simon Frith, in his overview of 1967 for The History of Rock, said that Sgt. Pepper \"defined the year\" by conveying the optimism and sense of empowerment at the centre of the youth movement. He added that the Velvet Underground's The Velvet Underground & Nico – an album that contrasted sharply with the Beatles' message by \"offer[ing] no escape\" – became more relevant in a cultural climate typified by \"the Sex Pistols, the new political aggression, the rioting in the streets\" during the 1970s. In a 1987 review for Q magazine, Charles Shaar Murray asserted that Sgt. Pepper \"remains a central pillar of the mythology and iconography of the late '60s\", while Colin Larkin states in his Encyclopedia of Popular Music: \"[it] turned out to be no mere pop album but a cultural icon, embracing the constituent elements of the 60s' youth culture: pop art, garish fashion, drugs, instant mysticism and freedom from parental control.\"", "In a 1976 article for The Village Voice, Christgau revisited the \"supposedly epochal Works of Art\" from 1967 and found that Sgt. Pepper appeared \"bound to a moment\" amid the year's culturally important music that had \"dated in the sense that it speaks with unusually specific eloquence of a single point in history\". Christgau said of the album's \"dozen good songs and true\", \"Perhaps they're too precisely performed, but I'm not going to complain.\" In his 1981 assessment, Simon Frith described Sgt. Pepper as \"the last great pop album, the last LP ambitious to amuse everyone\"."]}, {"page": "A Hard Day's Night (album)", "response": ["A Hard Day's Night was included in the list of \"100 Essential Rock Albums\" compiled by musicologists Charlie Gillett and Simon Frith for ZigZag magazine in 1975, and is one of the \"Treasure Island albums\" featured in Greil Marcus's 1979 book Stranded. In 2000, Q magazine placed A Hard Day's Night at number 5 on its list \"The 100 Greatest British Albums Ever\". That same year, it appeared at number 22 in Colin Larkin's book All Time Top 1000 Albums. In 2012, Rolling Stone ranked it 307th on the magazine's list of the 500 Greatest Albums of All Time. In the 2020 revision, it rose to number 263."]}, {"page": "Brian Wilson", "response": ["Writing in 1981, sociomusicologist Simon Frith identified Wilson's withdrawal in 1967, along with Phil Spector's self-imposed retirement in 1966, as the catalysts for the \"rock/pop split that has afflicted American music ever since\". By the mid-1970s, Wilson had tied with ex-Pink Floyd member Syd Barrett for rock music's foremost \"mythical casualty\". Hoskyns identified Wilson's retreat as \"central to the obsession many people have with his lost greatness.\" Timothy White wrote that Wilson's legend rivaled that of the California myth promoted by the Beach Boys."]}, {"page": "Mercury Prize", "response": ["All genres of music are eligible for entry, and it is stated that all are treated equally, with only the music on the album being taken into account. Simon Frith, chair of the Mercury Prize judging panel, has said that albums are chosen because they are the \"strongest\" each year, rather than according to genre. However, the presence of classical, folk and jazz recordings has been cited by some as anomalous, arguing that comparisons with the other nominees can be invidious. Classical acts to have an album nominated have included Sir John Tavener, Sir Peter Maxwell Davies, Gavin Bryars and Nicholas Maw. None has ever won, and there has not been a shortlisted classical album since 2002.", "It has also been noted that heavy metal has been overlooked by the prize.  A 2013 article by Vice on the Mercury Prize said \"Metal certainly never gets a look-in, not even on the official entry information form: 'The Prize is open to all types of music, including pop, rock, folk, hip-hop, R'n'B, dance, soul, jazz, blues, electronica, classical…'\" The only metal record that has ever been nominated for the Mercury Prize is Troublegum by Therapy? in 1994. In 2011, Mercury chair of judges Simon Frith said \"[Metal] is a niche that a lot of people don't listen to.\" In 2011, The Guardian music critic Alexis Petridis agreed that the Mercury Prize underrepresented heavy metal, but argued that this actually benefitted the genre because \"At least part of metal's appeal is its outsider status.\""]}, {"page": "Pet Sounds", "response": ["After 1974, Pet Sounds went out-of-print. In Granata's description, the album subsequently \"fell into obscurity\" and was \"relegated to the cutout bins\" for decades. Sociomusicologist Simon Frith wrote in 1981 that Pet Sounds continued to be largely regarded by \"the music world\" as a \"'weird' record\". Writing in the first edition of The Rolling Stone Record Guide (1979), Dave Marsh gave the album four stars (out of a possible five) and described it as a \"powerful, but spotty\" collection on which the least experimental songs proved to be the best. In 1985, he wrote that the album was now considered a \"classic\", elaborating: \"Pet Sounds wasn't a commercial flop, but it did signal that the group was losing contact with its listeners (a charge that could not be leveled against the Beatles during the same period)\". Granata offered that, by the time the album reappeared on compact disc in 1990, it was \"embraced by hard-core fanatics\" yet \"still considered an insider's record—a quasi-cult classic\". Historian Michael Roberts states that \"the album's induction into the canon of popular music\" arguably followed the release of its 1997 expanded edition, The Pet Sounds Sessions."]}, {"page": "The Who Sell Out", "response": ["In a contemporary review for Rolling Stone, Jann Wenner called The Who Sell Out \"fantastic\" and praised its \"exquisite\" sense of humor and the Who's \"consummate\" musicianship, which includes \"wholly original\" instrumentation and cleverly placed electronic sounds. Robert Christgau, writing in Esquire, said the album establishes the band as \"the third best not just in Britain but the world\", while citing \"Tattoo\" as the best song Townshend has \"ever written, worth the price of the album\". He later included the album in his \"basic record library\" of 1960s albums, published in Christgau's Record Guide: Rock Albums of the Seventies (1981). In a retrospective review for AllMusic, Richie Unterberger said that, \"on strictly musical merits, it's a terrific set of songs that ultimately stands as one of the group's greatest achievements.\" Sociomusicologist Simon Frith referred to it as a \"Pop art pop masterpiece\"."]}, {"page": "Europop", "response": ["*Simon Frith: Heard it before? You can blame it on the boogie. The Scotsman, 19 January 2000, ECM Publishers, Inc. 2000. HighBeam Research. 9 December 2013 (https://web.archive.org/web/20020331041952/http://highbeam.com/)"]}, {"page": "Autobahn (album)", "response": ["According to Patrick Codenys of the band Front 242, in the early 1970s most \"creative groups, were virtuosos like King Crimson and Yes whose music was based around sophisticated jam sessions. When I bought Autobahn I had the feeling that it was changing. For the first time, it was music that was impossible to touch – not being made up with the usual components of rock.\" Codenys said the music was made by only one person, which helped encourage him to make music on his own. Music critic Simon Frith stated disco heralded the future of music, and said \"Autobahn\" was the bridge between five minutes of unchanging rhythms of AM Radio and the 24-hour concerts by avant-garde musicians like Terry Riley."]}, {"page": "Suzi Quatro", "response": ["In August 1974, Simon Frith spotted a problem with the formula that was working outside the US, saying that "]}, {"page": "Music journalism", "response": ["Simon Frith said that pop and rock music \"are closely associated with gender; that is, with conventions of male and female behaviour\".Frith, Simon, \"Pop Music\" in S. Frith, W. Stray and J. Street, The Cambridge Companion to Pop and Rock (Cambridge University Press, 2001), p. 226. According to Holly Kruse, both popular music articles and academic articles about pop music are usually written from \"masculine subject positions\". Kembrew McLeod analyzed terms used by critics to differentiate between pop music and rock, finding a gendered dichotomy in descriptions of \"'serious,' 'raw,' and 'sincere' rock music as distinguished from 'trivial', 'fluffy,' and 'formulaic' pop music\". McLeod found that a likely cause of this dichotomy was the lack of women writing in music journalism: \"By 1999, the number of female editors or senior writers at Rolling Stone hovered around a whopping 15%, [while] at Spin and Raygun, [it was] roughly 20%.\"McLeod (2002) at 94, quoted in  Criticism associated with gender was graphically discussed in a 2014 Jezebel article about the struggles of women in music journalism, written by music critic Tracy Moore, previously an editor at the Nashville Scene. Moore described how another female music blogger, an \"admitted outsider\" who threatened no stereotypes, was greeted with enthusiasm by men, in contrast with Moore's own experiences as a self-described \"insider\" who was nevertheless expected to \"prove\" or \"earn\" her way into a male-dominated journalism scene."]}, {"page": "Fred Frith", "response": ["Frith was awarded the 2008 Demetrio Stratos Prize for his career achievements in experimental music. The prize was established in 2005 in honour of experimental vocalist Demetrio Stratos, of the Italian group Area, who died in 1979. In 2010 Frith received an honorary doctorate from the University of Huddersfield in West Yorkshire, England, in recognition of his contribution to music. Frith was Professor of Composition in the Music Department at Mills College in Oakland, California, until his retirement in 2018. He is the brother of Simon Frith, a music critic and sociologist, and Chris Frith, a psychologist at University College London."]}, {"page": "Tubular Bells", "response": ["Peel reviewed the album for The Listener magazine the following week, describing it as \"a new recording of such strength and beauty that to me it represents the first break-through into history that any musician has made\". The UK's major music magazines were also unanimous in their praise of the album. Al Clark of NME said that the \"veritable orgy of over-dubbing results in a remarkable piece of sustained music, never content with the purely facile yet equally disinclined towards confusing the listener\". He concluded that \"Tubular Bells ... is a superlative record which owes nothing to contemporary whims. It is one of the most mature, vital, rich and humerous [sic] pieces of music to have emerged from the pop idiom.\" Melody Makers Geoff Brown observed that \"Tubular Bells is a vast work, almost classical in its structure and in the way a theme is stated and deftly worked upon\" and that it was \"an enjoyable, evocative album which bodes well for the future of both the country's newest label and of Mike Oldfield\". Reviewing the whole batch of Virgin's first album releases in Sounds, Steve Peacock singled out Tubular Bells as the best of the bunch, saying that after careful listening he \"ended up convinced that it really is a remarkable album\", noting the \"complex, interlocking carefully woven music that works its way through an enormous dynamic and emotional range\", and stating, \"I can't think of another album that I'd as unhesitatingly recommend to everyone who's likely to read this\". A more reserved review came from Simon Frith in Let It Rock who felt that Tubular Bells was \"more than an attractive wall-paper, more than a nature-film score, because of Mike Oldfield's ability to make what happens to the music self-sufficient and satisfying\", but questioned why Peel and other critics viewed the album as rock music, and concluded that \"Oldfield's concern is the sound of rock, but Tubular Bells lacks rock's other essence — energy. This is no way body music — no sex, no violence, no ecstasy; nothing uncontrolled, nothing uncontrollable.\""]}, {"page": "Acid rock", "response": ["The earliest known use of the term \"garage punk\" appeared in Lenny Kaye's track-by-track liner notes for the 1972 anthology compilation Nuggets: Original Artyfacts from the First Psychedelic Era, 1965-1968, which prominently featured both acid rock and garage rock. Musicologist Simon Frith cites Nuggets as a showcase for the garage psychedelia of the 1960s and the transition between early 1960s garage rock and the more elaborate acid rock of the late 1960s. This acid rock present in the Nuggets anthology has been described as an offshoot of 1960s \"punk rock\". At the time, the term \"punk rock\" referred to the garage rock of the 1960s, such as that present in the Nuggets compilation. Bands such as Count Five, with their 1966 song \"Psychotic Reaction\", as well as other groups featured on Nuggets, would eventually epitomize the overlap between 1960s garage rock and psychedelic punk, or acid rock. As one of the first successful acid rock songs, \"Psychotic Reaction\" also contained the characteristics that would come to define acid rock: the use of feedback and distortion replacing early rock music's more melodic electric guitars."]}, {"page": "List of critics", "response": ["*Simon Frith"]}, {"page": "Mod (subculture)", "response": ["Mary Anne Long argued that \"first hand accounts and contemporary theorists point to the Jewish upper-working or middle-class of London’s East End and suburbs.\"Long, Mary Anne, A Cultural History of the Italian Motorscooter, senior thesis presented To Prof. Anne Cook Saunders on 17 December 1998, online at: www.nh-scooters.com/filemanager/download/11/php1C.pdf Simon Frith asserted that the mod subculture had its roots in the 1950s beatnik coffee bar culture, which catered to art school students in the radical Bohemian scene in London.Frith, Simon and Howard Horne, Art into Pop (1987), pp. 86–87 Steve Sparks, whose claim is to be one of the original mods, agrees that before mod became commercialised, it was essentially an extension of the beatnik culture: \"It comes from ‘modernist’, it was to do with modern jazz and to do with Sartre\" and existentialism. Sparks argued that \"Mod has been much misunderstood ... as this working-class, scooter-riding precursor of skinheads.\""]}, {"page": "Cock rock", "response": ["Cock rock is a musical genre. Philip Auslander uses Simon Frith's description of cock rock characteristics:", "The meaning of the term cock rock has changed over time. It was first mentioned by an anonymous author in the New York–based underground feminist publication Rat in 1970,T. Cateforis, The Rock History Reader (CRC Press, 2007), , p. 125. to describe the male-dominated music industry, and became a synonym for hard rock, emphasizing the aggressive expression of male sexuality, often misogynist lyrics and use of phallic imagery.R. Shuker, Popular Music: the Key Concepts (Abingdon: Routledge, 2005, 2nd edn., 2005), , pp. 130-1. The term was used by sociologists Simon Frith and Angela McRobbie in 1978 to point to the contrast between the male-dominated subculture of cock rock which was \"aggressive, dominating and boastful\" and the more feminized teenybop stars of pop music.M. Leonard, Gender in the Music Industry: Rock, Discourse and Girl Power (Aldershot: Ashgate Publishing, 2007), , pp. 24-6. Led Zeppelin have been described as \"the quintessential purveyors of 'cock rock'\".S. Waksman, Instruments of Desire: the Electric Guitar and the Shaping of Musical Experience (Cambridge, MA: Harvard University Press, 2001), , pp. 238-9. Other formative acts include the Rolling Stones, The Who and Jim Morrison of The Doors.P. Auslander, Performing Glam Rock: Gender and Theatricality in Popular Music (University of Michigan Press, 2006), , p. 201."]}, {"page": "All You Need Is Love", "response": ["In a 1981 article on the musical and societal developments of 1967, sociomusicologist Simon Frith described \"All You Need Is Love\" as a \"genuinely moving song\" and said that, further to the impact of Sgt. Pepper, the international broadcast confirmed \"the Beatles' evangelical role\" in a year when \"it seemed the whole world was waiting for something new, and the power of music was beyond doubt.\" Available at Rock's Backpages (subscription required). Psychiatrist and New Left advocate R.D. Laing wrote about the song's contemporary appeal:"]}, {"page": "Aesthetics of music", "response": ["Simon Frith (2004, p. 17-9) argues that, \"'bad music' is a necessary concept for musical pleasure, for musical aesthetics.\" He distinguishes two common kinds of bad music: the Worst Records Ever Made type, which include \"Tracks which are clearly incompetent musically; made by singers who can't sing, players who can't play, producers who can't produce,\" and \"Tracks involving genre confusion. The most common examples are actors or TV stars recording in the latest style.\" Another type of \"bad music\" is \"rock critical lists,\" such as \"Tracks that feature sound gimmicks that have outlived their charm or novelty\" and \"Tracks that depend on false sentiment [...], that feature an excess of feeling molded into a radio-friendly pop song.\""]}, {"page": "A Whiter Shade of Pale", "response": ["According to music historian Harvey Kubernik, in the context of the Summer of Love, \"A Whiter Shade of Pale\" was the \"one song [that] stood above all others, its Everest-like status conferred by no less than John Lennon and Paul McCartney, who were enthralled by the Chaucerian wordplay and heavenly Baroque accompaniment\". Kubernik also writes that, amid the search for higher consciousness during the flower power era, the song \"galvanised a congregation of disaffected youth dismissive of traditional religion but anxious to achieve spiritual salvation\". In his 1981 article on the musical and societal developments of 1967, for The History of Rock, sociomusicologist Simon Frith described \"A Whiter Shade of Pale\" as the year's \"most distinctive single\", through its combination of \"white soul vocal and a Bach organ exercise\" and enigmatic lyrics that \"hinted at a vital secret open only to people in the right, drug-determined, state of mind\". Available at Rock's Backpages (subscription required). Beach Boys leader Brian Wilson had a profound reaction to hearing the song and momentarily believed that it was his funeral march; in a 2004 interview, he said, \"When I hear it now, I [still] imagine myself at my own funeral.\""]}, {"page": "Pantheon Books", "response": ["* Sound Effects: Youth, Leisure, and the Politics of Rock'n'Roll by Simon Frith (1981)", "* On Record: Rock, Pop, and the Written Word by Simon Frith and Andrew Goodwin (1990)"]}, {"page": "Pop rock", "response": ["Critic Philip Auslander argues that the distinction between pop and rock is more pronounced in the US than in the UK. He claims that in the US, pop has roots in white crooners such as Perry Como, whereas rock is rooted in African-American music influenced by forms such as rock and roll. Auslander points out that the concept of pop rock, which blends pop and rock, is at odds with the typical conception of pop and rock as opposites. Auslander and several other scholars, such as Simon Frith and Grossberg, argue that pop music is often depicted as an inauthentic, cynical, \"slickly commercial\", and formulaic form of entertainment. In contrast, rock music is often heralded as an authentic, sincere, and anti-commercial form of music, which emphasizes songwriting by the singers and bands, instrumental virtuosity, and a \"real connection with the audience\".P. Auslander, Liveness: Performance in a Mediatized Culture  (London: Taylor & Francis, 1999), .", "Simon Frith's analysis of the history of popular music from the 1950s to the 1980s has been criticized by B. J. Moore-Gilbert, who argues that Frith and other scholars have over-emphasized the role of rock in the history of popular music by naming every new genre using the \"rock\" suffix. Thus when a folk-oriented style of music developed in the 1960s, Frith termed it \"folk rock\", and the pop-infused styles of the 1970s were called \"pop rock\". Moore-Gilbert claims that this approach unfairly puts rock at the apex and makes every other influence become an add-on to the central core of rock.B. J. Moore-Gilbert, The Arts in the 1970s: Cultural Closure? (London: Routledge, 1994), , p. 240."]}, {"page": "Siren (Roxy Music album)", "response": ["In a contemporary review of Siren for Melody Maker, critic Allan Jones praised it as \"a superb album, striking the listener immediately with a force and invention reserved only for the most special musical experiences\". He noted a \"crispness and vitality\" in Chris Thomas's production, which he felt showcased \"the sense of adventure and cavalier spirit which marked their early recordings, an impetuosity which has lately been absent from their work.\" Rolling Stone writer Simon Frith highlighted the album's more \"focused\" lyrical imagery and streamlined production, noting \"less synthesized clutter, fewer sound effects, more straight solo trading.\" Robert Christgau of The Village Voice found the album's more pop-leaning sound to be revelatory: \"Of course, Roxy Music albums have always had hooks, but 'Street Life' and 'Virginia Plain' never told us as much about Roxy's less accessible music as 'Love Is the Drug'\". He ranked it the 11th best album of 1975 in his year-end \"Dean's List\". Siren placed at number 13 on The Village Voices 1975 Pazz & Jop critics' poll."]}, {"page": "Back to Bedlam", "response": ["Blunt had piano and violin lessons as a child, but his first significant exposure to popular music was at Harrow School. There, he was introduced to the guitar by a fellow student, and started playing the instrument and writing songs at age 14. At University of Bristol, his undergraduate thesis was The Commodification of Image – Production of a Pop Idol; one of his main references for the thesis was sociologist and rock critic, Simon Frith, chairman of the Mercury Music Prize panel of judges since 1992."]}, {"page": "Baby, You're a Rich Man", "response": ["According to author and critic Ian MacDonald, Lennon was most likely inspired to write the verses after attending the 14 Hour Technicolor Dream, an all-night festival held at Alexandra Palace in north London on 29 April 1967. Attended by 10,000 people,Cushley, Joe. \"Dream On!\". In: . this musical and performance art event was a fundraiser for the proprietors of the underground newspaper International Times, after a police raid had forced the closure of their offices; in MacDonald's description, it marked the first large-scale coming together of Britain's \"beautiful people\". Writing in 1981 on the musical and societal developments of 1967, sociomusicologist Simon Frith said that this event was one of the \"multi-media happenings\" that reflected the new aesthetic represented by English psychedelia, whereby \"Dancing became less important than listening\" and fashion embraced vivid colours while retaining \"the mod concern for looking smart\". Frith added: \"Psychedelia was essentially elitist but the joy of psychedelic pop was that it made everyone part of the elite.\" Available at Rock's Backpages (subscription required)."]}, {"page": "Flash and the Pan (album)", "response": ["Reviews of Flash and the Pan’s 1978 self-titled album are ambivalent about the vocal style and lyrics, fascinated by the weirdness, but upbeat and sometimes glowing in their overall assessment. Alan Niester in The Globe and Mail calls the album “surrealistic in its detachment at times”, and “one of the strangest but ultimately finest records to surface in the seventies”. Niester concludes that the album is \"the closest thing to a masterpiece we're likely to get this year, and you have to have it\". David Fricke in Rolling Stone notes unfavourably the “rampant punning” and “mind games” of the lyrics, but says that the songwriters, Vanda & Young, “never underestimate the simple joy of a good hummable tune”. The same reviewer goes on to say that the album is a “flawlessly executed operetta of applied rock & roll knowledge”. Steve Simels in Stereo Review calls the album a “minor pop masterpiece” but says that the synthesiser sound “verges on Eurodisco, with some tacky New Wave organ”. Simels describes the lyrics as “frankly melodramatic […] declaimed (in the verses) more often than sung”. But Simels gives up trying to pigeonhole the record with, “Let’s just say that it’s excellent music and let it go at that.” Jon Pareles, writing for Creem says Flash and the Pan’s songs are “incorrigibly catchy” but he earlier notes the detachment of the vocal style and the insincerity of lyrics; like Simels, he counters his own criticism, saying, “[If] You want sincerity, go watch Merv Griffin.” Simon Frith in Melody Maker factors the experience of Vanda & Young into the album’s “pop mastery, [which is] evident in the hooks, the minor chords, the insidious orchestrations”. When Frith goes on to express doubts about the “bland monotone” of the vocals, saying that it “adds to the joke, but I’m not sure it adds to the pleasure”, he later adds, “But then I’m still listening to this LP, and Vanda and Young may be cleverer than I think, and make easy listening out of this robotic sound\"."]}]}}