{"wiki_id": "http://www.wikidata.org/entity/Q3498638", "itemLabel": "Stephen Glanville", "itemDescription": "British egyptologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Glanville", "wikipedia_page": {"main": "Stephen Ranulph Kingdon Glanville, MBE (26 April 1900 – 26 April 1956) was an English historian and egyptologist.\n\n", "link_mentions": [{"page": "Amarna", "response": ["From 1921 to 1936 an Egypt Exploration Society expedition returned to excavation at Amarna under the direction of T.E. Peet, Sir Leonard Woolley, Henri Frankfort, Stephen GlanvilleGrundon(2007), p. 71 and John Pendlebury. Mary Chubb served as the digs administrator. The renewed investigations were focused on religious and royal structures."]}, {"page": "Royal Institution Christmas Lectures", "response": ["| Stephen Glanville"]}, {"page": "Edwards Professor of Egyptian Archaeology and Philology", "response": ["* 1934–1946: Stephen Glanville"]}, {"page": "Death Comes as the End", "response": ["The suggestion to base the story in ancient Egypt came from noted Egyptologist and family friend Stephen Glanville. He also assisted Christie with details of daily household life in Egypt 4000 years ago. In addition he made forceful suggestions to Christie to change the ending of the book. This she did but regretted the fact afterwards, feeling that her (unpublished) ending was better. The novel is based on real letters translated by egyptologist Battiscombe Gunn, from the Egyptian Middle Kingdom period, written by a man called Heqanakhte to his family, complaining about their behaviour and treatment of his concubine.BBC: Voices from Ancient Egypt Gallery"]}, {"page": "Sir Herbert Thompson Professor of Egyptology", "response": ["*Stephen Glanville, 1946–1956"]}, {"page": "Stephen Ranulph Kingdon Glanville", "response": ["#REDIRECT Stephen Glanville"]}, {"page": "Glanville", "response": ["*Stephen Glanville (1900–1956), English Egyptologist"]}, {"page": "Akhnaton (play)", "response": ["Akhnaton is a play by Agatha Christie. It was written in 1937, around the same time she was writing Death on the Nile. It is set in Ancient Egypt, and followed the exploits of the Egyptian Pharaoh Akhnaton, his wife Nefertiti and his successor Tutankhaton (who would take the name Tutankhamun when he became Pharaoh). In writing the play, Christie was assisted by the eminent Egyptologist, Stephen Glanville,Morgan, Janet. Agatha Christie, A Biography. p. 226. Collins, 1984.  who was a friend of both her and her husband, Max Mallowan."]}, {"page": "Xia Nai", "response": ["Xia left for his studies at University College London in June 1935 and arrived in the United Kingdom in September later that year.Xia, Diary of Xia Nai, Volume 1, pp.367-402. By the time of his studies, Sir Flinders Petrie had already retired from the university and it was Sir Mortimer Wheeler who was heading the Institute of Archaeology and the archaeology course at University College London. Xia learned Ancient Egyptian hieroglyphics under professor Stephen Glanville.Xia, Diary of Xia Nai, Volume 2, pp.100-2. While many of his professors were well established and knowledgeable, Xia criticized Walter Perceval Yetts, one of his professors in archeology for his incompetence in both Chinese and archaeology, and challenged his ironic role in heading the department of Chinese Art and Archaeology at London University. He pointed out how Yetts could not read Chinese when a student raised a question during a lecture and how he struggled to comprehend dynastic jargon when analyzing the authenticity of an original record by the Qing imperial court kept in the British Museum.Xia, Diary of Xia Nai, Volume 2, pp.120-1. Xia accumulated a handful of field experience in archaeology by participating in Wheeler's excavation at Maiden Castle in Dorset in July 1936 and returned to London in September later that year.Xia, Diary of Xia Nai, Volume 2, pp.78-96. He also participated in the British's excavation project in Armant, Egypt and Tell Duweir, Palestine. Xia visited Petrie during his time in Palestine as the latter was recovering in a hospital in Jerusalem. Despite being far away from home, he always kept himself updated on China's ever-changing situation through reading the newspaper and having conversations with fellow Chinese students studying abroad.Xia, Diary of Xia Nai, Volume 2, pp.102-3. Due to the outbreak of the Second World War, Xia left for home in 1939. However, Xia spent a year conducting Egyptology research at the Cairo Museum for almost a year and only arrived at Kunming, China in 1941.", "Sir William Flinders Petrie put together a collection of ancient Egyptian beads after his excavations in Egypt but was never able to fully assess the collection, yet he stated that 'beads with pottery constitute the alphabet of archaeological research', emphasizing the potential benefits of studying the beads. Inspired by Petrie, Xia decided to conduct the organization and assessment of the ancient Egyptian beads collection (Petrie Collection) as his doctoral dissertation under the supervision of Stephen Glanville."]}, {"page": "Come, Tell Me How You Live", "response": ["She added, \"It is only now that I fully realise, looking back over my wartime output, that I produced an incredible amount of stuff over those years.\"Christie. An Autobiography. (p. 509). One of those books was Come, Tell Me How You Live. She wrote this book \"out of nostalgia\" feeling badly the separation from Max and wanting to recapture the \"poignant remembrance of our days in Arpachiyah and Syria.\" She admitted herself that it was \"light-hearted and frivolous\" but that it was an accurate reflection of the time and events that the book portrays.Christie. An Autobiography. (p. 500). Christie finished the book in June 1945, one month after a delighted reunion with her husband and passed it round for comment and opinion about the suitability for publication. Supportive of the work was Stephen Glanville (who had previously assisted with the play Akhnaton and pushed Christie into writing Death Comes as the End), Edmund Cork and Max himself to who it was given as a homecoming present. Less enthusiastic was Sidney Smith, Keeper of the Department of Egyptian and Assyrian Antiquities at the British Museum. He was a family friend and cautioned her that, \"while the whole thing is thoroughly enjoyable reading, I am not quite sure that you would be wise to print it at all.\"Morgan. (p. 252)."]}, {"page": "List of provosts of King's College, Cambridge", "response": ["|Stephen Glanville"]}, {"page": "Index of ancient Egypt–related articles", "response": ["* Stephen Glanville"]}, {"page": "Veronica Seton-Williams", "response": ["Veronica was educated at home until 1925 when she attended Clyde Girls Grammar School. In 1934 she graduated from the University of Melbourne with an undergraduate degree in history and political science and in the same year moved to England to study under Mortimer Wheeler at the Institute of Archaeology, University College London. She initially enrolled for a degree in Egyptology, under professor Stephen Glanville, but was persuaded to read British prehistory instead, going on to complete a Ph.D. on Syrian Archaeology in 1957.M. V. Seton-Williams, \"The Road to El-Aguzein\", 1988, 23, 113. During that time she excavated at Maiden Castle, Dorset (1934-1936) with Mortimer Wheeler, and went on to excavate at Sheikh es-Zuweid at the Sinai Peninsula (1935-1936) with Flinders Petrie, in Palestine and Turkey (1936-1937) with John Garstang, and Tell el-Duweir (1937-1938).M. L. Bierbrier (eds.), \"Who was who in egyptology\", 2012, 503-504  She also worked with E. Cecil Curwen on the 1935 excavation of Whitehawk Camp, in Brighton.Curwen (1936), p. 61."]}, {"page": "Violette Lafleur", "response": ["Lafleur entered the Department of Egyptology, University College London (UCL) as a non-degree student. She was close friends with Stephen Glanville, the Edwards Professor of Egyptology at UCL, whose wife Ethel had been at school with her. Lafleur became part of Glanville's new programme of curatorial, cataloguing and conservation work in the Petrie Museum.H. S. Smith (1988), 'The reopening of the Petrie Museum of Egyptian Archaeology', The EES Newsletter No. 3 October 1988: 3 In 1935 she started to work in the museum as a general assistant and also began conservation training at the British Museum. Soon afterwards she begin conservation work on the museum objects. She also accompanied Glanville on his 1936 autumn visit to Egypt and attended excavations at El-Amarna and Armant.Janssen, 1992: 33 In 1939 Lafleur became 'Honorary Museum Assistant' and was responsible for photography in the museum, giving six lectures on object conservation."]}, {"page": "Margaret Stefana Drower", "response": ["Drower was the daughter of Edwin Drower, a British diplomat, and Ethel Stefana Drower, an anthropologist, specialist on the Mandaeans and (under the name E. S. Stevens) a well-published author of romantic novels. She was a student of Flinders Petrie, Margaret Murray and Stephen Glanville, and become one of the first Egyptology graduates from University College London (UCL).", "Drower's excavations included Armant with O. H. Myers, Robert Mond and Ali Suefi, and at Amarna with John Pendlebury. Stephen Glanville recommended her for a post in the History department at UCL."]}, {"page": "Jack Plumley", "response": ["While in London, Plumley began taking classes in Egyptology with Stephen Glanville at University College London. After the War, Glanville was appointed Sir Herbert Thompson Professor of Egyptology in Cambridge; Plumley became his assistant, and, on Glanville's death in 1956, his successor. He was chairman of the Department of Egyptology from 1957 until 1977. Plumley wrote numerous books, articles, and essays, and oversaw excavations including those at Qasr Ibrim ahead of the flooding caused by the Aswan Dam. He discovered and published the scrolls of Bishop Timothy of Faras. He was elected a member of the Society of Antiquaries of London in 1966. From 1978 to 1982 he was president of the International Society for Nubian Studies."]}, {"page": "Elise Jenny Baumgartel", "response": ["When the Nazi Party seized power in Germany in 1933, Baumgartel (who was Jewish) lost her state funding. She was forced to flee to England the following year. For a number of years her family (three children from an earlier marriage to art historian Hubert Baumgartel) was dependent on refugee charities. The archaeological and Egyptological communities in England rallied to obtain monetary support for her work: Sir John L. Myres arranged a grant for her to compile a bibliography of prehistoric Italy and Malta, and she also taught evening classes on the Egyptian language for University College London (UCL). This however did not occupy much of her time, so in 1936 she approached Stephen Glanville, the head of UCL's Egyptology department, for permission to work with the department's collections (what would become the Petrie Museum). The department had recently obtained the substantial personal collection of Glanville's predecessor, Sir Flinders Petrie, which was uncatalogued and poorly labelled. Glanville therefore enthusiastically accepted Baumgartel's offer, and arranged for her work to be supported by the Petrie collection's patron Sir Robert Mond, and later by the department itself."]}, {"page": "Glanville, Stephen", "response": ["#redirectStephen Glanville"]}, {"page": "Harry Smith (Egyptologist)", "response": ["Smith was born on 14 June 1928 to Sidney Smith, FBA, an Assyriologist and curator, and his wife Mary (nee Parker), an artist. He was educated at Merchant Taylors' School, Northwood, an all-boys independent school. He went on to study classics and Egyptology at Christ's College, Cambridge, graduating with a Bachelor of Arts (BA) degree in 1953: as per tradition, his BA was later promoted to a Master of Arts (MA Cantab) degree. He then studied Demotic, a late Ancient Egyptian script, under Stephen Glanville. He was awarded a Doctor of Letters (DLit) degree by the University of London in 1987."]}, {"page": "A. F. Shore", "response": ["Shore was born on 14 November 1924 in Aldbury, Hertfordshire, England. He was educated at Cardinal Vaughan Memorial School, then an independent Catholic school in London. He studied classics at King's College, University of Cambridge, graduating with a Bachelor of Arts (BA) degree in 1949. His university studies were interrupted by service in the British Army during the Second World War. He then took a second undergraduate degree in Oriental studies, and specialised in Egyptology under Stephen Glanville, achieving first class honours in 1952."]}]}}