{"wiki_id": "http://www.wikidata.org/entity/Q3496041", "itemLabel": "Thomas Keith", "itemDescription": "British surgeon and photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Keith_(surgeon)", "wikipedia_page": {"main": "Thomas Keith FRCSEd (27 May 1827 – 9 October 1895 ) was a Victorian surgeon and amateur photographer from Scotland. He developed and improved the wax paper process and his photographs are recognised for their composition and use of shade. He was an early practitioner of the operation of ovariotomy (ovarian cystectomy) where his published results were amongst the best in the world.\n\n", "link_mentions": [{"page": "Thomas Keith", "response": ["Thomas Keith may refer to:", "*Thomas Keith (film director), American filmmaker, educator and anti-sexist activist", "*Thomas Keith (politician) (1863–1916), British Columbian politician", "*Thomas Keith (surgeon) (1827–1895), Scottish surgeon and amateur photographer", "*Thomas Keith (soldier) (died 1815), Scottish soldier who converted to Islam"]}, {"page": "Thomas Keith (doctor)", "response": ["#REDIRECT Thomas Keith (surgeon)"]}, {"page": "William Walker (surgeon)", "response": ["Walker was a member of the Edinburgh Photographic Exchange Club and a founder member of the Photographic Society of Scotland.Taylor, Roger and Schaaf, Larry (2007) Impressed by Light: British Photographs from Paper Negatives, 1840-1860. Yale University Press. p387 So too was his friend Thomas Keith, a fellow surgeon who was a gifted photographer and was his neighbour at 58 Northumberland Street. Walker experimented with photographic technique and equipment and in 1856 published his design for a portable camera.Walker, W. Mr Walker's portable camera. Photographic Notes 1856:1;131-132 When processing calotypes he showed a surgeon's concern  with both care in the manipulation of the paper and 'the strictest attention to cleanliness...' He believed that 'the best prints were obtained from an unwaxed negative as the...half tints were much more delicate.'Abstract of Mr Walker's paper on the calotype process. Photographic Notes 1856;1:77-78 He exhibited regularly at the Photographic Society of Scotland and in 1859 at the Aberdeen meeting of the British Association for the Advancement of Science.Taylor, Roger and Schaaf, Larry (2007) Impressed by Light: British Photographs from Paper Negatives, 1840-1860. Yale University Press Walker was a member of the Edinburgh Botanical Society and at a time when plants  still had an important role in medicine he took photographs of medicinal and uncommon plants.Stevenson, S. and Morrison-Low, A.D.  Scottish Photography: The First Thirty Years. Edinburgh: National Museums of Scotland, 2015. p181 "]}]}}