{"wiki_id": "http://www.wikidata.org/entity/Q349302", "itemLabel": "Barry Bridges", "itemDescription": "English footballer (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Bridges", "wikipedia_page": {"main": "Barry John Bridges (born 29 April 1941) is an English former footballer who played in the Football League for Chelsea, Birmingham City, Queens Park Rangers, Millwall and Brighton & Hove Albion and was capped four times for England.", "link_mentions": [{"page": "Peter Bonetti", "response": ["Chelsea were relegated in Bonetti's second full season, which saw the appointment of Tommy Docherty as manager. Bonetti emerged as a key figure in a talented young team which included Bobby Tambling, Terry Venables, John Hollins and Barry Bridges. The team went into the penultimate match of the season needing to beat promotion rivals Sunderland to have a chance of going up. Chelsea won 1–0, with Bonetti making a brilliant last minute save to deny George Mulhall and maintain his team's promotion chances; a 7–0 win over Portsmouth secured instant promotion back to the First Division."]}, {"page": "Millwall F.C.", "response": ["|1971|| Barry Bridges"]}, {"page": "Terry Venables", "response": ["He went on to lift the League Cup with Chelsea, and scored a penalty against Leicester City in the two-legged final. Chelsea also reached the semi-finals of the FA Cup in 1964–65, where they were knocked out by Liverpool. With three games left to play they were also in with an outside chance of overtaking Manchester United and Leeds United to win the league title, but Chelsea lost the first of these games 2–0 to Liverpool at Anfield. Docherty reversed his decision to allow the players a night out after the game, but Venables and seven other players (George Graham, Barry Bridges, John Hollins, Marvin Hinton, Eddie McCreadie, Joe Fascione, and Bert Murray) broke curfew and went out for a brief night out. Upon their return to the team hotel Docherty suspended all eight players for the remainder of the season. Chelsea then lost 6–2 to Burnley, before Docherty reinstated the players for a final day defeat to Blackpool. Venables never forgave Docherty for the punishment, describing it as \"crass, stupid and self-defeating\". Docherty placed Venables on the transfer list towards the end of the 1965–66, with Chelsea again heading towards a fifth-place finish."]}, {"page": "Tommy Docherty", "response": ["During his first year in charge he sold many of the club's older players and brought in new ones such as Terry Venables, Bobby Tambling, Peter Bonetti and Barry Bridges. He also changed the club's home colours, switching from white shorts to blue shorts, the combination that remains as of 2022. The team, nicknamed \"Docherty's Diamonds\", achieved promotion back to Division One in their first attempt and finished fifth the following year. In 1964–65, Chelsea won the League Cup in April with an aggregate win over Leicester City, but in the FA Cup were beaten 2–0 in the semi-final by eventual winners Liverpool."]}, {"page": "St Patrick's Athletic F.C.", "response": ["* Barry Bridges", "* Barry Bridges (1976–78)", "|style=\"text-align: left;width:150px;\"|Barry Bridges"]}, {"page": "Rodney Marsh", "response": ["In summer 1969 Marsh was sent off in a friendly against Rangers after punching Kai Johansen in retaliation for a kick Johansen gave Marsh. In the 1969–70 season he and Barry Bridges shared 46 goals equally between them, as QPR finished in ninth position. They also reached the quarter-finals of the FA Cup, which was then the club's joint-best achievement in the competition."]}, {"page": "Bobby Tambling", "response": ["A talented schoolboy footballer who played for England schoolboys, his signature as a professional player was sought out by several teams including Reading, Wolverhampton Wanderers and the club he supported as a boy, Blackpool. Having met scout Jimmy Thompson and manager Ted Drake Tambling joined Chelsea as a fifteen-year-old in 1957. He made his debut, aged seventeen in 1959 scoring in a 3–2 win against West Ham United. Two years later, following the transfer of Jimmy Greaves to AC Milan, he became Chelsea's main striker and was their leading goal scorer for five seasons in the 1960s. Forming a partnership with Barry Bridges, Tambling was made club captain in 1962 by manager Tommy Docherty after Chelsea's relegation to the Second Division. With Docherty adding new players Terry Venables and Peter Bonetti Chelsea made an immediate return to the top flight with Tambling as their top scorer as he was in their first season back in the top division."]}, {"page": "Second City derby", "response": ["| Barry Bridges"]}, {"page": "History of Chelsea F.C.", "response": ["Chelsea thus returned to the First Division with a new, youthful team which included the uncompromising Ron \"Chopper\" Harris (who would set a club record of 795 senior appearances), goalkeeper Peter Bonetti, prolific goalscoring winger Bobby Tambling (whose 202 goals remained a club record until 2013), midfielder John Hollins, full-back Ken Shellito, striker Barry Bridges, winger Bert Murray and captain and playmaker Terry Venables, all products of the youth system. To these, Docherty added striker George Graham, left-back Eddie McCreadie and elegant defender Marvin Hinton for minimal fees to complete the Diamonds line-up – Docherty had referred to the team as his \"little diamonds\" during a TV documentary and the name stuck."]}, {"page": "West London derby", "response": ["*QPR 2–4 Chelsea (21 February 1970) – In 1970, Chelsea and QPR were drawn to face each other in the FA Cup quarter-finals. Chelsea's Alan Hudson described it as a \"fantastic draw\", owing to the rivalry between the two clubs. To add further spice, QPR were fielding two former Chelsea players, Terry Venables and Barry Bridges, as well as their star striker, Rodney Marsh. In an entertaining match, despite the poor pitch, Chelsea were 2–0 up within eight minutes thanks to Peter Osgood and David Webb, before a twice-taken Venables penalty put Rangers back in contention. As Rangers threatened to equalise, Osgood scored twice more to complete his hat-trick and put the result beyond doubt; Bridges grabbed a late consolation for his side. Chelsea would ultimately go on to win the cup that season.", "*Barry Bridges Striker 1960s and 1970s."]}]}}