{"wiki_id": "http://www.wikidata.org/entity/Q349508", "itemLabel": "J. T. McIntosh", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/J._T._McIntosh", "wikipedia_page": {"main": "James Murdoch MacGregor, (14 February 1925 – 22 July 2008) was a Scottish journalist and author best known for writing science fiction under the pen name J.T. McIntosh.", "link_mentions": [{"page": "List of science-fiction authors", "response": ["*J. T. McIntosh (1925–2008)"]}, {"page": "Apocalyptic and post-apocalyptic fiction", "response": ["In J. T. McIntosh's novel One in Three Hundred (1954), scientists have discovered how to pinpoint the exact minute, hour, and day the Sun will go \"nova\" – and when it does, it will boil away Earth's seas, beginning with the hemisphere that faces the sun, and as Earth continues to rotate, it will take only 24 hours before all life is eradicated. Super-hurricanes and tornadoes are predicted. Buildings will be blown away. A race is on to build thousands of spaceships for the sole purpose of transferring evacuees on a one-way trip to Mars. When the Sun begins to go nova, everything is on schedule, but most of the spaceships turn out to be defective, and fail en route to Mars."]}, {"page": "List of science fiction short stories", "response": ["|J. T. McIntosh", "| J. T. McIntosh", "| J. T. McIntosh"]}, {"page": "List of science fiction novels", "response": ["* Flight from Rebirth by J. T. McIntosh", "* One in Three Hundred by J. T. McIntosh", "* Six Gates from Limbo by J. T. McIntosh", "* Snow White and the Giants by J. T. McIntosh", "* Transmigration by J. T. McIntosh"]}, {"page": "Spock's Brain", "response": ["* \"Machine Made\", a 1951 short story written by J. T. McIntosh"]}, {"page": "X Minus One", "response": ["Included in the series were adaptations of Robert Sheckley's \"Skulking Permit\", Bradbury's \"Mars Is Heaven\", Heinlein's \"Universe\" and \"The Green Hills of Earth\", Pohl’s \"The Tunnel under the World\", J. T. McIntosh’s \"Hallucination Orbit\", Fritz Leiber’s \"A Pail of Air\", and George Lefferts' \"The Parade\".OTR Plotspot: X Minus One"]}, {"page": "New Worlds (magazine)", "response": ["The acquisition of Nova Publications by Maclaren in 1954 gave New Worlds the stability to establish itself as a leading magazine.  Ashley describes the period from 1954 to 1960 as a \"Golden Age\" for New Worlds.  Carnell bought J. G. Ballard's first sale, \"Escapement\", which appeared in the December 1956 New Worlds; Ballard went on to become a significant figure in the genre in the 1960s.Ashley, Transformations, pp. 96–101. Ballard was grateful to Carnell for the support he provided Ballard in the late 1950s.  Much of Ballard's work appeared in New Worlds and Science Fantasy, and Ballard later recalled that Carnell \"recognized what I was on about from a very early stage and he encouraged me to go on writing in my own way.\"Quoted in Ashley, Transformations, p. 148.  Carnell also published much of Brian Aldiss's early work in Science Fantasy and New Worlds.  John Brunner, later to become one of the most successful British science fiction writers, appeared regularly in the Nova magazines, starting with \"Visitors' Book\" in the April 1955 New Worlds.  James White began publishing with \"Assisted Passage\" in the January 1953 New Worlds, and in 1957 began his popular Sector General series, about a hospital for aliens, with \"Sector General\" in the November 1957 issue. John Wyndham, who was already well known outside the genre for works such as The Day of the Triffids,John Clute, \"John Wyndham\", in Clute & Nicholls, Encyclopedia of Science Fiction, pp. 1353–1354. began a series about the Troons, a space-going family, with \"For All the Night\" in the April 1958 issue.Ashley, Transformations, pp. 142–143.  Arthur C. Clarke, another successful British sf writer of the period, wrote relatively few short stories for the British market, but published \"Who's There\" in the November 1958 New Worlds.  Colin Kapp began his popular \"Unorthodox Engineers\" series with \"The Railways up on Cannis\", in October 1959.Ashley, Transformations, pp. 145–149.  Other less well-known writers who were prolific during the late 1950s included J. T. McIntosh, Kenneth Bulmer, and E. C. Tubb."]}, {"page": "Captain Video and His Video Rangers", "response": ["In the early days of the series, the show featured often incoherent scripts, along with jarring plot shifts to old cowboy movies. This led to derision of the show by the critics of the day, although it always was wildly popular with kids and many adults. This improved after 1952 when scripts began being written by such major science fiction writers active at the time as Damon Knight, James Blish, Jack Vance, and Arthur C. Clarke. These late scripts displayed more intelligence, discipline and imagination than most of the other children's sci-fi series scripts of the era. Other well-known authors who occasionally wrote for the program included Isaac Asimov, Cyril M. Kornbluth, Milt Lesser, Walter M. Miller, Jr., Robert Sheckley, J. T. McIntosh, and Robert S. Richardson. One of the more prolific writers for the show was Maurice C. Brachhausen—who wrote under the name M.C. Brock, and later had his own production company, Brock Video Productions."]}, {"page": "List of Ace double titles", "response": ["*D-113 SF Dwight V. Swain The Transposed Man / J. T. McIntosh One in 300 (1955)", "*F-113 SF Charles L. Fontenay Rebels of The Red Planet / J. T. McIntosh 200 Hundred Years to Christmas (1961)"]}, {"page": "Laser Books", "response": [":24. Ruler of the World by J. T. McIntosh, 1976, "]}, {"page": "Divine Right", "response": ["* \"Divine Right\", a 1954 short story by J. T. McIntosh"]}, {"page": "List of Ace titles in first DGS series", "response": ["*D-113 SF Dwight V. Swain The Transposed Man / J. T. McIntosh One in 300 (1955)"]}, {"page": "List of Ace titles in F series", "response": ["*F-113 SF Charles L. Fontenay Rebels of The Red Planet / J. T. McIntosh 200 Years to Christmas (1961)"]}, {"page": "List of Ace SF double titles", "response": ["*D-113 SF Dwight V. Swain The Transposed Man / J. T. McIntosh One in 300 (1955)", "*F-113 SF Charles L. Fontenay Rebels of The Red Planet / J. T. McIntosh 200 Hundred Years to Christmas (1961)"]}, {"page": "World Out of Mind!", "response": [":World Out of Mind is also the title of a science fiction novel by J. T. McIntosh"]}, {"page": "The Road to Science Fiction", "response": ["* \"Made in U.S.A.,\" by J. T. McIntosh"]}, {"page": "List of X Minus One episodes", "response": ["| J. T. McIntosh (adapted by Ernest Kinoy)"]}, {"page": "J T McIntosh", "response": ["#REDIRECT J. T. McIntosh "]}, {"page": "J.T. McIntosh", "response": ["#REDIRECT J. T. McIntosh "]}, {"page": "JT McIntosh", "response": ["#REDIRECT J. T. McIntosh "]}, {"page": "The Best Science Fiction Stories: 1954", "response": ["* \"One in Three Hundred\", by J. T. McIntosh"]}, {"page": "One in Three Hundred", "response": ["One in Three Hundred is a science fiction novel by British writer J. T. McIntosh.  It was originally published as three novellas in The Magazine of Fantasy and Science Fiction in 1953-54, and was then published by Doubleday & Company, Inc..  During 1956 the novel was reissued by Ace as Ace Double D-113, in a dos-à-dos binding with Dwight V. Swain's The Transposed Man."]}, {"page": "Transmigration (novel)", "response": ["Transmigration is a science fiction book  by Scottish writer  J. T. McIntosh, published in 1970."]}, {"page": "The Reincarnation of Peter Proud (novel)", "response": ["*Transmigration, by J. T. McIntosh.   Sometimes you have to die several times before you meet the one you were meant to spend your life with."]}, {"page": "You Were Right, Joe", "response": ["\"You Were Right, Joe\" is a 22-page Time travel short story by Scottish writer J. T. McIntosh, published in the November 1957 issue of Galaxy Science Fiction. "]}, {"page": "Flight from Rebirth", "response": ["Flight from Rebirth is a science fiction novel by British writer J. T. McIntosh, published in July 1971 by Avon Books."]}, {"page": "Six Gates from Limbo", "response": ["Six Gates from Limbo is a science fiction novel  by Scottish writer J. T. McIntosh, first published in serial form in Worlds of If magazine.  The serial was titled \"Six Gates to Limbo\" in the magazine, appearing starting in January 1969.   Copyright was then secured in Great Britain in 1968 by Michael Joseph Ltd.   It was published in August 1969 in New York City by Avon Books."]}, {"page": "A Planet Called Utopia", "response": ["A Planet Called Utopia is a science fiction novel  by Scottish writer J. T. McIntosh, first published in August, 1979 in New York by Zebra Books."]}, {"page": "Giants Unleashed", "response": ["*\"Machine Made\" (J. T. McIntosh)"]}, {"page": "The Million Cities", "response": ["The Million Cities is a science fiction novel  by Scottish writer J. T. McIntosh, published  in August 1958 in Satellite Science Fiction in somewhat shorter form, and subsequently in full in both the US and the UK.  A second edition was printed in August 1963."]}, {"page": "Machine Made", "response": ["\"Machine Made\" is a science fiction short story  by Scottish writer  J. T. McIntosh, originally published in the Summer 1951 issue of New Worlds magazine.  One of its author's earliest genre works, it was also his first to appear in a British publication.ISFDB author bibliography It was anthologized at least five times, including volumes edited by Groff Conklin and by John Carnell, and was translated into French for the 1974 volume Histoires de machines.ISFDB publication history"]}, {"page": "Norma K. Hemming", "response": ["*Science Fantasy: Volume 1 Number 3 (1951) (with F. G. Rayer, E. C. Tubb, J. T. McIntosh, E. R. James, John Wyndham, and John Carnell)"]}]}}