{"wiki_id": "http://www.wikidata.org/entity/Q3502042", "itemLabel": "Claudia Fontaine", "itemDescription": "British singer (1960-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Claudia_Fontaine", "wikipedia_page": {"main": "Claudia Fontaine (26 August 1960 – 13 March 2018) was an English backing vocalist from Peckham, London.", "link_mentions": [{"page": "The Specials", "response": ["The new line-up (still known as the Special AKA) finally issued a new full-length album In the Studio in 1984. Officially, the band was now a sextet: Dakar, Campbell, Bradbury, Dammers, Shipley and new bassist Gary McManus. Cuthell, Newton, Panter and Radiation all appeared on the album as guests; as did saxophonist Nigel Reeve, and Claudia Fontaine and Caron Wheeler of the vocal trio Afrodiziak. Both critically and commercially, In The Studio was less successful than previous efforts, although the 1984 single \"Free Nelson Mandela\" was a No. 9 UK hit. The latter contributed to making Mandela's imprisonment a cause célèbre in the UK, and became popular with anti-apartheid activists in South Africa. Dammers then dissolved the band and pursued political activism."]}, {"page": "We Love Life", "response": ["* Claudia Fontaine – backing vocals "]}, {"page": "The Great Gig in the Sky", "response": ["The 1994 live album P•U•L•S•E features a version sung by Sam Brown, Durga McBroom and Claudia Fontaine. When the Floyd's manager, Steve O'Rourke, died in 2003, Gilmour, Wright, and Mason played \"Fat Old Sun\" and \"The Great Gig in the Sky\" at O'Rourke's funeral. According to Durga McBroom, Richard Wright liked her version the best. As per his wishes, she sang the song at Wright's funeral."]}, {"page": "Pulse (Pink Floyd album)", "response": ["*Claudia Fontaine – backing vocals, third vocalist on \"The Great Gig in the Sky\""]}, {"page": "Howard Jones (British musician)", "response": ["In 1985, Jones released his second studio album, Dream into Action, which included backup work by the trio Afrodiziak. Afrodiziak included Caron Wheeler and Claudia Fontaine. His brother Martin played bass guitar. He had to have an extra string added to his instrument to play some of the bass lines, which had originally been scored for keyboard. One of the album's tracks, \"No One Is to Blame\", was later re-recorded, featuring Phil Collins as drummer and producer, and performing backing vocals.  (This second version appears on Jones's U.S. EP \"Action Replay, and also as a bonus track on the CD version of the following LP One to One).  Jones's most successful album, Dream Into Action was popular worldwide; it reached number two in the UK and number 10 in the US and remained on the US chart for almost a year. The singles \"Life In One Day\", \"Things Can Only Get Better\", and \"Look Mama\" appeared on this album. In July 1985, Jones performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide and Seek\" and playing piano. He also embarked on a world tour."]}, {"page": "Schubert Dip", "response": ["*Claudia Fontaine – backing vocals on \"Children\", \"I Believe\", \"Girl of an Age\" & \"Lies\""]}, {"page": "Aztec Camera", "response": ["* Claudia Fontaine – vocals (1995)"]}, {"page": "David Gilmour in Concert", "response": ["*Gospel Choir – Sam Brown (choir leader), Chris Ballin, Pete Brown, Margo Buchanan, Claudia Fontaine, Michelle John Douglas, Sonia Jones, Carol Kenyon, David Laudat, Durga McBroom, Aitch McRobbie (solo on Smile), Beverly Skeete"]}, {"page": "Afrodiziak", "response": ["Afrodiziak was a British singing group composed of Caron Wheeler, Claudia Fontaine, and later Naomi Thompson, that was active in the 1980s. As a duo, Wheeler and Fontaine were best known for performing backing vocals on the Jam's final single \"Beat Surrender\" in 1982 (on whose final tour they performed) and Elvis Costello's 1983 album Punch the Clock, especially its lead single, the international hit \"Everyday I Write the Book\". After the addition of Naomi Thompson as a third member, Afrodiziak performed backing vocals on the hit single \"Free Nelson Mandela\", including the a cappella intro, staging it on Channel 4's music show The Tube in March 1984. Heaven 17's 1984 album How Men Are featured them prominently, especially on the singles \"Sunset Now\" and \"And That's No Lie\". Afrodiziak performed on Madness's albums Keep Moving and Mad Not Mad in 1984 and 1985, appearing in the video for that group's single \"Sweetest Girl\". Also in 1985 they performed backing vocals on the first two songs on Howard Jones' second album, Dream Into Action, both of which (\"Things Can Only Get Better\" and \"Life in One Day\") became worldwide hit singles; later that year, they went on tour as part of Jones's band. Other acts the group sang backup for include Japan, Ian Gillan, Aztec Camera, Maxi Priest, Aswad, Sam Brown, and Julia Fordham. Besides The Tube, Afrodiziak also appeared on Top of the Pops, The Old Grey Whistle Test, Solid Gold, and American Bandstand. They performed live at the Montreux Jazz Festival, Live Aid Japan, Red Nose Day of Charity, and the first Free Nelson Mandela Concert.", "Wheeler went on to fame as a featured vocalist in the dance-R&B collective Soul II Soul (she was the lead vocalist on the group's two biggest hits, \"Keep on Movin'\" and \"Back to Life\", the video for the latter track also featuring Fontaine as a backing vocalist) and had a brief career as a solo artist. Fontaine continued working as a backing vocalist on albums by EMF, Neneh Cherry and Hothouse Flowers, among others. She also appeared as a main vocalist with the British house music group the Beatmasters. Fontaine was featured among the Beatmasters' high-profile, often-changing vocalists, in particular on the 1989–90 dance club and pop chart success \"Warm Love\" (from the album Anywayawanna), and on \"Deeper into Harmony\" (from the 1991 album Life and Soul). Claudia Fontaine died on 13 March 2018."]}, {"page": "Raw Like Sushi", "response": ["*Claudia Fontaine – backing vocals on \"Kisses on the Wind\""]}, {"page": "I've Been Expecting You", "response": ["* Claudia Fontaine – backing vocals"]}, {"page": "Punch the Clock", "response": ["*Afrodiziak (Caron Wheeler and Claudia Fontaine) – backing vocals"]}, {"page": "Despite Straight Lines", "response": ["*Bobby Rae, Carol \"Sugar Lips\" Hall, Claudia Fontaine, Eric Robinson, Sweet Pea \"Python\" Atkinson - backing vocals"]}, {"page": "Eternal Flame (song)", "response": ["* Claudia Fontaine – additional backing vocals"]}, {"page": "Caron Wheeler", "response": ["In 1982, Wheeler met Claudia Fontaine, an English backing vocalist from Bethnal Green, London, England. They formed a duo known as Afrodiziak. The duo only performed as session vocalists for other singers, most notably for Elvis Costello on his album Punch the Clock in 1983. Afrodiziak later toured as backing vocalists for Elvis Costello during his UK tour in 1983. After the tour, they became a group by adding singer Naomi Thompson. The group would go on to contribute background vocals for many artists including Heaven 17, Special AKA, Howard Jones, Japan, Aswad, Sam Brown, and Julia Fordham. In 1988, Wheeler withdraw from the group."]}, {"page": "Play (Squeeze album)", "response": ["*Claudia Fontaine, Beverly Skeete – backing vocals on 4, 10"]}, {"page": "High Hopes (Pink Floyd song)", "response": ["*Claudia Fontaine – backing vocals"]}, {"page": "Party at the Palace", "response": ["The house band for the performance consisted of Phil Palmer (guitar), Pino Palladino (bass), Paul \"Wix\" Wickens (keyboards), Phil Collins (drums), Ray Cooper (percussion), Eric Robinson (saxophone), Sam Brown, Margo Buchanan  and Claudia Fontaine (backing vocals) and the Royal Academy of Music Symphony Orchestra conducted by Michael Kamen. The house band performed with many of the guest artists that were featured, however some performers brought their own musicians to the concert."]}, {"page": "Keep Moving (Madness album)", "response": ["*Afrodiziak (Caron Wheeler, Claudia Fontaine and Naomi Thompson) – backing vocals on \"Michael Caine\""]}, {"page": "Mad Not Mad", "response": ["*Afrodiziak (Caron Wheeler, Claudia Fontaine and Naomi Thompson) – backing Vocals"]}, {"page": "Back to Life (However Do You Want Me)", "response": ["The music video for \"Back to Life (However Do You Want Me)\" was directed by Monty Whitebloom & Andy Delaney, of Big TV! and was shot in Epping Forest. Wheeler's former-Afrodiziak member and friend Claudia Fontaine sings and dances to the song throughout the video."]}, {"page": "Pulse (1995 film)", "response": ["*Claudia Fontaine – backing vocals, third lead vocalist on \"The Great Gig in the Sky\""]}, {"page": "One Slip", "response": ["*Claudia Fontaine – backing vocals"]}, {"page": "People (Hothouse Flowers album)", "response": ["*Claudia Fontaine - backing vocals (1, 3–5, 8)"]}, {"page": "Beatmasters", "response": ["! scope=\"row\"| \"Warm Love\" (featuring Claudia Fontaine)"]}, {"page": "Direction Reaction Creation", "response": ["* Claudia Fontaine – background vocals"]}, {"page": "Fresco (M People album)", "response": ["*Claudia Fontaine – background vocals (tracks 1,3,5,8,9)"]}, {"page": "Before & After (Tim Finn album)", "response": ["* Claudia Fontaine - backing vocals on 1, 7 & 10"]}, {"page": "Sorrow (Pink Floyd song)", "response": ["*Claudia Fontaine – backing vocals (Pulse)"]}, {"page": "In the Studio", "response": ["* Claudia Fontaine – backing vocals on \"What I Like Most About You Is Your Girlfriend\""]}, {"page": "The Best of Elvis Costello and the Attractions", "response": ["# Claudia Fontaine – vocals"]}, {"page": "Free Nelson Mandela", "response": ["The backing vocals were performed by Molly and Polly Jackson, two girls the band's drummer John Bradbury had \"met in a bar in Camden\", while the chorus was performed by session singers including Claudia Fontaine and Caron Wheeler, who later went on to appear with Soul II Soul.Dave Simpson, \"Jerry Dammers: how I made Free Nelson Mandela\", The Guardian, 9 December 2013. Retrieved 9 December 2013.", "* Afrodiziak (Caron Wheeler, Naomi Thompson, Claudia Fontaine), Molly Jackson, Polly Jackson, Lynval Golding, Elvis Costello, Ranking Roger, Dave Wakeling – Backing Vocals"]}, {"page": "Reputation (Dusty Springfield album)", "response": ["* Claudia Fontaine – backing vocals track A3"]}, {"page": "Starvation/Tam Tam Pour L'Ethiopie", "response": ["*Backing vocals: Lorenza Johnson, Claudia Fontaine, Caron Wheeler, Naomi Thomson (Afrodiziak)"]}, {"page": "Dream into Action", "response": ["* Afrodiziak (Claudia Fontaine, Caron Wheeler, Naomi Thompson) – backing vocals"]}, {"page": "Cross That Line", "response": ["* Claudia Fontaine – backing vocals (5)"]}, {"page": "One to One (Howard Jones album)", "response": ["* Afrodiziak (Caron Wheeler, Claudia Fontaine, Naomi Osborne), Phil Collins, Cindy Mizelle, Doris Eugenio, Deborah Forman, Daramis Carbaugh, Marcus Miller, Mark Stevens, Fonzi Thornton, Mike Murphy, boys from the choir of St. Patrick's Cathedral, Dublin (conducted and directed by John Dexter) – backing vocals "]}, {"page": "Pink Floyd live backing musicians", "response": ["* Durga McBroom, Sam Brown, Claudia Fontaine – backing vocals"]}, {"page": "Heaven (Jason Rowe album)", "response": ["*Claudia Fontaine – backing vocals"]}, {"page": "The Division Bell Tour", "response": ["* Claudia Fontaine – backing vocals, lead vocals on \"The Great Gig in the Sky\""]}, {"page": "Heart Strings (Bonnie Tyler album)", "response": ["*Background Vocals – Sam Brown (singer), Margot Buchanan, Rita Campbell, Claudia Fontaine, Aitch McRobbie"]}, {"page": "Across from Midnight", "response": ["* Claudia Fontaine – backing vocals (6)"]}, {"page": "Everyday I Write the Book", "response": ["The music video for \"Everyday I Write the Book\" was directed by Don LettsCostello's audio commentary on the Right Spectacle dvd and has been called a \"classic MTV hit\" and features footage of Elvis Costello and the Attractions performing in a studio with female backup singers Claudia Fontaine and Caron Wheeler dressed in African clothing and kente cloth headwraps. Footage of Costello and his bandmates performing is mingled with footage showing celebrity lookalikes of Prince Charles and Diana, Princess of Wales, Charles incongruously doing household chores and Diana watching television in a middle class domicile. Clips of the silent films being watched by Diana are included in the montage."]}, {"page": "List of Pink Floyd band members", "response": [";Claudia Fontaine"]}, {"page": "Frestonia (album)", "response": ["*Claudia Fontaine – background vocals"]}]}}