{"wiki_id": "http://www.wikidata.org/entity/Q350608", "itemLabel": "Adam Pengilly", "itemDescription": "British skeleton racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Pengilly", "wikipedia_page": {"main": "Adam Laird Pengilly (born 14 October 1977) is a British skeleton racer who has competed since 2004. He won a silver medal in men's skeleton event at the FIBT World Championships 2009 in Lake Placid.\nPengilly finished eighth in the men's skeleton event at the 2006 Winter Olympics. During those games, he kept a diary of what transpired around him.\nPengilly qualified for the 2010 Winter Olympics where he finished 18th. On 25 February 2010, he was elected by his fellow Olympic athletes to the International Olympic Committee Athletes' Commission along with Chinese speed skater Yang Yang and American ice hockey player Angela Ruggiero.\nAdam served as a member of the IOC at London 2012, Sochi 2014, Rio 2016 and Pyeongchang 2018.\nFollowing an altercation with a security guard Pengilly was sent home from the Pyeongchang Winter Olympics.\n\n", "link_mentions": [{"page": "University of Birmingham", "response": ["Alumni in the world of sport are many. They include Lisa Clayton, the first woman to sail the globe single-handed; 400 metres runner Allison Curbishley, who won silver at the 1998 Commonwealth Games; team pursuit cyclist Paul Manning, who won bronze, silver and gold at the Olympics of 2004, 2008 and 2012; sports scholar Izzy Christiansen, who played football for Birmingham City, Everton and Manchester City before her call up to the senior England squad; Warwickshire and England cricketer Jim Troughton; and Adam Pengilly who competed as a skeleton racer at the 2006 and 2010 Winter Olympics and was elected to the International Olympic Committee Athletes' Commission in 2010."]}, {"page": "Richard Huish College, Taunton", "response": ["*Adam Pengilly, British skeleton racer"]}, {"page": "London Organising Committee of the Olympic and Paralympic Games", "response": ["* Adam Pengilly"]}, {"page": "Kristan Bromley", "response": ["On 29 January 2010, Kristan was officially announced as part of the Team GB Skeleton Bobsleigh squad to compete at the 2010 Winter Olympics in Vancouver, Canada. Other squad members included Adam Pengilly, with Shelley Rudman and Amy Williams in the women's competition. Bromley finished sixth in the men's event."]}, {"page": "Great Britain at the 2006 Winter Olympics", "response": ["Two men and one woman skeleton athletes travelled to Turin. Shelley Rudman was selected as the woman's sole representative; the men were Kristan Bromley and Adam Pengilly", "|Adam Pengilly"]}, {"page": "2006–07 Skeleton World Cup", "response": ["| align=\"center\" | 5. ||  Adam Pengilly || align=\"right\"| 60 || align=\"right\"| 65 || align=\"right\"| 45 || align=\"right\"| 65 || align=\"right\"| 27 || align=\"right\"| 65 || align=\"right\"| 36 || align=\"right\"| 45 || align=\"right\"| 408"]}, {"page": "2007–08 Skeleton World Cup", "response": ["| Men's ||  Jon Montgomery   ||  Anthony Sawyer  ||  Adam Pengilly", "| 9. ||align=\"left\"|  Adam Pengilly|| 4 || 11 || 10 ||bgcolor=\"cc9966\"| 3 || 5 || 17 || 6 || || 1120"]}, {"page": "Heathfield Community School", "response": ["* Adam Pengilly, Skeleton racer"]}, {"page": "FIBT World Championships 2012", "response": ["|align=left| Adam Pengilly"]}, {"page": "Craig Reedie", "response": ["After his success as a player, Reedie turned his efforts towards sports administration and from 1981 to 1984 he was President of the International Badminton Federation (IBF). In 1992, he became the Chairman of the British Olympic Association (BOA), serving in that capacity for more than a decade, and for which role he was knighted on retiring in 2005. In 1994, in addition to his British role, Reedie joined the International Olympic Committee (IOC), where he is currently one of four United Kingdom representatives, the others being the Princess Royal, Sir Philip Craven and Adam Pengilly."]}, {"page": "February 2009 in sports", "response": ["**Men: (1) Gregor Staehli  2.46.58 (2) Adam Pengilly  +0.35 (3) Aleksandr Tretyakov  +0.51"]}, {"page": "Skeleton at the 2006 Winter Olympics – Men's", "response": ["| 8 ||align=left| Adam Pengilly||align=left|  || 0:58.37 || 0:59.09 || 1:57.46 || +1.58"]}, {"page": "Skeleton at the 2010 Winter Olympics – Men's", "response": ["| 18 || 16 || align=left| Adam Pengilly || align=left|  || 53.75 || 54.17 || 53.36 || 53.23 || 3:34.51 || +4.78 "]}, {"page": "Great Britain at the 2010 Winter Olympics", "response": ["|align=left|Adam Pengilly"]}, {"page": "2010 Winter Olympics closing ceremony", "response": ["Two new members of the IOC, Angela Ruggiero (USA) and Adam Pengilly (UK), were announced.  The volunteers who made the games possible were also recognized."]}, {"page": "Chris Type", "response": ["Type made his debut at World Cup level in the first race of the 2010–11 season. At the 2010 Winter Olympics in Vancouver, Type accompanied the British team as a reserve (Adam Pengilly and Kristan Bromley were chosen ahead of Type to occupy the two British spots)."]}, {"page": "Adam L. Pengilly", "response": ["#REDIRECT Adam Pengilly"]}, {"page": "Khalid Rushaka", "response": ["In 2016, ISR (International Sports Relations) Academy awarded Rushaka with a scholarship to study sports management in Busan, South Korea. The ISR Academy was the brainchild of the Olympic champion and IOC member Mood Dae Sung. He created the Organization to offer \"free academic training to retiring or recently retired Olympians who are interested in furthering their careers in the field of international sports business and administration.\" Rushaka entered the second class of ISR under the directorship of Adam Pengilly, ex-Olympian and a member of the IOC. Rushaka was classmates with Ukrainian middle-distance star Olha Zavhorodnya, Estonian archer Siret Luik, South African wrestler Mpho \"Queen of the Ring\" Madi, and Brazilian bobsledder Fabiana Dos Santos."]}, {"page": "Cycling at the 2016 Summer Olympics – Women's omnium", "response": ["The medals were presented by Adam Pengilly, IOC member, Great Britain and Harald Hansen, Member of the UCI Management Committee."]}, {"page": "Dom Parsons", "response": ["Parsons began as a runner for Blackheath and Bromley Harriers Athletic Club, running the 400m. He switched to skeleton in 2007 after being introduced to the sport by Adam Pengilly at the Bath bobsleigh and skeleton push-start track. He made his Europa Cup debut in 2008, and finished fourth at the 2009 and 2010 IBSF Junior Skeleton World Championships."]}, {"page": "Athletics at the 2016 Summer Olympics – Men's long jump", "response": ["The medals were presented by Adam Pengilly, IOC member, Great Britain and Anna Riccardi, Council Member of the IAAF."]}, {"page": "Athletics at the 2016 Summer Olympics – Women's 4 × 100 metres relay", "response": ["The following evening the medals were presented by Adam Pengilly, IOC member, Great Brittan and Víctor López, Council Member of the IAAF."]}, {"page": "Pengilly", "response": ["* Adam Pengilly (born 1977), British skeleton racer "]}, {"page": "Skeleton at the Winter Universiade", "response": ["|  Adam Pengilly"]}, {"page": "Concerns and controversies at the 2018 Winter Olympics", "response": ["On 15 February 2018, IOC member Adam Pengilly was not allowed to enter the parking lot, since the route was only for buses, not pedestrians. Denied by security, Pengilly blamed and shoved security. According to security, Pengilly said to the security \"If you report this incident to authority, you won't be able to work in Korea.\". After the investigation, Pengilly was sent home from the Pyeongchang Winter Olympics and apologised for his action, but denied a confrontation. IOC President Thomas Bach met with the security official on 17 February to apologize in person."]}, {"page": "Pengilly, Adam", "response": ["#redirectAdam Pengilly"]}]}}