{"wiki_id": "http://www.wikidata.org/entity/Q3509912", "itemLabel": "Seamus Twomey", "itemDescription": "Irish terrorist", "wikipedia_url": "https://en.wikipedia.org/wiki/Seamus_Twomey", "wikipedia_page": {"main": "Seamus Twomey (Irish: Séamus Ó Tuama; 5 November 1919 – 12 September 1989) was an Irish republican activist, militant, and twice chief of staff of the Provisional IRA.", "link_mentions": [{"page": "Provisional Irish Republican Army", "response": ["Marches marking the Ulster Protestant celebration The Twelfth in July 1969 led to riots and violent clashes in Belfast, Derry and elsewhere. The following month a three-day riot began in the Catholic Bogside area of Derry, following a march by the Protestant Apprentice Boys of Derry. The Battle of the Bogside caused Catholics in Belfast to riot in solidarity with the Bogsiders and to try to prevent RUC reinforcements being sent to Derry, sparking retaliation by Protestant mobs. The subsequent arson attacks, damage to property and intimidation forced 1,505 Catholic families and 315 Protestant families to leave their homes in Belfast in the Northern Ireland riots of August 1969 The riots resulted in 275 buildings being destroyed or requiring major repairs, 83.5% of them occupied by Catholics. A number of people were killed on both sides, some by the police, and the British Army were deployed to Northern Ireland. The IRA had been poorly armed and failed to properly defend Catholic areas from Protestant attacks, which had been considered one of its roles since the 1920s. Veteran republicans were critical of Goulding and the IRA's Dublin leadership which, for political reasons, had refused to prepare for aggressive action in advance of the violence. On 24 August a group including Joe Cahill, Seamus Twomey, Dáithí Ó Conaill, Billy McKee, and Jimmy Steele came together in Belfast and decided to remove the pro-Goulding Belfast leadership of Billy McMillen and Jim Sullivan and return to traditional militant republicanism. On 22 September Twomey, McKee, and Steele were among sixteen armed IRA men who confronted the Belfast leadership over the failure to adequately defend Catholic areas. A compromise was agreed where McMillen stayed in command, but he was not to have any communication with the IRA's Dublin based leadership."]}, {"page": "Gerry Adams", "response": ["Adams was active in rioting at this time and later became involved in the republican movement. In August 1971, internment was reintroduced to Northern Ireland under the Special Powers Act 1922. Adams was interned in March 1972, on , but on the Provisional IRA's insistence was released in June to take part in secret, but abortive talks in London. The IRA negotiated a short-lived truce with the British government and an IRA delegation met with British Home Secretary William Whitelaw at Cheyne Walk in Chelsea. The delegation included Adams, Martin McGuinness, Sean Mac Stiofain (IRA Chief of Staff), Daithi O'Conaill, Seamus Twomey, Ivor Bell and Dublin solicitor Myles Shevlin. Adams was re-arrested in July 1973 and interned at the Maze prison. After taking part in an IRA-organised escape attempt, he was sentenced to a period of imprisonment. During this time, he wrote articles in the paper An Phoblacht under the by-line \"Brownie\", where he criticised the strategy and policy of Sinn Féin president Ruairí Ó Brádaigh and Billy McKee, the IRA's officer commanding in Belfast. He was also highly critical of a decision taken by McKee to assassinate members of the rival Official IRA, who had been on ceasefire since 1972.Moloney, pp. 166–168. In 2020, the UK Supreme Court quashed Adams' convictions for attempting to escape on Christmas Eve in 1973 and again in July 1974.", "Adams has stated repeatedly that he has never been a member of the Provisional Irish Republican Army (IRA). However, authors such as Ed Moloney, Peter Taylor, Mark Urban and historian Richard English have all named Adams as part of the IRA leadership since the 1970s. Moloney and Taylor state Adams became the IRA's Chief of Staff following the arrest of Seamus Twomey in early December 1977, remaining in the position until 18 February 1978 when he, along with twenty other republican suspects, was arrested following the La Mon restaurant bombing.Moloney, pages 171-2Taylor, page 201 He was charged with IRA membership and remanded to Crumlin Road Gaol.Moloney, page 173 He was released seven months later when the Lord Chief Justice of Northern Ireland Robert Lowry ruled there was insufficient evidence to proceed with the prosecution.Taylor, pages 201-202 Moloney and English state Adams had been a member of the IRA Army Council since 1977, remaining a member until 2005 according to Irish Minister for Justice, Equality and Law Reform Michael McDowell. Moloney, page 380English, page 110"]}, {"page": "Official Irish Republican Army", "response": ["The Official Irish Republican Army or Official IRA (OIRA; ) was an Irish republican paramilitary group whose goal was to remove Northern Ireland from the United Kingdom and create a \"workers' republic\" encompassing all of Ireland.Statement from Cathal Goulding, C/S of the Official IRA, in early 1972, quoted in On Our Knees by Rosita Sweetman, Pan Books, London. 1972. . p. 146 It emerged in December 1969, shortly after the beginning of the Troubles, when the Irish Republican Army (IRA) split into two factions. The other was the Provisional IRA. Each continued to call itself simply \"the IRA\" and rejected the other's legitimacy. Unlike the \"Provisionals\", the \"Officials\" did not think that Ireland could be unified until the Protestant majority of Northern Ireland and Catholic minority of Northern Ireland were at peace with each other. The Officials were Marxist-Leninists and worked to form a united front with other Irish communist groups, named the Irish National Liberation Front (NLF).Coogan, Tim Pat. The Troubles: Ireland's Ordeal and the Search for Peace. Palgrave Macmillan, 2002. p.113 The Officials were called the NLF by the Provisionals,Taylor, Peter. Behind the Mask: The IRA and Sinn Fein. TV Books, 1999. p.84O'Ballance, Edgar. Terror in Ireland: The Heritage of Hate. Presidio Press, 1981. p.133 the \"stickies\" by West Belfast locals (in reference to members who would glue Easter lilies to their uniforms),Keefe, Patrick Redden \"Say Nothing: A Tale of Murder and Mystery in Ireland\"  and were sometimes nicknamed the Red IRA by others.Rekawek, Kacper. Irish Republican Terrorism and Politics: A Comparative Study of the Official and the Provisional IRA. Taylor & Francis, 2011. pp.1-2\"Obituaries: Seamus Twomey, 70, a Leader of Provisional I.R.A.\" . Reuters. The New York Times, 14 September 1989.\"IRA itself is divided on strategy, ideology\". The Toledo Blade, 11 November 1971.", "Discontent was not confined to the northern IRA units. In the south also, such figures as Ruairí Ó Brádaigh and Sean MacStiofain opposed both the leadership's proposed recognition of Northern Ireland and the Republic of Ireland. This increasing political divergence led to a formal split at the 1969 IRA Convention, held in December. when a group led by Ó Brádaigh and MacStiofán walked out. The split resulted from a vote at the first IRA Convention where a two-thirds majority voted that republicans should take their seats if elected to the British, Republic of Ireland or Northern Ireland Parliaments. At a second convention, a group consisting of Mac Stiofáin, Dáithí Ó Conaill, Ó Brádaigh, Joe Cahill, Paddy Mulcahy, Leo Martin, and Sean Tracey, were elected as the \"Provisional\" Army Council. Their supporters included Seamus Twomey."]}, {"page": "Workers' Party of Ireland", "response": ["A group consisting of Seán Mac Stiofáin, Dáithí Ó Conaill, Seamus Twomey, and others, established themselves as a \"Provisional Army Council\" in 1969 in anticipation of a contentious 1970 Sinn Féin Ard Fheis (delegate conference). At the Ard Fheis, the leadership of Sinn Féin failed to attain the required two-thirds majority to change the party's position on abstentionism. The debate was charged with allegations of vote-rigging and expulsions. When the Ard Fheis went on to pass a vote of confidence in the official Army Council (which had already approved an end to the abstentionist policy), Ruairí Ó Brádaigh led the minority in a walk-out,Sinn Féin: A Hundred Turbulent Years, Brian Feeney, O'Brien Press, Dublin 2002,  pg. 250-1, Sinn Féin: A Century of Struggle, Parnell Publications, Mícheál MacDonncha, 2005,  and went to a prearranged meeting in Parnell Square where they announced the establishment of a \"caretaker\" executive of Sinn Féin.The Lost Revolution: The Story of The Official IRA and The Workers' Party, Brian Hanley & Scott Millar, Penguin Ireland (2009),  p.146 The dissident council became known as the \"Provisional Army Council\" and its party and military wing as Sinn Féin and the Provisional IRA, while those remaining became known as Official Sinn Féin and the Official IRA.Richard Sinnott (1995), Irish Voters Decide: Voting behaviour in elections and referendums since 1918, Manchester University Press, p.59 Official Sinn Féin, under the leadership of Tomás Mac Giolla, remained aligned to Goulding's Official IRA.The Lost Revolution: The Story of the Official IRA and the Workers' Party, Brian Hanley and Scott Millar,  pp. 286–336"]}, {"page": "Ruairí Ó Brádaigh", "response": ["On 10 February 1975, the IRA Army Council, which may have included Ó Brádaigh, unanimously endorsed an open-ended cessation of IRA \"hostilities against Crown forces\", which became known as the 1975 truce.  The IRA Chief of Staff at the time was Seamus Twomey, of Belfast.  Another member of the Council at this time was probably Billy McKee, of Belfast.  Daithi O'Connell, a prominent Southern Republican, was also a member.  It is reported in some quarters that the IRA leaders had mistakenly believed they had persuaded the British Government to withdraw from Ireland and the protracted negotiations between themselves and British officials were the preamble to a public declaration of intent to withdraw. In fact, as British government papers now show, the British entertained talks with the IRA in the hope that this would fragment the movement further, and scored several intelligence coups during the talks. It is argued by some that by the time the truce collapsed in late 1975 the Provisional IRA had been severely weakened. This bad faith embittered many in the republican movement, and another ceasefire was not to happen until 1994. In 2005, Ó Brádaigh donated, to the James Hardiman Library of University College, Galway, notes that he had taken during secret meetings in 1975–76 with British representatives.  These notes confirm that the British representatives were offering a British withdrawal as a realistic outcome of the meetings.  The Republican representatives—Ó Brádaigh, Billy McKee and one other—felt a responsibility to pursue the opportunity, but were also sceptical of British intentions."]}, {"page": "1989 in Ireland", "response": ["* 12 September – Seamus Twomey, twice chief of staff of the Provisional Irish Republican Army (born 1919)."]}, {"page": "1919 in Ireland", "response": ["*5 November – Seamus Twomey, twice chief of staff of the Provisional Irish Republican Army (died 1989)"]}]}}