{"wiki_id": "http://www.wikidata.org/entity/Q350165", "itemLabel": "Simon Brett", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Brett", "wikipedia_page": {"main": "Simon Anthony Lee Brett OBE FRSL (born 28 October 1945 in Worcester Park, Surrey, England) is a British writer of detective fiction and a radio producer.", "link_mentions": [{"page": "Douglas Adams", "response": ["The Hitchhiker's Guide to the Galaxy was a concept for a science-fiction comedy radio series pitched by Adams and radio producer Simon Brett to BBC Radio 4 in 1977. Adams came up with an outline for a pilot episode, as well as a few other stories (reprinted in Neil Gaiman's book Don't Panic: The Official Hitchhiker's Guide to the Galaxy Companion) that could be used in the series."]}, {"page": "I'm Sorry I Haven't a Clue", "response": ["*Simon Brett (1975–77)"]}, {"page": "Whodunit", "response": ["An important variation on the whodunit is the inverted detective story (also referred to as a \"howcatchem\" or \"howdunnit\") in which the guilty party and the crime are openly revealed to the reader/audience and the story follows the investigator's efforts to find out the truth while the criminal attempts to prevent it.  The Columbo TV movie series is the classic example of this kind of detective story (Law & Order: Criminal Intent and The Streets of San Francisco also fit into this genre). This tradition dates back to the inverted detective stories of R Austin Freeman, and reached an apotheosis of sorts in Malice Aforethought written by Francis Iles (a pseudonym of Anthony Berkeley). In the same vein is Iles's Before the Fact (1932), which became the Hitchcock movie Suspicion. Successors of the psychological suspense novel include Patricia Highsmith's This Sweet Sickness (1960), Simon Brett's A Shock to the System (1984), and Stephen Dobyns's The Church of Dead Girls (1997)."]}, {"page": "Beckenham", "response": ["In Simon Brett's long-running BBC Radio 4 comedy drama, No Commitments (1992–2007), Beckenham is the home of the wildly snobbish, socially aspirational and insecure sister Victoria; the town is frequently mocked by association."]}, {"page": "Lindsey Davis", "response": ["* \"'Going Anywhere Nice?'\" (2005), published in The Detection Collection, edited by Simon Brett."]}, {"page": "Unnatural Death (novel)", "response": ["In May 1975, an adaptation was made for BBC Radio 4, produced by Simon Brett and starring Ian Carmichael as Lord Peter Wimsey."]}, {"page": "A Shock to the System (1990 film)", "response": ["A Shock to the System is a 1990 American black comedy film directed by Jan Egleson and starring Michael Caine, Swoosie Kurtz, Elizabeth McGovern, and Peter Riegert. It is based on the 1984 novel A Shock to the System by British author Simon Brett."]}, {"page": "1984 in literature", "response": ["*Simon Brett – A Shock to the System"]}, {"page": "List of crime writers", "response": ["*Simon Brett (born 1945, E)"]}, {"page": "Geoffrey Perkins", "response": ["Perkins produced the first series of Douglas Adams' The Hitchhiker's Guide to the Galaxy in 1977 for BBC Radio 4, taking over from pilot-producer Simon Brett. Perkins assisted the notoriously slow writer in finishing the scripts, before John Lloyd was drafted in to write large sections of the later episodes. Perkins also drew on the resources of the Radiophonic Workshop to help create the groundbreaking audio effects for the series."]}, {"page": "Real tennis", "response": ["The Corpse on the Court (2013) is a mystery by Simon Brett. It features the recurring lead character of Jude learning many details about the sport from aficionados."]}, {"page": "Thomas Hood", "response": ["*So Much Blood – Simon Brett (1976)"]}, {"page": "Reginald Hill", "response": ["* \"Fool of Myself\" (2005), published in The Detection Collection, edited by Simon Brett."]}, {"page": "Rik Mayall", "response": ["Mayall starred alongside Phoebe Cates in Drop Dead Fred (1991) as the eponymous character, a troublesome imaginary friend who reappears from a woman's childhood. He also appeared in Carry On Columbus (1992) with other alternative comedians. Mayall also provided the voice of the character Froglip, the prince of the goblins, in the 1992 animated film adaption of the 1872 children's tale The Princess and the Goblin by George MacDonald. In 1993, he appeared in Rik Mayall Presents, six individual comedy dramas (Micky Love / Briefest Encounter / Dancing Queen / The Big One / Dirty Old Town / Clair de Lune). Mayall's performances won him a Best Comedy Performer award at that year's British Comedy Awards, and a second series of three was broadcast in early 1995. He provided the voice for Little Sod in Simon Brett's How to Be a Little Sod, written in 1991 and adapted as ten consecutive episodes broadcast by the BBC in 1995. In the early 1990s, he auditioned for the roles of Banzai, Zazu and Timon in The Lion King (1994); he was asked to audition by lyricist Tim Rice, but the role of Zazu finally went to Rowan Atkinson."]}, {"page": "History of crime fiction", "response": ["Over the decades, the detective story metamorphosed into the crime novel (see also the title of Julian Symons' history of the genre). Starting with writers like Francis Iles, who has been described as \"the father of the psychological suspense novel as we know it today,\" more and more authors laid the emphasis on character rather than plot. Up to the present, many authors have tried their hand at writing novels where the identity of the criminal is known to the reader right from the start. The suspense is created by the author having the reader share the perpetrator's thoughts—up to a point, that is—and having them guess what is going to happen next (for example, another murder, or a potential victim making a fatal mistake), and if the criminal will be brought to justice in the end. For example, Simon Brett's A Shock to the System (1984) and Stephen Dobyns' Boy in the Water (1999) both reveal the murderer's identity quite early in the narrative. A Shock to the System is about a hitherto law-abiding business manager's revenge which is triggered by his being passed over for promotion, and the intricate plan he thinks up to get back at his rivals. Boy in the Water is the psychological study of a man who, severely abused as a child, is trying to get back at the world at large now that he has the physical and mental abilities to do so. As a consequence of his childhood trauma, the killer randomly picks out his victims, first terrifying them and eventually murdering them. But Boy in the Water also traces the mental states of a group of people who happen to get in touch with the lunatic, and their reactions to him."]}, {"page": "Week Ending", "response": ["Week Ending was a satirical radio current affairs sketch show broadcast on BBC Radio 4 between 1970 and 1998. It was devised by writer-producers Simon Brett and David Hatch and was originally hosted by Nationwide presenter Michael Barratt."]}, {"page": "Michael Ridpath", "response": ["* \"Partnership Track\" (2005), published in The Detection Collection, edited by Simon Brett."]}, {"page": "List of BBC Radio 4 programmes", "response": ["*Foul Play, writers are asked to solve a murder mystery written by host Simon Brett "]}, {"page": "Andrew Marshall (screenwriter)", "response": ["Born in Lowestoft, Marshall attended Fen Park School and then Lowestoft Grammar School, and afterwards Borough Road College where he studied mathematics and psychology. Around the same time, he worked regularly on Radio 4's Week Ending, together with David Renwick, Douglas Adams, Alistair Beaton, John Lloyd, Simon Brett and others. Shortly afterwards he began writingThe Burkiss Way with David Renwick and John Mason (who later dropped out to go to acting school). Renwick and Marshall remained scriptwriting partners for many years."]}, {"page": "Royal Society of Literature", "response": ["| Simon Brett OBE"]}, {"page": "Paul Jones (singer)", "response": ["In October 1977, he starred as Sir Francis Drake in the musical premiere of Drake's Dream at the Connaught Theatre, Worthing featuring music and lyrics by Lynne and Richard Riley and book by Simon Brett. The production was directed by Nicolas Young and transferred to London's Shaftesbury Theatre for a limited season opening on 7 December 1977. The Drake's Dream Original London Cast Album was recorded by President Records in 1977 and released on CD in 2017 by Stage Door Records."]}, {"page": "After Henry (radio series)", "response": ["After Henry is a British sitcom written by Simon Brett.  It started on BBC Radio 4 and later moved to television. Prunella Scales and Joan Sanderson starred in both radio and television versions.", "A novel, also by Simon Brett, followed the series. hardback,  paperback"]}, {"page": "The Burkiss Way", "response": ["The first season of the show starred Denise Coffey, Chris Emmett, Nigel Rees and Fred Harris. From season 2 onwards, the show starred Jo Kendall, Chris Emmett, Nigel Rees and Fred Harris. The series had three producers, announced as \"Simon Brett of Stepney\", \"John Lloyd of Europe\", and \"David Hatch 'of the BBC Hatch'\"."]}, {"page": "Detection Club", "response": ["*Simon Brett (2000–2015)", "*The Detection Collection (2005; original short stories in recognition of the Club's 75th anniversary, edited by Simon Brett, published by Orion and by St. Martin;'s (2006))", "* Eric the Skull (2020; a 45-minute BBC Radio 4 play, being a fictionalised account of the setting up of the club, written by Simon Brett and produced by Liz Anstee)."]}, {"page": "Pete Atkin", "response": ["In 1981 Atkin succeeded Griff Rhys Jones as BBC Radio Light Entertainment Producer. He subsequently became a Script Editor in 1983 and Chief Producer, Radio 4 in 1986. His productions included Just a Minute, My Word!, My Music, Week Ending, Legal, Decent, Honest and Truthful (written by Guy Jenkin and Jon Canter, and starring Martin Jarvis), After Henry (by Simon Brett with Prunella Scales, Joan Sanderson, Ben Whitrow, and Gerry Cowper), Second Thoughts, Christopher Lee's The House, Flying The Flag, Peter Tinniswood's Uncle Mort's North Country, Jarvis's Frayn, My Grandfather, Martin Jarvis reading Richmal Crompton's Just William stories, and Yes Minister."]}, {"page": "Charlotte Green", "response": ["She played herself in a 2005 radio episode of The Hitchhiker's Guide to the Galaxy, and again played herself in 2008 in Simon Brett's radio detective drama Charles Paris. She has been impersonated by Jan Ravens reading out a double-entendres-filled shipping forecast on the BBC radio comedy show Dead Ringers. She signed a public letter of protest to the BBC Trust regarding cuts to the radio news service in 2007."]}, {"page": "Nigel Molesworth", "response": ["Simon Brett later wrote two sequels to the series in which a grown-up Nigel offered his observations on subjects such as jobs, family, holidays and D.I.Y.", "In 1987 the character was reprised for a four-part BBC Radio 4 series, Molesworth. Written by Simon Brett, the series portrayed Molesworth in middle age, still surrounded by many of the characters from his youth.  Molesworth was played by Willie Rushton, with Penelope Nice as his wife Louise, and Clive Swift as the now aged ex-headmaster Grimes."]}, {"page": "The 12.30 from Croydon", "response": ["*The protagonist of Simon Brett's A Shock to the System (1984) is also a killer who is deluded into thinking that he can get away with murder."]}, {"page": "Colin Sell", "response": ["Sell wrote music for the University of Bristol's revues in the early 1970s, leading to performances at the Edinburgh Festival Fringe, where Simon Brett saw Sell perform and offered him the pianist position on I'm Sorry I Haven't a Clue. He also appeared with the Yvonne Arnaud Theatre TIE company in the early 1970s, which also included two other well-known names, Elizabeth Estensen and Clive Hornby, both long-standing members of the Emmerdale cast."]}]}}