{"wiki_id": "http://www.wikidata.org/entity/Q351000", "itemLabel": "Herbert Stewart", "itemDescription": "British army officer (1843-1885)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Stewart", "wikipedia_page": {"main": "Major-General Sir Herbert Stewart  (30 June 1843 – 16 February 1885) was a British soldier.", "link_mentions": [{"page": "John French, 1st Earl of Ypres", "response": ["French took part in the Sudan expedition to relieve Major-General Charles Gordon in 1884. He was second-in-command to his friend Lieutenant Colonel Percy Barrow, with the cavalry which accompanied Brigadier-General Sir Herbert Stewart as he took the short route across 176 miles of desert (the other British force under Major-General Earle marched the long way along the bend of the Nile). Most of the cavalry work was in reconnaissance and warding off Dervish raids, although they did—at a walk—pursue the retreating enemy after the Battle of Abu Klea in January 1885. By the time they reached the Nile the horses had not been watered for between 56 and 72 hours.Holmes 2004, pp. 35–39 During the retreat back across the desert via Jakdul (the expedition had reached Khartoum too late to save Gordon) Major French led a rearguard of thirteen men, again warding off Dervish attacks and impressing Redvers Buller and Sir Garnet Wolseley.Holmes 2004, p. 41"]}, {"page": "Royal Horse Guards", "response": ["Wolseley detached the Camel Corps under Sir Herbert Stewart to march across the desert to Metemma, securing the wells at Jakdul on 12 January 1885.Arthur, p.685 - records the date as 2nd Jan.; see arguments in White-Spunner  Having learnt how to handle camels in the saddle, they were expected to employ carbines and full kit as mounted infantry.  They then had to secure more wells, and eventually encountering on foot, the enemy at Abu Klea, where 700 Mahdists charged them.  The Gardner machine-gun jammed.  They formed a defensive square, during which hand-to-hand fighting Burnaby fell, defended to the last by Corporal Mackintosh, who was killed.Arthur, II, p.687 Lord Binning, the regiment's signalling officer, crept out twice to give Burnaby water.  Wave after wave of Baggara tribesmen mounted on black chargers rushed their positions, falling on volleys of rifle fire.  The tactics of the square at Abu Klea exhausted the Mahdi's best troops, who fell at that battle.Nineteenth Century Review; Arthur, p.600 Major Lord Arthur Somerset of The Blues squadron wrote commanding officer to inform him of the heroic actions.  On the second occasion Burnaby had been speared.  In total 9 Officers and 65 men were killed, 94 wounded in the Heavy Camel Regiment, but only one killed and four from disease among NCOs and ranks.historians point out that it was a Corps rather than a regiment as such. see:Arthur, II, Appendix"]}, {"page": "Battle of Abu Klea", "response": ["The British forces consisted of 1,100 British of the Desert Column under Sir Herbert Stewart, against a Sudanese force of approximately 12,000 fighters. While the main British force (the River Column), led by General Sir Garnet Wolseley travelled by river from Korti to Khartoum, Stewart's column was to cut across country by column directly for Khartoum, since time was running short according to what little information was available from the garrison. The force was composed of four regiments of camel-mounted troops (Guards, Heavy, Light and Mounted Infantry), detachments of the various infantry regiments in Egypt and of the River Column, and a detachment of the 19th Hussars, mounted on horses. Four light field pieces and a small Naval Brigade manning a Gardner machine gun completed the force.", "The battle was short, lasting barely fifteen minutes from start to finish. Casualties for the British were nine officers and 65 other ranks killed and over a hundred wounded. The Mahdists lost 1,100 dead during the fifteen minutes of fighting, made all the worse by only 5,000 of the Dervish force being engaged.Dictionary of battles from the earliest date to the present time by Thomas Benfield Harbottle published 1904 Among the Dervish dead was Musa wad Helu, one of the Mahdist chiefs. British national hero Colonel F. G. Burnaby of the Royal Horse Guards was killed by a spear to the throat. Frank Rhodes (brother of Cecil) distinguished himself when several horses were shot under him during the engagement, earning him a Distinguished Service Order. Gunner Alfred Smith fought bravely to save his officer, Lieutenant Guthrie, and was awarded a VC. Another action happened two days later at Abu Kru (the Battle of El Gubat) and the advance rescue force leader Major General Sir Herbert Stewart was mortally wounded by Remington Rifile Fire by the Madist's that night, he knew it was a mortal wound, and he transferred command to a inexperienced leader, Brigadier General Sir Charles Wilson (the column's intelligence officer) who was slow to organizing his forces and in tarrying another day, it was he who was the cause of that advance detachment's delay.", "And sing in praise of Sir Herbert Stewart’s little army,"]}, {"page": "Sir Herbert Stewart", "response": ["#redirect Herbert Stewart"]}, {"page": "Bayuda Desert", "response": ["The Bayuda Desert was crossed by the Desert Column of the Gordon Relief Expedition in January 1885 in a failed attempt to relieve the Siege of Khartoum. The Desert Column was led mainly by Major General Sir Herbert Stewart but after he was mortally wounded, command passed to Brigadier General Charles Wilson, the column's intelligence officer. The Expedition saw the Battle of Abu Klea and the Battle Abu Kru."]}, {"page": "Herbert (given name)", "response": ["*Herbert Stewart (1843–1885), British soldier"]}, {"page": "List of people educated at Brighton College", "response": ["*Major-General Sir Herbert Stewart (1843–1885), army staff officer, commanded the Desert Column to relieve Khartoum, mortally wounded at Abu Klea"]}, {"page": "Nile Expedition", "response": ["The expedition was commanded by Garnet Wolseley. After Commander Herbert Stewart was mortally wounded, Brigadier-General Charles William Wilson took command of an advance party of about 1,400 men. On two Nile steamers Wilson's Desert Column reached Khartoum in the afternoon of 28 January 1885. It came two days too late: Khartoum had been seized by the Mahdists in the early hours of 26 January.  Between 5,000 and 10,000 inhabitants of the city were slaughtered, among them Gordon."]}, {"page": "List of Old Wykehamists", "response": ["*  Herbert Stewart, soldierSabben-Clare, 1981. p. 144"]}, {"page": "William Stewart (English cricketer)", "response": ["Stewart's brother Herbert Stewart represented Hampshire and the Marylebone Cricket Club in first-class cricket. Stewart's brother-in-law Charles Everett also represented Hampshire in a single first-class match before the formation of the county cricket club."]}, {"page": "Charles Everett (cricketer)", "response": ["Everett's brother-in-law, William Stewart represented Hampshire and Oxford University in first-class cricket. Everett's other brother-in-law, Herbert Stewart also represented Hampshire in first-class cricket."]}, {"page": "Edward Austin (cricketer)", "response": ["While studying at Trinity College, Oxford, Austin made a single first-class appearance for Oxford University against the Marylebone Cricket Club at the Magdalen Ground, Oxford in 1869.  Austin ended unbeaten on 0 in Oxford University's first-innings of 75 all out, while in the Marylebone Cricket Club's first-innings of 229 all out, Austin took the wickets of Herbert Stewart and John West, finishing with figures of 2/58 from 24 overs.  In Oxford University's second-innings, Austin was dismissed for 10 runs by George Wootton, with the university being dismissed for 124 to lose the match by an innings and 30 runs.  This was his only major appearance for Oxford University."]}, {"page": "List of cricketers who were killed during military service", "response": ["|Herbert Stewart"]}, {"page": "List of journalists killed during the Mahdist War", "response": ["* St. Leger Herbert (or St. Leger Algernon Herbert) (born 16 August 185019 January 1885), The Morning Post, the Canadian-born journalist was killed in a battle at Metammeh while covering the military actions of Major General Herbert Stewart, who himself was wounded on the same day. Two days earlier had reported on the deadly Battle of Abu Klea. Herbert was a military veteran and had been previously decorated for his service at the Battle of Tel el-Kebir, Egypt, in 1882."]}, {"page": "List of people from Hampshire", "response": ["*Herbert Stewart, army commander, was born in Sparsholt"]}, {"page": "1884 Birthday Honours", "response": ["*Colonel Herbert Stewart  Aide-de-Camp to the Queen"]}, {"page": "Battle of Abu Kru", "response": ["The Battle of Abu Kru (also known as the Battle of Gubat) was part of the British Sudan campaign.  It was fought on 19 January 1885, two days after the Battle of Abu Klea, between the British and the Mahdists.  The British force under General Sir Herbert Stewart numbered 1,200 while a large number of Mahdists, probably around 13–14,000 were in pursuit."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Herbert Stewart (1869) : H. Stewart (Hampshire)"]}, {"page": "General Stewart", "response": ["*Herbert Stewart (1843–1885), British Army major general"]}]}}