{"wiki_id": "http://www.wikidata.org/entity/Q3526306", "itemLabel": "Min Patel", "itemDescription": "Cricket player of England. (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Min_Patel", "wikipedia_page": {"main": "Minal Mahesh Patel (born 7 July 1970) is a retired Indian-born English cricketer who made two appearances in Test cricket for the England cricket team. He was a right-handed batsman and a slow left arm bowler, who primarily played for Kent County Cricket Club. As of 2018 he is the Second XI coach at Kent.\nBorn in Bombay (now called Mumbai), and educated in England at Dartford Grammar School and later Manchester Polytechnic, Patel's first-class cricket debut for Kent came at the end of the 1989 English cricket season, in a match against Middlesex. He became a regular in the Kent side over the following seasons, and in 1994 and 1995 \"took wickets for fun\"; indeed in 1994 he was the leading wicket-taker in England with 90 at a bowling average of 22.86. Pitches at Kent's home ground, the St Lawrence Ground, began to be prepared specifically for the spin bowling of Patel and Carl Hooper, despite the home side also boasting a seam attack of Alan Igglesden, Martin McCague, Dean Headley and Duncan Spencer.1996 saw Patel make his Test debut against the country of his birth, India. One of seven players to make their debut in the match at Edgbaston, Patel struggled to make an impact on a green wicket, only bowling ten overs in England's eight wicket win. Left out for the second Test at Lord's, he returned for the third Test at Trent Bridge. Again, Patel struggled on a pitch not suited to spin bowling, however he managed to take his maiden (and last) Test wicket; that of Sanjay Manjrekar, caught by Graeme Hick.Patel's career looked to be in jeopardy during 1997, when a combination of injuries sustained while teaching PE and whilst batting for his club side ruled him out for most of the season. He returned the following season, and performed consistently for them through the following eight seasons.Patel joined Central Districts for one season over the winter of 2005/2006, where he proved a useful asset in the side's State Championship victory, taking six wickets in the final. This came after he had been mentioned in relation to a possible recall to the England squad as cover for Ashley Giles on the tour of Pakistan.\nFollowing a recurring elbow injury, he announced his retirement from first-class cricket at the start of the 2008 season.", "link_mentions": [{"page": "July 7", "response": ["*  1970   – Min Patel, Indian-English cricketer"]}, {"page": "List of people from Gujarat", "response": ["|Min Patel || Sports || Indian cricketer"]}, {"page": "Kent County Cricket Club", "response": ["The Head of Talent Pathway in charge of the development of young cricketers at the club is former Second XI coach and player Min Patel.Patel appointed Head of Talent Pathway, Kent County Cricket Club, 2019-08-29. Retrieved 2020-01-07. Patel works alongside Mark Dekker who had previously coached Kent Women.Hathrill appointed Kent Women Head Coach, Kent County Cricket Club, 2019-11-19. Retrieved 2020-01-07. Former player Mark Ealham is a part-time coach with the club, also spending time coaching at The King's School, Canterbury.Mark Ealham, Management Team, Kent County Cricket Club. Retrieved 2018-10-31.", "The academy was established by former wicket-keeper Simon Willis.Simon Willis appointed Director of the newly formed Kent Cricket Academy, CricInfo, 2003-01-15. Retrieved 2016-06-01. Paul Farbrace and Philip Relf held lead coaching roles within the scheme until Willis was appointed as high performance director in 2011, serving in the role until May 2016 when he was appointed the high performance manager of Sri Lanka Cricket.Willis gets top Kent job, BBC sport, 2003-11-19. Retrieved 2016-06-01.Kent academy post for Relf, England and Wales Cricket Board, 2007-09-11. Retrieved 2016-06-01.Simon Willis named SL high performance manager, CricInfo, 2016-05-23. Retrieved 2016-06-01.Departing Kent coach Simon Willis praised after Sri Lanka nod, Canterbury Times, 2016-05-24. Retrieved 2016-06-01. Former Kent and England spin bowler Min Patel took over the running of the academy on an interim basis following Willis' departure before becoming Second XI coach in January 2017, with former Shropshire wicket-keeper Jason Weaver taking over the role as high performance director, the two jobs replacing Willis' former role.Second XI coach and high performance director appointed, Kent County Cricket Club, 2017-01-25. Retrieved 2017-01-25. When Weaver left the club in 2019, Patel took over the role, becoming the club's Head of Talent Pathway and working alongside former women's coach Mark Dekker."]}, {"page": "Dartford", "response": ["* Min Patel (born 1970), Kent and England cricketer"]}, {"page": "Warwickshire County Cricket Club in 2005", "response": ["The first day at the St Lawrence Ground, Canterbury saw Warwickshire and England left arm spin bowler Ashley Giles take 5 for 86, and Martin van Jaarsveld 118 as Kent finished on 342 for 9. At the end of a second day, Kent took their score to 347. Nick Knight, who scored 100, and Ian Bell, with 63, got Warwickshire off to a good start. But from 179 for 1, Min Patel and Amjad Khan bowled Kent into the match. Warwickshire finished the day on 288 for 7 off 100 overs.", "Warwickshire felt the loss of seamer Heath Streak to injury as they went down by a massive margin to a strong Kent side at Maidstone. Batting first, Warwickshire were 116 for 8 when Tony Frost departed for 23, Simon Cook and Amjad Khan having taken three wickets each. However, a ninth-wicket partnership of 97 between Streak and Neil Carter, along with a level-headed stand from the number 11 Neil Warren lifted Warwickshire to 252. As it turned out, it was nowhere near enough. Streak limpered off in his fifth over with a groin injury, leaving all-rounder Alex Loudon and Carter to do the brunt of the bowling, and they were woefully ineffective against Kent's batting line-up. Matthew Walker and Darren Stevens both made centuries for Kent, Martin van Jaarsveld chipped in with 62, while Loudon was Warwickshire's best bowler with three for 130, Kent amassed 569 – a lead of 317 runs. In the twenty overs remaining on the third day, Andrew Hall dug out two wickets for Kent, including England Test batsman Ian Bell for a duck. On a fourth-day pitch which turned plenty, Min Patel could take six for 53, as Warwickshire crumbled in a woeful heap for 153."]}, {"page": "Glamorgan County Cricket Club in 2005", "response": ["Glamorgan went down to their fifth defeat of the season at Sophia Gardens in Cardiff. After winning the toss and losing two wickets for 16, Kent's next eight wickets added over thirty times that as Kent ended with a total of 568, thanks mainly to 262 not out from Martin van Jaarsveld – the highest score of the English county season thus far – with Darren Stevens (80) and Min Patel (87) sharing partnerships of more than 125 runs with van Jaarsveld. Glamorgan had nine double-figure scores in reply, but unlike Kent they had no one to go past 70, and they were bowled out for 358 after six Kent bowlers had taken at least one wicket. The follow-on was enforced, and now Glamorgan had to be content with seven single-figure scores after Amjad Khan and Andrew Hall took care of their top order. Khan ripped out three early wickets – for which Glamorgan managed five runs, and Martin Saggers and Andrew Hall was responsible for the next two wicket, leaving the Welsh tem at 34 for 5. Their overseas player, Sourav Ganguly, who played in his second match this season, added 55% of the Glamorgan team score, making 142 in three hours before he was last out, caught by van Jaarsveld for 142. Kent were set a target of 51 in their second innings, which they achieved without loss of a wicket to win inside three days. Kent were deducted half a point for a slow over rate. (Cricinfo scorecard)", "Kent, as expected, beat Glamorgan, but were worried on occasion. Having been shaken early on as Glamorgan dug out four early wickets, Kent were lifted by a 267-run partnership between Darren Stevens (who made 208) and Andrew Hall (133) which helped them along the way to a final first-innings score of 587, with Min Patel taking 55 balls for a 64 from number nine. Six Glamorgan players were then out in single figures, Amjad Khan taking three for 68, but number three David Hemp stood tall with an unbeaten 171. Glamorgan were 188 for 9 at one point on day two, but survived to stumps to 236 for 9, and just kept going – their number 11, Huw Waters, made 34 from 192 balls, and he added 118 with Hemp, for the second-highest stand of the match."]}, {"page": "Sussex County Cricket Club in 2005", "response": ["Kent looked to be well on the way to posting a challenging total, as they were on 323 for 6 at stumps on day 2, with four of their batsmen making fifties. However, day three saw a total of twenty wickets tumble. First, Kent lost four wickets to be all out for 348, trailing by 30. Then, after Michael Yardy and Goodwin had rescued to Sussex to 89 for 2 after both openers had been removed for sub-20 scores, Sussex fell apart. Min Patel ran through the middle-order, Dane Amjad Khan took care of the tail, and Sussex were all out for 155, setting a target of 186. However, accurate bowling was enough to undo Kent, as no Kent batsmen passed 35 and Naved-ul-Hasan and Mushtaq Ahmed shared eight wickets – Kent were all out for 119, but retained the County Championship lead, as their closest competitors failed to win.", "Sussex' three main bowlers won them the game at Hove against Kent – James Kirtley took seven for 103, Rana Naved-ul-Hasan six for 124, and Mushtaq Ahmed five for 173 in the match, as Sussex took an eight-wicket victory. Sussex took three wickets in the first 45 minutes, courtesy of Kirtley and Rana, and for only 28 runs in reply. Matthew Walker and Darren Stevens added 52 together for the fourth wicket, but it was the half-centuries from Min Patel and Niall O'Brien – his second in successive matches – that carried Kent past 200. They finished on 257, with Kirtley and Naved-ul-Hasan taking four wickets each, while Mushtaq had to be content with two for 81 from nearly 28 overs. Sussex, however, ground out 47 for 2 wickets in the 23 remaining overs, the Kent spinners Patel and Jamie Tredwell keeping them from scoring."]}, {"page": "British Asian", "response": ["* Min Patel"]}, {"page": "Kent County Cricket Club in 2005", "response": ["|Min Patel ||  ||  || Right-handed || Slow left arm orthodox || ", "The first day at the St Lawrence Ground saw Warwickshire and England left arm spin bowler Ashley Giles take 5 for 86, and Martin van Jaarsveld 118 as Kent finished on 342 for 9. At the end of a second day, Kent took their score to 347. Nick Knight, who scored 100, and Ian Bell, with 63, got Warwickshire off to a good start. But from 179 for 1, Min Patel and Amjad Khan bowled Kent into the match. Warwickshire finished the day on 288 for 7 off 100 overs.", "In reply, Nottinghamshire collapsed uncharacteristically, with Simon Cook taking four for 38 as only opener Darren Bicknell passed 25 in Nottinghamshire's innings. At stumps on day 2, Nottinghamshire were 169 for 9, just ahead of the follow-on target, and the last pair added a further 15 early on. Kent scored runs briskly, and despite both their South Africans – Martin van Jaarsveld and Andrew Hall – getting ducks, they racked up 298 for 8 in 72 overs – helped by the 32 extras. Nottinghamshire, chasing a massive 416 to win, imploded, Danish bowler Amjad Khan taking the wickets of David Hussey and Chris Read in quick succession to, with the help of Min Patel, reduce the hosts from 114 for 3 to 116 for 6. Even a last-wicket stand of 73 between Sidebottom (31) and 20-year-old Oliver Newby (38 not out) did not help, as Patel eventually had Sidebottom stumped. Hall got the best bowling figures for Kent in the second innings, recording four for 42 including both Nottinghamshire openers.", "Min Patel then took timely wickets to reduce Surrey to 67 for 3, but Rikki Clarke and Jonathan Batty rescued Surrey with a fourth-wicket partnership of 99. Ali Brown then continued the good work with 56, allowing Clarke to reach his century and give Surrey the lead. However, Patel continued to chip away and ended with six for 124 off 38 overs, and Surrey were bowled out for 324, leading by 62 in what shaped up to be a close match. Before stumps, Kent lost the wicket of David Fulton for 18, but still made 37 for 1. With Key and van Jaarsveld finally playing up to their potential, Key scoring 189 and van Jaarsveld 168, the Surrey bowlers were shown to be rather inadequate as Kent racked up 467 for 4 declared to set Surrey a massive 406 to win in a day.", "Glamorgan went down to another heavy defeat at Sophia Gardens in Cardiff. After winning the toss and losing two wickets for 16, Kent fought back to make a mammoth 568, thanks mainly to 262 not out from Martin van Jaarsveld – the highest score of the English county season so far – with Darren Stevens (80) and Min Patel (87) offering valuable support. Although Glamorgan did not collapse, it was clear they were not going to threaten their visitors' score. A number of batsmen got in with David Hemp and Sourav Ganguly both making 69, but the innings ended on 358. The follow-on was enforced, and Glamorgan went into freefall when they had to bat again. Amjad Khan ripped out three early wickets – for which Glamorgan only scampered five runs, and Kent took the next two wickets for 29 runs, leaving the Welsh team precariously placed at 34 for 5, before Ganguly saved the innings with a thumping three-hour 142. The late rally, however, was only enough to force Kent to make 51 runs in their second innings, which they achieved without loss of a wicket to win inside three days. Kent were deducted half a point for a slow over rate. (Cricinfo scorecard)", "Warwickshire felt the loss of seamer Heath Streak to injury as they went down by a massive margin to a strong Kent side at Maidstone. Batting first, Warwickshire were 116 for 8 when Tony Frost departed for 23, Simon Cook and Amjad Khan having taken three wickets each. However, a ninth-wicket partnership of 97 between Streak and Neil Carter, along with a level-headed stand from the number 11 Nick Warren lifted Warwickshire to 252. As it turned out, it was nowhere near enough. Streak limped off in his fifth over with a groin injury, leaving all-rounder Alex Loudon and Carter to do the brunt of the bowling, and they were woefully ineffective against Kent's batting line-up. Matthew Walker and Darren Stevens both made centuries for Kent, Martin van Jaarsveld chipped in with 62, while Loudon was Warwickshire's best bowler with three for 130, Kent amassed 569 – a lead of 317 runs. In the twenty overs remaining on the third day, Andrew Hall dug out two wickets for Kent, including England Test batsman Ian Bell for a duck. On a fourth-day pitch which turned plenty, Min Patel could take six for 53, as Warwickshire crumbled in a woeful heap for 153.", "Kent looked to be well on the way to posting a challenging total, as they were on 323 for 6 at stumps on day 2, with four of their batsmen making fifties. However, day three saw a total of twenty wickets tumble. First, Kent lost four wickets to be all out for 348, trailing by 30. Then, after Michael Yardy and Goodwin had rescued to Sussex to 89 for 2 after both openers had been removed for sub-20 scores, Sussex fell apart. Min Patel ran through the middle-order, Amjad Khan took care of the tail, and Sussex were all out for 155, setting a target of 186. However, accurate bowling was enough to undo Kent, as no Kent batsmen passed 35 and Naved-ul-Hasan and Mushtaq Ahmed shared eight wickets – Kent were all out for 119, but retained the County Championship lead, as their closest competitors failed to win.", "In reply, Richard Clinton and Jonathan Batty put on 107 for the first wicket, as the match headed towards a draw. However, patient work from spinner Min Patel, who was asked to bowl 47 overs, yielded four wickets (all of whom batted from number six and down) for 110 runs, and Patel was supported by two wickets by Andrew Hall to limit Kent's target to 231. After a frantic 34 overs, during which Mohammad Akram no-balled four times in his six overs while taking two for 30, Justin Kemp showed his skill at hitting quick runs as he made 47 not out, with three sixes, off 37 balls. In the end, Kent won with five balls remaining before the umpire would call time, and Surrey were also deducted half a point for a slow over rate. ", "Kent, as expected, beat Glamorgan, but were worried on occasion. Having been shaken early on as Glamorgan dug out four early wickets, Kent were lifted by a 267-run partnership between Darren Stevens (who made 208) and Andrew Hall (133) which helped them along the way to a final first-innings score of 587, with Min Patel taking 55 balls for a 64 from number nine. Six Glamorgan players were then out in single figures, Amjad Khan taking three for 68, but number three David Hemp stood tall with an unbeaten 171. Glamorgan were 188 for 9 at one point on day two, but survived to stumps to 236 for 9, and just kept going – their number 11, Huw Waters, made 34 from 192 balls, and he added 118 with Hemp, for the second-highest stand of the match.", "Darren Stevens and Robert Key both passed 1000 first-class runs for the season as they lifted Kent to a competitive total at The Rose Bowl. Stevens top-scored with 101, while Hampshire's Australian all-rounder Andy Bichel took four for 122 – but was thoroughly smacked about by Min Patel and Amjad Khan on the second morning. The pair added 65 for the final wicket to take Kent to a first-innings total of 446. Sean Ervine hit plenty of boundaries in reply, as Hampshire eased to 82 for 1 before play was stopped due to bad weather.", "On day three, however, Kent hit back. In 33 fiery overs before lunch, Amjad Khan and Min Patel both took two wickets, and despite more runs from Ervine – who finished with 74 – Hampshire crumbled to 182 for 7 at lunch. However, Andy Bichel and Nic Pothas added 138 for the eighth wicket, as Hampshire eked out 325, with Bichel top-scoring from number nine with 87 off 90 balls. Kent got a good start to their attempt to get quick runs and put a big target up for Hampshire, as they moved to 140 for 4 just before the close of play, but Shane Watson took two quick wickets and Shaun Udal one, and all of a sudden it was up to Justin Kemp and Andrew Hall to save Kent, as they were 153 for 7 overnight. Kemp fell on the fourth morning, as Kent rolled over for 185, setting up a potentially exciting finish with 307 runs to get in 83 overs. A 95-run partnership between Sean Ervine and John Crawley put Hampshire into a good position at 139 for 1, but Hampshire failed to score quickly enough, and three wickets from Simon Cook could not quite force a victory as Hampshire hung on to finish on 241 for 8 and draw the match.", "Only 36 overs of play was possible on the first day at the St Lawrence Ground, in which Middlesex made 92 runs for the loss of one wicket, that of Ben Hutton. The following day, Kent bowler Amjad Khan added two wickets to his overnight tally of one, as Middlesex crumbled to 136 for 4 on the second morning. However, centuries from Owais Shah and Paul Weekes swung it Middlesex' way, as they declared on 400 for 8. Kent's openers did not wish to be any worse, with David Fulton making 110 and Robert Key 142, and Darren Stevens supplied with the fifth century of the match, making 106 before being bowled by Nantie Hayward. They declared on 549 for 6, leaving themselves roughly three hours in which to bowl Middlesex out for 149 or less, and four wickets from Min Patel gave them hope as Middlesex crashed to 77 for 6 with more than an hour to play. However, Peter Trego kept out 98 balls for a stolid, unbeaten 3, Paul Weekes got a fifty, and Middlesex saved the draw.", "Sussex' three main bowlers won them the game at Hove against Kent – James Kirtley took seven for 103, Rana Naved-ul-Hasan six for 124, and Mushtaq Ahmed five for 173 in the match, as Sussex took an eight-wicket victory. Sussex took three wickets in the first 45 minutes, courtesy of Kirtley and Rana, and for only 28 runs in reply. Matthew Walker and Darren Stevens added 52 together for the fourth wicket, but it was the half-centuries from Min Patel and Niall O'Brien – his second in successive matches – that carried Kent past 200. They finished on 257, with Kirtley and Naved-ul-Hasan taking four wickets each, while Mushtaq had to be content with two for 81 from nearly 28 overs. Sussex, however, ground out 47 for 2 wickets in the 23 remaining overs, the Kent spinners Patel and Jamie Tredwell keeping them from scoring."]}, {"page": "Hampshire County Cricket Club in 2005", "response": ["Darren Stevens and Robert Key both passed 1000 first-class runs for the season as they lifted Kent to a competitive total at The Rose Bowl. Stevens top-scored with 101, while Hampshire's Australian all-rounder Andy Bichel took four for 122 – but was thoroughly smacked about by Min Patel and Amjad Khan on the second morning. The pair added 65 for the final wicket to take Kent to a first-innings total of 446. Sean Ervine hit plenty of boundaries in reply, as Hampshire eased to 82 for 1 before play was stopped due to bad weather.", "On day three, however, Kent hit back. In 33 fiery overs before lunch, Amjad Khan and Min Patel both took two wickets, and despite more runs from Ervine – who finished with 74 – Hampshire crumbled to 182 for 7 at lunch. However, Andy Bichel and Nic Pothas added 138 for the eighth wicket, as Hampshire eked out 325, with Bichel top-scoring from number nine with 87 off 90 balls. Kent got a good start to their attempt to get quick runs and put a big target up for Hampshire, as they moved to 140 for 4 just before the close of play, but Shane Watson took two quick wickets and Shaun Udal one, and all of a sudden it was up to Justin Kemp and Andrew Hall to save Kent, as they were 153 for 7 overnight. Kemp fell on the fourth morning, as Kent rolled over for 185, setting up a potentially exciting finish with 307 runs to get in 83 overs. A 95-run partnership between Sean Ervine and John Crawley put Hampshire into a good position at 139 for 1, but Hampshire failed to score quickly enough, and three wickets from Simon Cook could not quite force a victory as Hampshire hung on to finish on 241 for 8 and draw the match."]}, {"page": "Surrey County Cricket Club in 2005", "response": ["Min Patel then took timely wickets to reduce Surrey to 67 for 3, but Rikki Clarke and Jonathan Batty rescued Surrey with a fourth-wicket partnership of 99. Ali Brown then continued the good work with 56, allowing Clarke to reach his century and give Surrey the lead. However, Patel continued to chip away and ended with six for 124 off 38 overs, and Surrey were bowled out for 324, leading by 62 in what shaped up to be a close match. Before stumps, Kent lost the wicket of David Fulton for 18, but still made 37 for 1. With Key and Martin van Jaarsveld finally playing up to their potential, Key scoring 189 and van Jaarsveld 168, the Surrey bowlers were shown to be rather inadequate as Kent racked up 467 for 4 declared to set Surrey a massive 406 to win in a day.", "In reply, Richard Clinton and Jonathan Batty put on 107 for the first wicket, as the match headed towards a draw. However, patient work from spinner Min Patel, who was asked to bowl 47 overs, yielded four wickets (all of whom batted from number six and down) for 110 runs, and Patel was supported by two wickets by Andrew Hall to limit Kent's target to 231. After a frantic 34 overs, during which Mohammad Akram no-balled four times in his six overs while taking two for 30, Justin Kemp showed his skill at hitting quick runs as he made 47 not out, with three sixes, off 37 balls. In the end, Kent won with five balls remaining before the umpire would call time, and Surrey were also deducted half a point for a slow over rate. "]}, {"page": "Middlesex County Cricket Club in 2005", "response": ["Only 36 overs of play was possible on the first day at St Lawrence Ground, in which Middlesex made 92 runs for the loss of one wicket, that of Ben Hutton. The following day, Kent bowler Amjad Khan added two wickets to his overnight tally of one, as Middlesex crumbled to 136 for 4 on the second morning. However, centuries from Owais Shah and Paul Weekes swung it Middlesex' way, as they declared on 400 for 8. Kent's openers didn't wish to be any worse, with David Fulton making 110 and Robert Key 142, and Darren Stevens supplied with the fifth century of the match, making 106 before being bowled by Nantie Hayward. They declared on 549 for 6, leaving themselves roughly three hours in which to bowl Middlesex out for 149 or less, and four wickets from Min Patel gave them hope as Middlesex crashed to 77 for 6 with more than an hour to play. However, Peter Trego kept out 98 balls for a stolid, unbeaten 3, Paul Weekes got a fifty, and Middlesex saved the draw."]}, {"page": "Mark Dekker", "response": ["After retirement Dekker coached cricket at Tonbridge School in Kent, England. In 2017 he was appointed as a Community Cricket Officer at Kent County Cricket ClubMark Dekker appointed Community Cricket Officer, Kent County Cricket Club, 2017-04-20. Retrieved 2017-11-30. and in December 2018 became the head coach of Kent Women.Former international cricketer to coach Kent Women, Kent County Cricket Club, 2018-12-17. Retrieved 2018-12-18. After leading the women's side to the Women's County Championship title in 2019, Dekker took up a coaching role with the Kent Academy, working alongside Head of Talent Pathway and former Second XI coach Min Patel.Patel appointed Head of Talent Pathway, Kent County Cricket Club, 2019-08-29. Retrieved 2020-01-07.Hathrill appointed Kent Women Head Coach, Kent County Cricket Club, 2019-11-19. Retrieved 2020-01-07."]}, {"page": "Dartford Grammar School", "response": ["*Min Patel (born 1970), international cricketer"]}, {"page": "Rob Ferley", "response": ["He made his Second XI debut for Kent in 1999 and made his List A cricket debut for the Kent Cricket Board in September 2001 in the second round of the 2002 Cheltenham & Gloucester Trophy. He made his senior Kent debut in July 2003 in the County Championship. Ferley left Kent to join Nottinghamshire at the end of the 2006 season after finding it difficult to dislodge Min Patel from the Kent team. He played for Nottinghamshire in 2007 and 2008 before returning to Kent for the 2009 and 2010 seasons before being released in July 2010.Kent to release Rob Ferley and Warren Lee, Kent County Cricket Club, 2010-07-27. Retrieved 2017-06-19."]}, {"page": "Eastbourne College", "response": ["* Min Patel"]}, {"page": "Bexley Cricket Club", "response": ["Members of Bexley Cricket Club who have gone on to play test cricket for England include Robert Key, Min Patel, James Tredwell and Arthur Wellard. England disabled cricketer Frederick Dove is also associated with the club."]}, {"page": "Marylebone Cricket Club cricket team in Bangladesh in 1999–2000", "response": ["Marylebone Cricket Club (MCC) toured Bangladesh in January 2000 and played five matches including one first-class against the Bangladesh national team which was elevated to Test status later in the year, having been granted full membership of the International Cricket Conference (the ICC). The first-class match was drawn. MCC were captained by Min Patel and Bangladesh by Aminul Islam."]}, {"page": "Basanta Regmi", "response": ["Later in the year, he played in the 2008 ACC Trophy Elite in Malaysia. In 2009, he played in a three-day match against the Marylebone Cricket Club, taking 3/20 and 3/27 to help lead his team to an innings win over an MCC side captained by former England Test cricketer Min Patel.Scorecard of Nepal v MCC, 27–29 March 2009 at CricketArchive He also played in the ACC Twenty20 Cup the same year."]}]}}