{"wiki_id": "http://www.wikidata.org/entity/Q3529002", "itemLabel": "Jack Brown", "itemDescription": "Cricket player of England. (1869-1904)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Brown_(cricketer)", "wikipedia_page": {"main": "John Thomas Brown (20 August 1869 – 4 November 1904) known as Jack Brown, was an English professional cricketer, who played primarily as a batsman. He was Yorkshire's first great opening batsman, a lineage continued by Herbert Sutcliffe, Len Hutton and Geoffrey Boycott. He took five wickets in an innings on three occasions with his leg breaks, but except in 1901 (when he claimed 57 wickets) he generally bowled little.", "link_mentions": [{"page": "John Brown", "response": ["*Jack Brown (cricketer) (1869–1904), English cricketer", "*Jack Brown (disambiguation)"]}, {"page": "1894 in sports", "response": ["* Wisden Five Young Batsmen of the Season – Bill Brockwell, Jack Brown, C B Fry, Tom Hayward, Archie MacLaren"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Jack Brown"]}, {"page": "Bramall Lane", "response": ["In 1897, Jack Brown and John Tunnicliffe recorded a first wicket score of 378 against Sussex—a ground record that has never been beaten. Brown's score of 311 and Yorkshire's innings of 681 for 5 declared were also records when the cricket ground closed.150 Years of Bramall Lane by Peter Goodman and Steve Hutton  Other notable scores include the 582 for 7 declared they piled up against Surrey in 1935 and the 579 posted against the touring South Africans in 1951. Six other scores in excess of 500 were made. In contrast there were a host of scores under 100, mainly in the 19th century, although Derbyshire's paltry total of 20 in 1939 remains the lowest ever score. Nottinghamshire were dismissed for 24 in 1888 but Kent showed the Yorkshire batsmen up in 1865, bowling them out for 30. Many of the low totals were made on rain affected, uncovered wickets.", "In addition Jack Brown's triple century 10 double centuries were scored on the ground, Sir Len Hutton scored unbeaten two double tons, a 280* against Hampshire in 1939 and 271* against Derbyshire in 1937. W Barber posted 255 against Surrey in 1935 while the great Indian batsman V.S. Hazare scored 244 not out for the Indian tourists in the first season after World War II."]}, {"page": "Yorkshire County Cricket Club", "response": ["Hawke succeeded Emmett in 1883 and remained as official captain for 27 years, but at first he was careful to take his time and did not make too many changes. Yorkshire improved in 1883 and finished second behind Nottinghamshire in the unofficial County Championship. However, the remainder of the 1880s was disappointing for the team and its supporters. Kilburn said that Yorkshire \"continued to be an unreliable side, mingling brilliant achievement with miserable performance\". The basic problem was that the older players were past their peak while younger replacements did not make the progress expected. A poor season on the field in 1889 was reflected by reduced income and changes were made with several good new players being introduced. These included Jack Brown, David Hunter and Stanley Jackson, while Bobby Peel was becoming increasingly effective as a bowling all-rounder. They were followed by John Tunnicliffe, David Denton, Ted Wainwright and George Hirst. Hawke worked on fielding practice and the players became specialised and efficient as fielders.", "* Jack Brown"]}, {"page": "Martin Hawke, 7th Baron Hawke", "response": ["Although some people assumed that Hawke had turned his back on Yorkshire, he returned with new vigour in 1886 to begin what he himself referred to as his consistent association with the county. While Hawke had formerly been the figurehead who tossed the coin, he now took complete charge of operations and began the transformation of the team in earnest.Coldham, p. 47. The team that Hawke inherited from Emmett, which Hawke referred to as \"the boys of my old brigade\", was in decline by 1886 and several players would retire or be dismissed during the next couple of years so that, by the end of the 1887 season, it was clear that Yorkshire faced what Coldham called \"a protracted period of rebuilding\".Coldham, p. 59. Within the next seasons, the likes of Ted Peate, Billy Bates, Tom Emmett, Louis Hall and George Ulyett had all retired. Left arm spinner Bobby Peel, wicket-keeper David Hunter, all-rounder George Hirst, opening batsman Jack Brown and the amateurs Stanley Jackson and Ernest Smith were among the replacements who formed Yorkshire's successful teams of the 1890s and 1900s.Hodgson, p. 53."]}, {"page": "Bobby Peel", "response": ["Amid great public interest—the game was advertised as \"the match of the century\"Knox, p. 254.—and great tension,Frith, pp. 158–59. the decisive final Test match was played. Peel took four wickets in Australia's first innings, then scored 73 runs in England's first innings, sharing a 162-run partnership with Archie MacLaren.Frith, pp. 167–70. In Australia's second innings, Peel took three more wickets to return match figures of seven for 203 in 94 overs.Frith, p. 173. Jack Brown scored a century to guide England towards a target of 297, and Peel eventually hit the winning runs.Frith, pp. 179, 182. Peel ended the series with 27 wickets at 26.70, second in the averages behind Tom Richardson, and 168 runs at 18.67, placing him sixth in the batting averages.Frith, p. 184. David Frith suggests that this series was vital in establishing the importance of Test cricket, and that the interest felt in both England and Australia, and the coverage by the press, set up the pattern and expectations of future Test series.Frith, p. 196. In all first-class games, Peel scored 421 runs at 21.05, to be eighth in the averages, and took 57 wickets at 25.28, placing him third in the averages behind Richardson and Briggs, although the latter had fewer wickets.Wynne-Thomas, p. 40."]}, {"page": "Partnership (cricket)", "response": ["|Jack Brown and John Tunnicliffe"]}, {"page": "1894 English cricket season", "response": ["*Wisden (Five Young Batsmen of the Season) – Bill Brockwell, Jack Brown, C B Fry, Tom Hayward, Archie MacLaren ", "|Jack Brown || North of England, Yorkshire || 31 || 1399 || 30.41 || 3 || 8"]}, {"page": "1897 English cricket season", "response": ["|Jack Brown || Yorkshire || 22 || 1431 || 43.36 || 3 || 6", "|Jack Brown || North of England, Players, Yorkshire || 29 || 1809 || 42.06 || 3 || 9"]}, {"page": "George Alfred Wilson", "response": ["Born in Amersham, Buckinghamshire, Wilson opened the bowling in Worcestershire's very first County Championship match against Yorkshire on 4 May 1899, and made his mark at once by dismissing England batsman Jack Brown before Yorkshire had scored a run. He continued in the same vein, finishing with an outstanding debut innings return of 8–70, although he was less successful (2–69) in the second innings and Worcestershire were defeated by 11 runs thanks to 6–19 from John Brown. "]}, {"page": "List of Test cricketers", "response": ["Jack Brown ·"]}, {"page": "John Tunnicliffe", "response": ["Tunnicliffe was born at Low Town, Pudsey, Yorkshire, England.  He was a tall, forceful right-handed opening batsman, and on his figures one of the best slip fielders of all time. A late starter in first-class cricket, he was a regular in the Yorkshire team from 1893 and, between 1895 and 1907, scored 1,000 runs in every season except 1903. His best year was 1898, when he scored 1,804 runs at an average of 41.00 runs per innings. That season he made his highest score, contributing 243 in a then-record partnership for any wicket of 554 with Jack Brown against Derbyshire at Queen's Park, Chesterfield. That stand is still the third highest for the first wicket, and the sixth highest for any wicket, in first-class cricket worldwide. Tunnicliffe was named as a Wisden Cricketer of the Year in 1901."]}, {"page": "List of first-class cricket records", "response": ["| 554 (1st wicket) || Jack Brown & John Tunnicliffe (Yorkshire)Yorkshire won the toss and batted first, scoring 662, including centuries from Jack Brown (300) and John Tunnicliffe (243).  Openers Brown and Tunnicliffe put on 554 for Yorkshire's first wicket.  In reply Derbyshire made 118 and, following on, 157.  Yorkshire won by an innings and 387 runs.  Scorecard || v Derbyshire || Chesterfield || 1898"]}, {"page": "Queen's Park, Chesterfield", "response": ["| 554 (1st wicket) || Yorkshire || Jack Brown (300) || John Tunnicliffe (243) || v. Derbyshire || 1898"]}, {"page": "English cricket team in Australia in 1894–95", "response": ["England was captained by Andrew Stoddart and had Hylton Philipson as its specialist wicket-keeper, the other players being Johnny Briggs, Bobby Peel, Jack Brown, Tom Richardson, Bill Lockwood, Archie MacLaren, Albert Ward, Bill Brockwell, Francis Ford, Walter Humphreys and Leslie Gay."]}, {"page": "Jack Brown", "response": ["Jack Brown or Browne may refer to:", "*John Alf Brown (1881–1936), known as Jack Brown, Welsh rugby player", "*Jack Brown (Australian footballer) (1886–1950), Australian rules footballer for St Kilda", "*Jack Brown (cricketer) (1869–1904), English cricketer", "*Jack Brown (footballer, born 1899) (1899–1962), English football goalkeeper", "*Jack Brown (footballer, born 2001), Scottish footballer", "*Jack Brown (rugby league) (born 2000), English rugby league player", "*Jack Brown (trade unionist) (1929-1991), British trade union leader", "*Jack Browne, Baron Craigton (1904–1993), Scottish Tory politician", "*Jack Brown Genius, a New Zealand romantic fantasy film"]}, {"page": "Derbyshire County Cricket Club in 1898", "response": ["Derbyshire  played sixteen games in the County Championship in 1898 and one match against MCC. The captain for the year was Sydney Evershed in his eighth season as captain. William Storer was top scorer with three centuries which he achieved while also bowling to take 28 wickets and being a useful wicket-keeper. George Davidson took most wickets at 65 as well as scoring a century. The season saw many high scores, and against Hampshire in August, four Derbyshire players Levi Wright, William Storer, William Chatterton and George Davidson scored centuries followed by two more from the Hampshire players in the same match. The Derbyshire total of 645 runs was to remain their highest match score until it was surpassed in the 2007 season.Bygone Derbyshire - Run Crazy Derbyshire A Cricket Record  Two matches later,  Yorkshire set a record score against Derbyshire of 662 runs when Jack Brown scored 300 and John Tunnicliffe 243 in Walter Sugg's benefit match before Brown deliberately knocked down his wicket. It remained a national partnership record until two more Yorkshiremen, Percy Holmes and Herbert Sutcliffe, made 555 for the first wicket against Essex at Leyton in 1932.W.T. Taylor History of Derbyshire cricket Wisden 1953"]}, {"page": "1897 County Championship", "response": ["|style=\"text-align:center;\"| 1,431 ||style=\"text-align:center;\"| 43.36 || Jack Brown || Yorkshire"]}, {"page": "1898 County Championship", "response": ["In April, John Tunnicliffe and Jack Brown of Yorkshire, set a then-record partnership for any wicket of 554, against Derbyshire at Queen's Park, Chesterfield."]}, {"page": "History of Yorkshire County Cricket Club (1883–1918)", "response": ["At the end of the 1889 season, several players were cut from the team, probably at the instigation of Hawke. Ellison, the Yorkshire President, named drunkenness as a factor in comments to the committee. However, the poor results seem to have been anticipated and several players made their debuts in 1889 and 1890 who would go on to be successful for the club, including Jack Brown, David Hunter and Stanley Jackson, while Bobby Peel was becoming increasingly effective as a bowling all-rounder. However, these players took time to become established and stalwarts of the team in the previous decade, such as Louis Hall and George Ulyett, were coming to the end of their careers. The additional strain of the absence of players selected for representative games meant that a slight revival in 1890 to third in the first official County Championship table, was followed by another poor season in 1891 when the team finished eighth out of nine. Criticism of the management produced \"self-defence in the annual report\" and, in 1893, the club was reorganised to properly represent the whole county. Further reorganisation came when Ellison died in 1898 and Hawke assumed the club presidency as well as captaincy; when Wostinholm retired in 1902 after being club secretary for 38 years, the county offices were moved from Sheffield to the more central location of Leeds."]}, {"page": "Herbert Sutcliffe's cricket career (1919–1927)", "response": ["Sutcliffe's overall record in 1923 was 2,220 runs at 41.11 with 3 centuries, 15 fifties and a highest score of 139 against Somerset.  Holmes also topped 2,000 runs in the season and shared in 9 century stands with Sutcliffe, taking their overall tally to 25 and beating the record of 19 set by John Tunnicliffe and Jack Brown from 1895 to 1903.  The Yorkshire cricket historian Alfred Pullin wrote: \"it was recognised long before the season ended that Sutcliffe had established his claim to be considered one of England's first-wicket batsmen\".Hill, p.52."]}, {"page": "J. T. Brown", "response": ["**Jack Brown (cricketer) (1869–1904), cricketer for Yorkshire and England"]}, {"page": "Edwin Woodward", "response": ["Woodward made his debut in first-class cricket for Liverpool and District against the touring Australians in 1888 at Aigburth Cricket Ground, Liverpool. He played a second first-class match for Liverpool and District in 1890 against Yorkshire, during which he took the wickets of Louis Hall and Jack Brown, which were his only wickets in first-class cricket."]}]}}