{"wiki_id": "http://www.wikidata.org/entity/Q3526560", "itemLabel": "Alan Mullally", "itemDescription": "Cricket player of England. (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Mullally", "wikipedia_page": {"main": "Alan Mullally (born 12 July 1969) is a former English first-class cricketer, who played Tests and ODIs. Mullally grew up in Western Australia, and played for the Australian Under-19 side against their West Indian counterparts in 1987/88.", "link_mentions": [{"page": "July 12", "response": ["*  1969   – Alan Mullally, English cricketer and sportscaster"]}, {"page": "Sledging (cricket)", "response": ["|Glenn McGrath and Alan Mullally", "|Australian cricketer Glenn McGrath had a go at England's Alan Mullally who responded to the Australian's sledging with 'smirks and smiles'."]}, {"page": "Leicestershire County Cricket Club", "response": ["This team did not have many stars, but Aftab Habib, Darren Maddy, Vince Wells, Jimmy Ormond, Alan Mullally and Chris Lewis all had chances for England. West Indian all-rounder Phil Simmons was also named as one of Wisden's Cricketers of the year in 1997 while playing for the club.", "* Alan Mullally"]}, {"page": "Hampshire County Cricket Club in 2005", "response": ["*  Alan Mullally", "|  Alan Mullally"]}, {"page": "Don Pyke", "response": ["Pyke was recruited by the Claremont Football Club for the 1987 season, and played in the club's premiership win over . He also represented the Western Australia under-19 cricket team in two matches at the 1987–88 Australian Under-19 Championships, playing alongside future Test cricketers Brendan Julian and Alan Mullally.Victoria Under-19s v Western Australia Under-19s – cricketarchive.com. Retrieved 30 November 2011. After winning Claremont's best and fairest award (the E. B. Cook Medal) in 1988, playing mainly as an attacking rover, Pyke was recruited by the West Coast Eagles with a pre-draft selection in the 1988 VFL Draft. He was one of five pre-draft selections, with the others including future premiership players Peter Sumich, Craig Turley, and Scott Watters."]}, {"page": "Simon Brown (cricketer)", "response": ["Simon \"Smudge\" Brown was one of the myriad of left-arm bowlers tried by England during the 1990s. Others included Mark Ilott, Alan Mullally, Mike Smith and Paul Taylor. Like Smith, he was a One-Test Wonder, playing in only a single Test match, which England lost against Pakistan in 1996. Despite taking two wickets, getting Aamir Sohail out with his tenth ball, he never played for England again."]}, {"page": "Australian cricket team in England and Ireland in 2001", "response": ["|Alan Mullally"]}, {"page": "1999 Cricket World Cup squads", "response": ["| Alan Mullally"]}, {"page": "Template talk:WikiProject Biography/Missing", "response": ["*Alan Mullally"]}, {"page": "List of Victoria first-class cricketers", "response": ["||732||Alan Mullally||9 November 1990||1990/91||1"]}, {"page": "Mullally", "response": ["* Alan Mullally (born 1969), English cricketer"]}, {"page": "List of international cricket five-wicket hauls by Glenn McGrath", "response": ["*Alan Mullally", "*Alan Mullally"]}, {"page": "1988 Youth Cricket World Cup", "response": ["* Alan Mullally"]}]}}