{"wiki_id": "http://www.wikidata.org/entity/Q3526872", "itemLabel": "Laura Marsh", "itemDescription": "cricketer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Laura_Marsh", "wikipedia_page": {"main": "Laura Alexandra Marsh (born 5 December 1986) is an English former cricketer. Born in Pembury, Kent, she began playing cricket at 11 and started her career as a medium pace bowler but found greater success when she switched to off spin. She played county cricket for Kent Women, represents the Rubies and made her Test debut against India in 2006. She was part of the England team that retained the Ashes in Australia in 2008 and in England in 2009. She was also part of teams that won the Women's Cricket World Cup in 2009 and 2017. In December 2019, Marsh announced her retirement from international cricket, and announced her retirement from all forms of the game in August 2020.", "link_mentions": [{"page": "North Sydney Oval", "response": ["| 1 || 5/15 ||  || Laura Marsh ||  ||  || Won"]}, {"page": "England women's cricket team", "response": ["England won the 2009 World Cup, held in Australia, defeating New Zealand by 4 wickets in the final at North Sydney Oval. They lost only one match in the tournament, against Australia, while they defeated India, Pakistan, New Zealand, Sri Lanka and the West Indies. Claire Taylor was the most prolific batsman in the tournament and Laura Marsh the most successful bowler. Vice captain Nicki Shaw, restored to the team only due to injury to Jenny Gunn, took 4 wickets and hit a vital 17 not out to win the man of the match award in the final. Caroline Atkins, Sarah Taylor and captain Charlotte Edwards were prolific with the bat while bowlers Holly Colvin and Katherine Brunt dominated with the ball. Five England players were named in the composite ICC team of the tournament. Claire Taylor was named one of Wisden's five cricketers of the year,  the first woman to be honoured with the award in its 120-year history.", "England began with a win over Pakistan, although they were somewhat unconvincing. After an opening stand of 102 between captain Charlotte Edwards and Laura Marsh, England only scored 31 runs in their final 7 overs to finish 133–6. Pakistan never really threatened to cause an upset, and were bowled out for 90 including 4-9 for Holly Colvin. However, Danielle Wyatt suffered an ankle injury whilst bowling and this limited her bowling input for the remainder of the group stage. Any unease at England's first performance was quashed with a thumping nine wicket win over India in their second game, which saw them qualify for the knockout stage. India were limited to 116-6 off their 20 overs, before another impressive stand of 78 from Edwards and Marsh ended the game as a contest, with Edwards ending on 50* and winning the player of the match award.", "Despite the defeat, Charlotte Edwards ended as the highest run scorer across the tournament, and was thus named player of the tournament. She was joined in the team of the tournament by Laura Marsh, Sarah Taylor and Katherine Brunt.", "Following on from the disappointment of not winning the world Twenty20, England headed to India for the 2013 Women's Cricket World Cup, defending their 2009 title. England added Georgia Elwiss to their squad from the World Twenty20, and were in Group A with Sri Lanka, West Indies and hosts India. England's tournament got off to a disastrous start, losing a thrilling match to the unfancied Sri Lanka. Sarah Taylor, Laura Marsh and Anya Shrubsole all missed the game injured, and Sri Lanka won the toss and inserted England to bat. The toss would prove crucial many times in this tournament, as the early start times meant that batting during the first hour was extremely difficult, and so it proved in this match, with Charlotte Edwards, Danielle Wyatt and Lydia Greenway all out within the first eight overs. Arran Brindle (31) and Heather Knight (38) lead the recovery, but as soon as England had gained the ascendancy they were both dismissed. It was left to vice-captain Jenny Gunn and debutant Amy Jones to get England to a defendable score, and they did, with Gunn making 52 and Jones 41. Some late hitting from Katherine Brunt and Danielle Hazell lifted England to 238–8, and it seemed as though the disaster the early wickets had promised had been averted. Sri Lanka however pulled off a stunning victory, Chamari Athapaththu scoring 62, and supported by Mendis and Siriwardene, put Sri Lanka in an extremely strong position. Brunt and Elwiss struck back for England, before a brutal 56 from Eshani Lokusuriyage took Sri Lanka to within a run of victory. She was run out in the final over, but Dilani Manodara hit the final ball of the match from Elwiss for six as Sri Lanka won by just one wicket, their first every victory over England.", "The Ashes began with the four-day Test match at Wormsley, with Australia making strong progress on the first day, reaching 243–3 at the close on a slow pitch. This was extended to 331-6 declared before lunch on the second day, Sarah Elliott completing her maiden Test century. Arran Brindle departed early, but a flowing fifty partnership from Heather Knight and Sarah Taylor put England in the ascendancy. Taylor was dismissed by Holly Ferling as England dramatically slumped to 113-6 and were in sudden danger of being forced to follow on. That they did not was due to a partnership of 156 between Knight and Laura Marsh, which ultimately saw England cede only a lead of 17 to Australia. Knight, in only her second Test, scored 157 in nearly seven hours of chanceless batting, winning her the player of the match award. Marsh's innings, 55 off 304 balls and 343 minutes, was one of the slowest international fifties recorded but helped England escape from the trouble they were in. From the close of England's 1st innings the match petered out into a draw, the slow pitch preventing either side from forcing victory.", "| 10 || Laura Marsh || 2006–2019 || 103", "| 3 || Laura Marsh || 2006–2019 || 103 || 102 || 129 || 26.84 || 5–15 || 3.89 || 41.3 || 3 || 1", "| Laura Marsh || 5–15 || 10.0 || Pakistan|| 12 March 2009", "| 9 || Laura Marsh || 2007–2019 || 67 || 53 || 755 || 16.41 || 54 || 101.07 || 1 || 0 || 92 || 7", "| 7 || Laura Marsh || 2007–2019 || 67 || 66 || 64 || 20.64 || 3–12 || 5.29 || 23.3 || 0 || 0"]}, {"page": "List of people educated at Brighton College", "response": ["*Laura Marsh (born 1986), England cricketer"]}, {"page": "Gray-Nicolls", "response": ["*  Laura Marsh"]}, {"page": "2006–07 ICC Women's Quadrangular Series", "response": ["* Laura Marsh"]}, {"page": "New South Wales Breakers", "response": ["* Laura Marsh (2006)"]}, {"page": "Sarah Andrews (cricketer)", "response": ["England won all the ODI matches except the last, which was washed out. Andrews played in the one-off Test at County Road in Worcestershire. Batting at No. 11, she scored 11 from 14 balls in Australia's 309, before taking 1/32 from an economical display of 20.3 overs to help Australia take a 41-run lead. Having caught Lydia Greenway early in the innings, she then bowled the final English batsman Laura Marsh for 38, ending a last-wicket partnership of 59. She then made 4 not out as Australia were bowled out for 231 to set the hosts a target of 273 before the match was drawn. She took 1/22—dismissing opener Caroline Atkins for a duck—from 13 overs in the second innings, meaning that she had conceded less than two runs per over throughout the match."]}, {"page": "2009 Women's Cricket World Cup", "response": ["England won the tournament, beating New Zealand in the final to claim their third World Cup title. England batter Claire Taylor was the leading run-scorer and Player of the Tournament, whilst teammate Laura Marsh was the leading wicket-taker. Australia, West Indies, India and Pakistan were eliminated at the Super Six stage, whilst  South Africa and Sri Lanka were eliminated in the first round.", "#  Laura Marsh"]}, {"page": "Alyssa Healy", "response": ["A Super Over eventuated, and Laura Marsh bowled for England. Healy came in at 1/3 after Leah Poulton fell on the fourth ball. She hit a two from the fifth ball, and was run out by Jenny Gunn while attempting to complete a second run on the sixth and final ball of Australia's Super Over, leaving them at 2/6. England also ended with 2/6 after a run out in an attempt to secure the winning run on the final ball. Australia was awarded the match because they had hit more sixes in the match—Jess Cameron scored the solitary six."]}, {"page": "2009 Women's Cricket World Cup squads", "response": ["Each team selected a squad of up to 15 players, and any changes to that squad due to illness or injury had to be requested in writing and approved by the ICC's Event Technical Committee. Three such replacements were made to the squads, with South Africa, Sri Lanka and the West Indies making a change. England entered the tournament with the top-ranked players in both the ICC's batting and bowling rankings, Claire Taylor and Isa Guha respectively, but Australia were commonly listed in the press as favourites to win the tournament. Taylor finished the tournament as the leading run-scorer, accumulating 324 runs, and her England teammate Laura Marsh was the most prolific wicket-taker, claiming 16 wickets."]}, {"page": "2009 Women's Cricket World Cup statistics", "response": ["| align=\"left\"|Laura Marsh || align=\"left\"| || 6 || 56.2 || 165 || 16 || 12 || 10.31 || 0 || 1 || 5/15 || 2.92 || 21.1", "| 5-15 (10)  || Laura Marsh ||  ||  || Sydney || 12 March 2009"]}, {"page": "Leah Poulton", "response": ["During the Australian winter of 2008, Poulton travelled to England and played for Nottinghamshire in the Women's County Championship. After making a duck on debut for the county, she made 68 in the next match against Sussex and ended her stay with 150 runs at 25.00 from six matches. She bowled 20.4 overs for the county, taking a total of 0/95. She was in better form for the Sapphires in the Super Fours, scoring three half-centuries in four innings and ending with 215 runs at 53.75 in four List A matches. She also top-scored in both T20 matches for the Sapphires, making 32 and 47. She also took 2/23 in the latter match, dismissing Jenny Gunn and Laura Marsh.", "Australia were grouped with England, South Africa and the West Indies. In the first match against England, Poulton ran out Laura Marsh, triggering the loss of the last four wickets without the addition of a run, in six balls, leaving 15 deliveries unused. In pursuit of 105 for victory, Poulton top-scored for Australia with 23 from 28 balls, helping to stabilise the innings after the Australians had fallen to 2/10. However, she fell at 4/45, bowled by Holly Colvin, and eventually, Rene Farrell was run out going for the winning run from the third last ball available, leaving the scores tied."]}, {"page": "Rene Farrell", "response": ["A Super Over eventuated, and Laura Marsh bowled for England. A strong hitter, Farrell was sent in with Leah Poulton. Farrell scored two runs from two balls, hitting a single from each delivery she faced. Poulton fell on the fourth ball and Alyssa Healy was run out on the sixth and final ball of Australia's Super Over while attempting a second run, leaving them at 2/6. England also ended with 2/6 after a run out in an attempt to secure the winning run on the final ball. Australia was awarded the match because they had hit more sixes in the match—Jess Cameron scored the solitary six."]}]}}