{"wiki_id": "http://www.wikidata.org/entity/Q3527070", "itemLabel": "Geoff Miller", "itemDescription": "Cricket player of England. (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoff_Miller", "wikipedia_page": {"main": "Geoffrey Miller,  (born 8 September 1952) is an English former cricketer, who played in 34 Test matches and 25 One Day Internationals for the England cricket team between 1976 and 1984. He played for Derbyshire from 1973 to 1986, captaining the side from 1979 to 1981 (following the sudden resignation of David Steele after six weeks in the role), and returned in 1990 after playing for Essex between 1987 and 1989. He was an England selector from 2008 to 2013 and was appointed President of Derbyshire C.C.C. in March 2014.\nThe cricket writer, Colin Bateman, noted, \"Geoff Miller concedes that he probably enjoyed cricket too much. He did not take it as seriously as some, And when it became a rigorous, grim-faced business, he was not sorry to bow out of an eight-year Test career that never reached the peaks many expected\". Likewise Simon Hughes referred to Miller in 1990 as being \"the only remaining player who unfailingly visited the opposing team's dressing room after play to thank them for the game ... [and] the last man to field at slip with a whoopee cushion up his jumper\"", "link_mentions": [{"page": "Ian Botham", "response": ["Botham made his Test début at Trent Bridge on 28 July 1977 in the third Test against Australia. His début was somewhat overshadowed by the return from self-imposed Test exile of Geoffrey Boycott. England went into the match with a 1–0 series lead having won the second Test after the first had been drawn. The series was played against the background of the so-called \"Packer Affair\" which resulted in the establishment of World Series Cricket in the next Australian season. Because of Tony Greig's involvement, he had been stripped of the England captaincy but remained in the team under new captain Mike Brearley. England had three all-rounders at Trent Bridge with Greig, Geoff Miller and Botham all playing. Australian captain Greg Chappell won the toss and decided to bat first. Australia scored 243 and were all out shortly before the close on day one. Botham, aged 21, made an immediate impact and took five for 74, the highlight being the wicket of Chappell, bowled for just 19. England batted all through day two and into day three as Boycott, in his first Test innings since 1974, and Knott both made centuries. Botham came in at number eight on day three and scored 25 before he was bowled by Max Walker. England were all out not long afterwards for 364, a first innings lead of 121. Botham had no joy in Australia's second innings with none for 60. A century by Rick McCosker enabled Australia to score 309 before they were all out in the evening session on day four. Bob Willis took five for 88. England needed 189 to win and completed the job, by seven wickets, well into the final day with Brearley scoring 81 and Boycott, who batted on all five days, 80 not out. Botham didn't get a second innings."]}, {"page": "September 8", "response": ["*  1952   – Geoff Miller, English cricketer"]}, {"page": "Chesterfield, Derbyshire", "response": ["*Geoff Miller (born 1952), England cricketer"]}, {"page": "Geoffrey Miller", "response": ["*Geoff Miller (born 1952), English cricketer", "*Geoff Miller (diplomat) (born 193?), former Australian public servant and diplomat", "*Geoff Miller (public servant) (1942–2014), former Australian public servant", "*Geoff Miller (priest) (born 1956), Archdeacon of Northumberland "]}, {"page": "Ashley Giles", "response": ["Following his retirement, in September 2007, Giles became Warwickshire's director of cricket, replacing Mark Greatbatch, ahead of Dermot Reeve.Giles succeeds Greatbatch at Warwickshire CricInfo retrieved 5 December 2007 In November two months later, Giles was named the official spin coach in the England Performance Programme.Giles named spin coach for England juniors CricInfo retrieved 5 December 2007 On 18 January 2008, Giles was added to a new four-man panel, along with Peter Moores and James Whitaker, headed by Geoff Miller, which replaced David Graveney in the role of national selector for the England team, the latter having been removed from the position and reinstated as a national performance manager.Graveney axed as England selector BBC News retrieved 18 January 2008"]}, {"page": "Bob Willis", "response": ["Botham, Geoffrey Boycott, Phil Edmonds, Graham Gooch, David Gower, Hendrick, Wayne Larkins, Geoff Miller, Chris Old, Derek Randall, Bob Taylor (wk) and Willis. England, who had no warm-up games, played their first match against Australia on 9 June at Lord's, whom they \"breezed\" past. Willis took one wicket for 20 runs from his 11 overs, surpassed by Boycott – who would be an unlikely bowling hero during the tournament – who took 2/15. Reduced to chasing 159, England proceeded slowly, with Brearley's 44 coming from 147 balls, and they reached the target at 47.1 overs. Their next game, against Canada, saw the visiting team routed for 45 with Willis taking 4/11 and Man of the Match Old taking 4/8. Boycott and Gooch finished the game within 13.5 overs. England's final Group A match on 16 June saw them defeat Pakistan by 14 runs. Willis hit three fours in his 24 from 37 balls to help England to 165/9, and his one wicket for 37 runs, along with Boycott's 2/14, helped England keep Pakistan from the target."]}, {"page": "Kevin Pietersen", "response": ["Pietersen was omitted from both of England's limited-overs squads to face Pakistan. However, the ECB brokered a loan move to Surrey for the remainder of the 2010 English cricket season which enables him to play first-class cricket whilst the England side plays Pakistan in the limited overs leg of the tour. Pietersen announced the omission and loan-move to Surrey early through a Twitter message, which contained a swear-word and was quickly removed, and he apologised the following day. The online outburst drew some criticism of him, with national selector Geoff Miller one of those criticising the message. During the lead up to the 2010/11 Ashes Series Pietersen signed up for two first-class games in the South African competition with the KwaZulu Natal Dolphins."]}, {"page": "Derbyshire County Cricket Club", "response": ["There have been more downs than ups in post-war years. Though runs came regularly from Arnold Hamer and less consistently from the West Indian Laurie Johnson and captain Donald Carr, the batting remained the weak point right up to the beginning of covered pitches in the 1980s. However, a series of seam bowlers served England as well as Derbyshire. The list began with Copson and continued with Cliff Gladwin, Les Jackson, Harold Rhodes, Alan Ward, Mike Hendrick and, most recently, Devon Malcolm and Dominic Cork. Spin was in short supply apart from the steady work of Edwin Smith and the under-rated all-rounder Geoff Miller, the current national selector of the England team and noted after-dinner speaker. The signing of Eddie Barlow, the famous South African, in 1976 and the lengthy period under the captaincy of Kim Barnett, starting in 1983, meant the side were rarely uncompetitive."]}, {"page": "Vic Marks", "response": ["The cricket correspondent Colin Bateman noted that \"in typical self-deprecating style, Vic Marks entitled one of his books, Marks Out of XI. He was probably out of the England XI slightly too often. While he was never a fashionable cricketer, he was a determined and highly effective off-spinner-cum-batsman whose Test figures stand comparison with those often picked ahead of him, such as Geoff Miller and Eddie Hemmings\"."]}, {"page": "Alastair Cook", "response": ["Cook made his return to international Twenty20 cricket during the tour of South Africa in 2009–10. After scoring 11 runs in the first match, Cook was handed the captaincy after Paul Collingwood picked up an injury prior to the second match but led them to an 84 run loss after posting only 26. In the second Test he scored a patient 118 after being saved by a third umpire referral at 64. This, along with a century from Ian Bell, gave England their only Test win of the drawn series with an innings margin. Despite a meagre performance in the rest of the series, it was quickly announced that England's 2010 tour against Bangladesh would see Strauss rested, with Cook taking on the captaincy role in the Test and One-Day teams as, what national selector Geoff Miller, \"an audition for future engagements\"."]}, {"page": "Bob Taylor (cricketer)", "response": ["Knott, the incumbent keeper for England, turned to World Series Cricket in 1977 on the encouragement of Tony Greig and was thus banned from Test cricket. Taylor was the next in line to take up the gloves, and returned to Test cricket on 14 December 1977 against Pakistan at the Gaddafi Stadium in Lahore. Although there had been three first-class warm-up fixtures, Taylor had not impressed with the bat and had been rotated out of the second game in order for Paul Downton to have a chance at the gloves. Taylor nevertheless got the nod for the first Test. Captained by fellow Wisden Cricketer of the Year Brearley, he took two catches and a stumping, and score a lengthy 32 from 158 deliveries supporting Geoff Miller who was eventually stranded on 98. He played in the following two Tests of the series, and though keeping tidily he was dismissed for a first ball duck – a score of zero – in the second Test, though improved with a slow (and then career best) 36 from 200 balls and 18 not out in the third match. He also played in the 2nd and 3rd One Day International fixtures. He remained the incumbent gloveman for the New Zealand leg of the tour, appearing in two warm up games and three Tests. He took four catches in the first, all from the bowling of Chris Old, and scored a career-best 45 in the second. His 236 runs across the entire tour came at 21.45, and he took 20 catches and a stumping.", "Taylor joined the England team for the winter Ashes series of 1978/79, commencing the tour by facing South Australia on 3 November 1978. Though it was a quiet game with the bat, Taylor was in strong form behind the stumps – collecting eight victims though the tourists went on to lose the match. Facing New South Wales on 17 November, Taylor hit a forgettable nine, however four more scalps came, two of them from what was becoming a prolific partnership, both for England and Derbyshire, with Geoff Miller."]}, {"page": "Steven Davies", "response": ["In October 2009, Davies was called up to England's Test squad for the first time. Geoff Miller, England's chairman of selectors, said \"Steven is a player of great potential who has been a consistent performer for his county and he will act as understudy to Matt Prior in South Africa\". Although part of the Test squad, Davies was not selected for the ODI squad on the tour."]}, {"page": "Glen Chapple", "response": ["Chapple was named Lancashire's Player of the Year for the 2002 Season. In August 2003, Chapple was one of three uncapped players – along with spin bowler Gareth Batty and batsman Ed Smith – to be selected in the England's 13-man squad from which the final team to face South Africa in the third Test at Trent Bridge would be chosen. According to Geoff Miller, one of the selectors, said the selectors had \"picked Gareth Batty and Glen Chapple as extra spin and quick bowling options, both of whom have performed well this season for their respective counties\". When he was chosen for the squad, Chapple had taken 27 wickets and averaged 45.18 with the bat for the season. Chapple was not selected for the final eleven."]}, {"page": "Dimitri Mascarenhas", "response": ["==Geoff Miller – Twitter outburst ==", "In 2010, Mascarenhas vented his frustration at the chairman of the England selectors, Geoff Miller, claiming to have been ignored by him at a game. He tweeted, calling Geoff Miller a 'knob' and other derogatory terms. He also pointed out that his teammate James Adams hit 194 runs in a match between Lancashire and Hampshire when Miller came to watch and Adams was not considered for the T20s."]}, {"page": "Nick Compton", "response": ["Despite this form Compton was dropped by England for the Ashes warm-up against Essex in favour of Joe Root, with Compton omitted from the squad and national selector Geoff Miller, describing Root as \"currently the best opening partner\" for Alastair Cook. On his 30th birthday, Compton's form continued with a defiant 81 for Somerset against the touring Australians at Taunton. Compton was rewarded for his form as the ECB arranged for him to play as a guest for Worcestershire in their tour match against Australia as a further audition for his Ashes spot. Despite still being in the selector's thoughts, Compton did not play any part in the series."]}, {"page": "Luke Wright", "response": ["Following the Champions Trophy, in October 2009 Wright was called up to England's Test squad for the first time for the winter tour of South Africa. His inclusion was to fill the all-rounder's spot vacated by Andrew Flintoff's retirement after the 2009 Ashes. Geoff Miller, England's chairman of selectors, said \"The retirement of Andrew Flintoff has created a vacancy for an all-rounder in the squad and while we do not see Luke Wright as a like for like replacement for Andrew, we are excited by the way in which his all-round game continues to develop and believe he can make an impact at Test level\". Wright was expected to play in the first Test, however England chose to go with 6 batsmen and chose Ian Bell in a match that ended as a draw."]}, {"page": "David Graveney", "response": ["He is a qualified chartered accountant and is a former chief executive of the Professional Cricketers' Association. He managed the rebel tour to South Africa in 1989–90 and became chairman of the selectors in 1997, taking over from Ray Illingworth. On 31 December 2005, he was awarded the OBE for services to cricket. On 18 January 2008, Graveney was removed from the position and awarded the position of national performance manager, monitoring young players in domestic cricket. Geoff Miller took the position over, heading up a four-man panel which included Peter Moores, James Whitaker and Ashley Giles.Graveney axed as England selector BBC News retrieved 18 January 2008"]}, {"page": "Tony Crafter", "response": ["He umpired 33 Test matches between 1979 and 1992, the highest number by an Australian umpire to that time.  (The previous highest was Bob Crockett’s 32 matches.)  His first match was between Australia and England at Sydney on 10 February to 14 February 1979, won by England by 9 wickets, thus retaining The Ashes.  Australian captain Graham Yallop scored 121 of the first innings total of 198, but the rest of the batting in both innings failed against Ian Botham, John Emburey and Geoff Miller.  Crafter’s partner was fellow debutant Don Weser."]}, {"page": "Don Weser", "response": ["He umpired 3 Test matches between 1979 and 1980. His first match was between Australia and England at Sydney on 10 to 14 February 1979, won by England by 9 wickets, thus retaining The Ashes. Australian captain Graham Yallop scored 121 of the first innings total of 198, but the rest of the batting in both innings failed against Ian Botham, John Emburey and Geoff Miller. Weser's partner was fellow debutant Tony Crafter."]}, {"page": "Cheshire County Cricket Club", "response": ["* Geoff Miller"]}, {"page": "Eddie Hemmings (cricketer)", "response": ["England test teams at that time used to have one spinner, usually an off spinner since Ray Illingworth's appointment as captain in 1969.  Illingworth was himself an off spinner.  When Illingworth was sacked, Tony Greig briefly filled this role until he was removed in 1977.  For a brief time, the baton was handed to Geoff Miller and then John Emburey filled the role from his debut in 1978 largely uncontested until 1982 when Emburey was banned for joining the South African Breweries tour.  This put Hemmings into contention for the off spinner's spot with Vic Marks in 1982.  Both toured Australia but Hemmings was the main spinner on that tour.", "All in all, Hemmings was probably the second best off spinner in England from around 1982–1991 and was largely unfortunate that his best years coincided with John Emburey's.  There were other contenders for the one place in the England team during the same time such as Geoff Miller, Vic Marks and Pat Pocock.  However broadly speaking England selectors preferred their off spinners to be able to bat which explains why Geoff Miller was often selected.  Hemmings was a useful batsman, twice frustrating the Australian test attack of 1989 at Trent Bridge to such an extent that there was a small on field altercation with Australian fast bowler Geoff Lawson just before tea on the fourth day of that match – Hemmings having hit Lawson for several fours in a completely lost cause – the game was well and truly lost by this point."]}, {"page": "James Whitaker (cricketer)", "response": ["He later became the coach and director of cricket at the club, before leaving in 2005. On 18 January 2008, Geoff Miller took over from David Graveney as the national selector, heading up a four-man panel which included Peter Moores, Whitaker and Ashley Giles.Graveney axed as England selector BBC News retrieved 18 January 2008 He was England's chairman of selectors from 2013 to 2018."]}, {"page": "Samit Patel", "response": ["Having been previously included in England's ODI and T20 squads for the tour of the West Indies in March and April 2009, Patel was dropped over fitness concerns. Hugh Morris, the director of English cricket, stated that \"Samit Patel is a talented cricketer but he, like every other player who joins the senior England team, must be aware of the strict fitness criteria that will be set. It is extremely frustrating that Samit has not heeded the warnings of his county, Nottinghamshire, and Geoff Miller [national selector] as well as the England management and strength and conditioning team. In the circumstances we had no option but to de select him from the tour ... his fitness levels have regressed between his first assessment during the build up to the England Lions tour and the second Test during the first week in New Zealand.\"", "Despite the setback, in April 2009 Patel was selected for England's 25-man performance squad. Having worked to improve his fitness, Patel said \"I have had to accept some difficult truths ... I don't want to be in a position again where I miss out on selection because of a lack of fitness\". Initially included in the 30-man preliminary squad for the 2009 ICC World Twenty20, Patel failed to make the final 15-man squad because of ongoing fitness problems. Geoff Miller commented \"I'm disappointed for us and for him, but we've laid down the rules and players have to abide by them. He feels he's been putting the work and time in, but he cannot explain it – the figures are there\"."]}, {"page": "House IV", "response": ["House IV, also known as House IV: The Repossession, is a 1992 direct-to-video comedy horror film directed by Lewis Abernathy, produced by Sean S. Cunningham and Debbie Hayn-Cass, and written by Geoff Miller and Deidre Higgins. It was filmed in November 1990, unreleased until going direct-to-video in late January 1992, and is the final entry in the House series, following House, House II: The Second Story, and House III: The Horror Show. It is not a direct sequel, only being loosely connected to the other films through the sharing of some crew members and the killer haunting a house premise. The film sees the return of Roger Cobb from the original House film, but the film otherwise does not connect its storyline to the first film. Kane Hodder was the stunt coordinator on the film."]}, {"page": "Graham Napier", "response": ["In March 2009, Napier was called up to the England Lions squad for the first time since 2004. Geoff Miller, one of the selectors, said \"the selectors felt this was a good opportunity for us to have a closer look at him within the England set-up\"."]}, {"page": "English cricket team in Australia and New Zealand in 1982–83", "response": ["* Geoff Miller (Derbyshire)", "|Geoff Miller||10||19||4||465||31.00||83|| ||2||5||", "|Geoff Miller||1950||761||27||28.18||4/63|| || ||72.2"]}, {"page": "Snibston Colliery Ground", "response": ["* Best bowling in an innings: 8–70 by Geoff Miller for Leicestershire v Derbyshire, 1982", "* Best bowling in a match: 12–138 by Geoff Miller, as above"]}, {"page": "Brookfield Community School, Chesterfield", "response": ["* Geoff Miller, England cricketer"]}, {"page": "1977 English cricket season", "response": [" || Geoff Miller || 3934 || 224 || 1551 || 87 || 17.82"]}, {"page": "Los Angeles (magazine)", "response": ["Los Angeles magazine is a monthly publication dedicated to covering Los Angeles. Founded in the spring of 1961 by Geoff Miller, the magazine is currently owned and published by Hour Media Group, LLC. Los Angeles magazine's combination of feature writing, investigative reporting, service journalism, and design has earned the publication three National Magazine Awards. The magazine covers people, lifestyle, culture, entertainment, fashion, art and architecture, and news. It is a member of the City and Regional Magazine Association (CRMA)."]}, {"page": "Adil Rashid", "response": ["At the end of the year, Rashid was included in the English national team for their tour of India, though he wasn't expected to be any chance of playing a match for England, only being on the tour for the experience. He was then included in England's squad for their following tour of the West Indies, where he was part of England's team for a tour match against a Saint Kitts and Nevis team. National selector Geoff Miller, described Rashid's selection at the age of 20 in the following terms:"]}]}}