{"wiki_id": "http://www.wikidata.org/entity/Q3525596", "itemLabel": "Thomas Stephens", "itemDescription": "British jesuit", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Stephens_(Jesuit)", "wikipedia_page": {"main": "Thomas Stephens (c.1549–1619) was an English Jesuit priest and missionary in Portuguese India, writer and linguist (focusing on Marathi and Konkani).\nFather Thomas Stephens, educated at Oxford, was one of the earliest Western Christian missionaries to India. He, along with Roberto Nobili, helped in converting the top class of Indian Society by adopting local practices and writing books in local languages, to appeal to the local people. He is famous for having written the Krista Purana (Story of Christ).\n\n", "link_mentions": [{"page": "Indo-European languages", "response": ["During the 16th century, European visitors to the Indian subcontinent began to notice similarities among Indo-Aryan, Iranian, and European languages. In 1583, English Jesuit missionary and Konkani scholar Thomas Stephens wrote a letter from Goa to his brother (not published until the 20th century) in which he noted similarities between Indian languages and Greek and Latin."]}, {"page": "1619", "response": ["* Thomas Stephens, English Jesuit missionary in Portuguese India (b. c. 1549)"]}, {"page": "1640 in literature", "response": ["*Thomas Stephens – Arte da lingoa Canarim, a grammar of the Konkani languageD.O. Hunter-Blair incorrectly describes the Arte as a grammar of the language spoken in Canara, a district on the Malabar coast; see \"Thomas Stephen Buston\". Catholic Encyclopedia. New York: Robert Appleton Company. 1913. The Catholic Encyclopedia has another article on Thomas Stephens, under \"Thomas Stephens\"."]}, {"page": "1549 in literature", "response": ["**Thomas Stephens, Jesuit writer and linguist (died 1619)"]}, {"page": "Konkani language", "response": ["It is quite possible that Old Konkani was just referred to as Prakrit by its speakers. Reference to the name Konkani is not found in literature prior to the 13th century. The first reference of the name Konkani is in \"Abhanga 263\" of the 13th century  Hindu Marathi saint poet, Namadeva (1270–1350). Konkani has been known by a variety of names: Canarim, Concanim, Gomantaki, Bramana, and Goani. Learned Marathi speakers tend to call it Gomantaki.M. Saldanha 717. J. Thekkedath, however, quotes Jose Pereira to the following effect: \"A lay brother of the College of St Paul around 1563 composed the first grammar of Konkani. His work was continued by Fr Henry Henriques and later by Fr Thomas Stephens. The grammar of Fr Stephens was ready in manuscript form before the year 1619.\" (Jose Pereira, ed., \"Gaspar de S. Miguel’s Arte da Lingoa Canarim, parte 2a, Sintaxis copiossisima na lingoa Bramana e pollida,\" Journal of the University of Bombay [Sept. 1967] 3–5, as cited in J. Thekkedath, History of Christianity in India, vol. II: From the Middle of the Sixteenth to the End of the Seventeenth Century (1542–1700) [Bangalore: TPI for CHAI, 1982] 409).", "Konkani was commonly referred to as Lingua Canarim by the Portuguese and Lingua Brahmana by Catholic missionaries. The Portuguese later started referring to Konkani as Lingua Concanim. The name Canarim or Lingua Canarim, which is how the 16th century European Jesuit Thomas Stephens refers to it in the title of his famous work Arte da lingoa Canarim has always been intriguing. It is possible that the term is derived from the Persian word for coast, kinara; if so, it would mean \"the language of the coast\". The problem is that this term overlaps with Kanarese or Kannada.Arte Canarina na lingoa do Norte. Anonymous MS, edited by Cunha Rivara under the title: Gramática da Lingua Concani no dialecto do Norte, composta no seculo XVII por um Missionário Portugues; e agora pela primeira vez dada à estampa (Nova Goa: Imprensa Nacional, 1858). Cunha Rivara suggested that the author was either a Franciscan or a Jesuit residing in Thana on the island of Salcete; hence the reference to a ‘Portuguese missionary’ in the title. All the European authors, however, recognised two forms of the language in Goa: the plebeian, called Canarim, and the more regular (used by the educated classes), called Lingua Canarim Brámana or simply Brámana de Goa. The latter was the preferred choice of the Europeans, and also of other castes, for writing, sermons, and religious purposes.Mariano Saldanha, \"História de Gramática Concani,\" Bulletin of the School of Oriental Studies 8 (1935–37) 715. See also M. L. SarDessai, A History of Konkani Literature: From 1500 to 1992 (New Delhi: Sahitya Akademi, 2000) 42–43.", "The Konkan Daiz Yatra, started in 1939 in Mumbai, is the oldest Konkani organisation. The Konkani Bhasha Mandal was born in Mumbai on 5 April 1942, during the Third Adhiveshan of All India Konkani Parishad. On 28 December 1984, Goa Konkani Akademi (GKA) was founded by the government of Goa to promote Konkani language, literature, and culture. The Thomas Stephens Konknni Kendr (TSKK) is a popular research institute based in the Goan capital Panaji. It works on issues related to the Konkani language, literature, culture, and education. The Dalgado Konkani Academy is a popular Konkani organisation based in Panaji.", "The first known printed book in Konkani was written by an English Jesuit priest, Fr. Thomas Stephens in 1622, and entitled Doutrina Christam em Lingoa Bramana Canarim (Old Portuguese for: Christian Doctrine in the Canarese Brahman Language). The first book exclusively on Konkani grammar, Arte da Lingoa Canarim, was printed in 1640 by Father Stephens in Portuguese."]}, {"page": "Marathi literature", "response": ["Krista Purana, written by the Goa-based Christian missionary Thomas Stephens, was first published in 1616. It is written in a mix of Marathi and Konkani languages, and the first copy was printed in the Roman script, and tells the story of Jesus Christ."]}, {"page": "Roberto de Nobili", "response": ["Born in Montepulciano, Tuscany in September 1577, Roberto De Nobili arrived in Goa in western India on 20 May 1605. It is probable that he met here Fr Thomas Stephens, SJ, who had arrived in Goa in 1579, and was probably in the process of composing his Khristapurana.See N. Falcao, Kristapurana: A Christian-Hindu Encounter: A Study of Inculturation in the Kristapurana of Thomas Stephens, SJ (1549-1619), (Pune: Snehasadan / Anand: Gujarat Sahitya Prakash, 2003)."]}, {"page": "Inculturation", "response": ["After the discoveries of new territories and the Council of Trent (1545–1563), the inculturation movement became more systematic. The Catholic Church had to ponder how and to evaluate elements of ancient non-Christian cultures. Notable figures were, among others, José de Anchieta for the indigenous people of Brazil, Thomas Stephens in Goa, Roberto de Nobili in Southern India, and Alexandre de Rhodes in Vietnam."]}, {"page": "Jesuit Asia missions", "response": ["*Thomas Stephens (Jesuit)"]}, {"page": "Thomas Stevens", "response": ["*Thomas Stephens (Jesuit) (c. 1549–1619), early writer in Konkani", "*Thomas Stephens (American football) (1935–2018), professional American football player", "*Thomas Stephens (boxer) (born 1969), Liberian Olympic boxer", "*Thomas Stephens Davies (c. 1794–1851), British mathematician", "*Thomas Stephens (historian) (1821–1875), Welsh historian", "*Thomas Stephens (educationist) (1830–1913), school inspector and university vice-chancellor in colonial Australia"]}, {"page": "Konkani people", "response": ["Konkani language had originally been studied and Roman Konkani promoted by Catholic missionaries in Goa (e.g. Thomas Stephens) as a communication medium during the 16th century. The Maratha threat was compounded by their attacks on native Catholics and destruction of local churches during their repeated attacks on Goa in the 17th century. This led the Portuguese government to initiate a positive programme for the suppression of Konkani in Goa, in order to make native Catholic Goans identify fully with the Portuguese Empire.Sarasvati's Children: A History of the Mangalorean Christians, Alan Machado Prabhu, I.J.A. Publications, 1999, pp. 133–134 As a result, Konkani was suppressed and rendered unprivileged in Goa by the enforcement of Portuguese.Newman, Robert S. (1999), The Struggle for a Goan Identity, in Dantas, N., The Transformation of Goa, Mapusa: Other India Press, p. 17"]}, {"page": "Goan Catholics", "response": ["The origin of their literature dates to 1563, when the first Konkani grammar was published by Fr Andre Vaz at St Paulo College at Old Goa. In 1567 the first Konkani-Portuguese dictionary was published by missionary priests at Rachol, Goa. In 1622 Thomas Stephens, an English Jesuit, published  Doutrina Christam em Lingoa Bramana Canarim (Christian Doctrines in the Canarese Brahmin Language), which was the first book in Konkani and any Indian language. On 22 December 1821 the first periodical, Gazeta de Goa (Goa Gazetteer), edited by Antonio Jose de Lima Leitao, was published. On 22 January 1900 the first Portuguese newspaper, O Heraldo, was started by Prof. Messias Gomes. It was transformed into an English daily in 1987. Periodicals such as Amcho Ganv (1930) by Luis de Menezes, Vauraddeancho Ixxt (1933), a weekly by Fr. Arcencio Fernandes and Fr. Gracianco Moraes, Aitarachem Vachop, a Konkani weekly run by the Salesians, and Gulab by Fr. Freddy J. da Costa were published in Goa. Konkani-Portuguese periodicals such as O Concani, a weekly by Sebastiāo Jesus Dias, Sanjechem Noketr (The Evening Star) (1907) by B.F. Cabral, O Goano (1907) by Honarato Furtado and Francis Futardo, and Ave Maria (1919) edited by Antonio D'Cruz were published in Bombay. In February 1899 Udentenchem Sallok (Lotus of the East) by Eduardo J. Bruno de Souza, the first Konkani periodical, was published as a fortnightly in Poona. The first Konkani book in the Devanagri script, Kristanv Doton ani Katisism by Dr. George Octaviano Pires, was published in Sholapore in 1894. Fr. Ludovico Pereria's monthly Dor Mhoineachi Rotti (Monthly Bread) was published in Karachi in 1915. In 1911 the first Konkani novel, Kristanv Ghorabo (Christian Home), was published. Modern literature is diverse and includes themes such as historical awakening in Lambert Mascarenhas' Sorrowing Lies My Land, feminism in Maria Aurora Couto's Goa: A Daughters' Story, and fantasy in Nandita da Cunha's The Magic of Maya. In 1974, the Archdiocese of Goa and Daman published the Novo Korar (New Testament) of the Holy Bible in Konkani. Later, on 4 June 2006, the Archdiocese released the complete Catholic Bible in Konkani employing the Latin alphabet known as Povitr Pustok."]}, {"page": "Chronology of European exploration of Asia", "response": ["* 1579–1619: Thomas Stephens, a Jesuit, was probably the first Englishman to set foot in India where he died in 1619."]}, {"page": "Pratap Naik", "response": ["Fr. Pratap Naik, S.J. (real name Carvalho) is a Mangalorean Catholic Jesuit priest from Kundapur, India.  He was the director of the Thomas Stephens Konkkni Kendr (TSKK), a research institute working on issues related to the Konkani language, literature, culture and education. The institute is based in Alto Porvorim, on the outskirts of the state capital of Panaji, Goa.", "TSKK is named after Thomas Stephens, the 16th century English Jesuit priest missionary who came to Goa in 1579 and lived in the region till his death. Stevens authored the Arte da lingoa Canarim, which was written in Portuguese, and was the first printed grammar of what is now called the Konkani language"]}, {"page": "Father Thomas Stephens", "response": ["#REDIRECT Thomas Stephens (Jesuit)"]}, {"page": "Thomas Stephens (missionary)", "response": ["#REDIRECT Thomas Stephens (Jesuit)"]}, {"page": "Paulinus of St. Bartholomew", "response": ["He was sent in 1774 as missionary to Malabar, India. After spending fourteen years in India, he was appointed vicar-general of his order and apostolic visitor. He was very well versed in languages: he spoke German, Latin, Greek, Hebrew, Hungarian, Italian, Portuguese, English, Malayalam, Sanskrit, and some other languages of India. He became known in Kerala as Paulinus Paathiri. He was one of the first to detect the similarity between Sanskrit and Indo-European languages, though the very first was likely Fr Thomas Stephens, SJ."]}, {"page": "Thomas Stephen Buston", "response": ["#REDIRECT Thomas Stephens (Jesuit)"]}, {"page": "Buston, Thomas Stephen", "response": ["#REDIRECT Thomas Stephens (Jesuit)"]}, {"page": "Goan Catholic literature", "response": ["The origin of their literature dates to 1563 when the first Konkani grammar was published by Fr.Andre Vaz at St.Paulo College at Old Goa. Konkani language had its first Konkani-Portuguese dictionary in 1567. Missionary priests of Rachol Seminary compiled the first ever dictionary in any Indian language giving 15000 Konkani words and their vocables in Portuguese. Konkani was known as Canarim in early Portuguese writings on Goa. In 1622, Thomas Stephens (1549–1619) an English Jesuit published  Doutrina Christam em lingoa Bramana Canarim, ordenada a maneira de dialogo, pera ensinar os mininos, por Thomas Estevao, Collegio de Rachol 1622 (Christian Doctrines in the Canarese Brahmin Language, arranged in dialogue to teach children, by Fr. Thomas Stephens, College of Rachol, 1622) which was the first book in Konkani and any Indian language. Mariano Saldhana published a facsimile edition of this book entitled as Doutrina Cristâ em lingua Concani pot Tomás Estévão in 1945. Thomas Stephens also published the Arte da Lingoa Canarim (A Grammar of Konkani, 1640), with its second edition the Gramatica da Lingua Concani Composta Pelo Padre Thomas Estevão (A Grammar of Konkani language composed by Fr. Thomas Stephens) published in 1856. and Declaraçam da Doutrina Christam (Exposition of Christian Doctrine in Konkani, 1632) in Goa. Jesuit missionaries also produced works during the 17th century in a mix of Marathi and Konkani like the Krista Purana (The Christian Purânna) in 1616, 1649, and 1654, but no copies of any of these editions are extant. The ‘Krista Purana’ (The Christian Purânna) is a Marathi-Konkani metrical composition, consisting of 10,962 strophes; divided into two parts treating of the Old and the New Testament respectively. Paixao de Cristo (Passion of Christ) known as Christi Vilapika in Marathi, written by during the 17th century in Marathi language and Roman script, based on sublime pathos of the crucifixion of Jesus Christ and the Chilayabal Vilapika.."]}, {"page": "Captivity of Mangalorean Catholics at Seringapatam", "response": ["The Christians, believing that this tribulation came upon them for their neglect of the Law of God and their religious duties, began to fervently read the Krista Purana, an epic poem on the life of Jesus Christ written by the English Jesuit Thomas Stephens (1549–\u00961619). On discovering this, some Muslims destroyed the books, but the Christians constructed subterranean refuges in which to perform their religious devotions, read the books, and strengthen their faith. According to Mr. Silva of Gangollim, a survivor of the captivity, if a person who had escaped from Seringapatam was found, the punishment ordered by Tipu was amputation of the ears, nose, feet and one hand.Account of a Surviving Captive, A Mr. Silva of Gangolim (Letter of a Mr. L.R. Silva to his sister, copy of which was given by an advocate, M.M. Shanbhag, to the author, Severino da Silva, and reproduced as Appendix No. 74: History of Christianity in Canara (1965))"]}, {"page": "Krista Purana", "response": ["Krista Purana (; Devanagari: क्रिस्त पुराण, \"The Christian Puranas\") is an epic poem on the life of Jesus Christ written in a mix of Marathi and Konkani by Fr.Thomas Stephens, S.J. (1549–1619). Adopting the literary form of the Hindu puranas, it retells the entire story of mankind from the creation days to the time of Jesus, in lyrical verse form. The Christian Puranas – 11,000 stanzas of 4 verses – were very popular in the churches of the area where they were sung on special occasions up to the 1930s. Although no copy of the original edition has yet been discovered, it is believed to have been published at Rachol (Raitur) in 1616 (while the author was still living), 1649, and 1654.", "# Discurso sobre a vinda do Jesu-Christo Nosso Salvador ao mundo, dividido em dous Tratados, pelo Padre Thomaz Estevão, Inglez, da Companhia de Jesu. Impresso em Rachol com licencia da Santa Inquisicão, e Ordinario no Collegio de Todos os Santos da Companhia de Jesu Anno 1616.J.L. Saldanha, The Christian Puránna of Father Thomas Stephens of the Society of Jesus: A Work of the 17th Century: Reproduced from manuscript copies and edited with a biographical note, an introduction, an English synopsis of contents and vocabulary, ed. Joseph L. Saldanha (Bolar, Mangalore: Simon Alvares, 1907) xxxix.  First edition, Rachol [Raitur], Goa, 1616. [Roman script.] The title with all its details is taken from the ‘Licence,’ which itself is found not in the MS collated by J.L. Saldanha, but in J.H. da Cunha Rivara’s Introduction to his edition of Stephens, Grammatica da Lingua Concani, 1857,[J.L. Saldanha xli, note 2. Cunha Rivara’s \"Ensaio\" does contain the censures and licences, in Portuguese; however, he states clearly that he was working from MS, and that he had not found any copy of the first three printed editions: see \"Ensaio\" 1957 cxix. Imprimatur 22 June 1615. \"From the Censures and Licences annexed it seems to have originally been written in Portuguese and then translated into the vernacular in which we now find it. The translation appears to have been completed in 1614,J.L. Saldanha xxxix, note 1: see stanzas 119-120, Canto 59, Dussarem Puránna. and printed for the first time, in 1616, as declared in the descriptive title in Portuguese first given to the book.\"J.L. Saldanha xxxix. No copy has been traced to date.", "# The Christian Puránna of Father Thomas Stephens of the Society of Jesus: A Work of the 17th Century: Reproduced from manuscript copies and edited with a biographical note, an introduction, an English synopsis of contents and vocabulary. [Roman script.] 4th edition, by Joseph L. Saldanha. Bolar, Mangalore: Simon Alvares, 1907. Pp. xci+597. [Copies available at XB; St Pius X Seminary, Goregaon, Mumbai.] ", "# Kristapurāṇa. 6th edition, by Caridade Drago, SJ. Second [printed edition in] Devanagari script. Pp. li+907. Mumbai: Popular Prakashan, 1996. [Copies available at Thomas Stephens Konknni Kendr, Alto Porvorim, Goa; Divyadaan: Salesian Institute of Philosophy, Nashik.]", "# The M.C. Saldanha MS at the Thomas Stephens Konknni Kendr, Alto Porvorim, Goa (TSKK-1). Whether this M.C. Saldanha is the same as the well-known professor Mariano Saldanha of Ucassaim, Goa, is yet to be established. But from the fact that the MS has been bound in Kodailbail, Mangalore, it is highly probable that this is one of the 5 MS used by J.L. Saldanha in the preparation of his 1907 edition of the Khristapurana.J.L. Saldanha, \"Editor's Preface\" iii. ", "# Another MS at the Thomas Stephens Konknni Kendr (TSKK-2).", "Abbott claims that this is a copy of Thomas Stephens’ original text. Bandelu feels that there is not enough evidence for Abbott’s claim. Falcao follows Abbott without really arguing his case. Strangely, while admitting that the Marsden MS is a MS and not an ‘edition,’ he still lists it as the 7th edition, coming after Drago, without giving any supporting reasons.Falcao 2003 20.", "* Falcao, Nelson. \"Kristapurana: A Christian-Hindu Encounter: A Study of Inculturation in the Kristapurana of Thomas Stephens, SJ (1549-1619)\". Published under the same title at Pune: Snehasadan / Anand: Gujarat Sahitya Prakash, 2003", "* Royson, Annie Rachel. \"Texts and Traditions in Seventeenth Century Goa: Reading Cultural Translation, Sacredness, and Transformation in the Kristapurāṇa of Thomas Stephens S.J.\". Doctoral Thesis. Gandhinagar: Indian Institute of Technology Gandhinagar, 2018.", "*Falcao, Nelson. Kristapurāṇa, a Christian-Hindu encounter: a study of inculturation in the Kristapurāṇa of Thomas Stephens, S.J. (1549-1619). Anand: Gujarat Sahitya Prakash, 2003. .", "*Coelho, Ivo. \"Thomas Stephens’ Khristapurāṇa: A New Edition and Translation by Nelson Falcao, SDB.\" Divyadaan: Journal of Philosophy and Education 20/3 (2009) 473-482."]}, {"page": "Bushton, Wiltshire", "response": ["The pamphleteer and poet Ralph Broome (1742–1835) was born and raised in the hamlet.Joyce Hemlow, ed.: The Journals and Letters of Fanny Burney... (London: OUP, 1972 ff.), vol. IV., p. 30n. Also born at Bushton was the Jesuit missionary to India Thomas Stephens (c. 1549–1619)."]}, {"page": "Rachol Seminary", "response": ["Rachol has also produced historians, writers, grammarians, scientists, scholars, pastors, parliamentarians and university professors. Among the latter we can single out the saintly and very popular Ven. Fr. Agnelo Gustavo Adolfo de Souza, sfx, (Padr Agnel) who underwent his priestly formation and was ordained at the Rachol Seminary. He later joined the Society of St. Francis Xavier (Pilar Society), and spent the last 10 years of his life as Confessor and Spiritual Director of the seminarians at Rachol. Fr. Thomas Stephens (Konkani and Marathi writer), Francisco de Souza (author of Oriente Conquistado), Msgr. Rudolfo Sebastião Dalgado (Konkani writer and scholar, known as the God-father of the Konkani language), Fr. Antonio Francisco Souza (Science writer and thinker) are some of the well-known personalities associated with Rachol Seminary, either as staff or students.  Swami Vivekananda is said to have made several trips to the seminary, from Margao, where he had put up during his visit to Goa in 1892. He consulted the library at Rachol and discussed Christian theology and spirituality with the Professors of the seminary. This visit of Vivekananda to Rachol was in preparation for his famous address at the Parliament of World Religions in Chicago (11 to 27 September 1893), where Vivekananda represented India and Hinduism."]}, {"page": "Doutrina Christam em Lingoa Bramana Canarim", "response": ["Doutrina Christam em Lingoa Bramana Canarim (Christian Doctrines in the Canarese Brahmin Language), commonly known as Doutrina Christam or Dovtrina Christam, was written by Fr. Thomas Stephens (1549–1619), an English Jesuit, and published in 1622. The larger form of the book's name is Doutrina Christam em Lingua Bramana Canarim, Ordenada a maniera de dialogo para ensinar os meninos, pelo Padre Thomas Estevão, Jesuita, no Collegio de Rachol (Christian Doctrines in the Canarese Brahmin Language, arranged in dialogue to teach children, by Fr. Thomas Stephans, College of Rachol, 1622)."]}, {"page": "Paixao de Cristo", "response": ["==Attribution to Thomas Stephens, SJ==", "The three poems published by Tadkodkar are found in the bound volume of Thomas Stephens’ Khristapurāṇa at the Central Library, Panjim (Discurso sobre a vinda de Jesu Christo Nosso Salvador ao Mundo dividido em dous tratados feito pelo Padre Thomas Estevão Ingrez da Companhia de Jesus. Impresso em Goa com licenca das Inquisicão, e Ordinario no Collegio de S. Paulo novo de Companhia de Jesu. Anno de 1654, Escripto por Manoel Salvador Rebello, Natural de Margão no Anno 1767). (This manuscript will henceforth be referred to as CL.) Tadkodkar attributes two of these, for reasons which will be listed below, to Thomas Stephens himself.See Ivo Coelho, Review of S.M. Tadkodkar, Goan Christian Marathi Vilāpikā in the 17th Century, Divyadaan: Journal of Philosophy and Education 22/2 (2011) 265-271.", "Of the three texts, the authorship of the second (PG-2) is clearly identified within the text itself: \"Esta paixão foy composta pello Padre Manoel Jacques de Noronha natural de Sancoale morador em Azossim freguezia de Sam Matheus das Ilhas de Goa. Escripto por Manoel Salvador Rebello, morador em Margão da Provincia da Salcete no anno 1768\".Tadkodkar 28, 149. As for the other two (PG-1 and PG-3), Tadkodkar proposes—somewhat tentatively—that the author is Thomas Stephens himself.Tadkodkar 15-21, 62-64. His reasons are as follows:", "# J.H. da Cunha Rivara speaks of a Paixão composed by Stephens, with additions made by da Faria: \"Passion of Christ Our Redeemer, composed by Father Thomas Stephens of the Society of Jesus, and additions made by Pascoal Gomes da Faria, priest of the Order and habit of the Prince of the Apostles Saint Peter, native of Batim, parish of our Lady of Guadalupe, of the Island of Goa of a few hymns at the end of the book. Year 1772\".J.H. da Cunha Rivara, \"An Historical Essay on the Konkani Language\", tr. Theophilus Lobo, in A.K. Priolkar, The Printing Press in India: Its Beginnings and Early Development. Being a Quartercentenary Commemorative Study of the Advent of Printing in India (in 1556) (Mumbai: Marathi Samsodhana Mandala, 1958) 227. Tadkodkar 19-20.", "Besides these, there are the appendices. Any student of Thomas Stephens will rejoice to have available transcripts and translations of the Censures and Licences pertaining to the first three print editions of the Khristapurāṇa, as found in CL (Appendix A). Appendix B is a glossary of terms, beginning with Romanized Marathi, going on to Devanagari Marathi, and ending with English. Appendices C and D consist of explanatory notes, C of Christian terms, and D of terms sourced by the Christian writers from contemporary and prior Marathi writers. E is interesting: four texts of the Chilayābāl Vilāpikā, composed by Shridhar, a 17th-century poet from Nazhare-Pandharpur, not far from Goa, and published here for the first time, perhaps because of the \"remote possibility\" of some connection with the Passion poems.Tadkodkar xii. F contains select bibliography, and G is an index to the texts of the three Vilāpikās in Devanagari transliteration (misleadingly, however, entitled \"Texts of the Christi Vilāpikā\" in the Table of Contents).", "Prof. (Dr.) Tadkodkar, proposes that 2 of the 3 Paixao de Christo found at the end of the MS of the Khristapurana preserved in the State Central Library, Panaji, Goa, were written by Thomas Stephens himself. ", "Prof. (Dr.) Tadkodkar has much admiration for Thomas Stephens. His writings are able to move people even today, reaching out across temporal, religious and community barriers to touch the hearts of those who read and hear. "]}, {"page": "Konkani in the Roman script", "response": ["In the 16th century, Christian missionaries studied the Konkani language in depth. They even prepared Konkani grammar, dictionaries and studied various facets of literature. The Jesuits established the first printing press in Asia in Goa in 1556. Since then, a rich tradition of Konkani literature in the Roman script has developed. Fr. Thomas Stephens made vital contributions to the development of Romi Konkani orthography in the early 1600s. Fr. Eduardo Bruno de Souza launched the first Roman Konkani monthly titled  (Lotus of The East) in 1889, in Pune. He also wrote the first Konkani novel,  (Christian Home). Shenoi Goembab wrote seven Konkani books in the Roman script. Konkani literature was dominated by the Roman script before 1961. Reginaldo Fernandes (1914–1994) wrote over 200 Konkani novels in the Roman script called Romanses.", "*Thomas Stephens Konknni Kendr", "*Thomas Stephens Konknni Kendr"]}, {"page": "Konkani language agitation", "response": ["Konkani language had originally been studied and Roman Konkani promoted by Catholic missionaries in Goa (e.g. Thomas Stephens) as a communication medium during the 16th century. The Maratha threat was compounded by their attacks on native Catholics and destruction of local churches during their repeated attacks on Goa in the 17th century. This led the Portuguese government to initiate a positive programme for the suppression of Konkani in Goa, in order to make native Catholic Goans identify fully with the Portuguese Empire.Sarasvati's Children: A History of the Mangalorean Christians, Alan Machado Prabhu, I.J.A. Publications, 1999, pp. 133–134 As a result, Konkani was suppressed and rendered unprivileged in Goa by the enforcement of Portuguese.Newman, Robert S. (1999), The Struggle for a Goan Identity, in Dantas, N., The Transformation of Goa, Mapusa: Other India Press, p. 17"]}, {"page": "Francisco Luís Gomes", "response": ["Gomes' other notable works included a biography written in Portuguese of the brigadiers Henrique Carlos Henriques and Joaquim Xavier Henriques, and in French of Sebastião José de Carvalho e Melo, 1st Marquess of Pombal (1869). He cherished his mother-tongue, Konkani, and made significant contributions towards a revised edition of Arte da lingoa Canarim (Art of the Canarim language), the Konkani grammar by the 16th-century English Jesuit, Fr. Thomas Stephens. He also wrote an unpublished Konkani grammar dedicated to the Portuguese civil servant and Konkani revivalist Joaquim Heliodoró da Cunha Rivara."]}, {"page": "Arte da Lingoa Canarim", "response": ["The Arte da Lingoa Canarim, the grammar of the Konkani language,D.O. Hunter-Blair incorrectly describes the Arte as a grammar of the language spoken in Canara, a district on the Malabar coast; see \"Thomas Stephen Buston\". Catholic Encyclopedia. New York: Robert Appleton Company. 1913. The Catholic Encyclopedia (1913) has two articles on Thomas Stephens, the one cited and another under \"Thomas Stephens\". was composed by the 16th-century English Jesuit priest Father Thomas Stephens, thus making Konkani the first among the modern Indian languages to have its grammar codified and described.Mariano Saldanha, \"História de Gramática Concani,\" Bulletin of the School of Oriental Studies 8 (1935-37) 715. See also M. Saradesaya, A History of Konkani Literature: From 1500 to 1992 (New Delhi: Sahitya Akademi, 2000) 42-43. The system was expanded upon by Diogo Ribeiro and four other Jesuits and printed in Rachol (located in the Indian state of Goa) in the year 1640. A second edition was then developed and introduced in 1857 by J.H. da Cunha Rivara, who possessed a great passion for Konkani. Consequently, three versions of the Arte exist:", "Konkani has been known by a variety of names: canarim, concanim, gomantaki, bramana and goani. It is called amchi bhas (\"our language\") by native speakers and govi, or Goenchi bhas, by others. Learned Marathi speakers tend to call it gomantaki.M. Saldanha 717. J. Thekkedath, however, quotes Jose Pereira to the following effect: A lay brother of the College of St Paul around 1563 composed the first grammar of Konkani. His work was continued by Fr Henry Henriques and later by Fr Thomas Stephens. The grammar of Fr Stephens was ready in manuscript form before the year 1619. (Jose Pereira, ed., \"Gaspar de S. Miguel’s Arte da Lingoa Canarim, parte 2a, Sintaxis copiossisima na lingoa Bramana e pollida,\" Journal of the University of Bombay [Sept. 1967] 3-5, as cited in J. Thekkedath, History of Christianity in India, vol. II: From the Middle of the Sixteenth to the End of the Seventeenth Century (1542-1700) [Bangalore: TPI for CHAI, 1982] 409). ", "The name canarim or lingua canarim, which is how Thomas Stephens himself refers to it in the title of his famous grammar, has always been intriguing. It is possible that the term is derived from the Persian word for coast, kinara; if so, it would be means \"the language of the coast.\" The problem is that this term overlaps with Kanarese or Kannada. It is therefore not surprising to find Mariano Saldanha calling absurd the appellation lingua canarim, since the language of Goa, being derived from Sanskrit, has nothing to do with Kannada, which is a Dravidian language. The missionaries, who certainly travelled to Kanara as well, must have realized the infelicity of the term, but, not being philologists, continued to follow the current practice. Thus Stephens speaks of the lingua canarim, and a Portuguese missionary called his work Arte Canarina da lingoa do Norte, referring to the Konkanized Marathi of the northern provinces of Bassein, Bandra, and Bombay.Arte Canarina na lingoa do Norte. Anonymous MS, edited by Cunha Rivara under the title: Gramática da Lingua Concani no dialecto do Norte, composta no seculo XVII por um Missionário Portugues; e agora pela primeira vez dada à estampa (Nova Goa: Imprensa Nacional, 1858). Cunha Rivara suggested that the author was either a Franciscan or a Jesuit residing in Thana on the island of Salcete; hence the reference to a \"Portuguese missionary\" in the title."]}, {"page": "Mariano Saldanha", "response": ["In his Presidential Address at the 5th Conference of the Konkani Bhasha Mandal at Bombay in 1952, he held that Marathi and Konkani were independent sister languages. He also, at this early date, advocated primary education in Konkani for Goans. He also made a plea for the adoption of the Roman script in the system of transliteration invented by Thomas Stephens and followed by other writers in the 17th century in Goa.Vaz 260. However, his advocacy of Konkani did not translate into hostility to Marathi.Vaz 260.", "The Thomas Stephens Konknni Kendr, adjacent to the Xavier Centre of Historical Research at Alto Porvorim, Goa, possesses a manuscript copy of the Khristapurana by Thomas Stephens in Roman script, with the name \"M.C. Saldanha\" in pencil on one of the first pages, and also on the spine of the leather binding. Besides, the volume bears a stamp indicating that it was bound in Kodialbail, Mangalore. It is known that J.L. Saldanha, who produced the 1907 edition of the Khristapurana, had borrowed a manuscript copy of the Khristapurana from a Mr. Marian Saldanha, whom he describes as \"an enthusiast of Purannic literature.\"Thomas Stephens, The Christian Purana of Father Thomas Stephens: A Work of the 17th Century, Reproduced from Manuscript copies and edited with a Biographical Note, an Introduction, an English Synopsis of Contents and Vocabulary, ed. Joseph L. Saldanha (Mangalore: St Aloysius' College, 1907) iii. However, more work will have to be done before the TSKK copy can be identified as having come from the collection of Mariano Saldanha. Unfortunately, the TSKK has not kept records of provenance.", "*Thomas Stephens. Doutrina Christam em lingoa Bramana Canarim. Ordenada a maneira de Dialogo, pera ensinar os mininos. Coposta pollo Padre Thomas Estevao da Companhia de IESUS. natural de Lodres. Empressa no Collegio do Rachol da Copanhia de IESUS Anno 1622. 1945. [Reproduced by M. Saldanha in facsimile on pp. 55–190, with introduction, notes and appendices.]"]}, {"page": "Étienne de la Croix", "response": ["De la Croix entered the Society of Jesus in 1599, and arrived in India in 1602. He succeeded the English Jesuit Thomas Stephens as Rector of the College at Rachol. He seems to have made a study of the Hindu Puranas and religious beliefs. A list of references given in his works shows that he used at least 26 Hindu puranas in the composition of his own purana.Meyer and Girke 216. His Peter Purana, as it is popularly known, consisted of 12,000 ovis (verses) in a Marathi that contained a significant number of Konkani words and expressions.M. Saradesaya, A History of Konkani Literature: From 1500 to 1992 (New Delhi: Sahitya Akademi, 2000) 49. He also wrote in Konkani language, though none of these works survive, according to Alexandre Rhodes, writing in 1621.cited by Saradesaya 49-50. Pereira 90.", "In contrast to Thomas Stephens' Khristapurana, the Peter Purana is far more polemical."]}, {"page": "Joaquim Heliodoro da Cunha Rivara", "response": ["With his interest in philology, he edited Thomas Stephens' Arte da lingoa Canarim, which he published under the title Grammatica da Lingua Concani in 1857, together with the Ensaio Histórico da Língua Concani. Unlike those of his countrymen who were only interested in establishing the Portuguese language, ignoring or discounting the native cultures, Cunha Rivara believed that the Portuguese language could be better diffused in Goa by using the local languages, Konkani and Marathi in particular, as mediums of public instruction. Soon after his arrival in Goa, he asserted this belief in an inaugural conference of the Escola Normal of Nova Goa (Panjim), on 1 October 1856. The text of this speech may be found in the  Boletim do Governo, n.º 78."]}, {"page": "1549 in India", "response": ["* Thomas Stephens, linguist and missionary to Portuguese India is born in Wiltshire, England (dies 1619)"]}, {"page": "Poets in (and from) Goa", "response": ["Jonathan Gil Harris, Professor of English, Ashoka University and a Ph.D. (University of Sussex), talks about  Father Thomas Stephens, an English Jesuit, who not only would \"spend his entire life in Goa, he also wrote the first Konkani grammar book and an epic 11,000-line Marathi poem, now regarded as a classic.\""]}]}}