{"wiki_id": "http://www.wikidata.org/entity/Q3527388", "itemLabel": "Bill Athey", "itemDescription": "Cricket player of England. (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Athey", "wikipedia_page": {"main": "Charles William Jeffrey Athey (born 27 September 1957) is a retired English first-class cricketer, who played for England, and first-class cricket for Gloucestershire, Yorkshire and Sussex; he also played a solitary one-day game for Worcestershire. His bulldog spirit was exemplified by the Union Jack tattooed on his arm.  He played in 23 Test matches between 1980 and 1988, but scored more than 50 runs only five times in 41 innings.  In 1990, Athey joined the rebel tour to South Africa.\n\n", "link_mentions": [{"page": "September 27", "response": ["*1957 – Bill Athey, English cricketer, footballer, and coach"]}, {"page": "1987 Cricket World Cup", "response": ["In the English reply, opener Tim Robinson was out LBW for a first ball duck. Bill Athey (58 from 103 balls, 2 fours) top-scored, and England were almost on target, when captain Mike Gatting (41 from 45 balls, 3 fours, 1 six) handed back the initiative with the loss of his wicket, going for a reverse sweep which ended a growing partnership of 69 runs in 13 overs between him and Athey. Allan Lamb (45 from 55 balls, 4 fours) also posted a great innings, but it was in vain as the required run-rate for England began to rise. When England failed to score the last 17 runs from the final over, the cup went to Australia."]}, {"page": "Geoffrey Boycott", "response": ["On 3 October 1983 the friction between Boycott and the committee culminated in a unanimous decision not to offer Boycott a contract for the next season. This generated much protest from Boycott supporters, who rallied, calling for his reinstatement at a meeting on 9 October in Ossett, Yorkshire. Bill Athey left the club at this time, and while Boycott in his biography maintained that he had no reason to believe that his actions had caused Athey's departure, Athey later stated to biographer Leo McKinstry that \"Boycott's attitude and the atmosphere he created had everything to do with my decision to leave Yorkshire.\" The \"Members 84 Group\", consisting of strong supporters of Boycott, met regularly to clamour for the batsman's reinstatement.McKinstry, pp. 240–241. Their leader, Peter Briggs, stated \"Geoffrey Boycott is a giant playing among pygmies.\"Hopps, p. 241."]}, {"page": "Mike Gatting", "response": ["In 1987, Gatting gained notoriety in the \"Shakoor Rana affair\" when he argued with umpire Shakoor Rana in Faisalabad. He was accused of adjusting the field illegally, i.e. after the bowler had started running in, and warned. In fact, Gatting had been signalling to the long leg fielder to stop walking in, and the move was legal as it was not in the batsman's eyeline. Rana shouted 'stop, stop' and signalled dead ball, however, infuriating Gatting. Tempers were already frayed following a string of umpiring decisions that had gone against England, and the England team were unhappy that Rana was wearing a Pakistan sweater under his jacket. An on-pitch argument ensued, during the course of which Rana accused Gatting of breaking the rules and Gatting shouted 'We made the rules'. He had to be dragged away by Bill Athey. Rana refused to resume the match the following morning until Gatting delivered a handwritten apology, which he did under protest – eventually, the match was drawn due to bad light. The England hierarchy supported him, flying officials out to mediate with the board and deal with press relations. The Pakistan board supported Rana, naming him umpire for the deciding Test, from which position they only backed down when it was clear the England team would not play if Rana officiated, naming two other umpires. Indeed, the TCCB subsequently paid all players in the England party a £1000 'hardship' bonus for the tour."]}, {"page": "Wicket-keeper", "response": ["This rule was sometimes suspended, by agreement with the captain of the batting side. For example, during the England–New Zealand Test Match at Lord's in 1986, England's specialist keeper, Bruce French, was injured while batting during England's first innings. England then used four keepers in New Zealand's first innings: Bill Athey kept for the first two overs; 45-year-old veteran Bob Taylor was pulled out of the sponsor's tent to keep for overs 3 to 76; Bobby Parks, the Hampshire keeper, was called up for overs 77 to 140; and Bruce French kept wicket for the final ball of the innings."]}, {"page": "Yorkshire County Cricket Club", "response": ["* Bill Athey"]}, {"page": "John Emburey", "response": ["Politically, Emburey is a Conservative, and once appeared on stage at a Conservative Party conference in the 1980s alongside England teammate Bill Athey."]}, {"page": "English cricket team in Australia in 1986–87", "response": ["* Bill Athey (Gloucestershire)"]}, {"page": "Bob Taylor (cricketer)", "response": ["This would not be Taylor's last outing with the club, however. He captained Derbyshire Second XI in 1985 for eight games, though he did not keep wicket. Batting last in the order, he was rarely called on to bat. During New Zealand's 1986 Test match at Lord's, Taylor was present in the hospitality tent when Bruce French was injured by a Richard Hadlee delivery. After trialling Bill Athey behind the wicket, New Zealand captain Jeremy Coney permitted Taylor to come on the field to keep for the remainder of the day. Wisden recorded \"[Taylor] equipped himself with an assortment of borrowed kit, although he did, far-sightedly, have his own gloves in his car... Despite having retired from first-class cricket two years earlier, Taylor ... kept without a blemish.\" Bobby Parks was brought in to keep for the following day. Also in 1986, Taylor was selected as part of Brian Close's invitational XI to play New Zealand at Scarborough on 31 August. Taylor kept wicket, and scored 21 as well as taking two catches. He was part of Michael Parkinson's World XI in 1988, playing against the MCC where Taylor again kept wicket and scored four runs."]}, {"page": "Martyn Moxon", "response": ["The winter touring party for the trip to Australia in 1986/7 was far from settled in advance.  Chris Broad was recalled after a two-year absence, Wilf Slack brought back having missed all but one Test during the summer, and Bill Athey was included as an 'auxiliary' batsman.  The choice of two left-handers at the top of England's order highlighted the fact that Australia's big threat came from the battery of left arm seamers available to them, led by Bruce Reid.  In the event, Slack, out of form, played  no International cricket on the tour while Athey and Broad flourished as an opening pair, Broad going on to be named as the International Cricketer of the Season. Moxon had to wait until the last Test of 1987 for a recall. Such were England's selection uncertainties that Tim Robinson had been recalled again in the intervening time."]}, {"page": "South African rebel tours", "response": ["In 1990, the final tour was led by former England captain Mike Gatting. The team included former and contemporary England players such as batsmen Tim Robinson, Bill Athey and Chris Broad, wicketkeeper Bruce French, and the fast bowlers Paul Jarvis, Graham Dilley and Neil Foster.", "*Squad: Mike Gatting (captain), Bill Athey, Kim Barnett, Chris Broad, Chris Cowdrey, Graham Dilley, Richard Ellison, John Emburey, Neil Foster, Bruce French, Paul Jarvis, Matthew Maynard, Tim Robinson, Greg Thomas, Alan Wells, David Graveney (player/manager)."]}, {"page": "Charles Athey", "response": ["#redirectBill Athey"]}, {"page": "Benson & Hedges Challenge", "response": ["Mike Gatting (captain), Bill Athey, Ian Botham, Chris Broad, Phillip DeFreitas, Graham Dilley, Phil Edmonds, John Emburey, Neil Foster, David Gower, Allan Lamb, Jack Richards, Gladstone Small"]}, {"page": "Bradford Premier League", "response": ["* Bill Athey (England)"]}, {"page": "West Indian cricket team in England in 1988", "response": ["England omitted Eddie Hemmings, Bill Athey and Neal Radford from their squad of 14.  They won the toss and elected to put the West Indies in to bat.  Simmons and Greenidge made a first-wicket partnership of 34 before the former was caught by Allan Lamb off the bowling of Graham Dilley.  Bowling alternate overs, Pringle and Small then dismissed Greenidge, Richards and Richie Richardson, leaving the West Indies on 72 for four.  Gus Logie and Carl Hooper were restricted to singles as the England captain Gatting kept a tight in-field.  Hooper made his half-century before being dismissed one run later, caught by John Emburey off the bowling of Small. Logie fell to Small 11 runs later, caught behind, with the score on 180 for six.  The West Indies tail-enders provided little resistance to England, and the innings concluded with the visitors being dismissed for 217 off the last ball.  "]}, {"page": "List of Gloucestershire cricket captains", "response": ["| scope=\"row\" align=\"left\" | Bill Athey "]}, {"page": "1987 Cricket World Cup squads", "response": ["|Bill Athey"]}, {"page": "1983 Cricket World Cup squads", "response": ["Alan Butcher, David Bairstow, Eddie Hemmings, Phil Edmonds, Bob Taylor, David Mark Smith, Bill Athey, Wilf Slack, David Thomas were among the probables for the World Cup."]}, {"page": "New Zealand cricket team in England in 1986", "response": ["On day 2 of the first Test at Lord's, England wicket-keeper Bruce French was facing a delivery from Richard Hadlee when he was hit on the head and forced to retire hurt. As a consequence of him having to go to hospital, England required the use of a substitute keeper. At the start of New Zealand's first innings, Bill Athey took on the role but it was decided after only a few overs that a specialist was needed. By chance, former England wicket-keeper Bob Taylor, who had retired from first-class cricket, was in the hospitality tent. With the consent of the New Zealand captain Jeremy Coney, Taylor was persuaded to don a borrowed set of pads (although he had had the foresight to bring his gloves with him) and keep wicket for England for the rest of day 2. The following day, England were permitted to call up Bobby Parks of Hampshire as a substitute for the remainder of New Zealand's first innings. The fourth day of the schedule was a rest day, while on day 4 England batted for the second time. Bruce French was finally able to return for New Zealand's second innings on the final day.England v New Zealand 1986, Wisden"]}, {"page": "Bicentennial Test", "response": ["* Bill Athey"]}, {"page": "Athey", "response": ["* Bill Athey (born 1957), English cricketer"]}, {"page": "World Cricket Classic", "response": ["* Bill Athey"]}, {"page": "Cricket in Colombia", "response": ["The B.S.C. (with Tony White) was the only side to bowl them out (for 184) during their South American tour. Norman Bracht took 5–74 in 20 overs and White 3–70 in 22. Krish Vaidya, was the only player to remain not out with a century. Their side was managed by Peter Parfitt (with Henry Blofeld), captained by Chris Cowdrey and included Bill Athey, Graham Stevenson, Tim Lloyd, Spandan Pandya and other good young county cricketers. "]}]}}