{"wiki_id": "http://www.wikidata.org/entity/Q352330", "itemLabel": "Don Roper", "itemDescription": "English footballer (1922-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Roper", "wikipedia_page": {"main": "Donald George Beaumont Roper (14 December 1922 – 8 June 2001) was an English footballer.", "link_mentions": [{"page": "List of Arsenal F.C. players", "response": ["|   Don Roper"]}, {"page": "Vic Groves", "response": ["He scored on his debut, against Sheffield United on 12 November 1955, in a 2-1 First Division win (Don Roper grabbing the other Arsenal goal)."]}, {"page": "Donald Roper", "response": ["#REDIRECTDon Roper"]}, {"page": "1952 FA Cup Final", "response": ["|OL ||11 || Don Roper"]}, {"page": "George Curtis (footballer, born 1919)", "response": ["After hostilities ended he played 12 times in the 1946–47 season, but was sold to Southampton in part-exchange for Don Roper in summer 1947; in all he played 14 times for the Gunners, never scoring.", "Curtis had impressed Southampton manager Bill Dodgin who valued him at £10,000, in an exchange transfer that also saw Tom Rudkin arrive at The Dell, with Don Roper moving to Highbury."]}, {"page": "History of York City F.C. (1922–1980)", "response": ["York were optimistic for 1955–56, and they were top of the table after 10 matches. A run of nine consecutive matches without a win saw York drop out of promotion contention, and they finished 11th. That season's FA Cup run included a 2–1 win over a Swansea Town team featuring eight Wales internationals at Vetch Field in the third round. They then played First Division team Sunderland, billed as the \"Bank of England club\" because of their high expenditure on transfers, York were beaten 2–1 at Roker Park in a replay. During this season, York filled the managerial position that had been vacant for the last 18 months; Arsenal player Don Roper rejected the job before Sam Bartram was appointed in March 1956. Bartram, a former Charlton Athletic player, was a popular choice, having been a favourite with the fans while playing for the club during the war. York invested heavily in transfers for 1956–57, spending £12,000 on fees—a sizeable amount at that time. The aim was promotion to the Second Division, but the team failed to make the intended impact and finished in seventh place. The 1957–58 season was the last of regionalised football; the top 12 clubs in the North and South sections would form the new Third Division, and the bottom clubs would become founder members of the Fourth Division. York went into the Easter period third from bottom, but after 7 wins and 3 draws in their last 10 matches they missed out on a top-12 position on goal average. York led the Fourth Division until early November 1958, and despite faltering midseason continued strongly to finish third in 1958–59 and gain promotion for the first time. They only missed out on the runner-up spot to Coventry City on goal average."]}, {"page": "Roper (surname)", "response": ["*Don Roper (1922–2001), an English footballer"]}, {"page": "List of Arsenal F.C. managers", "response": ["Allison resigned in 1947, a year after professional football resumed, and his position was taken over by Tom Whittaker, the club's first-team trainer. Intent on playing an expansive style of football, he purchased Don Roper and converted Ian McPherson's position from defender to winger. The changes had the desired effect as Arsenal won the 1947–48 First Division championship. Whittaker won the club's third FA Cup in 1950 and repeated early league success in 1952–53. The club's success began to wane after this, which in turn commenced a stressful period for Whittaker. In October 1956 he died of a heart attack, aged 58. Jack Crayston presided over first-team affairs as caretaker, before he was named permanent manager at the end of 1956. His time was brief compared to his predecessors and left the club in May 1958, achieving a twelfth-place finish in the league."]}, {"page": "List of English cricket and football players", "response": ["| Don Roper"]}, {"page": "1948 FA Charity Shield", "response": ["|OR ||7 || Don Roper"]}, {"page": "1946–47 Arsenal F.C. season", "response": ["Dr. Kevin O'Flanagan made 14 First Division appearances and scored three goals. He made his first-class league debutAppearances in wartime leagues such as the Football League South are not counted as official first-class matches by statisticians, hence this is considered O'Flanagan's first-class league debut. against Blackburn Rovers on 4 September and his last appearance for the senior team came on 28 December 1946 against Wolves. Bernard Joy played the first half of the 1946–47 season before deciding that his age (35) was counting against him; he retired from top-flight football in December 1946. George Curtis played 12 times in the 1946–47 season, but was sold to Southampton in part-exchange for Don Roper in summer 1947."]}, {"page": "Tommy Rudkin", "response": ["After the war Rudkin played for Peterborough United in their pre-Football League days and joined First Division Arsenal in January 1947. He made five appearances for Arsenal during the 1946–47 season. Rudkin and George Curtis joined Southampton in exchange for Don Roper in August 1947 with Rudkin valued at £3,000. He made only a few sporadic appearances over the next two seasons before moving to Ashton Gate."]}, {"page": "Brian Clifton", "response": ["He joined Southampton in 1952, making his debut in the reserves on 3 January 1953. He signed for Southampton in February 1953, shortly before his 19th birthday and continued to make occasional appearances for the reserves over the next four years. His football career was interrupted by his National service, which he spent with the Royal Air Force, and it was not until 28 September 1957 that he made his first-team debut when he took the place of Derek Reeves at centre-forward for a Third Division South match against Brighton & Hove Albion. Clifton scored twice with a lob and a header as the \"Saints\" won 5–0. Clifton retained his place at centre-forward for the next six matches, with Reeves returning at inside-left, and scored another brace in a 7–0 rout of Bournemouth on 5 October. In November, he lost his place to Reeves, with Don Roper returning at inside-right, after which he only made five further appearances in 1957–58, this time at inside-right."]}, {"page": "John Hoskins (footballer)", "response": ["In 1957–58, Hoskins regained his fitness and his place on the left, with Paine becoming a fixture on the right wing. Hoskins made 37 appearances, scoring 18 goals (his best tally for a season); despite scoring 112 goals (with Derek Reeves and Don Roper contributing 31 and 18 respectively), the defence conceded 72 goals, and as a consequence, the Saints finished in sixth place, six points behind the champions. Hoskins gained further representative honours when he was selected to play for the Third Division South against their northern equivalents."]}, {"page": "List of people from Hampshire", "response": ["*Don Roper, footballer, was born in Botley"]}, {"page": "1953 FA Charity Shield", "response": ["Arsenal took the lead in the 65th minute when Jimmy Logie's pass was collected by Holton. His shot at goal rebounded into the path of Doug Lishman, who was following up, and he scored. Ten minutes before the end, a cross by Don Roper into Blackpool’s penalty area was headed down by Lawton; the ball reached Lishman who scored again to make sure of Arsenal's win.", "|OL ||11|| Don Roper"]}, {"page": "Deaths in June 2001", "response": ["*Don Roper, 78, English footballer."]}, {"page": "1946–47 Southampton F.C. season", "response": ["In preparation for the 1946–47 season, Southampton played two pre-season friendly matches. On 14 August 1946 the Saints won 4–1 against Irish club Bohemians, with new signing George Lewis and Don Roper scoring two goals each. They then beat French side Le Havre 7–0 at home thanks to a hat-trick from Don Roper, two goals from Doug McGibbon, and one each from Jack Bradley and Bobby Veck.", "In the fourth round Southampton travelled to face Newcastle United, who were then second in the Second Division league table. The Saints took the lead in the 11th minute, as Don Roper shot from the outside of the box and scored due to a deflection off centre-half Frank Brennan. The lead remained until the break, before Charlie Wayman equalised for the hosts shortly after half-time. Nine minutes later he scored again, heading in a Doug Wright free-kick. Wayman completed his hat-trick later in the game to put Newcastle through to the fifth round. The Magpies went on to make it to the semi-finals of the tournament, before being knocked out by eventual champions Charlton Athletic.", "!scope=\"row\"|Don Roper", "|align=\"left\"|Don Roper", "|align=\"left\"|Don Roper"]}]}}