{"wiki_id": "http://www.wikidata.org/entity/Q3524823", "itemLabel": "Denis Hill-Wood", "itemDescription": "English cricketer (1906-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Denis_Hill-Wood", "wikipedia_page": {"main": "Denis John Charles Hill Hill-Wood  (25 June 1906 – 5 May 1982) was the chairman of Arsenal Football Club from 1962 until 1982. He was also an English cricketer who played First Class cricket for Oxford University and Marylebone Cricket Club (MCC) in 1928 and Derbyshire in 1928 and 1929.\nHill-Wood was the third son of Sir Samuel Hill-Wood, 1st Baronet, who was chairman of Arsenal for twenty years, as well as a first-class cricketer for Derbyshire.  Hill-Wood went to Oxford University and played seven matches for the university in the 1928 season. He then played for MCC in Ireland and made his first-class debut for Derbyshire at the end of the 1928 season when he played three matches. He played one match in the 1929 season.Similarly to his father, Denis became chairman of Arsenal football club in 1962, a job which he held until his death in 1982. A bust of Hill-Wood was commissioned and used to stand inside the Directors' Landing of the East Stand of Arsenal's Highbury stadium, and now stands in the Directors' Entrance of Emirates Stadium after Arsenal's move there.\nDenis had three brothers who also took part in first-class cricket for Derbyshire, the others being Basil Hill-Wood, Wilfred and Charles. Denis's son, Peter, played one first-class match in 1960.\nHill-Wood was educated at Eton and Christ Church, Oxford. During the Second World War he served with the Royal Armoured Corps and was wounded in Libya. With other officers he was awarded the Military Cross in 1943 \"in recognition of gallant and distinguished services in the Middle East\".\n\n", "link_mentions": [{"page": "Emirates Stadium", "response": ["The Emirates Stadium pays tribute to Arsenal's former home, Highbury. The club's offices are officially called Highbury House, located north-east of Emirates Stadium, and house the bust of Herbert Chapman that used to reside at Highbury. Three other busts that used to reside at Highbury of Claude Ferrier (architect of Highbury's East stand), Denis Hill-Wood (former Arsenal chairman) and manager Arsène Wenger have also been moved to Emirates Stadium and are in display in the entrance of the Diamond Club. Additionally, the clock that gave its name to the old Clock End has been resited on the new clock end which features a newer, larger replica of the clock. The Arsenal club museum, which was formerly held in the North Bank Stand, opened in October 2006 and is located to the north of the stadium, within the Northern Triangle building. It houses the marble statues that were once held in the marble halls of Highbury."]}, {"page": "George Swindin", "response": ["In March 1962, Arsenal chairman Denis Hill-Wood confirmed that Swindin's contract would not be renewed at the end of the season. He then became manager of Norwich City for five months, and then Cardiff City from late 1962 to 1964. At Cardiff, he signed John Charles from Roma, but after a bright start Cardiff soon faded and he resigned after the team were relegated to the Second Division. After that, he had spells as manager of Kettering Town and Corby Town before leaving the game for good."]}, {"page": "Peter Hill-Wood", "response": ["Peter Denis Hill-Wood (25 February 1936 – 28 December 2018) was a British businessman and a chairman of Arsenal Football Club.", "Hill-Wood was born in Kensington, London, son of Denis Hill-Wood and his wife Mary Smith.", "He was the third generation of his family to serve as chairman of Arsenal, following his father, Denis Hill-Wood (in office 1962–1982), and his grandfather, Samuel Hill-Wood (1929–1936 and 1946–1949) from Glossop, Derbyshire. Peter Hill-Wood succeeded his father after the latter's death in 1982. He was not in charge of any day-to-day business at the club, which was generally run by David Dein and a succession of first team managers."]}, {"page": "Basil Hill-Wood", "response": ["Hill-Wood married Joan Louisa Brand, daughter of Thomas Walter Brand, 3rd Viscount Hampden and Lady Katharine Mary Montagu Douglas Scott, on 18 February 1925. They had a daughter and a son David who inherited the baronetcy.The Peerage.com As well as his father, Hill Wood's brothers Wilfred Hill-Wood, Denis Hill-Wood and Charles Hill-Wood played cricket for Derbyshire."]}, {"page": "Charles Hill-Wood", "response": ["Hill-Wood was born at Hoxne, Suffolk, the fourth son of Sir Samuel Hill-Wood, 1st Baronet, a Member of Parliament who had also played cricket for Derbyshire. He was educated at Eton and played cricket for the Eton XI in 1925 and 1926. He then went to Christ Church, Oxford. As well as his father, Hill-Wood's brothers Basil Hill-Wood, Wilfred Hill-Wood, and Denis Hill-Wood played cricket for Derbyshire."]}, {"page": "Eton v Harrow", "response": ["Other players who were later first-class cricketers were not selected for their school, including Charles Lyttelton (later 10th Viscount Cobham), Wykeham Cornwallis (later 2nd Baron Cornwallis), Nigel Haig and Denis Hill-Wood."]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* Denis Hill-Wood (1928) : D. J. C. H. Hill-Wood (Derbyshire)"]}]}}