{"wiki_id": "http://www.wikidata.org/entity/Q3525985", "itemLabel": "Sailor Young", "itemDescription": "Cricket player of England. (1876-1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sailor_Young", "wikipedia_page": {"main": "Harding Isaac \"Sailor\" Young (5 February 1876, Leyton, Essex – 12 December 1964, Rochford, Essex) was a professional cricketer who played for Essex and England.\nYoung was a left-arm medium-pace bowler and a capable lower-order batsman. His bowling achieved considerable turn off the wicket, and was described in Wisden as having \"a deceptive curl\"[2]. Young's cricketing successes in minor matches led Essex to buy him out of the Royal Navy. He played a few games in 1898, but came to prominence early the following year, when he took eleven wickets for 74 runs against a powerful Australian touring side and gave Essex a surprising victory by 126 runs. The Times, describing his bowling in the second innings when he took seven for 32, said \"Young's bowling could not be played\", that he \"came off the pitch at a great pace\" and \"turned six inches with his arm\". He continued to bowl so well in a very dry summer of prolific run scoring that by July he was regarded by some as \"the best hard wicket bowler at England's disposal\".Sailor Young was picked for two Test matches that season and took six wickets in each of them, finishing at the top of the England averages. However, as a result of him losing form somewhat after bowling the Players to victory at The Oval, Sailor Young was discarded for the last match of the series and never played Test cricket again. He still took 139 wickets for the year, making him the sixth highest wicket-taker.\nYoung's success in 1899 led to great expectations for him, but after an excellent performance for the Marylebone Cricket Club (MCC) against Yorkshire early in the year \"Sailor\" surprisingly fell off to such an extent that for Essex in county matches he took only forty-three wickets as against eighty-nine. After improving a little in 1901 and doing an impressive performance on a soft pitch against Kent early in 1902 \"Sailor\" nevertheless fell off completely. By 1903 his wicket tally was down to just 52 and after that season he dropped out of regular cricket because of severe rheumatism in his muscles. Sailor Young continued to play a few matches for Essex and as a member of the MCC ground staff right up to 1912, but could never undertake anything more than very short bowling spells. In 1910-11 he was a member of the MCC team that toured the West Indies.\nFrom 1921 to 1931, Young was a first-class umpire and he officiated in two Test matches in 1924 and 1926.", "link_mentions": {}}}