{"wiki_id": "http://www.wikidata.org/entity/Q352131", "itemLabel": "William Thomas Best", "itemDescription": "English organist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Thomas_Best", "wikipedia_page": {"main": "William Thomas Best (13 August 1826 – 10 May 1897) was an  English organist and composer.", "link_mentions": [{"page": "Selby Abbey", "response": ["The first organ since the reformation was installed in 1825 by Renn and Boston, in a gallery on the east side of the choir screen wall. This organ was rebuilt several times by Booth of Wakefield, Forster and Andrews of Hull and Conacher of Huddersfield. In 1868 the organ was rebuilt and moved to a bay in the choir. The opening recital was given by William Thomas Best."]}, {"page": "1826 in music", "response": ["*August 13 – William Thomas Best, organist (d. 1897)"]}, {"page": "Toccata and Fugue in D minor, BWV 565", "response": ["In the early 1910s, Albert Schweitzer collaborated with Charles-Marie Widor to compile a complete edition of Bach's organ compositions, published by Schirmer.Schweitzer 1995 In 1912, BWV 565 was published in the second volume, containing works of Bach's \"first master period\".Widor and Schweitzer 1912 (score) Around the start of the First World War, Augener republished William Thomas Best's late 19th-century edition of the work in volume 2 of their complete edition of Bach's organ works.Best 1914 (score)"]}, {"page": "Giulio Cesare", "response": ["Of the fifty two songs from operas and oratorios in the \"Royal Edition\" selected by William Thomas Best in 1880, with English translations of the Italian texts by Maria X. Hayes, only three came from Giulio Cesare, all for Cleopatra: Piangerò la sorte mia (\"Hope, no more this heart sustaining\"); V'adoro, pupille, saette d'amore (\"Ye dear eyes so tender\"); and Da tempeste (\"When by storms\"). Chrysander's faithful rendition of Handel's original score was accompanied in 1878 by a seven volume compendium of opera and oratorio songs prepared for Breitkopf & Hārtel by Victorie Gervinus, widow of the Handel scholar Georg Gottfried Gervinus. The possible voice types—soprano, mezzo-soprano, alto, tenor, bass—are given for each aria or recitative. All the texts were in German with no reference to Italian or English; and in all the seven volumes there are only six numbers from Giulio Cesare: Alma del gran Pompeo (Vol. 1), Priva son d'ogni conforta (Vol.2), V'adoro pupille (Vol. 3), Svegliatevi nel core (Vol. 4), Nel tuo seno, amico sasso and Tutto può donna vezzosa (Vol. 5)."]}, {"page": "St Martin-in-the-Fields", "response": ["*William Thomas Best 1852–1855?"]}, {"page": "List of Anglican church composers", "response": ["*William Thomas Best"]}, {"page": "Sonatas and Partitas for Solo Violin (Bach)", "response": ["**William Thomas Best, organ"]}, {"page": "Partita for Violin No. 2 (Bach)", "response": ["The earliest version for organ is by William Thomas Best. Further transcriptions are by John Cook, Wilhelm Middelschulte, Walter Henry Goss-Custard (1915–55), and Henri Messerer (1838–1923)."]}, {"page": "Best (surname)", "response": ["* William Thomas Best (1826–1897), English organist and composer"]}, {"page": "George Whiting", "response": ["George Whiting was born in Holliston, Massachusetts on September 14, 1840. He founded the Beethoven Society in Hartford, Connecticut when he was fifteen years old. He moved to Boston, Massachusetts in 1862 and later to New York City. Whiting was a student of George Washbourne Morgan. He went to Liverpool, England, and studied with William Thomas Best. He later studied in Berlin with Carl August Haupt (harmony), Robert Radecke (orchestration), and others."]}, {"page": "William Best", "response": ["*William Thomas Best (1826–1897), English organist"]}, {"page": "W. T. Best", "response": [" #REDIRECT William Thomas Best"]}, {"page": "Romain-Octave Pelletier I", "response": ["Pelletier spent almost two years touring Europe in 1871-1872. During that time he studied under George Cooper, William Thomas Best, and John Baptiste Calkin in London, Jacques-Nicolas Lemmens in Brussels, and with pianist Antoine François Marmontel and organist Louis Lebel in Paris. He notably performed works by Bach in the presence of Charles-Marie Widor at the Église Saint-Sulpice in 1872. He later sojourned to Europe again in 1900 in the company of organ builders Joseph-Claver Casavant and Samuel-Marie Casavant."]}, {"page": "Clavier-Übung III", "response": ["In the late 1840s and early 1850s, organ building in England became more stable and less experimental, taking stock of traditions in Germany and innovations in France, particularly from the new generation of organ builders such as Aristide Cavaillé-Coll. One of the main names in organ building in England in the second half of the 19th century was Henry Willis. The manner in which the organ for St. George's Hall, Liverpool was planned and constructed marks the transition from what Nicholas Thistlethwaite calls the \"insular movement\" of the 1840s to the adoption of the established German system. Planning formally started on the organ in 1845: the main advisor to Liverpool Corporation was Samuel Sebastian Wesley, son of Samuel Wesley and an accomplished organist, particularly of Bach. He worked in consultation with a panel of university professors of music, who often disagreed with his eccentric suggestions. When Wesley tried to argue about the range of manual keyboards, justifying himself by the possibility of playing octaves with the left hand, he was reminded by the professors that the use of octaves was more common among pianists than first-rate organists and moreover that when he had been organist at Leeds Parish Church, \"the dust on the half-dozen lowest keys on the GG manuals remained undisturbed for months.\" Willis was commissioned to build the organ only in 1851, after he had impressed the committee with the organ for Winchester Cathedral he had on display at The Crystal Palace during the Great Exhibition. The completed organ had four manual keyboards and a thirty key pedalboard, with 17 sets of pedal pipes and a range from CC to f. The instrument had unequal temperament and, as Wesley had stipulated, the air supply came from two large underground bellows powered by an eight horse-power steam engine. Among the innovations introduced by Willis were the cylindrical pedal-valve, the pneumatic lever and the combination action, the latter two features being adopted widely by English organ builders in the second half of the 19th century. The organ was inaugurated in 1855 by William Thomas Best, who later that year was appointed resident organist, attracting crowds of thousands to here his playing. In 1867, he had the organ retuned to equal temperament. He remained in his post until 1894, giving performances elsewhere in England, including at the Crystal Palace, St James's Hall and the Royal Albert Hall. The St Anne prelude and fugue BWV 552 was used by Best to start off the series of Popular Monday Concerts at St James's Hall in 1859; and later in 1871 to inaugurate the newly built Willis organ in the Royal Albert Hall, in the presence of Queen Victoria.See:"]}, {"page": "List of Freemasons (A–D)", "response": ["* William Thomas Best (13 August 1826 – 10 May 1897), English organist"]}, {"page": "Polibio Fumagalli", "response": ["Much of Fumagalli's compositional output was for his own instrument.  His work La Caccia was taken up by the English organist William Thomas Best as a frequent concert piece."]}, {"page": "Robert Sparrow Smythe", "response": ["The 1890s continued Smythe's association with Rev. Clark and a re-engagement with musical clients but of a higher order: opera singers Charles Santley and Janet Patey, organist William Thomas Best, Charles Hallé, Wilhelmina Neruda-Norman (Wilma Neruda) and Marion Burton and Horace Poussard all filled the calendars of 1890 and 1891. By this time Smythe was aided by his son Carlyle in the running of what was now the \"Smythe Agency.\" In 1892 Henry Moreton Stanley toured, and later Max O'Rell, the French humorist. In 1894 after taking a year off for travel, Smythe toured with the Rev. Thomas De Witt Talmage, the very animated American preacher. The violinist Camilla Urso soon charmed Australian audiences under Smythe's imprint and 1895 saw Smythe take on three principle platform speakers; music historian Rev. Hugh Reginald Haweis, war correspondent Frederic Villiers and Mark Twain, after Twain had accepted Smythe's invitation to tour the world in 1895. becoming the \"Lion\" of Smythe's career. Part of Twain's tour was managed by Smythe's son Carlyle."]}, {"page": "List of music students by teacher: A to B", "response": ["===William Thomas Best==="]}, {"page": "W.T. Best", "response": ["#REDIRECT William Thomas Best"]}, {"page": "St Cuthbert's Church, Darlington", "response": ["The organ dates from 1880 when it was built by Forster and Andrews. Later work by Binns Fitton & Haley and Bishop & Son in 1987 has resulted in a 38 stop 3 manual and pedal organ. The specification can be found on the National Pipe Organ Register. The new organ cost about £1,000 () and was opened on 3 November 1880 by William Thomas Best. "]}, {"page": "Reception of Johann Sebastian Bach's music", "response": ["In the late 1840s and early 1850s, organ building in England became more stable and less experimental, taking stock of traditions in Germany and innovations in France, particularly from the new generation of organ builders such as Aristide Cavaillé-Coll. One of the main names in organ building in England in the second half of the 19th century was Henry Willis. The manner in which the organ for St. George's Hall, Liverpool was planned and constructed marks the transition from what Nicholas Thistlethwaite calls the \"insular movement\" of the 1840s to the adoption of the established German system. Planning formally started on the organ in 1845: the main advisor to Liverpool Corporation was Samuel Sebastian Wesley, son of Samuel Wesley and an accomplished organist, particularly of Bach. He worked in consultation with a panel of university professors of music, who often disagreed with his eccentric suggestions. When Wesley tried to argue about the range of manual keyboards, justifying himself by the possibility of playing octaves with the left hand, he was reminded by the professors that the use of octaves was more common among pianists than first-rate organists and moreover that when he had been organist at Leeds Parish Church, \"the dust on the half-dozen lowest keys on the GG manuals remained undisturbed for months.\" Willis was commissioned to build the organ only in 1851, after he had impressed the committee with the organ for Winchester Cathedral he had on display at The Crystal Palace during the Great Exhibition. The completed organ had four manual keyboards and a thirty key pedalboard, with 17 sets of pedal pipes and a range from CC to f. The instrument had unequal temperament and, as Wesley had stipulated, the air supply came from two large underground bellows powered by an eight horse-power steam engine. Among the innovations introduced by Willis were the cylindrical pedal-valve, the pneumatic lever and the combination action, the latter two features being adopted widely by English organ builders in the second half of the 19th century. The organ was inaugurated in 1855 by William Thomas Best, who later that year was appointed resident organist, attracting crowds of thousands to here his playing. In 1867, he had the organ retuned to equal temperament. He remained in his post until 1894, giving performances elsewhere in England, including at the Crystal Palace, St James's Hall and the Royal Albert Hall. The St Anne prelude and fugue BWV 552 was used by Best to start off the series of Popular Monday Concerts at St James's Hall in 1859; and later in 1871 to inaugurate the newly built Willis organ in the Royal Albert Hall, in the presence of Queen Victoria.See:"]}]}}