{"wiki_id": "http://www.wikidata.org/entity/Q3526801", "itemLabel": "Alec Kennedy", "itemDescription": "English cricketer (1891-1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alec_Kennedy", "wikipedia_page": {"main": "Alexander Stuart Kennedy (24 January 1891 – 15 November 1959) was a Hampshire cricketer and one of the ten highest wicket-takers in first-class cricket.\n\n", "link_mentions": [{"page": "Jack Hobbs", "response": ["Hobbs' technique was based on strong forearms and good foot movement. R. C. Robertson-Glasgow suggested that \"his footwork was, as near as is humanly possible, perfect. In every stroke, he moved into line with the ball with so little effort that he could bat for hours without over-taxing energy of mind or body.\"Robertson-Glasgow, p. 10. He played every type of shot—he did not have a \"signature\" shot like other batsmen, but selected his strokes effectively;Robertson-Glasgow, pp. 10–11. according to Alec Kennedy, who bowled to Hobbs, it seemed that he could predict what the bowler would do. In contrast to many leading batsmen from his time, Hobbs preferred to play off the back foot as he believed it gave him more time to see the ball and adapt his shot.McKinstry, p. 116. Capable of playing all the strokes, he hit the ball precisely between fielders and sometimes delayed his shot to make the ball travel more slowly and allow more time to run; he also ran well between the wickets. He liked to score his first run quickly when he came into bat, and he often looked to score quickly at the start of an innings, before the bowlers had settled; on occasion, Hobbs targeted the main bowling threats from the opposition in an attempt to neutralise them.Murphy, pp. 42–43. Early in his career, mainly before the First World War, Hobbs was an aggressive, fast-scoring batsman who played many shots. After the war, he was more circumspect and adapted his technique to account for both his increased age, and the increased pressure and expectation from the public and teammates. He concentrated to a greater extent on batting for longer periods; many critics, including Hobbs himself, recognised the change and suggested that he was a better batsman before 1914. However, commentators also noted that he displayed greater certainty and control in this later period;Arlott, pp. 74–75.McKinstry, pp. 118–19. Cardus wrote that \"he scored his centuries effortlessly now; we hardly noted the making of them.\" This was the period in which he became known as \"The Master\",Murphy, p. 39. and he was more consistent than before the war. This was the time when the public regarded him with the most respect and affection; 98 of his centuries and 26,411 of his runs (at an average of 58.62) in first-class cricket were scored after he reached the age of 40."]}, {"page": "1932 in sports", "response": ["* Wisden Cricketers of the Year – Ewart Astill, Freddie Brown, Alec Kennedy, C. K. Nayudu, Bill Voce "]}, {"page": "1921 in sports", "response": ["* Most wickets – Alec Kennedy 186 @ 21.55 (BB 8–11)"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Alec Kennedy"]}, {"page": "Douglas Jardine", "response": ["Wisden believed that Jardine's effective batting technique meant that fast bowlers troubled him less than other batsmen. He did have difficulties with a few bowlers. Alec Kennedy, a medium paced inswing bowler, took Jardine's wicket eleven times, eight of these occasions before the batsman had scored 20 runs. Kennedy found that Jardine had slightly slow footwork, often bowling him or trapping him lbw.Douglas, p. 55. Bert Ironmonger also troubled Jardine, taking his wicket in five of the eleven Test innings in which they faced each other.Douglas, p. 71. Jardine displayed a slight weakness against Australian slow bowlers, not moving his feet well enough against them. In 16 Test innings in Australia, he was out to slow bowlers ten times, but he rarely experienced similar difficulties against English spinners.Le Quesne, p. 120. One other bowler to cause Jardine problems was the Australian paceman Tim Wall, who took his wicket five times on the nine occasions he bowled to him.Douglas, p. 88."]}, {"page": "Mike Denness", "response": ["Scotland did not have a representative international team at the time of Denness' career, so he could only play for England at Test and ODI level.  He was the sixth player born in Scotland to play for England, after Gregor MacGregor, Alec Kennedy, Ian Peebles, David Larter and Eric Russell, but remains the only England captain to be born in Scotland (Douglas Jardine and Tony Greig had Scottish parents, but Jardine was born in Bombay and Greig in South Africa)."]}, {"page": "Derek Shackleton", "response": ["He was the leading first-class wicket-taker every year from 1962 to 1965, and although limited-overs cricket showed his bowling could be hit, Shackleton remained very economical up until his retirement from first-class cricket at the end of 1968 – still among the top ten wicket-takers in the country. He played a few limited-overs games in 1969 and 1970, and played for Dorset for a number of years after this, showing he still retained his skill in the 1973 Gillette Cup.  As of 2007, he has the seventh-highest tally of first-class wickets, behind Rhodes, Tich Freeman, Charlie Parker, Jack Hearne, Tom Goddard and Alec Kennedy.  Shackleton has the most first-class wickets of any player who played his whole career after the World War II.Cricinfo.com  He was also economical, with 35% of his overs being maidens, and conceding an average of only two runs per over."]}, {"page": "Hampshire County Cricket Club", "response": ["Phil Mead is the club's leading run-scorer with 48,892 runs in 700 matches for Hampshire between 1905 and 1936. Fast bowler Derek Shackleton took 2,669 wickets in 583 first-class matches between 1948 and 1969 which remains a club record. Alec Kennedy, whose career lasted from 1907 to 1936, was the first player to score 10,000 runs and take 1,000 wickets for Hampshire. Colin Ingleby-Mackenzie was both Hampshire last amateur captain and first professional captain."]}, {"page": "Gentlemen v Players", "response": [":10–37: Alec Kennedy, Players, The Oval, 1927"]}, {"page": "List of Test cricketers", "response": ["Alec Kennedy ·"]}, {"page": "Australian Imperial Force Touring XI", "response": ["The Australians travelled south again on 19 June, taking the trains from Sheffield to Southampton where they played Hampshire in a two-day match 20 and 21 June on the County Ground, Southampton. This match was rain-affected and the short schedule left no time to make up for stoppages so it was an inevitable draw after Hampshire scored 191 and 67 for one, and the Australians scored 136. The Australian batsmen struggled in the conditions against the seam bowling of Alec Kennedy."]}, {"page": "List of first-class cricket records", "response": ["| 2,874 wickets || Alec Kennedy (Hampshire and England) ||677|| 21.23 || from 1907 to 1936"]}, {"page": "County Ground, Southampton", "response": ["Developments continued afoot at the ground, with a new frontage for the main pavilion being built in 1896, with the addition a newly built ladies pavilion adjacent to it. The football stand was redeveloped in 1900 and eleven years later a new scoreboard was erected. During this period, Hampshire had financial difficulties and it was discussed by the committee in 1904 to close the ground. The closure of the ground never materialised and in 1912 Hampshire famously defeated the touring Australians, their first victory over a touring team, with Phil Mead scoring an unbeaten 160 and Alec Kennedy taking match figures of 11 for 181."]}, {"page": "Solomon Joel", "response": ["In the 1924–25 South African cricket season, Joel organised a team of mostly English players to tour the country and play matches against the national and provincial teams. The team was known as S. B. Joel's XI and included leading players Ewart Astill, George Geary, Percy Holmes, Alec Kennedy, Charlie Parker, Jack Russell, Lionel Tennyson and Ernest Tyldesley."]}, {"page": "1922 English cricket season", "response": ["Warwickshire and Hampshire took part in one of the most remarkable of all County Championship matches, at Edgbaston on 14–16 June. Warwickshire made 223 and then dismissed Hampshire for only 15, Calthorpe taking 4/4 and Howell 6/7. Eight batsmen made ducks. Following on, Hampshire did much better, but still seemed certain to lose at 274 for 8. George Brown with 172, and the captain's valet and wicket-keeper Walter Livsey with 110 not out, took the total to 521. Warwickshire needed 314 to win. Jack Newman and Alec Kennedy then bowled Hampshire to a remarkable victory.Warwickshire v Hampshire scorecard Retrieved 2 September 2010.John Arlott, Arlott on Cricket, edited by David Rayvern Allen, Fontana/Collins, 1985 edition, , pp. 10–14, \"The Impossible Victory\"."]}, {"page": "1932 English cricket season", "response": ["*Wisden – Ewart Astill, Freddie Brown, Alec Kennedy, C. K. Nayudu, Bill Voce"]}, {"page": "Jack Newman (English cricketer)", "response": ["In a long first-class career that lasted from 1906 to 1930, he took 2054 wickets at an average of 25.02, with best innings figures of 9/131.See also Variations in First-Class Cricket Statistics#Other cricketers as Wisden credits him with 2,032 wickets at 25.15. Newman took ten or more wickets in a match on 35 occasions. In 1927 he took 16 wickets for 88 runs against Somerset. Only two players taking more wickets in a career were never capped by England.Don Shepherd of Glamorgan and George Dennett of Gloucestershire. For a number of years he and Alec Kennedy carried the Hampshire attack with little support, on two occasions bowling unchanged through both innings of a match."]}, {"page": "Walter Livsey", "response": ["Livsey's debut for Hampshire came on 30 June 1913 against Oxford University CC at the County Ground, Southampton.First-Class Matches played by Walter Livsey from CricketArchive retrieved 3 June 2008 He scored 11* and 7*, taking two catches and making one stumping. Hampshire v Oxford University scorecard, 30 June – 1 July 1913, from CricketArchive retrieved 3 June 2008 He allowed only three byes in the University's first innings of 554. Such tidy keeping prompted Hampshire to take Livsey on as their regular keeper. He played his first full season the following year, playing 28 matches in all. Batting at number ten in the order, Livsey was not out on many occasions, 20 of his 37 innings during this season alone and across his whole career he was not out on 137 occasions. First-class Batting and Fielding in Each Season by Walter Livsey from CricketArchive retrieved 3 June 2008 He scored only 130 runs in the 1914 season, with a high score of 42* and an average of 7.64, however he took 39 catches and completed 23 stumpings. The most famous of these, of Surrey player Jack Hobbs, was made on 23 July 1914 during a 3-day match at Portsmouth. Hobbs, on three,Hampshire v Surrey - County Championship 1914 from CricInfo retrieved 3 June 2008 was bowled a \"sharply lifting ball\" by Alec Kennedy which was passing wide of leg stump. Livsey was able to retrieve the ball and remove the bails before Hobbs could get back behind the crease. This dismissal, of such a prestigious player, caused \"quite a sensation\" according to the Wisden Cricketers' Almanack."]}, {"page": "1914 County Championship", "response": ["|style=\"text-align:center;\"| 148 ||style=\"text-align:center;\"| 20.09 || Alec Kennedy || Hampshire"]}]}}