{"wiki_id": "http://www.wikidata.org/entity/Q3528648", "itemLabel": "Morice Bird", "itemDescription": "Cricket player of England. (1888-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Morice_Bird", "wikipedia_page": {"main": "Morice Carlos Bird (25 March 1888, in St Michael's Hamlet, Liverpool, Lancashire – 9 December 1933, in Broadstone, Dorset) was an English cricketer who played in 10 Tests from 1910 to 1914, all of them in South Africa.\nBird's fame as a cricketer in the years before the First World War rested more on his deeds as a schoolboy than on his prowess as a county or Test player. In 1907, as captain of the Harrow School team, he scored two centuries in the annual match at Lord's against Eton College that was one of the social highlights of the year.He played a few games for Lancashire that season, then disappeared for two years, reappearing in 1909 with Surrey. On a fairly flimsy record, he was taken by H. D. G. Leveson Gower on the 1909–10 English tour of South Africa, where he played in all five Tests. He took three wickets for 11 runs in his first Test against South Africa at Johannesburg and in the third Test he put on 95 for the seventh wicket with Jack Hobbs, a stand that enabled England to win the match by three wickets. In the fourth match at Cape Town he scored 57 in the first innings.\nBack in England, Bird played regularly for Surrey in 1910 and took over as the county's captain from Leveson-Gower for two years from 1911. A forceful right-handed batsman, he scored 1,000 runs in three seasons and also took useful wickets with medium-pace bowling. But he appears never to have been in serious contention for a Test place until selected again for a South African tour in 1913–14, under Johnny Douglas. He made his highest Test score, 61, in the first Test at Durban, putting on 115 for the seventh wicket with Douglas, but achieved little else in the series until he took the first three wickets in South Africa's second innings in the final match, played at Port Elizabeth.\nBird played only a few first-class matches after the First World War, and coached at his old school and later at Surrey. He was ill for several years before his death at the age of 45.", "link_mentions": {}}}