{"wiki_id": "http://www.wikidata.org/entity/Q3524859", "itemLabel": "Thomas Algernon Chapman", "itemDescription": "Scottish lepiopterist", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Algernon_Chapman", "wikipedia_page": {"main": "Thomas Algernon Chapman (2 July 1842, Glasgow – 17 December 1921) was a Scottish entomologist.\nChapman was a physician and an entomologist who specialised in Lepidoptera.\nHe became a fellow of the Entomological Society of London in 1891, of the Zoological Society of London and of the Royal Society, in 1918.", "link_mentions": [{"page": "Elkalyce diporides", "response": ["Category:Taxa named by Thomas Algernon Chapman"]}, {"page": "Artopoetes", "response": ["Category:Taxa named by Thomas Algernon Chapman"]}, {"page": "Bothrinia", "response": ["Category:Taxa named by Thomas Algernon Chapman"]}, {"page": "Chapman (surname)", "response": ["*Thomas Algernon Chapman (1842-1921), British entomologist."]}, {"page": "Acronicta rumicis", "response": ["A. rumicis is a moth of the genus Acronicta and family Noctuidae. Noctuidae has upwards of 21,000 species. Noctuids are commonly known as \"owlet moths\" because of their large eyes that shine in the dark and the colour of their wings which make them difficult to see.Singh, H., 2014. Taxonomic Studies on Family Noctuidae (Lepidoptera) from North-East India. In their usual resting position, noctuids fold their wings back over their bodies; the forewings overlap one another. The closed wings form a tent-like shape.Waring, Paul, et al. Field Guide to the Moths of Great Britain and Ireland. British Wildlife, 2009. Almost all Acronicta larvae are brightly coloured with spiky brown hairs all along the dorsal side of the body.Chapman, T.A., 1890. The Genus Acronycta and its Allies. The Entomologist's Record and Journal of Variation, 1(April), pp.1–4, 26–28. According to Thomas Algernon Chapman, the genus Acronicta can be split into three major groups: The first, characterized by a hoop-like structure of the pupa and clumped oviposition, includes: A. auricoma, A. myricae, A. menthanthidis, A. venosa, and A. rumicis. The second, characterized by terminal spines of pupa and dome-shaped ova laid apart from others, includes: A. psi, A. tridens, A. strigosa, A. alni, A. megacephala, A. leporina, A. aceris. The third group has only one species, A. ligustri."]}, {"page": "List of fellows of the Royal Society A, B, C", "response": ["| Thomas Algernon Chapman||02/05/1918||2 June 1842 – 17 December 1921 Entomologist"]}, {"page": "Thomas Chapman", "response": ["* Thomas Algernon Chapman (1842–1921), Scottish entomologist"]}, {"page": "Hypotiini", "response": ["The Hypotiini are a tribe of moths of the family Pyralidae. It was described by Thomas Algernon Chapman in 1902"]}, {"page": "Sevenia benguelae", "response": ["Category:Taxa named by Thomas Algernon Chapman"]}, {"page": "List of fellows of the Royal Society elected in 1918", "response": ["*Thomas Algernon Chapman"]}, {"page": "Heterogynis canalensis", "response": ["Heterogynis canalensis is a moth in the Heterogynidae family. It was described by Thomas Algernon Chapman in 1904.The Global Lepidoptera Names Index reports it as a synonym of Heterogynis penella."]}]}}