{"wiki_id": "http://www.wikidata.org/entity/Q3525972", "itemLabel": "Kathryn Leng", "itemDescription": "Cricket player of England. (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathryn_Leng", "wikipedia_page": {"main": "Kathryn Maria Leng (born 28 September 1973 in Pudsey) is a former English cricketer for England Women, Yorkshire and Bradford/Leeds UCCE.Born in Pudsey, Yorkshire, Leng was U-19 captain for England Women and first played for the senior squad in a One-Day International in 1995. In April 1999, Leng played for Yorkshire Bank first team in the Bradford Cricket League, the first woman to play in that league, and became the first woman to play inter UCCE cricket in 2001. She was dropped from England's one-day squad in 2002 after taking an unauthorized holiday in Tenerife. Although she was recalled for the 2003 tour of Australia, her last Test match was in February 2003. Her highest Test score came in 1996, with 144 against New Zealand, which is the record for the highest individual score by any cricketer when batting at number 7 position or lower in Women's Test history.", "link_mentions": [{"page": "England women's cricket team", "response": ["| 10 || Kathryn Leng || 144 || 229 || 15 || 0 || New Zealand || 24 June 1996"]}, {"page": "Batting order (cricket)", "response": ["# Kathryn Leng (ENG): 144 vs. Australia at Scarborough, 1996"]}, {"page": "Bradford Premier League", "response": ["In April 1999, Kathryn Leng became the first woman to play in the Bradford League, representing the former Yorkshire Bank club."]}, {"page": "Lisa Sthalekar", "response": ["Sthalekar was retained for the Second Test at Bankstown Oval in her home town Sydney, but after her failure as an opener in the preceding match, she returned to her conventional position in the middle-order. In the restructuring in the batting line-up, Kris Britt was called in to make her Test debut as an opener alongside Clark, and middle-order batsman Michelle Goszko was omitted to accommodate Sthalekar. Australia batted first and collapsed to be 3/25, bringing Sthalekar in to join Mel Jones. Sthalekar made 18 from 94 balls, combining with Jones for a 65-run partnership in 99 minutes to steady the innings. She was then dismissed by Pearson, triggering an Australian collapsed to 134 all out, losing their last seven wickets for 44 runs. She then took 0/21 and ran out Kathryn Leng with a throw to Price as the tourists took a 53-run lead. However, Australia's top-order again capitulated, and Sthalekar came to the crease at 3/36; the score then became 4/49 when Jones fell. Sthalekar then combined with Alex Blackwell to take Australia out of trouble, putting on 136 for the fifth wicket before the latter fell for 58. Sthalekar ended with an unbeaten 120, including four fours, from six hours of batting, as Australia declared at 7/259. Sthalekar then took 1/26 from 18 overs, removing Leng lbw, as England ended the match at 6/133 to avoid a defeat."]}, {"page": "Woodhouse Grove School", "response": ["* Kathryn Leng (1985–), cricketer"]}, {"page": "Sarah Collyer", "response": ["In 2002, Collyer and Kathryn Leng were temporarily removed from the side when they went on \"an unauthorised holiday to Tenerife\"."]}, {"page": "Yorkshire Women cricket team", "response": ["Yorkshire joined the Women's County Championship for its inaugural season in 1997, and won five of the first six titles, their run only interrupted by East Midlands in 1999. Key for Yorkshire in this period were players such as Kathryn Leng and Melissa Reynard. Soon after this successful period, however, Yorkshire fell away and were relegated in 2005, and then again in 2007, ending up in Division 3. Their return was swift, however, as they were promoted twice, in 2008 and 2009, including an unbeaten season in Division Two.", "* Kathryn Leng (1995)"]}, {"page": "Katherine Lang", "response": ["*Kathryn Leng, cricketer"]}, {"page": "Katherine Leng", "response": ["#REDIRECT Kathryn Leng"]}, {"page": "Catherine Leng", "response": ["#REDIRECT Kathryn Leng"]}, {"page": "1995 Women's European Cricket Cup", "response": ["Four teams participated, with the hosts, Ireland, joined by the three other European members of the International Women's Cricket Council (IWCC) – Denmark, England, and the Netherlands. A round-robin format was used, with the top two teams proceeding to the final. England was undefeated in the round-robin stage and beat Ireland by seven wickets in the final, winning the championship for the fourth time in a row.Women's European Championship 1995 – CricketArchive. Retrieved 1 December 2015. Ireland's Mary-Pat Moore led the tournament in runs (and scored the only century, against Denmark), and England's Kathryn Leng was the leading wicket-taker.Bowling in Women's European Championship 1995 (ordered by wickets) – CricketArchive. Retrieved 1 December 2015.Batting in Women's European Championship 1995 (ordered by runs) – CricketArchive. Retrieved 1 December 2015. All matches at the tournament were played in Dublin, with five venues being used for the seven matches played.European Cup 1995 (tournament brochure). Retrieved from Women's Cricket History, 3 December 2015.", "* Kathryn Leng", "| Kathryn Leng ||  || 113 || 3 || 113.00 || 44 || 0 || 0", "| Kathryn Leng ||  || 32.0 || 8 || 12.00 || 24.00 || 3.00 || 4/31"]}, {"page": "2000 Women's Cricket World Cup squads", "response": ["| Kathryn Leng ||  || Left || Right-arm leg-spin"]}, {"page": "List of five-wicket hauls in women's One Day International cricket", "response": ["* Kathryn Leng"]}, {"page": "1998 Women's County Championship", "response": ["|Kathryn Leng"]}, {"page": "2003 Super Fours", "response": ["*  Kathryn Leng"]}, {"page": "2002 Super Fours", "response": ["*  Kathryn Leng"]}, {"page": "2004 Super Fours", "response": ["*  Kathryn Leng"]}]}}