{"wiki_id": "http://www.wikidata.org/entity/Q3527303", "itemLabel": "Frank Hayes", "itemDescription": "Cricket player of England. (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Hayes_(cricketer)", "wikipedia_page": {"main": "Frank Charles Hayes (born 6 December 1946, Preston, Lancashire) is a former English cricketer, who played in nine Tests and six ODIs from 1973 to 1976. He made an unbeaten 106 in his first Test appearance, becoming the thirteenth man to score a century on debut for England, but in eight further Tests (all against the West Indies) his highest score was a mere 29.\nFor Lancashire he had more success. He made 94 on his first-class debut in the 1970 season, seven years later hit Malcolm Nash for 34 runs in an over (6-4-6-6-6-6) and captained  the Lancashire side from 1978 to 1980. He retired in 1984.\nHayes was until recently director of cricket at Oakham School.", "link_mentions": [{"page": "Lancashire County Cricket Club", "response": ["Jack Bond became Lancashire captain in 1968 and remained in the position until 1972. During his tenure, Lancashire performed well in the championship, finishing third in 1970 and 1971. His biggest triumph as captain was the five one day trophies he secured during his five-year captaincy. Farokh Engineer joined Lancashire in 1968, and Clive Lloyd joined in 1969; together Lloyd and Engineer helped establish Lancashire as one of the best one day sides in England. The silverware included a hat-trick of Gillette Cups (1970–72) and the Sunday League twice in successive seasons (1969–1970). Mainstays of the successful one day side included Clive Lloyd, David Lloyd, Barry Wood, Harry Pilling, Frank Hayes, Peter Lever, Ken Shuttleworth, David Hughes and Jack Simmons. In the Gillette Cup semi-final against Gloucestershire in 1971, David Hughes walked to the crease at 8.45pm and hit 24 from an over in near darkness to win the match. David Lloyd was captain from 1973 to 1977 and secured Lancashire's fourth Gillette Cup in 1975, and coming runners up in 1974 and 1976. However, in the late 1970s, the team that had been so dominant in the one day format began to break up. Despite boasting international players such as Lloyd and Engineer, Lancashire's first-class performances never matched the success of the limited overs team. Retrieved on 20 October 2007."]}, {"page": "International cricket in South Africa from 1971 to 1981", "response": ["DH Robins' XI team squad comprised: Tony Brown; David Brown; Frank Hayes; Jackie Hampshire; Robin Hobbs; David Hughes; Robin Jackman; Roger Knight; John Lever; Peter Lewington;  Arnold Long; John Murray; Clive Radley; Mike Smith; David Turner; Peter Willey;  Bob Willis;", "The next games for a representative South African side therefore took place on Derrick Robins third tour to South Africa in March and April 1975. This DH Robins' XI was again an international side. Captained once again by Brian Close, it included the following players from Robins' preceding tour: Bruce Francis (Australian), John Shepherd (West Indian), Roger Tolchard, Younis Ahmed (Pakistani). In addition, the following also toured: Malcolm Francke (Sri Lanka/Australia), Geoff Greenidge (West Indies), Tony Greig (South African-born England player), Jackie Hampshire, Frank Hayes, Eddie Hemmings, Terry Jenner (Australia), John Lyon, Clive Radley, Stephen Rouse, John Steele, Stuart Turner, Max Walker (Australia).", "The members of touring party were (England unless stated): Phil Carrick, Trevor Chappell (Australia), Geoff Cope, John Douglas (Australia), Frank Hayes, Mike Hendrick, Geoff Howarth (New Zealand), Andrew Kennedy, Peter Lee, David Lloyd (captain), Derek Randall, Phil Slocombe, David Steele, Fred Titmus, Roger Tolchard, Gary Troup (New Zealand), Dav Whatmore (Australia)."]}, {"page": "Phillip DeFreitas", "response": ["As well as making irregular television appearances, DeFreitas became a cricket master at Oakham School in January 2009, under the school's director of cricket, Frank Hayes.  he taught at Magdalen College School, Oxford."]}, {"page": "Malcolm Nash", "response": ["In August 1977, he was also hit for five sixes and a four by Lancashire batsman Frank Hayes.Cricinfo – Most runs scored off one over"]}, {"page": "Frank Hayes", "response": ["Frank Hayes may refer to:", "*Frank Hayes (actor) (1871–1923), American comic actor in silent films", "*Frank Hayes (unionist) (1882–1948), American labor leader; president of United Mine Workers of America, 1917–1920; Lieutenant Governor of Colorado", "*Frank Hayes (jockey) (1901–1923), American jockey", "*Frank Hayes (cricketer) (born 1946), English cricketer", "*Frank Hayes (musician), American folk musician and information technology writer", "*T. Frank Hayes (1883–1965), Lieutenant Governor of Connecticut"]}, {"page": "Barry Wood (cricketer)", "response": ["Wood and controversy seemed closely linked, and an example of this was the 1975 pay dispute which resulted in Lancashire's international players at that time (Wood, Lever and Frank Hayes) being suspended – Lever and Hayes for three games and Wood for six games. He also left the club in controversial circumstances when, shortly after receiving a record testimonial cheque of £62,429 in 1979, he again entered into a pay dispute marking the end of his Old Trafford career."]}, {"page": "Jack Bond (cricketer)", "response": ["Success with the second team, though, led to an unexpected call-up to be first team captain from 1968 and over the next five seasons, Bond led a previously under-achieving side to a run of success in one-day cricket competitions that has not been equalled. Intensively competitive, Bond led by example in the field and often made useful runs, normally batting at No 6 or lower. A mostly young team included future England cricketers such as Barry Wood, David Lloyd, Frank Hayes, Peter Lever and Ken Shuttleworth, and Lancashire recruited proven matchwinners in Clive Lloyd and Farokh Engineer as the overseas stars."]}, {"page": "List of first-class cricket records", "response": ["| 34 || 6 4 6 6 6 6 || Frank Hayes (Lancashire) || Malcolm Nash (Glamorgan) || Glamorgan v LancashireGlamorgan won the toss and batted first, scoring 217; Jack Simmons took six for 74.  Lancashire replied with 362 for three, including centuries from Barry Wood (155*) and Frank Hayes (119).  In County Championship matches of this period the number of overs in the teams' first innings was restricted, and as time ran out in Lancashire's innings Hayes hit an over from Malcolm Nash for 34; Nash's final figures were none for 71 off 15 overs.  In their second innings Glamorgan were 105 for three when the match was drawn.  Scorecard || Swansea || 1977"]}, {"page": "Hayes (surname)", "response": ["| Frank Hayes (actor) || 1871 || 1923 || AmericanSilent film actor", "| Frank Hayes (unionist) || 1882 || 1948 || AmericanPresident of the United Mine Workers of America; lieutenant governor of Colorado", "| Frank Hayes (cricketer) || 1946 || (living) || EnglishProfessional cricketer", "| Frank Hayes (musician) || before 1980 || (living) || AmericanFilk musician; computer technology columnist", "*Frank Hayes (disambiguation)"]}, {"page": "Martyn Saunders", "response": ["Saunders played for Worcestershire's Second XI as early as 1976, but had to wait four years before making his first-team debut, against Lancashire in the only first-class match ever played at Stourport-on-Severn. Worcestershire recorded a crushing innings victory, but Saunders' only contribution of note was to remove opposing captain Frank Hayes as Lancashire followed on."]}, {"page": "West Indian cricket team in England in 1973", "response": ["West Indies' first innings was built around a fourth wicket partnership of 208 between Clive Lloyd, who made 132, and Kallicharran (80) and enlivened by a late 72 from Boyce. Boyce was then the pick of the bowlers with five wickets for 70 as England collapsed 257 all out after being 247 for five. Only Geoffrey Boycott, with 97, passed 40. West Indies' second innings featured Ron Headley's highest Test score (42, in his first match), plus the second 80 of the match from Kallicharran and 51 from Sobers. Boyce improved his figures in the England second innings, taking six for 77, with three for 61 from Gibbs. The main resistance came from Frank Hayes, who scored an undefeated 106 in his first Test match. Boyce's match figures of 11 for 147 were the best for West Indies versus England at the time (subsequently beaten by Michael Holding with 14 for 149, also at The Oval, in 1976)."]}, {"page": "1975 Cricket World Cup squads", "response": ["| Frank Hayes"]}, {"page": "Pendleton College", "response": ["* Frank Hayes, cricketer, played for Lancashire and England from 1970 to 1984"]}, {"page": "List of Cricket World Cup five-wicket hauls", "response": ["* Frank Hayes"]}]}}