{"wiki_id": "http://www.wikidata.org/entity/Q3529132", "itemLabel": "George Gunn", "itemDescription": "Cricket player of England. (1879-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Gunn_(cricketer)", "wikipedia_page": {"main": "George Gunn (13 June 1879 – 29 June 1958) was an English cricketer who played in 15 Test matches between 1907 and 1930. Domestically, he played first-class cricket for Nottinghamshire from 1902 to 1932, and is their all-time leading run scorer.\n\n", "link_mentions": [{"page": "Harold Larwood", "response": ["In the practice nets, the county players towered over Larwood; the veteran Test batsman George Gunn thought he looked more like a jockey than a cricketer.Hamilton, p. 28 At first he bowled badly, and his efforts were unimpressive. As his confidence increased his bowling improved, and committee members began to revise their initial dismissive judgement; when the session ended, Larwood was offered a playing contract. He accepted instantly; the terms were 32 shillings (£1.60) per week—the same as his mining wages—and he was expected, when not playing, to carry out ground staff duties. Robert Larwood was angry that his son had not asked for more generous terms, but according to Hamilton, Harold would have agreed to anything to escape from the mine, even for a single summer."]}, {"page": "1913 in sports", "response": ["* Wisden Cricketers of the Year – Major Booth, George Gunn, Bill Hitch, Albert Relf, Lionel Tennyson "]}, {"page": "Wisden Cricketers of the Year", "response": ["|  George Gunn"]}, {"page": "Nottinghamshire County Cricket Club", "response": ["The formal creation of Nottinghamshire County Cricket Club was enacted in March or April 1841 (the exact date has been lost). William Clarke established Trent Bridge as a cricket venue adjacent to the public house he ran. It was Clarke's successor as Nottinghamshire captain, George Parr, who first captained a united England touring team in 1859.  The club elected its first president, Sir Henry Bromley, in 1869. Early professional greats such as Alfred Shaw and Arthur Shrewsbury ensured that Notts were a force in the period before 1900. Thanks largely to the outstanding bowling combination of Tom Wass and Albert Hallam, the county won the County Championship in 1907 when George Gunn, John Gunn and Wilfred Payton were also prominent.", "Between the wars Notts enjoyed the services of the famous bowlers Harold Larwood and Bill Voce. Strong batting from George Gunn, Arthur Carr and Dodger Whysall saw them emerge as champions in 1929 after losing the title on the final day of the season in 1927. Prior to the second war, opening batsman Walter Keeton gained Test recognition, though the bowling was less effective.", "* George Gunn 583 (1902-32)", "|George Gunn|| 31,592"]}, {"page": "Sydney Barnes", "response": ["Barnes returned to Test cricket when England toured Australia in 1907–08. This time, he played in all five Tests and took 24 wickets at 26.08 with a best performance of seven for 60. In the second Test, which England won by 1 wicket, it was Barnes' batting that was crucial as he shared stands of 34 for the ninth wicket with Joe Humphries and an unbeaten 39 for the last with Arthur Fielder.Arlott, Arlott on Cricket, p. 18. When the tourists played Western Australia, Barnes shared a stand with George Gunn of over 200 for the fifth wicket while scoring 93, his personal best in first-class cricket.Arlott, Arlott on Cricket, p. 19."]}, {"page": "List of International cricket families", "response": ["*George Gunn"]}, {"page": "Harry Trott", "response": ["To aid his convalescence, the Postmaster-General's Department—Trott's employer—transferred him to the post office at Bendigo in central Victoria.Perry, p. 75. In 1902–03, he turned up uninvited to a Bendigo United Cricket Club practice session and asked to join in.  He played five first-class matches during 1903–04, scoring 268 runs at an average of 26.80 and taking 13 wickets at 23.53 runs each. In his final appearance of the season, he led Victoria against Plum Warner's touring English team.  He captained the Carlton club for two seasons, before spending two seasons with Fitzroy. During the 1907–08 season, he led XVIII of Bendigo against the touring English team and made a farewell first-class appearance against the tourists for Victoria. Opening the bowling, Trott returned 5/116, including the wickets of England's leading batsmen Jack Hobbs and George Gunn.  Trott later returned to South Melbourne, where he played until the age of 44. He led the club on a tour of New Zealand in 1912–13 and in the next season (his last) he topped the club's batting and bowling averages, for the fifth time as a batsman and the third time as a bowler."]}, {"page": "William Gunn (cricketer)", "response": ["File:John, Billy and George Gunn c1904.jpg|Left-right: John, Billy and George Gunn c. 1904"]}, {"page": "List of Test cricket triple centuries", "response": ["#  Batting first, in a timeless Test, Sandham shared stands of 173 with George Gunn (85) for the first wicket, 148 with Bob Wyatt (58) for the second wicket, and 249 with Leslie Ames (149) for the fourth wicket, on the way to an England total of 849.  West Indies replied with 286, but England did not enforce the follow-on, setting West Indies a target of 835 to win.  After bad weather prevented any play on the match's eighth day, a draw was agreed with West Indies at 408 for 5, George Headley having scored 223. It was the first triple hundred in Tests.  Sandham was 39 years and 275 days old, and playing his last Test match: he is Test cricket's oldest triple-centurion. He had also scored 50 in the first innings, for a match total of 375 which remained a record until 1974 (GS Chappell, 247* and 133)."]}, {"page": "Joe Hardstaff Sr", "response": ["Hardstaff made his debut during 1902, playing one match against Lancashire scoring 2. He was a central figure in the Notts side until he retired at the end of the 1924 season. He was primarily  a middle-order batsman, though he occasionally bowled medium, especially after the war. Having helped his county to its first County Championship in 1907, he was picked for the tour to Australia in 1907/08, captained by the Nottinghamshire county captain Arthur Jones. Hardstaff was a big success on the tour, scoring more runs in first-class matches than any other batsman, and coming third, behind George Gunn and Jack Hobbs, in the Test matches. His subsequent form precluded further selection for although he passed 1000 runs seven times in England, and once on his sole overseas tour. Apart from 1911, he rarely featured amongst the leading batsmen in the averages. He was selected, surprisingly,Wisden Cricketers Almanack 1911 in 1910, for the Players against the Gentlemen at Lords. He appeared three times in this fixture at the Oval."]}, {"page": "List of Test cricketers", "response": ["George Gunn ·"]}, {"page": "Leslie Hylton", "response": ["During the following years, the Jamaica side played little top-grade cricket, and Hylton's opportunities to shine were very limited. He was not selected for the West Indies side that in early 1930 played a four-Test home series against a weak MCC side led by the Hon. F.S.G. Calthorpe, although he played for Jamaica when they faced the tourists at Melbourne Park in March 1930. His opponents in this match included the England Test veterans Wilfred Rhodes and George Gunn, as well as emergent players such as Les Ames and Bill Voce.  Hylton was also overlooked when the West Indies party to tour Australia in 1930–31 was chosen, likewise when the team to visit England in 1933 was selected. Between March 1928 and January 1935 he played in just five first-class matches. In one of these, against Sir Julien Cahn's XI at Melbourne Park in February 1929, he recorded his career-best bowling figures of 5 for 24. Cahn's XI included several current and past Test players."]}, {"page": "Leslie Townsend (cricketer)", "response": ["Townsend was born at Long Eaton, Derbyshire. He did not play cricket in his youth and was only attracted to the game by watching Nottinghamshire's star batsman George Gunn. Townsend first played for his native county Derbyshire in the 1922 season and obtained a regular place in the 1924 season."]}, {"page": "John Gunn (cricketer)", "response": ["thumb|left|upright=1.3|Left-right: John, Billy and George Gunn c. 1904"]}, {"page": "Fred Barratt", "response": ["This fallow period in the mid 1920s made his emergence as a genuine all-rounder in the 1928 season, his benefit year, all the more surprising. In all matches, he took 114 wickets at a cost of 25.18 runs each and, unexpectedly, made 1167 runs at an average of 29.17, not far short of double the average and more than double the aggregate he had achieved in any other season before. Wisden had an explanation for his sudden advance: it attributed it to \"waiting more patiently than heretofore for the right ball to hit\". It added that he \"gave some remarkable displays of high speed scoring which never degenerated into mere slogging\". The 1928 season saw the only two centuries of Barratt's career. The first, an unbeaten 139 which remained his highest score, came in a high-scoring match on an easy pitch with short boundaries at Coventry, and set some records. Nottinghamshire's total of 656 for three declared was the highest at the time for the loss of only three wickets, and four of the five batsmen used – George Gunn, Whysall, Willis Walker and Barratt – made hundreds. Barratt, unusually promoted to No 5, and Walker put on 196 in 84 minutes and Barratt's 139 included seven sixes and 18 fours in what Wisden termed \"a remarkable display of powerful driving\". The vast total was not a match-winner: Warwickshire batted across the rest of the second day after Nottinghamshire's declaration, and then rain prevented any play on the third and final day, so that there was no decision even on first innings."]}, {"page": "Walter Keeton", "response": ["Keeton made his debut for Nottinghamshire's second eleven in 1925 and the following year made his first-team debut, playing in two County Championship matches as a lower middle-order batsman. The Nottinghamshire side of the late 1920s was a settled and successful unit under the captaincy of Arthur Carr, with apparently ageless batsmen such as George Gunn, Wilfred Payton and the slightly younger William Whysall, Willis Walker and Carr himself dominating the batting line-up. Keeton and other young batsmen such as Charles Harris and George Gunn junior were given few first-team opportunities, and Keeton played in just five games in 1928 and two in the Championship-winning season of 1929 – one of those two was against Oxford University – and none at all in both 1927 and 1930.", "By the end of the 1933 season, according to Wisden Cricketers' Almanack, Keeton had \"firmly established himself as the best batsman in the team\". The Wisden report went on: \"To those who followed the team he recalled memories of the County's greatest batsmen. Though scarcely comparable in method to the giants of the past because of the changed type of most bowlers met in these days, Keeton developed the highest art in defence and run-getting. Possessed of all the strokes, he was especially strong in such attractive features in a batsman's make-up as cutting and off-driving... Keeton, if slow to mature, found himself at the age of 28 in his third full season with the County, mentioned with William Gunn, George Gunn and Arthur Shrewsbury.\" He scored more than 1000 runs in August 1933 alone, with six centuries in the month, including four in five innings. But again his representative cricket was confined to a few end-of-season matches of doubtful seriousness."]}, {"page": "Joe Hardstaff Jr", "response": ["He remained a colossus on the county circuit, stroking 2,396 runs at 64.75 in 1947, but retired with just twenty three tests to his name, having scored 1,636 at an average of 46.74. He headed the national averages in 1949 with 2,251 runs at 72.61. The press clamoured for his reinstatement in the national side, but Allen's influence held sway. On Hardstaff's retirement in 1955, he had almost 32,000 runs under his belt at 44.35, one of the highest scoring Nottinghamshire batsman in history, with a century against every county except his own. He recorded eighty three centuries, with ten double hundreds, and passed a thousand runs in a season thirteen times. In addition to three MCC tours to Australia, and one to the West Indies, he also played two seasons of first-class cricket in New Zealand after the war. He was also a fine, athletic outfielder, and took 36 wickets with his eccentric medium pace. (The highest scoring Nottinghamshire batsman was George Gunn who scored 35,208 runs.)"]}, {"page": "Leslie Walcott", "response": ["In January 1930 he scored 73 not out against the MCC and was selected to play shortly afterwards in the first Test played at home by the West Indies, against England at Bridgetown. He made 24 and 16 not out and took the wicket of George Gunn.West Indies v England, Bridgetown 1929-30 He was one of four players omitted for the Second Test, and played no further Test cricket."]}, {"page": "Australian Imperial Force Touring XI", "response": ["The Australians must have been pleased to play Nottinghamshire (Notts) over three days at Trent Bridge but the match was drawn. They batted first and made 371 featuring another fine innings by Willis with 130, but Notts and George Gunn trumped them with 391 and 131 respectively, batting into the third morning. Collins scored 118 and declared the second innings at 242 for five but this only left time for 25 overs and Notts played out to 62 for one. Collins completed his 1,000 runs for the season in this match."]}, {"page": "Bradford Premier League", "response": ["* George Gunn (England)"]}, {"page": "Cecil Ponsonby", "response": ["He was to play only one more first-class match, against Nottinghamshire in late August 1928. This was a chastening year for Worcestershire: in 30 County Championship matches they won not a single game, and against a Nottinghamshire side containing Larwood, Voce and Staples they were thrashed by an innings and 21 runs. Ponsonby made a pair, but he did manage one final dismissal when he caught Notts' opener George Gunn off the bowling of Charles Tarbox."]}, {"page": "Jack Bowles", "response": ["Born in Lower Slaughter, Gloucestershire, Bowles made his first-class debut for that county in late July 1911 against Nottinghamshire, and took two wickets, his first being that of Notts' opener George Gunn. He played another two matches in 1911, but had little success, taking only one more wicket. For the next three seasons he played only occasionally, and the same was the case when cricket resumed after the First World War in 1919; never did he play more than four games in a summer, and never did he take more than six wickets. His best bowling for Gloucestershire was the 3-47 he took against Lancashire in 1919."]}, {"page": "1919 English cricket season", "response": ["Jack Hobbs was the leading run-scorer in first-class cricket during the season, amassing 2,594 runs at an average of 60.32 during 30 matches for Surrey and the Players. He was the only batsman to exceed 2,000 runs in the year, and was one of 31 to score 1,000 runs or more. Two of those, George Gunn and Patsy Hendren finished the year with a superior batting average to Hobbs; Gunn scored his 1,451 runs at 63.08, while Hendren's 1,655 runs came at 61.29."]}, {"page": "1913 English cricket season", "response": ["*Wisden - Major Booth, George Gunn, Bill Hitch, Albert Relf, Lionel Tennyson"]}, {"page": "English cricket team in the West Indies in 1929–30", "response": ["* George Gunn"]}, {"page": "Lists of oldest cricketers", "response": ["| George Gunn || England || 13 June 1879 || 13 December 1907 || 12 April 1930 ||  "]}, {"page": "Ernest Stapleton", "response": ["Stapleton died in Nottingham. His brothers-in-law, John and George Gunn played Test cricket for England, while his nephew, also named George Gunn played for Nottinghamshire for 22 years."]}, {"page": "English cricket team in Australia in 1907–08", "response": ["George Gunn, in Australia for the good of his health, was called into the touring party to bolster the batting and was a great success, scoring two hundreds including one on his Test debut, and scoring 462 runs at an average of 51.33. Nevertheless, England’s batting was fragile throughout the series, with only Kenneth Hutchings scoring a hundred in addition to Gunn. Jack Hobbs made his England debut in the second Test, the only one which England won, scoring 83 and 28, and he had the next best average to Gunn. The bowling relied on Jack Crawford, Arthur Fielder and Sydney Barnes, who took 79 wickets between them."]}, {"page": "William Heymann", "response": ["Heymann made a single first-class appearance, during the 1905 season, against Middlesex. As a lower order batsman, Heymann did not bat during the match, the team declaring their only innings after centuries from Arthur Jones and George Gunn. He bowled 23 overs during the match, taking two wickets."]}, {"page": "List of tied first-class cricket matches", "response": ["George Gunn 48", "George Gunn 3/49"]}, {"page": "MCC tour of Australia in 1962–63", "response": ["On to the Adelaide Oval, or rather not as the SACA ringed off the famously long curves, much to the disappointment of those who liked seeing all-run fives when batsmen hit a straight-drive. South Australia had not won the Sheffield Shield for ten years, but were to do so again in 1963-64 with the help of their multi-talented import Gary Sobers. They were captained by the old favourite Les Favell and had a 19-year-old Ian Chappell in the team, but their slow left-arm wrist-spin bowler David Sincock was unable to play because of his exams. The Melbourne Cup was due to be played during the match, so Ted Dexter and the Duke were off to the races and Colin Cowdrey was in charge. Favell won the toss, batted, and saw his side make steady progress to 324/7 by the end of the day. Favell was first out for 7 and his fellow-opener John Causby was run out by Ken Barrington and wicket-keeper Alan Smith for 16, but John Lill (87) and Gary Sobers (42) stroked their way to a third-wicket stand of 113 before they were both out on 154, along with Neil Dansie for a duck and South Australia were 154/4. Ian McLachlan (53) and Ian Chappell (36) added 66 before the youngster tripped over himself while hooking Brian Statham and hit the wicket with his bat. Statham (4/58) cleared up the tail with 3 wickets for 11 runs and South Australia were out for 335. Fred Titmus (1/80) and Ray Illingworth (0/43) failed to turn the ball on the notoriously flat wicket and Cowdrey set up defensive fields which rather relied on the batsmen getting themselves out, still the runs flowed enough and the crowd enjoyed themselves. Cowdrey was out for this third consecutive duck when acting as opener, but everybody else had a fine time; Geoff Pullar (21) added 55 for the second-wicket with Ken Barrington (102), who added another 168 with the stylish Tom Graveney (99), beating the third-wicket record for the MCC vs South Australia set by Plum Warner and George Gunn in 1911-12. Graveney was the more polished of the two, but Barrington hit Neil Hawke (6/130) for 4 boundaries in five balls. They and Peter Parfitt (15) were all out by 257/5, but the depth of the MCC batting was shown by Fred Titmus who hit a solid 137 not out, his highest first class century, adding 108 runs with Barry Knight (55) and 121 with wicket-keeper Alan Smith (another 55) and Cowdrey declared on 508/9. South Australia knocked off the 173 run deficit the same day, making 174/5 by stumps, with Sobers (99) run out by Statham going for his 100th run and everybody else chipping in. A shower of rain allowed everybody to get off the field to watch the Melbourne Cup and Favell declared on 283/7 to leave the MCC 67 minutes to make 111 runs. They made 95/1, thanks to some quick hitting by Pullar (56), but after playing into more rain they gave up 16 runs short in an affable, but farcical end. On a flat wicket with indifferent bowling the teams made 1,221 runs in four days despite the rain.pp12-17, Moyes and Goodman"]}, {"page": "Charles Harris (cricketer)", "response": ["In 1934 Harris scored a personal best 1,891 runs and the following year, despite not scoring a century, was dismissed only eight times for single figuresBrookes, Wilfred H. (editor); John Wisden's Cricketer's Almanac; Seventy-Third Edition (1936); p. 188) and consequently beat George Ulyett’s long-standing 1883 record for the most runs in a season without reaching 100, scoring 1,709 with a highest score of 92. (This record has since been beaten by David Green in 1965). By this time it was said that Harris could play in a style somewhat similar to his predecessor George Gunn, whereby he would defend as a stonewaller for lengthy periods and then hit boundaries in rapid succession."]}, {"page": "Early life of Jack Hobbs", "response": ["Having overcome initial reservations about leaving his wife and newly-born son, Hobbs accepted the invitation but throughout the voyage to Australia was severely affected by sea-sickness,McKinstry, pp. 76–77. a condition which was to afflict him throughout his life. To allow him to recover from his illness upon arrival in Australia, Hobbs missed the first two games of the tour, but once recovered, he played in only two of the remaining four fixtures before the Test series began. Hobbs later expressed the belief that the MCC captain, Arthur Jones was instrumental in his omission from the team as he did not rate Hobbs a good player. He also believed that Jones did not give him a chance to prove himself. But Hobbs failed with the bat on his two appearances and was subsequently left out of the team for the first Test match.McKinstry, p. 78. Even when Jones was taken ill before the game started, George Gunn, not a member of the touring team but present in Australia, was preferred to Hobbs and scored a century in the game. However, England lost the game and the performance of the amateur wicketkeeper and makeshift opening batsman Dick Young was singled out as detrimental to the team. Following effective batting performances by Hobbs in two matches after the Test, Frederick Fane, the stand-in England captain, chose Hobbs to open the batting in the second Test.McKinstry, pp. 79–80. He made his Test debut on 1 January 1908 at Melbourne.McKinstry, p. 80. He went in to bat on the second day after Australia had scored 266; in 182 minutes, he scored 83 runs in his first innings and although he batted more slowly than usual, critics praised his defence.McKinstry, p. 81. Eventually, England needed 282 to win. Hobbs and Fane added 54 for the first wicket;McKinstry, p. 82. before Hobbs fell for 28 but England went on to win the match by one wicket."]}, {"page": "George Gunn Jr. (cricketer)", "response": ["He was born in West Bridgford, Nottinghamshire in 1905. His father, George Gunn, and an uncle, John Gunn, played cricket for Nottinghamshire and England. Another uncle, Ernest Stapleton, played once for Derbyshire. He was generally known in his cricket career as George Gunn Jr or by his initials as G. V. Gunn. "]}, {"page": "George Gunn", "response": ["George Gunn may refer to:", "*George Gunn (Canadian politician) (1833–1901?), politician in Manitoba, Canada", "*George Gunn (cricketer) (1879–1958), English cricketer", "*George Gunn Jr. (cricketer) (1905–1957), English cricketer, son of the above", "*George Gunn, New Zealand landowner for whom Lake Gunn is named"]}]}}