{"wiki_id": "http://www.wikidata.org/entity/Q3526191", "itemLabel": "M. J. K. Smith", "itemDescription": "English rugby union footballer and cricketer (born 1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/M._J._K._Smith", "wikipedia_page": {"main": "Michael John Knight Smith OBE, better known as M. J. K. Smith or Mike Smith (born 30 June 1933) is an English former cricketer who was captain of Oxford University Cricket Club (1956), Warwickshire County Cricket Club (1957–67) and the England cricket team (1963–66). He was one of England's most popular cricket captains and, as he also played rugby union, Smith was England's last double international.", "link_mentions": [{"page": "Colin Dexter", "response": ["Dexter was born in Stamford, Lincolnshire, to Alfred and Dorothy Dexter. He had an elder brother, John, a fellow classicist, who taught Classics at The King's School, Peterborough, and a sister, Avril. Alfred ran a small garage and taxi company from premises in Scotgate, Stamford. Dexter was educated at St. John's Infants School, Bluecoat Junior School, from which he gained a scholarship to Stamford School, a boys' public school, where one of his contemporaries was the England international cricket captain and England international rugby player M. J. K. Smith."]}, {"page": "June 30", "response": ["*  1933   – M. J. K. Smith, English cricketer and rugby player"]}, {"page": "University of Oxford", "response": ["Rowers from Oxford who have won gold at the Olympics or World Championships include Michael Blomquist, Ed Coode, Chris Davidge, Hugh Edwards, Jason Flickinger, Tim Foster, Luka Grubor, Christopher Liwski, Matthew Pinsent, Pete Reed, Jonny Searle, Andrew Triggs Hodge, Jake Wetzel, Michael Wherley, and Barney Williams. Many Oxford graduates have also risen to the highest echelon in cricket: Harry Altham, Bernard Bosanquet (inventor of the googly), Colin Cowdrey, Gerry Crutchley, Jamie Dalrymple, Martin Donnelly, R. E. Foster (the only man to captain England at both cricket and football), C. B. Fry, George Harris (also served in the House of Lords), Douglas Jardine, Malcolm Jardine, Imran Khan (later served as the Prime Minister of Pakistan), Sophie Le Marchand, Alan Melville, Iftikhar Ali Khan Pataudi, Mansoor Ali Khan Pataudi, M. J. K. Smith, and Pelham Warner."]}, {"page": "Stamford, Lincolnshire", "response": ["*M. J. K. Smith (born 1933), captain of England cricket team and last English double international (cricket and rugby), attended Stamford School."]}, {"page": "Ted Dexter", "response": ["Dexter declared himself unavailable for the 1964–65 tour of South Africa as he contested Jim Callaghan's Cardiff South East seat for the Conservative Party in the 1964 General Election. Finding himself free to tour after his defeat he was made vice-captain to M. J. K. Smith, who won the series and continued as captain. His cricket career was virtually ended by an accident in 1965. His Jaguar car ran out of petrol in west London, and he was pushing it to safety when it pinned him to a warehouse door, breaking his leg. He left Sussex and played occasional Sunday games with the International Cavaliers, and made 104 when they defeated the 1966 West Indians by 7 wickets. He returned briefly in 1968, making 203 not out in his comeback match against Kent, but failing in the 1968 Ashes series. He played Sunday League games for Sussex in 1971 and 1972."]}, {"page": "Wisden Cricketers of the Year", "response": ["|  M. J. K. Smith"]}, {"page": "Warwickshire County Cricket Club", "response": ["|1957–1967|| M. J. K. Smith", "*    M. J. K. Smith", "| Most runs in season || 2417 || M. J. K. Smith ||colspan=3| 1959"]}, {"page": "Michael Smith", "response": ["*M. J. K. Smith (born 1933), English cricketer and rugby union player"]}, {"page": "Bill Lawry", "response": ["When Australia batted, Lawry, their stumbling-block-extraordinary, took root, and in an interminable left-handed stand with Cowper effectively droused English prospects. When this relentless fellow, having reached his sixth Test hundred against England, at length took a liberty he had made 592 runs in the Tests, average 84, the highest aggregate since Bradman's in 1946–47: not only that, he had scored 979 against M. J. K. Smith's side since they landed in Perth, and had occupied the crease for forty-one and a half hours. There was a gayer side to Lawry as we had seen at Adelaide—but he didn't let it obtrude too often. He just kept that long, sharp nose religiously over the ball, accumulating at his own deliberate gait, and in particular tucking everything away off his pads whenever the English bowlers bowled there, as all too often they did.pp. 141–142, E. W. Swanton, Swanton in Australia with MCC 1946–1975, Fontana/Collins, 1975"]}, {"page": "List of Test cricket hat-tricks", "response": ["* M. J. K. Smith (c John Waite)"]}, {"page": "Hit wicket", "response": ["In Warwickshire's County Championship match against Hampshire at Edgbaston in 1962, M. J. K. Smith was dismissed when a gust of wind blew his cap on to his wicket."]}, {"page": "List of England cricket captains", "response": ["| rowspan=8 | M. J. K. Smith"]}, {"page": "MJK Smith", "response": ["#redirectM. J. K. Smith"]}]}}