{"wiki_id": "http://www.wikidata.org/entity/Q3524482", "itemLabel": "Billy Godleman", "itemDescription": "Cricket player of England (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Godleman", "wikipedia_page": {"main": "Billy Ashley Godleman (born 11 February 1989) is an English first-class cricketer who plays for Derbyshire and is the team captain. He is a left-handed batsman and a right-arm leg-spin bowler. He played for Middlesex and Essex before joining Derbyshire in 2013. Godleman has previously represented the England under-19 team.", "link_mentions": [{"page": "Middlesex County Cricket Club in 2005", "response": ["*  Billy Godleman"]}, {"page": "Derbyshire County Cricket Club", "response": ["|style=\"text-align:center\"|1|| Billy Godleman* ||  ||  || Left-handed || Right-arm leg break || Club captain"]}, {"page": "NBC Denis Compton Award", "response": ["*Middlesex – Billy Godleman", "*Middlesex – Billy Godleman"]}, {"page": "City of London Academy Islington", "response": ["* Billy Godleman, cricketer"]}, {"page": "List of Derbyshire first-class cricket records", "response": ["| 1st || 333 ||  Luis Reece Billy Godleman || v Northamptonshire || Derby || 2017"]}, {"page": "James Taylor (cricketer, born 1990)", "response": ["Taylor was first selected for the England Under-19 cricket team whilst at Worcestershire as part of the performance program in September 2007 to play one-day matches against second XI teams. Taylor top-scored with 65 not out in a victory for England against Gloucestershire second XI. He was then selected in a tri-nations U-19 series against Pakistan and Sri Lanka. England missed out on reaching the final, which was eventually won by Pakistan, Taylor hit his highest score of 43 against Sri Lanka in an English defeat. In February 2008 Taylor was selected to participate in the 2008 ICC Under-19 Cricket World Cup, held in Malaysia. Despite a poor campaign by England, Taylor scored 200 runs in the series with a top score of 52 not out against Ireland U-19 in a 10-wicket victory, opening with Billy Godleman. In July 2008, Taylor was chosen again to face New Zealand U-19 in five one day matches. As well as being chosen to play in the 2009 England U-19 tour of South Africa. England played two Youth Test matches, five one-day matches and two T20 Youth matches. England were defeated in all three genres of the game. Taylor did however secure a win for England in the third ODI as he scored 85 to claw England a way back into the series at 1–2."]}, {"page": "2008 Twenty20 Cup Finals Day", "response": ["The Crusaders got off to a steady start with openers Billy Godleman and Ed Joyce, as they began to eke into the target. They had almost reached halfway by the time the first wicket fell. It was almost like London buses in that Middlesex went from 65 without loss, to 65 for 2 with the loss of Godleman for 20 and Joyce for 41. But no more wickets were to fall as an unbeaten partnership of 76 between Owais Shah and Tyron Henderson allowed the Crusaders to advance. Henderson kept much of the strike, hitting a quite superb unbeaten 59 off only 21 balls, including 7 sixes, of which 3 came in the one over. This earned him man of the match, and earned the Crusaders a spot in the Twenty20 Champions League."]}, {"page": "2008 Twenty20 Cup knockout stage", "response": ["Middlesex sealed their place in Finals Day, after a 12-run win at their \"home\" for one game, The Oval. This was of course down to their normal home of Lord's being used for the First Test against South Africa beginning 10 July. Middlesex made an uncertain start, losing openers Billy Godleman and Owais Shah with only two runs on the board. Things got worse and at one point, the Crusaders were 21 for 4. Coming in at number 6, was Dawid Malan who would go on to record the 24th century in the history of the tournament. Lasting 56 minutes, he scored 103 off 54, and helped to lift the total to 176 for 7 after their 20 overs. This performance also gave Malan man of the match. Only Eoin Morgan and Tyron Henderson would also reach double-figures as Andrew Flintoff was pick of the bowlers, taking 3-17 off his four overs."]}, {"page": "2008 Stanford Super Series", "response": ["Billy Godleman"]}, {"page": "Wayne Madsen (sportsperson)", "response": ["Hailing from a strong cricketing family, with uncles Henry Fotheringham, Michael Madsen, Trevor Madsen and cousin Greg Fotheringham all playing first-class cricket in South Africa, Madsen made his debut in 2003 for KwaZulu-Natal cricket team. In August 2009 he signed his contract with Derbyshire, following a strong run of form with two centuries in four games. He captained Derbyshire for four seasons; in the 2012 season, Derbyshire were promoted from County Championship Division Two to Division One. They were relegated the following season, and Madsen was named the Championship's Player of the Season. After gaining UK citizenship in February 2015, Madsen announced that he hoped to represent England in the future. Ahead of the 2016 season, he signed a contract extension until 2019. He also stepped down as Derbyshire's County Championship captain, and was replaced by Billy Godleman. In the 2017 t20 Blast, Madsen scored 526 runs, a record for a Derbyshire player in the competition. Madsen later signed a contract extension with Derbyshire until 2022."]}, {"page": "Michael Swart", "response": ["In February 2011 Swart was dropped from the Warriors squad after being charged with assaulting an opponent,Warriors give kids a go – The West Australian. Yahoo! News (9 February 2011). Retrieved 2011-02-23. Billy Godleman, in a grade cricket match between Joondalup and Bayswater-Morley. He was later found guilty by the WACA tribunal and suspended for three matches, with the tribunal rejecting his defence that he was only acting in self-defence.Banned Swart 'hung out to dry' by Warriors – The West Australian. Yahoo! News (19 February 2011). Retrieved 2011-02-23. The following week the conviction and suspension was overturned upon appeal.Swart's Warriors reprieve after ban lifted"]}, {"page": "British Asian Cup", "response": ["The match attracted a crowd of 20,000 people and was a day/night event. The match was scheduled to start at 4:21 GMT, but it started raining heavily and the play was stopped. However the rain stopped at 4:25 GMT and the toss took place. The Panthers won the toss and decided to bowl first. Fazal and Swapnil Asnodkar opened for the Royals and Gareth Berg bowled the first over. Murali Karthik came to the attack in the seventh over. In the first ball of the over, a shot by Ashnodkar was deflected by the wicket-keeper's helmet, and the Royals got five penalty runs. In the same over, Fazal and Asnodkar reached to a 50 runs partnership in 38 balls. However Karthik took the wicket of Fazal in the fifth ball. Fazal tried to hit play the ball towards extra cover, but it went high in the air and Billy Godleman took the catch. Fazal went out making 27 runs off 22 balls, hitting two sixes. Karthik slowed down the run rate, and no boundary was hit in the next six overs. Kaif and Ashnodkar added 50 runs in 45 balls for the second wicket, but Ashnodkar got dismissed in the very next ball. Dawid Malan bowled a full toss and Ashnodkar hit it towards deep mid-wicket, however Shah took  \"well judged\" catch. Ashnodkar made 41 runs off 40 balls. In the next over, Eoin Morgan dropped Naman Ojha on Shaun Udal. However Ojha got caught by Steven Finn on the next ball. Ojha made 10 run off 5 balls. In the next over, Malan bowled Justin Langer, who scored one run in two balls. The next over, bowled by Henderson, came out to be the most expensive over of the innings; 15 runs were scored in the over. Mascarenhas hit a four and a six, and the Royals reached to 145 runs. The next over was bowled by Berg, who gave seven runs. In the last ball of the innings, Kaif got ran out on 41 runs. The Royals scored 162 runs at a loss of five wickets in 20 overs. Mascarenhas remained not out on 32 runs off 16 balls. Malan took two wickets for the Panthers giving 23 runs.", "| Billy Godleman || b Tanvir || 4 || 7 || 57.14"]}, {"page": "2015 County Championship", "response": ["| align=\"left\"| Billy Godleman"]}, {"page": "2016 County Championship", "response": ["| Billy Godleman"]}, {"page": "Stuart Whittingham", "response": ["Whittingham's first recorded match is for the Sussex U-13 team in June 2007. Other Sussex cricket teams he has also represented are Sussex U-15s and U-17s, the Sussex Academy, and the Sussex Second XI; Whittingham has also played non first class matches for Roffey Cricket Club and Loughborough MCC University Whittingham made two appearances for Scotland U-19s in 2013/14, in warmup matches for the 2014 Under-19 Cricket World Cup, and was named in the squad for the tournament. Whittingham made his first-class cricket debut for Loughborough MCC University against Hampshire in April 2015. His bowling figures were 1/77 and 0/32. Whittingham was awarded a junior professional contract for Sussex for the 2016 English cricket season. He made his first appearance for Sussex in a County Championship match against Derbyshire, taking figures of 2/38. He dismissed Hamish Rutherford and Neil Broom, and also hit Billy Godleman on the helmet."]}]}}