{"wiki_id": "http://www.wikidata.org/entity/Q35243613", "itemLabel": "Philip Jansen", "itemDescription": "BT Group CEO", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Jansen", "wikipedia_page": {"main": "Philip Eric Rene Jansen (born January 1967) is a British businessman, the chief executive officer (CEO) of BT since 1 February 2019, having been CEO of Worldpay since 30 April 2013.", "link_mentions": [{"page": "Jansen (surname)", "response": ["*Philip Jansen (born 1967), British businessman"]}, {"page": "Gavin Patterson", "response": ["On 25 October 2018, it was announced that Philip Jansen, the outgoing CEO of Worldpay, would  succeed him as CEO of BT, with effect from 1 February 2019, as \"a change of leadership was needed\"."]}, {"page": "Dominique Leroy", "response": ["By late 2018, the Financial Times reported that Leroy was one of the candidates for succeeding Gavin Patterson as CEO of the BT Group; the job instead went to Philip Jansen.Nic Fildes and Martin Arnold (September 23, 2018), Worldpay co-chief in talks to head BT Financial Times. In early 2019, she was summoned to meet Belgian Prime Minister Charles Michel after media reported a cost-cutting plan at Proximus that would involve a net headcount reduction of 650 jobs.Alan Charlish (January 10, 2019), Telecoms operator Proximus to cut 650 jobs in 240 mln euro cost-saving plan Reuters."]}, {"page": "Murder of Sarah Everard", "response": ["On 9 October 2021 it was reported that BT chief executive Philip Jansen had outlined plans for Walk Me Home, a phone service designed to protect lone women as they walk home. The service would allow users to be tracked using the Global Positioning System (GPS), and send out alerts to emergency contacts and the police if they did not arrive at their destination when expected. The service would be activated by dialling a number, with 888 proposed as the number users would need to call. The proposal was supported by Home Secretary Priti Patel.{{cite news |title=New 888 phone service to protect women backed by Priti Patel – how will it work? |url=https://www.itv.com/news/2021-10-08/priti-patel-backs-emergency-phone-service-to-protect-women-as-they-walk-home |access-date=10 October 2021 |work=ITV News |date=9 October 2021 }"]}]}}