{"wiki_id": "http://www.wikidata.org/entity/Q3527674", "itemLabel": "Alec Hearne", "itemDescription": "Cricket player of England. (1863-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alec_Hearne", "wikipedia_page": {"main": "Alec Hearne (22 July 1863 – 16 May 1952) was a member of the famous cricketing Hearne family. He played as a professional for Kent County Cricket Club between 1884 and 1906 and made one Test match appearance for England. He was an all-rounder who was named as one of Wisden's five Cricketers of the Year in 1894. His father, George played cricket for Middlesex during the 1860s and brothers George and Frank also played Test cricket, as did his cousin, John Thomas Hearne.", "link_mentions": [{"page": "July 22", "response": ["*1863 – Alec Hearne, English cricketer (d. 1952)"]}, {"page": "1893 in sports", "response": ["* Wisden Five All–Round Cricketers – George Giffen, Alec Hearne, Stanley Jackson, Harry Trott, Ted Wainwright"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Alec Hearne"]}, {"page": "History of Test cricket from 1890 to 1900", "response": ["This match was not considered by anyone at the time to be a Test, but was subsequently elevated to Test match status. The main England winter tour was still ongoing in Australia. As a result, Walter Read's two Test match victories as captain leave him as one of the two with a 100% record while captaining England in more than one Test. The main points of note are that this game Billy Murdoch and JJ Ferris, both of whom had previously played for Australia and had now settled in England, played for the English tourists.  Similarly, Frank Hearne, who had previously played Test cricket for England against South Africa before settling in South Africa, played for South Africa, while his two brothers, Alec Hearne and George Gibbons Hearne, and their cousin, John Thomas Hearne, all played for England."]}, {"page": "List of International cricket families", "response": ["*Alec Hearne"]}, {"page": "Hearne family", "response": ["thumb|Members of the Hearne family from l-r Walter Hearne, Frank Hearne, Alec Hearne, George Gibbons Hearne", "The Hearne family was a notable English cricketing family. Thirteen members of the family played first-class cricket, including five for Kent County Cricket Club and five for Middlesex County Cricket Club. Six played Test cricket: four for England, one for South Africa, and one represented both England and South Africa. Three members of the family were awarded the distinction of being names as Wisden Cricketers of the Year, J.T. Hearne in 1892, Alec Hearne in 1894 and J.W. Hearne in 1912. Other members also made notable contributions to the game.", "* Alec Hearne (1863–1952), son of George Hearne, played for Kent (1884–1906), MCC (1888–1910) and one Test for England (1891/92). He was a leading all-rounder for Kent, retiring as the leading wicket-taker and run-scorer in the history of the club. Wisden Cricketer of the Year in 1894"]}, {"page": "1893 English cricket season", "response": ["*Wisden (Five All-Round Cricketers) – George Giffen, Alec Hearne, Stanley Jackson, Harry Trott, Ted Wainwright "]}, {"page": "List of Test cricketers", "response": ["Alec Hearne ·"]}, {"page": "Frank Chester (umpire)", "response": ["Chester was born in Bushey. An all-rounder, Alec Hearne suggested that he qualify for Worcestershire. Chester played as a left-handed middle-order batsman and a slow left-arm bowler in 55 first-class matches for Worcestershire as a teenager from 1912 to 1914. In 1913, when he was 17 years old, he scored 108 against Somerset to become the youngest player then to score a county century, a record that still stood until the 1950s. During 1913 Chester was summoned to meet Dr W G Grace who wished to congratulate him on a century scored at Lord's that season. He was praised in the 1913 Wisden as the \"youngest professional regularly engaged in first-class cricket ... Very few players in the history of cricket have shown such form at the age of seventeen and a half\". In 1914, he scored his highest first-class score, 178 not out, against Essex."]}, {"page": "George Hearne (cricketer, born 1829)", "response": ["He and his brother Tom headed a famous cricketing dynasty. His sons George Gibbons Hearne, Frank Hearne and Alec Hearne all played Test cricket and for Kent County Cricket Club and his grandson George Alfred Lawrence Hearne played Test cricket for South Africa.Hearne, George Gibbons, Obituaries in 1932, Wisden Cricketers' Almanack, 1933. Retrieved 2017-10-28. He died at Rushey Green in Catford in 1904, aged 75."]}, {"page": "Walter Hearne", "response": ["Hearne took on the role of official scorer for Kent after his retirement, retaining the post for the rest of his life. He scored in each Kent's four County Championship winning sides between 1906 and 1913 and resumed the role after the First World War. He died at Canterbury in Kent in 1925 aged 61, his cousin Alec Hearne taking over the role of scorer.Hearne, Alec, Obituaries in 1952, Wisden Cricketers' Almanack, 1953. Retrieved 2016-04-06."]}, {"page": "1888 English cricket season", "response": ["|Alec Hearne || Kent || 2750 || 786 || 73 || 10.76 || 8/30 || 5 || 1"]}, {"page": "1885 English cricket season", "response": ["|Alec Hearne || Kent || 2574 || 928 || 64 || 14.50 || 8/35 || 4 || 1"]}, {"page": "History of cricket in South Africa to 1918", "response": ["*Frank Hearne, who played for South Africa in this game, had previously played for England. Finally, the game gives the second instance of three brothers playing in the same Test match, as Frank Hearne's brothers, Alec Hearne and George Hearne played for England.  A cousin, John Thomas Hearne also played for the tourists."]}, {"page": "Australian cricket team in England in 1902", "response": ["The tourists won the toss and batted first at the St Lawrence Ground, Canterbury. By the end of the day's play, 21 wickets had fallen, with the Australians 8/1 in their second innings. Noble top scored with 43 in their first innings, before being run out. Colin Blythe took 4/50 and Alec Hearne 3/39. If the Australians had found batting difficult, Kent found it even more so as Trumble, bowling unchanged, returned an analysis of 8/30, at the time the best of his career. James Seymour, batting at number 4, did well to survive, finishing on 26*. Conditions appeared a little easier for batting next day. Trumper made 69 before he was run out. Kent were set 287 to win. At one point they were 138/4, but then they fell away. Saunders took the last five wickets, to finish with figures of 5/43. Trumble had 3/92."]}, {"page": "English cricket team in South Africa in 1891–92", "response": ["*Frank Hearne, who played for South Africa in this game, had previously played for England. Finally, the game gives the second instance of three brothers playing in the same Test match, as Frank Hearne's brothers, Alec Hearne and George Hearne played for England.  A cousin, John Thomas Hearne also played for the tourists."]}, {"page": "William Wallis (cricketer)", "response": ["Wallis made his first and only first-class appearance for Derbyshire in May 1906 against Marylebone Cricket Club. Wallis was bowled out in his first innings on 6 by Walter Mead, and in the second on 11 by Alec Hearne. He was a right-handed batsman, and made one catch in the outfield.William Wallis at Cricket Archive"]}, {"page": "Jack Mason", "response": ["Mason played in the four Kent County Championship winning sides of the years leading up to the First World War and played his final game for the County in 1914. He made one first-class appearance after the war, for LG Robinson's XI against the Australian Imperial Force Touring XI in 1919 at Old Buckenham Hall in Norfolk. In total he played 300 times for Kent, scoring over 15,000 runs and taking 769 wickets. His highest score of 183 came against Somerset at Blackheath while, in 1899, he posted an unbeaten 181 against Nottinghamshire in an unbroken partnership of 321 with Alec Hearne. This partnership, which was the highest in the County's history until 1934, remained a Kent record for the third wicket which stood until 2005.Foot D (2005) Surrey docked eight points for ball tampering, The Guardian, 2005-05-28. Retrieved 2016-04-06.Families of former players receive club caps in ceremony , Kent County Cricket Club, 2015-06-28. Retrieved 2016-04-06. As of February 2018 it remains the sixth highest partnership in Kent's history for any wicket. He scored three successive centuries in 1904 against Yorkshire, Somerset and Essex and appeared 11 times for the Gentlemen against the Players."]}, {"page": "List of people from Beckenham", "response": ["*Alec Hearne (1863–1952), cricketer"]}, {"page": "List of Kent County Cricket Club seasons", "response": ["|align=left|Alec Hearne 473", "|align=left|Alec Hearne 626", "|align=left|Alec Hearne 558", "|align=left|Alec Hearne 63", "|align=left|Alec Hearne 903", "|align=left|Alec Hearne 66"]}, {"page": "East of England cricket team", "response": ["* Alec Hearne (1894)"]}, {"page": "William Foster (cricketer)", "response": ["Foster made a single first-class appearance for Nottinghamshire against the Marylebone Cricket Club at Lord's in 1889.  Nottinghamshire won the toss and elected to bat first, making 176 all out, with Foster being dismissed for a duck by Dick Pougher.  Responding, the Marylebone Cricket Club were dismissed for 106 all out in their first-innings, with Nottinghamshire then dismissed for 86 in their second-innings, with Foster once more dismissed for a duck, this time by Alec Hearne.  Chasing 157 for victory, the Marylebone Cricket Club reached their target with seven wickets in hand.  This was his only major appearance for the county."]}, {"page": "Home Counties cricket team", "response": ["A Home Counties cricket team was a cricket team formed of players who represented counties which were considered a part of England's home counties. The team first appeared in 1862 in a minor match against Southgate Cricket Club. The team later appeared once in first-class cricket in 1899 against The Rest at the Central Recreation Ground, Hastings. The team for their only first-class match consisted of Arthur Turner and Sailor Young of Essex; Alec Hearne and Bill Bradley of Kent; Francis Ford and Andrew Stoddart of Middlesex; Bobby Abel, Tom Hayward and Digby Jephson of Surrey and; Harry Butt and K. S. Ranjitsinhji of Sussex. With the exception of Jephson and Turner, all had played Test cricket for England. Their only appearance in first-class cricket ended as a draw. The team reappeared in the 1940s, playing two minor matches against Lancashire in 1946 and 1948."]}, {"page": "George Vanderspar", "response": ["He made one appearance in first-class cricket for the Marylebone Cricket Club (MCC) against Kent in 1893 at Lord's. He batted once in the match, scoring 7 runs in the MCC's first-innings, before he was dismissed by Alec Hearne. The match ended in a victory for the MCC by an innings and 21 runs."]}, {"page": "Kent County Cricket Club in 1906", "response": ["The side also included Jack Mason, who captained the side in the one game Marsham did not play,Scorecard - Kent v Surrey in 1906, CricketArchive. Retrieved 2016-02-17. and Cuthbert Burnup, both past county captains as well as Arthur Day, who went on to be one of the Cricketers of the Year in 1910Wilde S (2013) op. cit. pp.67-69 (Available online) and Alec Hearne who had been similarly honoured by Wisden in 1894.Wilde S (2013) op. cit. pp.20-22 (Available online) Hearne made his final appearance for Kent during July at the Nevill Ground.First-class matches played by Alec Hearne, CricketArchive. Retrieved 2016-02-17. The main wicket-keeper was Fred Huish, considered to be \"first of a line of exceptional Kent wicket-keepers\".Obituary: Fred Huish, Wisden Cricketers' Almanack 1958. Retrieved 2016-02-17. Woolley and reserve wicket-keeper and batsman Jack Hubble were both awarded their county caps during the season.Three former Kent greats honoured in special presentation, Kent County Cricket Club, 2009-08-02. Retrieved 2016-02-17."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Alec Hearne (1888–1910) : A. Hearne ()"]}, {"page": "List of Mankading incidents in cricket", "response": ["#Ted Tyler by Alec Hearne, Somerset v Kent, Taunton, 1894"]}]}}