{"wiki_id": "http://www.wikidata.org/entity/Q3527135", "itemLabel": "Wayne Larkins", "itemDescription": "English Test and County cricketer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_Larkins", "wikipedia_page": {"main": "Wayne Larkins (born 22 November 1953) is an English former cricketer, who represented Northamptonshire, Durham and Bedfordshire as an opening batsman throughout his career. He was selected to play for England as Graham Gooch's opening partner on tours of Australia and the West Indies. Although a talented player, Larkins is considered as something of an underachiever at the top level. County bowlers such as Jonathan Agnew spoke of being \"Nedded\" when he performed well against them. The cricket correspondent, Colin Bateman, opined, \"Larkins was usually ignored when he should have been selected and selected when he should have been ignored in a career of unfulfilled potential. A destructive opening bat who could demolish any attack if he got going, 'Ned' tired of waiting for England and joined the 1982 rebel tour to South Africa\".", "link_mentions": [{"page": "Ian Botham", "response": ["Botham retired from cricket midway through the 1993 season, his last match being for Durham against the visiting Australians at The Racecourse 17–19 July 1993. Durham batted first and scored 385 for eight declared (Wayne Larkins 151). In his final first-class innings, Botham scored 32. In reply, Australia could only make 221, thanks to Simon Brown who took seven for 70 (Botham none for 21). Being 164 behind, Australia had to follow on and a victory for Durham was possible but centuries by Matthew Hayden and David Boon saved Australia and the match was drawn. Botham's final bowling return was none for 45 from eleven overs. In the final over of the game, Botham also kept wicket, without wearing gloves or pads."]}, {"page": "November 22", "response": ["*1953 – Wayne Larkins, English cricketer and footballer"]}, {"page": "Geoffrey Boycott", "response": ["| style=\"text-align:left\" | Wayne Larkins"]}, {"page": "Northamptonshire County Cricket Club", "response": ["|Wayne Larkins || 20,317", "Subsequently, the club has seen mixed fortunes.  The club has had intermittent success in one-day competitions, but it has still not won the County Championship, although second place was achieved in each of 1957, 1965 and 1976. Nonetheless it has included several famous players qualified for England, including the South African-born batsman Allan Lamb; fast bowler David Larter; the hard hitting opener Colin Milburn, whose career was cut tragically short by an eye injury sustained in a car crash; the reliable batsmen David Steele and Rob Bailey; opening batsman Wayne Larkins; and all-rounders Peter Willey and David Capel.", "* Wayne Larkins"]}, {"page": "Durham County Cricket Club", "response": ["*  Wayne Larkins"]}, {"page": "Jonathan Agnew", "response": ["Agnew won a Whitbread Brewery award at the end of his debut season, an achievement he ascribes to the influence of his county captain, Ray Illingworth:Agnew. Thanks, Johnners, p. 38 he had taken only six first-class wickets at an average of 35. Illingworth was quoted in The Times as saying that Agnew was \"the second fastest bowler\" in England in 1978, behind only Bob Willis. The award afforded him the opportunity to spend a winter in Australia developing his skills, alongside fellow winners Mike Gatting, Wayne Larkins and Chris Tavaré, and to be coached by former England fast bowler, Frank Tyson. All four went on to play Test cricket. On that Australia tour, Agnew played his only youth Test, but made headlines when invited to bowl at the touring England team in the nets:"]}, {"page": "Bob Willis", "response": ["Botham, Geoffrey Boycott, Phil Edmonds, Graham Gooch, David Gower, Hendrick, Wayne Larkins, Geoff Miller, Chris Old, Derek Randall, Bob Taylor (wk) and Willis. England, who had no warm-up games, played their first match against Australia on 9 June at Lord's, whom they \"breezed\" past. Willis took one wicket for 20 runs from his 11 overs, surpassed by Boycott – who would be an unlikely bowling hero during the tournament – who took 2/15. Reduced to chasing 159, England proceeded slowly, with Brearley's 44 coming from 147 balls, and they reached the target at 47.1 overs. Their next game, against Canada, saw the visiting team routed for 45 with Willis taking 4/11 and Man of the Match Old taking 4/8. Boycott and Gooch finished the game within 13.5 overs. England's final Group A match on 16 June saw them defeat Pakistan by 14 runs. Willis hit three fours in his 24 from 37 balls to help England to 165/9, and his one wicket for 37 runs, along with Boycott's 2/14, helped England keep Pakistan from the target."]}, {"page": "Lal Bahadur Shastri Stadium, Hyderabad", "response": ["| 2 || 124 || Wayne Larkins ||  || 126 || 2 ||  || 19 October 1989 || Draw"]}, {"page": "Birmingham and District Premier League", "response": ["* Wayne Larkins Leamington"]}, {"page": "South African rebel tours", "response": ["*Squad: Graham Gooch (captain), Dennis Amiss, Geoffrey Boycott, John Emburey, Mike Hendrick, Geoff Humpage, Alan Knott, Wayne Larkins, John Lever, Chris Old, Arnold Sidebottom, Les Taylor, Derek Underwood, Peter Willey, Bob Woolmer. Graham Dilley had pulled out of the tour before it got underway."]}, {"page": "English cricket team in Australia and New Zealand in 1982–83", "response": ["The England selectors announced their squad on 11 September which flew out to Australia on 13 October. Doug Insole was appointed Tour Manager, with Norman Gifford as his assistant, while Warwickshire physiotherapist Bernard Thomas joined the squad for his eleventh successive tour. Veteran pace bowler Bob Willis was appointed captain. The squad was weakened by the absence of a number of players from the previous Ashes series who had become ineligible for selection; Graham Gooch, Geoff Boycott, John Emburey, Mike Hendrick, Alan Knott, Wayne Larkins, Chris Old, Peter Willey and Bob Woolmer were serving three-year bans from international cricket due to their participation in the rebel tour to South Africa. Somewhat more controversial was the omission of available players like Mike Gatting, Trevor Jesty, Graham Dilley and Phil Edmonds; Gatting and Edmonds had played pivotal roles in Middlesex' county championship success, Gatting scoring over 1600 runs at an average of nearly 59, as well as contributing 21 wickets, and Edmonds taking 80 wickets. With three off-spinners selected in the squad (Hemmings, Marks and Miller), his left-arm orthodox spin would have provided much-needed variety. To bolster their pace stocks, the selectors sprang a surprise by including 21-year-old Jamaican-born Norman Cowans."]}, {"page": "English cricket team in Australia in 1990–91", "response": ["* Wayne Larkins (Northamptonshire)"]}, {"page": "Wardown Park", "response": ["* Highest individual innings: 172 not out by Wayne Larkins for Northamptonshire v Warwickshire, 1983"]}, {"page": "1979 Cricket World Cup squads", "response": ["| Wayne Larkins"]}, {"page": "Vicarage Hill", "response": ["Oxfordshire first used the ground in the 1993 Minor Counties Championship against Wiltshire, playing a single Minor Counties Championship match in their season, with the exception of 1997, when two matches were played there. No Minor Counties Championship match was played there in 1998, but the ground did hold its first MCCA Knockout Trophy matches in that season when Oxfordshire played the Nottinghamshire Cricket Board, Norfolk and Shropshire. The ground held a single Minor Counties Championship match in 1999, before hosting the Kent Cricket Board in an MCCA Knockout Trophy match the following season. The only List A match to be played there was played in the 2001 Cheltenham & Gloucester Trophy between Oxfordshire and Huntingdonshire. Huntingdonshire made 252/5 from their 50 overs, with Wayne Larkins top-scoring with 73. Oxfordshire were dismissed for 175 in their chase to lose the match by 77 runs. Since 2001, the ground has played host to one Minor Counties Championship match each season, as well as several MCCA Knockout Trophy matches since 2000. The ground is home to Challow & Childrey Cricket Club."]}, {"page": "List of Durham List A cricket records", "response": ["| Most runs in a season for Durham || 794 ||  Wayne Larkins || || || 1993"]}, {"page": "Ropery Lane", "response": ["| Wayne Larkins (128 Runs for Durham against Nottinghamshire) in 1993"]}, {"page": "List of Durham County Cricket Club seasons", "response": ["|align=left|Wayne Larkins"]}, {"page": "Sport in Bedfordshire", "response": ["* Wayne Larkins"]}, {"page": "Roxton, Bedfordshire", "response": ["* Wayne Larkins, a former Northamptonshire and England cricketer was born in Roxton."]}, {"page": "List of Northamptonshire List A cricket records", "response": ["|Wayne Larkins|| 9612", "|align=left|1. Wayne Larkins2. David Willey3. David Sales", "|align=left|1. Alan Fordham2. Allan Lamb3. Wayne Larkins"]}, {"page": "List of Northamptonshire County Cricket Club seasons", "response": ["|align=left|Wayne Larkins", "|align=left|Wayne Larkins", "|align=left|Wayne Larkins", "|align=left|Wayne Larkins", "|align=left|Wayne Larkins", "|align=left|Wayne Larkins", "|align=left|Wayne Larkins"]}]}}