{"wiki_id": "http://www.wikidata.org/entity/Q3538569", "itemLabel": "Trevor Burton", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Burton", "wikipedia_page": {"main": "Trevor Burton (born Trevor Ireson; 9 March 1949 in Aston, Birmingham, England) is an English guitarist and is a founding member of The Move.", "link_mentions": [{"page": "Electric Light Orchestra", "response": ["In 1968, Roy Wood — guitarist, vocalist and songwriter of the Move — had an idea to form a new band that would use violins, cellos, string basses, horns and woodwinds to give their music a classical sound, taking rock music in the direction to \"pick up where the Beatles left off\". The orchestral instruments would be the main focus, rather than the guitars. Jeff Lynne, frontman of fellow Birmingham group The Idle Race, was excited by the concept. When Trevor Burton left the Move in February 1969, Lynne was asked by Wood to join, only to say no, as he was still focused on finding success with his band. But in January 1970, when Carl Wayne quit the band, Lynne accepted Wood's second invitation to join, on the condition that they focus their energy on the new project."]}, {"page": "Blind Faith (Blind Faith album)", "response": ["The album was released on vinyl in 1969 on Polydor Records in the UK and Europe, and on Atco Records in the US. Polydor released a compact disc in 1986, adding two previously unreleased tracks, \"Exchange and Mart\" and \"Spending All My Days\", recorded by Ric Grech for an unfinished solo album, supported by George Harrison, Denny Laine, and Trevor Burton."]}, {"page": "The Move", "response": ["The Move were a British rock band of the late 1960s and the early 1970s. They scored nine top 20 UK singles in five years, but were among the most popular British bands not to find any real success in the United States. For most of their career the Move were led by guitarist, singer and songwriter Roy Wood. He wrote all the group's UK singles and, from 1968, also sang lead vocals on many songs. Initially, the band had four main vocalists (Wood, Carl Wayne, Trevor Burton and Chris \"Ace\" Kefford) who divided amongst themselves the lead vocal duties.", "The Move evolved from several mid-1960s Birmingham-based groups, including Carl Wayne & the Vikings, the Nightriders and the Mayfair Set. Their name referred to the move various members of these bands made to form the group. Besides Wood, the Move's original five-piece line-up in 1965 was drummer Bev Bevan, bassist Ace Kefford, vocalist Carl Wayne and guitarist Trevor Burton. The final line-up of 1972 was a trio of Wood, Bevan and Jeff Lynne, all of whom had for two years been working in the parallel project the Electric Light Orchestra. ", "Between 2007 and 2014, Burton and Bevan performed intermittently as \"The Move featuring Bev Bevan and Trevor Burton\".", "The Move were formed in December 1965, and played their debut show at the Belfry, Wishaw, on 23 January 1966. The original intentions of Trevor Burton, Ace Kefford and Roy Wood were to start a group from among Birmingham's best musicians—along similar lines to the Who. The three played together at jam sessions at Birmingham's Cedar Club, and invited Carl Wayne and Bev Bevan to join their new group. After a debut at the Bell Hotel in Stourbridge in January 1966, and further bookings around the Birmingham area, Moody Blues manager Tony Secunda offered to manage them. At the time, the Move mainly played covers of American west coast groups such as the Byrds together with Motown and rock 'n' roll songs. Many of the band's selections for their songs came from the extensive record collection of Danny King, a former bandmate of Burton. Although Carl Wayne handled most of the lead vocals, all the band members shared harmonies, and each was allowed at least one lead vocal per show (and often traded lead vocals within specific songs).Brumbeat: The Move. Retrieved 11 November 2009.", "Both Ace Kefford and Trevor Burton struggled commercially after leaving the Move. Kefford formed his own short-lived group, the Ace Kefford Stand, with Cozy Powell on drums. After this, he pursued a solo career and recorded a solo album in 1968, but it remained un-released until 2003 when it appeared as Ace The Face. Burton played bass with yet another Birmingham group, the Steve Gibbons Band, was one-third of the short-lived band Balls (with Denny Laine and Alan White), and later fronted his own blues group as lead guitarist.", "Former Move guitarist Burton joined the band on occasion during 2006, and joined permanently in 2007 (Wayne had tried to broker a reunion between Bevan and Burton before his death, and was to be involved with the new band). Bates departed in July 2007 to re-join ELO Part II (now renamed the Orchestra) and was replaced with Gordon Healer. The Autumn 2007 tour was billed as \"the Move featuring Trevor Burton and Bev Bevan\".Bev Bevan interview with Johnnie Walker, BBC Radio 2, 20 September 2007", "In 2014, the band toured as the Move with a lineup consisting of Bevan, Burton, Tree, keyboardist/vocalist Abby Brant, and guitarist/vocalist Tony Kelsey. On 2 May 2014, Bev Bevan announced through a Facebook post that the Move had broken up, and that he and Burton would tour separately with groups called \"the Bev Bevan Band\" and \"the Trevor Burton Band\". In December 2014 the Bev Bevan Band completed their \"Stand Up And Rock\" tour, which lasted for almost 50 dates, in conjunction with Bevan's childhood friend Jasper Carrott. Guests on the tour included Trevor Burton, Geoff Turton and Joy Strachan-Brain, alongside Bevan, Kelsey, Tree and Brant.", "*Trevor Burton – guitar, bass, vocals (1965–1969, 2007–2014) (unofficial member 2004–2007)"]}, {"page": "The Idle Race", "response": ["Lynne received an offer to replace Trevor Burton in the Move in February 1969 but declined with hopes of steering The Idle Race to commercial success — and producing the band's second LP for Liberty.", "Meanwhile, Mike Hopkins (guitar) and Dave Walker (vocals) were hired to replace Lynne in the Idle Race. A cover of Mungo Jerry's \"In the Summertime\" on Liberty in 1970 finally got them into the top 10 in Argentina. A cover of Hotlegs' \"Neanderthal Man\" did not fare as well. In 1971 the band produced their final album, Time Is for Regal Zonophone (UK only); despite this, the band collapsed shortly thereafter with the departures of remaining founding members Pritchard and Spencer (who later became comic \"Ollie Spencer\"), along with Hopkins and Walker. Sole-remaining member Greg Masters built another version of the band with guitarists Dave Carroll and Bob Wilson and drummer Bob Lamb; with Steve Gibbons being recruited later as front-man. Ultimately however, this lineup was short-lived and Masters himself departed in February 1972, and was replaced by Bob Griffin; whose tenure in the band was brief and who was replaced by former The Move member Trevor Burton. The Idle Race then, finally, disbanded; with the final lineup becoming the founding lineup of the Steve Gibbons Band.", "*Trevor Burton – bass guitar (1972)", "*Trevor Burton – bass guitar"]}, {"page": "Roy Wood", "response": ["From this and other Birmingham-based groups, was formed The Move, and they quickly entered the UK Singles Chart. Their single \"Night of Fear\" climbed to No. 2 in early 1967. Their third hit, \"Flowers in the Rain\", was the first song played by Tony Blackburn at the launch of BBC Radio 1 on September 30, 1967, and the band evolved over a three-year period. After the departure of The Move's lead singer Carl Wayne, Wood's influence became more prominent. In 1967, Wood (and fellow Move member Trevor Burton) supplied backing vocals on the track, \"You Got Me Floatin'\", on the Jimi Hendrix Experience's album Axis: Bold as Love."]}, {"page": "Jim Capaldi", "response": ["The new band was signed by Island Records and rented a quiet cottage in Aston Tirrold, Berkshire, to write and rehearse new material. The cottage did not remain quiet and had frequent visitors including Eric Burdon, Eric Clapton, and Pete Townshend as well as Trevor Burton (of The Move) amongst many others."]}, {"page": "List of people from Birmingham", "response": ["*Trevor Burton – Musician"]}, {"page": "Pink Fairies", "response": ["Polydor Records commissioned the group to record a single, \"The Snake\" / \"Do It\", and were happy enough with the results to offer the group an album contract. The debut album Never Never Land was released in 1971. It featured live favourites \"Uncle Harry's Last Freakout\" and \"Do It\", but curiously omitted \"The Snake\". An appearance at 1971's Glastonbury Fair led to them being given one side of the Glastonbury Fayre various artists triple album. In July 1971, Twink left to travel to Morocco. The band continued as a three-piece, occasionally augmented by former The Move bassist Trevor Burton on guitar. They released their second album What a Bunch of Sweeties in 1972, which featured some contributions from Burton. On the album's release and with a promotional tour pending Rudolph departed, going on to play on albums for Robert Calvert and Brian Eno. He would eventually replace Lemmy in Hawkwind.", "  bar:Trevor   text:\"Trevor Burton\""]}, {"page": "Steve Gibbons (musician)", "response": ["Gibbons teamed up with guitarist Trevor Burton from The Move in 1969 and, by April of that year, they had formed a new group called Balls, along with singer/guitarist Denny Laine (formerly of the Moody Blues), and Ugly's' drummer Keith Smart. The project was relatively short lived and after recording a solo album, Gibbons left the band in February 1971.", "The first line-up comprised Gibbons together with Dave Carroll and Bob Wilson on guitars, Trevor Burton on bass and Bob Lamb on drums. The new band worked the pub and club circuits until 1975 when they were spotted by Peter Meaden, former manager of The Who. This led to the Steve Gibbons Band joining The Who's management stable and recording their first Polydor album Any Road Up in 1975 (With John Entwistle of The Who playing on a few tracks). This was followed in 1976 by a tour with The Who in the UK, Europe and the United States. Playing the concert arenas, they shared the stage with Little Feat, Lynyrd Skynyrd, Electric Light Orchestra, The J. Geils Band, Rufus, and Nils Lofgren. In 1977 their second album, Rollin' On included their biggest hit single, \"Tulane\", a cover of a Chuck Berry song. The single reached No. 12 in the UK Singles Chart and spent eight weeks in the Top 40. 1977 also saw the release of the live album Caught in the Act.  The band made two further studio albums with Polydor, Down in the Bunker (1978) and Street Parade (1980).Discography, Discogs.com", "Gibbons continues to tour with his band, and is also a member of the hit UK show 'Brum Rocks Live', along with Bev Bevan (The Move, ELO), Trevor Burton (The Move), Danny King, and writer Laurie Hornsby. The show toured the UK, and was produced and promoted by Brian Yeates Associates."]}, {"page": "Carl Wayne", "response": ["In December 1965 he joined the Move, a Birmingham beat supergroup drawn from top local bands. They included three members of the Vikings (bass guitarist Chris 'Ace' Kefford, drummer Bev Bevan and Wayne himself), Trevor Burton (lead guitarist with Danny King and the Mayfair Set), and Roy Wood (lead guitarist with Mike Sheridan and the Nightriders). They enjoyed three years of hits with singles such as \"Night of Fear\", \"I Can Hear The Grass Grow\", \"Flowers in the Rain\", \"Fire Brigade\", and their number one success \"Blackberry Way\". In their early years the Move had a stage act which occasionally saw Wayne taking an axe to television sets, or chainsawing a Cadillac to pieces at the Roundhouse, London, during \"Fire Brigade\", an escapade which resulted in the Soho area being jammed with fire engines, and the group being banned for a while from every theatre venue in the UK."]}, {"page": "Axis: Bold as Love", "response": ["\"You Got Me Floatin'\", a rock song opening with a swirling backwards guitar solo (which is absent on the differently mixed Polydor version of this LP [only available in stereo], which outside France and the UK was the only one available in Europe), opens the second side of the album. Roy Wood and Trevor Burton from the Move, who toured with Hendrix on a package tour through Britain during winter 1967, supplied backing vocals. According to Wood, he and Burton were in the studio next door while the song was being recorded, and Redding came by and asked them if they would like to sing on it. The following track, \"Castles Made of Sand\", is a ballad that also includes a backwards guitar solo. \"She's So Fine\", Redding's contribution to the album as a composer, a very British pop/rock Who-influenced piece, features Redding on lead vocals with help from Mitchell. \"One Rainy Wish\" begins as a ballad waltz but develops a rock feel during the chorus that is in a different time signature from the verses.", "* Trevor Burton – backing vocals on \"You Got Me Floatin'\""]}, {"page": "Richard Tandy", "response": ["Tandy was born on 26 March 1948 in Birmingham and educated at Moseley School, where he first met future bandmate Bev Bevan. Tandy would later be reunited with Bevan in 1968 when he played the harpsichord on The Move's number one chart-topper \"Blackberry Way\" and briefly joined them live playing keyboards, but switched to bass while regular bassist Trevor Burton was sidelined due to a shoulder injury. When Burton was able to play again, Tandy left to join The Uglys."]}, {"page": "Denny Laine", "response": ["In December 1966, after leaving The Moody Blues, Laine formed the Electric String Band, which featured himself on guitar and vocals, Trevor Burton (of the Move) on guitar, Viv Prince (formerly of Pretty Things) on drums, Binky McKenzie on bass guitar, and electrified strings in a format not dissimilar to what Electric Light Orchestra would later achieve. In June 1967, the Electric String Band shared a bill with the Jimi Hendrix Experience and Procol Harum at the Saville Theatre in London. However, they did not achieve national attention, and soon broke up.", "Laine and Burton then went on to join the band Balls, from February 1969 until their break-up in 1971, with both also taking time to play in Ginger Baker's Air Force in 1970.Joynson, Vernon (1995). The Tapestry of Delights . London: Borderline Books. Only one single was issued by Balls, on UK Wizard Records: \"Fight for My Country\" b/w \"Janie, Slow Down\". The top side was re-edited and reissued on UK Wizard, and in the United States on Epic, under the name of Trevor Burton; he and Laine shared lead vocals on the B-side. The single was reissued again as B.L.W. as Live in the Mountains for 'Paladin', a small label distributed by Pye Records. Twelve tracks were recorded for a Balls album, but it has never been released.", "=== With Balls reissued as by Trevor Burton ===", "| 1971 (Trevor Burton)"]}, {"page": "Bev Bevan", "response": ["After the death of Carl Wayne in 2004, the drummer formed Bev Bevan's Move with Phil Tree and former ELO Part II colleagues Phil Bates and Neil Lockwood, to play a set comprising mostly The Move classics on tour. Bates left in July 2007 to re-join ELO Part II, by then renamed to The Orchestra. Bevan was then joined by former Move guitarist Trevor Burton."]}, {"page": "Shazam (album)", "response": ["The \"Blackberry Way\" single hit No. 1 in the UK in 1969. The single's success reinforced bassist/vocalist Trevor Burton's feelings that the band had become too commercial. He quit shortly thereafter and replaced by Rick Price, and the February 1969 American tour was cancelled because of this. The band spent most of 1969 on the cabaret circuit in England, which vocalist Carl Wayne eventually adjusted to but Rick Price and guitarist/vocalist Roy Wood loathed. When a new American tour was launched later that year, it was a financial failure and a logistical farce—due to shoddy planning, the band was forced to race across the country by car (and a U-Haul trailer) to make very few dates. During this time, they loosened up their performance and played at a louder volume, and the relationship between Wood and Wayne - who had always had different personalities and temperaments - was being severely tested.", "*Trevor Burton - bass (prior to leaving the band, which tracks unknown)"]}, {"page": "Move (The Move album)", "response": ["Highly anticipated, the album featured two previously released singles: \"Flowers in the Rain\" and \"Fire Brigade\", both of which reached the top five in the UK Singles Chart. It was the only album by the Move to feature original bassist Chris \"Ace\" Kefford, who left the band shortly after the record was released in spring 1968, as well as being the only one to fully feature rhythm guitarist Trevor Burton, who left during the early sessions for their follow-up Shazam. Move was also the only album by the Move to chart in the UK, reaching number fifteen on the charts during the early summer of that year.", "Unlike the Move's singles, singer Carl Wayne's duty is minimized, singing only lead vocals on \"Walk Upon the Water\", \"Flowers in the Rain\" and \"Useless Information\". He does, however sing harmony vocals on \"Hey Grandma\" and \"Fire Brigade\". Rhythm guitarist Trevor Burton has had his role as a lead singer expanded, and he sings lead on \"Weekend\" and \"The Girl Outside\", while also contributing harmony vocals on \"Kilroy Was Here\", \"(Here We Go Round) the Lemon Tree\", \"Walk Upon the Water\", and \"Cherry Blossom Clinic\". Wood's role has also been maximized, singing lead on \"Mist on a Monday Morning\", while contributing harmony vocals to virtually every other track present. Although heavily present as a singer during live performances, bassist Ace Kefford's role as a singer is confined to two songs, \"Yellow Rainbow\" (sung with the song's author Wood), and \"Zing! Went the Strings of My Heart\", which he sings with drummer Bev Bevan, in one of only two lead vocals the latter sang with the Move.", "* Trevor Burton – guitars, vocals"]}, {"page": "Boulders (album)", "response": ["Wood displays his banjo-playing on \"When Gran'ma Plays the Banjo\", a rodeo-style country song about a grandmother whose banjo skills impress local cowboys. Short solos on the instrument throughout the song are followed by rapturous applause. The closing medley starts in a country and western vein but develops into a \"late 50s rock anthology\", with Wood's impersonations of Elvis Presley on the \"Rockin' Shoes\" section and the Everly Brothers on the \"She's Too Good for Me\" section comparable to the vintage American pop influences Wood explored with Wizzard. The musician had previously attempted recording \"She's Too Good for Me\" in 1968 with Move bandmate Trevor Burton, before re-recording the song entirely himself for Boulders. These early attempts were released on The Move's Movements box set in 1997 and on Anthology 1966–1972 in 2009."]}, {"page": "Blackberry Way", "response": ["The Move vocalist Carl Wayne refused to sing on the song, so Wood handled the lead vocal. Richard Tandy, who later played keyboards with Wood's next band Electric Light Orchestra (ELO), played harpsichord on \"Blackberry Way\". Despite the success of the single, the style of psychedelia-tinged pop sat uneasily with guitarist Trevor Burton. He left the group shortly after.", "*Trevor Burton – bass, backing vocal"]}, {"page": "Guts (John Cale album)", "response": ["* Trevor Burton − bass"]}, {"page": "Rollin' On", "response": ["*Trevor Burton - bass, guitar, vocals"]}, {"page": "Curly (song)", "response": ["The song peaked at number 12 in the UK Singles Chart, and was the last single by the band to feature Carl Wayne before his departure, as well as the first with Rick Price replacing Trevor Burton on bass guitar.  The instrumentation is mainly acoustic, and Roy Wood was featured on multi-tracked recorder as well as acoustic guitar and short a cappella harmonies, with the sole electric instrument, a mellotron, appearing only briefly."]}, {"page": "Wild Tiger Woman", "response": ["\"Wild Tiger Woman\" was much heavier than the band's earlier singles, bearing the unmistakable influence of Jimi Hendrix, whom the group greatly admired and had often played on the same bill with. Wood and rhythm / bass guitarist Trevor Burton had sung backing vocals on the track \"You've Got Me Floating\" from The Jimi Hendrix Experience's album Axis: Bold as Love. For the \"Wild Tiger Woman\" session, musician Nicky Hopkins played piano. According to Wood, producer Denny Cordell was not present for the mixing of the track and so it was handled by the band themselves and the engineer, which he felt resulted in an inferior mix.", "* Trevor Burton – lead, harmony and backing vocals, bass guitar"]}, {"page": "Fire Brigade (song)", "response": ["* Trevor Burton – guitars"]}, {"page": "Flowers in the Rain", "response": ["* Trevor Burton – guitars"]}, {"page": "I Can Hear the Grass Grow", "response": ["On 9 December 1966, the Move released their debut single \"Night of Fear\" to great commercial success, reaching number 2 in the UK singles charts on 26 January 1967. The hints of psychedelia in the song led to rumours about the band using LSD or other hallucinogenic drugs, something that drummer Bev Bevan later denounced. Both rhythm guitarist Trevor Burton and bassist Ace Kefford would later admit to using drugs, the latter of which considered it a grave mistake. The newfound success led to songwriter and lead guitarist Roy Wood to believe in himself as a true songwriter, as \"Night of Fear\" was only the third or fourth original composition that he had written.", "* Trevor Burton – harmony and backing vocals, rhythm guitar"]}, {"page": "Night of Fear", "response": ["At one point, Wood wanted that its B-side \"Disturbance\" would be the Move's first A-side, but \"Night of Fear\" was eventually chosen as it was deemed to be more commercial. Despite being an upbeat tune, the lyrics of \"Night of Fear\" revolve around supernatural occurrences, such as moving shadows in a hallway, along with shifting pictures in a bedroom and as such, the lyrics allude to the narrator being on an hallucinogenic substance, most likely LSD or Cannabis. \"Disturbance\" on the other hand, bases its lyrics on the psychologically disturbed mind of the narrator. The song features all four of the Move's vocalists: Carl Wayne, Trevor Burton, Ace Kefford and Roy Wood in four-part harmony, primarily featuring Wayne and Wood with Kefford singing the chorus \"Just about to flip your mind, just about to trip your mind\".", "* Trevor Burton – rhythm guitar, harmony and backing vocals"]}, {"page": "Ace Kefford", "response": ["Christopher John \"Ace\" Kefford (born 10 December 1946) is an English bassist.  He was the co-founder of The Move in October 1965 with Trevor Burton, after meeting David Bowie at Birmingham's Cedar Club, following a performance by Bowie's band Davy Jones and the Lower Third. The duo invited Roy Wood, then Carl Wayne and Bev Bevan to join and complete the classic Move line-up.", "Wayne believed that the start of The Move's downfall was Kefford's departure, because it placed guitarist Trevor Burton into the vulnerable position of having to play more instruments, and the band could well have survived if they had recruited a keyboardist to replace Kefford. Wood recalled of Kefford, \"Ever since the day we formed none of us really got on very well with him. He was a very strange person. He was very aggressive and Ace and Trevor [Burton] used to have a lot of fights all the time.\""]}, {"page": "Tony Secunda", "response": ["In 1969 Secunda helped organize and finance the band Balls with Trevor Burton (formerly of the Move) and singer Denny Laine from the Moody Blues. The group was not very successful."]}, {"page": "Rockpile (album)", "response": ["# \"Down Down Down\" (Trevor Burton) – 2:52"]}, {"page": "What a Bunch of Sweeties", "response": ["Twink had left the band before the recording of this album. Former The Move guitarist Trevor Burton occasionally joined the band for gigs and contributes to a couple of tracks, otherwise the band is the same line up stranded in San Francisco as The Deviants in 1969 after they sacked vocalist Mick Farren.", "*Trevor Burton – guitar (2, 3)"]}]}}