{"wiki_id": "http://www.wikidata.org/entity/Q3530860", "itemLabel": "Tom Ricketts", "itemDescription": "actor (1853-1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Ricketts", "wikipedia_page": {"main": "Thomas B. Ricketts (15 January 1853 – 19 January 1939) was an English-born American stage and film actor and director who was a pioneer in the film industry. He portrayed Ebenezer Scrooge in the first American film adaptation of A Christmas Carol (1908), and directed one of the first motion pictures ever made in Hollywood. After directing scores of silent films, including the first film to be released by Universal Pictures, Ricketts became a prominent character actor.", "link_mentions": [{"page": "Top Hat", "response": ["* Tom Ricketts as Nervous Thackeray Club waiter (uncredited)"]}, {"page": "A Tale of Two Cities (1935 film)", "response": ["* Tom Ricketts as Tellson Jr."]}, {"page": "After the Thin Man", "response": ["* Tom Ricketts as Henry, the butler (uncredited)"]}, {"page": "Ebenezer Scrooge", "response": ["* Tom Ricketts in A Christmas Carol, 1908"]}, {"page": "List of film and television directors", "response": ["*Tom Ricketts"]}, {"page": "Nestor Film Company", "response": ["One division at the Hollywood location, under director Milton H. Fahrney, made a one-reel Western picture every week while the second division, under director Tom Ricketts, turned out a one-reel drama every week. In addition to running the operation, Christie oversaw a weekly production of a one-reel Mutt and Jeff episode."]}, {"page": "Audrey Munson", "response": ["Munson's second film, Purity (1916), made by the American Film Company in Santa Barbara, California and directed by Rae Berger, is the only one of her films to survive, being rediscovered in 1993 in a \"pornography\" collection in France and acquired by the French national cinema archive. Her third film, The Girl o' Dreams, also made by American in Santa Barbara and probably directed by Tom Ricketts from a story by William Pigott (the American Film Institute catalog lists Pigott as director, but all his other credits list him as a writer), was completed by the fall of 1916, but although the film is mentioned on the credit lists of several of its actors in the October 21, 1916 Motion Picture Studio Directory it was not released at that time and was not even copyrighted until December 31, 1918; there is no subsequent mention of the film and it may never have been released.https://db03.id.ucsb.edu:8091/4DACTION/www_ShowFilmDetail?filmID=502&which_table=all_year"]}, {"page": "Vanity Fair (1932 film)", "response": ["*Tom Ricketts as Parker (uncredited)"]}, {"page": "The Power and the Glory (1933 film)", "response": ["*The cast includes four actors who had been film directors during the silent film era: Phillips Smalley, E. H. Calvert, Frank Beal and Tom Ricketts.TCM Notes The Power and the Glory"]}, {"page": "Eugène Brieux", "response": ["*Damaged Goods, directed by Tom Ricketts (1914, based on the play Les Avariés)"]}, {"page": "2003 National League Championship Series", "response": ["Bartman's name, as well as personal information about him, appeared on Major League Baseball's online message boards minutes after the game ended. As many as six police cars gathered outside his home to protect Bartman and his family following the incident. Afterwards, then-Illinois Governor Rod Blagojevich suggested that Bartman join a witness protection program, while then-Florida Governor Jeb Bush offered Bartman asylum. In the years after the incident, Bartman would live in virtual anonymity. He declined interviews, sponsorships, and request for public appearances. After the Cubs ended their 108-year drought and won the World Series in 2016, Steve Bartman's name once again came into focus as he received a championship ring from Cubs owner Tom Ricketts and the Ricketts family as a special gift on July 31, 2017. In his statement to the press, Bartman was relieved and hopeful that the saga of the 2003 foul ball incident surrounding himself and his family would finally be over."]}, {"page": "Danger Island (serial)", "response": ["* Tom Ricketts as Professor Adams"]}, {"page": "Children of Divorce (1927 film)", "response": ["* Tom Ricketts as The Secretary"]}, {"page": "In the Candlelight", "response": ["In the Candlelight is a 1914 American silent short drama film directed by Tom Ricketts, starring William Garwood, Vivian Rich, and Charlotte Burton."]}, {"page": "Old Enough to Be Her Grandpa", "response": ["Old Enough to Be Her Grandpa is a 1914 American silent short comedy film directed by Tom Ricketts starring Charlotte Burton and William Garwood."]}, {"page": "The Strength o' Ten", "response": ["The Strength o' Ten is a 1914 American silent drama short film directed by Tom Ricketts. The film stars William Garwood and Harry von Meter.", "Category:Films directed by Tom Ricketts"]}, {"page": "The Legend Beautiful", "response": ["The Legend Beautiful is a 1915 American silent short drama film directed by Tom Ricketts. It stars William Garwood in the lead role with Perry Banks and Jack Richardson."]}, {"page": "She Never Knew", "response": ["She Never Knew is a 1915 American silent short drama film directed by Tom Ricketts. Starring  William Garwood in the lead role with Charlotte Burton."]}, {"page": "Mrs. Carter's Campaign", "response": ["Mrs. Carter's Campaign is a 1913 American silent short comedy film directed by Tom Ricketts starring Charlotte Burton."]}, {"page": "Calamity Anne's Love Affair", "response": ["Calamity Anne's Love Affair is a 1914 American silent short Western directed by Tom Ricketts starring Charlotte Burton and Louise Lester as Calamity Anne. Also starring George Field, Edith Borella and B. Reeves Eason.  It is the final film in the Calamity Anne series.", "Category:Films directed by Tom Ricketts"]}, {"page": "A Soul Astray", "response": ["A Soul Astray is a 1914 American silent short drama film directed by Tom Ricketts. The film stars Charlotte Burton, William Bertram, Edith Borella, Ed Coxen, Reaves Eason, George Field and Winifred Greenwood."]}, {"page": "In the Footprints of Mozart", "response": ["In the Footprints of Mozart is a 1914 American silent short drama film directed by Tom Ricketts starring Ed Coxen, George Field, Winifred Greenwood, and Ida Lewis."]}, {"page": "The Lure of the Sawdust", "response": ["The Lure of the Sawdust is a 1914 American silent drama short directed by Tom Ricketts starring Charlotte Burton, George Field, Ed Coxen, Edith Borella, Ida Lewis and John Steppling."]}, {"page": "The Butterfly (1914 film)", "response": ["The Butterfly is a 1914 American silent short film directed by Tom Ricketts starring Charlotte Burton, George Field, Edward Coxen, Edith Borella, Jean Durrell, Ida Lewis and John Steppling. "]}, {"page": "Refining Fires", "response": ["Refining Fires is a 1915 American silent short drama film directed by Tom Ricketts. The film stars Harry Van Meter, Charlotte Burton, Jean Durrell, Louise Lester, Jack Richardson, and Vivian Rich.", "* Mrs.Tom Ricketts as Florence"]}, {"page": "In the Twilight", "response": ["In the Twilight is a 1915 American silent short drama film directed by Tom Ricketts. The film stars Perry Banks, Charlotte Burton, Reaves Eason, David Lythgoe, Louise Lester, Vivian Rich, and Harry Van Meter.", "* Mrs. Tom Ricketts as Doris Grant (as Josephine Ditt)", "Category:Films directed by Tom Ricketts"]}, {"page": "Heart of Flame", "response": ["Heart of Flame is a 1915 American silent short drama film directed by Tom Ricketts. The film stars Vivian Rich, David Lythgoe, Charlotte Burton, Jack Richardson, B. Reeves Eason, Perry Banks, Louise Lester, and Harry von Meter.", "Category:Films directed by Tom Ricketts"]}, {"page": "A Touch of Love (1915 film)", "response": ["A Touch of Love is a 1915 American silent short drama film directed by Tom Ricketts starring Vivian Rich, Harry Van Meter, and Charlotte Burton."]}, {"page": "Business Versus Love", "response": ["Business Versus Love is a 1914 American silent short film directed by Tom Ricketts and written by Sydney Ayres. Starring Edward Coxen, Winifred Greenwood, Harry von Meter, and Jack Richardson.", "Category:Films directed by Tom Ricketts"]}, {"page": "The Unseen Vengeance", "response": ["The Unseen Vengeance is a 1914 American silent short drama film directed by Tom Ricketts. Starring Harry von Meter, Vivian Rich, and Charlotte Burton.", "Category:Films directed by Tom Ricketts"]}, {"page": "A Golden Rainbow", "response": ["A Golden Rainbow is a 1915 American silent short film directed by Tom Ricketts, and starring Perry Banks, Louise Lester, Harry von Meter, and Jack Richardson."]}, {"page": "The Black Ghost Bandit", "response": ["The Black Ghost Bandit is a 1915 American silent short Western film directed by Tom Ricketts. The film stars Jack Richardson, Louise Lester, Harry Van Meter, Vivian Rich, Reaves Eason, and Joseph Knight."]}, {"page": "Coals of Fire (1915 film)", "response": ["Coals of Fire is a 1915 American silent short drama film directed by Tom Ricketts. The film was written by Theodosia Harris, and stars Harry von Meter and Louise Lester."]}, {"page": "A Heart of Gold", "response": ["A Heart of Gold is a 1915 American silent romantic drama short film directed by Tom Ricketts starring Harry von Meter, Reaves Eason, Louise Lester, Jack Richardson, and Vivian Rich."]}, {"page": "The Echo (1915 film)", "response": ["The Echo is a 1915 American silent short romantic drama directed by Tom Ricketts. The film stars Jack Richardson, Vivian Rich, Charlotte Burton, B. Reeves Eason, Perry Banks, Louise Lester, David Lythgoe, and Harry von Meter.", "Category:Films directed by Tom Ricketts"]}, {"page": "David Lythgoe", "response": ["David Lythgoe (born c.1880) was an American silent film actor of the early period. He is best known for his work between 1912 and 1915 in short film under the directorship of Tom Ricketts."]}, {"page": "The Two Sentences", "response": ["The Two Sentences is a 1915 American silent short drama film directed by Tom Ricketts starring Harry Van Meter, Perry Banks, Jack Richardson, Louise Lester, Vivian Rich, and David Lythgoe."]}, {"page": "In the Heart of the Woods", "response": ["In the Heart of the Woods is a 1915 American silent short drama film directed by Tom Ricketts and written by Marion Heffernan. Starring  Louise Lester, Vivian Rich, Harry von Meter, David Lythgoe and Charles Morrison."]}]}}