{"wiki_id": "http://www.wikidata.org/entity/Q353353", "itemLabel": "Charles Erskine", "itemDescription": "Catholic cardinal", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Erskine_(cardinal)", "wikipedia_page": {"main": "Charles Erskine (b. at Rome, 13 February 1739; d. at Paris, 20 March 1811) was an Italian-Scottish papal diplomat and cardinal.", "link_mentions": [{"page": "Scots Monastery, Regensburg", "response": ["In June 1776  Charles Arbuthnot became abbot. When in 1802 the Perpetual Diet of Regensburg determined, under pressure from Napoleon Bonaparte, to secularize all the church lands of the Empire, the Monastery was uniquely successful in avoiding this fate. Arbuthnot and his influential monk, Alexander Horn, lobbied Macdonald and Lauriston, Scottish Catholic generals in the French army. Horn, as the official British agent in Regensburg, further appealed to the British government. Arbuthnot declared the abbey a Scottish national shrine and the two priests successfully obtained the support of Charles Erskine, cardinal protector of Scotland in Rome. An express exemption was made in favour of the Scots abbey although it was not allowed to take any new novices.Mark Dilworth, ‘Horn, Alexander (1762–1820)’, Oxford Dictionary of National Biography, Oxford University Press, 2004"]}, {"page": "Scots College (Rome)", "response": ["*Charles Erskine, Cardinal and Vatican diplomat"]}, {"page": "Santa Maria in Campitelli", "response": ["*Charles Erskine (1803–1811)"]}, {"page": "Charles Erskine", "response": ["Charles Erskine may refer to:", "* Charles Erskine, Earl of Mar (1650–1689), Scottish nobleman", "* Charles Erskine, Lord Tinwald (1680–1763), Scottish judge, Lord Advocate, MP for Dumfriesshire 1722–41 and for Tain Burghs 1734–42", "* Charles Erskine (1716–1749), his son, Scottish lawyer, MP for Ayr Burghs", "* Charles Erskine (cardinal) (1739–1811), Italian-Scottish papal diplomat and cardinal", "* Sir Charles Erskine, 1st Baronet, of Alva (1643–1690), Scottish politician", "* Charles Erskine, American sailor and author of Twenty Years Before the Mast, Boston, 1890."]}, {"page": "Crown-cardinal", "response": ["*Charles Erskine (1804–1811)"]}, {"page": "Charles, cardinal Erskine of Kellie", "response": ["#REDIRECT Charles Erskine (cardinal)"]}, {"page": "Monsignor Erskine", "response": ["#REDIRECT Charles Erskine (cardinal)"]}, {"page": "Holy See–United Kingdom relations", "response": ["Unofficial relations were formed again during the French Revolution, as both the British and the Papal courts were interested in coordinating policies against the spread of the revolution across Europe. In 1792, The British court despatched Sir John Coxe Hippisley to Rome as envoy, a position he held until 1795. The papal court despatched Monsignor Charles Erskine to London as envoy, a position he held until 1801. Both countries found themselves at various times enemies of France during this period and therefore had a degree of commonality of interests, not least because of the dechristianisation of France during the French Revolution and the French establishment of the Roman Republic of 1798–99."]}, {"page": "Charles Erskine (Cardinal)", "response": ["#REDIRECT Charles Erskine (cardinal) "]}, {"page": "Cardinals created by Pius VII", "response": ["# Charles Erskine"]}, {"page": "Alexander Erskine of Cambo", "response": ["Erskine was the son of Sir Charles Erskine of Cambo, 1st Bt. and Penelope Barclay. He was born in the same year that his father had been created Lord Lyon, the principal Officer of Arms in the Kingdom of Scotland. By an act of the Parliament of Scotland on 12 June 1672 he was created joint Lyon with his father and in this capacity helped his father establish the Lyon Register.Balfour Paul, vol v, p 90", "*Charles Erskine (born 1682-died in infancy)", "*Sir Charles Erskine of Cambo, 3rd Bt. (1687-1753)", "*Colin Erskine, father to Charles Erskine (cardinal)"]}, {"page": "Charles Erskine de Kellie", "response": ["#REDIRECT Charles Erskine (cardinal)"]}, {"page": "Charles Erskine of Kellie", "response": ["#REDIRECT Charles Erskine (cardinal)"]}]}}