{"wiki_id": "http://www.wikidata.org/entity/Q3535036", "itemLabel": "Jack MacBryan", "itemDescription": "English cricketer (1892-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_MacBryan", "wikipedia_page": {"main": "John \"Jack\" Crawford William MacBryan (22 July 1892 – 14 July 1983) was an English  cricketer who played for Cambridge University and Somerset and made one almost imperceptible appearance in a Test match for England. MacBryan was also a field hockey international and won a gold medal at the 1920 Olympic Games with the Great Britain and Ireland team.MacBryan was educated at Exeter School, where he played cricket for the school and was captain in 1911. After school he joined the Somerset Light Infantry. In 1914, a month after the outbreak of World War I, he was wounded and captured at the battle of Le Cateau, and he was a prisoner for the rest of the war. After the war he went up to Jesus College, Cambridge, where he won his blue for cricket in 1920.An amateur and a right-hand batsman, MacBryan was the leading Somerset batsman in the years after the World War I and was called up for the Old Trafford Test match against the South Africans in 1924. But the match was ruined by rain, and MacBryan remains the only Test cricketer who neither batted, bowled nor dismissed anyone in the field  (where he spent 66.5 overs). His chance never came again.He was a Wisden Cricketer of the Year in 1925.", "link_mentions": [{"page": "July 22", "response": ["*1892 – Jack MacBryan, English cricketer and field hockey player (d. 1983)"]}, {"page": "1983", "response": ["* July 14 – Jack MacBryan, English cricketer (b. 1892)"]}, {"page": "1924 in sports", "response": ["* Wisden Cricketers of the Year – Bob Catterall, Jack MacBryan, Herbie Taylor, Dick Tyldesley, Dodger Whysall"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Jack MacBryan"]}, {"page": "Somerset County Cricket Club", "response": ["The team continued to be a mix of a few highly talented amateurs and a few good professionals, with the side often made up with amateur players who appeared in only a few games. Among the amateurs, the west Somerset farmer Jack White, who succeeded Daniell as captain in 1927, played for England as a left-arm orthodox spinning all-rounder and also captained the Test side in Australia in 1928–29. The briefest Test match career of them all was \"enjoyed\" by another amateur, Jack MacBryan, whose only game for England was the rain-ruined match against the South Africans in 1924, in which he neither batted nor bowled. Of the professionals, fleeting international careers were enjoyed by the hard-hitting batsman Harold Gimblett, whose entry into first-class cricket was the stuff of legends, and by Arthur Wellard, fast bowler and a mighty smiter of sixes."]}, {"page": "List of Test cricketers", "response": ["Jack MacBryan ·"]}, {"page": "Harold Heygate", "response": ["The extent of his injuries became apparent as he was first excused fielding while Somerset made 243, and then batted at No 11, being bowled by Jack White for 0 as Sussex replied with 242. On the second day, according to the recollection of Jack MacBryan, recounted in David Foot's history of Somerset cricket, Sunshine, Sixes and Cider, Heygate remained in a blue serge suit with the implication that he would take no further part in the match. "]}, {"page": "Great Britain men's national field hockey team", "response": ["*Jack MacBryan"]}, {"page": "1924 English cricket season", "response": ["*Wisden Cricketers of the Year - Robert Catterall, Jack MacBryan, Herbie Taylor, Dick Tyldesley, Dodger Whysall"]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Jack MacBryan (1911–1931) 156 matches CA"]}, {"page": "Exeter School", "response": ["*Jack MacBryan test cricketer and Olympic gold medallist (hockey)"]}, {"page": "John MacBryan", "response": ["#REDIRECT Jack MacBryan"]}, {"page": "1892 in the United Kingdom", "response": ["* 22 July – Jack MacBryan, cricketer and field hockey player (died 1983)"]}, {"page": "John McBryan", "response": ["#REDIRECT Jack MacBryan"]}, {"page": "Reggie Ingle", "response": ["Ingle went to Oundle School, heading the school batting averages in 1921. He made his first-class debut for Somerset in a rain-ruined match against Essex at Taunton in August 1923. He made 54 in his first innings, one of only two Somerset players to make more than seven in a total of 189, and put on 97 for the sixth wicket with Jack MacBryan, who made 101."]}, {"page": "Frederick Baitup", "response": ["Baitup made a single first-class appearance for Somerset, during the 1924 season, against Derbyshire at Burton-upon-Trent. Playing as a tailender, Baitup picked up eleven runs in the only innings in which he batted, as Somerset picked up an innings victory thanks to a century and a double-century from Jack MacBryan and Dar Lyon respectively. Baitup bowled two overs in Derbyshire's first innings, including one maiden, conceding eight runs. He also took one catch."]}, {"page": "List of tied first-class cricket matches", "response": ["Jack MacBryan 80"]}, {"page": "Crowther Charlesworth", "response": ["In 1920 he was awarded a benefit match which generated £1041, the figure was a Warwickshire record which remained unsurpassed until 1945. In his final season, after Charlesworth had made a fine 81 out of 138 v Somerset, he suffered a nasty injury to his eye, being hit by a shot played by Jack MacBryan whilst fielding at short leg."]}, {"page": "Tom Young (cricketer)", "response": ["Initially, he played largely as a batsman, usually opening. In 1922, he made 881 runs, and in every other season he went on to more than 900 runs, passing the 1,000 runs for the season five times. His first century came in 1923 against a weak Glamorgan side at Taunton, when he put on 251 for the second wicket with Jack MacBryan, who made 148. A year later, he made 198 against Hampshire at Bath, the major contribution in what was, at that stage, Somerset's highest-ever first-class total. The innings remained Young's highest score in first-class cricket. He was picked twice to represent the professionals in Gentlemen v Players matches, once at Folkestone and once at The Oval."]}, {"page": "Peter Randall Johnson", "response": ["Peter Randall Johnson (5 August 1880 – 1 July 1959) was a cricketer who played for Cambridge University, Somerset and several amateur sides in a long first-class cricket career that stretched from 1900 to 1927. During his career, he appears to have been known, somewhat formally, as \"P. R. Johnson\"; modern websites refer to him as \"Randall Johnson\". Somerset colleague Jack MacBryan, who didn't like him, called him \"Peter Johnson\"."]}, {"page": "Dar Lyon", "response": ["Lyon was described in his Wisden obituary as being \"considered by many to be among the best batsmen who never gained a cap for England\". An amateur, he passed 1,000 runs in the 1923 season, and was selected to play for the Gentlemen in July of the same year. He scored 120 in the match, putting on 219 in a second wicket partnership with Greville Stevens. The following season, he was selected to play for 'The Rest' against England, in a three-day Test Trial match. Lyon recorded scores of 32 and 3, and took a catch in both innings during a three wicket loss. Lyon was the only member of the team not to go on to represent England at Test cricket. Fellow Somerset batsman Jack MacBryan wasn't impressed, saying of his friend, \"Dar is a grand chap and a very fine cricketer. Don't know what the Test selectors were thinking about.\"Foot (1986), p111. Later in the season, he hit his highest total in first-class cricket as he made 219 against Derbyshire. He once again represented the Gentlemen, but after scoring 11 in the first innings, was out for a duck in the second."]}, {"page": "M. P. Bajana", "response": ["In 1919 he returned to the Somerset team, playing in six of their twelve County Championship matches. His batting average of 27.55 in that competition was the second-highest amongst his team, bettered only by Jack MacBryan. Bajana hit two half-centuries during the season, scoring 77 against Derbyshire, and 59 against Essex. The following 1920 season was Bajana's last with Somerset. He appeared fifteen times for the county in first-class cricket, averaging just over twenty. In a match against Cambridge University, he achieved his highest first-class score, hitting 14 fours on his way to a total of 115 runs in 135 minutes. In his next match, he scored a second century for Somerset, and his only one in the County Championship, scoring 106 runs against Warwickshire. Bajana played his final first-class match against Middlesex in August 1920, scoring six and a duck. In all, Bajana scored 1,975 first-class runs at an average of 20.78. He scored three centuries and seven half-centuries in 96 innings. He was rarely used as a bowler, and took four wickets at an average of 33.00."]}, {"page": "West of England cricket team", "response": ["* Jack MacBryan (1927)"]}, {"page": "List of Somerset County Cricket Club seasons", "response": ["|align=left|Jack MacBryan", "|align=left|Jack MacBryan", "|align=left|Jack MacBryan"]}]}}