{"wiki_id": "http://www.wikidata.org/entity/Q353678", "itemLabel": "Gary McAllister", "itemDescription": "Scottish association football player and manager (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_McAllister", "wikipedia_page": {"main": "Gary McAllister MBE (born 25 December 1964) is a Scottish professional football coach and former player, who is in his second spell as the assistant manager of Aston Villa.\nMcAllister played primarily as a midfielder in a career spanning over nineteen years. He started his career at local side Motherwell before moving south of the border to Leicester City at the age of 20. He then went on to play for Leeds United, where he won the English league championship in 1991–92. McAllister later had spells at Premier League sides Coventry City, where he was credited with his role in helping the club avoid relegation repeatedly, and Liverpool, where he won a cup treble in 2000–01 at the age of 36.\nMcAllister also represented his national side for nine years, winning 57 caps and scoring five goals. His leadership qualities were noticed, and he spent four years as Scotland captain in addition to two seasons as Leeds United captain. He was awarded an MBE in the 2001 New Year Honours in recognition of his contribution to football and was inducted to the Scottish Football Hall of Fame in 2016.\nHe was appointed player-manager of Coventry City in April 2002. He resigned from this position in January 2004 and did not enter management again until he returned to Elland Road in January 2008, to replace Dennis Wise as manager. McAllister guided Leeds to the promotion playoffs, but was dismissed in December 2008. In April 2011, while working as assistant to manager Gérard Houllier at Aston Villa, he became caretaker manager at the Premier League club for a few months due to Houllier's ill health. He also had coaching roles at Middlesbrough and Liverpool, returning to Scotland with Rangers in 2018. He Joined Steven Gerrard in leaving Rangers making a return to Aston Villa as Assistant Manager again.", "link_mentions": [{"page": "December 25", "response": ["*  1964   – Gary McAllister, Scottish footballer and manager"]}, {"page": "Aston Villa F.C.", "response": ["|Gary McAllister"]}, {"page": "Eric Cantona", "response": ["Cantona's arrival at Leeds United was announced in January 1992. Leeds would pay £100,000 to Nîmes to take him on loan until 15 April, after which they would have to pay another £900,000 to sign him permanently.Auclair (2009), p. 184. Cantona made his debut for Leeds in a 2–0 loss at Oldham Athletic on 8 February 1992. At Leeds, he was part of the team that won the final Football League First Division title before it was replaced by the Premier League as the top division in English football. He made 15 appearances, and despite only scoring three goals, he was instrumental in their title success, primarily with assists for leading goalscorer Lee Chapman. Cantona scored his first goal for Leeds in a 2–0 win at home to Luton Town on 29 February, and set up the other goal for Chapman.Auclair (2009), p. 193. Having played little football in the six weeks before signing for Leeds, Cantona struggled to find a place in an established line-up, with manager Howard Wilkinson preferring to put him on against tiring defences. Against Tottenham Hotspur at White Hart Lane on 7 March, Cantona came off the bench to set up a goal for Gary McAllister, securing a win that moved Leeds two points ahead of Manchester United, who had a game in hand, in the title race.Auclair (2009), pp. 193–5. Cantona was deployed as a part of a front three, along with Chapman and Rod Wallace, in a 5–1 thrashing of Wimbledon at Elland Road on 14 March, scoring Leeds' fourth goal of the game.Auclair (2009), p. 196."]}, {"page": "David Seaman", "response": ["Seaman cemented his place as the undisputed number-one keeper with the arrival of Terry Venables as manager, and played every minute of every match during Euro 96. Seaman saved two spot-kicks in the tournament; the first a penalty in normal play from Scotland's Gary McAllister in a group match, while England were 1–0 up (Paul Gascoigne scored soon after to make it 2–0). Then, after England's quarter-final against Spain ended scoreless, Seaman saved Miguel Angel Nadal's kick in the shootout to knock Spain out of the tournament. England eventually were eliminated in the semi-final by Germany on penalties, after Andreas Köpke saved the penalty taken by Gareth Southgate. Seaman was named alongside Golden Boot winner Alan Shearer and winger Steve McManaman in the UEFA \"Team of the Tournament\". Euro 96 sponsor Philips named him \"Player of the Tournament\"."]}, {"page": "List of sports announcers", "response": ["* Gary McAllister – Sky Sports 2006–2013, BT Sport 2013–2018"]}, {"page": "Leicester City F.C.", "response": ["*  Gary McAllister (1990)", "*  Gary McAllister (3 Caps, 25 April 1990)", "*  Gary McAllister 51", "* 1989 – Second Division –  Gary McAllister", "* 1990 – Second Division –  Gary McAllister"]}, {"page": "Gérard Houllier", "response": ["The rebuilding continued in 2000 with the signings of Markus Babbel, Nicky Barmby, Pegguy Arphexad, Grégory Vignal, Emile Heskey, Gary McAllister, Igor Bišćan and Christian Ziege, as well as the departures of David Thompson, Phil Babb, Dominic Matteo, Steve Staunton, Brad Friedel and Stig Inge Bjørnebye. The efforts yielded a result in the successful 2000–01 season, when Liverpool won a cup treble of the League Cup, the FA Cup and the UEFA Cup and finished third in the Premier League, hence qualifying for Champions League. In August 2001, Liverpool won the Charity Shield against Manchester United and UEFA Super Cup against Bayern Munich.", "In the 2002–03 season, Liverpool finished in the fifth place in the Premier League, failing to qualify for the following season's UEFA Champions League. Critics blamed Houllier's unsuccessful summer signings in 2002, namely El Hadji Diouf (Lens, £10 million), Salif Diao (Sedan, £5 million) and Bruno Cheyrou (Lille, £4 million), and his failure to make Nicolas Anelka's loan move permanent in favour of signing the ineffective Diouf. Houllier's failure to replace creative talents such as Gary McAllister and Jari Litmanen was also criticised. In March 2003, Liverpool defeated Manchester United 2–0 in the League Cup Final. In October 2003, Houllier appointed Steven Gerrard club captain. With Liverpool failing to mount a title challenge in his last two seasons despite substantial investment in players with what was perceived as negative one-dimensional tactics and unattractive football, a poor youth policy, his constant mention of \"turning corners\" and a lack of support from fans, these factors led to Houllier's departure from Liverpool on 24 May 2004. Having qualified the club for the following season's Champions League, Houllier left Liverpool by mutual consent, after reluctantly agreeing to a board request that he leave the club. He was replaced by Valencia coach Rafael Benítez.", "Houllier's first match in charge was the League Cup match against Blackburn Rovers on 22 September. Villa won the match 3–1, coming back from a goal down to progress to the next round of the competition. It was announced on 18 September 2010 that Gary McAllister had agreed to become his assistant manager, with Gordon Cowans also taking a role in Houllier's backroom staff. Two days after the Blackburn match, he signed a three-year contract. However, Houllier's start at the club proved to be difficult. The side was hit with injuries to key players Gabriel Agbonlahor, Stiliyan Petrov, Nigel Reo-Coker and Emile Heskey, and managed just one win in ten Premier League matches. In November 2010, Houllier signed 37-year-old former Arsenal midfielder Robert Pires on a free transfer in an attempt to aid the club during its injury crisis. By January 2011, Villa had picked up just 21 points from 20 Premier League matches. The club had also been knocked out of the League Cup the previous month by local rivals Birmingham City. On 5 January, Villa were beaten 1–0 at home by Sunderland; this loss left Villa in 18th position in the league table, the first time they had been in the relegation zone since 2003. During the match, a selection of the home crowd targeted Houllier with chants of \"you're getting sacked in the morning\" to vent their frustration at the club's poor run of form. Despite this, Villa directors acted quickly to insist that Houllier's job as manager was safe.", "On 20 April, Houllier was admitted to hospital after falling ill during the night. His condition was said to be stable, but he was not able to be at Aston Villa's training session the following day, and was not able to attend their match against Stoke City on 23 April, or any subsequent matches of the 2010–11 season. Gary McAllister took charge of all first team affairs in his stead. On 1 June, Houllier stepped down as manager of Aston Villa by mutual consent. In Houllier's only season, Villa finished ninth; they have not finished higher since his departure."]}, {"page": "Emile Heskey", "response": ["On 7 May 2011, in Aston Villa's home match against Wigan, Heskey barged into referee Mike Jones and continued to argue with him because he did not award a free kick for an alleged elbow by Antolín Alcaraz. Heskey received a yellow card for his behaviour and had to be restrained by teammates such as Brad Friedel and captain Stiliyan Petrov. He played for the remainder of the half, but had to be restrained again in the tunnel at the interval. Caretaker manager Gary McAllister chose to substitute him for Marc Albrighton at half-time, and Heskey was not allowed to remain at the stadium for the rest of the match. Despite his outburst, Heskey received no punishment from either Villa or The Football Association. Teammate Luke Young later said that Heskey was \"lucky he didn't get sent off\"."]}, {"page": "Motherwell", "response": ["Braidhurst High School, in the Forgewood area of Motherwell, serves areas including Forgewood, North Motherwell, The Globe and Jerviston. With a roll of around 500, Braidhurst is one of the smaller secondary schools in Lanarkshire. The main school building was recently modernised, with the outdated pink and yellow panels replaced by a modern-looking glass exterior. Notable alumni of Braidhurst include Elaine C Smith (actress), former Scotland national football captain Gary McAllister and Tam Cowan (comedian and writer)."]}, {"page": "Coventry City F.C.", "response": ["|  Gary McAllister", "|  Gary McAllister 46 Steve Ogrizovic 46", "|  Gary McAllister", "|  Gary McAllister", "|  Gary McAllister", "|  Gary McAllister", "|  Gary McAllister 13", "|  Gary McAllister 43"]}, {"page": "Grimsby Town F.C.", "response": ["The Mariners started the 2001–02 season strongly, topping the league table after five games. The cluib advanced to the third round of the League Cup where they met holders Liverpool at Anfield. In one of the club most famous victories, Grimsby held the Premier League team to a 0–0 draw after 90 minutes taking the game into extra time. Despite Gary McAllister scoring a penalty following a David Beharall handball to put the Reds 1–0 up, loan signing Marlon Broomes equalised before ex-Everton youth player Phil Jevons hit a 35-yard strike into the top corner of Chris Kirkland's goal to give the club a historic victory. Grimsby's push for promotion faltered and the team's form declined rapidly, with Lawrence being dismissed halfway into the season. Paul Groves, the skipper, was chosen to replace him and he steered them to a 19th in the final table, enough to avoid relegation, but a disappointing end to a season which had begun so promisingly. The season was overshadowed by loanee Martin Pringle's footballing career being ended after a leg-breaking tackle by Stockport County defender Dave Challinor, This was also aggravated more by the referee Mike Dean only awarding Challinor a yellow card for the horrific career ending challenge., As well as the collapse of ITV Digital putting enormous strain on finances for the club."]}, {"page": "Gordon Strachan", "response": ["With the \"Whites\" now in the First Division, Wilkinson secured a midfield quartet of Strachan, Gary McAllister, David Batty and Gary Speed. They achieved a commendable fourth-place finish in 1990–91, and also reached the semi-finals of the League Cup. Strachan was voted FWA Footballer of the Year for his performances during the campaign, becoming the first player to win the award both in Scotland and in England.", "In March 1995, Strachan moved to Coventry City to work as assistant manager under new manager Ron Atkinson, the man who had brought him south of the border to Manchester United 11 years earlier. It was also agreed he would replace Atkinson as manager in summer 1997. Strachan coached the team and led training sessions while learning the finer points of management from Atkinson. He also took to the field at Highfield Road, playing 26 Premier League matches for the Sky Blues over the next two years before finally hanging up his boots in his 40th year. Atkinson signed Aberdeen midfielder Eoin Jess in 1996 purely on the basis of Strachan's recommendation. However, Isaías left the club after falling-out with Strachan. Coventry signed Gary McAllister for £3 million on wages of £20,000 per week; the deal was done by McAllister's former teammate and friend Strachan, while Atkinson was largely opposed to the deal. The club struggled at the start of the 1996–97 campaign, and the club's board of directors asked Atkinson to step aside in November 1996, some months earlier than first agreed, and Strachan was appointed manager.", "The club finished 15th in 1998–99 and 14th in 1999–2000, as Strachan spent £6 million on Irish striker Robbie Keane and £5 million on Moroccans Mustapha Hadji and Youssef Chippo, while selling Dion Dublin to Midlands rivals Aston Villa. Coventry were relegated at the end of the 2000–01 season, making Strachan unpopular with fans. New signing Craig Bellamy proved disappointing, while Robbie Keane was sold and Gary McAllister departed for Liverpool. Strachan attempted to launch a promotion campaign by signing striker Lee Hughes, but in the face of increasing supporter unrest, he was sacked five matches into the 2001–02 First Division campaign. His replacement, Roland Nilsson, took the club to an 11th-place finish."]}, {"page": "Dion Dublin", "response": ["Following Phil Neal's departure in 1995, the arrival of Ron Atkinson and Gordon Strachan would see Dublin fit into an attacking team in the typical Atkinson mould. It included the likes of Noel Whelan, John Salako and Darren Huckerby to add to the already attack minded Peter Ndlovu. The addition of Gary McAllister, following UEFA Euro 1996, should have provided mid-table stability but the team's defensive frailties often undermined Dublin's scoring at the other end. This culminated in possibly one of the greatest escapes in Premier League history in May 1997. Despite having won away to Liverpool (Dublin scoring in the dying seconds) and at home to Chelsea in their previous two games, Coventry City went into the final day second from bottom of the table, needing not only to beat Tottenham Hotspur away from home but also for results elsewhere in the league to go their way for them to escape relegation. Goals from Dublin and Paul Williams gave Coventry a 2–1 win at White Hart Lane, while both Middlesbrough and Sunderland lost, and Coventry finished one point outside the relegation zone."]}, {"page": "Scotland national football team", "response": ["New manager Craig Brown successfully guided Scotland to the 1996 European Championship tournament. The first game against the Netherlands ended 0–0, raising morale ahead of a much anticipated game against England at Wembley. Gary McAllister missed a penalty kick, and a goal by Paul Gascoigne led to a 2–0 defeat. Scotland recovered to beat Switzerland 1–0 with a goal by Ally McCoist. England taking a 4–0 lead in the other match briefly put both teams in a position to qualify, but a late goal for the Netherlands meant that Scotland were knocked out on goals scored."]}, {"page": "2001–02 in English football", "response": ["* 24 April - Gary McAllister takes over at Coventry City, replacing Roland Nilsson (sacked 16 April)"]}, {"page": "Ron Atkinson", "response": ["In December 1995, Atkinson guided the Sky Blues to one of their best results of the 1990s – a 5–0 home win over defending champions Blackburn Rovers. During his spell as manager of Coventry, he brought in high-profile players including Gordon Strachan, Noel Whelan and Gary McAllister (although in his autobiography he states that this latter signing was Strachan's initiative and he was opposed for tactical reasons) but they continued to struggle in the Premier League and by November 1996 he had become Director of Football, handing over managerial duties to Strachan, who by then had retired as a player and had become assistant manager."]}, {"page": "Robbie Keane", "response": ["Just weeks into the 1999–2000 season, he was sold to Premier League club Coventry City for £6 million, then a British record for a teenager. Keane got off to a great start, scoring two goals on his debut against Derby County. During a successful season at Coventry, he played a major role in a stylish attacking side boasting the likes of Gary McAllister, Mustapha Hadji and Youssef Chippo and formed a productive strike partnership with Cédric Roussel. Keane played in a total of 34 games, scoring 12 goals, all of which came in the Premier League."]}, {"page": "Curtis Weston", "response": [" He scored his first goal for the club in their 3–0 win over Northampton Town in January 2008, but his time with Leeds was not long. \"Gary McAllister (the new Leeds manager after Wise left for Newcastle United), was straight with me. He just told me I wasn't in his plans and I should get myself another club,\" said Weston later."]}]}}