{"wiki_id": "http://www.wikidata.org/entity/Q3538616", "itemLabel": "Trevor Woodman", "itemDescription": "English rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Woodman", "wikipedia_page": {"main": "Trevor James Woodman MBE (born 4 August 1976) is a former English rugby union footballer. He was born in Plymouth, but went to Liskeard School in Cornwall and won representative honours with Cornwall Under 16s.\nWoodman moved from Cornwall and played first for Plymouth Albion and Bath before joining Gloucester Rugby in 1996. Whilst at Gloucester he was a replacement in the 2002 Zurich Championship Final (the year before winning the play-offs constituted winning the English title) in which Gloucester defeated Bristol Rugby, and started in the 2003 Powergen Cup Final in which Gloucester defeated Northampton Saints.He appeared seven times for England A and won his first full cap coming off the bench for a 1999 World Cup warm-up match against the USA. Injury forced him out from what would have been his first tour, to South Africa in 2000, and although he also toured North America the following year, he failed to win a cap. His subsequent caps came from the bench until his first start against the All Blacks in November 2002. A neck injury forced him to withdraw from the remaining two autumn internationals and he was out of action for three months.\nIn March 2003, Woodman returned to the England squad and appeared as a replacement against both Scotland and Ireland. His World Cup starting position was sealed by strong performances in the pre-tournament matches. Woodman was England's loose-head prop in the World Cup final and became one of the best props in the game despite a career spent battling against injuries.\nWoodman joined Sale Sharks for the 2004–2005 season but sustained a long-term back injury in training with the Sharks in September 2004. In the Summer of 2005, he was forced to retire at the age of 29 due to this injury.Woodman provided commentary for Fox Sports in Australia, when England were there in July 2006 to contest the Cook Cup.\nWoodman started his coaching career when he moved to Australia initially working with Sydney University before taking on the role of National Scrum Coach with the Australian Rugby Union.\nWoodman's next career move saw him return to England when he undertook the role of Forwards Coach at Wasps, a position he held for four years. Woodman returned to his old club Gloucester Rugby to become their new Scrum Coach.", "link_mentions": [{"page": "August 4", "response": ["*  1976   – Trevor Woodman, English rugby player and coach"]}, {"page": "Liskeard", "response": ["*Trevor Woodman – former England rugby international, part of the 2003 Rugby World Cup winning team"]}, {"page": "Gloucester Rugby", "response": ["In 1999–00, a third-place finish took Gloucester into the Heineken Cup. With Phil Vickery, Trevor Woodman, Kingsley Jones and All Blacks legend Ian Jones forming the basis of a formidable pack, Gloucester Rugby reached the semi-finals.", "*Trevor Woodman – Assistant Forwards and Academy Transition Coach", "* Trevor Woodman, won 2003 Rugby World Cup Final while at Gloucester"]}, {"page": "Sport in Cornwall", "response": ["Cornish rugby has produced many fine rugby players who have played at international level. Such players as Phil Vickery and Trevor Woodman won 2003 Rugby World Cup winners medals with England, Stack Stevens (England and British and Irish Lions), Graham Dawe (England), along with Andy Reed who has represented Scotland and the Lions, and many others."]}, {"page": "Rugby union in Cornwall", "response": ["Cornish rugby has produced many fine rugby players who have played at the international level, including Phil Vickery, Trevor Woodman, (both England), Stack Stevens (England and British and Irish Lions), Graham Dawe (England), along with Andy Reed who has represented Scotland and the Lions, and many others."]}, {"page": "2003 Rugby World Cup Final", "response": ["|LP ||1 ||Trevor Woodman"]}, {"page": "Stefan Czerpak", "response": ["Czerpak coached many notable rugby union players, including Josh Lewsey, Joe Worsley, Trevor Woodman, Ben Kay, Phil Vickery, Phil Greening, Martin Wood, Ben Cohen, Lewis Moody, Tony Diprose, Mike Tindall and Andy Gomarsall - who made an appearance at the 2004 memorial match along with Ayoola Erinle. Tom Croft is probably the last player to be coached by Czerpak and make it to 'top-flight rugby.' Czerpak coached and taught Tom at Park House school."]}, {"page": "2000 England rugby union tour of South Africa", "response": ["Neil Back (Leicester Tigers), Steve Borthwick (Bath Rugby), Ben Clarke (Bath Rugby), Martin Corry (Leicester Tigers), Lawrence Dallaglio (London Wasps), David Flatman (Saracens), Darren Garforth (Leicester Tigers), Will Green (London Wasps), Phil Greening (London Wasps), Danny Grewcock (Saracens), Martin Johnson (Leicester Tigers), Richard Hill (Saracens), Jason Leonard (Harlequins), Andy Long (Bath Rugby), Mark Regan (Bath Rugby), Graham Rowntree (Leicester Tigers), Simon Shaw (London Wasps), Andrew Sheridan (Bristol), Paul Volley (London Wasps), Julian White (Saracens), Roy Winters (Bedford Blues), Trevor WoodmanNote: Woodman returned home due to injury with Rowntree replacing him. (Gloucester Rugby), Joe Worsley (London Wasps)."]}, {"page": "2002 England rugby union tour of Argentina", "response": ["England XV: 15. Tom Beim, 14. David Rees, 13. Tom May, 12. Kevin Sorrell, 11. Mark Cueto, 10. Dave Walder, 9. Nick Walshe, 8. Declan Danaher, 7. Pete Anglesea, 6. Adam Balding, 5. Hugh Vyvyan (capt.), 4. Rob Fidler, 3. Robbie Morris, 2. Mark Regan, 1. Trevor Woodman, – replacements:, 22. Kevin Sorrell ", "England: 15. Michael Horak, 14. Tim Stimpson, 13. Geoff Appleford, 12. Ben Johnston, 11. Phil Christophers, 10. Charlie Hodgson, 9. Andy Gomarsall, 8. Joe Worsley, 7. Lewis Moody, 6. Alex Sanderson, 5. Ben Kay, 4. Alex Codling, 3. Phil Vickery (capt.), 2. Steve Thompson, 1. David Flatman, – replacements: 16. Mark Regan, 17. Trevor Woodman, 18. Hugh Vyvyan, 19. Adam Balding, 20. Nick Walshe, 21. Dave Walder, 22. Kevin Sorrell "]}, {"page": "2003 England rugby union tour of Australasia", "response": ["England: 15.Josh Lewsey, 14.Jason Robinson, 13.Will Greenwood, 12.Mike Tindall, 11.Ben Cohen, 10.Jonny Wilkinson, 9.Kyran Bracken, 8.Lawrence Dallaglio, 7.Neil Back, 6.Richard Hill, 5.Ben Kay, 4.Martin Johnson (capt.), 3.Phil Vickery, 2.Steve Thompson, 1.Trevor Woodman,  – replacements: 18.Steve Borthwick, 19.Joe Worsley, 20.Matt Dawson       –  No entry: 16.Mark Regan, 17.Jason Leonard, 21.Alex King, 22.Dan Luger", "Lawrence Dallaglio, Neil Back, Richard Hill, Ben Kay, Martin Johnson, Jason Leonard, Steve Thompson, Graham Rowntree, Phil Vickery, Trevor Woodman, Joe Worsley, Matt Dawson"]}, {"page": "2004 England rugby union tour of Australasia", "response": ["England: 15. Josh Lewsey, 14. James Simpson-Daniel, 13. Mike Tindall, 12. Mike Catt, 11. Ben Cohen, 10. Charlie Hodgson, 9. Matt Dawson, 8. Lawrence Dallaglio (capt.), 7. Richard Hill, 6. Chris Jones, 5. Danny Grewcock, 4. Simon Shaw, 3. Julian White, 2. Steve Thompson, 1. Trevor Woodman,  – replacements: 16. Mark Regan, 17. Matt Stevens, 18. Steve Borthwick, 19. Joe Worsley, 20. Andy Gomarsall, 21. Stuart Abbott  –  No entry: 22. Olly Barkley", "England: 15. Josh Lewsey, 14. Tom Voyce, 13. Stuart Abbott, 12.Mike Tindall, 11. Ben Cohen, 10. Charlie Hodgson, 9.Andy Gomarsall, 8. Lawrence Dallaglio (capt.), 7. Richard Hill, 6. Joe Worsley, 5. Steve Borthwick, 4. Simon Shaw , 3. Julian White, 2. Mark Regan, 1. Trevor Woodman,  – replacements: 16. Andy Titterrell, 17. Matt Stevens, 18. Danny Grewcock, 19. Michael Lipman, 20. Matt Dawson, 21. Olly Barkley, 22. Fraser Waters "]}, {"page": "Lachlan Mitchell", "response": ["Mitchell joined Wasps in 2008, from Sydney University. He made 31 appearances as a regular support player for the 1XV and strong figure in the A League side. Mitchell was signed for Wasps on a two-year deal from the New South Wales Waratahs' academy. He joined Wasps on the recommendation of former England prop Trevor Woodman who coached him at Sydney Uni. He made his Wasps debut for against London Irish on 6 September 2008."]}, {"page": "List of England national rugby union players", "response": ["|1213||Trevor Woodman||(prop) ||1999-08-21||v United States of America at Twickenham"]}]}}