{"wiki_id": "http://www.wikidata.org/entity/Q353788", "itemLabel": "Bernie Taupin", "itemDescription": "British songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernie_Taupin", "wikipedia_page": {"main": "Bernard John Taupin  (born 22 May 1950) is an English songwriter. He is best known for his long-term collaboration with Elton John, having written the lyrics for most of John's songs.\nIn 1967, Taupin answered an advertisement placed in the music paper New Musical Express by Liberty Records, a company that was seeking new songwriters. John responded to the same advertisement and they were brought together, collaborating on many projects since. Taupin and John were inducted into the Songwriters Hall of Fame in 1992.", "link_mentions": [{"page": "All Quiet on the Western Front", "response": ["Elton John's album Jump Up! (1982) features the song \"All Quiet on the Western Front\" (written by Elton and Bernie Taupin). The song is a rendition of the novel's story (\"It's gone all quiet on the Western Front / Male Angels sigh / ghosts in a flooded trench / As Germany dies\")."]}, {"page": "Prince Harry, Duke of Sussex", "response": ["In 2014, Harry and William inherited their mother's wedding dress along with many other of her personal possessions, including dresses, diamond tiaras, jewels, letters, and paintings. The brothers also received the original lyrics and score of \"Candle in the Wind\" by Bernie Taupin and Elton John as performed by John at Diana's funeral."]}, {"page": "May 22", "response": ["*1950 – Bernie Taupin, English singer-songwriter and poet"]}, {"page": "Mondegreen", "response": ["* An advertisement for the 2012 Volkswagen Passat touting the car's audio system shows a number of people singing incorrect versions of the line \"Burning out his fuse up here alone\" from the Elton John/Bernie Taupin song \"Rocket Man\", until a woman listening to the song in a Passat realizes the correct words."]}, {"page": "Roy Orbison", "response": ["Elton John's songwriting partner and main lyricist Bernie Taupin wrote that Orbison's songs always made \"radical left turns\", and k.d. lang declared that good songwriting comes from being constantly surprised, such as how the entirety of \"Running Scared\" eventually depends on the final note, one word.Lehman, p. 52. Some of the musicians who worked with Orbison were confounded by what he asked them to do. The Nashville session guitarist Jerry Kennedy stated, \"Roy went against the grain. The first time you'd hear something, it wouldn't sound right. But after a few playbacks, it would start to grow on you.\""]}, {"page": "Nightjar", "response": ["*Nightjars feature prominently in the lyrics of the Elton John/Bernie Taupin song \"Come Down in Time\": \"While a cluster of nightjars sang some songs out of tune\".  Sting, in an interview about this song and about Elton John, said, \"It's a very beautiful song. I love the lyrics. I love Bernie's lyrics, and uh, I don't know, it's just a great song.  It is one of those songs you wish you had written.  That's how selfish songwriters are.\" ... \"I love this line: 'a cluster of nightjars, singing out of tune,' creates very evocative images\".Sting - Come Down In Time (New York - October 22 1991) - YouTube"]}, {"page": "Lincolnshire", "response": ["* Bernie Taupin (born 1950), songwriter"]}, {"page": "Prince William, Duke of Cambridge", "response": ["In 2014, the brothers inherited their mother's wedding dress along with many other of her personal possessions including dresses, diamond tiaras, jewels, letters, and paintings. The brothers also received the original lyrics and score of \"Candle in the Wind\" by Bernie Taupin and Elton John as performed by John at Diana's funeral."]}, {"page": "Mendocino County, California", "response": ["A song written by Matt Serletic and Bernie Taupin, \"Mendocino County Line\" which was released in 2002, is about a love that could not last and cites the 'Mendocino County Line' in the chorus."]}, {"page": "Sting (musician)", "response": ["His 1991 album, The Soul Cages, was dedicated to his late father. It included \"All This Time\" and the Grammy-winning title track. The album went Platinum. The album also included an Italian version of Mad About You. The text was written by his friend Zucchero Fornaciari. The song was then included in Overdose d'amore/The Ballads (1999) and in Zu & Co. (2004) of the Italian bluesman. The following year, he married Trudie Styler and was awarded an honorary doctorate in music from Northumbria University. In 1991, he appeared on Two Rooms: Celebrating the Songs of Elton John and Bernie Taupin. He performed \"Come Down in Time\" for the album, which also features other popular artists and their renditions of John/Taupin songs."]}, {"page": "Songwriter", "response": ["Songwriting partnership or songwriting duo is a prolific collaboration which consists of two songwriters, usually sharing 50% royalty each. Songwriting partnership can be between a composer and a lyricist (Andrew Lloyd Webber with Tim Rice or Elton John with Bernie Taupin), a performer and a producer (Madonna with Patrick Leonard or Mariah Carey with Walter Afanasieff), or between bandmates (John Lennon with Paul McCartney of the Beatles or Björn Ulvaeus with Benny Andersson of ABBA)."]}, {"page": "Bernard", "response": ["* Bernie Taupin (born 1950), British songwriter and collaborator with Elton John"]}, {"page": "Bryan Ferry", "response": ["After the Avalon promotional tours, Ferry was rather reluctant to return to live touring on the road; however, a change of management persuaded him to resume touring in 1988 to promote the previous year's Bête Noire. Following the tour, Ferry teamed again with Brian Eno for Mamouna (collaborating with Robin Trower on guitar and as producer). The album took more than five years to produce, and was created under the working title Horoscope. During production, Ferry simultaneously recorded and released Taxi in 1993, which proved to be a greater commercial and critical success than Mamouna when it was finally released in 1994. In 1996, Ferry performed the song \"Dance with Life\" for the Phenomenon soundtrack, written by Bernie Taupin and Martin Page. "]}, {"page": "Alice Cooper", "response": ["In 1978, a sobered Cooper used his experience in the sanitarium as the inspiration for his semi-autobiographical album From the Inside, which he co-wrote with Bernie Taupin; it spawned yet another US Top 20 hit ballad, \"How You Gonna See Me Now\". The subsequent tour's stage show was based inside an asylum, and was filmed for Cooper's first home-video release, The Strange Case of Alice Cooper, in 1979. Around this time, Cooper performed \"Welcome to My Nightmare\", \"You and Me\", and \"School's Out\" on The Muppet Show (episode #307) on March 28, 1978 (he played one of the devil's henchmen trying to dupe Kermit, Gonzo and Miss Piggy into selling their souls). He also appeared in an against-typecasting role as a piano-playing disco waiter in Mae West's final film, Sextette, and as a villain in the film Sgt. Pepper's Lonely Hearts Club Band. Cooper also led celebrities in raising money to remodel the famous Hollywood Sign in Los Angeles, California. Cooper himself contributed over $27,000 to the project, buying an O in the sign in memory of close friend and comedian Groucho Marx. In 1979, Alice also guest starred on good friend Soupy Sales' show, \"Lunch with Soupy Sales\" and was hit in the face with a pie, as part of the show ... when asked about the experience, Alice had this to say about his pal: \"Being from Detroit, I came home every day and watched Soupy at lunch (Lunch With Soupy Sales). One of the greatest moments of my life was getting pie-faced by Soupy. He was one of my all time heroes.\""]}, {"page": "Moulin Rouge!", "response": ["* \"Your Song\" by Elton John – Elton John and Bernie Taupin"]}, {"page": "Jon Anderson", "response": ["After returning to London in March 1968, Anderson met Jack Barrie, owner of the La Chasse drinking club in Soho who befriended the rest of the Warriors after they had relocated to the city. With no money or accommodation, Barrie allowed Anderson and Warriors keyboardist and vocals Brian Chatton to stay with him. Anderson helped out by working at La Chasse; during this time he got talking to Paul Korda, a producer for EMI Records who took him on to sing several demos. During the search for material to record, Barrie got in touch with Elton John and Bernie Taupin of DJM Records to put some music together, but felt Anderson did not like much of it. Meanwhile, Anderson travelled to the Netherlands to join Les Crunches, a band he met in London, but promptly returned when he found out some of his demos were to be released as singles by Parlophone Records. Released under his pseudonym Hans Christian, the first, an orchestrated cover of \"Never My Love\" by the Association with \"All of the Time\" on its B-side, received a positive reception from New Musical Express and Chris Welch for Melody Maker who wrote in March 1968, \"A blockbuster of a hit from a young fairy tale teller with an emotion packed voice.\" Anderson's second single, \"(The Autobiography of) Mississippi Hobo\"/\"Sonata of Love\", was released two months later; neither song was successful. Barrie and Korda then took Anderson to see local group the Gun and together rehearsed for well received gigs at the UFO and Marquee clubs in London, the latter as an opener for the Who, which led to several gig offers. However, the rest of the group believed they could reach success without a lead vocalist and sacked Anderson."]}, {"page": "The Vampire Lestat", "response": ["The novel formed the basis for the short-lived 2006 Broadway show Lestat. The musical, which was composed by Elton John and Bernie Taupin and written by Linda Woolverton, had a pre-Broadway tryout in California in late 2005 and ran for a total of 33 previews and 39 official performances at the Palace Theater in New York.Lestat at the Internet Broadway Database"]}, {"page": "Christmas music", "response": ["* 1973: \"Step into Christmas\", written by Elton John and Bernie Taupin; released by John as a stand-alone single."]}]}}