{"wiki_id": "http://www.wikidata.org/entity/Q3538320", "itemLabel": "Trefor Goronwy", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Trefor_Goronwy", "wikipedia_page": {"main": "Trefor Goronwy is a vocalist, bass guitarist, guitarist, and percussionist. He joined This Heat for their final European tour in 1982, and continued to work with drummer Charles Hayward and soundman Stephen Rickard in the group Camberwell Now. He has also worked as a sound technician with groups such as Pere Ubu, Towering Inferno, David Thomas and Two Pale Boys, Spearmint, Momus and the Tuvan throat-singing ensemble Huun-Huur-Tu, whose first album he recorded in London. After several years spent in Russia, he has recently been working on recordings featuring Tuvan and Kazakh traditional instruments, particularly the igil and kobyz.", "link_mentions": [{"page": "This Heat", "response": ["This Heat split up in 1982 after completing their final European tour with bassist-vocalist Trefor Goronwy and keyboardist Ian Hill joining Bullen and Hayward. Hayward went on to form Camberwell Now with Goronwy and Stephen Rickard, and remains musically active. Bullen had a solo venture called Lifetones, and released one record, For a Reason, in 1983 on his Tone of Life imprint and in 1998 released the album Internal Clock under the name Circadian Rhythms. Williams later formed Flaming Tunes with Mary Currie and released a cassette of material, which was later released on CD."]}, {"page": "Charles Hayward (musician)", "response": ["In 1976, Hayward and fellow Charles Bullen began practising with bassist Gareth Williams under the name This Heat. They began to experiment with tape loops, found sounds and keyboards on several sessions (recorded from 1976 to 1978, but not released until 1979). Finally, in 1979, This Heat released their self-titled debut album.  1981's Deceit marked the final new album from This Heat, Williams leaving just after its release. While Bullen began working as a studio engineer, Hayward did sessions for Lora Logic, The Raincoats and Everything but the Girl before forming Camberwell Now with bassist Trefor Goronwy and tape manipulator Stephen Rickard. The trio released 2 eps Meridian, Greenfingers and 1 album The Ghost Trade through the Swiss Recommended label. "]}, {"page": "Kobyz", "response": ["In the 1930s, when the first folk instrument orchestras were established in the Soviet republic of Kazakhstan, a new kind of kobyz came into existence. It now had four metallic strings and thus became closer to a violin. Such a modernized kobyz can be used to play both Kazakh music and the most complicated works of violin literature. One of the few western musicians to use the kobyz is Trefor Goronwy.", "*Trefor Goronwy"]}, {"page": "Camberwell Now", "response": ["Camberwell Now were formed out of the remnants of This Heat by drummer and vocalist Charles Hayward, bassist and vocalist Trefor Goronwy, who had joined This Heat to replace Gareth Williams after the latter had quit the band, and This Heat's former sound technician Stephen Rickard, who employed field recordings and tape effects. Saxophonist Maria Lamburn joined the group in 1985."]}]}}