{"wiki_id": "http://www.wikidata.org/entity/Q3531562", "itemLabel": "John Dixon", "itemDescription": "English cricketer for Nottinghamshire (1861-1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Dixon_(English_sportsman)", "wikipedia_page": {"main": "John Auger Dixon (27 May 1861 – 8 June 1931) was an English sportsman who captained Nottinghamshire at first-class cricket and represented the England national football team.\nDixon was a member of the Nottinghamshire which dominated county cricket from 1882 to 1886. He had his best year with the bat in 1897 when he made 1100 runs at 44.00, the only time he would pass 1000 runs in a season. Amongst those runs was his highest first-class score of 268 not out, which he made opening the batting against Sussex at Trent Bridge. Dixon declared once he had passed Arthur Shrewsbury's Nottinghamshire record of 267 with the team score at 448/7 and they won by an innings.A right-hander, he was captain of Nottinghamshire when they shared the Championship in 1889 with Surrey and Lancashire. The following season, he captained his county to an innings and 26 runs win over the touring Australians and in the same season he also put in a memorable all-round performance against Leicestershire when he scored an unbeaten 126 and took nine wickets for the match. He remained captain until 1899. Dixon was also a useful part-time medium pacer and in 1900 took a career best season tally of 37 wickets at 23.89.He represented England at his only international on 14 March 1885 when they drew 1–1 with Wales at Leamington Road, Blackburn. Dixon, a left-winger, played his club football for both Notts County and the Corinthians during the 1880s.", "link_mentions": [{"page": "John Dixon", "response": ["John Dixon may refer to:", "*John Dixon (English sportsman) (1861–1931), Nottinghamshire cricketer and international footballer", "*John Dixon (rugby league), Australian rugby league footballer and coach", "*John Dixon (Australian rules footballer) (1887–1947), Australian rules footballer ", "*John Dixon (1785–1857), Member of Parliament for Carlisle, England, 1847–1848", "*John Dixon (Welsh politician) (born 1951), Welsh politician and member of Plaid Cymru", "*John Dixon (Wisconsin politician) (1853–1938), American businessman and politician", "*John Dixon (trade unionist) (1828–1876), British trade unionist", "*John Dixon (bishop) (1888–1972), Canadian clergyman, Anglican Bishop of Montreal, 1943–1960", "*John Dixon (cartoonist) (1929–2015), Australian comic book artist", "*John Dixon (engineer) (c. 1795–1865), railway civil engineer", "*John Dixon (engraver) (1740?–1811), Irish mezzotint engraver", "*John Dixon (judge), Australian judge", "*John Dixon (filmmaker) (died 1999), Australian screenwriter and director", "*John Dixon (As the World Turns), fictional character on the American TV soap opera As the World Turns"]}, {"page": "List of English cricket and football players", "response": ["| John Dixon"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* John Dixon (1888–1898)"]}, {"page": "John Auger Dixon", "response": ["#REDIRECT John Dixon (English sportsman)"]}]}}