{"wiki_id": "http://www.wikidata.org/entity/Q354335", "itemLabel": "Harrison Birtwistle", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Harrison_Birtwistle", "wikipedia_page": {"main": "Sir Harrison Birtwistle,  (born 15 July 1934) is a British composer of contemporary classical music. Among his many compositions, he is best known for The Triumph of Time (1972) and his operas, particularly The Mask of Orpheus (1986), Gawain (1991) and The Minotaur (2008). The latter was ranked by music critics at The Guardian in 2019 as the third best piece of the 21st-century.", "link_mentions": [{"page": "Accrington", "response": ["*Harrison Birtwistle, composer"]}, {"page": "July 15", "response": ["*1934 – Harrison Birtwistle, English composer and academic"]}, {"page": "John Harrison", "response": ["In 1998, British composer Harrison Birtwistle wrote the piano piece \"Harrison's clocks\" that contains musical depictions of Harrison's various clocks. Composer Peter Graham's piece Harrison's Dream is about Harrison's forty-year quest to produce an accurate clock. Graham worked simultaneously on the brass band and wind band versions of the piece, which received their first performances just four months apart, in October 2000 and February 2001 respectively."]}, {"page": "Karlheinz Stockhausen", "response": ["Amongst British composers, Sir Harrison Birtwistle readily acknowledges the influence of Stockhausen's Zeitmaße (especially on his two wind quintets, Refrains and Choruses and Five Distances) and Gruppen on his work more generally. Brian Ferneyhough says that, although the \"technical and speculative innovations\" of Klavierstücke I–IV, Kreuzspiel and Kontra-Punkte escaped him on first encounter, they nevertheless produced a \"sharp emotion, the result of a beneficial shock engendered by their boldness\" and provided \"an important source of motivation (rather than of imitation) for my own investigations\". While still in school, he became fascinated upon hearing the British première of Gruppen, and listened many times to the recording of this performance, while trying to penetrate its secrets—how it always seemed to be about to explode, but managed nevertheless to escape unscathed in its core—but scarcely managed to grasp it. Retrospectively, it is clear that from this confusion was born my interest for the formal questions which remain until today. Although it eventually evolved in a direction of its own, Ferneyhough's 1967 wind sextet, Prometheus, began as a wind quintet with cor anglais, stemming directly from an encounter with Stockhausen's Zeitmaße. With respect to Stockhausen's later work, he said, I have never subscribed (whatever the inevitable personal distance) to the thesis according to which the many transformations of vocabulary characterizing Stockhausen's development are the obvious sign of his inability to carry out the early vision of strict order that he had in his youth. On the contrary, it seems to me that the constant reconsideration of his premises has led to the maintenance of a remarkably tough thread of historical consciousness which will become clearer with time. ... I doubt that there has been a single composer of the intervening generation who, even if for a short time, did not see the world of music differently thanks to the work of Stockhausen. In a short essay describing Stockhausen's influence on his own work, Richard Barrett concludes that \"Stockhausen remains the composer whose next work I look forward most to hearing, apart from myself of course\" and names as works that have had particular impact on his musical thinking Mantra, Gruppen, Carré, Klavierstück X, Inori, and Jubiläum."]}, {"page": "Manchester", "response": ["Manchester has two symphony orchestras, the Hallé and the BBC Philharmonic, and a chamber orchestra, the Manchester Camerata. In the 1950s, the city was home to a so-called \"Manchester School\" of classical composers, which was composed of Harrison Birtwistle, Peter Maxwell Davies, David Ellis and Alexander Goehr. Manchester is a centre for musical education: the Royal Northern College of Music and Chetham's School of Music. Forerunners of the RNCM were the Northern School of Music (founded 1920) and the Royal Manchester College of Music (founded 1893), which merged in 1973. One of the earliest instructors and classical music pianists/conductors at the RNCM, shortly after its founding, was the Russian-born Arthur Friedheim, (1859–1932), who later had the music library at the famed Peabody Institute conservatory of music in Baltimore, Maryland, named after him. The main classical music venue was the Free Trade Hall on Peter Street until the opening in 1996 of the 2,500 seat Bridgewater Hall."]}, {"page": "Minotaur", "response": ["* The Minotaur, an opera by Harrison Birtwistle."]}, {"page": "Oboe", "response": ["* Harrison Birtwistle, An Interrupted Endless Melody, for oboe and piano (1991)", "* Harrison Birtwistle, Pulse Sampler, for oboe and claves (1981)"]}, {"page": "Opera", "response": ["In the 20th century, English opera began to assert more independence, with works of Ralph Vaughan Williams and in particular Benjamin Britten, who in a series of works that remain in standard repertory today, revealed an excellent flair for the dramatic and superb musicality. More recently Sir Harrison Birtwistle has emerged as one of Britain's most significant contemporary composers from his first opera Punch and Judy to his most recent critical success in The Minotaur. In the first decade of the 21st century, the librettist of an early Birtwistle opera, Michael Nyman, has been focusing on composing operas, including Facing Goya, Man and Boy: Dada, and Love Counts. Today composers such as Thomas Adès continue to export English opera abroad.Oxford Illustrated History of Opera, Chapters 1, 3 and 9. The Viking Opera Guide articles on Blow, Purcell and Britten."]}, {"page": "Saxophone", "response": ["* Panic for alto saxophone, jazz drum kit, winds and percussion (1995)—Harrison Birtwistle"]}, {"page": "Sir Gawain and the Green Knight", "response": ["Sir Gawain and the Green Knight was adapted into an opera called Gawain by Harrison Birtwistle, first performed in 1991. Birtwistle's opera was praised for maintaining the complexity of the poem while translating it into lyric, musical form. Another operatic adaptation is Lynne Plowman's Gwyneth and the Green Knight, first performed in 2002. This opera uses Sir Gawain as the backdrop but refocuses the story on Gawain's female squire, Gwyneth, who is trying to become a knight. Plowman's version was praised for its approachability, as its target is the family audience and young children, but criticised for its use of modern language and occasional preachy nature."]}, {"page": "United Kingdom", "response": ["Various styles of music are popular in the UK, including the indigenous folk music of England, Wales, Scotland and Northern Ireland. Exceptional Renaissance and Baroque composers from the 16th and 17th centuries include Thomas Tallis, William Byrd, Orlando Gibbons, John Dowland, Henry Purcell and Thomas Arne. After moving to London under the reign of Qeen Anne, George Frideric Handel became a naturalised British citizen in 1727, when he composed the anthem Zadok the Priest for the coronation of George II; it became the traditional ceremonial music for anointing all future monarchs. Many of Handel's best-known works, such as Messiah, were written in the English language. Notable 19th- and 20th-century British composers include Edward Elgar, Hubert Parry, Gustav Holst, Arthur Sullivan (most famous for working with the librettist W. S. Gilbert), Ralph Vaughan Williams, William Walton, Michael Tippett and Benjamin Britten, pioneer of modern British opera. Harrison Birtwistle is one of the foremost living composers."]}, {"page": "1934", "response": ["** Harrison Birtwistle, British composer"]}, {"page": "Aria", "response": ["The word is sometimes used in contemporary music as a title for instrumental pieces, e.g. Robin Holloway's 1980 'Aria' for chamber ensemble.Boosey and Hawkes  website, accessed 21 March 2013 or Harrison Birtwistle's brass band piece, 'Grimethorpe Aria' (1973)."]}, {"page": "List of prominent operas", "response": ["* 1968 Punch and Judy (Harrison Birtwistle). Birtwistle's first opera was commissioned by the English Opera Group."]}, {"page": "Lancashire", "response": ["More recent Lancashire-born composers include Hugh Wood (1932– Parbold), Sir Peter Maxwell Davies (1934–2016, Salford), Sir Harrison Birtwistle (1934–, Accrington), Gordon Crosse (1937–, Bury),John McCabe (1939–2015, Huyton), Roger Smalley (1943–2015, Swinton), Nigel Osborne (1948–, Manchester), Steve Martland (1954–2013, Liverpool), Simon Holt (1958–, Bolton) and Philip Cashian (1963–, Manchester)."]}, {"page": "Pierre Boulez", "response": ["His time with the BBC Symphony Orchestra was altogether happier. With the resources of the BBC behind him, he could be bolder in his choice of repertoire. There were occasional forays into the nineteenth century, particularly at the Proms (Beethoven's Missa solemnis in 1972; the Brahms German Requiem in 1973),Vermeil, 205 and 209. but for the most part he worked intensively with the orchestra on the music of the twentieth century. He conducted works by the younger generation of British composers—such as Harrison Birtwistle and Peter Maxwell Davies—but Britten and Tippett were absent from his programmes.Vermeil, 205, 209, 211 and 216. His relations with the musicians were generally excellent.Glock, 135; Kenyon, 391–95. He was chief conductor between 1971 and 1975, continuing as chief guest conductor until 1977. Thereafter he returned to the orchestra frequently until his last appearance at an all-Janáček Prom in August 2008."]}, {"page": "Paul Klee", "response": ["* Harrison Birtwistle: Carmen Arcadiae Mechanicae Perpetuum (The Perpetual Song of Mechanical Arcadia) (1977), for orchestra"]}, {"page": "Michael Nyman", "response": ["In 1969, Nyman provided the libretto of Harrison Birtwistle's opera Down by the Greenwood Side and directed the short film Love Love Love (based on, and identical in length to, the Beatles' \"All You Need Is Love\"Pwyll ap Siôn The Music of Michael Nyman. Burlington, Vermont: Ashgate Publishing, 2007. p. 83) before settling into music criticism, where he is generally acknowledged to have been the first to apply the term \"minimalism\" to music (in a 1968 article in The Spectator magazine about the English composer Cornelius Cardew). He wrote introductions for George Frideric Handel's Concerti grossi, Op. 6 and interviewed George Brecht in 1976.. His 1976 album Decay Music was produced by Brian Eno."]}, {"page": "Aldeburgh Festival", "response": ["Thomas Adès was succeeded as Artistic Director of the Festival by Pierre-Laurent Aimard in 2009. In 2009, a suite of new spaces at Snape Maltings, including the Hoffmann Building's Britten Studio and the Jerwood Kiln Studio, was opened with the premiere performance of Harrison Birtwistle's The Corridor (opera).", "The centenary of Britten's birth was held between November 2012 and November 2013,BBC News. Retrieved 7 March 2019. and the 2013 Festival, the 66th, featured a new production by Tim Albery of Britten's opera, Peter Grimes, the complete Church Parables in Orford Church, and new works by Harrison Birtwistle, Wolfgang Rihm, Judith Weir, Magnus Lindberg and Richard Rodney Bennett.", "The Aldeburgh Festival retains a unique character, largely due to its location in rural Suffolk. It also continues to emphasise the presentation of new music, new interpretations and the rediscovery of forgotten music. It has seen the premieres of several works by Britten (A Midsummer Night's Dream in 1960; Death in Venice in 1973) and also Harrison Birtwistle's Punch and Judy in 1968, The Io Passion in 2004, The Corridor in 2009 and The Cure in 2015."]}, {"page": "Gawain", "response": ["The character has appeared in a number of stage productions and operas, mostly interpretations of Sir Gawain and the Green Knight. Particularly notable among them is the 1991 opera Gawain, with music by Harrison Birtwistle and a libretto by David Harsent.Windeatt, pp. 373–83. Gawain also appears in video games, including as the protagonist of Chronicles of the Sword. He is voiced by Takahiro Mizushima in Fate/EXTRA and its sequel Fate/EXTRA CCC, as well as in Fate/Grand Order. In Sonic and the Black Knight (2009), Sir Gawain is one of the main characters, based on Knuckles the Echidna. He also featured in the video game Age of Empires II: The Age of Kings as a cavalier."]}, {"page": "Decca Records", "response": ["Between 1973 and 1980, Decca championed new music through its Headline imprint. Works given their recorded premiere included pieces by Peter Maxwell Davies, Harrison Birtwistle, Luciano Berio, Hans Werner Henze, Witold Lutoslawski, Toru Takemitsu, David Bedford, Thea Musgrave, Andrzej Panufnik, Iannis Xenakis, Brian Ferneyhough and John Cage. Performers included Roger Woodward, Stomu Yamash'ta, Salman Shukur, the Grimethorpe Colliery Band as well as the composers themselves."]}, {"page": "Simon Rattle", "response": ["His first Prom at the Royal Albert Hall, conducting the London Sinfonietta, was, according to the BBC Proms Archive website, on 9 August 1976. The programme included Harrison Birtwistle's Meridian and Arnold Schoenberg's First Chamber Symphony. In 1977 he became assistant conductor of the Royal Liverpool Philharmonic."]}, {"page": "BBC Symphony Orchestra", "response": ["Glock was well known as a proponent of music of the Second Viennese School and their successors; earlier in his career he had been dismissed as music critic of The Observer for such views as \"no great composer has ever cared how 'pleasant' his music sounds\".Kenyon, p. 289 Under his administration, the BBC SO gave world premieres of works by composers including Roberto Gerhard, Peter Maxwell Davies and Michael Tippett, and UK premieres of works by, among others, Luciano Berio, Boulez and Edgard Varèse.Cox, pp. 283–293 and \"History of the Orchestra – 1960s\", BBC Symphony Orchestra. Retrieved 30 July 2012 The policy of commissioning works, and giving UK premieres of new compositions was continued under Glock's successors. World or UK premieres in the 1970s included works by Elliott Carter, György Ligeti, Witold Lutosławski, Olivier Messiaen, Luigi Nono, Arvo Pärt and Karlheinz Stockhausen.\"History of the Orchestra – 1970s\", BBC Symphony Orchestra. Retrieved 30 July 2012 BBC commissions premiered by the BBC SO in the 1980s included Alfred Schnittke's Second Symphony, Harrison Birtwistle's Earth Dances, and John Tavener's The Protecting Veil.\"History of the Orchestra – 1980s\", BBC Symphony Orchestra. Retrieved 30 July 2012"]}, {"page": "Oresteia", "response": ["In 1981, Sir Peter Hall directed Tony Harrison's adaptation of the trilogy in masks in London's Royal National Theatre, with music by Harrison Birtwistle and stage design by Jocelyn Herbert. In 1999, Katie Mitchell followed him at the same venue (though in the Cottesloe Theatre, where Hall had directed in the Olivier Theatre) with a production which used Ted Hughes' translation. In 2015, Robert Icke's production of his own adaptation was a sold out hit at the Almeida Theatre and was transferred that same year to the West End's Trafalgar Studios. Two other productions happened in the UK that year, in Manchester and at Shakespeare's Globe."]}, {"page": "The Proms", "response": ["* Harrison Birtwistle (75th birthday)", "The music of Frank Bridge also received a particular non-anniversary-related focus.  Other notable performances included the first Proms performance of Havergal Brian's Symphony No. 1 ('The Gothic'), which was also the 6th live performance ever, and subsequently released on a Hyperion commercial recording. The 2011 Proms season also featured new works by Sally Beamish, Harrison Birtwistle, Peter Maxwell Davies, Pascal Dusapin, Graham Fitkin, Thomas Larcher, Kevin Volans, Judith Weir, and Stevie Wishart.", "Composers having special attention included Sir Harrison Birtwistle, Sir Peter Maxwell Davies (both celebrating their 80th birthdays in 2014), William Walton, and Richard Strauss."]}, {"page": "1969 in music", "response": ["**A Garland for Dr. K., a celebratory collection in honour of the 80th birthday of Alfred Kalmus, consisting of eleven compositions by David Bedford, Harrison Birtwistle,  Richard Rodney Bennett, Luciano Berio,  Pierre Boulez, Cristóbal Halffter, Roman Haubenstock-Ramati,  Henri Pousseur, Bernard Rands, Karlheinz Stockhausen, and Hugh Wood is performed at the Queen Elizabeth Hall in the Southbank Centre, London, on a programme that also featured the word premieres of Eight Songs for a Mad King by Peter Maxwell Davies and Linoi II by Birtwistle."]}, {"page": "1964 in music", "response": ["*Harrison Birtwistle"]}, {"page": "1977 in music", "response": ["*Harrison Birtwistle – Silbury Air"]}, {"page": "1979 in music", "response": ["* Harrison Birtwistle – ... agm ..., for sixteen voices and three instrumental ensembles"]}, {"page": "1986 in music", "response": ["*Harrison Birtwistle's opera The Mask of Orpheus is premiered in London, UK on May 21"]}, {"page": "1991 in music", "response": ["*Harrison Birtwistle – Gawain, first performance on 30 May at the Royal Opera House, London"]}, {"page": "1995 in music", "response": ["* Harrison Birtwistle – Panic (premiered at Last Night of the Proms)"]}]}}