{"wiki_id": "http://www.wikidata.org/entity/Q3546587", "itemLabel": "Manchester Black", "itemDescription": "fictional supervillain", "wikipedia_url": "https://en.wikipedia.org/wiki/Manchester_Black", "wikipedia_page": {"main": "Manchester Black is a fictional character in American comic books published by DC Comics, in particular those featuring Superman. He was created by Joe Kelly and Doug Mahnke in Action Comics #775 (March 2001). Introduced as an antihero, the character later becomes a supervillain.", "link_mentions": [{"page": "Lex Luthor", "response": ["Soon after Luthor discovers evidence that leads him to conclude Clark Kent is Superman, the 2001 Our Worlds at War saga begins, in which Topeka, Kansas is destroyed in an attack by the alien Imperiex. Luthor is warned of the impending attack beforehand but alerts no one so Earth can enter a great war and he can prove his leadership to the world. Luthor coordinates the U.S. Army, Earth's superheroes, and a number of untrustworthy alien forces to battle the main villain of the story arc. Although Lex Luthor is able to devise a plan to destroy Imperiex's body, the plan is subsequently hijacked by Brainiac 13, requiring Superman to propose a new plan where Darkseid and Luthor coordinate their efforts to defeat Imperiex by sending him back in time. Following the battle, Superman retrieves Lena and returns her to Lex, advising Luthor to stop trying to be a god and just be a man. Soon afterward, Superman's confronts the telepathic Manchester Black. Realizing Superman is a true hero and therefore true heroism is possible, Black decides to make up for his actions against the Man of Steel and Lois Lane by removing Lex Luthor's knowledge that the Man of Steel is Clark Kent."]}, {"page": "Smallville (comics)", "response": ["** Smallville first appears in the crossover event \"Elseworlds\". In \"Elseworlds,\" a power-swapped Flash and Green Arrow arrive on Earth-38 to enlist the help of Supergirl who is visiting Superman and Lois Lane at the Kent family farm following the arrests of Manchester Black and Agent Liberty. Supergirl and Superman help Flash and Green Arrow work on their swapped powers using the Kent family farm as their location."]}]}}