{"wiki_id": "http://www.wikidata.org/entity/Q3549715", "itemLabel": "Bernadette Farrell", "itemDescription": "British hymnwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernadette_Farrell", "wikipedia_page": {"main": "Bernadette Farrell (born 26 March 1957) is a British hymnographer and composer of Catholic liturgical music. Among her compositions are \"Christ, Be Our Light,” \"Restless Is The Heart,\" \"God, Beyond All Names\" and \"O God, You Search Me.\"", "link_mentions": [{"page": "Dan Schutte", "response": ["* Bernadette Farrell"]}, {"page": "Oregon Catholic Press", "response": ["OCP represents well-known contemporary Catholic liturgical music composers Dan Schutte, and the other members known as the St. Louis Jesuits (Bob Dufford, John Foley, Tim Manion and Roc O'Connor),  Bernadette Farrell, Carey Landry, Michael Joncas, Bob Hurd, Tom Kendzia, and Christopher Walker."]}, {"page": "Bernadette", "response": ["* Bernadette Farrell (born 1957), British hymnographer and composer"]}, {"page": "Contemporary Catholic liturgical music", "response": ["Although musical Mass settings are not as widely used in most mainline Protestant denominations, a number of the more well-known songs have been added to the traditional hymn repertoire of these churches, and appear in many late-20th-century denominational hymnals.  These include compositions such as Bernadette Farrell's \"Christ be our Light\", Dan Schutte's \"Here I Am, Lord\", John Foley's \"One Bread, One Body\", David Haas's \"Blest Are They\", and several of Haugen's pieces including \"All Are Welcome\", \"Gather Us In\", \"Awake, Awake, and Greet the New Morn\", and \"Healer of Our Every Ill\".", "* English Bernadette Farrell, b. 1957 (\"Unless a Grain of Wheat\", \"Christ Be Our Light\")"]}, {"page": "Hymns Ancient and Modern", "response": ["In March 2013 Canterbury Press published Ancient and Modern, so reverting to the original title without the word \"Hymns\", but also subtitled Hymns and Songs for Refreshing Worship, a brand new edition designed for contemporary patterns of worship. It contains 847 items, including some items from Common Praise and Sing Praise, ranging from psalm settings to John L. Bell, Bernadette Farrell, Stuart Townend and others. In 2014 the British organist John Keys completed recordings of organ accompaniments of all the hymns in the book."]}, {"page": "Women composers of Catholic music", "response": ["Some of the women who compose music for the Church are Carol Browning, Jeanne Cotter, Dolores Dufner, Bernadette Farrell, Dolores Hruby, Donna Peña, Anne Quigley, M.D. Ridge, Gigi de Jesus, Suzanne Toolan, Lori True, and Janèt Sullivan Whitaker."]}, {"page": "Farrell (surname)", "response": ["*Bernadette Farrell, English composer"]}, {"page": "Holly Happy Days", "response": ["# \"Peace Child\" (Shirley Murray/Bernadette Farrell)"]}]}}