{"wiki_id": "http://www.wikidata.org/entity/Q3568763", "itemLabel": "William King", "itemDescription": "British physician, philanthropist and co-operator", "wikipedia_url": "https://en.wikipedia.org/wiki/William_King_(physician)", "wikipedia_page": {"main": "William King (17 April 1786 – 19 October 1865) was a British physician and philanthropist from Brighton. He is best known as an early supporter of the co-operative movement through the paper he founded, The Co-operator.\nWilliam King was the son of Rev. John King, a master at Ipswich School, and Elizabeth Sarah (née Bishop). One brother, John, was a writer of legal books, and another, Richard Henry was a naval officer who served under Philip Broke – a former pupil at Ipswich School – during the capture of USS Chesapeake.\nKing was born in Lower Brooke Street, Ipswich, Suffolk, but the family subsequently moved nearby to Witnesham when his father retired to the rectory there in 1798. He was educated at Westminster School in London, and then Peterhouse at the University of Cambridge where he obtained a BA and MA. He subsequently studied at St Bartholomew's Hospital in London and then in France in both Paris and Montpellier before returning to Peterhouse where in 1819 he graduated as a Doctor of Medicine. In 1820 he became a fellow of the Royal College of Physicians.In 1821 he married Mary Hooker, with whom he had at least two children, and he moved to Brighton.By 1827, Robert Owen had taken his ideas of a co-operative movement to the United States. But they were picked up and amplified by King. King founded a co-operative store in Brighton. Then in May 1828 he started a paper, The Co-operator, to promote these ideas. The Co-operator had a wide circulation and a great influence in the emerging movement. Though only published for slightly over two years, the paper served to educate and unify otherwise scattered groups. King's articles in the paper gave the movement some philosophical and practical basis that it had lacked before.\nKing's overriding rationale for the movement is best illustrated by the phrases repeated on the masthead of every issue of The Co-operator:\n\n\"Knowledge and union are power. Power, directed by knowledge is happiness. Happiness is the end of creation.\"However he faced some criticism in other co-operative publications for his views on radical Owenism and stopped publishing the paper in August 1830 and distanced himself from the movement, in part because his views, including his support of Catholic emancipation, were affecting his professional reputation. However, he continued to hold his belief in co-operation and supported later co-operative endeavours.\nKing later worked at the Sussex County Hospital and Brighton Provident Dispensary before retiring in 1861.King lived at 23 Montpelier Road in the Montpelier area of Brighton where he died on 19 October 1865 due to a heart condition. He was buried at Hove Parish Church.", "link_mentions": [{"page": "Ada Lovelace", "response": ["Ada Byron was the only child of poet Lord Byron and mathematician Lady Byron. All of Byron's other children were born out of wedlock to other women. Byron separated from his wife a month after Ada was born and left England forever. Four months later, he commemorated the parting in a poem that begins, \"Is thy face like thy mother's my fair child! ADA! sole daughter of my house and heart?\". He died in Greece when Ada was eight years old. Her mother remained bitter and promoted Ada's interest in mathematics and logic in an effort to prevent her from developing her father's perceived insanity. Despite this, Ada remained interested in him, naming her two sons Byron and Gordon. Upon her death, she was buried next to him at her request. Although often ill in her childhood, Ada pursued her studies assiduously. She married William King in 1835. King was made Earl of Lovelace in 1838, Ada thereby becoming Countess of Lovelace.", "From 1832, when she was seventeen, her mathematical abilities began to emerge, and her interest in mathematics dominated the majority of her adult life. Her mother's obsession with rooting out any of the insanity of which she accused Byron was one of the reasons that Ada was taught mathematics from an early age. She was privately educated in mathematics and science by William Frend, William King,William King, her tutor, and William King, her future husband, were not related. and Mary Somerville, the noted 19th-century researcher and scientific author. In the 1840s, the mathematician Augustus De Morgan extended her \"much help in her mathematical studies\" including study of advanced calculus topics including the \"numbers of Bernoulli\" (that formed her celebrated algorithm for Babbage's Analytical Engine).Thomas J. Misa, \"Charles Babbage, Ada Lovelace, and the Bernoulli Numbers\" in Ada's Legacy: Cultures of Computing from the Victorian to the Digital Age, edited by Robin Hammerman and Andrew L. Russell (ACM Books, 2015), pp. 18–20, . In a letter to Lady Byron, De Morgan suggested that Ada's skill in mathematics might lead her to become \"an original mathematical investigator, perhaps of first-rate eminence.\""]}, {"page": "Cooperative", "response": ["In 1761, the Fenwick Weavers' Society was formed in Fenwick, East Ayrshire, Scotland to sell discounted oatmeal to local workers.Carrell, Severin. Strike Rochdale from the record books. The Co-op began in Scotland. , The Guardian, 7 August 2007. Its services expanded to include assistance with savings and loans, emigration and education. In 1810, Welsh social reformer Robert Owen, from Newtown in mid-Wales, and his partners purchased the New Lanark mill from Owen's father-in-law, David Dale, and proceeded to introduce better labour standards, including discounted retail shops where profits were passed on to his employees. Owen left New Lanark to pursue other forms of cooperative organization and develop coop ideas through writing and lecture. Cooperative communities were set up in Glasgow, Indiana and Hampshire, although ultimately unsuccessful. In 1828, William King set up a newspaper, The Cooperator, to promote Owen's thinking, having already set up a cooperative store in Brighton.\"Dr. William King and the Co-operator, 1828–1830, T. W. MERCER, OL6459685M"]}, {"page": "Robert Owen", "response": ["*William King"]}, {"page": "William King", "response": ["William King may refer to:", "*William King (author) (born 1959), British science fiction author and game designer, also known as Bill King", "*William King (artist) (1925–2015), American sculptor", "*William King (poet) (1663–1712), English poet", "*William King (singer) (born 1949), American singer with the Commodores", "*William King (Canadian politician) (1930–2020), British Columbia politician", "*William King (governor) (1768–1852), American statesman, governor of Maine", "**William King (Simmons), an 1878 marble sculpture", "*William King (Governor of West Florida) (died 1826), American governor of West Florida, 1818–1819", "*William King (Australian politician) (1893–1966), member of the Queensland Legislative Assembly", "*William King (bishop) (1650–1729), Anglican Archbishop of Dublin", "*William King (minister) (1812–1895), Canadian Presbyterian minister and community founder", "*William King (priest) (died 1590), Canon of Windsor", "*William King (physician) (1786–1865), British physician, supporter of cooperative movement", "*William King (engineer) (1851–1929), Scottish engineer", "*William King (geologist) (1809–1886), Irish geologist, first to recognize Homo neanderthalensis as a species", "*William King (GSI) (died 1900), geologist with the Geological Survey of India", "*William King (London cricketer), English cricketer of the 1750s", "*William King (footballer) (1898–1962), Scottish international footballer", "*William King (rugby union) (1890–1937), American rugby union player", "*William King (police officer) (born 1972), former Baltimore police officer sentenced to 315 years in prison", "*William King (St Mary Hall) (1685–1763), English Jacobite academic and writer ", "*William King, 1st Earl of Lovelace (1805–1893), 8th Baron King and 1st Earl of Lovelace", "*William King (merchant) (c. 1785–1861), West Indies merchant and slave owner"]}, {"page": "Ipswich School", "response": ["*William King (1786-1865), Physician, Philanthropist and pioneer of the cooperative movement."]}, {"page": "Worker cooperative", "response": ["Similar early experiments were made in the early 19th century and by 1830 there were several hundred co-operatives. Dr William King made Owen's ideas more workable and practical. He believed in starting small and realized that the working classes would need to set up co-operatives for themselves, so he saw his role as one of instruction.  He founded a monthly periodical called The Co-operator, the first edition of which appeared on 1 May 1828.  This gave a mixture of co-operative philosophy and practical advice about running a shop using cooperative principles.", "* William King"]}, {"page": "Owenism", "response": ["Owen was no theoretician, and the Owenite movement drew on a broad range of thinkers such as William Thompson, John Gray, Abram Combe, Robert Dale Owen, George Mudie, John Francis Bray, Dr William King, and Josiah Warren. These men rooted their thought in Ricardian socialism and the labour theory of value.", "The cooperative ideas of Owen and Combe were further developed by the Brighton doctor, William King, publisher of \"The Co-operator.\" Although the paper was only published for two years between 1827–9, it served to unify the movement."]}]}}