{"wiki_id": "http://www.wikidata.org/entity/Q356583", "itemLabel": "Ronnie Ross", "itemDescription": "Jazz saxophonist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronnie_Ross", "wikipedia_page": {"main": "Albert Ronald Ross (2 October 1933 – 12 December 1991) was a British jazz baritone saxophonist.\nBorn in Calcutta, India, to Scottish parents, Ross moved to England in 1946 and was educated at the Perse School in Cambridge. He began playing tenor saxophone in the 1950s with Tony Kinsey, Ted Heath, and Don Rendell. During his tenure with Rendell, he switched to baritone saxophone. He played at the Newport Jazz Festival in 1958, and formed a group called the Jazz Makers with drummer Allan Ganley that same year. He toured the United States in 1959 and Europe later that year with the Modern Jazz Quartet. From 1961 to 1965 he played with Bill Le Sage, and later with Woody Herman, John Dankworth, Friedrich Gulda, and Clark Terry.\nRoss was a saxophone tutor for a young David Bowie, played baritone saxophone on The Beatles' White Album track, \"Savoy Truffle\", and years later was the baritone sax soloist on the Lou Reed song \"Walk on the Wild Side\", which was co-produced by Bowie. He also had guest appearances as a soloist on several Matt Bianco albums. The 2004 Matt Bianco album, Matt's Mood, contains three songs composed by band member Danny White, that were drawn from demos he and Ross recorded together — including the tribute song \"Ronnie's Samba\".He died, having been diagnosed with cancer, in London, in December 1991, aged 58.", "link_mentions": [{"page": "David Bowie", "response": ["Bowie studied art, music, and design, including layout and typesetting. After Burns introduced him to modern jazz, his enthusiasm for players like Charles Mingus and John Coltrane led his mother to give him a Grafton saxophone in 1961. He was soon receiving lessons from baritone saxophonist Ronnie Ross. He received a serious injury at school in 1962 when his friend George Underwood punched him in the left eye during a fight over a girl. After a series of operations during a four-month hospitalisation, his doctors determined that the damage could not be fully repaired and Bowie was left with faulty depth perception and anisocoria (a permanently dilated pupil), which gave a false impression of a change in the iris' colour, erroneously suggesting he had heterochromia iridum (one iris a different colour to the other); his eye later became one of Bowie's most recognisable features. Despite their altercation, Bowie remained on good terms with Underwood, who went on to create the artwork for Bowie's early albums."]}, {"page": "Lou Reed", "response": ["Reed's commercial breakthrough album, Transformer, was released in November 1972. Transformer was co-produced by David Bowie and Mick Ronson, and it introduced Reed to a wider audience, especially in the UK. The single \"Walk on the Wild Side\" was a salute to the misfits and hustlers who once surrounded Andy Warhol in the late '60s and appeared in his films. Each of the song's five verses describes a person who had been a fixture at The Factory during the mid-to-late 1960s: (1) Holly Woodlawn, (2) Candy Darling, (3) \"Little Joe\" Dallesandro, (4) \"Sugar Plum Fairy\" Joe Campbell and (5) Jackie Curtis. The song's transgressive lyrics evaded radio censorship. Though the jazzy arrangement (courtesy of bassist Herbie Flowers and saxophonist Ronnie Ross) was musically atypical for Reed, it eventually became his signature song. It came about as a result of a commission to compose a soundtrack to a theatrical adaptation of Nelson Algren's novel of the same name; the play failed to materialize. \"Walk on the Wild Side\" was Reed's only entry in the Billboard Hot 100 singles chart, at No. 16."]}, {"page": "The Beatles (album)", "response": ["*Ronnie Ross and Bernard George – baritone sax on \"Savoy Truffle\""]}, {"page": "Dolphin Square", "response": ["British jazz baritone saxophonist Ronnie Ross released the jazz album Cleopatra's Needle (1968), containing its first track titled \"Dolphin Square\", which, according to the sleeve notes, was \"dedicated to a party at which Zoot Sims was present, once held in a flat there ('It must have been a good one, because I don't remember it')\"."]}, {"page": "Transformer (Lou Reed album)", "response": ["*Ronnie Ross – soprano saxophone on \"Goodnight Ladies\"; baritone saxophone on \"Walk on the Wild Side\""]}, {"page": "The Perse School", "response": ["*Ronnie Ross, jazz musician"]}, {"page": "Matt Bianco", "response": ["With the addition of Mark Fisher, the sound changed considerably. Fisher, a keyboardist, composer and studio wizard, contributed a more contemporary sound, compared to that of the early Matt Bianco. The use of synthesizers increased notably: Yamaha's DX-7 can be heard providing the slap bass in most songs, but the choice of noted studio musicians remained consistent with Ronnie Ross being the most prominent example. After the first album with the new line-up, they took a 13-piece band on to a European tour that saw them perform in front of an audience of more than 250,000 attendees in total. Jenni Evans left the group shortly after the recording of the group's self-titled album and was not replaced."]}, {"page": "Mellow Yellow (album)", "response": ["* Ronnie Ross – saxophone (track 1)"]}, {"page": "Walk on the Wild Side (Lou Reed song)", "response": ["The baritone saxophone solo played over the fadeout of the song is performed by Ronnie Ross, who had taught David Bowie to play the saxophone during Bowie's childhood. The backing vocals are sung by Thunderthighs, a vocal group that included Dari Lalou, Karen Friedman, and Casey Synge. Drums were played by Ritchie Dharma using brushes rather than drumsticks."]}, {"page": "Savoy Truffle", "response": ["During the 11 October session, six saxophonists (three baritone and three tenor) performed overdubs, arranged by Thomas. These horn players were all veterans of the British jazz scene and included Art Ellefson and Ronnie Ross. Ken Scott, the Beatles' recording engineer, recalls that Harrison thought the saxophones sounded \"too clean ... too nice\", DVD1: between 1:19:58 and 1:20:20. and so asked that they be treated with heavy distortion. Scott also cites Harrison's curt dismissal of Martin's objections, that the song sounded too \"toppy\", as evidence of the Beatles' growing independence during the making of the White Album – a project in which Martin played a mainly peripheral role. In author Nicholas Schaffner's description, the song's \"beefy horns\" became \"a trademark\" of Harrison's work following the Beatles' break-up in 1970.", "*Ronnie Ross – baritone saxophone"]}, {"page": "Matt's Mood", "response": ["Among the songs on the new album is \"Ronnie's Samba\", a collage of material by the late Ronnie Ross, a legendary baritone saxophonist, who also played on early Matt Bianco material.  The group received permission from Ross' family to utilize some old recordings of Ross' sax playing and weave them into an entirely new tune."]}, {"page": "1991 in British music", "response": ["*12 December – Ronnie Ross, jazz saxophonist, 58"]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Ronnie Ross Quartet", "*Ronnie Ross Quartet", "*Ronnie Ross Quartet with Bill Sage"]}, {"page": "List of jazz saxophonists", "response": ["* Ronnie Ross (1933–1991) (baritone)"]}, {"page": "Andrzej Trzaskowski", "response": ["In 1956, Melomani performed at the Jazz Festival of Sopot, and Trzaskowski was recognized the same year as the best jazz pianist by a Przekrój poll. From 1958, he played together with Jan Ptaszyn Wróblewski in the band Jazz Believers, which performed at the Jamboree music festival. In 1959, Trzaskowski moved permanently to Warsaw, when he soon established his own band, The Wreckers, also composed of Alojzy Musiał, Wojciech Karolak, Roman Dyląg and Andrzej Dąbrowski. The band drew inspiration from the music of Charlie Parker, Dizzy Gillespie, and hard bop, while Trzaskowski modelled on Horace Silver's pianism. The Wreckers debuted at Jamboree 1959. They expanded the following year to include Zbigniew Namysłowski, and performed at the National Philharmonic of Warsaw. At Jamboree 1960, the Trzaskowski's Trio accompanied American jazz saxophonist Stan Getz, and they recorded together the album Stan Getz & Andrzej Trzaskowski Trio in October 1960. At Jamboree 1961, Trzaskowski's Trio and Getz performed with British jazz saxophonist Ronnie Ross."]}, {"page": "Allan Ganley", "response": ["Ganley was born in Tolworth, Surrey, England. A self-taught drummer, in the early 1950s Ganley played in the dance band led by Bert Ambrose. In 1953, he came to prominence as a member of Johnny Dankworth's band. Also in the 1950s, he worked with Derek Smith, Dizzy Reece, Vic Ash, and Ronnie Scott. Towards the end of the decade he was co-leader with Ronnie Ross of a small group known as the Jazzmakers.", "* The Jazz Makers with Ronnie Ross (Atlantic, 1960)", "* Bill Le Sage/Ronnie Ross, The Bill Le Sage/Ronnie Ross Quartet (World Record Club, 1964)"]}, {"page": "Jack Parnell", "response": ["From 1991 until he died, Parnell was part of the Norfolk-based Mike Capocci Trio, with Capocci on piano and Mike Harris on the double bass. They backed saxophonists Johnny Griffin, Ronnie Ross, and Kathy Stobart. In 1994, he took over as the leader of the London Big Band, which comprised some of Britain's leading jazz musicians."]}, {"page": "Peggy Suicide", "response": ["*Ronnie Ross - baritone saxophone on \"You...\""]}, {"page": "Picture Book (Simply Red album)", "response": ["*Ronnie Ross – baritone saxophone on \"Jericho\", \"Sad Old Red\" and \"Heaven\""]}, {"page": "London Warsaw New York", "response": ["* Ronnie Ross – baritone saxophone (8), bass saxophone (9)"]}, {"page": "Dick Morrissey", "response": ["*Portraits (The Music of Harry South) – NYJO (1990) as a guest, along with Ronnie Ross"]}, {"page": "Time and Tide (Basia album)", "response": ["* Ronnie Ross – baritone saxophone"]}, {"page": "Believe You Me", "response": ["*Ronnie Ross - baritone saxophone (9)"]}, {"page": "Terry Smith (guitarist)", "response": ["Twice winner of the Melody Maker Music Polls, Smith spent the early 1960s playing with the Tony Lee Trio, before becoming Scott Walker's musical director and accompanying The Walker Brothers on their Japan tour in 1968. Returning to the UK, he recorded a solo album, Fall Out (1968), which was produced by Scott Walker, and backed by UK jazz musicians of the day such as Kenny Wheeler, Les Condon, Ronnie Ross, Ronnie Stephenson, Gordon Beck, Ron Mathewson, Chris Karan, and Ray Warleigh.  Smith went on to join the US soul singer J.J. Jackson's Greatest Little Soul Band in the Land, with whom he recorded two LPs: The Greatest Little Soul Band in the Land (1969) and J.J. Jackson's Dilemma (1970)."]}, {"page": "Ronnie Stephenson", "response": ["He performed or recorded with Sonny Rollins, Stan Getz, Wes Montgomery, Zoot Sims, Quincy Jones, Paul Gonsalves, Johnny Griffin, Roland Kirk, Gerry Mulligan, Sonny Stitt, Barney Kessel, Benny Golson, Benny Goodman, Nelson Riddle, Ella Fitzgerald, Mel Tormé, Tony Bennett, Ronnie Ross, Stan Tracey, Ted Heath, Dick Morrissey, Terry Smith, Jack Parnell, John Dankworth, Tubby Hayes, Cleo Laine, Kurt Edelhagen, Peter Herbolzheimer, Horst Jankowski, Rolf Kühn, Kenny Clarke, and Victor Feldman, among many others.", "*1968: Ronnie Ross – Cleopatra's Needle"]}, {"page": "Whose Side Are You On?", "response": ["*Ronnie Ross – baritone sax on \"No No Never\", \"Half a Minute\", \"Matt's Mood\", \"Get Out of Your Lazy Bed\", \"Matt's Mood II\" and \"The Other Side\""]}, {"page": "Oxford University Jazz Society", "response": ["In 1963, the OU Jazz Club started the Big Night, initiated by Marcus Wigan on the OU Jazz Club Committee, and hired the entire Johnny Dankworth Big Band for what was a significant financial risk. The controlled capacity of the Carfax Assembly Rooms was strictly observed, and counters were allocated to check people in and out of the dance and performance hall itself during the evening to maintain these numbers. To the regret of the organisers, with a good profit in a queue extending well back through Carfax, the University Proctors arrived and stopped any more tickets being sold. Shortly after Marcus Wigan presented a large cheque for the Big Night, John Dankworth gave a talk to the very different Modern Jazz Club (where Wigan was also on the Committee): the Pat Crumly Quartet, the Ronnie Ross plus Trio and Art Themen plus the Pat Crumly Quartet all presented."]}, {"page": "It's Not Unusual", "response": ["* Ronnie Ross, Bob Efford – tenor sax"]}, {"page": "Matt Bianco (album)", "response": ["Evans would leave Matt Bianco shortly after this album, but Fisher would become a long-term member of the group. Fisher, a keyboardist, composer, and studio wizard, contributed a more contemporary sound compared to the band's earlier work. The use of synthesizers increased notably: Yamaha's DX-7 can be heard providing the slap bass in most songs, but the choice of noted studio musicians remained consistent for this album, with Ronnie Ross being the most prominent example.", "*Ronnie Ross: alto sax on tracks No. 3, #8, and #10; baritone sax on tracks No. 1, #3, No. 4, #5, and No. 9"]}, {"page": "Another Time, Another Place (Bryan Ferry album)", "response": ["* Ronnie Ross – saxophones"]}, {"page": "Bill Le Sage", "response": ["Le Sage's career began in 1945, after he had returned to London after being an evacuee in Sussex, when he led a sextet. He was then a member of army bands while serving with the Royal Signals. He played piano for the Johnny Dankworth Seven in March 1950, but soon switched to vibraphone. He left in 1954 to join the various small groups led by the drummer Tony Kinsey, with whom he stayed until 1961. He then joined baritone sax player Ronnie Ross, with whom he co-led various line-ups until 1966. During this period, Le Sage also played with Kenny Baker's Dozen. He began writing music for television and films.", "* Presenting The Bill Le Sage – Ronnie Ross Quartet (1963)"]}, {"page": "Don Menza", "response": ["* Ronnie Ross, Unforgettable Ronnie Ross (INMUS, 2000)"]}, {"page": "Nite Flights (album)", "response": ["* Ronnie Ross – soprano saxophone"]}, {"page": "Ronnie ross", "response": ["#REDIRECT Ronnie Ross "]}, {"page": "Chris Pyne", "response": ["Other associations in the 1970s include Kenny Wheeler (1969, 1973), John Surman (1970), Philly Joe Jones, Maynard Ferguson, Tony Coe (1976), Bobby Lamb, Ray Premru (1971), Ronnie Ross, Barbara Thompson, John Stevens again (1970–71), Norma Winstone (1971), Dankworth once more (1972), and Alan Cohen (1972). Pyne toured with Gordon Beck in 1982, and was in Surman's Brass Project from 1984 to 1992. Late in his life he played in Charlie Watts's big band."]}, {"page": "Keith Christie", "response": ["Christie was a member of the trombone section of the Ted Heath Orchestra from 1957 until the late 1960s, playing alongside Don Lusher. He also played with drummer Allan Ganley, saxophonists Ronnie Ross and Art Ellefson from 1959–1962 in the Jazzmakers. He toured the U.S. with Vic Lewis in 1960. After a brief reunion with Heath he played with Jimmy Deuchar (1964) and Harry South (1965–66). In 1970–71 he joined Benny Goodman on a tour of Europe. During the 1960s and 1970s, he played with Tubby Hayes, Paul Gonsalves, Ian Hamer, Stan Tracey, Kenny Wheeler, Bobby Lamb and Ray Premru, Phil Seamen, and Tony Kinsey. "]}, {"page": "Ken Moule", "response": ["| Nov 1956 || Ken Moule Arranges For: || align=\"center\"| Jazz at Toad Hall/Ken Moule Arranges For || Leon Calvert, George Chisholm, Dougie Robinson, Don Rendell, Ronnie Ross, Arthur Watts, Allan Ganley || Decca", "| Dec 1956 || Ken Moule Arranges For: || align=\"center\"| Jazz at Toad Hall/Ken Moule Arranges For || Leon Calvert, George Chisholm, Dougie Robinson, Don Rendell, Ronnie Ross, Arthur Watts, Allan Ganley || Decca", "| Jan 1957 || Don Rendell's Jazz Six || align=\"center\"| Don Rendell presents The Jazz Six || Kenny Wheeler, Bert Courtley, Don Rendell, Ronnie Ross, Arthur Watts, Don Lawson || Decca", "| Jan 1958 || Ken Moule's Music || align=\"center\"| Jazz at Toad Hall/Ken Moule Arranges For || Leon Calvert, George Chisholm, Dickie Hawdon, Johnny Scott, Roy Willox, Dougie Robinson, Bob Efford, Ronnie Ross, Bob Edwards, Arthur Watts, Allan Ganley || Decca"]}, {"page": "Tommy Watt", "response": ["Watt was hired as a pianist by Carl Barriteau at age 17, and served in the Royal Air Force during the Second World War. He moved to London following the war, where he played with Ambrose, Harry Roy, and Ken Mackintosh. He teamed up with actor Brian Rix, whom he had met during the war, in 1955 to record a demo, which eventually led to a contract with the BBC. After making appearances behind Matt Monro, Watt was hired by Parlophone for session and arranging work. In 1956 Watt put together his first big band, which played at Quaglino's, a London restaurant. Among his sidemen were Tubby Hayes, Ronnie Ross, Jackie Armstrong, Tommy McQuater, Bert Courtley, and Phil Seamen."]}, {"page": "Indigo (Matt Bianco album)", "response": ["*Ronnie Ross – brass, saxophone"]}, {"page": "John Horler", "response": ["Horler began on piano at age six, and learned jazz from his father, a trumpeter. He studied at the Royal Academy of Music (1963–67), then played with the big bands of Bobby Lamb, Ray Premru, BBC Radio, Dave Hancock, and Maynard Ferguson. He worked with Tommy Whittle for much of the 1970s, Tony Coe later in the decade, Ronnie Ross for several years in the 1980s, Peter King in the late 1980s and early 1990s, and Jimmy Hastings around the same time as King. He led small groups intermittently and accompanied John Dankworth and Kenny Wheeler on record."]}, {"page": "What the Dickens!", "response": ["*Ronnie Ross - baritone sax"]}]}}