{"wiki_id": "http://www.wikidata.org/entity/Q3568897", "itemLabel": "William Pulteney", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Pulteney_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant-General Sir William Pulteney Pulteney,  (18 May 1861 – 14 May 1941) was a British general during the First World War.\n\n", "link_mentions": [{"page": "Black Rod", "response": ["* January 1920 – 14 May 1941: Lieutenant-General Sir William Pulteney"]}, {"page": "III Corps (United Kingdom)", "response": ["Pre-war planning for the British Expeditionary Force (BEF) did not envisage any intermediate headquarters between GHQ and the six infantry divisions. However, on mobilisation the decision was made to conform to the two-division army corps organisation employed by the French armies alongside which the BEF was to operate and corps HQs therefore had to be improvised.Official History 1914 Volume I p. 7. III Corps HQ was formed in France on 31 August 1914 under Sir William Pulteney, taking over 4th Division, part of which had already fought at Le Cateau, and 6th Division, which arrived in early September. It was first engaged in the First Battle of the Marne, and remained on the Western Front throughout the Great War.The British Corps of 1914-1918", "General Officer Commanding: Major-General William Pulteney", "General Officer Commanding: Lieutenant-General Sir William Pulteney", "* August 1914 – February 1918 Lieutenant-General William Pulteney William Pulteney at Oxford Dictionary of National Biography"]}, {"page": "Charles Vane-Tempest-Stewart, 7th Marquess of Londonderry", "response": ["As Captain Castlereagh MP he travelled to northern France in the first weeks of the war and reached Paris on 29 August 1914, having been gazetted ADC to General William Pulteney the previous day. Although a staff officer, Castlereagh immediately saw plenty of fighting and believed he had shot and killed one of the enemy on 2 September 1914.Montgomery Hyde, p 116 In the following months of 1914, Castlereagh extensively witnessed the destruction of war and the terrible suffering of the British wounded. He was promoted to the temporary rank of major in his old regiment on 1 November, and to the substantive rank on the 7th."]}, {"page": "Fourth Army (United Kingdom)", "response": ["* III Corps, commanded by Lieutenant-General Sir William Pulteney."]}, {"page": "Battle of Bazentin Ridge", "response": ["On 1 July, the French Sixth Army and the right wing of the British Fourth Army had inflicted a considerable defeat on the German 2nd Army. From the Albert–Bapaume road north to Gommecourt, the Fourth Army attack had been a disaster, where most of the  casualties were suffered. Against the wishes of Marshal Joseph Joffre, General Sir Douglas Haig abandoned the offensive north of the road to reinforce the success in the south. During the Battle of Albert  the Fourth Army pressed forward south of the road, through several intermediate defensive lines, towards the German second position. The attacks were hampered by supply routes becoming quagmires during rainy periods (lengthening the time for round trips), behind the French XX Corps ( Maurice Balfourier) and the British XIII Corps (Lieutenant-General Walter Congreve), XV Corps (Lieutenant-General Sir Henry Horne) and III Corps (Lieutenant-General William Pulteney)."]}, {"page": "Battle of Flers–Courcelette", "response": ["Planning for the offensive began in August and continued into September, while XIV Corps (Lieutenant-General the Earl of Cavan) was engaged on the right flank and XV Corps (Lieutenant-General John Du Cane) and III Corps (Lieutenant-General William Pulteney) were fighting for Delville and High woods. The attacks on the woods added to the burden on transport, engineer, pioneer and labour units. Repairs to damage caused by German artillery-fire diverted effort from shelter being built for fresh divisions assembling behind the front; communications were improved and new battery positions and headquarters erected, new supply dumps created, water supplies increased and carrying services organised into the ground due to be captured. The Fourth Army chief engineer, Major-General Reginald Buckland, had labour and engineer stores for road and track building and repair brought forward in preference to work on the Fourth Army (General Sir Henry Rawlinson) rear area, which was helped by new railheads at Albert and Fricourt. A broad-gauge line had been pushed up to Maricourt by 10 September and a metre-gauge track was almost as far forward as Montauban."]}, {"page": "Battle of Le Transloy", "response": ["On the right flank of the III Corps (Lieutenant-General William Pulteney) area on the left flank of the Fourth Army, the 47th Division attacked with three battalions of the 141st Brigade and two tanks. The 1/19th London Regiment (1/19th London) got to within  of the German line, was forced under cover by machine-gun fire and waited for the tanks. The tanks drove left along the Flers trenches firing into them and the infantry captured the trenches easily, despite the many earlier casualties. As the support waves consolidated Flers Support Trench, the leading infantry pressed on past Eaucourt L'Abbaye (Eaucourt) and met the New Zealanders at the Le Barque road. The 1/20th London attacked Eaucourt and crossed the Flers trenches after the two tanks has passed by, swept through Eaucourt and gained touch with the 1/19th London. The tanks pressed on but bogged west of Eaucourt; the 1/17th London on the left flank had already been stopped by uncut wire and German machine-gun fire. During a counter-attack by part of II Battalion, Bavarian Reserve Infantry Regiment 17, the tanks were set on fire and abandoned."]}, {"page": "William Pulteney", "response": ["William Pulteney may refer to:", "*William Pulteney (1624–1691), English MP for Westminster", "*William Pulteney, 1st Earl of Bath (1684–1764), British MP for Hedon and Middlesex, Cofferer of the Household", "*William Pulteney, Viscount Pulteney (1731–1763), his son, British MP for Old Sarum and Westminster, Lord of the Bedchamber", "*Sir William Pulteney, 5th Baronet (1729–1805), Scottish lawyer, MP for Cromarty and Shrewsbury", "*William Pulteney (British Army officer) (1861–1941), British general during the First World War"]}, {"page": "W. P. Pulteney", "response": ["#REDIRECT William Pulteney (British Army officer)"]}, {"page": "William Pulteney (Black Rod)", "response": ["#REDIRECT William Pulteney (British Army officer)"]}, {"page": "Order of battle for the Battle of the Somme", "response": ["* III Corps. Corps Commander: Major-General Henry HudsonHart p.164 later replaced by Lieutenant-General Sir William PulteneyHart p.385"]}, {"page": "Battle of Armentières", "response": ["On 11 October, the British III Corps (Lieutenant-General William Pulteney), comprising the 4th and 6th divisions, arrived by rail at St Omer and Hazebrouck and then advanced behind the left flank of II Corps, towards Bailleul and Armentières. II Corps was to advance around the north of Lille and III Corps was to reach a line from Armentières to Wytschaete, with the Cavalry Corps on the left as far north as Ypres. French troops were to relieve the II Corps at Béthune, to move north and link with the right of III Corps but this did not occur. On the northern flank of III Corps, in front of the Cavalry Corps was a line of hills from Mont des Cats to Mt. Kemmel, about  above sea level. Spurs ran south across the British line of advance and Mont des Cats and Flêtre were occupied by  (HKK 4), with the 3rd, 6th and Bavarian Cavalry divisions, based on Bailleul. On 12 October, the British cavalry advanced to make room for III Corps and captured the Mont des Cats at dusk, having made combined attacks by hussars, lancers and a horse artillery battery during the day. Pulteney ordered III Corps to continue the advance on 13 October towards Bailleul, with the 6th Division on the right to move in three columns, on a line towards Vieux Berquin and Merris to the east of Hazebrouck and the 4th Division in two columns towards Flêtre, slightly north-east of Hazebrouck, with the Cavalry Corps advancing to the north east of the Mont des Cats."]}, {"page": "First Battle of Ypres order of battle", "response": ["===III Corps (William Pulteney)==="]}, {"page": "William Pulteney Pulteney", "response": ["#REDIRECT William Pulteney (British Army officer)"]}, {"page": "Football in Uganda", "response": ["An officer of the British Army, Captain William Pulteney, also gave an early stimulus to the development of the football in Uganda while serving with the Uganda Rifles from February 1895 to September 1897."]}, {"page": "Pulteney (surname)", "response": ["* William Pulteney (British Army officer) (1861–1941), British general in World War I", "* William Pulteney, 1st Earl of Bath (1684–1764), British politician"]}, {"page": "Memorial tablets to the British Empire dead of the First World War", "response": ["| Laon Cathedral || Laon || France ||  || William Pulteney ||", "| Soissons Cathedral || Soissons || France ||  – – –  || William Pulteney || "]}, {"page": "1905 Birthday Honours", "response": ["*Lieutenant-Colonel and Brevet Colonel William Pulteney Pulteney, D.S.O., Scots Guards."]}, {"page": "Capture of La Boisselle", "response": ["The British front line from Bécourt to Authuille was held by III Corps (Lieutenant-General William Pulteney) and lay along the forward slope of a low ridge between La Boiselle and Albert, east of Tara and Usna hills, a continuation of the south-west spur from the main Bazentin Ridge, on which Ovillers had been built. In dead ground behind the ridge, field artillery was deployed in rows and artillery observers on the ridge had a perfect view of the German front position. The German position ran along the higher slopes of three spurs, which descend south-west from the main ridge and each trench had an unmistakable white chalk parapet. No man's land varied from  wide, the narrowest part opposite La Boisselle being  (Glory Hole to the British). The right flank of the corps was opposite Fricourt Spur, the centre faced La Boisselle Spur with the village just behind the front line and the left flank was west of Ovillers Spur. Between the spurs were Sausage Valley and Mash Valley, depressions about  wide at their broadest points, making an advance up them vulnerable to crossfire. The spurs were covered by trench networks and machine-gun posts; Thiepval Spur to the north opposite X Corps, overlooked the ground across which the III Corps divisions must advance."]}, {"page": "1930 Birthday Honours", "response": ["* Lieutenant-General Sir William Pulteney, ."]}, {"page": "1917 New Year Honours", "response": ["*Lieutenant-General Sir William Pulteney Pulteney,  "]}, {"page": "Capture of Ovillers", "response": ["The British front line from Bécourt to Authuille was held by III Corps (Lieutenant-General William Pulteney) and lay along the forward slope of a low ridge between La Boisselle and Albert, east of Tara and Usna hills, which was a continuation of the south-west spur from the main Bazentin Ridge on which lay Ovillers. In dead ground behind the ridge, field artillery was deployed in rows and artillery observers watched from positions on the ridge, with a perfect view of the German front position, which ran along the higher slopes of three spurs, which descend south-west from the main ridge, where each trench had a distinct white chalk parapet. No man's land was up to  wide, with the left flank of the corps west of Ovillers Spur. Depressions between the spurs called Mash and Nab valleys were about  wide at their broadest points, which made an advance up them vulnerable to crossfire, from trench networks and machine-gun posts on either side. Thiepval Spur to the north, opposite X Corps, overlooked the ground across which the III Corps divisions must advance."]}, {"page": "Ovillers-la-Boisselle in World War I", "response": ["On the Allied side, the front line from Bécourt to Authuille was held by the British III Corps under Lieutenant-General William Pulteney. In dead ground behind the low ridge between La Boisselle and Albert (see above), field artillery was deployed in rows and the British artillery observers on the ridge had a perfect view of the German front position. The right flank of the III Corps was opposite Fricourt Spur, the centre of the Corps faced La Boisselle Spur (with the village ruins just behind the front line) and the left flank of the Corps was west of Ovillers Spur. Thiepval Spur to the north, opposite the British X Corps, overlooked the ground across which the III Corps divisions must advance."]}, {"page": "List of Knights Commander of the Royal Victorian Order appointed by George V", "response": ["|Sir William Pulteney Pulteney, KCB, KCMG, DSO"]}, {"page": "British Memorial School", "response": ["The school opened on 8 April 1929 with an initial enrolment of 62 children. One of the organisers, Lieutenant General Sir William Pulteney, stated that the school had been built 'because it was believed that these British subjects, unless educated at an English school, would be lost to England'.", "In August 1929 the school was educating 43 boys and 33 girls. This rose to 93 children by October 1929 with a further 16 turned away due to lack of resources. Honorary Secretary of the school Lieutenant-General Sir William Pulteney appealed for donations to help meet the demand for places. King George V took out a £20 annual subscription in support of the school. A sizable donation was made by Sir Charles Wakefield of £500. It was Sir Charles who was the driving force in the preservation of 'Lone Tree Crater' at Spanbroekmolen. The crater left by a British mine was to be preserved as a 'pool of peace'. A further £500 pounds was given annually by the War Graves Commission."]}, {"page": "List of works by Philip de László", "response": ["|200px || Sir William Pulteney || 1917 || Portrait || National Portrait Gallery, London"]}, {"page": "List of Knights Grand Cross of the Royal Victorian Order appointed by George V", "response": ["|Lieutenant-General Sir William Pulteney Pulteney, KCB, KCMG,  KCVO, DSO"]}, {"page": "General Pulteney", "response": ["*William Pulteney (British Army officer) (1861–1941), British Army lieutenant general"]}]}}