{"wiki_id": "http://www.wikidata.org/entity/Q3564547", "itemLabel": "W.I.Z.", "itemDescription": "English music video director", "wikipedia_url": "https://en.wikipedia.org/wiki/W.I.Z.", "wikipedia_page": {"main": "Andrew John \"W.I.Z.\" Whiston (born 4 January 1964) is an English director of films and music videos.", "link_mentions": [{"page": "Holy Wood (In the Shadow of the Valley of Death)", "response": ["\"The Fight Song\" was released as the album's second single on February 19, 2001, in the UK. A remix of the song by Joey Jordison of Slipknot appeared as its B-side. Its music video was directed by Manson and W.I.Z. and sparked controversy for its violent depiction of an American football game between jocks and goths, with NME accusing it of being exploitative of the Columbine tragedy. Manson dismissed the claims as hype, and said: \"I'm trying to show that sports as well as music can be seen as violent, so I chose a traditional black vs white, good vs evil theme for the video.\" Manson appeared on an April 2001 episode of The O'Reilly Factor, where he once again denied that the band's music was responsible for Columbine. Bill O'Reilly argued that \"disturbed kids\" without direction from responsible parents could misinterpret the message of his music as endorsing the belief that \"when I'm dead [then] everybody's going to know me.\" Manson responded:"]}, {"page": "Antichrist Superstar", "response": ["Numerous outtakes and previously unreleased recordings were issued on movie soundtracks throughout 1997. \"Apple of Sodom\" appeared on the Reznor-produced soundtrack to David Lynch's Lost Highway in February. A music video for the song was created in 1996, and also remained unreleased until its director, Joseph Cultice, uploaded it to YouTube in 2009. \"The Suck for Your Solution\" appeared on the soundtrack to the Howard Stern biopic Private Parts, which was also released in February. \"Long Hard Road Out of Hell\", featuring backing vocals from Sneaker Pimps vocalist Kelli Ali, was released on the soundtrack to Spawn in August. The following month, \"Tourniquet\" was issued as the album's second commercial single, and peaked at number 28 on the UK Singles Chart. Its music video was also directed by Sigismondi. W.I.Z. directed the final music video created for Antichrist Superstar: \"Man That You Fear\", whose concept was adapted from the plot of Shirley Jackson's 1948 short story \"The Lottery\", and contained aesthetic and symbolic references to the 1989 Alejandro Jodorowsky film Santa Sangre."]}, {"page": "Forever Delayed", "response": ["| 3|| \"You Love Us\" (Sony Music Version) || Generation Terrorists || W.I.Z.", "| 5|| \"Love's Sweet Exile\" || Generation Terrorists || W.I.Z.", "| 18 || \"Everything Must Go\" || Everything Must Go || W.I.Z.", "| 21 || \"If You Tolerate This Your Children Will Be Next\" || This Is My Truth Tell Me Yours || W.I.Z."]}, {"page": "If You Tolerate This Your Children Will Be Next", "response": ["Wire praised the single's video, directed by W.I.Z.. It features a typical nuclear family but with their eyes, mouths and ears sealed over with a flesh toned applicant. The family seem to exist in a futuristic show room, fashioned into a highly clinical 'home' of sorts. Nicky Wire described the video as \"surreal, mildly disturbing ... with a suffocating feel to it despite its brightness.\" It was the fourth and final video directed by W.I.Z. for the band."]}, {"page": "Love's Sweet Exile", "response": ["The video for the song directed by W.I.Z. is notable for its homoerotic imagery. Nicky Wire and Richey James Edwards are apparently naked while in close contact with each other, while Bradfield is also apparently naked, with an archery target drawn on his chest. The clip was also the first of many by the band to feature a favoured literary quote on screen. In this case, a piece of text credited to Albert Camus herald's the song; \"And then came human beings. They wanted to cling, but there was nothing to cling to\"."]}, {"page": "Stand Inside Your Love", "response": ["The music video of \"Stand Inside Your Love\" is a tribute to the 1891 play Salomé by Oscar Wilde.Band and Director Commentary.  Greatest Hits Video Collection. Billy Corgan created the video's look together with English director W.I.Z. under the heavy influence of original Salomé illustrations by Aubrey Beardsley. The nipple-rubbing fat man sitting on the throne is played by Ken Davitian, better known for his role as Azamat Bagatov in the movie Borat. Corgan's then-girlfriend Yelena Yemchuk played the main character in the video."]}, {"page": "The Smashing Pumpkins – Greatest Hits Video Collection (1991–2000)", "response": ["#\"Stand Inside Your Love\" (Directed by W.I.Z. in Santa Clarita, December 1999) ", "*W.I.Z."]}, {"page": "Flowered Up", "response": ["A Life With Brian contained many of their popular live songs, as well as new versions of the previously released singles. Not long afterwards, Flowered Up released the 13-minute-long single \"Weekender\" on Heavenly, with a video  directed by W.I.Z. starring Lee Whitlock and Anna Haigh. Despite the group's  - and Heavenly's - refusal to compromise on a standard-length edit for radio play (although two \"radio edits\" were circulated, neither really addressed the needs of radio programmers, as one was merely the full-length version but with the two instances of the phrase \"fuck off\" muted, while the other reduced the length of the intro, but still ran for over 12 minutes), the track went on to become their biggest hit, reaching number 20 in the UK Singles Chart. After much-publicised drug problems with some members of the band, and unproductive (and some unreleased) studio work, the band split up. Keyboardist Tim Dorney went on to form Republica."]}, {"page": "Marilyn Manson discography", "response": ["| W.I.Z.", "| W.I.Z. and Marilyn Manson"]}, {"page": "Oasis discography", "response": ["| rowspan=\"2\"| W.I.Z.", "| W.I.Z."]}, {"page": "List of people from Brighton and Hove", "response": ["*W.I.Z., music video director"]}, {"page": "The Smashing Pumpkins discography", "response": ["| W.I.Z."]}, {"page": "Daniel Landin", "response": ["| W.I.Z.", "|W.I.Z.", "|W.I.Z.", "|W.I.Z.", "|W.I.Z."]}, {"page": "Empire (Kasabian song)", "response": ["The music video for \"Empire\" was directed by W.I.Z. with casting by Sorin Tarau, and featured on the DVD single. It portrays the members of Kasabian as troopers of the 11th Hussars Regiment (of the famed Charge of the Light Brigade) during the Crimean War. The video was shot on location outside Bucharest."]}, {"page": "See It in a Boy's Eyes", "response": ["The music video for \"See It in a Boy's Eyes\" was directed by W.I.Z. It was filmed in Cuba and features Jamelia as a soldier in the army and throughout the video, there are scenes of Jamelia and another soldier who are in love but it is clear that they are upset with each other and they refuse to speak. In an interview with the BBC, Jamelia said \"I just wanted it to be different – it would have been so predictable if it was just me in a short skirt, my legs out – and I'm not a predictable person. I was trying to be fresh so that people stay interested in me.\"Newsround interview Jamelia also commented in the same interview, \"It's basically about a relationship where someone doesn't speak about having a problem and you can see that they're upset but they're just not talking. It's an irritating situation so I thought I'd write about it.\" The video won the \"Best Video Award\" at the 2004 MOBO awards."]}, {"page": "God Is in the T.V.", "response": ["#\"Man That You Fear\" (dir. W.I.Z.)"]}, {"page": "Club Foot (song)", "response": ["\"Club Foot\" is a song by English indie rock band Kasabian, featured on their 2004 debut album, Kasabian. It was released on 10 May 2004 in the UK. The video of this song, directed by W.I.Z., is dedicated to Czech student Jan Palach who in 1969 set himself on fire in protest against renewed Soviet suppression of Czechoslovakia. The video also refers to the Soviet government's intervention in the Hungarian Revolution of 1956 on a banner showing the text in Hungarian (Szabad Európa Rádió), which translates as \"Radio Free Europe/Radio Liberty\". The scene with the inspector girl who stands before the tank harks back to the young man who stood in front of the line of tanks in 1989 in Tiananmen Square, which itself has become an icon for resistance."]}, {"page": "Lee Whitlock", "response": ["In 1989, Whitlock played his most notable role, that of Sydney Chaplin, the  elder half-brother  of Charlie Chaplin, in the television movie Young Charlie Chaplin by Bazz Taylor. Further well-known series where he had roles were  Split Ends, EastEnders, Harry Enfield's Television Programme, Lovejoy, Soldier Soldier, Boon, Grange Hill, A Touch of Frost, The Detectives, Silent Witness, McCallum, Casualty, London's Burning, and The Bill. In 2007, he played a policeman in Sweeney Todd: The Demon Barber of Fleet Street which starred Johnny Depp and Helena Bonham Carter. In 1992, Whitlock also starred in the W.I.Z. directed short film for Flowered Up's song \"Weekender\", playing the role of Little Joe."]}, {"page": "Manic Street Preachers discography", "response": ["|W.I.Z."]}, {"page": "Rock Steady (All Saints song)", "response": ["The accompanying music video for \"Rock Steady\" was directed by W.I.Z. and it was released on 30 September 2006; it features the group acting as professional bank robbers. In order to promote the song, All Saints performed \"Rock Steady\" live on various television shows, including Ant & Dec's Saturday Night Takeaway, Popworld and Top of the Pops, and was subsequently performed on their Red Flag Tour (2016) and Testament Tour (2018).", "Weeks of planning went into shooting the music video for \"Rock Steady\" in Cuba: booking flights for all staff, hiring equipment and arranging locations. However, All Saints were not able to sit together in first class travel to Cuba, they either had to \"unacceptably\" go on separate flights or sit in economy class and as a result the shoot for the music video was moved to Bucharest in Romania at the expense of Parlophone Records. It was directed by W.I.Z., who also directed the video for the group's 1998 single \"War of Nerves\". The video was also produced by Laura Kanerick.\"Rock Steady\" maxi-single liner notes. Parlophone Records (2006) It was released exclusively through Yahoo! Launch on 30 September 2006."]}, {"page": "Arctic Monkeys discography", "response": ["| W.I.Z."]}, {"page": "Ken Davitian", "response": ["| W.I.Z."]}, {"page": "Shakira videography", "response": ["| W.I.Z."]}, {"page": "The Angry Mob", "response": ["The video was first shown at 23:00 on 23 July 2007 on Channel 4. It depicts the working-class hen-night culture and culminates in two separate hen parties coming together in a \"gang war\" style fight after they have been banned from a high-class restaurant 'NOBLESSE' at the request of the upper middle-class diners. The diners gather at the window to enjoy the spectacle of the two groups that have turned on each other, however the hens then decide to unite to confront the diners instead. The video was directed by W.I.Z."]}, {"page": "Too Young to Die (song)", "response": ["A music video was shot for \"Too Young to Die\". It was directed by British director W.I.Z. (a.k.a. Andrew John Whiston), and consisted mainly of Jay Kay singing in what appears to be a desert military installation."]}, {"page": "Jamelia discography", "response": ["| W.I.Z."]}, {"page": "Kings of Leon discography", "response": ["| W.I.Z."]}, {"page": "The Fight Song (Marilyn Manson song)", "response": ["The music video for this song, directed by W.I.Z. at Verdugo hills high school football field, depicts the band members performing the song at a violent game of high school football between two fictional teams, \"Holy Wood\" (composed of jocks in white football attire) and \"Death Valley\" (composed of goths and social outcasts in black football attire). The video also features a few subliminal messages; at approximately 2:12, the video briefly replaces the scuffling football players with people fighting with police riot squads, and a Death Valley cheerleader is briefly seen throughout the video repeatedly hacking at a wooden pillar with an axe. Near the end of the video, it begins to rain, and a Death Valley player throws the football at the scoreboard, making it and the goalpost burst into flames. The video ends with the flaming goalpost collapsing forward."]}, {"page": "All Saints discography", "response": ["| W.I.Z.", "| W.I.Z."]}, {"page": "Cradle of Filth discography", "response": ["| W.I.Z."]}, {"page": "Man That You Fear", "response": ["In the music video, directed by W.I.Z., Manson portrays a man who is condemned to die. He is \"chosen\" by a blindfolded child who spins around pointing her finger. When she stops spinning, she removed the blindfold and sees the trailer home that she is pointing to — the home of the condemned. The video features all events of his last day on earth, leading up to his death by stoning in an isolated location of the desert. The procession into the desert involves various strangely dressed characters, including a child wearing a mask in the form of a horse's head and a character waving a stick and dancing in circles."]}, {"page": "Out of Control (The Chemical Brothers song)", "response": ["The music video of the song was directed by W.I.Z.. The video's cast includes actress Rosario Dawson and Michel Brown, and depicts a Mexican conflict between government and Zapatista Army of National Liberation, a revolutionary group that appeared during the 1990s. Then is revealed to be an advertisement for a fictional Coca-Cola-type beverage. The camera pans out to reveal it being displayed in an electronic shop, before the storefront is smashed in and the video ends with shaky night-time footage of violent urban riots, shot on handheld cameras."]}, {"page": "The Chemical Brothers discography", "response": ["| W.I.Z."]}, {"page": "The View from the Afternoon", "response": ["The video is based around a young man in a parka jacket playing the drum part of the song in the middle of a courtyard between blocks of high rise flats. A sequence of surreal elements is interspersed throughout: a schoolgirl walks past wearing plastic devil horns; a running fox; three men trying to attract the attention of the drummer who ignores them; the drummer is fed milk by the schoolgirl and then a brief shot in colour of the man floating on his back in shallow water. The music stops, and it is revealed that his drumming has caused his hands to bleed. Next, there is a shot of a man in the dark wielding a baseball bat, then a brief shot of the moon which appears to explode and then the man in the dark struggling to lift his bat. Finally, the man with the bat comes near to the drummer and is about to strike him, but the audio stops and we see a last shot of the male being showered in what could be rain or the fragments of the moon. The video is perhaps based on the story of the Buddha. He was said to have meditated under a tree for days. While he meditated, devils came to seduce and sabotage him, but he resisted. Seeing the Buddha starve himself in order to attain nirvana, a woman gave him milk to quench his thirst. The video is shot in black and white and was filmed near Park Hill flats in the Arctic Monkeys' native city of Sheffield, directed by W.I.Z. for Factory Films. It was also partially filmed later in the courtyard of Bromyard House, Ledbury Estate in Peckham, South East London. A tattoo of the three intersecting circles sigil adopted by John Bonham, the drummer of Led Zeppelin, can be seen on the man's right wrist."]}, {"page": "Emergency on Planet Earth (song)", "response": ["The accompanying music video for the single was directed by W.I.Z.. It features the members of Jamiroquai on a spaceship, resembling the Sith spaceship from Star Wars: A New Hope, receiving a video message from Kay, who is singing and dancing in the middle of nowhere. The video was published on YouTube in November 2009. It has amassed more than 3.9 million views as of November 2021."]}, {"page": "Kaiser Chiefs discography", "response": ["|W.I.Z."]}, {"page": "Wiz", "response": ["*W.I.Z., Andrew Whiston (born 1964), an English director of films and music videos"]}, {"page": "Massive Attack discography", "response": ["| W.I.Z."]}, {"page": "Mika discography", "response": ["| rowspan=\"2\" |W.I.Z."]}, {"page": "I'm Outta Time", "response": ["The music video for \"I'm Outta Time\" was released in November 2008. Filmed in black and white, it shows Liam Gallagher, the only band member to appear in the clip, on a \"surreal journey through a moon-lit English landscape\". Directed by W.I.Z., it was filmed around Bourton-on-the-Water. At the end of the video, Liam is filmed in a close-up profile shot lying down. This bears resemblance to the back cover artwork for John Lennon's album Imagine. It also resembles the cover of Lennon's 1973 album Mind Games."]}, {"page": "Fire (Kasabian song)", "response": ["The video for \"Fire\" is available to view on the band's website, and is also available for purchase on iTunes. It was directed by acclaimed British director W.I.Z. and portrays a bank robbery gone wrong, with guitars taking the place of firearms. Near the end of this video, when Sergio Pizzorno throws the stolen goods against the wall, the viewer can see that what they have stolen is actually sheets of music. The video is very similar to Judas Priest's \"Breaking the Law\"."]}]}}