{"wiki_id": "http://www.wikidata.org/entity/Q3565892", "itemLabel": "Walter Segal", "itemDescription": "Pioneering English modernist architect and creator of a self-build housing system", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Segal", "wikipedia_page": {"main": "Walter Segal (1907–1985) was an architect who developed a system of self-build housing, the \nSegal self-build method. Based on traditional timber frame methods modified to use standard modern materials, his method eliminates the need for wet trades such as bricklaying and plastering, resulting in a light-weight method which can be built with minimal experience and is ecologically sound. The roofs tend to be flat with many layers of roofing felt, which allows the creation of grass-covered roofs. Foundations are minimal, often just paving slabs, the strength coming from the geometry of their construction. Segal houses have been compared to traditional Japanese houses.", "link_mentions": [{"page": "Colin Ward", "response": ["Most of Ward's works deal with the issue of rural housing and the problems of overpopulation and planning regulations in Britain to which he proposed anarchistic solutions. He was a keen admirer of architect Walter Segal who set up a 'build it yourself' system in Lewisham meaning that land that was too small or difficult to build on conventionally was given to people who with Segal's help would build their own homes. Ward was very keen on the idea of 'build it yourself' having said in response to the proposition of removing all planning laws, 'I don't believe in just letting it rip, the rich get away with murder when that happens. But I do want the planning system to be flexible enough to give homeless people a chance'. In his book Cotters and Squatters, Ward described the historical development of informal customs to appropriate land for housing which frequently grew up in opposition to legally constituted systems of land ownership. Ward described folkways in many cultures which parallel the Welsh tradition of the Tŷ unnos or 'one night house' erected on common land."]}, {"page": "1907 in architecture", "response": ["* Walter Segal, German-born architect, pioneer of self-build methods (died 1985)"]}, {"page": "Horniman Museum", "response": ["The Horniman Museum contains the CUE (Centre for Understanding the Environment) building. This opened in 1996 and was designed by local architects Archetype using methods developed by Walter Segal. The building has a grass roof and was constructed from sustainable materials. It also incorporates passive ventilation."]}, {"page": "Segal", "response": ["*Walter Segal (1907–1985), German-born Romanian architect working in England, who developed a system of self-build housing"]}, {"page": "Monte Verità", "response": ["Anarchist physician Raphael Friedeberg moved to Ascona in 1904, attracting many other anarchists to the area.  Artists  and other famous people attracted to this hill included Hermann Hesse, Carl Jung, Erich Maria Remarque, Hugo Ball, Else Lasker-Schüler, Stefan George, Isadora Duncan, Carl Eugen Keel, Paul Klee, Carlo Mense, Arnold Ehret, Rudolf Steiner, Mary Wigman (at that time still Wiegmann), Max Picard, Ernst Toller, Henry van de Velde, Fanny zu Reventlow, Rudolf von Laban, Frieda and Else von Richthofen, Otto Gross, Erich Mühsam, Walter Segal, Max Weber, Gustav Stresemann,Landmann (1979), p. 59-60 and Gustav Nagel."]}, {"page": "Self-build", "response": ["*Walter Segal"]}, {"page": "Arthur Segal (painter)", "response": ["His son was the architect Walter Segal."]}, {"page": "Meanwood Valley Urban Farm", "response": ["The main building provides administrative rooms for the farm, and meeting rooms for local groups.  It is an example of Walter Segal system of self-build construction which is environmentally-friendly in its use of materials and energy. It is a low-energy building using the principle of solar gain; it has a turf roof and uses a reed bed drainage treatment system. It was officially opened by the Environment Secretary, Michael Meacher and was also visited by Prince Charles in 2002."]}, {"page": "Pete Silver & Will McLean", "response": ["Pete Silver worked for Solon Housing Association in South London with architects such as Patrick Keiller, Edward Cullinan and Walter Segal. He trained at the Architectural Association under Professors John Frazer and Gordon Pask, and became a researcher in the Land Use Research Unit at King's College London, gaining a unique insight into Professor Alice Coleman's ground-breaking, if controversial work, on post-war housing regeneration. Silver recently retired as a director of the Chartered Practice Architects (CPA) Ltd. His current work involves prototyping new structural diagrid frameworks from torsional elastic helixes (patent pending)."]}, {"page": "Buildings and architecture of Brighton and Hove", "response": ["Weatherboarding is uncommon, but there are several examples at Stanmer and Patcham (barns and cottages) and in Meeting House Lane in The Lanes. Nearby, 37a Duke Street—the oldest building on that road—is a \"remarkable\" late 18th-century house with a façade of painted wooden blocks imitating stonework. Timber framing is also rare in the city, but modern self-build schemes at Sea Saw Way, Whitehawk (1993) and Hogs Edge, Bevendean (1997–2000) feature this structural system.  The latter development was built according to Walter Segal's self-build methods and has sustainable features including recycled paper insulation.  Waste House, a conceptual sustainable building within the University of Brighton Faculty of Arts campus in central Brighton, was built between 2012 and 2014.  Nearly 90% of its materials—from the timber-framed structure (made of reclaimed wood from building sites) and exterior walls formed of waste chalk and clay to the household-rubbish insulation (VHS cassettes, toothbrushes and denim offcuts)—were destined for landfill.  The project, which has won several architectural awards, attempts to show how unwanted materials can be used to create a viable and energy-efficient building."]}, {"page": "Ovington Square", "response": ["* The six-storey apartment building #22–26 was built in 1957, and the architect was Walter Segal. Pevsner called it \"a Morris Traveller parked among grander saloons\". In the 1990s, the Twentieth Century Society recommended it for listed building status, but this was rejected."]}, {"page": "British high-tech architecture", "response": ["*Walter Segal (1907–1985) Pioneer of self-build housing to the Segal self-build method", "The mid 1980s saw not only the damning \"is like a monstrous carbuncle on the face of a much-loved and elegant friend\" speech by HRH Charles Prince of Wales, but also the death of several key proponents of British High Tech architecture – amongst which were Buckminster Fuller (1983), Jean Prouvé (1984), Walter Segal (1985) and Reyner Banham (1988), each of whom were significant for their teachings as well as for their building designs."]}]}}