{"wiki_id": "http://www.wikidata.org/entity/Q3569100", "itemLabel": "Willie Pettigrew", "itemDescription": "Scottish footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Pettigrew", "wikipedia_page": {"main": "William Haddow Pettigrew (born 2 October 1953) is a Scottish former footballer, who played as a striker for Motherwell, Dundee United, Hearts, Morton and Hamilton Academical. Pettigrew also represented Scotland and the Scottish League XI.", "link_mentions": [{"page": "Motherwell F.C.", "response": ["Motherwell were immediately promoted back to the First Division in 1969, maintaining a mid-table position. The 18-team First Division was superseded by a new 10-team Premier League for the 1975–76 season, at which time they were managed by Willie McLean and his assistant Craig Brown (who would become manager almost 35 years later). Under their management, Motherwell improved to fourth in the table with players such as Bobby Graham, Willie Pettigrew and Bobby Watson. The most notable cup run of that period was the 1975-76 Scottish Cup where they eliminated Celtic and lost out in the semi-final to Rangers.", "*  Willie Pettigrew"]}, {"page": "Dundee United F.C.", "response": ["*  Willie Pettigrew"]}, {"page": "Ian St John", "response": ["After retiring from playing, St John managed both his former club Motherwell (1973–1974) and Portsmouth (1974–1977, assisted by former Motherwell teammate Willie Hunter). He also served as assistant manager at Sheffield Wednesday and Coventry City. As Motherwell manager, St John sold goalkeeper Keith MacRae and gave a debut to young forward Willie Pettigrew. Motherwell finished ninth in the 1973–74 season, his only term in charge."]}, {"page": "Pettigrew", "response": ["*Willie Pettigrew (born 1953), Scottish football player"]}, {"page": "East Kilbride Thistle F.C.", "response": ["Willie Pettigrew was another player capped at Junior level with Scotland. He would later go on to gain full international honours with Scotland later in his career."]}]}}