{"wiki_id": "http://www.wikidata.org/entity/Q3568617", "itemLabel": "William Forster", "itemDescription": "Premier of New South Wales", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Forster_(Australian_politician)", "wikipedia_page": {"main": "William Forster (16 October 1818 – 30 October 1882) was a pastoral squatter, colonial British politician, Premier of New South Wales from 27 October 1859 to 9 March 1860, and poet.\n\n", "link_mentions": [{"page": "List of English-language poets", "response": ["*William Forster (1818–1882, A)"]}, {"page": "October 30", "response": ["*1882 – William Forster, Indian-Australian politician, 4th Premier of New South Wales (b. 1818)"]}, {"page": "October 16", "response": ["*1818 – William Forster, Indian-Australian politician, 4th Premier of New South Wales (d. 1882)"]}, {"page": "Premier of New South Wales", "response": ["| William Forster(1818–1882)"]}, {"page": "Charles Badham", "response": ["Dr Badham's classical attainments were recognised by the most famous European critics, such as C. G. Cobet, Ludwig Preller, W. Dindorf, F. W. Schneidewin, J. A. F. Meineke, A. Ritschl and Tischendorf; and in Australia, Sir James Martin, William Forster and Sir William Macleay."]}, {"page": "Bundaberg", "response": ["British occupation of the land in the region began in 1848 when pastoral squatters Gregory Blaxland Jnr and William Forster established a sheep station. Blaxland was a son of the Blue Mountains explorer, Gregory Blaxland, and Forster was later to become a Premier of New South Wales. They selected a very large area of land which encompassed most of the western part of the modern day Bundaberg Region along the Burnett River. They named this pastoral lease Tirroan. Blaxland and Forster had previously set up sheep stations near the Clarence River and had a notable history of conflict with Aboriginal people. This continued at Tirroan when two of their shepherds were killed by Aboriginal people in 1849. Forster and Blaxland led a punitive expedition causing multiple Aboriginal deaths. Further conflict occurred the following year when Blaxland was clubbed to death. Forster and a number of other squatters conducted another reprisal, resulting in a large massacre of Aboriginal people in scrubland toward the coastal part of Tirroan. In the early 1850s, Forster sold the property to Alfred Henry Brown who changed the name of the pastoral lease to Gin Gin. At the same time, Native Police officer, Richard Purvis Marshall, took up the Bingera leasehold in the rainforest scrubland downstream from Tirroan. Three towns in the Bundaberg region, Tirroan, South Bingera and Gin Gin, commemorate these massive initial leaseholds."]}, {"page": "Henry Parkes", "response": ["It was not until December 1871 that a seat could be found for him and he was then elected at a by-election for Mudgee. The Martin-Robertson ministry had involved itself in a dispute with the colony of Victoria over a question of border duties, and Parkes effectively threw ridicule on the proceedings. When parliament met, the government was defeated and a dissolution was granted. In the general election which followed in which Parkes was generally recognised as the leader of the opposition, and the ministry was defeated at the polls. When parliament assembled, Parkes (now back representing East Sydney) was elected leader of the opposition. The acting-governor had sent for William Forster before parliament met, but he was unable to form a ministry, and in May 1872 Parkes formed his first ministry which was to last for nearly three years."]}, {"page": "Australian lungfish", "response": ["The small settlement of Ceratodus, Queensland derives its name from that of the Australian lungfish. The species was named in honour of the squatter and politician William Forster."]}, {"page": "Charles Cowper", "response": ["In September 1857, the Parker Government was defeated and resigned, and Cowper became Premier again. This was a ministry of many changes, no fewer than 13 men holding the seven positions in its life of just over two years. In December, his Government lost a vote on a proposal to increase the rents of pastoralists and to levy an assessment on their stock, but this time Governor Denison agreed to call an election, held in January 1858. Cowper did well enough to remain Premier, but he did not have a reliable majority. His Government amended the Electoral Act to provide vote by secret ballot, universal manhood suffrage, representation primarily by population and more equal electoral districts. It also created 40 new municipalities, established district courts and prohibited grants to support public religious activity. At the June 1859 election, Cowper was returned for East Sydney. His government was beaten on a vote on his educational bill on 26 October 1859 and Cowper resigned from the Assembly the next day. William Forster became Premier and John Robertson became leader of the Opposition. In March 1860, Cowper was appointed to a five-year term in the Legislative Council."]}, {"page": "John Black (Canadian judge)", "response": ["Black was a member of the New South Wales Legislative Assembly from 1859 to 1860, representing the seat of East Sydney. He had moved to New South Wales in 1857 and was Chairman of the newly-formed Land League. He was Secretary of Lands from 27 October 1859 to 8 March 1860 in William Forster's administration. He retired from the Assembly in 1860 and returned to England in 1861."]}, {"page": "Coutts Crossing, New South Wales", "response": ["British occupation in the immediate vicinity around Coutts Crossing began in 1840 with the arrival of pastoral squatter William Forster. He set up a sheep station in the area which he named Purgatory due to the high level of Aboriginal resistance he encountered while taking possession of the land. He later changed the name of the station to Geergarow, which is commemorated today in the name of the main road heading west from the township of Coutts Crossing."]}, {"page": "Gin Gin, Queensland", "response": ["Settlement of the region began in 1848 when Gregory Blaxland Jnr (son of the explorer Gregory Blaxland) together with William Forster brought their flocks of sheep up from their squatting leases on the Clarence River. The pastoral run they selected extended all the way to the coast and they called it Tirroan. The modern town of Gin Gin is located close to where the original homestead was constructed. The local Aboriginal people murdered Blaxland in August 1850 and two shepherd boys the year previously. Two large massacres of Aboriginals were conducted by local squatters and their stockmen as punitive measures to these deaths.", "About 1851, Arthur and Alfred Henry Brown bought Tirroan from William Forster and renamed the run Gin Gin. The Brown Brothers previously owned a pastoral property called Gin Gin in Western Australia."]}, {"page": "John Robertson (premier)", "response": ["At five years of age the young Robertson was sent to the new school in Sydney just opened by John Dunmore Lang. He subsequently attended schools kept by Bradley Gilchrist and W. T. Cape. Among his schoolfellows were two other boys also destined to become premiers of New South Wales, James Martin and William Forster. On leaving school about the year 1833 Robertson went to sea and worked his passage to England where, through the medium of some letters of introduction, he accidentally came in contact with Lord Palmerston. The personality of the young man so impressed Palmerston that he invited him to stay with him for a few days in the country. There he introduced him to various distinguished people, and afterwards, when he was leaving England, gave him a letter to the New South Wales governor, Sir Richard Bourke."]}, {"page": "Alexander Stuart (Australian politician)", "response": ["On 8 February 1876 Stuart succeeded William Forster as colonial treasurer in the third ministry led by Sir John Robertson, and held the position until Robertson was defeated in March 1877. Stuart resigned his seat in November 1879 to become agent-general at London but gave up this appointment in April 1880 in order to fend off bankruptcy without having left Sydney. Stuart was returned for Illawarra at the general election in 1880 and became leader of the opposition. In 1882 the Parkes-Robertson ministry was defeated and Stuart became Premier from 5 January 1883 to 6 October 1885. Stuart succeeded in passing a land act in 1884 after much opposition, and other acts dealt with the civil service, fire brigades, the university, and licensing."]}]}}