{"wiki_id": "http://www.wikidata.org/entity/Q3568956", "itemLabel": "William Shield", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Shield", "wikipedia_page": {"main": "William Shield (5 March 1748 – 25 January 1829) was an English composer, violinist and violist.", "link_mentions": [{"page": "March 5", "response": ["*  1748   – William Shield, English violinist and composer (d. 1829)"]}, {"page": "1829", "response": ["* January 25 – William Shield, English violinist, composer (b. 1748)"]}, {"page": "1748", "response": ["** William Shield, English violinist, composer (d. 1829)"]}, {"page": "List of violists", "response": ["* William Shield (1748–1829)"]}, {"page": "Charles Bannister", "response": ["Bannister played in the first productions of several of his friend William Shield's operas, from his early success The Flitch of Bacon at the Little Theatre, Haymarket (as Captain Wilson) in 1778,Griffel, Operas in English, p. 175. through many of his later Covent Garden successes. He was the first Mr Belville in Shield's Rosina (text by Mrs Brooke) in 1782–83, in which Mrs Bannister also appeared:The British Drama, 1824, p. 241. his song \"Her mouth, when a smile\" stuck in his personal repertoire. In 1783 he was Captain Fitzroy in Shield's The Poor Soldier.Griffel, Operas in English, p. 387. In 1784 Robin Hood (text: MacNally) gave Mrs Bannister an air \"The Nightingale\" with oboe obbligato for Parke jnr., and to Charles Bannister the song \"As burns the charger\" with trumpet accompaniment. Bannister and 'Jack' Johnstone's duet \"How sweet in the woodlands\" was richly encored.W. Parke, Musical Memoirs (1830) Vol. 1, p. 33. Parke recalled Bannister singing in Shield's Fontainbleau, or, Our Way in France in 1784, and how he and Johnstone sang duets at a dinner held by Shield soon afterwards.W. Parke, Musical Memoirs (1830) Vol. 1, p. 46. Bannister was also in first performances of Shield's The Farmer (1787), The Highland Reel (1788)Griffel, Operas in English, p. 167, 224. The Crusade and The Czar (both 1790),Griffel, Operas in English, pp. 107, 110. and The Woodman (1791), in the latter with both Johnstone and Incledon.'An Account of the new comedy called The Woodman,' The Lady's Magazine Vol 22 (for 1791), (GGJ and J Robinson, London), pp. 151–53. See also W. Parke, Musical Memoirs (1830), Vol. 1, p. 136.", "He and William Shield, Charles Incledon, Charles Dignum, 'Jack' Johnstone, Charles Ashley and William Parke (oboeist) in 1793 formed themselves into 'The Glee Club', a set which met on Sunday evenings during the season at the Garrick's Head Coffee House in Bow Street, once a fortnight, for singing among themselves and dining together. A project to erect a bust to Dr Thomas Arne, which this group proposed to fund by charitable performances, was vetoed by the management of Covent Garden.W. Parke, Musical memoirs (Richard Bentley, London 1830), p. 175-79."]}, {"page": "Master of the Queen's Music", "response": ["Parsons held the post of Master until 1817, when he was succeeded by William Shield, best known as a theatre composer: he composed or arranged music for at least thirty-six operas and seven pantomimes and ballets.Legge, R. H. \"Shield, William (bap. 1748/9, d. 1829)\", Oxford Dictionary of National Biography, Oxford University Press 2004, retrieved 27 May 2015  Shield's tenure is most notable for the abandonment of the traditional provision of court odes. By custom, the Poet Laureate of the day wrote the words for the odes, a task that the then holder, Robert Southey, found uncongenial. After the death of George III in 1820 the odes were discontinued. The post of Master of the King's Musick continued because George IV maintained the traditional small orchestra, which Shield's successor, Christian Kramer, directed. That remained the chief function of the Master through the tenures of Franz Cramer (Master 1834–48), George Frederick Anderson (Master 1848–70), and Sir William Cusins (Master 1870–93). The last of these produced a few works for royal occasions, including a jubilee cantata, \"Grant the Queen a Long Life\" (1887).Edwards, F. G, rev John Warrack. \"Cusins, Sir William George (1833–1893)\", Oxford Dictionary of National Biography, Oxford University Press 2004, retrieved 27 May 2015 ", "| rowspan=\"2\" | William Shield"]}, {"page": "1829 in music", "response": ["*January 25 – William Shield, violinist and composer (b. 1748)"]}, {"page": "1800 in music", "response": ["* William Shield – An Introduction to Harmony (London: printed for the Author, sold by G. G. & J. Robinson)"]}, {"page": "Gateshead", "response": ["*William Shield – Master of the King's Musick"]}, {"page": "1748 in music", "response": ["*March 5 — William Shield, violinist and composer (died 1829)"]}, {"page": "1791 in music", "response": ["*William Shield – The Woodman"]}, {"page": "1782 in music", "response": ["* William Shield is appointed resident composer to Covent Garden."]}, {"page": "Auld Lang Syne", "response": ["left|thumb|249x249px|William Shield (1748-1829)", "English composer William Shield seems to quote the \"Auld Lang Syne\" melody briefly at the end of the overture to his opera Rosina (1782), which may be its first recorded use. The contention that Burns borrowed the melody from Shield is for various reasons highly unlikely, although they may very well both have taken it from a common source, possibly a strathspey called \"The Miller's Wedding\" or \"The Miller's Daughter\". The problem is that tunes based on the same set of dance steps necessarily have a similar rhythm, and even a superficial resemblance in melodic shape may cause a very strong apparent similarity in the tune as a whole. For instance, Burns' poem \"Comin' Thro' the Rye\" is sung to a tune that might also be based on the \"Miller's Wedding\". The origin of the tune of \"God Save the Queen\" presents a very similar problem and for just the same reason, as it is also based on a dance measure. (See the note in the William Shield article on this subject.)"]}, {"page": "1790 in music", "response": ["*William Shield – Hartford Bridge"]}, {"page": "1785 in music", "response": ["* \"Song of the Page\" music by William Shields from Follies of a Day, or The Marriage of Figaro", "*William Shield –"]}, {"page": "1783 in music", "response": ["*William Shield – The Poor Soldier"]}, {"page": "List of string quartet composers", "response": ["* William Shield (1748–1829): six string quartets (1782)"]}, {"page": "John O'Keeffe (writer)", "response": ["Between 1782 and 1796, O'Keeffe wrote around 28 plays and librettos for comic operas. The Poor Soldier (1783), a comic opera with libretto by O'Keeffe and music by William Shield, was a farce about the lives of British soldiers returning home after the American War of Independence. O'Keeffe also wrote The Son-in-Law, Agreeable Surprise (which includes the lyrical poem Amo, Amas), and The Castle of Andalusia."]}, {"page": "List of Classical-era composers", "response": ["*William Shield (1748–1829)"]}, {"page": "Prince of Coolavin", "response": ["The Princess Royal or Miss 'MacDermot was a tune by the Irish harpist Turlough O'Carolan (1670 – 25 March 1738).  The tune was adopted for the sea shanty The Saucy Arethusa which was performed at the Theatre Royal in London in 1796.  While some attribute The Saucy Aruthesa to the composer William Shield, others have attributed the adaptation to the playwright Prince Hoare."]}, {"page": "Pasticcio", "response": ["In the 18th century, opera pasticcios were frequently made by composers such as Handel, for example Oreste (1734), Alessandro Severo (1738) and Giove in Argo (1739), as well as Gluck, and Johann Christian Bach. These composite works would consist mainly of portions of other composers' work, although they could also include original composition. The portions borrowed from other composers would be more or less freely adapted, especially in the case of arias in pasticcio operas by substituting a new text for the original one. In late 18th-century English pasticcios, for instance by Samuel Arnold or William Shield, the \"borrowed\" music could be Irish or British folksongs."]}, {"page": "Ballad opera", "response": ["A later development, also often referred to as ballad opera, was a more \"pastoral\" form. In subject matter, especially, these \"ballad operas\" were antithetical to the more satirical variety. In place of the rag-bag of pre-existing music found in (for example) The Beggar's Opera, the scores of these works consisted in the main of original music, although they not infrequently quoted folk melodies, or imitated them. Thomas Arne and Isaac Bickerstaffe's Love in a Village, and William Shield's Rosina (1781) are typical examples. Many of these works were introduced as after-pieces to performances of Italian operas."]}, {"page": "Elizabeth Billington", "response": ["A contemporary account of her at this period says that her voice was of great sweetness, compass, and power, and that she possessed 'a great deal of genuine beauty and very unaffected and charming manners;' but the secret of her great success was the unremitting zeal with which she studied her art. Her brother-in-law, Thomas Billington, says that she had originally 'a very indifferent voice and manner,' which she completely changed by the industry with which, throughout her public career, she pursued her studies. At the end of her first season she went to Paris, and had lessons from the Antonio Sacchini, whose last pupil she was, and at different periods of her career she also studied with Morelli, Ferdinando Paer, and Friedrich Heinrich Himmel. She returned to London for the season of 1786–7, and continued to sing there, at Covent Garden, the Concerts of Ancient Music, the so-called Oratorios, and the Handel Commemorations, until the end of 1793. William Shield wrote his operas of 'Marian' and 'The Prophet' for her, and in 1789 she appeared as Yarico in Dr. Arnold's long-popular compilation, 'Inkle and Yarico.' Others of her favourite parts were Mandane (in 'Artaxerxes'), and the heroines in 'Polly,' the 'Duenna,' the 'Castle of Andalusia,' 'Corali,' 'Clara,' the 'Flitch of Bacon'."]}, {"page": "Charles Incledon", "response": ["Thomas Harris heard Incledon at Bath, and engaged him, at first for three years, for Covent Garden. In accepting this offer the tenor narrowly missed a better one – for higher fees and a longer term – made soon afterwards by Thomas Linley. Incledon kept his agreement however, although his experiences with Covent Garden were not always of the happiest. He made a successful debut there in 1790 as Dermont in The Poor Soldier by William Shield, who became a lifelong friend and associate. In February 1791 he appeared in Shield's opera The Woodman, being universally encored in his ballad 'The streamlet', and with Charles Bannister in the same cast singing 'Much more a helpless woman'.W. Parke, Musical Memoirs (1830), vol. 1, p. 136. ", "His friendship and professional involvement with William Shield, from his first days at Covent Garden, set the character of his career. He and Shield, Charles Bannister, Charles Dignum, 'Jack' Johnstone, Charles Ashley and William Parke in 1793 formed themselves into 'The Glee Club', a set which met on Sunday evenings during the season at the Garrick's Head Coffee House in Bow Street, once a fortnight, for singing among themselves and dining together.W. Parke, Musical memoirs (1830), pp. 175–79. Many of Shield's songs were either written for him or were sung by him, with the composer's high approval. Shield said of him that, not only did Incledon's interpretation of the songs he had written for him never disappoint his expectation, but that he often brought a grace, beauty and charm to them which the composer had not imagined to be present in his own work, and that a large share of the popularity of those songs might be credited to Incledon's unrivalled excellence in singing them. Many songs were written for him also by George Baker (1773–1847), the composer and organist of Stafford and Derby, who had been a fellow-pupil of Incledon's under Jackson at Exeter.W.H. Husk, 'Baker, George, Mus. Bac.' in J.A. Fuller Maitland (Ed.), Grove's Dictionary of Music and Musicians, Vol. I (Macmillan & Co., London 1922), pp. 167–68."]}, {"page": "Classical music of the United Kingdom", "response": ["In 1813 the London Philharmonic Society was established, which played an important role in the development of musical life in the kingdom. Founders included Sir George Smart, Johann Baptist Cramer, Muzio Clementi, William Ayrton (musical director of the King's Theatre), William Shield, Henry Bishop, Thomas Attwood (composer and organist of St Paul's Cathedral, and teacher of John Goss), Johann Peter Salomon and Vincent Novello. Under their aegis an annual programme of concerts of international calibre was established. The Society was a commissioning patron of Beethoven's Choral Symphony (No. 9).C. Ehrlich, First philharmonic: a history of the Royal Philharmonic Society (Oxford: Oxford University Press, 1995), pp. 1-36."]}, {"page": "1829 in the United Kingdom", "response": ["* 25 January – William Shield, composer, violinist and violist (born 1748)"]}, {"page": "List of operas by composer", "response": ["*William Shield (1748–1829): The Flitch of Bacon, Rosina"]}, {"page": "Who breaks a butterfly upon a wheel?", "response": ["Another graphic instance of the usage can be found in An Introduction to Harmony by William Shield (1800), wherein he writes: \"Having brought this Introduction to Harmony before that awful Tribunal, the Public, without first submitting it to the inspection of a judicious friend, I shall doubtless merit severe correction from the Critic; but as my attempt has been rather to write a useful Book, than a learned Work, I trust that he will not break a Butterfly upon the wheel for not being able to soar with the wings of an Eagle.\"http://216.129.110.22/files/imglnks/usimg/7/77/IMSLP93456-PMLP192233-Shield_-_Introduction_to_Harmony__1800.pdf"]}, {"page": "Margreta Elkins", "response": ["* Margreta Elkins – The Classic Recordings (1983) ABC 461 922-2 – Rosina (William Shield), Sea Pictures (Edward Elgar), \"The Altar is adorned for the Sacrifice\" from The Growing Castle (Malcolm Williamson); Queensland Symphony Orchestra, Werner Andreas Albert"]}, {"page": "List of people from Gateshead", "response": ["*William Shield – Composer, and Master of the King's Musick"]}, {"page": "Liberty! (album)", "response": ["#\"When Bidden to the Wake or Fair\" (William Shield) – 7:08"]}, {"page": "The Saucy Arethusa", "response": ["The melody to the song has been wrongly attributed to William Shield, who was the musical arranger of The Lock and Key. It is more rightfully known as a piece by the Irish harper and composer Turlough O'Carolan called Miss MacDermott or The Princess Royal."]}, {"page": "Rosina", "response": ["*Rosina (opera), a light opera by the English composer William Shield"]}, {"page": "Robin Hood (disambiguation)", "response": ["* Robin Hood, a 1784 opera, music by William Shield, libretto by L. McNally and E. Lysaght"]}, {"page": "1748 in Great Britain", "response": ["* 5 March – William Shield, violinist and composer (died 1829)"]}, {"page": "English art song", "response": ["* William Shield (1748–1829), made famous the song \"Auld Lang Syne\""]}]}}