{"wiki_id": "http://www.wikidata.org/entity/Q3569257", "itemLabel": "Win Percy", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Win_Percy", "wikipedia_page": {"main": "Winston \"Win\" Percy (born 28 September 1943, near Tolpuddle, Dorset) is a former motor racing driver from England. Percy was British Touring Car Champion three times, and at the time of his retirement was the most successful non-Antipodean driver ever to compete in Australia's premier national motorsport event, the Bathurst 1000km. Joe Saward of Autosport magazine said he was \"often regarded as the World's Number One Touring Car Driver\".", "link_mentions": [{"page": "Mazda RX-7", "response": ["The RX-7 also fared well at the Spa 24 Hours race. Three Savanna/RX-7s were entered in 1981 by Tom Walkinshaw Racing. After hours of battling with several BMW 530is and Ford Capris, the RX-7 driven by Pierre Dieudonné and Tom Walkinshaw won the event. Mazda had turned the tables on BMW, who had beaten Mazda's Familia Rotary to the podium eleven years earlier at the same event. TWR's prepared RX-7s also won the British Touring Car Championship in 1980 and 1981, driven by Win Percy."]}, {"page": "Jaguar XJS", "response": ["In 1982 Tom Walkinshaw's TWR had entered a team of the V12 XJS' into the European Touring Car Championship, the cars built to the FIA's Group A touring car rules. The XJS won its first race that season when Walkinshaw and Chuck Nicholson won the XIV Grand Prix Brno, the cars simply proving too fast for their rival BMW 530/530i and Alfa Romeo GTV6 opposition with Walkinshaw qualifying 5.37 seconds faster than anyone else on the 10.925 km (6.789 mi) Brno Circuit. After more victories for the team's Jaguars in 1983 (including lapping the 20.81 km (12.93 mi) Nürburgring Nordschleife circuit in 7:56.00), the TWR Jaguars were the cars to beat in the ETCC, with Walkinshaw claiming the 1984 ETCC Drivers' Championship. During the championship season the TWR Jaguar team also won the prestigious Spa 24 Hours race with an XJS driven by Walkinshaw, Hans Heyer and Win Percy, proving not only the speed of the cars but the reliability of the 5.3 litre V12 engine. By 1984 the TWR Jaguars had a new challenger in the ETCC. The turbocharged Volvo 240T run by Eggenberger Motorsport arrived on the scene and had the speed to match the V12, though with turbocharging new to touring car racing it took a number of races for reliability to match the cars' speed."]}, {"page": "Rover SD1", "response": ["* Tom Walkinshaw and Win Percy won six rounds (Monza, Vallelunga, Donington, Silverstone, Nogaro and Jarama) of the 1985 European Touring Car Championship driving a TWR Rover Vitesse.1985 European Touring Car Championship, touringcarracing.net Retrieved on 9 December 2014"]}, {"page": "Bathurst 1000", "response": ["In 1990 the Sierras again proved strong, but the HRT Commodore of Allan Grice and Win Percy prevailed. Their Holden VL Commodore SS Group A SV was able to set a fast pace early in the race which the Sierras could match but not sustain due to reliability issues, mostly with tyre wear. The HRT claimed a popular Bathurst victory for Holden after three seasons of Sierra domination.", "|Tooheys 1000|| Win Percy  Allan Grice||Holden VL Commodore SS Group A SV||161 laps  6h 40m 52.64s||149.67 km/h  93.00 mph"]}, {"page": "Tom Walkinshaw", "response": ["With Australia's move to Group A in 1985, Walkinshaw vowed to return to Bathurst with his ETCC Jaguars in a bid to win the Australian classic. The three ETCC Jags were brought out of retirement and shipped to Bathurst with the help of \"Jaguar Rover Australia\" (JRA) and proceeded to dominate practice and qualifying, with Walkinshaw claiming pole position, Jeff Allam claiming second spot on the grid and provisional pole sitter John Goss starting 6th. Driving with regular ETCC co-driver Win Percy, Walkinshaw finished 3rd in the race after leading for over ⅔ distance following a split oil line late in the race. The Allam/Ron Dickson car was out after 3 laps with engine failure when broken glass from the cars right headlight got sucked into the intake system, while the Goss/Armin Hahne car would win for TWR after having to battle for over 100 laps of the 6.172 km (3.835 mi) long Mount Panorama Circuit with a broken drivers seat which had to be held in place by cable ties attached to the roll cage.", "The Rovers, with sponsorship from Bastos/Texaco, were again the TWR cars for the renamed ETCC (which had become the FIATCC in 1986 in anticipation of the 1987 World Touring Car Championship). Walkinshaw was again a favourite to take out the title, but once again would finish 3rd. Co-driver Win Percy was originally announced as the 1986 champion before results from earlier races were amended following protest hearings. Walkinshaw had intended to return to Bathurst in 1986 with the V12 Jaguars but withdrew when JRA refused to help with funds following a downturn in the Australian car market.", "|align=\"left\"|  Chuck Nicholson Win Percy", "|align=\"left\"|  Win Percy Hans Heyer", "|align=\"left\"|  Win Percy Hans Heyer", "|align=\"left\"|  Win Percy Eddy Joosen", "|align=\"left\"|  Win Percy"]}, {"page": "Hans Heyer", "response": ["During the years that the Spa 24 Hours was run as part of the European Touring Car Championship and the inaugural World Touring Car Championship (1982–1988), Heyer won the race three times in succession. He won in 1982 driving a BMW 528i with Armin Hahne and Eddy Joosen, 1983 in a BMW 635 CSi with Hahne and Thierry Tassin, and finally in 1984 driving a TWR Jaguar XJS with Tom Walkinshaw and Win Percy."]}, {"page": "Mike Wilds", "response": ["Wilds' sports car racing career included driving at Le Mans 8 times, including C2 cars for Ecurie Ecosse (World Champion C2, 1986), and Group C for Nissan in 1988 with team-mate Win Percy.", "|align=\"left\"|  Allan Grice Win Percy"]}, {"page": "Spa 24 Hours", "response": ["| Hans Heyer Tom Walkinshaw Win Percy", "| Gianfranco Brancatelli Win Percy Bernd Schneider", "|  Win Percy"]}, {"page": "Jaguar XJ220", "response": ["A racing version was introduced at the 1993 Autosport International motor show; given the model name XJ220-C, it was built to compete in FISA GT racing. The XJ220-C driven by Win Percy won its first race, a round of the BRDC National Sports GT Challenge at Silverstone."]}, {"page": "Hiroshi Fushida", "response": ["|align=\"left\"|  Yojiro Terada Win Percy"]}, {"page": "Jaguar XJR-15", "response": ["Both men went into the pits for repairs. This left Euser back in the lead but his bonnet was gradually working loose which forced him to miss the apex at Beckets resulting in a spectacular  spin. Now Flux was in the lead followed by Fangio and Hahne. By lap six Euser's charge back to contention suffered another setback when he hit David Leslie at Priory, both cars spinning as a result. Two corners later, Needell bumped Hahne out of the way to take third. Lap nine finally saw an end to Euser's afternoon when he hit Acheson and ended up beached in the gravel. Acheson was forced to pit. Competing for third, Needell and Hahne had another coming together forcing both cars out of contention. At the front, Fangio took the lead when Flux missed a gear at Club and dropped to second ahead of Wollek and Win Percy. Wollek's tyres were still in great condition having driven steadily throughout and the American was able to reel in Flux, passing on lap 18. Fittingly, the race was won by Fangio precisely 45 years after his famous uncle's last win at Silverstone. At the end of the race, 11 of the 16 entries had suffered some kind of damage.", "|DNF|| 6 || Win Percy || GB || ||", "|3. || 6 || Win Percy || GB || 11 || 28:10,720"]}, {"page": "British Touring Car Championship", "response": ["|  Win Percy  (Mazda RX-7)", "|  Win Percy (2)  (Mazda RX-7)", "|  Win Percy (3)  ( Toyota Corolla)"]}, {"page": "Gianfranco Brancatelli", "response": ["Other than his success in the 1985 ETCC, arguably Brancatelli's biggest wins in touring car racing were the 1985 Guia Race of Macau driving a Volvo 240T, and the 1989 Spa 24 Hours driving an Eggenberger Ford Sierra RS500 along with Bernd Schneider (yet another F1 driver, this time a current one) and Win Percy. During the late 1980s and early 1990s, Brancatelli also travelled to Australia to drive in the Bathurst 1000 touring car race, though success would generally elude him. His best finish was in the 1987 WTCC round, the 1987 James Hardie 1000 where he and Johnny Cecotto would finish 7th outright and 3rd in class, though as they were the first registered WTCC drivers to finish the race they would receive top points for the round. His three other races at Bathurst in 1989, 1990 and 1991 would result in two failed to finish and one disqualification due to a technical infringement.", "|align=\"left\"|  Win Percy Hurley Haywood"]}, {"page": "Wayne Gardner", "response": ["For the 1994 season, Gardner formed his own team, Wayne Gardner Racing (sponsored by Coca-Cola), where he raced for three seasons with teammate, Channel 7 commentator Neil Crompton. The team's low point came at the Bathurst round of the 1995 ATCC in March. Soon after the start of the first heat, Crompton was hit by the VP Commodore of Phil Ward. This pushed him straight into Gardner's car and both of the Coke sponsored cars ended their race in the wall before they got to Hell Corner on the first lap (Ward continued on with little to no damage). The team recovered though and Gardner sensationally won the start and led the opening laps of the 1995 Tooheys 1000, before he and Crompton went on to finish 3rd in the race, while their teammates Brad Jones and former Bathurst winner Win Percy finished 5th, only a few seconds behind."]}, {"page": "Walkinshaw Andretti United", "response": ["For 1989 it was planned for TWR to run the full season with two cars. Win Percy and Neil Crompton were announced as the team's drivers and a second VL Commodore built in England was tested in Holden Racing Team livery at Calder but with the likelihood of being mauled by the Ford Sierra RS500s, the Australian Touring Car Championship programme was cancelled. For the Sandown 500, Bathurst 1000 and Grand Prix support races, the programme was once again contracted to Perkins Engineering.", "In 1990 the operation was brought in house with longtime TWR driver Win Percy moving to Melbourne to fill the role of both driver and team manager. Percy drove at all Australian Touring Car Championship rounds except for Mallala where Neil Crompton drove after Percy returned to England for a family bereavement.Nissan's First, 1990 Shell Australian Touring Car Championship, Australian Motor Racing Year 1990/91, pages 108–109 Percy's highest qualifying position was sixth at Winton and highest race result a third place at Lakeside, and he finished eighth overall in the championship.", "For 1991 the VN Commodore was homologated with Win Percy driving in all ATCC rounds except Lakeside where Allan Grice substituted while Percy competed in an event in Europe. Percy again finished eighth in the championship. At the Bathurst 1000, Percy and Grice teamed together to finish second, with the second car of Neil Crompton and Brad Jones not finishing after running out of fuel.", "With Win Percy having decided to return to England, Tomas Mezera was hired. Due to a budget shortfall and the need to develop the VP Commodore for the new V8 formula, HRT only competed at the Sandown, Lakeside and Eastern Creek rounds. Two 1993 spec VP Commodores were raced at the Sandown 500 with Mezera and Brad Jones finishing third while Percy and Grice finished fifth at the Bathurst 1000. Mezera and Jones drove two cars at the Grand Prix support races.", "At the Sandown 500 Mezera was joined by Michael Preston, with Brad Jones and Allan Grice in the second car. For the Bathurst 1000 Mezera was joined by Win Percy with Gardner and Jones driving the second car to a third-place finish. Gardner won a race at the Australian Grand Prix.", "! Win Percy", "! Win Percy", "* Win Percy (1990–93)"]}, {"page": "Jim Richards (racing driver)", "response": ["Driving for Nissan, Richards won his third ATCC in 1990 driving both the Nissan Skyline HR31 GTS-R and the mighty 4WD, twin-turbo R32 GT-R, affectionately known as \"Godzilla\". He would repeat as champion in 1991, finishing the ATCC ahead of his young teammate Mark Skaife. Skaife then put the GT-R on pole position at the 1991 Bathurst, before he and Richards cruised to victory in race record time, a lap ahead of the Holden Commodore of defending race winners Win Percy and Allan Grice."]}]}}