{"wiki_id": "http://www.wikidata.org/entity/Q356276", "itemLabel": "Brian London", "itemDescription": "English boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_London", "wikipedia_page": {"main": "Brian Sidney Harper (19 June 1934 – 23 June 2021), known professionally as Brian London, was an English professional boxer who competed from 1955 to 1970. He held the British and Commonwealth heavyweight title from 1958 to 1959, and twice challenged for the world heavyweight title, losing to Floyd Patterson in 1959 and Muhammad Ali in 1966, both times via knockout. He was one of a quartet of British boxers, with Henry Cooper, Joe Erskine, and Dick Richardson, who dominated the British boxing scene throughout the 1950s and 1960s.\nAn orthodox fighter, London was 6 feet tall and fought at about 14 stone 12 pounds (208 lbs). His nicknames in the ring were \"The British Bulldog\" and \"The Blackpool Rock\".", "link_mentions": [{"page": "Muhammad Ali", "response": ["Instead, Ali traveled to Canada and Europe and won championship bouts against George Chuvalo, Henry Cooper, Brian London and Karl Mildenberger."]}, {"page": "Floyd Patterson", "response": ["After a series of defenses against fringe contenders (Hurricane Jackson, Pete Rademacher, Roy Harris, and Brian London), Patterson met Ingemar Johansson of Sweden, the number one contender, in the first of three fights. Johansson triumphed over Patterson on June 26, 1959, with the referee Ruby Goldstein stopping the fight in the third round after the Swede had knocked Patterson down seven times. Johansson became Sweden's first World Heavyweight Champion, thus becoming a national hero as the first European to defeat an American for the title since 1933.", "|style=\"text-align:left;\"| Brian London"]}, {"page": "Pete Rademacher", "response": ["Rademacher fought Zora Folley, Brian London, George Chuvalo, Buddy Turman, and the former world light heavyweight champion, Archie Moore. He lost to Moore, Folley and London but beat Chuvalo, LaMar Clark, and Turman, among others. His last bout was with former world middleweight champion Carl \"Bobo\" Olson, whom he beat by decision.", "|style=\"text-align:left;\"| Brian London"]}, {"page": "Jerry Quarry", "response": ["|style=\"text-align:left;\"| Brian London", "|style=\"text-align:left;\"| Brian London"]}, {"page": "1966 in sports", "response": ["* August 6 Muhammad Ali defeats Brian London with a 3rd-round KO"]}, {"page": "Jimmy Greaves", "response": ["In January 1971, with Bobby Moore, Brian Dear and Clyde Best, Greaves was involved in late-night drinking, against the wishes of manager Ron Greenwood, prior to an FA Cup tie away to Blackpool. On arriving in Blackpool, Greaves and his teammates had been informed by members of the press that the game, the following day, was unlikely to go ahead due to a frozen pitch and the likelihood of frost that night. Believing that there would be no game the following day, Greaves drank 12 lagers in a club owned by Brian London and did not return to the team hotel until 1.45am. In fact, the match went ahead and West Ham lost 4–0. Greaves claimed the defeat was not a result of the late night, the drinking or the frozen pitch, but because the West Ham team in which he was playing was not good enough. As a result, the players were fined and dropped by the club."]}, {"page": "Blackpool", "response": ["* Brian London – boxer"]}, {"page": "List of boxing families", "response": ["*Brian London (Jack's son; 1934–2021), British heavyweight champion"]}, {"page": "Joe Bugner", "response": ["Born in Szőreg, a southeastern suburb of Szeged in southern Hungary, Bugner and his family fled after the 1956 Soviet invasion and settled in Britain. Standing at  with a prime weight of around , Bugner twice held the British and British Commonwealth heavyweight titles and was a three-time European heavyweight champion. He was ranked among the world's top ten heavyweights in the 1970s, fighting such opponents as Muhammad Ali, Joe Frazier, Ron Lyle, Jimmy Ellis, Manuel Ramos, Chuck Wepner, Earnie Shavers, Henry Cooper, Brian London, Mac Foster, Rudie Lubbers, Eduardo Corletti, Jurgen Blin and George Johnson. He fought for the world heavyweight championship in 1975, losing on points in a second bout with Ali.", "In 1970 Bugner emerged internationally as an outstanding young prospect, and by the end of the year he was world-rated. He won nine consecutive bouts that year, including victories over well-known boxers such as Chuck Wepner, Manuel Ramos, Johnny Prescott, Brian London, Eduardo Corletti, Charley Polite, and George Johnson.", "|align=left| Brian London"]}, {"page": "Henry Cooper", "response": ["For Cooper 1959 was a banner year: he took the British and Commonwealth titles from Brian London in 15-rounds and received the last 9-carat gold Lonsdale Belt after successful defences against Dick Richardson (KO 5), Joe Erskine (TKO 5 and TKO 12), and Johnny Prescott (TKO 10). Another points win over London brought an offer to fight Floyd Patterson for his world heavyweight title, but this was turned down by Cooper (or Wicks).", "|style=\"text-align:left;\"| Brian London", "|style=\"text-align:left;\"| Brian London", "|style=\"text-align:left;\"| Brian London"]}, {"page": "Ingemar Johansson", "response": ["Johansson, however, fought journeyman heavyweight Brian London on 21 April 1963, in a non-title 12-round match. Johansson won most of the rounds but seldom threw a serious right-hand punch with the exception of round seven when a short right from Johansson staggered London (Las Vegas Sun, April 22, 1963, page 24). In round 12, with four seconds remaining in the fight, London hit Johansson with a powerful right hand that knocked him on his back. Johansson arose at the count of four, just as the bell rang to end the fight. Johansson was groggy, but was the points winner. UPI scored the fight 11-1 in favour of Johansson (Las Vegas Sun, April 22, 1963, page 24).", "While his victory over Floyd Patterson was a huge upset at the time, Johansson's standing within heavyweight history is fairly poor. Considered to be an ordinary fighter with a very good right hand, the Swede was perhaps fortunate to have met Patterson, one of history's more vulnerable heavyweight champions, for the title. Patterson also likely took the challenge of Johansson lightly, given the Swede's apparently lackadaisical approach to training. This was also at a time when it was considered a virtual impossibility that a European heavyweight could inflict a defeat on an American champion on U.S. soil. Furthermore, Patterson had defended the title just 56 days previously, against Britain's Brian London, and likely considered Johansson to be another inept challenger from Europe.", "|style=\"text-align:left;\"|Brian London"]}, {"page": "List of Monty Python's Flying Circus episodes", "response": ["**featuring Cardinal Richelieu as Petula Clark; Julius Caesar as Eddie Waring; Florence Nightingale as Brian London; Ivan the Terrible as a sales assistant at Freeman, Hardy and Willis; W. G. Grace as a music box; Napoleon as the R101 disaster; and John the Baptist as Graham Hill"]}, {"page": "Lonsdale (clothing)", "response": ["*  Brian London"]}, {"page": "Willie Pastrano", "response": ["Pastrano began his career at the age of 16.  He fought many heavyweights and outpointed heavyweight contenders  Rex Layne, Brian London, and Tom McNeeley.", "|align=left| Brian London", "|align=left| Brian London"]}, {"page": "Zora Folley", "response": ["|align=left| Brian London"]}, {"page": "Joe Erskine (Welsh boxer)", "response": ["On 3 June 1958, he defended both his titles against Brian London, of Blackpool in a bout at the White City Stadium, London. Erskine was knocked out in the eighth round.", "In the meantime Henry Cooper had defeated Brian London to take the British and Commonwealth titles from him. On 17 November 1959, Erskine fought Cooper for both titles, having beaten him on their two previous meetings. The bout was held at the Earls Court Arena, London. Cooper won the fight on a technical knockout. Cooper, who was renowned for the power of his left hook, floored Erskine twice with terrific left hooks and Erskine was hanging almost unconscious over the lower rope when the referee stopped the bout.", "|align=left| Brian London"]}, {"page": "Eddie Machen", "response": ["|align=left| Brian London"]}, {"page": "Niño Valdés", "response": ["He continued boxing, losing to heavyweight contenders Zora Folley, Eddie Machen, and Sonny Liston.  After defeating contender Brian London in December 1959, Valdés retired due to eye problems.", "|align=left| Brian London"]}, {"page": "1934 in the United Kingdom", "response": ["**Brian London, boxer (died 2021)Boxer Brian London who fought Muhammad Ali for world title dies"]}, {"page": "Tom McNeeley", "response": ["|align=left| Brian London"]}, {"page": "Billy Walker (boxer)", "response": ["|align=left| Brian London"]}, {"page": "List of British heavyweight boxing champions", "response": ["|align=left | Brian London"]}, {"page": "Jack Bodell", "response": ["|align=left| Brian London"]}, {"page": "London (name)", "response": ["*Brian London (1934–2021), British boxer"]}, {"page": "Dick Richardson (boxer)", "response": ["Richard Alexander Richardson (1 June 1934 – 15 July 1999) was a heavyweight boxer from the Maesglas area of Newport, Monmouthshire, Wales. He held the European heavyweight title from March 1960 to June 1962. In all, he won 31 of his 47 professional bouts, losing 14, with two drawn. He was one of a quartet of British heavyweights in the 1950s and early 1960s, along with Henry Cooper, Joe Erskine and Brian London, who held out the possibility of a challenging for a heavyweight world champion.", "Richardson defeated a number of top heavyweights in his career, including; Karl Mildenberger, Bob Baker, Brian London and Hans Kalbfell.", "He was born Richard Alexander Richardson but was known as Dick. He was  tall and weighed about . He had a few amateur bouts before being called up for his national service in 1953. He served in the Royal Army Service Corps where he became boxing champion. However he was beaten in the inter-services boxing championships by Brian London, later to become British heavyweight boxing champion, and fighting under his real name of Harper. He turned professional in 1954, being managed by Wally Lesley and trained by Johnny Lewis at a gym in Blackfriars, London. In September 1954, he lost his first professional bout on points against Henry Cooper's twin brother, George, fighting under the ring name of Jim Cooper. He avenged this defeat in March 1955 with a technical knockout in the second round.", "Richardson defended his European title in August 1960, against Brian London, in Porthcawl, winning by a technical knockout in the eighth round. This result provoked a brawl, when London's father and brother, with Richardson's brothers coming in to defend as the Londons invaded the ring to protest that Richardson had used his head to open a cut on his opponent.", "|align=left| Brian London"]}, {"page": "Jack London (boxer)", "response": ["Jack London (born John George Harper; 23 June 191319 December 1963) was an English heavyweight boxer. He was British and Commonwealth Heavyweight champion from 1944 to 1945. His son, who fought as Brian London, also became British and Commonwealth Heavyweight champion from 1958 to 1959."]}, {"page": "Thad Spencer", "response": ["A native of Portland, Oregon, Spencer made his professional boxing debut in May 1960. After building up a 31-5 record, which included wins over contenders Doug Jones, Brian London and Amos Lincoln, he was highly regarded enough to be a part of the eight-man WBA elimination tournament, held after Muhammad Ali had been stripped of the title. Spencer won a 12 round decision over former title-holder Ernie Terrell in August 1967 and was then matched against Jerry Quarry in the semi-finals. Despite entering the bout as a 6/4 favourite, Spencer lost to Quarry by a 12th round TKO.", "|align=left| Brian London"]}, {"page": "Bobby Moore", "response": ["Although Moore was seen as an icon and a perfect influence on the game, he was not without his faults or controversies. On 7 January 1971, he and three West Ham teammates, Jimmy Greaves, Brian Dear and Clyde Best, were all fined by West Ham manager Greenwood after going out drinking in a nightclub until the early hours of the morning prior to an FA Cup third round tie against Blackpool. The nightclub in Blackpool was owned by Moore's friend, boxer Brian London. West Ham lost the tie 4–0. They were all fined a week's wages. Blackpool were the bottom of Division one at the time, and were relegated at the end of the season. Coincidentally, Moore was featured on TV as the subject on This Is Your Life the night before. Brian Glanville stated that it was not uncommon for Moore to drink heavily, but he was often seen training with West Ham the next day, working off the alcohol he had consumed the night before. On 12 June 1972, he also played for the Greek side Olympiacos, as their captain, in a friendly match against the Brazilian club Corinthians."]}, {"page": "Boxing in Wales", "response": ["Welsh boxing in the twentieth century produced a number of notable light and middle weight boxers, but failed to have a similar impact on the heavyweight categories, which was not reflective of the rest of the United Kingdom. The notable exceptions to this were the Dick Richardson of Newport and Joe Erskine from Cardiff, who, along with England's Henry Cooper and Brian London formed a quartet of promising British heavyweights during the late 1950s and early 1960s."]}, {"page": "List of people from Blackpool", "response": ["*Brian London (1934–2021), boxer originally from Hartlepool"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Brian London"]}, {"page": "Redvers Sangoe", "response": ["With the title of Welsh area champion, Sangoe began drawing in bigger fighters, but these proved a level too far. He travelled to Glasgow to face Dave Mooney, but lost on points. He then faced the two most notable fighters of his career to date. First he faced British Light-heavyweight champion Randy Turpin at the Football Ground in Oswestry. Turpin, though heading towards the end of his boxing career, was too classy for Sangoe and downed him in the third and then twice in the fourth before the referee intervened.Jones (2007) p.53 After the Turpin fight, Sangoe took a five-month break before lining up against Chic Calderwood at Earls Court Empress Hall in Kensington on 12 January 1959. The fight was an undercard bout to the Henry Cooper vs. Brian London British and Empire Heavyweight title fight, and Calderwood was quick becoming a serious contender for the Lightheavyweight British title with wins over both Mooney and Rowe, who had both defeated Sangoe. Sangoe lasted until the fifth."]}, {"page": "James Barnor", "response": ["The first major solo retrospective exhibition of Barnor's photographs, Ever Young: James Barnor, was mounted at Rivington Place in London from September to November 2010, curated by Renée Mussai of Autograph ABP's Archive and Research Centre.\"Renée Mussai of Autograph ABP to lecture at Light Work\", Light Work, 1 March 2010.\"Photography, Diaspora and James Barnor's Transatlantic Archive: A Missing Chapter\", Iziko Museums, September 2011. Documenting life in Ghana from the late 1940s to 1950s, and African life during London's \"Swinging Sixties\" (famous faces include Muhammad Ali, who defended his world heavyweight title against Brian London at Earl's Court in 1966) as well as later decades, the exhibition received wide and favourable coverage within the UK media.\"1960s London seen through an immigrant’s eyes\", The Observer, 19 September 2010.Chloe Hayward, \"James Barnor\", Past Present Future London – Chronicling arts, culture and lifestyle over the last century , 5 October 2010. As one reviewer noted, \"The pictures have become slices of history, documenting race and modernity in the post-colonial world.\"\"James Barnor: Crossing Continents – The Fashion Photographer and Photojournalist Who Chronicled a Changing World\", Nowness, 25 September 2010. For art historian Kobena Mercer, "]}, {"page": "Al Phillips", "response": ["After his retirement from boxing, Phillips became a successful matchmaker and boxing promoter based in the London area.  The best known of the boxers he managed was British heavyweight champion Brian London, a contender for the World title who was a fixture in English boxing in the 1950s and 1960s.   On 8 February 1965 he promoted a fight between George Walker and London.  Phillips was an avid golfer during his retirement, and a member of the Stanmore Club.  He died on 7 February 1999 in Stanmore, Middlesex London, and was survived by his wife Sissy, and one daughter."]}, {"page": "Kitione Lave", "response": ["Lave began 1956 in better form, winning three consecutive fights. Travelling to Newcastle, he stopped undefeated German Hans Brendemuehl in the second, former and future Italian heavyweight champion Uber Bacilieri in the fourth before scoring a second round victory over ex-Commonwealth and European champion Don Cockell. Cockell retired after his contest with Lave, having just a year earlier faced Rocky Marciano for the World Heavyweight title. Lave's successes led to a title challenge for the vacant Commonwealth heavyweight title. His opponent was Joe Bygraves, who had defeated Lave in 1955. The two met on the 26 June 1956 at the Empire Pool in Wembley, and again the fight went the full distance, with the result going the same way, to Bygraves. Lave ended the year with a win over American Young Harry Wills at the ice rink in Nottingham, before travelling to Germany to knockout Guenter Nurnberg in the first round in an encounter in Berlin. Lave fought infrequently in 1957, with just three matches, all of them ending in defeat. The first of the loses was against Brian London in an eliminator contest for another shot at the Commonwealth title. This was followed by a third defeat to Bygraves, yet another points decision, and finally a loss against German heavyweight title challenger Hans Friedrich."]}]}}