{"wiki_id": "http://www.wikidata.org/entity/Q3568427", "itemLabel": "William Belsham", "itemDescription": "historian", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Belsham", "wikipedia_page": {"main": "William Belsham (1752–1827) was an English political writer and historian, noted as a supporter of the Whig Party and its principles. He justified the American Revolution in excusing Americans in their resistance to the demands of England, and he was an advocate of progressive political liberty.", "link_mentions": [{"page": "Libertarianism (metaphysics)", "response": ["The first recorded use of the term libertarianism was in 1789 by William Belsham in a discussion of free will and in opposition to necessitarian or determinist views.William Belsham, \"Essays\", printed for C. Dilly, 1789; original from the University of Michigan, digitized May 21, 2007, p. 11.Oxford English Dictionary definition of libertarianism."]}, {"page": "Malcolm Laing", "response": ["Laing signed the declaration of the Society of Friends of the People in 1794, and joined the Whig Club. A personal friend of Charles James Fox, he was one of a group of advisers of Fox during the first years of the 19th century on his work of British history, with William Belsham, Samuel Heywood and James Maitland, 8th Earl of Lauderdale. He was Member of Parliament for Orkney and Shetland from 1807 to 1812, brought in by the Ministry of All the Talents."]}, {"page": "Thomas Belsham", "response": ["Belsham was born in Bedford, England, and was the elder brother of William Belsham, the English political writer and historian. He was educated at the dissenting academy at Daventry, where for seven years he acted as assistant tutor. After three years spent in a charge at Worcester, he returned as head of Daventry Academy, a post which he continued to hold till 1789, when, having adopted Unitarian principles, he resigned. With Joseph Priestley for colleague, he superintended during its brief existence the New College at Hackney, and was, on Priestley's departure in 1794, also called to the charge of the Gravel Pit congregation. In 1805, he accepted a call to the Essex Street Chapel, which was also headquarters and offices of the Unitarian Church under John Disney, there succeeding as minister Theophilus Lindsey who had retired and died three years later in 1808."]}, {"page": "Libertarianism", "response": ["The first recorded use of the term libertarian was in 1789, when William Belsham wrote about libertarianism in the context of metaphysics. As early as 1796, libertarian came to mean an advocate or defender of liberty, especially in the political and social spheres, when the London Packet printed on 12 February the following: \"Lately marched out of the Prison at Bristol, 450 of the French Libertarians\".OED November 2010 edition It was again used in a political sense in 1802 in a short piece critiquing a poem by \"the author of Gebir\" and has since been used with this meaning.The British Critic. p. 432. \"The author's Latin verses, which are rather more intelligible than his English, mark him for a furious Libertarian (if we may coin such a term) and a zealous admirer of France, and her liberty, under Bonaparte; such liberty!\"Seeley, John Robert (1878). Life and Times of Stein: Or Germany and Prussia in the Napoleonic Age. Cambridge: Cambridge University Press. 3: 355.Maitland, Frederick William (July 1901). \"William Stubbs, Bishop of Oxford\". English Historical Review. 16[.3]: 419."]}, {"page": "List of philosophers born in the 18th century", "response": ["* William Belsham, (1752–1829)"]}, {"page": "Right-libertarianism", "response": ["The term libertarian was first used by late Enlightenment freethinkers, referring to those who believed in free will, as opposed to necessity, a now-disused philosophy that posited a kind of determinism. The word libertarian is first recorded in 1789 coined by the British historian William Belsham, in a discussion against free will from the author's deterministic point of view.William Belsham, \"Essays\", printed for C. Dilly, 1789; original from the University of Michigan, digitized 21 May 2007.William Belsham (1752–1827). The Information Philosopher. El primer uso de la palabra se encuentra en el primer ensayo llamado On Liberty and Necessity (1789): \"Or where is the difference between the Libertarian, who says that the mind chooses the motive; and the Necessarian, who asserts that the motive determines the mind; if the volition be the necessary result of all the previous circumstances?\" This debate between libertarianism in a philosophical-metaphysical sense and determinism would continue into the early nineteenth century, especially in the field of Protestant theology.Jared Sparks, Collection of Essays and Tracts in Theology, from Various Authors, with Biographical and Critical Notices, publicado por Oliver Everett, 13 Cornhill, 1824 (ver, Writings of Dr. Cogan, 205). The Merriam-Webster Dictionary, in English, attests to this ancient use of the word libertarian by describing its meaning as \"an advocate of the doctrine of free will \"and, taking a broad definition, also says that he is\" a person who holds the principles of individual freedom especially in thought and action \".Definition of «libertarian» in Merriam-Webster Dictionary. First Known Use of libertarian: 1789, in the meaning defined at sense 1."]}, {"page": "An Appeal from the New to the Old Whigs", "response": ["Other replies were William Belsham, Examination of 'An Appeal to the New Whigs', George Rous' A Letter to the Right Honourable Edmund Burke and Charles Pigott, Strictures on the New Political Tenets of the Rt. Hon. Edmund Burke.Lock, p. 389, n. 43."]}, {"page": "A History of the Early Part of the Reign of James II", "response": ["Part of Fox's motive in writing it was to correct the Tory interpretation of David Hume's History of England, who Fox considered to be \"an excellent man and of great powers of mind, but his Partiality to Kings and Princes is intolerable\".Mitchell, p. 189. Fox was able to glean information from what his grandfather the Duke of Richmond had heard from the Duchess of Portsmouth and he consulted fellow historians William Belsham, Sir John Dalrymple, Andrew Stuart, Charles Butler. Through his aristocratic connections, Fox was also able to access the papers of some of the British nobility and through his French connections he was able to enlist the help of Talleyrand and Lafayette to access French archives.Mitchell, pp. 189-190."]}, {"page": "Anthony Robinson (Unitarian)", "response": ["Robinson had an influential circle of acquaintance, including Joseph Priestley, William Belsham, and Henry Crabb Robinson."]}, {"page": "The Oeconomist, Or, Englishman's Magazine", "response": ["The contributors to The Oeconomist included some of those associated with the \"Friends of Peace\", an anti-war network, such as Vicesimus Knox. Theophilus Lindsey offered to help Bigge by soliciting contributions, but came away empty-handed when he approached William Belsham and Ann Jebb. Graham counts Bigge an ally of Christopher Wyvill.Jenny Graham, \"'This unhappy country of ours': extracts of letters, 1793–1801, of Theophilus Lindsey\", Enlightenment and Dissent No. 18 (1999) (PDF), at p. 152. Besides Losh, the contributors included William Turner and Thomas Beddoes. An article appeared signed \"V.F.\", praising Count Rumford's workhouse in Munich, and describing a Rumford soup kitchen in Newcastle.Samantha Webb, Wordsworth, Count Rumford, and Poverty Relief, The Wordsworth Circle Vol. 43, No. 1, Wordsworth Summer Conference Papers, A Selection: 2011 (Winter 2012), pp. 29–35, at p. 32. Published by: Marilyn Gaull."]}, {"page": "Belsham, William", "response": ["#redirectWilliam Belsham"]}, {"page": "John Owen (1766–1822)", "response": ["Owen published some letters which he had addressed to William Belsham, as Travels into Different Parts of Europe, in the years 1791 and 1792, with familiar Remarks on Places, Men, and Manners, London, 1796, 2 vols. On 11 March and 5 August 1794 Owen preached assize sermons in Great St Mary's. These were published at Cambridge in 1794. In the same year he published The Retrospect; or Reflections on the State of Religion and Politics in France and Great Britain, London, 1794. "]}]}}