{"wiki_id": "http://www.wikidata.org/entity/Q3564929", "itemLabel": "Les Shannon", "itemDescription": "Footballer (1926-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Shannon", "wikipedia_page": {"main": "Leslie Shannon  (12 March 1926 – 2 December 2007) was an English football player and manager.\nAs a forward, he scored 40 goals in 274 league games in the Football League, playing for Liverpool between November 1944 and November 1949 and then for Burnley from November 1949 to August 1958 following a £6,000 transfer. He also won three caps for the England B team.\nHe coached at Everton and Arsenal, before he embarked on an 18-year career in management in England, Greece, and Norway. He is considered by Greek fans and media to have been one of the most successful foreign managers to ever work in Greek football. His first management role was at Bury from 1966 to 1969; he took the Shakers to promotion out of the Third Division in 1967–68, though they were twice relegated. He took charge at Blackpool, leading the Tangerines to promotion out of the Second Division in 1969–70. He spent the 1970s in Greece, and found most of his success with PAOK, taking the club to two Greek Cup titles. He also won the Greek Cup with Iraklis Thessaloniki. He also took charge at Olympiacos, Panachaiki, and OFI Crete. He also led Norwegian side Brann to promotion into the top-flight in 1980. He returned to England 1984, and scouted for Luton Town for 25 years.", "link_mentions": [{"page": "SK Brann", "response": ["* Les Shannon (1 January 1980 – 31 December 1981)"]}, {"page": "Blackpool F.C.", "response": ["Les Shannon, who spent the majority of his playing career with Blackpool's Lancashire rivals Burnley, was installed as manager for the 1969–70 season. In his first season, he succeeded where Mortensen had failed, by guiding the club back to the top flight as runners-up behind Huddersfield Town. Their promotion had been sealed after the penultimate game of the season, a 3–0 victory at rivals Preston North End, courtesy of a Fred Pickering hat-trick. The result effectively relegated the hosts to the Third Division."]}, {"page": "PAOK FC", "response": ["In 1972–73 season, PAOK came close to winning their first ever championship title playing exceptional football under the guidance of Les Shannon. On 25 February 1973 (matchday 20), PAOK who were leading the league table being 3pts (point system 3–2–1) ahead of rivals Olympiacos suffered their first loss with 1–0 in a much disputed derby against Olympiacos at Karaiskakis Stadium. PAOK had tremendous complaints against referee Fakis for not taking the proper disciplinary action against Olympiacos players who committed violent fouls. Two players (Iosifidis and Aslanidis) were substituted in the first half after sustaining injuries. One week later, PAOK lost 1–0 to Fostiras in Athens and Olympiacos drew 0–0 away to Egaleo, results that left the two teams level on pts. On 22 April 1973 (matchday 28), PAOK suffered a 3–5 shock defeat against Panachaiki at Toumba Stadium and Olympiacos who drew 1–1 away to Kavala, took the lead in the standings and went on with 6 wins in the remaining matches to win the championship. At the end of the season, PAOK participated for fourth consecutive year in the Greek Cup final and lost 1–0 to Olympiacos at Karaiskakis Stadium (home ground of Olympiacos).", "| Les Shannon"]}, {"page": "Egaleo F.C.", "response": ["* Les Shannon"]}, {"page": "Anghel Iordănescu", "response": ["In 1982, aged 32, Iordănescu left Romania to play for OFI Crete in Greece under head coach Les Shannon, but returned to Steaua two years later to become the club's assistant manager. Together with Emerich Jenei, then head coach, he won the championship in 1985 and helped lead the team to its European Cup triumph in 1986, playing as a substitute in the final against Barcelona."]}, {"page": "OFI Crete F.C.", "response": ["* Les Shannon (1979–80)", "* Les Shannon (1982–84)"]}, {"page": "Ian Holloway", "response": ["On 21 May 2009, it was reported that Holloway, after 364 days out of football, was set to be announced as the new manager of Blackpool following the departure of their caretaker manager Tony Parkes. The appointment was confirmed later the same day with Holloway signing a one-year contract with the club. His first league game in charge of the Seasiders was a 1–1 draw with his former club Queens Park Rangers at Loftus Road on 8 August 2009, the opening day of the 2009–10 season. QPR 1 - 1 Blackpool. BBC Sport. Published 8 August 2009. Last updated 17 August 2009. Retrieved 17 September 2018. Nine months later, he guided the club to the Premier League after winning the play-offs following a sixth-placed finish in The Championship, becoming only the second Blackpool manager (after Les Shannon in 1970) to win promotion in his first full season. Holloway described the achievement as the best moment of his life, aside from seeing his children born. Holloway followed this up in late July by leading Blackpool to victory in the South West Challenge Cup annual pre-season tournament. It was the first time a Premier League club had taken part."]}]}}