{"wiki_id": "http://www.wikidata.org/entity/Q3568666", "itemLabel": "William Gowland", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Gowland", "wikipedia_page": {"main": "William Gowland FRAI (16 December 1842 – 9 June 1922) was an English mining engineer who carried out archaeological work at Stonehenge and in Japan. He has been called the \"Father of Japanese Archaeology\".", "link_mentions": [{"page": "British Museum", "response": ["* Japanese antiquities from the Kofun period excavated by the pioneering archaeologist William Gowland, (3rd–6th centuries AD)"]}, {"page": "Stonehenge", "response": ["William Gowland oversaw the first major restoration of the monument in 1901, which involved the straightening and concrete setting of sarsen stone number 56 which was in danger of falling. In straightening the stone he moved it about half a metre from its original position. Gowland also took the opportunity to further excavate the monument in what was the most scientific dig to date, revealing more about the erection of the stones than the previous 100 years of work had done. During the 1920 restoration William Hawley, who had excavated nearby Old Sarum, excavated the base of six stones and the outer ditch. He also located a bottle of port in the Slaughter Stone socket left by Cunnington, helped to rediscover Aubrey's pits inside the bank and located the concentric circular holes outside the Sarsen Circle called the Y and Z Holes."]}, {"page": "Japanese Alps", "response": ["The name was coined by English archaeologist William Gowland, and later popularized by Reverend Walter Weston (1861–1940), an English missionary for whom a memorial plaque is located at Kamikōchi, a tourist destination known for its alpine climate. When Gowland coined the phrase, he was only referring to the Hida Mountains, but it now also applies to the Kiso Mountains and Akaishi Mountains.", "The Japanese Alps has a long history before William Gowland established this name. The Japanese Alps have been used as a place of ascetic practice for Buddhists monks and Shugenja since ancient times.(7) 近代登山にみる歴史的風致. Matsumoto City. From the 1600s to the 1800s, samurai officers of the Kaga domain travelled deep into the Hida Mountains with local hunters and farmers as guides to preserve the timber of the mountains and continued to create maps recording ridges, valleys and vegetation. This survey is called Okuyama-mawari (奥山廻り).Hiroshi Yonehara. 新川郡における「山廻役」と「奥山廻リ」についての一考察. Tateyama Museum Even now, it is very difficult to cross the steep Hida mountains, one of the world's heaviest snowfall areas, in winter. Therefore, it is considered a historical event in Japan that in the winter of 1584, daimyō Sassa Narimasa's forces crossed over the mountain range over Zara Pass and Harinoki Pass. This event is called \"Sarasara-goe\" (さらさら越え) derived from Sassa and Zara Pass.", "The first modern geological survey sheets were issued in 1890. The report mentioned major peaks, but the topography was mostly guesswork. From 1891, foreign travelers were able to find useful information in Basil Hall Chamberlain and W. B. Mason's Handbook for Travellers in Japan. However, for decades, the Japanese were climbing these mountains without a comparable guidebook. Japanese people did physical exploration over a decade in the 1890s. They divided the mountains into (north, central, and south) depending on how they were conventionally grouped. William Gowland, an English geologist, first thought of this swath of terrain as forming a single coherent landscape, comparable to the European Alps. Gowland's view was further developed by another Englishman and Christian missionary, Walter Weston, who was able “to canonize Gowland's geographical conception, deploying it as a de facto proper noun”. Gowland explored several parts of the ranges in the 1860s, being the first documented foreigner to climb two peaks in the Alps, Mount Yari and Mount Norikura. Gowland was an archaeologist, and he explored these ranges for archaeological reasons. While Gowland was the first foreigner to explore the ranges, Reverend Walter Weston, a Christian missionary, was the first foreigner to document his experiences."]}, {"page": "Hida Mountains", "response": ["The :ja:飛騨山脈, or , is a Japanese mountain range which stretches through Nagano, Toyama and Gifu prefectures. A small portion of the mountains also reach into Niigata Prefecture. William Gowland coined the phrase \"Japanese Alps\" during his time in Japan, but he was only referring to the Hida Mountains when he used that name. The Kiso and Akaishi mountains received the name in the ensuing years."]}, {"page": "Royal School of Mines", "response": ["* Professor William Gowland FRS, British mining engineer and archaeologist. Known as the Father of Japanese Archaeology."]}, {"page": "Foreign government advisors in Meiji Japan", "response": ["*  William Gowland, mining engineer, archaeologist"]}, {"page": "Japan–United Kingdom relations", "response": ["*William Gowland - Father of Japanese Archaeology"]}, {"page": "Kofun", "response": ["*William Gowland, a British engineer who made the first survey for Saki kofun group"]}, {"page": "Excavations at Stonehenge", "response": ["On New Year's Eve 1900, Stone 22 of the Sarsen Circle fell over, taking with it a lintel. Following public pressure and a letter to The Times by William Flinders Petrie, the then owner of Stonehenge, Edmund Antrobus, agreed to some remedial engineering work to be undertaken with archaeological supervision so that records could be made of the below ground archaeology. Antrobus appointed a mining engineer named William Gowland to manage the work. Despite having no archaeological training, Gowland produced some of the finest, most detailed excavation records ever made at the monument. Gowland established that antler picks were used to dig the stone holes and suggested the stones themselves were worked to shape on site."]}, {"page": "Mount Yari", "response": ["* 1878 - William Gowland became the first non-Japanese man to climb to the top."]}, {"page": "Mount Hotakadake", "response": ["* 1880 - William Gowland climbed Mount Myōjin, guided by local hunter Kamijō Kamonji."]}, {"page": "East Finchley Cemetery", "response": ["*William Gowland - Engineer and archaeologist  who for many years lived in Japan"]}, {"page": "Gowland", "response": ["*William Gowland (1842–1922), English mining engineer"]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| William Gowland||07/05/1908||16 December 1842 – 10 June 1922"]}, {"page": "Mount Norikura", "response": ["* 1878 - Englishman William Gowland  became the first non-Japanese man to reach the peak."]}, {"page": "Asuka-Fujiwara", "response": ["| align=\"center\"|Maruyama KofunMaruyama kofun || Kashihara || Historic Site investigated by William Gowland, a rectangular chamber with two sarcophagi, long corridor, and stone roof weighing in excess of a hundred tons || 150px || "]}, {"page": "List of fellows of the Royal Society elected in 1908", "response": ["#William Gowland  (1842–1922)"]}, {"page": "Takayasu Senzuka Kofun", "response": ["In the early Meiji period, Edward Sylvester Morse surveyed and sketched Kaizanzuka-kofun and introduced it as “Dolmen ancient tomb of Japan”. In later research William Gowland tried to take pictures of Nishitsuzuka-kofun (= Double chamber ancient tomb) and published a thesis as “Dolmen of double chamber”. Tsuboi Shougoro published a thesis, \"Same origin theory of ancient tombs / graves and dolmens\" in 1888."]}, {"page": "Gowland, William", "response": ["#redirectWilliam Gowland"]}, {"page": "Irogane", "response": ["According to William Gowland, a professor and senior member of the Japan Society in London (who was for a time Director of the Imperial Japanese Mint), aside from copper with natural impurities, the Japanese craftsmen would sometimes add a \"pseudo-speiss\" (a mix including some arsenic and / or antimony) to copper ore to make a base for production alloys."]}, {"page": "Department of Materials, Imperial College London", "response": ["The department was founded as the metallurgy department of the Government School of Mines and Science Applied to the Arts, founded in 1851, under the leadership of John Percy. He resigned nine years later, when the school was moved to the Huxley building along Exhibition Road. The next department head was not appointed until 1880, when William Chandler Roberts-Austen took on the role. William Gowland was appointed head in 1902, staying on to become head of the department after the formation of Imperial College in 1907. The department moved to the newly completed Bessemer building in 1912."]}, {"page": "Sir Edmund Antrobus, 4th Baronet", "response": ["As owner of the ancient monument of Stonehenge, he charged the engineer William Gowland to oversee the first major restoration of the monument in 1901. In 1905, he was initiated into the Ancient Order of Druids and welcomed the first massive ceremony of this Order in Stonehenge.Ronald Hutton, Blood and Mistletoe: The History of the Druids in Britain, New Haven, Yale University Press, 2009, p. 321."]}]}}