{"wiki_id": "http://www.wikidata.org/entity/Q356134", "itemLabel": "Leonard Woolley", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Woolley", "wikipedia_page": {"main": "Sir Charles Leonard Woolley (17 April 1880 – 20 February 1960) was a British archaeologist best known for his excavations at Ur in Mesopotamia. He is recognized as one of the first \"modern\" archaeologists who excavated in a methodical way, keeping careful records, and using them to reconstruct ancient life and history. Woolley was knighted in 1935 for his contributions to the discipline of archaeology. He married the British archaeologist Katharine Woolley.", "link_mentions": [{"page": "Agatha Christie", "response": ["In 1928 Christie left England and took the (Simplon) Orient Express to Istanbul and then to Baghdad. In Iraq, she became friends with archaeologist Leonard Woolley and his wife, who invited her to return to their dig in February 1930. On that second trip, she met archaeologist Max Mallowan, 13 years her junior. In a 1977 interview, Mallowan recounted his first meeting with Christie, when he took her and a group of tourists on a tour of his expedition site in Iraq. Christie and Mallowan married in Edinburgh in September 1930.Marriage Certificate. ScotlandStatutory Register of Marriages, 685/04 0938, 11 September 1930, District of St Giles, Edinburgh. Their marriage lasted until Christie's death in 1976. She accompanied Mallowan on his archaeological expeditions, and her travels with him contributed background to several of her novels set in the Middle East. Other novels (such as Peril at End House) were set in and around Torquay, where she was raised. Christie drew on her experience of international train travel when writing her 1934 novel Murder on the Orient Express. The Pera Palace Hotel in Istanbul, the southern terminus of the railway, claims the book was written there and maintains Christie's room as a memorial to the author."]}, {"page": "British Museum", "response": ["All the while, the collections kept growing. Emil Torday collected in Central Africa, Aurel Stein in Central Asia, D.G. Hogarth, Leonard Woolley and T. E. Lawrence excavated at Carchemish. Around this time, the American collector and philanthropist J Pierpont Morgan donated a substantial number of objects to the museum, including William Greenwell's collection of prehistoric artefacts from across Europe which he had purchased for £10,000 in 1908. Morgan had also acquired a major part of Sir John Evans's coin collection, which was later sold to the museum by his son John Pierpont Morgan Junior in 1915. In 1918, because of the threat of wartime bombing, some objects were evacuated via the London Post Office Railway to Holborn, the National Library of Wales (Aberystwyth) and a country house near Malvern. On the return of antiquities from wartime storage in 1919 some objects were found to have deteriorated. A conservation laboratory was set up in May 1920 and became a permanent department in 1931. It is today the oldest in continuous existence.Permanent establishment of the Research Laboratory (now the oldest such establishment in continuous existence)  In 1923, the British Museum welcomed over one million visitors.", "New mezzanine floors were constructed and book stacks rebuilt in an attempt to cope with the flood of books. In 1931, the art dealer Sir Joseph Duveen offered funds to build a gallery for the Parthenon sculptures. Designed by the American architect John Russell Pope, it was completed in 1938. The appearance of the exhibition galleries began to change as dark Victorian reds gave way to modern pastel shades. However, in August 1939, due to the imminence of war and the likelihood of air-raids, the Parthenon Sculptures, along with the museum's most valued collections, were dispersed to secure basements, country houses, Aldwych Underground station, the National Library of Wales and a quarry. The evacuation was timely, for in 1940 the Duveen Gallery was severely damaged by bombing.Cook, B.F. (2005). The Elgin Marbles. London: The British Museum Press, pg 92 Meanwhile, prior to the war, the Nazis had sent a researcher to the British Museum for several years with the aim of \"compiling an anti-Semitic history of Anglo-Jewry\". After the war, the museum continued to collect from all countries and all centuries: among the most spectacular additions were the 2600 BC Mesopotamian treasure from Ur, discovered during Leonard Woolley's 1922–34 excavations. Gold, silver and garnet grave goods from the Anglo-Saxon ship burial at Sutton Hoo (1939) and late Roman silver tableware from Mildenhall, Suffolk (1946). The immediate post-war years were taken up with the return of the collections from protection and the restoration of the museum after the Blitz. Work also began on restoring the damaged Duveen Gallery.", "In the early 20th century excavations were carried out at Carchemish, Turkey by D. G. Hogarth and Leonard Woolley, the latter assisted by T. E. Lawrence. The Mesopotamian collections were greatly augmented by excavations in southern Iraq after the First World War. From Tell al-Ubaid came the bronze furnishings of a Sumerian temple, including life-sized lions and a panel featuring the lion-headed eagle Indugud found by H. R. Hall in 1919–24. Woolley went on to excavate Ur between 1922 and 1934, discovering the 'Royal Cemeteries' of the 3rd millennium BC. Some of the masterpieces include the 'Standard of Ur', the 'Ram in a Thicket', the 'Royal Game of Ur', and two bull-headed lyres. The department also has three diorite statues of the ruler Gudea from the ancient state of Lagash and a series of limestone kudurru or boundary stones from different locations across ancient Mesopotamia."]}, {"page": "Ur", "response": ["Excavations from 1922 to 1934 were funded by the British Museum and the University of Pennsylvania and led by the archaeologist Sir Charles Leonard Woolley.Leonard Woolley, Ur: The First Phases, Penguin, 1946.Leonard Woolley, Excavations at Ur: A Record of Twelve Years' Work, Apollo, 1965, .Leonard Woolley and P. R. S. Moorey, Ur of the Chaldees: A Revised and Updated Edition of Sir Leonard Woolley's Excavations at Ur, Cornell University Press, 1982, . A total of about 1,850 burials were uncovered, including 16 that were described as \"royal tombs\" containing many valuable artifacts, including the Standard of Ur. Most of the royal tombs were dated to about 2600 BC. The finds included the unlooted tomb of a queen thought to be Queen PuabiQueen Puabi is also written Pu-Abi and formerly transcribed as Shub-ab. -—the name is known from a cylinder seal found in the tomb, although there were two other different and unnamed seals found in the tomb. Many other people had been buried with her, in a form of human sacrifice. Near the ziggurat were uncovered the temple E-nun-mah and buildings E-dub-lal-mah (built for a king), E-gi-par (residence of the high priestess) and E-hur-sag (a temple building). Outside the temple area, many houses used in everyday life were found. Excavations were also made below the royal tombs layer: a  layer of alluvial clay covered the remains of earlier habitation, including pottery from the Ubaid period, the first stage of settlement in southern Mesopotamia. Woolley later wrote many articles and books about the discoveries. One of Woolley's assistants on the site was the archaeologist Max Mallowan. The discoveries at the site reached the headlines in mainstream media in the world with the discoveries of the Royal Tombs. As a result, the ruins of the ancient city attracted many visitors. One of these visitors was the already famous Agatha Christie, who as a result of this visit ended up marrying Max Mallowan."]}, {"page": "1960", "response": ["** Leonard Woolley, English archaeologist (b. 1880)"]}, {"page": "T. E. Lawrence", "response": ["In 1910, Lawrence was offered the opportunity to become a practising archaeologist at Carchemish, in the expedition that D. G. Hogarth was setting up on behalf of the British Museum.Wilson, 1989, p. 70. Hogarth arranged a \"Senior Demyship\" (a form of scholarship) for Lawrence at Magdalen College, Oxford, to fund his work at £100 a year.Wilson, p. 73. He sailed for Beirut in December 1910 and went to Byblos, where he studied Arabic.Wilson, 1989, pp. 76–77. He then went to work on the excavations at Carchemish, near Jerablus in northern Syria, where he worked under Hogarth, R. Campbell Thompson of the British Museum, and Leonard Woolley until 1914.Wilson, 1989, pp. 76–134. He later stated that everything which he had accomplished he owed to Hogarth. Lawrence met Gertrude Bell while excavating at Carchemish.Wilson, 1989, p. 88. He worked briefly with Flinders Petrie in 1912 at Kafr Ammar in Egypt.Wilson, 1989, pp. 99–100.", "*The Wilderness of Zin, by C. Leonard Woolley and T. E. Lawrence. London, Harrison and Sons, 1914.", "Lawrence's biographers have discussed his sexuality at considerable length and this discussion has spilled into the popular press.The Sunday Times pieces appeared on 9, 16, 23, and 30 June 1968, and were based mostly on the narrative of John Bruce. There is no reliable evidence for consensual sexual intimacy between Lawrence and any person. His friends have expressed the opinion that he was asexual,E.H.R. Altounyan in Lawrence, A. W., 1937.Knightley and Simpson, 1970, p. 29 and Lawrence himself specifically denied any personal experience of sex in multiple private letters.Brown, 1988, letters to E. M. Forster (21 Dec 1927), Robert Graves (6 Nov 1928), F. L. Lucas (26 March 1929). There were suggestions that Lawrence had been intimate with Dahoum, who worked with him at a pre-war archaeological dig in Carchemish,C. Leonard Woolley in A. W. Lawrence, 1937, p. 89 and fellow serviceman R. A. M. Guy,Wilson, 1989, chapter 32. but his biographers and contemporaries found them unconvincing.Wilson, 1989, chapter 27."]}, {"page": "Sumer", "response": ["Some of the most famous masterpieces are the Lyres of Ur, which are considered to be the world's oldest surviving stringed instruments. They have been discovered by Leonard Woolley when the Royal Cemetery of Ur has been excavated between from 1922 and 1934."]}, {"page": "Mortimer Wheeler", "response": ["Wheeler arrived in Bombay in the spring of 1944. There, he was welcomed by the city's governor, John Colville, before heading by train to Delhi and then Simla, where the headquarters of the Archaeological Survey of India were located. Wheeler had been suggested for the job by Archibald Wavell, the Viceroy of India, who had been acting on the recommendations of the archaeologist Leonard Woolley, who had authored a report lamenting the state of the archaeological establishment in the British-controlled subcontinent. Wheeler recognised this state of affairs, in a letter to a friend complaining about the lack of finances and equipment, commenting that \"We're back in 1850\". He initially found much to dislike in India, and in his letters to friends in Britain expressed derogatory and racist sentiments toward Indians: he stated that \"they feed wrongly and think wrongly and live wrongly ... I already find myself regarding them as ill-made clockwork toys rather than as human beings, and I find myself bullying them most brutally.\" He expelled those staff members whom he deemed too idle, and physically beat others in an attempt to motivate them.", "Piggott believed that Wheeler's greatest impact was as \"the great innovator in field techniques\", comparing him in this respect to Pitt-Rivers. Piggott stated that the \"importance of Wheeler's contribution to archaeological technique, enormous and far-reaching, lies in the fact that in the early 1920s he not only appreciated and understood what Pitt-Rivers had done, but saw that his work could be used as a basis for adaptation, development and improvement.\" L. C. Carr stated that it was for his methodological developments, oft termed \"the Wheeler Method\", that Wheeler was best known; in this she contrasted him with those archaeologists who were best known for their associations with a specific archaeological site, such as Arthur Evans and Knossos or Leonard Woolley and Ur."]}, {"page": "Raiders of the Lost Ark", "response": ["In 1975, Lucas discussed his serial film idea with his friend Philip Kaufman. The pair worked on a story for two weeks. Lucas imagined his character as a college professor and archaeologist adventurer, based on his own appreciation for archaeology and famous archaeologists like Hiram Bingham III, Roy Chapman Andrews, and Leonard Woolley. Kaufman removed Lucas' vision of Smith as a nightclub patron and womanizer, and suggested the Ark of the Covenant as the film's central goal; he learned of the Ark from his childhood dentist. The Ark provided a source of conflict for the hero and the Nazis, playing off Nazi leader Adolf Hitler's historical fascination with the occult."]}, {"page": "Architecture of Mesopotamia", "response": ["Ur-Nammu's ziggurat at Ur was designed as a three-stage construction, but today only two of these survive. This entire mudbrick core structure was originally given a facing of baked brick envelope set in bitumen, 2.5 m on the first lowest stage, and 1.15 m on the second. Each of these baked bricks were stamped with the name of the king. The sloping walls of the stages were buttressed. The access to the top was by means of a triple monumental staircase, which all converges at a portal that opened on a landing between the first and second stages. The height of the first stage was about 11 m while the second stage rose some 5.7 m. Usually, a third stage is reconstructed by the excavator of the ziggurat (Leonard Woolley), and crowned by a temple. At the Chogha Zanbil ziggurat, archaeologists have found massive reed ropes that ran across the core of the ziggurat structure and tied together the mudbrick mass."]}, {"page": "Amarna", "response": ["From 1921 to 1936 an Egypt Exploration Society expedition returned to excavation at Amarna under the direction of T.E. Peet, Sir Leonard Woolley, Henri Frankfort, Stephen GlanvilleGrundon(2007), p. 71 and John Pendlebury. Mary Chubb served as the digs administrator. The renewed investigations were focused on religious and royal structures."]}, {"page": "List of archaeologists", "response": ["*Leonard Woolley (1880–1960) British; Ur in Mesopotamia"]}, {"page": "Charles Leonard Woolley", "response": ["#redirect Leonard Woolley"]}, {"page": "Near East", "response": ["Resorting to this verbal device, however, did not protect the \"Ancient Near East\" from the inroads of \"the Middle East\". For example, a high point in the use of \"Ancient Near East\" was for Biblical scholars the Ancient Near Eastern Texts relating to the Old Testament by James Bennett Pritchard, a textbook of first edition dated 1950. The last great book written by Leonard Woolley, British archaeologist, excavator of ancient Ur and associate of T. E. Lawrence and Arthur Evans, was The Art of the Middle East, Including Persia, Mesopotamia and Palestine, published in 1961. Woolley had completed it in 1960 two weeks before his death. The geographical ranges in each case are identical."]}, {"page": "Flinders Petrie", "response": ["The Petrie Medal was created in celebration of Petrie's seventieth birthday, when funds were raised to commission and produce 20 medals to be awarded \"once in every three years for distinguished work in Archaeology, preferably to a British subject\".Peter J. Ucko and Stephen Quirke, \"The Petrie Medal\", Public Archaeology, vol. 5, no. 1 (2006), pp. 15-25. http://www.tandfonline.com/doi/abs/10.1179/pua.2006.5.1.15?journalCode=ypua20 The first medal was awarded to Petrie himself (1925), and the first few recipients included Sir Aurel Stein (1928), Sir Arthur Evans (1931), Abbé Henri Breuil (1934), Prof. J.D. Beazley (1937), Sir Mortimer Wheeler (1950), Prof. J.B. Wace (1953), and Sir Leonard Woolley (1957).Sarah Strong and Helen Wang, \"Sir Aurel Stein's Medals at the Royal Geographical Society\", in Helen Wang (ed.) Sir Aurel Stein, Colleagues and Collections (British Museum Research Publication 184) (2012). https://www.britishmuseum.org/research/publications/research_publications_series/2012/sir_aurel_stein.aspx"]}, {"page": "Lord Edgware Dies", "response": ["Reginald Campbell Thompson (21 August 1876 – 23 May 1941), married to Barbara, was an eminent British archaeologist and the second expedition leader to employ Christie's husband Max Mallowan to work on one of his digs. The offer of work came in 1930 when Mallowan's employer, Leonard Woolley, was proving difficult over his proposed marriage to Agatha and their wish that she should join her husband on the dig at Ur although the real opposition came from Leonard Woolley's difficult wife, Katharine (see the dedication to The Thirteen Problems). Thompson's dig was at Nineveh and Max joined the team there in September 1931 followed the next month by Agatha. The invitation was only confirmed after the Mallowans had joined Thompson for a weekend in the country near Oxford where they were subjected to a cross-country scramble on \"the wettest day possible over rough country\" followed by another test to ensure that neither Agatha nor Max were fussy eaters. These were to ensure that both could withstand the rigours of a season in the wilds of Iraq. Used to walking over Dartmoor and having a very healthy appetite, Agatha passed the tests with flying colours."]}, {"page": "Urfa", "response": ["According to some Jewish and Muslim sources, Urfa is Ur Kasdim, the hometown of Abraham, the grandfather of Jacob whom God named Israel. This identification was disputed by Leonard Woolley, the excavator of the Sumerian city of Ur in 1927 and scholars remain divided on the issue. Urfa is also one of several cities that have traditions associated with Job."]}, {"page": "Jacquetta Hawkes", "response": ["After the couple's move to Alveston in the early 1960s, Hawkes became President of the Warwickshire branch of the Campaign for the Preservation of Rural England and a trustee of the Shakespeare Birthplace Trust. Her archaeological research continued, co-editing with Leonard Woolley UNESCO's book on prehistory entitled History of Mankind, which was published in 1963. Hawkes was responsible for writing the sections on the palaeolithic and neolithic, whereas Woolley's approach renounced the global and he wrote on the Bronze Age in the area that was then termed 'the fertile crescent'. Reviewed by Dutch archaeologist Sigfried J. De Laet, Hawkes' writing style was praised as was her emphasis on a 'global' prehistory; however some of the factual information she included was accused of being out of date.", "* Hawkes, Jacquetta, and Sir Leonard Woolley. History of mankind. Vol. 1. International Commission for a History of the Scientific and Cultural Development of Mankind, 1963."]}, {"page": "Puabi", "response": ["Puabi (Akkadian: 𒅤𒀀𒉿 Pu-A-Bi \"Word of my father\"), also called Shubad or Shudi-Ad due to a misinterpretation by Sir Charles Leonard Woolley, was an important person in the Sumerian city of Ur, during the First Dynasty of Ur (c. 2600 BCE). Commonly labeled as a \"queen\", her status is somewhat in dispute, although several cylinder seals in her tomb, labeled grave PG 800 at the Royal Cemetery at Ur, identify her by the title \"nin\" or \"eresh\", a Sumerian word denoting a queen or a priestess. As most women's cylinder seals at the time would include a reference to one's husband, the fact that Puabi's seal does not place her in relation to any king or husband supports the theory that she ruled on her own. It has been suggested that she was the second wife of king Meskalamdug. The fact that Puabi, herself a Semitic Akkadian, was an important figure among Sumerians, indicates a high degree of cultural exchange and influence between the ancient Sumerians and their Semitic neighbors. Although little is known about Puabi's life, the discovery of Puabi's tomb and its death pit reveals important information as well as raises questions about Mesopotamian society and culture.", "British archaeologist Leonard Woolley discovered the tomb of Puabi, which was excavated between 1922 and 1934 by a joint team sponsored by the British Museum and the University of Pennsylvania Museum of Archaeology and Anthropology. Puabi's tomb was found along with some 1,800 other graves at the Royal Cemetery at Ur. Puabi's tomb was clearly unique among the other excavations, not only because of the large number of high-quality and well-preserved grave goods, but also because her tomb had been untouched by looters through the millennia. ", "A number of \"death pits\" were also found outside of the chambers as well as above Puabi's chamber, which calls into question the initial attribution of the death pits to Puabi specifically. The largest and most well-known death pit held 74 attendants, 6 men and 68 women, all adorned with various gold, silver, and lapis decoration, and one female figure that appeared to be more elaborately adorned than the others. She was also buried with 52 attendants: servants, guards, horse, lions, a chariot and several other bodies—retainers who were suspected by excavator Leonard Woolley to have poisoned themselves (or been poisoned by others) to serve their mistress in the next world. In Puabi's chamber, the remains of three other people were found, and these personal servants had minor adornments of their own. The pit found above Puabi's chamber contained 21 attendants, an elaborate harp/lyre, a chariot, and what was left of a large chest of personal grooming items. Due to the location of the pits and general lack of evidence, it is largely unclear whether the death pits can be directly linked to Puabi."]}, {"page": "Ubaid period", "response": ["The Ubaid period (c. 6500–3800 BC)Carter, Robert A. and Philip, Graham  Beyond the Ubaid: Transformation and Integration in the Late Prehistoric Societies of the Middle East (Studies in Ancient Oriental Civilization, Number 63) The Oriental Institute of the University of Chicago (2010)  p. 2; \"Radiometric data suggest that the whole Southern Mesopotamian Ubaid period, including Ubaid 0 and 5, is of immense duration, spanning nearly three millennia from about 6500 to 3800 B.C.\" is a prehistoric period of Mesopotamia. The name derives from Tell al-'Ubaid where the earliest large excavation of Ubaid period material was conducted initially by Henry Hall and later by Leonard Woolley.Hall, Henry R. and Woolley, C. Leonard. 1927. Al-'Ubaid. Ur Excavations 1. Oxford: Oxford University Press."]}, {"page": "Arpachshad", "response": ["Some ancient Jewish sources, particularly Jubilees, point to Arpachshad as the immediate progenitor of Ura and Kesed, who allegedly founded the city of Ur Kesdim (Ur of the Chaldees) on the west bank of the Euphrates (Jub. 9:4; 11:1-7) — the same bank where Ur, identified by Leonard Woolley in 1927 as Ur of the Chaldees, is located."]}, {"page": "Penguin Books", "response": ["Some of the volumes, such as Nikolaus Pevsner's Leaves of Southwell (1945) or Wilfrid Blunt's Tulipomania (1950) were pioneering works of scholarship. Others such as The Bayeux Tapestry by Eric Maclagan (1943), Ur : The First Phases by Leonard Woolley (1946) or Russian Icons (1947) by David Talbot Rice were distillations by experts of their own pioneering works. Some volumes by experts went into revised editions, such as A Book of English Clocks (1947 and 1950) by R. W. Symonds."]}, {"page": "1937 in archaeology", "response": ["* Excavations at Alalakh, Turkey, conducted by Leonard Woolley, begin (continue until 1949, interrupted by World War II)."]}, {"page": "1911 in archaeology", "response": ["* Excavations of the Hittite city of Carchemish, northern Syria, by D. G. Hogarth of the Ashmolean Museum with Leonard Woolley and T. E. Lawrence (continues to 1914)."]}, {"page": "Alalakh", "response": ["Tell Atchana was excavated by the British archaeologist Sir Leonard Woolley in the years 1937–1939 and 1946–1949. His team discovered palaces, temples, private houses and fortification walls, in 17 archaeological levels reaching from late Early Bronze Age (Level XVII, c. 2200–2000 BC to Late Bronze Age (Level 0, 13th century BC). Among their finds was the inscribed statue of Idrimi, a king of Alalakh c.early 15th century BC.", "Leonard Woolley, Alalakh, An Account of the Excavations at Tell Atchana 1937-1949 (Reports of the Research Committee of the Society of Antiquaries of London), Oxford, 1955", "*C. Leonard Woolley, Alalakh: An Account of the Excavations at Tell, Oxford University Press, 1955"]}, {"page": "1922 in the United Kingdom", "response": ["* 2 November – Archaeologist Leonard Woolley begins excavations at the Sumerian city of Ur."]}, {"page": "Nicholson Museum", "response": ["The Nicholson Museum's collection of Near Eastern artefacts represents many of the great cities and civilisations that flourished along the Levantine coast, across Mesopotamia and through to Pakistan and India. The Near Eastern collection began with just a handful of artefacts from Ur, donated by the British Museum in 1926. This was greatly expanded upon in the mid 20th century by the acquisition program of the curators A.D. Trendall and his successor James Stewart. Both curators wrote countless letters to museums and government agencies around the world requesting representative samples of artefacts to ensure the Nicholson Museum's holdings reflected the diversity of this expansive region. The University of Sydney also contributed financially to archaeological excavations and projects in the Near East, most notably Dame Kathleen Kenyon’s excavations at Jericho. In return for the University's support the Nicholson Museum received a consignment of objects at the end of each season including full tomb groups from the Bronze Age and rare finds such as our Neolithic over plastered skull. Other items have been acquired through generous donations of individual archaeologists, including Sir Leonard Woolley and Sir Flinders Petrie, as well as from archaeological institutes, museums and private donors."]}, {"page": "Royal Game of Ur", "response": ["The Game of Ur received its name because it was first rediscovered by the English archaeologist Sir Leonard Woolley during his excavations of the Royal Cemetery at Ur between 1922 and 1934. Copies of the game have since been found by other archaeologists across the Middle East. The rules of the Game of Ur as it was played in the second century BC have been preserved on a Babylonian clay tablet written by the scribe Itti-Marduk-balāṭu. Based on this tablet and the shape of the , British Museum curator Irving Finkel reconstructed the basic rules of how the game might have been played. The object of the game is to run the course of the board and bear all one's pieces off before one's opponent. Like modern backgammon, the game combines elements of both strategy and luck.", "The British archaeologist Sir Leonard Woolley discovered five gameboards of the Game of Ur during his excavation of the Royal Cemetery at Ur between 1922 and 1934. Because the game was first discovered in the Royal Cemetery at Ur, it became known as the \"Royal Game of Ur\", but later archaeologists uncovered other copies of the game from other locations across the Middle East. Each of the boards discovered by Woolley date to around 3,000 BC. All five boards were of an identical type, but they were made of different materials and had different decorations. Woolley reproduced images of two of these boards in his 1949 book, The First Phases. One of these is a relatively simple set with a background composed of discs of shell with blue or red centers set in wood-covered bitumen. The other is a more elaborate one completely covered with shell plaques, inlaid with red limestone and lapis lazuli. Other gameboards are often engraved with images of animals."]}, {"page": "Sir Leonard Wooley", "response": ["#REDIRECT Leonard Woolley"]}, {"page": "Geoffrey Woolley", "response": ["Woolley was the son of a clergyman, Rev. George Herbert Woolley, the curate of St Matthew’s, Upper Clapton, in London, and his wife Sarah.  He had seven sisters and three brothers, including the famous archaeologist Sir Leonard Woolley and George Cathcart Woolley, a colonial administrator and ethnographer. Woolley was educated at Parmiter's School, Bethnal Green, St John's School, Leatherhead and The Queen's College, Oxford."]}, {"page": "Grahame Clark", "response": ["In 1928 Clark began his studies in archaeology, which was then taught alongside physical anthropology and social anthropology within the university's anthropology department. The department was run by the Disney Professor Ellis Minns—whose ideas influenced Clark—while the archaeology curriculum was largely organised by Miles Burkitt, an unpaid lecturer of private means. Providing himself with a broad-based grounding in archaeology, Clark sat in on lectures given by archaeologists like Gertrude Caton Thompson, Dorothy Garrod, Leonard Woolley, and Childe. Although the Cambridge syllabus did not provide opportunities for excavation, Clark assisted the non-professional archaeologist Eliot Curwen during his excavations of the Whitehawk Neolithic causewayed camp near Brighton and then The Trundle, an Iron Age hillfort and Neolithic causewayed enclosure near Chichester. It was at the latter that he befriended two fellow excavators, Stuart Piggott and Charles Philips, who became lifelong friends. He also visited a number of Mortimer Wheeler's excavations, although never worked on them. Clark graduated in 1930 with a first-class honours degree."]}, {"page": "Roger Moorey", "response": ["Moorey's excavation interests and experiences were broad, excavating  at Jerusalem under Kathleen Kenyon in 1963 and in Abu Salabikh in Iraq under Nicholas Postgate in the 1970s. In 1982 Moorey edited Ur of the Chaldees, a republication of Leonard Woolley's 1954 Excavations at Ur, adding new photographs and information, and deleting some references to the Book of Genesis.Book review in the Wilson Quarterly, 1982.", "* Leonard Woolley & P.R.S. Moorey. Ur 'of the Chaldees': A Revised and Updated Edition of Sir Leonard Woolley's Excavations at Ur. Cornell University Press, 1982. "]}, {"page": "Ancient music", "response": ["In 1929, Leonard Woolley discovered pieces of four different harps while excavating the ruins of the ancient city Ur, located in what was Ancient Mesopotamia and what is now contemporary Iraq. The fragments have been dated to 2750  and some are now located at the University of Pennsylvania, the British Museum in London, and in Baghdad. Various reconstructions and restorations of the instruments have been attempted, but it was observed by many that none have been completely satisfactory. Depending on various definitions, they could be classified as lyres rather than harps, the most famous being the bull-headed harp, held in Baghdad. However, the Iraq War in 2003 led to the destruction of the bull-head lyre."]}, {"page": "Ziggurat of Ur", "response": ["Its remains were excavated in the 1920s and 1930s by Sir Leonard Woolley. Under Saddam Hussein in the 1980s, they were encased by a partial reconstruction of the façade and the monumental staircase. The Ziggurat of Ur is the best-preserved of those known from Iran and Iraq, besides the ziggurat of Dur Untash (Chogha Zanbil). It is one of three well-preserved structures of the Neo-Sumerian city of Ur, along with the Royal Mausolea and the Palace of Ur-Nammu (the E-hursag).", "After World War I, preliminary excavations were performed by Reginald Campbell Thompson and Henry Hall. The site was extensively excavated in the 1920s by Sir Leonard Woolley by appointment of the University Museum of the University of Pennsylvania and the British Museum in the period of 1922 to 1934.", "*Woolley, C. Leonard and  Moorey, P. R. S.,  Ur of the Chaldees: Revised and Updated Edition of Sir Leonard Woolley's Excavations at Ur, Cornell University Press (1982)."]}, {"page": "Palestine Exploration Fund", "response": ["*The Wilderness of Zin Archaeological Survey (1913–1914); conducted by Sir Leonard Woolley and T. E. Lawrence."]}, {"page": "The Sittaford Mystery", "response": ["On the journey, she found herself in the company of a tedious Englishwoman who was determined to take Christie \"under her wing\", although that was the last thing she wanted. Desperate to escape she travelled to Ur and made the acquaintance of the archaeological expedition's leader, Leonard Woolley (1880–1960) and his wife, Katharine (1888–1945). Visitors to the dig were usually discouraged but Katharine Woolley was a great admirer of The Murder of Roger Ackroyd and, being an imperious and difficult woman who always got her way in things large and small (Gertrude Bell described Katherine as \"dangerous\"), Christie was treated as an honoured guest. In 1929, Christie gave the Woolleys the temporary use of her then residence in Cresswell Place in London and they, in turn, invited her back to the dig at the end of the season."]}, {"page": "Murder in Mesopotamia", "response": ["Christie reportedly based the character of Louise Leidner on Katharine Woolley, the wife of archaeologist Sir Leonard Woolley. Christie's husband Max Mallowan had worked on Woolley's excavation at Ur."]}, {"page": "1880 in archaeology", "response": ["* April 17 – Leonard Woolley, British archaeologist of Mesopotamia (d. 1960)"]}, {"page": "1923 in archaeology", "response": ["* Copper Bull from Leonard Woolley's excavations at Ur."]}, {"page": "1960 in archaeology", "response": ["* February 20 - Leonard Woolley, English archaeologist (b. 1880)"]}, {"page": "1927 in archaeology", "response": ["* Leonard Woolley's excavations at Ur uncover the Enheduanna calcite disc."]}, {"page": "1936 in archaeology", "response": ["* Al Mina, Syria, by Leonard Woolley."]}, {"page": "1935 in archaeology", "response": ["* Leonard Woolley knighted for his work in archaeology."]}, {"page": "Ziwiye hoard", "response": ["Objects from the hoard provide a link between the cultures of the Iranian plateau and the nomadic or Scythian art forms known as the \"animal style\". \"The Scythian motives adopted by Urartu account for the decoration of the great Treasure of Saqqez brought to light on the south shore of Lake Urmia,\" was Leonard Woolley's assessment (Woolley 1961 p 176)."]}]}}