{"wiki_id": "http://www.wikidata.org/entity/Q3568745", "itemLabel": "William John Macleay", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_John_Macleay", "wikipedia_page": {"main": "Sir William John Macleay (13 June 1820 – 7 December 1891) was a Scottish-Australian politician, naturalist, zoologist, and herpetologist.", "link_mentions": [{"page": "Lawrence Hargrave", "response": ["In 1872, as an engineer, he sailed on the Maria on a voyage to New Guinea but the ship was wrecked. In 1875, he again sailed as an engineer on William John Macleay's expedition to the Gulf of Papua. From October 1875 to January 1876 he was exploring the hinterland of Port Moresby under Octavius Stone, and in April 1876 went on another expedition under Luigi D'Albertis for over 400 miles up the Fly River on the SS Ellengowan. In 1877 he was inspecting the newly developing pearling industry for Parbury Lamb and Co. He returned to Sydney, joined the Royal Society of New South Wales in 1877, and in 1878 became an assistant astronomical observer at Sydney Observatory. He held this position for about five years, retired in 1883 with a moderate competency, and gave the rest of his life to research work."]}, {"page": "Gerard Krefft", "response": ["Krefft was fired in 1874. He was carried in his chair to the door of the Museum and thrown into the street. He had fallen foul of the Trustees, William John Macleay in particular, because he had accused them of using the museum's resources to augment private collections. They responded by accusing him of drunkenness, falsifying attendance records and even allowing the sale of dirty postcards. He subsequently brought an action against one of the trustees and obtained a verdict for £250. The judge held that Krefft was a superior officer under government, and that no one had power to remove him but the governor with the advice of the executive council. Subsequently, parliament passed a vote of £1000 to be applied in satisfaction of Krefft's claims. In 1877 he began the publication of Krefft's Nature in Australia, a popular journal for the discussion of questions of natural history, but it quickly ceased publication. Krefft died on 19 February 1881 from congestion of the lungs, he was buried in the churchyard of St Jude's Church of England, Randwick. He was survived by his wife Annie, née McPhail, whom he had married on 6 February 1869, and two sons."]}, {"page": "Inland taipan", "response": ["The inland taipan (Oxyuranus microlepidotus), also commonly known as the western taipan, the small-scaled snake or the fierce snake,White, Julian (November 1991). Oxyuranus microlepidotus . \"Neurotoxic paralysis usually takes 2-4 hours to become clinically detectable. Coagulopathy however may become well established within 30 minutes of a bite\" International Programme on Chemical Safety. Retrieved November 8, 2013. is a species of extremely venomous snake in the family Elapidae. The species is endemic to semi-arid regions of central east Australia.Cecilie Beatson (November 29, 2011). Animal Species: Inland Taipan  Australian Museum. Retrieved October 14, 2013. Aboriginal Australians living in those regions named the snake dandarabilla.Queensland Snakes . History & Discovery. (archived) Queensland Museum. Retrieved November 15, 2013. It was first described by Frederick McCoy in 1879 and then by William John Macleay in 1882, but for the next 90 years it was a mystery to the scientific community; no further specimens were found, and virtually nothing was added to the knowledge of this species until its rediscovery in 1972.Rediscovery. The Rediscovery of the Western Taipan. (archived) Queensland Museum. Retrieved November 15, 2013.", "The inland taipan first came to the attention of Western science in 1879. Two specimens of the fierce snake were discovered in the junction of the Murray and Darling Rivers in northwestern Victoria and described by Frederick McCoy, who called the species Diemenia microlepidota, or small-scaled brown snake. In 1882 a third specimen was found near Bourke, New South Wales, and William John Macleay described the same snake under the name Diemenia ferox (thinking it was a different species). No more specimens were collected until 1972. In 1896 George Albert Boulenger classified both as belonging to the same genus, Pseudechis (black snakes), referring them as Pseudechis microlepidotus and Pseudechis ferox."]}, {"page": "List of authors of names published under the ICZN", "response": ["* Macleay – William John Macleay (1820–1891)"]}, {"page": "Luigi D'Albertis", "response": ["Only Leiopython albertisii (the white-lipped python) is currently recognised as a valid species, the other three reptiles being synonymised within species described earlier, ironically two of which were described by entomologist Sir William John Macleay whose rival expedition on the Chevert, was also collecting specimens in southern Papua."]}, {"page": "Woma python", "response": ["William John Macleay originally described the species in 1882 as Aspidiotes ramsayi. The specific name, ramsayi, is in honor of Australian zoologist Edward Pierson Ramsay.O'Shea M (2007). Boas and Pythons of the World. London: New Holland Publishers Ltd. 160 pp. .Beolens, Bo; Watkins, Michael; Grayson, Michael (2011). The Eponym Dictionary of Reptiles. Baltimore: Johns Hopkins University Press. xiii + 296 pp. . (Aspidites ramsayi, p. 216).", "Category:Taxa named by William John Macleay"]}, {"page": "William Sharp Macleay", "response": ["He took possession of the estate in 1845, having taken on his father Alexander's considerable debts and the mortgages on the property (he formally inherited it in 1848). In an attempt to raise funds, he also sold furniture he had acquired in London on behalf of his father, but for which he had never been reimbursed. He did not, however, complete the house, and it remained without its planned colonnade. The house became a meeting place for a small circle of intellectuals and naturalists, though Macleay was not known for being actively sociable. Thomas Mitchell Jnr satirised the house and owner: 'Bleak House blears blindly o'er Eliza's Bay, chill as its owner's hospitality' (Carlin, p. 45). Macleay was interested in the natural history of Australia, the marine fauna around Port Jackson in particular. Later, he collected a large number of Australian insects; on his death, these were bequeathed to his cousin William John Macleay, whose interest in natural history he encouraged and who in 1888 transferred them to the Macleay Museum, University of Sydney, for which act he was knighted. "]}, {"page": "Ompax spatuloides", "response": ["Doubts about the existence of the species were expressed as soon as 1881, when William John Macleay included it in a faunal list, but the name continued to appear throughout the twentieth century."]}, {"page": "Macleay Museum", "response": ["The building in which the museum is housed was built off Science Lane within the Camperdown campus in 1887. The collections of the Macleay Museum are based largely on the efforts and acquisitions of the Macleay family, one of the pre-eminent families in colonial Sydney including Alexander Macleay, William Sharp Macleay and William John Macleay. The zoologist and collector George Masters served as curator until 1912."]}, {"page": "Hylophorbus", "response": ["Category:Taxa named by William John Macleay"]}, {"page": "Alexander Macleay", "response": ["William John Macleay, his nephew, was also an explorer and collector in Australia and New Guinea."]}, {"page": "Girella cyanea", "response": ["Category:Taxa named by William John Macleay"]}, {"page": "James Macarthur-Onslow", "response": ["* Sir William John Macleay (1820–1891)Michael Hoare, Martha Rutledge, 'Macleay, Sir William John (1820–1891)', Australian Dictionary of Biography, Volume 5, Melbourne University Press, 1974, pp. 185–187. – Alexander Macleay's nephew"]}]}}