{"wiki_id": "http://www.wikidata.org/entity/Q3569070", "itemLabel": "Willie Fagan", "itemDescription": "Scottish footballer (1917-1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Fagan", "wikipedia_page": {"main": "William Fagan (20 February 1917 – 29 February 1992) was a Scottish footballer, who played for Celtic, Preston North End and Liverpool.\n\n", "link_mentions": [{"page": "Liverpool F.C.", "response": ["| Willie Fagan || 1945–1947"]}, {"page": "Weymouth F.C.", "response": ["*  Willie Fagan (July 1952 – 1955)"]}, {"page": "1991–92 in English football", "response": ["* 29 February 1992 - Willie Fagan, 75, began his playing career in his native Scotland with Celtic before moving south of the border to Preston in 1936, moving to Liverpool a year later and making 158 league appearances as a forward, scoring 47 goals, before ending his senior career at Anfield in 1952. He collected a league title winner's medal with Liverpool in 1947 but was prevented from enjoying more success on Merseyside due to his career being disrupted by World War II."]}, {"page": "George Kay", "response": ["Despite the set-back of an opening day 1–6 defeat at Chelsea's Stamford Bridge, Liverpool finished the 1937–38 season comfortably in mid-table, with Alf Hanson top scorer on 14 league goals. In the following season, Liverpool again finished in 11th position in the table, with Berry Nieuwenhuys, Willie Fagan and Phil Taylor joint top scorers in the league with 14 goals each."]}, {"page": "Cyril Done", "response": ["Born in Liverpool, Done played for Bootle Boys' Brigade before being spotted as a 17-year-old by \"Reds\" manager George Kay who took him to Anfield in January 1938. He made his debut 18 months later on 2 September 1939 in a 1–0 home win over Chelsea; and it was Done who got the winner, thus opening his account in the same match. This game proved to be the last 'official' game for six years due to the outbreak of World War II; during the war he scored 147 goals in 137 games. Done rejoined Liverpool after the war; after missing the first nine games of the 1946–47 season he made an impact on the side by scoring the \"Reds\" goal in their 1–1 home draw with Charlton. He then followed this up by scoring his first hat-trick for the club on 19 October 1946 at Leeds Road, his goals, which came in the 29th, 43rd and 76th minute, along with a Jack Balmer last minute strike helped humble their hosts, Huddersfield, by a 4–1 scoreline. He repeated this feat, this time at Anfield on 12 February 1947 in a 5–0 victory over Grimsby, his goals came in the 24th, 40th and 85th minutes, Willie Fagan scored the other two in the 30th and 32nd minutes. Done's contribution in his 17 league appearances, scoring 10 goals, went a long way in helping Liverpool go on to win the first post-war championship. Liverpool dropped to 14th in 1947–48, and Done played just the six games. The club finished in mid-table again in 1948–49, with Done scoring 13 goals in 28 games. Done struggled to hold down a place in the Liverpool starting line-up and completely missed out on the 1950 FA Cup run; he scored five goals in 16 league games. He scored three goals in 25 games in 1950–51, and got four goals in 12 games in 1951–52."]}, {"page": "1937 FA Cup Final", "response": ["| ||10|| Willie Fagan"]}, {"page": "1950 FA Cup Final", "response": ["|IL ||10|| Willie Fagan"]}, {"page": "William Fagan", "response": ["* Willie Fagan (1917–1992), footballer who played for Liverpool"]}, {"page": "1944–45 in Scottish football", "response": ["The two teams met again on 3 February 1945 at Villa Park, Birmingham in front of a crowd of 65,780. England won again, this time 3–2, with Jimmy Delaney and Jock Dodds accounting for Scotland's goals. The Scotland team featured: Bobby Brown, Jim Harley, Jimmy Stephen, Matt Busby, Bob Thyne, Archie Macaulay, Jimmy Delaney, Willie Fagan, Jock Dodds, Andy Black, Billy Liddell."]}, {"page": "1946–47 Liverpool F.C. season", "response": ["* Willie Fagan"]}]}}