{"wiki_id": "http://www.wikidata.org/entity/Q3568441", "itemLabel": "William Blundell Spence", "itemDescription": "British artist and dealer (1814-1900)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Blundell_Spence", "wikipedia_page": {"main": "William Blundell Spence (13 January 1814 – 23 January 1900) was an English painter and art dealer.\nBorn in Drypool, Yorkshire, to noted entomologist William Spence and his wife Elizabeth Blundell, he spent the years 1826-1832 travelling abroad with his parents. In 1836 he settled in Florence, Italy, where he spent the rest of his life.As a painter, he specialized, mainly painting Alpine landscapes. At the 1870 Exhibition of Fine Arts in Parma, he exhibited an oil: Bagni of Lucca. Among other works are Dallo Porte Sante and La pensierosa. At Florence, in 1882: Veduta della Marina. In 1885, in the same city: Veduta del Chalet Plauta.Though not himself an entomologist, he joined the Entomological Society of London at its founding in 1833, and was noted as its longest-surviving original member.", "link_mentions": [{"page": "Cassone", "response": ["Since a cassone contained the personal goods of the bride, it was a natural vehicle for painted decoration commemorating the marriage in heraldry and, when figural painted panels began to be included in the decor from the early quattrocento, flattering allegory. The side panels offered a flat surface for a suitable painting, with subjects drawn from courtly romance or, much less often, religious subjects.  By the 15th century subjects from classical mythology or history became the most popular. Great Florentine artists of the 15th century were called upon to decorate cassoni, though as Vasari complains, by his time in the 16th century, artists thought such work beneath them.  Some Tuscan artists in Siena and Florence specialized in such cassone panels, which were preserved as autonomous works of art by 19th century collectors and dealers, who sometimes discarded the cassone itself. From the late 1850s, neo-Renaissance cassoni were confected for dealers like William Blundell Spence, Stefano Bardini or Elia Volpi in order to present surviving cassone panels to clients in a more \"authentic\" and glamorous presentation.Ellen Callmann, \"William Blundell Spence and the Transformation of Renaissance Cassoni\". The Burlington Magazine 141 (June 1999:338–348). "]}, {"page": "William Spence (entomologist)", "response": ["Spence was born in Bishop Burton in the East Riding of Yorkshire, the oldest of four children of farmer Robert Spence. He was apprenticed to Russian merchants and shipowners Carhill, Greenwood & Co. but little else is known about his early life except that at the age of ten he was in the care of a clergyman who taught him botany. He married Elizabeth Blundell in Hull on 30 June 1804 and very soon supported her brother Henry to set up the highly successful oil and colour company Blundell Spence. He was the father of artist and art dealer William Blundell Spence."]}, {"page": "Pallas and the Centaur", "response": ["The painting was then little-known until it was noticed in 1895 in one of the ante-rooms of the Palazzo Pitti by the English artist, living in Florence, William Blundell Spence.  The painting was in the Uffizi gallery from 1922.  It has perhaps been transferred from panel to canvas."]}, {"page": "William Blandell Spence", "response": ["#REDIRECT William Blundell Spence"]}, {"page": "Blundell", "response": ["*William Blundell Spence (1814–1900), English artist and art dealer"]}, {"page": "William Spence (disambiguation)", "response": ["*William Blundell Spence (1814–1900), English artist and art dealer"]}, {"page": "James Hudson (diplomat)", "response": ["Hudson was a collector of Italian art. His interest in painting fostered friendships with Massimo d'Azeglio, Prime Minister of Piedmont, and Giovanni Morelli, who were entertained at the British Legation. Hudson's mutual friends, art historian and diplomat Austen Layard and Florence-based English artist William Blundell Spence were visitors, and all could have been longstanding friends, Layard and Spence being at school together in Florence during Hudson's visit in 1829. First mention of Hudson's collection at the Legation was in 1856 by a National Gallery agent, who noted the Portrait of a Young Knight by Moretto da Brescia, seen again during a viewing of all Legation paintings by Sir Charles Eastlake, director of the National Gallery; The Moretto was acquired for the Gallery in 1857.Eastlake, Elizabeth Rigby (1895); Journals & Correspondence of Lady Eastlake, edited C. E. Smith, London, Volume 2, p. 98. Reprinted BiblioBazaar (2012). Portrait of a Young Knight, National Gallery No. 299 The same year, a description of the Legation was given by the wife of the secretary to the Prussian Minister at Turin who had heard of the richness of Hudson's home; she compared it favourably to other Turin legations, mentioning \"beautiful things\" and Hudson's devotion to paintings.de Brunsen, Mary Isabell (1909); In Three Legations, Charles Scribner's Sons, pp. 59, 61. Reprinted 2010.  At the end of his tenure Hudson sold the Legation artworks, but gave a Titian copy, ascribed to Poussin, to VerdiCarteggio Verdiano, edited A Luzzio, Rome (1935) Volume 3, p.20 and a Jacopo de' Barbari to Layard.National Gallery No. 3088"]}, {"page": "Guglielmo Blundell Spence", "response": ["#REDIRECT William Blundell Spence"]}]}}