{"wiki_id": "http://www.wikidata.org/entity/Q3568494", "itemLabel": "William Champion", "itemDescription": "English metallurgist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Champion_(metallurgist)", "wikipedia_page": {"main": "William Champion (1709–1789) is credited with patenting a process in Great Britain to distill zinc metal from calamine using charcoal in a smelter.", "link_mentions": [{"page": "Brass", "response": ["In 1738 Nehemiah's son William Champion patented a technique for the first industrial scale distillation of metallic zinc known as distillation per descencum or \"the English process\".Day 1991, pp. 179–181 This local zinc was used in speltering and allowed greater control over the zinc content of brass and the production of high-zinc copper alloys which would have been difficult or impossible to produce using cementation, for use in expensive objects such as scientific instruments, clocks, brass buttons and costume jewellery.Day 1991, p. 183 However Champion continued to use the cheaper calamine cementation method to produce lower-zinc brass and the archaeological remains of bee-hive shaped cementation furnaces have been identified at his works at Warmley. By the mid-to-late 18th century developments in cheaper zinc distillation such as John-Jaques Dony's horizontal furnaces in Belgium and the reduction of tariffs on zincDay 1991, pp. 186–189 as well as demand for corrosion-resistant high zinc alloys increased the popularity of speltering and as a result cementation was largely abandoned by the mid-19th century.Day 1991, pp. 192–93, Craddock and Eckstein 2003, p. 228"]}, {"page": "Zinc", "response": ["In 1738 in Great Britain, William Champion patented a process to extract zinc from calamine in a vertical retort-style smelter. His technique resembled that used at Zawar zinc mines in Rajasthan, but no evidence suggests he visited the Orient. Champion's process was used through 1851.", "William Champion's brother, John, patented a process in 1758 for calcining zinc sulfide into an oxide usable in the retort process. Prior to this, only calamine could be used to produce zinc. In 1798, Johann Christian Ruberg improved on the smelting process by building the first horizontal retort smelter. Jean-Jacques Daniel Dony built a different kind of horizontal zinc smelter in Belgium that processed even more zinc."]}, {"page": "1738", "response": ["* July 1 – English metallurgist William Champion is granted a patent for his process of extracting zinc from other materials in a furnace.Bennet Woodcroft, Titles of Patents of Invention, Chronologically Arranged, From March 2, 1617 (14 James I.) to October 1, 1852 (16 Victoriae). 1617-1823 (The Queen's Printing Office, 1854) p104-105"]}, {"page": "Timeline of materials technology", "response": ["*1738 – Metallic zinc processed by distillation from calamine and charcoal patented by William Champion"]}, {"page": "Calamine (mineral)", "response": ["In the 16th century demand for  latten (brass) in England came from the needs of wool-carding, for which brass-wire combs were preferred, and battery pieces (brassware formed by hammering  sheet brass in a battery mill). The only known method for producing the alloy was by heating copper and calamine together in  the cementation process and in 1568 a royal charter was granted to the Society of the Mineral and Battery Works to search for the mineral and produce brass, to reduce dependence on imported metal from Germany. Factories to exploit the process were established at Isleworth and Rotherhithe. By the late 17th century enough was known of metallic zinc to make brass solder directly by combining copper and  spelter (zinc ingots). In 1738 a patent was granted to William Champion, a Bristol brass founder, for the large-scale reduction of calamine to produce spelter."]}, {"page": "1738 in science", "response": ["* July 1 – William Champion of Bristol patents a process to distill zinc from calamine using charcoal in a smelter."]}, {"page": "History of Bristol", "response": [" which in turn encouraged the progress of the Industrial Revolution in the area. Prominent manufacturers such as Abraham Darby and William Champion developed extensive works between Conham and Keynsham which used ores from the Mendips and coal from the North Somerset coalfield. Water power from tributaries of the Avon drove the hammers in the brass batteries, until the development of steam power in the later 18th century. Glass, soap, sugar, paper and chemical industries also developed along the Avon valley."]}, {"page": "History of materials science", "response": ["In the 18th century, William Champion patents a process for the production of metallic zinc by distillation from calamine and charcoal, Bryan Higgins was issued a patent for hydraulic cement (stucco) for use as an exterior plaster, and Alessandro Volta makes a copper or zinc acid battery. "]}, {"page": "Andreas Sigismund Marggraf", "response": ["Marggraf had isolated zinc in 1746 by heating a mixture of calamine and carbon in a closed vessel without copper. He was unaware that the same process had been developed (and patented) by William Champion in England around 1738–1740 and by Anton von Swab in Sweden around 1742. Marggraf however had described the process in great detail and established its basic theory, for which he is often credited with isolation of zinc. This procedure became commercially practical by 1752."]}, {"page": "History of metallurgy in the Indian subcontinent", "response": ["In the 17th century, China exported Zinc to Europe under the name of totamu or tutenag. The term tutenag may derive from the South Indian term Tutthanagaa (zinc).India Was the First to Smelt Zinc by Distillation Process In 1597, Libavius, a metallurgist in England received some quantity of Zinc metal and named it as Indian/Malabar lead.Arun Kumar Biswas, Zinc and related alloys  In 1738, William Champion is credited with patenting in Britain a process to extract zinc from calamine in a smelter, a technology that bore a strong resemblance to and was probably inspired by the process used in the Zawar zinc mines in Rajasthan. His first patent was rejected by the patent court on grounds of plagiarising the technology common in India. However, he was granted the patent on his second submission of patent approval. Postlewayt's Universal Dictionary of 1751 still wasn't aware of how Zinc was produced."]}, {"page": "Calamine brass", "response": ["Calamine brass was slowly phased out as zinc smelting techniques were developed in Europe, which produced metallic zinc more suitable for brass production than calamine.  However, the conversion away from calamine brass manufacture was slow; a British patent was awarded to William Champion in 1738, but the alloying of metallic zinc and copper to produce brass was not patented until 1781 (by James Emerson), and calamine brass mills persisted in South Wales until as late as 1858.  The slow diffusion of this technology was probably the result of economic factors."]}, {"page": "Goldney Hall", "response": ["In 1724 the earlier house was partially demolished to be replaced by a grander building, possibly built for Goldney by George Tully, a Bristol merchant who was a partner of William Champion in the Coalbrookdale Works. The Goldney family were Quakers but their beliefs did not prevent them developing a significant range of enterprises;Goldney Hall ventures included:"]}, {"page": "1738 in Great Britain", "response": ["* 1 July – William Champion of Bristol patents a process to distill zinc from calamine using charcoal in a smelter."]}, {"page": "Warmley Company", "response": ["#REDIRECT William Champion (metallurgist)"]}, {"page": "Walmley Company", "response": ["#REDIRECT William Champion (metallurgist)"]}, {"page": "Zinc smelting", "response": ["Large-scale zinc production in Europe began with William Champion, who patented a zinc distillation process in 1738.pp. 24–26, Grissom 2009.  In Champion's process, zinc ore (in this case, the carbonate, ZnCO3) was sealed in large reduction pots with charcoal and heated in a furnace. The zinc vapor then descended through an iron condensing pipe until reaching a water-filled vessel at the bottom.pp. 147–148, Brass and zinc in Europe from the Middle Ages until the mid-nineteenth century, Joan Day, pp. 133–158 in Craddock 1998.  Champion set up his first zinc works in Bristol, England, but soon expanded to Warmley and by 1754 had built four zinc furnaces there.p. 26, Grissom 2009.  Although Champion succeeded in producing about 200 tons of zinc, his business plans were not successful and he was bankrupt by 1769.  However, zinc smelting continued in this area until 1880."]}, {"page": "William Champion", "response": ["William Champion may refer to:", "* William Champion (metallurgist) (1709–1789), early producer of zinc in the United Kingdom"]}, {"page": "Siston Brook", "response": ["In common with other rivers of the area the brook was used to power watermills for grinding corn and, as the Industrial Revolution developed, to supply power for many mining related industries.  The eighteenth century industrialist William Champion dammed the stream at Warmley to provide a   water feature for the ornamental gardens of his home, Warmley House. This also acted as a reservoir for supplying water power to Champion's brass battery mills. The lake no longer survives."]}, {"page": "Brass mill", "response": ["* William Champion "]}, {"page": "Saltford Brass Mill", "response": ["Local brass making was initiated in Bristol around 1700 by the family of Abraham Darby who later moved upstream because of the better water supply at Saltford and Keynsham. The brass was made from Cornish ores refined at Crew's Hole and then transported via the river. These were mixed with calamine from the Mendip Hills to make calamine brass. This changed as processes improved and local copper smelting was replaced by supplies from Swansea. By the 1850s zinc metal was used instead of calamine, using a process introduced by William Champion, who lived nearby."]}, {"page": "Champion (surname)", "response": ["* William Champion, several people, including", ":* William Champion (metallurgist), an early producer of zinc in the United Kingdom"]}, {"page": "Timeline of Bristol", "response": ["* 1738 – William Champion patents a process to distill zinc from calamine using charcoal in a smelter."]}, {"page": "National Smelting Company", "response": ["*William Champion (metallurgist)"]}, {"page": "Goldney family", "response": ["Born in Goldney Hall in 1696, after a top-level education he became apprenticed to his parents from 1711. His father trained him in accounts, enabling him to become an assistant bookkeeper at Coalbrookdale after the death of Abraham Darby I. Thomas III resultantly became involved as an investor in a number of businesses, including: the Willey furnace, across the River Severn from Coalbrookdale; the Bersham furnace near Wrexham; and the Warmley Works of William Champion, which produced copper, brass, spelter and utensils. From 1750, Thomas invested in a mine at Gronant, Flintshire, intended for the mining of lead, copper ore and calamine. A successful venture, it led to Thomas investing in other mines at Kellyn, Whitford, Devon, Cornwall and Ireland."]}]}}