{"wiki_id": "http://www.wikidata.org/entity/Q3571511", "itemLabel": "Yana", "itemDescription": "British singer and actress. (1932-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Yana_(singer)", "wikipedia_page": {"main": "Yana (born Pamela Guard; 16 February 1931 – 21 November 1989) was a British singer who was famous enough to be regarded as a household name in late-1950s Britain, but whose fame faded fast thereafter; by the time of her death in 1989 she was almost completely unknown except to a few devoted fans, though the Daily Telegraph obituaries page noted her demise and included the obituary in one of its published collections.", "link_mentions": [{"page": "List of one-word stage names", "response": ["* Yana (born 1931), British singer"]}, {"page": "George Formby", "response": ["Formby's final year of work was 1960. That May he recorded his last session of songs, \"Happy Go Lucky Me\" and \"Banjo Boy\", the former of which peaked at number 40 in the UK Singles Chart. He then spent the summer season at the Queen's Theatre in Blackpool in The Time of Your Life—a performance which was also broadcast by the BBC. One of the acts in the show was the singer Yana, with whom Formby had an affair, made easier because of Beryl's absence from the theatre through illness. His final televised performance, a 35-minute BBC programme, The Friday Show: George Formby, was aired on 16 December. Bret considers the programme to be Formby's \"greatest performance—it was certainly his most sincere\", although reviewing for The Guardian, Mary Crozier thought it \"too slow\". She went on to say \"George Formby is really a music-hall star, and it needs the warmth and sociability of the theatre to bring out his full appeal\". Beryl's illness was worsening. Worn down by the strain, and feeling the need to escape, Formby took the part of Mr Wu in Aladdin in Bristol, having turned down a more lucrative part in Blackpool."]}, {"page": "Water Stratford", "response": ["More recent former residents are Paul Daniels, magician, Peter Woodthorpe, actor, and Yana (singer), (real name Pamela Guard)."]}, {"page": "The Cockleshell Heroes", "response": ["* Yana as Pub Singer (uncredited)", "The then-famous British singer, Yana (Pamela Guard), is shown in a cameo role as a sweetly-singing blonde Wren (Women's Royal Naval Service member) in a pub scene, shortly before a brawl erupts."]}, {"page": "Jimmy Edwards", "response": ["In December 1958, Jimmy Edwards played the King in Rodgers and Hammerstein's Cinderella at the London Coliseum with Kenneth Williams, Tommy Steele, Yana and Betty Marsden; Bobby Howell was the Musical Director."]}, {"page": "The Ship That Died of Shame", "response": ["*Yana, as a woman singer performing We'll Meet Again in a room off the bar of the Coastal Forces Club"]}, {"page": "Pigalle Club", "response": ["The Beatles played a concert at the Pigalle on 21 April 1963. Shirley Bassey's performance at the club on 12 September 1965 was recorded and released on the live album Shirley Bassey at the Pigalle the same year. Other acts that performed at the venue included Yana, Peggy Lee, Sammy Davis Jr, Boy George, Duffy, Eartha Kitt, Sinéad O'Connor, John McKeown, Basia, Horace Andy, Brian Kennedy and Immodesty Blaize."]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Yana: 1958"]}, {"page": "Yana", "response": ["Yana may refer to:", "*Yana, Burma, a village in Hkamti Township in Hkamti District in the Sagaing Region of northwestern Burma", "*Yana, India, a village in the Uttara Kannada district of Karnataka, India", "*Yana, Nigeria, an administrative capital in Bauchi State, Nigeria", "*Yana, Sierra Leone, a town in Northern Province of Sierra Leone", "*Yana (river), a river in Yakutia, Russia", "*Yana (Sea of Okhotsk), a river in Magadan Oblast, Russia", "*Yana Plateau, Russia", "*Yana Point, the point forming the west side of the entrance to Bruix Cove, Antarctica", "*Yana (singer) (1931–1989), British singer", "*Yana Dobrovolskaya (born 1997), Miss Russia 2016", "*Yana Gupta (born 1979), Czech-Indian model-actress", "*Yana Klochkova (born 1982), Ukrainian Olympic swimmer", "*Yana Kudryavtseva (born 1997), Russian rhythmic gymnast", "*Yana Kunitskaya (born 1989), Russian mixed martial artist", "*Yana Marinova (born 1978), Bulgarian actress", "*Yana Toboso (born 1984), Japanese manga artist", "*Yana Tsikaridze, Canadian rhythmic gymnast", "*Yana Vorona (born 2004), Russian artistic gymnast", "*Yana, a diminutive of the Russian male first name Averky", "*Professor Yana, a fictional character from the Doctor Who episode \"Utopia\"", "*Yana (Buddhism), a mode or method of spiritual practice in Buddhism", "*Yana language, an extinct language isolate", "*Yana people, a group of Native Americans indigenous to Northern California in the central Sierra Nevada Mountains", "*\"Yana Yana\", a single by the Lebanese pan-Arab singer Sabah"]}, {"page": "Astor Club", "response": ["Bertie Green, the owner of the Astor, discovered the British singer Yana, who shot to fame in the 1950s after having sung as a dare and at a private party held at the club. Another singer who first performed (solo) at the Astor (in 1959) was the 1960s star Kathy Kirby.", "Yana was not the only amateur singer to have been offered a job at the Astor by Bertie Green. In 1957, he suggested to American tennis player Althea Gibson, who had just won the Ladies' Singles tournament at Wimbledon and who had sung for fun at a private party held at the Astor to celebrate her victory, that there was a job for her if she wanted to take it (she didn't)."]}]}}