{"wiki_id": "http://www.wikidata.org/entity/Q358900", "itemLabel": "Robert Maudsley", "itemDescription": "British serial killer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Maudsley", "wikipedia_page": {"main": "Robert John Maudsley (born 26 June 1953) is an English serial killer. Maudsley killed four people, with three of the killings taking place in prison after receiving a life sentence for a murder. Initial reports falsely stated he ate part of the brain of one of the men he killed in prison, which earned him the nickname Hannibal the Cannibal among the British press and \"The Brain Eater\" amongst other prisoners. However, the Press Complaints Commission records that national newspapers were subsequently advised that the allegations were untrue, according to the autopsy report. Since the death of Ian Brady, Maudsley has been the longest-serving British prisoner, save for David Burgess, and the earliest person still living to be subject to a whole life order.", "link_mentions": [{"page": "Charles Bronson (prisoner)", "response": ["Bronson was taken from Belmarsh to Wakefield, where he spent 40 days naked in isolation. He was transferred to Hull in November, where he spent a number of months without incident before he took deputy governor Adrian Wallace hostage on Easter Monday 1994. He was overpowered by guards, and was transferred to Leicester. He was returned to Wakefield, where he was confined to what was known as the \"Hannibal Cage\", previously occupied by Robert Maudsley. While there, prison officers Mick O'Hagan and Alan Jarvis encouraged Bronson to take up art, and he began to concentrate on cartooning.", "For the incident Bronson received a discretionary life sentence to run a minimum of three years. Later in 1999 a special prison unit was set up at Woodhill for Bronson, Robert Maudsley and Reginald Wilson, to reduce the risk they posed to staff and other prisoners. Danielson received £65,000 in compensation from the Home Office in an out-of-court settlement, although the prison service did not admit liability for its negligence in failing to protect a civilian employee."]}, {"page": "Broadmoor Hospital", "response": ["*Robert Maudsley, serial killer who tortured and murdered an inmate in the hospital over a period of 9 hours"]}, {"page": "List of serial killers by country", "response": ["*Robert Maudsley: known as \"Hannibal The Cannibal\"; killer of four; killed three in prison."]}, {"page": "List of prisoners with whole-life orders", "response": ["!data-sort-value=\"Maudsley, Robert\"|Robert Maudsley"]}, {"page": "Robert", "response": ["* Robert Maudsley, English serial killer"]}, {"page": "Speke", "response": ["*Robert Maudsley"]}, {"page": "List of people from Merseyside", "response": ["*Robert Maudsley: Serial killer."]}, {"page": "List of serial killers by number of victims", "response": ["|Robert Maudsley"]}, {"page": "Life imprisonment in England and Wales", "response": ["Whole life sentences have also been criticised in some quarters for giving offenders no incentive to behave well and co-operate with prison staff, or make any serious attempt at rehabilitation. An example of this was highlighted by the case of Robert Maudsley, sentenced to life for a single murder in 1975, who went on to kill three inmates several years into his sentence."]}, {"page": "HM Prison Wakefield", "response": ["* Robert Maudsley – Serial killer."]}, {"page": "Robert Mawdsley", "response": ["#REDIRECT Robert Maudsley"]}, {"page": "Maudsley", "response": ["* Robert Maudsley (born 1953), British serial killer"]}, {"page": "HM Prison Hull", "response": ["* Robert Maudsley"]}, {"page": "List of longest prison sentences served", "response": ["| Robert Maudsley"]}, {"page": "Maudsley, Robert", "response": ["#redirectRobert Maudsley"]}, {"page": "List of nicknames of serial killers", "response": ["* \"Britain’s Own Hannibal\" – Robert Maudsley"]}]}}