{"wiki_id": "http://www.wikidata.org/entity/Q359387", "itemLabel": "Walter Smith", "itemDescription": "Scottish soccer player and manager (1948-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Smith", "wikipedia_page": {"main": "Walter Ferguson Smith  (24 February 1948 – 26 October 2021) was a Scottish association football player, manager and director, primarily associated with his two spells as manager of Glasgow club Rangers.\nA defender, Smith's playing career consisted of two spells with Dundee United, split by a short time at Dumbarton. A pelvic injury caused his retirement from playing and Smith moved into coaching at Dundee United, working for manager Jim McLean. Smith also took charge of the Scotland under-18 and under-21 teams, and assisted Scotland manager Alex Ferguson at the 1986 FIFA World Cup in Mexico, after it had been announced that he would be moving to Rangers as assistant to Graeme Souness.\nSmith became the manager of Rangers in 1991, succeeding Souness. He won 13 major trophies in seven years, including seven league titles in succession. After leaving Rangers at the end of the 1997–98 season, he was appointed manager of English Premier League club Everton. He was in charge at Goodison Park for four seasons before he was sacked in 2002.\nAfter a brief stint as assistant manager to Alex Ferguson at Manchester United, Smith was appointed Scotland manager in December 2004. He presided over a revival in their fortunes, taking the national team 70 places up the FIFA World Rankings. After a good start to UEFA Euro 2008 qualification, he resigned as Scotland manager in January 2007 to return to Rangers. He won eight trophies during his second spell as Rangers manager and guided the team to the 2008 UEFA Cup Final, before retiring from management in 2011. Smith is the second-most successful manager in the history of Rangers, behind Bill Struth.", "link_mentions": [{"page": "1948", "response": ["** Walter Smith, Scottish football manager (d. 2021)"]}, {"page": "Alex Ferguson", "response": ["During the 1991 close season, Ferguson's assistant Archie Knox departed to Rangers to become assistant to Walter Smith, and Ferguson promoted youth team coach Brian Kidd to the role of assistant manager in Knox's place. He also made two major signings – goalkeeper Peter Schmeichel and defender Paul Parker – to bolster his side. There was much anticipation about the breakthrough of the young Ryan Giggs, who had played twice and scored once in the 1990–91 campaign, and the earlier emergence of another impressive young winger in the shape of Lee Sharpe, who despite their youth had made Ferguson feel able to resist plunging into the transfer market and buying a new player to take over from the disappointing Danny Wallace on the left wing. He had also added Soviet midfielder Andrei Kanchelskis to the right wing, giving him a more attacking alternative to older midfielders Mike Phelan and Bryan Robson."]}, {"page": "2021", "response": ["** Walter Smith, Scottish footballer and manager (b. 1948)"]}, {"page": "Rangers F.C.", "response": ["===Graeme Souness, Walter Smith and 9-in-a-row===", "Every year from the 1988–89 season until the 1996–97 season, Rangers won the league title. This nine-in-a-row achievement equalled Celtic's record, set prior to the forming of the Scottish Football League Premier Division, subsequent to which competing teams met four times a season. The first three of these seasons the club was managed by Graeme Souness; the latter six under the stewardship of Walter Smith.", "=== Walter Smith's return and Ally McCoist ===", "On 10 January 2007, former boss Walter Smith resigned from his post as Scotland manager to return to the Ibrox helm, with Ally McCoist as assistant manager.", "Ally McCoist took over from Walter Smith in June 2011 but season 2011–12 started with Rangers eliminated from two European competitions before the end of August: losing to Swedish side Malmö FF in the Champions League third round qualifying match, and to Slovenian side Maribor in a Europa League qualifying match. While good league form saw Rangers in top spot after being unbeaten for the first 15 games, they were knocked out of the League Cup by Falkirk and the Scottish Cup by Dundee Utd at Ibrox. Rangers were placed into administration on 14 February 2012 resulting in the club being deducted 10 points as per SPL rules. Though Rangers avoided having Celtic win the championship at Ibrox on 25 March by winning the game 3–2, Rangers ultimately finished 20 points behind Celtic in second place.", "The longest serving manager was Bill Struth who served for 34 years and 26 days. Rangers have had four foreign managers during their history; Dick Advocaat (1 June 1998 to 12 December 2001), Paul Le Guen (9 May 2006 to 4 January 2007), Pedro Caixinha (11 March 2017 to 26 October 2017) and current incumbent Giovanni van Bronckhorst (18 November 2021 to present). Graeme Souness is the only player-manager during Rangers' history. There have been two repeat appointments: Jock Wallace and Walter Smith.", "The most successful manager in terms of the number of trophies won is Bill Struth with 18 League titles, 10 Scottish Cups and two League Cups, but the most successful manager in terms of trophies to time served is Walter Smith with seven league titles, three Scottish Cups and three League Cups in 7 years 42 days. Smith won three league titles, two Scottish Cups and three League Cups in the four years, 126 days of his second spell. Rangers' other manager with notable success was William Waddell who won the European Cup Winner's Cup during his two years and 175-day stint.", "| Walter Smith || 1991–1998", "| Walter Smith || 2007–2011", "*  Walter Smith – 2007 Inductee"]}, {"page": "Everton F.C.", "response": ["Howard Kendall was appointed Everton manager for the third time in 1997, but the appointment proved unsuccessful as Everton finished seventeenth in the Premiership. The club only avoided relegation due to its superior goal difference over Bolton Wanderers. Former Rangers manager Walter Smith then took over from Kendall in the summer of 1998, but only managed three successive finishes in the bottom half of the table. The Everton board finally ran out of patience with Smith, and he was sacked in March 2002 after an FA Cup exit at Middlesbrough and with Everton in real danger of relegation. His replacement, David Moyes, guided Everton to a safe finish in fifteenth place."]}, {"page": "Sheffield Wednesday F.C.", "response": ["At the end of the 1997–98 season, Ron Atkinson's short-term contract was not renewed and Sheffield Wednesday turned to the Barnsley boss Danny Wilson as their new manager after being given the backword by both Gerard Houllier and Walter Smith who joined Liverpool and Everton respectively. Wilson's first season at the helm brought a slight improvement as they finished 12th in the Premiership. An expensively assembled squad including Paolo Di Canio, Benito Carbone and Wim Jonk failed to live up to the massive wage bill the club was paying and things eventually came to a head when Italian firebrand Di Canio was sent off in a match against Arsenal and proceeded to push the referee on his way off. Danny Wilson was sacked the following March with relegation looking a certainty for the Hillsborough club, following a disastrous 1999–2000 season where they had been hammered 8–0 by Newcastle United as early as September. His assistant Peter Shreeves took temporary charge but was unable to stave off relegation, with a 3–3 draw at Arsenal in May 2000 being enough to see the Owls tumble into the First Division"]}, {"page": "Scottish Premier League", "response": ["The SPL instituted a \"winter break\" during the January of each season, beginning with the 1998–99 season. However, this practice was removed beginning in the 2000–01 season, forcing clubs to play throughout January and sometimes resulting in postponement of matches and significant damage to clubs' pitches. Managers Martin O'Neill, Jim Duffy and Walter Smith were among those who called for the winter break to be reinstated. Alex McLeish accused the SPL of taking Scottish football \"back to the Dark Ages\" after its decision to scrap the mid-season hiatus.", "The only restriction on selection was the \"Under-21 rule\". This rule stated that each club must include at least three players under the age of 21 in its matchday squad. Opinions on this rule were divided among SPL managers. Walter Smith, Gus MacPherson and Jim Jefferies expressed their disapproval of the policy. John Collins approved of the ruling, claiming it is healthy for Scottish football and encouraged the development of young players."]}, {"page": "2001–02 FA Premier League", "response": ["| Walter Smith"]}, {"page": "Old Firm", "response": ["|align=left|Walter Smith"]}, {"page": "Lanark", "response": ["* Walter Smith, Scotland and Rangers manager "]}, {"page": "David Moyes", "response": ["Moyes took over from Walter Smith as manager of Everton in March 2002. Under him, the club managed a fourth-place finish in the league in 2004–05, their highest finish since 1988, and played in the qualifying rounds for the UEFA Champions League the following season, the first time they had taken part in UEFA's most prestigious cup competition since 1970–71. Moyes also led Everton to a runners-up finish in the 2008–09 FA Cup, their best performance in the competition since winning it in 1995. Everton consistently finished between fifth and eighth in the league under Moyes, and at the time of his departure, he was the longest-serving current manager in the league behind Sir Alex Ferguson and Arsène Wenger, at 11 years and 3 months.", "The following season, Moyes guided Preston to the Division Two title and a promotion to Division One. An even greater achievement perhaps was to steer Preston into the Division One play-offs the season after that, with largely the same squad. Preston lost 3–0 to Bolton Wanderers in the 2001 Football League First Division play-off Final, missing out on promotion to the Premier League. One month later, Moyes signed a new five-year contract with the club. In 2001, whilst studying for his UEFA Pro License, Moyes shadowed Roy Hodgson at Udinese during Hodgson’s six month spell at the club. Towards the end of the following season, he left for Everton, to take over from fellow Scotsman Walter Smith in March 2002. Moyes took charge of Preston for 234 matches, of which his team won 113, drew 58 and lost 63."]}, {"page": "Helensburgh", "response": ["*Walter Smith, football player and manager"]}, {"page": "Paul Gascoigne", "response": ["Rangers manager Walter Smith flew to visit Gascoigne at his home in the Rome countryside in the early summer of 1995. Smith explained: \"He said, 'What are you doing here?' I said, 'I'm here to see you.' He said, 'What is it you're wanting?' I said, 'I'm here to see if you'll come and play for Rangers.' He said, 'Aye, alright.'\"\"East Kilbride FC Fundraiser Dinner - An Audience with Walter Smith\" – East Kilbride FC, YouTube, 14 January 2014", "Rangers won the league title again in 1996–97, their ninth in succession. Gascoigne claimed hat-tricks against Kilmarnock and Motherwell, and ended the campaign with 17 goals in 34 games. However, during this season, manager Walter Smith and assistant Archie Knox became increasingly concerned over Gascoigne's reliance on alcohol. The Gers won another double by also winning the Scottish League Cup, beating Hearts 4–3 in the final at Celtic Park, with Gascoigne scoring twice and Ally McCoist claiming the other two goals.", "Gascoigne signed a two-year contract with Everton, managed by former Rangers boss Walter Smith, after joining on a free transfer in July 2000. He started the 2000–01 season well despite not playing every game due to his lack of fitness, but a series of niggling injuries and his ongoing depression took him out of the first team picture by Christmas.", "After spending time at an alcohol rehabilitation clinic in Arizona, Gascoigne was fit enough to play for the \"Toffees\" in the 2001–02 season, and he scored his first goal for the club – and last in English football – away to Bolton Wanderers on 3 November. Gascoigne then suffered a hernia injury, which kept him out of action for three months. Walter Smith left Goodison Park in March, and Gascoigne left the club shortly after his successor, David Moyes, took charge."]}, {"page": "Scotland national football team", "response": ["Walter Smith, a former Rangers and Everton manager, was brought in to replace Vogts. Improved results meant that Scotland rose up the FIFA rankings and won the Kirin Cup, a friendly competition in Japan. Scotland failed to qualify for the 2006 FIFA World Cup, finishing third in their group behind Italy and Norway. Smith left the national side in January 2007 to return to Rangers, with Scotland leading their Euro 2008 qualification group. New manager Alex McLeish guided Scotland to wins against Georgia, the Faroe Islands, Lithuania, France and Ukraine, but defeats by Georgia and Italy ended their chances of qualification for Euro 2008. These improved results, particularly the wins against France, lifted Scotland into the top 20 of the FIFA world rankings.", "German coach Berti Vogts became the first foreign manager of the team in 2002, but his time in charge was generally seen as a failure and the FIFA World Ranking declined to an all-time low of 88 in March 2005. Walter Smith and Alex McLeish achieved better results, with the ranking improving to an all-time high of 13 in October 2007, but both were only briefly in charge before returning to club management. George Burley and Craig Levein both had worse results with the team and were eventually sacked. Results improved somewhat under Gordon Strachan, but he was unable to secure qualification for a tournament. After McLeish had a second spell as manager, Steve Clarke was appointed in May 2019. Clarke guided the team to qualification for Euro 2020, their first major competition since 1998."]}, {"page": "2001–02 in English football", "response": ["*13 March 2002 - Walter Smith is sacked by Everton after nearly four years as manager; they are reportedly interested in recruiting David Moyes from Preston North End as his successor.", "* 14 March - David Moyes takes over at Everton, replacing Walter Smith (left 12 March)"]}, {"page": "Brian Laudrup", "response": ["In July 1994, Laudrup was offered an escape route from Italy when he was approached by Walter Smith of Rangers. Rangers at that time were an ambitious club and had money to spend to try to seek European glory. This attracted Laudrup, and he signed for a £2.3 million transfer fee.", "He made an immediate impact at Rangers. On the opening league fixture of the season against Motherwell in August 1994, it was from his precise cross that Mark Hateley headed the opening goal. In the second half with only a few minutes remaining, he provided another assist with a long run from the half-way line before passing to Duncan Ferguson, who then scored Rangers' second goal to clinch a 2–1 win. He scored his first goal for the club later that same month, in a Scottish League Cup tie against Falkirk. Although Scottish football was more physical than what he was previously used to, he excelled in the free role given to him by manager Walter Smith. Laudrup turned down an offer from Barcelona five months after signing for Rangers. He finished the season with 10 goals in 33 League games, in addition to a number of assists, as Rangers won their seventh consecutive Championship. As recognition of his fine performances, Laudrup won both the Scottish Football Writers and Scottish PFA player of the year awards. His performances for Rangers and Denmark also resuted in his winning his third Danish Player of the Year award.", "Laudrup has been praised by several players, managers, pundits, and footballing figures for his footballing ability, including Charlie Nicholas, Roland Wohlfarth, Charlie Nicholas, Ally McCoist, and Andy Goram. Franz Beckenbauer described Laudrup as \"a world class player,\" a view shared by Andreas Brehme, who described him as a \"player of the highest quality class.\" Paul Gascoigne instead dubbed him an \"amazing player.\"Glorious: My World, Football and Me, Paul Gascoigne (book) Laudrup's older brother, Michael, likened Brian's playing style to his own, and even believed his younger brother to be superior to himself. His former manager Horst Wohlers named him as the best player he had ever coached, and as the top footballer in the Bundesliga during their time together at Bayer Uerdingen. In December 2013, Graeme Le Saux named Luís Figo and Brian Laudrup as his toughest opponents ever. Walter Smith's view of Laudrup was more critical however, lauding his ability but also lamenting his mentality, which he believed limited him as a player, commenting: \"Brian Laudrup is as good a player as I have ever worked with, but he frustrated me. He had the capability of being up there with the greatest players of all time. There was just that little bit in him mentally that stopped him from being right at the very top. Make no mistake, he was a fantastic player for us, but he could have elevated himself into a position where he was one of the best in the world.\""]}, {"page": "Dick Advocaat", "response": ["In 1998, Advocaat accepted the invitation from Rangers chairman David Murray to become the Scottish Premier League (SPL) team's new manager. Walter Smith was still in the job but had announced his departure in advance.", "When Advocaat took charge of Rangers, he became the first foreign manager to do so and only the tenth manager in the history of the club. The previous season was the last of seven under Walter Smith, and the first time the club had finished without a trophy in 12 years. Long-term members of the squad that had won nine league championships in a row left, including Ally McCoist, Ian Durrant, Andy Goram and Stuart McCall. With financial backing from chairman David Murray, Advocaat invested heavily in the team. Big money signings such as Giovanni van Bronckhorst, Arthur Numan and Andrei Kanchelskis were among Advocaat's first as Rangers tried to regain the league championship."]}, {"page": "Gennaro Gattuso", "response": ["Walter Smith, who brought Gattuso to Glasgow, left the club in 1998. Smith's successor, Dick Advocaat, did not favour Gattuso and, after being played out-of-position as a right-back, the Italian was sold in October 1998 to then recently promoted Serie A club Salernitana for £4 million."]}, {"page": "Alex McLeish", "response": ["After his successful playing career he quickly went into football management with Motherwell in 1994, one year before he retired as a player. His first season at Motherwell saw him take the Lanarkshire club to second in the Premier Division behind Walter Smith's Rangers. However, he failed to build on this success and the next two seasons were spent in relegation battles. He resigned as manager to take over at Hibernian in 1998."]}, {"page": "Ally McCoist", "response": ["Towards the end of his playing career, McCoist started his media career. Between 1996 and 2007, he was a team captain in the BBC sports quiz A Question of Sport. McCoist began to scale back his media commitments in 2007, when he became an assistant manager to Walter Smith at Rangers. He succeeded Smith as Rangers manager in 2011, but the club then suffered from serious financial difficulties. The company running Rangers was put into liquidation in 2012 and the team were then placed in the fourth tier of Scottish league football. McCoist helped them win successive promotions to the second tier, but after a poor start to the 2014–15 season McCoist handed in his 12-months' notice in December 2014 and was placed on gardening leave. In September 2015, McCoist and Rangers mutually agreed to terminate his contract.", "When Walter Smith took over from Souness in April 1991, McCoist returned to the fore and came back from a hernia on the final day of the season as the club won the title. Despite starting the next season on the bench due to further minor injuries, he won both Players' Player of the Year and the Sportswriters' award after scoring 34 times in the league during season 1991–92, forming an effective partnership with Hateley (Johnston moved on rather than sit on the bench) as Rangers completed a domestic double. Those goals won him the European Golden Boot – the first time a Scot had won the award – ensuring his position with two long-range strikes in the final fixture of the season away to Aberdeen, a match he later admitted he had barely been in a condition to play, having spent the previous night drinking with students in the team hotel. He had scored the only goal of the Scottish Cup semi-final, an Old Firm meeting where Rangers played 85 minutes with only 10 men, and rounded off the season with the decisive goal in the 1992 Scottish Cup Final. Regarding the Golden Boot, McCoist joked: \"There was some wee Romanian guy; you know what it's like. I think he needed to score nine in the last game of the season to beat me. I think he got eight. It was one of those ones. I think he scored his seventh in the 98th minute and scored his eighth in the 114th minute. You're never sure with that mob.\"", "McCoist joined the Scotland coaching staff under his former manager at Rangers, Walter Smith, in 2004. He turned down the managerial position at Inverness Caledonian Thistle in 2006 as he wanted a job nearer his Glasgow home.\"Ally McCoist Factfile\" The Telegraph, 10 January 2007", "McCoist returned to Rangers as an assistant manager to Walter Smith in January 2007. After Rangers' victory over Queen of the South in the 2008 Scottish Cup Final, Smith revealed that McCoist had been in charge of the team for the entire cup campaign.\"Smith in McCoist revelation\" Sky Sports, 25 May 2008 \"Obviously, Walter had me in mind for the manager's position when he stepped down, and for a couple of the Scottish Cup runs he let me take the team. I'd do the preparation and the training, but obviously he'd be there. I'd do the team talk, all that kind of stuff.\""]}, {"page": "Barry Ferguson", "response": ["Ferguson was promoted to the first-team squad for the 1996–97 season. He made his debut on the last day of that season against Hearts on 10 May 1997. He made a number of sporadic appearances the following season under manager Walter Smith's policy of easing him into the first team."]}, {"page": "Duncan Ferguson", "response": ["Of Ferguson's time at Rangers, one of his strike partners Mark Hateley said: \"Duncan was a really good player, but I think he came to Rangers a couple of years too early. Walter Smith wanted me to take him under my wing. He was a boisterous young lad who wanted to play all the time. It was a period in his career where he'd gone from being a big fish in a small pond to being a small fish in the big pond at Rangers. He probably found that a bit difficult.\"\"MARK HATELEY | Open Goal Meets... Former Rangers, England, AC Milan & Monaco Striker\" – Open Goal, YouTube, 29 November 2021", "Ferguson was sold to Newcastle United for a fee of £8 million in November 1998. The deal was done to sell Ferguson by the Everton chairman, Peter Johnson, without the knowledge of Walter Smith. Ferguson wrote a two-page goodbye letter in the club magazine to fans, stating his sadness at leaving and that he would never forget them."]}, {"page": "Nacho Novo", "response": ["With the departure of Alex McLeish and the arrival of Frenchman Paul Le Guen, Novo looked set to leave Rangers. However, a proposed transfer to English First Division club Coventry City fell through on transfer deadline day. Novo initially found his appearances sporadic, featuring in the first game of the season then waiting seven weeks for his second but after a mixture of poor results, injuries and his good performances for the reserves Novo returned to the first team. His first goal of that season, and in over a year, was during a 3–2 UEFA Cup win over Livorno on 19 October 2006. The following match, Novo came off the bench to score a late winner against St Mirren in a 3–2 win. He then started the next game, Motherwell held Rangers to a 1–1 draw with Novo named Man of the Match. His rejuvenated form continued with goals against Heart of Midlothian, Maccabi Haifa and AJ Auxerre. Novo continued to be a regular when Le Guen was replaced with Walter Smith."]}]}}