{"wiki_id": "http://www.wikidata.org/entity/Q359040", "itemLabel": "Frederick Blackman", "itemDescription": "British botanist (1866–1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Blackman", "wikipedia_page": {"main": "Frederick Frost Blackman FRS (25 July 1866 – 30 January 1947) was a British plant physiologist.Frederick Blackman was born in Lambeth, London to a doctor. He studied medicine at St. Bartholomew's Hospital, graduating MA. In the subsequent years, he studied natural sciences at the University of Cambridge and was awarded DSc.\nHe conducted research on plant physiology, in particular photosynthesis, in Cambridge until his retirement in 1936. Gabrielle Matthaei was his assistant until 1905. He was elected in May 1906 a Fellow of the Royal Society, his candidature citation reading \"Fellow of St John's College, Cambridge. Ex-Lecturer and now Reader in Botany in the University.\" He has made distinguished investigations in plant physiology. In 1921 he was awarded the Royal Medal and in 1923 delivered the Croonian lecture.\nHe was buried at the Parish of the Ascension Burial Ground in Cambridge, with his wife Elsie (1882 - 1967).", "link_mentions": [{"page": "July 25", "response": ["*1866 – Frederick Blackman, English physiologist and academic (died 1947)"]}, {"page": "January 30", "response": ["*1947 – Frederick Blackman, English botanist and physiologist (b. 1866)"]}, {"page": "Photosynthesis", "response": ["In the early 20th century, Frederick Blackman and Gabrielle Matthaei investigated the effects of light intensity (irradiance) and temperature on the rate of carbon assimilation."]}, {"page": "1947", "response": ["* January 30 – Frederick Blackman, British plant physiologist (b.1866)"]}, {"page": "1866", "response": ["* July 25 – Frederick Blackman, English plant physiologist (d. 1947)"]}, {"page": "1905 in science", "response": ["* Frederick Blackman proposes his law of limiting factors in relation to photosynthesis.\"Optima and Limiting Factors\". Annals of Botany."]}, {"page": "1866 in science", "response": ["* July 25 – Frederick Blackman (died 1947, English plant physiologist"]}, {"page": "Department of Plant Sciences, University of Cambridge", "response": ["The University of Cambridge has a long and distinguished history in Botany including work by John Ray and Stephen Hales in the 17th century and 18th century, Charles Darwin’s mentor John Stevens Henslow in the 19th century, and Frederick Blackman, Arthur Tansley and Harry Godwin in the 20th century."]}, {"page": "Cambridge University Botanic Garden", "response": ["The planning of the new Garden was carried out by Professor Henslow, assisted by young Cardale Babington. The land was flat and unpromising as a garden site, but the layout was planned with great skill, utilizing an old gravel pit to construct a lake with a high mound running into it. Trees and shrubs were planted according to their botanical sequence, a range of glasshouses was built in the 1860s, and a rock garden, one of the earliest of its kind in the country, was constructed about the same time. The Garden has also long been known for its many fine specimens of rare trees. By the 1870s the main features of the Garden had been developed and, it was ready to play its part in the great expansion of botanical teaching and research that was about to take place at Cambridge. During the early years of the 20th century much of the pioneer work of William Bateson, Charles Chamberlain Hurst, and Edith Rebecca Saunders on plant genetics was carried out at the Garden, and it was later used for researches on plant physiology by Frederick Blackman and George Edward Briggs, and on plant pathology by Frederick Tom Brooks and others."]}, {"page": "Limiting factor", "response": ["In 1905 Frederick Blackman articulated the role of limiting factors as follows: \"When a process is conditioned as to its rapidity by several separate factors the rate of the process is limited by the pace of the slowest factor.\" In terms of the magnitude of a function, he wrote, \"When the magnitude of a function is limited by one of a set of possible factors, increase of that factor, and of that one alone, will be found to bring about an increase of the magnitude of the function.\"F.F. Blackman (1905) \"Optima and Limiting Factors\", Annals of Botany,  "]}, {"page": "Blackman", "response": ["*Frederick Blackman (1866–1947), British botanist (brother of Vernon Herbert Blackman; uncle of Geoffrey Emett Blackman)"]}, {"page": "Ascension Parish Burial Ground", "response": ["* Frederick Blackman, FRS Plant Physiologist, Fellow of St John's."]}, {"page": "1947 in the United Kingdom", "response": ["* 30 January – Frederick Blackman, plant physiologist (born 1866)"]}, {"page": "Frederick Frost Blackman", "response": ["#REDIRECT Frederick Blackman"]}, {"page": "Frederick F. Blackman", "response": ["#REDIRECT Frederick Blackman"]}, {"page": "F.F. Blackman", "response": ["#REDIRECT Frederick Blackman"]}, {"page": "F. F. Blackman", "response": ["#REDIRECT Frederick Blackman"]}, {"page": "Arthur Roy Clapham", "response": ["After completing his B.A., Clapham did graduate work in plant physiology under the supervision of Frederick Blackman before taking up a position as crop physiologist at the Rothamsted Agricultural Experimental Station where he worked with Ronald Fisher. Influenced by Fisher's work on statistical analysis and random sampling, Clapham worked on using small samples to reliably estimate wheat yields and designed the Ministry of Agriculture's protocol of sampling wheat crops to forecast crop yields. It was during this time period that he met his future wife, Brenda Stoessiger who was a research student working with Karl Pearson, a pioneer of mathematical statistics. Years later, Donald Pigott, then Director, Cambridge University Botanic Garden, wrote (for Clapham's obituary in the Journal of Ecology) that it was probably through his connection to Fisher that Clapham met Stoessiger. Clapham received a PhD from Cambridge in 1929 based on his work with Blackman in physiology and his work on sampling methods at Rothamsted."]}, {"page": "Blackman, Frederick Frost", "response": ["#REDIRECT Frederick Blackman"]}, {"page": "F.F.Blackman", "response": ["#REDIRECT Frederick Blackman"]}, {"page": "Gabrielle Howard", "response": ["Matthaei was born in Kensington in a family of German, Swiss and French ancestry. She was the daughter of the musician Louise Henriette Elizabeth Sueur and the commission merchant Carl Hermann Ernst Matthaei, she had a brother and three younger sisters, including Louise Howard. Matthaei attended North London Collegiate School for Girls and Newnham College, Cambridge, and later worked as assistant to Frederick Blackman, producing significant work on cellular respiration. Between 1902 and 1905, Blackman and Matthaei set out to discover the role of temperature in photosynthesis and performed the first such experiments, finding that carbon fixation is based on biochemical reactions which depend on temperature. Although the experiment is inaccurately known as the Blackman Reaction, a significant part of the work was carried out by Matthaei and the 1904 paper communicated to the Royal Society by Francis Darwin bears only her name."]}, {"page": "Mitscherlich's law", "response": ["Eihard's son, Alexander Mitscherlich studied crop yields in 1909Mitscherlich, E. A. (1909.) \"Das Gesetz des Minimums und das Gesetz des abnehmenden Bodenertrags\", Land. Jahrb., 38. and articulated a \"law of physiological relations\".Ward Chesworth (editor)(2008)  It was compared to the law of diminishing returns in 1942, when Liebig's law of the minimum and the limiting factors of Frederick Blackman were also noted:"]}, {"page": "List of alumni of Queen Mary University of London", "response": ["* Frederick Blackman – British botanist and plant physiologist"]}, {"page": "List of alumni of St John's College, Cambridge", "response": ["|Frederick Blackman"]}, {"page": "List of botanists by author abbreviation (E–F)", "response": ["* F.F.Blackman – Frederick Blackman (1866–1947)"]}, {"page": "Dorothea Pertz", "response": ["Pertz subsequently undertook research into plant physiology, working under Francis Darwin, a reader at the university. From 1892 to 1912 they jointly published five papers; during this period she also collaborated with William Bateson, and she published a paper with him concerning inheritance in Veronica. She also produced two papers independently. In 1905 she was made a fellow of the Linnean Society, among the first women admitted as full members, though she did not take part in the movement advocating for women to be fellows. After Darwin's retirement, Pertz was encouraged by Frederick Blackman to undertake research on meristematic tissue, but after a year observing germinating seeds her results were inconclusive. She abandoned research, possibly over disappointment, though Agnes Arber claimed \"she came to recognize that the plant physiology of the twentieth century was developing on lines widely divergent from those on which she had been educated and that it demanded a grasp of mathematics, physics, and chemistry, which she did not possess.\""]}, {"page": "January 1947", "response": ["*Died: Frederick Blackman, 80, British plant physiologist"]}, {"page": "Denis G. Lillie", "response": ["At Cambridge, Lillie gained a reputation for caricatures of faculty members, including the geneticist William Bateson and the botanists Frederick Blackman and Arthur George Tansley. These drawings caught the attention of Arthur Shipley, who collected some of them which were eventually deposited into the National Portrait Gallery in London."]}, {"page": "Richard Henry Yapp", "response": ["Yapp was born on 8 October 1871 at Orleton, Herefordshire, England, the son of Jane (née Gammidge) and Richard Keysall Yapp, a landowner and farmer. After attending a private school at Leominster he was educated at Hereford's County School, but his education ended when he was 15 due to the death of his father. Although working, his thirst for knowledge led him to attend a variety of classes, including some at University College, Nottingham, and in 1895 he was awarded a scholarship and entered St John's College, Cambridge. He studied botany under Harry Marshall Ward, Albert  Seward and Frederick Blackman, graduating with First Class Honours. He was awarded the Frank Smart Studentship by Gonville and Caius College, to which he transferred in June 1899. He was captain of the university's lacrosse team for the year 1898–1899."]}]}}