{"wiki_id": "http://www.wikidata.org/entity/Q3610759", "itemLabel": "Lord Alexander Gordon-Lennox", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Alexander_Gordon-Lennox", "wikipedia_page": {"main": "Lord Alexander Francis Charles Gordon-Lennox (14 June 1825 – 22 January 1892), was a British Conservative politician.\n\n", "link_mentions": [{"page": "Gordon (surname)", "response": ["* Lord Alexander Gordon-Lennox (1825–1892), British Conservative politician"]}, {"page": "Marie Tempest", "response": ["In 1898 Tempest married again, to the actor-playwright Cosmo Gordon-Lennox (known professionally as Cosmo Stuart), the son of Lord Alexander Gordon-Lennox. On his advice, Tempest forsook operettas for straight comedy. In 1900 she created the role of Nell Gwynne in Anthony Hope's English Nell (based on Simon Dale) at the Prince of Wales's Theatre in London,\"Marie Tempest Applauded in Comedy\", The New York Times, 22 August 1900 followed at the same theatre in 1901 by the title roles in Peg Woffington by Charles Reade, and Becky Sharp, an adaptation of Vanity Fair, by Robert Hichens and her husband. The same year, she played Polly Eccles in T. W. Robertson's Caste, followed in 1902 by the title role in The Marriage of Kitty, also written by her husband. These established her as a leading comedy actress, particularly when playing the type of vivacious lady in drawing room comedies that Time called \"a Marie Tempest part... a sprightly, well-bred matron, with a feline manner and a sharp tongue but a heart of gold.\"\"Milestones, Oct. 26, 1942\", Time, accessed 17 April 2021 Max Beerbohm described her as \"one of the very few English actresses equipped for emotion\".Beerbohm, p. 329"]}, {"page": "Lord Henry Lennox", "response": ["Lennox was the third son of Charles Gordon-Lennox, 5th Duke of Richmond, and Lady Caroline, daughter of Field Marshal Henry Paget, 1st Marquess of Anglesey. He was the brother of Charles Gordon-Lennox, 6th Duke of Richmond, Lord Alexander Gordon-Lennox and Lord George Gordon-Lennox. He was educated at The Prebendal School, Chichester, then University of Oxford.thepeerage.com Rt. Hon. Lord Henry Charles George Gordon-Lennox"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Lord Alexander Gordon-Lennox||Conservative"]}, {"page": "Cliviger", "response": ["Walk Mill is on Burnley Road, where it passes over the River Calder. Barcroft is to the north and Dyneley is southwest. In 1311 Henry de Lacy held 80 acres of land and a water-mill in Cliviger. A medieval fulling mill (often water-powered) could also be known as a walk mill. Mount Zion Independent Methodist chapel was built in 1853 and superseded an earlier building of 1835. The engine house of Railway Pit drift mine still survives (installed in 1848) next to the chapel. A weaving shed was built here in 1876, in-between the wars there were 736 looms operating. It closed in 1958 and has been demolished. A public house called the Gordon Lennox opened in 1892, named after Lady Emily Frances Gordon-Lennox, daughter of Charles Towneley and wife of Lord Alexander Gordon-Lennox. It superseded an earlier building across the road,  and has since been demolished to make way for a housing development."]}, {"page": "New Shoreham (UK Parliament constituency)", "response": ["| Lord Alexander Gordon-Lennox"]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|Lord Alexander Gordon-Lennox||Conservative"]}, {"page": "Lord Alexander Francis Charles Gordon-Lennox", "response": ["#REDIRECT Lord Alexander Gordon-Lennox"]}, {"page": "Alexander Francis Charles Gordon-Lennox", "response": ["#REDIRECT Lord Alexander Gordon-Lennox"]}, {"page": "Lord Alexander Lennox", "response": ["#REDIRECT Lord Alexander Gordon-Lennox"]}, {"page": "Lord George Gordon-Lennox", "response": ["Gordon-Lennox was the fifth son of Charles Gordon-Lennox, 5th Duke of Richmond and Lady Caroline, daughter of Field Marshal Henry Paget, 1st Marquess of Anglesey. Charles Gordon-Lennox, 6th Duke of Richmond, Lord Henry Lennox and Lord Alexander Gordon-Lennox were his elder brothers."]}, {"page": "Towneley family", "response": ["Son of Peregrine and Charlotte. He married Lady Caroline Molyneux, the daughter of William Molyneux, 2nd Earl of Sefton in 1836 and had three daughters : Alice, the second wife of Thomas O'Hagan, 1st Baron O'Hagan, Emily, who married Lord Alexander Gordon-Lennox, and Caroline, who married Montagu Bertie, 7th Earl of Abingdon. Elected as a fellow of the Royal Society of London in 1842. Held the Lordship of Bowland from 1846 to 1876. Elected as an MP for Sligo Borough (now in the Republic of Ireland) in 1848 and 1852, however unseated on petition both times. High Sheriff of Lancashire in 1857. His horse Kettledrum won the 1861 Epsom Derby, He (and possibly others) used the winnings to build St Hubert's catholic church in Dunsop Bridge.St. Hubert's Website  Accessed 2010 Towneley was commissioned on 16 March 1853 to raise the 5th Royal Lancashire Militia with the rank of Lieutenant-Colonel Commandant, with his brother John as one of the majors.Hart's, various dates. He retired from the command on 23 March 1863 (when his brother was promoted to succeed him) and was appointed Honorary Colonel of the regiment.Army List, various dates.London Gazette Accessed 2010 JP. DL. FSA.", "Son of Peregrine and Charlotte, brother of Charles, married Lucy Tichborne, the daughter of Henry Joseph Tichborne, (the 8th Baronet) and Anne, daughter of Sir Thomas Burke, Marble Hill, Galway Ireland in 1840. Was MP for Beverly from 1841 to 1852. He followed his brother as Lt-Col (1863) and then Hon Col (1876) of the 5th Royal Lancashire Militia. Held the Lordship of Bowland from 1876 to 1878. Inherited the estate two years before he died, and his only son, Richard, died the year before. John had four daughters, Therese who married John Delacour, Evelyn, Mary, and Mabel. It was necessary to divide the estate between Charles' and John's daughters. Charles' eldest daughter Caroline was already dead and her share went to her husband Montagu Bertie, 7th Earl of Abingdon. His middle daughter Emily, the wife of Lord Alexander Gordon-Lennox inherited the properties in Worsthorne and Cliviger. The portion that included Towneley Hall and its park went to his youngest, Alice, the wife of Baron O'Hagan."]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|Lord Alexander Gordon-Lennox"]}, {"page": "Alexander Gordon-Lennox", "response": ["*Lord Alexander Gordon-Lennox (1825–1892), British Conservative politician"]}, {"page": "Charles Towneley (MP)", "response": ["He married Lady Caroline Molyneux, the daughter of William Molyneux, 2nd Earl of Sefton in 1836 and had three daughters : Alice, the second wife of Thomas O'Hagan, 1st Baron O'Hagan, Emily, who married Lord Alexander Gordon-Lennox, and Caroline, who married Montagu Bertie, 7th Earl of Abingdon. Elected as a fellow of the Royal Society of London in 1842. Held the Lordship of Bowland from 1846 to 1876, and was High Sheriff of Lancashire in 1857; also JP, DL, and FSA."]}, {"page": "St Thomas of Canterbury Church, Fulham", "response": ["Among its notable burials are: Sir Thomas Henry, Chief Magistrate of London; the politician Lord Alexander Gordon-Lennox and his wife Emily; Mrs. Elizabeth Bowden, benefactress of St Thomas's church and attached school, and her daughter; architects, Joseph Aloysius Hansom designer of numerous church buildings  including Our Lady of Dolours, Chelsea as well as of the Hansom cab and founder of the influential journal, The Builder; Herbert Gribble architect of Brompton Oratory, and Joseph Scoles, designer of Church of the Immaculate Conception, Farm Street. In addition to several mayors and aldermen of the Metropolitan Borough of Fulham, in 1911, 1912 and 1918 three infant great – grandchildren of Charles Dickens were buried there.Leach Evinson, Hazel. St Thomas of Canterbury Parish History There are three World War I officer casualties laid to rest at the cemetery. There is also a War Memorial with the names of 59 parishioners who died during 1914–1919. The War Memorial, the tombstone of Warrington Taylor and the Harwath Mausoleum in this small walled cemetery are Grade II listed with Historic England.Bridget Cherry and Nikolaus Pevsner, 'The Buildings of England London 3: North West' (Penguin, 1999 ed) p233Barbara Denny 'Fulham Past' (Historical Publications), 1997.War Memorial HE listingHarwath Mausoleum HE listingWarrington Taylor tomb HE listing"]}, {"page": "Cosmo Gordon-Lennox", "response": ["Gordon-Lennox was born  on 17 August 1869, the only son of Lord Alexander Gordon-Lennox and his wife, Emily Frances, née Towneley.\"Alexander Francis Charles Gordon-Lennox\", Ancestry. Retrieved 17 April 2021  He was educated at the Oratory School, Birmingham, after which he was trained as an actor by Sarah Thorne.\"Mr Cosmo Gordon-Lennox\", The Stage, 4 August 1921, p. 13"]}]}}