{"wiki_id": "http://www.wikidata.org/entity/Q36185", "itemLabel": "Bill Tarmey", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Tarmey", "wikipedia_page": {"main": "Bill Tarmey (born William Piddington; 4 April 1941 – 9 November 2012) was an English actor and singer, best known for playing Jack Duckworth in the soap opera Coronation Street. First appearing in the role in November 1979, he played it continually from 1981 to 2010.", "link_mentions": [{"page": "Coronation Street", "response": ["Coronation Street became known for the portrayal of strong female characters,Geraghty, Christine. Women and Soap Opera, Polity Press, London, 1991. () including original cast characters like Ena, Annie and Elsie, and later Hilda Ogden (Jean Alexander), who first appeared in 1964; all four became household names during the 1960s.Little. (2000) p.5. Warren's programme was largely matriarchal, which some commentators put down to the female-dominant environment in which he grew up. Consequently, the show has a long tradition of psychologically-abused husbands, most famously Stan Ogden (Bernard Youens) and Jack Duckworth (Bill Tarmey), husbands of Hilda and Vera Duckworth (Liz Dawn), respectively.", "On 21 December 2012, Coronation Street produced a Text Santa special entitled A Christmas Corrie which featured Norris Cole in the style of Scrooge, being visited by the ghosts of dead characters. The ghosts were Mike Baldwin, Maxine Peacock, Derek Wilton and Vera Duckworth. Other special guests include Torvill and Dean, Lorraine Kelly and Sheila Reid. The episode concluded with Norris learning the error of his ways and dancing on the cobbles. The original plan for this feature was to have included Jack Duckworth, along with Vera, but actor Bill Tarmey died before filming commenced. In the end a recording of his voice was played."]}, {"page": "Stock Aitken Waterman", "response": ["Being the top producers in 1989, with seven number one singles, SAW started the 1990s with high hopes. February 1990 brought their last UK No.1 single, Kylie Minogue's cover of \"Tears on My Pillow\", and a top 10 hit with new recruit Lonnie Gordon, \"Happenin' All Over Again\" which hit No.4. However, by mid-1990 SAW artists were having problems placing singles in the top 10 (with the notable exception of Kylie Minogue), and the week of 13 October 1990 became the first with no SAW-produced singles in the UK top 75 in over two years. In mid-1991, Matt Aitken left the team due to stress, and Stock and Waterman carried on. With their sound no longer in vogue, they still had notable hits with Jason Donovan (who left them in 1991) and Kylie Minogue (who left them in 1992). 1993 saw a slight resurgence with two top 10 hits from Sybil, and top 40 hits from Bananarama, Bill Tarmey and the WWF Superstars. They also had a top 20 hit that year in the U.S. market with American female group Boy Krazy. In late 1993, Mike Stock ended his partnership with Waterman following a disagreement over their finances."]}, {"page": "Betty Williams (Coronation Street)", "response": ["Betty was the longest-serving barmaid of the soap's public house, The Rovers Return. She first served behind the bar in 1969 and had been shown to work there for 42 years, as of 2011. There have been brief breaks however, as storylines have led to the character being fired or quitting her post. She was fired by Annie Walker (Doris Speed), who accused her of theft, and she quit her post in 1995 when Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) took over as landlords. In the summer of 2009, Betty was sacked again temporarily by manager Poppy Morales. In a storyline that aired in February 2010, Betty – at 90 years old – was named Manchester's Oldest Barmaid. In a plot twist, a 91-year-old rival comes forward, resulting in Betty fearing she killed her, when the rival consumes a two-month-old hotpot."]}, {"page": "Richard Hillman", "response": ["In the course of events surrounding Richard's plight to avoid financial bankruptcy and allow his property company called \"Kellet Holdings\" to remain afloat, he ended up leaving his business partner Duggie Ferguson (John Bowe) to die after the latter ends up having a fatal accident; murdering his ex-wife Patricia (Annabelle Apsion) with a shovel when she attempts to expose his fraudulent dealings; clashing with Gail's former ex-husband Martin (Sean Wilson) on certain family occasions; forming a subsequent entrepreneurship with fellow businessman Steve McDonald (Simon Gregson); swindling neighbours Jack Duckworth (Bill Tarmey) and his spouse Vera (Liz Dawn) from their life savings in an investment scam; kidnapping local gossip Norris Cole (Malcolm Hebden) to stop him from investigating the truth about Kellett Holdings and after he prevents his childhood friend Rita Fairclough (Barbara Knox) from being conned as well; befriending Gail's eldest son Nick Tilsley (Adam Rickitt) when he gets invited to their wedding; attempting to bribe the street's Councillor Curly Watts (Kevin Kennedy) with the discovery that a Bail Hostel operation threatens to jeopardize his development plans; forcing Patricia's best-friend Charlotte Morris (Joanne Zorian) to leave Weatherfield after she threatens to uncover the true circumstances behind her fate; plotting to kill his mother-in-law Audrey Roberts (Sue Nicholls) by setting her house on fire, after which he exploits his failure to doing so with the conclusion that she has Alzheimer's disease; becoming enemies with Audrey's companion Archie Shuttleworth (Roy Hudd) in light of setting fire to her house; killing Audrey's co-worker Maxine Peacock (Tracy Shaw) with a crowbar after using it to unsuccessfully murder Norris' roommate Emily Bishop (Eileen Derbyshire) as part of his plan to extract her house as a result of his equity release scheme that Emily signed with his company; and framing Sarah's troublesome ex-boyfriend Aiden Critchley (Dean Ashton) for the crime of both Emily's attack and Maxine's murder in retribution for Aidan causing an earlier car crash that nearly killed Sarah and left her hospitalized for a while."]}, {"page": "Liz Dawn", "response": ["Sylvia Ann Ibbetson  (née Butterfield; 8 November 1939 – 25 September 2017), known professionally as Elizabeth Dawn or Liz Dawn, was an English actress, best known for her role as Vera Duckworth in the long-running British soap opera Coronation Street. First starting on the serial in 1974, she had a recurring role as a factory worker until her husband, Jack, (played by Bill Tarmey) first appeared in 1979. She played the character of Vera for 34 years. For her role in the soap, she received the Lifetime Achievement Award at the 2008 British Soap Awards. She was appointed an MBE in the 2000 Queens Birthday Honours.", "Dawn first appeared in Coronation Street in 1974. She had a recurring role as a factory worker until her husband, Jack, (played by Bill Tarmey) first appeared in 1979.", "Dawn's final appearance came in the episode screened on 18 January 2008, when Vera Duckworth died in her sleep, thus ending 34 years of the character's appearances in the series. Bill Tarmey, who played on screen husband Jack Duckworth, continued to be a part of the cast of Coronation Street and Dawn stated that the hardest thing about leaving Corrie was saying good-bye to Tarmey, with whom she was best friends. On 8 November 2010, she made a brief one-off return to the soap for the final scenes of her on-screen husband, Jack, who died in the same chair as Vera. Dawn appeared as Vera's spirit, who had come to take Jack on his final journey and the pair enjoyed one final dance together.", "| Regular role; 2,275 episodesWon: 2001 British Soap Award for Best On-Screen Couple (shared with Bill Tarmey);2008 British Soap Award Lifetime Achievement", "Nominated: 2008 Television and Radio Industries Club Award for TV Soap Personality;1999 British Soap Award for Best On-Screen Partnership (shared with Bill Tarmey)"]}, {"page": "Ardwick", "response": ["* Bill Tarmey (né William Piddington), actor and singer best known for his portrayal as Jack Duckworth in Coronation Street"]}, {"page": "Maria Connor", "response": ["Maria is first seen working in the kennels belonging to her father, Eric (Steve Money). Tyrone Dobbs (Alan Halsall) and Jack Duckworth (Bill Tarmey) bring Tyrone's greyhound, Monica, in to look for a stud to mate with. Maria and Tyrone are immediately attracted to one another and the pair begin a relationship. Tyrone proposes to Maria at the top of Blackpool Tower and she happily accepts. However, their relationship quickly dissolves as Tyrone succumbs to his feelings for Fiz Brown (Jennie McAlpine), leading a heartbroken Maria to end their engagement."]}, {"page": "List of songs produced by Stock Aitken Waterman", "response": ["| rowspan=\"2\" | Bill Tarmey"]}, {"page": "Frankie Baldwin", "response": ["After a while, Frankie began to settle into the street more - especially after striking up a bond with Vera Duckworth (Liz Dawn). When Vera was ill, Frankie took care of her by doing her chores for her, filling in her job for her and advised her husband Jack (Bill Tarmey) to be more sensitive and attentive to Vera's needs. This led to Frankie securing a permanent position at the cafe, where she works with enemy Leanne."]}, {"page": "Gail Platt", "response": ["Gail, however, is absolutely horrified with the truth of her husband and calls Richard \"Norman Bates With A Briefcase\" before throwing him out. She later reconciles with Audrey and together the pair give a statement to the police about Richard's confession, thus exposing his crimes and making him the most wanted fugitive in the UK. Gail subsequently attempts to rebuild her life back on track, but Richard secretly returns three weeks after fleeing Coronation Street. He takes Gail, Sarah, David (now played by Jack P. Shepherd) and Bethany hostage and attempts to gas them in the garage but their neighbours hear the sound of Richard's car in the garage, so he speeds off and drives them all into the canal. Gail, Sarah, David, and Bethany survive but Richard drowns. Gail later finds out that she faces financial ruin, due to Richard's actions and could lose her house. Her neighbour Vera Duckworth (Elizabeth Dawn) accuses her of being in league with Richard, as she and her husband Jack (Bill Tarmey) also face financial instability as Richard was their financial advisor. However, Audrey saves the day by using her life savings to buy the house for Gail and her family."]}, {"page": "Vera Duckworth", "response": ["Vera Duckworth (also Burton) is a fictional character from the British ITV soap opera Coronation Street, portrayed by Liz Dawn. Vera is known for her long-standing marriage to Jack Duckworth (Bill Tarmey); they became one of the best-loved couples in television history. Vera was often shown in a comedic light.", "Vera first appeared working in the Mark Brittan mail order warehouse on Coronation Street, and formed a friendship with Ivy Tilsley (Lynne Perrie). Vera later moved into the street, much to the dismay of her new neighbours. Although it was originally stated that Vera was divorced, that was later overlooked when her husband Jack Duckworth (Bill Tarmey) was introduced. They argued frequently although she still made an effort with Jack, often using the comically spoken phrase \"Don't you love me any more, Jack?\". Despite their problems, Jack and Vera cared about each other.", "Vera's relationship with Jack Duckworth (Bill Tarmey) was always up and down, they had a rocky marriage and sometimes Jack appeared to show little care for her. Tarmey describes the first few decades in the following manner: \"He would never knowingly hurt people and he loves Vera, although he doesn't always like her. He will defend her to the death, unless the chap slagging her off is bigger than he is! Jack is not a thief either!\" In their \"hey-day\" they were dubbed as the modern day Stan (Bernard Youens) and Hilda Ogden (Jean Alexander). In their early days, Jack and Vera both had their fair share of dalliances. In 1982, whilst Vera was entertaining her own boyfriend, Jack had developed an attraction towards Bet Lynch (Julie Goodyear).  They believed the storyline was a turning point for the two and was written with wit. Dawn opines: \"It was very cleverly written, because Vera knew that Jack had a girlfriend on the side but she didn't know the other woman was Bet. So she chose Bet as someone to confide in, and she really opened her heart. It was quite moving as well as funny.\" This led to classic showdown in the Rovers."]}, {"page": "Jack Duckworth", "response": ["John \"Jack\" Duckworth is a fictional character from the British ITV soap opera, Coronation Street, played by Bill Tarmey. The character debuted on-screen during the episode broadcast on 28 November 1979. Jack was introduced by executive producer Bill Podmore. Tarmey had previously appeared as a background character in many episodes featuring scenes in the Rovers Return, including some occasional speaking lines.", "Jack makes his first appearance on 28 November 1979 when Vera forces him to attend the wedding of her friend and colleague Ivy Tilsley's (Lynne Perrie) son Brian (Christopher Quinten) to Gail Potter (Helen Worth). He returns in 1981 and for almost two years, appears on a recurring basis. Jack and Vera move into the street in 1983, much to the dismay of many of Weatherfield's residents. Prior to Jack's 1979 debut, Bill Tarmey often appeared as an extra in The Rovers Return Inn, playing darts. Jack later has an affair with Bet Lynch (Julie Goodyear), which he later regrets. Jack enrols with a video dating agency in 1983, referring to himself as \"Vince St. Clair\" and obtains a white suit, gold medallion and phoney trans-Atlantic accent. Vera also takes part in this. She refers to herself as \"Carole Munroe\", and is shocked when she sees Jack's video. She arranges to meet him in The Rovers Return, wearing a ginger wig, claiming to be a rich widow. When she turns around, Jack is shocked to see his wife staring back at him and she chases him out of the pub much to the amusement of the other customers.", "From September 2009 onwards, Tarmey filmed on an episodic basis. In a storyline, Jack moved away from Coronation Street but continued to make occasional appearances at the Rovers and in the cafe. The reason for this was due to Tarmey's increasing health problems. On 9 April 2010, it was announced Tarmey would leave the show. His final scenes were broadcast on 8 November 2010. On 9 April 2010, it was announced that Bill Tarmey had quit his role of Jack in the show's fiftieth anniversary year. Speaking of his decision to quit, Tarmey stated: \"I've had the most amazing 30 years playing Jack. Because of him I've made fantastic friends and travelled all over the world. I'll be sorry to say goodbye.\" Filming Jack's final scenes upset Tarmey, of this he stated: \"It was delightful. And very moving. It was a case of 'Pass the hand towel' [...] you know, filming those scenes was difficult. I'm leaving my other family. I've worked with all these people for 30-odd years and it was impossible for me to act or watch the death scene and cut that off.\"", "TV critic Jim Shelley for the Daily Mirror spoke of his regret that Jack Duckworth would be leaving the show: \"Soap characters come and go, but it's a genuine shame that, after 31 years, Bill Tarmey is finally leaving Coronation Street. It's hard to think of a more popular or nicer character than Jack Duckworth. Decent people are few and far between in soaps. Viewers loved Stan and Hilda Ogden for example. But you couldn't say that they were as warm or reassuring a presence as Jack. Of course he was part of one of the great loving couples/double acts in Street history.\" 11.64 million viewers tuned in to see Jack's final appearance."]}, {"page": "Roy Cropper", "response": ["Bill Webster (Peter Armitage) and Jim McDonald (Charles Lawson) find a cast-iron fireplace while renovating the flats and decide to sell it, but Jamie tells Roy they are stealing it and tries to blackmail them for £5. Roy gets a new job washing-up in a big hotel. To help Tricia out, he buys her TV for £30. Martin Platt (Sean Wilson) takes Roy on to help out in the cafe. Roy is interested to hear that Don Brennan (Geoffrey Hinsliff) has a ghost and offers the benefit of his experience, lending Vera Duckworth (Liz Dawn) books on ghosts and haunted houses. Vera and her husband Jack (Bill Tarmey) are alarmed to find Roy camping in their cellar at night searching for any signs of a ghost. He hasn't found anything."]}, {"page": "Sarah Lancashire", "response": ["In 1987, Lancashire made a brief appearance in Coronation Street as Wendy Farmer, a prospective lodger of series regular Jack Duckworth (Bill Tarmey). In the late 1980s, she also appeared in an episode of the children's anthology series Dramarama, and a single episode of the ITV sitcom Watching."]}, {"page": "Ashley Peacock", "response": ["Ashley is forced to sleep on the sofa and later gets drunk in The Rovers. Graeme and Tina take him home and let him spend the night at their flat in order to sleep off his hangover. Ashley attends Jack Dobbs' christening and Jack Duckworth (Bill Tarmey) asks him how things are between him and Claire. Ashley is forced to admit that his marriage may be over but Jack convinces Ashley to speak to Claire and he does so in The Rovers but they end up arguing again."]}, {"page": "Rovers Return Inn", "response": ["Arguably the most famous barmaid on Coronation Street, Bet Lynch (Julie Goodyear) was in charge of The Rovers Return for over 10 years. In late 1984, the brewery, Newton & Ridley, unhappy with the way the pub was being run into the ground by Billy Walker (Ken Farrington), makes him an offer he cannot refuse for the licence. Rather than re-sell the licence, the brewery decides to hire a manager and Bet applies, despite the fact that she thinks she has little chance, as the brewery normally favours married couples. She is astounded, though, to be told by Dame Sarah Ridley that the \"regulars\" at the pub have signed a petition insisting she be given the job. In 1985, she becomes the brewery's first single female manager and the first ever female manager of The Rovers. A year later, she is almost immediately put under threat as The Rovers is gutted by fire, caused by Jack Duckworth (Bill Tarmey), after he tried to fix the faulty lighting. During the inferno, she is rescued from her bedroom by Kevin Webster (Michael Le Vell). While the pub is being refurbished, the nearby \"Graffiti Club\" in Rosamund Street enjoys a massive increase in trade. Its owner, Alec Gilroy (Roy Barraclough), starts sniffing about after The Rovers re-opens two months later. As the pub struggles to recover from the loss of business, Bet gets to know Alec and even books some of his acts to get the trade back up, leading to a love/hate friendship with him. The following year, Newton & Ridley decides to sell the licence to the pub and offers Bet first refusal; however, Bet cannot raise the money and Alec, who was attracted to her, lends her the money to purchase the licence, allowing her to become the landlady.", "(Bill Tarmey and Liz Dawn)", "Newton & Ridley puts The Rovers Return up for sale. Possible owners are Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) and Jim (Charles Lawson) and Liz McDonald (Beverley Callard). Liz had previously run The Queens pub for the company in 1993. Though they had lived through financial hardship for much of their lives, Jack came into a large inheritance gained from the deaths of his brother Clifford (Dave King) and his wife, Elsie (Ursula Jones), in a car accident. Combined with the money made from selling No. 9, Jack and Vera have the cash ahead of the McDonalds and are allowed to buy The Rovers Return. As Jack has a criminal record, Vera is made the licensee. Vera, who always had elevated ideas of her own status, feels she has finally made something of her life. Unfortunately, the Duckworths' lack of business experience and workshy nature quickly landed them in trouble and in 1997 they discovered they owed over £17,000 in taxes. Desperate, they were forced to turn to Alec Gilroy (Roy Barraclough), who had returned from Southampton, who paid them £20,000 in exchange for a 50% share of the pub. The Duckworths and Alec had a poor business relationship, and it wasn't long before he decided he wanted out of the partnership and paid them £30,000 for the remainder of the business. The two accepted on the condition they were allowed to continue living and working in the pub.", "During a sing-a-long night, when the guests stood around the piano, the lights in the pub had been flickering and cutting out all night. Much to the frustration of Bet Lynch (Julie Goodyear) and the rest of the punters. Jack Duckworth (Bill Tarmey), potman at the time, decided to fix the problem. Upon return, he was graciously thanked for solving the problem. However, he had replaced the fuse with a far stronger one, leaving the problem of a potential explosion. Bet retired to bed that night, having locked up. In the middle of the night, the inevitable happened; the fuse box exploded and started a fire. This scene was shown at the end of the previous episode, Episode 2630 on 16 June 1986, showing the fuse box showering sparks as it exploded, with flames licking out from a left over box of scotch whisky over the end credits."]}, {"page": "Dustin Gee", "response": ["Gee's funeral was held on 9 January 1986, at St Oswald's Church, at Fulford, York. Three hundred people attended, amongst them Elizabeth Dawn, Bill Tarmey, Thelma Barlow, Sherrie Hewson, Dana, John Hamp, The Krankies, John Birt and Les Dennis.  Floral tributes were sent from Bob Monkhouse, Danny La Rue, Stan Boardman, Cannon and Ball, Jimmy Tarbuck, Little and Large, Mike Smith, Des O'Connor, Tom O'Connor, Jeffrey Holland, Susie Blake, Jim Bowen, Les Dawson, Larry Grayson, Ernie Wise and Russ Abbot."]}, {"page": "Tyrone Dobbs", "response": ["After his mother abandons him, Tyrone moves into Jack (Bill Tarmey) and Vera Duckworth's (Liz Dawn) bed and breakfast establishment and adopts a greyhound, Monica. While seeking a partner for Monica, Tyrone meets and begins dating Maria Sutherland (Samia Smith), a kennel maid and they get engaged in 2002. Fiz Brown (Jennie McAlpine), however, tries to come between them. She succeeds and has a brief relationship with Tyrone but he ends it and realises he is better suited to Molly Compton (Vicky Binns). They live with Jack and Vera at number 9 and plan to buy somewhere of their own but they buy Jack and Vera out when they decide to move to Blackpool. Vera, however, dies in January 2008. Jack stays with Tyrone and Molly at Number 9 and the family atmosphere is soon enhanced with the arrival of Molly's aunt, Pam Hobsworth (Kate Anthony)."]}, {"page": "Weatherfield", "response": ["Some characters have also worked there, notably Ken who took his first teaching job at Bessie Street in 1961, the year after the series began. He worked there intermittently until 1974.Little. (2000) p.13. Esther Hayes (Daphne Oxenford), who lived at No. 5 Coronation Street until 1962, also worked as a teacher at the school.Little. (2000) p.20. The role of lollipop man at Bessie Street has been held by Albert, Percy Sugden (Bill Waddington), Jack Duckworth (Bill Tarmey) and most recently Dennis and Malcolm Lagg (Robert Fyfe). The headteacher was Brian Packham (Peter Gunn), but he has been replaced. Melinda Calvert (Janet Dibley) is currently the headteacher of Bessie Street.", "Valandro's is an Italian restaurant. It was previously used as a secondary setting to restaurants such as The Clock, until bought by Carla Connor (Alison King) and Leanne Battersby (Jane Danson) in May 2007. After the unexpected death of Paul Connor (Sean Gallagher), however, Carla pulls out of the transaction, leaving Leanne to fund the cost of buying the business herself. She uses money earned from being an escort, combined with a £10,000 loan from Roger Stiles (Andrew Dunn). Amidst a plethora of financial trouble and staffing problems, in July 2007 Leanne hires Paul Clayton (Tom Hudson) to work at the restaurant as head chef. Paul later takes out a loan in his grandfather Jack Duckworth's (Bill Tarmey) name and buys a share of the restaurant. The business was failing so, in 2008 Leanne convinces Paul to set fire to the restaurant to claim the insurance,"]}, {"page": "Fiz Brown", "response": ["Fiz made her interest in Tyrone Dobbs (Alan Halsall) clear, kissing him. When his fiancé, Maria Sutherland (Samia Ghadie), found out, she broke up with him, and Tyrone and Fiz became a couple. When Terry Duckworth (Nigel Pivaro), the son of Tyrone's surrogate parents Jack (Bill Tarmey) and Vera (Elizabeth Dawn), is arrested on a false assault charge after coming out of hiding to take Jack to hospital, Fiz sells the story to the newspapers. The Duckworths are initially angry but it results in a witness coming forward to clear Terry. Fiz convinces Mike to use some designs she has done at the factory but she has accidentally plagiarised other designers and Mike sacks her. She stages a topless protest on the roof of the factory, which results in her getting her job back but sees Tyrone break up with her."]}, {"page": "Alan Bradley (Coronation Street)", "response": ["When Rita learned that her shop had been vandalised, she quickly suspected Alan of being the culprit and the police took him in for questioning. Alan proved to be innocent when the police caught a gang of children trying to sell videos that were stolen from The Kabin. A few weeks later, Rita disappeared without a trace and Alan was again questioned by the police. He was once more cleared when any evidence of his alleged involvement proved insufficient. He was nevertheless suspected by his fellow neighbors of killing Rita and burning her at the building site. Alan later went to The Rovers and ended up getting drunk, which prompted Rita's longtime friend and neighbour Percy Sugden (Bill Waddington) to confront him about her fate. When Percy continued to pester Alan over what he supposedly did to Rita, he threatens to attack Percy – which prompted his friends Don Brennan (Geoffrey Hinsliff) and Alf Roberts (Bryan Mosley), along with Terry's father Jack (Bill Tarmey), to all stand up to Alan. At the point where Alan was being hounded by everyone in The Rovers, he grabs a bottle and prepares to attack them until Jenny's best-friend Sally Webster (Sally Dynevor) rushes into The Rovers – telling them that the police have found something at the building site. This causes everyone to rush outside, assuming that it is Rita's body that has been found. Alan reluctantly joins them after Alf's wife and Gail's mother, Audrey Roberts (Sue Nicholls), sarcastically asks if he is bothered enough to feel curious in knowing what the police will find at the site."]}, {"page": "Wind Beneath My Wings", "response": ["In the 1990s, two English actor/singers released their versions as singles. Bill Tarmey's version in 1993, from his debut album A Gift of Love, reached No. 40 on the UK Singles Chart, while Steven Houghton's version from his self-titled debut album, reached No. 3 in 1997 and No. 21 in Ireland.", "Category:Bill Tarmey songs"]}, {"page": "St Winifred's School Choir", "response": ["In 1990, St. Winifred's School Choir teamed up with Ziba Banafsheh and recorded \"A Better World\" http://www.swisscharts.com/song/St.-Winifred%27s-School-Choir-featuring-Ziba-Banafsheh/A-Better-World-2141544 in aid of Mother Teresa of Calcutta's charity, for BMG's Ariola label. In 1993 they recorded the single \"One Voice\" with Bill Tarmey (better known as Jack Duckworth from Coronation Street), but ended up being uncredited on the release. This Barry Manilow cover would be produced by Mike Stock and Pete Waterman from 1980s hitmaking production team S/A/W and would reach number 16 in the UK singles chart for Tarmey (and BMG's Arista label)."]}, {"page": "Des Barnes", "response": ["Lisa was killed in February 1993 when she was run over by a car whilst crossing the street from the Rovers. Des was affected a lot more than Terry. Tommy went to live with Lisa's parents in Blackpool, but Des still saw him when they brought him to Weatherfield to visit Vera and Jack (Bill Tarmey)."]}, {"page": "Terry Duckworth", "response": ["Terry returns five years later with a pregnant girlfriend, Lisa Horton (Caroline Milmoe). Several months after his return, he is arrested for GBH and Lisa tells Jack (Bill Tarmey) and Vera (Liz Dawn) that Terry is in prison. He is released in order to marry Lisa, but uses the ceremony as an opportunity to escape briefly and is recaptured several days later. Terry has further three years added to his sentence. In September that year, Lisa gives birth to a son, whom she names Tommy (Darryl Edwards). The following year,"]}, {"page": "The British Soap Awards", "response": ["| \"Best On-Screen Partnership\" || David Neilson & Julie Hesmondhalgh (Roy Cropper & Hayley Patterson in Coronation Street) || Dean Sullivan & Sue Jenkins (Jimmy & Jackie Corkhill in Brookside)Bill Tarmey & Liz Dawn (Jack & Vera Duckworth in Coronation Street)Dominic Brunt & Lisa Riley (Paddy Kirk & Mandy Dingle in Emmerdale)", "| \"Best On-Screen Partnership\" || Bill Tarmey & Liz Dawn (Jack & Vera Duckworth in Coronation Street)", "| \"Best Exit\" || Bill Tarmey (Jack Duckworth in Coronation Street) || Lacey Turner (Stacey Branning in EastEnders)Andy Devine (Shadrach Dingle in Emmerdale)Carley Stenson (Steph Roach in Hollyoaks)", "| \"Lifetime Achievement Award\" || Bill Tarmey (Jack Duckworth in Coronation Street) || N/A", "Bill Tarmey, who played Jack Duckworth in Coronation Street, was remembered during the ceremony, having died in November 2012."]}, {"page": "Alec Gilroy", "response": ["Alec returned permanently in April 1996. In May 1997 he was made redundant from Sunliners. This didn't keep Alec down for too long, however, as he began a partnership with Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) at The Rovers Return, since Alec helped bail Jack and Vera out of a VAT bill."]}, {"page": "Weekend in New England", "response": ["*Bill Tarmey for his 1993 A Gift of Love."]}, {"page": "Jim McDonald (Coronation Street)", "response": ["Jim returns to celebrate his 55th birthday with Steve. He meets Becky's nephew, Max Turner (Harry McDermott), and catches up with Kevin in The Rovers. He also attends the funeral of old friend, Jack Duckworth (Bill Tarmey). The next day, Jim sends Liz some flowers which are intercepted by her new boyfriend, Owen Armstrong (Ian Puleston-Davies), who goes to \"The Flying Horse\" and warns Jim to stay away. Jim later goes to The Rovers and bumps into Owen again, goading him about the flowers and telling Steve what Owen has done. On 1 December 2010, Jim returns again and is disappointed that Liz is not there. He clashes with Owen again and then later phones Steve and tells him that he is in hospital after getting into a fight in a pub. Steve visits him, along with Owen and after Steve had gone, Owen hints to Jim that he is behind the attack. When Steve goes to collect Jim from the hospital, Jim warns Steve that Owen was behind the beating and asked him to watch out for his and Liz's safety."]}, {"page": "Inside Soap Awards", "response": ["| Bill Tarmey & Liz Dawn", "| Bill Tarmey"]}, {"page": "Natalie Barnes", "response": ["Unknown to all except Des, Tony has arrived on the Street with serious problems. He is now a drug dealer and in big financial trouble. He needs money and Natalie is quick to give him what he needs, although she never knows what it is for; it is not enough. While at home one night, Tony is accosted by three drug dealers, looking for the money that he owes them. Des happens to be there as they attack Tony and while trying to help him, he hits his head, sending him crashing onto the coffee table. Des dies in hospital of a heart attack. Bereft and looking for a new start, Natalie seeks comfort from The Rovers. Finding that it is for sale, Natalie buys the pub from Alec Gilroy (Roy Barraclough) on 30 December 1998. After shifting Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn) from their lodgings upstairs, Natalie moves into the pub and redecorates."]}, {"page": "Nigel Pivaro", "response": ["In November 2012, Pivaro did a reading at Bill Tarmey's funeral. Pivaro is a map enthusiast and frequently refuses to use GPS despite driving thousands of miles to assignment destinations. He is also a champion of the canal system."]}, {"page": "List of former Coronation Street characters", "response": ["|Jack Duckworth || Bill Tarmey || 1979, 1981–2010"]}, {"page": "Jackie Dobbs", "response": ["Liverpudlian Jackie first appeared in March 1998 as the cellmate of Deirdre Rachid (Anne Kirkbride); Jackie was in prison for ABH. Jackie's introduction was part of a high-profile storyline that saw Deirdre framed by her boyfriend and wrongfully imprisoned. Jackie first appeared in a specially constructed prison cell at Granada Studios. Deirdre's conviction was quashed within three weeks and she was released; Jackie soon followed her to the soap's primary setting of Weatherfield on parole, needing a friend to turn to, having been dumped by her partner and left homeless. Jackie moved to the area with her teenage son Tyrone (Alan Halsall), squatting in Curly Watts' (Kevin Kennedy) vacant premises. She became a factory worker for Mike Baldwin (Johnny Briggs), where she had numerous run-ins with Janice Battersby (Vicky Entwistle) over flirtations with Janice's husband Les Battersby (Bruce Jones). Jackie remained on the show for one year before leaving in the midst of a property feud with Curly, who had returned to Coronation Street to find her formally renting his house. Jackie fled back to Liverpool with her husband Darren (James McMartin), though Tyrone stayed behind as a lodger with Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn)."]}, {"page": "List of longest-serving soap opera actors", "response": ["|Bill Tarmey || Jack Duckworth || Coronation Street || 1979, 1981, 1982–2010 ||  years || "]}, {"page": "Molly Dobbs", "response": ["After briefly working in her father's shop and at Kirk's kennels, Molly then starts working for Dev Alahan (Jimmi Harkishin) at his corner shop. Molly begins dating Tyrone Dobbs (Alan Halsall) and lives with him and his foster parents Jack (Bill Tarmey) and Vera Duckworth (Liz Dawn). Molly forms a close bond and friendship with Vera and asks her for advice about her relationship with Tyrone. Molly is devastated when Vera dies in January 2008."]}, {"page": "List of Coronation Street characters (2008)", "response": ["On 25 July 2008, Pam buys Molly's boyfriend Tyrone Dobbs (Alan Halsall) a Fabergé egg to use to propose to Molly. Pam tells Jack Duckworth (Bill Tarmey), Molly, and Tyrone that she will leave if she has outstayed her welcome, but they insist she stay. Pam leads them to believe that her husband has died but tells Molly that he had, in fact, thrown her out for having an affair."]}, {"page": "List of Coronation Street characters (2000)", "response": ["Eric Sutherland is the father of Kirk Sutherland (Andrew Whyment) and Maria Connor (Samia Ghadie). He first appears on 19 May 2000 when Jack Duckworth (Bill Tarmey) and Tyrone Dobbs (Alan Halsall) are looking to mate Tyrone's greyhound Monica with one of the studs from his kennels. Eric reappears in 2005 to let Kirk know that he and his wife Dot (Susie Baxter) are retiring to Cyprus and Kirk goes out to visit him for several weeks after Eric has injured his back. He returns on 20 October 2008 to console his daughter following the death of her husband Liam (Rob James-Collier). He carries the coffin at Liam's funeral after Tony Gordon (Gray O'Brien) has to comfort a grief-stricken Carla (Alison King). This causes Liam's mother Helen (Sorcha Cusack) to be unhappy as Eric did not know Liam. Eric and Dot return to Cyprus following the funeral. In January 2015, Eric and Dot attend Kirk's wedding to Beth Tinker (Lisa George). Beth unwittingly insults Eric and Dot before realizing who they are. At the wedding reception, Eric gets drunk and flirts with Tracy Barlow (Kate Ford)."]}, {"page": "List of Coronation Street characters (2007)", "response": ["Doreen's character has been described as lively, bubbly and flirty. She has been revealed to have been a former member of Charlie Roscoe's Exotic Dancers, joining the troupe at only fifteen years old. One of Doreen's eyes is noticeably partially sighted. This has been claimed as an accident in which involved a lychee and a chopstick. Doreen was considered as a new love interest for Jack Duckworth (Bill Tarmey), following the death of his wife Vera (Liz Dawn), but this plan was shelved. "]}, {"page": "List of Coronation Street characters (2004)", "response": ["Eric Garside, played by Peter Kay, appeared on 30 January 2004. Eric is a drayman who arrives at the Rovers Return Inn in January 2004 for a date with Shelley Unwin (Sally Lindsay). He immediately reclaims £10 that Jack Duckworth (Bill Tarmey) had borrowed four years earlier. Eric takes Shelley to a posh restaurant and the pair then go back to Eric's house for a cup of tea. Eric's overbearing mother, Dolly, greets them in her dressing gown and Shelley beats a hasty retreat, refusing Eric's offer of another date. She advises him to cut the apron strings before asking another girl out."]}, {"page": "List of Coronation Street characters (1989)", "response": ["Tina Fowler, played by Michelle Holmes, made her first screen appearance on 13 March 1989. Tina was employed as a barmaid in The Rovers Return following the departure of Gloria Todd (Sue Jenkins). She was interviewed by landlady Bet Gilroy (Julie Goodyear) in the pub during opening hours and given the job shortly afterwards. Curly Watts (Kevin Kennedy) set his sights on Tina however she rejected him. Rovers cellarman Jack Duckworth (Bill Tarmey) became infatuated with Tina, she kept Jack at bay until one day when, for a laugh, she agreed to go out with him on what Jack thought was a date. Tina was happy to spend Jack's money but when he tried to get frisky with her she demanded he drive her home. Jack's wife Vera (Liz Dawn) was furious when she found out about Jack and Tina's \"date\" and was even more furious when Tina revealed that she only went out with him for a joke which resulted in Vera throwing a pint which missed Tina and drenched landlord Alec Gilroy (Roy Barraclough)."]}, {"page": "List of Coronation Street characters (2009)", "response": ["Connie Rathbone was a close friend of Jack Duckworth (Bill Tarmey). She first appears on 17 April 2009, when she discovers one of Jack's missing pigeons and returns it to him. Connie and Jack get friendly as they chat about them both being widows. As Connie's visits become more frequent, Tyrone (Alan Halsall) gets annoyed, seeing it as an insult to Jack's deceased wife Vera's (Liz Dawn) memory. In May, Connie invites Jack on holiday to Spain with her. Jack is afraid of what Tyrone will think of him and Connie going on holiday together, he lies and says he is going to Blackpool. In July, he visits Connie at her house and is amazed to discover that she is rich and lives in a lavish mansion. Tyrone is initially hostile towards Connie as he sees her as an insult to memories of Vera and believing she is after Jack's money, but realises this is not the case after seeing her big house. Jack moves in with Connie in September 2009 to give Tyrone and Molly more space."]}, {"page": "List of Coronation Street characters (2002)", "response": ["Blanche Hunt (Maggie Jones) introduces her boyfriend, undertaker Archie Shuttleworth, to her family and friends. Archie thinks Blanche is a right laugh. Blanche fakes weakness to win sympathy from Archie. Blanche is cheered up by Archie's visit. Blanche has a date with Archie despite Blanche's daughter Deirdre Rachid (Anne Kirkbride) and her partner Ken Barlow (William Roache) arrive home to find them dancing in the front room. Archie invites Blanche to go to Blackpool for the weekend with him. Blanche says she'll think about it. Deirdre is horrified. Jack Duckworth (Bill Tarmey) offers his services to Archie as a pallbearer; Archie says he'll bear it in mind if they're ever desperate. Archie and Blanche leave for Blackpool in Archie's hearse. Blanche and Archie arrive back from Blackpool where they've had a fantastic time ballroom dancing. Deirdre is shocked to learn that they stayed in Archie's caravan, which is open plan. Blanche tells Norris Cole (Malcolm Hebden) and Betty Williams (Betty Driver) that she is going to one of Archie's funerals and persuades Betty to join them. Archie tries to flatter Norris's work employee Rita Sullivan (Barbara Knox) into also becoming a professional mourner, but she refuses. After letting Blanche down by cancelling their plans for a day out, Archie promises to take her out for a slap-up meal the following evening.", "Audrey Roberts (Sue Nicholls) takes an instant disliking to Lillian and warns Fred about her, but he will not listen. She storms out watched by a smirking Lillian. Lillian then makes Jack Duckworth (Bill Tarmey) redundant on the grounds of old age and ill health. Wife Vera (Liz Dawn) storms into the pub and has a fight with Lillian. She then gives the cellar man job to son Timothy.", "Timothy Spencer is the son of Lillian Spencer (Maureen Lipman) who first appears in The Rovers Return Inn on 3 July 2002. He soon gets the job as cellar man at the pub after Lillian fires Jack Duckworth (Bill Tarmey). He subsequently leaves with Lillian and sister Danielle (Kelly Wenham), when Lillian gets another job offer."]}, {"page": "1941 in British television", "response": ["* 4 April – Bill Tarmey, actor (died 2012)"]}, {"page": "List of Coronation Street characters (1979)", "response": ["Jack Duckworth was introduced by executive producer Bill Podmore, and portrayed by Bill Tarmey. The character debuted on-screen during the episode aired on 28 November 1979, initially on a recurring basis. Tarmey made further appearances in 1981 and 1982, before joining full time in 1983. In April 2010, Tarmey announced his decision to leave the soap, and Jack's final appearance was broadcast on 8 November 2010. Jack's storylines have focused on his long-standing marriage to his wife Vera (Liz Dawn), which has often been described as \"complex\" and \"rocky\", as well as dealing with wayward son Terry (Nigel Pivaro) and his hobby for pigeon keeping. In his final storyline Jack was portrayed as having incurable non-Hodgkin lymphoma. Jack has been characterised through his \"joyless and gloomy\" life in which he has a string of dead end jobs but continued to pass witty remarks on life. Critics have described Jack as a loveable rogue type character and have favoured his relationship with Vera."]}]}}