{"wiki_id": "http://www.wikidata.org/entity/Q3618091", "itemLabel": "Annie Kenney", "itemDescription": "British suffragette (1879-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Annie_Kenney", "wikipedia_page": {"main": "Ann Kenney (13 September 1879 – 9 July 1953) was an English working-class suffragette and socialist feminist who became a leading figure in the Women's Social and Political Union. She co-founded its first branch in London with Minnie Baldock. Kenney attracted the attention of the press and public in 1905 when she and Christabel Pankhurst were imprisoned for several days for assault and obstruction related to the questioning of Sir Edward Grey at a Liberal rally in Manchester on the issue of votes for women. The incident is credited with inaugurating a new phase in the struggle for women's suffrage in the UK with the adoption of militant tactics. Annie had friendships with Emmeline Pethick-Lawrence, Baroness Pethick-Lawrence, Mary Blathwayt, Clara Codd, Adela Pankhurst, and Christabel Pankhurst.", "link_mentions": [{"page": "Accrington", "response": ["*Jenny (Jane) Kenney, sister of suffragette Annie Kenney who taught at Montessori school in the 1900s"]}, {"page": "1953", "response": ["* July 9 – Annie Kenney, British working-class suffragette (b. 1879)"]}, {"page": "H. H. Asquith", "response": ["In 1906 suffragettes Annie Kenney, Adelaide Knight, and Jane Sbarborough were arrested when they tried to obtain an audience with Asquith. Offered either six weeks in prison or giving up campaigning for one year, the women all chose prison. Asquith was a target for militant suffragettes as they abandoned hope of achieving the vote through peaceful means. He was several times the subject of their tactics: approached (to his annoyance) arriving at 10 Downing Street (by Olive Fargus and Catherine Corbett whom he called 'silly women', confronted at evening parties, accosted on the golf course, and ambushed while driving to Stirling to dedicate a memorial to Campbell-Bannerman. On the last occasion, his top hat proved adequate protection against the dog whips wielded by the women. These incidents left him unmoved, as he did not believe them a true manifestation of public opinion."]}, {"page": "Women's suffrage", "response": ["In 1903 a number of members of the NUWSS broke away and, led by Emmeline Pankhurst, formed the Women's Social and Political Union (WSPU).Bonnie Kime Scott (2007). \"Gender in modernism: new geographies, complex intersections\" p. 693. University of Illinois Press, 2007 As the national media lost interest in the suffrage campaign, the WSPU decided it would use other methods to create publicity. This began in 1905 at a meeting in Manchester's Free Trade Hall where Edward Grey, 1st Viscount Grey of Fallodon, a member of the newly elected Liberal government, was speaking.June Purvis, Sandra Stanley Holton (2000). \"Votes for women\" p. 112. Routledge, 2000 As he was talking, Christabel Pankhurst and Annie Kenney of the WSPU constantly shouted out, \"Will the Liberal Government give votes to women?\" When they refused to cease calling out, police were called to evict them and the two suffragettes (as members of the WSPU became known after this incident) were involved in a struggle which ended with them being arrested and charged for assault. When they refused to pay their fine, they were sent to prison for one week, and three days. The British public were shocked and took notice at this use of violence to win the vote for women."]}, {"page": "Oldham", "response": ["Annie Kenney, born in nearby Springhead, and who worked in Oldham's cotton mills, was a notable member of the Suffragette movement credited with sparking off suffragette militancy when she heckled Winston Churchill, and later (with Emmeline Pankhurst) the first Suffragist to be imprisoned. Oldham Women's Suffrage Society was established in 1910 with Margery Lees as president and quickly joined the Manchester and District Federation of the National Union of Women's Suffrage Societies. The Chartist and Co-operative movements had strong support in the town, whilst many Oldhamers protested in support of the emancipation of slaves. The Riot Act was read in 1852 on election day following a mass public brawl over the Reform Act, and irregularities with parliamentary candidate nominations."]}, {"page": "List of feminists", "response": ["|1875–1939||data-sort-value=\"Kenney, Annie\"|Annie Kenney||United Kingdom||1879||1953||Suffragette||"]}, {"page": "Christabel Pankhurst", "response": ["In 1905 Christabel Pankhurst interrupted a Liberal Party meeting by shouting demands for voting rights for women. She was arrested and, along with fellow suffragette Annie Kenney, went to prison rather than pay a fine as punishment for their outburst. Their case gained much media interest and the ranks of the WSPU swelled following their trial. Emmeline Pankhurst began to take more militant action for the women's suffrage cause after her daughter's arrest and was herself imprisoned on many occasions for her principles.", "After obtaining her law degree in 1906, Christabel moved to the London headquarters of the WSPU, where she was appointed its organising secretary. Nicknamed \"Queen of the Mob\", she was jailed again in 1907 in Parliament Square and in 1909 after the \"Rush Trial\" at Bow Street Magistrates' Court. Between 1913 and 1914 she lived in Paris to escape imprisonment under the terms of the Prisoner's (Temporary Discharge for Ill-Health) Act, better known as the \"Cat and Mouse Act\" but continued to provided editorial lead to The Suffragette through visitors such as Annie Kenney and Ida Wylie who crossed the Channel for her advice. Other campaigners visited Paris to have Christmas dinner with her in 1912; these included Irene Dallas, Hilda Dallas,  Jessie Murray Clark, Blanche Edwards, Dorothy Hapgood, Gwendolyn Hensley and Alice Morgan Wright."]}, {"page": "Free Trade Hall", "response": ["In 1905 the Women's Social and Political Union (WSPU) activists, Christabel Pankhurst and Annie Kenney were ejected from a meeting addressed by the Liberal politician Sir Edward Grey, who repeatedly refused to answer their question on Votes for Women. Christabel Pankhurst immediately began an impromptu meeting outside, and when the police moved them on, contrived to be arrested and brought to court. So began the militant WSPU campaign for the vote."]}, {"page": "History of feminism", "response": ["Pankhursts formed the Women's Social and Political Union (WSPU) in 1903. As Emmline Pankhurst put it, they viewed votes for women no longer as \"a right, but as a desperate necessity\". At the state level, Australia and the United States had already granted suffrage to some women. American feminists such as Susan B. Anthony (1902) visited Britain. While WSPU was the best-known suffrage group, it was only one of many, such as the Women's Freedom League and the National Union of Women's Suffrage Societies (NUWSS) led by Millicent Garrett Fawcett. WSPU was largely a family affair, although externally financed. Christabel Pankhurst became the dominant figure and gathered friends such as Annie Kenney, Flora Drummond, Teresa Billington, Ethel Smyth, Grace Roe, and Norah Dacre Fox (later known as Norah Elam) around her. Veterans such as Elizabeth Garrett also joined."]}, {"page": "Women's Social and Political Union", "response": ["The group was formed in 1907 by Annie Kenney’s sister Jessie and Adele Pankhurst.", "Suffragettes not only used theatre to their advantage, but they also employed the use of comedy. The Women's Social and Political Union was one of the first organisations to capitalise on comedic satirical writing and use it to outwit their opposition. It not only helped them diffuse hostility towards their organisation, but also helped them gain an audience. This use of satire allowed them to express their ideas and  frustrations as well as combat gender prejudices in a safer way. Suffrage speakers, who often held open-air meetings in order to reach a wider audience, had to face hostile audiences and learn how to deal with interruptions. The most successful speakers, therefore, had to acquire a quick wit and learn to \"always to get the best of a joke, and to join in the laughter with the audience even if the joke was against\" them. Suffragette Annie Kenney recalls an elderly man continuously jeering “if you were my wife I’d give you poison\" throughout the course of her speech, to which she replied \"yes, and if I were your wife I’d take it,\" diffusing threats and making her antagonist appear laughable.", "*Annie Kenney"]}, {"page": "Clifton, Bristol", "response": ["* Annie Kenney - leading suffragetteElizabeth Crawford, The Women's Suffrage Movement: A Reference Guide, Routledge, 2003"]}, {"page": "Margot Asquith", "response": ["Asquith was a staunch opponent of women's suffrage, once saying in a letter that  'women have no reason, very little humour, hardly any sense of honour...and no sense of proportion.'  On holiday in 1909 in Clovelly Court, Devon the Asquiths were followed by suffragettes Elsie Howey, Jessie Kenney and Vera Wentworth, whom Margot recognised again at church and they also hid in her garden, covering plants with the colours of the movement purple, white and green. She attended the debate on the aborted Conciliation Bill with other politicians wives, and in 1911 she  'seemed highly amused at the earnestness' of women's suffrage lobbyists, whilst near to Constance Lytton and Annie Kenney, who remembered her as unpleasant and sarcastic . In 2012 an article in Votes for Women told of Asquith's 'stealth' journey when travelling with her husband as Prime Minister via Wolverhampton and Holyhead ferry to Dublin, when their ferry was still met by a yacht of Irish Women's Franchise League demanding the female vote be included in the Irish Home Rule Bill."]}, {"page": "First-wave feminism", "response": ["* United Kingdom: On October 10, Christabel Pankhurst and Annie Kenney became the first women to be arrested in the fight for women's suffrage."]}, {"page": "Daily Herald (United Kingdom)", "response": ["Staff writers included W. P. Ryan, Langdon Everard and George Slocombe. The editor of the Women's Page was Margaret Travers-Symons, and Katharine Susannah Prichard wrote for it.https://www.brandl.com.au/loving-words/310, 321 Vance Palmer's poems were used on the front page. G. K. Chesterton was a frequent contributor. His brother Cecil and Hilaire Belloc were occasional contributors. After Seed was removed as editor, Rowland Kenney, the brother of Annie Kenney; C. Sheridan Jones; and finally Charles Lapworth held the position. "]}, {"page": "Vida Goldstein", "response": ["Eagle House near Bath in Somerset had become an important refuge for British suffragettes who had been released from prison. Mary Blathwayt's parents were the hosts and they planted trees there between April 1909 and July 1911 to commemorate the achievements of suffragettes including Adela's mother and sister, Christabel as well as Annie Kenney, Charlotte Despard, Millicent Fawcett and Lady Lytton.", "The trees were known as \"Annie's Arboreatum\" after Annie Kenney. There was also a \"Pankhurst Pond\" within the grounds."]}, {"page": "Adela Pankhurst", "response": ["Eagle House near Bath in Somerset had become an important refuge for suffragettes who had been released from prison. Mary Blathwayt's parents planted trees there between April 1909 and July 1911 to commemorate the achievements of suffragettes including Adela's mother and sister, Christabel as well as Annie Kenney, Charlotte Despard, Millicent Fawcett and Lady Lytton.", "The trees were known as \"Annie's Arboreatum\" after Annie Kenney. There was also a \"Pankhurst Pond\" within the grounds."]}, {"page": "List of suffragists and suffragettes", "response": ["* Annie Kenney (1879–1953) – leading figure in the WSPU"]}, {"page": "Lees, Greater Manchester", "response": ["Notable people associated with Lees include Springhead-born Annie Kenney, one of the first suffragettes to be imprisoned worked at Lees's Leesbrook Mill. Annie's younger, Lees-born sister Jessie Kenney was also a campaigner for women's suffrage in the United Kingdom. By the age of 21 Jessie was the Women's Social and Political Union's youngest organiser. Laurence Chaderton, one of the original translators of the Authorized King James Version of the Bible was a native of Lees. Disgraced former MP Phil Woolas lives in the locality."]}, {"page": "Rachel Barrett", "response": ["Barrett spent 1908 first organising a campaign in Nottingham and then working on the by-elections in both Dewsbury and Dundee where Barrett supported Scottish suffragette campaigners Helen Fraser and Elsa Gye and Mary Gawthorpe. In June of that year she was the chairman of one of the platforms at the Hyde Park rally, but the work took its toll on her health and shortly afterwards she was forced to temporarily step down from her position to recuperate, which included a period of time at a sanatorium. After recovering she moved closer to home, volunteering for Annie Kenney in Bristol. She soon agreed to resume her role as a paid organiser for he WSPU and was sent to Newport in south-east Wales to continue her duties. In 1910 Barrett was chosen to lead a group of women to talk to the Chancellor of the Exchequer, David Lloyd George, regarding the Liberal Party's role in supporting the first Conciliation Bill. The meeting lasted two and a half hours, and by its end she was convinced that Lloyd George had been insincere over his support for equal voting rights and believed him to be against women's suffrage. By the end of the year her post was changed to organising all WSPU activities in Wales and she was relocated to the country's headquarters in Cardiff. According to Ryland Wallace, writing in 2009, \"No individual worked harder than Rachel Barrett to promote the campaign in Wales.\""]}, {"page": "Mud March (suffragists)", "response": ["Although the WSPU was not officially represented, many of its members attended, including Christabel Pankhurst, Emmeline Pethick-Lawrence, Annie Kenney, Anne Cobden-Sanderson, Nellie Martel, Edith How-Martyn, Flora Drummond, Charlotte Despard and Gertrude Ansell. According to the historian Diane Atkinson, \"belonging to both organisations, going to each others' events and wearing both badges was quite usual\"."]}, {"page": "Marion Wallace Dunlop", "response": ["File:Blathwayt, Col Linley · Suffragettes Annie and Kitty Kenney, Florence Haig, Mary Blathwayt and Marion Wallace-Dunlop.jpg|Annie Kenney, Kitty Kenney, Florence Haig, Mary Blathwayt and Marion Wallace-Dunlop at \"Suffragette's Rest\""]}, {"page": "1953 in the United Kingdom", "response": ["* 9 July – Annie Kenney, suffragette (born 1879)"]}, {"page": "1905 in the United Kingdom", "response": ["* 13 October – Annie Kenney and Christabel Pankhurst interrupt a Liberal Party rally at the Free Trade Hall in Manchester and choose imprisonment when convicted, the first militant action of the suffragette campaign."]}, {"page": "Teresa Billington-Greig", "response": ["In 1904, she was appointed by the Women's Social and Political Union (WSPU) as a travelling speaker. She went to London, together with Annie Kenney, whom she had inspired with her \"sledgehammer of logic and cold reason\" as a speaker, to work on increasing support for the movement. In 1905, Keir Hardie asked to her become the second full-time organiser for the WSPU's activities with the Labour Party. Billington organised publicity and demonstrations, including on 25 April 1906, unveiling a 'Votes for Women' banner from the Ladies Gallery during the debate in the House of Commons to jeers and shouts. In June 1906, Billington was arrested in a fracas outside of the Chancellor of the Exchequer H. H. Asquith's home and accused of striking and kicking a police officer who arrested her. Billington claimed that the police officer had grabbed her aggressively, causing her bruises, and an inflammation to her throat. She refused to recognise the authority of the magistrates' court as women had played no part in defining the laws that it operated by. She was sentenced to a fine of £10 or two months in prison, and refused to pay the fine or have it paid for her. She became the first suffragette to be incarcerated in Holloway Prison. However, against her wishes, she was released within days after her fine was paid anonymously. Later that month, she travelled to organise the WSPU in Scotland, when her oratory impressed and influenced Janie Allan. She met Frederick Lewis Greig (1875/76–1961) in Scotland, and married him on 8 February 1907, in Glasgow. They agreed to adopt a common surname of Billington-Greig and to be equals in the marriage.  Before that she had helped WSPU canvassing against the Liberal Party candidate in the 1906 Huddersfield by-election with Emmeline Pankhurst and Annie Kenney, impressing local activist Hannah Mitchell. However, she became unhappy that her suggestions for the direction of the organisation were being dismissed, and disputes with the Pankhursts preceded her parting ways with the WSPU. Billington-Greig's surviving notes writings from 1906 to 1907 demonstrate her views being refined, with her theory coming to encompass a demand for full equality between the sexes, and a rejection of poor tactics to achieve positive outcomes."]}, {"page": "Victoria Rooms, Bristol", "response": ["In the early twentieth century, Annie Kenney and Clara Codd, local organisers of the Women's Social and Political Union (the suffragettes), used the Victoria Rooms to host \"at homes\", to which all were invited. In 1920, the rooms were purchased from the original private company by wealthy local industrialist Sir George Wills and given to the University to house the students' union. It appears that the University briefly leased the building for use as the Clifton Cinema which was situated there in March 1924, when local photographer Reece Winstone took a photograph.  All seats were priced at 1/3d. The Victoria Rooms remained the base for the student union until 1964 when a purpose-built facility was constructed in nearby Queen's Road. The building then became a conference and exhibition centre, hosting occasional concerts such as those by Pink Floyd in 1967 and 1969.  In 1987 the building housed the first incarnation of the Exploratory founded by Richard Gregory – a hands-on science centre and precursor of At-Bristol – until 1989. The University Music Department was moved into the Victoria Rooms in 1996."]}, {"page": "Georgia Brown (English singer)", "response": ["Shoulder to Shoulder was first broadcast in six parts in 1974. Brown (and others) sang the theme song for the series, \"The March of the Women\", and she took the role of working class activist Annie Kenney, alongside Siân Phillips and Angela Down, as Emmeline and Sylvia Pankhurst, respectively.", "The episode dealing most closely with Annie Kenney was written by Alan Plater, who had written the 1972 drama about Marie Lloyd (played by Brown) and her involvement in the 1907 music hall artistes' strike, in The Edwardians. Shoulder to Shoulder remains highly regarded as an attempt to convey an important episode both of feminist history and of Britain's history of dissent and civil disobedience."]}, {"page": "Springhead, Greater Manchester", "response": ["*Annie Kenney (1879–1953), English working-class suffragette"]}, {"page": "Women's suffrage in the United Kingdom", "response": ["To commemorate the 100th anniversary of Women being given the right to vote, a statue of Millicent Fawcett was erected in Parliament Square, London in 2018. The photo colouriser Tom Marshall released a series of photos to mark the 100th anniversary of the vote, including an image of suffragettes Annie Kenney and Christabel Pankhurst, which appeared on The Daily Telegraph front page on 6 February 2018."]}, {"page": "List of people from Oldham", "response": ["* Annie Kenney – one of the first suffragettes to be imprisoned for protesting for women's suffrage"]}, {"page": "History of Oldham", "response": ["It has been put that the people of Oldham became radical in politics in the early part the 19th century, and movements suspected of sedition found patronage in the town. Oldham was frequently disturbed by bread and labour riots, facilitated by periods of scarcity and the disturbance of employment following the introduction of cotton-spinning machinery. On 20 April 1812, a \"large crowd of riotous individuals\" compelled local retailers to sell foods at a loss, whilst on the same day Luddites numbering in their thousands, many of whom were from Oldham, attacked a cotton mill in nearby Middleton. John Lees, a cotton operative, was one of the victims of the Peterloo Massacre of 1819, and the 'Oldham inquest' which followed was anxiously watched; the Court of King's Bench, however, decided that the proceedings were irregular, and the jury were discharged without giving a verdict. Annie Kenney, born in nearby Springhead, and who worked in Oldham's cotton mills, was a notable of the Suffragette movement credited with sparking off suffragette militancy when she heckled Winston Churchill, and later (with Emmeline Pankhurst) the first Suffragist to be imprisoned. Oldham Women's Suffrage Society was established in 1910 with Margery Lees as president and quickly joined the Manchester and District Federation of the National Union of Women's Suffrage Societies. The Chartist and Co-operative movements had strong support in the town, whilst many Oldhamers protested against the emancipation of slaves. The Riot Act was read in 1852 on election day following a mass public brawl over the Reform Act, and irregularities with parliamentary candidate nominations."]}, {"page": "Leonora Cohen", "response": ["In 1913 suffragettes Annie Kenney and Flora Drummond arranged for WSPU representatives to speak with leading politicians David Lloyd George and Sir Edward Grey. The delegates explained the pay and working conditions that they suffered and their hope that a vote would enable women to challenge the status quo in a democratic manner. Cohen explained that voting women would have power to demand higher wages as men had done, which would stop underpaid girls from drifting onto the streets.  "]}, {"page": "Flora Drummond", "response": ["Flora Drummond joined the WSPU in 1906. Following a Liberal Party election meeting at the Free Trade Hall in Manchester Christabel Pankhurst and Annie Kenney were imprisoned for pressing the candidate, Winston Churchill, to answer the question 'If you are elected, will you do your best to make Women's Suffrage a government measure?'. When the two women were released the WSPU held a celebratory rally in Manchester which Flora, who had witnessed their arrests, attended and was persuaded to join the movement. Shortly afterwards Flora moved to London and by the end of 1906 had served her first term in Holloway after being arrested inside the House of Commons. Flora was known for her daring and headline-grabbing stunts, including in 1906 slipping inside the open door of 10 Downing Street whilst her companion Irene Miller was being arrested for knocking on the door. In 1908 Drummond and Helen Craggs were campaigning successfully against Churchill again. That year, Flora also became a paid organiser at the WSPU headquarters and hired a boat so that she could approach the Palace of Westminster from the River Thames to harangue the members of parliament sitting on the riverside terrace.", "In 1913 Drummond and Annie Kenney arranged for WSPU representatives to speak with leading politicians David Lloyd George and Sir Edward Grey. The meeting had been with the proviso that these were working-class women representing their class. They explained the pay and working conditions that they suffered and their hope that a vote would enable women to challenge the status quo in a democratic manner. Alice Hawkins from Leicester explained how her fellow male workers could choose a man to represent them whilst the women were left unrepresented."]}, {"page": "Lady Constance Bulwer-Lytton", "response": ["She subsequently met other suffragettes, including Annie Kenney and Pethick-Lawrence, at the Green Lady Hostel and on a tour of Holloway prison. On 14 October 1908, she wrote to her mother:"]}, {"page": "Suffragette", "response": ["At a political meeting in Manchester in 1905, Christabel Pankhurst and millworker, Annie Kenney, disrupted speeches by prominent Liberals Winston Churchill and Sir Edward Grey, asking where Churchill and Grey stood with regards to women's political rights. At a time when political meetings were only attended by men and speakers were expected to be given the courtesy of expounding their views without interruption, the audience were outraged, and when the women unfurled a \"Votes for Women\" banner they were both arrested for a technical assault on a policeman. When Pankhurst and Kenney appeared in court they both refused to pay the fine imposed, preferring to go to prison to gain publicity for their cause.", "* Annie Kenney"]}, {"page": "Hannah Mitchell", "response": ["Mitchell then joined, and worked as a part-time organiser for, Emmeline and Christabel Pankhurst's Women's Social and Political Union (WSPU).Purvis Although initially unsure about the 'property qualification' proposals expected to be acceptable, Mitchell wanted a truer equality for all male and female voters. But hearing Annie Kenney's talk at Stalybridge Market she noted that despite appearing charmed by the speaker, the majority would support getting votes for all men (Manhood Suffrage) and make the women wait even longer to be enfranchised.  Mitchell also toured the country including the working class villages in Colne Valley making speeches, herself, and 'had no difficulty' including 'dealing with hecklers'  as she campaigned for women's suffrage at by-elections.Crawford, p. 417 ", "In 1905, Mitchell joined Emmeline Pankhurst, Annie Kenney, Keir Hardie, Theresa Billington and Mrs Elmy at the prison gates when Christabel Pankhurst was released after a week of imprisonment for the first assault in the cause, spitting at a policeman. She was again with the 150 women who tried in October 1905, to enter the House of Commons , and only 20 were allowed in, including Mitchell.  With Louie CulIen, Mitchell had hidden a 'Votes for Women\" banner in her clothes. Mary Gawthorpe stood on a chair to make a speech after their leaders told them that Prime Minister Henry Campbell-Bannerman was not presenting a women's suffrage Bill, and was pulled down by police, the two banners were raised up but police tore them down into 'shreds'.  She was shocked to see the rough treatment of Mrs Pankhurst and that the Members of Parliament quickly came to watch \"most of them guffawing loudly'.  Mitchell was then campaigning in Huddersfield by-election where 'Yorkshire women heard the call and followed us in hundreds'. Mitchell also was involved with the Liverpool branch started up by Alice Morrissey. In 1907 Mitchell suffered a nervous breakdown which her doctor put down to overwork and malnourishment.Crawford, p. 417 While she was recovering, Charlotte Despard visited her and gave her money for food.Crawford, p. 417 In her autobiography she mentioned the hurt that she felt when none of the Pankhursts contacted her during her recovery.Purvis In 1908 she left the WSPU, and joined Despard's new Women's Freedom League.Purvis"]}, {"page": "Letchworth", "response": ["* Annie Kenney – suffragette, lived in Letchworth for some years before her death in 1953"]}]}}