{"wiki_id": "http://www.wikidata.org/entity/Q3617264", "itemLabel": "Domenico Angelo", "itemDescription": "Italian fencer", "wikipedia_url": "https://en.wikipedia.org/wiki/Domenico_Angelo", "wikipedia_page": {"main": "Domenico Angelo (1717 Leghorn, Italy – 1802, Twickenham, England), was an Italian sword and fencing master, also known as Angelo Domenico Malevolti Tremamondo. The son of a merchant, he was the founder of the Angelo Family of fencers. He has been praised as \"the first to emphasize fencing as a means of developing health, poise, and grace. As a result of his insight and influence, fencing changed from an art of war to a sport.\"", "link_mentions": [{"page": "Fencing", "response": ["The shift towards fencing as a sport rather than as military training happened from the mid-18th century, and was led by Domenico Angelo, who established a fencing academy, Angelo's School of Arms, in Carlisle House, Soho, London in 1763.F.H.W. Sheppard, ed. Survey of London volume 33 The Parish of St. Anne, Soho (north of Shaftesbury Avenue), London County Council, London: University of London, 1966, pp. 143–48, online at British History Online. There, he taught the aristocracy the fashionable art of swordsmanship. His school was run by three generations of his family and dominated the art of European fencing for almost a century."]}, {"page": "Richard Brinsley Sheridan", "response": ["He was a pupil at Harrow School from 1762 to 1768. At the end of his 1768 school year, his father employed a private tutor, Lewis Ker, to direct his studies in his father's house in London, while Domenico Angelo instructed him in fencing and horsemanship."]}, {"page": "Small sword", "response": ["It is thought to have appeared in France and spread quickly across the rest of Europe. The small sword was the immediate predecessor of the French duelling sword (from which the épée developed) and its method of use—as typified in the works of such authors as Sieur de Liancour, Domenico Angelo, Monsieur J. Olivier, and Monsieur L'Abbat—developed into the techniques of the French classical school of fencing. The small sword could be a highly effective duelling weapon."]}, {"page": "Livorno", "response": ["* Domenico Angelo (1716–1802), fencing master, author"]}, {"page": "Benjamin West", "response": ["Drummond tried to raise subscriptions to fund an annuity for West, so that he could give up portraiture and devote himself entirely to more ambitious compositions. Having failed in this, he tried—with greater success—to convince King George III to patronise West.Galt, vol. 2, p. 20  West was soon on good terms with the king, and the two men conducted long discussions on the state of art in England, including the idea of the establishment of a Royal Academy.Galt, vol. 2, pp. 33–34 The academy came into being in 1768, with West one of the primary leaders of an opposition group formed out of the existing Society of Artists of Great Britain; Joshua Reynolds was its first president. In the same year, he was elected to membership in the American Philosophical Society.Bell, Whitfield J., and Charles Greifenstein, Jr. Patriot-Improvers: Biographical Sketches of Members of the American Philosophical Society. 3 vols. Philadelphia: American Philosophical Society, 1997, 2:193–200. In a story related by Henry Angelo I (1756–1835) in his book of reminiscences, the actor David Garrick, who was a friend of Angelo's father, the Italian sword master Domenico Angelo, memorably sketched for the teenaged Henry the following exchange: one day the painter Francesco Zuccarelli, on one of his visits to Domenico, got into a dispute with his fellow royal academician Johan Zoffany about the merit of West's 1769 painting The Departure of Regulus, his first commission for the king.  Zuccarelli exclaimed, \"Here is a painter who promises to rival Nicolas Poussin\", while Zoffany tauntingly replied, \"A figo for Poussin, West has already beaten him out of the field.\"Angelo (1828), pp. 360–61."]}, {"page": "Swordsmanship", "response": ["The shift towards fencing as a sport rather than as military training happened from the mid-18th century, and was led by Domenico Angelo, who established a fencing academy, Angelo's School of Arms, in Carlisle House, Soho, London in 1763.F.H.W. Sheppard, ed. Survey of London volume 33 The Parish of St. Anne, Soho (north of Shaftesbury Avenue), London County Council, London: University of London, 1966, pp. 143–48, online at British History Online. There, he taught the aristocracy the fashionable art of swordsmanship which they had previously had to go the continent to learn, and also set up a riding school in the former rear garden of the house. He was fencing instructor to the Royal Family. With the help of artist Gwyn Delin, he had an instruction book published in England in 1763 which had 25 engraved plates demonstrating classic positions from the old schools of fencing. His school was run by three generations of his family and dominated the art of European fencing for almost a century.", "He established the essential rules of posture and footwork that still govern modern sport fencing, although his attacking and parrying methods were still much different from current practice. Although he intended to prepare his students for real combat, he was the first fencing master yet to emphasize the health and sporting benefits of fencing more than its use as a killing art, particularly in his influential book 'L'École des armes (The School of Fencing), published in 1763. According to the Encyclopædia Britannica, \"Angelo was the first to emphasize fencing as a means of developing health, poise, and grace. As a result of his insight and influence, fencing changed from an art of war to a sport.\"Domenico Angelo at Encyclopædia Britannica.com."]}, {"page": "Historical European martial arts", "response": ["By the year 1715, the rapier had been largely replaced by the lighter small sword throughout most of Europe, although treatments of the former continued to be included by authors such as Donald McBane (1728), P. J. F. Girard (1736) and Domenico Angelo (1763).", "Hutton learned fencing at the school founded by Domenico Angelo. In 1862, he organized in his regiment stationed in India the Cameron Fencing Club, for which he prepared his first work, a 12-page booklet entitled Swordsmanship."]}, {"page": "Classification of swords", "response": [" and its method of use—as typified in the works of such authors as Sieur de Liancour, Domenico Angelo, Monsieur J. Olivier, and Monsieur L'Abbat—developed into the techniques of the French classical school of fencing. Small swords were also used as status symbols and fashion accessories; for most of the 18th century anyone, civilian or military, with pretensions to gentlemanly status would have worn a small sword on a daily basis."]}, {"page": "Chevalier de Saint-Georges", "response": ["In London, Saint-Georges stayed with fencing masters Domenico Angelo and Henry, his son, whom he knew as an apprentice from early years in Paris. They arranged exhibition matches for him, including one at Carlton House, before the Prince of Wales. After sparring with him, carte and tierce, the prince matched Saint-Georges with several renowned masters. One included La Chevalière D'Éon, aged 59, in a voluminous black dress. A painting by Abbé Alexandre-Auguste Robineau, violinist-composer and painter, showed the Prince and his entourage watching \"Mlle\" D'Éon score a hit on Saint-Georges, giving rise to rumors that the Frenchman allowed it out of gallantry for a lady.The Morning Herald, April 11, 1787. But, as Saint-Georges had fenced with dragoon Captain d'Éon in Paris, he probably was deferring to his age. Saint-Georges played one of his concertos at the Anacreontic Society.The Morning Herald, April 6, 1787. He also delivered Brissot's request to the abolitionists MPs William Wilberforce, John Wilkes, and the Reverend Thomas Clarkson. Before Saint-Georges left England, Mather Brown painted his portrait. Asked by Mrs Angelo if it was a true likeness, Saint-Georges replied: \"Alas, Madame it is frightfully so.\""]}, {"page": "List of fencers", "response": ["* Domenico Angelo"]}, {"page": "Angelo", "response": ["*Domenico Angelo (1717–1802), British fencing master and founder of the Angelo Family", "*Henry Angelo (1756–1835), British fencing master and memoirist. Son of Domenico Angelo"]}, {"page": "French school of fencing", "response": ["By the 18th century, the French school had become the western European standard to the extent, that Domenico Angelo, an Italian-born master teaching in England,  published his L'école des Armes in French in 1763. It was extremely successful and became a standard fencing manual over the following 50 years, throughout the Napoleonic period. Angelo's text was so influential that it was chosen to be included under the heading of \"Éscrime\" in Diderot's Encyclopédie.", "*Domenico Angelo,  The School of Fencing: With a General Explanation of the Principal Attitudes and Positions Peculiar to the Art, eds. Jared Kirby and Jak P. Mallmann Showell, Greenhill Books (2005), ."]}, {"page": "Julius Soubise", "response": ["Trained by Domenico Angelo (whom Soubise also regularly accompanied as usher to Eton and Windsor), Soubise became the riding and fencing master to the Duchess. He became a popular acquaintance among young noblemen and rose as a figure in upper-class social circles, becoming the member of many fashionable clubs such as the Thatched House Club. The personal favour and patronage of the Duchess allowed Soubise a lifestyle of socializing and fashion. He would sometimes style himself  as \"Prince Ana-Ana-maboe\"Vincent Carretta and Philip Gould (2001), Genius in Bondage: Literature of the Early Black Atlantic; University Press of Kentucky, p. 209.  or \"The Black Prince\", and claiming to be African royalty. It was rumoured that his relationship with the Duchess developed into a sexual one.Laura J. Rosenthal, Infamous Commerce: Prostitution in Eighteenth-Century British Literature and Culture, Cornell University Press, 2006, p. 161. .", "Soubise received instruction in the privileged accomplishments of riding and fencing, taught by fencing master Domenico Angelo per Duchess Douglas’ connections. He was also known as an amateur violinist, singer and actor – he was taught oration by the famous actor David Garrick."]}, {"page": "Alfred Hutton", "response": ["Hutton started to learn fencing at the age of twelve at the fencing school in St James' Street from Henry Charles Angelo the Younger (1780-1852), appointed Superintendent of Sword Exercise in the Army (1833-1852), author of Infantry Sword Exercise (1845), which remained the standard Army reference book for sword instruction on foot for 50 years. This school was established by  Domenico Angelo Malevolti Tremamondo (1716-1802), renowned Italian fencing master from Leghorn, author of the classic treatise on small sword L’École des armes (1763, The School of Fencing). Alfred's father was a pupil of Henry Angelo the elder (1756-1835), son of the founder of this fencing dynasty, Domenico Angelo.Angelo, Henry. Infantry Sword Exercise,1845"]}, {"page": "History of fencing", "response": ["The shift towards fencing as a sport rather than as military training happened from the mid-18th century, and was led by Domenico Angelo, who established a fencing academy, Angelo's School of Arms, in Carlisle House, Soho, London in 1763.F.H.W. Sheppard, ed. Survey of London volume 33 The Parish of St. Anne, Soho (north of Shaftesbury Avenue), London County Council, London: University of London, 1966, pp. 143–48, online at British History Online. There, he taught the aristocracy the fashionable art of swordsmanship which they had previously had to go the continent to learn, and also set up a riding school in the former rear garden of the house. He was fencing instructor to the Royal Family. With the help of artist Gwyn Delin, he had an instruction book published in England in 1763 which had 25 engraved plates demonstrating classic positions from the old schools of fencing. His school was run by three generations of his family and dominated the art of European fencing for almost a century.", "He established the essential rules of posture and footwork that still govern modern sport fencing, although his attacking and parrying methods were still much different from current practice. Although he intended to prepare his students for real combat, he was the first fencing master yet to emphasize the health and sporting benefits of fencing more than its use as a killing art, particularly in his influential book L’École des armes (The School of Fencing), published in 1763. According to the Encyclopædia Britannica, \"Angelo was the first to emphasize fencing as a means of developing health, poise, and grace. As a result of his insight and influence, fencing changed from an art of war to a sport.\"Domenico Angelo at Encyclopædia Britannica.com."]}, {"page": "Joseph Drury", "response": ["His brother Mark Drury was Second Master at Harrow. He married Catherine Angelo, daughter of the fencing master at Eton, Domenico Angelo, and sister of the celebrated Eton Dame, Florella Angelo."]}, {"page": "Historical fencing in Scotland", "response": ["* Henry Angelo (c.1760–1839) – Son of Italian fencing master Domenico Angelo, Henry and his son (also Henry) were Broadsword masters to the Light Horse Volunteers of London and Westminster at the time he wrote his treatise in 1799, which they dedicate to Colonel Herries."]}, {"page": "Carlisle House, Soho", "response": ["In June 1756 the house was bought by John Delaval, later first Baron Delaval, and in March 1764, through a proxy, by Domenico Angelo, the Italian fencing and riding master. He built a riding school in the rear, took in pupils as boarders at 100 guineas (£105) a head, and made the house into London's pre-eminent school of arms and manners.  However, he apparently left the house in the early 1780s and after that it was divided between numerous tenants, mostly in the arts, including a wood carver, an art restorer and several prominent painters. A Masonic lodge met in the ballroom. Charles Dickens is thought to have used the house as his model for the lodgings of Dr. Manette and his daughter Lucie in A Tale of Two Cities.Field, p. 122.Tim Minogue with Robin Stummer, \"Soho, farewell then?...\" , Cornerstone, The Society for the Protection of Ancient Buildings, 2009."]}, {"page": "Jared Kirby (fencing)", "response": ["Kirby is the editor and one of the translators of \"Italian Rapier Combat\", the first complete, professional translation of Ridolfo Capo Ferro. He is also the editor and wrote the introduction for \"The School of Fencing\" by Domenico Angelo and annotated by Maestro Jeannette Acosta-Martínez.  His third book \"A Gentleman's Guide to Duelling\" is a republication of Vincentio Saviolo's 2nd book \"Of Honor and Honourable Quarrels\" updated to modern British English.  It also includes the most comprehensive biography of Saviolo written to date. In 2017 Kirby published a reprint of Donald McBane's The Expert Swordsman’s Companion with an amazing introduction by Ben Miller. "]}, {"page": "Henry Charles Angelo the Younger", "response": ["Henry was born in 1780Paths of Glory, The Friends of Kensal Green Cemetery, London, 1997, p. 10. to Henry Angelo (1756-1835). He was the grandson of Domenico Angelo Malevolti Tremamondo (1716 or 1717 to 1802), the founder of the dynasty."]}, {"page": "Masters of Defence", "response": ["Fencing Masters known to history were Captain Caizo (circa sometime a little prior to July 1547), teacher of Le Sieur de Jarnac (who famously fought Lord Chastaigneraie in a duel); the 16th century Italian masters Agrippa, (Rocco Bonetti c.1570), Capo ferro, Di Grassi, Fabris, Giganti, Marozzo, and Viggiani; Jean Baptiste le Perche du Coudray (c.1603, French); Wilhelm Kreussler father of the Kreussler dynasty, Wernesson de Liancour (c.1686); Sir William Hope (1660-1729); Henry Blackwell; James Figg (champion of the Corporation of Masters of Defence); Heinrich Wilhelm Kreussler a member of Germany's most important master fencing dynasties and teacher of Anthon Friedrich Kahn (18th century); Domenico Angelo; La Boiëssière père and Joseph Boulogne, joint inventors of the fencing mask (c.18th century); Sainct Didier, the supposed father of modern fencing; and General Franz Siegel, the master of the first fencing school in the USA at the New York turnverein (circa.1851).David Glasser - Article entitled Fencing Masters published by Northern Arizona University also source:explicitly for personal use only [Retrieved 2015-07-28]The National Fencing Museum of Britain - The fencing museum:16-18_century [Retrieved 2015-07-24]"]}]}}