{"wiki_id": "http://www.wikidata.org/entity/Q362228", "itemLabel": "Sean Biggerstaff", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Sean_Biggerstaff", "wikipedia_page": {"main": "Sean Biggerstaff (born 15 March 1983) is a Scottish actor. He is best known internationally for playing Oliver Wood in the Harry Potter film series, appearing in Philosopher's Stone (2001), Chamber of Secrets (2002), and Deathly Hallows – Part 2 (2011).\nBiggerstaff started acting as a child actor at the age of five and made his screen debut in the television miniseries The Crow Road (1996). He won a BAFTA Scotland Award for playing Jeremy Wolfenden in the television film Consenting Adults (2007). He also appeared in the feature films Cashback (2006) and Mary Queen of Scots (2013).\n\n", "link_mentions": [{"page": "March 15", "response": ["*1983 – Sean Biggerstaff, Scottish actor"]}, {"page": "2001 in film", "response": ["| Harry Potter and the Sorcerer's Stone || Warner Bros. Pictures / Heyday Films || Chris Columbus (director); Steve Kloves (screenplay); Daniel Radcliffe, Rupert Grint, Emma Watson, John Cleese, Robbie Coltrane, Warwick Davis, Richard Griffiths, Richard Harris, Ian Hart, John Hurt, Alan Rickman, Fiona Shaw, Maggie Smith, Julie Walters, David Bradley, Tom Felton, Bonnie Wright, Devon Murray, Zoë Wanamaker, Adrian Rawlins, Geraldine Somerville, Harry Melling, Chris Rankin, James Phelps, Oliver Phelps, Matthew Lewis, Alfred Enoch, Sean Biggerstaff, Ray Fearon, Julianne Hough || Fantasy || Live action"]}, {"page": "2002 in film", "response": ["| Harry Potter and the Chamber of Secrets || Warner Bros. Pictures / Heyday Films || Chris Columbus (director); Steve Kloves (screenplay); Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Harris, Maggie Smith, Robbie Coltrane, John Cleese, Tom Felton, Kenneth Branagh, Alan Rickman, Jason Isaacs, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Willams, Warwick Davis, Christian Coulson, David Bradley, Bonnie Wright, Devon Murray, Adrian Rawlins, Geraldine Somerville, Shirley Henderson, Harry Melling, Toby Jones, James Phelps, Oliver Phelps, Chris Rankin, Matthew Lewis, Miriam Margoyles, Hugh Mitchell, Alfred Enoch, Sean Biggerstaff, Gemma Jones, Robert Hardy, Julian Glover || Fantasy || Live Action"]}, {"page": "1983 in American television", "response": ["|Sean Biggerstaff"]}, {"page": "1983 in film", "response": ["*March 15 - Sean Biggerstaff, Scottish actor"]}, {"page": "Maryhill", "response": ["* Sean Biggerstaff, actor"]}, {"page": "Harry Potter and the Philosopher's Stone (film)", "response": ["Additionally, Zoë Wanamaker appears as Madame Hooch, Hogwarts' flying instructor; Tom Felton portrays Draco Malfoy, a student in Slytherin and Harry's rival; before being cast as Draco, Felton auditioned for the roles of Harry and Ron. Harry Melling plays Dudley Dursley, Harry's cousin; and David Bradley appears as Argus Filch, Hogwarts' caretaker. Matthew Lewis, Devon Murray and Alfred Enoch portray Neville Longbottom, Seamus Finnigan and Dean Thomas respectively, three first year students in Gryffindor; James and Oliver Phelps play twins Fred and George Weasley, Ron's brothers, while Chris Rankin appears as his other brother Percy, a Gryffindor prefect, and Bonnie Wright appears as Ron's sister Ginny. Sean Biggerstaff portrays Oliver Wood, the Keeper of the Gryffindor Quidditch team; Jamie Waylett and Joshua Herdman play Crabbe and Goyle, Malfoy's minions; and Leslie Phillips voices the Sorting Hat. Derek Deadman plays Tom, innkeeper of The Leaky Cauldron; and Elizabeth Spriggs appears as the Fat Lady, a painting at Hogwarts."]}, {"page": "Harry Potter and the Chamber of Secrets (film)", "response": ["Several actors from Philosopher's Stone reprise their roles in this film. Harry Melling portrays Dudley Dursley, Harry's cousin. James and Oliver Phelps play Fred and George Weasley, Ron's twin brothers; Chris Rankin appears as Percy Weasley, Ron's other brother and a Gryffindor prefect; and Bonnie Wright portrays their sister Ginny. Tom Felton plays Draco Malfoy, Harry's rival in Slytherin, while Jamie Waylett and Joshua Herdman appear as Crabbe and Goyle, Draco's minions. Matthew Lewis, Devon Murray and Alfred Enoch play Neville Longbottom, Seamus Finnigan and Dean Thomas, respectively, three Gryffindor students in Harry's year. David Bradley portrays Argus Filch, Hogwarts' caretaker, and Sean Biggerstaff as Oliver Wood, the Keeper of the Gryffindor Quidditch team. Leslie Phillips voices the Sorting Hat."]}, {"page": "List of Harry Potter cast members", "response": ["| colspan=\"2\" | Sean Biggerstaff", "| Sean Biggerstaff"]}, {"page": "Jeremy Wolfenden", "response": ["A short biography of Wolfenden appears in the book The Fatal Englishman by Sebastian Faulks.Jane Gardam, The fragile Englishmen, The Guardian, 4 February 2006. Julian Mitchell's play Consenting Adults (2007), screened by BBC Four, is based on the relationship of father and son, played by Charles Dance and Sean Biggerstaff respectively.Philip French \"We saw the light, but too late for some\", The Observer, 24 June 2007 Biggerstaff won a BAFTA Scotland award for Best Television Actor for his performance."]}, {"page": "Sluts of Trust", "response": ["Sluts of Trust were formed in the summer of 2002 by John McFarlane and Anthony O'Donnell,\"Proud to be so loud; Scots duo A hit at the hut\", Evening Times, 15 April 2005, p. 15 after a wild three-day party, which became known as the Pirate Weekend. McFarlane and O'Donnell had first met as teenagers at Scottish Youth Theatre's Summer Festival in 1995.Shepherd, Fiona (2004) \"Leer Pressure Pays Off\", The Scotsman, 16 April 2004, p. 19 In the intervening years, both had begun aborted courses at Glasgow University and Cardonald College respectively, and had enjoyed limited success with separate musical projects. O'Donnell in Crambo, and in a band with fellow SYT graduate and future Harry Potter actor Sean Biggerstaff, and McFarlane had released a solo recording entitled \"Broken Alarm Clock\" on the Glasgow Queen Margaret Union NorthPark label compilation Unplugged, which he also performed on the BBC television programme The Beat Room. Having recently disbanded his latest group Tungsten Crust, McFarlane had been writing songs for a change of direction. He invited O'Donnell to drum with him and very quickly they blended to create a dynamic new sound. The band had originally been envisaged as a trio, but stayed as a guitar/drums duo after their prospective bass player failed to turn up to their first rehearsal.", "Sluts of Trust released their debut single \"Piece O' You\" on 21 November 2003, on limited edition 7-inch red vinyl. Llimited to 1000 pressings, the single sold out in a week. The b-side featured live favourite \"Meanwhile In Rocksville\". The single was championed by BBC Radio 1 DJ John Peel and would feature at #16 in the end of year chart the Festive Fifty, voted for by listeners to his show.\"Festive 50, 2003\", BBC, retrieved 2010-07-03 The Evening Times called the single \"an intense, uncompromising, blistering, screaming, passionate, furious sweat-drenched full-frontal aural assault\". A low-budget video was made to accompany the release and was conceived and directed by actor Johnny Austin and filmmaker Gregor Mackay, both friends of the band from Scottish Youth Theatre. A pastiche of Brian De Palma's Carrie, it conveyed much of the theatre of early Sluts of Trust gigs, and alongside other members of the Scottish Youth Theatre it starred Sean Biggerstaff and Paul Kelly of The Martial Arts. The video was premiered at the launch of the single in Glasgow's Barfly, and projected onto McFarlane's own bed-sheet before the band played that night. The video was later screened on MTV2."]}, {"page": "List of people from Glasgow", "response": ["*Sean Biggerstaff – actor (Harry Potter)"]}, {"page": "The Winter Guest", "response": ["Set in Scotland on one wintry day, the film focuses on eight  people; a mother and daughter, Elspeth (Phyllida Law) and Frances (Emma Thompson); two young boys skipping school, Sam (Douglas Murphy) and Tom (Sean Biggerstaff); two old women who frequently attend strangers' funerals, Chloe (Sandra Voe) and Lily (Sheila Reid); and two teenagers Nita (Arlene Cockburn) and Alex (Gary Hollywood). The film consists primarily of the interactions between the characters."]}, {"page": "MuggleNet", "response": ["On September 1, 2017, MuggleNet hosted MuggleNet Live! 2017: Nineteen Years Later at the Wizarding World of Harry Potter at Universal Studios Florida to celebrate the date on which Harry Potter would have sent his son Albus Severus to Hogwarts for the first time, according to the epilogue of Harry Potter and the Deathly Hallows. The event began with panels of actors from the Potter films. Special guests included Chris Rankin (Percy Weasley), Christian Coulson (Tom Marvolo Riddle), Luke Youngblood (Lee Jordan), Sean Biggerstaff (Oliver Wood), Ellie Darcey-Alden (young Lily Evans), Rohan Gotobed (young Sirius Black), and Ryan Turner (Hugo Weasley)."]}, {"page": "Charles II: The Power and the Passion", "response": ["*Sean Biggerstaff ... Henry, Duke of Gloucester"]}, {"page": "The Private Memoirs and Confessions of a Justified Sinner", "response": ["* In the short film Voices, starring Sean Biggerstaff, the central character uses audio extracts of himself reading Hogg's novel to create his final apology."]}, {"page": "Why Didn't They Ask Evans?", "response": ["Sean Biggerstaff as Bobby Attfield"]}, {"page": "List of supporting Harry Potter characters", "response": ["Oliver Wood was portrayed by Sean Biggerstaff in the first two films and once again in the eighth film."]}, {"page": "Cashback (film)", "response": ["Cashback is a 2006 British romantic comedy-drama film written and directed by Sean Ellis. Originally exhibited as a short in 2004, it was expanded to feature length in 2006. Both versions were produced by Lene Bausager, starring Sean Biggerstaff and Emilia Fox.", "* Sean Biggerstaff as Ben Willis"]}, {"page": "1983 in the United Kingdom", "response": ["* 15 March – Sean Biggerstaff, actor"]}, {"page": "Tokuyoshi Kawashima", "response": ["* Harry Potter and the Philosopher's Stone – Oliver Wood (Sean Biggerstaff)", "* Harry Potter and the Chamber of Secrets – Oliver Wood (Sean Biggerstaff)", "* Harry Potter and the Deathly Hallows – Part 2 – Oliver Wood (Sean Biggerstaff)"]}, {"page": "List of comedy films of the 2000s", "response": ["|Cashback||Sean Ellis||Sean Biggerstaff, Emilia Fox, Shaun Evans ||||"]}, {"page": "Hippie Hippie Shake", "response": ["*Sean Biggerstaff"]}, {"page": "List of Scottish actors", "response": ["*Sean Biggerstaff (born 1983)"]}, {"page": "List of British films of 2006", "response": ["|Cashback||Sean Ellis ||Sean Biggerstaff, Emilia Fox ||Drama ||"]}, {"page": "Um Sang-hyun", "response": ["** Sean Biggerstaff as Oliver Wood", "** Sean Biggerstaff as Oliver Wood"]}, {"page": "Consenting Adults (2007 film)", "response": ["*Sean Biggerstaff as Jeremy Wolfenden", "The film was nominated for BAFTA Scotland’s Best Drama Award on 18 November 2007, and Sean Biggerstaff won BAFTA Scotland's Award for Best Actor (Television)."]}, {"page": "The Skull of Sobek", "response": ["*Snabb — Sean Biggerstaff", "* Sean Biggerstaff previously appeared as Chris Parsons in the Big Finish remake of Shada starring Paul McGann and Lalla Ward."]}, {"page": "List of British former child actors", "response": ["*Sean Biggerstaff (born 1983)"]}, {"page": "Cinema of Scotland", "response": ["* Sean Biggerstaff"]}, {"page": "London Film and Comic Con", "response": ["| 28–30 July 2017|| Olympia|| Benedict Cumberbatch, Natalie Dormer, Kevin Smith, Mads Mikkelsen, Pamela Anderson, Nicola Bryant, Sylvester McCoy, Richard Franklin, Matthew Waterhouse, Tom Wilson, Richard Dean Anderson, Wil Wheaton, Terence Stamp, David Labrava, Kenny Johnson, Emily Kinney, Adam Copeland, Alan Tudyk, Alexis Denisof, Alicia Witt, Alistair Petrie, Anthony Forrest, Andy de la Tour, Andrew Gray, Andrew Robinson, Alyson Hannigan, Benedict Wong, Bernard Cribbins, Carol Cleveland, Chris Durand, Christopher Judge, Christopher Lloyd, Christien Anholt, Colin Hunt, Conleth Hill, Daniel Portman, Danielle Tabor, David Bradley, David Labrava, David Morrissey, Dave Prowse, Deep Roy, Dean Cain, Dickey Beer, Emily Kinney, Finn Jones, Gemma Whelan, Ian McDiarmid, James Dodd, James & Oliver Phelps, Jeremy Bulloch, Jessica Henwick, Jimmy Vee, Joe Dinicol, John Carroll Lynch, John Cleese, John Leeson, Julian Glover, Kevin Kleinberg, Kristen Renton, Kristian Nairn, Lalla Ward, Louise Jameson, Mark Austin, Mark Boone Jr, Mark Strickson, Mark Sheppard, Martin Gordon, Michael Copon, Michelle Harrison, Michael Rosenbaum, Michael Madsen, Missi Pyle, Phil LaMarr, Peter Mayhew, Pilou Asbaek, Richard Cunningham, Robbi Morgan, Sacha Dhawan, Sarah Douglas, Selwyn Ward, Sean Biggerstaff, Steven Yeung, Lisa Varon, Tom Morga, Tom Skerritt, Tommy Flanagan, Tricia Helfer, Valene Kane, Veronica Cartwright, Wai Ching Hoo, Warwick Diamond, William Regal, Zoe Wanamaker, Marv Wolfman", "| 26–28 July 2019|| Olympia||Martin Sheen, Charlie Sheen, Zachary Quinto, Robert Carlyle, Hayden Christensen, Jason Momoa, Carrie-Anne Moss, Brendan Fraser, Tom Ellis, Val Kilmer, Jason Isaacs, Tom Felton, Ben Barnes, Christina Ricci, Gina Torres, Lana Parrilla, Emilie De Ravin, Karen David, Robert Patrick, Christopher Eccleston, Vladimir Furdik, Ian McDiarmid, Matthew Lillard, Lee Majors, William Shatner, Walter Koenig, Shazad Latif, William Zabka, Jacob Bertrand, Xolo Mariduena, Ian Somerhalder, John Barrowman, Alfie Allen, Jenna Coleman, Adam Baldwin, Gareth David-Lloyd, Lisa & Louise Burns, Michael Shanks, Billy Dee Williams, Erin Kellyman, Manu Bennett, Peter Serafinowicz, Finn Jones, Jeff Jarrett, Jessica Henwick, Sacha Dhawan, David Morrissey, Lennie James, Joe Thomas, Blake Harrison, David Naughton, Sean Biggerstaff, Devon Murray, Ethan Phillips, Nicole De Boer, Joe Flanigan, Ian Whyte, Julian Glover, Lourdes Faberes, Mike Carter, Gemma Whelan, Phil Daniels, Bernard Cribbins, Franco Nero, Sylvester McCoy, Daniel Mays, Colin Baker, Sophie Aldred, John Leeson, Jessie Cave, Rick Gonzalez, Kirk Acevedo, Rob Morgan, Corey Dee Williams, Curzon Dobell, Kailia Vernoff, Robert Picardo, Stephen Gevedon, Philip Zhao, Peter Purves, John Levine, John Simpkin, Rusty Goffe, CJ Graham, Annette Jones, Barbara Frankland, Tara Fitzgerald Robert Glenister, Kane Hodder, Hugh Quarshie, Jim Marlow, Leslie Easterbrook, Paul Blake, Nicola Bryant, Katie Purvis, Neil Ellis, James Jude Courtney, Martin Stephens, Lesley Scoble, Teri Scoble, Andy de la Tour, Jonathan Cohen, Rugero Deodato, Me Me Lai, Samuel Oatley, Quentin Pierre, Tony Allen, Derek Arnold, Tom Wilton, David Church, Syd Wragg, Steve Ismay, Alan Fernandes, Ross Beadman, Peter House, Anthony Cece, Guy Henry, Kerry Ingram, Andy Bradford, Pam Rose, Eileen Roberts, Ron Hone, Bill Westley, Peter Ross, Derek Chafer, John Cannon, Terry Francis, Vic Gallucci, Grant Hall, Francesca Ciardi, Nelson Hall, Aimee Garcia, Genevieve Gaunt, Jaime Hill, Alan Harris, Kelly Kelly, Rey Mysterio, Ted Dibiase, Al Snow, Rob Liefeld", "| 19-21 November 2021. Returns after a 2-year hiatus due to the Covid-19 Pandemic || Olympia || Christopher Eccleston, George Takei,  Robert Englund, Karen Allen, Mark Pellegrino, Ming-Na Wen, Brian Blessed, Julian Kostov, Julius LeFlore, Valene Kane, Beau Gadsdon, Dolly Gadsdon, Daniel Naprous, Mark Rolston, Jemma Redgrave, Jo Martin, Amanda Abbington, Sean Biggerstaff, Andrew Robinson, Rose Reynolds, Hannah Murray, Nick Frost, Ben Browder, Natalia Tena, Tom Skerrit, Riz Ahmed, Sacha Dhawan, Georgia Hirst, Kim Coates, Ray Hassett, Bernard Cribbins, Elizabeth Mitchell, Simon Palsey-Day, Jason O'Mara, Guy Henry, Simon McBurney, Ahsley Walters, Veronica Cartwright, John Wesley Shipp, Jessie T. Usher, Janet Fielding, Suzanne Bertish, Angus Wright, Milton Johns, Andrew Gower, Liam Garrigan, Anji Mohindra, Mark Boone Jr., Quentin Piere, Harry Manfredi, Lee Cornes, Clare Kramer, David Learner, Danielle Nicolet, Joe Gibson, Mat Fraser, Julian Holloway, Sam Humphrey, Mandeep Dhillon, Matthew Devitt, Emmy Raver-Lampman, Steven R. McQueen, Barry Bostwick, Ronn Millkie, Anna-Louise Plowman, Staz Nair, Marc Blucas, PJ Black, Cinta de Oro, Jack McKenzie, Syd Wragg, Richard Brake, Jim Dowdall, Robert Patrick, Emily Kinney, Nick Blood, Maryam d'Abo, Bonnie Langford, Lance Henriksen, Tommy Knight, Lee Stringer, Jonathan Watson, Bernard Hill, Jimmy Vee, Tommy Flanagan, Jenna Coleman, Marina Sirtis, Kristanna Loken, Tim Dry, Sean Crawford, Joey Cramer, Andy Secombe, Sam Spruell, Rochenda Sandall"]}]}}