{"wiki_id": "http://www.wikidata.org/entity/Q3626950", "itemLabel": "Zayn Malik", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Zayn_Malik", "wikipedia_page": {"main": "Zain Javadd Malik (; born 12 January 1993), known mononymously as Zayn, is a British singer. Born and raised in Bradford, Malik auditioned as a solo contestant for the British music competition The X Factor in 2010. After being eliminated as a solo performer, Malik was brought back into the competition, along with four other contestants, to form the boy band One Direction, which went on to become one of the best-selling boy bands of all time. Malik left the group in March 2015 and subsequently signed a solo recording contract with RCA Records.\nAdopting a more alternative R&B music style with his debut studio album, Mind of Mine (2016), and its lead single, \"Pillowtalk\", Malik became the first British male artist to debut at number one in both the UK and US, with his debut single and debut album. His collaborative singles, \"I Don't Wanna Live Forever\" with Taylor Swift and \"Dusk Till Dawn\" featuring Sia, were met with international success. Malik released his second studio album, Icarus Falls, in 2018. His third album, Nobody Is Listening, was released in January 2021.\nMalik is the recipient of several accolades, including an American Music Award and a MTV Video Music Award. He is also the only artist to have won the Billboard Music Award for New Artist of the Year twice, receiving it once as a member of One Direction in 2013 and then again in 2017 as a solo artist.", "link_mentions": [{"page": "January 12", "response": ["*1993 – Zayn Malik, English singer"]}, {"page": "Pakistan", "response": ["The Overseas Pakistani Division (OPD) was created in September 2004 within the Ministry of Labour (MoL). It has since recognised the importance of overseas Pakistanis and their contribution to the nation's economy. Together with Community Welfare Attaches (CWAs) and the Overseas Pakistanis Foundation (OPF), the OPD is making efforts to improve the welfare of Pakistanis who reside abroad. The division aims to provide better services through improved facilities at airports, and suitable schemes for housing, education, and health care. It also facilitates the reintegration into society of returning overseas Pakistanis. Notable members of the Pakistani diaspora include the London Mayor Sadiq Khan, the UK cabinet member Sajid Javid, the former UK Conservative Party chair Baroness Warsi, the singers Zayn Malik and Nadia Ali, MIT physics Professor Dr. Nergis Mavalvala, the actors Riz Ahmed and Kumail Nanjiani, the businessmen Shahid Khan and Sir Anwar Pervez, Boston University professors Adil Najam and Hamid Nawab, Texas A&M professor Muhammad Suhail Zubairy, Yale professor Sara Suleri, UC San Diego professor Farooq Azam and the historian Ayesha Jalal."]}, {"page": "1993", "response": ["** Zayn Malik, British singer"]}, {"page": "Nusrat Fateh Ali Khan", "response": ["Jeff Buckley cited Khan as a major influence, saying of him \"He's my Elvis\", and performing the first few minutes of Khan's \"Yeh Jo Halka Halka Suroor Hai\" (including vocals) at live concerts.Buckley, Jeff. Live at Sin-é (Legacy Edition). Sony Music (2003). Many other artists have also cited Khan as an influence, such as Nadia Ali, Zayn Malik, Malay, Peter Gabriel, A. R. Rahman,[ A. R. Rahman: AllMusic] Sheila Chandra,[ Sheila Chandra: AllMusic] Alim Qasimov,[ Alim Qasimov: AllMusic] Eddie Vedder, and Joan Osborne, among others. His music was also appreciated by singers such as Mick Jagger, socialites such as Parmeshwar Godrej, actors such as Amitabh Bachchan, Trudie Styler, Sean Penn, Susan Sarandon, and Tim Robbins, and authors such as Sam Harris, who cited Khan as one of his favourite musicians."]}, {"page": "Band Aid (band)", "response": ["*Zayn Malik (One Direction)"]}, {"page": "Madame Tussauds", "response": ["|Zayn Malik"]}, {"page": "1993 in music", "response": ["**Zayn Malik, British R&B singer, songwriter, rapper and former member of the band (One Direction)"]}, {"page": "1993 in American television", "response": ["|Zayn Malik"]}, {"page": "Eurasian (mixed ancestry)", "response": ["File:Zayn Malik April 2014.png|Zayn Malik"]}, {"page": "List of singer-songwriters", "response": ["*Zayn Malik", "* Zayn Malik"]}, {"page": "Usher (musician)", "response": ["Usher has been referred to as the \"King of R&B\", as well as \"Mr. Entertainment\", by media outlets. The BET Honors honored him for his contributions to music with a Musical Arts award in 2015, presented by Bobby Brown who said \"You remain a game changer, for your discipline, for your perfectionism. You're just a god man\". The BET Honors highlighted his influence on many contemporary artists such as Chris Brown, Trey Songz, Drake, Bryson Tiller,Jason Derulo, Justin Bieber, Miguel, Omarion, Ray J, August Alsina, and Eric Bellinger. Ne-Yo further cited Usher as an influence upon the honor saying \"I feel that without Usher, there would be no me, there would be no Chris Brown, there would be no Trey Songz. He paved the way for us\". Other artists who have also cited him as an influence are 6lack, Rico Love, Zayn Malik, Jeremih, Anderson Paak, Trevor Jackson, Sam Hunt, Leon Bridges, Sammie, B.Smyth, Jacob Latimore, Kevin Woo, Keke Palmer, Justine Skye, BJ The Chicago Kid, Liam Payne of One Direction and actor Tahj Mowry."]}, {"page": "Vogue (magazine)", "response": ["* Zayn Malik, with Gigi Hadid in August 2017", "* August 2017: Zayn Malik appears on the cover, making him the first male Muslim to be on the cover of the magazine."]}, {"page": "Malik", "response": ["* Zayn Malik (born 1993), English former member of One Direction, now soloist"]}, {"page": "Billboard Music Awards", "response": ["| Zayn Malik"]}, {"page": "Lion dance", "response": ["Lion dance has also appeared in popular music videos, such as Chinese hip hop group Higher Brothers music video for their single \"Open It Up\", Adam Lamberts music video \"If I Had You\", and Zayn Malik Featuring Sias music video \"Dusk Till Dawn\". The same traditional dance also appeared in a music video \"True To Your Heart\" by 98 Degrees Featuring Stevie Wonder which was used to advertise the 1998 Disney animated film, Mulan."]}, {"page": "List of people from Yorkshire", "response": ["|Zayn Malik "]}, {"page": "List of Kashmiri people", "response": ["* Zayn Malik British musician."]}, {"page": "Celebrity (album)", "response": ["Celebrity is retrospectively seen as \"a logical swan song\" for NSYNC because it came after the record-breaking commercial success of No Strings Attached and before the band's eventual dissolution. Music critics observed that the album was the basis for Timberlake's solo career, as the album's singles consisted of only songs Timberlake co-wrote, in addition to album promotion that centered around Timberlake. Hugar compared Celebrity to Zayn Malik's and Harry Styles' desires for solo stardom after One Direction's hiatus, concluding that it is \"a reminder that boy bands are rarely built to last\".  NPR's Maria Sherman stated the album shifted the band further towards the R&B genre and \"firmly established Timberlake as the bandleader and pushed Chasez's powerful pop vocals to the periphery\". Andrew Unterberger of Billboard acknowledged that Celebrity contained sounds which \"pushes pop music into the future\"."]}, {"page": "Rockism and poptimism", "response": ["* \"To not care about Taylor Swift or Beyoncé or Lady Gaga or Zayn Malik is in itself questionable. It reveals not your taste in music, but your prejudices. In the worst-case scenario, you may be revealing your unconscious racism and sexism. At best, you're trolling.\""]}, {"page": "Waiting for Tonight", "response": ["Monica Herrera of Billboard stated that Adam Lambert's music video for the song \"If I Had You\" took the \"late-night wilderness party motif of Jennifer Lopez's classic 'Waiting for Tonight' clip\" and added \"more lasers, guyliner, thrashy dance moves, silver top hats and outrageously spiky shoulder pads\". MTV's Nicole James compared Rihanna's \"Where Have You Been\" music video to \"Waiting for Tonight\". Tiffany Lee of Yahoo! stated that Selena Gomez was \"channeling\" an early Lopez in her song \"Slow Down\", drawing comparisons between both songs and videos, observing that \"the premise for both music videos are almost identical\", with \"dancing in front of flashing lights and sweating in dance floor crowds\". Pitchfork Media's Lindsay Zoladz stated that English singer FKA twigs' music video for the song \"Papi Pacify\" features \"perhaps the most dazzling use of body glitter in a music video since J. Lo's 'Waiting for Tonight'\". Natasha Bird of Elle magazine compared the music video for Zayn Malik's \"Like I Would\" to \"Waiting for Tonight\", writing: \"with the addition of all the smoke, lasers and gyrating girls in booty shorts, we can't help but think that this video is an excellent tribute to Jennifer Lopez's millennium party single\"."]}, {"page": "British Asian", "response": ["In 2009, R&B and hip-hop artist, Mumzy Stranger, became the first British Bangladeshi to release a music single; titled \"One More Dance\". In October 2009, Jay Sean's single \"Down\" reached the #1 on the Billboard Hot 100 and sold four million copies in the United States, making him the first South Asian-origin solo artist and \"the first UK Urban act to top Billboards Hot 100,\" \"the most successful male UK urban artist in US chart history,\" and the most successful British male artist in the US charts since Elton John in 1997. A new generation of British Asian musicians have followed such as Raxstar, Bilal and Nish. In the early 2010s, Asian boy band members, Siva Kaneswaran of the Wanted and Zayn Malik of One Direction, have gained considerable mainstream popularity worldwide; the Wanted reached No. 3 on the Billboard Hot 100 with \"Glad You Came\" while One Direction topped the Billboard 200 with Up All Night. British Bangladeshi YouTuber-turned-rapper Koomz is best known for his breakthrough single \"Mariah\" which has hit over 10 million streams and views across many platforms and also Number 1 in the Official Asian Music Chart of 2018."]}, {"page": "Jay Sean", "response": ["Sean has worked with BBC Blast doing Q&A's on tour events in an effort to \"give something back\". He has supported the Aga Khan Foundation (AKF) in the charity event Partnership Walk and Run by performing in Regent's Park in 2004 and 2009. During this time, he also visited different UK schools to inspire and encourage schoolchildren to get involved in music; at one school, he met a young Zayn Malik and encouraged him to sing on stage for the first time."]}, {"page": "A Whole New World", "response": ["Zayn Malik and Zhavia Ward did their version of the song for the live action version of Aladdin (2019). The music video featuring Zayn Malik and Zhavia Ward was directed by Philip Andelman, photographed by David Devlin and supported the successful release of the 2019 live action feature film Aladdin directed by Guy Richie.", "Category:Zayn Malik songs"]}, {"page": "Director X", "response": ["After working on several of his projects, Lutz became a protégé of Hype Williams.Official Little X website \"About\"  Since the late 1990s, Lutz has directed dozens of music videos for popular artists and been noted for his high-budget, visually distinctive music videos for popular hit singles, including videos for The Wanted, R. Kelly, Usher, Kanye West, Jay-Z, Korn, David Guetta, Nelly Furtado, Sean Paul, Justin Bieber, Drake, Nicki Minaj, T.I., Little Mix, Rihanna, Union J, Fifth Harmony, Miguel, One Direction, Zayn Malik and Iggy Azalea. In 2004, Lutz appeared in Mya Baker's documentary film Silence: In Search of Black Female Sexuality in America."]}, {"page": "1993 in British music", "response": ["*12 January – Zayn Malik (One Direction)"]}, {"page": "Fast Car", "response": ["The Jonas Blue version peaked at number two on the UK Singles Chart, behind Zayn Malik's \"Pillowtalk\". Its UK peak meant it charted higher than Chapman's original, which peaked at number five on the chart in May 1988 and a position higher upon a re-release in April 2011."]}, {"page": "Herbie Crichlow", "response": ["Herbert \"Herbie\" Crichlow (born 26 November 1968) is a four-time ASCAP-awarded British music producer and songwriter living in Sweden. Born in England and raised in Barbados, he is best known for his multiple diamond, platinum and gold awarded works. He is also known for his written collaborations with Max Martin, RedOne, Grammy award winner David Franks and Denniz Pop. In 1997, he was awarded the UN Non Violence project Special Award for outstanding works. Crichlow has crafted hits for pop artists such as Backstreet Boys, Zayn Malik, Robyn, Leila K,  Rita Ora, Five,  amongst many others. His songs have been Grammy Award nominated five times."]}, {"page": "East Bowling", "response": ["* Zayn Malik (born 1993) – former member of boyband One Direction. Gareth Gates also grew up in East Bowling."]}]}}