{"wiki_id": "http://www.wikidata.org/entity/Q363653", "itemLabel": "Guy Hamilton", "itemDescription": "English film director (1922-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Hamilton", "wikipedia_page": {"main": "Mervyn Ian Guy Hamilton, DSC (16 September 1922 – 20 April 2016) was an English film director. He directed 22 films from the 1950s to the 1980s, including four James Bond films.\n\n", "link_mentions": [{"page": "Miss Marple", "response": ["In 1980, Angela Lansbury played Miss Marple in The Mirror Crack'd (EMI, directed by Guy Hamilton), based on Christie's 1962 novel. The film featured an all-star cast that included Elizabeth Taylor, Rock Hudson, Geraldine Chaplin, Tony Curtis, and Kim Novak. Edward Fox appeared as Inspector Craddock, who did Miss Marple's legwork. Lansbury's Marple was a crisp, intelligent woman who moved stiffly and spoke in clipped tones. Unlike most incarnations of Miss Marple, this one smoked cigarettes. Lansbury would find later fame in a similar role as Jessica Fletcher."]}, {"page": "Berlin Wall", "response": ["* Funeral in Berlin (1966), a spy movie starring Michael Caine, directed by Guy Hamilton."]}, {"page": "Batman (1989 film)", "response": ["In the late 1970s, Batman's popularity was waning. CBS was interested in producing a Batman in Outer Space film. Producers Benjamin Melniker and Michael E. Uslan purchased the film rights of Batman from DC Comics on October 3, 1979. It was Uslan's wish \"to make the definitive, dark, serious version of Batman, the way Bob Kane and Bill Finger had envisioned him in 1939. A creature of the night; stalking criminals in the shadows.\" Richard Maibaum was approached to write a script with Guy Hamilton to direct, but the two turned down the offer. Uslan was unsuccessful with pitching Batman to various movie studios because they wanted the film to be similar to the campy 1960s television series. Columbia Pictures and United Artists were among those to turn down the film."]}, {"page": "Conan the Barbarian", "response": ["The third film in the Conan trilogy was planned for 1987 to be titled Conan the Conqueror. The director was to be either Guy Hamilton or John Guillermin. Since Arnold Schwarzenegger was committed to the film Predator and De Laurentiis's contract with the star had expired after his obligation to Red Sonja and Raw Deal, he wasn't keen to negotiate a new one; thus the third Conan film sank into development hell. The script was eventually turned into Kull the Conqueror."]}, {"page": "James Bond", "response": ["| style=\"text-align:center;\"|Guy Hamilton", "| rowspan=\"3\" style=\"text-align:center;\"|Guy Hamilton"]}, {"page": "September 16", "response": ["*1922 – Guy Hamilton, French-English director and screenwriter (d. 2016)"]}, {"page": "War film", "response": ["A popular subgenre of war films in the 1950s and 1960s was the prisoner of war film. The genre was popularised in Britain with major films like Guy Hamilton's The Colditz Story (1955) and John Sturges's American film The Great Escape (1963). They told stories of real escapes from German prisoner of war camps such as Stalag Luft III in the Second World War. Despite episodes of danger and human tragedy, these films delight in a continual boyish game of escape and ingenuity, celebrating the courage and the defiant spirit of the prisoners of war, and treating war as fun. David Lean's Bridge on the River Kwai (1957) was judged best picture at the Oscars; it took the genre from chilly German prisons to the heat of a camp in Thailand. It was the first, too, to use lush colour to bring out the British stiff upper lip of the colonel, played by Alec Guinness in an Oscar-winning performance. The \"definitive\" Oscar-winning prisoner of war film was Billy Wilder's Stalag 17 (1953), while the brief but powerful prison camp scenes of The Deer Hunter (1978) lend an air of tragedy to the whole of that film."]}, {"page": "1922", "response": ["** Guy Hamilton, French-English director, screenwriter (d. 2016)"]}, {"page": "Warren Mitchell", "response": ["His cinema début was in Guy Hamilton's Manuela (1957), and he began a career of minor roles as sinister foreign agents, assisted by his premature baldness and facility with Eastern European accents. He appeared in The Roman Spring of Mrs. Stone (1961), the Hammer horror The Curse of the Werewolf (1961), Carry On Cleo (1964), Where Has Poor Mickey Gone? (Gerry Levy, 1964), and Help! (Richard Lester, 1965) and played leads in All the Way Up (James MacTaggart, 1970), The Chain (Jack Gold, 1984), The Dunera Boys (Ben Lewin, 1985) and Foreign Body (Ronald Neame, 1986)."]}, {"page": "2016", "response": ["** Guy Hamilton, British film director (b. 1922)"]}, {"page": "An Inspector Calls", "response": ["A 1954 British film version, An Inspector Calls, was produced by Watergate Productions Ltd. The screenplay was adapted by Desmond Davis and directed by Guy Hamilton. Alastair Sim starred as Inspector Goole, renamed \"Poole\" for the film, with Jane Wenham as Eva Smith (the character not seen in the play), Eileen Moore as Sheila Birling, Arthur Young as Arthur Birling, Brian Worth as Gerald Croft, Olga Lindo as Sybil Birling and Bryan Forbes as Eric Birling."]}, {"page": "List of highest-grossing films", "response": ["Steven Spielberg is the most represented director on the chart, with six films to his credit, occupying the top spot in 1975, 1981, 1982, 1984, 1989 and 1993. Cecil B. DeMille (1932, 1947, 1949, 1952 and 1956) and William Wyler (1942, 1946, 1959 and 1968) are in second and third place with five and four films, respectively, while D. W. Griffith (1915, 1916 and 1920), George Roy Hill (1966, 1969 and 1973), James Cameron (1991, 1997 and 2009) and the Russo brothers (2016, 2018 and 2019) all feature heavily with three films apiece. George Lucas directed two chart-toppers in 1977 and 1999, but also served in a strong creative capacity as a producer and writer in 1980, 1981, 1983, 1984 and 1989 as well. The following directors have also all directed two films on the chart: Frank Lloyd, King Vidor, Frank Capra, Michael Curtiz, Leo McCarey, Alfred Hitchcock, David Lean, Stanley Kubrick, Guy Hamilton, Mike Nichols, William Friedkin, Peter Jackson, Gore Verbinski, and Michael Bay; Mervyn LeRoy, Ken Annakin and Robert Wise are each represented by one solo credit and one shared credit, and John Ford co-directed two films. Disney films are usually co-directed and some directors have served on several winning teams: Wilfred Jackson, Hamilton Luske, Clyde Geronimi, David Hand, Ben Sharpsteen, Wolfgang Reitherman and Bill Roberts have all co-directed at least two films on the list. Only seven directors have topped the chart in consecutive years: McCarey (1944 and 1945), Nichols (1966 and 1967), Spielberg (1981 and 1982), Jackson (2002 and 2003), Verbinski (2006 and 2007) and the Russo brothers (2018 and 2019)."]}, {"page": "Funeral in Berlin", "response": ["A film version of Funeral in Berlin was made in 1966, starring Michael Caine and directed by Guy Hamilton. In 1973, the TV series Jason King (starring Peter Wyngarde), used the plot from Funeral in Berlin to smuggle an individual out of East Germany. The book is shown at the end of the episode. (Ostensibly, they had been using a plot from a book written by eponymous hero Jason King but it turns out at the end that it was a double bluff. King ostentatiously throws the Deighton book into the fireplace.)"]}, {"page": "Q (James Bond)", "response": ["Beginning in Guy Hamilton's Goldfinger and in each film thereafter Major Boothroyd is most often referred to as Q; however, in The Spy Who Loved Me (1977) he is referred to once again as Major Boothroyd in dialogue.", "Starting with Goldfinger, the notion that Bond and Q would have an often strained relationship with each other was introduced by Guy Hamilton; it continued in the series thereafter.   While briefing Bond on the gadgets that he is going to use on his mission, Q often expresses irritation and impatience at Bond's short attention span, often telling him to \"pay attention, 007\", and Bond's playful lack of respect for his equipment, telling the agent, \"I never joke about my work, 007\". In Thunderball, Bond can be heard muttering \"Oh no\" when Q joins him in the Bahamas.  A running gag appeared in later films where  Q's prized gadget  would be destroyed in a mishap often caused by necessity or Bond's recklessness – examples include the Glastron jet boat in Moonraker (Bond sends it over the Iguazu Falls to escape pursuit by Jaws), the Aston Martin Vantage in The Living Daylights (Bond is forced to prime its self-destruct device in order to evade the Czech police forces), and the BMW Z8 in The World Is Not Enough – which is cut in half by a helicopter buzz-saw."]}, {"page": "The Third Man", "response": ["According to the recollection of assistant director Guy Hamilton, interviewed in 2015, Greene and Reed worked very well together, but Orson Welles \"generally annoyed everyone on the set\". His temporary absence forced Hamilton to step in as body double for him. Apparently, the filming of the sewer scenes was moved to studios in the UK as a result of Welles' complaints about shooting in the actual sewers.", "According to Guy Hamilton, Reed met Karas by coincidence at a party in Vienna, where he was playing the zither. Reed brought Karas to London, where the musician worked with Reed on the score for six weeks. Karas stayed at Reed's house during that time. Film critic Roger Ebert wrote, \"Has there ever been a film where the music more perfectly suited the action than in Carol Reed's The Third Man?\"The Third Man review, Roger Ebert, 8 December 1996"]}, {"page": "Colditz", "response": ["The story of the wartime prisoners at Oflag IV-C was documented by Patrick Robert (\"Pat\") Reid in his books The Colditz Story and The Latter Days At Colditz, and the former was used as the basis for a 1955 film directed by Guy Hamilton. In the early 1970s the BBC broadcast a series, Colditz, created by Brian Degas and Gerard Glaister, with Reid as technical advisor. Beginning in 1973 a board game Escape from Colditz was marketed by Parker Brothers, followed by a computer game in 1991."]}, {"page": "Diamonds Are Forever (film)", "response": ["The film is based on Ian Fleming's 1956 novel of the same name and is the second of four James Bond films directed by Guy Hamilton. The story has Bond impersonating a diamond smuggler to infiltrate a smuggling ring and soon uncovering a plot by his old enemy Ernst Stavro Blofeld to use the diamonds to build a space-based laser weapon. Bond has to battle his enemy for one last time to stop the smuggling and stall Blofeld's plan of destroying Washington, D.C. and extorting the world with nuclear supremacy.", "After George Lazenby left the series, producers Harry Saltzman and Albert R. Broccoli tested other actors, but studio United Artists wanted Sean Connery back, paying a then-record $1.25 million salary for him to return. The producers were inspired by Goldfinger; as with that film, Guy Hamilton was hired to direct, and Shirley Bassey performed vocals on the title theme song. Locations included Las Vegas, California, and Amsterdam. Diamonds Are Forever was a commercial success and received generally positive reviews initially.  It was nominated for the Academy Award for Best Sound.", "The producers originally intended to have Diamonds Are Forever re-create commercially successful aspects of Goldfinger, including hiring its director, Guy Hamilton. Peter R. Hunt, who had directed On Her Majesty's Secret Service and worked in all previous Bond films as editor, was invited before Hamilton, but due to involvement with another project could only work on the film if the production date was postponed, which the producers declined to do. As a condition for Hamilton directing after his difficulties with trade unions during the filming of Battle of Britain, Diamonds Are Forever was the first Bond production to be primarily based in the United States rather than the United Kingdom. ", "Category:Films directed by Guy Hamilton"]}, {"page": "1985 in film", "response": ["| Remo Williams: The Adventure Begins || Orion Pictures || Guy Hamilton (director); Christopher Wood (screenplay); Fred Ward, Joel Grey, Wilford Brimley, J.A. Preston, George Coe, Charles Cioffi, Kate Mulgrew, Michael Pataki, Reginald VelJohnson, Jon Polito, Gene LeBell, Sebastian Ligarde, Tom McBride, Suzanne Snyder, William Hickey, Patrick Kilpatrick || Action, Adventure || Live action"]}, {"page": "1982 in film", "response": ["| Evil Under the Sun || Universal Pictures / Associated Film Distribution / EMI Films / Titan Productions / Mersham Productions Ltd. || Guy Hamilton (director); Anthony Shaffer (screenplay); Peter Ustinov, Jane Birkin, Colin Blakely, Nicholas Clay, James Mason, Roddy McDowall, Sylvia Miles, Denis Quilley, Diana Rigg, Maggie Smith, Emily Hone || Mystery || Live action"]}, {"page": "1980 in film", "response": ["*The Mirror Crack'd, directed by Guy Hamilton, starring Angela Lansbury, Elizabeth Taylor, Kim Novak, Tony Curtis, Rock Hudson – (U.K.)", "| The Mirror Crack'd || Columbia-Warner Distributors / EMI Films / GW Films || Guy Hamilton (director); Jonathan Hales, Barry Sandler (screenplay); Angela Lansbury, Elizabeth Taylor, Kim Novak, Rock Hudson, Edward Fox, Geraldine Chaplin, Tony Curtis, Charles Gray, Richard Pearson, Wendy Morgan, Margaret Courtenay, Carolyn Pickles, Charles Lloyd-Pack, Pat Nye, Norman Wooland, Richard Leech, Sam Kydd, Pierce Brosnan, Anthony Steel, Dinah Sheridan, Nigel Stock, Hildegard Neil, John Bennett, Allan Cuthbertson, Marella Oppenheim, Maureen Bennett, Eric Dodson, Thick Wilson, Peter Woodthorpe || Mystery || Live action"]}, {"page": "1974 in film", "response": ["*The Man with the Golden Gun, directed by Guy Hamilton, starring Roger Moore (as James Bond), with Christopher Lee and Britt Ekland – (U.K.)"]}, {"page": "1955 in film", "response": ["* The Colditz Story, directed by Guy Hamilton, starring John Mills and Eric Portman – (GB)"]}, {"page": "1922 in film", "response": ["**Guy Hamilton, English director (died 2016)"]}, {"page": "John Barry (composer)", "response": ["| Guy Hamilton", "| Guy Hamilton", "| Guy Hamilton", "| Guy Hamilton", "| Guy Hamilton"]}, {"page": "American International Pictures", "response": ["| align=\"right\"| December 8, 1978 || Force 10 from Navarone || War || Guy Hamilton"]}, {"page": "Battle of Britain (film)", "response": ["Battle of Britain is a 1969 British Second World War film directed by Guy Hamilton, and produced by Harry Saltzman and S. Benjamin Fisz. The film documents the events of the Battle of Britain. The film drew many respected British actors to accept roles as key figures of the battle, including Laurence Olivier as Air Chief Marshal Sir Hugh Dowding, Trevor Howard as Air Vice-Marshal Keith Park, and Patrick Wymark as Air Vice-Marshal Trafford Leigh-Mallory, Air Officer commanding No. 12 Group RAF. It also starred Michael Caine, Christopher Plummer, and Robert Shaw as Squadron Leaders. The script by James Kennaway and Wilfred Greatorex was based on the book The Narrow Margin by Derek Wood and Derek Dempster.", "After worldwide distribution, the film grossed just under $13 million according to Guy Hamilton in an interview on the two-disc DVD edition, but due to the large cost of production, the film lost $10 million, although home media sales finally moved it into profit.", "Category:Films directed by Guy Hamilton"]}, {"page": "Sailor Malan", "response": ["In the 1969 cinema film Battle of Britain, the character of Squadron Leader Skipper played by Robert Shaw was based on Malan.Interview with director Guy Hamilton in the documentary 'A Film for the Few', which was included with the 2004 Special Edition DVD release of the film"]}, {"page": "Shiri (film)", "response": ["Shiri was the first Hollywood-style big-budget blockbuster to be produced in the \"new\" Korean film industry (i.e. after Korea's major economic boom in the late 1990s).Anthony Leong (2001). \"Shiri Movie Review\". Media Circus. Retrieved 11 November 2007. Created as a deliberate homage to the \"high-octane\" action film made popular by Hollywood through the 1980s, it also contained a story that draws on strong Korean national sentiment to fuel its drama. Much of the film's visual style shares that of the Asian action cinema, and particularly Hong Kong action cinema, of John Woo, Tsui Hark, Ringo Lam, and the relentless pace of the second unit directors, like Vic Armstrong and Guy Hamilton, in the James Bond films.Scott Hamilton; Chris Holland (16 April 2002). \"Shiri\". Stomp Tokyo. Retrieved 11 November 2007."]}, {"page": "Jack Lord", "response": ["Lord was the first actor to play the character Felix Leiter in the James Bond film series, introduced in 1962 in the first Bond film, Dr. No. According to screenwriter Richard Maibaum, Lord then demanded co-star billing, a bigger role and more money to reprise the roleGoldberg, Lee The Richard Maibaum Interview p.26 Starlog #68 March 1983 in Goldfinger, which resulted in director Guy Hamilton casting Cec Linder in the role."]}, {"page": "Oliver Reed", "response": ["During this time he appeared in some ITV Playhouse productions, \"Murder in Shorthand\" (1962) and \"The Second Chef\" (1962), and guest-starred in episodes of The Saint. He also had the lead in a non-Hammer horror, The Party's Over (made 1963, released 1965), directed by Guy Hamilton."]}, {"page": "Superman (1978 film)", "response": ["Ilya had the idea of a Superman film in 1973 and after a difficult process with DC Comics, the Salkinds and Spengler bought the rights to the character the following year. Several directors, most notably Guy Hamilton, and screenwriters (Mario Puzo, David and Leslie Newman, and Robert Benton), were associated with the project before Richard Donner was hired to direct. Tom Mankiewicz was drafted in to rewrite the script and was given a \"creative consultant\" credit. It was decided to film both Superman and its sequel Superman II (1980) simultaneously, with principal photography beginning in March 1977 and ending in October 1978. Tensions arose between Donner and the producers, and a decision was made to stop filming the sequel, of which 75 percent had already been completed, and finish the first film.", "Ilya wanted to hire Steven Spielberg to direct, but Alexander was skeptical, feeling it was best to \"wait until [Spielberg's] big fish opens.\" Jaws was very successful, prompting the producers to offer Spielberg the position, but by then Spielberg had already committed to Close Encounters of the Third Kind. Guy Hamilton was hired as director, while Puzo delivered his 500-page script for Superman and Superman II in July 1975. Jax-Ur appeared as one of General Zod's henchmen, with Clark Kent written as a television reporter. Dustin Hoffman, who was previously considered for Superman, turned down Lex Luthor."]}, {"page": "List of film and television directors", "response": ["*Guy Hamilton"]}, {"page": "George MacDonald Fraser", "response": ["There was another collection of Dand McNeill stories, McAuslan in the Rough (1974), then Flashman in the Great Game (1975) and Flashman's Lady (1977). He was hired to rewrite Crossed Swords (1977) and Force 10 from Navarone (1978). The latter was directed by Guy Hamilton who arranged for Fraser to do some work on the script for Superman (1978). He did some uncredited work on the film Ashanti and wrote an unused script for Tai Pan to star Steve McQueen. He also wrote a biopic of General Stilwell for Martin Ritt which was not filmed."]}, {"page": "Dino De Laurentiis", "response": ["| The Best of Enemies || Guy Hamilton ||"]}, {"page": "John Glen (director)", "response": ["During the 1960s and 1970s, Glen served as a film editor and second unit director, working on such films as Superman (1978) and The Wild Geese (1978); he also contributed to three James Bond films: On Her Majesty's Secret Service (1969), The Spy Who Loved Me (1977) and Moonraker (1979). Following the release of Moonraker, Glen was promoted to the rank of official director of the series; he went on to direct all five Bond films of the 1980s. He holds the record for directing the most number of films in the series to date, just one film more than Guy Hamilton. The films are:"]}, {"page": "Geraldine Chaplin", "response": ["|Guy Hamilton"]}, {"page": "Harold Sakata", "response": ["Bond producers Harry Saltzman and Albert R. Broccoli took notice of Sakata because of his heavy build—he stood 5 ft 10 in (1.78 m) and weighed 284 lb (129 kg)—which, when coupled with his intimidating gaze, made him the perfect choice for the part of Oddjob. Another story, told by director Guy Hamilton, stated that he’d first seen Sakata wrestling in Australia.", "As Oddjob, he was a bodyguard to Bond villain Auric Goldfinger, and his sharpened, steel-brimmed bowler hat became a famous and much-parodied trademark of the Bond series. While filming Oddjob's death scene, Sakata's hand was badly burnt, but he held on until he heard director Guy Hamilton call \"Cut\"."]}, {"page": "Remo Williams: The Adventure Begins", "response": ["Remo Williams: The Adventure Begins, also released as Remo: Unarmed and Dangerous, is a 1985 American action-adventure film directed by Guy Hamilton. The film featured Fred Ward, Joel Grey, J. A. Preston, Wilford Brimley, and Kate Mulgrew.", "Orion hired veterans of the Bond series to work on the film, English director Guy Hamilton (Goldfinger, Live and Let Die) and screenwriter Christopher Wood (Moonraker, The Spy who Loved Me).", "Category:Films directed by Guy Hamilton"]}, {"page": "Nicholas Clay", "response": ["In 1981 he gave his most widely seen screen performance, as Lancelot in the 1981 film Excalibur.  He followed it playing the title role in The Search for Alexander the Great (1981). He appeared in Just Jaeckin's film version of D.H. Lawrence's Lady Chatterley's Lover (1981), playing Mellors, and in Agatha Christie's Evil Under the Sun (1982), the latter reuniting him with Diana Rigg, his co-star in The Misanthrope. Director of Evil Guy Hamilton said \"I was looking for someone like Stewart Granger or Michael Rennie - handsome, dashing, physical, romantic. Nick has it all. A fine sense of timing, the right looks and a good physique.\""]}, {"page": "Fred Ward", "response": ["After co-starring roles in Swing Shift (1984) and Secret Admirer (1985) he played the title hero in the action movie Remo Williams: The Adventure Begins, which was directed by Guy Hamilton. The film was supposed to be the first of a series based on The Destroyer series of novels. Though the movie was well promoted, with Ward appearing on the cover of several movie magazines, it only grossed $15 million. He confirmed that he performed most of the stunts himself."]}, {"page": "Conan the Destroyer", "response": ["The third film in the Conan trilogy had been planned for a 1987 release with the title Conan the Conqueror. The director was to have been either Guy Hamilton or John Guillermin. Arnold Schwarzenegger was committed to the film Predator, and De Laurentiis's contract with the star had expired after his obligation to Red Sonja (his role in which was originally intended to be Conan) and Raw Deal, and he was not keen to negotiate a new one. The third Conan film fell into development hell, the script eventually being turned into Kull the Conqueror."]}, {"page": "BAFTA Award for Best Film", "response": ["| The Colditz Story || Guy Hamilton || Ivan Foxwell ||  United Kingdom"]}, {"page": "Superman II", "response": ["As Donner had become unavailable during the European promotional campaign for Superman, the Salkinds approached Guy Hamilton to take over directional reins for Superman II since Lester was filming Cuba (1979) at the time. However, Hamilton was unavailable, but by the time Superman II was ready to begin filming, Lester had completed Cuba and was available to direct. Eventually, on March 15, 1979, the Salkinds decided to replace Donner with Richard Lester. Donner recalled that \"One day, I got a telegram from them saying my services are no longer needed and that my dear friend Richard Lester would take over. To this day, I have not heard from them.\" Ilya Salkind countered, \"Dick Donner said, 'I will do the second movie on my terms and without [Pierre] Spengler'...Spengler was my friend since childhood and my father and I were very loyal guys. We said no, and it really boiled down to that.\""]}, {"page": "Force 10 from Navarone (film)", "response": ["Force 10 from Navarone is a 1978 war film loosely based on Alistair MacLean's 1968 novel of the same name. It is a sequel to the 1961 film The Guns of Navarone. The parts of Mallory, Miller and Barnsby are played by Robert Shaw (who died before the film was released), Edward Fox and Harrison Ford, succeeding the roles originally portrayed by Gregory Peck, David Niven, and Richard Harris. It was directed by Guy Hamilton and also stars Carl Weathers, Barbara Bach, Franco Nero (in a \"plastic surgery\" role previously played by Tutte Lemkow), and Richard Kiel.", "George MacDonald Fraser was hired to do further work on the script during filming in Yugoslavia, in part because he and Guy Hamilton got along well when both worked on Superman (1978). However Fraser is not credited on the film.", "Category:Films directed by Guy Hamilton"]}, {"page": "The Colditz Story", "response": ["The Colditz Story is a 1955 British prisoner of war film starring John Mills and Eric Portman and directed by Guy Hamilton. It is based on the book written by Pat Reid, a British army officer who was imprisoned in Oflag IV-C, Colditz Castle, in Germany during the Second World War and who was the Escape Officer for British POWs within the castle.", "Category:Films directed by Guy Hamilton"]}, {"page": "Putter Smith", "response": ["Smith was playing with Monk at the Los Angeles jazz club Shelly's Manne-Hole when he was spotted by director Guy Hamilton, who cast him as the assassin \"Mr. Kidd\" (alongside Bruce Glover as \"Mr. Wint\") in the 1971 James Bond film Diamonds Are Forever. He went on to have several other minor acting roles on film and television."]}, {"page": "Christopher Wood (writer)", "response": ["In 1979 LWT screened his 13-part situation comedy Lovely Couple, produced and directed by Derrick Goodwin. He also wrote the action film Remo Williams: The Adventure Begins (1985) starring Fred Ward, which was directed by former Bond director Guy Hamilton. In the late 1990s Wood wrote scripts for producer Roger Corman."]}, {"page": "BFI Top 100 British films", "response": ["| 70 || Goldfinger  || 1964 || Guy Hamilton"]}, {"page": "Marc Forster", "response": ["Additionally, Forster directed the twenty-second James Bond film, Quantum of Solace which began shooting on January 2, 2008, shortly before his 39th birthday, making him the youngest director in the series' history (beating the previous record set by Guy Hamilton, who was 41 when he directed Goldfinger five years before Forster's birth). Quantum of Solace was released in the United Kingdom on October 31, 2008.  It became one of the highest grossing Bond films in the franchise's history, with a worldwide box office of more than $586 million."]}]}}