{"wiki_id": "http://www.wikidata.org/entity/Q363978", "itemLabel": "Andrew Knott", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Knott", "wikipedia_page": {"main": "Andrew Knott (born 22 November 1979) is a British actor. He played Dirtbox in Gavin & Stacey, and Dickon Sowerby in the 1993 film The Secret Garden.", "link_mentions": [{"page": "1994 in film", "response": ["| Black Beauty || Warner Bros. Pictures || Caroline Thompson (director/screenplay); Andrew Knott, Sean Bean, David Thewlis, Jim Carter, Peter Davison, Alun Armstrong, John McEnery, Eleanor Bron, Peter Cook, Keeley Flanders, Niall O'Brien, Alan Cumming, Docs Keepin Time, Ian Kelsey || Drama || Live action"]}, {"page": "1993 in film", "response": ["| The Secret Garden || Warner Bros. Pictures || Agnieszka Holland (director); Caroline Thompson (screenplay); Kate Maberly, Heydon Prowse, Andrew Knott, Maggie Smith, John Lynch, Irene Jacob, Colin Bruce, Laura Crossley, Walter Sparrow || Drama, Family || Live action"]}, {"page": "The Secret Garden", "response": ["American Zoetrope's 1993 production was directed by Agnieszka Holland with a screenplay by Caroline Thompson and starred Kate Maberly as Mary, Heydon Prowse as Colin, Andrew Knott as Dickon, John Lynch as Lord Craven and Dame Maggie Smith as Mrs Medlock. The executive producer was Francis Ford Coppola."]}, {"page": "The Secret Garden (1993 film)", "response": ["The Secret Garden is a 1993 fantasy drama film directed by Agnieszka Holland, executive-produced by Francis Ford Coppola and distributed by Warner Bros. under their Family Entertainment imprint. The movie stars Kate Maberly, Heydon Prowse, Andrew Knott, John Lynch, and Maggie Smith, was written by Caroline Thompson and based on the 1911 novel of the same name by Frances Hodgson Burnett. The novel was previously adapted into two films: a 1949 drama film and a 1919 silent film, which starred Lila Lee and Spottiswoode Aitken."]}, {"page": "Kate Maberly", "response": ["|Andrew Knott"]}, {"page": "The History Boys", "response": ["The play opened at the Lyttelton Theatre (part of the National Theatre) in London on 18 May 2004, directed by Nicholas Hytner. It played to sell-out audiences and its limited run was frequently extended. Richard Griffiths, James Corden, Dominic Cooper, Russell Tovey, Sacha Dhawan, Samuel Barnett, Jamie Parker and Andrew Knott were among the original cast. On 24 November 2005, the same production was revived once again at the Lyttelton Theatre where it played another successful run. Matt Smith took on the role of Lockwood in the November 2005 revision of the cast. The original cast reunited in the final week in February 2006.", "|Lockwood||Andrew Knott||Matt Smith||David Poynor||Sam Phillips"]}, {"page": "Where the Heart Is (British TV series)", "response": ["Other original characters featured in the series included William Travis as factory worker Dick Lampard, Andrew Knott as Stephen's best friend Henry Green, Maggie Wells as part-time district nurse Patricia Illingworth and Laura Crossley as Deborah Allis. Graham Turner played Walter Charlton, a recurring character created by Pharoah. Anthony did disliked his \"old man\" characterisation and decided to rewrite him. Turner originally auditioned for another role in the series, but Anthony believed he fitted her plans for Walter. He has learning difficulties, which Anthony was keen to portray in Where The Heart Is. She thought that television series were often scared to fully explore learning difficulties and she wanted to show how people like Walter fit into a community.", "* Andrew Knott as Henry Green"]}, {"page": "The History Boys (film)", "response": ["* Andrew Knott as James \"Jimmy\" Lockwood"]}, {"page": "Drop Dead Gorgeous (TV series)", "response": ["*Ben McIntyre played by Andrew Knott"]}, {"page": "Police 2020", "response": ["* Andrew Knott as Scully"]}, {"page": "Black Beauty (1994 film)", "response": ["Black Beauty is a 1994 drama film scripted and directed by Caroline Thompson in her directorial debut.Black Beauty Review Entertainment Weekly. The fifth cinematic adaptationBlack Beauty - Review Rotten Tomatoess. of Anna Sewell's 1877 novel of the same name, the film stars Andrew Knott, Sean Bean and David Thewlis. Produced and distributed by Warner Bros. under their Warner Bros. Family Entertainment label, it is also treated as an autobiography of the horse Black Beauty as in the original novel, and features Alan Cumming as the voice of the 'Black Beauty'.Overview The New York Times.", "On a stormy night, Beauty is pulling a carriage holding the squire and his caretaker, John Manly (Jim Carter), home from town, but sensing danger refuses to cross a partially flooded bridge. When John tries to pull him to move, Beauty steadfastly refuses. When the bridge finally gives way, crashing into the river, John slips and falls in, but manages to hang on to Beauty's bridle. Beauty and the squire save John, and they again head off back home. Joe Green (Andrew Knott), who works in the stable, volunteers to look after Beauty that night. Joe's lack of knowledge about horses causes him to give Beauty ice cold water to drink and to neglect to dry him off or cover him with a rug overnight, which causes Beauty to fall sick. The following few days John, Joe, and the squire treat and nurse Beauty, and he recovers.", "* Andrew Knott as Joe Green"]}, {"page": "Gavin & Stacey", "response": ["* Dirtbox (Andrew Knott) – a friend of Gavin and Smithy."]}, {"page": "List of British films of 1994", "response": ["|Black Beauty||Caroline Thompson||Alan Cumming, Andrew Knott, Sean Bean || Family ||"]}, {"page": "List of Life on Mars characters", "response": ["Later in the episode, Ted's son Derek (Andrew Knott) is arrested for armed robbery, after organising a payroll snatch at the factory."]}, {"page": "List of former Coronation Street characters", "response": ["|Liam Shepherd || Andrew Knott || 1997"]}, {"page": "Characters of Casualty", "response": ["On her first day, she ran over Vince Callaghan (Andrew Knott) and then alongside Zoe Hanna (Sunetra Sarker), treated Vince after being taken hostage and beaten up by Shelle Jones (Kelli Hollis). Elle also has a close relationship with Henrik, the hospital's CEO, and he also asks her to keep a close eye on the department and report anything negative. She also went to school with Jacob Masters (Charles Venn), but didn't hit it off well with Connie Beauchamp (Amanda Mealing), Charlie Fairhead (Derek Thompson) or David. With Holby under intense media scrutiny, Elle finds some missing drugs in Charlie's locker and immediately reports them to Rita. Rita is obliged to inform Connie and Charlie is placed on immediate administrative leave, but since he is especially well-loved and trusted in the department Elle's decision draws the ire and mistrust of the whole staff, including even Jacob. She realises she has to work hard to regain their trust; in Casualty's 1000th episode, Elle does everything to save a pregnant woman who is reluctant to receive treatment having experienced a miscarriage. Her efforts are sadly in vain and the mother is lost, but afterwards several members of the team come to comfort her and accept her apologies.  CEO Henrik Hanssen later promotes Elle Gardner to clinical lead."]}, {"page": "List of British former child actors", "response": ["*Andrew Knott (born 1979)"]}, {"page": "List of Gavin & Stacey characters", "response": ["|Andrew Knott", "*Dirtbox (Andrew Knott) – A friend of Gavin and Smithy's. He seems to be somewhat short tempered and snappy. In the 2019 Christmas special Smithy states that Dirtbox is recently divorced."]}, {"page": "Knott (surname)", "response": ["* Andrew Knott (born 1979), English actor"]}, {"page": "List of Coronation Street characters (1997)", "response": ["Katie Joyce Mallett (formerly Shannon Tattersall) was the daughter of wayward teenager Zoe Tattersall (Joanne Froggatt) and Liam Shepherd (Andrew Knott). Zoe fell pregnant by her ex-boyfriend; she did not want to be a mother and was planning to have the pregnancy terminated, but Judy Mallett (Gaynor Faye) - who was unable to have children - convinced her not to. Zoe then offered the Malletts £2,000 for her baby, and Judy hastily took the offer with a reluctant Gary Mallett (Ian Mercer) going on with the plan as well."]}, {"page": "Frankenstein's Wedding", "response": ["*Andrew Knott as Henry"]}, {"page": "15th Youth in Film Awards", "response": ["*Andrew Knott - The Secret Garden (Warner Bros)"]}, {"page": "Young Artist Award for Best Leading Young Actor in a Feature Film", "response": ["|Andrew Knott||The Secret Garden ||Warner Bros."]}, {"page": "List of LGBT-related films of 2006", "response": ["|  ||  || United Kingdom || Comedy, drama || Richard Griffiths, Clive Merrison, Frances de la Tour, Stephen Campbell Moore, Samuel Anderson, Samuel Barnett, Dominic Cooper, James Corden, Sacha Dhawan, Andrew Knott, Jamie Parker and Russell Tovey || Screenplay by Alan Bennett, based on play of the same name"]}, {"page": "Waterloo Road (series 7)", "response": ["* Andrew Knott as Greg Barrington; Journalist undercover as a teaching assistant (1 episode)"]}, {"page": "Casualty (series 30)", "response": ["Amy Noble made four guest appearances throughout the series as PC Kate Wilkinson. Kerry Bennett joined the cast in a recurring capacity as HART paramedic Jess Cranham in episode six, along with Anna Acton and Grace Doherty, who joined the cast as Jess's partner and daughter Nikki Chisom and Olivia Cranham in episode twelve, were part of a storyline which saw Dixie take \"center stage\". They were involved in a domestic abuse storyline which concluded in episode eighteen, broadcast on 9 January 2016, when a hostage situation and fire occurred leading to Nikki being arrested. Bennett and Doherty continued to appear in the series until episode twenty-one when they departed alongside Hazlegrove. The show's co-creator Paul Unwin pitched a storyline which saw Ethan and Cal discover they are adopted. Carol Royle was introduced as the brothers' biological mother Emilie Groome in episode sixteen. Her final appearance was made in episode twenty-seven, where she died at the seaside accompanied by Cal and Ethan. Hannah Spearritt joined the cast in a recurring capacity as Mercedes Christie, a drug addict that attacked Noel and later blackmailed Big Mac in a long-running storyline. She made her debut in episode twenty for one episode, and returned for more prominent appearances from episode twenty-four. Kelli Hollis joined the cast in episode twenty-four as Shelle Jones, Mercedes' drug dealer. Mercedes son and partner, Connor Christie and Vince Callaghan were introduced in episode twenty-eight, played by Toby Murray and Andrew Knott respectively. Connor departed in episode thirty-three, whilst Mercedes, Shelle and Vince made their final appearance in the following episode.", "* Andrew Knott as Vince Callaghan"]}, {"page": "The Driver (TV series)", "response": ["* Andrew Knott as Detective Richard O'Connor"]}, {"page": "In Our Name", "response": ["Confused by her rejection of his affections, Mark begins to suspect that Suzy is having an affair with one of her fellow squaddies, his suspicions focussing on Paul (Andrew Knott). Paul and Suzy do a presentation for some school children arranged by Suzy's teacher sister Marie (Janine Leigh). At this presentation Suzy reveals her feelings of guilt over the death of an Iraqi girl who was executed by local militia for accepting a bag of sweets offered to her by Suzy.", "| Andrew Knott || Paul"]}, {"page": "Spike Island (film)", "response": ["* Andrew Knott as Voodoo Ray"]}, {"page": "Grantchester (TV series)", "response": ["The second series was filmed in autumn 2015, and guest stars included Neil Morrissey, Claudie Blakley, Nigel Planer, Andrew Knott, Nicky Henson and Oliver Dimsdale. The third series was filmed between August and November 2016, and filming for the fourth series commenced in June 2018. The fifth series was filmed in Cambridge and elsewhere during the summer of June 2019."]}, {"page": "The Lady in the Van", "response": ["The principal cast of Bennett's 2006 film The History Boys appear in cameo roles, with the exception of that film's \"teachers\", de la Tour, who has a more prominent role in this film, and Richard Griffiths, who died in 2013. This includes the \"temporary teacher\" (Moore) and all the \"students\" from that earlier film: Samuel Barnett (as Donald), Samuel Anderson (as a Jehovah's Witness), Stephen Campbell Moore (as a doctor), Dominic Cooper (as a theatre actor), James Corden (as a street trader), Sacha Dhawan (as Doctor Malik), Andrew Knott (as an ambulance driver), Clive Merrison (as a man attending confession), Jamie Parker (as an estate agent), and Russell Tovey (as a man with an earring)."]}, {"page": "Spooks: Code 9", "response": ["* Rob Sullivan (Andrew Knott) – formerly a doctor, and now the team medic."]}, {"page": "Black Work", "response": ["* Andrew Knott as D.C. Lee Miekel"]}]}}