{"wiki_id": "http://www.wikidata.org/entity/Q363876", "itemLabel": "John Waters", "itemDescription": "Australian actor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Waters_(actor)", "wikipedia_page": {"main": "John Russell Waters (born 8 December 1948) is an English-born Australian film, theatre and television actor, singer, guitarist, songwriter and musician best known in Australia, where he moved to in 1968. He is the son of Scottish actor Russell Waters. John Waters has been in the industry for over 50 years, and was part of the Australian children's television series Play School for 18 years.", "link_mentions": [{"page": "December 8", "response": ["*  1948   – John Waters, English-Australian actor, singer-songwriter, and guitarist"]}, {"page": "Kylie Minogue", "response": ["During a Fitzroy Football Club benefit concert, Minogue performed \"I Got You Babe\" as a duet with fellow actor John Waters, and \"The Loco-Motion\" as an encore. Producer Greg Petherick arranged for Minogue to record a demo of the latter song, re-titled as \"Locomotion\". The demo was sent to the head of Mushroom Records Michael Gudinski, who decided to sign Minogue in early 1987 based on her popularity from Neighbours. \"The Locomotion\" was released as her debut single in Australia on 27 July 1987, three weeks after Neighbours wedding episode premiered. The single became the best-selling single of the decade in Australia according to the Kent Music Report. The success of \"Locomotion\" resulted in Minogue travelling to London to work with record producing trio Stock Aitken Waterman in September 1987. They knew little of Minogue and had forgotten that she was arriving; as a result, they wrote \"I Should Be So Lucky\" while she waited outside the studio. More sessions with Stock Aitken Waterman occurred from February to April 1988 in London and Melbourne, where Minogue was filming her last episodes for Neighbours. The trio ended up composing and producing all the tracks on the forthcoming album except for \"The Loco-Motion\"."]}, {"page": "The Sound of Music", "response": ["An Australian revival played in the Lyric Theatre, Sydney, New South Wales, from November 1999 to February 2000. Lisa McCune played Maria, John Waters was Captain von Trapp, Bert Newton was Max, Eilene Hannan was Mother Abbess and Rachel Marley was Marta. This production was based on the 1998 Broadway revival staging.Rose, Colin. \"Head for the hills; Stage\", The Sun Herald (Sydney, Australia), November 14, 1999, Time Out, p. 15 The production then toured until February 2001, in Melbourne, Brisbane, Perth and Adelaide. Rachael Beck took over as Maria in Perth and Adelaide, and Rob Guest took over as Captain von Trapp in Perth.Critics' Choice, The Australian, April 14, 2000, Features, p. 11Barclay, Alison. \"Von Trapps' house is full\", Herald Sun (Melbourne, Australia), July 7, 2000, p. 89Aldred, Debra. \"Lisa can sing for her supper of marshmallows\", Courier Mail (Queensland, Australia), August 4, 2000, p. 7Archdall, Susan. \"Rachael's happy to go her own way\", The Advertiser, January 1, 2001, p. 77"]}, {"page": "Echuca", "response": ["In 1984, the Australian television mini-series, All the Rivers Run, based on a novel by Nancy Cato and starring Sigrid Thornton and John Waters, was filmed in and around Echuca. The local paddle steamers PS Pevensey and PS Emmylou featured in the mini-series as the PS Philadelphia and PS Providence, respectively. The airing of this series around Australia and internationally revitalised Echuca's tourism economy."]}, {"page": "Hair (musical)", "response": ["A German production, directed by Castelli, opened a month later in Munich;Blumenthal, Ralph (October 26, 1968).  \"Munich Audience Welcomes Hair; Applause and Foot Stamping Follow Musical Numbers\" .  The New York Times, p. 27.  Retrieved on April 11, 2008. the tribe included Donna Summer, Liz Mitchell and Donna Wyant.  A successful Parisian production of Hair opened on June 1, 1969.\"Translated Hair Cheered in Paris; Title Lends Itself to Jest at Candidate's Expense\" .  The New York Times (June 2, 1969), p. 53.  Retrieved on June 7, 2008.  The original Australian production premiered in Sydney on June 6, 1969, produced by Harry M. Miller and directed by Jim Sharman, who also designed the production.  The tribe included Keith Glass and then Reg Livermore as Berger, John Waters as Claude and Sharon Redd as The Magician. Redd was one of six African-Americans brought to Australia to provide a racially integrated tribe.\"Hair Reaches Australia\" , The New York Times (June 7, 1969), p. 26, reproduced at the Hair Online Archives.  Retrieved on April 29, 2009.Hair: Original Australian production , MILESAGO: Australasian Music & Popular Culture 1964–1975, accessed April 29, 2009. The production broke local box-office records and ran for two years, but because of some of the language in the show, the cast album was banned in Queensland and New Zealand.  The production transferred to Melbourne in 1971 and then had a national tour.  It marked the stage debut of Boston-born Australian vocalist Marcia Hines.  In Mexico the production was banned by the government after one night in Acapulco. An 18-year-old Sônia Braga appeared in the 1969 Brazilian production.Sonia Braga . Yahoo! Movies, accessed May 27, 2011"]}, {"page": "Oliver!", "response": ["The Australian tour was a successful trip through Sydney, Melbourne, and Singapore from 2002 to 2004. The show, which mirrored Sam Mendes' production, was recreated by Graham Gill. John Waters played Fagin, Tamsin Carroll was Nancy, and the production also featured Stuart Wagstaff, Steve Bastoni and Madison Orr and Keegan Joyce in the title role, which was rotated between the two. The role of the Artful Dodger was shared between Mathew Waters and Tim Matthews, with Waters performing on the opening night. Waters declined the tour after the Sydney production to appear in the Hollywood movie Peter Pan."]}, {"page": "The Rocky Horror Show", "response": ["In 2008, Gale Edwards staged a revival of The Rocky Horror Show at the Star Theatre in Sydney, Australia, where it played from 12 February to 30 March. The production starred iOTA as Frank-N-Furter, Kellie Rhode as Janet Weiss, Andrew Bevis as Brad Majors Tamsin Carroll as Magenta and the usherette, Paul Capsis as Riff Raff, Sharon Millerchip as Columbia (a role that won her a Helpmann Award for Best Female Actor in a Supporting Role in a Musical), Michael Cormick as Eddie and Dr. Scott, Simon Farrow as Rocky Horror, and John Waters as The Narrator."]}, {"page": "1980 in film", "response": ["| Breaker Morant || Roadshow Film Distributors || Bruce Beresford (director/screenplay); Jonathan Hardy, David Stevens (screenplay); Edward Woodward, Jack Thompson, John Waters, Bryan Brown, Charles 'Bud' Tingwell, Terence Donovan, Ray Meagher, Lewis Fitz-Gerald, Rod Mullinar, Frank Wilson, David Wenham, Alan Cassell, Vincent Ball, Chris Haywood, Russell Kiefel, Rob Steele, Chris Smith, Frank Wilson, Bruno Knez || War, Drama || Live action"]}, {"page": "1977 in film", "response": ["* Desperate Living, directed by John Waters", "| Desperate Living || New Line Cinema / Dreamland || John Waters (director/screenplay); Liz Renay, Mink Stole, Edith Massey, Susan Lowe, Mary Vivian Pearce, Jean Hill, Cookie Mueller, Channing Wilroy, Ed Peranio, Paul Swift, George Figgs, Sharon Niesp, George Stover, Turkey Joe, Al Strapelli, Brook Blake, Karen Gerwig, Marina Melin || Comedy || Live Action ", "| The Getting of Wisdom || Roadshow / Southern Cross Films || Bruce Beresford (director); Eleanor Witcombe (screenplay); Susannah Fowle, Hilary Ryan, Terence Donovan, Patricia Kennedy, Sheila Helpmann, Candy Raymond, Barry Humphries, John Waters, Julia Blake, Diana Greentree, Monica Maughan, Dorothy Bradley, Kay Eklund, Maggie Kirkpatrick, Phillip Adams, Kerry Armstrong, Sigrid Thornton, Celia De Burgh, Kim Deacon, Alix Longman, Jo-Anne Moore, Amanda Ring, Janet Shaw, Karen Sutton || Drama || Live Action "]}, {"page": "John Waters (disambiguation)", "response": ["John Waters (born 1946) is an American film director, writer, visual artist, actor and cult figure.", "John Waters may also refer to:", "*John Waters (director born 1893) (1893–1965), American film director, active 1926–1929 and 1947", "*John Waters (actor) (born 1948), English-born Australian actor, musician and singer", "*Sir John Waters (British Army officer, born 1774) (1774–1842), officer in the British Army during the Napoleonic Wars", "*Sir John Waters (British Army officer, born 1935), British Army general", "*John Waters (columnist) (born 1955), Irish journalist", "*John Waters (politician) (1829–1910), Canadian Liberal legislator", "*Sir John Kirwan (politician) (John Waters Kirwan, 1869–1949), English-born Australian legislator "]}, {"page": "Tell Me on a Sunday", "response": ["In 2008, the Alloy Theater Company staged the original one-act version with Irish actress, Maxine Linehan, at the Laurie Beechman Theatre in New York City. That same year, Bailiwick Repertory produced the Chicago premiere starring Harmony France to rave reviews and the Kookaburra Theatre presented the Australian premiere starring Jolene Anderson, with Noni Hazlehurst and John Waters providing the voices of \"Mum\" and \"Married Man\" respectively. Despite mixed reviews, it had sellout performances in both Sydney and Melbourne."]}, {"page": "Godspell", "response": ["The first production after the off-Broadway show opened at the Playbox Theatre in Melbourne, Australia on November 15, 1971. The cast included Colleen Hewett, Collette Mann, Christopher Pate, and George Spartels. The producers, Aztec Services and Williamson Edgley Theatres, opened a second production in Sydney on April 10, 1972. Peta Toppano, John Waters, and Marty Rhone were in the Sydney production. Melbourne played 504 performances and Sydney played 507 before the two companies went on tour, performing another 700 shows.\"'Stephen Schwartz in Oz'\", Stagewhispers.com.au."]}, {"page": "John Farnham", "response": ["In August 1992, Farnham joined the Australian production of Tim Rice and Andrew Lloyd Webber's stage musical Jesus Christ Superstar in the title role of Jesus. Fellow cast members included Angry Anderson as Herod, Kate Ceberano as Mary Magdalene, Russell Morris as Simon Zealotes, Jon Stevens as Judas and John Waters as Pontius Pilate. The stage soundtrack, Jesus Christ Superstar The Album, provided the single \"Everything's Alright\" by Ceberano, Farnham and Stevens, which peaked at No. 6 in September. Farnham released his next studio album, Then Again.., in October 1993, produced by Fraser and Farnham, which peaked at No. 1. Of its four singles only, \"Seemed Like a Good Idea (At the Time)\" reached the top 20. The album won \"Highest Selling Album\" at the ARIA Awards in 1994."]}, {"page": "The Late Show (1992 TV series)", "response": ["Martin did the voice of the star of the show, Governor Frontbottom (as well as Judge Muttonchops). Molloy supplied the voice for the John Waters' character Sergeant Olden. Other characters were used intermittently.", "Actors Brendon Lunney and John Waters appeared as surprise guests on The Late Show after the last episode of The Olden Days."]}, {"page": "All Saints (TV series)", "response": ["| John Waters", "| John Waters"]}, {"page": "Marcia Hines", "response": ["At the age of 16, Hines was discovered by Australian entrepreneur Harry M. Miller and director Jim Sharman who were visiting the U.S. to audition African-American singers in preparation for the new season of the Australian stage production of Hair, which had already premiered in Sydney on June 6, 1969. Because she was underage, Miller was made her legal guardian. When she made her debut in April 1970, Hines became the youngest person in the world to play a featured role in any production of Hair. It was produced by Miller and directed by Sharman. Fellow performers included Keith Glass, Sharon Redd, Reg Livermore, John Waters and Victor Willis. During the show's run Hines learned she was pregnant; her daughter, Deni Hines, was born in September 4, 1970 and nine days later Hines returned to the stage to continue her role. The show was a major success. Hines was well received and an Australian tour followed. Miller and Sharman approached her to play Mary Magdalene in the Australian production of Jesus Christ Superstar and Hines assumed the role from Michele Fawdon in the summer of 1973 with Hines' tenure in the role until February 1974 making her a major star in Australia. Other cast members included Trevor White, Jon English, Doug Parkinson, Stevie Wright and John Paul Young."]}, {"page": "Robertson, New South Wales", "response": ["* John Waters (actor): English-born actor"]}, {"page": "Tim Burstall", "response": ["Burstall's films featured early appearances by many legendary Australian actors including Jack Thompson, Bruce Spence, Jacki Weaver, Alvin star Graeme Blundell, John Waters and Judy Davis."]}, {"page": "List of fictional doctors", "response": ["|All Saints || Dr. Luciano \"Luke\" ForlanoDr. Peter MorrisonDr. Mitchell \"Mitch\" StevensDr. Kylie PreeceDr. Charlotte BeaumontDr. Vincent HughesDr. Jack QuadeDr. Frank CampionDr. Sean EverleighDr. Bartholomew \"Bart\" WestDr. Miklos \"Mike\" VlasekDr. Zoe GallagherDr. Steven \"Steve\" TaylorDr. Adam RossiDr. Elliott Parker || Martin LynesAndrew McKaigeErik ThomsonLing-Hsueh TangTammy MacIntoshChristopher GabardiWil TravalJohn HowardChris VanceAndrew SupanzJohn WatersAllison CratchleyJack CampbellKip GamblinJonathan Wood"]}, {"page": "Nikki Webster", "response": ["Webster appeared in television commercials including Twisties, Lay's chips and Campbell's soup. At 10 years old, Webster played the Young Cosette in Les Misérables, and in 1999–2000 starred as Brigitta Von Trapp in a stage production of The Sound of Music, alongside Lisa McCune, John Waters and Bert Newton."]}, {"page": "Breaker Morant (film)", "response": ["On 5 April 1901, Morant's friend, Captain Simon Hunt, had led a group of men to a farmhouse at Duiwelskloof intending to capture or kill Boer Commando Field Cornet Barend Viljoen. On arrival, the Carbineers found the farm swarming with far more armed men than expected. Captain Hunt was wounded, pinned down by enemy fire and left behind when he ordered his men to retreat. When the patrol returned to Fort Edward without Captain Hunt, Intelligence Corps Captain Alfred Taylor (John Waters) suggests Morant \"avenge Captain Hunt\". After returning to the farm and finding Captain Hunt's body mutilated with knives, Morant gave chase, ambushed Viljoen's men, and forced them to retreat with many losses. After capturing a Boer named Visser who was wearing Captain Hunt's jacket, an enraged Morant ordered his men to line up into a firing squad and shoot him. They obeyed his order."]}, {"page": "Waters (name)", "response": ["* Horace John Waters, the birth name of actor Jack Warner", "* John Waters (actor) (born 1948), Australian actor", "* John Waters (disambiguation)", "**John Waters (columnist), Irish columnist"]}, {"page": "The Sullivans", "response": ["* John Waters (episodes 561 to 592 and 709 to 710)"]}, {"page": "Lisa McCune", "response": ["Immediately after finishing Blue Heelers, she starred alongside John Waters, Bert Newton, Nikki Webster, Rachel Marley and later Rob Guest in a stage version of The Sound of Music, as Maria von Trapp.\"The Hills Are Alive\", review in The Australian"]}, {"page": "Attack Force Z", "response": ["* John Waters as Sub Lt. Ted 'Kingo' King", "Filming was further delayed by constant rain and re-writing of the script.David Stratton, The Avocado Plantation: Boom and Bust in the Australian Film Industry, Pan MacMillan, 1990 p43 Among the changes made were adding a fifth character to the team - a soldier played by John Waters who would be killed within the opening ten minutes by one of their own men.Interview with Tim Burstall, 30 March 1998  accessed 14 October 2012"]}, {"page": "Paris (Jon English musical)", "response": ["The musical was preceded in 1990 by a 2-CD concept album, called Paris: A Love Story, recorded in London. English sang the role of Hector, and the cast included John Parr as Paris, Sheila Parker as Helen, Terence Donovan as Priam, Sheryl Parker as Cassandra, Doc Neeson as Achilles, John Waters as Agamemnon, Philip Quast as Patroclus, Joe Fagin as Menelaus, Harry Nilsson as Ulysses, as well as Demis Roussos, David Atkins and Barry Humphries, backed by the London Symphony Orchestra and London Philharmonic Choir.Paris  at The Philip Quast Guide, accessed 4 June 2009"]}, {"page": "Radiance of the Seas", "response": ["During the northern summer season, Radiance of the Seas operates in Alaska. When the ship is cruising in Alaska guests are able to stand on the helipad to enjoy picturesque views of the glaciers passing by the ship as they cruise along. In spring and fall, she visits the Hawaiian Islands, and in the winter season, the southern summer, she visits Australia and New Zealand. The inaugural Australian cruise of the performing arts on the Radiance of the Seas in November 2014 included, among others, Cheryl Barker, David Hobson, Teddy Tahu Rhodes, Simon Tedeschi, Elaine Paige, Marina Prior, and John Waters.\"Bravo! A Cruise of the Performing Arts\", Stage Whispers"]}, {"page": "Logie Awards of 1975", "response": [":Winner: John Waters, Rush, ABC"]}, {"page": "Peta Toppano", "response": ["Toppano's television credits include \"Lena\" in Piccolo Mondo for SBS, \"Karen Travers\" in Prisoner, a role created for her by producer/writer Reg Watson, \"Eunice Pyke\" in All the Rivers Run and \"Gina Agostini\" in Fields of Fire. Other appearances include \"Stella\" in Heartbreak High on Network Ten and \"Diomira\" in Bordertown for ABC Television. She also appeared in A Country Practice, G.P., E Street and Flying Doctors. In 198. She played Kate in the ABC miniseries The Paper Man with Oliver Tobias, John Bach and Rebecca Gilling (her co-star in Return To Eden), and starred with John Waters and Cybill Shepherd in the 1991 miniseries Which Way Home. Toppano played Jilly Stewart in Return to Eden and Helen Poulos in Home and Away.Mercado, Andrew.  Super Aussie Soaps: Behind the Scenes of Australia's Best Loved TV Shows (2004): \"Peta Toppano, once tagged as the nice girl, found herself typecast as a superbitch after screaming 'No!' so many times as Jilly.\"\"Peta Toppano: Biography \", petatoppano.com. Retrieved 2 December 2010."]}]}}