{"wiki_id": "http://www.wikidata.org/entity/Q364264", "itemLabel": "John William Polidori", "itemDescription": "English writer and physician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_William_Polidori", "wikipedia_page": {"main": "John William Polidori (7 September 1795 – 24 August 1821) was an English writer and physician. He is known for his associations with the Romantic movement and credited by some as the creator of the vampire genre of fantasy fiction. His most successful work was the short story \"The Vampyre\" (1819), the first published modern vampire story. Although the story was at first erroneously credited to Lord Byron, both Byron and Polidori affirmed that the author was Polidori.", "link_mentions": [{"page": "August 24", "response": ["*1821 – John William Polidori, English writer and physician (b. 1795)"]}, {"page": "Gothic fiction", "response": ["Byron was also the host of the celebrated ghost-story competition involving himself, Percy Bysshe Shelley, Mary Shelley, and John William Polidori at the Villa Diodati on the banks of Lake Geneva in the summer of 1816. This occasion was productive of both Mary Shelley's Frankenstein (1818) and Polidori's The Vampyre (1819), featuring the Byronic Lord Ruthven. The Vampyre has been accounted by cultural critic Christopher Frayling as one of the most influential works of fiction ever written and spawned a craze for vampire fiction and theatre (and latterly film) which has not ceased to this day. Mary Shelley's novel, though clearly influenced by the Gothic tradition, is often considered the first science fiction novel, despite the omission in the novel of any scientific explanation of the monster's animation and the focus instead on the moral issues and consequences of such a creation."]}, {"page": "Goth subculture", "response": ["The figures that the movement counted among its historic canon of ancestors were equally diverse. They included the Pre-Raphaelite Brotherhood, Friedrich Nietzsche (1844‒1900), Comte de Lautréamont (1846‒1870), Salvador Dalí (1904‒1989) and Jean-Paul Sartre (1905‒1980). Writers that have had a significant influence on the movement also represent a diverse canon. They include Ann Radcliffe (1764‒1823), John William Polidori (1795‒1821), Edgar Allan Poe (1809‒1849), Sheridan Le Fanu (1814-1873), Bram Stoker (1847‒1912), Oscar Wilde (1854‒1900), H. P. Lovecraft (1890‒1937), Anne Rice (1941‒), William Gibson (1948‒), Ian McEwan (1948‒), Storm Constantine (1956‒2021), and Poppy Z. Brite (1967‒)."]}, {"page": "Romanticism", "response": ["In contrast to Germany, Romanticism in English literature had little connection with nationalism, and the Romantics were often regarded with suspicion for the sympathy many felt for the ideals of the French Revolution, whose collapse and replacement with the dictatorship of Napoleon was, as elsewhere in Europe, a shock to the movement. Though his novels celebrated Scottish identity and history, Scott was politically a firm Unionist, but admitted to Jacobite sympathies. Several Romantics spent much time abroad, and a famous stay on Lake Geneva with Byron and Shelley in 1816 produced the hugely influential novel Frankenstein by Shelley's wife-to-be Mary Shelley and the novella The Vampyre by Byron's doctor John William Polidori. The lyrics of Robert Burns in Scotland, and Thomas Moore from Ireland, reflected in different ways their countries and the Romantic interest in folk literature, but neither had a fully Romantic approach to life or their work."]}, {"page": "September 7", "response": ["*1795 – John William Polidori, English physician and author (d. 1821)"]}, {"page": "1821", "response": ["* August 24 – John William Polidori, English physician, writer (b. 1795) (suicide)"]}, {"page": "1795", "response": ["* September 7 – John William Polidori, English writer and physician (d. 1821)"]}, {"page": "I Am Legend (novel)", "response": ["Although Matheson calls the assailants in his novel \"vampires\" and though their condition is transmitted through bacteria in the blood and garlic is a repellant to this strain of bacteria, there is little similarity between them and vampires as developed by John William Polidori and his successors, who come straight out of the gothic fiction tradition. In I Am Legend, the \"vampires\" share more similarities with zombies, and the novel influenced the zombie genre and popularized the concept of a worldwide zombie apocalypse.Deborah Christie, Sarah Juliet Lauro, ed. (2011). Better Off Dead: The Evolution of the Zombie as Post-Human. Fordham Univ Press. p. 169. , 9780823234479. Although the idea has now become commonplace, a scientific origin for vampirism or zombies was fairly original when written.\"Nashuatelegraph.com: Tale with long history has legendary opening\" According to Clasen,"]}]}}