{"wiki_id": "http://www.wikidata.org/entity/Q3646297", "itemLabel": "Alfred Lennon", "itemDescription": "father of English musician John Lennon", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Lennon", "wikipedia_page": {"main": "Alfred Lennon (14 December 1912 – 1 April 1976), also known as Freddie Lennon, was an Englishman best known as the father of musician John Lennon. Alfred spent many years in an orphanage with his sister, Edith, after his father died. He was considered very witty and musical throughout his life, he sang and played the banjo, but not considered very reliable or dependable. Although informally called Alf by his family, he released a record as Freddie Lennon, and was referred to in the media by that name.\nHe married Julia Stanley in 1938. John was their only child, but as Alfred was frequently away at sea during World War II, he did not see much of his child during his infancy. During this period Julia became pregnant with another man's child. He offered to look after his wife, their child and the expected baby, but Julia rejected the idea. Alf had very little contact with his son until Beatlemania, when they met again, but later had only intermittent contact with each other. He died in Brighton, where he had gone to live after marrying Pauline Jones, with whom he had two sons.", "link_mentions": [{"page": "John Lennon", "response": ["Lennon was born at Liverpool Maternity Hospital to Julia (née Stanley) (1914–1958) and Alfred Lennon (1912–1976). Alfred was a merchant seaman of Irish descent who was away at the time of his son's birth. His parents named him John Winston Lennon after his paternal grandfather, John \"Jack\" Lennon, and Prime Minister Winston Churchill. His father was often away from home but sent regular pay cheques to 9Newcastle Road, Liverpool, where Lennon lived with his mother; the cheques stopped when he went absent without leave in February 1944. When he eventually came home six months later, he offered to look after the family, but Julia, by then pregnant with another man's child, rejected the idea. After her sister Mimi complained to Liverpool's Social Services twice, Julia gave her custody of Lennon."]}, {"page": "1912", "response": ["** Alfred Lennon, British merchant seaman, amateur musician and father of John Lennon (d. 1976)"]}, {"page": "1976", "response": ["** Alfred Lennon, father of musician John Lennon (b. 1912)"]}, {"page": "Answer song", "response": ["* \"That's My Life (My Love and My Home)\" (1965) by Alfred Lennon, John Lennon's father, was a response to his son's song \"In My Life\" (also 1965), recorded by the Beatles."]}, {"page": "Cynthia Lennon", "response": ["Powell and Lennon were married on 23 August 1962 at the Mount Pleasant register office in Liverpool. Fellow Beatles McCartney and George Harrison were in attendance, as was their manager, Brian Epstein, who was best man; no parents were there. The wedding was farcical, because as soon as the ceremony began a workman in the backyard of the building opposite started using a pneumatic drill that drowned out anything the registrar, Lennon, or Powell said. When the registrar asked for the groom to step forward, Harrison stepped forward instead. With no photographs or flowers the wedding party celebrated afterwards, at Epstein's invitation, in Reece's restaurant in Clayton Square, which was the place Lennon's parents, Alfred Lennon and Julia Lennon, had celebrated their marriage in 1938. Lennon was 21 years old, and Powell 22. The newlyweds had no honeymoon, as Lennon had to play an engagement at the Riverpark Ballroom in Chester the same night. They travelled to the Hotel George V in Paris for a belated honeymoon on 16 September but were accompanied by Epstein, even though he had not been invited to join them.", "In 1965, she opened the front door of Kenwood to see a man who \"looked like a tramp\", but with her husband's features. He explained that he was Alfred Lennon, the father whom Lennon had supposedly not seen for years. Lennon was annoyed when he came home, telling her for the first time that his father had visited the NEMS office, Epstein's business, a few weeks before. Three years after the meeting in the NEMS office, Alfred Lennon (who was then 56 years old) turned up at Kenwood again with his fiancée, 19-year-old student Pauline Jones. He asked if the Lennons could give Pauline a job, so she was hired to help with Julian and the piles of Beatles' fan mail. Lennon's father and his fiancée then spent a few months living in the attic bedroom. During an interview at Kenwood with Evening Standard reporter Maureen Cleave, Lennon said, \"Here I am in my Hansel and Gretel house, famous and loaded, and I can't go anywhere. There's something else I'm going to do, only I don't know what it is, but I do know this isn't it for me\"."]}, {"page": "List of women who died in childbirth", "response": ["*Margaret Cowley (1892), second wife of John Jack Lennon (1855-1921; father of Alfred Lennon)"]}]}}