{"wiki_id": "http://www.wikidata.org/entity/Q364869", "itemLabel": "Mel Collins", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mel_Collins", "wikipedia_page": {"main": "Melvyn Desmond Collins (born 5 September 1947, Isle of Man) is a British saxophonist, flautist and session musician.\nCollins is perhaps best known for his work in progressive rock, having been a member of King Crimson on two occasions (the first from 1970 to 1972 and the second from 2013 to the present day) and having played with Camel, the Alan Parsons Project, Roger Waters and Chris Squire. He has also worked in a wide variety of contexts ranging from R&B and blues rock to jazz.\n\n", "link_mentions": [{"page": "Alexis Korner", "response": ["Although he himself was a blues purist, Korner criticised better-known British blues musicians during the blues boom of the late 1960s for their blind adherence to Chicago blues, as if the music came in no other form. He liked to surround himself with jazz musicians such as John McLaughlin and Binky McKenzie and often performed with a horn section drawn from a pool that included, among others, saxophone players Art Themen, Mel Collins, Dick Heckstall-Smith, Lol Coxhill, Dick Morrissey, John Surman and trombonist Mike Zwerin.", "In 1973, he and Peter Thorup formed another group, Snape, with Boz Burrell, Mel Collins, and Ian Wallace, who were previously together in King Crimson. Korner also played on B.B. King's In London album, and cut his own, similar \"supersession\" album; Get Off My Cloud, with Keith Richards, Steve Marriott, Peter Frampton, Nicky Hopkins and members of Joe Cocker's Grease Band. In the mid-1970s, while touring Germany, Korner established an intensive working relationship with bassist Colin Hodgkinson who played for the support act Back Door. They would continue to collaborate right up until Korner's death."]}, {"page": "King Crimson", "response": ["Fripp and Sinfield recorded the second King Crimson album, In the Wake of Poseidon, in 1970 with Michael Giles hired back as a session musician to complete the album. Jazz pianist Keith Tippett and saxophonist Mel Collins (of the band Circus) appeared as guest musicians, and Peter Giles played bass guitar instead of Lake. The band's management booked Elton John to sing the material as a session musician amidst the uncertainty, but Fripp decided against this idea after listening to his debut album. Lake, who ultimately decided to leave and form Emerson, Lake and Palmer, did agree to sing all the vocals, except \"Cadence and Cascade\", which was sung by Fripp's old school friend Gordon Haskell. Upon its release in May 1970, In the Wake of Poseidon reached No. 4 in the UK and No. 31 in the US. It received some criticism from those who thought it sounded too similar to their first album. With no musicians to perform the new material, Fripp invited Collins to join, changing his status from session player to full band member. Gordon Haskell was asked to join as lead singer (and eventually bassist), and Andy McCulloch came on as drummer. Collins would also act as occasional keyboard player and backing vocalist.", "In July 1974, Fripp, Bruford, and Wetton began recording Red. Before recording began, Fripp, now increasingly disillusioned with the music industry, turned his attention to the works of Russian mystic George Gurdjieff and had a spiritual experience in which \"the top of my head blew off\". Though most of the album was already written, Fripp retreated into himself during the sessions and \"withdrew his opinion\", leaving Bruford and Wetton to direct most of the recording process. The album contains one live track, \"Providence\", recorded on 30 June 1974 with Cross playing violin. Several guest musicians (including Mel Collins and Ian McDonald) contributed to the album. Released on 6 October 1974, Red went to No. 45 in the UK and No. 66 in the US. AllMusic called it \"an impressive achievement\" for a group about to disband, with \"intensely dynamic\" musical chemistry between the band members.", "In 2011, a band called Jakszyk, Fripp and Collins (and subtitled \"A King Crimson ProjeKct\") released an album called A Scarcity of Miracles. The band featured guitarist and singer Jakko Jakszyk, Fripp and former Crimson saxophonist Mel Collins as the main players/composers, with Tony Levin playing bass and Gavin Harrison playing drums. At one point, Fripp referred to the band as \"P7\" (ProjeKct Seven). Unusually for a ProjeKct, it was based around \"finely crafted\" and \"mid-paced\" original songs derived from improvised sessions. In August 2012, Fripp announced his retirement from the music industry, leaving the future of King Crimson uncertain.", "Active between 2002 and 2005, the 21st Century Schizoid Band reunited several former King Crimson members who had played on the band's first four albums. The band featured Ian McDonald, Mel Collins, Peter Giles and Michael Giles (the latter subsequently replaced by Ian Wallace), and was fronted by guitarist/singer Jakko Jakszyk, a decade prior to his own recruitment into King Crimson. The band engaged in several tours, played material from King Crimson's '60s and '70s catalogue, and recorded several live albums. The band disbanded upon Wallace's death in 2007.", "*Mel Collins – saxophones, flute, bass flute, mellotron, backing vocals "]}, {"page": "Robert Fripp", "response": ["During the recording of the band's second album In the Wake of Poseidon, Greg Lake departed to form Emerson, Lake and Palmer, leaving Fripp and Sinfield as the only remaining founder members. They issued two more albums (Lizard and Islands) and were the only constants in a regularly changing King Crimson lineup. It included (at various times) Gordon Haskell, saxophonist/flute player Mel Collins, drummers Andy McCulloch and Ian Wallace and future Bad Company bass player Boz Burrell, in addition to a palette of guest players from Soft Machine, Keith Tippett's band, Brotherhood of Breath and Centipede. Fripp was listed as the sole composer of the band's music during this time, which built on the first album's blueprint but progressed further into jazz rock and free jazz while also taking form from Sinfield's esoteric lyrical and mythological concepts.", "In May 2011, Jakko Jakszyk, Robert Fripp and Mel Collins released a song album called A Scarcity of Miracles: A King Crimson ProjeKct on the Panegyric label. The album also featured contributions by Tony Levin and Gavin Harrison, leading to speculation that the project was a dry run for a new King Crimson.", "In his online diary entry for 6 September 2013, Fripp announced the return of King Crimson as a seven-piece unit with \"four Englishmen and three Americans\". The new lineup was Fripp, Levin, both Mastelotto and Harrison on drums, returning 1970s band member Mel Collins and two new members: Jakko Jakszyk as singer and second guitarist, and Bill Rieflin as a third drummer. This version of the band went on tour in 2014 and 2015 with a setlist reworking and reconfiguring the band's 1960s and 1970s material (plus songs from A Scarcity of Miracles and new compositions). In early 2016, it was announced that former Lemon Trees/Beady Eye drummer Jeremy Stacey would substitute for Rieflin on that year's tour while the latter was on sabbatical. King Crimson has since continued touring as a seven- or eight-piece unit with Stacey as a permanent member on drums and keyboards, plus Rieflin (when available) on keyboards and \"fairy dusting.\" Rieflin last played with Crimson on the 2018 tours; he died 24 March 2020.", "* 2011 : A Scarcity of Miracles (With Mel Collins & Jakko Jakszyk)"]}, {"page": "September 5", "response": ["*1947 – Mel Collins, Manx saxophonist and flute player "]}, {"page": "Pat Mastelotto", "response": ["|Stick Men feat. Mel Collins"]}, {"page": "Circus (disambiguation)", "response": ["* Circus, a band formed by Mel Collins"]}, {"page": "Camel (band)", "response": ["The band's fourth album, Moonmadness (1976), was the last to feature the original lineup. Mel Collins was added to the band on saxophone and flute for the subsequent tour. Drummer Ward was pushing for a move into jazz, which caused bassist Ferguson to quit the band in early 1977. Ferguson formed the band Headwaiter and later became a property developer.", "Richard Sinclair (formerly of Caravan) replaced Ferguson, and Mel Collins joined the band in an official capacity. This lineup released Rain Dances (1977) and Breathless (1978). The latter was the last album to feature Bardens, who announced his departure before the supporting tour. He was replaced by two keyboard players both recruited from Caravan: Dave Sinclair (cousin of Richard) and Jan Schelhaas. The Sinclair cousins both left the band after the tour, replaced by keyboardist Kit Watkins and bassist Colin Bass. This lineup recorded the more commercial I Can See Your House from Here (1979); the album's cover caused controversy with its image of a crucified astronaut looking at Earth."]}, {"page": "Slowhand", "response": ["* Mel Collins – saxophone"]}, {"page": "Private Dancer", "response": ["* Mel Collins – saxophone (5)"]}, {"page": "Bad Company (album)", "response": ["* Mel Collins – saxophones (6)"]}, {"page": "Clannad", "response": ["In 1985, Clannad released Macalla (Irish for Echo) which was recorded in Switzerland, England, and Ireland. It contained all original material except one traditional song and yielded the group a hit single \"In a Lifetime\", a duet with U2 singer Bono which begins with Máire being heard teaching Gaelic to Bono during the introduction.'\"Easter-egg\" during first 20 seconds of \"Lifetime\"', Máire explains during public IRC chat with fans, 2003 The album features numerous backing musicians who have continued to tour with them, including ex-King Crimson saxophonist Mel Collins, Moving Hearts' guitarist Anthony Drennan, and drummer Paul Moran. Also on board was producer Steve Nye, who oversaw the pop-flavoured \"Closer to Your Heart\" and the ballad \"Almost Seems (Too Late to Turn)\" and became hit singles, the latter serving as the Children in Need charity single in 1985.", "The album Lore (1996) gave some thought to the Native American Indians. On \"Trail of Tears\", when Noel Duggan imagines how it felt to be exiled from one's ancestral land, he was also thinking about these people and their connection with the Irish. It opens with \"Croí Cróga\" ('braveheart' in English) which was written as a theme tune for the Mel Gibson film Braveheart which, for unknown reasons, never made it onto the soundtrack. Lore features American drummer Vinnie Colaiuta and Mel Collins. It contained a strong jazz element, with songs such as \"Seanchas\" blending contemporary sounds with traditional Irish music and the Irish language. Clannad toured Europe, Japan, Australia, and New Zealand in 1996 to promote the Lore album, but due to apparent disagreements with Atlantic Records, plans to tour the USA were scrapped. In 1996, they received a lifetime achievement award from the Irish recording industry (the IRMA)."]}, {"page": "Boz Burrell", "response": ["In 1973 Burrell, Wallace and Mel Collins reunited with Sinfield for his solo effort, Still. They also went on to form Snape with CCS's Alexis Korner and Peter Thorup, who had been on tour with King Crimson in the states the previous year, releasing the studio album, Accidentally Born in New Orleans, and a live album, Live on Tour in Germany. In 1974 Burrell featured with Chapman Whitney Streetwalkers along with other members of Family and King Crimson."]}, {"page": "Steve Marriott", "response": [" By this time Lane had begun to use a wheelchair. After an emotional meeting, Marriott suggested they gig together. They got together with Jim Leverton, Mick Weaver, Dave Hynes, Zoot Money and Mel Collins to record an album called Majik Mijits. The album features songs by Lane and Marriott, though none were co-written.", "* Accidentally born in New-Orleans from the group Snape, starring Boz Burrell, Mel Collins and Ian Wallace (1972) Steve plays organ on the song Country shoes. "]}, {"page": "Peter Sinfield", "response": ["In 1973, Sinfield formed a band provisionally called A Bowl of Soup and featuring Phil Jump on keyboards, Richard Brunton on guitar, Allan \"Min\" Mennie on drums, Steve Dolan on bass, and Sinfield himself on vocals, guitar, and synthesizer. A Bowl of Soup were booked to record an album at Command Studios. This album, Still, was ultimately credited as a Pete Sinfield solo album, and in addition to the five members of A Bowl of Soup it featured input from numerous former (Greg Lake, Mel Collins, Ian Wallace), and future (John Wetton) Crimson alumni. While working on Still, he was approached by Emerson, Lake & Palmer, who needed a lyricist of Sinfield's calibre. Sinfield put it more bluntly: \"Greg [Lake] called me. 'I need help with the lyrics.' And, boy, did he need help.\" Still was originally released on ELP's own Manticore label in 1973, but Sinfield found himself subsumed into Emerson, Lake & Palmer. Already having a fear of the stage which he had little time to overcome due to writing demands, his solo career was put on hold and he worked with ELP for the next few years.", "Upon his return to London in 1980, his publisher introduced him to Andy Hill, a composer and fellow songwriter. He and Sinfield collaborated on such hits as \"The Land of Make Believe\" by Bucks Fizz, which reached No. 1 in the UK Singles Chart, and became one of the biggest-selling hits of the decade. While re-educating himself to adapt to the pop music industry with the help of Hill, he returned to Spain, where he was already established in the communities within Ibiza and Barcelona, and as his career progressed, moved into a house in Majorca. At this time, he appeared on Spanish television programme Musical Express, where he was interviewed and performed a set with Boz Burrell, Tim Hinkley, Michael Giles, Bobby Tench, Mel Collins, and Gary Brooker."]}, {"page": "Tony Levin", "response": ["On September 24, 2013, Levin was officially announced as a member of the 8th incarnation of King Crimson, alongside band founder Robert Fripp, guitarist Jakko Jakszyk, the returning Mel Collins on saxophone, and drummers Pat Mastelotto, Gavin Harrison and new member Bill Rieflin. The group toured the United States in the autumn of 2014 and has continued to tour throughout the world since, including 2019 when King Crimson celebrated its 50th anniversary.", "|Roppongi - Live In Tokyo 2017 (Featuring Mel Collins)"]}, {"page": "Peter Banks", "response": ["Work in the second half of the 1970s included a number of session appearances, on separate albums by Lonnie Donegan and Jakob Frímann Magnússon. Banks made an appearance on Romeo Unchained, a 1986 album by Tonio K. He also worked with Ian Wallace in The Teabags, including Jackie Lomax on vocals and Kim Gardner on bass, the two played before with Tony Kaye's Badger, David Mansfield on guitar and Mel Collins on sax and flute. No recordings came out of that."]}, {"page": "Larks' Tongues in Aspic", "response": ["At the end of the tour to promote King Crimson's previous album, Islands, Fripp had parted company with the three other members of the band (Mel Collins, Boz Burrell and Ian Wallace). Collins has stated that he was asked to stay on with the new lineup of the band, but that he decided not to continue. The previous year had also seen the ousting of the band's lyricist and artistic co-director Peter Sinfield. Fripp had cited a developing musical (and sometimes personal) incompatibility with the other members, and was now writing starker music drawing less on familiar American influences and more on influences such as Béla Bartók and free improvisation."]}, {"page": "Alchemy: Dire Straits Live", "response": ["\"Tunnel of Love\" is preceded by an otherwise unrecorded instrumental (actually faded in from the extended coda of \"Portobello Belle\", which was left off the album), already played on the 1981 tour, but here re-arranged to showcase Mel Collins' saxophone. It is followed by the brief \"Carousel Waltz\" intro and standard version of the song (with improvisation sections).", "* Mel Collins – saxophone"]}, {"page": "In Flight (Alvin Lee album)", "response": ["* Mel Collins  -  saxophones, flute"]}, {"page": "Martin Barre", "response": ["On one track of 1994's A Trick of Memory, Barre plays a guitar given to him by friend Mark Mancina. On the album, King Crimson alumnus Mel Collins plays the saxophone, and Fairport Convention's Maartin Allcock and Ric Sanders appear on a couple of tracks, and Andy Giddings plays Hammond organ. According to the AllMusic review: \"the dominant sound is Barre's guitars, soaring, crunching, grinding, or noodling gently, either blues or English folk tunes\"; to the reviewer, the album is \"a decent debut album\". A Summer Band was released only in limited edition."]}, {"page": "Gone to Earth (David Sylvian album)", "response": ["*Mel Collins – soprano saxophone (B2, B3)"]}, {"page": "Desire (Bob Dylan album)", "response": ["The following day, Dylan returned to Studio E with roughly half the number of musicians, retaining Stoner, Rivera, Harris, Hugh McCracken, and Vinnie Bell as well as saxophonist Mel Collins and percussionist Jody Linscott of Kokomo. This time, they managed a usable take of the song \"Oh, Sister\", but the remainder of the session was deemed unacceptable."]}, {"page": "In the Wake of Poseidon", "response": ["Then-unknown Elton John was booked to sing on the recording sessions for In the Wake of Poseidon, but Fripp had second thoughts and cancelled the booking. Lake then agreed to sing on the recordings, negotiating to receive King Crimson's PA equipment as payment. He ended up singing on the band's early 1970 single \"Cat Food\" (but not on its B-side, \"Groon\") and on all but one of the album's vocal tracks. The exception was \"Cadence and Cascade\", which was sung by Fripp's old schoolfriend and teenage bandmate Gordon Haskell. An early mix of the song with Lake singing a guide vocal was unearthed and featured on the DGM site as a download. Other former members and associates returned – as session players only – for the Poseidon recordings, with all bass parts being handled by Peter Giles and Michael Giles drumming. Other key performers were Mel Collins (formerly of the band Circus) on saxophones and flute and jazz pianist Keith Tippett.", "* Mel Collins – saxophones , flute "]}, {"page": "Radio K.A.O.S.", "response": ["* Mel Collins – saxophones"]}, {"page": "Henry McCullough", "response": ["On 17 March 2015 a benefit concert for Henry McCullough was held at The Half Moon, Putney music venue, featuring Paul Carrack, Nick Lowe, Andy Fairweather Low, Suggs and Bobby Tench (who also performed with the backing band). The backing band was entitled Henry's Heroes and included Tim Hinkley, Mel Collins, Neil Hubbard and John Halsey and bass player Kuma Harada."]}, {"page": "Forty Licks", "response": ["*Mel Collins – saxophone on \"Miss You\""]}, {"page": "Girl You Know It's True", "response": ["* Mel Collins – saxophone"]}, {"page": "Islands (King Crimson album)", "response": ["Islands is the fourth studio album by English band King Crimson, released in December 1971 on the record label Island. Islands is the only studio album to feature the 1971-1972 touring line-up of Robert Fripp, Mel Collins, Boz Burrell and Ian Wallace. This would be the last album before an entirely new group would record the trilogy of Larks' Tongues in Aspic, Starless and Bible Black and Red between 1973-1974. This is also the last album to feature the lyrics of co-founding member Peter Sinfield.", "*Mel Collins – saxophones, flute, bass flute (6), backing vocals, production"]}, {"page": "Lizard (album)", "response": ["Haskell was previously a classmate of Robert Fripp at Queen Elizabeth's grammar school in Wimborne near Bournemouth, the pair having subsequently played together in the local band The League of Gentlemen. Haskell later contributed vocals to the King Crimson track \"Cadence and Cascade\" on In the Wake of Poseidon, after Greg Lake left the band to join Emerson, Lake & Palmer. Fripp asked Haskell to become an official member of King Crimson for the recording of Lizard. Another supporting musician on In the Wake of Poseidon, saxophonist/flautist Mel Collins was also asked to become a full-time member, as was drummer Andy McCulloch, who replaced Michael Giles. The group was then augmented with session musicians, including another In the Wake of Poseidon alumnus, the noted jazz pianist Keith Tippett, together with Yes vocalist Jon Anderson, and brass/woodwind players Robin Miller, Mark Charig, and Nick Evans.", "Collins, on the other hand, remained in King Crimson with Fripp and Sinfield for the recording of the group's next album, Islands. Haskell was replaced with Boz Burrell on bass guitar and vocals, while McCulloch was replaced with his sometime housemate Ian Wallace. The Islands line-up of the group would finally give some of the Lizard material a live airing, with \"Cirkus\" and \"Lady of the Dancing Water\" becoming part of King Crimson's touring repertoire. \"Cirkus\" would also later become part of the touring repertoire of the 21st Century Schizoid Band, whose members included Mel Collins and Jakko Jakszyk.", "*Mel Collins – saxophone, flute"]}, {"page": "Red (King Crimson album)", "response": ["Near the conclusion of King Crimson's 1974 US and Canada tour, the decision was made to ask David Cross to leave the band. EG, the band's management, urged Fripp not to tell Cross until after the final date of the tour, but he would not be able to do this anyway as Fripp would not return from the United States until after Cross would return to Europe. Fripp reached an agreement with EG management that they would tell Cross, \"on proviso that [Cross] was told that I objected to not telling him personally.\" Despite reaching this agreement, Cross would not be told by EG until the day before the recording of Red began. In his stead, the band brought back several contributors to past albums: Robin Miller on oboe, Marc Charig on cornet, former King Crimson members Ian McDonald and Mel Collins on saxophones, as well as an uncredited cellist and acoustic bassist.", "*Mel Collins – soprano saxophone "]}]}}