{"wiki_id": "http://www.wikidata.org/entity/Q364398", "itemLabel": "Neil Paterson", "itemDescription": "Scottish screenwriter (1916-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Paterson_(writer)", "wikipedia_page": {"main": "James Edmund Neil Paterson (31 December 1915 – 19 April 1995) was a Scottish writer of novels, short stories and screenplays. He won the 1959 Academy Award for Best Adapted Screenplay for Room at the Top. Before his success as a writer, he worked in journalism and had a brief career as an amateur footballer, playing for Buckie Thistle, Leith Athletic and Dundee United in the Scottish Football League.", "link_mentions": [{"page": "John Grierson", "response": ["Grierson joined the newly revived Films of Scotland Committee in 1955, also on the committee was Norman Wilson, Forsyth Hardy, George Singleton, C. A. Oakley and Neil Paterson. In 1956, Grierson was the president of the Venice Film Festival's jury; he was also jury president at the Cork Film Festival and the South American Film Festival in 1958. In 1957, Grierson received a special Canadian Film Award. Grierson wrote the script for, Seawards the Great Ship, it was directed by Hilary Harris and awarded an Academy Award in 1961, a feat for the Films of Scotland Committee."]}, {"page": "Academy Award for Best Adapted Screenplay", "response": ["| Neil Paterson"]}, {"page": "Room at the Top (1959 film)", "response": ["Room at the Top is a 1959 British film based on the 1957 novel of the same name by John Braine. It was adapted by Neil Paterson (with uncredited work by Mordecai Richler), directed by Jack Clayton (his feature-length debut), and produced by John and James Woolf. The film stars Laurence Harvey, Simone Signoret, Heather Sears, Donald Wolfit, Donald Houston, and Hermione Baddeley.", "| Neil Paterson"]}, {"page": "1959 in film", "response": ["| Best Screenplay, Adapted || rowspan=2 colspan=2| Room at the TopNeil Paterson || rowspan=2| Orders to KillPaul Dehn || Room at the TopNeil Paterson"]}, {"page": "Crieff", "response": ["*Neil Paterson (1915–1995), Oscar-winning screenwriter, was a resident of Crieff until his death."]}, {"page": "Greenock", "response": ["Other Greenockians include the composers Hamish MacCunn and William Wallace, violinist Henri Temianka, musician John McGeoch, mathematician William Spence, poets Denis Devlin, W. S. Graham and Jean Adam, merchant Matthew Algie, actors Richard Wilson, David Ashton, Martin Compston and Stella Gonet, artists William Scott and Alison Watt, playwrights Bill Bryden, Neil Paterson and Peter McDougall, comedian Charles 'Chic' Murray, opera singer Hugh Enes Blackmore, broadcaster Jimmy Mack, American football player Lawrence Tynes, children's theatre performer Ruairidh Forde, PGA Pro golfer Colin Robinson, Antarctic explorer Henry Robertson 'Birdie' Bowers and portrait painter Leonard Boden."]}]}}