{"wiki_id": "http://www.wikidata.org/entity/Q36403988", "itemLabel": "Dan Wishart", "itemDescription": "association football player (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dan_Wishart", "wikipedia_page": {"main": "Daniel Alexander Wishart (born 28 May 1992) is an English professional footballer who plays as a defender for Hemel Hempstead on loan from Wealdstone.", "link_mentions": [{"page": "2017–18 Luton Town F.C. season", "response": ["Luton extended their unbeaten league run to six matches after a 2–0 win away to Forest Green Rovers, in which Sheehan gave Luton the lead in first-half stoppage time with a drilled shot in off the post. Stacey was sent off on 60 minutes after catching Dan Wishart with a high boot, before Hylton extended the lead in the 68th minute with a tap-in after capitalising on a slip from goalkeeper Bradley Collins in the penalty area. Jarvis joined National League club Boreham Wood on a one-month youth loan, while striker Michael Shamalo joined Southern League Division One East club Barton Rovers on work experience. Luton won 2–0 at home to Grimsby Town, ending Grimsby's four-match unbeaten run and saw them move four points clear at the top of the table. Berry scored from 25 yards to give Luton a 40th-minute lead, before Collins made it 2–0 with a header into the bottom corner from Sheehan's free kick in the 61st minute. This was followed by a 5–0 home victory over Swindon Town, in which Luton took the lead three minutes into the second half through Collins with a curling shot into the top-left corner. Hylton doubled the lead seven minutes later with a header, his 15th goal of the season, before Matthew Taylor scored an own goal on 66 minutes from a Collins cross. Cornick made it 4–0 with a powerful shot in the 72nd minute, and Elliot Lee finished the scoring six minutes from time from a low curling shot. Luton's 12-match unbeaten run came to an end after a 4–0 away defeat to Port Vale in their final match of 2017. An own goal scored by Mullins gave the home team the lead in the 23rd minute, and in the second half Tom Pope scored twice, the first coming in the 60th minute and the second coming in the 82nd minute, either side of Ben Whitfield's 70th-minute goal."]}, {"page": "2018–19 Forest Green Rovers F.C. season", "response": ["| 1 July 2018 || LB ||  || Dan Wishart || Sutton United || Free transfer || "]}]}}