{"wiki_id": "http://www.wikidata.org/entity/Q3640852", "itemLabel": "Lady Blanche Arundell", "itemDescription": "English noblewoman", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Blanche_Arundell", "wikipedia_page": {"main": "Lady Blanche Arundell (née Lady Blanche Somerset; 1583 or c. 1584 – 28 October 1649) was an English noblewoman, known as the defender of Wardour Castle, where she defended the castle for nearly a week with just 25 men and her maidservants against a force of 1300.", "link_mentions": [{"page": "1649", "response": ["** Lady Blanche Arundell, English defender of Wardour Castle (b. 1583)"]}, {"page": "Henry Arundell, 3rd Baron Arundell of Wardour", "response": ["He was baptised on 23 February 1607/8 at St Andrew, Holborn, London. On the death of his father, who had been mortally wounded at the Battle of Stratton,  on 19 May 1643 he succeeded to his estates and to his titles, which included that of Count of the Holy Roman Empire. Throughout his life a devoted Roman Catholic, he fought like his father  on the side of Charles I in the First English Civil War. In May 1643 the parliamentarians wrested his ancestral home Wardour Castle, in Wiltshire, from his mother Lady Blanche Arundell who was defending it. In the following September Arundell laid siege to the castle and its new occupiers and fought in the re-taking from the rebels. By springing a mine and ruining the building, he finally dislodged the enemy under General Edmund Ludlow in March 1644,:s:Arundell, Henry, third Baron Arundell of Wardour (DNB00) partly  destroying it to prevent it being used as a fortress."]}, {"page": "Wardour Castle", "response": ["The Arundells, led by Thomas Arundell, 1st Baron Arundell of Wardour, subsequently became known as some of the most active of the Roman Catholic landowners in England at the time of the Reformation; they were naturally Royalists in the English Civil War. During that conflict, Thomas Arundell, 2nd Baron Arundell of Wardour, was away from home on the King's business and had instructed his wife, Lady Blanche Arundell, aged 61, to defend the castle with a garrison of 25 trained fighting men."]}, {"page": "Women in warfare (1500–1699)", "response": ["* 1643: Lady Blanche Arundell defends Wardour Castle during the English Civil War.Cooper, Thompson. \"Arundell, Blanche, Lady.\" A New Biographical Dictionary: Containing Concise Notices of Eminent Persons of All Ages and Countries: and More Particularly of ... Great Britain and Ireland. London: Bell, 1873. googlebooks Accessed January 1, 2008"]}, {"page": "Lady Blanche Arundel", "response": ["#REDIRECT Lady Blanche Arundell"]}, {"page": "Lady Blanche Somerset", "response": ["#REDIRECT Lady Blanche Arundell"]}, {"page": "Blanche (given name)", "response": ["*Lady Blanche Arundell (1583 or c. 1584–1649), wife of Thomas Arundell, 2nd Baron Arundell of Wardour"]}, {"page": "Blanche Arundel", "response": ["#REDIRECT Lady Blanche Arundell"]}, {"page": "Blanche Somerset", "response": ["#REDIRECT Lady Blanche Arundell"]}, {"page": "Arundell family", "response": ["*Lady Blanche Arundell"]}, {"page": "Mary Gargrave", "response": ["John Finet described the reception of Isabelle Brûlart, the wife of French ambassador Gaspard Dauvet, Sieur des Marets, at Denmark House in December 1617. She arrived by coach at the old portico built by Protector Somerset on the Strand, rather than by boat on the Thames. He brought her and her servants to a chamber in the first court. Lady Blanche Arundell, Mistress Barbara Sidney (daughter of the Viscountess Lisle), Mistress Southwell of the queen's privy chamber, and Gargrave joined her. A gentleman usher then took Brûlart to the queen in the Privy Chamber.John Finet, Finetti Philoxenis (London, 1656), p. 40."]}, {"page": "Siege of Wardour Castle", "response": ["Wardour Castle in Wiltshire was besieged twice during the First English Civil War; once in May 1643, and then again between November 1643 and March 1644. During the first siege, a Parliamentarian force of around 1,300 men led by Sir Edward Hungerford attacked the castle, which was the home of Thomas Arundell, 2nd Baron Arundell of Wardour, a prominent Catholic and Royalist. Arundell was absent, fighting for King Charles at the time of the attack, and the defence was led by his wife, Lady Blanche Arundell, in command of 25 soldiers. The siege was started on 2 May, and lasted for a week before the Parliamentarians forced Lady Arundell to surrender on 8 May. The Parliamentarians garrisoned the castle with 75 men, led by Colonel Edmund Ludlow."]}, {"page": "Blanche Arundell", "response": ["#REDIRECT Lady Blanche Arundell"]}, {"page": "Mary Browne (courtier)", "response": ["Her second husband was William Arundell (d. 1653) of Horningsham, Wiltshire, the second son of Thomas Arundell, 1st Baron Arundell of Wardour, and Mary Wriothesley, the daughter of Henry Wriothesley, 2nd Earl of Southampton.Michael Questier, Catholicism and Community in Early Modern England (Cambridge, 2006), p. 525. His sister-in-law Lady Blanche Arundell was a prominent member of the queen's household.John Finet, Finetti Philoxenis (London, 1656), p. 40."]}]}}