{"wiki_id": "http://www.wikidata.org/entity/Q3644464", "itemLabel": "Brian Hopper", "itemDescription": "British saxophonist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Hopper", "wikipedia_page": {"main": "Brian Hopper (born 3 January 1943) is an English guitarist and saxophonist.\nHopper was born in Whitstable, Kent, England, and is the older brother of the late bassist Hugh Hopper. With Hugh, he was a member in the early Canterbury scene band Wilde Flowers. He also played saxophone on Soft Machine's album Volume Two and co-wrote several tracks on their eponymous debut.  The death of two bandmates in the early 1970s discouraged Hopper from pursuing a proper career in music, so he went into agricultural crop protection research and development instead.Only in the latter part of the 1990s, did Hopper re-emerge as an artist of contemporary as well as historical significance.  One of his projects was Canterburied Sounds, a four-CD compilation of archival Canterbury scene recordings from his private collection.", "link_mentions": [{"page": "Soft Machine", "response": ["| Brian Hopper"]}, {"page": "Robert Wyatt", "response": ["In 1962, Wyatt and Neidorf moved to Majorca, living near the poet Robert Graves. The following year, Wyatt returned to England and joined the Daevid Allen Trio with Allen and Hugh Hopper. Allen subsequently left for France, and Wyatt and Hopper formed the Wilde Flowers, with Kevin Ayers, Richard Sinclair and Brian Hopper. Wyatt was initially the drummer in the Wilde Flowers, but following the departure of Ayers, he also became lead singer."]}, {"page": "Hugh Hopper", "response": ["Starting in 1963 as bassist with The Daevid Allen Trio, alongside drummer Robert Wyatt, he alternated between free jazz and rhythm and blues. In 1964 with Brian Hopper (his brother), Robert Wyatt, Kevin Ayers and Richard Sinclair he formed The Wilde Flowers, a pop music group.  Although they never released any records during their existence (a compilation was released 30 years later), The Wilde Flowers are acknowledged as the founders of the Canterbury scene and spawned its two most important groups, Soft Machine and Caravan.", "*2004: Brian Hopper: If Ever I Am"]}, {"page": "Just Desserts", "response": ["* Just Desserts, a 2006 album by Brian Hopper and Robert Fenner"]}, {"page": "Volume Two (The Soft Machine album)", "response": ["In the lyrics to \"Have You Ever Bean Green?\" Soft Machine thanks the Jimi Hendrix Experience, with whom they had just toured through the United States in 1968; as Hendrix's opening band they were exposed to large crowds for the first time. The title of this song is a play on the chorus lyric in the Hendrix song \"Are You Experienced?\", \"Have you ever been experienced?\". Wyatt thanks \"Brian\" (Brian Hopper) and \"George\" (engineer George Chkiantz) in the next section, Pataphysical Introduction – Pt. 2, which also includes a quote of \"These Foolish Things.\" The title of the closing suite, \"Esther's Nose Job\", is derived from a chapter in Thomas Pynchon's novel V.", "*Brian Hopper – soprano and tenor saxophone"]}, {"page": "The Wilde Flowers", "response": ["The Wilde Flowers were an English psychedelic rock band from Canterbury, Kent. Formed in 1964, the group originally featured lead vocalist Kevin Ayers, lead guitarist and co-lead vocalist Brian Hopper, rhythm guitarist Richard Sinclair, bassist Hugh Hopper and drummer Robert Wyatt. Despite not releasing any material during their brief three-year tenure, the band are generally considered to be the originators of the Canterbury scene. After their breakup in 1969, the group's members went on to form numerous key bands within the scene, including Soft Machine, Caravan and Camel.", "After several years of jamming together, the Wilde Flowers were officially formed in 1964 by lead vocalist Kevin Ayers, lead guitarist, saxophonist and vocalist Brian Hopper, rhythm guitarist and vocalist Richard Sinclair, bassist and saxophonist Hugh Hopper, and drummer and vocalist Robert Wyatt. The group performed a series of live shows before their first recording session in March 1965, at which they tracked Hugh Hopper's \"Memories\", Ayers's \"She's Gone\", and cover versions of Bukka White's \"Parchman Farm\" and Chuck Berry's \"Almost Grown\". Shortly after the sessions, Ayers left to start working with Daevid Allen ahead of the formation of Soft Machine, with vocals at a session the following month performed by Wyatt before a permanent replacement was found.", "In April, Ayers's place was taken by vocalist and harmonica player Graham Flight, his roommate. With their new frontman, the Wilde Flowers recorded their second batch of songs in the summer of 1965, including two tracks by Hugh Hopper, one by Brian Hopper and one by Wyatt. By September, both Flight and Sinclair had left, with Wyatt taking over on lead vocals and Richard Coughlan joining on drums. During the spring of 1966, this four-piece lineup of the band performed at the Melody Maker Rock/Folk Contest, as well as recording seven more tracks, most of which were written by Hugh Hopper.", "*Brian Hopper – lead guitar ; saxophone, vocals "]}, {"page": "Richard Sinclair", "response": ["Born in Canterbury, England, both his father (Dick Sinclair) and grandfather (also named Dick Sinclair) were musical entertainers around Canterbury.  Richard was introduced to the ukulele at age 3 and the guitar at 6, and was only 15 when he met Hugh and Brian Hopper when they came to see his dad's danceband.  By the following year Sinclair was playing guitar (and occasionally singing) in the root Canterbury band The Wilde Flowers.   In 1968 he became a founding member of Caravan, switching to bass guitar and sharing lead vocals with Pye Hastings. His compositional output came to the fore on the band's third album, the classic In the Land of Grey and Pink, on which he wrote and sang the title track, \"Golf Girl\" and the epic \"Winter Wine\". Sinclair left Caravan in 1972 to form Hatfield and the North with ex-Delivery members Phil Miller and Pip Pyle, lending his distinctive, quintessentially English voice and increasingly impressive bass playing skills to their two albums, and writing some of their best-loved songs, \"Share It\", \"Let's Eat (Real Soon)\" (both with lyrics by Pip Pyle) and \"Halfway Between Heaven And Earth\". "]}, {"page": "Ruth Is Stranger Than Richard", "response": ["The follow-up to Rock Bottom, for which Wyatt had written all of the music and lyrics, Ruth... consisted of Wyatt's adaptations and arrangements of other people's music (either friends – Phil Manzanera, Fred Frith, Mongezi Feza, former Wilde Flowers bandmate Brian Hopper – or influences – Charlie Haden) with Wyatt adding his own lyrics in much the same way as he had done on Matching Mole's Little Red Record. Apart from \"Sonia\", recorded for the shelved \"Yesterday Man\" single in October 1974 (again with Nick Mason as producer), the entire album was recorded and mixed at Virgin's The Manor Studio with Wyatt himself handling production duties. Much of the album features Wyatt (on lead vocals and keyboards) backed by a \"band\" consisting of bassist Bill MacCormick, drummer Laurie Allan and saxophonists George Khan and Gary Windo, with Brian Eno adding his own idiosyncratic \"anti-jazz\" touch."]}, {"page": "Mike Ratledge", "response": ["Ratledge was born in Maidstone, Kent, the son of a Canterbury secondary modern school headmaster.Different Every Time: The Authorised Biography of Robert Wyatt, Marcus O'Dair, Serpent's Tail, 2014Soft Machine: Out-bloody-rageous, Graham Bennett, SAF Publishing Ltd, 2005, p. 30 As a child, he was educated in classical music, the only kind of music played in his parents' home. He learned to play the piano, and with his friend Brian Hopper, whom he had met at Simon Langton Grammar School for Boys in Canterbury, played classical piano and clarinet pieces."]}, {"page": "1943 in jazz", "response": ["* 3 – Brian Hopper, British guitarist and saxophonist."]}, {"page": "Hopper (surname)", "response": ["*Brian Hopper (born 1983), English musician"]}, {"page": "Canterburied Sounds", "response": ["Canterburied Sounds is a series of four CDs of archival Canterbury scene recordings compiled from the private collection of Brian Hopper.  The set includes some of the earliest-known recordings of Caravan, Soft Machine, Robert Wyatt, and Wilde Flowers.", "The notes are excerpted from extensive comments on each track by Brian Hopper.", "| 2 || Mummie || Robert Wyatt & Brian Hopper || Robert Wyatt & Brian Hopper ||\"An improvised duet of guitar & vocals, switching speeds on the tape recorder whilst recording\"|| late 1962/early 1963 || 4:31", "| 4 || Orientasian || Brian Hopper & Robert Wyatt || Brian Hopper ||\"duet for my newly-acquired soprano sax and Robert Wyatt on electric guitar\"|| 1967/68 || 4:03", "| 7 || Man in a Deaf Corner || Brian Hopper, Hugh Hopper, Mike Ratledge, & Robert Wyatt || Brian Hopper, Hugh Hopper, Mike Ratledge, & Robert Wyatt ||\"Part of a long and spontaneous improvisation, with Mike showing a heavy Cecil Taylor influence\"|| late 1962/early 1963 || 5:05", "| 8 || If I Ever Leave You || Zobe || Brian Hopper ||“From a live performance by my late sixties/early seventies band Zobe”|| 1970 || 6:15", "| 11 || Belsize Parked || Brian Hopper, Hugh Hopper, & Robert Wyatt || Brian Hopper, Hugh Hopper, & Robert Wyatt ||“Wellington House provided the opportunity for us to ‘blow’ for hours and develop a rare musical intimacy”|| late 1963/early 1964 || 9:19", "| 1 || Carazobe || Caravan & Zobe || John Larner, Pye Hastings & Brian Hopper ||\"Pye suggested several members of Zobe join in on an extended blow during a joint gig in East Kent\"|| 1970 || 16:19", "| 4 || Moorish || Robert Wyatt & Brian Hopper || Robert Wyatt & Brian Hopper ||\"A semi-improvised piece with an Iberian feel, with Robert switching between piano, cornet and finally guitar\"|| late 1962/early 1963 || 8:33", "| 11 || Where But For Caravan Would I || Caravan || Brian Hopper & Pye Hastings ||“A song adapted from one of my early compositions entitled How Many Tears”|| 1969 || 11:59", "| 1 || Slow Walkin’ Talk || Robert Wyatt & Jimi Hendrix || Brian Hopper ||“Robert was laying down demo tracks of organ, drum and vocal when Jimi wandering in and suggested doing the bass on Noel’s bass”|| October 1968 || 3:02", "| 6 || The Pieman Cometh || Zobe || Brian Hopper ||“Written at the end of the Wilde Flowers era, although never performed by them”|| summer 1970 || 6:02", "| 7 || Liu-Ba || Robert Wyatt, Brian Hopper, Hugh Hopper plus unknown guitarist || Brian Hopper, Hugh Hopper & Robert Wyatt ||“Another session with the unknown guitarist, although there are suggestions it could be Daevid Allen”|| 1963 || 8:36", "| 8 || Kansas City/Rip It Up || Brian Hopper, Hugh Hopper & Pete Lawson || Jerry Leiber and Mike Stoller/Richard Penniman ||“These represent the earliest recordings on Canterburied Sounds — Hugh had only just purchased his first bass”|| 1962 || 2:25", "| 9 || That’s Alright Mama || Brian Hopper & Hugh Hopper || Arthur Crudup ||“This is about the only recording of just Hugh and myself playing and singing together”|| 1962 || 2:13", "| 10 || Tanglewood Tails || Brian Hopper, Hugh Hopper & Robert Wyatt || Brian Hopper, Hugh Hopper & Robert Wyatt ||“One of the more musically successful trio encounters — Robert is the drummer I always have a memory of”|| 1963 || 16:02", "| 11 || The Big Show/Central Park West/Songs || Zobe || Brian Hopper/John Coltrane/Brian Hopper ||“Another rehearsal track, unfortunately one of the last made by the band”|| 1970 || 16:43", "| 1 || Slow Walkin’ Talk || Zobe || Brian Hopper ||“Another version from a Zobe rehearsal”|| 1970 || 5:43", "| 2 || Some-of-the-Time || Mike Ratledge, Brian Hopper, Robert Wyatt & unknown guitarist", "|| Mike Ratledge, Brian Hopper & Robert Wyatt ||“Thinly-veiled variations on Gershwin’s Summertime (again!)”|| 1963/1964 || 14:45", "| 5 || Dalmore Rode || Brian Hopper & Robert Wyatt || Brian Hopper & Robert Wyatt ||“Robert is heard extending even further the sonic capabilities of the cello”|| 1963/1964 || 7:56", "| 8 || Cecilian || Brian Hopper, Hugh Hopper, Mike Ratledge & Robert Wyatt || Brian Hopper, Hugh Hopper, Mike Ratledge & Robert Wyatt ||“Mike in his most intense Cecil Taylor style, with Hugh in his first recorded bass solo!”|| late 1962 || 12:00"]}, {"page": "List of years in jazz", "response": ["* 1943 in jazz, deaths of Armand J. Piron, Ben Bernie, Corky Cornelius, Fats Waller, Leon Roppolo, Min Leibrook, Tamara Drasin, Tiny Parham, Vaughn De Leath, and Zue Robertson; births of Al Foster, Alan Lawrence Turnbull, Barry Altschul, Ben Sidran, Billy Harper, Bjørn Krokfoss, Bobby Enriquez, Brian Hopper, Butch Thompson, Calvin Keys, Claudio Mattone, Claudio Slon, Clyde Stubblefield, Conny Bauer, David Horler, Dick Halligan, Didier Malherbe, Duncan Swift, Edu Lobo, Felix Slováček, Frank Lowe, Fred Tompkins, Fred Wesley, Freddie Waits, Fritz Pauer, Garrett List, Gary Burghoff, Gary Burton, Gavin Bryars, George Benson, Georgie Fame, Gerry Niewood, Grover Washington Jr., Howie Smith, Jack Bruce, Jerry Rusch, Jiggs Whigham, Jon Christensen, Joni Mitchell, Keith Relf, Kenny Barron, Kjell Öhman, Larry Coryell, Laurie Allan, Leny Andrade, Lucio Dalla, Maarten Altena, Maceo Parker, Manfred Eicher, Marcos Valle, Mayuto Correa, Michael Mantler, Michal Urbaniak, Newman Taylor Baker, Noah Howard, Pete Cosey, Pete Minger, Peter Boothman, Peter Lipa, Phil Lee, Pino Presti, Richard Anthony Hewson, Richard Wright, Richie Pratt, Ricky May, Skip Prokop, Steve Gilmore, Steve Potts, Sven-Åke Johansson, Ted Milton, Terry Smith, Thorgeir Stubø, Tony Campise, Urszula Dudziak, Valery Ponomarev, Vivian Stanshall, Volker Kriegel, Webster Lewis, Weldon Irvine, Willie Murphy, and Winston Mankunku Ngozi."]}, {"page": "Hopper, Brian", "response": ["#redirectBrian Hopper"]}, {"page": "List of Soft Machine and spin-off band members", "response": ["|Brian Hopper"]}, {"page": "Soft Machine discography", "response": ["| Brian Hopper", "| Voiceprint Records released four CDs containing several tracks by various musicians from the Canterbury scene (mainly from the Soft Machine and the Caravan bands), compiled and with notes by Brian Hopper. The four single CDs are re-released in 2013 in a boxed set.", "| Re-issue in a single 4 CDs edition of the four titles previously released in 1998 by Brian Hopper on Voiceprint.", "| Eight tracks recorded live in 1963 in London, with Brian Hopper (sax), Hugh Hopper (cello, bass), Robert Wyatt (drums, voice), Kevin Ayers (bass, voice), Mike Ratledge (organ), Daevid Allen (guitar). These tracks are also in Man in a Deaf Corner (2001, 2 CD) as tracks 1.01–1.06 in a different remix."]}]}}