{"wiki_id": "http://www.wikidata.org/entity/Q3644590", "itemLabel": "Bridget Wishart", "itemDescription": "English singer and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Bridget_Wishart", "wikipedia_page": {"main": "Bridget Wishart (born 25 February 1962) is an English vocalist, musician and performance artist. She was a member of English rock band Hawkwind from 1989 to 1991. Wishart was the first woman to sing lead vocals in Hawkwind, and is the band's only singing frontwoman in their history. She is an ongoing member of Spirits Burning (since 2007), and the Chumley Warner Brothers live duo (with partner Martin Plumley).", "link_mentions": [{"page": "Hawkwind", "response": ["Bridget Wishart, an associate of Chadwick's from the festival circuit, also joined to become the band's one and only singing front-woman, the band had been fronted in earlier days by Stacia but only as a dancer. This band produced two albums, 1990's Space Bandits and 1991's Palace Springs and also filmed a one-hour appearance for the Bedrock TV series with dancer Julie Murray-Anderson, who performed with Hawkwind between 1988 and 1991."]}, {"page": "Electric Tepee", "response": ["After a European tour in March and April 1991, long-standing bass guitarist and keyboardist Harvey Bainbridge chose to leave the group. Vocalist Bridget Wishart would also end her association with the group in September. The group would go on to operate as a three piece of guitarist Dave Brock, bassist Alan Davey and drummer Richard Chadwick, making heavy use of sequencers, synthesisers and computers, both in the studio and live. The style of Electric Tepee is predominately space rock, with elements of trance, ambient and techno."]}, {"page": "Wishart", "response": ["* Bridget Wishart (b. 1962), English vocalist, musician, and performance artist  "]}, {"page": "Don Falcone", "response": ["Don Falcone (born November 5, 1958) is an American producer and multi-instrumentalist, and the guiding light behind the Spirits Burning space-rock collective. In Spirits Burning and other offshoot bands and projects, his primary collaborations have been with Albert Bouchard, Bridget Wishart, Cyrille Verdeaux, Daevid Allen, and English writer and musician Michael Moorcock.", "In 2017, Falcone performed live with Spirits Burning, alongside Steve Bemand, Richard Chadwick, Kev Ellis, Colin Kafka, Martin Plumley, and Bridget Wishart. Falcone played keyboards and also sang lead vocals on two songs.", "Falcone and Bridget Wishart (formerly of Hawkwind) have collaborated in Spirits Burning (including CDs released under the name Spirits Burning & Bridget Wishart), plus have an instrumental project called Astralfish."]}, {"page": "Noh Poetry Records", "response": ["Their first release was \"Kamarupa,\" by Spaceship Eyes (Falcone's electronic solo project). Other Falcone bands and projects released on Noh Poetry have included Astralfish (an instrumental project with Bridget Wishart, formerly of Hawkwind), Falcone & Palmer, Fireclan (with former members of Melting Euphoria), Grindlestone, Quiet Celebration, and Thessalonians (which included Kim Cascone, Falcone, Paul Neyrinck, and Larry Thrasher).", "* Spirits Burning & Bridget Wishart “Bloodlines” (2021)", "* Spirits Burning & Bridget Wishart “Earth Born” (2020)"]}, {"page": "Astounding Sounds, Amazing Music", "response": ["\"Reefer Madness\" lyrics are inspired by the 1936 anti-marijuana propaganda film Reefer Madness. It was performed during the tour of the album, appearing on the live album Atomhenge 76, and remained in the set until the formation of the Hawklords in 1978. The song was added to the setlist in 1990/1 to be performed by Bridget Wishart, a version appearing on the live album California Brainstorm."]}, {"page": "Space Bandits", "response": ["By mid-1989, the group's line-up had changed once again. Guitarist Dave Brock, keyboardist Harvey Bainbridge, and bassist Alan Davey remained. Drummer Richard Chadwick had just established himself, while lead guitarist Huw Lloyd-Langton had left, his position occasionally being filled by former keyboardist Simon House providing lead lines on violin. In addition, singer Bridget Wishart had started to perform with the group. This new line-up recorded a 60-minute live performance at Lenton Lane television studios, Nottingham on 25 January 1990 for broadcast on the ITV late-night series Bedrock, later released as the video Live Legends.", "#\"Images\" (Bridget Wishart, Dave Brock, Alan Davey) – 9:34", "*Bridget Wishart – vocals"]}, {"page": "Palace Springs", "response": ["#\"Back in the Box\" (Harvey Bainbridge, Dave Brock, Alan Davey, Bridget Wishart) – 6:21", "*Bridget Wishart – vocals"]}]}}