{"wiki_id": "http://www.wikidata.org/entity/Q364461", "itemLabel": "Josh Lewsey", "itemDescription": "English Business Leadership, Officer and rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Josh_Lewsey", "wikipedia_page": {"main": "Owen Joshua Lewsey MBE (born 30 November 1976) is an English former rugby union player who represented England and the British and Irish Lions. Lewsey is a former British Army Officer.", "link_mentions": [{"page": "November 30", "response": ["*  1976   – Josh Lewsey, English rugby player"]}, {"page": "Wasps RFC", "response": ["During the 2007–08 season, Wasps went from 10th in the league during October, to beat Leicester Tigers in the Guinness Premiership Final. This sealed a dream send-off for the retiring Lawrence Dallaglio at Twickenham. Wasps won 26–16 thanks to penalties by Mark van Gisbergen and tries by Josh Lewsey and Tom Rees to become the English 2008 champions. Wasps have now won six league titles in all, equal with Bath and just one behind Leicester.", "| Stuart Abbott, Lawrence Dallaglio, Josh Lewsey, Simon Shaw, Joe Worsley", "| Lawrence Dallaglio, Josh Lewsey, Tom Rees, Paul Sackey, Simon Shaw, Joe Worsley, Phil Vickery (c)", "* 2005: Josh Lewsey, Matt Dawson, Lawrence Dallaglio"]}, {"page": "2005 British & Irish Lions tour to New Zealand", "response": ["|Josh Lewsey", "The first tour match was against the Bay of Plenty Steamers on 4 June in Rotorua. The Lions started the match strongly, with Josh Lewsey scoring a try after two minutes and then a second four minutes later. The Lions were up 17–0 after 11 minutes, but the Steamers recovered for a 17–17 half-time score. The Lions controlled the second half and won 34–20. A significant injury was the fractured ankle suffered by experienced back-rower Lawrence Dallaglio, who had to withdraw from the tour."]}, {"page": "Matt Perry (rugby union)", "response": ["Aged 23, Perry beat Jonathan Webb's record to become England's most capped full back with 35 caps in the position, a record that has since been overtaken by Mike Brown. Perry went on the 2001 British & Irish Lions tour to Australia, playing in all three tests. A back injury and loss of form saw him dropped from the England squad for Iain Balshaw; he later made way for both Jason Robinson and Josh Lewsey. Perry made his last appearance for England in 2001 when he played against France."]}, {"page": "Middlesex Sevens", "response": ["The Middlesex Sevens has seen many notable great players take the field including Waisale Serevi, Eric Rush, Lawrence Dallaglio, Henry Paul, Robbie Paul, Clive Woodward, Will Carling, JPR Williams, Prince Alexander Obolensky, Frank Whitcombe, David Sole, Va'aiga Tuigamala, Martin Offiah, Ben Gollings, Simon Amor, David Strettle, Josh Lewsey, Andy Ripley and Ollie Phillips amongst others."]}, {"page": "Mark Cueto", "response": ["Cueto was a prominent member of England's 2007 Rugby World Cup in France. He started the first match of England's defence of the title at Full-back against the USA. He also played in England's embarrassing 36–0 defeat to South Africa. Having been dropped for the next match against Samoa, he was installed to the English defence for the encounter with Tonga, which ensured England's progression through to the quarter-final stage. He was left out of the surprise quarter-final victory against Australia and the even more surprising semi-final victory over France due to a niggling injury. During the semi-final, England wing Josh Lewsey suffered a pulled hamstring and was forced to miss the final."]}]}}