{"wiki_id": "http://www.wikidata.org/entity/Q3646779", "itemLabel": "Lady Margaret Seymour", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Margaret_Seymour", "wikipedia_page": {"main": "Lady Margaret Seymour (1540 – ?) was an influential writer during the sixteenth century in England, along with her sisters, Anne Seymour, Countess of Warwick and Lady Jane Seymour, including of the Hecatodistichon\n. She was the daughter of Edward Seymour, 1st Duke of Somerset, who from 1547 was the Lord Protector of England after the death of Henry VIII and during the minority of Margaret's first cousin, Edward VI. She was thus the niece of Henry VIII's third wife, Queen Jane Seymour.", "link_mentions": [{"page": "Edward Seymour, 1st Duke of Somerset", "response": ["**Lady Margaret Seymour (born 1540), a noted author"]}, {"page": "Anne Seymour, Duchess of Somerset", "response": ["* Lady Margaret Seymour (1540 – ?) noted Elizabethan author"]}, {"page": "Lady Jane Seymour", "response": ["Lady Jane Seymour (c.1541 – 19 March 1561)Alison Plowden, Lady Jane Grey (History Press, 2004), p 173 was an influential writer during the sixteenth century in England, along with her sisters, Lady Margaret Seymour and Anne Seymour, Countess of Warwick.Oxford Dictionary of National Biography, Seymour, Lady Jane (1541–1561), writer, by Jane Stevenson  Their brothers were Edward Seymour, 1st Earl of Hertford and Thomas Seymour, 1st Baron Seymour of Sudeley.  They were the children of Edward Seymour, 1st Duke of Somerset, who from 1547 was the Lord Protector of England after the death of King Henry VIII and during the minority of Jane's first cousin, King Edward VI. She was baptised 22 February 1541, her godmothers were Lady Mary (the King's daughter, at the time declared illegitimate but later to become queen) and Katherine Howard, the fifth wife of Henry VIII, and queen at the time. Some sources say that Thomas Cromwell was her godfather, but this cannot be correct as he had been executed the year before.  Jane was thus the niece of Henry VIII's third wife, Queen Jane, whom she was probably named after. She was the sole witness to the secret marriage of her brother Edward to Lady Katherine Grey (a potential heir to Queen Elizabeth I) in 1560. She died a year later, aged 20, probably of tuberculosis."]}, {"page": "Anne Seymour, Countess of Warwick", "response": ["Anne Dudley (née Seymour) Countess of Warwick (1538–1588) was a writer during the sixteenth century in England, along with her sisters Lady Margaret Seymour and Lady Jane Seymour.Jane Stevenson: \"Seymour, Lady Jane (1541–1561)\", Oxford Dictionary of National Biography, Oxford University Press, 2004 (subscription required) Retrieved 2010-04-04 "]}, {"page": "Margaret Seymour (writer)", "response": ["#REDIRECT Lady Margaret Seymour"]}]}}