{"wiki_id": "http://www.wikidata.org/entity/Q3666338", "itemLabel": "Charles Barrett Lockwood", "itemDescription": "British surgeon and anatomist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Barrett_Lockwood", "wikipedia_page": {"main": "Charles Barrett Lockwood (23 September 1856 – 8 November 1914) was a British surgeon and anatomist who practiced surgery at St. Bartholomew's Hospital in London. Lockwood was a member of the Royal College of Surgeons.\nLockwood is remembered for his surgical work with femoral and inguinal hernias. He developed an infra-inguinal approach for femoral hernia operations that is known today as the \"low approach\" or \"Lockwood's operation\". In 1893, he published an important book titled \"Radical Cure of Femoral and Inguinal Hernia\". \nHe first conceived the idea of an Anatomical Society in 1887, acted as their first treasurer and was elected president of the society for 1901 to 1903. The \"Lockwood's suspensory ligament\" of the eye is named after him. This structure is the thickened area of contact between Tenon's capsule and the sheaths of the inferior rectus and inferior oblique muscles. This ligament is responsible for maintaining the position of the eyeball in its normal upward and forward position within the orbit.", "link_mentions": [{"page": "List of human anatomical parts named after people", "response": ["* Lockwood's ligamentCharles Barrett Lockwood"]}, {"page": "Charles Lockwood", "response": ["* Charles Barrett Lockwood (1856–1914), British surgeon and anatomist"]}, {"page": "Tenon capsule", "response": ["Charles Barrett Lockwood described a thickening of the lower part of the Tenon capsule, which he named the suspensory ligament of the eye. It is slung like a hammock below the eyeball, being expanded in the center, and narrow at its extremities which are attached to the zygomatic and lacrimal bones respectively."]}, {"page": "Suspensory ligament of eyeball", "response": ["It is named for Charles Barrett Lockwood."]}, {"page": "Anatomical Society", "response": ["The society was suggested in early 1887 by Charles Barrett Lockwood, a surgeon and anatomist at St Bartholomew's Hospital, London and the first meeting was held on 6 May 1887. Lockwood was elected as Secretary and Sir George Murray Humphry, Professor of Anatomy and the first Professor of Surgery at Cambridge University, as first President of the society. Two resolutions were adopted: “That an Anatomical Society be founded, and that it be called the Anatomical Society of Great Britain and Ireland” and “That the scope and object of the Society be the Anatomy, Embryology and Histology of Man and of Animals in so far as they throw light upon the structure of Man”."]}, {"page": "Lockwood's sign", "response": ["Lockwood's sign is a medical sign that indicates Crohn's disease and/or chronic appendicitis. This sign is named after the English surgeon and anatomist, Charles Barrett Lockwood, who stated that:\"The patient lies on his back with his head raised on a pillow and his knees drawn up, so that the superficial abdominal muscles are relaxed. The surgeon sits down near his right side and palpates the right iliac region near McBurney's spot with the three inner fingers of his left hand. If he feels a trickle of flatulence passing his fingers and if this can be often repeated after waiting a half to one minute, or a little longer, the patient has either a chronically inflamed appendix or adhesions near it.\" "]}]}}