{"wiki_id": "http://www.wikidata.org/entity/Q366399", "itemLabel": "Ewen Montagu", "itemDescription": "British intelligence analyst", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewen_Montagu", "wikipedia_page": {"main": "Ewen Edward Samuel Montagu  (19 March 1901 – 19 July 1985) was a British judge, Naval intelligence officer and author.\nHe is best known for his leading role in Operation Mincemeat, a critical military deception operation which misdirected German forces' attention away from the Allied Invasion of Sicily in Operation Husky.", "link_mentions": [{"page": "Clifton Webb", "response": ["The British film The Man Who Never Was (1956) featured Webb playing the part of Royal Navy Lt. Cmdr. Ewen Montagu in the true story of Operation Mincemeat, the elaborate plan to deceive the Axis powers about the Allied invasion of Sicily during World War II. In Boy on a Dolphin (1957), second-billed to Alan Ladd, with third-billed Sophia Loren, he portrayed a wealthy sophisticate who enjoyed collecting illegally obtained Greek antiquities. In a nod to his own identity, the character's name was Victor Parmalee.", "|Lt. Cdr. Ewen Montagu"]}, {"page": "Allied invasion of Sicily", "response": ["To distract the Axis, and if possible divert some of their forces to other areas, the Allies engaged in several deception operations. The most famous and successful of these was Operation Mincemeat, conceived by Naval intelligence officer Ewen Montagu and RAF Squadron Leader Charles Cholmondeley. The British allowed a corpse, disguised as a British Royal Marines officer, to drift ashore in Spain carrying a briefcase containing fake secret documents. The documents purported to reveal that the Allies were planning \"Operation Brimstone\" and that an \"Operation Husky\" was an invasion of Greece. German intelligence accepted the authenticity of the documents and the Germans diverted much of their defensive effort from Sicily to Greece until the occupation of Pantelleria on 11 June, which concentrated German and Italian attention on the western Mediterranean. Generalfeldmarschall Erwin Rommel was sent to Greece to assume command. The Germans transferred a group of \"R boats\" (German minesweepers and minelayers) from Sicily and laid three additional minefields off the Greek coast. They also moved three panzer divisions to Greece, one from France and two from the Eastern Front which reduced German combat strength in the Kursk salient."]}, {"page": "Naval Intelligence Division (United Kingdom)", "response": ["*Ewen Montagu, who executed one of its best-known operations, Operation Mincemeat"]}, {"page": "Code name", "response": ["Ewen Montagu, a British Naval intelligence officer, discloses in Beyond Top Secret Ultra that during World War II, Nazi Germany habitually used ad hoc code names as nicknames which often openly revealed or strongly hinted at their content or function."]}, {"page": "Royal Naval Reserve", "response": ["* Ewen Montagu, served during the Second World War as a lieutenant commander, where he helped conceive Operation Mincemeat, i.e., \"The Man Who Never Was\""]}, {"page": "Stephen Boyd", "response": ["Boyd's first role which brought him acclaim was as a pro-Nazi Irish spy in the movie The Man Who Never Was, based on the book by Ewen Montagu. The movie was released in April 1956."]}, {"page": "Baron Swaythling", "response": ["Several other members of the family may also be mentioned. The Hon. Edwin Samuel Montagu, second son of the first Baron, was a Liberal politician and the husband of Venetia Stanley. The medical researcher Philip D'Arcy Hart was the grandson of the first Baron. The Hon. Ewen Montagu, second son of the second Baron, was a judge, writer and intelligence officer, famous for conceptualizing Operation Mincemeat. The Hon. Ivor Montagu, third son of the second Baron, was a film maker. Also, the first Baron was the uncle of the Liberal Member of Parliament Sir Stuart Samuel, 1st Baronet Samuel, and of Liberal politician Herbert Samuel, 1st Viscount Samuel."]}, {"page": "Operation Mincemeat", "response": ["The full effect of Operation Mincemeat is not known, but Sicily was liberated more quickly than anticipated and losses were lower than predicted. The events were depicted in Operation Heartbreak, a 1950 novel by the former cabinet minister Duff Cooper, before one of the intelligence officers who planned and carried out Mincemeat, Ewen Montagu, wrote a history in 1953. Montagu's work formed the basis for the 1956 British film The Man Who Never Was.", "thumb|alt=Photograph of Cholmondeley and Montagu in uniform, standing in front of a lorry|Charles Cholmondeley and Ewen Montagu on 17 April 1943, transporting the body to Scotland", "Cholmondeley was a flight lieutenant in the Royal Air Force (RAF) who had been seconded to MI5, Britain's domestic counter-intelligence and security service. He had been appointed as the secretary of the Twenty Committee, a small inter-service, inter-departmental intelligence team in charge of double agents. In November 1942 the Twenty Committee turned down Cholmondeley's plan as being unworkable, but thought there may have been some potential in the idea. As there was a naval connection to the plan, John Masterman, the chairman of the committee, assigned Ewen Montagu, the naval representative, to work with Cholmondeley to develop the plan further. Montagu – a peacetime lawyer and King's Counsel who had volunteered at the outbreak of the war – worked under Godfrey at the Naval Intelligence Division, where he ran NID 17(M), the sub-branch which handled counter-espionage work. Godfrey had also appointed Montagu to oversee all naval deception involving double agents. As part of his duties, Montagu had been briefed on the need for deception operations to aid the Allied war aims in a forthcoming invasion operation in the Mediterranean."]}, {"page": "List of British Jews", "response": ["* Ewen Montagu, President of the United Synagogue"]}, {"page": "The Man Who Never Was", "response": ["The Man Who Never Was is a 1956 British  espionage thriller film produced by André Hakim and directed by Ronald Neame. It stars Clifton Webb and Gloria Grahame and features Robert Flemyng, Josephine Griffin and Stephen Boyd. It is based on the book of the same name by Lt. Cmdr. Ewen Montagu and chronicles Operation Mincemeat, a 1943 British intelligence plan to deceive the Axis powers into thinking the Allied invasion of Sicily would take place elsewhere in the Mediterranean. ", "In 1943, Royal Navy Lieutenant Commander Ewen Montagu (Clifton Webb) devises a scheme to deceive the Nazis about the impending invasion of Southern Europe. It entails releasing a corpse with a fictional identity off the coast of Spain, where strong currents will carry it ashore near where a known German agent operates. The non-existent Royal Marine courier, Major William Martin, would appear to be a plane crash victim carrying documents about an upcoming Allied invasion of German-occupied Greece, rather than Sicily, the more obvious target. Montagu receives approval to carry out Operation Mincemeat.", "* Clifton Webb as Lt. Cmdr. Ewen Montagu", "* Ewen Montagu as an Air Vice Marshal (uncredited)", "The exact identity of the \"man who never was\" has been the centre of controversy since the end of the war. On the one hand, certain accounts claim the true identity of \"Major William Martin\" was a homeless, alcoholic rat-catcher from Aberbargoed, Wales, Glyndwr Michael, who had died by self-administering a small dose of rat poison. However, in 2002, authors John and Noreen Steele published the non-fictional account of The Secrets of HMS Dasher, about an ill-fated escort carrier that exploded and sank in the Firth of Clyde around the time Operation Mincemeat had commenced. The Steeles argued that \"Major Martin's\" body was actually that of seaman John Melville, one of the Dasher's casualties. Further, it has been reported that the accuracy of this claim was verified by the Royal Navy in late October 2004,Lentz, Robert J. Gloria Grahame, Bad Girl of Film Noir: The Complete Career. Jefferson, N.C.: McFarland & Co., 2008. p. 201. and a memorial service was held for Melville, in which he was celebrated as one whose \"memory lives on in the film The Man Who Never Was...we are gathered here today to remember John Melville as a man who most certainly was.\" But in fact, Professor Denis Smyth, a researcher at the University of Toronto, has counter-argued that Glyndwr Michael was indeed the real \"Major Martin.\" To support his claims, Smyth published the contents of a secret memo and an official report, both authored by Ewen Montagu himself, confirming the Glyndwr Michael story.Smyth, Denis. Deathly Deception: The Real Story of Operation Mincemeat. Oxford: Oxford University Press, 2010.", "Regardless of the identity of Major Martin, Nigel Balchin's script stayed as close to the truth as was convenient, yet the film does fall back on some dramatization. For example, the episode of the Irish spy, O'Reilly, is a complete fabrication. The British Security Service controlled the German spy network in the UK with its Double-Cross System, though this fact was still secret at the time the film was made. Ewen Montagu declared that he was happy with the fictitious incidents which, although they did not happen, might have happened. "]}, {"page": "Francis Rattenbury", "response": ["Alma, represented by Ewen Montagu, was acquitted of murder and of being an accessory after the fact but committed suicide a few days later on 4 June 1935, stabbing herself with a dagger six times in the chest (three of which penetrated her heart), before throwing herself into the River Stour at Christchurch.Hodge, James H. (ed.), Famous Trials 5, Penguin, 1955, 221 (verdict), 223 (suicide)"]}, {"page": "William Martin (Royal Marine officer)", "response": ["===Ewen Montagu's account===", "Ewen Montagu, the officer in charge of Operation Mincemeat, was faced with the task of finding a body to give substance to the persona of William Martin. In this he was assisted by Bentley Purchase, coroner of St Pancras District. Several different accounts of this have been given. In Montagu's book, The Man Who Never Was, written in 1953, he states that in 1942 there was no shortage of bodies, but none they felt they could take. He states that the body of a young man who had died of pneumonia was found, and that permission to use the body was given.Montagu, p. 30 The body was released on the condition that the man's real identity would never be revealed."]}, {"page": "Swaythling", "response": ["The Swaythling Cup, an international table tennis competition, was set up in 1926 by Baroness Swaythling's two sons, Ivor and Ewen Montagu."]}, {"page": "George Archer-Shee", "response": ["*The Archer-Shee Case by Ewen Montagu (David and Charles, Newton Abbot, 1974) "]}, {"page": "List of Jews in religion", "response": ["* Ewen Montagu, President of the United Synagogue"]}, {"page": "Ivor Montagu", "response": ["His older brother Ewen Montagu, a barrister in civilian life, became a Naval Intelligence Officer during the Second World War, privy to the secrets of top-secret Ultra and the mastermind of the successful deception that launched the invasion of Sicily, Operation Mincemeat.  He later wrote a best-selling account of that adventure, The Man Who Never Was. Ivor Montagu himself turned out to be working, albeit briefly, for the other side.  A 25 July 1940 cable from Simon Davidovitch Kremer, Secretary to the Soviet Military Attaché in London, identified him as the somewhat reluctant new recruit who was supposed to create an \"X Group\" of like-minded friends.Records of the Government Code and Cypher School 15/43, British National Archives, Kew   By the following year, Hitler had invaded Russia and the Soviet Union became an ally of Britain's, so that by June, 1941, both brothers were technically working for the same side."]}, {"page": "Judge Advocate of the Fleet", "response": ["*1945 Ewen Montagu"]}, {"page": "List of films based on actual events", "response": ["* The Man Who Never Was (1956) – 1956 British  espionage thriller film based on the book of the same name by Lt. Cmdr. Ewen Montagu and chronicles Operation Mincemeat, a 1943 British intelligence plan to deceive the Axis powers into thinking the Allied invasion of Sicily would take place elsewhere in the Mediterranean"]}, {"page": "Solomon Joseph Solomon", "response": ["Solomon's daughter, Iris, was married to Ewen Montagu, one of the \"brains\" behind Operation Mincemeat in World War Two.Ben Macintyre. Operation Mincemeat. Bloomsbury, 2010. Solomon was an uncle of the American playwright Moss Hart."]}, {"page": "Louis Montagu, 2nd Baron Swaythling", "response": ["* Ewen Montagu, lawyer, judge, and naval officer."]}, {"page": "List of British films of 1956", "response": ["|The Man Who Never Was||Ronald Neame ||Clifton Webb, Ewen Montagu, Gloria Grahame ||World War II ||"]}, {"page": "Index of World War II articles (E)", "response": ["# Ewen Montagu"]}, {"page": "Ewen", "response": ["*Ewen Montagu, a British judge, writer and intelligence officer"]}, {"page": "Ewen Edward Samuel Montagu", "response": ["#REDIRECT Ewen Montagu"]}, {"page": "Ronnie Reed", "response": ["Reed was also involved  when the stratagem of \"The Man Who Never Was\" was being prepared in 1943. Commander Ewen Montagu, who thought up the scheme, needed to produce an identity card for the corpse on which fake invasion plans were to be planted. For the card, he needed a photograph, but he could find no-one who resembled the body. Then, at a meeting to discuss double-agents, he found himself seated opposite Ronnie Reed and realised that \"he could have been the twin brother of the corpse\". Reed’s photograph was therefore used for the Identity Card.See, most recently, Operation Mincemeat by Ben Macintyre, pub 2010, page 137."]}, {"page": "Cause Célèbre (play)", "response": ["* Ewen Montagu ..... Rory Fleck-Byrne"]}, {"page": "List of fiction works made into feature films (K–R)", "response": ["| The Man Who Never Was (1954), Ewen Montagu"]}, {"page": "Montagu (surname)", "response": ["*Ewen Montagu (1901–1985), British judge, writer and Naval intelligence officer"]}, {"page": "List of Colin Firth performances", "response": ["| Ewen Montagu"]}, {"page": "El ministerio del tiempo", "response": ["* Mark Schardan as Ewen Montagu"]}, {"page": "Jennifer Montagu", "response": ["Montagu is a daughter of Ewen Montagu, a British judge, writer and Naval intelligence officer. She was educated at Brearley School, New York, Benenden School, Kent, and Lady Margaret Hall, Oxford, where she gained a BA in PPE, then studied under Ernst Gombrich at the Warburg Institute, London, where she gained her PhD degree."]}, {"page": "The Man Who Never Was (book)", "response": ["The Man Who Never Was is a 1953 book by Ewen Montagu about the World War II Operation Mincemeat. Montagu  played a leading role in the 1943 scheme to deceive the Germans about the planned Allied invasion of Sicily. Montagu's work formed the basis for a 1956 film by the same title. The scheme entailed releasing a dead body just off the coast of Spain, where strong currents caused it to drift ashore in an area where a skilled German secret agent was known to operate. The corpse was to appear to be the victim of an airplane crash, the non-existent Royal Marine Major William Martin, who had letters in a briefcase that hint at a forthcoming Allied invasion of Greece and Sardinia, rather than the obvious target of Sicily."]}, {"page": "Rory Fleck Byrne", "response": ["| Ewen Montagu"]}, {"page": "Counsel to the Navy Department, Ministry of Defence", "response": ["# 1945-1964, Ewen Montagu", "# 1964-1972, Ewen Montagu"]}, {"page": "Operation Mincemeat (film)", "response": ["*Colin Firth as Ewen Montagu", "*The Man Who Never Was, 1956 film based on Ewen Montagu's book of the same name, about the operation"]}]}}