{"wiki_id": "http://www.wikidata.org/entity/Q366231", "itemLabel": "Benjamin Samuel Williams", "itemDescription": "English orchidologist and nurseryman in London (1824-1890)", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Samuel_Williams", "wikipedia_page": {"main": "Benjamin Samuel Williams (2 March 1822 – 24 June 1890), English orchidologist and nurseryman in London, known mainly for his horticultural notes on orchids in publications such as The Orchid Grower's Manual (London 1852, 7th ed. 1894), Select Orchidaceous Plants (London 1862 onwards) and The Orchid Album (London 1882-97).\nWilliams' father James was gardener to Robert Warner, the botanist, at Hoddesdon, and Benjamin began working under his father at the age of fourteen. He first gained prominence as an orchid grower when he was hired by the orchid collector C. B. Warner, whose orchids soon began winning prizes at top orchid shows. Williams was a business partner of Robert Parker's in a nursery at Seven Sisters Road in Holloway between 1854 and 1861, and later moved to the nearby Victoria and Paradise Nurseries.This botanist is denoted by the author abbreviation B.S.Williams when citing a botanical name.", "link_mentions": [{"page": "List of orchidologists", "response": ["* Benjamin Samuel Williams (1822–1890), an English orchidologist and nurseryman in London"]}, {"page": "List of florilegia and botanical codices", "response": ["* 1862–65-91 London Select Orchidaceous Plants Robert Warner (botanist) (1814–1896) Benjamin Samuel Williams (1824–1890) Walter Hood Fitch (1817–1892) James Andrews", "* 1882–97 London The Orchid Album Robert Warner (botanist) Thomas Moore (1821-1887) John Nugent Fitch (1840–1927) Benjamin Samuel Williams (1824–1890)", "* 1894 London The Orchid Grower's Manual Benjamin Samuel Williams (1824–1890)"]}, {"page": "B. S. Williams", "response": ["#REDIRECT Benjamin Samuel Williams"]}, {"page": "Benjamin Williams (disambiguation)", "response": ["* Benjamin Samuel Williams (1822–1890), English orchidologist and nurseryman"]}, {"page": "B.S.Williams", "response": ["#REDIRECT Benjamin Samuel Williams"]}, {"page": "List of botanists by author abbreviation (B)", "response": ["* B.S.Williams – Benjamin Samuel Williams (1824–1890)"]}, {"page": "The Orchid Album", "response": ["The Orchid Album, Comprising Coloured Figures and Descriptions of New, Rare, and Beautiful Orchidaceous Plants, known as The Orchid Album, is a horticultural work by Robert Warner and Benjamin Samuel Williams of eleven volumes published between 1872 and 1897 and illustrated by John Nugent Fitch and by Gertrude Hamilton."]}, {"page": "Frederick Bates (entomologist)", "response": ["Frederick Bates (18 November 1829 – 6 October 1903) was a British brewer and entomologist, known for his collection of Tenebrionoidea (Heteromera). Frederick DuCane Godman purchased this collection of 22,390 specimens; the collection was subsequently sold to the Natural History Museum, London in 1881 and 1897. Until the 1890s, he collected beetle specimens from Great Britain; this collection was later owned by Basil Samuel Williams (nephew of Benjamin Samuel Williams). Bates managed the Eagle Brewery in Leicester before co-founding the Leicester Brewing & Malting Co. in June 1890."]}]}}