{"wiki_id": "http://www.wikidata.org/entity/Q3666387", "itemLabel": "Charles Edward Pollock", "itemDescription": "English judge", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Edward_Pollock", "wikipedia_page": {"main": "Sir Charles Edward Pollock, SL (31 October 1823 – 21 November 1897) was an English judge, one of the last Barons of the Court of the Exchequer and serjeants-at-law.", "link_mentions": [{"page": "Res ipsa loquitur", "response": ["The term comes from Latin and is literally translated \"the thing itself speaks\", but the sense is well conveyed in the more common translation, \"the thing speaks for itself\". The earliest known use of the phrase was by Cicero in his defence speech Pro Milone. The circumstances of the genesis of the phrase and application by Cicero in Roman legal trials has led to questions whether it reflects on the quality of res ipsa loquitur as a legal doctrine subsequent to 52 BC, some 1915 years before the English case Byrne v Boadle and the question whether Charles Edward Pollock might have taken direct inspiration from Cicero's application of the maxim in writing his judgment in that case."]}, {"page": "Judah P. Benjamin", "response": ["On January 13, 1866, Benjamin enrolled at Lincoln's Inn, and soon thereafter was admitted to read law under Charles Pollock, son of Chief Baron Charles Edward Pollock, who took him as a pupil at his father's direction. Benjamin, despite his age of 54, was initially required, like his thirty-years-younger peers, to attend for twelve terms, that is, three years.  According to Benjamin's obituary in The Times, though, \"the secretary of the Confederacy was dispensed from the regular three years of unprofitable dining, and called to the bar\" on June 6, 1866."]}, {"page": "List of High Court judges of England and Wales", "response": ["| rowspan=\"2\" |Sir Charles Edward Pollock"]}, {"page": "Baron Pollock", "response": ["#redirectCharles Edward Pollock"]}, {"page": "Sir Frederick Pollock, 1st Baronet", "response": ["Pollock died in August 1870, aged 86, and was succeeded in the baronetcy by his eldest son, William, sometime Queen's Remembrancer. His fourth son, Charles Edward Pollock, apprenticed to his father, had no university education. He became a law reporter then co-serving Baron of the Court of Exchequer, becoming the last in that appeal court. Another son, George Frederick Pollock, was Master of the Supreme Court succeeded his eldest brother as Queen's Remembrancer."]}, {"page": "CE Pollock", "response": ["#REDIRECT Charles Edward Pollock "]}, {"page": "Chief Baron Pollock", "response": ["#REDIRECT Charles Edward Pollock"]}, {"page": "Pollock CB", "response": ["#REDIRECT Charles Edward Pollock"]}, {"page": "Pollock (surname)", "response": ["* Charles Edward Pollock (1823–1897), English judge"]}, {"page": "Charles Pollock (disambiguation)", "response": ["*Charles Edward Pollock (1823–1897), English judge"]}, {"page": "Pollock B", "response": ["#REDIRECT Charles Edward Pollock"]}, {"page": "Sir Charles Edward Pollock", "response": ["#REDIRECT Charles Edward Pollock"]}, {"page": "James Canham Read", "response": ["The murder trial began on 12 November at Essex Assizes in the Shire Hall and was judged by Charles Edward Pollock. The prosecution was led by Frank Lockwood (later famed by trying Oscar Wilde) assisted by Guy Stephenson and Read was defended by Alfred Cock QC and Mr Warburton. Read plead \"not guilty\". The evidence was largely circumstantial but was substantive. Witnesses were inconsistent in their identification of Read and no murder weapon was presented. There was little public sympathy for Read who was seen as a total scoundrel.Pall Mall Gazette 16 November 1894"]}]}}