{"wiki_id": "http://www.wikidata.org/entity/Q3667244", "itemLabel": "Cheryl Campbell", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Cheryl_Campbell", "wikipedia_page": {"main": "Cheryl Campbell (born 22 May 1949) is an English actor of stage, film and television. She starred opposite Bob Hoskins in the 1978 BBC drama Pennies From Heaven, before going on to win the 1980 BAFTA TV Award for Best Actress for Testament of Youth and Malice Aforethought, and the 1982 Olivier Award for Best Actress in a Revival for A Doll's House. Her film appearances include Chariots of Fire (1981), Greystoke: The Legend of Tarzan, Lord of the Apes (1984) and The Shooting Party (1985).", "link_mentions": [{"page": "Chariots of Fire", "response": ["Chariots of Fire is a 1981 British historical sports drama film directed by Hugh Hudson, written by Colin Welland, and produced by David Puttnam. It is based on the true story of two British athletes in the 1924 Olympics: Eric Liddell: a devout Scottish Christian who runs for the glory of God, and Harold Abrahams, an English Jew who runs to overcome prejudice. Ben Cross and Ian Charleson star as Abrahams and Liddell, alongside Nigel Havers, Ian Holm, John Gielgud, Lindsay Anderson, Cheryl Campbell, Alice Krige, Brad Davis, and Dennis Christopher in supporting roles. "]}, {"page": "May 22", "response": ["*1949 – Cheryl Campbell, English actress"]}, {"page": "The Taming of the Shrew", "response": ["In 1924, extracts from the play were broadcast on BBC Radio, performed by the Cardiff Station Repertory Company as the eight episode of a series of programs showcasing Shakespeare's plays, entitled Shakespeare Night. Extracts were also broadcast in 1925 as part of Shakespeare: Scene and Story, with Edna Godfrey-Turner and William Macready, and in 1926 as part of Shakespeare's Heroines, with Madge Titheradge and Edmund Willard. In 1927, a forty-three-minute truncation of the play was broadcast on BBC National Programme, with Barbara Couper and Ian Fleming. In 1932, National Programme aired another truncated version, this one running eighty-five minutes, and again starring Couper, with Francis James as Petruchio. In 1935, Peter Creswell directed a broadcast of the relatively complete text (only the Bianca subplot was trimmed) on National Programme, starring Mary Hinton and Godfrey Tearle. This was the first non-theatrical version of the play to feature Sly, who was played by Stuart Robertson. In 1941, Creswell directed another adaptation for BBC Home Service, again starring Tearle, with Fay Compton as Katherina. In 1947, BBC Light Programme aired extracts for their Theatre Programme from John Burrell's Edinburgh Festival production, with Patricia Burke and Trevor Howard. In 1954, the full-length play aired on BBC Home Service, directed by Peter Watts, starring Mary Wimbush and Joseph O'Conor, with Norman Shelley as Sly. BBC Radio 4 aired another full-length broadcast (without the Induction) in 1973 as part of their Monday Night Theatre series, directed by Ian Cotterell, starring Fenella Fielding and Paul Daneman. In 1989, BBC Radio 3 aired the full play, directed by Jeremy Mortimer, starring Cheryl Campbell and Bob Peck, with William Simons as Sly. In 2000, BBC Radio 3 aired another full-length production (without the Induction) as part of their Shakespeare for the New Millennium series, directed by Melanie Harris, and starring Ruth Mitchell and Gerard McSorley."]}, {"page": "1984 in film", "response": ["| Greystoke: The Legend of Tarzan, Lord of the Apes || Warner Bros. || Hugh Hudson (director); P.H. Vazak, Michael Austin (screenplay); Ralph Richardson, Ian Holm, James Fox, Christopher Lambert, Andie MacDowell, Cheryl Campbell, Paul Geoffrey, Ian Charleson, Nigel Davenport, Nicholas Farrell, Richard Griffiths, Hilton McRae, David Suchet, John Wells, Paul Brooke, Ailsa Berk, Mak Wilson, Emil Abossolo-Mbo, Deep Roy, Tali McGregor, Peter Kyriakou, Danny Potts, Eric Langlois, Peter Elliott, John Alexander, Christopher Beck || Adventure || Live action"]}, {"page": "1981 in film", "response": ["| Chariots of Fire || Warner Bros. / The Ladd Company / Allied Stars Ltd / Goldcrest Films / Enigma Productions || Hugh Hudson (director); Colin Welland (screenplay); Ben Cross, Ian Charleson, Nigel Havers, Cheryl Campbell, Alice Krige, Lindsay Anderson, Dennis Christopher, Nigel Davenport, Brad Davis, Peter Egan, John Gielgud, Ian Holm, Patrick Magee, Nicholas Farrell, Struan Rodger, David Yelland, Daniel Gerroll, Richard Griffiths || Historical, Drama || Live action"]}, {"page": "1980 in film", "response": ["*McVicar, directed by Tom Clegg, starring Roger Daltrey, Adam Faith, Cheryl Campbell – (U.K.)", "| McVicar || Crown International Pictures / The Who Films / Polytel || Tom Clegg (director/screenplay); John McVicar (screenplay); Roger Daltrey, Adam Faith, Cheryl Campbell, Billy Murray, Georgina Hale, Steven Berkoff, Brian Hall, Matthew Scurfield, Harry Fielder, Ian Hendry, Malcolm Tierney, Robert Walker Jr., James Marcus, Tony Haygarth, Anthony May, Peter Jonfield, Leonard Gregory, Joe Turner, Jeremy Blake, Anthony Trent, Terence Stuart, Charles Cork, Paul Kernber, Ronald Herdman, Tony Rohr, Michael Feast, Richard Simpson, Ricky Parkinson || Drama || Live action"]}, {"page": "Vera Brittain", "response": ["She was portrayed by Cheryl Campbell in the 1979 BBC2 television adaptation of Testament of Youth."]}, {"page": "Testament of Youth", "response": ["The book was dramatised by Elaine Morgan as a five-part serial which was transmitted on BBC2 in 1979. This version features Cheryl Campbell as Vera Brittain, Peter Woodward as Roland Leighton, Joanna McCallum as Winifred Holtby and Emrys James and Jane Wenham as Vera's parents."]}, {"page": "The Sweeney", "response": ["*Cheryl Campbell"]}, {"page": "The Seven Dials Mystery", "response": ["Following the success of their version of Why Didn't They Ask Evans in 1980, The Seven Dials Mystery was adapted by London Weekend Television as a 140-minute television film and transmitted on Sunday 8 March 1981. The same team of Pat Sandys, Tony Wharmby and Jack Williams worked on the production which again starred John Gielgud and James Warwick. Cheryl Campbell also starred as \"Bundle\" Brent. The production was extremely faithful to the book with no major deviations to the plot or characters.", "* Cheryl Campbell as Lady Eileen 'Bundle' Brent"]}, {"page": "Pennies from Heaven (TV series)", "response": ["Potter's memorial service in November 1994 at St James's Church in Piccadilly began with those in attendance singing \"Roll Along Prairie Moon\" to the accompaniment of a jazz quintet. Cheryl Campbell and Freddie Jones read their scene in the schoolroom from Pennies: \"As Jones stifled his tears, Campbell said: 'Nobody ever ever stops yearning' . . . In a comic interlude Michael Grade, chief executive of Channel 4, Alan Yentob, controller of BBC1, and Kenith Trodd, Potter's producer, read a scene from Pennies. [And Trodd] told of their last meeting before the playwright's death from cancer: 'Dennis slugging Courvoisier, fortified by liquid heroin and morphine . . . after an hour he seemed to crumple and he said, 'I do have one very real fear of death. It is that you might get asked to speak at my memorial service'.\"", "In 1981, the series was adapted as a film, starring Steve Martin. Potter adapted his own screenplay, and Herbert Ross directed. Potter was nominated for the 1981 Academy Award for Writing Adapted Screenplay — according to The Times, Metro-Goldwyn-Mayer had him rewrite the script thirteen times. By most accounts, the movie was a resounding flop, despite the contributions of Bernadette Peters (as Eileen), Christopher Walken (as Tom) and Vernel Bagneris (as 'the accordion man'). The MGM deal with Potter had multiple ramifications. Dennis Potter, in a private conversation with Cheryl Campbell, told her that she would be able to play the part of Eileen in the film because her character could absorb an unknown actress when the series was made into an American film. Cheryl declined this offer because it wouldn't be fair to Bob and Gemma and all the others that had contributed so much to the series. The fact that the series would never be seen again due to the rights being sold to MGM was the most upsetting detail of the entire enterprise."]}, {"page": "Greystoke: The Legend of Tarzan, Lord of the Apes", "response": ["Greystoke: The Legend of Tarzan, Lord of the Apes is a 1984 adventure film directed by Hugh Hudson based on Edgar Rice Burroughs' novel Tarzan of the Apes (1912). Christopher Lambert stars as Tarzan (though the name Tarzan is never used in the film's dialogue) and Andie MacDowell as Jane; the cast also includes Ralph Richardson (in his final role), Ian Holm, James Fox, Cheryl Campbell, and Ian Charleson.", "* Cheryl Campbell – Alice, Lady Clayton of Greystoke, John's biological mother who dies of malaria"]}]}}