{"wiki_id": "http://www.wikidata.org/entity/Q367778", "itemLabel": "Willie Williams", "itemDescription": "video director, stage and lighting designer for multimedia projects", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Williams_(set_designer)", "wikipedia_page": {"main": "William Peter Charles Williams (born 1959) is a show director, stage and lighting designer, video and set designer for concerts, theatre, and multimedia projects.  He is best known for his groundbreaking work with the rock band U2, and is recognised as one of the leading artists in this field.He was born in 1959 in Newcastle-upon-Tyne and raised in Sheffield, England, son of Robert Woodman Williams, a singer & medical practitioner who was an early pioneer in the then fledgling field of physiotherapy and who also sang with South Yorkshire Opera.  Williams excelled at mathematics and science in school and planned to study physics at University College, London.  The advent of punk rock caused him to enter the music scene instead, and he began doing lights for various bands such as Writz, Deaf School and Stiff Little Fingers.Willie Williams has been responsible for the design of U2's tours from 1982 onward, most famously the extravagant, bewildering Zoo TV Tour (1992–93), and most recently the Innocence + Experience Tour (2015), the Joshua Tree Tours 2017 and 2019, and the Experience + Innocence Tour (2018). He has also worked with musical artists such as R.E.M., David Bowie, The Rolling Stones, Robbie Williams, Darren Hayes and George Michael.Williams has designed for the Montreal-based dance company La La La Human Steps.  Other collaborations have been with Laurie Anderson, Marianne Faithfull and the Kronos Quartet, most notably on Sun Rings, a joint effort with NASA that combines the string quartet's music with video and audio material collected by the Voyager 1 and Voyager 2 spacecraft.\n\n", "link_mentions": [{"page": "Steve Taylor", "response": ["While still running Squint, Taylor had begun a film project called St. Gimp, co-written with Ben Pearson and Willie Williams. That film was abandoned in 2001 when Squint Entertainment lost its financial backing and Taylor was forced out of the company. Taylor co-wrote and directed the feature film The Second Chance starring Michael W. Smith, released February 17, 2006. He also appeared in the documentary film Why Should the Devil Have All the Good Music? (released on DVD in 2006), in interview segments and performing part of \"We Don't Need No Colour Code\". New music was scarce, but Taylor did contribute one song, \"Shortstop\", to Squint's 2000 compilation Roaring Lambs. He also recorded \"Yo Ho Hero\", a collaborative track for the 2008 VeggieTales movie The Pirates Who Don't Do Anything."]}, {"page": "Zoo TV Tour", "response": ["While on a break from recording, the band invited production designer Willie Williams to join them in Tenerife in February 1991. Williams had recently worked on David Bowie's Sound+Vision Tour, which used film projection and video content, and he was keen to \"take rock show video to a level as yet undreamed of\".McGee (2008), p. 135 The band played Williams some of their new music—inspired by alternative rock, industrial music, and electronic dance music—and they told him about the \"Zoo TV\" phrase that Bono liked. Williams also learned about the band's affection for the Trabant, an East German automobile that derisively became a symbol for the fall of Communism; he thought their fondness for the car was \"deeply, deeply bizarre\". In May, he brainstormed the idea to construct a lighting system of recycled Trabants. Williams, who \"always favored a very homemade approach to lighting, over an off-the-shelf one\", had previously fashioned fixtures from objects such as trash cans and furniture. He saw the Trabant as the perfect object to light U2's tour, envisioning it as a \"suitably surreal and symbolic scenic element\". On 1 June 1991, Williams visited the engineering department of Light & Sound Design (LSD) in Birmingham, England, to ask for help with building a prototype.", "The Zoo TV stages were designed by Willie Williams, U2's stage designer since the War Tour of 1982–1983. In place of U2's austere and minimalist productions of the 1980s, the Zoo TV stage was a complex setup, designed to instill \"sensory overload\" in its audience. The set's giant video screens showed footage of the band members performing, pre-recorded video, live television transmissions, and flashing text phrases. Electronic, tabloid-style headlines ran on scrawls at the ends of the stage. The band's embracing of such technology was meant as a radical departure in form, and as a commentary on the pervasive nature of technology. This led many critics to describe the show as ironic.", "The stadium legs of the tour received more consistent praise than the arena shows. Critics noted that while the show and its setlist were largely the same as before, the tour mostly benefited from the increased scale. The New York Daily News said that the stage \"looked like a city made of television sets—an electronic Oz\" and that \"glitz was used not as a mere distraction (as it has been by so many video-age artists), but as a determined conceit\". Gundersen also made the comparison to Oz, saying that even though the band was dwarfed by the setting, their adventurous musicianship still shone through. She concluded that the group had \"deliver[ed] a brilliant high-wire act\" between mocking and exploiting rock music clichés, a comparison also made by stage designer Willie Williams. Robert Hilburn of the Los Angeles Times said of the outdoor American leg, \"Zoo TV is the yardstick by which all other stadium shows will be measured.\" David Fricke of Rolling Stone said that the band had \"regained critical and commercial favor by negotiating an inspired balance between rock's cheap thrills and its own sense of moral burden\". He praised the band for \"retool[ing] themselves as wiseacres with heart and elephant bucks to burn\". Fricke noted that the increased visual effects for the \"Outside Broadcast\" leg increased the shows' \"mind-fuck\" factor. Many critics described the tour as \"post-modern\".Friedlander (2006), p. 276 The writers of Rolling Stone, in a best-of-1992 issue, named U2 co-winners of \"Best Band\", while awarding the Zoo TV Tour honours for both \"Best Tour\" and \"Worst Tour\".McGee (2008), p. 159", "At the 1992 Billboard Music Awards, U2 won for the No. 1 Boxscore Tour. For the Pollstar Concert Industry Awards of 1992, the band were honoured for the Most Creative Stage Production, and were nominated for Most Creative Tour Package and Major Tour of the Year. For their work on the Zoo TV Tour, Willie Williams and Carol Dodds won an award for Designer of the Year/Lighting at the 1992 Lighting Dimensions International Awards."]}, {"page": "PopMart Tour", "response": ["U2 stage designer Willie Williams and stage architect Mark Fisher began developing the PopMart Tour in late 1995. U2 re-entered their Dublin recording studio in October 1995, shortly before releasing an experimental/ambient album with Brian Eno, entitled Original Soundtracks 1, under the pseudonym \"Passengers\". The band started to work on their ninth studio album, which was set to be finished by mid-1996 and released later that year prior to the Christmas and holiday season. Around the same time, in late 1995, Williams began developing concepts for the band's next tour. Among the proposed themes for the tour was a concept based on the end of the millennium titled \"U2000\", and a discothèque concept involving a large mobile disco. Lead vocalist Bono became interested in one of Williams' designs that resembled a supermarket, which was inspired by facades of American post-war suburban outlet stores. Bono who believed that the symbol of a supermarket, with its large number of choices and temptations, could be used as a metaphor for U2's songs, which often deal with the struggle between desire and faith. With the help of Fisher, Williams designed a fantasy \"entertainment outlet\", and decided to create a tour with a consumerism theme."]}, {"page": "List of people from Sheffield", "response": ["*Willie Williams, set designer and video director"]}, {"page": "Vertigo Tour", "response": ["The Vertigo Tour's production was designed by architect Mark Fisher and stage and lighting designer Willie Williams. Key elements were an ellipse-shaped ramp on the floor connected to the stage, with some fans inside it and some outside it (similar to the heart-shaped ramp used on the previous Elevation Tour). The inside area of the ellipse came to be known as the \"bomb shelter\", in reference to the supporting album."]}, {"page": "Onedotzero", "response": ["onedotzero industries works with designers including Willie Williams, Run Wrake, Logan, Julian Opie, UVA, D-Fuse, Minivegas, Shroom, and Alex Rutterford, as well as to commissioning new student designers."]}, {"page": "Elevation Tour", "response": ["The Elevation Tour show was designed by Willie Williams, with Mark Fisher serving as the architect. The stage, built by Tait Towers, measured  wide by  deep and featured an open center. Extending from the wings of the main stage were curved ramps shaped like the bottom of a heart, which joined together at the center of the venue floor. The heart shape was inspired by the video graphics being produced for the tour, and it was chosen by the creative team early in the design process. At the suggestion of bassist Adam Clayton, the stage was given an open center that could be filled with fans; the first 300 general admission ticketholders to queue before a concert were given wristbands and allowed access to the center of the heart. Williams was amused that the catwalks were the same shape as the vertical golden arch from the PopMart Tour stage when laid horizontally. The Elevation Tour stage was placed at one end of the venues, with seating offered \"in the round\". Due to this configuration, the stage designers focused on ensuring sightlines were not obstructed for anyone. Fisher said, \"With a show done in the round, you can't really have any scenery because what is background scenery for one person is a sightline obstruction to another.\" To facilitate this, the stage height was kept low to the venue floor, with the main stage built  high and the wings  high.", "At the 13th annual Pollstar Concert Industry Awards, U2 were honored with awards for Major Tour of the Year and Most Creative Stage Production, while Paul McGuinness was recognized as Personal Manager of the Year.McGee (2008), p. 245 Willie Williams won a 2001 EDDY Award from Entertainment Design magazine for his work as the tour's show director; the magazine said, \"While U2's current Elevation tour is striking in its simplicity, Williams created an almost complete amalgamation of lighting and video by using the entire space of each arena as a projection surface.\" At the 2002 TEC Awards, the Elevation Tour crew won for Outstanding Creative Achievement in Tour Production; among those recognised were Clair Brothers as the tour company, Joe O'Herlihy as the front of house engineer, and Don Garber, Raza Sufi, Niall Slevin, and Dave Skaff as monitor engineers."]}, {"page": "Vertigo 2005: Live from Chicago", "response": ["The documentary on the second disc was directed by Erica Forstadt with Ned O'Hanlan also acting as producer. The bonus material on the second disc featured surveillance cuts directed by Willie Williams, edited by Mark Reynolds, and produced by Sam Pattinson and an alternative music video of \"Sometimes You Can't Make It on Your Own\" directed by Phil Joanou with production again by Ned O'Hanlon.", "Along with the extra lights used to facilitate filming, Willie Williams and his crew used the United Center's LCD rings that circle the seating area (which generally display scores or advertisements during sporting events) to display additional patterns that correlated with the stage lighting, as well as static during \"Zoo Station.\"  Williams discusses this in his online diary on U2's website."]}, {"page": "The Joshua Tree Tour", "response": ["On 30 April, the band played the Pontiac Silverdome, their first headlining stadium show in the United States. While the show's reviews were positive, they said that a video screen is necessary for people at the back. U2 production manager, Willie Williams, recalls the debate within the band about the use of screens and whether they would divide the audience's attention between the stage and the screen.McGee (2008), p. 104. A video screen was installed behind the lighting tower at the 20 September show at the RFK Stadium in Washington, D.C. so the back half of the stadium could better see the band, and screens were used at most stadium shows for the rest of the tour.McGee (2008), p. 110."]}, {"page": "Zooropa (song)", "response": ["Zooropa producer Flood said that \"Zooropa\" was one of his favourite songs on the album, along with \"Daddy's Gonna Pay for Your Crashed Car\", \"The First Time\", and \"Numb\". Mullen felt that the song was \"absolutely mesmerizing\". Following the release of \"Zooropa\", references to the song have appeared in professional writings and in other media.  On the day of the U2 concert in Sarajevo during the PopMart Tour in 1997, tour set designer Willie Williams wrote about waking up that day with \"Zooropa\" playing in his head and stated that Sarajevo \"is the city of Zooropa, if there ever was one.\"  José Manuel Barroso, president of the European Commission, quoted the song's lyrics at a 2005 press conference after enlisting Bono in an effort to get governments in the European Union to give more money to developing countries, and stated that the lyrics inspired an article he wrote about the future of Europe. Thomas Diez of the Copenhagen Peace Research Institute made references to \"Zooropas lyrics in a 1999 book review about the history of the European Union; lyrics also appeared in a 2005 German–English dictionary, under its listing for \"Vorsprung durch Technik\"."]}, {"page": "Willie Williams", "response": ["Willie Williams may refer to:", "* Willie Williams (cornerback, born 1941), American NFL football player for the New York Giants and Oakland Raiders", "* Willie Williams (offensive tackle) (born 1967), American NFL football player the Phoenix Cardinals and New Orleans Saints", "* Willie Williams (cornerback, born 1970), American NFL football player for the Pittsburgh Steelers and Seattle Seahawks", "* Willie Williams (defensive tackle) (born 1984), American NFL football player for the St. Louis Rams and Philadelphia Eagles", "* Willie Williams (baseball) (1925–2011), American baseball player", "* Willie Williams (athlete) (1931–2019), American sprinter", "* Willie Williams (cricketer) (born 1941), English cricketer", "* Willie Williams (basketball) (born 1946), American basketball player", "* Willie Williams (karateka) (1951–2019), American karateka and mixed martial artist", "* James E. Williams (Willie Williams, 1930–1999), United States Navy sailor awarded the Medal of Honor", "* Willie Williams (general) (born 1951), American Marine Corps general", "* Willie Williams (murderer) (1956–2005), American murderer", "* Willie Williams (set designer) (born 1959), British theatrical stage set, lighting designer and video director"]}, {"page": "U2 3D", "response": ["Following the success of U2 3D, 3ality Digital continued to pioneer 3D projects. After previously experimenting with filming American football games in 3D, 3ality Digital successfully broadcast the first live 3D NFL game in December 2008. In 2009, 3ality Digital aired the first live 3D sports broadcast available to consumers, the first 3D television advertisement, and the first 3D episode of a scripted television program. U2 show director Willie Williams recruited U2 3D director of photography Tom Krueger to design the photography and video coverage for the band's 2009–2011 U2 360° Tour. Krueger directed their subsequent concert film, U2 360° at the Rose Bowl, which was released in 2010."]}, {"page": "No Line on the Horizon", "response": ["Following the release of No Line on the Horizon, U2 staged a worldwide stadium tour, titled the U2 360° Tour. Beginning on 30 June 2009 in Barcelona, the tour visited Europe, North America, Oceania, Africa and South America from 2009 to 2011 and comprised 110 shows. The concerts featured a 360-degree stage that the audience surrounded. Requires a subscription to access. To accommodate this, a large four-legged structure nicknamed \"The Claw\" was built above the stage. At 50 meters (165 feet) tall, it was the largest stage ever constructed and twice the size of the previous largest set, which was used on The Rolling Stones' A Bigger Bang Tour. The idea for the stage had been proposed to the group by the set designer Willie Williams at the end of the Vertigo Tour in 2006. The design was intended to overcome the staid traditional appearance of outdoor concerts where the stage was dominated by speaker stacks on either side. Despite grossing over US$311 million from 44 shows over its first two legs, the tour was barely breaking even, with production costs of approximately US$750,000 per day. In 2010, U2's scheduled headline appearance at the Glastonbury Festival 2010 and their North American leg were postponed until the following year after Bono suffered a serious back injury. By its conclusion in July 2011, U2 360° had set records for the highest-grossing concert tour with $736 million in ticket sales, and for the highest-attended tour with 7.3 million tickets sold."]}, {"page": "Sun Rings", "response": ["Sun Rings is a Kronos Quartet project comprising pre-recorded sounds from space, images from space, music for string quartet and chorus composed by Terry Riley, and visuals by Willie Williams."]}, {"page": "Sound+Vision Tour", "response": ["Édouard Lock (of La La La Human Steps) co-conceived and was artistic director for this tour. Bowie had originally wanted La La La Human Steps to be involved in his previous Glass Spider Tour, but was unable to secure them due to scheduling conflicts. Given the unfavorable attention that his previous solo tour drew, Bowie was keen to make sure the Sound+Vision Tour did things differently. He said, \"It will be staged; there is no way I could ever consider really putting something on the stage that doesn't owe something to theatah (pronouncing 'theatre' in a thick British accent), but it won't be overtly theatre in as much as it won't be propped the same way. Going back to the way we worked towards the Station to Station show, which was basically a question of using a kind of Brechtian lighting pad and working areas and atmospheres of light, is very much the kind of feel it will have.\" Bowie recruited Willie Williams to design the lighting for the tour, having worked with him on the preceding year's Tin Machine \"It's My Life Tour\"."]}, {"page": "Glass Spider Tour", "response": ["In the late 2000s, the tour began to be re-examined by critics, and the tone of the coverage began to change. In 2009, an article in the BBC News singled out the Glass Spider Tour's innovative set and marriage of music and theatre as an inspiration to later acts, including Britney Spears, Madonna, U2 and others. Stage designer Willie Williams said the Glass Spider Tour was a template for those acts: \"There will be one set of costumes and they will do a few songs, then there will be another big scene change and move on to the next thing. Bowie crossing rock 'n' roll with Broadway [in the Glass Spider Tour] was where that began.\" In 2010, the Glass Spider Tour won an award for being one of the best concert designs of all time (alongside other such notable tours as U2's 360° Tour [2009–2011] and Pink Floyd's Division Bell Tour [1994])."]}, {"page": "Video design", "response": ["Laurie Anderson was among the earliest to experiment with video content as part of a live performance, and her ideas and images continue to be a direct inspiration to performers as diverse as David Bowie, Madonna and Kanye West. Meanwhile, in 1982, Devo integrated rear-projected visuals into their concert set, choreographing themselves to match and interact with the action on screen for several songs. But the rock show that made video content 'standard practice' was U2's Zoo TV Tour conceived and designed by Willie Williams - who has collaborated with Laurie Anderson."]}, {"page": "U2 360° Tour", "response": ["Willie Williams, who has worked on every U2 tour since the 1982–1983 War Tour, was again a designer for this tour; Mark Fisher served as the architect. Williams had been toying with ideas for 360-degree stadium staging for U2 for a number of years, and presented sketches of a four-legged design to the group near the end of their Vertigo Tour in 2006. The inspiration for the \"spaceship-on-four-legs\" design, nicknamed \"the Claw\", came from the landmark Theme Building at Los Angeles International Airport. Early reports referred to it as the Kiss the Future Tour, though the name was later changed.", "Before the U2 360° Tour commenced, \"If God Will Send His Angels\", \"Sometimes You Can't Make It on Your Own\", and \"Drowning Man\" (a previously unplayed song from War), were rehearsed, as was \"Even Better Than the Real Thing\" in the Perfecto mix style, while The Edge stated in an interview with Rolling Stone that \"Luminous Times (Hold on to Love)\" was also being considered. None of these were played during the first four legs of the tour. Willie Williams stated in his 27 June 2009 tour diary entry on U2.com that the band \"really wants [Drowning Man] to work and it sounds great\", but the rest of the setlist struggled due to the song's \"beautiful melancholy\". In his 24 July 2009 entry, Williams noted that \"October\" and \"White as Snow\" were also being considered. \"Sunday Bloody Sunday\" and \"Mysterious Ways\" were rehearsed in an acoustic style, but performances during the tour were done by the full band. Before the third leg, \"Tryin' To Throw Your Arms Around the World\" was also rehearsed."]}, {"page": "Willie Williams (lighting designer)", "response": ["#REDIRECT Willie Williams (set designer)"]}, {"page": "Domestica (disambiguation)", "response": ["* Lumia Domestica, a sculpture by Willie Williams"]}, {"page": "Timeline of U2", "response": ["*17 March: U2 meet with Willie Williams to continue discussions on the band's next tour.", "*14 June: U2 meets with Willie Williams and Catherine Owens to discuss the next tour. New ideas include placing TV monitors all over the stage and using Trabants as overhead light sources.McGee (2008), p. 137.", "thumb|U2 stage designer Willie Williams and stage architect Mark Fisher developed the PopMart Tour."]}, {"page": "U2360° at the Rose Bowl", "response": ["The U2 360° Tour was a worldwide concert tour by the Irish rock band U2, launched in support of the group's 2009 album No Line on the Horizon. The tour was designed by Willie Williams, who has worked on every U2 tour since 1982. Mark Fisher was the architect. The tour featured a 360-degree configuration, with the stage being placed closer to the center of the stadium's field than usual. Williams had been toying with ideas for 360-degree stadium staging for U2 for a number of years, and presented sketches of a four-legged design to the group near the end of their Vertigo Tour in 2006. The inspiration for the \"spaceship-on-four-legs\" design, nicknamed \"the Claw\", came from the landmark Theme Building at Los Angeles International Airport.", "The shoot was directed by Tom Krueger, who had previously worked with the band on the film U2 3D. Following the success of U2 3D, show director Willie Williams asked Krueger to design the photography and video coverage for the U2 360° Tour. Originally 13 cameras were used for filming close-ups during the tour; however, Kruger added additional cameras for the Rose Bowl concert, resulting in a total of 27 cameras for the shoot. The additional cameras were used for crane shots and capturing footage of the audience. The show's attendance reached 97,014 people, breaking the US record for single concert attendance for one headline act, a mark U2 previously held.", "*Show designer/director – Willie Williams"]}, {"page": "U2 concert in Sarajevo", "response": ["As late as July 1997, U2 were pressured to accept an offer of approximately $4 million to perform in Basel, Switzerland on the date scheduled for the Sarajevo show. At the time, rumours about the region's instability persisted. To ensure the Sarajevo show was not canceled, Sacirbey appeared at many of the band's preceding shows to lobby on behalf of the city. For the stage to reach Sarajevo, the road crew had to drive the equipment and stage through war-torn Bosnia. Although the trip was without incident, they had to pass through towns such as Mostar, which had been \"obliterated\" during the war. Stage and lighting designer Willie Williams commented that \"when the truck drivers arrived you could see that they were changed men\". The only trouble in transporting the stage came when a border control agent prevented them from crossing the border for hours. The trucks reached Sarajevo two days prior to the concert, arriving to the cheers and applause of the city's residents; their arrival was the first concrete evidence that the band were keeping their promise to play there. McGuinness explained, \"This is a city that's been disappointed so many times there were a lot of people who weren't prepared to believe the gig was going to take place until they saw the stage going up.\" Until then, tickets had sold very slowly, but within 24 hours of the trucks' arrival, another 8,000 tickets were sold. Despite this, a day before the concert, 15,000 tickets remained unsold. Three hundred local residents were employed to help assemble the stage and promote the show."]}, {"page": "One Tree Hill (song)", "response": ["\"One Tree Hill\" was absent during the majority of the Zoo TV Tour, only appearing as an extended snippet at the end of \"One\" at both concerts in New Zealand in 1993.de la Parra (2003), p. 172 It did not appear again until 24 November 2006 in Auckland, New Zealand, on the final leg of the Vertigo Tour. It was considered to close the concert, but tour designer Willie Williams voiced concern as it had not been performed in full since 1990. The song was performed before \"Sometimes You Can't Make It on Your Own\" in the main set instead.  U2 performed it an additional three times on the tour. \"One Tree Hill\" was absent for the majority of the U2 360° Tour but was revived in November 2010 for two concerts in New Zealand, where it was dedicated to the miners who died in the Pike River Mine disaster; their names were displayed on the video screen during the song. Dedicating the song, Bono said, \"we wrote it for Greg Carroll, whose family are with us tonight. But tonight it belongs to the miners of the West Coast Pike River.\" U2 played \"One Tree Hill\" on 25 March 2011, in Santiago, Chile, in a duet with Francisca Valenzuela, and they dedicated it to Victor Jara. It was also played during the encore at a show in Chicago on 5 July 2011 to honour the 25th anniversary of the Carroll's death."]}, {"page": "Acrobat (U2 song)", "response": ["\"Acrobat\" was rehearsed extensively in an acoustic form prior to the third leg of the Zoo TV Tour in 1992.de la Parra (2003), p. 151 The end of the song segued into the beginning of \"Zoo Station\", leading concert historian Pimm Jal de la Parra to speculate that it was being considered to open the set. However, the band did not end up performing it during the tour. In 2006, the Edge said \"it never became a live favourite... I don't think that is what people come to U2 for.\" In 2012, Willie Williams, U2's lighting designer and concert director, described the rehearsed version as \"extremely dramatic\", saying \"in a stadium situation it could be argued that it might have the same dramatic impact as walking out on stage and telling the audience to fuck off.\""]}, {"page": "Innocence + Experience Tour", "response": ["As early as opening night of the U2 360° Tour in June 2009, Bono told his friend/band consultant Gavin Friday that their next tour would have to be more intimate. During  U2 360°, Bono and long-time tour designer Willie Williams first discussed ideas for their next live venture. One of Bono's suggestions was to begin future shows with the band performing underneath a single light bulb, in contrast to the massive stage structure underneath which they played during the 360° Tour.", "The set was designed by Ric Lipson and Es Devlin under the creative direction of Willie Williams. The stage spanned the length of the venue floor and comprised multiple sections. At one end of the venue was the rectangular main stage, which illuminated as an \"I\" to represent \"innocence\" and measured  wide by  deep, with the performance area  wide by  deep. At the other end was a smaller circular B-stage, which illuminated as an \"e\" to represent \"experience\" and measured  diametrically. Connecting the two stages was a  walkway intended to represent the transition between their two themes. A flip-up piano was built into the B-stage, with the lift designed to unfold the instrument 90 degrees like a book opening, rather than raise it directly upwards."]}, {"page": "Innocence + Experience: Live in Paris", "response": ["U2 paid tribute to the victims of the attacks by displaying their names on the video screen during their performance of \"City of Blinding Lights\". The display was created by Willie Williams and the tour's video team. Guitarist the Edge said the group tried to balance paying tribute \"in an artful way that doesn't feel exploitive or jingoistic or anything trite\".  At the end of the show, the group were joined on-stage by Eagles of Death Metal, who were returning to the city for the first time since their show at the Bataclan where the deadliest of the attacks in Paris occurred, killing 89 people. Bono introduced the group by saying, \"They were robbed of their stage, so we would like to offer them ours.\" The two bands performed a cover of Patti Smith's song \"People Have the Power\" before U2 left the stage and Eagles of Death Metal concluded the show with their song \"I Love You All the Time\". The Edge singled out the moment in which the members of U2 handed their instruments to Eagles of Death Metal as his favourite of the evening."]}, {"page": "The Joshua Tree Tours 2017 and 2019", "response": ["Longtime U2 set designer Willie Williams said that there was a misconception that \"because of the nature of the show, the staging could be very simple, which meant it would be achievable with a reduced lead time\". He rejected the notion that the stage would be simple but did realise that much of the lead time required for U2 tours is spent defining the ideas behind them. With The Joshua Trees anniversary as the idea, the development process was simplified, as the band and their creative team were able to begin with several assumptions: that half of the concerts' set list would consist of The Joshua Tree songs; that they could use the original Joshua Tree Tour stage as a reference point; and that photographer Anton Corbijn, who shot the photographs from the album sleeve, would create video content. In October 2016, the band began initial conversations with Stufish Entertainment Architects, the firm behind the set design.", "The set was designed by Stufish Entertainment Architects and built by Tait Towers. Willie Williams provided creative direction for the firms and served as the tour's lighting director. The  stage was fabricated by Tait and supported by a  sub-deck built by Stageco. A  thrust extended from the main stage and connected to a  B-stage shaped like a Joshua tree; it represented the shadow of a tree that appeared on the video screen. The B-stage featured two lifts that could lower a keyboard and drum kit below the stage for better sightlines of the band when they performed on the main stage."]}, {"page": "Experience + Innocence Tour", "response": ["The AR segment of the show was viewed using the \"U2 Experience\" mobile app for iOS and Android devices, which overlaid computer generated imagery over footage captured by a phone's camera. The AR event was triggered by pointing the camera at the \"barricage\" video screens while they were displaying charcoal drawings. Fans can also trigger it by pointing their phone's camera at the Songs of Experience album cover. Long-time U2 stage designer Willie Williams collaborated with Nexus Studios on the AR technology and with Treatment Studio to design the 3D avatar of Bono. During the pre-show music, the AR experience saw \"the stage recast as an enormous iceberg\" that began to melt and flood the audience; the imagery was a precursor to the tsunami wave that displayed on the video screens during the final song of the show's first act, \"Until the End of the World\". For the opening song, \"Love Is All We Have Left\", the app displayed an avatar of Bono hovering above the audience, accompanying the real-life Bono as he performed the song. Williams justified the use of the phone in this way by saying, \"If you're going to look at your phone we're going to give you something to look at that's part of the narrative rather than you just making a movie that nobody is ever going to watch.\""]}, {"page": "Super Bowl XXXVI halftime show", "response": ["The names of the 9/11 victims were projected by twelve 7-kilowatt xenon PIGI film projectors manufactured by E/T/C Audiovisuel and supplied by Fourth Phase Image Systems Group; they were the same type of projectors used during the band's Elevation Tour. The victims' names were projected across the interior of the Superdome, as well as onto a Kabuki scrim measuring  high by  wide. Willie Williams and Catherine Owens created the projections, while Brian Beasley operated the projectors."]}, {"page": "Hype (board game)", "response": ["The game was conceived in 1980 by Steve Fairnie, lead singer for the British post-punk bands Writz and The Technos. Fairnie recruited Willie Williams, at the time the editor of Punty fanzine but soon to become the set designer and lighting director for U2. Together, Fairnie and Williams designed the game, and pitched the idea to new games publisher Virgin Games. The result was Hype, a game featuring a circular board and high quality components that was released in 1984. In addition to the lavish game pieces, the game also included a 12\" vinyl record by The Technos. "]}]}}