{"wiki_id": "http://www.wikidata.org/entity/Q3680435", "itemLabel": "Clement Lindley Wragge", "itemDescription": "English meteorologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Clement_Lindley_Wragge", "wikipedia_page": {"main": "Clement Lindley Wragge (18 September 1852 – 10 December 1922) was a meteorologist born in Stourbridge, Worcestershire, England, but moved to Oakamoor, Staffordshire as a child. He set up the Wragge Museum in Stafford following a trip around the world. He was a Fellow of the Royal Geographical Society and in 1879 was elected Fellow of the Royal Meteorological Society in London. To the end of his life, he was interested in Theosophy and spiritualism. During his tour of India he met with Mirza Ghulam Ahmad of Qadian, the founder of the Ahmadiyya movement in Islam who had claimed to be the Mahdi, the messianic redeemer awaited by Muslims. Sir Arthur Conan Doyle sought him out in New Zealand to ask for his views on spiritualism before writing The Wanderings of a Spiritualist in 1921. After training in law, Wragge became a meteorologist, his accomplishments in the field including winning the Scottish Meteorological Society's Gold Medal and years later starting the trend of using people's names for cyclones. He travelled widely, giving lectures in London and India, and in his later years was an authority on Australia, India and the Pacific Islands.", "link_mentions": [{"page": "Ben Nevis", "response": ["A meteorological observatory on the summit was first proposed by the Scottish Meteorological Society (SMS) in the late-1870s, at a time when similar observatories were being built around the world to study the weather at high altitude. In the summer of 1881, Clement Lindley Wragge climbed the mountain daily to make observations (earning him the nickname \"Inclement Rag\"), leading to the opening on 17 October 1883 of a permanent observatory run by the SMS. The building was staffed full-time until 1904, when it was closed due to inadequate funding. The twenty years worth of readings still provide the most comprehensive set of data on mountain weather in Great Britain."]}, {"page": "December 10", "response": ["*1922 – Clement Lindley Wragge, English meteorologist and author (b. 1852)"]}, {"page": "Mount Wellington (Tasmania)", "response": ["The first weather station was set up on Mount Wellington in 1895 by Clement Lindley Wragge."]}, {"page": "Stourbridge", "response": ["* Clement Lindley Wragge, meteorologist"]}, {"page": "Charleville, Queensland", "response": ["In 1902 Charleville was the location of an unsuccessful attempt by Clement Lindley Wragge to fire cannons into the clouds in order to break a drought. The cannons used remain on display in Charleville today."]}, {"page": "Birkenhead, New Zealand", "response": ["*Clement Lindley Wragge, the meteorologist who began the tradition of using people's names for cyclones lived his final years at 8 Awanui Street, Birkenhead and planted palms in his, and neighbours', gardens."]}, {"page": "Cyclone Mahina", "response": ["Tropical Cyclone Mahina struck Australia on 4 March 1899, with a likely minimum central pressure of . Mahina ranks among the most intense cyclones ever observed in the Southern Hemisphere and almost certainly as the most intense cyclone ever observed off the Eastern states of Australia in recorded history. Clement Lindley Wragge, Government Meteorologist for Queensland, pioneered the naming of such storms and gave this storm its name, Mahina."]}, {"page": "Clement Wragge", "response": ["#REDIRECT Clement Lindley Wragge"]}, {"page": "Taringa, Queensland", "response": ["*Clement Lindley Wragge, a meteorologist, lived in Taringa in a house named Capemba in the 1890s."]}, {"page": "Inigo Owen Jones", "response": ["The Queensland Government meteorologist Clement Lindley Wragge was so impressed with Inigo's ability as a schoolboy that he recruited him as an assistant in 1888."]}, {"page": "Wragge", "response": ["* Clement Lindley Wragge (1852–1922), English meteorologist"]}, {"page": "Australian region tropical cyclone", "response": ["There is a history of tropical cyclones affecting northeastern Australia for over 5000 years; however, Clement Lindley Wragge was the first person to monitor and name them."]}, {"page": "Scottish Meteorological Society", "response": ["* Clement Lindley Wragge, awarded the Society's Gold Medal"]}, {"page": "Sandy Cape", "response": ["Clement Lindley Wragge set up an extensive network of weather stations around Queensland, including one at Sandy Cape in 1891. The cape is still used as a reference point for weather observations; however from May 2015, it has been downgraded to a daily observation, compared with the half-hourly observations at some other weather stations."]}, {"page": "List of Ahmadis", "response": ["*Clement Lindley Wragge – New Zealander meteorologist"]}, {"page": "Crohamhurst Observatory", "response": ["In 1888 he left school to take up employment at the Queensland Meteorological Bureau working for Clement Lindley Wragge, who had been appointed Colonial Meteorologist in 1887. At the Queensland Meteorological Bureau, Jones was trained in taking weather readings. He worked there until his family left Brisbane in late 1892 to take up residence on a property near Peachester, that they named Crohamhurst after Lord Goschen's Surrey estate."]}, {"page": "Cyclone Leonta", "response": ["The cyclone was named by notable meteorologist Clement Lindley Wragge."]}, {"page": "Ahmadiyya in Australia", "response": ["In another unrelated development, Clement Lindley Wragge, was an English-born meteorologist, who spent the majority of his career in Australia. However, to the end of his life, he was interested in theosophy and spiritualism. During his tour of India, in 1908, Wragge was delivering a lecture in Lahore, following which he was approached by Mufti Muhammad Sadiq, who requested him to meet the founder of the Ahmadiyya movement, Mirza Ghulam Ahmad. The meeting took place during the midday on 12 May 1908, roughly two weeks before Ahmad's death. The dialogues between the two are recorded in Malfūzāt, a set of books comprising the discourses of Ahmad. According to the letters written to Mufti Muhammad Sadiq, a companion of Ahmad, held in Ahmadiyya historical records, Wragge is said to have become a Muslim, and is said to have stayed so until his death. However, personal family records may suggest that Wragge remained a theosophist throughout the rest of his life.Wragge family papers, Auckland Institute and Museum Library"]}, {"page": "Borough Hall, Stafford", "response": ["In the early 1880s, the reading room on the ground floor was expanded to incorporate a library and a museum: the latter contained a collection of ethnographic, zoological and geological exhibits established by the meteorologist, Clement Lindley Wragge, before he moved to Australia in 1883. The building was extended by three bays to the south east in 1888: the extension featured terracotta carvings in the tympanum above each of the windows on the first floor. The library and the museum moved out of the borough hall to a dedicated Carnegie library which was established at The Green in 1913, so freeing up additional space in the borough hall for municipal offices."]}, {"page": "Clement L. Wragge", "response": ["#REDIRECT Clement Lindley Wragge"]}]}}