{"wiki_id": "http://www.wikidata.org/entity/Q368107", "itemLabel": "Ralph Heskett", "itemDescription": "Catholic bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Heskett", "wikipedia_page": {"main": "Ralph Heskett (born 3 March 1953, in Sunderland, England) is an English Roman Catholic prelate who has been the Bishop of Hallam since July 2014, having immediately before that been Bishop of Gibraltar from 2010 to 2014.", "link_mentions": [{"page": "Cathedral Church of St Marie, Sheffield", "response": ["Following the re-opening in November 2012, Bishop John Rawsthorne retired at the age of 78. In July 2014, Bishop Ralph Heskett was installed as the third Bishop of Hallam."]}, {"page": "Bishop of Hallam", "response": ["On 20 May 2014, the Right Reverend Ralph Heskett, C.Ss.R., was appointed the 3rd Bishop of Hallam by Pope Francis. Bishop Heskett served as  Bishop of Gibraltar from 2010 to 2014.", "| Ralph Heskett, C.Ss.R."]}, {"page": "Redemptorists", "response": ["* Ralph Heskett (born 1953) Bishop of Gibraltar"]}, {"page": "Roman Catholic Diocese of Hallam", "response": ["The first Bishop of Hallam was Gerald Moverley, who resigned in July 1996 and died later that year.  The second bishop was John Rawsthorne, who had previously been an auxiliary bishop of Liverpool and titular bishop of Rotdon. The third and current incumbent is Ralph Heskett, C.Ss.R., who had previously been Bishop of Gibraltar.", "|10 July 2014 – present||Ralph Heskett, C.Ss.R.||Bishop of Gibraltar; appointed 20 May 2014"]}, {"page": "John Rawsthorne", "response": ["On his 75th birthday in 2011, in accordance with Canon 401 §1 of the Latin Church 1983 Code of Canon Law, Bishop Rawsthorne offered his resignation as Bishop of Hallam to Pope Benedict XVI, but was refused and remained in office for the next three years. On 20 May 2014, it was announced by the Vatican that Pope Francis had appointed the Right Reverend Ralph Heskett, Bishop of Gibraltar to succeed Rawsthorne as Bishop of Hallam."]}, {"page": "Bernard Patrick Devlin", "response": ["Bishop Emeritus Devlin died at the age of 89, in the early morning of 15 December 2010 at the Cathedral's Clergy House. By noon his body had been moved to St. Theresa's Church by Monsignors Paul Bear and Charlie Azzopardi and other clergy, escorted by two riders of the Royal Gibraltar Police, where his body lay in state until his funeral. The coffin bearing his body was then transferred to the City Hall at 4:30pm on 17 December from where it was carried in procession by members of the Royal Gibraltar Regiment and essential services to the Cathedral of St. Mary the Crowned via Parliament. The procession was headed by the drums and bagpipes of the Gibraltar Sea Scouts and  flanked by the Knights of the Holy Sepulchre, behind the Knights of St Gregory the Great, and local and visiting clergy including the Bishop of Cádiz and priests from the Campo de Gibraltar. A funeral mass was celebrated at 5:00pm in the Cathedral by Bishop Ralph Heskett. The congregation was headed by Governor of Gibraltar Sir Adrian Johns, Chief Minister of Gibraltar Peter Caruana, Leader of the Opposition Joe Bossano and other local dignitaries and representatives from various faiths. His body was later laid to rest in the Cathedral Crypt as is customary with Bishops."]}]}}