{"wiki_id": "http://www.wikidata.org/entity/Q3687591", "itemLabel": "Lady Constance Grosvenor", "itemDescription": "(1875-1957); wife of Anthony Ashley-Cooper, 9th Earl of Shaftesbury", "wikipedia_url": "https://en.wikipedia.org/wiki/Constance_Ashley-Cooper,_Countess_of_Shaftesbury", "wikipedia_page": {"main": "Constance Ashley-Cooper, Countess of Shaftesbury DStJ (22 August 1875 – 8 July 1957), formerly Lady Constance Sibell Grosvenor, was the wife of The 9th Earl of Shaftesbury. She was the daughter of Victor, Earl Grosvenor, and his wife, the former Lady Sibell Mary Lumley, daughter of The 9th Earl of Scarbrough. Her paternal grandfather was The 1st Duke of Westminster.\nShe married the earl on 15 July 1899. She was invested as a Dame of Justice of the Order St. John of Jerusalem (DJStJ) and served as a Lady and Extra Lady of the Bedchamber to Queen Mary, wife of King George V, between 1906 and 1953.\nThe earl and countess had five children:\n\nMajor Anthony Ashley-Cooper, Lord Ashley (4 October 1900 – 8 March 1947).\nLady Mary Sibell Ashley-Cooper (3 October 1902 – 2 August 1936), who married The 3rd Baron Alington.\nLady Dorothea Louise Ashley-Cooper (29 April 1907 – 1987), who married The 1st Viscount Head.\nLady Lettice Mildred Ashley-Cooper (12 February 1911 – 1990), Flight Officer, W.A.A.F.; European War 1939–45 (despatches)\nMajor Hon. Anthony John Percy Hugh Michael Ashley-Cooper (5 October 1915 – 1986), who married Julian Petherick and had four daughters.One of the homes of the earl and countess was Belfast Castle, which had been built in the 1860s for The 3rd Marquess of Donegall, the earl's maternal grandfather. However, the couple mainly lived on their English estate and spent no time in Belfast after the Partition of Ireland. In 1934, they presented the castle to the city of Belfast. The Chapel of the Resurrection, originally intended as a family mausoleum, was presented to the Church of Ireland, and the remainder of the grounds were sold for housing.Photographs of the countess by Bassano Ltd are held by the National Portrait Gallery.", "link_mentions": [{"page": "Anthony Ashley-Cooper, 8th Earl of Shaftesbury", "response": ["*Anthony Ashley-Cooper, 9th Earl of Shaftesbury (1869–1961), married Lady Constance Grosvenor, elder daughter of Earl Grosvenor, eldest son of The 1st Duke of Westminster"]}]}}