{"wiki_id": "http://www.wikidata.org/entity/Q3682648", "itemLabel": "Colin Moulding", "itemDescription": "English bassist, songwriter and vocalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Moulding", "wikipedia_page": {"main": "Colin Ivor Moulding (born 17 August 1955) is an English bassist, singer, and songwriter who was one of the core members of the rock band XTC. Though he was less prolific a songwriter than his bandmate Andy Partridge, Moulding wrote their first three charting UK singles: \"Life Begins at the Hop\" (1979), \"Making Plans for Nigel\" (1979) and \"Generals and Majors\" (1980).", "link_mentions": [{"page": "August 17", "response": ["*1955 – Colin Moulding, English singer-songwriter and bassist "]}, {"page": "XTC", "response": ["XTC were an English rock band formed in Swindon in 1972. Fronted by songwriters Andy Partridge (guitars, vocals) and Colin Moulding (bass, vocals), the band gained popularity during the rise of punk and new wave in the 1970s, later playing in a variety of styles that ranged from angular guitar riffs to elaborately arranged pop. Partly because the group did not fit into contemporary trends, they achieved only sporadic commercial success in the UK and US, but attracted a considerable cult following there and in Japan. They have since been recognised for their influence on post-punk, Britpop and later power pop acts.", "Andy Partridge and Colin Moulding grew up on Penhill council estate in Swindon. Partridge jokingly characterised the community as being populated almost entirely by people with physical, mental or emotional defects. In the 1960s, he was a fan of contemporary pop groups like the Beatles, but was intimidated by the process of learning guitar. When the Monkees grew popular, he became interested in joining a music group. He recalled watching local guitarist Dave Gregory performing Jimi Hendrix-style songs at churches and youth clubs: \"Sort of acid-skiffle. I thought, 'Ah, one day I'll play guitar!' But I didn't think I would be in the same band as this kid on the stage.\" Partridge eventually obtained a guitar and taught himself how to play it with no formal training. At the age of 15, he wrote his first song, titled \"Please Help Me\", and attracted the nickname \"Rocky\" for his early guitar mastery of the Beatles' \"Rocky Raccoon\" (1968). By the early 1970s, his music tastes had transitioned \"from the Monkees to having a big binge on this Euro-avant-garde stuff. I got really in deep.\" One of his first bands was called \"Stiff Beach\", formed in August 1970. In early 1972, Partridge's constantly evolving group settled into \"Star Park\", a four-piece that featured himself with guitarist Dave Cartner, drummer Paul Wilson, and a bassist nicknamed \"Nervous Steve\".", "In 1972, Partridge became closer acquainted with Gregory, a diabetic then suffering from a bout of depression, while working as an assistant at the Bon Marche record shop in Swindon. Gregory was playing the Mahavishnu Orchestra's album The Inner Mounting Flame (1971), which he later called \"one of the watershed moments in my musical education.\" Partridge met Colin Moulding at the Stage Bar on Swindon's Old Town's Union Row, later known as Long's. Moulding had been playing bass since 1970 \"because I liked music [and] I thought that playing a bass, with four strings, would be infinitely easier than playing a guitar, with six strings. That was a horrible misconception!\". At the end of 1972, Moulding and drummer Terry Chambers joined Partridge's band, replacing Nervous Steve and Paul Wilson, and the group was renamed \"Star Park (Mark II)\". Other members would frequently join and leave the group.", "In July 2008, Partridge wrote in the Swindon Advertiser that he believed his \"musical partnership with Colin Moulding has come to an end. For reasons too personal and varied to go into here, but we had a good run as they say and produced some real good work. No, I won't be working with him in the future.\" In December, Moulding resurfaced for a live radio interview where he confirmed his recent disillusionment with music, but revealed that he was thinking of working on solo material. His given reasons for the break-up were financial discord, disagreement over the extent of the Fuzzy Warbles project, and a \"change in mindset\" between him and Partridge. He also stated that he and Partridge were once again communicating directly by email.", "XTC's principal songwriters were guitarist Andy Partridge and bassist Colin Moulding. Partridge, who wrote the majority of XTC's songs, was the group's frontman and de facto leader. He drove the band's image, designed many of their record sleeves, and handled most of their interviews. His involvement with XTC's record sleeves stemmed from his disappointment with the sleeve for the \"Statue of Liberty\" single, which depicted a poorly cropped photo of the statue and the XTC logo in red. He was less successful in his attempts to involve himself in the band's music videos, as he said, the woman in charge of Virgin's video department rebuked all his ideas, some of which other groups later adopted in award-winning videos.", "* Colin Moulding – vocals, bass guitar (1972–2006)", "  bar:Colin      text:Colin Moulding", "* Great Aspirations (2017, Colin Moulding and Terry Chambers reunion EP)"]}, {"page": "1955 in music", "response": ["**Colin Moulding, English bass guitarist, songwriter and vocalist (XTC)"]}, {"page": "Barry Andrews (musician)", "response": ["Andrews joined the group formed by Andy Partridge and Colin Moulding about the same time they changed their name to XTC in 1976. He left XTC in 1978, after two albums with the band, and embarked on a solo career."]}, {"page": "Andy Partridge", "response": ["Andrew John Partridge (born 11 November 1953) is an English singer, songwriter, and record producer who founded the rock band XTC. He and Colin Moulding each acted as a songwriter and frontman for XTC, with Partridge writing and singing about two-thirds of the group's material.  While the band were a formative punk group, Partridge's music drew heavily from 1960s songwriters, and his style gradually shifted to more traditional pop, often with pastoral themes. The band's only UK top 10 hit, \"Senses Working Overtime\" (1982), was written by Partridge.", "In late 1972, Partridge's Star Park was joined by bassist Colin Moulding and drummer Terry Chambers. The band became known as XTC in 1975 and signed to Virgin Records in 1977. Partridge wrote the majority of XTC's songs, was the band's frontman and de facto leader, and in Moulding's view, typically acted as an \"executive producer\" for their albums. His early XTC songs were marked by his distinct singing style, something he jokingly described as a \"walrus\" or \"seal bark\", but otherwise an amalgamation of Buddy Holly's \"hiccup\", Elvis Presley's vibrato, and \"the howled mannerisms of Steve Harley.\" He later dismissed most of his initial output as premature songs \"built around this electric wordplay stuff\". ", "In the 1990s, Partridge became regarded as \"godfather\" to the nascent Britpop movement due to his earlier work with XTC. They released several more albums on Virgin and two more on their own label, Idea Records, before going on hiatus in 2006. In July 2008, Partridge wrote in the Swindon Advertiser that he believed his \"musical partnership with Colin Moulding has come to an end. For reasons too personal and varied to go into here, but we had a good run as they say and produced some real good work.\""]}, {"page": "Oranges & Lemons (album)", "response": ["The album is primarily pop and rock, although a variety of other styles are plundered throughout, such as jazz, reggae, hard rock, Middle Eastern music and Zairean soukous. 12 of the album's 15 tracks were written by guitarist Andy Partridge, with the rest by bassist Colin Moulding. The work projected brighter, more upbeat and aggressive moods than Skylarking, and the harsher effect returned the group closer to the sound of their earlier records. Lyrically, most of the songs focus on parent-child relationships and the state of world affairs. Partridge's ornate vision for the psychedelic opening track \"Garden of Earthly Delights\" exemplified the album's general aesthetic, which he described as songs that could be singles in a \"bizarre perfect universe\".", "In early 1988, XTC began rehearsing material for their next LP. At the suggestion of A&R executive Jeremy Lascelles, young American producer Paul Fox was recruited based on the strength of a Boy George remix that the label commissioned of him. Partridge disliked the original track but enjoyed Fox's remix: \"It was really shiny, powerful and impressive.\" Fox subsequently flew to England and met Partridge at his home: \"He was obviously a huge fan of the band and was willing to translate what we wanted onto tape.\" He offered them a cheap studio rate in Los Angeles, which the band accepted. Another reason for recording in the US with an American producer, guitarist Dave Gregory said, was that the US had become \"our biggest market\". XTC, accompanied by the Moulding and Partridge families, arrived in Los Angeles on 12 May and stayed at the Oakwood Apartments in north Hollywood. The families returned home after two months; Partridge and bassist Colin Moulding then shared an apartment for the remainder of their stay.", "Commenting on the influence of the Beatles, Partridge said, \"There is some Beatles in our music, but also some Captain Beefheart, some jazz bands, some others who were not necessarily musicians, like Miró, Walt Disney ...  If people see only some Beatles, it is because they want to search only for some Fab Four.\" He acknowledged that it was their first work in which they were conscious that they had a record-buying audience, particularly in the US. External stresses affecting the group included their ongoing litigation against former manager Ian Reid. Colin Moulding remembered, \"it was about to come to a head, and that was the worrying thing ... If we hadn't had a relatively successful record with Oranges and Lemons at that time, we would have been in deep shite\".", "* Colin Moulding – vocals, bass"]}, {"page": "Black Sea (XTC album)", "response": ["In August 1979, XTC released their third LP Drums and Wires, a more pop-oriented venture than the previous Go 2 (1978). It was met with positive reviews and a number 34 chart peak. Bassist Colin Moulding's dissatisfaction with XTC's \"quirky\" reputation inspired the group to take a more accessible approach with the album. In his recollection, \"Up until that point, we were viewed as a poor man’s Talking Heads or something ... when we came out with Drums and Wires it was like a different band, really.\" Lead single \"Making Plans for Nigel\" went further to propel the band's popularity, with every date of their proceeding UK tour sold-out. They still felt that they were not \"fashionable\" in England. The LP sold particularly well in Canada and other parts of the world, but in England, sales were at a minimal improvement from their previous records.", "Black Sea received critical acclaim. An unnamed Billboard reviewer deemed the album \"consistently appealing and more accessible than [Drums and Wires]. The vocals of Andy Partridge and Colin Moulding have an attractive breeziness and the instrumentation is tight.\" In Musician, Roy Trakin wrote of XTC as among \"the new English art rock\" and praised Black Seas successful fusion of \"Partridge's love of rhythm and Moulding's affinity for melody ... Songs like 'Towers of London' and 'Burning With Optimism's Flames' show the two approaches finally achieving a seamless synthesis.\"", "*Colin Moulding – vocals, Epiphone Newport bass"]}, {"page": "English Settlement", "response": ["On 2 June, XTC performed their last gig of the year and their last ever British date, in Cardiff. Partridge requested to cease touring, but was opposed by Virgin Records, his bandmates, and the band's management. Bassist Colin Moulding and guitarist Dave Gregory were confused at Partridge's unwillingness to tour and believed that he would reconsider once the next album was finished. Moulding explained: \"The problem for us is that we had seen Andy in the early days and witnessed how great he was with an audience. For us then, this came out of the blue.\" Partridge did not approach drummer Terry Chambers due to an expected hostile reaction. Further to the band's demoralisation was their poor financial situation, as they never received any of the revenue generated by the increasing number of sold-out shows they performed. This made Gregory and Chambers particularly adverse to Partridge's proposal, since they were not songwriters and perceived a much smaller share of publishing royalties.", "Creems Jim Farber took issue with the political songs, namely \"Melt the Guns\", and said \"The only problem is that the music and vocals of Andy Partridge and Colin Moulding are so entertainingly odd, they tend to deflate the stern-faced lyrics. ...  As a whole, XTC may not shake, rattle and roll – but they do sputter, twitch and gyrate, and sometimes that can get you through the night just as well.\" Mark Dighton of The Michigan Daily opined that \"there isn't really much wrong with English Settlement\" apart from being \"uncomfortably far from their best work.\" He praised its \"lyrical intelligence\" and added that most of the songs \"would benefit greatly from a more adventurous and upfront attack.\"", "*Colin Moulding – lead vocals, backing vocals, fretless bass, Fender bass, mini-Korg synthesizer, piano, percussion"]}, {"page": "List of bass guitarists", "response": ["* Colin Moulding (XTC)"]}, {"page": "Garden of Earthly Delights", "response": ["The song features modalities associated with Arabic music. Its introduction noises were a preset sample called \"Eastern Bazaar\" taken from one of producer Paul Fox's synthesizers. The drum track is a mixture of Pat Mastelloto's live drumming and samples of his playing. Colin Moulding thought of the bassline as the onomatopoeia \"izzy balooba\", spoken by Jambi the Genie from Pee-Wee's Playhouse. One of the slide-down parts was played by turning down the tuning peg of his bass guitar. The guitar solo, played by Partridge, was filtered through two harmonizers set to different  intervals.", "* Colin Moulding – bass guitar"]}, {"page": "Nonsuch (album)", "response": ["Produced by Gus Dudgeon, 13 of the album's 17 tracks were written by guitarist/leader Andy Partridge, with the rest by bassist Colin Moulding, while Dave Mattacks of Fairport Convention was recruited on drums. Unlike previous XTC albums, Partridge composed many of his songs using a keyboard. Due to the album's lyric content, which covers topics ranging from love and humanity to the Gulf War and P. T. Barnum, Nonsuch has been described as the band's darkest and most political album. The cover depicts an illustration of the former Nonsuch Palace, chosen after the band had settled on the title \"nonesuch\", which Partridge felt summed up the album's variety of music. It was their third double album when issued on vinyl.", "After the band's double album Oranges & Lemons (1989) was released to acclaim from music critics and modest commercial success, XTC took a short break. Band leader Andy Partridge produced And Love For All (1989), the second album by The Lilac Time, while also compering for an unbroadcast children's game show named Matchmakers, and Dave Gregory played for Johnny Hates Jazz, Marc Almond and Francesco Messina whilst also producing for Cud, while Colin Moulding performed a special event concert with David Marx and the Refugees, a Swindon-based band that reunited him with former XTC member Barry Andrews. The band soon reunited and began writing their next, tenth album, the soon-to-become Nonsuch, determined to record their new compositions in their native England, as recording Oranges & Lemons in Los Angeles had made the band absent from their families back in England.", "Thirteen of the songs are written by Partridge, with the remaining four written by Colin Moulding. In Isler's opinion, Partridge's songs are concerned with themes such as \"love, politics and the human comedy,\" and noting songs which \"[blur] these topical boundaries,\" while the NME noted lyrics about omnibuses, orchards and miscreants. Blogger Roger Friedman of Details noted lyrical content ranging from book burning, the Gulf War and P.T. Barnum and felt the album was a song cycle, while, citing themes of sad retirement in \"Bungalow\" and maddening alienation in \"Rook\", Martin Townsend of Vox called the album \"precisely of its time,\" feeling it to reflect \"the mental and physical landscape of the [then-current] recession,\" and felt it was arguably the band's darkest album. It has also been cited as the band's most political album. Unlike previous XTC albums, Partridge composed many of his songs on Nonsuch using the keyboard, an instrument Partridge referred to as \"this grinning shark; stroke its teeth and any minute it'll swallow you up.\" He said he was so unfamiliar with the keyboard that he played it \"by drumming on it, two fingers here, two fingers there.\"", "New 2.0 stereo and 5.1 surround sound mixes from the original Nonsuch multitracks by Steven Wilson were released by Partridge's label Ape Records on 4 November 2013. It was released as single CD, CD+DVD and CD+Blu-Ray editions, the video disc of the latter two editions including a plethora of bonus material, including a DVD-Audio version of the album, home demos of the songs by Andy Partridge, work tapes of several songs by Colin Moulding and, exclusively to the Blu-Ray edition, a 48-minute \"making of\" documentary documenting the album's recording and the music videos for \"The Disappointed\" and \"The Ballad of Peter Pumpkinhead\". One notable change with the 2013 versions is that the crossfades between several songs were removed, a decision Wilson persuaded Partridge into allowing.", "*Colin Moulding – vocals, bass guitar, electric guitar, acoustic guitar", "String and brass arrangements by Dave Gregory, except \"Rook\" and \"Omnibus\" by Andy Partridge and \"War Dance\" by Colin Moulding. Strings on \"The Disappointed\" arranged by Andy Partridge and Dave Gregory."]}, {"page": "Michael Steele (musician)", "response": ["Steele played in many Los Angeles bands between 1976 and 1983, including the power-pop outfit Elton Duck (1979–80), an early version of Slow Children (1979), Toni and the Movers with Jack Sherman (1980–81), the improvisational band Nadia Kapiche (1981) and a brief period as bass player in avant-garde rock outfit Snakefinger. Focusing on her musical technique and frequently playing live, in this period Steele became a highly regarded bassist noted for her melodic style and rich tone, influenced by bassists such as Paul McCartney, John Entwistle, Colin Moulding and Carol Kaye."]}, {"page": "Mummer (album)", "response": ["*Colin Moulding – vocals, bass"]}, {"page": "White Music", "response": ["Village Voice critic Robert Christgau wrote in his review of the album: \"Although it took a year and a half for this debut album by the premier English art-pop band to get released in the States, two Andy Partridge songs on side one aim directly at the American market—'Radios in Motion,' which mentions Milwaukee, surely isn't about the BBC, and the avowed purpose of 'Statute of Liberty' is to get a look up her skirts. The third, 'This Is Pop,' is why he missed—radio programmers resent anyone telling them their business, especially subversives who favor herky-jerk rhythms, jerky-herk harmonies, Lene Lovich radar noises, and depressing subject matter. Colin Moulding's songs, on the other hand, are aimed at bored Yes fans, which is why he missed—the lad doesn't know that Yes fans like being bored.\"", "*Colin Moulding – bass guitar, vocals"]}, {"page": "Go 2", "response": ["Keyboardist Barry Andrews appeared at the sessions with several original songs, but frontman Andy Partridge did not feel they were right for the band. He began taking bassist Colin Moulding and drummer Terry Chambers out for drinks without inviting Partridge, allegedly in an attempt to take over the group. After most of Andrews' songs were dropped from the final track list, the keyboardist told journalists that he foresaw the band \"explod[ing] pretty soon\".", "*Colin Moulding – bass and vocals"]}, {"page": "Drums and Wires", "response": ["Bassist Colin Moulding's dissatisfaction with XTC's \"quirky\" reputation inspired the group to take a more accessible approach, starting with the non-album single \"Life Begins at the Hop\". Drums and Wires was recorded in four weeks at the newly built Town House studio in London with producer Steve Lillywhite and engineer Hugh Padgham, who were beginning to develop their signature gated reverb production technique, as demonstrated on the album opener and lead single \"Making Plans for Nigel\". Lyrically, the album focuses on the trappings or titillations of the modern world, with several songs about submitting to external forces. Frontman and guitarist Andy Partridge designed the cover artwork, which depicts the band logo forming the outline of a face.", "Coinciding with Gregory's arrival, in April 1979, the band recorded \"Life Begins at the Hop\", written by bassist Colin Moulding, and their first record with Lillywhite producing. After the band went on tour for the single, sessions for Drums and Wires resumed from 25 June to July. By this time, Moulding \"wanted to ditch [our] quirky nonsense and do more straight-ahead pop.\" He said that when Andrews was in the band, Partridge had \"no kind of foil\" to work with, as he \"used to like the real kind of angular, spiky, upward-thrusting guitar ... if one is angular, the other has to kind of straighten him out, you know? It was just going too far the other way, I felt. So when Dave came in, and was a much straighter player, it seemed to make more sense, I think.\" Partridge opined that, before then, Moulding's songs \"came out as weird imitations of what I was doing, 'cause he thought that was the thing to do. ... On Go 2 he was sort of getting his own style, and by Drums and Wires he really started to take off as a songwriter.\" Gregory remembered that XTC's songs \"inspired a different approach to listening and playing from that which I'd grown up with. I simply couldn't continue grinding out old blues clichés and power chords, so I began to think more in terms of the songs as the masters and the instruments as the servants.\" The album was recorded in three weeks and mixed in two.", "Musically, the album was described by Paste critic Lizzie Manno as featuring \"a bold, drum-centric\", \"polychromatic\", and \"coltish\" pop style, with \"a skittish punk energy and fierce grooves\". She went on to say its \"off-kilter fusion of art rock and New Wave swells with Andy Partridge and Colin Moulding’s mercurial pop yelps and pointed guitars\", and that the addition of Gregory to the band lent the music \"space for their transfixing guitar interplay\". In the words of Chris Dahlen from Pitchfork, the band pursued \"pure pop disguised as jittery post-punk, all played with teeth-chattering intensity\", while Milenio writer Ernesto Herrera called the album a representative record of new wave. Editors at Trouser Press opined that it was a \"spiky art-pop gem\". Writing for Ultimate Classic Rock in 2019, critic Michael Galluci said the album is \"45 or so minutes of art-rock\" and argued that, \"even today, Drums and Wires sounds like an unconventional work among the period's angular, arty and evolving New Wave.\"", "Drums and Wires received favourable reviews, and according to biographer Chris Twomey, was \"widely acknowledged in the music business\". NME Paul Morley decreed that XTC were \"doing all sorts of they've never done before and never hinted they would. ... They have moved many steps forward to making a rock classic.\" In Billboard, the album was deemed \"an interesting package from a label that's beginning to make headway in the U.S. It's fresh rock 'n' roll in a new wave vein with a dash of '60s English melody. Of particular note is the inventive mix as instruments sparkle in both left and right channels.\" The Village Voice critic Robert Christgau wrote: \"My reservations about this tuneful but willfully eccentric pop are ideological. ... Partridge and Colin Moulding are moving toward a great art-pop mean that will set standards for the genre. Catchy, funny, interesting—and it rocks.\"", "*Colin Moulding – vocals, bass", "*Andy Partridge, Colin Moulding, Dave Gregory, Terry Chambers, Steve Warren, Hugh Padgham, Al Clark, Laurie Dunn – Vernon Yard Male Voice Choir on \"Roads Girdle the Globe"]}, {"page": "Skylarking", "response": ["Guitarist Dave Gregory was a fan of Rundgren's music, particularly since hearing the 1978 album Hermit of Mink Hollow. His bandmates were not as familiar with the producer. For bassist Colin Moulding, \"I'd seen him on stage, on TV, with his Utopia stuff, and I thought it was way over the bastard top ... Then Dave started playing me one or two things. I heard 'I Saw the Light,\" and I thought, 'Christ, that's a really good song!' I didn't know he had that side to him. All that Partridge knew about Rundgren was his solo album Something/Anything? (1972). Gregory urged the group to work with him: \"I reminded Andy that Todd had produced one of his favourite New York Dolls records [New York Dolls, 1973]. In the absence of any better alternatives, he agreed.\" Once contacted, Rundgren offered to handle the album's entire recording for a lump sum of $150,000—including tape costs, studio hire, lodging, and his production fee—which the band accepted.", "*Colin Moulding – vocals, bass guitar "]}, {"page": "Apple Venus Volume 1", "response": ["The making of Volume 1 was fraught with personal conflicts, budgetary concerns and numerous false starts. Most of the orchestral portions were rush-recorded in one day with a 40-piece symphony at Abbey Road Studios, and had to be edited over a months-spanning period. It was the last album to include guitarist Dave Gregory, who departed XTC while in the middle of the sessions due to frustrations with Partridge. By the time of its release, Partridge no longer viewed XTC as a band, and preferred it to be known as a \"brand\" covering his and bassist Colin Moulding's music.", "By 1997, Partridge and bassist Colin Moulding had amassed over 40 new songs, most of which were written by the former. The 11 that were ultimately selected for Apple Venus Volume 1 were written between 1992 and 1994. Partridge's offerings were an elaboration on the more orchestral style he previously developed with Nonsuch tracks \"Omnibus\", \"Wrapped in Grey\" and \"Rook\". When Nonsuch was completed, Partridge purchased an E-mu Proteus, and felt inspired by its samples, even though he was not a proficient keyboard player. His writing process changed in that, for some cases, the arrangement was completed before the actual composition. The songs changed little from how they were conceived on their early demo tapes when recorded in a professional studio.", "Released on 17 February 1999, Apple Venus Volume 1 was met with critical acclaim and moderate sales. It had minimal promotion. PopMatters Sarah Zupko deemed the album \"more than worth the wait. Andy Partridge and Colin Moulding used their time off well, lavishing extra care and attention on this set of tunes that rank among the best music they have ever produced. ... this record is a shoo-in for one of 1999’s best records\". Scott Schinder gave the album an A- for Entertainment Weekly, writing: \"The gorgeous yet vaguely unsettling arrangements are well suited to the exquisitely flawed humanism of Andy Partridge’s and Colin Moulding’s compositions, lending an appropriately uneasy edge to bittersweet tunes like 'I Can’t Own Her,' 'Greenman,' and 'The Last Balloon.'\"", "*Colin Moulding – vocals, bass guitar"]}, {"page": "The Big Express", "response": ["XTC's previous album Mummer was their first work after resigning from live performances in 1982. It was released in August 1983 after several months of delays due to the band's creative difference with producer Steve Nye and Virgin Records and became the group's lowest-charting album to date. Virtually every contemporary review of the album accused the band of falling out of touch with the contemporary music climate. Bassist Colin Moulding thought that \"when we came back from America after our aborted tour of 1982 ... people like Spandau Ballet had moved onto the scene; new groups were coming up and there was no place for us.\" Dissatisfied with the downturn in their career, drummer Terry Chambers quit the group early in the Mummer sessions to take care of his wife and newborn child in Australia.", "Erica Wexler, then a reviewer for Musician magazine, suggested that \"XTC is never short of ideas; their only real flaw is a propensity for crowding together too many. But in this day of pop cliché, I'd take XTC's senses-working-overtime anytime. I just hope they're still not too far ahead of their time.\" In 1987, musician and writer Dave Bidini dubbed it perhaps \"XTC's most humorless album - a sort of no-fun answer to the half-serious question asked on English Settlement. ... Colin Moulding gets philosophy-weird and Andy Partridge sounds depressed; the direction of the band seems blurred.\"", "* Colin Moulding – vocals, bass"]}, {"page": "Wasp Star (Apple Venus Volume 2)", "response": ["*Colin Moulding – vocals, bass guitar, harmonica on \"In Another Life\", guitar on \"Boarded Up\""]}, {"page": "25 O'Clock", "response": ["25 O'Clock is the debut record by English rock band the Dukes of Stratosphear and the eighth studio album by XTC, released on April Fools Day 1985 through Virgin Records. It was publicised as a long-lost collection of recordings by a late 1960s group, but actually consisted of new tracks recorded by Andy Partridge, Colin Moulding, and Dave Gregory of XTC with Gregory's brother Ian.", "Each musician adopted a pseudonym: \"Sir John Johns\" (Partridge) \"Lord Cornelius Plum\" (Dave), \"The Red Curtain\" (Colin Moulding) and \"E.I.E.I. Owen\" (Ian). Partridge's moniker came from a 1967 DC Comics martian character, while Moulding's was derived from an old nickname referring to the length of his hair. The band dressed themselves in Paisley outfits for the sessions and lit scented candles. Partridge: \"Dave Gregory took to the Dukes a bit too much. Elephant jumbo cord flares, big white belt, beads - we were a bit worried.\" In contrast to himself and Gregory, \"Colin was more of a heavy metal kid. He was more into Black Sabbath and Uriah Heep and people like that. So he didn't really have much of a grasp on psychedelia.\"", "* The Red Curtain (Colin Moulding) – vocals, bass, rhythm guitar on \"What in the World??...\""]}, {"page": "List of people from Swindon", "response": ["** Colin Moulding – founding member, second songwriter, vocalist, and bassist for the band. Born in Swindon."]}, {"page": "Terry Chambers", "response": ["Chambers returned to the UK in 2016 after meeting his old girlfriend Lynn Farrar. He recorded an EP with fellow ex-XTC member Colin Moulding, called Great Aspirations by TC&I, which was released in October 2017."]}, {"page": "Wonderland (XTC song)", "response": ["\"Wonderland\" is a single by XTC released in June 1983, written by Colin Moulding and taken from the album Mummer.", "#\"Wonderland\" (Colin Moulding) – 3:50", "*Colin Moulding – vocals, bass", "Category:Songs written by Colin Moulding"]}, {"page": "3D EP", "response": ["*Colin Moulding – bass and vocals"]}, {"page": "Take Away / The Lure of Salvage", "response": ["#\"The Day They Pulled The North Pole Down\" (Colin Moulding/Partridge) (3:50) – remix of \"Heatwave\" (using the backing tracks and slowing them down)"]}, {"page": "Fender Musicmaster Bass", "response": ["* Colin Moulding (XTC)"]}, {"page": "Syd Barrett", "response": ["Many artists have acknowledged Barrett's influence on their work. Paul McCartney, Pete Townshend, Blur, Kevin Ayers, Gong, Marc Bolan, Tangerine Dream, Genesis P-Orridge, Julian Cope, Pere Ubu, Jeff Mangum, The Olivia Tremor Control, The Flaming Lips, Animal Collective, John Maus, Paul Weller, Roger Miller, East Bay Ray, Cedric Bixler-Zavala,Weller, Miller and Ray have all called Barrett one of their favourite guitarists, whilst Bixler-Zavala calls him an influence on his music with The Mars Volta. See:  and David Bowie were inspired by Barrett; Jimmy Page, Brian Eno, Sex Pistols, and The Damned all expressed interest in working with him at some point during the 1970s. Bowie recorded a cover of \"See Emily Play\" on his 1973 album Pin Ups. The track \"Grass\", from XTC's album Skylarking was influenced when Andy Partridge let fellow band member Colin Moulding borrow his Barrett records. Robyn Hitchcock's career was dedicated to being Barrett-esque; he even played \"Dominoes\" for the 2001 BBC documentary The Pink Floyd and Syd Barrett Story."]}, {"page": "Anton Barbeau", "response": ["Barbeau has also written and produced two albums with Sacramento singer Allyson Seconds, wife of 7 Seconds' singer Kevin Seconds. Her first album, Bag of Kittens, was released in fall of 2009. The second, Little World, was released in 2016 to critical acclaim, and featured guests such as Colin Moulding (of XTC), Kimberley Rew (of The Soft Boys and Katrina and the Waves), and Scott Miller.", "In 2016, Barbeau released Magic Act, his first post-Three Minute Tease album, and his first full-length vinyl release on Spain's You Are The Cosmos label. The album was also released on CD in the US on Mystery Lawn Music. The CD and LP versions feature different mixes of the lead-off track, \"High Noon,\" with alternate bass and drum performances from Colin Moulding and Michael Urbano."]}, {"page": "Fossil Fuel: The XTC Singles 1977–92", "response": ["#\"Life Begins at the Hop\" (Colin Moulding) – 3:47"]}, {"page": "Rag and Bone Buffet: Rare Cuts and Leftovers", "response": ["Rag and Bone Buffet: Rare Cuts and Leftovers is a compilation album of songs by the English rock band XTC, released in 1990. It brings together single B-sides, BBC sessions, soundtrack contributions, the A- and B-sides of both a Christmas single released by offshoot group The Three Wise Men and solo single recorded by Colin Moulding as The Colonel,Farmer, Neville \"XTC Song Stories\", Hyperion, 9/98 as well as other obscurities."]}, {"page": "Transistor Blast: The Best of the BBC Sessions", "response": ["#\"Life Begins at the Hop\" (Colin Moulding) – 4:19 [David \"Kid\" Jensen Show: Recorded 21 May 1979; Aired 31 May 1979]"]}, {"page": "Homegrown (XTC album)", "response": ["#\"In Another Life\" (Excerpt of original demo) (Colin Moulding) – 2:02", "*Colin Moulding"]}, {"page": "Homespun (XTC album)", "response": ["#\"Frivolous Tonight\" (Colin Moulding) – 3:06", "*Colin Moulding"]}, {"page": "Waxworks: Some Singles 1977–1982", "response": ["#\"Life Begins at the Hop\" (Colin Moulding) – 3:45"]}, {"page": "Upsy Daisy Assortment", "response": ["#\"Life Begins at the Hop\" (Colin Moulding) – 3:47"]}, {"page": "Coat of Many Cupboards", "response": ["#\"Let's Have Fun\" [White Music Outtake] (Colin Moulding) – 1:19", "*Colin Moulding – Bass, Guitar, Keyboards, Vocals, Multi Instruments, Engineer"]}]}}