{"wiki_id": "http://www.wikidata.org/entity/Q3709153", "itemLabel": "David Avis", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Avis", "wikipedia_page": {"main": "David Michael Avis (born March 20, 1951) is a Canadian and British computer scientist known for his contributions to geometric computations. Avis is a professor in computational geometry and applied mathematics in the School of Computer Science, McGill University, in Montreal. Since 2010, he belongs to Department of Communications and Computer Engineering, School of Informatics, Kyoto University.\nAvis received his Ph.D. in 1977 from Stanford University. He has published more than 70 journal papers and articles. Writing with Komei Fukuda, Avis  proposed a reverse-search algorithm for the\nvertex enumeration problem; their algorithm generates all of the vertices of a convex polytope.[AF92][AF96]", "link_mentions": [{"page": "McGill University School of Computer Science", "response": ["*David Avis - Discrete optimization and computational geometry"]}, {"page": "List of people by Erdős number", "response": ["* David Avis"]}, {"page": "Vertex enumeration problem", "response": ["A 1992 article by David Avis and Komei Fukuda presents an algorithm which finds the v vertices of a polytope defined by a nondegenerate system of n inequalities in d dimensions (or, dually, the v facets of the convex hull of n points in d dimensions, where each facet contains exactly d given points) in time O(ndv) and space O(nd). The v vertices in a simple arrangement of n hyperplanes in d dimensions can be found in O(n2dv) time and O(nd) space complexity. The Avis–Fukuda algorithm adapted the criss-cross algorithm for oriented matroids."]}, {"page": "Criss-cross algorithm", "response": ["The criss-cross algorithm was used in an algorithm for enumerating all the vertices of a polytope, which was published by David Avis and Komei Fukuda in 1992. Avis and Fukuda presented an algorithm which finds the v vertices of a polyhedron defined by a nondegenerate system of n linear inequalities in D dimensions (or, dually, the v facets of the convex hull of n points in D dimensions, where each facet contains exactly D given points) in time O(nDv) and O(nD) space.The v vertices in a simple arrangement of n hyperplanes in D dimensions can be found in O(n2Dv) time and O(nD) space complexity."]}, {"page": "Avis (name)", "response": ["*David Avis (born 1951), Canadian and British computer scientist"]}, {"page": "100 prisoners problem", "response": ["David Avis and Anne Broadbent considered in 2009 a quantum theoretical variant in which team B wins with certainty."]}, {"page": "Cunningham's rule", "response": ["It has recently been shown by David Avis and Oliver Friedmann that there is a family of linear programs on which the simplex algorithm equipped with Cunningham's rule requires exponential time."]}, {"page": "Avis, David", "response": ["#redirectDavid Avis"]}, {"page": "Art Gallery Theorems and Algorithms", "response": ["Reviewer Herbert Edelsbrunner writes that \"This book is the most comprehensive collection of results on polygons currently available and thus earns its place as a standard text in computational geometry. It is very well written and a pleasure to read.\" However, reviewer Patrick J. Ryan complains that some of the book's proofs are inelegant, and reviewer David Avis, writing in 1990, noted that already by that time there were \"many new developments\" making the book outdated. Nevertheless, Avis writes that \"the book succeeds on a number of levels\", as an introductory text for undergraduates or for researchers in other areas, and as an invitation to solve the \"many unsolved questions\" remaining in this area."]}, {"page": "Komei Fukuda", "response": ["With David Avis, Fukuda proposed a reverse search algorithm for the"]}]}}