{"wiki_id": "http://www.wikidata.org/entity/Q3703061", "itemLabel": "Dave Willetts", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Willetts", "wikipedia_page": {"main": "Dave Willetts (born 24 June 1952) is an English singer and actor known for having leading roles in West End musicals.\n\n", "link_mentions": [{"page": "South Pacific (musical)", "response": ["| Emile de Becque ||A middle-aged expatriate French planter ||Ezio Pinza|| Ray Middleton, Richard Eastham, Wilbur Evans, George Britton, William Chapman, Giorgio Tozzi, Robert Goulet, Justino Díaz, Philip Quast, Dave Willetts, Brian Stokes Mitchell, Paulo Szot, Teddy Tahu Rhodes, Rod Gilfry", " It starred Helena Blackman as Nellie and Dave Willetts as Emile.Jones, Alison. \"Willetts still on song\", Birmingham Post, May 31, 2013, accessed 24 March 2018 Julian Woolford directed, with choreography by Chris Hocking. This production was most noted for its staging of the overture, which charted Nellie's journey from Little Rock, Arkansas, to the South Pacific. On entering the theatre, the audience first saw a map of the U.S., not the theater of war.Somensky, Amy. \"U.K. tour of South Pacific opens today\" , Monstersandcritics.com, August 24, 2007, accessed May 25, 2013"]}, {"page": "Evita (musical)", "response": ["Soprano Kiri Te Kanawa recorded a complete operatic version of the score with Christopher Lee as Perón. This recording, however, has never been released. Marti Webb also recorded a highlights album of sorts for the Pickwick Records label that featured Dave Willetts and Carl Wayne. It was released to coincide with the 1995 UK Tour of the show in which Webb starred."]}, {"page": "Cats (musical)", "response": ["* Old Deuteronomy: John Turner (1983–1985), John Rawnsley (1995–1997), Dave Willetts (2001), Junix Inocian (2001–2002)"]}, {"page": "Les Misérables (musical)", "response": ["*Jean Valjean:  Dave Willetts, Dudu Fisher, Martin Smith, John Owen-Jones, Simon Bowman, Drew Sarich, Alfie Boe, Ramin Karimloo, Peter Lockyer, Simon Gleeson, Killian Donnelly, Jon Robyns, Antony Hansen (u/s)"]}, {"page": "The Phantom of the Opera (1986 musical)", "response": ["*The Phantom: Martin Smith, Peter Karrie, Dave Willetts, John Owen-Jones, Ramin Karimloo, Peter Jöback, Simon Bowman, Earl Carpenter, Marcus Lovett, Peter Cousens, Peter Polycarpou, Ben Forster, Ben Lewis, Tim Howar, David Thaxton, Killian Donnelly"]}, {"page": "Aspects of Love", "response": ["A London revival ran at the Menier Chocolate Factory from July 15 to September 11, 2010, with new direction by Trevor Nunn.  The cast featured Dave Willetts as George, Rosalie Craig as Giulietta, Katherine Kingsley as Rose, and Michael Arden as Alex.Bosanquet, Theo.Nunn Revives Aspects of Love at Menier, 15 Jul  whatsonstage.com, 18 February 2010"]}, {"page": "Lorna Luft", "response": ["In 1996, Luft appeared in an Irish production of Follies in Dublin with Mary Millar, Alex Sharpe, Christine Scarry, Aidan Conway, Enda Markey, Dave Willetts and Millicent Martin. In 2002, she starred as Mama Rose in a University of Richmond school production of Gypsy."]}, {"page": "Lesley Garrett", "response": ["Garrett created the role of Cathy in the London studio recording of Bernard J. Taylor's operatic version of Wuthering Heights, which also featured Dave Willetts, Bonnie Langford and other leading British musical theatre performers. Her rendition of \"I Belong to the Earth\" was included on two of her solo albums."]}, {"page": "Theatre Royal Haymarket", "response": ["2005 productions included Victoria Wood's Acorn Antiques The Musical, starring Julie Walters, Celia Imrie and Duncan Preston, directed by Trevor Nunn\"Acorn Antiques\" , London Theatre Guide and A Few Good Men, starring Rob Lowe, Suranne Jones and Jack Ellis.\"A Few Good Men\" , London Theatre Guide 2006 featured three revivals: A Man for All Seasons, starring Martin Shaw;\"A Man for All Seasons\" , London Theatre Guide Coward's Hay Fever, with Judi Dench and Peter Bowles;\"Hay Fever\" , London Theatre Guide and Seven Brides for Seven Brothers, starring Dave Willetts and Shona Lindsay.\"Seven Brides for Seven Brothers\" , London Theatre Guide The last production of that year was Six Dance Lessons in Six Weeks, starring Claire Bloom and Billy Zane.\"Six Dance Lessons in Six Weeks\" , London Theatre Guide The first production of 2007 was Pinter's People, a compilation of Harold Pinter sketches of the past 40 years;\"Pinter's People\" , London Theatre Guide later productions of that year were The Lady from Dubuque (Albee), starring Maggie Smith;\"The Lady from Dubuque\", London Theatre Guide  David Suchet in The Last Confession;\"The Last Confession\" , London Theatre Guide and The Country Wife, starring Toby Stephens, Patricia Hodge and David Haig.Jonathan Kent Season 2007-2008, Theatre Royal Haymarket"]}, {"page": "Marti Webb", "response": ["Throughout 2012 Webb appeared as Dorothy Brock, a past-her-prime Prima Donna in a UK tour of 42nd Street. Dave Willetts and Bruce Montague also toured with the cast.", "Webb co-devised and starred in The Magic of the Musicals, a UK concert tour featuring songs from musical theatre, opposite Opportunity Knocks winner Mark Rattray. The show toured in 1991, before two follow up tours in 1992. The gold-selling album of the show was co-produced by Webb's former husband, sound engineer, Tom Button. A performance at the Bristol Hippodrome was also filmed and broadcast on BBC Television. This was followed in 1993 by a North American and Canadian tour and numerous UK versions in the following years, in which Rattray was succeeded by Dave Willetts, Robert Meadmore and most recently Wayne Sleep.Fuller, Clive. \"Theatre Reviews and Features: The Magic of the Musicals, In Concert\", bbc.co.uk, 22 February 2006; accessed 2 April 2008 The outfits for the tour were designed by Bruce Oldfield. Webb appeared in a number of the subsequent tours, whilst others featured Jacqui Scott as the headline artist.", "|Recording also featured Dave Willetts, Carl Wayne and Jess Conrad"]}, {"page": "Sunset Boulevard (musical)", "response": ["|colspan='1' align=center| Dave Willetts", "An eight-week engagement of a minimalist production, in which the actors used musical instruments, enjoyed a good run at the Watermill Theatre in Newbury over the summer of 2008.  Directed and choreographed by Craig Revel Horwood, the cast featured Kathryn Evans as Norma and Ben Goddard as Joe.  A West End transfer of the Watermill production began on 4 December 2008 prior to an official opening 15 December at the Comedy Theatre, with Evans and Goddard reprising their roles, and Dave Willetts joining the cast as Max.Shenton, Mark. \"Sunset Boulevard Will Return to the West End in December\" , Playbill, 17 November 2008 The production received rave reviews and extended its run to September 2009. However, the production closed just after initially planned on 30 May 2009.playbill.com \"London Revival of Sunset Boulevard to Close May 30\" It had originally been booking until 19 September 2009. There were plans for a UK Tour and also talks of bringing the show to Broadway\"Watermills SUNSET BOULEVARD to Close in West End May 30, 2009\"", "| Dave Willetts"]}, {"page": "Acocks Green", "response": ["*Dave Willetts, singer in musicals, was born in Marston Green in 1952 and was brought up in Acocks Green. While working for British Leyland, he got involved in amateur drama and his ability was spotted. He sang in the lead role of Valjean in Les Misérables in 1986, and took over the lead role from Michael Crawford in The Phantom of the Opera, and is famous as a top class musicals singer."]}, {"page": "42nd Street (musical)", "response": ["The limited-run production at the Dominion Theatre toured the UK starring Bonnie Langford as Peggy. Three more UK Touring productions were produced by UK Productions in 1997, 1999 and 2000. Gemma Craven starred as Dorothy in the 1997 tour, Ruth Madoc starred as Dorothy in the 1999 and 2000 productions and James Smillie starred as Julian Marsh in all three productions. The 2001 production, by UK Productions, toured the UK in 2007. The cast included Paul Nicholas as Julian for the first part of the tour, later replaced by Dave Willetts, Julia J. Nagle as Dorothy, Jessica Punch as Peggy, Graham Hoadly as Bert Barry, Shirley Jameson as Maggie Jones and Ashley Nottingham as Billy. UK Productions mounted a second UK tour of the show in 2012 with Dave Willetts reprising the role of Julian, Marti Webb playing Dorothy, Graham Hoadly as Bert Barry, Carol Ball as Maggie Jones and Mark Bramble directing.Rickwald, Bethany.\"Dave Willetts, Marti Webb Set for UK Tour of '42nd Street' \" May 15, 2012"]}, {"page": "Someone like You (musical)", "response": ["On March 22, 1990, Someone Like You opened at the Strand Theatre in London's West End. In addition to Clark, it starred Dave Willetts (The Phantom of the Opera) as the Major, Clive Carter as Kane (roles in which Clark had hoped Andy Williams and Sting would be cast) and Lewis Rae as Andy. Reviews were mixed, although most critics praised Clark's performance and her contribution to the score."]}, {"page": "Marston Green", "response": ["Dave Willetts, singer in musicals, was born in Marston Green on 24 June 1952 and was brought up in Acocks Green."]}, {"page": "Enda Markey", "response": ["Markey was born in Dublin. At sixteen, he was awarded a scholarship to train at London's Laine Theatre Arts' Musical Theatre Course. Following his training, he played Rick in the London production of A Slice of Saturday Night. He appeared in the Irish premiere of Follies with Lorna Luft, Dave Willetts and Millicent Martin. Follies was followed by an appearance in Side By Side By Sondheim, giving Markey his first starring role.   Side By Side was immediately followed by his return to A Slice of Saturday Night in Dublin, recreating the role of Rick."]}, {"page": "Erik (The Phantom of the Opera)", "response": ["* Dave Willetts replaced Michael Crawford in the London cast when Crawford was cast to open the Broadway production in 1988."]}, {"page": "Legally Blonde (musical)", "response": ["The first UK tour began on July 8, 2011, at the Liverpool Empire Theatre. The cast included Faye Brooks as Elle, Dave Willetts as Professor Callahan, and Iwan Lewis as Emmett. Liz McClarnon initially played Paulette, followed by Claire Sweeney.", "|Dave Willetts"]}, {"page": "Rags (musical)", "response": ["|Dave Willetts"]}, {"page": "Andrew Lloyd Webber discography", "response": ["|Featuring the Jay Records studio cast including Dave Willetts, Clive Rowe and Issy van Randwyck"]}, {"page": "Seven Brides for Seven Brothers (musical)", "response": ["A 2002 tour of the UK starred Dave Willetts."]}, {"page": "Bernard J. Taylor", "response": ["Taylor selected Emily Brontë's classic Wuthering Heights, composing the music. A concept album was released in 1991 with a cast of West End musical stars including a former \"Phantom Of The Opera\" Dave Willetts, as Heathcliff,  Lesley Garrett (Cathy Earnshaw), Bonnie Langford (Isabella Linton), Clive Carter (Hindley Earnshaw), Sharon Campbell (Ellen \"Nelly\" Dean) and James Staddon (Edgar Linton). It had its world premier at the Madison Theatre, Illinois, in 1993 and has since been performed in the UK, Germany, Australia, New Zealand,The Netherlands, Poland and Romania."]}, {"page": "Clive Rowe", "response": ["He appeared as \"Judas Iscariot\" opposite Dave Willetts' \"Jesus\" in a touring version of Jesus Christ Superstar. He also voiced \"Audrey 2\" in the UK tour of Little Shop of Horrors. He frequently plays the Dame in the annual Christmas pantomime at the Hackney Empire. He also starred as the lion and Uncle Henry in a theatre production of The Wiz, a black version of The Wizard of Oz, in 2011."]}, {"page": "Wuthering Heights (musical)", "response": ["Wuthering Heights is Bernard J. Taylor's musical/operatic version of Emily Brontë's 1847 novel of the same name. The musical first appeared in 1992 as a studio recording featuring Lesley Garrett as Cathy, Dave Willetts as Heathcliff, Bonnie Langford as Isabella Linton and other stars of Britain's West End stage. The show has since been translated into six languages from the original English and has been extensively staged in the UK,  USA, The Netherlands,  Germany, Poland, Romania, Australia and New Zealand. In 2008 a production was being planned in Budapest, Hungary, where Taylor's Much Ado received its European continental premiere in 2007. Lesley Garrett has included her recording of 'I Belong To The Earth' on two of her solo albums."]}, {"page": "Willetts", "response": ["* Dave Willetts, British actor"]}, {"page": "Laurence Olivier Award for Best Performance in a Supporting Role in a Musical", "response": ["| Dave Willetts"]}, {"page": "Unexpected Song", "response": ["* Dave Willetts on The Musicals Unplugged (2003)"]}, {"page": "Adaptations of Wuthering Heights", "response": ["* Wuthering Heights (1994), a musical by Bernard J. Taylor. It was first recorded in 1992 as a concept album starring Lesley Garrett, Dave Willetts, Bonnie Langford and Clive Carter. It has been translated into German, Romanian and Polish.Wuthering Heights  by Bernard J. Taylor"]}, {"page": "Wonderland (musical)", "response": ["The musical had its European premiere at the Edinburgh Playhouse in January 2017, which marked the start of a UK tour. The production was directed by Lotte Wakeman with a revised book written by Ava Eldred The production starred Kerry Ellis as Alice, Wendi Peters as the Queen of Hearts, Natalie McQueen as the Mad Hatter and Dave Willetts as the White Rabbit. Originally Carolyn Maitland was cast to play alternate Alice and Mad Hatter. Maitland pulled out before rehearsals due to disagreements with the producer and the production company Wonderland the Musical Ltd regarding her contract. At certain venues, the role of Alice was played by Rachael Wooding.", "|colspan='1' align=center| Dave Willetts"]}, {"page": "Petula Clark discography", "response": ["| align=left| \"Someone Like You\" (Duet with Dave Willetts)b/w \"Getting the Right Thing Wrong\""]}, {"page": "Stage Door Records", "response": ["*STAGE 9030: Dave Willetts - Once In A Lifetime: The 25th Anniversary Collection"]}, {"page": "Ragtime (musical)", "response": ["| align=\"center\" |Dave Willetts", "| align=\"center\" |Dave Willetts"]}, {"page": "2009 Laurence Olivier Awards", "response": ["** Dave Willetts as Max von Mayerling in Sunset Boulevard – Comedy"]}, {"page": "The Magic of the Musicals", "response": ["Mitch Sebastian was the director / choreographer from 1994 - 1998 creating new formats each season to reflect the current hit shows. Webb performed regularly on all UK and European Tours alongside Robert Meadmore, Wayne Sleep and Dave Willetts. Melanie Stace and Kerry Ellis also replaced Webb for various tours."]}, {"page": "Who Could Ask for Anything More? A Celebration of Ira Gershwin", "response": ["The show was produced by Ian Martin and directed by Paul Kafno. Those performing included: Peter Barkworth; Tracie Bennett; Sarah Brightman; Tim Flavin; Maria Friedman; Greg Horsman; Derek Jacobi; Nigel Planer; Michael Praed; Helen Shapiro and Dave Willetts. It was hosted by Charles Dance and David Soul."]}, {"page": "Natalie McQueen", "response": ["In 2017 McQueen was cast as the Mad Hatter in the European premiere of Frank Wildhorn’s Wonderland alongside Kerry Ellis, Wendi Peters and Dave Willetts.Hewis, Ben. “Meet Frank Wildhorn and the cast of Wonderland"]}, {"page": "Carolyn Maitland", "response": ["In 2020 she will be playing the role of Rebecca Hershkowitz in the Park Theatre's production of Rags the Musical playing opposite Dave Willetts who will be playing Avram."]}]}}