{"wiki_id": "http://www.wikidata.org/entity/Q3703204", "itemLabel": "David Hamid", "itemDescription": "Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Hamid", "wikipedia_page": {"main": "David Hamid (born 18 June 1955) is an Anglican bishop with British and Canadian citizenship. He has been the Suffragan Bishop in Europe since 2002.", "link_mentions": [{"page": "Bishop in Europe", "response": ["The bishop also has one suffragan bishop, known as the Suffragan Bishop in Europe (currently David Hamid) and various honorary assistant bishops from the Church of England and other churches in communion with the Church of England. Immediately prior to the 1980 (re)erection of the diocese and the creation of the post of Suffragan Bishop, the Diocese of Gibraltar and the jurisdiction of Fulham shared a full-time assistant bishop in a similar post – at least Harold Isherwood and Ambrose Weekes served in that role; indeed Weekes became the first Suffragan Bishop in 1980. (See Suffragan Bishop in Europe.)"]}, {"page": "Diocese in Europe", "response": ["The diocese is attached to the Church of England Province of Canterbury and is headed by the Bishop in Europe, who is assisted by the Suffragan Bishop in Europe. The present bishop, Robert Innes, was commissioned and consecrated on 20 July 2014,Diocese in Europe – New Diocesan Bishop Appointed  (Accessed 7 May 2014) and the current suffragan bishop is David Hamid, who was consecrated bishop on 17 October 2002.", "The diocese is led by the diocesan Bishop in Europe, Robert Innes, and the Suffragan Bishop in Europe, David Hamid."]}, {"page": "International Anglican–Roman Catholic Commission for Unity and Mission", "response": ["In 2000, Archbishop George Carey, then Archbishop of Canterbury, and Cardinal Edward Cassidy, then President of the Vatican's Pontifical Council for Promoting Christian Unity, convoked a conference of Anglican and Roman Catholic bishops at Mississauga in Canada to discern the progress made in theological conversations since the 1960s, and whether closer co-operation could be developed between the two traditions. The result was IARCCUM, which has been meeting since 2001. In February 2007, it published the first fruit of its work, the report Growing Together in Unity and Mission,https://iarccum.org/doc/?d=32 Growing Together in Unity and Mission: Building on 40 years of Anglican-Roman Catholic Dialogue accompanied by two commentaries. IARCCUM’s work continues under the Co-Chairmanship of Bishop Donald Bolen and Bishop David Hamid."]}, {"page": "Suffragan Bishop in Europe", "response": ["|align=\"center\"| 2002 ||align=\"center\"| present || David Hamid || (b. 1955).Diocese in Europe: The Rt Revd David Hamid . Retrieved on 4 June 2008."]}, {"page": "Richard Cheetham", "response": ["He began his career as curate at Holy Cross, Fenham, Newcastle upon Tyne and from 1990 until 1999 he was vicar of St Augustine of Canterbury's Church, Luton and additionally (from 1995) Rural Dean of the area. From 1999 to 2002 he was Archdeacon of St Albans.Debrett's People of Today 2008 On 17 October 2002, at Southwark Cathedral, he was one (with David Hamid and David Hawkins) of the last three people to be ordained and consecrated a bishop by George Carey before his retirement as Archbishop of Canterbury; Cheetham was then enthroned as area Bishop of Kingston in Southwark Cathedral on 27 October 2002. As the senior suffragan bishop in post at the time of Tom Butler's retirement on 5 March 2010, Cheetham served as Acting Bishop of Southwark from then until his fellow suffragan Christopher Chessun became Bishop of Southwark on 17 January 2011.Diocese of Southwark — Tenth Bishop of Southwark is announced  (Accessed 17 December 2015)"]}, {"page": "David Hawkins (bishop)", "response": ["His ordained ministry as a curate at St Andrew's Bebington, after which he was spent six years in Nigeria. He was then vicar of St George's LeedsSt George's Leeds website for 16 years until his ordination to the episcopate. On 17 October 2002, at Southwark Cathedral, he was one (with Richard Cheetham and David Hamid) of the last three people to be ordained and consecrated a bishop by George Carey before his retirement as Archbishop of Canterbury. He was installed at Chelmsford Cathedral in January 2003Chelmsford Diocese — Area Bishops  and retired on 30 March 2014. "]}, {"page": "Anglican–Roman Catholic dialogue", "response": ["In 2000, Archbishop George Carey, then Archbishop of Canterbury, and Cardinal Edward Cassidy, then President of the Vatican's Pontifical Council for Promoting Christian Unity, convoked a conference of Anglican and Roman Catholic bishops at Mississauga in Canada to discern the progress made in theological conversations since the 1960s, and whether closer co-operation could be developed between the two traditions. The result was IARCCUM, which has been meeting since 2001. In February 2007, it published the first fruit of its work, the report \"Growing Together in Unity and Mission\",https://iarccum.org/doc/?d=32 Growing Together in Unity and Mission: Building on 40 years of Anglican-Roman Catholic Dialogue accompanied by two commentaries. IARCCUM's work continues under the co-chairmanship of Bishop Donald Bolen and Bishop David Hamid."]}, {"page": "Bergen Anglican Church", "response": ["Bergen Anglican Church is a congregation of the Church of England in the Anglican Chaplaincy in Norway in the city of Bergen, Norway. Emerging in the late 1950s and institutionalised in 1962 the congregation was a spiritual home for British expatriates and especially the Second World War \"War Brides\" from Scotland. The congregation has grown to become broadly international in character providing worship in the English language. Since its emergence the congregation's strong core lay ministry and leadership was supplemented periodically by visiting or designated Anglican priests from St Edmund's Anglican Church in Oslo,T.K. Derry A History Of St. Edmund's Church Oslo - 1884-1974 (Oslo:1975) and beginning in the 1990s was served by Peter Hogarth who served as the Assistant Chaplain for Western Norway, who was arrested for possession of child abuse images some years after the end of his responsibility for Bergen (https://www.churchtimes.co.uk/articles/2019/6-september/news/world/prison-for-norway-cleric-over-child-abuse-images ). Mpole Samuel Masemola was installed as the congregation's first resident priest January 2013, and left in July 2015. Normal worship services were first held at the Engensenteret Chapel, Baneveien 1, near Nøstet, and now at the historic Mariakirken i Bergen or St Mary's Church, Bergen. Within the scope of the Porvoo Communion the congregation enjoys close cooperation with the Bergen Cathedral parish of the Church of Norway. As a congregation within the Anglican Chaplaincy in Norway the Bergen Anglican Church is a part of the Archdeaconry of Germany and Northern Europe in the Diocese of Gibraltar in Europe, which is part of the province of Canterbury in the Church of England. The diocesan bishop is Robert Innes and David Hamid is Suffragan Bishop in Europe."]}, {"page": "Irja Askola", "response": ["Her consecration was attended by other women who are bishops — from Sweden, Germany and Denmark, and David Hamid, the Anglican Suffragan Bishop in Europe. Several Finnish public figures were also present, including President Tarja Halonen and Prime Minister Mari Kiviniemi."]}, {"page": "Tuomas Mäkipää", "response": ["Mäkipää was ordained deacon by The Rt Revd Geoffrey Rowell, Bishop of Gibraltar in Europe, at Mikael Agricola Church, Helsinki in May 2005. He served as an assistant curate in the Chaplaincy of St Nicholas, Helsinki and was ordained priest by the Rt Revd David Hamid, suffragan bishop of the Diocese in Europe, in 2010. He was the first Finnish Lutheran ordained in the Church of England under the Porvoo Agreement. He was appointed as Chaplain of the Chaplaincy of St Nicholas in 2012."]}, {"page": "Template talk:Crockford", "response": ["*David Hamid "]}, {"page": "Kristján Valur Ingólfsson", "response": ["Kristján Valur was elected bishop in August 2011 and was consecrated bishop on 18 September 2011 by Bishop of Iceland Karli Sigurbjörnsson and con-consecrated by Matti Repo, Bishop of Tammerfors, and David Hamid, Suffragan Bishop in Europe, in Skálholt Cathedral.\"Vígslubiskup\". Retrieved on 15 August 2017."]}, {"page": "Hamid, David", "response": ["#redirectDavid Hamid"]}]}}