{"wiki_id": "http://www.wikidata.org/entity/Q370235", "itemLabel": "Graham Hancock", "itemDescription": "British author and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Hancock", "wikipedia_page": {"main": "Graham Bruce Hancock (; born 2 August 1950) is a British writer and journalist. He promotes pseudoscientific theories involving ancient civilizations, Earth changes, stone monuments or megaliths, altered states of consciousness, ancient myths, and astronomical or astrological data from the past.\nHancock's works propose a connection with a 'mother culture' from which he believes other ancient civilizations sprang. An example of pseudohistory and pseudoarchaeology, his work has neither been peer reviewed nor published in academic journals.", "link_mentions": [{"page": "Ark of the Covenant", "response": ["In his controversial and much attacked 1992 book The Sign and the Seal, British writer Graham Hancock reports on the Ethiopian belief that the ark spent several years in Egypt before it came to Ethiopia via the Nile River, where it was kept in the islands of Lake Tana for about four hundred years and finally taken to Axum. (Archaeologist John Holladay of the University of Toronto called Hancock's theory \"garbage and hogwash\"; Edward Ullendorff, a former Professor of Ethiopian Studies at the University of London, said he \"wasted a lot of time reading it.\") In a 1992 interview, Ullendorff says that he personally examined the ark held within the church in Axum in 1941 while a British army officer. Describing the ark there, he says, \"They have a wooden box, but it's empty. Middle- to late-medieval construction, when these were fabricated ad hoc.\""]}, {"page": "Food and Agriculture Organization", "response": ["Edouard Saouma, the Director-General of FAO, was also criticized in Graham Hancock's book Lords of Poverty, published in 1989. Mention is made of Saouma's \"fat pay packet\", his \"autocratic\" management style, and his \"control over the flow of public information\". Hancock concluded that \"One gets the sense from all of this of an institution that has lost its way, departed from its purely humanitarian and developmental mandate, become confused about its place in the world – about exactly what it is doing, and why\". Despite the criticism, Edouard Saouma served as DG for three consecutive terms from 1976 to 1993."]}, {"page": "La Malinche", "response": ["*Malinal is a character in Graham Hancock's series of novels War God: Nights of the Witch (2013) and War God: Return of the Plumed Serpent (2014), which is a fictional story describing the events related to the Hernan Cortés' expedition to Mexico and the Spanish conquest of the Aztec empire."]}, {"page": "Charles Fort", "response": ["The magazine Fortean Times (first published in November 1973) is a proponent of Fortean journalism, combining humor, skepticism, and serious research into subjects that scientists and other respectable authorities often disdain. Another such group is the International Fortean Organization (INFO), which was formed during the early 1960s (incorporated in 1965) by brothers and writers  Ron and Paul Willis, who acquired much of the material of the Fortean Society, which had largely ceased by 1959 with the death of Tiffany Thayer. INFO publishes the INFO Journal: Science and the Unknown and organizes the FortFest, the world's first continuously running conference on anomalous phenomena dedicated to the spirit of Charles Fort. INFO, since the mid-1960s, also provides audio CDs and filmed DVDs of notable conference speakers, including Colin Wilson, John Michell, Graham Hancock, John Anthony West, William Corliss, John Keel, and Joscelyn Godwin. Other notable Fortean societies include the London Fortean Society, Edinburgh Fortean Society, in Edinburgh and the Isle of Wight."]}, {"page": "Out-of-place artifact", "response": ["* Fingerprints of the Gods, book by Graham Hancock"]}, {"page": "Charles Hapgood", "response": ["Hapgood's ideas on catastrophe have been presented in other works by librarians Rose and Rand Flem-Ath and author and former journalist Graham Hancock, each basing portions of their works on Hapgood's evidence for catastrophe at the end of the Last Glacial Maximum. Hapgood's ideas also figure prominently in the 2009 sci-fi/disaster movie 2012."]}, {"page": "Pseudohistory", "response": ["The author Graham Hancock has sold over four million copies of books promoting the pseudohistorical thesis that all the major monuments of the ancient world, including Stonehenge, the Egyptian pyramids, and the moai of Easter Island, were built by a single ancient supercivilization, which Hancock claims thrived from 15,000 to 10,000 BC and possessed technological and scientific knowledge equal to or surpassing that of modern civilization. He first advanced the full form of this argument in his 1995 bestseller Fingerprints of the Gods, which won popular acclaim, but scholarly disdain. Christopher Knight has published numerous books, including Uriel's Machine (2000), expounding pseudohistorical assertions that ancient civilizations possessed technology far more advanced than the technology of today.Merriman, Nick, editor, Public Archaeology, Routledge, 2004 p. 260Tonkin, S., 2003, Uriel's Machine – a Commentary on some of the Astronomical Assertions."]}, {"page": "Angkor Wat", "response": ["Drawing on the temple's alignment and dimensions, and on the content and arrangement of the bas-reliefs, researcher Eleanor Mannikka argues that the structure represents a claimed new era of peace under King Suryavarman II: \"as the measurements of solar and lunar time cycles were built into the sacred space of Angkor Wat, this divine mandate to rule was anchored to consecrated chambers and corridors meant to perpetuate the king's power and to honour and placate the deities manifest in the heavens above.\" (This page does not cite an author's name.) (Mannikka, née Morón) Mannikka's suggestions have been received with a mixture of interest and scepticism in academic circles. She distances herself from the speculations of others, such as Graham Hancock, that Angkor Wat is part of a representation of the constellation Draco.Transcript of Atlantis Reborn, broadcast BBC2 4 November 1999."]}, {"page": "Erich von Däniken", "response": ["*Graham Hancock, Scottish pseudoarchaeologist with parallels and differences to von Däniken, such as tracing the source of advanced hypothetical ur-civilization to Atlantis rather than extraterrestrial intelligence"]}, {"page": "Ethiopian Orthodox Tewahedo Church", "response": ["The Ethiopian Church claims that one of its churches, Our Lady Mary of Zion, is host to the original Ark of the Covenant that Moses carried with the Israelites during the Exodus. Only one priest is allowed into the building where the Ark is located, ostensibly due to biblical warnings of danger. As a result, international scholars doubt that the original Ark is truly there, although a case has been put forward by several writers including Graham Hancock in his book The Sign and the Seal."]}, {"page": "Underworld (disambiguation)", "response": ["* Underworld: The Mysterious Origins of Civilization, a non-fiction work of historical speculation written by Graham Hancock"]}, {"page": "Pseudoarchaeology", "response": ["There is no unified pseudoarchaeological theory or approach, but rather many different interpretations of the past that are jointly at odds with those developed by the scientific community. These include religious approaches such as creationism or \"creation science\" that applies to the archaeology of historic periods such as those that would have included the Tower of Babel, Noah's Ark and the Genesis flood narrative, and the supposed worldwide flood myth. Some pseudoarchaeological theories revolve around the idea that prehistoric and ancient human societies were aided in their development by intelligent extraterrestrial life, an idea propagated by those such as Italian author Peter Kolosimo, French authors Louis Pauwels and Jacques Bergier in The Morning of the Magicians (1963), and Swiss author Erich von Däniken in Chariots of the Gods? (1968). Others instead hold that there were human societies in the ancient period that were significantly technologically advanced, such as Atlantis, and this idea has been propagated by figures like Graham Hancock in his Fingerprints of the Gods (1995). Pseudoarchaeology has also been manifest in Mayanism and the 2012 phenomenon.", "Conversely, many pseudoarchaeologists, whilst criticising the academic archaeological establishment, also attempt to get support from people with academic credentials and affiliations.Fagan 2006b. p. 33. At times, they quote historical, and in most cases dead academics to back up their arguments; for instance prominent pseudoarchaeologist Graham Hancock, in his seminal Fingerprints of the Gods (1995), repeatedly notes that the eminent physicist Albert Einstein once commented positively on the pole shift hypothesis, a theory that has been abandoned by the academic community but which Hancock supports.Hancock 1995. pp. 9–11, 468, 471. As Fagan noted however, the fact that Einstein was a physicist and not a geologist is not even mentioned by Hancock, nor is the fact that the understanding of plate tectonics (which came to disprove earth crustal displacement) only came to light following Einstein's death.Fagan 2006b. p. 34.", "* The work of contemporary authors such as Giorgio Tsoukalos, Erich von Däniken, Barry Fell, Zecharia Sitchin, Robert Bauval, Frank Joseph, Graham Hancock, Colin Wilson, Michael Cremo, Immanuel Velikovsky, and David Hatcher Childress."]}, {"page": "Ahnenerbe", "response": ["Many of the ideas inherited or developed by the Ahnenerbe remain influential. Canadian author Heather Pringle has particularly drawn attention to the influence of Edmund Kiss' various \"crackpot theories\" concerning such matters as the World Ice Theory and the origins of Tiwanaku upon subsequent writers such as H.S. Bellamy, Denis Saurat and, later, Graham Hancock."]}, {"page": "Lalibela", "response": ["Contrary to claims made by pseudoarchaeologist writers like Graham Hancock, Buxton states the great rock-hewn churches of Lalibela were not built with the help of the Knights Templar; asserting abundant evidence exists to show that they were produced solely by medieval Ethiopian civilization. For example, while Buxton notes the existence of a tradition that \"Abyssinians invoked the aid of foreigners\" to construct these monolithic churches, and admits that \"there are clearly signs of Coptic influence in some decorative details\" (hardly surprising given the theological, ecclesiastical, and cultural links between the Orthodox Tewahedo and Coptic Orthodox Churches), he is adamant about the native origins of these creations: \"But the significant fact remains that the rock-churches continue to follow the style of the local built-up prototypes, which themselves retain clear evidence of their basically Axumite origin.\"Buxton, The Abysssinians, pp. 103f"]}, {"page": "Pablo Amaringo", "response": ["Amaringo occasionally gave interviews in the years following the book's publication, and later penned the preface for Plant Spirit Shamanism: Traditional Techniques for Healing the Soul (Destiny Books 2006). His artwork was featured in Graham Hancock's book \"Supernatural\". Amaringo also appeared in The Shaman & Ayahuasca: Journeys to Sacred Realms (2010), Michael Wiese's documentary film about ayahuasca."]}, {"page": "TED (conference)", "response": ["Following a TEDx talk by parapsychologist Rupert Sheldrake, TED issued a statement saying their scientific advisors believed that \"there is little evidence for some of Sheldrake's more radical claims\" made in the talk and recommended that it \"should not be distributed without being framed with caution\". The video of the talk was moved from the TEDx YouTube channel to the TED blog accompanied by the framing language called for by the advisors. The move and framing prompted accusations of censorship, to which TED responded by saying the accusations were \"simply not true\" since Sheldrake's talk was still on their website. A 2013 talk by Graham Hancock, promoting the use of the drug DMT, was treated in the same way."]}, {"page": "The Sign and the Seal", "response": ["The Sign and the Seal: The Quest for the Lost Ark of the Covenant is a historically speculative 1992 book by British author Graham Hancock, in which the author describes his search for the Ark of the Covenant and proposes a theory of the ark's historical movements and current whereabouts. The book sold well but received negative reviews.", "Category:Books by Graham Hancock"]}, {"page": "Walt Becker", "response": ["Becker graduated from Pasadena High School (California) in 1986Campus '86 (yearbook), p. 19 and USC School of Cinema-Television in 1995. He also wrote the novel Link in 1999, which was on the L.A. Times' bestseller list for four weeks. It is based on some theories of Graham Hancock, to whom he refers in the epilogue. He has a son and a daughter with his wife, Lindsay."]}, {"page": "Talisman: Sacred Cities, Secret Faith", "response": ["#redirect Graham Hancock"]}, {"page": "Cataclysmic pole shift hypothesis", "response": ["*  Fingerprints of the Gods (1995) by Graham Hancock, an analysis of arguments made for a Late Pleistocene Pole Shift, based on the ideas of Rand Flem-Ath by "]}, {"page": "Pyramidology", "response": ["Robert Bauval and Graham Hancock (1996) have both suggested that the \"ground plan\" of the three main Egyptian pyramids was physically established , but that the pyramids were built around 2,500 BC. This theory was based on their initial claims regarding the alignment of the Giza pyramids with OrionHancock, Graham, Fingerprints of the Gods, 1995, p. 375. \"...the three pyramids were a terrestrial map of the three stars of Orion's belt\" are later joined with speculation about the age of the Great Sphinx.Hancock and Bauval, Keeper of Genesis, published 1996, and in 1997 in the U.S. as The Message of the Sphinx)", "Linked to the pseudoarchaeological ancient astronaut theory and Orion correlation theory are related claims that the Great Pyramid was constructed by the use of an advanced lost technology. Proponents of this theory often link this hypothetical advanced technology to extraterrestrials but also Atlanteans, Lemurians or a legendary lost race.Technology of the Gods: The Incredible Sciences of the Ancients, David Hatcher Childress, Adventures Unlimited Press (1 Jun 2000).Forbidden Science: From Ancient Technologies to Free Energy, J. Douglas Kenyon, Inner Traditions International (21 Mar 2008)The Giza Power Plant: Technologies of Ancient Egypt, Christopher Dunn, Bear & Company (31 Oct 1998) Notable proponents include Christopher Dunn and David Hatcher Childress. Graham Hancock, in his book Fingerprints of the Gods, assigned the 'ground plan' of the three main Egyptian pyramids, in his theory of an advanced progenitor civilization which possessed advanced technology."]}, {"page": "Robert Bauval", "response": ["In late 1992, Bauval had been trying to obtain a translation of Hermetica by Walter Scott. He then came across a new edition printed by Solo Press with a foreword by Adrian Gilbert.Walter Scott, Hermetica: The Ancient Greek and Latin Writings which contain Religious or Philosophic Teachings ascribed to Hermes Trismegistus (Solo Press, 1992).  Bauval contacted Gilbert after being interested in his foreword concerning a link between an Alexandrine school of Hermes Trismegistus and the pyramid builders of the Fourth dynasty of Egypt. They went on to write The Orion Mystery together, which became an international bestseller. BBC Two broadcast a documentary on Bauval's ideas around the time of the book's publication. He has co-authored three books with Graham Hancock, including 2004's Talisman: Sacred Cities, Secret Faith  in which the two put forward what sociologist of religion David V. Barrett in a review in The Independent described as a factually incorrect and unconvincing \"mess of a book\" based upon indiscriminate use of source material culminating in \"promulgating a version of the old Jewish-Masonic plot so beloved by ultra-right-wing conspiracy theorists.", "On 4 November 1999, the BBC broadcast a documentary entitled Atlantis Reborn which tested the ideas of Robert Bauval and his colleague, Graham Hancock.  Bauval and Hancock afterwards complained to the BSC (Broadcasting Standards Commission) that they had been treated unfairly.  A hearing followed and in November 2000 the BSC ruled in favour of the documentary makers on all but one of the ten principal complaints brought by Hancock and Bauval.", "*Keeper of Genesis (with Graham Hancock) (1995)", "*The Message of the Sphinx (with Graham Hancock) (May 1997)", "*Talisman: Sacred Cities, Secret Faith (with Graham Hancock) (2004)"]}, {"page": "Mayanism", "response": ["Mayanism has gained renewed vigor due to pseudoscientific nonfiction by authors such as Erich von Däniken, Zecharia Sitchin, and Graham Hancock, whose theories range from invoking ancient astronauts and other extraterrestrials from outer space to revivals of the idea that ancient peoples from lost lands brought wisdom and technology to the Mayas. The implication of this is that the Mayas had access to aspects of ancient knowledge, spiritualism, philosophy, and religion that are useful for coping with the modern world, whether by avoiding Armageddon, embracing a mystical Apocalypse, or constructing a future Utopia."]}, {"page": "Sadistic Mika Band", "response": ["Yu Imai went on to form the group Imitation and collaborated with members of Sandii & the Sunsetz and Talking Heads.  He was also the chief musical collaborator with lyricist Chris Mosdell on three of his solo albums, Equasian (also with Kazuhiko Katō), The Oracles of Distraction, and Fingerprints of the Gods –  the latter being the sonic setting of the Graham Hancock book of the same title."]}, {"page": "Fingerprints of the Gods", "response": ["Fingerprints of the Gods: The Evidence of Earth's Lost Civilization is a 1995 pseudoarcheology book by Graham Hancock, in which the author echoes 19th-century writer Ignatius Donnelly, author of Atlantis: The Antediluvian World (1882), in contending that an enigmatic, ancient, advanced civilization existed in prehistory, one which served as the common progenitor civilisation to all subsequent known ancient historical ones. The author proposes that sometime around the end of the last Ice Age this civilisation ended in cataclysm, but passed on to its inheritors profound knowledge of such things as astronomy, architecture and mathematics.", "In 2009, Roland Emmerich, the Hollywood director, released his blockbuster disaster film 2012 citing Fingerprints of the Gods in the credits as inspiration for the film. In a November 2009 interview with the London magazine Time Out, Emmerich states: \"I always wanted to do a biblical flood movie, but I never felt I had the hook. I first read about the Earth's Crust Displacement Theory in Graham Hancock's Fingerprints of the Gods.\"", "*Brass, M., 2002, Tracing Graham Hancock's Shifting Cataclysm.  Hall of Ma’at Papers Skeptical Inquirer. vol. 26, no. 4, pp. 45-9.", "*Fagan, G., ndb, An Answer to Graham Hancock, Hall of Ma’at Papers", "Category:Books by Graham Hancock"]}, {"page": "Hall of Records", "response": ["Proponents believe that an ancient Atlantean civilization stored documents under the Sphinx.  The claim is considered pseudoscientific and to be associated with the New Age movement.  Graham Hancock and Robert Bauval have promoted the idea in the book Message of the Sphinx."]}, {"page": "Location hypotheses of Atlantis", "response": ["Charles Hapgood came up with the \"Earth Crustal Displacement theory\". Hapgood's theory suggests that Earth's outer crust is able to move upon the upper mantle layer rapidly up to a distance of 2,000 miles, placing Atlantis in Antarctica, when considering the movements of the crust in the past. Albert Einstein was one of the few voices to answer Hapgood's theory. Einstein wrote a preface for Hapgood's book Earth's shifting crust, published in 1958. This theory is particularly popular with Hollow Earthers, and can be seen as a mirror of the Hyperborean identification. In his book \"Fingerprints of the Gods\", author Graham Hancock argues for the Earth Crustal Displacement theory in general, and the Atlantis/Antarctica connection specifically, then goes on to propose archaeological exploration of Antarctica in search of Atlantis."]}]}}