{"wiki_id": "http://www.wikidata.org/entity/Q3703289", "itemLabel": "David Partridge", "itemDescription": "Welsh footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Partridge", "wikipedia_page": {"main": "David William Partridge (born 26 November 1978) is retired professional footballer who played as a central defender. He represented Wales in international football, making seven appearances. Partridge's club career included spells at Dundee United and Motherwell in Scotland, Bristol City in England and St. Patrick's Athletic in Ireland, as well as several other clubs on loan. He ended his career in English non-League football, with Cambridge United and Thurrock.", "link_mentions": [{"page": "St Patrick's Athletic F.C.", "response": ["* David Partridge"]}, {"page": "West Ham United F.C. Under-23s and Academy", "response": ["*David Partridge"]}, {"page": "1998–99 West Ham United F.C. season", "response": ["| David Partridge"]}, {"page": "Bradley Orr", "response": ["On 29 August 2006, Orr was sent off for attempting to head-butt his own teammate, Louis Carey, during a game against Northampton Town. On 1 September 2006, Orr was sentenced to 28 days in jail relating to an incident outside the popular Bristol nightclub 'Romeo Browns' the previous October. Also jailed in relation to the same incident were teammates Steve Brooker for 28 days, and David Partridge for two months. Orr and Brooker were released on 14 September 2006, serving only half of their original sentence. He scored against Manchester City in the League Cup second round."]}, {"page": "Steve Brooker", "response": ["On 1 September 2006, Brooker was sentenced to prison for 28 days for his part in a 2005 nightclub brawl, which also saw his Bristol City teammates Bradley Orr and David Partridge imprisoned. Two weeks later, he and Orr were released on licence, having served half of their original sentence in custody. The sentence was described by City chairman Stephen Lansdown as 'harsh'."]}, {"page": "Scott Brown (footballer, born May 1985)", "response": ["In August 2004, he signed for Bristol City when Brian Tinnion offered him a three-month contract and later went on to sign a two-year deal with City. In October 2005, Brown and City teammates David Partridge and Bradley Orr were arrested on suspicion of violent disorder after an incident in a nightclub. They were later charged with affray, as was teammate Steve Brooker. Brown denied the offence but admitted the lesser charge of a section 4 public-order offence. His three teammates were sent to prison, but Brown escaped this punishment and instead was given 120 hours' community service for his part in the drunken brawl."]}, {"page": "List of professional sportspeople convicted of crimes", "response": ["|David Partridge"]}, {"page": "Terry Evans (footballer, born 1976)", "response": ["In 2001, he returned to The Football League with Swansea City where, after beginning the season on the bench, he established himself in the first team, making 16 appearances in all competitions, before his season was ended in February 2002 when he suffered a double fracture in his jaw after being struck by a deliberate elbow thrown by David Partridge during a match against Leyton Orient on 9 February 2002. Evans was released by Swansea at the end of the 2002–03 season, moving to non-league club Newport County. After one season at Newport he was released by then manager Peter Nicolas in June 2005. He then had a brief spell playing for Cardiff Grange Quins, but re-joined Newport County in 2005."]}, {"page": "2005 Scottish League Cup Final", "response": ["|CB ||14 || David Partridge"]}, {"page": "List of Wales international footballers born outside Wales", "response": ["* David Partridge"]}, {"page": "2010–11 Cambridge United F.C. season", "response": ["|align=\"left\"|6||align=\"left\"|DF||align=\"left\"| David Partridge", "|David Partridge"]}, {"page": "2005–06 Motherwell F.C. season", "response": ["| David Partridge"]}, {"page": "2004–05 Motherwell F.C. season", "response": ["|David Partridge", "||| DF|| 14 ||David Partridge"]}, {"page": "2002–03 Motherwell F.C. season", "response": ["| David Partridge", "| David Partridge", "|14||||DF||David Partridge||9||2||1||0||0||0||10||2"]}, {"page": "2003–04 Motherwell F.C. season", "response": ["||| DF|| 14 ||David Partridge"]}, {"page": "2006–07 Brentford F.C. season", "response": ["|David Partridge", "| style=\"text-align:left;\" |David Partridge", "| style=\"text-align:left;\" |David Partridge", "| David Partridge"]}, {"page": "2007–08 Brentford F.C. season", "response": ["|David Partridge", "| David Partridge", "| David Partridge"]}, {"page": "David Partridge (disambiguation)", "response": ["David Partridge (born 1978) is a Welsh footballer.", "David Partridge may also refer to:", "* David Partridge (cricketer) (born 1954), English cricketer", "* David Partridge (artist) (1919–2006), Canadian artist and sculptor"]}, {"page": "2005–06 Milton Keynes Dons F.C. season", "response": ["| 19 January 2006 || DF ||  David Partridge || Bristol City || "]}, {"page": "List of St Patrick's Athletic F.C. players", "response": ["*David Partridge"]}, {"page": "List of foreign League of Ireland players", "response": ["* David Partridge – St Patrick's Athletic"]}]}}