{"wiki_id": "http://www.wikidata.org/entity/Q3714641", "itemLabel": "Douglas Payne", "itemDescription": "British actor (1875-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_Payne", "wikipedia_page": {"main": "Douglas Payne (1875 in England – 3 August 1965 in London, England) was a British actor of the silent era.\n\n", "link_mentions": [{"page": "Sexton Blake", "response": ["|1919||Further Exploits of Sexton Blake: The Mystery of the S. S. Olympic||rowspan=2|Douglas Payne||Neil Warrington||Harry Lorraine||The Mystery of the S. S. Olympic by Robert Murray Graydon||"]}, {"page": "List of British films before 1920", "response": ["| Flying from Justice || Percy Nash || Gregory Scott, Douglas Payne, Joan Ritz || Crime ||", "| The Further Exploits of Sexton Blake || Harry Lorraine || Douglas Payne, Marjorie Villis || Crime ||", "| The Heart of a Rose || Jack Denton || Henry Victor, Douglas Payne || Drama ||", "| A Lass o' the Looms || Jack Denton || Henry Victor, Douglas Payne || Drama || "]}, {"page": "Payne (name)", "response": ["*C. D. Payne (C. Douglas Payne), U.S. novelist", "*Douglas Payne (1875–1965), British actor"]}, {"page": "Maria Marten, or the Mystery of the Red Barn", "response": ["* Douglas Payne as Roger Deaves"]}, {"page": "The Triumph of the Scarlet Pimpernel (film)", "response": ["* Douglas Payne as Rateau"]}, {"page": "The Little Minister (1915 film)", "response": ["* Douglas Payne - Lord Rintoul"]}, {"page": "The Coal King", "response": ["* Douglas Payne - James Hawker"]}, {"page": "Fine Feathers (1915 film)", "response": ["Fine Feathers is a 1915 British silent drama film directed by Maurice Elvey and starring Elisabeth Risdon, Fred Groves and Douglas Payne.BFI.org", "* Douglas Payne - Dr. Beverley "]}, {"page": "The Harbour Lights (1914 film)", "response": ["* Douglas Payne - Mark Helstone"]}, {"page": "Enoch Arden (1914 film)", "response": ["* Douglas Payne - The Priest"]}, {"page": "Old Bill Through the Ages", "response": ["* Douglas Payne"]}, {"page": "Won by a Head", "response": ["* Douglas Payne   "]}, {"page": "The Miracle (1912 film)", "response": ["* Menchen had been resident in London for some time according to an interview with Al. Woods in the New York Times, 9 May 1912. The \"little electrical shop at the Bijou\" referred to in the report was opened by Menchen at the 'old' Bijou Theatre, 1237 Broadway, after he was made bankrupt in 1905. The press agent for the Bijou Theatre, A. Curtis Bond, acquired the American rights to the Acres kineopticon projector, which Menchen had used to show films at Tony Pastor's Theatre from 1896. Source: The Proliferation of Motion Picture Companies and an Assessment of the Novelty Year – The Phantoscope and Other Projectors at encyclopedia.jrank.org silent full-colour film, using a hand-coloured process similar to Pathéchrome. Produced by Joseph Menchen and directed by Michel Carré, it is among the first full-colour feature films to be made. It stars Maria Carmi, Ernst Matray, Florence Winston and Douglas Payne, and was filmed on location in Austria.", "* Douglas Payne – The Knight", "Although some advertising for the film implied that all the cast had been in the 1911–12 Olympia production, this was only true for Maria Carmi, Douglas Payne, Ernst Benzinger and Joseph Klein. Carmi was married to Karl Vollmoeller, the author of the stage play, and The Miracle was the first of her 26 films. Apart from Payne and Matray, who had made one film each, none of the cast had any experience in film acting; between them Carmi, Matray, Payne, Benzinger and Klein went on to make some 160 motion picturesSource: imdb Carmi, Matray, Klein and Rocholl also starred in the film of Vollmoeller's next pantomime, Eine venezianische Nacht (A night in Venice).Eine venezianische Nacht at imdb."]}, {"page": "The Man Who Changed His Name (1928 film)", "response": ["* Douglas Payne as A Canadian "]}, {"page": "What Next?", "response": ["* Douglas Payne as Cornelius Vandergilt"]}, {"page": "You'd Be Surprised!", "response": ["*Douglas Payne as Convict 99"]}, {"page": "List of British films of 1922", "response": ["|Potter's Clay || H. Grenville-Taylor  Douglas Payne || Ellen Terry, Dick Webb || Drama ||"]}, {"page": "List of British films of 1929", "response": ["|Red Aces||Edgar Wallace||Nigel Bruce, Douglas Payne||Crime||"]}, {"page": "Flying from Justice", "response": ["Flying from Justice  is a 1915 British silent crime film directed by Percy Nash and starring Gregory Scott, Douglas Payne  and Joan Ritz.Palmer p.895", "* Douglas Payne as John Gully  "]}, {"page": "The Heart of a Rose", "response": ["The Heart of a Rose is a 1919 British silent drama film directed by Jack Denton and starring Stella Muir, Henry Victor and Douglas Payne.Palmer p.895 ", "* Douglas Payne as Stephen Carnforth  "]}, {"page": "A Lass o' the Looms", "response": ["A Lass o' the Looms is a 1919 British silent drama film directed by Jack Denton and starring Stella Muir, Henry Victor and Douglas Payne.Palmer p.895", "* Douglas Payne as Foreman  "]}, {"page": "The Flaw (1933 film)", "response": ["* Douglas Payne as Inspector Barnes  "]}, {"page": "Potter's Clay", "response": ["Potter's Clay is a 1922 British silent drama film directed by H. Grenville-Taylor and Douglas Payne and starring Ellen Terry, Dick Webb, and Peggy Hathaway.Low p.429", "* Douglas Payne as Henry J. Smith  "]}, {"page": "Red Aces", "response": ["* Douglas Payne as Insp. Gaylor "]}, {"page": "In the Ranks", "response": ["* Douglas Payne as Richard Belton "]}, {"page": "The Mouthpiece (play)", "response": ["It ran for twelve performances at Wyndham's Theatre in the West End. The cast included Emlyn Williams, Douglas Payne, Mabel Terry-Lewis and Margaret Bannerman. In 1935 it was posthumously novelised by Robert Curtis.Wearing p. 68"]}, {"page": "Langford Reed", "response": ["*1922: Potter's Clay directed by H. Grenville-Taylor and Douglas Payne"]}, {"page": "Hetty Spiers", "response": ["With her husband Spiers co-authored the books Daphne Goes Down (1925), Who's Who in Filmland (1931), and The Mantle of Methuselah: A Farcical Novel (1939).Langford Reed - Library of Congress Also with her husband she wrote the screenplay for Potter's Clay (1922), a silent film directed by H. Grenville-Taylor and Douglas Payne and starring Ellen Terry. She and her husband adapted the screenplay into a novel of the same name in 1923.Potter's Clay: A Romance (1923) - Library of Congress Copyright Office: Catalogue of Copyright Entries - Google Books p. 4725"]}]}}