{"wiki_id": "http://www.wikidata.org/entity/Q37103", "itemLabel": "Florence Nightingale", "itemDescription": "English social reformer, statistician, and founder of modern nursing", "wikipedia_url": "https://en.wikipedia.org/wiki/Florence_Nightingale", "wikipedia_page": {"main": "Florence Nightingale  (; 12 May 1820 – 13 August 1910) was an English social reformer, statistician and the founder of modern nursing. Nightingale came to prominence while serving as a manager and trainer of nurses during the Crimean War, in which she organised care for wounded soldiers at Constantinople. She gave nursing a favourable reputation and became an icon of Victorian culture, especially in the persona of \"The Lady with the Lamp\" making rounds of wounded soldiers at night.Recent commentators have asserted that Nightingale's Crimean War achievements were exaggerated by the media at the time, but critics agree on the importance of her later work in professionalising nursing roles for women. In 1860, she laid the foundation of professional nursing with the establishment of her nursing school at St Thomas' Hospital in London. It was the first secular nursing school in the world, and is now part of King's College London. In recognition of her pioneering work in nursing, the Nightingale Pledge taken by new nurses, and the Florence Nightingale Medal, the highest international distinction a nurse can achieve, were named in her honour, and the annual International Nurses Day is celebrated on her birthday. Her social reforms included improving healthcare for all sections of British society, advocating better hunger relief in India, helping to abolish prostitution laws that were harsh for women, and expanding the acceptable forms of female participation in the workforce.\nNightingale is a pioneer in statistics, she represented her analysis in graphical forms to ease drawing conclusions and actionables from data. She developped a form of the pie chart now known as the polar area diagram, also called the Nightingale rose diagram, equivalent to a modern circular histogram. This diagram is still regularly used in data visualisation.\nNightingale was a prodigious and versatile writer. In her lifetime, much of her published work was concerned with spreading medical knowledge. Some of her tracts were written in simple English so that they could easily be understood by those with poor literary skills. She was also a pioneer in data visualization with the use of infographics, using graphical presentations of statistical data in an effective way. Much of her writing, including her extensive work on religion and mysticism, has only been published posthumously.", "link_mentions": [{"page": "Agatha Christie", "response": ["Some of Christie's fictional portrayals have explored and offered accounts of her disappearance in 1926. The film Agatha (1979), with Vanessa Redgrave, has Christie sneaking away to plan revenge against her husband; Christie's heirs sued unsuccessfully to prevent the film's distribution. The Doctor Who episode \"The Unicorn and the Wasp\" (17 May 2008), with Fenella Woolgar, portrays Christie in her early writing career and explains her disappearance as the result of having suffered a temporary breakdown owing to a brief psychic link being formed between her and an alien wasp called the Vespiform. The film Agatha and the Truth of Murder (2018) sends her under cover to solve the murder of Florence Nightingale's goddaughter, Florence Nightingale Shore. A fictionalised account of Christie's disappearance is also the central theme of a Korean musical, Agatha."]}, {"page": "August 13", "response": ["*1910 – Florence Nightingale, Italian-English nurse and theologian (born 1820)", "**Florence Nightingale, Octavia Hill  (Lutheran Church)"]}, {"page": "Anagram", "response": ["Examples from the 19th century are the transposition of \"Horatio Nelson\" into Honor est a Nilo (Latin: Honor is from the Nile); and of \"Florence Nightingale\" into \"Flit on, cheering angel\". The Victorian love of anagramming as recreation is alluded to by the mathematician Augustus De MorganIn his A Budget of Paradoxes, p. 82. using his own name as an example; \"Great Gun, do us a sum!\" is attributed to his son William De Morgan, but a family friend John Thomas Graves was prolific, and a manuscript with over 2,800 has been preserved.Robert Edoward Moritz, On Mathematics and Mathematicians (2007), p. 151.Anna Stirling, William De Morgan and His Wife (1922) p. 64."]}, {"page": "Craven Cottage", "response": ["The Cottage was lived in by Edward Bulwer-Lytton (who wrote The Last Days of Pompeii) and other somewhat notable (and moneyed) persons until it was destroyed by fire in May 1888. Many rumours persist among Fulham fans of past tenants of Craven Cottage. Sir Arthur Conan Doyle,   Jeremy Bentham, Florence Nightingale and even Queen Victoria are reputed to have stayed there, although there is no real evidence for this. Following the fire, the site was abandoned. Fulham had had 8 previous grounds before settling in at Craven Cottage for good. Therefore, The Cottagers have had 12 grounds overall (including a temporary stay at Loftus Road), meaning that only their former 'landlords' and rivals QPR have had more home grounds (14) in British football. Of particular note, was Ranelagh House, Fulham's palatial home from 1886–1888."]}, {"page": "Florence", "response": ["* Florence Nightingale, pioneer of modern nursing, and statistician"]}, {"page": "Hampshire", "response": ["Hampshire is one of the most affluent counties in the country, with an unemployment rate lower than the national average. Its economy mainly derives from major companies, maritime, agriculture and tourism. Tourist attractions include seaside resorts, national parks, the National Motor Museum and the Southampton Boat Show. The county is known as the home of writers Jane Austen and Charles Dickens. Hampshire is also the childhood home of Florence Nightingale and the birthplace of engineer Isambard Kingdom Brunel.", "Possibly the most notable resident was the Duke of Wellington, who lived at Stratfield Saye House in the north of the county from 1817. An eminent Victorian, who made her mark and “came home” to Hampshire for burial at East Wellow was Florence Nightingale."]}, {"page": "History of medicine", "response": ["Women have always served as healers and midwives since ancient times. However, the professionalization of medicine forced them increasingly to the sidelines. As hospitals multiplied they relied in Europe on orders of Roman Catholic nun-nurses, and German Protestant and Anglican deaconesses in the early 19th century. They were trained in traditional methods of physical care that involved little knowledge of medicine. The breakthrough to professionalization based on knowledge of advanced medicine was led by Florence Nightingale in England. She resolved to provide more advanced training than she saw on the Continent. At Kaiserswerth, where the first German nursing schools were founded in 1836 by Theodor Fliedner, she said, \"The nursing was nil and the hygiene horrible.\")  Britain's male doctors preferred the old system, but Nightingale won out and her Nightingale Training School opened in 1860 and became a model. The Nightingale solution depended on the patronage of upper-class women, and they proved eager to serve. Royalty became involved. In 1902 the wife of the British king took control of the nursing unit of the British army, became its president, and renamed it after herself as the Queen Alexandra's Royal Army Nursing Corps; when she died the next queen became president. Today its Colonel In Chief is Sophie, Countess of Wessex, the daughter-in-law of Queen Elizabeth II.  In the United States, upper-middle-class women who already supported hospitals promoted nursing. The new profession proved highly attractive to women of all backgrounds, and schools of nursing opened in the late 19th century. They soon a function of large hospitals , where they provided a steady stream of low-paid idealistic workers. The International Red Cross began operations in numerous countries in the late 19th century, promoting nursing as an ideal profession for middle-class women.M. Patricia Donahue, Nursing, The Finest Art: An Illustrated History (3rd ed. 2010) pp. 112–25", "A major breakthrough in epidemiology came with the introduction of statistical maps and graphs. They allowed careful analysis of seasonality issues in disease incidents, and the maps allowed public health officials to identify critical loci for the dissemination of disease.  John Snow in London developed the methods. In 1849, he observed that the symptoms of cholera, which had already claimed around 500 lives within a month, were vomiting and diarrhoea. He concluded that the source of contamination must be through ingestion, rather than inhalation as was previously thought. It was this insight that resulted in the removal of The Pump On Broad Street, after which deaths from cholera plummeted afterwards. English nurse Florence Nightingale pioneered analysis of large amounts of statistical data, using graphs and tables, regarding the condition of thousands of patients in the Crimean War to evaluate the efficacy of hospital services. Her methods proved convincing and led to reforms in military and civilian hospitals, usually with the full support of the government.Gunn, S. William A.; Masellis, Michele (23 October 2007). Concepts and Practice of Humanitarian Medicine. Springer. pp. 87–. .http://www.ph.ucla.edu/epi/snow/Snow_Laura_Ball.pdf"]}, {"page": "International Classification of Diseases", "response": ["In 1860, during the international statistical congress held in London, Florence Nightingale made a proposal that was to result in the development of the first model of systematic collection of hospital data. In 1893, a French physician, Jacques Bertillon, introduced the Bertillon Classification of Causes of Death at a congress of the International Statistical Institute in Chicago.Works of Jacques Bertillon, Internet Archive."]}, {"page": "Medicine", "response": ["The post-18th century modernity period brought more groundbreaking researchers from Europe. From Germany and Austria, doctors Rudolf Virchow, Wilhelm Conrad Röntgen, Karl Landsteiner and Otto Loewi made notable contributions. In the United Kingdom, Alexander Fleming, Joseph Lister, Francis Crick and Florence Nightingale are considered important. Spanish doctor Santiago Ramón y Cajal is considered the father of modern neuroscience."]}, {"page": "May 12", "response": ["*1820 – Florence Nightingale, Italian-English nurse, social reformer, and statistician (d. 1910)"]}, {"page": "October 21", "response": ["*1854 – Florence Nightingale and a staff of 38 nurses are sent to the Crimean War."]}, {"page": "Sherlock Holmes", "response": ["The London Metropolitan Railway named one of its twenty electric locomotives deployed in the 1920s for Sherlock Holmes. He was the only fictional character so honoured, along with eminent Britons such as Lord Byron, Benjamin Disraeli, and Florence Nightingale."]}, {"page": "Sydney", "response": ["Governor Lachlan Macquarie arranged for the construction of Sydney Hospital and saw it completed in 1816. Parts of the facility have been repurposed for use as Parliament House but the hospital itself still operates to this day. The city's first emergency department was established at Sydney Hospital in 1870. Demand for emergency medical care increased from 1895 with the introduction of an ambulance service. The Sydney Hospital also housed Australia's first teaching facility for nurses, the Nightingale Wing, established with the input of Florence Nightingale in 1868.Judith Godden, Lucy Osburn, A Lady Displaced, Sydney: Sydney University Press, 2006"]}, {"page": "Soong Mei-ling", "response": ["*Clare Boothe Luce compared her to Joan of Arc and Florence Nightingale.", "File:Chinese Florence Nightingale.jpg|Soong giving a bandage to an injured Chinese soldier  (c. 1942)Fenby, Jonathan (2009), Modern China, p. 279"]}, {"page": "Unitarianism", "response": ["Notable Unitarians include classical composers Edvard Grieg and Béla Bartók; Ralph Waldo Emerson, Theodore Parker, Yveon Seon and Thomas Lamb Eliot in theology and ministry; Oliver Heaviside, Erasmus Darwin, Joseph Priestley, John Archibald Wheeler, Linus Pauling, Sir Isaac Newton and inventor Sir Francis Ronalds in science; George Boole in mathematics; Susan B. Anthony in civil government; Frances Ellen Watkins Harper, Whitney Young of the National Urban League, and Florence Nightingale in humanitarianism and social justice; John Bowring, Samuel Taylor Coleridge and Elizabeth Gaskell in literature; Frank Lloyd Wright in the arts; Josiah Wedgwood, Richard Peacock and Samuel Carter MP in industry; Thomas Starr King in ministry and politics; and Charles William Eliot in education. Julia Ward Howe was a leader in the woman suffrage movement, the first ever woman to be elected to the Academy of Arts and Letters, and author of the Battle Hymn of the Republic, volumes of poetry, and other writing. Although raised a Quaker, Ezra Cornell, founder of Cornell University in Ithaca, New York, attended the Unitarian church and was one of the founders of Ithaca's First Unitarian Church. Eramus Darwin Shattuck, a signatory to the Oregon State Constitution, founded the first Unitarian Church in Oregon in 1865.The Centennial History of Oregon 1811–1912 by Joseph Gaston, p. 582."]}, {"page": "Victorian era", "response": ["While women were not welcomed in the world of medicine, this was not the case in nursing. In fact, nursing became even more respected after the brilliant exploits of Florence Nightingale during the Crimean War. Her nursing school at St Thomas' Hospital became a model for others. Consequently, for many middle-class young women, the prospects of being a nurse, one of the few career options open to them at the time, became much more appealing.", "In 1817, Thomas Barnes became general editor of The Times; he was a political radical, a sharp critic of parliamentary hypocrisy and a champion of freedom of the press.Reginald Watters, \"Thomas Barnes and 'The Times' 1817–1841,\" History Today (1979) 29#9 pp 561–68 Under Barnes and his successor in 1841, John Thadeus Delane, the influence of The Times rose to great heights, especially in politics and in the financial district (the City of London). It spoke of reform.Trowbridge H. Ford, \"Political Coverage in 'The Times,' 1811–41: The Role of Barnes and Brougham,\" Bulletin of the Institute of Historical Research (1986) 59#139, pp 91–107. The Times originated the practice of sending war correspondents to cover particular conflicts. W. H. Russell wrote immensely influential dispatches on the Crimean War of 1853–1856; for the first time, the public could read about the reality of warfare. Russell wrote one dispatch that highlighted the surgeons' \"inhumane barbarity\" and the lack of ambulance care for wounded troops. Shocked and outraged, the public reacted in a backlash that led to major reforms especially in the provision of nursing, led by Florence Nightingale.Alan Hankinson, Man of Wars: William Howard Russell of 'The Times'  (1982)", "In the field of statistics, the nineteenth century saw significant innovations in data visualisation. William Playfair, who created charts of all sorts, justified it thus, \"a man who has carefully investigated a printed table, finds, when done, that he has only a very faint and partial idea of what he has read; and that like a figure imprinted on sand, is soon totally erased and defaced.\" For example, in a chart showing the relationship between population and government revenue of some European nations, he used the areas of circles to represent the geographical sizes of those nations. In the same graph he used the slopes of lines to indicate the tax burden of a given population. While serving as nurse during the Crimean War, Florence Nightingale drew the first pie charts representing the monthly fatality rates of the conflict, distinguishing deaths due to battle wounds (innermost section), those due to infectious disease (outer section), and to other causes (middle section). (See figure.) Her charts clearly showed that most deaths resulted from disease, which led the general public to demand improved sanitation at field hospitals. Although bar charts representing frequencies were first used by the Frenchman A. M. Guerry in 1833, it was the statistician Karl Pearson who gave them the name histograms. Pearson used them in an 1895 article mathematically analyzing biological evolution. One such histogram showed that buttercups with large numbers of petals were rarer."]}, {"page": "1860s", "response": ["* Florence Nightingale founds school for nurses in 1860."]}, {"page": "1910", "response": ["* August 13 – Florence Nightingale, British nurse (b. 1820)"]}, {"page": "1854", "response": ["** Florence Nightingale and her team of 38 trained volunteer nurses, having set out on October 21 from England, arrive at Selimiye Barracks in Scutari in the Ottoman Empire, to care for British Army troops invalided from the Crimean War.  "]}, {"page": "1860", "response": ["* July 9 – The Nightingale Training School and Home for Nurses, the first nursing school based on the ideas of Florence Nightingale, is opened at St Thomas' Hospital in London."]}, {"page": "1820", "response": ["*May 12 – Florence Nightingale, English nurse (d. 1910)"]}, {"page": "Clara Barton", "response": ["In 1864, she was appointed by Union General Benjamin Butler as the \"lady in charge\" of the hospitals at the front of the Army of the James. Among her more harrowing experiences was an incident in which a bullet tore through the sleeve of her dress without striking her and killed a man to whom she was tending. She was known as the \"Florence Nightingale of America\". She was also known as the \"Angel of the Battlefield\" after she came to the aid of the overwhelmed surgeon on duty following the battle of Cedar Mountain in Northern Virginia in August 1862.  She arrived at a field hospital at midnight with a large number of supplies to help the severely wounded soldiers. This naming came from her frequent timely assistance as she served troops at the battles of Fairfax Station, Chantilly, Harpers Ferry, South Mountain, Antietam, Fredericksburg, Charleston, Petersburg and Cold Harbor."]}, {"page": "Writer", "response": ["Report writers are people who gather information, organise and document it so that it can be presented to some person or authority in a position to use it as the basis of a decision. Well-written reports influence policies as well as decisions. For example, Florence Nightingale (1820–1910) wrote reports that were intended to effect administrative reform in matters concerning health in the army. She documented her experience in the Crimean War and showed her determination to see improvements: \"...after six months of incredible industry she had put together and written with her own hand her Notes affecting the Health, Efficiency and Hospital Administration of the British Army. This extraordinary composition, filling more than eight hundred closely printed pages, laying down vast principles of far-reaching reform, discussing the minutest detail of a multitude of controversial subjects, containing an enormous mass of information of the most varied kinds – military, statistical, sanitary, architectural\" became for a long time, the \"leading authority on the medical administration of armies\"."]}, {"page": "Crimean War", "response": ["The Crimean War was one of the first conflicts in which the military used modern technologies such as explosive naval shells, railways and telegraphs. The war was one of the first to be documented extensively in written reports and in photographs. As the legend of the \"Charge of the Light Brigade\" demonstrates, the war quickly became a symbol of logistical, medical and tactical failures and of mismanagement. The reaction in Britain led to a demand for professionalisation, most famously achieved by Florence Nightingale, who gained worldwide attention for pioneering modern nursing while she treated the wounded.", "thumb|During the Crimean War, Florence Nightingale and her team of nurses cleaned up the military hospitals and set up the first training school for nurses in the United Kingdom.", "As the memory of the \"Charge of the Light Brigade\" demonstrates, the war became an iconic symbol of logistical, medical and tactical failures and mismanagement. Public opinion in Britain was outraged at the logistical and command failures of the war; the newspapers demanded drastic reforms, and parliamentary investigations demonstrated the multiple failures of the Army. The reform campaign was not well organised, and the traditional aristocratic leadership of the Army pulled itself together, and blocked all serious reforms. No one was punished. The outbreak of the Sepoy Mutiny in 1857 shifted attention to the heroic defence of British interest by the army, and further talk of reform went nowhere.Peter Burroughs, \"An Unreformed Army? 1815–1868,\" in David Chandler, ed., The Oxford History of the British Army (1996), pp. 183–84 The demand for professionalisation was achieved by Florence Nightingale, who gained worldwide attention for pioneering and publicising modern nursing while treating the wounded. Another nurse, Jamaican doctress Mary Seacole, also made an impact providing care for wounded and dying soldiers. The Times war correspondent William Howard Russell spoke highly of Seacole's skill as a healer, writing \"A more tender or skilful hand about a wound or a broken limb could not be found among our best surgeons.\"\"Mary Seacole, by Jane Robinson\", Independent', 21 January 2005 https://www.independent.co.uk/arts-entertainment/books/reviews/mary-seacole-by-jane-robinson-748262.html Retrieved 28 October 2020."]}, {"page": "First day of issue", "response": ["Postmarks came to the foreground in the early 1960s, when collectors started to demand more interesting cancellations on their first day covers. For the Red Cross issue in 1963, a special Florence Nightingale cover was posted at her birthplace, West Wellow. The Botanical Conference issue of 1964 featured primroses on the stamps, so one clever cover dealer posted his covers at Primrose Valley. This kind of relevant postmark made a cover worth often ten times more than the same cover with a standard postmark issued by the Philatelic Bureau at Edinburgh (a place with no connection to the stamps).  In the US, the U.S. Postal Service chooses a city, or several, as 'official' first day cities. These have a special connection to the stamp issue being released, and these postmarks are the only ones that have the wording: 'First Day of Issue'"]}, {"page": "Nurse uniform", "response": ["The first nurse uniforms were derived from the nun's habit. Before the 19th century, nuns took care of sick and injured people so it was obvious that trained lay nurses might copy the nun's habit as they have adopted ranks like \"Sister\". One of Florence Nightingale's first students (Miss van Rensselaer) designed the original uniform for the students at Miss Nightingale's school of nursing. Before the 1940s minor changes occurred in the uniform. The clothing consisted of a mainly blue outfit. Hospitals were free to determine the style of the nurse uniform, including the nurse's cap which exists in many variants.Hardy, Susan and Corones, Anthony, \"The Nurse’s Uniform as Ethopoietic Fashion\", Fashion Theory, Vol.21, No.5. (2015), pp. 523-552. doi=10.1080/1362704X.2016.1203090"]}, {"page": "Anesthesia", "response": ["Discovered in 1831 by an American physician Samuel Guthrie (1782–1848), and independently a few months later by Frenchman Eugène Soubeiran (1797–1859) and Justus von Liebig (1803–1873) in Germany, chloroform was named and chemically characterized in 1834 by Jean-Baptiste Dumas (1800–1884). In 1842, Dr Robert Mortimer Glover in London discovered the anaesthetic qualities of chloroform on laboratory animals. In 1847, Scottish obstetrician James Young Simpson was the first to demonstrate the anesthetic properties of chloroform on humans and helped to popularize the drug for use in medicine. This first supply came from local pharmacists, James Duncan and William Flockhart, and its use spread quickly, with 750,000 doses weekly in Britain by 1895. Simpson arranged for Flockhart to supply Florence Nightingale and also gained royal approval in 1853 when John Snow gave it to Queen Victoria during the birth of Prince Leopold. During the birth itself, chloroform met all the Queen's expectations; she stated it was \"delightful beyond measure\".  Chloroform was not without fault though. The first fatality directly attributed to chloroform administration was recorded on 28 January 1848 after the death of Hannah Greener. This was the first of many deaths to follow from the untrained handling of chloroform. Surgeons began to appreciate the need for a trained anesthetist. The need, as Thatcher writes, was for an anesthetist to “(1)Be satisfied with the subordinate role that the work would require, (2) Make anesthesia their one absorbing interest, (3) not look at the situation of anesthetist as one that put them in a position to watch and learn from the surgeons technique (4) accept the comparatively low pay and (5) have the natural aptitude and intelligence to develop a high level of skill in providing the smooth anesthesia and relaxation that the surgeon demanded\" These qualities of an anesthetist were often found in submissive medical students and even members of the public.  More often, surgeons sought out nurses to provide anesthesia. By the time of the Civil War, many nurses had been professionally trained with the support of surgeons."]}, {"page": "Zymotic disease", "response": ["In her Diagram of the causes of mortality in the army in the East, Florence Nightingale depicts The blue wedges measured from the centre of the circle represent area for area the deaths from Preventible or Mitigable Zymotic diseases; the red wedges measured from the centre the deaths from wounds, & the black wedges measured from the centre the deaths from all other causes."]}, {"page": "University of London", "response": ["File:Florence Nightingale (H Hering NPG x82368).jpg|Florence Nightingale, founder of modern nursing"]}, {"page": "List of poets", "response": ["*Arthur Hugh Clough (1819–1861), English poet, educationalist and assistant to Florence Nightingale"]}, {"page": "Antiseptic", "response": ["* Florence Nightingale, who contributed substantially to the report of the Royal Commission on the Health of the Army (1856–1857), based on her earlier work"]}, {"page": "Egyptology", "response": ["English Egyptologist Flinders Petrie (1853–1942) introduced archaeological techniques of field preservation, recording, and excavation to the field. Many highly educated amateurs also travelled to Egypt, including women such as Harriet Martineau and Florence Nightingale. Both of these left accounts of their travels, which revealed learned familiarity with all of the latest European Egyptology. Howard Carter's 1922 discovery of the tomb of 18th Dynasty King Tutankhamun brought a greater understanding of Egyptian relics and wide acclaim to the field."]}, {"page": "Helena Bonham Carter", "response": ["Bonham Carter is a distant cousin of actor Crispin Bonham-Carter. Other prominent distant relatives include Lothian Bonham Carter, who played first-class cricket for Hampshire, his son, Vice Admiral Sir Stuart Bonham Carter, who served in the Royal Navy in both world wars, and pioneering English nurse Florence Nightingale."]}, {"page": "Military technology", "response": ["Rapid development in military technology had a dramatic impact on armies and navies in the industrialized world in 1740-1914.Max Boot, War made new: technology, warfare, and the course of history, 1500 to today (Penguin, 2006). For land warfare, cavalry faded in importance, while infantry became transformed by the use of highly accurate more rapidly loading rifles, and the use of smokeless powder. Machine guns were developed in the 1860s in Europe. Rocket artillery and the Mysorean rockets, both pioneered by Indian Muslim Tipu Sultan, became more powerful as new high explosives (based on nitroglycerin) arrived during the Anglo-Mysore Wars, and the French introduced much more accurate rapid-fire field artillery. Logistics and communications support for land warfare dramatically improved with use of railways and telegraphs. Industrialization provided a base of factories that could be converted to  produce munitions, as well as uniforms, tents, wagons and essential supplies. Medical facilities were enlarged and reorganized based on improved hospitals and the creation of modern nursing,  typified by Florence Nightingale in Britain during the Crimean War of 1854-56.B.H. Liddell Hart, \"Armed Forces in the Art of War: Armies\", in J.P.T. Bury, ed., The New Cambridge Modern History: volume X: The Zenith of European Power 1830-70 (1967), 302-330."]}]}}