{"wiki_id": "http://www.wikidata.org/entity/Q3714618", "itemLabel": "Dougie Arnott", "itemDescription": "Scottish footballer (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dougie_Arnott", "wikipedia_page": {"main": "Douglas Arnott (born 5 August 1964 in Lanark) is a Scottish former footballer who played as a striker. Arnott's career began at Pollok at the Scottish Junior level, before spending his entire senior football career at Motherwell, spending twelve seasons with the Fir Park club before retiring due to an injury in 1998. In 1990–91, Arnott was part of Motherwell's Scottish Cup-winning side, which was his only senior honour.\nOn 11 September 2008, Arnott's belated testimonial match went ahead against an Old Firm select. Other players lined up for Arnott's side included former goalkeeper Sieb Dijkstra and defenders Chris McCart and Fraser Wishart, while the Old Firm team included Ally McCoist and Gordon Durie. The Old Firm side won 5–4, in a game which saw Arnott score the first of the match, and Ally McCoist net a hat-trick.", "link_mentions": [{"page": "Pollok F.C.", "response": ["On settling the Intermediate dispute in 1931 Pollok sold the following players to senior football: J.McBride, J.Robertson and R.Griffiths to Chelsea; Charlie M. Thomson to Sunderland and T.Armstrong to Airdrieonians. Other Pollok players who have also played in the Scottish Football League or Football League include Brian Bilsland, Kevin Budinauckas, Ross O'Donoghue, Craig Cranmer and Danny Diver. Former Pollok striker Dougie Arnott achieved Scottish Cup success with Motherwell.Pollok FC player index  (click on History/Past Players) In recent years, Pollok have had numerous players move up to senior level including John Sweeney – Current Clyde Captain, Arbroath keeper Scott Morrison, Airdireonians assistant/player Paul Lovering and Albion Rovers defender Ross Dunlop.. Derek Lea played in all three of Pollok's junior cup final triumphs as a striker.", "*Dougie Arnott – Motherwell"]}, {"page": "Carluke", "response": ["*Dougie Arnott, the former Motherwell striker, currently resides in the town."]}, {"page": "Tommy Coyne", "response": ["After a short spell in England, Coyne returned to Scotland to join Motherwell in November 1993 for £125,000. They challenged for the title in his first campaign, eventually finishing third, and in 1994–95 he was again the Scottish Premier Division's top scorer (16 goals) as the club finished runners-up – he is the only player to achieve that feat with three clubs.Brown, Alan. \"Scotland - List of Topscorers\". RSSSF, 5 June 2014. Retrieved on 6 July 2014. Performing well alongside Dougie Arnott and fellow Glasgow-born Irish international Owen Coyle, he scored 61 goals in 156 games for Motherwell in all competitions."]}, {"page": "Jamie Dolan", "response": ["Jamie died from a heart attack on 31 August 2008, whilst out jogging near his home in Bathgate, West Lothian. A post mortem revealed he suffered from cardiac ischaemia, a hereditary condition from which his father had also died, aged 44. Jamie had been due to play for a Motherwell Select team on 11 September 2008, in a testimonial match for former team-mate Dougie Arnott. His sudden death came just eight months after that of his former Motherwell teammate Phil O'Donnell, who died from a similar condition shortly after collapsing during a Scottish Premier League game for Motherwell."]}, {"page": "Martin Grehan", "response": ["Grehan was born in Glenrothes. After a spell in the East Fife Youth system, Grehan spent some time in the Amateurs with Fife side Kettle United. During his time at United he played with the Scotland Amateur Team. Grehan then joined Scottish Premier League club Motherwell from junior team Dundonald Bluebell in January 2008. He became the first junior player to join the club since legend Dougie Arnott back in the late 1980s. Soon after, Grehan went on a month's loan to Scottish Football League Third Division club Forfar Athletic, and made an immediate impact by scoring on his debut."]}, {"page": "Chris McCart", "response": ["On 11 September 2008, McCart played for a Motherwell side in Dougie Arnott's belated testimonial match against an Old Firm select."]}, {"page": "Paul McGrillen", "response": ["On 11 September 2008, McGrillen played for a Motherwell side in Dougie Arnott's belated testimonial match against an Old Firm select."]}, {"page": "1991 Scottish Cup Final", "response": ["|FW |||| Dougie Arnott"]}, {"page": "Douglas Arnott", "response": ["#REDIRECT Dougie Arnott"]}, {"page": "List of Motherwell F.C. seasons", "response": ["|align=\"center\"|Dougie Arnott (14)", "|align=\"center\"|Dougie Arnott (8)"]}, {"page": "1997–98 Motherwell F.C. season", "response": ["| Dougie Arnott", "||FW|||| ||Dougie Arnott||1||0||0||1"]}, {"page": "1996–97 Motherwell F.C. season", "response": ["| Dougie Arnott", "|5 ||FW|||| ||Dougie Arnott||3||0||0||3"]}]}}