{"wiki_id": "http://www.wikidata.org/entity/Q3719486", "itemLabel": "Edmund Turges", "itemDescription": "English composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Turges", "wikipedia_page": {"main": "Edmund Turges (c. 1450–1500) thought to be also Edmund Sturges (fl. 1507–1508) was an English Renaissance era composer who came from Petworth, was ordained by Bishop Ridley in 155\n0, and joined the Fraternity of St. Nicholas (the London Guild of Parish Clerks) in 1522.Several works are listed in the name of Turges in the Eton Choirbook, which survived Henry VIII's Dissolution of the Monasteries between 1536 and 1541. Turges also has a Magnificat extant in the Caius Choirbook, and compositions in the Fayrfax Boke. A Kyrie and Gloria are ascribed to Sturges in the Ritson Manuscript. At least two masses and three Magnificat settings have been lost, as well as eight six-part pieces listed in the 1529 King's College Inventory.It is quite possible that his setting of 'Gaude flore virginali' was written with the choir of New College, Oxford in mind, especially since a man by the name of Sturges served as a chaplain in the choir between 1507-08. Its unorthodox vocal scoring for TrTrATB suggests the choral forces found in the college at the time where the boys (16 in total) outnumbered the men (of whom there were likely to have been no more than four).", "link_mentions": [{"page": "List of Renaissance composers", "response": ["|Edmund Turges possibly the same as Edmund Sturges || 1450 || 1500 || Has a number of works preserved in the Eton Choirbook; at least three Magnificat settings and two masses have been lost."]}, {"page": "Eton Choirbook", "response": ["* 51.  f. 85v-87: Gaude flore virginali - Edmund Turges", "* 64.  f. 103v-105: Gaude flore virginali - Edmund Turges", "* 84.  missing: Magnificat: Et exultavit spiritus meus - Edmund Turges", "* 85.  missing: Magnificat: Et exultavit spiritus meus - Edmund Turges", "* 89.  missing: Magnificat: Et exultavit spiritus meus - Edmund Turges", "The composers represented in the manuscript are: John Browne (10 works), Richard Davy (9), Walter Lambe (8), Robert Wilkinson (7), William Cornysh (5), William Horwood (4), Robert Fayrfax (2), John Fawkyner (2), Nicholas Huchyn (2), Hugh Kellyk (2), Edmund Turges (2), Gilbert Banester, Brygeman (1), Robert Hacomplaynt (1), John Hampton (1), Holynborne (1), Richard Hygons (1), Nesbet (1), Edmund Sturton (1), John Sutton (1), Sygar (1) and William Stratford (1)."]}, {"page": "Caius Choirbook", "response": ["The major contributors to the Caius Choirbook are Robert Fayrfax and Nicholas Ludford; between them they contributed at least eleven of its fifteen pieces. Music by older composers, such as Edmund Stourton and Walter Lambe, may be found in the Lambeth and Eton Choirbooks, but not in the Caius Choirbook. Other composers represented in the Caius Choirbook include William Cornysh, Edmund Turges, and Henry Prentes. There is in addition a Mass by William Pasche, based upon Christus resurgens, a processional antiphon for Easter."]}, {"page": "List of English Renaissance composers", "response": ["*Edmund Turges may be same as Edmund Sturges (fl. c. 1507)"]}, {"page": "Edmund Sturges", "response": ["#redirect Edmund Turges"]}, {"page": "Music of Sussex", "response": ["Sussex has also been home to many composers of classical music.  It is highly likely that two of the three English choirbooks that survive from the early Tudor period originated in Sussex. The Caius Choirbook was presented from the Master of Arundel College to St Stephen's Chapel in Westminster; the Lambeth Choirbook (or Arundel Choirbook) remained at Arundel as a working choirbook. The Arundel choirbook contains works by several composers including Walter Lambe, a former lay clerk at Arundel. The Caius choirbook includes work by Edmund Turges. A tradition of performing polyphonic music was probably firmly entrenched by the end of the fifteenth century."]}, {"page": "List of Magnificat composers", "response": ["| style=white-space:nowrap data-sort-value=\"Turges, Edmund\"| Edmund Turges"]}]}}