{"wiki_id": "http://www.wikidata.org/entity/Q3719976", "itemLabel": "Edward John Bevan", "itemDescription": "British chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_John_Bevan", "wikipedia_page": {"main": "Edward John Bevan (11 December 1856 – 17 October 1921) was an English chemist. He became a leader in the affairs of the Society of Public Analysts and editor of The Analyst.\nBevan was notable for his caustic wit. He was born in Birkenhead.  After graduating, he became a chemist at the Scottish paper making firm of Alexander Cowan & Co. He met Charles Frederick Cross, and the pair then attended Owens College, Manchester.\nCross who was interested in cellulose technology went into partnership with Bevan in 1885, setting up as analytical and consulting chemists in New Court, Lincoln's Inn in London.\nIn 1888 they published what was to become a standard work on paper making. In 1892, together with another partner, Clayton Beadle (who was also an authority on paper making) they took out a patent for viscose which became the basis for the viscose, rayon and cellophane industries. In 1894 Cross and Bevan took out a patent for the manufacture of cellulose acetate - this was to become the industrial process for its manufacture.\nHe was awarded the John Scott Medal of The Franklin Institute in 1895.", "link_mentions": [{"page": "Rayon", "response": ["English chemist Charles Frederick Cross and his collaborators, Edward John Bevan and Clayton Beadle, patented their artificial silk in 1894. They named their material \"viscose\" because its production involved the intermediacy of a highly viscous solution. The process built on the reaction of cellulose with a strong base, followed by treatment of that solution with carbon disulfide to give a xanthate derivative. The xanthate is then converted back to a cellulose fiber in a subsequent step.", "French scientist and industrialist Hilaire de Chardonnet (1838–1924), inventor of the first artificial textile fiber, artificial silk, created viscose. British scientists Charles Frederick Cross and Edward John Bevan took out British Patent No. 8,700, \"Improvements in Dissolving Cellulose and Allied Compounds\" in May, 1892. In 1893, they formed the Viscose Syndicate to grant licences and, in 1896, formed the British Viscoid Co. Ltd. to exploit the process."]}, {"page": "Synthetic fiber", "response": ["The first successful process was developed in 1894 by English chemist Charles Frederick Cross, and his collaborators Edward John Bevan and Clayton Beadle. They named the fiber \"viscose\", because the reaction product of carbon disulfide and cellulose in basic conditions gave a highly viscous solution of xanthate. The first commercial viscose rayon was produced by the UK company Courtaulds in 1905. The name \"rayon\" was adopted in 1924, with \"viscose\" being used for the viscous organic liquid used to make both rayon and cellophane. A similar product known as cellulose acetate was discovered in 1865. Rayon and acetate are both artificial fibers, but not truly synthetic, being made from wood."]}, {"page": "1894 in science", "response": ["* Viscose, a form of artificial silk or rayon, is patented by Charles Frederick Cross with Edward John Bevan and Clayton Beadle."]}, {"page": "1921 in the United Kingdom", "response": ["* 17 October – Edward John Bevan, chemist, partner of Charles Frederick Cross (born 1856)"]}, {"page": "Échirolles", "response": ["Former industrial village, the majority of its inhabitants worked in the viscose factories, a fabric which was invented in Échirolles in 1884 by French scientist and industrial Hilaire de Chardonnet, before becoming universally famous. The process for manufacturing viscose was then patented by three British scientists, Charles Frederick Cross, Edward John Bevan and Clayton Beadle, in 1891."]}, {"page": "Lazăr Edeleanu", "response": ["After completing lyceum at Saint Sava High School, he went to study at the University of Berlin. He obtained his doctorate in Chemistry in 1887, with thesis \"About some derivatives of phenyl methacrylic acid and phenyl isobutyric acid\" written under the direction of August Wilhelm von Hofmann. After that, Edeleanu worked for some time at the Royal College of Artillery in London as a lecturer and as an assistant to Professor Hodgkinson. During this period, he collaborated with Charles Frederick Cross and Edward John Bevan to create a certain type of artificial fireproof silk. With Raphael Meldola he created oxazine-based dyes."]}, {"page": "British Cellophane", "response": ["The process for manufacturing cellulose film from viscose was discovered by three English chemists, Charles Frederick Cross, Edward John Bevan and Clayton Beadle in 1898."]}, {"page": "Charles Frederick Cross", "response": ["Born in Brentford, Middlesex, his father, Charles James Cross (14 October 1827 - 19 November 1910), was a schoolmaster turned soap manufacturer. After graduating from King's College London, he went to Zurich Polytechnic and then, with his future partner, Edward John Bevan, to Owens College, Manchester."]}, {"page": "Edward Bevan", "response": ["* Edward John Bevan (1856–1921), British chemist"]}, {"page": "Bevan", "response": ["*Edward John Bevan (1856–1921), English chemist"]}, {"page": "1856 in the United Kingdom", "response": ["* 11 December – Edward John Bevan, chemist, partner of Charles Frederick Cross (died 1921)"]}, {"page": "John Rex Whinfield", "response": ["He worked initially as an assistant to Charles Frederick Cross and Edward John Bevan, who had done earlier work on viscose rayon in 1892. In 1924 he was employed as a research chemist by the Calico Printers' Association based in Manchester."]}]}}