{"wiki_id": "http://www.wikidata.org/entity/Q3724650", "itemLabel": "Emma Noble", "itemDescription": "British model", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Noble", "wikipedia_page": {"main": "Emma Jane Noble (born 26 June 1971) is an English model and actress. She was hostess on Bruce Forsyth's game show The Price Is Right for four years.\nShe worked as a catwalk model for John Rocha and Ghost before turning to commercial modelling work. Her acting work includes appearances in Crossroads playing Suzie Samson, Jonathan Creek, Casualty, Dennis Potter's Cold Lazarus, the film The Truth About Love and the UK stage tour of Popcorn by Ben Elton. In 2005, Noble appeared on the Five reality TV programme The Farm, and gave her fee to the National Autistic Society. In 2008 she was made Global Ambassador for the National Autistic Society; in this role she headed the successful national campaign \"Think differently about Autism\".", "link_mentions": [{"page": "John Major", "response": ["Elizabeth Major, a qualified veterinary nurse, married Luke Salter on 26 March 2000 at All Saints Church, Somerby, having been in a relationship with him since 1988. Salter died on 22 November 2002 from cancer. James Major, a former retail manager and nightclub promoter, married gameshow hostess Emma Noble on 29 March 1999 in the Chapel Crypt at Westminster Abbey. The couple had a son, Harrison, born July 2000, who later diagnosed with autism. The marriage ended in an acrimonious divorce in 2003, with Noble accusing Major of \"unreasonable behaviour\". James later married Kate Postlethwaite (née Dorrell), the mother of his second son."]}, {"page": "Sidcup", "response": ["* Emma Noble (1971–), model and actress, born in Sidcup"]}, {"page": "GamesMaster", "response": ["*Episode 9 – Debbie Flett and Emma Noble – 27 January 1998 "]}, {"page": "Danniella Westbrook", "response": ["Westbrook was reportedly offered the role of Natalie Buxton in the ITV prison series Bad Girls, but she declined because of her nose rebuilding operation. Dannielle Brent went on to play Natalie Buxton. Westbrook also turned down a small role in Footballers Wives and the role of money grabber Suzie Samson in ITV soap opera Crossroads. Emma Noble went on to portray Suzie Samson."]}, {"page": "The Farm (British TV series)", "response": ["| Emma Noble"]}, {"page": "The Price Is Right (British game show)", "response": ["*Emma Noble (1995–1998)"]}, {"page": "1971 in British television", "response": ["* 26 June – Emma Noble, actress and model"]}, {"page": "It's Only TV...but I Like It", "response": ["| 3x05 || 23 March 2001 || Ralf Little and Gaby Roslin || Emma Noble and Rich Hall || TBC"]}, {"page": "List of people from the London Borough of Bexley", "response": ["*Emma Noble (1971–), glamour model, born in Sidcup."]}, {"page": "The Asian Awards", "response": ["In addition to the winners, other notable guests in attendance included television personalities Anthea Turner, Francine Lewis, Russell Kane, Emma Noble, actress Gemma Oaten, film director Gurinder Chadha, Adil Ray, Manish Bhasin, sportswoman Elise Christie and previous honouree Naughty Boy."]}, {"page": "Noble (surname)", "response": ["* Emma Noble (born 1971), actress and model, former daughter-in-law of Sir John Major"]}]}}