{"wiki_id": "http://www.wikidata.org/entity/Q3724557", "itemLabel": "Emily Anne Cecil", "itemDescription": "British noblewoman", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Nugent,_Marchioness_of_Westmeath", "wikipedia_page": {"main": "Emily Nugent, Marchioness of Westmeath (14 July 1789 – 21 January 1858), formerly Lady Emily Anne Bennet Elizabeth Cecil, was the first wife of George Nugent, 1st Marquess of Westmeath.\nEmily was one of the three daughters of James Cecil, 1st Marquess of Salisbury, and his wife, the former Lady Mary Amelia Hill (herself the daughter of Wills Hill, 1st Marquess of Downshire.Emily Cecil married the marquess, then Lord Delvin, on 29 May 1812, at Hatfield House, Hertfordshire. Lord Delvin was already known to have kept a mistress, the mother of his illegitimate children, and his family had recently been the subject of scandal surrounding his parents' divorce on the grounds of his mother's adultery, but the couple were reported to be deeply in love.The couple had two children:\n\nLady Rosa Emily Mary Anne Nugent (1814–1883), who married Fulke Greville-Nugent, 1st Baron Greville\nWilliam Henry Wellington Brydges Nugent, Lord Delvin (24 November 1818 – 16 November 1819)Between the birth of the two children, the couple separated and were then reconciled. After the death of their infant son, Lord Delvin, they separated again, and it was agreed that their daughter would remain in the care of her mother; a legal battle ensued and custody was awarded to the earl. The marchioness later claimed that her mother-in-law, the former Countess of Westmeath, had recommended her to \"make use of your prettiness\" with the Duke of Wellington, in order to promote her husband's career. Lord Delvin succeeded to his father's earldom in 1814, and in 1822, he was created a marquess in the Peerage of Ireland.As an indirect result of the custody battle, the marchioness's friend Caroline Norton helped to push forward the passing of the Custody of Infants Act 1839, increasing the rights of mothers. The marchioness herself was actively involved in the campaign.In 1825, the marchioness sought a legal separation from her husband in Ireland's ecclesiastical courts on the grounds of adultery and cruelty, after the marquess had been given a prison sentence for persistent duelling with those he believed to be his wife's lovers. She also claimed that he had been physically violent towards her, something he already had a reputation for. He was persuaded to sign a financial settlement ensuring that his daughter would inherit a large proportion of his estate. The couple finally divorced in 1827.Despite the scandal, the marchioness was appointed a Lady of the Bedchamber to Adelaide of Saxe-Meiningen, the consort of King William IV of the United Kingdom, retaining the post throughout the king's reign. The position brought her a salary of £275 a year.The marquess remarried in 1858, shortly after the death of his first wife.", "link_mentions": {}}}