{"wiki_id": "http://www.wikidata.org/entity/Q3724640", "itemLabel": "Emma Forrest", "itemDescription": "British journalist, novelist and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Forrest", "wikipedia_page": {"main": "Emma Forrest (born 26 December 1976) is a British-American film director, screenwriter and novelist.", "link_mentions": [{"page": "Colin Farrell", "response": ["From 2007 to 2008, Farrell dated Irish medical student Muireann McDonnell. Farrell and British-American writer Emma Forrest dated for over a year, an experience she discussed in depth in her memoir Your Voice in My Head (which mostly focused on her relationship with her therapist, who died unexpectedly). According to Forrest, she and Farrell planned to have a child together before he ended the relationship. In October 2009, Farrell fathered his second son, Henry Tadeusz, with Polish actress Alicja Bachleda-Curuś (his Ondine co-star). Their relationship ended in mid-2010. Collin Farrell reported to be dating a girl from Mornington Peninsula Victoria Australia."]}, {"page": "Kate Beckinsale", "response": ["Beckinsale starred opposite Pierce Brosnan, Callum Turner, and Jeff Bridges in Marc Webb's romantic coming-of-age drama The Only Living Boy in New York (2017), as a book editor and the mistress of a publisher whose son sees his life upended. Reviews of the film were mediocre, while it found a limited audience in theaters. The A.V. Club found Brosnan and Beckinsale to be \"vastly more interesting by the twin virtues of not disguising their voices and fitting so poorly into the sad-faced melodrama this movie wants to be\". She is attached to star in an adaptation of The Chocolate Money by Ashley Prentice Norton, with a screenplay by Emma Forrest. In 2018, Beckinsale starred as Ingrid Carpenter in the British film Farming."]}, {"page": "Richey Edwards", "response": ["According to Emma Forrest, as quoted in A Version of Reason, \"The night before he disappeared Edwards gave a friend a book called Novel with Cocaine, instructing her to read the introduction, which details the author staying in a mental asylum before vanishing.\" Whilst staying at the Embassy Hotel in Bayswater Road, London, according to Rob Jovanovic's biography, Edwards removed some books and videos from his bag. Among them was a copy of the play Equus. Edwards wrapped them carefully in a box with a note that said \"I love you\", then decorated the box like a birthday present and decorated the outside of it with collages and literary quotations. These included a picture of a Germanic-looking house and Bugs Bunny. The package was addressed to Edwards' on/off girlfriend, Jo, whom he met some years prior, although they had split a few weeks earlier."]}, {"page": "Ben Mendelsohn", "response": ["Mendelsohn married British-American journalist Emma Forrest in June 2012. He has a daughter Carolina with Forrest, born in 2014, and daughter Sophia Wright from a previous relationship, who, like Mendelsohn, is an actor. He and Forrest divorced in 2016."]}, {"page": "Dirrty", "response": ["The public widely rejected Aguilera's new image so much that it began to overshadow her music. Tim Walker from The Independent wrote: \"[Aguilera] simulated masturbation while wearing little more than a pair of leather chaps.\" Entertainment Weekly described Aguilera's image in the video as \"the world's skeeziest reptile woman,\" and The Village Voice captioned her as a xenomorph from the Alien series. Aguilera's contemporaries Shakira, Kelly Osbourne, and Jessica Simpson expressed disapproval of the video. Time magazine commented that \"she appeared to have arrived on the set... direct from an intergalactic hooker convention.\" Jancee Dunn of Rolling Stone dubbed the video Girls Gone Wild: Beyond Thunderdome. Writer Emma Forrest remarked: \"What she's depicting is subcultures within sexuality, and to say that this is normal young woman's sexuality is just not fair. Even Madonna never did that to girls.\" Aguilera responded to the criticism in Blender:"]}, {"page": "Ceremonials", "response": ["Regarding the album's title, Welch told MTV News, \"It was an art installation done in the '70s, this video piece all done on Super 8, this big procession of kind of coquette-style hippies and all these different colored robes and masks, and it was all to do with color, really saturated, brightly colored pastas and balloons. I saw it a couple years ago, and it was called 'Ceremonials' and then, like, Roman numerals after it. And the word sort of stuck with me, and I think the whole idea of performance, and kind of putting on this outfit and going out almost to find some sort of exorcism or absolution, to kind of get outside yourself, there's a sense of ceremony to it.\" Welch also revealed that she wanted to call the album Violence, stating, \"I wanted to make an album that sounded like the soundtrack to Baz Luhrmann's Romeo + Juliet, the violence mixed with the classical Shakespearean drama mixed with the pop and the pulp, extreme neon stuff.\" In an interview with The Guardian, she described the album as \"much bigger\" and categorised its genre as \"chamber soul\", a mixture of chamber pop and soul. The liner notes of Ceremonials contain an essay by English writer Emma Forrest, dated 21 September 2011.", "* Emma Forrest – liner notes"]}, {"page": "Jemima Kirke", "response": ["Growing up in West Village, Kirke found herself accepting a number of roles on her friends' projects. Dunham asked Kirke to take on a supporting role in her debut film Tiny Furniture. Kirke and a number of other friends were called upon as a favour to Dunham since there was not enough money to pay professional actors. Although the film turned out to be profitable, Kirke received no payment. Kirke reunited with Dunham in the HBO series Girls, appearing in all six seasons from 2011 to 2017 as the character Jessa Johansson. Kirke next had supporting roles in the dark comedy films Ava's Possessions and The Little Hours. In 2018, Kirke starred alongside her real-life sister Lola Kirke in Emma Forrest's film Untogether. The film premiered at the 2018 Tribeca Film Festival."]}, {"page": "Untogether", "response": ["Untogether is an American drama film directed by Emma Forrest. Her directorial debut, it stars Jamie Dornan, Ben Mendelsohn, Lola Kirke and Jemima Kirke. The film began production in October 2016.", "Screenwriter Emma Forrest makes her feature directorial debut in this film, for which she also wrote the screenplay; her ex-husband Ben Mendelsohn also stars. Jemima Kirke and Lola Kirke, real-life sisters, also have their first collaboration in the film, which began production on October 17, 2016. In November 2016, Billy Crystal and Jennifer Grey joined the cast."]}]}}