{"wiki_id": "http://www.wikidata.org/entity/Q372394", "itemLabel": "Martin McDonagh", "itemDescription": "British-Irish film director and playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_McDonagh", "wikipedia_page": {"main": "Martin Faranan McDonagh (; born 26 March 1970) is a British  playwright, screenwriter, producer, and director. Born and brought up in London, he is the son of Irish parents. A winner of the Academy Award for Best Live Action Short Film, McDonagh has been nominated for three other Academy Awards, and in 2018 won three BAFTA Awards from four nominations and two Golden Globe Awards from three nominations for his film Three Billboards Outside Ebbing, Missouri.", "link_mentions": [{"page": "March 26", "response": ["*  1970   – Martin McDonagh, English-born Irish playwright, screenwriter, and director"]}, {"page": "Tom Waits", "response": ["In 2010, Waits was reported to be working on a new stage musical with director and long-time collaborator Robert Wilson and playwright Martin McDonagh.", "In 2012, Waits had a supporting role in the crime comedy film, Seven Psychopaths, written and directed by Martin McDonagh, where he played a retired serial killer."]}, {"page": "Woody Allen", "response": ["Directors who admire Allen's work include Quentin Tarantino, who called him \"one of the greatest screenwriters of all time\", as well as Martin Scorsese, who said in Woody Allen: A Documentary, \"Woody's sensibilities of New York City is one of the reasons why I love his work, but they are extremely foreign to me. It's not another world; it's another planet\". Stanley Donen stated he liked Allen's films, Spike Lee has called Allen a \"great, great filmmaker\" and Pedro Almodóvar has said he admires Allen's work. In 2012, directors Mike Leigh, Asghar Farhadi, and Martin McDonagh respectively included Radio Days (1987), Take the Money and Run (1969), and Manhattan among their Top 10 films for Sight & Sound. Other admirers of his work include Olivia Wilde and Jason Reitman, who staged live readings of Hannah and Her Sisters and Manhattan respectively. Filmmaker Edgar Wright listed five of Allen's films (Take the Money and Run, Bananas, Play It Again, Sam, Sleeper, Annie Hall) in his list of 100 Favorite Comedy films."]}, {"page": "Playwright", "response": ["The 1990s saw the formation of playwriting collectives like 13P and Clubbed Thumb who have gathered members together to produce, rather than develop, new works. This has been a reaction to the \"developed to death\" notion in which the play never gets produced, but goes through endless readings and critiques that after a certain point in New York go through some kind of assiduous development process, and rare is the play that shows up on a producer's desk that gains any traction. On Broadway, this has happened with Mamet's Race (2009) and Martin McDonagh's A Behanding in Spokane (2010),  although these shows were packaged with stars (Christopher Walken in the latter) and with playwrights who are well established in the profession."]}, {"page": "Academy Award for Best Picture", "response": ["| Graham Broadbent, Pete Czernin, and Martin McDonagh"]}, {"page": "Academy Award for Best Live Action Short Film", "response": ["| Martin McDonagh"]}, {"page": "List of Irish people", "response": ["* Martin McDonagh – playwright"]}, {"page": "Camberwell", "response": ["Muriel Spark, the author of The Prime of Miss Jean Brodie and The Ballad of Peckham Rye lived, between 1955 and 1965, in a bedsit at 13 Baldwin Crescent, Camberwell. The novelist Mary Jane Staples, who grew up in Walworth, wrote a book called The King of Camberwell, the third instalment of her Adams family saga about Cockney life. Comedian Jenny Eclair is a long-term resident of Camberwell, and the area features in her 2001 novel Camberwell Beauty, named after a species of butterfly. Playwright Martin McDonagh and his brother, writer/director John Michael McDonagh, live in Camberwell. The 2014 novel The Paying Guests by Sarah Waters is set in 1920s Camberwell."]}, {"page": "Daniel Radcliffe", "response": ["Radcliffe branched out to stage acting in 2007, starring in the West End and Broadway productions of Equus and in the 2011 Broadway revival of the musical How to Succeed in Business Without Really Trying. He continued in Martin McDonagh's dark comedy The Cripple of Inishmaan (2011) in the West End and Broadway and a revival of Tom Stoppard's play Rosencrantz and Guildenstern Are Dead (2017) at The Old Vic. He also starred in the satirical plays Privacy (2016) and The Lifespan of a Fact (2018), respectively off-Broadway and Broadway.", "In 2013, he portrayed American beat poet Allen Ginsberg in the thriller drama Kill Your Darlings, directed by John Krokidas. He also starred in an Irish-Canadian romantic comedy film The F Word (2013) directed by Michael Dowseand written by Elan Mastai, based on TJ Dawe and Michael Rinaldi's play Toothpaste and Cigars and then he starred in an American dark fantasy horror film directed by Alexandre Aja Horns. Both of the films premiered at the 38th Toronto International Film Festival. Also in 2013, Radcliffe performed at the Noël Coward Theatre in the stage play revival of Martin McDonagh's dark comedy The Cripple of Inishmaan as the lead, Billy Claven, for which he won the WhatsOnStage Award for Best Actor in a Play."]}, {"page": "Christopher Walken", "response": ["Walken returned to Broadway in Martin McDonagh's play A Behanding in Spokane in 2010, and received a Tony Award nomination for Best Performance by a Leading Actor in a Play."]}, {"page": "Ralph Fiennes", "response": ["In 2008, he played the Duke of Devonshire in the film The Duchess opposite Keira Knightley; he also played the protagonist in The Reader, adapted from the novel of the same name alongside Kate Winslet. That same year he also appeared in Martin McDonagh's black comedy crime thriller In Bruges starring Colin Farrell, and Brendan Gleeson. In February 2009, Fiennes was the special guest of the Belgrade's Film Festival FEST. He filmed his version of Shakespeare's Coriolanus (in his directorial debut) in the Serbian capital of Belgrade. Fiennes reunited with Kathryn Bigelow for her Iraq War film The Hurt Locker, released in 2009, appearing as an English Private Military Contractor. They had previously worked together on Strange Days (1995)."]}, {"page": "Aran Islands", "response": ["* The 1996 play, The Cripple of Inishmaan, by Martin McDonagh, is set on the Aran Islands. The play is the first in the Aran Islands Trilogy, followed in 2001 by The Lieutenant of Inishmore, and the unpublished The Banshees of Inisheer."]}, {"page": "Man of Aran", "response": ["The Cripple of Inishmaan (1996) by Martin McDonagh is a play set on the Aran Islands at the time of the filming of Man of Aran."]}, {"page": "Golden Globe Award for Best Motion Picture – Drama", "response": ["| rowspan=\"5\" style=\"text-align:center;\"| 2017 || style=\"background:#b0c4de; text-align:left;\" |Three Billboards Outside Ebbing, Missouri  || style=\"background:#B0C4DE;\" | Martin McDonagh || style=\"background:#B0C4DE;\" | Graham Broadbent, Pete Czernin, Martin McDonagh"]}, {"page": "Golden Globe Award for Best Director", "response": ["| Martin McDonagh"]}, {"page": "Golden Globe Award for Best Motion Picture – Musical or Comedy", "response": ["| style=\"text-align:left;\"|In Bruges || Martin McDonagh || Graham Broadbent & Peter Czernin"]}, {"page": "1996 in literature", "response": ["*Martin McDonagh – The Beauty Queen of Leenane"]}, {"page": "1970 in literature", "response": ["*March 26 – Martin McDonagh, British-born Irish playwright"]}, {"page": "Druid Theatre Company", "response": ["In 1996, Druid premiered Martin McDonagh's debut play The Beauty Queen of Leenane', in a co-production with the Royal Court Theatre, London. Following an opening in Galway, the production played across Ireland, in London, Sydney, and New York. During its Broadway run, the production won four Tony Awards, including Best Director for Garry Hynes - the first woman to win an award for directing in the history of the awards ceremony. In 2005, the company presented DruidSynge, an production of all six plays of John Millington Synge as a day-long theatrical event, at the Galway Arts Festival to critical acclaim.http://www.druidtheatre.com/press.php?id=42 (retrieved 20 August 2006)  Several years later, Druid revived a trilogy of Tom Murphy's plays (Conversations on a Homecoming, A Whistle in the Dark and Famine) entitled DruidMurphy; this production later won several Irish Times Irish Theatre Awards in 2014. Druid continued to present large-scale ensemble productions in 2015 with DruidShakespeare - William Shakespeare’s Richard II, Henry IV, Part 1, Henry IV, Part 2 and Henry V in a new adaptation by Mark O'Rowe - which toured Ireland, the UK and the prestigious Lincoln Center Festival.", "*  The Beauty Queen of Leenane, by Martin McDonagh. World premiere, directed by Garry Hynes and starring Anna Manahan, Marie Mullen, Tom Murphy and Brian F. O'Byrne (1996).", "*  The Lonesome West, by Martin McDonagh. World premiere, directed by Garry Hynes and starring Brian F. O'Byrne, Dawn Bradfield (1997).", "*  A Skull in Connemara, by Martin McDonagh. World premiere, directed by Garry Hynes and starring Mick Lally, Anna Manahan, Brian F. O'Byrne (1997).", "*  The Cripple of Innismaan, by Martin McDonagh. Directed by Garry Hynes and starring Aaron Monaghan and Marie Mullen (2008).", "*  The Beauty Queen of Leenane, by Martin McDonagh. Twentieth anniversary revival, directed by Garry Hynes and starring Marie Mullen, Aisling O'Sullivan, Marty Rea, Aaron Monaghan (2016)", "Garry Hynes returned to the Druid Theatre Company as its artistic director in 1995, after stepping down from the Abbey Theatre (Artistic Director, 1991-1994). It was during this time that Hynes and her colleague Anne Butler read The Beauty Queen of Leenane - a script submitted by an unknown writer named Martin McDonagh. Several months later, on 1 February 1996, McDonagh's play received its world premiere at the newly refurbished Town Hall Theatre, Galway, in a co-production between Druid and the Royal Court Theatre, London. Directed by Hynes, the cast consisted of four actors: Druid founding member Marie Mullen as Maureen Foley; Anna Manahan as her elderly mother Mag; Brian F. O'Byrne as Ray Dooley; and Tom Murphy as Pato Dooley. The response, from both audiences and critics alike, was immediate and overwhelmingly positive. As noted in the Sunday Times on 10 March 1996, The Beauty Queen of Leenane was \"one of the most exhilarating debuts in years\"."]}, {"page": "Colin Farrell", "response": ["Farrell's next film, Martin McDonagh's first full-length feature In Bruges, opened the 2008 Sundance Film Festival. While The New Yorker and TimeOut Londons film critics found co-star Brendan Gleeson's performance the stronger of the two, Bradshaw of The Guardian found Farrell (as hitman Ray) \"absolutely superb: moody and funny, lethally sexy, sometimes heartbreakingly sad and vulnerable like a little boy\". Time magazine described the film as \"the prettiest bloodbath of 2008\", and Farrell won his first Golden Globe Award.", "| Martin McDonagh", "| Martin McDonagh", "| Martin McDonagh"]}]}}