{"wiki_id": "http://www.wikidata.org/entity/Q372217", "itemLabel": "Lesley Blanch", "itemDescription": "British writer and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Lesley_Blanch", "wikipedia_page": {"main": "Lesley Blanch, MBE, FRSL (6 June 1904, London – 7 May 2007, Garavan near Menton, France) was a British author, historian and traveller. She is best known for The Wilder Shores of Love, about Isabel Burton (who married the Arabist and explorer Richard), Jane Digby el-Mezrab (Lady Ellenborough, the society beauty who ended up living in the Syrian desert with a Bedouin chieftain), Aimée du Buc de Rivéry (a French convent woman captured by pirates and sent to the Sultan's harem in Istanbul), and Isabelle Eberhardt (a Swiss linguist who felt most comfortable in boy's clothes and lived among the Arabs in the Sahara).", "link_mentions": [{"page": "Dune (novel)", "response": ["Herbert drew heavy inspiration also from Lesley Blanch's The Sabres of Paradise (1960), a narrative history recounting a mid-19th century conflict in the Caucasus, between rugged Islamic tribes and the expansive Russian empire. Language used on both sides of that conflict become terms in Herbert's world - chakobsa, a Caucasian hunting language becomes a battle language of humans spread across the galaxy; kanly, a word for blood feud in the 19th century Caucasus, represents a feud between Dune's noble Houses; sietch and tabir are both words for camp borrowed from Ukrainian Cossacks (of the Pontic steppe).", "As a foreigner who adopts the ways of a desert-dwelling people and then leads them in a military capacity, Paul Atreides bears many similarities to the historical T. E. Lawrence. His 1962 biopic Lawrence of Arabia has also been identified as a potential influence. Lesley Blanch's novel The Sabres of Paradise (1960) has also been identified as a potential influence upon Dune, with its depiction of Imam Shamil and the Islamic culture of the Caucasus inspiring some of the themes, characters, events and terminology of Dune.", "Through the inspiration from Lesley Blanch's The Sabres of Paradise, there are also allusions to the tsarist-era Russian nobility and Cossacks. Frank Herbert stated that bureaucracy that lasted long enough would become a hereditary nobility, and a significant theme behind the aristocratic families in Dune was \"aristocratic bureaucracy\" which he saw as analogous to the Soviet Union.Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Romain Gary", "response": ["Gary's first wife was the British writer, journalist, and Vogue editor Lesley Blanch, author of The Wilder Shores of Love. They married in 1944 and divorced in 1961. From 1962 to 1970, Gary was married to American actress Jean Seberg, with whom he had a son, Alexandre Diego Gary. According to Diego Gary, he was a distant presence as a father: \"Even when he was around, my father wasn't there. Obsessed with his work, he used to greet me, but he was elsewhere.\"Paris Match  No.3136"]}, {"page": "Jean Seberg", "response": ["Despite extended stays in the United States, Seberg remained in Paris for the rest of her life. In 1961 she met French aviator, French resistance member, novelist and diplomat Romain Gary, who was 24 years her senior and married to author Lesley Blanch. Seberg gave birth to their son, Alexandre Diego Gary, in Barcelona on July 17, 1962.Ralph Schoolcraft: Romain Gary: The Man Who Sold His Shadow, Chapter 3, p. 69. On-line (retrieved 10 August 2012) The child's birth and first year of life were hidden, even from close friends and relatives. Gary's divorce from Blanch took place on September 5, 1962, and he married Seberg secretly on October 6, 1962 in Corsica.\"Le \"oui\" secret de jean Seberg et Romain Gary\", Le Monde, August 15, 2014. "]}, {"page": "List of historians", "response": ["*Lesley Blanch (1904–2007), English"]}, {"page": "Pierre Loti", "response": ["*Lesley Blanch (UK:1982, US:1983). Pierre Loti: Portrait of an Escapist. US:  / UK:  – paperback re-print as Pierre Loti: Travels with the Legendary Romantic (2004) "]}, {"page": "Harriette Wilson", "response": ["*Harriette Wilson's Memoirs: The Greatest Courtesan of her Age; selected and edited with an introduction by Lesley Blanch. London: John Murray, 1957Also published as: The Game of Hearts: Harriette Wilson and her Memoirs (edited and introduced by Lesley Blanch), London: Gryphon Books, 1957.--Harriette Wilson's Memoirs; selected and edited by Lesley Blanch (introduction: pp. 3–59; The lady and the game; Harriette Wilson's memoirs: pp. 61–442). London: Phoenix Press, 2003"]}, {"page": "Imam Shamil", "response": ["* Lesley Blanch. The Sabres of Paradise. New York: Viking Press. 1960."]}, {"page": "Menton", "response": ["* Lesley Blanch (1904–2007), English-born writer"]}, {"page": "Dune (franchise)", "response": ["As a foreigner who adopts the ways of a desert-dwelling people and then leads them in a military capacity, Paul Atreides' character bears many similarities to the historical T. E. Lawrence, whose 1962 biopic Lawrence of Arabia has also been identified as an influence. Lesley Blanch's novel The Sabres of Paradise (1960) about Muslim resistance to the Russian Empire in the Caucasus, has also been identified as a major influence upon Dune, with its depiction of Imam Shamil and the Islamic culture of the Caucasus inspiring some of the themes, characters, events and terminology of Dune. Multiple proverbs recorded by Blanch's The Sabres as originating from the Caucasus Mountains are included in Dune, such as “polish comes from the city, wisdom from the hills,” becoming “polish comes from the cities, wisdom from the desert” for Arrakis.", "In addition to Arabic, Dune derives words and names from multiple other languages, including Hebrew, Navajo, Latin, Chakobsa, the Nahuatl language of the Aztecs, Greek, Persian, East Indian, Russian, Turkish, Finnish, Dutch and Old English. Through the inspiration from Lesley Blanch's The Sabres of Paradise, there are also allusions to the tsarist-era Russian nobility and Cossacks. Frank Herbert stated that bureaucracy that lasted long enough would become a hereditary nobility, and a significant theme behind the aristocratic families in Dune was \"aristocratic bureaucracy\" which he saw as analogous to the Soviet Union."]}, {"page": "Roquebrune-Cap-Martin", "response": ["The literary couple Romain Gary and Lesley Blanch lived in Roquebrune from 1950 to 1957."]}, {"page": "Isabelle Eberhardt", "response": ["Eberhardt spent her money recklessly in Algiers, and quickly exhausted the funds left to her by her mother; she would often spend several days at a time in kief dens. Augustin, ejected from the Foreign Legion due to his health, returned to Geneva alongside Eberhardt in early 1899. They found Trophimowsky in poor health, suffering from throat cancer and traumatised by the loss of Eberhardt's mother and Vladimir, who had committed suicide the previous year. Eberhardt nursed her father, growing closer to him. She also commenced a relationship and became engaged to Riza Bey, an Armenian diplomat with whom she had been friends and possibly lovers when she was seventeen. Though Trophimowsky approved of the engagement, the relationship soon ended. Historian Lesley Blanch attributes the relationship's downfall to Bey being assigned to Stockholm. Trophimowsky died in May. Blanch attributes the death to a chloral overdose, with which Eberhardt may have intentionally euthanised him. Eberhardt intended to sell the villa, although Trophimowsky's legitimate wife opposed the execution of the will. After several weeks of legal contentions, Eberhardt mortgaged the property and returned to Africa on the first available ship. With both parents dead, she considered herself free of human attachments and able to live as a vagabond. Eberhardt relinquished her mother's name, and called herself Si Mahmoud Saadi. She began wearing male clothing exclusively and developed a masculine personality, speaking and writing as a man. Eberhardt behaved like an Arab man, challenging gender and racial norms. Asked why she dressed as an Arab man, she invariably replied: \"It is impossible for me to do otherwise.\" A few months later, Eberhardt's money ran low, and she returned to Geneva to sell the villa; due to the legal troubles there was little to no money available."]}, {"page": "Adelaide Hall", "response": ["Hall's career was almost an uninterrupted success. She made more than 70 records for Decca,Prestige Records Discography: 1933–1948. had her own BBC Radio series, Wrapped in Velvet\"During WWII, she hosted a radio show in London called Wrapped in Velvet\"; extract from June Sochen, From Mae to Madonna: Women Entertainers in Twentieth-century America, p. 38. .David Hinkley, \"Scat-Singing Pioneer Adelaide Hall Never Really Went Out of Style\", New York Daily News (reprinted by the Knight-Ridder/Tribune News Service, 19 November 1993, 1119K3115. (making her the first black artist to have a long-term contract with the BBC), and appeared on the stage, in films, and in nightclubs (of which she owned her own in New York, London and Paris). In the 1940s, and especially during World War II, she was hugely popular with civilian and Entertainments National Service Association (ENSA) audiencesStephen Bourne, \"When Adelaide Hall Went to War\", WW2 People's War, BBC. and became one of Britain's highest paid entertainers. Her London nightclub The Old Florida Club owned by Hall and her husband was destroyed by a landmine during an air raid in 1939. Her husband Bert was in the club's cellar when the landmine exploded but he survived the attack. Hall has a cameo appearance as a singer in the 1940 Oscar-winning movie The Thief of Bagdad (directed by Michael Powell (and others) and produced by Alexander Korda) in which she sings Lullaby of the Princess written by Miklós Rózsa.Miklós Rózsa interview explaining how he came to write the score for The Thief of Bagdad. In 1943, Hall featured in an ENSA radio show broadcast by the BBC entitled Spotlight on the Stars during which she was accompanied by the BBC Variety Orchestra. During the show she mentions how she had just returned home from a tour.An original radio recording – ENSA Presents Spotlight on the Stars – Adelaide Hall with the BBC Variety Orchestra – broadcast in 1943: YouTube. On 20 May 1940, Hall's recording of 'Careless' debuted in the British charts at number 30, where it remained for two consecutive weeks.Hits of All Decades by Barry Kowal - 1940 UK Charts, Weekly Singles Chart: May 20, 1940, & May 27, 1940, Adelaide Hall at No. 30 with 'Careless': Hits of All Decades 1940 In the August 1940 issue of British Vogue magazine, a photograph of Hall appears on the 'Spotlight' page compiled by the features editor Lesley Blanch under the caption: \"Adelaide Hall and her husband run the Florida. His show, her songs, our fun.\"Vogue magazine (British issue), August 1940. Retrieved 13 September 2014. On 6 June 1945, Hall's recording of \"There Goes That Song Again\" entered the BBC British charts at number 15.\"6 June 1944 BBC Record Chart\", WW2 People's War, BBC."]}, {"page": "Blanch", "response": ["* Lesley Blanch (1904–2007), British journalist, historian and travel writer "]}, {"page": "St Paul's Girls' School", "response": ["* Lesley Blanch – author"]}, {"page": "Violet Nicolson", "response": ["Details on her life are not easy to find due to her relative lack of letters, but Lesley Blanch, in her book Under A Lilac-Bleeding Star, included some biographical information that drew on unpublished memoirs written by her son. In Diaries and Letters from India, Violet Jacob provided some information about the Nicolsons and their milieu, although most of what is known of Violet, as she came to be known, had to be gleaned through her poetry. Despite Nicolson's use of pseudonyms and fictionalised characters, it was apparent to some of her contemporaries that her poems were deeply personal, even confessional. The \"Dedication to Malcom Nicolson\" that prefaces her last collection, written shortly before her suicide, provides an ambiguous disclaimer regarding the autobiographical origins of her poetry:"]}, {"page": "Gerald de Gaury", "response": ["He was a close friend of Freya Stark and Lesley Blanch, who said of him:"]}, {"page": "Aimée du Buc de Rivéry", "response": ["*\"The Wilder Shores of Love\" by Lesley Blanch, London: Phoenix Press and New York: Simon & Schuster, 1954"]}, {"page": "Lesley", "response": ["* Lesley Blanch (1904–2007), British writer and editor"]}, {"page": "2007 in the United Kingdom", "response": ["** Lesley Blanch, writer and fashion editor (born 1904)"]}, {"page": "1904 in the United Kingdom", "response": ["* 6 June – Lesley Blanch, writer and fashion editor (died 2007)"]}, {"page": "Jurgis Karnavičius (composer)", "response": ["* Barocco, Ballet in 1 act (1938); libretto by Lesley Blanch"]}, {"page": "Ramuntcho", "response": ["Ramuntcho (1897) is a novel by French author Pierre Loti. It is a love and adventure story about contraband runners in the Basque province of France. It is one of Loti's most popular stories—\"love, loss and faith remain eternal themes\"Lesley Blanch, Pierre Loti, Collins 1983, p.239 —with four French film adaptations. It was first published in 5 parts, from 15 December 1896 to 15 February 1897, in the Revue de Paris. Calmann-Lévy published the novel in two parts on 10 March 1897. A dramatized version was staged in Paris in 1910, with incidental music by Gabriel Pierné.Lesley Blanch, p. 239."]}, {"page": "Carroll & Graf Publishers", "response": ["* Lesley Blanch"]}, {"page": "Deaths in May 2007", "response": ["*Lesley Blanch, 102, British writer and fashion editor."]}, {"page": "My Brother Yves", "response": ["The fictional Yves was, in reality, Loti's friend, the Breton sailor Pierre le Cor, whom he had sailed with on a number of voyages. A functional illiterate, le Cor was, however, tall, fair and handsome; everything Loti wanted to be.Lesley Blanch (1983). Chapter 8. Like Yves, le Cor was a heavy drinker, while Loti hardly drank at all. The two often spent time ashore either gambling, brawling, scheming childish pranks, or roaming the countryside of Brittany where le Cor introduced Loti to the lore of the Breton culture. In Brittany, Loti met le Cor's mother, and swore to watch over her son forever, although le Cor's hard drinking often tested the bonds of their friendship.  ", "*Lesley Blanch (UK:1982, US:1983). Pierre Loti: Portrait of an Escapist. US:  / UK:  - paperback re-print as Pierre Loti: Travels with the Legendary Romantic (2004) "]}, {"page": "Le Mariage de Loti", "response": ["It was in Tahiti that the transformation of Julien Viaud into Pierre Loti began, a transformation that would come to characterize Loti's future work and life. He \"went native\": living among the local people, learning the language, wearing their dress, adopting their customs, loving their women, even adopting the new pseudonym of \"Loti\" given to him by the local natives—all the while retaining his military duties, and keeping a detailed diary which would become the source for his novel. Cavorting with natives while on active duty might appear unusual, but French military custom did not generally prevent its officers from socializing with other classes, unlike the English military, so it was easy for Loti to divide his attentions and duties between the navy and the Tahitians. Further, the admiral of the fleet had a personal interest in the history and anthropology of Tahiti and encouraged Loti to learn more.Lesley Blanch (1982/83)", "The novel reflected prevailing imperialistic attitudes towards the colonies, seeing the natives as innocent and wild children of the forest exposed to the fearsome and old paternal European culture. This was during a period (1880s to 1900s) when European imperialism had reached its height and the genre of \"romantic exoticism\", of which this work is one of the finest examples, struck a popular chord. In a post-colonial perspective it is largely seen as racist and imperialistic. As biographer Lesley Blanch says, \"Loti's works helps to sustain [the] gratifying image of cultural superiority among his European readers. To enjoy reading Loti is to enjoy the personal and cultural complacency of which the colonial venture thrived.\" However Loti's lyrical prose and hauntingly vivid descriptions of the Polynesian islands are artistically satisfying,The Marriage of Loti is still in print and often listed with other books about the literature of Polynesia. and the tragic ending, as Loti's recognizes his failure through a broken heart, adds a more human and universal dimension to the strictly colonial interpretation.", "*Lesley Blanch. Pierre Loti: The Legendary Romantic. 1982–83. Chapter 4."]}, {"page": "List of atheist authors", "response": ["* Pierre Loti (1850–1923): French novelist and travel writer.Repeatedly mentioned in Lesley Blanch's biography of him: Pierre Loti – Travels with the Legendary Romantic."]}, {"page": "Horizon (U.S. magazine)", "response": ["*Lesley Blanch-writer and historian"]}, {"page": "Leader Magazine", "response": ["Contributors included Stephen PotterISBN search  (editor), Kay Dick (literary critic), Anthony Carson, Orson Welles, Edgar Lustgarten, Lesley Blanch,University of Bristol Theatre Collection  Leslie Illingworth, Eric Partridge, cartoonist Vicky, Stephen King-Hall.Leader Magazine July 20, 1946 Theatre critic John Barber was also sub-editor at one time.The Times Obituaries Another drama critic was Herbert Farjeon.University of Bristol Theatre Collection  Kaye Webb was theatre correspondent from 1947-49.Obituary: Kaye Webb The Independent (London), Jan 18, 1996"]}, {"page": "List of centenarians (authors, editors, poets and journalists)", "response": ["|Lesley Blanch || 1904–2007 || 102 || English author and fashion criticMcGuinness, Mark. \"An eccentric romantic's life: Lesley Blanch (1904–2007)\", The Sydney Morning Herald, Weekend Edition, May 19–20, 2007, p. 53"]}, {"page": "List of UK literary agencies", "response": ["|Lesley Blanch (estate), George Elton Mayo (estate)"]}, {"page": "Audrey Withers", "response": ["After the end of the world war, Withers promoted advanced causes, and alongside its traditional coverage of beauty and fashion Vogue developed a highbrow streak, publishing articles by Simone de Beauvoir, Bertrand Russell, Marghanita Laski, Dylan Thomas, Kingsley Amis, and work by features editors  Lesley Blanch, and later (1947-1955 Siriol Hugh-Jones. Elizabeth David wrote on food, while the critic Penelope Gilliatt got her start in a Vogue talent contest inaugurated by Withers. Her photographers included Norman Parkinson, Antony Armstrong-Jones, and Irving Penn. She twice employed John Deakin as a staff photographer and twice dismissed him.Robin Muir, A Maverick Eye: the Street Photography of John Deakin (London: Thames & Hudson, 2002; ), pp. 8–9, 204 Her personal style was frugal, preferring sandwiches to expensive restaurants and buses to taxis, and she became a member of the Council of Industrial Design."]}, {"page": "Kent Carroll", "response": ["* Lesley Blanch"]}, {"page": "The Wilder Shores of Love", "response": ["The Wilder Shores of Love is a work of non-fiction by travel writer Lesley Blanch. It was first published in 1954. It is a colourful account of four women – Isabel Burton, Jane Digby, Aimée du Buc de Rivéry and Isabelle Eberhardt – who left Europe to live in the Middle East.", "The title of the novel inspired subsequent works. A book of her travel writings entitled From Wilder Shores: The Tables of My Travels was published in 1989, and an anthology of her shorter work, collected by Georgia de Chamberet, is titled Lesley Blanch: On the Wilder Shores of Love."]}, {"page": "Journey into the Mind's Eye", "response": ["#REDIRECT Lesley Blanch"]}]}}