{"wiki_id": "http://www.wikidata.org/entity/Q373566", "itemLabel": "Adrian Mitchell", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Mitchell", "wikipedia_page": {"main": "Adrian Mitchell FRSL (24 October 1932 – 20 December 2008) was an English poet, novelist and playwright. A former journalist, he became a noted figure on the British Left. For almost half a century he was the foremost poet of the country's Campaign for Nuclear Disarmament movement. The critic Kenneth Tynan called him \"the British Mayakovsky\".Mitchell sought in his work to counteract the implications of his own assertion that, \"Most people ignore most poetry because most poetry ignores most people.\"In a National Poetry Day poll in 2005 his poem \"Human Beings\" was voted the one most people would like to see launched into space. In 2002 he was nominated, semi-seriously, Britain's \"Shadow Poet Laureate\". Mitchell was for some years poetry editor of the New Statesman, and was the first to publish an interview with the Beatles. His work for the Royal Shakespeare Company included Peter Brook's US and the English version of Peter Weiss's Marat/Sade.Ever inspired by the example of his own favourite poet and precursor William Blake, about whom he wrote the acclaimed Tyger for the National Theatre, his often angry output swirled from anarchistic anti-war satire, through love poetry to, increasingly, stories and poems for children. He also wrote librettos. The Poetry Archive identified his creative yield as hugely prolific.The Times said that Mitchell's had been a \"forthright voice often laced with tenderness.\" His poems on such topics as nuclear war, Vietnam, prisons and racism had become \"part of the folklore of the Left. His work was often read and sung at demonstrations and rallies.\"", "link_mentions": [{"page": "Animal Farm", "response": ["A theatrical version, with music by Richard Peaslee and lyrics by Adrian Mitchell, was staged at the National Theatre London on 25 April 1984, directed by Peter Hall. It toured nine cities in 1985."]}, {"page": "Allen Ginsberg", "response": ["Soon after the bookshop reading, plans were hatched for the International Poetry Incarnation, which was held at the Royal Albert Hall in London on June 11, 1965. The event attracted an audience of 7,000, who heard readings and live and tape performances by a wide variety of figures, including Ginsberg, Adrian Mitchell, Alexander Trocchi, Harry Fainlight, Anselm Hollo, Christopher Logue, George MacBeth, Gregory Corso, Lawrence Ferlinghetti, Michael Horovitz, Simon Vinkenoog, Spike Hawkins and Tom McGrath. The event was organized by Ginsberg's friend, the filmmaker Barbara Rubin."]}, {"page": "Adrian", "response": ["*Adrian Mitchell (1932–2008), English poet, novelist and playwright"]}, {"page": "Arlo Guthrie", "response": ["Like his father, Woody Guthrie, he often sings songs of protest against social injustice.  He collaborated with poet Adrian Mitchell to tell the story of Chilean folk singer and activist Víctor Jara in song.  He regularly performed with folk musician Pete Seeger, one of his father's longtime partners. Ramblin' Jack Elliott, who had lived for two years in the Guthries' home before Arlo left for boarding school, had absorbed Woody's style perhaps better than anyone; Arlo has been said to have credited Elliott for passing it along to him. "]}, {"page": "December 20", "response": ["*2008 – Adrian Mitchell, English author, poet, and playwright (b. 1932)"]}, {"page": "List of English-language poets", "response": ["*Adrian Mitchell (1932–2008, E)"]}, {"page": "October 24", "response": ["*  1932   – Adrian Mitchell, English journalist, author, poet, and playwright (d. 2008)"]}, {"page": "Through the Looking-Glass", "response": ["* Alice in Wonderland and Through the Looking-Glass (2001) was a stage adaption by Adrian Mitchell for the Royal Shakespeare Company, in which the second act consists of Through the Looking-Glass."]}, {"page": "Peter Gabriel", "response": ["Gabriel has been described as one of rock's most political musicians by AllMusic. In 1992, on the 20th anniversary of the Bloody Sunday tragedy, Gabriel joined several left-wing figures such as Peter Hain, Jeremy Corbyn, Tony Benn, Ken Loach, John Pilger and Adrian Mitchell in voicing his support for a demonstration in London calling for British withdrawal from Northern Ireland."]}, {"page": "List of poets", "response": ["*Adrian Mitchell (1932–2008), English poet, novelist and playwright."]}, {"page": "The Movement (literature)", "response": ["The \"Angry Young Men\" movement occurred in 1956 during the turning point of the Movement.Angry Young Men David Lodge attributed the Movement's decline to the publication of the New Lines anthology. Afterward, The Group became less exclusive. Members were no longer required to fight and defend one another's work, for they had become accepted members of the literary world. The Group's members included Philip Hobsbaum, Alan Brownjohn, Adrian Mitchell, Peter Porter, Edward Lucie-Smith, George MacBeth, Ian Hamilton's Review school and Michael Horovitz's \"Children of Albion\". The Group was similar to the Movement; they shared similar ideas about the form and seriousness of modernist poetry."]}, {"page": "Royal National Theatre", "response": ["* Fuente Ovejuna by Lope de Vega, translated by Adrian Mitchell, directed by Declan Donnellan (1989)"]}, {"page": "English poetry", "response": ["The Mersey Beat poets were Adrian Henri, Brian Patten and Roger McGough. Their work was a self-conscious attempt at creating an English equivalent to the Beats. Many of their poems were written in protest against the established social order and, particularly, the threat of nuclear war. Although not actually a Mersey Beat poet, Adrian Mitchell is often associated with the group in critical discussion. Contemporary poet Steve Turner has also been compared with them."]}, {"page": "Performance poetry", "response": ["In the United Kingdom, many avant-garde poets are deeply committed to live exposition of work, moving on from Cobbing and his peers. Well-known names include cris cheek and Aaron Williamson. The work of UK poet Michael Horovitz helped to spread this tradition in Britain during the early 1960s. His Live New Departures - a touring version of his poetry and arts journal New Departures (launched 1959) - gave space and opportunities to poets like Pete Brown and Adrian Mitchell who combined performed verse with the backing of jazz musicians like pianist Stan Tracey and saxophonist Bobby Wellins."]}, {"page": "1932 in literature", "response": ["*October 24 – Adrian Mitchell, English poet, playwright and fiction writer (died 2008)"]}, {"page": "1934 in literature", "response": ["*October 24 – Adrian Mitchell, English poet, playwright and children's author (died 2008)"]}, {"page": "1961 in literature", "response": ["*Eric Gregory Award: Adrian Mitchell, Geoffrey Hill"]}, {"page": "1965 in literature", "response": ["*June 11 – International Poetry Incarnation, a performance poetry event, takes place at London's Royal Albert Hall before an audience of 7,000, with members of the Beat Generation featuring. Adrian Mitchell reads \"To Whom It May Concern\"."]}, {"page": "UK miners' strike (1984–85)", "response": ["Chris Cutler, Tim Hodgkinson and Lindsay Cooper from Henry Cow, along with Robert Wyatt and poet Adrian Mitchell recorded The Last Nightingale in October 1984 to raise money for the strikers and their families."]}, {"page": "Pedro Calderón de la Barca", "response": ["Although not well known to the current English-speaking world, Calderón's plays were first adapted into English during the 17th century. For instance, Samuel Pepys recorded attending to some plays during 1667 which were free translations of some of Calderón's. Percy Bysshe Shelley translated a substantial portion of El Mágico prodigioso. Some of Calderón's works have been translated into English, notably by Denis Florence MacCarthy, Edward FitzGerald, Roy Campbell, Edwin Honig, Kenneth Muir & Ann L. Mackenzie, Adrian Mitchell, and Gwynne Edwards."]}, {"page": "Christopher Plummer", "response": ["From June 1971 to January 1972, he appeared at the Royal National Theatre, acting in repertory for the season. The plays he appeared in were Jean Giraudoux's Amphitryon 38 directed by Laurence Olivier; Georg Büchner's Danton's Death (director Jonathan Miller); Adrian Mitchell's Tyger; Luigi Pirandello's The Rules of the Game; and Eugene O'Neill's Long Day's Journey into Night at the New Theatre in London. From May to June 1973, he appeared on Broadway as the title character in Cyrano, a musical adaptation of Edmond Rostand's 1897 play Cyrano de Bergerac by Anthony Burgess and Michael J. Lewis. For that performance, Plummer won the Tony Award for Best Actor in a Musical and a Drama Desk Award for Outstanding Performance. Later that year, he played Anton Chekhov in Neil Simon's adaptation of several Chekhov short stories, The Good Doctor. Another notable play in which he appeared was the 1974 adaptation of Arthur Miller's After the Fall, in which he played Quentin (a part originated on Broadway by Jason Robards) opposite Faye Dunaway's Maggie."]}, {"page": "Alan Lee (illustrator)", "response": ["He has illustrated retellings of classics for young people. Two were Rosemary Sutcliff's versions of the Iliad and the Odyssey—namely, Black Ships Before Troy (Oxford, 1993) and The Wanderings of Odysseus (Frances Lincoln, 1995). Another was Adrian Mitchell's version of Ovid's Metamorphoses—namely, Shapeshifters (Frances Lincoln, 2009).\"Shapeshifters: tales from Ovid's Metamorphoses\". WorldCat. Retrieved 28 November 2012."]}, {"page": "List of British playwrights since 1950", "response": ["*Adrian Mitchell"]}, {"page": "Penguin Modern Poets", "response": ["#John Fuller, Peter Levi, Adrian Mitchell"]}, {"page": "British Poetry since 1945", "response": ["A. Alvarez - Kingsley Amis - George Barker - Patricia Beer - Martin Bell - Francis Berry - John Betjeman - D. M. Black - Thomas Blackburn - Alan Bold - Alan Brownjohn - Basil Bunting - Miles Burrows - Charles Causley - Barry Cole - Tony Connor - Iain Crichton Smith - Peter Dale - Donald Davie - Lawrence Durrell - D. J. Enright - Paul Evans - Ian Hamilton Finlay - Roy Fisher - John Fuller - Roy Fuller - Robert Garioch - David Gascoyne - Karen Gershon - Henry Graham - W. S. Graham - Robert Graves - Harry Guest - Thom Gunn - Michael Hamburger - Ian Hamilton Finlay - Lee Harwood - Spike Hawkins - Seamus Heaney - John Heath-Stubbs - Adrian Henri - Geoffrey Hill - Philip Hobsbaum - Anselm Hollo - Ted Hughes - Elizabeth Jennings - Brian Jones - David Jones - Philip Larkin - Peter Levi - Christopher Logue - Edward Lucie-Smith - George MacBeth - Norman MacCaig - Hugh MacDiarmid - Roger McGough - George Mackay Brown - Louis MacNeice - Barry MacSweeney - Derek Mahon - Matthew Mead - Christopher Middleton - Adrian Mitchell - Dom Moraes - Edwin Morgan - Edwin Muir - Jeff Nuttall - Stewart Parker - Brian Patten - Sylvia Plath - Peter Porter - Tom Raworth - Peter Redgrove - Jon Silkin - Stevie Smith - Bernard Spencer - Jon Stallworthy - Nathaniel Tarn - Dylan Thomas - D. M. Thomas - Anthony Thwaite - Charles Tomlinson - Rosemary Tonks - Gael Turnbull - Vernon Watkins - David Wevill"]}, {"page": "Tom Phillips (artist)", "response": ["In 1978 Brian Eno produced a recording of Irma for Obscure Records directed by Gavin Bryars with a cast including Howard Skempton and Phillips himself. Phillips began contributing regular reviews to The Times Literary Supplement (now TLS). At the beginning of the 1980s he designed a series of tapestries for his old Oxford college and he returned to portraiture with a portrait of Pella Erskine-Tulloch (the bookbinder who bound Phillips' favourite version of A Humument in three volumes). Erskine-Tulloch would become the subject of a series of weekly sittings which he described as \"Pella on Sunday\". He had moved out of the family home at 102 Grove Lane and moved back into his studio at 57 Talfourd Road in Peckham. A man with a great pleasure in habit, he would lunch every Tuesday in the Choumert Café on Choumert Road. His private limited edition of his own translation of Dante's Inferno illustrated with his prints was published in 1983 and in 1984 he was elected a Royal Academician.Karl Fugelso, \"Tom Phillips' Dante,\" in: Cahier Calin: Makers of the Middle Ages. Essays in Honor of William Calin, ed. Richard Utz and Elizabeth Emery (Kalamazoo, MI: Studies in Medievalism, 2011), pp. 62–64. Peter Greenaway and Phillips co-directed A TV Dante with John Gielgud and Bob Peck, which was broadcast on Channel 4 television in 1986. During this time he also collaborated with Malcolm Bradbury, Adrian Mitchell, Jake Auerbach, Richard Minsky and Heather McHugh."]}, {"page": "Oxford poetry anthologies", "response": ["Joseph Addison – Richard Aldington – Kenneth Allott – Aneirin – Guillaume Apollinaire – Louis Aragon – Matthew Arnold – Herbert Asquith – Margaret Atwood – W. H. Auden – William Edmonstoune Aytoun – Joel Barlow – O. Bernard – Sir John Betjeman – Laurence Binyon – John Peale Bishop – Edmund Blunden – William Lisle Bowles – Rupert Brooke – Robert Browning – George Gordon Noel, Lord Byron – Norman Cameron – Thomas Campbell – May Wedderburn Cannan – Charles Causley – Geoffrey Chaucer – G. K. Chesterton – Joseph P. Clancy – Samuel Taylor Coleridge – John Cornford – Stephen Crane – T. W. H. Crosland – Kevin Crossley-Holland – E. E. Cummings – R. N. Currey – Samuel Daniel – Elizabeth Daryush – Sir William Davenant – Donald Davie – C. Day-Lewis – Daniel Defoe – Paul Dehn – James Dickey – Emily Dickinson – John Donne – Hilda Doolittle – Keith Douglas – Michael Drayton – John Dryden – Douglas Dunn – Richard Eberhart – T. S. Eliot – Ralph Waldo Emerson – Gavin Ewart – James Fenton – Robert Fitzgerald – Ephim Fogel – Carolyn Forché – Robert Frost – Roy Fuller – George Gascoigne – David Gascoyne – Allen Ginsberg – Robert Graves – Julian Grenfell – Thom Gunn – Ivor Gurney – Thomas Hardy – Seamus Heaney – Anthony Hecht – Geoffrey Hill – Homer – Horace – A. E. Housman – Henry Howard, Earl of Surrey – Julia Ward Howe – Ted Hughes – Victor Hugo – Randall Jarrell – Samuel Johnson – David Jones – Sidney Keyes – Galway Kinnell – Rudyard Kipling – Lincoln Kirstein – Stanley Kunitz – Philip Larkin – Laurie Lee – J. B. Leishman – Denise Levertov – Alun Lewis – Sir Richard Lovelace – James Russell Lowell – Robert Lowell – Thomas Babington, Lord Macaulay – George MacBeth – John McCrae – Hugh MacDiarmid – Archibald MacLeish – Louis MacNeice – Allen Mandelbaum – Andrew Marvell – Herman Melville – Robert Mezey – James Michie – Adam Mickiewicz – John Milton – Adrian Mitchell – Marianne Moore – Howard Nemerov – Sir Henry Newbolt – George Orwell – Wilfred Owen – George Peele – Benjamin Perét – Peter Porter – Ezra Pound – F. T. Prince – John Pudney – Herbert Read – Henry Reed – Edgell Rickword – Rihaku – Rainer Maria Rilke – Arthur Rimbaud – T. W. Rolleston – Isaac Rosenberg – Alan Ross – Charles Sackville – Carl Sandburg – Siegfried Sassoon – Dorothy L. Sayers – Vernon Scannell – John Scott – Karl Shapiro – Percy Bysshe Shelley – Simonides – Louis Simpson – Edith Sitwell – W. D. Snodgrass – Charles Sorley – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – William Stafford – Jon Stallworthy – Wallace Stevens – Allen Tate – James Tate – Alfred, Lord Tennyson – William Makepeace Thackeray – Dylan Thomas – Edward Thomas – James Thomson – Charles Tomlinson – William Tyndale – Fyodor Tyutchev – Virgil – Andrei Voznesensky – Arthur Waley – Edgar Wallace – Sylvia Townsend Warner – Walt Whitman – Richard Wilbur – Charles Wolfe – William Wordsworth – W. B. Yeats", "Henry Aldrich - William Allingham - Drummond Allison - John Amner - Matthew Arnold - W. H. Auden - Philip Ayres - William Baldwin - George Barker - Jane Barker - Clement Barksdale - Richard Barnfield - Thomas Bastard - Francis Beaumont - Samuel Beckett - Thomas Lovell Beddoes - Thomas Beedome - Hilaire Belloc - Sir William Berkeley - John Berryman - John Betjeman - Elizabeth Bishop - Thomas Blackburn - William Blake - Edmund Blunden - Francis William Bourdillon - Anne Bradstreet - Robert Bridges - John Digby, Earl of Bristol - Emily Brontë - Elizabeth Barrett Browning - Robert Browning - John Bunyan - Robert Burns - George Gordon, Lord Byron - Norman Campbell - Roy Campbell - Thomas Campion - Thomas Carew - George Chapman - Thomas Chatterton - Geoffrey Chaucer - G. K. Chesterton - Richard Church - John Ciardi - Arthur Hugh Clough - Mary Coleridge - Samuel Taylor Coleridge - William Collins - William Congreve - Frances Cornford - William Johnson Cory - Francis Coutts - William Cowper - George Crabbe - Hart Crane - Stephen Crane - Richard Crashaw - Robert Creeley - John Crowne - E. E. Cummings - J. V. Cunningham - George Daniel - Sir William Davenant - John Davies of Hereford - W. H. Davies - C. Day-Lewis - Walter De La Mare - Sir John Denham - John Warren, Lord De Tabley - Emily Dickinson - Robert Dodsley - John Donne - Ernest Dowson - William Drummond of Hawthornden - John Dryden - Alan Dugan - Sir Edward Dyer - Clifford Dyment - Richard Eberhart - T. S. Eliot - Ralph Waldo Emerson - William Empson - D. J. Enright - Robert Devereux, Earl of Essex - Sir George Etherege - Gavin Ewart - Mildmay Fane, Earl of Westmorland - Sir Richard Fanshawe - Robert Fitzgerald - Thomas Fitzgerald - Thomas Flatman - James Elroy Flecker - Richard Flecknoe - John Fletcher - Phineas Fletcher - Ford Madox Ford - John Ford - Robert Francis - John Freeman - Robert Frost - Roy Fuller - John Gay - Oliver Goldsmith - Robert Graves - Thomas Gray - Fulke Greville - Ivor Gurney - John Hall - Thomas Hardy - Sir John Harington - Seamus Heaney - Robert Heath - Anthony Hecht - Edward, Lord Herbert of Cherbury - George Herbert - Robert Herrick - Thomas Heywood - Aaron Hill - Ralph Hodgson - A. D. Hope - Gerard Manley Hopkins - A. E. Housman - Ted Hughes - T. E. Hulme - Randall Jarrell - Robinson Jeffers - Elizabeth Jennings - Esther Johnson - Sir William Jones - Ben Jonson - Patrick Kavanagh - P. J. Kavanagh - John Keats - X. J. Kennedy - Henry King - Galway Kinnell - Rudyard Kipling - Mary Lamb - Walter Savage Landor - George Granville, Lord Landsdowne - Philip Larkin - D. H. Lawrence - Laurie Lee - Vachel Lindsay - Richard Lovelace - James Russell Lowell - Robert Lowell - Robert Bulwer-Lytton - Norman MacCaig - Hugh MacDiarmid - Patrick MacDonogh - Phyllis McGinley - Louis MacNeice - Derek Mahon - Edward May - Herman Melville - William Meredith - James Merrill - W. S. Merwin - Charlotte Mew - Alice Meynell - James Michie - Thomas Middleton - Edna St. Vincent Millay - John Milton - Adrian Mitchell - Lady Mary Wortley Montagu - James Graham, Marquis of Montrose - Marianne Moore - Thomas Moore - Thomas Nashe - Howard Nemerov - Margaret Cavendish, Duchess of Newcastle - William Cavendish, Duke of Newcastle - Norman Nicholson - Dudley, Lord North - Wilfred Owen - Edward de Vere, Earl of Oxford - Philip Pain - Coventry Patmore - William Pattison - Thomas Love Peacock - George Peele - Katherine Philips - Eden Phillpotts - Sylvia Plath - Alexander Pope - Ezra Pound - F. T. Prince - Matthew Prior - Francis Quarles - Sir Walter Ralegh - Thomas Randolph - John Crowe Ransom - James Reeves - Edwin Arlington Robinson - John Wilmot, Earl of Rochester - W. R. Rodgers - Theodore Roethke - Christina Rossetti - Dante Gabriel Rossetti - Samuel Rowlands - George William Russell - Thomas Rymer - Charles Sackville, Earl of Dorset - Carl Sandburg - Siegfried Sassoon - Sir Walter Scott - William Shakespeare - Percy Bysshe Shelley - William Shenstone - Sir Edward Sherburne - James Shirley - Sir Philip Sidney - James Simmons - C. H. Sisson - Edith Sitwell - John Skelton - Jonathan Smedley - Stevie Smith - William Jay Smith - Robert Southey - Muriel Spark - Sir John Squire - Sir Richard Steele - James Stephens - Wallace Stevens - Anne Stevenson - Robert Louis Stevenson - Trumbull Stickney - William Strode - Jonathan Swift - Arthur Symons - J. M. Synge - Nahum Tate - Alfred, Lord Tennyson - A. S. J. Tessimond - Dylan Thomas - Edward Thomas - R. S. Thomas - Francis Thompson - Henry Thoreau - Thomas Traherne - George Turbervile - John Updike - Mark Van Doren - Henry Vaughan - Edmund Waller - William Walsh - Vernon Watkins - Samuel Wesley - Walt Whitman - John Greenleaf Whittier - Anna Wickham - John Wigson - Richard Wilbur - Oscar Wilde - William Carlos Williams - Anne Finch, Countess of Winchilsea - William Wordsworth - Judith Wright - Sir Thomas Wyatt - Elinor Wylie - W. B. Yeats - Andrew Young"]}, {"page": "Liverpool poets", "response": ["Although he was born in Sussex, Adrian Mitchell shared many of the concerns of the Liverpool poets and is often linked with them in critical discussion."]}, {"page": "Rayner Heppenstall", "response": ["*London Consequences (1972) with Margaret Drabble, B. S. Johnson, Eva Figes, Gillian Freeman, Jane Gaskell, Wilson Harris, Olivia Manning, Adrian Mitchell, Paul Ableman, John Bowen, Melvyn Bragg, Vincent Brome, Peter Buckman, Alan Burns, Barry Cole, Julian Mitchell, Andrea Newman, Piers Paul Read and Stefan Themerson."]}, {"page": "Marat/Sade", "response": ["Marat/Sade is a play with music. The use of music follows the approach of Brecht, whereby the songs comment on themes and issues of the play. Unlike a traditional musical format, the songs do not further the plot or expositional development of character in the play. By contrast they often add an alienation effect, interrupting the action of the play and offering historical, social and political commentary. Richard Peaslee composed music for the original English-language production of Marat/Sade directed by Peter Brook. Although there is no official score to the play in any language, the success of the Brook-directed Royal Shakespeare Company production and film made the Peaslee score popular for English-language productions. Sections of the Peaslee score have been included in trade copies of the Geoffrey Skelton/Adrian Mitchell English version (based on the text used for the Royal Shakespeare Company productions). The full score is available from ECS Publishing/Galaxy Music Corporation. The original Royal Shakespeare Company production was so popular that folk singer Judy Collins recorded a medley of songs from the show on her album In My Life.", "In 1964 the play was translated by Geoffrey Skelton with lyric adaptation by Adrian Mitchell and staged by the Royal Shakespeare Company. Peter Brook directed a cast that included Ian Richardson as the herald, Clive Revill as Marat, Patrick Magee as de Sade and Glenda Jackson as Charlotte Corday.", "The 1967 film adaptation featured many of the original players from the American production. The long version of the play's title is shown in the film's opening credits, although this was frequently shortened to Marat/Sade in publicity materials. The screenplay was written by Adrian Mitchell and directed by Peter Brook. The cast included Richardson, Magee, Jackson, Jones, and Clifford Rose."]}, {"page": "Body bag", "response": ["In modern warfare, body bags have been used to contain the bodies of dead soldiers. Disaster agencies typically have reserves of body bags, both for anticipated wars and natural disasters. During the Cold War, vast reserves of body bags were built up in anticipation of millions of fatalities from nuclear war. This was the subject of Adrian Mitchell's protest poem \"Fifteen Million Plastic Bags\"."]}, {"page": "Charenton (asylum)", "response": ["The play has been reprised in many forms and forums. The 1967 film adaptation featured many of the original players, and utilized the long version of the play's name in its opening credits, although this was frequently shortened to Marat/Sade in publicity materials. The screenplay was written by Adrian Mitchell. Peter Brook directed a cast that included Ian Richardson, Patrick Magee, Glenda Jackson, Michael Williams, Freddie Jones and Clifford Rose."]}, {"page": "Dauntsey's School", "response": ["* Adrian Mitchell, radical poet"]}, {"page": "Peace News", "response": ["* Peace is Milk: Peace News Poets by Adrian Mitchell, 1966."]}, {"page": "A Sense of Wonder", "response": ["# \"Let the Slave (Incorporating the Price of Experience)\" (William Blake, Adrian Mitchell, Mike Westbrook) – 5:26"]}, {"page": "Fisk Jubilee Singers", "response": ["On 15 May 2010 BBC Radio 4 broadcast a play The Jubilee Singers about the Fisk Jubilee Singers' European Tour of 1873 by Adrian Mitchell. (The poet, playwright and human rights campaigner died in 2008.) It portrayed the relationship between the singers and a Welsh journalist who admired them and later acted as their publicist.", "*Play by Adrian Mitchell The Jubilee Singers, broadcast on BBC Radio 4 on 15 May 2010."]}, {"page": "Song of Innocence", "response": ["Song of Innocence was one of many concept albums recorded as rock music was developing in various directions during the late 1960s, following in the wake of the Beatles' 1967 album Sgt. Pepper's Lonely Hearts Club Band. It was innovative for its original application of both rock and jazz techniques. According to music journalist Zaid Mudhaffer, the term \"jazz fusion\" was coined in a review of the record when it was released. Axelrod followed the album in 1969 with the similarly Blake-inspired Songs of Experience, which adapted Gunther Schuller's third stream concept to baroque orchestrations and rock, pop, and R&B rhythms and melodies. Both albums established Axelrod as an unpredictable, challenging conceptual artist. His instrumental interpretations of Blake were the first in jazz, followed in 1971 by Rafał Augustyn's Niewinność and Adrian Mitchell's musical Tyger: A Celebration of William Blake with composer Mike Westbrook; Westbrook later composed more Blake-inspired works, including The Westbrook Blake: \"Bright as Fire\" (1980).; ; "]}, {"page": "Michael Garrick", "response": ["Soon after graduating, Garrick became the musical director of \"Poetry & Jazz in Concert\", a roadshow devised by poet and publisher Jeremy Robson, and involving writers as diverse as Laurie Lee, Adrian Mitchell, Vernon Scannell, Spike Milligan, Dannie Abse, and John Smith. Garrick's quintet at this time included Joe Harriott and Shake Keane. Garrick came to special prominence in the British contemporary jazz world initially as the pianist with the Don Rendell–Ian Carr quintet from 1965 to 1969, and led his own sextet from 1966."]}, {"page": "Fuenteovejuna", "response": ["The play was produced at London's Royal National Theatre in 1989, as adapted by Adrian Mitchell and directed by Declan Donnellan.", "* BBC Radio 3 play. Adapted by Adrian Mitchell, broadcast August 5, 2007."]}, {"page": "Mike Westbrook", "response": ["Adrian Mitchell drew Mike Westbrook in for his musical Tyger on the life of William Blake for the Royal National Theatre. This would become a major influence on Mike Westbrook's work (see paragraph on later work below).", "His work for the theatre began with Adrian Mitchell's Tyger, a celebration of William Blake, staged by the Royal National Theatre in 1971. This became a vehicle for his Brass Band of the 1970s and 1980sCotterrell, Roger. ‘Mike Westbrook: Taking Music to the People’ Jazz Forum 39 (Jan 1976), 38-41. and the LP The Westbrook Blake – Bright As Fire followed on in 1980. A revised and expanded version of the work was re-recorded in 1997 and named Glad Day. In 1982, at the insistence of the anti-nuclear campaigner E. P. Thompson, Westbrook recorded \"The Human Abstract\" as a single for CND. The cover carried an extract from Thompson's 1980 protest pamphlet Protest and Survive and the single included a poetry/graphic insert designed by Kate Westbrook and Michael Kustow."]}, {"page": "Stephen Lowe (playwright)", "response": ["In the 1980s, Lowe edited two anthologies of peace plays for Methuen.  The first volume was of plays by British playwrights, including Deborah Levy, Adrian Mitchell, and Lowe himself (Keeping Body and Soul Together).  It was published in 1985 during a period of increased tension towards the end of the Cold War, and Lowe's introduction quoted from Gabriel Garcia Marquez's Nobel acceptance speech, \"we, the inventors of tales, who will believe anything, feel entitled to believe that it is not yet too late to engage in the creation of a utopia of a very different kind.\"Introduction to Peace Plays volume 1, edited by Stephen Lowe; Methuen, London, 1985; p vii  The second volume, published in 1990, came out of the new era of glasnost and a thaw in relations between the two superpowers.  For this volume Lowe selected plays by two American playwrights, Arthur Kopit and Richard Stayton; and by two Russian playwrights, Fyodor Burlatsky, a former adviser to Khrushchev and Gorbachev, and Mikhail Bulgakov."]}]}}