{"wiki_id": "http://www.wikidata.org/entity/Q373651", "itemLabel": "Michael Ridpath", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Ridpath", "wikipedia_page": {"main": "Michael Ridpath is an English author of thrillers involving the world of high finance. He was born in Devon in 1961 and grew up in Yorkshire. He was educated at Millfield School and Merton College, Oxford, and spent eight years working as a bond trader at an international bank in the City of London. His past employers include Saudi International Bank and Apax Partners.Ridpath lives in north London with three children and his wife, Barbara Ridpath. His latest work is the Fire & Ice series about an Icelandic detective called Magnus Jonson.", "link_mentions": [{"page": "Samuel West", "response": ["West has recorded over one hundred audiobooks, among which are the Shakespeare plays All's Well That Ends Well, Coriolanus, Henry V, The Merchant of Venice, A Midsummer Night's Dream, Much Ado About Nothing, Richard II and Macbeth (directed by Steven Berkoff), the Wind on Fire trilogy by William Nicholson (The Wind Singer, Slaves of the Mastery and Firesong), the Arthur trilogy by Kevin Crossley-Holland (The Seeing Stone, At the Crossing Places and King of the Middle March), five books by Sebastian Faulks (Charlotte Gray, Birdsong, The Girl at the Lion d'Or, Human Traces and A Possible Life), four by Michael Ridpath (Trading Reality, Final Venture, Free to Trade, and The Marketmaker), two by George Orwell (Nineteen Eighty-Four and Homage to Catalonia), two by Mary Wesley (An Imaginative Experience and Part of the Furniture), two by Robert Goddard (Closed Circle and In Pale Battalions) and several compilations of poetry (Realms of Gold: Letters and Poems of John Keats, Bright Star, The Collected Works of Shelley, Seven Ages, Great Narrative Poems of the Romantic Age and A Shropshire Lad). Also Faust, Bomber, Doctor Who: The Vengeance of Morbius, Empire of the Sun,  Brighton Rock, Fair Stood the Wind for France,  Fluke, Great Speeches in History, How Proust Can Change Your Life,  Lady Windermere's Fan, Peter Pan, The Alchemist, The Day of the Triffids,  The Hairy Hands, The Lives of Christopher Chant, The Man Who Made Husbands Jealous, The Queen's Man, The Solitaire Mystery, The Swimming Pool Library, The Two Destinies, The Velveteen Rabbit, The Way I Found Her, The Way to Dusty Death, The Woodlanders, Under the Net, Wuthering Heights and Philip Pullman's Grimm Tales for Young and Old."]}, {"page": "Ansen Dibell", "response": ["* How to Write a Million: The Complete Guide to Becoming a Successful Author (with Orson Scott Card, Lewis Turco, and Michael Ridpath), Constable Robinson, January 1995, "]}, {"page": "Ridpath", "response": ["*Michael Ridpath (born 1961), English author"]}, {"page": "Barbara Ridpath", "response": ["Barbara Ridpath is Director of St Paul's Institute, a department of St Paul's Cathedral that focuses on the relationship between finance, economics and the common good.St Paul's Institute announces appointment of new Director She is married to the writer, Michael Ridpath."]}, {"page": "List of people educated at Millfield", "response": ["* Michael Ridpath, novelist"]}, {"page": "List of alumni of Merton College, Oxford", "response": ["*Michael Ridpath, author (1979)"]}, {"page": "Ridpath, Michael", "response": ["#redirectMichael Ridpath"]}]}}