{"wiki_id": "http://www.wikidata.org/entity/Q3734145", "itemLabel": "Alison King", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Alison_King", "wikipedia_page": {"main": "Alison Rosamund King (born 3 March 1973) is an English actress and model. She is known for her roles as Lynda Block in the Sky One drama series Dream Team (1998–2003, 2005–2007), and Carla Connor in the long-running ITV soap opera Coronation Street (2006–present). She won Best Actress at the 2012 British Soap Awards.", "link_mentions": [{"page": "Coronation Street", "response": ["Tina O'Brien revealed in the British press on 4 April 2007 that she would be leaving Coronation Street later in the year. Sarah-Louise, who was involved in some of the decade's most controversial stories, left in December 2007 with her daughter, Bethany. In 2008, Michelle learning that Ryan (Ben Thompson) was not her biological son, having been accidentally swapped at birth with Alex Neeson (Dario Coates). Carla Connor (Alison King) turned to Liam for comfort and developed feelings for him. In spite of knowing about her feelings, Liam married Maria Sutherland (Samia Longchambon). Maria and Liam's baby son was stillborn in April, and during an estrangement from Maria upon the death of their baby, Liam had a one-night stand with Carla, a story which helped pave the way for his departure. Gail Platt's (Helen Worth) son David (Jack P. Shepherd) pushed her down the stairs. Enraged that Gail refused to press charges, David vandalised the Street and was sent to a young offenders' facility for several months. In May 2008, Gail finally met Ted Page (Michael Byrne), the father she had never known and in 2009, Gail's boyfriend Joe McIntyre (Reece Dinsdale) became addicted to painkillers, which came to a head when he broke into the medical centre. ", "Coronation Street and its characters often rely heavily on archetypes, with the characterisation of some of its current and recent cast based loosely on former characters. Phyllis Pearce (Jill Summers), Blanche Hunt (Maggie Jones) and Sylvia Goodwin (Stephanie Cole) embodied the role of the acid-tongued busybody originally held by Ena, Sally Webster (Sally Dynevor) has grown snobbish, like Annie, and a number of the programme's female characters, such as Carla Connor (Alison King), mirror the vulnerability of Elsie and Bet. Other recurring archetypes include the war veteran such as Albert Tatlock (Jack Howarth), Percy Sugden (Bill Waddington) and Gary Windass (Mikey North), the bumbling retail manager like Leonard Swindley (Arthur Lowe), Reg Holdsworth (Ken Morley), Norris Cole (Malcolm Hebden), quick-tempered, tough tradesmen like Len Fairclough (Peter Adamson), Jim McDonald (Charles Lawson), Tommy Harris (Thomas Craig) and Owen Armstrong (Ian Puleston-Davies), and the perennial losers such as Stan and Hilda, Jack and Vera, Les Battersby (Bruce Jones), Beth Tinker (Lisa George) and Kirk Sutherland (Andrew Whyment).Little. (1998) p.7."]}, {"page": "Ken Barlow", "response": ["Ken doesn't know where his loyalties lie when Peter is found to be having an affair with Carla Connor (Alison King), and he is estranged from his son, Simon (Alex Bain). Ken is then shocked to discover that Peter has been indicted for the murder of Frank Foster (Andrew Lancel), who had been found not guilty of raping Carla. He tries to help but is pushed away. Eventually, it is found that Frank's mother Anne was the real culprit. She is given a custodial sentence, whilst Peter is free to go. In mid-2013, Ken leaves the street temporarily to look after his grandson Adam in Canada. (a plot devised due to actor William Roache on leave after being arrested). He returns in August 2014 to find his family in chaos. Peter has been imprisoned for the murder of his secret lover Tina McIntyre (Michelle Keegan) and Tracy is engaged to Carla's brother Rob Donovan (Marc Baylis). Carla had been pregnant with Peter's baby but had a miscarriage after they separated and Deirdre has fallen apart at the prospect of dealing with all this on her own. Ken is infuriated that Deirdre did not tell him sooner about all this and sets out to clear Peter's name, only to find that the majority of residents on the street, including Simon, believes that Peter did kill Tina. Ken is not sure whom to believe anymore. He later discovers that Peter has sacked his lawyer and it becomes even more likely that he will be found guilty of the murder."]}, {"page": "2003 in film", "response": ["| Shanghai Knights || Touchstone Pictures / Spyglass Entertainment || David Dobkin (director); Alfred Gough, Miles Millar (screenplay); Jackie Chan, Owen Wilson, Fann Wong, Donnie Yen, Aidan Gillen, Aaron Taylor-Johnson, Tom Fisher, Oliver Cotton, Kim Chan, Gemma Jones, Tom Wu, Kelly-Marie Kerr, Constantine Gregory, Ray Dunn, Barbara Nedeljakova, Anna-Louise Plowman, Georgina Chapman, Daisy Beaumont, Alison King || Comedy, Martial Arts || || Live Action"]}, {"page": "Kirby Muxloe", "response": ["* Alison King, actress"]}, {"page": "Shanghai Knights", "response": ["* Alison King as Prostitute"]}, {"page": "Deirdre Barlow", "response": ["Ken returns to Weatherfield in August 2014, but only finds out about Peter's situation from his wife Carla (Alison King), who had left Peter after discovering his affair with Tina. This leads to a major row between Ken and Deirdre, who says that Rob has been a real rock for her. Ken goes to bed to sleep off his jet lag, but Deirdre continues crying alone and when Tracy and Rob return home she falls into their arms crying as they console her. Ken forgives Deirdre and wants to take her on holiday. He orders a caravan so he can take Deirdre to North Wales; she is disappointed as she wanted to go abroad. The holiday is disastrous, and Ken takes her back home; Tracy reveals that Peter is drinking again, leaving Deirdre and Ken shocked. In October, Deirdre begins to struggle with the stress of the trial, and after Tracy and Carla argue during a meal she has prepared, she loses her temper and throws an unset trifle against the wall. Ken then suggests that she stay with Bev Unwin (Susie Blake) for a while, and Deirdre then leaves to stay with Bev until the trial is over. After the trial is over, she decides to stay longer as Bev's brother Lenny Baker has recently died. It is not until July 2015 that Deirdre prepares to return to Coronation Street. Her family arrange a surprise sixtieth birthday party for her at The Rovers, but Bev arrives at the Barlow house to break the news that Deirdre has died, possibly after suffering a brain aneurysm, caused by her many years of chain smoking. Ken also hears from Bev that Deirdre was planning to return to him a few weeks earlier, but decided to stay longer as she felt humiliated about Tracy's affair with Liz's boyfriend Tony Stewart (Terence Maynard). Deirdre's funeral takes place on 13 July and many turn up to pay their respects to her. While Emily Bishop (Eileen Derbyshire) is reading a poem, Ken snaps at Tracy."]}, {"page": "Dream Team (TV series)", "response": ["The show's cast varied over the years with many coming's and going's that reflect the natural course of a professional football club throughout various seasons. Lisa Burstow, Terry Kiely, Alison King, Danny Husbands, Andy Ansah, Emma Gilmour, Daymon Britton, John Salthouse, Philip Barantini and Francis Johnson were the most frequently cast members over the 10 seasons. Notable other actors included Martin Crewes, Ricky Whittle, Charles Venn, Michael Melia, Luke Mably, Dhaffer L'Abidine, Jamie Lomas, Robert Kazinsky, Kara Tointon and Robbie Gee. Many real life footballers and members of English sporting community including presenters and commentators also featured on the show.", "*Alison King as Lynda Block (1998–2007)"]}, {"page": "Hayley Cropper", "response": ["Hesmondhalgh's portrayal of Hayley, and her on-screen chemistry with fellow actor David Neilson, encouraged the writers to allow the character to evolve from a brief love interest for Roy to a popular long-term character. Hayley would go on to spend 16 years on Coronation Street, always seeing the good in people and nurturing Fiz Brown (Jennie McAlpine) and Becky McDonald (Katherine Kelly) from troubled young women to kind, caring, individuals.  In her later years, Hayley formed an unlikely, yet notably close, friendship with Carla Connor (Alison King) and although it was obvious the pair were from completely different walks of life, they came to respect and care for each other.", "In May 2010, Hayley and Roy argue when she suggests that they have a lavish wedding, now that the law has changed and their union can now be officially recognised. Roy agrees but he is more concerned with inheritance law, upsetting Hayley, so she moves in with friend Anna Windass (Debbie Rush). On 1 June 2010, Robbie Sloan (James Fleet) tricks Hayley to go to the factory, telling her that Carla Connor (Alison King) has had an accident, when in reality Robbie has tied Carla to a chair and duct taped her mouth shut. Once there, Hayley sees Carla bound and gagged but Robbie pulls out a gun on her before she can escape, and ties her to a chair too. Killer Tony Gordon (Gray O'Brien) arrives, takes the gag off Carla's mouth and threatens them, revealing that Hayley is there as revenge against Roy, who convinced Tony to confess his crimes to the police, and says he will kill her and Carla. After Maria Connor (Samia Ghadie) accidentally interrupts and raises the alarm, Roy rushes to Underworld but can not help her, while Carla pleads with Tony to let Hayley go – Tony eventually relents and throws Hayley out. She is taken care of by paramedics and she and Roy tell one another they love each other before watching the factory blow up, after Tony sets fire to the building, killing himself but Carla manages to untie herself and escapes."]}, {"page": "Julie Hesmondhalgh", "response": ["Hesmondhalgh's character Hayley was involved in high-profile storylines, including one concerning a gender transition, and a hostage storyline in the Underworld factory in which Hayley and Carla Connor (Alison King) were kidnapped, bound and gagged by rogue businessman Tony Gordon, who intended to murder them. They escaped unharmed, although Tony was killed in the ensuing explosion. On 11 January 2013, ITV announced that Hesmondhalgh would be leaving Coronation Street in January 2014 after 15 years on the show, and that her character Hayley was to leave in a controversial right-to-die storyline, following a battle with pancreatic cancer. Hesmondhalgh filmed her final scenes on 18 November 2013; they were broadcast on 22 January 2014, the night she won a National Television Award for Best Performance in a Serial Drama, which she shared with her longtime co-star, David Neilson. Over 10 million viewers tuned in to Hayley's final episode, where she ended her life. She worked with pancreatic cancer charities to raise awareness of the disease, and was involved in a petition and attended a parliamentary debate on the subject in 2014."]}, {"page": "Mile High", "response": ["| Alison King"]}, {"page": "Daz (detergent)", "response": ["Other episodes have a character who do not use Daz which causes them problems, which are solved by a character who uses Daz. Cleaner Close is a parody of Coronation Street, Brookside or EastEnders. Most of the adverts feature ex-soap stars, sometimes portrayed as a similar character to the one they played in their original soap, and are narrated by Tony Hirst; who would later star in both Hollyoaks and Coronation Street. Soap stars or ex-soap stars to have appeared in Cleaner Close include: Michelle Collins (Cindy Beale in EastEnders, Stella Price in Coronation Street), Alison King (Carla Connor in Coronation Street), Chris O'Dowd (Brendan Davenport in The Clinic), Jennifer Ellison (Emily Shadwick in Brookside) and Julie Goodyear (Bet Lynch in Coronation Street)."]}, {"page": "Maria Connor", "response": ["Maria starts dating property developer Chris Pitcher but is disappointed to learn he considers her beneath him and is only interested in a casual relationship. Maria is reminded of the way she treated Tyrone and tries to resume her romance with him, even though he is now dating Molly Compton (Vicky Binns), but he turns her down. Maria later begins a relationship with Liam Connor (Rob James-Collier) and moves in with him. Maria finds that she is pregnant, and Liam proposes. Unknown to Maria, Liam has captured his sister-in-law Carla Connor's (Alison King) affections, which causes Maria some anxiety, but they still marry. Maria is horrified to realise that the baby has stopped kicking and an emergency scan shows that the baby has died. She delivers a stillborn baby boy who she names Paul after Liam's late brother, Paul Connor (Sean Gallagher) and Liam finds himself drawn to Carla. The secret lovers are discovered by Carla's fiancée Tony Gordon (Gray O'Brien) who has Liam murdered in a hit and run attack. The same night, Liam's sister, Michelle (Kym Marsh) realises Maria is pregnant again. Maria learns about Liam's affair when a drunken Sally Webster (Sally Dynevor) shows her video footage of Carla and Liam in each other's arms at Carla's wedding to Tony. The video was taken by her daughter, Rosie (Helen Flanagan). Maria becomes suspicious of Tony when she learns that he knew about the affair before marrying Carla and suspects he is involved in Liam's death. She begins a harassment campaign against Tony, who considers killing Maria to silence her. Maria almost runs Tony over in her car, causing him minor injuries, and he refuses to press charges against her."]}, {"page": "Kym Marsh", "response": ["Marsh joined the cast of Coronation Street, playing Michelle Connor from 3 April 2006 onwards. For her role on the show she has subsequently received Newcomer awards at the 2007 British Soap Awards and the 2007 National Television Awards, among others. Becoming a regular character, her storylines have included a serious relationship with Steve McDonald (Simon Gregson), discovering that her son had been swapped at birth, the death of her eldest brother Paul (Sean Gallagher) and the murder of her other brother Liam (Rob James-Collier), her failed engagement to Ciaran McCarthy (Keith Duffy), surviving a minibus crash, becoming pregnant with Steve's baby, learning that Steve has also impregnated Leanne Battersby (Jane Danson), delivering a stillborn son Ruairi and being stalked by her ex-boyfriend Will (Leon Ockenden). Other storylines have focused on the relationships with her sisters-in-law, Carla (Alison King) and Maria (Samia Ghadie), as well as her relationship with Robert Preston (Tristan Gemmill) after the collapse of her marriage to Steve."]}, {"page": "Emily Bishop", "response": ["In November 2015, Coronation Street confirmed that Derbyshire had requested a six-month break with immediate effect, which she was granted. Derbyshire was one of four cast members to announce their temporary exit around the same time as Alison King who plays Carla Connor, David Neilson who plays Roy Cropper and Les Dennis who plays Michael Rodwell also announced that they would be temporarily departing. Derbyshire's exit scenes aired on 1 January 2016 in which Emily left the street to visit her nephew Spider (Martin Hancock)."]}, {"page": "Steve McDonald (Coronation Street)", "response": ["In December 2013, when Michelle's friend, Carla Connor (Alison King), marries Steve's friend, Peter Barlow (Chris Gascoyne), Steve and Michelle help plan the wedding, which prompts them to begin a party planning business together. However, a few months later, Steve is shocked to discover that Peter is having an affair with Tina McIntyre (Michelle Keegan). When the truth is revealed, Carla says that she is going to kill Tina and is prime suspect in her murder investigation when she is found lying dead on the pavement. When Michelle discovers that Steve knew about Tina and Peter's affair, she dumps him, packs her bags and moves in with Carla. However, they get back together within a week and begin to save up for a holiday home in Spain."]}, {"page": "Kevin Webster", "response": ["Towards the end of 2011, Sophie and Sian announce their intention to have a civil partnership. Kevin and Sally come round to the idea and a date is set for late December. However, Kevin learns from Sunita that Sophie has been having doubts, and he tries unsuccessfully to talk her out of it. Later, during the ceremony, Kevin feels his fears are well-founded when Sophie stumbles through her vows and tells her that she didn't have to go through with it, causing a massive row between Sophie and Sian; the ceremony is abandoned. That evening Sian leaves Sophie for good and Kevin is guilt-stricken over his part in the break-up. Sophie tells him that she will never speak to him again. Sally and Rosie are sympathetic, knowing Kevin didn't do it out of spite. Soon Kevin learns that Sally is dating Frank Foster (Andrew Lancel), who is awaiting trial for raping Carla Connor (Alison King). Kevin had doubts about Frank's past and wanting the truth from Sally, he is forced to tell Sophie but Sally accuses Kevin of trying to interfere in their relationship and retaliates by telling him that she will file for divorce the next day. Sophie rejects him again when she asks Dennis Tanner (Philip Lowrie) to fix a leak in the kitchen - stating that she would \"much rather drown than speak to my dad again\", though Rita suggests Kevin give it time and Sophie will realise that she was wrong but she adopts Frank as father figure, to Kevin's growing disgust. However, he did achieve one good thing: he started repairing his friendship with Tyrone as Kirsty had just learned that she was pregnant and Tyrone wasn't sure if he wanted to be with her. Upon learning on Kirsty's pregnancy, Kevin congratulated Tyrone and the two shook hands. This persuaded Tyrone to stay with her and started Kevin and Tyrone's healing relationship."]}, {"page": "Sally Webster", "response": ["During her time on the soap, she has also tried to impress her bosses Bet Lynch (Julie Goodyear), Alf Roberts (Bryan Mosley), Mike Baldwin (Johnny Briggs), Paul Connor (Sean Gallagher) and Carla Connor (Alison King) and gain promotions. Sally also embarks on a relationship with Tim Metcalfe (Joe Duttine) and goes on to marry him, survives a minibus crash, begins a political career on the local council and later progresses to become the Mayor, becomes the victim of an internet troll, is wrongfully imprisoned for fraud and is injured when the roof collapses at the factory.", "After being fired by Underworld boss Carla Connor (Alison King) because of the company's financial difficulties, Sally complains to Carla's ex-business partner/former fiancé, Frank (Andrew Lancel), who employs her and promotes her to line supervisor. At the same time, her relationship with Rosie's agent, Jeff, ends after the Weatherfield Gazette publish a story detailing Sally's cancer, Kevin's infidelity, baby Jack and Sophie's sexuality – information provided by Jeff. Sally soon finds herself drawn to Frank and makes it clear that she does not believe Carla's claims that he raped her and the pair form a mutual attraction for one another. However, on 2 March 2012, Sally sees Frank's true colours when his mother tells Sally that Frank does not love her and is having an affair with Jenny Sumner (Niky Wardley). A shocked Sally confronted Frank and he admits the affair and that he did rape Carla, warning her not to cross him as the last woman who did 'lived to regret it'. Sally is devastated by this and Kevin offers her support, threatening to murder Frank and then on 5 March, Sally finds Frank dead in the factory. She is found standing over him with blood on her hands but did not kill him as he was bludgeoned to death with a whiskey bottle. However, due to recent events, Sally is a suspect but she attends his funeral and is puzzled when Anne (Gwen Taylor), Frank's mother, leaves the crematorium, during the service and visits her. Sally finds Anne holding Frank's missing watch, which was missing from his personal possessions on the day he died and she admits having it all along and Sally realises that Anne killed Frank in a fit of rage as she heard him admitting to Carla that he did rape her. A horrified Sally then tries to leave but falls on the stairs, hitting her head on the wooden banister, knocking her unconscious. As Carla and Kevin arrived, an ambulance is called and Anne is arrested. Sally and Kevin begin to rekindle their romance and relationship as Sally realises that she still loves Kevin and he has stood by her regardless. Unfortunately though Sally cannot accept Jack."]}, {"page": "Roy Cropper", "response": ["Roy proposes to Hayley again, but tensions over the wedding cause Hayley to move in with Anna Windass (Debbie Rush). A few weeks later, Tony breaks out of prison with the help of Robbie Sloane, a former cellmate and plans to hold Hayley and Carla Connor (Alison King) hostage at Underworld. Robbie poses as a businessman and lures Carla into the factory alone before holding her at gunpoint, and leaving her tied to her office chair with her mouth taped shut. He then tells Hayley that Carla has had an accident to get her into the factory. Hayley sees Carla bound and gagged but Robbie holds her at gunpoint too before she can escape. Tony then arrives. Tony rips the tape off Carla's mouth and announces his plans to murder them. After hearing what has happened, Roy heads to the factory and begs for Hayley's life. After Carla pleads with Tony, Hayley is later released and she is then reunited with Roy, just as the factory is blown up; although Carla manages to escape but Tony kills himself by walking back into the burning factory. On the day of his wedding, Hayley is late due to some interference by scorned wedding planner Mary Taylor (Patti Clare). She eventually makes it to the ceremony and she and Roy are married. Roy receives a letter from his estranged mother, Sylvia Goodwin (Stephanie Cole), telling him that his stepfather has died. A few days later, Sylvia turns up in Weatherfield to give Roy a train set. Hayley asks Roy to let Sylvia move in with them and she begins working with Roy in the café. Sylvia asks why she has not yet had grandchildren, and Hayley initially passes her infertility off as menopause. She is livid to discover that Hayley is transgender, but after getting to know Hayley, she learns to accept her for who she is."]}, {"page": "Tracy Barlow", "response": ["Tracy is the daughter of Ray Langton (Neville Buswell) and Deirdre Barlow (Anne Kirkbride). Tracy never had much to do with Ray and was later adopted by Deirdre's new husband Ken Barlow (William Roache). Early storylines featuring Tracy concentrated on her childhood. She went on to feature in storylines about drugs, various family crises, relationships with Roy Cropper (David Neilson) and Steve McDonald (Simon Gregson), a feud with Steve's ex-wife Karen McDonald (Suranne Jones) and a short-lived marriage to Robert Preston (Julian Kay). Her exit storyline in 2007 was the culmination of a storyline that saw Tracy imprisoned for killing her boyfriend Charlie Stubbs (Bill Ward) in revenge. In the on-screen events, Tracy was sentenced to 15 years in prison. Her brief return in May 2010 saw the character lie about Gail Platt (Helen Worth) confessing to murdering late husband Joe McIntyre (Reece Dinsdale). Her return in December 2010 saw her released from prison after forensic evidence used at her trial was discredited, and getting her daughter Amy Barlow (Elle Mulvaney) back and attempting to steal Steve from his wife Becky McDonald (Katherine Kelly) and failing; resulting in them both having a feud. Tracy also sparked a feud with Tina McIntyre (Michelle Keegan), which worsened after it transpired that Tina had kissed Rob Donovan (Marc Baylis). Rob would later murder Tina and after discovering this, Tracy and Rob's sister, Carla Connor (Alison King), turned him in and he was arrested, sparking a feud between Tracy and Carla. Tracy's former husband Robert Preston (Tristan Gemmill) also returned, with Tracy going on to briefly reunite with him. She has since remarried Steve and had a drunken one night stand with Paula Martin (Stirling Gallacher).", "Tracy begins dating Rob Donovan (Marc Baylis). Rob and Tracy then buy the bookmakers' and turn it into a pawnbroker's shop. Tracy is furious when Norris Cole (Malcolm Hebden) tells her that Rob kissed Tina McIntyre (Michelle Keegan) and that his elder sister Carla Connor (Alison King) knew about it. Rob attacks Tina in her own home, leading to her running to the balcony, where the argument continues. He tries to persuade Tina not to tell Carla about her affair with Peter – unaware that Peter has told her himself – to save her feelings and threatens her not to say anything to the police about their dealings with Tony. Tina refuses, so as Rob pushes her away, Tina loses her balance and falls from the balcony, plummeting onto the cobbles below. Rob believes that Tina is dead, so leaves her flat panic-stricken. He then hears Tina's groans and realises that she is still alive. Tina threatens to tell the police that Rob pushed her from the balcony on purpose in an attempt to kill her. This pushes Rob over the edge, leading to him picking up a metal pipe and beating her with it. Tracy is happy that Tina has been hospitalised, as she hated her. When Tina dies, however, she is slightly more sympathetic. Rob calls her from a B&B, admits to killing Tina. He tells Tracy he is running out of money and Tracy agrees to bring some to him, which she takes out of their wedding cards. Tracy and Rob meet, she gives him the money but upon saying goodbye decides she wants to go on the run with him. They plan for her to collect their things and meet the following evening. She meets Rob and he says they have to get away quickly, but Tracy cries and tells him she is sorry. She has called the police and told them where he would be, as she realised she could not leave Amy and knew that she did not want to be in prison again. Rob is shocked and devastated, telling her she had a choice, and she could have chosen him. He is led away by police.", "In December 2012, it was announced that an upcoming storyline would see Tracy begin a dangerous relationship with Rob Donovan (Marc Baylis), the brother of Carla Connor (Alison King). Speaking of the storyline a Coronation Street source said: \"Tracy and Rob are a match made in soap hell, They will be fiery, passionate and out to cause trouble.\" Baylis went on to say: \"Watch this space – interestingly, Tracy Barlow comes onto his radar.  That is an interesting combination. Without a doubt, he sees something of himself in Tracy and finds her intriguing!\" Ford admitted: \"She [Tracy] likes the fact that he's quite feisty – it takes one to know one, after all. Maybe they're kindred spirits!\" Asked about the kind of a dynamic between Rob and Tracy, Baylis told Digital Spy: \"There's a lot of joyful banter - they challenge each other in a fun way. They're quite similar, they can see those similarities and they do have a lot of fun together. They put a smile on each other's faces, and we'll just have to see how it goes from there.\" Asked if Rob can hold his own when it comes to Tracy, Baylis replied: \"\"Definitely, otherwise he wouldn't get involved. He is aware of the whole situation that happened with Ryan last year, but he's got a few more years on Ryan and he's been round the block a few times. Rob definitely wouldn't get involved in something that he didn't think he could handle. But Rob does have an arrogant side, and he feels like he could deal with anything. That's one of Rob's main flaws. I've really enjoyed working with Kate Ford on the storyline - we've had an absolute blast. We've been working a lot together, and hopefully the working relationship that we've built up behind the scenes will come across on screen. I'm looking forward to seeing that unfold myself.\" When asked how Rob first gets Tracy's attention, Ford told All About Soap: \"Well, Tracy's going off shopping in town and she gets into a taxi at exactly the same time as Rob. She demands that he leave, as it's her taxi and not his. He refuses to move though, and when Steve asks them where they're going and they both say the city centre at the same time, they share a smile and end up going in the cab together. She likes the fact that he's quite feisty - it takes one to know one, after all. Maybe they're kindred spirits!\" Ford also stated that not only is Tracy attracted to Rob, she realises that it would also annoy Michelle (Kym Marsh), adding: \"If he had got out of the taxi, she probably wouldn't have fancied him. He's quite easy on the eye too, of course. Plus, he hangs round with Michelle, and if Tracy and Rob were an item, it would annoy her - that's another good reason for Tracy.\" On Tracy's reaction to being asked out by Rob, she said: \"She's quite annoyed at first and she turns him down. But he persists and he flatters her, so she thinks, why not? I think he's like a nicer version of Charlie, so maybe. He's got the bad lad streak, he's ruthless, but he's nowhere near as cruel as Charlie.\""]}, {"page": "Submerged (2005 film)", "response": ["* Alison King as Damita", "Alison King said of working on the film: \"It was filmed in Bulgaria. He’s a member of the American military and I’m Dimita – the best field op in the business. I’m an action girl with a high pony-tail doing lots of stunts. The stunt guy had worked with Angelina Jolie on Tomb Raider and he showed me how to hang upside down from things, how to jump down into dams and how to strangle people with my knees. It was great fun.\""]}, {"page": "Rovers Return Inn", "response": ["* 27 May 2014: Peter Barlow (Chris Gascoyne) tells his wife Carla Connor (Alison King) about his affair with Tina McIntyre (Michelle Keegan) in the backroom. She storms into the pub, shouting that she wants to \"kill\" Tina. When Tina is later attacked and dies, Carla becomes the prime suspect.", "In 2015, Liz McDonald's (Beverley Callard) boyfriend Tony Stewart (Terence Maynard) grows tired of her and plots with secret lover Tracy Barlow (Kate Ford) to take the pub from the McDonalds. Tony falsely tells Steve McDonald (Simon Gregson) that he needs back the money that he lent him, forcing Steve to sell his 50% of The Rovers. Steve gets an offer from a pub chain called \"Travis Limited\" and accepts it, not knowing that Tony is the real buyer. After being successful in purchasing Steve's share of the pub, Tony sets in motion his mission to con Liz into selling her 50% to \"Travis Limited\" as well, persuading her that they should start afresh a little further away from Weatherfield. When she refuses, he arranges for two of his criminal friends to attack her in the bar. Tony manages to persuade Liz to sell up, promising a new life in Spain with her; however, Michelle Connor's (Kym Marsh) best friend, Carla Connor (Alison King), offers to buy Liz out of the pub. A furious Tony tries to persuade Liz to honour her deal with \"Travis Limited\" but Liz decides to sell her share to Carla after she promises to keep Steve and Michelle as the pub's licensees. In revenge on Carla for offering to buy The Rovers, Tracy sets the Victoria Court flats on fire with Carla and her own daughter, Amy Barlow (Elle Mulvaney), trapped inside. Both Carla and Amy survived the blaze; however, Kal Nazir (Jimi Mistry) and Maddie Heath (Amy James-Kelly) are both killed in an explosion during the fire. Before Carla can sign on the dotted line, Liz learns from a vengeful Tracy of Tony's plan to get the pub. Therefore, Liz still owns her half of the pub while Tony owns the other half."]}, {"page": "Leanne Battersby", "response": ["Leanne's storylines include numerous affairs, prostitution, drug abuse, insurance fraud, discovering her biological mother was Stella Price (Michelle Collins), a miscarriage, an abortion and a custody battle for Peter Barlow (Chris Gascoyne) son, Simon (Alex Bain). Leanne has had numerous relationships within the show. She married Nick Tilsley (Adam Rickitt/Ben Price) in 1998, but they divorced a year later. She later married Peter in the show's live 50th anniversary episode, but later split from him, after his affair with Carla Connor (Alison King) was exposed. After a volatile reconciliation, she and Nick married for the second time in January 2013, but in late January 2014, Nick decided it was best for them to be apart, as he was suffering from long-term brain damage. After a one-night stand, Leanne becomes pregnant with Steve McDonald's (Simon Gregson) baby and gives birth to a son, Oliver Battersby. In November 2020, Oliver dies from Mitochondrial disease.", "Leanne returns eight months later, secretly working as an escort. Her stepmother, Janice, is disgusted. When Leanne starts dating Liam Connor (Rob James-Collier), Janice insists she choose between a loving relationship and her new career. Leanne is shocked to find her new client is Liam's brother, Paul (Sean Gallagher) and he threatens to tell Liam so she threatens to tell his wife, Carla Connor (Alison King). Following the incident with Paul, Leanne chooses to buy a restaurant with Carla, who pulls out after learning that Leanne is an escort and met Paul once. Refusing to believe that they did not sleep together, Carla leaves Leanne £10,000 in debt and dumps Paul. An angry Paul kidnaps Leanne, putting her in the boot of his car before accidentally crashing into a truck. Leanne suffers minor injuries but Paul is killed. Carla tells Liam about Leanne's escorting so he ends their relationship. Leanne borrows £10,000 she needs from Janice's plumber boyfriend Roger Stiles (Andrew Dunn), and pays him back throughout the year.", "In November 2010, Carla Connor (Alison King) falls for Peter. Asked what is attracting Carla to Peter, king replied: \"In Peter she has found someone who understands what she is going through.\" After Peter becomes disabled, Gascoyne said that Peter will be unable to be a proper husband to Leanne. Leanne and Peter's wedding day is coming closer, and Leanne is still having an affair with Nick. Asked whether Leanne will stop the affair, Danson replied: \"She does love Peter. She feels safe and secure with him. They've created this family unit with Simon – and Leanne has the home life she craves. But when she's with Nick she gets a taste of the fast life and she’s the Leanne of old.\" After Carla calls her wedding off to Frank Foster (Andrew Lancel), Leanne cannot understand why Peter is being so protective of Carla. When asked to sum up Peter and Leanne's twelve months of marriage, Gascoyne said: \"It's been very rocky to say the least. There was the stuff with Nick, Peter was very ill and had to get back on his feet, and there was all the guilt of Ashley dying, so it started off badly and carried on badly. And Peter says he's forgiven Leanne for Nick, but in his heart, it still niggles him.\" Danson said: \"It's not been the best, has it! They had the blessing, where Peter found out about Nick, and then her mother turned up and they argued over that, then she got pregnant and had about half an episode of happiness, and then she lost her baby. And in the middle of all this, Carla's been hovering in the wings...\" It was announced in September 2010 that Peter's father, Ken, will catch Leanne in bed with Nick. An insider commented: \"Leanne is wracked with guilt over the affair,\" a source told the paper. \"She loves Peter, she loves his son Simon and they've been through a lot together - but Nick was her first love and she never got over that.\" It was later revealed that Peter will find out from his sister Tracy Barlow (Kate Ford) that Leanne is sleeping with Nick. Danson has said that Leanne's actions has changed her views on cheating."]}, {"page": "Janice Battersby", "response": ["In January 2010, Trevor Dean, a local dustman, provokes Janice by refusing to empty her rubbish bin. In protest, she jumps onto the side of his bin lorry and holds on as he drives down the street. Later, the pair become friends, and after telling Trevor she is looking for a lodger, he agrees to move in with her. Janice is very attracted to him but he starts dating her boss, Carla Connor (Alison King). Janice is disappointed when Trevor later leaves Weatherfield after breaking up with Carla."]}, {"page": "Eileen Grimshaw", "response": ["In July 2010, builder Owen Armstrong (Ian Puleston-Davies) catches Eileen's eye and she is delighted when they date a few times and does some admin work at the builder's yard. However, Owen is more interested in Eileen's friend, Liz McDonald (Beverley Callard) and he starts dating her behind Eileen's back. Eileen is disgusted when she discovers that Owen and Liz are an item and plots revenge on Owen for the way he used her. In January 2011, Eileen discovers that her roof has been damaged after the tram crash and asks Owen to have a look. He tells her that the tiles are damaged and there is water damage in the interior walls, costing about £3,000 to fix. Eileen gets an insurance inspector to have a look but Jason thinks he is spying on his girlfriend, Rosie Webster (Helen Flanagan), and punches him so the inspector refuses to help Eileen; who steals a cheque for £10,000 that Carla Connor (Alison King) has left for Owen and cashes it. Owen finds out and offers to have a look at the house and tells Eileen that he knows she has taken his money and she will pay for it. Upset, she tells Julie what has happened and they devise a plan to break into the builder's yard to get documents that prove that Owen has been committing tax evasion for years. The sisters successfully blackmail Owen with this so he agrees to fix the roof. Several weeks later, Owen gets revenge for Eileen's blackmail by letting himself into her house and retrieving the paperwork Eileen stole after she tells Sunita Alahan about his dodgy business practices. He destroys the evidence and calls the police, reporting Eileen for the cheque she stole and she is arrested for fraud. Eileen admits her guilt and, as it is her first offence and she returned the money, she is released with a caution."]}, {"page": "Sean Tully", "response": ["Sean becomes close friends with Tom Kerrigan (Philip McGinley), a business partner of his boss, Carla Connor (Alison King) and begins to develop feelings for him. When Sean tries to kiss Tom, he tells him that he is straight and actually interested in Sean's friend Kelly. Realising things are awkward between Sean and Tom, Marcus questions Sean, who lies and says Tom made a pass at him rather than the other way around. Marcus angrily punches Tom but is furious to then discover Sean was the one in the wrong. With Sean having already been jealous of Marcus's friendships with other gay men, Marcus realises there is no trust left in their relationship and departs for London."]}, {"page": "Weatherfield", "response": ["Underworld is the underwear factory situated on Coronation Street, which has employed many residents of Weatherfield. The company was founded by Mike Baldwin (Johnny Briggs) as Baldwins Casuals but was later owned by Carla Connor (Alison King). After Mike died, his son's Danny Baldwin (Bradley Walsh) and Adam Barlow (Sam Robertson) sell their shares to Paul (Sean Gallagher) and Liam Connor (Rob James-Collier). After Paul's death, his wife, Carla, inherits his 60% share in the factory. Carla's new husband Tony Gordon (Gray O'Brien) purchases Liam's shares shortly before he dies but, after Tony is imprisoned for Liam's murder, Carla buys his shares. Nick Tilsley (Ben Price) purchases them in early 2010, then sells his 40% share back to Carla when the pair do not get along. In 2011, Frank Foster (Andrew Lancel) buys Nick's former share from Carla.", "In mid-2010 after the siege which saw the factory burn down, Nick Tilsley (Ben Price) sees an opportunity to use it as temporary factory, but he does so under the name Nick's Knicks meaning it had nothing to do with Carla Connor (Alison King) or Underworld. After the closure of the temporary factory, Nick rents the space again from owner George and re-opens The Joinery in late 2010, employing ex-kebab shop worker Cheryl Gray (Holly Quin-Ankrah) as barmaid and Ciaran McCarthy (Keith Duffy) as chef, with ex-wife Leanne as manager to allow her to live her dream. However, Nick and Leanne grow close and embark on an affair. In December Ken Barlow (William Roache) walks in on them in the office looking for Peter and is disgusted with Leanne. The Joinery is destroyed following a gas explosion causing the tram to crash onto Coronation Street in front of the bar, which kills Ashley Peacock (Steven Arnold) and nearly kills Peter. In 2011 Nick renovates and re-opens it as The Bistro, again employing Cheryl, along with his mother Gail (Helen Worth) as cleaner. Becky McDonald (Katherine Kelly) briefly works there after her split from husband Steve (Simon Gregson). Believing that his wife Kylie Platt (Paula Lane) needed to rest due to her pregnancy, David Platt (Jack P. Shepherd) takes over her evening shifts. The Bistro loses two employees in Spring 2014 as Gloria Price (Sue Johnston) and Stella Price (Michelle Collins) both leave Weatherfield. As Leanne splits with Nick, he renames it Just Nick's.", "On 4 September 2011, a drunken Carla Connor (Alison King) crashes her car into the front of the bookies, also running over Stella Price (Michelle Collins) who is left critically ill following the accident. In April 2013, Leanne sells her share behind Peter's back to Carla. Carla employs her brother, Rob Donovan (Marc Baylis), as a development consultant to bring Barlow's Bookies into the 21st century. When Rob is fired, he puts a bet down against Peter, which Peter cannot afford to pay. Rob wins, leading Peter to give him and Rob's girlfriend and Peter's stepsister, Tracy Barlow (Kate Ford), the bookies rent free for six months. They change it into a pawnbroker and Tracy calls it Barlow's Buys. Peter continues to rent the shop to Rob and Tracy, and the couple are annoyed when Peter increases their rent.", "Valandro's is an Italian restaurant. It was previously used as a secondary setting to restaurants such as The Clock, until bought by Carla Connor (Alison King) and Leanne Battersby (Jane Danson) in May 2007. After the unexpected death of Paul Connor (Sean Gallagher), however, Carla pulls out of the transaction, leaving Leanne to fund the cost of buying the business herself. She uses money earned from being an escort, combined with a £10,000 loan from Roger Stiles (Andrew Dunn). Amidst a plethora of financial trouble and staffing problems, in July 2007 Leanne hires Paul Clayton (Tom Hudson) to work at the restaurant as head chef. Paul later takes out a loan in his grandfather Jack Duckworth's (Bill Tarmey) name and buys a share of the restaurant. The business was failing so, in 2008 Leanne convinces Paul to set fire to the restaurant to claim the insurance,"]}, {"page": "Amy Barlow", "response": ["In May 2015, Amy, along with Carla Connor (Alison King), becomes trapped in a fire in the Victoria Court flats after it was accidentally started by Tracy. Carla is rescued while Leanne and her partner, Kal Nazir (Jimi Mistry) enter the flat to save Amy, but Kal, Leanne and Amy all become trapped when the roof caves in, blocking the door. Luckily, the fire brigade arrive and manage to get Leanne and Amy out of the flat, but an explosion happens, killing Kal. However, Amy does not seem to take Kal's death seriously and feels happier that she was rescued from the fire. In July 2015, Amy is upset to learn that Deirdre died just before she was due to return to Weatherfield. Simon and Amy are both left money by Deirdre in her will. In September 2015, Amy starts at Weatherfield High School and she also decides to take up violin lessons. In November 2015, Simon moves in with the Barlows because he has been physically abusing his adoptive mother, Leanne Battersby (Jane Danson). Amy annoys Simon with her violin, he tries to take the violin from Amy, however Ken catches them arguing and they come up with a solution. Simon and Amy are left alone at the Barlow house and Simon ends up hurting Amy. Amy tells Ken and Tracy, who contact Leanne, who is encouraged by her half-sister Eva Price (Catherine Tyldesley) to admit Simon has been hurting her. Leanne has to take Simon home and the family agree to get Simon help.", "During the May 2015 episodes, which saw a fire started by Tracy at the Victoria Court flats, Amy was one of the characters trapped in the fire. Duncan Lindsay for the Metro said of Amy's performance in these episodes \"The performances from Corrie acting titans such as Kate Ford [Tracy], Alison King [Carla] and Jane Danson [Leanne] always add to the drama, and young Elle Mulvaney, who plays Amy, is surely now a contender for next year's Young Performance prize at the British Soap Awards.\" For her portrayal as Amy, Mulvaney has been longlisted 3 times in 2010, 2011 and 2012 at the Inside Soap Awards for Best Young Actor. "]}, {"page": "Fiz Brown", "response": ["In January 2014, Fiz is devastated when she learns from Anna Windass (Debbie Rush) that Hayley has died. Fiz is unaware, however, that Hayley committed suicide after drinking a lethal cocktail. She and Tyrone rush over to the café flat, where Fiz finds Hayley's corpse on the bed with Roy's arm around her. Chesney later arrives, and he, Fiz, Tyrone, Anna and Carla Connor (Alison King) all try to help Roy through his grief. A few days later, Roy is struggling to come to terms with Hayley's death, but Fiz learns that Hayley killed herself, and angrily confronts Roy and shouts at him. Anna tries to get through to Fiz that it is what Hayley wanted and that it was not assisted suicide, but Fiz only listens to Carla. On the day of Hayley's funeral, Fiz, Carla, and Anna try and persuade Roy to attend, as he is refusing. He eventually attends, but in the middle of Fiz's eulogy, Roy stands up and interrupts her speech. He tells the upset residents that Hayley was the love of his life and that he will miss her dearly, which relieves Fiz, Carla, and Anna, as they all thought he was going to tell them about Hayley's suicide. Following the funeral, Roy leaves Fiz and Anna a note explaining that he has gone to visit his mother Sylvia Goodwin (Stephanie Cole) for a while. The pair start to panic, however, when a pipe bursts at the café and realize that Roy has been away for 10 days. They call Sylvia, but her sister Jean answers the phone and explains that she hasn't heard from Roy is six months and that Sylvia is in Tenerife. Fiz calls the police, and they explain Roy's situation, without revealing Hayley's suicide. When the police leave, Fiz and Anna have many arguments about his whereabouts, as Tyrone tries to calm the bickering women down. When they get home, Fiz reveals to a stunned Tyrone that she believes that Roy is dead. In mid-February, Roy returns with no explanation of his whereabouts. He later explains that he has been stopping in a hotel by a steam museum. Fiz is later concerned when Roy doesn't come out of his flat, and that he keeps making continuous trips to the toy shop. It is revealed that he is building a model railway track, which puzzles Fiz, but fascinates Tyrone and Chesney."]}, {"page": "Alison King", "response": ["Alison King was born at the Leicester Royal Infirmary. She is the youngest of three daughters and a son born to Alex and June King, who were both nurses at the hospital. She was raised in the family home first in Ratby Lane, Markfield, Leicestershire where she went to Markfield Mercenfeld Primary School and was taught by Tracey Lee, mother of Sammy Lee, and Gillian Sykes, then in Kirby Muxloe. She attended South Charnwood High School, where she first took an interest in acting. She continued to act while attending Groby Community College, where a teacher would offer drama and dance classes to students in their free time. King was raised as a Christadelphian and attended the Christadelphian Church at Westleigh, Leicester, where she was baptised as a teenager. At the age of 18, King moved to Newquay, Cornwall, where she worked at Fat Willys Surf Shack. She surfed in her spare time, and spent four years as a dental nurse. When she was 22, she enrolled at the North Cheshire Theatre School. While at drama school, she underwent cosmetic surgery at a London dental practice to improve her smile, stating her teeth had been ruined by sucking her thumb as a child, and later had more surgery in 2015. During her time there she got her first television role, playing Helen, a hair salon crimper, in two episodes of Brookside. Before the conclusion of her three-year diploma, she was cast in the major role of Lynda Block in Sky One's, Dream Team.Staff (15 February 2007). \"You can't imagine how nerve-wracking it was – filming in the Rovers\", Leicester Mercury (archived at AccessMyLibrary). Retrieved 20 December 2008.\"Alison King CV \", Creative Artist Management. Retrieved 20 December 2008.", "In 2006, she was cast as Carla Connor in the ITV soap opera, Coronation Street. She made her first appearance in the role in the episode broadcast on 1 December 2006. She had previously appeared in the soap in 2004 as an unrelated character named Mrs. Fanshaw. Her one-episode role was part of a larger storyline to \"sex up\" Ryan Thomas's character, builder Jason Grimshaw.Green, Kris (16 February 2004). \"Soap bosses 'sex up' Jason Grimshaw\", Digital Spy. Retrieved 20 December 2008. She went on maternity leave in 2009. King's role in the soap involved high-profile storylines. In 2010, she was involved in the death of Tony Gordon storyline, in which she had to be kidnapped in the Underworld factory.Alison King (Carla Connor, Corrie) – Coronation Street Interview – Soaps. Digital Spy (25 May 2010). In 2011, King's character was raped by her boyfriend, Frank Foster. This storyline had a massive public impact and saw a high rise in reported rapes across the United Kingdom. King spoke of how there was an 800% increase in calls to support organisations after the storyline had aired, and that people had contacted her about their real-life experiences, some of whom she has kept in communication with. Her performance in the rape storyline led to a Best Actress award at the 2012 British Soap Awards."]}, {"page": "Nick Tilsley", "response": ["Nick's storylines have included his adolescent problems and his role in the fraught relationship between his parents, his teenage marriage to Leanne Battersby (Jane Danson) and their divorce, and his engagement to Maria Connor (Samia Smith). Since his return in 2009 his storylines have featured him remarrying and once again divorcing Leanne, his one-night stand with David's wife Kylie Platt (Paula Lane), suffering brain damage after being involved in a lorry crash which was caused by David, and his business partnership with and later one-day marriage to Carla Connor (Alison King). In late-May 2017, after a trip to the seaside with his enemies Peter Barlow (Chris Gascoyne) and Steve McDonald (Simon Gregson), he became trapped in quicksand. Since his return in 2018 his storylines have included: stealing £80,000 from grandmother Audrey, reuniting with ex-wife Leanne, going into business with Carla, opening a barber shop called A Trim Up North with brother David, using stolen money and discovering that he has a son with his ex-girlfriend Natasha Blakeman (Rachel Leskovac).", "On Christmas Day 2009, Nick (now played by Ben Price) returns to Weatherfield. He becomes interested in buying a share of Underworld but Carla Connor (Alison King) declines his offer. He briefly meets Leanne, who has told Carla not to trust Nick but she accepts and he becomes a partner. Nick ends his partnership with Carla a few months later and decides to open a bar/restaurant, calling it The Joinery. Leanne, although disgusted initially, agrees to become manager. It is clear that Nick still has strong feelings for Leanne. Although Leanne is dating Peter Barlow (Chris Gascoyne), Nick is still in love with her and asks her to leave Peter, but despite sharing a kiss, she refuses. Eventually, Nick succeeds in seducing Leanne and they have an affair. After Leanne ends it, Nick pretends to be Peter's friend to annoy Leanne and threatens to tell Peter about their affair. In December 2010, when Peter is critically injured in a gas explosion that destroys The Joinery and the subsequent tram crash, he and Leanne marry in hospital. When Peter learns of the affair in February 2011, he forgives Leanne. In February 2012, Leanne eventually ends her marriage to Peter after his affair with Carla and reconciles with Nick in June 2012."]}, {"page": "Help (British TV series)", "response": ["Strong, the diffident therapist, has an obsession with his receptionist Rebecca (played by Alison King) and also has regular appointments with his own therapist (who is also played by Whitehouse), the only times when the scene leaves Peter's office. Other performers are Mark Williams and Olivia Colman in cameos as patients, Alison Senior as a patient's wife, and Langham's real-life daughter Emily as a patient's precocious daughter. Two of the most frequent patients are Gary (the only role Whitehouse plays with no make-up), who initially uses his therapy sessions to escape from his wife; and Monty, an elderly Jewish taxi-driver whose wife is suffering from Alzheimer's disease. Others include an Eastern European father, a magician and a TV presenter."]}, {"page": "Kirk Sutherland", "response": ["Kirk decides to move out of No. 5, as he feels he is in the way of Fiz's life. He packs his bags and leaves, only to turn up next door at Maria's. A few weeks later, he decides to pack and move in with Tyrone and Molly (Vicky Binns). He then moves out and back into Maria's when she goes to stay in Ireland with the baby at Liam's parent's house after Tony Gordon (Gray O'Brien) admits to having Liam killed. Kirk applies for a job at Underworld as a machinist but ultimately loses out to Izzy Armstrong (Cherylee Houston). However, owner Carla Connor (Alison King) offers him a job as a delivery driver. Kirk soon forms a strong friendship with Izzy, and as a result, his feelings for her grow stronger. When Gary Windass (Mikey North) is arrested for assaulting a lad who was hassling Izzy, Kirk makes a false statement to the police that it was him who committed the crime. As a result, Gary's military career is not put in jeopardy and this is a relief to Izzy, who has started to harbour feelings for Gary, much to Kirk's dismay. The charges against Kirk are dropped to a lack of sufficient evidence, and he is a free man."]}, {"page": "The British Soap Awards", "response": ["| \"Sexiest Female\"Presented by McFly|| Michelle Keegan (Tina McIntyre in Coronation Street) || Alison King (Carla Connor in Coronation Street)Rita Simons (Roxy Mitchell in EastEnders)Jennifer Metcalfe (Mercedes McQueen in Hollyoaks)", "| \"Best Actress\" || Alison King (Carla Connor in Coronation Street) || Jo Joyner (Tanya Jessop in EastEnders)Nina Wadia (Zainab Masood in EastEnders)Karen Hassan (Lynsey Nolan in Hollyoaks)", "| \"Best Dramatic Performance\"Presented by Jerry Hall|| Jo Joyner (Tanya Jessop in EastEnders) || Alison King (Carla Connor in Coronation Street)Owen Brenman (Heston Carter in Doctors)Jeff Hordley (Cain Dingle in Emmerdale)", "| \"Best Actress\"Presented by Phil Davis|| Kellie Bright (Linda Carter in EastEnders) || Alison King (Carla Connor in Coronation Street)Laurie Brett (Jane Beale in EastEnders)Natalie Anderson (Alicia Metcalfe in Emmerdale)Nikki Sanderson (Maxine Minniver in Hollyoaks)", "| \"Best Actress\"Presented by Patrick Baladi|| Lacey Turner (Stacey Fowler in EastEnders) || Alison King (Carla Connor in Coronation Street)Rakhee Thakrar (Shabnam Masood in EastEnders)Lucy Pargeter (Chas Dingle in Emmerdale)Jennifer Metcalfe (Mercedes McQueen in Hollyoaks)", "| \"Best Actress\"Presented by Ioan Gruffudd||Lucy Pargeter (Chas Dingle in Emmerdale) ||Alison King (Carla Connor in Coronation Street)Lorraine Stanley (Karen Taylor in EastEnders)Stephanie Davis (Sinead Shelby in Hollyoaks)Lauren McQueen (Lily McQueen in Hollyoaks)"]}, {"page": "Kelly Crabtree", "response": ["Kelly later gets another job working for Carla Connor (Alison King). She falls for Liam Connor (Rob James-Collier), Carla's brother-in-law, and is outraged when she discovers that he is seeing her best mate, Joanne Jackson (Zaraah Abrahams). As revenge, she gets Joanne sacked, but is shocked to discover that arch enemy Becky is Joanne's replacement."]}, {"page": "Peter Barlow (Coronation Street)", "response": ["Peter's storylines have included a number of affairs, alcoholism and a custody battle involving his son Simon Barlow (Alex Bain). Peter became involved in a bigamy storyline when he married Rovers barmaid Shelley Unwin (Sally Lindsay) and florist Lucy Richards (Katy Carmichael). Having been discovered, Peter was left alone and fled Weatherfield. He returned briefly in 2007 when his adoptive sister Tracy Barlow (Kate Ford) was sentenced to life imprisonment for the murder of Charlie Stubbs (Bill Ward). He returned for good in 2008 with five-year-old Simon, whom he had by Lucy; who had since died from breast cancer. Peter began a relationship with Leanne Battersby (Jane Danson) and they married during the 50th anniversary episode; however, they separated after Peter's affair with Carla Connor (Alison King) was discovered. Peter later went on to marry Carla, and then had an affair with much younger Tina McIntyre (Michelle Keegan). Peter was framed for Tina's murder by Rob Donovan (Marc Baylis) and upon his release from prison, his marriage to Carla broke down and he left Weatherfield.", "Lucy dies from ovarian cancer and Peter is given custody of five-year-old Simon (now played by Alex Bain). Due to his business in Portsmouth failing, Peter brings Simon back to Weatherfield, seeking Ken and Deirdre's help but Ken suspects, correctly, that Peter plans to leave Simon with him. Peter changes his mind when he learns that Lucy had left her estate to him, providing that he used it for Simon's benefit. He buys the local bookmakers and renames it \"Barlow's Bookies\". Peter begins a relationship with Leanne Battersby (Jane Danson). Peter and Leanne decide to open a bar, but Ken is hesitant about the venture because of Peter's alcoholism. On the opening night of the bar, Peter falls off the wagon and gets drunk and is forced to go to rehab. Peter and Leanne get engaged, but Peter feels threatened by the return of Leanne's ex-husband, Nick Tilsley (Ben Price), until Leanne convinces him that Nick is just a friend. Nick decides to open the bar and offers Leanne a job as bar manager. Feeling guilty for ruining her previous venture, Peter persuades her to take the job and starts mentoring Leanne's friend, Carla Connor (Alison King), when he realises that she also has a drink problem. Carla begins to lean on Peter emotionally for support and she later attempts to seduce him. Peter then tells Carla that he cannot see her any more.", "In September 2010, it was reported that Carla Connor (Alison King) would fall for Peter. These events happened on screen in November 2010. It was reported that the pair apparently grow closer as Peter helps Carla overcome her boozing and comes to her aid when she is arrested for drink driving. A source said: \"Carla is feeling vulnerable and Peter is there,\" a source told the paper. \"They soon become more than friends. He's stunned when she tells him she hasn't felt like this about anyone since Liam.\" Asked what is attracting Carla to Peter, King replied: \"In Peter she has found someone who understands what she is going through.\" Carla's best friend Leanne (Jane Danson) who is in a relationship with Peter would tell Carla that she is in love with her ex-husband Nick Tilsley (Ben Price), \"This storyline will really put the cat among the pigeons,\" the source added.", "Alison King later told Inside Soap that she wants Carla's friendship with Peter to develop even further as he helps her to battle an alcohol addiction. King said: \"I think she should definitely get her claws into Peter. They've got a nice friendship and some good banter going on. They're equals, and I think it's the first time Carla's felt that way with someone since Liam died. They could be a great coupling – but it would turn into a nightmare if they both fell off the wagon.\"", "It was announced in September 2013 that Peter would begin an affair with Tina McIntyre (Michelle Keegan) following his marriage to Carla Connor (Alison King), and will go on until her exit in the summer of 2014. Producer Stuart Blackburn told Inside Soap: \"Tina's had a hideous old year with the surrogacy drama and losing Tommy – but she's no saint. She's capable of making mistakes and falling in love with the wrong person. She'll start a feud with Tracy and Rob, before falling into Peter's arms. Unfortunately for Tina, she'll find herself in a place where both Tracy and Carla have reasons to hate her!\" Speaking about the story, Gascoyne told TV Times: \"Peter is really lustful for Tina. I think he almost sees a younger Carla in her. He found it really exciting when she put up a fight against Tracy. He admired her spirit and started to see her in a different light. Peter adores Carla, but he feels a bit neglected. He even tells Tina that, despite everything Carla has done for him, he's still not happy. Peter knows it's not a good idea to be around Tina, but he really doesn't want to stop seeing her.\" Gascoyne added: \"Put it this way, Peter Barlow and a wedding is bound to spell disaster. It certainly won't be dull. Whatever happens, it will be brilliant. Peter's had a good go at weddings – this will be his fifth. That tells you something.\" Michelle Keegan revealed that Tina's fling with Peter could be her most passionate relationship yet. Speaking to TV Times about the story, Keegan explained: \"Peter had never been on Tina's radar, but suddenly she feels completely out of control. She's never felt like this about anyone before. She didn't really have a passionate relationship with Tommy, but she can see herself having one with Peter.\" She continued: \"Tina is troubled by her feelings because she really likes Carla and she's not the sort of girl to do that to another woman. It's hard because she finds herself weakening whenever Peter is around. It gets to a point where Tina tells Peter that it might be best if she stops looking after Simon because she feels so out of control around him.\" As the story progresses, Tina begins to hope that Peter will not go through with his wedding to Carla. Keegan added: \"If he does, I'm not sure Tina will enjoy sticking around to watch the marriage unfold. The thought of being 'the other woman' pains her.\""]}, {"page": "Sarah Platt", "response": ["The show planned a dramatic stunt which would lead to the discovery of Callum's corpse. The scene featured Carla Connor (Alison King) causing a car accident, colliding with Tyrone Dobbs' (Alan Halsall) truck which crashes into the Platts' home. This causes the floor to give way and a recovery team unearthing Callum's body. Producers decided to conclude the story without Kylie being held accountable for the murder. Instead they used a character that had been recently killed off, Tony Stewart (Terence Maynard), who had publicly feuded with Callum. When Sarah confesses the truth to Todd, he decides to frame Tony for the crime – a scheme which proved successful."]}, {"page": "Michelle Connor", "response": ["Michelle's storylines have included a romantic relationship with Steve McDonald (Simon Gregson) during which he had an affair with  Becky Granger (Katherine Kelly); discovering that her son Ryan (Ben Thompson) was not her own and had been swapped at birth with Alex Neeson (Dario Coates/James Burrows); the death of her eldest brother Paul (Sean Gallagher) in 2007; and the murder of her other brother Liam (Rob James-Collier) in 2008. Other storylines have focused on the relationships with her sisters-in-law, Carla (Alison King) and Maria (Samia Ghadie) and her cousin-in-law Rob Donovan (Marc Baylis); her failed engagement to Ciaran McCarthy (Keith Duffy); surviving a minibus crash caused by Steve; becoming pregnant with Steve's baby and delivering their stillborn son, Ruairi, before learning that Steve has also impregnated Leanne Battersby (Jane Danson); a relationship with Robert Preston (Tristan Gemmill); being kidnapped and stalked by her ex-boyfriend Will Chatterton (Leon Ockenden); getting shot by Pat Phelan (Connor McIntyre) on the day of her wedding to Robert and being terrorised by Ronan Truman (Alan McKenna). History later repeated itself when Robert impregnated Vicky Jefferies (Kerri Quinn) behind Michelle's back.", "When Paul's wife, Carla Connor (Alison King) hints that Paul and Liam have a secret, she confronts them. Paul denies it but Liam admits that Paul actually drove on the night Ryan's father died, not him. She lashes out violently at Paul and Liam for hiding Paul's crime and struggles to forgive them but does keep the truth from Ryan. After having a brief fling with Steve, Michelle begins dating Sonny Dhillon (Pal Aron) but ends it after discovering he is bisexual and having an affair with Sean Tully (Antony Cotton). Devastated, Michelle ends her friendship with Sean."]}]}}