{"wiki_id": "http://www.wikidata.org/entity/Q3739850", "itemLabel": "Abi Titmuss", "itemDescription": "English actress, television personality, poker player, and former glamour model", "wikipedia_url": "https://en.wikipedia.org/wiki/Abi_Titmuss", "wikipedia_page": {"main": "Abigail Evelyn Titmuss (born 8 February 1976) is an English actress, television personality and poker player. She is also a former glamour model and nurse.", "link_mentions": [{"page": "Lincolnshire", "response": ["* Abi Titmuss (born 1976), poker player and glamour model"]}, {"page": "Sleaford", "response": ["The royalist poet Thomas Shipman was educated at Carre's Grammar School, as was novelist Henry Jackson;G. Goodwin \"Jackson, Henry (1831–1879)\" rev. M.A. Stephan Oxford Dictionary of National Biography 2004.  Joseph Smedley, the actor and comedian, built the theatre in 1824, before settling in the town in 1842, establishing a printing business and dying in North Street;C. M. P. Taylor \"Smedley, Joseph (1784–1863)\" Oxford Dictionary of National Biography 2004.  and Charles Haslewood Shannon, the artist, was born in the town.\"Charles de Sousy Ricketts (1866–1931) & Charles Haslewood Shannon (1863–1937)\" The FitzWilliam Museum. Retrieved 13 January 2015. The actress and comedian Jennifer Saunders was born in Sleaford.B. Whitney \"Jennifer Saunders\" Encyclopædia Britannica 2015. In popular culture, the singer Lois Wilkinson of the Caravelles was born in the town;Larkin (ed.) \"Caravelles\" Encyclopedia of Popular Music.  glamour model Abi Titmuss grew up in Ruskington and was educated at Kesteven and Sleaford High School;\"Famous Yellowbelly – Abi Titmus\" BBC. Last updated 5 October 2009. Retrieved 1 December 2014. and Bernie Taupin, Elton John's lyricist, was born in the town.Larkin (ed.) \"Taupin Bernie\" Encyclopedia of Popular Music.  Eric Thompson who narrated The Magic Roundabout television series, was born in a house on Jermyn Street.A. McGown \"Thompson, Eric Norman (1929–1982)\" Oxford Dictionary of National Biography 2004 (online ed. September 2005).  In sport, the professional footballer Mark Wallington who played for Leicester City, Derby County and Lincoln City, grew up in Sleaford and, after retiring, taught Physical Education at St George's Academy.\"Mark Wallington (born 1952): Professional Footballer\" Lincolnshire Echo 6 March 2009. Retrieved 2 February 2015."]}, {"page": "John Leslie (TV presenter)", "response": ["Leslie had a widely publicised relationship with nurse Abi Titmuss, who became a star in her own right when a video Leslie filmed of her having sex with another woman was leaked."]}, {"page": "Brainiac: Science Abuse", "response": ["* Abi Titmuss"]}, {"page": "Celebrity sex tape", "response": ["*John Leslie, former presenter of British television shows Blue Peter and This Morning, made a home video of himself receiving oral sex from his nurse girlfriend Abi Titmuss in 2000. He also filmed Titmuss performing and receiving oral sex with another woman."]}, {"page": "Linda Lusardi", "response": ["In January 2008, Lusardi joined ITV's Dancing on Ice, finishing in sixth place. Her professional skating partner was Daniel Whiston, who temporarily moved into her family home to make training more convenient. Lusardi had to catch up with her fellow skaters after falling and breaking a bone in her foot during her first hour on the ice. She also won the Channel 4 show Celebrity Come Dine With Me in 2008. In the show, she was voted the best dinner host by her fellow contestants Abi Titmuss, Rodney Marsh, Lesley Joseph and Paul Ross. Lusardi participated in the 2011 series of Celebrity Masterchef, where she reached the final five. In December 2020 she took part in The Real Full Monty On Ice for charity."]}, {"page": "Titmuss", "response": ["*Abi Titmuss (born 1976), English actress, television personality and poker player"]}, {"page": "Abigail Titmuss", "response": ["#REDIRECT Abi Titmuss"]}, {"page": "The Sunday Night Project", "response": ["The Friday Night Project was originally presented by comics Jimmy Carr, Rob Rouse, Sharon Horgan and, as a roving reporter, Lucy Montgomery, with sporadic appearances from Abi Titmuss. The first series began on 4 February 2005 and ran for 8 weeks.", "| Abi Titmuss and Paul Rawson", "===\"The Abi Titmuss Mystery Sex Tape Test\"===", "In series 1, every week model Abi Titmuss, who famously had a sex tape in 2004, would appear in a sex tape scenario, e.g. in a hotel room, with a mystery celebrity. Glimpses of the celebrity secret lover would appear, and viewers texted to guess his or her identity, from three name options, to win £1,000."]}, {"page": "Stella Vine", "response": ["In July 2005, Vine made a painting of the No. 30 London bus which had been destroyed by a suicide bomber in Tavistock Square, outside her Bloomsbury flat during the 7 July 2005 London bombings. Vine painted over the artwork almost as soon as she had made it, as she found the work \"simply too disturbing\". Vine documented the bus painting before she re-painted over it, but refuses to show the photographs publicly during her lifetime. She described it as stunning and moving but \"extremely harrowing to paint because there were bodies on the bus.\" The canvas now shows the model Abi Titmuss wearing bleeding red shoes."]}, {"page": "Rodney Marsh", "response": ["Since then Marsh attempted to rebuild his career with appearances on reality television. He appeared in the 2007 series of ITV's I'm a Celebrity...Get Me Out of Here! where he was the fifth person to be voted off the show; Celebrity Come Dine with Me on Channel 4 in January 2009, in which he came in joint second place tied with Abi Titmuss; the first series of Celebrity Coach Trip on Channel 4 in November 2010, where he was partnered with Cheryl Baker; other notable appearances include Sing If You Can and Cash in the Attic. He is currently cohost of Grumpy Pundits on Sirius Radio."]}, {"page": "Abi Titmus", "response": ["#REDIRECT Abi Titmuss"]}, {"page": "1976 in British television", "response": ["* 8 February — Abi Titmuss, television presenter and model"]}, {"page": "Richard & Judy", "response": ["In January 2006, MP and Celebrity Big Brother contestant George Galloway entered the competition and won his housemates' weekly shopping budget. Lionel Blair, Abi Titmuss and Carol Vorderman also participated in \"You Say We Pay\" whilst they were guests on the programme."]}, {"page": "Morley College", "response": ["*Abi Titmuss"]}, {"page": "Andrew Agnew (actor)", "response": ["Andrew appeared in the Christmas Pantomime Sleeping Beauty at Swansea's Grand Theatre between December 2009 and January 2010 starring alongside Malandra Burrows and Helen Fraser. before reprise the role in Basingstoke with Wendy Craig and Abi Titmuss.  He has also appeared twice in New Brighton in Aladdin with Dean Sullivan & Kelsey-Beth Crossley and reprised the role of Wishee alongside Bill Ward in 2018/19 season, this time also as Director."]}, {"page": "Hotel Babylon (BBC series)", "response": ["* Abi Titmuss"]}, {"page": "Abby Titmuss", "response": ["#REDIRECT Abi Titmuss"]}, {"page": "Abbey Titmuss", "response": ["#REDIRECT Abi Titmuss"]}, {"page": "Abbey Titmus", "response": ["#REDIRECT Abi Titmuss"]}, {"page": "Abby Titmus", "response": ["#REDIRECT Abi Titmuss"]}, {"page": "Love Island (2005 TV series)", "response": ["|Abi Titmuss", "In a negative review of the first series for The Guardian, Charlie Brooker writes that the show is \"just a rehash of I'm A Celebrity, minus the elements that made that show successful\". Brooker criticises that the show \"openly sneers\" at Abi Titmuss' weight, calls Paul Danan a \"bell end of considerable magnitude\", jokes that the Fran Cosgrave is so little well known that \"he doesn't actually exist outside shows like this\" and insults the presenting of Patrick Kielty and Kelly Brook, described respectively as \"a man you wish would shut up before he even starts speaking, and a woman who can scarcely talk in the first place\"."]}, {"page": "Hell's Kitchen (British TV series)", "response": ["| Abi Titmuss || Television personality ||style=\"background-color:red\"| Red Team (Day 1-8) ||style=\"background-color:white\"| White Team (Day 9) || Eliminated Day 9"]}, {"page": "Rob Brydon's Annually Retentive", "response": ["| Rhys Thomas, Abi Titmuss"]}, {"page": "1976 in the United Kingdom", "response": ["* 8 February – Abi Titmuss, television presenter and model"]}, {"page": "Heckington", "response": ["* Abi Titmuss\"One-off BBC Casualty role for former High School girl Abi\", Sleaford Standard, 23 February 2012. Retrieved 28 June 2013"]}]}}