{"wiki_id": "http://www.wikidata.org/entity/Q373545", "itemLabel": "Herbie Roberts", "itemDescription": "English footballer (1905-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbie_Roberts", "wikipedia_page": {"main": "Herbert Roberts (19 February 1905 – 19 June 1944) was an English footballer.", "link_mentions": [{"page": "Oswestry", "response": ["* Herbie Roberts (1905 in Oswestry – 1944) footballer,  Arsenal.com, historic players, Herbie Roberts retrieved 17 March 2018 297 club caps for Arsenal F.C."]}, {"page": "Herbert Chapman", "response": ["The same year, Arsenal became embroiled in a scandal; footballers' pay at the time was limited by a maximum wage, but an FA inquiry found that Charlie Buchan had secretly received illegal payments from Arsenal as an incentive to sign for the club.Spurling, p. 46 Sir Henry Norris was indicted for his part and banned from football, but Chapman escaped punishment, and with the autocratic Norris replaced by the more benign Samuel Hill-Wood, Chapman's power and influence within the club increased, allowing him control over all aspects of the club's business. He persevered in building the team, strengthening his attacking lineup with the signings of David Jack in 1928, and Alex James and Cliff Bastin in 1929. As at his previous clubs, Chapman worked on improving the defence, notably through the signings of Herbie Roberts and Eddie Hapgood at centre half and left back respectively.Soar & Tyler, p. 50", "Chapman's tactics of fast-moving play meant the wing half line of John and Jones were now pushed in to cover central midfield, pivoting around the halfway line so that they could drop back to defend when necessary. Chapman was equally committed to a strong defence, saying that maintenance of a back line was \"the rock bottom of football\".Soar & Tyler, pp. 15–17 Arsenal's defence were told to play deep and, with the support of the wing halves, fall back into their own penalty area when the opposition had the ball; this allowed the opposition plenty of possession in Arsenal's half, until they reached the 18-yard line and faced a massed defence.Say, p. 76 Once Arsenal regained the ball – usually through the centre half Herbie Roberts – the ball would be quickly passed forward and the wing halves would push up to support the attackers, meaning Arsenal could quickly commit as many as seven men forward as a unit to rapidly attack and try to score."]}, {"page": "Bernard Joy", "response": ["Joy continued to play for Arsenal, mainly deputising for the Gunners' established centre-half Herbie Roberts. Roberts suffered a broken leg in October 1937 and Joy took his place in the side for the remainder of the 1937-38 season, winning a First Division winners' medal, and then, with Roberts having retired from the game, on through the 1938-39 season (earning a 1938 Charity Shield winners' medal in the process)."]}, {"page": "History of Arsenal F.C. (1886–1966)", "response": ["Arsenal came second in Chapman's first season, their best finish at that time, but this proved to be a false dawn; for the next few seasons they stayed in mid-table as Chapman took his time to  assemble his side, slotting new signings such as winger Joe Hulme, forward Jack Lambert and defenders Tom Parker and Herbie Roberts into his new formation. In 1926–27, Arsenal reached their first FA Cup final, only to lose 1–0 to Cardiff City, after Arsenal's goalkeeper Dan Lewis let a harmless-looking shot slip through his arms and into the net; it was the only occasion in history that the FA Cup has been won by a club from outside England.", "Arsenal's dominance of the decade was sealed with a second FA Cup in 1935–36, winning 1–0 against Sheffield United with a goal from Drake. Arsenal faded in the League somewhat after the 1934–35 title, and were weakened by the retirement of Alex James and the club's inability to replace him, as well as long-term injuries to several other key players such as Herbie Roberts and Joe Hulme. Nevertheless, they won a fifth League title in 1937–38, pipping Wolves on the final day of the season, to cap off a highly successful decade.", "Nine Arsenal players died in the Second World War; William Parr, Harry Cook, Herbie Roberts, Cyril Tooze, Bobby Daniel, Hugh Glass, Bill Dean, Sidney Pugh, and Leslie Lack."]}, {"page": "1932 FA Cup Final", "response": ["| ||5|| Herbie Roberts  "]}, {"page": "1936 FA Cup Final", "response": ["| ||HB || Herbie Roberts"]}, {"page": "Herbert Roberts", "response": ["* Herbie Roberts (1905–1944), English footballer"]}, {"page": "Bill Seddon", "response": ["However, in 1929–30 he was reintroduced into the Arsenal side, alternating with Baker at right half, until centre half Herbie Roberts was injured against West Ham United. Seddon moved into defence and not only played the last twelve games of that season, but started the 1930 FA Cup Final, in which Arsenal beat Huddersfield Town 2–0 to win their first major trophy. He played in Arsenal's 2–1 victory over Sheffield Wednesday in the Charity Shield at Stamford Bridge in October 1930."]}, {"page": "Alf Haynes", "response": ["Unable to oust the first-choice half backs of Frank Hill, Herbie Roberts and Bob John, Haynes was sold to Crystal Palace in November 1933, and played there for three seasons, retiring in 1936. He made 48 league appearances for Palace (51 in total) scoring once."]}, {"page": "Index of World War II articles (H)", "response": ["# Herbie Roberts"]}, {"page": "List of footballers killed during World War II", "response": ["* Herbie Roberts – onetime England international against Wales in 1931. Played for Arsenal (1926–1937). He died of erysipelas on 17 June 1944 aged 39, while on active duty as lieutenant with the Royal Fusiliers."]}, {"page": "1931 FA Charity Shield", "response": ["|HB || ||  Herbie Roberts"]}, {"page": "List of people with surname Roberts", "response": ["*Herbie Roberts, English (soccer) footballer"]}, {"page": "Southgate Cemetery", "response": ["* Herbie Roberts, professional footballer for Arsenal"]}]}}