{"wiki_id": "http://www.wikidata.org/entity/Q373057", "itemLabel": "Hallucinogen", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Hallucinogen_(musician)", "wikipedia_page": {"main": "Simon Posford (born 28 October 1971), better known by his stage name Hallucinogen is an English electronic musician, specializing in psychedelic trance music. His first studio album, Twisted, released in 1995, is considered one of the most influential albums in the genre. He has toured India several times.His second album, The Lone Deranger, was released in 1997. A third album, In Dub, was released in 2002.\nHe is also the founder of the label Twisted Records and works in the electronic groups Younger Brother and Shpongle. Younger Brother initially began as a side project of Posford and Benji Vaughan and represented a transition away from previous projects which emphasized a more synthesized style.Though his music has been self-described as \"heavily driven by psychedelica\", he always performs while sober due to the complexities of operating many computers and mixers during his events.His grandfather, George Posford, was a notable composer and producer in the United Kingdom in the 1930s.\n\n", "link_mentions": [{"page": "Rave", "response": ["* Goa trance / Psychedelic trance – Alien Project, Electric Universe, Hallucinogen, Infected Mushroom, Astral Projection"]}, {"page": "Psychedelic trance", "response": ["In 1993 the first 100% Goa trance album was released, Project II Trance, featuring tracks by Man With No Name and Hallucinogen to name two. Goa trance enjoyed its commercial peak between 1996 and 1997 with media attention and some recognized names in the DJ scene joining the movement. This hype did not last long and once the attention had died down so did the music sales, resulting in the failure of record labels, promotion networks and also some artists. This ‘commercial death of Goa trance’ was marked musically by Matsuri Productions in 1997 with the release of the compilation Let it RIP. On the back sleeve of the album at the bottom of the notes, R.I.P : Mother Theresa, Princess Diana, William Burroughs & Goa Trance was written."]}, {"page": "Simon Posford", "response": ["#REDIRECT Hallucinogen (musician)"]}, {"page": "Shpongle", "response": ["Shpongle is a psychedelic electronic music project from England that formed in 1996.  The group includes Simon Posford (a.k.a. Hallucinogen) and Raja Ram (one of three in The Infinity Project). The duo are considered to be one of the progenitors of the psybient genre - a genre combining world music with psychedelic trance and ambient. Their musical style combines traditional music from all over the globe and vocals with contemporary western synthesizer-based psychedelic music. When asked to describe Shpongle's music, Posford has responded that it is \"like nothing you've ever heard before.\"", "Shpongle has played several live concerts, and Simon Posford tours frequently, performing live DJ sets.  Raja Ram has occasionally accompanied these sets with live flute performances. Shpongle's first live performance was at the Solstice Music Festival at Motosu Highland in Japan in July 2001. They returned to Japan on New Year's Eve 2003 to play the New Maps of Hyperspace event at Tokyo Bay NK Hall together with 1200 Micrograms (featuring Raja Ram) and Hallucinogen.Archived at Ghostarchive and the Wayback Machine: ", "For 2012, Shpongle toured the United States performing DJ sets entitled \"Shpongle presents The Masquerade\". The last set of this tour was performed on 31 October 2012, at Terminal West in Atlanta, Georgia. On 3 November, they performed with Younger Brother, Hallucinogen, and other Twisted Records artists. Their set included live keyboards and flute, and debuted many new tracks from their most recent album."]}, {"page": "DNA Lounge", "response": ["* Hallucinogen (2001)"]}, {"page": "Turtles all the way down", "response": ["References to \"turtles all the way down\" have been made in a variety of modern contexts. For example, \"Turtles All the Way Down\" is the name of a song by country artist Sturgill Simpson that appears on his 2014 album Metamodern Sounds in Country Music. \"Gamma Goblins ('Its Turtles All The Way Down' Mix)\" is a remix by Ott for the 2002 Hallucinogen album In Dub. Turtles All the Way Down is also the title of a 2017 novel by John Green about a teenage girl with obsessive–compulsive disorder.Senior, Jennifer (October 10, 2017).  \"In John Green’s ‘Turtles All the Way Down,’ a Teenager’s Mind Is at War With Itself.\"  The New York Times.  Retrieved October 29, 2017."]}, {"page": "Quart Festival", "response": ["Ken Ishii, Nightmares on Wax, BT, Faithless, Lionrock, Moloko, Ash, Nicolette, Spring Heel Jack, Dog Eat Dog, Whipping Boy, Dirty Three, The Brotherhood, Morcheeba, Fun Lovin' Criminals, Hallucinogen, Super Furry Animals, Bis, Motorpsycho, Peltz, The Highrollers, Penthouse Playboys, Palace of Pleasure, Folk & Røvere, Gartnerlosjen, Turbonegro, Subgud, Kåre and the Cavemen, The 3rd and the Mortal, Alania, Tørst, Salida, Gluecifer, Mindstate, Red Cloud, Dryads, Silent, Ad Libitum, Groms, The Weeds, Cirkus Gilmour, Whipped Cream Royale."]}, {"page": "Soothsayer", "response": ["** \"Soothsayer\", a psychedelic music by Hallucinogen"]}, {"page": "The Lone Deranger", "response": ["The Lone Deranger is the second album by Hallucinogen released in 1997 on Twisted Records. The name of the album is word play on the Lone Ranger, a fictional cowboy and hero of several eponymous radio and television series.", "Category:Hallucinogen (musician) albums"]}, {"page": "Music of Goa", "response": ["Goa Trance (sometimes referred to as Goa or by the number 604) is a form of electronic music that developed around the same time as Trance music became popular in Europe. It originated during the late 1980s and early 1990s in the Indian state of Goa. Essentially, Trance music was pop culture's answer to the Goa Trance music scene on the beaches of Goa where the traveler's music scene has been famous since the time of the Beatles. Goa Trance enjoyed the greater part of its success from around 1994 -1998, and since then has dwindled significantly both in production and consumption, being replaced by its successor, Psychedelic Trance (also known as psytrance). Many of the original Goa Trance artists: Hallucinogen, Slinky Wizard, and Total Eclipse are still making music, but refer to their style of music simply as \"PSY\". TIP Records, Flying Rhino Records, Dragonfly Records, Transient Records, Phantasm Records, Symbiosis Records, Blue Room Released were all key players on the beach and in the scene."]}, {"page": "Younger Brother", "response": ["After making a remix for a charity record, Simon Posford (Shpongle, Hallucinogen) and Benji Vaughan (Prometheus) formed the band."]}, {"page": "Twisted (Hallucinogen album)", "response": ["Twisted is the debut studio album by Hallucinogen, released on 16 October 1995 on Dragonfly Records.", "The album reached Number 27 in the French album charts, and it is one of the most successful albums releases in the genre, with a total sales over 85,000 copies worldwide. In 1999, the album was re-released on Simon Posford's (Hallucinogen) own label, Twisted Records.", "Category:Hallucinogen (musician) albums"]}, {"page": "Celtic Cross (band)", "response": ["Celtic Cross was a musical collaboration of Simon Posford (Hallucinogen, Shpongle), Martin Glover (bassist from Killing Joke) and Saul Davies (violinist from James).  The style of music could be described as psychedelic rock, ambient and dub music with ethnic influences.  The cover of the Hicksville album was designed by Mark Neal, the same artist who worked on Posford's Twisted and The Lone Deranger, as well as the Shpongle albums."]}, {"page": "Glade Festival", "response": ["Glade Festival originated from the Glade arena started at Glastonbury  kicking off in its verdant surroundings with a huge line up of electronic artists including Aphex Twin, Squarepusher, Hallucinogen and Hybrid.", "The first UK festival to feature Psychedelic Trance and Breakbeat as main stages, and with headliners Squarepusher, Aphex Twin, Hallucinogen and Stanton Warriors, Glade sold out in its first year attracting over 6500 people. In 2005, the licence was extended to 9500 tickets, which sold out in 8 hours, making it the fastest selling festival in the UK that year. Glade was also the first UK festival to host a stage dedicated to dubstep and was responsible for bringing many now successful dance acts and DJs into the public eye.   By 2006, the event had sold out 14,500 tickets without even releasing the artists line up - a phenomenon unheard of outside of Glastonbury Festival.  The third Glade is widely regarded as the best UK electronic music festival of its era.", "* 2005: Hallucinogen, The Orb, Dreadzone, Squarepusher, AFX, Layo & Bushwacka!, and Sasha."]}, {"page": "Hallucinogen (band)", "response": ["#REDIRECT Hallucinogen (musician)"]}, {"page": "Ott (record producer)", "response": ["Ott (born  12 April 1968 in London, England) is a British record producer and musician who has worked with Sinéad O'Connor, Embrace, The Orb, and Brian Eno, and has achieved recognition since 2002 for his own psychedelic dub tracks and his collaborations with Simon Posford (Hallucinogen / Shpongle). He has released two albums on Twisted Records: Blumenkraft (2003), Skylon (2008) and two albums on Ottsonic: Mir (2011) and Fairchildren (2015).", "Since the early 2000s, Ott has produced, mixed and recorded music released on Twisted Records, including various collaborations with founder Simon Posford. His first major contribution to Twisted was the record Hallucinogen – In Dub, on which he remixed six classic Hallucinogen songs. In May 2003 he released his own album, Blumenkraft, on Twisted; it was reviewed by The Wire.review, The Wire. Excerpt via Google books. Retrieved 14 July 2011 His work has also been featured in releases from the record label Liquid Sound Design (now known as Liquid Sound, run by Martin Glover), especially those compilations produced by Humphrey Bacchus during his time at the label. He followed up his debut album in January 2008 with Skylon, followed by Mir in March 2011.", "* Hallucinogen – In Dub (Produced, programmed and mixed by Ott)", "* Hallucinogen in Dub Live"]}, {"page": "Shulman (band)", "response": ["*Hallucinogen"]}, {"page": "Twisted Records (UK)", "response": ["Twisted Records is a British record label that specialises in psychedelic trance music. The label was founded by musician Simon Posford, who performs and records under the name Hallucinogen."]}, {"page": "The Goa Mix", "response": ["The two-hour broadcast was split into two halves. These halves have been referred to as the \"Silver Mix\" and \"Gold Mix\" respectively, although they are not truly halves, with the \"Silver Mix\" lasting 54 minutes whilst the \"Gold Mix\" lasts 64 minutes. The Silver Mix begins with the \"eerie\" vocals of Mr. V's \"Give Me Life\", later described by Oakenfold as \"the traditional opening of a set that creates the mood, gives you the vibe, very atmospheric.\" It continues over the rhythm of Oakenfold's band Grace's \"Skin On Skin\", one of many tracks from Oakenfold's underground Perfecto label. With the third track, \"Point Zero\", Oakenfold would later state that \"what really appealed to [him] was the atmosphere and the atmospheric vibe\" and noted that when he came across it, he said it was \"perfect to put the headphones and get lost in the music, and that was key to [him] on the mix.\" From the conclusion of the \"frenetic, bleak piano\" of Virtual Symmetry's \"Vaporize\", released Sven Väth's Eye Q label, heralds the first of many soundtrack pieces on the album, including Vangelis' \"Blade Runner\" and an excerpt of replicant Roy Batty's lament of memories lost, \"Like Tears In Rain\". After Salt Tank's \"Eugina\", the mix shifts a gear with the iconic \"LSD\" by Hallucinogen, followed by a strings composition from the Dracula soundtrack, which segues into the Arabic-tinged \"Alcatraz\" by Electrotete. Concluding the first hour is a trio of works from Man With No Name: \"Floor Essence\", his remix of Scorpio Rising's \"Dubcatcher\", and \"Evolution\".", "#Hallucinogen (featuring Ben Kempton) – \"LSD\" – 5:52"]}, {"page": "Rainbow Serpent Festival", "response": ["2017 – Hallucinogen"]}, {"page": "Doof (musician)", "response": ["Doof's first official release was in 1993 with NovaMute, the dance label run by Mute Records, a three-track EP titled \"Disposable Hymns to the Infinite\". It was through Novamute label-mates Juno Reactor and Ben Watkins that Doof was first introduced to producer Youth (of Killing Joke/ Brilliant), Simon Posford, also known as Hallucinogen, and the Dragonfly Records label.", "Doof went on to release \"Double Dragons\" as a 12\" with Dragonfly in 1994, and to produce a series of tracks in partnership with Simon Posford, including \"Let's Turn On\", \"Born Again\" and \"Angelic Particles\". It was through his friendship with Simon Posford that Doof was introduced to Raja Ram (Shpongle/The Infinity Project/Quintessence) who later that year would start the highly influential trance label T.I.P Records. Doof's \"Let's Turn On\" (co-produced with Simon Posford) became the second ever T.I.P 12\" release. This was followed in 1995 by another 12\" for T.I.P (Angelina/Weird Karma), the Born Again EP on Matsuri and another 12\" for Dragonfly (\"Youth of the Galaxy\"). 1995 also saw numerous Doof remixes, including tracks by Hallucinogen and The Infinity Project."]}, {"page": "In Dub", "response": ["In Dub is a psychedelic dub album released in October 2002. It is a collection of Hallucinogen tracks remixed by the record producer Ott.", "Category:Hallucinogen (musician) albums"]}, {"page": "Hicksville (album)", "response": ["#*Featuring Chester, half of the duo \"Baba G\" with Hallucinogen"]}, {"page": "List of trance genres", "response": ["|1200 Micrograms, Infected Mushroom, GMS, Son Kite, Skazi, Hallucinogen, Astrix, Avalon, Vini Vici"]}, {"page": "Life Festival", "response": ["* 2008 (4–6 July): Finley Quay, Hallucinogen, Cold Cut, Dj Marky, Skream, Mala, Jape, Max Romeo."]}, {"page": "Hallucinogen", "response": ["Leo Hollister's five criteria for establishing that a drug is [classically] hallucinogenic were as follows:Glennon RA. Classical drugs: an introductory overview. In Lin GC and Glennon RA (eds). Hallucinogens: an update . National Institute on Drug Abuse: Rockville, MD, 1994.", "Hallucinogens can be classified by their subjective effects, mechanisms of action or chemical structure. These classifications often correlate to some extent.", "Typical or classical deliriants are those which block the muscarinic acetylcholine receptors (antagonism). These are said to be anticholinergic. Many of these compounds are produced naturally by plant genera belonging to the nightshade family Solanaceae, such as Datura, Brugmansia and Latua in the New World and Atropa, Hyoscyamus and Mandragora in the Old World.Schultes, Richard Evans; Hofmann, Albert (1979). The Botany and Chemistry of Hallucinogens (2nd ed.). Springfield Illinois: Charles C. Thomas.", "Emboden, William, Narcotic Plants – Hallucinogens, stimulants, inebriants, and hypnotics, their origins and uses 2nd edition, revised and enlarged, pub. Macmillan Publishing Co., Inc., New York 1979, . These tropane alkaloids are poisonous and can cause death due to tachycardia-induced heart failure and hyperthermia even in small doses. Additionally, over-the-counter antihistamines such as diphenhydramine (brand name Benadryl) and dimenhydrinate (brand name Dramamine) also have an anticholinergic effect.", "Hallucinogenic substances are among the oldest drugs used by human kind, as hallucinogenic substances naturally occur in mushrooms, cacti and a variety of other plants. Numerous cultures worldwide have endorsed the use of hallucinogens in medicine, religion and recreation, to varying extents, while some cultures have regulated or outright prohibited their use. In most developed countries today, the possession of many hallucinogens, even those found commonly in nature, is considered a crime punishable by fines, imprisonment or even death. In some countries, such as the United States and the Netherlands, partial deference may be granted to traditional religious use by members of Indigenous ethnic minorities such as the Native American Church and the Santo Daime Church. Recently the União do Vegetal, a Christian-based religious sect whose composition is not primarily ethnicity-based, won a United States Supreme Court decision authorizing its use of ayahuasca. However, in Brazil, ayahuasca use in a religious context has been legal since 1987. In fact, it is a common belief among members of the União do Vegetal that ayahuasca presents no risk for adolescents within the church, as long as they take it within a religious context.", "=== Hallucinogens after World War II ===", "After World War II there was an explosion of interest in hallucinogenic drugs in psychiatry, owing mainly to the invention of LSD. Interest in the drugs tended to focus on either the potential for psychotherapeutic applications of the drugs (see psychedelic psychotherapy), or on the use of hallucinogens to produce a \"controlled psychosis\", in order to understand psychotic disorders such as schizophrenia. By 1951, more than 100 articles on LSD had appeared in medical journals, and by 1961, the number had increased to more than 1000 articles. Hallucinogens were also researched in several countries for their potential as agents of chemical warfare. Most famously, several incidents associated with the CIA's MK-ULTRA mind control research project have been the topic of media attention and lawsuits.", "Starting in the mid-20th century, psychedelic drugs has been the object of extensive attention in the Western world. They have been and are being explored as potential therapeutic agents in treating depression, posttraumatic stress disorder, obsessive–compulsive disorder, alcoholism,Bogenschutz, M.P. (2013). Studying the Effects of Classic Hallucinogens in the Treatment of Alcoholism: Rationale, Methodology, and Current Research with Psilocybin. Curr Drug Abuse Rev. Jun 18;6(1):17–29.DOI: 10.2174/15733998113099990002  drug addiction,Vargas-Perez, H & Doblin, R. (2013) Editorial: The Potential of Psychedelics as a Preventative and Auxiliary Therapy for Drug Abuse Curr Drug Abuse Rev. Jun 18;6(1):1–2 Thomas G, Lucas P, Capler NR, Tupper KW, Martin G. (2013) Ayahuasca-assisted therapy for addiction: results from a preliminary observational study in Canada. Curr Drug Abuse Rev. Jun 18;6(1):30–42. Brown, T.K. (2013) Ibogaine in the Treatment of Substance Dependence. Curr Drug Abuse Rev. Jun 18;6(1):3–16. DOI: 10.2174/15672050113109990001  cluster headaches, and other ailments. Early military research focused on their use as incapacitating agents. Intelligence agencies tested these drugs in the hope that they would provide an effective means of interrogation, with little success.", "LSD, mescaline, psilocybin, and PCP are drugs that cause hallucinations, which can alter a person's perception of reality. LSD, mescaline, and psilocybin cause their effects by initially disrupting the interaction of nerve cells and the neurotransmitter serotonin.\"DrugFacts: Hallucinogens – LSD, mescaline, Psilocybin, and PCP.\" Drugabuse.gov. National Institute on Drug Abuse, n.d. Web. 13 April 2014. <http://www.drugabuse.gov/publications/drugfacts/hallucinogens-lsd-mescaline-psilocybin-pcp>. It is distributed throughout the brain and spinal cord, where the serotonin system is involved with controlling of the behavioral, perceptual, and regulatory systems. This also includes mood, hunger, body temperature, sexual behavior, muscle control, and sensory perception. Certain hallucinogens, such as PCP, act through a glutamate receptor in the brain which is important for perception of pain, responses to the environment, and learning and memory.", "*Hallucinogenic plants in Chinese herbals", "* Charles S. Grob, ed.: Hallucinogens, a reader", "* Winkelman, Michael J., and Thomas B. Roberts (editors) (2007).Psychedelic Medicine: New Evidence for Hallucinogens as Treatments 2 Volumes. Westport, CT: Praeger/Greenwood."]}, {"page": "The Mystery of the Yeti", "response": ["The Mystery of the Yeti is a Goa trance concept album conceived and arranged by Ron Rothfield (a.k.a. Raja Ram). It was collaboratively produced by Raja Ram and Graham Wood of The Infinity Project; Stéphane Holweck, Loïc Van Poucke, and Serge Souque (the founding members of Total Eclipse); and Simon Posford (aka Hallucinogen)."]}, {"page": "SWIV 3D", "response": ["SCi attempted to license some tracks by Hallucinogen for the soundtrack, but due to a difficulty with getting royalties cleared, they were not able to secure the license in time for the game's release."]}]}}