{"wiki_id": "http://www.wikidata.org/entity/Q3742364", "itemLabel": "Femi Taylor", "itemDescription": "Nigerian-Born British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Femi_Taylor", "wikipedia_page": {"main": "Femi Taylor (born April 8, 1961) is a Nigerian-born British dancer and actress best known for portraying Jabba the Hutt's Twi'lek slave dancer Oola in the 1983 motion picture Return of the Jedi.", "link_mentions": [{"page": "Return of the Jedi", "response": ["Denis Lawson reprises his role as Wedge Antilles, an X-wing pilot in the Rebellion, from the previous two films. Kenneth Colley and Jeremy Bulloch reprise their roles from The Empire Strikes Back as Admiral Piett, the commander of Darth Vader's flagship, the Executor, and bounty hunter Boba Fett, respectively. Michael Pennington portrays Moff Jerjerrod, the commander of the second Death Star. Warwick Davis appears as Wicket W. Warrick, an Ewok who befriends Leia and leads her and her friends to the Ewok tribe. Baker was originally cast as Wicket, but was replaced by Davis after falling ill with food poisoning on the morning of the shoot. Davis had no previous acting experience and was cast only after his grandmother had discovered an open call for dwarfs for the new Star Wars film. Caroline Blakiston portrays Mon Mothma, a co-founder and leader of the Rebel Alliance. Michael Carter plays Jabba the Hutt's aide, Bib Fortuna (voiced by Erik Bauersfeld), while Femi Taylor and Claire Davenport appear as Jabba's original slave dancers."]}, {"page": "1997 in film", "response": ["| Return of the Jedi (Special Edition) || 20th Century Fox / Lucasfilm || Richard Marquand (director); Lawrence Kasdan, George Lucas (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, James Earl Jones, Ian McDiarmid, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Sebastian Shaw, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Jack Purvis, Mike Edmonds, Jane Busby, Nicki Reade, Debbie Lee Carrington, Sadie Corre, Tony Cox, Phil Fondacaro, Ben Burtt, Richard Marquand, Mike Quinn, Deep Roy, Phil Tippett, Larry Ward, Robert Watts || Sci-Fi, Fantasy || Live action"]}, {"page": "1983 in film", "response": ["| Return of the Jedi || 20th Century Fox / Lucasfilm || Richard Marquand (director); Lawrence Kasdan, George Lucas (screenplay); Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, James Earl Jones, Ian McDiarmid, Kenny Baker, Peter Mayhew, Frank Oz, Alec Guinness, Sebastian Shaw, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Jack Purvis, Mike Edmonds, Jane Busby, Nicki Reade, Debbie Carrington, Sadie Corre, Tony Cox, Phil Fondacaro, Ben Burtt, Richard Marquand, Mike Quinn, Deep Roy, Phil Tippett, Larry Ward, Robert Watts || Sci-Fi, Fantasy || Live action "]}, {"page": "1980 in film", "response": ["| The Apple || The Cannon Group / NF Geria II / Filmgesellschaft mbH || Menahem Golan (director/screenplay); Catherine Mary Stewart, Allan Love, Grace Kennedy, George Gilmour, Joss Ackland, Vladek Sheybal, Ray Shell, Miriam Margoyles, Derek Deadman, George S. Clinton, Finola Hughes, Femi Taylor, John Chester, Michael Logan, Francesca Poston, Leslie Meadows, Gunter Notthoff, Clem Davies, Coby Recht, Iris Recht || Sci-Fi, Musical, Comedy || Live action "]}, {"page": "Cats (musical)", "response": ["| style=\"text-align:center;\" | Femi Taylor", "* 1998 film: Femi Taylor as Exotica; Tony Timberlake as Asparagus (chorus cat)", "* Bombalurina: Femi Taylor (1984–1985), Janie Dee (1990), Donna King (1992), Heather Douglas (1999)", "The first Australian production ran from July 1985 to August 1987 at the Theatre Royal in Sydney. The original cast included Debra Byrne as Grizabella, John Wood as Old Deuteronomy, Marina Prior as Jellylorum, Jeff Phillips as Rum Tum Tugger, David Atkins as Mistoffelees, and Anita Louise Combe as Sillabub. The Sydney production cost $3 million to mount and grossed a record $28 million. It was credited with revitalising the then-stagnant musical genre in Australia. After closing in Sydney, an additional $1.8 million was spent transferring the production to Melbourne, including $725,000 to refurbish the old Her Majesty's Theatre. The Melbourne run played from October 1987 to December 1988, with an opening night cast that included Megan Williams as Grizabella, Wood as Old Deuteronomy, Phillips as Rum Tum Tugger, Linda Hartley-Clark as Demeter, Femi Taylor as Bombalurina, Rachael Beck as Rumpleteazer and Seán Martin Hingston as Plato/Macavity. From 1989 to 1990, the company toured the Festival Theatre in Adelaide, His Majesty's Theatre in Perth, Civic Theatre in Newcastle, Lyric Theatre in Brisbane, and the Aotea Centre in Auckland. This was followed by a second national tour from 1993 to 1996,"]}, {"page": "List of Star Wars characters", "response": ["| Femi Taylor (Return of the Jedi)"]}, {"page": "List of sibling pairs", "response": ["* Benedict and Femi Taylor (adopted); actors"]}, {"page": "Changes in Star Wars re-releases", "response": ["In the theatrical release of the film, Oola's death is filmed from outside the rancor pit: she falls into the pit, and her scream is heard from off-screen. In the 1997 edition, extra shots were inserted depicting her in the pit, including shots where she looks up to the crowd, the pit door being raised, and a shot of her terror. The rancor and Oola as she screams remain off-screen. Femi Taylor, who played Oola, impressed critics with her ability to reprise the role over a decade later without visible difference. Wired notes that \"they put a different eyeshadow color on her, so she's not exactly seamless.\" James Whitbrook at io9 praised the additions to the scene, writing that it teased the rancor well while still keeping the monster a surprise for Luke's later battle with it. Conversely, Den of Geek UK criticized the additions as unnecessary and felt that they made the audience familiar with the pit, weakening Luke's scene."]}, {"page": "The Apple (1980 film)", "response": ["* Finola Hughes, Femi Taylor, and John Chester in their film debuts as dancers"]}, {"page": "Cats (1998 film)", "response": ["*Exotica: A dark, sleek brown and cream female, similar to Cassandra in appearance. She was a character created specially for Femi Taylor, who had been part of the original London cast as Tantomile."]}, {"page": "List of Star Wars cast members", "response": ["| Femi Taylor"]}, {"page": "London Film and Comic Con", "response": ["| 11–13 July 2014|| Earls Court 2|| Stan Lee, Carrie Fisher, Ian McDiarmid, John Hurt, Summer Glau, Milo Ventimiglia, Michael Madsen, Jenna Coleman, Jemma Redgrave, Paul McGann, Colin Baker, David Yost, Paul Schrier, Jason Narvy, George A. Romero, Michael Biehn, Dave Prowse, Lena Heady, Anthony Head, Juliet Landau, Terry Farrell, Helen Slater, Billy Dee Williams, Corey Dee Williams, Jamie Bamber, Edward James Olmos, Sibel Kekilli, Ellie Kendrick, Isaac Hempstead Wright, Gethin Anthony, Finn Jones, Jeff East, Stephanie Leonidas, Daniel Portman, Sarah Louise Madison, Kenny Baker, TJ Thyne, Jason Mewes, Jeremy Bulloch, Michael Ensign, Wendy Glenn, Bernard Cribbins, Al Snow, Garrick Hagon, David Wenham, Adam Brown, Tracey Eddon, David Collings, Dominic Keating, Belinda Mayne, Vincent Ward, Dean Mitchell, Femi Taylor, Tim Dry, Jeremy Borash, David Hewlett, Robert Knepper, William Russell, Mickie James, Daniel Kash, Curtis Armstrong, Ken Marshall, John Simpkin, Paul Freeman, Tom Chadbon, Paul Springer, Andy Herd, Jerome Blake, Gary Kurtz, Will Tudor, Peter Miles, Andrew Cartmel, Guy Siner, Kate Dickie, Jon Davey, Anneke Wills, Sarah Parish, Tyler Mane, Phil Herbert, Jose Pablo Cantillo, Sean Crawford, Robert Emms, Adjoa Andoh, Cowboy James Storm, Stephen J. Forrest-Smith, Robert Hays, Bambos Georgiou, Jane McNeill, Ian Beattie, Aiden Cook, Cerina Vincent, Kristian Nairn, Slavitza Jovan, Glenn Morshower, Rupert Vansittart, Dicken Ashworth, Trevor Martin, Philip Grieve, Casper Van Dien, Dina Meyer"]}, {"page": "Femi", "response": ["* Femi Taylor, British dancer and actress"]}, {"page": "List of Star Wars film actors", "response": ["| Femi Taylor"]}, {"page": "For the Love of Sci-Fi", "response": ["| 4–6 December 2015 || Bowlers Exhibition Centre, Manchester || Dave Prowse, Garrick Hagon, Toby Philpott, Michael Carter, Simon Williamson, Femi Taylor, Alan Ruscoe, Pam Rose, John Simpkin, Michael Henbury, Barrie Holland, Anthony Forrest, Chris Bunn, Laurie Goode, Nick Joseph, Chris Muncke, Peter Roy, Alan Flyng, Paul Markham, Ted Western, Stephanie English, Brian Muir, Shaun Harrison"]}]}}