{"wiki_id": "http://www.wikidata.org/entity/Q3741992", "itemLabel": "John Sloboda", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sloboda", "wikipedia_page": {"main": "John Anthony Sloboda OBE FBA (born 13 June 1950) is Research Professor at the Guildhall School of Music and Drama where he currently leads research on the Social Impact of Making Music. He is also one of the founders of the Iraq Body Count project.", "link_mentions": [{"page": "Iraq Body Count project", "response": ["The project uses reports from English-language news media (including Arabic media translated into English), NGO-based reports, and official records that have been released into the public sphere to compile a running total. On its database page the IBC states: \"Gaps in recording and reporting suggest that even our highest totals to date may be missing many civilian deaths from violence.\" The group is staffed by volunteers consisting mainly of academics and activists based in the UK and the US. The project was founded by John Sloboda and Hamit Dardagan.", "In October 2010, the group WikiLeaks released the Iraq War Logs, a set of nearly 400,000 classified US military documents on the Iraq war. IBC was among several media organizations and NGO's given pre-release access to the documents, and IBC co-founder John Sloboda delivered a speech at the press conference for the release by WikiLeaks.\"WikiLeaks Iraq War Logs press conference\" 23 October 2010.", "In April 2006, IBC published a lengthy response to their critics entitled \"Speculation is no substitute: a defence of Iraq Body Count\".Iraq Body Count. April 2006. \"Speculation is no substitute: a defence of Iraq Body Count\". By Hamit Dardagan, John Sloboda & Josh Dougherty. A rebuttal to the critiques by Stephen Soldz, Dahr Jamail, and others. In their reply, IBC argues that their critics have several key facts wrong. IBC argues that while their estimate is likely to be below the full toll, their critics' errors have led the critics to exaggerate the likely extent of such an undercount. Finally, IBC argues, the available evidence does not support their critics' claims of a pro-US bias infecting the IBC database.", "In a 28 April 2006 BBC Newsnight interview\"Interview transcript - John Sloboda\". BBC Newsnight. 28 April 2006. the IBC project's co-founder John Sloboda, in response to these and similar arguments, has said: \"we have never had over the entire three years, anyone show us an Arabic source that reports deaths that we haven't already got. In three years. In thousands of incidents. There are organisations that translate Arabic reports into English, and we see their data.\""]}, {"page": "Rosemary Brown (spiritualist)", "response": ["Professor of psychology John Sloboda wrote that Brown's music offers \"the most convincing case of unconscious composition on a large scale.\"Brown, Matthew. (2012). Debussy Redux: The Impact of His Music on Popular Culture. Indiana University Press. pp. 36–37. "]}, {"page": "Media Lens", "response": ["Media Lens is admired by John Pilger, who has called the website \"remarkable\" and described the writers as \"the cyber guardians of honest journalism\". Other journalists, in particular Peter Oborne, have also made positive comments about the group, although it has come into conflict with other journalists. The Observers foreign editor Peter Beaumont asserted that the group ran a \"campaign\" against John Sloboda and the Iraq Body Count for underestimating the number of deaths in Iraq. See also  George Monbiot wrote that Media Lens was \"belittling the acts of genocide\" in their defence of Edward S. Herman, who had questioned the  number of deaths in the Srebrenica massacre.", "The Iraq Body Count project (IBC) was set up by John Sloboda as an attempt to record civilian deaths resulting from the US-led 2003 invasion of Iraq. Project volunteers examined news stories for reports of civilian casualties. Each incident reported by at least by two independent news sources was included in a database. As at the middle of 2006, the IBC study estimated between 38,725 and 43,140 civilian deaths arising from the 2003 invasion.", "In June 2006, Peter Beaumont, foreign affairs editor for The Observer newspaper, accused the Media Lens editors' of a \"campaign apparently designed to silence\" John Sloboda and the Iraq Body Count project, because it produced a victim count lower than The Lancet study."]}, {"page": "Cognitive Constraints on Compositional Systems", "response": ["* Lerdahl, Fred (1988). \"Cognitive Constraints on Compositional Systems.\" In Generative Processes in Music: The Psychology of Performance, Improvisation, and Composition, ed. John Sloboda, 231–259. Oxford: Oxford University Press. Reprinted in Contemporary Music Review 6/2 (1992), pp. 97–121. (text)"]}, {"page": "Beyond Terror", "response": ["Beyond Terror: The Truth About the Real Threats to Our World is a book by Chris Abbott, Paul Rogers and John Sloboda of Oxford Research Group, a UK-based think tank. It is a 120-page paperback published by the Rider imprint of Random House in April 2007."]}, {"page": "Oxford Research Group", "response": ["* Prof John Sloboda (co-founder of Iraq Body Count)"]}]}}