{"wiki_id": "http://www.wikidata.org/entity/Q374834", "itemLabel": "H. L. A. Hart", "itemDescription": "English legal philosopher (1907–1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/H._L._A._Hart", "wikipedia_page": {"main": "Herbert Lionel Adolphus Hart  (18 July 1907 – 19 December 1992), usually cited as H. L. A. Hart, was an English legal philosopher, and a major figure in political and legal philosophy. He was Professor of Jurisprudence at Oxford University and the Principal of Brasenose College, Oxford. His most famous work is The Concept of Law (1961; 3rd edition, 2012), which has been hailed as \"the most important work of legal philosophy written in the twentieth century\". He is considered one of the world's foremost legal philosophers in the twentieth century, alongside Hans Kelsen.", "link_mentions": [{"page": "Mary Robinson", "response": ["She attended Mount Anville Secondary School in Dublin and studied law at Trinity College Dublin (where she was elected a scholar in 1965, the same year as David Norris) graduating in 1967 with first class honours. An outspoken critic of some Catholic church teachings, she delivered her inaugural address as the auditor of the Dublin University Law Society in 1967 in which she advocated removing the prohibition of divorce in the Irish Constitution, eliminating the ban on the use of contraceptives, and decriminalising homosexuality and suicide. The invited respondents to her address, Professor of Jurisprudence at Oxford H. L. A. Hart and retired Supreme Court judge T. C. Kingsmill Moore, positively received her arguments. She furthered her studies at the King's Inns and was awarded a fellowship to attend Harvard Law School, receiving an LL.M in 1968. She was called to the Irish Bar in 1967 and while still in her twenties was appointed Reid Professor of Law in the college. A subsequent holder of that title was her successor as Irish President, Mary McAleese. She became a member of the Bar of England and Wales in 1973 and a senior counsel in Ireland in 1980."]}, {"page": "Philosophy of law", "response": ["*Legal positivism, which is the view that law depends primarily on social facts. Legal positivism has traditionally been associated with three doctrines: the pedigree thesis, the separability thesis, and the discretion thesis. The pedigree thesis says that the right way to determine whether a directive is law is to look at the directive's source. The thesis claims that it is the fact that the directive was issued by the proper official within a legitimate government, for example, that determines the directive's legal validity—not the directive's moral or practical merits. The separability thesis states that law is conceptually distinct from morality. While law might contain morality, the separability thesis states that \"it is in no sense a necessary truth that laws reproduce or satisfy certain demands of morality, though in fact they have often done so.\" Legal positivists disagree about the extent of the separability thesis. Exclusive legal positivists, notably Joseph Raz, go further than the standard thesis and deny that it is possible for morality to be a part of law at all. The discretion thesis states that judges create new law when they are given discretion to adjudicate cases where existing law underdetermines the result. The earliest proponent of legal positivism was John Austin who was influenced by the writings of Jeremy Bentham in the early 19th century. Austin held that the law is the command of the sovereign backed by the threat of punishment. Contemporary legal positivism has long abandoned this view. In the twentieth century, two positivists had a profound influence on the field: Hans Kelsen and H. L. A. Hart. Kelsen is most influential for his notion of 'grundnorm,' an ultimate and basic legal norm, which some scholars, especially in Europe, accept today. In the Anglophone world, Hart has been the most influential scholar. Hart rejected the earlier claim that sanctions are essential to law and instead argued that law is  rule-based. According to Hart, law is a system of primary rules that guide the conduct of law's subjects, and secondary rules that regulate how the primary rules may be changed, identified, and adjudicated. Hart's theory, although widely admired, sparked vigorous debate among late twentieth century philosophers of law including Ronald Dworkin, John Rawls, Joseph Raz, and John Finnis.", "*H. L. A. Hart", "* H. L. A. Hart, The Concept of Law (Oxford: Oxford University Press, 1961).", "* H. L. A. Hart, Punishment and Responsibility (Oxford: Oxford University Press, 1968)."]}, {"page": "University of Oxford", "response": ["The list of noted legal scholars includes H. L. A. Hart, Ronald Dworkin, Andrew Burrows, Sir Guenter Treitel, Jeremy Waldron, A. V. Dicey, William Blackstone, John Gardner, Robert A. Gorman, Timothy Endicott, Peter Birks, John Finnis, Andrew Ashworth, Joseph Raz, Paul Craig, Leslie Green, Tony Honoré, Neil MacCormick and Hugh Collins. Other distinguished practitioners who have attended Oxford include Lord Pannick Qc, Geoffrey Robertson QC, Amal Clooney, Lord Faulks QC, and Dinah Rose QC."]}, {"page": "Jeremy Bentham", "response": ["Bentham defined as the \"fundamental axiom\" of his philosophy the principle that \"it is the greatest happiness of the greatest number that is the measure of right and wrong.\"Bentham, Jeremy. A Comment on the Commentaries and a Fragment on Government, edited by J. H. Burns and H. L. A. Hart. London: The Athlone Press. 1977. p. 393. He became a leading theorist in Anglo-American philosophy of law, and a political radical whose ideas influenced the development of welfarism. He advocated individual and economic freedoms, the separation of church and state, freedom of expression, equal rights for women, the right to divorce, and (in an unpublished essay) the decriminalising of homosexual acts. He called for the abolition of slavery, capital punishment and physical punishment, including that of children. He has also become known as an early advocate of animal rights. Though strongly in favour of the extension of individual legal rights, he opposed the idea of natural law and natural rights (both of which are considered \"divine\" or \"God-given\" in origin), calling them \"nonsense upon stilts.\" Bentham was also a sharp critic of legal fictions."]}, {"page": "John Rawls", "response": ["Rawls received his Ph.D. from Princeton in 1950 after completing a doctoral dissertation titled A Study in the Grounds of Ethical Knowledge: Considered with Reference to Judgments on the Moral Worth of Character. Rawls taught there until 1952 when he received a Fulbright Fellowship to Oxford University (Christ Church), where he was influenced by the liberal political theorist and historian Isaiah Berlin and the legal theorist H. L. A. Hart. After returning to the United States he served first as an assistant and then associate professor at Cornell University. In 1962, he became a full professor of philosophy at Cornell, and soon achieved a tenured position at MIT. That same year, he moved to Harvard University, where he taught for almost forty years and where he trained some of the leading contemporary figures in moral and political philosophy, including Sibyl-A-Schwarzenbach, Thomas Nagel, Allan Gibbard, Onora O'Neill, Adrian Piper, Arnold Davidson, Elizabeth S. Anderson, Christine Korsgaard, Susan Neiman, Claudia Card, Rainer Forst, Thomas Pogge, T. M. Scanlon, Barbara Herman, Joshua Cohen, Thomas E. Hill Jr., Gurcharan Das, Andreas Teuber, Samuel Freeman and Paul Weithman. He held the James Bryant Conant University Professorship at Harvard."]}, {"page": "All Souls College, Oxford", "response": ["* H. L. A. Hart (1929, 1930), philosopher"]}, {"page": "Sari Nusseibeh", "response": ["Following the firing of Scud missiles at Tel Aviv, Nusseibeh worked with Israeli Peace Now on a common approach to condemn the killing of civilians in the war. But he was arrested and placed under administrative detention on 29 January 1991, effectively accused of being an Iraqi agent.. The arrest was then questioned by British and American officials, and the U.S. administration urged that he should either be charged or else the suspicion would be that the arrest was political. He was adopted as a prisoner of conscience by Amnesty International.. and letters of protest were written to The Times by academics including Peter Strawson, Isaiah Berlin and H. L. A. Hart.. Some Israelis said the move  was designed to discredit Nusseibeh before international opinion. Palestinians saw the arrest as a political warning that Israel did not intend to negotiate with any Palestinian leader, no matter how moderate. For example, Saeb Erekat of An-Najah University said: \"This is a message to us Palestinian moderates. The message is, 'You can forget about negotiations after the war because we are going to make sure there is no one to talk to'\". He was released without charge shortly after the end of the war, after 90 days of imprisonment in Ramle Prison.."]}, {"page": "James Fitzjames Stephen", "response": ["The 1957 Wolfenden report recommended the decriminalisation of homosexuality and this sparked off the Hart-Devlin debate on the relationship between politics and morals. Lord Devlin's 1959 critique of the Wolfenden report (titled 'The Enforcement of Morals') resembled Stephen's arguments, although Devlin had arrived at his opinions independently, having never read Liberty, Equality, Fraternity.John Heydon, 'Reflections on James Fitzjames Stephen', University of Queensland Law Journal, 29, no. 1 (2010), p. 49. Hart claimed that \"though a century divides these two legal writers, the similarity in the general tone and sometimes in the detail of their arguments is very great\".H. L. A. Hart, Law, Liberty and Morality (Oxford: Oxford University Press, 1963), p. 16. Afterwards, Devlin tried to obtain a copy of Liberty, Equality, Fraternity from his local library but could only do so with \"great difficulty\"; the copy, when it arrived, was \"held together with an elastic band\".Patrick Devlin, The Enforcement of Morals (Oxford: Oxford University Press, 1965), p. vii. Hart, an opponent of Stephen's views, regarded Liberty, Equality, Fraternity as \"sombre and impressive\".Heydon, p. 50."]}, {"page": "Customary law", "response": ["A central issue regarding the recognition of custom is determining the appropriate methodology to know what practices and norms actually constitutes customary law. It is not immediately clear that classic Western theories of jurisprudence can be reconciled in any useful way with conceptual analyses of customary law, and thus some scholars (like John Comaroff and Simon Roberts)Comaroff & Roberts. have characterised customary law norms in their own terms.  Yet, there clearly remains some disagreement, which is seen in John Hund's critique of Comaroff and Roberts' theory, and preference for the contributions of H. L. A. Hart. Hund argues that Hart's The Concept of Law solves the conceptual problem with which scholars who have attempted to articulate how customary law principles may be identified, defined and how they operate in regulating social behaviour and resolving disputes.Hund."]}, {"page": "Harrogate", "response": ["*H. L. A. Hart (1907–1992), legal philosopherMullender, Richard: \"Nicola Lacey, A Life of H.L.A. Hart: the Nightmare and the Noble Dream – H.L.A. Hart in Anglo-American Context\", Web Journal of Current Legal Issues (review 2007). Oxford University Press, (2004). "]}, {"page": "Legal positivism", "response": ["Legal positivism is a school of thought of analytical jurisprudence developed largely by legal philosophers during the 18th and 19th centuries, such as Jeremy Bentham and John Austin. While Bentham and Austin developed legal positivist theory, empiricism provided the theoretical basis for such developments to occur. The most prominent legal positivist writer in English has been H. L. A. Hart, who, in 1958, found common usages of \"positivism\" as applied to law to include the contentions that:", "* moral judgments, unlike statements of fact, cannot be established or defended by rational argument, evidence, or proof (\"noncognitivism\" in ethics).H. L. A. Hart, \"Positivism and the Separation of Law and Morals\" (1958) 71 Harvard Law Review 593, 601–602.", "Kelsen attracted disciples among scholars of public law worldwide. These disciples developed \"schools\" of thought to extend his theories, such as the Vienna School in Austria and the Brno School in Czechoslovakia. In English-speaking countries, H. L. A. Hart and Joseph Raz are perhaps the best-known authors who were influenced by Kelsen, though both schools differed from Kelsen's theories in several respects.", "====H. L. A. Hart===="]}, {"page": "Susan Sontag", "response": ["Sontag was awarded an American Association of University Women's fellowship for the 1957–1958 academic year to St Anne's College, Oxford, where she traveled without her husband and son.Sante, Luc. \"Sontag: The Precocious Years\", Sunday Book Review, The New York Times, January 29, 2009, accessed December 19, 2012 There, she had classes with Iris Murdoch, Stuart Hampshire, A. J. Ayer and H. L. A. Hart while also attending the B. Phil seminars of J. L. Austin and the lectures of Isaiah Berlin. Oxford did not appeal to her, however, and she transferred after Michaelmas term of 1957 to the University of Paris (the Sorbonne).See Morton White, A Philosopher's Story, Pennsylvania University Press, 1999, p.148; and Rollyson and Paddock, pp. 43–45 In Paris, Sontag socialized with expatriate artists and academics including Allan Bloom, Jean Wahl, Alfred Chester, Harriet Sohmers and María Irene Fornés.Field, Edward. The Man Who Would Marry Susan Sontag, Wisconsin, 2005, pp. 158–170; Rollyson and Paddock, pp. 45–50; and Reborn: Journals and Notebooks 1947–1963, ed. D. Rieff, Farrar, Straus and Giroux, 2008, pp. 188–189. Sontag remarked that her time in Paris was, perhaps, the most important period of her life. It certainly provided the basis of her long intellectual and artistic association with the culture of France.\"An Emigrant of Thought\", interview with Jean-Louis Servan-Schreiber, in Poague, pp. 143–164 She moved to New York in 1959 to live with Fornés for the next seven years,Moore, Patrick. \"Susan Sontag and a Case of Curious Silence\", Los Angeles Times, January 4, 2005, accessed December 18, 2012 regaining custody of her son and teaching at universities while her literary reputation grew."]}]}}