{"wiki_id": "http://www.wikidata.org/entity/Q3742411", "itemLabel": "Sergei Skripal", "itemDescription": "former Russian military intelligence officer convicted of spying for the United Kingdom", "wikipedia_url": "https://en.wikipedia.org/wiki/Sergei_Skripal", "wikipedia_page": {"main": "Sergei Viktorovich Skripal (Russian: Серге́й Ви́кторович Скрипáль, IPA: [sʲɪrˈɡʲej ˈvʲiktərəvʲɪtɕ skrʲɪˈpalʲ]; born 23 June 1951) is a former Russian military intelligence officer who acted as a double agent for the UK's intelligence services during the 1990s and early 2000s. In December 2004, he was arrested by Russia's Federal Security Service (FSB) and later tried, convicted of high treason, and sentenced to 13 years in prison. He settled in the UK in 2010 following the Illegals Programme spy swap. He holds both Russian and British citizenship.On 4 March 2018, he and his daughter Yulia, a Russian citizen who was visiting him from Moscow, were poisoned with a Russian-developed Novichok nerve agent, and were admitted to Salisbury District Hospital in a critical condition. The poisoning was investigated by the British intelligence service as an attempted murder.On 29 March, Yulia was reported to be out of critical condition, 'conscious and talking'. A week later, on 6 April, Skripal was said to no longer be in a critical state. He was discharged on 18 May 2018.", "link_mentions": [{"page": "March 4", "response": ["*2018 – Former MI6 spy Sergei Skripal and his daughter are poisoned with a Novichok nerve agent in Salisbury, England, causing a diplomatic uproar that results in mass-expulsions of diplomats from all countries involved."]}, {"page": "Nerve agent", "response": ["On 4 March 2018, a former Russian agent (who was convicted of high treason but allowed to live in the United Kingdom via a spy swap agreement), Sergei Skripal and his daughter, who was visiting from Moscow, were both poisoned by a Novichok nerve agent in the English city of Salisbury. They survived, and were subsequently released from hospital. In addition, a Wiltshire Police officer, Nick Bailey, was exposed to the substance. He was one of the first to respond to the incident. Twenty-one members of the public received medical treatment following exposure to the nerve agent. Despite this, only Bailey and the Skripals remained in critical conditions. On 11 March 2018, Public Health England issued advice for the other people believed to have been in the Mill pub (the location where the attack is believed to have been carried out) or the nearby Zizzi Restaurant. On 12 March 2018, British Prime Minister Theresa May stated that the substance used was a Novichok nerve agent."]}, {"page": "Vladimir Putin", "response": ["Poisoning of Sergei Skripal", "On 4 March 2018, former double agent Sergei Skripal was poisoned with a Novichok nerve agent in Salisbury. Ten days later, the British government formally accused the Russian state of attempted murder, a charge which Russia denied. After the UK expelled 23 Russian diplomats (an action which would later be responded to with a Russian expulsion of 23 British diplomats), British Foreign Secretary Boris Johnson said on 16 March that it was \"overwhelmingly likely\" Putin had personally ordered the poisoning of Skripal. Putin's spokesman Dmitry Peskov called the allegation \"shocking and unpardonable diplomatic misconduct\"."]}, {"page": "2010s", "response": ["| Sergei Skripal, a former Russian double agent, was poisoned alongside his daughter Yulia in the city of Salisbury with a Novichok agent."]}, {"page": "2018", "response": ["* March 4 – Former Russian double agent Sergei Skripal and his daughter, Yulia, are poisoned by the Novichok nerve agent in Salisbury, England. UK counter-terrorism police investigate amid speculation the Kremlin was behind the incident."]}, {"page": "Salisbury", "response": ["On 4 March 2018, former Russian double agent Sergei Skripal and his daughter Yulia Skripal were poisoned in Salisbury with a Novichok nerve agent."]}, {"page": "List of people who survived assassination attempts", "response": ["|Sergei Skripal and Yulia Skripal"]}, {"page": "GRU", "response": ["Unit 29155 is tasked with foreign assassinations and other covert activities aimed at destabilizing European countries. The Unit is thought to have operated in secret since at least 2008, though its existence only became publicly known in 2019. It is commanded by Maj. Gen.  and based at the headquarters of the 161st Special Purpose Specialist Training Center in eastern Moscow. Its membership included decorated veterans from the Soviet war in Afghanistan and Russia's most recent series of wars in Chechnya and Ukraine. It has been linked to the 2014 Russian annexation of Crimea, the 2015 poisonings of Bulgarian arms dealer Emilian Grebev (also spelled Emilyan), the 2016 Montenegro coup attempt, and the poisoning of Russian defector Sergei Skripal. Unit 29155 operatives have also been tracked to Switzerland during the time (early 2018) other GRU units hacked the World Anti-Doping Agency (then investigating state-sponsored doping by Russian Olympians) and attempted to hack the Organisation for the Prohibition of Chemical Weapons (then investigating the Douma chemical attack by Russia-backed Bashar al-Assad and evidence in the Skripal case). Spain has also investigated the travel of Unit 29155 member Denis Sergeev (who has also used the name Sergei Fedotov) to Barcelona in 2017 around the time of the 2017 Catalan independence referendum. The unit is also accused of being behind the alleged Russian bounty program where Taliban militants were paid to kill American troops, although the program's existence is uncertain, unproven, and unverified.", "In December 2019 Le Monde reported that the joint effort by British, Swiss, French and U.S. intelligence agencies had discovered an apparent \"rear base\" of GRU in southeastern France, which was presumably used by GRU for the clandestine operations carried out throughout Europe. Investigators had identified 15 agents — all of them members of GRU's Unit 29155 — who visited Haute-Savoie in the Auvergne-Rhône-Alpes, region of France from 2014 to 2018, including Alexander Petrov and Ruslan Boshirov, who are believed to be behind the poisoning of the former GRU colonel and British double agent Sergei Skripal in Salisbury in 2018.", "In September 2018 the Crown Prosecution Service formally named two Russian nationals, Alexander Petrov and Ruslan Boshirov (the names used by the men when entering the UK), as suspected perpetrators of the assassination attempt of the former GRU officer Sergei Skripal and his daughter in March 2018. As part of the charge announcement Scotland Yard released a detailed track of the individuals' 48 hours in the UK. This covered their arrival in the UK at Gatwick Airport, trip to Salisbury the day before the attack, trip to Salisbury on the day of the attack and return to Moscow via Heathrow Airport. The two men stayed both nights in the City Stay Hotel on Bow Road, East London and Novichok agent was found in their room after police sealed it off on 4 May 2018. British Prime Minister Theresa May told the Commons the same day that the suspects were part of the G.U. intelligence service (formerly known as GRU) and the assassination attempt was not a rogue operation and was \"almost certainly\" approved at a senior level of the Russian state."]}, {"page": "Seymour Hersh", "response": ["In August 2018, Hersh said “the story of novichok poisoning has not held up very well. He [ Sergei Skripal ] was most likely talking to British intelligence services about Russian organised crime”. He said the contamination of other victims was “suggestive ... of organised crime elements rather than state-sponsored actions – though this files [sic] in the face of the UK government's position”."]}, {"page": "Russia and weapons of mass destruction", "response": ["In March 2018, former GRU agent Sergei Skripal and his daughter were poisoned in Salisbury, United Kingdom by a chemical agent later confirmed to be Novichok. The incident raised new controversy over Russia's potential production and use of chemical weapons, with the United Kingdom accusing the Russian government or rogue Russian agents of orchestrating the attack, a claim Russia repeatedly denied."]}, {"page": "Chemical weapon proliferation", "response": ["On March 4, 2018, Russia was alleged to have conducted a chemical attack in Salisbury, UK that left 5 injured including the alleged target of the attack, Sergei Skripal."]}, {"page": "DSMA-Notice", "response": ["On 7 March 2018 and on 14 March 2018 two notices were issued to protect MI6 in relation to some aspects of the Skripal affair. In the early 1990s Sergei Skripal was recruited by Pablo Miller, the MI6 agent inside the UK embassy to Estonia in Tallinn. The MI6 officer under diplomatic cover in Moscow at this time was Christopher Steele. Miller was also the handler of Skripal after he went to jail and was released by Russia in a spy swap. Both lived in Salisbury. Steele and Miller worked for Orbis Business Intelligence which compiled the controversial Trump–Russia dossier, comprising 17 memos written in 2016 alleging misconduct and conspiracy between Donald Trump's presidential campaign and the Putin administration. While the precise nature of the relations between Skripal, Miller, and Steele were hidden, enough was already known to raise questions about Skripal's ongoing involvement with British intelligence."]}, {"page": "Novichok agent", "response": ["On 12 March 2018, the UK government said that a Novichok agent had been used in an attack in the English city of Salisbury on 4 March 2018 in an attempt to kill former GRU officer Sergei Skripal and his daughter Yulia. British Prime Minister Theresa May said in Parliament: \"Either this was a direct action by the Russian state against our country, or the Russian government lost control of its potentially catastrophically damaging nerve agent and allowed it to get into the hands of others.\" On 13 March the BBC asked Vladimir Putin if Russia was \"behind the poisoning of\" Skripal and he answered \"Get to the bottom of it first then we can discuss it\" while he delegated a spokesperson to claim that \"a circus show in the British parliament\" was the upshot. Boris Johnson, then Minister at the FCO, refused to shake hands with Russian ambassador Alexander Yakovenko as he expressed his nation's \"outrage\". On the next day, the UK expelled 23 Russian diplomats after the Russian government refused to meet the UK's deadline of midnight on 13 March 2018 to give an explanation for the use of the substance. Addressing the United Nations Security Council on 15 March, Vassily Nebenzia, the Russian envoy to the UN, responded to the British allegations by denying that Russia had ever produced or researched the agents, stating: \"No scientific research or development under the title novichok were carried out.\"", "On 30 June 2018, Charlie Rowley and Dawn Sturgess were found unconscious at a house in Amesbury, Wiltshire, about eight miles from the Salisbury poisoning site. On 4 July 2018, police said that the pair had been poisoned with the same nerve agent as ex-Russian spy Sergei Skripal."]}, {"page": "Ben Wallace (politician)", "response": ["After the EU referendum, the new Prime Minister, Theresa May, promoted him to Minister of State for Security in the Home Office. In December 2017 the Ministerial portfolio was extended to include Economic Crime. He was the Security Minister during the terror attacks of 2017 and the Salisbury attempted assassination of Sergei Skripal. Wallace was appointed to the Privy Council for his role in coordinating the government response to the 2017 Westminster attack."]}, {"page": "Bill Durodié", "response": ["His work proposes that Securitization (international relations) theory is too limited a framework through which to understand the British government's new Prevent Duty.Prevent Duty Guidance This latter imposes new obligations on public bodies to tackle so-called Radicalization, which he proposes is better understood as being driven by a process of disengagement.Leeds Salon - Radicalisation and Security He has also addressed what he sees as the demise of strategic thinking and a concomitant crisis of diplomacy, most recently evidenced by the responses of senior British government ministers to the Sergei Skripal, former-spy poisoning episode in the UK.The Lost Art Of Diplomacy"]}, {"page": "Ozyorsk, Kaliningrad Oblast", "response": ["* Sergei Skripal (born 23 June 1951),  former Russian military intelligence officer who acted as a double agent for the UK's intelligence services during the 1990s and early 2000s."]}, {"page": "Russia–European Union relations", "response": ["On 4 March 2018, Sergei Skripal, a former Russian military intelligence officer who acted as a double agent for the UK's intelligence services in the 1990s and early 2000s, and his daughter Yulia were poisoned with a Novichok nerve agent in Salisbury, England. The UK Prime Minister Theresa May requested a Russian explanation by the end of 13 March 2018. She said that the UK Government would \"consider in detail the response from the Russian State\" and in the event that there was no credible response, the government would \"conclude that this action amounts to an unlawful use of force by the Russian State against the United Kingdom\" and measures would follow."]}, {"page": "Shikhany", "response": ["Based upon a report submitted by Russia to the Organisation for the Prohibition of Chemical Weapons (OPCW), a British chemical weapons expert indicated that Shikhany was the source of the novichok agent used in the 2018 poisoning of Sergei Skripal and his daughter. However, a chemical weapons site in Uzbekistan that was dismantled and decontaminated in 1999 may have been used to originally produce and test the agent."]}, {"page": "Poisoning of Alexander Litvinenko", "response": ["Sergei Skripal is a former Russian military intelligence officer who acted as a double agent for the UK's intelligence services during the 1990s and early 2000s. In December 2004, he was arrested by Russia's Federal Security Service (FSB) and later tried, convicted of high treason, and sentenced to 13 years in prison. He settled in the UK in 2010 following the Illegals Program spy swap. On 4 March 2018, he and his daughter Yulia, who was visiting him from Moscow, were poisoned with a Novichok nerve agent. By 15 March 2018, they were in a critical condition at Salisbury District Hospital. The poisoning is being investigated as an attempted murder. He holds both Russian and British citizenship. On 21 March 2018 Russian ambassador to the UK Alexander Yakovenko said that Sergei Skripal is also a Russian citizen. On 29 March, Yulia was reported to be out of critical condition, conscious and talking. A week later, on 6 April, Skripal was said to no longer be in a critical state. He was discharged on 18 May."]}, {"page": "Lefortovo Prison", "response": ["* Sergei Skripal "]}, {"page": "Russians in the United Kingdom", "response": ["*Sergei Skripal, former Russian military intelligence officer who acted as a double agent for the UK's intelligence services."]}, {"page": "Mark Urban", "response": ["After the 2018 Amesbury poisonings Urban reported that he was working with Sergei Skripal up to a year before the poisoning of Sergei and Yulia Skripal in Salisbury.Mark Urban: Salisbury poisoning: Skripals 'were under Russian surveillance, BBC, 4 July 2018"]}, {"page": "Poison laboratory of the Soviet secret services", "response": ["* Sergei Skripal, former GRU officer and double agent for the British SIS, and his daughter Yulia. On 4 March 2018, the Skripals were poisoned with a Novichok agent in Salisbury, United Kingdom, where Sergei had been living since 2010. Both eventually recovered; in 2020, they were reported to be living under new identities in New Zealand."]}, {"page": "Salisbury District Hospital", "response": ["In March 2018, retired Colonel Sergei Skripal (a former agent for Russia who then provided assistance to Britain and was caught and imprisoned by Russia and later freed in a spy swap), and his daughter, Yulia, were treated at Salisbury District Hospital after they were found poisoned by a substance thought to be a Novichok agent."]}, {"page": "Russia–United Kingdom relations", "response": ["Russia–United Kingdom relations, also Anglo-Russian relations,Anglo-Russian Relations House of Commons Hansard. involve the bilateral relationship between Russia and the United Kingdom. Formal ties between the courts started in 1553. Russia and Britain became allies against Napoleon in the early-19th century. They were enemies in the Crimean War of the 1850s, and rivals in the Great Game for control of central Asia in the latter half of the 19th century. They allied again in World Wars I and II, although the Russian Revolution of 1917 strained relations. The two countries were at sword's point during the Cold War (1947–1989). Russia's big business tycoons developed strong ties with London financial institutions in the 1990s after the dissolution of the USSR in 1991. The countries share a history of intense espionage activity against each other, with the Soviet Union succeeding in penetration of top echelons of the British intelligence and security establishment in the 1930s–1950s while concurrently, the British co-opted top Russian intelligence officers throughout the period including the 1990’s whereby British spies such as Sergei Skripal acting within the Russian intelligence establishment passed on extensive details of their intelligence agents operating throughout Europe. Since the 19th century, England has been a popular destination for Russian political exiles, refugees, and wealthy fugitives from the Russian-speaking world."]}, {"page": "Organophosphate poisoning", "response": ["In March 2018, Sergei Skripal and his daughter were poisoned in Salisbury, England, with an organophosphate poison known as a Novichok agent. Benjamin Kentish (12 April 2018). \"Poison used on Sergei and Yulia Skripal in Salisbury attack was novichok nerve agent, confirms chemical weapons watchdog\". The Independent. Both fell unconscious while sitting on a park bench. A first responder to the scene also became contaminated and had symptoms of organophosphate poisoning. All three survived after hospital treatment. Despite continually denying responsibility for the attack, Russia is suspected to be behind the poisonings."]}, {"page": "Anglo-American School of St. Petersburg", "response": ["The Russian government's actions were done in retaliation to the expulsion of Russian diplomats that were retaliations for the attempted poisoning of Sergei Skripal."]}, {"page": "Jane Corbin", "response": ["In 2017 Corbin presented a documentary on the Balfour Declaration, signed a hundred years before, which led to the creation of a homeland for the Jewish people, the creation of the state of Israel and the bitter conflict that has continued to this day between Israel and the Palestinians over the Gaza Strip, the West Bank and the status of Jerusalem and right of return of Palestinian refugees. In November 2018 Corbin wrote and presented a major investigation into the Russian Novichok nerve agent attack in Salisbury on the former Russian spy, Sergei Skripal and his daughter Yulia. Detective Sergeant Nick Bailey of Wiltshire police, also poisoned in the attack, gave Corbin an exclusive interview in this film which examined the part played by the GRU, the Russian state and President Putin in the attack. In April 2019 Corbin's film for the BBC 'The Shadow Commander\" investigated the role played in many wars and intelligence led operations in the Middle East by the powerful Commander of the Quds Force of the Revolutionary Guard of Iran - General Qasem Soleimani.   She predicted that he would be a major target for the Americans - Suleimani was eliminated by a US strike in Iraq nine months later."]}, {"page": "Illegals Program", "response": ["Reuters reported on July 7–8, 2010 that the U.S. and Russia reached a deal under which the ten individuals arrested in that country as part of the Illegals Program would be deported to Russia in exchange for individuals who Russia convicted of espionage on behalf of the US and UK. Igor Sutyagin, Alexander Zaporozhsky, Sergei Skripal and Gennadiy Vasilenko were included in the exchange.\"U.S.-Russia may seek spy swap to free agents\", Reuters, July 7, 2010. All four served a considerable time in Russian prisons;\"Factbox: Who are the spies Russia plans to swap?\", Reuters, July 9, 2010. at least three of the jailed individuals in Russia were convicted of spying for either the United Kingdom or the U.S.", "===Sergei Skripal===", "Sergei Skripal was a colonel in Russia's Military Intelligence Service (GRU), who was arrested and convicted of high treason in Russia in 2006, and sentenced to 13 years in prison.Kulish, Nicholas; Baker, peter; and Barry, Ellen. \"Prisoner Swap in Vienna Ends U.S.-Russia Espionage Case\", The New York Times, July 9, 2010. Retrieved July 9, 2010. According to the prosecution, he had spied for the United Kingdom's MI6 as a double agent. After the prisoner exchange in 2010 he moved to the UK and in 2018 Skripal and his daughter Yulia were poisoned with a nerve agent in Salisbury, England.  Three unrelated people were accidentally poisoned as well, one of them fatally."]}, {"page": "Alexei Navalny", "response": ["Ivan Zhdanov, chief of Navalny's Anti-Corruption Foundation, said that Navalny could have been poisoned because of one of the foundation's investigations. On 2 September, the German government announced that Navalny was poisoned with a Novichok nerve agent, from the same family of nerve agents that was used to poison Sergei Skripal and his daughter. International officials said that they had obtained \"unequivocal proof\" from toxicology tests, and have called on the Russian government for an explanation. On 7 September, German doctors announced that he was out of the coma. On 15 September, Navalny's spokeswoman said that Navalny would return to Russia. On 17 September, Navalny's team said that traces of the nerve agent used to poison Navalny was detected on an empty water bottle from his hotel room in Tomsk, suggesting that he was possibly poisoned before leaving the hotel. On 23 September, Navalny was discharged from hospital after his condition had sufficiently improved. On 6 October OPCW confirmed presence of cholinesterase inhibitor from the Novichok group in Navalny's blood and urine samples."]}, {"page": "Targeted killing", "response": ["The Russian government is alleged by the British government of being behind a failed assassination attempt on Sergei Skripal and his daughter using a Novichok agent."]}, {"page": "Heiko Maas", "response": ["Since taking office as foreign minister in 2018, Maas has been markedly tougher than his immediate predecessors – Frank-Walter Steinmeier and Sigmar Gabriel – in his rhetoric and approach towards Russia. On his first day in office, he issued a frank warning about Russian “aggression” and chastised its leadership for “defining itself in antagonism to many in the west”.Tobias Buck (29 March 2018), German foreign minister Heiko Maas makes waves Financial Times. Under his leadership, Germany – in coordination with its allies – expelled four Russian diplomats over Russia’s suspected involvement in the poisoning of former Russian double agent Sergei Skripal in Salisbury, UK.Joseph Nasr (30 March 2018), Russia expels four German diplomats in nerve agent poisoning dispute Reuters."]}, {"page": "List of 2018 FIFA World Cup controversies", "response": ["On 14 March 2018, following the poisoning of former spy Sergei Skripal and his daughter in Salisbury in the United Kingdom, the British government announced that all official visits to the World Cup were suspended."]}]}}