{"wiki_id": "http://www.wikidata.org/entity/Q3752050", "itemLabel": "Franko B", "itemDescription": "performance artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Franko_B", "wikipedia_page": {"main": "Franko B (born in Milan in 1960) is an Italian performance artist based in London, where he has lived since 1979. He studied fine art at Camberwell College of Arts (1986–87), Chelsea College of Art (1987–90) and the Byam Shaw School of Art (1990–91). His work was originally based on the bloody and ritualised violation of his own body. Later on he embraced a wide variety of media including video, photography, painting, installation, and sculpture.\nHe performed at the ICA, London in 1996 and 2008, the South London Gallery in 1999 and 2004, the Centre of Attention in 2000, Tate Modern in 2002, the Ikon Gallery, Birmingham in 2005, Arnolfini, Bristol in 2007, The Bluecoat Centre, Liverpool in 2008, CENDEAC, Murcia, Spain in 2007 and The Crawford Art Gallery in Cork, Ireland in 2005. He has exhibited work internationally in Zagreb, Mexico City, Milan, Amsterdam, Antwerp, Copenhagen, Madrid, Vienna, Brussels, Warsaw, Dublin and Siena.\nFrom 2009 to 2016 he taught sculpture at the Accademia di Belle Arti di Macerata in Italy. In 2017 he was appointed Professor of Sculpture at Accademia Albertina in Turin. He has also lectured extensively at a number of art schools, including Saint Martin's School of Art; New York University; the Ruskin School of Fine Art, Oxford; Chelsea College of Art, London; Duncan of Jordanstone College of Art, Dundee; DasArts, Amsterdam; Goldsmiths' College of Art, London; Zurich University of the Arts; and the Courtauld Institute of Art.\nHis work is the subject of four monographs: Franko B (Black Dog Publishing, London, 1998), Oh Lover Boy, (Black Dog Publishing, London, 2000), Blinded by Love (Damiani Editore, Bologna, 2006) and I Still Love (Motta/Il Sole 24 Ore, Milan, 2010).\nAn archive of materials related to his work is held as part of the University of Bristol's Theatre Collection.In April 2013, Franko B's work appeared on the cover and insert for the UK Decay album New Hope for the Dead.", "link_mentions": [{"page": "Blood", "response": ["Blood is one of the body fluids that has been used in art.\"Nostalgia\" Artwork in blood  In particular, the performances of Viennese Actionist Hermann Nitsch, Istvan Kantor, Franko B, Lennie Lee, Ron Athey, Yang Zhichao, Lucas Abela and Kira O'Reilly, along with the photography of Andres Serrano, have incorporated blood as a prominent visual element. Marc Quinn has made sculptures using frozen blood, including a cast of his own head made using his own blood."]}, {"page": "Camberwell College of Arts", "response": ["* Franko B (artist)"]}, {"page": "Chelsea College of Arts", "response": ["* Franko B (artist)"]}, {"page": "Fierce!", "response": ["The festival has also presented performances by numerous artists including Ron Athey, Franko B, Gob Squad, Tim Miller, Forced Entertainment and more."]}, {"page": "Extreme performance art", "response": ["* Franko B"]}, {"page": "Ron Athey", "response": ["Athey has a significant curatorial and programming practice. In 2000 and 2001, he collaborated with Vaginal Davis on a performance-centered queer club night, G.I.M.P. Un-Ltd. These events were staged at a bar in Silver Lake (Zen Sushi) and featured performances by Athey and Davis, as well as John Fleck, Osseus Labyrint, Los Superelegantes, and Kembra Pfahler and The Voluptuous Horror of Karen Black. In 2001 and 2002, Athey and Vaginal Davis curated an eighteen-hour performance festival as a part of Outfest, the Los Angeles Gay and Lesbian Festival. Staged under the festival's \"Platinum\" program, these events featured work by a range of artists, including Bruce LaBruce, Slava Mogutin, Brendan Mullen, JD Samson, Selene Luna, Mehmet Sander, and Glen Meadmore. Athey has collaborated with others (notably Lee Adams) on a curatorial project inspired by the writings of Georges Bataille, Visions of Excess (Birmingham, 2005 and 2008; Ljubljana, 2004; London, 2009). These performance programs have featured such artists such as Franko B, Julie Tolentino, Zackary Drucker, Nicole Blackman, Marisa Carnesky and Kira O'Reilly. Dominic Johnson, \"Ron Athey's Visions of Excess: Performance After Georges Bataille\" in Papers of Surrealism, Issue 8 (2010), 1-2"]}, {"page": "Abjection", "response": ["In the 1980s and 1990s, fascination with the Powers of Horror, the title of a book by Julia Kristeva, led to a second wave of radical performance artists working with bodily fluids including Ron Athey, Franko B, Lennie Lee and Kira O' Reilly. Kristeva herself associated aesthetic experience of the abject, such as art and literature, with poetic catharsisan impure process that allows the artist or author to protect themselves from the abject only by immersing themselves within it.Kristeva, \"Powers of Horror\" (1982), p. 15; Spittle, \"'Did this game scare you? Because it sure as hell scared me!' F.E.A.R., the abject and the uncanny\" (2011); Oliver, \"Psychoanalysis, aesthetics, and politics in the work of Kristeva\" (2009)."]}, {"page": "List of performance artists", "response": ["*Franko B"]}, {"page": "Tim Etchells", "response": ["Other collaborations include writing essays for performance artist Franko B's Still Lives publication, for the visual art duo Elmgreen and Dragset's project Drama Queens and working with the pair on their later project Happy Days in the Art World. An Art in America article on Happy Days in the Art World said \"Etchells is an experimental British playwright of some fame whose work is Beckettian, not Beckett-esque. His work is mocking and meandering but can really get under the skin, and prick at latent feelings of abjection, loneliness, the inability to communicate, futility.\""]}, {"page": "South London Gallery", "response": ["In 1999, Curator Donna Lynas began a Live Art programme, which incurred some controversy, with performances including Franko B and Stuart Brisley."]}]}}