{"wiki_id": "http://www.wikidata.org/entity/Q375957", "itemLabel": "James Bourne", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Bourne", "wikipedia_page": {"main": "James Elliot Bourne (born 13 September 1983) is an English singer-songwriter and musician. He is known as the co-founder of pop punk bands Busted and Son of Dork, and he also created his own electronic project: Future Boy. From 2013-2015 he was a member of McBusted, which consisted of himself, Busted bandmate Matt Willis, and McFly.", "link_mentions": [{"page": "September 13", "response": ["*1983 – James Bourne, English singer-songwriter, guitarist, and producer "]}, {"page": "Oliver!", "response": ["Cameron Mackintosh produced another revival of the show which opened at the London Palladium in the West End on 8 December 1994. The production team included a young Sam Mendes as director, with Anthony Ward as designer, Matthew Bourne as choreographer, Martin Koch as music supervisor and William David Brohn as orchestrator. The cast included Jonathan Pryce (after much persuasion) as Fagin, Sally Dexter as Nancy, Miles Anderson as Bill Sikes, James Villiers as Mr. Brownlow, James Saxon as Mr. Bumble, Jenny Galloway as Widow Corney, David Delve as Mr. Sowerberry and Julia Deakin as Mrs. Sowerberry. The role of Oliver was played by numerous child actors during the run of four years, including Gregory Bradley, Ben Reynolds, Jon Lee, Steven Webb, James Bourne,  James Rowntree and Tom Fletcher, while the Artful Dodger was played by Adam Searles and others including Matt Johnson, Paul Bailey and Bronson Webb. The role of Bet was played by Danielle McCormack, Rosalind James, Francesca Jackson and Lindsey Fawcett.Wolf, Matt. \"Review: Oliver!\", Variety, December 12, 1994 The musical closed on 21 February 1998.\"Oliver! listing, 1994–1998\" thisistheatre.com, retrieved May 28, 2010 The role of Fagin was later played by many notable British actors and comedians including George Layton, Russ Abbot, Jim Dale and Robert Lindsay (who won an Olivier Award for his performance in 1997). Bill Sikes was later portrayed by Steven Hartley and Joe McGann, and Nancy by Sonia Swaby, Claire Moore and Ruthie Henshall."]}, {"page": "Southend-on-Sea", "response": ["* James Bourne, musician, singer Busted"]}, {"page": "Rochford", "response": ["*James Bourne, Singer and guitarist for band McBusted"]}, {"page": "List of musicals: A to L", "response": ["| James Bourne and Elliot Davis"]}, {"page": "Busted (band)", "response": ["Busted are an English pop punk band from Southend-on-Sea, Essex, consisting of James Bourne, Matt Willis and Charlie Simpson. Formed in 2000, the band had four UK number-one singles, won two Brit awards, released four studio albums and sold over 5 million records. The band released Busted in 2002 and A Present for Everyone in 2003 before disbanding in January 2005. Following the split, all three members pursued separate musical careers: Simpson as the frontman for the post-hardcore band Fightstar, Bourne as the lead singer of pop punk band Son of Dork and Willis as a solo artist. The band reunited in 2016 and have stayed together since.", "James Bourne and Matt Willis originally auditioned for another band which neither of them made it into. They remained friends for a number of years and wrote material together. Willis claimed that they had been inspired by Green Day, Blink-182 and BBMak. Busted were formed in early 2000, after open auditions were held by Warner Music to form a new band, and originally consisted of Bourne, Willis, Ki Fitzgerald and Owen Doyle,  although this version of the band broke up later that year. Charlie Simpson and Tom Fletcher auditioned to be in the band and were both offered a place to complete the line-up. 24 hours later, however, Busted's manager told Fletcher via a phone call that the band was to go ahead as a trio, comprising Bourne, Willis and Simpson.", "On 26 October 2018, Busted announced that their fourth album, Half Way There (a reference to a lyric in the song \"Year 3000\"), would be released on 8 February 2019. The album features a cover of James Bourne's song, \"What Happened to Your Band\", which was previously performed by his band Son of Dork and recorded by McBusted, and returns to the roots of their musical style. The first single of the album, \"Nineties\", was released in the first week of November 2018. Additional songs from the album, \"Reunion\" and \"All My Friends\" were released December 14 and 15 respectively (the latter was an exclusive release for those that had pre-ordered the album from the band's online store). In January 2019, Busted released their second single for the album, \"Radio\". This was accompanied by a music video.", "Busted have been called instrumental in the formation of British pop rock band Mcfly. After the record label declined Tom Fletcher's participation in the band, he was offered a space on the song writing team for the first two albums. Fletcher credits James Bourne as teaching him the structure of a pop hit. After Busted's split, Mcfly was often coined as Busted's successor. Year 3000 and What I Go To School For were also covered by the pop band Jonas Brothers. Their cover of Year 3000 was a lead single from their first album and a commercial success.", "* James Bourne – vocals, rhythm guitar, keyboards, piano "]}, {"page": "McFly", "response": ["In 2001, Tom Fletcher auditioned for Busted, but lost out on the place to Charlie Simpson. Fletcher was originally accepted as part of Busted's line-up, but Island Records went on to reassess the situation and eventually decided to have the band as a three-piece rather than a four-piece. Though the record label decided against offering Fletcher a place in Busted, they were intrigued by his songwriting talents and later offered him a place on Busted's songwriting 'team', alongside band member (and already accomplished songwriter) James Bourne, whom Fletcher credits with helping him to compose melodies.", "McFly confirmed that they would embark an original 18-date tour (21 later) to promote their 2012 Memory Lane: The Best of McFly album which would run from April–May. They were joined for some for these dates by James Bourne. McFly went on several writing trips for the writing stage of this album and worked with Matt Willis and Bourne in writing. Titles for songs were to be \"Hyperion\", \"Break Me\", \"We Were Only Kids\", \"Dare You To Move\", \"Hammer Ring\", \"Josephine\", \"Love Is Easy\", \"Do Watcha\", \"Cherry Cola\", \"Red\", \"Love Is on the Radio\" and \"Touch the Rain\". \"Love Is Easy\" was released as a single in 2012 while \"Do Watcha\" and \"Cherry Cola\" were both featured on Memory Lane: The Best of McFly. \"Red\" and \"Touch the Rain\" were both previewed during McFly's Keep Calm and Play Louder tour in 2012. \"Love Is on the Radio\" was previewed during McFly's 10th anniversary shows at the Royal Albert Hall in 2013. \"Love Is on the Radio\", the first single taken from their new album, was released on 24 November. The album was due to be released in the northern spring of 2014, but this has been put on hold. In the McBusted biography by Jennifer Parker it was hinted that the sixth album was abandoned in favour of the debut album of McBusted. In November 2013, the band wrote and performed the new theme tune to The Paul O'Grady Show. McFly expressed their interest in a possible collaboration with Jessie J but have made no official plans."]}, {"page": "List of alternative rock artists", "response": ["*James Bourne"]}, {"page": "Wheatus", "response": ["Brendan B. Brown, commonly known as BBB to fans, is the lead vocalist, guitarist, and the only remaining founding member of Wheatus, which he formed in 1995 with his brother, Peter Brown (drums) and Rich Liegey (bass).  Brown has also collaborated with James Bourne of Busted and McBusted (a collaboration between Busted and McFly) on several songs for McBusted's album, McBusted."]}, {"page": "V (group)", "response": ["Their first single, \"Blood, Sweat and Tears\", was released in May 2004 and went into the UK Singles Chart at number 6. The video was shot in Miami, Florida in February 2004 and the single contained a collaboration with McFly, called \"Chills in the Evening\" written by Tom Fletcher from McFly and James Bourne from Busted. The band's second single, released in August 2004, was a double A-side and consisted of a new song \"Hip to Hip\" and a cover of The Jacksons' song \"Can You Feel It\". The music video showed the group dressed up in day-to-day jobs like an ice cream man and milkman. It charted at number 5 in the UK Singles Chart.", "* Antony Brant remained friends with the members of McFly, and toured with the band alongside James Bourne and The Vamps in the spring of 2013 as a compere to their Memory Lane tour."]}, {"page": "Tom Fletcher", "response": ["At a very young age, Fletcher began writing music commercially. He originally auditioned for band Busted, but lost out on the place to Charlie Simpson after the record label Island Records decided the band should be a trio rather than a four-piece; Fletcher states that he was in the band \"for approximately 24 hours.\"  This led to a job with the band's songwriting team, mainly because of the label's intrigue with his writing talents,  Fletcher then got to know Busted band member James Bourne, which would then lead to a strong song writing relationship between the two. He has since stated that it was Bourne who taught him how to \"properly\" structure songs, and how to \"come up with good, poppy melodies\".", "Fletcher wrote \"On a Rainbow\", the official song of the 2012 Summer Olympics' mascots Wenlock and Mandeville. The song features vocals from him and his sister Carrie Hope Fletcher. He also wrote the song \"I Want\" for One Direction's debut album Up All Night, and co-wrote (with Dougie Poynter and Danny Jones) \"I Would\" for their second album Take Me Home and \"Don't Forget Where You Belong\" for their third album Midnight Memories. He has co-written several songs with James Bourne including \"Chills in the Evening\", recorded by V. He also co-wrote \"High Hopes\" along with all four members of the Vamps for their debut album, Meet the Vamps. Fletcher is also credited as having co-written the 5 Seconds of Summer track \"Try Hard\". The song was originally released on YouTube on 1 June 2013, and in 2014 featured as a B-Side to their hit single \"Don't Stop\"."]}, {"page": "Gary Barlow", "response": ["In 2008, Barlow was heavily involved in providing the score of ITV's Britannia High. The 9 episode series focused on the lives of a group of teenagers and their mentors at a fictional London theatre school. Guy Chambers, Steve Mac, Andy Hill, Mark Owen, James Bourne and Eliot Kennedy also contributed to the musical component of the show. It was axed after one series.  "]}, {"page": "Chertsey", "response": ["*Steve Rushton, of the pop band Son of Dork with James Bourne and latterly with Disney in Los Angeles, was born in Chertsey in 1987."]}, {"page": "Room on the 3rd Floor", "response": ["In 2001, Tom Fletcher auditioned for pop punk band Busted; it was the same audition Charlie Simpson was at. Fletcher was originally accepted as part of Busted's line-up, but Island Records went on to reassess the situation and eventually decided to have the band as a three-piece rather than a four-piece. Though the record label decided against offering Fletcher a place in Busted, they were intrigued by his songwriting talents and later offered him a place on Busted's songwriting 'team', alongside band member (and already accomplished songwriter) James Bourne, whom Fletcher credits with helping him to compose melodies.", "The album was named after the hotel room where most of the songs were written The album's main songwriters include band members Tom Fletcher and Danny Jones, as well as contributions from James Bourne from the band Busted, as well as some of Busted's main producers. The album is directly influenced by three things: modern pop punk, 1960s surfer pop, and tales of unrequited love. The track \"Get Over You\" is hidden, and does not appear on the track listing. It can be accessed by rewinding into the pre-gap, prior to the first track, \"Five Colours in Her Hair\". The track cannot be accessed if the album is played in a computer. The song has however since been released as a regular track in Deluxe Edition of the band's 2012 compilation album Memory Lane: The Best of McFly. Four singles were released from the album: \"Five Colours in Her Hair\" and \"Obviously\", which both went to number one, \"That Girl\", which reached number three, and the title track, \"Room on the 3rd Floor\", which peaked at five. A demo version of the track \"Saturday Night\" was previously released as \"Saturday Nite\" on the B-side of the \"Five Colours in Her Hair\" single. The international version of the album removes the songs \"Broccoli\" and \"Surfer Babe\" for contractual reasons. This version also features alternate artwork – the colour of the band logo is altered from yellow to red."]}, {"page": "Charlie Simpson", "response": ["Charlie first shot to fame with pop rock/pop punk act Busted as a result to responding to an advertisement placed by Matt Willis and James Bourne in NME magazine in 2001. Busted consisted of Charlie on lead guitar and occasionally drums, Willis on bass guitar and Bourne on rhythm guitar and piano; all three members provided vocals. Over a period of two years, the trio had major success and sold over 5 million records, won two BRIT Awards, and also won Record of The Year in 2004."]}, {"page": "5 Colours in Her Hair", "response": ["\"5 Colours in Her Hair\" is the debut single by English pop rock band McFly. It was also the band's first UK number one. It stayed at the top for two weeks. The song was written by Tom Fletcher, James Bourne, Danny Jones and Ben Sargeant. The track is especially well known for its \"Doo, doo, doo, doo, doo, doo!\" lyrics, played at the beginning and at the ending of the song. The CD and 7-inch formats features a duet with Busted singing a cover of the Kinks song \"Lola\".", "Category:Songs written by James Bourne"]}, {"page": "Obviously (song)", "response": ["Category:Songs written by James Bourne"]}, {"page": "Danny Jones", "response": ["McFly rose to fame in 2004, partly due to their association with Busted; McFly supported Busted on their A Present for Everyone Tour. Jones met Fletcher when he auditioned for the \"boy band\" V (he mistakenly perceived V as similar in style to the future Busted). Fletcher, who was filming the auditions for Island Records, later approached Jones. The two conversed and discovered common interests, leading to a songwriting session between Fletcher, Jones and Busted's James Bourne."]}, {"page": "List of guitarists", "response": ["*James Bourne (Son of Dork)"]}, {"page": "I'll Be OK", "response": ["The song was written by band members Tom Fletcher, Dougie Poynter and Danny Jones. The single started its life out as two tracks, one written by Jones and the other by Fletcher and then by placing their \"best\" parts of their songs together, they had written I'll Be OK. In an interview, Tom Fletcher stated \"It gives people a positive message, by saying that you should always reassure yourself, even when things do go wrong\". The single also includes a new track—\"No Worries\"—written by former Busted members Charlie Simpson and James Bourne."]}, {"page": "That Girl (McFly song)", "response": ["\"That Girl\" is a song recorded by English pop rock band McFly. It was written by frontman Tom Fletcher and Busted's James Bourne. The song was released on 6 September 2004 as the lead single from the band's debut studio album Room on the 3rd Floor (2004). It was their first single not to reach the top spot in the UK Singles Chart, peaking at number three. In Ireland, it reached number 14.", "The song was written by McFly frontman Tom Fletcher and James Bourne of Busted. It is a fun and upbeat track and was the third single lifted from McFly's debut album Room on the 3rd Floor, but the first to be released after the album.", "Category:Songs written by James Bourne"]}, {"page": "Son of Dork", "response": ["Son of Dork were a British pop punk band formed by James Bourne after his previous band, Busted, split in January 2005. The name of the band came from a scene in the 1990 film Problem Child where the chant \"Son of Dork\" is used. Their debut single, \"Ticket Outta Loserville\", was released in November 2005, reaching No. 3 on the UK Singles Chart. Their second single, \"Eddie's Song\", reached No. 10 in January 2006.", "James Bourne placed adverts in publications such as NME and The Stage in order to recruit potential band members for his new project. The members that were chosen had all been involved in bands. Drummer Danny Hall had previously spent ten years with hardcore metal band \"Spiral Rocks\" and Punk band \"Like I Care\", whereas guitarist Chris Leonard had been in band \"Stamford Amp\", the house band on BBC's The Saturday Show in 2002 and had also toured with acts including Brian McFadden and Busted. Steven Rushton was dividing his time between former band \"Mr Cheerful\", college studies and a job in Sainsbury's. Bourne decided to name the band after a scene in the film Problem Child.", " There was a reunion of sorts when Steve Rushton, Chris Leonard and James Bourne, along with the Welsh duo Lilygreen & Maguire, all recorded a cover of Michael Jackson's \"Man in the Mirror\".Archived at Ghostarchive and the Wayback Machine:  In 2019, Bourne stated he'd had ideas for a Son of Dork concept album.", "*James Bourne – lead vocals, rhythm guitarist", "In 2009, lead-singer James Bourne co-wrote a musical alongside Elliot Davies based on the band's debut album Welcome to Loserville, titled Loserville."]}, {"page": "A Present for Everyone", "response": ["*James Bourne – rhythm guitar, vocals"]}, {"page": "A Ticket for Everyone: Busted Live", "response": ["*James Bourne – electric and acoustic guitar, co-lead vocals"]}, {"page": "Busted (2002 Busted album)", "response": ["*James Bourne – guitars, vocals, keys, production"]}, {"page": "Kara Tointon", "response": ["Tointon was born to parents Ken (b. 1948) and Carol Tointon (1957–2019). Together with her actress sister, Hannah (born 1987), Tointon was brought up in Leigh-on-Sea. Both sisters attended St Michael's School, Leigh, and St Hilda's School, Westcliff-on-Sea, Essex. Tointon was diagnosed with dyslexia at age seven. She had speech and drama lessons at school. For about one year when she was a teenager, she dated James Bourne from the band Busted."]}, {"page": "Welcome to Loserville", "response": ["Welcome to Loserville is the only studio album from British pop punk band Son of Dork. The album was released on 21 November 2005 by Mercury Records. The album was later adapted into a musical, \"Loserville the Musical\", by band member James Bourne and writer Elliot Davis commissioned and performed by Youth Music Theatre UK and presented at the South Hill Park Arts Centre, Bracknell, in 2009. The show was subsequently retitled \"Loserville\" and produced professionally by Kevin Wallace, TC Beech and Youth Music Theatre UK at the West Yorkshire Playhouse. It then transferred to the West End's Garrick Theatre and featured UK pop star Chris Hardman.", "*James Bourne - lead vocals, Rhythm guitarist"]}, {"page": "Across the Line (radio show)", "response": ["The Tides won in 2006, with Busted guitarist James Bourne, Kerrang Editor Paul Brannigan and MTV presenter Emma Griffiths on the judging panel. Nice N' Sleazy won in 2007, with Divine Comedy frontman Neil Hannon, NME writer James Jam and Therapy? bassist Michael Mc Keegan judging. Both bands then played the Tennents ViTal festival in Ormeau Park."]}, {"page": "Crashed the Wedding", "response": ["\"Crashed the Wedding\" is a song by English pop rock band Busted. It was written by James Bourne and McFly's Tom Fletcher and produced by Steve Power. It was released on 10 November 2003 through Island Records as the lead single from Busted's second studio album A Present for Everyone (2003).", "Category:Songs written by James Bourne"]}, {"page": "What I Go to School For", "response": ["\"What I Go to School For\" is the debut single of English pop punk band Busted. It was written by James Bourne, Charlie Simpson, Matt Willis, Steve Robson, and John McLaughlin and produced by Steve Robson. The song was inspired by a teacher that Matt Willis had a crush on at school.", "Matt Willis told the Essex Chronicle that the song came about after a night out in TOTs 2000 (now known as Talk nightclub) in James Bourne's hometown of Southend-on-Sea. \"We were too young, we got drunk and went to TOTs,\" Willis said. \"Then we walked home and continued drinking on the way – it took us ages. When we got back to James' house, we went to his bedroom and just picked up the guitar and that’s when we started writing What I Go to School For.\"", "What I Go to School For became the title of a musical theatre productionhttp://www.youthmusictheatreuk.org/thebustedmusical produced by Youth Music Theatre UK following the story of Busted from their origins in Southend-on-Sea, Essex, through to their break-up in 2005. The musical was written by Elliot Davis with songs from the Busted albums and new music by James Bourne. It was directed by Steven Dexter and played at the Theatre Royal, Brighton in 2016.", "Category:Songs written by James Bourne"]}, {"page": "Kevin Wallace", "response": ["In 2012 Wallace was a co-producer on the musical, Loserville, by Elliot Davis and James Bourne, at The Quarry Theatre, West Yorkshire Playhouse, Leeds. Loserville transferred from West Yorkshire Playhouse to The Garrick Theatre in London's West End in October 2012, and received a Best New Musical 2013 Olivier Awards nomination."]}, {"page": "Puerto Rico Reconstruction Administration", "response": ["The first New Deal agency created to improve conditions in Puerto Rico was the Puerto Rico Emergency Relief Administration (PRERA) in 1933. The PRERA worked under the authority of the Federal Emergency Relief Administration (FERA) and through matching grants would provide direct relief funding and the creation of jobs through public works initiatives. Under its directors, the Roosevelt appointee James Bourne, and the island's governor, the American Robert H. Gore, the PRERA received only $770,000 from the federal government due to oversights in application processes. By the fall of 1933, the PRERA was unable to keep up with the flood of relief applications from Puerto Ricans, which totaled approximately 50,000 per month. Adding to the program's relative ineffectiveness was the 1933 implementation of an agricultural tax under the Agricultural Adjustment Act (AAA). The tax was leveled on surplus crops and served to increase food prices for Puerto Rican families who were already at a financial breaking point. The PRERA's primary successes came with its implementation of disease control measures, the building highway infrastructure, and in its distribution of food to needy families."]}, {"page": "Year 3000", "response": ["\"Year 3000\" was written by James Bourne. It was inspired by his obsession with Back to the Future, hence the references to the flux capacitor and the fact that the time machine mentioned is \"like the one in a film I've seen\". Bourne has also stated that the song was also inspired by Robbie Williams' 1998 hit, \"Millennium\".Archived at Ghostarchive and the Wayback Machine: ", "The music video for the song begins with Matt Willis playing a video game called \"Stay Alive\". When he loses, the video zooms out to view the band playing the song's intro in a bedroom. After Charlie Simpson starts singing, they hear an explosion-like sound outside. They look out of a window to the backyard and find their neighbour Peter, played by James Bourne's brother Chris, standing next to a Vauxhall Viva customised like the DeLorean time machine from Back to the Future. They get in the car and Peter takes them to the future. The song continues as they go through a time vortex, and arrive in the year 3000. They see many changes, such as various aliens, flying cars and the fact that everyone now lives under the ocean. They also see three triple-breasted women, one of whom throws her bra at them and the three boys fight over it.", "In November 2016, in an interview with PopBuzz, Busted were asked what they thought of the Jonas Brothers' cover of the song. Matt Willis responded: \"Dude, they paid my mortgage for four years, I'm stoked to bits. Thank you very much Jonas Brothers,\" whilst James Bourne said, \"The thing about it is that...when I heard their version of it, I didn't really like it. But there has been some really good things that have happened as a result of it. I didn't like how they changed words around. But the thing is, what's mental is that \"Year 3000\" was synced in The Simpsons [episode \"Mathlete's Feat\"] recently...But the thing is, when I asked them to do that, they already had chosen to use the original version. And the thing is I don't think they'd have been aware of the song if that hadn't have happened. So we ended up getting our version on The Simpsons which was cool. If someone had said to me all those years ago 'if you let them do it you'll get your song on The Simpsons I would have done it immediately.\" In 2019 at the Capital’s Summertime Ball 2019, Busted and Jonas Brothers performed the song together live.", "Category:Songs written by James Bourne"]}, {"page": "Air Hostess (song)", "response": ["The song was inspired by flight attendants which Busted saw whilst on tour. The B-sides \"Mummy Trade\", \"Peaches\" and \"Let It Go\" did not appear on any other release, and were exclusive to this single. \"Mummy Trade\" was written by James Bourne and Charlie Simpson, \"Let It Go\" was written by Bourne and McFly members Harry Judd and Dougie Poynter, while \"Peaches\" is a cover of The Presidents of the United States of America. They were occasionally played live, such as on CD:UK which was on 1 May 2004 on ITV1.", "Category:Songs written by James Bourne"]}, {"page": "Thunderbirds / 3AM", "response": ["\"Thunderbirds / 3AM\" was Busted's last single to enter the UK Singles Chart until the release of \"On What You're On\" in 2016, reaching number one. It was the 19th best-selling single of 2004 in the UK and also won the title of 2004 Record of the Year, and received an 8/10 rating from Stylus Magazine. \"3AM\" was later performed by Matt Willis during his 2007 solo tour, and by James Bourne on his 2012 acoustic solo tour.Full Set - James Bourne Acoustic Tour, Manchester Academy 3 12/3/12 14:00. Published 21 January 2013. Retrieved 16 May 2016.", "Category:Songs written by James Bourne"]}, {"page": "Who's David", "response": ["Category:Songs written by James Bourne"]}, {"page": "She Wants to Be Me", "response": ["Category:Songs written by James Bourne"]}, {"page": "You Said No", "response": ["\"You Said No\" (also known by its original title, \"Crash and Burn\") is a song by English pop punk band Busted. It was released on 21 April 2003 as the third single from their debut studio album Busted (2002). The song was written by band members James Bourne, and Charlie Simpson, and was produced by Robson and Graham Stewart. \"You Said No\" became Busted's first song to reach number one on the UK Singles Chart.", "In 1000 UK Number One Hits by Jon Kutner and Spencer Leigh, James Bourne recalled: \"I remember we sat down for a writing session and Charlie was talking about being blown out by a girl. He said 'I crashed and burned' which was something I had never heard before. Then we tied it in with a song we already had about a girl who was so fit and she knew it and we renamed it 'You Said No.'\"", "In the video for the song, Busted try to impress some girls by doing bike stunts at a rally, before being bettered by more experienced riders. Despite this, the video suggests that the singers find someone afterwards: an attractive nurse, played by Lucy Finnigan. When the video first aired on television, the fictitious name shown at the beginning for James Bourne's character was 'Callum Cowan'. This was a private joke and was later changed.", "Category:Songs written by James Bourne"]}, {"page": "Ticket Outta Loserville", "response": ["Category:Songs written by James Bourne"]}]}}