{"wiki_id": "http://www.wikidata.org/entity/Q3752739", "itemLabel": "Frederick Kerr", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Kerr", "wikipedia_page": {"main": "Frederick Kerr (born Frederick Grinham Keen, 11 October 1858 – 3 May 1933) was an English actor who appeared on stage in both London and New York and in British and American films; he also worked as a major theatrical manager in London.", "link_mentions": [{"page": "1933", "response": ["* May 3 – Frederick Kerr, English actor (b. 1858)"]}, {"page": "Frankenstein (1931 film)", "response": ["* Frederick Kerr as Baron Frankenstein", "Actors who worked on the project either were, or shortly became familiar to the fans of the Universal horror films. These included Frederick Kerr as the old Baron Frankenstein, Henry's father; Lionel Belmore as Herr Vogel, the Bürgermeister; Marilyn Harris as Little Maria, the girl the Monster accidentally kills; Dwight Frye as Frankenstein's hunchbacked assistant, Fritz; and Michael Mark as Ludwig, Maria's father. "]}, {"page": "Captain Brassbound's Conversion", "response": ["The play was first performed at the Stage Society on 16 December 1900, at the Strand Theatre. A production in Manchester at the Queen's Theatre followed on 12 May 1902. The first London production was at the Royal Court, 20 March 1906 with Ellen Terry as Cicely Waynflete and Frederick Kerr as Brassbound.Violet M. Broad & C. Lewis Broad, Dictionary to the Plays and Novels of Bernard Shaw, A. & C. Black, London, 1929, p.217."]}, {"page": "List of Old Carthusians", "response": ["*Frederick Kerr (1858–1933), English actor"]}, {"page": "Waterloo Bridge (1931 film)", "response": ["* Frederick Kerr as Major Wetherby"]}, {"page": "John Kerr (actor)", "response": ["Kerr was born November 15, 1931, in New York City to British-born Geoffrey Kerr and American-born June Walker.  Both were stage and film actors, and his grandfather was Frederick Kerr, a British trans-Atlantic character actor  in the period 1880–1930; Kerr developed an early interest in following in their footsteps.", "He made The Cobweb for MGM, who liked his work so much they co-starred him with Leslie Caron in Gaby (1956), the third remake of Waterloo Bridge, which, in its original pre-Code 1931 version, featured John's grandfather, actor Frederick Kerr."]}, {"page": "1858 in the United Kingdom", "response": ["* 11 October – Frederick Kerr, actor (died 1933)"]}, {"page": "Honor of the Family", "response": ["*Frederick Kerr – Paul Barony"]}, {"page": "List of British films before 1920", "response": ["| The Lifeguardsman || Frank G. Bayley || Frederick Kerr, A.E. Matthews, Leslie Henson || Adventure ||"]}, {"page": "List of American films of 1931", "response": ["|Frankenstein||James Whale||Boris Karloff, Frederick Kerr, Mae Clarke||Horror, Science fiction|| Universal", "|Waterloo Bridge||James Whale||Mae Clarke, Bette Davis, Frederick Kerr||Drama, War|| Universal; Remake of 1940 film"]}, {"page": "Kerr (surname)", "response": ["* Frederick Kerr (1858–1933), English actor"]}, {"page": "The Devil to Pay!", "response": ["The Devil to Pay!  is a 1930 American pre-Code romantic drama film directed by George Fitzmaurice and starring Ronald Colman, Frederick Kerr, Myrna Loy, and Loretta Young. It was written by Frederick Lonsdale and Benjamin Glazer.", "*Frederick Kerr as Lord Leland"]}, {"page": "Raffles (1930 film)", "response": ["* Frederick Kerr as Lord Harry Melrose"]}, {"page": "The Lady of Scandal", "response": ["* Frederick Kerr as Lord Trench "]}, {"page": "List of British actors", "response": ["* Frederick Kerr (1858–1933)"]}, {"page": "The Real Thing at Last", "response": ["*Frederick Kerr - Murdered", "Although nominally directed by L. C. MacBean, Barrie took an active role in its direction. The film featured several popular British stage actors of the period, and thus served as the film debuts of Edmund Gwenn, Marie Lohr, Ernest Thesiger, and Frederick Kerr. Pauline Chase had been part of the original cast of Barrie's Peter Pan and played the title role for seven years; she came out of retirement for this, her only screen performance."]}, {"page": "Ronald Colman filmography", "response": ["| Kay Francis, Frederick Kerr, Bramwell Fletcher, Frances Dade", "| Loretta Young, Frederick Kerr, Myrna Loy"]}, {"page": "Friends and Lovers (film)", "response": ["* Frederick Kerr as General Thomas Armstrong"]}, {"page": "The Man from Toronto (1933 film)", "response": ["The Man from Toronto is a 1933 British romantic comedy film directed by Sinclair Hill and starring Jessie Matthews, Ian Hunter and Frederick Kerr. After an inheritance is left to them if they marry, an Englishwoman and a Canadian must meet for the first time to investigate the other - with comedic results. Matthews was considered a rising film star at the time of the production, and she quickly became one of Gainsborough Pictures' leading names.", "Lawyer Bunston (Frederick Kerr) informs Englishwoman Leslie Farrar (Jessie Matthews), his niece by marriage, that she will inherit a quarter of a million if she marries Canadian Fergus Wimbush. The trouble is they have never met. Leslie is furious, certain that the deceased made the will to get back at her for not marrying him by pressuring her to wed his nephew. When Leslie refuses to comply with the condition, Bunston lets Mrs. Hubbard's cottage for Leslie, as she must cut down on her expenses.", "* Frederick Kerr as Bunston (as Fred Kerr)"]}, {"page": "The Midshipmaid", "response": ["The Midshipmaid is a 1932 British comedy film directed by Albert de Courville and starring Jessie Matthews, Frederick Kerr, Basil Sydney and Nigel Bruce. The film is based on the 1931 play of the same title by Ian Hay and Stephen King-Hall. it was released in the U.S. as Midshipmaid Gob. John Mills makes his film debut in a supporting role. It was shot at the Lime Grove Studios, with sets designed by the art director Alfred Junge.", "*Frederick Kerr as Sir Percy Newbiggin"]}, {"page": "Geoffrey Kerr", "response": ["Geoffrey Kemble Grinham Keen was born on 26 January 1895, in London, the son of character actor and theatrical manager Frederick Kerr and Lucy Dowson. After college, he appeared in several of his father's theatrical productions."]}, {"page": "Lord of the Manor (film)", "response": ["Lord of the Manor is a 1933 British comedy film directed by Henry Edwards and starring Betty Stockfeld, Frederick Kerr and Henry Wilcoxon. It was based on a play by John Hastings Turner. It was made at British and Dominion Elstree Studios as a quota film for release by Paramount Pictures.Chibnall p.273", "* Frederick Kerr as Sir Henry Bovey"]}, {"page": "List of Elstree Studios productions", "response": ["| Lord of the Manor || rowspan=\"2\" | Comedy || Henry Edwards || Betty Stockfeld, Frederick Kerr, Henry Wilcoxon"]}, {"page": "Born to Love (film)", "response": ["* Frederick Kerr as Lord James Ponsonby"]}, {"page": "Victory and Peace", "response": ["* Frederick Kerr as Sir Richard Arkwright"]}, {"page": "12.10", "response": ["* Frederick Kerr as Doctor Wrightman"]}, {"page": "List of lost silent films (1915–1919)", "response": ["|Edmund Gwenn, Marie Lohr, Ernest Thesiger, Frederick Kerr, Pauline Chase"]}, {"page": "Lovers Courageous", "response": ["Lovers Courageous is a 1932 American pre-Code drama film directed by Robert Z. Leonard and written by Frederick Lonsdale. The film stars Robert Montgomery, Madge Evans, Roland Young, Frederick Kerr, Reginald Owen and Beryl Mercer. The film was released on January 23, 1932, by Metro-Goldwyn-Mayer.", "On the Royal Naval Base in Simon's Town, South Africa, we meet Mary Blayne (Madge Evans), who has just gotten into an argument with her father, Admiral Blayne (Frederick Kerr). Mary hates being in South Africa and wishes to leave, but her mother won't be leaving for at least six weeks. She talks about finding life to be terribly dull, and she wishes she had more to be excited about and to look forward to.", "*Frederick Kerr as Admiral"]}, {"page": "But the Flesh Is Weak", "response": ["*Frederick Kerr as Duke of Hampshire"]}, {"page": "Frederick Keen", "response": ["* Frederick Kerr (Frederick Grinham Keen, 1858–1933), English actor"]}, {"page": "Frederick Grinham Keen", "response": ["#Redirect Frederick Kerr"]}, {"page": "Beauty and the Boss", "response": ["* Frederick Kerr as Count Von Tolheim  "]}, {"page": "Always Goodbye (1931 film)", "response": ["* Frederick Kerr as Sir George Boomer  "]}, {"page": "The High Road (play)", "response": ["The High Road is a comedy play by the British writer Frederick Lonsdale which was first staged in 1927. It opened in the  West End at the Shaftesbury Theatre, and ran for 234 performances.Nicoll p.417 The following year, it opened on Broadway at the Fulton Theatre, where ran for 144 performances,  with Alfred Drayton and Frederick Kerr from the London cast."]}, {"page": "Fred Kerr", "response": ["#REDIRECT Frederick Kerr"]}]}}