{"wiki_id": "http://www.wikidata.org/entity/Q3760433", "itemLabel": "George Baker", "itemDescription": "English singer, born 1885", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Baker_(baritone)", "wikipedia_page": {"main": "George Baker (10 February 1885 – 8 January 1976) was an English singer.  He is remembered for singing on thousands of gramophone records in a career that spanned 53 years, beginning in 1909.  He is especially associated with the comic baritone roles in recordings of the Gilbert & Sullivan operas.", "link_mentions": [{"page": "Die Fledermaus", "response": ["|George Baker"]}, {"page": "Birkenhead", "response": ["In the arts, Birkenhead has produced several actors and performers including Lionel Gamlin, Roger Abbott, Glenda Jackson, Anew McMaster, Lewis Collins, Megs Jenkins, Taron Egerton, Patricia Routledge, Paul O'Grady (also known as Lily Savage), soprano Valerie Masterson and baritone George Baker. The dancer and actor Lindsay Kemp was born in the town but as a child moved to South Shields. Nadine Meisner, \"Lindsay Kemp: How the lost boy of dance found his feet\", The Independent, 28 January 2002. Retrieved 25 August 2018 Opera director Graham Vick was born in Birkenhead."]}, {"page": "George Baker", "response": ["George Baker may refer to:", "*George Baker (actor) (1931–2011), British film and television actor", "*George Baker (art historian) (born 1970), American art historian", "*George Baker (Indian actor) (born 1946), Indian actor and politician", "*George Baker (baritone) (1885–1976), British singer", "*George Baker (cartoonist) (1915–1975), Sad Sack comic strip", "*George Baker (Dutch singer) (born 1944), Dutch singer and songwriter", "**George Baker Selection, Dutch pop music group featuring George Baker", "*George Baker (organist) (1773–1847), English musician", "*George Baker (Canadian politician) (born 1942), Canadian Senator", "*George Baker (died 1723), British politician", "*Father Divine ( 1876–1965), U.S. religious leader whose real name was possibly George Baker", "*George Baker (bishop) ( 1661–1665), Bishop of Waterford and Lismore", "*George Baker (Archdeacon of Totnes) (1687–1772), British Anglican priest", "*George Baker (Dean of Antigua) (fl. 1926–1970), Barbadian Anglican priest", "*A. George Baker (1849–1918), American Protestant clergyman who converted to Islam", "*George Baker (baseball) (1857–1915), Major League Baseball player", "*George Baker (cricketer, born 1838) (1838–1870), English cricketer, played for Kent", "*George Baker (cricketer, born 1849) (1849–1879), English cricketer, played for Middlesex", "*George Baker (cricketer, born 1862) (1862–1938), English cricketer, played for Yorkshire and Lancashire", "*George Baker (New Zealand cricketer) (1895-1962), New Zealand cricketer", "*George Baker (footballer) (born 1936), Wales international footballer", "*George Baker (jockey), English jockey", "*George Baker (judge) (1910–1984), British judge", "*George Baker (inventor) (1844–1894), American submarine inventor", "*George Baker (surgeon) (1540–1600), English surgeon", "*George Baker (topographer) (1781–1851), topographer and historian of Northampton, England", "*George Baker (geologist) (1908–1975), Australian mineralogist and academic", "*Sir George Baker, 1st Baronet (1722–1809), British physician"]}, {"page": "Isobel Baillie", "response": ["Baillie had been a pioneer broadcaster, singing on a local Manchester radio station in 1920, before the foundation of the BBC, and in 1938 she took part in an early television broadcast of opera, singing with the tenor Walter Widdop and baritone George Baker in a BBC transmission of Act 2 of Tristan und Isolde.\"Television\", Radio Times, 21 January 1938, p. 16 She frequently sang excerpts from Wagner and other operas in concert and studio performance,\"Wagner, Isobel Baillie\", BBC Genome. Retrieved 12 September 2020 but rarely appeared in the opera house. She did so at Covent Garden in 1937 for Orphée et Eurydice, but even then she was not seen, but provided the offstage voice of \"L'ombre heureuse\".\"Music this Week\", The Times, 14 June 1937, p. 21 Her only onstage appearances in opera were in 1940 on a tour of New Zealand as Marguerite in Faust with Heddle Nash in the title role. \"Music Festival\", New Zealand Herald, 7 June 1940, p. 4"]}, {"page": "Harold Fraser-Simson", "response": ["Fraser-Simson is also known for his many settings of children's verse by A. A. Milne and Kenneth Grahame, including the music for a children's play based on the latter's The Wind in the Willows entitled Toad of Toad Hall (1929), which was successful and enjoyed many revivals. His settings of Milne's verse include a children's song cycle The Hums of Pooh, based on verses from Winnie-the-Pooh and The House at Pooh Corner. This was included in Julian Slade's 1970 adaptation of Winnie-the-Pooh. Fraser-Simson published six volumes of songs setting verses from Milne's When We Were Very Young. A number were first recorded for HMV in 1926 by George Baker, accompanied by the composer, and later again accompanied by Gerald Moore in 1930.Gammond, Peter. Sleeve notes to EMI LP HQM 1200 (1970) His other songs included the collection Teddy Bear and Other Songs and songs from Alice in Wonderland, which were published in 1932 and recorded by Baker and Moore the same year. Baker later recalled Fraser-Simson as \"a very polite, retiring man, looking more like a businessman than a composer of successful musicals.\""]}, {"page": "Henry Lytton", "response": ["George Baker, who sang several of Lytton's roles in HMV recordings in the 1920s and 1930s, later described Lytton's voice as \"light, tenory, thinnish\", but added that in the theatre \"he persuaded me that he was a good baritone – he wasn't, really, but he was such a supreme actor … that he could persuade you he could sing splendidly\".\"George Baker Recollects\", Side one, track three of Pearl LP set \"The Art of the Savoyard\", 1974  By the time HMV began using D'Oyly Carte principals in its recordings of the Savoy operas in the mid-1920s, Lytton's voice was not thought suitable for the gramophone, and he was included in only Princess Ida in 1924 (acoustic) and 1932 (electrical), The Mikado in 1926, The Gondoliers in 1927, and H.M.S. Pinafore in 1930, his other roles being sung by Baker.Rollins and Witts, pp. XI–XIII When the 1930 H.M.S. Pinafore was released, Cardus wrote in The Manchester Guardian, \"It was high time something was done to send down to posterity the genius of the greatest of all surviving artists in Gilbert and Sullivan. The omission of Lytton's voice from the [1930] Iolanthe was a blunder of the first importance … there is no mistaking the Lytton accent, the old kindly yet pungent tones\".Cardus, Neville. \"Gramophone Music\", The Manchester Guardian, 27 August 1930, p. 7"]}, {"page": "Baker (surname)", "response": ["** Charles George Baker (1830–1906), British recipient of the Victoria Cross", "* George Baker (disambiguation), multiple people", "** George Baker (surgeon) (1540–1600), English surgeon", "** George Baker (bishop) (fl. 1661–1665), Bishop of Waterford and Lismore", "** George Baker (archdeacon of Totnes) (1687–1772), British Anglican priest", "** Sir George Baker, 1st Baronet (1722–1809), British physician", "** George Baker (organist) (1773–1847), English musician", "** George Baker (topographer) (1781–1851), topographer and historian of Northampton, England", "** George Baker (inventor) (1844–1894), American submarine pioneer", "** George Baker (cricketer, born 1849) (1849–1879), English cricketer", "** George Baker (baseball) (1857–1915), Major League Baseball player", "** George Baker (cricketer, born 1862) (1862–1938), British cricketer", "** George Baker (baritone) (1885–1976), British singer", "** George Baker (judge) (1910–1984), British judge", "** George Baker (cartoonist) (1915–1975), Sad Sack comic strip", "** George Baker (dean of Antigua) (fl. 1926–1970), Barbadian Anglican priest", "** George Baker (actor) (1931–2011), British film and television actor", "** George Baker (footballer) (born 1936, birth name Thomas George Baker), Welsh international footballer", "** George Baker (Dutch singer) (born 1944), Dutch singer and songwriter", "** George Baker (Indian actor) (born 1945), Indian actor and politician", "** George Baker (art historian) (fl. 2003–present), American art historian"]}, {"page": "Malcolm Sargent discography", "response": ["**The Death of Minnehaha: Elsie Suddaby, Howard Fry, George Baker, Royal Choral Society, Orchestra, HMV, 1931", "*** (abridged): George Baker, Webster Booth, Sydney Granville, Derek Oldham, Leslie Rands, Leonard Hubbard, Stuart Robertson, Essie Ackland, Nellie Walker, Alice Moxon, Muriel Dickson, Beatrice Elburn, Phyllis Evens, chorus and orchestra, HMV, 1931 ", "*** Henry Lytton, George Baker, Charles Goulding, Darrell Fancourt, Sydney Granville, Stuart Robertson, Elsie Griffin, Bertha Lewis, Nellie Briercliffe, chorus and orchestra, HMV, 1930", "*** George Baker, John Cameron, Richard Lewis, Owen Brannigan, James Milligan, Elsie Morison, Monica Sinclair, Marjorie Thomas, Glyndebourne Festival Chorus, Pro Arte Orchestra", "*** George Baker, Darrell Fancourt, Derek Oldham, Sydney Granville, Leslie Rands, Bertha Lewis, Nellie Briercliffe, Alice Moxon, Nellie Walker, Winifred Lawson, Chorus and Light Opera Orchestra, chorus and orchestra, HMV, 1930", "*** George Baker, Ian Wallace, Alexander Young, Owen Brannigan, John Cameron, Monica Sinclair, Marjorie Thomas, April Cantelo, Heather Harper, Elsie Morison, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1959", "*** Darrell Fancourt, Martyn Green, Derek Oldham, George Baker, Leslie Rands, Nellie Briercliffe, Marjorie Eyre, Rita Mackay, Bertha Lewis, Winifred Lawson, chorus and orchestra, HMV, 1931", "*** John Shaw, Trevor Anthony, Alexander Young, George Baker, John Cameron, Marjorie Thomas, Elizabeth Harwood, Heather Harper, Monica Sinclair, Elsie Morison, Glyndebourne Festival Chorus, Pro Arte Orchestra, HMV, 1962", "*** George Baker, Peter Dawson, Stuart Robertson, Derek Oldham, Leo Sheffield, Elsie Griffin, Nellie Briercliffe, Nellie Walker, Dorothy Gill, chorus and orchestra, HMV, 1929", "*** (abridged): George Baker, Darrell Fancourt, Stuart Robertson, Derek Oldham, Sydney Granville, Muriel Dickson, Bertha Lewis, chorus and orchestra, HMV, 1931", "*** George Baker, James Milligan, John Cameron, Richard Lewis, Owen Brannigan, Elsie Morison, Heather Harper, Marjorie Thomas, Monica Sinclair, Glyndebourne Festival Chorus, Pro Arte Orchestra, HMV", "*** Richard Watson, Derek Oldham, Charles Goulding, George Baker, Henry Lytton, Darrell Fancourt, Stuart Robertson, Edward Halland, Muriel Dickson, Dorothy Gill, Alice Moxon, Nellie Briercliffe, Phyllis Evens, chorus and orchestra, HMV, 1932 ", "*** George Baker, Derek Oldham, Sydney Granville, Stuart Robertson, Muriel Dickson, Nellie Briercliffe, Dorothy Gill, Alice Moxon, Darrell Fancourt, chorus and orchestra, HMV, 1931", "*** George Baker, Richard Lewis, Owen Brannigan, Harold Blackburn, Elsie Morison, Pamela Bowden, Monica Sinclair, Elizabeth Harwood, Joseph Rouleau, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1963 ", "**Trial by Jury: George Baker, Elsie Morison, Richard Lewis, John Cameron, Owen Brannigan, Bernard Turgeon, Pro Arte Orchestra, Glyndebourne Festival Chorus, HMV, 1961", "*** Arthur Hosking, Derek Oldham, Peter Dawson, Walter Glynne, George Baker, Leo Sheffield, L Gowings, Henry Millidge, Winifred Lawson, Nellie Briercliffe, Dorothy Gill, Elsie Griffin, chorus and orchestra, HMV, 1929 ", "*** (abridged) George Baker, Sydney Granville, Derek Oldham, Muriel Dickson, Beatrice Elburn, Nellie Walker, chorus and orchestra, HMV, 1931"]}, {"page": "Waltz Time (1933 film)", "response": ["* George Baker as Orlovsky"]}, {"page": "George Baker (record singer)", "response": ["#REDIRECT George Baker (baritone)"]}, {"page": "Bessie Jones (Welsh singer)", "response": ["Jones was raised in Tonypandy the daughter of John Jones, a fruiterer. Jones studied at the Royal College of Music, where she won the operatic class prize in 1910 and the Henry Leslie prize for singers in 1912.\"The Royal College of Music\", The Times, 25 Match 1910, p. 6; and \"Royal College of Music Exhibitions\", The Times, 1 April 1912, p. 12 In the college's 1911 production of Cherubini's opera The Water Carrier, Jones starred alongside George Baker under the direction of Richard Temple and Sir Charles Stanford.\"Royal College of Music Operatic Performance\", The Times, 22 November 1911. p. 10 She sang at the Proms in 1913 under Sir Henry Wood,\"The Promenade Concerts\", The Times, 22 August 1913, p. 6 and played Wellgunde and the Woodbird in Wagner's Ring cycle at Covent Garden under Artur Nikisch in 1914.\"The Covent Garden Season – Das Rheingold\", The Manchester Guardian, 22 April 1914, p. 5 The Manchester Guardian called her, \"a new soprano with a sweet voice of considerable power.\"\"The London Promenade Concerts\", The Manchester Guardian, 22 August 1913, p. 9"]}, {"page": "The Pirates of Penzance discography", "response": ["|James Milligan,Elsie Morison,Monica Sinclair,Richard Lewis,George Baker,John Cameron,Owen Brannigan,Heather Harper"]}, {"page": "Arlette (musical)", "response": ["A cast album was released in 1917 recorded with the Mayfair Orchestra.Arlette: Original London Cast, CastAlbums.org, accessed 15 May 2019 Another album, titled \"Gems from Arlette', was released by HMV in 1917 with the Light Opera Company and featured: \"Love In My Heart Is Ringing (The Telephone Song)\", \"The Fairy Ring\", \"His Country First of All\", \"The People’s King\", \"On the Staff\", \"Didn’t Know the Way To\", \"Cousinly Love\" and \"It’s Just a Memory\". It was conducted by George W. Byng, and the vocal artistes included George Baker, Bessie Jones and Ernest Pike.Gems from Arlette\", the  Light Opera Company, CastAlbums.org, accessed 15 May 2019"]}, {"page": "Toy Symphony (Arnold)", "response": ["The piece was first performed at a Savoy Hotel fund raising dinner in London on 28 November 1957 by a group of eminent composers, musicians and personalities: Denis Truscott (who was Lord Mayer of London in 1957), Thomas Armstrong, Edric Cundell, W Greenhouse Alt (Edinburgh organist, 1889–1969), Gerard Hoffnung, Eileen Joyce, Steuart Wilson, George Baker, David McBain (director, Royal Military School of Music), Leslie Woodgate, Eric Coates (just three weeks before his death) and Astra Desmond, with the Amici String Quartet and Joseph Cooper, piano. It was conducted by the composer. The work is dedicated to the Musicians Benevolent Fund. A score was published in 1958 by Paterson.Craggs, Stewart R. Malcolm Arnold: A Bio-bibliography (1998), p 39Meredith, Anthony and Harris, Paul. Malcolm Arnold (2004), p 158n"]}]}}