{"wiki_id": "http://www.wikidata.org/entity/Q376243", "itemLabel": "Fraser Stoddart", "itemDescription": "Scottish chemist and Nobel Laureate in 2016 for the design and synthesis of molecular machines", "wikipedia_url": "https://en.wikipedia.org/wiki/Fraser_Stoddart", "wikipedia_page": {"main": "Sir James Fraser Stoddart  (born 24 May 1942) is a British-American chemist who is Board of Trustees Professor of Chemistry and head of the Stoddart Mechanostereochemistry Group in the Department of Chemistry at Northwestern University in the United States. He works in the area of supramolecular chemistry and nanotechnology.  Stoddart has developed highly efficient syntheses of mechanically-interlocked molecular architectures such as molecular Borromean rings, catenanes and rotaxanes utilising molecular recognition and molecular self-assembly processes.  He has demonstrated that these topologies can be employed as molecular switches. His group has even applied these structures in the fabrication of nanoelectronic devices and nanoelectromechanical systems (NEMS). His efforts have been recognized by numerous awards including the 2007 King Faisal International Prize in Science. He shared the Nobel Prize in Chemistry together with Ben Feringa and Jean-Pierre Sauvage in 2016 for the design and synthesis of molecular machines.", "link_mentions": [{"page": "1942", "response": ["** Fraser Stoddart, Scottish-born scientist, recipient of the Nobel Prize in Chemistry"]}, {"page": "2016", "response": ["* Chemistry – Ben Feringa, Jean-Pierre Sauvage, Fraser Stoddart"]}, {"page": "Maxwell's demon", "response": ["Previously, researchers including Nobel Prize winner Fraser Stoddart, created ring-shaped molecules called rotaxanes which could be placed on an axle connecting two sites, A and B. Particles from either site would bump into the ring and move it from end to end. If a large collection of these devices were placed in a system, half of the devices had the ring at site A and half at B, at any given moment in time."]}]}}