{"wiki_id": "http://www.wikidata.org/entity/Q3760470", "itemLabel": "George Connelly", "itemDescription": "Scottish footballer (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Connelly", "wikipedia_page": {"main": "George Connelly (born 1 March 1949) is a Scottish former international footballer who played professionally with Celtic and Falkirk.", "link_mentions": [{"page": "Kenny Dalglish", "response": ["Dalglish signed a professional contract with Celtic in May 1967. The club's assistant manager Sean Fallon went to see Dalglish and his parents at their home, which had Rangers-related pictures on the walls. In his first season, Dalglish was loaned out to Cumbernauld United, for whom he scored 37 goals.Lomax, Andrew (14 February 2008) Kenny Dalglish backs Scottish youngsters The Daily Telegraph (London) Retrieved on 18 June 2009 During this time he also worked as an apprentice joiner. Celtic manager Jock Stein wanted Dalglish to spend a second season at Cumbernauld, but the youngster wanted to turn professional. Dalglish got his wish and became a regular in the reserve team known as the Quality Street Gang, due to it containing a large number of highly rated players, including future Scottish internationals Danny McGrain, George Connelly, Lou Macari and David Hay. Dalglish made his first-team competitive debut for Celtic in a Scottish League Cup quarter-final tie against Hamilton Academical on 25 September 1968, coming on as a second-half substitute in a 4–2 win."]}, {"page": "Danny McGrain", "response": ["Born in Glasgow and raised in the city's Drumchapel area, McGrain played for Queen's Park Strollers and also featured for the Scotland Schools team, where he was scouted and signed for Celtic in May 1967, aged 17. He became one of the so-called 'Quality Street Gang', the great Celtic reserve team that also included players such as Kenny Dalglish, Lou Macari, Davie Hay and George Connelly, who eventually took the places of the ageing Lisbon Lions. At first, McGrain was regarded as a midfielder but was utilised in a variety of roles in the reserve side before becoming established as a right-back. He had a spell at Junior club Maryhill to gain experience playing with adults, and also made a fruitless attempt at a college course in engineering prior to becoming a full-time professional."]}, {"page": "John Hughes (footballer, born 1943)", "response": ["Celtic reached the European Cup final for the second time in 1970, after they defeated English champions Leeds United in both legs of the semi-final. In the first leg, Celtic beat Leeds 1–0 at Elland Road with a goal from George Connelly. The second leg, which was played at Hampden Park in front of almost 140,000 people, was won 2–1 by Celtic. Hughes scored Celtic's first goal in that match, after Billy Bremner had given Leeds an early lead and levelled the aggregate score. Celtic lost the final 2–1 after extra time to Dutch side Feyenoord, with Hughes playing the whole game. Despite playing primarily on the wing, Hughes remains one of Celtic's all-time highest goal scorers (8th in all competitions).(Celtic Alltime Player Records], FitbaStats "]}, {"page": "History of Celtic F.C. (1887–1994)", "response": ["Celtic reached the European Cup Final again in 1970, a run which included a 3–0 win at Parkhead over Portuguese side Benfica in the second round. The semi-finals saw Celtic drawn against English champions Leeds Utd.  This was the first occasion that the reigning champions of England and Scotland had played each other in a fully competitive European tie.  The first leg took place at Elland Road, with a goal in the opening minute from George Connelly giving Celtic a 1–0 lead to take back to Glasgow for the second leg.  The return match was played at Hampden Park on 15 April 1970 in front of a 136,505 crowd,  a record attendance for a competitive European club tie that stands to this day.  In 14 minutes, Billy Bremner scored from long range to level the tie on aggregate.  Celtic kept their composure though, and equalised two minutes into the second half though a John Hughes header.  Jimmy Johnstone had a particularly outstanding match and his mazy run set up Bobby Murdoch to score with a powerful shot, sealing a 2–1 win for Celtic on the night and their progression to the final.", "The early 1970s saw the emergence from the reserves of a group of young players known as the 'Quality Street Gang'.  This group included Danny McGrain, Kenny Dalglish, Davie Hay, Lou Macari and George Connelly; all of whom won major honours at Celtic and were capped by Scotland.  This emerging group of players helped Celtic reach the semi-finals of the European Cup on a further two occasions, losing on penalties to Inter Milan in 1972 and 2–0 on aggregate to Spanish side Atlético Madrid in 1974."]}, {"page": "1972–73 in Scottish football", "response": ["| Footballer of the Year ||  George Connelly || Celtic"]}, {"page": "Oakley United F.C.", "response": ["*  George Connelly"]}]}}