{"wiki_id": "http://www.wikidata.org/entity/Q376085", "itemLabel": "Leonard Borwick", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Borwick", "wikipedia_page": {"main": "Leonard Borwick (26 February 1868 – 15 September 1925) was an English concert pianist especially associated with the music of Robert Schumann and Johannes Brahms.", "link_mentions": [{"page": "Clara Schumann", "response": ["She was the only woman on the faculty. Her fame attracted students from abroad, including Britain and the United States. She trained only advanced pupils, mostly young women, while her two daughters gave lessons to beginners. Among her 68 known students who made a musical career were Natalia Janotha, Fanny Davies, Nanette Falk, Amina Goodwin, Carl Friedberg, Leonard Borwick, Ilona Eibenschütz, Adelina de Lara, Marie Olson and Mary Wurm. The Konservatorium held events to celebrate her 50th year on stage in 1878 and her 60th career anniversary ten years later. She held the teaching post until 1892 and contributed greatly to the improvement of modern piano playing technique."]}, {"page": "Walthamstow", "response": ["* Leonard Borwick, concert pianist, born in 1868."]}, {"page": "Frederick Septimus Kelly", "response": ["After leaving Oxford with fourth-class honours in history, Kelly studied the piano under Iwan Knorr at the Hoch Conservatory in Frankfurt, alongside members of the Frankfurt Group. On his return to London in 1908 he acted as an adviser to the Classical Concert Society and used his influence in favour of the recognition of modern composers. At this time he met and became a close friend of Leonard Borwick, probably England's finest pianist at the time. In 1911 he visited Sydney and gave some concerts, and in 1912 took part in chamber music concerts in London. He performed with Pablo Casals, and he helped organise a concert in London by Maurice Ravel, on 17 December 1913 at the Bechstein Hall.", "Kelly's final piece was the Somme Lament, completed in October 1916, just two weeks before he died during the Somme campaign. It was completed in piano score. Christopher Latham orchestrated the work for a 2020 recording.Frederick Septimus Kelly: Orchestral Works, ABC Classics 481 8890 (2020) At the memorial concert held at the Wigmore Hall, London on 2 May 1919, some of his piano compositions were played by Leonard Borwick, and some of his songs were sung by Muriel Foster. The centrepiece of the concert was the Elegy for String Orchestra, written at Gallipoli in memory of Rupert Brooke, a work of profound feeling. Frank Bridge was the conductor – he had conducted its first performance at Rugby School on 28 March 1916.Musik Production Hoeflich"]}, {"page": "Nocturnes (Debussy)", "response": ["The complete work was transcribed in 1910 for two pianos by Maurice Ravel and Raoul Bardac (Debussy's pupil and stepson), and was first performed in 1911. Fêtes was arranged for solo piano by the English pianist Leonard Borwick, and the arrangement has been recorded by Emil Gilels, among others. Fêtes has also been transcribed for large symphonic wind ensemble by Merlin Patterson and William Schaefer."]}, {"page": "List of classical pianists", "response": ["* Leonard Borwick"]}, {"page": "Dichterliebe", "response": ["Although frequently associated with the male voice, the work was dedicated to the great soprano Wilhelmine Schröder-Devrient,E. Sackville-West and D. Shawe-Taylor, The Record Guide (Collins, London 1951), 538. so that the precedent for performance by a female voice is primary. The first complete public recital of the work in London was given by Harry Plunket Greene, accompanied from memory by Leonard Borwick, on 11 January 1895 at St James's Hall.H. Plunket Greene, From Blue Danube to Shannon (Philip Allan, London 1934), 83–84."]}, {"page": "Briarcliff College", "response": ["Mrs. Dow's also held lessons in ear training, elementary harmony, guitar, mandolin, piano, singing, and violin. The school also held occasional informal recitals, and allowed students to attend operas and concerts in New York City. Concerts and lectures were held at the school by notable artists, including Daniel Gregory Mason, Guiomar Novaes, Leonard Borwick, Percy Grainger, Efrem Zimbalist, Emilio de Gogorza, the Flonzaley Quartet, and the Kneisel Quartet."]}, {"page": "Fanny Davies", "response": ["Like Leonard Borwick (another Clara Schumann pupil and accompanist in lieder to Harry Plunket Greene), she 'embodied in a remarkable degree the unique qualities of the romantic school of which ... Clara Schumann was admittedly the most spontaneous and finished exponent. The success of these two native artists was destined to afford great encouragement to rising students both in England and on the continent. It also helped to create among the general mass of amateurs a taste for pianoforte playing of a more warm-blooded type than had hitherto satisfied them', wrote Herman Klein in c. 1891. Davies also published musicological articles (e.g. on Schumann's music, Musical Times August 1911, and on Brahms's own playing and tempi in the C minor Piano Trio, Op. 101, in Cobbett's Cyclopedic Survey of Chamber Music) and gave musical lectures. An article about her appeared in the Musical Times for June 1905."]}, {"page": "Harry Plunket Greene", "response": ["== Recitals – partnership with Leonard Borwick ==", "During the 1890s (from 1893) Plunket Greene became one of the foremost British performers and interpreters of the German Lieder, especially of Schubert, Schumann and Brahms. This he did in association with the English pianist Leonard Borwick (the brother of a schoolfriend), a Frankfurt pupil of Clara Schumann's noted for his powerful rhythmic delivery, and who (like his fellow-pupil Fanny Davies) was closely involved in the London work of Joseph Joachim. Plunket Greene and Borwick formed a musical friendship which lasted until Borwick's death."]}, {"page": "Hoch Conservatory", "response": ["* Leonard Borwick"]}, {"page": "St James's Hall", "response": ["F. H. Cowen succeeded Sullivan as conductor from 1888–92. In his first season Edvard Grieg played his Piano Concerto in A minor and Pyotr Ilyich Tchaikovsky made his first appearance before an English audience, introducing two works. Johan Svendsen and Charles-Marie Widor also conducted in that season, and Clara Schumann made her farewell performance to the Society. Tchaikovsky returned in 1889 to conduct his Piano Concerto No. 1 with Wassily Sapellnikoff making his English debut (who three years later created a furor with the Liszt E flat concerto); and Agathe Backer-Grøndahl and Eugène Ysaÿe also made their English debuts. In 1890, Dvořák conducted his Fourth Symphony. Paderewski, who gave four recitals at St. James's Hall for his début in 1890, returned there for the Society in 1891 to perform the Saint-Saëns' C minor, and the Rubinstein D minor, concerti. Leonard Borwick and Frederic Lamond also performed there for the Society. Cowen gave many concerts of contemporary English composers such as Sullivan, Hubert Parry, Alexander Mackenzie, Charles Villiers Stanford, and of his own works.Elkin 1946, 82-85.", "The Stock Exchange Orchestral Society, founded 1883, originally played in the Prince's Hall Piccadilly, but transferred to St. James's Hall until 1894, when they moved to Queen's Hall.Elkin 1944, 104. In December 1893 Harry Plunket Greene and Leonard Borwick began their celebrated partnership in lieder recitals at the hall, which continued well into the new century. In 1895, the 16-year-old pianist Mark Hambourg gave a concert there under Henry J. Wood, in which he played three piano concerti."]}, {"page": "Anthony Bernard", "response": ["Anthony Bernard studied with Joseph Holbrooke, John Ireland, Leonard Borwick and Sir Granville Bantock. He was appointed organist at St. Augustine's, Ramsgate in 1910. He worked in some other churches, and also became well known as an accompanist to singers, such as Muriel Foster, who retained him for the rest of her career, and John Coates."]}, {"page": "Ernest Walker (composer)", "response": ["He was assistant organist at Balliol College from 1891 to 1901, and organist from 1901 to 1913 (resigning only because he felt his private views on religion were incompatible with the religious nature of the texts sung by the choir, even though there was no requirement that the organist profess Christian beliefs). He remained at Oxford for the rest of his life, and died there.  He was director of music at Balliol from 1901 to 1925 and organised the Sunday chamber music concerts there, at which he often appeared as a pianist.  He arranged appearances at these concerts by artists such as the baritone Harry Plunket Greene, the tenors Steuart Wilson and Gervase Elwes, the pianists Fanny Davies, Leonard Borwick and Donald Tovey, the violinists Adolf Busch and Jelly d'Arányi, and the violist Lionel Tertis. These concerts often featured works then hardly known in England, such as César Franck's Violin Sonata in A major, and songs by Joseph Marx and Richard Strauss. He was for many years an examiner and member of the Board of Studies for music, and he did much to improve the standard of the B.Mus and D.Mus degrees.  He encouraged many promising musicians, among them the Australian Frederick Septimus Kelly, who was killed in World War I, and Donald Tovey, who became his lifelong friend.  Tovey dedicated his Balliol Dances for piano duet to Ernest Walker."]}, {"page": "Vera Moore", "response": ["From 1917 Moore performed as a soloist and as an accompanist at recitals around the South Island. She moved to England in 1920, where she initially studied piano under her brother Frederick, followed by four years as a pupil of Leonard Borwick. In the 1920s, Moore became friends with the artist Winifred Nicholson, and was the subject in one of Nicholson's paintings, Woman Playing a Piano."]}, {"page": "Interior with an Easel, Bredgade 25", "response": ["The painting was sold from the artist to Leonard Borwick in 1912, who is an enthusiast of Hammershøi's work."]}, {"page": "Borwick, Leonard", "response": ["#redirectLeonard Borwick"]}, {"page": "Borwick (surname)", "response": ["* Leonard Borwick"]}]}}