{"wiki_id": "http://www.wikidata.org/entity/Q3773491", "itemLabel": "Gordon Cullen", "itemDescription": "British architect (1914-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Cullen", "wikipedia_page": {"main": "Thomas Gordon Cullen (9 August 1914 – 11 August 1994) was an influential British architect and urban designer who was a key motivator in the Townscape movement. Cullen presented a new theory and methodology for urban visual analysis and design based on the psychology of perception, such as on the human need for visual stimulation and the notions of time and space. He is best known for the book Townscape, first published in 1961. Later editions of Townscape  were published under the title The Concise Townscape.", "link_mentions": [{"page": "Theories of urban planning", "response": ["* The Concise Townscape, Gordon Cullen, 1961"]}, {"page": "Urban design", "response": ["Urban design theory deals primarily with the design and management of public space (i.e. the 'public environment', 'public realm' or 'public domain'), and the way public places are used and experienced. Public space includes the totality of spaces used freely on a day-to-day basis by the general public, such as streets, plazas, parks, and public infrastructure.  Some aspects of privately owned spaces, such as building facades or domestic gardens, also contribute to public space and are therefore also considered by urban design theory. Important writers on urban design theory include Christopher Alexander, Peter Calthorpe, Gordon Cullen, Andres Duany, Jane Jacobs, Jan Gehl, Allan B. Jacobs, Kevin Lynch, Aldo Rossi, Colin Rowe, Robert Venturi, William H. Whyte, Camillo Sitte, Bill Hillier (Space syntax), and Elizabeth Plater-Zyberk.", "In 1956, the term  “Urban design” was first used at a series of conferences hosted by Harvard University. The event provided a platform for Harvard's Urban Design program. The program also utilized the writings of famous urban planning thinkers: Gordon Cullen, Jane Jacobs, Kevin Lynch, and Christopher Alexander.", "In 1961, Gordon Cullen published The Concise Townscape. He examined the traditional artistic approach to city design of theorists including Camillo Sitte, Barry Parker, and Raymond Unwin. Cullen also created the concept of 'serial vision'. It defined the urban landscape as a series of related spaces."]}, {"page": "Festival of Britain", "response": ["Lettering and type design featured prominently in the graphic style of the Festival and was overseen by a typography panel including the lettering historian Nicolete Gray. A typeface for the Festival, Festival Titling, was specially commissioned and designed by Philip Boydell. It was based on condensed sans-serif capitals and had a three-dimensional form making it suitable for use in exhibition display typography.Berry, W.T., Johnson, A.F., and Jaspert, W.P., The Encyclopaedia of Type Faces, London: Blandford Press, 1963 It has been said to bear \"a vague resemblance to bunting\". The lettering on the Royal Festival Hall and the temporary Festival building on the South Bank was a bold, sloping slab serif letter form, determined by Gray and her colleagues, including Charles Hasler and Gordon Cullen, illustrated in Gray's Lettering on Buildings (1960) and derived in part from typefaces used in the early 19th century. It has been described as a \"turn to a jauntier and more decorative visual language\" that was \"part of a wider move towards the appreciation of vernacular arts and the peculiarities of English culture\". The lettering in the Lion and Unicorn Pavilion was designed by John Brinkley.Alex Seago, Burning the Box of Beautiful Things: The Development of Post-Modern Sensibility, Oxford University Press, 1995John Lewis and John Brinkley, Graphic Design, Routledge and Kegan Paul, 1954"]}, {"page": "Wraysbury", "response": ["Former actor Robert Rietti had a home in Wraysbury, but after his wife died in August 2008, he sold the house in 2009. Former Wraysbury resident Gordon Cullen, an architect renowned for developing the Townscape movement in post-war Britain, designed the Wraysbury Village Hall. It is one of only a few buildings he designed which were actually built. The main store in the village was Wraysbury Stores until its closure in May 2006. The building is Victorian and had been continuously occupied since the late 1800s. It was formerly a post office before becoming a general store. Its neighbours include a garage and fish and chip shop and is opposite the Perseverance pub. There are many shops located on the High Street, and there is also a park including a children's playground which is a popular spot for dog-walkers and kite-flyers. 1st Wraysbury Scouts Group is based on the village green. The village has two railway stations: Wraysbury and Sunnymeads, both on the Staines to Windsor & Eton line from Windsor to London Waterloo.", "* Gordon Cullen – British architect (died 1994)"]}, {"page": "1994 in architecture", "response": ["* August 11 – Gordon Cullen, English architect and urban designer associated with the \"Townscape\" movement (born 1914)"]}, {"page": "1914 in architecture", "response": ["* August 9 – Gordon Cullen, influential English architect and urban designer (died 1994)"]}, {"page": "1961 in architecture", "response": ["*Gordon Cullen - The Concise Townscape"]}, {"page": "Cityscape", "response": ["*Gordon Cullen "]}, {"page": "List of urban theorists", "response": ["* Gordon Cullen"]}, {"page": "Ralph Erskine (architect)", "response": ["During the 1930s, Erskine studied architecture for five years at the Regent Street Polytechnic, London under the direction of Thornton White. At the time, White's curriculum required the study of classical architecture before students were free to follow their own ideas.  One of his fellow students was Gordon Cullen who would become a well-known architectural illustrator, urban designer and theorist. Cullen advocated the improvement of urban settlements through an understanding and analysis of their picturesque qualities. This approach was profoundly influential on Erskine, who insisted in his work that the context and landscaping of his buildings be carefully integrated."]}, {"page": "Royal Designers for Industry", "response": ["* Gordon Cullen, Illustration & townscape design, 1975"]}, {"page": "Architectural Review", "response": ["The journal was influential after the Second World War in raising awareness of \"townscape\" (urban design), partly through regular articles by assistant editor Gordon Cullen, author of several books on the subject.", "*Gordon Cullen – art editor"]}, {"page": "Ian Nairn", "response": ["Nairn admired Nikolaus Pevsner's work (if not his methodology) on the then fledgling Buildings of England series, and had approached Pevsner in the early 1960s as a potential co-author. Pevsner, who wrote about \"Visual Planning and the Picturesque\", was influential on the formation of the Architectural Review's \"Townscape\" series of columns, which evolved into the movement to which Gordon Cullen and Nairn were key contributors."]}, {"page": "Exhibition Road", "response": [" The project also aimed to improve the artistic and architectural merit of the streetscape, and clearly draws inspiration from the work of Gordon Cullen's Townscape. The scheme was completed ahead of the 2012 London Olympics."]}, {"page": "Thomas Cullen", "response": ["* Gordon Cullen (Thomas Gordon Cullen, 1914–1994), British architect and urban designer"]}, {"page": "Society of Architectural Illustrators", "response": ["The present patron of the Society is British painter Ben Johnson. Previous patrons include Sir John Betjeman, Sir Hugh Casson and Gordon Cullen."]}, {"page": "Figure-ground diagram", "response": ["In 1961, Gordon Cullen began the Townscape movement with his well-known book The Concise Townscape, which suggested architecture emphasize the relationship between urban elements– buildings, trees, nature, water, traffic, advertisements, etc. by designing cities at a whole to create an ever-changing urban environment for the pedestrian. Cullen termed this theory “serial vision”  and would require that the figure ground depict a continuous building poche that defined varying manipulated voids."]}, {"page": "Cullen (surname)", "response": ["*Gordon Cullen, English architect"]}, {"page": "1977 Silver Jubilee and Birthday Honours", "response": ["*Thomas Gordon Cullen, Townscape Consultant and Architectural Illustrator."]}, {"page": "History of urban planning", "response": ["* The Concise Townscape, Gordon Cullen, 1961"]}, {"page": "Technical aspects of urban planning", "response": ["* The Concise Townscape, Gordon Cullen, 1961"]}, {"page": "Greenside Primary School", "response": ["The building has a fine top lit mural by artist Gordon Cullen that was restored in 2014.", "Greenside Primary School Erno Goldfinger 02.jpg|Partial view of the mural by Gordon Cullen", "Greenside Primary School Erno Goldfinger 03.jpg|Partial view of the mural by Gordon Cullen"]}, {"page": "Swedish Quays", "response": ["Swedish Quays at 1–95 Rope Street, London, is a group of flats and houses that is Grade II listed with Historic England.National Heritage List: Slough trading estate among new additions. BBC News, 10 May 2018. Retrieved 10 May 2108. It was built between 1996 and 1990 and designed by David Price and Gordon Cullen.Listed postmodern buildings - in pictures. The Guardian, 10 May 2018. Retrieved 10 May 2018."]}]}}