{"wiki_id": "http://www.wikidata.org/entity/Q377327", "itemLabel": "Henry Somerset, 1st Marquess of Worcester", "itemDescription": "Marquess of Worcester", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Somerset,_1st_Marquess_of_Worcester", "wikipedia_page": {"main": "Henry Somerset, 1st Marquess of Worcester (1577 – 18 December 1646) was an English aristocrat, who was a prominent and financially important Royalist during the early years of the English Civil War.", "link_mentions": [{"page": "Worcester County, Maryland", "response": ["Worcester County  is the easternmost county of the U.S. state of Maryland. As of the 2010 census, the population was 51,454. Its county seat is Snow Hill. It is the only county of Maryland that borders the Atlantic Ocean, and the only county bordering both Delaware and Virginia. The county was named for Mary Arundell, the wife of Sir John Somerset, a son of Henry Somerset, 1st Marquess of Worcester. She was sister to Anne Arundell (Anne Arundel County), wife of Cecil Calvert, 2nd Baron Baltimore (Cecil County), the first Proprietor and Proprietary Governor of the Province of Maryland."]}, {"page": "Duke of Beaufort", "response": ["*Henry Somerset, 1st Marquess of Worcester (1577–1646), eldest son of the 4th Earl, was a noted Cavalier"]}, {"page": "Francis Russell, 2nd Earl of Bedford", "response": ["* John Russell, Baron Russell (–1584), who married Elizabeth Hoby, widow of Sir Thomas Hoby and daughter of Sir Anthony Cooke. They had one son, Francis, who died young, and two daughters, which included Anne Russell, wife of Henry Somerset, 1st Marquess of Worcester.David Nash Ford. Royal Berkshire History, Nash Ford Publishing, 2001. Elizabeth Cooke"]}, {"page": "Baron Herbert", "response": ["*Henry Somerset, 1st Marquess of Worcester, 5th Earl of Worcester, 7th Baron Herbert (bef. 1590–1646) (son), in 1643 created Marquess of Worcester "]}, {"page": "Edward Somerset, 2nd Marquess of Worcester", "response": ["He was the son of Henry Somerset, 1st Marquess of Worcester by his wife Anne Russell, a daughter of John Russell, Baron Russell, eldest son and heir apparent of Francis Russell, 2nd Earl of Bedford."]}, {"page": "Viscount Somerset", "response": ["Viscount Somerset, of Cashell in the County of Tipperary, was a title in the Peerage of Ireland. It was created in 1626 for Sir Thomas Somerset, the second son of Edward Somerset, 4th Earl of Worcester, and the brother of Henry Somerset, 1st Marquess of Worcester. The title became extinct on his death in 1649."]}, {"page": "List of U.S. county name etymologies (S–Z)", "response": ["| Worcester County || Maryland || Named for Mary Arundell, the wife of Sir John Somerset, a son of Henry Somerset, 1st Marquess of Worcester."]}, {"page": "David Somerset, 11th Duke of Beaufort", "response": ["#Henry Somerset, 1st Marquess of Worcester, c. 1577–1646"]}, {"page": "Walter Aston, 2nd Lord Aston of Forfar", "response": ["He was buried at St. Mary's Church, Stafford. His widow did not long survive him: according to her son-in-law Sir John Southcote (who married her daughter Elizabeth), \"she grew melancholy and lost her wits, keeping almost perpetual silence and refusing nourishment.\" They had  four other daughters,  Gertrude ( a nun), Mary, Frances, who married Sir Edward Gage, 1st Baronet, and Anne, who married Henry Somerset of Pauntley Court, a grandson of Henry Somerset, 1st Marquess of Worcester; and two younger sons Thomas and William."]}, {"page": "Thomas Bailey (priest)", "response": ["In that year he also defended Charles against allegations that he had been a Roman Catholic. In Certamen Religiosum he reported on religious discussions from 1646 between Charles and Henry Somerset, 1st Marquess of Worcester, at Raglan Castle. Bailey attended the Marquess, as his chaplain.https://biography.wales/article/s-SOME-RAG-1450 The work proved controversial, and was attacked by Hamon L'Estrange,An answer to the Marques of Worcester's last paper; to the late King. [electronic resource] : Representing in their true posture, and discussing briefly, the main controversies between the English and the Romish Church. Together with some considerations, upon Dr Bayly's parenthetical interlocution; relating to the Churches power in deciding controversies. To these is annext, Smectymnuo-Mastix : or, short animadversions upon Smectymnuus in the point of lyturgie (1651) Christopher Cartwright, and Peter Heylyn."]}, {"page": "Category talk:Hungarian nobility", "response": ["Henry Somerset, 1st Marquess of WorcesterStub"]}, {"page": "Anthony-Maria Browne, 2nd Viscount Montagu", "response": ["*Francis Browne, 3rd Viscount Montague, who married Elizabeth Somerset, the daughter of Henry Somerset, 1st Marquess of Worcester."]}, {"page": "Category talk:Government of Hungary", "response": ["Henry Somerset, 1st Marquess of WorcesterStub"]}, {"page": "Category talk:Hungarian monarchs", "response": ["Henry Somerset, 1st Marquess of WorcesterStub"]}, {"page": "1646 in England", "response": ["* 19 August – Henry Somerset, 1st Marquess of Worcester, surrenders Raglan Castle in Monmouthshire to General Fairfax after a 2-month siege.", "* 18 December – Henry Somerset, 1st Marquess of Worcester (born 1577)"]}, {"page": "Henry Somerset", "response": ["* Henry Somerset, 1st Marquess of Worcester (bef. 1590–1646), English peer, son of Edward Somerset, 4th Earl of Worcester"]}, {"page": "1570s in England", "response": ["** Henry Somerset, 1st Marquess of Worcester (died 1646)"]}, {"page": "Lady Blanche Arundell", "response": ["She danced in the masque at the marriage of Anne Russell and Henry Somerset, 1st Marquess of Worcester in June 1600.Michael Brennan, Noel Kinnamon, Margaret Hannay, The Letters of Rowland Whyte (Philadelphia, 2013), pp. 498, 501: Arthur Collins, Letters and Memorials of State, vol. 2 (London, 1746), p. 201: Roy Strong, The Cult of Elizabeth (London, 1977), pp. 28-43. The other dancers, led by Mary Fitton, were Lady Dougherty, Mistress Carey, Elizabeth Southwell, Mistress Onslow, Bess Russell, and Mistress Darcy. They wore skirts of cloth of silver, waiscoats embroidered with coloured silks and silver and gold thread, mantles of carnation taffeta, and \"loose hair about their shoulders\" which was also \"curiously knotted and interlaced\".Michael Brennan, Noel Kinnamon, Margaret Hannay, The Letters of Rowland Whyte (Philadelphia, 2013), pp. 498, 501."]}, {"page": "Peregrine Hoby", "response": ["His father was the eldest son of the English Ambassador to France Sir Thomas Hoby and his wife Elizabeth Cooke (the third daughter of Sir Anthony Cooke of Gidea Hall, tutor to Edward VI) and his younger brother was Thomas Posthumous Hoby. After his grandfather's death in Paris while Ambassador, his grandmother remarried to John, Lord Russell, eldest surviving son and heir to Francis Russell, 2nd Earl of Bedford (from this marriage, he was a nephew of Anne Russell, wife of Henry Somerset, 1st Marquess of Worcester).  His father was also the nephew of William Cecil, Lord Burghley."]}, {"page": "Elizabeth Somerset, Countess of Worcester (wife of the 4th Earl)", "response": ["#Henry Somerset, 1st Marquess of Worcester (born c. 1576 – 18 December 1646) married Anne Russell"]}, {"page": "Christopher Cartwright", "response": ["*Certamen Religiosum, or a Controversy between the late King of England and the late Lord Marquesse of Worcester concerning Revelation, with a Vindication of the Protestant Cause from the pretences of the Marquesse his last Papers, which the necessity of the King's affairs denied him opportunity to answer, 1651. The Certamen Religiosum, published in 1649 by Thomas Baylie represented a debate between Charles I and  Henry Somerset, 1st Marquess of Worcester, an episode of the Civil War period when Charles was staying at Raglan Castle during 1645, after the battle of Naseby. It was reprinted with Cartwright's answer."]}, {"page": "Henry Somerset, 5th Earl of Worcester", "response": ["#REDIRECT Henry Somerset, 1st Marquess of Worcester"]}]}}