{"wiki_id": "http://www.wikidata.org/entity/Q377476", "itemLabel": "Peter Winterbottom", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Winterbottom", "wikipedia_page": {"main": "Peter James Winterbottom   (born 31 May 1960 in Otley, West Yorkshire), is a former England rugby union footballer who played as an openside flanker. He was England's most-capped openside (with 58 caps) until being overtaken by Neil Back in 2003. He made his England debut on 2 January 1982 against Australia, and his final appearance on 20 March 1993 against Ireland.\nWinterbottom was known for his work rate, durability, hard tackling and courage. He was selected on two British and Irish Lions tours in 1983 and 1993, both to New Zealand, where he impressed the locals with his fine play, albeit on losing sides. He was the second England player to reach 50 caps, after Rory Underwood, and was inducted onto the Twickenham \"Wall of Fame\" in November 2005.Winterbottom played club rugby for Headingley, Harlequins and also for Hawkes Bay in New Zealand and Transvaal in South Africa", "link_mentions": [{"page": "May 31", "response": ["*  1960   – Peter Winterbottom, English rugby player"]}, {"page": "Harlequin F.C.", "response": ["Harlequins hold the world record for providing the most players from one club (8) in a Rugby World Cup final.  In the second ever RWC final at Twickenham in November 1991, seven Harlequin players appeared for England (Will Carling, Simon Halliday, Jason Leonard, Brian Moore, Paul Ackford, Mickey Skinner, Peter Winterbottom) and Troy Coker played in the Australian pack."]}, {"page": "Jason Leonard", "response": ["Leonard played his whole England career in a largely dominant pack and in his early career played with established forwards such as Brian Moore, Wade Dooley, Dean Richards, Mick Skinner, Mike Teague and Peter Winterbottom. The England pack of this era helped England Rugby win much success, often playing a limited 10-man game that suited the large and physical England forwards."]}, {"page": "David Campese", "response": ["Campese was involved in the biggest controversy of the World Cup Final in the 69th minute. English flanker Peter Winterbottom attempted a pass to Campese's opposing winger Rory Underwood, who at that stage \"may have had an overlap,\" when Campese knocked the ball forward. The referee ruled it a deliberate knock-on and awarded England a penalty.\" The English hooker, Brian Moore, thought the referee should have awarded a penalty try."]}, {"page": "1993 British Lions tour to New Zealand", "response": ["|Peter Winterbottom||Harlequins||||", "|OF ||7 || Peter Winterbottom", "|OF ||7 || Peter Winterbottom"]}, {"page": "Rossall School", "response": ["* Peter Winterbottom - Former England Rugby Union captain. He also played for the Lions."]}]}}