{"wiki_id": "http://www.wikidata.org/entity/Q3773585", "itemLabel": "Goronwy Owen", "itemDescription": "Welsh writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Goronwy_Owen_(poet)", "wikipedia_page": {"main": "Goronwy Owen (1 January 1723 – July 1769) was one of the 18th century's most notable Welsh poets. He mastered the 24 traditional bardic metres and, although forced by circumstances to be an exile, played an important role in the literary and antiquarian movement in Wales often described as the Welsh Eighteenth Century Renaissance. A perfectionist who only published reluctantly and whose literary output is consequently relatively small, his work nevertheless had a huge influence on Welsh poetry for several generations and his poetry and tragic life gave him a cult status in Welsh literary circles.", "link_mentions": [{"page": "Brunswick County, Virginia", "response": ["* Goronwy Owen (1723-1769) Welsh-American poet, Episcopalian Vicar, and cotton and tobacco plantation owner"]}, {"page": "Northolt", "response": ["* St Mary the Virgin church (14th century) stands on the hill overlooking the old village. The Welsh poet Goronwy Owen was briefly a curate here. Bishop Samuel Lisle is buried here."]}, {"page": "Lawrenceville, Virginia", "response": ["* Goronwy Owen (1723-1769) author of Welsh poetry, Vicar of St Andrews Episcopal Church in Lawrenceville, and local cotton and tobacco plantation owner"]}, {"page": "1769 in literature", "response": ["*July – Goronwy Owen, Welsh-language poet (born 1723)"]}, {"page": "Eisteddfod", "response": ["Although the Gwyneddigion did not succeed in their ambition of transforming the eisteddfod \"into an Academy that would act as a forcing house for Welsh culture\", they have wielded considerable influence over continued requirement for long poems as eisteddfod submissions. Furthermore, in reaction to the incomprehensibility of Welsh poetry composed in strict meter, the Gwyneddigion held up the recent poetry of Reverend Goronwy Owen as a better model.", "In 1757, Reverend Goronwy Owen, an Anglican vicar born at Y Dafarn Goch, in the parish of Llanfair Mathafarn Eithaf in Anglesey and the poet most responsible for the subsequent Welsh eighteenth-century renaissance,See, for instance: Prys Morgan, The Eighteenth Century Renaissance (Christopher Davies, Swansea, 1981). emigrated to Williamsburg, in the Colony of Virginia. Until his death on his cotton and tobacco plantation near Lawrenceville, Virginia in 1769, Owen was mostly noted as an émigré bard, writing with hiraeth ('longing') for his native Anglesey. During the subsequent revival of the eisteddfod, the Gwyneddigion Society held up the poetry of Owen as an example for bards at future eisteddfodau to emulate."]}, {"page": "Walton, Liverpool", "response": ["* Poet Goronwy Owen was a parish curate and schoolmaster in Walton 1753–55."]}, {"page": "List of Welsh-language authors", "response": ["*Goronwy Owen (Goronwy Ddu o Fôn) (1723–1769)"]}, {"page": "Benllech", "response": ["Benllech has a range of businesses which include public houses and hotels, camping and caravan sites and several bed and breakfasts. The community has a primary school, Ysgol Goronwy Owen; library, doctors' surgery, chemist, several churches, hardware store, two community centres, police and fire station, tennis court and bowling green, a number of supermarkets (Spar, Cooperative and Tesco Express), restaurants and a petrol service station. Between 1909 and 1950 there was a railway station close to the village which was the terminus of the Red Wharf Bay branch line. The old station house and several railway bridges can be seen along the road approaching the village.", "*The poet Goronwy Owen (1723–1769) was a native of Llanfair Mathafarn Eithaf; the village hall, primary school and local football team are named after him."]}, {"page": "Lewis Edwards", "response": ["*Goronwy Owen (1876)"]}, {"page": "Welsh Americans", "response": ["In 1757, Rev. Goronwy Owen, an Anglican Vicar born at Y Dafarn Goch, in the parish of Llanfair Mathafarn Eithaf in Anglesey and whose contribution to Welsh poetry is most responsible for the subsequent Welsh eighteenth century Renaissance,See, for instance: Prys Morgan, The Eighteenth Century Renaissance (Christopher Davies, Swansea, 1981). emigrated to Williamsburg, in the Colony of Virginia. Until his death on his cotton and tobacco plantation near Lawrenceville, Virginia in 1769, Rev. Owen was mostly noted as an émigré bard, writing with hiraeth (\"longing\" or \"homesickness\") for his native Anglesey. During the subsequent revival of the Eisteddfod, the Gwyneddigion Society held up the poetry of Rev. Owen as an example for bards at future eisteddfodau to emulate.", "Examples of slave- and plantation-owning Welsh-Americans include Welsh poet Rev. Goronwy Owen and American Founding Father Thomas Jefferson.  While there were cases of slaves adopting their slavemasters' surnames, there were also Welsh religious groups and anti-slavery groups helping to assist slaves to freedom and evidence of names adopted for this reason. In other situations, slaves took on their own new identity of Freeman, Newman, or Liberty, while others chose the surnames of American heroes or founding fathers, which in both cases could have been Welsh in origin."]}, {"page": "Donnington, Shropshire", "response": ["The hamlet contained a now defunct 'free grammar school' under patronage of the Newport family during the 17th and 18th centuries whose pupils included Royalist divine Richard Allestree and Puritan divine Richard Baxter, the latter of whom taught at the school for three months.  Welsh poet Goronwy Owen was master at the school as well as curate at Uppington, from 1748 to 1753."]}, {"page": "Alan Llwyd", "response": ["Llwyd has published collections and studies of the works of other poets, including Goronwy Owen and Hedd Wyn. He wrote the script for the Oscar-nominated Welsh-language film Hedd Wyn (1992), about the life of the latter, who was killed in World War I. While most of his books have been on literary themes, he also edited Cymru Ddu = Black Wales, a history of black Welsh people. His biography of Kate Roberts was the subject of an S4C programme in which he was interviewed by Ffion Hague.S4C Factual, Kate: Y Cofiant. Retrieved 15 Oct 2012"]}, {"page": "Uppington", "response": ["Welsh poet Goronwy Owen was concurrently curate at Uppington church and master at Donnington School 1748-53."]}, {"page": "Richard Morris (editor)", "response": ["He was a leading figure among London Welshmen, and on the establishment of the original Cymmrodorion Society in September 1751 became its president. He employed Goronwy Owen to translate the rules of the society into Welsh. Sir William Jones employed Morris himself to catalogue the library of Moses Williams. His son, Richard, was involved in the posthumous publication of Lewis Morris's Celtic Remains."]}, {"page": "1840 in poetry", "response": ["* July – Goronwy Owen (born 1723), Welsh poet"]}, {"page": "Friars School, Bangor", "response": ["* Goronwy Owen – poetGoronwy Owen, R. H. Prichard-Jones in Jones & Haworth (eds.)(1957), pp.51–56Goronwy Owen, in Bedwyr Lewis Jones (ed.) Gwŷr Môn (1979) Cyngor Gwlad Gwynedd. "]}, {"page": "1760s in Wales", "response": ["**Goronwy Owen et al. - Diddanwch Teuluaidd", "**July - Goronwy Owen, poet, 46"]}, {"page": "John Williams (schoolmaster, born 1760)", "response": ["Williams had a particular interest in Welsh literature. He preserved a large collection of papers from the Wynns of Gwydir, and also letters from Goronwy Owen and Edward Owen.  Various manuscripts held by the National Library of Wales came from his collection as well."]}, {"page": "Edward Wynne (chancellor)", "response": ["Wynne held the position of Chancellor of the diocese for many years, only leaving office a year before his death in 1755. In 1748, he endowed an annual sermon to be preached on the birthday of Bishop Humphries (24 November). He was regarded as a devoted servant of the diocese, with an interest in its history and administration. He was also noted as being a progressive landowner, bringing advances in agricultural matters from Herefordshire to his estate on Anglesey. In particular, he was said to have been the first landowner on Anglesey to grow turnips, which he did in 1714. He has been described as \"undoubtedly, one of the chief men of Anglesey in the first half of the 18th century.\" Wynne was a patron of the Anglesey-born poet and cleric Goronwy Owen in Owen's youth, and it is known that Owen transcribed some documents for Wynne in 1739, when Owen was 16."]}, {"page": "Anglesey", "response": ["*Goronwy Owen – 18th-century poet born in Llanfair-Mathafarn-Eithaf"]}, {"page": "Goronwy Owen", "response": ["Goronwy Owen may refer to:", "*Goronwy Owen (poet) (1723–1769), poet of the 18th century Welsh literary renaissance", "*Goronwy Owen (politician) (1881–1963), Welsh Liberal MP"]}, {"page": "Robert Jones (writer)", "response": ["Jones was a noted scholar of Welsh language and literature, in the mould of Welsh scholarly priests.  Although he lived in London, he was a strong supporter of Welsh culture both in London and in Wales, being greatly involved with the Welsh community in London and supporting the National Eisteddfod and the newly established University College of Wales, Aberystwyth. He published hymns and poems in Welsh, some that he had written himself.  He was the first editor of , the transactions of the Honourable Society of Cymmrodorion, which was first published in 1876.  He published reprints of works including William Salesbury's Welsh-English dictionary and an edition of poems and letters by Goronwy Owen.  His collection of Welsh books is now held by the Central Library in Swansea."]}, {"page": "Hugh Williams (priest)", "response": ["Williams, from Llanengan, on the Llŷn peninsula of north-west Wales, was christened on 18 January 1722.  He attended the Friars School in Bangor before studying at Jesus College, Oxford between 1740 and 1744.  After his ordination as a priest in the Church of England, he was made curate of Llanengan in 1745, leaving in 1751 to become rector of Llanfrothen and perpetual curate of Beddgelert.  In 1754, he moved again to be rector of Aberffraw, a position he held until his death in 1779.  He was a friend of the Welsh poet Goronwy Owen, a contemporary at both the Friars School and Jesus College.  Williams himself was a poet, although very little of what he wrote has survived; he was also a respected preacher.  He published a translation into Welsh of a sermon in English in 1773, and later wrote  (1776)."]}, {"page": "St Mary with St Richard, Northolt", "response": ["Little is written of the religious history before the 17th century. Some of the medieval and later vicars seem to have been pluralists (spread across parishes). In 1302 the vicar was included in a list of Middlesex incumbents excommunicated for nonpayment of the papal tenth. Staunchly Protestant moves imposed nationally during the rule of Oliver Cromwell saw some opposition. George Palmer (vicar 1638–43) was sequestered (bankrupted) in 1643 on the grounds that he spoke against Parliament, \"enjoyed incestuous relations\" with his sister-in-law, and had \"deserted\" his cure to join the \"Royalist Army\". Palmer seems to have enjoyed considerable popularity among the parishioners, who described his successor, Robert Malthus (vicar 1643–61), as \"a factious preacher\". The parishioners petitioned Cromwell for his removal, alleging that he was an unsatisfactory speaker, preached against the army in Scotland, and failed to observe national thanksgiving, Malthus retained the living until the Restoration. The years after 1661 are marked by laxity in the administration of the cure and in the maintenance of the church fabric. William Brabourne (vicar 1661–84) was frequently absent from the parish. During which the cure was served by a curate whose office is first mentioned in 1617. By 1664 parts of the church were falling into disrepair. There was no chalice, and the plate consisted of one silver cup and a pewter plate. The churchyard was unfenced, so that pigs entered. In 1685 it was ordered that adequate plate be provided and the churchyard be new-railed. The churchyard was still open to incursions by pigs and sheep in 1715, but the church was said to be in reasonable repair. Pews had recently been installed and a new gallery erected at the west end for the use of singers and servants. Several 18th-century vicars were absentees, relieved by the curate. Goronwy Owen, Welsh poet, served as curate from 1755 to 1758. During this period services were held twice on Sundays, and there were between 5 and 7 Communions a year. By 1790 the annual number of Communions had fallen to 4, and there were only 10 communicants. In 1965 evensong and Communion were celebrated daily, and there were four Sunday services.Diane K Bolton, H P F King, Gillian Wyld and D C Yaxley, 'Northolt: Churches', in A History of the County of Middlesex: Volume 4, ed. T F T Baker, J S Cockburn and R B Pugh (London, 1971), pp. 119-121. British History Online http://www.british-history.ac.uk/vch/middx/vol4/pp119-121 [accessed 13 April 2019]."]}, {"page": "1769 in Wales", "response": ["*July - Goronwy Owen, poet, 46"]}, {"page": "1763 in Wales", "response": ["*Goronwy Owen, Lewis Morris et al. - Diddanwch Teuluaidd"]}, {"page": "1761 in Wales", "response": ["*Goronwy Owen takes up his position as a rector in Virginia, and his salary is agreed."]}, {"page": "1758 in Wales", "response": ["*April - Goronwy Owen becomes headmaster of the grammar school attached to the College of William & Mary, Williamsburg, Virginia."]}, {"page": "Philip Yorke (antiquary)", "response": ["His first genealogical book, the Tracts of Powys, was published in 1795, in a run of 70 copies. Dedicated to Thomas Pennant of Downing, it was based on a limited range of printed sources as well as on correspondence with scholars such as Walter Davies. The work details the history of the descendants of Bleddyn ap Cynfyn, offers a stern riposte to Polydore Vergil's negative appraisal of the early Britons, and devotes some space to the crown lordships of Powys. The appendix includes letters by Goronwy Owen and Lewis Morris."]}, {"page": "St Mary's Church, Llanfair Mathafarn Eithaf", "response": ["St Mary's Church, Llanfair Mathafarn Eithaf is a small medieval church in Anglesey, north Wales. The earliest parts of the building, including the nave and the north doorway, date from the 14th century. Other parts, including the chancel and the east window, date from the 15th century. It is associated with the Welsh poet and clergyman Goronwy Owen, who was born nearby and served as curate here. He later travelled to America to teach at The College of William & Mary, Virginia.", "The Welsh priest and poet Goronwy Owen, who was born in the parish on 1 January 1723, served for three weeks as curate of St Mary's.  He later travelled to America to teach at The College of William & Mary, Virginia, and remained in Virginia until his death.", "A 1937 survey by the Royal Commission on Ancient and Historical Monuments in Wales and Monmouthshire noted a wooden communion table, dated 1667, and some interior memorials dated 1724 and 1731.  It also recorded that the churchyard contained an 11th-century churchyard cross, which had at one point held a sundial. Most of the fittings inside the church date from the mid-19th century.  The pulpit has two carved panels, one depicting Christ and the other a Madonna and Child. It was installed in 1969, marking the bicentenary of Goronwy Owen's death. The reredos behind the altar is in memory of those who died during World War I."]}, {"page": "Y Dafarn Goch", "response": ["Y Dafarn Goch in the parish of Llanfair Mathafarn Eithaf, Anglesey, Wales was the birthplace of the poet Goronwy Owen (Goronwy Ddu o Fôn) (1723–69)."]}, {"page": "Griffith Williams (Gutyn Peris)", "response": ["As Gutyn Peris he won his first triumph as a bard in 1803, when the Gwyneddigion Society awarded him their medal for his ode to the memory of Goronwy Owen. In 1808 he composed for Lady Penrhyn a Welsh elegy on her husband Richard Pennant, 1st Baron Penrhyn. Two years later he won prizes at St Asaph eisteddfod for an ode on the royal jubilee and another in memory of Queen Elizabeth. Some of his poems were printed by Dafydd Ddu Eryri in Corph y Gaine (1810), and in 1816 he self-published a volume of Welsh verse entitled Ffrwyth Awen. In 1811 he again won a prize, for an ode to Agriculture."]}, {"page": "Llanfair-Mathafarn-Eithaf", "response": ["Local buildings include the medieval St Mary's Church, where the 18th century poet Goronwy Owen once served as curate. The parish has five Scheduled Monuments, including two collections of hut circles and the stone remains of a dolmen type Neolithic burial mound, called the Pant-y-Saer Cromlech. The remains of a Viking Age settlement have also been found in the parish."]}, {"page": "Hugh Hughes (poet)", "response": ["Hughes was a disciple of Lewis Morris, and practically ceased to write poetry after Morris's death. His verses were esteemed by Goronwy Owen."]}, {"page": "1723 in Wales", "response": ["*1 January - Goronwy Owen, poet (died 1769) "]}, {"page": "Literature in the other languages of Britain", "response": ["A mover in the classical revival of Welsh literature in the 18th century was Lewis Morris, one of the founders in 1751 of the Honourable Society of Cymmrodorion, a Welsh literary society in London—at that time the most important centre of Welsh publishing. He set out to counter the trend among patrons of Welsh literature to turn towards English culture. He attempted to recreate a classic school of Welsh poetry with his support for Goronwy Owen and other Augustans. Goronwy Owen's plans for a Miltonic epic were never achieved, but influenced the aims of eisteddfodau competitions through the 19th century."]}, {"page": "Gronwy Owen", "response": ["#REDIRECT Goronwy Owen (poet)"]}]}}