{"wiki_id": "http://www.wikidata.org/entity/Q3773506", "itemLabel": "Gordon Richards", "itemDescription": "British jockey", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Richards_(jockey)", "wikipedia_page": {"main": "Sir Gordon Richards (5 May 1904 – 10 November 1986) was an English jockey.  He was the British flat racing Champion Jockey 26 times and is often considered the world's greatest jockey ever. He remains the only flat jockey to have been knighted.\n\n", "link_mentions": [{"page": "November 10", "response": ["*  1986   – Gordon Richards, English jockey and manager (b. 1904)"]}, {"page": "Epsom Derby", "response": ["| Sir Gordon Richards", "* 1953: Pinza was the only winner in the race for the jockey Sir Gordon Richards, after 27 unsuccessful attempts."]}, {"page": "2000 Guineas Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "St Leger Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Horse racing", "response": ["The Grand National is the most prominent race in British culture, watched by many people who do not normally watch or bet on horse racing at other times of the year.Grand National Betting . Grandnational.org.uk. Retrieved on 15 November 2016. Many of the sport's greatest jockeys, most notably Sir Gordon Richards, have been British. The sport is regulated by the British Horseracing Authority. The BHA's authority does not extend to Northern Ireland; racing in Ireland is governed on an All-Ireland basis."]}, {"page": "Horse racing in Great Britain", "response": ["The sport has taken place in the country since Roman times and many of the sport's traditions and rules originated there. The Jockey Club, established in 1750, codified the Rules of Racing and one of its members, Admiral Rous laid the foundations of the handicapping system for horse racing, including the weight-for-age scale. Britain is also home to racecourses including Newmarket, Ascot and Cheltenham and races including The Derby at Epsom, The Grand National and Cheltenham Gold Cup. The UK has also produced some of the greatest jockeys, including Fred Archer, Sir Gordon Richards and Lester Piggott.", "Three figures dominate the flat racing scene of the 20th century too – Steve Donoghue, Gordon Richards and Lester Piggott.  Richards is often regarded as the greatest jockey ever", "He broke Gordon Richards' record for most winners in a season in 2001/02 and his total number of career wins by the time he retired was 4,358, well eclipsing the numbers set by Peter Scudamore and Richard Dunwoody who between them were the leading jumps jockeys of the 1980s and early 1990s.  Richard Johnson, who has been second to McCoy in nearly all of his championships has the second most wins jockey of all time, and gained tabloid fame in the late 1990s for his relationship with Zara Philips."]}, {"page": "Telford", "response": ["*Sir Gordon Richards (1904 in Donnington Wood – 1986) won a record 26 champion jockey titles, and was the only flat jockey to be knighted"]}, {"page": "Marlborough, Wiltshire", "response": ["The renowned jockey Sir Gordon Richards is buried in the new cemetery on Marlborough common, the second of two such cemeteries to be opened after the two old churchyards stopped being used for burials."]}, {"page": "Fred Archer (jockey)", "response": ["He was Champion Jockey for 13 consecutive years until 1886, riding 2,748 winners from 8,084 starts, in so doing setting records for the number of Champion Jockey titles (13), number of wins in a season (246) and number of race wins (2748) which remained unthreatened until the arrival of Steve Donoghue and Sir Gordon Richards well into the 20th century.", "In 1885, he rode 246 winners, a record that was unbroken until Gordon Richards' 1933 season. He won The Derby five times and won a total of 21 classic races. In total, he rode 2,748 winners in 8,084 races (some sources say 8,004), a win percentage of over 34%."]}, {"page": "Steve Donoghue", "response": ["Steve Donoghue (8 November 188423 March 1945) was a leading English flat-race jockey in the 1910s and 1920s. He was Champion Jockey 10 times between 1914 and 1923 and was one of the most celebrated horse racing sportsmen after Fred Archer, arguably only Sir Gordon Richards eclipsing him."]}, {"page": "Johnny Longden", "response": ["As a young man, Longden Jr. worked in the mining industry. His love of horses and horse-racing led him to leave Canada in 1927 to seek opportunities as a jockey in California's burgeoning racing scene. Based at Santa Anita Park, by 1956 he had become thoroughbred racing's winningest rider, breaking the record of 4,870 wins by British jockey Sir Gordon Richards (1904–1988). Longden, who was called \"The Pumper\" by his fellow jockeys because of his riding style, rode many of the great thoroughbreds of the day. In 1943, he captured the United States Triple Crown of Thoroughbred Racing winning the Kentucky Derby, the Preakness Stakes and the Belmont Stakes aboard Count Fleet. A sculptured bust of Longden, along with busts of fellow jockeys William Shoemaker and Laffit Pincay, has been placed in the paddock area at Santa Anita Racetrack in Arcadia, California."]}, {"page": "Coronation Cup", "response": ["| Tommy WestonGordon Richards", "| Gordon Richards"]}, {"page": "1000 Guineas Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Epsom Oaks", "response": ["| Gordon Richards", "| Gordon Richards"]}, {"page": "St James's Palace Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Ascot Gold Cup", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Coronation Stakes", "response": ["| Gordon Richards", "| Gordon Richards"]}, {"page": "Eclipse Stakes", "response": ["| Gordon Richards"]}, {"page": "July Cup", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "King George VI and Queen Elizabeth Stakes", "response": ["| Sir Gordon Richards"]}, {"page": "Sussex Stakes", "response": ["* Sir Gordon Richards – Marconigram (1928), Corpach (1936), Pascal (1937), Radiotherapy (1946), Combat (1947), Krakatao (1949), Le Sage (1951), Agitator (1952)", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Nassau Stakes", "response": ["* Sir Gordon Richards – Solfatara (1933), Coppelia (1935), Barrowby Gem (1936), Goblet (1948), Jet Plane (1949), Sea Parrot (1951)"]}, {"page": "Yorkshire Oaks", "response": ["| Gordon Richards"]}, {"page": "Nunthorpe Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Cheveley Park Stakes", "response": ["* Sir Gordon Richards – Tiffin (1928), Keystone (1940), Lady Sybil (1942), Neolight (1945), Pambidian (1948), Belle of All (1950), Zabara (1951), Bebe Grande (1952), Sixpence (1953)"]}, {"page": "Middle Park Stakes", "response": ["* Sir Gordon Richards – Medieval Knight (1933), Scottish Union (1937), Khaled (1945), The Cobbler (1947), Abernant (1948), Royal Challenger (1953)", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Dewhurst Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Champion Stakes", "response": ["| Gordon Richards", "| Michael BearyGordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Sir Gordon Richards"]}, {"page": "Hardwicke Stakes", "response": ["| Gordon Richards"]}, {"page": "July Stakes", "response": ["* Sir Gordon Richards – Hilla (1934), High Sheriff (1944), Rivaz (1945), Masaka (1947), Diableretta (1949), Tamerlane (1954)"]}, {"page": "Goodwood Cup", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Gimcrack Stakes", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Doncaster Cup", "response": ["| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards", "| Gordon Richards"]}, {"page": "Lester Piggott", "response": ["In 1999, the Racing Post ranked Piggott as second in their list of the Top 50 jockeys of the 20th century, behind Gordon Richards."]}, {"page": "Donnington Wood", "response": ["Jockey Sir Gordon Richards was born in Donnington Wood. A local pub in nearby Donnington was named after him: \"The Champion Jockey\".  This was replaced firstly by a Netto supermarket which itself in 2011 became a Morrisons' supermarket, which then turned into a Home Bargains shop in 2015."]}, {"page": "Sir Gordon Richards", "response": ["#REDIRECT Gordon Richards (jockey)"]}, {"page": "List of jockeys", "response": ["* Sir Gordon Richards"]}, {"page": "Fred Harris (British politician)", "response": ["Harris was very keen on sport. He had held a schoolboy cricket record and played football (soccer) in the Spartan League. He played tennis all his life and was an occasional croc hunter. He campaigned successfully for Croydon Council to build Croydon Sports Arena in South Norwood. He was also a racehorse owner, with Gordon Richards as a regular jockey. In the 1940s he had a considerable lucky streak, with 50 wins out of 90 outings. His horse 'Now or Never' won the Great Metropolitan at Epsom in 1948."]}, {"page": "Tony McCoy", "response": ["By the end of the decade McCoy had set a new National Hunt record for winners in a season (253), equaled the record of five winners at the 1998 Cheltenham Festival, and became the fastest jockey to reach the 100 winner mark in a season in 2001. He went on to beat the long-standing record of Gordon Richards for the total number of winners ridden in a season, which stood since 1947. McCoy has said he counts this as his biggest achievement, despite his multiple Champion Jockey titles and big race victories.", "† A British Horse Racing record for most winners ridden in a season by a jockey (flat or jumps), beating Sir Gordon Richards' long-standing record of 269 winners set in 1947"]}, {"page": "Pat Eddery", "response": ["Patrick James John Eddery (18 March 1952 – 10 November 2015) was an Irish flat racing jockey and horse trainer. He rode three winners of The Derby, and was Champion Jockey on eleven occasions. He rode the winners of 4,632 British flat races, a figure exceeded only by Sir Gordon Richards."]}, {"page": "Scobie Breasley", "response": ["He developed a great rivalry with Sir Gordon Richards, and later with the younger jockey Lester Piggott. He was renowned for his exquisite balance in the saddle, for refusing to race wide, and for his sparing use of the whip, preferring to use hands and heels."]}, {"page": "Arnold Weinstock", "response": ["A member of the Jockey Club, Weinstock owned a number of thoroughbred racehorses. He and his father-in-law, Michael Sobell, entered ownership in 1957 and were immediately successful when purchasing London Cry, who won the 1958 Cambridgeshire Handicap. In 1960 they purchased the Ballymacoll Stud in Ireland from the estate of Dorothy Paget. Although they had many winners their first really good racehorse was a colt called Reform, who was the champion miler of 1967 and won amongst other races the St. James's Palace Stakes Sussex Stakes and Champion Stakes. Up until 1971 his horses were trained by Sir Gordon Richards but in 1970 with his father in law he purchased the West Ilsley stables from Jakie Astor, whereupon Dick Hern became his trainer. They had almost immediate success with two good Ballymacoll bred two-year-olds, and subsequent three-year-old milers, in Sallust and Sun Prince. They also owned and bred the St Leger Stakes runner-up Homeric. In 1974 Gaily, a purchased filly, won the Irish One Thousand Guineas. Their next good horse was Admetus who won the Washington International Stakes and the Prince of Wales's Stakes. A few years later they bred and owned Cistus who won the Lupe Stakes, Child Stakes, Nassau Stakes and the Prix de l'Opéra. They achieved every owner/breeders dream when Troy won the 200th Epsom Derby in 1979. In 1981 they sold the stables to the Queen."]}, {"page": "Queen Mary Stakes", "response": ["* Sir Gordon Richards – Supervisor (1932), Maureen (1933), Caretta (1934), Snowberry (1939), Apparition (1946)"]}, {"page": "Coventry Stakes", "response": ["* Sir Gordon Richards – Manitoba (1932), Medieval Knight (1933), Hairan (1934), Nasrullah (1942), Khaled (1945), Tudor Minstrel (1946), The Cobbler (1947), Palestine (1949), King's Bench (1951)"]}, {"page": "Harry Wragg", "response": ["Between 1931 and 1953 Gordon Richards won 22 of the 23 jockey's championships. The only interruption in Richards run of success came in 1941, when he missed much of the season through injury. Wragg rode 71 winners including the wartime substitute Oaks on Commotion, to claim his only championship. During the War, Wragg served in the Royal Artillery reaching the rank of sergeant before moving at his own request from an office position to an Anti-Aircraft battery. In 1942 Wragg won a third Derby on Watling Street: he again employed exaggerated waiting tactics, taking the lead on Lord Derby's temperamental colt fifty yards from the finish and winning by a neck. Before the end of the war he won further classics for Lord Derby on Herringbone, Sun Stream and Garden Path. He retired from riding at the end of 1946, a year in which he won the Oaks on Steady Aim."]}, {"page": "Nasrullah (horse)", "response": ["On his racecourse debut, Nasrullah finished third in the Wilburton Stakes, but was then moved up in class and contested the Coventry Stakes (usually run at Royal Ascot) on 12 June. Ridden by the champion jockey Gordon Richards, he won at odds of 7/4, beating the future Derby winner Straight Deal. In July, he won the Great Bradley Stakes, beating a single opponent."]}, {"page": "1953 in the United Kingdom", "response": ["* 6 June – The Epsom Derby is won by Pinza, the only Derby victory for Gordon Richards at his 28th attempt, days after becoming the only jockey to be made a knight. The Queen's horse, Aureole, finishes second."]}, {"page": "Winning streak", "response": ["12 races – Gordon Richards"]}, {"page": "British Champions Long Distance Cup", "response": ["* Sir Gordon Richards – Brumeux (1930), Brulette (1932), Felicitation (1934), Foxglove II (1938), Shahpoor (1943), Vic Day (1948, 1949)"]}, {"page": "Tudor Minstrel", "response": ["Tudor Minstrel began his 1947 by winning a minor race at Bath and then started 11/8 favourite for the 2000 Guineas at Newmarket. Ridden by Gordon Richards, Tudor Minstrel won the one mile 2,000 Guineas by eight lengths, from Saravan, with Sayajirao in third. The winning margin was the biggest recorded in the race in the 20th century. Richards eased the colt down in the final furlong, leading contemporary observers to believe that Tudor Minstrel could have won the race by twenty lengths. In the aftermath of his Guineas win, he was described as the \"horse of the century\"."]}]}}