{"wiki_id": "http://www.wikidata.org/entity/Q3787223", "itemLabel": "Howard Gayle", "itemDescription": "English footballer (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Howard_Gayle", "wikipedia_page": {"main": "Howard Anthony Gayle (born 18 May 1958) is an English former footballer who played for Birmingham City, Blackburn Rovers, Fulham, Halifax Town, Liverpool, Newcastle United, Sunderland and Stoke City.Gayle began his career with Liverpool F.C. and made the headlines after becoming the first black player to play for the team. After loan spells with Fulham and Newcastle United he joined Birmingham City in search of regular first team football. He then played for Sunderland and had a short spell in the United States playing indoor football with the Dallas Sidekicks. He returned to England and played for Stoke City, Blackburn Rovers and ended his career with Halifax Town.", "link_mentions": [{"page": "Blackburn Rovers F.C.", "response": ["|1988–89|| Howard Gayle"]}, {"page": "Toxteth", "response": ["*Howard Gayle, football player"]}, {"page": "Norris Green", "response": ["*Howard Gayle, footballer"]}, {"page": "Simon Garner", "response": ["Garner scored 14 league goals in the 1987–88 season, when they qualified for the recently introduced playoffs, but defeat in the semi-finals denied them promotion. They reached the playoff final a year later and looked to have secured First Division football after beating Crystal Palace, but were heavily beaten by Palace in the return leg and missed out on promotion again. In 1990, Rovers suffered a third successive playoff defeat. Garner found the net 20 times in the league that season, in a successful partnership up front with Howard Gayle."]}, {"page": "1984–85 in English football", "response": ["6 November 1984: Chelsea brush aside Walsall in their Milk Cup third round replay, scoring three goals in the first 11 minutes without reply. A Howard Gayle goal in extra time is enough for Sunderland to knock out Nottingham Forest who have 18-year-old Paul Raynor sent off."]}, {"page": "Tyne–Wear derby", "response": ["*Howard Gayle"]}, {"page": "Les Afful", "response": ["Afful was born in Liverpool, and is of Caribbean descent. He joined Exeter City as a trainee after playing for a Merseyside youth team in Toxteth, after being brought to Exeter for a friendly by former Birmingham City and Liverpool player Howard Gayle."]}, {"page": "Show Racism the Red Card", "response": ["*Howard Gayle"]}, {"page": "Liverpool F.C. Reserves and Academy", "response": ["*  Howard Gayle"]}, {"page": "List of European Cup and UEFA Champions League winning players", "response": ["|Howard Gayle||||Liverpool||1||1981||"]}, {"page": "1981 European Cup Final", "response": ["They faced German champions Bayern Munich in the semi-finals. The first leg in England ended in a 0–0 draw. Liverpool needed to score in the second leg to advance to the final. Their cause was not helped when striker Kenny Dalglish had to be replaced in the early minutes of the match by the inexperienced Howard Gayle. However, Gayle rose to the occasion, unsettling the Bayern defence with his attacking threat. With seven minutes of normal time left, Ray Kennedy scored to give Liverpool a 1–0 lead. Bayern responded soon afterwards when Karl-Heinz Rummenigge scored, however, they needed to score another goal due to the away goals rule. They were unable to do so and Liverpool progressed to their third final in five seasons.", "|FW ||16 || Howard Gayle"]}, {"page": "Tommy Smith (footballer, born 1945)", "response": ["In 1988, Smith caused controversy after stating in an interview with the author Dave Hill that Howard Gayle \"Suffered from a black man's attitude towards the white man. See, everybody thinks whites have an attitude towards blacks. In reality it's blacks who have a problem with the whites... I used to call Howard the 'White Nigger'. Now that is a compliment. It was the only way I could find to describe that I thought he was OK.\" Smith then went on to comment to Hill that \"I'm not prejudiced but if a coon moved in next door, I'd move, like most white people would. If my daughter came home with a nigger, I'd go mad. But I'm only being truthful and normal.\" Smith intended to sue Hill, but found he had no grounds to take legal action as Hill had recorded all of Smith's comments on tape during the interview."]}, {"page": "Colin Russell (footballer)", "response": ["Russell began his career as an apprentice with home-town club Liverpool, before signing professional terms at 18. Russell was part of Roy Evans' Central League champions side from 1979 to 1982 and frequently captained the side. He made his debut, and his only appearance for Liverpool's first team, on 2 May 1981 as the second-half substitute for Howard Gayle in a 1–0 defeat to Sunderland. In 1982 with the emergence of David Hodgson as Kenny Dalglish's understudy, Russell was transferred to Huddersfield Town where he enjoyed the most successful period of his career. He helped the Terriers gain promotion in 1982–83 scoring 16 league goals. Towards the end of 1983–84 Russell joined Stoke City on loan where he played 11 times scoring twice against former club Liverpool and Queens Park Rangers. The then went on to play for AFC Bournemouth, Doncaster Rovers and Scarborough followed before he ended his Football League career with Wigan Athletic in the 1988–89 season. After only a couple of months at Wigan, Russell moved into non-league football by joining former Liverpool teammate Alan Kennedy at Colne Dynamoes, at the time the only non-league side to offer lucrative contracts to their players. As the season got underway, financial hardship soon hit the club, and eventually the club folded. He went on play for Bangor City, Morecambe, Droylsden and Warrington Town."]}, {"page": "Howie Gayle", "response": ["#REDIRECT Howard Gayle "]}, {"page": "List of football personalities with British honours", "response": ["In August 2016, former Liverpool player Howard Gayle, the first black footballer to play for the club, revealed he had turned down an MBE for his work with Show Racism the Red Card, stating that it would be \"a betrayal to all of the Africans who have lost their lives, or who have suffered as a result of Empire.\""]}, {"page": "1985 Football League Cup Final", "response": ["|RW ||12||  Howard Gayle || || "]}]}}