{"wiki_id": "http://www.wikidata.org/entity/Q3783429", "itemLabel": "Harold Daniell", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Daniell", "wikipedia_page": {"main": "Harold Daniell (29 October 1909 – 19 January 1967) was a British professional Grand Prix motorcycle road racer and auto racing driver. He competed in the 1940s and 1950s. On retiring from racing he owned a Norton motorcycle dealership in Forest Hill, London.\nHarold Daniell and George Rowley rode the supercharged AJS V4s in the 1936 Isle of Man Senior TT, but despite its high top speed, it lacked acceleration. Both riders retired due to mechanical problems.In the 1938 Isle of Man TT' Daniell completed the first under 25-minute (24min.52.6sec), 91.00 plus mph, lap of the Isle of Man TT Snaefell Mountain Course on his Norton in the Senior TT, a record which would stand for 12 years. He won, beating Stanley Woods by only 14.4 seconds.\nDaniell competed in the 1949 Grand Prix motorcycle racing season riding on a 500cc Norton and finished sixth overall with 17 points in the World Championship while Leslie Graham and Nello Pagani finished first and second respectively. In the same year he also won the Isle of Man Senior TT and was placed fifth in the Junior TT. His victory in the Senior TT makes him the first race winner of the MotoGP (then 500 cc) class.Daniell's Isle of Man TT racing career spanned the years from 1930 until 1950 and included three victories and several placings in the Tourist Trophy races but he also competed in the Manx Grand Prix. Daniell declared that the new Norton was like \"riding on a featherbed\" compared with riding the \"garden gate\" - and it has been called the Featherbed frame ever since. After his motorcycle racing career, Daniell began auto racing, entering Formula 3 events at the wheel of an Emeryson car.\n\n", "link_mentions": [{"page": "Grand Prix motorcycle racing", "response": ["* 1949: Start of the world championship in Grand Prix motorcycle racing for five separate categories, 125cc, 250cc, 350cc, 500cc and sidecars. Harold Daniell wins the first ever 500 cc Grand Prix race held at the Isle of Man TT."]}, {"page": "Isle of Man TT", "response": ["| Ray Amm, Adrian Archibald, Graeme Crosby, Harold Daniell, Max Deubel, Ralf Engelhardt, Ryan Farquhar, Patrick Farrance, Carl Fogarty, Alex George, Tom Herron, Darren Hope, Emil Hörner, Alan Jackson, Tony Jefferies, Geoff Johnson, Klaus Klaffenböck, Rob McElnea, Bob McIntyre, Phil Mellor, Dave Morris, Clive Pollington, Walter Schneider, Ian Simpson, Rolf Steinhausen, Hans Strauss, Luigi Taveri, Don Williams, Barry Woodland Dean Harrison", "|  Harold Daniell"]}, {"page": "North West 200", "response": ["! 350 cc Harold Daniell"]}, {"page": "Daniell", "response": ["* Harold Daniell (1909–1967), British racing motorcyclist"]}, {"page": "1949 Grand Prix motorcycle racing season", "response": ["|  Harold Daniell", "|align=\"left\"|  Harold Daniell"]}, {"page": "German motorcycle Grand Prix", "response": ["|  Harold Daniell"]}, {"page": "Manx Grand Prix", "response": ["|Rex Adams, Dave Arnold, Mark Baldwin, Brian Ball, Adam Barclay, Nigel Barton,  Nigel Beattie, Simon Beck, Gavin Bell, George Bell, Peter Bell, Alan Bennallick, Dave Bennett, Alan Bennie, Gordon Blackley, Ellis Boyce, Colin Breeze, Derek Brien, Dave Broadhead, Clive Brown, George Buchan, Graham Cannell, Phil Carpenter, John Carr, Gary Carswell, Mike Casey, Alan Cooper, Paul Corrin, George Costain, Dennis Craine, Eddie Crooks, Dickie Dale, Harold Daniell, Gordon Daniels, Peter Darvill, Snuffy Davies, Nigel Davies, Robin Dawson, Tom Dickie, Wayne Dinham, Tommy Diver, H.G. Dobbs, Chris Dowling, Paul Duckett, Robin Duffy, Geoff Duke, Robert Dunlop, Samuel Dunlop, Joe Dunphy, Derek Ennett, Dave East, Michael (Miggy) Evans, Bob Farmer, Gordon Farmer, Derek Farrant, John Findlay, Frank Fox, Freddie Frith, Elwyn Fryer, Simon Fulton, Alex George, Phil Gilder, Norman Gledhill, Grant Goodings, Seamus Green, Selwyn Griffiths, Billy Guthrie, Rod Harris, Phil Haslam, Paul Harbinson, Bob Hayes, Steve Hazlett, Russ Henley, Dave Hickman, Jamie Hodson, Rob Hodson, Chris Hook, Ken Huggett, Dave Hughes, Paul Hunt, Alan Jackson, Bud Jackson, Nick Jefferies, Griff Jenkins, Geoff Johnson, Ross Johnson, Dave Johnston, Gordon Keith, Neil Kent, Wayne Kirwan, Mike Kneen, Tom Knight, Steve Kuenne, Con Law, Gavin Lee, George Linder, Darran Lindsay, Joe Lindsay, Gary Linham, Ernie Lyons, Dave Madsen-Mygdal, Tim Maher, Cromie McCandless, Bob McIntyre, Sam McClements, Philip McGurk, Stephen McIlvenna, Sean McStay, Harry Meageen, Ernie Merrill, Peter Middleton, Ned Minihan, Donald Mitchell, Dave Moffitt, Dave Montgomery, Nigel Moore, Davy Morgan, Ian Morris, Steve Moynihan, J.M.Muir, Ian Newton, Dave O'Leary,  Alan Oversby,  Mark Parrett, Len Parsons, Cliff Patterson, Ian Patterson, Dave Pither, Gary Radcliffe, Steve Rae, Brian Raynor, Phil Read, Paddy Reid, Frank Reynolds, Peter Richardson, Roy Richardson, Kevin Riley, Eddie Roberts, Nigel Rollason, Peter Romaine, Andrew Soar, Carolynn Sells, Martin Sharpe, Alan Shepherd, Robin Sherry, Danny Shimmin, Dave Silvester, John Simpson, Mick Skene, Billy Smith, Alan Steele, Matt Stevenson, Keith Stewart, Steve Sturrock, Ralph Sutcliffe, Roger Sutcliffe, James Kelly Swanston, Peter Symes, Keith Taylor, Keith Townsend, Les Trotter, Peter Turnball, Nick Turner, Steve Ward, Ernie Washer, Tom Weeden, John Wetherall, Charlie Williams, David Williams, Steve Williams, J H 'Crasher' White, Frank Whiteway "]}, {"page": "Stanley Woods", "response": ["Described by the motor-cycle press at the time as the \"Irish Dasher\" his stylish riding style was influenced from watching fellow TT competitor Alec Bennett Over the years many scraps took place between the likes of Jimmie Guthrie, Jimmie Simpson, Charlie Dodson, Harold Daniell, Freddie Frith and Wal Handley during these races. Stanley was a toffee maker and in the Isle of Man TT history it states that he would bring a couple of boxes of toffee with him for the Scouts who manned the scoreboards on which the grandstand audience relied to follow the races. Stanley was president of the TT Riders Association. Commandant Stanley Woods is credited with the task of training some of the first Irish Army 4 Cavalry Squadron's Motor Squadron personnel during The Emergency as the presidential Escort of Honour."]}, {"page": "1950 Grand Prix motorcycle racing season", "response": ["|align=\"left\"|  Harold Daniell", "|  Harold Daniell"]}, {"page": "1950 Isle of Man TT", "response": ["After his win in the 1949 Isle of Man Clubman event, Geoff Duke entered the 1950 Isle of Man TT only to find himself racing against formidable opposition in his first Senior TT, not only from his experienced Norton team mates, Artie Bell, Harold Daniell and Johnny Lockett, but also Les Graham on an AJS Porcupine, Reg Armstrong and Bob Foster on Velocettes. Geoff was wearing a new set of one-piece leathers and he beat them all, breaking both lap and race records in the Senior, and finishing second in the Junior TT.  It was the beginning of a spectacular racing career for Geoff Duke. IOMTT.com Geoff Duke Isle of Man career database (retrieved 5 November 2006)", "|  Harold Daniell"]}, {"page": "1949 Isle of Man TT", "response": ["Harold Daniell, on a Norton, won the 500 cc Senior TT event at an average speed of 86.93 mph. Les Graham, on an AJS Porcupine 500 cc twin, led the Senior race until the last lap when his magneto drive sheared. He pushed the bike past the finish line in tenth place. As he had finished the race he gained one championship point for recording the fastest lap.", "|| Harold Daniell"]}, {"page": "1949 Swiss motorcycle Grand Prix", "response": ["British rider Leslie Graham won the 500 cc race riding an AJS from Arciso Artesiani and Harold Daniell.", "|  Harold Daniell"]}, {"page": "1948 Isle of Man TT", "response": ["In the 1948 Isle of Man Tourist Trophy festival Harold Daniell, lap record holder since 1938, failed to finish the 1948 Senior TT on his Norton, and victory went to Norton team member, Artie Bell, the flying Ulsterman. Norton dominated, taking the first three places, losing fourth to Geoff Murdoch's AJS, and then filling the next four places. There were thirty three Nortons in a field of fifty six."]}, {"page": "1947 Isle of Man TT", "response": ["Harold Daniell won the Senior TT at  on a Norton and the Norton team were to dominate the Senior race until 1954. Birmingham's history (retrieved 29 October 2006) Speeds were somewhat lower than the pre-war races due to the low quality \"pool\" petrol available, and it would be another three years before Daniell's 1938 lap record was broken. Superchargers were banned for motorcycle racing from 1946, so that may have reduced speed too.  Gilera-Saturno Gilera History (Retrieved 29 October 2006)", "|| Harold Daniell"]}, {"page": "1939 Isle of Man TT", "response": ["||  Harold Daniell"]}, {"page": "Senior TT", "response": ["|  Harold Daniell", "|  Harold Daniell", "|  Harold Daniell", "| Alec Bennett, Harold Daniell, Geoff Duke, Michael Dunlop, David Jefferies, Phillip McCallen || 3"]}, {"page": "1938 Isle of Man TT", "response": ["The 1938 Isle of Man Tourist Trophy saw the Senior TT lap record of 90.27 mph set by Freddie Frith the previous year broken in 1938 when Harold Daniell completed a lap at 91.00 mph on his Norton, a record which would stand for 12 years. MCB TTraces (Retrieved 1 November 2006) He won, beating Stanley Woods by only 14.4 seconds. Stanley Woods won the Junior, with Harold Daniell coming fifth, while Ewald Kluge on a DKW won the Lightweight. Kluge was the second Lightweight TT winning non-British rider in a row, Omobono Tenni having won the previous year.", "Between 1931 and 1937 Norton had six Senior-TT wins with the long-stroke CamShaft One (CS1) engine. Norton entered the 1938 Senior TT with a new short-stroke engine, new telescopic front forks, and won for the 7th time, with rider Harold Daniell.Krackowizer Motorcycles M – R (Retrieved 18 November 2006)", "| 1 ||  Harold Daniell || Norton || 89.11 || 2.57.50.6", "| 5 ||  Harold Daniell || Norton || 80.54 || 3:16.32.0 "]}, {"page": "1937 Isle of Man TT", "response": ["Harold Daniell who had been a works rider for AJS entered the 1937 TT with a three-year-old Norton tuned by his brother-in-law, Steve Lancefield which gave him a fifth place, a finishing position he also achieved in the Junior TT.", "| 5 ||  Harold Daniell || Norton || 83.61 || 3:09.33.0 ", "| 5 ||  Harold Daniell || Norton || 78.77 || 3:21.12.0"]}, {"page": "Johnny Lockett", "response": ["He competed in the 1949 Grand Prix motorcycle racing season riding on a 500cc Norton bike and finished seventh overall with 13 points, 17 points behind fellow British rider and teammate Harold Daniell.1949 Moto GP results"]}, {"page": "Harold L Daniell", "response": ["#REDIRECT Harold Daniell"]}, {"page": "Harold L. Daniell", "response": ["#REDIRECT Harold Daniell"]}, {"page": "1936 Isle of Man TT", "response": ["In the Senior TT race Harold Daniell and George Rowley rode supercharged AJS V4s, but despite their high top speed, the bikes lacked acceleration. Both riders retired due to mechanical problems.Title: Classic Racer magazine, Issue: 121, Article: Ahead of the Game, Subtitle: Supercharged V4 AJS on test, Pages: 34 – 40, Publisher: Mortons Media Group (Horncastle, Lincolnshire UK), ", "| 9 ||  Harold Daniell || AJS || 74.61 || 3:32.25.0"]}, {"page": "1935 Isle of Man TT", "response": ["| 8 || Harold Daniell || AJS || 76.25 || 3:27.52.0"]}, {"page": "1934 Isle of Man TT", "response": ["| 9 ||  Harold Daniell || AJS || 69.02 || 3:49.02.0"]}]}}