{"wiki_id": "http://www.wikidata.org/entity/Q378765", "itemLabel": "Kurt Nicoll", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kurt_Nicoll", "wikipedia_page": {"main": "Kurt Nicoll (born 15 November 1964) is an English former professional motocross racer.\nNicoll was one of the top riders in the Motocross Grand Prix World Championships during the late 1980s and early 1990s, finishing as the runner up four times in the F.I.M. 500cc world championships. Nicoll won 13 World Motocross Grands Prix and 7 ACU British National Championships. Nicoll was a member of the victorious 1994 British Motocross des Nations team that included Paul Malin and Rob Herring. The upset victory marked the first time a British team had won the event since 1967 and, broke a 13-year American winning streak at the Motocross des Nations.In 2004 and 2009 Nicoll won the American Motorcycle Association's Supermoto Unlimited Championship. He also won the AMA National Vet Championship in Endurocross in 2011 and 2012. He was 2012 AMA Vet Racer of the year. He worked for KTM as their Director of Racing from 1998 until 2009. Nicoll is currently General Manager of Travis Pastrana's Nitro Circus in North America. He is the son of former BSA factory rider, Dave Nicoll. Nicoll also currently runs his own motocross vacation company, Kurt Nicoll's Champion MX Vacations which is based in Temecula, California.", "link_mentions": [{"page": "David Thorpe (motorcyclist)", "response": ["After his competitive career, Thorpe served as manager of the British Motocross des Nations team, which included the upset victory by the 1994 British team of Rob Herring, Paul Malin and Kurt Nicoll. The victory marked the first time a British team had won the event since 1967 and, broke a 13-year American winning streak at the Motocross des Nations. Afterwards, Thorpe concentrated on team management, running the UK based CAT Honda team during the late 1990s. The team was a success both in the UK and on the Grand Prix circuit, however Honda suddenly withdrew their support (along with several other teams) in 2001, and the team disbanded."]}, {"page": "List of motocross riders", "response": ["|  Kurt Nicoll"]}, {"page": "Motocross des Nations", "response": ["| Rob Herring / Paul Malin / Kurt Nicoll"]}, {"page": "Motorsport in the United Kingdom", "response": ["Motocross, motorcycle trials and enduro are also popular forms of motorcycle sports, with notable riders such as Kurt Nicoll, David Thorpe, Jeff Smith, Dave Bickers, David Knight, Sammy Miller, Arthur Lampkin, Martin Lampkin and Dougie Lampkin."]}, {"page": "Motocross World Championship", "response": ["| 1)  Georges Jobé (Honda)2)  Kurt Nicoll (Kawasaki)3)  Kees van der Ven (KTM)", "| 1)  Eric Geboers (Honda)2)  Kurt Nicoll (Kawasaki)3)  David Thorpe (Honda)", "| 1)  Eric Geboers (Honda)2)  Kurt Nicoll (KTM)3)  Dirk Geukens (Honda)", "| 1)  Georges Jobé (Honda)2)  Kurt Nicoll (KTM)3)  Billy Liles (Honda)"]}, {"page": "Rob Herring", "response": ["Herring began his racing career in South Africa after his father emigrated there from the United Kingdom. He returned to the U.K. at the age of 17 and won 11 British motocross national championships. He also competed in the F.I.M. motocross world championship. Herring was a member of the victorious 1994 British Motocross des Nations team that included Paul Malin and Kurt Nicoll. The upset victory marked the first time a British team had won the event since 1967 and, broke a 13-year American winning streak at the Motocross des Nations. as well as finished 2nd in 1986 mx des nations and 3rd in 1992."]}, {"page": "Dave Nicoll", "response": ["After retiring from competition in 1978, Nicoll worked as the manager of the British Motocross des Nations team. When his son, Kurt Nicoll began competing in the motocross world championships, Nicoll became his team manager. His son finished as the runner-up in the 500cc world championships four times. After his son retired from competition in 1997, Nicoll was hired by the FIM to become the Clerk of Course for the motorcross world championships."]}, {"page": "AMA Supermoto Championship", "response": ["In addition, many riders who had retired from competition in other disciplines participated in the 2003 series. Among them were AMA Supercross Champion Jeremy McGrath, AMA Flat Track and Superbike racer Larry Pegram, AMA Superbike Champion and Grand Prix racer Doug Chandler, ACU British National Motocross Champion Kurt Nicoll, Grand Prix Champion Kevin Schwantz, AMA Motocross Champions Micky Dymond and Chuck Sun, AMA Superbike racer Mike Smith, FMM Champion Omar Isaak, and French Ice Racing Champion David Baffeleuf.", "| 1)  Grant Langston (KTM)2)  Benny Carlson (KTM)3)  Kurt Nicoll (KTM)", "| 1)  Kurt Nicoll (KTM)2)  Micky Dymond (KTM)3)  Benny Carlson (KTM)", "| 1)   Benny Carlson (Aprilia)2)  Kurt Nicoll (KTM)3)  Robert Loire (Husaberg)", "| 1)  Kurt Nicoll (KTM)2)  Steve Drew (KTM)3)  Justin Ross (KTM)"]}, {"page": "Dirk Geukens", "response": ["Geukens competed in the FIM 250cc Motocross World Championship from 1984 to 1986. He moved up to the 500cc world championship from 1987 to 1996. Riding a Honda motorcycle, Geukens finished 3rd overall behind Eric Geboers and Kurt Nicoll in the 500cc world championship in 1990. He repeated his third place finish in 1991 this time behind Georges Jobé and Jacky Martens. He won 2 Grand Prix races and finished on the podium 8 times. During this period, he also won the Overpelt enduro."]}]}}