{"wiki_id": "http://www.wikidata.org/entity/Q378629", "itemLabel": "John Lindley", "itemDescription": "English botanist, gardener, orchidologist, editor, scientific illustrator (1799–1865)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lindley", "wikipedia_page": {"main": "John Lindley FRS (5 February 1799 – 1 November 1865) was an English botanist, gardener and orchidologist.", "link_mentions": [{"page": "Asparagales", "response": ["The circumscription of Asparagales has been a source of difficulty for many botanists from the time of John Lindley (1846), the other important British taxonomist of the early nineteenth century. In his first taxonomic work, An Introduction to the Natural System of Botany (1830) he partly followed Jussieu by describing a subclass he called Endogenae, or Monocotyledonous Plants (preserving de Candolle's Endogenæ phanerogamæ) divided into two tribes, the Petaloidea and Glumaceae. He divided the former, often referred to as petaloid monocots, into 32 orders, including the Liliaceae (defined narrowly), but also most of the families considered to make up the Asparagales today, including the Amaryllideae."]}, {"page": "Apiaceae", "response": ["Apiaceae was first described by John Lindley in 1836.Lindley, J. (1836) An Introduction to the Natural System of Botany, 2nd Edition. Longman, London. The name is derived from the type genus Apium, which was originally used by Pliny the Elder circa 50 AD for a celery-like plant. The alternative name for the family, Umbelliferae, derives from the inflorescence being generally in the form of a compound umbel. The family was one of the first to be recognized as a distinct group in Jacques Daleschamps' 1586 Historia generalis plantarum. With Robert Morison's 1672 Plantarum umbelliferarum distribution nova it became the first group of plants for which a systematic study was published."]}, {"page": "Digitalis", "response": ["*Digitalis × sibirica (Lindley) Werner had been considered a valid species since it was first described by the English botanist and gardener John Lindley in 1821, but it was considered a hybrid of D. grandiflora and D. laevigata by the German botanist  in 1960."]}, {"page": "Joseph Lister", "response": ["Lister left school in the spring of 1844 when he was seventeen. He was unable to attend either Oxford or the University of Cambridge owing to the religious tests that effectively barred him. Lister decided to attend the non-sectarian University College London Medical School, one of only a few institutions which accepted Quakers at that time. He initially studied arts, graduating with a Bachelor of Arts degree with honours in classics and botany in 1847. While he was studying, Lister suffered from a bout of smallpox, a year after his elder brother died of the disease. The bereavement combined with the stress of his classes led to a nervous breakdown. Lister decided to take a long holiday in Ireland, to recuperate and this delayed the start of his medical studies at the university. In October 1848, Lister registered as a medical student. While a student, Lister developed a lifelong interest in histology and experimental physiology.  During his studies, Lister was active in the University Debating Society and the Hospital Medical Society. His main lecturers were John Lindley, Thomas Graham, Robert Edmond Grant, George Viner Ellis and William Benjamin Carpenter but although Lister often spoke about Lindley and Graham in his writings, it was Wharton Jones and William Sharpey who exercised the greatest influence on Lister. As part of his studies, Lister trained first as an intern and then house physician to Walter Hayle Walshe. Then in 1851, in his second year, Lister became a house surgeon, i.e., a dresser, to John Eric Erichsen. It was while Lister worked for Erichsen that his interest in the healing of wounds began."]}, {"page": "Orchidaceae", "response": ["The type genus (i.e. the genus after which the family is named) is Orchis. The genus name comes from the Ancient Greek  (), literally meaning \"testicle\", because of the shape of the twin tubers in some species of Orchis. The term \"orchid\" was introduced in 1845 by John Lindley in School Botany,Online Etymology Dictionary, \"orchid\". as a shortened form of Orchidaceae."]}, {"page": "Saxifragales", "response": ["Saxifragales was first described in 1820 by Berchtold and Presl in 1820 as a group of plants, Saxifrageae, with five genera, including Saxifraga, and therefore bear their names as the botanical authority (Bercht. & J.Presl). At times, that authority has also been given to Dumortier, due to a later publication (1829). Dumortier first used the word Saxifragaceae. By the time of John Lindley's The Vegetable Kingdom (1853), the term Saxifragales was in use, which Lindley called an Alliance, containing five families. Later, the Saxifragales were placed in the angiosperm class Dicotyledons, also called Magnoliopsida."]}, {"page": "Systematics", "response": ["John Lindley provided an early definition of systematics in 1830, although he wrote of \"systematic botany\" rather than using the term \"systematics\".Wilkins, J. S. What is systematics and what is taxonomy? . Available on http://evolvingthoughts.net"]}, {"page": "Sequoiadendron giganteum", "response": ["The first scientific naming of the species was by John Lindley in December 1853, who named it Wellingtonia gigantea, without realizing this was an invalid name under the botanical code as the name Wellingtonia had already been used earlier for another unrelated plant (Wellingtonia arnottiana in the family Sabiaceae). The name \"Wellingtonia\" has persisted in England as a common name. The following year, Joseph Decaisne transferred it to the same genus as the coast redwood, naming it Sequoia gigantea, but again this name was invalid, having been applied earlier (in 1847, by Endlicher) to the coast redwood. The name Washingtonia californica was also applied to it by Winslow in 1854, though this too is invalid, belonging to the palm genus Washingtonia."]}, {"page": "Royal Horticultural Society", "response": ["The RHS is custodian of the Lindley Library, housed within its headquarters at 80 Vincent Square, London, and in branches at each of its four gardens. The library is based upon the book collection of John Lindley."]}, {"page": "List of biologists", "response": ["*John Lindley (1799–1865), English botanistAbbreviation in zoology and in botany: Lindl. whose works included botanical textbooks for his students"]}, {"page": "Epacris impressa", "response": ["A number of specimens once described as separate species are now regarded as Epacris impressa, with no recognised subspecies. Scottish botanist Robert Brown described Epacris ruscifolia in his 1810 work Prodromus Florae Novae Hollandiae et Insulae Van Diemen alongside E. impressa. John Lindley described Epacris tomentosa from plant specimens collected during the third expedition of Thomas Mitchell in 1838. Upon encountering Epacris impressa on Mount William in the Grampians, Mitchell remarked that it was \"A most beautiful downy-leaved Epacris with large, curved, purple flowers, allied to E. grandiflora but much handsomer\". Dr Robert Graham described Epacris ceriflora (which he spelt ceraeflora) from plants cultivated at the Edinburgh Botanic Gardens in 1832. The seed had come from Tasmania, the resulting progeny flowering over April and May 1832.  A year later, he described E. nivalis, which he called an \"exceedingly beautiful species\", from specimens growing in Loddiges nursery. He also noted a form with long corollas that had been called  E. variabilis that was in cultivation at the time, and noted it was difficult to describe the precise characteristics that distinguished E. ceraeflora, E. nivalis, E. variabilis and E. impressa."]}, {"page": "List of botanists", "response": ["*John Lindley"]}, {"page": "Anacardiaceae", "response": ["John Lindley described the \"Essential character\" of the Anacardiaceæ, the \"Cashew Tribe\" in 1831, adopting the order that was described by Jussieu, but abandoning the name Terebintaceæ.  He includes the genera which were found in de Candolle's Anacardieæ and Sumachineæ: Anacardium, Holigarna, Mangifera, Rhus and Mauria."]}, {"page": "Acton, London", "response": ["Acton was lauded as \"blessed with very sweet air\" in 1706 by rector urging a friend in verse to move there. The fashion for medicinal waters brought a brief period of fame, with the exploitation of the wells at Old Oak common, when East Acton and Friars Place were said to be thronged with summer visitors, who had brought about improvement in the houses there. Although high society had left Acton by the mid 18th century, many professional and military men bought houses there, sometimes including a small park, until well into the 19th century. The break-up of the  Fetherstonhaugh estate, which had had no resident owner, produced four or five small estates whose owners, professional men such as Samuel Wegg, John Winter, and Richard White, were active in parish affairs. Grand early homes included: Heathfield Lodge, West Lodge, and East Lodge by Winter c. 1800, Mill Hill House by White, and Woodlands at Acton Hill soon afterwards. Acton Green also became increasingly popular, being near Chiswick High Road (the Great West Road). Fairlawn, substantial, on west side of the green, was the home of the botanist John Lindley (1797–1865) as was the house to the north and Bedford House, another home of Lindley, and Melbourne House further east. A short row of houses had been built on the south side of the green by 1800."]}, {"page": "Joseph Paxton", "response": ["In 1831, Paxton published a monthly magazine, The Horticultural Register. This was followed by the Magazine of Botany in 1834, the Pocket Botanical Dictionary in 1840, The Flower Garden in 1850 and the Calendar of Gardening Operations. In addition to these titles he also, in 1841, co-founded perhaps the most famous horticultural periodical, The Gardeners' Chronicle along with John Lindley, Charles Wentworth Dilke and William Bradbury and later became its editor."]}, {"page": "James Brooke", "response": ["* Rhododendron brookeanum, a flowering plant named by Hugh Low and John Lindley, now included in Rhododendron javanicum"]}, {"page": "Liliaceae", "response": ["The family Liliaceae was described by Michel Adanson in 1763 and formally named by Antoine Laurent de Jussieu in 1789. Jussieu defined this grouping as having a calyx of six equal colored parts, six stamens, a superior ovary, single style, and a trilocular (three-chambered) capsule. By 1845, John Lindley, the first English systematist, unhappily acknowledged the great diversity in the circumscription of the family, and that it had expanded vastly, with many subdivisions. As he saw it, the Liliaceae were already paraphyletic (\"catch-all\"), being all Liliales not included in the other orders, but hoped that the future would reveal some characteristic that would group them better. He recognized  133 genera and 1200 species. By the time of the next major British classification – that of Bentham and Hooker in 1883 (published in Latin) – several of Lindley's other families had already been absorbed into the Liliaceae. Over time the family became increasingly broad and somewhat arbitrarily defined as all species of plants with six tepals and a superior ovary, eventually coming to encompass about 300 genera and 4,500 species within the order Liliales under the Cronquist system (1981). Cronquist merged the Liliaceae with the Amaryllidaceae, making this one of the largest monocotyledon families."]}, {"page": "Eulophia", "response": ["The genus Eulophia was first formally described by John Lindley in 1821 and the description was published in The Botanical Register. Because Robert Brown had previously used the name Eulophia in describing Lissochilus speciosus, and the name of that species was changed to Eulophia speciosa, Brown is the accepted author of the name. \"Eulophia\" is derived from the Ancient Greek words eu meaning \"good\", \"well\" or \"true\" and lophos meaning \"mane\", \"crest\", \"comb\", \"tuft\" or \"ridge\", possibly referring to the labellum callus of some species."]}, {"page": "Allan Cunningham (botanist)", "response": ["It is often thought that Cunningham published few papers on botany and in his obituary, John Lindley wrote, \"How little he regarded posthumous fame is seen by the fewness of his published works, a brief sketch of the Flora of New Zealand being the only systematic account of his Botanical discoveries...\". In fact, although he was effectively barred from publishing on botany whilst employed as \"King's Collector\", he nevertheless later published seven major papers, and 57 shorter papers on subjects including taxonomy, geology, physical geography and zoology. He was one of the first scientists to publish papers on botanical geography."]}, {"page": "Phragmipedium", "response": ["Phragmipedium lindleyanum, named after John Lindley, forms a rosette of five long linear leaves with a yellow margin, reaching a length of 50 cm. The erect raceme can grow as high as 1 m. It is many-flowered and sometimes branched at the basis. The flowers open in succession, giving the orchid a long blooming period. The hoary flowers are green with brown veins. The glabrous, pouchlike lip is yellow, with red veins."]}]}}