{"wiki_id": "http://www.wikidata.org/entity/Q3783581", "itemLabel": "Harvey Lonsdale Elmes", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Harvey_Lonsdale_Elmes", "wikipedia_page": {"main": "Harvey Lonsdale Elmes (10 February 1814 – 26 November 1847) was an English architect, the designer of St George's Hall, Liverpool.", "link_mentions": [{"page": "Ventilation (architecture)", "response": ["Reid's reputation was made by his work in Westminster. He was commissioned for an air quality survey in 1837 by the Leeds and Selby Railway in their tunnel. The steam vessels built for the Niger expedition of 1841 were fitted with ventilation systems based on Reid's Westminster model. Air was dried, filtered and passed over charcoal. Reid's ventilation method was also applied more fully to St. George's Hall, Liverpool, where the architect, Harvey Lonsdale Elmes, requested that Reid should be involved in ventilation design. Reid considered this the only building in which his system was completely carried out."]}, {"page": "1847 in architecture", "response": ["* November 26 – Harvey Lonsdale Elmes, English architect, designer of St George's Hall, Liverpool (born 1814; consumption) "]}, {"page": "1814 in architecture", "response": ["* February 10 – Harvey Lonsdale Elmes, English architect (died 1847)"]}, {"page": "St George's Hall, Liverpool", "response": ["A competition was announced on 5 March 1839 via an advertisement in The Times to design the hall, first prize was 250 guineas, second prize 150 guineas. By July more than eighty entries had been received, and the competition was won by Harvey Lonsdale Elmes, a London architect aged 25 years, the second prize went to George Alexander of London. The requirement was:", ":\"How frequently I observe the great & true end & aim of Art entirely lost sight of in the discussion of some insignificant detail or quaint Antiquarianism. Bold and original conceptions never can find favour while so much stress is laid upon precedent\" Harvey Lonsdale Elmes in a letter to Robert Rawlinson"]}, {"page": "Penshaw Monument", "response": ["*Harvey Lonsdale Elmes—Two designs: a Grecian column topped by a temple containing an urn; and a column with projecting balconies in imitation of a Roman rostral column"]}, {"page": "Charles Robert Cockerell", "response": ["*1851–54 – St. George's Hall, Liverpool, designed the interiors after the death of the architect Harvey Lonsdale Elmes."]}, {"page": "Henry Goodridge", "response": ["Harvey Lonsdale Elmes and W.H. Campbell were his pupils."]}, {"page": "James Elmes", "response": ["He died at Greenwich on 2 April 1862, and was buried at Charlton. The architect Harvey Lonsdale Elmes was his son.", "*A block of large terraced houses at 6–12, Queen Anne's Gate, Westminster (1837). Number 6 was built as the Parliamentary Agency Offices. Designed in collaboration with Harvey Lonsdale Elmes."]}, {"page": "Liverpool College", "response": ["Liverpool College was the first of many public schools founded in the Victorian Era. The foundation stone of the original building was laid on 22 October 1840 by Edward Smith-Stanley, 14th Earl of Derby K.G. (then styled the Rt. Hon. Lord Stanley MP), the first patron of the college.  A group of Christian Liverpool citizens, many of whose names are now famous in the annals of the city, then began the building of a school where education might be combined with 'sound religious knowledge'. The original building in Shaw street (now apartments) is in the so-called Tudor-Gothic style.  It was designed by Mr. Harvey Lonsdale Elmes, and was erected at a cost of £35,000."]}, {"page": "1854 in architecture", "response": ["* St George's Hall, Liverpool, England, completed by Charles Robert Cockerell to the design of Harvey Lonsdale Elmes."]}, {"page": "Parks and open spaces in Liverpool", "response": ["|The park originated as the grounds of Allerton Tower, a house designed by Harvey Lonsdale Elmes and completed in 1849. Liverpool Corporation bought the house and grounds in 1924, and the house was demolished. The park now hosts an outdoors activity centre."]}, {"page": "List of British architects", "response": ["*Harvey Lonsdale Elmes (1813–1847)"]}, {"page": "List of people from Chichester", "response": ["* Harvey Lonsdale Elmes (1813–1847) - architect"]}, {"page": "Allerton Tower Park", "response": ["The park was part of the Manor of Allerton until Hardman Earle acquired the estate and introduced the eponymous mansion based on a design by Harvey Lonsdale Elmes, the famed architect of St George's Hall. The mansion was of classic Italianate design with a tower providing a view of the surrounding countryside. It was completed in 1849; two years after Elmes death."]}, {"page": "Architecture of Liverpool", "response": ["Dominating the area, the magnificent St George's Hall was built 1841–54 to a design by Harvey Lonsdale Elmes and after Elmes's early death C.R. Cockerell designed the interiors, most notably the great hall and small concert room, this last was entirely Cockerell's design. It served a variety of civic functions, including that of a concert hall and as the city's law courts. Alluding to the ancient Roman SPQR, its doors are inscribed with the letters S.P.Q.L. (initials for the Latin phrase Senatus PopulusQue Liverpudliensis—\"the senate and people of Liverpool\"). Together with its grand architecture, this proclaims the municipal pride and ambition of the city in the mid-19th century. Also nearby are Wellington's Column designed by Andrew Lawson with a sculpture by George Anderson Lawson and the Steble Fountain.", "Notable educational buildings of the era are Liverpool Collegiate School, (1840–43) in a Tudor Gothic style by Harvey Lonsdale Elmes. Other institutional buildings include Blackburne House built 1788 and extensively remodelled (1874–76) by W.I. Mason in French Second Empire style, became the Blackburne House Girls' School (1844). The former Royal School for the Blind, Hardman Street, (1849–51) in classical style by A.H. Holme (Now a Trades Union Building), a new building for the school opened in 1899 in Wavertree. An example of a board school, formerly Arnot Street School, Walton, is a post-1870 education school and was designed by Edmund Kirby (1884 extended 1894), other surviving board schools are, Chatsworth School (1874), Edge Hill, designed by Thomas Mellard Reade,Pevsner & Pollard (2006), p413 who also designed Granby Street School (1880), Toxteth.Sharples (2004), p475 Liverpool College of Art designed by Thomas Cook and opened in 1883 in the Queen Anne style architecture.Sharples (2004), p236 At the end of the period the College of Technology and Museum Extension was built to the designs of Edward William Mountford, completed (1901). The first branch library in the city was Kensington Library 1890 extended 1897, Edge Hill by the City of Liverpool Surveyor Thomas Shelmerdine,Pevsner & Pollard (2006), p412 who also designed Everton Library, built in 1896, also the designed by Shelmerdine is the Technical Institute, Picton Road, Wavertree.Pevsner & Pollard (2006), p494 The former St Austin's school (1860), Aigburth Road provided elementary education for the local Roman Catholic population of Aigburth.Pevsner & Pollard (2006), p383 Henry Clutton designed a major extension (1877) to St Francis Xavier's College, Liverpool for the Roman Catholic Church to provide education for adherents of the Church. The former Gordon Working Lads' Institute (1886) by David Walker, in a northern Renaissance style, it provided technical education for the working class and contained classrooms, gymnasium and concert hall, it was paid for by merchant and ship owner William Cliff.Pevsner & Pollard (2006), p435 The equivalent for girls was the Bankhall Girls' Institute (1889), Stanley Road, Kirkdale, this was funded by Thomas Worthington Cookson, merchant and shipowner.Giles (2008), p41 The Catholic church built St Vincent's School for the Blind (1899), Yew Tree Lane, West Derby.Giles (2008), p73", "Buildings for health care and social provisions include the Adult Deaf and Dumb Institute now, Merseyside Centre for the Deaf by E.H. Banner in a red brick gothic; the now-demolished Liverpool Sailors' Home provide hospitality and a bed for the night for sailors visiting the city. Hospitals founded in the period include Liverpool Maternity Hospital; founded in 1741 the Liverpool Royal Infirmary underwent vast expansion in the late 1880s. Lunatics were catered for at the now-demolished Lunatic asylum, Rainhill Hospital (1846–51) designed by Harvey Lonsdale Elmes, just outside the city. Workshop for the Outdoor Blind (1870), Cornwallis Street, designed by G.T. Redmayne, provided employment for the blind, who made baskets, matting and brushes.Giles (2008), p71 The YMCA building, Mount Pleasant was built (1874–77), l designed in a gothic style by H.H. Vale, it contained a gymnasium, reading room, library, lecture hall and classrooms. Church House (1885), Hanover Street by Walter Aubrey Thomas built to house the Central Institute of the Mersey Mission to Seaman and a temperance public house;Pevsner & Pollard (2006), p324 The former Eye and Ear Hospital (1878–80), Myrtle Street by C.O. Ellison, in an old English style, also in Myrtle Street and by C.O. Ellison is the former Sheltering Home for Destitute Children (1888–89).Pevsner & Pollard (2006), p378 The former Liverpool Homeopathic Hospital (1887) was designed by F & G Holme in the French Renaissance architecture style.Sharples (2004), p237 The Florence Institute (1889) is the oldest surviving purpose-built boys' club in Britain, probably designed by H.W. Keef, paid for by merchant Bernard Hall.Sharples (2004), p273 The Gordon Smith Institute for Seaman (1899) by James Strong of Walker & Strong, in Paradise Street, was created to provide seamen with a library, reading room and assembly hall.Sharples (2004), p208 Former Eye and Ear Hospital, 3-5 Myrtle Street, was designed by C.O. Ellsion. The former Walton Workhouse (1864–68) was designed by William Culshaw. The New Hall complex (1887–89), Longmoor Lane, Fazakerley, designed by Charles H. Lancaster, was built as cottages to house deprived children, the group of cottages is terminated by a monumental hall with a clock tower.Pevsner & Pollard (2006), p428", "St Michael's Manor (also known as Springwood Manor) (1839) and its associated lodge on Woolton Road is a classical style mansion by John Cunningham.Pevsner & Pollard (2006), p391 There is a fine classical style house Thingwall Hall, an 18th-century building that was remodelled (c.1846-47) by Harvey Lonsdale Elmes,Pevsner & Pollard (2006), p438 also by Elmes are the classical Lodge on Woolton Road and the Orangery to the now demolished Allerton Tower and the Lodge to his demolished house of Druid's Cross, Allerton. An Italianate stuccoed house of the 1840s is Hartfield. Lowlands in West Derby is an Italianate house built by Thomas Haigh architect for himself.Pevsner & Pollard (2006), p504 The Gateacre Grange, Rose Brow, Gateacre, is a large gabled Jacobethan house built 1866 by Cornelius Sherlock for the brewer Sir Andrew Barclay Walker, the house was extended in 1883 to the designs of Sir Ernest George and Harold Peto, converted to apartments in 2005.Pevsner & Pollard (2006), p433 The Jacobethan style, Camp Hill Lodge (1868) served as an entrance to Camp Hill, once part of the Woolton Hall estate. Classical alterations to the lodge at Sudley House it was remodelled (1885) leaving the early elements of the earlier structure, creating a Jacobethan look probably by the architect James Rhind who extended the main house at this time.", "* Harvey Lonsdale Elmes designed Liverpool Collegiate School, Shaw Street (1840–43); St George's Hall (1841–54); remodelled Thingwall Hall (1846–47) Knotty Ash; Rainhill Hospital (1846–51)"]}, {"page": "14 Prince's Gate, London", "response": ["The terrace containing 13 and 14 Prince's Gate was completed in 1849. It was designed by Harvey Lonsdale Elmes and built by John Kelk. Shortly after completion of the terrace, the Crystal Palace was built opposite in Hyde Park to house the Great Exhibition of 1851. The first owner of No. 13 was George Baker, a building contractor. No. 14 was leased and then owned by John Pearce, but he did not live there. The first resident, from 1852, was Edward Wyndham Harrington Schenley, a former soldier, who later bought the freehold."]}, {"page": "Grade II listed buildings in Liverpool-L18", "response": ["|The stable block was designed by Harvey Lonsdale Elmes in Italianate style.  It is in stone with a hipped slate roof.  The block has two storeys, and extends for eight bays, the fourth bay projecting forward under a pediment.  The windows in the lower floor are sashes, in the upper floor they are casements.  At the rear of the block is a small belvedere-like tower with angle pilasters, round-headed openings, a corbelled cornice, and a hipped roof.", "|This was built as the lodge to Druid's Cross House (now demolished), and designed by Harvey Lonsdale Elmes.  It is in stone with a hipped slate roof.  The lodge is in a single storeys, and has a three-bay front, the first bay projecting forward.  At the top of the lodge is an entablature and a frieze.  The entrance is in the centre, and has an architrave and a cornice.  The windows are a mix of casements and sashes."]}, {"page": "Grade II listed buildings in Liverpool-L25", "response": ["|The outbuildings were designed by Harvey Lonsdale Elmes.  They are in brick with stone dressings, have a slate roof, and are in an H-plan.  The buildings are in two storeys, and contain sash windows, with lunettes in the upper floor.  The central entrance has a gable containing a roundel.", "|The lodge and gate piers were designed by Harvey Lonsdale Elmes.  The lodge is stuccoed with a slate roof.  It is in a single storey and has a two-bay front.  On the front is a circular Doric porch leading to a concave entrance; the porch is surmounted by a cupola.  The windows are round-headed sashes in square-headed architraves.  The stone gate piers are rusticated with cornices, and round-headed openings.", "|The orangery was designed by Harvey Lonsdale Elmes as part of his plans for the house, Allerton Tower.  The house was demolished in the 1920s, and the orangery is without its glass.  It extends for 14 bays and has a Tuscan colonnade.  There are pavilions at the ends, the one on the right having a Tuscan porch."]}, {"page": "Liverpool Collegiate School", "response": ["The Collegiate is a striking, Grade II listed building, with a facade of pink Woolton sandstone, designed in Tudor Gothic style by the architect of the city's St. George's Hall, Harvey Lonsdale Elmes. The foundation stone was laid in 1840 and the Liverpool Collegiate Institution was opened by William Gladstone on 6 January 1843, originally as a fee-paying school for boys of middle-class parents and administered as three distinct organisations under a single headmaster. The Upper School became Liverpool College and relocated to Lodge Lane in 1884, whilst the Middle and Lower (or Commercial) Schools occupied the original site and would combine to form the Liverpool Collegiate School in 1908."]}, {"page": "David Boswell Reid", "response": ["Reid's ventilation method was also applied more fully to St. George's Hall, Liverpool, the only building, he said, in which his system was completely carried out. In this case the architect Harvey Lonsdale Elmes requested in 1841 that Reid should be involved in ventilation design."]}, {"page": "Rainhill Hospital", "response": ["The facility was designed by Harvey Lonsdale Elmes and opened as the Third Lancashire County Lunatic Asylum on 1 January 1851. Additional wings designed by Henry Horner were completed in 1860. It became the County Lunatic Asylum, Rainhill in 1861."]}, {"page": "Listed buildings in Huyton with Roby", "response": ["|A country house remodelled in about 1846–47 by Harvey Lonsdale Elmes and later used as a residential school.  It is stuccoed with a slate roof, and in two storeys with a front of eight.  On the front is a Doric porch with an Ionic entablature and pairs of fluted columns, behind which is a round-headed doorway with a fanlight.  On the right side is a two-storey canted bay window."]}, {"page": "Listed buildings in New Brighton, Merseyside", "response": ["|A stone house with a slate roof by Harvey Lonsdale Elmes.  It has two storeys and a basement, and a front of four bays with a recessed service wing.  The first and third bays project forward with gables and pinnacles.  The entrance is in the third bay and has a Tudor arched doorway with foliate spandrels, and a hood mould.  Some of the windows are mullioned and transomed, and others are 20th-century casements.  At the rear is a central canted bay window, a loggia, and a traceried balustrade."]}, {"page": "Elmes", "response": ["*Harvey Lonsdale Elmes (1814–1847), English architect"]}, {"page": "List of people from Sussex", "response": ["* Harvey Lonsdale Elmes (1814-1847), architect"]}, {"page": "Hardman Earle", "response": ["Earle bought part of the Allerton Hall Estate and on it built a mansion called Allerton Tower. It was a grand Italianate building with a tower, designed by Harvey Lonsdale Elmes. The mansion was demolished and only associated buildings remain. The locality has now become Allerton Tower Park."]}]}}