{"wiki_id": "http://www.wikidata.org/entity/Q3784306", "itemLabel": "Toddla T", "itemDescription": "British DJ and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Toddla_T", "wikipedia_page": {"main": "Thomas Mackenzie Bell (born 22 February 1985), better known by the stage name of Toddla T, is an English DJ, record producer, remixer and songwriter from Sheffield, South Yorkshire.", "link_mentions": [{"page": "BBC Radio 1", "response": ["On 7 December 2011, Ben Cooper's first major changes to the station were announced. Skream & Benga, Toddla T, Charlie Sloth and Friction replaced Judge Jules, Gilles Peterson, Kissy Sell Out and Fabio & Grooverider. A number of shows were shuffled to incorporate the new line-up. On 28 February 2012, further changes were announced. Greg James and Scott Mills swapped shows and Jameela Jamil, Gemma Cairney and Danny Howard joined the station. The new line-up of DJs for In New DJs We Trust was also announced with B.Traits, Mosca, Jordan Suckley and Julio Bashmore hosting shows on a four weekly rotation. This new schedule took effect on Monday, 2 April 2012.", "This meant that The Radio 1 Breakfast Show was extended by 30 minutes until 10:30 am. Also, Scott Mills' show was shortened by 30 minutes from 4 to 3:30 pm. Toddla T was also announced to be leaving the show after 11 years. Annie Mac's evening show moved from 7 pm to 6 pm with Rickie, Melvin and Charlie from 8 pm. Jack Saunders would host a new show called Radio 1's Future Artists with Jack Saunders from Monday to Wednesday."]}, {"page": "Ninja Tune", "response": ["In 2010, Ninja Tune celebrated 20 years of releasing music. A book entitled Ninja Tune: 20 Years of Beats and Pieces was released on 12 August 2010, and an exhibition was held at Black Dog Publishing's Black Dog Space in London showcasing artwork, design and photography from the label's 20-year history. A \"stunning futurespective\" compilation album was released on 20 September in two formats – a regular version consisting of two 2-disc volumes, and a limited edition (of 3,500 copies), containing six CDs, six 7\" vinyl singles, a hardback copy of the book, a poster and additional items. It featured new music from Amon Tobin (also as Two Fingers), Roots Manuva, The Cinematic Orchestra, Kid Koala, Mr Scruff, The Bug, King Geedorah, Zomby, Bonobo, Toddla T, Daedelus, Dorian Concept, Floating Points, Wagon Christ, cLOUDDEAD and many others. It also included new remixes from Switch, Autechre, Benga, Cut Chemist, Modeselektor, Roots Manuva, Diplo, Gold Panda, Mark Pritchard, Rustie, Prefuse 73, 808 State, Joe Goddard, King Jammy, The Orb, Micachu, Gaslamp Killer, Kronos Quartet, Mala, El-P (and El-B) and many more. In The Independent's \"Album of the Week\" review, the compilation was deemed \"a glorious celebration of Ninja Tune's audio splendour\".", "As part of the 20th anniversary, Ninja Tune produced 20 different events around the world. Ninja Tune sold out Royal Albert Hall in London, with The Cinematic Orchestra, Amon Tobin and Dorian Concept all presenting a one-off orchestral performance with the London Metropolitan Orchestra arranged by composer Ilan Eshkeri. For a separate London event, Ninja also placed a legendary rave in 3 rooms in a car park behind the Tate Modern with all of their artists in one place for first time (artists included Coldcut, Mr Scruff, Roots Manuva, Toddla T, The Bug, Daedelus, Kid Koala, Bonobo, Dj Food + DK, Mark Pritchard, DJ Kentaro, Dorian Concept, XXXchange (Spank Rock), DELS, Floating Points, Jammer, Dark Sky and Offshore). For the Ninja XX gig in New York, the label's venue (Santos Party House) was shut down unexpectedly, moving the event at the last minute to the Bowery (CITATION: Brooklyn Vegan, 28 October 2010).", "It was around this time that Ninja Tune began expanding its roster in an interesting new direction, co-signing underground labels with whom they felt artistically aligned. In February 2010, LA-based producer Flying Lotus, a.k.a. Steven Ellison, announced his Brainfeeder imprint had struck up a partnership for Ninja Tune to handle manufacturing, marketing and distribution for Brainfeeder everywhere outside the US. In April 2010, Sheffield-born producer and DJ Toddla T (who'd originally arrived at Ninja having produced parts of Roots Manuva's 2008 album, Slime & Reason, which reached number 22 in the UK Charts) also signed his Girls Music record label to Ninja Tune for distribution, manufacturing and marketing, in addition to signing a three-album deal. In June 2012, Ninja announced a partnership with underground artist Actress and his Werkdiscs imprint, home to Zomby's Where Were U in 92?, Actress's Hazyville, and various records by Lukid and Lone.", "On 19 May 2017, Ninja Tune Founders Coldcut and Adrian Sherwood released their collaborative debut album Outside The Echo Chamber via Ninja imprint Ahead of our Time. Collaborators that featured on the album included Lee \"Scratch\" Perry, Roots Manuva, Junior Reid, Ce’Cile, Sugar Hill Gang alumni Skip McDonald and Doug Wimbish on Guitar and Bass respectively and production from Toddla T.", "*Toddla T"]}, {"page": "List of hip hop musicians", "response": ["* Toddla T"]}, {"page": "Benjamin Zephaniah", "response": ["*Rebel by Toddla T (2009) 1965 Records"]}, {"page": "Yorkshire dialect", "response": ["A number of popular bands hail from Yorkshire and have distinctive Yorkshire accents. Singer-songwriter YUNGBLUD, originating from Doncaster, preserves a strong Yorkshire accent. Louis Tomlinson, who was a member of One Direction, is from Yorkshire and in his solo music his accent is often heard. Joe Elliott and Rick Savage, vocalist and bassist of Def Leppard; Alex Turner, vocalist of the Arctic Monkeys; Jon McClure, of Reverend and The Makers; Jon Windle, of Little Man Tate; Jarvis Cocker, vocalist of Pulp; and Joe Carnall, of Milburn and Phil Oakey of The Human League are all known for their Sheffield accents, whilst The Cribs, who are from Netherton, sing in a Wakefield accent. The Kaiser Chiefs originate in Leeds, as does the Brett Domino Trio, the musical project of comedian Rod J. Madin. Graham Fellows, in his persona as John Shuttleworth, uses his Sheffield accent, though his first public prominence was as cockney Jilted John. Toddla T, a DJ on BBC Radio 1 and 1Xtra, has a strong Sheffield accent and often uses the phrase \"big up thysen\" (an adaptation into Yorkshire dialect of the slang term \"big up yourself\" which is most often used in the music and pop culture of the Jamaican diaspora). Similarly, grime crews such as Scumfam use a modern Sheffield accent, which still includes some dialect words."]}, {"page": "V Festival", "response": ["* Toddla T", "* Toddla T"]}, {"page": "Fuzz Club", "response": ["In the mid-2000s, the club also hosted one day festivals, called Fuzztival with acts like Metronomy, Ebony Bones, Hot Chip and Toddla T on the line-up."]}, {"page": "Annie Mac", "response": ["Annie Mac was born in Dublin, Ireland on 18 July 1978. After attending Wesley College in Dublin, she studied English literature at Queen's University Belfast, Northern Ireland. Annie lives in Queen's Park, London. She has a son (born May 2013) with her husband DJ Toddla T. She gave birth to her second child on 6 January 2017. While she was on maternity leave her radio show was presented by MistaJam and then Mac returned to the station on 12 June 2017. Her brother, Davey MacManus, was the lead singer and guitarist in bands The Crocketts and The Crimea. Annie Mac is a sports fan supporting North London football team Tottenham Hotspur F.C.FA Cup third-round predictions – Lawro v Radio 1 DJ Annie Mac", "On 20 April 2021, Mac announced that she would be leaving Radio 1 after 17 years broadcasting, citing the need to spend more time with her husband Toddla T and her children. She made the emotional announcement live on air during Greg James' Radio 1 Breakfast Show. It was also announced that fellow Radio 1 DJ, Clara Amfo, would take over Annie's Future Sounds show from July, while Danny Howard would take over the Radio 1's Dance Party show. Annie Mac's final Radio 1 show was broadcast on 30 July 2021.BBC Radio 1 Breakfast Show with Greg James - 20 April 2021."]}, {"page": "Solid Steel", "response": ["Toddla T, "]}, {"page": "Thomas Bell", "response": ["*Thomas Bell (born 1985), known professionally as Toddla T, English DJ and producer"]}, {"page": "DJ Mag", "response": ["|Hannah Holland, Ikonika, Mark Henning, Toddla T"]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["* Toddla T Sound"]}, {"page": "Shola Ama", "response": ["| \"Take It Back\" (Toddla T featuring Shola Ama and J2K)"]}, {"page": "Tru Thoughts", "response": ["The label has worked with an impressive list of collaborators and remixers over the years, including Skream, Stevie Wonder, Daedelus, Cut Chemist, Aloe Blacc, MJ Cole, Beth Rowley, Toddla T, Prins Thomas, Clark, Sam Sparro, Falty dL, Flux Pavilion, Rizzle Kicks, Megan Washington, Tim Rogers, Roy Ayers, True Tiger, Tawiah, Common, Angie Stone, Maxi Jazz, Adrian Utley and many more. Tru Thoughts has also discovered various notable artists who subsequently signed to other record labels; Bonobo signed to Ninja Tune, Chris Clark signed to Warp Records, Jon Kennedy to Grand Central Records, Chroma to LTJ Bukem's Good Looking Records and The Capoeira Twins signed to Timo Maas' Hope Recordings."]}, {"page": "Steve Osborne", "response": ["* 2012: Toddla T = Mixer – Forthcoming Tracks"]}, {"page": "Fabric discography", "response": ["*FABRICLIVE.47 - Toddla T (August 2009)"]}, {"page": "Culture of Sheffield", "response": ["Sheffield also has a small urban music scene. This consists of R'n'B, UK Hiphop/boombap, Grime, Bassline and Speed Garage. It is home to artists such as Hoodz Underground, Yeshua, Otis Mensah, DanimaL, The Ruby Kid, Toddla T The Red Eye Knights and Constant Creation, it is part of the Yorkshire Hip Hop scene. The Speed Garage scene has surfaced in Sheffield with a unique modern sound compared to older speed garage. Born from the nightclub Niche, the music has various other terms such as Bassline House or Niche itself, but was born in Sheffield and has now spread out to other cities in the United Kingdom. It varies differently from other cities Soulful Vocal UK Garage, and the beats are not two step."]}, {"page": "Gyptian", "response": ["The song also became popular in the UK, and was released there on 7 November by Ministry of Sound Recordings, in an EP which will include remixes by Shy FX, Major Lazer and Toddla T."]}, {"page": "21 Seconds", "response": ["On 6 September 2019 So Solid Crew went to the Red Bull Music Studios, London, and remixed \"21 Seconds\" with Toddla T. They were joined by D Double E, Ms Banks and DJ Q as they added new verses."]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| Scouting For Girls || || Pegasus Bridge || Toddla T & Alex Metric", "Toddla T", "Toddla T", "Toddla T"]}, {"page": "Evolution Festival", "response": ["*Toddla T"]}, {"page": "Matt Helders", "response": ["In 2008, Helders remixed \"T.H.E.H.I.V.E.S\", the Hives's fourth single from The Black and White Album, and \"Skin Divers\", Duran Duran's second single from Red Carpet Massacre. He played a few TV shows with We Are Scientists in the UK as well as remixing their second single \"Chick Lit\" as a B-side for the vinyl release. He is featured on Toddla T's album Skanky Skanky. He remixed \"Again & Again\" for Roots Manuva, which gained airplay from Zane Lowe on BBC Radio 1.", "*Toddla T – \"Boom Dj From The Steel City\" (2009)", "*Toddla T – \"Better\" (2009)"]}, {"page": "List of Old Edwardians (Sheffield)", "response": ["* Toddla T (born 1985) – musician and DJ"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Paul Foot and Toddla T"]}, {"page": "Little Glitches", "response": ["Following that, the band retreated into the studio at the end of August 2010 and began to pro-actively collaborate with other local musicians and writers such as Lisa Palmer, who has previously worked with Animat, Laura Burn Acaster of Little Robots and The Shaking Whips, Bennett Holland who is currently (2011) also working with Toddla T, King King and Jube, Julie Clarkson, also of Jube, Kieron Wright The Shaking Whips and The Jesus Loves Heroin Band, Chuffy Stanley and many others. Since February 2011, the band have been posting monthly tracks on their blog showcasing the first fruits of these collaborations."]}, {"page": "List of musicians from Sheffield", "response": ["*Toddla T"]}, {"page": "Hervé (DJ)", "response": ["Hervé is founder of the collaborative group Machines Don't Care which has seen tracks with guests such as Sinden, Trevor Loveys, Affie Yusuf, Toddla T, Fake Blood, Detboi & Drop the Lime."]}, {"page": "Jersey Live", "response": ["* Toddla T & MC Serocee"]}, {"page": "Wakestock (Wales)", "response": ["* Toddla T & MC Serocee"]}, {"page": "Andrea Martin (musician)", "response": ["! scope=\"row\"| \"Always\"  (Toddla T featuring Andrea Martin & Silkki Wonda)", "! scope=\"row\"| \"Magnet\"  (Toddla T featuring Andrea Martin)", "| rowspan=\"1\"| Toddla T, Silkki Wonda", "| rowspan=\"1\"| Toddla T, Stefflon Don", "| rowspan=\"2\"| Toddla T", "| rowspan=\"1\"| Toddla T, Coco", "| rowspan=\"2\"| Toddla T", "| rowspan=\"1\"| Toddla T, CASisDEAD"]}, {"page": "1965 Records", "response": ["*Toddla T"]}, {"page": "Culture of Yorkshire", "response": ["Yorkshire has also contributed heavily to the emergence of the electronic music industry from the 1990s until the present day. The nightclubs of Leeds and Sheffield helped to build the foundations for record labels such as Warp Records. The region has also been influential in the development of bassline, producing a huge hit with T2's \"Heartbroken\" in 2007, and has produced grime crews such as Scumfam. Music in these and related genres has been championed by Toddla T, a Sheffield-born DJ on BBC radio."]}, {"page": "You Know Me Better", "response": ["#\"You Know Me Better\" (Toddla T Mix) – 3:07", "#\"You Know Me Better\" (Toddla T Vocal) – 3:07"]}, {"page": "Rye Rye", "response": ["*\"I Kiki\" (2012)  (Toddla T vs Scissor Sisters featuring Spank Rock & Rye Rye)"]}, {"page": "NOS Alive", "response": ["Branko<BR>Boys Noize<BR>Gunrose<BR>Diplo<BR>Dillon Francis<BR>Toddla T<BR>D'Alva com Gospel Collective<BR>Kuroma<BR>Matilha"]}, {"page": "Lounge On The Farm", "response": ["*Toddla T", "*Toddla T"]}, {"page": "Mica Levi", "response": ["Levi moved to London in their teens and performed as a DJ and released a mixtape titled Filthy Friends, which was posted on their official Myspace page. For Filthy Friends they enlisted the help of friends and musicians of various backgrounds including MCs Baker Trouble, Brother May, Man Like Me & Ghostpoet, singer-songwriter Jack Peñate, jazz band Troyka, London pop-band Golden Silvers as well as producers Kwes and Toddla T. Following its release, Filthy Friends became sought after on the London club scene."]}, {"page": "List of UK garage artists", "response": ["* Toddla T"]}, {"page": "List of Essential Mix episodes", "response": ["| 26 June || Annie Mac, Chase & Status, Rusko, Skream, Toddla T || Extended 4 hour Essential Mix live from Glastonbury, UK ", "| 2 May || Toddla T ||"]}, {"page": "Bashy", "response": ["|\"Who Wants to Be a Millionaire\" (featuring Toddla T)"]}, {"page": "Wayne Marshall (deejay)", "response": ["In 2009, he was featured in the dancehall remix to Jamie Foxx's \"Blame It\". Marshall's single, \"Messing with My Heart\", featuring Mavado, from his third album was released in November 2010. Marshall collaborated with British musician Toddla T on the track \"Streets So Warm\", which was released as the third single from his 2011 album Watch Me Dance."]}, {"page": "The Invisible (band)", "response": ["Outside of the band endeavours, members have embarked on production and session work. Dave Okumu has co-written and produced South London singer Jessie Ware's debut album, Devotion, which was later recognised as Album of the Year (2012) by the Mercury Prize.\"Jessie Ware\" Mercury Prize, [retrieved on 22/04/2013] Okumu has performed and recorded with many artists such as Amy Winehouse, St. Vincent, Jane Birkin, Sara Creative Partners, Brigitte Fontaine, Theo Parrish, Tony Allen, King Sunny Adé, Omar, Matthew Herbert, Dani Siciliano, Toddla T, Bilal, Jack De Johnette, Róisín Murphy, Rosie Lowe and Anna Calvi.\"Dave Okumu\" Universal Music Publishing Group, [retrieved on 22/04/2013] Tom Herbert continues to play as part of post-jazz band Polar Bear; Leo Taylor has contributed drums for Jessie Ware's second single \"Running\", Kate Nash's album \"Made of Bricks\", Kano's album \"Home Sweet Home\" and Adele's second album 21, including its leading single \"Rolling In The Deep\"."]}, {"page": "Tramlines Festival", "response": ["Tramlines held its first festival in 2009. Notable artists such as Rolo Tomassi, Just Jack, Toddla T, Pixie Lott, Little Boots, Example, The Eighties Matchbox B-Line Disaster, The XX and Reverend and The Makers, who headlined, played at the festival. The festival was a huge success, attracting 35,000 fans. The organizers, as well as councillors and Sheffielders, praised the festival. The festivals popularity, along with positive reviews, led to the 2010 event being announced. The festival-goers had to queue to get wristbands, which gave them access to the different stages.", "Tramlines Festival 2010 was held from 23 to 25 July. 250 artists performed, and several venues were added, including Sheffield University's Octagon Centre, Tudor Square, The Leadmill, O2 Academy Sheffield, Winter Gardens and the main stage at Devonshire Green increased in capacity from 5,000 to 8,000. Headliners were Echo and the Bunnymen, Mystery Jets, Simian Mobile Disco DJ set, Professor Green, Tinchy Stryder, Future of the Left, Darwin Deez, Macka B, The King Blues, The Hoosiers, Craig David, Dum Dum Girls, Annie Mac and Toddla T.", "Tramlines 2011 took place from 22 to 24 July, with an estimated 175,000 revellers in attendance.  Over 70 venues took part, with four main stages and at least 200 live acts. Headliners and other notable acts included Ash, Olly Murs, Pixie Lott, The Futureheads, Heaven 17, Dananananaykroyd, David Rodigan, Dry The River, Michael Prophet, Frankie & The Heartstrings, Los Campesinos!, Rolo Tomassi, Dead Sons, Skint & Demoralised, The Crookes and Toddla T. New additions were made to the festival, including 'The Folk Forest', a folk music event taking place in Endcliffe Park, 1.5 miles from the city centre.", "Tramlines 2012 took place on Friday 20 July to Sunday 22 July. Headliners included Reverend & The Makers, Roots Manuva and We Are Scientists, with Spector, Ms Dynamite, Mr Scruff, Julio Bashmore, Toddla T, Koreless, Ifan Daffyd, Clock Opera and Dead Sons also playing over the weekend, amongst others. Weston Park hosted a stage for the first time in the festival's history."]}, {"page": "Catch Me If You Can (Bashy album)", "response": ["# \"Who Wants to Be a Millionaire?\" (featuring Toddla T)"]}]}}