{"wiki_id": "http://www.wikidata.org/entity/Q3786298", "itemLabel": "Hollie Avil", "itemDescription": "English former triathlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Hollie_Avil", "wikipedia_page": {"main": "Hollie May Avil (born 12 April 1990) is an English former triathlete who was the European and World junior triathlon champion in 2007 and U23 World Champion in 2009. She is the youngest athlete ever to be on the podium at successive debut World Cup races and the youngest triathlete to have ever been ranked World Number One at only 18 years old. Still to this day, Avil is the youngest triathlete to have competed in the Olympic Games.In 2007 Avil was shortlisted for BBC Young Sports Personality of the year. In 2008, she was crowned British Olympic Association Triathlete of the Year.\nAvil competed in triathlon at the 2008 Summer Olympics but did not finish the race.  Like her coach, Bright's, other athlete, Tim Don, she suffered a sickness that caused her continual vomiting and weakness during the race. During the bike section, Avil had to retire.\nAvil started her degree at Loughborough University shortly after her Olympic journey in summer of 2008. Her 2009 season started with disappointment at the Madrid World Championship Series as she failed to finish the race due to mechanical problems with her bike. However, Avil's 2009 season ended on a high as she was crowned U23 World Champion on the Gold Coast, Australia.\nIn December 2011, Avil was one of 12 British female sporting celebrities who posed for Clara Maidment a charity calendar in aid of Wellbeing of Women, in the lingerie of Nichole de Carle, wearing jewellery by Salima Hughes and Coster Diamonds.In May 2012, Avil announced her retirement from competitive sport following her recovery from an eating disorder.In late 2012 Avil moved to Singapore to pursue a career in sports marketing and event management.\nAvil works as a Relationship Manager for Manchester United, for three years based in Hong Kong, returning in 2019 to rejoin UK operations.", "link_mentions": [{"page": "Ben Bright", "response": ["Bright is now the head coach for the British Triathlon High Performance centre in Loughborough. He was personal coach to Tim Don and Hollie Avil at the 2008 Olympics."]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Hollie Avil"]}, {"page": "Andrea Hewitt", "response": ["At the beginning of the 2010 season Hewitt won the Oceania Championships and then achieved six top ten positions at the Elite Cup in Hy-Vee and at five of the six World Championship Series triathlons. In the World Championship Rankings 2010, Hewitt was number sixth. In France, Hewitt again represented Beauvais in the Lyonnaise des Eaux circuit and again played the decisive role. At Dunkirk and at Tourangeaux she won the gold medal, at the Grand Final of the Lyonnaise circuit in La Baule (Triathlon Audencia) she won silver. Hewitt did not take part at Beauvais and Paris, where Hollie Avil was the best triathlete of her club. Thus in 2010 again Beauvais owes its first place in the overall ranking of the French Club Championship to Andrea Hewitt and Hollie Avil, Anja Dittmer, and Vicky Holland. At La Baule there were no French triathletes among the three  of Beauvais at all."]}, {"page": "Triathlon at the 2008 Summer Olympics – Qualification", "response": ["|   Emma Snowsill Debbie Tanner Laura Bennett Anja Dittmer Joelle Franzman Hollie Avil Andrea Hewitt Nicola Spirig Lauren Groves Elizabeth May Jessica Harrison Magali di Marco Ricarda Lisk Erin Densham Carole Péon Eva Dollinger Kiyomi Niwata Juri Ide Nadia Cortassa Lisa Nordén Daniela Ryf Kathy Tremblay Kirsten Sweetland Vendula Frintová Ainhoa Murua Irina Abyssova Kate Roberts Mariana Ohata Tania Haiböck Lenka Zemanova Ana Burgos Kate Allen Ewa Dederko Emma Davis Xing Lin Lisa Mensik Wang Hongni Maria Czesnik Yuliya Spunova Olga Zaousailova Charlotte Bonin Zita Szabó Birgitta Berk"]}, {"page": "Emmie Charayron", "response": ["Thanks to Emmie Charayron, in 2009 her French triathlon club Brive Limousin placed eighth in the prestigious French Club Championship Series Lyonnaise des Eaux and achieved this top-ten placement without hiring foreign champions. The winning club, Beauvais, however, owed its success almost exclusively to the international stars Hollie Avil, Anja Dittmer, Andrea Hewitt and Vickie Holland."]}, {"page": "Grand Prix de Triathlon", "response": ["* Charleville Tri Ardennes: Hollie Avil, Anja Dittmer, Olga Dmitrieva, Karolien Geerts, Sarah Groff, Vicky Holland, Emma Moffatt, Delphine Py-Bilot, Marie Rabie, Alexandra Razarenova, Doumic Letot, Katrien Verstuyft.", "* Not only do the foreign guest stars outnumber the French participants and play the decisive role: the French triathletes, too, often lack any relation with the club they represent. The bronze-medalist club of Dunkirk 2010 and the overall Grand Prix winner of the year 2009, Beauvais Tri, for instance, signed four international elite stars on, Andrea Hewitt, Vicky Holland, Hollie Avil and Anja Dittmer, plus the Southern French triathletes Delphine Py Bilot from Montpellier and Charlotte Morel from Boulouris, both of whom live and train far away from Beauvais."]}, {"page": "Holly Avil", "response": ["#REDIRECT Hollie Avil"]}]}}