{"wiki_id": "http://www.wikidata.org/entity/Q378157", "itemLabel": "Edwin Lutyens", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Lutyens", "wikipedia_page": {"main": "Sir Edwin Landseer Lutyens  ( LUT-yənz; 29 March 1869 – 1 January 1944) was an English architect known for imaginatively adapting traditional architectural styles to the requirements of his era. He designed many English country houses, war memorials and public buildings. In his biography, the writer Christopher Hussey wrote, \"In his lifetime (Lutyens) was widely held to be our greatest architect since Wren if not, as many maintained, his superior\". The architectural historian Gavin Stamp described him as \"surely the greatest British architect of the twentieth (or of any other) century\".Lutyens played an instrumental role in designing and building New Delhi, which would later on serve as the seat of the Government of India. In recognition of his contribution, New Delhi is also known as \"Lutyens' Delhi\". In collaboration with Sir Herbert Baker, he was also the main architect of several monuments in New Delhi such as the India Gate; he also designed Viceroy's House, which is now known as the Rashtrapati Bhavan.\nMany of his works were inspired by Indian architecture. He was elected Master of the Art Workers' Guild in 1933.", "link_mentions": [{"page": "Dartmoor", "response": ["* Castle Drogo – Edwardian faux castle built by Edwin Lutyens on a crag above Teign Gorge, Drewsteignton"]}, {"page": "Georgian architecture", "response": ["In the early decades of the twentieth century when there was a growing nostalgia for its sense of order, the style was revived and adapted and in the United States came to be known as the Colonial Revival. The revived Georgian style that emerged in Britain during the same period is usually referred to as Neo-Georgian; the work of Edwin Lutyens and Vincent Harris includes some examples. The British town of Welwyn Garden City, established in the 1920s, is an example of pastiche or Neo-Georgian development of the early 20th century in Britain. Versions of the Neo-Georgian style were commonly used in Britain for certain types of urban architecture until the late 1950s, Bradshaw Gass & Hope's Police Headquarters in Salford of 1958 being a good example. Architects such as Raymond Erith, and Donald McMorran were among the few architects who continued the neo-Georgian style into the 1960s. Both in the United States and Britain, the Georgian style is still employed by architects like Quinlan Terry, Julian Bicknell, Ben Pentreath, Robert Adam Architects, and Fairfax and Sammons for private residences. A debased form in commercial housing developments, especially in the suburbs, is known in the UK as mock-Georgian."]}, {"page": "January 1", "response": ["*1944 – Edwin Lutyens, English architect, designed the Castle Drogo and Thiepval Memorial (b. 1869)"]}, {"page": "Jonathan Meades", "response": ["He discovered a fascination for place and the built environment whilst accompanying his father on sales trips during school holidays; he would be left unattended and free to explore while the elder Meades conducted his business with the grocer. This later developed into a full-blown passion for architecture following a visit to Edwin Lutyens' Marsh Court on a school cricket trip at the age of 13. He also developed an early love of France on the frequent trips which his family took there, made possible by his Francophile mother's father, who worked for Southern Railway, the company which ran the Saint-Malo and Le Havre ferries."]}, {"page": "Lindisfarne", "response": ["The castle was later refurbished in the Arts and Crafts style by Sir Edwin Lutyens for the editor of Country Life, Edward Hudson. Lutyens also designed the island's Celtic-cross war-memorial on the Heugh. Lutyens' upturned herring busses near the foreshore provided the inspiration for Spanish architect Enric Miralles' Scottish Parliament Building in Edinburgh."]}, {"page": "Manchester", "response": ["Two large squares hold many of Manchester's public monuments. Albert Square has monuments to Prince Albert, Bishop James Fraser, Oliver Heywood, William Gladstone and John Bright. Piccadilly Gardens has monuments dedicated to Queen Victoria, Robert Peel, James Watt and the Duke of Wellington. The cenotaph in St Peter's Square is Manchester's main memorial to its war dead. Designed by Edwin Lutyens, it echoes the original on Whitehall in London. The Alan Turing Memorial in Sackville Park commemorates his role as the father of modern computing. A larger-than-life statue of Abraham Lincoln by George Gray Barnard in the eponymous Lincoln Square (having stood for many years in Platt Fields) was presented to the city by Mr and Mrs Charles Phelps Taft of Cincinnati, Ohio, to mark the part Lancashire played in the cotton famine and American Civil War of 1861–1865. A Concorde is on display near Manchester Airport."]}, {"page": "M25 motorway", "response": ["The idea of a general bypass around London was first proposed early in the 20th century. An outer orbital route around the capital had been suggested in 1913, and was re-examined as a motorway route in Sir Charles Bressey's and Sir Edwin Lutyens' The Highway Development Survey, 1937. Sir Patrick Abercrombie's County of London Plan, 1943 and Greater London Plan, 1944 proposed a series of five roads encircling the capital. The northern sections of the M25 follow a similar route to the Outer London Defence Ring, a concentric series of anti-tank defences and pillboxes designed to slow down a potential German invasion of the capital during World War II. This was marked as the D Ring on Abercombie's plans. Following the war, 11 separate county councils told the Ministry of Transport that an orbital route was \"first priority\" for London."]}, {"page": "March 29", "response": ["*  1869   – Sir Edwin Lutyens, British architect (d. 1944)"]}, {"page": "Suburb", "response": ["Suburbanisation in the interwar period was heavily influenced by the garden city movement of Ebenezer Howard and the creation of the first garden suburbs at the turn of the 20th century. The first garden suburb was developed through the efforts of social reformer Henrietta Barnett and her husband; inspired by Ebenezer Howard and the model housing development movement (then exemplified by Letchworth garden city), as well as the desire to protect part of Hampstead Heath from development, they established trusts in 1904 which bought 243 acres of land along the newly opened Northern line extension to Golders Green and created the Hampstead Garden Suburb. The suburb attracted the talents of architects including Raymond Unwin and Sir Edwin Lutyens, and it ultimately grew to encompass over 800 acres."]}, {"page": "1944", "response": ["** Sir Edwin Lutyens, British architect (b. 1869)"]}, {"page": "1869", "response": ["* March 29 – Edwin Lutyens, British architect (d. 1944)"]}, {"page": "Westminster Abbey", "response": ["A narthex (a portico or entrance hall) for the west front was designed by Sir Edwin Lutyens in the mid-20th century but was not built. Images of the abbey prior to the construction of the towers are scarce, though the abbey's official website states that the building had \"towers which had been left unfinished in the medieval period\"."]}, {"page": "Surrey", "response": ["During the later 19th century Surrey became important in the development of architecture in Britain and the wider world. Its traditional building forms made a significant contribution to the vernacular revival architecture associated with the Arts and Crafts Movement, and would exert a lasting influence. The prominence of Surrey peaked in the 1890s, when it was the focus for globally important developments in domestic architecture, in particular the early work of Edwin Lutyens, who grew up in the county and was greatly influenced by its traditional styles and materials.", "* Edwin Lutyens (1869–1944), architect, grew up in Thursley; many of his early works were built in Surrey, including collaborations with Gertrude Jekyll."]}, {"page": "Arts and Crafts movement", "response": ["The movement spread to Ireland, representing an important time for the nation's cultural development, a visual counterpart to the literary revival of the same timeNicola Gordon Bowe, The Irish Arts and Crafts Movement (1886-1925), Irish Arts Review Yearbook, 1990-91, pp. 172-185 and was a publication of Irish nationalism. The Arts and Crafts use of stained glass was popular in Ireland, with Harry Clarke the best-known artist and also with Evie Hone. The architecture of the style is represented by the Honan Chapel (1916) in Cork city in the grounds of University College Cork. Other architects practicing in Ireland included Sir Edwin Lutyens (Heywood House in Co. Laois, Lambay Island and the Irish National War Memorial Gardens in Dublin) and Frederick 'Pa' Hicks (Malahide Castle estate buildings and round tower). Irish Celtic motifs were popular with the movement in silvercraft, carpet design, book illustrations and hand-carved furniture.", "Gertrude Jekyll applied Arts and Crafts principles to garden design. She worked with the English architect, Sir Edwin Lutyens, for whose projects she created numerous landscapes, and who designed her home Munstead Wood, near Godalming in Surrey.Tankard, Judith B. and Martin A. Wood. Gertrude Jekyll at Munstead Wood. Bramley Books, 1998. Jekyll created the gardens for Bishopsbarns, the home of York architect Walter Brierley, an exponent of the Arts and Crafts movement and known as the \"Lutyens of the North\". The garden for Brierley's final project, Goddards in York, was the work of George Dillistone, a gardener who worked with Lutyens and Jekyll at Castle Drogo. At Goddards the garden incorporated a number of features that reflected the arts and crafts style of the house, such as the use of hedges and herbaceous borders to divide the garden into a series of outdoor rooms. Another notable Arts and Crafts garden is Hidcote Manor Garden designed by Lawrence Johnston which is also laid out in a series of outdoor rooms and where, like Goddards, the landscaping becomes less formal further away from the house. Other examples of Arts and Crafts gardens include Hestercombe Gardens, Lytes Cary Manor and the gardens of some of the architectural examples of arts and crafts buildings (listed above)."]}, {"page": "Castle", "response": ["Revival or mock castles became popular as a manifestation of a Romantic interest in the Middle Ages and chivalry, and as part of the broader Gothic Revival in architecture. Examples of these castles include Chapultepec in Mexico, Neuschwanstein in Germany, and Edwin Lutyens' Castle Drogo (1911–1930) – the last flicker of this movement in the British Isles. While churches and cathedrals in a Gothic style could faithfully imitate medieval examples, new country houses built in a \"castle style\" differed internally from their medieval predecessors. This was because to be faithful to medieval design would have left the houses cold and dark by contemporary standards."]}, {"page": "List of castles in England", "response": ["|By Edwin Lutyens.\"Castle Drogo\"  PSC.", "|Remodelled by Edwin Lutyens 1901.\"Lindisfarne Castle\"  PSC."]}, {"page": "New Delhi", "response": ["The foundation stone of New Delhi was laid by George V during the Delhi Durbar of 1911. It was designed by British architects Edwin Lutyens and Herbert Baker. The new capital was inaugurated on 13 February 1931, by Viceroy and Governor-General Irwin.", "During the Delhi Durbar on 12 December 1911, George V, Emperor of India, while laying the foundation stone for the viceroy's residence in the Coronation Park, Kingsway Camp, declared that the capital of the Raj would be shifted from Calcutta to Delhi.Coronation park  Hindustan Times, 14 August 2008. Three days later, George V and his consort, Queen Mary, laid the foundation stone of New Delhi at Kingsway Camp. Large parts of New Delhi were planned by Edwin Lutyens, who first visited Delhi in 1912, and Herbert Baker, both leading 20th-century British architects. The contract was given to Sobha Singh. The original plan called for its construction in Tughlaqabad, inside the Tughlaqabad Fort, but this was given up because of the Delhi-Calcutta trunk line that passed through the fort. Construction really began after World War I and was completed by 1931. The gardening and planning of plantations was led by A.E.P. Griessen, and later William Mustoe. The city that was later dubbed \"Lutyens' Delhi\" was inaugurated in ceremonies beginning on 10 February 1931 by Viceroy Lord Irwin. Lutyens designed the central administrative area of the city as a testament to Britain's imperial aspirations.", "Much of New Delhi, planned by the leading 20th-century British architect Edwin Lutyens, was laid out to be the central administrative area of the city as a testament to Britain's imperial ambitions. New Delhi is structured around two central promenades called the Rajpath and the Janpath. The Rajpath, or King's Way, stretches from the Rashtrapati Bhavan to the India Gate. The Janpath (Hindi: \"Path of the People\"), formerly Queen's Way, begins at Connaught Circus and cuts the Rajpath at right angles. 19 foreign embassies are located on the nearby Shantipath (Hindi: \"Path of Peace\"), making it the largest diplomatic enclave in India.", "* Ridley, Jane. \"Edwin Lutyens, New Delhi, and the Architecture of Imperialism,\" Journal of Imperial & Commonwealth History, May 1998, Vol. 26 Issue 2, pp 67–83."]}, {"page": "Robert Venturi", "response": ["A controversial critic of what he saw as the blithely functionalist and symbolically vacuous architecture of corporate modernism during the 1950s, Venturi was one of the first architects to question some of the premises of the Modern Movement. He published his \"gentle manifesto\", Complexity and Contradiction in Architecture in 1966; in its introduction, Vincent Scully called it \"probably the most important writing on the making of architecture since Le Corbusier's Vers Une Architecture of 1923.\" The work was derived from course lectures at the University of Pennsylvania, and Venturi received a grant from the Graham Foundation in 1965 to aid in its completion. The book demonstrated, through countless examples, an approach to understanding architectural composition and complexity, and the resulting richness and interest. Citing vernacular as well as high-style sources, Venturi drew new lessons from the buildings of architects familiar (Michelangelo, Alvar Aalto) and, at the time, forgotten (Frank Furness, Edwin Lutyens). He made a case for \"the difficult whole\" rather than the diagrammatic forms popular at the time, and included examples — both built and unrealized — of his own work to demonstrate the possible application of such techniques. The book has been published in 18 languages to date."]}, {"page": "List of architects", "response": ["*Edwin Lutyens (1869–1944), UK"]}, {"page": "Dorking", "response": ["In order to accommodate the growing population in the south of the town, a second Anglican church, St Paul's, was opened in 1857 on land donated by Henry Thomas Hope. Designed by the architect, Benjamin Ferrey, it was built of Bath stone in the Decorated Geometric style. A daughter church to St Martin's, designed by Edwin Lutyens and dedicated to St Mary, was opened at Pixham in 1903."]}, {"page": "Trafalgar Square", "response": ["Nelson's Column is in the centre of the square, flanked by fountains designed by Sir Edwin Lutyens between 1937 and 1939 (replacements for two of Peterhead granite, now in Canada) and guarded by four monumental bronze lions sculpted by Sir Edwin Landseer. At the top of the column is a statue of Horatio Nelson, who commanded the British Navy at the Battle of Trafalgar.", "In the late-1930s it was decided to replace the pump and the centrepieces of the fountains. The new centrepieces, designed by Sir Edwin Lutyens, were memorials to Lord Jellicoe and Lord Beatty, although busts of the admirals, initially intended to be placed in the fountain surrounds were placed against the northern retaining wall when the project was completed after the Second World War. The fountains cost almost £50,000. The old ones were presented to the Canadian government and are now located in Ottawa's Confederation Park and Regina's Wascana Centre.", "Category:Works of Edwin Lutyens in England"]}, {"page": "Northampton", "response": ["Northampton contains several significant war memorials. The Town and County War Memorial, unveiled in 1926, commemorates casualties of the First World War from all of Northamptonshire; it replaced a temporary cenotaph which stood in Abington Square from 1919. Designed by Sir Edwin Lutyens, it consists of two large obelisks and an altar-like stone sited in a small garden behind All Saints' Church. The Town and County memorial is a grade I listed building and part of a national collection of Lutyens' war memorials. As the Town and County memorial does not contain a list of names of the fallen, the Royal British Legion launched a campaign which resulted in the construction of a second memorial, dedicated solely to the town; this memorial, in Abington Square, takes the form of a garden of remembrance with the names of the dead inscribed on the garden walls. A bust of Edgar Mobbs was later moved into the garden; Mobbs was a rugby player for Northampton Saints who was killed while serving in the First World War."]}, {"page": "Pastiche", "response": ["In discussions of urban planning, the term \"pastiche\" may describe developments as imitations of the building styles created by major architects: with the implication that the derivative work is unoriginal and of little merit, and the term is generally attributed without reference to its urban context. Many 20th century European developments can in this way be described as pastiches, such as the work of Vincent Harris and Edwin Lutyens who created early 20th century Neoclassical and Neo-Georgian  architectural developments in Britain, or of later pastiche works based on the architecture of the modernist Ludwig Mies van der Rohe and the Bauhaus movement. The term itself is not pejorative; however, Alain de Botton describes pastiche as \"an unconvincing reproduction of the styles of the past\"."]}, {"page": "William Friese-Greene", "response": ["Given his dramatic death, surrounded by film industry representatives who had almost entirely forgotten about his role in motion pictures, there was a spasm of collective shock and guilt. A very grand funeral was staged for him, with the streets of London lined by the curious. A two-minute silence was observed in some cinemas, and a fund was raised to commission a memorial for his grave. He was buried in the eastern section of London's Highgate Cemetery, just south of the entrance and visible from the street through the railings. However, his memorial was not designed by Edwin Lutyens, as is often stated. It describes him as \"The Inventor of Kinematography\", a term Friese-Greene never used in talking about his achievements. Indeed, he often spoke generously about other workers in the field of capturing movement."]}, {"page": "Sandwich, Kent", "response": ["In 1912 Sir Edwin Lutyens (1869–1944) built The Salutation in Queen Anne style. The gardens were laid out by Gertrude Jekyll. In World War I, Sandwich was important as a transit location for troops heading to Ypres."]}, {"page": "Golders Green Crematorium", "response": ["The crematorium gardens are listed at Grade I in the National Register of Historic Parks and Gardens. The Philipson Family mausoleum, designed by Edwin Lutyens, is a Grade II* listed building on the National Heritage List for England and the crematorium building, the wall, along with memorials and gates, the Martin Smith Mausoleum and Into The Silent Land, a sculpture by Henry Alfred Pegram are all Grade II listed buildings. The largest sculpture portraying someone cremated here is the statue of Indian industrialist and friend of Gandhi, Ghanshyam Das Birla.", "* Edwin Lutyens, architect whose designs include The Cenotaph. Ashes buried at St Paul's Cathedral, London"]}, {"page": "Roehampton", "response": ["Roehampton House (Grade I) by Thomas Archer was built between 1710–12 and enlarged by Sir Edwin Lutyens in 1910. Until 2008, it was the administrative centre for Queen Mary's Hospital. The building was Grade I Listed in 1978 when it was still being used by the hospital. It was subsequently developed into private flats."]}, {"page": "London Borough of Barnet", "response": ["Barnet has two Grade I listed buildings, both designed by Edwin Lutyens: the Church of St Jude, the parish church of Hampstead Garden Suburb with a Gothic spire and on the opposite side of Central Square, the Free Church, of similar design but with a concrete dome."]}, {"page": "Victoria and Albert Museum", "response": ["Not only are all the major British architects of the last four hundred years represented, but many European (especially Italian) and American architects' drawings are held in the collection. The RIBA's holdings of over 330 drawings by Andrea Palladio are the largest in the world;Douglas Lewis, The Drawings of Andrea Palladio, 2nd edition, 2000. other Europeans well represented are Jacques GentilhatreRosalys Coope, Catalogue of the Drawings Collection of the RIBA: Jacques Gentilhatre, 1972. and Antonio Visentini.John McAndrew, Catalogue of the Drawings Collection of the RIBA: Antonio Visentini, 1974. British architects whose drawings, and in some cases models of their buildings, in the collection, include: Inigo Jones,John Harris & Gordon Higgott, Inigo Jones Complete Architectural Drawings, 1989. Sir Christopher Wren, Sir John Vanbrugh, Nicholas Hawksmoor, William Kent, James Gibbs, Robert Adam,Alister Rowan, Catalogues of Architectural Drawings in the V&A: Robert Adam, 1988. Sir William Chambers,Michael Snodin (ed.), Catalogues of Architectural Drawings in the V&A: Sir William Chambers, 1996. James Wyatt, Henry Holland, John Nash, Sir John Soane,Pierre de la Ruffuniere du Prey, Catalogues of Architectural Drawings in the V&A: Sir John Soane, 1985. Sir Charles Barry, Charles Robert Cockerell, Augustus Welby Northmore Pugin,Alexandra Wedgwood, Catalogues of Architectural Drawings in the V&A: A. W. N. Pugin and the Pugin Family, 1985. Sir George Gilbert Scott, John Loughborough Pearson, George Edmund Street, Richard Norman Shaw, Alfred Waterhouse, Sir Edwin Lutyens, Charles Rennie Mackintosh, Charles Holden, Frank Hoar, Lord Richard Rogers, Lord Norman Foster, Sir Nicholas Grimshaw, Zaha Hadid and Alick Horsnell.", "The collection includes pieces by William Kent, Henry Flitcroft, Matthias Lock, James Stuart, William Chambers, John Gillow, James Wyatt, Thomas Hopper, Charles Heathcote Tatham, Pugin, William Burges, Charles Voysey, Charles Robert Ashbee, Baillie Scott, Edwin Lutyens, Edward Maufe, Wells Coates and Robin Day. The museum also hosts the national collection of wallpaper, which is looked after by the Prints, Drawings and Paintings department."]}, {"page": "Edwardian era", "response": ["Notable architects included Edwin Lutyens, Charles Rennie Mackintosh, and Giles Gilbert Scott. In spite of the popularity of Art Nouveau in Europe, the Edwardian Baroque style of architecture was widely favoured for public structures and was a revival of Christopher Wren–inspired designs of the late 17th and early 18th centuries. The change or reversal in taste from the Victorian eclectic styles corresponded with the historical revivals of the period, most prominently earlier Georgian and Neoclassical styles of the late 18th and early 19th centuries.A.S. Gray, Edwardian Architecture: A Biographical Dictionary (1985)."]}, {"page": "Jimmy Page", "response": ["Page also previously owned Plumpton Place in Sussex, formerly owned by Edward Hudson, the owner of Country Life magazine and with certain parts of the house designed by Edwin Lutyens. This house features in the Zeppelin film The Song Remains The Same where Page is seen sitting on the lawn playing a hurdy-gurdy.", "He currently resides in Sonning, Berkshire in Deanery Garden, a house also designed by Edwin Lutyens for Edward Hudson."]}, {"page": "Matt Ridley", "response": ["Ridley's parents were Matthew White Ridley, 4th Viscount Ridley (1925–2012), and Lady Anne Katharine Gabrielle Lumley (1928–2006), the daughter of Roger Lumley, 11th Earl of Scarbrough. He is the nephew of the late Conservative Member of Parliament (MP) and minister Nicholas Ridley and the great grandson of Edwin Lutyens."]}, {"page": "Charles Barry", "response": ["Barry remodelled Trafalgar Square (1840–45) he designed the north terrace with the steps at either end, and the sloping walls on the east and west of the square, the two fountain basins are also to Barry's design, although Edwin Lutyens re-designed the actual fountains (1939).Bradley & Pevsner, pp. 257–258"]}, {"page": "Arthur Balfour", "response": ["After the First World War, when there was controversy over the style of headstone proposed for use on British war graves being taken on by the Imperial War Graves Commission, Balfour submitted a design for a cruciform headstone. At an exhibition in August 1919, it drew many criticisms; the commission's principal architect, Sir John Burnet said that Balfour's cross, if used in large numbers in cemeteries, would create a criss-cross visual effect, destroying any sense of \"restful diginity\"; Edwin Lutyens called it \"extraordinarily ugly\", and its shape was variously described as resembling a shooting target or bottle. His design was not accepted but the Commission offered him a second chance to submit another design which he did not take up, having been refused once. After a further exhibition in the House of Commons, the \"Balfour cross\" was ultimately rejected in favour of the standard headstone the Commission permanently adopted because the latter offered more space for inscriptions and service emblems."]}, {"page": "Whitehall", "response": ["Statues and memorials have been built on and around Whitehall, commemorating military victories and leaders. The Cenotaph was designed by Sir Edwin Lutyens and erected at the southern end in 1919, commemorating victory in World War I and later used as a memorial for both World Wars. It is the main war memorial in Britain and an annual service is held here on Remembrance Sunday, led by the reigning monarch and leading politicians. In 2005, a national Monument to the Women of World War II was erected a short distance north of the Cenotaph in the middle of the Whitehall carriageway."]}, {"page": "Effingham, Surrey", "response": ["Among Effingham's architecturally imposing or recognised buildings is an early work by wide-reaching architect Sir Edwin Lutyens, the Red House built in 1893 for Susan Muir-Mackenzie, a mutual friend of Gertrude Jekyll who laid out its garden and orchard. The house later became Corpus Domini Convent and was converted to apartments in 2008."]}, {"page": "Farnham", "response": ["Farnham has a strong association with the creative arts.\"A Sketch History of Art in Farnham\" by Robin Radley (published by Farnham Castle Newspapers, undated)Farnham Art Society, founded in 1944 Farnham School of Art opened in 1866 and was associated with the Arts and crafts movement when architects such as Edwin Lutyens and Harold Falkner, painters such as George Watts and W. H. Allen, potters such as Mary Watts and landscape gardeners such as Gertrude Jekyll worked in the area. Farnham has several art galleries: the New Ashgate Gallery in Lower Church Lane has exhibitions by established and new artists in a variety of media, the exhibition changing on the first Saturday of each month. The gallery at Farnham Maltings also has frequent exhibitions."]}, {"page": "Béthune", "response": ["In World War I, Béthune was an important railway junction and command centre for the British Canadian Corps and Indian Expeditionary Force,  as well as the 33rd Casualty Station until December 1917. It initially suffered little damage until the second phase of the Ludendorff Offensive in April 1918, when German forces reached Locon,  away. On 21 May, a bombardment destroyed large parts of the town, killing more than 100 civilians. Over 3,200 casualties are buried in Béthune Town Cemetery, the Commonwealth section of which was designed by Edwin Lutyens; the majority are British (2,933) or Canadian (55), the remainder German."]}, {"page": "Samuel Barnett (reformer)", "response": ["The Barnetts also became known for their involvement in the Hampstead Garden Suburb. This arose after the activist couple acquired a weekend home at Spaniard's End in the Hampstead area of north-west London. The Barnetts worked to protect part of nearby Hampstead Heath from development by Eton College, as well as beginning in 1904 established trusts which bought 243 acres of land along the newly opened Northern line extension to Golders Green. Henrietta Barnett broke ground for the development on her 56th birthday, and while it never was completed to the plan of architects Raymond Unwin and Sir Edwin Lutyens, it achieved worldwide acclaim."]}, {"page": "George Curzon, 1st Marquess Curzon of Kedleston", "response": ["Curzon was largely responsible for the Peace Day ceremonies on 19 July 1919. These included the plaster Cenotaph, designed by the noted British architect Sir Edwin Lutyens, for the Allied Victory parade in London.  It was so successful that it was reproduced in stone, and still stands."]}, {"page": "Capital city", "response": ["* The British-built town of New Delhi represented a simultaneous break and continuity with the past, the location of Delhi being where many imperial capitals were built (Indraprastha, Dhillika, and Shahjahanabad) but the actual capital being the new British-built town designed by Edwin Lutyens. Wellington, on the southwestern tip of the North Island of New Zealand, replaced the much more northerly city of Auckland to place the national capital close to the South Island and hence to placate its residents, many of whom had sympathies with separatism."]}, {"page": "Neoclassicism", "response": ["In American architecture, Neoclassicism was one expression of the American Renaissance movement, ca. 1890–1917; its last manifestation was in Beaux-Arts architecture, and its final large public projects were the Lincoln Memorial (highly criticized at the time), the National Gallery of Art in Washington, D.C. (also heavily criticized by the architectural community as being backward thinking and old fashioned in its design), and the American Museum of Natural History's Roosevelt Memorial. These were considered stylistic anachronisms when they were finished. In the British Raj, Sir Edwin Lutyens' monumental city planning for New Delhi marks the sunset of Neoclassicism. World War II was to shatter most longing for (and imitation of) a mythical time."]}, {"page": "Arch of Titus", "response": ["* The India Gate, New Delhi, India, by Edwin Lutyens (1921)"]}]}}