{"wiki_id": "http://www.wikidata.org/entity/Q3787461", "itemLabel": "Hughie Green", "itemDescription": "British television host (1920-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hughie_Green", "wikipedia_page": {"main": "Hugh Hughes Green (2 February 1920 – 3 May 1997) was an English radio and television presenter, game show host and actor.\n\n", "link_mentions": [{"page": "Bill Oddie", "response": ["He appeared in Bernard Braden's television series On The Braden Beat in 1964. Subsequently, he was a key member of the performers in the BBC radio series I'm Sorry, I'll Read That Again, where many of his musical compositions were featured. Some were released on the album Distinctly Oddie (Polydor, 1967). He was one of the first performers to parody a rock song, arranging the traditional Yorkshire folk song \"On Ilkla Moor Baht'at\" in the style of Joe Cocker's hit rendition of the Beatles' \"With a Little Help from My Friends\" (released on John Peel's Dandelion Records in 1970 and featured in Peel's special box of most-treasured singles), and singing \"Andy Pandy\" in the style of a brassy soul number such as Wilson Pickett or Geno Washington might perform. In many shows he would do short impressions of Hughie Green."]}, {"page": "I'm Sorry, I'll Read That Again", "response": ["As with Round the Horne, the cast's adventures would sometimes be episodic with cliff-hanger endings each week as with \"The Curse of the Flying Wombat\" (3rd series), and \"Professor Prune And The Electric Time Trousers\" (7th series). Christmas specials normally included a spoof of a traditional pantomime (or several combined). They had few qualms about the use of puns – old, strained or inventive – and included some jokes and catchphrases that would seem politically incorrect by the mid-1990s. Garden's impressions of the legendary rugby league commentator Eddie Waring and the popular Scottish TV presenter Fyfe Robertson, Oddie's frequent send-ups of the game-show host Hughie Green, and Cleese's occasional but manic impressions of Patrick Moore (astronomer and broadcaster) built these people into eccentric celebrities in a way that the Mike Yarwood, Rory Bremner, Spitting Image and Dead Ringers programmes did for other TV presenters with similar disrespect years later.", ": is a parody of Hughie Green usually played by Oddie, although on one occasion, in the 3rd series, he is voiced by Garden. His catchphrases include \"Thank-you, Thank-you\" and \"Wasn't that just great?\" Invariably, when he hands over to Kendall for details of the Prune Play of the Week, she refers to him by another personality's name – Simon (Dee), Jimmy (Young, or possibly Savile), David (Frost), or Eamonn (Andrews). On one occasion, after Kendall announces the title of the Prune Play of the Week Jorrocks: The Memoirs of a Fox-Hunting Man (or a man-hunting fox....), by Stanley Stamps, author of Stanley Stamps' Gibbon catalogue, Bill/Hughie says to the audience, \"So will you please put your hands together ... and pray ....\""]}, {"page": "Golders Green Crematorium", "response": ["* Hughie Green, Canadian born quiz show host"]}, {"page": "1997 in film", "response": ["| style=\"text-align:center;\"| 3 || Hughie Green || style=\"text-align:center;\"| 77 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor, Producer || "]}, {"page": "Paula Yates", "response": ["In December 1997, a few weeks after Hutchence's death and while Yates was fighting for custody of Tiger, Yates suffered another blow when a DNA test result confirmed tabloid media reports that Jess Yates, who had died in April 1993, was not Yates's biological father. A paternity test proved that the talent show host Hughie Green, who had died six months before Hutchence, was her biological father."]}, {"page": "1935 in film", "response": ["*Midshipman Easy, directed by Carol Reed, starring Hughie Green and Margaret Lockwood (GB)"]}, {"page": "Mike Yarwood", "response": ["Yarwood's characterisations also created catchphrases which came to be identified with famous figures, even if they never actually used them. However, the two most famous were spoken by the people he caricatured. \"Silly Billy\", spoken by his caricature of Chancellor of the Exchequer Denis Healey, was actually used by Healey to describe strikers. It was rumoured that \"I mean that most sincerely, folks\", spoken by his caricature of Opportunity Knocks presenter Hughie Green, was made up by Yarwood but, in reality, it was first spoken by Green himself."]}, {"page": "List of game show hosts", "response": ["| Hughie Green || United Kingdom || Double Your Money (1955–68)"]}, {"page": "List of show business families", "response": ["* Singer-songwriter Bob Geldof is the father of broadcaster, journalist and model Peaches Geldof and model Pixie Geldof by his ex-wife music journalist and presenter Paula Yates, who subsequently married singer Michael Hutchence. Yates is the biological daughter of television host Hughie Green but was raised by presenter and producer Jess Yates and his wife actress Elaine Smith as their own."]}, {"page": "Opportunity Knocks (British TV series)", "response": ["Opportunity Knocks is a British television and radio talent show originally hosted by Hughie Green, with a late-1980s revival hosted by Bob Monkhouse, and later by previous winner Les Dawson.", "The programme was recorded the Friday before transmission, so votes had to be in by Thursday. They also, according to host Hughie Green, largely to ensure fairness, had to be in \"your own handwriting\"."]}, {"page": "Mark Benton", "response": ["In April 2008, Benton appeared as Jess Yates in the BBC Four drama Hughie Green, Most Sincerely.", "| Hughie Green, Most Sincerely"]}, {"page": "Meopham", "response": ["* Hughie Green (1920–1997), television presenter"]}, {"page": "Lena Zavaroni", "response": ["In 1974 Zavaroni appeared on Opportunity Knocks hosted by Hughie Green and won the show for a record-breaking five weeks running. She followed this with the album Ma! (He's Making Eyes At Me), a collection of classic and then-recent pop standards which reached number eight in the UK album chart. At 10 years, 146 days old, Zavaroni remains the youngest person to have an album in the Top 10.Everyhit.com Retrieved 21 April 2006"]}, {"page": "Television Personalities", "response": ["Treacy was inspired to form the Television Personalities after hearing the Sex PistolsBaal, Iphgenia. \"Daniel Treacy as seen on Screen\". Dazed & Confused, 24 August 2014. Retrieved 13 May 2018 and Jonathan Richman. Ever unconventional, Treacy said he was not that much interested in music and the band rarely rehearsed. Treacy did not prepare set-lists for live performances, preferring to keep the band on their toes. Head remembers \"us rehearsing once in late 1983. We did another one five years later, and that was about it.\"Marsh, Calum. \"Beautiful Despair\". Pitchfork, 26 January 2018. Retrieved 12 May 2018 The band struggled to find a name, and early suggestions included the names of mainstream and often ridiculed television hosts such as Nicholas Parsons, Russell Harty, Bruce Forsyth and Hughie Green, before they decided on the more generic and pointed \"Television Personalities\"."]}, {"page": "Frank Carson", "response": ["Carson became a popular performer on Irish television, before moving to England to work as a stand-up club comedian. He had success on the long-running television music-hall revival show, The Good Old Days. He then went on to win the peak-viewing national favourite talent show Opportunity Knocks, presented by Hughie Green, three times. He was one of the more prominent acts on The Comedians alongside the likes of Charlie Williams, Bernard Manning, Mike Reid and Jim Bowen. The show consisted of 30 minutes of non-stop stand-up comedy from several comedians in each show, became a ratings hit in the United Kingdom and helped establish Carson's performing career."]}, {"page": "Prince of Wales Theatre", "response": ["In 1943, Strike a New Note was notable for Sid Field's London debut, and he returned to the theatre in Strike it Again (1944), and yet again in Piccadilly Hayride (1946, a revue that ran for 778 performances).Many sketches and reviews from these shows appeared in the first British TechniColour film, London Town (1946) In 1949, Harvey, Mary Coyle Chase's comedy about an imaginary rabbit, was a success, as was Diamond Lil in 1948 starring Mae West. In the 1950s, the theatre hosted variety and revues, starring such famous performers as Norman Wisdom, Peter Sellers, Bob Hope, Gracie Fields, Benny Hill, Hughie Green, Frankie Howerd, and Morecambe and Wise. In 1959, Paul Osborn's The World of Susie Wong became the theatre's longest-running play to date with 832 performances. On 4 November 1963, The Beatles performed From Me to You, She Loves You, Till There Was You, and Twist and Shout at the Prince of Wales Theatre, during the Royal Variety Show in the presence of The Queen Mother."]}, {"page": "Kathie Kay", "response": ["Kathie Kay was born Kathleen Thornhill in Gainsborough, Lincolnshire. She began her career as a tot with the famous Corona Babes Stage School as Connie Wood, then moved on to appear with Hughie Green as head girl in his gang show; he was later best man at her wedding. She was spotted by Billy Cotton, and first performed with him on radio in 1949, making the move to television and remaining until the show ended in 1968. She also worked with Harry Lauder and George Formby.Thedeadrockstarsclub.com – accessed February 2011 For many years she presented her own programme on Scottish Television, where she was dubbed 'the Fireside Girl'. She was married to the Scottish impresario Archie McCulloch, who died in September 1997."]}, {"page": "Jersey Battle of Flowers", "response": ["|Hughie Green"]}, {"page": "Trevor Eve", "response": ["In April 2008, Eve starred as game show host and TV personality Hughie Green in the BBC Four biographical film Hughie Green, Most Sincerely. In 2010, Eve played the father of the female lead, his real-life daughter, Alice, in She's Out of My League, and starred as Peter Manson in the ITV/Mammoth Screen remake of Bouquet of Barbed Wire. In January 2011, he starred in the three-part ITV drama Kidnap and Ransom, filmed on location in South Africa, and reprised his role as Dominic King in 2012 for the second series."]}, {"page": "Pixie Geldof", "response": ["Geldof is the third daughter of Bob Geldof and Paula Yates.Pixie Geldof is a Tatler cover girl, The Daily Telegraph, 3 June 2008Sting's kds join Geldof girls at geisha launch , Hello!, 12 January 2006 (\"is the youngest of Sir Bob's three daughters by the late TV presenter Paula Yates...\") She is also the biological granddaughter of Hughie Green. Pixie was one of three sisters, Fifi Trixibelle (born 1983), Peaches Geldof, and has a half-sister, Heavenly Hiraani Tiger Lily Hutchence (born 1996), from her mother's relationship with INXS frontman Michael Hutchence. Her great-grandmother was Jewish."]}, {"page": "Tonight at the London Palladium", "response": ["The regular hosts of the show were Tommy Trinder (1955–1958), Bruce Forsyth (1958–1960 and 1961–1964), Don Arrol (1960–1961), Norman Vaughan (1962–1965, 1974), Jimmy Tarbuck (1965–1967), Jim Dale (1973–1974) and Ted Rogers (1974). Other guest comperes were: Hughie Green, Alfred Marks, Robert Morley, Arthur Haynes, Dickie Henderson, Dave Allen, Des O'Connor, Bob Monkhouse and Roger Moore."]}, {"page": "Green (surname)", "response": ["*Hughie Green (1920–1997), British television host"]}, {"page": "Michael Miles", "response": ["Although he produced radio shows during the war years, it was with the transfer of his quiz show Take Your Pick to television that he made his name. The programme, which had already been heard on Radio Luxembourg for three years, was one of the first game shows on ITV in September 1955 when the new channel began its broadcasts (ITV's other early quiz show was Double Your Money, presented by Hughie Green). Take Your Pick, which was masterminded by Miles (who was reputed to earn the phenomenal sum of £20,000 a year) relied on public participation and was a ratings success. The show was cancelled in 1968, when producers Associated Rediffusion were forced to become Thames Television in the ITV franchise reshuffle. (The show was revived in 1992 with Des O'Connor.)"]}, {"page": "The Bachelors", "response": ["As the Harmonichords, they appeared on Hughie Green's Opportunity Knocks on Radio LuxembourgKilmainham & Inchicore Local Dictionary of Biography and on the 'Ed Sullivan' TV show St. Patrick's Day special (filmed in Dublin, broadcast 15 March 1959), where they played \"Danny Boy\". They also played background music plus featured pieces in a 25-week radio comedy series called Odd Noises on Radio Éireann, which featured Eamonn Andrews. In 1960, they changed their name to the Bachelors at the suggestion of Dick Rowe, A&R at Decca Records, who reportedly recommended the name \"because that's the kind of boy a girl likes\"."]}, {"page": "Double Your Money", "response": ["Double Your Money is a British quiz show hosted by Hughie Green. Originally broadcast on Radio Luxembourg since 1950 and based on American radio quiz Take It Or Leave It in 1940–1947, it transferred to ITV in September 1955, a few days after the commercial channel began broadcasting. It was produced by Associated-Rediffusion until 1964 and then by Rediffusion London and it finished in 1968 when the company lost its franchise. There were 260 thirty-minute episodes."]}, {"page": "David Langton", "response": ["In May 1975, Langton married his second wife, Claire Green, the former wife of TV host Hughie Green. In 1994, he suffered a fatal heart attack and died in Stratford-upon-Avon. The subsequent obituaries revealed that he was in fact 82, not 72 as was his \"official age\". The obituaries also paid tribute to a \"popular and easy going man\" who always \"behaved like a gentleman\"."]}, {"page": "The Baddies", "response": ["*Hughie Green"]}, {"page": "Billie Anthony", "response": ["1955 to 1957 were Anthony's busiest years. Due to ever increasing demand, her fan club was formed, and besides touring she made regular radio and television appearances, not only in Britain but also on the continent. The greater part of 1957 was spent on the road with Harry Secombe in the variety show Rocking The Town. Anthony spent a hectic eight weeks in the early part of 1958, entertaining the forces in Cyprus, Malta and North Africa. After returning to London, she spent the remainder of the year touring in variety, doing one-night stands and the occasional service camp dates. This similar routine of one-night stands continued throughout 1959, interrupted only by a summer season at the Great Yarmouth's Regal Theatre with Hughie Green's Double Your Money show."]}, {"page": "TV Offal", "response": ["The show would close with Lewis-Smith prank calling a variety of people, such as Hughie Green, Mary Whitehouse or the offices of Carlton Television, with initial good graces, before becoming more and more rude as the conversation continued."]}, {"page": "Dave Freeman (British writer)", "response": ["Freeman co-wrote with Benny Hill from 1955 to 1968 for The Benny Hill Show on BBC. The early series were notable for spoofs of popular television personalities of the time, such as the quiz and talent-show host Hughie Green, the globe-trotting journalist Alan Whicker, and the undersea explorers Hans and Lotte Hass."]}, {"page": "One Hand Clapping (novel)", "response": ["Burgess deliberately toned down his trademark love of vocabulary for the novel, which among other things lampoons the British television host Hughie Green. The entire vocabulary in One Hand Clapping amounts to approximately 800 words."]}, {"page": "Maxi, Dick and Twink", "response": ["They performed on Hughie Green's British TV showcase Opportunity Knocks and had a thirteen-week stint on Irish television series Steady As She Go-Goes. They made two 45 singles with Columbia Records, \"Things You Hear About Me\" (which had taken second place behind Dana's \"All Kinds Of Everything\" in the Irish National Song Contest in 1970) b/w \"Catch The Bride's Bouquet\" and \"Tangerines Tangerines\" b/w \"Sweet Eye\". The group toured Ireland and Britain before travelling to Canada in the freezing winter of 1970 with one of the top Irish bands of the time, The Bye-Laws; together they were known as 'The Toybox'. The tour went badly, according to Twink: \"We seemed to be on an endless safari through the most abandoned outposts in the arctic part of the country. Our nerves got more and more on edge.\" There was a great deal of bickering and rowing and tension between the girls, and The Bye-Laws announced that they were breaking away. \"This was in the William Pitt Hotel in Chatham, Manitoba, a one horse town which even the horses had left!\". They invited Twink to go with them and she decided to do so; thus 'Maxi, Dick and Twink' came to an end. Naturally the other two girls were upset but they too realised that it was over for them as a group."]}, {"page": "Jess Yates", "response": ["Jess Yates died of a stroke in April 1993, aged 74. In December 1997, a DNA test revealed that Paula Yates' biological father was not Jess Yates, but the television presenter Hughie Green, a one time friend of Jess Yates who became his long-term arch enemy from the 1960s onwards. Green was a key man in exposing Jess Yates's affair with Anita Kay back in 1974."]}, {"page": "Bobby Crush", "response": ["Bobby Crush first came to public attention after six winning appearances on Hughie Green's British ITV talent show, Opportunity Knocks, in 1972. He received the Variety Club of Great Britain award for 'Best New Artist' of 1972."]}, {"page": "Radio Luxembourg", "response": ["*Wednesdays: 8:00 pm – Double Your Money – Hughie Green."]}, {"page": "Suzy Mandel", "response": ["She began her career as a coat model but was also a catwalk model and later a photographic model. Later, she modelled lingerie and was a contestant on Miss TV Times (broadcast on UK television on 14 June 1974 and presented by Hughie Green).TV Times, 6 August 1974Miss TV Times 1974 cast, BFI.org.uk"]}, {"page": "TV Heaven", "response": ["*Double Your Money with Hughie Green (the first edition from 1955)"]}, {"page": "List of adventure films of the 1930s", "response": ["|Midshipman Easy||Carol Reed||Hughie Green, Roger Livesey, Margaret Lockwood, Robert Adams ||United Kingdom||Sea adventure"]}, {"page": "Selhurst High School", "response": ["* Hughie Green – entrepreneur, showman, television celebrity, programme presenter"]}, {"page": "Colin Grainger", "response": ["Grainger signed a contract with talent agent Len Young in 1956. His first gig was as a support act to American group the Hilltoppers in Sheffield, for which he was paid £50, singing three songs from the back catalogues of Al Jolson, Nat King Cole and Billy Eckstine. Due to his footballing career he was forced to turn down the offer to join the Hilltoppers on a financially lucrative tour of the USA. His performance earned him a television appearance on ITV and a regular column in the Sport Express that was written by Brian Glanville. In summer 1957 he toured England and received vocal training from talent agent Joe Collins, father of actress Joan Collins. He then performed with Jack Hylton and his orchestra on ITV's After Hours show, presented by Hughie Green, and also did a television show for the BBC with Winifred Atwell, Eric Robinson and Matt Monro. He went on to be signed to the HMV label, releasing \"This I Know\"/\"Are You\" as a single in 1958."]}, {"page": "Cherri Gilham", "response": ["She worked with many of the top UK comedians in the 1970s including Benny Hill, Dick Emery, The Two Ronnies, Frankie Howerd, Jimmy Tarbuck, Dave Allen, Mike Yarwood, and Bernie Winters. She was also a hostess on some TV shows, including Maid of the Month for several months on The Golden Shot and The Sky's the Limit with Hughie Green. Her film roles included sex comedies such as The Love Box (1972), Confessions of a Sex Maniac (1974), and Girls Come First (1975)."]}, {"page": "Hills of Home (film)", "response": ["* Hughie Green as Geordie Howe"]}]}}