{"wiki_id": "http://www.wikidata.org/entity/Q3784929", "itemLabel": "Henry Fitzalan-Howard, 14th Duke of Norfolk", "itemDescription": "English peer and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Fitzalan-Howard,_14th_Duke_of_Norfolk", "wikipedia_page": {"main": "Henry Granville Fitzalan-Howard, 14th Duke of Norfolk, (7 November 1815 – 25 November 1860) was an English peer and politician. He was hereditary Earl Marshal and Chief Butler of England.", "link_mentions": [{"page": "Duke of Norfolk", "response": ["At the death of the 9th Duke, the title was inherited in 1777 by his heir male, Charles Howard, a grandson of Charles Howard of Greystoke, a younger brother of the 5th and 6th Dukes. He was succeeded by his son, Charles, whose lack of a legitimate male heir resulted in the title passing to Bernard Howard, a great-grandson of Bernard Howard of Glossop, the youngest brother of the 5th and 6th Dukes. The title then passed to his son in 1842, Henry Howard, 13th Duke of Norfolk, who was the father of Henry Fitzalan-Howard, 14th Duke of Norfolk, and Edward Fitzalan-Howard, 1st Baron Howard of Glossop."]}, {"page": "Edmund FitzAlan-Howard, 1st Viscount FitzAlan of Derwent", "response": ["FitzAlan was the second son of Henry Fitzalan-Howard, 14th Duke of Norfolk by his wife the Hon Augusta Lyons, daughter of Vice-Admiral Edmund Lyons, 1st Baron Lyons, and the younger brother of Henry Fitzalan-Howard, 15th Duke of Norfolk. He was principal beneficiary named in the will of Bertram Arthur Talbot, 17th Earl of Shrewsbury (1832–1856) provided he took the surname and arms of \"Talbot\", which he did by royal licence in 1876. However, the late earl's distant relatives contested the will, and the peerage and concomitant property were awarded after much litigation to Henry Chetwynd-Talbot, 3rd Earl Talbot, leaving Lord Edmund Talbot with only scattered minor lands. He returned to the use of his paternal name by royal licence in 1921, shortly after being raised to the peerage."]}, {"page": "Earl of Arundel", "response": ["In 1842, by royal warrant, Henry Fitzalan-Howard, 14th Duke of Norfolk and 13th Earl of Arundel, and his siblings, assumed the surname FitzAlan-Howard, used by the family line to today.cracoftspeerage.co.uk 14th Duke of Norfolk ", "* Henry Fitzalan-Howard, 14th Duke of Norfolk (1815–1860)"]}, {"page": "Henry FitzAlan-Howard, 2nd Viscount FitzAlan of Derwent", "response": ["FitzAlan-Howard was the only son of Edmund FitzAlan-Howard, 1st Viscount FitzAlan of Derwent, second infancy-surviving son of Henry Fitzalan-Howard, 14th Duke of Norfolk, and Lady Mary Bertie (1859–1938), daughter of Montagu Bertie, 7th Earl of Abingdon."]}, {"page": "Henry Granville Fitzalan-Howard, 14th Duke of Norfolk", "response": ["#REDIRECT Henry Fitzalan-Howard, 14th Duke of Norfolk"]}, {"page": "Henry Fitzalan-Howard, 15th Duke of Norfolk", "response": ["Norfolk was the eldest son of Henry Fitzalan-Howard, 14th Duke of Norfolk, and Augusta Mary Minna Catherine, younger daughter of Edmund Lyons, 1st Baron Lyons. Edmund Fitzalan-Howard, 1st Viscount Fitzalan of Derwent, was his younger brother.thepeerage.com Henry Fitzalan-Howard, 15th Duke of Norfolk"]}, {"page": "Philip Kerr, 11th Marquess of Lothian", "response": ["Kerr was born in London as the eldest son of Major-General Lord Ralph Kerr, who was the third son of John Kerr, 7th Marquess of Lothian. His mother was Lady Anne Fitzalan-Howard, the daughter of Henry Fitzalan-Howard, 14th Duke of Norfolk, by the Honourable Augusta Mary Minna Catherine Lyons, the daughter of Vice-Admiral Edmund Lyons, 1st Baron Lyons."]}, {"page": "Chief Butler of England", "response": ["*Henry Fitzalan-Howard, 14th Duke of Norfolk (1856–1860)"]}, {"page": "James Hope, 1st Baron Rankeillour", "response": ["A member of the Hope family now headed by the Marquess of Linlithgow, Hope was the third but only surviving son of J. R. Hope-Scott, of Abbotsford House, and Lady Victoria Alexandrina Fitzalan-Howard, eldest daughter of Henry Fitzalan-Howard, 14th Duke of Norfolk. He was educated at The Oratory School and at Christ Church, Oxford."]}, {"page": "Viscount FitzAlan of Derwent", "response": ["Viscount FitzAlan of Derwent, of Derwent in the County of Derby, was a title in the Peerage of the United Kingdom. It was created in 1921 for Lord Edmund Talbot on his appointment as Lord Lieutenant of Ireland. Born Lord Edmund FitzAlan-Howard, he was the third born, but second surviving son of Henry Fitzalan-Howard, 14th Duke of Norfolk. In 1876 he assumed by Royal licence the surname of Talbot in lieu of his patronymic in an unsuccessful attempt to succeed to the estates of Bertram, 17th Earl of Shrewsbury and Waterford, having been named by will as his successor and chief beneficiary. Shortly after being raised to the peerage he resumed his first surname. The title became extinct on the death of his son, the second Viscount, in 1962."]}, {"page": "Edward Fitzalan-Howard, 1st Baron Howard of Glossop", "response": ["Howard was the second son of Henry Howard, 13th Duke of Norfolk and Lady Charlotte Sophia Leveson-Gower, daughter of George Leveson-Gower, 1st Duke of Sutherland. Henry Fitzalan-Howard, 14th Duke of Norfolk, was his elder brother.\"Edward George Fitzalan-Howard, 1st Baron Howard of Glossop\", thePeerage.com He was educated at Trinity College, Cambridge."]}, {"page": "Lady Philippa Stewart", "response": ["#REDIRECT Henry Fitzalan-Howard, 14th Duke of Norfolk"]}, {"page": "Philippa Fitzalan-Howard", "response": ["#REDIRECT Henry Fitzalan-Howard, 14th Duke of Norfolk"]}, {"page": "Wilfrid Sheed", "response": ["Sheed was a great-great-grandson of William Ward (cricketer) and of Henry Fitzalan-Howard, 14th Duke of Norfolk and Augusta Mary Minna Catherine Lyons; a great-grandson of William George Ward; a grandson of Wilfrid Philip Ward; a nephew of Father Leo Ward, a missioner in Japan;Rev. Leo Ward, \"The Roman Catholic Church in 1938\", in The Japan Christian Year Book for 1939, www.archive.org/japanchristian37unknuoft/japanchristian37unknuoft_djvu.txt  . the son of Maisie Ward and Frank Sheed, the co-founders of Sheed & Ward; and the brother of the translator, Rosemary Sheed.Wilfred Sheed (1985), Frank and Maisie:  A Memoir with Parents, New York:  Simon & Schuster.  Among Sheed's more remote ancestors was John Howard, 1st Duke of Norfolk."]}]}}