{"wiki_id": "http://www.wikidata.org/entity/Q3787387", "itemLabel": "Hubert Pearson", "itemDescription": "English footballer (1886-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hubert_Pearson", "wikipedia_page": {"main": "Hubert Pryer Pearson (15 May 1886 – October 1955) was an English professional footballer who played as a goalkeeper for West Bromwich Albion.", "link_mentions": [{"page": "Tamworth, Staffordshire", "response": ["* Hubert Pearson (1886–1955) goalkeeper, 341 appearances for West Bromwich Albion F.C."]}, {"page": "Harry Hibbs (footballer)", "response": ["Henry Edward Hibbs (27 May 1906 – 23 April 1984) was an English football goalkeeper who played for Birmingham and England in the 1920s and 1930s. His uncle and cousinHubert Pearson and Harold Pearsonwere also both professional players."]}, {"page": "1912 FA Cup Final", "response": ["|GK || || Hubert Pearson", "|GK || || Hubert Pearson"]}, {"page": "1931 FA Cup Final", "response": ["The clubs had met in the FA Cup on four previous occasions, with Albion victorious each time.McOwan pp. 188–227.Birmingham were known as Small Heath Alliance for the first of these four matches and Small Heath for the second and third. The first meeting of the two teams in the competition was in the 1885–86 semi-final, which was the furthest that Birmingham had progressed prior to their first FA Cup final in 1931.Matthews (2007) p. 393.  Neither club had played a match at Wembley before,McOwan p. 49. though Albion had experienced success in the FA Cup, having appeared in the final on six previous occasions and having won the cup twice, in 1888 and 1892. The two goalkeepers for the 1931 final, Harold Pearson and Harry Hibbs, were cousins. Pearson's father and Hibbs' uncle, Hubert Pearson, had kept goal for Albion during their last appearance in the final in 1912. Birmingham outside forward Ernie Curtis had already gained a cup winners medal with Cardiff City in 1927, while the club's trainer Archie Taylor had played in the Barnsley team that defeated West Bromwich Albion in the 1912 final."]}, {"page": "George Ashmore", "response": ["Ashmore was born in Plymouth and represented South Devon & District Schools. After playing for Nineveh Wesley in Handsworth, he joined West Bromwich Albion in November 1919, and soon replaced Hubert Pearson as the first choice goalkeeper. He made his league debut in October 1920 against Blackburn Rovers at Ewood Park, a match that Albion lost 5–1."]}, {"page": "Harold Pearson (footballer, born 1908)", "response": ["Pearson was born in Tamworth. As a youngster he played football for Glascote United, Glascote Methodists, Belgrave YMCA, Belgrave United, Two Gates F.C., Nuneaton Town and Tamworth Castle. He joined West Bromwich Albion as an amateur in April 1925 and turned professional a month later. His father Hubert Pearson was also a goalkeeper and the two were together on Albion's books until Hubert's retirement in May 1926."]}, {"page": "List of English association football families", "response": ["* Hubert Pearson, Harold Pearson (son), Harry Hibbs (Harold's cousin), Horace Pearson (also Harold's cousin)"]}]}}