{"wiki_id": "http://www.wikidata.org/entity/Q3798461", "itemLabel": "J. M. Cohen", "itemDescription": "British translator", "wikipedia_url": "https://en.wikipedia.org/wiki/J._M._Cohen", "wikipedia_page": {"main": "J. M. (John Michael) Cohen (5 February 1903 – 19 July 1989) was a prolific translator of European literature into English.", "link_mentions": [{"page": "Don Quixote", "response": ["The most widely read English-language translations of the mid-20th century are by Samuel Putnam (1949), J. M. Cohen (1950; Penguin Classics), and Walter Starkie (1957). The last English translation of the novel in the 20th century was by Burton Raffel, published in 1996. The 21st century has already seen five new translations of the novel into English. The first is by John D. Rutherford and the second by Edith Grossman. Reviewing the novel in the New York Times, Carlos Fuentes called Grossman's translation a \"major literary achievement\" and another called it the \"most transparent and least impeded among more than a dozen English translations going back to the 17th century.\"", "* J. M. Cohen (Penguin, 1950)"]}, {"page": "Gargantua and Pantagruel", "response": ["Some people believe the book was based on some of Rabelais' papers; some believe that it has \"nothing to do with Rabelais\". M. A. Screech is of this latter opinion, and, introducing his translation, he bemoans that \"[s]ome read back into the Four books the often cryptic meanings they find in the Fifth\". Donald M. Frame is of the opinion that, when Rabelais died, he \"probably left some materials on where to go on from Book 4\", and that somebody, \"after some adding and padding\", assembled the book that he does not find \"either clearly or largely authentic\". Frame is \"taken with\" Mireille Huchon's work in \"Rabelais Grammairien\",\"Rabelais grammairien. De l'histoire du texte aux problèmes d'authenticité\", Mirelle Huchon, in Etudes Rabelaisiennes XVI, Geneva, 1981 which he cites in support of his opinion. J. M. Cohen, in his Introduction to a Penguin Classics edition, indicates that chapters 17–48 were so out-of-character as to be seemingly written by another person, with the Fifth Book \"clumsily patched together by an unskilful editor.\"", "J. M. Cohen, in the preface to his translation, says Urquhart's part is \"more like a brilliant recasting and expansion than a translation\"; but criticised Motteux's as \"no better than competent hackwork... [W]here Urquhart often enriches, he invariably impoverishes\". Likewise, M. A. Screech says that the \"translation of Urquhart and Motteux [...] is at times a recasting [...] rather than a translation\"; and says it \"remains a joy to read for its own self\". Donald M. Frame, with his own translation, says he finds \"Sir Thomas Urquhart [...] savory and picturesque but too much Urquhart and at times too little R\".", "# J. M. Cohen (1955)"]}, {"page": "Bookcase", "response": ["*H. C. Bunner wrote a comic poem \"Shake, Mulleary and Go-ethe\" \"I have a bookcase which is what / Many much better men have not / There are no books inside, for books / I am afraid might spoil its looks, etc.\"The Penguin Book of Comic and Curious Verse, ed. J. M. Cohen  1952"]}, {"page": "Essays (Montaigne)", "response": ["* J. M. Cohen (1958)"]}, {"page": "The First and Last Freedom", "response": ["The Times Literary Supplement stated that for those who regard conflict \"as an unchangeable condition of human life and truth, Krishnamurti's teaching will seem to offer a delusive short-cut to a vaguely beatific freedom. But there is nothing vague about it. It is precise and penetrating.\" The reviewer thinks that Krishnamurti presents \"a reinterpretation of the wisdom of his  though he has rediscovered it for himself. Nevertheless, J. M. Cohen reviewing the book for The Observer (London) wrote, \"Krishnamurti is an entirely independent master\" adding, \"or those who wish to listen, this book will have a value beyond words."]}, {"page": "John Cohen", "response": ["*J. M. Cohen (John Michael Cohen, 1903–1989), British writer and translator"]}, {"page": "1975 in poetry", "response": ["* J. M. Cohen, A Choice of Comic and Curious Verse"]}, {"page": "1974 in poetry", "response": ["* J. M. Cohen, translator, Sent off the Field from the original Spanish of Fuera del juego by Heberto Padilla"]}, {"page": "The Inchcape Rock", "response": ["In his 1947 English translation of Don Quixote by Miguel de Cervantes, J. M. Cohen refers to \"The Inchcape Rock\" as having a style he wishes to avoid in his rendering of the ballads by Cervantes."]}, {"page": "List of translators into English", "response": ["*J. M. Cohen", "*J. M. Cohen – also a translator of French"]}, {"page": "J M Cohen", "response": ["#REDIRECT J. M. Cohen "]}, {"page": "J.M. Cohen", "response": ["#REDIRECT J. M. Cohen "]}, {"page": "JM Cohen", "response": ["#REDIRECT J. M. Cohen "]}, {"page": "John M. Cohen", "response": ["#REDIRECT J. M. Cohen"]}, {"page": "John Michael Cohen", "response": ["#REDIRECT J. M. Cohen"]}, {"page": "Peter Cooper (author)", "response": ["Peter Cooper Wing Commander, RAF, (1929–2007),Jim Cotter, Obituary Peter Cooper The Guardian, Tuesday 24 July 2007 is an English author who wrote witty detective stories and light verse under the name \"Colin Curzon\". His \"Not tonight Josephine\" was anthologized by J. M. Cohen.J. M. Cohen (Ed.); More comic and curious verse\"; Penguin Books (1956)"]}, {"page": "List of people with surname Cohen", "response": ["* J. M. Cohen (1903–1989), British writer and translator of European literature"]}, {"page": "Style (book)", "response": ["Style was generally well received.F. L. Lucas, Style: The Art of Writing Well, Harriman House Publishing 2012, pp.i–iii (press quotations)Nowell-Smith, Simon, The House of Cassell, 1848-1958 (London 1958) \"A delightful book,\" wrote Time and Tide, \"exemplifying brilliantly all that it seeks to instill – enjoyment of reading and mastery of writing.\"Hugh Gordon Porteus, review of Style in the Time and Tide, September 1955 It was Lucas's most successful book.Wilkinson, L. P., Kingsmen of a Century, 1873–1972 (Cambridge 1980) He had long had a reputation as a stylist,Sir Richard Livingstone, Foreword to Lucas's Euripides and his Influence (Boston 1923)Lucas's own style had been analysed in A. J. J. Ratcliff's Prose of Our Time (London 1931) \"one whose pen possesses the sparkle and fascination which made the essay, in the hands of writers such as Bacon and Montaigne, a thing of beauty and interest\".Cassell's advertisement for Lucas's Studies French and English (London 1934), dust-jacket Raymond Mortimer in The Sunday Times, however, found the author \"sometimes laboured in his anxiety to be debonair\". Some reviewers expressed the view that \"The book's most obvious merit lies in its quotations\" (Rayner Heppenstall in the New Statesman). \"There are almost as many in French as in English, and their range and aptness are remarkable.\"Rayner Heppenstall, 'Prose for General Purposes', review of Style in The New Statesman and Nation, 24 September 1955, p.371-372 Others, however, felt that there should have been fewer examples from poetry and more from contemporary prose.J. M. Cohen, review of Style in The Spectator, 18 November 1955 The Listener approved \"the entertaining relevance of anecdote\".Review of Style in The Listener, September 1955 Sir Bruce Fraser praised Lucas's close analysis of faulty style: \"The passage in which he dissects a great hunk of Swinburne's prose, reduces it by more than half, recognizes that it could be made shorter still, and ends by suggesting that it need not have been written at all, is in itself worth the whole price of the book\".Foreword by Sir Bruce Fraser to 1974 Cassell reprint of Style Philip Toynbee of The Observer disliked the work and dismissed its author as \"middlebrow\": \"There have been wonderful styles which illustrate the virtues of clarity, brevity, simplicity and vitality. Other styles, no less wonderful, have exhibited obscurity, amplitude, complexity and decadence. Good writers have been urbane, gay and healthy: other good writers have been boorish, melancholic and diseased... Mr Lucas pays lip-service to the recalcitrant disorder of the scene\" but \"writes far too briefly of variety\".Philip Toynbee, review of Style in The Observer, 11 September 1955 More recently, Joseph Epstein in The New Criterion (2011) considered the book \"filled with fine things ... F. L. Lucas wrote the best book on prose composition, for the not-so-simple reason that, in the modern era, he was the smartest, most cultivated man to turn his energies to the task\".Epstein, Joseph, 'Heavy Sentences', The New Criterion June 2011  The 2011 article \"brought attention to this neglected classic and helped set in train its reissue\".F. L. Lucas, Style: The Art of Writing Well (Harriman House Publishing 2012), Publisher's Acknowledgements, p.257Walther, Matthew, 'The Art of Writing Well', review of Style in New English Review, July 2012"]}]}}