{"wiki_id": "http://www.wikidata.org/entity/Q3791484", "itemLabel": "Ian Matthews", "itemDescription": "English rock drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Matthews_(drummer)", "wikipedia_page": {"main": "Ian Matthews  (born 20 June 1971) is an English musician, best known as the drummer for the rock band Kasabian.\nPrior to Kasabian, Matthews played with a number of noted local Bristol bands, such as K-Passa, CCQ, and Sissi. He met Kasabian in 2001 before the band were signed when they were recording demos in Bristol. From these early sessions Matthews recorded with them came the single \"Processed Beats\". He also played on \"Butcher Blues\" and \"Club Foot\" from Kasabian's self-titled debut album. He also overdubbed an extra drum track over the single version of \"Cutt Off\", and recorded the drums to the B-side \"Beneficial Herbs\". He was asked to tour with them in April 2004 and became a permanent member in April 2005.\nMatthews started his career as a young club/jazz drummer and when not touring or recording with Kasabian, he often plays small jazz/funk gigs in and around Bristol. He has recorded with Bristol artist James Morton's Porkchop on Don't You Worry 'Bout That album.He cites Mitch Mitchell, Tony Williams and Buddy Rich as his strongest drumming influences.In 2015, Matthews joined with Al Murray, Keith Keough, Stuart Warmington and Al Kitching in founding the British Drum Company.", "link_mentions": [{"page": "List of drummers", "response": ["* Ian Matthews (Kasabian)"]}, {"page": "Kasabian (album)", "response": ["*Ian Matthews – drums "]}, {"page": "L.S.F. (song)", "response": ["The drums on this track are played by Daniel Ralph Martin, who also played drums on \"Cutt Off\", as permanent drummer Ian Matthews did not join until midway through the album's recording sessions. Lead guitarist Christopher Karloff fills in as the drummer in the UK music video. The US music video features all five members at the time and is their only video to do so besides \"Processed Beats\". "]}, {"page": "Kasabian", "response": ["Kasabian ( ) are an English rock band formed in Leicester in 1997 by Tom Meighan, Sergio Pizzorno, Chris Karloff, and Chris Edwards. Drummer Ian Matthews joined in 2004. Karloff left the band in 2006 and founded a new band called Black Onassis. Jay Mehler joined as touring lead guitarist in 2006, leaving for Liam Gallagher's Beady Eye in 2013, to be replaced by Tim Carter. Meighan left the band in July 2020.", "During this period, various drummers played with Kasabian, including current keyboard player Ben Kealey, DJ Dan Ralph Martin, Martin Hall-Adams, brothers Mitch and Ryan Glovers and some others. While recording in Bristol, the band met Ian Matthews, who plays on \"Processed Beats\", \"Butcher Blues\", \"Beneficial Herbs\" and possibly some other songs on the debut album and B-sides. He was asked to tour with them in 2004 and became a permanent member in April 2005. The album was produced by Jim Abbiss.", "*Ian Matthews – drums, percussion (2004–present)", " bar:Matthews text:Ian Matthews"]}, {"page": "Keith Tippett", "response": ["* Ian Matthews, If You Saw Thro' My Eyes (Vertigo, 1971)"]}, {"page": "Ian", "response": ["*Ian Matthews (drummer) (born 1971), drummer for Kasabian", "*Iain Matthews (born 1946), formerly known as Ian Matthews, English musician, singer-songwriter, member of Fairport Convention"]}, {"page": "Empire (Kasabian album)", "response": ["Empire was the first full Kasabian album to feature drummer Ian Matthews, who was recruited in 2005. Lead songwriter and guitarist Christopher Karloff left the band in early 2006, during recording of the album, having contributed the music for three tracks.", "*Ian Matthews – drums"]}, {"page": "Processed Beats", "response": ["The music video features the band perform in a warehouse, and later the woods. As well as being their first song to feature Ian Matthews on drums, it is also his first music video appearance, although he is kept in the background due to not yet being an official member, and in the shot of the band going to the woods, he is not seen with them."]}, {"page": "Ian Matthews", "response": ["*Iain Matthews (born 1946), also known as Ian Matthews, British folk-rock musician, and former member of Fairport Convention and Plainsong", "*Ian Matthews (drummer) (born 1971), drummer for the English rock band Kasabian", "*Ian Matthews, former editor of Christian Marketplace", "*Ian Matthews (actor), Canadian actor starring in Gangland Undercover"]}, {"page": "Version (album)", "response": ["*Ian Matthews – drums (track 13)"]}, {"page": "Songs for Survival", "response": ["# Skin/Robot Club/Ian Matthews feat. the Adi tribe - \"Simmer Down\" (4:04)"]}, {"page": "West Ryder Pauper Lunatic Asylum", "response": ["*Ian Matthews – drums"]}, {"page": "Velociraptor!", "response": ["*Ian Matthews – drums"]}, {"page": "List of awards and nominations received by Kasabian", "response": ["Kasabian is an English alternative rock band formed in 1997 by Sergio Pizzorno (guitar), Tom Meighan (lead vocals), Chris Edwards (bass guitar) and Christopher Karloff (lead guitar). They were later joined by drummer Ian Matthews in 2004 and guitarist Jay Mehler replaced Karloff in 2006 as a live member. To date the band have released six studio albums: Kasabian (2004), Empire (2006), West Ryder Pauper Lunatic Asylum (2009), Velociraptor! (2011) 48:13 (2014) and For Crying Out Loud (2017)."]}, {"page": "Eez-eh", "response": ["The video features the band dancing and posing in front of a large karaoke screen showing the lyrics of the song. Segments of the video see the members jumping up and down in a line, ornaments of various animals and frontman Tom Meighan spitting milk into the lens of the camera. Sergio Pizzorno appears both wearing a '48:13' T-shirt and without a shirt, often also wearing large foam hands. Bassist Chris Edwards also appears, at one stage wearing a Groucho Marx disguise and smoking a cigar, and drummer Ian Matthews appears, wearing a snapback with pipes connected to his mouth."]}, {"page": "48:13", "response": ["*Ian Matthews – drums, percussion"]}]}}