{"wiki_id": "http://www.wikidata.org/entity/Q37945437", "itemLabel": "Jamie Grimes", "itemDescription": "association football player (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Grimes", "wikipedia_page": {"main": "Jamie Neil Grimes (born 22 December 1990) is an English professional footballer for Chesterfield F.C.", "link_mentions": [{"page": "Keith Lowe", "response": ["Lowe signed a one-year contract with National League club Macclesfield Town on 29 June 2017. He played every minute of Macclesfield's 46 league matches during the 2017–18 season as the club earned promotion back to League Two as champions of the National League. Manager John Askey left the club after this success, but his replacement, Mark Yates, had coached Lowe at Cheltenham and Kidderminster, and offered him a new one-year contract. However he featured only 17 times in the 2018–19 campaign, playing only two games after Sol Campbell took charge in December. He left Moss Rose after being released in the summer. Lowe went on to become one of six players – the others being Shamir Mullings, Elliott Durrell, Rhys Taylor, Jamie Grimes and Ryan Lloyd – to issue the club with a winding-up petition over unpaid wages."]}, {"page": "Grimes (surname)", "response": ["*Jamie Grimes (born 1990), English footballer"]}, {"page": "Ryan Lloyd", "response": ["Lloyd signed a two-year contract with National League club Macclesfield Town in June 2017. On 25 November, he scored from within his own half in a 1–1 draw at Maidenhead United. He scored four goals in 29 appearances in 2017–18 as John Askey's \"Silkmen\" won promotion back to the English Football League as champions of the National League. However he featured just 14 times in the 2018–19 season and was not retained by manager Sol Campbell. He was a linked with a return to former club Port Vale, now managed by John Askey, who said \"He has a feeling for the club, he lives locally, he has a good attitude and good ability. He'd be somebody I would be interested in.\" Lloyd went on to become one of six players – the others being Shamir Mullings, Elliott Durrell, Rhys Taylor, Jamie Grimes and Keith Lowe – to issue the club with a winding-up petition over unpaid wages."]}, {"page": "2017–18 Colchester United F.C. season", "response": ["Colchester's terrible away form continued on 16 September with a 3–1 defeat at Cheltenham Town. Within 15-minutes, the U's found themselves 2–0 down with both goals coming from Cheltenham's Kevin Dawson. Colchester were awarded a penalty in the 26th minute after Taylor Moore handled in the penalty area and Sammie Szmodics converted to score his fifth goal of the campaign. In the second-half, Mikael Mandron was sent off for a hand ball offence in the penalty area, but Brian Graham's penalty was saved by Sam Walker. Shortly afterwards, Jamie Grimes scored to complete the victory for Cheltenham and condemn Colchester to their fourth successive away defeat."]}, {"page": "2017–18 Luton Town F.C. season", "response": ["Luton won 1–0 in their first round match of the FA Cup at home to Portsmouth, in which Collins scored the only goal in first-half stoppage time with a left-footed shot into the bottom corner. Potts scored a header from Sheehan's corner to give Luton an 11th-minute lead away to Cheltenham Town, before the home team equalised through Jamie Grimes on 37 minutes. Elliot Lee put Luton back in front in the 86th minute when Sheehan's free kick hit the wall and fell to him inside the six-yard box before shooting into the bottom corner, and Will Boyle equalised for Cheltenham in the seventh minute of stoppage time from close range following Jerell Sellars' corner, the match finishing a 2–2 draw. Jack Senior signed a one-year contract extension with Luton, with the option of a further year. Luton moved back into the automatic promotion places after beating Cambridge United 7–0 at home, in which they took the lead after Potts scored from close range in the 24th minute. Olly Lee doubled the lead seven minutes later after chipping goalkeeper David Forde from 65 yards before Hylton scored on 35 minutes with a shot into the bottom corner to make the score 3–0. Elliot Lee extended the lead in first-half stoppage time with a volley into the top corner. Hylton scored from Stacey's cross in the 81st minute, before Elliot Lee scored Luton's sixth goal from 20 yards, and Hylton completed his hat-trick in the second minute of stoppage time from Sheehan's free kick. Cotter had his loan at Hitchin extended for another month."]}, {"page": "2018–19 Cheltenham Town F.C. season", "response": ["| 1 July 2018 || CB ||  || Jamie Grimes || Macclesfield Town || Released || "]}, {"page": "2018–19 Macclesfield Town F.C. season", "response": ["| 1 July 2018 || CB ||  || Jamie Grimes || Cheltenham Town || Free transfer || "]}, {"page": "2019–20 Macclesfield Town F.C. season", "response": ["| 1 July 2019 || CB ||  || Jamie Grimes ||  Ebbsfleet United || Released || "]}]}}