{"wiki_id": "http://www.wikidata.org/entity/Q3809618", "itemLabel": "John Simon", "itemDescription": "British pathologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Simon_(pathologist)", "wikipedia_page": {"main": "Sir John Simon  (10 October 1816 – 23 July 1904) was an English pathologist, surgeon and public health officer. He was the first Chief Medical Officer for Her Majesty's Government from 1855–1876.", "link_mentions": [{"page": "Victorian era", "response": ["John Simon, as chief medical officer of the General Board of Health, secured funds for research into various common infectious diseases at the time, including cholera, diphtheria, smallpox, and typhus. Using his political influence, he garnered support for the Public Health Act of 1875, which focused on preventative measures in housing, the water supply, sewage and drainage, providing Britain with an extensive public health system."]}, {"page": "John Ruskin", "response": ["In a letter to his physician John Simon on 15 May 1886, Ruskin wrote:"]}, {"page": "Miasma theory", "response": ["Even though eventually disproved by the understanding of bacteria and the discovery of viruses, the miasma theory helped establish the connection between poor sanitation and disease. That encouraged cleanliness and spurred public health reforms which, in Britain, led to the Public Health Acts of 1848 and 1858, and the Local Government Act of 1858. The latter of those enabled the instituting of investigations into the health and sanitary regulations of any town or place, upon the petition of residents or as a result of death rates exceeding the norm. Early medical and sanitary engineering reformers included Henry Austin, Joseph Bazalgette, Edwin Chadwick, Frank Forster, Thomas Hawksley, William Haywood, Henry Letheby, Robert Rawlinson, John Simon, John Snow and Thomas Wicksteed. Their efforts, and associated British regulatory improvements, were reported in the United States as early as 1865."]}, {"page": "John Simon", "response": ["John Simon may refer to:", "*John Simon (composer) (born 1944), classical composer and poet", "*John Simon (critic) (1925–2019), American author and critic", "*John Simon (record producer) (born 1941), record producer for Columbia Records", "*John Simon (died 1524), MP for Exeter", "*John Simon (MP, born 1818) (1818–1897), British politician", "*John Simon, 1st Viscount Simon (1873–1954), Lord Chancellor of Great Britain, 1940–1945", "*John Simon (rugby league) (born 1972), Australian former professional rugby league footballer", "*John Simon (running back) (born 1978), American football running back", "*John Simon (linebacker) (born 1990), American football linebacker", "*John Simon (engraver) (1675–1751), Anglo-French engraver", "*Sir John Simon (pathologist) (1816–1904), Chief Medical Officer (United Kingdom), 1855–1876", "*John Simons (born 1956), British radio executive", "*John Simons (chemist) (born 1934), British physical chemist"]}, {"page": "Great Stink", "response": ["The civic infrastructure overseeing the management of London's sewers had gone through several changes in the 19th century. In 1848 the Metropolitan Commission of Sewers (MCS) was established at the urging of the social reformer Edwin Chadwick and a Royal Commission. The Commission superseded seven of the eight authorities that had managed London's sewers since the time of Henry VIII; it was the first time that a unitary power had full control over the capital's sanitation facilities. The Building Act 1844 had ensured that all new buildings had to be connected to a sewer, not a cesspool, and the commission set about connecting cesspools to sewers, or removing them altogether. Because of the fear that the miasma from the sewers would cause the spread of disease, Chadwick and his successor, the pathologist John Simon, ensured that the sewers were regularly flushed through, a policy that resulted in more sewage being discharged into the Thames."]}, {"page": "Edward Headlam Greenhow", "response": ["An inquiry Greenhow undertook into mortality from diseases in certain districts in England, for his lectures, was published as a parliamentary paper by John Simon, medical officer of the Board of Health. The facts gathered in this inquiry were made the basis of future work arising out of the Public Health Act 1858, when Simon was medical officer to the Privy Council. Greenhow was engaged for inquiries into diphtheria (1859) and pulmonary disease among operatives (miners, grinders, flax-dressers, etc.), with a report on this latter subject (1860–1861) being of wide interest. Simon resigned in 1876 as Chief Medical Officer to the Privy Council, and the post was abolished: Greenhow had lost an ally. Simon and Greenhow were persuaded that cleanliness led to health, and that pollution, such as in Liverpool, was the cause of the plagues of typhoid and Asiatic cholera in Britain. The government used William Henry Duncan to undermine the conclusions of Greenhow."]}, {"page": "1854 Broad Street cholera outbreak", "response": ["In contrast, the germ theory held that the principal cause of cholera was a germ cell that had not yet been identified. Snow theorized that this unknown germ was transmitted from person to person by individuals ingesting water. John Simon, a pathologist and the lead medical officer for London labeled Snow's germ theory as \"peculiar\".", "Excerpt from John Simon:"]}, {"page": "City of London Cemetery and Crematorium", "response": ["In 1849 William J. Haywood, Chief Engineer of the City of London Commission of Sewers, reported on the condition of the city's churchyards and their health risks. The Commissioners were responsible for public hygiene and sanitation and were in effect also the burial board for the City of London, due to an Act of Parliament in 1852. The commissioners directed that a cemetery be built for the city's 106 parishes, to replace intramural interment (burial within the confines of a parish). The task was taken up by William Haywood and Dr John Simon."]}, {"page": "John Simon (doctor)", "response": ["#REDIRECT John Simon (pathologist)"]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|John Simon||09/01/1845||10 October 1816 – 23 July 1904 Pathologist"]}, {"page": "John Simon (sanitary reformer and pathologist)", "response": ["#REDIRECT John Simon (pathologist)"]}, {"page": "Joseph Henry Green", "response": ["Having suffered in his later years from inherited gout, he had an acute seizure on 1 November 1863, and died in his house at Hadley on 13 December. According to his friend Sir John Simon, his last words were \"Stopped.\", referring to his own pulse \"After which, he in silence set his finger to his wrist, and visibly noted to himself the successive feeble pulses which were but just between him and death. Presently he said \" stopped.\" And this was the very end.\" - Spiritual philosophy : founded on the teaching of the late Samuel Taylor Coleridge, Tome 1, page LIX", "As Hunterian orator at the college in 1841 he gave before a distinguished audience an obscure address on 'Vital Dynamics,' an attempt to connect science with the philosophy of Coleridge. Re-appointed Hunterian orator in 1847, he supplemented his former Coleridgean exposition with another in the same vein on 'Mental Dynamics; or, Groundwork of a Professional Education.' He made little definite progress with the Coleridgean system; but before he died he compiled a work from Coleridge's marginalia, fragments, and recollected oral teaching, under the title 'Spiritual Philosophy, founded on the teaching of S. T. Coleridge,' which was brought out, in two volumes (1865), with a memoir of Green, by his friend and former pupil Sir John Simon. The first volume, of which the first chapter was dictated to Green by Coleridge himself, is occupied with a groundwork of principles; the second volume is theological."]}, {"page": "John Simon (surgeon)", "response": ["#REDIRECT John Simon (pathologist)"]}, {"page": "1887 Golden Jubilee Honours", "response": ["*John Simon Esq CB MD, late Medical Officer, Privy Council Office."]}, {"page": "Sir John Simon (surgeon)", "response": ["#REDIRECT John Simon (pathologist)"]}, {"page": "Edward Cator Seaton", "response": ["Seaton studied medicine at the University of Edinburgh and moved to London in 1841. He made his professional reputation with a report on vaccination against smallpox for the Epidemiological Society of London which was presented to Parliament in 1852. He was then appointed as the vaccination inspector under the 1853 Vaccination Act by John Simon. When Simon resigned in 1876, he was appointed Chief Medical Officer."]}, {"page": "Richard Thorne Thorne", "response": ["He worked for John Simon as an inspector investigating outbreaks of typhoid fever. He succeeded George Buchanan as Chief Medical Officer for the UK in 1892 and was awarded CB the same year. He served as President of the Epidemiological Society from 1887 to 1889."]}, {"page": "Brown Animal Sanatory Institution", "response": ["Mr Thomas Brown of Rosey Park Hill, Dublin who lived in London died in 1852. Brown's Will stated the purpose of his bequest for \"founding, establishing and upholding an Institution for investigating, studying and, without charge beyond immediate expenses, endeavouring to cure maladies, distempers and injuries any quadrupeds or birds useful to man may be subject to, for and towards which purpose of founding, establishing and upholding such animal sanatory institution within a mile of either Westminster, Southwark or Dublin.” The funds were transferred to the University of London in 1858 and accumulated interest till 1871 to a value of £33,781. John Burdon-Sanderson was appointed as superintendent and because the Mortmain Act prevent purchase of land using the trust fund, a site of 1.5 acres was purchased with a £2000 gift from John Cunliffe of Lombard Street and £500 from Burdon-Sanderson. The land was on Wandsworth Road. The institute was opened in 1871. The single large building had one basement floor accessible by a trapdoor from the apparatus room. A description by William Bulloch in 1925 notes: \"If one takes a tram from Westminster Bridge along the Embankment past “Lambeth Palace and Doultons and underneath an ugly railway bridge across the Wandsworth Road one reaches (No. 149) a small archway on which is graven the legend “The Brown Sanatory Institution founded 1871.” On entering, one comes to a stable yard and, behind, a low building of one storey. This is the famous “Brown” now falling, sad to say, into a considerable state of decay and uncared for.\"The institute was supported by John Simon (1816-1904) pathologist and medical officer in the board of health for London. Among the researchers who worked at the institute was a Viennese scientist, Emanuel Edward Klein, sometimes considered the father of British bacteriology. The research he and his colleagues conducted at the Institution were published as in 1873 as the Handbook for the Physiological Laboratory along with John Burdon-Sanderson, Michael Foster, and Thomas Lauder Brunton. Their experiments included vivisection of animals, and following widespread protests, led to an enquiry in 1875, the Royal Commission on Vivisection for Scientific Purposes, chaired by Lord Cardwell and which resulted in the establishment of the Cruelty to Animals Act 1876. Activists writing in the press pointed out that a founding principle, \"kindness to animals is a general principle of the Institution\" was hardly followed."]}]}}