{"wiki_id": "http://www.wikidata.org/entity/Q38022316", "itemLabel": "Alexandra Harris", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexandra_Harris", "wikipedia_page": {"main": "Alexandra Harris (born 1981) is a British writer and academic. From 2007 to 2017, Harris was a professor in English at the University of Liverpool.\nIn autumn 2017 Harris took up the post of Professorial Fellow at the University of Birmingham.\nHarris was born in Sussex and has written the books Romantic Moderns, on modernism in inter-war Britain, and Weatherland on weather in English art and literature. She has also written a short biography of Virginia Woolf. She was appointed a Fellow of the Royal Society of Literature in 2014.", "link_mentions": [{"page": "Royal Society of Literature", "response": ["| Alexandra Harris"]}, {"page": "Somerset Maugham Award", "response": ["* Alexandra Harris for Romantic Moderns"]}, {"page": "Guardian First Book Award", "response": ["* Alexandra Harris, Romantic Moderns: English Writers, Artists and the Imagination from Virginia Woolf to John Piper"]}, {"page": "Farlington School", "response": ["* Alexandra Harris, author and professor."]}, {"page": "Longman–History Today Awards", "response": ["|Maria Ranuro (for Alexandra Harris's Weatherland: Writers and Artists Under English Skies)"]}, {"page": "Philip Leverhulme Prize", "response": ["* Languages and Literatures: William Abberley, Alexandra Harris, Daisy Hay, Lily Okalani Kahn, Hannah Rohde"]}, {"page": "2015 Pan American Junior Athletics Championships", "response": ["|align=left | Alexandra Harris  || 10:31.79"]}, {"page": "2017 Pan American U20 Athletics Championships", "response": ["|Alexandra Harris || 10:14.76"]}, {"page": "Golden Hill (novel)", "response": ["Golden Hill was widely praised on publication. Steven Poole in the Guardian commented that \"The whole thing ... is a first-class period entertainment, until at length it becomes something more serious.\"1 June 2016. Alexandra Harris, writing for the Daily Telegraph, called it \"verifiable gold\" and applauded \"a novel of gloriously capacious humanity, thick-woven with life in all its oddness and familiarity, a novel of such joy it leaves you beaming, and such seriousness that it asks to be read again and again.\".Daily Telegraph, 16 June 2016. In the Sunday Times, Peter Kemp praised Spufford's \"superbly inventive visual responsiveness\" and \"high-fidelity literary mimicry\".Sunday Times, 25 December 2016. In the New York Times, Dwight Garner commended the novel as \"a high-level entertainment, filled with so much brio that it’s as if each sentence had been dusted with Bolivian marching powder and cornstarch and gently fried\".New York Times, 27 June 2017."]}, {"page": "Winter (Smith novel)", "response": ["*Alexandra Harris in The Guardian praises the novel as being 'a pattern of visitations. The floating child-stone-head is a visitor in Sophia’s body – though there’s no knowing which part: is it a floater in her eye as well as a hallucination?. All this is the bounty of Sophia’s imagination, which complicates her role as the commercial, conventional antagonist to her sister Iris, the wild child who left home to be an activist and chained herself to the fence at Greenham Common. And there is no answer to the quarrel between the sisters, which is based on ideas of the individual’s role in the world. “I hate you,” they tell each other, and Sophia rests her head on Iris’s chest. Little is resolved at the end, but the novel works through correspondences that jump across bounds and make accord between unlike things. Leaping, laughing, sad, generous and winter-wise, this is a thing of grace.'Winter by Ali Smith review – wise, generous and a thing of grace in The Guardian Retrieved 16/10/2020."]}]}}