{"wiki_id": "http://www.wikidata.org/entity/Q380912", "itemLabel": "Neil Aspinall", "itemDescription": "Road manager, personal assistant, producer, executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Aspinall", "wikipedia_page": {"main": "Neil Stanley Aspinall (13 October 1941 –  24 March 2008) was a British music industry executive. A school friend of Paul McCartney and George Harrison, he went on to head the Beatles' company Apple Corps.\nThe Beatles employed Aspinall first as their road manager, which included driving his old Commer van to and from shows, both day and night. After Mal Evans started work for the Beatles, Aspinall was promoted to become their personal assistant, later becoming chief executive of their company, Apple Corps.\nOn behalf of Apple, Aspinall was involved in notable court cases against Allen Klein, EMI and Apple Computer. He supervised the marketing of music, videos and merchandising, as well being a director of Standby Films, which was run from his home in Twickenham, London. On 10 April 2007, Aspinall retired from Apple Corps and died of lung cancer in New York in 2008.", "link_mentions": [{"page": "March 24", "response": ["*  2008   – Neil Aspinall, Welsh-English record producer and manager (b. 1941)"]}, {"page": "October 13", "response": ["*1941 – Neil Aspinall, Welsh-English record producer and manager (d. 2008)"]}, {"page": "Pete Best", "response": ["During 1960, Neil Aspinall became good friends with the young Best and subsequently rented a room in the Bests' house. During one of the extended business trips of Best's stepfather, Aspinall became romantically involved with Mona. Aspinall fathered a child by Mona—Vincent \"Roag\" Best, Mona's third son—who is Best's half-brother. Aspinall later became the Beatles' road manager, and denied the story for years before publicly admitting that Roag was indeed his son.", "Best had been good friends with Neil Aspinall since 1961, when Aspinall had rented a room in the house where Best lived with his parents. While still part of the group, Best had asked Aspinall to become the band's road manager and personal assistant; accepting the job, Aspinall bought an old Commer van for £80 (equivalent to £ in ). Aspinall was waiting for Best downstairs in Epstein's NEMS record shop after the dismissal meeting. The two went to the Grapes pub on Mathew Street, the same street as the Cavern Club, where the group had played. Aspinall was furious at the news, insisting to Best that he would also resign from the Beatles. Best strongly advised him to remain with the group. Aspinall's relationship with Mona Best (and their three-week-old baby, Roag) was ended. At the next concert Aspinall asked Lennon why they had fired Best, to which he replied \"It's got nothing to do with you, you're only the driver.\"Aspinall, The Beatles and money – Mersey Beat triumphpc.com – Retrieved 11 February 2007", "Before Epstein took the Beatles on, Mona had been handling most of the management and promotional work. According to promoter and manager Joe Flannery,Series of interviews with Liverpool promoter and manager Joe Flannery 1996–1999, recounted by Michael Brocken in Chapter 4 of his book Hidden Voices: Hidden Histories of Liverpool's popular music scenes, 1930s–1970s. Burlington VT, Ashgate Publishing Company, 2010 Mona had done a great deal for the band by arranging a number of important early gigs and lending them a badly needed helping hand when they returned from Hamburg the first time, but this came at the cost of having to contend with her overbearing nature. At this crucial time in the history of the Beatles, Lennon confided to Flannery that he considered Mona 'bossy like [his aunt] Mimi' and believed that she was using the Beatles only for the sake of her son Pete,Brocken 2010 though this should be weighed against the fact that the Beatles' cordial relations with Mona soon resumed. She often met them while visiting Neil Aspinall at his London home. On these occasions, the Beatles often had small gifts for her which they had acquired on their travels. For her part, Mona allowed them to use her father's military medals in the photo shoot for the Sgt. Pepper album cover.Roag Best et al. The Beatles: The True Beginnings. p170", "Eventually, Best began giving interviews to the media, writing about his time with the group and serving as a technical advisor for the television film Birth of the Beatles. He found a modicum of independent fame, and has admitted to being a fan of his former band's music and owning their records.Pete Best interview retrosellers.com – Retrieved 21 May 2007  In 1995, the surviving Beatles released Anthology 1, which featured a number of tracks with Best as drummer, including songs from the Decca and Parlophone auditions. Best received a substantial windfall – between £1 million and £4 million – from the sales, although he was not interviewed for the book or the documentaries.Money from sales liverpoolecho.co.uk – Retrieved 5 November 2007Money from Anthology lakeconews.com – Retrieved 5 November 2007   According to writer Philip Norman, the first time Best knew about the royalties due him for the use of those tracks \"was a phone call\" from Paul McCartney himself, \"the one who'd been so keen to get rid of him – the first time they'd spoken since it happened. \"Some wrongs need to be righted,\" Paul told him. \"There's some money here that's owing to you and you can take it or leave it.\" Best took it.\" However, Best asserts that it was Neil Aspinall and not McCartney who phoned him. “Paul McCartney claims he called me but he didn’t,” Best told The Irish Times."]}, {"page": "Ringo Starr", "response": ["On 11 February 1965, Starr married Maureen Cox, whom he had met in 1962. By this time the stress and pressure of Beatlemania had reached a peak for him. He received a telephoned death threat before a show in Montreal, and resorted to positioning his cymbals vertically in an attempt to defend against would-be assassins. The constant pressure affected the Beatles' performances; Starr commented: \"We were turning into such bad musicians ... there was no groove to it.\" He was also feeling increasingly isolated from the musical activities of his bandmates, who were moving past the traditional boundaries of rock music into territory that often did not require his accompaniment; during recording sessions he spent hours playing cards with their road manager Neil Aspinall and roadie Mal Evans while the other Beatles perfected tracks without him. In a letter published in Melody Maker, a fan asked the Beatles to let Starr sing more; he replied: \"[I am] quite happy with my one little track on each album\"."]}, {"page": "The Beatles", "response": ["Live at the BBC, the first official release of unissued Beatles performances in seventeen years, appeared in 1994. That same year McCartney, Harrison and Starr collaborated on the Anthology project. Anthology was the culmination of work begun in 1970, when Apple Corps director Neil Aspinall, their former road manager and personal assistant, had started to gather material for a documentary with the working title The Long and Winding Road. Documenting their history in the band's own words, the Anthology project included the release of several unissued Beatles recordings. McCartney, Harrison and Starr also added new instrumental and vocal parts to songs recorded as demos by Lennon in the late 1970s."]}, {"page": "2008", "response": ["** Neil Aspinall, British record producer and business executive (b. 1942)"]}, {"page": "Fifth Beatle", "response": ["*Harrison stated at the Beatles' 1988 induction into the Rock and Roll Hall of Fame that there were only two \"fifth Beatles\": Derek Taylor, the Beatles' public relations manager, and Neil Aspinall, their road manager-turned-business-executive.", "===Neil Aspinall===", "By 1968, he became press officer for Apple Corps. As a VIP at Apple, Taylor had a major role in the company's ups and downs, making or enforcing many crucial business and personal decisions, for the Beatles and Apple's staff, and witnessing many key moments in the latter days of both. In January 1988, while accepting the Beatles' induction into the Rock and Roll Hall of Fame, Harrison named Taylor as one of only two people worthy of the title \"the Fifth Beatle\", the other being Neil Aspinall."]}, {"page": "Sgt. Pepper's Lonely Hearts Club Band", "response": ["\"Sgt. Pepper's Lonely Hearts Club Band (Reprise)\" follows as a segue to the album's finale. The hard-rocking song was written after Neil Aspinall, the Beatles' road manager, suggested that since \"Sgt. Pepper\" opened the album, the fictional band should make an appearance near the end. Sung by all four Beatles, the reprise omits the brass section from the title track and has a faster tempo. With Harrison on lead guitar, it serves as a rare example from the Sgt. Pepper sessions where the group taped a basic track live with their usual stage instrumentation. MacDonald finds the Beatles' excitement tangibly translated on the recording, which is again augmented with ambient crowd noise.", "* Neil Aspinall – tambura, harmonica"]}, {"page": "Beatles for Sale", "response": ["Beatles for Sale was the Beatles' fourth album release in the space of 21 months. Neil Aspinall, the band's road manager, later reflected: \"No band today would come off a long US tour at the end of September, go into the studio and start a new album, still writing songs, and then go on a UK tour, finish the album in five weeks, still touring, and have the album out in time for Christmas. But that's what the Beatles did at the end of 1964. A lot of it was down to naiveté, thinking that this was the way things were done. If the record company needs another album, you go and make one.\" Noting the subdued and melancholy tone of much of the album, producer George Martin recalled: \"They were rather war weary during Beatles for Sale. One must remember that they'd been battered like mad throughout 1964, and much of 1963. Success is a wonderful thing but it is very, very tiring.\""]}, {"page": "Revolver (Beatles album)", "response": ["*Neil Aspinall – background vocals on \"Yellow Submarine\""]}, {"page": "The Rutles", "response": ["Written by Idle and Innes, All You Need Is Cash documents the rise and fall of the Rutles, paralleling much of the history of the Beatles. The project was given extra recognition through Harrison's support; as well as providing ideas, he supplied Idle and Innes with a copy of the Beatles' long-planned documentary, The Long and Winding Road (eventually re-titled The Beatles Anthology and released in 1995). Idle drew inspiration from this 1976 version of the documentary, as compiled by Neil Aspinall, and was granted permission to use some of the archival footage to tell the Rutles' story."]}, {"page": "Derek Taylor", "response": ["In January 1988, while accepting the Beatles' induction into the Rock and Roll Hall of Fame, Harrison named Taylor and Neil Aspinall as the two people worthy of the much-used title \"the Fifth Beatle\". In the early 1990s Taylor was asked to rejoin Apple to be in charge of marketing of the multiple projects planned for that decade. The projects included the CD release of the non-Beatle Apple catalogue and major Beatles releases such as Live at the BBC and compilation albums associated with The Beatles Anthology."]}, {"page": "Mal Evans", "response": ["In the early 1960s, Evans was employed as a telephone engineer, and also worked part-time as a bouncer at the Cavern Club. The Beatles' manager, Brian Epstein, later hired Evans as the group's assistant roadie, in tandem with Neil Aspinall. Evans contributed to recordings, and appeared in some of the films the group made. After the Beatles stopped touring in 1966, Evans carried on assisting them until their break-up in 1970. From 1969, Evans also found work as a record producer (most notably with Badfinger's top 10 hit \"No Matter What\").", "Evans was cremated on 7 January 1976, in Los Angeles. None of the former Beatles attended his funeral, but Harry Nilsson, George Martin, Neil Aspinall and other friends did. George Harrison arranged for Evans' family to receive £5,000, as Evans had not maintained his life insurance premiums, and was not entitled to a pension."]}, {"page": "Magic Alex", "response": ["The Beatles had tried in 1964 to buy the  Trinity Island, (Greek: Αγια Τριάδα), off the coast of the Greek island of Euboea (pronounced EV-i-a) (resembling a guitar in shape) but the owners were not interested in a sale. Lennon was still interested in buying or leasing an island to live on together, and discussed it with the other Beatles on 19 July 1967. Mardas' father was a major in the Greek secret police, and Mardas explained that through him the Beatles would have access to Greek government connections, which would speed the acquisition of an island, because many islands did have the right certificates of ownership and were subject to government restrictions. On 22 July 1967, Harrison and his wife Pattie Boyd, Ringo Starr and Neil Aspinall flew to Athens, where they stayed in Mardas' parents' house overnight, until Lennon, along with Cynthia Lennon and their son Julian Lennon, McCartney and Jane Asher, Pattie Boyd's 16-year-old sister Paula, Mal Evans and Alistair Taylor set off for Athens."]}, {"page": "Magical Mystery Tour", "response": ["*\"Magical Mystery Tour\" – Mal Evans and Neil Aspinall on percussion; David Mason, Elgar Howarth, Roy Copestake and John Wilbraham on trumpets"]}, {"page": "Strawberry Fields Forever", "response": ["After recording the second version of the song, Lennon wanted to do something different with it. Martin recalled: \"He'd wanted it as a gentle dreaming song, but he said it had come out too raucous. He asked me if I could write him a new line-up with the strings. So I wrote a new score (with four trumpets and three cellos) ...\" For this purpose, another basic track was recorded on 8 and 9 December, with the group attempting the song at a faster tempo than before. At the start of the first session, recording was overseen by Dave Harries, an EMI technical engineer, in the temporary absence of Martin and Geoff Emerick, the Beatles' usual recording engineer. The band focused on achieving a percussion-heavy rhythm track, which included Starr's drums, and backwards-recorded hi-hat and cymbals. The latter process involved writing down the parts before Starr played them, as Harrison had done for his backwards guitar solo on \"I'm Only Sleeping\". Described by Winn as a \"cacophony of noise\", the 8 December tape also included timpani and bongos, played by McCartney and Harrison, and other percussion, which, in Harries' account, was provided by Beatles associates Mal Evans, Neil Aspinall and Terry Doran."]}, {"page": "Being for the Benefit of Mr. Kite!", "response": ["* Neil Aspinall – harmonica"]}, {"page": "With a Little Help from My Friends", "response": ["The Beatles began recording the song on 29 March 1967, the day before they posed for the Sgt. Pepper album cover. They recorded 10 takes of the song, wrapping up sessions at 5:45 in the morning. The backing track consisted of Starr on drums, McCartney playing piano, Harrison playing lead guitar and Lennon beating a cowbell. At dawn, Starr trudged up the stairs to head home – but the other Beatles cajoled him into doing his lead vocal then and there, standing around the microphone for moral support.  The following day they added tambourine, backing vocals, bass and more electric guitar. American TeenSet editor Judith Sims interviewed each Beatle separately on the 29th as they became available. Others in the studio at various times included roadies Mal Evans and Neil Aspinall, publicists Tony Barrow and Terry Doran, photographers Leslie Bryce and Frank Herrmann, and Cynthia Lennon."]}, {"page": "Badfinger", "response": ["Pending the release of \"Come and Get It\", the band and Apple agreed that the name \"The Iveys\" was too trite for the prevailing music scene, plus The Iveys were sometimes confused with \"The Ivy League\", so a name change was needed. Suggestions were put forward, including Lennon's \"The Glass Onion\", \"The Prix\", \"The Cagneys\", and \"Home\" from McCartney. Apple Corps' Neil Aspinall proposed \"Badfinger\", in reference to \"Bad Finger Boogie\", an early working title of Lennon–McCartney's \"With a Little Help from My Friends\", as Lennon had hurt his forefinger on a piano and was using only one finger. In December 1969, the band agreed on Badfinger."]}, {"page": "1942 in music", "response": ["*December 13 – Neil Aspinall, road manager for The Beatles (died 2008)"]}, {"page": "Apple Records", "response": ["Apple Records is a record label founded by the Beatles in 1968 as a division of Apple Corps Ltd. It was initially intended as a creative outlet for the Beatles, both as a group and individually, plus a selection of other artists including Mary Hopkin, James Taylor, Badfinger, and Billy Preston. In practice, the roster had become dominated by the mid-1970s with releases of the former Beatles as solo artists. Allen Klein managed the label from 1969 to 1973, then it was managed by Neil Aspinall on behalf of the Beatles and their heirs. Aspinall retired in 2007 and was replaced by Jeff Jones.", "After Klein's departure, Apple was managed by Neil Aspinall on behalf of the four Beatles and their heirs. Apple Records' distribution contract with EMI expired in 1976, when control of the Beatles' catalogue—including solo recordings to date by George Harrison, John Lennon and Ringo Starr—reverted to EMI (Paul McCartney had acquired ownership of his solo recordings when he re-signed with Capitol in 1975).", "The original UK versions of the Beatles' albums were released worldwide on compact disc in 1987 and 1988 by Parlophone. Previously, Abbey Road had been issued on CD by the EMI-Odeon label in Japan in the early 1980s. Although this was a legitimate release, it was not authorised by the Beatles, EMI or Apple Corps. Following the settlement of Apple's ten-year lawsuit against EMI in 1989, new projects began to move forward, including the Live at the BBC album and The Beatles Anthology series. It was after the Anthology project (spearheaded by Neil Aspinall) that the company resumed making significantly large profits again and began its revival.", "In 2007, longtime chief executive Neil Aspinall retired and was replaced by American music industry executive Jeff Jones.Kozinn, Allan, \"Magical Mystery Tour Ends for Apple Corps Executive\", The New York Times, 12 April 2007, passim. (link) The Beatles' catalog was remastered and re-issued in September 2009 and was made available on iTunes in November 2010. When Universal Music Group acquired EMI and the Beatles' recorded music catalogue, Calderstone Productions was formed in 2012 to administer the Beatles' catalogue."]}, {"page": "The Beatles discography", "response": ["| Michael Lindsay-HoggProducer: Neil Aspinall", "| rowspan=\"2\"| Michael Lindsay-HoggProducer: Neil Aspinall", "| rowspan=\"2\"| Michael Lindsay-Hogg , Bob Smeaton Producer: Neil Aspinall Editor: Julian Caidan"]}, {"page": "39th Annual Grammy Awards", "response": ["**Chips Chipperfield, Neil Aspinall (video producers), Bob Smeaton, Geoff Wonfor (video directors) & The Beatles for The Beatles Anthology"]}, {"page": "42nd Annual Grammy Awards", "response": ["**Chips Chipperfield & Neil Aspinall (video producers), Bob Smeaton (video director)"]}, {"page": "The Long and Winding Road", "response": ["The 1996 Beatles' outtakes compilation Anthology 3 includes the original 26 January 1969 take, without Spector's overdubs. \"The Long and Winding Road\" provided the working title for Apple executive Neil Aspinall's early version of the documentary film that became the 1995 TV series The Beatles Anthology. The title was changed in the 1990s after Harrison objected to the project being named after McCartney's song."]}, {"page": "List of documentary films", "response": ["|Let It Be||1970||Michael Lindsay-Hogg||Neil Aspinall, The Beatles"]}, {"page": "Grammy Award for Best Music Film", "response": ["| Chips Chipperfield and Neil Aspinall", "| Chips Chipperfield and Neil Aspinall"]}, {"page": "Template talk:The Beatles/Archive 2", "response": ["|| Allan Williams • Brian Epstein • Allen Klein • Lee Eastman • Neil Aspinall • Mal Evans • Apple Records"]}]}}