{"wiki_id": "http://www.wikidata.org/entity/Q3805773", "itemLabel": "Jacob Bryant", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacob_Bryant", "wikipedia_page": {"main": "Jacob Bryant (1715–1804) was an English scholar and mythographer, who has been described as \"the outstanding figure among the mythagogues who flourished in the late eighteenth and early nineteenth centuries.\"", "link_mentions": [{"page": "1780 in literature", "response": ["*Jacob Bryant – An Address to Dr. Priestley"]}, {"page": "Edmond Malone", "response": ["In 1769, the poet Thomas Chatterton, only 17 years old, sent Horace Walpole the first of a series of poems supposedly written by a 15th-century monk named Thomas Rowley but really written by Chatterton himself. Other poems followed, and Walpole was briefly taken in but later reconsidered. When Chatterton committed suicide the following year, there were rumours that Walpole's treatment of the young man had played a part. Despite Walpole's scepticism, in 1777, shortly after Edmond Malone's arrival in London, Thomas Tyrwhitt published Chatterton's forgeries as Poems, Supposed to Have Been Written at Bristol, by Thomas Rowley and Others, in the Fifteenth Century. This created a great controversy, with much debate about their authenticity. For the third edition in 1778 he added an appendix arguing against the poems' antiquity, and Thomas Warton, in his The History of English Poetry (1778), devoted an entire chapter to it. Those favouring the authenticity of the Rowley poems responded in late 1781 when, just days apart, Jacob Bryant, a classical scholar, published Observations upon the Poems of Thomas Rowley; in Which the Authenticity of Those Poems is Ascertained, and Jeremiah Milles, Dean of Exeter and President of the Society of Antiquaries of London, published Poems, Supposed to Have Been Written at Bristol, in the Fifteenth Century, by Thomas Rowley, Priest, &c.; With a Commentary in Which the Antiquity of Them Is Considered and Defended."]}, {"page": "World egg", "response": ["Following the etymological line of Jacob Bryant one might also consider with regard to the meaning of Môt, that according to the Ancient Egyptians Ma'at was the personification of the fundamental order of the universe, without which all of creation would perish. She was also considered the wife of Thoth."]}, {"page": "Sanchuniathon", "response": ["Following the etymological reasoning of Jacob Bryant in regard to the meaning of Môt, it can be noted that according to Ancient Egyptian mythology, Ma'at, wife of Thoth, is the personification of the fundamental order of the universe, without which all of creation would perish."]}, {"page": "Euhemerism", "response": ["Euhemeristic interpretations of mythology continued throughout the early modern period from the 16th century,For example in the preface to Arthur Golding's 1567 translation of Ovid's Metamorphoses into English, Golding offers a rationale for contemporary Christian readers to interpret Ovid's pagan stories. He argues: \"The true and everliving God the Paynims did not know: Which caused them the name of Gods on creatures to bestow\". to modern times. In 1711, the French historian Antoine Banier in his Mythologie et la fable expliqués par l'histoire (\"The Mythology and Fables of the Ancients, Explained\") presented strong arguments for a euhemerist interpretation of Greek mythology.The Rise of Modern Mythology, 1680–1860, Burton Feldman, Robert D. Richardson, Indiana University Press, 2000, p. 86. Jacob Bryant's A New System or Analysis of Ancient Mythology (1744) was also another key work on euhemerism of the period, but argued so from a Biblical basis. Of the early 19th century, George Stanley Faber was another Biblical euhemerist. His work The Origin of Pagan Idolatry (1816) proposed that all the pagan nations worshipped the same gods, who were all deified men. Outside of Biblical influenced literature, some archaeologists embraced euhemerist views since they discovered myths could verify archaeological findings. Heinrich Schliemann was a prominent archaeologist of the 19th century who argued myths had embedded historical truths. Schliemann was an advocate of the historical reality of places and characters mentioned in the works of Homer. He excavated Troy and claimed to have discovered artifacts associated with various figures from Greek mythology, including the Mask of Agamemnon and Priam's Treasure."]}, {"page": "Godfrey Higgins", "response": ["Higgins' main writings were part of the syncretism of the day, which was an attempt to associate Biblical narratives to evidence emerging about other religious traditions. Higgins discussed, and argued with, other authors of this tradition such as Jacob Bryant, Roger O'Connor and William Jones. Higgins' own writings, especially Anacalypsis, were later to have a major influence on the development of Theosophy, through the publications of Helena Blavatsky."]}, {"page": "Caanthus", "response": ["According to Jacob Bryant Caanthus, Cunthus and Cunæthus are all titles of a Deity called Chan-Thoth in Egypt.Bryant, pp. 448–449 n. 64"]}, {"page": "Har (Blake)", "response": ["Mary S. Hall believes that Har's name is derived from Jacob Bryant's A New System or Analysis of Antient Mythology (1776), where Bryant conflates the Amazonian deities Harmon and Ares with the Egyptian deity Harmonia, wife of Cadmus. Blake had engraved plates for the book in the early 1780s, so he would have certainly have been familiar with its content.David V. Erdman, Blake: Prophet Against Empire (Princeton: Princeton University Press, 1954; 2nd ed. 1969; 3rd ed. 1977) 133n41"]}, {"page": "Bryant (surname)", "response": ["* Jacob Bryant, (1715–1804), British scholar and mythographer"]}, {"page": "Tiriel (poem)", "response": ["* Har – Mary S. Hall believes that Har's name was derived from Jacob Bryant's A New System or Analysis of Antient Mythology (1776), where Bryant conflates the Amazonian deities Harmon and Ares with the Egyptian deity Harmonia, wife of Cadmus. Blake had engraved plates for the book in the early 1780s, so he would have certainly have been familiar with its content.Erdman (1977: 133n41) As a character, S. Foster Damon believes that Har represents both the \"decadent poetry of Blake's day\"Damon (1988: 174) and the traditional spirit of Christianity. Northrop Frye reaches a similar conclusion, but also sees divergence in the character, arguing that although Har and Heva are based on Adam and Eve, \"Har is distinguished from Adam. Adam is ordinary man in his mixed twofold nature of imagination and Selfhood. Har is the human Selfhood which, though men spend most of their time trying to express it, never achieves reality and is identified only as death. Har, unlike Adam, never outgrows his garden but remains there shut up from the world in a permanent state of near-existence.\" Bloom agrees with this interpretation, arguing that \"Har is natural man, the isolated selfhood.\" Bloom also believes that Har is comparable to Struldbruggs from Jonathan Swift's Gulliver's Travels (1726) and Tithonus from Alfred, Lord Tennyson's poem of the same name (1859). In another sense, Frye suggests that \"Har represents the unborn theory of negative innocence established by obeying a moral law.\" On the other hand, Anne Kostelanetz Mellor sees Har as representing simple innocence and the Vales of Har as representative of Eden.Mellor (1974: 30) 'Har' is the Hebrew word for 'mountain', thus giving an inherent irony to the phrase \"Vales of Har\". Damon believes this conveys the ironic sense that \"he who was a mountain now lives in a vale, cut off from mankind."]}, {"page": "William Vincent (priest)", "response": ["Gleanings from the Asiatick Researches of the learned Dr. Vincent, was privately printed in 1813 by Joseph Thomas Brown. Vincent also contributed notes to Gibbon's Inquiry into the Circumnavigation of Africa, and to the Classical Journal articles on Ancient Commerce, China as known to Classic Authors, The Geography of Susiana, and Theophilus an African Bishop. For the first series of the British Critic, conducted by his friend Nares, he wrote several important reviews, and, in connection with the Troad controversy, attacked the views of Jacob Bryant, whom he charged with falsifying passages in Diodorus Siculus. Vincent was also a frequent contributor to The Gentleman's Magazine."]}, {"page": "William Holwell", "response": ["* A Mythological, Etymological, and Historical Dictionary, extracted from the Analysis of Ancient Mythology (with Jacob Bryant), 1793."]}, {"page": "George Hardinge", "response": ["Hardinge was 'the waggish Welsh judge, Jefferies Hardsman' of Lord Byron's Don Juan (xiii. stanza 88). It is stated that he collected more than £10,000 for charitable objects. He was vice-president and an early promoter of the Philanthropic Society. He was a fellow of the Society of Antiquaries (elected November 1769) and of the Royal Society (elected April 1788). Among his correspondents were Jacob Bryant, Horace Walpole and Anna Seward; Seward's letters to him are in her Letters (1811), vols. i. and ii."]}, {"page": "King's Library", "response": ["There do not seem to have been any further large purchases before 1766, perhaps because the library's staff were occupied with organising the books acquired from Smith. However, from 1766 onwards the king began to develop the collection significantly, spending an average of perhaps £1,500 per year on books for the rest of his reign.  A particularly important period  was 1768–1771, when Frederick Augusta Barnard, one of the library staff, travelled extensively in Europe on the king's behalf, and made major purchases. Important acquisitions later came from the libraries of James West, Anthony Askew, Richard Farmer and Grimur Jonsson Thorkelin as each of these came on the market.  Significant donations to the library included 27 incunabula given by Jacob Bryant in 1782. The acquisition of further titles continued in the last years of the king's reign, when due to his mental illness his affairs were managed by trustees."]}, {"page": "All Religions are One", "response": ["Harold Bloom also cites the work of Anthony Collins, Matthew Tindal and John Toland as having an influence on Blake's thoughts.Harold Bloom, Blake's Apocalypse (Garden City: Doubleday, 1963), 25 In a more general sense, \"Blake sees the school of Bacon and Locke as the foundation of natural religion, the deistic attempt to prove the existence of God on the basis of sensate experience and its rational investigation.\"Eaves et al. (1993: 27) To that end, Blake \"manipulates the syncretic mythology of Jacob Bryant, Paul Henri Mallet, and perhaps other founders of what has become the comparative study of religion, to argue for the existence of a universal and supra-rational 'Poetic Genius' that expresses itself through the shared (though ever various) forms of all religions.\""]}, {"page": "There is No Natural Religion", "response": ["Harold Bloom also cites the work of Anthony Collins, Matthew Tindal and John Toland as having an influence on Blake's thoughts.Harold Bloom, Blake's Apocalypse (Garden City: Doubleday,  1963), 25 In a more general sense, \"Blake sees the school of Bacon and Locke as the foundation of natural religion, the deistic attempt to prove the existence of God on the basis of sensate experience and its rational investigation.\"Eaves et al. (1993: 27) To that end, Blake \"manipulates the syncretic mythology of Jacob Bryant, Paul Henri Mallet, and perhaps other founders of what has become the comparative study of religion, to argue for the existence of a universal and supra-rational 'Poetic Genius' that expresses itself through the shared (though ever various) forms of all religions.\""]}, {"page": "Thomas Falconer (scholar)", "response": ["*Remarks on some Passages in Mr. Bryant's Publications respecting the War of Troy, London, 1799. Against Jacob Bryant."]}, {"page": "Elizabeth Germain", "response": ["Horace Walpole paid a visit to Drayton in 1763, and found the house \"covered with portraits, crammed with old china\". Many of her curiosities were sold after her death, by auction. The cameos and intaglios collected by Thomas Howard, 21st Earl of Arundel, were bequeathed to Germain by his first wife. Lady Betty offered the collection to the British Museum for £10,000, and, as the offer was declined, gave them in 1762 to her great-niece, Lady Mary Beauclerk, who married Lord Charles Spencer, son of the 3rd Duke of Marlborough. These gems were described in two folio volumes entitled Gemmarum antiquarum delectus quse in dactyliothecis Ducis Marlburiensis conservantur, 1781–90; the engravings were chiefly by Bartolozzi, and the Latin text by Jacob Bryant and William Cole (1753–1806). The gems were part of the Marlborough collection sold in 1875 for £36,750."]}, {"page": "Samuel Roffey Maitland", "response": ["In 1817 Maitland published his first pamphlet, A Dissertation on the Primary Objects of Idolatrous Worship, unfashionably against Jacob Bryant's writings. During his absence abroad he published A Letter to the Rev. Charles Simeon, in which he advocated the establishment of an institution which might serve as a place of refuge for Jewish converts."]}, {"page": "Creirwy", "response": ["Celtic researcher Edward Davies deemed Creirwy \"the Proserpine of the British Druids\"—also comparing her mother Ceridwen to Ceres of Roman myth.The Mythology and Rites of the British Druids, page 205 Mythographer Jacob Bryant theorized that Creirwy and Ceridwen were essentially \"the same mystical personage.\""]}, {"page": "William Barford", "response": ["Dr. Jacob Bryant, in the preface to the third volume of his New System of Mythology, pays a high tribute to Barford's talents and erudition, thanking him for his 'zeal,’ his 'assistance,’ and his 'judicious remarks.' In the life of Bryant, prefixed to the six-volume edition of the New System, Barford is put first in the list of his friends."]}, {"page": "John Chapman (theologian)", "response": ["The son of the Rev. Walter Chapman, curate of Wareham, Dorset, then rector of Strathfieldsay, Hampshire, he was probably born in 1704, probably at Strathfieldsay. He was educated at Eton College, and elected to King's College, Cambridge, where he became A.B. 1727, and A. M. 1731. While tutor of his college, Charles Pratt, Jacob Bryant, and, for a short time, Horace Walpole were amongst his pupils. "]}, {"page": "David Doig", "response": ["Doig's next publication was Extracts from a Poem on the Prospect from Stirling Castle (Stirling, 1796). He contributed to vol. iii. of the Transactions of the Royal Society of Edinburgh a dissertation \"On the Ancient Hellenes\". He also wrote in the Encyclopædia Britannica third edition the articles on \"Mythology\", \"Mysteries\", and \"Philology\". They brought Doig correspondence with William Vincent and Jacob Bryant."]}, {"page": "Nashville discography", "response": ["| rowspan=\"2\"| Jacob Bryant, Jon Davidson, and Derrick Southerland", "| scope=\"row\" | Sarah Buxton, John Davidson & Jacob Bryant"]}, {"page": "John Bacon Sawrey Morritt", "response": ["When Jacob Bryant argued that no such city as Troy had existed, Morritt's local knowledge of Turkey led him publish A Vindication of Homer and of the Ancient Poets and Historians who have recorded the Siege and Fall of Troy (1798). This produced from Bryant Some Observations in 1799, and when William Vincent reviewed Morritt's work in the British Critic early in 1799, and issued the criticisms in a separate form, Bryant rushed into print with Expostulation addressed to the \"British Critic\" (1799). Morritt retaliated with Additional Remarks on the Topography of Troy, in answer to Mr. Bryant's last Publications (1800). An account of his expedition to Troy was given by Dallaway in Constantinople, with Excursions to the Shores and Islands of the Archipelago, and to the Troad (1797), and his opinions were supported in Remarks and Observations on the Plain of Troy, made during an Excursion in June 1799, by William Francklin."]}, {"page": "Richard Neville Aldworth Neville", "response": ["The only son of Richard Aldworth of Stanlake, by Catherine, daughter of Richard Neville of Billingbear House, he was born on 3 September 1717; through his mother he was descended from Sir Henry Neville. He was educated at Eton College, where he was on good terms with Lord Sandwich, Lord Rochford, Lord Orford, Owen Cambridge, and Jacob Bryant. On 12 July 1736 he matriculated at Merton College, Oxford."]}]}}