{"wiki_id": "http://www.wikidata.org/entity/Q380235", "itemLabel": "Hermann Bondi", "itemDescription": "Austrian-British mathematician and cosmologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Hermann_Bondi", "wikipedia_page": {"main": "Sir Hermann Bondi  (1 November 1919 – 10 September 2005) was an Austrian-British mathematician and cosmologist.\nHe is best known for developing the steady state model of the universe with Fred Hoyle and Thomas Gold as an alternative to the Big Bang theory. He contributed to the theory of general relativity, and was the first to analyze the inertial and gravitational interaction of negative mass and the first to explicate correctly the nature of gravitational waves.  In his 1990 autobiography, Bondi regarded the 1962 work on gravitational waves as his \"best scientific work\".: 79 ", "link_mentions": [{"page": "Copernican principle", "response": ["Hermann Bondi named the principle after Copernicus in the mid-20th century, although the principle itself dates back to the 16th-17th century paradigm shift away from the Ptolemaic system, which placed Earth at the center of the universe. Copernicus proposed that the motion of the planets could be explained by reference to an assumption that the Sun is centrally located and stationary in contrast to the  then currently upheld belief that the Earth was central. He argued that the apparent retrograde motion of the planets is an illusion caused by Earth's movement around the Sun, which the Copernican model placed at the centre of the universe. Copernicus himself was mainly motivated by technical dissatisfaction with the earlier system and not by support for any mediocrity principle. In fact, although the Copernican heliocentric model is often described as \"demoting\" Earth from its central role it had in the Ptolemaic geocentric model, it was successors to Copernicus, notably the 16th century Giordano Bruno, who adopted this new perspective. The Earth's central position had been interpreted as being in the \"lowest and filthiest parts\". Instead, as Galileo said, the Earth is part of the \"dance of the stars\" rather than the \"sump where the universe's filth and ephemera collect\".  In the late 20th Century, Carl Sagan asked, \"Who are we? We find that we live on an insignificant planet of a humdrum star lost in a galaxy tucked away in some forgotten corner of a universe in which there are far more galaxies than people.\"Sagan C, Cosmos (1980) p.193"]}, {"page": "Fred Hoyle", "response": ["In late 1940, Hoyle left Cambridge to go to Portsmouth to work for the Admiralty on radar research, for example devising a method to get the altitude of the incoming aeroplanes. He was also put in charge of countermeasures against the radar guided guns found on the Graf Spee.Simon Mitton, Fred Hoyle, a Life in Science, Cambridge University Press (2011). Britain's radar project employed more personnel than the Manhattan project, and was probably the inspiration for the large British project in The Black Cloud. Two colleagues in this war work were Hermann Bondi and Thomas Gold, and the three had many and deep discussions on cosmology. The radar work paid for a couple of trips to North America, where he took the opportunity to visit astronomers. On one trip to the US, he learned about supernovae at Caltech and Mount Palomar and, in Canada, the nuclear physics of plutonium implosion and explosion, noticed some similarity between the two and started thinking about supernova nucleosynthesis. He had an intuition at the time \"I will make a name for myself if this works out.\" Eventually (1954) his prescient and ground breaking paper came out. He also formed a group at Cambridge exploring stellar nucleosynthesis in ordinary stars and was bothered by the paucity of stellar carbon production in existing models. He noticed that one of the existing processes would be made a billion times more productive if the carbon-12 nucleus had a resonance at 7.7 MeV, but the nuclear physicists did not list such a one. On another trip, he visited the nuclear physics group at Caltech, spending a few months of sabbatical there and persuaded them against their considerable scepticism to look for and find the Hoyle state in carbon-12, from which developed a full theory of stellar nucleosynthesis, co-authored by Hoyle with some members of the Caltech group.Jane Gregory, Fred Hoyle's Universe, World Scientific Pub, 2003", "While having no argument with the Lemaître theory (later confirmed by Edwin Hubble's observations) that the universe was expanding, Hoyle disagreed on its interpretation. He found the idea that the universe had a beginning to be pseudoscience, resembling arguments for a creator, \"for it's an irrational process, and can't be described in scientific terms\" (see Kalam cosmological argument).Quentin Smith, A Big Bang Cosmological Argument For God's Nonexistence. Faith and Philosophy. April 1992. Volume 9, No. 2, pp. 217–237 Instead, Hoyle, along with Thomas Gold and Hermann Bondi (with whom he had worked on radar in the Second World War), in 1948 began to argue for the universe as being in a \"steady state\" and formulated their Steady State theory.  The theory tried to explain how the universe could be eternal and essentially unchanging while still having the galaxies we observe moving away from each other. The theory hinged on the creation of matter between galaxies over time, so that even though galaxies get further apart, new ones that develop between them fill the space they leave. The resulting universe is in a \"steady state\" in the same manner that a flowing river is—the individual water molecules are moving away but the overall river remains the same."]}, {"page": "General relativity", "response": ["In 1962 Hermann Bondi, M. G. van der Burg, A. W. Metzner and Rainer K. Sachs addressed this asymptotic symmetry problem in order to investigate the flow of energy at infinity due to propagating gravitational waves. Their first step was to decide on some physically sensible boundary conditions to place on the gravitational field at light-like infinity to characterize what it means to say a metric is asymptotically flat, making no a priori assumptions about the nature of the asymptotic symmetry group — not even the assumption that such a group exists. Then after designing what they considered to be the most sensible boundary conditions, they investigated the nature of the resulting asymptotic symmetry transformations that leave invariant the form of the boundary conditions appropriate for asymptotically flat gravitational fields. What they found was that the asymptotic symmetry transformations actually do form a group and the structure of this group does not depend on the particular gravitational field that happens to be present. This means that, as expected, one can separate the kinematics of spacetime from the dynamics of the gravitational field at least at spatial infinity. The puzzling surprise in 1962 was their discovery of a rich infinite-dimensional group (the so-called BMS group) as the asymptotic symmetry group, instead of the finite-dimensional Poincaré group, which is a subgroup of the BMS group. Not only are the Lorentz transformations asymptotic symmetry transformations, there are also additional transformations that are not Lorentz transformations but are asymptotic symmetry transformations. In fact, they found an additional infinity of transformation generators known as supertranslations. This implies the conclusion that General Relativity (GR) does not reduce to special relativity in the case of weak fields at long distances. It turns out that the BMS symmetry, suitably modified, could be seen as a restatement of the universal soft graviton theorem in quantum field theory (QFT), which relates universal infrared (soft) QFT with GR asymptotic spacetime symmetries."]}, {"page": "November 1", "response": ["*1919 – Hermann Bondi, English-Austrian mathematician and cosmologist (d. 2005)"]}, {"page": "September 10", "response": ["*2005 – Hermann Bondi, Austrian mathematician and cosmologist (b. 1919)"]}, {"page": "Spacetime", "response": ["In 1962 Hermann Bondi, M. G. van der Burg, A. W. Metzner and Rainer K. Sachs addressed this asymptotic symmetry problem in order to investigate the flow of energy at infinity due to propagating gravitational waves.  Their first step was to decide on some physically sensible boundary conditions to place on the gravitational field at light-like infinity to characterize what it means to say a metric is asymptotically flat, making no a priori assumptions about the nature of the asymptotic symmetry group — not even the assumption that such a group exists.  Then after designing what they considered to be the most sensible boundary conditions, they investigated the nature of the resulting asymptotic symmetry transformations that leave invariant the form of the boundary conditions appropriate for asymptotically flat gravitational fields. What they found was that the asymptotic symmetry transformations actually do form a group and the structure of this group does not depend on the particular gravitational field that happens to be present. This means that, as expected, one can separate the kinematics of spacetime from the dynamics of the gravitational field at least at spatial infinity. The puzzling surprise in 1962 was their discovery of a rich infinite-dimensional group (the so-called BMS group) as the asymptotic symmetry group, instead of the finite-dimensional Poincaré group, which is a subgroup of the BMS group. Not only are the Lorentz transformations asymptotic symmetry transformations, there are also additional transformations that are not Lorentz transformations but are asymptotic symmetry transformations. In fact, they found an additional infinity of transformation generators known as supertranslations. This implies the conclusion that General Relativity (GR) does not reduce to special relativity in the case of weak fields at long distances."]}, {"page": "Theory of relativity", "response": ["In 1962, Hermann Bondi, M. G. van der Burg, A. W. Metzner and Rainer K. Sachs addressed this asymptotic symmetry problem in order to investigate the flow of energy at infinity due to propagating gravitational waves. Their first step was to decide on some physically sensible boundary conditions to place on the gravitational field at light-like infinity to characterize what it means to say a metric is asymptotically flat, making no a priori assumptions about the nature of the asymptotic symmetry group — not even the assumption that such a group exists. Then after designing what they considered to be the most sensible boundary conditions, they investigated the nature of the resulting asymptotic symmetry transformations that leave invariant the form of the boundary conditions appropriate for asymptotically flat gravitational fields. What they found was that the asymptotic symmetry transformations actually do form a group and the structure of this group does not depend on the particular gravitational field that happens to be present. This means that, as expected, one can separate the kinematics of spacetime from the dynamics of the gravitational field at least at spatial infinity. The puzzling surprise in 1962 was their discovery of a rich infinite-dimensional group (the so-called BMS group) as the asymptotic symmetry group, instead of the finite-dimensional Poincaré group, which is a subgroup of the BMS group. Not only are the Lorentz transformations asymptotic symmetry transformations, there are also additional transformations that are not Lorentz transformations but are asymptotic symmetry transformations. In fact, they found an additional infinity of transformation generators known as supertranslations. This implies the conclusion that General Relativity does not reduce to special relativity in the case of weak fields at long distances."]}, {"page": "Twin paradox", "response": ["Other calculations have been done for the traveling twin (or for any observer who sometimes accelerates), which do not involve the equivalence principle, and which do not involve any gravitational fields. Such calculations are based only on the special theory, not the general theory, of relativity. One approach calculates surfaces of simultaneity by considering light pulses, in accordance with Hermann Bondi's idea of the k-calculus. A second approach calculates a straightforward but technically complicated integral to determine how the traveling twin measures the elapsed time on the stay-at-home clock. An outline of this second approach is given in a separate section below."]}, {"page": "1919", "response": ["** Hermann Bondi, British-Austrian mathematician and cosmologist (d. 2005) "]}, {"page": "2005", "response": ["* September 13 – Hermann Bondi, Austrian mathematician and cosmologist (b. 1919)"]}, {"page": "Timeline of gravitational physics and relativity", "response": ["* 1962 – Hermann Bondi introduces Bondi mass,", "* 1962 - Hermann Bondi, M. G. van der Burg, A. W. Metzner, and Rainer K. Sachs introduce the asymptotic symmetry group of asymptotically flat, Lorentzian spacetimes at null (i.e., light-like) infinity."]}, {"page": "Timeline of cosmological theories", "response": ["* 1948 – Hermann Bondi, Thomas Gold, and Fred Hoyle propose steady state cosmologies based on the perfect cosmological principle"]}, {"page": "A Brief History of Time", "response": ["This concept of the beginning of time (proposed by the Belgian Catholic priest Georges Lemaître) seemed originally to be motivated by religious beliefs, because of its support of the biblical claim of the universe having a beginning in time instead of being eternal.As Stephen Hawking puts it in his book: \"Many people do not like the idea that time has a beginning, probably because it smacks of divine intervention. (The Catholic Church, on the other hand, seized on the big bang model and in 1951 officially pronounced it to be in accordance with the Bible.)\" So a new theory was introduced, the \"steady state theory\" by Hermann Bondi, Thomas Gold, and Fred Hoyle, to compete with the Big Bang theory. Its predictions also matched with the current Universe structure. But the fact that radio wave sources near us are far fewer than from the distant Universe, and there were numerous more radio sources than at present, resulted in the failure of this theory and universal acceptance of the Big Bang Theory. Evgeny Lifshitz and Isaak Markovich Khalatnikov also tried to find an alternative to the Big Bang theory but also failed. "]}, {"page": "Hermann (name)", "response": ["*Hermann Bondi (1919–2005), Anglo–Austrian mathematician and cosmologist"]}, {"page": "Thames Barrier", "response": ["In 1966 Sir Hermann Bondi was asked to take an independent view of the situation. He considered the estimated construction costs and the probability of a flood and of damage if the barrier was not built. He strongly recommended that a barrier should be built in order to avoid the catastrophe of flooding central London, and a site was agreed at Woolwich."]}, {"page": "Thomas Gold", "response": ["Gold was born on May 22, 1920, in Vienna, Austria, to Max Gold, a wealthy Jewish industrialist (pre-war) who ran one of Austria's largest mining and metal fabrication companies, and German former actress Josefine Martin. Following the economic downfall of the European mining industry in the late 1920s, Max Gold moved his family to Berlin, where he had taken a job as director of a metal trading company.. Following the start of Nazi leader Adolf Hitler's anti-Jewish campaigns  in 1933, Gold and his family left Germany because of his father's heritage. The family travelled through Europe for the next few years. Gold attended boarding school at the Lyceum Alpinum Zuoz in Zuoz, Switzerland, where he quickly proved to be a clever, competitive and physically and mentally aggressive individual.. Gold finished his schooling at Zuoz in 1938, and fled with his family to England after the German invasion of Austria in early 1938. Gold entered Trinity College, Cambridge in 1939 and began studying mechanical sciences.. In May 1940, just as Hitler was commencing his advance in Belgium and France, Gold was sent into internment as an enemy alien by the British government. It was on the first night of internment, at an army barracks in Bury St Edmunds, that he met his future collaborator and close friend, Hermann Bondi...", "Throughout his academic career, Gold received a number of honors and distinctions. He was a Fellow of the Royal Astronomical Society (1948), the Royal Society (1964), the American Geophysical Union (1962), the American Academy of Arts and Sciences (1974), and the American Astronautical Society, a member of the American Philosophical Society (1972), the United States National Academy of Sciences (1974) and the International Academy of Astronautics, and an Honorary Fellow of Trinity College, Cambridge (1986). In addition, he served as President of the New York Astronomical Society from 1981 to 1986. Gold won the John Frederick Lewis Prize from the American Philosophical Society in 1972 for his paper \"The Nature of the Lunar Surface: Recent Evidence\". and the Humboldt Prize from the Alexander von Humboldt Foundation in 1979.. In 1985, Gold won the prestigious Gold Medal of the Royal Astronomical Society, an award whose recipients include Fred Hoyle, Hermann Bondi, Martin Ryle, Edwin Hubble, James Van Allen, Fritz Zwicky, Hannes Alfvén and Albert Einstein.. Gold did not earn a doctorate, but received an honorary Doctor of Science degree from Cambridge University in 1969..", "In the journal Nature, Hermann Bondi wrote \"Tommy Gold will long be remembered as a singular scientist who stepped into any field where he thought an option was being overlooked. He was also unusual in working mainly theoretically, but using little mathematics, relying instead on his profound intuitive understanding of physics.\" Stanley F. Dermott wrote \"Tommy was a handsome, charming and generous man and a loyal colleague who formed many long-lasting friendships. A witty and articulate speaker, he was regarded by some as a scientific maverick who delighted in controversy. In reality, he was an iconoclast whose strength was in penetrating analysis of the assumptions on which some of our most important theories are based.\"."]}, {"page": "Churchill College, Cambridge", "response": ["| Sir Hermann Bondi"]}, {"page": "James Chadwick", "response": ["In a recent book about the Bomb project, Graham Farmelo wrote that \"Chadwick did more than any other scientist to give Churchill the Bomb. ... Chadwick was tested almost to the breaking point.\" So worried that he could not sleep, Chadwick resorted to sleeping pills, which he continued to take for most of his remaining years. Chadwick later said that he realised that \"a nuclear bomb was not only possible—it was inevitable. Sooner or later these ideas could not be peculiar to us. Everybody would think about them before long, and some country would put them into action\". Sir Hermann Bondi suggested that it was fortunate that Chadwick, not Rutherford, was the doyen of UK physics at the time, as the latter's prestige might otherwise have overpowered Chadwick's interest in \"looking forward\" to the Bomb's prospects."]}, {"page": "Mach's principle", "response": ["Hermann Bondi and Joseph Samuel have listed eleven distinct statements that can be called Mach principles, labelled Mach0 through Mach10.  A useful review explaining the multiplicity of \"Mach principles\", which have been invoked in the research literature (and elsewhere).  Though their list is not necessarily exhaustive, it does give a flavor for the variety possible."]}, {"page": "Non-standard cosmology", "response": ["The Steady State theory extends the homogeneity assumption of the cosmological principle to reflect a homogeneity in time as well as in space. This \"perfect cosmological principle\" as it would come to be called asserted that the universe looks the same everywhere (on the large scale), the same as it always has and always will. This is in contrast to Lambda-CDM, in which the universe looked very different in the past and will look very different in the future. Steady State theory was proposed in 1948 by Fred Hoyle, Thomas Gold, Hermann Bondi and others. In order to maintain the perfect cosmological principle in an expanding universe, steady state cosmology had to posit a \"matter-creation field\" (the so-called C-field) that would insert matter into the universe in order to maintain a constant density."]}, {"page": "Negative mass", "response": ["In 1957, following Luttinger's idea, Hermann Bondi suggested in a paper in Reviews of Modern Physics that mass might be negative as well as positive. He pointed out that this does not entail a logical contradiction, as long as all three forms of mass are negative, but that the assumption of negative mass involves some counter-intuitive form of motion. For example, an object with negative inertial mass would be expected to accelerate in the opposite direction to that in which it was pushed (non-gravitationally).", "Although no particles are known to have negative mass, physicists (primarily Hermann Bondi in 1957, William B. Bonnor in 1964 and 1989, then Robert L. Forward) have been able to describe some of the anticipated properties such particles may have. Assuming that all three concepts of mass are equivalent according to the equivalence principle, the gravitational interactions between masses of arbitrary sign can be explored, based on the Newtonian approximation of the Einstein field equations. The interaction laws are then:thumb|200px|right|In yellow, the \"preposterous\" runaway motion of positive and negative masses described by Bondi and Bonnor."]}]}}