{"wiki_id": "http://www.wikidata.org/entity/Q3807966", "itemLabel": "Jeremy Stacey", "itemDescription": "British drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Stacey", "wikipedia_page": {"main": "Jeremy Stacey (born 27 September 1963) is a British drummer and keyboard player. His early works included the 1990s band The Lemon Trees (with twin brother Paul Stacey on guitars, Guy Chambers and others) and Denzil. He has also played with Sheryl Crow, the Finn Brothers, Nick Harper, Noel Gallagher, The Waterboys, Thomas Anders, Echo & the Bunnymen, Eurythmics, Joe Cocker, Chris Robinson of the Black Crowes, Adam F, Andrea Bocelli, Patricia Kaas, Susanna Hoffs, Mike Scott, Robbie Williams, Aztec Camera, Charlotte Gainsbourg, Nerina Pallot, Claire Martin (drums on Take 1My Heart, 1999), Mark Wingfield, Iain Ballamy, Chris Squire (Chris Squire's Swiss Choir), The Syn (Syndestructible, 2005, again with Paul Stacey), Sia Furler (Colour the Small One), Laurence Cottle, Jason Rebello, Zero 7, Malcolm McLaren, Boris Grebenshchikov, and Steve Hackett.\nIn 2011 he recorded with Ryan Adams on Ashes & Fire, and again on Ryan Adams in 2014.\nHe was part of Noel Gallagher's High Flying Birds.He played on the Squackett album (with Chris Squire & Steve Hackett).\nOn 7 March 2016 it was announced that he would be taking the place of Bill Rieflin as the centre of three drummers on the 2016 King Crimson European tour. He retained this position after Rieflin's return to the band exclusively on keyboards.He also played on Steven Wilson's album To the Bone.  \nHe uses Tama drums, Remo drumheads and Istanbul Agop cymbals. He formerly used Zildjian cymbals.", "link_mentions": [{"page": "King Crimson", "response": ["Tours across Europe, Canada, and Japan followed in the later half of 2015. A live recording from the Canadian leg of the tour was released as Live In Toronto. A European tour was planned for 2016. Following Rieflin's decision to take a break from music, drummer Jeremy Stacey of Noel Gallagher's High Flying Birds was called in place for dates from September.", "On 3 January 2017, Bill Rieflin returned to King Crimson. Since the band wished to retain Jeremy Stacey, Fripp called the new lineup the \"Double Quartet Formation\", referencing four drummers. Consequently, King Crimson became an octet. Later on, Rieflin shifted his group role and became King Crimson's first full-time keyboard player, Fripp rechristened the lineup the \"Three Over Five\" (or \"Five Over Three\") Formation.", "*Jeremy Stacey – drums, keyboards "]}, {"page": "Robert Fripp", "response": ["In his online diary entry for 6 September 2013, Fripp announced the return of King Crimson as a seven-piece unit with \"four Englishmen and three Americans\". The new lineup was Fripp, Levin, both Mastelotto and Harrison on drums, returning 1970s band member Mel Collins and two new members: Jakko Jakszyk as singer and second guitarist, and Bill Rieflin as a third drummer. This version of the band went on tour in 2014 and 2015 with a setlist reworking and reconfiguring the band's 1960s and 1970s material (plus songs from A Scarcity of Miracles and new compositions). In early 2016, it was announced that former Lemon Trees/Beady Eye drummer Jeremy Stacey would substitute for Rieflin on that year's tour while the latter was on sabbatical. King Crimson has since continued touring as a seven- or eight-piece unit with Stacey as a permanent member on drums and keyboards, plus Rieflin (when available) on keyboards and \"fairy dusting.\" Rieflin last played with Crimson on the 2018 tours; he died 24 March 2020."]}, {"page": "Chris Robinson (singer)", "response": ["* Jeremy Stacey – drums, percussion (2002–04)"]}, {"page": "Echo & the Bunnymen", "response": ["* Jeremy Stacey – drums (1999–2001)"]}, {"page": "Noel Gallagher", "response": ["Noel Gallagher's High Flying Birds released a self-titled album on 17 October 2011; a collaboration album with Amorphous Androgynous was to be released in 2012 but has now been shelved indefinitely. He began touring in Dublin on 23 October 2011. The touring band announced for Noel Gallagher's High Flying Birds comprised David McDonnell (guitar), Russell Pritchard (bass), Mikey Rowe (keyboards) and Jeremy Stacey (drums); McDonnell left during rehearsals and was replaced before the tour with Tim Smith who had played with Rowe and Stacey previously. On 20 July 2011, Gallagher released a 47-second trailer of his first single \"The Death of You and Me\". The video for the debut single was released on 25 July at 8:21 am (GMT)."]}, {"page": "Chris Squire", "response": ["Squire also worked on two solo projects with other former Syn collaborators Gerard Johnson, Jeremy Stacey and Paul Stacey. A Christmas album, Chris Squire's Swiss Choir, was released in 2007 (with Johnson, J. Stacey and Steve Hackett). Squire collaborated again with Hackett, formerly of the band Genesis, to make the Squackett album A Life Within a Day, released in 2012."]}, {"page": "Bill Rieflin", "response": ["In an online diary entry dated September 6, 2013, Robert Fripp announced a new lineup for King Crimson that included Rieflin as one of the band's three drummers. A few days after the first full-length live release of the band with Rieflin on board (Live in Toronto 2015), Fripp announced Rieflin's decision to take a sabbatical from the band, effective March 6, 2016, \"a decision supported by all the Crimson Brothers.\"  In early 2017, Fripp announced that Rieflin would be returning alongside his replacement, Jeremy Stacey.  Due to Fripp's desire to stave off complacency after several years of touring, Rieflin \"will be focusing on mellotron, keys and fairy dusting, rather than using drums as a main instrument\" in the new Double Quartet configuration, thus becoming the band's first full-time keyboardist ever. For the US Autumn 2017 tour dates in October–November, he was replaced on keyboards by the Seattle-based guitarist Chris Gibson. He rejoined in 2018 before taking another indefinite sabbatical in 2019, he was replaced on keyboards by Soft Machine's sax player Theo Travis. In 2020, Fripp made the decision to not replace Rieflin, thus reverting King Crimson to a seven-member band."]}, {"page": "Steven Wilson", "response": ["On 12 December 2016, Wilson began recording his fifth solo studio album with engineer Paul Stacey in London. With the departure of most of the members of his solo band from prior album, Wilson handled most of the guitar on the album, with Craig Blundell and Jeremy Stacey both contributing drums. Ninet Tayeb was featured on additional vocals and had a bigger role than she did on Hand. Cannot. Erase. Andy Partridge of XTC revealed that he co-wrote two songs for the album. On 5January 2017, Wilson posted a teaser clip of himself and Ninet Tayeb recording a new song titled \"Pariah\". In April 2017, Wilson announced that he had switched record labels for the release, with the album to be released on Caroline International. Wilson also mentioned that harmonica player Mark Feltham is going to be playing on the next record and released a clip of him contributing to a song titled \"To the Bone\". Slovak musician David Kollar featured on three songs of the new record."]}]}}