{"wiki_id": "http://www.wikidata.org/entity/Q3809556", "itemLabel": "John Popham", "itemDescription": "politician, jurist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Popham_(judge)", "wikipedia_page": {"main": "Sir John Popham (1531 – 10 June 1607) of Wellington, Somerset, was Speaker of the House of Commons (1580 to 1583), Attorney General (1581 to 1592) and Lord Chief Justice of England (1592 to 1607).\n\n", "link_mentions": [{"page": "Guy Fawkes", "response": ["The jury found all the defendants guilty, and the Lord Chief Justice Sir John Popham pronounced them guilty of high treason. The Attorney General Sir Edward Coke told the court that each of the condemned would be drawn backwards to his death, by a horse, his head near the ground. They were to be \"put to death halfway between heaven and earth as unworthy of both\". Their genitals would be cut off and burnt before their eyes, and their bowels and hearts removed. They would then be decapitated, and the dismembered parts of their bodies displayed so that they might become \"prey for the fowls of the air\". Fawkes's and Tresham's testimony regarding the Spanish treason was read aloud, as well as confessions related specifically to the Gunpowder Plot. The last piece of evidence offered was a conversation between Fawkes and Wintour, who had been kept in adjacent cells. The two men apparently thought they had been speaking in private, but their conversation was intercepted by a government spy. When the prisoners were allowed to speak, Fawkes explained his not guilty plea as ignorance of certain aspects of the indictment."]}, {"page": "Gunpowder Plot", "response": ["On 6 November, the Lord Chief Justice, Sir John Popham (a man with a deep-seated hatred of Catholics) questioned Rookwood's servants.  By the evening he had learned the names of several of those involved in the conspiracy: Catesby, Rookwood, Keyes, Wynter , John and Christopher Wright, and Grant.  \"Johnson\" meanwhile persisted with his story, and along with the gunpowder he was found with, was moved to the Tower of London, where the King had decided that \"Johnson\" would be tortured.  The use of torture was forbidden, except by royal prerogative or a body such as the Privy Council or Star Chamber.  In a letter of 6 November James wrote: \"The gentler tortours [tortures] are to be first used unto him, et sic per gradus ad ima tenditur [and thus by steps extended to the bottom depths], and so God speed your good work.\"  \"Johnson\" may have been placed in manacles and hung from the wall, but he was almost certainly subjected to the horrors of the rack.  On 7 November his resolve was broken; he confessed late that day, and again over the following two days.", "By coincidence, on the same day that Garnet was found, the surviving conspirators were arraigned in Westminster Hall.  Seven of the prisoners were taken from the Tower to the Star Chamber by barge.  Bates, who was considered lower class, was brought from the Gatehouse Prison.  Some of the prisoners were reportedly despondent, but others were nonchalant, even smoking tobacco.  The King and his family, hidden from view, were among the many who watched the trial.  The Lords Commissioners present were the Earls of Suffolk, Worcester, Northampton, Devonshire, and Salisbury. Sir John Popham was Lord Chief Justice, Sir Thomas Fleming was Lord Chief Baron of the Exchequer, and two Justices, Sir Thomas Walmsley and Sir Peter Warburton, sat as Justices of the Common Pleas.  The list of traitors' names was read aloud, beginning with those of the priests: Garnet, Tesimond, and Gerard."]}, {"page": "June 10", "response": ["*1607 – John Popham, English politician, Attorney General for England and Wales (b. 1531)"]}, {"page": "1531", "response": ["** John Popham, Lord Chief Justice of England (d. 1607)"]}, {"page": "1607", "response": ["* June 10 – John Popham, Lord Chief Justice of England (b. 1531)"]}, {"page": "Edward Coke", "response": ["The political \"old guard\" began to change around the time Coke became a Member of Parliament. The Earl of Leicester died in 1588, followed by Sir Walter Mildmay, the Chancellor of the Exchequer, a year later, and Sir Francis Walshingham a year after that. In 1592 the Lord Chief Justice died and, according to custom the Attorney General, John Popham, succeeded him, with the Solicitor General, Thomas Egerton, succeeding Popham. This created a vacancy among the Law Officers of the Crown, and thanks to the influence of the Cecil family, Coke became Solicitor General on 16 June 1592. This was likely a narrow victory owing to Coke's defence of unpopular clients; he was summoned before Elizabeth I, who berated him until he cried before confirming him as Solicitor General.", "The charges were never brought because of an incident that soon transpired. On 8 February 1601 Devereux ordered his followers to meet at Essex House. A day later a group of emissaries led by Thomas Egerton and John Popham were sent to Devereux, and immediately taken hostage. After a failed attempt to garner support from the population of London, Devereux found himself surrounded in Essex House; after burning his personal papers, he surrendered. On 19 February he was tried for treason, along with the Earl of Southampton.  Coke led the case for the government, and Devereux was found guilty and executed; the Earl of Southampton was reprieved."]}, {"page": "Middle Temple", "response": ["* Sir John Popham"]}, {"page": "Lord Chief Justice of England and Wales", "response": ["|75px || Sir John Popham ||  ||  ||"]}, {"page": "Popham Colony", "response": ["The next attempt was more successful. About 120 colonists (all men and boys) left Plymouth on May 31, 1607, in two ships. They intended to trade precious metals, spices, furs, and show that the local forests could be used to build English ships. George Popham was president of the colony and captain of Gift of God. Raleigh Gilbert was admiral (second in command) of the colony and captain of Mary and John. Neither of these men was a mariner and the ship's officers of Mary and John were Robert Davies and James Davis. The ship's log and diary from the voyage and first 6 weeks of the colony is the main contemporary source of the information about the Popham Colony. (It was called \"Popham\" after its principal financial backer, Sir John Popham.)Beckenstein, Myron. \"Maine’s Lost Colony\", Smithsonian Magazine, February 2004 The diary is kept in Lambeth Museum in London. James Davis was later made captain of the ship built by the colonists, Virginia, which made at least two voyages across the Atlantic. Robert and James were most likely from a family of mariners from Devon, England.", "Sir John Popham was the Lord Chief Justice of England, while Gilbert was the son of Sir Humphrey Gilbert and half-nephew of Sir Walter Raleigh. Other financiers included Sir Ferdinando Gorges, the military governor of Plymouth. Much of the information about the events in the colony comes from his letters and memoirs. Settlers included the Reverend Richard Seymour, grandson of Sir Edward Seymour, Duke of Somerset and brother to Queen Jane Seymour. Nine council members and six other gentlemen accompanied the expedition, while the rest were soldiers, artisans, farmers and traders.", "In May 1608 a supply ship brought a message that Sir John Popham had died. The supply ship returned to England with a cargo. When Mary and John returned in September 1608, it brought news that Gilbert's elder brother John had died. Gilbert thus inherited the title and the estate of Compton Castle in Devon. He decided to return to England and as no other leader was found, the colony decided to disband and the remaining colonists sailed home in Mary and John and Virginia. (The Virginia would make at least one more Atlantic crossing, going to Jamestown the next year with the Third Supply, piloted by Captain James Davis.)", "The colony lasted just 14 months. It is likely that the failure of the colony was due to multiple problems: the lack of financial support after the death of Sir John Popham, the inability to find another leader, the hostility of the native people and the French, and the cold winter. Sir Francis Popham (son of Sir John) tried several times to reestablish the colony, but was unable to get the financial backing. The settlement of New England was delayed until it was taken up by refugees instead of adventurers."]}, {"page": "John Guy (colonial administrator)", "response": ["In 1608 Guy and other members of the Society of Merchant Venturers, decided to act upon a letter received by the mayor from Chief Justice Sir John Popham concerning the colonisation of Newfoundland. Since John Cabot had discovered the island and Sir Humphrey Gilbert had formally taken possession of it for Elizabeth I of England, the merchants of the city had a special interest in Newfoundland, but there had been little attempt to exploit and colonise the island. The merchants decided not to embark on the scheme without the co-operation of King James VI of Scotland and Elizabeth I of England, which was forthcoming. Guy visited the island in 1608 to scout possible locations for a settlement, selecting Cuper's Cove (present day Cupids, Newfoundland and Labrador) as the site of the colony. In 1609, he put forward a proposal \"to animate the English to plant [or colonise] in Newfoundland.\" The merchants of Bristol and London took up the idea with enthusiasm and a list of contributions was made out with Guy and others subscribing twenty marks a year for five years. The idea was popular with members of the court. Amongst the 50 shareholders were John Guy and his younger brother Philip Guy, in effect, Guy had the largest shareholding invested in the venture. On 27 April 1610 James I granted a charter to Henry Howard, 1st Earl of Northampton, Keeper of the Privy Seal, and others including John Guy and his brother Philip Guy, which incorporated them as the \"Treasurer and Company of Adventurers and Planters of the Cities of London and Bristol, for the purpose of colonising Newfoundland, and comprehending as their sphere of action the southern and eastern parts of the new found land between 46° and 52° N. L.\""]}, {"page": "Solicitor General for England and Wales", "response": ["*Sir John Popham 1579–1581"]}, {"page": "List of parliaments of England", "response": ["|rowspan=\"2\"| 17th ||rowspan=\"2\"|  23 September 1449 ||rowspan=\"2\"|  1449 ||rowspan=\"2\"|  6 November 1449 ||rowspan=\"2\"|  c.5–8 June 1450 ||rowspan=\"2\"| 4 || Sir John Popham ||rowspan=\"2\"| ...  ", "| John Popham "]}, {"page": "Wellington, Somerset", "response": ["A royal charter of 1215 gave Wellington its status as a town, and during the medieval period it grew as a centre for trade on the road from Bristol to Exeter, being laid out with the church at the east end of town, in a similar manner to other towns of this era. In 1548, the manor was sold to Edward Seymour, 1st Duke of Somerset, but reverted to the control of the bishops after his execution. By the end of the 16th century it had come under the protection of John Popham (judge) and his descendants who built a manor house which was destroyed during the English Civil War.", "Despite its small size, Wellington has historically been notable for its profusion of churches of many different denominations, including a Quaker meeting house, the Grade I listed, 15th century Church of St John the Baptist, which includes a monument to John Popham, and the Roman Catholic Church of St John Fisher which was built in 1606 as Popham's Almshouses and converted into a Roman Catholic church 1936. Also there was a Presbyterian Independent Church."]}, {"page": "Thomas Fleming (judge)", "response": ["In 1607, on the death of Sir John Popham, Fleming was elevated to the post of Lord Chief Justice of England. The following year he obtained a Charter for Incorporation for Newport from the King, providing for the election of a Mayor instead of the historical appointed Bailiff. He assisted in the establishment of a free grammar school in the town. Also in 1608, Fleming was one of the judges at the trial of the post nati in 1608, siding with the majority of the judges in declaring that persons born in Scotland after the accession of James I were entitled to the privileges of natural-born subjects in England. The convocation of Oxford University granted him the award of MA on 7 August 1613, which was the day he died."]}, {"page": "Henry Garnet", "response": ["When the plot failed Garnet went into hiding, but he was eventually arrested on 27 January 1606.  He was taken to London and interrogated by the Privy Council, whose members included John Popham, Edward Coke and Robert Cecil, 1st Earl of Salisbury.  Imprisoned in the Tower of London, his conversations with fellow prisoner Edward Oldcorne were monitored by eavesdroppers, and his letters to friends such as Anne Vaux were intercepted.  His guilt, announced at the end of his trial on 28 March 1606, was a foregone conclusion.  Criticised for his use of equivocation, which Coke called \"open and broad lying and forswearing\", and condemned for not warning the authorities of what Catesby planned, he was sentenced to be hanged, drawn and quartered.  He was executed on 3 May 1606.", "Garnet did not enter New College; instead, late in 1571, he left Winchester for London. There he worked for a legal publisher, Richard Tottell, as a proof-reader and corrector. He often dined with Sir John Popham, who as Lord Chief Justice was to preside over the trial of the Gunpowder Plotters, men whose association with Garnet would eventually prove so fateful. Although Garnet professed to Popham an interest in legal studies, in 1575 he sailed for Portugal with Giles Gallop, to enter the Society of Jesus.", "Garnet first appeared in front of the Privy Council on 13 February 1606. Present were John Popham, Edward Coke, Sir William Waad, and the Earls of Worcester, Northampton, Nottingham and Salisbury.  Superficially, they treated him with respect, removing their hats and addressing him as \"Mr Garnet\", although they made fun of his relationship with Anne Vaux, claiming he was her lover, not her confessor. During his questioning he admitted some of his movements, and that he had received Catesby's letter on 6 November, but he denied being involved in the plot, whose members he did not name.  Garnet was convinced that his captors were interested only in the failed scheme and believed he might be able to clear his name, but the councillors also asked him about the doctrine of equivocation.  His own treatise on this topic, one of the \"heretical, treasonable and damnable books\" found amongst Francis Tresham's possessions, was laid on the council table before him.  Although it condemned lying, Garnet's treatise supported the notion that when questioned, for instance, on the presence of a priest in his house, a Catholic might \"securely in conscience\" answer \"No\" if he had a \"secret meaning reserved in his mind\".  The occasions on which a Catholic might legitimately use equivocation, he supposed, were limited, but such replies could be taken as an example of insincerity or deviousness—especially to the king's council, who may not have wanted to see Garnet prove his case.  The council's view of equivocation was very different from Garnet's.  In their eyes, it was simple deceit."]}]}}