{"wiki_id": "http://www.wikidata.org/entity/Q380884", "itemLabel": "Corin Redgrave", "itemDescription": "British actor (1939-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Corin_Redgrave", "wikipedia_page": {"main": "Corin William Redgrave (16 July 1939 – 6 April 2010) was an English actor and activist.", "link_mentions": [{"page": "April 6", "response": ["*  2010   – Corin Redgrave, English actor (b. 1939)"]}, {"page": "Four Weddings and a Funeral", "response": ["Four Weddings and a Funeral is a 1994 British romantic comedy film directed by Mike Newell. It is the first of several films by screenwriter Richard Curtis to feature Hugh Grant, and follows the adventures of Charles (Grant) and his circle of friends through a number of social occasions as they each encounter romance. Andie MacDowell stars as Charles's love interest Carrie, with Kristin Scott Thomas, James Fleet, Simon Callow, John Hannah, Charlotte Coleman, David Bower, Corin Redgrave, and Rowan Atkinson in supporting roles."]}, {"page": "July 16", "response": ["*  1939   – Corin Redgrave, English actor and activist (died 2010)"]}, {"page": "John Galsworthy", "response": ["* The Forsyte Saga (2002 TV series), dir. by Christopher Menaul, starring Gina McKee, Damian Lewis, Rupert Graves, and Corin Redgrave, 13 parts."]}, {"page": "2010", "response": ["** Corin Redgrave, English actor and activist (b. 1939)"]}, {"page": "Measure for Measure", "response": ["* 1994 TV adaptation set in the present, starring Tom Wilkinson, Corin Redgrave and Juliet Aubrey."]}, {"page": "Vanessa Redgrave", "response": ["A member of the Redgrave family of actors, she is the daughter of Sir Michael Redgrave and Lady Redgrave, the sister of Lynn Redgrave and Corin Redgrave, the wife of Italian actor Franco Nero, the mother of actresses Joely Richardson and Natasha Richardson and of screenwriter and director Carlo Gabriel Nero, the aunt of British actress Jemma Redgrave, the mother-in-law of actor Liam Neeson and film producer Tim Bevan, and the grandmother of Daisy Bevan and Micheál and Daniel Neeson.", "In her autobiography, Redgrave recalls the East End and Coventry Blitzes among her earliest memories. Following the East End Blitz, Redgrave relocated with her family to Herefordshire before returning to London in 1943. She was educated at two independent schools for girls: the Alice Ottley School in Worcester, and Queen's Gate School in London, before \"coming out\" as a debutante. Her siblings Lynn Redgrave and Corin Redgrave were also actors.", "Within 14 months in 2009 and 2010, Redgrave lost both a daughter and her two younger siblings. Her daughter Natasha Richardson died on 18 March 2009 from a traumatic brain injury caused by a skiing accident. On 6 April 2010, her brother, Corin Redgrave, died, and on 2 May 2010, her sister, Lynn Redgrave, died.", "In 2004, Vanessa Redgrave and her brother Corin Redgrave launched the Peace and Progress Party, which campaigned against the Iraq War and for human rights. Redgrave left the party in 2005."]}, {"page": "Paul Scofield", "response": ["In 2004, a poll of actors of the Royal Shakespeare Company, including Ian McKellen, Donald Sinden, Janet Suzman, Ian Richardson, Antony Sher and Corin Redgrave, acclaimed Scofield's Lear as the greatest Shakespearean performance ever.Scofield's Lear voted the greatest Shakespeare performance. Telegraph.co.uk. 22 August 2004. Scofield appeared in many radio dramas for BBC Radio 4, including in later years plays by Peter Tinniswood: On the Train to Chemnitz (2001) and Anton in Eastbourne (2002). The latter was Tinniswood's last work and was written especially for Scofield, an admirer of Anton Chekhov. He was awarded the 2002 Sam Wanamaker Prize."]}, {"page": "Highgate Cemetery", "response": ["* Corin Redgrave, actor and political activist"]}, {"page": "Clapham", "response": ["* Corin Redgrave – actor"]}, {"page": "In the Name of the Father (film)", "response": ["*Corin Redgrave as Inspector Robert Dixon"]}, {"page": "Michael Redgrave", "response": ["Redgrave was born in Bristol, England, the son of actress Margaret Scudamore and the silent film actor Roy Redgrave. Roy left when Redgrave was six months old to pursue a career in Australia. He died when Redgrave was 14. His mother subsequently married Captain James Anderson, a tea planter. Redgrave greatly disliked his stepfather.Michael Redgrave: My Father, 1996 BBC documentary film narrated by his son Corin Redgrave, based on his book of the same name; produced and directed by Roger Michell", "The 1996 BBC documentary film Michael Redgrave: My Father, narrated by Corin Redgrave, and based on his book of the same name, discusses the older actor's bisexuality in some depth. Rachel Kempson recounted that, when she proposed to him, Redgrave said that there were \"difficulties to do with his nature, and that he felt he ought not to marry\". She said that she understood, it didn't matter and that she loved him. To this, Redgrave replied, \"Very well. If you're sure, we will\"."]}, {"page": "1995 in film", "response": ["| Persuasion || Sony Pictures Classics || Roger Michell (director); Nick Dear (screenplay); Amanda Root, Ciaran Hinds, Susan Fleetwood, Corin Redgrave, Fiona Shaw, John Woodvine, Phoebe Nicholls, Samuel West, Sophie Thompson, Judy Cornwell, Simon Russell Beale, Felicity Dean, Roger Hammond, Emma Roberts, Victoria Hamilton, Robert Glenister, Richard McCabe, Helen Schlesinger, Jane Wood, David Collings, Darlene Johnson, Cinnamon Faye, Isaac Maxwell-Hunt, Roger Llewellyn, Sally George || Period, Drama || Live action"]}, {"page": "1994 in film", "response": ["| Four Weddings and a Funeral || Gramercy Pictures / PolyGram Filmed Entertainment || Mike Newell (director); Richard Curtis (screenplay); Hugh Grant, Andie MacDowell, James Fleet, Simon Callow, John Hannah, Kristin Scott Thomas, David Bower, Charlotte Coleman, Timothy Walker, Sara Crowe, Rowan Atkinson, David Haig, Sophie Thompson, Corin Redgrave, Anna Chancellor, Rupert Vansittart || Romance, Comedy || Live action"]}, {"page": "1993 in film", "response": ["| In the Name of the Father || Universal Pictures || Jim Sheridan (director/screenplay); Terry George (screenplay); Daniel Day-Lewis, Emma Thompson, Pete Postlethwaite, John Lynch, Corin Redgrave, Beatie Edney, John Benfield, Paterson Joseph, Marie Jones, Gerard McSorley, Frank Harper, Mark Sheppard, Don Baker, Tom Wilkinson || Biography, Drama || Live action"]}, {"page": "1984 in film", "response": ["| Eureka || MGM/UA / Recorded Picture Company / JF Productions / Sunley Productions || Nicolas Roeg (director); Paul Mayersberg (screenplay); Gene Hackman, Rutger Hauer, Theresa Russell, Mickey Rourke, Joe Pesci, Jane Lapotaire, Ed Lauter, Joe Spinell, James Faulkner, Corin Redgrave, Helena Kallianiotes, Cavan Kendall, Norman Beaton, Emrys James, Emma Relph, Timothy Scott, Ian Tracey || Drama || Live action "]}, {"page": "1983 in film", "response": ["| Eureka || MGM/UA Entertainment Company / Recorded Picture Company / JF Productions / Sunley Productions || Nicolas Roeg (director); Paul Mayersberg (screenplay); Gene Hackman, Theresa Russell, Rutger Hauer, Jane Lapotaire, Mickey Rourke, Ed Lauter, Joe Pesci, Joe Spinell, James Faulkner, Corin Redgrave, Helena Kallianiotes || Drama || Live action"]}, {"page": "1981 in film", "response": ["| Excalibur || Orion Pictures / Warner Bros. Pictures || John Boorman (director/screenplay); Rospo Pallenberg (screenplay); Nigel Terry, Helen Mirren, Nicholas Clay, Cherie Lunghi, Paul Geoffrey, Nicol Williamson, Corin Redgrave, Patrick Stewart, Keith Buckley, Clive Swift, Liam Neeson, Gabriel Byrne, Robert Addie, Charley Boorman, Katrine Boorman, Ciarán Hinds, Niall O'Brien, Kay McLaren, Barbara Byrne || Epic, Fantasy || Live action"]}, {"page": "1939 in film", "response": ["*July 16 – Corin Redgrave, British actor, political activist (died 2010)"]}, {"page": "Oh! What a Lovely War", "response": ["Oh! What a Lovely War is a 1969 British comedy musical war film directed by Richard Attenborough (in his directorial debut), with an ensemble cast, including Maggie Smith, Dirk Bogarde, John Gielgud, John Mills, Kenneth More, Laurence Olivier, Jack Hawkins, Corin Redgrave, Michael Redgrave, Vanessa Redgrave, Ralph Richardson, Ian Holm, Paul Shelley, Malcolm McFee, Jean-Pierre Cassel, Nanette Newman, Edward Fox, Susannah York, John Clements, Phyllis Calvert and Maurice Roëves.", "* Corin Redgrave as Bertie Smith"]}, {"page": "The Tenant of Wildfell Hall", "response": ["The novel has twice been adapted for television by the BBC. The first version, made in 1968, starred Janet Munro, Corin Redgrave and Bryan Marshall. Tara Fitzgerald, Toby Stephens, Rupert Graves and James Purefoy starred in the second version, made in 1996."]}, {"page": "Lynn Redgrave", "response": ["Redgrave was born in Marylebone, London, to actors Sir Michael Redgrave and Rachel Kempson. Her sister is actress Vanessa Redgrave; her brother was actor and political activist Corin Redgrave. She was the aunt of writer/director Carlo Gabriel Nero and of actresses Joely Richardson, Jemma Redgrave and Natasha Richardson, and the sister-in-law of director Tony Richardson, actress Kika Markham and Italian actor Franco Nero. Her grandfather was silent screen leading man Roy Redgrave."]}, {"page": "Macclesfield", "response": ["* Kika Markham (born 1940) English actress, IMDb Database retrieved December 2017 widow of Corin Redgrave"]}, {"page": "Excalibur (film)", "response": ["Excalibur is a 1981 American epic medieval fantasy film directed, produced, and co-written by John Boorman that retells the legend of King Arthur and the knights of the Round Table, based on the 15th-century Arthurian romance Le Morte d'Arthur by Thomas Malory. It stars Nigel Terry as Arthur, Nicol Williamson as Merlin, Nicholas Clay as Lancelot, Cherie Lunghi as Guenevere, Helen Mirren as Morgana, Liam Neeson as Gawain, Gabriel Byrne as Uther Pendragon, Corin Redgrave as  Gorlois, Duke of Cornwall, and Patrick Stewart as Leondegrance. The film is named after the legendary sword of King Arthur that features prominently in Arthurian literature. The film's soundtrack features the music of Richard WagnerExtracts from Tristan and Isolde, Parsifal, Der Ring des Nibelungen: Twilight of the Gods and Carl Orff,Extract from Carmina burana along with an original score by Trevor Jones.", "* Corin Redgrave as Duke of Cornwall"]}, {"page": "George Grey", "response": [" The Governor, an historical drama miniseries based on Grey's life, was made by TVNZ and the National Film Unit in 1977, featuring Corin Redgrave in the title role. Despite critical acclaim, the miniseries attracted controversy at the time because of its then-large budget."]}, {"page": "Krapp's Last Tape", "response": ["===Corin Redgrave===", "Corin Redgrave performed the role of Krapp for BBC Radio 3 in 2006 a few months after he had suffered a major heart attack.  The production was rebroadcast on BBC Radio 3 on 16 May 2010 as part of a double bill with a 2006 production of Embers."]}, {"page": "List of show business families", "response": ["** Kika was married to the late Corin Redgrave (see Redgrave family) and is stepmother of actress Jemma Redgrave.", "** Sir Michael was the father of siblings Vanessa, Lynn (deceased) and Corin Redgrave (deceased)."]}, {"page": "List of sibling pairs", "response": ["* Vanessa, Lynn and Corin Redgrave; actors, children of actor Sir Michael Redgrave"]}, {"page": "A Dance to the Music of Time", "response": ["| Narrator ||  || Corin Redgrave ||  Noel Johnson"]}, {"page": "Lanoe Hawker", "response": ["Hawker was portrayed by Corin Redgrave in the 1971 film Von Richthofen and Brown. In the 2008 film The Red Baron, he was played by Richard Krajčo."]}, {"page": "Natasha Richardson", "response": ["Richardson was born and raised in Marylebone, London, a member of the Redgrave family, known as a theatrical and film acting dynasty. She was the daughter of director and producer Tony Richardson and actress Vanessa Redgrave, granddaughter of actors Sir Michael Redgrave and Rachel Kempson,Debrett's People of Today. Debrett's Peerage Ltd., 2007 sister of Joely Richardson, half-sister of Carlo Gabriel Nero and Katharine Grimond Hess, niece of actress Lynn Redgrave and actor Corin Redgrave and cousin of Jemma Redgrave."]}, {"page": "Noël Coward Theatre", "response": ["* The RSC's King Lear (18 January 2005 – 5 February 2005) by William Shakespeare, starring Corin Redgrave"]}, {"page": "Joely Richardson", "response": ["Joely Kim Richardson was born in Marylebone, London, to the theatrical Redgrave family, the daughter of actress Vanessa Redgrave and director Tony Richardson, and the granddaughter of actors Sir Michael Redgrave and Rachel Kempson, Lady Redgrave. Actress Natasha Richardson (1963–2009) was her sister and actor Liam Neeson is her brother-in-law.  She is the aunt of Micheál and Daniel Neeson and the niece of actors Lynn Redgrave and Corin Redgrave and cousin of actress Jemma Redgrave, who is five days younger than Richardson."]}, {"page": "Jemma Redgrave", "response": ["Born in London, she is the daughter of actor Corin Redgrave and his first wife, Deirdre Hamilton-Hill, a former fashion model. They divorced when Jemma was nine. She has a brother, Luke Redgrave, who is a camera operator, and two half-brothers, Arden and Harvey Redgrave. Her mother died in 1997 and her father died in 2010."]}, {"page": "Redgrave", "response": ["** Corin Redgrave"]}, {"page": "Roy Redgrave", "response": ["At some point after initial Australian theatre work, Redgrave left for England alone. According to the \"History of Australian Theatre\" archives, American actress Minnie Tittell Brune made her first appearance in Australia on 21 September 1904 at Her Majesty's Theatre, Sydney in the play Sunday, supported by Roy Redgrave. Roy toured with her on the J.C. Williamson circuit. According to Corin Redgrave, Ellen (Judith) pursued Roy to Australia, arriving in time to pay his unsettled hotel bills, but she was unable to persuade him to return home with her to his family. Ellen remarried Frederick John Nettlefold, a respectable landed gentleman, in Brighton, England in 1907."]}, {"page": "The Wednesday Play", "response": ["| Susan JamesonCorin RedgraveJack Watson Jo Rowbottom"]}, {"page": "Theatre 625", "response": ["|Harry H. Corbett,Corin Redgrave,Judy Cornwell,John Phillips,Peter Copley,Ronald Adam,Alan Shallcross,Roy Evans,Peter Pratt,Michael Hawkins,Aubrey Morris"]}, {"page": "Foyle's War", "response": ["| Alistair Rose || Assistant Commissioner || 8, 12 || Corin Redgrave"]}, {"page": "No Man's Land (play)", "response": ["In 2001, another major revival at the NT was directed by Harold Pinter, with Corin Redgrave as Hirst, John Wood as Spooner, Danny Dyer as Foster, and Andy de la Tour as Briggs."]}, {"page": "Enduring Love (film)", "response": ["Enduring Love is a 2004 British psychological thriller film directed by Roger Michell and written by Joe Penhall, based on the 1997 novel of the same name by Ian McEwan. The story concerns two strangers who become dangerously close after witnessing a deadly accident. It stars Daniel Craig, Rhys Ifans and Samantha Morton with Bill Nighy, Susan Lynch and Corin Redgrave.", "* Corin Redgrave as The Professor"]}, {"page": "List of University of Cambridge people", "response": ["*Corin Redgrave (King's)"]}, {"page": "Minette Walters", "response": ["*The Ice House – adapted 1997; starred Daniel Craig, Frances Barber and Corin Redgrave."]}, {"page": "Enigma (2001 film)", "response": ["* Corin Redgrave as Admiral Trowbridge"]}]}}