{"wiki_id": "http://www.wikidata.org/entity/Q3809321", "itemLabel": "John Hawkesworth", "itemDescription": "Officer in the British Army (1893-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hawkesworth_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant General Sir John Ledlie Inglis Hawkesworth,  (19 February 1893 – 3 June 1945) was a senior British Army officer who served during both World Wars. During the Second World War he commanded the 4th Division during the Tunisian Campaign in early 1943, later commanding the 46th Division throughout most of the Italian Campaign and, finally, X Corps in Greece, before suffering from a fatal heart attack in June 1945.", "link_mentions": [{"page": "Eric Dorman-Smith", "response": ["In 1924, he left his regiment to become an instructor at the Royal Military College, Sandhurst, where he became acquainted with Richard O'Connor; the duo went on a walking tour of the Austro-Italian Alps at the end of 1924.Greacen p. 94 In 1927, Dorman-Smith sat the entrance examination for the Staff College, Camberley. In the Strategy paper the examiner, J. F. C. Fuller, awarded him 1,000 marks out of a possible 1,000. The advantage of gaining the p.s.c. (passed Staff College) was that the two-year course provided a network of 180 highly trained officers for help afterwards. By arriving with such a splash, it is probable that Dorman-Smith became regarded with suspicion by people who would one day be his peers and superior officers.Greacen pp. 96–7 Many of Dorman-Smith's fellow students there included the future general officers of the Second World War, including Philip Christison, Evelyn Barker, Oliver Leese, Eric Hayes, John Hawkesworth, Ronald Penney, John Whiteley, Robert Bridgeman, 2nd Viscount Bridgeman, Eric Nares, Charles Norman, Stanley Kirby, Wilfrid Lloyd, Reginald Savory and Clement West.Smart, p. 88", "When Dorman-Smith arrived in the Anzio beachhead, the fighting was reminiscent of the fighting on the Western Front almost 30 years before, with static warfare replacing the mobility that had existed in the Western Desert. Soon after his arrival, Major General Lucian Truscott, commanding the U.S. VI Corps (under which the 1st Division had been serving since January), received orders from his superior, Lieutenant General Mark W. Clark, commanding the American Fifth Army, to break out of the Anzio beachhead. This was to coincide with the Allied forces further south in their successful attempt in breaching the Gustav Line. Dorman-Smith's brigade spearheaded the 1st Division's advance up the western flank of Italy, along the way becoming engaged in numerous small-scale fights while trying to reach the River Tiber. During most of this period Penney was away, having been badly injured in February by a shell in some of the fiercest fighting at Anzio. He was replaced on a temporary basis by Major-General John Hawkesworth, yet another of Dorman-Smith's fellow students at Camberley, and a close friend, but he returned to his 46th Division in Palestine in late May, and was replaced by Brigadier Charles Loewen, the Commander, Royal Artillery (CRA) of X Corps who, unlike Hawkesworth, was a total stranger to \"Chink\", but one who he respected. Penney returned to the division, now advancing forwards to the Gothic Line defences, in mid-June, but his injuries rendered him unfit to continue in command and relinquished control of the division to Loewen, now a major general, in late July. Soon afterwards, however, Dorman-Smith himself was relieved of command of the 3rd Brigade."]}, {"page": "15th Army Group", "response": ["****22px British 46th Infantry Division - (Major-General John Hawkesworth)"]}, {"page": "Philip Christison", "response": ["After vacating his position as adjutant of the 4th Battalion, King's Own Scottish Borderers, another TA unit, in November 1923, Christison was assistant manager of the British Olympic team in Paris in 1924 which was followed by a further appointment as an adjutant, this time with his regiment. Still a captain, he attended the Staff College, Camberley from January 1927 to December 1928. His fellow students there included several who, like Christison, would eventually rise to high command, such as Oliver Leese, John Whiteley, Evelyn Barker, Robert Bridgeman, Eric Dorman-Smith, Ronald Penney and John Hawkesworth. His instructors included the likes of Richard O'Connor, Bernard Paget, Edwin Morris, Harold Franklyn, Henry Pownall, George Giffard and Bernard Montgomery. Shortly after graduating from Camberley he was appointed as a General Staff Officer Grade 3 (GSO3) at the War Office."]}, {"page": "Operation Avalanche", "response": ["::::* 46th Infantry Division (Maj.-Gen. John Hawkesworth)"]}, {"page": "Allied invasion of Italy", "response": ["The Avalanche plan using less than half the troops landed during Operation Husky was daring, considering possible resistance by six German divisions.Atkinson p. 185 The Fifth Army would be landing on a very broad  front, using only three assault divisions (one American, the 36th, under Major General Fred L. Walker, in VI Corps, and two British, the 46th, under Major-General John Hawkesworth, and 56th, under Major-General Douglas Graham, in X Corps),Terdoslavich, William. \"Nothing Goes Right in Italy\", in Fawcett, Bill, ed. How to Lose WWII (New York: Harper, 2000), p. 157. and the two corps were widely separated, both in distance () and by the Sele River.Terdoslavich, p. 157. Clark initially provided no troops to cover the river, offering the Germans an easy route to attack, and only belatedly landed two battalions to protect it. Furthermore, the terrain was highly favorable to the defender. Planning for the Salerno phase was accomplished in only forty-five days, rather than the months that might be expected. A U.S. Army Ranger force, under the command of Lieutenant Colonel William O. Darby, consisting of three U.S. Ranger battalions (the 1st, 3rd and 4th) and two British Commando units, under Brigadier Robert Laycock (consisting of No. 2 (Army) Commando and No. 41 (Royal Marine) Commando) was tasked with holding the mountain passes leading to Naples, but no plan existed for linking the Ranger force up with X Corps' follow-up units. Finally, although tactical surprise was unlikely, Clark ordered no naval preparatory bombardment or naval gunfire support take place, despite experience in the Pacific Theater demonstrating it was necessary. (Major General Walker, commanding the U.S. 36th \"Arrowhead\" Division, believed the defenders, from Traugott Herr's LXXVI Panzer Corps, were too scattered for it to be effective.) The element of surprise was further limited by belated discovery of naval minefields off Salerno requiring landing craft to spend two hours traveling  from the transports to the landing beaches.Atkinson pp. 184, 204", "Major General Rudolf Sieckenius, commander of the 16th Panzer Division had organised his forces into four mixed arms battle groups which he had placed roughly  apart and between  back from the beaches. The Dőrnemann group was just east of Salerno (and therefore were opposite Major General John Hawkesworth's British 46th Infantry Division when it landed), the Stempel battle group was between Pontecagnano and Battipaglia (and so faced Major General Douglas Graham's British 56th Infantry Division), the Holtey battle group was in a reserve role at Persano on the Sele river which formed the corps boundary between Lieutenant General Richard McCreery's British X Corps and Major General Ernest Dawley's U.S. VI Corps, while the von Doering battle group responsible for the Albanella to Rutino sector was  south-east of Ogliastro, somewhat south of the U.S. 36th Division's beaches.Molony, p. 268."]}, {"page": "4th Infantry Division (United Kingdom)", "response": ["Shortly after the outbreak of the Second World War in September 1939 the 4th Division, under Major General Dudley Johnson, who had won the Victoria Cross (VC) in the Great War, was sent to the border between France and Belgium as part of Lieutenant-General Alan Brooke's II Corps of the British Expeditionary Force (BEF). All three of the division's brigades were commanded by distinguished soldiers, the 10th by Brigadier Evelyn Barker, the 11th by Brigadier Kenneth Anderson and the 12th by Brigadier John Hawkesworth. After the disastrous Battle of France in May–June 1940, where the division sustained heavy losses, and the evacuation at Dunkirk, it spent the next two years in the United Kingdom on anti-invasion duties and training for its next deployment.", "In June 1942 the division, now under Major General John Hawkesworth, was selected to be converted into a 'mixed' division, consisting of two infantry brigades and one tank brigade. As a result of this change, the divisions' 11th Infantry Brigade left the division and was replaced by the 21st Army Tank Brigade."]}, {"page": "British First Army order of battle, 20 April 1943", "response": ["*** British 4th Infantry Division (Major-General John Hawkesworth)"]}, {"page": "Gerald Templer", "response": ["He remained in the army during the interwar period and served with his battalion, still the 1st Irish Fusiliers, after briefly returning to England, in operations in Persia (now Iran) and Iraq in 1919–20 as part of a multi-national attempt to prevent the spread of bolshevism, which was followed by service in Egypt.Cloake, pps. 29–37 Returning to England with the battalion, where it was amalgamated with the 2nd Battalion in November 1922,Cloake, pps. 37–38 Templer was a reserve for the 1924 Summer Olympics as a 120-yard hurdler, although in the end he did not compete.Cloake, p. 38 In January 1925 the battalion again returned to Egypt, where it remained until October 1927 when it was sent to India, although Templer did not accompany them. Just before the battalion sailed for India he had returned to England to attend the Staff College, Camberley, which he did from 1928 to 1929, and was the youngest student there, aged just 29.Cloake, p. 47 Among his many fellow students were men such as John Harding, Richard McCreery, Gordon MacMillan, Alexander Galloway, Gerard Bucknall, Philip Gregson-Ellis, Alexander Cameron and Cameron Nicholson. In the year senior to him were Eric Dorman-Smith, John Hawkesworth, John Whiteley, Evelyn Barker, Oliver Leese, Ronald Penney, Robert Bridgeman, Philip Christison and numerous others while, in Templer's second year, in the year below, were George Erskine, Harold Freeman-Attwood, Neil Ritchie, Herbert Lumsden, Reginald Denning and Maurice Chilton. Templer's instructors there included Bernard Paget, Henry Pownall and Bernard Montgomery. Due to the Royal Irish Fusiliers being reduced to a single battalion in 1922, and thus promotion in the regiment being slower than in the rest of the army, Templer was forced to transfer to the Loyal Regiment (North Lancashire), to gain a promotion to captain, which was backdated to 11 August 1928.Heathcote, Anthony pg 274 After graduation from the Staff College, Templer joined the 2nd Battalion of his new regiment, then stationed at Aldershot, in January 1930.Cloake, pps. 49–50"]}, {"page": "John Brunt", "response": ["Brunt joined the British Army when he left school, training as a private soldier with the Queen's Own Royal West Kent Regiment in 1941, during the Second World War. He received a commission as a second lieutenant on 2 January 1943, and was posted to North Africa. Although he was commissioned in the Sherwood Foresters, he never served with them, instead being posted to the 6th Battalion, Lincolnshire Regiment (6th Lincolns), a Territorial Army (TA) unit, having become friendly with Captain Alan Money, an officer in the Lincolns, on the boat to North Africa. The battalion was part of the 138th Infantry Brigade of the 46th Infantry Division. The division was then commanded by Major General John Hawkesworth."]}, {"page": "Manley James (VC)", "response": ["After months spent training in desert warfare, James led the brigade overseas to North Africa in mid-January 1943, where it fought throughout the Tunisian Campaign until its end in mid-May with distinction, earning James a Distinguished Service Order (DSO). The campaign came to an end in mid-May 1943, with the surrender of thousands of Axis soldiers. The brigade then, after initially being held in reserve for the Allied invasion of Sicily, settled down for training before taking part in the Allied invasion of Italy in September where his brigade, along with the rest of the division, now commanded by Major-General John Hawkesworth, sustained very heavy casualties and James himself was wounded on 20 September and evacuated to Egypt."]}, {"page": "Frederick E. Morgan", "response": ["He was not to remain with the division for long, however, as on 14 May Morgan handed over command of the 55th Division to Major-General Hugh Hibbert and was promoted to the acting rank of lieutenant general and took command of I Corps District from Lieutenant-General Henry Willcox, which had responsibility for the defence of Lincolnshire and the East Riding of Yorkshire. In October of that year his headquarters became a mobile formation, was redesignated I Corps and placed under his American superior, Lieutenant General Dwight D. Eisenhower. On 12 November Morgan's permanent rank was advanced from colonel to major-general (with seniority backdating to 13 November 1941). Morgan's I Corps headquarters was later designated Force 125 and was given command of Walter Clutterbuck's 1st and John Hawkesworth's 4th Divisions, and the task of dealing with a German thrust through Spain to Gibraltar."]}, {"page": "Oliver Leese", "response": ["After the war, he remained in the British Army, being promoted captain in 1921, and attending the Staff College, Camberley from 1927 to 1928. Among his many fellow students in the junior division there were a large number of future general officers, such as Robert Bridgeman, Eric Hayes, Angus Collier, Evelyn Barker, Philip Christison, Ronald Penney, Stephen Irwin, Eric Dorman-Smith, Reginald Savory, Alec Bishop, John Whiteley, George Surtees, Wilfrid Lewis Lloyd, Stanley Kirby, John Hawkesworth, Charles Norman, Colin Jardine, Edmund Beard, Clement West, Christopher Woolner, Alfred Curtis, Oliver Edgcumbe and Eric Paytherus Nares, along with Frank Berryman of the Australian Army.Ryder, p. 31 Returning briefly to his battalion after graduation, in November 1929 he was appointed as brigade major to the 1st Infantry Brigade (Guards) and was formally promoted to major a few days later. He was promoted to brevet lieutenant-colonel in July 1933."]}, {"page": "Richard Hull", "response": ["Hull was then promoted to brigadier and took command of the 12th Infantry Brigade, part of the 4th Mixed Division (which was composed of the 10th and 12th Infantry Brigades and the 21st Tank Brigade), then commanded by Major General John Hawkesworth, which had arrived in Tunisia the month before, on 17 April. The brigade was heavy fighting just a week after Hull's assumption of command, where it was involved in taking a key position named Peter's Corner which, despite air and infantry tank support from the 21st Tank Brigade, failed with some 900 casualties, with the Germans putting up a tenacious resistance. Hull's brigade was relieved by the 78th Division's 11th Brigade soon afterwards and, due to its heavy losses, only managed to play a relatively minor role in the First Army's capture of Tunis, which fell on 6 May 1943, the campaign in Tunisia itself coming to an end a week later with the surrender of 250,000 Axis troops.", "Hull remained in this post until August 1944 when, promoted to major general, he succeeded Major General Alexander Galloway as GOC of the 1st Armoured Division, then serving on the Italian front, making Hull the youngest divisional commander in the British Army during the Second World War. The division, a pre-war Regular Army formation, was composed of the 2nd Armoured and 18th Lorried Infantry Brigades along with supporting units, and was a veteran of the British Eighth Army that had fought throughout most of the North African campaign and with the First Army in the final stages of the campaign in Tunisia but, since then, had seen no action, with tanks being considered unsuitable in the mountains of Italy. The division was assigned to V Corps, commanded by Lieutenant General Charles Keightley (who, formerly as Hull's superior as GOC 6th Armoured, had recommended him for command of the 1st Armoured Division), with I Canadian Corps and II Polish Corps on its right, next to the Adriatic Sea. The Eighth Army commander, Lieutenant General Sir Oliver Leese (who had taught Hull at the Staff College, Quetta before the war), intended to launch an offensive to breach the Gothic Line, believing he could reach the Po Valley. The operation, codenamed Olive, began on the night of 25 August, with the 1st Armoured held in reserve. Keightley, the corps commander, planned for the 46th Division, under Major General John Hawkesworth, to breach the German defences, allowing Hull's division to exploit its success and drive on to the Po Valley."]}, {"page": "San Gennaro Vesuviano", "response": ["On 9 September the Allies arrived in Salerno and on the 28th the English forces reached San Gennaro Vesuviano. The men were those from the 46th Infantry Division under the command of Major-General John Hawkesworth. A group of local inhabitants went to meet the newly arrived English forces, warning them about the location of land mines previously placed around the area by German forces."]}, {"page": "Robert Bridgeman, 2nd Viscount Bridgeman", "response": ["After the war, he was private secretary to his father in 1918 and became captain in 1921. He attended the Staff College, Camberley from 1927 to 1928. His fellow students included Oliver Leese, Philip Christison, Eric Hayes, Evelyn Barker, Eric Dorman-Smith, John Whiteley, Ronald Penney, Clement West, Wilfred Lloyd, Stanley Kirby and John Hawkesworth. He was then transferred as a brevet-major to the 7th Infantry Brigade in 1932. Bridgeman held this command until 1934 and became brevet lieutenant-colonel in the following year, having been simultaneously appointed to the War Office as a general staff officer."]}, {"page": "John Hawkesworth (producer)", "response": ["*John Hawkesworth, In My Lady's Chamber, Sphere Books Limited, 1973", "*John Hawkesworth at BFI ScreenOnline"]}, {"page": "X Corps (United Kingdom)", "response": ["In November 1944 command of X Corps was taken by Lieutenant-General John Hawkesworth, when McCreery was promoted to command Eighth Army, in place of Oliver Leese. From October 1944, after the Axis forces withdrew from Greece, British troops under Lieutenant-General Ronald Scobie were sent there to maintain internal stability. In late 1944 Hawkesworth and X Corps HQ were sent to Greece to assume control of military operations so that Scobie could concentrate on the political aspects of the British involvement.Mead (2007), p. 197", "* Nov 1944 – May 1945 Lieutenant-General Sir John Hawkesworth"]}, {"page": "Gothic Line order of battle", "response": [":*British 46th Infantry Division (Major-General John Hawkesworth until 6 November 1944, then Major-General Stephen Weir) (until December 1944)", ":Lieutenant-General John Hawkesworth (from 6 November 1944)"]}, {"page": "John Hawkesworth", "response": ["John Hawkesworth may refer to:", "* John Hawkesworth (book editor) (c. 1715–1773), English writer book editor", "* John Hawkesworth (British Army officer) (1893–1945), British Army Lieutenant-General", "* John Hawkesworth (producer) (1920–2003), English television producer and script writer"]}, {"page": "Salerno mutiny", "response": ["Once aboard ship, the men were told that they were being taken to Salerno, Italy, to join the British 46th Infantry Division (Major-General John Hawkesworth) and 56th (London) Infantry Division (Major-General Douglas Graham), which had both suffered heavy losses. Both divisions were serving as part of Lieutenant-General Richard McCreery's British X Corps, which itself was fighting as part of Lieutenant General Mark Clark's U.S. Fifth Army. Many of the soldiers felt they had been deliberately misled.Saul, p. 88"]}, {"page": "Operation Diadem order of battle", "response": [":* British 1st Infantry Division (Major-General John Hawkesworth)"]}, {"page": "Charles Walter Allfrey", "response": ["In early March 1942, Allfrey handed over command of the 43rd Division to Major General Ivor Thomas, a fellow artilleryman, and was promoted to acting lieutenant general to become the GOC of V Corps in succession to Lieutenant General Edmond Schreiber. Aged just 46, this was a considerable tribute towards Allfrey and made him one of the youngest corps commanders in the British Army. V Corps, with the 38th (Welsh) and 47th (London) Infantry Divisions, commanded respectively by Major Generals Donald Butterworth and Gerald Templer (who had briefly been Allfrey's BGS), and the 214th Independent Infantry Brigade (Home) under command, was serving under Southern Command in a static beach defence role. However, it relinquished this role upon being sent to Scotland in July, where it took under command the 6th Armoured Division, under Major General Charles Keightley (who had been a fellow instructor at the Staff College some years before), and the 4th and 78th Infantry Divisions, commanded by Major Generals John Hawkesworth (another of Allfrey's fellow Staff College instructors) and Vyvyan Evelegh, respectively. Allfrey's V Corps was to form a major component of the First Army, under Lieutenant General Edmond Schreiber (replaced in August by Lieutenant General Kenneth Anderson), then being formed for participation in Operation Torch, the Allied invasion of French North Africa, scheduled for November. Training in Scotland continued until October, and the 4th and 78th Divisions were posted elsewhere in preparation for the invasion."]}, {"page": "John Hawkesworth (Army general)", "response": ["#REDIRECT John Hawkesworth (British Army officer)"]}, {"page": "Index of World War II articles (J)", "response": ["# John Hawkesworth (British Army officer)", "# John Hawkesworth (producer)"]}, {"page": "Dekemvriana", "response": ["The British, alarmed by the initial successes of EAM/ELAS and outnumbered, flew in the 4th Indian Infantry Division from Italy as emergency reinforcements. They also transferred John Hawkesworth from Italy to Athens, as assistant to Scobie, who soon took the general command."]}, {"page": "Gordon MacMillan", "response": ["With IX Corps HQ disbanded, MacMillan was transferred briefly as BGS to the First Army headquarters, whose responsibilities included arranging for the victory parade on 20 May 1943 which involved some 26,000 Allied troops of various nationalities.MacMillan 2013, p. 68-69 Following the parade, on 17 June, he was posted to command the 12th Infantry Brigade, taking over from Brigadier Richard Hull, part of the 4th Mixed Division, then commanded by Major-General John Hawkesworth. The division had come under IX Corps command for the final stages of the campaign and so MacMillan was familiar with it. However, just eight days later, he was given command of the 152nd Infantry Brigade, one of three brigades – the others being the 153rd under Brigadier Horatius Murray and the 154th under Brigadier Thomas Rennie – making up the veteran 51st (Highland) Infantry Division, which was then commanded by Major-General Douglas Wimberley. Under Wimberley's command the division had fought during the Second Battle of El Alamein and throughout North Africa, notably in Egypt, Libya and Tunisia, as an integral part of the British Eighth Army, commanded by General Sir Bernard Montgomery, who had been one of MacMillan's instructors at the Staff College, Camberley in the late 1920s, and had formed a good opinion of him."]}, {"page": "46th Infantry Division (United Kingdom)", "response": ["The division was not allocated to the Allied invasion of Sicily and remained in Tunisia. In June, the division took part in Exercise Conqueror, a training exercise, where it opposed an amphibious landing conducted by the United States 1st Infantry Division. This was followed by the 46th conducting amphibious landing training, as it was assigned to Operation Buttress, a proposed landing across the Strait of Messina on mainland Italy. This operation did not occur, and the division was allotted to Operation Avalanche; the Allied invasion of mainland Italy at Salerno. In August, the division undertook Exercise Dryshod as a final rehearsal for this landing. During the exercise, a truck containing land mines exploded, killing 15 men and injuring around 30 more. On 25 August, Major-General John Hawkesworth took command.", "|Major-General John Hawkesworth", "|Major-General John Hawkesworth"]}, {"page": "Charles Norman (British Army officer)", "response": ["After being released in 1919, he remained in the army, initially with the 9th Lancers serving around the British Empire, in India and Egypt. After marrying in 1925, he returned to England, where he became an instructor at the Royal Military College, Sandhurst. He then attended the Staff College, Camberley, from 1927 to 1928. His fellow students there included Philip Christison, Evelyn Barker, Oliver Leese, Eric Dorman-Smith, Eric Hayes, John Whiteley, Ronald Penney, John Hawkesworth, Clement West, Christopher Woolner, Robert Bridgeman and Stanley Kirby. All of these men would, like Norman himself, reach general officer rank or distinguish themselves during World War II."]}, {"page": "Allied invasion of Italy order of battle", "response": ["right|thumb|140px|Maj.-Gen. John Hawkesworth", ": Major-General John Hawkesworth"]}, {"page": "Battle of Monte Cassino order of battle January 1944", "response": [":*20px  British 46th Infantry Division (Major-General John Hawkesworth)"]}, {"page": "Ronald Penney", "response": ["Immediately after the war, in March 1919, Penney became a General Staff Officer Grade 3 (GSO3) at the Signal Service Training Centre, where he remained until 13 June 1921, during which time he transferred, on 11 May 1921, to the newly formed Royal Corps of Signals. He then served in India, where he played rugby for the army and served as Assistant to the Signal Officer-in-Chief, India.Smart, p. 246 In 1925 he married Shirley Mary Gurner; they had two daughters. Returning to England, he served briefly as an instructor at the Royal School of Signals from 22 March 1926 until 20 January 1927, and attended the Staff College, Camberley, graduating there in late 1928. Among his many fellow students at Camberley were John Whiteley, Clement West, Eric Dorman-Smith, Angus Collier, Reginald Savory, Philip Christison, Oliver Leese, Evelyn Barker, John Hawkesworth, Alec Bishop, Eric Nares, Eric Hayes, Charles Norman, Stanley Kirby, Edmund Beard, Christopher Woolner, Wilfrid Lloyd, Reginald Savory, Robert Bridgeman and Alfred Curtis. While there he was promoted to major on 26 June 1927.", "Soon after this incident, however, in early May, Penney's injuries, caused during the height of the German counterattacks, returned, causing him great pain and forcing him to take sick leave. He was replaced on a temporary basis as GOC of the 1st Division by Major General John Hawkesworth, another of Penney's Staff College classmates, GOC of the 46th Division, then resting in Palestine. Hawkesworth returned to his division in late May, and Brigadier Charles Loewen, the Commander, Royal Artillery (CRA) of X Corps, took command until Penney's return in mid-June, by which time Operation Diadem and the break-out from the Anzio beachhead had taken place, which eventually resulted in the capture of Rome. The 1st Division was then transferred to Lieutenant General Charles Allfrey's V Corps, part of the Eighth Army, now commanded by Lieutenant General Sir Oliver Leese. However, in late July, Penney's injuries returned again, and it became obvious that he was unable to continue on active service. Loewen, a Canadian officer serving in the British Army, became permanent GOC of the 1st Division. Soon before Penney left, he wrote an adverse report on Dorman-Smith, forcing the latter to be relieved of his command and his early retirement from the army."]}, {"page": "Eric Hayes", "response": ["Continuing his military service into the interwar period, most of it being spent as a captain, Hayes volunteered for service in Russia during the Russian Civil War in 1919, serving alongside Brian Horrocks on the staff of the Anglo-Russian Brigade, based in Vladivostok, and for ten months found himself as a prisoner of war (POW) by the \"Reds\". Returning to England, and marrying Florence Lllyanne, daughter of Henri Sudreau, in 1924, Hayes was promoted to captain on 10 January 1926, and attended the Staff College, Camberley from 1927 to 1928. His fellow students included several future general officers, such as Oliver Leese, Angus Collier, Eric Dorman-Smith, Eric Nares, Evelyn Barker, Philip Christison, Colin Jardine, Wilfrid Lloyd, Oliver Edgcumbe, Robert Bridgeman, John Hawkesworth, John Whiteley, Alfred Curtis, Edmund Beard, William Bishop, Stanley Kirby, Ronald Penney, Stephen Irwin, Charles Norman, Reginald Savory, Christopher Woolner and Clement West. Shortly after graduating from Camberley, from 21 May 1929 Hayes was appointed as a General Staff Officer Grade 3 (GSO3) at the War Office. Relinquishing this appointment on 1 March 1931, he was then made a brigade major with the 13th Infantry Brigade."]}, {"page": "James P. Berkeley", "response": ["Berkeley took part in Salerno Landing in September 1943 as an observer with the 46th British Infantry Division under Major General John Hawkesworth. During the landing, his LVT came under German artillery fire and was forced to withdraw for repairs. Berkeley later had the opportunity to discuss the efficiency of naval gunfire support with Lieutenant General George S. Patton, the 7th U.S. Army commander. He later recalled General Patton's distaste for and distrust of naval gunfire support, a primary element for successful amphibious operations."]}]}}