{"wiki_id": "http://www.wikidata.org/entity/Q3805138", "itemLabel": "J. Thomas Looney", "itemDescription": "English school teacher", "wikipedia_url": "https://en.wikipedia.org/wiki/J._Thomas_Looney", "wikipedia_page": {"main": "John Thomas Looney (luni) (14 August 1870 – 17 January 1944) was an English school teacher who is notable for having originated the Oxfordian theory, which claims that Edward de Vere, 17th Earl of Oxford (1550–1604) was the true author of Shakespeare's plays.\nLooney came from a Methodist religious background, but later converted to the rationalistic Religion of Humanity, becoming a leader of its church in Tyneside. After the failure of the local church, Looney turned to the Shakespeare authorship question, publishing in 1920 his theory that de Vere was the author of most of the poems and plays published in Shakespeare's name. He later argued that de Vere had also written works published under the names of other poets.", "link_mentions": [{"page": "Oxfordian theory of Shakespeare authorship", "response": ["By the beginning of the twentieth century other candidates, typically aristocrats, were put forward, most notably Roger Manners, 5th Earl of Rutland, and William Stanley, 6th Earl of Derby. Oxford's candidacy as sole author was first proposed by J. Thomas Looney in his 1920 book Shakespeare Identified in Edward de Vere, 17th Earl of Oxford.. Following earlier anti-Stratfordians, Looney argued that the known facts of Shakespeare's life did not fit the personality he ascribed to the author of the plays. Like other anti-Stratfordians before him, Looney referred to the absence of records concerning Shakespeare's education, his limited experience of the world, his allegedly poor handwriting skills (evidenced in his signatures), and the \"dirt and ignorance\" of Stratford at the time. Shakespeare had a petty \"acquisitive disposition\", he said, while the plays made heroes of free-spending figures.. They also portrayed middle and lower-class people negatively, while Shakespearian heroes were typically aristocratic. Looney referred to scholars who found in the plays evidence that their author was an expert in law, widely read in ancient Latin literature, and could speak French and Italian. Looney believed that even very early works such as Love's Labour's Lost implied that he was already a person of \"matured powers\", in his forties or fifties, with wide experience of the world.. Looney considered that Oxford's personality fitted that he deduced from the plays, and also identified characters in the plays as detailed portraits of Oxford's family and personal contacts. Several characters, including Hamlet and Bertram (in All's Well that Ends Well), were, he believed, self-portraits. Adapting arguments earlier used for Rutland and Derby, Looney fitted events in the plays to episodes in Oxford's life, including his travels to France and Italy, the settings for many plays. Oxford's death in 1604 was linked to a drop-off in the publication of Shakespeare plays. Looney declared that the late play The Tempest was not written by Oxford, and that others performed or published after Oxford's death were most probably left incomplete and finished by other writers, thus explaining the apparent idiosyncrasies of style found in the late Shakespeare plays. Looney also introduced the argument that the reference to the \"ever-living poet\" in the 1609 dedication to Shakespeare's sonnets implied that the author was dead at the time of publication.", "In the opinion of J. Thomas Looney, as \"far as forms of versification are concerned De Vere presents just that rich variety which is so noticeable in Shakespeare; and almost all the forms he employs we find reproduced in the Shakespeare work.\" Oxfordian Louis P. Bénézet created the \"Bénézet test\", a collage of lines from Shakespeare and lines he thought were representative of Oxford, challenging non-specialists to tell the difference between the two authors. May notes that Looney compared various motifs, rhetorical devices and phrases with certain Shakespeare works to find similarities he said were \"the most crucial in the piecing together of the case\", but that  for some of those \"crucial\" examples Looney used six poems mistakenly attributed to Oxford that were actually written by Greene, Campion, and Greville. Bénézet also used two lines from Greene that he thought were Oxford's, while succeeding Oxfordians, including Charles Wisner Barrell, have also misattributed poems to Oxford. \"This on-going confusion of Oxford's genuine verse with that of at least three other poets\", writes May, \"illustrates the wholesale failure of the basic Oxfordian methodology.\"", "Because Shakespeare lived until 1616, Oxfordians question why, if he were the author, did he not eulogise Queen Elizabeth at her death in 1603 or Henry, Prince of Wales, at his in 1612. They believe Oxford's 1604 death provides the explanation.Wright, Daniel.\"The Funeral Elegy Scandal.\"  The Shakespeare Fellowship. In an age when such actions were expected, Shakespeare also failed to memorialise the coronation of James I in 1604, the marriage of Princess Elizabeth in 1612, and the investiture of Prince Charles as the new Prince of Wales in 1613.Miller, Ruth Loyd. Oxfordian Vistas.  Vol II of Shakespeare Identified, by J. Thomas Looney and edited by Ruth Loyd Miller. Kennikat Press, 1975. pp. 290–94.", "Oxfordian writers say some literary allusions imply that the playwright and poet died prior to 1609, when Shake-Speares Sonnets appeared with the epithet \"our ever-living poet\" in its dedication. They claim that the phrase \"ever-living\" rarely, if ever, referred to a living person, but instead was used to refer to the eternal soul of the deceased.Miller, Ruth Loyd.Oxfordian Vistas.  Vol II of Shakespeare Identified, by J. Thomas Looney and edited by Ruth Loyd Miller. Kennikat Press, 1975. pp. 211–14. Bacon, Derby, Neville, and William Shakespeare all lived well past the 1609 publication of the Sonnets.", "J. Thomas Looney found John de Vere, 13th Earl of Oxford is \"hardly mentioned except to be praised\" in Henry VI, Part Three; the play ahistorically depicts him participating in the Battle of Tewkesbury and being captured.Asimov, Isaac. Asimov’s Guide to Shakespeare. Vol. II. Wings book, 1970. p. 674 Oxfordians, such as Dorothy and Charlton Ogburn, believe Shakespeare created such a role for the 13th Earl because it was the easiest way Edward de Vere could have \"advertised his loyalty to the Tudor Queen\" and remind her of \"the historic part borne by the Earls of Oxford in defeating the usurpers and restoring the Lancastrians to power\". Looney also notes that in Richard III, when the future Henry VII appears, the same Earl of Oxford is \"by his side; and it is Oxford who, as premier nobleman, replies first to the king's address to his followers\"."]}, {"page": "1920 in literature", "response": ["*J. Thomas Looney – Shakespeare Identified"]}, {"page": "Gateshead", "response": ["*J. Thomas Looney – Shakespeare scholar"]}, {"page": "Swadlincote", "response": ["*J. Thomas Looney, (1870–1944), scholar who advanced the \"Oxford wrote Shakespeare\" theory, died in Swadlincote."]}, {"page": "University of Chester", "response": ["* J. Thomas Looney, deviser of the Oxfordian theory (Cert Ed, 1890–1891)The Cestrian, 2009"]}, {"page": "John Looney", "response": ["* J. Thomas Looney (1870–1944), originator of the Oxfordian theory regarding the authorship of Shakespeare's plays"]}, {"page": "John Thomas Looney", "response": ["#REDIRECT J. Thomas Looney"]}, {"page": "List of people from South Shields", "response": ["* J. Thomas Looney (1870–1944), Comtean and Shakespeare authorship theorist."]}, {"page": "Low Fell", "response": ["Other notable former residents include J. Thomas Looney, an elementary school masterAltrocchi & Whittemore, 2009: 92 whose controversial text 'Shakespeare Identified' founded the Oxfordian theory of Shakespeare authorshipShapiro, 2011 and Thomas Wilson, a local poet most famous for his 1843 work The Pitman's Pay.Wilson. T, 1843 Ruth Dodds was a prominent Labour politician in Gateshead who, along with her sisters Hope and Sylvia Dodds, funded the building of the Little Theatre Gateshead. All three lived in Low Fell their entire lives.Gateshead Blue Plaques– Madeleine Hope, Ruth & Sylvia Dodds: Gateshead Libraries. Available online (accessed 12 April 2012)"]}, {"page": "Shakespeare Fellowship", "response": ["The first Shakespeare Fellowship, originally devoted to the study of the Shakespeare authorship but endorsing no particular candidate, was founded in England in 1921 after conversations between J. Thomas Looney, the founder of Oxfordian theory, and Sir George Greenwood a prominent anti-Stratfordian who had never declared his support for any particular alternative author. Bernard Rowland Ward was its principal organiser.Wadsworth, F. The Poacher from Stratford, University of California Press, 1958, p.114. It maintained worldwide membership, chiefly in the UK and the United States. Greenwood was made president. Leading supporters of the most prominent alternative candidates were made vice-presidents, including Looney, representing the Oxfordian position, the Baconian William T. Smedley, and the Derbyite Abel Lefranc. ", "In the United States, the organisation was superseded for many years by the Shakespeare Oxford Society, founded in 1957. In 2001 a new organisation entitled the \"Shakespeare Fellowship\" was created in the United States. The group asserted that \"The Shakespeare Fellowship inherits the objectives framed by Sir George Greenwood, J. Thomas Looney, and the other founders of the first Shakespeare Fellowship, established in 1922.\"Shakespeare Fellowship Mission Statement. The Fellowship publishes a quarterly journal, Shakespeare Matters, maintains an active website, and sponsors an annual essay contest on the Shakespearean question.Niederkorn, William. \"A Historic Whodunit: If Shakespeare Didn't, Who did?\" New York Times 10 February 2002. In April 2013 the Shakespeare Fellowship issued a notice of intent to merge with the Shakespeare Oxford Society under the new title \"Shakespeare Oxford Fellowship\". Following an overwhelming 74-4 vote for unification, the new \"Shakespeare Oxford Fellowship\" was created later in the year. John Hamill was appointed president of the merged organisation.\"SF and SOS Approve Unification\" The Shakespeare Fellowship publishes The Oxfordian."]}, {"page": "George Greenwood", "response": ["In 1922 he joined with J. Thomas Looney to establish The Shakespeare Fellowship, the organisation which subsequently carried forward public discussion of the authorship question up to the 1940s."]}, {"page": "Prince Tudor theory", "response": ["J. Thomas Looney founded Oxfordian theory in his book Shakespeare Identified (1920). Looney did not include any arguments about secret marriages or hidden children. However, his theory soon gained adherents who adapted the earlier Baconian arguments to the new Oxfordian position. Looney expressed his disapproval of the development in a letter from 1933, which states that his followers Percy Allen and Bernard M. Ward were \"advancing certain views respecting Oxford and Queen Eliz. which appear to me extravagant & improbable, in no way strengthen Oxford’s Shakespeare claims, and are likely to bring the whole cause into ridicule.\"Christopher Paul, \"A new letter by J. T. Looney brought to light\", Shakespeare Oxford Newsletter, vol. 43, no. 3, pp. 8–9. PDF Ward's father had been an early supporter of Looney; Allen was a theatre critic."]}, {"page": "Charles Wisner Barrell", "response": ["He became an ardent advocate of J. Thomas Looney's theory that the works of Shakespeare were written by Edward de Vere, 17th Earl of Oxford. He wrote many essays in support of this view."]}, {"page": "Shakespeare Identified", "response": ["#REDIRECT J. Thomas Looney"]}, {"page": "Frederick A. Stokes", "response": ["* J. Thomas Looney, 1870 – 1944"]}, {"page": "Declaration of Reasonable Doubt", "response": ["*John Galsworthy (1867–1933), English novelist and playwright, winner of the 1932 Nobel Prize for literature. Best known for The Forsyte Saga and its sequels. Charles Wisner Barrell said that the late Galsworthy described Oxfordian J. Thomas Looney's Shakespeare Identified as \"the best detective story\" he had ever read. No such contemporary quotation by Galsworthy has been found.Posthumously attributed to Galsworthy in Charles Wisner Barrell (1 May 1937). \"Elizabethan Mystery Man\". Saturday Review of Literature, 16 (1): 11–15, p. 11. "]}, {"page": "Ashbourne portrait", "response": ["In 1932, Percy Allen published The Life Story of Edward de Vere as \"William Shakespeare\". Allen was a supporter of J. Thomas Looney's theory that the works of Shakespeare were written by de Vere, the 17th Earl of Oxford. He argued that the features of the man in the Ashbourne portrait corresponded to those of de Vere and that the costume suggested a date earlier than 1611. He believed that the portrait dated from 1597, but had later been retouched as part of \"an elaborate plot\"."]}]}}