{"wiki_id": "http://www.wikidata.org/entity/Q3809614", "itemLabel": "John Shipley", "itemDescription": "British poker player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Shipley", "wikipedia_page": {"main": "John Shipley (born 1960?) is an English professional poker player from Solihull, West Midlands.\nAmongst his money finishes at the World Series of Poker (WSOP) are a 7th-place finish in the 2002 $10,000 no limit hold'em main event, where he earned $125,000. He had also finished in the money of the same event at the 2000 WSOP.\nFollowing this, John was invited onto the Late Night Poker television series in its sixth season, but was unable to progress through his heat which featured Ken Lennaárd, Victoria Coren, Tony Bloom, Gary Jones, Dave Ulliott, and Ross Boatman.\nIn October 2004 he won 1st prize in the European Poker Tour (EPT) London event, taking home £200,000 ($359,479) in winnings.\nAs of 2008, his total live tournament winnings exceed $820,000.\nShipley plays online poker at PokerStars under the alias \"Sapphire1\".", "link_mentions": [{"page": "Dave Ulliott", "response": ["Ulliott began playing poker with his parents as a young child and later learned three card brag at the age of 16, after being introduced to Hull's Fifty-One Club casino. By the time of his second marriage, Ulliott was organising poker games in the back of his shop and dominating the home games of others to the extent that people stopped telling him where they were being held. At the end of 1990, he met Gary Whitaker, a cafe manager from Wakefield, at Napoleon's Casino, Leeds. They travelled together to poker games six nights a week, and Whitaker placed bets for Ulliott after he was banned from all of William Hill's betting shops for successfully gambling £4,000 up to £70,000. Whitaker went on to become Ulliott's regular driver as he took part in a regular game with Dave Colclough, John Shipley and Lucy Rokach, and held a 10% stake in his action."]}, {"page": "European Poker Tour", "response": ["| John Shipley"]}, {"page": "2002 World Series of Poker", "response": ["| John Shipley", "| John Shipley"]}, {"page": "Noah Boeken", "response": ["In October 2004, Boeken made the final table of the European Poker Tour (EPT) event in London won by professional John Shipley. Boeken made a second EPT final table in January 2005 at the Scandinavian Open in Copenhagen where he defeated professional and Hendon Mob member Ram Vaswani in the final heads-up confrontation. Boeken has cashed six times at the EPT and made two final tables."]}, {"page": "Late Night Poker series 6 results", "response": ["* John Shipley"]}, {"page": "John Falconer (poker player)", "response": ["In October 2004, Falconer finished runner-up to John Shipley in the European Poker Tour (EPT) first season London event, winning £117,000. He finished on the television bubble for the EPT Dublin event later the same month."]}, {"page": "2006 World Series of Poker results", "response": ["| 9th || John Shipley || $60,349"]}, {"page": "2008 World Series of Poker results", "response": ["| align = \"center\"| 9th || align = \"center\"|John Shipley || align = \"center\"|$"]}, {"page": "2010 Dissolution Honours", "response": ["* John Shipley  - leading Local Government Councillor in Newcastle upon Tyne."]}, {"page": "2011 World Series of Poker results", "response": ["| align = \"center\"| 3rd || align = \"center\"| John Shipley || align = \"center\"| $369,575"]}, {"page": "Index of poker articles", "response": ["* John Shipley"]}, {"page": "Shipley (surname)", "response": ["*John Shipley (born 1960), English poker player", "*John Shipley, Baron Shipley (born 1946), OBE, a Liberal Democrat peer in the House of Lords"]}, {"page": "John Shipley (disambiguation)", "response": ["John Shipley (born c. 1960), is an English poker player.", "John Shipley may also refer to:", "*John Shipley, Baron Shipley, politician", "*John Shipley, former musician in The Specials", "*John Shipley, character in The Stone Angel (film)"]}, {"page": "Shipley, John", "response": ["#redirectJohn Shipley"]}]}}