{"wiki_id": "http://www.wikidata.org/entity/Q3807500", "itemLabel": "Jay Darlington", "itemDescription": "English keyboardist, best known as member of Kula Shaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Jay_Darlington", "wikipedia_page": {"main": "Jay Peter Darlington (born 3 May 1968 in Sidcup, London) is an English keyboardist, best known as a member of Kula Shaker. He went on to work as a touring member of Oasis and is currently a member of the Totnes, Devon based prog band, Magic Bus.", "link_mentions": [{"page": "Sidcup", "response": ["* Jay Darlington (1968-), musician (former keyboardist for the band Kula Shaker and currently a member of the band Magic Bus), born in Sidcup"]}, {"page": "Oasis (band)", "response": ["After the album's release, the band embarked on a successful world tour that was once again filled with incidents. In late summer 2002, while the band were on tour in the US, Noel, Bell and touring keyboardist Jay Darlington were involved in a car accident in Indianapolis. While none of the band members sustained any major injuries, some shows were cancelled as a result. In December 2002, the latter half of the German leg of the band's European tour had to be postponed after Liam Gallagher, Alan White and three other members of the band's entourage were arrested after a violent brawl at a Munich nightclub. The band had been drinking heavily and tests showed that Liam had used cocaine. Liam lost two front teeth and kicked a police officer in the ribs, while Alan suffered minor head injuries after getting hit with an ashtray. Two years later Liam was fined around £40,000.Independent News article . Retrieved 9 March 2008. The band finished their tour in March 2003 after returning to those postponed dates.", "* Jay Darlington – keyboards (2002–2009)"]}, {"page": "Noel Gallagher", "response": ["Gallagher's first concerts without Oasis were announced on 1 February 2010 to be at London's Royal Albert Hall on 25 and 26 March 2010 for Teenage Cancer Trust . He was supported by the Courteeners and Plan B respectively. Terry Kirkbride and Gem Archer joined him on-stage, as did Jay Darlington, all of whom Gallagher had previously worked with while he was still a member of Oasis. He played a mostly acoustic set, and played a variety of Oasis album tracks and B-sides. It was almost the same set he played at the Royal Albert Hall in 2007. Gallagher also joined friend Paul Weller onstage in London on 21 April 2010, and played the Oasis song \"Mucky Fingers\" and a song he co-wrote with Weller, \"Echoes Round the Sun\"."]}, {"page": "Kula Shaker", "response": ["The Objects of Desire disbanded acrimoniously in early 1993, after which, Mills went on a spiritual pilgrimage, backpacking around India. The trip had a profound effect on the guitarist, fostering a deep interest in Indian culture and Hinduism. Upon returning to the UK he formed a new band named The Kays, with Bevan, Winterhart, and Mills' cousin Saul Dismont (son of the Bermudian politician Russell Dismont) on vocals. The band's debut live performance was at the 1993 Glastonbury Festival. Within a year, Dismont had left the band, only to be replaced by organist Jay Darlington, who had previously been a member of several mod revival bands. After two years of touring and recording, The Kays elected to change their name and musical direction.", "Kula Shaker's reformation has its origins in sessions for a charity album made with the New Braj Village School (a private school in Badger, California, for young people which includes as part of the curriculum teachings about Krishna and devotional music). The album School of Braja was recorded in 2004 and finally saw release in late 2006. Mills, who masterminded the album, arranged not only that the Jeevas play on two tracks, but he also got in touch with his old bandmate, Alonza Bevan. The two worked on a song together for the album, \"Braj Mandala\", to which Paul Winterhart added drums. Jay Darlington was asked to be part of the sessions, but declined the opportunity. At the time of the recording, this was announced on the official Jeevas website as Kula Shaker having reformed to contribute a song to the album and was referred to by Mills as a Kula Shaker reunion in subsequent interviews. Additionally, the School of Braja album credits officially state that Kula Shaker appear on the track \"Braj Mandala\". The sessions for the track went so well that Mills and Bevan began writing together again and making plans for a full-on Kula Shaker comeback that would encompass live touring and the further release of new material. A new band website was also commissioned.", "*Jay Darlington – keyboards, piano, organ, mellotron (1995–1999)", "  bar:Darlin   text:\"Jay Darlington\""]}, {"page": "Big Brother Recordings", "response": ["The logo of the label, pictured above, appeared on the back of the white piano that Jay Darlington played at the Oasis concerts. It can be seen on the live performance second disc of Lord Don't Slow Me Down."]}, {"page": "Crispian Mills", "response": ["During 2004 The Jeevas and a reformed Kula Shaker (without original keyboardist Jay Darlington) contributed to a charity album with the Californian School of Braja, which Mills masterminded. The sessions with Kula Shaker went so well that the band decided to reform permanently. 2006 saw their return to the live scene in the UK with the addition of new keyboardist Harry Broadbent, and the release of an EP Revenge of the King. Their third album Strangefolk was released in 2007."]}, {"page": "K (album)", "response": ["*Jay Darlington – Organ, Mellotron, Piano."]}, {"page": "List of keyboardists", "response": ["*Jay Darlington (Kula Shaker, Oasis)"]}, {"page": "Shower Your Love", "response": ["The A-side and \"Goodbye Tin Terriers\" were co-produced by Bob Ezrin with Crispian Mills. \"Sound of Drums\" was recorded live for Radio 1 by James Birtwhistle, produced by Sam Cunningham and mixed by Graham Pattison. The humorous \"Dancing Flea\" was written and recorded by Jay Darlington. \"Light of the Day\" has no producer credit on either this single or Kollected.", "# \"The Dancing Flea (from Jay Darlington Plays, 'The Dancing Flea')\"", "# \"The Dancing Flea (from Jay Darlington Plays, 'The Dancing Flea')\""]}, {"page": "List of people from Kent", "response": ["*Jay Darlington (born 1968) – keyboardist for the band Kula Shaker"]}, {"page": "Dig Out Your Soul", "response": ["* Jay Darlington – mellotron and electronics on \"Falling Down\", "]}, {"page": "Falling Down (Oasis song)", "response": ["*Jay Darlington - electronics, mellotron"]}, {"page": "Standing on the Edge of the Noise", "response": ["**Jay Darlington - keyboard"]}, {"page": "Darlington (surname)", "response": ["* Jay Darlington, (born 1968) English keyboardist"]}]}}