{"wiki_id": "http://www.wikidata.org/entity/Q3809633", "itemLabel": "John Stewart-Murray, 8th Duke of Atholl", "itemDescription": "British Army general (1871-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Stewart-Murray,_8th_Duke_of_Atholl", "wikipedia_page": {"main": "John George Stewart-Murray, 8th Duke of Atholl,  (15 December 1871 – 16 March 1942), styled Marquess of Tullibardine until 1917, was a British soldier and Unionist politician.\n\n", "link_mentions": [{"page": "Hirohito", "response": ["The departure of Prince Hirohito was widely reported in newspapers. The Japanese battleship Katori was used and departed from Yokohama, sailed to Naha, Hong Kong, Singapore, Colombo, Suez, Cairo, and Gibraltar. It arrived in Portsmouth two months later on 9 May, and on the same day they reached the British capital London. He was welcomed in the UK as a partner of the Anglo-Japanese Alliance and met with King George V and Prime Minister David Lloyd George. That evening, a banquet was held at Buckingham Palace and a meeting with George V and Prince Arthur of Connaught. George V said that he treated his father like Hirohito, who was nervous in an unfamiliar foreign country, and that relieved his tension. The next day, he met Prince Edward (the future Edward VIII) at Windsor Castle, and a banquet was held every day thereafter. In London, he toured the British Museum, Tower of London, Bank of England, Lloyd's Marine Insurance, Oxford University, Army University, and Naval War College. He also enjoyed theater at the New Oxford Theatre and the Delhi Theatre.小田部雄次 『天皇・皇室を知る事典』211頁（東京堂出版・2007年） At Cambridge University, he listened to Professor Tanner's lecture on \"Relationship between the British Royal Family and its People\" and was awarded an honorary doctorate degree. He visited Edinburgh, Scotland, from the 19th to the 20th, and was also awarded an Honorary Doctor of Laws at the University of Edinburgh. He stayed at the residence of John Stewart-Murray, 8th Duke of Atholl, for three days. On his stay with Stuart-Murray, the prince was quoted as saying, \"The rise of Bolsheviks won't happen if you live a simple life like Duke Athol.\""]}, {"page": "List of Knights and Ladies of the Thistle", "response": ["| John Stewart-Murray, 8th Duke of Atholl"]}, {"page": "National War Museum", "response": ["Various movements proposing museums dedicated to warfare arose during World War I, and the consensus amongst those involved was that they should be regional in nature. Preliminary ideas for a Scottish museum were drawn up in 1917 by Alexander Ormiston Curle, curator of the National Museum of Scotland, under advice from organisers in London, as well as a civic committee of the Edinburgh council, set up by Lord Provost John Lorne MacLeod. John Stewart-Murray, 8th Duke of Atholl, was also a supporter of the idea. The committee worked through 1918 and 1919 on ideas for the museum, including plans for procuring exhibits. After the end of the war, however, priority was given to the construction of the Scottish National War Memorial, which opened in 1927, and the museum project was put on hold."]}, {"page": "Lord Lieutenant of Perthshire", "response": ["* John Stewart-Murray, 8th Duke of Atholl 15 March 1917 – 15 March 1942"]}, {"page": "Murray (surname)", "response": ["*John Stewart-Murray, 8th Duke of Atholl (1871–1942)"]}, {"page": "John George Stewart-Murray, 8th Duke of Atholl", "response": ["#REDIRECT John Stewart-Murray, 8th Duke of Atholl"]}, {"page": "John Stewart-Murray, 7th Duke of Atholl", "response": ["The couple had four sons (of whom the eldest died in infancy) and three daughters (all of whom survived to adulthood), including the Scottish folklorist Lady Evelyn Stewart Murray, and the collector of early Scottish music, Lady Dorothea Ruggles-Brise. After his death, the dukedom passed to his second but eldest surviving son, John Stewart-Murray, 8th Duke of Atholl, and later to his third son, Major James Stewart-Murray, 9th Duke of Atholl also known as James Murray. The 7th Duke has no known surviving descendants."]}, {"page": "John Stewart", "response": ["* John Stewart-Murray, 8th Duke of Atholl (1871–1942), Scottish soldier and Conservative politician"]}, {"page": "James Stewart-Murray, 9th Duke of Atholl", "response": ["Stewart-Murray was the fourth and youngest son of John Stewart-Murray, 7th Duke of Atholl, and Louisa Moncreiffe, daughter of Thomas Moncreiffe of that Ilk, 7th Baronet. He was educated at Eton and commissioned a second lieutenant in the 1st Battalion of the Queen's Own Cameron Highlanders on 3 January 1900. The following month, he left for South Africa to fight in the Second Boer War, where he was mentioned in despatches and won two medals and six clasps. He later fought in the First World War, where he was wounded, captured, and held as a Prisoner of War, and resigned from the army as a major.thepeerage.com James Thomas Stewart-Murray, 9th Duke of Atholl He became a Freemason in Lodge St. John, No. 14 (now the United Lodge of Dunkeld) at the same time as his elder brother George in 1914. In 1942, aged 62, he succeeded his elder brother John Stewart-Murray, 8th Duke of Atholl in the dukedom."]}, {"page": "Scottish National War Memorial", "response": ["Proposals for a Scottish National War Memorial were put forward in 1917, during the First World War, by John Stewart-Murray, 8th Duke of Atholl, and Captain George Swinton of Kimmerghame. Sir Robert Lorimer, the architect of the Order of the Thistle's Thistle Chapel in St Giles' Cathedral and one of the architects involved in the Imperial War Graves Commission,Hussey, 1931; Dictionary of National Biography, 1937 was appointed in 1919, but opposition to a large-scale monument arose from the Cockburn Association and others concerned with the castle's heritage. A more modest scheme to remodel the North Barrack Block was finally agreed in 1923, and the memorial was formally opened on 14 July 1927 by the Prince of Wales (later Edward VIII). After the Second World War, 50,000 names were added to the rolls of honour. Names continue to be added from successive conflicts, though the memorial itself has been left unchanged."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*John Stewart-Murray, 8th Duke of Atholl; MP for Perthshire West (1910–1917)"]}, {"page": "JG Stewart-Murray", "response": ["#REDIRECT John Stewart-Murray, 8th Duke of Atholl"]}]}}