{"wiki_id": "http://www.wikidata.org/entity/Q381339", "itemLabel": "Dudley E. Littlewood", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dudley_E._Littlewood", "wikipedia_page": {"main": "Dudley Ernest Littlewood (7 September 1903, London –\n6 October 1979, Llandudno) was a British mathematician known for his work in group representation theory.\nHe read mathematics at Trinity College, Cambridge where his tutor was John Edensor Littlewood (they were not related).  He was a lecturer at University College, Swansea from 1928 to 1947, and in 1948 took up  the chair of mathematics at University College of North Wales, Bangor, retiring in 1970.\nHe worked on invariant theory and group representation theory, especially of the symmetric group, often in collaboration with Archibald Read Richardson of Swansea.  They introduced the immanant of a matrix, studied Schur functions and developed the Littlewood–Richardson rule for their multiplication.  Littlewood was also interested in the application of representation theory to quantum mechanics.", "link_mentions": [{"page": "Littlewood", "response": ["* Dudley E. Littlewood, British mathematician"]}, {"page": "Immanant", "response": ["In mathematics, the immanant of a matrix was defined by Dudley E. Littlewood and Archibald Read Richardson as a generalisation of the concepts of determinant and permanent."]}, {"page": "Alternatives to general relativity", "response": ["| 1953 || Dudley E. Littlewood || ||Scalar field"]}, {"page": "Archibald Read Richardson", "response": ["Richardson collaborated with Dudley E. Littlewood on invariants and group representation theory.  They introduced the immanant of a matrix, studied Schur functions and developed the Littlewood–Richardson rule for their multiplication."]}, {"page": "Hall–Littlewood polynomials", "response": ["They were first defined indirectly by  Philip Hall using the Hall algebra, and later defined directly by Dudley E. Littlewood (1961)."]}, {"page": "Dudley Littlewood", "response": ["#Redirect Dudley E. Littlewood"]}, {"page": "Plethysm", "response": ["In algebra, plethysm is an operation on symmetric functions introduced by Dudley E. Littlewood, who denoted it by {λ} ⊗ {μ}. The word \"plethysm\" for this operation (after the Greek word πληθυσμός meaning \"multiplication\") was introduced later by , who said that the name was suggested by M. L. Clark."]}, {"page": "Dudley Ernest Littlewood", "response": ["#redirectDudley E. Littlewood"]}]}}