{"wiki_id": "http://www.wikidata.org/entity/Q381543", "itemLabel": "Stephen Mulhern", "itemDescription": "British entertainer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Mulhern", "wikipedia_page": {"main": "Stephen Daniel Mulhern (born 4 April 1977) is an English television presenter, magician, and comedian. He began his television career on CITV, appearing in the children's shows Finger Tips (2001–2008) and Tricky TV (2005–2010). Mulhern has presented various television shows for ITV, including Britain's Got More Talent (2007–2019), Animals Do the Funniest Things (2007–2011), This Morning's Hub (2011–2014), Catchphrase (2013–present), Big Star's Little Star (2013–2018), In for a Penny (2019–present) and Rolling In It (2020–present). He also co-hosted the Sunday breakfast show on Heart Radio, alongside Emma Willis, and the 'Ant vs Dec' segment on Saturday Night Takeaway.", "link_mentions": [{"page": "Coronation Street", "response": ["In December 2010, ITV made a few special programmes to mark the 50th anniversary. Coronation Street Uncovered: Live, hosted by Stephen Mulhern was shown after the episode with the tram crash was aired on ITV 2. On 7 and 9 December a countdown on the greatest Corrie moments, Coronation Street: 50 Years, 50 Moments, the viewers voted \"The Barlows at Alcoholics Anonymous\" as the greatest moment. On 10 December Paul O'Grady hosted a quiz show, Coronation Street: The Big 50 with three teams from the soap and a celebrity team answering questions about Coronation Street and other soaps. Also, Come Dine with Me and Celebrity Juice aired Coronation Street specials in the anniversary week."]}, {"page": "Through the Keyhole", "response": ["| 8 || Jimmy CarrStephen MulhernClaudia Winkleman || Russell GrantJack OsbourneJo Wood || 24 December 2015 || Under 1.91", "| 6 || John ThomsonKym MarshStephen Mulhern  || Harry RedknappGemma CollinsAntony Worrall Thompson || 4 February 2017 || 3.65", "| 4 || Stephen MulhernRochelle HumesLouis Walsh || Gloria HunnifordBobby DavroJanice Dickinson || 27 January 2018 ||"]}, {"page": "List of game show hosts", "response": ["| Stephen Mulhern || United Kingdom || Globo Loco (2003–05), Magic Numbers (2010), The Big Quiz (2011–12; 2016–), Catchphrase (2013–), Big Star's Little Star (2013–), Get Your Act Together (2015), Reality Bites (2015), Pick Me! (2015), Go for It (2016), The Next Great Magician (2016–), In for a Penny (2019–)"]}, {"page": "Minehead", "response": ["*Stephen Mulhern (born 1977), television presenter, was born in Minehead, although he also claims he was born in Stratford, East London."]}, {"page": "United Kingdom in the Junior Eurovision Song Contest 2004", "response": ["The final, broadcast on digital channel ITV2, was held on 4 September 2004 and was presented by Holly Willoughby, Stephen Mulhern and Michael Underwood. Regional televoting was held to select the winner from the 8 competing acts."]}, {"page": "Holiday camp", "response": ["* Stephen Mulhern – presenter and game show host"]}, {"page": "Heart Kent", "response": ["* Stephen Mulhern"]}, {"page": "Louis Walsh", "response": ["*In 2009, Walsh appeared on the ITV show Anonymous hosted by Stephen Mulhern", "*In December 2015, Walsh appeared as a contestant on Celebrity Catchphrase hosted by Stephen Mulhern", "*In January 2020, Walsh appeared as a contestant on Celebrity Catchphrase for a second time which was hosted by Stephen Mulhern"]}, {"page": "Faye Tozer", "response": ["She appeared on a celebrity special of the classic game show Catchphrase, with Sir Chris Hoy, Martine McCutcheon and hosted by Stephen Mulhern all trying to guess the familiar phrases."]}, {"page": "The Paul O'Grady Show", "response": ["On 18 November 2013, O'Grady was taken ill with a suspected angina attack meaning he was unable to present the live show from that day. He was replaced by singer and entertainer Michael Ball for that episode and presenter and magician Stephen Mulhern the following day. Emma Willis hosted on 20 November, followed by Vernon Kay the next day, and finally comedian Jo Brand guest hosted on 22 November. On 25 November 2013, O'Grady returned and thanked the five stand-ins for filling in for him over the previous week. He paid particular thanks to Michael Ball who found out he was to host with only 40 minutes' notice.", "| 2 || 19 November 2013 || Stephen Mulhern "]}, {"page": "Holly & Stephen's Saturday Showdown", "response": ["Ministry of Mayhem was first broadcast on 10 January 2004 and aired weekly on a Saturday morning on ITV. The programme featured a mix of cartoons, celebrity guests, live music and phone-in competitions -  with surreal characters, crazy games and a load of gunge thrown in for good measure. It was initially presented by CITV presenters Stephen Mulhern, Holly Willoughby and Michael Underwood."]}, {"page": "SMTV Live", "response": ["* \"Eat My Goal\" - A phone-in competition in which viewers chose a celebrity, who would proceed to take penalties against McPartlin in goal while Donnelly hosted the contest. The format was amended with Dowling as the goalkeeper in 2001, with Daly and later Stephen Mulhern hosting the competition. In 2003, the format was changed to a different celebrity each week representing two teams taking it in turns to be goalkeeper.", "SMTV Live was originally hosted by Byker Grove stars Ant & Dec alongside former fashion model Cat Deeley. In 2001, Ant & Dec left the show to present Saturday night talent show Pop Idol and were replaced by Hollyoaks star James Redmond. Redmond's stint at SMTV Live lasted just three months however, after show bosses decided he had not settled into the role. Deeley left the show in 2002 to focus on presenting BBC talent show Fame Academy, leaving SMTV with none of its original presenters. For the remainder of the programme, it was hosted by a string of other people, including Steps members Ian \"H\" Watkins and Claire Richards, Big Brother winner Brian Dowling, Tess Daly all who presented from 2002 until all 4 eventually left by 2003. Comedian Des Clarke, New Zealand actress Shavaughn Ruakere and magician Stephen Mulhern presented the show for its final run when it was renamed SMTV:Gold in which it focused on showing highlights of the best bits of the past 5 years of the show, mainly due to declining ratings since the departure of the original presenters.", "Falling viewing figures during 2003 led to the programme's axing at the end of the year. The programme marked the end of its five-year run with a series of SMTV Gold specials featuring highlights from the show and cartoons, presented by Stephen Mulhern and Des Clarke with different celebrity co-hosts each week. The Gold series ended on 20 December 2003 with the very last SMTV Live programme airing on Saturday 27 December 2003, recorded at the Riverside Studios in Hammersmith."]}, {"page": "This Morning (TV programme)", "response": ["The 'Hub' interactive segment was heavily featured from 2010 until 2014. Presenters included Jeff Brazier (2013–14), Jenni Falconer (2013–14), Stephen Mulhern (2011–2014) Rylan Clark (2013–14), Emma Willis (2012–2014), Coleen Nolan (2010–2012), Samanthi Jayawardena (2010–2012) and Matt Johnson (2010–2013).ITV expands cross-platform offering for This Morning  New Media Age, 2 September 2010", "On 3 October 2013, This Morning celebrated its 25th anniversary. The programme was broadcast live from its original home at Albert Dock in Liverpool with presenters Phillip Schofield, Eamonn Holmes, Holly Willoughby, Alison Hammond  and Ruth Langsford being joined by original presenters Richard Madeley and Judy Finnigan. Numerous historical clips of the show were aired, including Gene Pitney's miming gaffe from 1989. Keith Lemon presented the weather from the show's famous floating weather map, while Stephen Mulhern presented various items including 'The Hub Sub' (the 'Hub' on a submarine). There was speculation concerning whether Fern Britton would return for the 25th anniversary; however, it was confirmed eight days beforehand that she would not."]}, {"page": "Katherine Jenkins", "response": ["Jenkins started 2010 by appearing as one of two mentors on ITV1s prime time Friday night show, Popstar to Operastar. Later in the year, she appeared on the ITV1 game show Magic Numbers, acting as magician and show host Stephen Mulhern's assistant in the UK TV premiere of an illusion in which she was sawed in half inside a clear box. She also appeared in the 2010 Christmas Special of Doctor Who, \"A Christmas Carol\", in which she played Abigail Pettigrew—her first major acting role. Jenkins appeared as the featured singer on 11 April 2011 episode of ABC's show Dancing with the Stars (DWTS) singing \"Con te partirò\" (Time to Say Goodbye) and \"O mio babbino caro\". She later sang \"The Flower Duet\" with DWTS regular Beverley Staunton."]}, {"page": "Holly Willoughby", "response": ["Willoughby's first role as a children's entertainer came when she rejoined CITV in 2004 to co-present the entertainment show Ministry of Mayhem which aired on Saturday mornings. On this programme she met her future husband Dan Baldwin, one of the show's producers. In 2006, the show's title was changed to Holly & Stephen's Saturday Showdown in order to reflect the popularity of its co-presenters, Willoughby and Stephen Mulhern."]}, {"page": "Tonight at the London Palladium", "response": ["| 1 || 14 September 2014 || Stephen Mulhern || Bryan Adams, Little Mix, Alfie Boe, Alan Davies, Les Beaux Freres and David and Dania"]}, {"page": "Catchphrase (British game show)", "response": ["On 27 August 2012, a revived pilot was made by STV Studios and Digital Rights Group with new host Stephen Mulhern. The original format remains, although there are now three contestants instead of two, and the show has also been updated with new 3D graphics and a new concluding game. On 9 October 2012, ITV announced that it had ordered a full series after a successful pilot.", "In the Stephen Mulhern era, there are 15 numbered squares in the form of a pyramid (with 15 at the top) with each row, starting at the bottom, being worth a higher amount of money (£2,500/£5,000/£10,000/£25,000/£50,000). The bottom level contains the first five squares, the second contains four, and so on. Number 11 in the middle is starred and correctly answering it awards a bonus prize, which is usually a luxury holiday. (In the celebrity specials, correctly answering this catchphrase doubles the amount of money won by the other two celebrities for their chosen charities.) Starting from the bottom level, the winning player has 60 seconds to reach the highest level possible. Each square still contains a catchphrase; getting a catchphrase in a level correctly clears that level and allows the player to move to the next level. At the end of the round, the player receives the prize money of the level they have last cleared, plus the bonus prize (if Square 11 is cleared), along with their main game winnings.", "Mr. Chips returned to appearing in the Catchphrases again throughout Mark Curry's series in 2002, alongside the family, and he was also brought back for the current revival series hosted by Stephen Mulhern."]}, {"page": "Emma Barton", "response": ["On 14 November 2008, Barton sang live for Children in Need in the BBC studios in London. She starred in the title role of Snow White in the Marlowe Theatre's Canterbury pantomime from December 2008 – January 2009 alongside Stephen Mulhern. From March to November 2009 she was touring the UK in the stage production of Chicago, alongside Jimmy Osmond and Twinnie Lee Moore, playing Roxie Hart."]}, {"page": "List of European advertising characters", "response": ["| Tesco Stores Ltd || Tommy Tesco and Flynn the Frog || 2011–Present || Tommy is voiced by Stephen Mulhern"]}, {"page": "Catchphrase (American game show)", "response": ["| Roy WalkerNick WeirMark CurryStephen Mulhern"]}, {"page": "Ben Jones (DJ)", "response": ["In 1997, he spent time as a DJ at the Capital Radio Cafe in 1997. During this time, he was mentored by Chris Tarrant, a man Jones professes to admire the most, \"because of his longevity, consistency and talent\". Under the management of programme director Paul Jackson, and the connections with Tarrant, soon Jones broke into television as he had desired. As a child, he had been inspired by children's radio star Andy Crane and sought to be a presenter himself. He soon became a presenter on the British version on The Disney Channel in 1998, presenting the station's first-ever breakfast show and a live interactive show. From 1999 he worked as a presenter CITV, fronting programmes such as The Top Ten of Everything, It's a Mystery and CITV Afternoons along with other presenters such as Stephen Mulhern and Danielle Nicholls."]}, {"page": "Glenn Hugill", "response": ["He presented the UK version of The Mole and was the executive producer of Channel 4 game show Deal or No Deal. It was suggested (by Richard Osman in The Metro, 23 February 2015) that he was also the mysterious individual known on the show as \"The Banker\" and on 19 October 2015, it was confirmed on This Morning by Stephen Mulhern.  Whilst Stephen was talking about his new show Pick Me!, he mentioned that Glenn was the producer of this new show and The Banker behind Deal or No Deal  Metro also describes this as \"a little disappointing\", as it was considered predictable as \"it makes sense that the person offering contestants large sums of money is the producer\". He has produced or created many other game shows as well as Deal or No Deal, such as Playing It Straight, Beauty and the Geek, Cash Cab, Pointless, Two Tribes , Pick Me!, Divided, and most recently 5 Gold Rings, Moneyball and Sitting On A Fortune.   "]}, {"page": "CITV", "response": ["Presentation for the service was moved in 1997 when Central moved into new, smaller studios at Gas Street Studios in Birmingham, which continued until Monday 25 May 1998, when a new in-vision service was introduced by the new controller of ITV children's output, Nigel Pickard. Steven Ryde became a producer with Stephen Mulhern and Danielle Nicholls becoming the new presentation team. A new logo was introduced (with traces predecessors), and henceforth the service was referred to as CiTV, until the 2006 re-brand, initially being broadcast from Studio B at Central's Gas Street Studios.", "* Stephen Mulhern (May 1998 – August 2002)"]}, {"page": "Shaun Williamson", "response": ["Stage roles have included Monty the DJ in the West End run and UK tour of Saturday Night Fever, and appearing at Canterbury's Marlowe Theatre from December 2003 to January 2004 in a pantomime production of Snow White and the Seven Dwarfs, alongside Toyah Willcox. In 2006 he starred in the pantomime Dick Whittington at The Playhouse in Weston-super-Mare. He returned to the Marlowe Theatre from December 2007 to January 2008, in Aladdin, alongside Stephen Mulhern. During 2008 he played Nathan Detroit in the touring production of Guys and Dolls, having already appeared in the part in the West End. In 2008–2009, he was again appearing in Aladdin, this time at the Wyvern Theatre, Swindon. In May 2006, Williamson played the lead in the play Road to Nirvana at The King's Head Theatre London and in October 2006, appeared in a sketch as part of the charity benefit The Secret Policeman's Ball which was staged at the Royal Albert Hall."]}, {"page": "Dancing on Ice", "response": ["During the shows first two series, it ran two supplementary programmes – Dancing on Ice Defrosted, presented by Stephen Mulhern, and Dancing on Ice Exclusive (or Dancing on Ice Extra during series 1) presented by Andi Peters alongside Andrea McLean in series 1 and Ben Shephard in series 2. In mid-2007, it was announced that both shows would not return to accompany the third series as the audience attracted was out of ITV2's target range. As part of ITV's new revamped schedule at the start of 2008, from the third series, the show aired on a Sunday night and featured updated music and new titles as well as redesigned graphics. The series 3 finale was a massive draw, pulling an average 11.7 million viewers (up from 9.6 million the previous year) peaking at 12.6 million viewers over the two-hour slot, up over a million from series 2.", "Like many other reality TV shows, Dancing on Ice has had a number of supplementary shows. The first was Dancing on Ice Defrosted. It was presented by Stephen Mulhern and aired on ITV2 immediately after the main ITV show and again after the results show. The show featured opinions from celebrity guests and past contestants as well as from Torvill and Dean, the judges, presenters and competitors. Judge Nicky Slater also offered in-depth analysis of various performances using the latest video technology that the judges use to judge performances."]}, {"page": "Tricky TV", "response": ["Tricky TV is a British television show that aired on CITV from 2005 to 2010, presented by magician Stephen Mulhern. The show featured street magic, pranks, illusions, and step-by-step how-to guides for magic tricks.", "The show was produced by The Foundation, the same company that produced Finger Tips, Globo Loco and Holly & Stephen's Saturday Showdown, which also starred Stephen Mulhern."]}, {"page": "Deal or No Deal (British game show)", "response": ["Some sources have speculated that the Banker is really former Coronation Street actor and host of The Mole, Glenn Hugill, who works as part of the show's production team. Edmonds denied these claims in Heat magazine in July 2006. However, in 2015, these claims were later proven to be accurate by Richard Osman and Stephen Mulhern, who confirmed that Hugill is the Banker."]}, {"page": "Doug McKenzie (magician)", "response": ["*The Magic Show Story (2015) Starring Paul Daniels and Stephen Mulhern (Doug McKenzie as Himself)"]}, {"page": "Celebrities Under Pressure", "response": ["*Show 4 - Stephen Mulhern, Linda Robson, Jenni Falconer"]}, {"page": "Soccer Aid", "response": ["* Stephen Mulhern", "|CM ||?||Stephen Mulhern || ||   "]}, {"page": "Globo Loco", "response": ["Globo Loco is a British game show that aired on ITV from 16 May 2003 to 5 August 2004 and is hosted by Stephen Mulhern."]}, {"page": "Finger Tips", "response": ["The presenters were Stephen Mulhern and Fearne Cotton (later replaced by Naomi Wilkinson in series 4–5 and Tim Dixon for series 5). The show is about creating things out of household items and aimed at a child audience. The programme manager was Wendy Larkin."]}, {"page": "Butlins Redcoats", "response": ["A number of entertainers have been Redcoats in the early stages of their careers. Becoming a Redcoat is seen as a way into show business, as it allows a performer to become established as a professional for the purposes of joining the Equity trade union which then allows the performer to work freely throughout the industry. In exceptional cases a Redcoat may even become notable whilst in the employment of Butlins; Stephen Mulhern notably performed on the Royal Variety Performance in 1997 whilst still working as a Redcoat, and in the past notable singers have had chart hits. Clinton Ford, for instance, reached number 27 in 1959 with \"Old Shep\" just after completing his final summer season at Pwllheli. However, prior to this in 1957 Russ Hamilton recorded a number 2 hit in the UK \"We Will Make Love\" (held off the top spot by Elvis Presley and \"All Shook Up\"). Shortly after this he recorded a number 4 hit in the US Billboard with the song \"Rainbow\", and all the time Hamilton continued to entertain Butlins guests. It was Billy Butlin himself who asked Hamilton to record \"We Will Make Love\" for the benefit of Butlins guests."]}, {"page": "Theatre Royal, Nottingham", "response": ["*2010 Aladdin with Stephen Mulhern and Gray O'Brien."]}, {"page": "Sooty Heights", "response": ["# \"The Great Supremo\" (15 November 1999)Guest Starring: Stephen Mulhern as The Great Supremo"]}, {"page": "1977 in the United Kingdom", "response": ["*4 April – Stephen Mulhern, musician and television presenter"]}, {"page": "Tim Dixon", "response": ["Summer 2008 saw Dixon land arguably his biggest break to date - replacing Stephen Mulhern as the new presenter of 30 episodes of the children's make-and-do show Finger TipsFinger Tips official website – which was transmitted from early September on ITV1, the CITV Channel and Super RTL in Germany."]}, {"page": "Ieuan Rhys", "response": ["He has also appeared in many pantomimes including Snow White at The Coliseum, Aberdare and tours with Stan Stennett in Cinderella and Owen Money in three productions of Aladdin, Jack and the Beanstalk and Cinderella (directed by Michael Bogdanov). He has played Dame twice for the Welsh-language panto's Hansel & Gretel and Aladdin with Martyn Geraint. Christmas 2012, Rhys appeared in Sleeping Beauty at the New Marlowe Theatre in Canterbury with Gareth Gates and Toyah Willcox and for the 2013 Season he appeared alongside Stephen Mulhern in Cinderella at The Hawth Theatre Crawley and in 2014–15, he played King Dafydd in The Octagon Theatre, Yeovill's Jack & The Beanstalk. In 2015–16, he appeared alongside Coronation Street's Chris Gascoyne in Aladdin at The Lyceum Theatre in Sheffield. In the 2017–18, pantomime season he appeared in Sleeping Beauty at the Grove Theatre, Dunstable, as King Cuthbert, alongside, Sally Lindsay and John Partridge. 2018–19 saw Ieuan with CBeebies' Katrina Bryan and Sam Rabone in Dick whittington at the Garrick Theatre, Lichfield and for the 2019–20 season he played dame for the first time in England at Northwich Memorial Court in Peter Pan alongside John Altman from EastEnders and Katie McGlynn from Coronation Street."]}, {"page": "St Bonaventure's", "response": ["* Stephen Mulhern, TV presenter and entertainer"]}, {"page": "Heart (radio network)", "response": ["*Stephen Mulhern and Emma Willis"]}, {"page": "Don Austen", "response": ["MOM changed its format and was renamed Holly & Stephen's Saturday Showdown (2006), retaining presenters Holly Willoughby and Stephen Mulhern from the previous outing. Scratch featured largely in the slimmed down line up. Austen was also called upon to write and voice the game commentary to 'Supermarket Sneak' and, further to his portrayal of Ozzy Osbourne on MOM, performed in vision as Igor, a larger than life dancing Russian Cossack."]}, {"page": "Britain's Got Talent", "response": ["On average, Britain's Got Talent draws viewing figures of 9.9 million viewers per series – the show's live final in the third series attracted a record 17.3 million viewers, obtaining a 64.6% audience share at the time of its broadcast. Each series of the main programme is accompanied by a sister show, Britain's Got More Talent, presented by Stephen Mulhern; until June 2019, the programme was aired on ITV2, but has since been moved to online platforms. A spin-off, titled Britain's Got Talent: The Champions and featuring the same judges and hosts, was later produced and broadcast in 2019, following the success of the American edition's spin-off America's Got Talent: The Champions. The programme is contracted to run through 2025.", "On 12 February 2007, following the success of America's Got Talent the previous year, ITV announced their intentions for a British series of Got Talent. Their announcement revealed changes to the original plan for the programme, with Ant & Dec revealed to be the hosts for the new programme. While Cowell remained as part of the judging panel, the new plan intended for David Hasselhoff and Cheryl Cole. However, both resigned before the programme was due to air, leading to Morgan being part of the panel as originally planned, and actress Amanda Holden joining him and Cowell as a judge; Hasselhoff would later join the panel for the programme's fifth series after being a part of the panel for America's Got Talent, while Cowell later employed Cole to be a replacement for Sharon Osbourne on The X Factor. At the same time, the broadcaster also announced that the show would be accompanied by a sister show on ITV2, titled Britain's Got More Talent, with Stephen Mulhern as its presenter.", "thumb|Stephen Mulhern had hosted the sister show to Britain's Got Talent from 2007–2019", "Britain's Got More Talent (often shortened to BGMT) is a companion sister show that was broadcast on ITV2 from 9 June 2007 to 2 June 2019 and hosted by Stephen Mulhern. Each series coincided with the broadcast of each series of Britain's Got Talent, with episodes airing after each episode of the main programme, and featuring regular appearances by Anthony McPartlin and Declan Donnelly along with the judges for the respective year. The format was based on those of former spin-off programmes such as The Xtra Factor (the companion show of The X Factor), but with notable differences depending on what stage of the competition the spin-off was airing. While the auditions stage was being broadcast, its sister show focused on highlights of acts that couldn't be shown on the main show, with Mulhern operating in a similar manner to the main show's hosts, though with interviews with participants before and after their performance. During live episodes, the sister show conducted live \"after-show\" episodes, featuring interviews with the semi-finalists and eventual finalists, and talks with the judges. The series also aired a set of compilation episodes featuring the best and worst auditions from that year's contest, titled Britain's Got Talent: Best and Worst.", "In 2013 it was revealed that up to 50% of acts on the televised shows had been headhunted by producers. In 2012, electropop band Superpowerless were approached to appear in the semi-finals. They attended the audition after assurances that the act would be portrayed in a positive light. On the day they felt that all interviews, especially those with Stephen Mulhern, were conducted in a manner intending to portray them in a negative light, reducing their act to a novelty/comedy routine intended for ridicule and humiliation. While many newspapers wrote articles on this topic, very few were published as the news outlets were told that running the story would cut that publication out of any advance coverage of the show in the future.", "Between 2008 and 2011, several of the show's semi-finalists, finalists, and winners from various series, took part in a live tour titled \"Britain's Got Talent Tour\". The event consisted of several shows held across various UK cities during the Summer months, with site locations including Cardiff, Liverpool, Birmingham, Belfast, Sheffield, Glasgow, Edinburgh, Nottingham, London, and Manchester. When the first live tour, hosted by Stephen Mulhern, was announced on 17 April 2008, demand for tickets for the thirteen dates set for it was high. This led to an extension in the number of performances for it, increasing the overall number from twelve – the ten finalists from that year's series and two of the semi-finalists, Tracey Lee Collins and Anya Sparks – to twenty two, including matinées, and a duet with Faryl Smith and Andrew Johnston. In 2009, Mulhern hosted a new live tour, which initially featured four dates before it was later increased to run for eighteen shows, and included performances by Diversity, Flawless, Aidan Davis, Shaun Smith, Stavros Flatley, Hollie Steel, 2 Grand, Julian Smith, Shaheen Jafargholi, Susan Boyle, Darth Jackson, DJ Talent and the 2008 winner, George Sampson. In 2010, a third live tour was created, featuring a much larger schedule and taking place across 16 cities and 23 shows. It was hosted by comedian Paddy McGuinness, and featured performances by that year's finalists of Britain's Got Talent – Spelbound, Twist & Pulse, Kieran Gaffney, Tobias Mead, Tina & Chandi, Paul Burling, Christopher Stone, Janey Cutler, Liam McNally and Connected."]}, {"page": "Table of death", "response": ["* Stephen Mulhern"]}, {"page": "Get Your Act Together", "response": ["Get Your Act Together was a British talent show that began airing on ITV on 18 January 2015, hosted by Stephen Mulhern. The show features celebrities learning various different acts, such as juggling, singing, impressions and escapology, and performing them on a live stage.", "Get Your Act Together was produced by ITV Studios for ITV, and that aired for 6 weeks from 18 January 2015 until 22 February 2015. The show was presented by Stephen Mulhern and was filmed at The London Studios during the heat rounds and at Fountain Studios during the final."]}]}}