{"wiki_id": "http://www.wikidata.org/entity/Q3814113", "itemLabel": "Ruthie Henshall", "itemDescription": "English actress, singer and dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruthie_Henshall", "wikipedia_page": {"main": "Valentine Ruth Henshall (born 7 March 1967), known professionally as Ruthie Henshall, is an English actress, singer and dancer, known for her work in musical theatre. She began her professional stage career in 1986, before making her West End debut in Cats in 1987. A five-time Olivier Award nominee, she won the 1995 Olivier Award for Best Actress in a Musical for her role as Amalia Balash in the London revival of She Loves Me (1994).\nHenshall's other Olivier nominated roles are Polly Baker in the original London production of Crazy for You (1993–1994), Roxie Hart in the revival of Chicago (1997–1998) and the title roles in the original productions of Peggy Sue Got Married (2001) and Marguerite (2008). She made her Broadway debut in 1999 as Velma Kelly in Chicago and returned to the Broadway production to play Roxie Hart in 2010. She also starred as Mrs Wilkinson for two years in the West End production of Billy Elliot the Musical (2014–2016). She returned to television acting in 2021 by appearing as Miranda Evans in the BBC soap opera Doctors.", "link_mentions": [{"page": "Follies", "response": ["|colspan='1' align=center| Ruthie Henshall"]}, {"page": "Savoy Theatre", "response": ["In 1993 Noël Coward's Relative Values, played at the theatre, having premièred there in 1951, an original run of 477 performances.Gaye, p. 1537 Tom Stoppard's Travesties, with Antony Sher was next, and in 1994 the musical She Loves Me played, with Ruthie Henshall and John Gordon Sinclair. These were followed by Terry Johnson's Dead Funny; Alan Ayckbourn's Communicating Doors (which transferred to the theatre in 1996), with Angela Thorne; J. B. Priestley's When We Are Married, with Dawn French, Alison Steadman, and Leo McKern; and Ben Travers' Plunder, with Griff Rhys Jones and Kevin McNally. In 1997 a group led by Sir Stephen Waley-Cohen was given management of the theatre by The Savoy Group. Productions that followed included Simon Callow in The Importance of Being Oscar; Pet Shop Boys in concert; Ian Richardson in Pinero's The Magistrate; Edward Fox in A Letter of Resignation; the Royal Shakespeare Company's production of Richard III, with Robert Lindsay; and Coward's Hay Fever, with Geraldine McEwan in 1999."]}, {"page": "Oliver!", "response": ["Cameron Mackintosh produced another revival of the show which opened at the London Palladium in the West End on 8 December 1994. The production team included a young Sam Mendes as director, with Anthony Ward as designer, Matthew Bourne as choreographer, Martin Koch as music supervisor and William David Brohn as orchestrator. The cast included Jonathan Pryce (after much persuasion) as Fagin, Sally Dexter as Nancy, Miles Anderson as Bill Sikes, James Villiers as Mr. Brownlow, James Saxon as Mr. Bumble, Jenny Galloway as Widow Corney, David Delve as Mr. Sowerberry and Julia Deakin as Mrs. Sowerberry. The role of Oliver was played by numerous child actors during the run of four years, including Gregory Bradley, Ben Reynolds, Jon Lee, Steven Webb, James Bourne,  James Rowntree and Tom Fletcher, while the Artful Dodger was played by Adam Searles and others including Matt Johnson, Paul Bailey and Bronson Webb. The role of Bet was played by Danielle McCormack, Rosalind James, Francesca Jackson and Lindsey Fawcett.Wolf, Matt. \"Review: Oliver!\", Variety, December 12, 1994 The musical closed on 21 February 1998.\"Oliver! listing, 1994–1998\" thisistheatre.com, retrieved May 28, 2010 The role of Fagin was later played by many notable British actors and comedians including George Layton, Russ Abbot, Jim Dale and Robert Lindsay (who won an Olivier Award for his performance in 1997). Bill Sikes was later portrayed by Steven Hartley and Joe McGann, and Nancy by Sonia Swaby, Claire Moore and Ruthie Henshall."]}, {"page": "Prince Edward, Earl of Wessex", "response": ["After leaving the Marines, Edward opted for a career in entertainment. He commissioned the 1986 musical Cricket from Andrew Lloyd Webber and Tim Rice, for his mother's 60th birthday celebration, which led to a job offer at Lloyd Webber's Really Useful Theatre Company, where he worked as a production assistant on musicals such as The Phantom of the Opera, Starlight Express, and Cats. While there he met actress Ruthie Henshall, whom he dated for three years."]}, {"page": "Doctors (2000 TV series)", "response": ["Alongside the regular cast, Doctors features numerous recurring and guest characters. Recurring characters typically have a connection to the regulars, such as Izzie Torres (Bethan Moore), the daughter of Daniel, and Eve Haskey (Rachel Bell), the mother of Al. Doctors also features guest stars in each episode, with examples including Emilia Clarke, Alison Hammond, Ruthie Henshall, Jamelia, Claire King, Joe Pasquale, Eddie Redmayne, Lisa Riley and Sheridan Smith."]}, {"page": "1967 in music", "response": ["** Ruthie Henshall, star of stage musicals"]}, {"page": "Chicago (musical)", "response": ["| Ruthie Henshall", "*Roxie Hart: Mel B, Christie Brinkley, Charlotte d'Amboise, Paige Davis, Kara DioGuardi, Sandy Duncan, Veronica Dunne, Charlotte Kate Fox, Robin Givens, Melanie Griffith, Melora Hardin, Samantha Harris, Marilu Henner, Ruthie Henshall, Robyn Hurder, Erika Jayne, Bonnie Langford, Shiri Maimon, Bianca Marroquín, Gretchen Mol, Jennifer Nettles, Bebe Neuwirth, Petra Nielsen, Brandy Norwood, Desi Oakley, Lisa Rinna, Chita Rivera, Brooke Shields, Ashlee Simpson, Amy Spanger, Denise van Outen, Ana Villafañe, Nana Visitor, Michelle Williams, Rumer Willis, Rita Wilson, Ryoko Yonekura, Karen Ziemba, Anne Horak Gallagher (u/s), Chryssie Whitehead (u/s)", "*Velma Kelly: Pia Douwes, Deidre Goodwin, Lana Gordon, Jasmine Guy, Ruthie Henshall, Carly Hughes, Nikka Graff Lanzarone, Sharon Lawrence, Ute Lemper, Vicki Lewis, Bianca Marroquín, Luba Mason, Anna Montanaro, Mýa, Caroline O'Connor, Reva Rice, Amra-Faye Wright, Leigh Zimmerman, Amy Spanger (u/s), Chryssie Whitehead (u/s)", "Among the many other performers and celebrities who have appeared in the show are Brandy Norwood, Usher, Christopher Sieber, Charlotte d'Amboise, Cuba Gooding Jr., Michael C. Hall, Roz Ryan, Jerry Springer, Brooke Shields, NeNe Leakes, Debra Monk, Patrick Swayze, Kevin Richardson, Gretchen Mol, Rita Wilson, Alan Thicke, Melanie Griffith, Taye Diggs, Erika Jayne, Carol Woods, Chandra Wilson, John O'Hurley, Christine Pedi, Ashlee Simpson, Adam Pascal, Todrick Hall, Amy Spanger, Leigh Zimmerman, Wendy Williams,\"'Chicago' Welcomes Back Tom Hewitt\"  broadwayworld.com Samantha Harris, Jennifer Nettles, Marilu Henner, Jeff McCarthy, Norm Lewis, Kevin Chamberlin, Christopher Fitzgerald, Philip Casnoff, Pasquale Aleardi, Ruthie Henshall, Christie Brinkley, Tony Yazbeck, Kara DioGuardi, Sofía Vergara, Mel B,\" 'Chicago' Current Cast\" playbillvault.com, accessed April 19, 2015 Ryoko Yonekura, and Shiri Maimon.", "On November 18, 1997, the revival production opened in London's West End.\"Timeline\"  chicagothemusical.com\"Chicago\" listing thisistheatre.com, accessed May 27, 2009  Like the New York revival, it was directed by Walter Bobbie and designed by John Lee Beatty, with choreography by Ann Reinking in the style of Bob Fosse.Bosanquet, Theo. \"Ugly Betty's America Ferrera Leads Chicago at Garrick , WhatsOnStage, October 10, 2011  The show ran at the Adelphi Theatre for nine years until transferring to the Cambridge Theatre in April 2006.\"'Chicago the Musical' at Cambridge Theatre listing\" thisistheatre.com, retrieved January 2, 2011  The original cast of the production included German jazz singer Ute Lemper as Velma, British actress Ruthie Henshall as Roxie Hart, Nigel Planer as Amos Hart, and Henry Goodman as Billy Flynn. The production won the 1998 Olivier Award for Outstanding Musical, and Lemper was awarded Best Actress in a Musical. Both Lemper and Henshall have played the role of Velma on Broadway.", "To celebrate the 21st Anniversary of the West End revival production, Chicago returned, this time at the Phoenix Theatre opening April 11, 2018, starring Cuba Gooding Jr. as Billy Flynn, Sarah Soetaert as Roxie Hart, Josefina Gabrielle as Velma Kelly, and Ruthie Henshall as Mama Morton. A cast change saw Martin Kemp take over the role of Billy Flynn, with Alexandra Burke as Roxie Hart and Mazz Murray as Mama Morton. Denise Van Outen was announced to take over the role of Velma from 24 September 2018, but due to sustaining a stress fracture in her heel, her integration was delayed until 7 October. The production featured on ITV's reality show, The Big Audition, to cast the replacement Velma. Following multiple rounds of singing, dancing and acting auditions, Laura Tyrer was selected to fill in for the role.", "| Ruthie Henshall"]}, {"page": "Cats (musical)", "response": ["* Jemima: Ruthie Henshall (1987–1989), Louise Fribo (1996), Veerle Casteleyn (1998–1999)"]}, {"page": "Jessie Matthews", "response": ["A memorial plaque above the venue for her childhood dance classes, 22 Berwick Street, Soho, was unveiled on 3 May 1995 by Andrew Lloyd Webber and stage actress Ruthie Henshall."]}, {"page": "Les Misérables (musical)", "response": ["*Fantine: Kathleen Rowe McAllen, Ruthie Henshall, Gunilla Backman, Carmen Cusack, Joanna Ampil, Kerry Ellis, Allyson Brown, Madalena Alberto, Caroline Sheen, Sierra Boggess, Celinde Schoenmaker, Na-Young Jeon, Rachelle Ann Go, Carley Stenson, Carrie Hope Fletcher, Lucie Jones, Dianne Pilkington (u/s)", "| style=\"text-align:center;\" | Ruthie Henshall", "On 8 October 1995, the show celebrated the tenth anniversary of the West End production with a concert at the Royal Albert Hall. This 10th Anniversary Concert was nearly \"complete\", missing only a handful of scenes, including \"The Death of Gavroche\", \"The Robbery\" and the confrontation between Marius and the Thénardiers at the wedding feast. Sir Cameron Mackintosh hand-selected the cast, which became known as the Les Misérables Dream Cast, assembled from around the world, and engaged the Royal Philharmonic Orchestra. The concert concluded with seventeen Valjeans from various international productions singing, \"Do You Hear the People Sing?\" in their native languages. The concert cast included Colm Wilkinson as Jean Valjean, Philip Quast as Javert, Paul Monaghan as the Bishop of Digne, Ruthie Henshall as Fantine, Hannah Chick as Young Cosette, Jenny Galloway as Madame Thénardier, Alun Armstrong as Thénardier, Adam Searles as Gavroche, Michael Maguire as Enjolras, Michael Ball as Marius, Judy Kuhn as Cosette, Lea Salonga as Éponine, and Anthony Crivello as Grantaire. The concert was staged by Ken Caswell and conducted by David Charles Abell.", "The cast includes Colm Wilkinson as Valjean, Philip Quast as Javert, Ruthie Henshall as Fantine, Alun Armstrong as Thénardier, Jenny Galloway as Mme. Thénardier, Lea Salonga as Éponine, Adam Searles as Gavroche, Hannah Chick as Young Cosette, Michael Ball as Marius, Michael Maguire as Enjolras, Judy Kuhn as Cosette and Anthony Crivello as Grantaire."]}, {"page": "Miss Saigon", "response": ["| align=\"center\"| Ruthie Henshall"]}, {"page": "Emma Bunton", "response": ["In February 2010, Bunton appeared in a UK National Television campaign first aired during Coronation Street, showing her in the Heart Radio studios at the start and the end of the advert. In January 2010, Bunton joined the \"Ice Panel\" on ITV dancing show Dancing on Ice replacing former judge Ruthie Henshall. She stepped down from this role on 2 December 2011. Bunton hosted Channel 5's Don't Stop Believing from July to August 2010. In August 2010, Bunton guest presented GMTV with Lorraine on GMTV. On 8 October 2010,Pixie Lott performs on Lorraine  Lorraine, ITV.com, 8 October 2010. 19 November 2010 and 7 January 2011,Dionne Warwick & Mica Paris Lorraine, ITV.com, 7 January 2011. she guest presented Lorraine on ITV Breakfast."]}, {"page": "Guys and Dolls", "response": ["A concert performance ran at London's Cadogan Hall from 22 to 25 August 2012, featuring Dennis Waterman, Ruthie Henshall, Anna-Jane Casey, and Lance Ellington (Strictly Come Dancing), with musical director Richard Balcombe and the Royal Philharmonic Concert Orchestra and Choir."]}, {"page": "Crazy for You (musical)", "response": ["The West End production, directed by Ockrent, choreographed by Stroman, and starring Ruthie Henshall, Kirby Ward, and Chris Langham, opened at the Prince Edward Theatre on March 3, 1993 and ran for nearly three years.", "| colspan=1 | Ruthie Henshall", "| Ruthie Henshall"]}, {"page": "Bromley", "response": ["Other famous people who lived in Bromley include David Bowie, Charles Darwin, Talbot Rothwell, screenwriter of twenty Carry On films, Justine Lord, actress, Peter Howitt, Richmal Crompton, Pixie Lott, Matt Terry, Christopher Tennant,  Hanif Kureishi, Peter Frampton, Aleister Crowley, bassist Steven Severin of Siouxsie and the Banshees, Fatboy Slim, Jack Dee, Gary Rhodes, Pete Sears, singer Poly Styrene, Billy Idol, Josh Beech, Ruthie Henshall, Trevor Goddard, actor Billy Jenkins, Alex Clare, cricketer Jill Cruwys, the anarchist Peter Kropotkin, the former Clash drummer Topper Headon, illustrator Charles Keeping, Formula 1 test driver Gary Paffett, IndyCar driver Mike Conway, children's writer Andrew Murray, tenor Roland Cunningham, actor Michael York who attended Bromley Grammar School for Boys, clarinetist Chris Craker, Don Perrin, Canadian author who attended Burnt Ash School in Bromley, and Sir Thomas James Harper, an officer decorated in the Crimean War. The musical conducting brothers Stephen and Nicholas Cleobury were born in Bromley. Actor Jerome Flynn, who starred in Game of Thrones as Bronn, was born in Bromley. Gus Lobban and Jamie Bulled of the band Kero Kero Bonito grew up in Bromley: their music video for the song 'You Know How It Is' features several local landmarks."]}, {"page": "Linn Records", "response": ["*Ruthie Henshall"]}, {"page": "Blithe Spirit (play)", "response": ["Sharrock directed a revival of her production of the play, which started as a UK tour\"Steadman Spirit Confirms West End & Tour Dates\", What'sOnStage, 30 June 2010, accessed 5 May 2014 and then moved to the Apollo Theatre, London. It ran there from March to June 2011, with a cast including Robert Bathurst as Charles, Hermione Norris as Ruth, Ruthie Henshall as Elvira and Alison Steadman as Madame Arcati.Billington, Michael. \"Blithe Spirit: review\", The Guardian, 10 March 2011"]}, {"page": "Lesley Garrett", "response": ["On Christmas Day 2004, BBC Two broadcast Lesley Garrett – Music from the Movies, co-starring her with Ruthie Henshall, Michael McCarthy with the backing of the Opera North orchestra. The programme was recorded at the Opera In The Park concert which had taken place in the grounds of Temple Newsam, West Yorkshire on 19 July 2003."]}, {"page": "Theatre Royal Haymarket", "response": ["In 2008, productions were The Sea (Bond), starring David Haig, Eileen Atkins and Russell Tovey;\"The Sea\" , London Theatre Guide Marguerite, a new musical starring Ruthie Henshall and Alexander Hanson; and Keith Allen in an adaptation of Treasure Island.\"Treasure Island\" , London Theatre Guide The following year, Ian McKellen, Patrick Stewart, Simon Callow and Ronald Pickup starred in Waiting for Godot,\"Waiting for Godot\" , London Theatre Guide followed by Breakfast at Tiffany's, starring Anna Friel, Joseph Cross, James Dreyfus and Suzanne Bertish. Godot and Tiffany's were featured, along with the staff and history of the Haymarket Theatre itself, in a 2009 eight-part Sky Arts documentary, Theatreland.\"Theatreland: Behind the scenes at the Theatre Royal Haymarket\" , Sky Arts, July 2009, retrieved 9 December 2011 In 2010 Waiting for Godot was repeated with McKellen, Roger Rees, Matthew Kelly and Pickup, followed by a transfer of Sweet Charity from the Menier Chocolate Factory.\"Sweet Charity\" , London Theatre Guide The next show was The Rivals starring Penelope Keith and Peter Bowles.The Rivals Comes to the West End, Theatre Royal Haymarket"]}, {"page": "She Loves Me", "response": ["The West End revival, also directed by Ellis and choreographed by Marshall, opened on July 12, 1994, at the Savoy Theatre, where it ran for one year. The cast included John Gordon Sinclair as Georg, Ruthie Henshall as Amalia, and Tracie Bennett as Ilona. A revival cast recording was released on the First Night label.", "|colspan='1' align=center|Ruthie Henshall", "| Ruthie Henshall"]}, {"page": "Children of Eden", "response": ["The original cast production of Children of Eden was developed as a Royal Shakespeare Company (RSC) workshop. The production was directed by John Caird, and starred Ken Page as Father, Richard Lloyd-King as the Snake, Martin Smith as Adam, Shezwae Powell as Eve, Adrian Beaumont as Cain, Kevin Colson as Noah, Earlene Bentley as Mama Noah, Frances Ruffelle as Yonah, Anthony Barclay as Japheth, Craig Pinder as Shem, Ray Shell as Ham, Hiromi Itoh as Aysha and Ruthie Henshall as Aphra. After the RSC's budget was cut, it instead opened at the Prince Edward Theatre in London's West End on January 8, 1991. The show closed on April 6, 1991 due to poor reviews and the negative effects the Persian Gulf War had on tourism worldwide."]}, {"page": "Grizabella", "response": ["* Ruthie Henshall"]}, {"page": "Prince Edward Theatre", "response": ["*Crazy for You (3 March 1993 – 24 February 1996) by George and Ira Gershwin and Ken Ludwig, starring Ruthie Henshall and Kirby Ward"]}, {"page": "Ann Reinking", "response": ["Reinking had retired from performing by this time. In 1996, she was asked to create the choreography \"in the style of Bob Fosse\" for an all-star four-night-only concert staging of Chicago for City Center's annual Encores! Concert Series. When the producers could not obtain a suitable actress for the role of Roxie Hart, Reinking agreed to reprise the role after almost 20 years.\"Reinking biography\" tcm.com, retrieved August 28, 2010 This concert staging of Chicago was a hit, and a few months later the production (in its concert staging presentation) was produced on Broadway, with the Encores! cast: Reinking, Bebe Neuwirth, Joel Grey, James Naughton, and Marcia Lewis.Brantley, Ben. \"Lively Legacy, A Come-Hither Air\" The New York Times, November 15, 1996 In November 2016, the revival celebrated its 20th year, and as of March 2020, when theaters temporarily closed due to the COVID-19 pandemic, it was the longest-running American musical on Broadway. The revival of Chicago won numerous Tony Awards, and Reinking won the Tony Award for Best Choreography. She recreated her choreography for the 1997 London transfer of Chicago, which starred Ute Lemper and Ruthie Henshall."]}, {"page": "Hey, Mr. Producer!", "response": ["The show was hosted by Julie Andrews and the all-star cast performing these numbers included Tal Landsman, Liz Robertson, Jonathan Pryce, John Barrowman, Ellen Greene, Julian Lloyd Webber, Bernadette Peters, Patti Lupone, Russ Abbot, Sonia Swaby, David Campbell, Maria Friedman, Lea Salonga, Lisa Vroman, Colm Wilkinson, Michael Ball, Julia McKenzie, Hugh Jackman, Joanna Riding, Millicent Martin, David Kernan, Ruthie Henshall, Judi Dench, Tom Lehrer, Hal Fowler, Elaine Paige, Philip Quast, Adam Searles, Tee Jaye Jenkins, Trent Kendall, Monroe Kent III, Jason Pennycooke, Maria Charles, Richard D. Sharp and Feruma Williams.Review SummaryThe New York Times, accessed 16 May 2009  There was also a special performance by Stephen Sondheim and Andrew Lloyd Webber, who spoofed their own songs. Some of the songs from less successful Mackintosh shows were also a part of the performance, but not contained in the DVD or CD of the event, including songs from Moby Dick! The Musical."]}, {"page": "Pilgrim (disambiguation)", "response": ["* Pilgrim, by Ruthie Henshall"]}, {"page": "Putting It Together", "response": ["A production at the Mark Taper Forum (Los Angeles)The Mark Taper Forum's acclaimed and extended production of the Sondheim revue Putting It Together will end its run on December 6. transferred to Broadway the following year, opening November 21, 1999 at the Ethel Barrymore Theatre, where it ran for 101 performances and 22 previews.  Directed by Eric D. Schaeffer and choreographed by Bob Avian, the Broadway cast included Carol Burnett (Wife), George Hearn (Husband), Ruthie Henshall (Young Woman), John Barrowman (Young Man), and Bronson Pinchot (Observer).  Kathie Lee Gifford replaced Burnett at some performances.  The production marked the return of Burnett to the Broadway stage after performing in Moon Over Buffalo in 1995.  Hearn was nominated for the Tony Award for Best Actor in a Musical."]}, {"page": "Jonathan Ansell", "response": ["The third series of The Alan Titchmarsh Show featured the start of a competition to find a soprano to sing with Ansell in the A Night at the Opera tour. 8 ladies were selected to sing in front of a judging panel of David Grant, Ruthie Henshall and Jonathan Shalit.  The 4 successful ladies Rosie Bell, Rosie Havel, Olivia Safe and Esther Dee faced a public vote on 15 September 2008 and Olivia Safe and Rosie Bell won through. They sang  Libiamo ne' lieti calici with Ansell, from Verdi's La Traviata on 29 September 2008. Olivia Safe won the public vote to appear in the tour of A Night at the Opera."]}]}}