{"wiki_id": "http://www.wikidata.org/entity/Q3817476", "itemLabel": "John Cook Wilson", "itemDescription": "English philosopher (1849-1915)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cook_Wilson", "wikipedia_page": {"main": "John Cook Wilson  (6 June 1849 – 11 August 1915) was an English philosopher.", "link_mentions": [{"page": "J. L. Austin", "response": ["Austin's early interests included Aristotle, Kant, Leibniz, and Plato (especially the Theaetetus). His more contemporary influences included especially G. E. Moore, John Cook Wilson and H. A. Prichard. The contemporary influences shaped their views about general philosophical questions on the basis of careful attention to the more specific judgements we make. They took our specific judgements to be more secure than more general judgements. It's plausible that some aspects of Austin's distinctive approach to philosophical questions derived from his engagement with the last three."]}, {"page": "Index of philosophy articles (I–Q)", "response": ["* John Cook Wilson"]}, {"page": "Direct and indirect realism", "response": ["Late modern philosophers, J. G. Fichte and G. W. F. Hegel followed Kant in adopting empirical realism.Daniel Breazeale and Tom Rockmore (eds.), Fichte, German Idealism, and Early Romanticism, Rodopi, 2010, p. 20.Tom Rockmore, Before and After Hegel: A Historical Introduction to Hegel's Thought, Hackett Publishing, 2003, p. xviii: \"Hegel follows Kant ... in limiting claims to know to the empirically real. In short, he adopts a view very similar to Kant's empirical realism.\" Direct realism was also defended by John Cook Wilson in his Oxford lectures (1889–1915).Michael Beaney (ed.), The Oxford Handbook of the History of Analytic Philosophy, Oxford University Press, 2013, p. 40. On the other hand, Gottlob Frege (in his 1892 paper \"Über Sinn und Bedeutung\") subscribed to indirect realism.Samuel Lebens, Bertrand Russell and the Nature of Propositions: A History and Defence of the Multiple Relation Theory of Judgement, Routledge, 2017, p. 34."]}, {"page": "John Wilson", "response": ["* John Cook Wilson (1849–1915), English philosopher"]}, {"page": "List of Balliol College, Oxford people", "response": ["* John Cook Wilson (1868)"]}, {"page": "Barbershop paradox", "response": ["The paradox arose out of a disagreement between Carroll and his Oxford colleague, Wykeham Professor of Logic John Cook Wilson, the two of whom had a long-running antagonism. The problem was also discussed by others with whom Carroll corresponded, and was addressed in later articles published by John Venn, Alfred Sidgwick and Bertrand Russell among others. Cook Wilson's view is represented in the story by the character of Uncle Joe, who attempts to prove that Carr must always remain in the shop. Others had taken the same view when Carroll circulated his privately printed versions of the problem. As Carroll noted, \"I am in correspondence with about a dozen logicians on this curious point; & so far, opinions appear equally divided as to C's freedom\"."]}, {"page": "Harold H. Joachim", "response": ["Harold Henry Joachim was born in London, the son of a wool merchant who had come to England as a boy from Hungary. He was educated at Harrow School and Balliol College, Oxford, where he was a pupil of R. L. Nettleship. He was elected to a Prize Fellowship at Merton College in 1890, and in 1892 became a philosophy lecturer at the University of St Andrews. Returning to Oxford in 1894, he was lecturer at Balliol until becoming a Fellow and Tutor at Merton in 1897. In 1907 he married his first cousin, a daughter of the violinist Joseph Joachim. He became Wykeham Professor of Logic of the University of Oxford from 1919, succeeding the realist John Cook Wilson, and occupied the chair until his death. Whilst at Oxford he taught the American poet T.S. Eliot. Joachim was a nephew of the great 19th Century violinist Joseph Joachim, and was himself a talented amateur violinist."]}, {"page": "Wykeham Professor", "response": ["* John Cook Wilson, 1889–1915"]}, {"page": "List of philosophers born in the 19th century", "response": ["* John Cook Wilson, (1849–1915)"]}, {"page": "List of Oriel College, Oxford, people", "response": ["*John Cook Wilson – Fellow in 1874, Wykeham Professor of Logic from 1889"]}, {"page": "List of philosophers (R–Z)", "response": ["* John Cook Wilson (1849–1915)"]}, {"page": "J. Cook Wilson", "response": ["#REDIRECT John Cook Wilson"]}, {"page": "Cook Wilson", "response": ["#REDIRECT John Cook Wilson"]}, {"page": "List of Old Derbeians", "response": ["*John Cook Wilson (1849–1915), philosopherWilson, John Cook (1849–1915), philosopher and classical scholar by H. A. Prichard & David Boucher in Dictionary of National Biography (Oxford University Press, 2004)"]}, {"page": "List of people with surname Wilson", "response": ["** John Cook Wilson (1849–1915), English philosopher"]}, {"page": "Hywel Lewis", "response": ["In his book The Elusive Self (1982) Lewis argued that mental states are \"distinct in nature from physical states but constantly interacting with them\" and there is a \"subject, or a self or soul, which remains constant and is uniquely involved in all the flow of our mental states or experiences.\"Matthews, Gareth. (1985). The Elusive Self by Hywel D. Lewis; Selfless Persons by Steven Collins. Philosophy and Phenomenological Research. Vol. 45, No. 3. pp. 461–465. The philosopher Gareth Matthews gave the book a negative review claiming Lewis had offered no evidence for dualism. On the subject of dreamless sleep, Lewis wrote the self ceases to be. According to Matthews the belief that the self can pop in and out of existence would be alarming to some readers but Lewis had no problem with accepting this view. Matthews concluded that Lewis's controversial claims were deliberately left with no direct argumentative support. Eugene Long gave the book a positive review stating Lewis had given an adequate defence for the dualistic position and the existence of the self.Long, Eugene. (1985). The Elusive Self by H. D. Lewis. The Review of Metaphysics. Vol. 38, No. 3. pp. 655–657. Long has written that Lewis was a philosophical realist, similar to John Baillie and John Cook Wilson.Long, Eugene. (2003). Twentieth-Century Western Philosophy of Religion 1900–2000. Kluwer Academic Publishers. p. 128. "]}, {"page": "List of British philosophers", "response": ["* John Cook Wilson"]}, {"page": "Critical realism (philosophy of perception)", "response": ["Similar developments occurred in the UK.  Major figures included Samuel Alexander, John Cook Wilson,  H. A. Prichard, H. H. Price, and C. D. Broad."]}]}}