{"wiki_id": "http://www.wikidata.org/entity/Q38103057", "itemLabel": "Roger Eddison", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Eddison", "wikipedia_page": {"main": "Roger Tatham Eddison (16 September 1916, Yokohama – 2000) was an English practitioner of Operations Research. He was Joint Editor of Operational Research Quarterly from 1950 to 1958. He was President of the Operational Research Society 1966-1967.", "link_mentions": [{"page": "Stafford Beer", "response": ["In 1961 he left United Steel to start an operational research consultancy in partnership with Roger Eddison called SIGMA (Science in General Management). Beer left SIGMA in 1966 to work for a SIGMA client, the International Publishing Corporation (IPC). He left IPC in 1970 to work as an independent consultant, focusing on his growing interest in social systems."]}, {"page": "British Iron and Steel Research Association", "response": ["The organization was created by Sir Charles Goodeve, who remained its director until his retirement in 1969. Roger Eddison was hired as a manager shortly after BISRA's founding.  BISRA's research has been responsible for much of the automation of modern steelmaking. BISRA were pioneers of digital computing in the steel industry.\"A History of OR and Computing\", J. C. Ranyard, The Journal of the Operational Research Society, Vol. 39, No. 12 (December 1988), pp. 1073-1086"]}, {"page": "Robert Eddison", "response": ["Eddison was born in Yokohama, Japan to Edwin Eddison and Hilda Muriel Leadham. He had a twin brother Talbot Leadam Eddison, who later became a Rear Admiral in the Royal Navy and receiving the Distinguished Service Crosshttps://www.thegazette.co.uk/London/issue/37119/supplement/2969/data.pdf and The Most Honourable Order of the Bath. Their third child later became a director of an engineering company. Their youngest brother was Roger Eddison."]}, {"page": "Eddison", "response": ["*Roger Eddison (1916–2000), Operations Researcher"]}, {"page": "Sigma (operations research)", "response": ["Sigma (Science in General Management) was a limited company established by Henry Novy, Stafford Beer and Roger Eddison in 1961. It sold operational research OR in the United Kingdom and overseas. Beer was responsible for the cybernetic models of organisation and corporate planning which were the firm's specially. Eddison was the Operations Director."]}]}}