{"wiki_id": "http://www.wikidata.org/entity/Q3813330", "itemLabel": "Paul Morgan", "itemDescription": "British footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Morgan_(footballer)", "wikipedia_page": {"main": "Mark Paul Thomas Morgan (born 23 October 1978) is a Northern Irish former professional footballer, who is now head physiotherapist at Accrington Stanley and the Montserrat national football team.\nMorgan played as a defender in a career lasted from 1997 until 2012, starting out with Preston North End in the 1997–98 campaign. He failed to make an appearance for North End from then until his departure in 2001 and also spent a spell on loan with League of Ireland side Sligo Rovers. His spell in Ireland brought a brief and solitary cap for the Northern Ireland U21 side. In 2001, he joined Lincoln City where he spent seven years of his career, notably qualifying for the League Two play-offs in four consecutive seasons, losing out in the 2002–03 and 2004–05 seasons at the final in the Millennium Stadium. Morgan became Lincoln skipper towards the end of his spell with the club and racked 212 league appearances, scoring 2 goals. Morgan was noted as being one of the best defenders in the lower leagues, he missed opportunities to play higher due to his commitment to Lincoln City. In 2007, he joined Bury where his former Lincoln boss Keith Alexander had taken up the director of football role. After two years with Bury he followed Alexander again to Macclesfield Town where he spent the last three years of his career.", "link_mentions": [{"page": "Montserrat national football team", "response": ["|  Paul Morgan"]}, {"page": "Keith Alexander (footballer)", "response": ["Remaining at the club were former Tottenham Hotspur youngsters Alan Marriott and Peter Gain, Northern Ireland B international centre-back Paul Morgan along with midfielders Adam Buckley, Mark Camm and Ben Sedgemore and wing-backs Mark Bailey and Stuart Bimson and Alexander complemented their talents with a series of signings from outside of the Football League. After just one week in the job, Alexander completed his first two signings bringing Ben Futcher and Dene Cropper to the club on initial one-year contracts. One week later, Alexander made a second double swoop with Simon Weaver and Simon Yeo joining the ranks.", "Alexander signed a new three-year contract in May 2005. During the close season Simon Yeo, Richard Butcher and Peter Gain chose to leave the club, whilst Gary Taylor-Fletcher was surprisingly released amid speculation about his conduct. Captain Paul Morgan, however, signed a new three-year deal which reportedly made him the highest paid player at the club. Lincoln lost yet again in the play-offs at the end of the 2005–06 season, this time to local rivals Grimsby Town, giving Alexander the unenviable record of being the only manager to lead a team to four consecutive play-off defeats. Shortly after this defeat, Alexander left Lincoln by mutual consent."]}, {"page": "Gareth McAuley", "response": ["However, when Dean West was dropped from the squad and club captain Paul Morgan sidelined with an injury, McAuley moved into central defence to partner Ben Futcher. He immediately drew the plaudits for his excellent performances, which included a man of the match display against Derby County. He thereafter battled for a starting centre back role with fellow giant Jamie McCombe for much of the season."]}, {"page": "Matt Bloomer", "response": ["The following season, Keith Alexander succeeded Alan Buckley as manager, and brought Bloomer in on a permanent deal. After signing permanently for Lincoln he was mainly a bit-part player, but nonetheless made nearly a century of appearances for the club. During the 2004–2005 season, he earned himself a starting place at right-back, replacing veteran Dean West. Bloomer was given his chance to start ahead of West for the League Cup first round match against Derby County. Lincoln won 3–1, Bloomer's performance was highly praised, and he went on to make a number of solid performances. He lost his starting place following an ill-fated first half against Wycombe Wanderers in early 2005. Bloomer moved from right back to central defensive position held by captain Paul Morgan, who was out with an injury, Wycombe scored three goals in the first 45 minutes, all from Nathan Tyson. He did not start again all season, with both Lee Beevers and Gareth McAuley playing in his position for the rest of the year, however, he did play as a striker in the play-off final in Cardiff, where Lincoln lost 2–0 after extra-time to Southend United. During the 2005–06 season, Bloomer found himself on the fringes of the Lincoln squad, and had spells on loan at former club Grimsby Town and Conference side Cambridge United."]}, {"page": "Richard Butcher (footballer)", "response": ["Family, friends and fans paid tribute to Butcher at Lincoln City's Sincil Bank stadium on Wednesday 2 February 2011, the service was attended by fellow footballers and close friends Simon Yeo, Ben Futcher, Paul Morgan and Alan Marriott as well as former Macclesfield teammates and Peterborough United director Barry Fry. A private service was held at Lincoln Crematorium service following the thanksgiving service at the stadium."]}, {"page": "1978 in Northern Ireland", "response": ["*23 October - Paul Morgan, footballer."]}, {"page": "2007–08 Lincoln City F.C. season", "response": ["|  Paul Morgan || Bury || 29 || Transfer request"]}]}}