{"wiki_id": "http://www.wikidata.org/entity/Q382031", "itemLabel": "E. H. Shepard", "itemDescription": "British artist (1879-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/E._H._Shepard", "wikipedia_page": {"main": "Ernest Howard Shepard OBE MC (10 December 1879 – 24 March 1976) was an English artist and book illustrator. He is known especially for illustrations of the anthropomorphic animal and soft toy characters in The Wind in the Willows and Winnie-the-Pooh.", "link_mentions": [{"page": "A. A. Milne", "response": ["During this period he published 18 plays and three novels, including the murder mystery The Red House Mystery (1922). His son was born in August 1920 and in 1924 Milne produced a collection of children's poems, When We Were Very Young, which were illustrated by Punch staff cartoonist E. H. Shepard. A collection of short stories for children A Gallery of Children, and other stories that became part of the Winnie-the-Pooh books, were first published in 1925.", "Milne is most famous for his two Pooh books about a boy named Christopher Robin after his son, Christopher Robin Milne (1920–1996), and various characters inspired by his son's stuffed animals, most notably the bear named Winnie-the-Pooh. Christopher Robin Milne's stuffed bear, originally named Edward, was renamed Winnie after a Canadian black bear named Winnie (after Winnipeg), which was used as a military mascot in World War I, and left to London Zoo during the war. \"The Pooh\" comes from a swan the young Milne named \"Pooh\". E. H. Shepard illustrated the original Pooh books, using his own son's teddy Growler (\"a magnificent bear\") as the model. The rest of Christopher Robin Milne's toys, Piglet, Eeyore, Kanga, Roo and Tigger, were incorporated into A. A. Milne's stories, and two more characters – Rabbit and Owl – were created by Milne's imagination. Christopher Robin Milne's own toys are now on display in New York where 750,000 people visit them every year.", "The fictional Hundred Acre Wood of the Pooh stories derives from Five Hundred Acre Wood in Ashdown Forest in East Sussex, South East England, where the Pooh stories were set. Milne lived on the northern edge of the forest at Cotchford Farm, , and took his son walking there. E. H. Shepard drew on the landscapes of Ashdown Forest as inspiration for many of the illustrations he provided for the Pooh books. The adult Christopher Robin commented: \"Pooh's Forest and Ashdown Forest are identical.\" Popular tourist locations at Ashdown Forest include: Galleon's Lap, The Enchanted Place, the Heffalump Trap and Lone Pine, Eeyore’s Sad and Gloomy Place, and the wooden Pooh Bridge where Pooh and Piglet invented Poohsticks.Plans to improve access to Pooh Bridge unveiled. BBC. Retrieved 15 October 2011", "Not yet known as Pooh, he made his first appearance in a poem, \"Teddy Bear\", published in Punch magazine in February 1924 and republished in When We Were Very Young. Pooh first appeared in the London Evening News on Christmas Eve, 1925, in a story called \"The Wrong Sort of Bees\".\"Pooh celebrates his 80th birthday\". BBC. Retrieved 11 November 2012 Winnie-the-Pooh was published in 1926, followed by The House at Pooh Corner in 1928. A second collection of nursery rhymes, Now We Are Six, was published in 1927. All four books were illustrated by E. H. Shepard. Milne also published four plays in this period. He also \"gallantly stepped forward\" to contribute a quarter of the costs of dramatising P. G. Wodehouse's A Damsel in Distress. The World of Pooh won the Lewis Carroll Shelf Award in 1958.Award List. \"Lewis Carroll Shelf Award Winners,\" Lewis Carroll Shelf Award Collection, Living Arts Corporation, Loveland, Colorado.", "The rights to A. A. Milne's Pooh books were left to four beneficiaries: his family, the Royal Literary Fund, Westminster School and the Garrick Club. After Milne's death in 1956, thirteen days after his 74th birthday, his widow sold her rights to the Pooh characters to Stephen Slesinger, whose widow sold the rights after Slesinger's death to the Walt Disney Company, which has made many Pooh cartoon movies, a Disney Channel television show, as well as Pooh-related merchandise. In 2001, the other beneficiaries sold their interest in the estate to the Disney Corporation for $350m. Previously Disney had been paying twice-yearly royalties to these beneficiaries. The estate of E. H. Shepard also received a sum in the deal. The UK copyright on the text of the original Winnie the Pooh books expires on 1 January 2027; at the beginning of the year after the 70th anniversary of the author's death (PMA-70), and has already expired in those countries with a PMA-50 rule. This applies to all of Milne's works except those first published posthumously. The illustrations in the Pooh books will remain under copyright until the same amount of time has passed, after the illustrator's death; in the UK, this will be on 1 January 2047. In the United States, copyright will not expire until 95 years after publication for each of Milne's books first published before 1978, but this includes the illustrations.", "* Year In, Year Out (1952) (illustrated by E. H. Shepard)", "* The House at Pooh Corner (1928) (illustrated by E. H. Shepard)", "* When We Were Very Young (1924) (illustrated by E. H. Shepard)", "* Now We Are Six (1927) (illustrated by E. H. Shepard)", "* When We Were Very Young (1924) (illustrated by E. H. Shepard)", "* Now We Are Six (1927) (illustrated by E. H. Shepard)"]}, {"page": "1976", "response": ["** E. H. Shepard, English artist and book illustrator (b. 1879)"]}, {"page": "1879", "response": ["** E. H. Shepard, English artist, book illustrator (d. 1976)"]}, {"page": "The Wind in the Willows", "response": ["* The most popular illustrations are probably by E. H. Shepard, originally published in 1931, and believed to be authorised as Grahame was pleased with the initial sketches, though he did not live to see the completed work.E. H. Shepard ill. ed, Charles Scribner's Sons, US, introduction.", "Category:Books illustrated by E. H. Shepard"]}, {"page": "Christopher Robin", "response": ["Christopher Robin's bedroom, but not Christopher Robin himself, appears in live-action opening sequences. In the world within his storybooks, his house appears just as it does in E. H. Shepard's illustrations."]}, {"page": "Heffalump", "response": ["Although this is not explicitly stated, it is generally thought that heffalumps are elephants from a child's viewpoint (the word \"heffalump\" being a child's attempt at pronouncing \"elephant\"). E. H. Shepard's illustrations in A. A. Milne's original books depict heffalumps (as seen in Piglet's dreams) as looking very much like elephants."]}, {"page": "Piglet (Winnie-the-Pooh)", "response": ["The Te of Piglet was written by Benjamin Hoff following the publication of The Tao of Pooh. Both books feature the original drawing of E. H. Shepard. The Te of Piglet details Piglet's exemplification of the Taoist concept of \"virtue of the small\"."]}, {"page": "Ashdown Forest", "response": ["Ashdown Forest is famous as the setting for the Winnie-the-Pooh stories written by A. A. Milne, who lived on the northern edge of the forest and took his son, Christopher Robin, walking there. The artist E. H. Shepard drew on the landscapes of Ashdown Forest as inspiration for many of the illustrations he provided for the Pooh books.", "Ashdown Forest is famous as the setting for the Winnie-the-Pooh stories, written by A. A. Milne. The first book, Winnie-the-Pooh, was published in 1926 with illustrations by E. H. Shepard. The second book, The House at Pooh Corner, also illustrated by Shepard, was published in 1928. These hugely popular stories were set in and inspired by Ashdown Forest."]}, {"page": "Jingoism", "response": ["The policy of appeasement toward Hitler led to satirical references to the disappearance of such jingoistic attitudes when facing German aggression. A cartoon by E. H. Shepard titled \"The Old-Fashioned Customer\" appeared on 28 March 1938 issue of Punch. Set in a record shop, John Bull asks the record seller (Prime Minister Neville Chamberlain): \"I wonder if you've got a song I remember about not wanting to fight, but if we do... something, something, something ... we've got the money too?\". On the wall is a portrait of Lord Salisbury."]}, {"page": "1976 in literature", "response": ["*March 24 – E. H. Shepard, English illustrator and autobiographer (born 1879)"]}, {"page": "Political cartoon", "response": ["Notable editorial cartoons include Benjamin Franklin's Join, or Die (1754), on the need for unity in the American colonies; The Thinkers Club (1819), a response to the surveillance and censorship of universities in Germany under the Carlsbad Decrees; and E. H. Shepard's The Goose-Step (1936), on the rearmament of Germany under Hitler. The Goose-Step is one of a number of notable cartoons first published in the British Punch magazine."]}, {"page": "Laurence Housman", "response": ["*Victoria Regina, a Dramatic Biography (1934) — collection of 30 short plays; illustrated by E. H. Shepard", "*The Golden Sovereign (1937) — collection of 19 short plays; illustrated by E. H. Shepard"]}, {"page": "Winnie-the-Pooh (book)", "response": ["Winnie-the-Pooh is a children’s book by English author A. A. Milne and English illustrator E. H. Shepard. Published in 1926, it is a collection of short stories about an anthropomorphic teddy bear, Winnie-the-Pooh, and his friends Christopher Robin, Piglet, Eeyore, Owl, Rabbit, Kanga, and Roo. It is the first of two story collections by Milne about Winnie-the-Pooh, the second being The House at Pooh Corner (1928).", "Before writing Winnie-the-Pooh, A. A. Milne was already a successful writer. He wrote for English humour magazine Punch, had published a mystery novel, The Red House Mystery (1922), and was a playwright. Milne began writing poetry for children after being asked by fellow Punch contributor, Rose Fyleman. Milne compiled his first verses for publishing, and though his publishers were initially hesitant to publish children's poetry, the poetry collection When We Were Very Young (1924) was a success. The illustrations were done by artist and fellow Punch staff E. H. Shepard."]}, {"page": "Methuen Publishing", "response": ["With knowledge he had gained of children's literature at the publisher Grant Richards, E. V. Lucas built on the company's early success. Among the authors Lucas signed to the company were A. A. Milne, Kenneth Grahame, while he also supported illustrators W. Heath Robinson, H. M. Bateman and E. H. Shepard.Stevenson, page 60. By the 1920s it had also a literary list that included Anthony Hope, G. K. Chesterton, Henry James, D. H. Lawrence, T. S. Eliot, Ruth Manning-Sanders and The Arden Shakespeare series."]}, {"page": "Michael Winner", "response": ["Winner was an art collector, and a connoisseur of British illustration. Winner's art collection includes works by Jan Micker, William James, Edmund Dulac, E. H. Shepard, Arthur Rackham, Kay Nielsen and Beatrix Potter. His collection once included almost 200 signed colour-washed illustrations by Donald McGill."]}, {"page": "The House at Pooh Corner", "response": ["The House at Pooh Corner (1928) is the second volume of stories about Winnie-the-Pooh, written by A. A. Milne and illustrated by E. H. Shepard. It is notable for the introduction of the character Tigger.", "Category:Books illustrated by E. H. Shepard"]}, {"page": "Savage Club", "response": ["*E. H. Shepard"]}, {"page": "Christopher Robin Milne", "response": ["An early childhood friend was Anne Darlington, also an only child, who as Milne described it, was for his parents \"the Rosemary that I wasn't.\" Anne Darlington had a toy monkey, Jumbo, as dear to her as Pooh was to Christopher. Several poems by Milne, and several illustrations by E. H. Shepard, feature Anne and Christopher, notably \"Buttercup Days\", in which their relative hair colours (brown and golden blond) and their mutual affection is noted (the illustration to this latter poem, from Now We Are Six, also features the cottage at Cotchford Farm). To Alan and Daphne Milne, Anne was and remained to her death the Rosemary that Christopher wasn't, and Daphne long held fond hopes that Anne and Christopher would marry."]}, {"page": "Whiteleys", "response": ["The first store – described as \"an immense symposium of the arts and industries of the nation and of the world\" – was devastated in an enormous fire in 1887,Affairs in Foreign Lands; the burning of Whiteley's great establishment. The loss estimated at $2,500,00 - incendiarism suspected. The New York Times, 8 August 1887 one of the largest fires in London's history.Shepard, Ernest H (1957) Drawn from Memory, Penguin Books, London,  This was the last of four fires that had devastated the business from 1882. In his autobiography, Drawn From Memory, E. H. Shepard said the fire could be seen from Highgate Hill, and – some days later when he and his brother Cyril were allowed to visit Westbourne Grove – that \"The long front of the shop was a sorry sight with part of the wall fallen and the rest blackened.\""]}, {"page": "Victor Ambrus", "response": ["Ambrus was born on 19 August 1935 in Budapest, Hungary. He continued to live in the capital, but spent many childhood holidays in the country, where he learnt to draw horses. As he grew older he became an admirer of the illustrators Mihály Zichy, E. H. Shepard, Joyce Lankester Brisley, and the large historical paintings which he saw in public galleries. He received his secondary education at the St Imre Cistercian College, Budapest (1945–1953), before going on to study at the Hungarian Academy of Fine Arts for three years (1953–56), where he was given a thorough grounding in drawing, anatomy and print-making. His four-year course was interrupted by the unsuccessful 1956 Hungarian Revolution against the Soviet-backed government, during which a building that he and his fellow students held came under fire from the Soviets.", "In December 1956 he and many other students fled, first to Austria, then to Britain, where he hoped to study in the tradition of illustrators such as E. H. Shepard, John Tenniel and Arthur Rackham. From Blackbushe Airport and Crookham army camp, speaking no English, Ambrus presented himself at Farnham Art School, and was taken on, not to follow any particular course but to work at his drawing. Ambrus had already concentrated largely on engraving and lithography which, as he says, was an excellent training for line illustration. After two terms his tutor and the Principal of Farnham School, recognising that Victor was ready for a higher level of study, commended him to the Royal College of Art in London. Ambrus won a Gulbenkian scholarship to study printmaking and illustration there for three years (1957–60)."]}, {"page": "Miniature book", "response": ["* Queen Mary's Dolls' House at Windsor Castle in Great Britain contains a miniature library of 200 books created expressly for the collection in the 1920s at a 1:12 scale. Along with reference volumes, a Bible and the Quran, the library includes works—some written expressly for the collection—by prominent authors of the day such as Arthur Conan Doyle, Thomas Hardy, and Vita Sackville-West. The books were bound by Sangorski & Sutcliffe, and contained miniature bookplates illustrated by E. H. Shepard. "]}, {"page": "Now We Are Six", "response": ["Now We Are Six is a book of thirty-five children's verses by A. A. Milne, with illustrations by E. H. Shepard. It was first published in 1927 including poems such as \"King John's Christmas\", \"Binker\" and \"Pinkle Purr\". Eleven of the poems in the collection are accompanied by illustrations featuring Winnie-the-Pooh. These include: \"The Charcoal Burner\", \"Us Two\", \"The Engineer\", \"Furry Bear\", \"Knight-in-armour\", \"The Friend\", \"The Morning Walk\", \"Waiting at the Window\", \"Forgotten\", \"In the Dark\" and \"The End\". It includes an endearing introduction by the author speaking in his six year old voice reflecting on, and perhaps rationalising, the 'babyish' subjects of his early verse.", "Category:Books illustrated by E. H. Shepard"]}, {"page": "The Clicking of Cuthbert", "response": ["In The Strand Magazine (UK),  E. H. Shepard illustrated \"Sundered Hearts\", \"A Mixed Threesome\", \"The Rough Stuff\", and \"The Salvation of George Mackintosh\".McIlvaine (1990), p. 184, D133.73, D133.76–77, D133.79. Wilmot Lunt illustrated \"The Unexpected Clicking of Cuthbert\".McIlvaine (1990), p. 184, D133.81. \"Popini\" illustrated \"A Woman is Only a Woman\".McIlvaine (1990), p. 183, D133.61. A. T. Smith illustrated \"A Kink in His Character\" (\"Ordeal by Golf\").McIlvaine (1990), p. 183, D133.63. A. Wallis Mills illustrated \"The Long Hole\".McIlvaine (1990), p. 184, D133.80.  Alfred Leete illustrated \"The Heel of Achilles\".McIlvaine (1990), p. 184, D133.82. G. Morrow illustrated \"The Coming of Gowf\".McIlvaine (1990), p. 184, D133.78."]}, {"page": "List of best-selling books", "response": ["|Winnie-the-Pooh || A. A. Milne; illustrated by E. H. Shepard || English || 2 ||  1926–1928 || 70 million"]}, {"page": "Winnie the Pooh and the Honey Tree", "response": ["The short initially received mixed reception. Howard Thompson of The New York Times said that \"[t]he Disney technicians responsible for this beguiling miniature have had the wisdom to dip right into the Milne pages, just the way Pooh paws after honey...The flavoring, with some nice tunes stirred in, is exactly right—wistful, sprightly and often hilarious. Kenneth Tynan of The Observer felt \"The sedate foolishness of Pooh is prettily captured, and there are very few offensive additions. Purists, however, will rightfully baulk at such innovations as the stammering gopher and the songs, in one of which Pooh is made to sing:  'Speaking poundage-wise / I improvise my appetite when I exercise.  E. H. Shepard felt the replacement was \"a complete travesty\", and Felix Barker of The Evening News ran a campaign opposed to the change. A. A. Milne's widow, Daphne, is said to have liked it."]}]}}