{"wiki_id": "http://www.wikidata.org/entity/Q3830301", "itemLabel": "L. Harrison Matthews", "itemDescription": "British zoologist (1901-1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/L._Harrison_Matthews", "wikipedia_page": {"main": "Leonard Harrison Matthews FRS (12 June 1901 – 27 November 1986) was a British zoologist, especially known for his research and writings on marine mammals.", "link_mentions": [{"page": "New Naturalist", "response": ["|L. Harrison Matthews", "|L. Harrison Matthews"]}, {"page": "Cephalopod size", "response": ["Nevertheless, claims of enormous sucker scars are widespread in the literature. Richard Ellis collected some of \"the more egregious examples\" in his book, The Search for the Giant Squid.see Ellis, 1998a:142 These include the claim of Dozier (1976) that \"an ordinary giant squid of 50 feet [] leaves teeth-ringed sucker marks measuring between three and four inches [] across on a whale, but sperm whales have been captured with tentacle marks 18 inches [] across.\" L. Harrison Matthews's monographic treatment of the sperm whale, published in 1938, includes the following: \"Nearly all male Sperm whales carry scars caused by the suckers and claws of large squids, scars caused by suckers up to 10 cm. [] in diameter being common. The claw marks take the form of scratches 2–3 m. [] in length, and appear to be of more frequent occurrence than sucker marks\".Matthews, 1938 Ellis (1998a:142) wrote that this 10 cm figure is \"so much larger than any other recorded sucker dimensions that one suspects some sort of error, either in measuring or in transcription.\""]}, {"page": "Drygalski Fjord", "response": ["According to L. Harrison Matthews, Drygalski Fjord might have been the place where Anthony de la Roché spent two weeks during his stay in the island in April 1675."]}, {"page": "Harrison Point", "response": ["Harrison Point is a point marked by a string of off-lying rocks, lying  west of Busen Point on the south side of Stromness Bay, South Georgia. It was charted in 1927 by Discovery Investigations (DI) personnel and named \"Matthews Point\" for L. Harrison Matthews, a British zoologist and member of the DI staff, 1924–35, who worked at South Georgia in 1924–27. In 1954, the UK Antarctic Place-Names Committee recommended that this name be altered to Harrison Point to avoid duplication with Matthews Point (also named for L. Harrison Matthews), a better known feature in Undine Harbour, South Georgia. This change allows Matthews' name to be retained for this feature, while the confusing duplication of names is avoided."]}, {"page": "Matthews Point", "response": ["Matthews Point () is a point forming the west side of the entrance to Undine Harbour, along the south coast and near the west end of South Georgia. It was charted between 1926 and 1930 by Discovery Investigations (DI) personnel and named for British zoologist L. Harrison Matthews, a member of the staff of the DI from 1924 to 1935, who worked at South Georgia from 1924 to 1927."]}, {"page": "Leonard Harrison Matthews", "response": ["#Redirect L. Harrison Matthews"]}, {"page": "L Harrison Matthews", "response": ["#Redirect L. Harrison Matthews "]}]}}