{"wiki_id": "http://www.wikidata.org/entity/Q3849278", "itemLabel": "Marion Wallace Dunlop", "itemDescription": "British artist and suffragette (1864-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marion_Wallace_Dunlop", "wikipedia_page": {"main": "Marion Wallace Dunlop (22 December 1864 – 12 September 1942) was a Scottish artist and author. She was the first and one of the most well known British suffragettes to go on hunger strike, on 5 July 1909, after being arrested in July 1909 for militancy. She said she would not take any food unless she was treated as a political prisoner instead of as a common criminal. Wallace Dunlop's mode of protest influenced suffragettes after her and other leaders like M. K. Gandhi and James Connolly, who also used fasting to protest British rule. She was at the centre of the Women's Social and Political Union and designed processions and banners for them.\n\n", "link_mentions": [{"page": "Emmeline Pankhurst", "response": ["In 1909 the hunger strike was added to the WSPU's repertoire of resistance. On 24 June Marion Wallace Dunlop was arrested for writing an excerpt from the Bill of Rights (1688 or 1689) on a wall in the House of Commons. Angered by the conditions of the jail, Dunlop went on a hunger strike. When it proved effective, fourteen women imprisoned for smashing windows began to fast. WSPU members soon became known around the country for holding prolonged hunger strikes to protest their incarceration. Prison authorities frequently force-fed the women, using tubes inserted through the nose or mouth. The painful techniques (which, in the case of mouth-feeding, required the use of steel gags to force the mouth open) brought condemnation from suffragists and medical professionals.Purvis 2002, pp. 129–135; Bartley, pp. 113–114."]}, {"page": "Alice Paul", "response": ["Another popular civil disobedience tactic used by the Suffragettes was hunger striking. The first WSPU related hunger strike was conducted by sculptor Marion Wallace Dunlop in June 1909. By that fall it was being widely used by WSPU members because of its effectiveness in publicizing their mistreatment and gaining quick release from prison wardens. Refusing food worked in securing an early release for Paul during her first two arrests. However, during her third prison stint, the warden ordered twice daily force-feeding to keep Paul strong enough to finish out her month-long sentence."]}, {"page": "First-wave feminism", "response": ["* United Kingdom: In July, Marion Wallace Dunlop became the first imprisoned suffragette to go on a hunger strike. As a result, force-feeding was introduced."]}, {"page": "List of suffragists and suffragettes", "response": ["* Marion Wallace Dunlop (1864–1942) – artist and suffragette", "* Marion Wallace Dunlop (1864–1942) – suffragette went on hunger strike after being arrested for militancy"]}, {"page": "Dunlop (surname)", "response": ["* Marion Wallace Dunlop (1864–1942), British suffragette"]}, {"page": "Women's suffrage in the United Kingdom", "response": ["* 5 July 1909: Marion Wallace Dunlop went on the first hunger strike – was released after 91 hours of fasting"]}, {"page": "Suffragette", "response": ["Suffragettes were not recognised as Political prisoners, and many of them staged hunger strikes while they were imprisoned. The first woman to refuse food was Marion Wallace Dunlop, a militant suffragette who was sentenced to a month in Holloway for vandalism in July 1909. Without consulting suffragette leaders such as Pankhurst,. Dunlop refused food in protest at being denied political prisoner status. After a 92-hour hunger strike, and for fear of her becoming a martyr, the Home Secretary Herbert Gladstone decided to release her early on medical grounds. Dunlop's strategy was adopted by other suffragettes who were incarcerated.. It became common practice for suffragettes to refuse food in protest for not being designated as political prisoners, and as a result they would be released after a few days and could return to the \"fighting line\".."]}, {"page": "July 1909", "response": ["*Suffragette Marion Wallace Dunlop introduced the \"hunger strike\" to Britain, after being jailed for disturbing Parliament.  Dunlop's fast lasted 91 hours, attracting enough publicity that the government agreed to meet with the suffrage movement leaders.  She was released on July 8, becoming a heroine for women's suffrage and an example for protestors ever since.James Vernon, Hunger: A Modern History (Harvard University Press, 2007), p61; \"Hunger Strike Succeeds\", New York Times, July 9, 1909, p3"]}]}}