{"wiki_id": "http://www.wikidata.org/entity/Q3849445", "itemLabel": "Mark Beevers", "itemDescription": "British footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Beevers", "wikipedia_page": {"main": "Mark Geoffrey Beevers (born 21 November 1989) is an English professional footballer who plays as a defender for Championship club Peterborough United.", "link_mentions": [{"page": "Tommy Spurr", "response": ["Spurr scored his third goal for Wednesday against Watford in a 2–0 win at Hillsborough on 13 September 2008. Despite playing at centre back for the game due to an injury sustained by Mark Beevers, Spurr found himself 50 yards out on the left wing and played a give and go with Etiënne Esajas, before sliding the ball right footed past Mart Poom from 8 yards."]}, {"page": "David Wheater", "response": ["Bolton finished the season in second place, earning promotion back to the Championship at the first attempt. Wheater was named as Bolton player of the season for the 2016–17 season. Wheater, alongside defensive partner Mark Beevers, was also named in the League One Team of the Season and Wheater was also voted PFA Fans' Sky Bet League One Player of the Season."]}, {"page": "Richard Hinds", "response": ["In only the second game of the 2008–09 season, a 1–4 defeat away at Wolverhampton Wanderers, Hinds suffered a severe fracture of his left leg. The injury looked like keeping him out for the majority of the remaining season but he returned in late February and once again became a regular member of the squad and in mid-march began claiming his place in the centre of the Owls defence at the expense of Mark Beevers. Hinds remained a firm fan favourite at Sheffield Wednesday, as he became one of the shining lights of the team and a rock at the centre of the defence. However, in the 2009–10 season he failed to hold down a place in the squad."]}, {"page": "Danny Shittu", "response": ["In the 2013–14 season, Shittu continued to remain as the club's captain in the absence of Robinson, who still injured, and started for the first six league matches before dropped for two matches following his performance in a 5–1 loss against Derby County on 16 September 2013. But following Mark Beevers’ injury, Shittu returned to the first team as captain on 28 September 2013, in a 2–0 win over Leeds United. Shittu then scored his first goal of the season on 2 November 2013, in a 2–2 draw against Burnley. However, Shittu was demoted to the substitute in number of matches by the end of 2013 before his return to the first team on 26 December 2013 against Watford was short–lived when he received a red card in early first half, in a 4–0. However, towards the end of the season, Shittu was sidelined again that ruled him out for the rest of the season. Nevertheless, Shittu went on to make twenty–three appearances and scoring once in all competitions. Shittu was also awarded the Junior Lions Player of the Year at the end of the season."]}]}}