{"wiki_id": "http://www.wikidata.org/entity/Q3849483", "itemLabel": "Mark Franchetti", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Franchetti", "wikipedia_page": {"main": "Mark Franchetti is a journalist and documentary filmmaker. He worked for 23 years as a correspondent for the Sunday Times of London, much of it as the paper's Moscow correspondent. Fluent in five languages, Franchetti was awarded the British Press Award in 2003, after reporting on the Moscow theatre siege, when he entered the building twice during the hostage taking to interview the terrorists and a Foreign Press Association award in 2004 for his reports on the alleged abuse of Iraqi civilians by U.S Marines. He mainly writes about Russia and the former Soviet Union, has reported extensively on the conflict in Chechnya and covered the wars in Kosovo, Iraq, Afghanistan, Georgia, and Ukraine.\nHe works both in print and TV and has presented and produced several prime time documentaries. Among them are, “Terror in Moscow” for Britain's C4 which was shortlisted for a BAFTA. For the BBC: “Britain’s Most Wanted”, about Andrei Lugovoi, following the death by poisoning of Alexander Litvinenko. “Should We Be Scared of Russia”, a BBC Panorama after the war in Georgia. “The Berlusconi Show”, about the former Italian Prime Minister and “Italy’s Bloodiest Mafia”, an investigation into the Camorra.  In 2013 he produced The Condemned, his first feature-length documentary, spending three weeks inside a remote Russian prison exclusively for murderers. With the start of the 2014 Russian aggression against Ukraine, he was involved in promoting armed militants in the east Ukraine \"Vostok\" calling them \"brave and enthusiastic\". In August of 2014 he was involved in freeing of Iryna Dovhan from detention of the Vostok battalion led by Alexander Khodakovsky. In 2015 Franchetti produced and co-directed Bolshoi Babylon, a feature-length documentary about the Bolshoi Theatre for HBO and the BBC. In 2019 he co-directed and co-produced a feature-length documentary about Tommaso Buscetta titled Our Godfather which was bought by Netflix.", "link_mentions": [{"page": "Moscow theater hostage crisis", "response": ["During the third day, the following people took part in negotiations with the militants: journalists Anna Politkovskaya, Sergei Govorukhin and Mark Franchetti as well as public figures Yevgeny Primakov, Ruslan Aushev and again, Aslambek Aslakhanov. The terrorists demanded negotiations with an official representative of Vladimir Putin. Relatives of the hostages staged anti-war demonstrations outside the theater and in central Moscow."]}, {"page": "Beppe Grillo", "response": ["Since the early 1990s Grillo's appearances on television became rare; according to Mark Franchetti, politicians were offended by his jokes.Mark Franchetti, The Berlusconi Show, BBC documentary first aired 17 March 2010. Franchetti states: \"it is telling that he [Grillo] has not been allowed back on the networks, dominated by Berlusconi and his allies.\" When one of his shows was allowed to be broadcast live by RAI in 1993, it obtained a record share of 15 million viewers. Grillo often accuses the public broadcaster RAI of \"public financing for the parties\" that abuse it for their own propagandist needs."]}, {"page": "The Sunday Times", "response": ["John Witherow oversaw a rise in circulation to 1.3 million and reconfirmed The Sunday Times's reputation for publishing hard-hitting news stories – such as Cash for Questions in 1994 and Cash for Honours in 2006, and revelations of corruption at Fifa in 2010. The newspaper's foreign coverage has been especially strong, and its reporters, Marie Colvin, Jon Swain, Hala Jaber, Mark Franchetti and Christina Lamb have dominated the Foreign Reporter of the Year category at the British Press Awards since 2000. Colvin, who worked for the paper from 1985, was killed in February 2012 by Syrian forces while covering the siege of Homs during that country's civil war."]}, {"page": "List of deaths related to the Russian apartment bombings", "response": ["*Alexander Litvinenko, an author of two books about the events, was assassinated in London.U.K. officially views ex-spy's poisoning as murder case, Associated Press, December 6, 2006  In a book he co-authored with Yuri Felshtinsky, Mr. Litvinenko claimed that FSB was behind the bombings.Agents 'asked me to betray Litvinenko', Mark Franchetti, December 9, 2007, The Sunday Times"]}, {"page": "Iryna Dovhan", "response": ["Iryna Dovhan (; born 25 January 1962) and a native of Yasynuvata (a Donetsk suburb), who was abducted in 2014 by pro-Russian insurgents of the Vostok Battalion. She says that she was beaten and humiliated for five days. According to her testimony, she was held in jail and interrogated before being handed over to mercenaries, apparently from North Ossetia, who subjected her to torture, calling her a fascist and forcing her to shout \"Sieg Heil\", repeatedly shooting pistols next to her ears and threatening to rape her. She was freed on August 28 after, Mark Franchetti, a reporter for the British newspaper The Sunday Times, and Dmitry Beliakov, a Russian freelance photographer, pleaded with leader Alexander Khodakovsky to release her. Khodakovsky ordered Iryna Dovhan freed and vowed to discipline those responsible for her detention and public humiliation. She has since left Donetsk and joined her family in Mariupol, a city controlled by Ukrainian forces."]}, {"page": "Dmitry Beliakov", "response": ["In August 2014, while covering the War in Donbass in eastern Ukraine, Dmitry Beliakov and his colleague Mark Franchetti, a reporter for the British newspaper The Sunday Times, pleaded with the pro-Russian rebel leader Alexander Khodakovsky to release Iryna Dovhan, a local resident who had been abducted by the insurgent group Vostok Battalion and subjected to imprisonment, torture and humiliation, for being accused of being a spy for the Ukrainian forces. This plead came after a photograph of her mistreatment taken by another photojournalist, Maurício Lima, stirred widespread outrage in Ukraine, prompted a social media effort to identify her and drew the attention of United Nations human rights monitors. The plead was attended and she was released."]}, {"page": "Franchetti, Mark", "response": ["#redirectMark Franchetti"]}]}}