{"wiki_id": "http://www.wikidata.org/entity/Q3849450", "itemLabel": "Mark Bradley", "itemDescription": "association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Bradley_(footballer,_born_1988)", "wikipedia_page": {"main": "Mark Simon Bradley (born 14 January 1988) is a Welsh former professional footballer who played in the Football League for Walsall and Rotherham United. He made one appearance for the Wales national team in 2010. After retiring from professional football, Bradley moved to coaching and is currently employed as the strength and conditioning coach at his former club, Walsall.", "link_mentions": [{"page": "Peter Till", "response": ["Till signed for League One club Walsall on a free transfer on a one-year contract on 23 July 2009 following a successful trial with the club. He commented \"To be at my hometown club gives me an extra incentive to do well\". His debut came in a 1–0 victory at Brighton & Hove Albion on 8 August 2009, in which he was substituted in the 88th minute. Till suffered a hamstring injury in September 2009, which allowed midfielder Mark Bradley to get a run in the team. After returning to fitness he made his comeback as a 74th-minute substitute in a 1–0 defeat at MK Dons on 10 October 2009 and started on his next appearance, which was a 2–1 defeat at Colchester United on 24 October. He picked up a minor injury in a 1–1 draw with Charlton Athletic on 2 February 2010 and he was able to feature in the next game, a 0–0 draw with Bristol Rovers. During Walsall's 2–1 victory at Leeds United on 16 February 2010 he picked up a hamstring injury and he returned to the team after entering a 2–0 defeat at Leyton Orient on 13 March as a 77th-minute substitute. He finished an injury-hit 2009–10 season with 30 appearances for Walsall before the club released him on 10 May 2010."]}, {"page": "Neil Taylor (footballer)", "response": ["Taylor was also eligible for India through his mother. He made his debut for Wales on 23 May 2010 in a friendly against Croatia at the Stadion Gradski vrt, replacing Andy Dorman for the final 23 minutes of the 2–0 loss; he and Mark Bradley had been promoted from the under-21 team in an emergency. In May 2011, he played two matches at the Nations Cup in Dublin."]}, {"page": "2009 UEFA European Under-21 Championship qualification Group 10", "response": ["*: Mark Bradley, Shaun MacDonald, Rhoys Wiggins, Mike Williams, Rhys Williams"]}, {"page": "Mark Bradley (disambiguation)", "response": ["Mark Bradley (born 1982) is an American football wide receiver.", "Mark Bradley may also refer to:", "* Mark Bradley (footballer, born 1976), Scottish footballer", "* Mark Bradley (footballer, born 1988), Welsh international footballer", "* Mark Bradley (baseball) (born 1956), American baseball player", "* Mark Bradley (cricketer) (born 1966), New Zealand cricketer", "* Mark Bradley (Gaelic footballer) (born 1994/95)"]}, {"page": "Mark Bradley (footballer, born 1976)", "response": ["Mark Bradley (born 10 August 1976) is a Scottish football player and manager. Bradley played for Hearts, Stirling Albion, Cowdenbeath, Berwick Rangers, Dumbarton, Bathgate Thistle and Linlithgow Rose. He was appointed manager of Linlithgow Rose in December 2011."]}, {"page": "Richard Brindley", "response": ["Brindley made his Rotherham debut in the opening game of the 2013–14 season, starting in a 3–3 draw with Crewe Alexandra. During the first few weeks of the season, Brindley held down the right-back spot following an injury to Utility player Mark Bradley, who provided competition for the position across the season, and on-loan Newcastle United right-back James Tavernier."]}, {"page": "2013–14 Brentford F.C. season", "response": ["October started with a home defeat to Rotherham United. David Button returned in goal following suspension but couldn't prevent an early goal from Mark Bradley settling the match. Brentford bowed out of the Football League Trophy with a defeat away to Peterborough United. An early own goal from Martin Taylor gave the home side the lead, and the lead was doubled in the second half when debutant Raphaël Calvet brought down Nathaniel Mendez-Laing in the box and the resulting penalty was converted by Grant McCann. Ben Nugent scored a late consolation goal but it wasn't enough to stop Brentford exiting the competition."]}, {"page": "2013–14 Rotherham United F.C. season", "response": ["|Mark Bradley"]}, {"page": "Mark Bradley (footballer born 1988)", "response": ["#REDIRECT Mark Bradley (footballer, born 1988)"]}, {"page": "2015–16 Rotherham United F.C. season", "response": ["| 1 July 2015 || RWB ||  || Mark Bradley || Free agent || Released || "]}, {"page": "2009–10 Walsall F.C. season", "response": ["|Mark Bradley"]}]}}