{"wiki_id": "http://www.wikidata.org/entity/Q384206", "itemLabel": "Dave Stewart", "itemDescription": "English keyboardist and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Stewart_(keyboardist)", "wikipedia_page": {"main": "Dave Stewart (born David Lloyd Stewart, 30 December 1950) is an English keyboardist and composer known for his work with the progressive rock bands Uriel, Egg, Khan, Hatfield and the North, National Health, and Bruford. Stewart is the author of two books on music theory and wrote a music column for Keyboard magazine (USA) for 13 years. He has also composed music for TV, film and radio, much of it for Victor Lewis-Smith's ARTV production company. He has worked with singer Barbara Gaskin since 1981.", "link_mentions": [{"page": "Stiff Records", "response": ["* Dave Stewart"]}, {"page": "Gong (band)", "response": ["Gong are a progressive rock band that incorporates elements of jazz and space rock into their musical style. The group was formed in Paris in 1967 by Australian musician Daevid Allen and English vocalist Gilli Smyth. Band members have included Didier Malherbe, Pip Pyle, Steve Hillage, Mike Howlett, Pierre Moerlen, Bill Laswell and Theo Travis. Others who have played on stage with Gong include Don Cherry,Lucky, Jerry. Progressive Rock. Burlington, Ontario: Collector's Guide Publishing, Inc., 2000. p.61 Chris Cutler, Bill Bruford, Brian Davison, Dave Stewart and Tatsuya Yoshida."]}, {"page": "Louie Louie", "response": ["After their No. 1 hit \"Guantanamera\", the Sandpipers, with producer Tommy LiPuma and arranger Nick DeCaro, \"cleverly revived\" the same soft rock, smooth ballad Spanish language approach to \"Louie Louie\", reaching No. 30 and No. 35 on the Billboard and Cash Box charts, respectively (the highest charting U.S. version after the Kingsmen). The success of their \"smoky version\" heralded the entry of the ever adaptable \"Louie Louie\" into the MOR and easy listening categories and many followed: David McCallum and J.J. Jones (1967), Honey Ltd. (1968), Julie London (1969), Sounds Orchestral (1970), Line Renaud (1973), Dave Stewart and Barbara Gaskin (1991), and others released singles and albums featuring slower and mellower versions of what had previously been an up tempo pop and rock standard."]}, {"page": "1981 in music", "response": ["*\"It's My Party\" – Dave Stewart (the keyboardist) & Barbara Gaskin (4)", "**Vanessa Amorosi, Australian singer-songwriter, musician, guitarist and rock star (Dave Stewart) "]}, {"page": "Thomas Dolby", "response": ["In October 1981 Dolby made an appearance in the video for the Dave Stewart and Barbara Gaskin British number one cover of \"It's My Party,\" playing the part of Johnny in the \"Judy and Johnny just walked through the door\" section of the song. The video made its first Top of the Pops appearance on 29 October 1981."]}, {"page": "The Young Ones (TV series)", "response": ["In 1984, Planer released an album of music and skits in character as Neil, entitled Neil's Heavy Concept Album. Musical direction was by Canterbury scene keyboardist Dave Stewart. It featured Stewart's alums Barbara Gaskin, Jakko Jakszyk, Pip Pyle, Gavin Harrison, Jimmy Hastings and Rick Biddulph. \"Hole in My Shoe\", a single taken from the LP, reached number 2. Soulwax used \"Hello Vegetables\" to kick off their Radio Soulwax mix \"Introversy.\""]}, {"page": "Joe Meek", "response": ["* Dave Stewart (the keyboardist) and Barbara Gaskin recorded the song \"Your Lucky Star\" dealing with the life and death of Meek, released on the 1991 album \"Spin\". Dave Stewart also recorded a version of \"Telstar\" on the occasion of its 40th anniversary in 2002. This was later released on the Dave Stewart and Barbara Gaskin 2009 mini-album \"Hour Moon\". The album also features the duo's previously released Meek tribute \"Your Lucky Star\" from their 1991 album \"Spin\"."]}, {"page": "Canterbury scene", "response": ["These musicians played together in numerous bands, with ever-changing and overlapping personnel, creating some similarities in their musical output.  Many prominent British avant-garde or fusion musicians began their career in Canterbury bands, including Hugh Hopper, Steve Hillage, Dave Stewart (the keyboardist), Robert Wyatt, Kevin Ayers, Daevid Allen, and Mike Ratledge.", "There is debate about the existence and definition of the scene. Dave Stewart has complained at the nomenclature as he and many other musicians identified with the Canterbury scene never had anything to do with Canterbury, the place. The former Soft Machine bassist Hugh Hopper, who lived in Whitstable, near Canterbury, said: \"I think it's a rather artificial label, a journalistic thing... I don't mind it, but people like Robert [Wyatt], he in fact hates that idea, because he was born somewhere else and just happened to go to school here. In the time when the Wilde Flowers started we hardly ever worked in Canterbury. It wasn't until Robert and Daevid [Allen] went to London to start Soft Machine that anything happened at all. They weren't really a Canterbury band [...] if it helps people understand or listen to more music then it is fine.\""]}, {"page": "Nick Mason", "response": ["* 2008 : Robert Wyatt & Friends - Theatre Royal Drury Lane 8th September 1974 - With Hugh Hopper, Mike Oldfield, Dave Stewart, Fred Frith, Julie Tippetts, Ivor Cutler, etc."]}, {"page": "Dave Stewart", "response": ["Dave Stewart may refer to:", "* Dave Stewart (musician and producer) (born 1952), English musician and record producer best known for his work with Eurythmics", "* Dave Stewart (keyboardist) (born 1950), former member of Egg, Hatfield and the North, National Health, Bruford, who works with vocalist Barbara Gaskin", "* Dave Stewart (trombonist), bass trombonist and music teacher based in London", "* Dave Stewart (baseball) (born 1957), former pitcher in Major League Baseball and 1989 World Series MVP", "* Dave Stewart (footballer, born 1958), Northern Irish footballer (Hull City, Scunthorpe United, Northern Ireland)", "* Dave Stewart (Scottish footballer) (born 1978), Scottish footballer for Dumbarton", "* Dave Stewart (soccer), retired American soccer forward", "* Dave Stewart (artist), colorist in the comics industry", "* Dave Stewart (EastEnders), fictional character in EastEnders"]}, {"page": "Bill Bruford", "response": ["In 1977, Bruford recorded his debut solo album Feels Good to Me (1978), with Dave Stewart (keyboards), Jeff Berlin (bass), and Allan Holdsworth (guitar). This was Bruford's first attempt at songwriting on a substantial level, and spent a lot of time developing tunes on the piano. The four stuck together and became a full-time band named Bruford, which also featured Annette Peacock on vocals, Kenny Wheeler on flugelhorn, and John Goodsall on rhythm guitar. Later in 1978, Bruford reunited with John Wetton and formed the progressive rock group U.K. After their debut album U.K. (1978) and several tours, Holdsworth and Bruford left the group due to disagreements on the group's musical direction. Bruford resumed activity in his own group to release One of a Kind (1979). Almost entirely instrumental, the album contains some spoken lines by Bruford during the introduction to \"Fainting in Coils\". Subsequent gigs spawned the live releases Rock Goes to College and The Bruford Tapes (1979). Their final album, Gradually Going Tornado (1980), features backing vocals from Canterbury scene stalwarts Barbara Gaskin and Amanda Parsons, as well as Georgina Born on cello. Unfinished songs for a projected fourth album were recorded in 1980, but remained unreleased until 2017.", "In 1986, Bruford formed his jazz group Earthworks with Django Bates, Iain Ballamy and Mick Hutton (later replaced by Tim Harries), with initial assistance from Dave Stewart. By then, electronic drum technology had improved to Bruford's satisfaction and he resumed using the Simmons kit. The band toured the US club circuit through 1987.", "*Dave Stewart and Barbara Gaskin – Up from the Dark (1986)", "*Dave Stewart and Barbara Gaskin – As Far as Dreams Can Go (1988)"]}, {"page": "Steve Hillage", "response": ["Hillage was born in Chingford, which was then in Essex but is now part of Greater London. Whilst still at school, he joined his first band, a blues rock band called Uriel, with Dave Stewart, Mont Campbell and Clive Brooks. The band split up in 1968 with the other members going on to form Egg, but they briefly re-united under assumed names to record the album Arzachel in 1969. Hillage also guested on Egg's 1974 album The Civil Surface.", "In 1969, Hillage began studies at the University of Kent in Canterbury, befriending local bands Caravan and Spirogyra and occasionally jamming with them. Meanwhile, he wrote songs and, by late 1970, had accumulated enough material for an album. Caravan put him in touch with their manager Terry King, who got Hillage signed with Deram on the basis of a demo of his material recorded with the help of Dave Stewart of Egg. In early 1971, Hillage formed Khan with bassist/vocalist Nick Greenwood, formerly of Crazy World of Arthur Brown. Although future Gong and Hatfield and the North drummer Pip Pyle was involved in the early stages, the line-up finally settled with the inclusion of organist Dick Heninghem and drummer Eric Peachey, both of whom had recently collaborated on Greenwood's solo project Cold Cuts, recorded in California in 1970 but belatedly released in 1972.", "Following a series of concerts throughout 1971, several of them supporting label mates Caravan, Khan began recording their debut album in November, by which time Heninghem had left, forcing Hillage to bring in his former bandmate Dave Stewart to play the keyboard parts. By the time Space Shanty came out in May 1972, Canadian Val Stevens (formerly of Toronto's popular soul-rock band Grant Smith & The Power) had filled the vacancy, making his debut on a short European tour (including a televised appearance at the Montreux Festival) and continuing with a UK tour supporting Caravan in June.", "His motivation to do so was fueled by the success of his solo album Fish Rising, recorded in late 1974 while still in Gong and featuring most of his bandmates, as well as former bandmate in Khan, Dave Stewart. His next effort L album was recorded in the United States using musicians from Todd Rundgren's Utopia, and on its release Hillage formed a touring band which toured in late 1976 including supporting Queen at Cardiff Castle and Hyde Park. During the latter half of the 1970s, Hillage made a name for himself as a guitarist and prog-rock/fusion composer and performer. 1977's Motivation Radio, with its shorter tracks, marked a departure from the long instrumental workouts of previous efforts, but 1978's Green, co-produced by Pink Floyd's Nick Mason, was a return to his earlier work.", "Also in 1979, Hillage released Open on Virgin Records, featuring Dave Stewart, Jean-Philippe Rykiel, Paul Francis and Andy Anderson."]}, {"page": "David Stewart", "response": ["*Dave Stewart (musician and producer) or David A. Stewart (born 1952), English musician and record producer best known for his work with Eurythmics", "*Dave Stewart (keyboardist), keyboard player with UK progressive rock bands in the 1970s and best known for his 1981 hit version of \"It's My Party\" with Barbara Gaskin", "*Dave Stewart (disambiguation)"]}, {"page": "Zabranjeno Pušenje", "response": ["In early 2000, the band came back to the Bjelolasica Olympic Centre to work on the band's seventh album. In the meantime, the band got a new member; world-class percussionist Albin Jarić, better known as Jimi Rasta, who worked previously with musicians such as Dave Stewart and Eric Clapton. Bog vozi Mercedes () was record by home made production in improvised studios in Bjelolasica and Ivanić Grad from March to June 2001. This record was planned to be a noncommercial break from the major music projects. No one expected that it would become one of the most selling Zabranjeno pušenje albums. The album is released in December 2001 through TLN-Europa and Menart Records, and went on to sell more than 35,000 copies. Sejo Sexon wrote and produced four music videos, out of six released. For the song \"Arizona Dream\" the band won the 2002 Davorin Award for the best rock song. The concert tour by the band in support of their seventh studio album had 250 concerts."]}, {"page": "Barbara Gaskin", "response": ["Gaskin was lead vocalist in British folk-prog band Spirogyra (1969–1974). From 1973 to 1976, she sang backing vocals with Dave Stewart's band Hatfield and the North, as one-third of 'The Northettes' (with Ann Rosenthal and Amanda Parsons, both since retired from music).  In 1981, she and Stewart formed a duo, and later in September of that year, they had a number one single in the UK with a cover version of the song \"It's My Party\". Subsequent singles \"Busy Doing Nothing\" (1983), and \"The Locomotion\" (1986) also entered the UK Singles Chart, without reaching the heights of their debut release. Seven albums followed, released on the duo's own Broken Records label. Gaskin and Stewart continue to work together and occasionally play live concerts with Andy Reynolds (guitar, 1990–2009), Beren Matthews (guitar, 2018 onwards) and drummer Gavin Harrison (Tokyo 2001 and London 2018 concerts). Gaskin has also sung with Egg (The Civil Surface), National Health, Peter Blegvad (The Naked Shakespeare), Phil Miller, Nigel Planer (Neil's Heavy Concept Album), Jane Wiedlin (Tangled), Rick Biddulph  and Mont Campbell (Music from a Round Tower).", "In 1969 she moved from Hatfield to Canterbury to study for a degree in Philosophy and Literature at University of Kent at Canterbury, but immediately became involved in the Canterbury music scene, joining folk rock group Spirogyra as vocalist. Spirogyra quickly procured a recording contract and subsequently made 3 albums, namely:- 'St Radigunds' B & C Records (CAS 1042), 'Old Boot Wine' Pegasus Records (PEG 13), and 'Bells, Boots, & Shambles' Polydor (2310 246), while gigging extensively on the UK college circuit, as well as completing numerous successful tours of Europe. During the same period, Gaskin met guitarist Steve Hillage (also a student at Kent University) and via Hillage, the members of Canterbury band Caravan, and Hillage's old friend and musical colleague Dave Stewart. Gaskin guested both live and on record with Stewart's band 'Hatfield & The North', and was a member of the 'Ottawa Music Company', brainchild of Dave Stewart and `Henry Cow' drummer Chris Cutler. The intricate, largely instrumental music of bands such as Egg, Hatfield & The North and Henry Cow, and by contrast, the more spontaneous, lyrically driven approach of Spirogyra, were both powerful formative musical influences on Gaskin during the six years she lived in Canterbury.", "On returning to England, Gaskin was invited by drummer Germaine Dolan to play keyboards and sing in the all female band Red Roll On. Based in Canterbury, the band played in clubs and art colleges in the London area. But Gaskin also renewed her musical association with Dave Stewart by contributing vocals to his compositions on Bill Bruford's \"Gradually Going Tornado\" album. In 1981 Gaskin and Stewart joined forces and recorded the hit single \"It's My Party\". The collaboration has continued to this day with a series of singles and albums on their own Broken Records label and Rykodisc Records.", "===Singles / EPs with Dave Stewart===", "===Albums with Dave Stewart===", "*Dave Stewart & Barbara Gaskin Website"]}, {"page": "One of a Kind (Bruford album)", "response": ["One of a Kind is the second solo album by the drummer Bill Bruford, and the first proper album by his band Bruford. Released in 1979 on EG Records, it is a collection of instrumentals in a style that can loosely be defined as jazz fusion.  Bruford features guitarist Allan Holdsworth, bassist Jeff Berlin, and keyboardist Dave Stewart. \"Forever Until Sunday\" and \"The Sahara of Snow\" had originally been performed at 1978 concerts by Bruford and Holdsworth’s previous band U.K.. They were intended for a studio album, but were never properly recorded by U.K. as Bruford kept the pieces for himself when he and Holdsworth exited the band. U.K. bandmate Eddie Jobson co-wrote \"The Sahara of Snow\" and reprises his violin part on \"Forever Until Sunday\". Stewart's \"Hell's Bells\" utilizes a fragment penned by his former National Health colleague Alan Gowen (the 3-chord pattern underlying the guitar solo). Holdsworth's \"The Abingdon Chasp\" is the only piece he wrote for Bruford.", "# \"Hell's Bells\" (Dave Stewart, Alan Gowen) 3:32", "* Dave Stewart – keyboards, synthesizers, electronics"]}, {"page": "Honeybus", "response": ["Honeybus were a 1960s pop group formed in April 1967, in London. They are best known for their 1968 UK Top 10 hit single, \"I Can't Let Maggie Go\", written by group member Pete Dello who also composed their previous single \"(Do I Figure) In Your Life\", later recorded by Dave Berry, Ian Matthews, Joe Cocker, Dave Stewart, Paul Carrack, Samantha Jones, Dana and Pierce Turner."]}, {"page": "Chris Cutler", "response": ["Chris Cutler was born in January 1947 in Washington, D.C. to a British intelligence officer and his Austrian wife. In 1948 the family moved to England, where Cutler was brought up. He never studied music but tried his hand at banjo, guitar, trumpet and flute while at school. He finally settled for drums \"because I wanted to be in a band and drummers were scarcest.\" Cutler formed his first band in 1963, playing Shadows and Ventures instrumental covers, then played in several R&B and soul bands. In 1966 he joined a band called Louise, with Tony Durant (later of Fuchsia), which performed on the London psychedelic club circuit for three years before breaking up. Looking for work, Cutler placed a series of advertisements in Melody Maker over a period of nine months in 1970. This put him in touch with a number of musicians which led to Cutler and keyboardist Dave Stewart of Egg forming The Ottawa Music Company, a 26 piece rock composer's orchestra, in 1971. Soon afterwards, Henry Cow, looking to replace the drummer who had just left them, responded to one of Cutler's adverts and invited him to a rehearsal."]}, {"page": "Hatfield and the North", "response": ["Dave Sinclair left in January 1973, shortly after the band's appearance (with Robert Wyatt on guest vocals) on the French TV programme Rockenstock, and was replaced by Dave Stewart (from Egg) before the band's first recordings were made.", "After disbanding, Dave Stewart formed National Health with Alan Gowen from Gilgamesh; Phil Miller was a member throughout the band's existence, and Pyle joined in 1977. (Richard Sinclair also sat in on a couple of gigs and a BBC radio session that year.) Hatfield and the North and Gilgamesh had played a couple of shows together in late 1973, including a joint \"double quartet\" set, in some ways the prototype for National Health. Miller, Stewart, Pyle and Sinclair also worked together in various combinations on other projects."]}, {"page": "Gradually Going Tornado", "response": ["\"Land's End\" incorporates music keyboardist Dave Stewart has previously composed for the National Health album Of Queues and Cures (1978). Guitarist Allan Holdsworth does not appear, and he recommended John Clark as his replacement in the band after he had given Clark several guitar lessons. Clark was listed on the album sleeve as \"the unknown John Clark\" as part of a running joke related to his relative obscurity in comparison to his predecessor.", "* Dave Stewart – keyboards, synthesizers"]}, {"page": "O Superman", "response": ["The song was ranked among the top ten \"Tracks of the Year\" for 1981 by NME. It climbed to #2 in the UK Singles Charts, behind It's My Party by Dave Stewart and Barbara Gaskin.Official Singles Chart Top 75, 18 October 1981 - 24 October 1981"]}, {"page": "Colin Blunstone", "response": ["Blunstone also contributed to Dave Stewart's hit cover version of \"What Becomes of the Brokenhearted\" (1980). He went on to appear on several albums by the Alan Parsons Project including Eye in the Sky, where he sings the hit single \"Old and Wise\", and Ammonia Avenue (\"Dancing on a Highwire\"). In 1984, he joined with other Parsons musicians, most notably David Paton of PILOT/Parsons  to form Keats.", "* \"What Becomes of the Brokenhearted\" (with Dave Stewart) / \"There Is No Reward\" – Stiff Broken 1 (1980) (UK #13) (AUS #34)"]}, {"page": "Hole in My Shoe", "response": ["In the BBC sitcom The Young Ones, Neil, one of the principal characters, often sang a line from the song. Eventually, in July 1984, Nigel Planer, who played Neil, recorded a cover version of the song, which reached the same number 2 peak as the original.  It also peaked at number 29 in Australia. His version featured Barbara Gaskin on backing vocals and was produced by Dave Stewart."]}, {"page": "The Rotters' Club (album)", "response": ["* Dave Stewart – Fender Rhodes electric piano, Hammond organ, Minimoog, acoustic piano, tone generator"]}, {"page": "Egg (band)", "response": ["The founder members of Egg were Dave Stewart who played organ, Mont Campbell on bass and vocals, and drummer Clive Brooks. The band was formed of former members of Uriel, the other member of which was guitarist Steve Hillage. After Hillage left Uriel in August 1968, the other three continued as a trio. Having signed a deal with the Middle Earth club's management branch, they were advised to change their name to Egg, allegedly because Uriel \"sounded too much like 'urinal'\". In mid-1969 the band signed a deal with Decca's 'progressive' music subsidiary Deram and released their debut album in March 1970. While not a commercial success, it was received well enough for the label to finance the recording of a follow-up, but when the time came to release it, the label shelved it until producer Neil Slaven's lobbying finally resulted in The Polite Force coming out in February 1971. Now signed to The Groundhogs' management company, Egg finished the year with an increased touring schedule, but in spite of accumulating enough material for a third album, they were unable to secure another record deal, and split up in July 1972.", "Also available is a 26,000-word, 60-page companion booklet Copious Notes. Written by Dave Stewart, Mont Campbell and their close friend Antony Vinall, it tells the inside story of Uriel, Egg, Arzachel and the Ottawa Company, from the formation of Uriel in early 1968 to the making of Egg's final album The Civil Surface in 1974. The text includes personal memoirs, anecdotes, short stories, random recollections, social observation, period details, musical analysis and song lyrics, as well as a collection of archive photos taken by Terry Yetton and the musicians."]}, {"page": "No-Man", "response": ["The band released Schoolyard Ghosts on 12 May 2008, receiving some of the most favourable reviews of the band's career (the album was described as \"truly sublime\" by Classic rock magazine). Guest musicians included Pat Mastelotto, Theo Travis, Gavin Harrison, Colin Edwin, Bruce Kaphan (ex-American Music Club) and The London Session Orchestra (arranged by Dave Stewart)."]}, {"page": "National Health", "response": ["National Health were an English progressive rock band associated with the Canterbury scene. Founded in 1975, the band featured members of keyboardist Dave Stewart's band Hatfield and the North and Alan Gowen's band Gilgamesh, including guitarists Phil Miller and Phil Lee and bassist Mont Campbell as original members. The band was named after Stewart's National Health spectacles. Bill Bruford (previously of Yes and King Crimson) was the initial drummer, but was soon replaced by Pip Pyle. Campbell was replaced by Neil Murray and then John Greaves. Alan Gowen stopped performing with the group after their first album, but returned for their final tours, replacing Dave Stewart who resigned after their second album.  Guitarist Phil Miller was National Health's only constant member."]}, {"page": "Pip Pyle", "response": ["In 1972, Pyle worked with Paul Jones (who had been singing with Manfred Mann) and with British singer Bridget St John, before founding Hatfield and the North with the Miller brothers in 1972. Steve Miller was soon replaced in the band and the line-up eventually settled on Pyle, Phil Miller, Richard Sinclair and keyboardist Dave Stewart. Hatfield and the North was released in 1974, while a second album, The Rotters' Club, followed the next year. As well as drumming, Pyle wrote many of the band's lyrics.", "*Obituary by Dave Stewart of Hatfield and the North"]}, {"page": "Lindsay Cooper", "response": ["After Henry Cow, Cooper joined National Health (whom she had already sat in with), but left soon after when Dave Stewart departed. In 1980 she recorded her first solo album Rags, a song-cycle about sweatshops in Victorian England, with Chris Cutler, Fred Frith and Georgie Born (all from Henry Cow) and Phil Minton and Sally Potter. In 1982 Cooper formed her own group, The Lindsay Cooper Film Music Orchestra, in which she wrote and performed film and TV scores, including the soundtrack to Sally Potter's debut feature film, The Gold Diggers (1983), starring Julie Christie."]}, {"page": "Pete Dello", "response": ["He wrote songs with all his bands (and also for The Applejacks). The Dello-penned song \"Do I Figure In Your Life?\" has been covered by Dave Berry, Joe Cocker, Iain Matthews, Dave Stewart, Paul Carrack, Dana,  Kate Taylor, Saturday's Crowd and Pierce Turner. His co-writer was Ray Cane. Dello was also a session musician, and he was hired for Unit 4 + 2, The Scaffold and The Roulettes."]}, {"page": "Bryson Graham", "response": ["He was later a prolific session musician and worked with Gary Wright, co-writing the score for the film Benjamin.The score is credited to Gary Wright and Eberhard Schoener. See Benjamin - Full Credits; www.imdb.com. He took part in the punk and new wave scenes, playing with Ian North in Neo and recording the album Neo. He briefly replaced JJ Johnson in the Electric Chairs when JJ refuse to fly to the United States. He also played on three albums by ex-Traffic drummer Jim Capaldi, and Money and the Magic (1990) to support ex-Girl band member Gerry Laffy's solo career. Graham also worked with Dave Stewart and Barbara Gaskin, plus Richard Dobson on In Texas Last December (1976), and with Rabbit Bundrick on Dark Saloon (1974)."]}, {"page": "List of Hammond organ players", "response": ["|Dave Stewart"]}, {"page": "Echoes and Artifacts", "response": ["* Written By - Rogue Or Rogue & The Crüxshadows (tracks: 1 to 4, 6 to 7, 9 to 11), Marc Bolan (track 5), Annie Lennox, Dave Stewart (track 8)"]}, {"page": "The Loco-Motion", "response": ["==Dave Stewart and Barbara Gaskin version==", "In May 1986, Dave Stewart and Barbara Gaskin released a cover version of the song as a single. The duo had scored a UK No. 1 hit back in 1981 with their cover of \"It's My Party\" but had achieved little success since. For this 1986 single, they embarked on a big promotional push in an attempt to gain a second significant hit. The single, however, stalled at No. 70 in the UK charts in June.", "Category:Dave Stewart (keyboardist) songs"]}, {"page": "Phil Miller", "response": ["|1986||Dave Stewart & Barbara Gaskin|| Up from the Dark"]}, {"page": "A Walk Across the Rooftops", "response": ["The Irish singer Andrea Corr recorded \"Tinseltown in the Rain\" for her 2011 album of cover versions Lifelines and released it as the first single from that album. Duo Dave Stewart and Barbara Gaskin included a cover of \"Heatwave\" on their 1990 album The Big Idea."]}, {"page": "Gavin Harrison", "response": ["Gavin started to work professionally in 1979. He worked as a freelance session drummer on records and tours for the following artists: Incognito, Lisa Stansfield, Lewis Taylor, Artful Dodger, Paul Young, Iggy Pop, Level 42, Porcupine Tree, OSI, King Crimson, Shooter, Dizrhythmia, The Pineapple Thief, The Kings Of Oblivion, Sam Brown, Tom Robinson, Go West, Black, Gail Ann Dorsey, B J Cole, Dave Stewart and Barbara Gaskin, Nathan East, Yasuaki Shimizu, Camouflage, Kevin Ayers, Claudio Baglioni, Franco Battiato, Chizuko Yoshihiro, Renaissance, Mick Karn, Eros Ramazzotti, Nick Johnston, Randy Goodrum, and Fates Warning.", "|Dave Stewart/Barbara Gaskin", "|Dave Stewart & Barbara Gaskin", "|Dave Stewart & Barbara Gaskin", "|Dave Stewart & Barbara Gaskin", "|Dave Stewart & Barbara Gaskin"]}]}}