{"wiki_id": "http://www.wikidata.org/entity/Q3844925", "itemLabel": "Frederick Handley Page", "itemDescription": "British aerospace engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Handley_Page", "wikipedia_page": {"main": "Sir Frederick Handley Page, CBE, FRAeS (15 November 1885 – 21 April 1962) was an English industrialist who was a pioneer in the aircraft industry and became known as the father of the heavy bomber.His company Handley Page Limited was best known for its large aircraft such as the Handley Page 0/400 and Halifax bombers and the H.P.42 airliner. The latter was the flagship of the Imperial Airways fleet between the wars and remarkable at the time for having been involved in no passenger deaths.\nHe is also known for his invention, with Gustav Lachmann, of the leading edge slot to improve the stall characteristics of aircraft wings. Frederick Handley Page was the uncle of World War II flying ace Geoffrey Page.", "link_mentions": [{"page": "Aircraft", "response": ["A balloon was originally any aerostat, while the term airship was used for large, powered aircraft designs — usually fixed-wing.US patent 467069  \"Air-ship\" referring to a compound aerostat/rotorcraft.Ezekiel Airship (1902) wright-brothers.org altereddimensions.net  \"airship,\" – referring to an HTA aeroplane.The Bridgeport Herald, August 18, 1901  – \"air ship\" referring to Whitehead's aeroplane.Cooley Airship of 1910, also called the Cooley monoplane. – a heavier-than-air monoplane.Frater, A.; The Balloon Factory, Picador (2009), p. 163. Wright brothers' \"airship.\"George Griffith, The angel of the Revolution, 1893  — \"air-ship,\" \"vessel\" referring to a VTOL compound rotorcraft (not clear from the reference if it might be an aerostat hybrid.) In 1919 Frederick Handley Page was reported as referring to \"ships of the air,\" with smaller passenger types as \"Air yachts.\"Auckland Star, 24 February 1919  \"Ships of the air,\" \"Air yachts\" – passenger landplanes large and small In the 1930s, large intercontinental flying boats were also sometimes referred to as \"ships of the air\" or \"flying-ships\".The Sydney Morning Herald, Monday 11 April 1938 – \"ship of the airs,\" \"flying-ship,\" referring to a large flying-boat.Smithsonian, America by air  \"Ships of the Air\" referring to Pan Am's Boeing Clipper flying-boat fleet. — though none had yet been built. The advent of powered balloons, called dirigible balloons, and later of rigid hulls allowing a great increase in size, began to change the way these words were used. Huge powered aerostats, characterized by a rigid outer framework and separate aerodynamic skin surrounding the gas bags, were produced, the Zeppelins being the largest and most famous. There were still no fixed-wing aircraft or non-rigid balloons large enough to be called airships, so \"airship\" came to be synonymous with these aircraft. Then several accidents, such as the Hindenburg disaster in 1937, led to the demise of these airships. Nowadays a \"balloon\" is an unpowered aerostat and an \"airship\" is a powered one."]}, {"page": "V bomber", "response": ["The V Bomber force reached its peak in June 1964, when 50 Valiants, 70 Vulcans and 39 Victors were in service. In retrospect, the decision to proceed with three V bombers was questionable. As it turned out, all the roles could have been performed by the Valiant, and its B.2 model was specifically designed for the low-level operations that the V bombers would employ in their later years. Moreover, the rationale for producing both the Vulcan and the Victor disappeared early on. That for producing the Victor B.2 instead of concentrating on the Vulcan B.2 was especially dubious, and Air Chief Marshal Sir Harry Broadhurst attributed it to lobbying by Sir Frederick Handley Page, a desire to retain jobs in the aviation industry, and because the government wanted the Rolls-Royce Conway engine produced for the Vickers VC10 airliner."]}, {"page": "1962", "response": ["* April 21 – Sir Frederick Handley Page, English aircraft manufacturer (b. 1885)"]}, {"page": "Airship", "response": ["During the pioneer years of aeronautics, terms such as \"airship\", \"air-ship\", \"air ship\" and \"ship of the air\" meant any kind of navigable or dirigible flying machine.US patent 467069 \"Air-ship\" referring to a compound aerostat/rotorcraft.Ezekiel Airship (1902) wright-brothers.orgaltereddimensions.net \"airship,\"- referring to an HTA aeroplane.The Bridgeport Herald, August 18, 1901  - \"air ship\" referring to Whitehead's aeroplane.Cooley Airship of 1910, also called the Cooley monoplane.- a heavier-than-air monoplane.Frater, A.; The Balloon Factory, Picador (2009), Page 163. - Wright brothers' \"airship.\"George Griffith, The angel of the Revolution, 1893  - \"air-ship,\" \"vessel\" referring to a VTOL compound rotorcraft (not clear from the reference if it might be an aerostat hybrid.) In 1919 Frederick Handley Page was reported as referring to \"ships of the air,\" with smaller passenger types as \"air yachts.\"Auckland Star, 24 February 1919 \"Ships of the air,\" \"Air yachts\" - passenger landplanes large and small In the 1930s, large intercontinental flying boats were also sometimes referred to as \"ships of the air\" or \"flying-ships\".The Sydney Morning Herald, Monday 11 April 1938 -\"ship of the airs,\" \"flying-ship,\" referring to a large flying-boat.Smithsonian, America by air \"Ships of the Air\" referring to Pan Am's Boeing Clipper flying-boat fleet. Nowadays the term \"airship\" is used only for powered, dirigible balloons, with sub-types being classified as rigid, semi-rigid or non-rigid. Semi-rigid architecture is the more recent, following advances in deformable structures and the exigency of reducing weight and volume of the airships. They have a minimal structure that keeps the shape jointly with overpressure of the gas envelope.Liao, L., & Pasternak, I. (2009). A review of airship structural research and development. Progress in Aerospace Sciences, 45(4), 83–96.Tuckerman, L. B. (1926). Inertia factors of ellipsoids for use in airship design."]}, {"page": "Handley Page", "response": ["Handley Page Limited was a British aerospace manufacturer. Founded by Frederick Handley Page (later Sir Frederick) in 1909, it was the United Kingdom's first publicly traded aircraft manufacturing company. It went into voluntary liquidation and ceased to exist in 1970. The company, based at Radlett Aerodrome in Hertfordshire, was noted for its pioneering role in aviation history and for producing heavy bombers and large airliners.", "Frederick Handley Page first experimented with and built several biplanes and monoplanes at premises in Woolwich, Fambridge and Barking Creek. His company, founded on 17 June 1909, became the first British public company to build aircraft."]}, {"page": "Handley Page Victor", "response": ["The improved Victor B.2 started to be delivered in 1961, with the first B.2 Squadron, 139 Squadron, forming in February 1962, and a second, 100 Squadron, in May 1962.Barnes 1976, pp. 519–520. These were the only two bomber squadrons to form on the B.2, as the last 28 Victors on order were cancelled.Mason 1994, p. 388. The prospect of Skybolt ballistic missiles, with which each V-bomber could strike at two separate targets, meant that fewer bombers would be needed,Barnes 1976, pp. 518–519. while the government was unhappy with Sir Frederick Handley Page's resistance to their pressure to merge his company with competitors. While Skybolt's development would be terminated, Victor B.2s were retrofitted as carrier aircraft for the Blue Steel standoff nuclear missile.  The introduction of standoff weapons and the switch to low-level flight in order to evade radar detection were said to be decisive factors in the successful penetration of enemy territory.Rodwell Flight 13 February 1964, pp. 241–242."]}, {"page": "Handley Page Type O", "response": ["Design work began shortly after the start of the First World War following meetings between Captain Murray Sueter, the director of the Air Department of the Royal Navy, and Frederick Handley Page. Sueter requested \"a bloody paralyser of an aircraft\" for long-range bombing.Bruce Flight 27 February 1953, p.254. The phrase was originated by Commander Charles Rumney Samson, who had recently returned from the front.Flight 9 November 1961, p.722. Coastal patrol adaptations of the abortive Handley Page L/200, M/200 and MS/200 designs were initially discussed but Sueter's technical advisor favoured a large seaplane for coastal patrol and dockyard defence that would also be capable of bombing the German High Seas Fleet at its base in Kiel. The AD Seaplane Type 1000 prototype had already been commissioned from J. Samuel White & Co. of Cowes."]}, {"page": "City, University of London", "response": ["Alumni include Colin Cherry, Stuart Davies and Anthony Hunt. Arthur George Cocksedge, a British gymnast who competed in the 1920 Summer Olympics, was a member of the Northampton Polytechnic Institute's Gymnastics Club and was Champion of the United Kingdom in 1920. In 1937 Maurice Dennis of the (Northampton Polytechnic ABC) was the 1937 ABA Middleweight Champion. Frederick Handley Page was a lecturer in aeronautics at the institute. The Handley Page Type A, the first powered aircraft designed and built by him, ended up as an instructional airframe at the school. The novelist Eric Ambler studied engineering at the institute."]}, {"page": "Etrich Taube", "response": ["Despite its name (Taube means \"dove\"), the Taube's unique wing form was not modeled after a dove, but was copied from the seeds of Alsomitra macrocarpa, which may glide long distances from their parent tree. Similar wing shapes were also used by Karl Jatho and Frederick Handley Page. Etrich had tried to build a flying wing aircraft based on the Zanonia wing shape, but the more conventional Taube type, with tail surfaces, was much more successful."]}, {"page": "Handley Page Hermes", "response": ["During April 1944, at the urging of George Volkert, Handley Page's chief designer, to settle production priorities, the company's founder and managing director Frederick Handley Page decided to merge the work of several projects and prioritise the transport aircraft; this also aligned with the release of Specification C.3/44, which sought a multipurpose transport.Barnes 1976, pp. 435-436. Handley Page's proposal was accepted with no meaningful alterations sought. Shortly thereafter, it was recognised that development of the civil transport posed less of a challenge that the military transport project, thus it was decided that the airliner programme would be flown first.Barnes 1976, p. 436. The military transport aircraft, which would share a relatively high level of similarities with the civil project, would enter service as the Handley Page Hastings, while the civil transport became known as the Hermes.Jackson 1973, p. 247."]}, {"page": "Sir Frederick Handley Page", "response": ["#REDIRECT Frederick Handley Page"]}, {"page": "Royal Aeronautical Society", "response": ["* 1960 - Sir Frederick Handley Page"]}, {"page": "Timeline of aviation – 19th century", "response": ["** 15 November – Frederick Handley Page, English aircraft manufacturer (died 1962)"]}, {"page": "ADC Aircraft", "response": ["In 1920 the British government, through the Disposal and Liquidation Commission of the Ministry of Munitions, sold the entire stock of surplus aircraft, aero-engines and related equipment held in the United Kingdom to the Imperial and Foreign Corporation Limited. The sale included more than 10,000 aircraft and 35,000 aero-engines, for the sum of £1,000,000 plus a 50% share of any profits.Barnes 1976, pp. 26–27.  The Imperial and Foreign Corporation formed the Aircraft Disposal Company to sell the equipment and to take over the management of the storage organisation and the large aircraft depots throughout the country. The Handley Page Company were appointed sole managing and selling agents for ADC although problems with the financial arrangement soon put Handley Page at risk and the agreement was made in March 1921 between Handley Page Limited, Frederick Handley Page and ADC to stop ADC liquidating the Handley Page Company."]}, {"page": "Pate's Grammar School", "response": ["* Frederick Handley Page, founder of the aircraft company Handley Page"]}, {"page": "Leading-edge slot", "response": ["Slots were first developed by Handley Page in 1919 and the first aircraft to fly with them was the experimental H.P.17, a modified Airco DH.9A. Their invention is credited jointly to Sir Frederick Handley Page and Gustav Lachmann. The first aircraft fitted with controllable slots was the Handley Page H.P.20. Licensing the design became one of Handley Page's major sources of income in the 1920s.Centennial of Flight  Retrieved 2008-02-19", "*\"Developments in Aircraft Design by the use of Slotted Wings\" an article by Frederick Handley Page published in a 1921 issue of Flight"]}, {"page": "Society of British Aerospace Companies", "response": ["On 29 March 1915 a number of British aircraft manufacturers and industrialists met to arrange a standards body and production pooling system known as the Society of British Aircraft Constructors. Notable among the aircraft participants were Herbert Austin, Frederick Handley Page, H.V. Roe of Avro, and E.B. Parker of Short Brothers. The group agreed to share their designs among a variety of 3rd party factories in order to be able to quickly produce new designs on demand. These factories joined ones being run by the government directly. In total over 40 companies joined the group when it officially formed on 23 March 1916."]}, {"page": "Lord Lieutenant of Middlesex", "response": ["*Frederick Handley Page 8 August 1956 – 6 January 1961"]}, {"page": "Handley Page Dart Herald", "response": ["One hope of improving sales was to develop the Herald as a military transport. The Royal Air Force had a requirement for 45 tactical transports to replace piston-engined Vickers Valettas, and Handley Page began work in 1960 on the HP.124 to meet this need. This would have a new rear fuselage with a rear loading ramp under the raised tail. The HP.124 was considered favourite to beat Avro's 748 derivative, the Avro 780, with the high wing of the Handley Page expected to give easier loading than the more expensive Avro. While short-field testing of the prototype Herald 200 at RAF Martlesham Heath in 1961 showed off the Herald's good handling and ability to operate from unprepared airstrips, other obstacles were more taxing.  The Minister of Aviation, Peter Thorneycroft, refused to sign a contract for the HP.124 unless Handley Page would agree to a merger with British Aircraft Corporation or Hawker Siddeley as part of the government's policy of consolidation of the British aircraft industry.  As Hawker Siddeley offered less than half the valuation that Frederick Handley Page placed on the company, the merger did not occur, and the RAF's order went to the Avro 780, which became the Andover.Barnes 1976, p. 543.Payne 1994, p. 341. The Herald Series 400 was a simpler tactical transport with a strengthened cabin floor and side loading doors that could be opened in flight for dropping of supplies or paratroops. Eight were built for the Royal Malaysian Air Force.Payne 1997, pp. 338–339."]}, {"page": "Albert Medal (Royal Society of Arts)", "response": ["* 1960: Sir Frederick Handley Page CBE"]}, {"page": "Noel Pemberton Billing", "response": ["Billing then returned to Britain in 1903 and used his savings to open a garage in Kingston upon Thames. This was successful, but he became more interested in aviation, which was then in its infancy. An attempt to open an aerodrome in Essex failed, so he started a short-lived career in property, while studying to become a lawyer. He passed his exams, but instead moved into selling steam yachts.  Convinced of the potential of powered aviation, he founded a flying field with extensive facilities on reclaimed marshland at Fambridge in Essex in 1909,The Flying Ground at FambridgeFlight 20 February 1909 but this ambitious venture did not prosper, British aviation activity becoming centred at Brooklands.  In 1913 he bet Frederick Handley Page that he could earn his pilot's licence within 24 hours of first sitting in an aircraft. He won his bet, gaining licence number 683 and £500, equivalent to more than £28,000 in 2010,According to the UK National Archive's currency converter, £500 in 1910 would have the equivalent purchasing power of over £28,000 in 2010. which he used to found an aircraft business, Pemberton-Billing Ltd, with Hubert Scott-Paine as works manager, in 1913. Billing registered the telegraphic address Supermarine, Southampton for the company, which soon acquired premises at Oakbank Wharf in Woolston, Southampton and started construction of his flying boat designs. Financial difficulties soon set in, but the onset of World War I revived the fortunes of the business."]}, {"page": "1962 in the United Kingdom", "response": ["*21 April – Sir Frederick Handley Page, English aircraft manufacturer (born 1885)"]}, {"page": "List of people from Cheltenham", "response": ["*Sir Frederick Handley Page (1885–1962), founder of the aircraft maker Handley Page, was born in Cheltenham and attended Cheltenham Grammar School."]}, {"page": "Handley Page Transport", "response": ["Handley Page Transport Ltd was an airline company founded in 1919, soon after the end of the First World War, by Frederick Handley Page."]}, {"page": "Gustav Lachmann", "response": ["Gustav Victor Lachmann (3 February 1896 – 30 May 1966) was a German aeronautical engineer who spent most of his professional life working for the British aircraft company Handley Page. He was, with Frederick Handley Page, the co-inventor of the leading edge slot.", "By chance, he read an account of Frederick Handley Page's  public demonstration of leading-edge slots given at Cricklewood on 21 October 1921. This encouraged him to renew his patent application. He borrowed DM 1000 from his mother to pay for wind-tunnel tests, to be undertaken by Ludwig Prandtl at Göttingen University and the patent was retrospectively granted as DE 347884.Pride and Priority, Musker 2009 This gave his patent priority over those of Handley Page, but a meeting between the two men settled the matter to mutual advantage, the patent rights being shared, and Lachmann being hired as a consultant by Handley Page Ltd."]}, {"page": "Geoffrey Page", "response": ["Page was born on 16 May 1920 in Boxmoor, England. His parents divorced while he was very young. He had developed an interest in aviation by age 5, which intensified as he grew into a young man. Page was educated at Dean Close School, Cheltenham. For his college studies, his desire was to go to the RAF college at Cranwell and make a career of the RAF. His father strongly opposed a career in the air force, and pressed him to pursue a career in engineering instead. His father's brother, the engineer and aircraft manufacturer, Sir Frederick Handley Page, aided in discouraging him, telling him that pilots were plentiful but engineers were not. Thinking of it later in life, Page suspected they discouraged him because they had suffered the loss of their brother, who had been a fighter pilot in the Great War."]}, {"page": "Aerospace industry in the United Kingdom", "response": ["Most of the aviation pioneers, such as Geoffrey de Havilland, Thomas Sopwith, Richard Fairey, Robert Blackburn, Frederick Handley Page, A.V. Roe and the Short Brothers had a training in engineering and their companies were usually privately financed. There were several large engineering companies who also got involved, such as Vickers in 1911, Armstrong Whitworth in 1912 British and Colonial Aeroplane Company in 1910 and Aircraft Manufacturing Company in 1912.", "The first task for the government at the end of the war was to dispose of their stocks of aircraft and to deal with those on order. The Ministry of Munitions set up a Disposal Board and sold the entire surplus stock to a private company, Aircraft Disposals Company, with Frederick Handley Page as one of the key personnel.Peter Fearon 1969: The Formative Years of the British Aircraft Industry, 1913–1924 The Business History Review Vol. 43 No. 4 (Winter 1969) p. 491"]}, {"page": "Horatio Barber", "response": ["In early 1910 he began to fly his designs and in late September 1910 he became the first occupant of Hendon Aerodrome, newly established by the London Aerodrome Co, where he leased three hangars.Opening of the Bleriot School Flight 8 October 1910 His ASL Valkyrie design started test flying from there in October 1910, Barber using the aircraft to gain his Aero Club Certificate (No. 30) in November of that year.\"The Royal Aero Club of the United Kingdom OFFICIAL NOTICES TO MEMBERS\" Flight 26 November 1910 p. 997 The company gave four Valkyries to the government and one aircraft and military pilot were lost in an accident in September 1911. Barber carried on with some experimental work, producing a tractor biplane called the ASL Viking early in 1912, but in April 1912 he dissolved the Syndicate, having failed to achieve any commercial success. The company's aircraft and equipment were sold, mostly to Frederick Handley Page. Barber continued to work as an aeronautical consultant, with an office at 59 Pall Mall in London."]}, {"page": "Handley Page Type A", "response": ["The Handley Page Type A, sometimes called \"Bluebird\" and later designated HP.1, was the first powered aircraft designed and built by Frederick Handley Page.Orbis 1985, p. 2059"]}, {"page": "Handley Page H.P.20", "response": ["Frederick Handley Page obtained his master patent for controllable slots on the edge of an aircraft wing on 24 October 1919. He knew the lift coefficient of all wings increased linearly until the stall was approached, then fell away; he argued that if the stall could be delayed, higher lift coefficients could be reached. In Germany Gustav Lachmann had the same idea, though through a wish to avoid the dangers of stalling. Rather than going to litigation an agreement was reached in which Lachmann, working with Prandtl at the advanced Goettingen air tunnel acted as consultant to Handley Page. Lachmann heard about the Handley Page work when they modified a standard DH.9A with fixed slots and demonstrated it dramatically at the Handley Page airfield at Cricklewood on 21 October 1920. That machine was retrospectively designated the H.P.17. The first aircraft with pilot controllable slots, designed by Handley Page and wind tunnel tested by Lachmann was called the X.4B in the company's contemporary notation but became, retrospectively, the H.P.20. The Air Ministry met the cost."]}, {"page": "Page (surname)", "response": ["* Frederick Handley Page (1885–1962), British aircraft manufacturer"]}, {"page": "British shadow factories", "response": ["Sir Frederick Handley Page's \"thank you\" to these \"daughter\" firms was a luncheon at The Dorchester at which the head of each firm received a silver model of a Halifax bomber and representative workmen received scrolls of commendation."]}, {"page": "Harold Barnwell", "response": ["In 1911 both brothers moved to England, and in 1912 Harold, after gaining his pilot's licence (No.278) at the Bristol school at Brooklands in SeptemberAviators CertificatesFlight 7 September 1912 joined the staff of the new Vickers School of Flying, also at Brooklands. Here he was the instructor who helped Noel Pemberton-Billing win his £50 bet with Frederick Handley Page by learning to fly and gaining a pilot's licence in a single day. In late 1914, Harold Barnwell, now chief test pilot with Vickers Limited, designed a single seat \"scout\" or fast reconnaissance aircraft, and had it built without the knowledge or approval of his employers, \"borrowing\" a Gnome Monosoupape rotary engine from Vickers' stores to power the aircraft. Barnwell attempted the first flight of his design, named the \"Barnwell Bullet\" in early 1915, but the aircraft crashed and was wrecked, possibly due to a miscalculated centre of gravity.War Planes of the First World War: Volume Three, Fighters, Bruce, J.M.Vickers Aircraft since 1908, Andrews, C.F. and Morgan, E.B."]}, {"page": "April 1962", "response": ["*Died: Frederick Handley Page, 76, founder of Britain's first aircraft manufacturing company, Handley Page, Ltd."]}]}}