{"wiki_id": "http://www.wikidata.org/entity/Q3852273", "itemLabel": "Mat Sadler", "itemDescription": "English association football player (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mat_Sadler", "wikipedia_page": {"main": "Mathew John Sadler (born 26 February 1985) is an English professional footballer who plays for EFL League Two club Walsall. He is a left-footed defender capable of playing either at full-back or as a centre-back.Sadler played in the Premier League and the Football League for Birmingham City. He spent most of his career in the Football League, for Northampton Town, Watford, Stockport County, Shrewsbury Town, Walsall, Crawley Town, Rotherham United and Oldham Athletic.", "link_mentions": [{"page": "Walsall F.C.", "response": ["|Coach ||  Mat Sadler"]}, {"page": "Professional Footballers' Association", "response": ["*Mat Sadler (Shrewsbury Town, League One"]}, {"page": "Mathew Birley", "response": ["On 26 October 2005, he made his professional debut in the third round of the League Cup, replacing Mikael Forssell for the final 14 minutes of a 2–1 home win over Norwich City. Birley made his only Premier League appearance on 31 December, when he came on as a 65th-minute substitute for Emile Heskey in the match against Chelsea at Stamford Bridge that resulted in a 2–0 win for the London side. His only other first-team appearance for Birmingham was on 7 February 2006 in an FA Cup fourth-round replay against Reading, starting and making way for Mat Sadler after 59 minutes of a 2–1 win."]}, {"page": "Jordan Parkes", "response": ["In the 2007–08 season Parkes was loaned to League Two sides Brentford and Barnet . He made his league debut for Watford on 30 August 2008 against Ipswich Town, replacing the injured Mat Sadler. In November of that year he captained Watford U20s away to Inter Milan, against a side that included Hernan Crespo, Adriano, Walter Samuel and Olivier Dacourt."]}, {"page": "Cockshut Hill School", "response": ["*Mat Sadler - Shrewsbury Town left-back and former England U-16 and U-17 captain."]}, {"page": "Dean Smith (footballer, born 1971)", "response": ["He let fourteen players go in summer 2011, including: Darren Byfield, Jonny Brain, Clayton McDonald, Paul Marshall, Matt Richards, Steve Jones, Aaron Lescott, David Bevan, Julian Gray, and Tom Williams. He then signed goalkeeper Dávid Gróf; defenders Mat Sadler and Lee Beevers; midfielders Kevan Hurst, Claude Gnakpa, Adam Chambers, and Anton Peterlin; and striker Ryan Jarvis. Also during the campaign he boosted his squad with loan signings Dave Martin, Mark Wilson, Andy Halliday, and Florent Cuvelier. His side lost just one of their first five league games, but then picked up just three points from their next seven games. They beat Preston North End on 15 October, but then picked up just four points from their next eight games. From 26 November, they were beaten just once in nine matches, but became the division's draw specialists as seven of these nine games finished level. They finished the campaign in 19th place, seven points clear of the relegation zone."]}, {"page": "Sadler (name)", "response": ["* Mat Sadler (born 1985), English footballer"]}, {"page": "Birmingham City F.C. Reserves and Academy", "response": ["Since the youth system was re-established, a number of players have graduated to careers in League football at Birmingham or elsewhere, some examples being Darren Carter, Craig Fagan, Andrew Johnson, Marcos Painter and Mat Sadler."]}, {"page": "2007–08 Birmingham City F.C. season", "response": ["January also saw the opening of the transfer window. McLeish was able to strengthen his side with the signings of left back David Murphy for £1.5m from Hibernian, striker James McFadden for £5m from Everton and the loan signing of striker Mauro Zárate from Qatari side Al-Sadd. McLeish also allowed some fringe players to leave the club: Neil Kilkenny joining Leeds United for £150,000, Rowan Vine joined Queens Park Rangers for £1n, Neil Danns joined Crystal Palace for £600,000, and Mat Sadler joined Watford for £750,000. Defender Olivier Tébily was also allowed to leave the club after not featuring in the side since the start of the previous season.", "| 24 January 2008 || Mat Sadler || £750,000 || Watford", "!scope=\"row\"|Mat Sadler"]}, {"page": "2006–07 Birmingham City F.C. season", "response": ["!scope=\"row\"| Mat Sadler"]}, {"page": "2002–03 Birmingham City F.C. season", "response": ["!scope=\"row\"| Mat Sadler"]}, {"page": "2003–04 Birmingham City F.C. season", "response": ["| 21 November 2003 || Mat Sadler || Northampton Town || Two months", "!scope=\"row\"| Mat Sadler"]}, {"page": "Lewis Young", "response": ["For the 2008–09 season, Young was given the number 32 shirt for Watford and for the 2009–10 season, number 21. He made his debut as a substitute in Watford's 1–0 victory over Bristol Rovers in the League Cup on 12 August 2008. On Boxing Day of 2008, Young made his league debut for Watford in a 4–2 home defeat against Bristol City, replacing Mat Sadler at half-time. In 2010, towards the end of Young's Watford career, he joined Hereford United on a one-month loan deal. On 20 March 2010, Young made his Hereford United debut in a 2–0 victory over Bradford City, playing the full 90 minutes."]}, {"page": "Abu Ogogo", "response": ["Ahead of the 2017–18 season, Ogogo was appointed team captain, alongside club captain Mat Sadler."]}, {"page": "2009–10 Stockport County F.C. season", "response": ["|11||||DF||Mat Sadler||1||0||0||0|| 1", "|20||||DF||Mat Sadler||2||0", "| Mat Sadler || Watford || 29 January 2010"]}, {"page": "2009–10 Watford F.C. season", "response": ["For similar reasons to their young acquisitions, Watford loaned players such as O'Toole, Billy Gibson and Marvin Sordell to lower-league sides, in the hope that they would gain first-team experience. They also used the system to send Mat Sadler to Stockport County, and Nathan Ellington to Greek side Skoda Xanthi. In both cases, the loans were made with the option of a possible permanent move.", "|29 January 2010||Mat Sadler||Stockport County||End of Season"]}, {"page": "2007–08 Watford F.C. season", "response": ["Following relegation from the Premier League in 2006–07, Watford started the 2007–08 season strongly, winning eleven of their opening sixteen games and opening up an 8-point gap at the top of the Championship table. However, after the departure of Adam Johnson to Middlesbrough on 11 November 2007 Watford's form declined; they won six of their next sixteen Championship games, and only one of their final sixteen. In January 2008 Watford sold captain Gavin Mahon and top scorer Marlon King, but purchased Mat Sadler, Leigh Bromby and John Eustace. Watford finished the 2007–08 season in 6th position, and were eliminated in the play-off semi finals to Hull City.", "| 24 January 2008|| Mat Sadler||Birmingham City||"]}, {"page": "2010–11 Watford F.C. season", "response": ["|7 July 2010||Mat Sadler||Shrewsbury Town||End of season"]}, {"page": "2010–11 Shrewsbury Town F.C. season", "response": ["|align=\"left\"|3||align=\"left\"|DEF||align=\"left\"| Mat Sadler"]}, {"page": "2005–06 Birmingham City F.C. season", "response": ["!scope=\"row\"| Mat Sadler"]}, {"page": "Aristote Nsiala", "response": ["Six months into his contract at Hartlepool, Nsiala joined League One side Shrewsbury Town for an undisclosed fee on 1 January 2017, signing a deal until summer 2019. The move reunited him with Paul Hurst who had previously managed him at Grimsby. He was sent off 53 minutes into his Shrewsbury debut, having been deemed to have fouled Luke Norris in a 1–1 draw away at Swindon Town, although the red card was later rescinded on appeal. Nsiala scored his first goal for the club – a 90th minute match-winning header against AFC Wimbledon – on 18 February to earn his side a fourth successive home victory. In his first half-season he established a strong defensive partnership with the experienced left-sided centre-back Mat Sadler to help steer Shrewsbury away from relegation danger."]}, {"page": "2004–05 Birmingham City F.C. season", "response": ["!scope=\"row\"| Mat Sadler"]}, {"page": "2011–12 Watford F.C. season", "response": ["|27 June 2011 || Mat Sadler || Walsall || Free (end of contract, released)\"Walsall sign ex-Birmingham City defender Mat Sadler\". BBC Sport. 27 June 2011. Retrieved 2 May 2012."]}, {"page": "2011–12 Walsall F.C. season", "response": ["| Mat Sadler"]}]}}