{"wiki_id": "http://www.wikidata.org/entity/Q3850458", "itemLabel": "Mary Dickens", "itemDescription": "child of Victorian-era novelist Charles Dickens", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Dickens", "wikipedia_page": {"main": "Mary \"Mamie\" Dickens (6 March 1838 – 23 July 1896) was the eldest daughter of the English novelist Charles Dickens and his wife Catherine. She wrote a book of reminiscences about her father, and in conjunction with her aunt, Georgina Hogarth, she edited the first collection of his letters.\n\n", "link_mentions": [{"page": "1896 in literature", "response": ["*July 23 – Mary Dickens, English memoirist, editor and novelist (born 1838)"]}, {"page": "1838 in literature", "response": ["*March 6 – Mary Dickens, English memoirist, editor and novelist (died 1896)"]}, {"page": "All the Year Round", "response": ["In 1889, the magazine started a \"Third series\". It is unclear how much Dickens Jr. was involved with the new series, but a number of stories were contributed by Mary Dickens."]}, {"page": "Charles Dickens Museum", "response": ["Charles Dickens and his wife Catherine Dickens (née Hogarth) lived here with the eldest three of their ten children, with the older two of Dickens's daughters, Mary Dickens and Kate Macready Dickens being born in the house.Lucinda Hawksley website"]}, {"page": "Mamie", "response": ["* Mary Dickens (1838–1896), daughter of Charles Dickens"]}, {"page": "The Frozen Deep", "response": ["Additional performances at the same venue were given on 11, 18 and 25 July. When Dickens realised that, despite expensive ticket prices, insufficient funds had been raised to sustain Mrs. Jerrold, he arranged for a series of much larger public performances at the Manchester Free Trade Hall. It was for these that Dickens, convinced that his amateur actresses, including his daughters Kate and Mary Dickens, would not be able to project in such a large venue, replaced them with professionals, among them Ellen Ternan. These performances, given on 21, 22 and 24 August were attended by thousands, and earned Dickens and the cast unusually effusive reviews. To Miss Coutts, Dickens wrote of his pleasure at being able to effect \"the crying of two thousand people\", including the stage-hands, carpenters, and even the cast, with his final death scene in the role of Wardour."]}]}}