{"wiki_id": "http://www.wikidata.org/entity/Q3880455", "itemLabel": "Vicky Botwright", "itemDescription": "British squash player", "wikipedia_url": "https://en.wikipedia.org/wiki/Vicky_Botwright", "wikipedia_page": {"main": "Vicky Botwright (born 18 June 1977 in Manchester, United Kingdom) is a squash coach and former professional squash player from England. She reached a career-high world ranking of World No. 5 in 2005. In 2008, she finished runner-up at the World Open, losing in the final to Nicol David 11–5, 1–11, 6–11, 9–11. Botwright was a member of the England team which won the World Team Championships in 2006.Botwright caused a controversy which gained considerable media attention in 2004, when she announced plans to appear on court at tournaments wearing in a bikini-style outfit consisting of a sports bra and thong briefs, and posed for photographs wearing the outfit. However the Women's International Squash Players Association (WISPA), refused to grant permission for her to play in the outfit. Her popularity and fame increased after the incident, though afterwards she stated that the whole idea of \"skimpy\" clothing on-court was a publicity stunt dreamed up by the members of WISPA. She went on to say that she was selected as the player to wear the clothing. She also said that this was not her idea at all, and that she did not think the incident would become so infamous.\nBotwright now works as a squash coach having retired from the international tour in October 2008. She continues to make appearances as a player in Premier League Squash in England.\nVicky is the elder sister of Becky Botwright, who is also a squash player.", "link_mentions": [{"page": "World Squash Championships", "response": ["|  Vicky Botwright"]}, {"page": "Nicol David", "response": ["|  Vicky Botwright", "| bgcolor=\"98FB98\" | Winner || 2008 ||  Vicky Botwright || 5–11, 11–1, 11–6, 11–9"]}, {"page": "Vanessa Atkinson", "response": ["|   bgcolor=\"98FB98\"|Winner || 2005 ||  Vicky Botwright   || 9-7, 9-4, 9-2"]}, {"page": "Rachael Grinham", "response": ["The first half of 2002 did not go well for Rachael until she beat England's Tania Bailey for the Singapore Open. One month later she took the Credit Suisse Privilege Ladies Open, one of the finest squash tournaments in the world beating Natalie Grainger. Rachael and Natalie had won a women's doubles bronze medal at the 2002 Commonwealth Games. She climbed to No. 6 in the world by the end of the year. At the beginning of 2003, she claimed the Vassar College Class of 1932 beating Vicky Botwright. She reached two finals in Helioplis Open and Hurghada International in Egypt but lost both to former world No. 1 and retired player, Carol Owens. Arguably, the 2003 British Open was the turning point for the 29-year-old, who pulled off a semi-final upset over the top seed, Carol Owens, then the World No. 1, before beating Cassie Jackman in the final to claim the title for the first time. She ended the year ranked No. 3 in the world.", "|  Vicky Botwright"]}, {"page": "James Willstrop", "response": ["In the 2006 Commonwealth Games in Melbourne, Willstrop partnered Vicky Botwright to a Silver Medal in the Mixed Doubles. Willstrop also won the 2007 British National Squash Championships title, beating John White in the final. In December 2007, Willstrop helped England retain the World Team Championship title in Chennai, India, and won the English Open, beating fellow Yorkshireman Nick Matthew in the final."]}, {"page": "England at the 2006 Commonwealth Games", "response": [":Vicky Botwright & James Willstrop, Mixed Doubles", ":Tania Bailey & Vicky Botwright, Women's Doubles", "* Vicky Botwright"]}, {"page": "United States Open (squash)", "response": ["| 2005 || Natalie Grinham || Vicky Botwright"]}, {"page": "2006 Women's World Team Squash Championships", "response": ["* Vicky Botwright"]}, {"page": "Omneya Abdel Kawy", "response": ["The highlight of 2005 was reaching match ball against world number one Rachael Grinham in the final of the Hurghada International in her home country though she eventually lost the match. She also reached another two finals, in Greenwich and Dayton, both in the United States, and finished as a runner up. Omneya then won the Marsh McLennan title by beating Vicky Botwright. Since then she has continued to be a threat to all the top players, her astute tactical brain and range of shots causing problems to everybody she meets."]}, {"page": "Vicky", "response": ["* Vicky Botwright (born 1977), English squash coach and former player"]}, {"page": "Social impact of thong underwear", "response": ["In 2001, Vicky Botwright, then 16th seeded in women's squash circuit and dubbed the \"Lancashire Hot Bot\", was prohibited by the Women's International Squash Players Association (WISPA) from wearing a thong and a sports bra in the British Open Championships. Initially, WISPA was \"suggesting a thong was inappropriate\", but in the end decided no formal ruling was needed against thongs. Botwright stated that \"we should be able to wear skimpy clothing if we want to, as some of the more conventional outfits we wear can be quite restrictive...\""]}, {"page": "Official Women's Squash World Ranking", "response": ["|6|| Madeline Perry||844.063|| Vicky Botwright||1008.810|| Jenny Duncalf||960.444", "|8|| Vicky Botwright||789.684|| Vanessa Atkinson||831.250|| Laura Lengthorn-Massaro||847.900", "|5|| Natalie Grainger||699.000|| Natalie Grinham||1019.941|| Vicky Botwright||1042.833", "|9|| Vicky Botwright||421.737|| Omneya Abdel Kawy||607.635|| Tania Bailey||646.765"]}, {"page": "Rebecca Botwright", "response": ["Becky is the younger sister of Vicky Botwright, who was also a professional squash player."]}, {"page": "Qatar Classic", "response": ["| 2005 || Vanessa Atkinson ||  Vicky Botwright || 9-7, 9-4, 9-2"]}, {"page": "Texas Open (squash)", "response": ["| 2006 || Vicky Botwright || Engy Kheirallah || 9-5, 9-3, 9-2"]}, {"page": "1998 Women's World Open Squash Championship", "response": ["| Maha Zein || Vicky Botwright  ||9/5 3/9 10/8 9/0"]}, {"page": "1999 Women's British Open Squash Championship", "response": ["| Fiona Geaves || Vicky Botwright ||\t9-1 9-7 9-3"]}, {"page": "2000 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Lisa McKenna ||\t9–0 9–4 9–2", "| Vanessa Atkinson || Vicky Botwright ||\t9–3 8–10 5–9 9–7 9–2"]}, {"page": "2001 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Madeline Perry ||\t9–2 8–10 9–4 10–9"]}, {"page": "2002 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Laura Lengthorn ||\t9–0 9–5 9–2"]}, {"page": "2003 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Vanessa Atkinson ||\t9-5 7-9 9-3 9-4"]}, {"page": "2004 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Lauren Briggs ||\t9-3 9-4 9-1"]}, {"page": "2005 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Madeline Perry ||\t7–9 9–3 9–4 7–9 9–6"]}, {"page": "2006 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Lauren Briggs ||\t9–6 9–2 9–3"]}, {"page": "2007 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Jenny Duncalf ||\t9-4 9-5 9-5"]}, {"page": "2008 Women's British Open Squash Championship", "response": ["| Vicky Botwright || Laura Massaro(née Lengthorn)||\t6–9 9–2 9–4 6–9 6–9"]}]}}