{"wiki_id": "http://www.wikidata.org/entity/Q3897765", "itemLabel": "Patrick Rylands", "itemDescription": "English toy designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Rylands", "wikipedia_page": {"main": "Patrick Rylands (born in Hull, 1943) is an English designer.\nAfter graduating in ceramics from the Royal College of Art in London in 1966 began to work as a freelancer with a number of iconic toy companies (Creative Playthings, Naef, Ambi Toys).\nIn 1970 he became the youngest designer to be awarded the prestigious Prince Philip Designers Prize for a group of ABS plastic toys designed for the British company Trendon Toys (former producer of Sasha dolls).\nFrom 1976 up until 2002 he worked as in-house designer for the historic Dutch toy company, Ambi Toys. In 1999 he was awarded the title of Royal Designer for Industry.\nHis toy designs are part of the permanent collection at the Victoria and Albert Museum of Childhood in London and have been exhibited in the Olympic Games of London 2012.", "link_mentions": [{"page": "Prince Philip Designers Prize", "response": ["|data-sort-value=\"Rylands, Patrick\"|Patrick Rylands"]}, {"page": "Rylands", "response": ["*Patrick Rylands (born 1943), English designer"]}, {"page": "Stephen A. Miller", "response": ["At this time Stephen began what would become his lifelong focus on play and toys, and the effects of toys on the development of children and what kind of adults they become. He had recently established his unique toy store, 1 • 2 • Kangaroo, located at the triangle corner of Greenwich Avenue and Seventh Avenue. This store sold unusual toys, both antique and modern. Stephen had negotiated for the exclusive American rights to import certain European toys by such distinguished designers as Lis and Kurt Naef of Naefspiele, Peer Clahsen, Fredun Shapur, Patrick Rylands, and many others. Stephen lived in an apartment at the rear of the store. During this time he was photographed in the nude by Diane Arbus. The store was patronized by artists Joseph Cornell, whose boxes contain some items he bought there, and the painter Marcel Duchamp who visited the store frequently. Stephen Miller and all three of his Greenwich Village ventures, The Hip Bagel, 1•2•Kangaroo, and Avec were mentioned in the November 26, 1964 edition of the Village Voice."]}]}}