{"wiki_id": "http://www.wikidata.org/entity/Q390611", "itemLabel": "Paul Flynn", "itemDescription": "Welsh politician and MP (1935-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Flynn_(politician)", "wikipedia_page": {"main": "Paul Philip Flynn (9 February 1935 – 17 February 2019) was a British Labour politician who served as Member of Parliament (MP) for Newport West from the 1987 general election until his death in 2019. He briefly served as Shadow Secretary of State for Wales and Shadow Leader of the House of Commons in 2016, becoming the oldest MP to hold a Shadow Cabinet position (aged 81).", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Paul Flynn", "| Paul Flynn"]}, {"page": "1987 United Kingdom general election", "response": ["|Paul Flynn"]}, {"page": "Republicanism in the United Kingdom", "response": ["In January 1997, ITV broadcast a live television debate Monarchy: The Nation Decides, in which 2.5 million viewers voted on the question \"Do you want a monarch?\" by telephone. Speaking for the republican view were Professor Stephen Haseler, (chairman of Republic), agony aunt Claire Rayner, Paul Flynn, Labour MP for Newport West and Andrew Neil, then the former editor of The Sunday Times. Those in favour of the monarchy included author Frederick Forsyth, Bernie Grant, Labour MP for Tottenham, and Jeffrey Archer, former deputy chairman of the Conservative Party. Conservative MP Steven Norris was scheduled to appear in a discussion towards the end of the programme, but officials from Carlton Television said he had left without explanation. The debate was conducted in front of an audience of 3,000 at the National Exhibition Centre in Birmingham, with the telephone poll result being that 66% of voters wanted a monarch, and 34% did not.", "At the swearing of oaths in the Commons following the 2017 general election, Republic reported that several MPs had prefixed their parliamentary oath of allegiance with broadly republican sentiments, such as a statement referring to their constituents, rather than the Queen. If an MP does not take the oath or the affirmation to the Queen, they will not be able to take part in parliamentary proceedings or paid any salary and allowances until they have done so. Such MPs included Richard Burgon, Laura Pidcock, Dennis Skinner, Chris Williamson, Paul Flynn, Jeff Smith, and Emma Dent Coad. Roger Godsiff and Alex Sobel also expressed sympathy for an oath to their constituents."]}, {"page": "Yvette Cooper", "response": ["After a vote of MPs on 19 October 2016, Cooper was elected chair of the Home Affairs Select Committee, gaining more votes than fellow candidates, Caroline Flint, Chuka Umunna and Paul Flynn. As chair, Cooper launched a national inquiry into public views on immigration and, after an emergency inquiry into the Dubs scheme for child refugees, criticised the government's decision to end the programme in February 2017."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Paul Flynn"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Paul Flynn"]}, {"page": "List of MPs for constituencies in Wales (2001–2005)", "response": ["*Paul Flynn"]}, {"page": "Kim Howells", "response": ["In February 2006 he was the subject of a complaint from Paul Flynn MP after he mocked Mr Flynn's attitude towards the UK's Afghan drug policy:", "*Report on his comments about the Monarchy and the Somerset Folk Singers. Also details an exchange with Paul Flynn on drugs policy in which Howells became abusive."]}, {"page": "Don Touhig", "response": ["In Paul Flynn's 1999 book Dragons and Poodles, he was described as being the \"seamstress-in-chief of stitch ups\", that he could be \"ambitious\" and \"can be pompous\"."]}, {"page": "Christopher Chope", "response": ["In July 2017, Chope and Peter Bone, the Conservative MP for Wellingborough, tabled 73 bills between them, of which 47 were placed by Chope. In order to be at the front of the queue to table the bills, the pair had camped in the Palace of Westminster for three days. Chope's bills included legislation to privatise the BBC and Channel 4, limit the interest rate chargeable on student loan debt (and forgive it in certain circumstances), reduce stamp duty, and decriminalise TV licence-dodging. Because of the number of slots for bills they took, Chope and Bone were criticised, including by Paul Flynn, for their actions."]}, {"page": "Paul Philip Flynn", "response": ["#REDIRECT Paul Flynn (politician)"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Paul Flynn"]}, {"page": "Cannabis classification in the United Kingdom", "response": ["On Tuesday 10 October 2017 under the Ten Minute Rule the Legalisation of Cannabis (Medicinal Purposes) Bill was proposed by Paul Flynn, Frank Field, Caroline Lucas, Mary Glindon, Jeff Smith, Kelvin Hopkins, Crispin Blunt, Michael Fabricant, Martyn Day, Ronnie Cowan, Layla Moran, and Alistair Carmichael.Legalisation of Cannabis (Medicinal Purposes) Bill 2017-19"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Newport West || Paul Flynn || Labour || Paul Flynn || Labour"]}, {"page": "Newport West (UK Parliament constituency)", "response": ["Newport West () is one of two parliamentary constituencies for the city of Newport, South Wales, in the House of Commons of the Parliament of the United Kingdom. It elects one Member of Parliament (MP) using the first-past-the-post voting system. Paul Flynn, of the Labour Party, was the MP from the 1987 general election until his death on 17 February 2019. Consequently a by-election was held in the constituency on Thursday 4 April 2019. It is currently represented by Ruth Jones.", "Newport West was created when the former Newport constituency was split into two seats in 1983. The seat was won on a narrow three-figure majority by the Conservatives. However, Labour's Paul Flynn gained the seat in 1987 and held it until his death in 2019.", "|Paul Flynn"]}, {"page": "Labour Campaign for Electoral Reform", "response": ["Many Labour MPs past and present have supported LCER and its activities. In the past, this included such high-profile figures as Mo Mowlam, Robin Cook, Paul Flynn, Clare Short, Tessa Jowell, Rhodri Morgan and Janet Anderson."]}, {"page": "Maggie Jones, Baroness Jones of Whitchurch", "response": ["Following her election defeat, Jones was nominated for a Life Peerage in 2005 by the Labour Party, according to a list leaked to The Times. This leaked list eventually led to the Cash for Peerages scandal in which Jones was not implicated. On 10 April 2006, her nomination for a peerage was officially announced, and she was gazetted as Baroness Jones of Whitchurch, of Whitchurch in the County of South Glamorgan on 5 June 2006. Jones' peerage was widely criticised, with Law stating \"That is the way New Labour works. It's a poor example of patronage and power.\" Labour MP Paul Flynn was also critical, he argued: \"This is standing democracy on its head. The House of Lords shouldn't be used to reward a candidate who has been emphatically rejected by the electorate.\"Losing candidate tipped for peerage | South Wales Argus"]}, {"page": "Iain Overton", "response": ["In November 2012, eight members of parliament supported an Early day motion, tabled by Paul Flynn MP, praising the stories reported at the Bureau under Iain Overton's editorship."]}, {"page": "List of United Kingdom MPs: F", "response": ["*Paul Flynn"]}, {"page": "Flynn", "response": ["* Paul Flynn (politician) (1935–2019), British Labour Party MP for Newport West", "* Paul Flynn (Waterford hurler) (born 1974), Irish hurler for Waterford", "* Paul Flynn (Gaelic footballer) (born 1986), Dublin Gaelic footballer"]}, {"page": "1994 Labour Party leadership election", "response": ["| Paul Flynn || Blair || Beckett"]}, {"page": "List of MPs for constituencies in Wales (2005–2010)", "response": ["*Paul Flynn (Newport West)", "*Paul Flynn (Newport West) [Lab]"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Paul Flynn, Newport West, 1987–2019"]}, {"page": "1987 in Wales", "response": ["**Labour's Paul Flynn wins back Newport West from the Conservatives."]}, {"page": "Mark Robinson (English politician)", "response": ["Robinson was elected Conservative Member of Parliament for the notionally safe Labour seat of Newport West in 1983. Because of his background at the UN and Commonwealth he was appointed to the Foreign Affairs Select Committee, a position he held until in 1985 when he was appointed Parliamentary Under-Secretary of State, Welsh Office, by Margaret Thatcher. Despite achieving an increase in his share of the vote, he lost his seat at the 1987 General Election to Paul Flynn. He was re-elected in 1992 for the Somerset seat of Somerton and Frome. He was Parliamentary Private Secretary to the Minister for Overseas Development, Baroness Chalker, and the Foreign and Commonwealth Secretary, Douglas Hurd, but was defeated at the 1997 General Election by David Heath. He has since served as a Commonwealth election observer."]}, {"page": "Caldicot and Wentloog Levels", "response": ["This was superseded in 1942 by the Caldicot and Wentlooge Levels Drainage Board, now the Internal Drainage Board or IDB.Caldicot & Wentlooge Levels Internal Drainage Board Website  In 2012, the IDB was criticised in a report by the Wales Audit Office for overpaying staff, paying for trips abroad for its members, and acting unlawfully on other occasions.  The IDB accepted the report and stated that the organisation's management had changed substantially since the time of the offences. South Wales Argus, Gwent public body responds to damning report, 8 October 2012. Retrieved 10 October 2012 Newport West MP Paul Flynn called for further police investigation into what had happened. Monmouthshire Free Press, Newport MP calls for police probe after damning report on Gwent quango, 10 October 2012. Retrieved 11 October 2012"]}, {"page": "Home Affairs Select Committee", "response": ["| Paul Flynn (Lab)", "| Paul Flynn"]}, {"page": "Paul Flynn", "response": ["Paul Flynn or Flinn may refer to:", "*Paul Flynn (Gaelic footballer) (born 1986), Dublin Gaelic footballer", "*Paul Flynn (Waterford hurler) (born 1974), Irish hurler", "*Paul Flynn (Tipperary hurler) (fl. 2017), Irish hurler", "*Paul Flynn (politician) (1935–2019), British Labour Party MP for Newport West"]}, {"page": "1935 in Wales", "response": ["*9 February – Paul Flynn, politician (died 2019)"]}, {"page": "Don Barry Mason", "response": ["Don Barry Mason (1950–2006) was the founder of the Psychedelic Shamanistic Institute (PSI), a networking organisation that encouraged ethnobotany and scientific research into cannabis and other psychoactive plants while contributing substantially to the public debate about drug policy reform.  Associates of PSI include:  Mathew Atha, Colin Angus, Brian Barritt, Michael Carmichael, Fraser Clark, Paul Devereux, the late John Entwistle, Paul Flynn MP, Ben Ganly, Lee Harris, Mike Jay, Howard Marks, Dr John Marks, Jonathan Ott, Dr Russell Newcombe, Richard Rudgley and Youth."]}, {"page": "1935 in the United Kingdom", "response": ["** Paul Flynn, politician (died 2019)"]}, {"page": "Welsh Affairs Select Committee", "response": ["During the 2015–2017 Parliament the following were members: Gerald Jones, Antoinette Sandbach, Christina Rees and Carolyn Harris were replaced by: Glyn Davies, Chris Elmore, Paul Flynn and Stephen Kinnock."]}, {"page": "United Kingdom general election records", "response": ["*Paul Flynn, Newport West, 2017: 82"]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Paul Flynn || Tony Blair || Margaret Beckett"]}, {"page": "Prince William Cup", "response": ["The naming of the cup for Prince William has caused considerable controversy in Wales. Many people called on the WRU to rename the trophy in honour of Welsh international rugby star Ray Gravell, who died on 31 October 2007.BBC Wales South West During a tribute to Gravell at the inaugural match the stadium announcer asked the crowd to remember Ray as 'gwir dywysog Cymru', a true prince of Wales. Gravell's funeral was attended by over 10,000 people, including Rhodri Morgan, First Minister of Wales. On-line petitions were launched. The matter was raised in the National Assembly for Wales by Helen Mary Jones AM backed by a number of other AMs including Bethan Jenkins.Bethan Jenkins AM on Blogspot Amongst MPs, Labour MP Paul Flynn and Plaid's Adam Price MP called for the WRU to honour Ray Gravell as a patriotic Welshman rather than Prince William, regarded by many in Wales as an Englishman who openly supports the England rugby and football teams.Adam Price MP calls on WRU to rename cup "]}]}}