{"wiki_id": "http://www.wikidata.org/entity/Q390625", "itemLabel": "Thomas Burn", "itemDescription": "English footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Burn", "wikipedia_page": {"main": "Thomas Christopher Burn (29 November 1888 – 23 July 1976) was an England amateur footballer who played at the 1912 Summer Olympics. He was part of the Great Britain team, which won the gold medal in the football tournament. He played in all three of the games against Hungary, Finland and Denmark. He played his club football for London Caledonians F.C.. He also played in the English FA XI tour of South Africa in 1920.", "link_mentions": [{"page": "Football at the 1912 Summer Olympics", "response": ["|DF || || Thomas Burn", "|style=\"width:12em\" valign=top|   Arthur BerryRonald BrebnerThomas BurnJoseph DinesEdward HanneyGordon HoareArthur KnightHenry LittlewortDouglas McWhirterIvan SharpeHarold StamperHarold WaldenVivian WoodwardGordon Wright"]}, {"page": "List of Olympic medalists in football", "response": ["|valign=top| Arthur BerryRonald BrebnerThomas BurnJoseph DinesEdward HanneyGordon HoareArthur KnightHenry LittlewortIvan SharpeHarold WaldenVivian Woodward   Douglas McWhirterThe database of the International Olympic Committee lists only the eleven players as medalists for each nation, who played in the first match for their nation. This list contains these eleven players, as well as all other players who made at least one appearance for their team during the tournament.Harold StamperGordon Wright"]}, {"page": "Football at the 1912 Summer Olympics – Men's team squads", "response": ["| - || DF ||align=\"left\"| Thomas Burn || 1888-11-29 || 23 || 4+0 ||align=\"left\"|  London Caledonians || 3 || 0"]}, {"page": "Football at the 1912 Summer Olympics – Matches", "response": ["| DF || || Thomas Burn", "| DF || || Thomas Burn", "|DF || || Thomas Burn"]}, {"page": "1913 FA Charity Shield", "response": ["Hampton completed his hat-trick after five minutes of the second half, but then the Amateurs took control. Sam Hardy kept out shots from Dick Healey, Ivan Sharpe and Herbert Farnfield before being beaten twice in five minutes. After a \"great shot\" from Preston North End winger George Barlow, the Amateurs' second was touched in by Farnfield after a move involving four players brought the ball all the way down the field. It was, according to the pseudonymous 'Reflector', writing in the Mirror, \"easily the best of the match.\" Confusion between goalkeeper Ronald Brebner and full-back Thomas Burn presented Hampton with his fourth, and Holley completed the scoring late on.", "|Full back|| Thomas Burn||London Caledonians"]}, {"page": "List of 1912 Summer Olympics medal winners", "response": ["|style=\"width:12em\" valign=top|   Arthur BerryRonald BrebnerThomas BurnJoseph DinesEdward HanneyGordon HoareArthur KnightHenry LittlewortDouglas McWhirterIvan SharpeHarold StamperHarold WaldenVivian WoodwardGordon Wrightthumb|right|200px|The Great Britain squad"]}, {"page": "Burn, Thomas", "response": ["#redirectThomas Burn"]}]}}