{"wiki_id": "http://www.wikidata.org/entity/Q39089759", "itemLabel": "Edward Wilkins", "itemDescription": "English clergyman and cricketer (1835-1921)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Wilkins_(cricketer)", "wikipedia_page": {"main": "Edward John Paul Wilkins (29 September 1835 – 23 April 1921), known in later life by the surname \"Wilkins-Leir\", was an English clergyman and a cricketer who played in four first-class cricket matches in 1858 and 1859. He was born at Hempstead, Norfolk and died at Weston, Bath, Somerset.\nThe son of the rector of St Andrew's Church, Hempstead, Wilkins was educated at Marlborough College and at Trinity Hall, Cambridge. As a cricketer, he was a lower-order batsman and in his first-class matches he both bowled and kept wicket; it is not known whether he was right- or left-handed, and his bowling style is not known. He played in trial matches for the Cambridge University team in both 1857 and 1858, but made little impression in either game. However, in a first-class match for the Cambridgeshire team – really a variation of the Cambridge Town Club – against Surrey in June 1858, he top-scored with an innings of 26. That led to his selection, just three days later, for the Cambridge University team for the annual University Match against Oxford University and although his two innings yielded only a single run and his bowling failed to take any wickets, he retained his place for the next Cambridge University match, against the Marylebone Cricket Club (MCC), when he kept wicket. His only game in 1859 was also the match against the MCC; in it he took his only wicket as a bowler.Wilkins graduated from Cambridge University in 1860 with a Bachelor of Arts degree. He was ordained into the Church of England as a deacon in 1861 and as a priest in 1862, but never took charge of a parish: instead, he served as a curate at Stawell in Somerset from 1861 to 1863, and then at two parishes in Norfolk, Belaugh from 1863 to 1873 and Gimingham from 1874 to 1878. His father died in 1876 and his mother, formerly Mary Leir from a family from Somerset, died in 1880; in 1881, Wilkins moved to Leir family properties at Weston, on the outskirts of Bath, and changed his name by royal warrant to Wilkins-Leir. He never married and lived with his sister (who retained the name Wilkins): his local newspaper obituary described him as \"a man of retiring disposition [who] disliked publicity\".", "link_mentions": [{"page": "Edward Wilkins", "response": ["Edward Wilkins  may refer to:", "*Edward Wilkins, namesake of Edwardsport, Indiana", "*Edward Wilkins, character in A Dark Night's Work", "*Edward Wilkins (cricketer) (1835–1921), later \"Wilkins-Leir\", English cricketer and clergyman", "*Edward Wilkins Waite, landscape painter"]}, {"page": "List of Cambridge Town Club and Cambridgeshire cricketers", "response": ["* Edward Wilkins (1858) : E. J. P. Wilkins"]}]}}