{"wiki_id": "http://www.wikidata.org/entity/Q39089787", "itemLabel": "David Law", "itemDescription": "British sports broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Law_(broadcaster)", "wikipedia_page": {"main": "David Law (born 7 September 1973) is a British sports broadcaster. He primarily commentates on tennis for BBC Radio Five Live and BT Sport. He also presents The Tennis Podcast.", "link_mentions": [{"page": "List of sports announcers", "response": ["* David Law – BBC Radio 5 Live 2002–present, BT Sport 2013-"]}, {"page": "BBC Sport", "response": ["For the most recent tournament in 2021, the commentators included, Chris Bradnam, James Burridge, Andrew Castle, Matt Chilton, Andrew Cotter, Katherine Downes, Paul Hand, John Inverdale, David Law, Nick Lester, Dan Lobb, Alison Mitchell, Ronald McIntosh, Nick Mullins, Pete Odgers, Mark Petchey, Simon Reed, Sam Smith and Andy Stevenson.  Co-commentators included, Tracy Austin, Marion Bartoli, Boris Becker, Pat Cash, Annabel Croft, Colin Fleming, Peter Fleming, Tim Henman, Anne Keothavong, John Lloyd, Miles Maclagan, John McEnroe, Martina Navratilova, Arvind Parmar, Louise Pleming, Chanda Rubin, Liz Smylie and Mel South. Lee McKenzie, Rishi Persad, John Inverdale and Simon Mundie were the reporters. Regular tournament weather updates are provided by Carol Kirkwood.", "BBC Radio covers the four Grand Slam tournaments - the Australian Open, French Open, Wimbledon and US Open - on BBC Radio 5 Live and BBC Radio 5 Live Sports Extra. For most recent Wimbledon tournament in 2021, Gigi Salmon and Tony Livesey hosted full coverage on Radio 5 Live, with expert analysis from Marion Bartoli, Pat Cash, Laura Robson, Leon Smith, Chanda Rubin, Annabel Croft, Miles Maclagan, Mark Woodforde and Jeff Tarango. The team of commentators is led by the BBC's tennis correspondent, Russell Fuller, along with Gigi Salmon, David Law, Naomi Cavaday, Jonathan Overend, Iain Carter, Alison Mitchell and Sara Orchard. For other grand slam tournaments, Russell Fuller, David Law and Gigi Salmon are the commentators. For the select few ATP Tour Masters 1000 events that BBC Radio cover, Russell Fuller is usually the sole commentator."]}, {"page": "5 live Sport", "response": ["Tennis - Russell Fuller, David Law, Gigi Salmon"]}, {"page": "BT Sport", "response": ["From January 2017, BT Sport had the rights to show 52 WTA tournaments every year until 2019. Coverage on most competitions took feeds from the WTA international TV feed, but with larger events from the Premier Mandatory and Premier 5 category matches, Sam Smith or occasionally Annabel Croft presented coverage alongside Martina Navratilova. Lead commentary was provided by Chris Bradnam, David Law and David Mercer alongside co-commentators, Annabel Croft, Nigel Sears, Anne Keothavong and Jo Durie.", "The last competition BT Sport broadcast was the 2019 WTA Finals in which Clare Balding presented coverage alongside Anne Keothavong and Jo Durie. With Annabel Croft and Nigel Sears reporting from Shenzhen. Lead commentary came from David Law and David Mercer alongside Keothavong and"]}, {"page": "David Law", "response": ["David Law may refer to:", "*David Law (cartoonist) (1908–1971), Scottish cartoonist", "*David Law (broadcaster) (born 1973), tennis broadcaster", "*David Law (golfer) (born 1991), Scottish golfer", "*David Law (athlete), English athlete", "*David Law (politician), American politician", "*David Laws (disambiguation)"]}, {"page": "Tennis on television", "response": ["As of January 2017, BT Sport have the rights to show 52 WTA tournaments every year until 2019. Coverage is introduced by Annabel Croft with Martina Navratilova and commentary comes from Chris Bradnam, David Law, Sam Smith, Jo Durie and Anne Keothavong."]}, {"page": "The Tennis Podcast", "response": ["The Tennis Podcast is a podcast about tennis. It began production in 2012 with weekly shows throughout the year. During the four annual Grand Slam tennis tournaments - the Australian Open, French Open, Wimbledon and the US Open, the podcast airs daily. It is presented by tennis broadcasters David Law, Catherine Whitaker and Matthew Roberts with discussion about recent tennis news and results, and upcoming matches and tournaments. It also features interviews, and during the pandemic it ran a series called Tennis Re-Lived in the absence of live tennis."]}, {"page": "Catherine Whitaker", "response": ["Since May 2012, she has co-presented The Tennis Podcast, a weekly downloadable podcast, with daily editions at the Grand Slam tennis tournaments. Her co-presenter is BBC tennis commentator David Law. At Wimbledon, she has reported and commentated for BBC Radio 5 Live and BBC Television."]}]}}