{"wiki_id": "http://www.wikidata.org/entity/Q390690", "itemLabel": "Owen Smith", "itemDescription": "Welsh politician and MP", "wikipedia_url": "https://en.wikipedia.org/wiki/Owen_Smith", "wikipedia_page": {"main": "Owen Smith  (born 2 May 1970) is a British lobbyist and former politician who has been the UK government relations director for pharmaceutical company Bristol Myers Squibb since 2020. A member of the Labour Party, he was Member of Parliament (MP) for Pontypridd from 2010 to 2019.Before being elected to Parliament, Smith worked as a radio and television producer for the BBC, as a special adviser for Welsh Secretary Paul Murphy, and as a political lobbyist for Pfizer. Smith went on to serve as Shadow Welsh Secretary under Ed Miliband from 2012 until 2015, and then as Shadow Work and Pensions Secretary under Jeremy Corbyn from 2015 until he resigned in June 2016. On 13 July 2016, he contested the leadership of the Labour Party and was defeated. After the 2017 general election, Corbyn appointed Smith as Shadow Secretary of State for Northern Ireland. He was dismissed from this post on 23 March 2018 after he publicly called for a referendum on the final Brexit deal, a position that was against Labour policy of the time (the party adopted this position the following year).", "link_mentions": [{"page": "Politics of the United Kingdom", "response": ["In addition, the EU referendum campaign plunged the Labour Party into crisis and resulted in a motion of no confidence in the party leader Jeremy Corbyn being passed by the party's MPs in a 172–40 vote, which followed a significant number of resignations from the Shadow Cabinet. This led to a leadership election which began with Angela Eagle, the former Shadow First Secretary of State and Shadow Secretary of State for Business, Innovation and Skills who eight days later withdrew from the leadership race, to support Owen Smith, the former Shadow Secretary of State for Work and Pensions. This was won by Jeremy Corbyn with an increased majority."]}, {"page": "Ben Bradshaw", "response": ["Bradshaw is a former critic of Jeremy Corbyn, whom he accused in a September 2016 article of being a \"destructive combination of incompetence, deceit and menace\". This comment was after Bradshaw was included on an internal Labour list of MPs, issued by mistake, who were implicated in \"abusing\" Corbyn and his supporters. He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party (UK) leadership election. However, Bradshaw later changed his position on Jeremy Corbyn, praising his 2017 election performance."]}, {"page": "Margaret Beckett", "response": ["Beckett was one of 36 Labour MPs to nominate Jeremy Corbyn as a candidate in the Labour leadership election of 2015. Later, during an interview with BBC Radio 4's World at One, after it became known he was in the lead among the candidates, Beckett was asked if she was \"a moron\" for nominating Corbyn. She replied: \"I am one of them\". Furthermore, in January 2016, Beckett claimed that Labour would need an \"unexpected political miracle\" if it were to win under his leadership, and criticised Corbyn for failing to win back the trust of the electorate on welfare reform and mass immigration, saying: \"I think we had the right policies towards immigration, but the simple thuggishness of the kind of Ukip and Conservative approach is easier to understand and we didn't overcome those communication difficulties ... We have to try and work on ways to overcome that – I'm not suggesting we've done it yet\". She later supported Owen Smith in the failed attempt to replace Corbyn in the 2016 Labour leadership election."]}, {"page": "Chris Bryant", "response": ["In September 2015, following Jeremy Corbyn's election as Labour Party leader, Bryant was appointed Shadow Leader of the House of Commons. He resigned from this position on 26 June 2016, along with other shadow ministers after the Brexit vote. He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election."]}, {"page": "List of \"-gate\" scandals and controversies", "response": ["| Lunaticgate || 2016 || During the 2016 Labour Party leadership election campaign, leadership challenger Owen Smith, in a speech to party members in Hammersmith on August 23, said \"What you won't get from me is some lunatic at the top of the Labour Party\", commenting about incumbent Leader Jeremy Corbyn and sparking outrage from many. Though Smith later admitted that he needed to be \"slightly less colourful\" with his choice of language, he said that his comment was not referring to Corbyn. || "]}, {"page": "Hilary Benn", "response": ["Benn served as Shadow Secretary of State for Environment, Food and Rural Affairs in 2010 during Harriet Harman's interim leadership of the Labour Party. In the Shadow Cabinet of Ed Miliband, announced on 8 October 2010, he was appointed Shadow Leader of the House of Commons. When Miliband reshuffled his cabinet on 7 October 2011, he was named Shadow Secretary of State for Communities and Local Government. Later, he supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election."]}, {"page": "Keith Vaz", "response": ["Vaz supported Owen Smith in the 2016 Labour leadership election. He is a member of Labour Friends of Israel."]}, {"page": "GMB (trade union)", "response": ["While in the 2015 Labour Leadership Election GMB didn't endorse a candidate, in the 2016 Labour Leadership Election, the union endorsed Owen Smith against incumbent leader Jeremy Corbyn."]}, {"page": "Alan Davies", "response": ["He is a supporter of the Labour Party, saying to Saga magazine in 2013: \"Social injustice is important to me. Life isn't about every man for himself. Life should be about co-operation and collaboration.\" Despite initially voting for Jeremy Corbyn to be party leader, when being interviewed by Radio Times alongside fellow comedian Jo Brand regarding the broadcast of his Channel 4 sitcom Damned (which coincided with the 2016 Labour leadership election), Davies supported Owen Smith's leadership bid, saying Corbyn was an ineffective Leader of the Opposition."]}, {"page": "Andrew Smith (British politician)", "response": ["He supported Owen Smith in the 2016 Labour Party leadership election."]}, {"page": "Stephen Twigg", "response": ["On 19 June 2015, he was elected chairman of the International Development Select Committee. He supported Owen Smith in the 2016 Labour leadership election."]}, {"page": "Adrian Bailey", "response": ["He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party (UK) leadership election."]}, {"page": "Kevin Barron", "response": ["He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election."]}, {"page": "Clive Betts", "response": ["He supported Owen Smith in the 2016 Labour Party (UK) leadership election."]}, {"page": "Karen Buck", "response": ["Following Labour's defeat at the 2015 election, which saw Buck re-elected with a slightly decreased majority, Miliband resigned as leader. Buck nominated Yvette Cooper in the resulting leadership election. Cooper came third, with Jeremy Corbyn becoming party leader; Buck did not serve in any posts during his leadership. In the 2016 Labour leadership election, when Corbyn was challenged by Owen Smith, Buck nominated Smith. At the 2017 general election, Buck increased her majority by 14.7%, from 1,977 (5.0%) to 11,512 (26.6%), representing a 10.8% swing to Labour in the constituency."]}, {"page": "Richard Burden", "response": ["He retained a Shadow Ministerial role under Jeremy Corbyn after he was elected as party leader in 2015. Burden resigned from this position following a vote of no confidence in Corbyn by members of the Parliamentary party, telling Corbyn he was \"making a bad situation worse\" by choosing to remain Labour leader. He supported Owen Smith in the failed attempt to replace Corbyn in the 2016 Labour leadership election. He rejoined the frontbench as Shadow Transport Minister in October 2016, with responsibility for aviation, maritime, roads and future transport. He stayed in this post until the 2017 general election, after which he stood down from the frontbench to join the International Development Committee."]}, {"page": "Yvette Cooper", "response": ["She supported Owen Smith against Jeremy Corbyn in the 2016 leadership election."]}, {"page": "Jeremy Corbyn", "response": ["Corbyn was elected Leader of the Labour Party in 2015. The party's membership increased sharply, both during the leadership campaign and following his election. Taking the party to the left, he advocated renationalising public utilities and railways, a less interventionist military policy, and reversals of austerity cuts to welfare and public services. Although critical of the European Union, he supported continued membership in the 2016 referendum. After Labour MPs sought to remove him in 2016, he won a second leadership contest, defeating Owen Smith. In the 2017 general election, Labour increased its share of the vote to 40%, with its 9.6% vote rise their largest improvement since the 1945 general election. Under Corbyn, Labour achieved a net gain of 30 seats and a hung parliament, but the Conservative Prime Minister, Theresa May, formed a minority government and Labour remained in Opposition.", "On 13 July, Owen Smith entered the Labour Party leadership race. Subsequently, on 19 July, Angela Eagle withdrew and offered her endorsement to Smith.", "Corbyn was re-elected as Labour leader on 24 September, with 313,209 votes (61.8%) compared to 193,229 (38.2%) for Owen Smith – a slightly increased share of the vote compared to his election in 2015, when he won 59%. On a turnout of 77.6%, Corbyn won the support of 59% of party members, 70% of registered supporters and 60% of affiliated supporters. In his acceptance speech, Corbyn called on the \"Labour family\" to end their divisions and to \"wipe that slate clean from today and get on with the work we've got to do as a party\". He continued: \"Together, arguing for the real change this country needs, I have no doubt this party can win the next election whenever the Prime Minister decides to call it and form the next government.\""]}, {"page": "Socialist Campaign Group", "response": ["In the days following the referendum a number of Corbyn's critics resigned from the Shadow Cabinet and the parliamentary party passed a vote of no confidence in Corbyn by 172 votes against to 40 for. Corbyn promoted a number of Campaign Group MPs to fill his Shadow Cabinet including Richard Burgon, Rebecca Long-Bailey, Grahame Morris and Clive Lewis, and with their support along with that of other left wing MPs and the mobilisation of members by Momentum Corbyn refused to resign. Owen Smith secured the required nominations to run against him."]}, {"page": "Kate Hoey", "response": ["Hoey attracted criticism again from within the Labour Party and from Irish political figures in February 2018 after she said the Good Friday Agreement was \"not sustainable in the long term\". These comments followed similar remarks by Eurosceptic Conservative politicians Daniel Hannan and Owen Paterson. Simon Coveney, the Republic of Ireland's Tánaiste (deputy head of government) and Minister for Foreign Affairs and Trade, condemned the comments as \"not only irresponsible but reckless\". Owen Smith, the Shadow Secretary of State for Northern Ireland, said the remarks by Hannan, Paterson and Hoey were a \"concerted, transparent effort to undermine the GFA... driven by their blind, misplaced faith in Brexit\" and were \"reckless and utterly wrong\"."]}, {"page": "Margaret Hodge", "response": ["In June 2016, together with Ann Coffey, Hodge called for a motion of no confidence in party leader Jeremy Corbyn. The following month, she supported Owen Smith in the 2016 Labour Party (UK) leadership election."]}, {"page": "Vernon Coaker", "response": ["Following the Labour defeat at the 2010 General Election, Coaker was appointed as Shadow Secretary of State for Northern Ireland in October 2011. Coaker joined dozens of shadow ministers in resigning from his position on 26 June 2016 in Labour's parliamentary disquiet over the leadership of Jeremy Corbyn. He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party (UK) leadership election. He lost his seat in the 2019 general election."]}, {"page": "Jim Cunningham (politician)", "response": ["He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour leadership election."]}, {"page": "Angela Eagle", "response": ["In October 2011, she was appointed Shadow Leader of the House of Commons when Miliband reshuffled his Shadow Cabinet. She was appointed as both Shadow First Secretary of State and Shadow Secretary of State for Business, Innovation and Skills in September 2015 in Jeremy Corbyn's first Shadow Cabinet. She resigned from the Shadow Cabinet in June 2016. Eagle announced a leadership challenge to Labour Party leader Jeremy Corbyn on 11 July 2016, but eight days later she withdrew leaving Owen Smith to challenge Corbyn for the leadership. Eagle is the twin sister of fellow Labour MP Maria Eagle.", "After the 28 June 2016 vote of no confidence by Labour MPs in Jeremy Corbyn's leadership, Eagle was reported as considering a challenge for the leadership of the Labour Party, and said she would do so if Corbyn did not resign. Eagle asserted that: \"I'm not a Blairite. I'm not a Brownite... I am my own woman, a strong Labour woman.\" George Eaton of the New Statesman reported that backers of the other potential challenger, Owen Smith, contended that Eagle's 2003 vote in support for the Iraq War and her support for extending airstrikes against ISIS into Syria (in December 2015) might have harm her bid against Corbyn, Gary Younge of The Guardian thought it was less clear what Eagle wanted in place of Corbyn's politics. Eagle announced a leadership challenge to Corbyn on 11 July, saying that \"Jeremy Corbyn is unable to provide the leadership this huge task needs. I believe I can\". On Tuesday 19 July 2016, Eagle announced she was withdrawing from the leadership election and would back the other candidate opposing Corbyn, Owen Smith, who had received about 20 more nominations from MPs and MEPs than she had. \"We need to have a strong and united party so we can be a good opposition, take the fight to the Conservative Government and heal our country. So I am announcing that I will be supporting Owen in that endeavour with all my enthusiasm and might,\" Eagle said in an interview."]}, {"page": "Maria Eagle", "response": ["In January 2016, Eagle was moved to the position of Shadow Secretary of State for Culture, Media and Sport. She resigned from the shadow cabinet on 27 June 2016 in the mass resignation of the Shadow Cabinet following the Brexit referendum. She supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election."]}, {"page": "Clive Efford", "response": ["Clive Efford was one of 36 Labour MPs to nominate Jeremy Corbyn as a candidate in the Labour leadership election of 2015 and he retained his position in Corbyn's shadow cabinet. He resigned from Corbyn's shadow cabinet following a large number of resignations from the Labour front bench on 28 June 2016. He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party (UK) leadership election."]}, {"page": "Louise Ellman", "response": ["She supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 leadership election."]}, {"page": "Wayne David", "response": ["He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election."]}, {"page": "Caroline Flint", "response": ["During the 2016 European Union membership referendum, Flint campaigned for remain. She supported Owen Smith in the failed attempt to replace Jeremy Corbyn as party leader in the subsequent Labour leadership election."]}, {"page": "Paul Farrelly", "response": ["Farrelly's majority was reduced to 650 in 2015. He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election."]}, {"page": "Stephen Pound", "response": ["He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour leadership election."]}, {"page": "Albert Owen", "response": ["He supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party (UK) leadership election."]}, {"page": "Roger Godsiff", "response": ["Godsiff supported Owen Smith in the latter's failed attempt to replace Jeremy Corbyn in the 2016 Labour leadership election."]}, {"page": "Helen Jones", "response": ["She supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party (UK) leadership election. She is a member of Labour Friends of Israel. Her book, \"How to be a Government Whip\", about her time in the Whip's Office, was published by Biteback Publishing in 2016."]}]}}