{"wiki_id": "http://www.wikidata.org/entity/Q39071252", "itemLabel": "Simon Thompson", "itemDescription": "British investment banker", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Thompson_(businessman)", "wikipedia_page": {"main": "Simon Thompson (born 16 June 1959) is a British investment banker and business executive. He is the current chairman of the Rio Tinto Group and was the former chairman of: Tarmac Group, and Tullow Oil. He serves as the chairman of 3i, a private equity and venture capital firm.", "link_mentions": [{"page": "Rio Tinto (corporation)", "response": ["***Simon Thompson, chairman On 3 March 2021 Thompson accepted responsibility for destroying sacred Indigenous sites in Australia and announced he would not seek reelection as chair."]}, {"page": "European Round Table of Industrialists", "response": ["* Simon Thompson (Rio Tinto)"]}, {"page": "List of alumni of University College, Oxford", "response": ["*Simon Thompson, chairman of 3i, former chairman of the Tarmac Group and Tullow Oil"]}, {"page": "Jean-Sébastien Jacques", "response": ["Upon his resignation, Rio Tinto's chairman Simon Thompson stated that “What happened at Juukan was wrong and we are determined to ensure that the destruction of a heritage site of such exceptional archaeological and cultural significance never occurs again at a Rio Tinto operation. . . . I would like to thank J-S for his strong leadership of the Group since becoming Chief Executive in 2016. During that time, he has led the best safety performance in Rio Tinto’s history, simplified the portfolio, divested the Group’s coal assets, established a clear strategy to address climate change and generated exceptional shareholder returns. His leadership during the COVID-19 pandemic, in particular, has been exemplary\"."]}, {"page": "List of Athenaeum Club members", "response": ["* Simon Thompson (b. 1959) "]}, {"page": "Stuart Simpson", "response": ["Simpson has held various roles in Royal Mail prior to  appointment as interim CEO in 2020. Joining the company in 2009 as Finance Director for Group Operations, he held the Chief Finance Officer role for almost two years before becoming CEO. He was replaced as CEO by Simon Thompson on 11 January 2021."]}]}}