{"wiki_id": "http://www.wikidata.org/entity/Q39078634", "itemLabel": "John Cooper", "itemDescription": "British comics artist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cooper_(artist)", "wikipedia_page": {"main": "John Cooper (1942 – 22 February 2015) was a British comics artist.\nCooper was born in Featherstone, West Yorkshire, in 1942. In 1963 he became a freelance artist, and illustrated the comic strips \"Captain Scarlet\", \"Thunderbirds\"  and \"Secret Agent 21\" for TV Century 21. In 1975 he co-created \"One-Eyed Jack\" for Valiant, with writer John Wagner. He later became the regular artist on \"Johnny Red\" for Battle Picture Weekly, drawing over 300 episodes, as well as \"Action Force\" and \"Dredger\" for the same title. For 2000 AD he drew \"Judge Dredd,\" \"M.A.C.H. 1\", Alan Moore's \"Abelard Snazz\" and some \"Future Shocks\". He also worked on Starlord, Eagle, Scream!, Marvel UK, Roy of the Rovers, Warlord, the Judge Dredd Megazine and Private Eye.\nAs well as his work on comics, he also painted detailed maritime scenes by private commission, and did some work as a courtroom artist.\nHe was married twice, and had two children from his first marriage.", "link_mentions": [{"page": "Sexton Blake", "response": ["Writers who worked on Sexton Blake stories throughout this 53-year span included Charles Henry St. John Cooper, John Creasey, Jack Trevor Story, John G. Brandon, Michael Moorcock, and (allegedly) Brian O'Nolan (aka Flann O'Brien and Myles na gCoppaleen.)", "In Union Jack number 53, in a story titled \"Cunning Against Skill\", Blake picked up a wiry street-wise orphan as an assistant who was known only as \"Tinker\" until the 1950s. With the popularity of school stories during the early 1900s, Tinker's schooldays were chronicled in issues 229 and 232. Over the years, Tinker changed from a boy and good fighter to a rugged and capable young man. As well as assisting the \"guv'nor\", as he called Blake, Tinker kept Blake's crime files up to date with clippings from the daily newspapers, in addition to assisting Blake in his fully equipped crime laboratory. The Edwardian British private detective Herbert Marshall was a friend of one of the Blake authors', Charles Henry St John Cooper (1869–1926), and stated that Cooper had based the character of Tinker on Marshall's own teenaged assistant Henry Drummond. Drummond sold newspapers in Northumberland Avenue in order to support his widowed mother until, aged just 14, he was offered a job by Marshall. Drummond died in around 1905 from tuberculosis, aged 19."]}, {"page": "John Cooper", "response": ["John Cooper may refer to:", "* John Cooper (Islamic scholar) (Yahya Cooper) (1947-1998), British Islamic scholar and professor at the University of Cambridge", "* John Cooper (composer) (c. 1570–1626), English classical composer", "* John Cooper (actor) (1793–1870), English actor", "* John Cooper (artist) (1942–2015), English comic illustrator", "* John Cooper (author) (born 1958), Canadian writer and communications specialist", "* John Cooper (musician) (born 1975), American singer for Skillet", "* John Cooper (fl. 1980s–2010s), director of the Sundance Film Festival", "* John Cooper (British Army officer) (born 1955), commander of British forces in Iraq 2008", "* John Cooper (MP for Worcester), in 1380 and 1395 Member of Parliament (MP) for Worcester", "* John Cooper (MP for Maldon), in 1421 and 1425 MP for Maldon", "* John Cooper (fl. 1529), MP for Berwick-upon-Tweed", "* Sir John Cooper, 1st Baronet (died 1630), English landowner and politician", "* John Cooper (died 1779), British politician", "* John Cooper (New Jersey politician) (1729–1785), public official from New Jersey during the American Revolution", "* John Cooper (Arkansas politician) (born 1947), member of the Arkansas State Senate since 2014", "* John Cooper (Tennessee politician) (born 1956), mayor of Nashville", "* John Cooper (barrister) (born 1958), British barrister and Queen's Counsel", "* John Cooper (footballer, born 1897) (1897–1975), English footballer", "* John Cooper (Scottish footballer) (fl. 1930s), Scottish footballer", "* John Cooper (car maker) (1923–2000), British racing driver & entrepreneur", "* John Cooper (cricketer) (1922-2012), Australian cricketer", "* John Cooper (Australian footballer) (born 1935), Australian footballer", "* John Cooper (American football) (born 1937), coach", "* John Cooper (motorcyclist) (born 1938), British Grand Prix motorcycle racer", "* John Cooper (hurdler) (1940–1974), British athlete", "* John Cooper (tennis) (born 1946), Australian tennis player", "* John Cooper (basketball) (born 1969), head men's basketball coach at Miami University", "* John Cooper (priest) (died 1896), Archdeacon of Westmorland", "* John Cooper (Archdeacon of Aston) (born 1933), British Anglican priest", "* John Cooper (serial killer) (born 1944), serial killer from Milford Haven, Pembrokeshire", "* John Cooper (Southland), a character on Southland", "* John Cooper, a character in Desperados: Wanted Dead or Alive", "* John Cooper Clarke, English performance poet"]}, {"page": "John Wagner", "response": ["Wagner continued to write for girls' comics, including scripting gymnastics strip \"Bella at the Bar\" for Tammy,Brave Bella Barlow, Tammy's Most Popular Heroine , Books Monthly (undated) and was appointed editor of the ailing boys' weekly Valiant. Characters he created for this title included the tough New York City cop \"One-Eyed Jack\", drawn by John Cooper, which was inspired by the film Dirty Harry and became the comic's most popular character,\"I invented Judge Dredd\", BBC, 28 February 2002 and \"Soldier Sharp\", drawn by Joe Colquhoun, about a cunning coward in World War II. Both strips transferred to Battle when Valiant was merged into it in 1976, with One-Eyed Jack leaving the police and becoming a spy.David Bishop, \"Blazing Battle Action\" part 2, Judge Dredd Megazine No. 210, 23 September 2003, pp. 72–79"]}, {"page": "Battle Picture Weekly", "response": ["* The General Dies at Dawn, by Gerry Finley-Day and John Cooper — a Wehrmacht General, due to be executed for treason, spends his final hours describing his wartime experiences to the sympathetic guard outside his cell.", "* Johnny Red, written by Tom Tully and drawn initially by Joe Colquhoun, later by John Cooper and finally by Carlos Pino — about a British fighter pilot Johnny \"Red\" Redburn flying for the Russians in a Hawker Hurricane fighter. Later Redburn flies with the RAF and United States Army Air Forces in England, before returning to the Eastern Front in a Hawker Typhoon nicknamed The Red Death. Johnny Red ran continuously for ten years and was Battle's longest-running series.", "* One-Eyed Jack by John Wagner and John Cooper — a Dirty Harry like character. Originally a cop in Valiant, he became a spy when he came to Battle."]}, {"page": "Starlord (comics)", "response": ["Art: Ian Kennedy 1, 3; John Cooper 2", "Art: John Cooper"]}]}}