{"wiki_id": "http://www.wikidata.org/entity/Q39039664", "itemLabel": "Mary Adams", "itemDescription": "Scottish interceptor for Bletchley Park", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Adams_(codebreaker)", "wikipedia_page": {"main": "Mary Adams (née Ritchie) (3 November 1922 – 12 July 2010) was a Scottish interceptor for Bletchley Park during World War II.Adams was born in Montrose, Scotland to Maggie and John Ritchie. Her father was a railway foreman. Her parents moved to Stonehaven where she attended Mackie Academy before going on to take a job as a clerk in solicitors' office. In 1943 she signed up for the Auxiliary Territorial Service and was selected for the Royal Corps of Signals, where she was trained in receiving Morse code. She was then assigned to Bletchley Park as an interceptor of German and Italian coded signals. Adams stated that she preferred to intercept Italian signals as Italians were often excitable when transmitting which lead them to make mistakes causing them to repeat their messages, and thereby giving her a second chance to capture their messages.Having signed the Official Secrets Act, Adams did not talk to anyone, not even her husband, about her work during the war. When MI6 officer Frederick Winterbotham published his book The Ultra Secret in 1974, she then felt able to mention her work.Adams married Bob Adams, an accountant, in 1950. They had three children, Bob, David and Lorna.After the war Adams trained as a radiographer at Manchester Royal Infirmary. After her children were born she worked as a volunteer at the Citizens' Advice Bureau, going on to work as trainer and tutor at its Edinburgh offices.In 2009 Adams was presented with the Bletchley Park Commemorative Badge in recognition of her role during the war.In later life she suffered from Alzheimer's disease and was cared for at a nursing home. She died on 12 July 2010.", "link_mentions": [{"page": "Mary Adams", "response": ["Mary Adams may refer to:", "* Mary Adams (activist) (born 1938), tax activist who led the repeal of Maine's statewide property tax and efforts to enact a Taxpayer Bill of Rights", "* Mary Adams (actress) (1910–1973), American actress", "* Mary Adams (broadcaster) (1898–1984), administrator who helped to develop the BBC's television service in the 1950s", "* Mary Adams (codebreaker) (1922–2010), Scottish interceptor for Bletchley Park during World War II", "* Mary Adams (educator) (1823–1898), Canadian women's education reformer"]}, {"page": "Mary (name)", "response": ["* Mary Adams (activist) (born 1938), tax activist who led the repeal of Maine's statewide property tax and efforts to enact a Taxpayer Bill of Rights", "* Mary Adams (actress) (1910–1973), American actress", "* Mary Adams (broadcaster) (1898–1984), administrator who helped to develop the BBC's television service in the 1950s", "* Mary Adams (codebreaker) (codebreaker, 1922–2010), Scottish interceptor for Bletchley Park  during World War II", "* Mary Adams (educator) (1823–1898), Canadian women's education reformer"]}, {"page": "Deaths in July 2010", "response": ["*Mary Adams, 87, Scottish interceptor, Alzheimer's disease.http://www.scotsman.com/news/obituary-mary-adams-1-817799 "]}]}}