{"wiki_id": "http://www.wikidata.org/entity/Q391652", "itemLabel": "Keith Simpson", "itemDescription": "British politician (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Simpson_(politician)", "wikipedia_page": {"main": "Keith Robert Simpson (born 29 March 1949) is a British Conservative Party politician and military historian who served as Member of Parliament (MP) for Broadland from 2010 to 2019, having previously served as the MP for Mid Norfolk from 1997 to 2010.", "link_mentions": [{"page": "March 29", "response": ["*  1949   – Keith Simpson, English historian and politician"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Keith Simpson", "| Keith Simpson"]}, {"page": "King's College London", "response": ["Notable King's alumni to have held senior positions in British politics include two Speakers of the House of Commons (Lord Maybray-King and Lord Ullswater) and the former Cabinet ministers Lord Watkinson, Lord Passfield and Lord Wilmot. As of the current Parliament there are 20 King's graduates in the House of Commons, namely Alex Burghart, Nic Dakin,‘DAKIN, Nicholas’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Mark Francois,‘FRANCOIS, Rt Hon. Mark (Gino)’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 John Glen, Dan Jarvis, Phillip Lee,‘LEE, Phillip James’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Brandon Lewis,‘LEWIS, Brandon’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Sarah Newton,‘NEWTON, Sarah’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Matthew Offord, Sarah Olney, Dan Poulter,‘POULTER, Dr Daniel Leonard James’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lucy Powell,‘POWELL, Lucy Maria’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Bob Seely, Tulip Siddiq,‘SIDDIQ, Tulip, (Mrs C. W. St J. Percy)’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Keith Simpson, Sir Gary Streeter,‘STREETER, Gary Nicholas’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Gareth Thomas,‘THOMAS, Gareth Richard’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Michael Tomlinson, David Warburton,‘WARBURTON, David John’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 and Sarah Wollaston.‘WOLLASTON, Sarah’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 As of the current Parliament there are 17 King's graduates in the House of Lords including Lord Carlile, Lord Clinton-Davis, Lord Dunlop,‘DUNLOP’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Kakkar,‘KAKKAR’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord MacGregor, Baroness Morgan, Baroness O'Loan,‘O’LOAN’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Owen, Lord Plant,‘PLANT OF HIGHFIELD’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Lord Rowlands,‘ROWLANDS’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Baroness Watkins, and the Lords Spiritual Tim Dakin,‘WINCHESTER, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 Nick Holtam,‘SALISBURY, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016 and Tim Thornton.TRURO, Bishop of’, Who's Who 2016, A & C Black, an imprint of Bloomsbury Publishing plc, 2016"]}, {"page": "Jim Prior", "response": ["Following Prior's death, Keith Simpson MP said of him: \"In many ways he was a larger than life figure. He had a ruddy face, he played up to being the farmer. People underestimated him because he didn't claim to be a Keith Joseph or Enoch Powell parading their intellectualism. But he was somebody who was well-loved by the grassroots and was a decent man who was in politics out of a sense of public service.\""]}, {"page": "List of current members of the British Privy Council", "response": ["| Keith Simpson"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Keith Simpson"]}, {"page": "David Jamieson (British politician)", "response": ["He then stood for Plymouth Devonport in the 1992 general election and was successful, defeating Conservative candidate Keith Simpson by 24,953 votes (48.7%) to 17,541 votes (34.3%)."]}, {"page": "Keith Robert Simpson", "response": ["#REDIRECT Keith Simpson (politician)"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Keith Simpson (b. 1949)"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Mid Norfolk || Keith Simpson || Conservative || Keith Simpson || Conservative"]}, {"page": "Mid Norfolk (UK Parliament constituency)", "response": ["The Boundary Commission's Fifth Periodic Review of Westminster constituencies for the 2010 general election created a new constituency, Broadland, based on the local government district of the same name, which was formed from the majority of the Mid Norfolk seat, together with parts of North Norfolk. The Mid Norfolk seat was retained with substantially altered boundaries, gaining parts of South Norfolk and South West Norfolk in compensation (see below). The former MP for Mid Norfolk, Keith Simpson, was selected to contest the newly created Broadland constituency.", "| Keith Simpson"]}, {"page": "List of United Kingdom MPs: S", "response": ["*Keith Simpson"]}, {"page": "Broadland (UK Parliament constituency)", "response": ["| Keith Simpson"]}, {"page": "Reepham, Norfolk", "response": ["*Keith Simpson, Conservative MP for Broadland"]}, {"page": "Defence Select Committee", "response": ["| Keith Simpson"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Keith Simpson; MP for Mid Norfolk (1997–2010) and Broadland (2010–2019)"]}, {"page": "List of alumni of King's College London", "response": ["*Keith Simpson – Conservative MP"]}, {"page": "Simpson (name)", "response": ["* Keith Simpson (disambiguation), multiple people", "** Keith Simpson (professor) (1907–1985), British pathologist", "** Keith Simpson (politician) (born 1949), British politician, Conservative MP for Broadland", "** Keith Simpson (American football) (born 1956), American football safety"]}, {"page": "Keith Simpson", "response": ["Keith Simpson may refer to:", "*Keith Simpson (pathologist) (1907–1985), British pathologist", "*Keith Simpson (politician) (born 1949), British politician, Conservative MP for Broadland", "*Keith Simpson (American football) (born 1956), former NFL safety", "*Keith Simpson (footballer) (1907–1964), Australian rules footballer who played with South Melbourne "]}, {"page": "SNUB", "response": ["SNUB have also organised many public meetings with both Broadland District Council and the local residents who will be effected by the proposals. The first public meeting at Holy Trinity Church, Rackheath, on 17 September 2009 and was featured on BBC One's Look East. The meeting focused on the proposals, and was attended by many hundreds of local residents, as well as a number of senior council officials and councillors, including MP Keith Simpson, Broadland District Council leader Simon Woodbridge, Councillor Andrew Proctor, Chief Planner Phil Kirby, and Councillor Ben McGilvary."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Broadland||style=\"background-color: \"| ||Conservative||style=\"background-color: \"| ||Keith Simpson (C)||Seat held by incumbent for the main predecessor seat"]}, {"page": "George Freeman (politician)", "response": ["Freeman was elected in the 2010 general election as MP for Mid Norfolk. The previous incumbent, Keith Simpson, contested the neighbouring Broadland constituency instead."]}, {"page": "Department of War Studies, King's College London", "response": ["*Keith Simpson (postgraduate research 1972), former Conservative Member of Parliament"]}, {"page": "List of United Kingdom MPs by seniority (2010–2015)", "response": ["|125||Keith Simpson||style=\"background-color: \"|C||Broadland||rowspan=6|"]}, {"page": "List of United Kingdom Conservative MPs (2010–2015)", "response": ["* Keith Simpson"]}, {"page": "Boris v. Ken", "response": ["In Total Politics magazine, Keith Simpson wrote 'Basically, this book tells the story of how Boris won and why Ken lost. The authors conclude by considering the impact on national politics of the election of Mayor Boris, not least in what they believe could become a rivalry between Boris and David Cameron', while in Progress magazine Peter Kellner described the book as a 'brisk and highly readable narrative' and noting 'The swing to the Conservatives was significantly less in London than in the local elections elsewhere in England'."]}, {"page": "List of United Kingdom MPs by seniority (2015–2017)", "response": ["|066||The Rt Hon. Keith Simpson||style=\"background-color: \"|C||Broadland||rowspan=58|1 May 1997||29/03/1949||"]}, {"page": "Waffen-SS im Einsatz", "response": ["British military historian Keith Simpson in his book Waffen SS quotes Hausser for writing that, he \"hoped the work would disperse the lies and calumnies which had formed themselves around the Waffen-SS and help to give this courageous formation its place.\" The book had an unmistakable connection to the Nazi origins of the Waffen-SS: the SS runes on the cover art and the SS motto (\"my honor is my loyalty\") embossed on the cloth cover. A foreword from the former Wehrmacht general Heinz Guderian provided an endorsement for the Waffen-SS troops and referred to them as \"the first realization of the European idea\"."]}]}}