{"wiki_id": "http://www.wikidata.org/entity/Q391300", "itemLabel": "Nick Gibb", "itemDescription": "British politician (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Gibb", "wikipedia_page": {"main": "Nicolas John Gibb (born 3 September 1960) is a British politician who served as Minister of State for School Standards from 2010 to 2012 and again from 2015 to 2021. He served at the Department for Education under Conservative Prime Ministers David Cameron, Theresa May and Boris Johnson. A member of the Conservative Party, Gibb has also served as Member of Parliament (MP) for Bognor Regis and Littlehampton since 1997.Nick Gibb was born in Amersham, Buckinghamshire and was educated at the College of St Hild and St Bede at the University of Durham. After unsuccessfully campaigning to become an MP in Stoke-on-Trent Central at the 1992 general election and Rotherham in the 1994 by-election, Gibb was elected to the British House of Commons for Bognor Regis and Littlehampton at the 1997 general election.\nGibb was Shadow Minister for Schools from 2005 to 2010. He was appointed as Minister of State for School Standards by Prime Minister David Cameron, serving from May 2010 and September 2012. After serving as a backbencher for two years, Gibb returned to government as Minister of State for School Reform in July 2014. Gibb was promoted to his previous role as Minister of State for School Standards after the 2015 general election, replacing his initial successor in the Coalition government, David Laws. He retained this position during the premiership of Theresa May. He was retained as Minister of State for School Standards by May's successor, Boris Johnson; Gibb was removed from the role in September 2021.", "link_mentions": [{"page": "Calculator", "response": ["In most countries, students use calculators for schoolwork. There was some initial resistance to the idea out of fear that basic or elementary arithmetic skills would suffer. There remains disagreement about the importance of the ability to perform calculations in the head, with some curricula restricting calculator use until a certain level of proficiency has been obtained, while others concentrate more on teaching estimation methods and problem-solving. Research suggests that inadequate guidance in the use of calculating tools can restrict the kind of mathematical thinking that students engage in. Others have argued that calculator use can even cause core mathematical skills to atrophy, or that such use can prevent understanding of advanced algebraic concepts. In December 2011 the UK's Minister of State for Schools, Nick Gibb, voiced concern that children can become \"too dependent\" on the use of calculators. As a result, the use of calculators is to be included as part of a review of the Curriculum. In the United States, many math educators and boards of education have enthusiastically endorsed the National Council of Teachers of Mathematics (NCTM) standards and actively promoted the use of classroom calculators from kindergarten through high school."]}, {"page": "September 3", "response": ["*1960 – Nick Gibb, English accountant and politician"]}, {"page": "Phonics", "response": ["Prior to that, synthetic phonics was promoted by a cross-party group of Parliamentarians, particularly Nick Gibb MP. A report by the House of Commons Education and Skills Committee called for a review of the phonics content in the National Curriculum. Subsequently, the Department for Education and Skills announced a review into early years reading, headed by Sir Jim Rose, former Director of Inspection for Ofsted (responsible for the education standards in the UK). The review, entitled Independent review of the teaching of early reading (Rose Report 2006), addresses the question of why children's reading and writing (especially for boys) have not been meeting expectations. Paragraph 3.25 of the Final Report states \"This suggests that it is far more often the nature of the teaching than the nature of the child which determines success or failure in learning the 'basic' skills of reading and writing.” It goes on to say it is not suggesting teachers are unable or unwilling to develop the required expertise, only that there has been systematic confusion and conflicting views about phonics. It also makes it clear that, when it comes to the wider knowledge and skills required for reading and writing, phonics work is \"necessary but not sufficient\". It concludes by suggesting the challenge will be resolved as research continues to support systematic phonics, and that teacher training and systematic phonics programs will produce \"good results for children\".", "The 2016 Progress in International Reading Literacy Study (PIRLS) awarded England its best results since the studies began in 2001. Nick Gibb attributes this success to the use of systematic synthetic phonics. In March of that year the Secretary of State for Education released a report entitled Educational Excellence Everywhere. The report states that in 2010 33% percent of primary school students did not achieve the expected standard in reading, however \"since the introduction of the phonics reading check in 2012\", that number is down to 20%. The report goes on to say they still have much to do, particularly with students who are disadvantaged. The phonics check involves pupils reading aloud 40 words (including 20 non-words). In 2016, 81 per cent of pupils reached the expected standard of 32 correct words – up from 77 per cent in 2015."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Nick Gibb", "| Nick Gibb"]}, {"page": "West Sussex", "response": ["|Nick Gibb"]}, {"page": "Littlehampton", "response": ["Littlehampton lies within the parliamentary constituency of Bognor Regis and Littlehampton, the Member of Parliament (MP) for which is Conservative Nick Gibb."]}, {"page": "Bognor Regis", "response": ["Bognor Regis lies within the constituency of Bognor Regis and Littlehampton, the MP for which is Nick Gibb (Conservative)."]}, {"page": "List of current members of the British Privy Council", "response": ["| Nick Gibb"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Nick Gibb"]}, {"page": "Minister for Women and Equalities", "response": ["| |Nick Gibb (Minister for Equalities)Anne Milton (Minister for Women)"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Nick Gibb (b. 1960)"]}, {"page": "College of St Hild and St Bede, Durham", "response": ["File:Nick Gibb Minister.jpg|Nick Gibb, Conservative MP for Bognor Regis and Littlehampton", "* Nick Gibb, the Conservative Member of Parliament for Bognor Regis and Littlehampton. Gibb also holds the post of Minister of State for Schools in the Department for Education coalition government (2010–2012, 2014-present). (1978–1981)"]}, {"page": "Nick", "response": ["*Nick Gibb (born 1960), British Conservative politician"]}, {"page": "Nick Boles", "response": ["He was elected as member for Grantham and Stamford in May 2010 with a majority of 14,826.Grantham and Stamford, BBC News Election 2010 He was appointed as Parliamentary Private Secretary to the Schools Minister, Nick Gibb in 2010."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Bognor Regis and Littlehampton || Nick Gibb || Conservative || Nick Gibb || Conservative"]}, {"page": "Bognor Regis and Littlehampton (UK Parliament constituency)", "response": ["Bognor Regis and Littlehampton (Contemp. RP) /ˈbɒɡnə ɹʷiːd͡ʒɪs ænd lɪtl̩hæmptn̩/, /-æmtn̩/ is a constituency represented in the House of Commons of the UK Parliament since 1997 by Nick Gibb, a Conservative.", "The vote share and majority for the Conservative MP, Nick Gibb, who won the first six general elections in this seat, has grown since 2001, to reach over 22,000 votes.", "In June 2016, an estimated 64.8% of local adults voting in the EU membership referendum voted to Leave the European Union. This was matched in two January 2018 votes in Parliament by MP Nick Gibb.https://www.theyworkforyou.com/divisions/pw-2018-01-17-104-commons/mp/10241", "Since its creation, the seat has been represented by Nick Gibb of the Conservative Party. Gibb had worked for the party for over ten years, and became an MP at his third attempt. After thirteen years in opposition, he joined David Cameron's coalition government after the 2010 general election, becoming Minister of State for School Standards, working under Education Secretary Michael Gove. He left the government in a 2012 reshuffle, being replaced by David Laws. He then returned to the same department, now run by Nicky Morgan, as Parliamentary Under-Secretary of State for Childcare, Education and School Reform in 2014. The following year, he again took up his previous post, which he has now held under three Prime Ministers (Cameron, Theresa May and Boris Johnson) and five Education Secretaries (Gove, Morgan, Justine Greening, Damian Hinds and Gavin Williamson).", "| Nick Gibb"]}, {"page": "Stephen Hammond", "response": ["In Parliament, Hammond has been an advocate of giving summer-born and premature children the right to start school a year later, to give them extra time for development. In October 2015 he held an adjournment debate on this issue, arguing that \"summer-born children can suffer from long-term development issues and a lag in educational standards\". and highlighting the inconsistent treatment of these children by Councils. In response, Nick Gibb MP, the Minister of State for Schools, set out plans in a letter to all schools to change the school admissions code to allow summer-born children to start reception class at the age of 5."]}, {"page": "List of Parliamentary constituencies in West Sussex", "response": ["|Nick Gibb †"]}, {"page": "Maidstone Grammar School", "response": ["* Nick Gibb (briefly), Conservative Schools Minister 2010-current, and MP for Bognor Regis and Littlehampton since 1997"]}, {"page": "List of United Kingdom MPs: G", "response": ["*Nick Gibb"]}]}}