{"wiki_id": "http://www.wikidata.org/entity/Q391792", "itemLabel": "Helen Grant", "itemDescription": "British politician (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Grant_(politician)", "wikipedia_page": {"main": "Helen Grant (née Okuboye, 28 September 1961) is a British politician who has served as the Member of Parliament (MP) for Maidstone and The Weald since 2010. A member of the Conservative Party, she succeeded Ann Widdecombe, who was first elected in 1997.\nGrant was the first black woman of mixed heritage to be elected as a Conservative MP and selected as a candidate to stand for a Conservative-held parliamentary seat. She first served in government as jointly Parliamentary Under-Secretary of State for Women and Equalities (2012–2015) and Parliamentary Under-Secretary of State for Justice (2012–2013). She also became Minister for Sport and Tourism in 2013, a post she held until after the 2015 general election.\nIn January 2021, she was appointed as Special Envoy of UK Prime Minister Boris Johnson on Girls' Education.", "link_mentions": [{"page": "September 28", "response": ["*1961 – Helen Grant, English lawyer and politician, Minister for Sport and the Olympics"]}, {"page": "Maidstone", "response": ["The town is divided between the constituencies of Maidstone and the Weald and Faversham and Mid Kent. Before 1997 Maidstone was in the county constituency of Maidstone. The Member of Parliament (MP) for Maidstone and the Weald is Conservative Helen Grant. Previous MPs include Ann Widdecombe, Sir John Wells, Sir Alfred Bossom and Benjamin Disraeli. Since 2015 the MP for Faversham and Mid Kent has been Conservative Helen Whately. Prior to the 2015 election, the MP was Conservative Sir Hugh Robertson."]}, {"page": "Minister for Women and Equalities", "response": ["| Jo Swinson (LD) Helen Grant (Cons)", "| rowspan=2|Jo Swinson (LD)  Helen Grant (Cons)", "| Jo Swinson (LD)  Helen Grant (Cons)"]}, {"page": "Dalit", "response": ["More recent studies in Britain were inconclusive and found that discrimination was \"not religion specific and is subscribed to by members of any or no religion\". Equalities Minister Helen Grant found insufficient evidence to justify specific legislation, while Shadow Equalities minister Kate Green said that the impact is on a relatively small number of people. Religious studies professor Gavin Flood of the Oxford Centre for Hindu Studies concluded that the Hindu community in Britain is particularly well integrated, loosening caste ties. Casteist beliefs were prevalent mainly among first generation immigrants, with such prejudices declining with each successive generation due to greater assimilation."]}, {"page": "Minister for Sport and Civil Society", "response": ["| width=200|Helen Grant"]}, {"page": "Maidstone and The Weald (UK Parliament constituency)", "response": ["Maidstone and The Weald is a constituency in Kent represented in the House of Commons of the UK Parliament since 2010 by Helen Grant of the Conservative Party. She succeeded fellow party member Ann Widdecombe, who had held the seat since it was created for the 1997 general election.", "The Member of Parliament (MP) for the seat from its creation in 1997 was Ann Widdecombe of the Conservative Party. Widdecombe was the MP for the former seat of Maidstone (1987–1997); she served as a Home Office Minister of State in the government of John Major from 1995 to 1997 and later as Shadow Home Secretary from 1999 to 2001. She stood down at the 2010 general election and was succeeded by Helen Grant, also a member of the Conservative Party.", "| Helen Grant"]}, {"page": "2010 United Kingdom general election", "response": ["The election resulted in an increase in the number of MPs from ethnic minorities from 14 to 27, including the first black and Asian female Conservative MPs, Helen Grant and Priti Patel, and the first female Muslim MPs, Rushanara Ali, Shabana Mahmood and Yasmin Qureshi. This means that 4.2% of MPs are from an ethnic minority—in the 2001 Census, it was reported that ethnic minorities comprised 7.9% of the population. The number of female MPs rose to 141, an increase from 19.5% to 21.7% of all MPs, and the highest ever total; the number of female Conservative MPs rose from 18 (8.6% of all Conservatives) to 48 (15.7%)."]}, {"page": "List of Parliamentary constituencies in Kent", "response": ["|Helen Grant †"]}, {"page": "Black conservatism", "response": ["Most, although not all, black Conservatives in the United Kingdom are of African origin, with either one or both parents originating from Africa and emigrating to the UK, rather than from the Caribbean or elsewhere. When the Conservative made efforts to recruit parliamentary candidates given the almost total absence of black members, they found almost all sympathetic blacks were of African heritage. Several were 'parachuted' into safe seats during the Cameron leadership era, despite some opposition from local members. In 2019, the Conservatives changed tactics to focus on promoting candidates based on talent rather than race to avoid accusations of tokenism. Black British Conservative MPs currently serving in the House of Commons are Adam Afriyie, Kwasi Kwarteng, James Cleverly, Kemi Badenoch, Darren Henry, Bim Afolami and solicitor and businesswoman Helen Grant. In the 2019 United Kingdom general election, the Conservatives fielded a record number of 76 black and ethnic minority candidates, a 72% increase on the 2017 election."]}]}}