{"wiki_id": "http://www.wikidata.org/entity/Q3918939", "itemLabel": "Kirsty Young", "itemDescription": "Scottish television radio presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Kirsty_Young", "wikipedia_page": {"main": "Kirsty Jackson Young (born 23 November 1968) is a Scottish television and radio presenter.\nFrom 2006 to 2018 she was the main presenter of BBC Radio 4's Desert Island Discs and previously presented Crimewatch on BBC One from 2008 to 2015.\n\n", "link_mentions": [{"page": "List of Scots", "response": ["* Kirsty Young (born 1968)"]}, {"page": "November 23", "response": ["*  1968   – Kirsty Young, Scottish journalist"]}, {"page": "Robert Fisk", "response": ["He was interviewed by Kirsty Young for Desert Island Discs in 2006. His final selections were Adagio for Strings by Samuel Barber, Le Morte d'Arthur by Thomas Malory, and a violin."]}, {"page": "Stirling", "response": ["* Kirsty Young – television presenter"]}, {"page": "Jane Horrocks", "response": ["On Tuesday 14 January 2014, Horrocks appeared as a contestant on The Great Sport Relief Bake Off on BBC Two— the celebrity version of The Great British Bake Off—hosted by Jo Brand and broadcast to help raise money for the charity Sport Relief. The other contestants were TV and radio presenter Kirsty Young, choreographer Jason Gardiner, and Olympic athlete Greg Rutherford."]}, {"page": "Cobham, Surrey", "response": ["*Nick Jones, (born 1963), entrepreneur, owner of Babington House and husband of Kirsty Young, grew up in Cobham."]}, {"page": "Desert Island Discs", "response": ["After Plomley's death in 1985, the programme was presented first by Michael Parkinson, then from 1988 to 2006 by Sue Lawley and from 2006 to 2018 by Kirsty Young. Young was replaced by 6 Music presenter Lauren Laverne, who interviewed Olympic diver Tom Daley for her first show, broadcast on 30 September 2018. Laverne was initially only drafted in as an interim presenter, while Young took time off due to complications of fibromyalgia, but following her decision not to return in July 2019, it was announced that Laverne would continue for \"the foreseeable future\".", "* Desert Island Discs: 70 Years of Castaways (2012, by Sean Magee, foreword by Kirsty Young) "]}, {"page": "Channel 4 News", "response": ["*Kirsty Young (2000–2002)"]}, {"page": "Felix Dennis", "response": ["In 2003, Dennis was interviewed by Melvyn Bragg on the South Bank Show, and was the subject of CBS's 60 Minutes in the US. He had appeared as the guest on BBC Radio 4's Desert Island Discs, hosted by Kirsty Young, first broadcast on 12 August 2007."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young", "|Kirsty Young"]}, {"page": "Arnold Wesker", "response": ["*\"Arnold's Choice\". Interview with Arnold Wesker, by Kirsty Young. Desert Island Discs. Broadcast on BBC Radio 4, 17 December 2006; repeated 22 December 2006."]}, {"page": "Fiona Bruce", "response": ["After the murder of Jill Dando, Bruce took over the position of co-presenter on Crimewatch alongside Nick Ross, until both were replaced by Kirsty Young towards the end of 2007. In 2001, Bruce became one of the presenters of the BBC general election results programme."]}, {"page": "Brian Rix", "response": ["Rix became a radio ham at the age of 13 and became a life vice-president of the Radio Society of Great Britain in 1979. His call sign was G2DQU. He was also president of the Friends of Richmond Park. In 1970 he was President of the Lord's Taverners and he continued his love of cricket as a member of the MCC and Yorkshire CCC. Rix was the subject of This Is Your Life on two occasions, in October 1961 when he was surprised by Eamonn Andrews at a friend's house in Surrey, and again in April 1977, when Andrews surprised him at Her Majesty's Theatre in London. He was also a castaway on Desert Island Discs on two occasions. The first was with Roy Plomley on 16 May 1960, which was also the first time a castaway was caught on film and broadcast the following evening. His second appearance was with Kirsty Young on 1 March 2009."]}, {"page": "Kenny Logan", "response": ["Logan dated newsreader Kirsty Young and moved to London, before the couple separated in 1999 after three years. In July 2001 he married television presenter Gabby Yorath. The couple live in Kew, South West London. After undergoing IVF treatment they had twins, who were born on 28 July 2005."]}, {"page": "Radio Academy Awards", "response": ["The 17th Sony Radio Academy Awards ceremony was held at the Grosvenor House Hotel in London on 28 April 1999 and was hosted by Kirsty Young and Paul Gambaccini."]}, {"page": "Bradley Wiggins", "response": ["On 10 May 2015, Wiggins was interviewed by Kirsty Young as guest castaway on BBC Radio 4's Desert Island Discs; his favourite musical piece was \"Sound and Vision\" by David Bowie, his book choice was Slaying the Dragon: How to Turn Your Small Steps to Great Feats by Michael Johnson and his luxury item was a family photo album."]}, {"page": "Marian Keyes", "response": ["In March 2017, Keyes was a guest castaway for BBC Radio 4's Desert Island Discs. Her favourite track was \"You Have Been Loved\" by George Michael. She revealed that she had battled constant suicidal urges at the height of her mental illness. During her appearance on the show, Keyes also told host Kirsty Young that in spite of all her efforts to treat her depression, ranging from CBT, medication, mindfulness, hospitalisation, diets, among other things, what finally healed her was time: \"It was an illness and it ran its course.\""]}, {"page": "Lauren Laverne", "response": ["In September 2018, Lauren took over as host to Radio 4's Desert Island Discs when Kirsty Young took time off because of fibromyalgia illness treatment."]}, {"page": "BBC Radio Scotland", "response": ["*Kirsty Young"]}, {"page": "Brian Moore (rugby union)", "response": ["Moore was the guest on BBC Radio 4's Desert Island Discs on 24 February 2012 where he was interviewed at length by Kirsty Young. His music choices were Wolfgang Amadeus Mozart — Queen of the Night aria; Ian Dury and The Blockheads — \"Hit Me with Your Rhythm Stick\"; Genesis — \"In the Cage\"; Samuel Barber — Adagio for Strings; Pink Floyd — \"Us and Them\"; The Stranglers — \"Always the Sun\"; Green Day — \"Jesus of Suburbia\"; Pietro Mascagni — The Intermezzo from Cavalleria Rusticana. His choice of book was Germinal by Émile Zola and his luxury choice was a spherical football."]}, {"page": "Sophie Raworth", "response": ["In February 2016, Raworth replaced Kirsty Young as main anchor of Crimewatch. She previously guest presented the programme in 2012."]}, {"page": "Roy Plomley", "response": ["Plomley was succeeded as presenter by Michael Parkinson (1985–1988), then by Sue Lawley (1988–2006), Kirsty Young (2006—2018) and most recently by Lauren Laverne. Desert Island Discs is the second longest-running radio programme in the world (after the Grand Ole Opry), and it is still running."]}, {"page": "ITV News at Ten", "response": ["*Kirsty Young (2000–2002)"]}, {"page": "ITV Evening News", "response": ["ITV. ITN's Early Evening News programme was moved from 5:40pm to 6:30pm and renamed the ITV Evening News. The programme was extended to become a 30-minute programme, effectively replacing News at Ten as the channel's flagship news programme which itself was also axed at this time and replaced with a shorter 20 minute bulletin at 11:00pm entitled the ITV Nightly News. Initially, the programme was fronted by Trevor McDonald, with Murnaghan and Kirsty Young the most regular relief presenters.", "*Kirsty Young (2000–2002)"]}, {"page": "ITV Lunchtime News", "response": ["*Kirsty Young (2000–2002)"]}, {"page": "Ian McMillan (poet)", "response": ["In November 2010, McMillan was the castaway on the BBC Radio 4 show Desert Island Discs hosted by Kirsty Young. His choice of music included John Cage's silent piece \"4′33″\" and Andy Stewart singing \"Donald Where's Your Troosers?\"."]}, {"page": "Madame George", "response": ["Madame George appears in the \"Black Boys on Mopeds\" lyrics of Sinéad O'Connor: \"England's not the mythical land of Madame George and roses\" suggesting that she is a legendary figure.  David Gray pays tribute to the song on the final track of his album White Ladder, with his cover version of the Soft Cell song, \"Say Hello, Wave Goodbye\", which ends similarly and even borrows lyrics \"Through the rain, hail, sleet and snow, say goodbye. Get on the train, the train and say goodbye\". In David A. Stewart and the Spiritual Cowboy's song \"Out of Reach\", from the album Honest, there is a line that goes: \"Madame George got played today, she almost forgot she could feel that way\".  Although not a direct imitation, the riff that the string quartet repeats at the end of the song is mimicked at the end of Bruce Springsteen's \"Born to Run\" (one of several indicators that Morrison had great influence on Springsteen), confirmed by Springsteen himself on Desert Island Discs talking to Kirsty Young. The American rock band Hat On, Drinking Wine takes their name from a lyric from the song: \"He's much older now/With hat on, drinking wine.\""]}, {"page": "Tonight (1999 TV programme)", "response": ["* Kirsty Young"]}, {"page": "Debbie Wiseman", "response": ["In 2011 Wiseman presented a Radio 4 programme on the composer, Joseph Horowitz, and appeared on the panel of Your Desert Island Discs at Christmas with Bill Bailey and Jo Whiley, presented by Kirsty Young."]}, {"page": "Nick Ross", "response": ["In late 2007, Ross left Crimewatch, soon followed by his co-presenter Fiona Bruce. The replacement presenter, Kirsty Young, was 21 years younger than Ross and the BBC were accused of ageism over these changes. His 23 years as the main Crimewatch anchor marks him as one of the longest-serving presenters of a continuous series in TV history."]}, {"page": "Matthew Amroliwala", "response": ["Matthew Amroliwala (born 1962) is a British television newsreader, who presents Global with Matthew Amroliwala on BBC World News each weekday at 1500 hrs GMT. He has also been an occasional relief presenter of the BBC News at One  on BBC One. He also presented Crimewatch alongside Kirsty Young from January 2008 until March 2015.", "He has covered many major news stories, including reporting extensively from Northern Ireland. He has also reported from Bosnia on the fall of Srebrenica and travelled throughout the Balkans during the conflict in Bosnia. Since January 2008, he has co-presented the programme Crimewatch with Kirsty Young and Rav Wilding (later Martin Bayfield), specialising in the solved cases, but missed  the March 2015 episode, and was covered by Jason Mohammad."]}, {"page": "Centrepoint (charity)", "response": ["Its ambassadors include the Radio 1 DJ Sara Cox, the fashion model Lady Kitty Spencer, the actress Lisa Maxwell, and the journalist and presenter Kirsty Young."]}, {"page": "BBC News at Six", "response": ["On 5 October 2007 it was announced that Natasha Kaplinsky was leaving the BBC to replace Kirsty Young on 5 News, taking up her new role on 18 February 2008 presenting two half-hour evening bulletins. She left at the end of the Six O'Clock News on the same day."]}, {"page": "Alexandra Shulman", "response": ["Shulman was interviewed by Kirsty Young on Desert Island Discs on BBC Radio 4 in June 2013. In 2016, Shulman collaborated with photographer Josh Olins to shoot Catherine, Duchess of Cambridge on the cover of Vogue's centenary issue."]}, {"page": "The Day Britain Stopped", "response": ["Tim Pigott-Smith provided the narration. Katie Derham, Charlotte Green, Philip Hayton, John Humphrys, Gary Lineker, Anna Rajan, Jon Snow and Kirsty Young appeared as themselves."]}, {"page": "Stirling High School", "response": ["The school now operates from a new building on the former site of Williamfield Cricket Pitches, ex-home to Stirling County Cricket Club. Stirling High School had an official opening ceremony on 26 June 2008, which consisted of a ribbon cutting by former pupil Kirsty Young.", "* Kirsty Young - television journalist"]}, {"page": "Scotland Today", "response": ["In January 1993, Scottish Television launched a thirty-minute lunchtime edition of Scotland Today, presented by Angus Simpson and Kirsty Young. It was axed in the Autumn of 2004 although some elements of the lunchtime news were revived with the launch of The Five Thirty Show in January 2008.", "* Kirsty Young (1992–1995)"]}, {"page": "Inchconnachan", "response": ["Kirsty Young (who presented BBC Radio 4 Desert Island Discs for 12 years) and her husband Nick Jones have bought the island."]}, {"page": "ITV Weekend News", "response": ["*Kirsty Young (2000–2001)"]}, {"page": "Matt Barbet", "response": ["In September 2007, Matt Barbet was named as a presenter and correspondent for 5 News on Channel 5. His position came after Kirsty Young, the principal anchor, announced her departure from the programme. He took up his new role in November 2007. In June 2008, Matt Barbet and Isla Traquair, were announced as stand-in presenters on 5 News while Natasha Kaplinsky was on maternity leave. Matt visited Haiti in January 2010 after the earthquake and has also been embedded with the British Army in Afghanistan. In February 2011, he was announced as the new presenter of the flagship 17:00 programme, after Kaplinsky left the station. He left on 26 July 2012.Matt Barbet Signs Off 5 News, Heads to Daybreak TV Newsroom, 26 July 20125 News – Matt Barbet's Final Sign Off TheSbm2010, YouTube, 26 July 2012"]}, {"page": "Tom Blundell", "response": ["Blundell's contributions were recognised by a knighthood in 1997.  He has been awarded Honorary Doctorate degrees from 16 universities and was interviewed by Kirsty Young on the BBC Radio 4 programme Desert Island Discs in 2007."]}]}}