{"wiki_id": "http://www.wikidata.org/entity/Q392174", "itemLabel": "Ben Gummer", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Gummer", "wikipedia_page": {"main": "Benedict Michael Gummer (born 19 February 1978) is a British businessman and former politician. He is a partner of Gummer Leathes, a master developer. He is a senior adviser to McKinsey & Company, the management consultancy, a visiting fellow at the Blavatnik School of Government at Oxford University and a member of the advisory board of the Office for Place.Gummer served as the Member of Parliament (MP) for Ipswich from 2010 to 2017. A member of the Conservative Party, he became Minister for the Cabinet Office and Paymaster General in the First May ministry in 2016, entering the cabinet as its youngest member. He lost his seat in the House of Commons in the 2017 general election.", "link_mentions": [{"page": "February 19", "response": ["*1978 – Ben Gummer, English scholar and politician"]}, {"page": "Paymaster General", "response": ["|Ben Gummer"]}, {"page": "John Gummer", "response": ["Lord Deben has been married to Penelope Gardner since 1977, and lives at Winston Grange, a Grade II listed property in Suffolk. They have four children, including Ben Gummer, who was MP for Ipswich from 2010, until he lost his seat in 2017."]}, {"page": "List of current members of the British Privy Council", "response": ["| Ben Gummer"]}, {"page": "Chris Mole", "response": ["Christopher David Mole (born 16 March 1958) is a British Labour Party politician, who was the Member of Parliament for Ipswich from a by-election in 2001, after the death of Jamie Cann, and was re-elected in 2005. He was Parliamentary Under Secretary of State at the Department for Transport, until his defeat in the 2010 general election by Ben Gummer of the Conservative Party."]}, {"page": "List of political families in the United Kingdom", "response": ["**Ben Gummer, Conservative Member of Parliament; son of John"]}]}}