{"wiki_id": "http://www.wikidata.org/entity/Q3934784", "itemLabel": "Richard Cleasby", "itemDescription": "English philologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Cleasby", "wikipedia_page": {"main": "Richard Cleasby (1797–1847) was an English philologist, author with Guðbrandur Vigfússon of the first Icelandic-English dictionary.", "link_mentions": [{"page": "Ægir", "response": ["The Old Norse name Ægir ('sea') may stem from Proto-Germanic *āgwi-jaz ('that of the river/water'), itself a derivative of the root *ahwō- ('river'; cf. Gothic alva 'body of water, river', Old English ēa 'stream', Old High German aha 'river'). Richard Cleasby and Guðbrandur Vigfússon saw his name as deriving from an ancient Indo-European root.Cleasby, Vigfússon (1957:758). Linguist Guus Kroonen argues that the Germanic root *ahwō- is probably of Proto-Indo-European (PIE) origin, as it may be cognate with Latin aqua (via the common form *h₂ekʷ-eh₂-), and ultimately descend from the common PIE root *h₂ep- ('water'; cf. Sanskrit áp- 'water' or Tocharian āp- 'water, river')."]}, {"page": "Haggis", "response": ["Clarissa Dickson Wright says that it \"came to Scotland in a longship [i.e., from Scandinavia] even before Scotland was a single nation\". She cites etymologist Walter William Skeat as further suggestion of possible Scandinavian origins: Skeat claimed that the hag– element of the word is derived from the Old Norse haggw or the Old Icelandic hoggva The Concise Oxford Dictionary of English Etymology, 1996. Retrieved on 29 June 2009 (höggva meaning 'to chop' in modern IcelandicAn Icelandic-English Dictionary, Page 309, Richard Cleasby, Guðbrandur Vigfússon, George Webbe Dasent – 1874), Modern Scots hag, meaning 'to hew' or strike with a sharp weapon, relating to the chopped-up contents of the dish."]}, {"page": "Wilhelm Grimm", "response": ["In 1825, 39-year-old Wilhelm married pharmacist's daughter Henriette Dorothea Wild, also known as Dortchen. Wilhelm's marriage did not change the harmony of the brothers. Richard Cleasby visited the brothers and observed, \"they both live in the same house, and in such harmony and community that one might almost imagine the children were common property.\"\"Life of Cleasby,\" prefixed to his Icelandic Dictionary, p. lxix."]}, {"page": "Gothi", "response": ["The most reliable sources about the goðar in Iceland are the Gray Goose Laws, the Landnámabók and the Sturlunga saga. After the settlement of Iceland, a hofgoði was usually a wealthy and respected man in his district, for he had to maintain the communal hall or hof in which community religious observances and feasts were held. The office over which a goði had leadership was termed a goðorð, a word that only appears in Icelandic sources. Initially many independent goðorð were established, until they united under the Althing around 930. In 964 the system was fixed under a constitution that recognized 39 goðorð. The role of the goðar as secular leaders is shown in how the word was used synonymously with höfðingi, meaning chieftain. Over time, and especially after 1000, when the Christian conversion occurred in Iceland, the term lost all religious connotations and came to mean liege-lord or chieftain of the Icelandic Commonwealth.An Icelandic-English dictionary by Richard Cleasby and Gudbrand Vigfusson (1874) p. 208. A goðorð could be bought, shared, traded or inherited. If a woman inherited a goðorð she had to leave the leadership to a man. The office was in many respects treated as private property but was not counted as taxable, and is defined in the Gray Goose Laws as \"power and not wealth\" (veldi er þat en æigi fe); nevertheless the goðar are frequently portrayed in the sagas as concerned with money and expected to be paid for their services."]}, {"page": "Guðbrandur Vigfússon", "response": ["* An Icelandic-English Dictionary by Richard Cleasby and Gudbrand Vigfusson, published in 1874."]}, {"page": "Dáinn, Dvalinn, Duneyrr and Duraþrór", "response": ["The word barr has been the cause of some confusion since it is most often applied to the needles of fir or pine trees. Richard Cleasby and Guðbrandur Vigfússon surmised that Snorri had used the word wrongly due to Icelandic unfamiliarity with trees. Others have drawn the conclusion that the World Tree was in fact a conifer. More recent opinion is that barr means foliage in general and that the conifer assumption is not warranted.\"Together, bíta barr means to eat the foliage off a tree, words suitable for both an ash tree and a pine\", ."]}, {"page": "Anthony Cleasby", "response": ["Cleasby was the third son of Stephen Cleasby, a Russia broker, who carried on a prosperous business at 11 Union Court, Broad Street, in the city of London, and died at Craig House, Westmoreland, 31 August 1844; having married, 4 February 1797, at Stoke Newington, Mary, second daughter of George John of Penzance. His brother was the philologist Richard Cleasby."]}, {"page": "Icelandic language", "response": ["* Old Icelandic-English Dictionary by Richard Cleasby and Gudbrand Vigfusson"]}, {"page": "Cleasby (surname)", "response": ["*Richard Cleasby (1779–1847), English philologist"]}, {"page": "Cleasby, Richard", "response": ["#REDIRECT Richard Cleasby"]}, {"page": "Heathen hof", "response": ["Etymologically, the Old Norse word hof is the same as the Afrikaans, Dutch and German word hof, which originally meant a hall and later came to refer to a court (originally in the meaning of a royal or aristocratic court) and then also to a farm. In medieval Scandinavian sources, it occurs once as a hall, in the Eddic poem Hymiskviða, and beginning in the fourteenth century, in the \"court\" meaning. Otherwise, it occurs only as a word for a temple.\"Hof\", Richard Cleasby and Guðbrandur Vigfússon, An Icelandic-English Dictionary, 2nd ed. with supplement by William A. Craigie, Oxford: Clarendon-Oxford University, 1957, repr. 1975, , pp. 277–78. Hof also occasionally occurs with the meaning \"temple\" in Old High German.Jacob Grimm tr. James Steven Stallybrass, Teutonic Mythology, London: Bell, 1883, repr. New York: Dover, 1966, 2004, , p. 1308. In Scandinavia during the Viking Age, it appears to have displaced older terms for a sacred place, vé, hörgr, lundr, vangr, and vin, particularly in the West Norse linguistic area, namely Norway and Iceland. It is the dominant word for a temple in the Icelandic sagas, but is rare in skaldic poetry.E.O.G. Turville-Petre, Myth and Religion of the North: The Religion of Ancient Scandinavia, London: Weidenfeld, 1964, , pp. 237, 243, 240."]}]}}