{"wiki_id": "http://www.wikidata.org/entity/Q3940999", "itemLabel": "Ron Ashman", "itemDescription": "English footballer and manager (1926-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ron_Ashman", "wikipedia_page": {"main": "Ronald George Ashman (19 May 1926 – 21 June 2004) was an English professional footballer and football manager. Born in Whittlesey, Cambridgeshire, he spent his entire playing career with Norwich City and was later their manager. He went on to manage Scunthorpe United and Grimsby Town.", "link_mentions": [{"page": "Norwich City F.C.", "response": ["In the 1959–60 season, Norwich were promoted to the Second Division after finishing second to Southampton, and achieved a fourth-place finish in the 1960–61 season. In 1962 Ron Ashman guided Norwich to their first trophy, defeating Rochdale 4–0 on aggregate in a two-legged final to win the League Cup.", "| style=\"text-align:left;\"|Ron Ashman"]}, {"page": "Kevin Keegan", "response": ["At the age of 15 Keegan started work at Pegler Brass Works as an office clerk; though he has stated that he was more of a tea boy and messenger than an office clerk. Whilst working at Pegler, Keegan continued playing Saturday afternoon football for his local youth club, Enfield House, and playing Sunday morning football for the Lonsdale Hotel. It was during this time that a colleague, named Harry Holland, invited him to play for the Peglers Works reserves on a Saturday morning. His chance at professional football came when he was playing Sunday morning league football for the Lonsdale Hotel in a match against Woodfield Social in 1966. Keegan was marked by a player in his mid 30s, called Bob Nellis. After playing against Keegan, Nellis became impressed by the ability of Keegan and offered him a trial at fourth division Scunthorpe United – one of just two professional sides in the division. This trial would lead to the Scunthorpe manager Ron Ashman giving Keegan his first contract in professional football.", "Scunthorpe, a club with little money, did not have a full-time driver to drive them to away games and Keegan, with other the other younger players, such as Nigel Jackson, would take turns in driving the minibus to and from away games. Young Keegan, fellow driver Nigel Jackson and fellow young professionals Jimmy Coyne, Alan Olbison and Steve Hibbotson, once borrowed coach Jack Brownsword's stop watch and had timed rallies around the Old Showground with the club's vintage tractor. On Keegan's turn the tractor crashed and the tractor's axle went through the engine. The crash was very expensive to fix and the five were given a rollicking by manager Ron Ashman. This experience gave Keegan awareness of his responsibility as a representative of Scunthorpe United. Keegan made his debut against Peterborough United at the age of 17, making 29 league starts in his first season. He became a regular in the first team by the 1969–70 season, playing all 46 league games for the club. This season saw the team reach the fifth-round of the FA Cup, beating Football League First Division side Sheffield Wednesday along the way. Keegan then missed only one game in his last season. Earning a pittance, meant Keegan each summer had to find summer jobs; and each summer he would do jobs such as plate-laying at the Appleby Frodingham Steelworks.", "In 1971, he attracted the attention of Liverpool's head scout Geoff Twentyman, whose opinion was held in high regard by manager Bill Shankly. After Twentyman's recommendation, Liverpool made an offer for Keegan and this offer was accepted by Scunthorpe United. After Scunthorpe had agreed to the fee Keegan was driven the four hours to Bill Shankly's office by manager Ron Ashman who was determined to get a cash influx for Scunthorpe United. Prior to the journey Keegan's father prompted Keegan to not sell himself cheap. Keegan then haggled a contract worth £50 a week from Shankly, after Shankly had originally offered him £45. Ashman, sensing a cash windfall may fall through, was at one stage aghast at Keegan's negotiation game. On the drive back to Scunthorpe Ashman was critical of Keegan's bluff that he was almost earning £45 a week at a fourth division football club."]}, {"page": "Grimsby Town F.C.", "response": ["|  Ron Ashman"]}, {"page": "Scunthorpe United F.C.", "response": ["After relegation from Division Two, the Iron spent the next four years bouncing around in the Third Division. Freddie Goodwin left the club during the 1967–68 season, however his replacement Ron Ashman was unable to save the club from relegation to Division Four at the end of the season. A slight resurgence occurred in the very early 70s, with the Iron first defeating top-flight Sheffield Wednesday in the FA Cup during January 1970, and then gaining promotion back to the Third Division in 1972. It was during this short period that a young Kevin Keegan was discovered and developed by Ashman before being sold to Liverpool in 1971 for £35,000, having racked up 124 appearances and 18 goals for Scunthorpe.", "The Iron were unable to cement a place in the Third Division, and relegation back to the Fourth Division followed immediately in 1973. At the same time, Ron Ashman departed to manage local rivals Grimsby Town, only to return during 1976. The period between his two tenures saw several management changes and a disastrous league campaign which saw the Iron finish rock bottom of the Football League in 1975. In 1980 none other than Ian Botham was signed as a player for Scunthorpe by Ron Ashman. Botham played for the club until 1984 making fourteen appearances. He was also a regular in the Central League for Scunthorpe United Reserves, once scoring a hat-trick against Blackpool at the Old Show Ground. But the next five years saw United stagnate in the bottom half of Division Four, with the club finishing second-bottom at the end of the 1981–82 campaign. Promotion to Division Three was achieved under the guidance of manager John Duncan in 1983, but immediate relegation was to follow under his successor Allan Clarke in 1984, with United then entering a further period of stagnation in the middle of the Fourth Division table."]}, {"page": "2003–04 in English football", "response": ["*21 June 2004: Ron Ashman, 78, was a full-back for most of his 592 league appearances for Norwich City between 1947 and 1963, during which time they reached the FA Cup semi-finals in 1959 and won the League Cup in 1962. He became manager soon after the club's League Cup triumph and remained in charge until 1966. In the first of two spells as manager of Scunthorpe United, he sold Kevin Keegan to Liverpool."]}]}}