{"wiki_id": "http://www.wikidata.org/entity/Q3940078", "itemLabel": "Roger Freestone", "itemDescription": "Welsh footballer and manager (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Freestone", "wikipedia_page": {"main": "Roger Freestone (born 19 August 1968) is a former Wales international goalkeeper.", "link_mentions": [{"page": "Caerleon", "response": ["* Roger Freestone, Wales international footballer"]}, {"page": "Swansea City A.F.C.", "response": ["The club was promoted in 2000 as Division Three champions, following a championship decider on the final day of the season against second-placed Rotherham United. The side conceded just 32 goals during the 1999–2000 season, largely due to the form of excellent centre-back pairing Jason Smith and Matthew Bound, as well as keeper Roger Freestone. During the season the side set a record of nine consecutive league victories, and, during the same period, seven consecutive clean sheets. Striker Walter Boyd also set an unwanted record of being the fastest substitute ever sent off, when he was red-carded for striking a Darlington player seconds after being brought on and before play had resumed, therefore being officially recorded as zero seconds.", "Wilfred Milne holds the record for Swansea appearances, having played 586 matches between 1920 and 1937, closely followed by Roger Freestone with 563 between 1991 and 2004. The player who has won the most international caps while at the club is Ashley Williams with 50 for Wales."]}, {"page": "Hereford United F.C.", "response": ["*  Roger Freestone"]}, {"page": "Dorus de Vries", "response": ["In the 2009–10 season, De Vries surpassed Roger Freestone's club record of 22 clean sheets in a single season with a shut-out against Scunthorpe United on 5 April 2010. He would go on to finish the season with 25 clean sheets, winning the Football League's Golden Glove award for the Championship in the process."]}, {"page": "Dave Beasant", "response": ["Beasant's spell on Tyneside was brief as the Magpies struggled and were finally relegated from the First Division in bottom place. Beasant had left in January 1989 to join Chelsea. He immediately became first choice keeper, replacing Roger Freestone."]}, {"page": "Caerleon Comprehensive School", "response": ["Historic sportspeople who have attended the school include Wales, Chelsea F.C. and Swansea City goalkeeper Roger Freestone, Cardiff City F.C. and Wales midfielder Nigel Vaughan, Wales rugby winger Nick Walne, and prop Lyndon Mustoe. Others include Gary Hocking, a Grand Prix racing champion, as well as footballer and cricketer Len Hill."]}, {"page": "Neil Cutler", "response": ["He joined Stoke City in July 2001 and was initially going to be back-up to Gavin Ward but took his place in the team from September 2001. Cutler played 43 times in 2001–02 helping the team reach the 2002 Football League Second Division play-off Final where they beat Brentford 2–0 to gain promotion to the First Division. He remained as first-choice going into the 2002–03 season but lost his place once Tony Pulis became manager in November 2002. In March 2003 he joined Swansea City on loan as cover for injured goalkeeper Roger Freestone. He played in the next 13 league games culminating in a superb performance against Hull City on the final day of the season which kept the Swans in the Football League. Cutler was back at Stoke for the 2003–04 season where he was back-up to Ed de Goey and made 16 appearances as the Potters finished in 11th position."]}, {"page": "1968 in Wales", "response": ["*19 August – Roger Freestone, footballer"]}]}}