{"wiki_id": "http://www.wikidata.org/entity/Q3945687", "itemLabel": "Salomon of Cornwall", "itemDescription": "British sovereign", "wikipedia_url": "https://en.wikipedia.org/wiki/Salomon_of_Cornwall", "wikipedia_page": {"main": "Salomon (also known, in Welsh, as Selyf) was a late 5th century Cornish 'warrior prince', possibly a King of Cornwall. His feast day is Oct. 18.St Levan (properly Selevan, a Celtic form of Solomon) according to the Life of St Kybi was a Cornishman and the father of Kybi. In the department of Morbihan are four places probably connected to the same saint, who probably lived in the 6th or 7th century. On the cliff at St Levan is St Levan's Well and below it the probable remains of his chapel, which were described by William Borlase in his Antiquities. Salomon is recorded, in the 'Life of Saint Cybi' as a princeps militiae living in eastern Cornwall, where Cybi, his son, was born. Wade-Evans interpreted his title as 'captain of the guard', while others believe he was a sub-king of Cornwall. David Nash Ford suggests that he succeeded to the realm of his cousin, King Mark.\nCybi's 'life' gives Salomon's father as Erbin ap Geraint ap Lud, but the Welsh Bonedd y Saint states his father was Geraint ab Erbin ap Custennin Gorneu. Erbin and Geraint have evidently been switched around, but it is unclear which position is correct. Geraint ab Erbin is certainly a character in the Welsh Arthurian story of Culhwch and Olwen. Custennin is known from other records, but Lud is not and may be a further mistake. Salomon married Gwen ferch Cynyr, the daughter of an Irish prince who had settled at Caer-Goch near St David's in Pembrokeshire.\nSalomon is sometimes identified with one or both known Saints Selevan, of St Levan in Cornwall and Penmon on Anglesey, or with Salwys, the supposed founder the church of Lansallos, also in Cornwall.\nHis memorial could be the Chi-Rho inscribed stone to be seen at St Just in Penwith Parish Church recording 'Selus lies here'.", "link_mentions": [{"page": "June 25 (Eastern Orthodox liturgics)", "response": ["* Saint Salomon of Cornwall, by tradition born in Cornwall, the husband of St Gwen and father of St Cuby (Cybi), he lived in Brittany and was murdered by heathen (5th century)"]}, {"page": "Saint Salom", "response": ["#REDIRECT Salomon of Cornwall"]}, {"page": "Category talk:British saints", "response": ["Salomon of CornwallStub"]}, {"page": "Category talk:Ancient Christian denominations", "response": ["Salomon of CornwallStub"]}, {"page": "Celtic inscribed stone", "response": ["The Selus Stone (thought to date from the late 5th or early 6th-centuries); it bears the Latin inscription Selus Ic Iacet (Selus lies here). This is thought to refer to Salomon of Cornwall, otherwise known as Saint Selevan. It is preserved at St Just in Penwith Parish Church."]}, {"page": "St Levan's Church, St Levan", "response": ["The church of St Levan is medieval.Parish Guide. n.d. It was heavily rebuilt in the twelfth century and extended in the fifteenth century.Pevsner, N. (1970) Buildings of England, Cornwall. Penguin Books It was restored by J. D. Sedding. St Levan (properly Selevan, a Celtic form of Solomon) according to the Life of St Kybi was a Cornishman and the father of Kybi. In the department of Morbihan are four places probably connected to the same saint, who probably lived in the 6th or 7th century. On the cliff at St Levan is St Levan's Well and below it the probable remains of his chapel, which were described by William Borlase in his Antiquities.Doble, G. H. (1960) The Saints of Cornwall: part 1. Truro: Dean and Chapter; pp. 3-9 For more information on the saint see Salomon of Cornwall."]}, {"page": "St Just in Penwith Parish Church", "response": ["The Selus Stone is thought to date from the late 5th or early 6th-centuries. It bears the Latin inscription Selus Ic Iacet (Selus lies here). This is thought to refer to Salomon of Cornwall, otherwise known as Saint Selevan."]}, {"page": "List of early Christian saints", "response": ["|Salomon of Cornwall||5th century"]}, {"page": "Selyf", "response": ["* Salomon of Cornwall (5th century), a prince of Cornwall and father of Saint Cybi"]}, {"page": "List of Welsh saints", "response": ["|Wife of Salomon of CornwallMother of Saint Cybi & aunt of Saint David "]}, {"page": "Selevan", "response": ["#redirect Salomon of Cornwall"]}, {"page": "Saint Wenna (queen)", "response": ["She married Salomon of Cornwall and became the mother of Saint Cybi."]}]}}