{"wiki_id": "http://www.wikidata.org/entity/Q3958920", "itemLabel": "Peter Howson", "itemDescription": "Australian  politician (1919-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Howson_(politician)", "wikipedia_page": {"main": "Peter Howson CMG (22 May 1919 – 1 February 2009) was an Australian politician who served in the House of Representatives from 1955 to 1972, representing the Liberal Party. He was Minister for Air from 1964 to 1968 and Minister for the Environment, Aborigines and the Arts from 1971 to 1972.", "link_mentions": [{"page": "Harold Holt", "response": ["In October the government became embroiled in another embarrassing controversy over the alleged misuse of VIP aircraft, which came to a head when John Gorton (Government Leader in the Senate) tabled documents that showed that Holt had unintentionally misled Parliament in his earlier answers on the matter. Support for his leadership was eroded even further by his refusal to sack the Minister for Air, Peter Howson, in order to defuse the scandal, fuelling criticism from within the party that Holt was \"weak\" and lacked Menzies' ruthlessness. Much of the blame for the episode within the Public Service was visited upon Sir John Bunting, Secretary of the Prime Minister's Department, although other figures such as the Deputy Secretary Peter Lawler were able to protect themselves. One of John Gorton's first acts upon becoming Prime Minister in January 1968 was to sideline Bunting by creating a separate Department of the Cabinet Office with Bunting as its head, and replaced him with Lenox Hewitt."]}, {"page": "Stolen Generations", "response": ["Some have objected to he use of the term \"Stolen Generations\". Former Prime Minister John Howard did not believe the government should apologise to the Australian Aboriginal peoples. Then Minister for Aboriginal and Torres Strait Islander Affairs John Herron disputed usage of the term in April 2000. Others who disputed the use of the term include Peter Howson, Minister for Aboriginal Affairs from 1971 to 1972, and Keith Windschuttle, an historian who argues that some of the abuses towards Australian Aboriginal peoples have been exaggerated and in some cases invented.Disputing the appropriateness of the term:  argues that the removals were done for the children's good and that Peter Read in misrepresented the evidence. Many historians argue against these denials, including to Windschuttle in particular.Dr Naomi Parry, Debunking Windschuttle's benign interpretation of history, Crikey, 12 February 2008, also Peter Read addresses Windschuttle's article of 9 February 2008 in , and  Anthropologist Ron Brunton also criticised the proceedings on the basis that there was no cross-examination of those giving their testimonies or critical examination of the factual basis of the testimony."]}, {"page": "Minister for Foreign Affairs (Australia)", "response": ["| Peter Howson"]}, {"page": "Members of the Australian House of Representatives, 1969–1972", "response": ["| Hon Peter Howson"]}, {"page": "Members of the Australian House of Representatives, 1966–1969", "response": ["| Hon Peter Howson"]}, {"page": "Members of the Australian House of Representatives, 1963–1966", "response": ["| Peter Howson"]}, {"page": "Members of the Australian House of Representatives, 1961–1963", "response": ["| Peter Howson"]}, {"page": "Members of the Australian House of Representatives, 1958–1961", "response": ["| Peter Howson"]}, {"page": "Peter Howson", "response": ["Peter Howson OBE (born 27 March 1958) is a Scottish painter. He was a British official war artist in 1993 during the Bosnian War.", "Peter Howson was born in London of Scottish parents and moved with his family to Prestwick, Ayrshire, when he was four. He was raised in a religious family and the first ever painting he did was a Crucifixion, when he was 6 years old.", "Howson was appointed Officer of the Order of the British Empire (OBE) in the 2009 Birthday Honours. In November 2010, BBC Scotland aired a documentary named \"The Madness of Peter Howson\" which followed the final stages of the completion of a grand commission for show in the renovated St Andrew's Cathedral and also dealt with Howson's struggle with mental illness and Asperger's syndrome.\"The Madness\", The Scotsman, 24 November 2010.", "* Berkoff, Stephen, Peter Howson, Flowers (2005)", "* Heller, Robert, Peter Howson, Momentum (2003)", "* Heller, Robert, Peter Howson, Mainstream Publishing (1993)", "* Peter Howson profile, FlowersGallery.com ", "* Peter Howson.net", "* Peter Howson website", "* Peter Howson profile,  Asperger-Syndrome.me.uk", "* Peter Howson at National Portrait Gallery, London (npg.org.uk)"]}, {"page": "No. 37 Squadron RAAF", "response": ["On 27 September 1965, Minister for Air Peter Howson announced that No. 37 Squadron was to be re-raised to operate twelve Lockheed C-130E Hercules transport aircraft that had been purchased by the Federal government; the new aircraft would allow the RAAF to support Australian deployments in South East Asia while continuing to meet its domestic commitments.Wilson, Dakota, Hercules, and Caribou in Australian Service, p. 105 The squadron was formed at RAAF Base Richmond on 21 February 1966, under the command of Wing Commander Ron McKimm.Roylance, Air Base Richmond, p. 117 It joined No. 36 Squadron, which had been operating C-130A Hercules since 1958. No. 486 Squadron, disbanded in 1964, was re-formed at Richmond to provide maintenance for both Hercules squadrons; major repairs and upgrades to the C-130s were the responsibility of No. 2 Aircraft Depot (later No. 503 Wing).Stephens, Going Solo, pp. 178, 420–425RAAF Historical Section, Maintenance Units, p. 8 As the C-130E had a longer range and could carry a greater payload than the C-130A, No. 37 Squadron was generally assigned strategic tasks, while No. 36 Squadron's responsibilities were primarily tactical in nature. No. 37 Squadron began taking delivery of its C-130Es in August, and by the end of September its staff numbered eighty-six, including twenty-one officers.Roylance, Air Base Richmond, pp. 100–103No. 37 Squadron (1966–78), \"Operations Record Book\", p. 5 In February 1967, the squadron commenced long-range missions in support of Australian forces in the Vietnam War, including aero-medical evacuations conveying wounded soldiers back to Australia, generally via RAAF Base Butterworth, Malaysia.RAAF Historical Section, Maritime and Transport Units, pp. 64–65 Initially both C-130A and E models were employed for such evacuations, but only C-130Es were assigned to this task from May 1967, as they offered more comfortable conditions and were capable of flying directly between South Vietnam and Australia if required.Coulthard-Clark, The RAAF in Vietnam, pp. 256–258 By the end of February 1968, No. 37 Squadron had a strength of 207 personnel: eighty-five aircrew, including fifty-one officers, and 122 ground staff, including three officers.No. 37 Squadron (1966–78), \"Operations Record Book\", p. 48 The squadron transported the last Australian forces out of Vietnam in December 1972, following the Federal government's decision to withdraw from the conflict.Coulthard-Clark, The RAAF in Vietnam, pp. 248"]}, {"page": "Minister for Communications, Urban Infrastructure, Cities and the Arts", "response": ["The only minister before Simon Crean to have the title of Minister for the Arts was Bob McMullan between 24 March 1993 and 25 March 1994. However, \"Arts\" has appeared in several ministerial titles since Peter Howson was appointed Minister for the Environment, Aborigines and the Arts on 10 March 1971. The following individuals have been appointed as Minister for the Arts, or any of its precedent titles:", "| Peter Howson"]}, {"page": "Royal Australian Air Force VIP aircraft", "response": ["The \"VIP affair\" of 1967 arose from the decision by the government and public service to maintain a veil of secrecy over the VIP flights program, attempting to conceal costs, destinations and passengers in order to prevent negative media coverage. This culminated in Prime Minister Harold Holt and Air Minister Peter Howson being found to have misled parliament over the existence of passenger manifests."]}, {"page": "Les Bury", "response": ["After Holt's disappearance in December 1966, Bury was one of four candidates to contest the Liberal leadership ballot, along with John Gorton, Paul Hasluck, and Billy Snedden. He had some support within the party, including from Peter Howson, and was reportedly Menzies' second most preferred candidate after Hasluck. According to Graham Freudenberg much of his support was due to his status as the only candidate from New South Wales. However, he was virtually unknown among the general public and was not seen as a strong television performer. Bury polled an estimated 16 votes (out of 81) on the first ballot, ahead of only Snedden. Both were eliminated and Gorton went on to defeat Hasluck in the final ballot."]}, {"page": "Minister for the Environment (Australia)", "response": ["| Peter Howson"]}, {"page": "Members of the Australian House of Representatives, 1955–1958", "response": ["| Peter Howson"]}, {"page": "Candidates of the 1951 Australian federal election", "response": ["|Fawkner || Labor || |Bill Bourke || Peter Howson (Lib) || Colin Kennedy (Ind)"]}, {"page": "Candidates of the 1954 Australian federal election", "response": ["|Fawkner || Labor || |Bill Bourke || Peter Howson (Lib) || "]}, {"page": "Candidates of the 1955 Australian federal election", "response": ["|Fawkner || Labor || Patrick Thompson || |Peter Howson (Lib) || Bill Bourke ||"]}, {"page": "Candidates of the 1958 Australian federal election", "response": ["|Fawkner || Liberal || George Smart || |Peter Howson (Lib) || Bill Bourke || "]}, {"page": "Candidates of the 1961 Australian federal election", "response": ["|Fawkner || Liberal || Gwendolyn Noad || |Peter Howson (Lib) || Richard Coyne ||"]}, {"page": "Candidates of the 1963 Australian federal election", "response": ["|Fawkner || Liberal || Gwendolyn Noad || |Peter Howson (Lib) || John Speed || George Gabriel (Ind)"]}, {"page": "Candidates of the 1966 Australian federal election", "response": ["|Fawkner || Liberal || Robert Vernon || |Peter Howson (Lib) || Yvonne Abolins || George Gabriel || Anthony Sanders (Ind)"]}, {"page": "Candidates of the 1969 Australian federal election", "response": ["***The member for Fawkner, Peter Howson (Liberal), contested Casey.", "|Casey || Liberal || Duncan Waterson || |Peter Howson (Lib) || Kevin Adamson || Joe Schillani (Ind)Leonard Weber (AP)"]}, {"page": "Candidates of the 1972 Australian federal election", "response": ["|Casey || Liberal || |Race Mathews || Peter Howson (Lib) || Kevin Adamson || Clive Champion || Alfred Andrews (DOGS)Margaret Briggs (Ind)Roderick Matthews (Ind)"]}, {"page": "Deaths in February 2009", "response": ["*Peter Howson, 89, Australian politician, Minister for Air (1964–1968) and Environment, Aborigines and the Arts (1971–1972), fall."]}, {"page": "Peter Howson (Australian politician)", "response": ["#REDIRECT Peter Howson (politician)"]}, {"page": "Lenox Hewitt", "response": ["McMahon succeeded Gorton as Prime Minister; one of his first acts was to restore Sir John Bunting to his old job by merging the Department of the Cabinet Office with the Prime Minister's Department, under a new name, the Department of the Prime Minister and Cabinet. Hewitt was appointed Secretary of the newly created Department of the Environment, Aborigines and the Arts. His minister was Peter Howson, who was not keen on the job (he was reported as describing it as \"trees, boongs and poofters\")."]}, {"page": "May 1919", "response": ["* Born: Paul Vanden Boeynants, Belgian state leader, 41st Prime Minister of Belgium, in Forest, Belgium (d. 2001); Peter Howson, Australian politician, cabinet minister for the Robert Menzies and William McMahon administrations, in London (d. 2009)"]}, {"page": "1981 New Year Honours", "response": ["* The Honourable Peter Howson. For Parliamentary and community service."]}, {"page": "Howson", "response": ["* Peter Howson (born 1958), Scottish painter", "* Peter Howson (politician) (1919–2009), Australian politician"]}, {"page": "List of whips in the Australian House of Representatives", "response": ["| Peter Howson(Fawkner) || 23 February 1962", "| Peter Howson(Fawkner) || 22 December 1963"]}, {"page": "Minister for Indigenous Australians", "response": ["| Peter Howson"]}, {"page": "Department of the Environment, Aborigines and the Arts", "response": ["The department was an Australian Public Service department, staffed by officials who were responsible to the Minister for the Environment, Aborigines and the Arts. The department's first Minister, Peter Howson, was not keen on the job, reportedly calling the portfolio \"trees, boongs and poofters.\""]}, {"page": "Royal Victorian Eye and Ear Hospital", "response": ["The hospital comprises three wings: the Aubrey Bowen Wing (built in 1896), the Peter Howson Wing (built in 1974) and the Smorgon Family Wing (commissioned in 1987). There is a tunnel underneath Victoria Parade which links the Eye and Ear to St Vincent's Hospital.The Royal Victorian Eye and Ear Hospital, Open House Melbourne, 2013."]}, {"page": "My Story (Gillard book)", "response": ["The book received generally favourable reviews, with The Conversation noting \"For those looking for a tell-all confession of the life and loves of Julia Gillard, My Story will disappoint. For readers seeking Gillard's views of the first Rudd government and the rise and fall of her own government, there is plenty of meat here.\" Feminist and writer Anne Summers praised the autobiography for its knowledge on the mechanisms of government in a review with The Australian, \"As a primer on how government works, My Story is on a par with the cabinet diaries of Clyde Cameron, Peter Howson, Neal Blewett and Gareth Evans. It's as comprehensive, but more personal, than [Prime Minister John Howard's] Lazarus Rising.\" In 2015, Gillard's memoir was shortlisted for the category of 2015 Biography of the Year by the Australian Book Industry Awards."]}]}}