{"wiki_id": "http://www.wikidata.org/entity/Q39533047", "itemLabel": "Amelia Elizabeth Guppy", "itemDescription": "Early UK born photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Amelia_Elizabeth_Guppy", "wikipedia_page": {"main": "Amelia Elizabeth Guppy or Amelia Parkinson (1808 – 1886) was an early artist and photographer from the United Kingdom.", "link_mentions": [{"page": "Lechmere Guppy", "response": ["He was one of four children of Robert Guppy (1808-1894), a lawyer who went to Trinidad and became Mayor of San Fernando, and Amelia Elizabeth Guppy, a painter and one of the pioneers of photography, who navigated the Orinoco River accompanied by only a few native Indians. \"Lechmere\", as he was called, was raised by his grandparents, Richard Parkinson and Lucy (née Lechmere, daughter of Royal Navy officer William Lechmere, Vice-Admiral of the White), in Kinnersley Castle, a 13th-century Norman castle in Herefordshire. Richard Parkinson wanted Lechmere to take over the castle, a role in which he had no interest. Having come into an inheritance from another relative, he left England at the age of 18. He visited Australia, Tasmania and was shipwrecked on the coast of New Zealand in 1856. After living with the Māori for two years and mapping the area, Lechmere left New Zealand for Trinidad, where his parents were living. He married Alice Rostant, the daughter of local French  planters and a descendant of the Counts of Rostant, French aristocrats who had fled to Trinidad to escape the French Revolution.  Lechmere became Trinidad's Chief Inspector of Schools until his retirement in 1891."]}, {"page": "Thomas Phillipps", "response": ["In 1850 at a meeting of the Cambrian Archaeological society (Cymdeithas Hynafiaethau Cymru), Phillips announced that he was seeking to locate his large collection at a location in Wales. He employed a distant relative by marriage, Amelia Elizabeth Guppy, to photograph some of his collection in 1853 including artefacts from Babylon and Utrecht."]}, {"page": "William Lechmere", "response": ["Vice-Admiral William Lechmere died at Hill House, Steeple Aston, Oxfordshire on 12 December 1815 at the age of 63. He had had a number of children, several of whom followed him into the navy. Among them was his eldest son, Charles, who was born on 4 December 1789 and died in command of  off the West African coast on 9 November 1822. One of his daughters, Mary, married James Saumarez, son of the naval officer James Saumarez, 1st Baron de Saumarez. His daughter Lucy (1788-1834) married Richard Parkinson, of Kinnersley Castle, and was mother of the artist and photographer Amelia Elizabeth Guppy and grandmother of the naturalist Robert John Lechmere Guppy."]}]}}