{"wiki_id": "http://www.wikidata.org/entity/Q3959299", "itemLabel": "Shea Neary", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Shea_Neary", "wikipedia_page": {"main": "James Patrick \"Shea\" Neary ( shay NEER-ee; born 18 May 1968) is a British former professional boxer who competed from 1992 to 2000. He held the WBU light-welterweight title from 1996 to 2000, and challenged once for the Commonwealth light-welterweight title in the latter year.", "link_mentions": [{"page": "Rope-a-dope", "response": ["\"Irish\" Micky Ward used this strategy during many of the fights in the later part of his career. Ward would wait for his opponent to become fatigued and would hit with either a left hook to the body or other combinations. This strategy led him to the junior welterweight championship of the WBU, where he took the belt from Shea Neary."]}, {"page": "ITV Sport", "response": ["ITV Sport has broadcast many boxing matches over the years under the Big Fight Live banner and the sport was a regular fixture on ITV screens until the mid 1990s when ITV lost its two premier contracts – in mid-1994 Barry Hearn took Chris Eubank and his stable of fighters to Sky Sports and at the start of 1995, Sky Sports won the rights to show Sports Network fights. This left ITV with only occasional boxing for the following ten years. Their only networked boxing during this period were a few fights involving Shea Neary, thanks to a contract with Merseyside promoter John Hyland. Other bouts were shown on ITV2 and the ill-fated ITV Sport Channel and some boxing was shown on a regional basis, but this was rare.BFI Film & Television Database: \"The Big Fight – Live!\""]}, {"page": "Eamonn Magee", "response": ["Magee's sights were then set on a fight with Manchester's Ricky Hatton and continued his winning streak with a further ten straight wins, seven inside the distance, including wins over Kenya's Joseph Miyumo, Shea Neary and Jonathan Thaxton to line up a super-fight with Hatton."]}, {"page": "The Big Fight Live", "response": ["The decline of ITV's boxing portfolio began in mid-1994 when Barry Hearn took Chris Eubank and his stable of fighters to Sky Sports. At the start of 1996, Sky Sports won the rights to show Sports Network (Frank Warren promoted) fights, leaving ITV with only occasional boxing for the following ten years. Their only networked boxing during this period were a few fights involving Shea Neary, thanks to a contract with Merseyside promoter John Hyland. Other bouts were shown on ITV2 and the ITV Sport Channel, while ITV2 also ran a fortnightly magazine show called \"Boxing First\". This was presented by Russ Williams with Steve Bunce as a regular studio pundit, and other studio guests. The programme featured highlights of fights not shown live on UK television, as well as features. Other boxing was shown on a regional basis, but this was rare."]}, {"page": "Darryl Tyson", "response": ["Tyson began boxing professionally in 1982 and has faced a number of tough opponents in his 20 years of boxing. On August 15, 1986, he lost by unanimous decision in his first world title shot to Jimmy Paul for the IBF lightweight title; this was a rematch bout, Tyson having won their first match by ten rounds split decision.https://boxrec.com/en/event/37235/57766 On December 5, 1992, Tyson lost in his second world title shot by unanimous decision to Miguel Ángel González for the WBC lightweight title. In his next fight, Tyson fought former WBA lightweight champion Livingstone Bramble to a draw. Next Tyson lost to Rafael Ruelas. In his next fight Tyson beat Roger Mayweather. In 1995, Tyson lost to Freddie Pendleton by technical knockout in round ten. In 1996, he was knocked out in the second round by Oscar De La Hoya. He would lose his next three fights to Shea Neary, Diosbelys Hurtado, and Zab Judah. In 2000, Tyson defeated Emmanuel Clottey by split decision. Four years later, he lost to DeMarcus Corley."]}, {"page": "The Fighter", "response": ["Upon his release from prison, Dicky and his mother go to see Micky train. Assuming things are as they were, Dicky prepares to spar with his brother, but Micky informs him that he is no longer allowed per Micky's agreement with his current team. In the ensuing argument, in which Micky chastises both factions of his family, Charlene and his trainer leave in disgust. Micky and Dicky spar until Micky knocks Dicky down. Dicky storms off, presumably to get high again, and Alice chides Micky, only to be sobered when he tells her that she has always favored Dicky. Dicky returns to his crack house, where he says goodbye to his friends and heads to Charlene's apartment. He tells her that Micky needs both of them and they need to work together. After bringing everyone back together, the group goes to London for the title fight against welterweight champion Shea Neary. Micky scores another upset victory and the welterweight title. The film jumps a few years ahead, with Dicky crediting his brother as the creator of his own success."]}, {"page": "Micky Ward", "response": ["In 2000, Ward traveled to London to take on the WBU Light Welterweight Champion,  Shea Neary,  and earned a TKO in the eighth round to win the WBU title. Ward, however, never defended the title, and split his next four fights. His ten-round decision victory over Emanuel Augustus (then known as Emanuel Burton) was voted The Ring magazine's 2001 Fight of the Year.Quinones, Rafael Garcia. \"Revisiting the Fight of the Year for 2001: Micky Ward vs. Emanuel Burton\", BleacherReport.com, January 9, 2010", "|style=\"text-align:left;\"| Shea Neary"]}, {"page": "Boxing in Liverpool", "response": ["Andy Holligan (27-3-0) is the former BBBofC British and Commonwealth light welterweight champion and former WBC light welterweight world title challenger. His most notable opponents were Julio César Chávez and Shea Neary.", "=== Shea Neary ===", "Shea Neary (23-2-0) is a former WBU light welterweight champion. He fought Micky Ward, Andy Holligan, and Eamonn Magee."]}, {"page": "Andy Holligan", "response": ["Andy Holligan (born 6 June 1967 in Liverpool) is an English amateur light welterweight and professional light welter/welter/light middleweight boxer of the 1980s and 1990s, who as an amateur won the 1987 Amateur Boxing Association of England (ABAE) light welterweight title, against Richard Bryan (Fitzroy Lodge ABC (London)), boxing out of Rotunda ABC (Liverpool), and as a professional won the British Boxing Board of Control (BBBofC) British light welterweight title , winning the Lonsdale Belt outright twice Commonwealth light welterweight title (twice), and was a challenger for the World Boxing Council (WBC) light welterweight title against Julio César Chávez losing the fight after pulling out the fight at the end of the fifth round with a broken nose ,  and World Boxing Union (WBU) light welterweight title against Shea Neary, his professional fighting weight varied from , i.e. light welterweight to , i.e. light middleweight."]}, {"page": "Nigel Benn vs. Gerald McClellan", "response": ["Referee Alfred Asaro attempted to defend the lack of action he had taken in not stopping the fight earlier, saying \"I can't guess if a boxer who continues to go on punching has head pains\", and attempted to lay the blame at the feet of McClellan's trainer Stan Johnson, saying it was he who should have intervened. ITV directors made the decision not to replay the fight, and were considering pulling out of the sport; a week later, ITV broadcast a fight between Naseem Hamed and Sergio Liendo, in which Liendo was knocked unconscious by Hamed – despite 13 million people having watched the Benn–McClellan fight, it would prove to be the final fight ITV would air for almost four years, when they aired Shea Neary vs. Juan Carlos Villareal."]}, {"page": "Naseem Hamed vs. Vuyani Bungu", "response": ["|Shea Neary (c)"]}, {"page": "JJ Metcalf", "response": ["James \"JJ\" Metcalf (born 27 July 1988) is an English professional boxer. He held the Commonwealth super-welterweight title in 2019 and challenged for the British super-welterweight title in March 2021. He is the son of former boxer Shea Neary."]}, {"page": "Charles Joseph Atkinson", "response": ["While working with Granada and Central TV. he took a close interest in the career of Liverpool favourite, and one of his father's proteges, Shea Neary. Working closely with Neary's manager John Hyland he was instrumental in getting Neary's winning world title fight with Daryl Tyson in Liverpool televised.  After the passing of his father, he trained Shea Neary for his final fight in Belfast against Noel Magee for the Commonwealth title. \"In his career, he claims to have met many of the world's top boxing trainers, but maintains that Charles Atkinson Sr. B.E.M. was the best youth mentor and the best boxing trainer coach he ever worked with and attributes his own successes with youth and boxers to his methods.\""]}, {"page": "Neary", "response": ["* Shea Neary (born 1968), British boxer"]}]}}