{"wiki_id": "http://www.wikidata.org/entity/Q3973394", "itemLabel": "Steve Sidwell", "itemDescription": "British conductor and composer, also worked as trumpeter", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Sidwell_(musician)", "wikipedia_page": {"main": "Steve Sidwell is an English arranger and composer.\n\n", "link_mentions": [{"page": "Wild Mood Swings", "response": ["*Steve Sidwell – trumpet"]}, {"page": "Stay on These Roads", "response": ["* Contributions to the recording of the album: Steve Sidwell, Ben Robbins, Anne Dudley, Randy Hope-Taylor, Øystein Jevanord, Kick Horns."]}, {"page": "Seal IV", "response": ["*Nick Ingman, Steve Sidwell – string, horn and choir arrangements"]}, {"page": "List of film score composers", "response": ["* Steve Sidwell"]}, {"page": "Amused to Death", "response": ["*Steve Sidwell – cornet (tracks 6 and 7)"]}, {"page": "Shepherd Moons", "response": ["Shepherd Moons was recorded with new equipment purchased with the profits from Watermark. Much of the album was recorded at Aigle Studio, the recording studio in the Ryans' home, then located in Artane, a northern suburb of Dublin. However, as with her two previous albums, recording and production had to relocate elsewhere as the Aigle facility lacked the correct equipment to complete the final mix and mastering. The album was finished at SARM West Studios in London, where \"How Can I Keep from Singing?\", \"Book of Days\", and \"Lothlórien\" were recorded with additional engineering and mixing carried out by Gregg Jackman. As with Watermark, several musicians were brought in to perform additional instruments. Andy Duncan plays percussion on \"Book of Days\", Roy Jewitt plays the clarinet on \"Evacuee\" and \"Angeles\", Liam O'Flionn plays the uilleann pipes on \"Smaointe...\", Steve Sidwell plays the cornet on \"Evacuee\", and Nicky performs percussion on \"Ebudæ\".", "*Steve Sidwell – cornet on \"Evacuee\""]}, {"page": "Construction for the Modern Idiot", "response": ["*Steve Sidwell - trumpet"]}, {"page": "Life thru a Lens", "response": ["* Steve Sidwell – trumpet"]}, {"page": "Sing When You're Winning", "response": ["* Steve Sidwell – trumpet "]}, {"page": "Looking for Jack", "response": ["*Steve Sidwell - trumpet"]}, {"page": "The Red Shoes (album)", "response": ["** Steve Sidwell – trumpet, flugelhorn (11)"]}, {"page": "Spiceworld (album)", "response": ["* Steve Sidwell – orchestral arrangement "]}, {"page": "Lost Horizons (Lemon Jelly album)", "response": ["* Steve Sidwell –  flugelhorns (1, 5), trumpets (5)"]}, {"page": "Faith (George Michael album)", "response": ["*Steve Sidwell – trumpet"]}, {"page": "Don't Mind If I Do (Culture Club album)", "response": ["* Steve Sidwell – trumpet, flugelhorn, brass"]}, {"page": "Both Sides Now (Joni Mitchell album)", "response": ["* Andy Crowley, Derek Watkins, Gerard Presencer, John Barclay, Steve Sidwell – trumpet"]}, {"page": "Radio Musicola", "response": ["*Steve Sidwell – trumpet "]}, {"page": "Nina Badrić", "response": ["On 14 February 2005, Badrić performed at the Dom sportova in Zagreb, in support of the campaign by UNICEF to house abandoned children. The concert was filmed and the same year Badrić released live album on double CD, Ljubav za ljubav – Live, released through the Aquarius Records. In November 2007, she released her seventh studio album,  07. The album opens with the song \"Kralj života mog\", which isa duet with Roma diva Ljiljana Petrović-Buttler. The material contains another duet with Montell Jordan in the song \"Do not give this to anyone\". The album was recorded over two years and produced by Steve Sidwell. In November 2011 Nina released the album Nebo."]}, {"page": "Apple Venus Volume 1", "response": ["*Steve Sidwell – trumpet solo on \"Easter Theatre\""]}, {"page": "Goddess in the Doorway", "response": ["*Steve Sidwell – trumpet"]}, {"page": "All the Rage (General Public album)", "response": ["* Steve Sidwell — trumpet on \"Where's the Line?\""]}, {"page": "Swing When You're Winning", "response": ["* Steve Sidwell – trumpet"]}, {"page": "Live at Knebworth", "response": ["* Steve Sidwell: trumpet"]}, {"page": "Older (album)", "response": ["*Steve Sidwell – trumpet", "*Steve Sidwell – trumpet"]}, {"page": "The Yellow", "response": ["* Steve Sidwell - flugelhorn (2)"]}, {"page": "Grand Prix (album)", "response": ["*Steve Sidwell – trumpet"]}, {"page": "Songs from Northern Britain", "response": ["*Steve Sidwell – brass"]}, {"page": "No-One but You (Only the Good Die Young)", "response": ["*Steve Sidwell – orchestra arranger and conductor"]}, {"page": "Twenty Four Seven (Tina Turner album)", "response": ["* Steve Sidwell - trumpet"]}, {"page": "Waiting for the Moon (album)", "response": ["*Steve Sidwell – trumpet"]}, {"page": "Tony Award for Best Orchestrations", "response": ["| Steve Sidwell"]}, {"page": "79th Academy Awards", "response": ["Several other people participated in the production of the ceremony. William Ross served as musical director for the ceremony. J. Michael Riva designed a new set and stage design for the ceremony. Voice actor Don LaFontaine was hired with Gina Tuttle as announcers for the telecast. Actor Greg Vaughan and Lucky columnist Allyson Waterman co-hosted \"Road to the Oscars\", a weekly behind-the-scenes video blog on the Oscar ceremony website. Members of the dance troupe and contortionist group Pilobolus performed interpretive shadow figures representing scenes and logos from the nominated films. Actors Jack Black, Will Ferrell, and John C. Reilly performed a lighthearted musical number written by comedic director Judd Apatow and music composer Marc Shaiman satirizing comedy's lack of recognition at the Academy Awards. Conducted by musician Steve Sidwell, the Sound Effects Choir performed voice effects to a montage of classic films. Another vignette directed by documentary filmmaker Errol Morris featuring several Oscar nominees discussing what it means to be an Oscar nominee was shown at the beginning of the show. Italian director Giuseppe Tornatore assembled a tribute highlighting previous winners of the Best Foreign Language Film. Filmmaker Michael Mann produced a montage highlighting American life through the eyes of cinema."]}, {"page": "Special Beat Service", "response": ["* Steve Sidwell – Trumpet"]}, {"page": "Paint and Paint", "response": ["*Steve Sidwell - trumpet"]}, {"page": "Facing Goya", "response": ["*Steve Sidwell, trumpet, flugelhorn "]}, {"page": "Trickle", "response": ["* Steve Sidwell – Nyman Orchestra arrangements"]}]}}