{"wiki_id": "http://www.wikidata.org/entity/Q3973166", "itemLabel": "Stephen Bolsin", "itemDescription": "British anaesthetist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Bolsin", "wikipedia_page": {"main": "Stephen Nicholas Cluley Bolsin (born 1952) is a British anaesthetist whose actions as a whistleblower exposed incompetent paediatric cardiac surgery at the Bristol Royal Infirmary leading to the implementation of clinical governance reforms in the United Kingdom.", "link_mentions": [{"page": "Conscience", "response": ["Conscience played a major role in the actions by anaesthetist Stephen Bolsin to whistleblow (see list of whistleblowers) on incompetent paediatric cardiac surgeons at the Bristol Royal Infirmary. Jeffrey Wigand was motivated by conscience to expose the Big Tobacco scandal, revealing that executives of the companies knew that cigarettes were addictive and approved the addition of carcinogenic ingredients to the cigarettes.Marie Brenner. \"The Man Who Knew Too Much\". Vanity Fair. May 1996. David Graham, a Food and Drug Administration employee, was motivated by conscience to whistleblow that the arthritis pain-reliever Vioxx increased the risk of cardiovascular deaths although the manufacturer suppressed this information.\"Whistler-Blower Guardians Say FDA Officials Tried to Undermine Critic\". San Francisco Chronicle. 24 November 2004 Rick Piltz from the U.S. global warming Science Program, blew the whistle on a White House official who ignored majority scientific opinion to edit a climate change report (\"Our Changing Planet\") to reflect the Bush administration's view that the problem was unlikely to exist.\"Andrew Revkin. \"Bush Aide Softened Greenhouse Gas Links to Global Warming\". The New York Times. 8 June 2005. Retrieved 18 October 2009. Muntadhar al-Zaidi, an Iraqi journalist, was imprisoned and allegedly tortured for his act of conscience in throwing his shoes at George W. Bush.Waleed Ibrahim. Iraqi Shoe-Throwing Reporter Becomes the Talk of Iraq. Mon 15 December 2008 https://www.reuters.com/article/idUSTRE4BE28Q20081215 accessed 17 September 2010 Mordechai Vanunu an Israeli former nuclear technician, acted on conscience to reveal details of Israel's nuclear weapons program to the British press in 1986; was kidnapped by Israeli agents, transported to Israel, convicted of treason and spent 18 years in prison, including more than 11 years in solitary confinement.Gilling, Tom and John McKnight. Trial and Error – Mordechai Vanunu and Israel's Nuclear Bomb. 1991 Monarch Publications. "]}, {"page": "Clinical governance", "response": ["Clinical governance is a systematic approach to maintaining and improving the quality of patient care within the National Health Service (NHS).  Clinical governance became important in health care after the Bristol heart scandal in 1995, during which an anaesthetist, Dr Stephen Bolsin, exposed the high mortality rate for paediatric cardiac surgery at the Bristol Royal Infirmary. It was originally elaborated within the United Kingdom National Health Service (NHS), and its most widely cited formal definition describes it as:", "* Stephen Bolsin"]}, {"page": "Bolsin", "response": ["#REDIRECT Stephen Bolsin"]}, {"page": "Steve bolsin", "response": ["#REDIRECT Stephen Bolsin"]}, {"page": "Bristol heart scandal", "response": ["Dr Stephen Bolsin, joined the BRI team in 1988 and noticed high surgical mortality rates. As early as 1991, Bolsin raised concerns with high-ranking individuals at the trust and also contacted the NHS, the Department of Health, and the Royal Colleges. Bolsin was largely ignored until 1995, when Joshua Loveday died during a complex heart operation performed by Dr Janardan Dhasmana. After the death of Loveday, Bolsin emigrated to Australia. There he was praised for raising issues about the mortality rates at BRI and was promoted to professor. Subsequently, he was awarded the Royal College of Anaesthetists Frederic Hewitt Medal in 2013 in recognition of his contribution to patient safety.https://www.avma.org.uk/wp-content/uploads/Lawyers-Service-Newsletter-MARCH-2020-Laurence-Vick-Article-Part-1.pdf"]}, {"page": "University Hospitals Bristol and Weston NHS Foundation Trust", "response": ["The inquiry, which was announced in 1998 and reported in 2001, resulted from whistle-blowing by Dr Stephen Bolsin."]}, {"page": "Bolsin, Stephen", "response": ["#redirectStephen Bolsin"]}]}}