{"wiki_id": "http://www.wikidata.org/entity/Q3978258", "itemLabel": "Susanna Gregory", "itemDescription": "Cambridge academic who was previously a coroner's officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Susanna_Gregory", "wikipedia_page": {"main": "Susanna Gregory is the pseudonym of Elizabeth Cruwys, a Cambridge academic who was previously a coroner's officer. She writes detective fiction, and is noted for her series of mediaeval mysteries featuring Matthew Bartholomew, a teacher of medicine and investigator of murders in 14th-century Cambridge.\n\n", "link_mentions": [{"page": "Cambridge", "response": ["The city has been the setting for all or part of several novels, including Douglas Adams' Dirk Gently's Holistic Detective Agency, Rose Macaulay's They Were Defeated, Kate Atkinson's Case Histories, Rebecca Stott's Ghostwalk and Robert Harris' Enigma, while Susanna Gregory wrote a series of novels set in 14th century Cambridge. Gwen Raverat, the granddaughter of Charles Darwin, talked about her late Victorian Cambridge childhood in her memoir Period Piece and The Night Climbers of Cambridge is a book written by Noel Symington under the pseudonym \"Whipplesnaith\" about nocturnal climbing on the colleges and town buildings of Cambridge in the 1930s."]}, {"page": "Michael Jecks", "response": ["Jecks has written a series of novels featuring Sir Baldwin Furnshill, a former Knight Templar, and his friend Simon Puttock, Bailiff of Lydford Castle. He founded The Medieval Murderers, a speaking and entertainment group of historical writers including Bernard Knight, Ian Morson, Susanna Gregory, Phillip Gooden and CJ Sansom. The group has developed to collaborate on their books written as linked novellas, each book with a consistent theme, under the brand of The Medieval Murderers. More recently he helped create the Historical Writers' Association."]}, {"page": "Historical mystery", "response": ["|Matthew Bartholomew || England  ||data-sort-value=\"1300\"| 14th century || Susanna Gregory  || A Plague on Both Your Houses || 1996", "|Thomas Chaloner  || England       || data-sort-value=\"1600\"|17th century                 || Susanna Gregory          || A Conspiracy of Violence      || 2006"]}, {"page": "Aphra Behn", "response": ["Behn's life has been adapted for the stage in the 2014 play Empress of the Moon: The Lives of Aphra Behn by Chris Braak, and the 2015 play [exit Mrs Behn] or, The Leo Play by Christopher VanderArk. She is one of the characters in the 2010 play Or, by Liz Duffy Adams. Behn appears as a character in Daniel O'Mahony's Newtons Sleep, in Philip José Farmer's The Magic Labyrinth and Gods of Riverworld, in Molly Brown's Invitation to a Funeral (1999), in Susanna Gregory’s \"Blood On The Strand\", and in Diana Norman's The Vizard Mask. She is referred to in Patrick O'Brian's novel Desolation Island. Liz Duffy Adams produced Or,, a 2009 play about her life. The 2019 Big Finish Short Trip audio play The Astrea Conspiracy features Behn alongside The Doctor, voiced by actress Neve McIntosh. In recognition of her pioneering role in women's literature, Behn was featured during the \"Her Story\" video tribute to notable women on U2's North American tour in 2017 for the 30th anniversary of The Joshua Tree."]}, {"page": "The Fens", "response": ["*Susanna Gregory's Matthew Bartholomew chronicles title character is a fictional physician living in 14th-century Cambridge."]}, {"page": "Edward Hyde, 1st Earl of Clarendon", "response": ["In fiction, Clarendon is a minor character in An Instance of the Fingerpost by Iain Pears,  and he is also  a recurring character in the Thomas Chaloner series of mystery novels by Susanna Gregory; both authors show him in a fairly sympathetic light."]}, {"page": "Catherine of Braganza", "response": ["Novelists, notably Margaret Campbell Barnes in With All My Heart, Jean Plaidy in her Charles II trilogy and Susanna Gregory in her Thomas Chaloner mystery novels, usually portray the Queen in a sympathetic light. So did Alison Macleod in her 1976 biography of the queen, The Portingale and Isabel Stilwell in her 2008 historical novel Catherine of Braganza - The courage of a Portuguese Infanta who became Queen of England. "]}, {"page": "John Thurloe", "response": ["* He is a recurring character in the Thomas Chaloner series of mystery novels by Susanna Gregory, which show him in a favourable light."]}, {"page": "Joseph Williamson (English politician)", "response": ["He is a recurring character in the Thomas Chaloner series of mystery novels by Susanna Gregory, in which he plays a somewhat villainous role: his wife and her first husband appear in the seventh book in the series,  The Piccadilly Plot."]}, {"page": "Barbara Palmer, 1st Duchess of Cleveland", "response": ["Villiers is the protagonist in Royal Mistress (1977) by Patricia Campbell Horton and Royal Harlot (2007) by Susan Holloway Scott. She also features heavily in Kathleen Winsor's Forever Amber (1944), Jean Plaidy's A Health Unto His Majesty (1956) and Doris Leslie's The Sceptre and the Rose (1967), as well as being a recurring character in Susanna Gregory's Thomas Chaloner series of mystery novels."]}, {"page": "South Shetland Islands", "response": ["* The archipelago provides the mise-en-scène of the 2016 Antarctica thriller novel The Killing Ship authored by Elizabeth Cruwys and Beau Riffenburgh (under their joint alias Simon Beaufort), with action spreading from Hannah Point to Byers Peninsula via Ivanov Beach, skirting Verila Glacier and Rotch Dome in the process. (Susanna Gregory is pseudonyms of author Elizabeth Cruwys, and Simon Beaufort is a pseudonym she and Beau Riffenburgh use jointly.)"]}, {"page": "Michaelhouse, Cambridge", "response": ["Michaelhouse is the setting for the Matthew Bartholomew Chronicles, a series of Mediaeval mystery novels by Susanna Gregory.Matthew Bartholomew - Susanna Gregory"]}, {"page": "Clare, Suffolk", "response": ["* The Habit of Murder (2017), by Susanna Gregory, is a detective story set in 1360, centred on the castle, priory and town of Clare, involving Elizabeth de Burgh and the Cambridge colleges.Susanna Gregory, The Habit of Murder, Sphere 2017  "]}, {"page": "List of University of Cambridge people", "response": ["*Susanna Gregory (Wolfson)"]}, {"page": "Clarendon House", "response": ["The building of the house and the resentment it caused are major elements in The Piccadilly Plot, the seventh of the Thomas Chaloner series of mystery novels by Susanna Gregory."]}, {"page": "Grundisburgh", "response": ["The village has a primary school, a Church of England church and a Baptist chapel as well as one pub, the Dog. The Grundisburgh and District News is a newspaper which is published by volunteers every three months and provides news for Grundisburgh and the surrounding villages and hamlets.  There are two fords in the village. The village is the setting for A Wicked Deed by Susanna Gregory."]}, {"page": "Trumpington", "response": ["* In the \"Matthew Bartholomew\" series of novels by Susanna Gregory, Trumpington is the location of the Manor House belonging to Matthew's sister and husband."]}, {"page": "Thomas Chaloner", "response": ["* Thomas Chaloner, central character and narrator in a series of historical mystery crime novels by Susanna Gregory"]}, {"page": "Gregory (surname)", "response": ["* Susanna Gregory, pseudonym"]}, {"page": "Cruwys", "response": ["*Elizabeth Cruwys, real name of the novelist Susanna Gregory"]}, {"page": "Crowner John Mysteries", "response": ["Crowner John appears in a series of books formed of linked stories written by Philip Gooden, Susanna Gregory, Michael Jecks, Bernard Knight and Ian Morson under the common pseudonym of the Medieval Murderers:"]}, {"page": "Frances Hyde, Countess of Clarendon", "response": ["She appears as a character in The Piccadilly Plot, the seventh of the Thomas Chaloner mystery novels by Susanna Gregory."]}, {"page": "Unholy Alliance", "response": ["* An Unholy Alliance, a novel by Susanna Gregory"]}, {"page": "Simon Beaufort", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "Elizabeth Cruwys", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "Henry O'Brien, Lord Ibrackan", "response": ["He is a major character in The Piccadilly Plot, the seventh in the Thomas Chaloner mystery novels by Susanna Gregory."]}, {"page": "Karen Maitland", "response": ["She has co-written several titles in the Medieval Murderers series with medieval crime writers including Bernard Knight, Ian Morson, Susanna Gregory, and Philip Gooden.  She has worked as a writer and editor on a number of cross-cultural books including \"Poems of Cultural Diversity\" and \"Cinders in the Wind\". Maitland is dyslexic and resides in the medieval city of Lincoln, not very far from Sherwood Forest.", "* The Sacred Stone (2010)(Written with Bernard Knight, Ian Morson, Susanna Gregory and Philip Gooden)"]}, {"page": "William Rougham", "response": ["In Susanna Gregory's 2004 book The Hand of Justice, which is set in 1350s Cambridge, there is a physician character known as \"William Rougham of Gonville Hall\"."]}, {"page": "Physwick Hostel, Cambridge", "response": ["Physwick hostel features in several of Susanna Gregory's Matthew Bartholomew series books."]}, {"page": "University of Cambridge in popular culture", "response": ["* The Matthew Bartholomew Chronicles (1990s novels) by Susanna Gregory, is a series of murder mysteries set in and around the 14th century Cambridge and focuses on the vital work in the field of medicine undertaken by the university during this period."]}, {"page": "A Plague on Both Your Houses", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "A Conspiracy of Violence", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "Matthew Bartholomew (character)", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "Thomas Chaloner (character)", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "Liz Cruwys", "response": ["#REDIRECT Susanna Gregory"]}, {"page": "Past Poisons", "response": ["* \"To Dispose of an Abbot\" by Susanna Gregory"]}, {"page": "List of historical fiction by time period", "response": ["*Matthew Bartholomew series by Susanna Gregory"]}]}}