{"wiki_id": "http://www.wikidata.org/entity/Q3973373", "itemLabel": "Steve Moran", "itemDescription": "English footballer (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Moran", "wikipedia_page": {"main": "Stephen James Moran (born on 10 January 1961) is a former footballer who played as a striker for Southampton during the 1980s. Moran was one of the finest strikers that Southampton has possessed. He had a knack of scoring some crucial goals for the club and had a fine understanding with midfielders Steve Williams and David Armstrong.\nMoran attended Prices School in Fareham and appeared regularly for his school team, where he was spotted by scouts. He signed for Southampton in August 1979 and made his debut as a substitute in a 4–1 home win against Manchester City in January 1980, scoring with his very first touch of the ball.In the 1980–81 season, Moran scored 18 goals in 30 starts in the league, and in 1982 he was voted PFA Young Player of the Year.\nAmong the 99 goals that Moran scored for the Saints were a hat-trick in an 8–2 victory over Coventry City at The Dell in April 1984, during the club's most successful ever league season, when they finished as runners-up to Liverpool. In the same year, Moran scored an injury-time winner in the 4th Round of the FA Cup, away to arch rivals Portsmouth. David Armstrong crossed from the right and Moran arrived at the back post to volley left-footed past the Pompey 'keeper Alan Knight.\nMoran made 228 senior appearances for Southampton, including playing for them in the UEFA Cup. He was also capped twice for the England under-21 team. But he suffered from a recurring back injury and despite the promise of his early career, never represented England at senior level.\nIn 1986–87 he joined Leicester City for a transfer fee of £300,000, although at the end of the season they were relegated to Football League Division Two. During the following season he moved to Reading and he went on to make 144 senior appearances for them. For the 1991–92 season he moved on to Exeter City and after 74 senior appearances he transferred to Hull City for 1993–94.", "link_mentions": [{"page": "Southampton F.C.", "response": ["Southampton continued to progress under McMenemy's stewardship, and with a team containing Peter Shilton (the England goalkeeper), Nick Holmes, David Armstrong, striker Steve Moran and quick winger Danny Wallace reached their highest ever league finish as runners-up in 1983–84 (three points behind the champions Liverpool) as well as reaching the semi-final of the FA Cup losing 1–0 to Everton at Highbury Stadium. McMenemy then added experienced midfielder Jimmy Case to his ranks."]}, {"page": "Moran (surname)", "response": ["* Steve Moran (born 1961), English football player"]}, {"page": "1986–87 in English football", "response": ["3 January 1987 – Steve Moran scores a hat-trick in Leicester's 6–1 home win over Sheffield Wednesday which lifts the East Midlands side off the bottom of the First Division. Newcastle, who lose 2–1 at home to Coventry, now prop up the table. Everton keep up the pressure on Arsenal with a 1–0 win over QPR at Loftus Road."]}, {"page": "1984–85 in English football", "response": ["27 November 1984: QPR and Southampton play out a goalless Milk Cup replay at Loftus Road. Steve Moran has an 85th minute penalty saved by Rs' keeper Peter Hucker."]}, {"page": "1983–84 in English football", "response": ["28 April 1984: Southampton claim the biggest win of the First Division season with an 8-2 thrashing of Coventry City, with Steve Moran and Danny Wallace both scoring hat-tricks, keeping the Saints in contention for the title. Liverpool are held to a 2–2 draw at home to Ipswich Town, but Manchester United miss the chance to draw level on points with the leaders after West Ham hold them to a goalless draw at Old Trafford. QPR's faint hopes of winning the title are kept alive with a 2–1 home win over Tottenham. Sheffield Wednesday's promotion is confirmed by a 1–0 home win over Crystal Palace, and are joined in the First Division next season by Chelsea, who go up in style by beating Leeds United 5–0 at home with top scorer Kerry Dixon scoring a hat-trick, although the Second Division title has yet to be decided. Newcastle United only need four points from their final three games to be sure of promotion.Chelsea FC News. Chelsea MAD (28 April 1984). Retrieved on 2011-03-23."]}, {"page": "1981–82 in English football", "response": ["*Southampton's Steve Moran was elected as PFA Young Player of the Year."]}, {"page": "History of Southampton F.C.", "response": ["Southampton continued to progress well under McMenemy's stewardship, and with a team containing Peter Shilton, Nick Holmes, David Armstrong, top-scorer Steve Moran and Danny Wallace reached their highest ever league finish as runners-up in 1983–84 (three points behind champions Liverpool) as well as reaching the semi-final of the FA Cup, losing 1–0 to Everton at Highbury Stadium. This meant that they came closer than any other English team that season to winning the double."]}, {"page": "George Lawrence (footballer)", "response": ["In his first period at The Dell, Southampton had an abundance of strikers, including Channon and Steve Moran, together with Kevin Keegan, Steve Williams and David Armstrong in midfield, so his chances were limited. He spent the end of the 1981–82 season on loan at Oxford United and, after returning to Southampton for the start of the following season, he moved permanently to Oxford in November 1982."]}]}}