{"wiki_id": "http://www.wikidata.org/entity/Q3979057", "itemLabel": "Sydney Jordan", "itemDescription": "Scottish comics artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Jordan", "wikipedia_page": {"main": "Sydney Jordan (born Dundee, Scotland, 1928) is a comics artist best known for his daily science fiction strip  Jeff Hawke, which ran in the Daily Express from 1955 to 1974.", "link_mentions": [{"page": "Dan Dare", "response": ["In 1996, The Planet published its first and only issue. Inside was a new and unfinished Dan Dare story, \"Remembrance\", drawn by Sydney Jordan featuring a slightly older Dare and apparently set some years after the original Eagle strips."]}, {"page": "List of Dan Dare stories", "response": ["In 1996, The Planet published its first and only issue. Inside was a new and unfinished Dan Dare story, \"Remembrance\", drawn by Sydney Jordan featuring a slightly older Dare and apparently set some years after the original Eagle strips."]}, {"page": "1955 in comics", "response": ["* February 15: Sydney Jordan's Jeff Hawke makes its debut. It will run until 18 April 1974. "]}, {"page": "2005 in comics", "response": ["*November 19–20: Comic Expo (Metropole Hilton, Brighton, United Kingdom) — guests include Mark Millar, Gilbert Shelton, Dave Gibbons, Sydney Jordan, and Harry Harrison"]}, {"page": "Comic Expo", "response": ["The next BCE, held in May 2005, was a success, with guests such as J. Michael Straczynski, Michael Avon Oeming, Gary Frank, Dave Gibbons, Alan Davis, Brian Bolland,\"Heroes Swoop In To Comic Expo,\" Games Industry International (21 April 2005) Mike Ploog and Simon Bisley; as well as over 2,000 attendees.\"Comics Expo, Bristol — May 2005,\"  DownTheTubes.net. Accessed Dec. 22, 2013. The November Brighton Comic Expo was held at the prestigious Metropole Hilton, the largest conference hotel in South England. Guests included Mark Millar, Gilbert Shelton, Dave Gibbons, Sydney Jordan, and Harry Harrison. This was again successful and, with the exception of a few minor criticisms, proved immensely popular with those attending.", "| November 19–20, 2005 || Metropole Hilton (Brighton) || 2,000 || Mark Millar, Gilbert Shelton, Dave Gibbons, Sydney Jordan, and Harry Harrison || Brighton show organized with Dez SkinnCarter, Stuart. \"Comics Come to Brighton,\" Emerald City #124 (December 2005).Johnston, Rich. \"CBR Exclusives: Lying in the Gutters,\" Comic Book Resources (Aug 15, 2005)."]}, {"page": "Jeff Hawke", "response": ["Jeff Hawke was a British science fiction comic strip created by Sydney Jordan. It was published in the Daily Express from 15 February 1955 to 18 April 1974, by which point Jordan had \"written or co-written and drawn 6,474 episodes.\" Despite its obscurity in English-speaking countries, it is often regarded as one of the most important science fiction comics ever released, especially in Italy and Scandinavian countries.", "Sydney Jordan was a graduate of the Aeronautical Technical School in Reading. He long sought to draw a fantastic comic where he could exploit his skills in drawing aeroplanes. In 1955 he met Eric Souster and Jim Gilbert in London, two friends with whom he had served in the R.A.F. Together they created the character of Jeff Hawke.", "In 1969, following a number of stresses and pressures, William Patterson's contract to write Jeff Hawke came to an end.  He was not in good mental health and remained in London, separated from his family who stayed in Perth.  Willie Patterson's physical health also was affected and he died in 1986, aged only 57 years old.  He was laid to rest in Kensal Green cemetery, attended by his daughters Chrys Muirhead and Frances Patterson, and Sydney Jordan.  The 1986 Titan Books republication of Jeff Hawke, Book Two, contains a testimonial to the life of Willie Patterson, by Sydney Jordan.", "In the strip H1760, published 21 November 1959, it is possible to see a stone that commemorates the first human landing on the Moon, noting that it happened on 4 August 1969. Thus, Sydney Jordan and William Patterson forecast the real date of this event with an error of only two weeks, ten years before Neil Armstrong made the first descent to the Moon surface on July 21.The Courier", "In the introduction to The Jeff Hawke Book Two: Counsel for the Defence (Titan Books, 1986), Sydney Jordan states:", "The British Jeff Hawke Club began reprinting Jeff Hawke in its journal, Jeff Hawke's Cosmos, in 2003. Each issue includes story notes on the science featured in the story, and commentary on the origins of the tales from creator Sydney Jordan. In addition to the regular magazine, three special editions - The Martian Quartet, Lunar 10 and Hawke's Notes have also been published."]}, {"page": "Prix Saint-Michel", "response": ["* Best European artist: Sydney Jordan"]}, {"page": "List of newspaper comic strips G–O", "response": ["*Jeff Hawke (1955–1974) by Sydney Jordan (UK)"]}, {"page": "Duncan Lunan", "response": ["In 2012 Lunan published Children from the Sky, a study of the green children and the documentation related to them, illustrated by Sydney Jordan."]}, {"page": "Syd Jordan", "response": ["#redirectSydney Jordan"]}, {"page": "The Planet on Sunday", "response": ["With content that focused primarily on environmental issues, something about which Hards felt strongly, The Planet on Sundays inaugural edition set out the newspaper's agenda—calling for a reduction in international trade, something Hards felt would lead to less environmental pollution, and arguing that the United Kingdom would be better off outside the European Union. But the newspaper was noted for some bizarre stories which had a sensationalist tone, among them a report about a jilted gorilla that had resorted to violence, and a claim that sunbathing could lead to people developing AIDS-type illnesses. Also featured was a Dan Dare comic strip by Sydney Jordan and Theyen Rich, the character having been updated for the 1990s."]}]}}