{"wiki_id": "http://www.wikidata.org/entity/Q3976684", "itemLabel": "Sue Longhurst", "itemDescription": "British film actress, specialising in sex comedies", "wikipedia_url": "https://en.wikipedia.org/wiki/Sue_Longhurst", "wikipedia_page": {"main": "Sue Longhurst is an English actress who appeared in several X-rated sex comedies in the 1970s.", "link_mentions": [{"page": "Mary Millington", "response": ["* Sue Longhurst"]}, {"page": "The Karnstein Trilogy", "response": ["| Sue Longhurst"]}, {"page": "Confessions of a Window Cleaner", "response": ["* Sue Longhurst .... Jacqui Brown"]}, {"page": "Lust for a Vampire", "response": ["* Sue Longhurst as schoolgirl"]}, {"page": "John Hamill", "response": ["* Sue Longhurst"]}, {"page": "The Way of a Man with a Maid", "response": ["The Way of a Man with a Maid was adapted as a softcore exploitation film entitled What the Swedish Butler Saw (1975), starring Sue Longhurst as Alice and Ole Soltoft as Jack.Donald C. Willis, Horror and science fiction films II, Scarecrow Press, 1982, , p. 161."]}, {"page": "List of British films of 1973", "response": ["|Keep It Up, Jack||Derek Ford||Mark Jones, Sue Longhurst||Sex comedy||"]}, {"page": "List of British films of 1974", "response": ["|Just One More Time||Maurice Hamblin||John Hamill, Sue Longhurst ||Sex comedy||"]}, {"page": "Come Play with Me (1977 film)", "response": ["*Sue Longhurst as Christina ", "Much of the glamour in the film was provided by nude models popular in Sullivan's top-shelf magazines at the time (Millington, Pat Astley, Penny Chisholm, Nicola Austin), as well as more mainstream comedy actresses like Ingmar Bergman’s daughter Anna Bergman, Sue Longhurst and Suzy Mandel from The Benny Hill Show. Lower down the cast list, actresses like Lisa Taylor, Sonia Svenburger and Suzette Sangalo Bond all had blue-movie backgrounds.", "* Come Play with Me was reissued as a special edition DVD on 26 April 2010, by Odeon Entertainment. Special features on the DVD included the 1980 documentary Mary Millington's True Blue Confessions, the Harrison Marks short Sex is My Business (starring Millington), an extensive stills gallery and an 8-page essay on the making of the film, written by Simon Sheridan, with memories from actresses Anna Bergman, Sue Longhurst and Suzy Mandel."]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Sue Longhurst (actress)"]}, {"page": "Keep It Up Downstairs", "response": ["* Sue Longhurst as Lady Cockshute"]}, {"page": "Just One More Time", "response": ["Just One More Time, released theatrically as The Over-Amorous Artist, is a 1974 British sex comedy film directed by Maurice Hamblin and starring John Hamill, Sue Longhurst and Claire Russell.BFI It was followed by two sequels, Girls Come First (1975) and Under The Bed (1977), which also starred Hamill in the role of Alan Street.", "While his beautiful wife (Sue Longhurst) is at work, Alan Street (John Hamill), an artist, has to fend off the advances of his amorous female neighbours.", "*  Sue Longhurst ...  Sue  "]}, {"page": "What the Swedish Butler Saw", "response": ["What the Swedish Butler Saw is a 1975 Swedish-American erotic sex comedy film directed by Vernon P. Becker and starring Ole Søltoft, Sue Longhurst, Malou Cartwright and Diana Dors. It is known by several alternative titles including A Man with a Maid, The Groove Room and Champagnegalopp.BFI Groove Street The film is loosely based on the 1908 erotic novel The Way of a Man with a Maid.", "* Sue Longhurst as Alice Faversham"]}, {"page": "Longhurst", "response": ["*Sue Longhurst, English actress, most famous for appearing in several X-rated comedies in the 1970s"]}, {"page": "Keep It Up, Jack", "response": ["* Sue Longhurst as Virginia"]}, {"page": "Secrets of a Door-to-Door Salesman", "response": ["*Sue Longhurst – Penny"]}, {"page": "Can You Keep It Up for a Week?", "response": ["*Sue Longhurst as Mrs Bristol"]}]}}