{"wiki_id": "http://www.wikidata.org/entity/Q3973269", "itemLabel": "Sterling Davis", "itemDescription": "American basketball player-coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Sterling_Davis", "wikipedia_page": {"main": "Sterling Davis (born October 27, 1977 in Dallas, Texas, USA) is a retired basketball player and former head coach of British Basketball League club Glasgow Rocks from 2007 to 2017.A 6' 7\" power forward, Davis signed for the Rocks in 2006, after spells with fellow British sides Sheffield Sharks (2004–2006), London Towers (2003) and Brighton Bears (2001–2003), where he was a BBL All Star in 2002 and named to the All-League team in 2002 and 2003. He scored a career-high 42 points on March 1, 2011 in a game against the Guildford Heat. He spent the 2000–1 season with Argentine club Central Entrerriano.\nOriginally appointed as player-coach in Glasgow in 2007, Davis retired from playing in 2015 to focus solely on coaching. He left the Rocks in  May 2017 after reaching four major finals during his tenure.\nDavis played NCAA college basketball at Tulane University., finishing his four years with averages of 7.7 points and 3.6 rebounds. He holds UK and USA citizenship.", "link_mentions": [{"page": "Archie Moore", "response": ["In 1958, Moore had 10 fights, going 9–0–1 during that span. His fight with Yvon Durelle in particular was of note: defending his world light heavyweight title in Montreal, Quebec, Canada, he was felled three times in round one, and once again in round five, but then dropped Durelle in round 10 and won by a knockout in the 11th. 1959, his last full year as uncontested champion, was another rare low-profile year; in his two fights, he beat Sterling Davis by a knockout in three, and then Durelle again, also by a knockout in three, to once again retain his World Light Heavyweight title.", "However, at least three of Moore's 131 knockouts came in less-than-competitive matches against pro wrestlers: \"Professor\" Roy Shire in 1956, Sterling Davis in 1959 and Mike DiBiase in 1963 (Moore's 131st and final knockout). All three matches are officially listed as third-round TKO stoppages. The second-highest amount of knockouts in boxing history is 128, which belongs to Sam Langford .", "|style=\"text-align:left;\"| Sterling Davis"]}, {"page": "Sheffield Sharks", "response": ["* Sterling Davis"]}, {"page": "2006–07 British Basketball League season", "response": ["** Sterling Davis (Scottish Rocks)"]}, {"page": "Glasgow Rocks", "response": ["The 2006–07 season saw the arrival of the British league's first ever German playcaller, Thorsten Leibenath. The German continued Rocks' winning ways, and took the team to another Cup final, losing out once more to Guildford 82–79, whilst a 4th-place finish and another appearance in the final of the play-off saw the seemingly annual rivalry with Eagles revived, Newcastle again triumphed in a 95–82 victory. On 30 April 2007, the Rocks announced Leibenath was leaving the club to take over head coaching duties at his previous club Giessen 46ers in Germany. Player, and BBL veteran Sterling Davis was named as his successor, assuming a player-coach role within the team. Davis' team performed amicably throughout the 2007–08 season, but a first round exit in the Trophy and a 5th-place finish in the league and a Quarter-final exit in the post-season Play-offs to eventual Runners-up Milton Keynes Lions, 105–93, meant the Rocks had failed to appear in a major Final for the first time in six years.", "The Rocks set a club record 12-game winning streak during the early stages of the 2016–17 season, which would see the team reach the 2016–17 BBL Cup Final in Birmingham. The team lost out to rivals Newcastle, 91–83. Towards the end of the season, the club announced that the last remaining \"original\" shareholder of the club, Ian Reid, had sold his 50% share in the club to businessman Duncan Smillie. Following the end of the campaign, it was announced long term head coach Sterling Davis was to leave the club.", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "|style=\"text-align:center;\"|Sterling Davis", "| 4 ||   || Sterling Davis ||  2006–2015"]}, {"page": "2007–08 British Basketball League season", "response": ["|style=\"text-align:center\"|November||  Sterling Davis (Scottish Rocks)  ||  Anthony Paez (Worcester Wolves)", "|style=\"text-align:center\"|January||  Sterling Davis (Scottish Rocks)  ||   Jayson Obazuaye (Cheshire Jets)"]}, {"page": "List of people with surname Davis", "response": ["*Sterling Davis (born 1977), American basketball player"]}, {"page": "2010–11 British Basketball League season", "response": ["|style=\"text-align:center\"|January||   Sterling Davis (Glasgow Rocks)  ||  Trey Moore (Newcastle Eagles)"]}, {"page": "2011–12 British Basketball League season", "response": ["*Glasgow Rocks' veteran player-coach Sterling Davis reached two personal milestones in October, making his 1000th BBL Championship free-throw and 5000th point scored."]}, {"page": "2012–13 British Basketball League season", "response": ["|style=\"text-align:center\"|November||   Sterling Davis (Glasgow Rocks)  ||  Kareem Maddox (Newcastle Eagles)"]}, {"page": "2016–17 British Basketball League season", "response": ["*At the end of the season, Glasgow Rocks announced that head coach Sterling Davis would be leaving the club, bringing to an end his 11-year association with the club as a player, player-coach and head coach.", "|style=\"text-align:center\"|November||   Sterling Davis (Glasgow Rocks) ||  Rashad Hassan (London Lions)"]}]}}