{"wiki_id": "http://www.wikidata.org/entity/Q3972327", "itemLabel": "James Laidlaw Maxwell", "itemDescription": "missionary to Formosa", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Laidlaw_Maxwell", "wikipedia_page": {"main": "James Laidlaw Maxwell Senior (Pe̍h-ōe-jī: Má Ngá-kok; Chinese: 馬雅各; born 18 March 1836 in Scotland – March 1921) was the first Presbyterian missionary to Formosa (Qing-era Taiwan).  He served with the English Presbyterian Mission.\nMaxwell studied medicine at the University of Edinburgh, completing his degree in 1858 with a graduation thesis The Chemistry and Physiology of the Spleen. He worked in London at Brompton Hospital and at the Birmingham General Hospital. He was an elder in the Broad Street Presbyterian Church before being sent to Taiwan by the Presbyterian Church of England (now within the United Reformed Church) in 1864. He donated a small printing press to the church which was later used to print the Taiwan Church News.\nOn 16 June 1865, at the urging of missionaries H. L. Mackenzie and Carstairs Douglas, he established the first Presbyterian church in Taiwan, this date now celebrated by the Presbyterian Church in Taiwan as its anniversary. First his mission centred in the then-capital Taiwan Fu (now Tainan City); in 1868 he moved near Cijin (now part of Kaohsiung) where his work, both medical and missionary, became more welcomed.  In early 1872 he advised Canadian Presbyterian missionary pioneer George Leslie Mackay to start his work in northern Taiwan, near Tamsui.\nHe married Mary Anne Goodall (died January 1918) of Handsworth on 7 April 1868 in Hong Kong.  They had two sons, John Preston and James Laidlaw Jnr, both of whom later also became medical missionaries. He retired in London in 1885 where he formed and became the first secretary of the Medical Missionary Association.  He and his sons oversaw the construction of Sin-lâu Hospital in Tainan, the first western-style hospital in Taiwan. The younger J. L. Maxwell served in the Tainan hospital from 1900 to 1923, during Taiwan's Japanese era.", "link_mentions": [{"page": "Opium", "response": ["Scientific evidence of the pernicious nature of opium use was largely undocumented in the 1890s, when Protestant missionaries in China decided to strengthen their opposition to the trade by compiling data which would demonstrate the harm the drug did. Faced with the problem that many Chinese associated Christianity with opium, partly due to the arrival of early Protestant missionaries on opium clippers, at the 1890 Shanghai Missionary Conference, they agreed to establish the Permanent Committee for the Promotion of Anti-Opium Societies in an attempt to overcome this problem and to arouse public opinion against the opium trade. The members of the committee were John Glasgow Kerr, MD, American Presbyterian Mission in Canton; B.C. Atterbury, MD, American Presbyterian Mission in Peking; Archdeacon Arthur E. Moule, Church Missionary Society in Shanghai; Henry Whitney, MD, American Board of Commissioners for foreign Missions in Foochow; the Rev. Samuel Clarke, China Inland Mission in Kweiyang; the Rev. Arthur Gostick Shorrock, English Baptist Mission in Taiyuan; and the Rev. Griffith John, London Mission Society in Hankow.Lodwick, Kathleen L. (1996). Crusaders Against Opium: Protestant Missionaries in China 1874–1917. University Press of Kentucky.  These missionaries were generally outraged over the British government's Royal Commission on Opium visiting India but not China. Accordingly, the missionaries first organized the Anti-Opium League in China among their colleagues in every mission station in China. American missionary Hampden Coit DuBose acted as first president. This organization, which had elected national officers and held an annual national meeting, was instrumental in gathering data from every Western-trained medical doctor in China, which was then published as William Hector Park compiled Opinions of Over 100 Physicians on the Use of Opium in China (Shanghai: American Presbyterian Mission Press, 1899). The vast majority of these medical doctors were missionaries; the survey also included doctors who were in private practices, particularly in Shanghai and Hong Kong, as well as Chinese who had been trained in medical schools in Western countries. In England, the home director of the China Inland Mission, Benjamin Broomhall, was an active opponent of the opium trade, writing two books to promote the banning of opium smoking: The Truth about Opium Smoking and The Chinese Opium Smoker. In 1888, Broomhall formed and became secretary of the Christian Union for the Severance of the British Empire with the Opium Traffic and editor of its periodical, National Righteousness. He lobbied the British Parliament to stop the opium trade. He and James Laidlaw Maxwell appealed to the London Missionary Conference of 1888 and the Edinburgh Missionary Conference of 1910 to condemn the continuation of the trade. When Broomhall was dying, his son Marshall read to him from The Times the welcome news that an agreement had been signed ensuring the end of the opium trade within two years."]}, {"page": "Presbyterianism", "response": ["The Presbyterian Church in Taiwan (PCT) is by far the largest Protestant denomination in Taiwan, with some 238,372 members as of 2009 (including a majority of the island's aborigines). English Presbyterian Missionary James Laidlaw Maxwell established the first Presbyterian church in Tainan in 1865. His colleague George Leslie Mackay, of the Canadian Presbyterian Mission, was active in Tamsui and north Taiwan from 1872 to 1901; he founded the island's first university and hospital, and created a written script for Taiwanese Minnan. The English and Canadian missions joined together as the PCT in 1912. One of the few churches permitted to operate in Taiwan through the era of Japanese rule (1895–1945), the PCT experienced rapid growth during the era of Kuomintang-imposed martial law (1949–1987), in part due to its support for democracy, human rights, and Taiwan independence. Former ROC president Lee Teng-hui (in office 1988–2000) was a Presbyterian."]}, {"page": "Prohibition of drugs", "response": ["The missionary organizations were outraged over the Royal Commission on Opium's conclusions and set up the Anti-Opium League in China; the league gathered data from every Western-trained medical doctor in China and published Opinions of Over 100 Physicians on the Use of Opium in China. This was the first anti-drug campaign to be based on scientific principles, and it had a tremendous impact on the state of educated opinion in the West. In England, the home director of the China Inland Mission, Benjamin Broomhall, was an active opponent of the opium trade, writing two books to promote the banning of opium smoking: The Truth about Opium Smoking and The Chinese Opium Smoker. In 1888, Broomhall formed and became secretary of the Christian Union for the Severance of the British Empire with the Opium Traffic and editor of its periodical, National Righteousness. He lobbied the British parliament to ban the opium trade. Broomhall and James Laidlaw Maxwell appealed to the London Missionary Conference of 1888 and the Edinburgh Missionary Conference of 1910 to condemn the continuation of the trade. As Broomhall lay dying, an article from The Times was read to him with the welcome news that an international agreement had been signed ensuring the end of the opium trade within two years."]}, {"page": "Taiwanese Hokkien", "response": ["The first translation of the Bible in Amoy or Taiwanese in the pe̍h-ōe-jī orthography was by the first missionary to Taiwan, James Laidlaw Maxwell, with the New Testament Lán ê Kiù-chú Iâ-so͘ Ki-tok ê Sin-iok published in 1873 and the Old Testament Kū-iok ê Sèng Keng in 1884."]}, {"page": "Timeline of Christian missions", "response": ["* 1865 – The China Inland Mission is founded by James Hudson Taylor; James Laidlaw Maxwell plants first viable church in Taiwan. Salvation Army founded in London by William Booth. Van Dyck Bible (in Arabic) completed. "]}, {"page": "James Maxwell", "response": ["*James Laidlaw Maxwell Jr (1876–1951), English Presbyterian medical missionary to China (son of James Laidlaw Maxwell)", "*James Laidlaw Maxwell (1836–1921), missionary to Formosa"]}, {"page": "George Leslie Mackay", "response": ["After consulting with Dr. James Laidlaw Maxwell Sr., a medical doctor serving as a Presbyterian Church of England missionary to southern Formosa (1865), Mackay arrived at Tamsui, northern Formosa in 1872, which remained his home until his death in 1901.  Starting with an itinerant dentistry practice amongst the lowland aborigines, he later established churches, schools and a hospital practicing Western biomedicine.  "]}, {"page": "John Preston Maxwell", "response": ["John Preston Maxwell (5 December 1871 – 25 July 1961), son of James Laidlaw Maxwell, was a Presbyterian obstetric missionary to China.Maxwell, John Preston - Biographical entry - Plarr's Lives of the Fellows Online", "John Preston Maxwell was born on 5 December 1871 in Birmingham, where his father Dr James Laidlaw Maxwell, practised medicine. He attended University College School and University College London, before taking his clinical training at St Bartholomew's Hospital, from which he emerged with a gold medal in obstetrics and went on to work as a resident at St Bartholomew's. Then, following his devout Presbyterian faith, Maxwell became a Medical missionary for the English Presbyterian Church and, in about 1898, went to Fujian in China, where he spent the majority of his professional life. He worked at Yungchun Hospital, Fujian, from 1899 to 1919, and Changpoo, Amoy.", "Papers of John Preston Maxwell are held at the Cadbury Research Library (University of Birmingham) along with papers of his father, James Laidlaw Maxwell."]}, {"page": "Presbyterian Church in Taiwan", "response": ["The Presbyterian Church in Taiwan was started in the 19th century by James Laidlaw Maxwell of the Presbyterian Church of England in the Southern Taiwan, and George Leslie Mackay of the Presbyterian Church in Canada in the Northern Taiwan. In Taiwan, Presbyterians have historically been active in promoting the use of the local vernacular Taiwanese, both during the Japanese colonial period, as well as after the transfer of rulership to the Republic of China (ROC), during which the exclusive use of Mandarin was legally mandated.  Also, the church has historically been an active proponent of human rights and democracy in Taiwan, a tradition which began during the Japanese colonial period and extended into the martial law period of the ROC.  "]}, {"page": "James Laidlaw Maxwell Jr", "response": ["James Laidlaw Maxwell, Junior (; 1876 – 12 August 1951) was a pioneering modern English Presbyterian medical missionary to Formosa (Taiwan) and China.  He was the son of James Laidlaw Maxwell, Senior. "]}, {"page": "Pe̍h-ōe-jī", "response": ["A great boon to the promotion of POJ in Taiwan came in 1880 when James Laidlaw Maxwell, a medical missionary based in Tainan, donated a small printing press to the local church, which Thomas Barclay learned how to operate in 1881 before founding the Presbyterian Church Press in 1884. Subsequently, the Taiwan Prefectural City Church News, which first appeared in 1885 and was produced by Barclay's Presbyterian Church of Taiwan Press, became the first printed newspaper in Taiwan."]}, {"page": "Royal Brompton Hospital", "response": ["*James Laidlaw Maxwell, Physician"]}, {"page": "James L. Maxwell", "response": ["#redirectJames Laidlaw Maxwell"]}, {"page": "Thomas Barclay (missionary)", "response": ["While at the Divinity College, Barclay had met Carstairs Douglas, brother of the principal of the college and missionary in Amoy (Xiamen). Douglas inspired Barclay and his friends to move east, with Mackichan heading to Bombay, Gibson to Swatow and Barclay to Formosa (Taiwan). He would later joke that he was chosen over Gibson for Formosa because of his longer legs, the better to navigate the hillier country in southern Taiwan. In 1885, after a year spent in Amoy learning the Amoy dialect under Douglas, Barclay moved to Taiwan-fu, the then capital of Qing-era Taiwan, where he was to spend the rest of his life in service to the church and the people of that city. He was the fifth missionary from the Presbyterian Church of England to be stationed in Taiwan-fu, after James Laidlaw Maxwell, Hugh Ritchie, William Campbell and Matthew Dickson. He was responsible for introducing the first newsletter in Taiwanese Hokkien, which was also the first printed newspaper in Taiwan in any language, the Taiwan Church News, printed using the Peh-oe-ji romanisation."]}, {"page": "John Thomson (photographer)", "response": ["He went on to visit the island of Formosa (modern-day Taiwan) with the missionary Dr. James Laidlaw Maxwell, landing first in Takao in early April 1871. The pair visited the capital, Taiwanfu (now Tainan), before travelling on to the aboriginal villages on the west plains of the island. After leaving Formosa, Thomson spent the next three months travelling 3,000 miles up the Yangtze River, reaching Hupeh and Szechuan."]}, {"page": "Benjamin Broomhall", "response": ["For a while, Benjamin was Secretary of the Anti-slavery Association, one of many British anti-slavery societies formed during the mid-nineteenth century. His later interest in introducing Christianity into China, led to familiarity with Chinese slavery and opium addiction. Long opposed to the former, he also became an active opponent of the Opium trade, writing two books to promote the banning of opium smoking: “Truth about Opium Smoking” and “The Chinese Opium Smoker”. In 1888 Broomhall formed and became Secretary of the Christian Union for the Severance of the British Empire with the Opium Traffic and editor of its periodical, \"National Righteousness\". He lobbied the British Parliament to stop the opium trade. He and James Laidlaw Maxwell appealed to the London Missionary Conference of 1888 and the Edinburgh Missionary Conference of 1910 to condemn the continuation of the trade. When Broomhall was dying, his son Marshall read to him from The Times the welcome news that an agreement had been signed ensuring the end of the opium trade within two years. Benjamin and Amelia Broomhall were buried in London in the Abney Park Cemetery."]}, {"page": "List of Christian missionaries", "response": ["*James Laidlaw Maxwell – among the first modern missionaries to Taiwan"]}, {"page": "Protestant missions in China", "response": ["In Britain, the home director of the China Inland Mission, Benjamin Broomhall, was an active opponent of the opium trade; he wrote two books to promote banning opium smoking: Truth about Opium Smoking and The Chinese Opium Smoker. In 1888 Broomhall formed and became secretary of the \"Christian Union for the Severance of the British Empire with the Opium Traffic\" and editor of its periodical, National Righteousness. He lobbied the British Parliament to stop the opium trade. He and James Laidlaw Maxwell appealed to the London Missionary Conference of 1888 and the Edinburgh Missionary Conference of 1910 to condemn the trade. As he lay dying, the government signed an agreement to end the opium trade within two years."]}, {"page": "List of Protestant missionaries in China", "response": ["| James Laidlaw Maxwell", "| James Laidlaw Maxwell, Junior"]}, {"page": "English Presbyterian Mission", "response": ["*James Laidlaw Maxwell, missionary to Taiwan sent by the Presbyterian Church of England"]}, {"page": "Template talk:WikiProject Biography/Missing", "response": ["*James Laidlaw Maxwell"]}, {"page": "Medical missions in China", "response": ["Medical mission work in Taiwan was begun by the Dr. James Laidlaw Maxwell in 1865. Maxwell was the father of two notable medical missionaries to China, Profs. James Preston Maxwell and James Laidlaw Maxwell, Junior. Preston worked as professor of gynecology at the Peking Union Medical College, and James Junior worked in the former China Medical Association and as Far East Secretary of the Mission to Lepers. James Junior finally returned to China early in 1949 to serve as a leprosy specialist at Hangzhou, as well as acting as professor of medicine in the Zhejiang Medical College. He died there in 1951, and had earned the respect of the Government of the People's Republic, which was represented at his funeral. The \"Maxwell Memorial Centre\" at Hay Ling Chau, Hong Kong, is named after him."]}, {"page": "Outline of Taiwan", "response": ["*James Laidlaw Maxwell"]}, {"page": "Index of Taiwan-related articles", "response": ["Ma Bufang - Ma Buqing - Ma Chengxiang - Christine Chow Ma - Ma Ho-ling - Ma Ying-jeou - Made in Taiwan - Magong Airport - Mainlander - Mako Guard District - Manchu People in Taiwan - Mandarin Airlines - Mandarin Daily News - Mandarin Phonetic Symbols II - Mandarin Training Center - Mandopop - Manhua - Maokong - 19 March 2004 assassination attempt in Taiwan - Market Place by Jasons - Oryoku Maru - Matsu Islands - Tagawa Matsu - Mayday (Taiwanese band) - Mayor of New Taipei - Mayor of Taipei - James Laidlaw Maxwell - Mazu (goddess) - MC HotDog - Media in Taiwan - Mega International Commercial Bank - Mengjia Longshan Temple - Merida Bikes - Mexicali - Miao-li - Military Assistance Advisory Group - Military dependents' village - Military of the Republic of China - Million Voices Against Corruption, President Chen Must Go - Min Sheng Bao - Mingtan Dam - Minguo calendar - Ministry of Justice Investigation Bureau - Minsheng Road - Miramar Entertainment Park - Mitsukoshi - Mo Teh-hui - MoCA Taipei - Modern History of Taiwanese in 400 Years - Modern Literal Taiwanese - Monga (film) - Mongolian barbecue - Mongolians in Taiwan - Mongolian and Tibetan Affairs Commission - Mongolian and Tibetan Cultural Center - Monopoly Bureau - Morrison Academy - Akashi Motojiro - Mr. Brown Coffee - MTV Mandarin - Mudan Incident of 1871 - Murder of Wong Chinan - Museum of World Religions - Music of Taiwan - MV Maersk Alabama"]}, {"page": "William Campbell (missionary)", "response": ["Campbell arrived in Qing-era Taiwan in 1871 to begin his mission in southern Taiwan, being stationed in Taiwan-fu, the capital of Taiwan Prefecture (modern-day Tainan) and serving both Han Chinese and Taiwanese aborigines in the area. He was a contemporary of Thomas Barclay, James Laidlaw Maxwell and George Leslie Mackay, who were all engaged in missionary work in Taiwan."]}, {"page": "Taiwan Church News", "response": ["In Taiwan in the late 1800s (during Taiwan's Qing era), only the educated elite could read and write. Christian missionaries in southern Taiwan were anxious that their congregations should learn to read and write, and were convinced that romanised script (i.e. Pe̍h-ōe-jī) was easier to learn than Chinese characters. James Laidlaw Maxwell, a medical missionary, donated a small printing press to the church in 1880,"]}, {"page": "Maxwell (surname)", "response": [":*James Laidlaw Maxwell (1836–1921), missionary to Formosa", ":*James Laidlaw Maxwell Jr (1876–1951), English medical missionary to China"]}, {"page": "Christianity in Taiwan", "response": ["The first Presbyterian mission started in 1865, with the arrival of James Laidlaw Maxwell of the Presbyterian Church of England in Taiwan-fu (Tainan). His colleague George Leslie Mackay of the Presbyterian Church in Canada arrived in 1871, settling in Danshui. Mackay traveled widely throughout the island, and founded numerous churches. He also founded Tamsui Oxford College (now Aletheia University) in 1882, and Mackay Memorial Hospital (which NB, is named for a different Mackay) in 1880.MacKay, George Leslie. From Far Formosa. 1895, 316. In 1949, the Presbyterian Church (USA) joined these northern and southern jurisdictions together as the Presbyterian Church in Taiwan (PCT). The PCT doubled its membership between 1955 and 1965, perhaps as a result of its outspoken support for democratization, human rights, and Taiwan independence (against the view of the Kuomintang regime that as a notional province of the Republic of China (Taiwan), democratic elections in Taiwan would have to await the military reconquest of the mainland)."]}, {"page": "1836 in Scotland", "response": ["* 18 March – James Laidlaw Maxwell, Presbyterian missionary in Taiwan (died 1921)"]}]}}