{"wiki_id": "http://www.wikidata.org/entity/Q3984808", "itemLabel": "Terry Dene", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Dene", "wikipedia_page": {"main": "Terry Dene (born Terence Williams, 20 December 1938) is a British rock music singer popular in the late 1950s and early 60s. He had three Top Twenty hits between June 1957 and May 1958.", "link_mentions": [{"page": "Decca Records", "response": ["British Decca had several missed opportunities. In 1960, they refused to release \"Tell Laura I Love Her\" by licensed artist Ray Peterson and even destroyed thousands of copies of the single. In 1962, Decca infamously turned down a chance to record The Beatles, believing \"guitar groups are on the way out.\"The Beatles (2000). The Beatles Anthology. San Francisco: Chronicle Books. Other refusals of note include the Yardbirds, the Kinks, the Who, and Manfred Mann. Decca had earlier accepted London-born pioneer rock'n'roll singer Terry Dene, who was later known as the British Elvis Presley, and another Merseyside singer, Billy Fury."]}, {"page": "Tommy Steele", "response": ["In 1958, Steele had the opportunity to work with his younger brother, Colin Hicks, during a tour in which the latter replaced one of the other performers, Terry Dene, who had withdrawn for psychiatric reasons.See entries under Colin Hicks and Terry Dene."]}, {"page": "Elephant and Castle", "response": ["* Rock singer Terry Dene was born in Lancaster Street on 20 December 1938."]}, {"page": "Golden Age (disambiguation)", "response": ["* \"The Golden Age\", by Terry Dene, 1958"]}, {"page": "Gordon Mills", "response": ["At a party given by singer Terry Dene, Mills met model Jo Waring and they married two years later. Their daughter Clair, then three years old, became the subject of the 1972 song \"Clair\" by Gilbert O'Sullivan."]}, {"page": "Six-Five Special", "response": ["Among the artists on the show were Petula Clark, Jim Dale, Johnny Dankworth, Terry Dene, Lonnie Donegan, Russ Hamilton, Cleo Laine, Joan Regan, Finlay Currie, boxer Freddie Mills, Wee Willie Harris, Jimmy Lloyd, Marty Wilde, the Dallas Boys and Tommy Steele."]}, {"page": "List of Decca Records artists", "response": ["* Terry Dene"]}, {"page": "Kenny Clayton", "response": ["Clayton studied piano at the Trinity College of Music in London.  In the late 1950s, by the age of twenty-one, Clayton firmly established himself as a working pianist and accompanied Alma Cogan and Terry Dene on a tour of the Empire Theatres, as well as working in cabaret with Shani Wallis, Jeannie Carson, Libby Morris, and Joan Turner."]}, {"page": "Brian Locking", "response": ["Locking was born on 22 December 1938 in Bedworth, Warwickshire, England and attended St. Anne's School, Spittlegate, and the at Huntingtower Road School. After leaving school he worked as a fireman and trainee train driver for British Railways. He began playing double bass in several bands, and was a member of The Harmonica Vagabonds, subsequently called The Vagabonds Skiffle Group; he performed regularly at The 2i's Coffee Bar in Soho, London, where he was asked to tour with Terry Dene and with fellow Grantham-based rocker Vince Eager, whom he had performed with in The Vagabonds."]}, {"page": "Clem Cattini", "response": ["Born to Italian parents living in Stoke Newington, North London, England, Cattini worked in his father's restaurant before deciding to pursue a career in music. He began as a drummer at the 2i's Coffee Bar, backing performers such as Terry Dene, before joining the touring band known as the Beat Boys, backing singers managed by Larry Parnes,Larkin C., Virgin Encyclopedia of Sixties Music, (Muze UK Ltd, 1997), , p.101 including Marty Wilde and Billy Fury. He then joined Johnny Kidd & the Pirates, playing on their hit \"Shakin' All Over\", and became Joe Meek's in-house drummer, backing artists such as John Leyton and Don Charles, before helping found the Tornados in 1961, and playing on their international No. 1 hit \"Telstar\"."]}, {"page": "Larry Parnes", "response": ["After Steele's success, Parnes looked to find other young men who he could groom to become pop stars. At Bart's suggestion, he next signed Reg Patterson (né Smith), whom he re-christened Marty Wilde, and who also rose to pop stardom in the UK.  Parnes developed a network of contacts within the British recording industry and entertainment business, with leading British songwriters providing songs for his growing stable of talent, and many of his protégés achieving success in the UK Singles Chart.  A flamboyant gay man, Parnes' approach was to select, and then groom, handsome young men who would be attractive to a teenage audience. He also gave them new stage names, which were rumoured to reflect what he considered to be their sexual characteristics.  Among those he managed with at least some degree of success were Billy Fury (originally Ron Wycherley), Vince Eager (Roy Taylor), Dickie Pride (Richard Knellar), Lance Fortune (Chris Morris), Duffy Power (Ray Howard), Johnny Gentle (John Askew), Terry Dene (Terence Williams), Nelson Keene (Malcolm Holland), and Georgie Fame (Clive Powell).  He also managed Tommy Bruce, as well as Joe Brown, who he unsuccessfully tried to persuade to change his name to Elmer Twitch."]}, {"page": "The 2i's Coffee Bar", "response": ["Several recording stars were discovered at, or performed at, the coffee bar, including Rory Blackwell, Tommy Steele, The Vipers Skiffle Group, Cliff Richard, Hank Marvin, Bruce Welch, Brian Bennett, Tony Meehan, Jet Harris, Brian 'Licorice' Locking, Vince Eager, Terry Dene, Wee Willie Harris, Adam Faith, Carlo Little, Joe Brown, Clem Cattini (The Tornados), Eden Kane, Screaming Lord Sutch, Tony Sheridan, Keith Kelly, Timothy Fitzpatrick, Lance Fortune, Albert Lee, Johnny Kidd, Paul Gadd (later to be known as Paul Raven and then Gary Glitter), Ritchie Blackmore, Alex Wharton, Mickie Most (as the Most Brothers), Big Jim Sullivan, Joe Moretti, Vince Taylor, Duffy Power, Johnny Gentle, Keith Kelly, Michael Cox, Kris Kristofferson, Derry and the Seniors and Georgie Fame. Notable non-musical names among the 2i's clientele included Diana Dors, Michael Caine, Terence Stamp and Francis Bacon.", "* Terry Dene & The Dene Aces (late 1957 – early 1959)"]}, {"page": "Trevor Williams (bassist)", "response": ["In 2009, Williams joined Blue Pulse, releasing, in May 2012, an album entitled Trams, largely featuring his own material.  The band has also served as backing band for vintage UK rock star, Terry Dene."]}, {"page": "Edna Savage", "response": ["She auditioned twice for the BBC before making her first broadcast, in 1954. She recorded a number of records, only one of which charted, \"Arrivederci Darling\" in 1956, which made it to No. 19 in the UK Singles Chart. In 1957 she participated in the UK qualifying heat for the Eurovision Song Contest. In addition to being briefly married to fellow singer Terry Dene, Savage married three more times."]}, {"page": "Rory Blackwell", "response": ["Blackwell founded the first British rock and roll band, and put on rock and roll at Studio 51 in September 1956, and at The 2i's Coffee Bar and on 24 January 1957 gave his first job to Terry Dene, then Terry Williams, fronting him at the Razzle Dazzle Club billed as \"the new singing sensation Terry Williams\"."]}, {"page": "A White Sport Coat", "response": ["* In UK the song was a notable hit for the English rock and roll singer Terry Dene, which reached #18 in the UK Charts. A recording by The King Brothers peaked at #6. Both of these versions hit in early summer 1957."]}, {"page": "Boy Meets Girls", "response": ["The show was presented and produced by Jack Good.  Marty Wilde was the principal resident male artist and The Vernons Girls were the female residents. Joe Brown made regular appearances. Other artists appearing included Terry Dene, Freddy Cannon, Little Tony & His Brothers, Adam Faith and Cliff Richard."]}, {"page": "1958 in British music", "response": ["*The Golden Disc, starring Lee Patterson and Terry Dene  Renown Pictures Ltd, PO Box 592,Kings Langley, Herts WD4 4DB"]}, {"page": "Dickie Pride", "response": ["This was followed by tours, television and, in March 1959, his debut single, \"Slippin' and Slidin'\" (a cover of a song made famous by Little Richard). Pride made eight appearances on the first teenage all-music TV show, Oh Boy! He also performed in 'The Big Beat Show' at Southend with Marty Wilde, Billy Fury, Terry Dene, Johnny Gentle, Duffy Power and Sally Kelly. However, the commercial performance of most of Pride's recordings was far below expectations. The only Pride single that ever made it into the Top 40 in the UK Singles Chart, \"Primrose Lane\", appeared in October 1959 for only one week at No. 28."]}, {"page": "Saturday Club (BBC Radio)", "response": ["In October 1958, the programme was extended to two hours, from 10 am to 12 noon on Saturday mornings. The word \"skiffle\" was dropped from the title, its budget was increased, and a wider range of performers began to appear. These included Cliff Richard, Adam Faith, Chris Barber, Humphrey Lyttelton, Marty Wilde, Terry Dene, Vince Taylor, Johnny Kidd, Michael Holliday, Bert Weedon and Clinton Ford. Brian Matthew relaxed his style, and often started the show saying \"Hello my ole mateys.\"  The show consisted mainly of pre-recorded \"live\" performances, because of \"needle time\" restrictions on the number of records that could be played by the BBC. Most programmes had four live acts and only contained around six record requests and three new releases. The theme music was \"Saturday Jump\", which was written by Jimmy Grant (under his pseudonym of Eddie James) and performed by Ted Heath."]}, {"page": "Colin Hicks & The Cabin Boys", "response": ["In November 1957, the British music magazine, NME, reported that Steele's manager, Larry Parnes had signed up Hicks, and that Hicks would undertake a ten-week variety tour with Marty Wilde. In March the following year, the same source stated that Hicks and Wilde were fulfilling contracted dates, left after Terry Dene had been diagnosed as unfit to continue touring. In 1958 they had some television appearances, and a recording contract with Pye Records, and released a few singles with the label. However, he did not achieve the same level of success as his brother."]}, {"page": "British rock and roll", "response": ["Amid the limited vitality of late 1950s and early 1960s British rock and roll, there were some more dynamic acts. These included Billy Fury, whose rockabilly-style compositions, aided by the guitar of Joe Brown, on his \"masterpiece\" 1960 LP Sound of Fury are considered some of the best work of the era.V. Bogdanov, C., Woodstra, S. T. Erlewine, All Music Guide to Rock: The Definitive Guide to Rock, Pop, and Soul (Backbeat Books, 3rd edn., 2002), p. 442. Tony Sheridan, Vince Taylor and Screaming Lord Sutch and the Savages also produced some work that could be compared with American rock and roll.  Other singers who issued records of note included Terry Dene, \"a fine rock'n'roll vocalist\"; Johnny Brandon, who toured the US in 1956 billed as \"the King of Rock & Roll\"; Dickie Pride, Roy Young, and Helen Shapiro.  The only act to create what has been described as \"a pre-Beatle rock classic\", were Johnny Kidd & the Pirates, whose song \"Shakin' All Over\" managed to become a rock and roll standard."]}, {"page": "The Cat's Whisker", "response": ["Together with The 2i's Coffee Bar, The Cat's Whisker from Biography (Extract from 'Skiffle the Definitive Inside Story') later spearheaded the nascent pop scene, with appearances by 'before-they-were-famous' musicians like Cliff Richard, Lonnie Donegan, Terry Dene, Tommy Steele, guitarist Barry Warren, the Chas McDevitt Skiffle Group and other artists who dropped by to unwind after working the nearby nightspots Churchill's, the Bag O'Nails, Coconut Grove, Cabaret and Eve. Like Feller and Ballisteras, the musicians were generally \"paid with coffee and Cokes\". The place was reputed to be the largest seller of Coca-Cola in Britain at the time."]}, {"page": "Teenage Dream", "response": ["*\"Teenage Dream\", a 1957 song by Terry Dene"]}, {"page": "Dreamboats and Petticoats (compilation album)", "response": ["# Terry Dene - A White Sport Coat"]}, {"page": "Paolo Baltaro", "response": ["As producer, he has worked with Jazz Bigbox (Banksville), Even Vast (Black Lotus), Gabriel Delta (Banksville), McAllan (Ariston), Arcansiel (Musea), Roulette Cinese (Toast), Società Anonima Decostruzionismi Organici (Btf-Ams), Mhmm (Banksville), Sorella Maldestra (Banksville), Terry Dene and Lica Cecato.", "*2011: The Rock Is Rolling Again con Terry Dene and Gabriel Delta (Banksville Records) (unreleased)"]}, {"page": "Banksville Records", "response": ["Arcansiel, Endless Pain,http://www.endlesspain.it/Fabrizio Consoli, Mhmm,. www.mhmm.biz. Retrieved 10 November 2011. Società Anonima Decostruzionismi Organici,. www.societaanonimadecostruzionismiorganici.com. Retrieved 10 November 2011. Toxic Poison,TOXIC POISON Official website. Toxicpoison.com. Retrieved 10 November 2011. Paolo Baltaro,. www.paolobaltaro.com. Retrieved 10 November 2011. Terry Dene, Gabriel Delta and the Hurricanes,Gabriel Delta & the Hurricanes |. Gabrieldelta.com. Retrieved 10 November 2011. Maimale, Black Monday,BLACK MONDAY – Un metal-core, che nasce da ritmi catapultati a sorpresa nella vita della Band – Vercelli Oggi . Pmnet.it (17 April 2009). Retrieved 10 November 2011. Sorella Maldestra,. www.banksvillerecords.com. Retrieved 10 November 2011. Cesare Bardelli,Cesare Bardelli. Cesare Bardelli. Retrieved 10 November 2011. Sandro Marinoni// www.sandromarinoni.com //. // www.sandromarinoni.com //. Retrieved 10 November 2011."]}, {"page": "The Golden Disc", "response": ["The Golden Disc (also known as The In-Between Age) is a 1958 British pop musical film. It features pop singer Terry Dene as himself in a story in which he tops the best-seller charts, whereas in his real life he never made the top ten. The film was directed by Don Sharp, who was married to the leading lady  Mary Steele.Don Sharp obituary at The IndependentGOLDEN DISC, The", "* Terry Dene as himself", "The film was shot at Walton Studios. It was a vehicle for Terry Dene who had three top twenty hits in Britain. ", "* ‘C’min and be Loved’ (by Len Paverman) performed by Terry Dene", "* ‘Charm’ (by Ray Mack, Philip Green) performed by Terry Dene", "* ‘Candy Floss’ (by Len Paverman) performed by Terry Dene", "‘The Golden Age’ (by Michael Robbins, Richard Dix) performed by Terry Dene."]}, {"page": "A Boy Without a Girl", "response": ["*Terry Dene released a version as a single in the United Kingdom in August 1959."]}, {"page": "Dene (disambiguation)", "response": ["* Terry Dene (born 1938), British pop singer"]}, {"page": "Start Movin' (In My Direction)", "response": ["*Terry Dene released a version of the song which reached number 15 on the UK Singles Chart in 1957."]}, {"page": "Paul Lincoln", "response": ["The 2i's became known as \"a recruiting centre for the first generation of London rockers\" and \"a haven for managers and agents on the hunt for fresh talent\". Musicians such as Cliff Richard, Adam Faith, Ritchie Blackmore, Lionel Bart, and Tommy Steele went on to launch their careers in the 2i's. Lincoln recruited the bouncer of the 2i's, Peter Grant, as a wrestler. In addition to running the 2i's, Lincoln also managed the musicians Terry Dene, Wee Willie Harris, and Kris Kristofferson, as well as the band Les Hobeaux."]}]}}