{"wiki_id": "http://www.wikidata.org/entity/Q3997893", "itemLabel": "John Bannerman", "itemDescription": "British historian (1932-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bannerman_(historian)", "wikipedia_page": {"main": "John Walter MacDonald Bannerman (13 August 1932 – 8 October 2008) was a Scottish historian, noted for his work on Gaelic Scotland.", "link_mentions": [{"page": "Dál Riata", "response": ["Since it has been thought that Dál Riata swallowed Pictland to create the Kingdom of Alba, the later history of Dál Riata has tended to be seen as a prelude to future triumphs.The titles alone of John Bannerman's \"The Scottish Takeover of Pictland\" and Richard Sharpe's \"The thriving of Dalriada\" tell their own story. The annals make it clear that the Cenél Gabraín lost any earlier monopoly of royal power in the late 7th century and in the 8th, when Cenél Loairn kings such as Ferchar Fota, his son Selbach, and grandsons Dúngal and Muiredach are found contesting for the kingship of Dál Riata. The long period of instability in Dál Riata was only ended by the conquest of the kingdom by Óengus mac Fergusa, king of the Picts, in the 730s. After a third campaign by Óengus in 741, Dál Riata then disappears from the Irish records for a generation."]}, {"page": "Kenneth III of Scotland", "response": ["The primary sources concerning the life and \"reign\" of Giric include chronicle entries dating to the years 1251 and 1317. They can be found in The Chronicles of the Picts and Scots of William Forbes Skene. The chronicle of John of Fordun (14th century) mentions Giric as \"Grim\" or \"Gryme\", reporting him killed by Malcolm II of Scotland. Charles Cawley, a modern genealogist, cautions about the late date of these sources. Giric is not mentioned by earlier sources, which would make his existence questionable. John Bannerman theorised that mac Duib, the Gaelic patronymic of Kenneth III, evolved to the surnames Duff and MacDuff, and that Kenneth III could be a direct ancestor to Clan MacDuff, which produced all Mormaers and Earls of Fife from the 11th to the mid-14th century, noting that Giric could be the actual founder of the house, following a pattern of several Scottish clans seemingly founded by grandsons of their eponym.Bannerman, MacDuff of Fife, p. 22-26, 38"]}, {"page": "Dúnchad mac Conaing", "response": ["The death of Dúnchad mac Conaing in battle is reported in the Annals of Tigernach in 654: \"... there fell Dúnchad, son of Conaing, and Congal, son of Ronan\".A.O. Anderson, ESSH, p. 172. John Bannerman proposed that this Dúnchad was the same person as the Dúnchad or Dúngal who is found as joint ruler with Conall Crandomna.A.O. Anderson, ESSH,  pp. 176–177, note 7; Bannerman, Studies, p. 103. Dúnchad mac Conaing appears in the Senchus fer n-Alban: \"These are the sons of Conaing, son of Áedán .i. Rigallán, Ferchar, Artán, Artúr, Dondchad, Domungart, Nechtan, Ném, Crumíne.Bannerman, Studies, p. 48."]}, {"page": "Áedán mac Gabráin", "response": ["The Rawlinson B 502 manuscript, dated to c. 1130, contains the tale Gein Branduib maic Echach ocus Aedáin maic Gabráin (The Birth of Brandub son of Eochu and of Aedán son of Gabrán). In this story, Áedán is the twin brother of Brandub mac Echach, a King of Leinster who belonged to the Uí Cheinnselaig kindred. Áedán is exchanged at birth for one of the twin daughters of Gabrán, born the same night, so that each family might have a son. The Prophecy of Berchán also associates Áedán with Leinster. John Bannerman concluded that \"[t]here seems to be no basis of fact behind these traditions.\"Bannerman, pp. 89–90 Francis John Byrne suggested that the Echtra was written by a poet at the court of Diarmait mac Maíl na mBó, an 11th-century descendant of Brandub, and was written to cement an alliance between Diarmait and the Scots king Máel Coluim mac Donnchada (\"Malcolm III\"), who claimed to be a descendant of Áedán.Byrne, \"Ireland and her neighbours\", p. 897. Fraser, p. 296, notes that \"the 'discovery' of a genealogical link\" was a common result of an alliance. A lost Irish tale, Echtra Áedáin mac Gabráin (The Adventures of Áedán son of Gabrán), appears in a list of works, but its contents are unknown.MacQuarrie, p. 109. The Echtra Áedáin mac Gabráin is listed in  Áedán is a character in the epic Scéla Cano meic Gartnáin, but the events which inspired the tale appear to have taken place in the middle of the 7th century.M.O. Anderson, pp. 154–155. MacQuarrie, pp. 167–170, discusses the tale, describing it as a \"pseudo-historical romance\". He also appears in the tale Compert Mongáin.Wiley, Dan M. (2004) \"The Cycles of the Kings: Compert Mongáin\"  Hastings College. Retrieved 16 September 2009."]}, {"page": "Clan MacNeil", "response": ["The chief of the Gigha MacNeills at this time was Neill MacNeill, who was killed in about 1530. His only daughter inherited his lands and handed them over to her illegitimate brother, Neill. According to historian John Bannerman, while the lands of the chief passed to his daughter, the chiefship passed over to Torquil who was her second cousin. Bannerman considered it likely that when Torquil died, the chiefship passed to the illegitimate Neill."]}, {"page": "List of University of Glasgow people", "response": ["* John Bannerman, historian, noted for his work on Gaelic Scotland", "* John Bannerman, Baron Bannerman of Kildonan"]}, {"page": "Gartnait II", "response": ["John Bannerman proposed that this Gartnait was to be identified with the son of Áedán mac Gabráin found in the genealogies known as Cethri Primchenela dail Riata attached to the Senchus fer n-Alban, and furthermore with the Gartnait whose kin were active on the isle of Skye during the 7th and early 8th centuries.Bannerman, Studies, p.92–94; Smyth, Warlords and Holy Men, p. 70. T. F. O'Rahilly had earlier rejected the identification of \"Gartnait son of Áedán\" with the eponym of the Skye kindred who is called Gartnait son of Accidán in the Irish annals.Anderson, Kings and Kingship, pp. 154–155; Smyth, Warlords and Holy Men, pp. 79–80; Charles-Edwards, Chronicle of Ireland, volume I, p. 146 (649:4). The most recent study, by Fraser, rejects the existence of Gartnait son of Áedán outright, presuming this person to have been a genealogical fiction created in the early 8th century to bolster the ambitions of Cenél nGartnait, descendants of Gartnait son of Accidán, to rule in Kintyre.Fraser, Caledonia to Pictland, pp. 204–205 & 250."]}, {"page": "Fothad II", "response": ["Fothad II was the bishop of St Andrews (1059–1093) for most of the reign of King Máel Coluim III mac Donnchada (reigned 1058–1093). Alternative spellings include Fodhoch, Fothach and Foderoch,  and Fothawch (by Andrew of Wyntoun). A \"Modach filius Malmykel\" is mentioned in a grant, dated 1093, as the bishop of S. Andrews. As this bishop is certainly Fothad II, his father was a man named Máel Míchéil.See Sir Archibald Lawrie, Early Scottish Charters Prior to A.D. 1153, (Glasgow, 1905), s.v. XI, pp. 9-10, with notes on pp. 239-40; for details about the Registrum of the Priory of St. Andrews, see John Bannerman,  \"MacDuff of Fife,\" in A. Grant & K.Stringer (eds.) Medieval Scotland: Crown, Lordship and Community, Essays Presented to G.W.S. Barrow,  (Edinburgh, 1993), pp.20-38"]}]}}