{"wiki_id": "http://www.wikidata.org/entity/Q3993212", "itemLabel": "Tony Caig", "itemDescription": "English footballer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Caig", "wikipedia_page": {"main": "Antony Caig (born 11 April 1974) is an English football coach and former player, who played as a goalkeeper. He is currently the goalkeeping coach of Scottish Premiership club Dundee United.", "link_mentions": [{"page": "Dundee United F.C.", "response": ["| Goalkeeping Coach || Tony Caig"]}, {"page": "Jimmy Glass", "response": ["He moved to Carlisle United on loan from Swindon late that season (after goalkeeper Tony Caig was sold to Blackpool and Richard Knight's loan period had been cut short due to injury). His moment of fame came on 8 May 1999, in the final match of the 1998–99 Third Division season against Plymouth Argyle, which Carlisle needed to win to avoid relegation. With the score 1–1 with only ten seconds remaining, and Carlisle winning a corner, Glass came up from his own penalty area and promptly scored a last minute goal, volleying the ball in after the Plymouth goalkeeper had parried out Scott Dobie's goalbound header. Carlisle got the win they needed and Scarborough were relegated to the Football Conference instead after a 1–1 draw with Peterborough. Scarborough's match had already finished before Glass scored, and their fans had already been celebrating on the pitch at the McCain Stadium."]}, {"page": "List of foreign MLS players", "response": ["*Tony Caig – Houston – 2008"]}, {"page": "Josh Wicks", "response": ["Wicks re-signed for the Caps in 2006 and served as backup to Tony Caig. He also helped the Caps win their first USL First Division Championship by beating the Rochester Raging Rhinos 3-0."]}, {"page": "John Karelse", "response": ["He played for AGOVV Apeldoorn in his native country for a few years before moving to NAC Breda. It was here that he caught the attention of then Newcastle United manager Ruud Gullit, who signed him for an undisclosed fee (thought to be in the region of £800,000) in August 1999. His time at Newcastle was largely unsuccessful, as he endured a terrible start to his career at the club, losing 4-2 to Southampton on his debut. He found his first team opportunities very limited after this, not helped by the competition for his position being very high with the reliable Shay Given and Steve Harper also at the club. Tony Caig was also ahead of him as third choice backup. He did, however, manage to keep a clean sheet against Arsenal at Highbury, in what proved to be his third and final game for the club."]}, {"page": "Davie Irons", "response": ["After a short term job as a coach with Northern Football League club Celtic Nation, Irons departed the club to rejoin the Brunton Park club as the full-time youth team manager in July 2013, after the departure of former coach Eric Kinder to Blackburn Rovers. Irons had also started attending friendly matches with the Cumbrians manager Greg Abbott around the same time. Following a poor start to the 2013-14 season, Irons was appointed caretaker-manager of the Cumbrians after the departure of Abbott, alongside Graham Kavanagh and Tony Caig. On 30 September 2013 Irons was appointed Kavanagh's permanent assistant-manager of Carlisle United."]}, {"page": "Anthony Caig", "response": ["#REDIRECT Tony Caig"]}, {"page": "2008 Houston Dynamo season", "response": ["|Tony Caig||||GK||April 11, 1974 (34)||Gretna FC||2008||7||0", "|January 29, 2008|| Tony Caig||GK||33|| Gretna F.C.||Signed on a free transfer||", "|2||||Tony Caig||3||0||0||0||0||0"]}, {"page": "List of Major League Soccer transfers 2008", "response": ["* Tony Caig Signed from  Gretna F.C."]}, {"page": "Houston Dynamo records and statistics", "response": ["| Tony Caig"]}, {"page": "Simon Smith (footballer)", "response": ["In the summer of 1999, Smith became first-team goalkeeping coach working under Ruud Gullit and Sir Bobby Robson. He was Sir Bobby Robson's goalkeeping coach over a five-year period, coaching in the Premier League with goalkeepers Shay Given, Steve Harper, Lionel Perez, John Karelse and Tony Caig."]}, {"page": "Cleator Moor Celtic F.C.", "response": ["* Tony Caig"]}, {"page": "2008 MLS Expansion Draft", "response": ["|Tony Caig||Brad Davis||"]}, {"page": "All-time Houston Dynamo roster", "response": ["|Tony Caig"]}, {"page": "All-time Vancouver Whitecaps roster", "response": ["*  Tony Caig"]}, {"page": "2009 Houston Dynamo season", "response": ["| December 2008||  Tony Caig|| GK|| 34||  Chesterfield|| Released following the 2008 season.||"]}, {"page": "2002–03 Hibernian F.C. season", "response": ["| Tony Caig"]}, {"page": "2001–02 Hibernian F.C. season", "response": ["| Tony Caig"]}, {"page": "Mark Gillespie (footballer)", "response": ["On 8 May 2010, the final day of the 2009–10 season, Gillespie made his professional debut in a win against Norwich City at Carrow Road after coming on as a late substitute. Gillespie therefore became the youngest keeper ever to represent Carlisle, at 18 years and 42 days, beating the previous record set by Tony Caig."]}, {"page": "2000–01 Charlton Athletic F.C. season", "response": ["|Tony Caig"]}, {"page": "2001–02 Charlton Athletic F.C. season", "response": ["| Tony Caig"]}, {"page": "1997 Football League Trophy Final", "response": ["In the shoot-out, Colchester captain Richard Wilkins stepped up to convert the first spot-kick, before Carlisle's Paul Conway equalised. Tony Adcock squeezed the ball in past Carlisle goalkeeper Tony Caig who had dived the right way. Carl Emberson saved Owen Archdeacon's penalty kick, before David Greene gave his side a 3–1 advantage. Dean Walling then scored for Carlisle as Colchester substitute Karl Duguid stepped up to take his penalty. His effort was tipped onto the post by Caig and saved, a moment which saw a young Duguid break down into tears. Warren Aspinall levelled the score at 3–3 with the next kick for Carlisle. Peter Cawley took Colchester's next penalty, which was again saved by Caig. With a chance to win the game with a conversion, Carlisle captain Steve Hayward scored to seal a 4–3 penalty shoot-out win for the club.", "|GK ||1 || Tony Caig"]}]}}