{"wiki_id": "http://www.wikidata.org/entity/Q3991358", "itemLabel": "Tim Hinkley", "itemDescription": "English singer-songwriter, keyboardist and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Hinkley", "wikipedia_page": {"main": "Timothy Alan Hinkley (born 25 May 1946 in London) is an English singer-songwriter, keyboard player and record producer. Hinkley started playing in youth club bands in the early 1960s with bands including The Copains, Boys and the Freeman Five. During this time he turned down an offer to join The Konrads which featured Davy Jones, who later changed his name to David Bowie. Other early associations were with The Bo Street Runners, Chicago Blues Line and Patto's People.", "link_mentions": [{"page": "Peter Sinfield", "response": ["Upon his return to London in 1980, his publisher introduced him to Andy Hill, a composer and fellow songwriter. He and Sinfield collaborated on such hits as \"The Land of Make Believe\" by Bucks Fizz, which reached No. 1 in the UK Singles Chart, and became one of the biggest-selling hits of the decade. While re-educating himself to adapt to the pop music industry with the help of Hill, he returned to Spain, where he was already established in the communities within Ibiza and Barcelona, and as his career progressed, moved into a house in Majorca. At this time, he appeared on Spanish television programme Musical Express, where he was interviewed and performed a set with Boz Burrell, Tim Hinkley, Michael Giles, Bobby Tench, Mel Collins, and Gary Brooker."]}, {"page": "In Flight (Alvin Lee album)", "response": ["* Tim Hinkley  -  keyboards"]}, {"page": "Henry McCullough", "response": ["On 17 March 2015 a benefit concert for Henry McCullough was held at The Half Moon, Putney music venue, featuring Paul Carrack, Nick Lowe, Andy Fairweather Low, Suggs and Bobby Tench (who also performed with the backing band). The backing band was entitled Henry's Heroes and included Tim Hinkley, Mel Collins, Neil Hubbard and John Halsey and bass player Kuma Harada.", "*Tim Hinkley – Hinkley's Heroes (2005)"]}, {"page": "Jailbreak (album)", "response": ["Initially, the song \"Running Back\" was chosen to be a single ahead of \"The Boys Are Back in Town\", the latter being seen as possibly too aggressive for some radio stations to play. Lynott and producer John Alcock decided to employ session musicians to add more commercial elements to some of the tracks and try to produce a hit single, so Tim Hinkley was brought in to add keyboard parts to \"Running Back\". Robertson was against the idea, as he liked the song as it had originally been arranged, in a blues format with his own additions of piano and bottleneck guitar. He later said, \"I took enormous offence to [the changes]. I couldn't understand why they'd pay this guy a fortune just for playing what he did. Listen to it and tell me it's not bollocks.\" Robertson did not play on the finished version of the song and Hinkley is not credited on the album sleeve. Lynott said at the time that \"Running Back\" was \"very much influenced by Van Morrison. I really like that song.\" Hinkley later recalled, \"Robbo and Scott were not keen on it at all but they were overruled.\" Thirty-five years later, Robertson recorded his own versions of the song on his 2011 album Diamonds and Dirt.", "*Tim Hinkley – keyboards on \"Running Back\" (uncredited)"]}, {"page": "Chinatown (Thin Lizzy album)", "response": ["*Tim Hinkley – electric piano on \"Didn't I\""]}, {"page": "Vinegar Joe (band)", "response": ["Vinegar Joe evolved out of Dada, a 12-piece Stax-influenced, jazz/blues rock fusion band.  Dada released one eponymous album in 1970, with a line up including vocalist Elkie Brooks and guitarist Pete Gage. Singer Robert Palmer, formerly with The Alan Bown Set joined Dada after the album had been recorded. Dada were signed by Ahmet Ertegun for Atlantic Records. After their US tour, Ahmet sub-licensed them to Chris Blackwell of Island Records for the UK and rest of the world, with instructions to reduce the line up to form Vinegar Joe in 1971, adding keyboard player Dave Thompson, but the band was still without a drummer. Phil Collins had unsuccessfully applied for the job. Conrad Isidore[ Conrad Isadore (Isidore)] at AllMusic and Rob Tait drummed on the first album. Tim Hinkley added keyboards alongside Dave Thompson and it was Hinkley who appeared on the cover of the first album. Their debut LP Vinegar Joe was released in April 1972 on Island Records in the UK and Atco Records in the US. The album cover featured plasticine models of the band created by John Padley.", "Tim Hinkley took over from Thompson on keyboards and was succeeded by John Hawken. Drummer Rob Tait played the first series of live shows succeeded by John Woods. Mike Deacon took over on keyboards. During recording of their second album, Rock'n Roll Gypsies, also released in 1972, Keef Hartley played drums. Guitarist Jim Mullen also joined the band for this record and played on the US tour. The artwork for the album was supplied by Hipgnosis. Drummer Pete Gavin joined the band prior to the US tour and recording of their third and final album Six Star General released in 1973. The band dissolved in the spring of 1974. Alan Powell played drums during the band's final weeks.", "*Tim Hinkley – keyboards"]}, {"page": "Snakebite (album)", "response": ["*Tim Hinkley – piano"]}, {"page": "Northwinds", "response": ["* Tim Hinkley – keyboards, backing vocals"]}, {"page": "Burnin' Sky", "response": ["* Tim Hinkley – keyboards"]}, {"page": "Street Rats", "response": ["In early 1975, the record company, tired of waiting for the new album, \"confiscated\" material from Marriott's Clear Sounds Studio, but much of the material was not meant for Pie, it was for a solo album and for his on-going project with Ridley.  To make the best of a bad situation, A&M brought in Andrew Loog Oldham to mix and cut up the tracks and make them heavier, much to the disgust of Marriott. The title Street Rats was also thought up by A&M.  Not surprisingly the band were never happy with the album, with Greg Ridley stating: \"It was terrible\".  Clem Clempson elaborated on this. \"The mixes were done by someone outside the band, [Oldham], and when we heard it we were horrified\". Steve Marriott (1975): \" \"Street Rats\" was a track with me, Ian Wallace and Tim Hinkley playing piano, It was nothing to do with Humble Pie\".    \"Somebody stole the 16-track mix [ ] It was intended as the title track for my album\".", "# \"Countryman Stomp\" (Greg Ridley, Clempson, Tim Hinkley) - 2:20 (Lead Vocal: Greg)", "* Tim Hinkley - (keyboards)"]}, {"page": "Ian Wallace (drummer)", "response": ["Following a move to Nashville, Tennessee in 1998, Wallace worked as a producer and player. Among his later studio recordings there were sessions with Kim Richey, Tim Krekel, Rick Vito, Dean Dillon, Rosie Flores, Jessi Alexander, producer Gary Nicholson, Steve Ripley, Jan Pulsford, Tim Hinkley, Charlie Taylor, Rodney Crowell and the legendary songwriter Dan Penn. He also performed live with T. Graham Brown, the Nashville Chamber Orchestra, Rick Vito, Jessi Alexander, and Billy Burnette, the latter in a quartet that included bassist Dave Roe (Johnny Cash) and Kenny Vaughan (Lucinda Williams)."]}, {"page": "The Crowd (band)", "response": ["The band and celebrity members included: Sir Bruce Forsyth, Denny Laine, Jim Diamond, Tony Christie, Rick Wakeman, John Conteh, The Barron Knights, Jess Conrad, Kiki Dee, the Foxes, Rolf Harris, Graham Gouldman, Kenny Lynch, Rick Wild of The Overlanders, Keith Chegwin, Tony Hicks, Colin Blunstone, Tim Hinkley, Johnny Logan, Zak Starkey, Girlschool, Black Lace, John Otway, Gary Holton, Peter Cook, the Nolans, John Entwistle of The Who, Motörhead, Dave Lee Travis, Graham Dene, Ed Stewart, Phil Lynott, Smokie, Joe Fagin, Eddie Hardin, Gerard Kenny, Tim Healy, John Verity, Rose Marie, David Shilling, Chris Norman, Bernie Winters, Robert Heaton, and Frank Allen of The Searchers."]}, {"page": "Past, Present and Future (Al Stewart album)", "response": ["* Tim Hinkley – keyboards"]}, {"page": "Once I Was", "response": ["*Tim Hinkley – Bass"]}, {"page": "Streetwalkers", "response": ["*Tim Hinkley - keyboards and vocals"]}, {"page": "Louis Cennamo", "response": ["Upon leaving the band, Cennamo spent late 1965 to late 1966 as bass guitarist for The Herd (with Peter Frampton). Cennamo's sole released recording with the band was a cover of a Mick Jagger/Keith Richards song, \"So Much In Love\" (b/w \"This Boy's Always Been True\") on the Parlophone Records label. Upon leaving The Herd, Cennamo played briefly with Tim Hinkley, Viv Prince and Mike Patto in the group Patto's People (nee Chicago Blue Line) - recording and releasing one single, \"Shimmy Shimmy Ko Ko Bop\" / \"Jump Back\", in late 1966."]}, {"page": "Micky Moody", "response": ["Moody reunited on a more permanent basis with  Whitesnake guitarist Bernie Marsden, to tour and record as the Moody Marsden Band in U.K and Europe. They issued two live albums, Never Turn Our Back on the Blues and Live in Hell and a studio set, Real Faith.  In 1996, Moody toured the US as part of the Best of British Blues tour, also featuring Eric Burdon, Alvin Lee, Aynsley Dunbar, Boz Burrell and Tim Hinkley. The following year, Moody and Marsden teamed up with Norwegian rockers Jørn Lande, Willy Bendickson and Sid Ringsby to form The Snakes, a band that specialised in reproducing the sounds of the original Whitesnake. Don Airey would often be brought in to augment them on keyboards. The band recorded two albums, Once Bitten and Live in Europe before making way for The Company of Snakes, which featured former Bad Company vocalist Robert Hart, original Whitesnake bass player Neil Murray and ex-Manfred Mann's Earth Band drummer John Lingwood. Hart was eventually replaced by ex-Snakes in Paradise frontman Stefan Berggren, and the band released two albums, Burst the Bubble and a live set Here They Go Again."]}, {"page": "Zero She Flies", "response": ["*Performers: Duffy Power, Georg Hultgreen, Gerry Conway, Larry Steele, Louis Cennamo, Michael Woods, Peter Gavin, Tim Hinkley, Trevor Lucas"]}, {"page": "White Snake (album)", "response": ["*Tim Hinkley – organ, percussion, vocals"]}, {"page": "Shooting Star (Elkie Brooks album)", "response": ["# \"Too Precious\" (Elkie Brooks, Tim Hinkley) - 4:25"]}, {"page": "Pearls (Elkie Brooks album)", "response": ["*Jean Roussel, Tim Hinkley, Mike Stoller - piano/keyboards"]}, {"page": "Graham Bell (singer)", "response": ["Graham made a solo single in 1966 and one year later replaced Alan Hull as the singer of psychedelic rock band Skip Bifferty (later renamed Heavy Jelly). In 1969 he was singer in another psychedelic rock band, Griffin. In 1970 he began his stint with Charisma Records, joining Every Which Way, a band formed by Brian Davison formerly of The Nice, as singer and principal writer. Musical style was jazzy progressive rock with guitar from John Hedley (who was later part of Last Exit, with Sting) playing call and response with Bell's blues shout vocals. Bell then rejoined his old mates from Skip Bifferty, now known as Arc, to form Bell & Arc in July 1971, with John Turnbull, Mick Gallagher, Bud Beadle, Kenny Craddock, Steve Gregory, Tom Duffy and Alan White. Bell was then tempted to leave the group to record his self-titled solo album in 1972, featuring Tim Hinkley, Tim Drummond, Mel Collins and Ian Wallace, and produced by Bob Johnston."]}, {"page": "List of band members in David Coverdale's bands", "response": ["* Tim Hinkley - Keyboards", "* Tim Hinkley - Keyboards"]}, {"page": "On the Road to Freedom", "response": ["In a 1974 interview with Zoo World magazine, Lee described his and LeFevre's collaboration as \"[not] a commercial effort, just an LP recorded at home with some neighbors\" and said that their starting point musically was country and western. Music journalist Charley Walters later summed up the album as a \"potpourri of American rock and rhythm & blues\" with elements of country and bluegrass. Among the many guest musicians, LeFevre met George Harrison at a pub in nearby Henley-on-Thames, after which Harrison became a regular visitor to Hook End Manor and provided his sound engineer to help prepare the new recording facility. Other members of what became known as \"the Thames Valley Gang\" who also contributed to the album included Ron Wood, Tim Hinkley and Boz Burrell.Herb Staehr, \"The George Harrison/Alvin Lee connection\", Goldmine, 25 January 2002, p. 63. Three members of the band Traffic – Stevie Winwood, Jim Capaldi and Reebop Kwaku Baah – were among the other participants, along with drummer Ian Wallace.", "*Tim Hinkley – piano, organ, backing vocals"]}, {"page": "Snafu (band)", "response": ["Snafu's third LP, All Funked Up, has long been seen as their 'great lost album' and is highly elusive in its original vinyl format. Solley had left to join Procol Harum. He was replaced first by Brian Chatton, then by John Miles and later by Tim Hinkley, who was a much-used session player at the time. They both play on the album, which again was recorded at The Manor."]}, {"page": "Live in Hamburg (Roger Chapman album)", "response": ["* Tim Hinkley - Keyboards"]}, {"page": "Morning Glory (Tim Buckley album)", "response": ["*Tim Hinkley - Bass"]}, {"page": "Sneakin' Suspicion", "response": ["* Tim Hinkley - keyboards"]}, {"page": "Bobby Tench", "response": ["|rowspan=1| 2005 ||Tim Hinkley||Hinkley's Heroes || Akarma"]}, {"page": "Bloodletting (Boxer album)", "response": ["*Tim Hinkley - keyboards"]}, {"page": "Mail Order Magic", "response": ["* Tim Hinkley - Keyboards"]}, {"page": "He Was... She Was... You Was... We Was...", "response": ["* Tim Hinkley — piano, organ, vocals"]}, {"page": "Chapman Whitney Streetwalkers", "response": ["*Max Middleton, Tim Hinkley — keyboards", "*Jim Cregan, John Wetton, Linda Lewis, Tim Hinkley — backing vocals"]}, {"page": "Hyenas Only Laugh for Fun", "response": ["#\"Prisoner\" (Chapman, Tim Hinkley, Geoff Whitehorn) – 5:38", "*Tim Hinkley – Keyboards"]}, {"page": "The Early Years (David Coverdale album)", "response": ["*Tim Hinkley - keyboards, backing vocals", "*Tim Hinkley - keyboards, backing vocals"]}, {"page": "All Funked Up", "response": ["*Tim Hinkley - piano, organ"]}, {"page": "Solitudes à deux", "response": ["#\"La première pierre\" (Michel Mallory, Tim Hinkley)"]}, {"page": "Show Some Emotion (album)", "response": ["* Tim Hinkley – Hammond organ on \"Peace in Mind\", piano on \"Kissin' and a Huggin'\""]}]}}