{"wiki_id": "http://www.wikidata.org/entity/Q4018958", "itemLabel": "Lynda La Plante", "itemDescription": "English writer and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynda_La_Plante", "wikipedia_page": {"main": "Lynda La Plante, CBE (born Lynda Titchmarsh; 15 March 1943) is an English author, screenwriter and former actress, best known for writing the Prime Suspect television crime series.", "link_mentions": [{"page": "Craig Charles", "response": ["Charles has acted in episodes of popular dramas such as The Bill (1995), EastEnders (2002) and Holby City (2003) and in the comedy The 10 Percenters (1996). Charles played the emotionally disturbed and violent prisoner, Eugene Buffy, in the highly successful Lynda La Plante drama series The Governor (1996); the title role in the Channel 4 pirate sitcom Captain Butler (1997); the warden of a women's prison in the Canadian sci-fi fantasy Lexx (2001); Detective Chief Inspector Mercer in seven episodes of the BBC soap opera Doctors (2003); and soccer agent, Joel Brooks, in the Sky TV football soap Dream Team (2004).", "|Drama from Lynda La Plante. All 6 episodes of series 2. DVD (2012)"]}, {"page": "March 15", "response": ["*  1943   – Lynda La Plante, English actress, screenwriter, and author"]}, {"page": "1997 in film", "response": ["| Bella Mafia || CBS / The Königsberg Company || David Greene (director); Lynda La Plante (screenplay); Dennis Farina, Vanessa Redgrave, Nastassja Kinski, Jennifer Tilly, Illeana Douglas, James Marsden, Gina Philips, Richard Portnow, Franco Nero, Peter Bogdanovich, Carmen Argenziano, David O'Donnell, Michael Hayden, Richard Joseph Paul, W. Earl Brown, Tony Maggio, Tomas Arana, Christopher Shaw, Michael Raynor, Dimitra Arliss, Paul Eckstein, Tony Lo Bianco || Drama || Live action"]}, {"page": "1983 in film", "response": ["| High Road to China || Warner Bros. / Umbrella Entertainment || Brian G. Hutton (director); Sandra Weintraub, S. Lee Pogostin (screenplay); Tom Selleck, Bess Armstrong, Jack Weston, Wilford Brimley, Robert Morley, Brian Blessed, Cassandra Gava, Michael Sheard, Lynda La Plante, Terry Richards, Robert Lee, Jeremy Child, Dino Shafeek, Anthony Chinn, Timothy Bateson, Wolf Kahler, Ric Young, Simon Prebble, Timothy Carlton, Sime Jagarinac, Domagoj Vukusic, Peggy Sirr, Shayur Mehta, Peter Llewellyn Williams, Hai Ching Lim, Chua Kahjoo, Zdenka Hersak, Marc Boyle, Kim Rook Teoh, Daniel Clucas, John Higginson || Adventure, Romance || Live action"]}, {"page": "1982 in film", "response": ["| The Draughtsman's Contract || Curzon Artificial Eye / British Film Institute / Channel 4 || Peter Greenaway (director/screenplay); Anthony Higgins, Janet Suzman, Dave Hill, Anne-Louise Lambert, Hugh Fraser, Neil Cunningham, David Meyer, Tony Meyer, Nicholas Amer, Suzan Crowley, Lynda La Plante, Michael Feast, David Gant, Alastair Cumming, Steve Ubels || Comedy, Drama, History || Live action"]}, {"page": "Prime Suspect", "response": ["Prime Suspect is a British police procedural television drama series devised by Lynda La Plante. It stars Helen Mirren as Jane Tennison, one of the first female Detective Chief Inspectors in Greater London's Metropolitan Police Service, who rises to the rank of Detective Superintendent while confronting institutionalised sexism within the police force.", "Prime Suspect 3 was awarded a Peabody Award in 1993 for its realistic scenes and dialogue. Writer/creator Lynda La Plante received an Edgar Award from the Mystery Writers of America for series one in the category of Best TV Feature or Miniseries. The following year, Allan Cubitt won in the same category for series two. Prime Suspect was later nominated for series three and six.", "| Christopher Menaul, Lynda La Plante, Don Leaver", "| Lynda La Plante", "| Paul Marcus, David Drury, Lynda La Plante", "| Lynda La Plante", "| Lynda La Plante", "A six-part prequel, Prime Suspect 1973, was announced in 2015 by ITV, based on the book Tennison by Lynda La Plante, adapted by Glen Laker. It tells the story of a 22 year old Jane Tennison as a probationary WPC in Hackney, London, investigating her first murder case. The series began airing on 2 March 2017. The role of Tennison is played by Stefanie Martini. In June 2017, ITV confirmed that the series had not been recommissioned for a second series."]}, {"page": "Anne Dudley", "response": ["*Lynda La Plante's Above Suspicion;"]}, {"page": "Newton-le-Willows", "response": ["* Lynda La Plante, author, screenwriter and former actress, was born on 15 March 1943 in Newton-le-Willows"]}, {"page": "The Sweeney", "response": ["*Lynda La Plante"]}, {"page": "Janet McTeer", "response": ["On television, she starred in the title role of Lynda La Plante's The Governor (1995–1996), and received an Emmy Award nomination for Into the Storm (2009) and a Golden Globe nomination for The White Queen (2013). She appeared opposite Glenn Close in the final season of the drama series Damages (2012). She also played the character Helen Pierce in Ozark (2017) and received an Emmy nomination for the role in 2021.", "McTeer's television work includes the BBC production Portrait of a Marriage, an adaptation of Nigel Nicolson's biography of the same name in which she played Vita Sackville-West, and the popular ITV series The Governor written by Lynda La Plante. She made her screen debut in Half Moon Street, a 1986 film based on a novel by Paul Theroux. In 1991, she appeared in Catherine Cookson's The Black Velvet Gown, with Bob Peck and Geraldine Somerville; this won the International Emmy award for best drama. She appeared in the 1992 film version of Wuthering Heights (co-starring Juliette Binoche and Ralph Fiennes) and the 1995 film Carrington (which starred Emma Thompson and Jonathan Pryce) as Vanessa Bell."]}, {"page": "Geoffrey Sax", "response": ["In 1998 Sax returned to the UK. He helmed Lynda La Plante's adaptation of her own novel Killer Net that year, and later gained credits on Paul Abbott's acclaimed Clocking Off, a Red Production Company series for BBC One."]}]}}