{"wiki_id": "http://www.wikidata.org/entity/Q4020156", "itemLabel": "William Squire", "itemDescription": "Welsh actor", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Squire", "wikipedia_page": {"main": "William Squire (29 April 1917 – 3 May 1989) was a Welsh actor of stage, film and television.\nSquire was born in Neath, Glamorgan, the son of William Squire and his wife Martha (née Bridgeman).\n\n", "link_mentions": [{"page": "Thomas More", "response": ["In the 1969 film Anne of the Thousand Days, More is portrayed by actor William Squire."]}, {"page": "Henry V (play)", "response": ["* 1960 Robert Hardy as Henry, William Squire as Chorus, George A. Cooper as Pistol"]}, {"page": "Anne of the Thousand Days", "response": ["The film stars Richard Burton as King Henry VIII and Canadian actress Geneviève Bujold as Anne Boleyn. Irene Papas plays Catherine of Aragon, Anthony Quayle plays Cardinal Thomas Wolsey, and John Colicos plays Thomas Cromwell. Others in the cast include Michael Hordern, Katharine Blake, Peter Jeffrey, Joseph O'Conor, William Squire, Vernon Dobtcheff, Denis Quilley, Esmond Knight, and T. P. McKenna, who later played Henry VIII in Monarch. Burton's wife Elizabeth Taylor makes a brief, uncredited appearance."]}, {"page": "Richard Burton", "response": ["Shortly after the release of Prince of Players, Burton met director Robert Rossen, who was well known at the time for his Academy Award-winning film, All the King's Men (1949). Rossen planned to cast Burton in Alexander the Great (1956) as the eponymous character. Burton accepted Rossen's offer after the director reassured him he had been studying the Macedonian king for two years to make sure the film was historically accurate. Burton was loaned by Fox to the film's production company United Artists, which paid him a fee of $100,000 (). Alexander the Great was made mostly in Spain during February 1955 and July 1955 on a budget of $6 million. The film reunited Burton with Bloom and it was also the first film he made with her. Bloom played the role of Barsine, the daughter of Artabazos II of Phrygia, and one of Alexander's three wives. Fredric March, Danielle Darrieux, Stanley Baker, Michael Hordern and William Squire were respectively cast as Philip II of Macedon, Olympias, Attalus, Demosthenes and Aeschines."]}, {"page": "Gandalf", "response": ["John Huston voiced Gandalf in the animated films The Hobbit (1977) and The Return of the King (1980) produced by Rankin/Bass. William Squire voiced Gandalf in the animated film The Lord of the Rings (1978) directed by Ralph Bakshi. Ivan I. Krasko played Gandalf in the Soviet film adaptation The Hobbit (1985). Gandalf was portrayed by Vesa Vierikko in the Finnish television miniseries Hobitit (1993). "]}, {"page": "Toad of Toad Hall", "response": ["The play was revived in the West End each year from 1932 to 1935, and was next seen there in 1954, in a production first seen at the Royal Shakespeare Theatre, Stratford-upon-Avon, with Leo McKern as Toad, William Squire as Rat, Edward Atienza as Mole and Brewster Mason as Badger.\"Christmas Shows\", The Stage, 31 December 1954, p. 8"]}, {"page": "1989 in film", "response": ["| style=\"text-align:center;\"| 3 || William Squire || style=\"text-align:center;\"| 71 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || style=\"text-align:left;\"| "]}, {"page": "1978 in film", "response": ["*The Lord of the Rings, animated film by Ralph Bakshi, with voices of William Squire, John Hurt, Anthony Daniels"]}, {"page": "The Battle of the River Plate (film)", "response": ["* William Squire as Ray Martin, British SIS agent in Montevideo"]}, {"page": "Neath", "response": ["*William Squire (1917–1989), actor;"]}, {"page": "Shakespearean history", "response": ["# for the 1960 UK serial An Age of Kings directed by Michael Hayes. Featuring David William as Richard II, Tom Fleming as Henry IV, Robert Hardy as Henry V, Terry Scully as Henry VI, Paul Daneman as Richard III, Julian Glover as Edward IV, Mary Morris as Queen Margaret, Judi Dench as Princess Catherine, Eileen Atkins as Joan la Pucelle, Frank Pettingell as Falstaff, William Squire as The Chorus and Justice Shallow, and, Sean Connery as Hotspur.", "# for the 1965 UK serial The Wars of the Roses, based on the RSC's 1964 staging of the Second Tetralogy, which condensed the Henry VI plays into two plays called Henry VI and Edward IV. adapted by John Barton and Peter Hall; and directed by Hall. Featuring Ian Holm as Richard III, David Warner as Henry VI, Peggy Ashcroft as Margaret, Donald Sinden as York, Roy Dotrice as Edward and Jack Cade, Janet Suzman as Joan and Lady Anne and William Squire as Buckingham and Suffolk."]}, {"page": "Under Milk Wood", "response": ["|Captain Cat||Roy Poole||Hugh Griffith|| William Squire ||Hugh Griffith|| Aubrey Richards ||Peter O'Toole || Glyn Houston||Tom Jones"]}, {"page": "The Lord of the Rings (1978 film)", "response": ["Bakshi encountered Tolkien's writing early in his career. He had made several attempts to produce The Lord of the Rings as an animated film before producer Saul Zaentz and distributor United Artists provided funding. The film is notable for its extensive use of rotoscoping, a technique in which scenes are first shot in live-action, then traced onto animation cels. It uses a hybrid of traditional cel animation and rotoscoped live action footage. The film features the voices of William Squire, John Hurt, Michael Graham Cox, and Anthony Daniels. The screenplay was written by Peter S. Beagle, based on an earlier draft by Chris Conkling.", "Decades later, during Bilbo's birthday celebration, the wizard Gandalf (William Squire) tells him to leave the Ring for his nephew Frodo (Christopher Guard). Bilbo reluctantly agrees, and departs for Rivendell. Seventeen years pass, during which Gandalf learns that evil forces have discovered that the Ring is in the possession of a Baggins. Gandalf meets Frodo to explain the Ring's history and the danger it poses; and Frodo leaves his home, taking the Ring with him. He is accompanied by three hobbits, his cousins, Pippin (Dominic Guard), Merry (Simon Chandler), and his gardener Sam (Michael Scholes). After a narrow escape from the Ringwraiths, the hobbits eventually come to Bree, from which Aragorn (John Hurt) leads them to Rivendell. Frodo is stabbed atop Weathertop mountain by the chief of the Ringwraiths, and becomes sickened as the journey progresses. The Ringwraiths catch up with them shortly after they meet the elf Legolas (Anthony Daniels); and at a standoff at the ford of Rivendell, the Ringwraiths are swept away by the river.", "* Gandalf – William Squire", "Bakshi went to England to recruit a voice cast from the BBC Drama Repertory Company, including Christopher Guard, William Squire, Michael Scholes, Anthony Daniels, and John Hurt. Daniels remembers that \"The whole cast were in the same studio but we all had to leave a two second gap between the lines which made for rather stilted dialogue.\" For the live-action portion of the production, Bakshi and his cast and crew went to Spain, where the rotoscope models acted out their parts in costume in the open or in empty soundstages. Additional photography took place in Death Valley. Bakshi was so terrified of the horses used in the shoot that he directed those scenes from inside the caravan."]}, {"page": "Doctor Faustus (play)", "response": ["The first television adaptation was broadcast in 1947 by the BBC starring David King-Wood as Faustus and Hugh Griffith as Mephistopheles. In 1958, another BBC television version starred William Squire as Faustus in an adaptation by Ronald Eyre intended for schools. In 1961, the BBC adapted the play for television as a two-episode production starring Alan Dobie as Faustus; this production was also meant for use in schools."]}, {"page": "Camelot (musical)", "response": ["When Camelot began rehearsals, it still needed considerable work. However, the producers were able to secure a strong cast, including Julie Andrews, Richard Burton, and Roddy McDowall, as well as Robert Goulet in his first Broadway role. John Cullum also made his Broadway debut as Sir Dinadan; Bruce Yarnell was Sir Lionel. Cullum later replaced McDowall, and William Squire\"William Squire Broadway\" ibdb.com, retrieved December 2, 2017 replaced Burton. Other replacements included Patricia Bredin (as of April 16, 1962),\"Patricia Bredin Broadway\" ibdb.com, retrieved December 2, 2017 Kathryn Grayson (as of October 23, 1962)\"Kathryn Grayson Broadway\" ibdb.com, retrieved December 2, 2017 and Janet Pavek (as of July 9, 1962)\"Janet Pavek Broadway\" ibdb.com, retrieved December 2, 2017 for Andrews.", "A two-year U.S. tour followed the Broadway closing, starring Kathryn Grayson and William Squire, who was succeeded by Louis Hayward. Grayson was dismissed in Cincinnati, OH, for having missed performances and replaced by her understudy, Jan Moody. There was also a 1963–1964 bus-and-truck tour starring Biff McGuire as Arthur, Jeannie Carson as Guenevere, and Sean Garrison as Lancelot. Yet another company toured with the show in 1964, starring Howard Keel as Arthur, Constance Towers as Guenevere, and Bob Holiday as Lancelot. Also in 1964 an Australian production opened at  Her Majesty's Theatre, Melbourne, starring Paul Daneman and Jacqueline McKeever, with stage design by John Truscott. Truscott would later work on the film adaptation. The production, by the J. C. Williamson company, ran for two years."]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*William Squire"]}, {"page": "The Wednesday Play", "response": ["| Ann BeachGilbert WynneMegs JenkinsWilliam SquireDeclan MulhollandEamonn BoyceClive MerrisonClare JenkinsHeather Emmanuel"]}, {"page": "The Champions", "response": ["| colspan=\"5\" style=\"background-color: white;\" |After a senior figure in British Intelligence is brainwashed into breaking into his own secure vault (located underneath a tailor's shop) the Champions are sent to test its security and find out what happened.With Michael Barrington, John Franklyn-Robbins, William Squire, David Langton, John Bown, David Kelsey, Dervis Ward, Robert Mill"]}, {"page": "Where Eagles Dare", "response": ["* William Squire as Capt. Lee Thomas"]}, {"page": "The Man Who Never Was", "response": ["* William Squire as submarine commander Bill Jewell"]}, {"page": "Dunkirk (1958 film)", "response": ["* William Squire as captain of minesweeper (uncredited)"]}, {"page": "The Armageddon Factor", "response": ["The serial is set on the planets Atrios and Zeos, and another planet in between them. In the serial, the war between Atrios and Zeos is nearing its end. Mentalis, a commandant computer on Zeos, and the Marshal of Atrios (John Woodvine), plot to wipe each other out. At the same time, the Shadow (William Squire), a henchman of the Black Guardian (Valentine Dyall), steals the time and space vessel the TARDIS, which contains the first five segments of the powerful Key to Time, and kidnaps Princess Astra of Atrios (Lalla Ward), who is the sixth and final segment."]}, {"page": "Alexander the Great (1956 film)", "response": ["* William Squire as Aeschenes"]}, {"page": "Callan (TV series)", "response": ["| Ronald Radd, Michael Goodliffe, Derek Bond, William Squire"]}, {"page": "When the Boat Comes In", "response": ["|Jack meets Margaret Carter-Brown, the niece of Lewis Bishop's managing director John Hartley.  She is a Socialist researching the plight of the unemployed on Tyneside.  He takes her to see Danny Lockhart, who is unemployed and has sold his war medal.  Hartley learns that the Argentine navy want a warship and asks Jack to use his contacts to win the contract for Lewis Bishop. The deal fails, but Jack is able to win another order for an American millionaire and uses his fee to buy back Danny's medal. Written by James Mitchell: featuring William Squire as Hartley.", "|Doughty introduces Jack to Captain Bauer, who offers Jack work guarding an air-strip in South America against local tribes.  Learning that Bauer wants the locals killed for the oil on their land, Jack refuses.  He buys fire damaged goods from Bauer and he and Sarah sell them in Gallowshield market.  Margaret becomes engaged. Written by James Mitchell: featuring William Squire, Bryan Pringle."]}, {"page": "The Venturers", "response": ["Geoffrey Keen starred as director Gerald Lang, in a virtual reprise of his role as oil executive Brian Stead in Mogul / The Troubleshooters. Other major cast members included James Kerry, David Buck, Cyril Luckham and William Squire.", "* William Squire as Sir George Fielding"]}, {"page": "The XYY Man", "response": ["* William Squire as Laidlaw (Series 2, Episodes 1—4)"]}, {"page": "The Thirty Nine Steps (1978 film)", "response": ["* William Squire as Harkness"]}, {"page": "Juliet Harmer", "response": ["Harmer married actor William Squire (1917–89) in 1967., It was his second marriage and they later divorced. Since 1977, she has been married to theatre director Bill Alexander. They have two daughters, Jess and Lola, and two grandchildren, Vinny and Thea."]}, {"page": "1989 in Wales", "response": ["**William Squire, actor, 73"]}, {"page": "1978 in Wales", "response": ["*Elaine Morgan's adaptation of Off to Philadelphia in the Morning, the novel by Jack Jones, stars David Lyn as Joseph Parry and Connie Booth as his wife, Jane. Meredith Edwards, Rachel Thomas and William Squire also appear."]}, {"page": "1957 in Wales", "response": ["*Adaptation of Dylan Thomas's Under Milk Wood, starring Donald Houston and William Squire."]}, {"page": "1956 in Wales", "response": ["*Richard Burton stars in Alexander the Great; William Squire also appears."]}, {"page": "A Sentimental Journey (Randall and Hopkirk (Deceased))", "response": ["*William Squire ....  Sam Seymour"]}, {"page": "1916 in Wales", "response": ["*29 April - William Squire, actor (died 1989)"]}, {"page": "Whodunnit (play)", "response": ["*Rear Admiral Knatchbull Folliatt - William Squire"]}, {"page": "Testimony (1988 film)", "response": ["*William Squire as Aram Khachaturian"]}, {"page": "List of Callan episodes", "response": ["In the television series, successive Hunters were played by Ronald Radd, Derek Bond, Michael Goodliffe and William Squire. The last's portrayal of a steely exterior, delivering ice-cold decisions with an underplayed theatrical flair, made for a match for Callan. Squire is probably the best remembered of all the supporting actors who played Hunter as a result."]}]}}