{"wiki_id": "http://www.wikidata.org/entity/Q40366", "itemLabel": "Chloe Rogers", "itemDescription": "English field hockey player", "wikipedia_url": "https://en.wikipedia.org/wiki/Chloe_Rogers", "wikipedia_page": {"main": "Chloe Naomi Rogers (born 30 March 1985 in Harlow, Essex) is an English field hockey player midfield and forward and London 2012 Olympic bronze medal-winner. She made her senior international debut for the England women's national field hockey team in November 2003 versus Japan at Chelmer Park, Chelmsford, Essex. She holds a World Cup bronze, a Champions Trophy silver and bronze along with two Commonwealth Games bronze medals as well as European Championship bronzes. She is also one of the leading indoor hockey players in the UK.", "link_mentions": [{"page": "Chloe", "response": ["* Chloe Rogers (born 1985), English field hockey player"]}, {"page": "Buckinghamshire New University", "response": ["*Chloe Rogers                                                         "]}, {"page": "England at the 2006 Commonwealth Games", "response": ["* Chloe Rogers"]}, {"page": "Hockey at the 2006 Commonwealth Games", "response": ["|Carolyn ReidBeth StorryLisa WoodingCrista CullenMelanie ClewlowHelen GrantHelen RichardsonLucilla WrightKate WalshJennie BimsonAlex DansonJoanne EllisCathy Gilliat-SmithCharlotte HartleyRebecca HerbertChloe RogersCoach: Danny Kerry"]}, {"page": "List of Olympic medalists in field hockey", "response": ["|Beth StorryEmily MaguireLaura UnsworthCrista CullenAnne PanterHannah MacleodHelen RichardsonKate WalshChloe RogersLaura BartlettAlex DansonGeorgie TwiggAshleigh BallSally WaltonNicola WhiteSarah Thomas"]}, {"page": "England at the 2010 Commonwealth Games", "response": ["|  || EnglandAshleigh BallCharlotte CraddockCrista CullenAlex DansonSusie GilbertHannah MacleodHelen RichardsonChloe RogersNatalie SeymourBeth StorryGeorgie TwiggLaura UnsworthKate WalshSally WaltonNicola WhiteKerry Williams || Hockey || Women's team || 13 October"]}, {"page": "Hockey at the 2010 Commonwealth Games", "response": ["|Ashleigh BallCharlotte CraddockCrista CullenAlex DansonSusie GilbertHannah MacleodHelen RichardsonChloe RogersNatalie SeymourBeth StorryGeorgie TwiggLaura UnsworthKate WalshSally WaltonNicola WhiteKerry WilliamsHead coach: Danny Kerry"]}, {"page": "Field hockey at the 2012 Summer Olympics", "response": ["|Ashleigh BallLaura BartlettCrista CullenAlex DansonHannah MacleodEmily MaguireAnne PanterHelen RichardsonChloe RogersBeth StorrySarah ThomasGeorgie TwiggLaura UnsworthKate WalshSally WaltonNicola White"]}]}}