{"wiki_id": "http://www.wikidata.org/entity/Q40471152", "itemLabel": "Joe Willock", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Willock", "wikipedia_page": {"main": "Joseph George Willock (born 20 August 1999) is an English professional footballer who plays as a midfielder for Premier League club Newcastle United. Willock was Arsenal's youth academy product and was loaned to Newcastle United during the 2020-21 season.", "link_mentions": [{"page": "Scott Carson", "response": ["Carson signed for reigning Premier League champions Manchester City on 8 August 2019 on loan for the 2019–20 season, as the third-choice goalkeeper behind Ederson and Claudio Bravo. He extended his loan for the 2020–21 season. On 14 May 2021, he made his first Premier League appearance in almost a decade in a 4–3 away win over Newcastle United. During the match, Carson saved a Joe Willock penalty but let in the rebound after the ball fell kindly back to Willock."]}, {"page": "Willock", "response": ["*Joe Willock (b. 1999), an English football midfielder, currently at Arsenal"]}, {"page": "Steve Morrow", "response": ["On 12 September 2008 Morrow returned to Arsenal as International Partnerships – Performance Supervisor, managing Arsenal's international partnerships, which included the Colorado Rapids of Major League Soccer in the United States, BEC Tero of Thailand and Hoàng Anh Gia Lai of Vietnam, and assisting Arsenal's academies in countries such as Egypt and Ghana. From 2014, Morrow worked as Arsenal's head of youth development – a period which saw the likes of Emile Smith Rowe, Ainsley Maitland-Niles, Reiss Nelson, Bukayo Saka, Joe Willock and Eddie Nketiah come through the ranks for club and country. He left Arsenal in 2019 following a coaching staff shake up."]}, {"page": "1999 in the United Kingdom", "response": ["* 20 August – Joe Willock, footballer"]}, {"page": "List of association football families", "response": ["* Matty Willock,  Chris Willock,  Joe Willock (brothers)"]}]}}