{"wiki_id": "http://www.wikidata.org/entity/Q40503", "itemLabel": "Alma Deutscher", "itemDescription": "British composer, pianist and violinist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alma_Deutscher", "wikipedia_page": {"main": "Alma Elizabeth Deutscher (born 19 February 2005) is a British composer, pianist and violinist. Deutscher composed her first piano sonata at the age of five. At seven, she completed a short opera The Sweeper of Dreams. Aged nine, she wrote a concerto for violin and orchestra. At the age of ten, she wrote her first full-length opera, Cinderella, which had its European premiere in Vienna in 2016 under the patronage of conductor Zubin Mehta. The U.S. premiere a year later at Opera San Jose was released on DVD by Sony Classical. Deutscher’s piano concerto was performed when she was 12. She made her debut at Carnegie Hall in 2019.", "link_mentions": [{"page": "Cadenza", "response": ["* Alma Deutscher composed a cadenza for Mozart's 8th Piano Concerto when she was ten.\"https://www.youtube.com/watch?v=bxUI4DeoWGg\""]}, {"page": "Cinderella", "response": ["*Cinderella (2015) by 10-year-old composer prodigy Alma DeutscherCinderella, a full-length opera by Alma Deutscher. Retrieved 29 July 2015."]}, {"page": "List of women composers by birth date", "response": ["* Alma Deutscher (born 2005)"]}, {"page": "A Visit from St. Nicholas", "response": ["The poem was also set to music by British child composer Alma Deutscher (b. 2005).In 1953, Perry Como recorded a recitation of the poem for RCA Victor with background music arranged and conducted by Mitchell Ayres. Louis Armstrong recited the poem in a March 1971 recording made only four months before his death. It was recorded at his home in Corona, Queens and released as 45rpm by Continental Records."]}, {"page": "List of 21st-century classical composers", "response": ["|Alma Deutscher || 2005 ||  || English || The Sweeper of Dreams (opera); Cinderella (opera); Concerto for Violin and Orchestra in G; Piano Concerto in E-flat major ||"]}, {"page": "Deutscher", "response": ["*Alma Deutscher, British musician and composer"]}, {"page": "2005 in the United Kingdom", "response": ["* February – Alma Deutscher, composer, pianist and violinist"]}, {"page": "List of child music prodigies", "response": ["| Alma Deutscher"]}, {"page": "Moscow Nights", "response": ["In June 2018, the English teenage composer Alma Deutscher adapted the song for piano to entertain Russian President Vladimir Putin during a State Visit to Austria, at the request of Austrian Chancellor Sebastian Kurz. Given three days to arrange it, Deutscher started with a sad lament that transformed itself into a Viennese waltz. Kurz explained that the melding of the two musical styles illustrated well the bond of friendship between Austria and Russia. Deutscher repeated the arrangement as an encore during her recital at the Lucerne Festival on 29 August 2018."]}, {"page": "Orchestra of St. Luke's", "response": ["Orchestra of St. Luke's has premiered more than 100 orchestral and chamber works by such composers as John Adams, Joan Tower, Gabriela Lena Frank, Anthony Davis, Nicholas Maw, André Previn, George Tsontakis, Bryce Dessner, Ellen Taaffe Zwilich and Alma Deutscher. The orchestra has appeared on more than 100 recordings, four of which have won Grammy Awards: John Adams's Nixon in China, Samuel Barber's Knoxville: Summer of 1915, Listen to the Storyteller with Wynton Marsalis, and Bel Canto with Renée Fleming. In 2003, the orchestra launched its own record label, St. Luke's Collection."]}, {"page": "Leonardo da Vinci International Award", "response": ["|Alma Deutscher "]}, {"page": "Guy Deutscher (linguist)", "response": ["Deutscher is the father of Alma Deutscher, a child prodigy composer and musician."]}, {"page": "List of Stradivarius instruments", "response": ["| On loan to Alma Deutscher since 2019. The loan is administered by the Tarisio Trust."]}, {"page": "Alma (given name)", "response": ["*Alma Deutscher (born 2005), English composer and musician"]}, {"page": "Les Barricades Mystérieuses", "response": ["* 2021 The composer Alma Deutscher suggested that her vocal and visual arrangement of the piece, where the notes in the different voices rest on one another like barrels, may explain the imagery of barricades."]}, {"page": "Beijing Music Festival", "response": ["With the theme \"Timeless Music in the Future,\" BMF's 22nd festival was held from October 4-28, 2019. The festival presented 16 distinct programs including operas, symphonic concerts, recitals, chamber music concerts, and virtual reality music experiences. It began with an 8-hour performance of Max Richter's Sleep at the foot of the Great Wall of China. Additional performances included the Asian premiere of Eight, a mixed-reality musical theater work written by Michel van der Aa and co-commissioned by BMF; the 2017 Pulitzer Prize-winning opera Angel's Bone by Du Yun; and the China premiere of Handel’s Xerxes performed by Opera Fuoco and David Stern. Guest artists included sopranos Renée Fleming and Edita Gruberová, pianist Jean-Yves Thibaudet, prodigy Alma Deutscher, maestros Long Yu, Vladimir Ashkenazy, Charles Dutoit, and Pinchas Zukerman, and BMF's first resident orchestra Mahler Chamber Orchestra, among others. BMF also presented the world premiere of Aaron Zigman’s Tango Manos Piano Concerto."]}, {"page": "Partimento", "response": ["The rediscovery of the partimento tradition in modern research since around 2000 has enabled new ways of looking at the musical education and composing practice in the 18th and 19th centuries, nurturing musical creativity beyond mere partimento realizations. Influential monographs concerning partimento include Robert O. Gjerdingen's Music in the Galant Style (2007) and Giorgio Sanguinetti's The Art of Partimento (2012). Partimenti gained increased recognition due to being part of Alma Deutscher's early musical training, with her studies with Tobias Cramm and Robert Gjerdingen."]}, {"page": "Cinderella (Deutscher)", "response": ["#REDIRECT Alma Deutscher#Cinderella (2013–17) "]}, {"page": "2020 Global Awards", "response": ["** Alma Deutscher"]}, {"page": "Carinthischer Sommer", "response": ["The festival gained international reputation through world-famous soloists and conductors such as Claudio Abbado, Aigul Akhmetshina, Benjamin Appl, Leonard Bernstein, Karl Böhm, Yefim Bronfman, Grace Bumbry, Montserrat Caballé, José Carreras, René Clemencic Alma Deutscher, Christoph von Dohnányi, Vladimir Fedoseyev, Bernarda Fink, Ádám Fischer, Sir James Galway, Bruno Ganz, John Eliot Gardiner, Nicolai Gedda, Valery Gergiev, Emil Gilels, Martin Grubinger, Hilary Hahn, Hans and Martin Haselböck, Michael Heltau, Cyprien Katsaris, Lukas Kranzelbinder, Gidon Kremer, Elisabeth Leonskaja, Marjana Lipovšek, Lorin Maazel, Oleg Maisenberg, Mischa Maisky, Neville Marriner, Zubin Mehta, Tobias Moretti, Riccardo Muti, Roger Norrington, David Oistrakh, Seiji Ozawa, Boris Pergamenschikow, Markus Poschner, Will Quadflieg, Ruggero Raimondi, Carole Dawn Reinhart, Katia Ricciarelli, Mstislav Rostropovich, Peter Schreier, Horst Stein, Henryk Szeryng and many more.Carinthischer Sommer on Visitvillach.at/de"]}, {"page": "Alma Elizabeth Deutscher", "response": ["#REDIRECT Alma Deutscher"]}]}}