{"wiki_id": "http://www.wikidata.org/entity/Q4058973", "itemLabel": "William Henry Ireland", "itemDescription": "English forger of Shakespearean documents and plays", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Ireland", "wikipedia_page": {"main": "William Henry Ireland (1775–1835) was an English forger of would-be Shakespearean documents and plays. He is less well known as a poet, writer of gothic novels and histories. Although he was apparently christened William-Henry, he was known as Samuel through much of his life (apparently after a brother who died in childhood), and many sources list his name as Samuel William Henry Ireland.", "link_mentions": [{"page": "Gothic fiction", "response": ["| William Henry Ireland"]}, {"page": "Hengist and Horsa", "response": ["\"Hengist and Horsus\" appear as antagonists in the play Vortigern and Rowena, which was touted as a newly discovered work by William Shakespeare in 1796, but was soon revealed as a hoax by William Henry Ireland. The pair have plaques in the Walhalla Temple at Regensburg, Bavaria, which honours distinguished figures of German history.Everill (1845:12)."]}, {"page": "1796", "response": ["* April 2 – The only night of the supposed Shakespearean play Vortigern and Rowena (actually written by William Henry Ireland) ends in the audience's laughter."]}, {"page": "1775", "response": ["** William Henry Ireland, English forger (d. 1835)"]}, {"page": "James Boswell", "response": ["After Johnson's death in 1784, Boswell moved to London to try his luck at the English Bar, which proved even less successful than his career in Scotland. In 1792 Boswell lobbied the Home Secretary to help gain royal pardons for four Botany Bay escapees, including Mary Bryant. He also offered to stand for Parliament but failed to get the necessary support, and he spent the final years of his life writing his Life of Samuel Johnson. During this time his health began to fail due to venereal disease and his years of drinking. Boswell died in London in 1795. Close to the end of his life he became strongly convinced that the \"Shakespeare papers\", including two previously unknown plays Vortigern and Rowena and Henry II, allegedly discovered by William Henry Ireland, were genuine. After Boswell's death they proved to be forgeries created by Ireland himself.Pierce pp. 92–93 Boswell's remains were interred in the crypt of the Boswell family mausoleum in what is now the old Auchinleck Kirkyard in Ayrshire. The mausoleum is attached to the old Auchinleck Kirk."]}, {"page": "Mottingham", "response": ["The earliest records of Mottingham are from 862 AD when it was recorded as Modingahema, which means the land of Moda's people and is commonly interpreted as \"the proud place\". In William Henry Ireland's 1830 work England's Topographer: Or A New and Complete History of the County of Kent Volume 4, he writes"]}, {"page": "Vortigern", "response": ["One of Vortigern's most notorious literary appearances is in the play Vortigern and Rowena, which was promoted as a lost work of William Shakespeare when it first emerged in 1796. However, it was soon revealed as a literary forgery written by the play's purported discoverer, William Henry Ireland, who had previously forged a number of other Shakespearean manuscripts. The play was at first accepted as Shakespeare's by some in the literary community, and received a performance at London's Drury Lane Theatre on 2 April 1796. The play's crude writing, however, exposed it as a forgery, and it was laughed off stage and not performed again. Ireland eventually admitted to the hoax and tried to publish the play by his own name, but had little success."]}, {"page": "1835 in literature", "response": ["*April 17 – William Henry Ireland, English poet and forger of Shakespeariana (born 1775)"]}, {"page": "1807 in literature", "response": ["*William Henry Ireland – The Catholic"]}, {"page": "1805 in literature", "response": ["*William Henry Ireland – Gondez the Monk", "*William Henry Ireland – The Confessions of William Henry Ireland"]}, {"page": "1804 in literature", "response": ["*William Henry Ireland – The Sepulchral Summons"]}, {"page": "1800 in literature", "response": ["*William Henry Ireland"]}, {"page": "John Payne Collier", "response": ["During the later 18th century, literary forgeries had a certain esteem, when audacious impostures like the De Situ Britanniae, the pseudo-Ossian, the medieval poems of Thomas Chatterton, or the works of William Henry Ireland might carry their own worth, and capture the romantic imagination. The case of Collier, in the mid-19th century, was different, because it was profoundly shocking to the scholarly establishment to discover that a long-established colleague in their midst, a person closely associated with the British Museum, the editor of numerous important editions, with privileged access to the primary documents of English literature, should become suspected of the systematic falsification of evidence and possibly the mutilation of original materials, especially in relation to William Shakespeare. Much as Sir Edward Dering's forgeries had corrupted the historical record in ways that were then not yet recognized,O.D. Harris, 'Lines of Descent: Appropriations of Ancestry in Stone and Parchment', in T. Rist and A. Gordon (eds), The Arts of Remembrance in Early Modern England: Memorial Cultures of the post-Reformation (Routledge, London 2016), pp. 85-104.R.H. D’Elboux, 'The Dering Brasses,' The Antiquaries Journal XXVII (1947), 11–23. such a presence placed a question-mark over the authenticity of the whole resource, and over the work of other scholars whom he might have misled.    "]}, {"page": "1775 in literature", "response": ["*August 2 – William Henry Ireland, English forger of Shakespeariana (died 1835)"]}, {"page": "1795 in literature", "response": ["*March – William Henry Ireland first displays his Shakespearean forgeries to the public. They will inspire a major controversy when published on 24 December (dated 1796)."]}, {"page": "1799 in literature", "response": ["*William Henry Ireland – The Abbess"]}, {"page": "Folger Shakespeare Library", "response": ["The Folger holds some 60,000 manuscripts (from Elizabeth I and John Donne to Mark Twain and Walt Whitman).Wolfe, Heather (ed. and compiler), \"The Pen's Excellencie\": Treasures from the Manuscript Collection of the Folger Shakespeare Library,\" Washington, D.C.: Folger Shakespeare Library (distributed by University of Washington Press, Seattle), 2002, p. 10 for total number; pp. 51, 151, 183, and 196 for Elizabeth I, Donne, Twain, and Whitman. These handwritten documents date from the 15th to the 21st century and cover a variety of subjects: documents related to performance history and literature, personal correspondences, wills, love letters, and other materials of daily life. Notable manuscripts include the earliest known staging diagram in England, a list of quotations George Eliot compiled while writing Middlemarch, the 18th-century Shakespeare forgeries of William Henry Ireland, and the papers of legendary 18th-century actor David Garrick."]}, {"page": "Shakespeare apocrypha", "response": ["The dream of discovering a new Shakespeare play has also resulted in the creation of at least one hoax. In 1796 William Henry Ireland claimed to have found a lost play of Shakespeare entitled Vortigern and Rowena. Ireland had previously released other documents he claimed were by Shakespeare, but Vortigern was the first play he attempted. (He later produced another pseudo-Shakespearean play, Henry II.) The play was initially accepted by the literary community—albeit not on sight—as genuine. The play was eventually presented at Drury Lane on 2 April 1796, to immediate ridicule, and Ireland eventually admitted to the hoax."]}, {"page": "Strood", "response": ["Gilbert de Glanvill, Bishop of Rochester, in 1190, early during the reign of Richard I founded a hospital in Strood, east of the church, which was afterwards called the Newark or Stroud Hospital, the Yoke or North Yoke being a small manor in Strood. Newark Hospital was important in raising the profile of Strood, however there was constant concern about it financial management, and the rivalry between it and the Rochester Priory. In 1830, under King Henry VIII, the hospital was under the control of the Dean and Chapter of Rochester.William Henry Ireland "]}, {"page": "Reputation of William Shakespeare", "response": ["Opinion of Shakespeare was briefly shaped in the 1790s by the \"discovery\" of the Shakespeare Papers by William Henry Ireland. Ireland claimed to have found in a trunk a goldmine of lost documents of Shakespeare's including two plays, Vortigern and Rowena and Henry II. These documents appeared to demonstrate a number of unknown facts about Shakespeare that shaped opinion of his works, including a Profession of Faith demonstrating Shakespeare was a Protestant and that he had an illegitimate child. Although there were many believers in the provenance of the Papers they soon came under fierce attack from scholars who pointed out numerous inaccuracies. Vortigern had only one performance at the Drury Lane Theatre before Ireland admitted he had forged the documents and written the plays himself.Pierce pp. 137–181"]}, {"page": "List of hoaxes", "response": ["* The Ireland Shakespeare forgeries, a collection of Shakespeare-related documents supposedly discovered by William Henry Ireland and published in 1795 by his father, Samuel Ireland; the discoveries included a \"lost\" play, Vortigern and Rowena"]}, {"page": "Samuel William Henry Ireland", "response": ["#REDIRECT William Henry Ireland"]}, {"page": "Catigern", "response": ["Catigern appears briefly in Geoffrey of Monmouth's chronicle Historia Regum Britanniae, in a section adapted from the Historia Brittonum account. Geoffrey adds the detail that Catigern and Horsa personally met in battle at Epsford and slew each other.Historia Regum Brittaniae, Book 6, ch. 13. Geoffrey's account spread widely through the Middle Ages and after, and Catigern has appeared in adaptations of Geoffrey, and occasionally, in other derivative works. His battle with Horsa is the subject of John Lesslie Hall's poem \"The Death of Horsa\",Hall, John Lesslie (1899). \"The Death of Horsa\". From The Camelot Project at the University of Rochester. Retrieved December 14, 2009. and he appears as a minor character in William Henry Ireland's play Vortigern and Rowena, which was initially touted as a lost work by William Shakespeare."]}, {"page": "1835 in the United Kingdom", "response": ["* 17 April – William Henry Ireland, poet and forger of Shakespeariana (born 1775)"]}, {"page": "Secretary hand", "response": ["William Henry Ireland used the secretary hand to forge many Shakespeare documents."]}, {"page": "Vortigern and Rowena", "response": ["Vortigern and Rowena, or Vortigern, an Historical Play, is a play that was touted as a newly discovered work by William Shakespeare when it first appeared in 1796. It was eventually revealed to be a Shakespeare hoax, the product of prominent forger William Henry Ireland. Its first performance was on 2 April 1796, when it was ridiculed by the audience. Its titular protagonists, Vortigern and Rowena, are figures from Britain's traditional history.", "Ireland had produced several earlier documents he claimed represented the writings of Shakespeare, but Vortigern and Rowena was the first play he attempted. He shortly followed it with a forged Henry II. He had announced his \"discovery\" of the lost play as early as 26 December 1794 but did not show his father a manuscript until March 1795. He also provided a purported correspondence between Shakespeare and a printer explaining why the play was unpublished, as well as a deed accounting for how it came to be in hands of the Irelands.Kahan, pp. 62–66. According to the deed, Shakespeare had willed all the manuscripts to an ancestor of the Irelands, also named William Henry Ireland, who had saved him from drowning. Years later, Ireland explained that he came up with this story to establish his right to the manuscripts in case a descendant of the bard might claim them.William Henry Ireland, Authentic Account. pp. 22–23.", "When Vortigern and Rowena opened on 2 April 1796 Kemble used the chance to hint at his opinion by repeating Vortigern's line \"and when this solemn mockery is o'er,\" and the play was derided by the audience. It was never performed again until 2008. Some early critics accused William Henry Ireland's father Samuel of the forgery, though William assumed responsibility in two printed confessions. Samuel himself continued to regard the play as authentic and edited it in 1799, including a foreword in which he attacked Malone's findings and denounced the \"illiberal and injurious treatment\" he had received. Nevertheless, neither Ireland's reputation recovered from the fiasco, and William eventually moved to France, where he lived for several decades. He tried to publish Vortigern and Rowena as his own work when he returned to England in 1832, but met with little success.Kahan, p. 207", "* Ireland, William Henry (1805). The Confessions of William Henry Ireland. Reprinted 2001. Elibron Classics. .", "* William Henry Ireland's Shakespeare Forgeries"]}, {"page": "Rowena", "response": ["She was a titular character in William Henry Ireland's play Vortigern and Rowena (1796). Her name was later borrowed by Walter Scott for the beautiful Saxon heroine in his historical novel Ivanhoe (1819), after which it came into use as an English given name. (Presumably due to the original legendary Rowena's character flaws, her name was not commonly used until after the appearance of Ivanhoe.)"]}, {"page": "Penenden Heath", "response": ["Before the expansion of Maidstone, the heath was often used as a venue for a site for shire moots (or assemblies) during the Middle Ages. The most famous of these occurred shortly after the Norman Conquest of 1066 and involved a dispute between Odo bishop of Bayeux, half-brother of William the Conqueror and Lanfranc, Archbishop of Canterbury (see below).A Report on the Penenden Trial by W. Levison, The English Historical Review, Vol. 27, No. 108 (Oct. 1912), pp. 717–720 The Domesday Book of 1086 subsequently recorded Pinnedenna as the place for the landowners of Kent to gather to receive notice in matters of administration at the shire court (and, if they did not attend, they should pay forfeiture of \"one hundred shillings\" to the King).Consuetudines Kanciae: A History of Gavelkind, and Other Remarkable Customs by Charles Sandys at page 304 (Google Books)England's Topographer Or A New and Complete History of the County of Kent by William Henry Ireland"]}, {"page": "Gilbert Glanvill", "response": ["In 1190, early during the reign of Richard I, he founded a hospital in Strood, east of the church, which was afterwards called the Newark or Stroud Hospital. In 1830, under King Henry VIII, the hospital was put under the control of the Dean and Chapter of Rochester.William Henry Ireland "]}, {"page": "Trial of Penenden Heath", "response": ["Various prominent figures in the country at the time were called including Geoffrey de Montbray Bishop of Coutances (who represented the King), Lanfranc (for the Church), Odo de Bayeux (defending himself), Arnost Bishop of Rochester, Æthelric II (former Bishop of Selsey), Richard de Tunibridge, Hugh de Montfort, William de Arsic, Hamo Vicecomes and many others.England's Topographer Or A New and Complete History of the County of Kent by William Henry Ireland"]}, {"page": "Mote Park", "response": ["In the 13th century, the \"mote\" lands were incorporated into the manor of local landowners and a manor house in the area of the present-day park is described as being castellated (or fortified) with emparked grounds. This is believed to indicate the area was used as one of the earliest deer parks in Kent.History of Mote Park at Maidstone Borough Council England's Topographer: Or A New and Complete History of the County of Kent by William Henry Ireland pages 634 to 638 (Published 1829)Park The town and parish of Maidstone: Town and manors, The History and Topographical Survey of the County of Kent: Volume 4 by Edward Hasted (1798), pages 260-307"]}, {"page": "The Abbess", "response": ["The Abbess: A Romance is a gothic novel by William Henry Ireland first published in 1799. The text was modelled upon Matthew Lewis's The Monk (1796)."]}, {"page": "Samuel Ireland", "response": ["Samuel Ireland (21 May 1744 – July 1800), English author and engraver, is best remembered today as the chief victim of the Ireland Shakespeare forgeries created by his son, William Henry Ireland."]}, {"page": "Ireland Shakespeare forgeries", "response": ["The Ireland Shakespeare forgeries were a cause célèbre in 1790s London, when author and engraver Samuel Ireland announced the discovery of a treasure-trove of Shakespearean manuscripts by his son William Henry Ireland. Among them were the manuscripts of four plays, two of them previously unknown.", "Upon the release of the manuscripts, such respected literary figures as James Boswell (biographer of Samuel Johnson) and poet laureate Henry James Pye pronounced them genuine, as did various antiquarian experts. Richard Brinsley Sheridan, the leading theatre manager of his day, agreed to present one of the newly discovered plays with John Philip Kemble in the starring role. Excitement over the biographical and literary significance of the find turned to acrimony, however, when it was charged that the documents were forgeries. Edmond Malone, widely regarded as the greatest Shakespeare scholar of his time, conclusively showed that the language, orthography, and handwriting were not those of the times and persons to which they were credited. William Henry Ireland, the supposed discoverer, then confessed to the fraud.", "His son William Henry Ireland had a fascination with forgery. He was heavily influenced by the novel Love and Madness by Herbert Croft which contained lengthy passages on the forger Thomas Chatterton. William witnessed his father's frustration first-hand. One moment, in particular, struck him forcibly. Knowing that the furniture and papers from New Place, Shakespeare's last residence, had been moved to Clopton house when New Place was demolished, Samuel Ireland reasoned that Shakespearean manuscripts might well be found there.Samuel Ireland, Picturesque Views on the Upper, or Warwickshire, Avon (London 1796), p. 204; William Henry says that old residents told them papers had been moved there at the time of the Stratford fire. Upon visiting however, he was informed by the current tenant that all the old papers—many of them Shakespeare's—had recently been burned. Samuel Ireland's distress at this news made a strong impression on the young man—even though it later turned out that this story was nothing more than a joke at Ireland's expense.William Henry Ireland related this story in the Authentic Account (pp. 5–6), the Confessions (pp. 30–33), and the unpublished Full and Explanatory Account (according to Schoenbaum, p. 192). Edmond Malone investigated the incident, writing to the owner about the propriety of a tenant destroying his landlord's papers; the tenant denied the incident and admitted it was a practical joke. Mair, pp. 19–20, and Schoenbaum, p. 193, have brief accounts of the subsequent investigation of the incident. According to the younger Ireland's confessions, it was to please his father that he embarked on the career of literary forgery that would ultimately ruin them both.Confessions, p. 302.", "From a chance acquaintance met at a book-binder's the young man learned of a technique for simulating the appearance of ancient writing by using a special ink and then heating the paper.William Henry Ireland, Authentic Account, p. 4. After a trial run creating a couple of relatively insignificant documents, he set out to devise something with Shakespeare's signature. His work at a legal firm gave him access to Elizabethan and Jacobean parchment deeds, so in December 1794 he cut a piece of parchment from one of them, used his special ink to write with and heated it over a candle. The result was a mortgage deed between Shakespeare and his fellow-actor John Heminges on one side, and Michael Fraser and his wife on the other.  The text and signature he copied from the facsimile of the genuine 1612 mortgage deed printed in Malone's edition of Shakespeare.Schoenbaum, p. 197; in his published accounts William Henry Ireland claims to have used the Johnson-Steevens edition, but the Blackfriars mortgage deed he used as a basis for the forgery did not appear there, and was first printed in Malone's edition. In his unpublished accounts he admitted to using Malone's edition. Ripping a seal from another early deed, young Ireland attached it to this concoction and presented the result to his father on 16 December. Samuel Ireland accepted it as authentic, and the next day took it to the Heralds' Office, which approved it as genuine.Mair, pp. 27–29.", "With his next discovery William Henry moved from mere forgery to original art.Mair, The Fourth Forger, p. 31. Having learned—apparently from a chance remark by one of his father's friends rather than by research—that Henry Wriothesley, 3rd Earl of Southampton had been Shakespeare's patron, he decided to create correspondence between them.William Henry Ireland, Confessions, p. 78. \"Doe notte esteeme me a sluggarde nor tardye for thus havyinge delayed to answerre or rather toe thank you for youre greate Bountye,\" he has Shakespeare write sans punctuation.  \"[G]ratitude is alle I have toe utter and that is tooe greate ande tooe sublyme a feeling for poore mortalls toe expresse O my Lord itte is a Budde which Bllossommes Bllooms butte never dyes.\" The Earl of Southampton replies in a similar vein, also sans punctuation, and with a similar spelling: “…as I have beene thye Freynde soe will I continue aughte thatte I canne doe forre thee praye commande me ande you shalle fynde mee Yours Southampton”.Text from Samuel Ireland, Miscellaneous Papers and Legal Instruments under the Hand and Seal of William Shakspeare, 1796. To explain how both letters could end up together in the same collection William Henry added a note explaining that Shakespeare’s was a “Copye” of the letter he sent. Samuel Ireland and his friends admired the style of the letters but not the earl’s penmanship; William Henry, not knowing that handwriting of the earl was extant, had written Southampton’s reply with his left hand.Confessions, pp. 78–83.", "A flood of documents now followed, all coming from Mr. H’s ostensibly-miraculous chest. Shakespeare’s “Profession of Faith” proved he was a Protestant, a letter to fellow-actor Richard Cowley showed he was \"a perfect good natured man\",William Henry Ireland, Authentic Account, p. 15. and a letter from Queen Elizabeth made it clear that he was favoured by the most powerful person in the land. A sketch of himself that accompanied his letter to Cowley showed that he was a wretched draftsman with an impenetrable sense of humour. Described in the letter as a \"whysycalle conceyte\", it was (as Malone put it) \"most truly whimsical, being a miserable drawing of our poet done by himself with a pen, from Martin Droeshout's print of him engraved seven years after his death….\"Edmond Malone, An Inquiry into the Authenticity of Certain Papers and Instruments Attributed to Shakespeare, p. 209. There were also theatrical receipts, contracts, a letter and poem to his future wife, \"Anna Hatherrewaye\", and even books from Shakespeare's library, complete with marginal annotations actually signed by the bard himself. Of most interest, however, were a manuscript of King Lear Shakespeare had prepared for the press, a few stray leaves of \"Hamblette\", and two previously unknown plays, Vortigern and Rowena and Henry II.", "One hitch developed when an alert visitor noted that a document supposedly written by the Earl of Leicester was dated 1590, whereas the nobleman had died in 1588.Kahan, Reforging Shakespeare, p. 86; Samuel Schoenbaum, Shakespeare's Lives, p. 206. When Samuel Ireland confronted his son with this information, William Henry wanted to burn the document, but his father demurred. He suggested that the document might have been misdated at some later time, and the two agreed to tear off the date.William Henry Ireland, A Full and Explanatory Account, MS, cited in Schoenbaum, op. cit. The item was displayed, and subsequently printed, in this mutilated form. At least two scholars, antiquary Joseph RitsonRitson to Paton, 21 July 1795 in The Letters of Joseph Ritson, volume 2, pp. 91–93. and classicist Richard Porson,Bernard Grebanier, The Great Shakespeare Forgery, p. 137. correctly recognised the documents as forgeries, and editor Henry Bate Dudley started lampooning the papers as early as 17 February 1795.Grebanier, p. 127, Schoenbaum, p. 212; Mair, p. 59.", "As early as 26 December 1794 William Henry had announced the existence of Shakespeare's unknown play Vortigern and Rowena, but it was not until March that he was able to present his father with the manuscript. It came with Shakespeare's correspondence with a printer purporting to explain why the play was unpublished.Kahan, pp. 62–66. Both Richard Brinsley Sheridan of Drury Lane Theatre and Thomas Harris of Covent Garden expressed an interest in producing the play. Sheridan was the winner in this competition. Prompted by fears that a descendant of Shakespeare might surface to claim the rights to his productions, William Henry produced a deed to prove that one of his ancestors, coincidentally named William Henry Ireland, had saved Shakespeare from drowning, and that Shakespeare had rewarded him with all the newly discovered manuscripts.William Henry Ireland, Authentic Account. pp. 22–23.", "The second blow came two days later, on 2 April, with the failure of Vortigern at Drury Lane Theatre. The excitement was intense and the crowd volatile; tickets had sold out early and seats were hard come by. While at first the play seemed to be a success with the audience, soon fits of laughter were heard and at one point the play came to a complete halt till order was restored. When Barrymore announced another performance of the play, the audience rebelled, and chaos reigned until the management substituted something else.Joseph Farington, diary entry for 2 April 1796, in the Farington Diary (London 1922–28), p. 145; James Anson Farrer, Literary Forgeries (London, 1907), pp. 226–232. William Henry Ireland blamed the actors, particularly Kemble, along with a \"Malone faction,\" for the failure of his play.Confessions, pp. 156–159. Others attributed it to the quality of the play itself.Farington, op. cit.; William P. Marsh, Clubs of London (London, 1828), volume 2, pp. 107–111. Vortigern's opening night was also its final performance.", "Blaming Malone for his misfortunes, Samuel Ireland set out to write a book that would destroy the scholar's reputation. With the aid of Thomas Caldecott he attacked Malone for using forensic techniques like handwriting comparison to settle a literary question, rather than relying on taste and aesthetic sensibilities.DNB, p. 35; Samuel Ireland, Investigation; see especially 46–49. Concerned for his father's reputation William Henry rushed into print with a pamphlet confessing to the forgeries, and his father replied immediately with a vindication of his conduct in the whole affair.Hood, p. 422. William Henry Ireland says in the opening statement to the Authentic Account that his motive is \"to remove the odium under which my father labours\". This combination roused suspicions. George Steevens accused the two of collusion:The hopeful youth takes on himself the guilt of the entire forgery, and strains hard to exculpate his worthy father from the slightest participation in it. The father, on the contrary, declares that his son had not sufficient abilities for the execution of so difficult a task. Between them, in short, there is a pretended quarrel, that they may not look as if they were acting in concert on the present occasion.George Steevens to Bishop Percy, 26 December 1796, in John Bowyers Nichols, Illustrations of the Literary History of the Eighteenth Century (London, 1848), volume 7, pp. 7–8.The charge would stick. George Chalmers' Apology for the Believers and Samuel Ireland's Investigation concentrated on attacking Malone rather than exonerating Samuel, and the public verdict was probably summed up in a print by John Nixon depicting the entire Ireland family engaged in forging the papers.DNB, p. 35. The Nixon print, \"The Oaken Chest, or, The Gold Mines of Ireland a Farce is available at the Folger Library web site .", "* William Henry Ireland, Authentic Account of the Shakespearian MSS, 1796. Text at Wikisource. Page images at Google.", "* William Henry Ireland, Confessions, 1805. (Page images at Google)"]}, {"page": "Edward Burgh (baron)", "response": ["His first marriage, at the age of 13, was to the 9 year old heiress, Anne Cobham (daughter of Sir Thomas, de jure 5th Baron Cobham of Sterborough and Lady Anne Stafford) who had been \"affianced\" to the recently deceased Edward Blount, 2nd Baron Mountjoy: she brought him ownership of Sterborough Castle.William Henry Ireland, England's topographer, or A new and complete history of the county of Kent, 1830, p.612 Anne Cobham succeeded to the title of 6th Baroness Cobham de jure in 1471.Cokayne, and others, The Complete Peerage, volume II, page 422. They had two known children: Thomas and Sir Henry Burgh.Douglas Richardson. Magna Carta Ancestry, Genealogical Publishing, 2005. pg 172. Google eBook"]}]}}