{"wiki_id": "http://www.wikidata.org/entity/Q40629995", "itemLabel": "Henry Chisholm", "itemDescription": "American businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Chisholm", "wikipedia_page": {"main": "Henry Chisholm (April 22, 1822 – May 9, 1881) was a Scottish American businessman and steel industry executive during the Gilded Age in the United States. A resident of Cleveland, Ohio, he purchased a small, struggling iron foundry which became the Cleveland Rolling Mill, one of the largest steel firms in the nation. He is known as the \"father of the Cleveland steel trade\".", "link_mentions": [{"page": "Fife", "response": ["* Henry Chisholm, steel industry executive"]}, {"page": "Charles Henry Niehaus", "response": ["File:Statue front - Henry Chisholm statue - Lake View Cemetery.jpg|Henry Chisholm, (1884), Lake View Cemetery, Cleveland, Ohio"]}, {"page": "Amasa Stone", "response": ["A third steel mill organized by Stone was the Cleveland Rolling Mill (later known as the American Steel & Wire Co.), which was organized on November 9, 1863. The firm was established in 1857 as Chisholm, Jones and Company, and in 1860 the company was reorganized as Stone, Chisholm & Jones after the family-run business received major investments from Amasa Stone, Henry Chisholm, Andros Stone, Stillman Witt, Jeptha Wade, and Henry B. Payne. Andros Stone managed the firm. It changed its name to the Cleveland Rolling Mill Company, purchased the Cleveland Wire Mill Co. in 1866, and obtained control of the Union Rolling Mill Co. of Chicago in 1871.  At some point, Stone also invested a substantial sum in the Kansas City Rolling Mill Company of Kansas City, Missouri.", "Stone then founded the Union Steel Screw Company in 1872 with Andros Stone, William Chisholm, Henry Chisholm, and Henry B. Payne. The factory, which was located at Case and Payne Avenues in Cleveland, was the only one in the United States making steel wood screws at that time."]}, {"page": "Chisholm (surname)", "response": ["* Henry Chisholm (1822–1881), Scottish American businessman"]}, {"page": "SS Henry Chisholm", "response": ["The Henry Chisholm was a wooden freighter; it was sunk off the shore of Isle Royale in Lake Superior in 1898 and the remains are still on the lake bottom.  The wreck was placed on the National Register of Historic Places in 1984.", "thumb|left|The steamer Henry Chisholm at the Northwest Coal Dock in Duluth, Minnesota", "The Henry Chisholm (Official number 95610) was built in 1880 at Thomas Quayle & Sons shipyards in Cleveland, Ohio, which was considered the best wooden shipbuilders on the Great Lakes.  She was a 265-foot wooden steam-powered freighter, 39 feet in breadth and 20 feet in depth, carrying three masts and a double expansion steam engine with twin Scotch boilers capable of producing 1707HP, powering a single screw.  The hull was reinforced with steel and iron strapping, and was the largest wooden \"steam barge\" ever built in Cleveland, approaching the practical size limit for a wooden vessel of its type.  The ship cost $125,999 to build, and was launched on August 28, 1880.", "The ship was built for Alva Bradley of Cleveland, and named for Henry Chisholm, father of the steel industry in that city. It was used on the Great Lakes from the time it was built until 1898, and frequently set records for cargo capacity, often towing several barges at once.", "The Henry Chisholm sits in waters of 80 to 150 feet, lying on its side. Portions of the wooden hull are intermingled with the wreckage of the Cumberland, which had sunk earlier in 1877.  The stern of the ship is broken away from the rest of the wreckage, and sits some distance away."]}, {"page": "Lake View Cemetery", "response": ["* Henry Chisholm (1822–1891), father of the Cleveland steel industry"]}, {"page": "Cleveland Rolling Mill", "response": ["The company stemmed from developments initiated in 1857, when John and David I. Jones, along with Henry Chisholm, established a rolling mill at Newburgh, incorporated as Chisholm, Jones & Company, to reroll worn rails.", "In June 1885 a larger and more violent strike occurred, this time led by Polish and Czech workers in response to wage cuts. The violent tactics used by the strikers made the union unable to sustain support by the English-speaking skilled workers, who eventually returned to work in September. To prevent further riots by the unskilled workers, Mayor George Gardner ordered the company's president (William Chisholm, the oldest son of Henry Chisholm) to revert the wage cuts, which ended the strike, although many of the striking workers were denied their jobs back."]}, {"page": "Union–Miles Park", "response": ["thumb|Henry Chisholm, the driving force behind Cleveland Rolling Mill.", "* The Union Iron Works, established in 1869. Its works were built adjacent to the neighborhood's western border just north of Union Avenue (at what is now the northeast corner of the intersection of Union Avenue and E. 78th Street). Founder Samuel Augustus Fuller established the mill to roll railway rails. Henry Chisholm purchased the company in 1871 and combined it with the Aetna works two blocks to the south to produce steel using the Bessemer process. The firm built the Emma Furnace in 1872, a massive and famous blast furnace named for Emma Paton (daughter of David Jones and wife of Aetna Iron co-founded James Paton). Additional, smaller furnaces were constructed in 1875. Fuller bought the mills back in 1880 and formed the Union Rolling Mill Co. Chisholm spun off the Emma Furnace under the ownership of the Newburg Furnace Co. in January 1882, and it was purchased by the Union Rolling Mill Co. in August 1883. By 1893, the Union Rolling Mill Co. employed 400 workers on  of land."]}, {"page": "Samuel Augustus Fuller", "response": ["Fuller joined the Cleveland Iron and Nail Company in 1869, and was elected secretary of the firm. That same year, Fuller founded the Union Iron Works at what is now the northeast corner of the intersection of Union Avenue and E. 78th Street in Cleveland to reroll worn railway rails. Henry Chisholm purchased the company in 1871 and combined it with the Aetna Iron and Nail Company. Chisholm built the massive Emma Furnace at the Union Iron site in 1872.", "Fuller returned to Cleveland in 1880. He bought back his old company from Chisholm, renaming it the Union Rolling Mill Co. The following year, Fuller and partner Paul P. Condit formed Condit, Fuller & Co. This new firm marketed the iron and steel Fuller's mills were producing. Henry Chisholm, who had retained ownership of the Emma Furnace, spun it off as the Newburg Furnace Co. in January 1882. Fuller purchased it in August 1883 and made it part of the Union Rolling Mill Co. again."]}, {"page": "Stillman Witt", "response": ["Stillman Witt also had financial interests in the iron and steel industry. The iron and steel manufacturing firm of Chisholm, Jones and Company had organized in 1857. It was reorganized in 1860 as Stone, Chisholm & Jones after receiving major investments from Stillman Witt, Henry Chisholm, Amasa Stone, Andros Stone, Henry B. Payne, and Jeptha Wade. Witt made a second investment in the firm in November 1863, reorganizing the steel mill into the Cleveland Rolling Mill (later known as the American Steel & Wire Co.). Witt was named a director of the new company. Witt was elected a director of the Mercer Iron & Coal Company in 1865, director of the Pittsburgh and Lake Angeline Iron Company in 1870, and president of the Union Steel Screw Company (a new firm organized by himself, Henry Chisholm, William Chisholm, Henry Payne, Amasa Stone, and Andros Stone) in 1872."]}, {"page": "Valley Railway", "response": ["Whether there were antecedent roads or not, the Valley Railway Company was incorporated in the state of Ohio on August 21, 1871. The incorporators consisted of Henry Chisholm, co-founder and primary investor in the Cleveland Rolling Mill (a steel mill); James Farmer, president of the Ohio National Bank; Samuel Augustus Fuller, founder of the Union Iron Works (a Cleveland iron foundry); David L. King; Nathan P. Payne, a Cleveland coal dealer; and Warrick B. Price, Midwestern real estate developer and former secretary and treasurer of the Milwaukee and Beloit Railroad and the Aetna Iron and Nail Company. The state-issued charter permitted the railroad to construct a line from the city of Cleveland on the shore of Lake Erie south-southeast to the village of Bowerston, Ohio. "]}]}}