{"wiki_id": "http://www.wikidata.org/entity/Q4072105", "itemLabel": "James Atkinson", "itemDescription": "English surgeon, artist and Persian scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Atkinson_(Persian_scholar)", "wikipedia_page": {"main": "James Atkinson (17 March 1780 – 7 August 1852) was a surgeon, artist and Persian scholar — \"a Renaissance man among Anglo-Indians\"\n\n", "link_mentions": [{"page": "Darlington", "response": ["* James Atkinson (1780–1852) – surgeon, artist and Persian scholar"]}, {"page": "Shahnameh", "response": ["There have been a number of English translations, almost all abridged. James Atkinson of the East India Company's medical service undertook a translation into English in his 1832 publication for the Oriental Translation Fund of Great Britain and Ireland, now part of the Royal Asiatic Society.  Between 1905 and 1925, the brothers Arthur and Edmond Warner published a translation of the complete work in nine volumes, now out of print.  There are also modern incomplete translations of the Shahnameh: Reuben Levy's 1967 prose version (later revised by Amin Banani), and another by Dick Davis in a mixture of poetry and prose which appeared in 2006. Also a new English translation of the book in prose by Ahmad Sadri was published in 2013."]}, {"page": "1832 in literature", "response": ["**James Atkinson makes the first translation from Persian into English of Ferdowsi's Shahnameh, The Sha Nameh of the Persian Poet Firdausi, translated and abridged in prose and verse with notes and illustrations; printed for the Oriental Translation Fund of Great Britain and Ireland; sold by John Murray."]}, {"page": "The Rape of the Lock", "response": ["Introducing his 1825 translation of the whole of Tassoni's The Rape of the Bucket, James Atkinson compared the three mock-heroic poems, the Italian, the French and the English. But \"there is little of similarity among them,\" in his view, their humour is distinct. \"The Secchia Rapita indeed differs essentially from the Rape of the Lock, both in spirit, and execution. There is nothing in the latter that can be compared with the humour of the former, or with the admirably grotesque pictures with which it abounds\".Preface to La Secchia Rapita or The Rape of the Bucket, vol. 1, p.vi"]}, {"page": "Persian literature", "response": ["* A selection from Ferdowsi's Shahnameh (935–1020) was published in 1832 by James Atkinson, a physician employed by the British East India Company."]}, {"page": "Brompton Cemetery", "response": ["* James Atkinson – surgeon, artist and Persian scholar"]}, {"page": "James Atkinson", "response": ["James Atkinson may refer to:", "* James Atkinson (surgeon) (1759–1839), English surgeon and bibliographer", "* James Atkinson (software developer), founder of the phpBB project", "* James Atkinson (inventor) (1846–1914), inventor of the Single-Stroke combustion engine in 1882", "* James Atkinson (Persian scholar) (1780–1852), published one of the earliest translations of the Shahnameh in English", "* James Atkinson (bobsleigh) (1929–2010), American bobsleigh competitor at the Winter Olympics", "* James Atkinson (JP), first mayor of Crewe, England", "* James Atkinson (Australian politician) (c. 1820–1873), New South Wales politician", "* James Atkinson (physicist) (1916–2008), radar pioneer", "* James Atkinson (footballer) (born 1995), English goalkeeper for Gretna 2008 ", "* James Atkinson (Neighbours), fictional character from the soap opera Neighbours", "* James Atkinson (theologian) (1914–2011), Church of England priest and academic"]}, {"page": "James Prinsep", "response": ["Prinsep found a position as an assay master at the Calcutta mint and reached Calcutta along with his brother Henry Thoby on 15 September 1819. Within a year at Calcutta, he was sent by his superior, the eminent orientalist Horace Hayman Wilson, to work as assay master at the Benares mint. He stayed at Benares until the closure of that mint in 1830. He then moved back to Calcutta as deputy assay master, and when Wilson resigned in 1832, he was made assay master (overruling Wilson's nominee for that position, James Atkinson) at the new silver mint designed in Greek revival style by Major W. N. Forbes. "]}, {"page": "List of people from Kolkata", "response": ["* James Atkinson (1780—1852), surgeon, artist and Persian scholar."]}, {"page": "History of Dhaka", "response": ["Charles D'Oyly was the District Collector of Dhaka from 1808 to 1811. He made a good collection of painting folios of Dhaka in the book, Antiquities of Dacca. These paintings exhibited much of the ruins of Dhaka from the Mughal era. Short historical accounts of all the paintings was appended. James Atkinson wrote these accounts, accompanied by engravings done by Landseer."]}, {"page": "Bara Katra", "response": ["The northern wing was similar, but with a less elaborate gate. The east and west wings were single storey and about  long. In the 19th century, Orientalist James Atkinson described the building as \"a stupendous pile of grand and beautiful architecture\"."]}, {"page": "La secchia rapita", "response": ["In 1825 the linguist James Atkinson published an ottava rima translation of the whole of Tassoni's poem. In his introduction, while acknowledging the general assumption that the poem is known \"as the model upon which the Rape of the Lock of Pope, and the Lutrin of Boileau are conceived\", goes on to comment that \"there is little of similarity among them. The Secchia Rapita indeed differs essentially from the Rape of the Lock, both in spirit, and execution. There is nothing in the latter that can be compared with the humour of the former, or with the admirably grotesque pictures with which it abounds\".Preface to La Secchia Rapita or The Rape of the Bucket, vol. 1, p.vi"]}, {"page": "Medical and Physical Society of Calcutta", "response": ["*James Atkinson"]}, {"page": "Order of the Durrani Empire", "response": ["The first investiture of the order was held at a grand durbar in the courtyard of the Harem Serai of the Bala Hissar, Kabul, on the evening of 17 September 1839.pp. 322-323 The Expedition into Affghanistan: notes and sketches descriptive of the country, contained in a personal narrative during the campaign of 1839 & 1840 by James Atkinson, etc; published by W H Allen & Co, London, 1842 At the time there were not enough decorations prepared but on the day those who were not on duty were presented before the king.p. 21 The Asiatic Journal and Monthly Miscellany, Volume 31, 1840 The result was that there are numerous variations in the stars and medals as many were subsequently made in India and Europe, particularly in the number of pearls on the order.", "#Superintending Surgeon James Atkinson"]}, {"page": "James Atkinson (translator)", "response": ["#REDIRECT James Atkinson (Persian scholar)"]}, {"page": "Charles D'Oyly", "response": ["During his time in Dacca, he painted a wide variety of pictures, especially the Mughal ruins which he published in a folio-size book with fifteen engravings entitled Antiquties of Dacca (now Dhaka in Bangladesh) in London 1814 and in various reprints from 1823 onwards. A short historical account of Dhaka was also appended to each book. James Atkinson wrote these accounts, with engravings by Edwin Landseer. The Antiquities of Dacca became an important social document of the period."]}, {"page": "James Atkinson (surgeon)", "response": ["James Atkinson (1759–1839) was an English surgeon and bibliographer.", "A medical work attributed to Atkinson by Henry Richard Tedder in the first edition of the Dictionary of National Biography, Description of the New Process of perforating and destroying the Stone in the Bladder, illustrated with Cases and a Drawing of the Instrument, in a Letter addressed to the Medical Board of Calcutta, London, 1831, was in fact by his namesake James Atkinson the orientalist."]}, {"page": "Arthur Conolly", "response": ["Conolly's portrait by James Atkinson is in the British National Portrait Gallery. His 1840–1842 diaries as well as his letters and reports to Sir John Hobhouse and William Cabell are in the British Library; his 1839 letters to Viscount Ponsonby are in the Durham University Library."]}, {"page": "Layla and Majnun (Nizami Ganjavi poem)", "response": ["The first translation of the work was a shortened poem in English. The translation was made by an English orientalist and translator James Atkinson. It was published in 1836. Later, this translation was reissued several times (1894, 1915)."]}]}}