{"wiki_id": "http://www.wikidata.org/entity/Q4085168", "itemLabel": "Thomas Burrowes", "itemDescription": "British artist (1796-1866)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Burrowes_(artist)", "wikipedia_page": {"main": "Thomas Burrowes (1796–1866) was a Captain with the Corps of Royal Sappers and Miners who served as both a surveyor and overseer during the construction of the Rideau Canal in Ontario, Canada.  Burrowes is known, however, for having documented the construction of the canal and the landscape of the surrounding area in a series of watercolour paintings, thus creating an important eyewitness record of one of the most important engineering projects of 19th century Canada.", "link_mentions": [{"page": "Rideau Canal", "response": ["* Eyewitness: Thomas Burrowes on the Rideau Canal, online exhibit on Archives of Ontario website"]}, {"page": "Cataraqui River", "response": ["File:The lock at Lower Brewers nearing completion in 1831.jpg|The lock at Lower Brewers nearing completion in 1831 by Thomas Burrowes", "File:Brewer's Lower Mill - view down the Cataraqui Creek and clearing made for the Rideau Canal, 1829.jpg|Brewer's Lower Mill - view down the Cataraqui Creek and clearing made for the Rideau Canal, 1829 by Thomas Burrowes", "File:View on the Cataraqui Creek, Brewer's Upper Mills in the background, 1830.jpg|View on the Cataraqui Creek, Brewer's Upper Mills in the background, 1830 by Thomas Burrowes"]}, {"page": "Bytown", "response": ["File:Falls of the Rideau River, at the Ottawa River, 1826.jpg|Falls of the Rideau River, at the Ottawa River, 1826 by Thomas Burrowes ", "File:Western and Lesser Fall of the Rideau River; Barrack Hill and Upper Bytown in the left Distance, 1826.jpg|Western and Lesser Fall of the Rideau River; Barrack Hill and Upper Bytown in the left Distance, 1826 by Thomas Burrowes", "File:Hull, (Lower Canada), on the Ottawa River; at the Chaudier (sic) Falls, 1830.jpg|Hull, (Lower Canada), on the Ottawa River; at the Chaudiere Falls, 1830 by Thomas Burrowes", "File:First Eight Locks of the Rideau Canal, the North entrance from the Ottawa River, 1834.jpg|First Eight Locks of the Rideau Canal, the North entrance from the Ottawa River, 1834 by Thomas Burrowes", "File:View at the West end of Wellington Street, Upper Bytown, looking East, 1845.jpg|View at the West end of Wellington Street, Upper Bytown, looking east towards Lower Town in 1845 by Thomas Burrowes"]}, {"page": "Cataraqui Cemetery", "response": ["* Thomas Burrowes – Artist and surveyor "]}, {"page": "List of people from Ottawa", "response": ["| Thomas Burrowes"]}, {"page": "Chaudière Bridge", "response": ["  One of Thomas Burrowes' first assignments during the construction of the Rideau Canal was to help plan and construct the Union Bridge.  The bridge had been needed during the construction of the Rideau Canal because Colonel By's initial base of operations was initially in Wright's Town (Hull).  The bridge received its name to \"symbolize the joining of the Provinces of Upper Canada and Lower Canada\".  The  wooden truss bridge which spanned the Chaudière Falls collapsed on May 18, 1836. A ferry service was temporarily used until a new bridge was opened in 1843."]}, {"page": "Thomas Burrowes", "response": ["Thomas Burrowes may refer to:", "*Thomas Burrowes (artist) (1796–1866), artist known for his watercolours of 19th century Ontario"]}, {"page": "History of Ottawa", "response": ["The first European survey of the Rideau Route, part of an indigenous canoe route that connected the Ottawa River to the St. Lawrence River at Gananoque, was conducted by Lt. Gershom French in 1783.  On October 2, 1783, his survey party camped on the shores of the Rideau River at the head of the portage from the Ottawa River that led around Rideau Falls.  He described the area as \"the soil everywhere good and deep, timbered with Maple, Elm and Butternut\". The War of 1812 made evident the need for a safe military supply route from Montreal to Kingston so the Rideau Route was surveyed for the purposes of a canal, in 1816 by Royal Engineer Joshua Jebb and in 1823-24 by civil surveyor Samuel Clowes. In 1826, Lieutenant-Colonel John By was appointed to oversee its construction and he hired contractors that included Philemon Wright, who supplied much of the stone, mortar and labour, Thomas McKay, a mason, and staff such as John MacTaggart and Thomas Burrowes, surveyor,  (Burrowes' created many paintings of early Bytown.)  The Governor General George Ramsay, the Earl of Dalhousie took a great interest in the construction of the canal, as well as in establishing a settlement in the area.  On September 26, 1826, Colonel By and Dalhousie had agreed that the canal's entrance was to be at Entrance Bay (its current location), and along with a letter authorizing Colonel By to divide the town into lots, marked the origins of what was to become the town of Bytown."]}, {"page": "Wright's Town, Lower Canada", "response": ["File:Hull, (Lower Canada), on the Ottawa River; at the Chaudier (sic) Falls, 1830.jpg|Hull, (Lower Canada), on the Ottawa River; at the Chaudiere Falls, 1830 by Thomas Burrowes"]}]}}