{"wiki_id": "http://www.wikidata.org/entity/Q4083866", "itemLabel": "Richard Bentall", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Bentall", "wikipedia_page": {"main": "Richard Bentall  (born 30 September 1956) is a Professor of Clinical Psychology at the University of Sheffield in the UK.\n\n", "link_mentions": [{"page": "Heritability", "response": ["Heritability estimates' prominent critics, such as Steven Rose, Jay Joseph, and Richard Bentall, focus largely on heritability estimates in behavioral sciences and social sciences.  Bentall has claimed that such heritability scores are typically calculated counterintuitively to derive numerically high scores, that heritability is misinterpreted as genetic determination, and that this alleged bias distracts from other factors that researches have found more causally important, such as childhood abuse causing later psychosis. Heritability estimates are also inherently limited because they do not convey any information regarding whether genes or environment play a larger role in the development of the trait under study. For this reason, David Moore and David Shenk describe the term \"heritability\" in the context of behavior genetics as \"...one of the most misleading in the history of science\" and argue that it has no value except in very rare cases. When studying complex human traits, it is impossible to use heritability analysis to determine the relative contributions of genes and environment, as such traits result from multiple causes interacting.  In particular, Feldman and Lewontin emphasize that heritability is itself a function of environmental variation.  However, some researchers argue that it is possible to disentangle the two.Tredoux, Gavan. \"The Nature and Nurture of Rectangles.\" (2019)."]}, {"page": "List of psychologists", "response": ["* Richard Bentall"]}, {"page": "Karl Jaspers", "response": ["Jaspers considered primary delusions to be ultimately \"un-understandable\", since he believed no coherent reasoning process existed behind their formation. This view has caused some controversy, and the likes of R. D. Laing and Richard Bentall (1999, p. 133–135) have criticised it, stressing that this stance can lead therapists into the complacency of assuming that because they do not understand a patient, the patient is deluded and further investigation on the part of the therapist will have no effect. For instance Huub Engels (2009) argues that schizophrenic disordered speech may be understandable, just as Emil Kraepelin's dream speech is understandable."]}, {"page": "Oliver James (psychologist)", "response": ["Ritchie also responded to a letter from James in The Psychologist magazine, following which James and Prof Richard Bentall of the University of Liverpool engaged him in argument."]}, {"page": "List of people from Sheffield", "response": ["*Richard Bentall, clinical psychologist"]}, {"page": "Ivan Tyrrell", "response": ["In 1993, encouraged by the psychiatrist and writer Robin Skynner, author Doris Lessing, psychologist Joe Griffin and Idries Shah, he launched a journal, The Therapist, in an attempt to increase the scientific rigour of the field. Medical journalist Denise Winn was appointed Editor in 1997 and Ivan Tyrrell became General Editor. In 2000 its name was changed to Human Givens, to reflect the growing interest in the human givens approach to psychotherapy, behaviour and education that he was developing with Griffin. Human givens is now the official journal of the Human Givens Institute. The journal gave him the opportunity of publishing interviews with people whose ideas interested him such as: Richard Bentall, Doris Lessing, Robin Skynner, Margaret Heffernan, John Cacioppo and many others.Archive in HGI website"]}]}}