{"wiki_id": "http://www.wikidata.org/entity/Q40874", "itemLabel": "Doris Lessing", "itemDescription": "British novelist, poet, playwright, librettist, biographer and short story writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Doris_Lessing", "wikipedia_page": {"main": "Doris May Lessing   (née Tayler; 22 October 1919 – 17 November 2013) was a British-Zimbabwean (Rhodesian)  novelist. She was born to British parents in Iran, where she lived until 1925. Her family then moved to Southern Rhodesia (now Zimbabwe), where she remained until moving in 1949 to London, England. Her novels include The Grass Is Singing (1950), the sequence of five novels collectively called Children of Violence (1952–1969), The Golden Notebook (1962), The Good Terrorist (1985), and five novels collectively known as Canopus in Argos: Archives (1979–1983).\nLessing was awarded the 2007 Nobel Prize in Literature. In awarding the prize, the Swedish Academy described her as \"that epicist of the female experience, who with scepticism, fire and visionary power has subjected a divided civilisation to scrutiny\". Lessing was the oldest person ever to receive the Nobel Prize in Literature.In 2001, Lessing was awarded the David Cohen Prize for a lifetime's achievement in British literature. In 2008, The Times ranked her fifth on a list of \"The 50 greatest British writers since 1945\".", "link_mentions": [{"page": "Bildungsroman", "response": ["* Children of Violence by Doris Lessing (1952–1969)"]}, {"page": "J. K. Rowling", "response": ["In May 2008, bookseller Waterstones asked Rowling and 12 other writers (Lisa Appignanesi, Margaret Atwood, Lauren Child, Sebastian Faulks, Richard Ford, Neil Gaiman, Nick Hornby, Doris Lessing, Michael Rosen, Axel Scheffler, Tom Stoppard and Irvine Welsh) to compose a short piece of their own choosing on a single A5 card, which would then be sold at auction in aid of the charities Dyslexia Action and English PEN. Rowling's contribution was an 800-word Harry Potter prequel that concerns Harry's father, James Potter, and godfather, Sirius Black, and takes place three years before Harry was born. The cards were collated and sold for charity in book form in August 2008."]}, {"page": "November 17", "response": ["*  2013   – Doris Lessing, British novelist, poet, playwright, Nobel Prize laureate (b. 1919)"]}, {"page": "October 22", "response": ["*1919 – Doris Lessing, British novelist, poet, playwright, Nobel Prize laureate (d. 2013)"]}, {"page": "Playboy", "response": ["From 1966 to 1976, Robie Macauley was the Fiction Editor at Playboy. During this period the magazine published fiction by Saul Bellow, Seán Ó Faoláin, John Updike, James Dickey, John Cheever, Doris Lessing, Joyce Carol Oates, Vladimir Nabokov, Michael Crichton, John le Carré, Irwin Shaw, Jean Shepherd, Arthur Koestler, Isaac Bashevis Singer, Bernard Malamud, John Irving, Anne Sexton, Nadine Gordimer, Kurt Vonnegut and J. P. Donleavy, as well as poetry by Yevgeny Yevtushenko."]}, {"page": "Philip Glass", "response": ["Glass also dedicated himself to vocal works with two sets of songs, Three Songs for chorus (1984, settings of poems by Leonard Cohen, Octavio Paz and Raymond Lévesque), and a song cycle initiated by CBS Masterworks Records: Songs from Liquid Days (1985), with texts by songwriters such as David Byrne, Paul Simon, in which the Kronos Quartet is featured (as it is in Mishima) in a prominent role. Glass also continued his series of operas with adaptations from literary texts such as The Juniper Tree (an opera collaboration with composer Robert Moran, 1984), Edgar Allan Poe's The Fall of the House of Usher (1987), and also worked with novelist Doris Lessing on the opera The Making of the Representative for Planet 8 (1985–86, and performed by the Houston Grand Opera and English National Opera in 1988).", "Besides writing for the concert hall, Glass continued his ongoing operatic series with adaptions from literary texts: The Marriages of Zones 3, 4 and 5 ([1997] story-libretto by Doris Lessing), In the Penal Colony (2000, after the story by Franz Kafka), and the chamber opera The Sound of a Voice (2003, with David Henry Hwang), which features the Pipa, performed by Wu Man at its premiere. Glass also collaborated again with the co-author of Einstein on the Beach, Robert Wilson, on Monsters of Grace (1998), and created a biographic opera on the life of astronomer Galileo Galilei (2001).", "Glass counts many artists among his friends and collaborators, including visual artists (Richard Serra, Chuck Close, Fredericka Foster), writers (Doris Lessing, David Henry Hwang, Allen Ginsberg), film and theatre directors (including Errol Morris, Robert Wilson, JoAnne Akalaitis, Godfrey Reggio, Paul Schrader, Martin Scorsese, Christopher Hampton, Bernard Rose, and many others), choreographers (Lucinda Childs, Jerome Robbins, Twyla Tharp), and musicians and composers (Ravi Shankar, David Byrne, the conductor Dennis Russell Davies, Foday Musa Suso, Laurie Anderson, Linda Ronstadt, Paul Simon, Pierce Turner, Joan La Barbara, Arthur Russell, David Bowie, Brian Eno, Roberto Carnevale, Patti Smith, Aphex Twin, Lisa Bielawa, Andrew Shapiro, John Moran, Bryce Dessner and Nico Muhly). Among recent collaborators are Glass's fellow New Yorker Woody Allen, Stephen Colbert, and poet and songwriter Leonard Cohen."]}, {"page": "Science fiction", "response": ["David Barnett  has pointed out that there are books such as The Road (2006) by Cormac McCarthy, Cloud Atlas (2004) by David Mitchell, The Gone-Away World (2008) by Nick Harkaway, The Stone Gods (2007) by Jeanette Winterson, and Oryx and Crake (2003) by Margaret Atwood, which use recognizable science fiction tropes, but whose authors and publishers do not market them as science fiction. Doris Lessing, who was later awarded the Nobel Prize in literature, wrote a series of five SF novels, Canopus in Argos: Archives (1979-1983), which depict the efforts of more advanced species and civilizations to influence those less advanced, including humans on Earth."]}, {"page": "The Angry Brigade", "response": ["* The group are parodied in Doris Lessing's The Good Terrorist (1985), in which a group of naive, young, communist squatters split over whether or not to work with the IRA."]}, {"page": "Utopia", "response": ["In science fiction and technological speculation, gender can be challenged on the biological as well as the social level. Marge Piercy's Woman on the Edge of Time portrays equality between the genders and complete equality in sexuality (regardless of the gender of the lovers).  Birth-giving, often felt as the divider that cannot be avoided in discussions of women's rights and roles, has been shifted onto elaborate biological machinery that functions to offer an enriched embryonic experience.  When a child is born, it spends most of its time in the children's ward with peers. Three \"mothers\" per child are the norm and they are chosen in a gender neutral way (men as well as women may become \"mothers\") on the basis of their experience and ability. Technological advances also make possible the freeing of women from childbearing in Shulamith Firestone's The Dialectic of Sex. The fictional aliens in Mary Gentle's Golden Witchbreed start out as gender-neutral children and do not develop into men and women until puberty and gender has no bearing on social roles. In contrast, Doris Lessing's The Marriages Between Zones Three, Four and Five (1980) suggests that men's and women's values are inherent to the sexes and cannot be changed, making a compromise between them essential. In My Own Utopia (1961) by Elizabeth Mann Borghese, gender exists but is dependent upon age rather than sex – genderless children mature into women, some of whom eventually become men. \"William Marston's Wonder Woman comics of the 1940s featured Paradise Island, also known as Themyscira, a matriarchal all-female community of peace, loving submission, bondage and giant space kangaroos.\"Noah Berlatsky, \"Imagine There's No Gender: The Long History of Feminist Utopian Literature,\" The Atlantic, April 15, 2013. https://www.theatlantic.com/sexes/archive/2013/04/imagine-theres-no-gender-the-long-history-of-feminist-utopian-literature/274993/"]}]}}