{"wiki_id": "http://www.wikidata.org/entity/Q4084920", "itemLabel": "Isaac Henry Burkill", "itemDescription": "British botanist (1870-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Isaac_Henry_Burkill", "wikipedia_page": {"main": "Isaac Henry Burkill (18 May 1870 – 8 March 1965) was an English botanist who worked in India and in the Straits Settlements (present day Singapore). He worked primarily in economic botany but published extensively on plant biology, ethno-botany, insect-plant interactions and described several species. He published a two volume compilation on the plants of economic importance in the Malay Peninsula, collating local names and knowledge. He also wrote a detailed history of botany in India. The plant genera Burkillia and Burkillianthus were named in his honour.\n\n", "link_mentions": [{"page": "George Watt (botanist)", "response": ["Watt was born in Old Meldrum, Aberdeenshire, Scotland, the third son of John Watt.  He was educated at Grammar School, King's College and Marischal College, Aberdeen, and later attended both the University of Aberdeen and the University of Glasgow. He received the degrees of M.B. and C.M. in 1873.  He enjoyed teaching and joined the University of Glasgow as a prodissector to the Professor of Anatomy. Around 1864, there was a famine in Orissa and the then Lieutenant-Governor of Bengal, Sir George Campbell was firm that agricultural education was key to avoiding similar disasters and following the recommendations of Sir John Strachey's Famine Commission, a need to carry out scientific study to improve the food supply in India was noted. In order to fulfil this requirement, and on the recommendation of J.D. Hooker, he was selected for the post Professor of Botany, at Presidency College, Calcutta University and joined there in 1873–74. He taught for ten years at a college in Hoogly and at the same time began to study the local botany and began to form a private herbarium. He followed a system of numbering specimens in the field with numbered tag labels detached from similarly numbered sheets in the field to avoid mistakes in labelling. In 1879 he travelled around northwest Punjab and he described several new plant species from the Chamba region. In 1881 he was posted as surgeon to the Burma-Manipur Delimitation Commission with special permission to conduct botanical studies during the expedition. On his return he was made in charge of the Calcutta International Exhibition for 1883–84. Watt organized a 1700-page catalogue for the economic section of the exhibition that was in charge of. Towards the end of the exhibition, the government suggested that the catalogue should be expanded. The expanded version was ready for the Colonial and Indian Exhibition of London in 1886. This was later to become the first volume of his work and he was made a CIE for his work. On his return to India, he was put in charge of the Indian Museum and appointed Reporter on Economic Products under the Department of Revenue and Agriculture. Isaac Henry Burkill worked as an assistant reporter. He organized another exhibition for the Delhi Exhibition of Indian Art on 2 January 1902 and published Indian Art at Delhi. Watt edited the Agricultural Ledger, a government bulletin that collated notes on agricultural products and practices sent by officers posted across India. As an economic botanist, he also published books on cotton and cacao."]}, {"page": "Linnean Medal", "response": ["*1952: Isaac Henry Burkill"]}, {"page": "Garcinia burkillii", "response": ["Garcinia burkillii is a species of flowering plant in the family Clusiaceae. It is a tree endemic to Peninsular Malaysia. It has been named after Isaac Henry Burkill."]}, {"page": "Lithocarpus burkillii", "response": ["Lithocarpus burkillii is a species of plant in the family Fagaceae. It is a tree endemic to Peninsular Malaysia. It is threatened by habitat loss. It has been named after Isaac Henry Burkill."]}, {"page": "I. H. Burkill", "response": ["#REDIRECT Isaac Henry Burkill"]}, {"page": "Richard Eric Holttum", "response": ["Having received botanical training, Holttum was given the role of assistant director at the Singapore Botanical Gardens in 1922, with the guidance of Isaac Henry Burkill. In Singapore, he performed some exhaustive studies, and was promoted to director in 1925, following the retirement of Burkill. His areas of expertise were the growth and cultivation of orchids. He continued working at the Singapore Botanical Gardens even during the Japanese occupation of the country."]}, {"page": "Burkill", "response": ["*Isaac Henry Burkill (1870–1965), English botanist"]}, {"page": "List of botanists by author abbreviation (B)", "response": ["* Burkill – Isaac Henry Burkill (1870–1965)"]}, {"page": "Issac Henry Burkill", "response": ["#REDIRECT Isaac Henry Burkill"]}, {"page": "List of alumni of Gonville and Caius College, Cambridge", "response": ["*Isaac Henry Burkill – botanist"]}, {"page": "List of plant genera named for people (A–C)", "response": ["|rowspan=\"2\" data-sort-value=\"Burkill\"|Isaac Henry Burkill"]}]}}