{"wiki_id": "http://www.wikidata.org/entity/Q4087034", "itemLabel": "Frederick Birks", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Birks", "wikipedia_page": {"main": "Frederick Birks, VC, MM (16 August 1894 – 21 September 1917) was a Welsh-born Australian First World War soldier and recipient of the Victoria Cross, the highest decoration for gallantry \"in the face of the enemy\" that can be awarded to members of the British and Commonwealth forces.\nBorn in Buckley, Flintshire, Birks served in the Royal Artillery for three years before emigrating to Australia in 1913. After serving as a non-commissioned officer during the landing at Gallipoli and the Battle of the Somme, Birks was commissioned as a second lieutenant on 4 May 1917. On 20 September, during the Battle of Passchendaele, while advancing in Glencorse Wood, Ypres, Birks, alongside a corporal, forced a garrison to surrender and captured sixteen men in another attack. His actions were later recognised with the Victoria Cross. The following day, Birks was killed by a shell while attempting to save some of his men.", "link_mentions": [{"page": "Buckley, Flintshire", "response": ["*Frederick Birks, holder of the Victoria Cross for extreme valour as a first world war soldier."]}, {"page": "6th Battalion (Australia)", "response": ["thumb|Frederick Birks, the 6th Battalion's sole Victoria Cross recipient, c. 1916", "After the withdrawal from Gallipoli, the battalion returned to Egypt where they received reinforcements and carried out defensive duties. During this time the AIF was reorganised and expanded as fresh divisions were raised. In order to spread experience across the new units, the existing units were split up and the 6th Battalion provided half its experienced officers and non-commissioned officers (NCOs) to the 58th Battalion. In March 1916, it sailed to France and deployed to the Somme, where it was sent to a quiet sector near Fleurbaix. Its first combat came on 12 June when the battalion launched a trench raid on the Germans opposite their position. Their first major action in France came later, however, at Pozières in July 1916, during which time they lost 102 men killed. Later the battalion fought at Ypres, in Belgium, before returning to the Somme in winter, during which time they undertook defensive duties as well as patrols into no man's land. After this the battalion took part in the Second Battle of Bullecourt, before taking part in the Battle of Menin Road in September 1917, when Lieutenant Frederick Birks earned the 6th Battalion's only Victoria Cross."]}, {"page": "Perth (China Wall) Commonwealth War Graves Commission Cemetery", "response": ["* Second Lieutenant Frederick Birks (1894–1917), 6th Battalion, Australian Imperial Force, who had been born in Flintshire, Wales. accessed 21 January 2010"]}, {"page": "Fred Birks", "response": ["#REDIRECT Frederick Birks"]}, {"page": "September 1917", "response": ["* Died: Frederick Birks, Australian army officer, recipient of the Victoria Cross for action during the Battle of the Menin Road Ridge (killed in action) (b. 1894); Francis Aylmer Maxwell, British army officer, recipient of the Victoria Cross for action during the Second Boer War (killed at the Battle of the Menin Road Ridge) (b. 1871)"]}, {"page": "Birks (surname)", "response": ["*Frederick Birks (1894–1917), Australian recipient of the Victoria Cross"]}, {"page": "1917 in Belgium", "response": ["* 21 September – Frederick Birks (born 1894), Australian soldier"]}, {"page": "George Vause Birks", "response": ["*Frederick Birks, VC, MM (1894–1917) soldier, killed in World War I, appears not to be closely related."]}]}}