{"wiki_id": "http://www.wikidata.org/entity/Q4095737", "itemLabel": "Edwin Bryant", "itemDescription": "American indologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Bryant_(author)", "wikipedia_page": {"main": "Edwin Francis Bryant is an American Indologist. Currently, he is professor of religions of India at Rutgers University. He published seven books and authored a number of articles on Vedic history, yoga, and the Krishna tradition. In his research engagements, he lived several years in India where he studied Sanskrit and was trained with several Indian pundits.", "link_mentions": [{"page": "Chakra", "response": ["Chakra and related beliefs have been important to the esoteric traditions, but they are not directly related to mainstream yoga. According to the Indologist Edwin Bryant and other scholars, the goals of classical yoga such as spiritual liberation (freedom, self-knowledge, moksha) is \"attained entirely differently in classical yoga, and the cakra / nadi / kundalini physiology is completely peripheral to it.\""]}, {"page": "Patanjali", "response": ["Radhakrishnan and Moore attribute the text to the grammarian Patañjali, dating it as 2nd century BCE, during the Maurya Empire (322–185 BCE). Maas estimates Patañjali's Yogasutra's date to be about 400 CE, based on tracing the commentaries on it published in the first millennium CE. Edwin Bryant, on the other hand, surveys the major commentators in his translation of the Yoga Sūtras. He states that \"most scholars date the text shortly after the turn of the Common Era (circa first to second century), but that it has been placed as early as several centuries before that.\" Bryant concludes that \"A number of scholars have dated the Yoga Sūtras as late as the fourth or fifth century C.E., but these arguments have all been challenged\", and late chronology for this Patanjali and his text are problematic."]}, {"page": "Yoga", "response": ["According to Edward Fitzpatrick Crangle, Hindu researchers have favoured a linear theory which attempts \"to interpret the origin and early development of Indian contemplative practices as a sequential growth from an Aryan genesis\"; traditional Hinduism regards the Vedas as the source of all spiritual knowledge. Edwin Bryant wrote that authors who support Indigenous Aryanism also tend to support the linear model.", "Patanjali's Yoga Sutras are considered the first compilation of yoga philosophy. The verses of the Yoga Sutras are terse. Many later Indian scholars studied them and published their commentaries, such as the Vyasa Bhashya (c. 350–450 CE). Patanjali defines the word \"yoga\" in his second sutra, and his terse definition hinges on the meaning of three Sanskrit terms. I. K. Taimni translates it as \"Yoga is the inhibition () of the modifications () of the mind ()\". Swami Vivekananda translates the sutra as \"Yoga is restraining the mind-stuff (Citta) from taking various forms (Vrittis).\" Edwin Bryant writes that to Patanjali, \"Yoga essentially consists of meditative practices culminating in attaining a state of consciousness free from all modes of active or discursive thought, and of eventually attaining a state where consciousness is unaware of any object external to itself, that is, is only aware of its own nature as consciousness unmixed with any other object.\"Edwin Bryant (2011, Rutgers University), The Yoga Sutras of Patanjali IEP"]}, {"page": "Krishna", "response": ["The Chandogya Upanishad, estimated to have been composed sometime between the 8th and 6thcenturiesBCE, has been another source of speculation regarding Krishna in ancient India. The verse (III.xvii.6) mentions Krishna in Krishnaya Devakiputraya as a student of the sage Ghor' of the Angirasa family. Ghora is identified with Neminatha, the twenty-second tirthankara in Jainism, by some scholars. This phrase, which means \"To Krishna the son of Devaki\", has been mentioned by scholars such as Max MüllerMax Müller, Chandogya Upanishad 3.16–3.17, The Upanishads, PartI, Oxford University Press, pp. 50–53 with footnotes as a potential source of fables and Vedic lore about Krishna in the Mahabharata and other ancient literature only potential because this verse could have been interpolated into the text, or the Krishna Devakiputra, could be different from the deity Krishna.Edwin Bryant and Maria Ekstrand (2004), The Hare Krishna Movement, Columbia University Press, , pp. 33–34 with note 3 These doubts are supported by the fact that the much later age Sandilya Bhakti Sutras, a treatise on Krishna,Sandilya Bhakti Sutra SS Rishi (Translator), Sree Gaudia Math (Madras) cites later age compilations such as the Narayana Upanishad but never cites this verse of the Chandogya Upanishad. Other scholars disagree that the Krishna mentioned along with Devaki in the ancient Upanishad is unrelated to the later Hindu god of the Bhagavad Gita fame. For example, Archer states that the coincidence of the two names appearing together in the same Upanishad verse cannot be dismissed easily.WG Archer (2004), The Loves of Krishna in Indian Painting and Poetry, Dover, , p. 5", "Megasthenes, a Greek ethnographer and an ambassador of Seleucus I to the court of Chandragupta Maurya towards the end of 4thcenturyBCE, made reference to Herakles in his famous work Indica. This text is now lost to history, but was quoted in secondary literature by later Greeks such as Arrian, Diodorus, and Strabo. According to these texts, Megasthenes mentioned that the Sourasenoi tribe of India, who worshipped Herakles, had two major cities named Methora and Kleisobora, and a navigable river named the Jobares. According to Edwin Bryant, a professor of Indian religions known for his publications on Krishna, \"there is little doubt that the Sourasenoi refers to the Shurasenas, a branch of the Yadu dynasty to which Krishna belonged\". The word Herakles, states Bryant, is likely a Greek phonetic equivalent of Hari-Krishna, as is Methora of Mathura, Kleisobora of Krishnapura, and the Jobares of Jamuna. Later, when Alexander the Great launched his campaign in the northwest Indian subcontinent, his associates recalled that the soldiers of Porus were carrying an image of Herakles. "]}, {"page": "Durga", "response": ["In Pancharatra texts such as Lakshmi Tantra, Lakshmi is given the status of the primordial goddess (Shakti) and Durga as one of the names and form of Lakshmi. Lakshmi is described as Visnumāyā or Māhāmāyā, or the Yoganidrā of Visnu. The texts also describe that eventhough Lakshmi have Durga form she again got the name Durga after killing the demon Durgamasura.  Authors Edwin Bryant and Maria Ekstrand says, \"The Lakshmi Tantra displays many Sakta elements, yet is a Pancharatra text due to the association of Lakshmi with Vishnu as his Shakti. Lakshmi identifies herself as the \"Mother of all Sounds\", and explains her presence in syllable Om. Author Sir John Woodroffe says, \"The Mārkandeya Purāna and the Lakshmi Tantra in the Pancarātra says: “In this place, I shall kill a great Daitya (Titan) named Durgama. Hence my name shall be Durgā\". Author Hillary Rodrigues says, \"In Lakshmi Tantra, Lakshmi says I am called Durga, as I am difficult to reach, and also because I save my devotee\". "]}, {"page": "2001 in literature", "response": ["*Edwin Bryant – The Quest for the Origins of Vedic Culture"]}, {"page": "David Frawley", "response": ["While being rejected by academia, he has successful in the popular market; according to Bryant, his works are clearly directed and articulated at such audiences. He's been a prominent voice in the introduction of Ayurvedic medicine and Vedic astrology among a western, nonmedical trained audience. According to Edwin Bryant, he is \"well-received\" by \"the Indian community,\"  noting that a Westerner rejecting the Aryan Migration Theory has an obvious appeal in India and Frawley (along with Koenraad Elst) fits in it, perfectly. Frawley commands a significant following on Twitter, as well."]}, {"page": "Subhash Kak", "response": ["Kak co-authored In Search of the Cradle of Civilization with Georg Feuerstein and David Frawley, equating the Vedic Aryans with the Harappans and thus, participating in the political controversy around the \"Indigenous Aryans\" theory.Edwin Bryant, The Quest for the Origins of Vedic Culture: The Indo-Aryan Migration Debate. Oxford University Press, 2001. The chronology espoused in this book is based on the archaeoastronomical readings obtained by correlating textual references and archaeological remains.", "Edwin Bryant calls him a well read and articulate spokesman for the Indigenous Aryan hypothesis and for other issues concerning ancient Indian science and culture."]}, {"page": "Vaikuntha", "response": ["Edwin Bryant, in his book from 2003, comments about the verses describing Vaikuntha in the text of Bhagavata Purana:"]}, {"page": "Dasa", "response": ["Max Müller proposed that dasa referred to indigenous peoples living in South Asia before the arrival of the Aryans.Edwin Bryant (2004), The Quest for the Origins of Vedic Culture: The Indo-Aryan Migration Debate, Oxford University Press, , pages 59–67"]}, {"page": "Yoga Sutras of Patanjali", "response": ["Edwin Bryant, on the other hand, surveyed the major commentators in his translation of the Yoga Sūtras. He observed that \"Most scholars date the text shortly after the turn of the Common Era (circa first to second century), but that it has been placed as early as several centuries before that.\" Bryant concluded that \"A number of scholars have dated the Yoga Sūtras as late as the fourth or fifth century CE, but these arguments have all been challenged. ... All such arguments [for a late date] are problematic.\"", "The metaphysics of Patanjali is built on the same dualist foundation as the Samkhya school.Edwin Bryant (2011, Rutgers University), The Yoga Sutras of Patanjali IEP The universe is conceptualized as of two realities in Samkhya-Yoga schools: Puruṣa (consciousness) and prakriti (mind, cognition, emotions, and matter). It considers consciousness and matter, self/soul and body as two different realities. Jiva (a living being) is considered as a state in which puruṣa is bonded to prakriti in some form, in various permutations and combinations of various elements, senses, feelings, activity and mind.Samkhya - Hinduism Encyclopædia Britannica (2014) During the state of imbalance or ignorance, one of more constituents overwhelm the others, creating a form of bondage. The end of this bondage is called Kaivalya, liberation, or moksha by both Yoga and Samkhya school.Gerald James Larson (2011), Classical Sāṃkhya: An Interpretation of Its History and Meaning, Motilal Banarsidass, , pages 36-47 The ethical theory of Yoga school is based on Yamas and Niyama, as well as elements of the Guṇa theory of Samkhya.", "According to Bryant, the purpose of yoga is liberation from suffering, by means of discriminative discernment. The eight limbs are \"the means of achieving discriminative discernment,\" the \"uncoupling of puruṣa from all connection with prakṛti and all involvement with the citta.\" Bryant states that, to Patanjali, Yoga-practice \"essentially consists of meditative practices culminating in attaining a state of consciousness free from all modes of active or discursive thought, and of eventually attaining a state where consciousness is unaware of any object external to itself, that is, is only aware of its own nature as consciousness unmixed with any other object.\"Edwin Bryant (2011, Rutgers University), The Yoga Sutras of Patanjali IEP ", "* Edwin Bryant, The Yoga Sutras of Patanjali, IEP"]}, {"page": "Bhagavata Purana", "response": ["Bryant states that the monism  in Bhagavata Purana is certainly built on Vedanta foundations, but not exactly the same as the monism of Adi Shankara. The Bhagavata asserts, according to Bryant, that the empirical and the spiritual universe are both metaphysical realities, and manifestations of the same Oneness, just like heat and light are \"real but different\" manifestations of sunlight.Edwin Bryant (2004), Krishna: The Beautiful Legend of God: Srimad Bhagavata Purana Book X, Penguin, , pages 43-48", "* Krishna: The Beautiful Legend of God: Srimad Bhagavata Purana Book X by Edwin F. Bryant (2004)Edwin Bryant (2004), Krishna: The Beautiful Legend of God: Srimad Bhagavata Purana Book X, Penguin, ", "* Edwin Bryant (2004), Krishna: The Beautiful Legend of God: Srimad Bhagavata Purana Book X, Penguin, "]}, {"page": "Karma in Hinduism", "response": ["In Chapter 1 of 10th book of the Bhagavata Purana, Vasudeva, the father of Krishna, exhorts Kamsa to refrain from killing his wife, Devaki, the mother of Krishna, by stating that death is certain for those who are born and when the body returns to the five elements, the soul leaves the body and helplessly obtains another form in accordance with the laws of karma, citing passages from Brihadaranyaka Upanishad, IV:4:3.Krishna, the Beautiful Legend of God, pgs 11-12, and commentary pgs. 423-424, by Edwin Bryant Moreover, he adds and states that the soul materializes into an appropriate body whatever the state of the mind one remembers at the time of death; i.e., at the time of the death, the soul and its subtle body of mind, intelligence and ego, is projected into the womb of a creature, human or non-human that can provide a gross body that is most suitable for the dominant state of the mind of the particular person at the time of death; note that this passage is similar in meaning as Bhagavad Gita, VIII, verse 6 Edwin Bryant, Associate Professor of religion at Rutgers University, New Jersey provided the foregoing commentaries on the discussion of Vasudeva in the Bhagavata Purana."]}, {"page": "2005 in literature", "response": ["*Edwin Bryant – Indo-Aryan Controversy: Evidence and inference in Indian history"]}, {"page": "Indology", "response": ["* Edwin Bryant (1957–present) Rutgers University, New Jersey"]}, {"page": "P. N. Oak", "response": ["Srinivas Aravamudan notes Oak to be a 'mythistorian' whose work resorted to exploiting comparative philology in the generation of delusional etymologies—associating Sanskrit sound-alikes with foreign terms such as Vatican=vatika (hermitage), Christianity=Krishna-niti (the way of Krishna), Abraham as an aberration of Brahma -- to purvey an Islamophobic and anti-Christian agenda under the covers of Hindutva. Edwin Bryant in his work on Indo-Aryan theory describes Oak to be a self-styled historian whose works suffer from an ubiquitous and very poor standard of professionalism and critical methodology and who fit the definition of a crack-pot."]}, {"page": "The Quest for the Origins of Vedic Culture", "response": ["#REDIRECT Edwin Bryant (author)"]}, {"page": "Journal of Vaishnava Studies", "response": ["Edwin Bryant and Maria Ekstrand describe the journal as a \"truly nonpartisan enterprise that highlights contemporary research by major scholars not only of the Chaitanya tradition but also of Vaishnavism in general\"."]}, {"page": "List of philosophers born in the 20th century", "response": ["* Edwin Bryant (born 1957)"]}]}}