{"wiki_id": "http://www.wikidata.org/entity/Q409936", "itemLabel": "Aislín McGuckin", "itemDescription": "Northern Irish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Aisl%C3%ADn_McGuckin", "wikipedia_page": {"main": "Aislín McGuckin is a Northern Irish actress. She has appeared in theatre, television, and film roles. Her early film work includes The Nephew and The White Countess. From 2014 to 2015, she starred as Letitia MacKenzie in the Starz series Outlander, and in 2020, played Marianne's mother, Denise, in the BBC One miniseries Normal People.", "link_mentions": [{"page": "Unknown Soldier", "response": ["* The Unknown Soldier (1998 miniseries), a British miniseries featuring Aislín McGuckin"]}, {"page": "Aidan McArdle", "response": ["He was married to actress Aislín McGuckin. They divorced in 2019. He is a cousin of Steve Coogan"]}, {"page": "List of Heartbeat cast members", "response": ["| Aislín McGuckin || Dr Liz Merrick || colspan=\"11\"  || colspan=\"3\"  || colspan=\"4\" "]}, {"page": "Aisling (name)", "response": ["*Aislín McGuckin (born 1974), Northern Irish actress"]}, {"page": "Aislin McGuckin", "response": ["#REDIRECT Aislín McGuckin"]}, {"page": "List of Irish Traveller–related depictions and documentaries", "response": ["* Trojan Eddie (1996) – crime drama film directed by Gillies MacKinnon and starring Stephen Rea, Richard Harris, Stuart Townsend, Aislín McGuckin, Brendan Gleeson, and Sean McGinley. The soundtrack features \"Tinker's Lullaby\", written and performed by Pecker Dunne."]}, {"page": "List of Outlander characters", "response": ["|Aislín McGuckin", "| Aislín McGuckin"]}, {"page": "Oasis (2017 film)", "response": ["* Aislín McGuckin as Vivian Hades"]}, {"page": "Paula (TV series)", "response": ["* Aislín McGuckin as Diane"]}, {"page": "The Miniaturist (TV series)", "response": ["* Aislín McGuckin as Agnes Meermans:She is Frans's wife who has invested money in sugar."]}, {"page": "Normal People (TV series)", "response": ["* Aislín McGuckin as Denise Sheridan, Marianne's single, wealthy mother who is a solicitor. Marianne's father is described as being abusive towards her. She doesn't have a close relationship with Marianne and often fails to control Alan's abuse towards Marianne throughout the series.", "In May 2019, it was announced that BBC Three and Hulu ordered 12 episodes based on the novel that would premiere 2020 starring Daisy Edgar-Jones and Paul Mescal as Marianne and Connell, respectively. Sarah Greene and Aislín McGuckin were also announced as part of the cast. Sally Rooney herself would help with the adaptation alongside writers Alice Birch and Mark O'Rowe. Lenny Abrahamson and Hettie Macdonald would direct and the Irish company Element Pictures would produce the series."]}, {"page": "Cold Courage", "response": ["*Aislín McGuckin as Toni Gallagher"]}, {"page": "The Creatives", "response": ["The Creatives is a British sitcom created by Jack Docherty and Moray Hunter which ran for two series between 2 October 1998 and 16 February 2000 on BBC Two. The series starring Roger Allam, Jack Docherty, Moray Hunter, Pippa Guard, Aislín McGuckin, Arabella Weir and Ricky Callan as the titular people.", "* Aislín McGuckin – Rhona Platt (series 1)"]}]}}