{"wiki_id": "http://www.wikidata.org/entity/Q40909", "itemLabel": "Virginia Woolf", "itemDescription": "English modernist writer known for use of stream of consciousness", "wikipedia_url": "https://en.wikipedia.org/wiki/Virginia_Woolf", "wikipedia_page": {"main": "Adeline Virginia Woolf (; née Stephen; 25 January 1882 –  28 March 1941) was an English writer, considered one of the most important modernist 20th-century authors and a pioneer in the use of stream of consciousness as a narrative device.\nWoolf was born into an affluent household in South Kensington, London, the seventh child of Julia Prinsep Jackson and Leslie Stephen in a blended family of eight which included the modernist painter Vanessa Bell. She was home-schooled in English classics and Victorian literature from a young age. From 1897 to 1901, she attended the Ladies' Department of King's College London, where she studied classics and history and came into contact with early reformers of women's higher education and the women's rights movement.\nEncouraged by her father, Woolf began writing professionally in 1900. After her father's death in 1904, the Stephen family moved from Kensington to the more bohemian Bloomsbury, where, in conjunction with the brothers' intellectual friends, they formed the artistic and literary Bloomsbury Group. In 1912, she married Leonard Woolf, and in 1917, the couple founded the Hogarth Press, which published much of her work. They rented a home in Sussex and moved there permanently in 1940. Woolf had romantic relationships with women, including Vita Sackville-West, who also published her books through Hogarth Press. Both women's literature became inspired by their relationship, which lasted until Woolf's death.During the inter-war period, Woolf was an important part of London's literary and artistic society. In 1915, she had published her first novel, The Voyage Out, through her half-brother's publishing house, Gerald Duckworth and Company. Her best-known works include the novels Mrs Dalloway (1925), To the Lighthouse (1927) and Orlando (1928). She is also known for her essays, including A Room of One's Own (1929). Woolf became one of the central subjects of the 1970s movement of feminist criticism and her works have since attracted much attention and widespread commentary for \"inspiring feminism\". Her works have been translated into more than 50 languages. A large body of literature is dedicated to her life and work, and she has been the subject of plays, novels and films. Woolf is commemorated today by statues, societies dedicated to her work and a building at the University of London.\nThroughout her life, Woolf was troubled by mental illness. She was institutionalised several times and attempted suicide at least twice. According to Dalsimer (2004) her illness was characterized by symptoms that today would be diagnosed as bipolar disorder, for which there was no effective intervention during her lifetime. In 1941, at age 59, Woolf died by drowning herself in the River Ouse at Lewes.\n\n", "link_mentions": [{"page": "Anton Chekhov", "response": ["In Chekhov's lifetime, British and Irish critics generally did not find his work pleasing; E. J. Dillon thought \"the effect on the reader of Chekhov's tales was repulsion at the gallery of human waste represented by his fickle, spineless, drifting people\" and R. E. C. Long said \"Chekhov's characters were repugnant, and that Chekhov revelled in stripping the last rags of dignity from the human soul\". After his death, Chekhov was reappraised. Constance Garnett's translations won him an English-language readership and the admiration of writers such as James Joyce, Virginia Woolf, and Katherine Mansfield, whose story \"The Child Who Was Tired\" is similar to Chekhov's \"Sleepy\". The Russian critic D. S. Mirsky, who lived in England, explained Chekhov's popularity in that country by his \"unusually complete rejection of what we may call the heroic values.\" In Russia itself, Chekhov's drama fell out of fashion after the revolution, but it was later incorporated into the Soviet canon. The character of Lopakhin, for example, was reinvented as a hero of the new order, rising from a modest background so as eventually to possess the gentry's estates.Allen, 88.\"They won't allow a play which is seen to lament the lost estates of the gentry.\" Letter of Vladimir Nemirovich-Danchenko, quoted by Anatoly Smeliansky in \"Chekhov at the Moscow Art Theatre\", from The Cambridge Companion to Chekhov, 31–32.", "Virginia Woolf mused on the unique quality of a Chekhov story in The Common Reader (1925):"]}, {"page": "A Vindication of the Rights of Woman", "response": ["The suffragist (i.e. moderate reformer, as opposed to suffragette) Millicent Garrett Fawcett wrote the introduction to the centenary edition of the Rights of Woman, cleansing the memory of Wollstonecraft and claiming her as the foremother of the struggle for the vote.Gordon, 521 While the Rights of Woman may have paved the way for feminist arguments, 20th century feminists have tended to use Wollstonecraft's life story, rather than her texts, for inspiration;Kaplan,\"Mary Wollstonecraft's reception and legacies\". her unorthodox lifestyle convinced them to try new \"experiments in living\", as Virginia Woolf termed it in her famous essay on Wollstonecraft.Woolf, Virginia. \"The Four Figures \". Retrieved 17 February 2007. However, there is some evidence that the Rights of Woman may be influencing current feminists. Ayaan Hirsi Ali, a feminist who is critical of Islam's dictates regarding women, cites the Rights of Woman in her autobiography Infidel, writing that she was \"inspired by Mary Wollstonecraft, the pioneering feminist thinker who told women they had the same ability to reason as men did and deserved the same rights\".Hirsi Ali, Ayaan. Infidel. New York: Free Press (2007), 295. Miriam Schneir also includes this text in her anthology Feminism: The Essential Historical Writings, labelling it as one of the essential feminist works. Further evidence of the enduring legacy of Wollstonecraft's A Vindication may be seen by direct references in recent historical fiction set: for example, in The Silk Weaver (1998) set in the late 18th century among Dublin silk weavers, author Gabrielle Warnock (1998) intervenes as narrator to hold up ‘Rights of Woman’ for the reader to reflect upon the politics, morals, and feelings of her female characters. In Death comes to Pemberley (2011)set in 1803 P.D.James has one male character reference Rights of Woman in reproving another (Darcy) for denying voice to the woman in matters that concern her. "]}, {"page": "Afghan Hound", "response": ["Afghan hounds have also been featured in television advertisements and in fashion magazines. The Afghan hound is represented in books as well, including being featured in a series of mystery novels by Nina Wright (Abra), and a talking Afghan Hound in David Rothman's The Solomon Scandals (2008, Twilight Times Books). In the novel Between the Acts, Virginia Woolf uses an Afghan hound (named Sohrab) to represent aspects of one of the book's human characters.The Philosophy of Virginia Woolf: A Philosophical Reading of the Mature Novels"]}, {"page": "Booker Prize", "response": ["As part of The Times Literature Festival in Cheltenham, a Booker event is held on the last Saturday of the festival. Four guest speakers/judges debate a shortlist of four books from a given year from before the introduction of the Booker prize, and a winner is chosen. Unlike the real Man Booker (1969 through 2014), writers from outside the Commonwealth are also considered. In 2008, the winner for 1948 was Alan Paton's Cry, the Beloved Country, beating Norman Mailer's The Naked and the Dead, Graham Greene's The Heart of the Matter and Evelyn Waugh's The Loved One. In 2015, the winner for 1915 was Ford Madox Ford's The Good Soldier, beating The Thirty-Nine Steps (John Buchan), Of Human Bondage (W. Somerset Maugham), Psmith, Journalist (P. G. Wodehouse) and The Voyage Out (Virginia Woolf).Haslam, Sara (13 October 2015), \"Ford's The Good Soldier Wins The Cheltenham Booker 1915 at 2015 Festival\". Ford Madox Oxford Society. Retrieved 27 November 2016."]}, {"page": "Cornwall", "response": ["Since the 19th century, Cornwall, with its unspoilt maritime scenery and strong light, has sustained a vibrant visual art scene of international renown. Artistic activity within Cornwall was initially centred on the art-colony of Newlyn, most active at the turn of the 20th century. This Newlyn School is associated with the names of Stanhope Forbes, Elizabeth Forbes, Norman Garstin and Lamorna Birch. Modernist writers such as D. H. Lawrence and Virginia Woolf lived in Cornwall between the wars, and Ben Nicholson, the painter, having visited in the 1920s came to live in St Ives with his then wife, the sculptor Barbara Hepworth, at the outbreak of the Second World War. They were later joined by the Russian emigrant Naum Gabo, and other artists. These included Peter Lanyon, Terry Frost, Patrick Heron, Bryan Wynter and Roger Hilton. St Ives also houses the Leach Pottery, where Bernard Leach, and his followers championed Japanese inspired studio pottery. Much of this modernist work can be seen in Tate St Ives. The Newlyn Society and Penwith Society of Arts continue to be active, and contemporary visual art is documented in a dedicated online journal."]}, {"page": "Clarke's three laws", "response": ["The third law is the best known and most widely cited. It was published in a 1968 letter to Science magazine and eventually added to the 1973 revision of the \"Hazards of Prophecy\" essay. In 1952, Isaac Asimov in his book Foundation and Empire (part 1.1 Search for Magicians) wrote down a similar phrase \"... an uninformed public tends to confuse scholarship with magicians...\" It also echoes a statement in a 1942 story by Leigh Brackett: \"Witchcraft to the ignorant, … simple science to the learned\".\"The Sorcerer of Rhiannon\", Astounding February 1942, p. 39. Even earlier examples of this sentiment may be found in Wild Talents (1932) by Charles Fort: \"…a performance that may someday be considered understandable, but that, in these primitive times, so transcends what is said to be the known that it is what I mean by magic,\" and in the short story The Hound of Death (1933) by Agatha Christie: \"The supernatural is only the nature of which the laws are not yet understood.\" Virginia Woolf's 1928 novel Orlando: A Biography explicitly compares advanced technology to magic:"]}, {"page": "Consciousness", "response": ["In the West, the primary impact of the idea has been on literature rather than science:  \"stream of consciousness as a narrative mode\" means writing in a way that attempts to portray the moment-to-moment thoughts and experiences of a character.  This technique perhaps had its beginnings in the monologues of Shakespeare's plays and reached its fullest development in the novels of James Joyce and Virginia Woolf, although it has also been used by many other noted writers."]}, {"page": "Cross-dressing", "response": ["In science fiction, fantasy and women's literature, this literary motif is occasionally taken further, with literal transformation of a character from male to female or vice versa.  Virginia Woolf's Orlando: A Biography focuses on a man who becomes a woman, as does a warrior in Peter S. Beagle's The Innkeeper's Song;Clute & Grant 1997, p. 396 while in Geoff Ryman's The Warrior Who Carried Life, Cara magically transforms herself into a man."]}, {"page": "Charles Dickens", "response": ["Virginia Woolf maintained that \"we remodel our psychological geography when we read Dickens\" as he produces \"characters who exist not in detail, not accurately or exactly, but abundantly in a cluster of wild yet extraordinarily revealing remarks\".. T. S. Eliot wrote that Dickens \"excelled in character; in the creation of characters of greater intensity than human beings\". One \"character\" vividly drawn throughout his novels is London itself. Dickens described London as a magic lantern, inspiring the places and people in many of his novels. From the coaching inns on the outskirts of the city to the lower reaches of the Thames, all aspects of the capital – Dickens's London – are described over the course of his body of work. Walking the streets (particularly around London) formed an integral part of his writing life, stoking his creativity. Dickens was known to regularly walk at least a dozen miles (19 km) per day, and once wrote, \"If I couldn’t walk fast and far, I should just explode and perish.\"", "Among fellow writers, there was a range of opinions on Dickens. Poet laureate, William Wordsworth (1770–1850), thought him a \"very talkative, vulgar young person\", adding he had not read a line of his work, while novelist George Meredith (1828–1909), found Dickens \"intellectually lacking\".Neil Roberts, Meredith and the Novel. Springer, 1997, p. 49 . In 1888 Leslie Stephen commented in the Dictionary of National Biography that \"if literary fame could be safely measured by popularity with the half-educated, Dickens must claim the highest position among English novelists\".Dictionary of National Biography Macmillan, 1888, p. 30. Anthony Trollope's Autobiography famously declared Thackeray, not Dickens, to be the greatest novelist of the age. However, both Leo Tolstoy and Fyodor Dostoyevsky were admirers. Dostoyevsky commented: \"We understand Dickens in Russia, I am convinced, almost as well as the English, perhaps even with all the nuances. It may well be that we love him no less than his compatriots do. And yet how original is Dickens, and how very English!\" Tolstoy referred to David Copperfield as his favourite book, and he later adopted the novel as \"a model for his own autobiographical reflections\". French writer Jules Verne called Dickens his favourite writer, writing his novels \"stand alone, dwarfing all others by their amazing power and felicity of expression\".Soubigou, Gilles \"Dickens's Illustrations: France and other countries\" pp. 154-167 from The Reception of Charles Dickens in Europe edited by Michael Hollington London: A&C Black 2013 p. 161. Dutch painter Vincent van Gogh was inspired by Dickens's novels in several of his paintings like Vincent's Chair and in an 1889 letter to his sister stated that reading Dickens, especially A Christmas Carol, was one of the things that was keeping him from committing suicide.Soubigou, Gilles \"Dickens's Illustrations: France and other countries\" pp. 154-167 from The Reception of Charles Dickens in Europe edited by Michael Hollington London: A&C Black 2013 pp. 164-165. Oscar Wilde generally disparaged his depiction of character, while admiring his gift for caricature.. Henry James denied him a premier position, calling him \"the greatest of superficial novelists\": Dickens failed to endow his characters with psychological depth, and the novels, \"loose baggy monsters\",. betrayed a \"cavalier organisation\".. Joseph Conrad described his own childhood in bleak Dickensian terms, and noted he had \"an intense and unreasoning affection\" for Bleak House, dating back to his boyhood. The novel influenced his own gloomy portrait of London in The Secret Agent (1907). Virginia Woolf had a love-hate relationship with his works, finding his novels \"mesmerizing\" while reproving him for his sentimentalism and a commonplace style.."]}, {"page": "England", "response": ["In response to the Industrial Revolution, agrarian writers sought a way between liberty and tradition; William Cobbett, G. K. Chesterton and Hilaire Belloc were main exponents, while the founder of guild socialism, Arthur Penty, and cooperative movement advocate G. D. H. Cole are somewhat related.. Empiricism continued through John Stuart Mill and Bertrand Russell, while Bernard Williams was involved in analytics. Authors from around the Victorian era include Charles Dickens, the Brontë sisters, Jane Austen, George Eliot, Rudyard Kipling, Thomas Hardy, H. G. Wells and Lewis Carroll.. Since then England has continued to produce novelists such as George Orwell, D. H. Lawrence, Virginia Woolf, C. S. Lewis, Enid Blyton, Aldous Huxley, Agatha Christie, Terry Pratchett, J. R. R. Tolkien, and J. K. Rowling.."]}, {"page": "Ellipsis", "response": ["The ellipsis is also called a suspension point, points of ellipsis, periods of ellipsis, or (colloquially) \"dot-dot-dot\".. According to Toner it is difficult to establish when the \"dot-dot-dot\" phrase was first used. There is an early instance, which is perhaps the first in a piece of fiction, in Virginia Woolf's short story \"An Unwritten Novel\" (1920). Depending on their context and placement in a sentence, ellipses can indicate an unfinished thought, a leading statement, a slight pause, an echoing voice, or a nervous or awkward silence. Aposiopesis is the use of an ellipsis to trail off into silence—for example: \"But I thought he was...\" When placed at the end of a sentence, an ellipsis may be used to suggest melancholy or longing."]}, {"page": "Elizabeth Barrett Browning", "response": ["At Wimpole Street Barrett Browning spent most of her time in her upstairs room. Her health began to improve, though she saw few people other than her immediate family. One of those was Kenyon, a wealthy friend of the family and patron of the arts. She received comfort from a spaniel named Flush, a gift from Mary Mitford. (Virginia Woolf later fictionalised the life of the dog, making him the protagonist of her 1933 novel Flush: A Biography)."]}, {"page": "Epistolary novel", "response": ["* Virginia Woolf used the epistolary form for her feminist essay Three Guineas (1938)."]}, {"page": "Essay", "response": ["In the 18th and 19th centuries, Edmund Burke and Samuel Taylor Coleridge wrote essays for the general public. The early 19th century, in particular, saw a proliferation of great essayists in English—William Hazlitt, Charles Lamb, Leigh Hunt and Thomas de Quincey all penned numerous essays on diverse subjects, reviving the earlier graceful style. Later in the century, Robert Louis Stevenson also raised the form's literary level. In the 20th century, a number of essayists, such as T.S. Eliot, tried to explain the new movements in art and culture by using essays. Virginia Woolf, Edmund Wilson, and Charles du Bos wrote literary criticism essays."]}, {"page": "Feminism", "response": ["Particular works of literature have come to be known as key feminist texts. A Vindication of the Rights of Woman (1792) by Mary Wollstonecraft, is one of the earliest works of feminist philosophy. A Room of One's Own (1929) by Virginia Woolf, is noted in its argument for both a literal and figural space for women writers within a literary tradition dominated by patriarchy."]}, {"page": "Food writing", "response": ["*Golden, Lilly, ed. (1993) A Literary Feast: an anthology. New York: Atlantic Monthly Press;  (authors include V. S. Pritchett, W. Somerset Maugham, Jorge Luis Borges, M. F. K. Fisher, Ernest  Hemingway, Isak Dinesen, Virginia Woolf, and James Joyce)"]}, {"page": "Fyodor Dostoevsky", "response": ["In his posthumous collection of sketches A Moveable Feast, Ernest Hemingway stated that in Dostoevsky \"there were things believable and not to be believed, but some so true that they changed you as you read them; frailty and madness, wickedness and saintliness, and the insanity of gambling were there to know\". James Joyce praised Dostoevsky's prose: \"... he is the man more than any other who has created modern prose, and intensified it to its present-day pitch. It was his explosive power which shattered the Victorian novel with its simpering maidens and ordered commonplaces; books which were without imagination or violence.\" In her essay The Russian Point of View, Virginia Woolf said, \"Out of Shakespeare there is no more exciting reading\". Franz Kafka called Dostoevsky his \"blood-relative\" and was heavily influenced by his works, particularly The Brothers Karamazov and Crime and Punishment, both of which profoundly influenced The Trial. Sigmund Freud called The Brothers Karamazov \"the most magnificent novel ever written\". Modern cultural movements such as the surrealists, the existentialists and the Beats cite Dostoevsky as an influence, and he is cited as the forerunner of Russian symbolism, existentialism, expressionism and psychoanalysis. In her essay What Is Romanticism?, Russian-American author Ayn Rand wrote that Dostoevsky was one of the two greatest novelists (the other being Victor Hugo).  Argentinian writer Julio Cortázar also mentions Dostoevsky in his novel Hopscotch.", "* (1922) Stavrogin's Confession & the Plan of the Life of a Great Sinner – English translation by Virginia Woolf and S.S. Koteliansky"]}, {"page": "Genius", "response": ["A number of people commonly regarded as geniuses have been or were diagnosed with mental disorders, for example Vincent van Gogh, Virginia Woolf, John Forbes Nash Jr.,John F. Nash Jr. - Biographical and Ernest Hemingway.Ernest Hemingway"]}, {"page": "George Eliot", "response": ["Middlemarch was described by the novelist Virginia Woolf as \"one of the few English novels written for grown-up people\"Woolf, Virginia. \"George Eliot.\" The Common Reader. New York: Harcourt, Brace, and World, 1925. pp. 166–76.  and by Martin AmisLong, Camilla. Martin Amis and the sex war, The Times, 24 January 2010, p. 4: \"They've [women] produced the greatest writer in the English language ever, George Eliot, and arguably the third greatest, Jane Austen, and certainly the greatest novel, Middlemarch...\" and Julian Barnes as the greatest novel in the English language.", "She was at her most autobiographical in Looking Backwards, part of her final published work Impressions of Theophrastus Such. By the time of Daniel Deronda, Eliot's sales were falling off, and she had faded from public view to some degree. This was not helped by the posthumous biography written by her husband, which portrayed a wonderful, almost saintly, woman totally at odds with the scandalous life people knew she had led. In the 20th century she was championed by a new breed of critics, most notably by Virginia Woolf, who called Middlemarch \"one of the few English novels written for grown-up people\". In 1994, literary critic Harold Bloom placed Eliot among the most important Western writers of all time.Bloom, Harold. 1994. The Western Canon: The Books and School of the Ages. p. 226. New York: Harcourt Brace. In a 2007 authors' poll by Time, Middlemarch was voted the tenth greatest literary work ever written. In 2015, writers from outside the UK voted it first among all British novels \"by a landslide\". The various film and television adaptations of Eliot's books have re-introduced her to the wider reading public."]}, {"page": "Henri Bergson", "response": ["on the subject). George Santayana,see his study on the author in \"Winds of Doctrine\" G. E. Moore, Ludwig Wittgenstein, Martin Heidegger,see Being and Time, esp. sections 5, 10, and 82. Julien Benda,see his two books on the subject T. S. Eliot, Wyndham Lewis,Wyndham Lewis, Time and Western Man (1927), ed. Paul Edwards, Santa Rosa, CA: Black Sparrow, 1993. Wallace Stevens (though Stevens also praised him in his work \"The Necessary Angel\") ,\"The Irrational Element in Poetry.\" 1936. Opus Posthumous. 1957. Ed. Milton J. Bates. New York: Random House, 1990. Paul Valéry, André Gide, Jean Piaget,see his book Insights and Illusions of Philosophy 1972 Marxist philosophers Theodor W. Adorno,see \"Against Epistemology\" Lucio Colletti,see \"Hegel and Marxism\" Jean-Paul Sartre,see his early book Imagination – although Sartre also appropriated himself Bergsonian thesis on novelty as pure creation – see Situations I Gallimard 1947, p. 314 and Georges Politzer,see the latter's two books on the subject: Le Bergsonisme, une Mystification Philosophique and La fin d'une parade philosophique: le Bergsonisme both of which had a tremendous effect on French  existential phenomenology as well as Maurice Blanchot,see Bergson and Symbolism American philosophers such as Irving Babbitt, Arthur Lovejoy, Josiah Royce, The New Realists (Ralph B. Perry, E. B. Holt, and William Pepperell Montague), The Critical Realists (Durant Drake, Roy W. Sellars, C. A. Strong, and A. K. Rogers), Daniel-Henry Kahnweiler, Roger Fry (see his letters), Julian Huxley (in Evolution: The Modern Synthesis) and Virginia Woolf (for the latter, see Ann Banfield, The Phantom Table)."]}, {"page": "Impressionism", "response": ["The term Impressionism has also been used to describe works of literature in which a few select details suffice to convey the sensory impressions of an incident or scene. Impressionist literature is closely related to Symbolism, with its major exemplars being Baudelaire, Mallarmé, Rimbaud, and Verlaine. Authors such as Virginia Woolf, D.H. Lawrence, Henry James, and Joseph Conrad have written works that are Impressionistic in the way that they describe, rather than interpret, the impressions, sensations and emotions that constitute a character's mental life."]}, {"page": "Jorge Luis Borges", "response": ["Borges was a notable translator. He translated works of literature in English, French, German, Old English, and Old Norse into Spanish. His first publication, for a Buenos Aires newspaper, was a translation of Oscar Wilde's story \"The Happy Prince\" into Spanish when he was nine. At the end of his life he produced a Spanish-language version of a part of Snorri Sturluson's Prose Edda. He also translated (while simultaneously subtly transforming) the works of, among others, Ambrose Bierce, William Faulkner, André Gide, Hermann Hesse, Franz Kafka, Rudyard Kipling, Edgar Allan Poe, Walt Whitman, and Virginia Woolf.Notable translations also include work by Melville, Faulkner, Sir Thomas Browne, and G. K. Chesterton. Borges wrote and lectured extensively on the art of translation, holding that a translation may improve upon the original, may even be unfaithful to it, and that alternative and potentially contradictory renderings of the same work can be equally valid.Jorge Luis Borges, This Craft of Verse, Harvard University Press, 2000. pp. 57–76. Word Music and Translation, Lecture, Delivered 28 February 1968. Borges employed the devices of literary forgery and the review of an imaginary work, both forms of modern pseudo-epigrapha."]}, {"page": "January 25", "response": ["*1882 – Virginia Woolf, English novelist, essayist, short story writer, and critic (d. 1941)"]}, {"page": "Lesbian", "response": ["In the 20th century, Katherine Mansfield, Amy Lowell, Gertrude Stein, H.D., Vita Sackville-West, Virginia Woolf, and Gale Wilhelm wrote popular works that had same-sex relationships as themes. Some women, such as Marguerite Yourcenar and Mary Renault, wrote or translated works of fiction that focused on homosexual men, like some of the writings of Carson McCullers. All three were involved in same-sex relationships, but their primary friendships were with gay men.Norton, p. 182. Foster further asserts 1928 was a \"peak year\" for lesbian-themed literature; in addition to The Well of Loneliness, three other novels with lesbian themes were published in England: Elizabeth Bowen's The Hotel, Woolf's Orlando, and Compton Mackenzie's satirical novel Extraordinary Women.Lanser, 1979, p. 39. Unlike The Well of Loneliness, none of these novels were banned.Foster, pp. 281–287."]}, {"page": "London", "response": ["The literary centres of London have traditionally been hilly Hampstead and (since the early 20th century) Bloomsbury. Writers closely associated with the city are the diarist Samuel Pepys, noted for his eyewitness account of the Great Fire; Charles Dickens, whose representation of a foggy, snowy, grimy London of street sweepers and pickpockets has been a major influence on people's vision of early Victorian London; and Virginia Woolf, regarded as one of the foremost modernist literary figures of the 20th century. Later important depictions of London from the 19th and early 20th centuries are Dickens' novels, and Arthur Conan Doyle's Sherlock Holmes stories. Also of significance is Letitia Elizabeth Landon's Calendar of the London Seasons (1834). Modern writers pervasively influenced by the city include Peter Ackroyd, author of a \"biography\" of London, and Iain Sinclair, who writes in the genre of psychogeography."]}, {"page": "Laurence Sterne", "response": ["The novel itself starts with the narration, by Tristram, of his own conception. It proceeds mostly by what Sterne calls \"progressive digressions\" so that we do not reach Tristram's birth before the third volume. The novel is rich in characters and humour, and the influences of Rabelais and Miguel de Cervantes are present throughout. The novel ends after 9 volumes, published over a decade, but without anything that might be considered a traditional conclusion. Sterne inserts sermons, essays and legal documents into the pages of his novel; and he explores the limits of typography and print design by including marbled pages and an entirely black page within the narrative. Many of the innovations that Sterne introduced, adaptations in form that were an exploration of what constitutes the novel, were highly influential to Modernist writers like James Joyce and Virginia Woolf, and more contemporary writers such as Thomas Pynchon and David Foster Wallace. Italo Calvino referred to Tristram Shandy as the \"undoubted progenitor of all avant-garde novels of our century\". The Russian Formalist writer Viktor Shklovsky regarded Tristram Shandy as the archetypal, quintessential novel, \"the most typical novel of world literature.\""]}, {"page": "March 28", "response": ["*  1941   – Virginia Woolf, English novelist, essayist, short story writer, and critic (b. 1882)"]}, {"page": "Modernism", "response": ["New German Critique, No. 41, Special Issue on the Critiques of the Enlightenment. (Spring–Summer, 1987), pp. 95–108. with a philosophy in which psychological drives, specifically the \"will to power\" (Wille zur Macht), was of central importance: \"Nietzsche often identified life itself with 'will to power', that is, with an instinct for growth and durability.\"Bernd Magnus, \"Friedrich Nietzsche\". Encyclopædia Britannica Online Academic Edition. Encyclopædia Britannica Inc., 2013. Web. 19 November 2013. Henri Bergson (1859–1941), on the other hand, emphasized the difference between scientific, clock time and the direct, subjective, human experience of time. His work on time and consciousness \"had a great influence on twentieth-century novelists,\" especially those modernists who used the stream of consciousness technique, such as Dorothy Richardson, James Joyce, and Virginia Woolf (1882–1941).The Bloomsbury Guides to English Literature: The Twentieth Century, ed. Linda R. Williams. London: Bloomsbury, 1992, pp. 108–109. Also important in Bergson's philosophy was the idea of élan vital, the life force, which \"brings about the creative evolution of everything.\" His philosophy also placed a high value on intuition, though without rejecting the importance of the intellect.", "Significant Modernist literary works continued to be created in the 1920s and 1930s, including further novels by Marcel Proust, Virginia Woolf, Robert Musil, and Dorothy Richardson. The American Modernist dramatist Eugene O'Neill's career began in 1914, but his major works appeared in the 1920s, 1930s and early 1940s. Two other significant Modernist dramatists writing in the 1920s and 1930s were Bertolt Brecht and Federico García Lorca. D. H. Lawrence's Lady Chatterley's Lover was privately published in 1928, while another important landmark for the history of the modern novel came with the publication of William Faulkner's The Sound and the Fury in 1929. In the 1930s, in addition to further major works by Faulkner, Samuel Beckett published his first major work, the novel Murphy (1938). Then in 1939 James Joyce's Finnegans Wake appeared. This is written in a largely idiosyncratic language, consisting of a mixture of standard English lexical items and neologistic multilingual puns and portmanteau words, which attempts to recreate the experience of sleep and dreams.James Mercanton (1967). Les heures de James Joyce. Diffusion PUF. In poetry T. S. Eliot, E. E. Cummings, and Wallace Stevens were writing from the 1920s until the 1950s. While Modernist poetry in English is often viewed as an American phenomenon, with leading exponents including Ezra Pound, T. S. Eliot, Marianne Moore, William Carlos Williams, H.D., and Louis Zukofsky, there were important British Modernist poets, including David Jones, Hugh MacDiarmid, Basil Bunting, and W. H. Auden. European Modernist poets include Federico García Lorca, Anna Akhmatova, Constantine Cavafy, and Paul Valéry."]}, {"page": "Mary Wollstonecraft", "response": ["With the advent of the modern feminist movement, women as politically dissimilar from each other as Virginia Woolf and Emma Goldman embraced Wollstonecraft's life story.Woolf, Virginia. \"The Four Figures \" (updated 4 June 2004). Retrieved 11 March 2007. By 1929 Woolf described Wollstonecraft—her writing, arguments, and \"experiments in living\"—as immortal: \"she is alive and active, she argues and experiments, we hear her voice and trace her influence even now among the living\".Kaplan, Cora. \"Mary Wollstonecraft's reception and legacies.\" The Cambridge Companion to Mary Wollstonecraft. Ed. Claudia L. Johnson. Cambridge University Press, 2002. Cambridge Collections Online. Cambridge University Press. 21 September 2010  Others, however, continued to decry Wollstonecraft's lifestyle. A biography published in 1932 refers to recent reprints of her works, incorporating new research, and to a \"study\" in 1911, a play in 1922, and another biography in 1924.James, H.R. \"Mary Wollstonecraft: A Sketch.\" Oxford University Press 1932. Preface. Interest in her never completely died, with full-length biographies in 1937Preedy, George R., pseudonym of Marjorie Bowen. The Shining Woman: Mary Wollstonecraft Godwin. Collins, London, 1937. and 1951.Wardle, Ralph M. Mary Wollstonecraft: A Critical Biography. University of Kansas. The Richards Press, St James's Square, 1951."]}]}}