{"wiki_id": "http://www.wikidata.org/entity/Q4143916", "itemLabel": "Roualeyn George Gordon-Cumming", "itemDescription": "British explorer and big game hunter", "wikipedia_url": "https://en.wikipedia.org/wiki/Roualeyn_George_Gordon-Cumming", "wikipedia_page": {"main": "Roualeyn George Gordon-Cumming (March 15, 1820 – March 24, 1866) was a Scottish traveller and sportsman, known as the \"lion hunter\". He was the second son of Sir William Gordon Gordon-Cumming, 2nd Baronet and Lady Eliza Maria Gordon-CummingFrom his early years he was distinguished by his passion for sport. He was educated at Eton, England, and at eighteen joined the East India Company's service as a cornet in the Madras Light Cavalry. The climate of India not suiting him, after two years he retired from the service and returned to Scotland.\nDuring his stay in the East he had laid the foundation of his collection of hunting trophies and specimens of natural history. In 1843 he joined the Cape Mounted Rifles, but for the sake of absolute freedom sold out at the end of the year and with an ox wagon and a few native followers set out for the interior of Africa. He hunted chiefly in Bechuanaland and the valley of the Limpopo River, regions then swarming with big game. In 1848 he returned to the United Kingdom of Great Britain and Ireland.\nThe story of his exploits is vividly told in his book, Five Years of a Hunter's Life in the Far Interior of South Africa (London, 1850, 3rd ed. 1851). Of this volume, received at first with incredulity by stay-at-home critics, David Livingstone, who furnished Gordon-Cumming with most of his native guides, wrote: I have no hesitation in saying that Mr. Cumming's book conveys a truthful idea of South African hunting (Missionary Travels, chap. vii.). But this comment ought not to be read as implying Livingstone's approval of Gordon-Cumming's 'nauseating details of indiscriminate slaughter of wild animals' (David and Charles Livingstone, \"Narrative of an Expedition to the Zambesi and Its Tributaries: And of the Discovery of the Lakes Shirwa and Nyassa, 1858-1864\", J. Murray, 1865, p. 197).\nLivingstone in general considered Gordon-Cumming as \"a mad sort of Scotchman\" who caused him difficulties. When Gordon-Cumming's oxen succumbed to Animal African trypanosomiasis Livingstone was obliged to change his plans and send all his own oxen to extricate the hunter and his entourage (George Seaver, \"David Livingstone: His Life and Letters\", Lutterworth Press, 1957, p. 105). Worse still, when Gordon-Cumming supplied Setshele, the ruler of the Kwêna people of Botswana, with guns in exchange for ivory, it was Livingstone who was blamed for arming the Africans and in revenge Hendrik Potgieter's followers sacked the Kolobeng mission, taking the African women and children of the mission into slavery (cf. Isaac Schapera, ‘Livingstone and the Boers’ in African Affairs, Vol. 59, No. 235, Apr., 1960, pp. 144–156).\nGordon-Cumming's collection of hunting trophies was exhibited in London in 1851 at the Great Exhibition, and was illustrated by a lecture delivered by Gordon-Cumming. The collection, known as The South Africa Museum, was afterwards exhibited in various parts of the United Kingdom. In 1858 Gordon-Cumming went to live at Fort Augustus, Scotland, on the Caledonian Canal, where the exhibition of his trophies attracted many visitors. He died there in 1866.\nAn abridgment of his book was published in 1856 under the title of The Lion Hunter of South Africa, and in this form was frequently reprinted, a new edition appearing in 1904.", "link_mentions": {}}}