{"wiki_id": "http://www.wikidata.org/entity/Q41539", "itemLabel": "Caroline Haslett", "itemDescription": "British electrical engineer and electricity industry administrator, editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Caroline_Haslett", "wikipedia_page": {"main": "Dame Caroline Harriet Haslett DBE, JP (17 August 1895 – 4 January 1957) was an English electrical engineer, electricity industry administrator and champion of women's rights.She was the first secretary of the Women's Engineering Society and the founder and editor of its journal, The Woman Engineer. She was co-founder, alongside Laura Annie Willson and with the support of Margaret, Lady Moir, of the Electrical Association for Women, which pioneered such 'wonders', as they were described in contemporary magazines, as the All-Electric House in Bristol in 1935. She became the first director of the Electrical Association for Women in 1925. Her chief interest was in harnessing the benefits of electrical power to emancipate women from household chores, so that they could pursue their own ambitions outside the home. In the early 1920s, few houses had electric light or heating, let alone electrical appliances; the National Grid was not yet in existence.\n\n'Way is being made by electricity for a higher order of women – women set free from drudgery, who have time for reflection; for self-respect. We are coming to an age when the spiritual and higher state of life will have freer development, and this is only possible when women are liberated from soul-destroying drudgery ... I want [every woman] to have leisure to acquaint herself more profoundly with the topics of the day.'", "link_mentions": [{"page": "Nancy Astor, Viscountess Astor", "response": ["She chaired the first ever International Conference of Women In Science, Industry and Commerce, a three-day event held London in July 1925, organised by Caroline Haslett for the Women's Engineering Society in co-operation with other leading women's groups. Astor hosted a large gathering at her home in St James's to enable networking amongst the international delegates, and spoke strongly of her support of and the need for women to work in the fields of science, engineering and technology."]}, {"page": "Crawley", "response": ["*Caroline Haslett, electrical pioneer, engineer and champion of women's rights."]}, {"page": "Amy Johnson", "response": ["Writing a last letter to her friend Caroline Haslett, on New Years Day 1941, \"I hope the gods will watch over you this year, and I wish you the best of luck (the only useful thing not yet taxed!).\" On 5 January 1941, while flying an Airspeed Oxford for the ATA from Prestwick via RAF Squires Gate to RAF Kidlington near Oxford, Johnson went off course in adverse weather conditions. Reportedly out of fuel, she bailed out as her aircraft crashed into the Thames Estuary near Herne Bay."]}, {"page": "List of electrical engineers", "response": ["| Caroline Haslett || Founder of The Woman Engineer"]}, {"page": "List of feminists", "response": ["|1875–1939||data-sort-value=\"Haslett, Caroline\"|Caroline Haslett||United Kingdom||1895||1957||||"]}, {"page": "Royal Society for the Prevention of Accidents", "response": ["In 1932 the National \"Safety First\" Association extended its activities to Home Safety, and Caroline Haslett, director of the Electrical Association for Women, was appointed as chair of Home Safety Committee, a post she held until 1936, becoming the first woman vice president in 1937."]}, {"page": "University of Huddersfield", "response": ["In a second round of renaming in 2017, other campus buildings were named in honour of Karen Sparck Jones, Dame Caroline Haslett, Sir John Cockcroft, and Charles Sikes."]}, {"page": "British Electricity Authority", "response": ["* Dame Caroline Haslett, director of the Electrical Association for Women, member"]}, {"page": "Frederick Alfred Pile", "response": ["In 1937 he became General Officer Commanding 1st Anti Aircraft Division. Even before the war started, he foresaw the likely pressures on personnel and investigated whether women would be capable to taking a part in anti-aircraft batteries. He invited Caroline Haslett of the Women's Engineering Society to spend several weekends observing the work of a battery in Surrey and she advised him that women would certainly be able to do the work, as proved to be the case during the war. In 1939, at the start of the Second World War, he was made General Officer Commanding-in-Chief of Anti-Aircraft Command, a position he held throughout the war. He was the only British general to retain the same command throughout the entire war. After Dunkirk he issued a General Order telling his men that they were the only British troops still firing at the enemy. He was to tell the story after the war, in his official dispatch and in his book Ack-Ack: Britain's Defence against Air Attack during the Second World War. His plan for \"Engagement of Long Range Rockets with AA Gunfire\" (gunfire into a radar-predicted airspace to intercept the V-2 rocket) was ready on 21 March 1945 but the plan was not used due to the danger of shells falling on Greater London."]}, {"page": "History of electrical engineering", "response": ["In the early 1920s, there was a growing interest in the development of domestic applications for electricity. Public interest led to exhibitions such featuring \"homes of the future\" and in the UK, the Electrical Association for Women was established with Caroline Haslett as its director in 1924 to encourage women to become involved in electrical engineering."]}, {"page": "Royal Holloway, University of London", "response": ["* Dame Caroline Haslett (1895–1957), engineer"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*1947: Madeline Brock, Gertrude Cosgrove, Evelyn Fox, Matilda Goodrich, Caroline Haslett, Emmeline Tanner, Eileen Walwyn"]}, {"page": "Haslett (surname)", "response": ["* Caroline Haslett (1895–1957), British electrical engineer and electricity industry administrator"]}, {"page": "Six Point Group", "response": ["Members included former militant suffragists - such as Dorothy E. Evans, Florence Macfarlane, Monica Whately and Helen Archdale - as well as younger women like Winifred Holtby, Vera Brittain and Caroline Haslett. Though the membership was usually under 300, the Six Point Group wielded considerable political influence in the interwar years and during the Second World War. It campaigned by traditional constitutional methods. Much of its work was done through its journal, Time and Tide. It also made deputations to the appropriate government ministers, organised public rallies and wrote letters to major newspapers."]}, {"page": "Kerstin Hesselgren", "response": ["In July 1925, Hesselgren attended and spoke at the First International Conference of Women in Science, Industry and Commerce held in London, organised by Caroline Haslett and the British Women's Engineering Society."]}, {"page": "Herbert Schofield", "response": ["In 1921 he joined the board of directors for Atalanta Ltd. the first company in Britain to employ only women engineers, initially set up in Loughborough with the support of the Women's Engineering Society. The company was run by Annette Ashberry who was a graduate of the Loughborough college BSc engineering course and fellow board members included the leading women engineers of the day Rachel Parsons, Caroline Haslett, Lady Eleanor Shelley-Rolls, and Dora Turner."]}, {"page": "Women's Engineering Society", "response": ["This led a group of seven women, Lady Katharine Parsons, her daughter Rachel Parsons, Lady Margaret Moir, Laura Annie Willson, Eleanor Shelley-Rolls;  Janetta Mary Ornsby and Margaret Rowbotham to form the Women's Engineering Society, with the aim of enabling women to gain training, jobs and acceptance. The Society's first Secretary was Caroline Haslett. ", "The society produces the journal The Woman Engineer  which was edited by Caroline Haslett in its early years. The journal contained technical articles in its early years but now gives a view of work in engineering disciplines and women's involvement in them. The digital archive of the journal is held by the Institution of Engineering and Technology."]}, {"page": "Ethel Léontine Gabain", "response": ["In April 1940, Gabain was commissioned by the War Artists' Advisory Committee, WAAC, to produce four lithographs of Women's Voluntary Services members and four on the subject of children being evacuated from London and other cities. Gabain actually offered WAAC thirteen lithographs for this commission but they only accepted the original eight commissioned. WAAC published these as two sets of lithographs, Children in Wartime with five images and Women's Work in the War other than the Services, which had six images. In total WAAC acquired 38 works by Gabain during the War. For these commissions Gabain, although often in poor health, travelled all over Britain. She went to the Scottish Highlands to record the work of women lumberjacks, known as \"lumberjills\", at a Women's Land Army camp in Banffshire and to Devon to depict children evacuated there from London. Throughout the War, Gabain recorded women working in what, in peacetime, had been traditionally male crafts and trades. As well as women salvage workers, factory workers, ARP wardens and air raid workers, Gabain produced a portrait of Captain Pauline Gower of the Air Transport Auxiliary. In 1945, she produced a series of portraits that included Barbara Ward and Caroline Haslett."]}, {"page": "Verena Holmes", "response": ["Together with Caroline Haslett and Claudia Parsons, Holmes was active in the Women's Engineering Society (WES), founded in 1919. She served that society in several capacities, including president in 1930 and 1931 and was involved in the complex discussions about the organisation's direction of travel which led to the resignation of the second president Katharine Parsons in 1925. She was a delegate at first International Conference of Women in Science, Industry and Commerce in July 1925. In 1927 she took part in a debate on The Relative Importance of Commercial and Technical Engineering under Present-Day Conditions, debating the technical side, against fellow WES member Elizabeth M. Kennedy who supported the commercial point of view."]}, {"page": "International Federation of Business and Professional Women", "response": ["In 1934, the headquarters moved from Geneva to London, sharing office space at 20 Regent Street with the Electrical Association for Women (EAW). In 1936, British engineer and Director of the EAW Caroline Haslett became vice-president and president in 1950."]}, {"page": "History of women in engineering", "response": ["In 1919, in the United Kingdom, the first engineering society for women was founded - the Women's Engineering Society or WES as it is commonly known - and it is still active today, continuing to support women in engineering. Founders included Lady Katharine Parsons, who was instrumental in the engineering work of her husband Sir Charles Parsons, their daughter and first President of WES Rachel Parsons, house builder and suffragette, Laura Annie Willson, Eleanor Shelley-Rolls, Margaret Rowbotham, Margaret, Lady Moir, with Caroline Haslett the founding Secretary."]}, {"page": "Caroline (given name)", "response": ["*Caroline Haslett(1895–1957), English electrical engineer, electricity industry administrator and champion of women's rights"]}, {"page": "Crawley Development Corporation", "response": ["Under Bennett's chairmanship, the Development Corporation consisted of about 90 employees led by a committee of unelected members: Bennett himself, Sir Edward Gillett, Caroline Haslett, Ernest Stanford, Lawrence Neal, E.W. Passold, D. Bolton, Mr Lewis and Alderman James Marshall. Each had a specialism: Bennett was an architect, Gillett a surveyor, and Lewis (a former Barclays Bank chairman) looked after the financial side; Marshall had been Mayor of Croydon, Bolton once led London County Council, and Stanford chaired Crawley Parish Council. Dame Caroline Haslett, educated locally, was a pioneering electrical engineer and writer, and was the British Electricity Authority's first female member. The technicians, surveyors, architects and other professionals employed by the Corporation were organised by Colonel C.A.C. Turner, its chief executive until 1959. Delays caused by materials shortages in the straitened postwar economy meant that the first two years of its existence were given over to planning, but work began in earnest in 1949. Minoprio updated his draft plan, and the Corporation signed off A Master Plan for Crawley New Town in early 1949. The new town's chief architect until May 1952, when he left to become City Architect of Birmingham, was Alwyn Sheppard Fidler."]}, {"page": "AC power plugs and sockets: British and related types", "response": ["In 1941 Lord Reith, then the minister of Works and Planning, established committees to investigate problems likely to affect the post-war rebuilding of Britain. One of these, the Electrical Installations Committee, was charged with the study of all aspects of electrical installations in buildings. Amongst its members was Dame Caroline Haslett, President of the Women's Engineering Society, Director of the Electrical Association for Women and an expert on safety in the home. Convened in 1942, the committee reported in 1944, producing one of a set of Post War Building Studies that guided reconstruction.\"Post-War Building Studies No. 11 Electrical Installations\", HMSO, London 1944"]}, {"page": "1931 New Year Honours", "response": ["*Caroline Haslett. Director, The Electrical Association for Women. Secretary of the Women's Engineering Society (Inc.)"]}, {"page": "1947 Birthday Honours", "response": ["* Caroline Haslett, . For services to the Board of Trade and the Ministry of Labour."]}, {"page": "Gertrude Leverkus", "response": ["Leverkus was also involved in the Women's Provisional Club, alongside other professional women including MP Eleanor Rathbone, engineer Caroline Haslett, Lady Rhondda and Dr Louisa Martindale. She was a member of the Women's Voluntary Service, and the International Federation of Business and Professional Women."]}, {"page": "List of British engineers", "response": ["*Caroline Haslett (1895–1957), electrical engineer who oversaw important requirements for electrical installations in post-war Britain \"Post-War Building Studies No. 11 Electrical Installations\", HMSO, London 1944"]}, {"page": "Peggy Hodges", "response": ["After her retirement in 1981, Hodges returned to professional work as a general systems consultant in the Guided Weapons Division of Marconi Space and Defence Systems (MSDS), Stanmore. Hodges was President of the Caroline Haslett Trust, which encourages young women to enter the engineering profession, and a member and supporter of Soroptimist International."]}, {"page": "Laura Annie Willson", "response": ["She became the first woman member of the Federation of House Builders, constructing 72 houses for workers in Halifax in 1925–26. She was a founding member of the Electrical Association for Women in 1924, alongside Caroline Haslett; this interest was reflected in her housing estates which had the latest gas and electricity appliances. In 1927, having moved to Surrey from Halifax with her husband, Willson continued her trade as a builder by purchasing land at Englefield Green."]}, {"page": "Margaret, Lady Moir", "response": ["According to her friend and colleague Caroline Haslett, writing after her death in 1942, '[Britain] would have fewer resources in the numbers of trained women engineers and women knowledgeable in electrical matters if it had not been for the practical advice and interest, and also the financial support, of Margaret, Lady Moir.Engineering for Women', obituary of Margaret Moir by Caroline Haslett, The Times, 6 October 1942.."]}, {"page": "Gertrude Lilian Entwisle", "response": ["The Women's Engineering Society (WES) had been founded in 1919, and Entwisle was one of its founder members. She was a member of Council, first secretary of the Manchester Branch, Vice President to Edith Mary Douglas and President from 1941 to 1943. She succeeding Caroline Haslett in the role, and was succeeded in turn by electrical engineer Margaret Partridge. Entwisle retired from the WES council in 1954, the year of her professional retirement."]}, {"page": "Young Woman Engineer of the Year Award", "response": ["The Young Woman Engineer of the Year Awards are presented at the Institution of Engineering and Technology, London, England. Part of the IET Achievement Medals collection, the award was launched in 1978, and was originally known as the Girl Technician of the Year, until renamed in 1988. The award was first sponsored by the Caroline Haslett Memorial Trust, which was formed in 1945. It is now funded by the Institution of Engineering and Technology."]}]}}