{"wiki_id": "http://www.wikidata.org/entity/Q4161607", "itemLabel": "David Dilks", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Dilks", "wikipedia_page": {"main": "David N. Dilks PhD FRHistS FRSL (born 17 March 1938) is a British historian and former Professor of International History at the University of Leeds.\n\n", "link_mentions": [{"page": "All Souls College, Oxford", "response": ["* David Dilks"]}, {"page": "Appeasement", "response": ["The change in the meaning of \"appeasement\" after Munich was summarised later by the historian David Dilks: \"The word in its normal meaning connotes the pacific settlement of disputes; in the meaning usually applied to the period of Neville Chamberlain['s] premiership, it has come to indicate something sinister, the granting from fear or cowardice of unwarranted concessions in order to buy temporary peace at someone else's expense.\"Dilks, D. N., \"Appeasement Revisited\", Journal of Contemporary History, 1972"]}, {"page": "Royal Society of Literature", "response": ["| David Dilks FRHistS"]}, {"page": "Foleshill", "response": ["* David Dilks (born 1938), historian and professor emeritus of international relations at University of Leeds."]}, {"page": "Anthony Eden", "response": ["Eden published three volumes of political memoirs, in which he denied that there had been any collusion with France and Israel. Like Churchill, Eden relied heavily on the ghost-writing of young researchers, whose drafts he would sometimes toss angrily into the flowerbeds outside his study. One of them was the young David Dilks."]}, {"page": "David Drewry", "response": ["He became the Vice-Chancellor Designate of the University of Hull in November 1999, being designated to take over on the planned retirement of the previous incumbent, David Dilks, in January 2000.On the move, Times Higher Education Supplement, 11 June 1999 On 1 September 2009, he was succeeded by Calie Pistorius, formerly the Vice-Chancellor of the University of Pretoria.Appointments, Times Higher Education Supplement, 12 March 2009"]}, {"page": "List of alumni of Hertford College, Oxford", "response": ["* David Dilks, historian"]}, {"page": "Dilks, David", "response": ["#redirectDavid Dilks"]}, {"page": "Dilks", "response": ["*David Dilks (born 1938), British historian"]}]}}