{"wiki_id": "http://www.wikidata.org/entity/Q4165785", "itemLabel": "Susan Barrantes", "itemDescription": "mother of Sarah Ferguson", "wikipedia_url": "https://en.wikipedia.org/wiki/Susan_Barrantes", "wikipedia_page": {"main": "Susan Mary Barrantes (née Wright, previously Ferguson; 9 June 1937 – 19 September 1998) was the mother of Sarah, Duchess of York, and the maternal grandmother of princesses Beatrice and Eugenie.\nHer elopement with an Argentinian polo player caused a stir in social circles. After his death, she became a film producer in Buenos Aires, but was killed in a road accident.", "link_mentions": [{"page": "Sarah, Duchess of York", "response": ["Sarah Margaret Ferguson was born on 15 October 1959 at London Welbeck Hospital in London. She is the second daughter of Major Ronald Ferguson (1931–2003) and Susan Barrantes (née Wright; 1937–1998). After Ferguson's parents divorced in 1974, her mother married polo player Héctor Barrantes in 1975 and moved to Trenque Lauquen in the Argentine pampas. Sarah stayed at the  Dummer Down Farm at Dummer, Hampshire, her father's home since age 8. Major Ferguson married Susan Deptford in 1976 and had three more children: Andrew, Alice, and Elizabeth. Sarah later mentioned that at the age of 12, when her parents' marriage started to fall apart, she developed an eating disorder and \"turned to overeating for comfort\"."]}, {"page": "Dummer, Hampshire", "response": ["*Susan Barrantes, mother of Sarah, Duchess of York"]}, {"page": "Susan Mary Wright", "response": ["#REDIRECT Susan Barrantes"]}, {"page": "Bibliography of Charles, Prince of Wales", "response": ["*Polo.  Susan Barrantes, author and photographer. Introduction by Juan Carlos Harriot. Buenos Aires: Ediciones Lariviere, Rizzoli International (1997). Hardcover: ."]}, {"page": "H. FitzHerbert Wright", "response": ["Wright married Muriel Harriet Fletcher. He is the maternal great-grandfather of Sarah, Duchess of York, through her mother Susan Barrantes."]}, {"page": "Susan Wright", "response": ["* Susan Barrantes (1937–1998), birth name Susan Mary Wright, mother of Sarah, Duchess of York"]}, {"page": "Mervyn Wingfield, 8th Viscount Powerscourt", "response": ["Through the Wingfield line he was a descendant of the Noble House of Stratford. He is a great-grandfather of Sarah, Duchess of York through her mother Susan Barrantes, who is Powerscourt's granddaughter."]}, {"page": "Deaths in September 1998", "response": ["*Susan Barrantes, 61, British film producer and mother of Sarah, Duchess of York, traffic accident."]}, {"page": "Yeldersley Hall, Derbyshire", "response": ["Their eldest son Fitzherbert Wright (1905-1975), who spent his childhood at the Hall, was a grandfather of the Duchess of York. He was married in 1928 to Doreen Wingfield, the daughter of the 8th Viscount of Powerscourt. Their wedding photograph is shown. They had four children, the youngest of whom was Susan Barrantes.The Peerage website Onlines reference"]}]}}