{"wiki_id": "http://www.wikidata.org/entity/Q4165875", "itemLabel": "Muir Mathieson", "itemDescription": "British composer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Muir_Mathieson", "wikipedia_page": {"main": "James Muir Mathieson, OBE (24 January 1911 – 2 August 1975) was a Scottish conductor and composer. Mathieson was almost always described as a \"Musical Director\" on many British films.", "link_mentions": [{"page": "Henry V (play)", "response": ["Suite from Henry V is a 1963 orchestral arrangement of music that composer William Walton wrote for the 1944 Olivier film.  The arrangement is by Muir Mathieson, and is in five movements."]}, {"page": "Stirling", "response": ["* Muir Mathieson – film music composer"]}, {"page": "Benjamin Britten", "response": ["A month after the opening of Peter Grimes, Britten and Yehudi Menuhin went to Germany to give recitals to concentration camp survivors. What they saw, at Belsen most of all, so shocked Britten that he refused to talk about it until towards the end of his life, when he told Pears that it had coloured everything he had written since. and  Colin Matthews comments that the next two works Britten composed after his return, the song-cycle The Holy Sonnets of John Donne and the Second String Quartet, contrast strongly with earlier, lighter-hearted works such as Les Illuminations. Britten recovered his joie de vivre for The Young Person's Guide to the Orchestra (1945), written for an educational film, Instruments of the Orchestra, directed by Muir Mathieson and featuring the London Symphony Orchestra conducted by Malcolm Sargent.\"Instruments of the Orchestra\" , British Film Institute, accessed 24 May 2013 It became, and remained, his most often played and popular work."]}, {"page": "Brief Encounter", "response": ["Excerpts from Sergei Rachmaninoff's Piano Concerto No. 2 recur throughout the film, played by the National Symphony Orchestra, conducted by Muir Mathieson with pianist Eileen Joyce. There is also a scene in a tea room where a salon orchestra plays the Spanish Dance No. 5 (Bolero) by Moritz Moszkowski."]}, {"page": "Vertigo (film)", "response": ["The score was written by Bernard Herrmann. It was conducted by Muir Mathieson and recorded in Europe because there was a musicians' strike in the U.S."]}, {"page": "Academy Award for Best Original Score", "response": ["| Larry AdlerBlacklisted composer Larry Adler's name was removed from American prints of the British-made Genevieve. The film's arranger and orchestrator Muir Mathieson was credited instead and received an Oscar nomination. In 1986, the Academy's Board of Governors removed Mathieson's name from the nomination and gave it to Adler."]}, {"page": "London Symphony Orchestra", "response": ["Since 1935 the LSO has recorded the musical scores of more than 200 films.Morrison, pp. 277–283 The orchestra owed its engagement for its first soundtrack sessions to Muir Mathieson, musical director of Korda Studios. On the LSO's website, the film specialist Robert Rider calls Mathieson \"the most important single figure in the early history of British film music, who enlisted Bliss to write a score for Things to Come, and who was subsequently responsible for bringing the most eminent British 20th-century composers to work for cinema.\" Mathieson described the LSO as \"the perfect film orchestra\". Among the composers commissioned by Mathieson for LSO soundtracks were Vaughan Williams, Walton, Britten and Malcolm Arnold and lighter composers including Eric Coates and Noël Coward.Morrison, pp. 277–279"]}, {"page": "1911 in music", "response": ["**Muir Mathieson, Scottish conductor and composer (d. 1975)"]}, {"page": "Bernard Herrmann", "response": ["However, according to Dan Auiler, author of Vertigo: The Making of a Hitchcock Classic, Herrmann deeply regretted being unable to conduct his composition for Vertigo. A musicians' strike in America meant that it was actually conducted in England by Muir Mathieson. Herrmann always personally conducted his own works and given that he considered the composition among his best works, he regarded it as a missed opportunity."]}, {"page": "List of film score composers", "response": ["* Muir Mathieson"]}, {"page": "Elisabeth Lutyens", "response": ["In 1945, William Walton was able to repay the service Clark had rendered him in relation to the premiere of his Viola Concerto in 1929. Lutyens approached Walton for an introduction to Muir Mathieson with a view to getting some film music work. He readily agreed to pass on her name, but he went a step further: he invited her to write any work she liked, dedicate it to him and he would pay her £100 sight unseen. The work she wrote was The Pit. Edward Clark conducted The Pit at the 1946 ISCM Festival in London, along with her Three Symphonic Preludes.Playback, The Bulletin of the National Sound Archive, Summer 1998 Bl.uk"]}, {"page": "Miranda (1948 film)", "response": ["Miranda is a 1948 black and white British comedy film, directed by Ken Annakin and written by Peter Blackmore, who also wrote the play of the same name from which the film was adapted. The film stars Glynis Johns, Googie Withers, Griffith Jones, Margaret Rutherford, John McCallum and David Tomlinson. Denis Waldock provided additional dialogue. Music for the film was played by the London Symphony Orchestra, conducted  by Muir Mathieson.  The sound director was B. C. Sewell."]}, {"page": "Miklós Rózsa", "response": ["Rózsa was introduced to film music in 1934 by his friend, the Swiss composer Arthur Honegger. Following a concert which featured their respective compositions, Honegger mentioned that he supplemented his income as a composer of film scores, including the film Les Misérables (1934). Rózsa went to see it and was greatly impressed by the opportunities the film medium offered. However, no film scoring opportunities presented themselves in Paris, and Rózsa had to support himself by reliance on a wealthy patron and by composing light music under the pseudonym Nic Tomay. It was not until Rózsa moved to London that he was hired to compose his first film score for Knight Without Armour (1937), produced by his fellow Hungarian Alexander Korda. Around the same time he also scored Thunder in the City (1937) for another Hungarian filmmaker, Ákos Tolnay, who had previously urged Rózsa to come to England. While the latter film was the first to open, Rózsa always cited the more prestigious Korda project as his film debut. He joined the staff of Korda's London Films, and scored the studio's epic The Four Feathers (1939). Korda and the studio's music director, Muir Mathieson, brought Rózsa onto their Arabian Nights fantasy The Thief of Bagdad (1940) when the operetta-style approach of the original composer, Oscar Straus, was deemed unsuitable. Production was transferred to Hollywood when the war broke out, and Rozsa completed his score there in 1940."]}, {"page": "Call Me Bwana", "response": ["The film was scored by Monty Norman. John Barry claimed that Norman contacted him to orchestrate his theme The Big Safarihttp://www.jollinger.com/barry/lawsuit.htm but the film's orchestration was eventually credited to Muir Mathieson. Barry released a recording of The Big Safari as well as another United Artists comedy The Mouse on the Moon under a pseudonym of \"The Countdowns\".http://www.45-rpm.org.uk/dirj/johnb.htm Bob Hope sang the title song over the end credits."]}, {"page": "Odd Man Out", "response": ["Composer William Alwyn was involved writing the leitmotif-based film score from the very beginning of the production. It was performed by the London Symphony Orchestra and conducted by Muir Mathieson."]}, {"page": "49th Parallel (film)", "response": ["Ralph Vaughan Williams provided the stirring music, his first film score. It was directed by Muir Mathieson and performed by the London Symphony Orchestra. Along with the credits for the actors before the title at the beginning of the film, there is a credit for \"The music of Ralph Vaughan Williams\"."]}, {"page": "Richard III (1955 film)", "response": ["The score was composed by Sir William Walton, who worked on all of the films Olivier directed except The Prince and the Showgirl. He composed a score described in Chandos's record catalogue as \"rousing\" and \"filled with pomp and circumstance, to add to the feel of pageantry\". The music was conducted by Muir Mathieson, who collaborated on all of the films Olivier directed, except for Three Sisters. The film's music was also used for a set of readings of speeches from the play on audio CD featuring John Gielgud. The Chandos catalogue notes that Walton used the main theme throughout the film, especially towards the closing scenes."]}, {"page": "Attila (opera)", "response": ["In the 20th century, it was revived in concert performance during Venice Festival of 1951 with Caterina Mancini, Gino Penno, Giangiacomo Guelfi, and Italo Tajo, under the conductor Carlo Maria Giulini; and at Sadler's Wells in London in 1963 (with an English libretto), with Rae Woodland, Donald Smith, Harry Mossfield and Donald McIntyre, with Muir Mathieson conducting. There was a Rome revival a year later, then productions in Trieste in (1965), in Buenos Aires in (1966), in Berlin in (1971), and in 1972 Attila was performed at the Edinburgh Festival and in Florence."]}, {"page": "The Young Person's Guide to the Orchestra", "response": ["The Young Person's Guide to the Orchestra is a 1945 musical composition by Benjamin Britten with a subtitle Variations and Fugue on a Theme of Purcell. It was based on the second movement, \"Rondeau\", of the Abdelazer suite. It was originally commissioned for the British educational documentary film called Instruments of the Orchestra released on 29 November 1946, directed by Muir Mathieson and featuring the London Symphony Orchestra conducted by Malcolm Sargent;\"Instruments of the Orchestra\", British Film Institute, accessed 24 May 2013 Sargent also conducted the concert première on 15 October 1946 with the Pool Philharmonic in the Philharmonic Hall, Liverpool, England."]}, {"page": "Savile Club", "response": ["*Muir Mathieson"]}, {"page": "Marcus Dods (musician)", "response": ["Dods was assistant music director in the Rank Organisation 1947–1951, where he assisted Muir Mathieson.  He worked with Mathieson on the soundtrack recording of William Walton's score for Laurence Olivier's Hamlet in 1948. Although a composer in his own right, he was better known as an arranger and conductor.  Dods was the conductor and chorus master for Sadler's Wells Opera Company (now the English National Opera) from 1952 to 1956.  In 1966, he became chief conductor of the BBC Concert Orchestra, a post he held until 1970.  In 1972 he became the musical director of the London Concert Orchestra, a post he held until his death in 1984.  As a musical director, he worked on such films as Far from the Madding Crowd (1967), Nicholas and Alexandra (1971), Lady Caroline Lamb (1972), Murder on the Orient Express (1974) and Watership Down (1978).  His television work included Life on Earth, Doctor Who and The Forsyte Saga."]}, {"page": "Arthur Benjamin", "response": ["He returned to Australia in 1919 and became piano professor at the NSW State Conservatorium of Music, Sydney. He returned to England in 1921 to become piano professor at the RCM. Following his appointment in 1926 to a professorship which he held for the next thirteen years at the RCM, Benjamin developed a distinguished career as a piano teacher. His better-known students from that era include Muir Mathieson, Peggy Glanville-Hicks, Miriam Hyde, Joan Trimble, Stanley Bate, Bernard Stevens, Lamar Crowson, Alun Hoddinott, Dorian Le Gallienne, Natasha Litvin (later Stephen Spender's wife and a prominent concert pianist), William BlezardOxford Dictionary of National Biography and Benjamin Britten, whose Holiday Diary suite for solo piano is dedicated to Benjamin and mimics many of his teacher's mannerisms. "]}, {"page": "Stirling High School", "response": ["* Muir Mathieson (1911–1975) - conductor "]}, {"page": "Clifton Parker", "response": ["By the mid 1930s he was living in Folkestone and acting as organist and arranger to the local municipal orchestra.Lane, Philip. Notes to British Film Composers in Concert, White Line WHL 2145 (2003) He was also achieving success with some of his classical pieces and managed to get his work accepted for broadcast on the BBC, work such as In a Twilight Dim with Rose. He came to the attention of Muir Mathieson, one of the music pioneers of the British film industry. His early film compositions were uncredited, including the 1942 Noël Coward film In Which We Serve and it was only with his 1944 score for Western Approaches that his name finally attracted attention.David Ades, Clifton Parker biography at the Robert Farnon Society website"]}, {"page": "List of Scottish musicians", "response": ["*Muir Mathieson (1911–75), conductor and composer"]}, {"page": "The 39 Steps (1959 film)", "response": ["The music was by British film composer Clifton Parker, who composed prolifically for cinema and theatre in this period.Ades, David, Clifton Parker biography , Robert Farnon Society, Retrieved 1 October 2010 The score was conducted by Muir Mathieson. Many of the melodic themes throughout the film derive from pieces performed by the house orchestra during the early music hall scene, particularly the \"Mr. Memory\" motif. A review by the National Board of Review of Motion Pictures also makes a comparison between the theatre and the film, noting \"The score Clifton Parker has composed for the new version of The 39 Steps has a gay overture which also sets the right mood. It's short, not noisy, has musical wit, and promises comedy, not thrills.\"Films in review, Volume 11, (National Board of Review of Motion Pictures, 1960) p. 110"]}, {"page": "Ernest Irving", "response": ["In the early 1930s Basil Dean appointed Irving music director at the newly opened Ealing Film Studios. He composed many scores for classic Ealing comedies including Whisky Galore!, Turned Out Nice Again (starring George Formby) and Kind Hearts and Coronets.Huntley, John. British Film Music (1947, revised 1972) But like his younger counterparts Muir Mathieson at Denham and Hubert Clifford at London Film Studios (who both worked closely with film producer and director Alexander Korda) Irving also brought in some of the best known composers of the day to provide music - including John Addison, William Alwyn, Georges Auric, Benjamin Frankel, John Ireland, Gordon Jacob, Alan Rawsthorne, Ralph Vaughan Williams and William Walton. In this he had the backing of the studio's head of production Michael Balcon, who encouraged Irving to engage serious composers routinely and to use large orchestral forces and unusual scoring.Eder, Bruce. Ernest Irving biography"]}, {"page": "Der Kuhhandel", "response": ["In early 1935, Weill and Vambery collaborated with Reginald Arkell (book) and Desmond Carter (lyrics) on a three-act English-language musical comedy version of the operetta called A Kingdom for a Cow.  This premiered on 28 June 1935 at the Savoy Theatre, London, under the baton of Muir Mathieson and starring the popular young tenor Webster Booth.  It achieved a critical success but failed at the box-office, running for only two weeks."]}, {"page": "Eileen Joyce", "response": ["Arthur Bliss's music for the 1946 film Men of Two Worlds (released in the US as Kisenga, Man of Africa, and re-released as Witch Doctor) includes a section for piano, male voices and orchestra, titled \"Baraza\", which Bliss said was \"a conversation between an African Chief and his head men\". Joyce played this for the film, with Muir Mathieson conducting. Bliss also wrote this out as a stand-alone concert piece, which Joyce both premiered in 1945 and recorded in 1946. This recording was more favourably received than the film was.Jeffrey Richards, Imperialism and MusicJohn Sugden, Sir Arthur Bliss"]}, {"page": "Sea of Sand", "response": ["The score was by Clifton Parker and was performed by the Sinfonia of London under the musical direction of Muir Mathieson."]}, {"page": "Stirling Smith Art Gallery and Museum", "response": ["The triennial exhibitions were accompanied by a lecture and concert programme.  The speakers and musicians were accommodated on a platform at the back of the large gallery.  It was at these concerts that the work of the young Muir Mathieson was premiered.  Son of artist John G. Mathieson who ran a gallery at 16 Allan Park, he went on to become famous as a composer for the British film industry.  Many of the concerts in the 1930s were organised by Adam R. Lennox, musical director of the Stirling Operatic Society and organist of Chalmers’ Church.  He worked in the Town Clerk's Office for David B. Morris.  Alexander McIntosh OBE, at that time a young assistant in the Town Clerk's Office sometimes had the duty to show people to their seats at the Smith concerts."]}, {"page": "Above Us the Waves", "response": ["The score was by Arthur Benjamin and performed under the direction of Muir Mathieson."]}, {"page": "Knights of the Round Table (film)", "response": ["Both the crew and cast credits published at the front (crew) and back (cast) of the book are much fuller than those in the U.S. prints. They appear to come from variant U.K. prints prepared for British cinemas. It's known that contractual obligations required that Miklos Rozsa's score had to be recorded in England (by the London Symphony Orchestra conducted by Muir Mathieson) as well as being recorded in Hollywood by Rozsa himself. This version of the score may have been used in British prints. Currently (2018) only a U.S. print is available on DVD."]}, {"page": "Circus of Horrors", "response": ["The score was provided between Franz Reizenstein and Muir Mathieson. Douglas Slocombe was the cinematographer."]}, {"page": "The Admirable Crichton (1957 film)", "response": ["Although Australian composer Douglas Gamley is credited with most of the film's score, Richard Addinsell - who was uncredited, supplied the original dance music, including a waltz, a polka, and a galop. These pieces were reconstructed, recorded, and released on CD in 2003.  The original music was performed by the London Symphony Orchestra and was conducted by Muir Mathieson."]}, {"page": "Once More, with Feeling!", "response": ["The film was released by Columbia Pictures and has music by Franz Liszt, Ludwig van Beethoven, and Richard Wagner, arranged by Muir Mathieson. The cinematography was by Georges Périnal and the costume design by Givenchy."]}, {"page": "Crown Film Unit", "response": ["Music was an important element. The conductor Muir Mathieson was the director of music for many productions, and notable composers commissioned to write original scores included Walter Leigh, Benjamin Britten, Ernst Meyer, Richard Addinsell, Benjamin Frankel, Christian Darnton, Guy Warrack and Arthur Benjamin.Mathieson, Muir. 'Music for Crown', in Hollywood Quarterly. Vol. 3, No. 3 (Spring, 1948), pp. 323-326 "]}, {"page": "Sinfonia of London", "response": ["The current orchestra is the third of three distinct ensembles of this name. The original Sinfonia of London was founded in 1955 by Gordon Walker, an eminent flautist of his time, specifically for the recording of film music. The orchestra came into being when there was a split in the future direction of the London Symphony Orchestra, many LSO players leaving to join the Sinfonia of London in order to undertake the more lucrative film soundtrack work. The orchestra appeared in the musical credits of many British and American films of the 1950s and '60s, including the 1958 soundtrack for the Alfred Hitchcock thriller Vertigo with Bernard Herrmann's score conducted by Muir Mathieson for  Mercury Records and, in 1961, the soundtrack of the horror film Gorgo."]}, {"page": "Rory Kinnear", "response": ["In 2011, he provided narration during the BBC Proms production of 'Henry V – suite' arranged by Muir Mathieson during their Film Music Prom. He appeared in the lead role of Prime Minister Michael Callow in \"The National Anthem\", the first episode of the anthology series Black Mirror."]}, {"page": "Basil Wright", "response": ["*Muir Mathieson"]}]}}