{"wiki_id": "http://www.wikidata.org/entity/Q4160337", "itemLabel": "Ruth Gipps", "itemDescription": "English composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Gipps", "wikipedia_page": {"main": "Ruth Dorothy Louisa Gipps  (20 February 1921 – 23 February 1999) was an English composer, oboist, pianist, conductor, and educator. She was one of the most prolific composers in Britain at the time of her death, having written five symphonies, seven concertos, and numerous chamber and choral works. She founded both the London Repertoire Orchestra and the Chanticleer Orchestra and served as conductor and music director for the City of Birmingham Choir. Later in her life she served as chairwoman of the Composers' Guild of Great Britain.", "link_mentions": [{"page": "Bexhill-on-Sea", "response": ["* Ruth Gipps, composer and music impresario, founder of London Repertoire Orchestra. "]}, {"page": "List of oboists", "response": ["* Ruth Gipps (1921–1999), British (composer)"]}, {"page": "City of Birmingham Symphony Orchestra", "response": ["Weldon's success in rebuilding the orchestra after the ravages of war was limited, however: he recruited over 40 new musicians during his tenure but by 1951 had only succeeded in increasing the playing strength to 73. Year-round contracts demanded a heavy workload – during the 1945–46 season the orchestra played 260 concerts as well as undertaking educational work in the city's schools – meaning that most concerts were rehearsed only on the day of a performance. Audiences were also unpredictable, and Weldon was criticised for programming too much lightweight repertoire. The era saw some performances of new compositions including major works composed by the orchestra's oboist Ruth Gipps, and September 1946 brought Samuel Barber to Birmingham to conduct his own First Symphony, but Weldon repeated popular works multiple times, often twice or more within the same season. In 1946 Eric Blom criticised the orchestra for over-performance of Vaughan Williams' Fantasia on \"Greensleeves', with the orchestra responding by performing the work in a further concert, backwards. The music critic of the Birmingham Post was sacked in 1945 for writing that other music journalists in the city were covering up the orchestra's low standards, but by 1948 critics were writing openly of the orchestra's decline. An anti-Weldon lobby formed among Birmingham's musical establishment and unsubstantiated rumours circulated that he was conducting an affair with Gipps. George Jonas, who would later head the CBSO's council of management and started attending CBSO concerts in 1951, later recalled of the period: \"a pretty awful sound they made, it was a poor orchestra.\""]}, {"page": "1946 in music", "response": ["*Ruth Gipps – Symphony No. 2"]}, {"page": "1921 in music", "response": ["*February 20 - Ruth Gipps, composer (d. 1999)"]}, {"page": "List of women composers by birth date", "response": ["* Ruth Gipps (1921–1999)"]}, {"page": "1999 in British music", "response": ["*23 February – Ruth Gipps, composer, oboist, pianist and impresario, 78Halstead, Jill (2006). Ruth Gipps: Anti-Modernism, Nationalism And Difference in English Music. Aldershot: Ashgate. ."]}, {"page": "Gordon Jacob", "response": ["At the end of his student course in 1924, Gordon became a teacher of music, briefly at Birkbeck and Morley Colleges, and then at the RCM, where he remained until his retirement in 1966.\"Gordon Jacob\", Boosey and Hawkes. Retrieved 2 November 2018 He was professor of music theory, composition and orchestration.\"Jacob, Gordon (Percival Septimus)\", Who's Who and Who Was Who, Oxford University Press,  2007. Retrieved 2 November 2018  Among his students at the RCM were Malcolm Arnold, Ruth Gipps, Imogen Holst, Cyril Smith, Philip Cannon, Pamela Harrison, Joseph Horovitz, Bernard Stevens and John Warrack."]}, {"page": "Gulf of Corryvreckan", "response": ["Charles Mackay's poem \"The Kelpie of Corrievreckan\" tells the story of a young woman who leaves her lover for a sea kelpie. She discovers too late that the kelpie lives at the bottom of the sea and she is drowned, \"an awful warning to all fickle maidens\". The words were adapted and set to music for piano and orchestra by Learmont Drysdale in the 1890s, and in 1939 Ruth Gipps set the poem to music for clarinet and piano."]}, {"page": "List of Durham University people", "response": ["* Ruth Gipps – British composer, conductor, oboist and pianist"]}, {"page": "George Weldon", "response": ["Halstead, p. 15 and Aylmer Buesst.Naxos  In 1943, at 36 years of age, he became the conductor of the City of Birmingham Orchestra in succession to Leslie Heward. He was dismissed in 1950, following unsubstantiated rumours that he was having an affair with Ruth Gipps, choirmaster of the Birmingham orchestra's chorus."]}, {"page": "List of symphony composers", "response": ["*Ruth Gipps (1921–1999), British composer of 5 symphonies"]}, {"page": "Society of Women Musicians", "response": ["The Society of Women Musicians was a British group founded in 1911 for mutual cooperation between women composers and performers, in response to the limited professional opportunities for women musicians at the time. The founders included Katharine Emily Eggar, a composer, Marion Scott, a musicologist, and Gertrude Eaton, a singer. 37 women came to the first meeting, held on 11 July 1911 at the Women's Institute, 92 Victoria Street, including Rebecca Helferich Clarke, Alma Haas, and Liza Lehmann, who later became the group's first president.Grove, SWM The first concert was held on 25 January 1912 in the small room of Queen's Hall.Concert Programmes.org Regular concerts followed at the same venue and at the Aeolian and Wigmore Halls. They featured premieres from women composers such as Ethel Barns, Rebecca Clarke, Katharine Eggar, Dorothy Howell, Liza Lehmann, Fiona McCleary (1900–1986), Marion Scott and Ethel Smyth. In later years there were also premieres from Ruth Gipps, Elisabeth Lutyens, Elizabeth Maconchy and Elizabeth Poston."]}, {"page": "Adam Stern (conductor)", "response": ["A devotee of unjustly neglected works, Stern is particularly noted for his frequent performances of English music, especially that of Ralph Vaughan Williams. He led the first Seattle Symphony performance of Vaughan Williams' Pastoral Symphony in 1996; In January 2007, he and the Seattle Philharmonic presented the Northwest premiere of the same composer's final symphony, No. 9. Stern has also led Seattle, Northwest, West Coast and world premieres of works by Elsa Barraine, Mélanie Bonis, Aaron Copland, Roque Cordero, Richard Danielpour, Nana Forte, Gina Gillie, Ruth Gipps, Gustav Holst, Helvi Leiviskä, Karl Nord, Richard Peaslee, Goffredo Petrassi, Gerard Schurmann, Rodion Shchedrin, Paul Stanhope, James Tenney, Aurelio de la Vega, and Bernd Alois Zimmermann."]}, {"page": "List of symphonies in F minor", "response": ["|Ruth Gipps"]}, {"page": "Georges Tzipine", "response": ["He was particularly associated with the works of his long-time friend Arthur Honegger, and he conducted the premiere recordings of some of them (Cris du Monde oratorio, Nicolas de Flüe). He also conducted the first recordings of works by Florent Schmitt (Psalm 47, with Denise Duval),Autour de la musique classique Jean Rivier (symphonies Nos. 3 and 5, for which he received a Grand Prix du Disque), Albert Roussel, Georges Auric, Darius Milhaud, and Francis Poulenc.  He conducted the premiere performances of Jacques Ibert’s Le Chevalier Errant (1951) with the ORTF, René Challan’s 2nd Symphony in F major (1 February 1959, Concerts Colonne), recorded his Concerto Pastoral, Op. 20 (with Samson François, January 1954) and premiered his Piano Concerto (3 March 1957, with François), led the first performance of Ruth Gipps’ Horn Concerto (1968), with the BBC Welsh Orchestra,Classic Music Web: Ruth Gipps and the first recording of Alejandro García Caturla’s Premiere Suite Cubaine.Association Francois du Hautbois His work was rarely available on CD until the release of EMI’s \"Les Rarissimes\" series."]}, {"page": "List of compositions for viola: F to H", "response": ["* Ruth Gipps (1921–1999)"]}, {"page": "Gipps", "response": ["*Ruth Gipps (1921–1999), British composer"]}, {"page": "The Ivors Academy", "response": ["The Composers Guild of Great Britain was founded in 1944 to represent composers of classical music, with Ralph Vaughan Williams elected as first President. The Songwriters' Guild of Great Britain, later known as The British Academy of Songwriters, Composers and Authors was founded in 1947 by Ivor Novello, Sir Alan Herbert, Eric Coates, Haydn Wood, Richard Addinsell and others for the encouragement and protection of British popular music, with Eric Maschwitz acting as the first Vice Chair, and Chairman in 1948, and again between 1954 and 1958. The Association of Professional Composers was founded in 1976 by George Fenton to represent composers of film and TV music. In 1958 the Composers' Guild of Great Britain began publishing the journal Composer, and also published a number of catalogs of available works. In 1967 the organisation, under the direction of Ruth Gipps, established the British Music Information Centre."]}, {"page": "List of variations on a theme by another composer", "response": ["* Ruth Gipps: Variations on Byrd's \"Non nobis\", for small orchestra, Op. 7 (1942)"]}, {"page": "List of symphonies in B major", "response": ["*Ruth Gipps"]}, {"page": "Music of Sussex", "response": ["Probably Sussex's best-known native female composer, Ruth Gipps produced several orchestral works, including five symphonies and two piano concertos.  Her clarinet sonata, Op 45, won the 1956 Cobbett prize of the Society of Women Musicians."]}, {"page": "Alan Bullard", "response": ["He was born in Norwood, South London on 4 August 1947, son of artists Paul Bullard and Jeanne Bullard, and lived as a child in Blackheath, South-East London. He attended St. Olave's Grammar School, where he learnt music with Desmond Swinburn, while studying piano with Geoffrey Flowers and John Allen at the Blackheath Conservatoire of Music. He then studied with Herbert Howells, Ruth Gipps and Antony Hopkins at the Royal College of Music, and took postgraduate study with Arnold Whittall at the University of Nottingham. For the next few years he taught music part-time in several art schools and at the London College of Music (from 1970 to 1975)."]}, {"page": "List of fellows of the Royal College of Music", "response": ["* Ruth Gipps, 1972"]}, {"page": "Piano Concerto (Bliss)", "response": ["The Piano Concerto was immediately taken into the repertoire of pianists such as Noel Mewton-Wood, Ruth Gipps, Clive Lythgoe, Shulamith Shafir and Kendall Taylor.  Solomon played it again at the Proms in 1942. Alicia de Larrocha was playing it as early as 1949 (when she was age 26), it is the work's premiere in Spain. Trevor Barnard played it in 1958 (when he was aged 20). Gina Bachauer played it with Dimitri Mitropoulos and the New York Philharmonic in 1960. Bliss himself conducted Frank Wibaut in a performance with the Leicestershire Schools Symphony Orchestra at the 1970 Cheltenham Festival. An earlier concert performance of the concerto was also given at Loughborough, again with Bliss conducting.Bach Cantatas  Later pianists to embrace the work include Piers Lane."]}, {"page": "Claire van Kampen", "response": ["Studying music theory with Dr Ruth Gipps, she also specialised in the performance of 20th century music, premiering works by today's composers."]}, {"page": "Modern Symphony Orchestra", "response": ["In accordance with the name of the orchestra, contemporary, unknown or rarely heard compositions were performed regularly from the beginning, programmed alongside well known works. The quality of the orchestral playing and the openness to modern compositions allowed the orchestra to perform world and British premieres after only a few years of existence. The Oboe Concerto by Ruth Gipps, for example, received its world premiere by the Modern Symphony Orchestra on 13 June 1942 (with soloist Marion Brough)Annual Reports of the Polytechnic of North London University and the orchestra gave the British premiere of Stravinsky's 1947 revision of Petrushka. Other first performance in England included Roussel's Suite en fa, Tibor Harsanyi's La joie de vivre, Alban Berg's Seven Early Songs (with the 1928 orchestral accompaniment) and Frank Martin's Petite symphonie concertante.", "Partly inspired by the Modern Symphony Orchestra's example, Ruth Gipps went on to found the One Rehearsal Orchestra in 1955, renamed in 1963 as the London Repertoire Orchestra and still running today.Gipps, Ruth. \"One Rehearsal Orchestra - Why?\" in The Strad, June 1957, p 20.London Repertoire Orchestra website", "* Ruth Gipps: Oboe concerto (world premiere on 13. June 1942 with Marion Brough, oboe)", "* Ruth Gipps: Violin concerto (world premiere on 05.02.1944 with the composer's brother Ernest as soloist and conducted by Arthur DenningtonBroeker, Tobias (2014): The 20th century violin concertante – A repertoire guide to the compositions for violin concertante written between 1894 and 2006. Stuttgart: self-published (e-book). "]}, {"page": "Arthur Dennington", "response": ["During his years with the Modern Symphony Orchestra Arthur Dennington conducted several world and English premieres of compositions, for example the world premieres of the Horn and Violin concertos by Ruth Gipps, or the English premieres of the Symphonie concertante by Frank Martin, the Guitar concerto by Stephen Dodgson or the first public performance of the Piano concerto by Alan Bush.Annual Reports of the Polytechnic of North London University In a 1949 review of the orchestra's world premiere of Ian Parrott's Scherzo for Orchestra, music critic Malcolm Rayment wrote: \"If Arthur Dennington can make such an orchestra as this sound like a professional orchestra, one wonders what results he might achieve with a first-class orchestra.\" In 1960 he conducted the orchestra in the world premiere of the opera Mary Barton by composer Arnold Cooke.  He also conducted several operas at Islington Town Hall including Gian Carlo Menotti's The Consul (1963) and Giuseppe Verdi's La traviata (1969).    "]}]}}