{"wiki_id": "http://www.wikidata.org/entity/Q41736739", "itemLabel": "Averil Mansfield", "itemDescription": "British surgeon and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Averil_Mansfield", "wikipedia_page": {"main": "Dr Averil Olive Mansfield CBE ChM FRCS FRCP (born 21 June 1937) is a retired English vascular surgeon. She was a consultant surgeon at St Mary's Hospital in Paddington, central London, from 1982 to 2002, and in 1993 she became the first British woman to be appointed a professor of surgery.", "link_mentions": [{"page": "1937 in science", "response": ["* June 21 – Averil Mansfield, English vascular surgeon."]}, {"page": "Rupert Downes", "response": ["* 1996 Professor Averil Mansfield Arterio-Venous Malformations and their Treatment"]}, {"page": "Eleanor Davies-Colley", "response": ["One of the Royal College of Surgeons' lecture theatres at Lincoln's Inn Fields was refurbished and dedicated in Eleanor Davies-Colley's memory in 2004, with the aim of celebrating the role of women in surgery and encouraging more women to enter the profession. A major fundraising drive (led by another pioneering woman surgeon, Averil Mansfield, the first woman to become a professor of surgery in the UK) raised nearly a quarter of a million pounds for the project. The lecture theatre contains a visual representation featuring Eleanor Davies-Colley and other pioneering female surgeons."]}, {"page": "Liverpool Medical Students Society", "response": ["*Emeritus Professor Averil Mansfield CBE"]}, {"page": "University of Liverpool School of Medicine", "response": ["*Averil Mansfield, graduated 1960, vascular surgeon"]}, {"page": "Nick Donnelly", "response": ["In July 2019, Nick Donnelly's production company Urban Kingdom revealed 'Generation W' a book which features 100 British women writing about living through 100 years since women began to receive the vote in the UK. Women writing for the book include Olympic champion Sally Gunnell, Carol M. Black, Averil Mansfield, Lily Cole, Susie Wolff and many more. "]}, {"page": "Averil Olive Mansfield", "response": ["#REDIRECT Averil Mansfield"]}]}}