{"wiki_id": "http://www.wikidata.org/entity/Q4201127", "itemLabel": "Charles Incledon", "itemDescription": "English tenor singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Incledon", "wikipedia_page": {"main": "Charles Benjamin Incledon (pronounced 'Ingledon') (1763–11 February 1826, Worcester) was a Cornish tenor singer, who became one of the foremost English singers of his time, especially in the singing of English theatre music and ballads in which he was considered without rival.", "link_mentions": [{"page": "Charles Bannister", "response": ["Bannister built on his reputation as a singer at Ranelagh Gardens not least through the early successful operas of Charles Dibdin, with which he became specially identified. In 1768 he was in Damon and Phillida, and The Padlock.For Bannister's English opera firsts, see Margaret Ross Griffel, Operas in English: A Dictionary Revised Edition (Scarecrow Press, 2012), p. 901 Read here.  In 1774 he was the original Tom Tug in Dibdin's lasting work, The Waterman, at its first presentation at the Haymarket.G.H. Davidson, The Songs of Charles Dibdin with a memoir by George Hogarth, 2 vols (G.H. Davidson, London 1848), I, pp. xx, xxxiii, 44–45. He appeared in the first production of The Cobbler, and in 1777 was the first Mr. Steady in The Quaker at Drury Lane.The British Drama: A Collection of the Most Esteemed Tragedies, Comedies, Operas, and Farces, in the English Language. In Two Volumes, (Jones & Co., London 1824), Vol. 1, p. 233. 'Steady, in The Quaker, has never, except in him, found an adequate representative.'Adolphus 1839, Vol. 2, p. 124. There is a portrait of him in this role, see engraving by William Ridley after a painting by Pye, Published London 1804 in the Folger Shakespeare Library View here. He was in the premiere of The Chelsea Pensioner in 1779, and was Sergeant (opposite Charles Dibdin as Countryman, and Mrs Wrighten as Wife) in Dibdin and Isaac Bickerstaffe's musical entertainment of The Recruiting Serjeant at the Royalty Theatre in 1789.The British Drama, 1824, p. 210. As Tom Tug, Mr Steady and the Recruiting Serjeant he was succeeded (at Covent Garden) by Charles Incledon, and by Charles Dignum, who were his friends, and adopted them for tenor voice instead of bass or baritone.", "He and William Shield, Charles Incledon, Charles Dignum, 'Jack' Johnstone, Charles Ashley and William Parke (oboeist) in 1793 formed themselves into 'The Glee Club', a set which met on Sunday evenings during the season at the Garrick's Head Coffee House in Bow Street, once a fortnight, for singing among themselves and dining together. A project to erect a bust to Dr Thomas Arne, which this group proposed to fund by charitable performances, was vetoed by the management of Covent Garden.W. Parke, Musical memoirs (Richard Bentley, London 1830), p. 175-79."]}, {"page": "Edmund Kean", "response": ["About this time, he picked up music from Charles Incledon, dancing from D’Egville, and fencing from Angelo. In 1807, he played leading parts in the Belfast theater with Sarah Siddons, who began by calling him \"a horrid little man\" and on further experience of his ability said that he \"played very, very well,\" but that \"there was too little of him to make a great actor.\" He made an early appearance with Mrs. Baker's company. In 1808, he joined the provincial troupe of the actor Samuel Butler and went on to marry Mary Chambers of Waterford, the leading actress, on 17 July. His wife gave birth to two sons, one of whom was actor Charles Kean."]}, {"page": "Charles Dibdin", "response": ["Dibdin still provided texts for operas, including The Cabinet, which was presented at Covent Garden in February 1803 with John Braham, Nancy Storace and Charles Incledon, and in December The British Fleet in 1342.William Parke, Musical Memoirs (Richard Burton, London 1830), Vol. 1, pp. 304–06, 324. At least two further operas appeared: Broken Gold was a farce in two acts on the occasion of Lord Nelson's victory and death, produced at Drury Lane with John Bannister in 1806, which was 'damned on the first night, and never published'.Adolphus, Memoirs of John Bannister, II, p. 140. His last production, The Round Robin, was first acted at the Haymarket in June 1811. This incorporated his highly successful song 'The standing toast,' which had been written some time before.Hogarth (Ed.), Songs of Charles Dibdin (1848), Vol. 1 pp. 166, 169, 173."]}, {"page": "Stephen Kemble", "response": ["He supported the careers of many leading actors of the time such as Master Betty, his wife Elizabeth Satchell, his sister Elizabeth Whitlock, George Frederick Cooke, Charlotte Wattell, Harriet Pye Esten, John Edwin, Joseph Munden, Grist, Elizabeth Inchbald, Pauline Hall, Wilson, Charles Incledon, Egan. His nephew Henry Siddons (Sarah Siddons' son) made his first appearance on stage in Sheffield (October 1792), his younger brother Charles Kemble, Thomas Apthorpe Cooper, John Liston, John Emery, Daniel Egerton, William Macready."]}, {"page": "White Hart", "response": ["The \"White Hart\" in St Keverne, Cornwall was the birthplace, in 1764, of the singer and actor Charles Incledon."]}, {"page": "St Keverne", "response": ["* Charles Incledon, singer"]}, {"page": "Francis Fawkes", "response": ["It was introduced by John O'Keeffe into his comic opera The Poor Soldier, which was played at Covent Garden Theatre for the first time on 4 November 1783. It was sung then by John Henry Johnstone, and it was later a favourite piece of Charles Incledon. During the debates on Catholic emancipation the opening lines were quoted in the House of Commons by George Canning to ridicule John Copley: the punning imputation was that a speech by Copley was from a pamphlet of Henry Phillpotts."]}, {"page": "1789 in Great Britain", "response": ["* The song The Lass of Richmond Hill, with music by James Hook to words by Leonard McNally, is first performed publicly by Charles Incledon at Vauxhall Gardens in London."]}, {"page": "Charles Benjamin Incledon", "response": ["#REDIRECT Charles Incledon"]}, {"page": "The Lass of Richmond Hill", "response": ["The song was first performed publicly by Charles Incledon at Vauxhall Gardens in 1789, although McNally appears to have written the words long before that. It became one of the most popular songs of the time, and was said to be a favourite of George III.  The song remains popular, and, for example, is played by the BBC's classical music station, Radio 3."]}, {"page": "John Henry Johnstone", "response": ["Johnstone and William Shield, Charles Incledon, Charles Dignum, Charles Bannister, Charles Ashley and William Parke (oboeist) in 1793 formed themselves into 'The Glee Club', a set which met on Sunday evenings during the season at the Garrick's Head Coffee House in Bow Street, once a fortnight, for singing among themselves and dining together. A project to erect a bust to Dr Thomas Arne, which this group proposed to fund by charitable performances, was vetoed by the management of Covent Garden.W. Parke, Musical Memoirs (Richard Bentley, London 1830), p. 175-79. It is told that Johnstone was a regular drinking companion of Charles Incledon's at 'a public house of the lowest class', The Brown Bear in Bow Street.W. Parke, Musical Memoirs Vol 1, p. 333. Incledon was a prodigious boozer."]}, {"page": "Charles Dignum", "response": ["He and William Shield, Charles Incledon, Charles Bannister, 'Jack' Johnstone,The Irish actor John Henry Johnstone, born Tipperary 1750, died Tavistock Street, Covent Garden, 26 December 1829. See The Illustrated Dublin Journal, Volume 1, Number 28, 15 March 1862. Read at Library Ireland. Charles Ashley and William Parke (oboeist) in 1793 formed themselves into 'The Glee Club', a set which met on Sunday evenings during the season at the Garrick's Head Coffee House in Bow Street, once a fortnight, for singing among themselves and dining together. A project to erect a bust to Dr Thomas Arne, which this group proposed to fund by charitable performances, was vetoed by the management of Covent Garden.W. Parke, Musical memoirs (Henry Colburn and Richard Bentley, London 1830), p. 175-79.", "His obituarist remarked, 'Dignum, with many ludicrous eccentricities, was an amiable, good-natured, jolly fellow.' He married Miss Rennett, the daughter of an attorney, whose fortune helped to sustain them. After her death he suffered a period of 'mental derangement' in misery at her loss, and also suffered from much unhappiness when his granddaughter was kidnapped for a period, for which the offender was prosecuted and transported.Charles Dignum (Obituary), Gentlemans' Magazine, p. 566. A contemporary of the great Michael Kelly, of Charles Incledon and (latterly) of John Braham, he had to work hard for public favour and to withstand attacks referring to his humble origins, his religion and his physical ungainliness (he became quite fat): but, having obtained respect for his skills and good character, he held his place in the affection of his admirers, made large sums at his benefits in later years, and was able to retire with some fortune. He died of inflammation of the lungs in Gloucester Street, London, aged 62 in 1827."]}, {"page": "Rosemond Mountain", "response": ["In 1819 she appeared as Maid Marian in the burletta Robin Hood and Little John at the Surrey Theatre with Charles Incledon as Robin Hood. Mountain died in London at her home in 1841."]}, {"page": "Family Quarrels", "response": ["thumb|upright=1.4|\"Family Quarrels, or The Jew and the Gentile\" – cartoon c. 1802 by Thomas Rowlandson depicting the singers John Braham (r.) and Charles Incledon (l.)", "Family Quarrels is a comic opera in three acts with a libretto by Thomas Dibdin, and music principally by William Reeve. It was premiered in London at Covent Garden Theatre on December 18, 1802. The singers John Braham and Charles Incledon had leading roles in the opera, in which the comedian John Fawcett took the part of the pedlar Proteus.", "|Charles Incledon"]}, {"page": "Incledon, Charles", "response": ["#redirectCharles Incledon"]}, {"page": "Sarah Baker (18th-century actress)", "response": ["When her mother retired in 1777, Baker created a new touring company with which she performed plays including those of William Shakespeare and Richard Brinsley Sheridan, in addition to continuing to offer traditional fairground and variety entertainment. The actor William Dowton joined her company in 1791 and married her daughter, Sarah, in 1794. Other performers who appeared with Baker in their early careers include Edmund Kean and Thomas Dibdin who were attracted by the offer of regular salaries.Dibdin, 1.91–2) As her company became more established Baker was able to attract more famous performers, including Charles Incledon, George Frederick Cooke, Dorothea Jordan and Joseph Grimaldi, the latter of whom appeared with her in Rochester in 1801. In March the following year, Grimaldi worked with Baker in Kent where he performed in a pantomime, which earned him £300 for two days work.Andrew McConnell Stott, The Pantomime Life of Joseph Grimaldi: Laughter, Madness and the Story of Britain's Greatest Comedian, Canongate Books (2009) – Google Books Her company's repertoire included several Shakespeare plays: Hamlet, Macbeth, Richard III, As You Like It and The Merchant of Venice were performed at least weekly during the 1780s while comic operas and Dibdin's locally themed The Merry Hop-Pickers, or, Kentish Frolicks were regularly on the bill."]}, {"page": "Elizabeth Clendining", "response": ["In 1797 she returned from Ireland where she had been singing with Charles Incledon to perform again at Covent Garden. She was ill and this was her last season at Covent Garden. She appeared in \"Bantry Bay\" in the March."]}, {"page": "Incledon (surname)", "response": ["* Charles Incledon (1763–1826, English singer "]}]}}