{"wiki_id": "http://www.wikidata.org/entity/Q420512", "itemLabel": "Akong Rinpoche", "itemDescription": "spiritual master in Kagyu school, who brought tibetan buddhism in Europe (1940-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Akong_Rinpoche", "wikipedia_page": {"main": "Chöje Akong Tulku Rinpoche (Tibetan: ཆོས་རྗེ་ཨ་དཀོན་སྤྲུལ་སྐུ་རིན་པོ་ཆེ, 1940 – 8 October 2013) was a tulku in the Kagyu school of Tibetan Buddhism and co-founder of the Samye Ling Monastery in Scotland, Tara Rokpa Therapy & ROKPA International Charity.", "link_mentions": [{"page": "December 25", "response": ["*  1939   – Akong Rinpoche, Tibetan-Chinese spiritual leader (d. 2013)"]}, {"page": "October 8", "response": ["*  2013   – Akong Rinpoche, Tibetan-Chinese spiritual leader (b. 1939)"]}, {"page": "Tibetan Buddhism", "response": ["Meanwhile, the spread of Tibetan Buddhism in the Western world was accomplished by many of the refugee Tibetan Lamas who escaped Tibet, such as Akong Rinpoche and Chögyam Trungpa who in 1967 were founders of Kagyu Samye Ling the first Tibetan Buddhist Centre to be established in the West."]}, {"page": "Chögyam Trungpa", "response": ["On April 23, 1959, twenty-year-old Trungpa set out on an epic nine-month escape from his homeland.Trungpa, Chögyam (1966). Born in Tibet.164MacLean, Grant (2016). From Lion's Jaws: Chögyam Trungpa's Epic Escape To The West Masked in his account in Born in Tibet to protect those left behind,Trungpa, Chögyam (1966). Born in Tibet. the first, preparatory stage of his escape had begun a year earlier, when he fled his home monastery after its occupation by the Chinese People’s Liberation Army (PLA).From Lion's Jaws, 65-69. After spending the winter in hiding, he decided definitively to escape after learning that his monastery had been destroyed.Born in Tibet. 164 Trungpa started with Akong Rinpoche and a small party of monastics, but as they traveled people asked to join until the party eventually numbered 300 refugees, from the elderly to mothers with babies – additions which greatly slowed and complicated the journey. Forced to abandon their animals, over half the journey was on foot as the refugees journeyed through an untracked mountain wilderness to avoid the PLA. Sometimes lost, sometimes traveling at night, after three months’ trek they reached the Brahmaputra River. Trungpa, the monastics and about 70 refugees managed to cross the river under heavy gunfire,Born in Tibet.230 then, eating their leather belts and bags to survive, they climbed 19,000 feet over the Himalayas before reaching the safety of Pema Ko.Born in Tibet.239 After reaching India, on January 24, 1960 the party was flown to a refugee camp.Born in Tibet.248From Lion's Jaws.270", "In 1963, with the assistance of sympathetic Westerners, Trungpa received a Spalding sponsorship to study comparative religion at St Antony's College, Oxford University. In 1967, upon the departure of the western Theravadan monk Anandabodhi, Trungpa and Akong Rinpoche were invited by the Johnstone House Trust in Scotland to take over a meditation center, which then became Samye Ling, the first Tibetan Buddhist monastery in the West (future actor and musician David Bowie\"Bringing Chogyam Trungpa's \"Crazy Wisdom\" to the screen \" was one of Trungpa's meditation pupils there). In 1970, after a break with Akong, Trungpa moved to the United States at the invitation of several students.", "1967: Co-founds, with Akong Rinpoche, Kagyu Samyé Ling Monastery and Tibetan Centre, in Dumfriesshire, Scotland."]}, {"page": "Buddhism in the West", "response": ["Kagyu Samye Ling was founded in 1967 by two spiritual masters, Choje Akong Tulku Rinpoche and Chogyam Trungpa Rinpoche. It was the first Tibetan Buddhist Centre to be established in the West and was named after Samye, the very first monastery to be established in Tibet. In 1977 during his second visit to Samye Ling, the 16th Karmapa assured Akong Rinpoche about the longer-term future of Buddhism in the West and at Samye Ling. Holmes,Ken, “Karmapa Urgyen Trinley Dorje” page 30 It is from this encounter that the  Samye Project”Akong Rinpoché Establishing Buddha-Dharma: The Samye Project, http://www.akong.eu/dharma_8.htm was born. Samyé Ling now has established centres in more than 20 countries, including Belgium, Ireland, Poland, South Africa, Spain and Switzerland.https://www.samyeling.org/contact/affiliated-centres/", "All four of the main Tibetan Buddhist schools are now established in the West. Tibetan lamas such as Akong Rinpoche, Lama Gendün Rinpoche, Dudjom Rinpoche, Dilgo Khyentse Rinpoche, Chögyam Trungpa Rinpoche, Geshe Wangyal, Geshe Lhundub Sopa, Dezhung Rinpoche, Sermey Khensur Lobsang Tharchin, Lama Yeshe, Thubten Zopa Rinpoche and Geshe Kelsang Gyatso all established teaching centers in the West from the 1970s. Tibetan Lamas and their Western students also worked to translate and publish Tibetan Buddhist texts, establishing publishers such as Wisdom Publications and Shambala Publications."]}, {"page": "Yeshe Losal", "response": ["Born in 1943 into a farming family in Kham, East Tibet, he was given the name Jamphel Drakpa, or Jamdrak for short. He spent his early childhood close to nature helping with the family sheep and yaks and playing with the other children in the village; the children received no education as such. This changed when at 12 years old he was selected to go with his elder brother Choje Akong Rinpoche—who had been recognised as a tulku by the 16th Karmapa—to the Dolma Lhakang Monastery where he was to receive an education. Although Akong was only three years older than Jamdrak, it was the tradition that where a tulku is the abbot of a monastery one of his brothers goes to assist him. It is claimed that many auspicious signs had been seen when Jamdrak was born and he had also been recognised as a tulku, but not officially confirmed due to the political turbulence of the time. At Dolma Lhakang Jamdrak was a reluctant but diligent scholar under a succession of lamas, but his studies were interrupted by the Chinese invasion of Tibet in 1959.", "Jamdrak set off with his brother in a party of 300 to flee Tibet.  As the Chinese occupied Lhasa the party was forced to take an alternative route which involved a perilous journey across the Himalaya mountains. The arduous journey involved high altitudes, raging rivers, evading capture and near starvation. Of the three hundred that set off only thirteen, including Jamdrak and his brother Akong Rinpoche arrived safely in India.  The others were killed, captured or died of starvation.", "Meeting young American Peace Corps volunteers, Jamdrak became curious about the West. With the help of Chögyam Trungpa and Akong Rinpoche he obtained a visa and plane ticket to travel to Samye Ling in Scotland in 1969.", "The turning point for Jamdrak was a fishing trip to Orkney with a friend. With his Buddhist upbringing, he was uncomfortable with the idea of fishing but he went along with it to please his friend and soon caught many fish, which his friend killed with a blow to the head. His friend took a proud picture of all the dead fish and showed this to Akong Rinpoche on their return. Akong Rinpoche was deeply sad at seeing this picture—killing is against all the tenets of Buddhism—and lamented how he had promised their parents he would look after his younger brother and felt that he had failed.", "Akong Rinpoche requested that Lama Yeshe move to Purelands, a purpose-built retreat centre at Samye Ling, and in time he became the retreat master in 1988. At Akong Rinpoche's request, in 1995 Lama Yeshe was confirmed as abbot of Samye Ling by the Tai Situpa."]}, {"page": "Rimé movement", "response": ["Dzongsar Khyentse Chökyi Lodrö, Khunu Lama Tenzin Gyaltsen and Dilgo Khyentse are recent Rimé masters, known for their public influence and as being advisers and teachers to the 14th Dalai Lama. Other modern adherents include the late 16th Karmapa and 2nd Dudjom Rinpoche, both of whom gave extensive teachings from the works of Jamgon Kongtrul Lodro, as well as Akong Rinpoche who, with the late Chögyam Trungpa, helped establish Tibetan Buddhism in the United Kingdom. The lineage of the late Nyoshul Khenpo Rinpoche is represented today in the teachings of Surya Das."]}, {"page": "Rangjung Rigpe Dorje, 16th Karmapa", "response": ["In 1974, with the help of Freda Bedi, he embarked on his first world tour. On September 15, The Karmapa left Rumtek with an entourage of Tulkus and monks, including Tenga Rinpoche, Bardor Tulku Rinpoche and Lama Jigme Rinpoche. He was welcomed in London September 17, by Chime Rinpoche, Akong Rinpoche and others, including Hannah Nydahl and Lama Ole Nydahl. The Karmapa traveled to Europe, Canada and the United States, where he was welcomed by Chögyam Trungpa.Bausch, Gerd, \"Radiant Compassion, The Life of the 16th Gyalway Karmapa, Volume 1.\" 2018 pp. 177-178 He established Dhagpo Kagyu Ling in France as the central seat of activity, gave several Black Crown ceremonies, and attended an audience granted by Pope Paul VI. In 1976-77 he began a more exhaustive tour, giving extensive teachings, visiting nearly every major city in Europe."]}, {"page": "Akong", "response": ["#REDIRECT Akong Rinpoche"]}, {"page": "Buddhism in Europe", "response": ["In Spain, Buddhism began to become visible in the late 1970s, brought from other parts of Europe, especially France. In 2007, the Government of Spain recognized Buddhism as notorio arraigo (\"notorious rooted\" religion), obtaining official consideration. The first schools in the country were Zen (thanks to Maestro Antonio Shoten Orellana, who founded the first center, Dojo Zen in Seville, 1976, Dokushô Villalba, Denkō Mesa, and other monks) and Kagyu (from Akong Rinpoche's visit to Barcelona in 1977, invited by Lama Tsondru Zangmo). Currently, the Buddhist schools with the most presence in Spain are Tibetan Buddhism in first place (64,20%), and Zen in second place (23,30%). In 2013 were estimated 40,000 assiduous practitioners of Buddhism in Spain."]}, {"page": "Sherab Palden Beru", "response": ["The paintings in the temple at Samye Ling are known for their combination of large size and exquisite detail. As in Tibet, many of these paintings took between one and three years to complete. Along with Akong Rinpoche and his students, Beru also helped retrieve, restore and preserve thangkas from Tibet, many of which were destroyed in the early days of the Chinese occupation. Later Beru was joined at Samye Ling by his nephew, Gyamtso Tashi, an ordained monk and sculptor, who reached India after making a three-year pilgrimage on foot across Tibet."]}, {"page": "Rob Nairn", "response": ["Nairn was the African representative for the late Akong Rinpoche and is responsible for eleven Buddhist centres in South Africa and three other African countries."]}, {"page": "Akong Tulku Rinpoche", "response": ["#REDIRECTAkong Rinpoche"]}]}}