{"wiki_id": "http://www.wikidata.org/entity/Q4219395", "itemLabel": "Benjamin Hall Kennedy", "itemDescription": "English classical scholar and schoolmaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Hall_Kennedy", "wikipedia_page": {"main": "Benjamin Hall Kennedy (6 November 1804 – 6 April 1889) was an English scholar and schoolmaster, known for his work in the teaching of the Latin language. He was an active supporter of Newnham College and Girton College as Cambridge University colleges for women.", "link_mentions": [{"page": "Latin declension", "response": ["However, in Britain and countries influenced by Britain, the Latin cases are usually given in the following order: nominative, vocative, accusative, genitive, dative, ablative. This order was first introduced in Benjamin Hall Kennedy's Latin Primer (1866), with the aim of making tables of declensions easier to recite and memorise. It is also used in FrancePaul Crouzet (1902), Grammaire Latine, simple et complète, p. 7. and Belgium.Rosa (1962), a song by the Belgian singer Jacques Brel, with the declension of  following the British order of cases."]}, {"page": "Shrewsbury School", "response": ["Butler was succeeded by his pupil Benjamin Hall Kennedy (of Latin Primer fame) in 1836, who in turn gave way to Henry Whitehead Moss in 1866."]}, {"page": "1888 in literature", "response": ["*Benjamin Hall Kennedy (primarily written by his daughter Marion Kennedy) – Revised Latin Primer"]}, {"page": "1843 in literature", "response": ["*Benjamin Hall Kennedy – Elementary Latin Primer"]}, {"page": "Hugh Andrew Johnstone Munro", "response": ["Munro was born at Elgin, Moray, Scotland, the illegitimate son of Hugh Andrew Johnstone Munro of Novar by Penelope Forbes, and educated at Shrewsbury School, where he was one of Benjamin Hall Kennedy's first pupils.  He went on to Trinity College, Cambridge, in 1838, becoming a scholar in 1840, second classic and first chancellor's medallist in 1842, and fellow of his college in 1843. He became classical lecturer at Trinity College, and in 1869 was elected to the newly founded chair of Latin at Cambridge, but resigned it in 1872."]}, {"page": "1804 in literature", "response": ["*November 6 – Benjamin Hall Kennedy, English classicist (died 1880)"]}, {"page": "John Moultrie (poet)", "response": ["In 1854, his last volume of verse appeared, 'Altars, Hearths, and Graves.' Among its contents is the 'Three Minstrels,' giving an account of Moultrie's meetings, on different occasions, with Wordsworth, Coleridge and Tennyson. In his later work Moultrie became the writer of much blank verse of a conscientious and explanatory type. He also wrote a number of hymns, on special subjects. Most of them are in Benjamin Hall Kennedy's Hymnologia Christiana, 1863."]}, {"page": "William George Clark", "response": ["Clark established the Cambridge Journal of Philology, and cooperated with Benjamin Hall Kennedy and James Riddell in the production of the Sabrinae Corolla. He published little as a classical scholar. A contemplated edition of the works of Aristophanes was never published. He visited Italy in 1868 to examine the Ravenna manuscript of Aristophanes and other manuscripts, and on his return began the notes to the Acharnians, but they were left  incomplete."]}, {"page": "List of professorships at the University of Cambridge", "response": ["| Friends and former pupils of Benjamin Hall Kennedy"]}, {"page": "Kennedy Professor of Latin", "response": ["In 1865, when Benjamin Hall Kennedy retired as headmaster of Shrewsbury School, his friends and former pupils created a fund with the intention of founding a chair in Latin to be named after him. Kennedy himself added £500 to the fund on the condition that the chair not be named after him. The professorship was thus created in 1869. In 1911, after Kennedy's death, the professorship was in fact renamed after him, with the consent of his family."]}, {"page": "Samuel Butler (novelist)", "response": ["He was sent to Shrewsbury at the age of twelve, where he did not enjoy the hard life under its then headmaster, Benjamin Hall Kennedy, whom he later drew as \"Dr Skinner\" in The Way of All Flesh. Then in 1854 he went up to St John's College, Cambridge, where he obtained a first in Classics in 1858. (The graduate society of St John's is named the Samuel Butler Room (SBR) in his honour.)"]}, {"page": "Samuel Butler (schoolmaster)", "response": ["Charles Darwin, who recalled loathing the rote learning, was among his notable pupils, as was Butler's immediate successor as headmaster, Benjamin Hall Kennedy."]}, {"page": "Mary Paley Marshall", "response": ["She was educated at home, excelling in languages: in 1871, after performing well in  entrance exams, she earned a scholarship to become one of the first five students at the recently founded Newnham College in Cambridge.Mary Paley Marshall, One of Five Original Newnham College Students, Newnham College, ArtUK, Retrieved 20 February 2017 She took the Moral Sciences Tripos in 1874, and was classed between a first and second-class, though as a woman she was debarred from graduation. Paley sat the exam with Amy Bulley. They were some of the first women to take tripos examinations and they sat the exams in Marion and Benjamin Hall Kennedy's drawing room. Paley described Professor Kennedy as excitable, but he would sometimes doze whilst invigilating. The only evidence she was given of her work was a confidential letter from her examiners. Women sitting the tripos examination was a milestone for Cambridge University and the importance can be gauged by the people involved. The people who delivered Paley and Bulley's papers were Alfred Marshall, Henry Sidgwick, John Venn and Sedley Taylor. She was to pass with honours but this did not entitle her to an official degree. Cambridge was to resist recognising its own women graduates; a restriction that was, later, to be supported by her future husband."]}, {"page": "West Felton", "response": ["Benjamin Hall Kennedy was Rector of West Felton from 1866 to 1868."]}, {"page": "Orgelbüchlein", "response": ["Below is the German text of the 1568 Lutheran hymn by the Bohemian theologian Christoph Fischer, with the English translation of Benjamin Hall Kennedy."]}, {"page": "Charles Rann Kennedy", "response": ["Kennedy was born in Birmingham, son of Rann Kennedy, and the younger brother of Benjamin Hall Kennedy. He was educated at Shrewsbury School and Trinity College, Cambridge, where he graduated as senior classic (1831) and was elected fellow. He entered Lincoln's Inn, was called to the bar in 1835, became a barrister, and settled at Birmingham. From 1849 to 1856 he was professor of law at Queen's College, Birmingham (a predecessor college of Birmingham University).[Anon.] (1911)", "His grandson, also named Charles Rann Kennedy (1871–1950), was a playwright and actor who married actress Edith Wynne Matthison. His older brother was classicist Benjamin Hall Kennedy."]}, {"page": "List of Old Salopians", "response": ["* Benjamin Hall Kennedy (1804–1889), headmaster and classical scholar"]}, {"page": "1804 in the United Kingdom", "response": ["*6 November – Benjamin Hall Kennedy, Latin scholar and promoter of women's higher education (died 1889)"]}, {"page": "1889 in the United Kingdom", "response": ["* 6 April – Benjamin Hall Kennedy, Latin scholar and promoter of women's higher education (born 1804)"]}, {"page": "Kennedy (surname)", "response": ["*Benjamin Hall Kennedy, English classical scholar"]}, {"page": "Henry Whitehead Moss", "response": ["In 1866, Benjamin Hall Kennedy resigned the headmastership of Shrewsbury School, and at the age of 25, Moss was chosen to succeed him; he remained in the post for forty-two years, until he retired in 1908. Whilst headmaster, he supervised the movement of the school from its town centre site to a new location, at Kingsland, on the outskirts of the town in 1882."]}, {"page": "Benjamin Kennedy", "response": ["#Redirect Benjamin Hall Kennedy"]}, {"page": "Ben Kennedy", "response": ["* Benjamin Hall Kennedy (1804–1889), English scholar"]}, {"page": "Mill Road Cemetery, Cambridge", "response": ["* Benjamin Hall Kennedy (1804–1889), classicist.The Classical Review, 1889, p.227"]}, {"page": "Basil Jones", "response": ["Jones was born on 1 January 1822 in Cheltenham to William Tilsey Jones of Gwynfryn and his wife Jane. He was educated at Shrewsbury School, under the tutelage of Samuel Hall and Benjamin Hall Kennedy from 1834 to 1841, becoming head boy in his final year. In 1842 he matriculated to Trinity College, Oxford. He was placed in the second class in his final school of literae humaniores and in 1845 he graduated BA, receiving his MA in 1847. In 1848 Jones was elected to a Michel fellowship at Queen's College, but in 1851 he exchanged it for a fellowship at University College, Oxford, which he held until 1857. During his time as a fellow at University College he became assistant tutor and bursar, and from 1858 through to 1865 was a lecturer in modern history and the classics. He left Oxford in 1865."]}, {"page": "James Riddell (scholar)", "response": ["Born on 8 June 1823, he was the eldest son of James Riddell (1796–1878), rector of Easton, Hampshire, by Dorothy, daughter of John Foster, of Leicester Grange, Warwickshire. After spending seven years at Mr. Browne's school at Cheam, Surrey, Riddell entered Shrewsbury School in 1838 as a pupil of Benjamin Hall Kennedy. He gained a scholarship at Balliol College, Oxford, his father's old college, in November 1840, and, leaving Shrewsbury as head boy in 1841, he began residence in Oxford in the Michaelmas term of that year. He was placed in the first class in literæ humaniores with Thomas Arnold and Goldwin Smith. He was elected Fellow of Balliol, serving his college as lecturer or tutor till his death."]}, {"page": "St Mary's School, Cambridge", "response": ["St Mary's School, Cambridge, was founded 1898 by the sisters of Mary Ward and the Institute of the Blessed Virgin Mary, who had also founded a school of the same name in Ascot, Berkshire 13 years earlier. The sisters started out with two day girls and two day boarders. In 1904 the swelling numbers necessitated a change of venue and 'The Elms' on Bateman Street was purchased for £6,000. The house had a tradition that was very much in keeping with Mary Ward's vision. It had previously belonged to Benjamin Hall Kennedy, former Regius Professor of Greek at Cambridge University. As the school continued to grow, other premises were added. Paston House was purchased in 1909.History"]}, {"page": "Robert Burn (classicist)", "response": ["Burn was born at Kynnersley, Shropshire, on 22 October 1829, was second son of Andrew Burn, rector of Kynnersley, by his second wife. He was educated at Shrewsbury School under Benjamin Hall Kennedy in 1843 and Trinity College, Cambridge, in 1849."]}, {"page": "Caroline Jebb", "response": ["In 1874 she married the classicist Richard Claverhouse Jebb.Hugh Lloyd-Jones, 'Jebb, Sir Richard Claverhouse (1841–1905)', first published 2004; online edn, May 2006, 2277 words, with portrait illustration  They lived in Glasgow, where her husband was a professor, but spent summers in Cambridge until the death of Benjamin Hall Kennedy vacated the Regius Professor of Greek at Cambridge.  Her social circle included Robert Browning, Thomas Carlyle, Charles Darwin, Benjamin Disraeli, George Eliot, Charles Hale, Oliver Wendell Holmes, James Russell Lowell, Alfred Lord Tennyson, Ellen Terry, Mark Twain, and William Thackeray.  Her niece, Maud du Puy, daughter of her sister Ellen followed her to England and she took the role of proxy mother, helping to arrange her 1884 marriage to George Darwin, the astronomer son of the naturalist Charles Darwin."]}]}}