{"wiki_id": "http://www.wikidata.org/entity/Q4216211", "itemLabel": "Jonathan Mason", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Mason_(actor)", "wikipedia_page": {"main": "Jonathan Mason is an English actor. He is known for playing the lead role of the 2005 version of Lassie.\nHe is most notable for the part of Joe Carraclough in Lassie and as the roles of James, in Nits and Alistair Fury on The Revenge Files of Alistair Fury.\nHe also had a minor role in Vincent in 2006. Jonathon studied at Notre Dame Catholic Sixth Form College in Leeds. Jonathan currently studies at Sheffield Hallam University in Sheffield. Mason also had a role in The Race as Mary Kensay's best friend.", "link_mentions": [{"page": "Notre Dame Catholic Sixth Form College", "response": ["* Jonathan Mason (actor)"]}, {"page": "Lassie (2005 film)", "response": ["Lassie is a 2005 adventure comedy-drama film based on Eric Knight's 1940 novel Lassie Come-Home about the profound bond between Joe Carraclough and his rough collie, Lassie. The film was directed, written, and co-produced by Charles Sturridge and is a production of Samuel Goldwyn Films. The film stars Jonathan Mason and was distributed by Roadside Attractions and released in the UK on 16 December 2005. Filming took place in Scotland, Ireland and the Isle of Man. The supporting cast features Peter O'Toole, Samantha Morton, Peter Dinklage, Edward Fox, and John Lynch. The film was generally reviewed positively by critics, but performed poorly at the box office.", "* Jonathan Mason as Joe Carraclough", "| Best Performance in an International Feature Film and Best International Family Feature Film - Leading Young Actor or Actress || Jonathan Mason || "]}, {"page": "1996 in the United Kingdom", "response": ["** Jonathan Mason, actor"]}, {"page": "Jonathan Mason", "response": ["Jonathan Mason may refer to:", "*Jonathan Mason (politician), American politician, 1756–1831", "*Jonathan Mason (actor), English actor"]}, {"page": "The Revenge Files of Alistair Fury", "response": ["The Revenge Files of Alistair Fury, airs on BBC One and the CBBC Channel. The Australian Broadcasting Corporation also aired it on ABC1. It follows 11-year-old Alistair Fury (Jonathan Mason) who starts a club called The Revengers, which he operates through his website. Through this club, he attempts to get his own back on his annoying family, and the programme charts his revenges against them, as well as others. His family consist of his mother Celia (Susannah Doyle), his father Sean (Brendan Dempsey), his older brother William (Carlton Dickinson) and eldest sibling Melanie (Natalie Kemp). Also appearing is Alistair's grandmother, Constance (Kate Binchy). He is assisted in his \"Revenges\" by two friends, Aaron Pryce and  Ralph Ming (Alex Smith).", "| Alistair Fury (Jonathan Mason)"]}, {"page": "28th Young Artist Awards", "response": ["* Jonathan Mason (England) - Lassie - Samuel Goldwyn Company"]}, {"page": "Luke Roskell", "response": ["Roskell had his first acting role in the ITV miniseries Mobile in 2007; the following year, he was part of the main cast of TV series The Revenge Files of Alistair Fury, broadcast by BBC One and the CBBC Channel; he played the role of Aaron Pryce, a friend of main character Alistair Fury (played by Jonathan Mason). In 2010, Roskell branched out into theatre following a successful audition for the musical Her Benny, adapted from the eponymous Victorian novel (1879) about Liverpool street children by Silas Hocking. Roskell played Perks, one of the street children, over the show's October run at the Theatre Royal in St Helens."]}]}}