{"wiki_id": "http://www.wikidata.org/entity/Q4215548", "itemLabel": "Jack Karnehm", "itemDescription": "British snooker broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Karnehm", "wikipedia_page": {"main": "Jack Karnehm (18 June 1917, Tufnell Park, north London, England – 28 July 2002, Crowthorne, Berkshire) was a British snooker commentator, who was regularly heard on BBC television from 1978 until 1994, and a former amateur world champion at the game of English billiards. Karnehm was also a professional snooker and billiards player.Besides his commentary, perhaps his major contribution to the game was his development of the swivel-lens glasses, which enabled Dennis Taylor to win the World Snooker Championship in 1985. These were spectacles which were set at a compensatory angle, so the player could look along the shot through the optical centre of the lens. The originals had been designed by Theodore Hamblin, and pioneered by Fred Davis in 1938. Karnehm, who had served a five-year spectacle-making apprenticeship, made many pairs in his family business, but his upside-down design was a considerable improvement - it offered wider peripheral vision - and helped Taylor win the 1985 world title.Despite being best known to snooker audiences, Karnehm's passion was billiards.  As a non-professional player, he was a ten-time London Amateur Billiards Champion, and also won the English Amateur Billiards Championship in 1969. That October, he took the IBSF World Billiards Championship title.Karnehm turned professional in 1970, and was a challenger for the world title in 1971 and 1973, losing to Leslie Driffield and Rex Williams respectively. He was Chairman of the Billiards Association and Control Council when the Council nominated Leslie Driffield as the challenger to reigning champion Rex Williams for the professional Billiards Championship. Williams declined to play Driffield within the five months time limit that the BA&CC Council had set, which expired on 7 July 1970, and forfeited the title, which was then contested between Driffield and Karnehm in June 1971. On 1 October 1970, the Professional Billiard Players Association, which had been reestablished in 1968 Williams and seven other players, disaffiliated from the BA&CC. It changed its name to the World Professional Billiards and Snooker Association on 12 December 1970, and declared itself the governing body for the professional game, recognising Williams as champion. Driffield and Karnehm were, at first, the only two professionals to recognise the BA&CC's authority over the game.In 1980, Karnehm beat Williams to win the UK Billiards Championship, his only professional title.Karnehm also turned professional in snooker in 1971, his best result coming when losing 4–5 to Chris Ross in the U.K. Championship of 1977.Karnehm is perhaps best known for his one-liner when he was commentating on a match between Cliff Thorburn and Terry Griffiths, at the Crucible in 1983. The match was famous because, during the match, Thorburn completed the first maximum at the Crucible. As Thorburn lined up to pot the black, Karnehm uttered the words: 'Good luck, mate'.Karnehm was also a noted snooker coach, and, in 1985, released an instructional video, 'Understanding Modern Snooker'. He continued to coach, and was still President of the Radstock Billiards association until 2000. He died suddenly in 2002, aged 85, after an afternoon working on his garden in extreme heat.", "link_mentions": [{"page": "June 18", "response": ["*  1917   – Jack Karnehm, English snooker player and sportscaster (d. 2002)"]}, {"page": "Tufnell Park", "response": ["* Jack Karnehm, snooker commentator, was born in Tufnell Park"]}, {"page": "List of sports announcers", "response": ["* Jack Karnehm – BBC Sport 1978–1994"]}, {"page": "World Snooker Championship", "response": ["Cliff Thorburn made the first maximum break of the World Championship in 1983 during his second-round match against Terry Griffiths. The importance of this achievement at the time is demonstrated by the fact that play was stopped on the other table. This was the break that gave the World Championship one of its most iconic words of commentary, \"oh, good luck mate\" on the final black, courtesy of Jack Karnehm. Thorburn beat Griffiths in a final-frame decider, a match that finished at 03:51, the latest-ever finish for a match at the Crucible. Thorburn then also won his quarter-final and semi-final matches in the deciding frame; exhausted, and deflated by the news that his wife had suffered a miscarriage, he faced a one-sided final against Steve Davis who won 18–6. The 1984 final was between Steve Davis and Jimmy White (in his first final). Davis led 12–4 after the first day but White won seven of the eight frames on the final afternoon. Davis led 16–12 at the evening interval and, despite a comeback from White, Davis won 18–16.", "BBC TV coverage for the first Crucible championship in 1977 was increased but was limited to highlights of the semi-finals and some coverage of the final on Grandstand and a late night highlights programme. The commentator was Ted Lowe with the highlight programmes presented by Alan Weeks. The 1978 championship was the first to have daily BBC TV coverage with 14 nightly highlights programmes as well as Saturday afternoon coverage on Grandstand. Ted Lowe commentated while the programmes were presented by David Vine and Alan Weeks. In 1979, TV coverage was extended to include an early-evening \"Frame of the Day\" as well as live coverage of parts of the final. David Vine was the presenter while the commentary team was extended to include Jack Karnehm and Clive Everton. In 1980, TV coverage included daily live coverage for the first time. Coverage of the final was interrupted to bring live coverage of the Iranian Embassy Siege.", "David Vine continued to be the main host for the BBC's TV coverage until 2000, with David Icke as prominent second host from 1985 to 1990, and Dougie Donnelly through the 1990s. For some years commentary was primarily by Ted Lowe, Clive Everton and Jack Karnehm although John Pulman, Vera Selby and others were used. In 1986 Jim Meadowcroft, John Spencer and John Virgo were used as summarisers. From 2001 to 2009 the BBC coverage was hosted by Hazel Irvine or Ray Stubbs. From 2010, Hazel Irvine took over with highlights presented by Rishi Persad. In February 2013, the BBC announced that Rishi Persad had been replaced by Jason Mohammad, who himself later stepped down from those duties after the conclusion of the 2019 Masters and was replaced by Seema Jaswal. Commentators have included Willie Thorne, Dennis Taylor, John Virgo, John Parrott, Steve Davis, Ken Doherty, Stephen Hendry, Terry Griffiths and Neal Foulds."]}, {"page": "Ray Reardon", "response": ["In January 1976, Reardon appeared on This is Your Life, with guests including Spencer, Charlton, Higgins, Pulman, Miles, Jackie Rea, Cliff Thorburn and Joyce Gardner. Reardon's prominent eye teeth and widow's peak led to him being nicknamed \"Dracula\". The sobriquet was first used by Paul Daniels after Reardon appeared on one of Daniels's television shows. Everton has described Reardon in his early career as a \"deadly long potter\", and praised his \"the nerve with which he identified and seizes frame winning openings.\" Jack Karnehm wrote that Reardon achieved \"complete and utter dominance of the game\" by 1976, and \"had a determination and will to win unequalled since the heyday of Joe Davis.\" Williams and Gadsby describe Reardon as \"without doubt the most successful snooker player of the 1970s\" and claim \"he set new standards for mental fortitude\" in the game."]}, {"page": "List of snooker players", "response": ["*Jack Karnehm"]}, {"page": "Rex Williams", "response": ["Leslie Driffield was nominated as the BA&CC challenger to Williams for the professional Billiards Championship. Williams declined to play Driffield within the five months time limit that the BA&CC had set, which expired on 7 July 1970, and forfeited the title, which was then contested between Driffield and Jack Karnehm in June 1971. On 1 October 1970, the PBPA disaffiliated from the BA&CC. The PBPA changed its name to the World Professional Billiards and Snooker Association on 12 December 1970, and declared itself the governing body for the professional game, recognising Williams as champion. Driffield and Karnehm were, at first, the only two professionals to recognise the BA&CC as continuing to have authority over the game. During the 1970s, Williams made four successful defences of his title, against Bernard Bennett in 1971, Karnehm in 1973, and Eddie Charlton in 1974 and 1976. He also won the 1979 UK Championship, which was the first time the event had been held since Fred Davis won in 1951. Williams beat Karnehm in the semi-final and John Barrie 2,952–2,116 in the final. He reached the 1980 and 1981 UK finals, both against Karnehm, losing 2,423–2,518 in 1980 and winning 1,592–1,112 in 1981."]}, {"page": "Cliff Wilson", "response": ["His popular exhibition matches were advertised with the phrase \"You've never seen anything like it!\" He was known as a fast, attacking, player and has been described as an \"outstanding potter\" both by Everton and by snooker writer Ian Morrison.  In 1953, a Sports Argus match report described Wilson as having \"lived up to his reputation as the finest potter in the country, one ball being hardly in the pocket before the next one was following it in.\" Wilson's obituary in The Times noted that in the 1950s he was seen as a \"phenomenal talent\" and played an attacking game that was unlike the defensive approach generally prevalent at the time, and Eurosport's Desmond Kane included him in a 2020 list of the ten \"greatest long potters\". Jack Karnehm in 1981 wrote that Wilson was \"probably the hardest hitter of a ball on earth. His high-speed accurate potting has to be seen to be believed\" and added \"it is said that the last time he played a safety shot was in 1959 and that was by mistake.\""]}, {"page": "Clive Everton", "response": ["He began commentating on snooker for BBC radio in 1972, and for BBC Television from 1978 until 2010. In the snooker boom years of the 1980s, he commentated alongside Ted Lowe and Jack Karnehm, and became the leading commentator in the 1990s. As an amateur player, he won junior titles in English billiards, and the Welsh billiards title several times. He was five-times runner up in the English amateur billiards championship, and twice a semi-finalist at the world amateur championship. In snooker, he partnered Roger Bales as they won the United Kingdom National Pairs Championship. Everton turned professional in 1981, achieving a highest ranking of 47th in the world in ten years as a snooker professional. He reached a peak of ninth place in the professional billiards rankings, and remained in the top 20 ranked players even into his sixties.", "He was the editor of the magazine Billiards and Snooker, owned by the Billiards Association and Control Council, from the December 1966 issue until the February 1971 issue. According to Everton, he was sacked at the instigation of Jack Karnehm, the Chairman of the Billiards and Snooker Control Council (as the Billiards Association and Control Council had renamed itself) for \"giving professionals publicity\". In Everton's account, this followed him including picture of four professional players on the cover of Billiards and Snooker at a time when the Billiards and Snooker Control Council and the professional players were in dispute over the World Billiards Championship. This dispute led to the Professional Billiards Players Association renaming itself as the WPBSA and splitting from the Billiards and Snooker Control Council (B&SCC). Following his sacking, Everton established his own magazine, World Snooker. In 1972, the B&SCC approached Everton to take over Billiards and Snooker and paid him £1,000 to do so. Everton merged Billiards and Snooker and World Snooker into Snooker Scene, which published its first issue in April 1972. Snooker Scene has sometimes featured criticisms of the WPBSA which have led to legal disputes. As of August 2021, he remains as editor of Snooker Scene. Everton has said of Snooker Scene: \"I had started this as a simple journal of record of what was happening on the table, but it became a crusading vehicle … Taking Wisden and Private Eye as our models we sometimes made our point through hard reporting, sometimes through satire.\""]}, {"page": "1981 World Snooker Championship", "response": ["The two-time World Amateur Champion Ray Edmonds had never beaten John Spencer in a match, and had lost to him twice in the final of the English Amateur Championship. Edmonds led 5–4 after the first session of their match, but then found himself 5–7 behind as Spencer won three consecutive frames. Edmonds then equalised the score at 7–7, and Spencer drew ahead again to lead 9–7. Edmonds, aided by fluking a , won the next two frames to force the match to go to a deciding frame. Jack Karnehm, a snooker commentator and author, later suggested that Spencer was able to win the last frame, in which he made a break of 38, because he had the better ability to handle pressure better than Edmonds did."]}, {"page": "1978 World Snooker Championship", "response": ["|  Roy Andrewartha || 9–0 ||  Jack Karnehm"]}, {"page": "1977 World Snooker Championship", "response": ["|  Dennis Taylor || align=\"center\"|11–0 ||  Jack Karnehm"]}, {"page": "1974 World Snooker Championship", "response": ["|  John Pulman || 8–0 ||  Jack Karnehm"]}, {"page": "Jackie Rea", "response": ["Rea was in his prime during a period when snooker players had to rely on exhibition bookings for their income. He made his exhibitions attractive by using comedy during them, indeed Jack Karnehm described Rea \"as much as comedian as a snooker player\". Virgo has admitted his snooker impressions were inspired by Rea."]}, {"page": "IBSF World Billiards Championship", "response": ["| 1969 || London ||  Jack Karnehm ||  Michael Ferreira || Round Robin", "| 1964 || Pukekohe ||  Wilson Jones ||  Jack Karnehm || Round Robin"]}, {"page": "World Billiards Championship (English billiards)", "response": ["Leslie Driffield, a member of the BA&CC, was present at a meeting where the Council nominated him as the challenger to Rex Williams for the professional Billiards Championship. Williams declined to play Driffield within the five-month time limit set by the BA&CC, which expired on 7 July 1970, thus forfeiting the title, which was then contested between Driffield and Jack Karnehm in June 1971. On 1 October 1970, the Professional Billiard Players Association (PBPA)—which had been re-established in 1968 by Williams and seven other players—disaffiliated from the BA&CC. The PBPA then changed its name to the World Professional Billiards and Snooker Association (WPBSA) on 12 December 1970, and declared itself the governing body for the professional game, recognising Williams as champion. Driffield and Karnehm were, at first, the only two professionals who recognised the BA&CC as having continued authority over the game.", "|bgcolor=\"FFFFFF\"| Jack Karnehm", "|bgcolor=\"FFFFFF\"| Jack Karnehm"]}, {"page": "Dennis Taylor", "response": ["Beginning in 1983, Taylor wore distinctive glasses designed by Jack Karnehm specifically for playing snooker. Often described as looking upside-down, they gave him a unique look on the circuit. Since retiring from the main professional tour in 2000, he has been a regular commentator on BBC snooker broadcasts. He competed on the World Seniors Tour until he announced the end of his competitive playing career in 2021, aged 72. Outside snooker, he appeared on the third series of Strictly Come Dancing, finishing eighth alongside dance partner Izabela Hannah."]}, {"page": "Roy Andrewartha", "response": ["He turned professional in the 1976–77 snooker season. In qualifying for the 1977 World Championship, Andrewartha faced John Virgo, but lost 1–11. At the 1978 tournament, he whitewashed Jack Karnehm 9–0 before being defeated 3–9 by Doug Mountjoy in the last 24."]}, {"page": "Deaths in July 2002", "response": ["*Jack Karnehm, 85, British snooker commentator, heat stroke."]}, {"page": "Billiards and Snooker Control Council", "response": ["Leslie Driffield, a member of the BA&CC Council, was present at a meeting where he the Council nominated him as the challenger to Rex Williams for the professional Billiards Championship. Williams declined to play Driffield within the five months time limit that the BA&CC Council had set, which expired on 7 July 1970, and forfeited the title, which was then contested between Driffield and Jack Karnehm in June 1971. On 1 October 1970, the Professional Billiard Players Association, which had been reestablished in 1968 Williams and seven other players, disaffiliated from the BA&CC. The Professional Billiard Players Association changed its name to the World Professional Billiards and Snooker Association on 12 December 1970, and declared itself the governing body for the professional game, recognising Williams as champion. Driffield and Karnehm were, at first, the only two professionals to recognise the BA&CC as continuing to have authority over the game.References"]}, {"page": "Norman Dagley", "response": ["In his first attempt at the World Professional Championship, when the matches were played as the best of five games of 400-up, he proceeded to the 1985 final without losing a game, with 3–0 wins over Jack Fitzmaurice, Jack Karnehm and Robby Foldvari. Dagley finished as runner up to Ray Edmonds 3–1, with most games being close. The game scores (Edmonds first) were 400–395, 307–400, 400–315 and 400–386."]}, {"page": "Leslie Driffield", "response": ["Driffield was a member of the Billiards Association and Control Council, and was present at the meeting where he the Council nominated him as the challenger to Rex Williams for the professional Billiards Championship. Williams declined to play Driffield within the five months time limit that the B&SCC Council had set, which expired on 7 July 1970, and forfeited the title, which was then contested between Driffield and Jack Karnehm. Driffield beat Karnehm 9,029–4,342 in June 1971, in a match not recognised by most professional players. Meanwhile, on 12 December 1970, the Professional Billiard Players Association, which had been reestablished in 1968 Williams and seven other players, changed its name to the World Professional Billiards and Snooker Association and declared itself the governing body for the professional game, recognising Williams as champion."]}, {"page": "Snooker Scene", "response": ["Everton had been the editor of Billiards and Snooker from the December 1966 issue until the February 1971 issue when he was succeeded by Doug Organ. According to Everton, he was sacked at the instigation of Jack Karnehm, the Chairman of the Billiards and Snooker Control Council (as the Billiards Association and Control Council had renamed itself) for \"giving professionals publicity\" by including picture of four professional players on the cover of Billiards and Snooker at a time when the Billiards and Snooker Control Council and the professional players were in dispute over the World Billiards Championship. This dispute led to the Professional Billiards Players Association renaming itself as the World Professional Billiards and Snooker Association (WPBSA) and splitting from the Billiards and Snooker Control Council (B&SCC). Following his sacking, Everton established his own magazine, World Snooker, which printed and sold 3,000 copies of its first issue published in January 1971."]}, {"page": "Chris Ross (snooker player)", "response": ["In his first professional match, Ross was whitewashed 0–11 by Cliff Thorburn in a qualifying round match for the 1977 World Snooker Championship. In the 1977–78 snooker season, he defeated Jack Karnehm 5–4 in the first qualifying round for the 1977 UK Championship before losing 1–5 to Graham Miles in the second qualifying round. The only other tournament he played in was the 1978 World Snooker Championship, where he lost 1–9 to Pat Houlihan. He did not record any match wins in the following two seasons; He also played in the 1980 UK Professional English billiards championship, losing 933–1,093 to Bernard Bennett."]}]}}