{"wiki_id": "http://www.wikidata.org/entity/Q4227429", "itemLabel": "John Edmund Cox", "itemDescription": "English priest and author", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Edmund_Cox", "wikipedia_page": {"main": "John Edmund Cox (1812–1890), also Edmond, was an English cleric and antiquarian, best known as an editor of the works of Thomas Cranmer.\n\n", "link_mentions": [{"page": "Prayer Book Rebellion", "response": ["The religious aims of the rebellion were highlighted in the slogan \"Kill all the gentlemen and we will have the Six Articles up again, and ceremonies as they were in King Henry's time.\" However, it also implies a social cause (a view supported by historians such as Guy and Fletcher).  That later demands included limiting the size of households belonging to the gentry – theoretically beneficial in a time of population growth and unemployment – possibly suggests an attack on the prestige of the gentry.  Certainly such contemporaries as Thomas Cranmer took this view, condemning the rebels for deliberately inciting a class conflict by their demands: \"to diminish their strength and to take away their friends, that you might command gentlemen at your pleasures\".Cranmer's reply to the rebels has been published in: The Works of Thomas Cranmer, Archbishop of Canterbury, ed. John Edmund Cox, Parker Society publications, 2 vols., Cambridge University Press, 1844–1846, vol. 2, pp. 163–187 Protector Somerset himself saw dislike of the gentry as a common factor in all of the 1549 rebellions: \"indeed all hath conceived a wonderful hate against the gentlemen and taketh them all as their enemies.\"Somerset to Sir Philip Hobby, 24 August 1549. In: Gilbert Burnet, The history of the Reformation of the Church of England, ed. Nicholas Pocock, Oxford: Clarendon Press, 1865, vol. V., pp. 250–151. Cited in: Roger B. Manning, \"Violence and social conflict in mid-Tudor rebellions,\" Journal of British Studies, vol. 16, 1977, pp. 18–40 (here p. 28)"]}, {"page": "Sion College", "response": ["*1865. John Edmund Cox, M.A. Rector of St Helen, Bishopsgate."]}, {"page": "Ralph Morice", "response": ["Morice, from his official position, was in possession of information, and helped John Foxe and others in their literary researches, mainly by supplying them with his Anecdotes of Cranmer. This compilation was used by Strype in his Memorials of Cranmer, and was reprinted from the manuscript at Corpus Christi College, Cambridge, in Narratives of the Reformation (Camden Society). Morice gave other assistance to Foxe, and wrote an account of Latimer's conversion, which is printed in Strype's Memorials and in Latimer's Works. Harleian MS. 6148 consists of copies of letters written by Morice on the archbishop's business. Transcripts by Strype of some of these form Lansdowne MS. 1045. They were published by Henry Jenkyns and John Edmund Cox in their editions of Cranmer's ‘Works.’"]}, {"page": "Parker Society", "response": ["|John Edmund Cox"]}, {"page": "Henry Robinson Allen", "response": ["Allen was born in Cork, Ireland and received his musical education at the Royal Academy of Music, London. His debut took place on 11 January 1831, as Basilio in a performance of Mozart's The Marriage of Figaro by the students of the Academy at the King's Theatre. He first attracted public attention by his performance, on 5 February 1842, of Damon on the production of Acis and Galatea (Handel) under William Macready at Drury Lane. In John Edmund Cox's Musical Recollections, he is identified as \"the only person worth listening to, in spite of the limited powers of his organ\".. In 1843, under the same management, he played Acis and Phaon in Giovanni Pacini's opera Saffo, when the heroine on each occasion was Clara Novello, and later in the autumn he played at the Princess's Theatre as Edward III in the English version of Balfe's Le Puits d'Amour."]}, {"page": "John Edmond Cox", "response": ["#REDIRECT John Edmund Cox"]}]}}