{"wiki_id": "http://www.wikidata.org/entity/Q42326017", "itemLabel": "Ghislaine Boddington", "itemDescription": "British artist, curator, presenter and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Ghislaine_Boddington", "wikipedia_page": {"main": "Ghislaine Boddington (born 11 October 1962) is a British artist, curator, presenter and director specialising in body responsive technologies, immersive experiences and collective embodiment, pioneering it as 'hyper-enhancement of the senses' and 'hyper-embodiment' since the late 80s.", "link_mentions": [{"page": "Telepresence", "response": ["From 1997 to the present Ghislaine Boddington of shinkansen and body>data>space has explored, in a collaboration process she has called The WeaveThe Weave, Virtual presence physical beings – from telegraph to telecast – a reflection on virtual beingness Ghislaine Boddington November 2000, commissioned by ResCen, Middlesex University using performing arts techniques, the extended use of telepresence into festivals, arts centres and clubs and has directed numerous workshops leading to exploration of telepresence by many artists worldwide. This methodology has been used extensively to develop skills in tele-intuition for young people in preparation for the future world of work through the body>data>space / NESTA project \"Robots and Avatars\" an innovative project explores how young people will work and play with new representational forms of themselves and others in virtual and physical life in the next 10–15 years."]}, {"page": "Click (TV programme)", "response": ["BBC World Service broadcasts a weekly sister radio show, Digital Planet,  which, for a time, shared the same name. It is presented by Gareth Mitchell and contributors Bill Thompson, Ghislaine Boddington and Angelica Mari."]}, {"page": "Digital Planet", "response": ["Digital Planet (previously known as Click and originally Go Digital) is a radio programme broadcast on the BBC World Service presented by Gareth Mitchell.  Alternating as contributors are Bill Thompson, Ghislaine Boddington and Angelica Mari, who comment on items in the programme and discuss them with Mitchell. The show, broadcast weekly, covers  technology stories and news from around the world.Click Home , \"BBC IPlayer\", October 28, 2017, accessed October 28, 2017. "]}, {"page": "Robots and Avatars", "response": ["The project examined multi-identity evolutions of younger generations within the context of a world in which virtual and physical spaces are increasingly blended. A participatory web and events led programme with connected educational activities took taking place across 2010 and onwards, in the UK and internationally. The project included contributions by a diverse range of experts, professionals and specialists working with robots and avatars including Professor Noel Sharkey (Professor of Artificial Intelligence and Robotics and Professor of Public Engagement University of Sheffield), Pear Urishima (Apple), Ghislaine Boddington from body>data>space and Derek Richards from Hi8us South."]}, {"page": "Shinkansen (collective)", "response": ["shinkansen was a partnership between Ghislaine Boddington and Debbi Lander who co-owned the company from 1991 - 2004. After shinkansen produced the landmark turntable piece, Vinyl Requiem (1993) it became a revenue funded organisation of Arts Council England. In 1994 shinkansen left East London and moved to Bloomsbury in the West End. The multimodal poet, performance writer, and professor at Miami University in Oxford, Ohio, cris cheek is one of the co-founders."]}]}}