{"wiki_id": "http://www.wikidata.org/entity/Q42304542", "itemLabel": "Nigel Richardson", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Richardson", "wikipedia_page": {"main": "Nigel John Richardson (born February 1958) is a British human rights lawyer who serves as a deputy district judge. He was appointed to that office in May 2009. As a lawyer, Richardson is known for representing victims of human rights abuses in high-profile criminal cases with international element.", "link_mentions": [{"page": "Manchester Book Award", "response": ["**The Rope Ladder by Nigel Richardson"]}, {"page": "Brighton in fiction", "response": ["* Nigel Richardson"]}, {"page": "List of Anguillan records in athletics", "response": ["|Nigel Richardson"]}, {"page": "Hodge Jones & Allen", "response": ["* HJA's partner Nigel Richardson acted for Michael Peacock in a landmark obscenity trial that set a test of the Obscene Publications Act 1959."]}, {"page": "R v Peacock", "response": ["Peacock's defence was conducted by the law firm Hodge Jones & Allen. His defence solicitor Nigel Richardson described his client as being a well-known member of the London gay community, and remarked that \"The whole idea of something being depraved or corrupt is outdated.\" Another of the advocates for the defence, Myles Jackman, tweeted throughout the trial, using the hashtag of #obscenitytrial, and through Twitter helped to build up an online support base for Peacock. Jackman recognised it as having important implications for UK law, noting that the verdict would \"ultimately clarify the law on the representation\" of specialist sexual acts such as BDSM and urolagnia. During the trial, the defence called for expert evidence from academics studying sex and the media.", "After four days, the trial came to an end on 6 January 2012. In summing up the case, the Recorder James Dingemans QC stated that the jury must decide whether the pornography did breach the Act, and noted that \"in a civilised society, lines must be drawn\". It subsequently took the jury two hours to come to a verdict of \"not guilty\",  deciding that the scenes depicted in the DVDs were unable to deprave or corrupt any viewer watching them. Nigel Richardson later told the press that the jury had recognised that the pornography found in the DVDs would only be seen by \"gay men specifically asking for this type of material\" and not by the general public."]}]}}