{"wiki_id": "http://www.wikidata.org/entity/Q4231614", "itemLabel": "Sally Jewell", "itemDescription": "US politician (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sally_Jewell", "wikipedia_page": {"main": "Sarah Margaret \"Sally\" Roffey Jewell (born February 21, 1956) is a British-American businessperson who served as the 51st United States secretary of the interior in the administration of President Barack Obama from 2013 to 2017.\nJewell was born in London and moved to the United States at age three. She grew up in the State of Washington and attended the University of Washington. After college, Jewell briefly worked as an oil engineer before transitioning to the banking industry. A position on the board of Recreational Equipment, Inc. (REI), a Seattle-based retailer of outdoor gear, in 1996, eventually led to her becoming the company's chief operating officer, from 2000 to 2005, and then chief executive officer from 2005 to 2013.\nJewell is a lifelong outdoors enthusiast and while at REI became known for her involvement in conservation and environmental protection. These efforts brought her to the attention of the Obama administration, and she was nominated as Secretary of the Interior to succeed Ken Salazar in 2013. Her nomination received substantial bipartisan support and she was handily confirmed by the Senate in April 2013. Jewell is the second woman to hold the position of Secretary of the Interior, after Gale Norton.\n\n", "link_mentions": [{"page": "University of Washington", "response": ["Sally_Jewell_official_portrait.jpg|Sally Jewell, 51st United States Secretary of the Interior and former CEO of REI"]}, {"page": "United States Secretary of the Interior", "response": ["|Sally Jewell", "|Sally Jewell"]}, {"page": "King Cove, Alaska", "response": ["A partially completed road between King Cove and Cold Bay is awaiting approval through the USDOI. This road would pass through the Izembek Wilderness, causing irreparable damage to the preserve per governmental assessments according to a report generated by The Wilderness Society .  The previous negative decision by former USDOI director Sally Jewell is being reconsidered to include a land swap.  Proponents of the road state it would help local citizens in need of medical evacuation when airplanes can not land or take off from the local airport due to darkness or weather conditions. Opponents contend the road's main purpose is, as it always has been, to provide a link between King Cove and a nearby airport for commercial reasons. No evidence has been put forward to support a road would be safer in difficult weather condition than air transport. On 22 January 2018, Interior Secretary Ryan Zinke signed a land swap agreement to allow construction of the road, but it was blocked in federal court in March 2019."]}, {"page": "Renton, Washington", "response": ["* Sally Jewell, 51st United States Secretary of the Interior and former CEO of REI, grew up in Renton and graduated from Renton High School"]}, {"page": "Washington Monument", "response": ["The National Park Service reopened the Washington Monument to visitors on May 12, 2014, eight days ahead of schedule. Repairs to the monument cost $15 million, with taxpayers funding $7.5 million of the cost and David Rubenstein funding the other $7.5 million. At the reopening Interior Secretary Sally Jewell, Today show weatherman Al Roker, and American Idol Season 12 winner Candice Glover were present."]}, {"page": "Denali", "response": ["On August 30, 2015, just ahead of a presidential visit to Alaska, the Barack Obama administration announced the name Denali would be restored in line with the Alaska Geographic Board's designation. U.S. Secretary of the Interior Sally Jewell issued the order changing the name to Denali on August 28, 2015, effective immediately. Jewell said the change had been \"a long time coming\". The renaming of the mountain received praise from Alaska's senior U.S. senator, Lisa Murkowski,Matthew Smith – \"Murkowski thanks Obama for restoring Denali\", (video) Alaska Public Radio, KNOM, Nome, August 31, 2015. Retrieved 2015-09-01 who had previously introduced legislation to accomplish the name change,Michael A. Memoli – \"Mt. McKinley, America's Tallest Peak, is Getting Back its Original Name: Denali\", Los Angeles Times, August 30, 2015. Retrieved 2015-09-1 but it drew criticism from several politicians from President McKinley's home state of Ohio, such as Governor John Kasich, U.S. Senator Rob Portman, U.S. House Speaker John Boehner, and Representative Bob Gibbs, who described Obama's action as \"constitutional overreach\" because he said an act of Congress was required to rename the mountain. The Alaska Dispatch News reported that the Secretary of the Interior has authority under federal law to change geographic names when the Board of Geographic Names does not act on a naming request within a \"reasonable\" period of time. Jewell told the Alaska Dispatch News that \"I think any of us would think that 40 years is an unreasonable amount of time.\""]}, {"page": "Denali National Park and Preserve", "response": ["The name of Mount McKinley National Park was subject to local criticism from the beginning of the park. The word Denali means \"the high one\" in the native Athabaskan language and refers to the mountain itself. The mountain was named after newly elected US president William McKinley in 1897 by local prospector William A. Dickey. The United States government formally adopted the name Mount McKinley after President Wilson signed the bill creating Mount McKinley National Park into effect in 1917.Sheldon, Charles (1931). A History of The Boone and Crockett Club. Boone and Crockett Club. pp. 54–59. In 1980, Mount McKinley National Park was combined with Denali National Monument, and the Alaska National Interest Lands Conservation Act named the combined unit the Denali National Park and Preserve. At that time the Alaska state Board of Geographic Names changed the name of the mountain to Denali. However, the U.S. Board on Geographic Names did not recognize the change and continued to denote the official name as Mount McKinley. This situation lasted until Aug. 30, 2015, when President Barack Obama directed Secretary of the Interior Sally Jewell to rename the mountain to Denali, using statutory authority to act on requests when the Board of Geographic Names does not do so in a \"reasonable\" time period.McKinley no more: North America's tallest peak to be renamed Denali. Martinson, Erica. Alaska Dispatch News, 30 August 2015"]}, {"page": "Marjory Stoneman Douglas", "response": ["On April 22, 2015, while giving an Earth Day speech in the Everglades, President Barack Obama announced that Interior Secretary Sally Jewell had designated the house a National Historic Landmark.Slayton, April (April 22, 2015). \"Marjory Stoneman Douglas House Named a National Historic Landmark\" (Press release). U.S. Department of the Interior, Washington, D.C. Retrieved on April 30, 2015."]}, {"page": "Valles Caldera", "response": ["Environmentalists had lobbied for the more inclusive protections of national park status instead of the Trust model, but then-Senator Pete Domenici (R) insisted on the experimental approach as a condition for his support for public purchase. Beginning in 2010, US Senator Jeff Bingaman (D) introduced legislation that would transfer the property to the National Park Service as a national preserve. The 2011 bill was supported by the VCNP trustees and a majority of New Mexico's Congressional delegation. On December 19, 2014, President Barack Obama signed the 2015 National Defense Authorization Act, which transferred administrative jurisdiction of the preserve from the Valles Caldera Trust to the National Park Service. After a brief transition period, the National Park Service assumed day-to-day management on October 1, 2015. On October 10, the preserve held an official dedication with dignitaries including U.S. Secretary of the Interior Sally Jewell, U.S. Senator Tom Udall, U.S. Senator Martin Heinrich, former-U.S. Senator Jeff Bingaman, National Park Service Intermountain Region Director Sue Masica, and the first National Park Service Superintendent of Valles Caldera National Preserve, Jorge Silva-Bañuelos."]}, {"page": "The Nature Conservancy", "response": ["After service as The Nature Conservancy's president for one year, Brian McPeek, resigned on May 31, 2019, after a report on an internal investigation of sexual harassment was revealed by Politico and two other senior executives were ultimately dismissed based on its findings. On June 7, 2019, Mark Tercek, CEO since 2008, announced his resignation following the resignation of McPeek. On June 10, Luis Solorzano, executive director of The Nature Conservancy's Florida-based Caribbean chapter, became the fifth senior official to depart the organization. On June 11, The Nature Conservancy's board chairman Thomas J. Tierney announced that board member and former US Secretary of the Interior Sally Jewell would serve as interim CEO, effective September 2019."]}, {"page": "REI", "response": ["Sally Jewell joined the board of REI in 1996 and in 2000 was named chief operating officer. She became CEO in 2005. Jewell remained CEO of REI until she was named United States Secretary of the Interior in April 2013."]}]}}