{"wiki_id": "http://www.wikidata.org/entity/Q42375610", "itemLabel": "Bryan Wade", "itemDescription": "association football player (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryan_Wade", "wikipedia_page": {"main": "Bryan Wade (born 25 June 1963)  is an ex-English professional footballer who played as a centre forward for Swindon Town, Swansea City and Brighton & Hove Albion.During the 1988-89 English football season  Wade received a three match ban for violent conduct as a result of elbowing Sheffield United's Chris Wilder in the face.", "link_mentions": [{"page": "Chris Wilder", "response": ["He moved on to Sheffield United in August 1986. In December 1987, defender Wilder was sent off for a crude tackle on Milwall's Jimmy Carter in a season which saw the Sheffield club relegated to the third division.Millwall advance their Christmas goal rush, The Times, 29 December 1987 The following season Wilder was on the receiving end, being elbowed in the face. Swansea's Bryan Wade received a three match ban for violent conduct as a result.Taylor, Louise. Clubs face fines for sending weakened sides to tournament, The Time, 13 December 1988 Wilder was a regular in the team that finished second and therefore clinched promotion back to the second division at the first attempt in the 1988–89 season, and was also part of the squad that gained a further promotion the season after, this time back to the first division, after an absence of fourteen years. Wilder was a regular during the following season back in the first division, but thereafter found appearances harder to come by, hence Wilder left for nearby Rotherham United in 1992, staying for a further four years and amassing his largest number of games and goals for one club."]}, {"page": "Wade (surname)", "response": ["*Bryan Wade (born 1963), English footballer"]}, {"page": "Mike Huddleston", "response": ["*Wireless: \"Rubicon\" (script and art, with Mike Hoogterp and Bryan Wade, one-shot, Spoon Ink, 1994)"]}]}}