{"wiki_id": "http://www.wikidata.org/entity/Q4241259", "itemLabel": "John Christie", "itemDescription": "British opera manager", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Christie_(opera_manager)", "wikipedia_page": {"main": "John Christie  (14 December 1882 – 4 July 1962) was an English landowner and theatrical producer. He was the founder of the Glyndebourne Opera House and the Glyndebourne Festival Opera at his home at Glyndebourne, near Lewes in Sussex in 1934.\nBorn to a wealthy landed family in Eggesford, Devon, Christie was educated at Eton College and Trinity College, Cambridge, later spending seven years at Eton as a master. His grandfather was William Langham Christie. He served in the trenches in the First World War with the King's Royal Rifle Corps, despite partial blindness, was awarded the Military Cross, and reached the rank of Captain. Having been given the Glyndebourne Estate for his own use he began to develop local enterprises there from 1920 onwards: in 1923, he acquired the famous organbuilding company of William Hill & Son & Norman & Beard Ltd., which had come into being around 1916 with the progressive merging of its two constituent firms. The firm remained in Christie ownership until its demise in the 1990s.\nIn 1931 he married the Canadian soprano Audrey Mildmay, and together they planned to build an opera theatre as an annex to the main house. This was completed in 1934 and the first season, which featured Mozart's Le nozze di Figaro and Cosi fan tutte, conducted by Fritz Busch, was an immediate success.\nIn succeeding years Christie continued to finance the Glyndebourne Festival Opera himself but after World War II, during which the opera season was suspended, the costs became harder to bear. Eventually however he succeeded in getting commercial sponsorship, placing the Festival on a sound footing and enabling him to aspire to the highest artistic standards.In 1954 John Christie was made a Companion of Honour for his achievement at Glyndebourne.\nHe died at Glyndebourne in 1962.  After Christie's death, the festival was taken over by his son, Sir George Christie, and subsequently by his grandson Gus Christie.  Like his father, Sir George was also made a Companion of Honour for his work at Glyndebourne. John's founding of Glyndebourne is the subject of the 2015 biographical play The Moderate Soprano by David Hare.", "link_mentions": [{"page": "Benjamin Britten", "response": ["Britten's next opera, The Rape of Lucretia, was presented at the first post-war Glyndebourne Festival in 1946. It was then taken on tour to provincial cities under the banner of the \"Glyndebourne English Opera Company\", an uneasy alliance of Britten and his associates with John Christie, the autocratic proprietor of Glyndebourne.Hope-Wallace, Philip. \"Opera at Glyndebourne\", The Manchester Guardian, 15 July 1946, p. 3; and  The tour lost money heavily, and Christie announced that he would underwrite no more tours. Britten and his associates set up the English Opera Group; the librettist Eric Crozier and the designer John Piper joined Britten as artistic directors. The group's express purpose was to produce and commission new English operas and other works, presenting them throughout the country.Wood, Anne. \"English Opera Group\", The Times, 12 July 1947, p. 5 Britten wrote the comic opera Albert Herring for the group in 1947; while on tour in the new work Pears came up with the idea of mounting a festival in the small Suffolk seaside town of Aldeburgh, where Britten had moved from Snape earlier in the year, and which became his principal place of residence for the rest of his life.; and "]}, {"page": "Peter Pears", "response": ["Britten's next opera, The Rape of Lucretia, was presented at the first post-war Glyndebourne Festival, in 1946. It was a chamber piece for eight singers and an orchestra of twelve players. Pears and Cross were the Male and Female Chorus, with Kathleen Ferrier as Lucretia.  After the festival, the work was taken on tour to provincial cities under the banner of the \"Glyndebourne English Opera Company\", an uneasy alliance of Britten and his associates with John Christie, the autocratic proprietor of Glyndebourne.Hope-Wallace, Philip. \"Opera at Glyndebourne\", The Manchester Guardian, 15 July 1946, p. 3; and Carpenter, pp. 242–243 The tour lost money heavily, and Christie announced that he would underwrite no more tours.Carpenter, p. 243 Britten and his associates set up the English Opera Group; the librettist Eric Crozier and the designer John Piper joined Britten as artistic directors. The group's express purpose was to produce and commission new English operas and other works, presenting them throughout the country.Wood, Anne. \"English Opera Group\", The Times, 12 July 1947, p. 5 Britten wrote the comic opera Albert Herring for the group in 1947. Pears played the title role – one of his fairly rare excursions into comedy. Reviews of the opera were mixed, but Pears's performance as Albert, the mother's boy who kicks over the traces, received consistently good notices.\"Albert Herring\", The Times, 21 June 1947, p. 6; \"Maupassant Reversed\", The Observer, 22 June 1947, p. 2; \"A New Britten Opera\", The Manchester Guardian, 23 June 1947, p. 3; and \"At Covent Garden\", The Observer, 12 October 1947, p. 2"]}, {"page": "Thomas Beecham", "response": ["By the early 1930s, Beecham had secured substantial control of the Covent Garden opera seasons.Jefferson, p. 171 Wishing to concentrate on music-making rather than management, he assumed the role of artistic director, and Geoffrey Toye was recruited as managing director. In 1933, Tristan und Isolde with Frida Leider and Lauritz Melchior was a success, and the season continued with the Ring cycle and nine other operas.Jefferson, p. 170 The 1934 season featured Conchita Supervía in La Cenerentola, and Lotte Lehmann and Alexander Kipnis in the Ring.Jefferson, p. 173 Clemens Krauss conducted the British première of Strauss's Arabella. During 1933 and 1934, Beecham repelled attempts by John Christie to form a link between Christie's new Glyndebourne Festival and the Royal Opera House.Jefferson, p. 172 Beecham and Toye fell out over the latter's insistence on bringing in a popular film star, Grace Moore, to sing Mimi in La bohème. The production was a box-office success, but an artistic failure.Jefferson, p. 175 Beecham manoeuvred Toye out of the managing directorship in what their fellow conductor Sir Adrian Boult described as an \"absolutely beastly\" manner.Kennedy (1989), p. 174"]}, {"page": "Worshipful Company of Musicians", "response": ["The Company no longer has the power to regulate music within the City. It supports musicians and musical education, awarding prizes, scholarships and medals, among which are the Collard Fellowship, the Cobbett Prize for chamber music, the Santley medal for singers. and more than thirty other annual awards in honour of, among others, Harriet Cohen, Harry Mortimer, John Christie, and Priaulx Rainier.Grants and Awards, Worshipful Company of Musicians, accessed 3 September 2010 Its Yeomen Programmehttps://www.wcom.org.uk/yeomen/  is a young artists’ scheme for musicians who have won one of its awards."]}, {"page": "Edinburgh International Festival", "response": ["The idea of a Festival with a remit to \"provide a platform for the flowering of the human spirit\" and enrich the cultural life of Scotland, Britain and Europe took form in the wake of the Second World War. The idea of creating an international festival within the UK was first conceived by Rudolf Bing, the General Manager of Glyndebourne Opera Festival, the arts patron Lady Rosebery, theatre director Sir Tyrone Guthrie, and Audrey Mildmay (wife of John Christie) during a wartime tour of a small-scale Glyndebourne production of The Beggar's Opera.Fifield, Christopher. Ibbs and Tillett: The Rise and Fall of a Musical Empire. Ashgate, 2005: p. 263"]}, {"page": "John Christie", "response": ["John Christie may refer to:", "* John Christie (footballer, born 1881) (1881–1934), Scottish footballer", "* John Christie (footballer, born 1929) (1929–2014), Scottish football goalkeeper who played for Southampton", "* John Christie (artist) (born 1945), British artist and film-maker", "* John Christie (headmaster) (1899–1980), headmaster of Repton School and Westminster School, Principal of Jesus College, Oxford", "* John Christie (industrialist) (1774–1858), industrialist born in Scotland", "* John Christie (landowner) (1824–1902), Scottish industrialist, arboriculturalist and landowner", "* John Christie (mayor) (1883–1953), Scottish-born South African politician", "* John Christie (minister) (born 1947), Moderator of the General Assembly of the Church of Scotland for 2010–2011", "* John Christie (opera manager) (1882–1962), opera festival founder", "* John Christie (serial killer) (1899–1953), British serial killer"]}, {"page": "Albert Herring", "response": ["The opera premiered on 20 June 1947 at Glyndebourne, conducted by the composer. According to one writer, the owner and founder of Glyndebourne, John Christie, \"disliked it intensely and is said to have greeted members of the first night audience with the words: 'This isn't our kind of thing, you know'.\"Kennedy, Michael, \"Benjamin Britten\", in Holden, p. 124 Some 38 years later Glyndebourne's 1985 production was \"one of the most successful the opera has had\"."]}, {"page": "Glyndebourne Festival Opera", "response": ["Under the supervision of the Christie family, the festival has been held annually since 1934, except in 1941–45 during World War II and 1993 when the theatre was being rebuilt, for a 1994 reopening. Gus Christie, son of Sir George Christie and grandson of festival founder John Christie, became festival chairman in 2000."]}, {"page": "John Christie (producer)", "response": ["#REDIRECT John Christie (opera manager)"]}, {"page": "Fritz Busch", "response": ["In the early 1930s an English landowner, John Christie, and his wife, the singer Audrey Mildmay, conceived the idea of staging country house opera in a purpose-built opera house on the Christie estate at Glyndebourne in Sussex. In November 1933 Christie sounded Busch out about becoming his musical director; Busch was by then contractually committed in Buenos Aires, but a financial crisis in Argentina shortly afterwards enabled him to reconsider Christie's invitation. As at Salzburg, he arranged for Ebert to join him to direct productions."]}, {"page": "Danielle de Niese", "response": ["De Niese (called Danni by her friends and colleagues) married Gus Christie, grandson of John Christie and chairman of Glyndebourne Festival Opera, on 19 December 2009 in St Bartholomew-the-Great, London. Since her marriage she has lived at Glyndebourne in Sussex, England. The couple have two children.\"Gus Christie and Danielle de Niese announce the birth of their daughter\", glyndebourne.com, November 2020"]}, {"page": "Wilfrid Jasper Walter Blunt", "response": ["* John Christie of Glyndebourne (1968)"]}, {"page": "Anna Steiger", "response": ["She trained with Noelle Barker at the Guildhall School of Music in London from 1977 to 1983 and then with Vera Rózsa at the National Opera Studio from 1985 to 1986. She won the Sir Peter Pears Award in 1982, the Richard Tauber Prize in 1984, and the John Christie Award in 1985."]}, {"page": "Carl Ebert", "response": ["Together with John Christie and the conductor Fritz Busch, Ebert created the Glyndebourne Festival Opera in 1934. Ebert remained its artistic director until 1959, though productions were suspended during the Second World War. In the 1930s and 1940s Ebert helped establish a national conservatory in Turkey, where he and his family lived from 1940 to 1947.\t", "In 1934 Busch accepted an invitation to take charge of the inaugural season of the Glyndebourne Festival Opera in a purpose-built opera house in the grounds of John Christie's country house in south east England. At Busch's suggestion Christie engaged Ebert as director.Kennedy, p. 19 With Christie's backing, they revolutionised the staging of opera in Britain. The Times later said of Ebert:"]}, {"page": "Boyd Neel", "response": ["On 16 February 1934 the orchestra performed a concert of chamber works by Ernest Bloch at the Aeolian Hall, conducted by the composer.Ernest Bloch Legacy Project Neel conducted the first music heard in the new Glyndebourne opera house in 1934, in private performances, at John Christie's invitation.  Among the Boyd Neel Orchestra's early releases in 1936 were the first recordings of Vaughan Williams's Fantasia on a Theme by Thomas Tallis and Britten's Simple Symphony.Stuart, Philip. Decca Classical, 1929–2009, AHRC Research Centre for the History and Analysis of Recorded Music. Retrieved 11 October 2021 The following year, Neel and his orchestra were invited to the Salzburg Festival, for which Neel commissioned Britten's Variations on a Theme of Frank Bridge. In 1939 Boyd Neel commissioned John Ireland's three movement Concertino Pastorale for string orchestra, first played at the Canterbury Festival on 14 June 1939. It was subsequently recorded in February 1940.The John Ireland Companion, ed. Lewis Foreman, 2011 The orchestra toured Great Britain and Europe until the outbreak of war.Stone, David. \"Boyd Neel\" at Who Was Who in the D'Oyly Carte Opera Company (2001)\"Boyd Neel's Twentieth\". "]}, {"page": "List of members of the Order of the Companions of Honour", "response": ["|1 January 1954||75px||John Christie||1882–1962||Founder of Glyndebourne Festival Opera"]}, {"page": "Anthony Rolfe Johnson", "response": ["He first appeared in opera in the chorus and in small roles at the Glyndebourne Festival between 1972 and 1976. His major operatic debut was in the role of Count Vaudémont in Tchaikovsky's opera Iolanta in 1973 with the English Opera Group. The same year, he held his first professional recital at the Purcell Room at the Southbank Centre. In 1975, Rolfe Johnson made his Glyndebourne debut, singing the role of Lensky in Eugene Onegin, for which he won the John Christie Award. In 1978 he made his first appearance with English National Opera, as Tamino in The Magic Flute."]}, {"page": "St John-Mildmay baronets", "response": ["Several other members of the family have also gained distinction. Hervey George St John-Mildmay (1817–1882), son of Paulet St John-Mildmay (1791–1845), second son of the third Baronet, was a captain in the Royal Navy. George William St John-Mildmay (1792–1851), third son of the third Baronet, was a captain in the Royal Navy. John Francis St John-Mildmay (1795–1823), fourth son of the third Baronet, was a captain in the Royal Navy. Humphrey St John-Mildmay, sixth son of the third Baronet, was Member of Parliament for Southampton. His son Humphrey St John-Mildmay was Member of Parliament for Herefordshire. Francis Mildmay, son of Henry Bingham Mildmay, another son of Humphrey St John-Mildmay, sixth son of the third Baronet, was elevated to the peerage as Baron Mildmay of Flete in 1922 (see this title for further information on this branch of the family). The Venerable Carew Antony St John-Mildmay (1800–1878), seventh son of the third Baronet, was Archdeacon of Essex. Grace Audrey Laura St John-Mildmay, wife of the opera manager John Christie, was daughter of the tenth baronet."]}, {"page": "Christopher Ventris", "response": ["After college he joined Glyndebourne Festival Opera winning the GTO Singers and John Christie awards. He went on to sing with other British companies, including Opera North  and English National Opera. He sang the part of Robert Lonle in the first performance of Robert Saxton's Caritas and the combined role of Walter, Hugo and the old woman in the first performance of Judith Weir's opera Blond Eckbert. He was the 2007 recipient of the Maria Callas Debut Artist of the Year Award, presented annually by Dallas Opera to the singer who makes the biggest impact on voting patrons in his or her company debut.Matthew Westphal, Tenor Christopher Ventris Wins 2007 Maria Callas Award from Dallas Opera, Playbill Arts, 25 May 2007"]}, {"page": "On Such a Night (1955 film)", "response": ["An American tourist (David Knight) has been persuaded by to visit Alfriston but is bemused by what he witnesses at Victoria Station when people in evening dress join his train. After a confusing journey in a compartment with two men talking about a new countess, he alights at Lewes and is more baffled still when the formally dressed people get on a Southdown bus waiting there. He gets in a taxi and asks the driver to follow the bus. Arriving at the entrance of Glyndebourne, he explains to an upper-class lady (Marie Lohr) he had noticed at Victoria Station who is with her niece (Josephine Griffin) that he does not have a ticket, at which they ask John Christie who sees that he gets one."]}, {"page": "John Christie (Glyndebourne)", "response": ["#REDIRECT John Christie (opera manager)"]}, {"page": "List of places of worship in Lewes District", "response": ["|Norman-era fragments remain in this large church, rebuilt in the 15th century and further altered in 1884 by Ewan Christian.  John Christie, founder of the nearby Glyndebourne Opera House, donated the organ."]}, {"page": "Saint John the Evangelist (Domenichino)", "response": ["It was then auctioned at Christie's again in 1899 on the death of Cecil Miles, 3rd Baronet who was Philip John Miles's great-grandson – this time it was bought in at 100 guineas and subsequently sold for 70 guineas to M. Colnaghi, acting as agent for Augustus Langham Christie of Tapeley Park, Devonshire and Glyndebourne, East Sussex, part of the Christie family. The painting passed down through that family (later headed by John Christie and known for their connection to the Glyndebourne Festival Opera) for more than a century until it was auctioned in London in December 2009 to an American buyer for £9.2 million. However, it was then the object of an export bar to keep it in the United Kingdom due to its history of ownership in the country. British galleries were unable to raise enough money to buy it (the National Gallery and National Galleries of Scotland already being committed to an expensive deal to buy Diana and Actaeon and Diana and Callisto, both by Titian), but another anonymous collector was allowed to acquire it on the condition that it be displayed to the public for three months each year. He then loaned it to the National Gallery in London from May 2010 to August 2011, where it had previously been displayed from 1992 to 1994.Glyndebourne family to sell Old Master for £10 million, London Evening Standard, 9 Sept 2009'Saved' Domenichino painting loaned to National Gallery, Guardian, 18 May 2010"]}, {"page": "Tapeley", "response": ["The present mansion house known as Tapeley Park is a grade II* listedListed building text, Tapeley Park country house, built or enlarged from an existing structure in about 1704, remodeled in the 19th century and again in the early 20th century when pilasters, portico, pediment and parapet were added to create a Queen Anne style building. In the mid 19th century the estate was inherited from the Clevland family by William Langham Christie of Glyndebourne in Sussex. His grandson was John Christie (born 1882), the founder of Glyndebourne Opera Festival, who bequeathed Tapeley to his daughter Rosamund Christie (1933–1988), who passed it onto her nephew Hector Christie (born 1963), who briefly turned it into a hippie commune. In 2011, Tapeley Park was the subject of an episode of the Channel 4 television programme Country House Rescue, presented by the hotelier Ruth Watson, who advised on restoring the estate to a sound financial position.", "*John Christie (born 1882), born at Eggesford. He was assistant head master of Eton College and fought in World War I winning the Military Cross.Burke's, p.407, He married the opera singer Grace Audrey Louisa St John-Mildmay, daughter of Rev. Aubrey Neville St John-Mildmay, and opened an opera house at Glyndebourne, thus founding the Glyndebourne Opera Festival. During World War II Tapeley was used as a home for children evacuated from Plymouth. It later served as a home for the Invalid Children's Aid Association, then as a hotel. John's eldest son and heir to Glyndebourne was Sir George Christie (born 1934) but he bequeathed Tapeley to his daughter Rosamund Christie.", "*Rosamund Christie (1933–1988), daughter of John Christie."]}, {"page": "William Hill & Son & Norman & Beard Ltd.", "response": ["They were founded in 1916 by the merger of Norman and Beard and William Hill & Sons of London, Dr Arthur George Hill having no male heirs to sustain his business, moving its production to the capital in 1916. Retrieved 6 October 2011 The merged company was bought by John Christie in 1923, and remained in the Christie family until the business was wound up in 1998.", "During the era of silent films, the company produced theatre pipe organs between 1926 and 1938. These instruments were produced under the brand name Christie, from the name of John Christie, the owner of the business. Retrieved 27 October 2015 The components were produced in one the company's various factories (Brighton, Norwich, London etc.) and assembled, together with other specialist items such as percussions and consoles, at their King's Cross factory."]}, {"page": "Music of Sussex", "response": ["Glyndebourne Festival Opera was founded in 1934 by John Christie and his wife, the soprano Audrey Mildmay in 1934 at Glyndebourne, one of the world's best known opera houses, and Britain's only unsubsidised opera house. The county is also home to professional orchestras the Brighton Philharmonic Orchestra and the Worthing Symphony Orchestra. Established in 2010, Worthing is the home of the Sussex International Piano Competition."]}, {"page": "Audrey Mildmay", "response": ["Grace Audrey Laura St John-Mildmay (19 December 1900 – 31 May 1953) was an English and Canadian soprano and co-founder, with her husband, John Christie, of Glyndebourne Festival Opera. The Canadian Encyclopedia describes her voice \"as a light lyric soprano employed with much charm.\"", "Mildmay's teacher Johnstone Douglas suggested to John Christie that she sing the part of Blonde in an amateur production of Act I of Mozart's Die Entführung aus dem Serail in December 1930. Christie was a music lover who modified his house at Glyndebourne to be able to host concerts for his family and friends. Mildmay was paid £5 for her appearance in a hilarious performance, full of comic mishaps. The 48-year-old bachelor Christie was immediately smitten by the much younger Mildmay's charm and vivacity, and during a tour of the house, he impulsively showed her the room that he said they would share after their marriage. He showered her with gifts after her departure, including hampers from Fortnum & Mason because he felt she was too thin. Mildmay was unsure, asking for time to decide and begging Christie not to fall in love with her."]}, {"page": "George Christie (opera manager)", "response": ["Sir George William Langham Christie  (31 December 1934 – 7 May 2014) was a British opera administrator, long affiliated with Glyndebourne Opera.  He was the son of John Christie and Audrey Mildmay."]}, {"page": "1954 New Year Honours", "response": ["*John Christie, MC. For services to Opera."]}, {"page": "The Moderate Soprano", "response": ["The Moderate Soprano is a 2015 play by the British playwright David Hare. It is a historical play dealing with John Christie, his founding of Glyndebourne Opera and his romance and marriage with Audrey Mildmay, the eponymous soprano.", "*Roger Allam - John Christie"]}, {"page": "Luise Helletsgruber", "response": ["Her major contribution to music history was her participation in the first five seasons of the Glyndebourne Festival Opera in southern England, which was founded in 1934 by John Christie and his wife, the singer Audrey Mildmay, the conductor Fritz Busch and the director Carl Ebert. There she was a member of a renowned international ensemble and played leading roles in four Mozart operas. Three of them, the three Da Ponte's operas, were recorded and have been available ever since. They were praised by critics as outstanding and excellent.Musica: Monatsschrift für alle Gebiete des Musiklebens, Volume 18, Marcus Felsner: Operatica: Approaches to the World of Opera, Königshausen & Neumann 2008, .Operatica : Annäherungen an die Welt der Oper on WorldCat In 1934 Helletsgruber made her debut in Glyndebourne as Dorabella and Cherubino, in 1935 she also sang the First Lady in The Magic Flute. In 1936 she sang Donna Elvira for the first time and continued to sing Cherubino and the First Lady. Even after the Annexation of Austria in March 1938 she continued to participate in the English festival."]}, {"page": "Glyndebourne Festival Opera: A Gala Evening", "response": ["The Glyndebourne Festival Opera was founded in 1934 by the English landowner John Christie (1882-1964) and his wife, the English and Canadian soprano Audrey Mildmay (1900-1953). The Christies mounted their productions in a theatre specially built for the purpose in the grounds of their manor house near Lewes in East Sussex. After John Christie's death, the management of the Festival was taken over by his son George Christie (1934-2013). George Christie demolished Glyndebourne's original theatre in 1992 in order to replace it with something larger and better equipped. The final performance in the old auditorium was a fund-raising gala presented at 8:30 p.m. on 24 July 1992 in the presence of His Royal Highness Charles, Prince of Wales. The event was sponsored by N M Rothschild & Sons,  Banque and The Private Bank and Trust Company Limited, with additional support from British American Tobacco plc. In acknowledgement of the Festival's history, the gala began and ended with excerpts from the opera which had been the first work performed in the Festival's original house, Mozart's Le nozze di Figaro. This was also the opera that was performed on the opening night of the new theatre in 1994."]}, {"page": "Frederick Bentham", "response": ["In 1932, Bentham joined Strand Electric and Engineering Company to manage both their demonstration theatre and their showroom. Strand Lighting was the leading brand in the British theatres and Bentham would go onto make his mark. It was in 1932 that he developed the first Light Console prototype, probably the first remote control for theatre lighting to be run one person, based on a Compton organ. He wrote about his idea in his article Light as an Art in The Builder.  Previous to the Light Console, a complex mechanical device was used and the operators were unable to see the stage. The console used the Mansell clutch, which allowed remote control of dimmers from an electro-mechanically driven shaft. The Light Console could be located where a single operator could actually see what was being lit. His first prototype was used by Bentham to perform a colour light show at the Ideal Home Exhibition in 1932. He would continue to give demonstrations of what he called Colour Music. Bentham's early work included working as consultant, which in 1933 he worked at The Questors Theatre, in Ealing and John Christie at Glyndebourne."]}]}}