{"wiki_id": "http://www.wikidata.org/entity/Q42535394", "itemLabel": "Alan Williams", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Williams_(actor)", "wikipedia_page": {"main": "Alan Williams is a British actor and playwright, who has performed in film, television and theatre in both the United Kingdom and Canada.", "link_mentions": [{"page": "Film genre", "response": ["Alan Williams distinguishes three main genre categories: narrative, avant-garde, and documentary.Alan Williams, \"Is a Radical Genre Criticism Possible?\" Quarterly Review of Film Studies 9, no. 2 (Spring 1984): 121-2"]}, {"page": "2002 in film", "response": ["| All or Nothing || United Artists || Mike Leigh (director/screenplay); Timothy Spall, Lesley Manville, James Corden, Alison Garland, Ruth Sheen, Marion Bailey, Paul Jesson, Sam Kelly, Kathryn Hunter, Sally Hawkins, Helen Coker, Daniel Mays, Ben Crompton, Robert Wilfort, Gary McDonald, Dorothy Atkinson, Alan Williams || Drama || Live Action"]}, {"page": "List of Canadian playwrights", "response": ["* Alan Williams"]}, {"page": "Hard Times (novel)", "response": ["Hard Times has been adapted twice for BBC Radio, first in 1998 starring John Woodvine as Gradgrind, Tom Baker as Josiah Bounderby and Anna Massey as Mrs. Sparsit, and again in 2007 starring Kenneth Cranham as Gradgrind, Philip Jackson as Bounderby, Alan Williams as Stephen, Becky Hindley as Rachael, Helen Longworth as Louisa, Richard Firth as Tom and Eleanor Bron as Mrs. Sparsit."]}, {"page": "The Virgin Queen (TV serial)", "response": ["|John Dee || Alan Williams || 1"]}, {"page": "Joseph McGrath (film director)", "response": ["In the 2004 film The Life and Death of Peter Sellers, Alan Williams plays the unnamed director of Casino Royale, whom Sellers (played by Geoffrey Rush) calls \"Joe\"."]}, {"page": "Hull Truck Theatre", "response": ["Mike Bradwell, who had gone on to be Artistic Director at the Bush Theatre (1996–2007), returned to Hull Truck in March 2012 to perform excerpts from the early Hull Truck shows in celebration the 40th anniversary of the company's formation. He was joined by fellow performers from those days – the original Truckers – John Lee, Steve Halliwell, Dave Greaves, Alan Williams, Cass Patton, Rachel Bell, Mary East, Pete Nicholson, David Ambrose, Steve Marshall and David Hatton."]}, {"page": "All or Nothing (film)", "response": ["* Alan Williams as Drunk"]}, {"page": "18th Genie Awards", "response": ["*Alan Williams, The Cockroach that Ate Cincinnati"]}, {"page": "Linda Griffiths", "response": ["In 1994 she starred alongside Alan Williams in The Darling Family, Alan Zweig's film adaptation of her own theatrical play.Geoff Pevere, \"Dangerous liaisons\". The Globe and Mail, August 27, 1994."]}, {"page": "Canadian Screen Award for Best Actor", "response": ["| Alan Williams"]}, {"page": "Always and Everyone", "response": ["* Alan Williams as Martin McMad, Patient (Series 1–2)"]}, {"page": "Life Begins (TV series)", "response": ["*Alan Williams as George"]}, {"page": "Alan Williams", "response": ["Alan Williams may refer to:", "* Alan Williams (actor), British actor", "* Alan Williams (novelist) (1935–2020), British novelist", "* Alan Williams (composer) (born 1965), American musician", "* Alan Williams (born 1948), singer with the Rubettes", "* Alan Williams (Swansea West MP) (1930–2014), British Member of Parliament for Swansea West", "* Alan Williams (Carmarthen MP) (born 1945), British Member of Parliament for Carmarthen", "* Alan Williams (Florida politician) (born 1975), American politician", "* Alan Williams (rugby union) (1893–1984), American who competed in the 1924 Summer Olympics", "* Alan Williams (Australian footballer) (1917–1988), Australian rules footballer", "* Alan Williams (footballer, born 1938) (1938–2017), English footballer", "* Alan Williams (canoeist) (born 1954), British sprint canoer", "* Alan Williams (basketball) (born 1993), American basketball player", "* Alan Williams (American football) (born 1969), American football coach", "* Alan Williams (cyclist) (born 1948), English track cyclist", "* Alan Williams (economist) (1927–2005), British health economist", "* Alan Williams (immunologist) (1945–1992), immunologist", "* Alan Williams (bishop) (born 1951), Roman Catholic Bishop of Brentwood, England"]}, {"page": "The Scold's Bridle", "response": ["*Alan Williams as Bob Spede"]}, {"page": "Grow Your Own", "response": ["Grow Your Own is a 2007 British comedy film directed by Richard Laxton, and written by Frank Cottrell Boyce and Carl Hunter. It stars Benedict Wong, John Henshaw, Eddie Marsan, Pearce Quigley, Omid Djalili, Alan Williams, Philip Jackson, and Olivia Colman. The film centres on a group of gardeners at a Merseyside allotment, who react angrily when a group of refugees are given plots at the site, but after they get to know them better, soon change their minds. The film was previously known under the title The Allotment."]}, {"page": "A Waste of Shame", "response": ["*Alan Williams – George Wilkins"]}, {"page": "List of Canadian films of 1996", "response": ["| The Cockroach that Ate Cincinnati || Michael McNamara || Alan Williams || Comedy || "]}, {"page": "List of Canadian films of 1994", "response": ["| The Darling Family || Alan Zweig || Alan Williams, Linda Griffiths || Drama ||"]}, {"page": "Starlings (TV series)", "response": ["| Alan Williams || Grandad"]}, {"page": "Father Brown (2013 TV series)", "response": ["* Harold \"Blind 'Arry\" Slow – Alan Williams (2017–present): he appeared in four episodes. 'Arry is the rag and bone man for Kembleford and also a drunk. In The Darkest Noon he mentioned that he got the name \"Blind 'Arry\" after being gassed in World War I and he also mentions he was a Sapper."]}, {"page": "Manchester Youth Theatre", "response": ["The notable alumni include Dominic Monaghan; Aiden Shaw; Steven Pinder; Kevin Kennedy; David Threlfall; Lee Oakesl David Bamber; Lesley Sharpl Phil Rose; Gillian Bevan;  Alan Williams; Karl Heaver; Shaun Gorringe; Bernard Latham"]}, {"page": "The Ritual Slaughter of Gorge Mastromas", "response": ["The Ritual Slaughter of Gorge Mastromas is a 2013 play by the British dramatist Dennis Kelly. It premiered at the Royal Court Theatre from 5 September to 19 October 2013, in a production directed by Vicky Featherstone. It featured Tom Brooke in the title role of Gorge (pronounced \"George\"pronounced George - https://www.telegraph.co.uk/culture/theatre/theatre-reviews/10301519/Ritual-Slaughter-of-Gorge-Mastromas-Royal-Court-review.html) Mastromas and a cast which included Pippa Haywood, Joshua James, Kate O'Flynn, Alan Williams, Jonathan McGuiness and Aaron Monaghan."]}, {"page": "Trespass Against Us", "response": ["* Alan Williams as Noah"]}, {"page": "SunTrap", "response": ["*Alan Williams as Donald"]}, {"page": "The Cockroach that Ate Cincinnati", "response": ["The Cockroach that Ate Cincinnati is a Canadian film, released in 1996.\"Review: ‘The Cockroach That Ate Cincinnati’\". Variety, October 14, 1996. Directed by Michael McNamara and starring Alan Williams, the film was an adaptation of Williams' Cockroach trilogy of one-man theatrical shows.\"Cockroach That Ate Cincinnati features Windsors back alleys\". Windsor Star, July 25, 1996.", "Based on a series of plays by Alan Williams, an aging hippie and rock-fanatic-turned-stand-up-comic who calls himself ‘The Captain’ (Williams), convinces a couple of novice filmmakers (Deborah Drakeford and Oliver Dennis) to help him record his ‘pure thoughts’ – a filmic testament of his experiences and observations of the past three decades. What follows is a series of wildly complex, sardonic anecdotes and theories about rock ‘n’ roll, hero-worship, hallucinations, drugs, madness, paranoia, rebellion, nuclear dread and the search for individual integrity in a world on the brink of cultural and physical destruction.", "* Alan Williams as The Captain"]}, {"page": "Peterloo (film)", "response": ["* Alan Williams as Magistrate Marriott"]}, {"page": "Chernobyl (miniseries)", "response": ["* Alan Williams as Charkov, the KGB's first deputy chairman.At the end of episodes \"Vichnaya Pamyat\", \"Open Wide, O Earth\", and \"Please Remain Calm\" he is listed as \"KGB Chairman Charkov\". However, during a conversation between Legasov and Charkov (episode 3, 46m 48s) they say:", "| Jared Harris, Stellan Skarsgård, Paul Ritter, Jessie Buckley, Adam Nagaitis, Con O'Neill, Adrian Rawlins, Sam Troughton, Robert Emms, Emily Watson, David Dencik, Mark Lewis Jones, Alan Williams, Alex Ferns, Ralph Ineson, Barry Keoghan, Fares Fares and Michael McElhatton"]}, {"page": "I Was at Home, But", "response": ["* Alan Williams as Herr Meisner"]}, {"page": "The Capture (TV series)", "response": ["* Alan Williams as Eddie Emery"]}, {"page": "The Darling Family", "response": ["The Darling Family is a Canadian drama film, directed by Alan Zweig and released in 1994.Geoff Pevere, \"Dangerous liaisons\". The Globe and Mail, August 27, 1994. Based on the theatrical play by Linda Griffiths, the film stars Griffiths and Alan Williams as a couple discussing the state of their relationship after the woman unexpectedly becomes pregnant,Brian D. Johnson, \"Man versus woman: The Darling Family directed by Alan Zweig\". Maclean's, September 5, 1994. blending both scenes in which they talk to each other with scenes in which they verbalize their interior monologues.Craig MacInnis, \"A Darling idea looking for a movie\". Toronto Star, August 26, 1994."]}, {"page": "The Long Call", "response": ["* Alan Williams as Maurice Craddle"]}, {"page": "2020 WhatsOnStage Awards", "response": ["** Alan Williams for Evita"]}]}}