{"wiki_id": "http://www.wikidata.org/entity/Q4251457", "itemLabel": "Quentin Cooper", "itemDescription": "British science journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Quentin_Cooper", "wikipedia_page": {"main": "Quentin Cooper (born 1961, Grimsby) is a science journalist and facilitator, who presented BBC Radio 4's Material World from 2000 to 2013. He speaks at science festivals and lectures, and works regularly with science and educational organisations such as the Royal Society and the British Council.", "link_mentions": [{"page": "Grimsby", "response": ["*Quentin Cooper, presenter of Radio 4's Material World and film correspondent for BBC Radio 2, grew up in the town, attending Wintringham School."]}, {"page": "Quentin", "response": ["*Quentin Cooper (born 1961) a science journalist, and broadcaster."]}, {"page": "Kaleidoscope (UK radio series)", "response": ["* Quentin Cooper"]}, {"page": "Material World (radio programme)", "response": ["Material World was a weekly science magazine programme on BBC Radio 4 broadcast on a Thursday afternoon. The programme's regular presenter was Quentin Cooper, with contributions from scientists researching areas under discussion in each programme.", "The programme began as The Material World in April 1998.  It was presented by Trevor Phillips, a chemistry graduate of Imperial College. In September 2000 Phillips was told that he could no longer work at the BBC due to his close links with the Labour Party, which broke BBC rules of impartiality. He was one of the few regular black broadcasters on Radio 4. The programme was presented by Quentin Cooper from 2000 to its end in 2013.", "On 14 June 2013 it was announced that the show was to be cancelled, to be replaced by a new show, Inside Science. The last programme presented by Quentin Cooper was broadcast on 20 June 2013 with the final episode airing a week later on 27 June 2013, presented by Gareth Mitchell."]}, {"page": "Formula Five", "response": ["Sue Nelson presented the program for most of its time on air, with Jez Nelson co-presenting the final series. Quentin Cooper was a regular contributor."]}, {"page": "Oasis Academy Wintringham", "response": ["* Quentin Cooper, Radio 4 science presenter"]}, {"page": "Cape Farewell, UK", "response": ["An expedition was made in September 2008 to Disko Bay on the west coast of Greenland, in partnership with the National Oceanography Centre, Southampton, The University of Southampton and British Geological Survey.  Scientists onboard extended their investigations into climate whilst artists, writers, and communicators kept blogs posting their response.  The crew included musicians Jarvis Cocker, Leslie Feist, Laurie Anderson, Vanessa Carlton, Robyn Hitchcock, Ryuichi Sakamoto, KT Tunstall, Martha Wainwright, Luke Bullen, and beatboxer Shlomo, comedian Marcus Brigstocke, composer Jonathan Dove, theatre makers Mojisola Adebayo, Suzan-Lori Parks, visual artists Kathy Barber, David Buckland, Sophie Calle, Jude Kelly, Michèle Noach, Tracey Rowledge, Julian Stair, Shiro Takatani, Chris Wainwright, architects Francesca Galeazzi, and Sunand Prasad, poet Lemn Sissay, photographer Nathan Gallagher, BBC presenter Quentin Cooper, Senior Lecturer (Open University), Joe Smith, activist David Noble, media executive Lori Majewski and film director Peter Gilbert.  Oceanographers included Simon Boxall, Emily Venables and geoscientists Carol Cotterill and Dave Smith."]}, {"page": "Cheltenham Science Festival", "response": ["At Cheltenham Science Festival the International Finals of Famelab consist of three international semi-finals where judges listen to the three-minute presentations from the international finalists, then ask them questions about the topic of the contestant's talk before deliberating on which scientists to select for the international final, held at the end of the festival in the 800-seater Arena. Former Material World radio presenter Quentin Cooper was compere during the final."]}, {"page": "Parkinson's Sunday Supplement", "response": ["The programme began after the 11:00am news and was introduced by Parkinson who would outline some of the features that would be on that morning's show. These would usually be a review of the Sunday papers with a guest; a round-up of the week's entertainment news in the world of film, radio, television, music and the arts, also with a guest reviewer; and after the Midday news, an interview with a media personality from the worlds of entertainment, arts, sport and music. Between these features Parkinson would play what he termed \"the very best in music\" from the jazz and big-band genres, including such artists as Frank Sinatra, Ella Fitzgerald, Sarah Vaughan and Joe Williams. After his guest interview Parkinson would often review new album releases in the jazz and big band genres, playing a selection of tracks. The show was then wrapped up before handing over to the 1:00pm news bulletin. Guests for the newspaper review included Steve Richards from the New Statesman and Michael Prescott from The Guardian. Entertainment guests included Gillian Reynolds from The Daily Telegraph and the BBC Radio 4 journalist Quentin Cooper."]}, {"page": "The Pirates! In an Adventure with Scientists!", "response": ["Quentin Cooper of the BBC analysed the change of the title and listed several theories. One of them is that the British audience is more tolerant for the eccentricity of the British animators. Another is that the film makers did not want to challenge the United States viewers who do not accept the theory of evolution. He also developed his own explanation, in which he notes that the word \"scientist\" is rarely used in the Hollywood films due to it not being \"cool\", representing \"the mad scientist or the dweeby nerd that dress funny, have no social skills, play video games, long for unattainable women\"."]}, {"page": "Honorary Fellows of the Royal Society of Chemistry", "response": ["* Dr Quentin Cooper HonFRSC"]}, {"page": "Barbara Graziosi", "response": ["She has also been consulted on her work on a number of popular radio stations and television shows, including: discussing the Iliad with poets Carol Ann Duffy and Ruth Padel (BBC Radio 3, Proms Interval Talks), assessing the discovery of the Oxyrhynchus Papyri together with a team of classicists, scientists and journalists (on BBC Channel 4 and Channel 2); arguing about the location of Ithaca with Quentin Cooper and John Underhill (Material World, BBC Radio 4), discussing her work with Bill Buschel on US Public Radio, and talking about Homer and Sappho on BBC Radio 3 (The Essay: Greek and Latin Voices)."]}, {"page": "Zoe Laughlin", "response": ["Laughlin produces and hosts the podcast \"The Things that Make Us\". She appears regularly on British radio and television, and gives invited talks on material science in Britain and around the world. She has appeared on the Today Programme and \"The Material Word\" with Quentin Cooper. In 2016, Laughlin delivered an invited talk at The Royal Institution, \"Performing Matter: Greatest Hits and New Findings\"."]}]}}