{"wiki_id": "http://www.wikidata.org/entity/Q42563357", "itemLabel": "Wuon-Gean Ho", "itemDescription": "British Chinese artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Wuon-Gean_Ho", "wikipedia_page": {"main": "Wuon-Gean Ho (Chinese: 何文津; pinyin: hé wén jīn) (born 1973, Oxford) is a British Chinese artist who specialises in printmaking and whose work has appeared in various international art exhibitions and art collections. She has taken on art residencies at a number of institutions including the Caldera Arts Center, Crow’s Shadow Institute of the Arts, Bluecoat Arts Centre and Aberystwyth School of Art. Examples of her work are displayed at both the National Art Library and the Tate Library. In 2014 she was commissioned by the Royal Mint to design their annual Lunar coin series for which she has done five years in a row.\n\n", "link_mentions": [{"page": "List of University of Cambridge people", "response": ["*Wuon-Gean Ho (unknown), contemporary artist and printmaker "]}, {"page": "Index of Singapore-related articles", "response": ["* Wuon-Gean Ho"]}, {"page": "List of English women artists", "response": ["*Wuon-Gean Ho (born 1973), printmaker"]}, {"page": "Lunar Series (British coin)", "response": ["The reverse design consists of two Yorkshire Swaledale sheep facing each other and the background consists of a forest of trees. As designer Wuon-Gean Ho explains \"the ancient Chinese character for the word sheep looks a little bit like a tree\" so the forest consists of a series of this character (羊). This character is further displayed near the coin's center. Across the top lettering reads \"YEAR OF THE SHEEP · 2015\" plus details of the mass and metal content of the coin.", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho", "|Wuon-Gean Ho"]}, {"page": "List of 21st-century women artists", "response": ["* Wuon-Gean Ho, b. 1973, British, printmaker"]}]}}