{"wiki_id": "http://www.wikidata.org/entity/Q4251160", "itemLabel": "John Carroll", "itemDescription": "Irish-born prelate of the Roman Catholic Church (1838-1897)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Carroll_(bishop_of_Shrewsbury)", "wikipedia_page": {"main": "John Carroll (16 March 1838 – 14 January 1897) was an Irish-born prelate of the Roman Catholic Church. He served as the Bishop of Shrewsbury from 1895 to 1897.Born in Castleblaney, County Monaghan on 16 March 1838, his family moved to Liverpool in England. He was educated in the Catholic Middle School, and studied for the priesthood at Ushaw and Bruges he was ordained to the priesthood on 22 December 1861. He was appointed Coadjutor Bishop of Shrewsbury and Titular Bishop of Acmonia on 22 August 1893. His consecration to the Episcopate took place on 28 October 1893, the principal consecrator was Cardinal Herbert Vaughan, Archbishop of Westminster, and the principal co-consecrators were William Gordon, Bishop of Leeds, and John Bilsborrow, Bishop of Salford. On the death of Edmund Knight, he automatically succeeded as the Bishop of Shrewsbury on 11 May 1895.He died in office at Bishop's House, Oxton, Birkenhead, Cheshire on 14 January 1897, aged 58, and was buried in Dukinfield Cemetery near Manchester.", "link_mentions": [{"page": "Roman Catholic Bishop of Shrewsbury", "response": ["| John Carroll"]}, {"page": "John Carroll", "response": ["John Carroll may refer to:", "*Sir John Carroll (astronomer) (1899–1974), British astronomer", "*John Carroll (journalist) (1942–2015), American journalist and editor", "*John Carroll (author) (born 1944), Australian conservative writer", "*John Carroll (mayor) (1836–1903), mayor of Dunedin", "*John Carroll (Ohio politician) (died 1985), member of the Ohio House of Representatives", "*John Carroll (Manitoba politician) (1921–1986), Canadian politician in Manitoba", "*John Carroll (Hawaii politician) (1929–2021), member of the Hawaii Senate and House of Representatives", "*John Carroll (trade unionist) (active 1969–1990), Irish trade unionist and senator", "*John Carroll (archbishop of Baltimore) (1735–1815), prelate of the Roman Catholic Church", "*John Carroll (bishop of Shrewsbury) (1838–1897), Irish-born prelate of the Roman Catholic Church", "*John Carroll (Australian bishop) (1865–1949), Irish-born Roman Catholic bishop of Lismore, Australia", "*John Carroll (rugby union) (1934–1998), Australian rugby union player", "*John Carroll (basketball) (born 1955), American basketball coach", "*John Carroll (cricketer) (born 1972), English cricketer", "*John Carroll (hurler) (born 1978), Irish hurler", "*John Carroll (soldier) (1891–1971), Australian Victoria Cross recipient", "*John Carroll (actor) (1906–1979), American actor", "*Jack the Bulldog, mascot of the Georgetown University Hoyas athletics teams whose incarnations are named John Carroll or similar", "*John Carroll University, a Catholic Jesuit school in Ohio", "*The John Carroll School, a Catholic secondary school in Maryland", "*John Carroll Society, an organization for Catholic laypersons", "*Bishop John Carroll (statue), a statue of John Carroll at Georgetown University", "*John Carroll Catholic High School (disambiguation)", "*John Carroll Lynch (born 1963), American actor"]}, {"page": "Francis Mostyn (archbishop of Cardiff)", "response": ["He received his episcopal consecration on the following 14 September 1895 (the ninth anniversary of his priestly ordination) from Cardinal Herbert Vaughan, with Bishops John Carroll and John Hedley, OSB, serving as co-consecrators. He was later named Bishop of Menevia upon his vicariate's elevation to a diocese on 14 May 1898. On 7 March 1921, Mostyn was appointed Archbishop of Cardiff by Pope Benedict XV, leading the only Roman Catholic Archdiocese in Wales. "]}, {"page": "John Carroll (Bishop of Shrewsbury)", "response": ["#REDIRECT John Carroll (bishop of Shrewsbury)"]}]}}