{"wiki_id": "http://www.wikidata.org/entity/Q4251027", "itemLabel": "Victor Kiernan", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Kiernan", "wikipedia_page": {"main": "Edward Victor Gordon Kiernan (4 September 1913 – 17 February 2009) was a British historian and a member of the Communist Party Historians Group. Kiernan's work was prominent in the field of Marxist historiography in Britain, analyzing historical events from a Marxist point of view. Belonging to a group of prominent British Marxist historians active in the 20th century, Kiernan was a member of the Communist Party of Great Britain from 1934 until 1959, when he left in protest over the party's response to the Hungarian Revolution of 1956. He was also involved in promoting Urdu poetry among Western audiences.", "link_mentions": [{"page": "September 4", "response": ["*  1913   – Victor Kiernan, English historian and academic (d. 2009)"]}, {"page": "Richard III (play)", "response": ["Scholar Victor Kiernan writes that this interpretation is a perfect fit with the English social perspective of Shakespeare's day: \"An extension is in progress of a privileged class's assurance of preferential treatment in the next world as in this, to a favoured nation's conviction of having God on its side, of Englishmen being ... the new Chosen People\". As Elizabethan England was slowly colonising the world, the populace embraced the view of its own Divine Right and Appointment to do so, much as Richard does in Shakespeare's play."]}, {"page": "War of the Pacific", "response": ["Regarding a British intervention in the war, the British historian Victor Kiernan had stated: \"It should be emphasized that the Foreign Office never at any time contemplated any kind of active intervention.... It was especially scrupulous in seeing to it that no warships were smuggled out for sale to either side, for it was in mortal dread of another Alabama Award.\" During the war, the British government embargoed four warships sold to Chile and Perú."]}, {"page": "David Guest (communist)", "response": ["Guest was the son of Leslie Haden-Guest, 1st Baron Haden-Guest. He entered Trinity College, Cambridge, in 1929 and studied from 1930 to 1931 in Göttingen in Germany, where he was sentenced to two weeks in prison for anti-Nazi political activity. On his return he joined the Communist Party at Cambridge in 1931. There Guest became the head of a party cell that included John Cornford, Guy Burgess, Donald Maclean, Victor Kiernan and James Klugmann. This enabled dons such as Maurice Dobb and John Bernal to take a back-seat. It was claimed that David Guest would \"stride into hall at Trinity wearing a hammer and sickle pin in his lapel.\"Phillip Knightley, Philby: KGB Masterspy (1988) page 32"]}, {"page": "Faiz Ahmad Faiz", "response": ["Faiz Ahmad Faiz's poetry has been translated into many languages, including English and Russian. A Balochi poet, Mir Gul Khan Nasir, who was also a friend of Faiz Ahmad Faiz, translated his book Sar-e-Wadi-e-Seena into Balochi with the title Seenai Keechag aa. Gul Khan's translation was written while he was in jail during Zulfiqar Ali Bhutto's regime for opposing the government's policies. It was only published in 1980, after Zia-ul-Haq toppled Bhutto's government and freed all the political prisoners of his (Bhutto's) regime. Victor Kiernan, British Marxist historian translated Faiz Ahmed Faiz's works into English, and several other translations of whole or part of his work into English have also been made by others;Omer Tarin, Faiz Ahmad Faiz: The Living Verse and its English Translators, in Punjab Journal of the Humanities, Lahore, Pakistan, Vol 3, 2008, pp. 21–23 a transliteration in Punjabi was made by Mohinder Singh."]}, {"page": "Manchester Grammar School", "response": ["The school's alumni are called \"Old Mancunians\", or informally Old Mancs, and include academics, politicians, mathematicians, sportsmen, such as former England cricket captain Mike Atherton, former Lancashire Captain, Mark Chilton, and former Lancashire and England batsman, John Crawley, several notable writers, such as Thomas de Quincey, playwright Robert Bolt, author Alan Garner, after whom the school's Junior Library is named, and journalist and broadcaster Martin Sixsmith. Other Old Mancunians are John Charles Polanyi (b. 1929) who won the 1986 Nobel Prize for Chemistry, chemist Michael Barber, actors Ben Kingsley and Robert Powell, historians Michael Wood and Victor Kiernan, popular science writer Brian Clegg, concert organist Daniel Moult, comic Chris Addison, and cryptographers Clifford Cocks, Peter Twinn and Malcolm J. Williamson. Theatre director Nicholas Hytner and the pianist John Ogdon are Old Mancunians. Mathematician and Fields Medalist Sir Michael Atiyah was also educated at the school for two years. One of the first Indian poet of English language, Manmohan Ghose, is also an Old Mancunian."]}, {"page": "Maurice Dobb", "response": ["In 1920, after Dobb's first year at Pembroke College, John Maynard Keynes invited him to join the Political Economy Club, and after graduation Keynes helped him secure his Cambridge position. Dobb was open with students about his communist beliefs. One of them, Victor Kiernan, later reported, \"We had no time then to assimilate Marxist theory more than very roughly; it was only beginning to take root in England, although it had one remarkable expounder at Cambridge in Maurice Dobb.\"Victor Kiernan, London Review of Books(25 June 1987). Dobb's house, \"St Andrews\" in Chesterton Lane, was a frequent meeting place for Cambridge communists, known locally as \"The Red House\".Biography of Maurice Dobb"]}, {"page": "List of University of Cambridge people", "response": ["*Victor Kiernan (Trinity)"]}, {"page": "Prakash Karat", "response": ["Karat studied in the Madras Christian College Higher Secondary School in Chennai. On finishing school, he won the first prize in an all-India essay competition on the Tokyo Olympics. He was sent on a ten-day visit to the Tokyo Olympics in 1964 as a result. He went to the Madras Christian College as an undergraduate student in economics, winning the prize for best all round student on graduation. Encouraged by the Scottish theologian Duncan B. Forrester, one of his college professors, he got a scholarship to Britain's University of Edinburgh, for a master's degree in politics. In 1970 he received an MSc degree from the University of Edinburgh for the thesis \"Language and politics in modern India\". At Edinburgh he became active in student politics and met Professor Victor Kiernan, the well-known Marxist historian. His political activism began with anti-apartheid protests at the university, for which he was rusticated. The rustication was suspended on good behaviour.", "* Across Time and Continents: A tribute to Victor Kiernan (2003), edited"]}, {"page": "Kiernan", "response": ["* Victor Kiernan (1913–2009), British Marxist historian, translator of Urdu poetry"]}, {"page": "1913 in the United Kingdom", "response": ["* 4 September – Victor Kiernan, Marxist historian (died 2009)"]}, {"page": "Victor G. Kiernan", "response": ["#REDIRECT Victor Kiernan"]}, {"page": "2009 in Scotland", "response": ["* 17 February – Victor Kiernan, Marxist historian (born 1913 in England)"]}, {"page": "2009 in the United Kingdom", "response": ["*17 February – Victor Kiernan, historian (b. 1913)"]}, {"page": "Deaths in February 2009", "response": ["*Victor Kiernan, 95, British historian."]}, {"page": "Shanta Gandhi", "response": ["She was married to Marxist historian Victor Kiernan in 1938 in Bombay (now Mumbai), but the couple divorced in 1946 before Kiernan left India."]}, {"page": "Marxist schools of thought", "response": ["The British Marxist historians were a circle of scholars that originated in the Communist Party of Great Britain in the 1930s, eventually forming the Communist Party Historians Group in 1946. They shared a common interest in \"history from below\" and class structure in early capitalist society. Important members of the group included Maurice Dobb, Dona Torr, A. L. Morton, Rodney Hilton, E. P. Thompson, Eric Hobsbawm, George Rudé, Christopher Hill, Dorothy Thompson, John Saville, Victor Kiernan and Raphael Samuel."]}, {"page": "Communist Party Historians Group", "response": ["*Victor Kiernan"]}, {"page": "Communist Party of Great Britain", "response": ["* Victor Kiernan"]}, {"page": "Kiernan, Victor", "response": ["#redirectVictor Kiernan"]}, {"page": "Alastair Lamb", "response": ["Victor Kiernan recommends the book. Kiernan notes that Lamb is the top authority on the region and describes the book, like Lamb's previous ones, as very thorough, uninvolved and objective, regardless of the rare instance where India is treated with \"little sympathy.\" Historian Hugh Tinker notices that Alastair Lamb explains Kashmiri political history in a \"masterly style.\" Tinker points out that Lamb is known as the foremost authority on the region but also notes that his findings will not be accepted by Indian authors, who see Kashmir as a test of Indian secularism."]}, {"page": "Fontana History of European War and Society", "response": ["Ian Beckett described the series as a synthesis made possible by a flourishing of new, more specialised, studies, which had begun to appear after the Second World War, but took the view that Victor Kiernan's Marxist treatment of empire had not dated well. John Rigby Hale's volume, on the other hand, was described as a \"model of historical writing\" by Beckett, as part of a post-war movement to rescue the history of warfare from the memoirs of generals and from museum experts writing about armour and weapons.\"John Rigby Hale, 1923–1999\" by Michael Mallett in "]}, {"page": "V. G. Kiernan", "response": ["#REDIRECT Victor Kiernan"]}, {"page": "Victor Gordon Kiernan", "response": ["#REDIRECT Victor Kiernan"]}]}}