{"wiki_id": "http://www.wikidata.org/entity/Q42666007", "itemLabel": "Elizabeth Morton", "itemDescription": "British actress and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Morton", "wikipedia_page": {"main": "Elizabeth Heery (born 1961) is a British actress and writer. As an actress she works under the name Elizabeth Morton and is known for playing Madeline Bassett in seasons three and four of ITV series Jeeves and Wooster and for playing Lucinda Stoneway in seasons five, six, and seven of ITV's 90s sitcom Watching. Since 2016 she has been an ambassador for the Orange Tree Theatre in Richmond. In 2018 she secured a two book deal with Ebury Press, part of penguin/Random House publishing. Her novel A Liverpool Girl was published in 2019, followed by a second novel in August 2020, 'A Last Dance in Liverpool'. Both books reached Number One and Number 3 respectively in the Booksellers Heatseekers Charts. It was announced in The Bookseller magazine in August 2020 that she had secured a book deal with PanMacMillan for two more Liverpool sagas. Angel of Liverpool was published in 2021 and was a number 3 Heatseeker, People’s Friend Recommendation and reached the Top 10 WH Smith bestsellers. The Girl From Liverpool will be published July 2022. Elizabeth narrates all her books for audio.", "link_mentions": [{"page": "Liverpool", "response": ["Notable actors and actresses from Liverpool include Arthur Askey, Tom Baker, Kim Cattrall, Jodie Comer, Stephen Graham, Rex Harrison, Jason Isaacs, Tina Malone, the McGann brothers (Joe, Mark, Paul, and Stephen), David Morrissey, Elizabeth Morton, Peter Serafinowicz, Elisabeth Sladen, Alison Steadman, and Rita Tushingham. Actors and actresses from elsewhere in the world have strong ties to the city, such as Canadian actor Mike Myers (whose parents were both from Liverpool) and American actress Halle Berry (whose mother was from Liverpool)."]}, {"page": "Peter Davison", "response": ["Davison married his third wife, actress and writer Elizabeth Morton, in 2003. The couple live in Twickenham and have two sons, Louis (born 1999) and Joel (born 2001). They both appeared in The Five(ish) Doctors playing themselves. Louis Moffett made his professional theatrical acting debut aged 14, playing Prince Edward in the 2014 Trafalgar Studios stage production of Richard III, credited as Louis Davison, having adopted his father's stage name as his own. His brother Joel also made his theatrical debut aged 13 in the summer of 2014, playing Jack in The Widowing of Mrs Holroyd at the Orange Tree Theatre, Richmond. Louis Davison plays the part of Victor in Tim Burton's film, Miss Peregrine's Home for Peculiar Children released in 2016, and Joel Davison played Lord Heybrook in French Without Tears at The Orange Tree Theatre, Richmond. Louis  has appeared as Parker Whitfield in BBC One's Holby City."]}, {"page": "Madeline Bassett", "response": ["* In the 1990–1993 television series Jeeves and Wooster, Madeline was portrayed by Francesca Folan in series 1, Diana Blackburn in series 2, and Elizabeth Morton in series 3 and series 4."]}, {"page": "Watching (TV series)", "response": ["Quiet biker Malcolm, who lived with his domineering mother (played by Patsy Byrne), was accompanied on his birdwatching trips by loud scouser Brenda, who was forced to ride in the sidecar of his Norton motorbike and had a habit of rubbing his mother up the wrong way. Other key characters in the series were Brenda's sister Pamela (Liza Tarbuck), her husband David (John Bowler – Series 2 onwards) and Brenda and Pam's mother Joyce (played by Noreen Kershaw) in the last few series. The series followed Malcolm and Brenda's on/off relationship, during which Malcolm married another woman called Lucinda (played by Elizabeth Morton). However, Brenda and Malcolm finally married each other in the final episode, \"Knotting\", which was broadcast on 4 April 1993.", "*Elizabeth Morton as Lucinda Davis/Stoneway (series 5–7)"]}, {"page": "Faeries (1999 film)", "response": ["* Elizabeth Morton as Princess Brigid"]}, {"page": "List of fictional princesses", "response": ["| She is married to the Faery Prince Albrecht. Voiced by Kate Winslet and Elizabeth Morton."]}, {"page": "MediaWiki talk:Common.css/Archive 4", "response": ["| colspan=\"3\" | Elizabeth Morton", "| colspan=\"3\" | Elizabeth Morton series 3 and 4"]}, {"page": "List of Jeeves and Wooster characters", "response": ["| colspan=\"2\" | Elizabeth Morton"]}, {"page": "The Ties That Bind (Jeeves and Wooster)", "response": ["* Madeline Bassett – Elizabeth Morton"]}, {"page": "List of How to Get Away with Murder characters", "response": ["|Elizabeth Morton"]}, {"page": "Aunt Dahlia, Cornelia and Madeline", "response": ["* Madeline Bassett – Elizabeth Morton"]}, {"page": "Sir Watkyn Bassett's Memoirs", "response": ["* Madeline Bassett – Elizabeth Morton"]}, {"page": "Bertie Takes Gussie's Place At Deverill Hall", "response": ["* Madeline Bassett – Elizabeth Morton "]}, {"page": "Trouble at Totleigh Towers", "response": ["* Madeline Bassett – Elizabeth Morton"]}, {"page": "How to Get Away with Murder (season 5)", "response": ["* Elizabeth Morton as Julie Winterbottom"]}, {"page": "Elizabeth Homer Morton", "response": ["In 1988, the Elizabeth Morton Memorial Fund was established."]}, {"page": "The Haunting of Helen Walker", "response": ["*Elizabeth Morton as Miss Jessel"]}, {"page": "Morton, Elizabeth", "response": ["#redirectElizabeth Morton"]}, {"page": "Elizabeth Alexandra Morton", "response": ["After her second divorce, Morton resumed her birth name, moved into her parents' property, and donated almost two hundred acres on Long Island to the United States Fish and Wildlife Service in the mid-1950s.\"New Grants of Land Enlarge Elizabeth Morton Wildlife Refuge\" press release, Department of the Interior (June 5, 1956). The Elizabeth A. Morton National Wildlife Refuge is named for her, and was the first national wildlife refuge named for a woman (the three others are named for Rachel Carson, Elizabeth S. Hartwell, and Julia Butler Hansen). She donated additional land to the Nature Conservancy in 1957, which became part of the Wolf Swamp Reserve.", "* \"Miss Elizabeth Morton (daughter of Mr. Alexander Logan Morton of New York)\" two photographs by Rudolf Eickemeyer Jr., in the collection of the National Museum of American History."]}]}}