{"wiki_id": "http://www.wikidata.org/entity/Q4275597", "itemLabel": "Dylan McGeouch", "itemDescription": "Scottish association football player (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dylan_McGeouch", "wikipedia_page": {"main": "Dylan McGeouch (born 15 January 1993) is a Scottish footballer, who plays for Aberdeen as a midfielder. McGeouch, who has previously played for Celtic, Coventry City, Hibernian and Sunderland, made his first full international appearance for Scotland in May 2018.", "link_mentions": [{"page": "Old Firm", "response": ["* Dylan McGeouch (youth career with both Celtic and Rangers, senior career Celtic) "]}, {"page": "Milton, Glasgow", "response": ["* Dylan McGeouch, footballer (Celtic, Hibernian, Aberdeen and Scotland)"]}, {"page": "Celtic F.C. Player of the Year", "response": ["*Goal of the Season: Dylan McGeouch vs  St Mirren"]}, {"page": "Scottish Youth Cup", "response": ["* Dylan McGeouch (2010, 2012)"]}, {"page": "Rangers F.C. B Team and Academy", "response": ["| 7||   Dylan McGeouch ||  || align=\"center\"|Celtic  || align=\"center\"|£0.1m ||align=\"center\"| ||align=\"center\"| £0.1m"]}, {"page": "Bishopbriggs Academy", "response": ["*Dylan McGeouch, Scottish footballer"]}, {"page": "List of Hibernian F.C. players", "response": ["*Dylan McGeouch"]}, {"page": "Celtic F.C. Under-20s and Academy", "response": ["* Dylan McGeouch"]}, {"page": "2008–09 Scottish Youth Cup", "response": ["|MF || || Dylan McGeouch"]}, {"page": "2011 Scottish Youth Cup Final", "response": ["Rangers entered the competition in the third round. They began their campaign against Deveronvale emphatically winning 13–0 at Rangers Training Centre, thanks to goals from Max Wright (4), Kal Naismith (4), Rhys McCabe (3), Robbie Crawford and Darren Cole.Gers Too Strong For Deveronvale Rangers then played Hamilton Academical again at Rangers Training Centre. Goals by Kane Hemmings (2) (1st pen.), and Max Wright gave The Gers a 3-2 win.19s March On In Cup In the quarter final, Rangers played Ayr United, this time it was an away match, taking place at Somerset Park. Rangers eventually won 6-2 after being 2-1 down at half-time, scorers for Rangers were Andy Mitchell (2), Kal Naismith, Kyle McAusland, Rhys McCabe and Dylan McGeouch. Rangers then took on Hibernian in the semi-finals, another home match, however, this time the match took place at Ibrox with Rangers running out narrow 1-0 winners courtesy of a goal from Chris Hegarty."]}, {"page": "2010 HKFC International Soccer Sevens", "response": ["* Rangers F.C.: Andrew Shinnie (Tournament Top Scorer), Scott Gallacher, Andrew Mitchell, Ross Perry, Rhys McCabe, Stephen Stirling, Rory Loy, Dylan McGeouch, Max Wright, Kal NaismithA Great Adventure – Academy News – Rangers"]}, {"page": "2011–12 Celtic F.C. season", "response": ["On 1 July, Celtic confirmed the signings of Adam Matthews from Cardiff City, Kelvin Wilson from Nottingham Forest and Dylan McGeouch from Rangers. All three had already signed on pre-contract agreements and joined Celtic after their contracts expired. Three players also left the club after the expiry of their contracts. Former Germany and Sweden internationals Andreas Hinkel and Freddie Ljungberg left along with Ben Hutchinson.", "|46||||MF||Dylan McGeouch", "| Dylan McGeouch", "| Dylan McGeouch"]}, {"page": "Darren McGeouch", "response": ["His brother, Dylan McGeouch, is also a professional footballer."]}, {"page": "Dylan McGeough", "response": ["#Redirect Dylan McGeouch"]}]}}