{"wiki_id": "http://www.wikidata.org/entity/Q4275636", "itemLabel": "Sophia McDougall", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophia_McDougall", "wikipedia_page": {"main": "Sophia McDougall (born 1979) is a British novelist, playwright, and poet.\n\n", "link_mentions": [{"page": "Emperor Go-Daigo", "response": ["Emperor Go-Daigo appears in the alternate history novel Romanitas by Sophia McDougall."]}, {"page": "Pertinax", "response": ["In Romanitas, a fictional alternate history novel by Sophia McDougall, Pertinax's reign is the point of divergence. In the history as established by the novel, the plot against Pertinax was thwarted, and Pertinax introduced a series of reforms that would consolidate the Roman Empire to such a degree that it would still be a major power in the 21st century."]}, {"page": "Parallel universes in fiction", "response": ["Universe 'types' frequently explored in sidewise and alternative history works include worlds whose Nazis won the Second World War, as in The Man in the High Castle by Philip K. Dick, SS-GB by Len Deighton, and Fatherland by Robert Harris, and worlds whose Roman Empire never fell, as in Roma Eterna by Robert Silverberg. Romanitas by Sophia McDougall, and Warlords of Utopia by Lance Parkin."]}, {"page": "Fiction set in ancient Rome", "response": ["* Romanitas (2005), by Sophia McDougall", "* Rome Burning (2006), sequel to Romanitas, by Sophia McDougall"]}, {"page": "McDougall", "response": ["*Sophia McDougall, British author, playwright, and poet"]}, {"page": "List of alternate history fiction", "response": ["| Sophia McDougall"]}, {"page": "Romanitas (novel)", "response": ["Romanitas is an alternate history novel by Sophia McDougall, published by Orion Books. It is the first of a trilogy of novels based on a world in which the Roman Empire survives in contemporary times and now dominates much of the world."]}, {"page": "Sophia (given name)", "response": ["* Sophia McDougall (born 1979), British author"]}, {"page": "Rome Burning", "response": ["Rome Burning is the second book of Sophia McDougall's trilogy, following her debut novel, Romanitas, set in a world where the Roman Empire has survived to contemporary times."]}, {"page": "BSFA Award for Best Artwork", "response": ["*Andy Potts - cover for Mars Evacuees by Sophia McDougall"]}, {"page": "James White Award", "response": ["The 2014 James White Award was presented at Satellite4 (the 2014 Eastercon) in Glasgow). The judging panel consisted of authors Sophia McDougall, Emma Newman and BSFA Award winner Adam Roberts."]}, {"page": "Strong female character", "response": ["Although the archetype arose largely through feminism, it has not been universally well received by those supportive of women's rights. Sophia McDougall of the New Statesman has criticized the high prevalence of strong female characters for creating a cliché that represents women as unrealistically strong; she argues that the simplicity of this archetype does little to present women in media in a realistic, complex way. "]}]}}