{"wiki_id": "http://www.wikidata.org/entity/Q427716", "itemLabel": "Aaron Wilbraham", "itemDescription": "English footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Aaron_Wilbraham", "wikipedia_page": {"main": "Aaron Thomas Wilbraham (born 21 October 1979) is an English football manager and former professional footballer who played as a forward. He is currently assistant manager of EFL League One side Shrewsbury Town.", "link_mentions": [{"page": "Bristol City F.C.", "response": ["|2014–15|| Aaron Wilbraham||33||4||18"]}, {"page": "Knutsford", "response": ["* Aaron Wilbraham (born 1979 in Knutsford) an English professional footballer over 500 pro appearances, plays for Rochdale"]}, {"page": "Shrewsbury Town F.C.", "response": ["|  Aaron Wilbraham || Assistant manager"]}, {"page": "Milton Keynes Dons F.C.", "response": ["|2009|| Aaron Wilbraham"]}, {"page": "Wilbraham", "response": ["*Aaron Wilbraham (born 1979), English professional footballer"]}, {"page": "Steve Cotterill", "response": ["On 19 January 2021, Cotterill's Shrewsbury side travelled to Premier League side Southampton for an FA Cup third round tie. However, assistant manager Aaron Wilbraham took charge as stand-in manager as Cotterill had been in intensive care after suffering from COVID-19. The Shrews lost 2–0. He was treated in hospital for COVID-19 for 33 days before being released on 16 February. On 1 March 2021, Cotterill was re-admitted to hospital after suffering from COVID-pneumonia. On 15 March 2021, Cotterill was discharged for hospital for a second time and will continue his recovery at home."]}, {"page": "Aaron (given name)", "response": ["*Aaron Wilbraham (born 1979), English footballer"]}, {"page": "Knutsford Academy", "response": ["* Aaron Wilbraham - Bristol City Footballer."]}, {"page": "Dannie Bulman", "response": ["He returned to Crawley in 2017, and was offered a new contract at the end of the 2017–18 season. In June 2019, at the age of 40, Bulman was offered another one-year contract by Crawley; at that point he was the oldest active player in the English Football League, ahead of Kevin Ellison, Aaron Wilbraham and James Coppinger. At the end of the 2019–20 season, he was offered a new contract by the club, which he agreed to, signing a one-year contract extension as part of a player-coach arrangement."]}, {"page": "2008–09 Football League", "response": ["|Aaron Wilbraham"]}, {"page": "Aaron Thomas Wilbraham", "response": ["#REDIRECT Aaron Wilbraham"]}, {"page": "Daniel Powell", "response": ["Powell returned to Milton Keynes Dons in November 2010 and began to break into the first team, becoming a regular in the starting lineup after the sales of Aaron Wilbraham to Norwich City and Jermaine Easter to Crystal Palace left the club with just two senior strikers. Powell went on to score nine goals in 29 league appearances for the club in the 2010–11 season. On 5 March 2013, Powell signed a two-year extension to his current Milton Keynes Dons deal, keeping him at the club until June 2015. Powell netted eight times in 42 league appearances in 2014–15, as Milton Keynes Dons were promoted to the Championship as League One runners-up."]}, {"page": "2008 Football League Trophy Final", "response": ["|FW ||16 ||Aaron Wilbraham || ||"]}, {"page": "2009 Football League One play-off Final", "response": ["Scunthorpe United's opponents in their play-off semi-final were Milton Keynes Dons and the first match of the two-legged tie took place at Glanford Park in Scunthorpe on 8 May 2009.  A volley from Martyn Woolford put the home side into the lead early in the match after Willy Guéret failed to properly clear a shot from Paul Hayes.  Aaron Wilbraham scored the equaliser with a header in the 27th minute: no further goals were scored and the match ended 1–1.  The second leg of the semi-final was held a week later at Stadium MK in Milton Keynes.  Regular time ended goalless, sending the match into extra time where the closest chance fell to David Mirfin whose shot struck the Millwall goalpost.  With the tie ending 1–1 on aggregate, a penalty shootout was required to decide the winners. The first six penalties were scored before Cliff Byrne missed his for Scunthorpe.  Jason Puncheon's spot kick was then saved but with the next two penalties being scored, the shootout went to sudden death.  Matt Sparrow and Jude Stirling both missed before the next four were scored.  Ian Morris converted his side's ninth penalty and then Tore André Flo missed to give Scunthorpe a 7–6 penalty win."]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Aaron Wilbraham||||2006||5||1||"]}, {"page": "Jay Emmanuel-Thomas", "response": ["To start the 2014–15 season, Emmanuel-Thomas was used sparingly as new signings Kieran Agard and Aaron Wilbraham flourished in attack for City. Bristol City started the season with a 22-game unbeaten run, propelling them to the top of League One and setting a new club record. Emmanuel-Thomas's first goal of the season came in a 2–1 away victory against Notts County on 31 August 2014. He then went 11 league games without scoring a goal, but finally broke his duck against Yeovil Town in a 2–1 home win on Boxing Day. After injuries to both Agard and Wilbraham, Emmanuel-Thomas shone in attack alongside loan signing Matt Smith, including setting up Smith for two of his four goals against Gillingham in the Football League Trophy Southern Area Final. Emmanuel-Thomas scored both goals as Bristol City beat Doncaster Rovers in an FA Cup 3rd round replay at Ashton Gate, before scoring in back-to-back games against Scunthorpe United and Fleetwood Town. On 10 February 2015, he scored a 25-yard strike in City's 3–1 home win against Port Vale, taking his tally of league goals to seven for the season and extending City's lead at the top of League One to four points, with a game in hand over second-placed Swindon Town."]}, {"page": "List of foreign Eliteserien players", "response": ["*Aaron Wilbraham – Moss – 2000"]}, {"page": "Kevin Friend", "response": ["During a Football League One match in 2010 between Norwich City and Milton Keynes Dons Friend issued 11 yellow cards, including two to Dons player Aaron Wilbraham."]}, {"page": "2010–11 Milton Keynes Dons F.C. season", "response": ["| 1 January 2011 || FW ||  Aaron Wilbraham || Norwich City || "]}]}}