{"wiki_id": "http://www.wikidata.org/entity/Q427291", "itemLabel": "Gavin Hastings", "itemDescription": "Rugby union player from Scotland", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_Hastings", "wikipedia_page": {"main": "Andrew Gavin Hastings,  (born 3 January 1962) is a Scottish former rugby union player.  A fullback, he is widely regarded to be one of the best ever Scottish rugby players and was one of the outstanding players of his generation, winning 61 caps for Scotland, 20 of which as captain. He played for Watsonians, London Scottish, Cambridge University, Scotland and the British Lions. He twice toured with the British and Irish Lions, to Australia in 1989 and as captain on the 1993 tour to New Zealand.", "link_mentions": [{"page": "British & Irish Lions", "response": ["| Gavin Hastings, 28", "| Gavin Hastings", "| Gavin Hastings, 38", "|align=\"left\"| Gavin Hastings"]}, {"page": "January 3", "response": ["*  1962   – Gavin Hastings, Scottish rugby player"]}, {"page": "Rugby World Cup", "response": ["New Zealand All Black Jonah Lomu is the youngest player to appear in a final – aged 20 years and 43 days at the 1995 Final.Peatey (2011) p. 245. Lomu (playing in two tournaments) and South African Bryan Habana (playing in three tournaments) share the record for most total World Cup tournament tries, both scoring 15. Lomu (in 1999) and Habana (in 2007) also share the record, along with All Black Julian Savea (in 2015), for most tries in a tournament, with 8 each. South Africa's Jannie de Beer kicked five drop-goals against England in 1999 – an individual record for a single World Cup match. The record for most penalties in a match is 8, held by Australian Matt Burke, Argentinian Gonzalo Quesada, Scotland's Gavin Hastings and France's Thierry Lacroix, with Quesada also holding the record for most penalties in a tournament, with 31."]}, {"page": "NFL Europe", "response": ["More than 100 players with World League experience played in the American NFL in 1996. Meanwhile, the WLAF signed some players who had been more famous in other leagues and sports – in 1996 the London Monarchs signed former NFL star William Perry and the Scottish Claymores' kicker was Scotland's national rugby union team captain, Gavin Hastings."]}, {"page": "World Rugby", "response": ["The awards that recognise achievements in the preceding 12 months tend to be won by that season's most successful nation(s): France in 2002, England in 2003, South Africa in 2004, New Zealand in 2005, South Africa again in 2007. For those award categories that have nominees, a shortlist is drawn up by an independent panel of judges, who are all former internationals. The panel then reconvenes to choose a winner. The current judges are Jonathan Davies, Will Greenwood, Gavin Hastings, Michael Jones, Dan Lyle, Federico Méndez, Francois Pienaar and past Player of the Year winners Fabien Galthié and Keith Wood, with John Eales as convenor. The judges have a total of over 500 caps between them."]}, {"page": "University of Auckland", "response": ["*Gavin Hastings (born 1962), Scottish rugby player"]}, {"page": "1987 Rugby World Cup", "response": ["|align=\"left\"|Gavin Hastings"]}, {"page": "University of the West of Scotland", "response": ["* Gavin Hastings, Former Scottish Rugby internationalist and Captain of British and Irish Lions"]}, {"page": "Jonny Wilkinson", "response": ["Due to a non-contact ankle injury sustained in training, Wilkinson was not included in the teams for the opening games of the 2007 Rugby World Cup against the United States and then South Africa. He returned to score 24 points in the 44–22 win over Samoa. He helped England to victory against Tonga which put them through to the quarter-finals. During England's 12–10 quarter final win against Australia, in which he scored all of England's points, Wilkinson became the Rugby World Cup's leading point scorer with 231 points, surpassing Gavin Hastings of Scotland. He continued to play a major role in England's defence of the World Cup by kicking 9 points, including a 40-metre drop goal in the dying minutes, in their 14–9 semi-final victory over France.", "The following week against Italy, he became the highest point-scorer in the history of the Five/Six Nations Championship (he has since been overtaken by Ronan O'Gara of Ireland). On 6 October 2007, he also became the highest point-scorer in the history of the Rugby World Cup, kicking four penalties to overtake Scotland's Gavin Hastings in a quarter-final against Australia."]}, {"page": "Talksport", "response": ["* September 2011: Talksport broadcast the 2011 Rugby World Cup, with exclusive commentary of all 48 matches in New Zealand. Commentary was provided by John Taylor, Rupert Bell, John Anderson, Russell Hargreaves and Andrew McKenna with punditry from Brian Moore, Jeff Probyn, David Campese, Chris Sheasby, Michael Owen, Scott Quinnell, Gavin Hastings, and Paul Wallace, with presentation from Mark Saggers and Mike Bovill. Additional reporting from Roger Hughes, David Brady, and Stuart CamerontalkSPORT unveil Rugby World Cup plan Radio Today, 8 August 2011"]}, {"page": "1995 Rugby World Cup", "response": ["|align=\"left\"|Gavin Hastings"]}, {"page": "Will Carling", "response": ["Carling's career included the 1993 British Lions tour to New Zealand. He underachieved on that tour, a pattern attributed by coach Ian McGeechan and manager Geoff Cooke as at least partly due to his failing to secure the captaincy (this instead going to Gavin Hastings of Scotland) but also due in large part to the ascendency in the centre of both Guscott and Scott Gibbs of Wales. McGeechan and Cooke disclosed that Carling came close to voluntarily withdrawing from the squad; he did however recover his test place and played a notable role in the third test. McGeechan commented in his autobiography that Carling's failure to rise to the occasion as a Lion (in contrast to Guscott) may be seen by some as the difference between his legacy as a good player and a great player."]}, {"page": "Scottish Claymores", "response": ["The Scottish Claymores were an American football team based in Scotland. The franchise played in the World League of American Football (later renamed NFL Europe) between 1995 and 2004, initially playing all home games at Murrayfield Stadium, Edinburgh and latterly sharing home games with Hampden Park, Glasgow. In ten seasons of NFL Europe play, the Claymores reached the World Bowl on two occasions, with victory in World Bowl '96 but defeat in World Bowl 2000. Their name derives from that of the Claymore, a double-edged sword historically used in Scottish clan warfare. One notable player was Gavin Hastings, a Scottish rugby international who was used as a place kicker in 1996.", "The Claymores made an aggressive marketing push for the 1996 campaign under new general manager Mike Keller, which even included bringing in former Scotland Rugby union captain Gavin Hastings as a placekicker. Criner's 1996 roster featured an increased number of signed NFL players. Quarterback Steve Matthews (like Blundin, contracted to the Chiefs) opened the season, but when returnee Jim Ballard showed greater consistency coming off the bench to replace an injured Matthews in week seven, Ballard would get  the nod for the remainder of the season.Scottish Claymores Roster 1996  Starting 1996 where they had left off 1995, the Claymores opened with an overtime victory over the London Monarchs, followed up with home wins against the Barcelona Dragons (23–13) and the Amsterdam Admirals (21–14). Despite defeat away to Rhein the 3–1 start propelled the Claymores into a mid-season showdown with the unbeaten Frankfurt Galaxy on 11 May, where under WLAF rules the winner would advance to the World Bowl as hosts. A 20–0 win meant the championship game was coming to Edinburgh. The Claymores ran out the regular season with a 7–3 record to top the division. On 23 June, the Claymores again faced the Galaxy in World Bowl 96 at Murrayfield. The hosts rode three touchdown passes from Ballard to game MVP Yo Murphy and held off a late rally to win 32–27, thus completing the WLAF's first worst-to-first turnaround in front of a crowd of 38,982.Scottish Claymores Team Results 1996 "]}, {"page": "Scotland national rugby union team", "response": ["Scotland went through 1994 without a single win, but bounced back in 1995 to win their first three Five Nations matches. This run of wins included a 23–21 win away against France, courtesy of a last minute try and conversion by Gavin Hastings. This was Scotland's first win in Paris since 1969. The last Five Nations match was another Grand Slam decider against England; however, this time the English defeated the Scots 24–12, largely due to the kicking prowess of Rob Andrew.", "Scotland has competed in every Rugby World Cup since the inaugural tournament in 1987. Their best finish was fourth in 1991. In their semi-final on 26 October 1991 Scotland lost 6–9 to England at Murrayfield after Gavin Hastings missed a penalty almost in front of and a short distance from the posts. On 30 October Scotland lost the third-place play-off to New Zealand in Cardiff 13–6. Since then they have qualified for the quarter-finals in all but two occasions, in 2011 and 2019. In 2015, they came within 30 seconds of a famous win over Australia; however, a last minute penalty sealed the win for the Wallabies.", "* Gavin Hastings, captain of the British Lions, full back, inducted 2003", "* Gavin Hastings", "* Gavin Hastings", "|align=\"left\"| Gavin Hastings", "|align=\"left\"| Gavin Hastings"]}, {"page": "Rugby union positions", "response": ["Notable full-backs include Serge Blanco, who scored 38 tries in 93 tests for France and was known for his counter-attacking ability. In 1997, Serge Blanco was among the inaugural set of rugby players inducted into the International Rugby Hall of Fame and in 2011 he was also inducted into the IRB Hall of Fame. Four full-backs who played for the British and Irish Lions are in the International Rugby Hall of Fame; Gavin Hastings (also inducted into the IRB Hall in 2013) and Andy Irvine from Scotland, Tom Kiernan from Ireland and the aforementioned Williams. Hastings and Irvine were accurate goal-kickers and Kiernan is credited with being the first attacking full-back in Irish rugby. Williams was chosen as the greatest Lions full-back at the inaugural Lions Legends Dinner at Lord's in 2008 and is praised for his safety under the high ball, tackling and calm decision making. The other full-backs in the International Rugby Hall of Fame are Don Clarke and George Nēpia from New Zealand. Clarke, nicknamed \"the boot\", was an accurate goal kicker and Nēpia was noted for his tackling and kicking ability."]}, {"page": "London Scottish F.C.", "response": ["* Gavin Hastings (3 World Cups – 1987, 1991, 1995)"]}, {"page": "1991 Rugby World Cup", "response": ["|align=\"left\"|Gavin Hastings"]}, {"page": "Edinburgh Rugby", "response": ["Following the return to SRU control, the club coach Lynn Howells was dismissed. The SRU's Head of Player Development was appointed interim coach and Nic Cartwright was appointed as chief executive. Former British and Irish Lions captain Gavin Hastings was subsequently appointed as chairman, stating his \"desire and passion to see this game and this club grow\". The proposed signing of Stephen Larkham fell through after the SRU was unable to honour the terms of the agreement. This was seen as a disappointment, because the signing had been considered a coup for the beleaguered SRU when it was initially announced."]}, {"page": "Glasgow Warriors", "response": ["An EGM was held by the SRU for its member clubs to debate the matter and try and settle the issue on 8 February 1996. The SRU management was in favour of districts and its Vice-President Fred McLeod and Jim Telfer argued for the proposal. In favour of the clubs to be represented in Europe were former Scotland internationalists Gavin Hastings and Keith Robertson. Critically a speech from the floor from Brian Simmers of Glasgow Academicals – arguing that Hastings and Robertson didn't have the best interests of Scottish rugby at heart and they were arguing only for their own clubs – swung the debate and the District model won by 178 to 24."]}, {"page": "List of University of Cambridge people", "response": ["*Gavin Hastings (Magdalene), Scotland international (1986–1995)"]}, {"page": "Chris Paterson", "response": ["over Japan game at McDiarmid Park, Perth he overtook Andy Irvine to become Scotland's second highest points scorer, behind Gavin Hastings. He scored 40 points (three tries, 11 conversions and one penalty). This remains a record points haul for a Scottish player in a test match.", "On 26 February 2005, Paterson equalled the scoring record set by Gavin Hastings for one game of six penalties converted in the 18–13 win over Italy. Paterson was the BBC's full-back of the 2005 Six Nations Championship.", "Paterson announced his retirement from international rugby in December 2011; at the time, he held many of the most significant Scottish career records. His 109 caps was more than 20 clear of then-second-placed Scott Murray; his 96 starts are also the most in Scotland history. He remained Scotland's most-capped player until Ross Ford overtook him in 2017. Paterson was also involved in more defeats (65) than any other Scotland internationalist. Despite not being a regular kicker until after he had amassed 26 caps, he retired as Scotland's all-time leader in points (809), conversions (86) and penalties (140). Perhaps the most remarkable aspect of his Scotland career was his versatility; he retired as one of Scotland's three top cap-winners at two different positions. Paterson's 49 caps on the wing were third to Kenny Logan (63) and Sean Lamont (52); his 43 caps as a fullback were also third, this time to Gavin Hastings (61) and Andy Irvine (47). In addition, he has the most caps of any player from the Home Unions (England, Ireland, Scotland, Wales) who did not appear in a Test with the British & Irish Lions.", "He successfully kicked 36 consecutive goals for Scotland between 11 August 2007 and 7 June 2008, not missing a single attempt during the 2007 Rugby World Cup or the 2008 Six Nations Championship. This run was brought to an end during 7 June 2008 Test against Argentina. This is believed to have been a world record for consecutive successful kicks at goal in Test play since such statistics were first kept in the late 1980s; this record was broken in 2010 by Morné Steyn of South Africa. During the aforementioned Argentina match, Paterson also overtook Gavin Hastings' long standing Scotland points record of 667, as well as equalling Scott Murray's record of 87 caps for Scotland."]}, {"page": "Ian McGeechan", "response": ["| align=center|32 || 16 January ||  || Murrayfield Stadium, Edinburgh || align=center bgcolor=CCFFCC|15–3 || rowspan=4|1993 Five Nations Championship || rowspan=4|Gavin Hastings"]}, {"page": "Jim Telfer", "response": ["| align=center|1 || 20 November ||  || Murrayfield Stadium, Edinburgh || align=center bgcolor=FFCCCC|15–51 || New Zealand tour || Gavin Hastings", "| align=center|2 || 15 January ||  || Arms Park, Cardiff || align=center bgcolor=FFCCCC|6–29 || rowspan=4|Five Nations || rowspan=4|Gavin Hastings", "| align=center|8 || 19 November ||  || Murrayfield Stadium, Edinburgh || align=center bgcolor=FFCCCC|10–34 || South Africa tour || Gavin Hastings", "| align=center|9 || 21 January ||  || rowspan=2|Murrayfield Stadium, Edinburgh || align=center bgcolor=CCFFCC|22–6 || Test match || rowspan=10|Gavin Hastings"]}]}}