{"wiki_id": "http://www.wikidata.org/entity/Q4271676", "itemLabel": "Willie Stewart", "itemDescription": "Scottish footballer (1872-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Stewart", "wikipedia_page": {"main": "William S. Stewart (11 February 1872 – July 1945) was a Scottish footballer who was born in Coupar Angus. He played as an inside forward before switching to his favoured half back position. He joined Newton Heath from Warwick County in July 1889. At Newton Heath, which was renamed Manchester United in 1902, he scored a goal in the club's first Football Alliance match against Sunderland Albion on 21 September 1889. On 7 April 1890, he scored Newton Heath's first ever hat-trick against Small Heath. In the 1892-93 season, he helped the club gain League status. After scoring 23 goals in 149 appearances for the Heathens, he left the club in May 1895 for Luton Town. At the end of the career, he joined Thames Ironworks.", "link_mentions": [{"page": "William Stewart", "response": ["* Willie Stewart (1872–1945), Scottish footballer who played for Newton Heath and Luton Town"]}, {"page": "1899–1900 Thames Ironworks F.C. season", "response": ["United by a 4–2 margin.  This time the goals came from McKay, Joyce, Taylor and an own goal.  The last game of the season arrived on 28 April when, at the third time of asking that season, The Irons beat Millwall away 1–0 with a goal from Ken McKay.  Thames Ironworks finished 14 out of 15 in the Southern League Division One and would be required to play a Test Match to preserve their divisional status.  Only two days later at a game held at Tottenham's White Hart Lane Ground, The Irons faced a Fulham team featuring former centre-forward David Lloyd. Although only 600 fans turned up, Thames Ironworks won 5–1, with Bill Joyce claiming his third hat-trick of the season at his former stomping ground.  The other goals came from centre-half Willie Stewart and an own goal.  Thames Ironworks had survived their first season in the top division of the Southern League and their reserve team had also begun to gain ground, finishing fourth of ten in the London League Division One.", "|Willie Stewart"]}, {"page": "List of Thames Ironworks F.C. records and statistics", "response": ["|Willie Stewart"]}, {"page": "1889–90 Newton Heath LYR F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Willie Stewart"]}, {"page": "Millwall F.C.–West Ham United F.C. rivalry", "response": ["*  Willie StewartLindsay and Tarrant, p. 537Powles, p. 91"]}, {"page": "Jimmy Warner", "response": ["He became Newton Heath's first choice goalkeeper straight away in their first season in the Football League and made 20 consecutive appearances at the start of the season. However, he failed to show up for an away match against Stoke City on 7 January 1893, resulting in centre-half Willie Stewart having to play as a makeshift goalkeeper; the team lost 7–1. Warner explained to the club directors that he had missed his train to Stoke, but they were unconvinced and suspended him for a month. After his suspension was up, Warner made just three more appearances for Newton Heath (two in the league and one in the Manchester Senior Cup), and was sold to Walsall Town Swifts at the end of the season."]}, {"page": "List of Luton Town F.C. seasons", "response": ["| style=\"text-align:left;\" rowspan=\"2\"|Willie Stewart"]}]}}