{"wiki_id": "http://www.wikidata.org/entity/Q42804169", "itemLabel": "Charlotte Kirk", "itemDescription": "British actress and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlotte_Kirk", "wikipedia_page": {"main": "Charlotte Kirk (born Charlotte Sophie Dyke; 16 June 1992) is a British actress and writer.", "link_mentions": [{"page": "Brett Ratner", "response": ["Ratner was one of the people featured in the text leak between himself, Charlotte Kirk, Kevin Tsujihara, and James Packer."]}, {"page": "James Packer", "response": ["Packer later married part-time model and singer Erica Baxter, whom he wed in the equivalent of a civil ceremony on 20 June 2007. The wedding was at the Antibes town hall, and the second ceremony took place at Hotel du Cap – Eden Roc in Cap d'Antibes on the French Riviera. Together, Packer and Baxter have three children: daughter Indigo, born 27 July 2008, son Jackson Lloyd, born 1 February 2010, and daughter Emmanuelle Sheelah, born 22 September 2012. According to The Hollywood Reporter, Packer met struggling actress Charlotte Kirk in November 2012 when she was 20 and Packer was 45, and the two embarked on a relationship. In September 2013 James and Erica Packer announced they were separating."]}, {"page": "Nicole Brown Simpson", "response": ["Jessica Tuck portrayed Brown in the 1995 television movie The O. J. Simpson Story. Brown was portrayed by Sandra Olson in Reenactment of the Century. In 2013, it was announced Charlotte Kirk would portray Brown in Nicole & O.J.. Mena Suvari portrayed Brown in the 2019 film The Murder of Nicole Brown Simpson."]}, {"page": "Neil Marshall", "response": ["With actress Charlotte Kirk, he created a production company, Scarlett Productions."]}, {"page": "Ronald Meyer", "response": ["In August 2020, he stepped down from his role as Vice Chairman after he admitted to an affair with an unnamed woman and claimed he was being extorted. The woman was revealed to be Charlotte Kirk. In September 2020, The Hollywood Reporter revealed that Meyer and former Warner Bros. CEO Kevin Tsujihara may have colluded to cover up the real nature of their relationships with Charlotte Kirk."]}, {"page": "Kevin Tsujihara", "response": ["On March 6, 2019, there were reports that WarnerMedia was investigating allegations that Tsujihara had promised auditions and/or acting jobs to British actress Charlotte Kirk in return for sex.  On March 8, 2019, Tsujihara released a memo apologizing to his colleagues at WarnerMedia for his behavior. A statement issued by Tsujihara's attorney stated that Tsujihara \"did not have a direct role in the actress being cast in any movie\". Tsujihara resigned on March 18, 2019, as chairman and CEO of Warner Bros. In September 2020, The Hollywood Reporter revealed that Tsujihara and former NBCUniversal Vice Chairman Ronald Meyer may have colluded to cover up the real nature of their relationships with Charlotte Kirk."]}, {"page": "Seduced and Abandoned (2013 film)", "response": ["* Charlotte Kirk as Herself"]}, {"page": "Vice (2015 film)", "response": ["* Charlotte Kirk as Melissa"]}, {"page": "Fractured (2013 film)", "response": ["*Charlotte Kirk as Hellion"]}, {"page": "List of American films of 2015", "response": ["|Brian A. Miller (director); Andre Fabrizio, Jeremy Passmore (screenplay); Thomas Jane, Bruce Willis, Ambyr Childers, Johnathon Schaech, Bryan Greenberg, Charlotte Kirk, Tyler Olson"]}, {"page": "Tekken 2: Kazuya's Revenge", "response": ["*Charlotte Kirk as Chloe the Schoolgirl Assassin"]}, {"page": "Nicole & O.J.", "response": ["*Charlotte Kirk as Nicole Brown Simpson"]}, {"page": "The Reckoning (2020 film)", "response": ["The Reckoning is a 2020 adventure horror film directed by Neil Marshall, from a screenplay by Marshall, Charlotte Kirk and Edward Evers-Swindell. It stars Kirk, Joe Anderson, Steven Waddington and Sean Pertwee. The film follows a woman accused of being a witch after losing her husband to plague.  "]}, {"page": "List of horror films of 2020", "response": ["|  style=\"text-align:left;\" data-sort-value=\"The Reckoning\" | The Reckoning || Neil Marshall || Charlotte Kirk, Sean Pertwee, Steven Waddington|| United Kingdom || "]}]}}