{"wiki_id": "http://www.wikidata.org/entity/Q428175", "itemLabel": "Carl Fogarty", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Carl_Fogarty", "wikipedia_page": {"main": "Carl George Fogarty,  (born 1 July 1965), often known as Foggy, is an English former motorcycle racer and one of the most successful World Superbike racers of all time. He also holds the second highest number of race wins at 59. He is the son of former motorcycle racer George Fogarty. In 2011, Fogarty was named a FIM Legend for his motorcycling achievements.Retired from racing since 2000, Fogarty is renowned for his high corner speed riding style, combined with an aggressive competitiveness, which brought him 59 victories and four World Superbike Championships (1994, 1995, 1998 and 1999). His greatest success came with the factory Ducati team.\nHe was appointed Member of the Order of the British Empire (MBE) in the 1998 New Year Honours, and helped to develop the Petronas FP1 racing motorcycle campaigned in the early 2000s.\nHe won the 14th series of I'm a Celebrity...Get Me Out of Here! in 2014 and was crowned 'King of the Jungle'.", "link_mentions": [{"page": "Ducati Motor Holding S.p.A.", "response": ["|  Carl Fogarty", "|  Carl Fogarty", "|  Carl Fogarty", "|  Carl Fogarty"]}, {"page": "July 1", "response": ["*1965 – Carl Fogarty, English motorcycle racer"]}, {"page": "1965", "response": ["** Carl Fogarty, motorcycle racer"]}, {"page": "Isle of Man TT", "response": ["| Ray Amm, Adrian Archibald, Graeme Crosby, Harold Daniell, Max Deubel, Ralf Engelhardt, Ryan Farquhar, Patrick Farrance, Carl Fogarty, Alex George, Tom Herron, Darren Hope, Emil Hörner, Alan Jackson, Tony Jefferies, Geoff Johnson, Klaus Klaffenböck, Rob McElnea, Bob McIntyre, Phil Mellor, Dave Morris, Clive Pollington, Walter Schneider, Ian Simpson, Rolf Steinhausen, Hans Strauss, Luigi Taveri, Don Williams, Barry Woodland Dean Harrison"]}, {"page": "Emilia-Romagna", "response": ["Ducati Corse is the motorsports division of Ducati's motorcycle company, being the predominant Italian constructor in MotoGP and the Superbike World Championship. Ducati has won one MotoGP title with Australian Casey Stoner in 2007. Stoner is also the most successful rider for the team in MotoGP, having won 23 Grands Prix in his four seasons. Ducati have had multiple World Champions Valentino Rossi and Jorge Lorenzo race for the team. In 2017, Emilia-Romagna native Andrea Dovizioso finished second in the MotoGP championship for Ducati. The team has frequently had at least one Italian rider in its factory team since its entry into the premier class in 2003 at the beginning of the four-stroke engine era. Its first Grand Prix winner was Emilia-Romagna native Loris Capirossi in the team's inaugural season. Ducati have also won multiple Superbike titles with riders such as Carl Fogarty and Troy Bayliss being among title winners."]}, {"page": "Blackburn", "response": ["*Carl Fogarty (born 1965), four time motorcycle World Superbike champion"]}, {"page": "Through the Keyhole", "response": ["| 2 || Jonathan RossKimberley WalshAndi Peters || Penn JilletteCarl FogartyJames and Ola Jordan || 5 September 2015 || 2.69"]}, {"page": "Foggy (disambiguation)", "response": ["*Carl Fogarty, British four-time World Superbike Champion nicknamed \"Foggy\""]}, {"page": "Melanie Sykes", "response": ["In 2014, Sykes took part in the fourteenth series of I'm a Celebrity...Get Me Out of Here! where she finished in third place, behind runner-up Jake Quickenden and winner Carl Fogarty."]}, {"page": "MV Agusta", "response": ["The company planned its return to racing for the 2008 Superbike World Championship season: Carl Fogarty's English-based Team Foggy Racing was going to run the team; However the project was aborted due to a lack of sponsorship.Foggy Racing scraps WSBK return.  crash.net retrieved on September 30, 2007"]}, {"page": "Ducati 916", "response": ["thumb|right|Carl Fogarty on his Ducati 916", "Ducati won 4 Superbike World Championships with the 916, in 1994–1996, and in 1998, with riders Carl Fogarty and Troy Corser. Ducati won the Manufacturer's Championship in all those years.", "| 1994  || Carl Fogarty || 11 || Ducati 916 || Ducati ", "| 1995  || Carl Fogarty || 13 || Ducati 916 || Ducati ", "| 1998 || Carl Fogarty || 3 || Ducati 916 || Ducati"]}, {"page": "Brands Hatch", "response": ["Brands Hatch has held sixteen Superbike World Championship, since 1993, when Giancarlo Falappa's double victory in the pouring rain, including two rounds in 2000. Brands has featured in many of the pivotal moments in the championship's history, including Carl Fogarty's double victory in 1995, and more recently James Toseland's double in 2007, not forgetting Shane 'Shakey' Bryne's double as a \"wildcard\" entrant back in 2003. The last visit in 2008 saw Ryuichi Kiyonari take his first two World Superbike wins of his career, although this was overshadowed by the death of Craig Jones in a supporting World Supersports race. Unfortunately, the circuit owners, MotorSport Vision and the championship organisers FG Sport decided not to return to Brands Hatch in 2009, over a dispute about an increased sanctioning fee."]}, {"page": "Steve Hislop", "response": ["After their successful 1991 TT on all conquering Honda RVF machines, Hislop and Carl Fogarty had not planned to return in 1992. However, they both lined up on the Glencrutchery Road that year on unfancied machinery: Hislop was on Ron Haslam's Norton with Fogarty on the Loctite Yamaha. The Norton 588 had been developed on a shoe string budget when compared with the Japanese competition. John Player [the main Norton sponsor] had no intention of backing Steve's TT campaign but after scratching around for some support and with minimal testing time, the team headed for the Isle of Man.", "Hislop's main rival was Carl who started at number 4. Steve started at 19. Not only did this give the Scot more traffic to contend with but it also gave the crowd an anxious wait as the officials calculated the time difference between them [a gap that never exceeded 7.4 seconds]. As the race progressed, the two riders smashed records they set the previous year with Hislop taking a narrow advantage into the final lap. In a last-ditch attempt to catch Hislop, Fogarty recorded a record lap time of more than 123 mph on his Yamaha. It was all in vain however as Hislop guided the fly splattered Norton home to an historic win. This was one of Hislop's greatest achievements and one of the most popular TT wins. Carl Fogarty's lap record stood for 7 years."]}, {"page": "Anderstorp Raceway", "response": ["| World SBK || 1:33.480 ||  Carl Fogarty || Ducati 888SBK || 1993 Anderstorp World SBK round "]}, {"page": "Suzi Perry", "response": ["During the coronavirus lockdown of spring 2020, Suzi began a series of live Instagram broadcasts, called 'Suzi’s Breakfast Club', that incorporated interviews with people from the worlds of sport, music and entertainment. These included motorsport stars Carl Fogarty, James Toseland, Colin Edwards, Max Biaggi, Steve Parrish, Mark Blundell, David Coulthard, and Jason Plato. Also Jack Savoretti, Carol Vorderman, and Mark King of Level 42. The majority of broadcasts were also uploaded to YouTube."]}, {"page": "North West 200", "response": ["|Carl Fogarty", "! Superbikes Carl Fogarty", "! NW 200 Carl Fogarty"]}, {"page": "Blackburn railway station", "response": ["The station was covered by twin train sheds, an architecturally detailed canopy that covered all platforms. In 2000, due to its decaying state it was removed, changing the nature of the station in a £35 million regeneration project. A new building was built on the main island platform. The Grade II listed original entrance built in the 1880s, including the station buffet and former booking hall, was retained and refurbished. A piece of public artwork by artist Stephen Charnock was also erected at the edge of the platform, which consists of a stainless steel screen depicting Blackburn's industrial past and its more modern life today.  The images include some of Blackburn's most successful figures and famous visitors such as David Lloyd George (Liberal politician), Mahatma Gandhi (campaigner for Indian independence), Kathleen Ferrier (singer), Barbara Castle (Labour politician), Carl Fogarty (superbike racer), Wayne Hemingway (fashion designer) and Jack Walker (businessman).  Platform 4, which had previously not been in timetabled use since the 1970s, was reopened for regular services as part of the work."]}, {"page": "TT Circuit Assen", "response": ["| World SBK || 2:03.914 || Carl Fogarty || Ducati 996 RS || 1999 Assen World SBK round"]}, {"page": "List of sports rivalries", "response": ["|  Carl Fogarty ||  Scott Russell || Superbike World Championship || 1992—1994 || ||That tussle of 1994 between Russell and Fogarty was the making of the sport as a spectacle that could attract millions. The Brit vs Yank, hard-knock lad vs spoilt brat head-to-head the media constructed around the 1994 season guaranteed an unprecedented level of exposure for Superbikes."]}, {"page": "Colin Edwards", "response": ["In , Edwards managed several more victories for Honda (including leading teammate Aaron Slight home twice at Brands Hatch, giving Honda a rare Double-1-2) and ended the season in second overall position, behind champion Carl Fogarty. In , Edwards rode the new Honda VTR-1000 SP1/RC51 twin cylinder motorcycle to overall victory in the Superbike World Championship after Yamaha rider and points leader, Noriyuki Haga was disqualified for testing positive for a banned substance. Edwards came second to Ducati rider, Troy Bayliss in  but reclaimed the title from Bayliss in  in a dramatic fashion, clinching the championship in the final race of the season in Imola (Italy). Edwards also holds the record for the most points in a single season with 552 points in 2002 breaking the previous record of 489 points set by Carl Fogarty in 1999. Runner-up Troy Bayliss also broke the previous record with 541 points."]}, {"page": "Troy Corser", "response": ["Back in WSBK for , he came close to retaking the title, helped by a double win at Laguna, the second race by a mere 0.005sec. He led the standings before the final round, took pole, but crashing and breaking ribs in a warm-up accident. For  he was teamed with Carl Fogarty on Davide Tardozzi's team, the title going to Foggy with Corser again third. In  and  he was on a factory Aprilia RSV-Mille. He would take the Aprilia to its  first WSBK wins in 2000, and opened 2001 with a double victory in South Africa, but a double DNF at Monza scuppered his hopes of a championship challenge.", "In  he joined Carl Fogarty's Petronas Superbike team, and spent the year developing the bike before racing it in  and . He finished 9th in the 2004 championship, with a best result of 3rd, but chose to leave the team after this."]}, {"page": "Noriyuki Haga", "response": [" is a Japanese former professional motorcycle racer. He won 43 world championship superbike races during a 25 year racing career, making him one of the most accomplished competitors never to have won a Superbike World Championship. Haga was the runner-up in the championship three times and, four times finished in third place. His 43 victories ranks fourth all time in the history of the Superbike World Championship behind Jonathan Rea, Carl Fogarty and Troy Bayliss. Haga ranks third behind Troy Corser and Tom Sykes in career World Superbike race starts with 313. He last competed in the 2018 CIV Supersport 600 Championship, aboard a Yamaha YZF-R6. "]}, {"page": "Troy Bayliss", "response": ["Troy Bayliss (born 30 March 1969 in Taree, New South Wales, Australia) is an Australian motorcycle racer. During his career Bayliss won the Superbike World Championship three times and a MotoGP race, all with Ducati. He finished his career after winning the 2008 World Superbike title. His 52 World Superbike victories ranks third all time in the history of the championship behind Jonathan Rea and Carl Fogarty.", "Bayliss began the  season competing for Ducati in the US's AMA Superbike Championship, but was called in to replace Carl Fogarty in the Superbike World Championship when the latter was injured at Philip Island. Despite missing the first three rounds and having a poor start at his first race in Sugo, Bayliss had a creditable season, winning two races and earning sixth overall in the championship.Troy Bayliss career World Superbike statistics at worldsbk.com "]}, {"page": "Garry McCoy", "response": ["For  he joined NCR Ducati in the Superbike World Championship, winning at Philip Island and finishing 6th overall. He raced for Carl Fogarty's Foggy Petronas team in , as the team attempted to make its 900 cc 3 cylinder bike competitive. After 9 rounds his best finish was 12th, and he has qualified for Superpole and a top-16 starting spot 4 times. Results did not improve, and he had no road racing ride for 2006, instead contesting some Supercross."]}, {"page": "Chris Walker (motorcyclist)", "response": ["Walker placed 6th in the championship for GSE Ducati in , and 11th for Carl Fogarty's Foggy Petronas team in , respectively teamed with James Toseland and Troy Corser (both of whom won the title the next season, Toseland riding the  Fila Ducati to success and Corser the Alstare Suzuki in )."]}, {"page": "James Haydon", "response": ["In 2002 he joined Carl Fogarty's Foggy Petronas in the WSBK, developing the new bike for the first year. It proved unreliable with multiple blow ups, a lack of parts supply and other problems dogging it throughout the year. James had to leap from the motorcycle twice when it blew up and engulfed him in flames and fuel. One of the lowest points came when the gearbox locked up in Germany and caused a horrific accident (putting him out for the middle of the season). His high point was a best result of 7th in the world in Japan."]}, {"page": "Macau Grand Prix", "response": ["Macau is a special event for motorcycle riders. The Motorcycle Grand Prix has featured notable top-level riders, with winners of the race including MotoGP World Champion Kevin Schwantz, Superbike World Champion Carl Fogarty, notable MotoGP rider Ron Haslam and Isle of Man legends Michael Rutter, Michael Dunlop, and John McGuinness.  Because of the street circuit nature, the course is closer to the legendary British open-road races than a regulation MotoGP circuit.", "|  Carl Fogarty"]}, {"page": "Carl (name)", "response": ["*Carl Fogarty"]}, {"page": "Segrave Trophy", "response": ["| 100px|alt=Carl Fogarty in 2015"]}, {"page": "Bol d'Or", "response": ["| 1992 ||   Terry Rymer ||   Carl Fogarty ||   Steve Hislop || Kawasaki"]}, {"page": "Salzburgring", "response": ["| World SBK || 1:20.147 || Carl Fogarty || Ducati 916 R || 1995 Salzburgring World SBK round"]}, {"page": "Jonathan Rea", "response": ["becoming the first man ever to win six successive superbike world championships.  On 9 June 2018, Rea won the first race at Brno to take his 60th career win and surpass the record of Carl Fogarty."]}]}}