{"wiki_id": "http://www.wikidata.org/entity/Q42851191", "itemLabel": "Eddie Ryan", "itemDescription": "British professional wrestler (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Ryan", "wikipedia_page": {"main": "Vincent Rubio (born 5 November 1985), better known by the ring name Eddie Ryan, is a British professional wrestler currently active in the United Kingdom. Rubio, originally from Plymouth, England, started his in ring career in 2008 at the 4 Front Wrestling (4FW) training school. His first match was in January of the following year for 4FW under the ring name Eddie Reyes, being given the gimmick of a Spanish wrestler. Before representing England overseas in Japan and the United States, Rubio changed his ring name to Eddie Ryan, with an English gimmick.\nIn 2018, Rubio first appeared on national television channel FreeSports for 5 Star Wrestling, and later as a part of the NXT UK brand of World Wrestling Entertainment. Ryan is a seventeen time heavyweight champion, and held six tag team championships with his partner Jason Larusso, as a part of The Lionhearts, & Charlie Sterling as a part of \"Crazy Teacups\".", "link_mentions": [{"page": "Jed Allan", "response": ["|1974|| Kojak || Eddie Ryan || Dead on his Feet"]}, {"page": "Vincent Rubio", "response": ["#REDIRECT Eddie Ryan"]}, {"page": "Broadway Brevities", "response": ["|Bye-Gones || Alfred J. Goulding (director); Ruth Etting, Frank McNellis, David Burns, Eddie Ryan, Ruth Pine's Tiny Tots & Embassy Boys || © January 14", "|Cure It with Music || Joseph Henabery (director); Fifi D'Orsay, Eddie Ryan, the Chevaliers, Moore & Revel || © July 15", "|The Castle of Dreams || Roy Mack (director); Morton Downey, Arlene Dinitz, Eddie Ryan & Toto || © July 15"]}, {"page": "Ultimo Tiger", "response": ["On 21 August 2015 Tiger successfully defended the championship in a fatal-4-way match in Newton Abbot, defeating Gideon, John Harding and Eddie Ryan. Later that month, on 30 August, Tiger defeated JD Knight and defended the championship in Truro. In September 2015 Tiger took part in the 'Plex Wrestling King of the Brit's tournament, with his semi-final coming to a double-pin draw against El Ligero. He returned twice more in 2015 defeating Preston Sage & Lion Kid. He concluded 2015 as Catch Division Champion, winning another 4-way match at PWP Heroes & Legends 2, defeating Scotty Essex, Tiger Ali & Ho Ho Lun."]}, {"page": "4 Front Wrestling", "response": ["4FWs first show was held at Pinehurst People's Centre in 2005 'and so it begins' They had opened a wrestling school held at Cheney Manor, training wrestler's such as Saime Sahin, Tiger Ali and Eddie Ryan. In 2011, Owner and Promoter Dave Sharp retired from Pro Wrestling due to neck injuries, which lead to the promotion running more events."]}, {"page": "5 Star Wrestling", "response": ["|Eddie Ryan"]}, {"page": "Eddie Ryan (wrestler)", "response": ["#REDIRECT Eddie Ryan"]}]}}