{"wiki_id": "http://www.wikidata.org/entity/Q4296913", "itemLabel": "Chris Mitchell", "itemDescription": "British footballer (1988-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Mitchell_(Scottish_footballer)", "wikipedia_page": {"main": "Christopher Philip Mitchell (21 July 1988 – 7 May 2016) was a Scottish professional footballer who played as a defender or midfielder.\nMitchell began his senior career at Scottish Premier League club Falkirk who also loaned him to Ayr United. He then had a season in England with Bradford City before joining Queen of the South in 2012. In his first season at Queens he won the Scottish Challenge Cup and Scottish Football League Second Division. At the end of that season he was named in the division's PFA Scotland Team of the Year. Mitchell had a brief spell at Clyde in 2015–16.\nComplications from spinal surgery ended his professional career at Queen of the South, and he left Clyde to establish a new career. Mitchell suffered depression due to his change of career and took his own life at a level crossing at the age of 27.", "link_mentions": [{"page": "July 21", "response": ["*  1988   – Chris Mitchell, Scottish footballer (died 2016)"]}, {"page": "Lee Robinson (footballer)", "response": ["In the 2012–13 season Robinson was successful in a second penalty shoot-out for Queens when eliminating Rangers from the Challenge Cup at Ibrox. Robinson then made his 100th appearance for the club in a derby match against Stranraer on 16 February 2013. Robinson was instrumental in the 6–5 penalty shoot-out when Queens won the Challenge Cup versus Partick Thistle on 7 April 2013  and with the club also winning the Second Division this gained the club their inaugural league and cup double. Robinson was described as a \"hero\" by Dumfries and Galloway Standard newspaper. At the end of the 2012–13 season, Robinson was named in the PFA Scotland Team of the Year for the Second Division alongside teammates Chris Mitchell, Mark Durnan, Chris Higgins, Daniel Carmichael and Nicky Clark. Robinson was also awarded SFL Goalkeeper of the Season. Robinson was offered a new contract by the club which he then turned down."]}, {"page": "Chris Mitchell", "response": ["Chris Mitchell may refer to:", "* Chris Mitchell (journalist), Australian journalist", "* Chris Mitchell (Australian footballer) (born 1947), Australian rules footballer", "* Chris Mitchell (Scottish footballer) (1988–2016), Scottish footballer", "* Chris Mitchell (author), American author and journalist"]}, {"page": "2011–12 Bradford City A.F.C. season", "response": ["|align=\"left\"|16||align=\"left\"|MF||align=\"left\"| Chris Mitchell", "| Chris Mitchell", "| Chris Mitchell"]}, {"page": "Ross Hannah", "response": ["Hannah moved to Bradford City in May 2011, on a free transfer, two days before his 25th birthday. It was Hannah's first professional contract. Hannah made his debut for Bradford as an 84th-minute substitute for Chris Mitchell in a League Cup match against Leeds United. His first goal for the club came in the following match in a 1–1 draw against Oxford United. His third goal for Bradford came in a 3–1 win against AFC Wimbledon in the FA Cup, earning Bradford a place in the third round for the first time in seven years. He signed a one-year contract extension on 9 March 2012, exercising a clause in his original one-year contract, which was due to expire at the end of the season. Manager Phil Parkinson said that Hannah had \"earned\" the contract and that \"there is more to come from Ross in the future\". He joined Conference Premier club F.C. Halifax Town on loan in March 2012."]}, {"page": "Nicky Clark", "response": ["Clark was the SFL Division 2 Player of the Year for the 2012–13 season, and he also won the Ginger Boot Award for being the top scorer across all four Scottish divisions. Clark was also named in the PFA Scotland Team of the Year for the Second Division alongside team-mates Chris Mitchell, Mark Durnan, Chris Higgins, Daniel Carmichael and Lee Robinson."]}, {"page": "1988 in Scotland", "response": ["* 21 July – Chris Mitchell, footballer (died 2016)"]}, {"page": "PFA Scotland Team of the Year", "response": ["| DF || Chris Mitchell || Queen of the South ||align=\"center\"|1"]}, {"page": "Chris Mitchell (footballer born 1988)", "response": ["#REDIRECT Chris Mitchell (Scottish footballer)"]}, {"page": "Mental health in association football", "response": ["In May 2016, professional footballer Chris Mitchell committed suicide. In October 2018 his family spoke out about his struggles with mental health."]}, {"page": "2016 in association football", "response": ["* 7 May: Chris Mitchell, Scottish footballer (born 1988)"]}, {"page": "2015–16 in Scottish football", "response": ["*7 May: Chris Mitchell, 27, Falkirk, Ayr United, Bradford City, Queen of the South and Clyde midfielder."]}, {"page": "2015–16 in English football", "response": ["* 6 May 2016: Chris Mitchell, 27, Bradford City midfielder."]}, {"page": "2015–16 Queen of the South F.C. season", "response": ["| Chris Mitchell"]}, {"page": "2016 in the United Kingdom", "response": ["**Chris Mitchell, 27, footballer (Queen of the South, Clyde)."]}, {"page": "2016 in Scotland", "response": ["*6 May – Chris Mitchell, footballer (born 1988)"]}, {"page": "Deaths in May 2016", "response": ["*Chris Mitchell, 27, Scottish footballer (Queen of the South, Clyde), struck by train.Chris Mitchell: Former Clyde, QoS & Falkirk player dies aged 27"]}]}}