{"wiki_id": "http://www.wikidata.org/entity/Q430500", "itemLabel": "Amar", "itemDescription": "British Indian singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Amar_(British_singer)", "wikipedia_page": {"main": "Amar (born Amar Dhanjal) is a British Indian singer signed to the independent label Sunset Entertainment Group. She is also the daughter of Mangal Singh (a well-known singer in the UK and globally known for his \"Rail Gaddi\" song). She is a singer and songwriter who writes her own material. She has a unique style of combining her Hindi vocals, lyrics, and melodies with western urban producers.", "link_mentions": [{"page": "Mike Oldfield", "response": ["For his next instrumental album, Virgin insisted that Oldfield use the title Tubular Bells 2. Oldfield's rebellious response was Amarok, an hour-long work featuring rapidly changing themes, unpredictable bursts of noise and a hidden Morse code insult, stating \"Fuck off RB\", allegedly directed at Branson. Oldfield did everything in his power to make it impossible to make extracts and Virgin returned the favour by barely promoting the album.", "During the 1980s Oldfield became expert in the use of digital synthesizers and sequencers (notably the Fairlight CMI) which began to dominate the sound of his recordings: from the late 1990s onwards, he became a keen user of software synthesizers. He has, however, regularly returned to projects emphasising detailed, manually played and part-acoustic instrumentation (such as 1990's Amarok, 1996's Voyager and 1999's Guitars).", "* Amar", "* Amarok (1990)"]}, {"page": "List of one-word stage names", "response": ["* Amar (born 1982), British-Indian singer", "* Amarfis, Dominican singer-songwriter"]}, {"page": "Asian Underground", "response": ["*Amar (singer)"]}, {"page": "Tubular Bells III", "response": ["The tracks \"The Source of Secrets\", \"Jewel in the Crown\", and \"Secrets\" feature Amar as a vocalist. Oldfield can be heard on \"Outcast\". \"The Inner Child\" features Luar Na Lubre vocalist Rosa Cedrón. The live version of \"Man in the Rain\" was mostly sung by Helen Pepsi DeMacque, notably at the London Premiere of Tubular Bells III (1998). \"Far Above the Clouds\" features Clodagh Simonds performing the main vocals while the child's vocals are performed by Francesca Robertson."]}, {"page": "Tr3s Lunas", "response": ["Oldfield's sister, Sally makes a speaking appearance on this album.  The last previous Mike Oldfield album which she had appeared on was 1978's Incantations.  The main vocalist for \"To Be Free\" is the Jazz singer Jude Sim.  British-Asian vocalist called Amar, who first appeared on Tubular Bells III, also contributes vocals to the album.  The album was recorded at Oldfield's Roughwood Studios, with additional parts recorded at Plan 1 Studios, Munich.", "* Amar – Vocals"]}, {"page": "Kenza (album)", "response": ["#\"El Harba Wine\" (featuring Amar) – 4:33", "#\"El Harba Wine\" (featuring Amar) – 4:33"]}, {"page": "Guy Sigsworth", "response": ["One night in Mumbai, India, where he was producing a song for British artist Amar, Sigsworth composed a tune on his Yamaha QY20 pocket sequencer. As soon as he arrived back in London, he took it to Imogen Heap, and asked her to write a top line for it. It became \"Flicks\", their first song for what would become the Frou Frou album Details. Originally, there was no plan for Sigsworth and Heap to form a band. It was simply a matter of Sigsworth wanting to hear various song ideas properly realized. As Heap said: \"Every month or so, Guy would phone me up and say 'I've got a new song, would you come in and sing it?', and then before we knew it, we'd already started the album.\"", "* Amar \"Sometimes It Snows in April\" (2000) (production)"]}, {"page": "Amar", "response": ["Amar may refer to:", "* Amar (British singer) (born 1982), British Indian singer born Amar Dhanjal", "* Amar (Lebanese singer) (born 1986), born Amar Mahmoud Al Tahech", "* Amar Bose (1929–2013), Founder of Bose Corporation", "* Amar Gupta (born 1953), Indian computer scientist ", "*Amar Gegić, Bosnian basketball player", "* Amar Khan,  Pakistani director, writer and television actress", "* Amar Mehta (born 1990), Indian figure skater", "* Amar Singh ( 13th century), military general of Brahmachal", "* Amar Singh Thapa (1751–1816), Nepalese Badakaji", "* Amar Singh Thapa (sardar) (1759–1814), Nepalese General", "* Amar Talwar (born 1922), Bollywood and Television actor", "* Amar Upadhyay (born 1972), Indian Television actor", "* Akhil Amar (born 1958), American professor of law at Yale", "* David Amar (1920–2000), Moroccan Jewish businessman", "* Jean-Pierre-André Amar (1755–1816), politician in the French Revolution", "* Jo Amar (1930–2009), Moroccan-Israeli singer", "* Larry Amar (1972–2020), American field hockey player", "* Ludu Daw Amar (1915–2008), Burmese writer from Mandalay", "* Shlomo Amar (born 1948), the Sephardi Chief Rabbi of Israel", "* Vikram Amar (born  1963), American professor of law at UC Davis", "* Amar, India, a village in Gujarat", "* Amar al-Husn, a village in Homs Governorate, Syria", "* Amar (1), Kerman, a village in Iran", "* Amar (2), Kerman, a village in Iran", "* Amar (3), Kerman, a village in Iran", "* Amar, Lorestan, or Ammar, a village in Iran", "* Amar (1954 film), a Hindi-language Indian film", "* Amar (2017 film), a Spanish film", "* Amar (2019 film), a Kannada-language Indian film", "* \"Amar\" (song), a song by 2B, which represented Portugal in the Eurovision Song Contest 2005", "* Amar, a Klingon battlecruiser in Star Trek: The Motion Picture", "* Amarnath (disambiguation)"]}, {"page": "State of Bengal", "response": ["| Amar", "| Amar and Khaled"]}, {"page": "El harba wine", "response": ["\"El harba wine\" is a single from Khaled's album Kenza. \"El Harba Wine\" loosely translates to \"Run away, but where to?\". Khaled explains the title as \"You want to leave your country? Where do you want to go?\". The song is also sometimes referred to by the title \"El Harba\". The credited writers for the lyrics are Mohamed AngarKhaled and Lafon, M. Khaled: Derrière le sourire, Michel Lafon, 1998.  Khaled, Amar, and Mohamed Benhamadouche, and for the music Khaled and Idir.\"El Harba Wine\" at Discogs.com.", "A live version of the song was included in Khaled's live album Hafla. A rare flamenco inspired version of the song was included in Sahra's promotional CD. Khaled's 1999 album Kenza included a remake of \"El Harba Wine\" featuring Indian fused beats and Hindi verses sung by Amar.  Billboard described this version as a \"mesmerizing merging\" of Khaled and Amar's singing, \"equal parts world music and tribal house\".\"The Dance Trax: Hot Plate\", Billboard, May 20, 2000.", "Category:Amar (British singer) songs"]}, {"page": "Jim Beanz", "response": ["* Maneater (Jim Beanz Bhangra Remix) (featuring Amar) – producer", "* Promiscuous (Jim Beanz Bhangra Remix) (featuring Amar & Timbaland) – producer, background vocals", "* 12. \"Bombay\" (featuring Amar & Jim Beanz)", "* 01. \"My Addiction\" (featuring Amar)", "====Amar – Show It Off===="]}, {"page": "Anokha – Soundz of the Asian Underground", "response": ["The compilation was signed via Anokha's imprint label Omni Records to Island Records and led to major label deals for Talvin Singh, State of Bengal and Amar."]}, {"page": "Timbaland production discography", "response": ["# Bombay feat. Amar & Jim Beanz", "# If We Ever Meet Again feat. Katy Perry & Amar (US Mainstream Top 40 #25; US Hot 100 #37, January 18, 2010) (Single) (Produced With Jim Beanz)", "* Il Destino Di Chi Visse Per Amare", "* Vai Ad Amarti"]}, {"page": "Tubular Bells III Live", "response": ["* Amar – Vocals"]}, {"page": "Show It Off", "response": ["Show It Off is a 2010 music album by British Indian singer Amar.", "Category:Amar (British singer) albums"]}, {"page": "Outside (Amar album)", "response": ["Outside is an album by the British Indian singer Amar, released in 2000.", "The Guardian called the album \"wilfully eclectic,\" writing that \"the songs benefit from breaking things down to the essentials, fusing [Amar's] distinctive raw vocals with blissed-out tablas, keyboards and strings.\" The Birmingham Post wrote that the album weds \"a vocal style vaguely reminiscent of Kate Bush\" to \"breakbeats and lush orchestrations.\"", "Category:Amar (British singer) albums"]}, {"page": "So You Think You Can Dance Australia (season 3)", "response": ["|\"Bombay\"—Timbaland ft. Amar & Jim Beanz"]}, {"page": "Shankar–Ehsaan–Loy discography", "response": ["| \"Sajana\"(Show It Off) (with Amar)"]}, {"page": "Big Ali", "response": ["* 2008: \"Habibi\" (with Leslie and Amar)"]}, {"page": "UK Asian Music Awards", "response": ["* Best Female Act: Amar"]}, {"page": "Khaled (musician)", "response": ["|\"El harba wine\" (feat. Amar)", "| \"Albey\" || Amr Diab || Amarain"]}, {"page": "Urban Turban", "response": ["Urban Turban (subtitled Urban Turban - The Singhles Club) is a 2012 studio album by the British band Cornershop. It follows their 2011 album Cornershop and the Double 'O' Groove Of. Like their previous effort, the album consists mostly of collaborations; however, unlike its predecessor, which consisted solely of music with vocalist Bubbley Kaur, Urban Turban includes a variety of collaborators, including SoKo and Amar. The album originated as a project called The Singhles Club, in which the band sent subscribers a new song on a monthly basis via e-mail along with unique cover art. All six tracks from this project appear on the album.", "# \"Inspector Bamba Singh's Lament\" (featuring Amar) - 4:27 (Tjinder Singh and Amar)"]}, {"page": "Sometimes It Snows in April", "response": ["==Amar version==", "British Indian singer Amar recorded a cover version of the song for her album Outside. It was released as a single on 12 June 2000, and peaked at No. 48 on the UK Singles Chart. It also reached No. 6 on the UK Dance Singles Chart, due to the popular UK garage remix by Dreem House.", "Category:Amar (British singer) songs"]}, {"page": "List of UK garage songs", "response": ["|Amar"]}, {"page": "List of people from Walsall", "response": ["* Amar (born 1982), British Indian singer"]}]}}