{"wiki_id": "http://www.wikidata.org/entity/Q4302701", "itemLabel": "Ambrose James Moriarty", "itemDescription": "Catholic bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Ambrose_Moriarty", "wikipedia_page": {"main": "Ambrose James Moriarty (9 August 1870 – 3 June 1949) was an English prelate of the Roman Catholic Church. He served as the Bishop of Shrewsbury from 1934 to 1949. Samuel Webster Allen, his predecessor as fourth bishop, was his uncle.Born at 38 Mottram Street, Stockport, Cheshire on 9 August 1870, he was educated at Cotton College, Oscott, and the English College, Rome. He was ordained to the priesthood on 10 March 1894 and same year came to Shrewsbury to assist his uncle, then a canon at the cathedral there, serving as curate until 1897. He subsequently served the cathedral as priest-in-charge from 1897 to 1932, also as Canon Theologian from 1910, Vicar General from 1925 and Provost to the cathedral chapter from 1927.In Shrewsbury public life he was a member of the Shrewsbury Schools Board from 1898, and later Vice-Chairman of the Shrewsbury Education Committee which superseded the board in 1902. He was until his death member of the Shrewsbury Free Library Committee and the council of the Shropshire Archaeological Society.He was appointed Coadjutor Bishop of Shrewsbury and Titular Bishop of Miletopolis on 18 December 1931. His consecration to the Episcopate took place on 28 January 1932, the principal consecrator was Thomas Leighton Williams, Archbishop of Birmingham, and the principal co-consecrators were John Patrick Barrett, Bishop of Plymouth and Hugh Singleton, Bishop of Shrewsbury. Moriaty succeeded as the Bishop of Shrewsbury on 17 December 1934. He was made assistant to the Pontifical Throne in 1944, the year of his golden jubilee in priesthood, when he was presented with a cheque for £3,450 from the clergy and laity of his diocese, which he donated for the funding of training priests from the diocese at the English College.He died in office at his official residence, The Council House in Shrewsbury on 3 June 1949, aged 78, and was buried in the grave of his uncle in Shrewsbury General Cemetery in Longden Road following a pontifical Requiem Mass at Shrewsbury Cathedral.", "link_mentions": {}}}