{"wiki_id": "http://www.wikidata.org/entity/Q4307545", "itemLabel": "Armitage Robinson", "itemDescription": "British priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Armitage_Robinson", "wikipedia_page": {"main": "Joseph Armitage Robinson  (9 January 1858 – 7 May 1933) was a priest in the Church of England and scholar. He was successively Dean of Westminster (1902–1911) and of Wells (1911–1933).", "link_mentions": [{"page": "Glastonbury Abbey", "response": ["The ruins of Glastonbury Abbey were purchased by the Bath and Wells Diocesan Trust in 1908. The ruins are now the property of and managed by the Glastonbury Abbey trust. On acquiring the site the trust appointed Frederick Bligh Bond to direct an archaeological investigation. Bond discovered the Edgar Chapel, North Porch and St Dunstan's Chapel, however relations with his employers turned sour when he revealed in his 1919 book, The Gates of Remembrance, that he had made many of his interpretations in collaboration with a psychic medium. He was dismissed by Bishop Armitage Robinson in 1921, because of his use of seances and psychic archaeologyHill, p.156 but is remembered as the man who \"galvanised our cultural understanding of Glastonbury\"."]}, {"page": "Clementine literature", "response": ["It was long believed that the early date of the Clementines was proved by the fact that they were twice quoted by Origen. One of these quotations occurs in the Philokalia of Sts. Gregory of Nazianzus and Basil (c. 360). Dr. Armitage Robinson showed in his edition of that work (1893) that the citation is an addition to the passage of Origen made by the compilers, or possibly by a later editor. The other citation occurs in the old Latin translation of Origen on Matthew. This translation is full of interpolations and alterations, and the passage of Pseudo-Clement is apparently an interpolation by the translator from the Arian Opus imperfectum in Matt.Journal of Theological Studies, III, 436."]}, {"page": "Ecclesiastical Household", "response": ["* Armitage Robinson 1 January 1902 - October 1902 (replacing Gore), (resigned, appointed Dean)"]}]}}