{"wiki_id": "http://www.wikidata.org/entity/Q430720", "itemLabel": "Charles Brabin", "itemDescription": "American Film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Brabin", "wikipedia_page": {"main": "Charles Joseph Brabin (April 17, 1882 – November 3, 1957) was a British-American film director and screenwriter.", "link_mentions": [{"page": "1957", "response": ["** Charles Brabin, American director and screenwriter (b. 1882)"]}, {"page": "Mervyn LeRoy", "response": ["| Charles Brabin"]}, {"page": "1914 in film", "response": ["* The Necklace of Rameses (Thomas Edison Prods.) directed by Charles Brabin, starring William Bechtel and Gertrude Braun."]}, {"page": "1913 in film", "response": ["* The Foreman's Treachery (Edison Prods.) directed by Charles Brabin, starring Miriam Nesbitt and Marc MacDermottKinnard,Roy (1995). \"Horror in Silent Films\". McFarland and Company Inc. Page 55. ."]}, {"page": "Theda Bara", "response": ["Bara was one of the more popular actresses of the silent era and one of cinema's early sex symbols. Her femme fatale roles earned her the nickname \"The Vamp\" (short for vampire, here meaning a seductive woman), later fueling the rising popularity in \"vamp\" roles based in exoticism and sexual domination. The studios promoted a fictitious persona for Bara as an Egyptian-born woman interested in the occult. Bara made more than 40 films between 1914 and 1926, but most are now lost, having perished in the 1937 Fox vault fire. After her marriage to Charles Brabin in 1921, she made two more feature films and then retired from acting in 1926; she never appeared in a sound film.", "A 2016 book by Joan Craig and Beverly F. Stout chronicles many personal, first-hand accounts of the lives of Bara and her husband Charles Brabin.", "Bara married British-born American film director Charles Brabin in 1921. They honeymooned at The Pines Hotel in Digby, Nova Scotia, Canada, and later purchased a  property down the coast from Digby at Harbourville, Nova Scotia, overlooking the Bay of Fundy, eventually building a summer home they called Baranook. They had no children. Bara resided in a villa-style home in Cincinnati, which served as the \"honors villa\" at Xavier University. Demolition of the home began in July 2011.", "In May 2016, a memoir titled Theda Bara, My Mentor, Under the Wings of Hollywood's First Femme Fatale, by Joan Craig with Beverly Stout, was released. Young Joan, in the companionship of Bara during the 1940s and 1950s, includes tales of Bara's husband, Charles Brabin, friends Marion Davies, Clark Gable, Victor Fleming, and other stars of the past."]}, {"page": "List of film and television directors", "response": ["*Charles Brabin"]}, {"page": "Elinor Glyn", "response": ["*Six Days, directed by Charles Brabin (1923, based on the novel Six Days)"]}, {"page": "Gregg Toland", "response": ["|1932 || The Washington Masquerade || Charles Brabin || "]}, {"page": "John Van Druten", "response": ["*New Morals for Old, directed by Charles Brabin (1932, based on the play After All)"]}, {"page": "The Mask of Fu Manchu", "response": ["The Mask of Fu Manchu is a 1932 American pre-Code adventure film directed by Charles Brabin. It was written by Irene Kuhn, Edgar Allan Woolf and John Willard based on the 1932 novel of the same name by Sax Rohmer. Starring Boris Karloff as Fu Manchu, and featuring Myrna Loy as his depraved daughter, the film revolves around Fu Manchu's quest for the golden sword and mask of Genghis Khan. Lewis Stone plays his nemesis. Dr. Petrie is absent from this film.", "Category:Films directed by Charles Brabin"]}, {"page": "Estelle Taylor", "response": ["One of Taylor's early successes was in 1920 in Fox's While New York Sleeps with Marc McDermott. Charles Brabin directed the film, and Taylor and McDermott play three sets of characters in different time periods. This film was lost for decades, but has been recently discovered and screened at a film festival in Los Angeles. Her next film for Fox, Blind Wives (1920), was based on Edward Knoblock's play My Lady's Dress and reteamed her with director Brabin and co-star McDermott. William Fox then sent her to Fox Film's Hollywood studios to play a supporting role in a Tom Mix film. Just before she boarded the train for Hollywood, Brabin gave her some advice: \"Don't think of supporting Mix in that play. Don't play in program pictures. Never play anything but specials. Mr. Fox is about to put on Monte Cristo. You should play the part of Mercedes. Concentrate on that role and when you get to Los Angeles, see that you play it.\""]}, {"page": "Ben-Hur: A Tale of the Christ (1925 film)", "response": ["Shooting began in Rome, Italy in October 1923 under the direction of Charles Brabin who was replaced shortly after filming began. Additional recastings (including Ramon Novarro as Ben-Hur) and a change of director caused the production's budget to skyrocket. After two years of difficulties and accidents, the production was eventually moved back to Metro-Goldwyn-Mayer in Culver City, California and production resumed in the spring of 1925. B. Reeves Eason and Christy Cabanne directed the second unit footage.", "Category:Films directed by Charles Brabin "]}, {"page": "Edison Studios", "response": ["However, new restorations and screenings of Edison films in recent years contradict Everson's statement; indeed, Everson citing The Land Beyond the Sunset points out creativity at Edison beyond Porter and Collins, as it was directed by Harold M. Shaw (1877–1926), who later went on to a successful career directing in England, South Africa, and Lithuania before returning to the US in 1922.  Other important directors who started at Edison included Oscar Apfel, Charles Brabin, Alan Crosland, J. Searle Dawley, and Edward H. Griffith."]}, {"page": "David Belasco", "response": ["*La Belle Russe, directed by Charles Brabin (1919, based on the play La Belle Russe)"]}, {"page": "Thomas Burke (author)", "response": ["Other film adaptations have been based on Burke's stories as well. Charlie Chaplin derived A Dog's Life (1918) from Limehouse Nights, and Burke's book Twinkletoes (1926) was made into a movie of the same name, starring Colleen Moore, Tully Marshall, Gladys Brockwell, Lucien Littlefield, and Warner Oland, directed by Charles Brabin. Maurice Elvey's Curlytop (1924) combines a number of Limehouse scenes and other stories of Burke's were also used as material for Alfred Hitchcock Presents. The 1949 British spiv film No Way Back is based on Burke's Beryl and the Croucher."]}, {"page": "William John Locke", "response": ["*Stella Maris, directed by Charles Brabin (1925, based on the novel Stella Maris)"]}, {"page": "So Big (novel)", "response": ["A number of film adaptations of the novel have been made. The first adaptation, directed by Charles Brabin, was released the same year the novel was published, with Colleen Moore in her first significant dramatic role. The 1932 adaptation, directed by William A. Wellman, featured an ensemble cast led by Barbara Stanwyck, George Brent and Bette Davis. The most recent adaptation, directed by Robert Wise in 1953, starred Jane Wyman and Sterling Hayden. This one softened the ending considerably by including a reconciliation between Dirk and his mother."]}, {"page": "What Happened to Mary", "response": ["What Happened to Mary (sometimes erroneously referred to as What Happened to Mary?) is the first serial film made in the United States. Produced by Edison Studios, with screenplays by Horace G. Plympton, and directed by Charles Brabin, the action films starred Mary Fuller.", "Category:Films directed by Charles Brabin"]}, {"page": "June Mathis", "response": ["For the original production of Ben Hur (1925), Mathis fought the studio over the casting and production for many months. It was her idea to film the $1 million script in Italy; the film would eventually come in just under $4 million. When she arrived the original director Charles Brabin, in his words, refused to let her \"interfere\". The production troubles were numerous, and due to political troubles engulfing Italy at the time, resulted in disputes and delayed permissions. When the sea battle was filmed near Livorno, Italy, many extras had apparently lied about being able to swim. The first attempt to film the chariot race was on a set in Rome, but there were problems with shadows and the racetrack surface. One of the chariots' wheels came apart and the stuntman driving it was thrown in the air and killed."]}, {"page": "Henri Bernstein", "response": ["*The Washington Masquerade, directed by Charles Brabin (English, 1932, based on the play La Griffe)"]}, {"page": "The Bridge of San Luis Rey (1929 film)", "response": ["The Bridge of San Luis Rey (1929) is a film released by Metro-Goldwyn-Mayer in both silent and part-talkie versions. The film was directed by Charles Brabin and starred Lili Damita and Don Alvarado. Only the silent version exists at the George Eastman House film archive.", "Category:Films directed by Charles Brabin"]}, {"page": "List of film serials", "response": ["| Charles Brabin", "| Charles Brabin", "| Charles Brabin"]}, {"page": "Lowell Sherman", "response": ["| Charles Brabin"]}, {"page": "St Francis Xavier's College, Liverpool", "response": ["* Charles Brabin –  American film director"]}, {"page": "George Westmore", "response": ["| Charles Brabin"]}, {"page": "The Beast of the City", "response": ["The Beast of the City is a 1932 American pre-Code gangster film featuring cops as vigilantes and known for its singularly vicious ending. Written by W.R. Burnett, Ben Hecht (uncredited), and John Lee Mahin, and directed by Charles Brabin, the film stars Walter Huston, Jean Harlow, Wallace Ford, Jean Hersholt, and Tully Marshall.", "Category:Films directed by Charles Brabin"]}, {"page": "Mismates", "response": ["Mismates is a 1926 silent film starring Doris Kenyon and Warner Baxter.  The movie was written by Sada Cowan from a play by Myron C. Fagan and directed by Charles Brabin. This film is now lost.Mismates at silentera.comThe American Film Institute Catalog Feature Films: 1921-30 by The American Film Institute, c. 1971Mismates, Arne Andersen's Lost Film Files: First National Pictures ", "Category:Films directed by Charles Brabin"]}, {"page": "List of film serials by studio", "response": ["|Charles Brabin", "|Charles Brabin", "|Charles Brabin"]}, {"page": "Becky Sharp", "response": ["The first film version of Vanity Fair was released in 1915. This was a silent movie directed by Charles Brabin and also starring Fiske in the main role. Another silent version, directed by Walter Courtney Rowden and starring Kyrie Bellew, was made and released in Britain seven years later. The following year saw another silent production released by Samuel Goldwyn; this was directed by Hugo Ballin and starred his wife, Mabel, as Sharp. The film is now considered lost."]}, {"page": "List of American films of 1930", "response": ["|Call of the Flesh||Charles Brabin||Ramón Novarro, Dorothy Jordan, Ernest Torrence||Musical/Romance/Drama||MGM. In partial Technicolor. ", "|The Ship from Shanghai||Charles Brabin||Conrad Nagel, Kay Johnson||Melodrama||MGM"]}, {"page": "List of American films of 1931", "response": ["|The Great Meadow || Charles Brabin || Johnny Mack Brown, Eleanor Boardman, Anita Louise || Adventure || MGM", "|Sporting Blood || Charles Brabin || Clark Gable, Madge Evans, Ernest Torrence || Sports || MGM"]}, {"page": "List of American films of 1932", "response": ["|The Beast of the City||Charles Brabin ||Walter Huston, Jean Harlow, Wallace Ford ||Drama, Crime || MGM", "|The Mask of Fu Manchu||Charles Brabin ||Boris Karloff, Lewis Stone, Karen Morley ||Horror, Sci-Fi || MGM", "|New Morals for Old || Charles Brabin || Robert Young, Lewis Stone || Romance || MGM", "|Rasputin and the Empress||Charles Brabin||John Barrymore, Lionel Barrymore, Ethel Barrymore||Drama|| MGM", "|The Washington Masquerade || Charles Brabin || Lionel Barrymore, Karen Morley || Drama || MGM"]}, {"page": "List of American films of 1933", "response": ["|Day of Reckoning||Charles Brabin||Richard Dix, Una Merkel, Stuart Erwin ||Drama || MGM", "|The Secret of Madame Blanche|| Charles Brabin|| Irene Dunne, Lionel Atwill || Drama || MGM", "|Stage Mother || Charles Brabin || Alice Brady, Maureen O'Sullivan || Drama || MGM"]}, {"page": "List of American films of 1934", "response": ["|A Wicked Woman||Charles Brabin||Mady Christians, Jean Parker, Charles Bickford||Drama|| MGM"]}, {"page": "List of American films of 1920", "response": ["| Blind Wives || Charles Brabin || Marc McDermott, Estelle Taylor || Drama || Fox Film", "| While New York Sleeps || Charles Brabin || Estelle Taylor, Marc McDermott || Crime || Fox Film"]}, {"page": "List of American films of 1921", "response": ["| Footfalls || Charles Brabin || Tyrone Power Sr., Estelle Taylor || Mystery || Fox"]}, {"page": "List of American films of 1922", "response": ["| The Broadway Peacock || Charles Brabin || Pearl White, Joseph Striker || Drama || Fox Film", "| The Lights of New York || Charles Brabin || Estelle Taylor, Charles K. Gerrard || Drama || Fox Film"]}, {"page": "List of American films of 1923", "response": ["| Driven || Charles Brabin || Emily Fitzroy, Burr McIntosh || Romance || Universal", "| Six Days || Charles Brabin || Corinne Griffith, Frank Mayo, Myrtle Stedman || Drama || Goldwyn"]}, {"page": "List of American films of 1924", "response": ["|So Big || Charles Brabin || Colleen Moore, Joseph De Grasse || Drama || First National"]}, {"page": "List of American films of 1925", "response": ["|Stella Maris || Charles Brabin || Mary Philbin, Elliott Dexter || Drama || Universal"]}, {"page": "List of American films of 1926", "response": ["|Mismates || Charles Brabin || Doris Kenyon, Warner Baxter || Drama || First National", "|Twinkletoes || Charles Brabin || Colleen Moore, Kenneth Harlan || Romance || First National"]}, {"page": "List of American films of 1927", "response": ["|Framed || Charles Brabin || Milton Sills, Natalie Kingston || Drama || First National", "|Hard-Boiled Haggerty || Charles Brabin || Milton Sills, Molly O'Day || War comedy || First National", "|The Valley of the Giants || Charles Brabin || Milton Sills, Doris Kenyon || Adventure || First National"]}, {"page": "List of American films of 1928", "response": ["|Burning Daylight || Charles Brabin || Milton Sills, Doris Kenyon || Adventure || First National ", "|The Whip || Charles Brabin || Dorothy Mackaill, Ralph Forbes, Anna Q. Nilsson || Drama || First National"]}, {"page": "List of American films of 1929", "response": ["| The Bridge of San Luis Rey || Charles Brabin || Lili Damita, Ernest Torrence || Historical || MGM"]}, {"page": "List of American films of 1919", "response": ["|Thou Shalt Not || Charles Brabin || Evelyn Nesbit, Crauford Kent || Drama || Fox Film"]}, {"page": "List of American films of 1918", "response": ["| Breakers Ahead  || Charles Brabin || Viola Dana, Clifford Bruce, Mabel Van Buren || Drama || Metro", "| Buchanan's Wife || Charles Brabin || Virginia Pearson, Marc McDermott, Victor Sutherland || Drama || Fox", "| His Bonded Wife || Charles Brabin || Emmy Wehlen, Creighton Hale || Comedy drama || Metro", "| A Pair of Cupids || Charles Brabin || Francis X. Bushman, Beverly Bayne || Comedy || Metro", "| The Poor Rich Man|| Charles Brabin || Francis X. Bushman, Beverly Bayne, Stuart Holmes || Comedy || Metro"]}, {"page": "List of American films of 1917", "response": ["| The Adopted Son || Charles Brabin || Francis X. Bushman, Beverly Bayne || Drama || Metro", "| Babette || Charles Brabin ||  Marc McDermott, Peggy Hyland || Drama || Vitagraph", "| Mary Jane's Pa || Charles Brabin, William P.S. Earle || Marc McDermott, Eulalie Jensen || Drama || Vitagraph", "| Persuasive Peggy || Charles Brabin || Peggy Hyland, William B. Davidson || Comedy || Independent", "| Red, White and Blue Blood || Charles Brabin || Francis X. Bushman, Beverly Bayne || Comedy || Metro", "| The Sixteenth Wife || Charles Brabin || Peggy Hyland, Marc McDermott || Comedy || Vitagraph"]}]}}