{"wiki_id": "http://www.wikidata.org/entity/Q4309861", "itemLabel": "James Bolivar Manson", "itemDescription": "British artist (1879-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Bolivar_Manson", "wikipedia_page": {"main": "James Bolivar Manson (26 June 1879 in London – 3 July 1945 in London) was an artist and worked at the Tate gallery for 25 years, including serving as its director from 1930 to 1938. In the Tate's own evaluation he was the \"least successful\" of their directors. His time there was frustrated by his stymied ambition as a painter and he declined into alcoholism, culminating in a drunken outburst at an official dinner in Paris. Although his art policies were more advanced than previously at the Tate and embraced Impressionism, he stopped short of accepting newer artistic movements like Surrealism and German Expressionism, thus earning the scorn of critics such as Douglas Cooper. He retired on the grounds of ill health and resumed his career as a flower painter until his death.", "link_mentions": [{"page": "Tate", "response": ["* James Bolivar Manson (1930 to 1938)"]}, {"page": "Art of the United Kingdom", "response": ["File:Manson-Lucien-Pissaro-Reading.jpg|James Bolivar Manson, Lucien Pissarro Reading c. 1913"]}, {"page": "Alleyn's School", "response": ["*James Bolivar Manson (1879–1945), painter and director of Tate Gallery, 1930–1938", "* James Bolivar Manson"]}, {"page": "Four Seasons Hotel George V", "response": ["*James Bolivar Manson"]}, {"page": "National Museum of Serbia", "response": ["Includes painters usually from the late 19th century, mostly impressionist and post-impressionist. The vast majority of the collection was donated by Prince Paul of Yugoslavia before World War II. In collection is 64 paintings and watercolors and 51 graphics and etchings. They include painters such as Alfred Sisley, Charles Conder, Philip Wilson Steer, Walter Sickert, Hermione Hammond, James Bolivar Manson, Wyndham Lewis, Roger Fry, Duncan Grant, Vanessa Bell and Rowland Fisher,http://www.27mart.com/arch/68/UP_13_016.jpg and graphic works from William Hogarth.", "*James Bolivar Manson, Still Life with Flowers, View from Houton Sussex"]}, {"page": "Lucien Pissarro", "response": ["In 1916 Pissarro became a British citizen. While in Britain he was one of the founders of the Camden Town Group of artists. In 1919,Buckman, David (2006), Dictionary of Artists in Britain since 1945 Volume 2, p. 1056. Art Dictionaries Ltd, Bristol.  he formed the Monarro Group with J.B. Manson as the London Secretary and Théo van Rysselberghe as the Paris secretary, aiming to show artists inspired by Impressionist painters, Claude Monet and Camille Pissarro. The group ceased three years later.\"James Bolivar Manson\", Tate collection online, material from Mary Chamot, Dennis Farr and Martin Butlin, The Modern British Paintings, Drawings and Sculpture, London 1964, II. Retrieved 18 December 2007."]}, {"page": "JB Manson", "response": ["#REDIRECT James Bolivar Manson"]}]}}