{"wiki_id": "http://www.wikidata.org/entity/Q431034", "itemLabel": "Florence Baker", "itemDescription": "explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Florence_Baker", "wikipedia_page": {"main": "Florence, Lady Baker or Florica Maria Sas; Barbara Szász; Maria Freiin von Sass; Barbara Szasz; Barbara Maria Szász; Barbara Maria Szasz (6 August 1841 – 11 March 1916) was a Hungarian-born British explorer. Born in Transylvania (then Kingdom of Hungary), she became an orphan when her parents and brother were murdered by the Romanian marauders led by Ioan Axente Sever and Simion Prodan who killed approximately 1000 predominantly Hungarian civilians in Nagyenyed on 8–9 January, 1849. She fled with the remains of the Hungarian army to the Ottoman Empire, to Vidin. Here she disappeared as child only to be seen in 1859 by Samuel Baker who rescued her. While Baker was visiting the Duke of Atholl on his shooting estate in Scotland, he befriended Maharaja Duleep Singh and in 1858–1859, the two partnered an extensive hunting trip in central Europe and the Balkans, via Frankfurt, Berlin, Vienna and Budapest. On the last part of the voyage, Baker and the Maharajah hired a wooden boat in Budapest, which was eventually abandoned on the frozen Danube. The two continued into Vidin where, to amuse the Maharajah, Baker went to the Vidin slave market. There, Baker fell in love with a white slave girl, Florence, destined for the Ottoman Pasha of Vidin. He was outbid by the Pasha but bribed the girl's attendants and they ran away in a carriage together and eventually she became his lover and wife and accompanied him everywhere he journeyed. They are reported to have married, most probably in Bucharest, before going to Dubrushka, but Sir Samuel certainly promised that they would go through another ceremony on their return to England – where they had a family wedding in 1865.\nTogether they went in search of the source of the River Nile and found Lake Albert. They journeyed to Samuel Baker's home in England where they were married and she became Lady Baker. She later returned to Africa with her husband to try and put down the slave trade. They both retired and died in Devon.\n\n", "link_mentions": {}}}