{"wiki_id": "http://www.wikidata.org/entity/Q4328435", "itemLabel": "John Nash", "itemDescription": "British artist, illustrator, painter and wood-engraver (1893-1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Nash_(artist)", "wikipedia_page": {"main": "John Northcote Nash  (11 April 1893 – 23 September 1977) was a British painter of landscapes and still-lives, and a wood engraver and illustrator, particularly of botanic works. He was the younger brother of the artist Paul Nash.", "link_mentions": [{"page": "John Nash", "response": ["John Nash may refer to:", "*John Nash (architect) (1752–1835), Anglo-Welsh architect", "*John Nash Round, English architect active in the mid-19th-century Kent", "*\"Jolly\" John Nash (1828–1901), English music hall entertainer", "*John Nash (artist) (1893–1977), English painter and engraver", "*John Nash (MP) (1590–1661), English merchant and politician who sat in the House of Commons between 1640 and 1648", "*John Nash (Australian politician) (1857–1925), New South Wales politician", "*John Nash, Baron Nash (born 1949), British peer, government minister and businessman", "*John Nash (footballer) (1867–1939), English footballer", "*John Nash (cricket administrator) (1906–1977), English Secretary of Yorkshire County Cricket Club, 1931–1971", "*John Nash (basketball), American basketball executive", "*John Nash (priest) (1879–?), Archdeacon of Tuam"]}, {"page": "River Stour, Suffolk", "response": ["The Stour valley has been portrayed as a working river by John Constable, Thomas Gainsborough, Alfred Munnings, John Nash and Cedric Morris. Constable's connection with the area was especially important, evident in such works as The Stour Valley and Dedham Church c. 1815. Today much of the Stour valley is designated an Area of Outstanding Beauty.John Nash settled in the Stour valley and is buried at St Andrew's at Wormingford , one of its typically serene small settlements. "]}, {"page": "Kenneth Clark", "response": ["With an empty gallery to preside over, Clark contemplated volunteering for the Royal Naval Volunteer Reserve, but was recruited, at Lord Lee's instigation, into the newly-formed Ministry of Information, where he was put in charge of the film division, and was later promoted to be controller of home publicity.Stourton, pp. 178–179, and 184 He set up the War Artists' Advisory Committee, and persuaded the government to employ official war artists in considerable numbers.  There were up to two hundred engaged under Clark's initiative. Those designated \"official war artists\" included Edward Ardizzone, Paul and John Nash, Mervyn Peake, John Piper and Graham Sutherland.Foss, pp. 196–201 Artists employed on short-term contracts included Jacob Epstein, Laura Knight, L. S. Lowry, Henry Moore and Stanley Spencer.Foss, p. 202"]}, {"page": "Imperial War Museum", "response": ["The museum's art collection includes paintings, prints, drawings, sculpture, and works in film, photography and sound. The collection originated during the First World War, when the museum acquired works that it had itself commissioned, as well as works commissioned by the Ministry of Information's British War Memorials Committee. As early as 1920 the art collection held over 3,000 works and included pieces by John Singer Sargent, Wyndham Lewis, John Nash and Christopher Nevinson. Notable First World War works include Sargent's Gassed and other works commissioned for an, unbuilt, Hall of Remembrance. The collection expanded again after the Second World War, receiving thousands of works sponsored by the Ministry of Information's War Artists' Advisory Committee."]}, {"page": "1893 in art", "response": ["* April 11 – John Nash, English painter, illustrator, and engraver (died 1978)"]}, {"page": "Iver", "response": ["* John Nash (1893–1977), painter of landscape and still-life, grew up in Iver", "* Paul Nash, WW1 and WW2 War Artist older brother of John Nash, buried in Langley in family plot"]}, {"page": "Meadle", "response": ["Meadle was the home of John Nash, one of England's foremost painters and war artists of the inter-war years.  He moved there in 1922 and started his great period of landscape water colours, wood engraving and botanical paintings, drawing on the natural scenes and rural activities of the surrounding countryside: the Vale of Aylesbury and the Chiltern Hills. He moved on during the Second World War to settle in East Anglia.  The house in which he lived, Lane End, still exists."]}, {"page": "Dora Carrington", "response": ["In 1910, she went to the Slade School of Art in central London where she subsequently won a scholarship and several other prizes; her fellow students included Dorothy Brett, Paul Nash, Christopher R. W. Nevinson and Mark Gertler. All at one time or another were in love with her, as was Nash's younger brother John Nash, who hoped to marry her. Gertler pursued Carrington for a number of years, and they had a brief sexual relationship during the years of the First World War."]}, {"page": "Gwen Raverat", "response": ["Gwen Raverat was a founding  member of the Society of Wood Engravers, which held an annual exhibition that included works from other artists such as David Jones, John Nash,  Paul Nash, Paul Gauguin and Clare Leighton”SWE.\" SWE | Cornwall artists index. N.p., n.d. Web. 06 Mar. 2017."]}, {"page": "War artist", "response": ["*John Nash CBE RA, 1893–1977.; also a war artist in World War II."]}, {"page": "Paul Nash (artist)", "response": ["He was the older brother of the artist John Nash."]}, {"page": "Golden Cockerel Press", "response": ["The first book for which Gibbings was entirely responsible was Moral Maxims by Rochefoucault (1924). Eric Gill was brought into the fold when he quarrelled with Hilary Pepler over the publication of Enid Clay's Sonnets and Verses (1925) and transferred the book to Gibbings. In 1925 he went on to commission engravings from John Nash, Noel Rooke, David Jones, John Farleigh and Mabel Annesley among others."]}, {"page": "Wood engraving", "response": ["*John Nash"]}, {"page": "Rupert Lee", "response": ["Between 1919 and 1922 he collaborated closely with Paul and John Nash producing wood engravings for the Sun Calendar Yearbook and the Poetry Bookshop. At this period his paintings and wood engravings were bought by notable collectors such as Arnold Bennett, Roger Fry and Edward Marsh. Turning his attention to sculpture during the 1920s, he was elected President of the London Group in 1927 and was responsible for organising the important open-air sculpture exhibition on the roof gardens of Selfridges in 1930, after which he became affiliated with Duncan Grant and Vanessa Bell of the Bloomsbury Group. He was Chairman of the 1936 International Surrealist Exhibition at the New Burlington Galleries and worked tirelessly to encourage the modern movement in England. Moving to Spain in 1946, Lee was killed in a motor accident in 1959."]}, {"page": "Eric Ravilious", "response": ["On returning from Norway, Ravilious was posted to Portsmouth from where he painted submarine interiors at Gosport and coastal defences at Newhaven. After Ravilious's third child was born in April 1941, the family moved out of Bank House to Ironbridge Farm near Shalford, Essex. The rent on this property was paid partly in cash and partly in paintings, which are among the few private works Ravilious completed during the war. In October 1941 Ravilious transferred to Scotland, having spent six months based at Dover. In Scotland, Ravilious first stayed with John Nash and his wife at their cottage on the Firth of Forth and painted convoy subjects from the signal station on the Isle of May. At the Royal Naval Air Station in Dundee, Ravilious drew, and sometimes flew in, the Supermarine Walrus seaplanes based there.", "A touring exhibition organised by the Victor Batte-Lay Trust named \"Eric Ravilious 1903 – 1942\" was held at The Minories, Colchester in 1972. The Minories held an exhibition on graphic art and book illustration in 2009, named \"Graphic art and the art of illustration\" which featured Ravilious.Graphic art and the art of illustration: Paul Nash, John Nash, Eric Ravilious, Edward Bawden and their circle. The Minories, Colchester. 2009", "In 2017, The Towner Gallery marked the 75th anniversary of Ravilious' death with Ravilious & Co: The Pattern of Friendship, a exhibition that explored the relationships and working collaborations between Ravilious and a group of his friends and affiliates, including Paul Nash, John Nash, Enid Marx, Barnett Freedman, Tirzah Garwood, Edward Bawden, Thomas Hennell, Douglas Percy Bliss, Peggy Angus, Diana Low and Helen Binyon."]}, {"page": "Society of Wood Engravers", "response": ["* John Nash"]}, {"page": "List of British artists", "response": ["* John Nash (1893–1977) – English painter, illustrator, and engraver"]}, {"page": "David Gentleman", "response": ["David William Gentleman  (born 11 March 1930) is an English artist. He studied art and painting at the Royal College of Art under Edward Bawden and John Nash. He has worked in watercolour, lithography and wood engraving, at scales ranging from platform-length murals for Charing Cross Underground Station in London to postage stamps and logos."]}, {"page": "1977 in art", "response": ["* 23 September – John Nash, English painter, illustrator, and engraver (b. 1893)."]}, {"page": "1916 in art", "response": ["* November – John Nash arrives with the Artists Rifles in France."]}, {"page": "1918 in art", "response": ["* John Nash"]}, {"page": "Adrian Bell", "response": ["Bell wrote the \"Countryman’s Notebook\" column in the Eastern Daily Press from 1950, and produced over twenty other books on the countryside, including Apple Acre (1942), Sunrise to Sunset (1944), The Budding Morrow (1946), The Flower and the Wheel (1949), Music in the Morning, (1954), A Suffolk Harvest (1956), the autobiographical My Own Master (1961) and The Green Bond (1976). Bell was friendly with many literary and cultural figures, including Edmund Blunden, F.R. Leavis, H.J. Massingham, Alfred Munnings, John Nash and Henry Williamson.K D M Snell. Bell, Adrian Hanbury, in the Oxford Dictionary of National Biography, 2004"]}, {"page": "List of Old Wellingtonians", "response": ["*John Nash (1893–1977) 20th-century painter and war artist"]}, {"page": "World War I", "response": ["This has become the most common perception of World War I, perpetuated by the art, cinema, poems, and stories published subsequently. Films such as All Quiet on the Western Front, Paths of Glory and King and Country have perpetuated the idea, while war-time films including Camrades, Poppies of Flanders, and Shoulder Arms indicate that the most contemporary views of the war were overall far more positive. Likewise, the art of Paul Nash, John Nash, Christopher Nevinson, and Henry Tonks in Britain painted a negative view of the conflict in keeping with the growing perception, while popular war-time artists such as Muirhead Bone painted more serene and pleasant interpretations subsequently rejected as inaccurate. Several historians like John Terraine, Niall Ferguson and Gary Sheffield have challenged these interpretations as partial and polemical views:"]}, {"page": "Ronald Blythe", "response": ["Blythe briefly served during the Second World WarHouse, Christian. \"Ronald Blythe: My not so quiet village life\", The Independent, 11 November 2012. Retrieved 24 November 2012. and spent the ten years up to 1954 working as a reference librarian in Colchester, where he founded the Colchester Literary Society. Through his work at the library he met Christine Nash, wife of the artist John Nash; she was looking for the score of Idomeneo.  Christine Nash introduced Blythe to her husband, inviting him to their house, Bottengoms Farm near Wormingford on the border of Essex and Suffolk; he visited first in 1947. She later encouraged his ambitions to be a writer, finding him a small house on the Suffolk coast near Aldeburgh.Lambirth, Andrew. \"Bookends: Spirit of place\", The Spectator, 5 November 2011. Retrieved 6 November 2012.", "In the 1970s Blythe nursed John Nash in ill health.  His book The View in Winter is a consideration of old age. In 1977 Blythe inherited Bottengoms Farm from Nash, who had bought the Elizabethan yeoman's house in 1944.Parker, Peter. \"At the Yeoman's House and At Helpston by Ronald Blythe: review\", The Daily Telegraph, 23 December 2011. Retrieved 7 November 2012. He later published a book, First Friends (1999), based on a trunk of letters he found in the house that recorded the friendship between the Nash brothers, John's future wife, Christine Külenthal, and the artist Dora Carrington.\"Dora Carrington: a difficult virus to get out of your system\", The Independent, 24 October 1999. Retrieved 7 November 2012.Vincent, David. \"Amazon review: First Friends by Ronald Blythe\", Amazon.com. Retrieved 7 November 2012."]}, {"page": "Cedric Morris", "response": ["In 1946, along with Henry Collins, Lett Haines, John Nash and Roderic Barrett, Morris became one of the founders of Colchester Art Society and later the society's president."]}, {"page": "Nash brothers", "response": ["The Nash brothers were two British artists, Paul Nash (11 May 1889 – 11 July 1946) and John Nash (11 April 1893 – 23 September 1977). Both were noted war artists."]}, {"page": "Charles Ginner", "response": ["In 1910 Ginner went to London, to serve on the Hanging Committee of the Allied Artists Association's third exhibition. Harold Gilman and Spencer Gore became his friends and persuaded him to settle in London. He lived at first in Battersea, but afterwards in Camden Town, where he was a neighbour of Gilman and Gore and regularly attended the Saturday afternoons at 19 Fitzroy Street, meeting Robert Bevan, John Nash, Albert Rothenstein, Christopher R. W. Nevinson, Jacob Epstein, Walter Bayes, Walter Sickert and Lucien Pissarro. In 1911, he became a member of the Camden Town Group; in 1913 of the London Group; in 1914 of the Cumberland Market Group.\"Cumberland Market Group\", Grove Art Online(subscription). Retrieved 20 September 2008. In 1914 in the New Age he spelt out the artistic creed known as New Realism. In the same year he showed jointly with Gilman at the Goupil Gallery."]}, {"page": "Ariel Poems (Faber)", "response": ["# The Early Whistler by Wilfred Gibson, drawings by John Nash"]}, {"page": "Wormingford", "response": ["The artist John Constable of East Bergholt (1776–1837), had Wormingford associations, his relatives farming at Wormingford Hall and Gernons. John Nash R.A., who lived at Bottengoms, painted in and around the village from 1929 until 1977."]}, {"page": "Royal Holloway, University of London", "response": ["Royal Holloway has a collection of important paintings, sculptures, prints, drawings and watercolours from the 17th century and later. Artists include Sir John Everett Millais, Edward Burne-Jones, Christopher Nevinson, John Nash and Dame Laura Knight. The gallery is in Founder’s and is open to the public every Wednesday during the autumn and spring terms and some weekends throughout the year. At the heart of the collections are the legacies of two Victorian collectors: founder Thomas Holloway and artist Christiana Herringham (1852–1929). Their collections have been enhanced with additional acquisitions and commissions. Following the death of Herringham part of her eclectic art collection, including paintings by her and other women artists as well as Indian miniatures and Japanese woodblock prints, was given to Bedford College by her husband. Having merged with Royal Holloway, these are now part of Royal Holloway's art collection. Several items are on display on the Victorian corridor including a very personal portrait of her children. Other items can be seen by appointment."]}, {"page": "Robert Gibbings", "response": ["The first book for which Gibbings was entirely responsible was Moral Maxims by Rochefoucault (1924). Eric Gill was brought into the fold when he quarrelled with Hilary Pepler over the publication of Enid Clay's Sonnets and Verses (1925) and transferred the book to Gibbings. In 1925 he went on to commission engravings from John Nash, Noel Rooke, David Jones, John Farleigh and Mabel Annesley among others."]}, {"page": "Brenda Rawnsley", "response": ["The selected artists were asked to produce a lithograph using no more than six colours, to help with mass production. Artists in the first two series of prints produced in 1946 and 1947 included John Nash (Harvesting, 1947), Feliks Topolski, John Skeaping, David Gentleman, Edwin La Dell (Tower of London, 1945), Hans Feibusch, L.S. Lowry (Punch and Judy, 1946), Michael Rothenstein, Julian Trevelyan (Harbour, 1946) and John Tunnard. The lithographs were printed from stone or zinc plates by Thomas Griffiths and the Baynard Press."]}, {"page": "Arthur Lett-Haines", "response": ["In 1946, along with Henry Collins, Cedric Morris, John Nash and Roderic Barrett, Lett Haines became one of the founders of Colchester Art Society and later the Society's President."]}]}}