{"wiki_id": "http://www.wikidata.org/entity/Q432784", "itemLabel": "Margaret Archer", "itemDescription": "British sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Archer", "wikipedia_page": {"main": "Margaret Scotford Archer  (born 20 January 1943) is an English sociologist, who spent most of her academic career at the University of Warwick where she was for many years Professor of Sociology.  She was also a professor at l'Ecole Polytechnique Fédérale de Lausanne, Switzerland. She is best known for coining the term elisionism in her 1995 book Realist Social Theory: The Morphogenetic Approach. On 14 April 2014, Archer was named by Pope Francis to succeed former Harvard law professor and US Ambassador to the Holy See Mary Ann Glendon as President of the Pontifical Academy of Social Sciences, and served in this position until her retirement on 27 March 2019.", "link_mentions": [{"page": "University of Warwick", "response": ["In academia, people associated with Warwick include: Nobel Prize in Chemistry (1975) winner Sir John Cornforth who was a Professor at Warwick; mathematicians Ian Stewart, David Preiss, David Epstein and Fields Medallist Martin Hairer; computer scientists Mike Cowlishaw and Leslie Valiant; and neurologist Oliver Sacks. In arts and the social sciences: Nobel Laureate Oliver Hart; economist and President of the British Academy Nicholas Stern, Baron Stern of Brentford; academic and Provost of Worcester College Sir Jonathan Bate; academic and journalist Germaine Greer; literary critic Susan Bassnett; historians Sir J. R. Hale and David Arnold;  economist Andrew Oswald; economic historian Robert Skidelsky, Baron Skidelsky; Lady Margaret Archer, theorist in critical realism, former Warwick lecturer and accelerationist philosopher Nick Land, former President of International Sociological Association, current president of Pontifical Academy of Social Sciences; Sir George Bain, former Principal of London Business School; John Williamson, English economist who coined the term Washington Consensus; Susan Strange, British scholar of international relations who was almost single-handedly responsible for creating international political economy; Avinash Dixit, former President of the Econometric Society and American Economic Association, elected to the American Academy of Arts and Sciences in 1992 and the National Academy of Sciences in 2005; Robert Calderbank, winner of the IEEE Richard W. Hamming Medal and the Claude E. Shannon Award; and Upendra Baxi, winner of the Padma Shri award."]}, {"page": "List of sociologists", "response": ["* Margaret Archer, British sociologist"]}, {"page": "Structuration theory", "response": ["Margaret Archer objected to the inseparability of structure and agency in structuration theory.Archer, M. (1995). Realist social theory: The morphogenetic approach. Cambridge: Cambridge University Press. She proposed a notion of dualism rather than \"duality of structure\". She primarily examined structural frameworks and the action within the limits allowed by those conditions. She combined realist ontology and called her methodology analytical dualism. Archer maintained that structure precedes agency in social structure reproduction and analytical importance, and that they should be analysed separately. She emphasised the importance of temporality in social analysis, dividing it into four stages: structural conditioning, social interaction, its immediate outcome and structural elaboration. Thus her analysis considered embedded \"structural conditions, emergent causal powers and properties, social interactions between agents, and subsequent structural changes or reproductions arising from the latter.\" Archer criticised structuration theory for denying time and place because of the inseparability between structure and agency."]}, {"page": "Social structure", "response": ["Other recent work by Margaret Archer (morphogenesis theory),Archer, Margaret S. 1995. Realist Social Theory: The Morphogenetic Approach. Cambridge: Cambridge University Press. Tom R. Burns and Helena Flam (actor-system dynamics theory and social rule system theory),Burns, Tom R., and H. Flam. 1987. The Shaping of Social Organization: Social Rule System Theory with Applications. London: SAGE.Flam, Helena, and Marcus Carson, eds. 2008. Rule System Theory: Applications and Explorations. Frankfurt: Peter Lang Publishers. . and Immanuel Wallerstein (World Systems Theory)Wallerstein, Immanuel. 2004. World-Systems Analysis: An Introduction. Durham: Duke University Press. provide elaborations and applications of the sociological classics in structural sociology."]}, {"page": "Roy Bhaskar", "response": ["Bhaskar rejects the methodological individualist doctrine that social events can be explained purely in terms of facts about individual persons, although society has no other material presence than persons and the products of their actions. Equally, he rejects the collectivist notion, which he associated with Emile Durkheim, that reifies social groups and explains the social in terms of the influence of groups to the exclusion of the influence of persons. In fact, Durkheim does not reject psychology in toto. Durkheim spends two chapters of Suicide talking about psychological explanations of suicide.  Durkheim's real position is that *in addition to psychology* social facts play a role in explaining suicide rates  Instead, he argues that there is an iterative relation between people and society, which he understands as \"an ensemble of structures, practices and conventions\". People never create society from scratch because it always pre-exists them and provides the context in which they act, but it depends on human activity for its reproduction and/or transformation over time. Society, then, is a necessary condition of human action and influences it, but that human action is in turn a necessary condition of society, which it continually shapes and reshapes. Bhaskar initially saw the work of Anthony Giddens on duality of structure as consistent with the TMSA, but later accepted the critique of Giddens by Margaret Archer, who argued that Giddens conflated structure and agency. Archer's own concept of the morphogenetic cycle, developed independently, is remarkably similar to the TMSA, which led to the two working together under the banner of critical realism."]}, {"page": "Structure and agency", "response": ["A recent development in the debate is the critical realist structure/agency perspective embodied in Roy Bhaskar's transformational model of social action (TMSA) which he later expanded into his concept of four-planar social being. A major difference between Giddens' structuration theory and the TMSA is that the TMSA includes a temporal element (time). The TMSA has been further advocated and applied in other social science fields by additional authors, for example in economics by Tony Lawson and in sociology by Margaret Archer. In 2005, the Journal of Management Studies debated the merits of critical realism.", "The structure/agency debate continues to evolve, with contributions such as Nicos Mouzelis's Sociological Theory: What Went Wrong? and Margaret Archer's Realist Social Theory: The Morphogenetic Approach continuing to push the ongoing development of structure/agency theory.  Work in information systems by Mutch (2010) has emphasized Archer's Realist Social Theory  as well as Robert Archer's application in the field of education policy. In entrepreneurship a discussion between Sarason et al. and Mole and Mole (2010) used Archer's theory to critique structuration by arguing that starting a new business organization needs to be understood in the context of social structure and agency. However, this depends upon one's view of structure, which differs between Giddens and Archer. Hence if strata in social reality have different ontologies, then they must be viewed as a dualism. Moreover, agents have causal power, and ultimate concerns which they try to fallibly put into practice. Mole and Mole propose entrepreneurship as the study of the interplay between the structures of a society and the agents within it."]}, {"page": "Cultural system", "response": ["Margaret Archer (2004) in a revised edition of her classic work Culture and Agency, argues that the grand idea of a unified, integrated culture system, as advocated by early Anthropologists such as Bronisław Malinowski and later by Mary Douglas, is a myth. Archer reads this same myth through Pitirim Sorokin's influence and then Talcott Parsons' approach to cultural systems (2004:3). The myth of a unified, integrated cultural system was also advanced by Western Marxists such as by Antonio Gramsci through the theory of cultural hegemony through a dominant culture. Basic to these mistaken conceptions was the idea of culture as a community of meanings, which function independently in motivating social behavior. This combined two independent factors, community and meanings which can be investigated quasi-independently (2004:4)"]}, {"page": "Archer (surname)", "response": ["* Margaret Archer (born 1943), British sociologist"]}, {"page": "International Sociological Association", "response": ["# 1986–1990 Margaret Archer, UK"]}, {"page": "European Amalfi Prize for Sociology and Social Sciences", "response": ["The awardees are selected by a jury currently consisting of Margaret Archer, Allessandro Cavalli, Salvador Giner, Joachim Israel, Michel Maffesoli, Carlo Mongardini (chair), Birgitta Nedelmann, Helga Nowotny, and Piotr Sztompka. Previous members include Anthony Giddens, Peter Gerlich and Friedrich H. Tenbruck."]}, {"page": "Reflexivity (social theory)", "response": ["Margaret Archer has written extensively on laypeople's reflexivity. For her, human reflexivity is a mediating mechanism between structural properties, or the individual's social context, and action, or the individual's ultimate concerns. Reflexive activity, according to Archer, increasingly takes the place of habitual action in late modernity since routine forms prove ineffective in dealing with the complexity of modern life trajectories."]}, {"page": "Pontifical Academy of Social Sciences", "response": ["French economist Edmond Malinvaud was the first president of the academy, from 1994 to 2000. In April 2014, Pope Francis appointed British sociologist Margaret Archer to the post. On 27 March 2019 she was replaced by Prof. Stefano Zamagni."]}, {"page": "Being Human", "response": ["* Being Human: The Problem of Agency, a 2000 book by Margaret Archer"]}, {"page": "Elisionism", "response": ["Elisionism is a philosophical standpoint encompassing various social theories. Elisionist theories are diverse; however, they are unified in their adherence to process philosophy as well as their assumption that the social and the individual cannot be separated. The term elisionism was coined by Margaret Archer in 1995 in the book Realist Social Theory: The Morphogenetic Approach. Elisionism is often contrasted with holism, atomism, and emergentism."]}, {"page": "Center for Family and Human Rights", "response": ["In 2015, Stefano Gennarini (Director of the Centre for Legal Studies at C-Fam) publicly criticised Bishop Marcelo Sánchez Sorondo, chancellor of the Pontifical Academy of Social Sciences and the Pontifical Academy of Sciences in the Vatican, by accusing him of opposing the negotiating position of the Holy See on the issue of sexual and reproductive health. He also went on to accuse economist Jeffrey Sachs, director of the Earth Institute at Columbia University and a senior UN advisor, and UN Secretary-General Ban Ki-moon of actively promoting abortion. This received a strong rebuke from Professor Margaret Archer of the University of Warwick, president of the Pontifical Academy of Social Sciences, who referred to \"distorted criticism\" and raised concern at Gennarini's \"understanding of Catholic Social Doctrine”. This, in turn, drew a rebuke from influential Catholic journalist Phil Lawler who wrote, \"Archer’s ad hominem approach, and her unwillingness to engage the real issues in the debate, were unworthy of a social scientist. Her uncharitable attitude is unworthy of someone representing the Holy See.\""]}, {"page": "List of University of Warwick people", "response": ["* Lady Margaret Archer - theorist in critical realism; former President of International Sociological Association; current president of Pontifical Academy of Social Sciences"]}, {"page": "Critical realism (philosophy of the social sciences)", "response": ["An accessible introduction to Bhaskar's writings was written by Andrew Collier. Andrew Sayer has written accessible texts on critical realism in social science. Danermark et al. have also produced an accessible account. Margaret Archer is associated with this school, as is the ecosocialist writer Peter Dickens.", "The morphogenetic approach is a critical realist framework for analysing social change originally developed by Margaret Archer in her text Social Origins of Educational Systems and systematised in a trilogy of social theory texts, Culture and Agency (1988), Realist Social Theory (1995), and Being Human (2000). The approach was developed primarily as a critical realist response to the structure-agency problem in which \"we are simultaneously free and constrained and we also have some awareness of it\". At the centre of Archer's answer to this problem is 'analytical dualism', which entails an analytical separation of structure and agency so that the interaction between them can be studied and modelled by researchers. On this basis, Archer rejects alternative approaches that 'conflate' structure and agency into the single concept of 'practice', primarily directing her critique at Giddens' structuration theory. Archer extends the notion of analytical dualism to the distinction between \"the material and the ideational aspects of social life\", identifying 'culture' as a third fundamental aspect of society, alongside structure and agency. Therefore, the analysis of social change depends on modelling structure (S), agency (A), and culture (C), so that \"social life comes in a SAC – always and everywhere\". These concepts form the basis for the 'morphogenetic cycle', which splits social change into three processes: [T1] conditioning → [T2-T3] interaction → [T4] elaboration. ", "David Scott has written extensively about CR and education. In his book Education, Epistemology and Critical Realism (2010), he argues for a need to pay greater attention to the meta-theories which underpin educational research. An important issue for educational research, Scott argues, is the relationship between structure and agency. The work of Margaret Archer uses the morphogenetic cycle (explained in one of the sections above) as an analytical tool that allows the researcher to explore the interplay between structure and agency at any given moment in time. She uses analytical dualism, a methodological manoeuvre that helps, only for the sake of analysis, to separate structure from agency to explore their interplay at a particular moment in time."]}, {"page": "Detraditionalization", "response": ["* Contributors include Mark Poster, Richard Sennett, Ulrich Beck, Margaret Archer, Mary Douglas and Thomas Luckmann."]}, {"page": "Pierpaolo Donati", "response": ["To summarize. Any social formation is the emergent effect of reciprocal actions, reiterated over time by social actors/subjects occupying different positions in a societal configuration (system or social network). Society is any social formation generated by virtue of social mechanisms that are relational and reflexive. While the “Relational Subject” is characterized by personal reflexivity (as defined by Margaret Archer),Porpora, Douglas V. (2016). “The Relational Subject.” Journal of Critical Realism, 15 (4), pp. 419-425. the ‘relational society’ is characterized what Donati calls ‘relational reflexivity’, which is different in kind from the inner reflexivity of the individual.Relational reflexivity consists in orientating the agents/actors to the reality emergent from their interactions by their taking into consideration how this reality is able (by virtue of its own powers) to feed back onto the subjects (agents/actors) since it exceeds their individual as well as their aggregated personal powers. Margaret Archer attributes to Pierpaolo Donati the proper concept of ‘relational reflexivity’: see Martin Dyke (2015). “Reconceptualising learning as a form of relational reflexivity.” British Journal of Sociology of Education, 36(4): 542-557, quote p. 554.", "Margaret Archer has highlighted the convergences between Roy Bhaskar's critical realism and Donati's relational sociology,Margaret Archer (2010), “Critical Realism and Relational Sociology. Complementarity and Synergy.” Journal of Critical Realism, 9 (2), pp. 199-207. and subsequently has debated the place of Donati's sociology within a variety of relational sociologies.Margaret Archer (2019), “Varieties of Relational Social Theory.” In P. Donati, A. Malo, G. Maspero (eds.). Life as Relation. A Dialogue between Theology, Philosophy, and Social Science. London: Routledge."]}]}}