{"wiki_id": "http://www.wikidata.org/entity/Q433683", "itemLabel": "Victoria Chaplin", "itemDescription": "British-American circus performer", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Chaplin", "wikipedia_page": {"main": "Victoria Thierrée-Chaplin (born May 19, 1951) is a British-American circus performer. She is the daughter of film actor and comedian Charlie Chaplin from his fourth wife, Oona O'Neill, and the granddaughter of playwright Eugene O'Neill.\nChaplin was born at Saint John's Health Center in Santa Monica, but grew up in Switzerland. As a teenager, she appeared as an extra in her father's last film, A Countess from Hong Kong (1966). Her father also wanted her to star in the main role of a winged girl found from the Amazonian rainforest in his next planned film, The Freak, in 1969. However, the project was never filmed because of his declining health and because Victoria eloped with the French actor Jean-Baptiste Thierrée.Chaplin and Thierrée had first come into contact after he read about Chaplin's aspiration of becoming a circus clown in a magazine article of her father, and asked her to form a new type of circus with him. Soon after their elopement, they briefly appeared as two clowns in Federico Fellini's The Clowns (1970), and the next year performed for the first time with the contemporary circus Le Cirque Bonjour, which they had founded together, at Festival d'Avignon. In 1974, they founded a new, smaller circus Le Cirque Imaginaire, which centered only on their, and occasionally their children's, performances, and from 1990 onward have performed under the name Le Cirque Invisible.Chaplin and Thierrée have two children, Aurélia Thierrée (born 24 September 1971), and James Thierrée (born 2 May 1974), who are performing artists. In addition to performing in Le Cirque Invisible, Chaplin also helped in creating her children's shows, and in 2006, was awarded the Molière Award, the French national theatre prize, for designing the costumes for her son's show, The Junebug Symphony.", "link_mentions": [{"page": "Circus", "response": ["Early pioneers of the contemporary circus genre included: Circus Oz, forged in Australia in 1977 from SoapBox Circus (1976) and New Circus (1973); the Pickle Family Circus, founded in San Francisco in 1975; Ra-Ra Zoo in 1984 in London; Nofit State Circus in 1984 from Wales; Cirque du Soleil, founded in Quebec in 1984; Cirque Plume and Archaos from France in 1984 and 1986 respectively. More recent examples include: Cirque Éloize (founded in Quebec in 1993); Sweden's Cirkus Cirkör (1995); Teatro ZinZanni (founded in Seattle in 1998); the West African Circus Baobab (late 1990s); and Montreal's Les 7 doigts de la main (founded in 2002). The genre includes other circus troupes such as the Vermont-based Circus Smirkus (founded in 1987 by Rob Mermin) and Le Cirque Imaginaire (later renamed Le Cirque Invisible, both founded and directed by Victoria Chaplin, daughter of Charlie Chaplin)."]}, {"page": "A Countess from Hong Kong", "response": ["Chaplin's three eldest daughters appeared in the film: Geraldine (at minutes 46 and 65), Josephine and Victoria Chaplin (at minute 92)."]}, {"page": "I clowns", "response": ["* Victoria Chaplin as Herself"]}, {"page": "Molière Award", "response": ["*Best Costumes - Victoria Chaplin Thiérrée for La Symphonie du hanneton"]}, {"page": "The Freak", "response": ["Chaplin began work in and around 1969 with his daughter Victoria in mind for the lead role. However, Victoria's abrupt marriage and his advanced age proved roadblocks and the film was never made. Chaplin biographer Jeffrey Vance maintains that Chaplin script for The Freak \"borrows many themes, ideas, and even phrases from his three previous films but is nevertheless an original story filled with marvelous Chaplin comedy touches\". Vance, who interviewed Victoria Chaplin, believes The Freak \"had strong potential for being a very moving—and fitting—swan song\".Vance, Jeffrey (2003). Chaplin: Genius of the Cinema. New York: Harry N. Abrams, pg. 352.  . Chaplin's memoir, My Life in Pictures (1974), describes The Freak as a work still in progress. He also mentioned his intent to make it in an interview on his 85th birthday in 1974. \"I mean to make it someday\", Chaplin writes in a caption alongside a photograph of Victoria in winged costume published in My Life in Pictures. No footage from the film is known to exist, though brief color footage of Victoria in wings can be seen in Charlie Chaplin – Les années suisses (2003)."]}, {"page": "List of Americans of English descent", "response": ["*Victoria Chaplin – father of English descent"]}, {"page": "James Thiérrée", "response": ["James Spencer Henry Edmond Marcel Thierrée (born 2 May 1974 in Lausanne, Switzerland) is a Swiss circus performer, violinist, actor and director who is best known for his theatre performances which blend contemporary circus, mime, dance, and music. He is the son of circus performers Victoria Chaplin and Jean-Baptiste Thierrée, the grandson of filmmaker Charlie Chaplin and the great-grandson of playwright Eugene O'Neill."]}, {"page": "La Jolla Playhouse production history", "response": ["*The Invisible Circus/Le Cirque Invisible by Victoria Chaplin"]}, {"page": "Victoria Thierrée Chaplin", "response": ["#REDIRECT Victoria Chaplin"]}, {"page": "Chaplin family", "response": [":::*Victoria Chaplin (born 1951), married Jean-Baptiste Thierrée"]}, {"page": "Contemporary circus", "response": ["The genre includes other circus troupes such as the Vermont-based Circus Smirkus (founded in 1987 by Rob Mermin), Le Cirque Imaginaire (later renamed Le Cirque Invisible, both founded and directed by Victoria Chaplin, daughter of Charlie Chaplin), the Tiger Lillies, and Dislocate,Dislocate while The Jim Rose Circus is an interesting take on the circus sideshow. In Northern England, Skewed Circus combines punk, rap, dance music, comedy, and stunts to deliver \"pop-circus\" entertainment to young urban audiences.Skewed Circus "]}, {"page": "Chaplin (name)", "response": ["* Victoria Chaplin (born 1951), actress, daughter of comedian Charlie Chaplin"]}, {"page": "Es Devlin", "response": ["Devlin was born in Kingston upon Thames, London, on 24 September 1971. She studied English literature at Bristol University, followed by a Foundation Course in Fine Art at  Central St. Martin's eventually specialising in theatre design. While undertaking her studies, she prepared the props for Le Cirque Invisible, the circus company founded by Victoria Chaplin and Chaplin's husband, Jean-Baptiste Thierrée."]}, {"page": "List of abandoned and unfinished films", "response": ["| 1966–1975 || The Freak || Charlie Chaplin || || || Victoria Chaplin || The Freak was an unfinished dramatic comedy from Charles Chaplin. The story revolved around a young South American girl who unexpectedly sprouts a pair of wings. She is kidnapped and taken to London, where her captors cash in by passing her off as an angel. Later she escapes, only to be arrested because of her appearance. She is further dehumanized by standing trial to determine if she is human at all. Chaplin began work in and around 1969 with his daughter Victoria in mind for the lead role. However, Victoria's abrupt marriage and his advanced age proved roadblocks and the film was never made. ||"]}, {"page": "Aurélia Thierrée", "response": ["Thierrée is the daughter of Victoria Chaplin and Jean-Baptiste Thierrée and the sister of James Thierrée. She is the granddaughter of Charlie Chaplin and Oona O'Neill."]}, {"page": "Chaplin, Victoria", "response": ["#redirectVictoria Chaplin"]}, {"page": "Jean-Baptiste Thierrée", "response": ["Jean-Baptiste Thierrée (born 2 May 1937) is a French actor and circus performer. He is married to Victoria Chaplin and is the father of Aurélia Thierrée and James Thierrée.", "In cinema, Thierrée played the role of Bernard in the French psychological drama film Muriel (1963). He and his wife Victoria Chaplin also appeared briefly as two clowns in Federico Fellini's The Clowns (1970)."]}]}}