{"wiki_id": "http://www.wikidata.org/entity/Q433258", "itemLabel": "Ian McGeechan", "itemDescription": "English-Scottish rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McGeechan", "wikipedia_page": {"main": "Sir Ian Robert McGeechan, OBE (born 30 October 1946) is a Scottish former rugby union player and coach. His nickname is \"Geech\".", "link_mentions": [{"page": "British & Irish Lions", "response": ["In 2009, the Lions toured South Africa. There they faced the World Cup winners South Africa, with Ian McGeechan leading a coaching team including Warren Gatland, Shaun Edwards and Rob Howley. The Lions were captained by Irish lock Paul O'Connell. The initial Lions selection consisted of fourteen Irish players, thirteen Welsh, eight English and two Scots in the 37-man squad. In the first Test on 20 June, they lost 26–21, and lost the series in the second 28–25 in a tightly fought game at Loftus Versfeld on 27 June. The Lions won the third Test 28–9 at Ellis Park, and the series finished 2–1 to South Africa.", "| Ian McGeechan", "| Ian McGeechan", "| Ian McGeechan", "| Ian McGeechan"]}, {"page": "Yorkshire", "response": ["Many England international players have emerged from Yorkshire including World Cup winners Jason Robinson and Mike Tindall. Other successful players from the region include Rob Andrew, Tim Rodber, Brian Moore, Danny Care, Rory Underwood and Sir Ian McGeechan."]}, {"page": "Tom Smith (rugby union, born 1971)", "response": ["Smith earned his first Scotland cap in 1997 in the Calcutta Cup match versus England at Twickenham. Despite only having a 3 caps to his name at the time he was included by coach Ian McGeechan in the squad for the 1997 British and Irish Lions tour to South Africa. Surprising many, Smith was selected to start all three test matches alongside Paul Wallace and Keith Wood over the other touring props Jason Leonard and Graham Rowntree. His strong scrummaging and good hands alongside many other great team performances ensured that the Lions won over their much more highly fancied hosts and won the series 2–1."]}, {"page": "List of sports announcers", "response": ["* Sir Ian McGeechan – Talksport 2013, Sky Sports 2013, BBC Sport 2014–2015, ITV Sport 2015–present"]}, {"page": "Martin Johnson (rugby union)", "response": ["Johnson was selected to captain the 1997 British Lions tour of South Africa. The Lions convincingly won the first test at Newlands 25–16 with Neil Jenkins kicking five penalties and Matt Dawson and Alan Tait scoring tries. Despite scoring three tries in the second test at Durban, the Springboks suffered from some woeful goal kicking and failed to land any penalties or conversions, while for the Lions Neil Jenkins once again kicked five penalties to level the scores at 15–15 before Jeremy Guscott dropped a goal for an 18–15 lead for the Lions. The Lions then held off a ferocious South African fightback, Lawrence Dallaglio putting in a try-saving tackle, to win the match 18–15 and take the series. The third test at Ellis Park proved a match too far for the Lions squad and they lost 35–16. The tour was seen as a triumph for the Lions management of Fran Cotton (manager), Ian McGeechan (head coach), Jim Telfer (assistant coach) and especially Johnson as captain."]}, {"page": "Will Carling", "response": ["Carling's career included the 1993 British Lions tour to New Zealand. He underachieved on that tour, a pattern attributed by coach Ian McGeechan and manager Geoff Cooke as at least partly due to his failing to secure the captaincy (this instead going to Gavin Hastings of Scotland) but also due in large part to the ascendency in the centre of both Guscott and Scott Gibbs of Wales. McGeechan and Cooke disclosed that Carling came close to voluntarily withdrawing from the squad; he did however recover his test place and played a notable role in the third test. McGeechan commented in his autobiography that Carling's failure to rise to the occasion as a Lion (in contrast to Guscott) may be seen by some as the difference between his legacy as a good player and a great player."]}, {"page": "Northampton Saints", "response": ["In 1994, Ian McGeechan took over as director of rugby, and although the club were relegated in his first season, they returned in style the next season, winning every single game of their campaign and averaging 50 points a game. This season is referred to by many fans of the club as the \"Demolition Tour of Division Two\".", "In 1999, Saints came runners-up in the Allied Dunbar Premiership, their league campaign climaxing with a crucial home local derby with eventual winners Leicester Tigers which they lost 15–22. Ian McGeechan had left the club at the end of the previous season to return to coach Scotland, and was replaced by former Saints player John Steele who had done well on a limited budget at London Scottish.  Steele relied on the foundations laid by McGeechan, as well as the inspirational captaincy of Samoan Pat Lam to lead the club to European success the following season."]}, {"page": "Wasps RFC", "response": ["Ian McGeechan became the new Director of Rugby at Wasps from the 2005–06 season, taking over from Gatland. Wasps won the Powergen Anglo-Welsh Cup in the 2005–06 season, beating Llanelli Scarlets in the final at Twickenham. Before the 2006–07 season began, Wasps won the Middlesex 7's in Twickenham, beating Leicester Tigers in the final. ", "The 2008–09 season was to see Wasps come unstuck. With their captain having retired, many of the players failed to play to their full potential. Wasps would eventually finish in seventh place, having also failed to reach the knock-out stages of the Heineken Cup and EDF Anglo Welsh Cup. On 12 May 2009 it was announced in the evening standard that Ian McGeechan had been forced to step down and will now take a consultancy role both at London Wasps and London Scottish. This was confirmed by the BBC on 14 May. Tony Hanks, a former coach at the club, was announced as the new Director of Rugby soon after. He had more recently been coaching at Waikato and also been a stand in for McGeechan for the latter part of the 2008/09 season, while he was primarily committed to British and Irish Lions duty. McGeechan had technically been a Lions employee for the whole season and through agreement with Wasps was loaned back to the club.", "|Ian McGeechan"]}, {"page": "Scotland national rugby union team", "response": ["Scotland went to the first World Cup, played in New Zealand and Australia in the summer of 1987. John Rutherford, the team's general and controlling influence, had injured his knee on an unauthorised tour of Bermuda. He broke down after less than a quarter of an hour of the first World Cup match against France and never played for Scotland again. Scotland had been in the lead but the match finished level. Scotland lost to New Zealand in the quarter-final. On 27 June 1988, Ian McGeechan was appointed as head coach to succeed Derrick Grant who had retired after the end of the 1988 Five Nations series.", "* Ian McGeechan, inducted 2005", "* Ian McGeechan", "* Ian McGeechan", "Before 1971, there was no appointed coach of the Scotland team, the role being assumed by the captain. In 1971, the SRU appointed the first coach as \"adviser to the captain\". He was Bill Dickinson, a lecturer at Jordanhill College, and his contribution to Scottish rugby in the 1970s was immense. Nairn McEwan took the reins in 1977 for three years before the team was led by Jim Telfer in 1980. Colin Telfer took over for a year before being succeeded by Derrick Grant in the autumn of 1985. From 1988 onwards, Scotland was coached by Jim Telfer, Richie Dixon or Ian McGeechan until 2003 when the Australian Matt Williams was appointed, becoming the first non-Scot to coach the national side. Scotland have appointed a further three non-Scottish coaches to lead the national side, the others being Scott Johnson, an Australian, Andy Robinson, an Englishman, and Vern Cotter from New Zealand.", "| align=left|  Ian McGeechan", "| align=left| Ian McGeechan"]}, {"page": "Rugby union positions", "response": ["Brian O'Driscoll is the fourth most-capped player in rugby union history, having played 141 test matches, 133 for Ireland (83 as captain), and 8 for the British and Irish Lions. He is the 8th-highest try scorer in international rugby union history, and the highest scoring centre of all time. Danie Gerber played centre for South Africa during the apartheid era and even though he was only able to play 24 tests over 12 years, he scored 19 tries. Mike Gibson played for Ireland and the Lions; his record of 69 caps for Ireland lasted for 26 years. Tim Horan won two World Cups for Australia, being named the Player of the Tournament in 1999. As a player, Ian McGeechan won 32 caps for Scotland and went on two Lions tours, while as a coach he led the Lions a record four times. Welsh centre Gwyn Nicholls played from 1896 to 1906 and was known as the \"Prince of Threequarters\". Other centres in the International Rugby Hall of Fame are Jo Maso and Philippe Sella from France, known for their flamboyant attacking play. Gibson and Sella are also in the IRB Hall of Fame. Seven centres are in the IRB Hall but not the International Hall—Frank Hancock, a 19th-century Welsh player whose skills led to the creation of the modern two-centre formation; Guy Boniface, French international and younger brother of André; brothers Donald and Ian Campbell of Chile; Zimbabwe international Richard Tsimba; and Bleddyn Williams and Jack Matthews, who formed a legendary centre partnership for Cardiff and Wales in the era immediately following World War II."]}, {"page": "1997 British Lions tour to South Africa", "response": ["The tour was a triumph for the Lions management of Fran Cotton (Manager), Ian McGeechan (Head Coach), Jim Telfer (Assistant Coach) and especially the Captain Martin Johnson. It was the last occasion on which the Lions returned victorious from a tour until the victorious tour of Australia in 2013.", "|colspan=\"4\"| Ian McGeechan", "|colspan=\"4\"| Ian McGeechan", "|colspan=\"4\"| Ian McGeechan"]}, {"page": "2005 British & Irish Lions tour to New Zealand", "response": ["| Ian McGeechan || Assistant coach ||  Scotland"]}, {"page": "Ronan O'Gara", "response": ["On 16 May 2010, O'Gara was awarded the ERC European Player Award, crediting him as the player who had made the greatest contribution to European Rugby during the first 15 years of the Heineken Cup. The selection panel consisted of Sir Ian McGeechan, Lawrence Dallaglio, Ieuan Evans, Fabien Galthié, Donal Lenihan, Michael Lynagh, Stuart Barnes, Stephen Jones and Jacques Verdier."]}, {"page": "Rob Howley", "response": ["He was attack coach during 2009 British & Irish Lions tour to South Africa under head coach Ian McGeechan, and retained the role under Warren Gatland in the 2013 British & Irish Lions tour to Australia, helping the Lions secure their first series win since 1997."]}]}}