{"wiki_id": "http://www.wikidata.org/entity/Q4341367", "itemLabel": "Sergei Pavlenko", "itemDescription": "portrait painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Sergei_Pavlenko", "wikipedia_page": {"main": "Sergei Pavlenko (born 1953) is a portrait painter of Russian origin and now based in Britain.", "link_mentions": [{"page": "List of 21st-century classical composers", "response": ["|Sergei Pavlenko || 1952 ||  || Russian-British || ||"]}, {"page": "Yuri Kholopov", "response": ["* Philip Gershkovich's search for the lost essence of music; also: List of Philip Gershkovich's musicological research studies; List of Philip Gershkovich's musical compositions; Some of Philip Gershkovich’s aphorisms. In: «Ex oriente...III» Eight Composers from the former USSR Philip Gershkovich, Boris Tishchenko, Leonid Grabovsky, Alexander Knaifel, Vladislav Shoot, Alexander Vustin, Alexander Raskatov, Sergei Pavlenko. Edited by Valeria Tsenova. English edition only. (studia slavica musicologica, Bd. 31) Verlag Ernst Kuhn – Berlin "]}, {"page": "Association for Contemporary Music", "response": ["Russia's New ACM (or ACM-2), the revival of the previous organization, was established in Moscow in 1990. Its chairman was composer Edison Denisov. The co-founders of the new ACM were Elena Firsova, Dmitri Smirnov, and Nikolai Korndorf. Its members included Leonid Hrabovsky, Alexander Knaifel, Sergei Pavlenko, Alexander Voustin, Vladislav Shoot, Viktor Yekimovsky, Faraj Karayev, Vyacheslav Artyomov, Vladimir Tarnopolsky, Alexander Raskatov, Ivan Sokolov, and Yuri Kasparov. Eminent composers like Sofia Gubaidulina, Alfred Schnittke, Valentin Silvestrov, and Tigran Mansuryan were invited to join the ACM. ACM became affiliated with the International Society for Contemporary Music (ISCM)."]}, {"page": "The Devil in Love (opera)", "response": ["* Ex oriente...III, Eight Composers from the former USSR: Philip Gershkovich, Boris Tishchenko, Leonid Grabovsky, Alexander Knaifel, Vladislav Shoot, Alexander Vustin, Alexander Raskatov, Sergei Pavlenko Edited by Valeria Tsenova. English edition (studia slavica musicologica, Bd. 31), 206 pp., music illus., "]}, {"page": "Alexander Vustin", "response": ["* «Ex oriente...III» Eight Composers from the former USSR: Philip Gershkovich, Boris Tishchenko, Leonid Grabovsky, Alexander Knaifel, Vladislav Shoot, Alexander Vustin, Alexander Raskatov, Sergei Pavlenko Edited by Valeria Tsenova. English edition (studia slavica musicologica, Bd. 31), 206 pp., music illus., "]}, {"page": "Russians in the United Kingdom", "response": ["*Sergei Pavlenko, portrait painter"]}, {"page": "Pavlenko", "response": ["* Sergei Pavlenko (born 1953), Russian-British painter"]}, {"page": "Monetary reform in Russia, 1998", "response": ["Rumours of reform occurred regularly and were repeatedly denied. In June 1996, the head of the Working Center for Economic Reform Minister Sergei Pavlenko announced the imminent denomination. According to his calculations, it could not be implemented before 1998, \"when inflation in the country will be permanently suppressed\". However, in September 1996, the chairman of the Central Bank of Russia, Sergei Dubinin, said that monetary reform was premature."]}, {"page": "Sergey Pavlenko", "response": ["#REDIRECT Sergei Pavlenko"]}]}}