{"wiki_id": "http://www.wikidata.org/entity/Q434446", "itemLabel": "Benjamin Kidd", "itemDescription": "British sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Kidd", "wikipedia_page": {"main": "Benjamin Kidd (1858–1916) was a British sociologist whose first job was a civil service clerk, but by persistent self-education, he became internationally famous by the publication of his book Social Evolution in 1894. Kidd argued that the \"evolution of society and of modern civilization\" is caused not by reason or science, but by the force of \"religious beliefs.\" The book had worldwide circulation and impacted the Social Gospel movement.\nKidd is reckoned as a founder of sociology as a discipline. Influenced by Darwinism and evolution, Kidd sought and found analogies between the evolution of human society and of the biological organism.Kidd's prolific writings had a major impact at the time. However, the world was so different after the First World War that Kidd's work became relegated to historical interest.", "link_mentions": [{"page": "Social Darwinism", "response": ["The massive expansion in Western colonialism during the New Imperialism era fitted in with the broader notion of social Darwinism used from the 1870s onwards to account for the phenomenon of \"the Anglo-Saxon and latin overflowing his boundaries\", as phrased by the late-Victorian sociologist Benjamin Kidd in Social Evolution, published in 1894.Benjamin Kidd, Social Evolution, Kessinger Publishing, LLC, 2007, 400 pages, , p. 47. The concept also proved useful to justify what was seen by some as the inevitable \"disappearance\" of \"the weaker races... before the stronger\" not so much \"through the effects of … our vices upon them\" as \"what may be called the virtues of our civilisation.\" Winston Churchill, a political proponent of eugenics, maintained that if fewer ‘feebleminded’ individuals were born, less crime would take place.King, D. (1999). In the name of liberalism: illiberal social policy in Britain and the United States (Oxford: Oxford University Press)."]}, {"page": "Viktor Rydberg", "response": ["Rydberg's final publication, an essay titled Den hvita rasens framtid, \"The Future of the White Race\", was published posthumously as an introduction to the Swedish edition of Benjamin Kidd's Social Evolution. Noting that \"Rydberg's conception of race is not equivalent with the modern term; the meaning he gives the word is in fact more cultural than biological, ...he includes Jews, Muslims, Hindus, Buddhists living in Asia, America and to some extent Africa in this expression.\" Swedish scholar Anna Lindén says \"what he actually criticizes is a phenomenon within Europe, not on other continents\", continuing, \"The Swedish author is, unlike Kidd, not a Social Darwinist and far more pessimistic about the European future than the Irishman. A common feature is, however, that both of them view religion and ethics as most important for the survival of a \"race\".", "*1895 Den hvitarasens framtid (\"The Future of the White Race\"). Introduction to Swedish edition of Benjamin Kidd's Social Evolution. Stockholm: Hugo Gebers."]}, {"page": "History of creationism", "response": ["Benjamin Kidd's 1918 book Science of Power, claimed that there were historical and philosophical connections between Darwinism and German militarism.Defender of The Faith William Jennings Bryan, L. W. Levine, (Oxford Univ. Press. New York, 1965) pp. 261–265 This book and others around this time had an effect on many people."]}, {"page": "Sociocultural evolution", "response": ["While sociocultural evolutionists agree that an evolution-like process leads to social progress, classical social evolutionists have developed many different theories, known as theories of unilineal evolution. Sociocultural evolutionism became the prevailing theory of early sociocultural anthropology and social commentary, and is associated with scholars like Auguste Comte, Edward Burnett Tylor, Lewis Henry Morgan, Benjamin Kidd, L. T. Hobhouse and Herbert Spencer. Such stage models and ideas of linear models of progress had a great influence not only on future evolutionary approaches in the social sciences and humanities, but also shaped public, scholarly, and scientific discourse surrounding the rising individualism and population thinking. Sociocultural evolutionism attempted to formalise social thinking along scientific lines, with the added influence from the biological theory of evolution. If organisms could develop over time according to discernible, deterministic laws, then it seemed reasonable that societies could as well. Human society was compared to a biological organism, and social science equivalents of concepts like variation, natural selection, and inheritance were introduced as factors resulting in the progress of societies. The idea of progress led to that of a fixed \"stages\" through which human societies progress, usually numbering threesavagery, barbarism, and civilizationbut sometimes many more. At that time, anthropology was rising as a new scientific discipline, separating from the traditional views of \"primitive\" cultures that was usually based on religious views."]}, {"page": "National Liberal Club", "response": ["*Benjamin Kidd, pioneering sociologist.D.P. Crook, Benjamin Kidd: portrait of a social Darwinist (Cambridge University Press, Cambridge, 2009), p. 210. Kidd joined in 1902."]}, {"page": "Kidd (surname)", "response": ["* Benjamin Kidd (1858–1916), British sociologist and writer"]}, {"page": "Fundamentalist–Modernist controversy", "response": ["When the US did finally join World War I in 1917, Bryan volunteered for the army, though he was never allowed to enlist. At a time of widespread revulsion at alleged German atrocities, Bryan linked evolution to Germany, and claimed that Darwinism provided a justification for the strong to dominate the weak and was therefore the source of German militarism. He drew on reports by the entomologist Vernon Kellogg of German officers discussing the Darwinian rationale for their declaration of war, and the sociologist Benjamin Kidd's book The Science of Power which contended that Nietzsche's philosophy represented an interpretation of Darwinism, to conclude that Nietzsche's and Darwin's ideas were the impetus for German nationalism and militarism. Bryan argued that Germany's militarism and \"barbarism\" came from their belief that the \"struggle for survival\" described in Darwin's On the Origin of Species applied to nations as well as to individuals, and that \"The same science that manufactured poisonous gases to suffocate soldiers is preaching that man has a brute ancestry and eliminating the miraculous and the supernatural from the Bible.\""]}, {"page": "October 1916", "response": ["* Died: Benjamin Kidd, British sociologist, author of Social Evolution (b. 1858)"]}, {"page": "George Chatterton-Hill", "response": ["George Chatterton-Hill (1883–1947) was the Irish writer of several books on evolution and sociology. He wrote at the start of the 20th century, when the rediscovery of Gregor Mendel's work, had created turmoil over Charles Darwin's theory of evolution by natural selection. He was also very influenced by the writings of Herbert Spencer regarding evolution and society, and of Benjamin Kidd regarding society and religion."]}, {"page": "Alfred Machin (writer)", "response": ["In The Ascent of Man (a title he used long before Jacob Bronowski made his famous television series of the same name), he compares the ideas of Charles Darwin and Herbert Spencer in particular, with reference to Benjamin Kidd. The book is notable for his theory that the ills of society, and in particular mental illness, are caused by the increasing demands of society on the human organism which is adapted for life in small, unpoliced, communities of equals, rather than the constraining power structures of modern societies which leave man anything but free. This line of thought would later be expressed by Boris Sigis and Wilfred Trotter, and by Sigmund Freud in Civilisation and its Discontents"]}, {"page": "Social Evolution", "response": ["Social Evolution is the title of an essay by Benjamin Kidd, which became available as a book published by Macmillan and co London in 1894. In it, Kidd discusses the basis for society as an evolving phenomenon, with reference to past societies, the important developments of his own period of thriving capitalist industry, and possible future developments."]}, {"page": "The Outlook (New York City)", "response": ["*Benjamin Kidd's interview article, \"Future of the United States\" (September 1, 1894) made him a celebrity in the United States."]}, {"page": "List of autodidacts", "response": ["*Benjamin Kidd (1858–1916), British sociologist, was not given a formal education.Henry Sturt, \"Kidd, Benjamin (1858–1916), sociologist,\" Oxford Dictionary of National Biography, Oxford University Press, 1927). As a working adult, he attended some evening classes and he read incessantly.D. P. Crook, \"Kidd, Benjamin (1858–1916),\" Oxford Dictionary of National Biography, (Oxford University Press, 2004). Kidd gained worldwide fame by the publication of Social Evolution in 1894."]}, {"page": "Romford Garden Suburb", "response": ["*Benjamin Kidd"]}, {"page": "Kidd, Benjamin", "response": ["#redirectBenjamin Kidd"]}]}}