{"wiki_id": "http://www.wikidata.org/entity/Q4346488", "itemLabel": "Robin Atkin Downes", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Atkin_Downes", "wikipedia_page": {"main": "Robin Atkin Downes (born 6 September 1976) is an English actor. He is known for his work in animation and video games.", "link_mentions": [{"page": "Babylon 5", "response": ["* Robin Atkin Downes as Byron, a rogue telepath"]}, {"page": "1976", "response": ["** Robin Atkin Downes, English actor and voice actor"]}, {"page": "Count Dooku", "response": ["In the sixth season, Dooku finds out the clone trooper Tup executed Order 66 prematurely and works behind the scenes to stop the Republic's investigation. He then manipulates the Banking Clan and its representative Rush Clovis (Robin Atkin Downes) into putting all their resources in the hands of the Sith, bringing war to the planet Scipio. Later, the Jedi find a lightsaber belonging to deceased Jedi Master Sifo-Dyas—whom Dooku murdered years earlier—and start an investigation. Sidious forces Dooku to clean up their trail. Dooku confronts Anakin and Obi-Wan on Oba Diah, revealing his alter-ego Darth Tyranus to the Jedi, and they realize that it was he who created the clone army. Some further investigation by Yoda prompts Dooku and Sidious to perform a Sith ritual in an unsuccessful attempt to break the Jedi Master; in a vision experienced by Yoda, Dooku fights Anakin, who swiftly defeats and executes him, in a manner very similar to his eventual demise."]}, {"page": "Guardians of the Universe", "response": ["* The Guardians of the Universe make an appearance in Justice League: The New Frontier, voiced by Robin Atkin Downes. They guide Hal Jordan on the use of his Green Lantern ring against Dinosaur Island."]}, {"page": "Reed Richards", "response": ["* Mister Fantastic appears in the Hulk and the Agents of S.M.A.S.H. episode \"Monsters No More\", voiced by Robin Atkin Downes. He teamed up with the Agents of S.M.A.S.H. to stop the Tribbitites invasion.", "* Mister Fantastic appears in the Fantastic Four video game based on the 2005 film voiced by Ioan Gruffudd with his classic appearance voiced by Robin Atkin Downes in bonus levels."]}, {"page": "1976 in film", "response": ["**Robin Atkin Downes, English actor and voice actor"]}, {"page": "List of Star Wars characters", "response": ["|Nick Gillard (Revenge of the Sith)Voice: Robin Atkin Downes (The Clone Wars)", "|Voice: Robin Atkin Downes (The Clone Wars)", "|Voice: Robin Atkin Downes (The Clone Wars)", "| Voice: Robin Atkin Downes (The Clone Wars, Rebels, and The Bad Batch)"]}, {"page": "Pyro (Marvel Comics)", "response": ["* Pyro appears as a playable character in the Xbox version of the 2002 fighting game X-Men: Next Dimension, voiced by Robin Atkin Downes.", "* Pyro is featured as a boss in the 2004 action role-playing game X-Men Legends, voiced by Robin Atkin Downes. John Kassir voices Pyro in its 2005 sequel, X-Men Legends II: Rise of Apocalypse, where he appears as an NPC character across all platforms and a playable character in the PC version."]}, {"page": "Rhino (character)", "response": ["* The Rhino appears as a playable character and boss in Lego Marvel Super Heroes, voiced by Robin Atkin Downes. In the game's story, Captain America, Storm, and the Thing fight the Rhino and Mystique posing as Magneto in the Savage Land while trying to stop Asteroid M's launch.", "* The Aleksei Sytsevich incarnation of the Rhino appears as a boss in the mobile version of The Amazing Spider-Man 2 film tie-in game, voiced again by Robin Atkin Downes. He first appears as a small-time criminal who is defeated by Spider-Man early on in the story and arrested by the police. Near the end of the game, he is broken out of prison and dons rhinoceros-themed armor. The Rhino attacks Spider-Man and the Black Cat at the docks, but is ultimately defeated by the former and returned to police custody. The Rhino armor from the film also appears as an Easter egg in all other versions of the game."]}, {"page": "Mysterio", "response": ["* Quentin Beck / Mysterio appears as the final boss of Spider-Man: Friend or Foe, voiced by Robin Atkin Downes. He combines shards from the meteor that originally brought the Venom symbiote to Earth with his nanotechnology and hard-light holograms to create an army of Perpetual Holographic Avatar Nano-Tech Offensive Monsters (P.H.A.N.T.O.M.s). To ensure he has enough shards to strengthen his P.H.A.N.T.O.M.s and eventually take over the world, he also kidnaps and brainwashes other supervillains, whom he sends across the globe to retrieve more shards. After Spider-Man frees the villains from his control, they join forces with him to defeat Mysterio and his P.H.A.N.T.O.M.s."]}, {"page": "The Matrix (franchise)", "response": ["| Robin Atkin Downes", "| Robin Atkin Downes"]}, {"page": "Ben Urich", "response": ["* Ben Urich appears as a supporting character in Spider-Man: Battle for New York, voiced by Robin Atkin Downes."]}, {"page": "List of The Simpsons guest stars", "response": ["!scope=\"row\"|Robin Atkin Downes"]}, {"page": "At the Mountains of Madness", "response": ["* Edge of Nowhere, a 2016 video game developed by Insomniac Games, is set in 1952, 20 years after the expedition, and involves Victor Howard (Robin Atkin Downes) as he ventures into the site to locate his fiancée, who was on an expedition down a similar path."]}, {"page": "Doomsday (DC Comics)", "response": ["Doomsday ranked as #46 on IGN's list of the Top 100 Comic Book Villains of All Time. He is best known as the only character to kill Superman in combat in The Death of Superman story arc \"Doomsday!\". He appears in the film Batman v Superman: Dawn of Justice, where he was portrayed by Robin Atkin Downes through voice acting and motion capture.", "* Robin Atkin Downes voices and provides motion-capture for Doomsday in the 2016 film Batman v Superman: Dawn of Justice and was assisted in voicing him by Gary A. Hecker. After learning Kryptonian information from the historical archives on a scout ship that crashed, Lex Luthor uses General Zod's body to create a \"Kryptonian Deformity\", an act which had been forbidden by the Kryptonian Council prior to the planet's destruction. He finds out from the computer that this has been done \"before\" once by the Council, meaning that the real Doomsday could still be out there. Luthor places the lifeless corpse into the Genesis Chamber and gives the creature life with his own blood. In the climax of the film, Luthor sets the creature loose upon hatching from its \"egg sack\" to kill Superman, after Batman declines to do so, deeming the creature the Man of Steel's \"Doomsday\". During the battle, Doomsday displays massive superhuman strength, durability and stamina, as well as the ability to \"evolve\" and regenerate at an incredibly fast pace, growing bone protrusions and gaining more muscle mass, in addition to being able to absorb energy and fire heat blasts from his eyes and mouth. When Superman flies the monster into space and the military fires a nuclear missile with the hopes of incinerating him, Doomsday survives and absorbs the nuclear energy, gaining the ability to discharge electrical blasts from his body, capable of levelling a few city blocks at once. Although Wonder Woman soon joins the battle, Doomsday's strength proves to be far greater than that of the two heroes combined. However, Batman later surmises that because Doomsday was created from Kryptonian technology, he shares Superman's vulnerability to kryptonite. Lois retrieves the spear while Wonder Woman cuts off Doomsday's right hand and holds him down using the Lasso of Truth and Batman uses his last kryptonite round to weaken the monster. Doomsday is then killed when Superman impales him with Batman's kryptonite spear, but not before the creature gets a chance to stab the hero with a new large bone protrusion from his severed wrist, resulting in the demise of both characters. However, Superman was later resurrected in Justice League in the same chamber used to create Doomsday.16 'Batman v Superman' Spoilers For Those Too Eager To Wait Doomsday also made a brief cameo in a prologue of the Snyder Cut, picking up where the previous film left off. "]}, {"page": "Alfred Pennyworth", "response": ["* Robin Atkin Downes voiced Alfred Pennyworth in Justice League: Doom.", "* Alfred Pennyworth appears as a playable character in Lego Batman 3: Beyond Gotham, voiced by Robin Atkin Downes. He also has another version from his appearance in the Batman (TV Series) obtained by completing the “Same Bat Time, Same Bat Channel” level.", "* Alfred Pennyworth appears in Lego Dimensions, voiced again by Robin Atkin Downes."]}, {"page": "List of fictional doctors", "response": ["|Team Fortress 2 || The Medic || Robin Atkin Downes"]}, {"page": "Man-Bat", "response": ["* Kirk Langstrom / Man-Bat appears in the Beware the Batman animated series, voiced by Robin Atkin Downes. In the episode \"Doppelgänger\", Dr. Langstrom was working on a cure for diseases using bat DNA before Professor Pyg and Mister Toad raid his laboratory and force him at gunpoint to take a corrupted version of his formula, which mutates him into a man/bat hybrid. Pyg and Toad use a drug-filled mechanical collar to control the Man-Bat and force him to rob chemicals so that they can recreate Dr. Langstrom's formula and turn more humans into human/beast hybrids. However, Batman and Katana free the Man-Bat, who helps them defeat Pyg and Toad before leaving to find a cure for his condition. In the episode \"Alone\", Katana recruits the Man-Bat, among others, to help Batman fight Deathstroke."]}, {"page": "Dormammu", "response": ["* Dormammu appears in Marvel Heroes, voiced by Robin Atkin Downes."]}, {"page": "Deathstroke", "response": ["* Deathstroke appears in Beware the Batman, voiced by Robin Atkin Downes. This version of Slade Wilson was originally a CIA agent who was terminated by his mentor Alfred Pennyworth for his ruthless methods. Slade then became the international assassin \"Deathstroke\", and is eventually hired by Anarky and Harvey Dent to kill Batman. Deathstroke accepts the contract in order to exact revenge on Pennyworth, who has since \"replaced\" him with Bruce Wayne as a protégé. Slade poses as \"Dane Lisslow\" for most of the program's run to get close to Bruce and Alfred, and ends up losing his right eye during a fight with Batman in the series finale."]}, {"page": "Blackheart", "response": ["* Blackheart appears in the Ghost Rider film tie-in game, voiced by Robin Atkin Downes. This version can shapeshift into his film and comic book versions' appearances. A group of demons attempt to restore Blackheart, leading to Mephisto calling on Ghost Rider to stop them."]}, {"page": "DeSaad", "response": ["* Desaad appears as DLC for Lego Batman 3: Beyond Gotham, voiced by Robin Atkin Downes. "]}, {"page": "Abomination (character)", "response": ["* The Emil Blonsky incarnation of the Abomination appears in The Avengers: Earth's Mightiest Heroes animated series, voiced by Robin Atkin Downes. In the short episode, \"This Monster, This Hero\", he is seen as an inmate of the Cube. In the episode \"Breakout, Part 1\", the Abomination and his fellow prisoners escape following the Cube's sudden power failure. He briefly engages the Hulk, who retreats with Doc Samson, enabling the Abomination, the Leader, and the Absorbing Man to gain control of the Cube. In the two-part episode \"Gamma World\", the Abomination assists the Leader in a plot to turn everyone in the world into gamma monsters. However, the Avengers foil the plan, with the Hulk engaging the Abomination and throwing him into a nearby desert. The Abomination is later approached by and recruited into the Masters of Evil. Throughout the episodes \"Masters of Evil\", \"This Hostage Earth\", and \"Acts of Vengeance\", the Abomination continues to work with them until they are eventually captured by the Avengers and incarcerated in Prison 42.", "* The Emil Blonsky incarnation of the Abomination appears in the animated special Lego Marvel Super Heroes: Maximum Overload, voiced again by Robin Atkin Downes. – green check mark indicates roles that have been verified by BTVA through closing credits", "* The Emil Blonsky incarnation of the Abomination appears in the Hulk and the Agents of S.M.A.S.H. animated series, voiced again by Robin Atkin Downes.", "* The Emil Blonsky incarnation of the Abomination appears in the anime series Marvel Disk Wars: The Avengers, voiced Masaya Takatsuka in the Japanese version and again by Robin Atkin Downes in the English dub.", "* The Emil Blonsky incarnation of the Abomination appears in the Ultimate Spider-Man: Web Warriors animated series episode \"Contest of Champions\" [Part 1], voiced again by Robin Atkin Downes. He, the Beetle, and the Executioner are sent by the Grandmaster to obtain Spider-Man for his titular contest against the Collector.", "The Emil Blonsky incarnation of the Abomination appears in the animated direct-to-DVD film Iron Man & Hulk: Heroes United,(December 3, 2013), \"Iron Man & Hulk: Heroes United - Clip 3,\" Marvel. Retrieved December 20, 2016 voiced again by Robin Atkin Downes."]}, {"page": "Deadshot", "response": ["* Deadshot appears as a playable character in Lego Batman 3: Beyond Gotham, voiced by Robin Atkin Downes."]}, {"page": "Royal Flush Gang", "response": ["The Royal Flush Gang appears in the animated direct-to-DVD film Justice League: Doom, with King voiced by Jim Meskimen, Queen voiced by an uncredited Grey DeLisle, Jack voiced by an uncredited Robin Atkin Downes, Ten voiced by Juliet Landau, and Ace voiced by Bruce Timm. This version is a spades-themed group who have similar or altered abilities from the comics' original version. King wields a scepter capable of electrocuting targets at point blank range while Queen wields cards she can throw with incredible accuracy and speed as well as enough strength to cut through Batman's grappling lines. Additionally, Jack's laser eye, Ace's android construction, and Ten's energy blasts have not been changed, although Ten's explosive playing cards are not seen. The Royal Flush Gang attempt to rob a bank using dimensional phasing technology, but are hindered by Batman. They manage to overcome him, but the Justice League arrive and foil the gang. The heroes are unable to find out who supplied the Royal Flush Gang with their technology as they did not know themselves. Unbeknownst to the Justice League, Vandal Savage used the gang as a distraction so Mirror Master could infiltrate the Batcave."]}, {"page": "Mad Hatter (DC Comics)", "response": ["* The Jervis Tetch incarnation of the Mad Hatter appears in the animated film Batman: Bad Blood, voiced by Robin Atkin Downes. This version works for the League of Assassins as one of Talia al Ghul's henchmen and helped turn Heretic, a clone of Damian Wayne, into the perfect soldier for the League. After Heretic captures Batman, Tetch reprograms his mind to follow Talia's orders and reveal his and his allies' secrets. After Batman helps the League infiltrate the World Tech Summit and take over Wayne Enterprises' technologies, Tetch brainwashes all of the attending politicians and dignitaries into obeying Talia. However, he is killed by a system overload caused in the ensuing battle between Batman's allies and Talia's henchmen."]}, {"page": "Baron Strucker", "response": ["* Baron Strucker appears in Avengers: Ultron Revolution, voiced by Robin Atkin Downes. Besides being a member of HYDRA, this version was shown to have reactivated the Red Room while operating in Siberia. In the episode \"Seeing Double\", he sends the new Black Widow (Yelena Belova) to abduct Bruce Banner in order to use the Winter Soldier program that would turn Banner into the Winter Hulk, revealing all of this to the original Black Widow (Natasha Romanova). When Iron Man and Captain America show up, the two Avengers help Natasha to fight Strucker and Winter Hulk until Yelena goes against Strucker's orders and knocks him out. In the episode \"Civil War, Part 2: The Might Avengers\", Strucker leads a HYDRA raid on Truman Marsh's secret facility to gain control of. During his fight with the Mighty Avengers, Strucker also fights the Avengers and is defeated."]}, {"page": "Baron Zemo", "response": ["* A hybridized version of Baron Zemo appears in The Avengers: Earth's Mightiest Heroes animated series, voiced by Robin Atkin Downes. This version is identified as Heinrich, but displays Helmut's characterization and wears his first comics costume, and is the founder of Hydra. In WWII, he developed and attempted to use a pathogen called \"Virus X\" on the Allies. However, Captain America foiled the plot and inadvertently exposed Zemo to it, granting the latter an extended life-span that allowed the latter to survive to the present day. He was also imprisoned in the Raft off-screen sometime prior to the series before escaping in the episode \"Breakout, Part 1\". In the episode \"Living Legend\", Zemo attempts to reclaim Hydra's leadership from Baron Strucker until he learns the Avengers found and revived Captain America. Zemo recruits Arnim Zola and Doughboy to help him assault Avengers Mansion, but the Avengers defeat Doughboy while Zemo is foiled by the Black Panther. Following this, Zemo is approached by the Enchantress and the Executioner. In the episode \"Masters of Evil\", Heinrich leads the titular group in attacking and capturing the Avengers, only to be driven off by the Black Panther, Hawkeye, and Ant-Man. In the episode \"This Hostage Earth\", the Masters of Evil acquire the Norn Stones, but Zemo betrays the Enchantress upon learning she was actually working for Loki, which eventually results in the Avengers destroying most of the stones. In the episode \"Acts of Vengeance\", Zemo and the Masters of Evil attempt to escape the Enchantress's wrath by joining forces with the Avengers. Following her defeat, Zemo discovers Captain America had been replaced by a Skrull infiltrator before being incarcerated in Prison 42. Zemo also makes a minor appearance in the episode \"Assault on 42\"."]}, {"page": "Shinnok", "response": ["Shinnok appears in the animated film Mortal Kombat Legends: Battle of the Realms, who was voiced by Robin Atkin Downes."]}, {"page": "Moon Knight", "response": ["* Moon Knight appears as an assist character in Spider-Man: Web of Shadows, voiced by Robin Atkin Downes. He assists Spider-Man in his fight with Black Cat before working with him to disrupt the Kingpin's illegal activities and repelling the symbiotes' invasion. ", "* Moon Knight appears as an unlockable playable character in Marvel Heroes, voiced again by Robin Atkin Downes."]}, {"page": "List of Mortal Kombat characters", "response": [": Voiced by: Ed Boon (MK:D), David Beron (MK:A), Robin Atkin Downes (MKL:BOTR)", "Outside of the games, Jim Helsinger played Reiko in the 1998 television series Mortal Kombat: Conquest, where he is one of Shao Kahn's generals. Reiko also appeared in the 2021 Mortal Kombat film, portrayed by Nathan Jones, as one of the Outworld champions. He faces off against Jax in the film's final battle, eventually being killed when Jax crushes his head. Reiko appears in the sequel Mortal Kombat Legends: Battle of the Realms voice by Robin Atkin Downes."]}, {"page": "Kano (Mortal Kombat)", "response": ["English actor Robin Atkin Downes voices Kano in the 2020 animated film Mortal Kombat Legends: Scorpion's Revenge."]}, {"page": "Justice League Unlimited", "response": ["* Robin Atkin Downes – Gentleman Ghost, Sinestro (in \"Alive\")"]}, {"page": "Prince of Persia: Warrior Within", "response": ["As opposed to the shorter hair and exquisite robes from the first game, the Prince's hair is long and he wears armor and bandages. The game had a change of voice actors; the Prince is voiced by Robin Atkin Downes, in the previous (and following) game he was voiced by Yuri Lowenthal. Kaileena is voiced by Italian actress Monica Bellucci and a sound-alike actress (Alicyn Packard). The Sands of Time featured a soundtrack by Stuart Chatwood, consisting of a fusion of Arabic- and Indian-influenced melodies with heavy metal. Chatwood remained the composer for Warrior Within, though the music became more guitar-oriented; it featured Godsmack's \"I Stand Alone\" without vocals as the Dahaka's chase theme and \"Straight Out of Line\" over the game's credits.Prince of Persia: Warrior Within (2004) (VG) – Full cast and crew"]}, {"page": "Manchester Black", "response": ["Manchester Black appears as the main antagonist in Superman vs. The Elite, voiced by Robin Atkin Downes as an adult and with Grey DeLisle as a young Manchester. Like the comics, Manchester Black is the leader of the Elite where they do justice their way. Unlike the events of the original story, Superman actually does destroy the growth responsible for Manchester's powers, permanently removing them.", "Manchester Black appears as an unlockable playable character in Lego Batman 3: Beyond Gotham, voiced again by Robin Atkin Downes."]}, {"page": "List of Halo characters", "response": ["High Prophets, or Hierarchs, are the supreme leaders of the theocratic Covenant. Upon assuming office, each Hierarch picks a new regnal name from a list of names of former Hierarchs, similar to the practice of some Orthodox Patriarchs.Staten, Joseph. Halo: Contact Harvest, pg 384. In Halo 2, there are shown to be only three; the Prophets of Truth, Mercy, and Regret (voiced by Michael Wincott, Hamilton Camp and Robin Atkin Downes in Halo 2, respectively; in Halo 3, Truth is voiced by Terence Stamp). The novel Halo: Contact Harvest reveals that these three Prophets, originally known as the Minister of Fortitude, the Vice-Minister of Tranquility, and the Philologist,Staten, Joseph. Halo: Contact Harvest, pg 383. plotted to usurp the throne of the Hierarchs; in the process, they hide the truth that humanity is descended from the Covenant gods, the Forerunners, believing that the revelation could shatter the Covenant. During the course of Halo 2, Regret attacks Earth, and then retreats to Delta Halo. There, he calls for reinforcements, but is killed by the Master Chief. Later, Mercy is attacked by the Flood on High Charity; Truth could have saved him, but left him to die so he could have full control over the Covenant. In Halo 3: ODST, Truth is seen inspecting some Engineers around the Forerunner construct near New Mombasa. In Halo 3, Truth also meets his demise at the hands of the Arbiter when the Prophet attempts to activate all the Halo rings from the Ark. His death becomes the culmination of the Covenant's downfall."]}, {"page": "X-Men Legends", "response": ["The game's voice cast consists largely of television and film stars as well as veteran voice actors. Patrick Stewart reprised his role as Professor Xavier from the X-Men films, while Tony Jay voiced Magneto. Ed Asner lent his voice as Healer, a Morlock shaman. Lou Diamond Phillips voiced Forge, a Native American mutant whose power grants him intuitive talent for inventing mechanical devices. Danica McKellar voiced Jubilee, a young mutant who generates plasmoids from her fingertips. Veteran voice actors Steven Blum, Grey DeLisle, Dee Bradley Baker, Robin Atkin Downes and Dorian Harewood also lent voices as Wolverine, Mystique, Nightcrawler, Cyclops and Shadow King, respectively.  Music for the game was composed by Rik Schaffer of the Los Angeles-based Womb Music."]}, {"page": "Solaris (comics)", "response": ["* Solaris appears in All-Star Superman, voiced by Robin Atkin Downes.http://www.worldsfinestonline.com/news.php/news.php?action=fullnews&id=966 "]}, {"page": "List of Lost characters", "response": ["| Simon Pace || Robin Atkin Downes, John Henry Canavan || Charlie's father ||2, 3"]}, {"page": "Captain Cold", "response": ["* Captain Cold appears as a playable character in Lego Batman 3: Beyond Gotham, voiced by Robin Atkin Downes."]}, {"page": "List of actors who played the president of the United States", "response": ["| Robin Atkin Downes || Assassin's Creed III || 2012"]}, {"page": "Team Fortress 2", "response": ["* The Medic (Robin Atkin Downes) is a German doctor from Stuttgart with little regard for the Hippocratic Oath. He is equipped with a \"Medi Gun\" that can restore health to injured teammates. When healing teammates, the Medi Gun progressively builds an \"ÜberCharge\" meter, which, when fully charged, can be activated to provide the Medic and his patient with temporary invulnerability. The Medic is also equipped with a syringe gun and a bonesaw for situations in which he must fight without his teammates' protection. He keeps doves as pets, one of which is named Archimedes."]}, {"page": "1976 in American television", "response": ["|Robin Atkin Downes"]}, {"page": "Harvey Bullock (character)", "response": ["* Harvey Bullock appears in Batman: The Killing Joke, voiced by Robin Atkin Downes."]}, {"page": "Annihilus", "response": ["* Annihilus appears in the Hulk and the Agents of S.M.A.S.H. animated series, voiced by Robin Atkin Downes. In the two-part series premiere \"Doorway to Destruction\", Annihilus uses mind-control devices supplied by the Leader to brainwash Skaar and the Red Hulk to help him attack Vista Verde and siphon gamma energy so he can open a portal to the Negative Zone and invade Earth. However, he is foiled by the Hulk, She-Hulk, and A-Bomb. In the episode \"Into the Negative Zone\", the Leader confiscates and modifies Annihilus' Cosmic Control Rod, but is defeated by the Hulk, allowing Annihilus to steal the rod back and escape.", "* Annihilus appears in the Ultimate Spider-Man: Web Warriors animated series episode \"Contest of Champions\" Pt. 3, voiced again by Robin Atkin Downes. The Grandmaster paired him with Attuma and Terrax to fight the Collector's team of Spider-Man, Iron Spider, Agent Venom, and Thor.", "* Annihilus appears in the \"Shadow of Doom\" DLC of Marvel Ultimate Alliance 3: The Black Order, voiced by Robin Atkin Downes.Behind the Voice Actors of Marvel Ultimate Alliance 3 The Fantastic Four join the heroes that Doctor Doom trapped in the Negative Zone and steal Annihilus' Cosmic Control Rod so they can return to Earth."]}]}}