{"wiki_id": "http://www.wikidata.org/entity/Q4345811", "itemLabel": "Edward Abbott Parry", "itemDescription": "English judge and dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Abbott_Parry", "wikipedia_page": {"main": "Sir Edward Abbott Parry (2 October 1863 – 1 December 1943) was a British judge and dramatist.Parry was born in London into a prominent Welsh family, the second son of barrister John Humffreys Parry and grandson of antiquary John Humffreys Parry, a leader of the Welsh literature movement in the early 19th century. His great-uncle Thomas Parry was bishop of Barbados and his great-grandfather Edward Parry was Rector of Llanferres, Denbighshire.Parry himself studied at the Middle Temple and was called to the Bar in 1885. He was Judge of Manchester County Court 1894-1911 and became Judge of Lambeth County Court in 1911. He wrote several plays and books for children. He was appointed to sit on a Pensions Appeal Tribunal in the summer of 1917, which dealt with appeals against governmental decisions on military pensions, and later published a book on War Pensions: Past and Present, co-authored with Sir Alfred Codrington, another member of the Tribunal.He died in Sevenoaks, Kent, aged 80.Beyond the stark details of this curriculum vitae, much can be learnt about Parry as a man from his autobiography. To cite one anecdote, he took a summer holiday, probably in 1895 or 1896, in the tiny village of Rhoscolyn on Anglesey and became a great friend of the Revd. John Hopkins, the Rector. When Hopkins died in 1901, Parry was instrumental (with others) in erecting a fine copper memorial tablet in the church. He also published an appreciation in the Cornhill Magazine. The obvious mutual empathy and warmth of the friendship between two men of such different backgrounds is a credit to both: the London-educated judge, son of a barrister and the iron miner (before his ordination) and son of a Merthyr publican, fined for selling beer during the time of divine service.", "link_mentions": [{"page": "Harry Furniss", "response": ["*Gamble Gold by Judge Edward Abbott Parry — 1907"]}, {"page": "Culture of Manchester", "response": ["Edward Abbott Parry (born in London in 1863) was a judge and dramatist who lived in Manchester as judge of Manchester County Court 1894–1911.Resident of Burlington Road, Withington--Lejeune, C. A. (1964) Thank You for Having Me. London: Hutchinson; p. 36 and became Judge of Lambeth County Court in 1911. He wrote several plays and books for children.The Green Room Book, and Who's Who on the Stage. 1907"]}, {"page": "Edward Parry", "response": ["* Edward Abbott Parry (1863–1943), English judge and dramatist"]}, {"page": "Alfred Codrington", "response": ["He commanded the 1st London Division of the Territorial Force from 1908 to 1909, when he was appointed Major-General commanding the Brigade of Guards and General Officer Commanding London District, retiring from this post in 1913. He returned to duty after the outbreak of the First World War, serving as the Military Secretary to Lord Kitchener, the Secretary of State for War, from August until October 1914. He was then appointed to command Third Army in the Home Forces; this was based around Luton, and contained four Territorial divisions and two Territorial cavalry brigades.Rinaldi, p. 26 He relinquished command in 1916. He was appointed to sit on a Pensions Appeal Tribunal in the summer of 1917, which dealt with appeals against governmental decisions on military pensions, and later published a book on War Pensions: Past and Present, co-authored with Edward Abbott Parry, another member of the Tribunal.Digitised copy"]}, {"page": "Abbott Parry", "response": ["#REDIRECT Edward Abbott Parry"]}, {"page": "2014 in public domain", "response": ["* Edward Abbott Parry, an English playwright and children's author."]}, {"page": "John Humffreys Parry", "response": ["Parry was twice married: first, to Margaret New, who died on 13 September 1856; and afterwards to Elizabeth Mead, daughter of Edwin Abbott; she predeceased him by a few hours. He had two sons, of whom the elder, John Humffreys, an actor, died in 1891; the second was Edward Abbott Parry, judge and man of letters."]}, {"page": "1927 Birthday Honours", "response": ["*His Honour Judge Edward Abbott Parry  late County Court Judge"]}, {"page": "Helen Parry Eden", "response": ["She was born Helen Parry, the daughter of Edward Abbott Parry. She was educated at Roedean School, Manchester University, and King's College Art School, where she studied 1903–5 under Byam Shaw and Vicat Cole. "]}, {"page": "Denis Eden", "response": ["Around this time Denis Eden became friends with Helen Parry Parry (sic).'[They] had long been friends before this relationship was cemented by marriage [in 1907]' – The Catholic Bookman, vols. 6–7 (1942), p. 139. Seven years younger than Denis,England census records of 1901 show the Parry family were living at Witherington in Lancashire and Helen Parry Parry, aged 15, was born in Wimbledon, Surrey (ancestry.co.uk). The 1939 England and Wales Register gives her birth date as 18 August 1885 (ancestry.co.uk). Helen was the eldest daughter of the lawyer Edward Abbott Parry and was educated at Roedean School in Sussex.Katherine Brégy, 'Who's Who Among Catholic Writers', The Catholic Transcript, 18 February 1937. When she was 18 she studied for the preliminary examination in Arts at Manchester University (officially taking Latin and French, but she also appears to have attended history lectures).Manchester University archives, email, March 2021. She won the Vice-Chancellor's Prize for English verse in 1904,The Tablet, 28 May 1921. and progressed to study painting at the Women's Department of King's College London – based at Kensington SquareMariale, ed. Garvey Literary Society, St Francis Seminary, Loretto, Pa., 1930, p. 71. – where the artist Byam Shaw had just started teaching.'Byam Shaw', Wikipedia. Shaw was six years older than Denis Eden but shared a similar background, having attended St John's Wood Art School before the Royal Academy Schools, and was also influenced by the Pre-Raphaelite movement in style and subject matter.For more on Byam Shaw see Tim Barringer, 'Not a \"modern\" as the word is now understood'? Byam Shaw, imperialism and the poetics of professional society', in David Peters Corbett & Lara Perry (eds.), English Art, 1860–1914: Modern Artists and Identity (Manchester: Manchester University Press, 2000). It seems likely that Helen Parry was in turn influenced by Shaw's medievalist aesthetic – although there seem to be no available reproductions of her work."]}]}}