{"wiki_id": "http://www.wikidata.org/entity/Q4347103", "itemLabel": "Colin Pattenden", "itemDescription": "English rock bassist", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Pattenden", "wikipedia_page": {"main": "Colin Roy Pattenden (born November 1947, Farnborough, Kent, England) is an English bass guitarist, chiefly known for his membership of Manfred Mann's Earth Band.\nPattenden was taught guitar but learned to play bass from tuition books, chiefly those of Carol Kaye, the American bassist guru. Pattenden worked as a session guitarist for Engelbert Humperdinck and Leapy Lee in the 1960s.He played in MMEB from its formation in 1971. Pattenden featured on seven Earth Band albums from their debut in 1972 to The Roaring Silence in 1976. Pattenden quit MMEB in 1977. In 1978, he teamed up with former MMEB drummer Chris Slade and vocalist Peter Cox, in the short lived Terra Nova.He has also played with Mungo Jerry, The King Earl Boogie Band, The Jackie Lynton Band, and The Nashville Teens.He is currently working as a PR consultant and manages CP Sound Limited an audio system and lighting design and installation company.In an interview by fellow former bandmate Chris Slade, Colin Pattenden was considered along with Cliff Williams to replace Mark Evans in AC/DC.", "link_mentions": [{"page": "Manfred Mann", "response": ["However, the new group was short-lived and by 1971 after a second album (and an unreleased possibly incomplete third) they had disbanded and Mann had formed a new group. The original line-up of this new group consisted of Mick Rogers (guitar and vocals), Manfred Mann (organ, synthesizer and vocals), Colin Pattenden (bass guitar) and Chris Slade (drums and vocals). In its very earliest stages, the band was simply billed as 'Manfred Mann' and thus a continuation of the 1960s group. The quartet (as 'Manfred Mann') released their first single, Dylan's \"Please, Mrs. Henry\", in 1971. Their second single, Randy Newman's \"Living Without You\", was also released by 'Manfred Mann' in Europe, but by 'Manfred Mann's Earth Band' in the US, where the track became a minor chart hit. From 1972 onward 'Manfred Mann's Earth Band' was the band name used on all releases by this group, and they are considered a separate band from Manfred Mann."]}, {"page": "Sunbury-on-Thames", "response": ["|Colin Pattenden – Bassist of Manfred Mann's Earth Band||The Dormer House||2010s"]}, {"page": "The Nashville Teens", "response": ["Arthur Sharp left in 1972 to join the band's one-time manager Don Arden, and Trevor Williams joined. Despite Phillips's efforts, the Nashville Teens split in 1973. The band re-formed in 1980, however, with Phillips as the only original member, joined by Peter Agate (guitar), Len Surtees (bass) and Adrian Metcalfe (drums). The band is still working. Phillips joined the British Invasion All-Stars in the 1990s and made three albums with the group, consisting of members of The Yardbirds, The Creation, The Pretty Things, Downliners Sect and other groups. The band did a cover of \"Tobacco Road\" that still receives airplay on XM Satellite Radio. The current line-up is Phillips, Metcalfe, Colin Pattenden (bass and vocals), Simon Spratley (keyboards and vocals) and Ken Osborn (guitar).", "*Colin Pattenden – bass guitar, lead vocals (?–present)"]}, {"page": "Manfred Mann's Earth Band", "response": ["The original line-up consisted of Mick Rogers (guitar and vocals), Manfred Mann (keyboards, Minimoog synthesizer and vocals), Colin Pattenden (bass guitar) and Chris Slade (drums and vocals). In its very earliest stages, the band was sometimes billed as \"Manfred Mann\" and thus a continuation of the 1960s group, sometimes as \"Manfred Mann Chapter Three\" due to that being the most recent incarnation of Mann's career. The quartet released their first single, Bob Dylan's \"Please, Mrs. Henry\", in 1971, simply credited to \"Manfred Mann\". A debut album \"Stepping Sideways\" was recorded but not released because the band's style was rapidly maturing, and the group felt it wasn't representative of their live act anymore. In September 1971, a new name was chosen. Manfred Mann suggested a title containing \"band\" (which almost rhymes with \"Mann\") and after considering the likes of \"Arm Band\", \"Head Band\" and \"Elastic Band\", Chris Slade suggested \"Earth Band\", a name both related to the band's originally straightforward musical style and the ecological movement ongoing at the time.Greg Russo, Mannerisms – The five phases of Manfred Mann (Revised Edition), Crossfire Publications, 2011, , p.121", "Following these popular successes, the Earth Band released the album Watch (1978), which produced another UK hit single in \"Davy's on the Road Again\". This song, as well as the re-recording of \"Mighty Quinn\" (also released as a single to celebrate the original 1968 hit's tenth anniversary), was recorded live with studio overdubs. Before the recording of the album, original bassist Colin Pattenden had departed and was replaced by Pat King.", "*Colin Pattenden – bass (1971–1977)", " bar:ColPat   text:Colin Pattenden"]}, {"page": "Powerage", "response": ["After a 12-date European tour opening for Black Sabbath in April, bassist Mark Evans was fired from AC/DC on 3 May 1977.  In the AC/DC memoir AC/DC: Maximum Rock & Roll, former manager Michael Browning states, \"I got a call one day from Malcolm and Angus.  We were in London, I went to their apartment and they told me they wanted to get rid of Mark.  Him and Angus didn't see eye to eye.  They used to have a sort of tit-for-tat thing going, but nothing that I would have ever thought was going to be gig-threatening.\"  According to Browning, the Young brothers were seriously considering Colin Pattenden of Manfred Mann fame. Browning feared that Pattenden was too old and didn't fit the band's image, so he instead pushed for Englishman Cliff Williams, who had previously played with Home and Bandit. Williams, who could also sing background vocals, passed the audition and was asked to join the band.  In a 2011 interview with Joe Bosso that appears on MusicRadar, Evans reflected on his ousting from the group: "]}, {"page": "Blinded by the Light", "response": ["*Colin Pattenden – bass"]}, {"page": "Messin'", "response": ["* Colin Pattenden – Bass guitar"]}, {"page": "The Roaring Silence", "response": ["The Roaring Silence is the seventh studio album by English rock band Manfred Mann's Earth Band. It was released on 27 August 1976, by Bronze Records in the UK and by Warner Bros. Records in the US. Like other Earth Band albums, this includes material by other composers. \"Blinded by the Light\", which reached number one on the Billboard Hot 100, is a cover version of a song by Bruce Springsteen; \"Questions\" is based on the main theme of Franz Schubert's Impromptu in G flat Major (1827);Südwestrundfunk page on The Roaring Silence Swr.de (in German) \"Starbird\" takes its theme from Igor Stravinsky's ballet The Firebird (1910); and \"The Road to Babylon\" is based on the canon \"By the Waters of Babylon\" by Philip Hayes. This album marked the arrival of vocalist/guitarist Chris Hamlet Thompson, and Dave Flett who replaced longtime guitarist/vocalist/composer Mick Rogers. It is also the last album recorded with founding member Colin Pattenden.", "* Colin Pattenden – bass"]}, {"page": "Mick Rogers (musician)", "response": ["In 2020, Rogers planned to play material of the early Earth Band with original member Colin Pattenden and keyboardist Mike Keneally at the Burg Herzberg Festival under the moniker \"Solar Fire\", however this didn't happen due to the COVID-19 pandemic. The appearance was rescheduled twice and is now planned for 2022."]}, {"page": "Nightingales & Bombers", "response": ["# \"Crossfade\" (Mann, Slade, Rogers, Colin Pattenden) – 3:38", "* Colin Pattenden – bass"]}, {"page": "Pat King", "response": ["King is best known as the bass guitar player for Manfred Mann's Earth Band between 1977 and 1982.Larkin, Colin (2007) The Encyclopedia of Popular Music, Bish Bash Books; 5th concise edition, , entry for \"Manfred Mann's Earth Band\" King replaced founding member Colin Pattenden, who left the band in 1977.  He is featured on the albums Watch, Angel Station and Chance."]}, {"page": "Glorified Magnified", "response": ["* Colin Pattenden – bass guitar"]}, {"page": "Manfred Mann's Earth Band (album)", "response": ["* Colin Pattenden – Bass guitar"]}, {"page": "The Good Earth (Manfred Mann's Earth Band album)", "response": ["* Colin Pattenden – bass guitar"]}, {"page": "Solar Fire", "response": ["#\"Pluto the Dog\" (Mann, Rogers, Slade, Colin Pattenden) – 2:48", "* Colin Pattenden – bass guitar"]}, {"page": "Peter Cox (musician)", "response": ["Peter John Cox sang in his school choir and later as a chorister at The Chapel Royal, Hampton Court Palace. In his early twenties, he worked in a covers band for The Mecca Organisation. In 1978, he joined Terra Nova, a band put together by former Manfred Mann's Earth Band members Chris Slade and Colin Pattenden; they released an album in 1980. While in residency in a Sheffield nightclub, Cox began writing with longtime collaborator Richard Drummie, with whom he eventually signed a publishing deal."]}]}}