{"wiki_id": "http://www.wikidata.org/entity/Q4355722", "itemLabel": "Tony Blackburn", "itemDescription": "British radio presenter, offshore broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Blackburn", "wikipedia_page": {"main": "Anthony Kenneth Blackburn (born 29 January 1943) is an English disc jockey, singer and TV presenter. He first achieved fame broadcasting on the pirate stations Radio Caroline and Radio London in the 1960s, before joining the BBC, on the BBC Light Programme. He was the first disc jockey to broadcast on BBC Radio 1 at its launch, on 30 September 1967, and has had several stints working for the corporation. He has also worked for Capital London and Classic Gold Digital, and currently BBC Radio 2, BBC Local Radio, and KMFM. He has also had a singing career.\nIn 2002 Blackburn was the first winner of the British reality TV series I'm a Celebrity...Get Me Out of Here!\n\n", "link_mentions": [{"page": "BBC Radio 1", "response": ["The first disc jockey to broadcast on the new station was Tony Blackburn, whose cheery style, first heard on Radio Caroline and Radio London, won him the prime slot on what became known as the \"Radio 1 Breakfast Show\". The first words on Radio 1 – after a countdown by the Controller of Radios 1 and 2, Robin Scott, and a jingle, recorded at PAMS in Dallas, Texas, beginning \"The voice of Radio 1\" – were:", "At the start of 1981, Mike Read took over The Radio 1 Breakfast Show from Dave Lee Travis. Towards the end of the year, Steve Wright started the long-running Steve Wright in the Afternoon show. In 1982, the new Radio 1's Weekend Breakfast Show started, initially with Tony Blackburn supported by Maggie Philbin and Keith Chegwin. Adrian John and Pat Sharp also joined for the early weekend shows. Gary Davies and Janice Long also joined, hosting Saturday night late and evening shows respectively.", "In September 2017, a new slot namely Radio 1's Greatest Hits was introduced for weekends 10am-1pm. The show started on 2 September 2017. On 30 September 2017, Radio 1 celebrated its 50th birthday. Commemorations include a three-day pop-up station Radio 1 Vintage celebrating the station's presenters and special on-air programmes on the day itself, including a special breakfast show co-presented by the station's launch DJ Tony Blackburn, which is also broadcast on BBC Radio 2.", " To mark this anniversary Radio 1 hosted a week of special features, including a re-creation of Simon Bates' Golden Hour, and 40 different artists performing 40 different covers, one from each year since Radio 1 was established. On Saturday 30 September 2017, Radio 1 celebrated its 50th birthday. Tony Blackburn recreated the first ever Radio 1 broadcast on Radio 2, simulcast on pop-up station Radio 1 Vintage, followed by The Radio 1 Breakfast Show celebration, tricast on Radio 1, Radio 2 and Radio 1 Vintage, presented by Tony Blackburn and Nick Grimshaw, featuring former presenters as guests Simon Mayo, Sara Cox and Mike Read."]}, {"page": "Dead Kennedys", "response": ["When \"Too Drunk to Fuck\" came out in May 1981, the song caused much controversy in the UK as the BBC feared the single would reach the Top 30; this would require a mention of the song on Top of the Pops. It was never played although it was called \"'Too Drunk' by the Kennedys\" by presenter Tony Blackburn."]}, {"page": "January 29", "response": ["*1943 – Tony Blackburn, English radio and television host"]}, {"page": "Cliff Richard", "response": ["In 1998, Chris Evans, the then breakfast show host on Virgin Radio, vowed he would never again play a record by Richard, stating that he was \"too old\". In June 2004, British disc jockey Tony Blackburn was suspended from his radio job at Classic Gold Digital for playing records by Richard against station policy. The head of programmes, Paul Baker, sent an e-mail to Blackburn stating that Richard \"doesn't match our brand values. He's not on the playlist, and you must stop playing him.\" On Blackburn's next morning breakfast show, he read a print-out of the e-mail live on air to the show's 400,000 listeners and went on to play two songs by Richard. Classic Gold managing director John Baish later confirmed Blackburn's suspension from the show."]}, {"page": "Holmfirth", "response": ["The former Lodge's supermarket building had been sitting empty in the heart of the town since the Co-op moved to new premises in Crown Bottom. Lodge's was built in the 1970s by the prominent local grocery company. It was opened by Radio 1 DJ Tony Blackburn and occupied an unusual location over the River Holme beside the town's small bus station. Lodge's was bought in the 1990s by Co-operative Retail Services who eventually closed the store down in 1997, after investing in a brand new £2 million supermarket for the town. Local residents, led by the Holme Valley Business Association, campaigned for its demolition. Their campaign was featured in the 2005 Channel 4 documentary, Demolition. The building has since been converted into several smaller shops, including a Sainsbury's Local, with some accommodation on the top floor."]}, {"page": "Tommy (The Who album)", "response": ["When it was released, critics were split between those who thought the album was a masterpiece, the beginnings of a new genre, and those that felt it was exploitative. The album had a hostile reception with the BBC and certain US radio stations, with Tony Blackburn describing \"Pinball Wizard\" as \"distasteful\". Nevertheless, BBC Radio 1 received an advance copy of the album at the start of May and gave the material its first airplay on Pete Drummond's show on 3 May. Townshend promoted the album's release with interviews in which he attempted to explain the plotline. Unfortunately, because it fundamentally dealt with the abstract concept of Meher Baba's spiritual precepts, the interviews often gave confusing and contradictory details."]}, {"page": "1943 in music", "response": ["*January 29 – Tony Blackburn, British radio DJ and singer"]}, {"page": "BBC Radio", "response": ["The BBC hired many out-of-work broadcasting staff who had come from the former offshore stations. Kenny Everett was asked for input in how to run the new pop station due to his popularity with both listeners and fellow presenters. Tony Blackburn, who presented the very first BBC Radio 1 breakfast show, had previously presented the same morning show on Radio Caroline and later on Big L. He attempted to duplicate the same sound for Radio 1. Among the other DJs hired was the late John Peel who had presented the overnight show on \"Big L\", called The Perfumed Garden. Though it only ran for a few months prior to Big L's closure, The Perfumed Garden got more fan mail than the rest of the pop DJ's on Radio London put together, so much that staff wondered what to do with it all. The reason it got so much mail was that it played different music, and was the beginning of the \"album rock\" genre. On Everett's suggestion, Big L's PAMS jingles were commissioned to be resung in Dallas, Texas so that \"Wonderful Radio London\" became \"Wonderful Radio One on BBC\"."]}, {"page": "BBC Light Programme", "response": ["* Tony Blackburn"]}, {"page": "Poole", "response": ["The town has been the birthplace and home to notable people, of national and international acclaim. Former residents include British radio disc jockey Tony Blackburn, the artist Augustus John, John Lennon's aunt and parental guardian Mimi Smith, and The Lord of the Rings author J. R. R. Tolkien who lived in Poole for four years during his retirement. Alfred Russel Wallace, the 19th-century explorer, naturalist and co-formulator of the theory of evolution by natural selection, moved to Poole in 1902 when he was 78 years old and is buried in Broadstone cemetery."]}, {"page": "Gary Hume", "response": ["Hume abandoned doors in the mid-1990s, turning to paintings in household gloss paint on aluminium panel, for these often used appropriated images, including pictures of celebrities (e.g. DJ Tony Blackburn) and animals. Their forms and colours are dramatically simplified, with people being reduced to just two or three colours.  Snowman (1996), for example, is made up of three shades of red, showing a circle on top of a larger circle against a lighter background. At first, Hume used mainly bright colours, but later pieces have used more muted tones."]}, {"page": "Top of the Pops", "response": ["On 20 June 2006, the show was formally cancelled and it was announced that the last edition would be broadcast on 30 July 2006. Edith Bowman co-presented its hour-long swansong, along with Jimmy Savile (who was the main presenter on the first show), Reggie Yates, Mike Read, Pat Sharp, Sarah Cawood, Dave Lee Travis, Rufus Hound, Tony Blackburn and Janice Long.", "* Benny Hill did a parody of Top of the Pops in January 1971 called \"Top of the Tops\". It featured satires of many music acts at the time as well as impersonations of both Jimmy Savile and Tony Blackburn."]}, {"page": "Dale Winton", "response": ["In 2000, Winton took over from Alan Freeman to present Pick of the Pops on BBC Radio 2, and hosted the show until 30 October 2010, when Tony Blackburn replaced him. Winton sat in for Steve Wright and Liza Tarbuck on BBC Radio 2, covering the latter's Saturday show in September 2013 and November/December 2016."]}, {"page": "2004 in music", "response": ["*June 23 – UK DJ Tony Blackburn is suspended by radio station Classic Gold Digital for playing songs by Cliff Richard, against station policy."]}, {"page": "Kenny Everett", "response": ["Everett returned to Capital Radio in June 1984, reviving his Saturday lunchtime show. In May 1985, he was called in to replace Graeme Garden for one episode of the Radio 4 game show I'm Sorry I Haven't a Clue. After Capital split its frequencies in 1988, he returned to daily broadcasting on Capital Gold, as part of a strong presenting line-up including Tony Blackburn and David Hamilton. Everett presented daytime shows on weekdays until 1994, when his health deteriorated to the point he was unable to continue. During that same year, he was awarded the Special Gold Award at Sony's Radio Academy Awards for his contribution to radio."]}, {"page": "Peter Tatchell", "response": ["In 1987 Tatchell appeared on the second programme of the first series of After Dark, a discussion on press ethics with, among others, Tony Blackburn, Victoria Gillick, Johnny Edgecombe and a Private Eye journalist. "]}, {"page": "Clodagh Rodgers", "response": ["Young wrote and produced many of these songs. She also recorded \"Scrapbook,\" penned by Billy Ritchie, which appeared on her 1969 album Midnight Clodagh. In 1970 she recorded \"Give Me Just a Little More Line\" with Young under the name Moonshine; though it achieved airplay and critical notice, it failed to chart. Rodgers picked this track as one of her eight favourite discs when she appeared as the featured castaway on the BBC's Desert Island Discs in March 1971. In May 1970 Rodgers appeared on the bill at the NME poll-winner's concert, hosted by Tony Blackburn and Jimmy Savile."]}, {"page": "Sonia (singer)", "response": ["In 2018, Sonia appeared alongside Todd Carty, Tony Blackburn, Colin Baker and Sherrie Hewson in Channel 5's Celebrity 5 Go Caravanning."]}, {"page": "Tara Palmer-Tomkinson", "response": ["Palmer-Tomkinson's presenting credits included Animals Do the Funniest Things with Tony Blackburn, the UK selection for the Junior Eurovision Song Contest in 2003, The British Comedy Awards...Party On, What Kids Really Think, Popworld, Top of the Pops, SMTV Live, Company Magazine Bachelor of the Year, Dumb Britain, Extreme, a role as a team captain on Bognor or Bust which was hosted by Angus Deayton and work for GMTV, Five, LBC radio, the music channel The Hits and the Living TV programme Dirty Cows."]}, {"page": "Al Stewart", "response": ["In April 2017, Stewart was given a Lifetime Achievement award at the BBC Radio 2 Folk Awards, presented by Tony Blackburn, with whom he had once played in a band in Dorset."]}, {"page": "Quantum Jump", "response": ["\"The Lone Ranger\" was first released in 1976. After it was chosen as Tony Blackburn's BBC Radio 1 \"Record of the Week\" (the nationwide morning radio show with the highest ratings in the UK at the time), it was banned when some fragments of lyrics were deemed to contain references to drugs and homosexuality. The BBC stopped playing the record, and it failed to chart. Disillusionment with the length of time it had taken to get the original record deal, and the lack of any really cohesive management, led to guitarist Mark Warner's decision to leave and join Cat Stevens' live band."]}, {"page": "The Wurzels", "response": ["In 2007, The Wurzels and Tony Blackburn re-released \"I Am A Cider Drinker\", with the royalties from the song going to the BUI Prostate Cancer Care Appeal in Bristol.", "| \"I Am A Cider Drinker\" (with Tony Blackburn) / \"Ferry To Glastonbury\"", "| \"I Am A Cider Drinker\" (with Tony Blackburn) / \"Combine Harvester\""]}, {"page": "MGM Records", "response": ["* Tony Blackburn"]}, {"page": "The Move", "response": ["In April 1967, NME reported that the Move had offered a £200 reward (equivalent to £ in ) for the recovery of the master tapes of ten songs intended for their debut album. The tapes were stolen from their agent's car when it was parked in Denmark Street, London. The tapes were found in a skip (dumpster) shortly afterward, but the damage caused to them meant that new mixes and masters would have to be made, resulting in the delayed album only being released in March 1968 instead of the original plan of autumn 1967. Their third single \"Flowers in the Rain\" was the first chart single played on BBC Radio 1 when it began broadcasting at 7am on 30 September 1967, introduced by Tony Blackburn. The single, which reached No. 2 in the UK, was less guitar-orientated than their previous two singles, and featured a woodwind and string arrangement by Cordell's assistant Tony Visconti. The track was released on the re-launched Regal Zonophone label."]}, {"page": "Simon, Simon", "response": ["Two handymen (Graham Stark and John Junkin) cause chaos on a new crane while haphazardly trying to accomplish jobs for their ever more frustrated boss. This 'silent' comedy features a host of cameos from the likes of Peter Sellers, Michael Caine, Bob Monkhouse, Eric Morecambe, Ernie Wise and Tony Blackburn.", "With Tony Blackburn, Michael Caine, David Hemmings, Bob Monkhouse, Eric Morecambe, Pete Murray, Peter Sellers, Bernie Winters and Ernie Wise"]}, {"page": "Chris Moyles", "response": ["On 7 September 2009 Moyles became the longest serving breakfast presenter on Radio 1, breaking the record previously set by Tony Blackburn."]}, {"page": "Capital London", "response": ["*Tony Blackburn (1988–2002) (now with BBC Radio 2, BBC Local Radio, and KMFM)"]}, {"page": "Roy Wood", "response": ["From this and other Birmingham-based groups, was formed The Move, and they quickly entered the UK Singles Chart. Their single \"Night of Fear\" climbed to No. 2 in early 1967. Their third hit, \"Flowers in the Rain\", was the first song played by Tony Blackburn at the launch of BBC Radio 1 on September 30, 1967, and the band evolved over a three-year period. After the departure of The Move's lead singer Carl Wayne, Wood's influence became more prominent. In 1967, Wood (and fellow Move member Trevor Burton) supplied backing vocals on the track, \"You Got Me Floatin'\", on the Jimi Hendrix Experience's album Axis: Bold as Love."]}, {"page": "Sky One", "response": ["On 16 January 1984, Satellite Television Limited was renamed Sky Channel, incorporating a large number of American imports in its schedules also increased the quantity produced of home grown programmes, including a number of new music shows with Gary Davies, Tony Blackburn, Linda de Mol, Pat Sharp, David \"Kid\" Jensen, and Anthea Turner presenting programmes such as Euro Top 40, and UK Top 50 Chart. New children's programmes like Fun Factory and The DJ Kat Show, many of which came not only from Sky's own studios in London (having already abandoned the Molinare facilities by then), but also included programmes produced in the Netherlands by John de Mol's production company.", "Initially, a new raft of shows were created for the channel including the daily talent show Sky Star Search, game shows (Sale of the Century was based more off the 1980s American version and The Price Is Right), weekly documentary series Frank Bough's World, daily late night talk show Jameson Tonight, agony aunt advice show A Problem Shared and Sky by Day,From Sunday, you'll never say there's.... Advert The Times (London, England), Friday, 3 February 1989; pg12 Sky TV's variation on ITV's more popular This Morning, hosted by former BBC Radio 1 DJ Tony Blackburn (who had moved to commercial radio by then) and former Magpie presenter Jenny Hanley as the show aired a mix of entertainment, gossip and fashion. "]}, {"page": "Through the Keyhole", "response": ["| 3 || Chris TarrantNina MyskowLord Lichfield || Tony BlackburnRobert Maxwell || 17 April 1987", "| 1 || Jimmy CarrMyleene KlassTony BlackburnStacey Solomon || Vicky Pattison Derek AcorahSpencer Pratt and Heidi Montag|| 9 December 2017 || Under 3.46"]}, {"page": "Stephanie De Sykes", "response": ["Her 1979 self-penned single release \"Oh, What A Night For Romance\" was featured on the BBC1 show Juke Box Jury, when it was panned by the panel of Dusty Springfield, Tony Blackburn, Jonathan King and Britt Ekland who unanimously correctly predicted it would be a 'miss'. De Sykes featured in a TV commercial for McVities biscuits in the 1983 Christmas period  and soon after provided background vocals for Meat Loaf's 1984 album Bad Attitude, which included the Jim Steinman penned single, \"Nowhere Fast\"."]}, {"page": "BBC Radio Oxford", "response": ["*Tony Blackburn (Sunday evenings)"]}, {"page": "Lynsey de Paul", "response": ["In March 1973, her first album, Surprise, was released on the MAM label. As well as writing or co-writing all of the songs on Surprise, de Paul was also the producer for all of the tracks. In his 2015 autobiography, label mate Tom Jones wrote: \"We had Lynsey de Paul, a big star, though she fell out with Gordon (Mills) for wanting to produce her own records\". Later that year, after \"All Night\", her third single, co-written with Ron Roker and released on the MAM label, failed to chart in the UK, de Paul returned to the UK Top 20 with \"Won't Somebody Dance With Me\", which was also a hit in Ireland and the Netherlands and covered in the USA. According to an interview with Michael Robson, featured in the liner notes to \"Sugar and Beyond\", de Paul had to fight hard to get this single released - indeed she would have preferred it in place of \"All Night\" and also to keep the long closing instrumental part of the song.Michael Robson, Liner notes, Sugar and Beyond, RETRO D923, RPM/Cherry Red Records, 2013 She was vindicated since it was a chart hit and she was presented with an Ivor Novello Award for the song, the first woman to do so. The BBC Radio 1 disc jockey Ed Stewart spoke the words \"May I Have The Pleasure of This Dance\" near the end of the record (he often played the record on his Junior Choice programme on Saturday mornings) although Tony Blackburn and Dave Lee Travis spoke these words when she appeared on BBC Television's Top of the Pops. De Paul performed the song on the 500th edition special on 4 October 1973,page 222, Music Week, 17 March 1979 which was the date of the release of the single.  The flip side of \"Won't Somebody Dance With Me\" was \"So Good To You\", a song covered by Lenny Zakatek on the B-side of his single \"I Gotcha Now\". \"I Gotcha Now\" was also written by de Paul, originally for Slade. In Japan, \"So Good To You\" was released as the A-side with \"Won't Somebody Dance With Me\" being relegated to the B-side. Another song co-written by de Paul, \"Today Gluggo, Tomorrow The World\", was the B-side of \"Don't You Let It Bring You Down\" by the Spencer Davis Group, as well as an album track on their 1973 Gluggo.", "De Paul also continued to write songs for a wide range of recording artists. In a five-year period (1972–77), she wrote a total of fourteen UK Singles Chart hits, most notably the Carl Allan award-winning song \"Dancin' (on a Saturday Night)\" which was a hit for co-writer Barry Blue, as well as Flash Cadillac and the Canadian group Bond. More hit singles co-written with Blue and performed by him followed, including \"School Love\", \"Miss Hit and Run\" and \"Hot Shot\" They finally released a duet at the end of 1975, the festive \"Happy Christmas To You From Me\", which was co-written by the duo. The song received favourable reviewsSingles review by Sue Byron, page 23, Record Mirror & Disc, 29 November 1975 and continues to receive plays over the years.Sleigh list released by David Dalton, page 17, Music Week, 8 December 1979 Other notable songs co-written by de Paul and Blue include \"Tip of My Tongue\" which was a radio hit for the British group \"Brotherly Love\" as well as female vocal trio \"Ellie\" (aka The Hope Sisters who would later become Liquid Gold) and \"House of Cards\" recorded by a number of artists including John Christie, Australian artist, Rob Guest, and the D.J. Tony Blackburn. De Paul's songs have reached the charts in many territories, including the US, Japan, Germany, the Netherlands, France, Switzerland, Belgium, Austria, Sweden, Norway, Ireland, Israel, Canada and Australia. She also performed producing and arranging duties on many of these recordings."]}, {"page": "I'm a Celebrity...Get Me Out of Here!", "response": ["* Series 1, 2002: Tony Blackburn"]}, {"page": "Noel Edmonds", "response": ["In 1969, Edmonds moved to BBC Radio 1, where he began by recording trailers for broadcasts and filling in for absent DJs, such as Kenny Everett. In April 1970, he began his own two-hour Saturday-afternoon programme, broadcasting from 1pm to 3pm, before replacing Everett on Saturdays from 10a.m. to noon in July that year. In October 1971, he was moved to a Sunday slot from 10a.m. to noon before being promoted to host The Radio 1 Breakfast Show from Monday 4 June 1973 to Friday 28 April 1978, taking over from Tony Blackburn. Edmonds moved to Sunday mornings and middays, from 10a.m. to 1p.m., in 1978 and also presented Talkabout, an hour-long talk show broadcast on Thursday evenings. Edmonds left Radio 1 in March 1983."]}, {"page": "Paul Gambaccini", "response": ["In August 2008, Gambaccini returned to Classic FM, to present a 12-part series Paul Gambaccini's Hall of Heroes on Sunday evenings between 9:00 and 10:00. In March 2008, he took over as chairman of the Radio 4 music quiz Counterpoint from Edward Seckerson; he was temporarily  replaced in 2013 by Russell Davies and returned to the show in November 2014 after being cleared of allegations of historical sexual offences made against him. He returned to Radio 2 with America's Greatest Hits on November 15, 2014, and hosted it until July 2, 2016, when he took over Pick of the Pops from Tony Blackburn, the following week."]}, {"page": "Brainiac: Science Abuse", "response": ["* Tony Blackburn"]}, {"page": "Keith Chegwin", "response": ["His early career saw him performing in such West End stage shows as Tom Brown's School Days and Captain Pugwash. He also had a career as a singer, releasing singles on the Pye Records label and worked as a disc jockey for 194 Radio City in Liverpool. He spent four years at BBC Radio 1 on Tony Blackburn's weekend morning show. In 2000, he presented the Channel 5 nudist game-show Naked Jungle, appearing naked except for a hat and later describing it as \"the worst career move\" in his life.", "Chegwin performed in West End stage shows such as Tom Brown's School Days with Russell Grant and Simon Le Bon; The Good Old Bad Old Days with Anthony Newley; and Captain Pugwash by John Kennett at the King’s Road Theatre in 1973. He had a career as a singer, releasing singles on the Cherub and Pye record labels, such as 'I'll Never Fall in Love Again' (1977), but turned down an offer to front the band Kenny (who had a number 3 hit in the UK Singles Chart with \"The Bump\"). He also worked as a disc jockey for 194 Radio City in Liverpool,Radio City . North West Radio website, viewed 1 July 2007. and worked at BBC Radio 1 on Tony Blackburn's weekend morning show for four years."]}, {"page": "BBC Essex", "response": ["Over the Easter Weekend in April 2009, the popular Pirate Radio Essex programme was resurrected by popular demand from listeners, occurring five days after the release of the comedy movie The Boat that Rocked. This was broadcast on the AM frequencies, as well as on the Internet, which resulted in many calls from as far away as New Zealand. Presenters included Johnnie Walker, Tony Blackburn, Dave Cash and Keith Skues as well as three of the station's presenters: Steve Scruton; Ian Wyatt & Ray Clark."]}, {"page": "BBC Three Counties Radio", "response": ["*Tony Blackburn"]}, {"page": "BBC Radio Berkshire", "response": ["*Tony Blackburn (Sunday evenings)"]}, {"page": "BBC Radio Solent", "response": ["Some of the station's evening output is also simulcast with sister stations in the BBC South and BBC South East regions. The Sunday evening show with Tony Blackburn (6-10pm) originates from BBC Radio Berkshire in Reading.", "*Tony Blackburn (Sunday evenings)"]}, {"page": "BBC Radio London", "response": ["A programming relaunch in 1984 saw Radio London adopt the tagline \"The Heart and Soul of London\", with more soul music being played during the day. Tony Blackburn from BBC Radio 1 moved up the schedule to host a morning show for housewives, playing classic soul of the 1970s and presenting a show laced with cheeky jokes and double entendres, once daring to \"get out his 12-incher\" - referring to an LP record. He was dismissed in 1988 crossing the line of taste and decency, conveniently in time for the station's first relaunch. Regular Soul Night Outs were held initially in Kilburn but later in other venues, such as Ilford. This was where Dave Pearce, later of BBC Radio 1 fame, made his first regular appearances as a BBC DJ (Monday night programme 'A fresh start to the week'). Two of the station's producers, Guy Hornsby (Tony Blackburn) and Mike Gray (RobbieTalk:BBC London 94.9 Vincent Telephone Programme), went on to create the ground-breaking commercial dance stations Kiss 102 and Kiss 105, which recaptured the somewhat anarchic spirit of BBC Radio London in its mid-1980s heyday to great audience and commercial success.", "New recruits to BBC London 94.9 included  Jon Gaunt from BBC Three Counties Radio, former GLR presenter Danny Baker, and Sean Rowley (hosting the Guilty Pleasures show). Danny Baker hosted a breakfast show, which was co-hosted with American comedian Amy Lamé. Jon Gaunt then hosted the mid-morning phone-in show. Robert Elms was kept at lunchtime. Vanessa Feltz took over Lisa I'Anson's afternoon slot with a  phone-in. Drivetime with Eddie Nestor and Kath Melandri guide Londoners home with news updates, sport, travel and debates with the public. Specialist programmes for the Black community emerged at the weekends along with sports coverage and alternative music shows in the evening. BBC London also saw the return of Tony Blackburn on Saturdays, more than 20 years since he first appeared on the station. His show was as before, playing classic soul music and chat.", "* Tony Blackburn (Sunday Evenings)"]}, {"page": "10cc", "response": ["\"Donna\", released as the first 10cc single, was chosen by BBC Radio 1 disc jockey Tony Blackburn as his Record of the Week, helping to launch it into the Top 30. The song peaked at No. 2 in the UK in October 1972."]}, {"page": "Bargain Hunt", "response": ["| Tony Blackburn and Alvin Stardust"]}, {"page": "Clive Bull", "response": ["*Tony Blackburn called in to defend Smart cars."]}]}}