{"wiki_id": "http://www.wikidata.org/entity/Q435489", "itemLabel": "Hayley Yelling", "itemDescription": "British long-distance runner", "wikipedia_url": "https://en.wikipedia.org/wiki/Hayley_Yelling", "wikipedia_page": {"main": "Hayley Higham (born 3 January 1974, in Dorchester) is a British runner. She is the sister-in-law of fellow British runner Liz Yelling. She married Jamie Higham in 2009.\nShe works as a Maths teacher at Sir William Borlase's Grammar School in Marlow, Buckinghamshire and runs for the Windsor, Slough, Eton and Hounslow Athletic Club. She has competed for England in the Commonwealth Games and for Great Britain in a number of competitions. In December 2004 she won the European Cross Country Championship in Heringsdorf.\nIn December 2009 she won the European Cross Country Championship in Dublin after coming out of retirement from competitive running. She followed this up a month later by coming fourth in the 2010 International Edinburgh Cross Country, fourteen seconds after winner Tirunesh Dibaba over the freezing 5.8 kilometre course.", "link_mentions": [{"page": "Paula Radcliffe", "response": ["Radcliffe has frequently made high-profile condemnations of the use of performance-enhancing drugs in athletics. Radcliffe and teammate Hayley Tullett caused controversy when, in the heats of the 5,000 metres at the 2001 World Athletics Championships in Edmonton, they held up a sign protesting against the reinstatement of Russian athlete Olga Yegorova after Yegorova had tested positive for the banned substance EPO. The sign was made by Radcliffe's husband and read 'EPO Cheats Out'. It was eventually taken off them by the stadium officials, but not before it was streamed around the world. After Radcliffe and Tullett's initial protest, teammates Kathy Butler and Hayley Yelling – who both missed out on a place in the final – protested alongside coaches Mark Rowland and Alan Storey, wearing Radcliffe masks and holding up banners with mocking slogans including one which read 'Free Paula'. Radcliffe vowed to continue her fight against drugs in sport after her high-profile actions in Edmonton. Since the 1999 European Cup, Radcliffe wears a red ribbon when competing to show her support for blood testing as a method of catching drug cheats."]}, {"page": "January 1974", "response": ["**Hayley Yelling, British runner; in Dorchester, Dorset, England"]}, {"page": "England at the 2006 Commonwealth Games", "response": ["|Hayley Yelling"]}, {"page": "Great Britain at the 2006 European Athletics Championships", "response": ["|15||Hayley Yelling||10,000 m W || 32:12.50||--", "5,000 m: Jo Pavey, Hayley Yelling, Kathy Butler", "10,000 m: Cathy Butler, Mara Yamauchi, Hayley Yelling"]}, {"page": "Mo Farah", "response": ["In April 2010, Farah married his longtime girlfriend Tania Nell in Richmond, London. Other athletes at the wedding included Paula Radcliffe, Steve Cram, Hayley Yelling, Jo Pavey, Mustafa Mohamed and Scott Overall, who was an usher. Farah has a stepdaughter named Rihanna from this relationship. He and his wife have twin daughters called Aisha and Amani, born in August 2012. In 2015, Farah and Nell had a son called Hussein."]}, {"page": "2004 IAAF World Cross Country Championships", "response": ["|align=left style=\"border:0\"| (Hayley Yelling) || align=right style=\"border:0\"| (29)"]}, {"page": "2006 European Cross Country Championships", "response": ["|align=\"center\"|6. ||align=\"left\"|  Hayley Yelling ||align=\"right\"| 25:28", "|align=\"center\" valign=\"top\"| ||align=\"left\"|  Hayley Yelling Joanne Pavey Liz Yelling Kate Reed ||align=\"right\"| 47"]}, {"page": "List of 5000 metres national champions (women)", "response": ["*2002: Hayley Yelling", "*2003: Hayley Yelling", "*2006: Hayley Yelling"]}, {"page": "Liz Yelling", "response": ["Elizabeth Anne Yelling (née Talbot; born 5 December 1974, Welwyn Garden City, Hertfordshire) is a British long-distance runner currently based in Poole, Dorset. She is the sister-in-law of fellow British runner Hayley Yelling through her marriage to steeplechaser Martin Yelling and is the former training partner of Paula Radcliffe."]}, {"page": "Yelling (surname)", "response": ["* Hayley Yelling (born 1974), British runner"]}, {"page": "Mary Cullen", "response": ["There were high expectations for the 2009 European Cross Country Championships, which was held in her native Ireland. However, she finished the race out of contention in twelfth position, behind her compatriot Fionnuala Britton. She later commented that she had put too much pressure on herself to perform and had suffered accordingly. She rebounded the following month with a win at the Belfast International Cross Country, beating Anikó Kálovics and Cross Country Champion Hayley Yelling to the finish line.Duffy, Coilin (2010-01-23). Cullen and Kigen take the spoils in muddy Antrim. IAAF. Retrieved on 2010-01-25."]}, {"page": "2010 IAAF World Cross Country Championships", "response": ["In the women's race, Linet Masai (2009 silver medallist) and Tirunesh Dibaba (the 2008 champion) were strong favourites for the women's medals. The defending champion, Florence Kiplagat, was not in attendance but 2009 fourth placer Lineth Chepkurui was another Kenyan contender for the medals. Ethiopia entered a strong team, including Dibaba, 2003 champion Werknesh Kidane and multiple past medallist Meselech Melkamu. Non-African runners in good form were 2004 champion Benita Willis of Australia and 2009 European champion Hayley Yelling. The United States and Portugal had entered strong women's teams, led by national champions Shalane Flanagan and Ana Dulce Félix respectively, which were given good medalling possibilities.Johnson, Len (23 March 2010). Bydgoszcz 2010 - Can Dibaba prevent Masai's rise to top spot? - Women's Races Preview. IAAF. Retrieved on 2010-03-24."]}, {"page": "2001 European Cross Country Championships", "response": ["|align=\"center\"|8. ||align=\"left\"|  Hayley Yelling ||align=\"right\"| 15:58"]}, {"page": "2003 European Cross Country Championships", "response": ["|align=\"center\"|5. ||align=\"left\"|  Hayley Yelling ||align=\"right\"| 22:44", "|align=\"center\" valign=\"top\"| ||align=\"left\"|   Paula Radcliffe  Hayley Yelling  Liz Yelling  Hayley Tullett ||align=\"right\"| 25"]}, {"page": "2004 European Cross Country Championships", "response": ["The 11th European Cross Country Championships were held at Seebad Heringsdorf in Germany on 12 December 2004. Serhiy Lebid took his fifth title in the men's competition and Hayley Yelling won the women's race.", "|align=\"center\"| ||align=\"left\"|  Hayley Yelling ||align=\"right\"| 22:04"]}, {"page": "2005 European Cross Country Championships", "response": ["|align=\"center\"|6. ||align=\"left\"|  Hayley Yelling ||align=\"right\"| 20:16", "|align=\"center\" valign=\"top\"| ||align=\"left\"|   Hayley Yelling  Liz Yelling  Kate Reed  Natalie Harvey ||align=\"right\"| 54"]}, {"page": "2007 European Cross Country Championships", "response": ["|align=\"center\"|9. ||align=\"left\"|  Hayley Yelling ||align=\"right\"| 27:28", "|align=\"center\" valign=\"top\"| ||align=\"left\"|  Kate Reed Hayley Yelling Liz Yelling Helen Clitheroe ||align=\"right\"| 47"]}, {"page": "2008 European Cross Country Championships", "response": ["|align=\"center\" valign=\"top\"| ||align=\"left\"|  Hatti Dean Louise Damen Laura Kenney Hayley Yelling ||align=\"right\"| 49"]}, {"page": "2009 European Cross Country Championships", "response": ["Alemayehu Bezabeh upset the defending champion (Serhiy Lebid) to win the men's senior race: it was his first medal at a major international competition and he was the first Spanish runner to win in the history of the championships. In the women's senior competition, Hayley Yelling was a surprise winner, having come out of her competitive retirement just weeks before the race. The much favoured Portuguese team (which included Jessica Augusto and Inês Monteiro) did not reach the individual podium but they took the gold in the team competition.", "Prior to the championships, eight-time gold medal winner Serhiy Lebid was the favourite for the men's race, with Great Britain's Mo Farah representing the greatest challenge to him. For the women's race, reigning champion Hilda Kibet had decided not to compete. This left the women's senior competition without a clear favourite: Portugal's Jessica Augusto and Inês Monteiro, along with former champions Hayley Yelling and Tetyana Holovchenko, comprised the likely medallists, while Mary Cullen was the home favourite.Wenig, Jörg (11 December 2009). Lebid going for number nine, Augusto for number one – European XC Champs, PREVIEW. IAAF. Retrieved 16 December 2009.SPAR European Cross Country Championships: athletes' press conference . European Athletics (12 December 2009). Retrieved 16 December 2009.", "The women's senior race also had an unexpected winner: Hayley Yelling of Great Britain (the 2004 championships winner) had retired from athletics after a poor showing at the 2008 European Cross Country Championships,Hayley Yelling hangs up her spikes. European Athletics (17 December 2009). Retrieved 19 December 2009. but she returned to competition in December 2009 with a win at the British selection race for that year's race.Yelling makes winning return in Liverpool . European Athletics (12 January 2009). Retrieved 19 December 2009.", "| align=\"left\" |Hayley Yelling", "| align=\"left\" |Hayley YellingFreya MurrayKatrina WoottonSonia Samuels"]}, {"page": "2003 IAAF World Half Marathon Championships", "response": ["|align=center| 37 || Hayley Yelling ||  ||  1:14:52 || ", "|align=center| 5 ||  || Paula RadcliffeKathy ButlerHayley Yelling ||  3:36:44"]}, {"page": "2006 European Athletics Championships – Women's 10,000 metres", "response": ["| 15||align=left| Hayley Yelling ||align=left|  || 32:12.50 || SB"]}, {"page": "2010 European Cross Country Championships", "response": ["Hayley Yelling entered the race as the defending women's champion while Alemayehu Bezabeh, the reigning men's champion, did not take part in the competition.Minshull, Phil (10 December 2010). Lebid and Yelling-Higham looking for old gold at European XC Champs – PREVIEW. IAAF. Retrieved 10 December 2010. High-profile investigations into doping in Spain immediately preceded the championships and Bezabeh was among the athletes implicated in Operación Galgo.La Guardia Civil interroga a Nuria Fernández y Reyes Estévez. El País (10 December 2010). Retrieved 11 December 2010.Purdue carries Britain's hopes while question mark hangs over Spanish entries. Athletics Weekly (11 December 2010). Retrieved 11 December 2010. As both the reigning champion and the 2009 silver medallist Mo Farah were absent, the men's race was seen as a relatively open competition, with Ukrainian Serhiy Lebid, Spanish runners Ayad Lamdassem and Jesús España being the foremost protagonists.Purdue carries Britain's hopes while question mark hangs over Spanish entries. Athletics Weekly (11 December 2010). Retrieved 12 December 2010. The withdrawal of Rosa Morató (runner-up in 2009) left Jessica Augusto as the provisional favourite for the women's race.Spain’s Morató out of SPAR European Cross Country Championships . European Athletics (8 December 2010). Retrieved 12 December 2010. Forming a strong team, three other Portuguese runners (Ana Dulce Félix, Marisa Barros and Sara Moreira) were expected to challenge for medals, as were Yelling and Adriënne Herzog (also directly implicated in Operación Galgo), who was third the previous year.Minshull, Phil (10 December 2010). Lebid and Yelling-Higham looking for old gold at European XC Champs – PREVIEW. IAAF. Retrieved 12 December 2010."]}, {"page": "2001 World Championships in Athletics – Women's 5000 metres", "response": ["| 32 || 1 ||align=left| Hayley Yelling ||align=left|  || 15:59.39 ||"]}, {"page": "2002 European Athletics Championships – Women's 5000 metres", "response": ["| 18 ||align=left| Hayley Yelling ||align=left|  || 16:26.41 ||"]}, {"page": "Athletics at the 2006 Commonwealth Games – Women's 10,000 metres", "response": ["|  || align=left| Hayley Yelling ||align=left|  || 32:32.38 ||"]}, {"page": "Athletics at the 2002 Commonwealth Games – Women's 10,000 metres", "response": ["| 5 || align=left| Hayley Yelling ||align=left|  || 32:29.73 || PB"]}]}}