{"wiki_id": "http://www.wikidata.org/entity/Q4356390", "itemLabel": "Adam Woodyatt", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Woodyatt", "wikipedia_page": {"main": "Adam Brinley Woodyatt (born 28 June 1968) is an English actor. He is known for his role as Ian Beale in the BBC soap opera EastEnders, which he has played since the first episode in 1985.\n\n", "link_mentions": [{"page": "EastEnders", "response": ["EastEnders is built around the idea of relationships and strong families, with each character having a place in the community. This theme encompasses the whole Square, making the entire community a family of sorts, prey to upsets and conflict, but pulling together in times of trouble. Co-creator Tony Holland was from a large East End family, and such families have typified EastEnders. The first central family was the combination of the Fowler family, consisting of Pauline Fowler (Wendy Richard), her husband Arthur (Bill Treacher), and teenage children Mark (David Scarboro/Todd Carty) and Michelle (Susan Tully). Pauline's family, the Beales, consisted of Pauline's twin brother Pete Beale (Peter Dean), his wife Kathy (Gillian Taylforth) and their teenage son Ian (Adam Woodyatt). Pauline and Pete's domineering mother Lou Beale (Anna Wing) lived with Pauline and her family. Holland drew on the names of his own family for the characters.", ", Adam Woodyatt, Gillian Taylforth and Letitia Dean are the only members of the original cast remaining in the show, in their roles of Ian Beale, Kathy Beale and Sharon Watts respectively. Ian Beale is the only character to have appeared continuously from the first episode without formally leaving, and is the longest-serving character in EastEnders.", "According to the book How to Study Television, in 1995 EastEnders cost the BBC £40,000 per episode on average. A 2012 agreement between the BBC, the Writers' Guild of Great Britain and the Personal Managers' Association set out the pay rate for EastEnders scripts as £137.70 per minute of transmission time (£4,131 for 30 minutes), which is 85 per cent of the rate for scripts for other BBC television series. The writers would be paid 75 per cent of that fee for any repeats of the episode. In 2011, it was reported that actors receive a per-episode fee of between £400 and £1,200, and are guaranteed a certain number of episodes per year, perhaps as few as 30 or as many as 100, therefore annual salaries could range from £12,000 to £200,000 depending on the popularity of a character. Some actors' salaries were leaked in 2006, revealing that Natalie Cassidy (Sonia Fowler) was paid £150,000, Cliff Parisi (Minty Peterson) received £220,000, Barbara Windsor (Peggy Mitchell) and Steve McFadden (Phil Mitchell) each received £360,000 and Wendy Richard (Pauline Fowler) had a salary of £370,000. In 2017, it was revealed that Danny Dyer (Mick Carter) and Adam Woodyatt (Ian Beale) were the highest-paid actors in EastEnders, earning between £200,000 and £249,999, followed by Laurie Brett (Jane Beale), Letitia Dean (Sharon Watts), Tameka Empson (Kim Fox), Linda Henry (Shirley Carter), Scott Maslen (Jack Branning), Diane Parish (Denise Fox), Gillian Taylforth (Kathy Beale) and Lacey Turner (Stacey Slater), earning between £150,000 and £199,999."]}, {"page": "1968", "response": ["** Adam Woodyatt, English actor"]}, {"page": "Walthamstow", "response": ["* Adam Woodyatt, English actor who plays Ian Beale in EastEnders, born in Walthamstow 1968"]}, {"page": "London Borough of Waltham Forest", "response": ["Other notable people, such as footballer and former England Captain David Beckham, rapper, songwriter and actor Redzz, I, Claudius star Derek Jacobi, former Essex and England cricket Captain Graham Gooch, and the film director and producer Alfred Hitchcock, were also born in the borough. The heavy metal band Iron Maiden was formed in Leyton, and Eastenders actress Rita Simons was born in Leytonstone. Notable Eastenders Actor Adam Woodyatt is from Walthamstow. The poet Pascale Petit, shortlisted three times for the TS Eliot poetry prize, lives in Walthamstow. Notable rap/grime artist Lethal Bizzle is from Walthamstow, and Grayson Perry, the 2003 Turner Prize-winning artist, has his studio in Walthamstow. X Factor finalist Fleur East is also from Walthamstow as well as British Taekwondo Athlete Lutalo Muhammad."]}, {"page": "1968 in television", "response": ["| Adam Woodyatt"]}, {"page": "Southam", "response": ["*Adam Woodyatt, EastEnders actor, had a home in Southam for many years."]}, {"page": "Den Watts", "response": ["In the spring of 2004, it is revealed that Den had married his second wife Chrissie (Tracy-Ann Oberman) in Spain in 1999. She soon arrives in Walford to collect some money from him. She decides to stay in Walford with Den and his children, and the Watts family reform their close bond. Den plays a heroic role when a fairground collapses in Walford and he saves numerous residents. He also tells Pete's son Ian Beale (Adam Woodyatt) that his former wife Laura’s baby son Bobby (Kevin Curran), is actually his and encourages him to be a father to him – with Den himself knowing how much a strain his own absence had on Dennis's life. Ian had evicted Laura when she revealed she was pregnant, as he had undergone a vasectomy - this led Laura to believe that Garry Hobbs had got her pregnant following an earlier fling. Ian eventually accepts Bobby as his son and asks Den to be godfather at the christening. "]}, {"page": "Peggy Mitchell", "response": ["A few years later, Peggy finds herself reacquainted with Archie after getting to know his two daughters Ronnie (Samantha Womack) and Roxy (Rita Simons) respectively. She forms a relationship with him and the pair get engaged, although Archie quickly begins to subtly controlling Peggy. They  nonetheless get married, but it ends a few hours later when it is publicly transpires that Archie lied to Ronnie about her infant daughter's death. Peggy has Archie evicted from The Queen Vic and attempts to have Phil kill him in revenge, but she is left furious when Phil lets doesn't go through with it in the end. Peggy files for divorce and Archie plots revenge on the entire Mitchell family. When Peggy loses the bail surety she has paid on behalf of her daughter Sam (who breaks the conditions of her bail following coercion from Archie), the Mitchells are forced to use The Queen Vic to gain a collateral loan from Phil's sworn arch-rival and estranged stepson Ian Beale (Adam Woodyatt). Thereafter Archie uses Janine to blackmail Ian into selling him the loan, and when the Mitchells are unable to meet the loan repayment, Archie evicts them and assumes ownership of the pub. However, Archie is murdered on Christmas Day 2009 by an unknown assailant (see Who Killed Archie?). Peggy grieves for Archie, but she and various other members of her family become suspects for his murder. Following a police enquiry, local residents Bradley Branning (Charlie Clements) is posthumously found guilty of the murder, though unbeknown to everyone, the actual murderer is Bradley's wife Stacey Branning (Lacey Turner) after Archie raped her months ago. In his will, Archie leaves The Queen Vic to Roxy, who reinstates Peggy."]}, {"page": "Robot Wars (TV series)", "response": ["|Pussycat (Adam Woodyatt)"]}, {"page": "Wendy Richard", "response": ["On 10 July 2006, the BBC announced that Richard had decided to leave the series after more than 20 years. Until the onscreen death of her character at Christmas 2006, she was one of only two original cast members of that programme to appear continuously from the first episode in 1985, along with Adam Woodyatt, who played her on-screen nephew Ian Beale."]}, {"page": "Bargoed", "response": ["* Adam Woodyatt, actor, had grandparents who lived in Bargoed and had a summer job in the local butchers"]}, {"page": "David Walliams", "response": ["| style=\"text-align: center\" | 16 || Mastermind || Griff Rhys Jones || Contestant || Contestants: Adam Woodyatt"]}, {"page": "Test the Nation", "response": ["The first show, in May 2002, was an IQ test and the six groups of 50 studio participants included blondes, brunettes, teachers and students. They were pitted against a group of 10 celebrities including EastEnders star Adam Woodyatt, pop music presenter Fearne Cotton, Olympic athlete Jonathan Edwards and former Sunday Times editor and broadcaster Andrew Neil. The teachers came out on top. The last IQ test in the UK was shown on 27 August 2007, when the studio groups were reality show contestants, clairvoyants, surgeons, removal men, Robinsons, Wallaces and celebrities. In this episode Danny Wallace, a successful writer, made his first appearance as co-host. He replaced Phillip Schofield, who now works exclusively with ITV. Experts who joined Dr Colin Cooper on the IQ test panel have included Sylvia Herbert, a director of British Mensa (2002 and 2003) and Baroness Susan Greenfield, scientist and polymath (2004)."]}, {"page": "Anne Kirkbride", "response": ["At the 20th National Television Awards, held two days after Kirkbride's death, her on-screen partner and close friend from Coronation Street, William Roache, paid tribute to Kirkbride during the ceremony. The actor Adam Woodyatt dedicated the \"Best British Soap\" award EastEnders won to Kirkbride, referring to her as \"the Weatherfield One\", referencing the Coronation Street storyline which saw Deirdre wrongly imprisoned for fraud."]}, {"page": "Adam (given name)", "response": ["* Adam Woodyatt (born 1968), English actor"]}, {"page": "Dennis Rickman", "response": ["Nearly three months after the character's death, Dennis became the posthumous catalyst for the Get Johnny Week storyline in which Phil and Grant sought to help Sharon avenge his death by bringing Johnny to justice; in the end, Dennis death is avenged when his killer Danny was shot dead by his brother Jake (Joel Beckett) while Johnny was forced by his daughter Ruby (Louisa Lytton) to surrender himself to the police after she discovered that her father is responsible for Dennis' murder. Later on, Dennis' death ends up getting avenged by Ruby's boyfriend Sean Slater (Robert Kazinsky) when he causes Johnny to die of a fatal heart attack following the latter's sentencing to life imprisonment for Dennis' murder. Sharon later gave birth to her and Dennis' son, Denny. In early January 2014, Sharon finally learned the truth about Dennis' death from Phil and the subject is raised again after Denny dies in February 2020, after a quarrel with the show's protagonist Ian Beale (Adam Woodyatt) in the programme's 35th anniversary special."]}, {"page": "Sharon Watts", "response": ["Sharon’s most recent stint on the show has featured an aborted engagement to Jack Branning (Scott Maslen); battling a painkiller addiction; a reunion and tempestuous marriage to Phil; being attacked in her own bar, meeting her biological father Gavin Sullivan (Paul Nicholas) and her affair with Keanu, sparking the events of the character having a late in life pregnancy; being blackmailed by her business partner Mel Owen (Tamzin Outhwaite) and witnessing her death, her split and divorce with Phil, giving birth to Keanu's son Albie on the same night her other son, Dennis, dies in a boat accident because of Ian Beale (Adam Woodyatt) and attempting to kill herself before later becoming the landlady of The Queen Vic once again, marrying and later divorcing Ian after he is attacked when she finds out his part in Dennis’ death, poisoning Ian, finding out she has a half-brother, Zack Hudson (James Farrar), a fling with Kheerat Panesar (Jaz Deol) and finding out she has a granddaughter,  Alyssa whom she decides to raise.", "Adopted at the age of three by Den (Leslie Grantham) and Angie Watts (Anita Dobson), Sharon is raised at The Queen Victoria public house in Albert Square, Walford, where her adoptive parents are landlords. Sharon and her best friend, Michelle Fowler (Susan Tully) compete for the affections of Kelvin Carpenter (Paul J. Medford). This leads to Sharon wanting to go on the pill, which shocks Angie. However, after Angie gets advice from Pauline Fowler (Wendy Richard) and Dr. Harold Legg (Leonard Fenton), Sharon and Angie talk about it and Sharon decides to wait. Her teenage romance with Ian Beale (Adam Woodyatt) in 1986 ends when Sharon realises she prefers a more experienced man, Simon Wicks (Nick Berry), who ends the relationship when she refuses to have sex (although she eventually loses her virginity to him when she is 18). In 1987, she seeks refuge from her turbulent home life with church curate, Duncan Boyd (David Gillespie). They plan to marry but Duncan bores Sharon and she ends the engagement. Sharon is torn between her conflicting parents until their marriage deteriorates and, in 1988, Angie emigrates. When Den gets involved in gangland crime, he is shot and assumed dead. Shortly after Den's death, Michelle confesses to Sharon that Vicki Fowler (Samantha Leigh Martin) is her sister and Sharon is angry and hurt at Michelle. Soon after, Sharon discovers Den's signet ring on a market stall. With Den's body missing, Sharon convinces the police to drag a nearby canal in April 1990 and is devastated when a body is found and identified as Den's. Sharon resumes a relationship with Simon, whom she hopes to settle down with, but the relationship ends when Simon's affair with Cindy Beale (Michelle Collins) is revealed. Hurt and missing her parents, Sharon tracks down her birth mother, Carol Hanley (Sheila White). They meet several times until Carol confesses she has no maternal feelings for Sharon.", "When Sharon receives a letter from her birth mother, Carol, in 2015, she is ambivalent about resuming contact. She eventually decides to reconnect but discovers her mother has recently died. She meets her half brother Kristopher (Jonathan Broadbent) who gives her old letters from her birth father, Gavin, revealing his interest in meeting Sharon. Sharon attempts to trace Gavin and visits Den's former solicitor, Margaret Midhurst (Jan Harvey), who reveals that Den specifically requested to adopt Sharon as he knew her father. When Dennis slaps Sharon across the face during an argument, her long-time friend Ian Beale (Adam Woodyatt) confronts Sharon about her parenting skills and, following a row with Ian, she finally realises that she needs to control his bad behaviour. Phil is blackmailed into signing The Albert over to Vincent Hubbard (Richard Blackwood), forging Sharon's signature. Sharon is angry but Phil pacifies her by revealing he has traced her father, now going by the name of Gordon Cook (Stephen Marcus). Gordon is a dishevelled man living in a run-down house. Phil persuades Sharon not to pursue meeting Gordon, but she changes her mind and visits him. When Gordon is unwelcoming and cannot answer Sharon's questions, it emerges that Phil has paid Gordon to pretend to be Sharon's father. Sharon offers Gordon more money to double-bluff Phil and brings him home to Walford. She eventually manipulates Phil into admitting the truth.", "Letitia Dean decided to quit the role of Sharon in 1995, having played the character for over a decade. Dean was not the only original cast member to announce their departure that year; Susan Tully (Michelle Fowler) and Bill Treacher (Arthur Fowler) also quit, leaving just Wendy Richard (Pauline Fowler), Adam Woodyatt (Ian Beale), and Gillian Taylforth (Kathy Beale) as the only original cast remaining at that time. Dean, who was aged 26 at the time, has since reflected on her decision to leave, suggesting she went through an identity crisis when she found herself thinking \"who am I? Am I Sharon Watts or am I an actress?\". Sally Vincent, interviewing Dean for The Guardian, surmised: \"it nagged away at [Dean] for ages until she thought, hell, she owed it to herself, and started telling the producers she'd been thinking about trying new things. In those days, they didn't let you off for the odd panto or anything. It was full-time work. She remembers being dithery and apologetic about it, but her feet were itchy and, though she never really wanted to close the door behind her, she talked about going until one day, much to her consternation, [the producers] said all right then, off you go, lots of luck. They didn't ask her to reconsider, so she thought, 'Ooooh, charmin', and off she went.\" Dean added, \"I felt the need to spread my wings and try my hand at other things. I didn't want to feel there were parts out there I hadn't had a chance to play. When I left I felt this mixture of excitement and fear. I went on the last walk with Susan Tully [who played Michelle Fowler] around the Square, talking quietly, and I felt quite sad. But at the same time it felt like the right thing to do.\"", "Dean suggested that Sharon, who had passed 30 years of age on her return to the serial, wanted to get back to her roots and rediscover herself in Walford. Discussing her comeback, Dean said, \"It's a wonderful opportunity to breathe life into Sharon again. I found out at Christmas [2000], so it was a fantastic present. Sharon has a great story to tell, having been away for so long. She has some unfinished business to sort out—and has some demons to face as well. I've always held Sharon's character close to my heart. I always said: 'Never say never'. There's nothing worse than making a huge statement about never doing it again, and then going back [...] It was very exciting to be working with new cast members. But seeing members of the cast who I grew up with like Adam Woodyatt (Ian Beale), Todd Carty (Mark Fowler), Wendy Richard (Pauline Fowler) and Steve McFadden (Phil Mitchell) was just fantastic. It gave me some much-needed confidence and reassurance, knowing that I'd have that support.\" Sharon's return episodes, which aired in May 2001, saw her shocking the Mitchell family by revealing herself as the anonymous buyer of her childhood home (the Vic pub). During the years since Sharon's departure, the Queen Vic had remained in the Mitchells' ownership until Grant's mother Peggy Mitchell (Barbara Windsor) was forced to sell it. Discussing Sharon's return scenes, Dean said, \"Her appearance in the Vic is fabulous, and provokes some great reactions. Peggy is astonished, speechless and horrified all rolled into one. It's landladies and their handbags at dawn.\" Sharon's return was voted one of the top 100 TV moments of 2001 in a Channel 4 poll, and was chosen as the favourite soap comeback by almost one-third of viewers."]}, {"page": "Noel's House Party", "response": ["Carried over from The Noel Edmonds Saturday Roadshow, the gunge tank was put to various uses, usually gunging celebrities or unpopular members of the public after a phone vote was carried out during the show. Gunging usually took place in the final minutes of the show. Gunged guests/celebrities include Jenny Hull, Jilly Goolden, Mary Peters, Frank Carson, Keith Floyd, Lynn Faulds Wood, Kristian Schmid, Mat Stevenson, Anthea Turner, Nigel Mansell, Richard Whiteley, Carol Vorderman, Adam Woodyatt, Piers Morgan, Edwina Currie, Garry Bushell, Mr Motivator, Richard Clayderman, Gloria Hunniford, Jeremy Clarkson, Gary Olsen, Samantha Janus, Keith Harris and Orville, David Hasselhoff, Graham Cole, Anneka Rice, John Leslie, Paul McKenna, Annabel Giles, Nicola Stapleton, Bodger & Badger, Phillip Schofield, Andi Peters, The Chuckle Brothers, Robert Kilroy-Silk, John Virgo, Pat Sharp, Eamonn Holmes, Ulrika Jonsson, Ross King, Katie Boyle, Annabel Croft, Tony Blackburn, Bruno Brookes, Victor Kiam, Timmy Mallett and Liz Kershaw."]}, {"page": "Walford", "response": ["Bridge Street is the location of the street market and shops including the café, launderette and mini-supermarket. The café is originally named Al's Cafe and owned by Ali Osman (Nejdet Salih) and Sue Osman (Sandy Ratcliff), where they also operate the taxi firm OzCabs. When Ali develops a gambling addiction, he is forced to sell the café to Ian Beale (Adam Woodyatt), who manages it with his wife, Cindy Beale (Michelle Collins), until he sells the business to his mother, Kathy Beale (Gillian Taylforth). Ian buys the café back following the birth of Kathy's son, Ben Mitchell (Matthew Silver), although loses the business when he becomes bankrupt years later. Phil Mitchell (Steve McFadden) buys the property and employs Laura Beale (Hannah Waterman), the estranged wife of Ian, to manage it. She renames the property to Laura's Café. Laura dies and Phil is falsely imprisoned so when Phil signs the café to his sister, Sam Mitchell (Kim Medcalf), she naïvely sells the business back to Ian. Ian manages the café with his wife Jane Beale (Laurie Brett) until they divorce and Jane wins the business in the divorce settlement. Jane sells the café to Phil and he lets his partner, Shirley Carter (Linda Henry), manage it. She names the property Shirley's Cafe. Phil sells the business to Ian, and he renames the café to Mandy's Café. When Ian has a nervous breakdown and leaves, his daughter Lucy Beale (Hetti Bywater) takes control of his businesses, calling the cafe Cindy's Café. Upon his return, Ian regains ownership of the café and when she returns to Walford, Jane manages it. A few years later, Kathy returns and when she begins managing the café, Ian renames it to Kathy's Café. A year later, Ian sells the property to Weyland & Co, a property development company, which upsets Kathy. Weeks later, Fi Browning (Lisa Faulkner), a business consultant for the company, gifts the café to Kathy after discovering that her father, James Willmott-Brown (William Boyde) raped Kathy.", "The Dagmar at 10 Turpin Road is first mentioned in 1986 and seen in 1987 when James Willmott-Brown (William Boyde) takes over and turns it into a wine bar. After James rapes Kathy Beale (Gillian Taylforth), the bar is burnt down on the orders of Den. The building is then used for several businesses, including Ian Beale's (Adam Woodyatt) Meal Machine, a catering business, and a bric-a-brac shop, also owned by Ian. It also becomes a beauty salon, first called Sophisti-Kate's, run by Kate Mitchell (Jill Halfpenny), then Booty, run by Tanya Branning (Jo Joyner), Roxy's, run by Roxy Mitchell (Rita Simons), and Beauty, run by Sadie Young (Kate Magowan). It returns to being a wine and cocktail bar in 2014 when Sharon Rickman opens The Albert. After Vincent Hubbard (Richard Blackwood) buys half the bar and Sharon later sells her half to Vincent as well, he and his wife, Kim Fox-Hubbard (Tameka Empson), run it until he is forced to sell it to pay people he owes money to and it is left empty in early 2018. Kathy buys the building in 2019, and decides to reopen it as a gay bar called The Prince Albert."]}, {"page": "Hannah Waterman", "response": ["Waterman joined the cast of BBC soap opera EastEnders as Laura Dunn in February 2000. Waterman previously appeared in the soap as an HIV patient in 1997. The character of Laura became the third wife of Ian Beale (Adam Woodyatt) but the marriage was not a happy one as the paternity of Laura's son Bobby was disputed. The character was killed off on 30 April 2004 after falling down the stairs in her flat after tripping over a toy when going to answer the door. Janine Evans (Charlie Brooks) was wrongly accused of murdering her after a receipt was found in Laura's flat following a bust-up. Waterman's mother Patricia Maynard played Laura's mother in EastEnders for a couple of episodes in 2001, and her one-time step mother Rula Lenska had also made a guest appearance in the series during Laura's run playing Frank Butcher's girlfriend in the Spain episodes in 2002."]}, {"page": "Michelle Collins", "response": ["While she was filming the BBC play Pressures in 1988, Collins was spotted by EastEnders producer Julia Smith, who asked her to audition for the role of Cindy, who was to feature in 11 episodes of the soap. Collins excelled in her role. The manipulative, reckless nature of her character was a hit with viewers so her contract was extended and became a renowned villain in the series. She played Cindy Beale, the unfaithful wife of EastEnders stalwart Ian Beale (Adam Woodyatt), between 1988 and 1998. During breaks from EastEnders she filmed the drama Real Women for the BBC, with Pauline Quirke and Frances Barber. The drama was a success and it helped to confirm Collins as a versatile actress of considerable stature. Contrary to popular belief, she did not appear in the popular comedy show Knowing Me, Knowing You with Alan Partridge 1994. \"Michelle Collins\" is credited as a magician's assistant, but the role was played by a different actress with the same name, as confirmed in the audio commentary on its DVD release. On 14 November 2014, Collins reprised the role of Cindy for a short stint for Children in Need after Ian knocks his head and sees the deceased women in his life."]}, {"page": "Pam St Clement", "response": ["She featured in a multitude of high-profile storylines, which included a total four marriages (two of which had happened before the show's launch) — most notably to Frank Butcher (played by Mike Reid) – numerous affairs, feuds and a spell in prison for drink-driving (which led to a pedestrian dying). In 2006, St Clement signed a £200,000 deal keeping her with EastEnders until at least 2008. As of April 2017, she was the third longest serving cast member at EastEnders surpassed only by Adam Woodyatt and June Brown. In 2012, St Clement won a Lifetime Achievement Award at the British Soap Awards, previously having been won by her co-stars Wendy Richard, June Brown and Barbara Windsor. ", "In July 2011, it was announced that St Clement would be leaving EastEnders after 25 years. Of her departure St Clement said \"I have enjoyed 25 and a half wonderful years in EastEnders creating the character of Pat but feel it's time to hang up her earrings. Leaving the EastEnders 'family' will be akin to a bereavement. But I'm looking forward to the other work and life opportunities that I will have the time to pursue.\" She filmed her final scenes in November 2011, and the character departed on 1 January 2012. She has since been associated with EastEnders and on 14 November 2014, St Clement reprised the role of Pat for a short stint for Children in Need after Ian Beale (Adam Woodyatt) knocks his head and sees the deceased women in his life. In February 2015, St Clement, alongside Barbara Windsor, took part in EastEnders: Back to Ours, which celebrated 30 years of the soap opera. St Clement and Windsor looked back on some of their characters' most infamous moments.  On 17 May 2016, she reappeared as Pat, again playing opposite Barbara Windsor, for a few minutes as an imagined figure in conversation with the terminally ill Peggy Mitchell. Clement also appeared at the EastEnders Meet and Greet event in June 2016."]}, {"page": "Anna Wing", "response": ["She died in her sleep on 7 July 2013, at the age of 98. The episode of EastEnders that was broadcast the following day was dedicated to her memory, and was immediately followed by a 90-second long BBC News report, the headlines of which included her death. Her funeral took place in London. Adam Woodyatt was a mourner."]}, {"page": "Patrick Trueman", "response": ["Patrick Trueman is a fictional character from the BBC soap opera EastEnders, played by Rudolph Walker. He made his first appearance on 13 September 2001. His storylines include being the possible father of and father-figure to local resident Denise Fox (Diane Parish), his marriage to Yolande Duke (Angela Wynter), an affair with Pat Evans (Pam St Clement), coping with the death of his adoptive son Paul Trueman (Gary Beadle), being assaulted by an unknown assailant in his own shop, coping when Ben Mitchell (Joshua Pascoe) and his father Phil Mitchell (Steve McFadden) begin a vendetta against him, a relationship with Cora Cross (Ann Mitchell), being injured after falling from a ladder, discovering that Denise's fiancé Ian Beale (Adam Woodyatt) had sex with prostitute Rainie Cross (Tanya Franks), suffering two strokes, a relationship with Claudette Hubbard (Ellen Thomas) and becoming embroiled in Claudette's feud with her son Vincent Hubbard (Richard Blackwood). On 7 December 2015, Walker filmed his 1,000th episode as Patrick. On 2 August 2019, it was revealed that Patrick had married Sheree Trueman (Suzette Llewellyn), with whom he secretly has a son, Isaac Baptiste (Stevie Basaula)."]}, {"page": "Chrissie Watts", "response": ["Chrissie Watts was created by the production team to be more the \"equal\" of her notorious and villainous husband than his long-suffering first wife, Angie (Anita Dobson). The character was described by Oberman as being like Angie \"but with 15 more years of feminism behind her\", and was hailed by the TV editor of the Evening Standard as \"the only strong woman left in Walford\". She became well known for her deviousness and \"scheming\", echoing the traits of her husband, with the official EastEnders website characterising her as \"happy to play mind games\" and \"often two steps ahead\" of Den. As part of the Watts family and the last of its major members to have appeared on the show, Chrissie's storylines explored her tumultuous marriage to Den; bonding with his adopted daughter Sharon (Letitia Dean) and her two half-siblings, Dennis Rickman (Nigel Harman) and Vicki Fowler (Scarlett Alice Johnson); conspiring with Den to retake ownership of The Queen Victoria public house; forming a relationship with her boyfriend Jake Moon (Joel Beckett) after Den's murder; attempting to sell the Queen Vic Jake's gangland boss Johnny Allen (Billy Murray) and local businessman Ian Beale (Adam Woodyatt); being blackmailed by young wayward Stacey Slater (Lacey Turner); and feuding with the rival Mitchell family. During her time on the show, Chrissie sparked numerous clashes with other female characters - such as her archenemy Sam Mitchell (Kim Medcalf); Stacey's cousin Kat (Jessie Wallace); Phil's girlfriend Kate Morton (Jill Halfpenny); Kat's daughter Zoe (Michelle Ryan); and Sam's mother Peggy (Barbara Windsor). It was noted by Oberman herself that Chrissie \"had more fights on EastEnders than most women have in their whole lives\", and was constantly scheming against those who got in her way - thereby earning her the sobriquet of \"super-bitch\".", "As Chrissie settles herself in the square and recoups her marriage with Den, she manages to bond with his children by getting along with Dennis; helping out Vicki with her plans to enter fashion school; and working with Sharon in the management of their nightclub called \"Angie's Den\" — which Chrissie quickly learns is partly named after Den's deceased first wife Angie (Anita Dobson). She soon befriends an locally ex-policewoman, Kate Morton (Jill Halfpenny), and the two work together as hairdressers in her nail salon. However, this does not last when Chrissie discovers that Den has been sleeping with Kate — which confirms her earlier suspicions about Den and his monogamous habits, despite his attempts to convince her that she is mistaken. Chrissie later exacts revenge on Kate by offering to give her a haircut, only to end up hacking most of her hair. She then proceeds to smash up the beauty salon in a rage, and slaps Kate that results in the pair fighting — which Den breaks up moments later; Chrissie promptly slaps Den and confronts him over his \"dirty little secret\". As she goes to leave the salon, Chrissie runs into Kate's boyfriend Ian Beale (Adam Woodyatt) and tells him that Den is Kate's \"mystery man\". She later departs Walford, distraught and hurt at Den's betrayal, but then returns due to being the co-owner of Kate's salon; ironically enough, Den has temporarily left the square to sort out his \"loose ends\" in Spain."]}, {"page": "Alfie Moon", "response": ["Alfie discovers Ronnie is being released from prison but thinks that she will not return to Walford. He is angry to discover that she has and demands Roxy choose, him or Ronnie. Roxy chooses Alfie but Kat persuades him to accept Ronnie's presence and let Roxy see her sister. Kat supports Alfie after Michael's death and the two become closer. The night before his wedding, Alfie visits Kat and they kiss passionately. On his wedding day, Alfie tells Ian Beale (Adam Woodyatt) that he still loves Kat but marries Roxy. Roxy realises that Alfie is still in love with Kat and orders him out of the church. He learns that Kat is going to Ibiza and races to the airport. They reconcile, moments before her flight is due to depart. As revenge for Alfie's treatment of Roxy, Phil sells The Queen Vic, forcing Alfie and Kat out. Kat tells Alfie that she is pregnant and they move in with Kat's grandmother, Mo Harris (Laila Morse). Kat has a market stall, selling women's clothes, but Alfie isn't as successful as goes to help Spencer  in Australia for a while. He returns a month later and tells Kat that he has just bought a classic Ford Capri. After a night in a posh hotel, they return to Walford and Alfie sets up a burger bar on the Square but this is taken away so he sets up a men's clothes stall instead. This doesn't last thanks to a feud with the market inspector, Aleks Shirovs (Kristian Kiehling), so he gets a job at Ian's café. Kat and Alfie are thrilled when their twin sons, Bert and Ernie (Freddie and Stanley Beale), are born."]}, {"page": "Dot Cotton", "response": ["Dorothy \"Dot\" Branning (also Cotton) is a fictional character from the BBC soap opera, EastEnders, played by June Brown from 1985 to 1993 and 1997 to 2020. Dot first appeared in EastEnders in July 1985 as the mother of notorious criminal Nick Cotton (John Altman). The character worked as a launderette assistant for most of that time, along with original character Pauline Fowler (Wendy Richard). Dot moved away with her son and his family in 1993. In reality, Brown left the show in 1993, unhappy with the axing of her co-star Peter Dean, who played Pete Beale from the show's first episode to early 1993. Brown returned to the role in April 1997, and on 28 April 2017, Dot overtook Pat Butcher (Pam St Clement) as the second-longest-serving character in EastEnders, surpassed only by original character Ian Beale (Adam Woodyatt).  In a special episode entitled EastEnders: Dot's Story (2003) a young Dot was played by Tallulah Pitt-Brown in flashbacks. In April 2012, Brown took a six-month break from the show to write her memoirs. Dot temporarily departed on 18 May 2012. She returned on 14 January 2013. In February 2015, Dot began appearing less frequently due to Brown gradually losing her eyesight; this aspect of her life was later written into her character the following year. Brown left the role in January 2020.", "In October 1996, newspapers reported that BBC bosses had approached Brown about reprising her role as Dot Cotton and, according to the Daily Mirror, Brown had been in negotiations with EastEnders for several months prior. Brown is quoted by the paper as saying, \"I have always been reluctant to go back because I thought Dot's character was not being portrayed properly. I thought it had faded. I always said if Dot comes back it must be as Dot.\" Brown secured a deal to return and began filming on-location in Gravesend in February 1997. The episode saw Dot's former lodger, Nigel Bates (Paul Bradley), visiting Dot to discover that Nick was once again in prison, leaving Dot alone. Her return episode aired in April 1997. Brown has since revealed that she opted to return to EastEnders to raise her profile again. She had originally only intended to return for a 3-month stint, but was persuaded to stay when a project she had been working on was cancelled. In July 1997, she commented, \"I've decided to stay in EastEnders. They asked me, and in the end I thought: 'Oh well, I might as well.' Everyone, including Barbara Windsor, Wendy Richard and Adam Woodyatt, was saying: 'Don't leave'. And people were coming up in the street saying: 'It's lovely to have you back.' Anyway, I find playing the old dear quite fun.\" After a 5-month break, following Dot being held hostage in her flat by the escaped convict friend of her son, Brown returned to filming in October 1997 on a permanent contract."]}, {"page": "Matthew Robinson (producer)", "response": ["Having previously worked for producer Julia Smith on Angels, Robinson was employed to be lead director of BBC1's soap opera EastEnders when it launched in 1985. His early casting included actors for the iconic characters \"Dirty\" Den Watts (Leslie Grantham), Pauline Fowler (Wendy Richard), Dot Cotton (June Brown), Nick Cotton (John Altman), Ian Beale (Adam Woodyatt), Charlie Cotton (Christopher Hancock) and Tony Carpenter (Oscar James)."]}, {"page": "Mark Fowler", "response": ["By 2001, Nick wasn't the only enemy Mark had been clashing with throughout the year. He embarked on a conflict with Phil after learning that he had been mistreating his girlfriend Lisa Shaw (Lucy Benjamin), whom Mark has been growing fond of from that point. Mark soon takes Lisa to live with him after she leaves Phil, and they start dating – much to Pauline's horror. Mark also defends Kathy's son Ian (Adam Woodyatt) from Phil on several occasions, particularly when Mark witnesses Phil attacking Ian and is forced to separate them. When Phil is shot on the night his nemesis Steve Owen (Martin Kemp) and Lisa's best friend Mel Healy (Tamzin Outhwaite) get married, Mark becomes a prime suspect as the police gather information on his hatred for Phil – which leads his godson Jamie (Jack Ryder) and cousin Billy (Perry Fenwick) to each separately accuse Mark of shooting Phil. One month later, Mark learns that Phil has recovered and checked himself out of the hospital to exact revenge – prompting him to find Lisa in order to protect her from Phil. When he finds them at her house, Mark learns from Phil that it was Lisa who shot him. Lisa confesses to shooting Phil. Despite this, Mark continues to defend Lisa and tells Phil that she isn't totally responsible for the crime – stating that the abuse Phil had inflicted upon Lisa is what set the course of his shooting in the first place. Phil grudgingly comes to accept these terms, and decides to cover Lisa's involvement by framing his ex-business partner Dan Sullivan (Craig Fairbrass) for the crime. Mark and Lisa observe Phil planning to incriminate Dan in the shooting, even going as far as to get Steve and Mel involved with his plan. However, Dan is found not guilty and he takes revenge on Phil and Steve by kidnapping Mel and fleeing the country with a money ransom – all the while believing that Steve had shot Phil, meaning that Dan was never aware that Lisa had shot Phil in the first place.", "Fearing Nick Cotton and the police, Mark ran away from home in April 1985. As this had not been the original plan for the character, it meant a hectic period of re-writing early in 1985. The first 50+ scripts were reworked to accommodate this major change. Many of the stories intended for Mark were subsequently given to Kelvin Carpenter (Paul J. Medford), Ian Beale (Adam Woodyatt) and Mark's sister Michelle (Susan Tully) – which partially explains why her character became so prominent in the first year. It still left a gap though, because several of Mark's functions in the serial, as slightly the eldest of the youngsters, could not have been taken over by the others. A new character needed to be introduced to restore the balance to its original shape, which is why the character of Simon Wicks (Nick Berry) was introduced later in 1985. This meant introducing the audience to a character and a story approximately a year before it had been originally intended – \"Wicksy\" had originally been scheduled to join the series around the same time as his mother Pat, who arrived in June 1986. Scarboro returned to the show briefly in December 1985 in a storyline that saw Mark's parents, Pauline (Wendy Richard) and Arthur (Bill Treacher) search for him in Southend. The storyline's intention was to help highlight the problems some parents face when their teenage children disappear from home. He returned again for brief stints in 1986 and 1987. His final appearance as Mark was on Christmas Day 1987."]}, {"page": "Pauline Fowler", "response": ["Pauline Fowler is a fictional character from the BBC One soap opera EastEnders. She was played by actress Wendy Richard between the first episode on 19 February 1985 and 25 December 2006. Pauline was created by scriptwriter Tony Holland and producer Julia Smith as one of EastEnders' original characters. She made her debut in the soap's first episode on 19 February 1985, and remained for twenty-one years and ten months, making her the second-longest-running original character, surpassed only by her nephew, Ian Beale (Adam Woodyatt)."]}, {"page": "Ian Beale", "response": ["Ian Beale is a fictional character from the BBC soap opera EastEnders, played by Adam Woodyatt. He is the drama's longest-serving main character, and following the departure of Pauline Fowler (Wendy Richard) in 2006 was the only original character to have appeared continuously. The character appeared in his 2,000th episode in the show on 26 March 2007, and his 3,000th on 27 May 2016. After 36 years on the show, Woodyatt departed EastEnders on 22 January 2021. ", "Because the actress playing Ian's mother Kathy (Gillian Taylforth) was fair-haired, they also wanted him to be fair, and because of Taylforth's age he also had to look very young. Ian was meant to be 14 years old when the programme first aired, but because of licensing regulations, the actor cast was required to be a 16-year-old who could \"play down\". Adam Woodyatt, born in East London, had worked as an actor in his youth, but had given it up and relocated with his family to Wales. He was recruited from his old agency and it was decided that he was perfect for the part and he was subsequently cast as Ian Beale. In 1990 Ian's age was increased and he celebrated his 21st birthday two years after his 18th. The producers felt Ian needed to be a bit older and more mature for storylines planned for him later that year.", "Author Dorothy Hobson has stated that Ian Beale is a \"major creation\" capturing the personification of political attitudes taken up during the Conservative government of the 1980s. She suggests that Ian Beale is a \"major representation of a young man\" of that era, and that his sensitive portrayal by Adam Woodyatt is \"perhaps unrecognised\". Roz Paterson of the Daily Record branded Ian \"eminently unlovable\" and stated that Melanie proposing to him represented a growing trend in women proposing. Holy Soap said that Ian's most memorable moment was \"His attempted murder in the Square\". In 2009, Virgin Media called Ian \"the most boring and selfish man in Walford\" and felt that he deserved to lose his wife, Jane.\"Good year, bad year – Good year: Jane Beale .\" London: Virgin Media. Retrieved 27 March 2012."]}, {"page": "Pat Butcher", "response": ["Pat Butcher (also Beale, Harris, Wicks and EvansFAT PAT GETS PIC-NICKED Sunday Mirror, 10 June 2007SPOILER ALERT EastEnders' Pat Evans left fighting for her life  Now Magazine, 1 May 2008) is a fictional character from the BBC soap opera EastEnders. She was played by Pam St Clement from 12 June 1986, just over a year after the show first aired, until her departure on 1 January 2012. Pat was also portrayed by Emma Cooke in a soap 'bubble' Pat and Mo: Ashes to Ashes, delving into her past with sister-in-law Mo Harris (Laila Morse), which aired in 2004. The character was killed-off on 1 January 2012, shortly after being diagnosed with pancreatic cancer. Her funeral was on 13 January 2012. Pat was one of the longest serving characters on the show, being on it for twenty-five years and six months. She returned along with other women from Ian Beale's (Adam Woodyatt) past in a concussion-related dream sequence for a Children in Need special on 14 November 2014. She also made a return as a hallucination for Peggy Mitchell's (Barbara Windsor) death on 17 May 2016.", "The arrival of Kenny in 1988 brings the question of Simon's parentage to the fore once again. Pat tells Simon and the Beale brothers that she does not know who is the father, adding further confusion. She also says that Den is a possibility but later rules Den out and demands that he has sex with her, or she will tell people that he is the father. That July, a dying Lou pleads with Pat to finally tell Simon the truth. Pat reveals that Brian, the man that Simon believed to be his stepfather, is actually his biological father.EastEnders books, EastEnders: The First 10 Years: A Celebration by Colin Brake,  Following Lou's death, Pat forms a close friendship with Pete's second wife Kathy Beale (Gillian Taylforth). The pair were formerly foes, but find themselves having had a common bond with the dominance of both Lou and Pete in their lives. As such, Pat gradually elevates herself as a surrogate mother and close relative of Pete and Kathy's son Ian (Adam Woodyatt)."]}, {"page": "The Queen Victoria", "response": ["In 2004, Den tricks his way back into ownership of The Queen Vic, and within a few months he is killed by his second wife, Chrissie (Tracy-Ann Oberman), who buries his body in the cellar of pub. Chrissie forges his signature on a deed of transfer and tells the customers that he has left Walford, signing The Queen Vic over to her. Sam Mitchell (Kim Medcalf) digs up Den's body and Chrissie, in a plan to escape, sells the pub to Ian Beale (Adam Woodyatt) and is subsequently arrested for murder. Her confessing to forging his signature nullifies the sale to Ian and ownership reverts to Sharon, Den's heir. Sharon returns The Queen Vic to Peggy and Phil. When Sam (now played by Danniella Westbrook) breaks bail in 2009, the family goes into debt. Phil secures The Queen Vic against a loan from Ian, who is forced to sell it to Peggy's ex-husband Archie (Larry Lamb). The Mitchells initially continue running the pub but Peggy relents and hands over control to Archie and his fiancée Janine Butcher (Charlie Brooks) after her step daughter Ronnie Mitchell (Samantha Womack) suffers a miscarriage during a confrontation with her father Archie. After Archie is murdered on Christmas Day, his daughter Roxy (Rita Simons) inherits The Queen Vic. When Roxy tries to sell it on, Peggy objects, and Roxy signs over the pub to her. Later in 2010, Phil develops a drug addiction and is locked in a room in the pub by Peggy. After he escapes, he argues with his mother and sets fire to the pub as an act of revenge. The fire traps him and Stacey Branning (Lacey Turner) along with her baby Lily, but they all manage to escape.", "* 2020: Max Branning (Jake Wood) locks Ian Beale (Adam Woodyatt) in the walk-in freezer.", "* 2020: After being threatened by Max Branning (Jake Wood), Ian Beale (Adam Woodyatt) steals money from a charity set up by Bobby Beale (Clay Milner Russell).", "* 2020: Ian Beale (Adam Woodyatt) is attacked by Phil Mitchell (Steve McFadden)..", "* 2020: Ian Beale (Adam Woodyatt) sets off fireworks in the barrel store in order to try and get police protection.", "* 2020: After learning that Kathy Beale (Gillian Taylforth) provided Ben Mitchell (Max Bowden) with a false alibi, Ian Beale (Adam Woodyatt) smashes up the bar area.", "* 2021: Max Branning (Jake Wood) tells Ian Beale (Adam Woodyatt) that he believes that Sharon Beale (Letitia Dean) is trying to murder Ian in revenge for the death of Dennis Rickman Jnr (Bleu Landau).", "* 2021: Sharon Beale (Letitia Dean) attempts to kill Ian Beale (Adam Woodyatt) by poisoning him."]}, {"page": "Sylvia Young Theatre School", "response": ["*Adam Woodyatt"]}, {"page": "Sam Mitchell (EastEnders)", "response": ["Westbrook has said that the cast and crew became like a second family to her, with the roles in the soap mirroring their relationships off-screen. In her autobiography she comments, \"Sid [Owen] and I became very close [...] we were as thick as thieves. When we weren't shooting together we'd hang out [...] Once Sid and I got so bored hanging around on set that we decided to take the milk float for a spin around Albert Square, but Sid drove it too fast and turned it over [...] we couldn't stop laughing, but the producers didn't seem to share our amusement. We were seriously told off that day.\" She has described other actors like Michelle Gayle, Letitia Dean, Adam Woodyatt and Nick Berry like brothers and sisters, and has said she was very close to older cast members such as June Brown, Wendy Richard, Mike Reid and Gillian Taylforth. She has also revealed that her off-screen relationship with actors McFadden and Kemp mirrored her character's on-screen one: \"In the soap they were my older brothers, always looking out for me, making sure I didn't get into trouble, and off set they were exactly the same.\""]}, {"page": "EastEnders spin-offs", "response": ["An interactive DVD game was released in October 2005, entitled \"An A-Z Tour of Albert Square\" exclusively through BBC's Reading and Writing (RaW) campaign on BBC Online. The DVD is hosted by Adam Woodyatt as he challenges viewers to answer questions to unlock classic clips from the shows history."]}, {"page": "Phil Mitchell", "response": ["The follow-up of Sharongate saw Phil embarking on a problematic marriage with Ben's mother Kathy Beale (Gillian Taylforth); constantly tormenting Kathy's eldest child Ian Beale (Adam Woodyatt) over the course of their long-running animosity; having a one-night stand with Ian's ex-wife Mel Healy (Tamzin Outhwaite); escalating his two most competitive rivalries with Mel's husband Steve Owen (Martin Kemp) and their common nemesis Dan Sullivan (Craig Fairbrass); becoming the surrogate father of godson Jamie (Jack Ryder); establishing a companionship with Jamie's estranged uncle Billy (Perry Fenwick); clashing with love rival Mark Fowler (Todd Carty) over Louise's parentage; harbouring resentment against Mark's younger brother Martin Fowler (James Alexandrou) for accidentally killing Jamie in a car accident; teaming up with Sharon's adoptive brother Dennis Rickman (Nigel Harman) to eliminate their crime boss Jack Dalton (Hywel Bennett) and then cover up the latter's murder; marrying policewoman Kate Morton (Jill Halfpenny) after saving her from Dalton's earlier arrangement to have her killed; crossing paths with Kate's superior DCI Jill Marsden (Sophie Stanton) when she occasionally tries to bring him to justice; being set-up for armed robbery by Sharon and Dennis' illegitimate father Den Watts (Leslie Grantham); helping exonerate Sam for Den's murder after the latter's spouse and killer Chrissie (Tracy-Ann Oberman) frames her for the crime; waging a conflict against Peggy's gangland enemy Johnny Allen (Billy Murray) that culminated in Get Johnny Week; discovering at his wedding to Stella Crawford (Sophie Thompson) that she had been abusing Ben during their relationship; becoming a prime suspect in the murder of his uncle Archie (Larry Lamb); setting fire to The Queen Victoria public house in light of his addiction to crack cocaine; getting shot by ex-lover Shirley Carter (Linda Henry) on the day of his wedding to Sharon; rescuing his two cousins Ronnie (Samantha Womack) and Roxy (Rita Simons) from being murdered by their notorious adversary Nick Cotton (John Altman); framing ex-business partner Max Branning (Jake Wood) for the murder of Ian's daughter Lucy (Hetti Bywater) in the aftermath of her killer being revealed to be Lucy's younger brother Bobby (Eliot Carrington); coping with Peggy's death after she commits suicide to end her cancer endurance; having a child with Denise Fox (Diane Parish); getting hospitalized by Martin's wife Stacey Fowler (Lacey Turner) after threatening to extort money from her closest relative Kat (Jessie Wallace); ending his prolonged marriage to Sharon upon discovering that she had been sleeping with Louise's boyfriend, Keanu Taylor (Danny Walters) and that he is not responsible for her pregnancy as a result of their hidden romance; and being partly responsible for the death of Sharon's son Denny (Harry Hickles/Bleu Landau) after his confrontation with Keanu over the affair had instigated a boat accident that resulted in the younger's death. On 25 December 2020, Phil was later revealed to be the assailant who attacked Ian in the storyline \"Who Attacked Ian Beale?\"", "Kathy and Phil eventually sort out their differences, up to the point where they get married and Kathy later gives birth to their son – Ben (Matthew Silver). As time goes on, however, Phil becomes depressed and turns to alcohol – which causes him to develop an addiction. This makes him bitter and neglectful towards Kathy and Ben, so Kathy takes Ben and moves out. Realizing what he has lost, Phil gives up alcohol and attends Alcoholics Anonymous. This progressively helps Phil, up to the point where it manages to reveal the basis of his problem – the physical abuse he received from his father Eric when he was a boy, and his fear that he may abuse Ben. He and Kathy reconcile when he attends counselling, until he begins an affair with fellow alcoholic Lorna Cartwright (Janet Dibley) – who starts stalking him. With his marriage in jeopardy, Phil takes Kathy to Paris and admits his affair with Lorna so Kathy throws her wedding ring into the river, saying their marriage was over for good. Phil begins sleeping rough, gambling, and blaming Kathy for his decline. This prompts her to leave Walford for South Africa, letting it be known that an offer of reconciliation from Phil would make her reconsider. Phil is undecided until Lorna stops him going after Kathy by locking herself in his bathroom and attempts suicide. He later follows Kathy to the airport but is stopped by Kathy's son, Ian Beale (Adam Woodyatt), who persuades him that Kathy and Ben are better off without him. Phil agonies over the loss of his son."]}, {"page": "Mel Owen", "response": ["During her original tenure in the soap, Mel was featured in high-profile storylines, such as a wedding to local businessman Ian Beale (Adam Woodyatt) to mark the Millennium Eve celebrations on New Year's Eve 1999; a problematic and dangerous marriage to criminal Steve Owen (Martin Kemp); a one-night stand with Steve's nemesis Phil Mitchell (Steve McFadden); and a close friendship with Phil's estranged girlfriend Lisa Fowler (Lucy Benjamin). Writers also placed Mel at the centre of a storyline marking the show's increase to four weekly episodes in 2001, when she is kidnapped by her ex-lover Dan Sullivan (Craig Fairbrass) after Steve and Phil conspired to frame him for the latter's shooting (see Who Shot Phil?).", "When she first arrived in the square, Mel started working for local businessman Ian Beale (Adam Woodyatt). They soon begin dating and Ian later requests Mel to help with his children; Mel finds the children hard to deal with at first but grows to love them. Ian and Mel plan to marry, but Mel gets cold feet – realising she doesn't truly love Ian. When Ian discovers this, he claims that his daughter Lucy (Casey Anne Rothery) is dying of cancer in a desperate bid to retain his romantic bond with Mel; she gives in and later agrees to marry him. The pair marry on New Year's Eve 1999, in a double wedding with fellow neighbors Barry Evans (Shaun Williamson) and Natalie Evans (Lucy Speed). At their reception, however, Mel discovers a letter that Ian threw away – which officially gave Lucy the all-clear; she confronts Ian and, after he admits to lying about his daughter's health, dumps him just as the clock strikes midnight and the new millennium begins.", "An unlikely romance was scripted into Mel's narrative when she began dating her boss Ian Beale (Adam Woodyatt). The pairing has been described as one of \"the most unbelievable soap couples\", but Outwaite defended it in 1999, saying \"I know I've fancied some not particularly attractive men in my time, but I don't think Ian is actually ugly. He has a vulnerable side and that's what is attractive. When he is being all hot-headed and gets above himself then I personally don't like Ian. But when he is being vulnerable I can see the attraction. People talk to me about it all the time. I have taxi drivers telling me I could do much better than Ian. The other day someone shouted that I should go back with [Mel's former fling] Steve Owen. It's incredible, they'd rather [Mel] went out with [Steve who is] a murderer than with [Ian, who is] a hard-working father raising three children.\" Their relationship was the focus of the storyline that aired to mark the Millennium celebrations, when Ian emotionally blackmailed Mel into marrying him by claiming that his daughter was dying of cancer; storylines in the latter part of 1999 focused on the build-up to a joint Millennium wedding on New Year's Eve 1999 with Barry Evans (Shaun Williamson) and Natalie Evans (Lucy Speed). The wedding went as planned; however, Mel and Ian's marriage ended hours later as the clock struck midnight to signify the beginning of the New Year after Mel discovered Ian's lie. The Millennium Eve episodes drew in 20.89 million viewers – the biggest soap audience since the character Tiffany Mitchell (Martine McCutcheon) was killed off in EastEnders precisely one year earlier (New Year's Eve 1998). An EastEnders spokeswoman commented: \"This is a remarkable endorsement of the power of EastEnders that over 20 million viewers chose to see the Millennium celebrations in Albert Square.\" The episodes were also broadcast on screens in London's Trafalgar Square, a typical “haunt for New Year's Eve revelers”."]}, {"page": "Steve Owen (EastEnders)", "response": ["Following Grant's departure, Steve turns his attention to Phil for the management of his business. He later joins the Mitchell Brothers' younger sister, Sam (Danniella Westbrook), on a trip to Brighton with Mel alongside Mark and two other guests: Sam's ex-husband Ricky Butcher (Sid Owen) and his troublesome sister Janine (Charlie Brooks). During the trip, Steve seeks to reconcile with Mel even when she is set to marry Phil's stepson Ian Beale (Adam Woodyatt) after her relationship with Steve ended due to the Saskia impact. However, Mel soon recoups her relationship with Steve after she dumps Ian for discovering that he lied to her and the square about his little daughter Lucy (Casey Anne Rothery) dying of cancer when in actuality she had been fine all along."]}, {"page": "Grant Mitchell (EastEnders)", "response": ["The character has also become a prime suspect in the murder of Sharon's hated boss Eddie Royle (Michael Melia); sparked a longstanding feud with her best-friend Michelle Fowler (Susan Tully); clashed with Peggy's campaign rival George Palmer (Paul Moriarty); developed a close friendship with local shopkeeper Nigel Bates (Paul Bradley); formed a conflict with Sam's former boyfriend David Wicks (Michael French); slept with David's wife Lorraine Wicks (Jacqueline Leonard) they secretly harbored feelings for each other; cheated on Tiffany by having an affair with her mother Louise (Carol Harrison); triggered a rivalry with his archenemy Beppe di Marco (Michael Greco); disputed with Beppe's younger brother Gianni (Marc Bannerman); worked with Palmer's daughter Annie (Nadia Sawalha) on a jointed business venture at the local gym; established an antagonistic business partnership with Phil's would-be sworn nemesis, Steve Owen (Martin Kemp); had a one-night stand with Phil's estranged wife Kathy Beale (Gillian Taylforth); exonerated Sam for the murder of Sharon's adopted father, Den (Leslie Grantham), by proving to his ex-wife that her stepmother Chrissie (Tracy Ann Oberman) was responsible for the crime; teamed up with Phil to confront their mother's gangland enemy, Johnny Allen (Billy Murray), and get justice for the death of Sharon's adopted brother-turned-second husband Dennis Rickman (Nigel Harman) in the Get Johnny Week scenario; infuriated Kathy's son Ian (Adam Woodyatt) after sleeping with his eventual lover Jane (Laurie Brett) prior to their wedding; ended his third ill-fated marriage to Carla (Christianne Oliveira) upon learning that she turned him against Courtney; and discovered that he is the father of Michelle's secret son, Mark (Ned Porteous), in light of coping with losing his mother Peggy to cancer.", "As time goes on, Grant begins flirting with Jane Collins (Laurie Brett) – the girlfriend of Kathy's son Ian (Adam Woodyatt) – after seducing her. Their affair ends when Phil catches them together and Grant then has a one-night stand with 19-year-old Chelsea Fox – to his mother's outrage. Shortly after, his estranged Brazilian wife, Carla (Christianne Oliveira), shows up in Walford. Grant and Carla resume their relationship, but Carla's ex-partner Ray (David Kennedy) soon arrives to retrieve £12,000 that Carla has stolen from him. Carla and Ray resume their affair and plan to fleece Grant for £25,000. Grant learns of Carla's scam; unbeknownst to Carla he chases Ray away and leads Carla to believe he has fallen for her lies. Grant catches her attempting to steal his money and reacts by dumping her in a litter bin, ending their marriage. After quitting his job at the newly reopened Scarlet nightclub, currently owed by Jake following Johnny's imprisonment, Grant leaves the country again with Courtney for a new life in Portugal.", "Grant’s high-profile return, which aired in October 2005, proved to be a ratings success. The first two episodes drew respective audiences of 13.15 million (52.9%) and 12.8 million (55.2%) in the overnight ratings alone, consolidating to 13.34 and 13.21 million viewers, respectively.\"Kemp's EastEnders return extended\", BBC. URL last accessed on 24 February 2007. Although he only featured in the show for a period of three weeks initially, his contract was subsequently extended for a further three months, beginning in the spring of 2006. The character was involved in numerous storylines, including the unveiling of Den Watts’ killer; an affair with Ian Beale’s (Adam Woodyatt) girlfriend, Jane Collins; and a week’s worth of episodes dubbed “Get Johnny Week,” which saw the Mitchell brothers embroiled in a vendetta against gangland boss Johnny Allen. Soon afterwards, Kemp departed the role again on 9 June 2006."]}, {"page": "Janine Butcher", "response": ["Owing Vickers money for drugs, Janine turns to prostitution under the alias \"Blonde Bombshell\". One of her clients, Matt Lindsay (Matthew Steer), falls in love with her and proposes marriage, but attempts suicide when he learns she is still a prostitute. Ian Beale (Adam Woodyatt) begins using her services but she blackmails him, threatening to tell his wife Laura (Hannah Waterman) unless he pays her. Depressed, Janine begins drinking heavily and nearly dies of alcohol poisoning. She gives up prostitution, but when Laura discovers that she has been having sex with Ian, she throws a pan of boiling milk in Janine's face. As a result, Janine becomes agoraphobic and eats dog food because she is too afraid to go outside to buy food. She eventually gets over this with Billy's help. Janine hopes to rekindle their relationship but is devastated when she learns that he is in love with Little Mo Morgan (Kacey Ainsworth). Her attempts to ruin their blossoming romance ultimately fail."]}, {"page": "Vicki Fowler", "response": ["Vicki Fowler is a fictional character from the BBC soap opera EastEnders, played by Emma Herry from the character's birth in 1986 to 1988, Samantha Leigh Martin from 1988 to 1995, and Scarlett Alice Johnson from 2003 to 2004. She is the daughter of Michelle Fowler (Susan Tully) and Den Watts (Leslie Grantham). The character is born in the serial, conceived in a controversial storyline about teenage pregnancy. Exploiting a whodunnit angle, at the time of the first showing, viewers were not initially told who was the father, and press interest in the fledgling show escalated as journalists attempted to guess. The audience finally discovered his identity in October 1985 in episode 66. Written by series co-creator/script-editor Tony Holland and directed by co-creator/producer Julia Smith, it was considered a landmark episode in the show's history. Early suspects were Ian Beale (Adam Woodyatt) and Kelvin Carpenter (Paul J. Medford), but then four possible suspects are seen leaving the Square early in the episode: Tony Carpenter (Oscar James), Ali Osman (Nejdet Salih), Andy O'Brien (Ross Davidson), and Den Watts. As Michelle waits by their rendezvous point, a car pulls up and the fluffy white legs of the soap landlord's poodle Roly leap out of a car to give it all away: Den Watts is the father of Michelle's baby. After this storyline the programme started to appear in newspaper cartoons as it moved more and more into the public mainstream."]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Adam Woodyatt"]}]}}