{"wiki_id": "http://www.wikidata.org/entity/Q4353877", "itemLabel": "Lacey Turner", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lacey_Turner", "wikipedia_page": {"main": "Lacey Amelia Turner (born 28 March 1988) is an English actress. She is known for portraying the role of Stacey Slater on the BBC soap opera EastEnders (2004–2010, 2014–present), for which she has won over thirty awards, including four National Television Awards and ten British Soap Awards. She has also appeared on Bedlam, Switch (both 2012) and Our Girl (2013–2014).", "link_mentions": [{"page": "EastEnders", "response": ["EastEnders celebrated its 25th anniversary on 19 February 2010. Santer came up with several plans to mark the occasion, including the show's first episode to be broadcast live, the second wedding between Ricky Butcher and Bianca Jackson and the return of Bianca's relatives, mother Carol Jackson, and siblings Robbie Jackson, Sonia Fowler and Billie Jackson. He told entertainment website Digital Spy, \"It's really important that the feel of the week is active and exciting and not too reflective. There'll be those moments for some of our longer-serving characters that briefly reflect on themselves and how they've changed. The characters don't know that it's the 25th anniversary of anything, so it'd be absurd to contrive too many situations in which they're reflective on the past. The main engine of that week is great stories that'll get people talking.\" The live episode featured the death of Bradley Branning (Charlie Clements) at the conclusion of the \"Who Killed Archie?\" storyline, which saw Bradley's wife Stacey Slater (Lacey Turner) reveal that she was the murderer. Viewing figures peaked at 16.6 million, which was the highest viewed episode in seven years. Other events to mark the anniversary were a spin-off DVD, EastEnders: Last Tango in Walford, and an Internet spin-off, EastEnders: E20.", "The Watts and Mitchell families have been central to many notable EastEnders storylines, the show having been dominated by the Watts in the 1980s, with the 1990s focusing on the Mitchells. The early 2000s saw a shift in attention towards the newly introduced female Slater clan, before a renewal of emphasis upon the restored Watts family beginning in 2003. Since 2006, EastEnders has largely been dominated by the Mitchell, Ahmed and Branning families, though the early 2010s also saw a renewed focus on the Moon family, and, from 2013 onwards, on the Carters. In 2016, the Fowlers were revived and merged with the Slaters, with Martin Fowler (James Bye) marrying Stacey Slater (Lacey Turner). The Taylor family were introduced in 2017 and have since been central to the show's main storylines. Key people involved in the production of EastEnders have stressed how important the idea of strong families is to the programme.", "The show often includes strong, brassy, long-suffering women who exhibit diva-like behaviour and stoically battle through an array of tragedy and misfortune. Such characters include Angie Watts (Anita Dobson), Kathy Beale (Gillian Taylforth), Sharon Watts (Letitia Dean), Pat Butcher (Pam St Clement), Kat Slater (Jessie Wallace), Denise Fox (Diane Parish), Tanya Branning (Jo Joyner) and Linda Carter (Kellie Bright). Conversely there are female characters who handle tragedy less well, depicted as eternal victims and endless sufferers, who include Ronnie Mitchell (Samantha Womack), Little Mo Mitchell (Kacey Ainsworth), Laura Beale (Hannah Waterman), Sue Osman (Sandy Ratcliff), Lisa Fowler (Lucy Benjamin) and Mel Owen (Tamzin Outhwaite). The 'tart with a heart' is another recurring character. Often their promiscuity masks a hidden vulnerability and a desire to be loved. Such characters have included Pat Butcher (Pam St Clement) (though in her latter years, this changed), Tiffany Mitchell (Martine McCutcheon), Kat Slater (Jessie Wallace), Stacey Slater (Lacey Turner), Dawn Swann (Kara Tointon), Roxy Mitchell (Rita Simons), Whitney Dean (Shona McGarty) and Lauren Branning (Jacqueline Jossa).", "A gender balance in the show is maintained via the inclusion of various \"macho\" male personalities such as Mick Carter (Danny Dyer), Phil Mitchell (Steve McFadden), Grant Mitchell (Ross Kemp), Dennis Rickman (Nigel Harman), Jack Branning (Scott Maslen) and Max Branning (Jake Wood), \"bad boys\" such as Den Watts (Leslie Grantham), Sean Slater (Robert Kazinsky), Michael Moon (Steve John Shepherd) and Vincent Hubbard (Richard Blackwood), and \"heartthrobs\" such as Simon Wicks (Nick Berry), Jamie Mitchell (Jack Ryder), Dennis Rickman (Nigel Harman), Joey Branning (David Witts), Kush Kazemi (Davood Ghadami) and Keanu Taylor (Danny Walters). Another recurring male character type is the smartly dressed businessman, often involved in gang culture and crime and seen as a local authority figure. Examples include Steve Owen (Martin Kemp), Jack Dalton (Hywel Bennett), Andy Hunter (Michael Higgs), Johnny Allen (Billy Murray) and Derek Branning (Jamie Foreman). Following criticism aimed at the show's over-emphasis on \"gangsters\" in 2005, such characters have been significantly reduced. Another recurring male character seen in EastEnders is the 'loser' or 'soft touch', males often comically under the thumb of their female counterparts, which have included Arthur Fowler (Bill Treacher), Ricky Butcher (Sid Owen), Garry Hobbs (Ricky Groves), Lofty Holloway (Tom Watt) and Billy Mitchell (Perry Fenwick). Other recurring character types that have appeared throughout the serial are \"cheeky-chappies\" Pete Beale (Peter Dean), Alfie Moon (Shane Richie), Garry Hobbs (Ricky Groves) and Kush Kazemi (Davood Ghadami), \"lost girls\" such as Mary Smith (Linda Davidson), Donna Ludlow (Matilda Ziegler), Mandy Salter (Nicola Stapleton) and Hayley Slater (Katie Jarvis), delinquents such as Stacey Slater (Lacey Turner), Jay Brown (Jamie Borthwick), Lola Pearce (Danielle Harold), Bobby Beale (Eliot Carrington/Clay Milner Russell) and Keegan Baker (Zack Morris), \"villains\" such as Nick Cotton (John Altman), Trevor Morgan (Alex Ferns), May Wright (Amanda Drew), Yusef Khan (Ace Bhatti), Archie Mitchell (Larry Lamb), Dean Wicks (Matt Di Angelo) and Stuart Highway (Ricky Champ), \"bitches\" such as Cindy Beale (Michelle Collins), Janine Butcher (Charlie Brooks), Sam Mitchell (Danniella Westbrook), Lucy Beale (Melissa Suffield/Hetti Bywater), Abi Branning (Lorna Fitzgerald), Babe Smith (Annette Badland) and Louise Mitchell (Tilly Keeper), \"brawlers\" or \"fighters\" such as Bianca Jackson (Patsy Palmer), Kat Slater (Jessie Wallace), Chelsea Fox (Tiana Benjamin), Dawn Swann (Kara Tointon), Stacey Slater (Lacey Turner) and Karen Taylor (Lorraine Stanley), and cockney \"wide boys\" or \"wheeler dealers\" such as Frank Butcher (Mike Reid), Alfie Moon (Shane Richie), Kevin Wicks (Phil Daniels), Darren Miller (Charlie G. Hawkins), Fatboy (Ricky Norwood) and Jay Brown (Jamie Borthwick).", "EastEnders has been praised for its portrayal of characters with disabilities, including Adam Best (David Proud) (spina bifida), Noah Chambers (Micah Thomas) (deaf), Jean Slater (Gillian Wright) and her daughter Stacey (Lacey Turner) (bipolar disorder), Janet Mitchell (Grace) (Down syndrome), Jim Branning (John Bardon) (stroke) and Dinah Wilson (Anjela Lauren Smith) (multiple sclerosis). The show also features a large number of gay, lesbian and bisexual characters (see list of soap operas with LGBT characters), including Colin Russell (Michael Cashman), Barry Clark (Gary Hailes), Simon Raymond (Andrew Lynford), Tony Hills (Mark Homer), Sonia Fowler (Natalie Cassidy), Naomi Julien (Petra Letang), Tina Carter (Luisa Bradshaw-White), Tosh Mackintosh (Rebecca Scroggs), Ben Mitchell (Harry Reid/Max Bowden), Paul Coker (Jonny Labey), Iqra Ahmed (Priya Davdra), Ash Kaur (Gurlaine Kaur Garcha), and Callum \"Halfway\" Highway (Tony Clay). Kyle Slater (Riley Carter Millington), a transgender character, was introduced in 2015.", "In the early 2000s, EastEnders covered the issue of euthanasia  with Ethel Skinner's (Gretchen Franklin) death in a pact with her friend Dot Cotton (June Brown), the unveiling of Kat Slater's (Jessie Wallace) sexual abuse by her uncle Harry (Michael Elphick) as a child (which led to the birth of her daughter Zoe (Michelle Ryan), who had been brought up to believe that Kat was her sister), the domestic abuse of Little Mo Morgan (Kacey Ainsworth) by husband Trevor (Alex Ferns) (which involved marital rape and culminated in Trevor's death after he tried to kill Little Mo in a fire), Sonia Jackson (Natalie Cassidy) giving birth at the age of 15 and then putting her baby up for adoption, and Janine Butcher's (Charlie Brooks) prostitution, agoraphobia and drug addiction. The soap also tackled the issue of mental illness and carers of people who have mental conditions, illustrated with mother and daughter Jean (Gillian Wright) and Stacey Slater (Lacey Turner); Jean suffers from bipolar disorder, and teenage daughter Stacey was her carer (this storyline won a Mental Health Media Award in September 2006\"Mental Health Media Awards 2006\" BBC. Retrieved 28 February 2008.). Stacey went on to struggle with the disorder herself. The issue of illiteracy was highlighted by the characters of middle-aged Keith (David Spinx) and his young son Darren (Charlie G. Hawkins). EastEnders has also covered the issue of Down syndrome, as Billy (Perry Fenwick) and Honey Mitchell's (Emma Barton) baby, Janet Mitchell (Grace), was born with the condition in 2006. EastEnders covered child abuse with its storyline involving Phil Mitchell's (Steve McFadden) 11-year-old son Ben (Charlie Jones) and lawyer girlfriend Stella Crawford (Sophie Thompson), and child grooming involving the characters Tony King (Chris Coghill) as the perpetrator and Whitney Dean (Shona McGarty) as the victim.", "EastEnders has featured seven live broadcasts. For its 25th anniversary in February 2010, a live episode was broadcast in which Stacey Slater (Lacey Turner) was revealed as Archie Mitchell's (Larry Lamb) killer. Turner was told only 30 minutes before the live episode and to maintain suspense, she whispers this revelation to former lover and current father-in-law, Max Branning, in the very final moments of the live show. Many other cast members only found out at the same time as the public, when the episode was broadcast. On 23 July 2012, a segment of that evening's episode was screened live as Billy Mitchell (Perry Fenwick) carried the Olympic Flame around Walford in preparation for the 2012 Summer Olympics. In February 2015, for the soap's 30th anniversary, five episodes in a week featured live inserts throughout them. Episodes airing on Tuesday 17, Wednesday 18 and Thursday 19 (which featured an hour long episode and a second episode) all featured at least one live insert. The show revealed that the killer of Lucy Beale (Hetti Bywater) was her younger brother, Bobby (Eliot Carrington), during the second episode on Thursday, after a ten-month mystery regarding who killed her. In a flashback episode which revisited the night of the murder, Bobby was revealed to have killed his sister. The aftermath episode, which aired on Friday 20, was completely live and explained in detail Lucy's death. Carrington was told he was Lucy's killer on Monday 16, while Laurie Brett (who plays Bobby's adoptive mother, Jane) was informed in November, due to the character playing a huge role in the cover-up of Lucy's murder. Bywater only discovered Bobby was responsible for Lucy's death on the morning of Thursday, 19 February, several hours before they filmed the scenes revealing Bobby as Lucy's killer.", "According to the book How to Study Television, in 1995 EastEnders cost the BBC £40,000 per episode on average. A 2012 agreement between the BBC, the Writers' Guild of Great Britain and the Personal Managers' Association set out the pay rate for EastEnders scripts as £137.70 per minute of transmission time (£4,131 for 30 minutes), which is 85 per cent of the rate for scripts for other BBC television series. The writers would be paid 75 per cent of that fee for any repeats of the episode. In 2011, it was reported that actors receive a per-episode fee of between £400 and £1,200, and are guaranteed a certain number of episodes per year, perhaps as few as 30 or as many as 100, therefore annual salaries could range from £12,000 to £200,000 depending on the popularity of a character. Some actors' salaries were leaked in 2006, revealing that Natalie Cassidy (Sonia Fowler) was paid £150,000, Cliff Parisi (Minty Peterson) received £220,000, Barbara Windsor (Peggy Mitchell) and Steve McFadden (Phil Mitchell) each received £360,000 and Wendy Richard (Pauline Fowler) had a salary of £370,000. In 2017, it was revealed that Danny Dyer (Mick Carter) and Adam Woodyatt (Ian Beale) were the highest-paid actors in EastEnders, earning between £200,000 and £249,999, followed by Laurie Brett (Jane Beale), Letitia Dean (Sharon Watts), Tameka Empson (Kim Fox), Linda Henry (Shirley Carter), Scott Maslen (Jack Branning), Diane Parish (Denise Fox), Gillian Taylforth (Kathy Beale) and Lacey Turner (Stacey Slater), earning between £150,000 and £199,999."]}, {"page": "March 28", "response": ["*  1988   – Lacey Turner, English actress"]}, {"page": "1988", "response": ["* March 28 – Lacey Turner, English actress"]}, {"page": "Kirkstall Abbey", "response": ["The Abbey was also used on 19 March 2011 for the live BBC Three event Frankenstein's Wedding... Live in Leeds. A live music drama starring Andrew Gower and Lacey Turner as fiancees Victor Frankenstein and Elizabeth Lavenza."]}, {"page": "Hendon", "response": ["* Lacey Turner – actress who plays Stacey Slater in EastEnders"]}, {"page": "Turner (surname)", "response": ["*Lacey Turner (born 1988), English actor"]}, {"page": "Peggy Mitchell", "response": ["A few years later, Peggy finds herself reacquainted with Archie after getting to know his two daughters Ronnie (Samantha Womack) and Roxy (Rita Simons) respectively. She forms a relationship with him and the pair get engaged, although Archie quickly begins to subtly controlling Peggy. They  nonetheless get married, but it ends a few hours later when it is publicly transpires that Archie lied to Ronnie about her infant daughter's death. Peggy has Archie evicted from The Queen Vic and attempts to have Phil kill him in revenge, but she is left furious when Phil lets doesn't go through with it in the end. Peggy files for divorce and Archie plots revenge on the entire Mitchell family. When Peggy loses the bail surety she has paid on behalf of her daughter Sam (who breaks the conditions of her bail following coercion from Archie), the Mitchells are forced to use The Queen Vic to gain a collateral loan from Phil's sworn arch-rival and estranged stepson Ian Beale (Adam Woodyatt). Thereafter Archie uses Janine to blackmail Ian into selling him the loan, and when the Mitchells are unable to meet the loan repayment, Archie evicts them and assumes ownership of the pub. However, Archie is murdered on Christmas Day 2009 by an unknown assailant (see Who Killed Archie?). Peggy grieves for Archie, but she and various other members of her family become suspects for his murder. Following a police enquiry, local residents Bradley Branning (Charlie Clements) is posthumously found guilty of the murder, though unbeknown to everyone, the actual murderer is Bradley's wife Stacey Branning (Lacey Turner) after Archie raped her months ago. In his will, Archie leaves The Queen Vic to Roxy, who reinstates Peggy.", "In November 2005, Peggy appeared in a sketch for Children in Need, which was a crossover between EastEnders and The Catherine Tate Show. The sketch featured Peggy, Little Mo Mitchell (Kacey Ainsworth), Stacey Slater (Lacey Turner) and Catherine Tate as her character Lauren Cooper. The 2006 episode of Doctor Who titled \"Army of Ghosts\" features a fictional EastEnders scene in which Peggy tells the ghost of Den Watts to \"get outta my pub!\""]}, {"page": "Sharon Watts", "response": ["Dennis reunites with Sharon in America and in June 2005 they return to confront Den, but Chrissie claims he has left with another woman - which surprises them, especially as his departure had come so soon after realising his dream of buying back the pub. Sharon and Dennis marry on 29 August 2005; during their reception, however, Sam is arrested for digging up Den's body to incriminate Chrissie; however, Sam is charged with Den's murder. Her brothers, Phil and Grant, return weeks later to convince Sharon of Chrissie's guilt. Sharon and Grant resolve their past grievances, as do Dennis and Phil, and the four work together with Peggy to bring Chrissie to justice. Sharon tries to persuade Stacey Slater (Lacey Turner) to change Zoe’s alibi, but to no avail. Eventually, Phil and Grant manage to extract a tape of Chrissie confessing to Den's murder - thus proving her guilty to the police. While Sam would later be released from prison, Sharon personally confronts Chrissie just as she attempts to flee the country and punches her to avenge her father's death; Chrissie is then arrested and sentenced to life imprisonment. However, the Mitchell's victory is cut short when Sam is forced to flee the country after discovering that she will likely be detained for perverting the course of justice in Den's murder. On Christmas Day 2005, Sharon is stunned to discover she is pregnant. She and Dennis celebrate the potential of having a child. However, their happiness is threatened when Dennis' resolved issues with Phil leads him to become embroiled into a conflict against his enemy and the square's crime kingpin: Johnny Allen (Billy Murray). When Sharon starts to intervene in Johnny's personal affairs in an attempt to warn him to stay away from Dennis, he throttles her and proceeds to give Sharon an ultimatum; he will kill Dennis unless they leave Walford by midnight on New Year's Eve. Sharon persuades Dennis to leave after confiding in Phil about Johnny's threat. Phil, seeking to get one over Johnny before the end of 2005, later informs Dennis about the threat after telling him that Johnny killed his best-friend Andy Hunter (Michael Higgs). At first Dennis refuses to submit to Phil's temptation in confronting Johnny about Andy's murder, but relents after Phil describes the way how Johnny threatened Sharon earlier on. Dennis ends up attacking Johnny to avenge both Andy and Sharon, leaving him battered as Phil had hoped. At the stroke of New Year's Day, Sharon and Dennis spot each other and they start to reunite until Dennis has a run-in with a person - and ends up getting stabbed; Dennis stumbles upon Sharon's arms and dies, though not before telling her \"We did it!\". Heartbroken and devastated over her husband's death, Sharon refuses to speak after requesting Phil to avenge Dennis' murder. Later on at Dennis' funeral, Sharon attacks Johnny when he turns up at the funeral - prompting Phil to take her home. Concerned for her unborn child, Phil persuades Sharon to return to Florida to live with Michelle in January 2006; Sharon later gives birth to a son, Dennis Rickman Jnr (Harry Hickles/Bleu Landau)."]}, {"page": "Walford", "response": ["The nightclub on Turpin Road is originally named Strokes Wine Bar until George Palmer (Paul Moriarty) buys it and renames it \"The Cobra Club\". He uses the club as a cover for his criminal business. Annie Palmer (Nadia Sawalha), George's daughter, takes over the control of the club when he leaves; she renames the club \"The Market Cellar\". Annie later sells the club to Steve Owen (Martin Kemp), who renames it \"e20\". Under Steve's ownership, Saskia Duncan (Deborah Sheridan-Taylor) is killed in the club after a struggle with Steve and Matthew Rose (Joe Absolom). Beppe di Marco (Michael Greco) and Billy Mitchell (Perry Fenwick) buy the club from Steve, although Beppe sells his majority share to Sharon Watts (Letitia Dean), who rebrands the club \"Angie's Den\", in memory of her parents Angie Watts (Anita Dobson) and Den Watts (Leslie Grantham). Following a refurbishment, Den buys into the business and co-owns with Sharon. They sell the club to Johnny Allen (Billy Murray), who renames it \"Scarlet\" after his deceased daughter. Johnny gives the club to his surviving daughter, Ruby Allen (Louisa Lytton), when he is imprisoned. The start of Stacey Slater (Lacey Turner) and Bradley Branning's (Charlie Clements) relationship begins in Scarlet when Bradley is falsely blamed for spiking Stacey's drink. A reporter from Inside Soap labelled the moment \"a rather unromantic start to Stacey and Bradders' love story!\" Ronnie Mitchell (Samantha Womack) and Jack Branning (Scott Maslen) buy the club, renaming it the \"R&R\" - the initials of Ronnie and her sister, Roxy Mitchell (Rita Simons). Ronnie and Roxy run the club, while Jack operates as a silent partner. When Ronnie and Jack separate, Ronnie sells her share of the club to Jack, although after a fire in the club, Ronnie and Roxy each buy a share in the club. When Billy tries to woo Carol Jackson (Lindsay Coulson), Carol's daughter Bianca Butcher (Patsy Palmer) becomes aggressive and creates an argument between them, Stacey, Janine Butcher (Charlie Brooks) and Kat Moon (Jessie Wallace). An Inside Soap columnist labelled the argument \"one of our favourite catfights\". Jack is later shot at the club by gang member Kylie (Elarica Gallacher), and a few months later, he sells his share of the club to Phil Mitchell (Steve McFadden). Roxy and Ronnie also sell their shares to Janine. Upon her return to Walford, Sharon becomes the R&R's bar manager and she holds her wedding to Jack at the club. At the altar, Jack jilts Sharon, leaving her saddened. Sharon is also offered a small share in the business by Phil. Janine and Sharon later sell their shares to Phil, leaving him as the sole owner. The R&R closes at some point in before Christmas 2016, and remains shut until February 2018, when Sharon decides to reopen it with Mel Owen (Tamzin Outhwaite) as the manager. Mel plans to rename the club \"The Phoenix\", but her son Hunter Owen (Charlie Winter) sabotages the refurbishment and rebrands it e20 again in honour of his father, Steve. When Mel's ex-husband Ray Kelly (Sean Mahon) plans to remarry her, he buys Phil's 50% stake in E20 and gifts it to Mel as a wedding present. In November Mel decides to sell her half of E20 to Ruby and later blackmails Sharon into selling her half too, leaving Ruby as the new owner of the club which she renames “Ruby’s”."]}, {"page": "Radlett", "response": ["* Lacey Turner, EastEnders actress"]}, {"page": "Lacey", "response": ["* Lacey Turner (born 1988), English actress"]}, {"page": "Patrick Trueman", "response": ["Patrick rents the car-lot, hiring Pat Evans (Pam St Clement) to do bookkeeping. Patrick and Pat begin a casual affair, which Yolande discovers when Stacey Slater (Lacey Turner) informs her; Yolande slaps Pat, who retaliates. Yolande threatens to leave, but Patrick persuades her to rebuild their marriage. Yolande remains resentful and almost strays with Aubrey Valentine (Joseph Marcell), a member of Patrick's former band, The Five Hectors; Aubrey tries to destroy Patrick but fails and the Truemans remain together. Denise Fox (Diane Parish) discovers that a member of Patrick's band is her father although she is unsure which member. Patrick takes a DNA test and it is revealed that he is not Denise's father, but he pretends he is as he has grown attached to her. The truth comes out while Patrick and Denise holiday together; despite initial upset, Denise and the Truemans remain close. Patrick sees Denise as the daughter he never had and acts as grandfather to her two daughters Chelsea (Tiana Benjamin) and Libby (Belinda Owusu)."]}, {"page": "Charlie Slater", "response": ["Charlie, a taxicab driver, who is widowed from Viv Slater (April Martin), arrives in Walford with Viv's mother Mo Harris (Laila Morse) and Charlie's four daughters: Lynne Slater (Elaine Lordan), Kat Slater (Jessie Wallace), Little Mo Morgan (Kacey Ainsworth), and Zoe Slater (Michelle Ryan), plus Lynne's boyfriend, Garry Hobbs (Ricky Groves). It soon emerges that Kat is actually Zoe's mother and that it has been kept a family secret until Zoe finds out. Demanding to know the identity of her birth father, Zoe and Charlie are stunned to discover that it was Charlie's younger brother Harry Slater (Michael Elphick), who raped Kat when she was a teenager. Little Mo, now married to Billy Mitchell (Perry Fenwick), is raped by Graham Foster (Alex McSweeney). When Charlie finds out, he attacks Graham after locking him in his taxi. Charlie is arrested and remanded in custody for grievous bodily harm, to which he pleads guilty, but the family has to pay Graham £10,000 compensation. Charlie's cab license is revoked, but is later restored. Lynne, now married to Garry, leaves Walford after her baby, Vivienne, is stillborn. Charlie's great-niece Stacey Slater (Lacey Turner) moves in, and Charlie becomes a father figure to her, helping her curb her rebellious and wayward attitude. At the same time, he comforts Zoe after she has an abortion. Zoe eventually leaves, soon followed by Kat, who is now married to Alfie Moon (Shane Richie). However, Stacey's mother Jean Slater (Gillian Wright) moves in with the family.", "It was announced on 3 November 2013 that Charlie would be making a brief return to screens over the Christmas period. Martin was revealed to have already filmed his return and would appear in one episode in December. Details surrounding Charlie's reason to return was being kept secret from the public, but was tipped to involve his daughter, Kat. A show spokesperson confirmed Martin's return. Speaking of his return, Martin said: \"It was wonderful to go back after all this time. I got a call saying they wanted me to do an episode for Christmas. I walked into the Queen Vic on my first day and it was like I'd never left.\"EastEnders Derek Martin: \"I hope Charlie Slater return is permanent\" - EastEnders News | Soaps | Digital Spy Spoiler pictures showing Charlie's return was released on 8 December. The pictures showed Kat and her husband, Alfie, celebrating their final day in charge of The Queen Victoria, with Mo joining them alongside Charlie.Corrie kiss, EastEnders return, Hollyoaks cruelty, Emmerdale scan On 22 December 2013, Martin revealed that he wants a permanent return to EastEnders following his guest return at Christmas, which was said to last two episodes, \"Who knows, if Charlie goes down well this Christmas, maybe it will all become more permanent. Nothing's been said but I can't help hoping.\" Charlie's return scenes aired on 24 and 25 December 2013, with 7.65 million tuning in to watch on 24 December and 8.60 million on 25 December. Lacey Turner, who plays Charlie's great niece Stacey Branning, expressed an interest in Charlie and her on-screen mother, Jean (Gillian Wright) returning, \"Having scenes with the Slaters is my favourite thing, though. It would be great if we could get Derek Martin and Gillian Wright back.\"EastEnders' Lacey Turner: 'Stacey Branning return was a no-brainer' - EastEnders News - Soaps - Digital Spy"]}, {"page": "Mo Harris", "response": ["Mo, who previously lived in Walford, returns there after almost forty years away, with her son-in-law, Charlie Slater (Derek Martin) and granddaughters, Lynne Slater (Elaine Lordan), Kat Slater (Jessie Wallace), Little Mo Morgan (Kacey Ainsworth) and Zoe Slater (Michelle Ryan). Mo's rivalry with her former best friend Pat Evans (Pam St Clement) arises, but they reconcile at the grave of Mo's former husband and Pat's brother, Jimmy Harris (Alex King). Much of Mo's time is spent selling poor quality stolen goods and she trades with Fat Elvis (Shenton Dixon). She is assisted by Mickey (Joe Swash) and Darren Miller (Charlie G. Hawkins) and for a while sets up a sex chatline. She also works with Charlie's great-niece, Stacey Slater (Lacey Turner), on her market stall, selling clothes. She has a brief relationship with Bert Atkinson (Dave Hill), but ends it because Bert is also seeing her friend, Ina Foot (Ina Clare). They reconcile, but break up again when Bert's ex-wife, Evie Brown (Marji Campi), arrives in Walford, terminally ill. Mo begins selling cigarettes that she bought in Spain and two of her customers turn out to be Revenue and Customs officers. She is sentenced to 100 hours of community service, for tax evasion. After Stacey marries Bradley Branning (Charlie Clements), Mo tries to sell their wedding gifts."]}, {"page": "Arthur Fowler", "response": ["In 2015, Martin names his son with Stacey Slater (Lacey Turner) after his father, though it emerges that he is actually the son of Kush Kazemi (Davood Ghadami)."]}, {"page": "The Sunday Night Project", "response": ["| Bernard Cribbins and Lacey Turner"]}, {"page": "Chrissie Watts", "response": ["Chrissie Watts was created by the production team to be more the \"equal\" of her notorious and villainous husband than his long-suffering first wife, Angie (Anita Dobson). The character was described by Oberman as being like Angie \"but with 15 more years of feminism behind her\", and was hailed by the TV editor of the Evening Standard as \"the only strong woman left in Walford\". She became well known for her deviousness and \"scheming\", echoing the traits of her husband, with the official EastEnders website characterising her as \"happy to play mind games\" and \"often two steps ahead\" of Den. As part of the Watts family and the last of its major members to have appeared on the show, Chrissie's storylines explored her tumultuous marriage to Den; bonding with his adopted daughter Sharon (Letitia Dean) and her two half-siblings, Dennis Rickman (Nigel Harman) and Vicki Fowler (Scarlett Alice Johnson); conspiring with Den to retake ownership of The Queen Victoria public house; forming a relationship with her boyfriend Jake Moon (Joel Beckett) after Den's murder; attempting to sell the Queen Vic Jake's gangland boss Johnny Allen (Billy Murray) and local businessman Ian Beale (Adam Woodyatt); being blackmailed by young wayward Stacey Slater (Lacey Turner); and feuding with the rival Mitchell family. During her time on the show, Chrissie sparked numerous clashes with other female characters - such as her archenemy Sam Mitchell (Kim Medcalf); Stacey's cousin Kat (Jessie Wallace); Phil's girlfriend Kate Morton (Jill Halfpenny); Kat's daughter Zoe (Michelle Ryan); and Sam's mother Peggy (Barbara Windsor). It was noted by Oberman herself that Chrissie \"had more fights on EastEnders than most women have in their whole lives\", and was constantly scheming against those who got in her way - thereby earning her the sobriquet of \"super-bitch\".", "Dennis and Sharon return to Walford in search of their father. Chrissie is unable to get them to leave Walford again, but is able to forge her friendship with Sharon over the belief that Den left the country with another woman. Chrissie also supports Sharon and Dennis when they decide to get married. By then, Sam is overwhelmed with frustration and desperation in her little efforts to win her conflict against Chrissie. After Chrissie taunts her once more, Sam gets drunk and goes against Kat's reservations in another attempt to get one over Chrissie. On the day Sharon and Dennis get married, Sam smashes up Den's grave and digs up his body in the hope that Chrissie will be sent down for his death; she ends up getting arrested after assaulting the pub's barmaid, Tracey (Jane Slaughter), in the midst of unearthing Den's corpse. When this becomes public knowledge, Den is officially pronounced dead and Chrissie feigns grief whilst also comforting Sharon over her loss. The police later take Chrissie at the station for questioning after Sam tells them everything about Den's murder. However, this backfires when Den's bloodstains are found under Sam's sink and her story constantly changes as a result. Chrissie seizes an opportunity to incriminate Sam for the crime by convincing Kat to get her cousin, Stacey (Lacey Turner), to give the police a false alibi that Zoe and Chrissie were with her on the night Den died. Feeling that she has no other way to protect her daughter, Kat agrees as that means Zoe is cleared from the police's viewpoint on her involvement in Den's murder. Resultingly, Sam is arrested and held in prison for Den's murder while Chrissie appears to have seemingly got away with the crime."]}, {"page": "Yolande Trueman", "response": ["In early 2006, Yolande strikes up a feud with Pat Evans (Pam St Clement) when she starts to become involved in another Trueman business, Trueman's Motors. Their rivalry increases when Pat begins an affair with Patrick, but their Minute Mart employee Stacey Slater (Lacey Turner) catches Pat and Patrick kissing and tells Yolande. This results in a brawl in The Queen Victoria public house. Yolande attempts to play Patrick at his own game. She goes to a nightclub intending to pick up a man and have an affair. She comes onto Kevin Wicks (Phil Daniels), he reciprocates, and the pair arrange to go back to his house for sex. However she has second thoughts and backs out. The next day, she confesses to Patrick that she almost had sex with another man, and, albeit reluctantly, gives Patrick another chance. Soon afterwards, in October 2006, Yolande then has a supposed drunken one-night stand with Aubrey Valentine (Joseph Marcell), one of Patrick's old friends. This results in Patrick throwing her out, but when they call Aubrey's bluff, he admits they did not have sex, and the couple reconcile."]}, {"page": "Alfie Moon", "response": ["Alfie receives a letter from the council, stating that they are due to be evicted from No. 23 Albert Square. He doesn't tell Kat but Stacey finds it and forces him to tell Kat and Mo. Alfie tells Kat that he has got a bank loan but considers starting a fire for the insurance money. Despite Mick Carter (Danny Dyer) advising him against it, he drops a lit cigarette into a paper-filled wastebasket. When outside, he learns Kat is in the house and rushes back to rescue her but Mo's stash of dodgy hairspray causes an explosion, just as Alfie opens the front door. He rescues Kat regardless, receiving minor burns, but Kat is badly burnt. Alfie and the Moons are supported by the local community and stay with the Masood family. Alfie is praised as a hero, despite being suspected by local firefighter Tosh. However, the fire investigation officer declares the fire an accident but Mick advises him not to tell Kat that he started the fire and when Kat thanks him for saving her life, he takes Mick's advice. He is relieved when the fire investigation officer Neil Wallace informs him that the insurers will probably pay for the damage to be repaired but Stacey finds the picture of Nana Moon and realises Alfie started the fire and demands Alfie tell Kat but he refuses, creating a rift between them. The insurance company also refuse to pay for the damage as Mo's quantity of hairspray is listed as commercial goods, invalidating the policy. He tells Stacey Branning (Lacey Turner) and she suggests ringing the insurance company again but Alfie refuses, adamant that they won’t change their decision and blames Mo. Stacey then suggests Alfie use the proceeds from selling the Capri to sort out their finances but he can't as the money was spent on food and the children. Masood Ahmed (Nitin Ganatra) returns home and asks Alfie when they will be moving out as the house is too crowded but Alfie loses his temper with Masood and accuses him of kicking them out."]}, {"page": "LaceyTurner", "response": ["#REDIRECT Lacey Turner"]}, {"page": "Dot Cotton", "response": ["Four months later, Dot is released and shares her regret with Ian that she did not report any of Nick's crimes earlier in life. Fatboy tells Dot he is spending Christmas with his father, but later his friend Vincent Hubbard (Richard Blackwood) discovers Fatboy's belongings amongst some blood in the boot of a crushed car and tells Dot that Fatboy is not coming back because of a job abroad. Dot takes salsa classes and works with her old friend Patrick Trueman (Rudolph Walker) to prepare for a salsa show, who mistakenly thinks she wants a relationship, but she actually sets him and Claudette Hubbard (Ellen Thomas) up on a date. Dot receives a wedding invitation from her old friend, Colin, but she does not want to attend because she does not believe in homosexual marriage. Colin visits her on his wedding day to persuade her to come, which she does. Dot discovers the launderette will become a dry cleaner and is interviewed for her own job; she struggles with the technical terminology but defends herself as a people person. However, she is told that she will not be kept on after the launderette is refurbished. She tries to contact her boss by telephone but when she finally gets through, he hangs up. Ricky Mitchell (Henri Charles) learns about the harvest festival and leaves a box of food on Dot's doorstep, which offends her as she does not believe she is poor or lonely, however, she realises just how lonely she is when Abi is unable to have dinner with her. Dot and Kim Fox-Hubbard (Tameka Empson) are involved in a car collision, but both blame the other as Kim has no licence but Kim accuses Dot of being too old to drive. Dot then locks her car key away. After Patrick and Dot go to the cinema together, he convinces her to see an optician because she was squinting throughout. Dot is seen hiding away in her house on Halloween and Patrick comes to talk to her. Dot says her hatred of Halloween is due to awful things happening on Halloween, such as Stacey Fowler (Lacey Turner) getting electrocuted and Max Branning (Jake Wood) getting run over. She then tries to read the Bible to Patrick but cannot see the words. Patrick tells her she isn't scared of Halloween but of the world. Dot reveals that she thinks she is going blind but then kicks Patrick out of the house. When he leaves, it is revealed that Dot cannot see anything clearly. Patrick books Dot a doctor's appointment; the doctor suspects age-related macular degeneration, which is later confirmed. Dot starts treatment but she is annoyed that her eyesight does not improve much. She turns down Ronnie's offer of paying for surgery to permanently fix her sight."]}, {"page": "Charlie Brooks", "response": ["| All About Soap Bubble Awards || Best Soap Love Triangle  (Shared with Lacey Turner and Neil McDermott) || "]}, {"page": "Victor Frankenstein", "response": ["* Also in 2011, a unique, musical adaptation called Frankenstein's Wedding: Live in Leeds was performed in front of a group of 12,000 at the Kirkstall Abbey. It incorporated footage, filmed prior to the performance, focusing mostly on Frankenstein (played by Andrew Gower) and his creation of the creature, with the live show focusing mainly on Frankenstein's wedding to Liz (played by Lacey Turner), and the tragic story that follows. The show also starred Mark Williams as Alphonse Frankenstein, and David Harewood as The Creature. The show was broadcast live on BBC Three on 9 March."]}, {"page": "Kat Slater", "response": ["In the events of Kat's second stint on the soap, in what was called \"the biggest soap story in probably the history of soaps\", Kat and Ronnie Branning (Samantha Womack) both give birth on the same day, but Ronnie's baby, James Branning, dies and while Kat is in hospital and her baby, Tommy Moon, is unattended, Ronnie swaps the infants. The storyline received over 6,000 complaints, making it the second most complained about EastEnders storyline. Kat's storylines also include suffering a miscarriage, an affair with Derek Branning (Jamie Foreman) which briefly ends her marriage with Alfie, becoming penniless and permanently scarred in a fire and becoming a millionaire. In 2015 Kat's most prominent storyline – the character's rape, is revisited when it is revealed that Kat had given birth to twins and she has a secret son, Zoe's twin brother and this facilitates the characters second exit from the soap. In Kat & Alfie: Redwater, Kat discovers her son is a murderous Catholic priest, Dermott Dolan (Oisín Stack). Since her reintroduction in 2018, Kat's storylines have focused on the breakdown of her and Alfie's marriage and her separation from her children, a relationship with Kush Kazemi (Davood Ghadami), feuds with both her cousin Stacey Slater (Lacey Turner) and Phil Mitchell (Steve McFadden), which leads to the latter suffering from an injury caused by Stacey, supporting her friend Whitney Dean (Shona McGarty) with her stalker Leo King (Tom Wells) and developing feelings for Phil after sleeping with him, surviving a hit-and-run perpetrated by Whitney and taking custody of her son's half sister Scarlett Butcher (Tabitha Byron).", "Several months later, Kat's grandmother Mo discovers that she is in prison for prostitution. Upon her release, Mo convinces her to return to Walford. Kat is determined to win Alfie back, but he is now in a relationship with Little Mo. Though he opts to reconcile with Kat, she is unwilling once she learns of his relationship with her sister. Kat rebuilds her relationship with Zoe, and they part on good terms when Zoe leaves to work as a holiday rep in Ibiza. Before Zoe leaves, Kat discovers that Zoe was involved in the murder of Den Watts (Leslie Grantham), and tells Kat that she had been led to believe that she had killed Den until Sam Mitchell (Kim Medcalf) had told her the truth about Chrissie Watts (Tracy-Ann Oberman) being the murderer. Kat confronts Sam about letting Zoe believe that she had killed Den and threatens Chrissie to not let Zoe's involvement become known to the police. Chrissie agrees, but in return, asks for an alibi. Kat's cousin Stacey Slater (Lacey Turner) agrees to become Chrissie's alibi, but Chrissie is later caught out and arrested for Den's murder. When Nana Moon dies, Kat comforts Alfie and their feelings for one another once more become apparent. On Christmas Day 2005, they confess their love and depart Walford to travel across the United States.", "Phil decides to sell The Queen Vic, as revenge for Alfie's treatment of Roxy, and Kat and Alfie move back in with Mo. Kat then reveals that she is pregnant by Alfie, and discovers that she is having twins. Having spotted her cousin Stacey Slater (Lacey Turner) from the top deck of a bus, Kat decides to track her down. She visits Janine in prison, and agrees to provide a false witness statement for Michael's murder, in return for Janine dropping false charges against Stacey, so that she can return to Walford. At her trial, Janine confesses to her crimes, and Kat is charged with perjury. She is devastated when Stacey hands herself over to the police for Archie Mitchell's (Larry Lamb) murder (see Who Killed Archie?), five years previously. Kat attends a hearing, and is given a suspended sentence. After the market is merged with Spring Lane, Kat immediately clashes with her new rival, Donna Yates (Lisa Hammond) and is later surprised when Alfie reveals he has bought a pitch on the market. Kat gives birth to Bert and Ernie Moon. Stacey is released after she appeals her sentence and comes to live with Alfie and Kat. The financial situation becomes worse for the Moons when Alfie reveals they are to be evicted as they have not been paying their bills."]}, {"page": "Pat Butcher", "response": ["In February 2006, missing male company, Pat begins flirting with Paul's adopted father Patrick (Rudolph Walker) - who is married but unable to resist the chance at a casual fling with Pat. Soon enough Patrick's young assistant Stacey Slater (Lacey Turner) sees them together and tells Patrick's wife, Yolande (Angela Wynter) about it; this ends the affair and causes Yolande to resent Pat as a result. In August 2007, Pat discovers that her mother lied about the date of her sister Joan's death. She and a kind stranger, Len Harker (Christopher Ellison), break into Joan's care home and learn that Joan died only a few years earlier after marrying a man with Down's syndrome. Pat is touched to discover that Joan often spoke of how much she loved her. In March 2008, Pat announces she is leaving Walford for Spain, but gets news that Frank has died of throat cancer. She is devastated and despite initial feuding, she and Peggy support each other through Frank's funeral. Pat opts to remain in Walford when her granddaughter Bianca Jackson (Patsy Palmer) turns to her for help soon after, moving in with her four children. Having reconciled with one grandchild, Pat severs her bond with another when she discovers Ian's stepson Steven Beale (Aaron Sidwell) is in hiding his runaway half-sister, Lucy Beale (Melissa Suffield). Pat threatens to tell Ian the truth and is hit by a car driven by Roxy Mitchell (Rita Simons) car whilst trying to apprehend Steven. She spends time in hospital, where Steven attempts to smother her before she can tell Ian. His plan fails, and Lucy returns to Ian."]}, {"page": "The Queen Victoria", "response": ["In 2004, Den tricks his way back into ownership of The Queen Vic, and within a few months he is killed by his second wife, Chrissie (Tracy-Ann Oberman), who buries his body in the cellar of pub. Chrissie forges his signature on a deed of transfer and tells the customers that he has left Walford, signing The Queen Vic over to her. Sam Mitchell (Kim Medcalf) digs up Den's body and Chrissie, in a plan to escape, sells the pub to Ian Beale (Adam Woodyatt) and is subsequently arrested for murder. Her confessing to forging his signature nullifies the sale to Ian and ownership reverts to Sharon, Den's heir. Sharon returns The Queen Vic to Peggy and Phil. When Sam (now played by Danniella Westbrook) breaks bail in 2009, the family goes into debt. Phil secures The Queen Vic against a loan from Ian, who is forced to sell it to Peggy's ex-husband Archie (Larry Lamb). The Mitchells initially continue running the pub but Peggy relents and hands over control to Archie and his fiancée Janine Butcher (Charlie Brooks) after her step daughter Ronnie Mitchell (Samantha Womack) suffers a miscarriage during a confrontation with her father Archie. After Archie is murdered on Christmas Day, his daughter Roxy (Rita Simons) inherits The Queen Vic. When Roxy tries to sell it on, Peggy objects, and Roxy signs over the pub to her. Later in 2010, Phil develops a drug addiction and is locked in a room in the pub by Peggy. After he escapes, he argues with his mother and sets fire to the pub as an act of revenge. The fire traps him and Stacey Branning (Lacey Turner) along with her baby Lily, but they all manage to escape.", "* 2007: Stacey Slater (Lacey Turner) slaps and attacks Tanya Branning (Jo Joyner) resulting in the two women brawling on Peggys 65th Birthday.", "* 2009: Archie Mitchell (Larry Lamb) is murdered (see Who Killed Archie?) on Christmas Day when Stacey Slater (Lacey Turner) pushes the bust of Queen Victoria onto his head.", "* 2010: On Christmas Eve, Janine Malloy (Charlie Brooks) reveals that Stacey Branning (Lacey Turner) murdered Archie Mitchell (Larry Lamb).", "* 2016: During Stacey (Lacey Turner) and Martin Fowler's (James Bye) wedding reception, Bobby Beale (Eliot Carrington) confesses that he murdered (see Who Killed Lucy Beale?) his half-sister, Lucy Beale (Hetti Bywater)."]}, {"page": "The Catherine Tate Show", "response": ["In November 2005, Tate appeared as Lauren in a special sketch for the BBC's annual Children in Need telethon. The segment is posed as a crossover with EastEnders, featuring Barbara Windsor as Peggy Mitchell, Kacey Ainsworth as Little Mo and Lacey Turner as Stacey Slater. The sketch sees Lauren arrive in Walford in search of revenge on Stacey, who has apparently stolen her boyfriend. When she makes an appearance in the Queen Vic, Peggy finds herself getting increasingly frustrated with Lauren, who asks, \"Are you a Cockney? Are you a Cockney sparrow?\" (pronounced 'Cock-er-ney') and \"Do you know Chas & Dave? Are you their mum?\" repeatedly. Peggy also unintentionally uses some of Lauren's catchphrases, such as \"Are you disrespecting my family?\" and \"Are you calling me a pikey?\" Lauren eventually leaves the pub after mixing some famous lines from the soap, including \"Hello princess\" and \"Rickaay!\" with her usual catchphrase, \"Bovvered?\".\"Catherine Tate appears in Walford\". BBC News. Retrieved 18 February 2007.", "|Barbara Windsor, Lacey Turner, Kacey Ainsworth", "*Lacey Turner – with Lauren Cooper"]}, {"page": "Jake Moon", "response": ["As Jake copes with the events of Danny's death and Johnny's arrest, he forms a relationship with Carly Wicks (Kellie Shirley); however, he ends it in August 2006. Jake soon becomes concerned for Ruby when she begins dating Sean Slater (Robert Kazinsky), the brother of Ruby's best-friend Stacey (Lacey Turner). He rightly guesses that Sean is using Ruby, and is only interested in her money. Jake and Sean become bitter enemies, but Sean convinces Ruby that he loves her and that Jake is trying to cause trouble between them. Ruby even tells Sean that it was Jake who had murdered Danny - giving Sean a hold over Jake. In October 2006, Jake turns to Johnny - who has been paying Jake to look after Ruby, since he has been in prison - and tells him what Sean is doing. When Johnny arranges for Sean to visit him in prison, Sean ignores his threats to stay away from Ruby and tells Johnny that there is nothing that he or Jake can do to stop him. Johnny attempts to phone Jake to order him to kill Sean, but he has a heart attack before he can dial and only manages to whisper \"Jake...kill him for me\" - mistakenly thinking he is speaking to Jake. Johnny's cellmate assumes that Johnny wants Jake killed, and Johnny dies soon after in hospital. Jake later decides to leave Walford, but as he walks out of Albert Square, he is confronted by a stranger - who asks if he is Jake Moon. What happens next is not revealed."]}, {"page": "Sonia Fowler", "response": ["Martin moves back into the area and Rebecca (now played by Jasmine Armfield) moves in with him, as she resents Sonia for leaving Martin. Martin believes he can repair his marriage, but Tina and Sonia share a kiss, which Martin sees. He tells everyone in The Vic about Sonia and Tina, but Sonia ends their relationship. Martin sends Rebecca, who now wants to be called Bex, to live with Sonia so she can spend more time with her mother. Sonia also repairs her relationship with Tina. Martin moves in with Stacey Slater (Lacey Turner), while Sonia and Tina embark on a full relationship. Sonia and Martin's divorce is finalised. After Tina drunkenly humiliates Sonia at an awards ceremony and Sonia rejects her, Tina has sex with Sophie Dodd (Poppy Rush) and regrets it, but before she can tell Sonia, Sonia reveals she has found a lump in her breast. Sonia forgives Tina for the humiliation, but Sophie tells Sonia that Tina cheated and their relationship ends, but they soon reunite. After having her breast lump checked, Sonia is given the all-clear."]}, {"page": "Jo Joyner", "response": ["| Best Slap (with Lacey Turner)"]}, {"page": "Simon Ashdown", "response": ["|Best Storyline (with Charlie Clements, Jo Joyner, Lacey Turner and Jake Wood)"]}, {"page": "Phil Mitchell", "response": ["The follow-up of Sharongate saw Phil embarking on a problematic marriage with Ben's mother Kathy Beale (Gillian Taylforth); constantly tormenting Kathy's eldest child Ian Beale (Adam Woodyatt) over the course of their long-running animosity; having a one-night stand with Ian's ex-wife Mel Healy (Tamzin Outhwaite); escalating his two most competitive rivalries with Mel's husband Steve Owen (Martin Kemp) and their common nemesis Dan Sullivan (Craig Fairbrass); becoming the surrogate father of godson Jamie (Jack Ryder); establishing a companionship with Jamie's estranged uncle Billy (Perry Fenwick); clashing with love rival Mark Fowler (Todd Carty) over Louise's parentage; harbouring resentment against Mark's younger brother Martin Fowler (James Alexandrou) for accidentally killing Jamie in a car accident; teaming up with Sharon's adoptive brother Dennis Rickman (Nigel Harman) to eliminate their crime boss Jack Dalton (Hywel Bennett) and then cover up the latter's murder; marrying policewoman Kate Morton (Jill Halfpenny) after saving her from Dalton's earlier arrangement to have her killed; crossing paths with Kate's superior DCI Jill Marsden (Sophie Stanton) when she occasionally tries to bring him to justice; being set-up for armed robbery by Sharon and Dennis' illegitimate father Den Watts (Leslie Grantham); helping exonerate Sam for Den's murder after the latter's spouse and killer Chrissie (Tracy-Ann Oberman) frames her for the crime; waging a conflict against Peggy's gangland enemy Johnny Allen (Billy Murray) that culminated in Get Johnny Week; discovering at his wedding to Stella Crawford (Sophie Thompson) that she had been abusing Ben during their relationship; becoming a prime suspect in the murder of his uncle Archie (Larry Lamb); setting fire to The Queen Victoria public house in light of his addiction to crack cocaine; getting shot by ex-lover Shirley Carter (Linda Henry) on the day of his wedding to Sharon; rescuing his two cousins Ronnie (Samantha Womack) and Roxy (Rita Simons) from being murdered by their notorious adversary Nick Cotton (John Altman); framing ex-business partner Max Branning (Jake Wood) for the murder of Ian's daughter Lucy (Hetti Bywater) in the aftermath of her killer being revealed to be Lucy's younger brother Bobby (Eliot Carrington); coping with Peggy's death after she commits suicide to end her cancer endurance; having a child with Denise Fox (Diane Parish); getting hospitalized by Martin's wife Stacey Fowler (Lacey Turner) after threatening to extort money from her closest relative Kat (Jessie Wallace); ending his prolonged marriage to Sharon upon discovering that she had been sleeping with Louise's boyfriend, Keanu Taylor (Danny Walters) and that he is not responsible for her pregnancy as a result of their hidden romance; and being partly responsible for the death of Sharon's son Denny (Harry Hickles/Bleu Landau) after his confrontation with Keanu over the affair had instigated a boat accident that resulted in the younger's death. On 25 December 2020, Phil was later revealed to be the assailant who attacked Ian in the storyline \"Who Attacked Ian Beale?\"", "Following Danielle's funeral, Peggy asks Phil to kill Archie so they could get justice for Danielle and Ronnie. He obliges and has Archie kidnapped, but lets him go after threatening him to stay away from Walford. However, Archie later returns to the square and ignores Phil's constant demands that he leave Walford again. As Christmas approaches in December 2009, Phil and Peggy are horrified to learn that Archie has extorted the pub from them after he formed a relationship with Janine and the two conspired to have Ian collaborate with them – particularly when Phil gave Ian a loan and gets beaten up as a result of not being able to pay it back. This could have been a motive for both Phil and Peggy, along with their family, when Archie is later murdered on Christmas night. Afterwards, Phil is surprised when DCI Jill Marsden (Sophie Stanton) takes charge of the murder investigation; as Phil and Marsden became sworn enemies ever since she investigated his shooting – before going on to intercept Phil's criminal activities prior to him being set up for the robbery. During the investigation, Phil clashes with Janine as they both plan to retake various properties from the square. However, it is later revealed that Archie's killer was in fact his rape victim Stacey Slater (Lacey Turner); this was discovered just moments after her husband Bradley (Charlie Clements) fell to his death whilst on the run from the police, which Phil had witnessed in the midst of celebrating Ricky and Bianca's second wedding."]}, {"page": "Zoe Slater", "response": ["In 2015, Kat reveals that Zoe has moved to Spain and announces to Mo and Stacey Slater (Lacey Turner) that she will start saving up to visit Zoe. However, Mo tells Stacey that Zoe does not want to see Kat. Mo attempts to contact Zoe to get her to reconsider, but Kat finds out two days later from a text from Zoe that she cannot see her because of her new job and boyfriend and she feels she needs to move on with her life. In May 2015, Kat visits the convent where she give birth to Zoe and it is revealed to the viewers that Kat had twins – meaning Zoe has a twin brother. Kat moves to Spain and visits Zoe, who rejects her mother, leaving Kat devastated. Kat also reveals that Zoe is now engaged."]}, {"page": "Janine Butcher", "response": ["The character has been described as a \"super-bitch\" and a \"classic villainess\". She has proven popular with critics and fans of the show. Her storylines typically involve her in an antagonistic role. She has been married four times to Barry Evans (Shaun Williamson) whom she killed on New Year’s Day 2004, David (Harry Towb), Ryan Malloy (Neil McDermott) and Michael Moon (Steve John Shepherd). Her feuds include a long-standing conflict with stepmother Pat Butcher (Pam St Clement), Sonia Jackson (Natalie Cassidy), Lynne Slater (Elaine Lordan), Laura Beale (Hannah Waterman), Peggy Mitchell (Barbara Windsor), Stacey Slater (Lacey Turner) and Kat Slater (Jessie Wallace). Her initial departure saw Janine being wrongfully charged for the death of Laura Beale. Upon her return, Janine is caught forging a wedding that ends with the her new husband abruptly dying of a fatal heart attack. She later accidentally kills local resident Danielle Jones (Lauren Crace) in a hit-and-run car drive; conspires with Peggy's husband Archie (Larry Lamb) to defraud the Mitchell family from their ownership of The Queen Victoria public house; becomes a prime suspect in Archie's murder investigation before attempting to kill her third husband Ryan by poisoning him. She later gives birth to a daughter Scarlett with fourth husband Michael before eventually killing him - leading to her third departure from the show. ", "In need of money, Janine teams up with Ronnie's father Archie Mitchell (Larry Lamb); they make plans to ruin the Mitchell family by taking The Queen Vic from them. When they manipulate Archie's niece Sam Mitchell (Danniella Westbrook) into breaking her bail terms, the Mitchells lose bail surety and face financial ruin. Ian provides the Mitchells with a loan, on condition they use their pub as collateral. Janine has sex with Ian, recording the tryst, then blackmails him, threatening to show his wife Jane Beale (Laurie Brett) unless he sells the Mitchell loan to Archie. Archie subsequently takes control of The Queen Vic when the Mitchells are unable to meet the terms of the loan. Meanwhile, Janine and her flatmate Ryan Malloy (Neil McDermott), with whom Janine is having sex, plan to fleece Archie. He and Janine announce their engagement, but on Christmas Day, Archie – who has realised Janine is intending to con him – throws her onto the street, leaving her distraught. That same day, Archie is murdered by an unknown assailant (see Who Killed Archie?). Janine becomes a suspect for his murder, though she denies it and feigns distress over Archie's death. While she attempts to frame Ian and the Mitchells for the murder, Peggy attempts to frame her, planting evidence in her flat, which leads to an arrest but no charge. In the end, Janine is cleared and fellow resident Bradley Branning (Charlie Clements) is held falsely responsible for the murder - although, unknown to everyone, Archie's killer was in fact Bradley's wife Stacey (Lacey Turner) - whom he had previously raped amid his conspiracy with Janine.", "In December 2009, the show's executive producer, Diederick Santer teased about upcoming storylines involving Janine and her flatmate Ryan Malloy (Neil McDermott), saying: \"There's something really interesting with Ryan and Janine [...]. They're both people who don't know how to love. So will they fall in love? And if they do, can they cope with it? Will they understand the alien feelings coursing through their bodies?\" In August 2010, Janine proposes to Ryan. Brooks said that the idea of getting married would be daunting for the character, but added that she believes Janine is genuinely in love with Ryan. She commented: \"It's easy to assume that Janine is playing games or using him for sex, but [...] Ryan clearly adores her too, so he may be the man to tame her wild ways.\" Brooks hinted at possible trouble for the couple if Janine discovers that Ryan fathered a baby with Stacey Branning (Lacey Turner), saying \"Janine will be absolutely destroyed when she finds out. She wants Ryan all to herself, and the idea of a baby snatching his attention away would be devastating. All she needs is to be loved.\" McDermott stated that he believed Ryan was the right man for Janine, and that they could be perfect for each other, saying: \"Janine's never loved any of the men she's been with before. She has only ever been in it for the money. Ryan understands her and knows why she does the things she does. They both forgive one another's mistakes very easily, and that's why their partnership works.\"", "In February 2012, Brooks announced that she would take a six-month break from the show later in the year, and departed on 14 September. Brooks returned to filming on 21 February 2013  and returned on screen on 18 April that year.   On 28 October 2013, it was announced that Brooks had decided to leave the show for a third time, but to allow for her to return again, the character would not be killed off. Following Janine's arrest on Christmas Day, she returned to screens on 24 February 2014 when Kat Moon (Jessie Wallace) and Stacey Branning (Lacey Turner) visited her in prison, and last appeared on 20 March 2014."]}, {"page": "EastEnders theme tune", "response": ["| 38 || 9 December 2005 || Stacey Slater (Lacey Turner) returns to Walford after her mother Jean Slater's (Gillian Wright) attempted suicide. She looks at a picture of her brother Sean Slater and breaks down.", "| 46 || 23 June 2010 || Stacey Slater (Lacey Turner) holds her baby daughter Lily after giving birth in hospital.", "| 48 ||  || Stacey Slater (Lacey Turner) flees the country with her baby daughter Lily Branning. The credits roll over the ending shot of Stacey's view from the plane."]}, {"page": "Johnny Allen (EastEnders)", "response": ["The character's story arc began with Johnny usurping fellow mob boss Andy Hunter (Michael Higgs) from his position as the square's reigning crime kingpin, which ultimately leads Andy to try and swindle £750,000 from Johnny in his requested \"job\"; however, this fails after Johnny intercepts his plan — thanks to Andy's bodyguard Eddie (Daren Elliott Holmes) — and he ends up killing Andy by throwing him off a motorway bridge during the show's 20th anniversary episode. Soon afterwards, Johnny proceeded to force the local Ferreira family out of Walford before going on to establish an unlikely friendship with his old acquaintance Pat Harris (Pam St Clement); exile his errand boy Danny Moon (Jake Maskall) from the square in retribution for Danny burning down his house; become enemies with Phil and Grant's mother, Peggy (Barbara Windsor), after she turns his daughter Ruby (Louisa Lytton) against him; destroy his own relationship with former mistress Tina Stewart (Charlotte Avery); hire Peggy's nephew Billy (Perry Fenwick) to become Danny's replacement until he later fires him for conspiring with his family; develop a conflict with Ruby's best-friend, Stacey Slater (Lacey Turner), over the way how their rebellious friendship strains his daughter's education; blackmail Danny's brother Jake (Joel Beckett) with the discovery that his girlfriend Chrissie Watts (Tracy-Ann Oberman) murdered her estranged husband Den (Leslie Grantham) and framed Peggy's daughter Sam (Kim Medcalf) for the crime; constantly torment Ruby's boyfriend Juley Smith (Joseph Kpobie) upon learning that he is the reason she lost her virginity to him; and arrange for popular hardman Dennis Rickman (Nigel Harman) to be fatally stabbed on New Year's Eve 2005 after being attacked by the latter in retaliation for threatening his adoptive sister-turned-recent wife Sharon (Letitia Dean).", "Johnny's feud with Peggy continues as she appears to turn his daughter against him, up to the point where Ruby confides to her best friend Stacey Slater (Lacey Turner) about this, and the pair later inform Tina about his behavior. Johnny soon attempts to warn Peggy off by slamming the door on her fingers and later threatening her, but only succeeds in drifting Ruby further away from him — up to the point where Peggy allows Ruby to visit and even stay at her house. Incensed, Johnny arranges for Peggy to be mugged, and summons his enforcer Sean to carry out the task. When Tina learns about this, she quickly warns by Peggy by phoning from her house. Peggy takes Tina's warning seriously and leaves the house, but Sean catches up with her near the bushes. She is nearly attacked, until Billy arrives with her two sons Phil (Steve McFadden) and Grant (Ross Kemp), who rescue their mother by knocking out Sean. The Mitchell brothers learn that Johnny organized the mugging, and plan to confront him despite Peggy's reservations, up to the point where she and Billy explain the impact of his gangland reign upon the square. Phil and Grant confront Johnny at his nightclub anyway, and they warn him to stay away from Peggy, but Johnny is unfazed by their threats and declares war on the Mitchell family; he later fires Billy, after finding out that he conspired with Peggy and her sons against him. Johnny soon discovers that Tina sabotaged his plan, and retaliates by sleeping with Amy. When Ruby discovers this, she informs Tina and the latter promptly confronts Johnny — which consequently leads to her ending their relationship and leaving Walford for good."]}, {"page": "Mickey Miller", "response": ["Mickey is first seen in Walford in 2003, selling dodgy goods to Spencer Moon (Christopher Parker) and he is later involved in similar money-making scams with fellow wheeler-dealer, Mo Harris (Laila Morse). To earn extra money, he works as a builder and sells trinkets on Bridge Street market, aided by his business partner, Juley Smith (Joseph Kpobie). Mickey begins a relationship with Kareena Ferreira (Pooja Shah) in 2004. Mickey falls for Kareena, but he is incensed in 2005 when he discovers that she has been using cocaine, supplied by Juley. When Kareena sees Stacey Slater (Lacey Turner) attempting to seduce Mickey, she turns to Juley for comfort, and a fight breaks out when Mickey catches Juley attempting to kiss her. Mickey and Kareena manage to work through their problems, but shortly after Kareena leaves Walford with the rest of her family, despite previously promising Mickey that she will stay with him."]}, {"page": "Demi Miller", "response": ["Lacey Turner also auditioned for the role of Demi before being cast as Stacey Slater."]}, {"page": "Dean Wicks", "response": ["When Deano arrives in Walford in 2006, he persuades his great aunt Pat Evans (Pam St Clement) to take him in and is soon joined by his stepfather Kevin Wicks (Phil Daniels) and sister Carly (Kellie Shirley). Deano causes trouble by spiking Stacey Slater's (Lacey Turner) alcohol with drugs and allowing Bradley Branning (Charlie Clements) to take the blame, stealing The Queen Victoria public house's bust and driving recklessly, crashing a car – behaviour prompted by the anniversary of his brother Jimbo's (Lloyd Richards) death. Deano is unwittingly reunited with his estranged mother, Shirley Carter (Linda Henry), during a family holiday in Dorset. Despite Kevin's efforts to stop her, Shirley makes herself known to Deano and Carly and eventually reveals that she is their mother. Deano struggles with this and after seeing Shirley behave promiscuously, he behaves recklessly and crashes a car at high-speed injuring himself, his passenger Chelsea Fox (Tiana Benjamin) and a pedestrian, Abi Branning (Lorna Fitzgerald). Deano nearly dies from his injuries but bonds with Shirley during his recovery. Kevin is opposed to this and during many arguments, the truth about Deano and Carly's paternity is revealed by Shirley: Kevin is not their biological father. Deano is devastated and threatens suicide by almost setting himself on fire but is stopped before going through with it."]}, {"page": "Jane Beale", "response": ["By May 2017, Jane is able to stand up and has crutches but still uses the wheelchair. In September, Jane discovers Steven's lie about his brain tumour, Steven's affair with Abi and Max's revenge plan. As Jane confronts Max, a gas explosion destroys Walford in Bloom. Max leaves Jane at restaurant, but, Jane having told Max she knows his scheme, he orders Steven to kill Jane. Steven arrives and confronts Jane. Jane tries to talk Steven round but he is disbelieving about Abi expecting his child. Steven turns increasingly nasty on Jane, leaving her helpless on the floor and goes through with setting fire to Beales. Later Steven has a change of heart and refuses to kill Jane. Max violently shoves Steven to a corner of a kitchen counter leaving him badly injured. Max confronts Jane about his revenge on all Walford residents. Jane pleads with Max not to go through with his plans, however he proceeds to take the fire blanket, leaving Jane to burn to death. Jane survives and is taken to hospital, although Steven later dies from his injuries. Jane is left in a coma for several weeks afterwards, and upon waking up she is threatened by Max to stay quiet. Max eventually orders her to leave Walford, and although she and Ian make plans to leave, Max later orders her to leave alone, threatening Bobby if she doesn't comply. Jane says her goodbye but couldn't tell anybody about Max because he was watching her move every time. Jane leaves Walford in a taxi, leaving Ian a voicemail telling him she will ring him later. When she doesn't phone, Ian fears that she is missing, but is talked out of reporting it by Max, who then leaves her another message warning her to not contact Ian again. In a last attempt to oust Max, Jane sends a voicemail to her friend Stacey Fowler (Lacey Turner) warning her about Max, unaware that her phone is now in the possession of Bernadette Taylor (Clair Norris) after her younger brother Riley Taylor (Tom Jacobs) impulsively stole it for her. Riley and his brother Chatham Taylor (Alfie Jacobs) later listen to a different voicemail from Jane, which begs Stacey not to repeat the details of her first voicemail to anyone."]}]}}