{"wiki_id": "http://www.wikidata.org/entity/Q435537", "itemLabel": "William Darwin Fox", "itemDescription": "British naturalist, geologist, entomologist (1805–1880)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Darwin_Fox", "wikipedia_page": {"main": "The Reverend William Darwin Fox (23 April 1805 – 8 April 1880) was an English clergyman, naturalist, and a second cousin of Charles Darwin.", "link_mentions": [{"page": "Sandown", "response": ["* William Darwin Fox, naturalist-clergyman, second cousin of Charles Darwin buried in Sandown."]}, {"page": "Ground beetle", "response": ["Especially in the 19th century and to a lesser extent today, their large size and conspicuous coloration, as well as the odd morphology of some (e.g. the Lebiini), made many ground beetles a popular object of collection and study for professional and amateur coleopterologists. High prices were paid for rare and exotic specimens, and in the early to mid-19th century, a veritable \"beetle craze\" occurred in England. As mentioned above, Charles Darwin was an ardent collector of beetles when he was about 20 years old, to the extent that he would rather scour the countryside for rare specimens with William Darwin Fox, John Stevens Henslow, and Henry Thompson than to study theology as his father wanted him to do. In his autobiography, he fondly recalled his experiences with Licinus and Panagaeus, and wrote:"]}, {"page": "William Fox", "response": ["* William Darwin Fox (1805–1880), English clergyman and amateur scientist"]}, {"page": "Aston-on-Trent", "response": ["General Sir Drury-Lowe was born here and William Darwin Fox was born nearby. Edward Holden, Joseph Greaves and James Sutton were High Sheriffs of Derbyshire. See also below for three England footballers."]}, {"page": "Darwin–Wedgwood family", "response": ["rect 311 301 510 350 William Darwin Fox", "rect 360 491 462 541 William Darwin Fox had 16 children", "====William Darwin Fox====", "The Rev. William Darwin Fox (1805–1880) was a second cousin of Charles Darwin and an amateur entomologist, naturalist and palaeontologist. Fox became a lifelong friend of Charles Darwin after their first meeting at Christ's College, Cambridge. He married Harriet Fletcher, who gave him five children, and after her death married Ellen Sophia Woodd, who provided the remainder of his 17 children."]}, {"page": "Development of Darwin's theory", "response": ["By September 1854 his second volume of Barnacles had been printed and dispatched, and he turned his attention to Species, telling his cousin William Darwin Fox that he planned to \"view all facts that I can master..to see how far they favour or are opposed to the notion that wild species are mutable or immutable\". All available information was examined for \"hostile facts\" and discussed with Hooker, who had resisted what he called Darwin's \"Elastic theory\" but who was now developing an \"utter disbelief of my own Genera and species\"."]}, {"page": "Publication of Darwin's theory", "response": ["Variation under domestication became a major topic of research: in 1855 he began to develop a web of contacts, both in the UK and worldwide, to get information on the origins and variation of domesticated animals, particularly poultry, ducks, rabbits, and pigeons. He got extensive information, specimens and ideas from Edward Blyth in India, who put him in contact with Edgar Leopold Layard in South Africa. At the suggestion of William Yarrell, Darwin began pigeon breeding at Down House to investigate varieties of domestic pigeons, and gained access to the expertise of William Bernhard Tegetmeier who was glad to research aspects of interest to Darwin. From March, he also got information and specimens from his relative William Darwin Fox who bred poultry and ducks at his rectory in the parish of Delamere, Cheshire.", "Darwin's cousin William Darwin Fox continued to give hims strong support, warning him against overworking on his huge book and recommending a holiday, but Darwin was immersed in his experiments and his writing. \"I am got most deeply interested in my subject; though I wish I could set less value on the bauble fame, either present or posthumous, than I do, but not, I think, to any extreme degree; yet, if I know myself, I would work just as hard, though with less gusto, if I knew that my Book wd be published for ever anonymously\"."]}, {"page": "Valdosaurus", "response": ["In the nineteenth century Reverend William Darwin Fox collected two small thighbones near Cowleaze Chine on the southwest coast of the Isle of Wight. In 1868 he incorrectly suggested these may have come from the same individual that had in 1848 been uncovered for Gideon Mantell as a fossil of Iguanodon, and which in 1869 would be named as the new genus Hypsilophodon. Regardless, both femora, made part of the collection of the British Museum of Natural History as specimens BMNH R184 and BMNH R185, would be commonly referred to the latter genus."]}, {"page": "Inception of Darwin's theory", "response": ["Darwin's cousin William Darwin Fox gave helpful answers to his questions about crossing domestic breeds, and in his reply of 15 June, Darwin admitted for the first time that \"It is my prime hobby & I really think some day, I shall be able to do something on that most intricate subject species & varieties.\"", "Illness prompted Darwin to take a break from the pressure of work: on 15 June he told his cousin William Darwin Fox; \"I have not been very well of late, which has suddenly determined me to leave London earlier than I had anticipated. I go by the steam-packet to Edinburgh. – take a solitary walk on Salisbury crags & call up old thoughts of former times then go on to Glasgow & the great valley of Inverness, – near which I intend stopping a week to geologise the parallel roads of Glen Roy, – thence to Shrewsbury, Maer for one day, & London for smoke, ill health & hard work.\" On 23 June 1838 he took the steamboat to Edinburgh to go \"geologising\" in Scotland. After revisiting Edinburgh on 28 June (the day that Queen Victoria had her coronation in London) he went on to Fort William. At Glen Roy in glorious weather he was convinced that he had solved the riddle of the \"parallel roads\" around the glen, which he identified as raised beaches, though later geologists would support the ideas of Louis Agassiz that these had been formed by glaciation."]}, {"page": "The Life and Letters of Charles Darwin", "response": ["*  William Darwin Fox (cousin)"]}, {"page": "Charles Darwin's education", "response": ["Arriving at the University of Cambridge in January 1828, Darwin found this elite theological training institution governed by complex rules much more congenial than his experiences at Edinburgh. No rooms were available at Christ's College, so he took lodgings above a tobacconists in Sidney Street, across the road.  Extramural activities were important, and while Darwin did not take up sports or debating, his interests included music and his main passion was the current national craze for the (competitive) collecting of beetles. Trainee clergymen scoured Cambridgeshire for specimens, referring to An Introduction to Entomology by William Kirby and William Spence. Charles joined his older cousin William Darwin Fox who was already a skilled collector and like him got a small dog. The two and their dogs became inseparable.  They explored the countryside as Darwin learnt about natural history from his cousin. Darwin became obsessed with winning the student accolade and collected avidly. Once he stripped bark from a dead tree and caught a ground beetle in each hand, then saw the rare Crucifix Ground Beetle,  Panagaeus cruxmajor. With the habits of an egg-collector, he popped one ground beetle in his mouth to free his hand, but it ejected some intensely acrid fluid which burnt his tongue and Darwin was forced to spit it out. He lost all three. describes the incident and states that the insect Darwin popped into his mouth was a bombardier beetle.*They cite Darwin's correspondence and his Autobiography ()* quotes the Autobiography, and while its illustration shows a bombardier beetle, it says \"Many beetles, including the Brachinus crepitans and the Stenaptinus insignis, release irritating chemicals as a defense.\"*Letter 1009 – Darwin, C. R. to Jenyns, Leonard, 17 Oct (1846) describes the two beetles as unidentified carabi, or ground beetles.* The specimens he did not lose had to be mounted and identified, and his knowledge from Edinburgh of Lamarck proved useful. Fox introduced him for advice on identification to the Revd. John Stevens Henslow, professor of botany, and Darwin began attending his soirées, a club for budding naturalists. Here he could meet other professors including the geologist the Revd. Adam Sedgwick and the new mineralogist the Revd. William Whewell.", "Darwin now had breakfast every day with his older cousin William Darwin Fox. This was Fox's last term before his BA exam, and he now had to cram desperately to make up for lost time. At the Christmas holiday Charles visited London with Eras, toured the scientific institutions \"where Naturalists are gregarious\" and through his friend the Revd. Frederick William Hope met other insect collectors. These included James Stephens, author of Illustrations of British Entomology."]}, {"page": "William Fox (palaeontologist)", "response": ["==Confusion with William Darwin Fox==", "There is considerable confusion between Fox and his more celebrated contemporary the similarly named Rev. William Darwin Fox (23 April 1805 - 8 April 1880)The Proceedings of the Isle of Wight Natural History and Archaeological Society, Vol 24, p.20 \"The Isle of Wight and WDF's Sons\" by Bingham and Crombie who was also an amateur scientist and lived and worked on the Isle of Wight at the same time. William Darwin Fox is sometimes ascribed the credit for early dinosaur discoveries. However William Darwin Fox was noted for his geological work, and entomology, but is not recorded as having any particular interest in dinosaurs."]}, {"page": "William Fox (paleontologist)", "response": ["#REDIRECT William Darwin Fox"]}, {"page": "Epperstone", "response": ["*William Darwin Fox, naturalist, cleric and man of letters, was curate of Epperstone Church in 1829–38."]}, {"page": "Thecocoelurus", "response": ["Thecocoelurus is known only from half of a single cervical vertebra, discovered by the Rev. William Darwin Fox on the Isle of Wight during the 19th century. After his death the Fox Collection was acquired by the British Museum of Natural History. William Davies was the first to notice the specimen and assumed a close affinity with Coelurus."]}, {"page": "Cardale Babington", "response": ["Babington was the son of Joseph Babington and Cathérine née Whitter, and a nephew of Thomas Babington Macaulay. He was educated at CharterhouseDarby, Michael. A Biographical Dictionary of British Coleopterists. http://www.coleopterist.org.uk/biogdict-intro.htm  and St John's College, Cambridge, obtaining his Bachelor of Arts in 1830 and his Master of Arts in 1833. He overlapped at Cambridge with Charles Darwin, and in 1829 they argued over who should have the pick of beetle specimens from a local dealer.Charles Darwin to William Darwin Fox, 1 April [1829], Darwin Correspondence Project, \"Letter no. 60\", accessed on 19 August 2020."]}, {"page": "Elvaston, Derbyshire", "response": ["* William Darwin Fox, introduced his second cousin Charles Darwin to the study of insects, was born near here in 1805"]}, {"page": "Charles Darwin", "response": ["Darwin's neglect of medical studies annoyed his father, who shrewdly sent him to Christ's College, Cambridge, to study for a Bachelor of Arts degree as the first step towards becoming an Anglican country parson. As Darwin was unqualified for the Tripos, he joined the ordinary degree course in January 1828. He preferred riding and shooting to studying. During the first few months of Darwin's enrollment, his second cousin William Darwin Fox was also studying at Christ's College. Fox impressed him with his butterfly collection, introducing Darwin to entomology and influencing him to pursue beetle collecting. "]}, {"page": "Parson-naturalist", "response": ["The 19th century witnessed the wide proliferation of the tradition, which continued into the 20th century. Among the 19th century parson-naturalists were for instance John Stevens Henslow (1796–1861), Leonard Jenyns (1800–1893), William Darwin Fox (1805–1880), Charles William Benson (1836–1919) and Francis Linley Blathwayt (1875–1953)."]}, {"page": "Geoffrey S. Dawes", "response": ["Dawes was born in 1918 in Mackworth which is within Derbyshire, but he was brought up in Elvaston where his father was the vicar of Elvaston and Thulston. He had four siblings who were all older than he was. Dawes lived at Thurleston Hall, the vicarage for Elvaston. This hall had previously been the home of William Darwin Fox. His prep school was in the next village of Shardlow, where he studied until he started at Repton School which was still within south Derbyshire. This association with Repton continued as later he would become both a member and later chair of their governors."]}, {"page": "Baron Dickinson Webster", "response": ["* secondly, in 1850, to Anna Maria Bristowe (1826-1862) daughter of Samuel Ellis Bristowe (1800-1855) JP DL and Mary Anne née Fox and brother of Samuel Boteler Bristowe (1822-1897) QC. They had two sons: Baron Dickinson Webster (1850-1930) who married Ellen Elizabeth Fox (1852-1923), a daughter of William Darwin Fox; and Lt Col Godfrey Fox Webster (1852-1933)."]}, {"page": "Christ Church, Sandown", "response": ["Christ Church, Sandown is a parish church in the Church of England located in Sandown, Isle of Wight. Rev. William Darwin Fox, naturalist-clergyman, second cousin of Charles Darwin, is buried in the graveyard, with most of his large family."]}, {"page": "Osmaston Hall", "response": ["It was the home to William Darwin Fox who was a second cousin and close friend of Charles Darwin, who stayed at the hall. The Fox family were renting the house from the owner Sir Robert Wilmot, Bart.Letters from Osmaston, Darwin Project, accessed 15 December 2008"]}, {"page": "Fox (surname)", "response": ["* William Darwin Fox (1805–1880), English clergyman, naturalist, and cousin of Charles Darwin"]}, {"page": "Samuel Fox", "response": ["* Samuel Fox (1765–1851), Derby Justice of the peace; father of William Darwin Fox"]}]}}