{"wiki_id": "http://www.wikidata.org/entity/Q4355195", "itemLabel": "Annie Speirs", "itemDescription": "British swimmer, Olympic gold medallist, former world record-holder", "wikipedia_url": "https://en.wikipedia.org/wiki/Annie_Speirs", "wikipedia_page": {"main": "Annie Coupe Speirs (14 July 1889 – 26 October 1926), also known by her married name Annie Coombe, was a British competition swimmer who won a gold medal in the women's 4×100-metre freestyle relay at the 1912 Summer Olympics in Stockholm, Sweden.  Individually, she finished fifth in the women's 100-metre freestyle event.", "link_mentions": [{"page": "Swimming at the 1912 Summer Olympics", "response": ["| Belle MooreJennie FletcherAnnie SpeirsIrene Steer"]}, {"page": "List of Olympic medalists in swimming (women)", "response": ["|valign=top|Belle MooreJennie FletcherAnnie SpeirsIrene Steer"]}, {"page": "Great Britain at the 1912 Summer Olympics", "response": ["| , Belle Moore,Annie Speirs, Irene Steer || Swimming", "| Annie Speirs", "| Jennie Fletcher  Belle Moore  Annie Speirs  Irene Steer"]}, {"page": "Belle Moore", "response": ["At the 1912 Summer Olympics in Stockholm, Sweden, Moore won a gold medal as a member of the first-place British women's team in the 4×100-metre freestyle relay, together with teammates Jennie Fletcher, Annie Speirs and Irene Steer.Sports-Reference.com, Olympic Sports, Athletes,  Isabella Moore.  Retrieved 2 June 2015.Maggie Barry, ' Forgotten Olympic Golden Girl Belle Moore Remembered 100 Years After Landmark Win\", Daily Record (29 April 2012).  Retrieved 2 June 2015.  The British women set a new world record in the event of 5:52.8, beating the German and Austrian women's relay teams by a wide margin.Sports-Reference.com, Olympic Sports, Swimming at the 1912 Stockholm Summer Games,  Women's 4 × 100 metres Freestyle Relay .  Retrieved 2 June 2015.  Swedish King Gustav V presented Moore and her teammates with their gold medals and Olympic laurels.International Swimming Hall of Fame, Honourees,  Belle Moore (GBR).  Retrieved 2 June 2015."]}]}}