{"wiki_id": "http://www.wikidata.org/entity/Q4351694", "itemLabel": "Rosalind Hicks", "itemDescription": "Agatha Christie's daughter", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosalind_Hicks", "wikipedia_page": {"main": "Rosalind Margaret Clarissa Hicks (formerly Prichard, née Christie; 5 August 1919 – 28 October 2004) was the only child of author Agatha Christie.", "link_mentions": [{"page": "Agatha Christie", "response": ["Christie was unhappy about becoming \"an employed wage slave\", and for tax reasons set up a private company in 1955, Agatha Christie Limited, to hold the rights to her works. In about 1959 she transferred her 278-acre home, Greenway Estate, to her daughter, Rosalind Hicks.\"Obituary: Rosalind Hicks\" , The Daily Telegraph, 13 November 2004. Retrieved 25 January 2015. In 1968, when Christie was almost 80, she sold a 51% stake in Agatha Christie Limited (and the works it owned) to Booker Books (better known as Booker Author's Division), which by 1977 had increased its stake to 64%. Agatha Christie Limited still owns the worldwide rights for more than 80 of Christie's novels and short stories, 19 plays, and nearly 40 TV films."]}, {"page": "Hercule Poirot", "response": ["Christie's daughter Rosalind Hicks observed Ustinov during a rehearsal and said, \"That's not Poirot! He isn't at all like that!\" Ustinov overheard and remarked \"He is now!\""]}, {"page": "August 5", "response": ["*1919 – Rosalind Hicks, British literary guardian and the only child of author, Agatha Christie (d. 2004)"]}, {"page": "1943", "response": ["**Mathew Prichard, British philanthropist, the only child of literary guardian Rosalind Hicks and the only grandchild of author Agatha Christie "]}, {"page": "Agatha Christie's Poirot", "response": ["During the filming of the first series, Suchet almost left the production during an argument with a director, insisting that Poirot's odd mannerisms (in this case, putting a handkerchief down before sitting on a park bench) be featured;(29 October 2013). \"David Suchet reveals he almost quit Poirot during the first series after an argument over a hanky\" . Mirror.co.uk. he later said \"there's no question [Poirot's] obsessive-compulsive\". According to many critics and enthusiasts, Suchet's characterisation is considered to be the most accurate interpretation of all the actors who have played Poirot, and the closest to the character in the books. In 2013, Suchet revealed that Christie's daughter Rosalind Hicks had told him she was sure Christie would have approved of his performance.\"Curtain: Press Packet\" . ITVStatic.com.", "Suchet visited the Greenway Estate, Agatha Christie's summer home, recollecting how he met her daughter Rosalind Hicks and her husband Anthony Hicks for their approval before he began filming. He now meets Christie's grandson Mathew Prichard who recounts how his grandmother found the character amongst Belgian refugees in Torquay. A visit to the permanent Poirot exhibition at Torquay Museum to which he presented the cane he used in the television series."]}, {"page": "Sleeping Murder", "response": ["Christie refers to the last Poirot and Miss Marple novels that she penned during the Second World War in her autobiography. She writes that she had written an extra two books during the first years of the war in anticipation of being killed in the raids, as she was working in London. One was for her daughter, Rosalind Hicks, which she wrote first – a book with Hercule Poirot in it – and the other was for Max – with Miss Marple in it. She adds that these two books, after being composed, were put in the vaults of a bank, and were made over formally by deed of gift to her daughter and husband."]}, {"page": "Rosalind", "response": ["*Rosalind Hicks (1919–2005), British literary guardian and only child of Agatha Christie"]}, {"page": "Greenway Estate", "response": ["The house was occupied by Christie and Mallowan until their deaths in 1976 and 1978 respectively, and featured, under various guises, in several of Christie's novels. Christie's daughter Rosalind Hicks and her husband Anthony lived in the house from 1968 until Rosalind's death in 2004."]}, {"page": "Colwinston", "response": ["Colonel Hubert Cecil Prichard came to live at Pwllywrach after the First World War. His son Hubert de Burgh Prichard famously married Rosalind Hicks, the only daughter of Agatha Christie, their son Mathew Prichard being given the proceeds from the royalties of The Mousetrap. He subsequently used the substantial sums from the play to establish the Colwinston Charitable Trust in 1995."]}, {"page": "Benenden School", "response": ["*Rosalind Hicks, British literary guardian and only child of Agatha Christie"]}, {"page": "The Murder at the Vicarage", "response": ["The subject of this dedication is Christie's daughter, Rosalind Hicks (1919–2004) who was the daughter of her first marriage to Archibald Christie (1890–1962) and Agatha Christie's only child. Rosalind was eleven years of age at the time of the publication of this book."]}, {"page": "Why Didn't They Ask Evans?", "response": ["After Christie's death in 1976, her estate, principally managed by her daughter Rosalind Hicks, relaxed this ruling and Why Didn't They Ask Evans was the first major production that resulted. Evans attracted large audiences and satisfactory reviews, but more importantly, it demonstrated to television executives that Christie's work could be successful for the small screen given the right budgets, stars and attention to detail – Agatha Christie's Partners in Crime, Miss Marple with Joan Hickson (who had a minor role in Evans), Agatha Christie's Poirot with David Suchet and Marple with Geraldine McEwan, until her retirement, and then with Julia Mackenzie, can all trace their style and successes back to this 1980 adaptation."]}, {"page": "Towards Zero", "response": ["In 1995, a film adaptation lost its support from Agatha Christie's estate. When Rosalind Hicks, Christie's daughter and controller of her estate, reviewed the script, with such issues as incest in the script, she ordered that the name of the film be changed as well as the names of the characters. The film became Innocent Lies and was met with mediocre success."]}, {"page": "A Daughter's a Daughter", "response": ["Following Christie's death, the copyright for the play was owned by her daughter, Rosalind Hicks, who was unenthusiastic about the play as it was believed that the main character was based on her. Following Hicks' death in 2004, a new production of the play, starring Jenny Seagrove and Honeysuckle Weeks and produced by Bill Kenwright, was to open in London's West End on 14 December 2009. Kenwright described the play as \"brutal and incredibly honest\" and \"It's a good enough play to stand up without the Christie brand. It's quite a tough play. It is a substantial night at the theatre.\""]}, {"page": "Fiddlers Three (play)", "response": ["Christie pushed for the play to be performed, much against the wishes of her daughter, Rosalind Hicks, who was protective of her mother's reputation and felt that this production would damage it. The revised version of the play incorporated several suggestions from its director, Allan Davis, who had seen the previous 1971 version.Morgan, Janet. Agatha Christie, A Biography. (Page 369) Collins, 1984 "]}, {"page": "James Watts (British politician)", "response": ["In April 1930, newspapers announced his engagement to Lady Rosemary Wilma Bootle-Wilbraham, daughter of the 2nd Earl of Lathom; the ceremony was scheduled for June in Westminster Cathedral, and Jack's cousin Rosalind Hicks was to be among the child attendants. Less than three weeks before the wedding, however, the engagement was broken off, and later that summer Lady Rosemary married another man. Jack never married."]}, {"page": "September 1943", "response": ["** Mathew Prichard, British philanthropist, the only child of literary guardian Rosalind Hicks and the only grandchild of author Agatha Christie"]}, {"page": "Hicks", "response": ["* Rosalind Hicks, British literary guardian and the only child of author, Agatha Christie"]}, {"page": "The Hollow (play)", "response": ["Christie had always felt that The Hollow would make a good play, but she came up against the opposition of her daughter, Rosalind Hicks, whom Christie affectionately described as having \"had the valuable role in life of eternally trying to discourage me without success\".  Christie was determined to turn the book, which both she and Rosalind liked, into a play, but was equally adamant that in doing so it would lose the character of Hercule Poirot, whose appearance in the book she thought had \"ruined it\".Autobiography. (Page 473).  The parts of the policemen were changed from the book as well from Inspector Grange and Sergeant Clark to Inspector Colquohoun and Detective Sergeant Penny."]}, {"page": "Jean-François Miniac", "response": ["In 1994, Claude Lefrancq, a Belgian comic publisher, asked Rosalind Hicks to publish Hercule Poirot's comic book, showing her the Blake and Mortimer's comic book, Mortimer versus Mortimer. In 1995, with the novelist François Rivière, French Agatha Christie specialist, Miniac drew his first cartoon series, \"Agatha Christie\", published at Lefrancq publishing, in Edgar P. Jacobs's spirit, in schematic style. It was a success."]}, {"page": "Deaths in October 2004", "response": ["*Rosalind Hicks, 85, British literary guardian and the only child of Agatha Christie."]}, {"page": "August 1919", "response": ["* Born: Seweryn Chajtman, Polish engineer, developed the Alternative Theory of Organization and Management (ATOM), in Warsaw (died 2012);  Rosalind Hicks, British literary guardian and the only child of author, Agatha Christie (died 2004)"]}, {"page": "Hubert Prichard", "response": ["* Major Hubert de Burr Prichard (14 May 1907 — 16 August 1944). He married Rosalind Hicks, only child of the author Agatha Christie, in 1940. His son, Mathew Prichard, was born in 1943. Hubert was killed in the war next year."]}, {"page": "Archie Christie", "response": ["During Nancy's childhood, her family moved to a house called Rheola in Croxley Green. After she left school, Nancy completed a course at the Triangle Secretarial College in London and obtained a position as a clerk in the Imperial Continental Gas Association. Soon after she started there, her friend from the College, Madge Fox, joined her.Morgan, Janet. Agatha Christie:A Biography (1984) Fontana/Collins, pp. 132-33. In 1925, Madge married Frank Henry James,Southampton Marriage Register, 1925 vol 2C, page 195. and the couple lived in Hurtmore Cottage near Godalming. It was here that Christie saw Nancy at house parties on weekends before his divorce from Agatha. After their marriage, in 1928, Archie and Nancy Christie lived in a London flat at 84 Avenue Road (NW8). They had one son, Archibald (born 1930). Christie stayed in contact with Rosalind, his daughter from his first marriage. In an interview that was published in The Times, Rosalind Hicks made the following comments about her father's second marriage: \"Eventually my father married Nancy Neele and they lived happily together until she died. I saw him quite often and we always liked and understood one another.\"The Times (London), Saturday, 8 September 1990; p. 16."]}, {"page": "Rosalind Margaret Clarissa Hicks", "response": ["#REDIRECT Rosalind Hicks"]}, {"page": "Rosalind Margaret Clarissa Christie", "response": ["#REDIRECT Rosalind Hicks"]}]}}