{"wiki_id": "http://www.wikidata.org/entity/Q4353403", "itemLabel": "Bayan Northcott", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bayan_Northcott", "wikipedia_page": {"main": "Bayan Peter Northcott (born 24 April 1940) is an English composer and music critic.", "link_mentions": [{"page": "Hector Berlioz", "response": ["In recent decades Berlioz has been widely regarded as a great composer, prone to lapses like any other. In 1999 the composer and critic Bayan Northcott wrote that the work of Cairns, Rushton, Sir Colin Davis and others retained \"the embattled conviction of a cause\". Nevertheless, Northcott was writing about Davis's \"Berlioz Odyssey\" of seventeen concerts of Berlioz's music, featuring all the major works, a prospect unimaginable in earlier decades of the century.Allison, John. \"Davis and the LSO embark on their year-long journey through Berlioz\", The Times, 7 December 1999, p. 41 Northcott concluded, \"Berlioz still seems so immediate, so controversial, so ever-new\".Northcott, Bayan. \"Still so controversial, still so new\" , The Independent, 26 November 1999. Retrieved 19 October 2018."]}, {"page": "The Proms", "response": ["* Bayan Northcott (70th birthday)"]}, {"page": "2000 in music", "response": ["*Bayan Northcott – Alma Redemptoris Mater, for three tenors, op. 7, no. 2"]}, {"page": "Oliver Knussen", "response": ["Knussen began composing at about the age of six; an ITV programme about his father's work with the London Symphony Orchestra prompted the commissioning for his first symphony (1966–1967). Aged 15, Knussen stepped in to conduct his symphony's première at the Royal Festival Hall, London, on 7 April 1968, after István Kertész fell ill. After his debut, Daniel Barenboim asked him to conduct the work's first two movements in New York a week later.Bayan Northcott, \"Oliver Knussen\", The Musical Times, Vol. 120, No. 1639. (September 1979), pp. 729–732 In this work and his Concerto for Orchestra (1968–1970), he had quickly and fluently absorbed the influences of modernist composers Britten and Berg as well as many mid-century (largely American) symphonists, while displaying an unusual flair for pacing and orchestration."]}, {"page": "Hans Keller", "response": ["* Bayan Northcott", "*Article on Keller by Bayan Northcott"]}, {"page": "List of composers for the classical guitar", "response": ["| data-sort-value=\"Northcott, Bayan\"| Bayan Northcott || align=center | 1940 || align=center data-sort-value=\"9999\" |  || align=center | United Kingdom || || "]}, {"page": "Robin Holloway", "response": ["Holloway was born in Leamington Spa. From 1953 to 1957, he was a chorister at St Paul's Cathedral and was educated at King's College School, where his father Robert was Head of the Art Department.Northcott, Bayan, \"Robin Holloway\" (August 1974).  The Musical Times, 115 (1578): pp. 644–646 He attended King's College, Cambridge and studied composition with Bayan Northcott."]}, {"page": "List of compositions for guitar", "response": ["*1981-2 Bayan Northcott (born 1940) Fantasia"]}, {"page": "Northcott", "response": ["*Bayan Northcott (born 1940), English composer"]}, {"page": "Jane Manning", "response": ["In his preface to Manning's 65th birthday concert at Wigmore Hall in 2003, the British critic Bayan Northcott wrote:"]}]}}