{"wiki_id": "http://www.wikidata.org/entity/Q4355035", "itemLabel": "Letitia Dean", "itemDescription": "British actress and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Letitia_Dean", "wikipedia_page": {"main": "Letitia Jane Dean (born 14 November 1967) is an English actress known for her portrayal of Sharon Watts in the BBC soap opera, EastEnders. An original cast member from 1985 to 1995, she reprised the role from 2001 to 2006, and again from 2012.\nHer other television roles include Grange Hill (1983–1984), Brookside (1984), The Hello Girls (1996–1998), and Lucy Sullivan Is Getting Married (1999–2000). In 2007, she participated in the fifth series of the BBC dance competition Strictly Come Dancing, finishing fourth. On stage, she starred in the West End production of High School Musical in 2008, and in the UK touring production of Calendar Girls in 2010.", "link_mentions": [{"page": "EastEnders", "response": ["The show often includes strong, brassy, long-suffering women who exhibit diva-like behaviour and stoically battle through an array of tragedy and misfortune. Such characters include Angie Watts (Anita Dobson), Kathy Beale (Gillian Taylforth), Sharon Watts (Letitia Dean), Pat Butcher (Pam St Clement), Kat Slater (Jessie Wallace), Denise Fox (Diane Parish), Tanya Branning (Jo Joyner) and Linda Carter (Kellie Bright). Conversely there are female characters who handle tragedy less well, depicted as eternal victims and endless sufferers, who include Ronnie Mitchell (Samantha Womack), Little Mo Mitchell (Kacey Ainsworth), Laura Beale (Hannah Waterman), Sue Osman (Sandy Ratcliff), Lisa Fowler (Lucy Benjamin) and Mel Owen (Tamzin Outhwaite). The 'tart with a heart' is another recurring character. Often their promiscuity masks a hidden vulnerability and a desire to be loved. Such characters have included Pat Butcher (Pam St Clement) (though in her latter years, this changed), Tiffany Mitchell (Martine McCutcheon), Kat Slater (Jessie Wallace), Stacey Slater (Lacey Turner), Dawn Swann (Kara Tointon), Roxy Mitchell (Rita Simons), Whitney Dean (Shona McGarty) and Lauren Branning (Jacqueline Jossa).", "EastEnders has a high cast turnover and characters are regularly changed to facilitate storylines or refresh the format.\"The Soap Business\", polity.co.uk. Retrieved 27 March 2007.  The show has also become known for the return of characters after they have left the show. Sharon Watts (Letitia Dean) returned in August 2012 for her third stint on the show. Den Watts (Leslie Grantham) returned 14 years after he was believed to have died, a feat repeated by Kathy Beale (Gillian Taylforth) in 2015.\"Dirty Den 'to return' to Walford\" Digital Spy. Retrieved 24 September 2006. Speaking extras, including Tracey the barmaid (Jane Slaughter) (who has been in the show since the first episode in 1985), have made appearances throughout the show's duration, without being the focus of any major storylines. The character of Nick Cotton (John Altman) gained a reputation for making constant exits and returns since the programme's first year, until the character's death in 2015.", ", Adam Woodyatt, Gillian Taylforth and Letitia Dean are the only members of the original cast remaining in the show, in their roles of Ian Beale, Kathy Beale and Sharon Watts respectively. Ian Beale is the only character to have appeared continuously from the first episode without formally leaving, and is the longest-serving character in EastEnders.", "According to the book How to Study Television, in 1995 EastEnders cost the BBC £40,000 per episode on average. A 2012 agreement between the BBC, the Writers' Guild of Great Britain and the Personal Managers' Association set out the pay rate for EastEnders scripts as £137.70 per minute of transmission time (£4,131 for 30 minutes), which is 85 per cent of the rate for scripts for other BBC television series. The writers would be paid 75 per cent of that fee for any repeats of the episode. In 2011, it was reported that actors receive a per-episode fee of between £400 and £1,200, and are guaranteed a certain number of episodes per year, perhaps as few as 30 or as many as 100, therefore annual salaries could range from £12,000 to £200,000 depending on the popularity of a character. Some actors' salaries were leaked in 2006, revealing that Natalie Cassidy (Sonia Fowler) was paid £150,000, Cliff Parisi (Minty Peterson) received £220,000, Barbara Windsor (Peggy Mitchell) and Steve McFadden (Phil Mitchell) each received £360,000 and Wendy Richard (Pauline Fowler) had a salary of £370,000. In 2017, it was revealed that Danny Dyer (Mick Carter) and Adam Woodyatt (Ian Beale) were the highest-paid actors in EastEnders, earning between £200,000 and £249,999, followed by Laurie Brett (Jane Beale), Letitia Dean (Sharon Watts), Tameka Empson (Kim Fox), Linda Henry (Shirley Carter), Scott Maslen (Jack Branning), Diane Parish (Denise Fox), Gillian Taylforth (Kathy Beale) and Lacey Turner (Stacey Slater), earning between £150,000 and £199,999."]}, {"page": "Hatfield, Hertfordshire", "response": ["*Letitia Dean, born in Hatfield."]}, {"page": "November 14", "response": ["*1967 – Letitia Dean, English actress and singer"]}, {"page": "1967", "response": ["** Letitia Dean, English actress"]}, {"page": "1967 in music", "response": ["** Letitia Dean, English actress and singer."]}, {"page": "List of \"-gate\" scandals and controversies", "response": ["| Sharongate || EastEnders ||  || Sharon (Letitia Dean) confessed on tape that she had slept with Phil (Steve McFadden), the brother of her husband Grant (Ross Kemp). || "]}, {"page": "Ross Kemp", "response": ["Kemp's best-known role is that of hardman Grant Mitchell in the BBC soap opera EastEnders. Making his debut in February 1990, his character was often at the centre of major storylines, including abusive marriages to Sharon Watts (Letitia Dean) and Tiffany Mitchell (Martine McCutcheon), as well as the \"Sharongate\" storyline, which saw brother Phil Mitchell (Steve McFadden) having an affair with Grant's wife."]}, {"page": "Den Watts", "response": ["Den was the original landlord of The Queen Victoria public house from Albert Square – the local community of Walford, a fictional borough in East London – who first appeared back when the show debuted on 19 February 1985. From then onwards, the character had a turbulent marriage with his alcoholic first wife Angie (Anita Dobson). In 1986, Den discovered that Angie lied to him about having six months to live and got revenge by giving her divorce papers on Christmas Day 1986 - which was watched by over 30 million viewers. While his marriage with Angie was finished beyond repair, Den continued his close relationship with their adopted daughter Sharon (Letitia Dean) – whom he grew fondly devoted towards throughout his time on the programme. Den soon became involved in storylines that mostly contributed to the character's magnanimous and \"bad boy\" persona, such as Den impregnating sixteen year old Michelle Fowler (Susan Tully) – which resulted in a long-standing feud with Michelle's mother Pauline (Wendy Richard); teaming up with longtime companion Pete Beale (Peter Dean) to force their enemy Nick Cotton (John Altman) out of Walford for causing trouble around the square; romancing with his mistress Jan Hammond (Jane How); and getting revenge on business rival James Willmott-Brown (William Boyde) for raping Pete's beloved wife Kathy (Gillian Taylforth). Grantham quit the series in 1988, and in February 1989, Den was apparently killed off after getting shot, due to his involvement with The Firm – a criminal organization who ended up trying to have him murdered in light of the character's imprisonment for having one of its members help him get revenge against Willmott-Brown.", "Den Watts and his wife Angie (Anita Dobson) are landlords of The Queen Victoria public house in Albert Square, Walford. Den also has a mistress, Jan Hammond (Jane How). He gets Michelle Fowler (Susan Tully), the 16-year-old best friend of his adoptive daughter Sharon (Letitia Dean), pregnant – but she refuses to name the father, fearing repercussions for Den and herself. Den and Angie's relationship starts to fall apart when she meets Jan, but when Angie attempts suicide, Den ends his relationship with Jan despite preferring it to be the other way around. When Michelle gives birth to their daughter, Vicki, she refuses to give Den any contact with her – though he financially supports Michelle in secret. For many years the secret is kept hidden but Michelle's mother, Pauline (Wendy Richard), is one of the first to realize the truth, igniting a feud between her and Den, which intensifies when he admits to her in January 1988 that he is indeed Vicki's father and she slaps him in response.", "However, after 14 years presumed dead, executive-producer Louise Berridge made the highly controversial decision to reintroduce the character to the series and reunite him with his daughter Sharon, played by Letitia Dean. Grantham has alleged that the producers of EastEnders asked him to reprise the role many times since 1991, but he turned each offer down as he was unhappy with the returning storylines. Subsequent offers between 1995 and 2001 were also rejected because Den's screen family were no longer in the show and Grantham felt that a return at this time would have been little more than a publicity stunt. However, he accepted Berridge's offer to return in 2002, as he approved of the storyline, and because Den had family ties within the cast – his adoptive daughter Sharon had returned after six years away, his other daughter Vicki was due to return, and Dennis Rickman (Nigel Harman), the son Den did not know about – was also due to join."]}, {"page": "Peggy Mitchell", "response": ["Peggy is not seen for three years, during which time her relationship with Kevin ends. She returns to Walford when her sons fall out after Phil's affair with Grant's wife, Sharon Mitchell (Letitia Dean), is revealed. Peggy becomes acting landlady of The Queen Victoria public house and blames Sharon for the affair. Peggy tries to force her out of Walford, resulting in Sharon signing over her share of the pub and leaving the Mitchell family as the sole owners, with Peggy in charge."]}, {"page": "Newport Pagnell", "response": ["* Letitia Dean went to Cedars School in the town."]}, {"page": "Barbara Palmer, 1st Duchess of Cleveland", "response": ["* In the 1995 film England, My England by Letitia Dean"]}, {"page": "Dennis Rickman", "response": ["He originally came to Walford - a fictional borough in East London - in 2003 as a new member of the Watts family who had a difficult past and rough childhood, though his identity was unknown for almost thirty years. Dennis soon became a regular presence in Walford's market town Albert Square, and in the summer of that year he murdered his former gangland boss Jack Dalton (Hywel Bennett) after discovering that the latter was responsible for the apparent death of Dennis' illegitimate father Den Watts (Leslie Grantham) in February 1989. Before he killed Dalton, however, Dennis discovered that Den had actually survived the shooting and - thanks to the help of his father's old mistress Jan Hammond (Jane How) - partly contributed to Den's eventual return on September 2003. The follow-up of Den's comeback saw him and Dennis compete against each other in a longstanding conflict that eventually came to an end in 2005 when Den was ultimately killed off on the show's twentieth anniversary episode dated 18 February 2005; Dennis later discovered his father's fate on 29 August 2005, the same day he finally married his adopted sister Sharon (Letitia Dean) after the couple managed to repair their once-forbidden romance.", "Dennis has a passionate fling with Den's adopted daughter Sharon Watts (Letitia Dean) on the eve of Den's return but finds himself rejected when Den re-establishes himself on the Walford scene. They resume their affair in secret but Den cannot accept a relationship between his children and plots to split them up. Den taunts Dennis with the suggestion that someone had sexually abused him while he was in a children's home, successfully provoking Dennis into accidentally hitting Sharon. A guilt-ridden Den later apologises and explains his reasons for not wanting his son and daughter together, because he wants both of them in his life and he cannot have that if they are sleeping together. Den then tries to explain to Dennis that his feelings for Sharon are simply misguided due to the abuse he supposedly suffered as a child, which leaves Dennis confused and so he decides to break up with Sharon in the hope of having a proper father-son relationship."]}, {"page": "Jesse Birdsall", "response": ["He had a small role in the BBC One soap opera EastEnders in August 2012, playing John Hewland, jilted fiancé of Sharon Watts (Letitia Dean), in two episodes."]}, {"page": "Leslie Grantham", "response": ["However, on 3 May 2003, it was confirmed that Grantham would be returning to EastEnders later that year to reprise his role as Den after 14 years. On 29 September 2003, his return to EastEnders was aired, with him arriving at the nightclub E20 now owned by his adopted daughter Sharon, portrayed by Letitia Dean."]}, {"page": "Sharon Watts", "response": ["Sharon Watts (also Rickman, Mitchell and Beale)  is a fictional character from the BBC One soap opera EastEnders, played by Letitia Dean. Sharon is one of EastEnders original characters conceptualised by creators Tony Holland and Julia Smith. She first appeared in the first episode broadcast on 19 February 1985 as the teenage adopted daughter of pub landlords Den (Leslie Grantham) and Angie Watts (Anita Dobson). The character became prominent in the 1990s due to her becoming the landlady of The Queen Victoria public house, and her romantic pairings with brothers Grant (Ross Kemp) and Phil Mitchell (Steve McFadden). In a storyline dubbed Sharongate, Sharon married to Grant, has an affair with Phil, climaxing in 1994 with Grant's discovery of the affair, which remains one of EastEnders highest viewed episodes - the storyline was reinvented in 2018 when Sharon began an affair with Phil's young employee, Keanu Taylor (Danny Walters). She was named the best EastEnders character of all time by the Daily Mirror in 2020.  ", "Although Sharon was meant to be fourteen, licensing regulations required the cast actress to be a sixteen-year-old who could \"play down.\"Smith and Holland 1987, p. 123. Holland and Smith were looking for a \"bouncy, attractive, oddly vulnerable young woman\" who would come across as slightly more sophisticated than the character of Michelle Fowler, due to be Sharon's closest peer. Out of the various applicants they had seen, they felt only actress Letitia Dean had all of the qualities they were looking for. As the casting directors were only looking for real East End actors, Dean falsely claimed that she was born and raised in Hackney, east London. The lie paid off and she got the part, clinching the deal because of her laugh, which Holland and Smith have described as \"the dirtiest in the world!\".", "Reflecting on her casting, Dean told the magazine, Woman, in 2005: \"I was 16 when we started filming EastEnders and my contract was initially for eight weeks—none of us had any idea it would go on for so long. I nearly fainted when I saw Wendy Richard [who played Pauline Fowler] for the first time, because she was a really big name and I was in awe of her. Anita Dobson who played Angie Watts, [Sharon's] mum, took me under her wing.\" In the early days of EastEnders, it was in Letitia Dean's contract that she was not allowed to lose any weight.", "As the character progressed into her 20s, she underwent some changes. Colin Brake suggested that, following the discovery of Den's (wrongly identified) body in 1990, it was \"time for Den's princess to grow up\".Brake 1995, p. 84. In 1993, Letitia Dean discussed the evolution of Sharon from teenager to adult: \"She's grown up a lot. Once she got into her stride she got quite strong—not hard, but knew what she wanted.\" Matthew Bayliss, writing for The Guardian, suggested that Sharon developed into a character that was simultaneously \"vamp and victim\", comparing her to another popular soap opera character from ITV's Coronation Street, Elsie Tanner (Pat Phoenix).", "In 1991, author Hilary Kingsley compared Sharon in adulthood to her mother Angie: \"There's a lot of her mother in Sharon Watts. There is the warm sympathy and the barbed tongue for a kick-off. But Sharon is more sensible than Angie, less likely to fly off the beer handle in The Vic.\" Letitia Dean suggested that Sharon was trying to establish her own personality as landlady of The Vic in 1993, but that she was also taking tips from Angie, whom she \"admired for her strength of character.\" In the 1990s, the producers of EastEnders wanted to take the similarities between Sharon and Angie one step further; they proposed that Sharon would begin drinking gin, the favourite beverage of her alcoholic mother. Dean was opposed to this development and persuaded the producers not to go down this route with Sharon. In 1993, she explained her reasons: \"There was one time they wanted [Sharon] to drink gin because that was Angie's tipple, but I thought that was wrong. Her mother was on a dialysis machine which would have put Sharon off gin for life. She would either follow right behind her or she would make her mind up and say no. And since she had seen Angie in such a state, it really put her off.\"", "Sharon has topped numerous viewer polls suggesting she is one of EastEnders' most favored characters. Critics have praised the character's complex progression from teenager to adult, referencing the investment that viewers hold in Sharon, having watched her grow up on-screen. While Sharon's returns to EastEnders have been welcomed by some critics, others received her comebacks as an indication that the show's writers and producers had run out of original ideas. Letitia Dean has defended the decision to reintroduce Sharon, suggesting that long-running dramas such as EastEnders need \"old blood\". On 10 April 2019, Dean filmed her 2000th episode as Sharon.", "Sharon went on to feature in a storyline about the ups and downs of a pop group called The Banned in 1986.Smith and Holland 1987, p. 205. It featured the majority of teenage characters in the soap at the time. The storyline proved to be a successful merchandising tool for the serial, as it spawned two hit singles in the UK charts. One of the songs \"Something Outa Nothing,\" which was performed on-screen in the plot, was released by actors Letitia Dean and Paul J. Medford. The song was a modest success, reaching number 12 in the UK singles chart in November 1986. The storyline was seen as an interesting and major undertaking in the serial, but one that Holland and Smith felt never entirely worked.", "19 million viewers tuned in on Boxing Day 1991 to witness Sharon and Grant's surprise Christmas wedding. Their marriage was scripted to be volatile, with Grant resorting to violent displays when things did not go his way and endangering Sharon on numerous occasions due to his criminal dealings. Letitia Dean discussed Sharon's attraction to Grant in 1993: \"Grant was quite flirtatious with [Sharon] when they first met and he made her feel quite good about herself. He promised to protect her and he promised her the world [...] She wouldn't have gone for Grant if he was just a complete pain in the arse. There are obviously other qualities in him which is why she strives to keep [their relationship] going. There's a lot of reminders — [Grant's] not [Sharon's father] Den, but he's got a lot of characteristics that are pretty similar.\"", "Despite the fact that Sharon married Grant in 1991, former EastEnders writer Tony Jordan has revealed in a documentary entitled The Mitchells — The Full Story that the love-triangle storyline between Grant, Sharon and Phil had been planned from the Mitchell brothers' introduction, after the writers came to the realisation that Sharon \"was perfect for both of them\". The plot has been described by former Executive Producer of EastEnders and BBC's Head of Drama Serials, John Yorke, as a \"Tristan and Isolde story\".\"EastEnders: Faith, Morality and Hope in the Community\", BBC Press Office. URL. Retrieved 18 August 2007. The storyline was spread out for several years and began with Sharon turning to Phil for comfort during a particularly turbulent part of her marriage to Grant. The episode in which Phil betrayed his brother with Sharon occurred in September 1992 in one of the soap's notorious three-handers, an episode featuring only Sharon, Phil and Grant for the duration. Sue Dunderdale directed the episode and the performances of McFadden, Kemp and Dean have been described as memorable and filled with high-tension drama.Brake 1995, p. 114. Discussing Sharon's feelings for Phil, Letitia Dean said: \"Phil was always around for Sharon. He seemed to understand her, and Sharon appreciated that. There's always been something between them.\"", "Letitia Dean decided to quit the role of Sharon in 1995, having played the character for over a decade. Dean was not the only original cast member to announce their departure that year; Susan Tully (Michelle Fowler) and Bill Treacher (Arthur Fowler) also quit, leaving just Wendy Richard (Pauline Fowler), Adam Woodyatt (Ian Beale), and Gillian Taylforth (Kathy Beale) as the only original cast remaining at that time. Dean, who was aged 26 at the time, has since reflected on her decision to leave, suggesting she went through an identity crisis when she found herself thinking \"who am I? Am I Sharon Watts or am I an actress?\". Sally Vincent, interviewing Dean for The Guardian, surmised: \"it nagged away at [Dean] for ages until she thought, hell, she owed it to herself, and started telling the producers she'd been thinking about trying new things. In those days, they didn't let you off for the odd panto or anything. It was full-time work. She remembers being dithery and apologetic about it, but her feet were itchy and, though she never really wanted to close the door behind her, she talked about going until one day, much to her consternation, [the producers] said all right then, off you go, lots of luck. They didn't ask her to reconsider, so she thought, 'Ooooh, charmin', and off she went.\" Dean added, \"I felt the need to spread my wings and try my hand at other things. I didn't want to feel there were parts out there I hadn't had a chance to play. When I left I felt this mixture of excitement and fear. I went on the last walk with Susan Tully [who played Michelle Fowler] around the Square, talking quietly, and I felt quite sad. But at the same time it felt like the right thing to do.\"", "Den's return aired in September 2003, with Den walking into Sharon's club \"Angie's Den\" (named after her parents) and uttering the greeting \"Hello princess\" to his daughter. Scriptwriter Sarah Phelps, who penned Den's return, has discussed the episodes in the televised documentary EastEnders Revealed: Dirty Den Returns: \"It all had to kick off in Angie's Den because this is the thing that Sharon has built [in] memory of her parents [...] the way she's worshipped them in their death in a way that she couldn't deal with them when they were alive [...] there's a lot of really confused and emotional stuff [for Sharon]\". Letitia Dean has discussed Sharon's reaction to Den's comeback: \"Sharon put her father on such a pedestal, when she found out that he had been alive for all those years and never contacted her — once — it absolutely devastated her, it rocked her world [...] She couldn't believe that he would be so selfish because she was his princess.\" Leslie Grantham suggested that the one person Den loved more than himself was Sharon and that she was the reason he came back to Walford after 14 years. Part of Den's return episodes featured a 20-page scene between Sharon and Den, played out in their former home, The Queen Vic. The director required that this scene be filmed all at once, which Dean has described as daunting but exciting. She believed that the long scene helped build realistic tension greatly because both she and Grantham were so nervous about working together again.", "In August 2005, the BBC announced that both Letitia Dean and Nigel Harman were quitting their roles as Sharon and Dennis, with both due to film their final scenes for a New Year's departure. While Harman's exit was reported as permanent, Dean's was reported as an \"extended break\", with the suggestion being that she would be returning to the soap opera at some unspecified stage. Discussing the departure, Harman said, \"Sharon and Dennis have had such a great run, but what would you do with them next? I could pretty much guarantee we've already done it. It was something that was talked about over a period of time between myself and the producers\"I think it would be weird to have one there without the other and we've taken it as far as we can go. I think [the exit storyline will] be quite juicy but I'm waiting to find out. I'd like it to be a happy storyline, like Sharon and Dennis going off around the world. Although obviously, she'll have to come back on her own going, 'What a [bastard]'.\"", "Despite Sharon discovering that she was pregnant with Dennis's child on Christmas Day 2005, the Rickmans were not given a happy ending. Writers made the decision to kill Dennis in the New Year's Eve episode of 2005. In the episode Dennis fatally stabbed on the Albert Square pavement following a violent altercation with gangster Johnny Allen, having been informed by Phil Mitchell that Johnny had throttled Sharon. The aftermath saw Sharon struggling with her grief and the realisation that she would be bringing her baby up fatherless. Discussing Sharon's grief at Dennis's funeral, Letitia Dean told Inside Soap in 2006 \"It's an incredibly traumatic day for Sharon, she's lost her soulmate. It's especially devastating because she's pregnant, which, as far as she and Dennis were concerned, was a miracle. It's such a bittersweet time. The pain is overwhelming when Sharon sees her husband's coffin [...] Sharon knows that she has to carry on for the baby's sake—it's a part of Dennis she'll have forever, and she takes great comfort in that. As far as Johnny's concerned, though, she wants to see justice done—a job she entrusts to Phil. However, all he's interested in is getting Sharon away from Walford. He's genuinely worried for her welfare, but he's also petrified she'll discover his role in Dennis's death.\" In the storyline, Phil persuades Sharon to leave Walford to stay in America in an episode airing in January 2006.", "Letitia Dean suggested in 2012 that \"Sharon has always had a great fondness for Phil and he has always been there for her. She is very comfortable around him and they have a lot of history between them.\" Although Dean has speculated that Sharon and Phil are not right for each other, she acknowledged the connection between the characters, suggesting they \"know each other inside and out\". She added, \"It was real lust between them back in the day. I don't think she's ever lost that feeling for him and vice versa [...] She likes to think there are no surprises with him but he's also got that edge to him that she's always liked as well. There's a familiarity there and he will help her to feel more settled in life [...] There's always been a deep affection. I think she did love him greatly but when they first got together, when she was married to his brother Grant, that love was never allowed to blossom really. There have always been underlying feelings for him. This is the first time they can really be together properly and honestly and she wants him warts and all [...] She feels safe with Phil, she feels protected and she always has with him, even when they were just friends she always knew he'd be there for her.\"", "Letitia Dean has been nominated for multiple awards for her portrayal of Sharon. In 1995, she was nominated in the \"Most Popular Actress\" category at the National Television Awards. Dean was nominated for the \"Best Actress Award\" at the British Soap Awards in 2004, and she was also nominated in the category of \"Best Dramatic Performance\" for \"Den's Return\". At the 2005 Inside Soap awards, Dean was presented with the coveted award for outstanding achievement as homage to her work in EastEnders; at the time of the awards ceremony, she had appeared in EastEnders (on and off) for over 20 years. She was also nominated in the category of Best Couple (shared with Nigel Harman). Dean was nominated for \"Best Actress\" for the Inside Soap Awards 2014. In November 2018, Sharon's pairing with Keanu was nominated for Best Soap Couple at the 2018 Digital Spy Reader Awards; they came in ninth place with 4% of the total votes.", "Discussing Sharon's initial exit in 1995, Alison Pearson writing for The Independent felt that the script, which saw Sharon misleading Grant into a reunion, was not in-keeping with the character. She commented, \"In soap, character is destiny, and I have to say that I didn't really believe in Sharon's plan for elaborate revenge on Grant. It was a mechanism for getting actress Letitia Dean her freedom and not true to the nature of the character we had grown to know. You could not fault the central performances, though. Albert Square will be a less rounded place without Sharon.\" Conversely, reporter Matthew Bayliss was positive about the exit stating, \"[Sharon] survived the sort of shunning normally suffered by 13th-century Welsh witches in order to wreak the perfect revenge on Grant, tricking him into publicly proposing to her, just so she could turn him down. Rarely has a character's exit been so satisfying to watch, and it was a homage to Sharon's strengths as a character that she left with so much unfinished business behind her.\"", "Sarah Ellis of Inside Soap said that the magazine's staff had never been so excited as they were when they heard Sharon was returning in 2012. She said that they were \"dying\" to know which male character Sharon will take an interest in first. Ross Kemp who played Grant Mitchell and Steve McFadden who plays Phil Mitchell expressed pleasure at the return of Sharon and Letitia Dean in 2012, with McFadden suggesting that Letitia's former stint in EastEnders was part of a golden era of the soap opera. He described her return as brilliant.", "Media reporter for The Guardian, Stuart Heritage, was critical about EastEnders' decision to reintroduce Sharon for the third time in 2012, suggesting that it meant that the programme had run out of original ideas. Heritage commented, \"Even Letitia Dean has probably lost count of the times she's left and returned as Sharon. She's spent the last 18 years running away to the United States, only to come back to buy a pub or bury her mum, or to have sex with a Mitchell brother, or the other Mitchell brother, or her own adopted sibling, or to confront her inexplicably twice-dead father. Often Sharon's haircut will imperceptibly change upon her arrival, but everything else—the quivering lip, the worrying breathlessness, the consistent inability to refer to Phil Mitchell as anything other than 'Fiw'—remains the same. This is how it's likely to be this time around, regardless of if anyone actually wants her back or not [...] There are other offenders—Bianca, Janine, Mandy, Grant—but Sharon is the worst, simply because she's so prolific\". Letitia Dean defended her comeback saying, \"I think with any sort of ongoing drama like EastEnders you need old blood, new blood, it just needs a balance.\" Steve McFadden added \"What Letitia is doing is bringing back some history and you can't buy that. It takes years to build that up.\""]}, {"page": "Strictly Come Dancing", "response": ["| style=“background:pink;”|Letitia Dean", "|Letitia Dean"]}, {"page": "Walford", "response": ["The nightclub on Turpin Road is originally named Strokes Wine Bar until George Palmer (Paul Moriarty) buys it and renames it \"The Cobra Club\". He uses the club as a cover for his criminal business. Annie Palmer (Nadia Sawalha), George's daughter, takes over the control of the club when he leaves; she renames the club \"The Market Cellar\". Annie later sells the club to Steve Owen (Martin Kemp), who renames it \"e20\". Under Steve's ownership, Saskia Duncan (Deborah Sheridan-Taylor) is killed in the club after a struggle with Steve and Matthew Rose (Joe Absolom). Beppe di Marco (Michael Greco) and Billy Mitchell (Perry Fenwick) buy the club from Steve, although Beppe sells his majority share to Sharon Watts (Letitia Dean), who rebrands the club \"Angie's Den\", in memory of her parents Angie Watts (Anita Dobson) and Den Watts (Leslie Grantham). Following a refurbishment, Den buys into the business and co-owns with Sharon. They sell the club to Johnny Allen (Billy Murray), who renames it \"Scarlet\" after his deceased daughter. Johnny gives the club to his surviving daughter, Ruby Allen (Louisa Lytton), when he is imprisoned. The start of Stacey Slater (Lacey Turner) and Bradley Branning's (Charlie Clements) relationship begins in Scarlet when Bradley is falsely blamed for spiking Stacey's drink. A reporter from Inside Soap labelled the moment \"a rather unromantic start to Stacey and Bradders' love story!\" Ronnie Mitchell (Samantha Womack) and Jack Branning (Scott Maslen) buy the club, renaming it the \"R&R\" - the initials of Ronnie and her sister, Roxy Mitchell (Rita Simons). Ronnie and Roxy run the club, while Jack operates as a silent partner. When Ronnie and Jack separate, Ronnie sells her share of the club to Jack, although after a fire in the club, Ronnie and Roxy each buy a share in the club. When Billy tries to woo Carol Jackson (Lindsay Coulson), Carol's daughter Bianca Butcher (Patsy Palmer) becomes aggressive and creates an argument between them, Stacey, Janine Butcher (Charlie Brooks) and Kat Moon (Jessie Wallace). An Inside Soap columnist labelled the argument \"one of our favourite catfights\". Jack is later shot at the club by gang member Kylie (Elarica Gallacher), and a few months later, he sells his share of the club to Phil Mitchell (Steve McFadden). Roxy and Ronnie also sell their shares to Janine. Upon her return to Walford, Sharon becomes the R&R's bar manager and she holds her wedding to Jack at the club. At the altar, Jack jilts Sharon, leaving her saddened. Sharon is also offered a small share in the business by Phil. Janine and Sharon later sell their shares to Phil, leaving him as the sole owner. The R&R closes at some point in before Christmas 2016, and remains shut until February 2018, when Sharon decides to reopen it with Mel Owen (Tamzin Outhwaite) as the manager. Mel plans to rename the club \"The Phoenix\", but her son Hunter Owen (Charlie Winter) sabotages the refurbishment and rebrands it e20 again in honour of his father, Steve. When Mel's ex-husband Ray Kelly (Sean Mahon) plans to remarry her, he buys Phil's 50% stake in E20 and gifts it to Mel as a wedding present. In November Mel decides to sell her half of E20 to Ruby and later blackmails Sharon into selling her half too, leaving Ruby as the new owner of the club which she renames “Ruby’s”."]}, {"page": "Adam Woodyatt", "response": ["Aged 13, Woodyatt appeared on stage at the National Theatre in Tom Stoppard's play On the Razzle. Following the completion of his studies at the Sylvia Young Theatre School, Woodyatt appeared in the BBC's children's drama series The Baker Street Boys (1983). He then put his acting career on hiatus and worked as a butcher in Wales for a brief period, before joining the cast of BBC soap opera EastEnders. Not expecting to stay much beyond the first year, Woodyatt has become the longest-serving male cast member in EastEnders. Alongside Letitia Dean, Gillian Taylforth and Jane Slaughter, who play Sharon Watts, Kathy Beale and Tracey, Woodyatt is one of only four members of the original cast currently in EastEnders, but, apart from a break in 2020, is the only one except Slaughter to have appeared continuously throughout the show's run. In 2013, his longevity was honoured at the British Soap Awards, where he received a Lifetime Achievement Award for his portrayal of Ian Beale."]}, {"page": "Appleton (music duo)", "response": ["Natalie and Nicole Appleton were born in 1973 and 1974 respectively to their British mother Mary and their Canadian father, Ken. They also have two elder sisters, Lori and Lee. Their parents divorced in the late 1970s, and the sisters switched frequently between their mother's native United Kingdom, Canada, and the United States.  Both attended Ellenville High School in upstate New York. They stayed in Britain eventually, and became students at the Sylvia Young Theatre School in North London, which was to tutor their fellow All Saints colleague and Nic's schoolmate, Melanie Blatt as well as Denise van Outen, Emma Bunton, Letitia Dean and Samantha Janus.  The sisters were back in the UK in 1994, and, together with Shaznay Lewis, joined with former schoolmate Melanie Blatt to form All Saints."]}, {"page": "Anita Dobson", "response": ["Since leaving EastEnders in 1988, BBC bosses made numerous offers for her to return, but she did not accept any of the offers; recently she commented \"Why tarnish the gorgeous creation that was Angie Watts?\" Bosses finally gave up hope of ever tempting her to return, and in 2002 the character of Angie Watts died off-screen of alcohol poisoning and was brought home to be buried by her on-screen daughter Sharon Watts (Letitia Dean), who had returned to the show the previous year."]}, {"page": "Darren Bennett (dancer)", "response": ["* Series Five: Knocked out in the quarter-final (fourth place) after competing with actress Letitia Dean. They also competed together in the 2007 Christmas Special, but were not placed in the final two overall (the remaining couples were not ranked).", "*Live Tour 2008: Competing at a series of venues during January and February 2008 with Series Five partner Letitia Dean, they won once (31 January 2008), and were runners up on two further occasions. The tour was based on a similar format to the main series, with each couple performing two routines which were marked by the judges, and the audience being invited to vote for their favourite.", "|rowspan=\"11\"| Letitia Dean"]}, {"page": "Susan Tully", "response": ["Tully is a supporter of the Meningitis Trust and she has also been involved in the Comic Relief fundraising event. She is a close friend of Letitia Dean, who played her best friend Sharon Watts in EastEnders.\"LIFE AFTER SHARON\", Sunday Mirror. URL last accessed on 18 September 2006. Tully was a bridesmaid at Dean's wedding to Jason Pethers in 2002.\"EastEnd Letitia's diamond geezer\", Sunday Mirror. URL last accessed on 18 September 2006."]}, {"page": "Wootton, Bedfordshire", "response": ["* Letitia Dean, EastEnders actress "]}, {"page": "Chrissie Watts", "response": ["Chrissie Watts was created by the production team to be more the \"equal\" of her notorious and villainous husband than his long-suffering first wife, Angie (Anita Dobson). The character was described by Oberman as being like Angie \"but with 15 more years of feminism behind her\", and was hailed by the TV editor of the Evening Standard as \"the only strong woman left in Walford\". She became well known for her deviousness and \"scheming\", echoing the traits of her husband, with the official EastEnders website characterising her as \"happy to play mind games\" and \"often two steps ahead\" of Den. As part of the Watts family and the last of its major members to have appeared on the show, Chrissie's storylines explored her tumultuous marriage to Den; bonding with his adopted daughter Sharon (Letitia Dean) and her two half-siblings, Dennis Rickman (Nigel Harman) and Vicki Fowler (Scarlett Alice Johnson); conspiring with Den to retake ownership of The Queen Victoria public house; forming a relationship with her boyfriend Jake Moon (Joel Beckett) after Den's murder; attempting to sell the Queen Vic Jake's gangland boss Johnny Allen (Billy Murray) and local businessman Ian Beale (Adam Woodyatt); being blackmailed by young wayward Stacey Slater (Lacey Turner); and feuding with the rival Mitchell family. During her time on the show, Chrissie sparked numerous clashes with other female characters - such as her archenemy Sam Mitchell (Kim Medcalf); Stacey's cousin Kat (Jessie Wallace); Phil's girlfriend Kate Morton (Jill Halfpenny); Kat's daughter Zoe (Michelle Ryan); and Sam's mother Peggy (Barbara Windsor). It was noted by Oberman herself that Chrissie \"had more fights on EastEnders than most women have in their whole lives\", and was constantly scheming against those who got in her way - thereby earning her the sobriquet of \"super-bitch\".", "Chrissie Watts first arrived in Albert Square — the community of Walford, a fictionalized borough in East London — in search of her estranged husband, Den Watts (Leslie Grantham). When they cross paths, it becomes clear that their marriage has grown sour ever since Den sold their bar in Spain and taken the money without her consent. Den manages to persuade her to give their marriage another try, and to stay in Walford with him. Chrissie reluctantly agrees and is surprised to learn that he has an adopted daughter, Sharon (Letitia Dean), along with two other children: Dennis Rickman (Nigel Harman) and Vicki Fowler (Scarlett Alice Johnson). Later on, Chrissie learns that the reason Den was in Spain with her was because he was in exile after faking his own death back in 1989; Dennis' gangland boss Jack Dalton (Hywel Bennett), whom he recently killed nearly a year ago, tried unsuccessfully to have Den murdered for setting up his illegal activities on Dalton's criminal organization known \"The Firm\". In 1997, just around eight years after surviving The Firm's attempt to kill him, Den met Chrissie and the two would later get engaged and subsequently married.", "In an interview with the Sunday Mirror, Oberman revealed that she was attracted to the mesh of sexuality and humour in the personality of Chrissie, declaring, \"What I really like is she's got the sex and dry sarcasm\". Speaking to the official EastEnders website, she expanded on the importance of Chrissie's sense of humour and wit to her \"feisty\" characterisation: \"What I love about Chrissie is that she's a good strong, funny female character... she's got a really good sense of humour which is necessary to deal with Den. She's very good at wisecracks. Den has the one-liners, but Chrissie bats them right back.\" Chrissie's barbed and biting remarks became a prominent feature of the character; even when cornered by Den's adopted daughter Sharon Watts (Letitia Dean) after attempting to flee the country, she remarks: \"You really are your father's daughter, Sharon. No shaking you off either.\""]}, {"page": "Andy Hunter (EastEnders)", "response": ["The character's story arc began with Andy taking over Dalton's position as the leader of his criminal organization, The Firm, and becoming the newly established crime kingpin of Walford in the borough's local community named Albert Square. Soon afterwards, Andy went on to develop a mutual friendship with Dalton's protege-turned-killer Dennis Rickman (Nigel Harman); establish a relationship with local wayward Kat Slater (Jessie Wallace), which led to the pair having a wedding that ended with Kat jilting Andy in favor of his love rival Alfie Moon (Shane Richie); repetitively clash with Dennis' girlfriend and Kat's daughter Zoe (Michelle Ryan) after he blackmails her mother into sleeping with him to get revenge on Alfie; humiliate Dennis' illegitimate father Den Watts (Leslie Grantham) after defeating him in a high-stakes poker game and then exposing his antics to his adopted daughter Sharon (Letitia Dean); feign a romance and subsequent marriage with Kat's best-friend Sam Mitchell (Kim Medcalf) in order to extract control of her family empire; instigate a feud with Sam's cousin Billy (Perry Fenwick) after the latter attempts to warn Sam's mother, Peggy (Barbara Windsor), about his scheme to exploit her financial interests; arrange for Billy's companion Minty Peterson (Cliff Parisi) to get beaten up over his romantic feelings for Sam: build an unlikely friendship with his secretary Pat Evans (Pam St Clement); organize the death of employee Paul Trueman (Gary Beadle) in retribution for attempting to entrap Andy into a police sting operation over his criminal activities; spark a conflict with Paul's adopted father, Patrick (Rudolph Walker), after the latter discovers the truth about his son's fate; and became enemies with Alfie's two cousins, Jake (Joel Beckett) and Danny (Jake Maskall), after having their grandmother Nana (Hilda Braid) attacked in retaliation for the pair stealing his car and later assaulting him.", "By then, Andy has established himself as the square's newly reigning top dog — a trait which formerly belonged to Phil, until he was forced on the run after Den and Dennis set him up for armed robbery during the Mitchell and Watts' family feud. Andy also cements his position as Walford's undisputed crime kingpin, in the midst of expanding his criminal empire, up to the point where he summons his henchman Eddie (Daren Elliott Holmes) to help maintain his status. Andy later tries to hire Dennis into the business, but this does not last long when Dennis resolves to helping Den co-manage his nightclub: \"Angie's Den\". As time goes on, Kat's daughter Zoe (Michelle Ryan) begins dating Dennis, and soon finds out about how Andy blackmailed her mother into sleeping with him. Zoe promptly confronts Andy, and ends up hurting her lip following a scuffle between them. Zoe later makes it appear to Dennis that Andy had assaulted her, which causes him to look for him around the square until he spots Andy going to the local bookies. There, Dennis confronts and punches Andy — who is forced to explain what he did to Kat in order to get Dennis to understand the truth about Zoe. A few days later, Den invites Andy to a poker game and the pair go all-in with all their money and assets; Andy wins the final round, but chooses not to take Den's possessions and instead urges him to sort his life out. Den later tries to get revenge on Andy by committing a scam at his bookies, but this fails when Andy discovers his plan, after being informed about this by Den's longtime friend Pat Evans (Pam St Clement) — with whom Andy has developed an unlikely bond, on this occasion. Andy later confronts Den about his scam, and humiliates him in the pub by revealing his gambling bet to his adopted daughter Sharon (Letitia Dean), before comforting Pat after Den refuses to apologize for disrespecting her character in front of everyone in the pub; Andy later hires Pat to become his secretary at the bookies."]}, {"page": "Louisa Lytton", "response": ["Lytton began touring with 'Strictly' on 18 January 2008 with ex-EastEnders co-stars, Letitia Dean and Matt Di Angelo, and ended the tour with 11 wins under her belt. Along with her EastEnders co-star Christopher Parker, Louisa was vocal in her criticism of the media treatment of John Sergeant, which led to him resigning from the 2008 series of 'Strictly Come Dancing'.  She said she was surprised that Arlene Philips was removed as a judge from the next series of Strictly Come Dancing due to her age, she is to be replaced by former contestant and 2007 winner Alesha Dixon."]}, {"page": "Nigel Harman", "response": ["**Inside Soap Awards 2005 Best Couple (Shared with Letitia Dean)"]}, {"page": "Mark Fowler", "response": ["Mark had embarked on three marriages with Gill Fowler (Susanna Dawson), who had also contracted HIV and died the day after their wedding; Ruth Fowler (Caroline Paterson), which ended in adultery; and Lisa Shaw (Lucy Benjamin), which became the most circumstantial out of all his marriages. Other storylines involved feuds with his archnemesis Nick Cotton (John Altman) and love rival Phil Mitchell (Steve McFadden), an unlikely friendship with Phil's aggressive brother Grant (Ross Kemp), a close companionship with family friend Sharon Watts (Letitia Dean), becoming a suspect in the Who Shot Phil? scenario, coping with the death of his father Arthur (Bill Treacher), and helping out with family crisis that can sometimes test his relationship with his mother Pauline (Wendy Richard) in the process.", "At the point Phil's actions have resulted in Dan fleeing the country and Steve's marriage with Mel were left on the verge of facing jeopardy, Mark and Lisa conduct a plan to pretend that she is expecting Mark's baby – as he had grown to love Lisa so much ever since her troubles with Phil had started. To facilitate their lie, Mark insists that he'd taken all necessary precautions in relation to his HIV and they fool everyone for a while. He later proposes to Lisa shortly after her baby Louise is born. However, Mark is devastated to learn that Phil is actually the child's biological father. This Phil discovers when Grant's former wife Sharon (Letitia Dean) informs him about Louise's true parentage, and Phil vows to take an active role in his daughter's upbringing. Mark and Lisa marry, but their happiness is short-lived: Lisa is still very much in love with Phil and Phil knows it so he seduces her in order to get more access to Louise. After Sharon discovers Phil's intentions, she talks him out of his plan and he ends the affair with Lisa, but Mark finds out and after just five months of marriage Lisa leaves Mark and resumes her affair with Phil. This causes Mark to break down by the time he eventually discovers this. After confronting Phil about the discovery, Mark almost rapes Lisa. Horrified by his actions, Mark leaves Walford for a short while. However, Lisa soon realizes her mistake living with Phil and wants to reconcile with Mark, but Pauline refuses to tell her where Mark has gone. Mark eventually returns at Christmas where he supports Martin to deal with the aftermath of running over Jamie."]}, {"page": "Kat Slater", "response": ["Kat was written out of EastEnders temporarily in January 2012. The writers for EastEnders organised \"emergency script changes\" which saw Kat called away to care for her father Charlie after a stroke. It was announced shortly after Wallace's break from EastEnders that Sharon Watts, played by Letitia Dean, would return to the series. Numerous tabloids reported that the purpose of Dean's return is to replace Jessie Wallace; this was later denied by an EastEnders spokesperson. The spokesperson commented: \"There is no link between Letitia's return to EastEnders and Jessie not being around at the moment. We have been working on plans to bring Sharon back for quite some time.\" An insider added: \"Jessie and Letitia are two fantastic actresses and their characters are firm favourites with fans. Viewers can look forward to seeing them back on screen together later this year.\""]}, {"page": "Ian Beale", "response": ["Ian is the most-married character in EastEnders history, with six marriages to five women (Cindy Williams, Mel Healy, Laura Dunn, twice to Jane Collins, and Sharon Watts) and two aborted engagements to Mandy Salter and Denise Fox. Ian is the current owner of 45 Albert Square, traditionally represented within the series as the family home of the Beale and Fowler family, and in 2020 he bought the Queen Victoria pub for Sharon Watts (Letitia Dean).", "As a teenager, Ian argues with his father Pete Beale (Peter Dean) over his desire to become a caterer but his grandmother Lou Beale (Anna Wing) encourages him. He starts several businesses and buys a local café soon after graduating from catering college. Ian has several failed romances, including with his childhood friend, Sharon Watts (Letitia Dean). Sharon becomes interested in Simon Wicks (Nick Berry), who was believed to be Ian's half-brother, but they remain close friends. When his cousin Michelle falls pregnant, he is initially suspected to be the father by Pete and Kathy. He starts a relationship with Tina Hopkins (Eleanor Rhodes) and the pair decide to move in together, renting one of Kelvin Carpenter's (Paul J. Medford) father Tony Carpenter's (Oscar James) flats. Ian eventually loses his virginity to her, to his glee. Ian and Tina break up when Tina's parents make an unannounced visit and are unhappy with their living conditions, so they take Tina to Ilford. Ian's uncle Kenny Beale (Michael Attwell) and cousin Elizabeth Beale (Lucy Bayler) visit from New Zealand and Ian and Elizabeth taking a liking to each other, but they break up when Elizabeth constantly flirts with men and she returns home. Ian begins to develop a relationship with Donna Ludlow (Matilda Ziegler), not knowing she is his half-sister until his mother Kathy Beale (Gillian Taylforth) tells him she was raped as a teenager and gave Donna up for adoption."]}, {"page": "The Queen Victoria", "response": ["In the series' backstory, Albert Square was built around 1860 during the reign of Queen Victoria. In February 2020 Sharon Watts (Letitia Dean) revealed that the original landlords of The Queen Victoria were Mr and Mrs Bagstock, and that he’d drowned his wife in the bath. Originally the pub was to be called The Balmoral Arms but after the death of Prince Albert it was renamed as a tribute to the mourning Queen. In reality, Albert Square is based on the real Fassett Square in Hackney, but there is no pub there so The Queen Victoria is based on what was once College Park Tavern on Harrow Road in Harlesden. Initially, the pub's exterior is first seen painted brown. This is later changed to a green and cream colour scheme in late 1990, before Grant Mitchell (Ross Kemp) sets alight to the Queen Victoria in 1992, after which it is painted red. Following another blaze in 2010, the pub is painted red, green and cream. On Boxing Day 2013, the new family to the square, the Carters, took over the Queen Vic and since then it has had a refurbishment and has been painted red once again.", "Angie is served with divorce papers by Den on Christmas Day 1986 and two years later he passes control to Frank (Mike Reid) and Pat Butcher (Pam St. Clement). In 1990, Frank and Pat hand over the pub to Eddie Royle. Eddie is murdered by Nick Cotton (John Altman) the following year, and the daughter of Den and Angie, Sharon Watts (Letitia Dean), becomes the first licensee when she buys the freehold of The Queen Vic with the assistance of her husband Grant Mitchell (Ross Kemp) and his brother Phil (Steve McFadden); the three live there. Grant sets fire to the pub in 1992 in an insurance scam and it is refurbished. Grant and Sharon divorce in 1995 after her affair with Phil was exposed and their share of The Queen Vic is sold to Grant and Phil's mother, Peggy (Barbara Windsor). Peggy marries Frank in 1999 and he again becomes a landlord. When Grant leaves Walford, Peggy's alcoholic son Phil sells his share of the pub to Dan Sullivan (Craig Fairbrass) for a mere £5 to spite his domineering mother. However, he subsequently buys back his share and evicts Dan from The Queen Vic. After Frank disappears and leaves her penniless, Peggy is forced to sell the pub in early 2001. The new buyer is revealed to be Sharon, in partnership with Steve Owen (Martin Kemp). Steve has to sell his share to raise ransom money for his wife Mel (Tamzin Outhwaite) and Phil buys back part of The Queen Vic. In 2002, Sharon also sells up to Phil and the pub returns to the control of the Mitchells. Peggy appoints Alfie Moon as manager later that year.", "* 1992: Grant Mitchell (Ross Kemp) sets fire to the pub to claim money on the insurance, with his wife, Sharon (Letitia Dean), plus Roly the Poodle trapped inside.", "* 1994: \"Sharongate\": Sharon Mitchell (Letitia Dean) is caught out when Grant Mitchell (Ross Kemp) plays in the bar a taped confession of her two-year affair with Phil Mitchell (Steve McFadden) during Phil and Kathy Beale's (Gillian Taylforth) engagement party.", "* 2004: The affair between Sharon Watts (Letitia Dean) and Dennis Rickman (Nigel Harman) is revealed to their family, including Dennis’ girlfriend Zoe Slater (Michelle Ryan).", "* 2005: Den Watts' (Leslie Grantham) corpse is uncovered by Sam Mitchell (Kim Medcalf) on the wedding day of Sharon Watts (Letitia Dean) and Dennis Rickman (Nigel Harman).", "* 2019: During Mel Owen's (Tamzin Outhwaite) wake, Lisa Fowler (Lucy Benjamin) reveals that Phil Mitchell (Steve McFadden) is not the father of Sharon Mitchell’s (Letitia Dean) baby.", "* 2019: Louise Mitchell (Tilly Keeper) confronts stepmother Sharon Mitchell (Letitia Dean), who confesses to her affair with Louise's boyfriend, Keanu Taylor (Danny Walters).", "* 2020: After DI Steve Thompson (Philip Wright) starts to arrest Phil Mitchell (Steve McFadden) Sharon Watts (Letitia Dean) provides him with a false alibi.", "* 2021: Max Branning (Jake Wood) tells Ian Beale (Adam Woodyatt) that he believes that Sharon Beale (Letitia Dean) is trying to murder Ian in revenge for the death of Dennis Rickman Jnr (Bleu Landau).", "* 2021: Sharon Beale (Letitia Dean) attempts to kill Ian Beale (Adam Woodyatt) by poisoning him."]}, {"page": "Danny Moon", "response": ["Off-screen, Danny begins working for Johnny to make amends for his actions. On New Year's Eve 2005, Johnny contacts Danny and orders him to murder Andy's best-friend Dennis Rickman (Nigel Harman) - who had severely beaten Johnny in retribution for killing Andy and threatening to harm Dennis' wife Sharon Watts (Letitia Dean). Returning to the Square that same night, Danny stabs Dennis in the chest and slips away unseen; Dennis ends up dying in Sharon's arms. He later reveals this to Jake, by showing him a video of the murder, on his mobile phone.Archived at Ghostarchive and the Wayback Machine:  Jake is later summoned to Scarlet, only to be greeted by Danny - who is there to look after things for Johnny during the latter's absence; Johnny has moved to Essex. Danny reveals his working relationship with Johnny. After hearing that his grandmother Nana (Hilda Braid) has died, he leaves again."]}, {"page": "Jake Moon", "response": ["Sometime later, Jake discovers Danny has been living in Johnny's mansion in Essex. He manages to locate Danny and tries to persuade him to return to Walford together, but Danny says Johnny's home is also his home now. Jake realizes Danny has become mentally unstable since his time away from Walford, and that Johnny is just using him to do his dirty work. Danny then reveals that he owes Johnny a favor, and in order to gain his approval, he had to do something. Danny then shows Jake a mobile phone recording of Andy's best-friend, Dennis Rickman (Nigel Harman), being stabbed to death on New Year's Eve 2005. Jake is shocked when he realizes Danny had killed Dennis on Johnny's orders. Jake confronts Danny for his recklessness, prompting the latter to threaten him with a pistol; the pair end up having a fight when Jack punches Danny, only for his younger brother to then knock him unconscious. Jake regains consciousness just as Sam's brothers Phil (Steve McFadden) and Grant (Ross Kemp) arrive to confront Johnny - seeking to bring him to justice for Dennis' murder as they had promised to their ex-lover Sharon (Letitia Dean), who recently married Dennis months before his death. However, Johnny ends up capturing the brothers and orders Danny to kill them. Danny prepares to kill Grant with a shotgun, but just as he is about to pull the trigger, Jake intervenes with Danny's pistol - which he dropped during the earlier struggle between them - and shoots his younger brother in a desperate attempt to stop him. Though he intended to wound Danny by shooting him in the arm or the leg, Jake had killed his brother when Grant confirms that Danny is dead. As Phil and Grant leave to confront Johnny again, Jake mourns the loss of his brother and proceeds to bury Danny in the woods with a spade - which he then uses to mark his grave. Jake then notices Johnny calling Danny on his phone, and answers the call - indirectly telling Johnny about Danny's death whilst also stating that Phil and Grant are still alive; Johnny would later get arrested for the murders of Andy and Dennis. Following Johnny's arrest, Jake takes his daughter Ruby (Louisa Lytton) back with him to Walford and looks after her."]}, {"page": "Angie Watts", "response": ["Despite being the loud and feisty lady of Walford, and having a close relationship with her beloved adoptive daughter Sharon (Letitia Dean), she doesn't have much real happiness during her time in Albert Square. Alcoholism claimed her life in April 2002 when she died of cirrhosis of the liver, 14 years after her last appearance.", "Alcoholic Angie shares a stormy marriage with her womanising husband, Den Watts (Leslie Grantham), and refuses to let him go even during their rockiest times. They run and live in The Queen Victoria public house on Albert Square. Angie and Den doted on their teenage adoptive daughter, Sharon (Letitia Dean) - who carries on loving them despite her resentment of Den's affairs and Angie's binge drinking. Angie is good at putting on a front for the customers, dressing to kill, screeching outrageously with the girls, but inside she is crippled with depression. Despite all her bravado, all she really wants is a happy marriage with Den, even though he treats her terribly and has endless affairs with other women.", "In 1988 Anita Dobson decided that she wanted to move on after three years playing Angie. She left in May 1988. Despite many alleged attempts at getting Dobson to reprise the role, she never accepted, commenting: \"Why tarnish the gorgeous creation that was Angie Watts?\". The character of Angie Watts was subsequently killed off-screen in 2002 (dying of a drink related illness) and brought home to be buried by her on-screen daughter Sharon in order to facilitate the  return of the actress Letitia Dean. In 2010, Dobson said she was glad her character was killed off, as it was unrealistic that the character would ever return."]}, {"page": "Sylvia Young Theatre School", "response": ["*Letitia Dean"]}, {"page": "Sam Mitchell (EastEnders)", "response": ["The character of Sam Mitchell was initially portrayed as a young, naive girl who had initially relied less upon her mother Peggy (Jo Warne/Barbara Windsor) than her two older brothers Phil (Steve McFadden) and Grant (Ross Kemp) - although she gradually evolved into becoming more flirty, headstrong, and charismatic, with a determination to be taken more seriously. During her time in the soap, Sam established a teen elopement with her first husband Ricky Butcher (Sid Owen); repeatedly clashed with his future spouse Bianca Jackson (Patsy Palmer) in light of the couple's divorce, and Sam thereafter sleeping with Bianca's father David Wicks (Michael French); had an unsuccessful relationship with Grant's nemesis Beppe di Marco (Michael Greco); slept with Phil's archenemy Steve Owen (Martin Kemp) without knowing that it was part of his intent to make his wife, Mel Healy (Tamzin Outhwaite) jealous; briefly dated Peggy's barman, Trevor Morgan (Alex Ferns), until she learned that he had been using this to antagonize her cousin Billy (Perry Fenwick); temporarily worked for her brothers' estranged lover Sharon Watts (Letitia Dean) and her half-brother Dennis Rickman (Nigel Harman); quarrelled with Phil's ex-wife Kate Morton (Jill Halfpenny); embarked on an ill-fated marriage with her community's gangland kingpin Andy Hunter (Michael Higgs); developed a conflict with Sharon and Dennis' family, the Watts, after their father Den (Leslie Grantham) blackmailed her lawyer Marcus Christie (Stephen Churchett) to con the Mitchells from their ownership of The Queen Victoria public house; feuded with Den's widow Chrissie (Tracy-Ann Oberman) after she incriminated both Sam and her friend, Zoe Slater (Michelle Ryan) for Den's murder; was manipulated by her uncle Archie (Larry Lamb) into unknowingly causing their family to lose their pub for a second time; got framed by her own family for Archie's murder; sparked a rivalry with his two daughters, Ronnie (Samantha Womack) and Roxy (Rita Simons), over the trio's separate romances with their common boyfriend Jack Branning (Scott Maslen); struggled to cope with motherhood after giving birth to Jack's baby, Ricky (Henri Charles); and attended her mother's funeral after losing her to cancer.", "Animosity between the Watts and Mitchell families escalates. Sam is left in charge of the Mitchell empire when her brother, Phil, goes on the run after escaping prison for an armed robbery – for which he has been set up for by Den. Sam persuades Billy to torch Phil's snooker club in an insurance scam, an act that results in Den's club burning down and his daughter Vicki (Scarlett Johnson) nearly perishing in the fire. Sam clashes with Sharon Watts (Letitia Dean) and Dennis vows revenge, and he is only warned off when his friend Andy Hunter (Michael Higgs), the square's gangland kingpin, begins a relationship with Sam. He manages to turn her against her allies, and she disowns Billy when he tries to convince her that Andy is after Phil's businesses. They soon marry in September 2004, despite Sam's crush Minty Peterson (Cliff Parisi) attempting to stop the wedding – he has fallen in love with Sam and knows that Andy is only using her to gain control of the Mitchell assets. Andy fools Sam into signing over control of Phil's house, and she is then conned out of all the Mitchell businesses by family lawyer Marcus Christie (Stephen Churchett) and Den. Marcus tells Sam that Phil wants her to sell everything and give the cash to him. She does so, selling her mother's public house, The Queen Victoria, for a vastly reduced price to Den. Marcus is lying, and once he has the Mitchells' money, he flees, leaving Sam with nothing. Andy, realising Sam is no use to him, throws her out of their house – leaving her penniless. A destitute Sam is later taken in by Minty.", "Whilst trying to move on from her marriage with Andy, with the couple clashing with each other on several occasions, Sam becomes determined to get revenge on Den; she teams up with his wife Chrissie (Tracy-Ann Oberman) and their neighbour Zoe Slater (Michelle Ryan) -  who herself had become a victim of Den as a result of her relationship with Dennis - to carry out their vengeful plot against Den. On the night of Den's wedding anniversary to his late wife Angie (Anita Dobson), the three women confront him at The Queen Vic shortly after he closes up. At first Den taunts Sam and her unlikely conspirators over their weakness, but it soon turns out that Den's adoptive daughter Sharon (Letitia Dean) was overhearing the whole conversation; Chrissie had planned for Sharon to return to Albert Square so that she can overhear Den admit to his misdeeds and disown him in response, thus ridding Den of the woman he devoted as his daughter – and henceforth exacting revenge upon Den for what he did. This works successfully, and Sam even congratulates Chrissie for getting payback on Den – telling her \"You're quite a bitch, ain't ya!\". However, shortly after Sharon leaves Walford, Den returns to The Queen Vic and the event takes an unexpected and violent turn: Den suddenly attacks Chrissie and Zoe hits him over the head with Pauline Fowler's (Wendy Richard) iron doorstop in defence, all the while Sam watches in shock. This is thought to have killed him; however, when Zoe and Sam leave the room, Den grabs Chrissie's ankle and she responds by hitting him on the head a second time – finally killing him. In the moment where Chrissie kills Den, however, Sam witnesses this and she later grows appalled when Chrissie allows Zoe to believe that her blow killed Den. As Chrissie has possession of The Queen Vic following Den's death, Sam blackmails her – threatening to unveil Chrissie as Den's killer unless she gives her the pub.", "Westbrook has said that the cast and crew became like a second family to her, with the roles in the soap mirroring their relationships off-screen. In her autobiography she comments, \"Sid [Owen] and I became very close [...] we were as thick as thieves. When we weren't shooting together we'd hang out [...] Once Sid and I got so bored hanging around on set that we decided to take the milk float for a spin around Albert Square, but Sid drove it too fast and turned it over [...] we couldn't stop laughing, but the producers didn't seem to share our amusement. We were seriously told off that day.\" She has described other actors like Michelle Gayle, Letitia Dean, Adam Woodyatt and Nick Berry like brothers and sisters, and has said she was very close to older cast members such as June Brown, Wendy Richard, Mike Reid and Gillian Taylforth. She has also revealed that her off-screen relationship with actors McFadden and Kemp mirrored her character's on-screen one: \"In the soap they were my older brothers, always looking out for me, making sure I didn't get into trouble, and off set they were exactly the same.\""]}, {"page": "EastEnders spin-offs", "response": ["Two songs from the show were released as singles. \"Every Loser Wins\" by Nick Berry (Simon Wicks) reached number one in the UK Singles Chart. \"Something Outa Nothing\" by Letitia Dean (Sharon Watts) and Paul Medford (Kelvin Carpenter) reached number 12. Both songs were featured in a storyline where the characters formed a band called The Banned."]}, {"page": "Phil Mitchell", "response": ["During his time on EastEnders, Phil's most prominent aspects include his battles with alcoholism; sparking numerous feuds; partaking in various criminal activities that sometimes lead to him getting arrested as a result; having occasional relationship problems; being embroiled in multiple family troubles; suffering from cirrhosis of the liver; and bonding with his two children Ben (Charlie Jones/Joshua Pascoe/Harry Reid/Max Bowden) and Louise (Rachel Cox/Brittany Papple/Tilly Keeper). His first major event was a popular love triangle storyline dubbed \"Sharongate\", wherein Phil had an affair with Grant's wife Sharon Watts (Letitia Dean) and was subsequently attacked by his brother when the truth was finally revealed; the episode where Grant discovered Phil's affair with Sharon had attracted 25.3 million viewers, thus standing out as a huge ratings winner because of it.", "Phil Mitchell first arrives in Walford to open an automobile repair shop, known as The Arches; he is joined by his younger brother Grant (Ross Kemp) Two years later, Phil goes into partnership at The Queen Victoria public house with Grant and his wife Sharon Watts (Letitia Dean) – up to the point where he moves in with them. Phil grows close to Sharon, who turns to him for comfort during Grant's violent outbursts. Sharon and Phil have sex but she stays with Grant, who is unaware of their betrayal. Sharon and Grant's reconciliation is brief, and amidst more rowing and physical violence, Grant is arrested and imprisoned. In his absence, Phil and Sharon continue their affair but when Grant is released, Sharon reconciles with him, leaving Phil heartbroken. On the rebound, Phil enters into a marriage of convenience with Nadia Borovac (Anna Barkan) - a Romanian refugee - enabling her to stay in Britain, with Nadia departing after the wedding.", "One of the most notable and popular early storylines involving Phil was a love triangle between him, his brother and his brother's wife Sharon (played by Letitia Dean). Despite the fact that Sharon was married to Grant, EastEnders writer Tony Jordan revealed in The Mitchells – The Full Story that the love-triangle storyline had been planned since Phil and Grant's introduction, after the writers decided Sharon was perfect for them both. This storyline was slow burning and spread over several years, providing a plethora of dramatic tension along the way. The episode in which Phil betrayed his brother with Sharon occurred in September 1992 in one of the soap's notorious three-handers. Things finally came to a head in 1994 with some of EastEnders most popular and renowned episodes, which were dubbed \"Sharongate\" – centred around Grant's discovery of the affair and his reaction. The repercussions of Phil's betrayal contributed to many subsequent storylines involving the Mitchell brothers during the 1990s. Sharongate has also proven a popular storyline with viewers and it was voted the sixth top soap opera moment of the decade in a poll of 17,000 people for What's on TV magazine."]}, {"page": "Sharongate", "response": ["\"Sharongate\" is the term used for a storyline in the BBC soap opera EastEnders, which reached its climax on 24 October 1994, attracting 25.3 million viewers. The plot was written by EastEnders scriptwriter Tony Jordan.\"EastEnders-style drama set for US\", The Guardian. URL. Retrieved 18 August 2007. In the storyline, Sharon Mitchell (Letitia Dean) confessed on tape that she had had sex with her husband's brother, Phil (Steve McFadden). The truth comes out in the middle of The Queen Victoria pub. Sharon's husband Grant (Ross Kemp) attacked his brother and Phil was lucky to survive.", "Sharon Watts (Letitia Dean) becomes part of the Mitchell family when she marries Grant Mitchell (Ross Kemp) in December 1991. But months later the couple begin rowing. Grant wants a wife who behaves like one, and Sharon refuses to comply. He also wants a baby but Sharon prefers to concentrate on making The Queen Victoria pub a success to honor her late father Den Watts (Leslie Grantham), The Vic's previous landlord. "]}, {"page": "Zoe Slater", "response": ["One of Zoe's subsequent major storylines was when she became romantically involved with local hardman Dennis Rickman (Nigel Harman), which soon ended after Zoe ended up being entrapped in an affair with Dennis' father Den Watts (Leslie Grantham) – though not before he pressured her into claiming that she is pregnant with Dennis' baby, as part of his last-ditch attempt to stop his devoted adopted daughter Sharon (Letitia Dean) from leaving Albert Square; Dennis and Sharon had embarked on a forbidden romance during the former's relationship with Zoe. When Zoe starts to worry that Dennis will discover her secret, Den persuades Zoe to sleep with him so she can get pregnant – up to the point where he blackmails her with the threat of exposing her secret to Dennis. Although Zoe is forced to relent to Den's blackmail, Dennis ends up seeing them in bed together and ends their relationship. Her final storyline revolved around Den's murder on the show's 20th anniversary episode, after Zoe conspired with his estranged wife Chrissie (Tracy-Ann Oberman) and their best-friend Sam Mitchell (Kim Medcalf) to get revenge on Den for the way how he victimized them during his antics. Their plan resulted in Zoe seemingly killing Den in The Queen Victoria public house after he attacked Chrissie; however, when Zoe left his corpse behind, Den regained consciousness until Chrissie ultimately killed him for good – shortly before Zoe reappeared in the room where he was murdered. Soon afterwards, Zoe leaves Walford for Ibiza after making amends with Kat and Dennis.", "Zoe gets engaged to Anthony Trueman (Nicholas Bailey), but leaves yet again, returning several months later, this time with Kelly in tow, and her engagement to Anthony is broken off. She briefly dates Dennis Rickman (Nigel Harman), but he is secretly in love with his adoptive half-sister Sharon Watts (Letitia Dean), and they eventually reveal their relationship. Sharon and Dennis' father Den Watts (Leslie Grantham) suggests that to keep Dennis, Zoe should claim she is pregnant, since Sharon is infertile. The plan works but Zoe worries Dennis will realise she is not pregnant, and he refuses to sleep with her. Den offers to sleep with her so she can get pregnant and pretend the baby is Dennis's. Dennis catches them in bed together and leaves, but not before telling Den's wife, Chrissie Watts (Tracy Ann Oberman)."]}, {"page": "Mel Owen", "response": ["Throughout her time on the show, especially since her 2018 return, when Mel became more of a villain, she has become somewhat more \"wicked\" and has a harder edge, when compared to her early appearances. In her second stint on the show, Mel was included in storylines such as working for crime boss Ciara Maguire (Denise McCormack); colluding with Phil against Ciara's ex-husband Aidan (Patrick Bergin); a relationship with Phil's rival Jack Branning (Scott Maslen); an engagement and marriage with former policeman Ray Kelly (Sean Mahon); covering up Ray's murder after he was shot dead by her son Hunter (Charlie Winter) for attempting to kill her; and trying to stop Hunter from going to prison and later harboring him when he escapes, which culminates with Hunter being shot dead by the police after he held her hostage and nearly shot Phil and Lisa's daughter Louise (Tilly Keeper) after shooting her brother Ben (Max Bowden). Following Hunter's death, Mel developed a feud with Phil's wife Sharon Mitchell (Letitia Dean) and blackmailed her after learning of her affair with Louise's boyfriend Keanu Taylor (Danny Walters). This concludes with Mel being involved in a high-speed car chase with Sharon upon attempting to expose her affair with Keanu to Phil, only to end up subjugated to a vehicle collision that results in Sharon rescuing Mel, before Mel is then killed after walking into the path of an incoming lorry.", "Mel returns to Walford as she is working for her sister-in-law, Ciara Maguire (Denise McCormack), to track down money and jewellery that was stolen from Ciara in a recent robbery that took place in the area, and Ciara is keeping Mel's son, Hunter Owen (Charlie Winter), from her until she finds the money. Mel eventually discovers that Sharon Mitchell (Letitia Dean) has the money and Mel double-crosses her so the money is returned and Mel is able to see Hunter again. Ciara does not have the full amount, so in retaliation, she tells Hunter that Steve died in a car explosion, not a heart attack as Mel claimed and that he was a villain who killed Saskia Duncan (Deborah Sheridan-Taylor). Mel is forced to tell Hunter that Steve  killed Saskia and that Steve framed Matthew Rose (Joe Absolom) and his death was a result of a car chase. Mel later compares Hunter to Steve and asks for them to start again. Mel decides to remain in Walford, accepting Sharon's offer to reopen the nightclub, which she agrees to name E20 in tribute to Steve to keep Hunter happy. Jack Branning (Scott Maslen) pursues Mel but Hunter sabotages Jack's car to prevent them going to France. Before the club's opening, Hunter finds out Phil was involved in Steve's death and Hunter blames Phil, so he has sex with Louise (now played by Tilly Keeper) in the office, knowing Phil will see it on CCTV. Phil is enraged and threatens to attack Hunter with a baseball bat but Mel seduces Phil and threatens to show Sharon the CCTV footage of their kiss to stop him from hurting Hunter. Mel and Jack argue after Mel tries to reunite Billy and Honey Mitchell (Emma Barton) by claiming that Billy has moved on. The argument leads to passion and Jack and Mel have sex. Ian decides he wants to marry Mel again and constantly tries to woo her, including offering Hunter a job at his restaurant. However, his efforts always go in vain.", "Producers created a storyline leading up to Mel’s departure, in that she became involved in the high-profile affair between characters Sharon Mitchell (Letitia Dean) and Keanu Taylor (Danny Walters) after Hunter's death. A feud between Sharon and Mel started in September 2019 and played out towards her departure. The feud has become popular by fans on social media such as Twitter. A trailer was released on 1 November 2019, further promoting the feud and a dramatic car chase between the pair, which mirrors the way Mel's husband, Steve, was indirectly killed by Sharon's husband, Phil in 2002. Mel was killed off on 14 November after a major stunt, involving Sharon."]}, {"page": "Steve Owen (EastEnders)", "response": ["Although Steve is relieved that Mel has been unharmed throughout her ordeal with Dan, she later confronts her husband about all the things that Dan told her while he was holding her captive; Mel had learned from Dan that Steve had cheated on her amid the events of his mother's funeral, as he slept with a blonde woman named Karen – which Billy later found out about and was forced to tell Dan when the latter had extorted leverage from him against Steve and Phil. Furthermore, she discovers that Steve had secretly bought the pub from Phil's ex-lover Sharon Watts (Letitia Dean) without ever consulting to his wife about it. When Steve is unable to assert her suspicions, he is forced to admit his lies to Mel and the two get into a heated argument when she confronts him about it. Steve attempts to use his mother's death as an excuse, but Mel points out his callousness in reaction to her death and threatens to divorce him. She also accuses Steve of shooting Phil and framing Dan for the crime, having already realized that Dan was telling the truth about his innocence behind Phil's shooting. In his subsequent rebuttal, Steve tells Mel that she still owns half of the E20 and further states that he just bankrupted himself by paying Dan the ransom money he demanded from him and Phil. Later that evening, Steve approaches Phil to seek help with providing him by reinstating his share of The Queen Vic; Phil refuses and Steve promises that he will pay for crossing him before leaving the pub. At the same time, Mel goes to see Billy at the E20 to know more about Steve's affair with Karen. He unsuccessfully tries to vouch for Steve's innocence and ends up giving Mel an unintended contraction about her ownership of the E20. When she promptly questions Billy about this, Mel discovers from her husband's safe that Steve had actually settled earlier paperwork where he owns the entire nightclub – thus meaning that Steve had lied to his wife once again. Outraged by the extent of Steve's deception, Mel retaliates against her husband by burning down his club and then chucking her wedding ring at Steve; she then departs Walford to clear her mind over Steve's deceit and lies."]}, {"page": "Grant Mitchell (EastEnders)", "response": ["Throughout the course of his 1990s duration, Grant established himself as one of the show's most prominent characters. He was portrayed as a tough persona, wildly known for his fiery temper and his tendency to resort to violence. Despite this, however, his family is important to him – particularly his relationship with his older brother Phil (Steve McFadden). Known as the \"Mitchell brothers\", Grant and Phil have become household names in the United Kingdom – due to their association with the stereotypical black leather jacket wearing bald and brutal thug. They have been parodied even in adverts where their gruff, tough talking, cockney accents have been impersonated. One of EastEnders most popular and highly rated storylines was \"Sharongate\", where Grant discovers that his wife Sharon Watts (Letitia Dean) has been having an affair with his brother. In light of this iconic revelation, Grant attacked Phil and exacted revenge on Sharon until she departed the programme following her betrayal. Grant then went on to embark on a second marriage with local barmaid Tiffany Raymond (Martine McCutcheon), up to the point where she gave birth to their daughter – Courtney. However, their marriage ended in tragedy when Grant's prolonging mistreatment towards Tiffany ultimately led to her being accidentally killed by his would-be stepfather Frank Butcher (Mike Reid).", "Grant Mitchell first arrived in Albert Square with his older brother Phil (Steve McFadden), and the pair become co-owners of the local garage – The Arches. Grant had returned from being a paratrooper in the Army who served in the Falklands War. After a brief fling with Julie Cooper (Louise Plowright) and getting involved in various dodgy deals, Grant starts wooing the local barmaid – Sharon Watts (Letitia Dean). She grows attracted to his machismo, and soon their flirting progresses into a relationship. Fiercely protective of his girlfriend, most of Grant's initial problems in the Square revolve around his over-possessive nature and jealousy. He puts Sharon's boss Eddie Royle (Michael Melia), the landlord of The Queen Victoria public house, in hospital after he makes a pass at Sharon; he later becomes prime suspect for Royle's murder, but is proven innocent when the killer is revealed to be Nick Cotton (John Altman) – a local thug who eventually owns up to the crime. In the wake of this, Grant decides to re-enlist in the army; however, he is left despondent after getting rejected for failing their psychiatric tests.", "One of the most notable and popular early storylines involving Grant was a love triangle between him, his brother and his wife Sharon (played by Letitia Dean). Despite the fact that Sharon married Grant initially, EastEnders writer Tony Jordan has revealed in The Mitchells – The Full Story that the love-triangle storyline had been planned since Phil and Grant's introduction, after the writers came to the realisation that Sharon was perfect for them both.\"Mitchells Special\", BBC. URL last accessed on 18 September 2006. This storyline was slow burning and was spread over several years, providing a plethora of dramatic tension along the way. The episode in which Phil betrayed his brother with Sharon occurred in September 1992 in one of the soap's notorious three-handers. Sue Dunderdale directed the episodes and the performances of McFadden, Kemp and Dean have been described as memorable and filled with high-tension drama. Things finally came to a head in 1994 with some of EastEnders' most popular and renowned episodes, which have been dubbed \"Sharongate\".\"Sharongate \", BBC. URL last accessed on 18 September 2006. The episodes — which were watched by 25.3 million viewers\"Profiles: EastEnders Kemp and McFadden\", BBC. URL last accessed on 18 September 2006. — centred around Grant's discovery of the affair and his startling reaction. The repercussions of Phil's betrayal contributed to many subsequent storylines involving the brothers throughout the 1990s. Writer of Sharongate, Tony Jordan, has stated that of all the storylines he has penned for the soap, Sharongate is the one he is most proud of. He comments \"Three of the strongest characters that have ever been in EastEnders are the Mitchell brothers and Sharon... when we actually blew that story it was incredible... being able to reach that many people with your work is what makes EastEnders exciting.\"\"Tony Jordan interview\", youtube. URL last accessed on 24 February 2007. Sharongate has also proven a popular storyline with viewers and it was voted the sixth top soap opera moment of the decade in a poll of 17,000 people for What's On TV magazine."]}, {"page": "Vicki Fowler", "response": ["16-year-old Michelle Fowler gets pregnant in 1985 after a one-night stand with her best friend Sharon's (Letitia Dean) father, Den Watts (Leslie Grantham). Her family decide Michelle should have an abortion but she refuses, keeping the baby but keeping the father's name a secret. Vicki, named in honour of her great-grandparents Lou Beale (Anna Wing) and Lou's late husband Albert, is born in 1986 and Den is allowed to hold her but he and Michelle agree that he should keep his distance so nobody guesses he is her father. Michelle raises Vicki with her fiancé, Lofty Holloway (Tom Watt), who she marries after jilting him at the altar, although Den provides for Vicki secretly. After Sue Osman (Sandy Ratcliff) realises that she has had a phantom pregnancy, she is devastated and suggests to Michelle that she lets her and Ali Osman (Nejdet Salih) adopt Vicki, which infuriates Michelle. Vicki's grandmother, Pauline Fowler (Wendy Richard), realises Den is Vicki's father when she sees him give money to Michelle and slaps him. Lofty begins to pressure Michelle to let him adopt Vicki and have another child, but their marriage soon breaks down after Michelle has an abortion and Michelle refuses to name Vicki's father upon Lofty's departure. When Den is shot and presumed dead, Michelle tells Sharon that Vicki is her half-sister and Sharon is devastated whilst Arthur is furious. Vicki survives meningitis but Dr Legg (Leonard Fenton) fails to diagnose it, reuniting Michelle and Sharon.", "Baby Emma Henry originated the role and played Vicki until 1988, when her parents moved to Scotland. The role was recast to Samantha Leigh Martin, who learned to call Susan Tully \"Mummy Shell\" and referred to Letitia Dean who played her mum's best friend, \"Daddy Sharon\". Tully has commented, \"What's lovely about working with Samantha is that she's always happy. When it comes to work, she knows it's playing a pretend game, she knows my real name but she knows to call me 'Mummy Shell' when the cameras are running. If she isn't involved for a couple of weeks, I like to visit her at home, so she's always relaxed with me.\" Tully worried about this when it came to filming scenes in 1989 where Vicki contracted meningitis and was hospitalised and placed in an incubator with tubes attached to her body. Tully said, \"[Samantha] has seen me in all kinds of situations but I didn't know how she'd cope if I cried over her\". At Tully's suggestion, the BBC built a hospital room with minimal equipment and a consultant was present to make sure the BBC had the details correct and that neither the viewers or Samantha would be too distressed. Tully insisted that the child was not present when she had to film scenes of Michelle sobbing over the incubator.", "In August 2004, the BBC announced that Johnson had decided to quit her role as Vicki. She commented, \"I've had a really good two years, enjoyed all the experiences but it's time to move on\". Johnson filmed her final scenes in October and her departure coincided with that of Vicki's half-sister, Sharon (Letitia Dean).  Vicki departed on the Christmas Day episode of 2004. 12.3 million viewers watched the episodes that involved the Watts family's disbandment. Media reports claimed that there were plans to bring Vicki back the following year, played by a new actress; this proved to be false. Her character was notably absent at the funerals of Vicki's father Den in September 2005, her brother Dennis in January 2006, and her grandmother Pauline in January 2007."]}, {"page": "You Bet!", "response": ["|Letitia Dean"]}, {"page": "EastEnders theme tune", "response": ["| 17 || 2 September 1993|| Sharon Watts (Letitia Dean), Grant Mitchell (Ross Kemp) and Phil Mitchell (Steve McFadden), Kathy Beale (Gillian Taylforth), Frank Butcher (Mike Reid) and Pat Butcher (Pam St Clement) start their journey home from France after visiting Frank's pregnant daughter Diane Butcher (Sophie Lawrence). Sharon watches on as Phil and Kathy embrace.", "|2 September 1993|| Sharon Watts (Letitia Dean), Grant Mitchell (Ross Kemp), Phil Mitchell (Steve McFadden), Kathy Beale (Gillian Taylforth), Frank Butcher (Mike Reid) and Pat Butcher (Pam St Clement) start their journey home from France after visiting Frank's pregnant daughter Diane Butcher (Sophie Lawrence). Sharon watches on as Phil and Kathy embrace. A segment from the full 1993 theme was used to act as Julia's theme."]}, {"page": "Gemma Atkinson", "response": ["Atkinson appeared in the West End production of Tim Firth's Calendar Girls at the Noël Coward Theatre, from 28 July to 17 October 2009 where she played the character of Elaine. Atkinson also went on tour with Calendar Girls, she played Celia aka Miss September in the production. The January to April 2010 tour of Calendar Girls also starred Lynda Bellingham, Judith Barker, Debbie Chazen, Letitia Dean and Jan Harvey."]}]}}