{"wiki_id": "http://www.wikidata.org/entity/Q4352362", "itemLabel": "A. P. Herbert", "itemDescription": "British politician (1890-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/A._P._Herbert", "wikipedia_page": {"main": "Sir Alan Patrick Herbert CH (A. P. Herbert, 24 September 1890 – 11 November 1971), was an English humorist, novelist, playwright, law reformist, and in 1935–1950 an Independent Member of Parliament for Oxford University. Born in Ashtead, Surrey, he attended Winchester College and New College, Oxford, receiving a starred first in jurisprudence in 1914. He joined the Royal Naval Volunteer Reserve as a seaman in the First World War, becoming an officer in the Royal Naval Division. He fought in Gallipoli and on the Western Front, as a battalion adjutant in 1917, before injury removed him from the front line. After the war he published The Secret Battle and in 1924 joined the staff of Punch. As an MP he campaigned for private-member rights, piloted the Matrimonial Causes Act 1937 through Parliament, opposed Entertainments Duty and campaigned against the Oxford Group. He joined the River Emergency Service in 1938, captaining a boat on the River Thames in the Second World War as a petty officer in the Royal Naval Auxiliary Patrol. In 1943, he joined a parliamentary commission on the future of the Dominion of Newfoundland.", "link_mentions": [{"page": "September 24", "response": ["*  1890   – A. P. Herbert, English author and playwright (d. 1971)"]}, {"page": "1890", "response": ["* September 24 – A. P. Herbert, English humorist, novelist, playwright and law reform activist (d. 1971)"]}, {"page": "1971", "response": ["* November 11 – A. P. Herbert, English humorist, novelist and politician (b. 1890)"]}, {"page": "The Mikado", "response": ["Modern productions update some of the words and phrases in The Mikado.  For example, two songs in the opera use the word \"nigger\". In \"As some day it may happen\", often called the \"list song\", Ko-Ko names \"the nigger serenader and the others of his race\". In the Mikado's song, \"A more humane Mikado\", the lady who modifies her appearance excessively is to be punished by being \"blacked like a nigger with permanent walnut juice\".Gilbert (1992) p. 41, note 1 These references are to white performers in blackface minstrel shows, a popular entertainment in the Victorian era, rather than to dark-skinned people.Gilbert (1992), p. 9, note 1 Until well into the 20th century, audiences did not consider the word \"nigger\" offensive.Pullum, Geoffrey. \"The Politics of Taboo Words\" , The Chronicle of Higher Education, 19 May 2014 Audience members objected to the word during the D'Oyly Carte Opera Company's 1948 American tour, however, and Rupert D'Oyly Carte asked A. P. Herbert to supply revised wording. These alterations have been incorporated into the opera's libretto and score since then.Bradley (1996) p. 572.In Ko-ko's song the nigger serenader became \"the banjo serenader\" (Dover, p. 9; and Green, p. 416) and the Mikado's punishment for the lady was to be \"painted with vigour\" (Bradley (1996) p. 623; and Green p. 435)."]}, {"page": "Pomp and Circumstance Marches", "response": ["In World War II, No. 4 also acquired words: a patriotic poem by A. P. Herbert with the refrain beginning \"All men must be free\" was used as \"Song of Liberty\"."]}, {"page": "University constituency", "response": ["The humorist and law reform activist A. P. Herbert sat as an independent member for Oxford University from 1935 to 1950. He described the counting of the votes at the 1935 election in a chapter entitled 'P.R.': Or, Standing for Oxford in his 1936 book Mild and Bitter."]}, {"page": "Rupert Hart-Davis", "response": ["From 1957 to 1969, Hart-Davis was chairman of the London Library.  During this period, a financial crisis arose when Westminster City Council decided that the library should no longer qualify for a charitable exemption from local property tax. Hart-Davis organised fund-raising on a grand scale, including an auction, with E. M. Forster offering the manuscript of A Passage to India, and T. S. Eliot, a duplicate manuscript of The Waste Land. Hart-Davis was also secretary of The Literary Society and a member of A. P. Herbert's committee on censorship.Hart-Davis, Volume 4, letter of 20 December 1958"]}, {"page": "Alastair Sim", "response": ["On television, Sim's best remembered performance was probably as Mr Justice Swallow in the comedy series Misleading Cases (1967–71), written by A. P. Herbert, with Roy Dotrice as the litigious Mr Haddock over whose court cases Swallow presided with benign shrewdness.Simpson, p. 172 Sim returned to the cinema in 1971 as the voice of Scrooge in an animated adaptation of A Christmas Carol. The following year he appeared as the Bishop in Peter Medak's The Ruling Class (1972) with Peter O'Toole, and in 1975 he played a cameo in Richard Lester's Royal Flash (1975) with Malcolm McDowell.\"The Ruling Class\" and \"Royal Flash\", British Film Institute,  retrieved 13 July 2014 After playing Lord Harrogate in the 1976 Disney film Escape from the Dark, his last role was as the Earl in the 1976 remake of Rogue Male opposite Peter O'Toole, a role for which he literally climbed out of his sick bed, saying, \"Peter needs me.\""]}, {"page": "1947 in music", "response": ["*  Bless the Bride (Vivian Ellis and A. P. Herbert) – London production opened at the Adelphi Theatre on April 26 and ran for 886 performances. Starring Georges Guétary, Lizbeth Webb, Anona Winn and Brian Reece. Features \"I Was Never Kissed Before\", \"Ma Belle Marguerite\" and \"This Is My Lovely Day\""]}, {"page": "Stephen Leacock", "response": ["* \"Professor Leacock has made more people laugh with the written word than any other living author. One may say he is one of the greatest jesters, the greatest humorist of the age.\" — A. P. Herbert"]}, {"page": "Ashtead", "response": ["* A. P. Herbert (1890-1971) writer and politician"]}, {"page": "1919 in literature", "response": ["*A. P. Herbert – The Secret Battle"]}, {"page": "1921 in literature", "response": ["*A. P. Herbert – The House by the River"]}, {"page": "1930 in literature", "response": ["*A. P. Herbert – The Water Gipsies"]}, {"page": "1951 in literature", "response": ["* A. P. Herbert – Number Nine"]}, {"page": "1971 in literature", "response": ["*November 11 – A. P. Herbert, English humorist, novelist and politician (born 1890)"]}, {"page": "1958 in literature", "response": ["* A. P. Herbert – Made for Man"]}, {"page": "1890 in literature", "response": ["*September 24 – A. P. Herbert, English humorist and novelist (died 1971)"]}, {"page": "Londonderry Air", "response": ["* A. P. Herbert's poem \"Let Us Be Glad\", written for the conclusion of the 1948 Summer Olympics, and sung at the end of the event, used the melody.Hampton, Janie (2008). The Austerity Olympics. Aurum Press."]}, {"page": "Reasonable person", "response": ["Though the use of the reasonable woman standard has gained traction in some areas of the law, the standard has not escaped the crosshairs of humorists. In 1924, legal humorist A. P. Herbert considered the concept of the reasonable man at length in the fictional case of \"Fardell v. Potts.\" In Herbert's fictional account, the judge addressed the lack of a reasonable woman standard in the common law, and ultimately concluded that \"a reasonable woman does not exist.\""]}, {"page": "Nigel Playfair", "response": ["In 1920 Playfair returned to the role of Ralph in The Knight of the Burning Pestle. Over the next twelve years he produced and acted in a wide range of plays. Classics included The Way of the World (1924), The Duenna (1924), The Rivals (1925), The Beaux' Stratagem (1927) She Stoops to Conquer (1928) and The Critic (1928). Playfair interspersed the classics with new musical shows with scores by Dennis Arundell, Thomas Dunhill and  Alfred Reynolds and words by himself, A. P. Herbert and others: Riverside Nights (1926), Tantivy Towers (1931) and Derby Day (1932). The Times commented that these shows demonstrated that Playfair's \"special method – a mingling of intimacy, brightness, and burlesque – was not applicable to the classics alone\". Sharp writes that Playfair gathered \"a loyal and happy team of young players, musicians, and designers who, under his genial leadership, not only began to make their reputations and confirm his, but also helped to create a specific Lyric style\"."]}, {"page": "List of musicals: A to L", "response": ["| A. P. Herbert"]}, {"page": "63rd (Royal Naval) Division", "response": ["On 17 October, just before the Battle of the Ancre, Paris was wounded and replaced by Major-General Cameron Shute. Shute was appalled by the un-military \"nautical\" traditions of the division and made numerous unpopular attempts to stamp out negligent hygiene practices and failures to ensure that weapons were kept clean. Following a particularly critical inspection of the trenches, Sub-Lieutenant A. P. Herbert (later a humorist, legal satirist and Member of Parliament), wrote"]}, {"page": "Stephen Pound", "response": ["His father, Pelham Pendennis Pound (1922–1999) was a BBC sub-editor and former journalist (including for the News of the World and Daily Mirror) and literary agent whose clients included the osteopath Stephen Ward. When Ward was arrested for his role in the Profumo affair it was at Pound's home and Pound claims he had a minor role in the events leading to Ward's suicide. Pound's grandfather, Reginald Pound (1894–1991) F.R.S.L. was a journalist and biographer (including of Lord Northcliffe and A. P. Herbert), employed by, amongst others, the Daily Express and Strand Magazine (editor 1942–46).http://btckstorage.blob.core.windows.net/site15733/Web%20M/M%202017%20Reginald%20POUNDv2.pdf – source: The Times, 28 May 1991https://trove.nla.gov.au/work/56115701?q&versionId=69094961"]}, {"page": "List of political families in the United Kingdom", "response": ["*A. P. Herbert (1890–1971), MP 1935–1950."]}, {"page": "Liberty (advocacy group)", "response": ["The immediate spur to the organisation's formation was the National Hunger March of 1932. The first Secretary was Ronald Kidd, and first President was the novelist E. M. Forster; Vice-Presidents were the politician and author A. P. Herbert and the journalist Kingsley Martin of the New Statesman. H. G. Wells, Lewis Clive, Vera Brittain, Clement Attlee, Rebecca West, Edith Summerskill and Harold Laski were also founder members.Dyson, Brian (1994): Liberty in Britain 1934–1994: a diamond jubilee history of the National Council for Civil Liberties. Civil Liberties Trust."]}, {"page": "Eric Coates", "response": ["Coates was a director of the Performing Right Society, which he represented at international conferences after the war in company with William Walton, A. P. Herbert and others.Payne, p. 17 His autobiography, Suite in Four Movements, was published in 1953. The following year one of his last works became one of his best known. A march theme occurred to him, and he wrote it out and scored it with no particular end in view. Within days the producers of a forthcoming film, The Dam Busters, asked Coates's publishers if he would be willing to provide a march for the film. The new piece was incorporated in the soundtrack and was a considerable success. In a 2003 study of the music for war films, Stuart Jeffries commented that the closing credits of The Dam Busters, with the march as a valedictory anthem, would make later composers of such music despair of matching it.Jeffries, Stuart. \"Listen with prejudice\", The Guardian, 31 January 2003, p. B14"]}, {"page": "Dolphin Square", "response": ["A. P. Herbert, writing in Dolphin Square (a promotional booklet produced for Costains in 1935, with illustrations by H. M. Bateman) described the Square as \"a city of 1,250 flats, each enjoying at the same time most of the advantages of the separate house and the big communal dwelling place\". The provision of a restaurant made him fear that \"fortunate wives will not have enough to do. A little drudgery is good for wives, perhaps. The Dolphin lady may be spoiled\". On purchasing the site, Costain remarked to a colleague: \"in two or three years we'll either drive up to this spot in a Rolls-Royce, or we'll be standing here selling matches\"."]}, {"page": "Robert Aickman", "response": ["The IWA organised successful campaigns and attracted notable supporters, including as president the writer and parliamentarian Sir A. P. Herbert and as vice-president the naturalist Peter Scott. Scott's wife, Elizabeth Jane Howard, was part-time secretary, working in Aickman's flat in Gower Street; she had an affair with Aickman, which she describes in her autobiography Slipstream (Macmillan, 2002)."]}, {"page": "Poems of Today", "response": ["Lascelles Abercrombie - J. Redwood Anderson - W. H. Auden - George Barker - Julian Bell - Laurence Binyon - Edmund Blunden - Cicely Boas - Guy Boas - Lilian Bowes Lyon - A. C. Boyd - Robert Bridges - Hilton Brown - Roy Campbell - G. M. Cookson - Frances Cornford - W. H. Davies - Cecil Day-Lewis - Walter De la Mare - John Drinkwater - Clifford Dyment - Richard Eberhart - Robin Flower - John Freeman - John Gawsworth - Wilfrid Gibson - Lord Gorell - C. L. Graves - I. Sutherland Groom - Thomas Hardy - Phyllis Hartnoll - Christopher Hassall - A. P. Herbert - Gerard Manley Hopkins - E. V. Knox - D. H. Lawrence - John Lehmann - F. L. Lucas - Louis MacNeice - Charles Madge - John Masefield - Huw Menai - E. H. W. Meyerstein - Harold Monro - Edwin Muir - Seán O'Casey - Wilfred Owen - Herbert E. Palmer - Ruth Pitter - Frederic Prokosch - John Pudney - Herbert Read - James Reeves - Michael Roberts - V. Sackville-West - Siegfried Sassoon - Geoffrey Scott - Edith Sitwell - Osbert Sitwell - Stephen Spender - L. A. G. Strong - Jan Struther - Dorothy Margaret Stuart - A. S. J. Tessimond - Dylan Thomas - W. J. Turner - James Walker - Rex Warner - Dorothy Wellesley - Laurence Whistler - Humbert Wolfe - W. B. Yeats - Andrew Young"]}, {"page": "Roy Dotrice", "response": ["In the 1970s Dotrice played the title role in the television mini-series Dickens of London. He also appeared as Albert Haddock in the BBC television adaptation of A. P. Herbert's Misleading Cases in 1971. In 1972 he played the Curé Ponosse in the BBC2 TV adaptation of Clochemerle (1972)."]}, {"page": "Up the Line to Death", "response": ["Richard Aldington - Martin Armstrong - Herbert Asquith - Maurice Baring - Leonard Barnes - Paul Bewsher - Laurence Binyon - John Peale Bishop - Edmund Blunden - Rupert Brooke - Leslie Coulson - E. E. Cummings - Jeffery Day - Geoffrey Dearmer - John Drinkwater - Lord Dunsany - J. Griffyth Fairfax - Gilbert Frankau - John Freeman - Crosbie Garstin - Wilfrid Gibson - Robert Graves - Julian Grenfell - Wyn Griffith - Thomas Hardy - F. W. Harvey - A. P. Herbert - W. N. Hodgson - A. E. Housman - Philip Johnstone - David Jones - T. M. Kettle - Rudyard Kipling - Francis Ledwidge - P. H. B. Lyon - D. S. MacColl - John McCrae - Patrick MacGill - E. A. Mackintosh - R. B. Marriott-Watson - A. A. Milne - Harold Monro - Sir Henry Newbolt - Robert Nichols - Wilfred Owen - Nowell Oxland - Robert Palmer - Max Plowman - Herbert Read - Edgell Rickword - Isaac Rosenberg - Siegfried Sassoon - R. H. Sauter - Alan Seeger - Robert W. Service - Edward Shanks - Patrick Shaw-Stewart - Osbert Sitwell - C. H. Sorley - Edward de Stein - E. W. Tennant - Edward Thomas - Edward Thompson - W. J. Turner - R. E. Vernède - Alec Waugh - Willoughby Weaving - I. A. Williams - T. P. Cameron Wilson - W. B. Yeats - E. Hilton Young - Francis Brett Young"]}, {"page": "Savage Club", "response": ["*A. P. Herbert"]}, {"page": "Clean hands", "response": ["Clean hands, sometimes called the clean hands doctrine, unclean hands doctrine, or dirty hands doctrine, is an equitable defense in which the defendant argues that the plaintiff is not entitled to obtain an equitable remedy because the plaintiff is acting unethically or has acted in bad faith with respect to the subject of the complaint—that is, with \"unclean hands\". The defendant has the burden of proof to show the plaintiff is not acting in good faith. The doctrine is often stated as \"those seeking equity must do equity\" or \"equity must come with clean hands\". This is a matter of protocol, characterised by A. P. Herbert in Uncommon Law by his fictional Judge Mildew saying (as Herbert says, \"less elegantly\"), \"A dirty dog will not have justice by the court\"."]}, {"page": "APH", "response": ["* A. P. Herbert, a British writer"]}, {"page": "Obscene Publications Act 1959", "response": ["The committee's proposals were published in March 1958, and a new bill was introduced under the Ten Minute Rule, failing to gain the requisite support. After A. P. Herbert stood for Parliament on a platform of obscenity reform, the Home Office had a change of heart and introduced a new bill through Roy Jenkins in 1959,Williams (1960) p.287 a compromise between the aims of the campaigners and the goals of the Home Office.Lord (2005) p.106 It was introduced to the House of Lords by Lord Birkett,Wade (1959) p.180 received the Royal Assent on 29 July 1959, and came into force on 29 August 1959 as the Obscene Publications Act 1959."]}]}}