{"wiki_id": "http://www.wikidata.org/entity/Q435182", "itemLabel": "Prince George, Duke of Cambridge", "itemDescription": "British prince and military commander (1819-1904)", "wikipedia_url": "https://en.wikipedia.org/wiki/Prince_George,_Duke_of_Cambridge", "wikipedia_page": {"main": "Prince George, Duke of Cambridge (George William Frederick Charles; 26 March 1819 – 17 March 1904) was a member of the British royal family, a male-line grandson of George III and cousin of Queen Victoria. The Duke was an army officer by profession and served as Commander-in-Chief of the Forces (military head of the British Army) from 1856 to 1895. He became Duke of Cambridge in 1850 and field marshal in 1862.  Deeply devoted to the old Army, he worked with Queen Victoria to defeat or minimise every reform proposal, such as setting up a general staff. His Army became a moribund and stagnant institution. Its weaknesses were dramatically revealed by the poor organisation at the start of the Second Boer War.", "link_mentions": [{"page": "King's Royal Rifle Corps", "response": ["The 1st Cadet Battalion owes its foundation to the Reverend Freeman Wills, who was commissioned into the Volunteer Army in the rank of captain on 26 July 1890. He was also Vicar of St Agatha's just behind Sun Street, Finsbury Square. On receiving his commission he decided to form a cadet company within the 1st Cadet Battalion, the Royal West Surrey Regiment. The Company quickly expanded to become the 2nd Cadet Battalion, the Royal West Surrey Regiment, at which point he moved the battalion headquarters to No. 2 Finsbury Square (and in 1904 to 42 Sun Street, which he had specially built for the purpose). In 1894 he applied to Prince George, Duke of Cambridge, Colonel-in-Chief, to affiliate to the Regiment, with the title of 1st Cadet Battalion, the King's Royal Rifle Corps. Consent was granted on 8 November 1894 and the Battalion has remained a part of the Regiment ever since."]}, {"page": "1904", "response": ["* March 17 – Prince George, Duke of Cambridge, grandson of King George III (born 1819)"]}, {"page": "Waterloo & City line", "response": ["After everything was ready, and the Board of Trade inspecting officer passed the line as fit, Prince George, Duke of Cambridge formally opened the line on 11 July 1898. About 400 persons travelled from Waterloo to the City station and immediately back to Waterloo."]}, {"page": "Kensal Green", "response": ["Kensal Green Cemetery is the first of the ‘Magnificent Seven’ cemeteries in London. It is the resting place of members of the royal family, including Prince George, Duke of Cambridge, and scores of figures in history including Isambard Kingdom Brunel, Charles Babbage, William Makepeace Thackeray, Anthony Trollope and William Cavendish-Scott-Bentinck, 5th Duke of Portland. Architects who are buried at Kensal Green include Decimus Burton, Philip Charles Hardwick and John Shaw Jr., as well as Nobel Prize-winning playwright Harold Pinter."]}, {"page": "Whitehall", "response": ["Whitehall is also home to six other monuments. From north to south, these are of Prince George, Duke of Cambridge (Commander-in-Chief of the British Army), Liberal Party, Liberal Unionist Party and Unionists leader Spencer Cavendish, 8th Duke of Devonshire, Douglas Haig, 1st Earl Haig (known as the Earl Haig Memorial), Field Marshal Montgomery (commander of the 8th Army, the 21st Army Group and Chief of the Imperial General Staff), William Slim, 1st Viscount Slim, Commander of the 14th Army and Governor-General of Australia, and Alan Brooke, 1st Viscount Alanbrooke, Chief of the Imperial General Staff."]}, {"page": "Battle of Inkerman", "response": ["General Peter A Dannenberg took command of the Russian Army, and together with the uncommitted 9,000 men from the initial attacks, launched an assault on the British positions on Home Hill, held by the Second Division. The Guards Brigade of the First Division (The Highland Brigade was guarding Balaclava), and the Fourth Division were already marching to support the Second Division, but the British troops holding the Barrier withdrew, before it was re-taken by men from the 21st, 63rd Regiments and The Rifle Brigade. This position remained in British hands for the rest of the battle, despite determined attempts to take it back. The Russians launched 7,000 men against the Sandbag Battery, which was defended by 2,000 British soldiers. So began a ferocious struggle which saw the battery change hands repeatedly. The division commander Prince George, Duke of Cambridge, had a horse shot under him, and he found himself with around 100 men, the rest pushing down the slope. He was nearly cut off by another advancing Russian column, but he and his aide managed to get back."]}, {"page": "Prince Albert Victor, Duke of Clarence and Avondale", "response": ["He was christened Albert Victor Christian Edward in the private chapel of Buckingham Palace on 10 March 1864 by the Archbishop of Canterbury, Charles Longley, but was known informally as \"Eddy\". His godparents were Queen Victoria (his paternal grandmother), King Christian IX of Denmark (his maternal grandfather, represented by his brother Prince John of Schleswig-Holstein-Sonderburg-Glücksburg), King Leopold I of Belgium (his great great-uncle), the Dowager Duchess of Schleswig-Holstein-Sonderburg-Glücksburg (his maternal great-grandmother, for whom the Duchess of Cambridge stood proxy), the Duchess of Saxe-Coburg and Gotha (his great-aunt by marriage, for whom the Grand Duchess of Mecklenburg-Strelitz stood proxy), the Landgrave of Hesse (his maternal great-grandfather, for whom Prince George, Duke of Cambridge, stood proxy), the Crown Princess of Prussia (his paternal aunt, for whom Princess Helena, her sister, stood proxy) and Prince Alfred (his paternal uncle).Demoskoff, Yvonne (27 December 2005). \"Yvonne's Royalty Home Page: Royal Christenings\" . Accessed 1 May 2010.", "One of Albert Victor's instructors said he learnt by listening rather than reading or writing and had no difficulty remembering information,Major Miles quoted in Aronson, p. 81, Cook, p. 123 and Harrison, p. 92. but Prince George, Duke of Cambridge, had a less favourable opinion of him, calling him \"an inveterate and incurable dawdler\".Harrison, p. 90. Princess Augusta of Cambridge was also dismissive, calling him: \"si peu de chose\".Hitchens, Christopher (8 November 1990). \"How's The Vampire\". London Review of Books. Volume 12, issue 21, p. 12."]}, {"page": "Kensal Green Cemetery", "response": ["*Prince George, Duke of Cambridge, grandson of George III and commander-in-chief of the British Army"]}, {"page": "Edward Watkin", "response": ["Watkin started his tunnel works with the South Eastern Railway in 1880–81. Digging began at Shakespeare Cliff between Folkestone and Dover and reached a length of . The project was highly controversial and fears grew of the tunnel being used as a route for a possible French invasion of Great Britain; notable opponents of the project were the War Office Scientific Committee, Lord Wolseley and Prince George, Duke of Cambridge; Queen Victoria reportedly found the tunnel scheme \"objectionable\". Watkin was skilled at public relations and attempted to garner political support for his project, inviting such high-profile guests as the Prince and Princess of Wales, Liberal Party Leader William Gladstone and the Archbishop of Canterbury to submarine champagne receptions in the tunnel. In spite of his attempts at winning support, his tunnel project was blocked by parliament then cancelled in the interests of national security. The original entrance to Watkin's tunnel works remains in the cliff face but is now closed for safety reasons."]}]}}