{"wiki_id": "http://www.wikidata.org/entity/Q4352482", "itemLabel": "George Curzon", "itemDescription": "British actor and Royal Navy commander (1898-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Curzon_(actor)", "wikipedia_page": {"main": "For the British statesman, see George Curzon, 1st Marquess Curzon of Kedleston.Commander Chambré George William Penn Curzon (18 October 1898 – 7 May 1976), known as George Curzon, was a Royal Navy commander, actor, and father of the present Earl Howe.Curzon, born in Amersham, Buckinghamshire, England, was the only son of diplomat The Hon. Frederick Curzon-Howe (a son of The 3rd Earl Howe) and his wife, the actress Ellis Jeffreys. Curzon trained for the Navy at the Royal Naval College, Osborne, on the Isle of Wight, and first saw action in the First World War. He retired from the Navy as a lieutenant-commander, then served as a King's Messenger before turning to the West End stage in 1930.\nCurzon then went to America and appeared on the New York stage in the play Parnell before entering films. He was given a minor role as a police constable in Basil Dean's Escape (1930). His first major role came in 1935 when he appeared as the title role in Sexton Blake and the Bearded Doctor.  He reprised this role in Sexton Blake and the Mademoiselle (1935) and Sexton Blake and the Hooded Terror (1938). He appeared in several films directed by Alfred Hitchcock before he moved to the United States and Hollywood, most notably Young and Innocent, where he played a musician and murderer who was caught by his nervous eye-twitch, in a famous long crane shot devised by Hitchcock.A brief interruption came to Curzon's acting career in 1939 when, after playing a minor role in Hitchcock's Jamaica Inn, he again enlisted in the Navy during World War II.  He later starred in various other films from 1947 until 1965.Curzon had two children from his second marriage, Frederick Richard Penn (b. 1951) and Emma Charlotte (b. 1953). His son succeeded to his kinsman's title of Earl Howe in 1984 (long after the death of Curzon himself in 1976) and his daughter was granted the rank of an earl's daughter a year later (i.e. Lady Emma).\n\n", "link_mentions": {}}}