{"wiki_id": "http://www.wikidata.org/entity/Q4354168", "itemLabel": "Jimmy Clitheroe", "itemDescription": "comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Clitheroe", "wikipedia_page": {"main": "James Robinson Clitheroe (24 December 1921 – 6 June 1973) was an English comic entertainer. He is best remembered for his long running BBC Radio programme, The Clitheroe Kid (1956–72).", "link_mentions": [{"page": "Ken Dodd", "response": ["He gained his big break at age 26 when, in September 1954, he made his professional show-business debut as Professor Yaffle Chucklebutty, Operatic Tenor and Sausage Knotter at the Nottingham Empire. He later said, \"Well at least they didn't boo me off\". He continued to tour variety theatres up and down the UK, and in 1955 he appeared at Blackpool, where, in the following year, he had a part in Let's Have Fun. His performance at the Central Pier was part of a comedy revue with Jimmy James and Company. Also on the same bill were Jimmy Clitheroe and Roy Castle.Theatre Programme, Central Pier, Blackpool, 1956. Cyril Critchlow Collection, Blackpool Central Library, Vol. 38 p. 12. Dodd first gained top billing at Blackpool in 1958."]}, {"page": "Deryck Guyler", "response": ["Other television appearances include those in That's My Boy (1963), a comedy series starring Jimmy Clitheroe, and the short-lived political comedy Best of Enemies. He also played a drunken surgeon in the film Carry On Doctor. During the 1980s, he contributed the voice-over to an animated skeleton in UK adverts for Scotch Video Tapes.Aardman: An epic journey taken one frame at a time, pg. 78 He was the narrator of the BBC documentary about Fred Dibnah - Fred Dibnah, Steeplejack"]}, {"page": "Some Mothers Do 'Ave 'Em", "response": ["* The title of the series \"Some Mothers Do 'Ave 'Em\" is similar to Jimmy Clitheroe's catchphrase from the late-1950s to early-1970s: \"Don't Some Mothers 'Ave 'Em!\""]}, {"page": "Blackpool", "response": ["* Jimmy Clitheroe (1921–1973) – British comedy actor, lived most of his life in the Greenlands area on Bispham Road, Blackpool, where he died in 1973"]}, {"page": "Clitheroe", "response": ["* Jimmy Clitheroe (1921–1973) a comedian well known for his radio shows, was born in the town but raised in Blacko, near Colne."]}, {"page": "Roy Castle", "response": ["Castle was born in Scholes, near Holmfirth, West Riding of Yorkshire. The son of a railwayman, he was a tap dancer from an early age and trained at Nora Bray's school of dance with Audrey Spencer who later ran a big dance school, and after leaving Holme Valley Grammar School (now Honley High School) he started his career as an entertainer in an amateur concert party. As a young performer in the 1950s, he lived in Cleveleys near Blackpool and appeared there at the local Queen's Theatre, turning professional in 1953 as a stooge for Jimmy Clitheroe and Jimmy James. By 1958, he was appearing at the Royal Variety Show. As a singer, he released one charting single in 1960, the Christmas song \"Little White Berry\"."]}, {"page": "Mollie Sugden", "response": ["When Sugden graduated from the Guildhall School of Drama, she worked in repertory for eight years with a company that included Eric Sykes and Roy Dotrice. She also had work in radio and made her television debut in a live half-hour comedy show. Sugden's other appearances before Are You Being Served? included parts in The Benny Hill Show, Just Jimmy (with Jimmy Clitheroe), Z-Cars, Up Pompeii!, The Goodies, Steptoe and Son and five episodes of Jackanory in 1968."]}, {"page": "General Tom Thumb", "response": ["* Jimmy Clitheroe portrayed General Tom Thumb in the 1967 film Jules Verne's Rocket to the Moon."]}, {"page": "Old Mother Riley", "response": ["Old Mother Riley (full comedy name: Daphne Bluebell Snowdrop Riley) is an Irish washerwoman and charwoman character, devised by Lucan (born Arthur Towle).  His wife Kitty McShane played Old Mother Riley's daughter, Kitty. It was essentially a drag act but also a double act. The couple played music halls, theatres, and broadcast on radio and appeared in films. Lucan was voted sixth biggest British box-office star by the Motion Picture Herald in 1943.http://www.brent.gov.uk/media/7031206/Arthur%20Lucan%20-%20the%20man%20who%20was%20Old%20Mother%20Riley.pdf In 1939, Jimmy Clitheroe appeared in an Old Mother Riley pantomime called The Old Woman who Lives in a Shoe,  and then the following year had a part in the film, Old Mother Riley in Society. The Film Fun comic included an “Old Mother Riley” strip cartoon in the 1940s."]}, {"page": "Mancunian Films", "response": ["Escalating costs and a desire to cater for the robust tastes of northern industrial audiences led to the establishment of the two-stage facility in a former Methodist Chapel on Dickenson Road, Rusholme, the only film studio outside the South East. The buildings were converted at a cost of £70,000 in 1947. Starting with Cup-tie Honeymoon (1948) starring Sandy Powell, over the next six years the films went on to feature northern favourites Frank Randle, Josef Locke, Diana Dors, and Jimmy Clitheroe. The studio, though it often worked on a shoestring, was successful and profitable but Blakely decided to retire when he reached 65."]}, {"page": "Blacko", "response": ["Blacko was the childhood home of Lancashire comedian Jimmy Clitheroe (1921–73), famous for his BBC radio series The Clitheroe Kid, who lived there from 1922 to 1935. Jimmy went to school in Blacko and appeared in many amateur concert party entertainments in the village's Methodist chapel, before turning professional in 1936."]}, {"page": "1973 in radio", "response": ["*June 6, Jimmy Clitheroe, 51, English comic entertainer"]}, {"page": "Jules Verne's Rocket to the Moon", "response": ["* Jimmy Clitheroe as General Tom Thumb"]}, {"page": "The Clitheroe Kid", "response": ["The Clitheroe Kid was a BBC Radio comedy show featuring diminutive Northern comic Jimmy Clitheroe in the role of a cheeky schoolboy, who lived with his family at Lilac Avenue in an unnamed town in the North of England. The pilot show, pilot series, and 16 subsequent series, totalling 290 episodes in all, were originally broadcast between April 1957 and August 1972.", "For the period 1956 to 1969, supplementing the edited Transcription Service discs, 58 episodes are currently known to exist as off air recordings made by listeners, many of variable sound quality, some of which are incomplete. An on-going project exists to locate and restore the approximately sixty entirely missing episodes, for which no recording of any sort is known, and to locate better quality and more complete recordings for the others.The Jimmy Clitheroe website's missing episode hunt, known as Project Clitheroe", "Jimmy Clitheroe was 35 years old when he started playing the part on radio, but (in the variety theatres and, later, on television) he could pass as an 11-year-old boy because he had never grown physically beyond that age. Although in later years his lined face gave his real age away, this was not apparent on radio.", "* Jimmy Clitheroe official website (founded in 2001)", "* Jimmy Clitheroe website (archived version) (2012)"]}, {"page": "The Magic Christian (film)", "response": ["* Jimmy Clitheroe as Passenger on Ship (uncredited)"]}, {"page": "List of people with dwarfism", "response": ["| Jimmy Clitheroe"]}, {"page": "1973 in the United Kingdom", "response": ["* 6 June – Jimmy Clitheroe, aka 'The Clitheroe Kid', English comedian (born 1921)"]}, {"page": "1921 in radio", "response": ["*24 December – Jimmy Clitheroe, English comic entertainer (d. 1973)"]}, {"page": "Al Read", "response": ["In 1954 he appeared high on the bill at the Royal Variety Performance at the London Palladium, and in 1959 he appeared with comedian Jimmy Clitheroe in the Royal Northern Variety Performance, in the presence of the Queen Mother, at the Palace Theatre, Manchester.  The American comedian Bob Newhart came to an arrangement with Read to adapt and perform some of his routines, with the result that some of the material originally written and developed by Read, such as \"The Driving Instructor\", became associated more with Newhart.   "]}, {"page": "Back in the DHSS", "response": ["* \"99% Of Gargoyles Look Like Bob Todd\". Jesus Christ, Bob Todd (\"One of the two ugly blokes on the Benny Hill Show, the one who didn't receive punishment\"), James Dean, Marilyn Monroe, Jimmy Clitheroe (\"Сomedian, perennial naughty-schoolboy, died on the day of his mother's cremation\"), \"If you've ever wondered how you get triangles from a cow\" (\"Refers to the Dairylea soft cheese adverts). John Noakes, Lesley Judd."]}, {"page": "Tommy Trafford", "response": ["He lived his early life in Blacko, near Nelson, where he performed in church productions alongside Jimmy Clitheroe, \"The Clitheroe Kid\", with whom he went to school. Tommy owned a traditional Blackpool guest house, as did many performers, which gave him the experience to run a country hotel and restaurant for Jimmy during a temporary 'retirement' from Showbiz. Of the many routines and characters that Tommy portrayed, his best known routine was a homage to Norman Evans’ ‘Over the Garden Wall’ sketch as the larger-than-life Fanny Fairbottom. Norman's widow, on seeing Tommy perform this on television said it was the best she had seen."]}, {"page": "Carleton Crematorium and Cemetery", "response": ["* Jimmy Clitheroe, comedian", "File:Jimmy Clitheroe's memorial tree at the Carleton Crematorium and Cemetery.jpg|Jimmy Clitheroe's memorial tree"]}, {"page": "Tony Melody", "response": ["Initially as a dancer, Melody spent three years touring the Mediterranean with Ralph Reader's Gang Show, performing for British troops in various countries along with Tony Hancock and Norrie Paramor. In 1952 he spent a season performing at the Windmill Theatre in London, among the nudes, where he featured as a comedy singer, before returning to Yorkshire, where he performed semi-professionally in local clubs while working in a factory in Leeds during the day. In 1955 he appeared on What Makes A Star? on BBC local radio. He became a regular on BBC regional radio, working in the North region of the BBC Home Service from 1958 with, among others, Jimmy Clitheroe (who he also appeared with on stage, touring the Variety theatres) and with Harry Worth. With Clitheroe, he did a regular double-act on a radio variety show called Call Boy, as well as doing much the same act together on stage in the theatres.", "His acting career at the BBC began in radio, appearing in the sitcom The Clitheroe Kid, another show which starred Jimmy Clitheroe, in which he appeared from 1957 as grumpy taxi driver Horatio Higginbottom, a regular role that he continued in for sixteen years, until 1972. In the 1950s he also had a regular role as compère and singer with the BBC's Northern Dance Orchestra, in the BBC radio show The Straw Hat Club.", "His first television role came on 6 December 1957 when he appeared in the BBC comedy Be Soon alongside comedian Hylda Baker. Between 1964 and 1968 he appeared regularly on ITV with Jimmy Clitheroe in the sitcom Just Jimmy, and featured in two episodes of ITV's Coronation Street, playing two small different roles, as a coach driver and a taxi driver. In 1968 he made his third appearance on Coronation Street, this time as Harold Eaton, a decorator working at the Rovers Return pub. In 1969 he played a postman in Parkin's Patch.", "Melody's first marriage was dissolved; he had four children with his first wife. He met his second wife, Maggie when they were both performing in pantomime in Skegness. They made their home in Bispham, Blackpool which he claimed was her home town, where he spent the rest of his life. Melody would say about living in Bispham, \"Other actors can have London. I don't like it there, can't stand the trains, the noise, the hassle. Home is here.\" But the real reason they lived there was not unconnected with the fact that Melody was in a long-term professional double act with Jimmy Clitheroe, who lived a 5-minute walk from their front door. Offscreen Melody was a shy unassuming man, who rarely gave interviews and who shunned the \"show business scene\"."]}, {"page": "Count Arthur Strong's Radio Show!", "response": ["He claims to have many show business friends although, apart from Guinness, this seems limited to brief conversations with Anita Harris and Jimmy Clitheroe. He also appears to have a mixed relationship with Edward Woodward. While resenting Woodward's success, he also claims that his advice meant that \"for the first time in years, Edward Woodward can cross his legs when he sits down\". Woodward's name causes the Count many problems, calling him \"Edward Woodwardward\", \"Edward Woodwind\", \"Edward Woodbine\", \"Wedward Goodwood\", at one point saying, \"In my game, you’ve got to be available 25-7, 380 degrees of the year – that’s why Edward Woodworm’s getting so much work!\" etc."]}, {"page": "James Robinson Clitheroe", "response": ["#REDIRECT Jimmy Clitheroe"]}, {"page": "List of Royal Variety Performances", "response": ["| Paddy Glyn, The Eight Mitchell Singers, The 20 John Tiller Girls, The Pietro Brothers, Marty Wilde, Cliff Richard, Harry Robertson, Lord Rockingham's XI, Cherry Wainer, Benny Hill, Al Read with Jimmy Clitheroe, Jean Louis Bert and Ilonka, The Dior Dancers, Belinda Wright, Jelke Yuresha, Jimmy Jewel and Ben Warriss, Roy Castle, BBC Northern Dance Orchestra with Sheila Buxton, Russ Conway, Ronnie Hilton, Jill Day, Marion Ryan, Dickie Henderson, Dora Bryan, Aileen Cochrane, Anne Shelton, Terry Wilson, Blackpool Tower Ballroom Children's Ballet, Michael Medwin, Alfie Bass, Bill Fraser, Ted Lune, Norman Rossington, Liberace, Arthur Askey, The Hallé Orchestra conducted by Sir John Barbirolli."]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Jimmy Clitheroe: 1959"]}, {"page": "1973 in British radio", "response": ["* 6 June – Jimmy Clitheroe, comic entertainer (born 1921)"]}, {"page": "Danny Ross (comedian)", "response": ["thumb|right|Publicity photo of Danny RossRonald Crabtree (30 April 1930 – 2 February 1976) known by his stage name Danny Ross, was a British comedian best remembered for his role alongside Jimmy Clitheroe in the long running BBC Radio comedy show The Clitheroe Kid (1957–1973).", "*Information courtesy of the official Jimmy Clitheroe website and the IMDb.", "*Jimmy Clitheroe memorial website"]}, {"page": "Much Too Shy", "response": ["Much Too Shy is a 1942 British comedy film directed by Marcel Varnel and starring George Formby, Kathleen Harrison, Hilda Bayley and Eileen Bennett. The cast includes radio star Jimmy Clitheroe (as George's brother), later \"Carry On'\" star Charles Hawtrey, Peter Gawthorne and Joss Ambler.", "* Jimmy Clitheroe – Jimmy"]}, {"page": "Stars in Your Eyes", "response": ["* Jimmy Clitheroe as Joey"]}, {"page": "Somewhere in Politics", "response": ["* Jimmy Clitheroe - Sonny"]}, {"page": "School for Randle", "response": ["* Jimmy Clitheroe as Jimmy"]}, {"page": "James Casey (variety artist)", "response": ["His most notable discoveries during his career at BBC Radio in Manchester, between 1954 and 1982, were the radio comedian Jimmy Clitheroe, the comedian Les Dawson, the comedian Ken Dodd, and the comedy double-act known professionally as Hinge and Bracket, each of whom he launched into a career in radio light entertainment with their own BBC series.", "His most successful series for BBC Radio was creating, producing and co-writing The Clitheroe Kid, starring the diminutive comic Jimmy Clitheroe, which ran continuously for sixteen years on the BBC Light Programme and BBC Radio 2, running from 1957 to 1972 inclusive, based on a chance meeting with Jimmy Clitheroe on a Variety bill in 1952.", "He also teamed up with Jimmy Clitheroe, who already had film experience and had worked with Jimmy James in Variety. Only 4'3\" tall, before he became famous Clitheroe played Frank Randle's dummy in ventriloquist sketches, at the end of which he would jump from the fake ventriloquist's knee and run off into the wings to show he wasn't in fact a doll. In 1955, at Casey's prompting, Clitheroe appeared in Call Boy, a radio variety series featuring popular stars of the day including Ted Lune, Margery Manners and Dennis Goodwin. Written mainly by Casey, writing under his stage name 'Cass James', assisted by Frank Roscoe and Ronnie Taylor, the initial sketches featuring Jimmy Clitheroe were short 8-minute items, but within three years had expanded into the full-length situation comedy The Clitheroe Kid, written mainly – and produced solely – by James Casey, who was now writing and producing under his real name.", "The combination of Casey's versatile scripts and Jimmy Clitheroe's impetuous cheek proved a winner. Stalwarts Patricia Burke as mother, and Peter Sinclair as grandad, were complemented by Diana Day as Jimmy's older sister Susan (nicknamed \"Scraggy Neck\"), her gormless boy friend \"Daft Alfie\" played by Danny Ross, and Tony Melody as Mr Higginbottom their rough-hewn neighbour. ", "* James Casey – Biographical notes at the Jimmy Clitheroe website"]}, {"page": "Pavilion Theatre, Torquay", "response": ["| 1964 || We're Frying Tonight! || Summer season play by John Waterhouse. Starring Jimmy Clitheroe, Albert Burdon, Eddie Molloy, Mollie Sugden, <BR>Robert Webber, William Moore, Lynda Reynolds, Philip Clive, Tommy Godfrey, Billy Windsor"]}, {"page": "June 1973", "response": ["*Died: Jimmy Clitheroe, 51, English entertainer,JIMMY CLITHEROE Popular radio entertainer. The Times(London, England), Thursday, 7 June 1973; pg. 21; Issue 58802 having taken an overdose of sleeping pills on the day of his mother's funeral."]}, {"page": "Clitheroe (surname)", "response": ["* Jimmy Clitheroe (1921–1973), English comic"]}, {"page": "Old Mother Riley in Society", "response": ["Old Mother Riley in Society is a low budget 1940 black and white British comedy film, directed by John Baxter, and starring Arthur Lucan and Kitty McShane. It is the fifth in the long running Old Mother Riley series, and features the screen debut of Jimmy Clitheroe as the boot boy in a high society household."]}, {"page": "That's My Boy (1963 TV series)", "response": ["That's My Boy is a British television series which was broadcast in 1963. Produced by ABC Weekend Television, it was broadcast only in the Midlands and Northern England. A half-hour sitcom, the series starred Jimmy Clitheroe. The series survives intact, and the complete series was issued on DVD by Network on 19 May 2014."]}, {"page": "Ronnie Taylor (scriptwriter)", "response": ["In 1961, Taylor was appointed Supervisor of Light Entertainment at ABC working with Jimmy Clitheroe and Al Read and on programmes, Blackpool Night Out and Comedy Bandbox."]}, {"page": "Patricia Burke", "response": ["On stage she enjoyed success in the 1943 West End musical The Lisbon Story. Patricia Burke's most well known films were Lisbon Story (1946) and The Trojan Brothers (1946), and the role of Elizabeth the 1949 TV production of Elizabeth of Ladymead. She appeared in several episodes of the TV series The Adventures of Robin Hood between 1955 and 1958. In 1947-48 she acted in productions of Shakespeare and Shaw at the Old Vic. In 1957 she acted in a production of Aristophanes' Lysistrata at the Royal Court Theatre. Between 1958 and 1972 she played the part of Jimmy Clitheroe's mother in the BBC Radio Series The Clitheroe Kid."]}, {"page": "Radio Lives", "response": ["|Jimmy Clitheroe"]}]}}