{"wiki_id": "http://www.wikidata.org/entity/Q435981", "itemLabel": "Mabel Collins", "itemDescription": "Guernsey writer  (1851–1927), editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Mabel_Collins", "wikipedia_page": {"main": "Mabel Collins (9 September 1851 – 31 March 1927) was a British theosophist and author of over 46 books.", "link_mentions": [{"page": "Fernando Pessoa", "response": ["In addition, Pessoa translated into Portuguese some books by the leading theosophists Helena Blavatsky, Charles Webster Leadbeater, Annie Besant, and Mabel Collins."]}, {"page": "Guernsey", "response": ["Mabel Collins (1851–1927), a theosophist and prolific author, was born in St Peter Port, Guernsey."]}, {"page": "Helena Blavatsky", "response": ["In 1886, by which time she was using a wheelchair, Blavatsky moved to Ostend in Belgium, where she was visited by Theosophists from across Europe. Supplementing her pension, she established a small ink-producing business. She received messages from members of the Society's London Lodge who were dissatisfied with Sinnett's running of it; they believed that he was focusing on attaining upper-class support rather than encouraging the promotion of Theosophy throughout society, a criticism Blavatsky agreed with. She arrived in London in May 1887, initially staying in the Upper Norwood home of Theosophist Mabel Collins. In September, she moved into the Holland Park home of fellow Theosophists, Bertram Keightley and his nephew Archibald Keightley.", "G. R. S. Mead wrote about Blavatsky, \"I know no one who detested, more than she did, any attempt to hero-worship herselfshe positively physically shuddered at any expression of reverence to herselfas a spiritual teacher; I have heard her cry out in genuine alarm at an attempt to kneel to her made by an enthusiastic admirer.\" Leo Klejn wrote about Blavatsky, \"Indefatigability and energy of this woman were surprising. She had a revolutionary's merits.\" Another person who said Blavatsky was a remarkable woman was a former associate and publisher of the Theosophical magazine Lucifer 1887–1889, Mabel Collins. After leaving the movement she said \"She taught me one great lesson. I learned from her how foolish, how 'gullible', how easily flattered human beings are, taken en masse. Her contempt for her kind was on the same gigantic scale as everything else about her, except her marvellously delicate taper fingers. In all else, she was a big woman. She had a greater power over the weak and credulous, a greater capacity for making black appear white, a larger waist, a more voracious appetite, a more confirmed passion for tobacco, a more ceaseless and insatiable hatred for those whom she thought to be her enemies, a greater disrespect for les convenances, a worse temper, a greater command of bad language, and a greater contempt for the intelligence of her fellow-beings than I had ever supposed possible to be contained in one person. These, I suppose, must be reckoned as her vices, though whether a creature so indifferent to all ordinary standards of right and wrong can be held to have virtues or vices, I know not.\"Theosophy: Origin of the New Age – C. C. Martindale in This Rock magazine, Feb 96From serialized installment in "]}, {"page": "1927 in literature", "response": ["*March 31 – Mabel Collins, British theosophist and author (born 1851)"]}, {"page": "List of female mystics", "response": ["*Mabel Collins"]}, {"page": "William Walker Atkinson", "response": ["Atkinson was a prolific writer, and his many books achieved wide circulation among New Thought devotees and occult practitioners. He published under several pen names, including Magus Incognito, Theodore Sheldon, Theron Q. Dumont, Swami Panchadasi, Yogi Ramacharaka, Swami Bhakta Vishita, and probably other names not identified at present. He is also popularly held to be one (if not all) of the Three Initiates who anonymously authored The Kybalion, which certainly resembles Atkinson's other writings in style and subject matter. Atkinson's two co-authors in the latter venture, if they even existed, are unknown, but speculation often includes names like Mabel Collins, Michael Whitty, Paul Foster Case, and Harriett Case."]}, {"page": "The Magician (Maugham novel)", "response": ["*The Blossom and the Fruit, by Mabel Collins"]}, {"page": "Sensa", "response": ["* The Story of Sensa, a work by Mabel Collins"]}, {"page": "Collins (surname)", "response": ["*Mabel Collins (1851–1927), writer on theosophy"]}, {"page": "Charlotte Despard", "response": ["Despard's first novel, Chaste as Ice, Pure as Snow was published in 1874. Over the next sixteen years, she wrote ten novels, three of which were never published. Outlawed: a Novel on the Women's Suffrage Question was written jointly with her friend, Mabel Collins and published in 1908."]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* Keningale Robert Cook ( now only remembered as the husband of Mabel Collins)"]}, {"page": "1927 in the United Kingdom", "response": ["* 31 March – Mabel Collins, theosophist and author (born 1851)"]}, {"page": "List of people from Guernsey", "response": ["* Mabel Collins (1851–1927), theosophist and author"]}, {"page": "Robert Donston Stephenson", "response": ["Stephenson later fell under the suspicion of newspaper editor William Thomas Stead, the writer Mabel Collins and her friend Baroness Vittoria Cremers. Cremers told Aleister Crowley that Stephenson was a doctor and had committed the Whitechapel murders as part of a magic ritual and that the sites of the murders, when joined together on a map, formed a calvary cross (which is untrue). The suspicion was not merely caused by Stephenson's preoccupation with \"black magic\". He had been, by his own account, in love with a prostitute, and had contracted venereal disease from others. The fact that Stephenson's wife seemingly disappeared in 1886 has led to the otherwise unsupported speculation that he may have killed her.The Mammoth Book of Jack the Ripper, p. 446, Ed. Maxim Jakubowski and Nathan Braund. According to Jakubowski and Braund, Stephenson claimed to have killed others, and that he was keeping ties stained with human blood, as well as being the owner of candles made from human fat.The Mammoth Book of Jack the Ripper, p. 449, Ed. Maxim Jakubowski and Nathan Braun. Collins and Cremers' theory was later resurrected by Richard Whittington-Egan in A Casebook on Jack the Ripper and subsequently developed by the author Melvin Harris in Jack the Ripper: The Bloody Truth and its two sequels. Crime writer Colin Wilson praised the research done by Harris but concluded it didn't prove any connection between Stephenson and Jack the Ripper.Colin Wilson, \"A Lifetime in Ripperology\", in The Mammoth Book of Jack the Ripper, p. 421, Ed. Maxim Jakubowski and Nathan Braund. Jakubowski and Braund state that the major problem with Stephenson as a suspect is that the idea is heavily reliant on his own testimony, both as to \"the depth of his heartlessness and iniquity and as to his activities\". Whilst Cremers, the principal witness, was closely linked to Aleister Crowley and Stephenson's \"air of mystery and his somewhat theatrical, throwaway boast of wickedness\" seem to anticipate Crowley's own romancing, the statements about blood and candles may have been theatrical props specifically designed to have the effect which they had – to frighten two impressionable women.The Mammoth Book of Jack the Ripper, p. 449, Ed. Maxim Jakubowski and Nathan Braund. Author Ivor Edwards also named Stephenson as the Ripper in his book Jack the Ripper's Black Magic Rituals published by Penny Publishing (2001) and Blake Publishing (2002).  "]}, {"page": "Vittoria Cremers", "response": ["Cremers had experience in publishing. After having read the book Light on the Path, written by Mabel Collins though first anonymously issued in 1885, Cremers felt prompted to immediately join the Theosophical Society. In 1888 she travelled to Britain to meet Madame Blavatsky. As she had been previously involved with publishing, Blavatsky asked her to take over the business side of the Theosophical journal  Lucifer. Cremers was soon introduced to Mabel Collins, with whom she became firm friends. According to Jean Overton Fuller,The Magical Dilemma of Victor Neuburg Jean Overton Fuller (W.H.Allen, 1965) Cremers was close to Aleister Crowley and Victor Neuberg and claimed to know the identity of Jack the Ripper (supposedly Robert D'Onston Stephenson)."]}, {"page": "Isabelle de Steiger", "response": ["In the early 1870s, Steiger was drawn towards spiritualism and in 1878 joined the Theosophical Society. She came into contact with Madame Blavatsky, Mabel Collins and Anna Kingsford, the latter being especially esteemed by Steiger and becoming a close friend. Later, after a split within the Theosophical society, she became a member of the Hermetic Society, founded by Kingsford; she was also a member of the Society for Psychical Research."]}, {"page": "Literature of Birmingham", "response": ["The Victorian era also saw Birmingham featuring as a setting for novelists from outside the town, placing it at the forefront of the fictional representation of industrial England's major urban centres. Five years before Elizabeth Gaskell's 1848 portrayal of Manchester in Mary Barton, and nine years before Charles Dickens' Hard Times was loosely set in Preston, Charlotte Elizabeth Tonna gave a graphic depiction of working life in Birmingham in her 1843 four-part novel The Wrongs of Woman, emphasising the exploitation of women in backstreet factories and the corrosive influence of industrial employment. The anonymously-written 1848 novella How to Get on in the World: The Story of Peter Lawley presented a more optimistic view, showing the positive consequences of learning to read for the poverty-stricken son of a Birmingham nailer. George Gissing's Eve's Ransom of 1894 presented Birmingham as a bustling metropolis of questionable values, with traffic \"speedily passing from the region of main streets and great edifices into a squalid district of factories and workshops and crowded by-ways\", while Mabel Collins used Birchampton – a thinly disguised Birmingham – as the setting for her gothic novel The Star Sapphire of 1896. Passing references in more widely set fiction also provide evidence of Birmingham's growing significance in the culture of Victorian England. Benjamin Disraeli's 1845 novel Sybil uses Birmingham as a background political barometer – \"They're always ready for a riot in Birmingham… The sufferings of '39 will keep Birmingham in check\", while Charlotte Brontë's 1849 Shirley sees the town at the root of the changes sweeping England – \"In Birmingham I considered closely, and at their source, the causes of the present troubles of this country\"."]}, {"page": "Abbey Rader", "response": ["His education went beyond music into spirituality. Rader met drummer Clarence \"Scoby\" Strohman while playing opposite the Marin Rivers trio. Strohman introduced Rader to books like Light on the Path by Mabel Collins and Paramahansa Yogananda's The Autobiography of a Yogi, which helped begin Rader's spiritual journey. Rader recalls an anecdote that touched his confidence as well. \"My music reading skills were not very good, but Scoby had lots of faith in me. He stood behind me on the bandstand one night as I started to play acts with lots of music to read. Scoby said, \"That's not a problem for you. That's nothing for you.\" I played remarkably well that night. I said to Scoby, \"Did you see those difficult charts I read?\", and he said he couldn't read a note. So I learned something else about the spiritual power and the power of the mind.\""]}, {"page": "Alice Chapin", "response": ["* Outlawed (Court, 1911) a dramatisation, with Mabel Collins, of the novel by Collins and Women's Freedom League leader Charlotte Despard."]}, {"page": "Theosophy and literature", "response": ["Mabel Collins, who helped Blavatsky edit the Theosophical journal Lucifer in London, wrote a book entitled The Blossom and the Fruit: A True Story of a Black Magician (1889). According to EOP the book demonstrated her growing interest in metaphysics and occultism. After leaving editorial work, however, she published several books that parodied Blavatsky and her Masters."]}, {"page": "List of women writers (A–L)", "response": ["*Mabel Collins (1851–1927, England), theosophist"]}]}}