{"wiki_id": "http://www.wikidata.org/entity/Q4353576", "itemLabel": "Lumley Lyster", "itemDescription": "Royal Navy admiral", "wikipedia_url": "https://en.wikipedia.org/wiki/Lumley_Lyster", "wikipedia_page": {"main": "Vice-Admiral Sir Arthur Lumley St George Lyster,  (27 April 1888 – 4 August 1957) was a Royal Navy officer during the Second World War.", "link_mentions": [{"page": "Fleet Air Arm", "response": ["* Vice-Admiral Sir Lumley Lyster (1888–1957): drew up attack plan in 1935 that was used for the Battle of Taranto five years later", "* Rear-Admiral Cedric Kenelm Roberts (1918–2011): (always known as 'Chico') a distinguished naval pilot who joined the Royal Navy as a naval rating in 1940. He was personal pilot to Vice-Admiral Lumley Lyster in 1943, commanded three Naval Air Squadrons and was shot down during the Korean War. Later, he commanded three Naval Air Stations and ended his naval flying career as Flag Officer Naval Flying Training 1968–71."]}, {"page": "Torpedo bomber", "response": ["Even before the outbreak of the Second World War, the Royal Navy had studied the threat in the Mediterranean posed by the Italian fleet, which had its advance base in the new port of Taranto in the \"heel\" of Italy. Captain Lumley Lyster of the aircraft carrier  proposed that his Fairey Swordfish torpedo bombers could launch a night attack against Taranto. At that time, the Royal Navy was the only force in the world with this capability. The Swordfish, a three-seat biplane, looked outmoded, but its low stall speed made it an ideal platform for launching torpedoes into the shallow waters of Taranto. The torpedoes were adapted with wire cables attached to their nose and wooden fins at their tail to slow their fall and make a shallow impact with the water, which was only  deep."]}, {"page": "Battle of Taranto", "response": ["During the Munich Crisis of 1938, Admiral Sir Dudley Pound, the commander of the British Mediterranean Fleet, was concerned about the survival of the aircraft carrier  in the face of Italian opposition in the Mediterranean, and ordered his staff to re-examine all plans for attacking Taranto. He was advised by Lumley Lyster, the captain of Glorious, that his Fairey Swordfish biplane torpedo bombers were capable of a night attack. Indeed, the Fleet Air Arm was then the only naval aviation arm with such a capability. Pound took Lyster's advice and ordered training to begin. Security was kept so tight there were no written records. Just a month before the war began, Pound advised his replacement, Admiral Andrew Cunningham, to consider the possibility. This came to be known as Operation Judgment."]}, {"page": "Berkhamsted School", "response": ["*Sir Lumley Lyster (1888–1957), admiral, Royal Navy "]}, {"page": "HMS Illustrious (87)", "response": ["While Illustrious was being moved in preparation for her acceptance trials on 24 April, the tugboat Poolgarth capsized with the loss of three crewmen.Lyon, p. 218; McCart, p. 11 The carrier conducted preliminary flying trials in the Firth of Clyde with six Fairey Swordfish torpedo bombers that had been craned aboard earlier. In early June, she loaded the personnel from 806, 815, and 819 Squadrons at Devonport Royal Dockyard; 806 Squadron was equipped with Blackburn Skua dive bombers and Fairey Fulmar fighters, and the latter two squadrons were equipped with Swordfish. She began working up off Plymouth, but the German conquest of France made this too risky, and Illustrious sailed for Bermuda later in the month to continue working up. This was complete by 23 July, when she arrived in the Clyde and flew off her aircraft. The ship was docked in Clydeside for a minor refit the following day; she arrived in Scapa Flow on 15 August, and became the flagship of Rear Admiral Lumley Lyster.McCart, pp. 11–12 Her squadrons flew back aboard, and she sailed for the Mediterranean on 22 August with 15 Fulmars and 18 Swordfish aboard.Brown 1971, p. 242"]}, {"page": "Operation Pedestal", "response": ["Admiralty planning for Operation Pedestal began in late July 1942, under the direction of Vice-Admiral Neville Syfret, Rear Admirals Lumley Lyster and Harold Burrough and the Naval Staff. Syfret transferred to  on 27 July when Nelson and  returned to Scapa Flow from Freetown, West Africa. Syfret convened a conference on 29 July, for Flag and Commanding Officers of the naval forces for Pedestal at Scapa, to consider the orders for the operation. Several smaller operations were also planned, to be carried out concurrently with Pedestal. The convoy comprised 14 merchant vessels, the most important being Ohio, the only large, fast tanker available, a US ship loaned to the British, with a British crew. As insurance against the loss of Ohio and its  of oil, the other ships were to carry fuel in drums. The convoy was to be protected by two battleships, three aircraft carriers, seven cruisers, 32 destroyers and seven submarines, the largest escort force yet."]}, {"page": "Andrew Cunningham, 1st Viscount Cunningham of Hyndhope", "response": ["Although the threat from the French Fleet had been neutralised, Cunningham was still aware of the threat posed by the Italian Fleet to British North African operations, based in Egypt. Although the Royal Navy had won in several actions in the Mediterranean, considerably upsetting the balance of power, the Italians who were following the theory of a fleet in being had left their ships in harbour. This made the threat of a sortie against the British Fleet a serious problem. At the time the harbour at Taranto contained six battleships (five of them battle-worthy), seven heavy cruisers, two light cruisers, and eight destroyers. The Admiralty, concerned with the potential for an attack, had drawn up Operation Judgement; a surprise attack on Taranto Harbour. To carry out the attack, the Admiralty sent the new aircraft carrier , commanded by Lumley Lyster, to join  in Cunningham's fleet.Stephen, Martin. Sea Battles in Close-up: World War 2 (Shepperton, Surrey: Ian Allan, 1988), p. 34."]}, {"page": "Lister (surname)", "response": ["* Lumley Lyster (1888–1957), Royal Navy vice-admiral during the Second World War"]}, {"page": "List of fleets and major commands of the Royal Navy", "response": ["* Flag Officer, Carrier Training and Administration - Vice Admiral Lumley Lyster 1943-1945"]}, {"page": "Fifth Sea Lord", "response": ["*Rear Admiral Sir Lumley Lyster 1941–1942"]}, {"page": "Arthur Lyster", "response": ["#REDIRECT Lumley Lyster"]}, {"page": "Flag Officer, Carriers and Amphibious Ships", "response": ["|6 || Rear-Admiral || 25px ||Lumley Lyster||July 1940 - August 1940 ||office renamed FO/MAC 09.1040", "|1 || Rear-Admiral || 25px ||Lumley Lyster||September 1940 to 4 February 1941 ||office renamed FO/MAC 09.1040", "| Vice-Admiral || 25px ||Lumley Lyster||July 1942 - 21 May 1943 ||Rear-Admiral, then Vice-Admiral, Home Fleet Aircraft Carriers, aboard Royal Navy Officers 1939-1945: L"]}, {"page": "Flag Officer, Flying Training", "response": ["Vice-Admiral Lumley Lyster held the post of Flag Officer Carrier Training and Administration from its establishment on April 27, 1943, to September 1945.Norman Polmar, Aircraft Carriers: A History of Carrier Aviation and Its Influence on World Events, Volume I: 1909-1945, 550. In September 1945, Vice-Admiral Lyster hauled down his flag and his post was abolished. Instead three separate admirals' posts supervising different areas of naval aviation training were created. One of them was the appointment of Flag Officer, Flying Training. The post was abolished in 1970."]}]}}