{"wiki_id": "http://www.wikidata.org/entity/Q436801", "itemLabel": "Tom Sharpe", "itemDescription": "English satirical novelist (1928-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Sharpe", "wikipedia_page": {"main": "Thomas Ridley Sharpe  (30 March 1928 – 6 June 2013) was an English satirical novelist, best known for his Wilt series, as well as Porterhouse Blue and Blott on the Landscape, all three of which were adapted for television.", "link_mentions": [{"page": "List of humorists", "response": ["* Tom Sharpe (1928–2013) satirical novelist, best known for his Wilt series, as well as Porterhouse Blue and  Blott on the Landscape."]}, {"page": "Kingsley Amis", "response": ["Days after Sally's birth, Amis's first novel, Lucky Jim, was published to great acclaim. Critics felt it had caught the flavour of Britain in the 1950s and ushered in a new style of fiction.Malcolm Bradbury, 1989, p. 205; Ritchie, 1988, p. 64. By 1972, its impressive sales in Britain had been matched by 1.25 million paperback copies sold in the United States. It was translated into 20 languages, including Polish, Hebrew, Korean, and Serbo-Croat.Jacobs, 1995, p. 162. The novel won the Somerset Maugham Award for fiction and Amis became one of the writers known as the Angry Young Men. Lucky Jim was among the first British campus novels, setting a precedent for later generations of writers such as Malcolm Bradbury, David Lodge, Tom Sharpe and Howard Jacobson. As a poet, Amis was associated with The Movement."]}, {"page": "March 30", "response": ["*  1928   – Tom Sharpe, English-Spanish author and educator (d. 2013)"]}, {"page": "Pembroke College, Cambridge", "response": ["|Tom Sharpe"]}, {"page": "Terry Pratchett", "response": ["Pratchett's earliest inspirations were The Wind in the Willows by Kenneth Grahame, and the works of Isaac Asimov and Arthur C. Clarke. His literary influences were P.G. Wodehouse, Tom Sharpe, Jerome K. Jerome, Roy Lewis, Alan Coren, G. K. Chesterton, and Mark Twain."]}, {"page": "Peterhouse, Cambridge", "response": ["Peterhouse likely was a source of inspiration for Tom Sharpe's Porterhouse Blue."]}, {"page": "Cambridge", "response": ["Fictionalised versions of Cambridge appear in Philippa Pearce's Tom's Midnight Garden and Minnow on the Say, the city renamed as Castleford, and as the home of Tom Sharpe's fictional college in Porterhouse Blue."]}, {"page": "Dorset", "response": ["Dorset is famed in literature for being the native county of author and poet Thomas Hardy, and many of the places he describes in his novels in the fictional Wessex are in Dorset, which he renamed South Wessex.Blamires (pp. 112–114) The National Trust owns Thomas Hardy's Cottage, in Higher Bockhampton, east of Dorchester; and Max Gate, his former house in Dorchester. Several other writers have called Dorset home, including Douglas Adams, who wrote much of The Hitchhiker's Guide to the Galaxy while he lived in Stalbridge; John le Carré, author of espionage novels, was born in Poole; Tom Sharpe of Wilt fame lived in Bridport; John Fowles (The French Lieutenant's Woman) lived in Lyme Regis before he died in late 2005;Blamires (p. 88) T.F. Powys lived in Chaldon Herring for over 20 years and used it as inspiration for the fictitious village of Folly Down in his novel Mr. Weston's Good Wine;Blamires (p. 225) John Cowper Powys, his elder brother, also set a number of his works in Dorset, such as the novels Maiden Castle and Weymouth Sands. Children's author Enid Blyton drew inspiration for many of her works from Dorset. The 19th-century poet William Barnes was born in Bagber and wrote many poems in his native Dorset dialect. Originating from the ancient Norse and Saxon languages, the dialect was prevalent across the Blackmore Vale but has fallen into disuse."]}, {"page": "Ludlow", "response": ["Ludlow has featured in movies and TV programmes including Tom Sharpe's Blott on the Landscape and 90s TV adaptations of The History of Tom Jones, a Foundling and Moll Flanders. In Shakespeare's Richard III, Ludlow is mentioned, as the place where the young Edward V is to be fetched as Richard III plots to seize the crown.  The town is described as the capital of Wales following a zombie apocalypse in the novel World War Z."]}, {"page": "School and university in literature", "response": ["* Tom Sharpe: Wilt"]}, {"page": "Anglia Ruskin University", "response": ["The musician Syd Barrett, songwriter and leading guitarist of the band, Pink Floyd is an alumnus. Author Tom Sharpe was a lecturer in History at CCAT between 1963 and 1972 and Anne Campbell, the Labour MP for Cambridge from 1992 to 2005, was formerly a lecturer in Statistics at CCAT. A blue plaque  to the leading educationalist, Dame Leah Manning, MP was erected  in 2019 at the former ragged school in Young Street acquired by the university in 2006 and subsequently  converted into the Anglia Ruskin University Institute of Music Therapy."]}, {"page": "Selwyn College, Cambridge", "response": ["*In Tom Sharpe's Porterhouse Blue novel, Selwyn College is satirically described as a college founded by 'social justice' devotees. However, the reference does not occur in the Channel 4 television adaption of Porterhouse Blue. In the sequel, Grantchester Grind,  Selwyn is described as an \"academic forcing-house\", as compared with the lax academic standards of the fictional Porterhouse College."]}, {"page": "Lancing, West Sussex", "response": ["Many well-known figures attended Lancing College, including novelists Tom Sharpe and Evelyn Waugh, lyricist Tim Rice and singer Peter Pears."]}, {"page": "Grantchester", "response": ["The footpath to Cambridge that runs beside Grantchester MeadowsCambridge: A Cultural and Literary History Martin Garrett - 2004 -- Page viii 1902669797 \"Its propensity to flood has threaded through Cambridge from the pubs in Grantchester to the Ditton Plough, a broad green ribbon of flood plain — Grantchester Meadows, The Iammas Land, the Backs, Jesus Green, Midsummer Common, ... \" is nicknamed the Grantchester Grind. Grantchester Grind is the title of a 1995 comic novel written by Tom Sharpe. Further upstream is Byron's Pool, named after Lord Byron, who is said (by Brooke, at least) to have swum there. The pool is now below a modern weir where the Bourn Brook flows into the River Cam. Byron's Pool is a Local Nature Reserve."]}, {"page": "Dornford Yates", "response": ["The 1973 novel Indecent Exposure by Tom Sharpe plays up the 'Englishman' that Dornford Yates created in his novels.  There is a group of characters in the satirical novel who style themselves as the 'Dornford Yates' club and who try to emulate the 'Master' in avoiding reality and a changing world. Sharpe was later hired by the BBC to adapt She Fell Among Thieves for television, and used the same satirical approach."]}, {"page": "1928 in literature", "response": ["*March 30 – Tom Sharpe, English satirical author (died 2013)"]}, {"page": "1976 in literature", "response": ["*Tom Sharpe – Wilt"]}, {"page": "1975 in literature", "response": ["*Tom Sharpe – Blott on the Landscape"]}, {"page": "1974 in literature", "response": ["*Tom Sharpe – Porterhouse Blue"]}, {"page": "1971 in literature", "response": ["*Tom Sharpe – Riotous Assembly"]}, {"page": "Humorist", "response": ["* Tom Sharpe (1928–2013) was a satirical novelist, best known for his Wilt series, as well as Porterhouse Blue and Blott on the Landscape."]}, {"page": "Bruce Dickinson", "response": ["During a 1986–1987 Iron Maiden tour, and in the wake of a divorce, Dickinson started writing his first book. Inspired by the novels of Tom Sharpe, in addition to Biggles and Penthouse, he created The Adventures of Lord Iffy Boatrace, which Kerrang! describes as \"a satirical swipe at fetishism among the upper classes\", and whose title character is a \"semi-transvestite\" British land owner."]}, {"page": "Corpus Christi College, Cambridge", "response": ["* In Porterhouse Blue and Grantchester Grind by Tom Sharpe, the college is mentioned several times throughout the books including a scene where the Senior Tutor wakes after having \"dined in Corpus\" the night before with such a bad hangover he becomes convinced he is insane. Corpus also appeared in the television adaptation of Porterhouse Blue."]}, {"page": "George Cole (actor)", "response": ["Cole also played Sir Giles Lynchwood in the BBC's adaptation of the Tom Sharpe novel Blott on the Landscape (1985). Cole starred in a number of comedies, such as The Bounder (1982–83), Comrade Dad (1984–86), Dad (1997–98) and My Good Friend (1995–96)."]}, {"page": "Pietermaritzburg", "response": ["*Tom Sharpe, novelist, who described the city as \"half the size of a New York cemetery and twice as dead\"."]}, {"page": "Bridport", "response": ["Notable people connected with Bridport and its environs include Arthur Lee, 1st Viscount Lee of Fareham and rock musician singer-songwriter PJ Harvey, who were born there, as was first-class cricketer William Hounsell. American painter John Hubbard was based there in the 1960s and 1970s. Writer Tom Sharpe moved to the town in 1978, and socialist musician Billy Bragg lives at nearby Burton Bradstock. Restaurateur Mark Hix grew up in Bridport."]}, {"page": "F. R. Leavis", "response": ["Leavis's uncompromising zeal in promoting his views of literature drew mockery from quarters of the literary world involved in imaginative writing. In a letter that Edith Sitwell wrote to Pamela Hansford Johnson in 1959 she described Leavis as \"a tiresome, whining, pettyfogging little pipsqueak\".Wendy Pollard Pamela Hansford Johnson: Her Life, Work and Times (Shepeard-Walwyn, UK, 2014) . page 280. Leavis (as \"Simon Lacerous\") and Scrutiny (as \"Thumbscrew\") were satirized by Frederick Crews in the chapter \"Another Book to Cross off your List\" of his lampoon of literary criticism theory The Pooh Perplex A Student Casebook. In her novel Possession, A. S. Byatt (who was herself taught by Leavis) wrote of one of her characters (Blackadder) \"Leavis did to Blackadder what he did to serious students: he showed him the terrible, the magnificent importance and urgency of English literature and simultaneously deprived him of any confidence in his own capacity to contribute to or change it.\"A S Byatt Possession (Random House, 1991) pages 27–28. Tom Sharpe, in his novel The Great Pursuit, depicts a ludicrous series of events ending in the hero teaching Leavisite criticism as a religion in the American Bible Belt. In the mock epic heroic poem by Clive James, Peregrine Pykke, the eponymous hero studies literature under the prophet F R Looseleaf at Downing College, Cambridge.Clive James, The improved version of Peregrine Prykke's pilgrimage through the London literary world : a tragic poem in rhyming couplets; with illustrations by Russell Davies (Cape, London, 1976) , page 7"]}, {"page": "Andrew Marshall (screenwriter)", "response": ["They also experimented with a type of neo-Vaudeville style in The Steam Video Company for Thames Television, ultimately ending up at the BBC, writing, with Alexei Sayle, Alexei Sayle's Stuff. Along the way they also wrote the screenplay for a film version of Whoops Apocalypse and adapted Tom Sharpe's novel Wilt for a film of the same title."]}, {"page": "List of fictional Cambridge colleges", "response": ["*Porterhouse College - Porterhouse Blue and Grantchester Grind by Tom Sharpe.  The name suggests Peterhouse, though it is also a pun on college porters and porterhouse steaks. It is also reputedly based loosely on Pembroke, Sharpe's alma mater or Corpus Christi which is next door and its location is somewhere near Peterhouse and Pembroke. Despite this, however, filming for the television series took place at Sidney Sussex College. A Porterhouse College in the (fictional) University of Carrbridge, Inverness-shire has been used in University of Cambridge mathematics exam questions."]}, {"page": "Lancing College", "response": ["* Tom Sharpe, novelist"]}, {"page": "Malcolm Bradbury", "response": ["Bradbury also wrote extensively for television, including scripting series such as Anything More Would Be Greedy, The Gravy Train, the sequel The Gravy Train Goes East (which explored life in Bradbury's fictional Slaka), and adapting novels such as Tom Sharpe's Blott on the Landscape and Porterhouse Blue, Alison Lurie's Imaginary Friends and Kingsley Amis's The Green Man. His last television script was for Dalziel and Pascoe series 5, produced by Andy Rowley. The episode \"Foreign Bodies\" was screened on BBC One on 15 July 2000."]}, {"page": "Comic novel", "response": ["More contemporary British humorists are George MacDonald Fraser, Tom Sharpe, Kingsley Amis, Terry Pratchett, Richard Gordon, Rob Grant, Douglas Adams, Evelyn Waugh, Anthony Powell, Nick Hornby, Helen Fielding, Eric Sykes, Leslie Thomas, Stephen Fry, Richard Asplin, Mike Harding, Joseph Connolly, and Ben Elton."]}, {"page": "Porter (college)", "response": ["The character Skullion from Tom Sharpe's satirical 1974 novel Porterhouse Blue was a fictional head porter reputed to be based on Albert Jaggard, the Head Porter of Corpus Christi during the 1960s and 1970s."]}, {"page": "James H. McClure", "response": ["James McClure was born and raised in South Africa and educated in Pietermaritzburg, Natal, at Scottsville School (1947–51), Cowan House (1952–54), and Maritzburg College (1955–58). He worked first as a commercial photographer with Tom Sharpe, who later wrote a series of celebrated comic novels, and then as a teacher of English and art at Cowan House in 1959–63, before becoming a crime reporter and photographer for the Natal Witness in his home town of Pietermaritzburg."]}, {"page": "Grantchester Grind", "response": ["Grantchester Grind is a novel written by Tom Sharpe, a British novelist born in 1928 who was educated at Lancing College and then at Pembroke College, Cambridge.", "Incidents from Ancestral Vices, another Tom Sharpe novel, are mentioned in crossover.", "*Tom Sharpe", "Category:Novels by Tom Sharpe"]}, {"page": "List of University of Cambridge people", "response": ["*Tom Sharpe (Pembroke)"]}, {"page": "Carnival Films", "response": ["As of 2014, Carnival has produced over 500 hours of drama and comedy for television, cinema and stage. This included 70 episodes of Agatha Christie's Poirot starring David Suchet and 22 episodes of Rosemary & Thyme, starring Felicity Kendal and Pam Ferris. In the action/adventure genre it produced BUGS, Oktober and The Grid, in comedy drama it produced Jeeves and Wooster starring Hugh Laurie and Stephen Fry, teenage drama-comedy As If, as well as the adaptations of Tom Sharpe's novels Blott on the Landscape and Porterhouse Blue."]}, {"page": "Great Shelford", "response": ["Great Shelford was home to children's author Philippa Pearce, who renamed it \"Great Barley\" (with the neighbouring village of Little Shelford becoming \"Little Barley\", and Cambridge itself becoming \"Castleford\" and losing its university) in her books, most notably Minnow on the Say (1955). In this and other books the River Cam, which flows through the village, became the River Say. The writer was brought up in Great Shelford and after some years in London lived there again from 1973 to her death in 2006. Sir Peter Hall, the theatrical director, lived in the station house as a child and the author Tom Sharpe had a house in the village. Writer Michael J. Bird lived in Great Shelford in his last years."]}, {"page": "Ha-ha", "response": ["*A ha-ha with spikes at the bottom features in Tom Sharpe's 1971 black comedy novel Riotous Assembly."]}, {"page": "Alvis Saracen", "response": ["In the Tom Sharpe novel Riotous Assembly, a Saracen is destroyed by an elephant gun fired by Constable Els of the South African Police."]}, {"page": "Porterhouse Blue", "response": ["Porterhouse Blue is a novel written by Tom Sharpe, first published in 1974. A satirical look at Cambridge life and the struggle between tradition and reform, Porterhouse Blue tells the story of Skullion, the Head Porter of Porterhouse, a fictional college of Cambridge University.", "* Tom Sharpe", "Category:Novels by Tom Sharpe"]}, {"page": "Bloxham School", "response": ["*Tom Sharpe, novelist"]}, {"page": "Wilt (novel)", "response": ["Wilt is a comedic novel by Tom Sharpe, first published by Secker and Warburg in 1976. Later editions were published by Pan Books, and Overlook TP. The novel was a bestseller. Its success led to the author writing several sequels. The descriptions of teaching in the novel are drawn from Sharpe's own experience as a lecturer at the Cambridgeshire College of Arts and Technology.", "Tom Sharpe wrote several sequels and additional works featuring Henry Wilt:", "Category:Novels by Tom Sharpe"]}, {"page": "Wilt (film)", "response": ["Wilt, released in North America as The Misadventures of Mr. Wilt, is a 1989 film directed by Michael Tuchner and starring Griff Rhys Jones, Mel Smith, Alison Steadman, and Diana Quick. It is an adaptation by LWT of the 1976 novel Wilt by author Tom Sharpe. The story follows the comic misadventures of the eponymous Henry Wilt as he is accused of the murder of his wife when she suddenly goes missing after a party at a friend's house where they have a very public argument."]}, {"page": "The Champion of the Thames", "response": ["The pub is mentioned in Tom Sharpe's novel Porterhouse Blue, in which it is said to be the character Skullion's favourite pub, although Sharpe changed the pub's name to The Thames Boatman in the novel. It is one of the smaller pubs in Cambridge and is part of the King Street Run, a pub crawl with the object of consuming one pint of beer in each pub in King Street in the quickest time. Since 1992, a team from the pub has played an annual cricket match against a team from the St Radegund for the King Street Trophy.http://cricket.radegund.co.uk/results/1992.htm"]}, {"page": "Blott on the Landscape", "response": ["Blott on the Landscape is a novel by Tom Sharpe which was first published in 1975. The book was adapted into a 6-part television series of the same name for BBC television in 1985.", "Category:Novels by Tom Sharpe"]}, {"page": "Simon Cadell", "response": ["He is best remembered for his role as the well-meaning holiday camp manager Jeffrey Fairbrother in the BBC situation comedy Hi-de-Hi! (1980–84) and for playing the disingenuous civil servant Dundridge in the screen adaptation of a novel by Tom Sharpe, Blott on the Landscape (1985). On radio he played the elven-king Celeborn in the BBC adaptation of The Lord of the Rings (1981). He appeared in the BBC sitcom Life Without George (1987–1989) which ran for three series."]}]}}