{"wiki_id": "http://www.wikidata.org/entity/Q436620", "itemLabel": "Lucy Davis", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucy_Davis", "wikipedia_page": {"main": "Lucy Clare Davis (born 17 February 1973) is an English actress best known for her playing Dawn Tinsley in the BBC comedy The Office (2001–2003). \nShe is also known for her roles as Hilda Spellman in the Netflix series The Chilling Adventures of Sabrina (2018–2020), Dianne in the horror-comedy Shaun of the Dead (2004), and Etta Candy in Wonder Woman (2017).", "link_mentions": [{"page": "List of comedians", "response": ["* Lucy Davis (born 1973)"]}, {"page": "One Foot in the Grave", "response": ["Over the show's history, it featured a number of notable comic actors in one-off roles. These include Susie Blake, John Bird, Tim Brooke-Taylor, Peter Cook, Diana Coupland, Phil Daniels, Edward de Souza, Hannah Gordon, Georgina Hale, Roy Hudd, Jimmy Jewel, Rula Lenska, Stephen Lewis, Paul Merton, Brian Murphy, Christopher Ryan, Jim Sweeney, Barbara Windsor, Joan Sims and Ray Winstone. Two of Angus Deayton's former Radio Active and KYTV co-stars, Geoffrey Perkins and Michael Fenton Stevens were cast, in separate episodes, as respectively the brother and brother-in-law of Deayton's character. A few actors little-known at the time also appeared in one-off roles before going on to greater fame, including Lucy Davis, Joanna Scanlan, Eamonn Walker and Arabella Weir."]}, {"page": "Archie Comics", "response": ["In January 2018, it was announced that Kiernan Shipka has signed on to play the lead role of Sabrina Spellman, and CW president Mark Pedowitz noted that, \"at the moment, there is no discussion about crossing over\" with Riverdale. Throughout February and mid-March 2018, the remaining starring cast members were cast, including Jaz Sinclair as Rosalind Walker, Michelle Gomez as Mary Wardell / Madam Satan, Chance Perdomo as Ambrose Spellman, Lucy Davis as Hilda Spellman, Miranda Otto as Zelda Spellman, Richard Coyle as Father Blackwood, Ross Lynch as Harvey Kinkle, and Tati Gabrielle as Prudence. Salem Saberhagen also appears in the series."]}, {"page": "Ricky Gervais", "response": ["In 2012, Gervais made a guest appearance on Family Guy in the episode titled \"Be Careful What You Fish For\". In the episode, Gervais plays a dolphin named Billy Finn who gives Peter Griffin a Mercedes-Benz hood ornament, and Peter half-heartedly promises a favour to him. Soon, Billy moves to Quahog but outstays his welcome at Peter's. Peter tries to reunite Billy with his ex-wife in hopes that he will return to the ocean. The episode also featured Lucy Davis, with whom Gervais starred in The Office."]}, {"page": "The Office", "response": ["|Receptionists||Dawn Tinsley(Lucy Davis)||Pam Beesly(Jenna Fischer)Erin Hannon(Ellie Kemper) || Tanja Seifert(Diana Staehly)||Laetitia Kadiri(Anne-Laure Balbir)||Anne Viens(Sophie Cadieux)||Rocío Poblete(Nathalia Aragonese)||Dana(Mali Levi)||Therese Johansson(Sissela Benn)"]}, {"page": "Laura Sadler", "response": ["Sadler was born in Ascot, Berkshire, and grew up in High Wycombe, Buckinghamshire. As a young girl she enrolled at the Jackie Palmer Stage School in High Wycombe, before joining the Sylvia Young Theatre School in London. She was spotted as a future talent at the age of six by Dustin Hoffman, who had seen her in a play and asked to meet her. Before joining the cast of Holby City, her best-known role had been as the character Judi Jeffreys in the children's television series Grange Hill from 1997 to 1999. Her Grange Hill character was killed after slipping and falling out of a burning building, tragically paralleling her real-life death four years later. Laura also played the part of Skirty Marm in a BBC1 children's comedy, Belfry Witches. Skirty Marm and her friend Old Noshie (Lucy Davis) were teenage witches banished to Earth from Witch Island, settling in a sleepy village where they caused mischief."]}, {"page": "List of show business families", "response": ["* Comedian, Jasper Carrott (born Robert Davis), is the father of actress, Lucy Davis."]}, {"page": "Black Books", "response": ["The audio commentary for Shaun of the Dead states that Black Books is considered by the producers to be a sister show of the 1999 Channel 4 sitcom Spaced, also produced by Nira Park. The show features several actors from Spaced, while in one episode Manny is heard speaking to Twist Morgan, a character from Spaced. Simon Pegg guest-starred as Bill Bailey's boss in another episode, an inversion of their roles in Spaced; Nick Frost appeared at the beginning of the episode \"The Big Lockout\" to install a new security system for the shop, though lost Manny's attention when he spotted a Subbuteo player in his hair; Kevin Cecil, one of the Black Books writers, appeared in Spaced playing the character of Harris; Jessica Stevenson made an appearance as a friend of Fran's, who was trying to help her live a healthier lifestyle with attempts to change her diet and get her to exercise more; Peter Serafinowicz played a radio broadcaster whose dulcet tones reading the shipping forecast drove Fran wild with desire; Omid Djalili appeared in \"He's Leaving Home\" as an opportunistic photographer; Rob Brydon appeared in Season 2's episode \"The Fixer\". Both Lucy Davis (The Office, Shaun of the Dead) and Olivia Colman (Peep Show, Hot Fuzz) appeared in Season 3's episode \"Elephants and Hens\"."]}, {"page": "Lucy", "response": ["* Lucy Davis (born 1973), English actress", "* Lucy Davis (born 1992), American equestrian"]}, {"page": "Shaun of the Dead", "response": ["Shaun of the Dead is a 2004 zombie comedy film directed by Edgar Wright. The film was written by Wright and Simon Pegg, who stars in it as Shaun. Along with friend Ed, played by Nick Frost, Shaun is caught unaware by the zombie apocalypse; they attempt to take refuge in a local pub with their loved ones. The film co-stars Kate Ashfield, Lucy Davis, Dylan Moran, Bill Nighy, and Penelope Wilton. It is the first installment in the Three Flavours Cornetto trilogy, followed by Hot Fuzz (2007) and The World's End (2013)."]}, {"page": "Metropolitan Borough of Solihull", "response": ["*Lucy Davis - Daughter of Jasper Carrott. Born and raised in Solihull"]}, {"page": "David Walliams", "response": ["Walliams performed in the Big Finish Productions Doctor Who audio play Phantasmagoria, written by Mark Gatiss in 1999. In 2005, Walliams, Simon Pegg, Lucy Davis and Lauren Laverne starred in the video for Charlotte Hatherley's single \"Bastardo\". Later in the year, Walliams presented a documentary on James Bond, entitled David Walliams: My Life with James Bond. In 2007, he returned to non-comedy television, garnering positive reviews for his portrayal of a suave and dangerous manipulator in Stephen Poliakoff's Capturing Mary."]}, {"page": "Jasper Carrott", "response": ["Carrott married journalist Hazel Jackson in 1972. He is the father of actress Lucy Davis."]}, {"page": "Pride and Prejudice (1995 TV series)", "response": ["* Lucy Davis as Maria Lucas"]}, {"page": "Stephanie Cole", "response": ["Cole was voted Solihull's favourite Silhillian in a competition run by Solihull Council in December 2006. She beat Lucy Davis, Martin Johnson and Richard Hammond to pick up the top crown in The S Factor."]}, {"page": "Audio commentary", "response": ["* On the DVD release of Shaun of the Dead, one (of the four) commentary tracks is given over entirely to a recording of the actors who played zombies in the movie. The first cast audio commentary (including Simon Pegg, Nick Frost, Kate Ashfield, Lucy Davis and Dylan Moran) also mocks audio commentaries as the cast admit that they almost never listen to them (with Pegg claiming he listens to them when going to sleep), as well as Moran saying that they simply involve people saying things like \"oh, we used a steadi-cam for that one because Roger had a bad knee\", and that no-one was interested in hearing it."]}, {"page": "Kidney transplantation", "response": ["* Lucy Davis (born 1973), English actress, transplant in 1997"]}, {"page": "Sex Lives of the Potato Men", "response": ["*Lucy Davis as Ruth"]}, {"page": "Dorridge", "response": ["There are a number of notable residents who live here or very nearby, Jasper Carrott, The Office actress Lucy Davis, Sir Adrian Cadbury, Karren Brady former managing director of Birmingham City F.C, Steve Bruce, former manager of Birmingham City F.C, former England International Lee Hendrie, and Catriona Hamilton formerly lived here, alongside many other professional footballers and Musicians Bev Bevan, Harry Sutcliffe and Russell Leetch."]}, {"page": "Back for Good (song)", "response": ["The song was featured on the final episode of the second series of Spaced, in which Tim, Brian, and Mike, along with Mike's Territorial Army buddies, attempt to play the song for Marsha, a la the boombox scene from Say Anything... It also featured in the final episode of Ricky Gervais and Stephen Merchant's The Office as a love theme for characters Tim (Martin Freeman) and Dawn (Lucy Davis). Gary Barlow stated on ITV1's An Audience with Take That Live broadcast on 2 December 2006 that there were 89 versions recorded by other artists."]}, {"page": "The Office (American TV series)", "response": ["Four of the show's writers have also performed in front of the camera. B. J. Novak was the first person to be hired on the cast as the reluctant temp Ryan Howard after Daniels saw his stand-up act. Paul Lieberstein was cast as human resources director Toby Flenderson on Novak's suggestion after his cold readings of scripts. Greg Daniels was originally unsure where to use Mindy Kaling on-screen in the series until the opportunity came in the script for the second episode, \"Diversity Day\", where Michael needed to be slapped by a minority. \"Since [that slap], I've been on the show\" (as Kelly Kapoor), says Kaling. Michael Schur has also made several guest appearances as Dwight's cousin Mose, and consulting producer Larry Wilmore has played diversity trainer Mr. Brown. Plans were made for Mackenzie Crook, Martin Freeman, and Lucy Davis, from the British series, to appear in the third season,Johns, Anna. July 11, 2006. British cast to appear on American version of The Office , TVSquad.com. Retrieved on April 12, 2008. but those plans were scrapped due to scheduling conflicts.Daniels, Greg. The Office: Live Blog, November 2006. Blog.NBC.com. Retrieved on April 12, 2008; however, Ricky Gervais did make two appearances in the show's seventh season as David Brent.Mitovich, Matt. July 10, 2006. The Offices U.K. Mates to Cross Over , TVGuide.com. Retrieved on April 12, 2008."]}, {"page": "The Office (British TV series)", "response": ["The other main plot line of the series, and many of the more human elements found therein, come from the unassuming Tim Canterbury (Martin Freeman), whose relationship with bored receptionist Dawn Tinsley (Lucy Davis) is a major arc in the series. Their flirtation soon builds to a mutual romantic attraction, despite her engagement to dour and laddish warehouse worker Lee (Joel Beckett).", "* Lucy Davis as Dawn Tinsley:the company receptionist and Brent's dogsbody. She frequently has to put up with his attempts at humour and social interaction. Like her friend and co-worker Tim, she is aware of the miserable state of her life – she has been in an unhappy engagement with her fiancé Lee, a boorish warehouse worker, and gave up illustrating children's books to pursue her current pointless career. During the Christmas special, Dawn and Lee return from their illegally prolonged US vacation. She finally leaves Lee for the long-suffering Tim, after he encourages her to hold on to her dream of being a children's book illustrator, an ambition which Lee sought to put down at every opportunity."]}, {"page": "Solihull Sixth Form College", "response": ["*Lucy Davis, actress"]}, {"page": "The TV Set", "response": ["* Lucy Davis as Chloe McCallister"]}, {"page": "Studio 60 on the Sunset Strip", "response": ["* Lucy Kenwright (Lucy Davis) is a junior writer on the show and the only pre-Matt and Danny writer to remain after Ricky and Ron's departure. Lucy and Darius were supposed to get their first sketch on the air in \"B-12\". The sketch was about a bungling hostage taker, but was cancelled when a real-life hostage-taker killed his entire family and then himself just after that evening's show started. During the course of the show, Lucy begins dating Tom Jeter."]}, {"page": "Garfield: A Tail of Two Kitties", "response": ["The film stars Breckin Meyer and Jennifer Love Hewitt reprising their roles as Jon Arbuckle and Dr. Liz Wilson respectively, and Bill Murray reprising his role as the voice of Garfield. New cast members include Billy Connolly, Ian Abercrombie, Roger Rees, Lucy Davis and Oliver Muirhead in live-action roles and Tim Curry, Bob Hoskins, Rhys Ifans, Vinnie Jones, Joe Pasquale, Richard E. Grant, Jane Leeves and Roscoe Lee Browne as the voices of the film's new animal characters. In the film, Garfield, Odie, Liz and Jon travel to the United Kingdom, where Prince, another cat that looks exactly like Garfield, is ruling over a castle after the death of his owner. His reign is soon jeopardized by an evil aristocrat, who plans to remodel the castle into condominiums, destroy the estate, and get rid of Prince.", "* Lucy Davis as Abby Westminister, a solicitor"]}, {"page": "2006 in Wales", "response": ["*9 December - Welsh actor Owain Yeoman marries Lucy Davis at St Paul's Cathedral in London."]}, {"page": "SF Sketchfest", "response": ["Children's book author Mo Willems made his picture books into sketch comedy with \"Don't Let the Comedians Do Storytime!,\" a show for kids with guest stars including Patton Oswalt, Maya Rudolph, Michael Ian Black, Laraine Newman and more. Reggie Watts returned for a second \"Reggidency\" series, this time collaborating with The Amy O'Neal Dance Crew, Michael Winslow, Robert Glasper and drummer Chris Dave. Maya Rudolph and Gretchen Lieberum appeared as Princess, doing an evening of Prince cover songs. Other events and performers included SEX a.k.a. Wieners and Boobs, a play written by and starring Joe Lo Truglio, Michael Showalter and David Wain;Robin Hardwick, \", \"Watching The State's Revival of 'Sex a.k.a. Weiners and Boobs' at San Francisco Sketchfest\", \"Splitsider.com\", February 12, 2013 The Thrilling Adventure Hour with guests including Jonathan Coulton, Colin Hanks, John Hodgman, Gillian Jacobs, Keegan-Michael Key, Autumn Reeser, John Roderick, Rider Strong and James Urbaniak; Celebrity Autobiography with Maria Bamford, Roger Bart, Jennifer Coolidge, Rachel Dratch, Janeane Garafalo, Andy Kindler, Laraine Newman, Kevin Pollak, Maya Rudolph and Fred Willard; Uptown Showdown Debate with Michael Ian Black, Michael Showalter and more; Upright Citizens Brigade ASSSSCAT improv with Matt Besser, Ian Roberts, Scott Adsit and monologist Lucy Davis; Drew Carey and The Midnight Show; Jeff Garlin's Combo Platter; Naked Human Giant Babies with John Ross Bowie, Rob Corddry, Seth Morris, Rob Huebel and Paul Scheer; The 313 Improv featuring Keegan-Michael Key and Marc Evan Jackson; Theme Park Improv with Rachel Dratch, Simon Helberg, Michael Hitchcock, Jessica Makinson, Oscar Nunez, Cole Stratton, Janet Varney and monologist Erinn Hayes; Gravid Water with Scott Adsit, Lucy Davis and more; the return of w00tstock Founders Night with Adam Savage, Wil Wheaton and Paul and Storm; Yacht Rock Heroes with Mustache Harbor and Friends; Garfunkel & OatesDakin Hardwick, \", \"10 Quick Questions: an Interview with Garfunkel & Oates\", \"Spinningplatters.com\", February 4, 2013 with Dragon Boy Suede; Billy Eichner and Friends with Julie Klausner, Retta and more; The Mortified Sessions Onstage; The Chris Gethard Show; Crash Test with Rob Huebel and Paul Scheer; Delocated Witness Protection Program Variety Show with Jon Glaser and musical guest Bob Mould; Kristen Schaal and Friends; The Meltdown with Jonah Ray and Kumail Nanjiani; Paul F. Tompkins and Friends Real & Fake; Stella The Classic Nightclub Show; Team Coco Live with Andy Richter; Competitive Erotic Fan Fiction; Iron Comic All-Stars; R. Kelly's Trapped in the Closet Sing-Along; Stardumb with Bil Dwyer; Write Now with Jimmy Pardo; and stand-up from Nick Kroll, Jeff Garlin, Judah Friedlander, Tim Heidecker, Neil Hamburger, Dr. Brown, Brent Weinbach, Drennon Davis, Wayne Federman, Ian Edwards, Brody Stevens, Rory Scovel, Andres du Bouchet, Moshe Kasher and Natasha Leggero.", "Events celebrating improv comedy included the yearly Upright Citizens Brigade ASSSSCAT with Matt Besser, Ian Roberts, Matt Walsh, Jon Gabrus, Jessica McKenna, and special guest monologist Nathan Fillion; Wild Horses with Stephanie Allynne, Mary Holland and Erin Whitehead and special guest Tig Notaro; Zamata and Byer with Sasheer Zamata and Nicole Byer; Theme Park Improv with Rachel Dratch, John Michael Higgins, Michael Hitchcock, Jessica Makinson, Oscar Nunez, Cole Stratton, Janet Varney, and guest monologist Jon Hamm; Dr. God with guest Matthew Lillard; The Black Version with Jordan Black, Nyima Funk, Daniele Gaither, Phil LaMarr, Karen Maruyama, Gary Anthony Williams, and Cedric Yarbrough; The Improvised Shakespeare Company; The Groundlings: Teen Witch The Musical with Jordan Black, Stephanie Courtney, H Michael Croner, Nyima Funk, Tom Lenk, Artemis Pebdani, Amy Procacci, Nicole Sciacca, Colleen Smith and Mike Zara; The Groundlings: Crazy Uncle Joe Show and Personals, with Jordan Black, Regan Burns, Stephanie Courtney, Lyric Lewis, Brian Palermo, Annie Sertich, Phil LaMarr and more; Gravid Water with Suzi Barrett, Lucy Davis, Tom Lenk, Kevin Pollak, Stephen Ruddy, Maria Thayer and Matt Walsh; WorkJuice Players Improv", "Several one-of-a-kind Theatrical events populated the festival, including a live performance from Rachel Bloom; The Kids in the Hall: Brain Candy Live Staged Reading with Dave Foley, Bruce McCulloch, Kevin McDonald, Mark McKinney and Scott Thompson; Double Bill: Bill Irwin & Bill Frisell Perform Songs and Scenes from Vaudeville with guests Geoff Hoyle and Kenny Wollesen; Soundtracks Live: Scenes & Songs from a Classic 80s Movie: A Benefit for 826 Valencia with Matt Ballard, Michael Ian Black, Beth Dover, Joe Lo Truglio, Chelsea Peretti, Marisa Ryan, Michael Showalter, Bobby Tisdale, David Wain and music by Amy Miles; Audible presents Bedtime Stories for Cynics with guest host Natasha Leggero, featuring Aisling Bea, Emmy Blotnick, Tony Hale and more; Plan 9 From Outer Space Live Staged Reading with Scott Adsit, Bill Corbett, Jeff B. Davis, Dana Gould, Ron Lynch, Nate Mooney, Kevin Murphy, Arden Myrin, Paco Romane, Eban Schletter and Janet Varney; Kirsten Vangsness: MESS; Laraine Newman: The Audition; The Latino Comedy Project: Gentrif*cked; Celebrity Autobiography with Lucy Davis, Tony Hale, Wendie Malick, Laraine Newman, Eugene Pack, Dayle Reyfel, Fred Willard, and Cedric Yarbrough; Fake TED Talks with Paul and Storm, Adam Savage, Chuck Bryant, Jonathan Coulton, Samm Levine and Kirsten Vangsness; Audible presents Timothy McSweeney's Internet Tendency Live with host Caitlin Gill and guests Michael Ian Black, Joel Kim Booster, Jonathan Coulton and Claudia O’Doherty; Reunited with Josh Androsky and Bryan Cook and guests Michael Hitchcock, Jessica Makinson, Gareth Reynolds and Heather Thomson; KISS and Tell with Wayne Federman, Pat Francis, Dave Holmes and Cole Stratton; and Turning Tricks – the magic of Eric Buss, Robert Strong and Christian Cagigal.", "Many special Television events appeared at the fest, including a Spotlight on FX's Better Things with Pamela Adlon, Diedrich Bader, Greg Cromer, Lucy Davis, Rebecca Metz, Alysia Reiner and Kevin Pollak;  a Spotlight on Baskets with Louie Anderson, Zach Galifianakis, Martha Kelly and Jonathan Krisel, moderated by Chuck Bryant; Animaniacs 25th Anniversary Songs and Stories with Rob Paulsen, Randy Rogel and Maurice LaMarche; Audible Presents Dr. Katz: The Audio Files Jonathan Katz and guest patients Paul Feig, Kate Micucci, Scott Thompson, Baron Vaughn and Fred Willard; Comedy Central’s Corporate Retreat with Matt Ingebretson, Jake Weisman, Lance Reddick, Anne Dudek, Adam Lustick, Aparna Nancherla and Pat Bishop, moderated by Joel Kim Booster; Crashing Live with Pete Holmes, Jamie Lee and Steve Agee; Futurama Live from Omicron Persei 8 with David X. Cohen, John DiMaggio, David Herman, Maurice LaMarche, Phil LaMarr, Lee Supercinski and Billy West; Rocko’s Modern Life 25th Anniversary with Charlie Adler, Carlos Alazraqui, Tom Kenny and Doug Lawrence,  hosted by Phil LaMarr; and a Spotlight on ABC's Speechless with Minnie Driver, John Ross Bowie and Cedric Yarbrough.", "Theatrical events included An Afternoon with Bill Burr, in conversation with Kevin Pollak; Rachel Bloom and Friends; Audible presents Stinker Lets Loose! with Jon Hamm, Busy Philipps, Paul F. Tompkins, John DiMaggio, Andy Richter, Janet Varney, Kevin Pollak, Steve Agee, Mark Gagliardi, Eric Martin, Justin Michael, Mark Rozzo and Mike Sacks; The Boy in the Plastic Bubble: A Very Special Staged Reading with Dana Gould, Scott Adsit, Deborah Baker, Jr., Maria Bamford, Ron Lynch, Nate Mooney, Steven Ogg, and Janet Varney; Celebrity Autobiography with Peter Asher, Barry Bostwick, Lucy Davis, Gina Gershon, Laraine Newman, Eugene Pack, Dayle Reyfel and Fred Willard;  Fake TED Talks with Jonathan Coulton, Jean Grae, Travis McElroy, Paul and Storm, Mike Phirman, and Kirsten Vangsness; Selected Shorts: Too Hot For Radio with David Cross, Jane Kaczmarek, Lance Reddick, David Strathairn and host Aparna Nancherla;  Soundtracks Live: Scenes and Songs from a Classic 80s Movie with Fred Armisen, Matt Ballard, Owen Burke, Rachel Dratch, Thomas Lennon, Jack McBrayer, A.D. Miles, Paula Pell, Michael Showalter, Bobby Tisdale, David Wain and music by Amy Miles – A Benefit for 826 Valencia; and Worst First Chapter with Ben Acker, Jean Grae, Tony Hale, Travis McElroy, Paul and Storm and Kirsten Vangsness.", "Events focused on Improv Comedy included Morzouksnick with Seth Morris, Jason Mantzoukas and Nick Kroll; Audible presents The Bat: Improv in the Dark with Scott Adsit, John Ross Bowie, Lucy Davis, Cole Stratton, Janet Varney and Gary Anthony Williams; The Black Version with Jordan Black, Nyima Funk, Daniele Gaither, Phil LaMarr, Gary Anthony Williams and Cedric Yarbrough; Upright Citizens Brigade ASSSSCAT with Matt Besser, Ian Roberts and Matt Walsh and Jon Gabrus, Jessica McKenna, Horatio Sanz and guest monologist David Wain; Facebook Improv with Owen Burke, Chad Carter, Jack McBrayer, Seth Morris and Charlie Sanders; Theme Park Improv with Ian Brennan, Rachel Dratch, John Michael Higgins, Michael Hitchcock, Thomas Lennon, Jessica Makinson, Oscar Nunez, Cole Stratton and Janet Varney and guest monologist Paget Brewster;  The Improvised Shakespeare Company; Playhouse Masterpieces with Neil Campbell and Paul Rust; Wild Horses with Stephanie Allynne, Mary Holland, Lauren Lapkus and Erin Whitehead and guest Lucy Davis; Spontaneanation with Paul F. Tompkins and guests Eugene Cordero, Tony Hale, Tawny Newsome, Eban Schletter and Janet Varney; Gravid Water with Paget Brewster and more; Workjuice Improv with Craig Cackowski, Mark Gagliardi, Marc Evan Jackson, Hal Lublin, Busy Philipps, Annie Savage, Paul F. Tompkins and Janet Varney; The Groundlings: Cookin’ with GAS and The Crazy Uncle Joe Show with Jordan Black, Brian Palermo, Edi Patterson, Jim Rash, Jeremy Rowley, Lisa Shurga, Mindy Sterling and Gary Anthony Williams; Speechless SF with Scott Adsit, Mary Holland, and Maribeth Monroe; and UCB East vs. UCB West Harold Competition.", "Other theatrical events included The Roast of Peaches Christ, in celebration of her 45th birthday with Clea DuVall, Heklina, Heather Matarazzo, Jinkx Monsoon, Cassandra Peterson (aka Elvira, Mistress of the Dark), Sister Roma, Mink Stole, Roast Mistress Coco Peru and surprise guest John Waters; Audible presents The Pole Vault Championship of the Entire Universe with Bill Corbett, Lucy Davis, Kevin Murphy, Andy Richter, Eliza Skinner, Paul F. Tompkins, Janet Varney and “Weird Al” Yankovic; Celebrity Autobiography with Cristela Alonzo, Ed Begley, Jr., Jennifer Coolidge, Michael Hitchcock, Michael McKean, Laraine Newman, Eugene Pack and Dayle Reyfel; Fake TED Talks with Jonathan Coulton, Jean Grae, Paul and Storm, Adam Savage and Rebecca Watson; Peaches Christ & Varla Jean Merman in THE WHINING: A drag parody of the Stephen King classic; Selected Shorts: Too Hot For Radio with Hope Davis, Neil Patrick Harris, John Cameron Mitchell and host Aparna Nancherla;  Tilda Swinton Answers an Ad on Craigslist with Tom Lenk, Byron Lane, Jayne Entwistle, Mark Jude Sullivan and Tom Detrinis; Audible presents Bad Reception with Mary Holland, Lauren Lapkus, Eric Martin, Jessica McKenna, Justin Michael, Zach Reino and more; and Worst First Chapter with Ben Acker, Jonathan Coulton, Dana Gould, Jean Grae, Christopher Moore, Paul and Storm, Laser Malena-Webber and more (A Benefit for 826 Valencia)."]}, {"page": "Grey Will Fade", "response": ["As Ash were taking a break from touring in September 2004, Hatherley embarked on her debut solo tour, playing a handful of UK shows. \"Bastardo\" was released as a single on 21 February 2005; the CD version featured \"3 Minutes\" and \"I Am a Kamera\" as extra tracks, while the DVD version included audio versions of \"Bastardo\" and an acoustic version of \"Kim Wilde\", and videos for \"Bastardo\", and a making-of feature. Grey Will Fade was released in the United States on 4 April 2005. It was released in Japan in May 2005 in two editions: a CD with \"3 Minutes\" and \"I Am a Kamera\" as extra tracks, the other adding a bonus DVD with the music videos for \"Summer\" and \"Bastardo\". Edgar Wright directed both videos; \"Summer\" incorporated animation, while \"Bastardo\" featured appearances from Simon Pegg, Lucy Davis, and David Walliams."]}, {"page": "Etta Candy", "response": ["Beatrice Colen portrayed Etta in the 1970s Wonder Woman series. The character made her cinematic debut in the DC Extended Universe in the 2017 film Wonder Woman, played by Lucy Davis. She has been portrayed in animated film by voice actors Julianne Grossman and Adrienne C. Moore.", "* Etta Candy is portrayed by Lucy Davis in the 2017 Wonder Woman film, in the character's first live action theatrical appearance.Wonder Woman (2017 film) In this version, she is portrayed as red-haired and British, and works as Steve Trevor's secretary. In Wonder Woman 1984, an elderly Etta is seen in a photograph with Diana near the shore of New York City, implying that they remained good friends."]}, {"page": "January 1973", "response": ["*Born: Lucy Davis, English actress, in Solihull"]}, {"page": "List of Family Guy guest stars", "response": ["|Lucy Davis"]}, {"page": "Blue Heaven (1994 TV series)", "response": ["Blue Heaven is a British television sitcom that starred Frank Skinner, Conleth Hill, John Forgeham, Nadim Sawalha and Paula Wilcox. It featured guest stars such as Bill Bailey, Bob Goody, Tamsin Greig, Lucy Davis, Beryl Reid, Philip Glenister and John Thomson."]}, {"page": "The Convention (The Office)", "response": ["Greg Daniels, executive producer and showrunner of The Office, had hoped to get Mackenzie Crook, Martin Freeman, and Lucy Davis from the original British Office series to appear in the episode as their respective characters (Gareth Keenan, Tim Canterbury, and Dawn Tinsley), but he was unsuccessful due to scheduling conflicts."]}, {"page": "List of The Office (British TV series) episodes", "response": ["Brent tries to be a friend and an entertainer as well as a boss, and is often annoying as a result. His sycophantic assistant Gareth Keenan (Mackenzie Crook) annoys and is often pranked by sales representative Tim Canterbury (Martin Freeman), whose relationship with receptionist Dawn Tinsley (Lucy Davis) is a major story arc, despite her engagement to warehouse worker Lee (Joel Beckett). Minor characters include droning and crass office worker Keith Bishop (Ewen MacIntosh), Brent's brash and sexist friend Chris Finch (Ralph Ineson) and Brent's bosses Jennifer Taylor-Clarke (Stirling Gallacher) and later Neil Godwin (Patrick Baladi)."]}, {"page": "The Office Christmas specials", "response": ["The Office Christmas specials are the two-part series finale episodes of the British mockumentary comedy television series The Office. The specials were commissioned after the series' creators, Ricky Gervais and Stephen Merchant, announced that they would not write a full third series of the show. The first 45-minute part was broadcast on BBC One on 26 December 2003, and the second 50-minute part was shown the following evening. The episodes are presented in the style of \"revisited\" documentaries common on British television, in which popular \"docusoaps\" (e.g. Airport), are brought back for one-off specials several years after the series concluded. David Brent (Gervais), forcibly made redundant at the end of the second series, is now a travelling salesman of cleaning supplies. Tim Canterbury (Martin Freeman) and Gareth Keenan (Mackenzie Crook) are still working at the offices of Wernham Hogg, and former Wernham Hogg receptionist Dawn Tinsley (Lucy Davis) now lives in Florida, though is flown back to Britain by the documentary crew to reunite with her old colleagues.", "Three years after the documentary that made them famous, a different documentary crew revisits the office to see what the staff members are doing now. After being made redundant from Wernham Hogg, David Brent (Ricky Gervais) is now a travelling salesman who, following a failed single release of a cover of \"If You Don't Know Me By Now,\" leeches off what little fame he has in a series of demeaning nightclub appearances alongside minor celebrities (such as Howard from the Halifax ads and former Big Brother 2 housemate Paul \"Bubble\" Ferguson). Dawn Tinsley (Lucy Davis) lives in Florida, trapped in a miserable existence with fiancé Lee (Joel Beckett), who is bouncing from job to job as they live with his sister rent-free and hidden from immigration authorities. In the office, Gareth Keenan (Mackenzie Crook) is now the general manager and Tim Canterbury (Martin Freeman) is still trapped in a job he hates with an obnoxious, pregnant desk-mate Anne (Elizabeth Berrington). Despite leaving Wernham Hogg three years ago, Brent still visits the office to see the staff and \"keep up the morale\". This does not sit well with Gareth or David's former boss Neil Godwin (Patrick Baladi), and it appears to the viewer that Brent misses his old job. When the programme makers offer to fly Dawn and Lee back for the office Christmas party, along with the appearance of David Brent, the scene is set for a reunion.", "The following year it was nominated for the Primetime Emmy Award for Outstanding Made for Television Movie.\"Outstanding Made For Television Movie\". Academy of Television Arts & Sciences. Retrieved on 21 October 2008. Gervais and Merchant received a nomination for Outstanding Writing for a Miniseries, Movie or a Dramatic Special.\"Outstanding Writing For A Miniseries, Movie Or A Dramatic Special\". Academy of Television Arts & Sciences. Retrieved on 21 October 2008. The episodes won in the Outstanding Achievement in Movies, Mini-series & Specials category at the American Television Critics Association Awards. The award was collected by Lucy Davis.\"TCA Awards winners\". Television Critics Association. Retrieved on 21 October 2008."]}, {"page": "Hilda Spellman", "response": ["Hilda appears in the Netflix series Chilling Adventures of Sabrina, based on the eponymous comic. She is played by Lucy Davis. Retaining her full name from Sabrina the Teenage Witch, Hildegarde Antoinette Spellman."]}, {"page": "The Box and the Bunny", "response": ["*Lucy Davis - Fashion TV Host"]}, {"page": "List of Studio 60 on the Sunset Strip characters", "response": [" (Lucy Davis) is an English junior writer on the show and the only pre-Matt and Danny writer to remain after Ricky and Ron's departure. She then begins a romantic relationship with Tom Jeter."]}, {"page": "List of organ transplant donors and recipients", "response": ["|Lucy Davis"]}, {"page": "Owain Yeoman", "response": ["Yeoman was married to actress Lucy Davis from December 2006 to October 2011. His first marriage took place at St Paul's Cathedral, London. Davis and Yeoman were permitted to marry there as her father Robert (better known by his stage name Jasper Carrott) had been awarded an OBE in the New Year's Honours in 2002. On 7 September 2013, Yeoman married jewellery designer Gigi Yallouz at a private estate in Malibu, California. They have one daughter named Ever Belle. "]}]}}