{"wiki_id": "http://www.wikidata.org/entity/Q436451", "itemLabel": "Ruth Sheen", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Sheen", "wikipedia_page": {"main": "Ruth Sheen is an English actress. From the late 1980s, she has appeared in British television shows, films and plays. A participant in the films of Mike Leigh, she won the European Film Award for Best Actress for her performance as Shirley in Leigh's High Hopes (1988).", "link_mentions": [{"page": "Berkeley Square (TV series)", "response": ["*Ruth Sheen as Nanny Simmons"]}, {"page": "2000 in film", "response": ["| Don Quixote || TNT / Hallmark Entertainment || Peter Yates (director); John Mortimer (screenplay); John Lithgow, Bob Hoskins, Isabella Rossellini, Vanessa Williams, Lambert Wilson, Amelia Warner, Tony Haygarth, Peter Eyre, Lilo Baur, James Purefoy, Trevor Peacock, Linda Bassett, Barry Stanton, Alun Raglan, Michael Feast, Graham Crowden, Amparo Valle, Alicia Borrachero, Ruth Sheen, Sean Gilder, Francis Magee, Jessica Oyelowo, Michael Culkin, Timothy Bateson, Antonio Gil || Adventure, Comedy, Romance || Live action"]}, {"page": "2002 in film", "response": ["| All or Nothing || United Artists || Mike Leigh (director/screenplay); Timothy Spall, Lesley Manville, James Corden, Alison Garland, Ruth Sheen, Marion Bailey, Paul Jesson, Sam Kelly, Kathryn Hunter, Sally Hawkins, Helen Coker, Daniel Mays, Ben Crompton, Robert Wilfort, Gary McDonald, Dorothy Atkinson, Alan Williams || Drama || Live Action"]}, {"page": "1996 in film", "response": ["| The Young Poisoner's Handbook || C/FP Distribution || Benjamin Ross (director/screenplay); Jeff Rawle (screenplay); Hugh O'Conor, Tobias Arnold, Ruth Sheen, Roger Lloyd-Pack, Norman Caro, Charlotte Coleman, Jack Deam, Vilma Hollingbery, Frank Mills, Rupert Farley, Malcolm Sinclair, Charlie Creed-Miles, Antony Sher, Cate Fowler, Hazel Douglas, Arthur Cox, John Thomson, Simon Kunz, Tim Potter, Dorothea Alexander, Paul Stacey, Samantha Edmonds, Robert Dem, Peter Pacey, Joost Siedhoff, Dirk Robertson, John Abbott, Jean Warren, Frank Coda, Anna Kollenda, Katja Kollenda || Black Comedy, Crime, Drama || Live action", "| Secrets & Lies || October Films || Mike Leigh (director/screenplay); Marianne Jean-Baptiste, Brenda Blethyn, Timothy Spall, Phyllis Logan, Claire Rushbrook, Elizabeth Berrington, Michele Austin, Lee Ross, Lesley Manville, Ron Cook, Emma Amos, Brian Bovell, Trevor Laird, Clare Perkins, Jonny Coyne, Peter Wight, Gary McDonald, Alison Steadman, Liz Smith, Sheila Kelley, Phil Davis, Anthony O'Donnell, Ruth Sheen, Mia Soteriou || Drama || Live action"]}, {"page": "1988 in film", "response": ["*High Hopes, directed by Mike Leigh, starring Phil Davis, Ruth Sheen and Lesley Manville (U.K.)"]}, {"page": "Jim Broadbent", "response": ["In 2010, Broadbent reunited with director Mike Leigh, in Another Year with Ruth Sheen, and Lesley Manville. The film premiered at the 2010 Cannes Film Festival in competition for the Palme d'Or. According to review aggregation website, Rotten Tomatoes, 93% of critics have given the film a positive review, with the critical consensus reading, \"Characterized by strong performances and the director's trademark feel for the nuances of everyday life, Another Year marks another solid entry in Mike Leigh's career of kitchen-sink English drama.\""]}, {"page": "Mike Leigh", "response": ["In 2010, Leigh released his film, Another Year starring Jim Broadbent, Ruth Sheen, and Lesley Manville. It premiered at the 2010 Cannes Film Festival in competition for the Palme d'Or. The film was shown at the 54th London Film Festival before its general British release date on 5 November 2010. The film was also a success in the United States with film critic Roger Ebert giving the film his highest rating, four out of four stars writing, \"Not quite every year brings a new Mike Leigh film, but the years that do are blessed with his sympathy, penetrating observation, and instinct for human comedy...Leigh's “Another Year” is like a long, purifying soak in empathy.\" At the 83rd Academy Awards, Leigh was nominated for an Oscar for Best Original Screenplay losing to The King's Speech.David Seidler winning Best Original Screenplay for \"The King's Speech\"-Oscars on YouTube2011|Oscars.org"]}, {"page": "Secrets & Lies (film)", "response": ["Many Leigh regulars make cameo appearances in the film, most of whom serve as clients at Maurice's job, including Peter Wight as the father in a family group, Gary McDonald as a boxer, Alison Steadman as a dog owner, Liz Smith as a cat owner, Sheila Kelley as a fertile mother, Phil Davis as a man in a suit, Anthony O'Donnell as an uneasy man, Ruth Sheen as a laughing woman, and musician Mia Soteriou as a fiancée."]}, {"page": "Bramwell (TV series)", "response": ["* Ruth Sheen as Nurse Ethel Carr"]}, {"page": "Vanity Fair (2004 film)", "response": ["*Ruth Sheen as Miss Pinkerton"]}, {"page": "Vera Drake", "response": ["She is a kindly person who is eager to help others. Unknown to her family, she also works secretly, providing abortions for young women. She receives no money for providing this service because she believes that her help is an act of charity to women in trouble. However, her partner Lily (Ruth Sheen), who also carries on a black-market trade in scarce postwar foodstuffs, charges two guineas (two pounds and two shillings: ) for arranging the abortions, without Vera's knowledge.", "* Ruth Sheen as Lily"]}, {"page": "The Young Poisoner's Handbook", "response": ["*Ruth Sheen – Molly"]}, {"page": "Philip Ridley", "response": ["Ridley has also directed three feature films from his own screenplays: The Reflecting Skin (1990) (winner of 11 international awards), The Passion of Darkly Noon (1995) (winner of the Best Director Prize at the Porto Film Festival), and Heartless (2009). Ridley's third film as writer-director, Heartless, premiered at the Frightfest horror film festival in London in August 2009. The film stars Jim Sturgess, Clémence Poésy, Noel Clarke, Eddie Marsan, Luke Treadaway, Ruth Sheen, and Timothy Spall, and was released in the UK in May 2010. It was the first mainstream British film to be released across all platforms (theatrical, DVD, Blu-ray, download) at the same time."]}, {"page": "High Hopes (1988 film)", "response": ["The film primarily examines Cyril (Philip Davis) and Shirley (Ruth Sheen), a motor-cycle courier and his girlfriend, along with their friends, neighbours, and Cyril's mother and sister.", "*Ruth Sheen as Shirley", "**Won: Best Actress – Leading Role (Ruth Sheen) "]}, {"page": "Chris Lang", "response": ["The first series of Unforgotten starred Nicola Walker, Trevor Eve, Sir Tom Courtenay, Cherie Lunghi, Sanjeev Bhaskar, Gemma Jones, Hannah Gordon, Ruth Sheen and Bernard Hill.[8] and was first broadcast in Autumn 2015. Sir Tom Courtenay later won the 2016 BAFTA for Best Supporting Actor for his role, and was nominated for a RTS award for his performance, while Nicola Walker was nominated at the Broadcasting Press Guild Awards for best actress. In November 2015, ITV announced it would be returning for a second series. Alongside Walker and Bhaskar, series two starred Mark Bonnar, Rosie Cavaliero, Lorraine Ashbourne, Adeel Akhtar, Wendy Craig, Douglas Hodge and Badria Timimi. It aired in January 2017 to an audience of 7.29 million, with the Daily Telegraph describing the series as 'The detective drama of the decade'. In November 2017 Mark Bonnar won the 2017 Best Actor BAFTA Scotland for his portrayal of Colin Osborne in the series. Bonnar also won best actor in the Broadcasting Press Guild Awards 2018."]}, {"page": "East 15 Acting School", "response": ["* Ruth Sheen"]}, {"page": "London Film Critics Circle Awards 2004", "response": ["*Ruth Sheen - Vera Drake"]}, {"page": "London Film Critics Circle Awards 2002", "response": ["*Ruth Sheen - All or Nothing"]}, {"page": "All or Nothing (film)", "response": ["* Ruth Sheen as Maureen"]}, {"page": "Run Fatboy Run", "response": ["* Ruth Sheen as Claudine"]}, {"page": "David Eldridge (dramatist)", "response": ["In March 2011 his play The Knot of the Heart played at the Almeida Theatre and starred Lisa Dillon, for whom the role of Lucy was written and in February 2012 his play In Basildon, played at the Royal Court Theatre directed by Dominic Cooke starring Linda Bassett and Ruth Sheen. Both plays opened to critical acclaim. The Knot of the Heart won the Off-West End Theatre Award for Best New PlayMatt Trueman, \"Off West End awards: pub theatres given plenty to cheer\", The Guardian, 2 February 2012. and In Basildon was voted The Guardian Theatre Critics and Arts Writers No.1 Theatre of 2012.Alex Needham, \"Best theatre of 2012, no 1: In Basildon, Royal Court — David Eldridge's resonant and richly populated play put England's many postwar paradoxes on stage – and it was funny, too\", The Guardian, 21 December 2012. In April 2012 the Royal Exchange Theatre presented his new version of Miss Julie by August Strindberg, starring Maxine Peake. In July 2014 his play Holy Warriors played at Shakespeare's Globe."]}]}}