{"wiki_id": "http://www.wikidata.org/entity/Q437981", "itemLabel": "Julia Annas", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Julia_Annas", "wikipedia_page": {"main": "Julia Elizabeth Annas (born 1946) is a British philosopher who has taught in the United States for the last quarter-century. She is Regents Professor of Philosophy Emerita at the University of Arizona.", "link_mentions": [{"page": "Atlantis", "response": ["Plato scholar Julia Annas, Regents Professor of Philosophy at the University of Arizona, had this to say on the matter:"]}, {"page": "Plato", "response": ["* Julia Annas, Plato scholar and moral philosopher"]}, {"page": "Sextus Empiricus", "response": ["Because of these and other barriers to acquiring true beliefs, Sextus Empiricus advisesThe extent to which a skeptic can hold beliefs as well as the kinds of beliefs a skeptic can have is a matter of scholarly dispute. that we should suspend judgment about virtually all beliefs; that is to say, we should neither affirm any belief as true nor deny any belief as false. This view is known as Pyrrhonian skepticism, as distinguished from Academic skepticism as practiced by Carneades, which, according to Sextus, denies knowledge altogether. Sextus did not deny the possibility of knowledge. He criticizes the Academic skeptic's claim that nothing is knowable as being an affirmative belief. Instead, Sextus advocates simply giving up belief; in other words, suspending judgment (epoché) about whether or not anything is knowable.See PH I.3, I.8, I.198; cf. J. Barnes, \"Introduction\", xix ff., in Sextus Empiricus, Outlines of Scepticism. Julia Annas and Jonathan Barnes (transl.) (Cambridge: Cambridge University Press, 2000).  Only by suspending judgment can we attain a state of ataraxia (roughly, 'peace of mind'). Sextus did not think such a general suspension of judgment to be impractical, since we may live without any beliefs, acting by habit.", "* Sextus Empiricus, Outlines of Scepticism. Julia Annas and Jonathan Barnes (trans.) (Cambridge: Cambridge University Press, 2nd ed. 2000). "]}, {"page": "List of ethicists", "response": ["* Julia Annas"]}, {"page": "Virtue ethics", "response": ["* Julia Annas wrote The Morality of Happiness (1993)."]}, {"page": "Index of philosophy articles (I–Q)", "response": ["* Julia Annas"]}, {"page": "Very Short Introductions", "response": ["| 026 || Ancient Philosophy || Julia Annas ||  || || philosophy", "| 079 || Plato || Julia Annas ||  || || philosophy"]}, {"page": "First Alcibiades", "response": ["Traditionally, the First Alcibiades has been considered an early dialogue. Gerard Ledger's stylometric analysis supported this tradition, dating the work to the 390s.Young (1998) Julia Annas, in supporting the authenticity of Rival Lovers, saw both dialogues as laying the foundation for ideas Plato would later develop in Charmides."]}, {"page": "Republic (Plato)", "response": ["Socrates and his companions conclude their discussion concerning the lifestyle of the guardians, thus concluding their initial assessment of the city as a whole. Socrates assumes each person will be happy engaging in the occupation that suits them best. If the city as a whole is happy, then individuals are happy. In the physical education and diet of the guardians, the emphasis is on moderation, since both poverty and excessive wealth will corrupt them (422a1). Without controlling their education, the city cannot control the future rulers. Socrates says that it is pointless to worry over specific laws, like those pertaining to contracts, since proper education ensures lawful behavior, and poor education causes lawlessness (425a–425c).Julia Annas, “Law in the Republic” from Virtue and Law in Plato and Beyond (Oxford Scholarship Online, 2017). DOI:10.1093/oso/9780198755746.003.0002", "Many critics, both ancient and modern (like Julia Annas), have suggested that the dialogue's political discussion actually serves as an analogy for the individual soul, in which there are also many different \"members\" that can either conflict or else be integrated and orchestrated under a just and productive \"government.\" Among other things, this analogical reading would solve the problem of certain implausible statements Plato makes concerning an ideal political republic. Norbert Blössner (2007)Blössner, Norbert. The City-Soul Analogy, G. R. F. Ferrari (Translator). In: G. R. F. Ferrari (Ed.), The Cambridge Companion to Plato's Republic, Cambridge University Press, 2007. (Ch. 13; pp. 345–385). argues that the Republic is best understood as an analysis of the workings and moral improvement of the individual soul with remarkable thoroughness and clarity. This view, of course, does not preclude a legitimate reading of the Republic as a political treatise (the work could operate at both levels). It merely implies that it deserves more attention as a work on psychology and moral philosophy than it has sometimes received."]}, {"page": "List of women philosophers", "response": ["*Julia Annas (born 1946)"]}, {"page": "List of philosophers born in the 20th century", "response": ["* Julia Annas (born 1946)"]}, {"page": "Seventh Letter", "response": ["In recent times the Seventh Letter has been argued to be spurious by prominent scholars such as Malcolm Schofield,Malcolm Schofield, \"Plato & Practical Politics\", in Greek & Roman Political Thought, ed. Schofield & C. Rowe (Cambridge: Cambridge University Press, 2000), 299–302. Myles Burnyeat,Myles Burnyeat and Michael Frede, The Pseudo-Platonic Seventh Letter, Oxford University Press, 2015, 224pp., ; cited previously in Malcolm Schofield, Plato (Oxford: Oxford University Press, 2006), 44n19 as Burnyeat M., \"The Second Prose Tragedy: a Literary Analysis of the pseudo-Platonic Epistle VII,\"  unpublished manuscript George Boas,George Boas, \"Fact and Legend in the Biography of Plato\", The Philosophical Review  57, no. 5 (1949):  439–457. Terence Irwin,Terence Irwin, \"The Intellectual Background,\" in The Cambridge Companion to Plato, ed. R. Kraut (Cambridge:Cambridge University Press, 1992), 78–79n4. and Julia Annas.  According to Annas, the Seventh Letter is \"such an unconvincing production that its acceptance by many scholars is best seen as indicating the strength of their desire to find, behind the detachment of the dialogues, something, no matter what, to which Plato is straightforwardly committed.\"Julia Annas, \"Classical Greek Philosophy,\" in The Oxford History of Greece and the Hellenistic World, ed. Boardman, Griffin and Murray (Oxford:  Oxford University Press, 1991), 285."]}, {"page": "Epistles (Plato)", "response": ["The two letters that are most commonly claimed to have actually been written by Plato are the Seventh and the Eighth, on the supposition that these were open letters and therefore less likely to be the result of invention or forgery.  This is not so much because of a presumption in favor of an open letter's authenticity as because of a presumption against that of a private letter:  the preservation of the former is unsurprising, while the preservation, dissemination, and eventual publication of the latter requires some sort of explanation.Bury, Introduction to the Epistles, 390–2.  Nevertheless, even the Seventh Letter has recently been argued to be spurious by prominent scholars, such as Malcolm Schofield,Malcolm Schofield, \"Plato & Practical Politics\", in Greek & Roman Political Thought, ed. Schofield & C. Rowe (Cambridge: Cambridge University Press, 2000), 299–302. Myles Burnyeat,Myles Burnyeat, \"The Second Prose Tragedy: a Literary Analysis of the pseudo-Platonic Epistle VII,\" unpublished manuscript, cited in Malcolm Schofield, Plato (Oxford: Oxford University Press, 2006), 44n19. and Julia Annas.Julia Annas, \"Classical Greek Philosophy,\" in The Oxford History of Greece and the Hellenistic World, ed. Boardman, Griffin and Murray (Oxford:  Oxford University Press, 1991), 285. George Boas argues that all of the Epistles, including the Seventh, are spurious,George Boas, \"Fact and Legend in the Biography of Plato\", 453–457. a conclusion accepted also, and more recently, by Terence Irwin.Terence Irwin, \"The Intellectual Background,\" in The Cambridge Companion to Plato, ed. R. Kraut (Cambridge:Cambridge University Press, 1992), 78-79n4.  On the other hand, George Grote, Anton Ræder, Novotny, Harward, and Bluck reject only the First; and Bentley accepted all of them."]}, {"page": "Rival Lovers", "response": ["In a 1985 article, Julia Annas made a notable defense of the dialogue's possible value as an authentically Platonic production. Annas disagrees that the burden of proof need be on the proponent of the work's authenticity and proceeds from the premise that Lovers \"contain[s] no decisive indications either for or against authenticity\" and that the most any investigation can accomplish is to \"make it plausible that the Lovers is an early work by Plato.\"Annas, pp. 111–112. Her several arguments that this is plausible center on the claim that, if Lovers and First Alcibiades are genuine, they provide an otherwise missing background in Plato's thinking against which to understand his treatment of self-knowledge in Charmides.", "* Julia Annas, \"Self-knowledge in Early Plato.\" In Platonic Investigations, ed. Dominic J. O'Meara, pp. 111–138. Washington: Catholic University of America Press, 1985."]}, {"page": "List of American philosophers", "response": ["*Julia Annas"]}, {"page": "Free will in antiquity", "response": ["The question remains how random swerves can help to explain free action. In her 1992 book, The Hellenistic Philosophy of Mind, Julia Annas wrote:", "    ...since swerves are random, it is hard to see how they help to explain free action. We can scarcely expect there to be a random swerve before every free action. Free actions are frequent, and (fairly) reliable. Random swerves cannot account for either of these features. This problem would be lessened if we could assume that swerves are very frequent, so that there is always likely to be one around before an action. However, if swerves are frequent, we face the problem that stones and trees ought to be enabled to act freely. And even in the case of humans random swerves would seem to produce, if anything, random actions; we still lack any clue as to how they could produce actions which are free.Julia Annas, The Hellenistic Philosophy of Mind, p. 184"]}, {"page": "Sigmund H. Danziger Jr. Memorial Lecture in the Humanities", "response": ["* 2012–2013      Julia Annas "]}, {"page": "List of members of the Norwegian Academy of Science and Letters (current)", "response": ["*Julia Annas (over 70 years)"]}, {"page": "Oxford Studies in Ancient Philosophy", "response": ["Oxford Studies in Ancient Philosophy was started in 1983 by Julia Annas.  At the time of its founding, it was commended as a supplement or even rival to the journal Phronesis.Price, A. W., \"Review: Oxford Studies in Ancient Philosophy: Volume I\", Philosophical Books, vol. 25, no. 2 (April, 1984), pp. 75–77. It was also criticized for using transliterations of the ancient Greek language texts rather than the original alphabet.Glucker, John, \"Review: Oxford Studies in Ancient Philosophy: Volume I\", Philosophia, vol. 16, no. 3–4, (1986), p. 434.  It is one of the major journals for ancient philosophy.Vanhaelen, M., \"Philosophy\" in Gagarin, M. (ed.), The Oxford Encyclopedia of Ancient Greece and Rome (Oxford University Press, 2010), p. 2053. The journal is published by Oxford University Press and the current editor is Victor Caston at the University of Michigan.  Apart from Annas, previous editors were Brad Inwood, C. C. W. Taylor and David Sedley.Oxford Studies in Ancient Philosophy - Philosophy Series - Series - Academic, Professional, & General - Oxford University Press"]}, {"page": "List of Honorary Fellows of St Hugh's College, Oxford", "response": ["*Julia Annas"]}]}}