{"wiki_id": "http://www.wikidata.org/entity/Q4379087", "itemLabel": "Ian Preece", "itemDescription": "Welsh snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Preece", "wikipedia_page": {"main": "Ian Preece (born 23 June 1982) is a Welsh former professional snooker player, from the city of Newport.\nPreece first appeared on the main tour in 2003, after a successful career as a junior; he held the record as the youngest winner of the World Amateur Championship in 1999, when he beat David Lilley 11–8 in the final.", "link_mentions": [{"page": "Jimmy White", "response": ["White was born in Streathbourne Road, Tooting, London, England, and studied at Ernest Bevin School. He never achieved academic success, as he was often truant from school from the age of eight or nine, spending more and more time at Ted Zanoncelli's snooker hall. It was around this time that White met Tony Meo with whom he would compete in money matches in many venues. His natural aptitude for snooker led to a successful amateur career. After winning the English Amateur Championship in 1979, a year later he became the youngest ever winner of the World Amateur Snooker Championship, aged 18, a record since surpassed by Ian Preece and Hossein Vafaei."]}, {"page": "Joe Johnson (snooker player)", "response": ["Despite being ranked 96th in the World, and eligible to play in most of the season's events, Johnson withdrew from all but two of them. Consequently, the following players received walkovers: Supoj Saenla in the 2003 LG Cup Last 128, Alain Robidoux in the 2003 British Open Last 128, Carlo Giagnacovo in the 2003 UK Championship Last 128, Joe Delaney in the 2004 Welsh Open Last 128, Gary Hardiman in the 2004 European Open Last 128, and Chris Melling in the 2004 Irish Masters Last 128. Johnson entered the 2004 Players Championship, however, where he lost to 5–3 to Stuart Mann in the last 128. Johnson's final event as a professional was the 2004 World Championship, where he lost 10–0 to Ian Preece in the last 128."]}, {"page": "List of snooker players", "response": ["*Ian Preece"]}, {"page": "2004 World Snooker Championship", "response": [" Ian Preece 10–8  Justin Astley", " Ian Preece 10–0  Joe Johnson", "|   Ian Preece 10–5  Luke Simmonds", "|   David Finbow 10–9  Ian Preece"]}, {"page": "2006 Grand Prix (snooker)", "response": ["**Judd Trump 3-0 Ian Preece", "**Ian Preece 2-3 Jeff Cundy ", "**Drew Henry 0-3 Ian Preece ", "**John Parrott 2-3 Ian Preece ", "**Ian Preece 3-0 Dermot McGlinchey", "**David Gilbert 0-3 Ian Preece ", "**David Roe 3-1 Ian Preece"]}, {"page": "2006 UK Championship", "response": ["* 116, 112  Ian Preece"]}, {"page": "2007 World Snooker Championship", "response": ["* 135  Ian Preece"]}, {"page": "Joe Delaney (snooker player)", "response": ["At the 2007 World Championship, Delaney defeated Ian Preece 10–7, having trailed 1–5, Barry Pinches 10–9 from 6–9 behind, and Alan McManus by the same scoreline to reach the main stages at the Crucible Theatre for the first time in his career. In his last-32 match against Matthew Stevens, Delaney came to trail 0–5, and eventually lost 2–10."]}, {"page": "Snooker world rankings 2007/2008", "response": ["| Ian Preece"]}, {"page": "2007 Grand Prix (snooker)", "response": ["**Paul Davies 4–1 Ian Preece", "**Adrian Gunnell 0–4 Ian Preece", "**Alan McManus 1–4 Ian Preece", "**Ian Preece 2–4 Tian Pengfei", "**Ian Preece 2–4 Liu Chuang", "**Ian Preece 0–4 Fraser Patrick", "**Ian Preece 4–0 Lee Walker"]}, {"page": "2008 Welsh Open (snooker)", "response": ["*112  Ian Preece"]}, {"page": "2008 World Snooker Championship", "response": ["* 102, 101, 100  Ian Preece"]}, {"page": "2007 Welsh Open (snooker)", "response": ["Marco Fu lost his match 2–5 to Higginson after the latter tied 2–2 and compiled a break of 125 along with runs of 70, 67 and 81. Stuart Bingham made a match-winning break of 115 to whitewash Joe Delaney 5–0. Michael Holt achieved breaks of 131, 104 and 115 in defeating Ricky Walden 5–4, as the former World Amateur Champion Ian Preece was whitewashed 5–0 by Mark Selby. Another whitewash occurred when Ryan Day was defeated 5–0 by Michael Judge, a match in which Day's highest break was 24 and Judge compiled a 137 total clearance to win the game. World number 54 Jamie Burnett made a match-high break of 43 en route to winning 5–3 against Robert Milkins. Breaks of 110 and 79 gave Jamie Cope a 5–1 victory over the struggling Ding Junhui. Provisional world number 36 Ian McCulloch trailed Allen 4–2 but breaks of 72, 47 and 74 gave him a 5–4 victory, although he said after the match that he was disappointed with his performance.", "* 134, 126  Ian Preece"]}, {"page": "Snooker world ranking points 2007/2008", "response": ["| 55 || 9 || style=\"text-align:left;\"| Ian Preece"]}, {"page": "Snooker world ranking points 2008/2009", "response": ["| 66 || 11 || style=\"text-align:left;\"| Ian Preece"]}, {"page": "2008 UK Championship", "response": ["*118, 107  Ian Preece"]}, {"page": "2008 Shanghai Masters", "response": ["*139  Ian Preece"]}, {"page": "2008 Northern Ireland Trophy", "response": ["*Notable comebacks in the qualifiers included: Li Hang coming from 0–4 down to beat Irish prodigy David Morris 5–4, and both Jimmy White and Ian Preece came from 2–4 behind to win their matches 5–4, against Jamie Jones and Paul Davies respectively.", "*109  Ian Preece"]}, {"page": "Daniel Wells (snooker player)", "response": ["However, at the World Championship, Wells needed a good run of results to ensure his place on the tour for the following season. A sequence of 10–9 wins over Li Hang, Ian Preece and Marcus Campbell took him to the final qualifying round where he lost 9–10 to Barry Hawkins in the final qualifying match. In his 4 qualifying matches, he played the maximum 76 frames. His ranking rose to No. 70 as a result of his exploits that season.", "Wells started the new season with a win over fellow Welshman Ian Preece 5–3 in the Shanghai Masters before losing to Joe Delaney in the next round by the same scoreline. In the UK Championship, he narrowly lost 8–9 to fellow Welshman Michael White. In his home championship, the Welsh Open, Wells narrowly lost in the first qualifying round to James Wattana 4–5. Another first qualifying round defeat in the China Open meant that Wells was again in danger of losing his place on the tour. Wells failed to repeat his exploits of the previous season in the World Championship as he lost 7–10 to former world No. 12 David Gray in the first qualifying round. This meant that he fell off the tour."]}, {"page": "Aditya Mehta", "response": ["At the 2017 China Championship, Mehta lost in the opening round to Ali Carter 5–4. At the third ranking event of the season, the Riga Masters, Mehta defeated Rory McLeod 4–2, before losing to Jamie Cope by the same scoreline in the second round. The English Open was Mehta's best performance since the 2015 Indian Open. Mehta defeated Sam Craigie 4–0, Ian Preece 4–2 and Chen Zifan 4–1 to reach the last 16 of a ranking event for the third time. Mehta played Neil Robertson, who he lost 4–1 to."]}, {"page": "Li Hang (snooker player)", "response": ["Li was entered into the wildcard round of the China Open as an amateur player for three consecutive years from 2006. He lost at this stage in 2006 and 2008, but in 2007 he beat Ian Preece 5–4 to reach the first round of a ranking event for the first time, where he lost 1–5 to 1997 world champion Ken Doherty. In April 2008, Li won the ACBS Asian Under-21 Snooker Championship with a 6–1 success over Li Yuan in the final. The title earned him a place on the 2008–09 snooker tour.", "Li entered qualifying for five of the six ranking events during the 2009–10 season, losing in the first round in the UK Championship, China Open and World Championship. At the Grand Prix he saw off Brendan O'Donoghue and David Roe both by last frame deciders, before losing 3–5 to Mark Davis. Li enjoyed his best run in qualifying for the Welsh Open, reaching the final round by eliminating Ian Preece, Jin Long and Mike Dunn, but was then beaten 4–5 by Fergal O'Brien. However, his performances were not enough for him to retain his place on tour as he finished the season ranked 81st in the world, outside of the top 64 who remained."]}, {"page": "List of people from Newport", "response": ["* Ian Preece (snooker player)"]}, {"page": "Snooker world rankings 2008/2009", "response": ["| Ian Preece", "*Other players to reach career high rankings within the top 64 are: Jamie Cope up to No.19, Stuart Bingham No.21, Ricky Walden No.35, Andrew Higginson No.38, Liang Wenbo No.40, Judd Trump No.41, David Gilbert No.43, Rory McLeod No.44, Jimmy Michie No.46, Mike Dunn No.47, Tom Ford No.48, Liu Song No.53 and Ian Preece No.55. New players to enter the top 64 are Mark Joyce at No.59, Martin Gould No.63 and David Morris No.64."]}, {"page": "Snooker world rankings 2009/2010", "response": ["| Ian Preece"]}, {"page": "Snooker world ranking points 2006/2007", "response": ["| 64 || style=\"text-align:left;\"| Ian Preece"]}, {"page": "2007 China Open (snooker)", "response": ["* 106, 101  Ian Preece"]}, {"page": "2004 Welsh Open (snooker)", "response": ["|  Matthew Couch || align=\"center\"| 5–4 ||  Ian Preece"]}, {"page": "Snooker world ranking points 2009/2010", "response": ["| 95 || 29 || style=\"text-align:left;\"| Ian Preece"]}]}}