{"wiki_id": "http://www.wikidata.org/entity/Q4382484", "itemLabel": "Mark Prudhoe", "itemDescription": "professional footballer (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Prudhoe", "wikipedia_page": {"main": "Mark Prudhoe (born 8 November 1963) is an English former professional footballer who played as a goalkeeper for 17 different Football League clubs.", "link_mentions": [{"page": "Darlington F.C.", "response": ["As part of the 2003 \"Farewell to Feethams\" celebrations, a competition in the club programme selected the following all-time \"Dream Team\": Mark Prudhoe, Ron Greener, Craig Liddle, Kevan Smith, John Peverell, Andy Toman, David McLean, Alan Sproates, Alan Walsh, Marco Gabbiadini and Colin Sinclair. Gabbiadini, scorer of 53 goals in his two seasons at Darlington, was voted greatest ever player."]}, {"page": "Joe Corrigan", "response": ["In February 2011 Corrigan came out of retirement to join Hull City as goalkeeping coach, replacing Mark Prudhoe, who had been criticised by some Hull supporters for his coaching methods. Corrigan left his coaching role at Hull City in August 2011 after being involved in an unspecified incident with Jimmy Bullard on a pre season trip to Slovenia, the latter being sacked as a result.https://www.twtd.co.uk/ipswich-town-news/19096/corrigan-departs-hull-in-wake-of-bullard-contract-termination/?scrollto=post100843"]}, {"page": "Ray Wallace (footballer)", "response": ["In August 1994 Wallace joined Stoke City on a free transfer. He made a slow start to his Stoke career and by December 1994 he was loaned out to Second Division Hull City where he made seven appearances. He returned to the Victoria Ground in January 1995 and ended the 1994–95 season with 28 appearances. Manager Lou Macari used Wallace in a different role in 1995–96 playing him alongside Nigel Gleghorn in centre midfield. It worked well as Stoke reached the play-offs where they lost 1–0 to Leicester City and Wallace won the player of the year award jointly with goalkeeper Mark Prudhoe. He missed just one match in 1996–97 as Stoke finished in a mid-table position of 12th. The 1997–98 season saw Stoke play at the new Britannia Stadium but results were poor and relegation to the third tier was suffered. Under Brian Little in 1998–99 Wallace was used mainly as a substitute and was released by the club at the end of the season."]}]}}