{"wiki_id": "http://www.wikidata.org/entity/Q438651", "itemLabel": "Elkie Brooks", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Elkie_Brooks", "wikipedia_page": {"main": "Elkie Brooks (born Elaine Bookbinder; 25 February 1945) is an English rock, blues and jazz singer. She was a vocalist with the bands Dada and Vinegar Joe, and later became a solo artist. She gained her biggest success in the late 1970s and 1980s, releasing 13 UK Top 75 singles, and reached the top ten with \"Pearl's a Singer\", \"Sunshine After the Rain\" and the title track of the album No More the Fool.  She has been nominated twice for the Brit Awards.Brooks is a Gold Badge Award of Merit winner from the British Academy of Songwriters, Composers and Authors (BASCA) (now The Ivors Academy) and is generally referred to as the \"British Queen of Blues\".", "link_mentions": [{"page": "1945", "response": ["** Elkie Brooks, English singer"]}, {"page": "Dave Mattacks", "response": ["*Elkie Brooks (Pearls II)"]}, {"page": "Humphrey Lyttelton", "response": ["Lyttelton had a long established professional relationship with UK singer Elkie Brooks. After working together in the early 1960s they rekindled their working partnership in early 2000 with a series of sold-out and well-received concert performances. In early 2000, the band played on the track \"Life in a Glasshouse\" on Radiohead's album Amnesiac, released the following year. In 2003, they released the critically acclaimed album Trouble in Mind and continued to perform occasional concerts. Lyttelton introduced American vocalist Stacey Kent to British audiences.", "On 25 April 2010, two years after Lyttelton's death, a celebratory concert entitled \"Humphrey Lyttelton — A Celebration Concert\" was held at the Hammersmith Apollo to celebrate his life, works and contribution to music. Singer Elkie Brooks and many prominent British jazz musicians appeared at the concert, along with panellists from I'm Sorry I Haven't a Clue. The event was organised and hosted by his son Stephen Lyttelton, who is also the founder and Chairman of The Humph Trust, an organisation set up after his death to support young up and coming jazz musicians and to provide sponsorship and support."]}, {"page": "Cat Stevens", "response": ["In April 1977, his Izitso album updated his pop rock and folk rock style with the extensive use of synthesisers, giving it a more synthpop style. \"Was Dog a Doughnut\" in particular was an early techno-pop fusion track and a precursor to the 1980s electro music genre, making early use of a music sequencer. Izitso included his last chart hit, \"(Remember the Days of the) Old Schoolyard\", an early synthpop song that used a polyphonic synthesiser; it was a duet with fellow UK singer Elkie Brooks."]}, {"page": "The Moody Blues", "response": ["By this time, other bands were picking up their work. Pinder's songs \"A Simple Game\" (1968) and \"So Deep Within You\" (1969) were successfully covered by the Four Tops, Pinder winning an Ivor Novello Award for \"A Simple Game\", Elkie Brooks later covered Hayward's \"Nights in White Satin\". Pinder also appeared on John Lennon's \"Imagine\" album in 1971, providing additional percussion on \"I Don't Wanna Be a Soldier (I Don't Want to Die)\". The 1968 to 1972 album sleeves, plus several solo sets up to Ray Thomas's \"Hopes, Wishes & Dreams\" in 1976, were characterised by striking surreal scenic sleeve artwork (mostly gatefold sleeves) by artist Phil Travers."]}, {"page": "Tommy (The Who album)", "response": ["The album and concerts featured an all-star cast, including Graham Bell (as The Lover), Maggie Bell (as The Mother), Sandy Denny (as The Nurse), Steve Winwood (as The Father), Rod Stewart (as The Local Lad), Richie Havens (as The Hawker), Merry Clayton (as The Acid Queen) and Ringo Starr (as Uncle Ernie). Townshend played some guitar, but otherwise the music was predominantly orchestral. Richard Harris played the role of the specialist on the record, but he was replaced by Peter Sellers for the stage production. The stage show had a second run on 13 and 14 December 1973 with a different cast including David Essex, Elkie Brooks, Marsha Hunt, Vivian Stanshall, Roy Wood, and Jon Pertwee."]}, {"page": "1981 in music", "response": ["| Pearls || Elkie Brooks ||-"]}, {"page": "1982 in music", "response": ["|Elkie Brooks"]}, {"page": "1986 in music", "response": ["| No More the Fool || Elkie Brooks ||-"]}, {"page": "Etta James", "response": ["James was once considered one of the most overlooked blues and R&B musicians in the music history of the United States. It was not until the early 1990s, when she began receiving major industry awards from the Grammys and the Blues Foundation, that she received wide recognition. In recent years, she was seen as bridging the gap between rhythm and blues and rock and roll. James has influenced a wide variety of musicians, including Diana Ross, Christina Aguilera, Janis Joplin, Brandy, Bonnie Raitt, Shemekia Copeland, Beth Hart and Hayley Williams of Paramore as well as British artists The Rolling Stones, Elkie Brooks, Paloma Faith, Joss Stone, Rita Ora, Amy Winehouse, and Adele, and the Belgian singer Dani Klein."]}, {"page": "Gene Pitney", "response": ["Meanwhile, Pitney wrote hits for others, including \"Today's Teardrops\" for Roy Orbison, \"Rubber Ball\" for Bobby Vee, \"Hello Mary Lou\" for Ricky Nelson, and \"He's a Rebel\" for the Crystals (later recorded by Vikki Carr and Elkie Brooks). \"Rebel\" kept Pitney's own No. 2 hit \"Only Love Can Break a Heart\", his highest-charting single in the US, from the top spot on 3 November 1962, the only time that a writer shut himself (or herself) out of the No. 1 position.Casey Kasem, American Top 40, 24 May 1986."]}, {"page": "Small Faces", "response": ["The band's early song set included R&B/soul classics such as \"Jump Back\", James Brown's \"Please Please Please\", Smokey Robinson's \"You've Really Got a Hold on Me\" and Ben E. King's \"Stand by Me\". The band also performed two Marriott/Lane original compositions, a fast and loud \"Come on Children\" and the \"speed enhanced\" song \"E too D\", in which Marriott would display his considerable vocal abilities in the style of his heroes and role models, Otis Redding and Bobby Bland. \"E too D\", which appears on their first album, Small Faces, is named after the guitar chord structure. On US compilation albums the track is titled \"Running Wild\". Marriott's unique and powerful voice attracted rising attention. Singer Elkie Brooks was struck by Marriott's vocal prowess and stage presence, and recommended them to a local club owner, Maurice King. Impressed, King began finding them work in London and beyond. Their first out-of-London concert was at a working men's club in Sheffield. Since the crowd was mainly made up of Teddy boys and hard-drinking workers, the band were paid off after three songs. Despondent, they walked into the mod-orientated King Mojo Club nearby (then owned by Peter Stringfellow) and offered to perform for free. They played a set that left the local mods wanting more. During a crucial residency at Leicester Square's Cavern Club, they were supported by Sonny & Cher, who were living in London at the time."]}, {"page": "Nina Simone", "response": ["Musicians who have cited Simone as important for their own musical upbringing include Elton John (who named one of his pianos after her), Madonna, Aretha Franklin, Adele, David Bowie, Patti LaBelle, Boy George, Emeli Sandé, Antony and the Johnsons, Dianne Reeves, Sade, Janis Joplin, Nick Cave, Van Morrison, Christina Aguilera, Elkie Brooks, Talib Kweli, Mos Def, Kanye West, Lena Horne, Bono, John Legend, Elizabeth Fraser, Cat Stevens, Anna Calvi, Cat Power, Lykke Li, Peter Gabriel, Justin Hayward, Maynard James Keenan, Cedric Bixler-Zavala, Mary J. Blige, Fantasia Barrino, Michael Gira, Angela McCluskey, Lauryn Hill, Patrice Babatunde, Alicia Keys, Alex Turner, Lana Del Rey, Hozier, Matt Bellamy, Ian MacKaye, Kerry Brothers, Jr., Krucial, Amanda Palmer, Steve Adey and Jeff Buckley. John Lennon cited Simone's version of \"I Put a Spell on You\" as a source of inspiration for the Beatles' song \"Michelle\". American singer Meshell Ndegeocello released her own tribute album Pour une Âme Souveraine: A Dedication to Nina Simone in 2012. The following year, experimental band Xiu Xiu released a cover album, Nina. In late 2019, American rapper Wale released an album titled Wow... That's Crazy, containing a track called \"Love Me Nina/Semiautomatic\" which contains audio clips from Simone."]}, {"page": "Gay Byrne", "response": ["On 5 July 1962, the first episode of The Late Late Show was aired on Irish television. Originally the show was scheduled as an eight-week summer filler. The programme, which is still broadcast, has become the world's second longest running chat show. The show became a forum where controversial topics such as the influence of the Roman Catholic Church, contraception, AIDS, unemployment, homosexuality, abortion, divorce and other hitherto taboo subjects were discussed openly in Ireland, alongside book reviews, celebrity visits, and music acts such as the Boomtown Rats, U2, Sinéad O'Connor, Elkie Brooks, Boyzone and Noel Gallagher. Other guests included Presidents of Ireland, successive Archbishops of Armagh, minor members of the British Royal Family, politicians, actors and authors."]}, {"page": "Kenny Everett", "response": ["Various pop and TV stars made cameo appearances on the show, including Rod Stewart, Elkie Brooks, Billy Connolly, Kate Bush, Cliff Richard, Freddie Mercury, Terry Wogan and Suzi Quatro. Classical musicians such as Julian Lloyd Webber also appeared."]}, {"page": "K. K. Downing", "response": ["Downing started his first band, a pop band called Stagecoach, between the age of 17 and 18 with his second cousin Brian Badhams on bass guitar (now with The Elkie Brooks Band) and drummer Martin Philips. The trio \"mainly jammed a few Cream songs and a few 12-bar blues\". Downing played guitar with the band after winning a coin toss with Badhams \"in his bedroom to see who would play guitar or bass\".K.K. Downing attended catering college and worked as trainee chef at the Lyttelton Arms in Hagley."]}, {"page": "Boz Burrell", "response": ["Burrell's style leaned more towards jazz, whereas McLagan was into Booker T, four singles being recorded and backing band slots with Kenny Lynch and Elkie Brooks. However, with little commercial success McLagan soon left to join The Small Faces."]}, {"page": "Sonia (singer)", "response": ["In 2003, Sonia appeared in the ITV1 reality show Reborn in the USA, where former pop stars including Leee John from the band Imagination, Michelle Gayle, Gina G, Elkie Brooks and pop duo Dollar performed American hits. The show saw the artists touring America and each week one artist was eliminated from the show.  Sonia came sixth out of the nine participants."]}, {"page": "Jerry Leiber and Mike Stoller", "response": ["In the late 1970s, A&M Records recruited Leiber and Stoller to write and produce an album for Elkie Brooks; Two Days Away (1977) proved a success in the UK and most of Europe. Their composition \"Pearl's a Singer\" (written with Ralph Dino & John Sembello) became a hit for Brooks, and remains her signature tune. In 1978, mezzo-soprano Joan Morris and her pianist-composer husband William Bolcom recorded an album, Other Songs by Leiber and Stoller, featuring a number of the songwriters' more unusual (and satiric) works, including \"Let's Bring Back World War I\", written specifically for (and dedicated to) Bolcom and Morris; and \"Humphrey Bogart\", a tongue-in-cheek song about obsession with the actor.Joan Morris and William Bolcom, Other Songs by Leiber and Stoller, Nonesuch Records H-71346, 1978 In 1979, Leiber and Stoller produced another album for Brooks: Live and Learn."]}, {"page": "R. D. Laing", "response": ["* How Does It Feel? (1976). Documentary on physical senses and creativity featuring Laing, Joseph Beuys, David Hockney, Elkie Brooks, Michael Tippett and Richard Gregory."]}, {"page": "Robert Palmer (singer)", "response": ["In 1970 Palmer joined the 12-piece jazz-rock fusion band Dada, which featured singer Elkie Brooks and her husband Pete Gage. After a year, Palmer, Brooks and Gage formed soul/rock band Vinegar Joe. Palmer played rhythm guitar in the band, and shared lead vocals with Brooks. Signed to the Island Records label, they released three albums: Vinegar Joe (1972), Rock 'n' Roll Gypsies (1972) and Six Star General (1973), before disbanding in March 1974. Brooks later said Palmer \"was a very good-looking guy\", and that female fans were happy to find that Brooks and Palmer were not romantically linked."]}, {"page": "A Very Peculiar Practice", "response": ["The theme tune, \"We Love You\" was written by Dave Greenslade and performed by UK singer, Elkie Brooks."]}, {"page": "The Two Ronnies", "response": ["Another regular feature of the shows was an elaborate musical finale in which Barker and Corbett – often in drag – and company would sing a medley of songs in character, in barbershop, music hall, Gilbert and SullivanGilbert and Sullivan sketches were included in the 2nd episode of the first series, first shown on 17 April 1971 and as the finale to \"The Two Ronnies Old Fashioned Christmas Mystery\", their 1971 TV Christmas special. or other styles, with the original words altered to suit whatever comic situation they were portraying. There would also be a cabaret musician or group appearing as a special guest, including Samantha Jones, Dana, Elkie Brooks, Manhattan Transfer, Pan's People, Michel Legrand, Barbara Dickson, Tina Charles, the Nolan Sisters, Elton John, New World, Elaine Paige and Phil Collins, the last of whom also took part in a few sketches."]}, {"page": "David Paich", "response": ["As a session musician, Paich has played on numerous soundtracks and on albums by many artists, including Elkie Brooks' album Rich Man's Woman; Bryan Adams' song \"Please Forgive Me\"; the Michael Jackson songs \"Earth Song\", \"The Girl Is Mine\", \"Heal the World\", \"Stranger in Moscow\", and \"I Just Can't Stop Loving You\"; and the USA for Africa song \"We Are the World\", as well as work with Aretha Franklin, Boz Scaggs, Quincy Jones, Melanie Safka, Don Henley, Diana Ross, the Doobie Brothers, Neil Diamond, Seals and Crofts, Steely Dan, Elton John, Joe Cocker, Rod Stewart, Cher, Randy Newman, the Brothers Johnson and Pink."]}, {"page": "Allen Toussaint", "response": ["In the 1970s, Toussaint began to work with artists from beyond New Orleans artists, such as B. J. Thomas, Robert Palmer, Willy DeVille, Sandy Denny, Elkie Brooks, Solomon Burke, Scottish soul singer Frankie Miller (High Life), and southern rocker Mylon LeFevre. He arranged horn music for The Band's albums Cahoots (1971) and Rock of Ages (1972), as well as for the documentary film The Last Waltz (1978). Boz Scaggs recorded Toussaint's \"What Do You Want the Girl to Do?\" on his 1976 album Silk Degrees, which reached number 2 on the U.S. pop albums chart. The song was also recorded by Bonnie Raitt for her 1975 album Home Plate and by Geoff Muldaur (1976), Lowell George (1979), Vince Gill (1993), and Elvis Costello (2005). In 1976 he collaborated with John Mayall on the album Notice to Appear."]}, {"page": "Maryport", "response": ["The town is a major name on the blues music scene, holding the popular \"Maryport Blues Festival\" every summer. This has previously attracted names such as Jools Holland, Dionne Warwick, Elkie Brooks, Buddy Guy, Jethro Tull, Van Morrison, Robert Cray and Chuck Berry."]}, {"page": "Joan Armatrading", "response": ["In 1975 Armatrading was free to sign with A&M Records, and issued the album Back to the Night, which was promoted on tour with six-piece English jazz-pop group The Movies. Armatrading credited English singer Elkie Brooks on the sleeve notes as she had cooked for Armatrading and the band in the studio while they had been making the album, which was produced by Brooks' then husband Pete Gage. A major publicity relaunch in 1976 and the involvement of producer Glyn Johns propelled her next album, Joan Armatrading, into the  Top 20 and spawned the Top-10 hit single \"Love and Affection\". The album mixed acoustic work with jazz-influenced material, and this style was retained for the 1977 follow-up  Show Some Emotion, also produced by Glyn Johns, as was 1978's  To the Limit. These albums included songs which became staples of Armatrading's live shows, including \"Willow\", \"Down to Zero\", \"Tall in the Saddle\", and \"Kissin' and a Huggin'\". Also at this time Armatrading wrote and performed \"The Flight of the Wild Geese\", which was used during the opening- and end-titles of the 1978 war film The Wild Geese."]}, {"page": "Percy Sledge", "response": ["Sledge's soulful voice was perfect for the series of soul ballads produced by Ivy and Marlin Greene, which rock critic Dave Marsh called \"emotional classics for romantics of all ages\". \"When a Man Loves a Woman\" was Sledge's first song recorded under the contract, and was released in March 1966. According to Sledge, the inspiration for the song came when his girlfriend left him for a modelling career after he was laid off from a construction job in late 1965, and, because bassist Calvin Lewis and organist Andrew Wright helped him with the song, he gave all the songwriting credits to them. It reached No. 1 in the US and went on to become an international hit.  \"When a Man Loves a Woman\" was a hit twice in the UK, reaching No. 4 in 1966 and, on reissue, peaked at No. 2 in 1987.  The song was also the first gold record released by Atlantic Records. The soul anthem became the cornerstone of Sledge's career, and was followed by \"Warm and Tender Love\" (covered by British singer Elkie Brooks in 1981), \"It Tears Me Up\", \"Take Time to Know Her\" (his second biggest US hit, reaching No. 11; the song's lyric was written by Steve Davis), \"Love Me Tender\", and \"Cover Me\"."]}, {"page": "Katie Melua", "response": ["Melua's debut album, Call off the Search, was released on 3 November 2003 and featured two songs written by Melua: \"Belfast (Penguins and Cats)\", a song about Melua's experience of her time in the troubled capital of Northern Ireland, and \"Faraway Voice\", a song about the death of Eva Cassidy. Melua also covered songs by Delores J. Silver (\"Learnin' the Blues\"), John Mayall (\"Crawling up a Hill\"), Randy Newman (\"I Think It's Going to Rain Today\") and James Shelton (\"Lilac Wine\", originally a UK hit for singer Elkie Brooks). The other six songs on the album were by Mike Batt."]}, {"page": "Martin Taylor (guitarist)", "response": ["* Elkie Brooks, Live with Friends (Eventful Music, 2006)"]}, {"page": "Courtney Pine", "response": ["* \"Too Much To Lose\" (1999) – Elkie Brooks, featuring Courtney Pine"]}, {"page": "Tony Joe White", "response": ["In 2007, White released another live recording, Take Home the Swamp, as well as the compilation Introduction to Tony Joe White. Elkie Brooks recorded one of White's songs, \"Out of The Rain\", on her 2005 Electric Lady album. On July 14, 2006, in Magny-Cours, France, White performed as a warm-up act for Roger Waters' The Dark Side of the Moon concert. White's album, entitled Uncovered, was released in September 2006 and featured collaborations with Mark Knopfler, Michael McDonald, Eric Clapton, and J.J. Cale."]}, {"page": "Leon Russell", "response": ["During the Mad Dogs & Englishmen tour, Shelter Records released his 1970 solo album, Leon Russell, which included the first recording of \"A Song for You\". This has become one of his best-known songs, with versions released by more than 40 different artists, including the Carpenters, Ray Charles, Billy Eckstine, Peggy Lee, Willie Nelson, Helen Reddy, Carmen McRae, Elkie Brooks, Freda Payne, and Donny Hathaway. Both the Carpenters and the Temptations named an album after the song. Ray Charles recorded a version that earned him the 1994 Grammy Award for Best Male R&B Vocal Performance. Another song from the same album, \"Delta Lady\", was covered by Bobbie Gentry under the title \"Delta Man\" on her 1970 album Fancy. The \"Leon Russell\" album had a number of guest vocalist and accompaniment: Chris Stainton, Bonnie Bramlett, Greg Dempsey, Bob Dylan, Marc Benno, Eric Clapton, Mick Jagger, Keith Richards, George Harrison, Ringo Starr, Joe Cocker, and Merry Clayton. Leon Russell's A Song For You was added to Grammy Hall Of Fame for the 2018 Grammy Hall of Fame class. "]}, {"page": "Julie Covington", "response": ["During the early 1970s, she appeared and sang on the children's television programme Play Away. She starred in the BBC's 1975 Christmas production Great Big Groovy Horse, a rock opera based on the story of the Trojan Horse shown on BBC2. It was later repeated on BBC1 in 1977 1976 and 1977 saw her appearing in both series of the primetime British television programme, Rock Follies. In 1976, the composer Andrew Lloyd Webber saw her perform in cabaret, and recognising her from Rock Follies, suggested to lyricist Tim Rice that she might be the actress to play the title role in their original studio recording of their musical Evita. The singer Elkie Brooks had previously turned down an offer. Covington's recording of the song \"Don't Cry for Me Argentina\" reached No. 1 in the UK Singles Chart in February 1977. Later offered the opportunity to originate the role in the stage production of Evita, she declined, which led to Elaine Paige being cast. Speaking in 1985, Covington expressed some regret at this decision, but explained that she did not like Eva Peron and that without some positive feeling for the person she had preferred to turn the role down."]}, {"page": "Roundhouse (venue)", "response": ["In 1964 the premises were transferred to Centre 42, which prepared a scheme to convert the building into \"a permanent cultural centre with a theatre, cinema, art gallery and workshops, committee rooms for local organisations, library, youth club and restaurant dance-hall\". This was estimated to cost between £300,000 and £600,000 (£–£ in  worth), and was supported by \"well-known actors, playwrights, authors, musicians and others\". In 1966 the Roundhouse became an arts venue, after the freehold was taken up by the then new Greater London Council. The opening concert was the 15 October 1966 All Night Rave, in which Soft Machine and Pink Floyd appeared at the launch of the underground newspaper International Times. During the next decade the building became a significant venue for UK Underground music events Middle Earth and Implosion. Many of these were hosted and promoted by Jeff Dexter. Other bands playing at the Roundhouse during this period included Gass, The Rolling Stones, Jeff Beck, The Yardbirds, Zoot Money's Dantalian's Chariot, David Bowie, The Sinceros, Graham Bond, Jimi Hendrix, Pink Floyd, Led Zeppelin, The Incredible String Band, Fleetwood Mac, Third World War, The Doors with Jefferson Airplane, Ramones, The Clash with The Jam, Elvis Costello, Elkie Brooks, Otis Redding, and Motörhead, who appeared at the Roundhouse on 20 July 1975."]}, {"page": "Gina G", "response": ["After this quiet period, G returned to the spotlight in March 2003, when she took part in the reality television show Reborn in the USA, alongside Sonia, Michelle Gayle, Tony Hadley, Peter Cox and Elkie Brooks. Even though she received the most votes from the American audience and won the first show, she got the fewest votes in the next show, and went up for the British public's vote. She lost, and was eliminated from the show in the third programme."]}, {"page": "Jerry Knight", "response": ["Shortly after Ollie & Jerry parted ways in 1985, Knight began working with the Jets, co-writing their early hits \"Crush On You,\" \"Curiosity,\" and \"Private Number\".  Although his career as an artist faded, Knight continued to write and produce for other acts such as the Whispers, Patrice Rushen, DeBarge, Howard Hewett and Elkie Brooks.", "|Elkie Brooks"]}, {"page": "The Frames", "response": ["The band is also known for interspersing snippets of songs by other artists into their own as a form of homage; notable examples are \"Redemption Song\" by Bob Marley, \"Ring of Fire\" by Johnny Cash, \"Lilac Wine\" by James Shelton (as made popular by Jeff Buckley / Elkie Brooks) and \"Pure Imagination\" from Willy Wonka & the Chocolate Factory'."]}, {"page": "Isaac Guillory", "response": ["He performed frequently as a guest artist for recordings and films with, among many others, Al Stewart, Donovan, Mick Jagger, Elkie Brooks, Michael Marra, Peter Sarstedt, Buggles, Barbara Dickson, and Nick Heyward. Guillory released Isaac Guillory, a self-titled album in 1974. For a while he delved into jazz fusion and recorded with Pacific Eardrum. Guillory lectured at the Guildhall School of Music in London. His music can be heard on 'A' Net Station, a web radio station that he helped found, where his website continues to be available."]}, {"page": "Tower of Power", "response": ["The horn section also recorded with bassist Larry Graham's Graham Central Station, Grateful Dead, Carlos Santana, Journey, Elkie Brooks, Cat Stevens (on his Foreigner Suite), Luis Miguel, Linda Lewis, R.A.D. (Rose Ann Dimalanta), Jermaine Jackson, John Lee Hooker, Helen Reddy, Rufus, Rod Stewart, Jefferson Starship, Mickey Hart, Heart, Damn Yankees, Frankie Valli, Spyro Gyra, KMFDM, Lyle Lovett, Poison, Phish (two songs on their album Hoist ), Toto, Pharoahe Monch, Brothers Johnson, and Sam The, among many other acts."]}, {"page": "Geno Washington", "response": ["Washington was stationed in England with the United States Air Force during the early 1960s. While stationed in East Anglia, Washington became known as a frequent stand-in at gigs around London. When guitarist Pete Gage saw him at a nightclub in 1965, he asked Washington to join his new group, that was to become Geno Washington & the Ram Jam Band.  Gage later formed Vinegar Joe with Elkie Brooks and Robert Palmer.  The band's name came from the Ram Jam Inn, an old coaching inn on the A1 (Great North Road) at Stretton, near Oakham, Rutland."]}, {"page": "Umberto Tozzi", "response": ["The following year Tozzi recorded one of his most famous songs, \"Gloria\", which became a major hit in Italy in 1979 and 1980. Jonathan King wrote English lyrics for the song, which became popular in the UK as well in 1979, and was sung and recorded by the English singer Elkie Brooks in 1980. A cover version of the song by the American singer Laura Branigan in 1982 caused the song to grow in popularity in the US as well. Branigan worked with the arranger and keyboardist of Tozzi's own version, Greg Mathieson, to give the song what she called \"an American kick.\"An American kick The song reached the top of the charts, reached gold and platinum status in several countries, and stayed on the US pop charts for 36 weeks.Branigan's hit \"Gloria\""]}, {"page": "If You Leave Me Now", "response": ["* Elkie Brooks released a version of the song on her album Pearls in 1981. The album reached No. 2 in the UK."]}, {"page": "Gallagher and Lyle", "response": ["Gallagher and Lyle have worked, jointly and individually, on records with, among others, Paul McCartney, Eric Clapton, Pete Townshend, Ronnie Lane, Ronnie Wood, Joan Armatrading, Ralph McTell, Sandy Denny, Fairport Convention and Jim Diamond. Artists who have released Gallagher and Lyle songs include Bryan Ferry, Ringo Starr, Elkie Brooks, Fairport Convention, Art Garfunkel and Joe Brown.", "Gallagher and Lyle sang and performed as members of Ronnie Lane and The Slim Chance Band on the hit single \"How Come\" and the ensuing album Anymore for Anymore, and they have worked, jointly and individually, on records with Mary Hopkin, Paul McCartney, Eric Clapton, Pete Townshend, Ronnie Lane, Ronnie Wood, Elkie Brooks, Joe Egan, Andy Fairweather Low, Gary Brooker, Dennis Coulson, Arthur \"Big Boy\" Crudup, Champion Jack Dupree, Joan Armatrading, Ralph McTell, Sandy Denny, Fairport Convention and Jim Diamond.", "Other artists who have recorded Gallagher and Lyle songs include: Bryan Ferry, Colin Blunstone, Donavon Frankenreiter, Elkie Brooks, Fairport Convention, Fury in the Slaughterhouse, Joe Brown, Judith Durham, Little Anthony and the Imperials, Phil Everly, Ricky Nelson, Ringo Starr, Rita Coolidge, Status Quo, The Fureys, Lemon Jelly, and Jim Capaldi."]}, {"page": "Hammersmith Apollo", "response": ["* In late 1964 and early 1965, The Beatles played 38 shows over 21 nights. Special guests on the bill included Elkie Brooks and the original Yardbirds, featuring Eric Clapton."]}, {"page": "Don Arden", "response": ["Arden launched his career as a manager when he signed up American rock 'n' roller Gene Vincent in 1960, taking over from John Schatt. Arden could not control Vincent's compulsive alcoholism and the relationship ended when Vincent reportedly pulled a knife on his manager.Starmakers & Svengalis: The History of British Pop Management, Johnny Rogan, p. 90, MacDonald, Queene Anne Press For a short period of time in the early 1960s, he worked with the British singer Elkie Brooks at the start of her career."]}, {"page": "Gus Dudgeon", "response": ["Angus Boyd \"Gus\" Dudgeon (30 September 1942 – 21 July 2002) was an English record producer, who oversaw many of Elton John's most acclaimed recordings, including his commercial breakthrough, \"Your Song\". Their collaboration led to seven US No. 1 albums, and established John as the most successful singles artist of the 1970s. Dudgeon also produced Chris Rea's first hit, the US chart topping \"Fool (If You Think It's Over)\", and David Bowie's \"Space Oddity\", and steered many other artists to chart success, including Joan Armatrading and Elkie Brooks. The Guinness Book of Records cites Dudgeon as being the first person to use sampling in music production. He was a founding member of the Music Producers Guild.", "In 1972, Dudgeon produced Joan Armatrading's debut, Whatever's for Us, written by Armatrading and her then collaborator Pam Nestor. He also produced two singles for the duo, \"Lonely Lady\" and \"Together in Words And Music\" (Cube Records, 7\" single, BUG-31). Both tracks were later added to the re-mastered CD of the Whatever's For Us album (2001). He also produced two highly successful albums for Elkie Brooks: Pearls and Pearls II, the former peaking at No. 2 and remaining in the UK Albums Chart for 79 weeks. In 1980, Dudgeon started working with Mary Wilson of the Supremes on her second solo album. Four songs were recorded and produced, including a cover of Creedence Clearwater Revival's \"Green River\".  Ultimately Motown Records dropped Wilson's contract, and the masters were returned to her, the first time the company had ever done so. They were released in 2021 on Mary Wilson (Expanded Edition)."]}]}}