{"wiki_id": "http://www.wikidata.org/entity/Q438330", "itemLabel": "Jo Walton", "itemDescription": "Welsh Canadian writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jo_Walton", "wikipedia_page": {"main": "Jo Walton (born 1 December 1964) is a Welsh-Canadian fantasy and science fiction writer and poet. She is best known for the novel Among Others, which won the Hugo and Nebula Awards in 2012, and Tooth and Claw,  which won the World Fantasy Award in 2004. Among Others is one of only seven novels to have been nominated for the Hugo, Nebula and World Fantasy Awards. \nOther novels by Walton include the alternate history novel Ha'penny (2007), recipient of the Prometheus Award; the  fantasy novel Lifelode (2009), winner of the Mythopoeic Fantasy Award; and the alternate history My Real Children (2014), which won the Tiptree Award. Walton also writes reviews and SF commentary in the magazine Tor.com. A collection of her articles were published in What Makes This Book So Great (2014), which won the Locus Award for Best Non-Fiction.", "link_mentions": [{"page": "Alternate history", "response": ["In Jo Walton's \"Small Change\" series, the United Kingdom made peace with Hitler before the involvement of the United States in World War II, and slowly collapses due to severe economic depression. Former House Speaker Newt Gingrich and William R. Forstchen have written a novel, 1945, in which the US defeated Japan but not Germany in World War II, resulting in a Cold War with Germany rather than the Soviet Union. Gingrich and Forstchen neglected to write the promised sequel; instead, they wrote a trilogy about the American Civil War, starting with Gettysburg: A Novel of the Civil War, in which the Confederates win a victory at the Battle of Gettysburg - however, after Lincoln responds by bringing Grant and his forces to the eastern theater, the Army of Northern Virginia is soon trapped and destroyed in Maryland, and the war ends within weeks. Also from that general era, Martin Cruz Smith, in his first novel, posited an independent American Indian nation following the defeat of Custer in The Indians Won (1970)."]}, {"page": "A Fire Upon the Deep", "response": ["Jo Walton wrote: \"Any one of the ideas in A Fire Upon the Deep would have kept an ordinary writer going for years. For me it's the book that does everything right, the example of what science fiction does when it works. ... A Fire Upon the Deep remains a favourite and a delight to re-read, absorbing even when I know exactly what’s coming.\""]}, {"page": "Aberdare", "response": ["*Jo Walton – fantasy novelist, now living in Montreal, Quebec"]}, {"page": "December 1", "response": ["*  1964   – Jo Walton, Welsh-Canadian author and poet"]}, {"page": "Forgotten Futures", "response": ["; Forgotten Futures X: The Tooth and Claw Role Playing Game: A licensed RPG based on the novel Tooth and Claw by Jo Walton, set in a world with Victorian-equivalent technology which has a separate dragon nation. Player characters are dragons. The game is published in PDF and HTML versions, and is illustrated by Sue Mason and the author. It includes background material, revised rules catering for dragon characters, two adventures, and adventure outlines.", "In the November 1994 edition of Pyramid (Issue #10), Ken & Jo Walton liked both the content of Forgotten Futures 2 and the shareware concept, saying, \"This is an excellent, atmospheric, roleplaying game, made slightly unapproachable by its unusual distribution method. It is available only on disk; you unzip the file and print out the book for yourself. All text files are ASCII format, all pictures are GIFs.\""]}, {"page": "Otherwise Award", "response": ["* 2014: The Girl in the Road by Monica Byrne, and My Real Children by Jo Walton"]}, {"page": "Lord Dunsany", "response": ["*Review of Lord Dunsany's short stories by Jo Walton"]}, {"page": "Vorkosigan Saga", "response": ["* Retrospective reviews of the Vorkosigan Saga by Jo Walton", "** Interview with Bujold about writing the Vorkosigan Saga by Jo Walton, 2009", "** Summary and critical comments on the Vorkosigan Saga by Jo Walton"]}, {"page": "Neil Gaiman", "response": ["Gaiman has said Roger Zelazny was the author who influenced him the most,\"Of Meetings and Partings\" by Neil Gaiman, introduction to This Mortal Mountain: Volume 3 of The Collected Stories of Roger Zelazny, NESFA Press, edited by David G. Grubbs, Christopher S. Kovacs, and Ann Crimmins, 2009, page 12. with this influence particularly seen in Gaiman's literary style and the topics he writes about.\"Something Else Like ... Roger Zelazny\" by Jo Walton, Tor.com, 11 November 2012. Other authors Gaiman says \"furnished the inside of my mind and set me to writing\" include Moorcock, Ellison, Samuel R. Delany, Angela Carter, Lafferty, and Le Guin. Neil Gaiman has also taken inspiration from the folk tales tradition, citing Otta F Swire's book on the legends of the Isle of Skye as his inspiration for The Truth Is a Cave in the Black Mountains."]}, {"page": "Starship Troopers", "response": ["The writing in Starship Troopers has received varied responses, with the scenes of military training and combat receiving praise. In a 2009 retrospective, Jo Walton wrote that Starship Troopers was \"military SF done extremely well\". She went on to argue that \"Heinlein was absolutely at his peak when he wrote this in 1959. He had so much technical stylistic mastery of the craft of writing science fiction that he could [tell the story] 'backwards and in high heels' and get away with it.\" Others referred to it as very readable, and found the military scenes compelling. Heinlein's descriptions of training and boot camp in the novel, based on his own experiences in the military, have been described as being rendered with remarkable skill. A 1960 review in the New York Herald Tribune praised the \"brilliantly written\" passages describing infantry combat, and also called attention to the discussion of weapons and armor, which, according to other reviewers, demonstrated Heinlein's \"undiminished talent for invention\". Scholar George Slusser described the book in 1986 as the \"ultimately convincing space-war epic\", praising in particular the \"precisely imagined\" weapons and tactics, while a 1979 science fiction encyclopedia referred to it as the \"slickest\" of Heinlein's juvenile books."]}, {"page": "Ursula K. Le Guin", "response": ["Le Guin received rapid recognition after the publication of The Left Hand of Darkness in 1969, and by the 1970s she was among the best known writers in the field. Her books sold many millions of copies, and were translated into more than 40 languages; several remain in print many decades after their first publication. Her work received intense academic attention; she has been described as being the \"premier writer of both fantasy and science fiction\" of the 1970s, the most frequently discussed science fiction writer of the 1970s, and over her career, as intensively studied as Philip K. Dick. Later in her career, she also received recognition from mainstream literary critics: in an obituary, Jo Walton stated that Le Guin \"was so good that the mainstream couldn't dismiss SF any more\". According to scholar Donna White, Le Guin was a \"major voice in American letters\", whose writing was the subject of many volumes of literary critique, more than two hundred scholarly articles, and a number of dissertations.", "Le Guin had a considerable influence on the field of speculative fiction; Jo Walton argued that Le Guin played a large role in both broadening the genre and helping genre writers achieve mainstream recognition. The Earthsea books are cited as having a wide impact, including outside the field of literature. Atwood considers A Wizard of Earthsea one of the \"wellsprings\" of fantasy literature, and modern writers have credited the book for the idea of a \"wizard school\", later made famous by the Harry Potter series of books, and with popularizing the trope of a boy wizard, also present in Harry Potter. The notion that names can exert power is a theme in the Earthsea series; critics have suggested that this inspired Hayao Miyazaki's use of the idea in his 2001 film Spirited Away.", "Several prominent authors acknowledge Le Guin's influence on their own writing. Jo Walton wrote that \"her way of looking at the world had a huge influence on me, not just as a writer but as a human being\". Other writers she influenced include Booker Prize winner Salman Rushdie, as well as David Mitchell, Gaiman, Algis Budrys, Goonan, and Iain Banks. Mitchell, author of books such as Cloud Atlas, described A Wizard of Earthsea as having a strong influence on him, and said that he felt a desire to \"wield words with the same power as Ursula Le Guin\". Le Guin is also credited with inspiring several female science fiction authors in the 1970s, including Vonda McIntyre. When McIntyre established a writers' workshop in Seattle in 1971, Le Guin was one of the instructors. Film-maker Arwen Curry began production on a documentary about Le Guin in 2009, filming \"dozens\" of hours of interviews with the author as well as many other writers and artists who have been inspired by her. Curry launched a successful crowdfunding campaign to finish the documentary in early 2016 after winning a grant from the National Endowment for the Humanities."]}, {"page": "Girolamo Savonarola", "response": ["* The historical fantasy and alternate history novel Lent (2019) by Jo Walton is a retelling\" of Savonarola's life."]}, {"page": "List of science-fiction authors", "response": ["*Jo Walton (born 1964)"]}, {"page": "The Crow Road", "response": ["*2009 retrospective review by Jo Walton"]}, {"page": "Friday (novel)", "response": ["Jo Walton wrote of Friday in 2009 as \"The worst book I love\": \"It's a book about passing, about what makes you human. ... What's good about it now? The whole 'passing' bit. The cloning, the attitudes to cloning, the worry about jobs. The economy. It has an interesting future world [...] and as always with Heinlein it's immersive. [...] And it's a fun read, even if it's ultimately unsatisfying. What's wrong with it is that it doesn't have a plot. [...] Heinlein's ability to write a sentence that makes you want to read the next sentence remains unparalleled. But the book as a whole is almost like Dhalgren. Every sentence and every paragraph and page and chapter lead on to the next, but it's just one thing after another, there's no real connection going on. It has no plot, it's a set of incidents that look as if they're going somewhere and don't ever resolve, just stop. [...] It sets things up that it never invokes, most notably Olympia and the connections back to the novella 'Gulf.'\""]}, {"page": "Childhood's End", "response": ["*Childhood's End, retrospective review by Jo Walton, 2012"]}, {"page": "List of fantasy authors", "response": ["thumb|Jo Walton", "* Jo Walton, (born 1964) author of Among Others"]}, {"page": "Watership Down", "response": ["* Review of Watership Down by Jo Walton"]}, {"page": "The Prisoner of Zenda", "response": ["*Review of The Prisoner of Zenda by Jo Walton"]}, {"page": "The Tombs of Atuan", "response": ["The Tombs of Atuan was a Newbery Honor Book in 1972, but did not win any other major awards before being a runner-up for the International Children's Literature Association's Phoenix Award twenty years after its first publication. Upon its publication British critic Naomi Lewis called it an \"extraordinary book\", while scholar Andrew Wolk called the series a masterpiece of fantasy. The prose in the novel received praise; a 1996 reference book on science fiction described them as among the best regarded fantasies, and went on to call the series a \"fast-paced narrative\" that explored serious questions of morality, power, and identity, Science fiction writer Jo Walton said that it was a \"beautifully written\" book. She went on to write that a \"lesser writer\" would have ended the novel after the earthquake and the collapse of the Tombs, but that the last section of the story, about Ged and Tenar's travel, \"do a lot to ground it\", making it \"solid and well rooted as ever\". Speculative fiction scholar Mike Cadden praised the characterization in the novel, calling Tenar the \"finest and most complicated multiple character in the Earthsea series, and maybe in all of her fiction\". However, scholar Sandra Lindow referred to the conclusion of the novel, and particularly the conclusion of Ged and Tenar's relationship, as unsatisfying. A 2016 review in The Huffington Post praised the religious theme in the novel, saying Le Guin \"skillfully illustrates the way religious conviction can permeate and give meaning to a life\", while Entertainment Weekly referred to it as \"a classic of stealth-missile literature, a fantasy adventure that's actually a feminist horror thriller\"."]}, {"page": "Babel-17", "response": ["* 2009 retrospective review by Jo Walton: \"Babel 17 was published in 1966, the year in which I learned to talk.\""]}, {"page": "Charles Lindbergh", "response": ["There have been several alternate history novels depicting Lindbergh's alleged Nazi-sympathies and non-interventionist views during the first half of World War II. In Daniel Easterman's K is for Killing (1997), a fictional Lindbergh becomes President of a fascist United States. The Philip Roth novel The Plot Against America (2004) explores an alternate history where Franklin Delano Roosevelt is defeated in the 1940 presidential election by Lindbergh, who allies the United States with Nazi Germany.Berman, Paul \"The Plot Against America\" The New York Times October 3, 2004 The novel draws heavily on Lindbergh's alleged antisemitism as a catalyst for its plot. The Robert Harris novel Fatherland (1992) explores an alternate history where the Nazis won the war, the United States still defeats Japan, Adolf Hitler and President Joseph Kennedy negotiate peace terms, and Lindbergh is the US Ambassador to Germany. The Jo Walton novel Farthing (2006) explores an alternate history where the United Kingdom made peace with Nazi Germany in 1941, Japan never attacked Pearl Harbor, thus the United States never got involved with the war, and Lindbergh is president and is seeking closer economic ties with the Greater East Asian Co-Prosperity Sphere."]}, {"page": "John Varley (author)", "response": ["* Review of Varley's \"Eight Worlds\" stories by Jo Walton"]}]}}