{"wiki_id": "http://www.wikidata.org/entity/Q439254", "itemLabel": "Judy Oakes", "itemDescription": "British shot putter", "wikipedia_url": "https://en.wikipedia.org/wiki/Judy_Oakes", "wikipedia_page": {"main": "Judith Miriam Oakes (born 14 February 1958 in Lewisham, Greater London) is a female retired English shot putter.", "link_mentions": [{"page": "West Wickham", "response": ["*Judy Oakes, athlete."]}, {"page": "Great Britain at the 1984 Summer Olympics", "response": ["* Judy Oakes"]}, {"page": "Great Britain at the 2000 Summer Olympics", "response": ["|align=left|Judy Oakes"]}, {"page": "Great Britain at the 1988 Summer Olympics", "response": ["* Judy Oakes"]}, {"page": "Great Britain at the 1996 Summer Olympics", "response": ["* Judy Oakes"]}, {"page": "England at the 1998 Commonwealth Games", "response": ["|Judy Oakes                                       ||shot put||1 x gold"]}, {"page": "List of British records in athletics", "response": ["|Judy Oakes"]}, {"page": "UK Athletics Championships", "response": ["|Judy Oakes", "A total of 18 athletes won five or more titles at the UK Athletics Championships. Women's shot putter Judy Oakes won the most titles overall, with ten national wins. Linford Christie was the most successful man, with eight titles across the 100 metres and 200 metres.", "|Judy Oakes || Shot put || 10"]}, {"page": "Judith Oakes", "response": ["#REDIRECT Judy Oakes"]}, {"page": "Myrtle Augee", "response": ["Her personal best put was 19.03 metres, achieved in June 1990 in Cardiff placing her second on the British outdoor list, behind Judy Oakes.UK All-Time Lists: Women - Throws - GBR Athletics She was also a World Champion in powerlifting, and a World Championship medalist in weightlifting. As of 2019, she remains the last British weightlifter to win a World Championships overall medal, a bronze in 1994 World Weightlifting Championships. She was the last British lifter to win a medal of any type until Emily Godley's clean and jerk bronze medal in 2019."]}, {"page": "Meg Ritchie", "response": ["In the shot put her personal best was , achieved in May 1983 in Tucson. This is the current NCAA Division 1 Outdoor Track and Field record as well as the Scottish national record, and places her third on the British outdoor list, behind Judy Oakes and Myrtle Augee."]}, {"page": "Angela Littlewood", "response": ["Her personal best put was 17.53 metres, achieved in July 1980 in the Moscow 1980 Summer Olympics. This places her fifth on the British outdoor all-time list, behind Judy Oakes, Myrtle Augee, Meg Ritchie and Venissa Head. It was the British record at the time.UK All-Time Lists: Women - Throws - GBR Athletics She represented England in the shot put event, at the 1978 Commonwealth Games in Edmonton, Alberta, Canada. Four years later she represented England again in the shot put event, at the 1982 Commonwealth Games in Brisbane, Queensland, Australia."]}, {"page": "Yvonne Hanson-Nortey", "response": ["Her personal best put was 17.45 metres, achieved in July 1989 in London (Crystal Palace). This places her sixth on the British outdoor all-time list, behind Judy Oakes, Myrtle Augee, Meg Ritchie, Venissa Head and Angela Littlewood.UK All-Time Lists: Women - Throws - GBR Athletics"]}, {"page": "Joanne Duncan (athlete)", "response": ["Her personal best put is 17.13 metres, achieved in August 2006 in Crawley. This places her seventh on the British outdoor all-time list, behind Judy Oakes, Myrtle Augee, Meg Ritchie, Venissa Head, Angela Littlewood and Yvonne Hanson-Nortey.UK All-Time Lists: Women - Throws - GBR Athletics"]}, {"page": "Mike Winch", "response": ["Subsequent to his athletics career he has coached international athletes (mainly throwers) including multiple gold medallist Judy Oakes OBE, and Olympic athletes Philippa Roles and Emeka Udechuku.  He was chief British throws coach at the World Championships in Gothenburg 1991, chief throws coach to the England team in Kuala Lumpur 1998 and overall chief coach of England's athletics team at the 2002 Manchester Commonwealth Games"]}, {"page": "Athletics at the 2000 Summer Olympics – Women's shot put", "response": ["| 6 || 13 ||align=left|  Judy Oakes ||  ||16.96 || X || 17.81 ||17.81 m ||"]}, {"page": "England at the 1994 Commonwealth Games", "response": ["|Judy Oakes                               ||shot put||1 x gold"]}, {"page": "Croydon Harriers", "response": ["|Judy Oakes||  || shot put || 1984, 1988, 1996, 2000"]}, {"page": "Oakes (surname)", "response": ["*Judy Oakes (born 1958), British Olympic athlete"]}]}}