{"wiki_id": "http://www.wikidata.org/entity/Q4398191", "itemLabel": "Paul Brand", "itemDescription": "British surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Brand", "wikipedia_page": {"main": "Dr. Paul Wilson Brand,  (17 July 1914 – 8 July 2003) was a pioneer in developing tendon transfer techniques for use in the hands of those with leprosy. He was the first physician to appreciate that leprosy is not a disease of the tissue but of the nerves: it is the loss of the sensation of pain which makes sufferers susceptible to injury and leads to tissue rotting away, especially in the extremities. Brand contributed extensively to the fields of hand surgery and hand therapy through his publications and lectures, and wrote popular autobiographical books about his childhood, his parents' missionary work, and his philosophy about the valuable properties of pain.  One of his best-known books, co-written with Philip Yancey, is Pain: The Gift Nobody Wants (1993), republished in 1997 as The Gift of Pain.", "link_mentions": [{"page": "Evil", "response": ["In contemporary philosophy, there are two basic concepts of evil: a broad concept and a narrow concept. A broad concept defines evil simply as any and all pain and suffering: \"any bad state of affairs, wrongful action, or character flaw\". Yet, it is also asserted that evil cannot be correctly understood \"(as some of the utilitarians once thought) [on] a simple hedonic scale on which pleasure appears as a plus, and pain as a minus\". This is because pain is necessary for survival.  Renowned orthopedist and missionary to lepers, Dr. Paul Brand explains that leprosy attacks the nerve cells that feel pain resulting in no more pain for the leper, which leads to ever increasing, often catastrophic, damage to the body of the leper. Congenital insensitivity to pain (CIP), also known as congenital analgesia, is a neurological disorder that prevents feeling pain. It \"leads to ...bone fractures, multiple scars, osteomyelitis, joint deformities, and limb amputation... Mental retardation is common. Death from hyperpyrexia occurs within the first 3 years of life in almost 20% of the patients.\" Few with the disorder are able to live into adulthood. Evil cannot be simply defined as all pain and its connected suffering because, as Marcus Singer says: \"If something is really evil, it can't be necessary, and if it is really necessary, it can't be evil\"."]}, {"page": "Philip Yancey", "response": ["*In the Likeness of God (2004) – The Dr. Paul Brand tribute edition of Fearfully and Wonderfully Made and In His Image, "]}, {"page": "Edward Schillebeeckx", "response": ["During the Second Vatican Council, Schillebeeckx was one of the most active theologians. He drafted various council interventions for Dutch bishops such as Cardinal Bernard Jan Alfrink, and gave conferences on theological ressourcement for many episcopal conferences present in Rome. Due to his having been the \"ghost writer\" of the Dutch bishops' Pastoral Letter on the upcoming Council in 1961, he was rendered suspect with the Congregation of the Holy Office, led by Cardinal Alfredo Ottaviani (President) and the Dutchman Sebastiaan Tromp (Secretary). This was the first of three instances in which Schillebeeckx had to defend his theological positions against accusations from the Roman authorities. As a result, Schillebeeckx drafted anonymously his mostly negative comments on the schemata prepared by the Preparatory Theological Commission, headed by Ottaviani. These anonymous comments on the theological schemata debated at Vatican II, and the articles he published, also influenced the development of several conciliar constitutions such as Dei verbum and Lumen gentium. Concerning the latter document, the Dogmatic Constitution on the Church, Schillebeeckx was mainly involved in the debate on episcopal collegiality, attempting to move Catholic ecclesiology away from a purely hierarchical, structured vision of the church, focusing too heavily on Papal authority (as a result of the declaration of Papal infallibility in Vatican I's constitution Pastor aeternus). This, according to Schillebeeckx and many others at Vatican II, was to be balanced by a renewed stress on the role of the episcopal college. In this way his influence was far greater than that of a formal peritus, a status the Dutch bishops had not granted to him. Not being a peritus also allowed him more time to give talks to the Bishops attending the council, and to explain to them the \"new theology\" or understanding arising with the Council. Already in 1963, together with Chenu, Congar, Karl Rahner, and Hans Küng, he was involved in preparing the rise of the new theological journal Concilium, which was officially founded in 1965 with the support of Paul Brand and Antoine Van den Boogaard, and which promoted \"reformist\" thought."]}, {"page": "2003 in the United Kingdom", "response": ["* 7 July – Paul Brand, doctor and surgeon (born 1914)"]}, {"page": "List of Old Gowers", "response": ["*Professor Paul Brand (OG ?-?) orthopaedic surgeon who helped sufferers from leprosy. Emeritus Clinical Professor of Orthopaedics, University of Washington, international president of the Leprosy Mission, Hunterian Professor of the Royal College of Surgeons."]}, {"page": "List of Christian missionaries", "response": ["*Paul Brand – missionary surgeon in India"]}, {"page": "Dorothy Clarke Wilson", "response": ["* Ten Fingers for God (1966/1983; about Paul Brand, a missionary to lepers in India) "]}, {"page": "Kolli Hills", "response": ["* Paul Brand"]}, {"page": "1914 in the United Kingdom", "response": ["* 17 July – Paul Brand, doctor and surgeon (died 2003)"]}, {"page": "The Leprosy Mission", "response": ["1940s – In South India, Paul Brand pioneers medical research and reconstructive surgery on leprosy deformities in hands and feet.Ten Fingers for God, Dorothy Clarke Wilson, Hodder and Stoughton, 1965"]}, {"page": "Gordon Kuhrt", "response": ["In his autobiographical book, Life’s Not Always Easy, Kuhrt tells of his childhood. He was born in the Indian city of Madras during the Second World War, which prevented his parents from returning to England. He was born with clubbed feet, and then, still in India, he contracted poliomyelitis at the age of 15 months, which exacerbated his health issues. The family finally returned to England in January 1945, and were able to see doctor Paul Brand and he then underwent treatment in Great Ormond Street Children's Hospital, London. In 1946, his parents returned to India to the mission field, but were unable to take their son, owing to the ongoing treatment. For the next five years the young Gordon Kuhrt lived with foster parents, the Thorpes. He did not see his parents again until he was 10."]}, {"page": "Mary Verghese", "response": ["thumb|left|Rehabilitation Institute, CMC, Vellore After graduating, her and some of her colleagues along with the head of gynecology, Dr. Carol Jameson, were traveling in a car and it was then where she was injured in a road crash in 1954 that resulted in complete spinal cord injury. She became paralysed from the waist down (mid thoracic injury. All of her colleagues involved in the crash recovered, except for Mary. Her injuries were managed by Dr. Paul Brand, who subsequently was her mentor and under whom she learnt surgical skills related to leprosy rehabilitation. Dr Paul Brand pointed out that she could sit in her wheelchair and operate on the hands of people with Hansen's Disease."]}, {"page": "Paul Wilson Brand", "response": ["#REDIRECT Paul Brand"]}, {"page": "Brand (surname)", "response": ["*Paul Brand, English doctor"]}, {"page": "Soul Survivor (book)", "response": ["In the book, Yancey profiles thirteen authors who helped him in his Christian faith. Almost all of the authors were Christians themselves, but most were outside Yancey's own evangelical tradition. They are: Paul Brand, Frederick Buechner, G. K. Chesterton, Robert Coles, Annie Dillard, John Donne, Fyodor Dostoevsky, Shusaku Endo, Mahatma Gandhi, Martin Luther King, Jr., C. Everett Koop, Henri Nouwen, and Leo Tolstoy."]}, {"page": "July 1914", "response": ["* Born: Eleanor Steber, American opera singer, known for her collaboration with the Metropolitan Opera, in Wheeling, West Virginia (d. 1990); Paul Brand, British-American physician, lead researcher in treating leprosy, in Tamil Nadu, British India (d. 2003); "]}, {"page": "Deaths in July 2003", "response": ["*Paul Brand, 88, British surgeon, pioneering leprosy research."]}, {"page": "Ernest W Price", "response": ["As his obituary in the Leprosy Review reads, \"This work, together with the work concurrently being undertaken by Dr Paul Brand and his colleagues in India, had a revolutionary impact on ideas about concerning the aetiology and treatment of ulcers occurring in neuropathic feet.\". However the distinguished Indian leprologist Hariharan Srinivasan, writing in 1968, gave Price sole credit for elucidating the cause of plantar ulcers, not mentioning Paul Brand. Price's African patients walked barefoot and he found that wearing soles made of wood could prevent the recurrence of these ulcers, once they had been healed. Price's career in Nigeria was cut short by a serious car accident. He then spent three years (1959–1962) as an NHS consultant pathologist at East Birmingham hospital, now Heartlands Hospital."]}, {"page": "Paul W. Brand", "response": ["#REDIRECT Paul Brand"]}, {"page": "Brand, Paul", "response": ["#redirectPaul Brand"]}, {"page": "Joan Chapple", "response": ["Chapple travelled overseas for postgraduate training, visiting Australia, Britain, and Russia. She worked with hand surgeon Paul Brand in India, and then travelled to the USA, although this trip was cut short due to an accusation of anti-American activities."]}]}}