{"wiki_id": "http://www.wikidata.org/entity/Q4396787", "itemLabel": "Kate Royal", "itemDescription": "singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Royal", "wikipedia_page": {"main": "Kate Royal (born 1979) is an English lyric soprano. She is the daughter of Steve Royal, a singer and songwriter for television, and of Carolyn Royal, a former model and dancer.\nRoyal was born in London and attended Talbot Heath School in Bournemouth, Dorset. Her teachers as a youth included Jon Andrew. She later studied at the Guildhall School of Music and Drama and then the National Opera Studio, graduating in the summer of 2004. In that same year, she won the Kathleen Ferrier Award.Royal began to attract wider notice as an understudy for the role of Pamina in Mozart's Die Zauberflöte at Glyndebourne Festival Opera in 2004, when she replaced the lead soprano at one performance. With Glyndebourne on Tour, she has sung the Countess in Le nozze di Figaro. She has performed in recital with the pianists Graham Johnson and Roger Vignoles. In 2006 with Glyndebourne on Tour, she sang The Governess in Benjamin Britten's The Turn of the Screw. Later the same year, she signed a recording contract with EMI Classics, and her first disc of songs and arias was released in September 2007. She dedicates five months per year to song recitals.Royal and her husband, the actor and singer Julian Ovenden, have a son, Johnny Beau, born in October 2009. The couple married in December 2010, officiated by Ovenden's father, Canon John Ovenden, who also christened their son in a double ceremony. Their daughter, Audrey, was born in November 2011.", "link_mentions": [{"page": "Guildhall School of Music and Drama", "response": ["* Kate Royal (born 1979), soprano"]}, {"page": "Ode for the Birthday of Queen Anne", "response": ["On 23 August 2007, Kate Royal performed the aria \"Eternal source of light divine\" at the Proms."]}, {"page": "EMI Classics", "response": ["* Kate Royal"]}, {"page": "Brockenhurst College", "response": ["*Kate Royal (born 1979), opera singer"]}, {"page": "Julian Ovenden", "response": ["Ovenden lives with his wife, opera singer Kate Royal, and their son and daughter."]}, {"page": "The Record of Singing", "response": ["*Sopranos, mezzo-sopranos and contraltos: Angela Gheorghiu, Sandrine Piau, Natalie Dessay, Violeta Urmana, Patrizia Ciofi, Joyce DiDonato, Sine Bundgaard, Deborah Voigt, Christine Rice, Nina Stemme, Diana Damrau, Hyunah Yu, Kate Royal, Stephanie Blythe, Vivica Genaux"]}, {"page": "Chants d'Auvergne", "response": ["*Kate Royal: Recital, with the Academy of St Martin in the Fields conducted by Edward Gardner (\"Baïlèro\", \"La delaïssàdo\" and \"Malurous qu'o uno fenno\")"]}, {"page": "Ecce Cor Meum", "response": ["Produced by John Fraser, Ecce Cor Meum was recorded at Abbey Road Studios between 13 and 17 March 2006.   It was performed by soprano Kate Royal, the boys of Magdalen College Choir, Oxford, the boys of the Choir of King's College, Cambridge, London Voices and the Academy of St Martin in the Fields, conducted by Gavin Greenaway.", "Its American première was 14 November 2006 at a sold-out Carnegie Hall in New York City. Scored for choir and orchestra, the Orchestra of St. Luke's under Gavin Greenaway joined the Concert Chorale of New York and the American Boychoir, with soprano Kate Royal and Andrew Staples as soloists. The concert was simulcast over WNYC-FM, New York Public Radio and webcast over wnyc.org."]}, {"page": "The Tempest (opera)", "response": ["Covent Garden revived the opera in March 2007 with the same production team, Thomas Adès conducting, and many of the original London cast, including Simon Keenlyside, Cyndia Sieden, Ian Bostridge, Toby Spence, Philip Langridge, and Stephen Richardson repeating their original roles. Cyndia Sieden is the only member of the cast to sing her role, that of Ariel in all four previous productions. Amongst others new to the cast are soprano Kate Royal as Miranda and countertenor David Cordier as Trinculo."]}, {"page": "Oxford Lieder Festival", "response": ["| Mary Bevan, Sarah-Jane Brandon, Sophie Daneman, Geraldine McGreevy, Kate Royal"]}, {"page": "Crouch End Festival Chorus", "response": ["The choir has credits on more than one hundred CDs including albums by Lesley Garrett, Katherine Jenkins, Alfie Boe, and Kate Royal, and by rock and pop artists Travis, The Divine Comedy, Ray Davies, and Noel Gallagher's High Flying Birds. Ray Davies' The Kinks Choral Collection featuring CEFC reached the UK top 30 best-selling albums in 2009 and Noel Gallagher's High Flying Birds achieved the top spot in the Official UK Chart in 2011.Archive Chart, UK Albums Chart, The Official Charts Company. Retrieved 2016-02-21"]}, {"page": "National Opera Studio", "response": ["*Kate Royal"]}, {"page": "Stabat Mater (Poulenc)", "response": ["|Kate Royal"]}, {"page": "Talbot Heath School", "response": ["* Kate Royal"]}, {"page": "Edward Gardner (conductor)", "response": ["Gardner has conducted several recordings for EMI Classics, including collaborations with Alison Balsom and Kate Royal. He has recorded regularly for Chandos Records, which has included recordings of music by Berlioz, Witold Lutosławski and Benjamin Britten."]}, {"page": "Die beiden Neffen", "response": ["Die beiden Neffen oder Der Onkel aus Boston, Kate Royal, Lothar Odinius, Carsten Süß, Gächinger Kantorei, Bach-Collegium Stuttgart, Helmut Rilling, Hänssler Classics, 2004"]}, {"page": "Don Giovanni discography", "response": ["|Gerald FinleyLuca PisaroniAnna SamuilWilliam BurdenKate RoyalAnna VirovlanskyGuido LoconsoloBrindley Sherratt"]}, {"page": "Christopher Glynn", "response": ["Born in Leicester, Christopher Glynn read music at New College, Oxford before studying piano with John Streets in France and Malcolm Martineau at the Royal Academy of Music. He has subsequently performed as a piano accompanist with singers including Sir Thomas Allen, Claire Booth, Allan Clayton, Lucy Crowe, Sophie Daneman, Bernarda Fink, Anthony Rolfe Johnson, Christiane Karg, Jonas Kaufmann, Yvonne Kenny, Dame Felicity Lott, Christopher Maltman, Joan Rodgers, Kate Royal, Toby Spence, Bryn Terfel, Ailish Tynan, Roderick Williams and Catherine Wyn Rogers. He has also performed with instrumentalists including Julian Bliss, David Garrett, Tine Thing Helseth, Andrej Bielow, Daniel Hope and with several chamber ensembles. Christopher Glynn has also performed and recorded as a pianist with The Sixteen choir. Glynn has performed at venues including Wigmore Hall, Carnegie Hall, Royal Opera House, Aldeburgh Festival and the BBC Proms. In 2010 he appeared on stage as part of a multimedia production entitled The Way to the Sea at the Aldeburgh Festival.", "* Christopher Glynn performing with Kate Royal"]}, {"page": "Tara Erraught", "response": ["She was the subject of controversial reviews when she sang the role of Octavian in a production by Richard Jones of Der Rosenkavalier at Glyndebourne in 2014. Critics including Andrew Clark (in the Financial Times),\"Der Rosenkavalier, Glyndebourne, East Sussex, UK – review by Andrew Clark, Financial Times, 19 May 2014 Rupert Christiansen (in The Daily Telegraph),\"Glyndebourne 2014: Der Rosenkavalier, review\" by Rupert Christiansen, The Daily Telegraph, 18 May 2014\"Rosenkavalier row: 'I stand by every word'\" by Rupert Christiansen, The Daily Telegraph, 21 May 2014 and Richard Morrison (in The Times)\"Der Rosenkavalier at Glyndebourne by Richard Morrison, The Times, 19 May 2014 felt her physique and costume made her an implausible young male lover in this breeches role opposite Kate Royal's Marschallin.\"Glyndebourne opera critics spark 'sexism' row\", BBC News, 22 May 2014 The reviews, described as \"vicious\" by Donal Lynch in the Irish Independent, came from male critics. Several other critics and performers supported Erraught."]}, {"page": "Midsummer Night (album)", "response": ["#REDIRECTKate Royal"]}, {"page": "Joseph Middleton", "response": ["Best known for accompanying singers and for his programming flair he has partnered with Sir Thomas Allen (baritone), Louise Alder, Mary Bevan, Ian Bostridge, Allan Clayton, Dame Sarah Connolly, Lucy Crowe, Iestyn Davies, Fatma Said, Wolfgang Holzmair, Christiane Karg, Katarina Karnéus, Angelika Kirchschlager, Dame Felicity Lott, Christopher Maltman, John Mark Ainsley, Ann Murray DBE, Mark Padmore, Miah Persson, Amanda Roocroft, Kate Royal, Matthew Rose (bass), Carolyn Sampson, Nicky Spence and Roderick Williams.", "* Debussy and Mozart Songs: with Kate Royal, Nicky Spence, Ashley Riches ( BBC Music Magazine Cover CD 2017)"]}]}}