{"wiki_id": "http://www.wikidata.org/entity/Q439059", "itemLabel": "Margery Sharp", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Margery_Sharp", "wikipedia_page": {"main": "Clara Margery Melita Sharp (25 January 1905 – 14 March 1991) was an English author of 25 novels for adults, 14 children's novels, four plays, two mysteries, and numerous short stories.  Her best known work is The Rescuers series about a heroic mouse named Miss Bianca and her partner Bernard, which was later adapted into the animated feature film The Rescuers (1977) – and a sequel, The Rescuers Down Under (1990) – by Walt Disney Productions.\n\n", "link_mentions": [{"page": "January 25", "response": ["*  1905   – Margery Sharp, English author and educator (d. 1991)"]}, {"page": "Children's literature", "response": ["Ruth Manning-Sanders's first collection, A Book of Giants, retells a number of giant stories from around the world. Susan Cooper's The Dark Is Rising is a five-volume fantasy saga set in England and Wales. Raymond Briggs' children's picture book The Snowman (1978) has been adapted as an animation, shown every Christmas on British television. The Reverend. W. Awdry and son Christopher's The Railway Series features Thomas the Tank Engine. Margery Sharp's series The Rescuers is based on a heroic mouse organisation. The third Children's Laureate Michael Morpurgo published War Horse in 1982. Dick King-Smith's novels include The Sheep-Pig (1984), and The Water Horse. Diana Wynne Jones wrote the young adult fantasy novel Howl's Moving Castle in 1986. Anne Fine's Madame Doubtfire (1987) is based around a family with divorced parents. Anthony Horowitz's Alex Rider series begins with Stormbreaker (2000)."]}, {"page": "List of children's literature writers", "response": ["*Margery Sharp (1905–1991) – The Rescuers"]}, {"page": "1905 in literature", "response": ["*January 25 – Margery Sharp, English novelist and children's writer (died 1991)"]}, {"page": "1991 in literature", "response": ["*March 14 – Margery Sharp, English novelist and children's writer (born 1905)"]}, {"page": "1944 in literature", "response": ["*Margery Sharp – Cluny Brown"]}, {"page": "1959 in literature", "response": ["*Margery Sharp – The Rescuers (first in the eponymous series of nine novels)"]}, {"page": "The Rescuers", "response": ["The Rescuers is a 1977 American animated adventure comedy-drama film produced by Walt Disney Productions and released by Buena Vista Distribution. The 23rd Disney animated feature film, the film is about the Rescue Aid Society, an international mouse organization headquartered in New York City and shadowing the United Nations, dedicated to helping abduction victims around the world at large. Two of these mice, jittery janitor Bernard (Bob Newhart) and his co-agent, the elegant Miss Bianca (Eva Gabor), set out to rescue Penny (Michelle Stacy), an orphan girl being held prisoner in the Devil's Bayou by treasure huntress Madame Medusa (Geraldine Page). The film is based on a series of books by Margery Sharp, most notably The Rescuers (1959) and Miss Bianca (1962).", "Cruella de Vil, the villainess from One Hundred and One Dalmatians (1961), was originally considered to be the main antagonist of the film, but veteran Disney animator Ollie Johnston stated it felt wrong to attempt a sequel and the idea was dropped. Instead, she was replaced by a retouched version of the Diamond Duchess in Miss Bianca. The motive to steal a diamond originated in Margery Sharp's 1959 novel, Miss Bianca. Her appearance was based on animator Milt Kahl's then-wife, Phyllis Bounds (who was the niece of Lillian Disney), whom he did not particularly like. This was Kahl's last film for the studio, and he wanted his final character to be his best; he was so insistent on perfecting Madame Medusa that he ended up doing almost all the animation for the character himself. Penny was inspired by Patience, the orphan in the novel. For the accomplices, the filmmakers adapted the character, Mandrake, into Mr. Snoops and his appearance was caricatured from animation historian John Culhane. Culhane claims he was practically tricked into posing for various reactions, and his movements were imitated on Mr. Snoops's model sheet. However, he stated, \"Becoming a Disney character was beyond my wildest dreams of glory.\" Brutus and Nero are based on the two bloodhounds, Tyrant and Torment in the novels.", "Category:Films based on works by Margery Sharp"]}, {"page": "The Rescuers Down Under", "response": ["The Rescuers Down Under is a 1990 American animated adventure film produced by Walt Disney Feature Animation and released by Walt Disney Pictures. The 29th Disney animated feature film, it is the sequel to the 1977 film The Rescuers, which was based on the novels by Margery Sharp. In The Rescuers Down Under, Bernard and Bianca travel to the Australian Outback to save a boy named Cody from a villainous poacher in pursuit of an endangered bird of prey. Directed by Hendel Butoy and Mike Gabriel from a screenplay by Jim Cox, Karey Kirkpatrick, Byron Simpson, and Joe Ranft, the film features the voices of Bob Newhart, Eva Gabor (in her final film role), John Candy, and George C. Scott.", "Category:Films based on works by Margery Sharp"]}, {"page": "Bianca", "response": ["*Miss Bianca, from The Rescuers books by Margery Sharp and the animated films The Rescuers and The Rescuers Down Under"]}, {"page": "The Black Cauldron (film)", "response": ["Charles Champlin, also from the Los Angeles Times, wrote that The Black Cauldron lacks \"the simplicity and the clarity of great fairy tales, or the child-sized wonder of Margery Sharp's stories that became The Rescuers, the last really successful Disney animated feature. One wonderful chase in the old riotously inventive slapstick tradition and two minor comic figures suggest the pleasures that can result when the inventing animators have a fertile ground to start from. But a lot of the way the film seems to be dutifully following a rather cumbersome and not overly attractive story.\"Champlin, Charles (July 25, 1985). \"'Cauldron': Words Away from the Pot of Gold\". Los Angeles Times. Part V, pp. 1, 3. Retrieved September 13, 2020."]}, {"page": "Roger de Coverley", "response": ["It is mentioned in Silas Marner by George Eliot, when the fiddler at the Cass New Year's Eve party plays it to signal the beginning of the evening's dancing, and in the children's book The Rescuers by Margery Sharp."]}, {"page": "Fear of mice and rats", "response": ["*Madame Medusa, the main antagonist of Disney's The Rescuers (1977), an adaptation of Margery Sharp's children's novels, suffers from extreme musophobia, becoming hysterical upon encountering the film's protagonists, a pair of friendly mice, while aiming to protect herself by jumping onto a chair and firing her shotgun. Ironically, her far more threatening pet crocodiles hardly make her uneasy."]}, {"page": "15th Writers Guild of America Awards", "response": ["**The Notorious Landlady, Screenplay by Blake Edwards and Larry Gelbart; Based on the story \"The Notorious Tenant\" by Margery Sharp"]}, {"page": "Lyric Theatre, London", "response": ["The Lunts returned in 1938 with a transfer of their Broadway production of Amphitryon 38, S. N. Behrman's adaptation of a French original by Jean Giradoux; this was followed by Charles Morgan's The Flashing Stream, which ran for 201 performances with Godfrey Tearle and Margaret Rawlings. The war years were a lean period for the Lyric, with only few substantial runs such as The Nutmeg Tree by Margery Sharp, starring Yvonne Arnaud, which ran for 269 performances in 1941–42. In 1943 the theatre came under the control of Prince Littler. The Lunts returned in Terence Rattigan's Love In Idleness in 1944."]}, {"page": "Bernard the Brave", "response": ["Bernard the Brave is a novel written by British novelist Margery Sharp. It is the eighth novel in a series of nine known collectively as The Rescuers which tells the story of two little mice, Bernard and Miss Bianca, and their adventures as members of the Mouse Prisoner's Aid Society, a mouse organization dedicated to cheering up and rescuing prisoners around the world."]}, {"page": "List of children's books made into feature films", "response": ["| The Rescuers (1959–1978) (series), Margery SharpThe Rescuers (1959)* Miss Bianca (1962)"]}, {"page": "List of children's classic books", "response": ["| The Rescuers || Margery Sharp || 1959 ||"]}, {"page": "Book League of America", "response": ["* The Gypsy In The Parlour, by Margery Sharp, 1954"]}, {"page": "Streatham and Clapham High School", "response": ["* Margery Sharp, author of the 1959 The Rescuers which became a 1977 Disney film"]}, {"page": "Cluny Brown", "response": ["Cluny Brown is a 1946 American romantic comedy made by Twentieth Century-Fox, directed and produced by Ernst Lubitsch. The screenplay was written by Samuel Hoffenstein and Elizabeth Reinhardt based on the 1944 novel by Margery Sharp. The music score is by Cyril J. Mockridge. The film, starring Charles Boyer and Jennifer Jones, is a satire on the smugness of British high society and the last film Lubitsch completed before his death in 1947.", "Category:Films based on works by Margery Sharp"]}, {"page": "Sharp (surname)", "response": ["* Margery Sharp (1905–1991), English writer"]}, {"page": "The Notorious Landlady", "response": ["Category:Films based on works by Margery Sharp"]}, {"page": "Gentlewoman", "response": ["*Margery Sharp The Foolish Gentlewoman (1948)  "]}, {"page": "Julia Misbehaves", "response": ["This adaptation of Margery Sharp's 1937 novel The Nutmeg Tree, which was also the basis of the 1940 Broadway play Lady in Waiting, was director Jack Conway's final film.", "Julia Misbehaves began with the working titles The Nutmeg Tree (the title of the 1937 novel by Margery Sharp upon which the film was based) and Speak to Me of Love.  The screenplay was originally to have been written by James Hilton and would have starred Gracie Fields. Announced in April 1941, it was postponed later in the year because Fields was unavailable.\"Notes\" on TCM.com", "Category:Films based on works by Margery Sharp"]}, {"page": "Miss Bianca in the Antarctic", "response": ["#REDIRECT Margery Sharp#The Rescuers series"]}, {"page": "The Forbidden Street", "response": ["The Forbidden Street is a 1949 British melodrama film directed by Jean Negulesco and starring Dana Andrews, Maureen O'Hara, Sybil Thorndike, Fay Compton and A. E. Matthews. Set in Victorian London, it tells the story of a wealthy young woman marries a poor drunken artist and struggles to make ends meet; after his death, she takes in a lodger, with whom she falls in love. The film is based on the 1946 novel Britannia Mews by Margery Sharp.", "* 20th Century Fox bought Margery Sharp's novel in June 1946 for $150,000 plus bonus increments", "Category:Films based on works by Margery Sharp"]}, {"page": "Wallace Morgan", "response": ["Morgan was president of the Society of Illustrators from 1929 to 1936. In 1945, he made a comic strip adaptation of Margery Sharp's novel Cluny Brown. https://www.lambiek.net/artists/m/morgan_wallace.htm He died at home of a heart attack on April 24, 1948. He was survived by his sister Elizabeth G. Morgan, same address."]}, {"page": "Cluny Brown (novel)", "response": ["Cluny Brown is a humorous coming of age novel by Margery Sharp, published in August 1944 by Collins in the UK and Little Brown in the US."]}, {"page": "List of fictional rodents in literature", "response": ["|Margery Sharp"]}, {"page": "List of fiction works made into feature films (K–R)", "response": ["| The Rescuers (1959–1978) (series), Margery SharpThe Rescuers (1959)* Miss Bianca (1962)"]}, {"page": "List of Walt Disney Animation Studios films", "response": ["| The Rescuers book series by Margery Sharp", "| The Rescuers book series by Margery Sharp"]}, {"page": "Margery (disambiguation)", "response": ["* Margery Sharp, English writer of 42 novels, 4 plays and of short stories, including The Rescuers and sequel adapted by Disney"]}, {"page": "The Rescuers (book)", "response": ["The Rescuers is a British children's novel written by Margery Sharp and illustrated by Garth Williams; its first edition was published in 1959 by Collins in the United Kingdom and Little, Brown in the United States. The novel is the first in a series of stories about Miss Bianca, a socialite mouse who volunteered to lend assistance to people and animals in danger.", "Kirkus Reviews described the book as \"an absurd and beguiling fantasy\" that was \"made to order for Walt Disney—but a strange departure for Margery Sharp\",The Rescuers (review), Kirkus Reviews, Oct. 29th, 1959. and shortly after its publication, Walt Disney Productions began developing an adaptation of the novel. The result was the animated film The Rescuers, released in 1977 and based primarily on the second novel in the series, Miss Bianca, with elements from the original novel."]}, {"page": "Elizabeth Fair", "response": ["Fair wrote six novels of English village life that humorously and gently dissected the \"polite social politics\" of village denizens while managing to incorporate a romance or two. Reviewers typically compare her work to that of Margery Sharp or Angela Thirkell, with Stevie Smith and other reviewers noting that her work has affinities with Trollope. Of her novel All One Summer, the author wrote that it was meant for people like herself who \"prefer not to take life too seriously\". Writer Compton Mackenzie said of this novel that it was \"in the best tradition of English humour\"."]}]}}