{"wiki_id": "http://www.wikidata.org/entity/Q439572", "itemLabel": "Thomas Adès", "itemDescription": "British composer, pianist and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Ad%C3%A8s", "wikipedia_page": {"main": "Thomas Joseph Edmund Adès  (born 1 March 1971) is a British composer, pianist and conductor. Five compositions by Adès received votes in the 2017 Classic Voice poll of the greatest works of art music since 2000: The Tempest (2004), Violin Concerto (2005), Tevot (2007), In Seven Days (2008), and Polaris (2010).\n\n", "link_mentions": [{"page": "Danse Macabre", "response": ["* Totentanz (Adès) by Thomas Adès, 2013, a piece for voices and orchestra based on the 15th century text."]}, {"page": "Opera", "response": ["In the 20th century, English opera began to assert more independence, with works of Ralph Vaughan Williams and in particular Benjamin Britten, who in a series of works that remain in standard repertory today, revealed an excellent flair for the dramatic and superb musicality. More recently Sir Harrison Birtwistle has emerged as one of Britain's most significant contemporary composers from his first opera Punch and Judy to his most recent critical success in The Minotaur. In the first decade of the 21st century, the librettist of an early Birtwistle opera, Michael Nyman, has been focusing on composing operas, including Facing Goya, Man and Boy: Dada, and Love Counts. Today composers such as Thomas Adès continue to export English opera abroad.Oxford Illustrated History of Opera, Chapters 1, 3 and 9. The Viking Opera Guide articles on Blow, Purcell and Britten."]}, {"page": "Surrealism", "response": ["In the 1920s several composers were influenced by Surrealism, or by individuals in the Surrealist movement. Among them were Bohuslav Martinů, André Souris, Erik Satie, Francis Poulenc, and Edgard Varèse, who stated that his work Arcana was drawn from a dream sequence. Souris in particular was associated with the movement: he had a long relationship with Magritte, and worked on Paul Nougé's publication Adieu Marie. Music by composers from across the twentieth century have been associated with surrealist principles, including Thomas Adès, Pierre Boulez, György Ligeti, Mauricio Kagel, and Olivier Messiaen."]}, {"page": "Time signature", "response": ["Historically, this device has been prefigured wherever composers wrote tuplets. For example, a  bar of 3 triplet quarter notes could be written as a bar of . Henry Cowell's piano piece Fabric (1920) employs separate divisions of the bar (1 to 9) for the three contrapuntal parts, using a scheme of shaped noteheads to visually clarify the differences, but the pioneering of these signatures is largely due to Brian Ferneyhough, who says that he finds that \"such 'irrational' measures serve as a useful buffer between local changes of event density and actual changes of base tempo\". Thomas Adès has also used them extensively—for example in Traced Overhead (1996), the second movement of which contains, among more conventional meters, bars in such signatures as ,  and ."]}, {"page": "Divine Comedy", "response": ["In 2021, The Royal Ballet danced The Dante Project, its three parts representing the three books of the Divine Comedy. It was choreographed by Wayne McGregor to new music by Thomas Adès, with set and costumes by Tacita Dean."]}, {"page": "Countertenor", "response": ["Many modern composers other than Britten have written, and continue to write, countertenor parts, both in choral works and opera, as well as songs and song-cycles for the voice. Men's choral groups such as Chanticleer and The King's Singers employ the voice to great effect in a variety of genres, including early music, gospel, and even folk songs. Other recent operatic parts written for the countertenor voice include Edgar in Aribert Reimann's Lear (1978), the messenger in his Medea (2010), Prince Go-Go in György Ligeti's Le Grand Macabre (1978), the title role in Philip Glass's Akhnaten (1983), Claire in John Lunn's The Maids (1998), the Refugee in Jonathan Dove's Flight (1998), Trinculo in Thomas Adès's The Tempest (2004), the Boy in George Benjamin's Written on Skin (2012) and several others (see Roles in opera below)."]}, {"page": "Guildhall School of Music and Drama", "response": ["* Thomas Adès (born 1971), composer"]}, {"page": "Piano quintet", "response": ["*Thomas Adès"]}, {"page": "Aldeburgh Festival", "response": ["For the first six years of the Aldeburgh Festival, the joint Artistic Directors remained Britten, Pears and Crozier; in 1955, Britten and Pears were in sole charge, then the following year they were joined by Imogen Holst, who remained a member of the Artistic Directorate until her death in 1984.  After Britten's own death in 1976, the artistic direction of the Festival was shared; many world-class musicians joined the artistic team, including at various times Philip Ledger, Colin Graham, Steuart Bedford, Mstislav Rostropovich, Murray Perahia, Simon Rattle, John Shirley-Quirk and Oliver Knussen.  In 1999, a sole Artistic Director in the Britten mould – composer, solo performer, accompanist and conductor – was appointed in Thomas Adès, joined in 2004 by composer John Woolrich, first as Guest Artistic Director then as an Associate Artistic Director. Thomas Adès was succeeded as Artistic Director of the Festival by Pierre-Laurent Aimard in 2009.", "Thomas Adès was succeeded as Artistic Director of the Festival by Pierre-Laurent Aimard in 2009. In 2009, a suite of new spaces at Snape Maltings, including the Hoffmann Building's Britten Studio and the Jerwood Kiln Studio, was opened with the premiere performance of Harrison Birtwistle's The Corridor (opera)."]}, {"page": "Mercury Prize", "response": ["* Thomas Adès – Asyla"]}, {"page": "Conlon Nancarrow", "response": ["Other performers of Nancarrow's works (often in arrangement for live musicians) include Thomas Adès, Alarm Will Sound, and ensemble Calefax from the Netherlands who also recorded the Studies for player piano, called 'Best CD of 2009' by Dutch newspaper Het Parool. American clarinetist and composer Evan Ziporyn has adapted a number of Nancarrow's player piano studies for the Bang on a Can All-Stars to perform live."]}, {"page": "Simon Rattle", "response": ["Since his appointment, Rattle has reorganised the Berlin Philharmonic into a foundation, meaning its activities are more under the control of the members rather than politicians. He has also ensured that orchestra members' wages have increased quite dramatically, after falling over the previous few years. He gave his first concert as principal conductor of the BPO on 7 September 2002, leading performances of Thomas Adès' Asyla and Mahler's Symphony No. 5, performances which received rave reviews from the press worldwide and were recorded for CD and DVD release by EMI. Early collaborative projects in the Berlin community with Rattle and the BPO involved a choreographed performance of Stravinsky's The Rite of Spring danced by school children, documented in Rhythm Is It!, and a film project with Mark-Anthony Turnage's Blood on the Floor. He has also continued to champion contemporary music in Berlin. The orchestra has established its first education department during Rattle's tenure."]}, {"page": "BBC Symphony Orchestra", "response": ["The BBC SO is the associate orchestra of the Barbican Centre in London, where it gives an annual season of concerts. These seasons include series of concerts devoted to individual modern composers, who have included John Cage, James MacMillan, Elliott Carter, Sofia Gubaidulina, Michael Tippett, George Benjamin, Roberto Carnevale and Thomas Adès.\"A profile of the BBC Symphony Orchestra\", BBC Symphony Orchestra. Retrieved 1 August 2012"]}, {"page": "Los Angeles Philharmonic", "response": ["Perhaps Borda's boldest notion is to give visiting composers such as [John] Adams and Thomas Adès the same royal treatment that is extended to the likes of Yo-Yo Ma and Joshua Bell; Borda talks about \"hero composers.\" A recent performance of Adams's monumental California symphony \"Naïve and Sentimental Music\" in the orchestra's Casual Fridays series ... drew a nearly full house. Borda's big-guns approach has invigorated the orchestra's long-running new-music series, called Green Umbrella, which Fleischmann established in 1982. In the early days, it drew modest audiences, but in recent years attendance has risen to the point where as many as sixteen hundred people show up for a concert that in other cities might draw thirty or forty. The Australian composer Brett Dean recently walked onstage for a Green Umbrella concert and did a double-take, saying that it was the largest new-music audience he'd ever seen.", "Many composers have conducted the Philharmonic in concerts and/or world premieres of their works, including Igor Stravinsky, William Kraft, John Harbison, Witold Lutosławski, Aaron Copland, Pierre Boulez, Steven Stucky, John Williams, Jerry Goldsmith, John Adams, Thomas Adès, and Esa-Pekka Salonen."]}, {"page": "2000 in music", "response": ["*Thomas Adès – Piano Quintet, op. 20"]}, {"page": "Dies irae", "response": ["*Thomas Adès – Totentanz (2013)"]}, {"page": "Margaret Campbell, Duchess of Argyll", "response": ["*Powder Her Face, a chamber opera based on major events in the Duchess's life, received its premiere at the Cheltenham Music Festival in 1995. The English composer Thomas Adès wrote the music, and novelist Philip Hensher contributed the libretto; the Festival, along with the Almeida Opera, commissioned the piece. The opera's Duchess character, an image of the real woman refracted through an astringent camp sensibility, invites both sympathy and contempt for her by design."]}, {"page": "Wagner tuba", "response": ["* Thomas Adès"]}, {"page": "Arditti Quartet", "response": ["The quartet is considered the authentic interpreters for many late 20th century composers, with a reputation for mastering the most difficult and complex compositions. They rarely improvise as their focus is on working with composers.  These composers range from those active in the early 20th century to the present and include Hans Abrahamsen, Thomas Adès[3], Luciano Berio, John Cage[6][9], Elliott Carter, Franco Donatoni,  Pascal Dusapin, Henri Dutilleux, Brian Ferneyhough, Morton Feldman, Georg Friedrich Haas, György Kurtag, Helmut Lachenmann, György Ligeti, Witold Lutoslawski, Wolfgang Rihm, Giacinto Scelsi[10], and Iannis Xenakis. "]}, {"page": "Belcea Quartet", "response": ["The Belcea Quartet won the Gramophone Award for best debut recording in 2001.  Their discography for EMI includes Fauré's La Bonne Chanson with Ian Bostridge; Schubert's Trout Quintet with Thomas Adès and Corin Long; a double disc of Britten's string quartets, which won a MIDEM Cannes Award; Mozart's \"Dissonance\" and \"Hoffmeister\" quartets; and the complete Bartók quartets, for which the Quartet was awarded the title Chamber Music Ensemble of the Year by Germany's Echo Klassik Awards and nominated for a 2008 Gramophone Award. Their most recent release, a double disc of the late Schubert Quartets and the String Quintet with Valentin Erben for EMI, was nominated for a Gramophone Award.", "* Schubert – Trout Quintet (with pianist Thomas Adès), 2005Andrew Clements, \"Adès: Piano Quintet; Schubert: Trout Quintet: Ades/Arditti Quartet/Belcea Quartet\".  The Guardian, 6 May 2005."]}]}}