{"wiki_id": "http://www.wikidata.org/entity/Q440887", "itemLabel": "Laura Mulvey", "itemDescription": "British filmmaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Laura_Mulvey", "wikipedia_page": {"main": "Laura Mulvey (born 15 August 1941) is a British feminist film theorist. She was educated at St Hilda's College, Oxford. She is currently professor of film and media studies at Birkbeck, University of London. She previously taught at Bulmershe College, the London College of Printing, the University of East Anglia, and the British Film Institute.\nDuring the 2008–09 academic year, Mulvey was the Mary Cornille Distinguished Visiting Professor in the Humanities at Wellesley College. Mulvey has been awarded three honorary degrees: in 2006 a Doctor of Letters from the University of East Anglia; in 2009 a Doctor of Law from Concordia University; and in 2012 a Bloomsday Doctor of Literature from University College Dublin.", "link_mentions": [{"page": "Alfred Hitchcock", "response": ["Hitchcock's portrayal of women has been the subject of much scholarly debate. Bidisha wrote in The Guardian in 2010: \"There's the vamp, the tramp, the snitch, the witch, the slink, the double-crosser and, best of all, the demon mommy. Don't worry, they all get punished in the end.\" In a widely cited essay in 1975, Laura Mulvey introduced the idea of the male gaze; the view of the spectator in Hitchcock's films, she argued, is that of the heterosexual male protagonist. \"The female characters in his films reflected the same qualities over and over again\", Roger Ebert wrote in 1996: \"They were blonde. They were icy and remote. They were imprisoned in costumes that subtly combined fashion with fetishism. They mesmerised the men, who often had physical or psychological handicaps. Sooner or later, every Hitchcock woman was humiliated.\""]}, {"page": "Blue Velvet (film)", "response": ["Feminist psychoanalytic film theorist Laura Mulvey argues that Blue Velvet establishes a metaphorical Oedipal family—\"the child\", Jeffrey Beaumont, and his \"parents\", Frank Booth and Dorothy Vallens—through deliberate references to film noir and its underlying Oedipal theme. Michael Atkinson claims that the resulting violence in the film can be read as symbolic of domestic violence within real families. For instance, Frank's violent acts can be seen to reflect the different types of abuse within families, and the control he has over Dorothy might represent the hold an abusive husband has over his wife. He reads Jeffrey as an innocent youth who is both horrified by the violence inflicted by Frank, but also tempted by it as the means of possessing Dorothy for himself. Atkinson takes a Freudian approach to the film; considering it to be an expression of the traumatised innocence which characterises Lynch's work. He states, \"Dorothy represents the sexual force of the mother [figure] because she is forbidden and because she becomes the object of the unhealthy, infantile impulses at work in Jeffrey's subconscious.\""]}, {"page": "Citizen Kane", "response": ["Laura Mulvey explored the anti-fascist themes of Citizen Kane in her 1992 monograph for the British Film Institute. The News on the March newsreel presents Kane keeping company with Hitler and other dictators while he smugly assures the public that there will be no war. She wrote that the film reflects \"the battle between intervention and isolationism\" then being waged in the United States; the film was released six months before the attack on Pearl Harbor, while President Franklin D. Roosevelt was laboring to win public opinion for entering World War II. \"In the rhetoric of Citizen Kane,\" Mulvey writes, \"the destiny of isolationism is realised in metaphor: in Kane's own fate, dying wealthy and lonely, surrounded by the detritus of European culture and history.\""]}, {"page": "Outline of critical theory", "response": ["* Laura Mulvey –"]}, {"page": "Feminist film theory", "response": ["British feminist film theorist, Laura Mulvey, best known for her essay, \"Visual Pleasure and Narrative Cinema\", written in 1973 and published in 1975 in the influential British film theory journal, Screenhttp://www.asu.edu/courses/fms504/total-readings/mulvey-visualpleasure.pdf  was influenced by the theories of Sigmund Freud and Jacques Lacan. \"Visual Pleasure\" is one of the first major essays that helped shift the orientation of film theory towards a psychoanalytic framework. Prior to Mulvey, film theorists such as Jean-Louis Baudry and Christian Metz used psychoanalytic ideas in their theoretical accounts of cinema. Mulvey's contribution, however, initiated the intersection of film theory, psychoanalysis and feminism.", "Laura Mulvey expands on this conception to argue that in cinema, women are typically depicted in a passive role that provides visual pleasure through scopophilia, and identification with the on-screen male actor.  She asserts: \"In their traditional exhibitionist role women are simultaneously looked at and displayed, with their appearance coded for strong visual and erotic impact so that they can be said to connote to-be-looked-at-ness,\" and as a result contends that in film a woman is the \"bearer of meaning, not maker of meaning.\" Mulvey argues that the psychoanalytic theory of Jacques Lacan is the key to understanding how film creates such a space for female sexual objectification and exploitation through the combination of the patriarchal order of society, and 'looking' in itself as a pleasurable act of scopophilia, as \"the cinema satisfies a primordial wish for pleasurable looking.\"", "While Laura Mulvey's paper has a particular place in the feminist film theory, it is important to note that her ideas regarding ways of watching the cinema (from the voyeuristic element to the feelings of identification) are important to some feminist film theorists in terms of defining spectatorship from the psychoanalytical viewpoint.", "Carol Clover, in her popular and influential book, Men, Women, and Chainsaws: Gender in the Modern Horror Film (Princeton University Press, 1992), argues that young male viewers of the Horror Genre (young males being the primary demographic) are quite prepared to identify with the female-in-jeopardy, a key component of the horror narrative, and to identify on an unexpectedly profound level. Clover further argues that the \"Final Girl\" in the psychosexual subgenre of exploitation horror invariably triumphs through her own resourcefulness, and is not by any means a passive, or inevitable, victim. Laura Mulvey, in response to these and other criticisms, revisited the topic in \"Afterthoughts on 'Visual Pleasure and Narrative Cinema' inspired by Duel in the Sun\" (1981). In addressing the heterosexual female spectator, she revised her stance to argue that women can take two possible roles in relation to film: a masochistic identification with the female object of desire that is ultimately self-defeating, or an identification with men as the active viewers of the text. A new version of the gaze was offered in the early 1990s by Bracha Ettinger, who proposed the notion of the \"matrixial gaze\"."]}, {"page": "Film theory", "response": ["During the 1990s the digital revolution in image technologies has influenced film theory in various ways. There has been a refocus onto celluloid film's ability to capture an \"indexical\" image of a moment in time by theorists like Mary Ann Doane, Philip Rosen and Laura Mulvey who was informed by psychoanalysis. From a psychoanalytical perspective, after the Lacanian notion of \"the Real\", Slavoj Žižek offered new aspects of \"the gaze\" extensively used in contemporary film analysis.Slavoj Žižek, Welcome to the Desert of the Real, London: Verso, 2000. From the 1990s onward the Matrixial theory of artist and psychoanalyst Bracha L. Ettinger Bracha L. Ettinger, The Matrixial Borderspace, University of Minnesota Press, 2006 revolutionized feminist film theory.Nicholas Chare, Sportswomen in Cinema: Film and the Frailty Myth. Leeds: I.B.Tauris 2015.James Batcho, Terrence Malick's Unseeing Cinema. Memory, Time and Audibility. Palgrave Macmillan. Her concept The Matrixial Gaze, Bracha L. Ettinger, The Matrixial Gaze. Published by Leeds University, 1995. Reprinted in: Drawing Papers, nº 24, 2001. that has established a feminine gaze and has articulated its differences from the phallic gaze and its relation to feminine as well as maternal specificities and potentialities of \"coemergence\", offering a critique of Sigmund Freud's and Jacques Lacan's psychoanalysis, is extensively used in analysis of filmsGriselda Pollock, After-effects – After-images. Manchester University Press, 2013Maggie Humm, Feminism and Film. Edinburgh University Press, 1997 by female authors, like Chantal Akerman,Lucia Nagib and Anne Jerslev (ends.), Impure Cinema. London: I.B.Tauris. as well as by male authors, like Pedro Almodovar.Julian Daniel Gutierrez-Arbilla, Aesthetics, Ethics and Trauma in the Cinema of Pedro Almodovar. Edinburgh University Press, 2017 The matrixial gaze offers the female the position of a subject, not of an object, of the gaze, while deconstructing the structure of the subject itself, and offers border-time, border-space and a possibility for compassion and witnessing. Ettinger's notions articulate the links between aesthetics, ethics and trauma.Griselda Pollock, Encounters in the Virtual Feminist Museum: Time, Space and the Archive. Rutledge, 2007. There has also been a historical revisiting of early cinema screenings, practices and spectatorship modes by writers Tom Gunning, Miriam Hansen and Yuri Tsivian."]}, {"page": "Feminism", "response": ["Feminist cinema, advocating or illustrating feminist perspectives, arose largely with the development of feminist film theory in the late 1960s and early 1970s. Women who were radicalized during the 1960s by political debate and sexual liberation; but the failure of radicalism to produce substantive change for women galvanized them to form consciousness-raising groups and set about analysing, from different perspectives, dominant cinema's construction of women. Differences were particularly marked between feminists on either side of the Atlantic. 1972 saw the first feminist film festivals in the U.S. and U.K. as well as the first feminist film journal, Women and Film. Trailblazers from this period included Claire Johnston and Laura Mulvey, who also organized the Women's Event at the Edinburgh Film Festival. Other theorists making a powerful impact on feminist film include Teresa de Lauretis, Anneke Smelik and Kaja Silverman. Approaches in philosophy and psychoanalysis fuelled feminist film criticism, feminist independent film and feminist distribution."]}, {"page": "Marilyn Monroe", "response": ["Monroe was perceived as a specifically American star, \"a national institution as well known as hot dogs, apple pie, or baseball\" according to Photoplay. Banner calls her the symbol of populuxe, a star whose joyful and glamorous public image \"helped the nation cope with its paranoia in the 1950s about the Cold War, the atom bomb, and the totalitarian communist Soviet Union\". Historian Fiona Handyside writes that the French female audiences associated whiteness/blondness with American modernity and cleanliness, and so Monroe came to symbolize a modern, \"liberated\" woman whose life takes place in the public sphere. Film historian Laura Mulvey has written of her as an endorsement for American consumer culture:"]}, {"page": "All That Heaven Allows", "response": ["* All That Heaven Allows: An Articulate Screen an essay by Laura Mulvey at the Criterion Collection"]}, {"page": "Rear Window", "response": ["In Laura Mulvey's essay \"Visual Pleasure and Narrative Cinema,\" she identifies what she sees as voyeurism and scopophilia in Hitchcock's movies, with Rear Window used as an example of how she sees cinema as incorporating the patriarchy into the way that pleasure is constructed and signaled to the audience. Additionally, she sees the \"male gaze\" as especially evident in Rear Window in characters such as the dancer \"Miss Torso;\" she is both a spectacle for Jeff to enjoy, as well as for the audience (through his substitution)."]}, {"page": "Psychoanalytic film theory", "response": ["In the early 1970s, Christian Metz and Laura Mulvey separately explored aspects of the \"gaze\" in the cinema, Metz stressing the viewer's identification with the camera's vision,Lapsley, p. 82-4 - an identification largely \"constructed\" by the film itselfChilders, p. 173-4 - and Mulvey the fetishistic aspects of (especially) the male viewer's regard for the onscreen female body.Lapsley, p. 77-8", "* Laura Mulvey, Visual and other pleasures (1989)"]}, {"page": "St Hilda's College, Oxford", "response": ["* Laura Mulvey, feminist film theorist"]}, {"page": "Frida Kahlo", "response": ["When Kahlo began her career as an artist in the 1920s, muralists dominated the Mexican art scene. They created large public pieces in the vein of Renaissance masters and Russian socialist realists: they usually depicted masses of people, and their political messages were easy to decipher. Although she was close to muralists such as Rivera, José Clemente Orozco and David Alfaro Siquieros and shared their commitment to socialism and Mexican nationalism, the majority of Kahlo's paintings were self-portraits of relatively small size. Particularly in the 1930s, her style was especially indebted to votive paintings or retablos, which were postcard-sized religious images made by amateur artists. Their purpose was to thank saints for their protection during a calamity, and they normally depicted an event, such as an illness or an accident, from which its commissioner had been saved. The focus was on the figures depicted, and they seldom featured a realistic perspective or detailed background, thus distilling the event to its essentials. Kahlo had an extensive collection of approximately 2,000 retablos, which she displayed on the walls of La Casa Azul. According to Laura Mulvey and Peter Wollen, the retablo format enabled Kahlo to \"develop the limits of the purely iconic and allowed her to use narrative and allegory.\"", "Two events were instrumental in raising interest in her life and art for the general public outside Mexico. The first was a joint retrospective of her paintings and Tina Modotti's photographs at the Whitechapel Gallery in London, which was curated and organized by Peter Wollen and Laura Mulvey. It opened in May 1982, and later traveled to Sweden, Germany, the United States, and Mexico. The second was the publication of art historian Hayden Herrera's international bestseller Frida: A Biography of Frida Kahlo in 1983."]}, {"page": "Amy Johnson", "response": ["Johnson's life has been the subject of a number of treatments in film and television, some more accurately biographical than others. In 1942, a film of Johnson's life, They Flew Alone, was made by director-producer Herbert Wilcox, starring Anna Neagle as Johnson, and Robert Newton as Mollison. The movie is known in the United States as Wings and the Woman.  Amy! (1980) was an avant-garde documentary written and directed by feminist film theorist Laura Mulvey and semiologist Peter Wollen. A 1984 BBC television film Amy starred Harriet Walter in the title role. In the 1991 Australian television miniseries The Great Air Race, aka Half a World Away, based on the 1934 MacRobertson Air Race, Johnson was portrayed by Caroline Goodall."]}, {"page": "The Little Mermaid", "response": ["The artist Pen Dalton has made use of Laura Mulvey's interpretation of fetishism in art to link The Little Mermaid to the wearing of fetishistic clothes, and obsessive cosmetic surgery with masculine fears of loss.Mulvey, L. (1973) Fears, Fantasies and the Male Unconscious or You Don't Know What is Happening, Do You Mr Jones? Spare Rib Magazine, reprinted in Laura Mulvey, 2007, \"Visual and Other Pleasures\""]}, {"page": "List of feminists", "response": ["|1940–1999||data-sort-value=\"Mulvey, Laura\"|Laura Mulvey||United Kingdom||1941||–||||"]}, {"page": "Sofia Coppola", "response": ["Coppola's films often deal with themes of loneliness, wealth, privilege, isolation, youth, femininity, and teenage-hood in America. Furthermore, her films particularly focus upon white, Western woman/girlhood as demonstrated by the majority of her works' protagonists. Her works utilize the \"feminine gaze\" and demonstrate a knowledge of feminist film theory, such as Laura Mulvey's \"Visual Pleasure and Narrative Cinema\" - her work interacts with these theoretical texts, as she often uses \"visual pleasure\" in a manner that responds to Mulvey's texts and uproots it by subverting the male gaze into the female gaze."]}, {"page": "Lost in Translation (film)", "response": ["The film's opening shot has been another point of discussion among critics and scholars. The 36-second shot, which features Charlotte's backside as she lies on a bed wearing transparent pink panties, is based on the photorealist paintings of John Kacere and has often been compared to the initial appearance of Brigitte Bardot in the 1963 film Contempt. While some have described it as a foreshadowing of a romance between Bob and Charlotte, the film historian Wendy Haslem argues that \"Coppola's intention with this opening shot appears to be to defy taboos and to undermine expectations surrounding what might be considered the 'money shot' in more traditionally exploitative cinema.\" Correspondingly, the academic Maria San Filippo maintains that \"[Coppola] doesn't seem to be making a statement at all beyond a sort of endorsement of beauty for beauty's sake.\" King notes that the image contains both \"subtle\" and \"obvious\" appeal in its combination of aesthetic and erotic qualities, which signifies Lost in Translations position between mainstream and independent film. The film scholar Todd Kennedy interprets it in terms of feminist film theorist Laura Mulvey's conception of the male gaze, arguing that the shot \"lasts so long as to become awkward—forcing the audience to become aware of (and potentially even question) their participation in the gaze.\""]}, {"page": "Peeping Tom (1960 film)", "response": ["Film theorist Laura Mulvey echoed a similar sentiment, writing: \"Peeping Tom is a film of many layers and masks; its first reviewers were unable even to see it at face value. Entrenched in the traditions of English realism, these early critics saw an immoral film set in real life whose ironic comment on the mechanics of film spectatorship and identification confused them as viewers. But Peeping Tom offers realistic cinematic images that relate to the cinema and nothing more. It creates a magic space for its fiction somewhere between the camera’s lens and the projector’s beam of light on the screen.\""]}, {"page": "Billy Budd", "response": ["The centrality of Billy Budd's extraordinary good looks in the novella, where he is described by Captain Vere as \"the young fellow who seems so popular with the men—Billy, the Handsome Sailor,\"Melville, Herman (1995) [1924] Billy Budd, Sailor, Penguin Popular Classics, p. 54 have led to interpretations of a homoerotic sensibility in the novel. Laura Mulvey added a theory of scopophilia and masculine and feminine subjectivity/objectivity. This version tends to inform interpretations of Britten's opera, perhaps owing to the composer's own homosexuality. In her book Epistemology of the Closet (1990/2008), Eve Sedgwick, expanding on earlier interpretations of the same themes, posits that the interrelationships between Billy, Claggart and Captain Vere are representations of male homosexual desire and the mechanisms of prohibition against this desire. She points out that Claggart's \"natural depravity,\" which is defined tautologically as \"depravity according to nature,\" and the accumulation of equivocal terms (\"phenomenal\", \"mystery\", etc.) used in the explanation of the fault in his character, are an indication of his status as the central homosexual figure in the text. She also interprets the mutiny scare aboard the Bellipotent, the political circumstances that are at the center of the events of the story, as a portrayal of homophobia."]}, {"page": "List of critical theorists", "response": ["* Laura Mulvey"]}, {"page": "Birkbeck, University of London", "response": ["Meanwhile, the London Consortium graduate school — a collaboration between Birkbeck, the Tate Galleries, the Institute of Contemporary Arts, the Architectural Association, and, until 1999, the British Film Institute – has been running since the mid-1990s, offering masters and doctoral degrees in the interdisciplinary humanities and cultural studies, resourced and jointly taught by all the participating institutions. Its permanent and adjunct faculty include figures such as Tom McCarthy, Colin MacCabe, Laura Mulvey, Steven Connor, Marina Warner, Juliet Mitchell, Stuart Hall, Roger Scruton, Salman Rushdie, Tilda Swinton as well as Slavoj Žižek. Its current chair is Anthony Julius."]}, {"page": "Allen Jones (artist)", "response": ["Jones first group of erotic fibreglass sculptures, of a Hatstand, Table and Chair gained international attention when exhibited in 1970. The works were met with strong protests for perceived misogyny, which succeeded in making Jones a \"cultural hot potato\". Laura Mulvey writing for Spare Rib magazine suggested the sculptures was inspired by latent castration anxiety. Almost a decade later, when they were put on display at the Institute of Contemporary Arts in 1978, they were attacked with stink bombs. Eight years later, on International Women's Day, Chair was damaged by paint stripper while exhibited at the Tate. According to art historian and curator, Marco Livingstone, writing in 2004: \"More than three decades later, these works still carry a powerful emotive charge, ensnaring every viewer's psychology and sexual outlook regardless of age, gender or experience.\""]}, {"page": "Scopophilia", "response": ["In the 1970s, parting from Lacan's propositions, psychoanalysts of the cinema used the term scopophilia to identify and to describe the aesthetic and emotional pleasures (often pathological), and other unconscious mental processes that occur in the minds spectators gazing at a film.Jane Mills,\"The Money Shot\" (2001) ,  p. 223John Thornton Caldwell,  Televisuality: Style, Crisis, and Authority in American Television (1995) , p. 343 Yet voyeurism and the male gaze are psychological practices basic to the spectators' emotional experience of viewing mainstream, commercial cinema;J. Childers, G. Hentzi. The Columbia Dictionary of Modern Literary and Cultural Criticism (1995) pp. 316–17. notably, the male gaze is fully presented, described, and explained, and contrasted with the female gaze, in the essay \"Visual Pleasure and Narrative Cinema\" (1975), by Laura Mulvey. Subsequent scholars have challenged Mulvey's influential reading of scopophilia as a \"gross reduction of the erotic and the aesthetic to the politics of representation.\"", "* Laura Mulvey, Visual and Other Pleasures (1989)"]}, {"page": "Film studies", "response": ["*Laura Mulvey"]}, {"page": "Feminist theory", "response": ["Many feminist film critics, such as Laura Mulvey, have pointed to the \"male gaze\" that predominates in classical Hollywood film making. Through the use of various film techniques, such as shot reverse shot, the viewers are led to align themselves with the point of view of a male protagonist. Notably, women function as objects of this gaze far more often than as proxies for the spectator.Chaudhuri, Shohini, Feminist Film Theorists (Routledge, 2006) Mulvey, Laura 'Visual Pleasure and Narrative Cinema' in Feminism and Film Theory. Ed. Constance Penley (Routledge, 1988) Feminist film theory of the last twenty years is heavily influenced by the general transformation in the field of aesthetics, including the new options of articulating the gaze, offered by psychoanalytical French feminism, like Bracha Ettinger's feminine, maternal and matrixial gaze.Humm, Maggie, Feminism and Film. Indiana University press, 1997. Gutierrez-Arbilla, Julian Daniel, Aesthetics, Ethics and Trauma in the Cinema of Pedro Almodovar. Edinburgh University press, 2017. "]}, {"page": "Experimental film", "response": ["Laura Mulvey's writing and filmmaking launched a flourishing of feminist filmmaking based on the idea that conventional Hollywood narrative reinforced gender norms and a patriarchal gaze. Their response was to resist narrative in a way to show its fissures and inconsistencies. Chantal Akerman and Sally Potter are just two of the leading feminist filmmakers working in this mode in the 1970s. Video art emerged as a medium in this period, and feminists like Martha Rosler and Cecelia Condit took full advantage of it."]}, {"page": "Ways of Seeing", "response": ["The series has had a lasting influence, and in particular introduced the concept of the male gaze, as part of his analysis of the treatment of the nude in European painting.  It soon became popular among feminists, including the British film critic Laura Mulvey, who used it to critique traditional media representations of the female character in cinema.A Companion to Women in the Ancient World, edited by Sharon L. James, Sheila Dillon, p. 75, 2012, Wiley, , 9781444355000"]}, {"page": "Written on the Wind", "response": ["*Essay by Laura Mulvey at the Criterion Collection"]}, {"page": "John Berger", "response": ["In 1972, the BBC broadcast his four-part television series Ways of Seeing  and published its accompanying text, a book of the same name. The first episode functions as an introduction to the study of images; it was derived in part from Walter Benjamin's essay \"The Work of Art in the Age of Mechanical Reproduction\". The subsequent episodes concern the image of woman as a sexualized object in Western culture, expressions of property ownership and wealth in European oil painting, and modern advertising.Berger, John (writer) and Michael Dibb (producer). Ways of Seeing. British Broadcasting Corporation, 1972.  The series, the first of several close collaborations with director Mike Dibb, has had a lasting influence, and in particular introduced the concept of the male gaze, as part of his analysis of the treatment of the nude in European painting.  It soon became popular among feminists, including the British film critic Laura Mulvey, who used it to critique traditional media representations of the female character in cinema.A Companion to Women in the Ancient World, edited by Sharon L. James, Sheila Dillon, p. 75, 2012, Wiley, , 9781444355000"]}, {"page": "Screen theory", "response": ["The theoreticians of the \"Screen theory\" approach—Colin MacCabe, Stephen Heath and Laura Mulvey—describe the \"cinematic apparatus\" as a version of Althusser's ideological state apparatus. According to Screen theory, it is the spectacle that creates the spectator and not the other way round. The fact that the subject is created and subjected at the same time by the narrative on screen is masked by the apparent realism of the communicated content. This is also explained by Screen's conceptualization of the post-structuralist theory, which regards a text as an act of intervention in the present so that the film is considered a work of production of meanings rather than reflection. Instead of taking representation as a means of reproducing what is real, representation serves as a point of departure. "]}, {"page": "List of feminist literature", "response": ["* \"Visual Pleasure and Narrative Cinema,\" Laura Mulvey (1975)Visual Pleasure and Narrative Cinema"]}, {"page": "Visual culture", "response": ["Early work on visual culture has been done by John Berger (Ways of Seeing, 1972) and Laura Mulvey (Visual Pleasure and Narrative Cinema, 1975) that follows on from Jacques Lacan's theorization of the unconscious gaze. Twentieth-century pioneers such as György Kepes and William Ivins, Jr. as well as iconic phenomenologists like Maurice Merleau-Ponty also played important roles in creating a foundation for the discipline. For the history of art, Svetlana Alpers published a pioneering study on The Art of Describing: Dutch Art in the Seventeenth Century (Chicago 1983) in which she took up an earlier impulse of Michael Baxandall to study the visual culture of a whole region of early-modern Europe in all its facets: landscape painting and perception, optics and perspectival studies, geography and topographic measurements, united in a common mapping impulse."]}, {"page": "Apparatus theory", "response": ["*Laura Mulvey"]}, {"page": "Lesbian erotica", "response": ["Deborah Swedberg, in an analysis published in the NWSA Journal in 1989, argues that it is possible for lesbian viewers to reappropriate lesbian porn. Swedberg notes that, typically, all-women films differ from mixed porn (with men and women) in, among other things, the settings (less anonymous and more intimate) and the very acts performed (more realistic and emotionally involved, and with a focus on the whole body rather than just the genitals): \"the subject of the heterosexually produced all-women videos is female pleasure\". She argues (against Laura Mulvey's \"Visual Pleasure and Narrative Cineman\" and Susanne Kappeler's Pornography and Representation, for example) that such movies allow for female subjectivity since the women are more than just objects of exchange. Appropriation by women of male-made lesbian erotica (such as by David Hamilton) was signaled also by Tee Corinne."]}, {"page": "Joey Soloway", "response": ["In September 2016, Joey Soloway gave a master class on the female gaze at the Toronto International Film Festival. The term male gaze was first coined by Laura Mulvey in her 1975 essay Visual Pleasure and Narrative Cinema and, just like Mulvey, Soloway gives their own definition of the Female Gaze in three parts. Part one: “reclaiming the body, using it with intention to communicate Feeling Seeing”. An example of this female gaze is in the television show I Love Dick , Soloway said in an interview at the Sundance Film Festival that, “I Love Dick...is a series that confronts us with the power of that feminist anger, the female gaze...” Then, part two: the gazed gaze which Soloway describes as taking the camera and using it to show how it feels to be the object of the gaze. For example, in the film Fish Tank, Soloway says it does exactly that, “...while I was watching it, I was like this is the female gaze. She is showing us how it feels to be this girl. She is not looking at this girl” they explained. And finally, part three: a “Socio-Political justice-demanding way of art making” and returning the gaze. The female gaze is about people reclaiming ownership over their body, deciding how it can be portrayed and, as Soloway points out, is a “conscious effort to create empathy as a political tool” thus seeking out empathy rather than objectification."]}, {"page": "Yvonne Rainer", "response": ["Rainer sometimes included filmed sequences in her dances, and in 1972 she began to turn her attention to directing feature-length films. The feminist tone of her films, characterized by an interest in how the female body was being viewed or objectified by male directors, would have resonated with emerging feminist film theory of the time period, in seminal texts like Laura Mulvey's Visual Pleasure and Narrative Cinema becoming very influential.Senses of Cinema, Yvonne Rainer. Retrieved: February 19, 2015. Her early films do not follow narrative conventions; instead, Rainer's films combine autobiography and fiction, sound and intertitles, to address social and political issues. Rainer directed several experimental films about dance and performance, including Lives of Performers (1972), Film About a Woman Who (1974), and Kristina Talking Pictures (1976). Her later films include Journeys from Berlin/1971 (1980), The Man Who Envied Women (1985), Privilege (1990), and MURDER and murder (1996). MURDER and murder, more conventional in its narrative structure, is a lesbian love story dealing with Rainer's own experience of breast cancer. In 2017, Lives of Performers was included in the annual selection of 25 motion pictures added to the National Film Registry of the Library of Congress being deemed \"culturally, historically, or aesthetically significant\" and recommended for preservation."]}, {"page": "Mulvey", "response": ["* Laura Mulvey (born 1941), British feminist film theorist"]}]}}