{"wiki_id": "http://www.wikidata.org/entity/Q440013", "itemLabel": "Esmé Bianco", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Esm%C3%A9_Bianco", "wikipedia_page": {"main": "Esmé Augusta Bianco (born 25 May 1982) is a British actress and neo-burlesque performer, who had a recurring role as Ros on Game of Thrones.", "link_mentions": [{"page": "Marilyn Manson", "response": ["In the months that followed Evan Rachel Wood's accusations, four women filed civil lawsuits against Manson seeking financial compensation: Esmé Bianco, model Ashley Morgan Smithline, Manson's former employee Ashley Walters, and a woman who chose to remain anonymous and says she is an ex-girlfriend of Manson."]}, {"page": "May 1982", "response": ["**Esmé Bianco, British actress, DJ and model; in St Albans, Hertfordshire, England"]}, {"page": "Eric and Ernie", "response": ["* Esmé Bianco as Naked Showgirl"]}, {"page": "Esmé", "response": ["*Esmé Bianco (born 1982), British model and performer"]}, {"page": "Puscifer", "response": ["The album was produced by Mat Mitchell and Puscifer, and recorded and mixed by Mat Mitchell at Puscifer Studios in North Hollywood. Keenan appears on the album as \"Dick Merkin\". This is the first album for which Mat Mitchell (guitar, bass, keys, programming) and Carina Round (vocals, keys) are credited as permanent members. Greg Edwards (bass, guitar, keys), Gunnar Olsen (drums), Sarah Jones (drums) and Esmé Bianco (vocals) also contributed to the album."]}, {"page": "Esme Bianco", "response": ["#REDIRECT Esmé Bianco"]}, {"page": "List of British Italians", "response": ["* Esmé Bianco"]}, {"page": "Bianco (surname)", "response": ["* Esmé Bianco (born 1982), English actress"]}, {"page": "Stagecoach Theatre Arts", "response": ["* Esmé Bianco, model, actress – starred in Game of Thrones and burlesque/cabaret performer"]}, {"page": "List of Disney animated universe characters", "response": ["|Eclipsa Butterfly||Esmé Bianco||Star vs. the Forces of Evil"]}, {"page": "Thara Ak-Var", "response": ["This character was portrayed by Esmé Bianco in the third season of Supergirl.", "Thara Ak-Var appears in The CW’s live-action Arrowverse series Supergirl, portrayed by Esmé Bianco. She debuts in the third season episode \"Not Kansas\" and is portrayed as the police chief of Argo City, preserved after Krypton's explosion, and as the childhood friend of series protagonist, Kara Zor-El."]}, {"page": "Ryan Bittle", "response": ["In 2014, Bittle starred in two films, Love By the Book, starring opposite Leah Renee, and A Christmas Mystery opposite Esmé Bianco."]}, {"page": "List of Game of Thrones characters", "response": ["| Esmé Bianco || Ros || colspan=3  || colspan=5 ", "* Ros (seasons 1–3) portrayed by Esmé Bianco, right|thumb|upright=0.5|Esmé Bianco is a red-haired sex worker. The Ros of the television adaptation is an amalgam of more than one character from the books, including the unnamed redheaded northern prostitute and Alayaya. She initially lives in a brothel outside the gates of Winterfell, where she is a favorite of Theon Greyjoy, though she has attracted the attention of several others such as Tyrion Lannister and Jon Snow. Later in the season, Ros moves to King's Landing and is given employment in a brothel owned by Littlefinger. At the start of season 2, Ros has been promoted, managing the brothel and interviewing new employees. She is later abused by King Joffrey and savagely beaten by Cersei's men who mistake her for Tyrion's lover. She later enters an alliance with Varys. Her primary function in season 1 appeared to be one of sexposition, as the backstories and motives of Theon, Littlefinger and Pycelle are all revealed during sexual encounters involving her. In season 2, she is used mostly as a familiar face for the audience in several key events. Midway through season 3 she is shot dead by King Joffrey after Littlefinger discovers that she has been spying for Varys."]}, {"page": "Game of Thrones (season 1)", "response": ["* Esmé Bianco as Ros"]}, {"page": "Game of Thrones (season 2)", "response": ["* Esmé Bianco as Ros"]}, {"page": "Game of Thrones (season 3)", "response": ["* Esmé Bianco as Ros"]}, {"page": "The Climb (Game of Thrones)", "response": ["The episode marks the final appearance of Esmé Bianco."]}, {"page": "Burlesque Fairytales", "response": ["* Esmé Bianco as Mother"]}, {"page": "The Scorpion King 4: Quest for Power", "response": ["* Esmé Bianco as High Priestess Feminina"]}, {"page": "The Magicians (American TV series)", "response": ["* Esmé Bianco as Jane Chatwin (season 1; guest season 3, 5), a character from the Fillory and Further novels who also appears to Quentin, helping to guide him on his magical journey. In the present, under the name Eliza, she had a hand in initiating Quentin's journey into real magic.", "Series production began on August 4, 2015, in Vancouver, and it was announced that Olivia Taylor Dudley had replaced Sosie Bacon as Alice Quinn. It was also announced that Rick Worthy had been cast as Dean Fogg, Anne Dudek as Professor Sunderland, with Esmé Bianco also cast. Syfy aired an advance commercial-free screening of the first episode on December 16, 2015, ahead of its January 25, 2016, premiere, when it was shown along with the second episode."]}, {"page": "List of Supergirl characters", "response": ["* Thara Ak-Var (portrayed by Esmé Bianco) – A Kryptonian and an old friend of Kara's who lives in Argo City."]}, {"page": "Living Among Us", "response": ["* Esmé Bianco as Elleanor"]}, {"page": "List of Star vs. the Forces of Evil characters", "response": ["Eclipsa Butterfly (voiced by Esmé Bianco) is a former queen of Mewni (known during her reign as the \"Queen of Darkness\") and was assumed to be an ancestor of Star and Moon Butterfly before their true lineage was revealed. Three centuries before the events of the series, Eclipsa was imprisoned in crystal for the use of \"dark magic\" and eloping with Globgor, a monster; while her child, Meteora, was replaced with a Pie Folk girl named Festivia, who is the true ancestor of Star's bloodline."]}]}}