{"wiki_id": "http://www.wikidata.org/entity/Q4401420", "itemLabel": "Robert Freeman", "itemDescription": "British photographer (1936-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Freeman_(photographer)", "wikipedia_page": {"main": "Robert Freeman (5 December 1936 – 6 or 7 November 2019) was an English photographer and graphics designer best known for his work with The Beatles, shooting some of the band's most recognizable images featured on several of their album covers. From 1963 to 1966, he worked extensively with the group and did the photography and design on five of their album sleeves released consecutively on the Parlophone label in the UK, as well as on several albums on Capitol Records in the US and on various labels in other countries. Freeman designed the end credit sequences for their first two films and some of the graphics and photography displayed on the films' posters and promotional materials.\nHe worked as a film director on the rarely-seen Swinging London cult film The Touchables in 1968, which starred Judy Huxtable and David Anthony, and featured music by the British band Nirvana. He co-directed the 1969 film Secret World (La Promesse) with Paul Feyder.Freeman first came to prominence as a photo journalist working for the British newspaper The Sunday Times, for which he photographed a variety of subjects, including Nikita Khrushchev in the Kremlin. He had also become noted for his black-and-white photographs of several jazz musicians including John Coltrane. It was these photographs which impressed the Beatles' manager Brian Epstein and the Beatles themselves and led to his first commission in August 1963 to photograph the group. He was selected to photograph the entirety of the first ever Pirelli Calendar, shot in 1963 for the year 1964.", "link_mentions": [{"page": "The Song Remains the Same (film)", "response": ["* Robert Freeman – camera operator"]}, {"page": "With the Beatles", "response": ["With the Beatles is the second studio album by the English rock band the Beatles. It was released on 22 November 1963 on Parlophone,  eight months after the band's debut Please Please Me. Produced by George Martin, the album features eight original compositions (seven by Lennon–McCartney and \"Don't Bother Me\", George Harrison's first recorded solo composition and his first released on a Beatles album) and six covers (mostly of rock and roll and Motown R&B hits). The cover photograph was taken by the fashion photographer Robert Freeman and has since been mimicked by several music groups over the years. A different cover was used for the Australian release of the album, which the Beatles were displeased with.", "Impressed with Robert Freeman's black-and-white pictures of John Coltrane, Brian Epstein invited the photographer to create the cover image. George Harrison later said that, whereas the cover of Please Please Me had been \"crap\", their second LP was \"the beginning of us being actively involved in The Beatles' artwork ... the first one where we thought, 'Hey, let's get artistic.'\" The group asked Freeman to take inspiration from pictures their friend Astrid Kirchherr had taken in Hamburg between 1960 and 1962, featuring the band members in half-shadow and not smiling. To achieve this result, on 22 August 1963, Freeman photographed them in a dark corridor of the Palace Court Hotel in Bournemouth, where the band were playing a summer residency at the local Gaumont Cinema. To fit the square format of the cover, he put Ringo Starr in the bottom right corner, \"since he was the last to join the group. He was also the shortest\". Paul McCartney described the result as \"very moody\", adding: \"people think he must have worked at [it] forever and ever. But it was an hour. He sat down, took a couple of rolls, and he had it.\" The original concept was to paint the picture from edge to edge, with no bleeding, title or artist credit – a concept that went against music industry practice and was immediately vetoed by EMI. The first album to carry an edge-to-edge cover was the Rolling Stones' self-titled debut, released five months later. EMI also objected to the fact that the Beatles were not smiling; it was only after George Martin intervened, as head of Parlophone, that the cover portrait was approved. Freeman was paid £75 for his work, which was three times the fee first offered by EMI.", "* Robert Freeman – cover photograph", "Category:Albums with cover art by Robert Freeman (photographer)"]}, {"page": "Beatles for Sale", "response": ["The downbeat mood of Beatles for Sale was reflected in the album cover, which shows the unsmiling, weary-looking Beatles in an autumn scene in London's Hyde Park. The cover photograph was taken by Robert Freeman, who recalled that the concept was briefly discussed with Brian Epstein and the Beatles beforehand, namely that he produce a colour image of the group shot at \"an outside location towards sunset\". Music journalist Lois Wilson describes the result as \"the very antithesis of the early-'60s pop star\". The cover carried no band logo or artist credit, and the album title was rendered in minuscule type compared with standard LP artwork of the time.", "Category:Albums with cover art by Robert Freeman (photographer)"]}, {"page": "Help!", "response": ["The album cover shows the Beatles with their arms positioned to spell out a word in flag semaphore. According to cover photographer Robert Freeman, \"I had the idea of semaphore spelling out the letters 'HELP'. But when we came to do the shot, the arrangement of the arms with those letters didn't look good. So we decided to improvise and ended up with the best graphic positioning of the arms.\"", "Category:Albums with cover art by Robert Freeman (photographer)"]}, {"page": "Rubber Soul", "response": ["Rubber Soul was the group's first album not to feature their name on the cover, an omission that reflected the level of control they had over their releases and the extent of their international fame. The cover photo of the Beatles was taken by photographer Robert Freeman in the garden at Lennon's house. The idea for the \"stretched\" effect of the image came about by accident when Freeman was projecting the photo onto an LP-size piece of cardboard for the Beatles' benefit, and the board fell slightly backwards, elongating the projected image. McCartney recalled the band's reaction: \"That's it, Rubber So-o-oul, hey hey! Can you do it like that?\" Author Peter Doggett highlights the cover as an example of the Beatles, like Dylan and the Stones, \"continu[ing] to test the limits of the portrait\" in their LP designs.", "*Robert Freeman – photography", "Category:Albums with cover art by Robert Freeman (photographer)"]}, {"page": "Revolver (Beatles album)", "response": ["The cover for Revolver was created by German-born bassist and artist Klaus Voormann, one of the Beatles' oldest friends from their time in Hamburg during the early 1960s. Voormann's artwork was part line drawing and part collage, using photographs mostly taken over 1964–65 by Robert Freeman. In his line drawings of the four Beatles, Voormann drew inspiration from the work of the nineteenth-century illustrator Aubrey Beardsley, who was the subject of a long-running exhibition at London's Victoria and Albert Museum in 1966 and highly influential on fashion and design themes of the time. Voormann placed the various photos within the tangle of hair that connects the four faces. Turner writes that the drawings show each Beatle \"in another state of consciousness\", such that the older images appear to be tumbling out from them."]}, {"page": "Meet the Residents", "response": ["** Based on a photo by Robert Freeman "]}, {"page": "Cultural impact of the Beatles", "response": ["The Beatles' album covers furthered the medium as an art form and were widely imitated. Doggett recognises the cover photos for With the Beatles and Rubber Soul as examples of the band's image being used to \"test the limits of the portrait\", a movement that was also reflected in the cover designs for contemporary albums by Dylan and the Rolling Stones. Robert Freeman's monochrome cover shot for With the Beatles (or Capitol's Meet the Beatles! in the US) departed from convention, and alarmed EMI, by showing the band members looking austere and unsmiling. This stance was heightened in Freeman's cover portrait for Beatles for Sale, which departed further from the standard pop LP by reducing the album title to minuscule type and otherwise making no mention of the band's name. According to Schaffner, each Beatles LP cover represented a \"revolution in artwork\" starting with Rubber Soul. The latter featured a distorted image of the band's faces, which were nevertheless so instantly recognisable by 1965 that no artist credit was necessary."]}, {"page": "Meet the Beatles!", "response": ["Meet the Beatles! is a studio album by the English rock band the Beatles, released as their second album in the United States. It was the group's first American album to be issued by Capitol Records, on 20 January 1964 in both mono and stereo formats. It topped the popular album chart on 15 February 1964 and remained at number one for eleven weeks before being replaced by The Beatles' Second Album. The cover featured Robert Freeman's iconic portrait of the Beatles used in the United Kingdom for With the Beatles, with a blue tint added to the original stark black-and-white photograph."]}, {"page": "Long Tall Sally (EP)", "response": ["The picture on the EP cover was taken by Robert Freeman, as stated on the back."]}, {"page": "1963 in art", "response": ["* First Pirelli Calendar (for 1964), photographed by Robert Freeman in Majorca, issued in the United Kingdom. His portrait of The Beatles is used on the cover of their album With the Beatles (released November 22)."]}, {"page": "Pirelli Calendar", "response": ["| Robert Freeman || Majorca"]}, {"page": "1936 in art", "response": ["* December 5 – Robert Freeman, English photographer and designer (d. 2019)"]}, {"page": "Freeman (surname)", "response": ["* Robert Freeman (pastor) (born 1878), American clergyman", "* Robert Freeman (photographer) (1936–2019), English photographer"]}, {"page": "Maureen Cleave", "response": ["According to the Bob Spitz biography of the Beatles, Lennon claimed a liaison with Cleave, inspiring the band's song \"Norwegian Wood (This Bird Has Flown)\". Pete Shotton, a friend of Lennon's, also suggested Cleave, though Cleave has said that in all her encounters with Lennon that he made \"no pass\" at her, and Lennon later said he could not remember who the song was about. It has also been said the woman in question was Sonny Freeman, wife of photographer Robert Freeman, who shot the photos on the covers of multiple Beatles albums, including With the Beatles, Help! and Rubber Soul. Cleave ended her association with Lennon in 1966, the same year she married."]}, {"page": "In His Own Write", "response": ["In His Own Write was published in the UK on 23 March 1964, retailing for 9s 6d ()., quoted in . Lennon attended a launch party at Jonathan Cape's London offices the day before. Maschler refused a request from his superiors at Jonathan Cape that the cover depict Lennon holding a guitar, instead opting for a simple head shot. Photographer Robert Freeman designed the first edition of the book, a black-and-white photograph he took of Lennon also adorning the cover. The back cover includes a humorous autobiography of Lennon, \"About the Awful\", again written in his unorthodox style. The book became an immediate best-seller, selling out on its first day. Only 25,000 copies of the first edition were printed, necessitating several reprints, including two in the last week of March 1964 and five more by January 1965. In its first ten months, the book sold almost 200,000 copies, eventually reaching around 300,000 copies bought in Britain. Simon & Schuster published In His Own Write in the US on 27 April 1964, retailing for US$2.50 (). The American edition was identical to the British, except that publishers added the caption \"The Writing Beatle!\" to the cover. The book was a best-seller in the US, where its publication took place around two months after the Beatles' first visit to the country and amid Beatlemania, the hysteria that surrounded the group.", "Beatles writer Kenneth Womack suggests that, paired with the Beatles' debut film, the book challenged the band's \"non-believers\", made up of those outside their then largely teenage fanbase, a contention with which philosophy professor Bernard Gendron agrees, writing that the two pieces of media initiated \"a major reversal of the public assessment of the Beatles' aesthetic worth.\" Doggett groups the book with the Beatles' more general move from the \"classic working-class pop milieu\" towards \"an arty middle-class environment\". He argues that the band's invitation into the British establishment – such as their interactions with photographer Robert Freeman, director Dick Lester and publisher Tom Maschler, among others – was unique for pop musicians of the time and threatened to erode elements of the British class system. Prince Philip of the British royal family read the book and said he enjoyed it thoroughly, while Canadian Prime Minister Pierre Trudeau described Lennon in 1969 as \"a pretty good poet\"., quoted in . The book resulted in numerous businesses and charities requesting that Lennon produce illustrations. In 2014, the broker Sotheby's auctioned over one hundred of Lennon's manuscripts for In His Own Write and A Spaniard in the Works from Maschler's collection. The short stories, poems and line drawings sold for US$2.9 million (US$ million adjusted for inflation), more than double their pre-sale estimate."]}, {"page": "The Beatles Anthology (TV series)", "response": ["#* Nowhere Man [Remake recorded on 22 October 1965 – Take 4] – Played in the background over Paul discussing the stretched photo on the cover of the album Rubber Soul; the photo being the result of backward falling of the album-sized piece of cardboard on which photographer Robert Freeman was projecting photos at Lennon's house."]}, {"page": "Robert Freeman", "response": ["Robert Freeman may refer to:", "*Robert Freeman (MP for Bletchingley), Member of Parliament (MP) for Bletchingley", "*Robert Freeman (MP for Southwark), MP for Southwark", "*Robert Freeman (pastor) (1878–?), Scottish-American clergyman", "*Robert Freeman (bishop) (born 1952), Church of England bishop of Penrith", "*Robert Freeman (musician) (born 1935), American pianist, music educator, and musicologist", "*Robert Freeman (photographer) (1936–2019), photographer and designer", "*Robert Freeman (born 1953), American financial industry arbitrageur, see Dennis Levine", "*Robert Freeman, one of the main characters from The Boondocks franchise", "*Robert Freeman Hopwood (1856–1940), Republican member of the U.S. House of Representatives from Pennsylvania", "*Robert Freeman Smith (born 1931), member of the U.S. House of Representatives from Oregon", "*Robert Freeman Wexler (born 1961), American writer of surreal fantasy"]}, {"page": "Jane Lumb", "response": ["Lumb found work as a fashion model, appearing in the first international edition of the Pirelli Calendar in 1964,Pirelli Calendar 1964 for which she was photographed by Robert Freeman on a beach in Majorca. Her friends during the \"Swinging Sixties\", of which she has been described as \"one of the iconic faces\",The Times, obituary, 15 March 2008 included models Twiggy and Paulene Stone. According to the Liverpool Daily Post over forty years later, Lumb had \"long legs, a short skirt, a come-hither pout, a rich dad and a boarding school voice\".David Charteris, Liverpool Daily Post, 18 March 2008"]}, {"page": "Steve Veidor", "response": ["Veidor made many appearances on ITV's World of Sport, and has wrestled across Europe, worked in films, television game shows and commercials. He appeared alongside other wrestlers in the 1968 cult film The Touchables, directed by Robert Freeman, and as Muscles in Derek Ford's 1973 film Keep It Up, Jack."]}, {"page": "Karl Ferris", "response": ["After school, Ferris signed up as a steward on a P&O liner that went to Australia via India.  After returning to England, he served two years with the Royal Air Force for his National Service (Conscription) as an aerial photographer. During this period he became friends with a fellow conscriptee who was a member of a Liverpool \"Mersey Beat\" group, and he was introduced for the first time to this type of music. He was invited back to Liverpool to see a new group – The Beatles – who were appearing at the Cavern Club and was introduced to them there. From that point, he was hooked on \"Beat\" music from which The Beatles took their name. After his military service, Ferris emigrated to Vancouver, Canada working as an assistant there to master photographer Harry Nygard. From Nygard, Karl learned the skills of composition, form and texture. He also began an involvement in the \"Beatnik\" lifestyle and began hanging out in coffee bars, listening to poetry readings and the progressive jazz of such artists as Miles Davis, Herbie Hancock, John Coltrane, Eric Dolphy and Ornette Coleman. He photographed his first music subjects at these gatherings for local newspapers and magazines. He also began to take fashion shots of girlfriends and models, building up a respectable portfolio. Nygard told him that he had a real talent in this area, but to further expand his portfolio, he should return to London where the \"Mod\" fashion scene was creating new opportunities in the world of arts, music and fashion. In 1964 Karl returned to England and the \"Happening\" Beat scene.  Ferris received commissioned work as a fashion and cover photographer for teen magazines 19, Honey, Petticoat, She and later for Vogue, Harper's Bazaar, Burda, French Mode and Marie Claire. These commissions brought him to such locations as Paris, Cannes, Munich, Ibiza and Morocco. When he wasn't working he would join into the \"Scene\", and after meeting (and eventually dating) Denmark's top \"Superstar\" model of the time (Maude Bertelsen), Karl was introduced to a Pop group called \"The King Bees\" who invited him to sing cover versions of Rolling Stones songs with them, and so he began touring in and around Copenhagen with this group. He eventually returned to England for a \"fashion shoot\" offer with Vogue. In 1966, The Beatles had just released \"Rubber Soul\" and Karl had the chance to meet up with their official photographer, Robert Freeman, who encouraged Ferris to experiment with different styles of images – which he promptly did – and created his unique psychedelic style. That summer on a trip to the Spanish island of Ibiza he discovered and began shooting the innovative psychedelic fashion work of designers Simon Posthuma and Marijke Koger – aka The Fool – and these photos were eventually printed in the fashion section of The Sunday Times. This was the first time such psychedelic photography and fashions had been seen anywhere. He and The Fool were then invited to come to London to shoot some more \"Psychedelic\" fashion features for other magazines, working from a shared studio in a former private dance theatre. There, they created \"Art Happenings\" with self played psychedelic music with Fashion shows, Freeform Dancing and Action painting, with Liquid Light and Photo slide projections superimposed on the performers by Karl Ferris who also shot music and fashion photos  there. These Event parties became the talk  of the Music and Art scene at the time and famous current Pop Stars and Artists would drop by and join in the action, \"Drop In and Drop Out\" was the common solgan used. Even the Beatles heard about the \"Happenings\" and came by and joined in.  Also, Pink Floyd, Eric Clapton, The Cream, Donovan, T Rex, Mick Jagger, Grahman Nash, Graham Bond and artists Nigel Weymouth, Hapshas and the Coloured Coat, Peter Max and  David Hockney dropped by. In 1967 Simon Posthuma and Marijke Koger with their colleges Josje Leger and Barry Finch aka \"The Fool\" were commissioned by The Beatles to paint their – \"Apple Boutique\" mural covering the entire building outside and in. Also they created a Psychedelic Fashion line that was to be sold inside the store, and Karl was there to photograph it all. and he was invited to do a stage \"Liquid light show\" for Pink Floyd, which is believed to be one of the first ever done in England."]}, {"page": "Sonny Drane", "response": ["Sonny Drane (born 13 March 1939) (sometimes erroneously referred to as \"Sonny Freeman Drane\"), is a German-born woman who was briefly popular as a model in Britain in the 1960s. She was propelled to prominence when her first husband, noted British photographer Robert Freeman, included images of her in the first-ever Pirelli Calendar, for which he was the sole photographer.  At that time, she was known as Sonny Freeman.  She has been married since the 1970s to her second husband, John Drane.", "She is described by writer Philip Norman as having been an early 1960s model \"with impish looks and a rangy physique that perfectly set off the new 'fun' fashions of young designers like Mary Quant.\" Photographed in Majorca by her first husband Robert Freeman, images of her were prominently featured in the inaugural 1964 Pirelli Calendar as the calendar-girl for the months of February, March, May, July, September and October.", "In the 1970s, Robert Freeman divorced her, and she subsequently remarried John Drane, taking his last name as her own.  She is still married to Drane.", "In 1963, while she was married to Robert Freeman (who had recently begun his professional relationship with the Beatles), John Lennon was looking for a home to rent in London for himself and his wife Cynthia. Freeman suggested that the couple take a flat in the same building in the South Kensington area of London that he lived in. Freeman had become a good friend of the Beatles and socialized with them.  Writer Philip Norman says that Sonny also joined Freeman in socializing with Lennon and his wife. He further says that she became personally close to Lennon, and that they would often stay up late together talking \"about things like life death, the way you do when you're young.\""]}, {"page": "Esther Anderson (Jamaican actress)", "response": ["In parallel with her photography and work with Island Records, Anderson steadily developed a career as an actress. She secured roles in a number of early 1960s British television shows, including Dixon of Dock Green and The Avengers. She played roles in movies such as Henry Levin's Genghis Khan for Columbia Pictures, Robert Freeman's The Touchables for Twentieth Century Fox, Ted Kotcheff's Two Gentlemen Sharing, Jerry Lewis's One More Time for United Artists, and Sidney Poitier's A Warm December for First Artists. In this latter film, her role of an African princess won her a NAACP Image Award for Best Actress in 1973.Ester Anderson at IMDb."]}, {"page": "The Fest for Beatles Fans", "response": ["* Robert Freeman, photographer for four Beatles album covers"]}, {"page": "The Touchables (film)", "response": ["The Touchables is a 1968 British crime drama film directed by Robert Freeman and written by Ian La Frenais from a story by Donald Cammell. It stars Judy Huxtable, Esther Anderson and James Villiers.", "The screenplay was written by Ian La Frenais, who had created the comedy The Likely Lads for television with his partner Dick Clement. It was the first of only two films directed by Robert Freeman, the photographer responsible for a number of Beatles album covers. A mannequin of Diana Dors which appears in the film was the same model as was used in the cover montage of Sgt. Pepper's Lonely Hearts Club Band.", "Renata Adler, writing in The New York Times, described the film as a sort of fidgety mod pornography, which uses the advertising convention for eroticism—cutting abruptly from teasing sex scenes to gadgetry, in this case pinball machines, trampolines and odd items of furniture and clothing. Robert Freeman, who directs (his first feature film) is a former fashion photographer... There is no question of acting, since the range of expressions runs from seductive to sinister to mod vacuous."]}, {"page": "Secret World (film)", "response": ["Secret World is a 1969 French film starring Jacqueline Bisset. It was directed by Robert Freeman."]}, {"page": "2019 in the United Kingdom", "response": ["**Robert Freeman, 82, photographer (With the Beatles, A Hard Day's Night) and graphic designer."]}, {"page": "Deaths in November 2019", "response": ["*Robert Freeman, 82, English photographer (With the Beatles, A Hard Day's Night, Rubber Soul) and graphic designer.Death Confirmed Of Esteemed Beatles Photographer Robert Freeman"]}]}}