{"wiki_id": "http://www.wikidata.org/entity/Q4409080", "itemLabel": "Jill Halfpenny", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jill_Halfpenny", "wikipedia_page": {"main": "Jill Halfpenny (born 15 July 1975) is an English actress. Her notable roles include Rebecca Hopkins in ITV soap opera Coronation Street (1999–2000); Kate Mitchell in BBC One soap opera EastEnders (2002–2005); Izzie Redpath in Waterloo Road (2006–2007); and Diane Manning in In The Club (2014–2016). She won the second series of the television dance contest Strictly Come Dancing in 2004.", "link_mentions": [{"page": "Chicago (musical)", "response": ["Like its Broadway counterpart, the London production featured many celebrities in the starring roles. For example, Marti Pellow, David Hasselhoff, John Barrowman, Tony Hadley, Jerry Springer, Kevin Richardson and Ian Kelsey have all played the role of Billy Flynn. Maria Friedman, Josefina Gabrielle, Denise Van Outen, Claire Sweeney, Linzi Hateley, Frances Ruffelle, Jennifer Ellison, Jill Halfpenny, Brooke Shields, Sally Ann Triplett, Bonnie Langford, Tina Arena, Ashlee Simpson, Aoife Mulholland, Michelle Williams and Christie Brinkley have all played Roxie Hart. Williams was the first African American woman to play the part of Roxie on the West End stage. James Doherty was a replacement as Amos.West End theatre program, published November 2003"]}, {"page": "Byker Grove", "response": ["Byker Grove launched the careers of Anthony McPartlin (\"P.J.\") and Declan Donnelly (\"Duncan\"), who are otherwise known as Ant & Dec, as well as the actress Jill Halfpenny, Donna Air, former CBBC presenter Andrew Hayden-Smith and Emmerdale actors Dale Meeks, Charlie Hardwick, Chelsea Halfpenny, Laura Norton and Victoria Hawkins. Also appearing in the series was the now glamour model Francoise Boufhal (\"Ellie Baines\") and Charlie Hunnam, who later starred in the American TV series Sons of Anarchy and co-starred in Pacific Rim (2013).", "| Nicola Dobson || Jill Halfpenny || 1989–92 (4 series)"]}, {"page": "Gateshead", "response": ["*Jill Halfpenny – actress (Coronation Street and EastEnders)"]}, {"page": "Abigail's Party", "response": ["In March 2012, a new revival of the play directed by Lindsay Posner opened at the Menier Chocolate Factory in London. Starring Jill Halfpenny as Beverly, Joe Absolom as Tony, Natalie Casey as Angela, Susannah Harker as Sue and Andy Nyman as Laurence, it subsequently transferred to Wyndham's Theatre in the West End. Commenting on the character, Halfpenny said, \"To her mind Beverley isn't a monster and even warrants sympathy. \"When you learn about her upbringing – her mother and father haven't spoken to her for 20 years – you see why a woman who's been brought up like that and carries so many insecurities could take them out on others.\""]}, {"page": "Den Watts", "response": ["Despite turning down several offers to return to the series, Grantham reprised the role of Den in 2003. The character returned 14 years later in a highly publicized week in September 2003, where Sharon discovered that Den had survived his shooting and had fled to Spain afterwards. The development of Den's return to the show was contributed with the introductions of his and Michelle's daughter Vicki (Scarlett Alice Johnson), as well as Den's biological son Dennis Rickman (Nigel Harman), and later the character's manipulative second wife Chrissie (Tracy-Ann Oberman) in 2004. His second stint on the programme saw Den repeatedly clash with Dennis over his romantic feelings for Sharon – which sparked a longstanding father-son feud that escalated after Den discovered that Dennis had killed his mob boss Jack Dalton (Hywel Bennett), and subsequently destroyed his relationship with Zoe Slater (Michelle Ryan), by getting her to lie to Dennis that she was pregnant with their baby. Additionally, Den established a rivalry with Sharon's ex-boyfriend Phil Mitchell (Steve McFadden) that ended with him framing the latter for armed robbery; formed a friendship with Dot Branning (June Brown); slept with Phil's ex-wife Kate Morton (Jill Halfpenny) and his sister Sam (Kim Medcalf) as revenge; became publicly humiliated after losing a high-stakes poker game to the square's crime kingpin Andy Hunter (Michael Higgs); and conned Sam into relinquishing her ownership of The Queen Vic back to him by blackmailing her lawyer Marcus Christie (Stephen Churchett).", "Den gets embroiled in a feud with Sharon's former boyfriend, Phil Mitchell (Steve McFadden), after hearing that Phil hit her and also arranged for Dennis to be beaten up by a gang. As revenge, Den sleeps with Phil's sister Sam (Kim Medcalf) – then dumps her promptly. He later promises another of Phil's former girlfriends, Lisa Fowler (Lucy Benjamin), that he will help her get back her daughter Louise, who is in Phil's custody. After Phil plants drugs in the club and nearly gets it shut down, Den fakes a truce and talks Phil into accompanying him and Dennis on a warehouse robbery. Den bides his time and organises a scam to get Phil imprisoned. During the robbery, Den takes the money and obstructs Phil's getaway, resulting in Phil getting caught by the police and remanded in custody on a charge of armed robbery. Den then helps Lisa flee the country with Louise, after Phil's current wife, Kate (Jill Halfpenny), hands her over to Lisa after deciding to cut all ties with Phil. The feud brings Dennis closer to his father. Having lost his wife, his daughter and his freedom, Phil manages to escape several weeks later, confronting Den on Christmas Day; after an intense brawl in which Den hits Phil with a chair to avoid being killed, Den pays Phil off and he flees. Den then spends the rest of Christmas happily with his family, before leaving for Spain on Boxing Day to tie up some loose ends."]}, {"page": "Denise Lewis", "response": ["In 2004, Lewis took part in the BBC dancing competition, Strictly Come Dancing. She was partnered with professional dancer Ian Waite and in the first few weeks scored the highest number of points with the judges. She eventually reached the final and was runner-up to actress Jill Halfpenny. After this, Lewis and the two other partners from the final danced at the Royal Variety Performance."]}, {"page": "Metropolitan Borough of Gateshead", "response": ["* Jill Halfpenny: 7 November 2013"]}, {"page": "Denise van Outen", "response": ["Van Outen took over the role of Paulette Bonafonté from Jill Halfpenny in the West End production of Legally Blonde on 25 October 2010. She continued in the role for 6 months. In 2012, Van Outen was cast in the film of the Ray Cooney farce Run for Your Wife alongside Danny Dyer, Sarah Harding and Neil Morrissey. In 2013, she co-wrote the one-woman musical play Some Girl I Used To Know with Terry Ronald, which she will tour in from January 2014."]}, {"page": "Kelly Brook", "response": ["She also competed in the Strictly Come Dancing Christmas Special 2008, dancing the Jive with Brian Fortuna, Brendan Cole having to compete with his later partner Lisa Snowdon. Brook and Fortuna were put into fourth place, but with the studio audience's vote they came second to Jill Halfpenny and Darren Bennett."]}, {"page": "Birds of a Feather (TV series)", "response": ["Robert Kilroy Silk, Jill Halfpenny, Siobhan Hayes, Ross Kemp, Linda Henry, Eamonn Walker, Alan Ford,  Ray Winstone, George Hamilton, George Wendt, Brian Capron, Jamie Glover, Richard Branson, Lionel Blair, Liz Fraser, John Bardon, Clive Mantle, Jackie Skarvellis, James Greene, Sophia La Porter, Amy Childs, Jamie Foreman, Anna Skellern, Margo Cargill, Ted Robbins, Lorraine Kelly, Katy Cavanagh, Martin Kemp, Lucy Dixon, Dave Lynn, Nadia Sawalha, Mark Kingston, Les Dennis and Curtis Walker."]}, {"page": "Dennis Rickman", "response": ["During his time on the show, Dennis established an intense feud with his alpha-male rival and the square's undisputed top-dog kingpin Phil Mitchell (Steve McFadden) - also Sharon's on-off boyfriend. He also bonded with his and Sharon's half-sister Vicki Fowler (Scarlett Alice Johnson); formed a mutual friendship with Dalton's right-hand mobster Andy Hunter (Michael Higgs); embarked on an initial relationship with his brief girlfriend Zoe Slater (Michelle Ryan); developed a warm companionship with local gossip Dot Cotton (June Brown); slept with his acquaintance Kate Morton (Jill Halfpenny) during her marriage prospects with Phil; instituted major interactions with Sharon's family friend Pauline Fowler (Wendy Richard) along with fellow neighbour Pat Harris (Pam St Clement) and Zoe's surrogate father Charlie (Derek Martin); temporarily clashed with Phil's brother Grant (Ross Kemp) over the latter's previous marriage with Sharon; and later teamed up with the Mitchell Brothers along with their mother Peggy Mitchell (Barbara Windsor) and cousin Billy (Perry Fenwick) to help the their family bring Sharon's stepmother Chrissie (Tracy-Ann Oberman) to justice for killing Den and framing Peggy's daughter Sam (Kim Medcalf) for his murder.", "Dennis first makes an impact in Walford in May 2003, when he floors Phil Mitchell (Steve McFadden) in a fight in the Queen Vic. This launches a rivalry with Phil, which a few months leads to a meeting between the pair in Phil's garage, when several of Phil’s friends turn up and give Dennis a severe beating when Phil walks out. Dennis infuriates Phil by seducing his sister Sam Mitchell (Kim Medcalf), his wife-to-be Kate Morton (Jill Halfpenny) (who is a former flame of Dennis's) and his daughter's nanny Joanne Ryan (Tara Lynne O'Neill)."]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:gold;\"|Jill Halfpenny", "| Jill Halfpenny & Darren Bennett", "|Jill Halfpenny", "| Jill Halfpenny Mark Ramprakash Matt Di Angelo Chris Hollins Ricky Whittle Chelsee Healey Louis Smith Simon Webbe Georgia May Foote Louise Redknapp Joe McFadden Bill BaileyAJ Odudu Rhys Stephenson Tilly Ramsay", "| Jill Halfpenny & Darren Bennett Ore Oduba & Joanne Clifton  Alexandra Burke & Gorka Márquez  Ashley Roberts & Pasha Kovalev  Karim Zeroual & Amy Dowden "]}, {"page": "Walford", "response": ["The Dagmar at 10 Turpin Road is first mentioned in 1986 and seen in 1987 when James Willmott-Brown (William Boyde) takes over and turns it into a wine bar. After James rapes Kathy Beale (Gillian Taylforth), the bar is burnt down on the orders of Den. The building is then used for several businesses, including Ian Beale's (Adam Woodyatt) Meal Machine, a catering business, and a bric-a-brac shop, also owned by Ian. It also becomes a beauty salon, first called Sophisti-Kate's, run by Kate Mitchell (Jill Halfpenny), then Booty, run by Tanya Branning (Jo Joyner), Roxy's, run by Roxy Mitchell (Rita Simons), and Beauty, run by Sadie Young (Kate Magowan). It returns to being a wine and cocktail bar in 2014 when Sharon Rickman opens The Albert. After Vincent Hubbard (Richard Blackwood) buys half the bar and Sharon later sells her half to Vincent as well, he and his wife, Kim Fox-Hubbard (Tameka Empson), run it until he is forced to sell it to pay people he owes money to and it is left empty in early 2018. Kathy buys the building in 2019, and decides to reopen it as a gay bar called The Prince Albert."]}, {"page": "June Brown", "response": ["Brown has also been active in British theatre. She directed Pin Money by Malcolm Needs in London, and Double D by Matthew Westwood in Edinburgh and London. She played Mrs Danvers in a touring production of Rebecca. Other plays include An Inspector Calls, The Lion in Winter, A View from the Bridge, and numerous pantomimes. During her early career, she played the roles of Hedda Gabler and Lady Macbeth. In 2009, Brown played Jessie in the West End production of Calendar Girls at the Noël Coward Theatre. Also in the play were former EastEnders stars Anita Dobson (Angie Watts), Jill Halfpenny (Kate Mitchell) and Jack Ryder (Jamie Mitchell)."]}, {"page": "Lilia Kopylova", "response": ["In Autumn 2004, Kopylova competed in the BBC One pro-celebrity ballroom dancing television programme Strictly Come Dancing, dancing with celebrity singer Aled Jones. They finished fourth overall and fourth in the following Christmas Champion of Champions show. Her husband Darren Bennett won both shows with Jill Halfpenny."]}, {"page": "Darren Bennett (dancer)", "response": ["* Series Two: Won with his partner, actress Jill Halfpenny.", "* Christmas Special: Won with his partner from series two, Jill Halfpenny.", "* Series Six: Knocked out in the fourth week, dancing with EastEnders' Jessie Wallace. Won the 2008 Christmas Special with Jill Halfpenny, meaning they became two of the select few couples to win the Christmas Special twice.", "* On the 2009 Strictly Come Dancing Tour Darren was re-united with his Series 2 partner and champion Jill Halfpenny.", "|rowspan=\"11\"| Jill Halfpenny"]}, {"page": "Dancing with the Stars", "response": ["Series 2, Fall 2004: Jill Halfpenny & Darren Bennett"]}, {"page": "Chrissie Watts", "response": ["Chrissie Watts was created by the production team to be more the \"equal\" of her notorious and villainous husband than his long-suffering first wife, Angie (Anita Dobson). The character was described by Oberman as being like Angie \"but with 15 more years of feminism behind her\", and was hailed by the TV editor of the Evening Standard as \"the only strong woman left in Walford\". She became well known for her deviousness and \"scheming\", echoing the traits of her husband, with the official EastEnders website characterising her as \"happy to play mind games\" and \"often two steps ahead\" of Den. As part of the Watts family and the last of its major members to have appeared on the show, Chrissie's storylines explored her tumultuous marriage to Den; bonding with his adopted daughter Sharon (Letitia Dean) and her two half-siblings, Dennis Rickman (Nigel Harman) and Vicki Fowler (Scarlett Alice Johnson); conspiring with Den to retake ownership of The Queen Victoria public house; forming a relationship with her boyfriend Jake Moon (Joel Beckett) after Den's murder; attempting to sell the Queen Vic Jake's gangland boss Johnny Allen (Billy Murray) and local businessman Ian Beale (Adam Woodyatt); being blackmailed by young wayward Stacey Slater (Lacey Turner); and feuding with the rival Mitchell family. During her time on the show, Chrissie sparked numerous clashes with other female characters - such as her archenemy Sam Mitchell (Kim Medcalf); Stacey's cousin Kat (Jessie Wallace); Phil's girlfriend Kate Morton (Jill Halfpenny); Kat's daughter Zoe (Michelle Ryan); and Sam's mother Peggy (Barbara Windsor). It was noted by Oberman herself that Chrissie \"had more fights on EastEnders than most women have in their whole lives\", and was constantly scheming against those who got in her way - thereby earning her the sobriquet of \"super-bitch\".", "As Chrissie settles herself in the square and recoups her marriage with Den, she manages to bond with his children by getting along with Dennis; helping out Vicki with her plans to enter fashion school; and working with Sharon in the management of their nightclub called \"Angie's Den\" — which Chrissie quickly learns is partly named after Den's deceased first wife Angie (Anita Dobson). She soon befriends an locally ex-policewoman, Kate Morton (Jill Halfpenny), and the two work together as hairdressers in her nail salon. However, this does not last when Chrissie discovers that Den has been sleeping with Kate — which confirms her earlier suspicions about Den and his monogamous habits, despite his attempts to convince her that she is mistaken. Chrissie later exacts revenge on Kate by offering to give her a haircut, only to end up hacking most of her hair. She then proceeds to smash up the beauty salon in a rage, and slaps Kate that results in the pair fighting — which Den breaks up moments later; Chrissie promptly slaps Den and confronts him over his \"dirty little secret\". As she goes to leave the salon, Chrissie runs into Kate's boyfriend Ian Beale (Adam Woodyatt) and tells him that Den is Kate's \"mystery man\". She later departs Walford, distraught and hurt at Den's betrayal, but then returns due to being the co-owner of Kate's salon; ironically enough, Den has temporarily left the square to sort out his \"loose ends\" in Spain.", "In an interview with the official EastEnders website, Oberman detailed the background dynamic to Chrissie and Den's relationship as it existed before their appearance on the show: \"They were a real match for each other and ran a successful wine bar. The couple made a good team, but he was always going off with other women. She'd end up leaving him, but they'd always end up back together.\" Den's womanising and philandering nature was deliberately set against Chrissie's strong and forceful personality, and culminated on-screen in his affair with Kate Mitchell (Jill Halfpenny). The plot was praised by television editor Ru Green as being one of the \"better storylines\" during an otherwise weak year for the show, with media attention at the time profiling Chrissie's dramatic plans for revenge. The climax, which saw Chrissie cut off Kate Mitchell's hair in retribution for the affair, was a highlight for Oberman and an important dramatic milestone for her character: \"cutting off Jill Halfpenny's hair in the salon... was a really great episode. I loved working with Jill and I think that put Chrissie on the map.\""]}, {"page": "Andy Hunter (EastEnders)", "response": ["The next day, Dalton's murder becomes public knowledge and Andy takes control of The Firm. He soon questions both Dennis and Phil about their alleged involvement in Dalton's death, up to the point where he has the mob keep them under surveillance — to which Phil wrongfully assumes is the police led by his arch-rival DCI Jill Marsden (Sophie Stanton). Later on, Andy confronts Phil just as he is about to go on a holiday with his fiancée Kate Morton (Jill Halfpenny) and daughter Louise (Rachel Cox). He explains to Phil that it was the mob and not the police that were keeping him and Dennis under surveillance. When Phil refuses to tell Andy the truth behind the events of Dalton's murder, Andy tricks Phil into exposing Dennis' role by offering him a sweet — to which Andy would take Phil's acceptance as confirmation that Dennis was the one who killed Dalton. This works successfully as Phil takes the sweet before leaving, and Andy later confronts Dennis with the knowledge that he murdered Dalton. Just as it appears that Andy is going to have Dennis killed, however, he instead pardons him and the two proceed to form a mutual friendship from there onwards; though Andy would later trigger Dennis' feud with Phil after he tells Dennis that Phil grassed him to the mob over Dalton's murder. Two months later, Den unexpectedly reappears in Walford after being presumed dead for the past fourteen years. This prompts Andy to order his goons to bring Den to him for a meet-up at the rendezvous point, where Andy decides to condone Den for his previous crimes against The Firm.", "On 18 November 2004 it was announced that actor Michael Higgs had been axed from his role as Andy Hunter and that his last scenes would be screened in Easter 2005. Higgs' axing from the role came following the decisions to axe fellow cast members Jill Halfpenny and Leslie Grantham. A BBC spokesperson stated, \"We thank Michael for all his hard work.\" It was speculated that the decision to have Higgs written out of the show was to make way for the introduction of Billy Murray as Johnny Allen, whom critics stated made Andy \"look like small fry\". In an interview on Today with Des and Mel in February 2005 Higgs hinted that his character would be killed off. He made his final appearance as Andy Hunter on 18 February 2005, when his character was murdered by Johnny. Leslie Grantham's final scenes as Den Watts were screened the same night as Andy's departure."]}, {"page": "Richard Fleeshman", "response": ["Fleeshman began his professional career in the film called An Angel for May. At the age of 12, from 2002 to 2006, he played the role of Craig Harris in Coronation Street. He was the only member of his on-screen family to escape the axe in 2005, leaving the programme at the age of 16. His final episode was broadcast on 16 October 2006. Fleeshman later filmed an episode of Blue Murder in 2007 in which he played the character Ben Holroyd, starring alongside Jill Halfpenny. The episode, called \"Crisis Management\", was broadcast in December 2007 on ITV. He played the role of Gillen in the ITV comedy drama Monday Monday, which aired on 10 August 2009."]}, {"page": "The Catherine Tate Show", "response": ["This series was far more successful with viewing figures than the first, securing ratings of 2.89 to 3.92 million, with the final episode receiving higher viewing figures than the episode of Extras which aired beforehand.\"Weekly Viewing Summary. Scroll from 24/07/05 – 28/08/05\". BARB. Retrieved 21 January 2007. Celebrities such as Peter Kay and Jill Halfpenny made guest appearances in series two. The series also had new theme music composed by Howard Goodall. For the opening, various characters are in an open field. The camera closes in on Lauren Cooper, zooms into her eye, then zooms out of Sheila Carter's eye. The camera pans to the right, where Bernie enters. The camera zooms into her eye, then zooms out of Nan's eye, where she is seen laughing. The end of the sequence shows the main title The Catherine Tate Show. The zooming is the same for both series two and three although Shelia Carter does not appear in series three (in the 2007 Christmas Special, Sheila is replaced by Geordie Georgie).", "*Jill Halfpenny – with The Aga Saga Woman"]}, {"page": "Donna Air", "response": ["Donna Marie Theresa Air was born on 2 August 1979, in Wallsend, North Tyneside, to receptionist Marie (née Lackenby) and mechanical engineer Trevor Air. The eldest of three children, Air has a sister, Francesca, and brother, Alexander. Air grew up in Gosforth, Newcastle upon Tyne, where she attended St Oswald's Catholic Primary School and later Sacred Heart Convent School. Air was then educated at Gosforth High School, and also attended First Act Theatre, a local youth theatre group. Her fellow students at First Act Theatre included Jill Halfpenny and Anthony McPartlin. Air also modelled as a child, appearing in ads for Nissan, Asda and Lenor."]}, {"page": "Gail Platt", "response": ["Gail tires of her responsibility of the café and sells her share to Roy and his new girlfriend Hayley Patterson (Julie Hesmondhalgh), but continues to work there. The café relocates in 1999 to a new development on Victoria Street and is renamed Roy's Rolls. 1999 also sees Gail and Martin's marriage get into serious trouble after Gail demands Martin have a vasectomy after she has a pregnancy scare and doesn't want any more children. Martin refuses and Gail's unreasonable behaviour and anger pushes Martin to become good friends with another nurse, Rebecca Hopkins (Jill Halfpenny). They initially bond over troublesome spouses but soon begin an affair that lasts into 2000. Martin plans on leaving Gail for Rebecca, but this is put on hold when they discover that Sarah (now played by Tina O'Brien), now 13, is refusing to eat and being sick. Fearing that she is developing an eating disorder, Gail takes her to the doctors and learns that Sarah is five months pregnant and gives birth to Bethany (Emily & Amy Walton) in June 2000. Sarah struggles with motherhood and Gail quits her job so she can look after Bethany while Sarah is at school and enjoy being a teenager occasionally. The truth about Martin's affair comes out soon after the baby's birth and Gail is devastated. She tries to keep the family together but it doesn't work as Gail kept on taking her frustration out on Sarah, accusing her of being a bad mother which caused her to run away and to move into the Croppers' flat. Gail felt very guilty after Sarah returned home. She breaks down and tells Martin she wants a divorce. Martin moves out in October 2000, and he and Gail divorce the following year. Soon after Martin leaves, Gail gets a job as a receptionist in the newly built medical centre."]}, {"page": "Sam Mitchell (EastEnders)", "response": ["The character of Sam Mitchell was initially portrayed as a young, naive girl who had initially relied less upon her mother Peggy (Jo Warne/Barbara Windsor) than her two older brothers Phil (Steve McFadden) and Grant (Ross Kemp) - although she gradually evolved into becoming more flirty, headstrong, and charismatic, with a determination to be taken more seriously. During her time in the soap, Sam established a teen elopement with her first husband Ricky Butcher (Sid Owen); repeatedly clashed with his future spouse Bianca Jackson (Patsy Palmer) in light of the couple's divorce, and Sam thereafter sleeping with Bianca's father David Wicks (Michael French); had an unsuccessful relationship with Grant's nemesis Beppe di Marco (Michael Greco); slept with Phil's archenemy Steve Owen (Martin Kemp) without knowing that it was part of his intent to make his wife, Mel Healy (Tamzin Outhwaite) jealous; briefly dated Peggy's barman, Trevor Morgan (Alex Ferns), until she learned that he had been using this to antagonize her cousin Billy (Perry Fenwick); temporarily worked for her brothers' estranged lover Sharon Watts (Letitia Dean) and her half-brother Dennis Rickman (Nigel Harman); quarrelled with Phil's ex-wife Kate Morton (Jill Halfpenny); embarked on an ill-fated marriage with her community's gangland kingpin Andy Hunter (Michael Higgs); developed a conflict with Sharon and Dennis' family, the Watts, after their father Den (Leslie Grantham) blackmailed her lawyer Marcus Christie (Stephen Churchett) to con the Mitchells from their ownership of The Queen Victoria public house; feuded with Den's widow Chrissie (Tracy-Ann Oberman) after she incriminated both Sam and her friend, Zoe Slater (Michelle Ryan) for Den's murder; was manipulated by her uncle Archie (Larry Lamb) into unknowingly causing their family to lose their pub for a second time; got framed by her own family for Archie's murder; sparked a rivalry with his two daughters, Ronnie (Samantha Womack) and Roxy (Rita Simons), over the trio's separate romances with their common boyfriend Jack Branning (Scott Maslen); struggled to cope with motherhood after giving birth to Jack's baby, Ricky (Henri Charles); and attended her mother's funeral after losing her to cancer."]}, {"page": "Phil Mitchell", "response": ["The follow-up of Sharongate saw Phil embarking on a problematic marriage with Ben's mother Kathy Beale (Gillian Taylforth); constantly tormenting Kathy's eldest child Ian Beale (Adam Woodyatt) over the course of their long-running animosity; having a one-night stand with Ian's ex-wife Mel Healy (Tamzin Outhwaite); escalating his two most competitive rivalries with Mel's husband Steve Owen (Martin Kemp) and their common nemesis Dan Sullivan (Craig Fairbrass); becoming the surrogate father of godson Jamie (Jack Ryder); establishing a companionship with Jamie's estranged uncle Billy (Perry Fenwick); clashing with love rival Mark Fowler (Todd Carty) over Louise's parentage; harbouring resentment against Mark's younger brother Martin Fowler (James Alexandrou) for accidentally killing Jamie in a car accident; teaming up with Sharon's adoptive brother Dennis Rickman (Nigel Harman) to eliminate their crime boss Jack Dalton (Hywel Bennett) and then cover up the latter's murder; marrying policewoman Kate Morton (Jill Halfpenny) after saving her from Dalton's earlier arrangement to have her killed; crossing paths with Kate's superior DCI Jill Marsden (Sophie Stanton) when she occasionally tries to bring him to justice; being set-up for armed robbery by Sharon and Dennis' illegitimate father Den Watts (Leslie Grantham); helping exonerate Sam for Den's murder after the latter's spouse and killer Chrissie (Tracy-Ann Oberman) frames her for the crime; waging a conflict against Peggy's gangland enemy Johnny Allen (Billy Murray) that culminated in Get Johnny Week; discovering at his wedding to Stella Crawford (Sophie Thompson) that she had been abusing Ben during their relationship; becoming a prime suspect in the murder of his uncle Archie (Larry Lamb); setting fire to The Queen Victoria public house in light of his addiction to crack cocaine; getting shot by ex-lover Shirley Carter (Linda Henry) on the day of his wedding to Sharon; rescuing his two cousins Ronnie (Samantha Womack) and Roxy (Rita Simons) from being murdered by their notorious adversary Nick Cotton (John Altman); framing ex-business partner Max Branning (Jake Wood) for the murder of Ian's daughter Lucy (Hetti Bywater) in the aftermath of her killer being revealed to be Lucy's younger brother Bobby (Eliot Carrington); coping with Peggy's death after she commits suicide to end her cancer endurance; having a child with Denise Fox (Diane Parish); getting hospitalized by Martin's wife Stacey Fowler (Lacey Turner) after threatening to extort money from her closest relative Kat (Jessie Wallace); ending his prolonged marriage to Sharon upon discovering that she had been sleeping with Louise's boyfriend, Keanu Taylor (Danny Walters) and that he is not responsible for her pregnancy as a result of their hidden romance; and being partly responsible for the death of Sharon's son Denny (Harry Hickles/Bleu Landau) after his confrontation with Keanu over the affair had instigated a boat accident that resulted in the younger's death. On 25 December 2020, Phil was later revealed to be the assailant who attacked Ian in the storyline \"Who Attacked Ian Beale?\"", "Phil soon falls for Kate Morton (Jill Halfpenny), unaware that she is an undercover police officer investigating Lisa's disappearance. After Phil confesses that he manipulated Lisa to give him Louise and paid her to leave the square for good, Kate reveals her true identity. In response, Phil ends his romance with Kate and threatens to kill her – even when she admits to loving him with the promise of quitting her job. Kate disappears, but several months later, Phil finds her working as the secretary for the square's reigning gangland kingpin: Jack Dalton (Hywel Bennett). He soon begins to visit Dalton on several occasions, most notably when Phil finds out that Dalton discovers Kate's identity. When Dalton plans to have her killed, sending his bouncer George Peters (Andy Beckwith) to rape and murder Kate in her house, Phil comes to Kate's rescue by knocking out Peters just as he attacks Kate. Though she insists on getting the police involved, Kate allows Phil to deal with Dalton on his own. This Phil does by frogmarching Peters back to Dalton's nightclub, the \"Imperial Room\", and urging Dalton himself to let Kate go free. Dalton agrees to spare Kate, but tells Phil that he now owes him a favor."]}, {"page": "Wyndham's Theatre", "response": ["* Abigail's Party (18 May 2012 – 1 September 2012) by Mike Leigh, starring Jill Halfpenny"]}, {"page": "David Platt (Coronation Street)", "response": ["David is the son of Martin (Sean Wilson) and Gail Platt (Helen Worth). David was born on Christmas Day 1990. Martin's friend, Carmel Finnan (Catherine Cusack), tried to kidnap David when he was a toddler. She also posed as his mother to other characters. Carmel then tries to frame Gail for pushing her down the stairs and is revealed to be mentally ill. In 2000, a nine-year-old David becomes jealous of the attention his newborn niece Bethany Platt (Amy and Emily Walton) is getting. He decides to get attention by getting arrested for shoplifting. In 2001, Gail and Martin divorce after Martin has an affair with Rebecca Hopkins (Jill Halfpenny). David is unhappy and begins misbehaving in the hope that they will get back together. David becomes the target of a school bully and, despite Gail's advice to ignore him, he becomes violent and gets into fights. His behaviour worsens when Gail marries Richard Hillman (Brian Capron) in July 2002, but he comes to accept Richard. In March 2003, Richard is revealed to be a serial killer and tries to kill himself, Gail, David, Bethany and her mother - David's sister - Sarah Platt (Tina O'Brien) by driving them into the local canal. Gail, Sarah, David and Bethany are all rescued, while Richard drowns. In the years following, David develops a penchant for lying and scheming both at home and at school."]}, {"page": "Martin Platt", "response": ["Martin Platt is a fictional character from the British ITV soap opera, Coronation Street, portrayed by Sean Wilson. His major storylines were a relationship with Gail Tilsley (Helen Worth) following the death of her husband Brian (Christopher Quinten) and the birth of their child David (Jack P. Shepherd); a feud with Gail's former mother-in-law Ivy Tilsley (Lynne Perrie); the adoption of Brian's children Sarah (Tina O'Brien) and Nick (Ben Price); affairs with Cathy Power (Theresa Brindley) and Rebecca Hopkins (Jill Halfpenny); his relationship with 16-year-old Katy Harris (Lucy-Jo Hudson); and his involvement in the rescue of Gail from her killer husband Richard Hillman (Brian Capron). He left on 9 November 2005. In January 2018, it was confirmed that he would be returning for a short period. He returned on 22 March 2018 and left on 26 March 2018 to go to New Zealand with Robyn and Charlotte.", "In the mid-1990s, Martin becomes friendly with fellow nurse, Carmel Finnan (Catherine Cusack). Carmel makes Gail believe she is having an affair with Martin and is pregnant by him, but the problem is solved by Carmel's father, John (Shay Gorman) from Ireland coming to take her home. Martin later sleeps with nurse Cathy Power (Theresa Brindley) on Christmas Day, while working as a student nurse. Martin confesses, and Gail finds it difficult to forgive him, but they are reconciled after Martin passes his nursing exam. In 1998 Martin is suspended from work after Les took an overdose by accident and blamed Martin for this, Les was later found at fault and Martin returned to nursing in early 1999. Martin's 13-year-old adoptive daughter Sarah (now Tina O'Brien) finds out she is pregnant and she cannot have an abortion. Despite him and Gail planning to go to Canada and adopt the baby, Sarah gives birth to Bethany Platt (Amy and Emily Walton). In 1999, Martin becomes friendly with Rebecca Hopkins (Jill Halfpenny), and Gail accuses him of having an affair, but is reassured. Martin and Rebecca subsequently do have an affair, which Martin confesses to Gail only after Rebecca has left him. After an unsuccessful attempt to patch up the marriage, Martin goes to live in a nearby flat and Gail divorces him. Martin remains close to Gail, even after the divorce, and often comes round to have tea with Gail, Sarah, Bethany and David (now played by Jack P. Shepherd)."]}, {"page": "Gemma Atkinson", "response": ["Atkinson played the role of Hannah in the 2011 romantic comedy film How to Stop Being a Loser. The film also starred Richard E. Grant, Jill Halfpenny and Pamela Anderson."]}]}}