{"wiki_id": "http://www.wikidata.org/entity/Q441793", "itemLabel": "Storm Constantine", "itemDescription": "British writer (1956-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Storm_Constantine", "wikipedia_page": {"main": "Storm Constantine (12 October 1956 – 14 January 2021) was a British science fiction and fantasy author, primarily known for her Wraeththu series, which began as one trilogy but has spawned many subsequent works. Beginning in the 1980s, Constantine's short stories appeared in dozens of genre fiction magazines and anthologies. She was the author of over 30 published novels and non-fiction books (often examining issues of sex and gender), plus numerous other publications, including magical grimoires. Her debut novel, The Enchantments of Flesh and Spirit, was nominated for a Lambda Literary Award, and subsequently her work was nominated for the British Science Fiction Award, the British Fantasy Award, the Locus Award, and the Otherwise Award. In addition to her work as a writer, Constantine headed Immanion Press, an independent publishing company she founded in 2003 with the express purpose of publishing her own back catalog as well as works of other niche fiction and non-fiction writers.", "link_mentions": [{"page": "Goth subculture", "response": ["The figures that the movement counted among its historic canon of ancestors were equally diverse. They included the Pre-Raphaelite Brotherhood, Friedrich Nietzsche (1844‒1900), Comte de Lautréamont (1846‒1870), Salvador Dalí (1904‒1989) and Jean-Paul Sartre (1905‒1980). Writers that have had a significant influence on the movement also represent a diverse canon. They include Ann Radcliffe (1764‒1823), John William Polidori (1795‒1821), Edgar Allan Poe (1809‒1849), Sheridan Le Fanu (1814-1873), Bram Stoker (1847‒1912), Oscar Wilde (1854‒1900), H. P. Lovecraft (1890‒1937), Anne Rice (1941‒2021), William Gibson (1948‒), Ian McEwan (1948‒), Storm Constantine (1956‒2021), and Poppy Z. Brite (1967‒)."]}, {"page": "Michael Moorcock", "response": ["In 1995–96, Moorcock wrote a script for a computer game/film/novel by Origin Systems. When Electronic Arts bought Origins, the game was cancelled, but Moorcock's 40,000-word treatment was fleshed out by Storm Constantine, resulting in the novel Silverheart. The story is set in Karadur-Shriltasi, a city at the heart of the Multiverse. A second novel, Dragonskin, was in preparation, with Constantine as the main writer, but she died in January 2021, after a long illness. Moorcock abandoned a memoir about his friends Mervyn Peake and Maeve Gilmore because he felt it was too personal."]}, {"page": "Pat Cadigan", "response": ["*Introduction, Storm Constantine (in)"]}, {"page": "List of science-fiction authors", "response": ["*Storm Constantine (1956–2021)"]}, {"page": "List of fantasy authors", "response": ["* Storm Constantine, (born 1956) author of the Wraeththu series"]}, {"page": "1956 in literature", "response": ["*January 2 – Storm Constantine, British science fiction and fantasy author"]}, {"page": "Carl McCoy", "response": ["McCoy owns a graphics company, Sheerfaith, which has supplied art and design for all of his musical projects. Sheerfaith has also produced artwork for other projects, such as for the Storm Constantine book Hermetech and Andrew Collins' 21st Century Grail. He is a 3D artist, a longtime user of LightWave 3D."]}, {"page": "Stafford", "response": ["*Storm Constantine (1956–2021) British science fiction and fantasy author primarily known for her Wraeththu seriesInternet Speculative Fiction Database, Storm Constantine  Retrieved 27 January 2018."]}, {"page": "Monstrous Regiment", "response": ["*The Monstrous Regiment, a 1990 science fiction novel by Storm Constantine"]}, {"page": "Grigori Trilogy", "response": ["The Grigori Trilogy is a series of three gothic horror novels by British author Storm Constantine. The series tells the story of the Grigori, a race of fallen angels who are being rewoken in preparation for the new millennium, and their children by human women, the Nephilim.", "Category:Novels by Storm Constantine"]}, {"page": "Dragon Con", "response": ["As of 2008, Dragon Con was a four-day event comprising approximately 3500 hours of panels, seminars, demonstrations, and workshops, with over 30 specialized programming tracks that include writing, alternate history, art, anime, gaming, science fiction and fantasy literature, comic books, costuming, space, science, online media, independent film, podcasting, Asian cinema and culture, robotics, filk, scientific skepticism, Star Trek, Star Wars, Military Scifi Media, X-Files, apocalyptic themes, Anne McCaffrey's Pern, Robert Jordan's Wheel of Time, J. R. R. Tolkien's The Lord of the Rings, British and American science fiction television, dark fantasy, the Dragon Con Independent Short Film Festival, and general programming which specific Guests of Honor attend (e.g., Clive Barker's Lost Souls and Storm Constantine's Grissecon)."]}, {"page": "Samyaza", "response": ["* Shemyaza appears in Storm Constantine's Grigori trilogy as the primary villain who finds redemption. He first appears as a Grigori pariah, Peverel Othman, who terrorizes the underground Grigori society by leaving a trail of highly public murders in his wake. He eventually redeems himself and consequently regains the memory of his previous incarnations. He goes on to fight an epic battle with the serpent Tiamat."]}, {"page": "Finncon", "response": ["| Bruce Sterling, Vonda McIntyre, Storm Constantine"]}, {"page": "Anne Sudworth", "response": ["Sudworth has produced a small number of covers for Storm Constantine and Gwyneth Jones, as well as a number of other authors and musicians, including Oliver Wakeman. She has appeared in a number of books on both art and Goth including Mick Mercer's Goth Rock Books.Hex Files: the goth bible by Mick Mercer  p.12221st Century Goth by Mick Mercer  p.174"]}, {"page": "Orb Books", "response": ["* Storm Constantine"]}, {"page": "Midnight Rose", "response": ["Midnight Rose was a name taken by a group of United Kingdom science fiction and fantasy writers for a series of shared world anthologies published by the Penguin Books imprint Roc. The group's \"core members\" were Alex Stewart, Roz Kaveney, Neil Gaiman and Mary Gentle. Contributors to individual anthologies included Marcus Rowland, Storm Constantine, Kim Newman, Charles Stross, Stephen Baxter, Colin Greenland, Graham Higgins, Paul Cornell and David Langford, among others."]}, {"page": "Telos Doctor Who novellas", "response": ["|Fallen Gods || Jon Blum and Kate Orman || Storm Constantine || Darryl Joyce || Eighth || None || August 2003"]}, {"page": "Meisha Merlin Publishing", "response": ["During its nine years of operation, Meisha Merlin built a large stable of fantasy and science fiction authors that included Kevin J. Anderson, Janny Wurts, Jack McDevitt, the late Robert Lynn Asprin, Robin Wayne Bailey, Storm Constantine, S. P. Somtow, Lee Killough, Phyllis Eisenstein, Allen Steele, Andre Norton, George R. R. Martin, Robert A. Heinlein, and many others. Its books were sold online and through national chain bookstores and independent booksellers throughout the United States, including Internet giant Amazon.com."]}, {"page": "New weird", "response": ["The New Weird is a literary genre that emerged in the 1990s through early 2000s with characteristics of weird fiction and other speculative fiction subgenres. M. John Harrison is credited with creating the term \"New Weird\" in the introduction to The Tain in 2002. The writers involved are mostly novelists who are considered to be part of the horror or speculative fiction genres but who often cross genre boundaries. Notable authors include K. J. Bishop, Paul Di Filippo, M. John Harrison, Jeffrey Ford, Storm Constantine, China Miéville, Alastair Reynolds, Justina Robson, Steph Swainston, Mary Gentle, Michael Cisco, and Jeff VanderMeer, among others."]}, {"page": "Jonathan Strahan", "response": ["In 1990 he co-founded Eidolon: The Journal of Australian Science Fiction and Fantasy, and worked on it as co-editor and co-publisher until 1999. He was also co-publisher of Eidolon Books which published Robin Pen's The Secret Life of Rubber-Suit Monsters, Howard Waldrop's Going Home Again, Storm Constantine's The Thorn Boy, and Terry Dowling's Blackwater Days."]}, {"page": "Fallen Gods (novella)", "response": ["Fallen Gods is an original novella written by Jonathan Blum and Kate Orman and based on the long-running British science fiction television series Doctor Who.  It features the Eighth Doctor. It was released both as a standard edition hardback and a deluxe edition () featuring a frontispiece by Daryl Joyce. Both editions have a foreword by Storm Constantine. It received the Aurealis Award for best Australian science fiction novel of 2004."]}, {"page": "Octocon", "response": ["| 1993|| Storm Constantine"]}, {"page": "Australian National Science Fiction Convention", "response": ["| Storm Constantine, Neil Gaiman"]}, {"page": "Novacon", "response": ["|Storm Constantine"]}, {"page": "Microcon", "response": ["* Microcon 9 (1989): David V. Barrett, Adrian Cole, Storm Constantine, Mary Gentle, Fox, Colin Greenland, John Grant, Dave Langford, Pete Loveday, Terry Pratchett, Fay Sampson, Ron Tiner, Diana Wynne Jones"]}, {"page": "List of apocalyptic and post-apocalyptic fiction", "response": ["|A series of novels set in a world created by Storm Constantine – humanity is replaced as the planet's dominant species by a race of mystic hermaphrodites. War and plague ravage the human population, but no single cause is specified."]}, {"page": "1956 in the United Kingdom", "response": ["* 2 January – Storm Constantine, science fiction and fantasy author"]}, {"page": "Lost Worlds (Smith short story collection)", "response": ["In the 2005 book Horror: Another 100 Best Books, the author Storm Constantine remarked that \"they come across as slightly camp now, but still with the power to captivate\". In the 1991 book The Science-Fantasy Publishers: A Critical and Bibliographic History, the authors Jack L. Chalker and Mark Owings noted \"superb stories\". The New York Times reviewer Marjorie Farber declared, \"What is most fascinating about the present volume is the sort of obfuscatory prose which readers of Weird Tales, etc. are apparently willing to overcome for the sake of getting at whatever terror may lie at the end of the skull-dotted trail,\" concluding that Lost Worlds \"cannot be read.\"\"Atlantis, Xiccarph\", New York Times Book Review, November 19, 1942, p.18. In the 1989 book The Arkham House Companion: Fifty Years of Arkham House, the author Sheldon Jaffery compared it with Out of Space and Time and decided \"the quality is slightly diminished\". Black Gates Robert Burke Richardson wrote, \"In Lost Worlds, the condition of an uncaring universe becomes not a case for despair, but rather for a weird and precious celebration.\""]}, {"page": "Vera Nazarian", "response": ["* \"Streets Running Like a River,\" Night's Nieces: The Legacy of Tanith Lee, edited by Storm Constantine, December 11, 2015."]}, {"page": "Leigh Blackmore", "response": ["He worked as a bookseller in Sydney for 25 years (1979–2004), primarily managing specialist science fiction & fantasy departments within larger bookstores such as Dymocks. Authors hosted by Blackmore for events and signings at Dymocks George St include Storm Constantine, Harlan Ellison, Richard Harland, Douglas Adams, Terry Pratchett, Bill Congreve, Simon Brown, Kyla Ward, Robert Hood, Cat Sparks, and Bryce J. Stevens."]}, {"page": "Pyr (publisher)", "response": ["* Storm Constantine"]}, {"page": "Single-gender world", "response": ["Ursula K. Le Guin's The Left Hand of Darkness (1969) depicts a world in which individuals are neither \"male\" nor \"female\" but at different times have either female or male sexual organs and reproductive abilities.Garber & Paleo 1983, \"Ursula K Le Guin: Biographical note\" p. 78. Similar patterns exist in Greg Egan's novel Schild's Ladder and his novella Oceanic or in Storm Constantine's book series Wraeththu about an oogamous magical race that arose from mutant human beings."]}, {"page": "Lambda Literary Award for Science Fiction, Fantasy and Horror", "response": ["| Storm Constantine"]}, {"page": "Sea Dragon Heir", "response": ["The Sea Dragon Heir is a fantasy novel written by Storm Constantine first published in 1999."]}, {"page": "Michael Moorcock bibliography", "response": ["*Silverheart (2000) (with Storm Constantine)"]}, {"page": "Rome Burns", "response": ["Frontman Simon Satori Hendley has written a number of books.  His first novel, Assumptions and Carnations was published in 2006 by Storm Constantine's publishing house Immanion Press.  His second book, Apathy: A Cause Not Worth Fighting For, was published in 2007 by Crombie Jardine Publishing Limited."]}, {"page": "Black Thorn, White Rose", "response": ["*Sweet Bruising Skin by Storm ConstantineStorm Constantine's Published Short Stories page "]}, {"page": "Constantine (name)", "response": ["*Storm Constantine, British science-fiction and fantasy author"]}, {"page": "Soft science fiction", "response": ["*  Storm Constantine, The Wraeththu Chronicles (1987) "]}]}}