{"wiki_id": "http://www.wikidata.org/entity/Q441899", "itemLabel": "Angela Cartwright", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Angela_Cartwright", "wikipedia_page": {"main": "Angela Margaret Cartwright (born September 9, 1952) is a British-American actress primarily known for her roles in movies and television. Cartwright became known in movies as a child actress for her role as Brigitta von Trapp in the film The Sound of Music (1965). On television, she played Linda Williams, the stepdaughter of Danny Williams (played by Danny Thomas) in the 1950s TV series The Danny Thomas Show, and Penny Robinson in the 1960s television series Lost in Space. Her older sister is actress Veronica Cartwright.", "link_mentions": [{"page": "Bill Mumy", "response": ["On June 14, 2006, Mumy got to work with Harris one last time, though posthumously. Years before Harris died, he recorded voice work for the animated short The Bolt Who Screwed Christmas, narrating the film and playing the part of The Bolt. As a tribute to Harris, writer-director John Wardlaw added a scene that reunited Lost in Space cast members Mumy, Marta Kristen, and Angela Cartwright as the animated Ratchett family..", "Mumy attends Lost in Space reunions and shows, and co-authored a 2015 book, Lost (and Found) in Space with Angela Cartwright.King, Susan (September 14, 2015). \"Warning! Warning! 50th anniversary 'Lost in Space' Blu-ray and book approaching!\". Los Angeles Times.", "Mumy and Angela Cartwright co-authored the 2021 book, Lost (and Found) in Space 2: Blast Off into the Expanded Edition."]}, {"page": "September 9", "response": ["*1952 – Angela Cartwright, English-born American actress, author, and singer"]}, {"page": "1952", "response": ["* September 9 – Angela Cartwright, British-American child actress, photographer and painter (Lost in Space)"]}, {"page": "Lost in Space", "response": ["The Robinson family consists of Professor John Robinson (Guy Williams), his wife Maureen (June Lockhart), and their three children: Judy (Marta Kristen); Penny (Angela Cartwright); and Will (Bill Mumy). The family is accompanied by U.S. Space Corps Major Donald West (Mark Goddard). The Robinsons and Major West are to be cryogenically frozen for the voyage, and they are set to be unfrozen when the spacecraft approaches its destination.", "* Penny Robinson (Angela Cartwright) – The middle child. An imaginative 11-year-old who loves animals and classical music. Early in the series, she acquires a chimpanzee-like alien pet which she names Debbie (in spite of the characters' use of masculine pronouns when referring to it) and which is usually referred to as the \"bloop\" for the sound it makes.", "| Angela Cartwright", "* Angela Cartwright and Marta Kristen also briefly appear early in the film as news reporters."]}, {"page": "Barry Gibb", "response": ["At the end of 1967, fame was taking its toll and the group were at odds with each other. At the start of 1968, the Gibbs were vying for influence in determining the musical direction of the group, creating tension in the studio and on stage. Also in 1968, to promote Horizontal the group made their first appearance on U.S. television on The Smothers Brothers Show as well as The Ed Sullivan Show. The group later filmed a TV special Frankie Howerd Meets the Bee Gees with Frankie Howerd. His 1968 composition \"Only One Woman\" (UK No. 5) was the Marbles' most successful single up to date. The Bee Gees were invited by Hollywood manager Lee Hazlewood at his party alongside the members of the Monkees and Honey Ltd.. The photos from that event were leaked, and two of the pictures showing Gibb was talking to actress Angela Cartwright, and the other, is Gibb who was shown playing guitar and the members of Honey Ltd. sing along."]}, {"page": "1998 in film", "response": ["| Lost in Space || New Line Cinema || Stephen Hopkins (director); Akiva Goldsman (screenplay); William Hurt, Mimi Rogers, Heather Graham, Lacey Chabert, Jack Johnson, Jared Harris, Matt LeBlanc, Gary Oldman, Dick Tufeld, Lennie James, Mark Goddard, June Lockhart, Marta Kristen, Angela Cartwright, Edward Fox, Gary A. Hecker || Sci-Fi, Adventure || Live action"]}, {"page": "1952 in television", "response": ["| Angela Cartwright"]}, {"page": "1979 in film", "response": ["| Beyond the Poseidon Adventure || Warner Bros. || Irwin Allen (director); Nelson Gidding (screenplay); Michael Caine, Sally Field, Telly Savalas, Peter Boyle, Jack Warden, Shirley Knight, Slim Pickens, Angela Cartwright, Mark Harmon, Shirley Jones, Karl Malden, Veronica Hamel, Paul Picerni, Patrick Culliton, Dean Raphael Ferrandini || Action, Adventure, Disaster || Live Action"]}, {"page": "Altrincham", "response": ["The artist Helen Allingham, born in 1848, lived in Altrincham and then Bowdon during her childhood years. Abstract artist Jeremy Moon was born in Altrincham in 1934. The composer and music teacher John Ireland was born in Bowdon in 1879. Alison Uttley wrote the Little Grey Rabbit books while living in Bowdon. Dramatist Ronald Gow lived there in his youth and later taught at Altrincham Grammar School for Boys. The town was also the birthplace of the film and television actress Angela Cartwright. Ian Brown and John Squire of The Stone Roses both attended Altrincham Grammar School for Boys, and Paul Young of Sad Café and Mike and the Mechanics lived in Altrincham until his death in 2000."]}, {"page": "Danny Thomas", "response": ["Thomas enjoyed a successful 11-year run (1953–1964) on Make Room for Daddy, later known as The Danny Thomas Show. Jean Hagen, Sherry Jackson, and Rusty Hamer were his first family. The Hagen character died offscreen in 1956 and was replaced by Marjorie Lord; Angela Cartwright also joined the cast at this time playing Danny's stepdaughter. Sherry Jackson left the series in 1958, and Penny Parker replaced her in the 1959–1960 season. Parker was written out of the series with her marriage to the character Patrick Hannigan, played by comedian Pat Harrington, Jr.", "On January 1, 1959, Thomas appeared with his other Make Room for Daddy child stars, Angela Cartwright and Rusty Hamer, in an episode of NBC's The Ford Show, Starring Tennessee Ernie Ford.", "Angela Cartwright (who spoke about her on- and off-camera relationship with her television stepfather, Danny Thomas, on a groundbreaking ABC TV show, Make Room for Daddy) had said: \"I thought Danny was hilarious and he was always cracking me up. He was loud and gregarious, nothing like my real dad who is far more reserved than that. So, it was fun to be able to make smart remarks and get away with it. I would never have talked to my real parents that way, but in the make-believe world of the Williams family I got away with that.\" Cartwright also added that by the time Thomas's show had ended, she wanted to join the cast of The Sound of Music: \"I went on an interview for the part of Brigitta. I was still filming The Danny Thomas Show, but I knew the series was coming to an end. After several auditions, I was the first von Trapp cast. I asked Danny Thomas if he would let me out of my contract so I could be in the movie and he was very gracious to let me out of the last show of the season. He didn't have to do that and I am very grateful he did.\"", "In the early 1970s, Thomas reunited most of his second Daddy cast (Marjorie Lord, Rusty Hamer, and Angela Cartwright) for a short-lived update of the show, Make Room for Granddaddy. Premised around Danny and Kathy Williams caring for their grandson by daughter Terry, who was away with her husband who was serving in the Military, and stationed in Japan, the show lasted one season."]}, {"page": "List of sibling pairs", "response": ["* Veronica and Angela Cartwright; actresses "]}, {"page": "The Danny Thomas Show", "response": ["The Danny Thomas Show made its CBS debut on Monday, October 7, 1957, at 9:00 inheriting the time slot vacated by I Love Lucy. The fifth-season premiere episode, \"Lose Me In Las Vegas\", had Danny and Kathy already married and on their honeymoon. The Williams family moved into a larger brand-new apartment and, with the change of network, the producers also changed Kathy's daughter. Lelani Sorenson was dropped from the cast and replaced by Angela Cartwright as Linda. Linda then was adopted by Danny, and the show's ratings dramatically increased.ClassicTVHits.com TV Ratings: 1957-1958 At the end of its fifth season, The Danny Thomas Show posted its highest rating, ranking at No. 2. During this season, Amanda Randolph was sick and rarely appeared as Louise, who was said to be recovering from the flu, with Kathy doing most of the housework.", "* Angela Cartwright as Linda Williams (1957–1964)", "The show ended in 1964, but Danny Thomas, Marjorie Lord, Angela Cartwright, Rusty Hamer, Sherry Jackson, Amanda Randolph and Hans Conried returned in 1965 for a two-hour-long \"reunion\" special on NBC, The Danny Thomas TV Family Reunion, considered the first TV reunion show, and Make More Room for Daddy, which aired as an episode of The Danny Thomas Hour in November 1967. Shortly after filming the second special in 1967, Randolph died suddenly of a stroke at the age of 70. A CBS reunion special, Make Room for Granddaddy, was aired in 1969. The special did so well that it was picked up as a series by CBS, but Thomas considered its assigned time slot to be too quiet and pulled the show."]}, {"page": "Lost in Space (film)", "response": ["* Angela Cartwright as Reporter #2"]}, {"page": "Guy Williams (actor)", "response": ["In 1983, Williams returned to Los Angeles for two final television appearances. He joined Lost in Space cast members June Lockhart, Angela Cartwright, Bob May and Marta Kristen for two celebrity episodes of Family Feud against the casts of Batman and Gilligan's Island respectively. He later appeared as a guest on Good Morning America."]}, {"page": "Jerry Mathers", "response": ["As he moved into his teenage years, Mathers retired from acting to concentrate on high school. He attended Notre Dame High School in Sherman Oaks, California. During this time he led a musical band called Beaver and the Trappers. While he was still in high school, Mathers joined the United States Air Force Reserve in 1966. Wearing his dress uniform, Mathers, along with child actress Angela Cartwright, presented an Emmy award to Gene Kelly in 1967. After graduating from high school in 1967, Mathers continued to serve in the Reserve and made the rank of Sergeant. In December 1969, a rumor began that Mathers was killed in action in the Vietnam War. Although the origin of the rumor is unclear,Jerry Mathers discusses the urban myth of his \"death in Vietnam\" Emmy TV Legends video (posted 2010) Mathers never saw action and was never stationed outside the United States. Years later, in 1980, Mathers and Dow appeared with Bill Murray on Saturday Night Live's Weekend Update segment, making fun of the Vietnam War death rumor."]}, {"page": "The Dating Game", "response": ["*Angela Cartwright (1970)"]}, {"page": "Jonathan Harris", "response": ["As a tribute to Harris, writer/director John Wardlaw wrote an additional scene for the film The Bolt Who Screwed Christmas, which included Harris's final performance before his death. Wardlaw asked Lost in Space co-stars Bill Mumy, Angela Cartwright, and Marta Kristen to contribute their voices to the film. The three actors reunited in the recording studio on June 14, 2006. \"This was the first time they had all been together in something unrelated to Lost in Space and it was a blast. They listened to what Harris had recorded and there were laughs and some tears,\" Wardlaw stated."]}, {"page": "Somebody Up There Likes Me (1956 film)", "response": ["The film was also notable for being one of Paul Newman's first starring roles and for being one of the first films in which Steve McQueen appeared.  It also marked the film debuts of Frank Campanella, Robert Loggia, Angela Cartwright, and Dean Jones, all in uncredited bit parts."]}, {"page": "Yūko Mizutani", "response": ["*Beyond the Poseidon Adventure – Theresa Mazzetti (Angela Cartwright)"]}, {"page": "Jay North", "response": ["In 1980, North appeared in a cameo role in the television movie Scout's Honor, which featured appearances of other former child stars Angela Cartwright from The Danny Thomas Show, Lauren Chapin from Father Knows Best, and Paul Petersen from The Donna Reed Show.  In 1982, he landed a week-long stint on the daytime soap General Hospital, but steady work in show business continued to elude him.  Financially secure from real estate investments his mother had made with his earnings from Dennis The Menace and frustrated by the direction his career had taken, North retreated from public life for the next several years and found work in the health food industry.  In 1984, he optioned the book Burn Judy, Burn for $5,000, hoping to play the lead role of executed killer Steven Judy.  In his 1999 interview with E!, North spoke of his desire to play darker roles: \"I was ready to play very dramatic, scary type characters.  I thought maybe if I played some villains and scared the pants off of people, maybe Hollywood might take me seriously.\"  However, the Steven Judy story never made it to the screen."]}, {"page": "Irwin Allen", "response": ["In 1994, while senior VP of Foxstar, Burns founded Van Ness Films, a nonfiction and documentary production unit. That same year, he met Jon Jashni, a Fox film executive who shared Burns' interest in Allen's works. In 1998, the two collaborated on a TV retrospective special, Lost in Space Forever. Hosted by John Laroquette, it chronicled the series' creation and run on TV in the 1960s and beyond, and featured appearances by Bill Mumy, Jonathan Harris, June Lockhart, Angela Cartwright, Mark Goddard, and Marta Kristen, as well as film footage of vintage interviews with Guy Williams. Also appearing were Bob May, who donned the robot suit, and Dick Tufeld, who supplied the character's voice. The flight deck set of the Jupiter 2 spacecraft from the series was recreated as the backdrop for parts of the special."]}, {"page": "Sherry Jackson", "response": ["Over the next few years, Jackson broadened her range of acting roles by guest starring in dozens of television series, appearing as a hit woman on 77 Sunset Strip, a freed Apache captive who yearns to return to the reservation on The Tall Man, an alcoholic on Mr. Novak, a woman accused of murder on Perry Mason, and an unstable mother-to-be on Wagon Train. Sherry also appeared as a first season guest on The Rifleman episode “The Sister” playing the part of a horse riding sibling of two doting brothers. She played a gunslinger's promiscuous young bride in the Western series Maverick episode entitled \"Red Dog\" with Roger Moore, Lee Van Cleef and John Carradine. After a 1965 appearance on Gomer Pyle, U.S.M.C., she then made guest appearances on Lost in Space (\"The Space Croppers\", reuniting with her Danny Thomas co-star, Angela Cartwright), My Three Sons, Gunsmoke, Rawhide, The Wild Wild West (\"The Night of the Vicious Valentine\" and \"The Night of the Gruesome Games\", as two different characters), Batman, and the original Star Trek series. On the latter program, she made one of her more memorable portrayals as the android Andrea in the episode \"What Are Little Girls Made Of?\"."]}, {"page": "Babes in Toyland (operetta)", "response": ["A 1960 adaptation for television featured Shirley Temple as the old gypsy Floretta, Angela Cartwright as Jane, and Jonathan Winters as Barnaby. It was shown as an episode on the anthology series The Shirley Temple Show.\"Shirley Temple Theatre: Babes in Toyland\". IMDB.com, accessed June 8, 2011 It is the only screen or television version that retained the operetta's primary plot (the orphans' escape from their cruel uncle), but it omits the secondary plot involving the nursery-rhyme characters. Barnaby and the Toymaker survive at the end, although Barnaby (who is more a comic villain than the dangerous original character) is punished by the law. The Toymaker is portrayed as a kindly old man, and Floretta ends up helping the children and turning against Barnaby."]}, {"page": "Veronica Cartwright", "response": ["Cartwright was born in Bristol and grew up in Los Angeles, having emigrated to the US shortly after the birth of her younger sister, actress Angela Cartwright. In 1958, her career as a child actress began with a role in In Love and War. Among her early appearances were repeated roles in the television series Leave It to Beaver (as Beaver's classmates Violet Rutherford and, later, Peggy MacIntosh) and episodes of One Step Beyond \"The Haunting\" (1960) and The Twilight Zone \"I Sing the Body Electric\" (1962). In 1963, she guest starred twice in NBC's medical drama about psychiatry, The Eleventh Hour, in the episodes \"The Silence of Good Men\" and \"My Name is Judith, I'm Lost, You See\". Cartwright appeared in the films The Children's Hour (1961) and Alfred Hitchcock's The Birds (1963), which were both highly successful. In The Birds, she was cast along with her television father from Leave It to Beaver, Richard Deacon, although the two were not on screen together. She played daughter Jemima Boone in the first two seasons of NBC's Daniel Boone from 1964 until 1966, with co-stars Fess Parker, Patricia Blair, Darby Hinton, Ed Ames and Dallas McKennon. She won a regional Emmy Award for the television movie Tell Me Not in Mournful Numbers (1964).ClassicFilmTVCafe.com interview, February 2014"]}, {"page": "Marta Kristen", "response": ["Reflecting her Scandinavian heritage, she adopted the more European-sounding \"Marta\" and used Marta Kristen as her stage name. She first appeared in a 1961 episode of Alfred Hitchcock Presents, \"Bang! You're Dead\", alongside Billy Mumy, who later co-starred with Kristen in Lost in Space.  Her first successful film role was that of Lorelei in the 1965 movie Beach Blanket Bingo. She later starred in Lost in Space and made numerous guest appearances on television shows. When her daughter was born in 1969, she began making television commercials and eventually appeared in more than 40. She also made the occasional film appearance in movies such as Terminal Island (1973), Once in 1974, appearing as a bare breasted 'Humanity', and the science-fiction film Battle Beyond the Stars (1980); and had a cameo role in the 1998 movie Lost in Space. She also appeared in the A&E biography Jonathan Harris, Never Fear, Smith Is Here in 2002. Kristen also provided voice work for the 2009 animated theatrical short \"The Bolt Who Screwed Christmas\" which also included voice work from her Lost in Space co-stars Harris, Mumy, and Angela Cartwright."]}, {"page": "MegaCon", "response": ["| March 5–7, 2004 || Kaare Andrews, Brian Michael Bendis, John Cassaday, Amanda Conner, Phil Jimenez, Andy Lee, Tony Lorenz, David W. Mack, James O'Barr, Jimmy Palmiotti, Walter Simonson, Craig Thompson, Skottie Young, Luis Amado, Tony Bedard, Jose Caraballo, Patrick Carlucci, Jim Cheung, Laura DePuy, Chuck Dixon, Steve Epting, Glenda Finkelstein, Jeff Johnson, Greg Land, Ron Marz, Stanley Morrison, Mike Perkins, Brandon Peterson, Justin Ponsor, Ariel Rivero, Tone Rodriguez, Steven Sanchez, Bart Sears, Josh Sullivan, Kevin Smith, Jason Mewes, Allison Mack, Walter Koenig, Ken Foree, Brad Dourif, Noah Hathaway, Herbert Jefferson, Jr., Brian Thompson, Glenn Shadix, Marc Singer, Angela Cartwright, Bill Mumy, Virginia Hey, and Sid Haig ||  || "]}, {"page": "2004 in comics", "response": ["* March 5–7: MegaCon (Orange County Convention Center, Orlando, Florida) — guests include Kaare Andrews, Brian Michael Bendis, John Cassaday, Amanda Conner, Phil Jimenez, Andy Lee, Tony Lorenz, David W. Mack, James O'Barr, Jimmy Palmiotti, Walter Simonson, Craig Thompson, Skottie Young, Luis Amado, Tony Bedard, Jose Caraballo, Patrick Carlucci, Jim Cheung, Laura DePuy, Chuck Dixon, Steve Epting, Glenda Finkelstein, Jeff Johnson, Greg Land, Ron Marz, Stanley Morrison, Mike Perkins, Brandon Peterson, Justin Ponsor, Ariel Rivero, Tone Rodriguez, Steven Sanchez, Bart Sears, Josh Sullivan, Kevin Smith, Jason Mewes, Allison Mack, Walter Koenig, Ken Foree, Brad Dourif, Noah Hathaway, Herbert Jefferson, Jr., Brian Thompson, Glenn Shadix, Marc Singer, Angela Cartwright, Bill Mumy, Virginia Hey, and Sid Haig"]}, {"page": "Linda Harrison", "response": ["In 1990, Harrison moved back home to Berlin, where she opened a consignment shop which she named \"Harrison's Peach Tree\" half a mile from the house where she was born and raised. Several years later, wanting to be closer to her sons, she returned to Los Angeles and obtained a real estate license, like her eldest sister, Kay. In 1995, she landed a small part as the \"Madam\" in Wild Bill. In 1998, she appeared as herself in the Kevin Burns TV documentary Behind the Planet of the Apes about the making of the first five Planet of the Apes films. In October 1998, Harrison attended her first science fiction convention in New Jersey. Also in attendance were Jonathan Harris, Marta Kristen, Mark Goddard and Angela Cartwright, of the original Lost in Space TV series; Lou Ferrigno of The Incredible Hulk TV series; and Bela Lugosi Jr. and Sara Karloff. Harrison found it \"rewarding when you really haven't done anything for a number of years and then, all of a sudden, people want your autograph. It was very gratifying.\" Eventually, Harrison became an institution at Planet of the Apes cons. \"I like it. It's very good. You're being appreciated for your work.\" In 2001, she had a cameo as the \"Woman in Cart\" in Tim Burton's remake of Planet of the Apes. \"They are much more brutal in the new movie,\" she said. \"And strong. They literally hurl the humans 50 or 60 feet.\"Secrets Behind the New Planet of the Apes, The Forbidden Zone, May–June 2001 Most of the footage Harrison shot was omitted from the final, so \"if you blink you miss me. They showed my shots all over the place, but it got cut out.\""]}, {"page": "Beyond the Poseidon Adventure", "response": ["They are soon followed by Dr. Stefan Svevo (Telly Savalas) and his crew, who claim to be Greek Orthodox medics who received the ship's SOS. They board the doomed vessel through the bottom hull opening left by the French rescue team, then become trapped after the entrance collapses. The group with Turner encounters the ship's nurse, Gina Rowe (Shirley Jones) and two passengers, elegantly dressed Suzanne Constantine (Veronica Hamel) and war veteran Frank Mazzetti (Peter Boyle), who is searching for his missing daughter Theresa (Angela Cartwright). Theresa is found, as are elevator operator Larry Simpson (Mark Harmon) and a \"billionaire\" called \"Tex\" (Slim Pickens) who clings to a valuable bottle of wine. Later they also find the blind Harold Meredith (Jack Warden) and his wife Hannah (Shirley Knight), who were waiting to be rescued.", "* Angela Cartwright as Theresa Mazzetti"]}, {"page": "Rusty Hamer", "response": ["In October 1981, Hamer reunited with former co-stars Danny Thomas and Angela Cartwright. The reunion was televised as part of the ABC special What Became Of...?, that aired on October 25."]}, {"page": "Crista Flanagan", "response": ["* Angela Cartwright"]}, {"page": "The Sound of Music (film)", "response": ["* Angela Cartwright as Brigitta von Trapp"]}, {"page": "The Danny Thomas Hour", "response": ["* Angela Cartwright", "8) \"Make More Room For Daddy\" {videotape} (November 6, 1967) featuring Marjorie Lord, Rusty Hamer, Angela Cartwright, Sid Melton, Amanda Randolph, Hans Conried, Jana Taylor, Edward Andrews"]}, {"page": "Kym Karath", "response": ["Kym Karath was born in Los Angeles, California, and started her career at the age of 4, when she appeared in Spencer's Mountain (1963) with Henry Fonda and Veronica Cartwright (she subsequently worked with Veronica's younger sister, Angela Cartwright, in The Sound of Music).  Also in 1963, Karath was seen in The Thrill of It All with Doris Day and James Garner.  In 1964, she was seen in  Good Neighbor Sam with Jack Lemmon."]}, {"page": "High School U.S.A.", "response": ["* Angela Cartwright – Miss D'Angelo"]}, {"page": "Something of Value", "response": ["* Angela Cartwright as Caroline"]}, {"page": "List of American film actresses", "response": ["*Angela Cartwright born  (English-born)"]}, {"page": "Richard Compton", "response": ["Compton was the husband of actress Veronica Cartwright and the brother-in-law of actress Angela Cartwright."]}, {"page": "Angela (given name)", "response": ["* Angela Cartwright (born 1952), English-born American actress "]}, {"page": "St. Charles Borromeo Church (North Hollywood)", "response": ["Other celebrities who have been members at St. Charles include Ann Blyth (\"Mildred Pierce\") actor Eric Estrada (Ponch on TV's CHiPS), Jeopardy! quizmaster Alex Trebek, Frankie Avalon, Bob Gunton (Warden Norton in The Shawshank Redemption), Los Angeles district attorney Steve Cooley, actresses Angela Cartwright and Veronica Cartwright and KABC news anchors Laura Diaz and Harold Greene. Also a member was Austrian-American producer and singer Elfi von Dassanowsky, whose memorial service was held at the church on October 9, 2007, with many representatives of the Austrian community in Los Angeles attending."]}, {"page": "List of action films of the 1970s", "response": ["|Beyond the Poseidon Adventure||Irwin Allen||Michael Caine, Karl Malden, Sally Field, Telly Savalas, Paul Picerni, Patrick Culliton, Dean Raphael Ferrandini, Peter Boyle, Angela Cartwright, Jack Warden, Shirley Knight, Veronica Hamel, Shirley Jones, Slim Pickens, Mark Harmon||United States||"]}, {"page": "Cartwright (surname)", "response": ["* Angela Cartwright (born 1952), British-born American actress"]}, {"page": "Gallifrey One", "response": ["|colspan=\"3\"|Colin Baker, Caroline John, Eric Roberts, Steven Moffat, Terry Molloy, Maggie Stables, John Levene, Geoffrey Beevers, Bill Mumy, Angela Cartwright, Richard Chaves, France Nuyen, Carol Lynley"]}, {"page": "Lad, A Dog", "response": ["In the 1960s, Warner Brothers purchased the film rights for the novel from Max J. Rosenberg, of Vanguard Productions, who had purchased them from E. P. Dutton. They later negotiated with Anice Terhune for the rights to the two follow up novels, hoping to produce a sequel and television series if the first film proved successful. Starring Peter Breck, Peggy McCay, Carroll O'Connor, and Angela Cartwright, the film blended several of the novel's stories with some modifications to make a flowing narrative. Aram Avakian was initially selected to be the film's director, but his refusal to create a sentimental dog story resulted in his firing; he was replaced by Leslie H. Martinson. The film was released on June 6, 1962. Although it was praised by fans and modern reviewers, contemporary critiques felt Terhune's work did not translate well to film and it was considered a low budget B-movie."]}, {"page": "Lad, A Dog (film)", "response": ["Lad: A Dog is a 1962 American drama film based on the 1919 novel of the same name written by Albert Payson Terhune. Starring Peter Breck, Peggy McCay, Carroll O'Connor, and Angela Cartwright, the film blends several of the short stories featured in the novel, with the heroic Lad winning a rigged dog show, saving a handicapped girl from a snake, and capturing a poacher who killed his pups and injured one of his owners. Warner Brothers purchased the film rights for the novel from Vanguard Productions, and acquired the film rights for the other two Lad novels from the late Terhune's wife.", "Purebred rough collie Lad and his owners, Stephen (Peter Breck) and Elizabeth Tremayne (Peggy McCay), are visited by their wealthy neighbor Hamilcar Q. Glure (Carroll O'Connor) and his 8-year-old daughter Angela (Angela Cartwright), who is crippled from polio. While Lad befriends the girl, Glure invites the Tremaynes to show the prize-winning Lad at his upcoming dog show. However, Glure is jealous of Lad's success and has rigged one event to have such specialized rules that he believes only his recently purchased high-priced, English-trained collie can win. During the competition, which involves directing the dogs through a tricky set of a maneuvers, Lad is able to complete the course, while Glure's champion does not recognize the hand signals Glure makes while holding a cigar.", "Warner Brothers initially hired Aram Avakian, a \"talented, aggressive young ex-film editor\" known for his avant-garde tendencies, to direct the film. The studio wanted a sentimental dog story that played true to the novel, which Avakian opposed. In a 1969 Life interview, Avakian stated that he \"wanted to make a kind of pop, camp thing that wouldn't be a complete ordeal for parents\" while everyone else involved in the production wanted \"Dick, Jane and Doggie\". Jack Warner, then head of the studio, eventually fired him, bringing the more conventional Leslie H. Martinson to complete the film. Peter Breck and Peggy McCay were cast as Lad's owners, renamed to Stephen and Elizabeth Tremayne. Veteran actor Carroll O'Connor was hired to play the pompous and newly wealthy Hamilcar Q. Glure, with the role of his daughter played by Angela Cartwright, a noted young actress who had starred in The Danny Thomas Show. To cast the role of Lad, a talent search was conducted, eventually resulting in the selection of a collie from the San Fernando Valley who was credited simply as \"Lad\". The film is set in a modified version of the Place, with Pompton Lake reduced to a river with a large dock. The house, though similar to the real Terhune home, even including duplicates of the stone lions on the veranda, was built on a scale three times larger than the original."]}]}}