{"wiki_id": "http://www.wikidata.org/entity/Q441078", "itemLabel": "Charlotte Riley", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlotte_Riley", "wikipedia_page": {"main": "Charlotte Frances Riley (born 29 December 1981) is an English actress. She is known for her roles as Sarah Hurst in Easy Virtue (2008) and as Catherine Earnshaw in ITV's adaptation of Wuthering Heights (2009).", "link_mentions": [{"page": "Wuthering Heights", "response": ["More recent film or TV adaptations include ITV's 2009 two-part drama series starring Tom Hardy, Charlotte Riley, Sarah Lancashire, and Andrew Lincoln, and the 2011 film starring Kaya Scodelario and James Howson and directed by Andrea Arnold."]}, {"page": "Cynthia Nixon", "response": ["In 2012, Nixon also starred as Petranilla in the TV miniseries of Ken Follett's World Without End broadcast on the ReelzChannel, alongside Ben Chaplin, Peter Firth, Charlotte Riley, and Miranda Richardson."]}, {"page": "St Cuthbert's Society, Durham", "response": ["*Charlotte Riley, actress"]}, {"page": "Saturn Award for Best Actress on Television", "response": ["| Charlotte Riley"]}, {"page": "Thérèse Raquin", "response": ["* Thérèse Raquin (2009), BBC Radio 4 \"Classic Serial\" adaptation in two parts starring Charlotte Riley as Thérèse and Andrew Buchan as Laurent"]}, {"page": "Tom Hardy", "response": ["In 2010, Hardy became an ambassador for the Prince's Trust, a UK youth charity which provides training, personal development, business start-up support, mentoring, and advice. In 2012, he and then-girlfriend actress Charlotte Riley became patrons of Bowel Cancer UK. Prior to the inaugural Invictus Games held in London in September 2014, he, along with other entertainers and athletes, read the poem \"Invictus\" in a promotional video.", "Hardy was married to producer Sarah Ward from 1999 until they divorced in 2004. He met assistant director Rachael Speed on the set of The Virgin Queen in 2005, and they had a son in April 2008 before separating in 2009. That year, Hardy began a relationship with actress Charlotte Riley after they met on the set of Wuthering Heights. They were married in July 2014. They have two children; the first was born in October 2015 and the second in December 2018. They had two rescue dogs, Max and Woodstock, and Hardy appeared with Woodstock in a PETA advert to promote pet adoption.Rebecca Macatee, \"Tom Hardy Gets a Kiss From His Dog Woodstock in Pro-Adoption Campaign for PETA—See the Pic!\" EOnline.com, 28 April 2015. Woodstock died on 5 June 2017 due to an aggressive case of polymyositis."]}, {"page": "Ben Chaplin", "response": ["In 2017, he appeared in the premiere production of Consent at the Royal National Theatre, London. Chaplin starred in the Joe Penhall play Mood Music at The Old Vic Theatre. He starred in The Children Act (2017), adapted from the Ian McEwan novel of the same name. He starred in the BBC series Press with Charlotte Riley, as unethical tabloid editor Duncan Allen, a role which won him a number of positive reviews."]}, {"page": "Chris Lang", "response": ["In the UK, shooting began in March 2018 on a new six-part drama called Dark Heart, which Lang created, and which starred Tom Riley, Charlotte Riley, Anjili Mohindra and Miranda Raison. It broadcast in October 2018, with the 1st episode attracting an audience of 6.3 million."]}, {"page": "List of Durham University people", "response": ["* Charlotte Riley (Cuths) – actress"]}, {"page": "Ghost of Christmas Present", "response": ["*Charlotte Riley in A Christmas Carol (2019)"]}, {"page": "Branko Tomović", "response": ["He also stars opposite Debbie Harry in Jimmy Cauty's Road movie Believe the Magic and Steve Stone's ghost thriller Entity with Dervla Kirwan and Charlotte Riley. Entity won two awards at the London Independent Film Festival 2013 and Best Film at the British Horror Film Festival where Branko was also nominated for Best Actor. The British Filmmakers Alliance honoured him as Best International Actor for his role and he was also chosen as a Rising Star by Icon Magazine."]}, {"page": "Screen International", "response": ["* Charlotte Riley"]}, {"page": "World Without End (Follett novel)", "response": ["A television miniseries based on the novel aired worldwide in 2012. It premiered on Showcase in Canada on 4 September 2012; in the United States on Reelz Channel on 17 October 2012; on Channel 4 in the UK on 22 December, and on Star Movies in the Philippines in January 2013. The eight-part television event miniseries stars Cynthia Nixon, Miranda Richardson, Peter Firth, Ben Chaplin, Charlotte Riley, Sarah Gadon and Tom Weston-Jones. It was directed by Michael Caton-Jones who also directed the historical epic Rob Roy.", "*Caris: The feisty daughter of Edmund Wooler – the Alderman of the parish guild, and a direct descendant of Tom Builder - Caris is one of the two main characters in the novel with Merthin, whom she loves truly and exclusively throughout her whole life. Since childhood she wants to be a doctor, though only men may be physicians. A determined and bright woman, she refuses to marry to keep her independence, although she and Merthin love each other deeply. Her rising influence in the town and her bid to free the merchants from the control of the priory brings her into conflict with the church, resulting in her being tried for witchcraft. She escapes the death sentence by entering the priory as a nun, thanks to the Prioress, Mother Cecilia. In charge of the hospital, she uses common sense and observation, and opposes the formerly undisputed authority of the monk - physicians. During the outbreaks of plague, Caris enforces hygiene practices to inhibit its spread and writes a catalogue of cures and good practices to avoid the spreading of contagious illnesses, which becomes coveted by pharmacists throughout England. She's elected Prioress of Kingsbridge after the death of Mother Cecilia and is promoted acting Prior when all the monks flee Kingsbridge for fear of the plague. She then renounces her vows, manages to run independently a new hospital and marries Merthin, who's by then the Alderman of the guild. After she successfully fights the plague a second time, she becomes revered in the whole town. In the TV adaptation she is played by Charlotte Riley."]}, {"page": "Teesside High School", "response": ["* Charlotte Riley, actress"]}, {"page": "Riley (surname)", "response": ["*Charlotte Riley (born 1981), English actress"]}, {"page": "Adaptations of A Christmas Carol", "response": ["*A Christmas Carol (2019), a BBC drama (broadcast in the US on FX) written by Peaky Blinders creator Steven Knight, with Guy Pearce as Scrooge, Andy Serkis as the Ghost of Christmas Past, Charlotte Riley as Lottie/the Ghost of Christmas Present, Stephen Graham as Jacob Marley, Joe Alwyn as Bob Cratchit, Jason Flemyng as the Ghost of Christmas Future, and Vinette Robinson as Mary Cratchit. Thea Achillea, who played Scrooge's daughter in episode 2, went on to star in A Christmas Carol, alongside Serkis. In that version, Serkis voiced Marley's Ghost."]}, {"page": "Foyle's War (series 6)", "response": ["|colspan=\"6\"|Guests: Obi Abili, Adam James, Andrew Hawkins, Max Brown, Zoe Telford, Christopher Mellows, Sam Spruell, Neil McCaul, Nicholas Shaw, Trevor White, Victoria Lennox, Nicholas Gleaves, Joseph Long, Nick Dunning, Charlotte Riley, John Sharian"]}, {"page": "Easy Virtue (2008 film)", "response": ["* Charlotte Riley as Sarah Hurst"]}, {"page": "List of British actors", "response": ["* Charlotte Riley (born 1981)"]}, {"page": "Peter Harness", "response": ["In 2005, he adapted the M.R. James short story \"A View From A Hill\" for BBC4. It was the first in a new annual series of BBC Ghost Stories for Christmas. Harness went on to write several other single films for BBC4, including a biopic of Frankie Howerd, Rather You Than Me, starring David Walliams and Rafe Spall, which was part of the Curse of Comedy season, as well as the Spanish flu drama, The Forgotten Fallen, starring Bill Paterson, Mark Gatiss and Charlotte Riley, which dealt with the efforts of a medical team in Manchester to combat the disease in 1918."]}, {"page": "David Oakes", "response": ["| 2012 || World Without End || Bishop Henri || Michael Caton-Jones || Channel 4 || The sequel to The Pillars of the Earth. Oakes appears as a secret cameo alongside Charlotte Riley. Oakes was back in Budapest filming The Borgias, so the producers of World Without End thought it would be a fun nod to the original series."]}, {"page": "Wuthering Heights (2009 TV serial)", "response": ["Wuthering Heights is a 2009 two-part British ITV television series adaptation of the 1847 novel Wuthering Heights by Emily Brontë. The episodes were adapted for the screen by Peter Bowker and directed by Coky Giedroyc.Thomas, Liz – ITV1 looks upmarket with Wuthering Heights adaptation, The Stage (13 November 2006) The programme stars Tom Hardy and Charlotte Riley in the roles of the famous lovers Heathcliff and Catherine or 'Cathy' Earnshaw.", "*Charlotte Riley as Catherine Earnshaw – Daughter of Mr Earnshaw, Cathy at first resents Heathcliff's presence in her home but soon starts to bond with him. They eventually fall in love but their obsessive relationship is doomed from the outset. Her desire for social recognition leads her to marry Edgar Linton. From childhood to adulthood, Cathy and Heathcliff are inseparable; until she meets Edgar."]}, {"page": "List of American films of 2009", "response": ["| Easy Virtue || Sony Pictures Classics || Stephan Elliott (director/screenplay); Sheridan Jobbins (screenplay); Jessica Biel, Colin Firth, Kristin Scott Thomas, Ben Barnes, Kimberley Nixon, Katherine Parkinson, Kris Marshall, Christian Brassington, Charlotte Riley, Jim McManus, Pip Torrens, Georgie Glen, Stephan Elliott, Sheridan Jobbins"]}, {"page": "The Take (TV series)", "response": ["The Take is a four-part British television crime drama series, adapted by Neil Biswas from the novel by Martina Cole, that first broadcast on Sky1 on 17 June 2009. Directed by David Drury, The Take follows the activities of criminal sociopath Freddie Jackson (Tom Hardy), who has recently been released from prison, only to find that his cousin Jimmy (Shaun Evans) is attempting to make a name for himself on the back of his reputation. The series also stars Brian Cox, Kierston Wareing, Margot Leicester and Charlotte Riley among others.", "The series aired in the United States between 2 and 23 December 2009 on Encore. The first episode gathered 180,000 viewers, while the second attracted 152,000. The series was also released on Region 1 DVD on 28 August 2012, via BFS Entertainment. The series received critical acclaim for Hardy's portrayal of Freddie Jackson. Notably, Hardy and Charlotte Riley, who first met whilst working together on the series, later married.", "Bitter, resentful and increasingly unstable, Jackie sees her life crumble while her little sister Maggie's (Charlotte Riley) star rises. In love with Freddie's cousin Jimmy, Maggie is determined not to end up like her sister. Freddie and Jackie watch Jimmy and Maggie achieve all the dreams that they failed to realise: love, family, stability and respect. Resentment and an inability to control himself force Freddie to put the business and his family at risk. Torn between being loyal to a cousin he loves and being true to his own destiny, Jimmy is forced to decide between protecting Freddie or the life he has built with Maggie.", "* Charlotte Riley as Maggie Summers"]}, {"page": "Adaptations of Wuthering Heights", "response": ["* Wuthering Heights (2009), an ITV two-part series, first broadcast on PBS as part of its Masterpiece Classic programming and broadcast later in the year on ITV1 and STV, starring Tom Hardy as Heathcliff and Charlotte Riley as Catherine."]}, {"page": "The Priory (play)", "response": ["The Priory is a play by Michael Wynne that opened at the downstairs theatre of the Royal Court Theatre in London in 2009. The production starred Jessica Hynes, Rupert Penry-Jones, Charlotte Riley, Alastair Mackenzie, Joseph Millson and Rachael Stirling. After receiving good reviews, its run was extended.  Michael Wynne won the Olivier Award for 'Best New Comedy' for The Priory. Stirling was nominated for a Laurence Olivier Award for Best Performance in a Supporting Role for her role as Rebecca.", "The premiere of the play was at the Royal Court Theatre in London. It was directed by Jeremy Herrin and starred Jessica Hynes as Kate, Joseph Millson as Daniel, Rupert Penry-Jones as Carl, Rachael Stirling as Rebecca, Alastair Mackenzie as Ben and Charlotte Riley as Laura."]}, {"page": "Spanish Flu: The Forgotten Fallen", "response": ["Spanish Flu: The Forgotten Fallen is a 2009 television drama. It is a dramatization of Dr James Niven's attempts to deal with the 1918 flu pandemic in Manchester. It was written by Peter Harness and it starred Bill Paterson as Niven, along with Mark Gatiss, Kenneth Cranham and Charlotte Riley. It was first broadcast on BBC Four on 5 August 2009.", "* Charlotte Riley as Peggy Lytton"]}, {"page": "The Runaway (TV series)", "response": ["Principal shooting on the series took place in South Africa, which doubled up for 1960s Soho. Original music for the series was written by Chris Letcher, alongside Ben Bartlett. The Runaway was the second of Cole's novels to be adapted by Company Pictures for Sky, following on from The Take, starring Tom Hardy and Charlotte Riley, that first broadcast in 2009. The complete series of The Runaway was released on DVD via ITV Studios on 9 May 2011."]}, {"page": "World Without End (miniseries)", "response": ["World Without End is an eight-episode 2012 television miniseries based on the 2007 novel of the same name by Ken Follett. It is a sequel to the 2010 miniseries The Pillars of the Earth, also based on a Follett novel. World Without End is set 150 years after The Pillars of the Earth and chronicles the experiences of the English town of Kingsbridge during the start of the Hundred Years' War and the outbreak of the Black Death. The cast is led by Cynthia Nixon, Miranda Richardson, Ben Chaplin, Peter Firth, Charlotte Riley, and Tom Weston-Jones. The miniseries varies significantly from the novel in both the plot and characterizations.", "Set in England during the 14th century, the series chronicles the lives of ordinary citizens. Edward III leads the nation into the Hundred Years' War with France, while Europe faced the Black Death. Caris (Charlotte Riley), a visionary woman, and her lover Merthin (Tom Weston-Jones) build a community that stands up to the crown and the church.", "* Charlotte Riley as Caris Wooler"]}, {"page": "Edge of Tomorrow", "response": ["* Charlotte Riley as Nance"]}, {"page": "The Town (2012 TV series)", "response": ["The Town is a three-part British television drama series, created by playwright Mike Bartlett, that was first broadcast on ITV on 5 December 2012. The series, which stars Andrew Scott as Mark Nicholas, a young man who returns to his hometown of Renton following the death of both of his parents, was Bartlett's first project for television. The series also stars Martin Clunes as Len Robson, the mayor of Renton;Stephenson, David: \"Martin Clunes: Mayor of mystery in The Town\" Daily Express, 2 December 2012. Retrieved 11 March 2014 Julia McKenzie as Mark's estranged grandmother, Betty; Avigail Tlalim as Jodie, Mark's rebellious 15-year-old sister; and Charlotte Riley as Alice, Mark's first love.Wilson, Frances: \"The Town, ITV1, review\" The Daily Telegraph, 5 December 2012. Retrieved 11 March 2014", "* Charlotte Riley as Alice; Mark's first love. Mark's return troubles Alice, who eventually leaves her husband to be with him."]}]}}