{"wiki_id": "http://www.wikidata.org/entity/Q4413215", "itemLabel": "Onslow", "itemDescription": "character in Keeping Up Appearances", "wikipedia_url": "https://en.wikipedia.org/wiki/Onslow_(Keeping_Up_Appearances)", "wikipedia_page": {"main": "This article is a list of characters for the British television sitcom Keeping Up Appearances, which was shown on BBC1 from 1990 to 1995.", "link_mentions": [{"page": "Open University", "response": ["Television characters have also followed OU courses. These include Anne Bryce in the BBC sit-com Ever Decreasing Circles, Yvonne Sparrow in Goodnight Sweetheart and George Bulman in Bulman, in the ITV spin-off from the series Strangers. Sheila Grant (Sue Johnston) was accused of having an affair with her tutor in Brookside. Onslow, a character from Keeping up Appearances, watches Open University programming on television from time to time."]}, {"page": "Keeping Up Appearances", "response": ["Always hindering Hyacinth's best efforts to impress, and providing an unwelcome reminder of her less-than-refined roots, are her lower-class sisters Daisy (Judy Cornwell) and Rose (Shirley Stelfox in series 1; Mary Millar thereafter), and Daisy's proudly \"bone-idle\" husband Onslow (Geoffrey Hughes). They, along with Hyacinth's senile father, frequently turn up inconveniently (usually in their clapped-out Ford Cortina Mk IV – which always makes a characteristic backfire when it arrives), with Hyacinth going to great lengths to avoid them (saying: \"Richard, you know I love my family, but that's no reason why I should have to acknowledge them in broad daylight!\"). Rose is very sexually aggressive and promiscuous, adding to Hyacinth's embarrassment.", "Hyacinth's senile father frequently has flashbacks to the Second World War, and often exhibits bizarre behaviour, sometimes involving embarrassing situations with women (Onslow describes him as \"barmy\"). Two relatives of whom Hyacinth is not ashamed are her wealthy sister Violet (Anna Dawson) and her unseen son Sheridan. Violet frequently telephones Hyacinth for advice, allowing her to loudly announce to anyone in earshot, \"It's my sister Violet – the one with a Mercedes, swimming pool/sauna and room for a pony\". However, Violet's social acceptability is damaged by the eccentric behaviour of her cross-dressing, equestrian-loving turf accountant husband Bruce, whom she violently attacks because of his behaviour.", "| Onslow || data-sort-value=\"Hughes, Geoffrey\" | Geoffrey Hughes ||  ||  ||  ||  || ", "In 1997, BBC America produced a one-off, one hour TV special. It was a retrospective clipshow starring the characters of Daisy and Onslow — who were shown looking through Hyacinth's diary which had become mixed up with some photographs she had given to them. The special replayed clips from previous episodes and aired on the BBC.", "===Life Lessons from Onslow (2008)===", "In 2008, a further clipshow special was broadcast by PBS; this time only starring the character of Onslow who passed on \"lessons for life\" from within the framing device of a spoof Open University programme. This was the only episode not written or directed by Roy Clarke and Harold Snoad. This special was written by Michelle Street and directed by Duane Huey. Both specials have subsequently been issued on DVD.", "Exterior shots around Daisy's and Onslow's council terrace were taken in the Stoke Aldermoor district of  Coventry. Other exterior street and town shots were filmed in Leamington Spa and in various towns in Warwickshire, along with many scenes from the large town of Northampton, mainly the church hall. Some scenes were also shot in Swindon, Lydiard Park, Oxford, and Bristol. One scene was shot in Oslo, Norway. One episode was filmed in Great Yarmouth, mainly in the Great Yarmouth Pleasure Beach Theme Park.", "Onslow drives a 1978 Ford Cortina (number plate VSD 389S) that is in poor condition and backfires loudly almost every time it starts or stops, embarrassing Hyacinth, and frequently crushing her hopes of creating a perfect impression with new people. (The DVLA website shows that this vehicle's tax was not renewed once the series finished, suggesting that it was scrapped at that point). Onslow is also the owner of the rusting carcass of a Hillman Avenger in his front garden, in which lives Onslow's dog that always barks at Hyacinth as she approaches.", "In March 1997, Geoffrey Hughes and Judy Cornwell reprised their roles as Onslow and Daisy for a special compilation episode recorded for broadcast in the United States on PBS. The show sees the pair introduce classic clips from the series.", "* Life Lessons from Onslow", "In early 2008, Geoffrey Hughes reprised his role as Onslow once again for a clipshow of the series; this was for broadcast on American television, and sees him teaching a credit course at the Open University, and has selected \"successful relationships\" as his subject matter. The special was also released on Region 1 DVD.", "When Keeping Up Appearances did not return, after Patricia Routledge announced that she no longer wished to play Hyacinth, Roy Clarke's proposed spin-off series was called Mind Your Manors. The series was referenced in BBC in-house literature during 1997 and 1998, and later described by both Clarke and Geoffrey Hughes as part of a discussion of the character of Onslow in Radio 4's Archive on 4: On Northern Men, broadcast in 2009.", "The spin-off would have seen Onslow forced to take a supposedly \"easy\" job tending the gardens of a large manor house estate owned by a doddery and rather forgetful old Lord. When the Lord passes away suddenly, Onslow, Daisy and Rose (who it is implied was having a fling with the Lord, causing the heart attack which led to his passing) end up 'temporarily' moving into the manor house to mind it, due to a legal dispute with the deceased Lord's estranged brother (whom Rose immediately starts lusting after), who wants the land. ", "A mislaid deeds paper left by the forgetful old Lord would supposedly clarify who has rights to the estate, buried somewhere in the gardens that Onslow is left to ineptly try and keep in shape. Most of the conflict would have come from the Lord's brother and the manor's snooty neighbours, the wealthy Hyde-Whytes, who are not happy about the \"commoners\" who have taken up residence next door (although it later transpires that Mr. Hyde-Whyte used to know Onslow in their youth and is indebted to him after Onslow once took the fall for him to stop him being arrested). Su Pollard was approached to play the role of Miss Dorothy \"Dotty\" Henshaw, the Lord's eccentric and easily flustered cook / house-keeper who remains with the estate, and some preliminary location shooting was reportedly undertaken, though this may be connected with the \"missing\" final episode of Series 5, \"The Bishop Affair\". This proposed follow-up series was ultimately not commissioned, with Hughes continuing with his portrayal as Onslow in the specials listed above instead.", "* The Full Bouquet: Special Edition – released 9 September 2008 (complete series re-release, everything from volumes 1–8 & special \"Life Lessons from Onslow\")", "* Life Lessons from Onslow – released 9 September 2008", "* Life Lessons from Onslow – released 15 April 2010", "In 2010, the television show was adapted into a play entitled Keeping Up Appearances that toured theatres in the UK. The cast included Rachel Bell as Hyacinth, Kim Hartman as Elizabeth, Gareth Hale as Onslow, Steven Pinder as Emmet, Debbie Arnold as Rose, David Janson (who had previously appeared in the TV show as the postman) as Mr Edward Milson, a new character created for the stage show, Christine Moore as Daisy and Sarah Whitlock as Mrs Debden."]}, {"page": "Geoffrey Hughes (actor)", "response": ["Geoffrey Hughes DL (2 February 1944 – 27 July 2012) was an English actor. Hughes provided the voice of Paul McCartney in the animated film Yellow Submarine (1968), and rose to fame for portraying much-loved bin man Eddie Yeats in the long-running British soap opera Coronation Street from 1974 to 1983, making a return to the show in 1987. He is well known for playing loveable slob Onslow in the British sitcom Keeping Up Appearances (1990–1995); and 'Twiggy' in the sitcom The Royle Family, playing the part from 1998 to 2000, and reprising his role for the specials in 2006 and 2008.", "Hughes was born in Wallasey, Cheshire, to parents Ada and Bill. He had one younger brother, Gordon. He was brought up in Liverpool, where he attended Ranworth Square Primary School. He then went to Abbotsford Secondary Modern School in Norris Green, Liverpool. He started his career in repertory at the Victoria Theatre in Stoke-on-Trent. This was followed by his first West End production, the Lionel Bart and Alun Owen musical Maggie May. His other West End productions included the stage version of The Wonderful Wizard of Oz, Say Goodnight to Grandma, The Secret Life of Cartoons and several seasons of Run for your Wife. He later played Pistol in an open-air production of Henry V at Barnwell Manor. He also toured extensively in Britain and abroad.     Among his many other appearances on television are: An Arrow for Little Audrey; The Saint; Shadows of Fear; Z-Cars; Randall and Hopkirk (Deceased); Flying Lady; Making Out; Coasting; Doctor Who; Spender; and Boon. He played Trinculo in a version of The Tempest for the BBC and Squire Clodpoll in Good Friday 1663, one of Channel Four's new avant-garde operas. His comedy appearances on TV include The Likely Lads, Please Sir!, Dad's Army, Curry and Chips, No, Honestly, The Upper Hand and the character of Onslow in the BBC sitcom Keeping Up Appearances.", "|1990–1995 || Keeping Up Appearances || Onslow"]}, {"page": "Onslow", "response": ["Onslow may refer to:", "*Onslow, Western Australia, Australia, a town", "*Onslow, Nova Scotia, Canada, an unincorporated community", "**Onslow Speedway", "*Borough of Onslow, New Zealand", "*Onslow (New Zealand electorate), a New Zealand parliamentary electorate", "*Lake Onslow, New Zealand, a man-made lake", "*Onslow Village, an area of Guildford, Surrey, UK", "*Onslow, Iowa, U.S.", "*Onslow County, North Carolina, U.S.", "*Onslow Bay, North Carolina, U.S.", "* HMS Onslow (1916), an Admiralty M-class destroyer", "* HMS Onslow (G17), an O-class destroyer launched in March 1941", "* HMAS Onslow, a submarine of the Royal Australian Navy", "* USS Onslow (AVP-48), a United States Navy seaplane tender", "*Earl of Onslow, an extant title in the Peerage of the United Kingdom", "*Onslow baronets, two titles, both extant", "*Onslow (surname)", "*Onslow (given name)", "*Onslow (Keeping Up Appearances), a character on Keeping Up Appearances", "*Onslow College, a secondary school in Wellington, New Zealand", "*Onslow AFC, a defunct association football club from Wellington, New Zealand"]}, {"page": "Onslow (given name)", "response": ["Onslow is a masculine given name and nickname which may refer to:", "* Onslow Humphreys (c. 1893-?), Australian rugby union player", "* Onslow Stearns (1810-1878), American railroad builder and politician", "* Onslow Stevens (1902-1977), American actor", "* Onslow (Keeping Up Appearances), British TV character"]}]}}