{"wiki_id": "http://www.wikidata.org/entity/Q442740", "itemLabel": "Simon West", "itemDescription": "English film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_West", "wikipedia_page": {"main": "Simon Alexander West (born 24 May 1960) is an English film director and producer. He has primarily worked in the action genre, most notably as the director of the films Con Air (1997), Lara Croft: Tomb Raider (2001), The Mechanic (2011), and The Expendables 2 (2012). Outside of action, he directed the mystery thriller film The General's Daughter (1999) and the psychological horror film When a Stranger Calls (2006). Prior to his film career, West served as the director for music videos, including \"Never Gonna Give You Up\" by Rick Astley.\n\n", "link_mentions": [{"page": "Night of the Living Dead", "response": ["On September 15, 2009, it was announced that Simon West was producing a 3D animated retelling of the original film, originally titled Night of the Living Dead: Origins 3D and later re-titled Night of the Living Dead: Darkest Dawn. The movie is written and directed by Zebediah de Soto. The voice cast includes Tony Todd as Ben, Danielle Harris as Barbra, Joseph Pilato as Harry Cooper, Alona Tal as Helen Cooper, Bill Moseley as Johnny, Tom Sizemore as Chief McClellan and newcomers Erin Braswell as Judy and Michael Diskint as Tom."]}, {"page": "William Goldman", "response": ["* Wild Card (2015), film directed by Simon West, based on novel Heat"]}, {"page": "Lara Croft: Tomb Raider", "response": ["Lara Croft: Tomb Raider is a 2001 action adventure film based on the Tomb Raider video game series featuring the character Lara Croft, portrayed by Angelina Jolie. An international co-production between the United States, the United Kingdom, Japan and Germany, it was directed by Simon West and revolves around Lara Croft trying to obtain ancient artifacts from the Illuminati.", "Tomb Raider went through many drafts and several writers, which resulted in production delays. In 1998, writer Brent V. Friedman, who had co-written Mortal Kombat: Annihilation the year before, penned an unproduced Tomb Raider script. Producer and screenwriter Steven E. de Souza, who wrote and directed the 1994 video game film Street Fighter, penned an early draft of the Tomb Raider script in 1999, but it was rejected by Paramount. The final draft of the script was attributed to five writers, including director Simon West.", "The casting of Jolie was controversial among many fans of the Tomb Raider series, who felt she wasn't physically appropriate enough to play the large-breasted heroine; others complained about an American actress being hired to play a British character; others cited Jolie's tattoos and well-publicised controversial personal life. Director Simon West dismissed these concerns and said, in reference to Jolie's penchant for sexual knife play, \"it was always Angelina. I mean, Lara sleeps with knives and doesn't take shit from anybody. That's [Angelina] down to a tee.\" Jolie wore a padded bra to increase her bust size when playing Lara. As she explained to NY Rock in June 2001: \"C'mon, I'm not so flat chested to begin with. When I wear a tight T-shirt, I look a certain way. So it wasn't like we had to completely change me. You know, we just had to enhance me a little. I'm a 36C. Lara, she's a 36D. And in the game, she's a double D, so we took her down some. But we did give her a bit of padding there. For me, it was simply one size. So it was like having a padded bra. But no, I am not flat chested anyway. So we still made it Lara Croft, but we didn't go to any extremes. And Lara doesn't apologize for herself, and for having that, you know, recognizable shape. So I'm not going to apologize for her either.\"", "Director Simon West would comment a decade after its release that the creation of Lara Croft was influenced by a film market that \"wasn't used to women leading summer blockbusters\". This factor influenced his decision to cast Angelina Jolie who was not well known at the time, and not the studio's first choice (in contrast to Catherine Zeta-Jones, Ashley Judd, and Jennifer Lopez). West said that his decision to cast Jolie lay in the fact that \"there hadn't been a female lead of an action-adventure film that had carried a film [by herself recently], and Angelina wasn't as big as some of the other actresses that were up for the part, who'd done bigger films and had a longer track record and bigger box-office grosses... Some of their [images] were safer than Angelina's, whose was quite dangerous. She had all sorts of thing written about her—some obviously not true. She was a young woman experimenting.\" While Lara Crofts box office totals were the highest for a female-led action film at the time, and the film inspired theme park rides and led to a sequel, West stated in 2018 that \"at the time, the studio was incredibly nervous at what the outcome could have been. I'm surprised it's taken so long [for other female-fronted action stories to rise up], because I thought that two or three years after, there'd be 10 other movies like it cashing in on its success ...[b]ut it's amazing how things work so slowly. But finally The Hunger Games and Wonder Woman have caught up!\"", "Category:Films directed by Simon West"]}, {"page": "Black Hawk Down (film)", "response": ["Adapting Black Hawk Down: a Story of Modern War by Mark Bowden was the idea of director Simon West, who suggested to Jerry Bruckheimer that he should buy the film rights and let West direct. West moved on to direct Lara Croft: Tomb Raider (2001) instead."]}, {"page": "Red Sonja", "response": ["Actress Rose McGowan was originally intended to portray Sonja in 2010's Red Sonja film, but these plans were abandoned after McGowan suffered injuries that permanently damaged the mobility and strength of her right arm. In a February 2011 interview, film producer Avi Lerner stated that Simon West was hired to direct the film and also mentioned Amber Heard as the frontrunner to star in the lead role.Williams, Owen. \"Amber Heard For Red Sonja? With Simon West directing?\". Empire. February 10, 2011 On February 26, 2015, Christopher Cosmos was hired to write the film's script. Filmmaker Mike Le Han has made a video for his pitch of him directing Red Sonja."]}, {"page": "2001 in film", "response": ["| Lara Croft: Tomb Raider || Paramount Pictures / Mutual Film Company || Simon West (director); Patrick Massett, John Zinman (screenplay); Angelina Jolie, Jon Voight, Chris Barrie, Iain Glen, Noah Taylor, Daniel Craig, Richard Johnson, Julian Rhind-Tutt, Leslie Phillips, Henry Wyndham || Action, Fantasy || Live action", "* Lara Croft: Tomb Raider, directed by Simon West, starring Angelina Jolie, Jon Voight and Daniel Craig"]}, {"page": "1997 in film", "response": ["| Con Air || Touchstone Pictures / Jerry Bruckheimer Films || Simon West (director); Scott Rosenberg (screenplay); Nicolas Cage, John Cusack, John Malkovich, Steve Buscemi, Ving Rhames, Colm Meaney, Danny Trejo, M. C. Gainey, Nick Chinlund, Dave Chappelle, Mykelti Williamson, Jesse Borrego, Rachel Ticotin, Steve Eastin, Angela Featherstone, Monica Potter, Landry Allbright, Renoly Santiago || Action, Thriller || Live action", "* Con Air, directed by Simon West and starring John Cusack, Nicolas Cage, John Malkovich, and Steve Buscemi"]}, {"page": "1999 in film", "response": ["| The General's Daughter || Paramount Pictures || Simon West (director); Christopher Bertolini (screenplay); John Travolta, Madeleine Stowe, James Cromwell, Timothy Hutton, James Woods, Leslie Stefanson, Clarence Williams III, Daniel von Bargen, Mark Boone Junior, John Beasley, Boyd Kestner, Brad Beyer, John Benjamin Hickey, John Frankenheimer, Katrina vanden Heuvel, Scott Rosenberg, Cooper Huckabee || Drama || Live action", "* The General's Daughter, directed by Simon West, starring John Travolta, Madeleine Stowe, Timothy Hutton, James Cromwell and James Woods"]}, {"page": "Steve Buscemi", "response": ["Steven Vincent Buscemi ( ,Archived at Ghostarchive and the Wayback Machine: As stated in interviews by Buscemi himself, some may insist that his pronunciation of his own name is \"wrong\" because it does not match the original Italian pronunciation as well. It is not uncommon for people to pronounce his name   or   instead. ; born December 13, 1957) is an American actor and filmmaker. He is known for his roles in Quentin Tarantino's Reservoir Dogs (1992), Robert Rodriguez's Desperado (1995), Simon West's Con Air (1997), Michael Bay's Armageddon (1998), the black comedy Ghost World (2001), Tim Burton's drama Big Fish (2003), and Armando Iannucci's political satire The Death of Stalin (2017). Buscemi is also known for his many collaborations with the Coen brothers, having appeared in six of their films: Miller's Crossing (1990), Barton Fink (1991), The Hudsucker Proxy (1994), Fargo (1996), The Big Lebowski (1998), and Paris, je t'aime (2006).", "The next year, Buscemi again collaborated with the Coen Brothers, starring as kidnapper Carl Showalter in the black comedy crime film Fargo starring Frances McDormand and William H. Macy. The film was a critical and commercial success debuting at the 1996 Cannes Film Festival where it competed for the Palme d'Or. Subsequently, he gained a reputation as character actor, with supporting roles in the blockbuster action films as Garland Greene in Simon West's Con Air (1997) and Rockhound in Michael Bay's Armageddon (1998). Buscemi also appeared as Donny in the Coen's cult classic black comedy film The Big Lebowski (1998)."]}, {"page": "Jerry Bruckheimer", "response": ["| Simon West"]}, {"page": "Lara Croft", "response": ["Paramount Pictures acquired the film rights for Tomb Raider in 1998, which was released as Lara Croft: Tomb Raider in 2001. Producer Lloyd Levin stated that the film makers tried to capture the essence of the video game elements rather than duplicate them. Acknowledging the character's \"huge fan base\" and recognisable appearance, director Simon West sought an actress with acting ability as well as physical attributes similar to Croft. Paramount also received input from developer Core Design on casting. Rumoured actresses included Pamela Anderson, Demi Moore and Jeri Ryan. Academy Award-winning actress Angelina Jolie was eventually cast to play Lara Croft. She had not been a fan of the character, but considered the role as a \"big responsibility\", citing anxiety about fans' high expectations. Producer Lawrence Gordon felt she was a perfect fit for the role. Jolie braided her hair and used minimal padding to increase her bust a cup size to 36D for the role. She felt that Croft's video game proportions were unrealistic, and wanted to avoid showing such proportions to young girls. Jolie trained rigorously for the action scenes required for the role, occasionally sustaining injuries. Her training focused on practising the physical skills necessary to perform the film's stunts. The difficulty of the training and injuries discouraged her, but she continued working through production. Jolie also encountered difficulties when working the guns, bungee jumping, and maneuvering with the braid. West had not anticipated that Jolie would do her own stunts, and was impressed, as was stunt coordinator Simon Crane, by the effort she put into them."]}, {"page": "Patrick McGoohan", "response": ["McGoohan's name was linked to several aborted attempts at producing a new film version of The Prisoner. In 2002, Simon West was signed to direct a version of the story. McGoohan was listed as executive producer for the film, which never came to fruition. Later, Christopher Nolan was proposed as director for a film version. However, the source material remained difficult and elusive to adapt into a feature film. McGoohan was not involved in the project that was ultimately completed. A reimagining of the series was filmed for the AMC network in late 2008, with its broadcast taking place during November 2009."]}, {"page": "List of film and television directors", "response": ["*Simon West"]}, {"page": "Trevor Rabin", "response": ["| Simon West"]}, {"page": "List of South African television series", "response": ["Simon West Productions"]}, {"page": "Con Air", "response": ["Con Air is a 1997 American action thriller film directed by Simon West and starring Nicolas Cage, John Cusack and John Malkovich. Written by Scott Rosenberg and produced by Jerry Bruckheimer, the film centers on a prison break aboard a Justice Prisoner and Alien Transportation System aircraft, nicknamed \"con air.\" It features Steve Buscemi, Ving Rhames, Colm Meaney, Mykelti Williamson, Dave Chappelle, Rachel Ticotin, Danny Trejo, and Monica Potter in supporting roles. ", "With second unit work beginning on June 24, 1996, principal photography began shortly after at Salt Lake City, on July 1, 1996 and continued until October 29, 1996, at a number of locations.\"Con Air (1997): Miscellaneous notes.\"  Turner Classic Movies. Retrieved: December 19, 2011. While most of the interiors of the Fairchild C-123 Provider transport aircraft were filmed in Hollywood Center Studios soundstage #7, Wendover Airport in Utah, as the stand in for the fictional Lerner Airfield, was used for the C-123 flying and taxi scenes.Rigoulot, Leslie. \"Con Air: About The Production.\"  Film Scouts, 2008. Retrieved: December 20, 2011. Director Simon West chose the barren and remote Wendover area \"because it looked like the surface of the moon ... My idea was that it was perfect for the convicts who had been locked up for 10, 20, 30 years in little cells.\" The old wartime bomber base was also used for the aircraft boneyard scenes while the original swimming pool at the base was used in a scene where Garland Greene was talking to a young girl.", "Category:Films directed by Simon West"]}, {"page": "The Blob", "response": ["In August 2009, it was revealed that musician-turned-director Rob Zombie was working on another remake,Fleming, Michael. \"Rob Zombie to remake 'The Blob'\" Variety, August 27, 2009.\"Horror Nights '09: Rob Zombie on 'The Blob' and making music.\" BloodyDisgusting, October 5, 2009. but he later left the project.\"Rob Zombie: First Image From 'The Lords Of Salem' Movie.\"  BlabberMouth, April 26, 2011. In January 2015, he was replaced by Simon West as director.Squires, John.\"Simon West boards Second remake of The Blob.\" Dread Central, January 22, 2015. Retrieved: July 7, 2015. It was announced that the film would be produced by Richard Saperstein and Brian Witten, with the producer of the original film, Jack H. Harris, as executive producer.Tartaglione, Nancy. \"Simon West To Helm ‘The Blob’ Remake; Goldcrest Selling At EFM – Berlin.\" Deadline Hollywood, January 22, 2015. Retrieved: July 7, 2015. Harris died in 2017, and there have been no updates as of 2021."]}, {"page": "Carter Burwell", "response": ["| Simon West"]}, {"page": "Mark Mancina", "response": ["| Simon West"]}, {"page": "Davis Entertainment", "response": ["|Simon West"]}, {"page": "The General's Daughter (film)", "response": ["The General's Daughter is a 1999 American mystery thriller film directed by Simon West and starring John Travolta. The plot concerns the mysterious death of the daughter of a prominent Army general. The film is based on the 1992 novel by the same name by Nelson DeMille. Released on June 18, 1999, it received mixed reviews from critics and grossed $149 million worldwide.", "The General's Daughter was directed by Simon West and produced by Mace Neufeld. It was an adaptation of the best-selling book of the same name, written by Nelson DeMille and published in 1992. William Goldman did some work on the script. Michael Douglas was originally attached to star.", "Category:Films directed by Simon West"]}, {"page": "Mark Isham", "response": ["| Simon West"]}, {"page": "R. Madhavan", "response": ["In 2012, Madhavan took a sabbatical and was based in Chicago resting his knee, which he injured during the making of Vettai, causing him to suffer from chondromalacia patellae. During the period, he felt he had to \"reinvent himself\" and had to work on films which would appeal to the \"new generation of audiences\", so took a decision to work on a single film at a time. During a period of three years without any theatrical releases, his long-delayed Hindi film Taak Jhaank directed by Rituparno Ghosh in 2006, premièred at the 19th Kolkata International Film Festival in 2013, while his first Hindi film Akeli, shot in 1997, was released online during the following year. During his recovery period and sabbatical in 2013, Madhavan signed on to appear in Simon West's Night of the Living Dead: Darkest Dawn, in which he appeared as a former marine personnel and shot for the project in California. The computer animated film, where Madhavan provided voice work, premièred in San Diego during July 2015."]}, {"page": "The Punisher (2004 film)", "response": ["Drew McWeeny of Ain't It Cool News said of the style of the film that \"The Punisher has more in common with the work of Don Siegel and John Frankenheimer than it does with the work of Michael Bay or Simon West. Which isn't to say that it's the equal of those classics, but at least Hensleigh's got the right idea. ... The Punisher is pulp, served up gritty and ugly and brutal. It's not jam-packed full of one-liners. What humor there is in the film is dark.\""]}, {"page": "Graeme Revell", "response": ["| Simon West"]}, {"page": "When a Stranger Calls (2006 film)", "response": ["When a Stranger Calls is a 2006 American psychological horror thriller film directed by Simon West and written by Jake Wade Wall. The film stars Camilla Belle, Brian Geraghty, Katie Cassidy, and Clark Gregg. Belle plays a babysitter who starts to receive threatening phone calls from an unidentified stranger, played by both Tommy Flanagan and Lance Henriksen. It is a remake of Fred Walton's 1979 horror film of the same name, which became a cult classic for its opening 20 minutes, which this remake extends to a feature-length film.", "The film was released on DVD and UMD on May 16, 2006. Special features include two audio commentaries (one with Camilla Belle and Simon West; the other with Jake Wade Wall), deleted scenes, a 20-minute making-of featurette, and trailers. A Blu-ray version of the film was released for the first time by Mill Creek Entertainment on October 4, 2016 in a triple feature with I Know What You Did Last Summer (1997) and Vacancy (2007). This disc contains none of the extras found on the DVD. This initial release was discontinued, and a new version was released by Mill Creek titled \"Queens of Scream - Triple Feature\" on February 5, 2019. The new release is virtually identical, with the only differences being a new cover on the case and the inclusion of a DVD copy alongside the Blu-ray.", "Category:Films directed by Simon West"]}, {"page": "Brian Tyler", "response": ["|Simon West"]}, {"page": "The Mechanic (1972 film)", "response": ["On May 7, 2009, it was announced that director Simon West would be helming a remake with Jason Statham taking the lead role.  The remake opened in the United States on January 28, 2011, making $11,500,000 on its opening weekend. A sequel was released in August 2016."]}, {"page": "Conrad W. Hall", "response": ["| Simon West"]}, {"page": "Cassian Elwes", "response": ["| Simon West"]}, {"page": "Illuminati in popular culture", "response": ["* In Simon West's 2001 film Lara Croft: Tomb Raider, a group of high-society villains call themselves Illuminati, developing a plan to rule the world. Along with Lara Croft's father, they claim that the Illuminati have existed for four millennia for this purpose.Ebert, Roger (2004) Roger Ebert's Movie Yearbook 2004, Andrews McMeel, , p. 362Pocahontas in the Alps: Masonic traces in the stage works of Franz Christoph Neubauer, Chris Walton. Musical Times; Autumn 2005, pp. 50–51."]}, {"page": "Dario Marianelli", "response": ["| Simon West"]}, {"page": "David Tattersall", "response": ["|Simon West"]}, {"page": "Daniel Landin", "response": ["as well as additional photography credits on ‘Sexy Beast’ dir Jonathan Glazer, ‘Snatch’ dir. Guy Ritchie and ‘Keen Eddie’ dir. Simon West.", "| Simon West"]}, {"page": "Propaganda Films", "response": ["* Simon West"]}, {"page": "Never Gonna Give You Up", "response": ["The 1987 music video for \"Never Gonna Give You Up\" was directed by Simon West. It was filmed in London, largely around the London Borough of Harrow. Since being uploaded to YouTube on 24 October 2009, the video has received over one billion views; it surpassed that milestone on 28 July 2021, 34 years and 1 day after the song was released."]}, {"page": "Ramona Pringle", "response": ["Born in Toronto, she was named after the Ramones by her punk rock parents, Michaele Jordana and Douglas Pringle. Ramona started her career doing a series of international commercials for Ricola, where she played Heidi which quickly developed a fan following online, and made Pringle instantly recognizable as \"The Ricola Girl\". She was discovered for the campaign by the director Simon West."]}, {"page": "Pinar Toprak", "response": ["| Simon West"]}, {"page": "List of assassinations in fiction", "response": ["*The Mechanic – 2011 remake by Simon West about a hitman (Jason Statham), his protégé (Ben Foster), a drug lord, and a TV evangelist"]}, {"page": "Patricia Holm", "response": ["The character of Patricia Holm was first portrayed on screen by Jean Gillie in a 1943 film adaptation of Meet – The Tiger! entitled The Saint Meets the Tiger, produced by RKO Radio Pictures. Subsequently, in all other film and TV adaptations of stories in which Holm originally appeared, the character name has been changed, until December 2012, when American actress Eliza Dushku stepped into the role for a backdoor pilot produced by Roger Moore and shot under the direction of Simon West. The subsequent pilot, which recast Holm as a high-tech and deadly thief, was not picked up as a series and was eventually released in 2017 (digitally and direct-to-video) in tribute to the recently deceased Moore."]}, {"page": "Olga Kurylenko", "response": ["| Simon West"]}, {"page": "List of British film directors", "response": ["*Simon West"]}, {"page": "List of compositions by Ennio Morricone", "response": ["| The Expendables 2 || Simon West || The Good, the Bad & the Ugly"]}, {"page": "Chris Lebenzon", "response": ["|Simon West"]}, {"page": "Harry Humphries", "response": ["*Con Air: Directed by Simon West – Technical Advisor / Stunt Work"]}]}}