{"wiki_id": "http://www.wikidata.org/entity/Q442815", "itemLabel": "Jose Baxter", "itemDescription": "British footballer (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jose_Baxter", "wikipedia_page": {"main": "Jose Baxter (born 7 February 1992) is an English former professional footballer who played as an attacking midfielder.\nBorn in Bootle, Baxter began his career with his home town club of Everton, where in 2008 he became the Premier League's then-second youngest ever starter at 16 years 191 days (Matthew Briggs of Fulham held the record – 16 years 68 days – from 2007 until it was surpassed in 2019 by Harvey Elliott).After having been on the fringes of the first team and spending time on loan at Tranmere Rovers, he rejected a new contract in 2012 in order to find regular football elsewhere. He joined Oldham Athletic shortly afterwards, where he spent a successful season before being bought by Sheffield United just under 12 months later.\nAfter a three-year period in Yorkshire interrupted by suspensions, he was released and had a spell without a club before Everton signed him again in 2017 to rebuild his career in their reserve squad. He returned to Oldham in the summer of 2018. In July 2019, he signed for Plymouth Argyle, and left them in November 2019.Baxter represented England at both under-16 and under-17 level.", "link_mentions": [{"page": "Bootle", "response": ["Many notable footballers were born in Bootle. Jamie Carragher, played for LFC, is now a pundit for Sky, Steve McManaman and Roy Evans came to prominence playing for Liverpool (with Evans later going on to become the club's manager) whilst Alvin Martin is regarded as one of West Ham United's greatest ever players. Former Evertonian Jose Baxter of Sheffield United was also born in Bootle."]}, {"page": "Baxter (name)", "response": ["* Jose Baxter, English footballer, currently playing for Sheffield United"]}, {"page": "Jose", "response": ["* Jose Baxter (born 1992), English footballer"]}, {"page": "José", "response": ["* Jose Baxter, UK professional football player"]}, {"page": "Sam Sodje", "response": ["On 23 February 2013, Sodje was sent off for punching Oldham Athletic's Jose Baxter in the groin. In December 2013, a report by The Sun on Sunday suggested that Sodje intentionally attempted to get sent off to receive a cash payment. Sodje allegedly admitted to having been paid £70,000 to be sent off in the match."]}, {"page": "1992 in the United Kingdom", "response": ["* 7 February – Jose Baxter, footballer"]}, {"page": "Billy Paynter", "response": ["On 10 January 2014, Paynter signed for Sheffield United on loan. He spent most of his time on the bench as Nigel Clough chose to use Jose Baxter as a false number nine in a highly successful run that took the club up the table and into the semi-finals of the FA Cup. played 13 games for the \"Blades\" in the second half of the 2013–14 campaign, without scoring a goal. He was released by Doncaster manager Paul Dickov in May 2014."]}, {"page": "Matt Done", "response": ["Ahead of the 2016–17 season, Done switched number shirts from 14 to 11 following the departure of Jose Baxter, who released at the end of the 2015–16 season. Under the new management of Chris Wilder, Done began to play as a striker, having impressed the club's management. Done went on to score two goals in two matches between 10 September 2016 and 17 September 2016 against Wimbledon and Peterborough United. As a result, it was reported by The Star that Done was among few players to be offered a new contract by Wilder. However, as the 2016–17 season, Done's first team opportunities soon became limited, due to his lack of his goal-scoring form, as well as, Wilder preference of striker Billy Sharp. As a result, Done was placed on the substitute bench for the rest of the season. It wasn't until on 14 April 2017 when he scored his third goal of the season, in a 3–0 win over Port Vale. At the end of the 2016–17 season, which saw Sheffield United promoted to Championship after six seasons in League One, Done went on to make thirty-five appearances and scoring three times in all competitions."]}, {"page": "List of Sheffield United F.C. seasons", "response": ["|Jose BaxterMarc McNulty"]}, {"page": "Conor Sammon", "response": ["On 25 July 2015, Sammon joined League One club Sheffield United on loan for the whole season. He scored his first goals in a 3–1 win at Peterborough United on 18 August, and totalled 6 goals from 33 games, being in and out of a team also featuring Billy Sharp, Che Adams and Jose Baxter up front."]}, {"page": "List of Oldham Athletic A.F.C. seasons", "response": ["| Lge 1 || 46 || 14 || 9 || 23 || 46 || 59 || 51 || 19th || R5 || R1 || R1 || || || Jose Baxter || 15"]}, {"page": "2009 MLS All-Star Game", "response": ["|FW ||37|| Jose Baxter || || "]}, {"page": "José Baxter", "response": ["#REDIRECT Jose Baxter"]}, {"page": "2008–09 Everton F.C. season", "response": ["* 16 - Jose Baxter becomes Everton's youngest player to make a competitive appearance when he comes on against Blackburn Rovers in the Premier League. Baxter was aged 16 years and 191 days.", "* 23 - Jose Baxter becomes Everton's youngest player to be selected for a competitive match, when he starts against West Bromwich Albion in the Premier League. Baxter was aged 16 years and 198 days.", "| Jose Baxter"]}, {"page": "2009 FA Cup Final", "response": ["Everton were without long-term injury victims Phil Jagielka, Mikel Arteta, Yakubu Aiyegbeni, Victor Anichebe and Nuno Valente. On-loan Brazilian striker Jô was cup-tied. Andy van der Meyde, who set up the winning goal in the fourth round tie with Liverpool, had since been released by the club. This meant that there was a place on the Everton bench for 17-year-old winger Jose Baxter.", "|FW ||37|| Jose Baxter"]}, {"page": "Translink Cup", "response": ["But Magaye Gueye turned in Jose Baxter's tantalising cross from close range seven minutes from time."]}, {"page": "2009–10 Everton F.C. season", "response": ["| align=left | Jose Baxter"]}, {"page": "2010–11 Everton F.C. season", "response": ["* Reserve / U21 Player of the Season - Jose Baxter"]}, {"page": "2010–11 Premier Reserve League", "response": ["|align=\"left\"| Jose Baxter"]}, {"page": "Everton F.C. Reserves and Academy", "response": ["**Under-23s: Victor Anichebe (2006), John Irving (2007), John Irving (2008), Kieran Agard (2009), Shane Duffy (2010), Jose Baxter (2011), Adam Forshaw (2012), N/A (2013), Tyias Browning (2014), Brendan Galloway (2015), Joe Williams (2016),  Jonjoe Kenny  (2017), Morgan Feeney (2018), Nathan Broadhead (2019), Anthony Gordon (2020), Ryan Astley (2021)"]}, {"page": "2011–12 Everton F.C. season", "response": ["|  Jose Baxter"]}, {"page": "2011–12 Premier Reserve League", "response": ["|align=\"left\"| Jose Baxter"]}]}}