{"wiki_id": "http://www.wikidata.org/entity/Q4424123", "itemLabel": "Percy Sladen", "itemDescription": "English zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Sladen", "wikipedia_page": {"main": "Walter Percy Sladen (30 June 1849 – 11 June 1900) was an English biologist who specialised in starfish.\nThe son of a wealthy leather merchant, Sladen was born near Halifax, Yorkshire on 30 June 1849. He was educated at Hipperholme Grammar School and Marlborough College, but received no university training. As a young man he indulged his hobby of natural history, but soon become fascinated with echinoderms. In 1876 he was elected a Fellow of the Linnean Society of London, and the following year became a Fellow of the Zoological Society of London. 1877 also saw the publication of his first paper, in which he split the sea-lily genus Poteriocrinus into four; in his lifetime, Sladen would gain a reputation as a \"splitter\" because of his proclivity for declaring specimens to belong to new genera or species. Late that year he began a long and fruitful collaboration with Duncan; which would see the publication of some 15 co-authored papers, many on fossils, over the course of twelve years.\n\nFrom December 1878, Sladen spent three month at Naples under the auspices of the British Association for the Advancement of Science. His work there, on echinoderm pedicellariae, established his reputation as a leading authority on echinoderms, and in 1881 he was invited to organise and write up an account of the starfishes collected during the Challenger expedition. This would take him a decade to complete, and comprise nearly 1000 pages and 118 plates.\nBy 1890, Sladen married Constance Anderson of York. She was sister of Tempest Anderson the volcanologist, and Yarborough Anderson, a barrister.\nHer father  William Charles Anderson was a surgeon and Sheriff of York.\nBy that time Sladen was on the Committee of the British Association for the Advancement of Science, Zoological Secretary of the Linnean Society of London, and also active in the Zoological Society of London and the Geological Society of London. He therefore relocated to London, at least temporarily. Unfortunately much of Sladen's later life was interrupted by poor health. In 1895 he was elected Vice-President of the Linnean Society, but only a few months later he gave up both this and his secretarial position because of health problems. He completed only two more papers before retiring in 1898 to an Exeter estate inherited on the death of his uncle. He died there two years later, on 11 June 1900.\nFollowing his death, Sladen's wife helped preserve her husband's memory by donating his large collection of echinoderms to the Royal Albert Memorial Museum in Exeter, and endowing the Percy Sladen Memorial Trust, to be administered by the Linnean Society to support scientific research.", "link_mentions": [{"page": "Asterias", "response": ["A few years later, in 1889, Percy Sladen counted 48 or 49 species in the genus. He split the genus into at least six subgenera, of which subgenus Asterias, section β of the Pentactinid (5-armed) section contained at least four species, three of which are still accepted in the genus today."]}, {"page": "White-bellied woolly mouse opossum", "response": ["The white-bellied woolly mouse opossum (Marmosa constantiae) is a small pouchless marsupial of the family Didelphidae. It was formerly assigned to the genus Micoureus, which was made a subgenus of Marmosa in 2009. The specific epithet was given in honour of Constance Sladen (née Anderson), wife of the naturalist Percy Sladen. She funded the 1902 expedition which collected the type specimen."]}, {"page": "Hipperholme Grammar School", "response": ["* Percy Sladen, biologist"]}, {"page": "Tempest Anderson", "response": ["His father was William Charles Anderson, surgeon and Sheriff of York. His sister Constance married Percy Sladen, and his brother was Yarborough Anderson, a barrister. In 1904 Anderson received an honorary degree of DSc from the University of Leeds for his work on volcanoes.", "He was one of the five original Trustees of the Percy Sladen Memorial Trust. He was President of the Yorkshire Philosophical Society, and in 1912 he presented the society with a 300-seat lecture theatre (the Tempest Anderson Hall) attached to the Yorkshire Museum in York Museum Gardens. This was one of the world's first concrete buildings. He died on board ship on the Red Sea while returning from visiting the volcanoes of Indonesia and the Philippines.  He was buried in Suez, Egypt. After his death, the houses he had built were left to his cousin, Colonel Fearnley Anderson.. He also bequeathed a substantial sum to the Yorkshire Museum."]}, {"page": "Sladen", "response": ["* Percy Sladen (1849–1900), English biologist", "* Percy Sladen Memorial Trust, a trust fund administered by the Linnean Society in memory of Percy Sladen"]}, {"page": "Clive Forster-Cooper", "response": ["In 1905 Forster-Cooper joined the Percy Sladen expedition to the Indian Ocean, with Stanley Gardiner. In 1906, he returned to Cambridge and continued to work on the collections made on the expeditions to the Indian Ocean.  In 1907 he met Dr C. W. Andrews, a specialist in the history of the elephant, at the British Museum of Natural History and became interested in fossil mammals.  As a result of this meeting, in 1907 he joined Dr Andrews' collecting expedition to the Fayum. His increasing interest in vertebrate palaeontology led him to the American Museum of Natural History, New York, where he worked under H. F. Osborn, then Professor of Zoology at Columbia University and Curator of the museum. He spent a year in America working closely Osborn, Matthew, Walter W. Granger and W. K. Gregory, studying the American collections of fossil mammals, and taking part in one of Granger's collecting expeditions to Wyoming.", "*1907. (With J. S. Gardiner.) The Percy Sladen Trust Expedition to the Indian Ocean in 1905. Description of the expedition. Trans. Linn. Soc. (Zoo.), 12, 1–55. Part II. Mauritius to Seychelles. Trans. Linn. Soc. (Zoo.), 12, 111–175."]}, {"page": "List of Old Marlburians", "response": ["* Percy Sladen, marine zoologist"]}, {"page": "Royal Albert Memorial Museum", "response": ["The museum's zoology collection includes specimens of invertebrates and mammals from across the world. Percy Sladen's collection of echinoderms is held by the museum and considered the most important of its kind outside of any national collection."]}, {"page": "Walter Percy Sladen", "response": ["#REDIRECT Percy Sladen"]}, {"page": "Percy Sladen Memorial Trust", "response": ["The Percy Sladen Memorial Trust is a trust fund administered by the Linnean Society of London for the support of scientific research. It was endowed by Constance Sladen, who was married to the marine biologist Percy Sladen (1849–1900), in his memory.", "* the Percy Sladen Trust Expedition to the Indian Ocean (1905)The reports of this expedition were published in three volumes of the Transactions of the Linnean Society of London.2nd Series: Zoology. Volume I (Volume 12 of the journal, 1907-9); Volume II (Volume 13, 1909-10); Volume III (Volume 14, 1910-12)", "* the Percy Sladen Trust Expedition to Melanesia;", "* the Percy Sladen Trust Expedition to West Africa;", "* the Percy Sladen Trust Expeditions to the Abrolhos Islands (1913,1915);", "* the Percy Sladen Trust Expedition to Lake Titicaca (1937)"]}, {"page": "Edwin Percy Phillips", "response": ["*1911 Joined Percy Sladen Memorial Expedition to the Kamiesberge", "*Descriptions of New Plants from the Gift Berg collected by the Percy Sladen Memorial Expedition - 1913"]}, {"page": "Aimée Crocker", "response": ["Crocker's grandson Gerald Russell was a naturalist, an adventurer and a cryptozoologist who headed several very well publicized expeditions including the Percy Sladen Expedition to Africa, where in the high forests of the British Cameroons, he reportedly encountered a large unclassified animal Mokèlé-mbèmbé, and the Ruth Harkness Asiatic Expedition to Tibet, where he captured the first live giant panda. Russell also led two expansive expeditions in the Himilayas in search of a yeti—the Daily Mail Expedition of 1954 and the Slick Johnson Snowman Expedition of 1958."]}, {"page": "W. Percy Sladen", "response": ["#REDIRECT Percy Sladen"]}, {"page": "Euretaster insignis", "response": ["This starfish was first described in 1882 by marine biologist Percy Sladen as Retaster insignis, Retaster being a small segregate genus of Pteraster. In 1940, the genus had to change its name after Walter Kenrick Fisher noted that the type species of Retaster he had himself designated (as Perrier, the original coiner, had failed to do so), Pteraster capensis was in fact a sound species of Pteraster, which automatically made the former genus a synonym of the latter. The genus known  as Retaster required a new name, and the one Fisher coined was Euretaster, with R. insignis as its type species."]}, {"page": "Asterias versicolor", "response": ["The species was first described by Percy Sladen in 1889. Sladen does not specify the etymology of the specific epithet, but states the mottled yellow and dark brown colouration is striking, and likely derived the name from this observation."]}, {"page": "Constance Sladen", "response": ["Constance Sladen (11 August 184817 January 1906) was an artist, architectural historian, and philanthropist who was one of the first female members of the Linnean Society of London and founded the Percy Sladen Memorial Trust in memory of her late husband.", "Constance Anderson was born on 11 August 1848 in York.\"Mrs Percy Sladen\", Proceedings of the Linnean Society of London. (One Hundred and Eighteenth Session, 1905‐1906.) 2 November 1905, to 21 June 1906, p.41. Her father was Dr W C Anderson, Sheriff of York; her brothers were the volcanologist Tempest Anderson, and the barrister Yarborough Anderson; she had a younger sister Ellen, who became Lady Granger.Gardiner, Brian G. (2003). \"A biography of Percy Sladen (1849–1900)\" (PDF). The Linnean (Special Issue No. 4) She studied at York School of Art, and later in Rome.", "In 1890, she married Percy Sladen, who was from a wealthy family from Halifax. They had first met around 1870. Percy Sladen was a zoologist and had a particular interest in echinoderms, creating an important collection, including specimens from the Challenger expedition. In 1898 they moved to a home, Northbrook Park, near Exeter, which Percy had inherited. His health was poor and it was hoped the new residence would improve it, however he died just two years later on a trip to Florence. Their marriage was described as \"a union of heart and mind, yielding a bright and tender sympathy which strengthened and stimulated him in his life's work\".", "After the death of her husband in 1900, Sladen was determined that his collection would be available for the public and endowed a new gallery and curatorial position at the Royal Albert Memorial Museum in Exeter. She also endowed the Percy Sladen Memorial Trust in 1904 to provide funding for fieldwork for biologists and geologists around the world.", "*Percy Sladen Memorial Fund Grants"]}, {"page": "Afrolychas braueri", "response": ["The type specimen was collected from Praslin Island by August Brauer in 1894 and is held at the Zoological Institute and Museum of the University of Hamburg. The species was next found in \"high jungle\" on Mahé and on Silhouette in 1905 by the Percy Sladen Memorial Expedition. After these initial collections, it wasn't seen again until being rediscovered in 1990 in Silhouette's Jardin Marron. It is one of only three species of scorpion found in the Seychelles."]}]}}