{"wiki_id": "http://www.wikidata.org/entity/Q443961", "itemLabel": "Jeremy Northam", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Northam", "wikipedia_page": {"main": "Jeremy Philip Northam (born 1 December 1961) is an English actor. After a number of television roles, he earned attention as Mr. Knightley in the 1996 film adaptation of Jane Austen's Emma. He has appeared in the films An Ideal Husband, Gosford Park, Amistad, The Winslow Boy, Enigma, and Martin and Lewis, amongst others. He also played Thomas More in the Showtime series The Tudors. From 2016 to 2017 he appeared as Anthony Eden in the Netflix series The Crown.", "link_mentions": [{"page": "December 1", "response": ["*  1961   – Jeremy Northam, English actor"]}, {"page": "Gerard Manley Hopkins", "response": ["*Jeremy Northam reads Hopkins's poetry in The Great Poets.THE GREAT POETS: G.M HOPKINS (JEREMY NORTHAM) (NAXOS AUDIO BOOKS: NA190012)"]}, {"page": "Jerry Lewis", "response": ["Also on SNL, the Martin and Lewis reunion on the 1976 MDA Telethon is reported by Chevy Chase on Weekend Update. Comedians Eddie Murphy and Joe Piscopo both parodied Lewis when he hosted SNL in 1983. Piscopo also channeled Jerry Lewis while performing as a 20th-century stand-up comedian in Star Trek: The Next Generation; in the second-season episode \"The Outrageous Okona\", Piscopo's Holodeck character, The Comic, tutors android Lieutenant Commander Data on humor and comedy. Comedian and actor Jim Carrey satirized Lewis on In Living Color in the sketch \"Jheri's Kids Telethon\". Carrey had an uncredited cameo playing Lewis in the series Buffalo Bill on the episode \"Jerry Lewis Week\". He also played Lewis, with impersonator Rich Little as Dean Martin, on stage. Actor Sean Hayes portrayed Lewis in the made-for-TV movie Martin and Lewis, with Jeremy Northam as Dean Martin.  Actor Kevin Bacon plays the Lewis character in the 2005 film Where The Truth Lies, based on a fictionalized version of Martin and Lewis. In the satiric novel, Funny Men, about singer/wild comic double act, the character Sigmund \"Ziggy\" Blissman, is based on Lewis."]}, {"page": "Lord Dunsany", "response": ["*The 2008 film Dean Spanley, adapted by Alan Sharp from the novella My Talks With Dean Spanley, directed by Toa Fraser and produced by Matthew Metcalfe and Alan Harris, starred Peter O'Toole, Sam Neill, Jeremy Northam and Bryan Brown."]}, {"page": "Thomas More", "response": ["Jeremy Northam depicts More in the television series The Tudors as a peaceful man, as well as a devout Roman Catholic and loving family patriarch. He also shows More loathing Protestantism, burning both Martin Luther's books and English Protestants who have been convicted of heresy. The portrayal has unhistorical aspects, such as that More neither personally caused nor attended Simon Fish's execution (since Fish actually died of bubonic plague in 1531 before he could stand trial), although More's The Supplication of Souls, published in October 1529, addressed Fish's Supplication for the Beggars.see Fish, Simon. \"Supplycacion for the Beggar.\" 1529 in Carroll, Gerald L. and Joseph B. Murray. The Yale Edition of the Complete Works of St. Thomas More. Vol. 7. New Haven: Yale University Press, 1990, pp. 1–10. See also Pineas, Rainer. \"Thomas More's Controversy with Simon Fish.\" Studies in English Literature, 1500–1900, Vol. 7, No. 1, The English Renaissance, Winter, 1967, 13–14. Indeed, there is no evidence that More ever attended the execution of any heretic. The series also neglected to show More's avowed insistence that Richard Rich's testimony about More disputing the King's title as Supreme Head of the Church of England was perjured."]}, {"page": "Ivor Novello", "response": ["Novello was portrayed in Robert Altman's 2001 film Gosford Park by Jeremy Northam, and several of his songs were used for the film's soundtrack, including \"Waltz of My Heart\", \"And Her Mother Came Too\", \"I Can Give You the Starlight\", \"What a Duke Should Be\", \"Why Isn't It You?\" and \"The Land of Might-Have-Been\"."]}, {"page": "Peter O'Toole", "response": ["O'Toole was once again nominated for the Best Actor Academy Award for his portrayal of Maurice in the 2006 film Venus, directed by Roger Michell, his eighth such nomination. He was in One Night with the King (2007) and co-starred in the Pixar animated film Ratatouille (2007), an animated film about a rat with dreams of becoming the greatest chef in Paris, as Anton Ego, a food critic. He had a small role in Stardust (2007). He also appeared in the second season of Showtime's drama series The Tudors (2008), portraying Pope Paul III, who excommunicates King Henry VIII from the church; an act which leads to a showdown between the two men in seven of the ten episodes. Also in 2008, he starred alongside Jeremy Northam and Sam Neill in the New Zealand/British film Dean Spanley, based on an Alan Sharp adaptation of Irish author Lord Dunsany's short novel, My Talks with Dean Spanley."]}, {"page": "Gosford Park", "response": ["The film stars an  ensemble cast, which includes Eileen Atkins, Bob Balaban, Alan Bates, Charles Dance, Stephen Fry, Michael Gambon, Richard E. Grant, Derek Jacobi, Kelly Macdonald, Helen Mirren, Jeremy Northam, Clive Owen, Ryan Phillippe, Maggie Smith, Kristin Scott Thomas, and Emily Watson. The story follows a party of wealthy Britons plus an American producer, and their servants, who gather for a shooting weekend at Gosford Park, an English country house. A murder occurs after a dinner party, and the film goes on to present the subsequent investigation from the servants' and guests' perspectives.", "* Ivor Novello (Jeremy Northam), Sir William's cousin who is also a British matinee idol and film star. ", "Patrick Doyle composed the film's score. Doyle said that it can take him up to six months to create a film score, but Altman asked him to write and compose the music for Gosford Park in less than five weeks. Doyle recorded the soundtrack at the London Air-Edel Recording Studios in October 2001. The soundtrack also features six original songs by composer and playwright, Ivor Novello. Jeremy Northam, who plays Novello, sings all the songs and his brother, Christopher, accompanies him on the piano. The soundtrack was released on 15 January 2002."]}, {"page": "Dean Martin", "response": ["Danny Gans portrayed Martin in the 1992 CBS miniseries Sinatra. Martin was portrayed by Joe Mantegna in the 1998 HBO movie about Sinatra and Martin titled The Rat Pack. Mantegna was nominated for both an Emmy Award and a Golden Globe Award for the role. British actor Jeremy Northam portrayed the entertainer in the 2002 made-for-TV movie Martin and Lewis, alongside Will & Grace's Sean Hayes as Jerry Lewis."]}, {"page": "2001 in film", "response": ["| The Golden Bowl || Lions Gate Films / Merchant Ivory Productions / TF1 International || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Kate Beckinsale, James Fox, Anjelica Huston, Nick Nolte, Jeremy Northam, Madeleine Potter, Uma Thurman, Nicholas Day, Peter Eyre || Period, Romance, Drama || Live action", "| Gosford Park || USA Films || Robert Altman (director); Julian Fellowes (screenplay); Eileen Atkins, Bob Balaban, Alan Bates, Charles Dance, Stephen Fry, Michael Gambon, Richard E. Grant, Derek Jacobi, Kelly Macdonald, Helen Mirren, Jeremy Northam, Clive Owen, Ryan Philippe, Maggie Smith, Kristin Scott Thomas, Emily Watson, Camilla Rutherford, Geraldine Somerville, Tom Hollander, Natasha Wightman, James Wilby, Claudie Blakley, Laurence Fox, Trent Ford, Jeremy Swift, Sophie Thompson, Meg Wynn Owen, Adrian Scarborough, Frank Thornton, Ron Webster || Black Comedy, Mystery || Live action", "* Enigma, directed by Michael Apted, starring Kate Winslet, Dougray Scott, Jeremy Northam and Saffron Burrows – (UK)"]}, {"page": "2002 in film", "response": ["| Possession || Focus Features || Neil LaBute (director/screenplay); David Henry Hwang, Laura Jones (screenplay); Aaron Eckhart, Gwyneth Paltrow, Jeremy Northam, Jennifer Ehle, Lena Headey, Toby Stephens, Holly Aird, Tom Hollander, Trevor Eve || Romance, Mystery, Drama || Live Action", "* Cypher, starring Jeremy Northam and Lucy Liu – (US)"]}, {"page": "Royal National Theatre", "response": ["* The Voysey Inheritance, starring Jeremy Northam, directed by Richard Eyre"]}, {"page": "2003 in film", "response": ["| The Singing Detective || Paramount Classics / Icon Productions || Keith Gordon (director); Dennis Potter (screenplay); Robert Downey Jr., Robin Wright Penn, Jeremy Northam, Katie Holmes, Mel Gibson, Adrien Brody, Jon Polito, Carla Gugino, Saul Rubinek, Alfre Woodard, Amy Aquino, Eddie Jones, Clyde Kusatsu, David Dorfman || Musical, Crime, Comedy || || Live Action"]}, {"page": "1995 in film", "response": ["| The Net || Columbia Pictures || Irwin Winkler (director); John Brancato and Michael Ferris (screenplay); Sandra Bullock, Jeremy Northam, Dennis Miller, Diane Baker, Wendy Gazelle, Ken Howard, Ray McKinnon, Gerald Berns, Robert Gossett || Thriller || Live action", "| Carrington || Gramercy Pictures / PolyGram Filmed Entertainment || Christopher Hampton (director/screenplay); Emma Thompson, Jonathan Pryce, Steven Waddington, Rufus Sewell, Samuel West, Penelope Wilton, Janet McTeer, Peter Blythe, Jeremy Northam, Alex Kingston, Sebastian Harcombe, Richard Clifford, David Ryall, Stephen Boxer, Annabel Mullion || Biography || Live action", "*The Net, starring Sandra Bullock, Jeremy Northam, Dennis Miller"]}, {"page": "1996 in film", "response": ["| Emma || Miramax Films || Douglas McGrath (director/screenplay); Gwyneth Paltrow, Toni Collette, Alan Cumming, Ewan McGregor, Jeremy Northam, Greta Scacchi, Juliet Stevenson, Polly Walker, Sophie Thompson, James Cosmo, Denys Hawthorne, Phyllida Law, Kathleen Byron, Karen Westwood, Edward Woodall, Brian Capron, Angela Down, John Franklyn-Robbins, Ruth Jones || Period, Comedy || Live action"]}, {"page": "1997 in film", "response": ["| Mimic || Dimension Films / Miramax Films || Guillermo del Toro (director/screenplay); Matthew Robbins (screenplay); Mira Sorvino, Jeremy Northam, Josh Brolin, Charles S. Dutton, Giancarlo Giannini, F. Murray Abraham, Norman Reedus, Julian Richings, Doug Jones, Alexander Goodwin, Alix Koromzay, James Costa, Javon Barnwell || Sci-Fi, Horror || Live action", "| Amistad || DreamWorks || Steven Spielberg (director); David Franzoni (screenplay); Morgan Freeman, Anthony Hopkins, Djimon Hounsou, Matthew McConaughey, Nigel Hawthorne, David Paymer, Pete Postlethwaite, Stellan Skarsgård, Anna Paquin, Tomas Milian, Chiwetel Ejiofor, Derrick Ashong, Geno Silva, John Ortiz, Kevin J. O'Connor, Ralph Brown, Darren E. Burrows, Allan Rich, Paul Guilfoyle, Peter Firth, Xander Berkeley, Jeremy Northam, Arliss Howard, Austin Pendleton, Pedro Armendariz Jr., Razaaq Adoti, Abu Bakaar Fofanah, Harry Blackmun || Period, Drama || Live action"]}, {"page": "1999 in film", "response": ["| Gloria || Columbia Pictures / Mandalay Entertainment || Sidney Lumet (director); John Cassavetes, Steve Antin (screenplay); Sharon Stone, Jean-Luke Figueroa, Jeremy Northam, Cathy Moriarty, George C. Scott, Mike Starr, Bonnie Bedelia, Barry McEvoy, Don Billett, Jerry Dean, Tony DiBenedetto, Teddy Atlas, Bobby Cannavale, Sarita Choudhury, Miriam Colon || Drama, Crime, Thriller || Live action", "| The Winslow Boy || Sony Pictures Classics || David Mamet (director/screenplay); Nigel Hawthorne, Jeremy Northam, Rebecca Pidgeon, Gemma Jones, Guy Edwards, Matthew Pidgeon, Aden Gillett, Colin Stinton, Sarah Flind, Neil North || Period, Drama || Live action", "| An Ideal Husband || Miramax Films || Oliver Parker (director/screenplay); Rupert Everett, Julianne Moore, Peter Vaughan, Minnie Driver, Cate Blanchett, Jeremy Northam, John Wood, Ben Pullen, Marsha Fitzalan, Lindsay Duncan, Neville Phillips, Nickolas Grace, Simon Russell Beale, Anna Patrick, Delia Lindsay || Comedy, Romance || Live action", "* Gloria, directed by Sidney Lumet, starring Sharon Stone, Jeremy Northam and George C. Scott", "* An Ideal Husband, directed by Oliver Parker, starring Cate Blanchett, Jeremy Northam, Rupert Everett, Julianne Moore and Minnie Driver (U.K.)", "* The Winslow Boy, directed by David Mamet, starring Nigel Hawthorne, Jeremy Northam, Rebecca Pidgeon and Gemma Jones (U.K.)"]}, {"page": "Daniel Day-Lewis", "response": ["Day-Lewis returned to the stage in 1989 to work with Richard Eyre, as the title character in Hamlet at the National Theatre, London, but during a performance collapsed during the scene where the ghost of Hamlet's father appears before him. He began sobbing uncontrollably, and refused to go back on stage; he was replaced by Jeremy Northam, who gave a triumphant performance. Ian Charleson formally replaced Day-Lewis for the rest of the run.Peter, John. \"A Hamlet Who Would Be King at Elsinore\". Sunday Times. 12 November 1989. Earlier in the run, Day-Lewis had talked of the \"demons\" in the role, and for weeks he threw himself passionately into the part. Although the incident was officially attributed to exhaustion, Day-Lewis claimed to have seen the ghost of his own father. He later explained that this was more of a metaphor than a hallucination. \"To some extent I probably saw my father’s ghost every night, because of course if you’re working in a play like Hamlet, you explore everything through your own experience.\" He has not appeared on stage since. The media attention following his breakdown on-stage contributed to his decision to eventually move from England to Ireland in the mid-1990s, to regain a sense of privacy amidst his increasing fame."]}, {"page": "Kate Beckinsale", "response": ["2000's The Golden Bowl marked Beckinsale's first role following the birth of her daughter. The Merchant/Ivory production was based on the novel by Henry James and also starred Uma Thurman and Jeremy Northam. Beckinsale's partner, Michael Sheen, hit Northam on the film set after he followed Beckinsale to her trailer to scold her for forgetting a line. Holden noted \"the most satisfying of the four-lead performances belong to the British cast members, Ms. Beckinsale and Mr. Northam, who are better than their American counterparts at layers of emotional concealment,\" adding each beat of Beckinsale's performance \"registers precisely.\" Thomas felt her performance would take her to \"a new career level.\" Andrew Sarris of The New York Observer asserted that she \"comes close to capturing the sublimity of Maggie, despite the obvious fact that no movie can capture the elegant copiousness of James' prose.\" The film grossed over $5 million worldwide."]}, {"page": "The Net (1995 film)", "response": ["The Net is a 1995 American action thriller film directed by Irwin Winkler and starring Sandra Bullock, Jeremy Northam and Dennis Miller. The film was released on July 28, 1995."]}, {"page": "Amistad (film)", "response": ["* Jeremy Northam as Judge Coglin"]}, {"page": "Hay Fever (play)", "response": ["A 2012 revival at the Noël Coward Theatre included in the cast Lindsay Duncan as Judith, Jeremy Northam as Richard, Kevin McNally as David, Olivia Colman as Myra, Sam Callis as Sandy, Freddie Fox as Simon, Amy Morgan as Jackie, Phoebe Waller-Bridge as Sorrel, and Jenny Galloway as Clara. 2014 revivals included one at the Stratford Festival, in Canada, with Lucy Peacock as Judith, Cynthia Dale as Myra, and Tyrone Savage as Sandy; and a UK tour with Felicity Kendal as Judith, Simon Shepherd as David, Sara Stewart as Myra, Celeste Dodwell as Jackie, and Alice Orr-Ewing as Sorrel."]}, {"page": "Stephen Poliakoff", "response": ["Poliakoff's first feature film was Runners, directed by Charles Sturridge, starring James Fox, Jane Asher and Kate Hardie. It received a limited theatrical release in 1983 before being shown in Channel 4's Film on Four slot. His directorial debut was the much-lauded and now rare Hidden City (1988), premiered at the Venice Film Festival and starring Charles Dance, Richard E. Grant and Cassie Stuart. His television career continued with She's Been Away (1989) starring Peggy Ashcroft and also winning awards at Venice, before a return to film with Close My Eyes (1991), starring Clive Owen, Saskia Reeves and Alan Rickman in an elaborate reworking of the incest theme that had been central to Hitting Town (1976), followed by Century (1994), with Owen, Dance and Miranda Richardson. Less successful were Food of Love (1997) with Grant, Nathalie Baye and Joe McGann and The Tribe (1998) starring Joely Richardson and Jeremy Northam, the latter eventually screened on BBC Two in the absence of a cinema distribution deal where it achieved extremely high viewing figures and was immediately repeated."]}, {"page": "The Statement (film)", "response": ["The murder of \"Manenbaum\" attracts the interest of local police and eventually the persistent Investigating Judge Annemarie Livi (Tilda Swinton). She becomes absorbed by the case, not discouraged by the lack of assistance she encounters from official sectors. Livi forms an alliance with the similarly dedicated Colonel Roux (Jeremy Northam), a senior French Gendarmerie investigator, and the pair initially suspect that \"Manenbaum\" was part of a Jewish assassination plot. They discover that Brossard has been the subject of several previous investigations, dating back more than 40 years, which have all failed. Livi and Roux discover hidden resources, tightening the noose around Brossard, who finds his allies increasingly reluctant to help him. Doubts arise over the theory of a Jewish hit squad, but it is clear that someone wants Brossard dead.", "* Jeremy Northam as Colonel Roux"]}, {"page": "Possession (2002 film)", "response": ["In a fictional story, literary scholars American Roland Michell (Aaron Eckhart) and British Maud Bailey (Gwyneth Paltrow) independently find that the socially antagonistic relationship between the Victorian era poets Randolph Henry Ash (Jeremy Northam) and Christabel LaMotte (Jennifer Ehle) may have concealed a secret connection as lovers. Ash is traditional and conservative and LaMotte is a freethinking bisexual. Rival scholars become aware of their efforts and each seeks to be the first at the public disclosure of this major finding about the poets. In a parallel relationship, Michell and Bailey have their own deepening connection.", "Ralph Fiennes was approached for the role as Randolph Ash that eventually went to Jeremy Northam."]}, {"page": "Noël Coward Theatre", "response": ["* Hay Fever (23 February 2012 – 2 June 2012) by Noël Coward starring Lindsay Duncan, Jeremy Northam, Kevin McNally and Olivia Colman"]}, {"page": "The Winslow Boy", "response": ["A 1999 version, directed by David Mamet, starred Nigel Hawthorne as Arthur Winslow, Jeremy Northam as Morton, and Rebecca Pidgeon as Catherine."]}, {"page": "Stella Gonet", "response": ["Gonet also has acted extensively in the theatre. In 1989, she appeared as Ophelia in the National Theatre production of Hamlet, with the title role being played by Daniel Day-Lewis, Ian Charleson and finally Jeremy Northam."]}, {"page": "The Golden Bowl", "response": ["In 2000, The Golden Bowl was filmed by Merchant Ivory Productions, directed by James Ivory, and starred Uma Thurman, Nick Nolte, Kate Beckinsale and Jeremy Northam. In some ways Ruth Prawer Jhabvala's adaptation differs from James's novel. In the book, Charlotte is a calculating, amoral character who manipulates and manages those around her with a glance or a smile; however, in the movie, Charlotte appears to suffer from some mental disorder, exhibiting symptoms of paranoia and obsessive love."]}, {"page": "The Singing Detective (film)", "response": ["* Jeremy Northam as Mark Binney"]}, {"page": "An Ideal Husband", "response": ["There have been at least five adaptations of the play for the cinema, in 1935 –  a German film directed by Herbert Selpin and starring Brigitte Helm and Sybille Schmitz; 1947 –  a British adaptation produced by London Films and starring Paulette Goddard, Michael Wilding and Diana Wynyard; 1980 –  a Soviet version starring Ludmila Gurchenko and Yury Yakovlev; 1999 –  a British film starring Julianne Moore, Minnie Driver, Jeremy Northam, Cate Blanchett and Rupert Everett; and 2000 –  a  British film starring James Wilby and Sadie Frost.", "BBC television adaptations were broadcast in 1958 (with Ronald Leigh-Hunt, Sarah Lawson, Faith Brook and Tony Britton); 1969 (with Keith Michell, Dinah Sheridan, Margaret Leighton and Jeremy Brett); and 2002 (with Jeremy Northam, Cate Blanchett, Julianne Moore and Rupert Everett."]}, {"page": "Mimic (film)", "response": ["Mimic is a 1997 American science fiction horror film directed by Guillermo del Toro, written by del Toro and Matthew Robbins based on Donald A. Wollheim's short story of the same name, and starring Mira Sorvino, Jeremy Northam, Josh Brolin, Charles S. Dutton, Giancarlo Giannini and F. Murray Abraham.", "* Jeremy Northam as Dr. Peter Mann"]}, {"page": "Bedford College, London", "response": ["*Jeremy Northam (born 1961), English actorRoyal Holloway, University of London. The Independent, 27 July 2007. Retrieved 29 August 2008."]}, {"page": "Enigma (2001 film)", "response": ["Mr. Jericho and Miss Wallace, as they formally address each other, work to decipher intercepts stolen by Claire and determine why she took them. Jericho is closely watched by an MI5 agent, Wigram (Jeremy Northam), who plays cat and mouse with him throughout the film. Meanwhile, U-boats are closing in on a convoy of thirty seven ships from America, giving the code-breakers less than four days to find a solution to reading the changed Shark cipher.", "* Jeremy Northam as Mr Wigram", "The film hints that Dougray Scott's character, the brilliant Cambridge mathematician Thomas Jericho is the main code-breaker at Bletchley, equating him with Alan Turing, the original creator of the British Bombe, with the words of Mr Wigram, played by Jeremy Northam:"]}, {"page": "Journey's End", "response": ["The play was adapted for television in 1988, starring Jeremy Northam as Stanhope, Edward Petherbridge as Osborne, and Timothy Spall as Trotter. It held close to the original script although there were changes, the most obvious being the depiction on camera of the raid, which happens off-stage in the theatre production."]}]}}