{"wiki_id": "http://www.wikidata.org/entity/Q44381986", "itemLabel": "John Shakespeare", "itemDescription": "British diplomat, b. 11 June 1930", "wikipedia_url": "https://en.wikipedia.org/wiki/John_William_Richmond_Shakespeare", "wikipedia_page": {"main": "John William Richmond Shakespeare,  (born 11 June 1930) is a British retired diplomat.\nShakespeare was born in Simla, India, the only son of Major W.G. Shakespeare, who was in charge of the British Military Hospital there. From 1935 to 1937 the family lived in Peking, where Major Shakespeare was medical officer to the Legation Garrison. In 1937 they moved to Hong Kong, where his father was in charge of the British Military Hospital. He attended the Peak School, of which he is the oldest surviving alumnus.\nFrom 1943 to 1948 he was at Winchester College in the UK, and from 1949 to 1950 he was a 2nd Lieutenant in the Irish Guards. He graduated from Trinity College, Oxford, where he read Modern Languages, in 1953. After a year lecturing in English at the École Normale Supérieure in Paris, he joined the Editorial Staff of the Times Educational Supplement, and in 1956 he became a member of the Editorial Staff of The Times. \n\nIn 1959 he was Private Secretary to Sir Gladwyn Jebb, the British ambassador in Paris. On 22 September 1960 he was appointed a member of the Foreign Service in Paris, and on August 1961 he was transferred to the Foreign and Commonwealth Office in London. In 1963, he was promoted to First Secretary.From 1966 to 1969, he was Information Officer in Rio de Janeiro. He was awarded the Order of the Southern Cross.\nFrom 1973 to 1976 he was Counsellor and Consul General in Buenos Aires.\nOn 26 January 1976 Derick Ashe terminated his duty as ambassador in Buenos Aires and JWR Shakespeare stayed as Chargé d'affaires until 1977.\nFrom 1979 to 1983, he was Deputy Head of Mission in Lisbon, and Chargé d'affaires during the Falklands War of 1982. He was Chairman of the Anglo-Portuguese Society from 1981 to 1984.From 1983 to 1987 he was ambassador in Lima. He was Vice-President of the Anglo-Peruvian Society from 1991.\n\nFrom 1987 to 1990 he was ambassador in Rabat. He was awarded the Alouite Order by King Hassan II.\nFrom 1991, he was Chairman of the Morgan Grenfell (later Deutsche Bank) Latin American Trust.\nFrom 1991, he was Latin American consultant for Clyde & Co.\n1985 Birthday Honours he became Companion of the Order of St Michael and St George.", "link_mentions": [{"page": "Nicholas Shakespeare", "response": ["Born in Worcester, England to diplomat John William Richmond Shakespeare and his wife Lalage Ann, daughter of the travel writer and journalist S. P. B. Mais,Burke's Peerage, Baronetage and Knightage 2003, vol. 3, p. 3578 Shakespeare grew up in the Far East and in South America, including Brazil, where his father worked at the British Embassy between 1966 and 1969. John Shakespeare was later chargé d'affaires at Buenos Aires, before serving as Ambassador to Peru from 1983 to 1987, and Ambassador to Morocco from 1987 to 1990. Nicholas was educated at the Dragon School preparatory school in Oxford, then at Winchester College and at Magdalene College, Cambridge. He worked as a journalist for BBC television and then on The Times as assistant arts and literary editor. From 1988 to 1991, he was literary editor of The Daily Telegraph and The Sunday Telegraph."]}]}}