{"wiki_id": "http://www.wikidata.org/entity/Q444867", "itemLabel": "Mary Hayley Bell", "itemDescription": "English actress, writer and dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Hayley_Bell", "wikipedia_page": {"main": "Mary Hayley Bell, Lady Mills (22 January 1911 – 1 December 2005) was an English actress and writer, married for 64 years to actor Sir John Mills. Her novel Whistle Down the Wind was adapted as a film, starring her teenaged daughter, actress Hayley Mills.", "link_mentions": [{"page": "December 1", "response": ["*  2005   – Mary Hayley Bell, English actress and playwright (b. 1911)"]}, {"page": "1911", "response": ["** Mary Hayley Bell, English dramatist (d. 2005)"]}, {"page": "John Mills", "response": ["His second wife was the dramatist Mary Hayley Bell. Their marriage, on 16 January 1941, lasted for 64 years, until his death in 2005. They were married in a rushed civil ceremony, because of the war; it was not until 60 years later that they were married in a church.Obituary, The Age, 25 April 2005, p.9 They lived in The Wick, London, for many years. They sold the house to musician Ronnie Wood in 1971 and moved to Hills House, Denham, south Buckinghamshire."]}, {"page": "1911 in film", "response": ["*January 22 – Mary Hayley Bell, actress, writer and dramatist, wife of Sir John Mills (d 2005)"]}, {"page": "1953 in literature", "response": ["* Mary Hayley Bell – The Uninvited Guest"]}, {"page": "Whistle Down the Wind (1996 musical)", "response": ["Whistle Down the Wind is a musical with music composed by Andrew Lloyd Webber, who also co-wrote its book with Patricia Knop and Gale Edwards, and its lyrics were written by Jim Steinman. It is based on the 1961 film Whistle Down the Wind, whose source novel of the same name was written by Mary Hayley Bell in 1959."]}, {"page": "List of show business families", "response": ["* Actor, Sir John Mills and his wife and playwright, Mary Hayley Bell, are parents of actresses, Hayley Mills and Juliet Mills, and director, Jonathan Mills. Sir John's sister is actress, Annette Mills."]}, {"page": "Scott of the Antarctic (film)", "response": ["The film was directed by Charles Frend from screenplay by Ivor Montagu and Walter Meade with \"additional dialogue\" by the novelist Mary Hayley Bell (Mills' wife). The film score was by Ralph Vaughan Williams, who reworked elements of it into his 1952 Sinfonia antartica. The supporting cast included James Robertson Justice, Derek Bond, Kenneth More, John Gregson, Barry Letts and Christopher Lee."]}, {"page": "Maxwell Caulfield", "response": ["Caulfield has been married since 1980 to actress Juliet Mills, daughter of actor Sir John Mills and writer Lady Mills (née Mary Hayley Bell), and brother-in-law of Jonathan Mills and actress Hayley Mills. Caulfield is stepfather to Melissa (née Miklenda; Mills' daughter from her second marriage) and Sean Caulfield (born Sean Alquist; Mills' son from her first marriage).Maxwell Caulfield biography, FilmReference.com. Retrieved 10 April 2011."]}, {"page": "Juliet Mills", "response": ["Juliet Maryon Mills (born 21 November 1941) is a British-American actress.Certificate of Naturalization as a United States Citizen #10116847, filed U.S. District Court, Los Angeles, California (date: 10 October 1975), ancestry.com. She is the daughter of actor Sir John Mills and Mary Hayley Bell and the eldest of three siblings; her younger siblings are actress Hayley Mills and director Jonathan Mills.", "Mills was born on 21 November 1941 in London during World War II (1941), though her parents, actor Sir John Mills and playwright Mary Hayley Bell, soon moved the family to the country to be away from the German Luftwaffe raids. She is the elder sister of actress Hayley Mills and director Jonathan Mills. Because of her parents' fame, Mills grew up surrounded by famous actors, including Rex Harrison, David Niven and Marlon Brando. She recalled her childhood in the 2000 documentary film Sir John Mills' Moving Memories, written by her brother. Her godmother was actress Vivien Leigh, and her godfather was playwright Noël Coward. She attended the Elmhurst Ballet School, in Camberley, Surrey.Who's Who in the Theatre, 17th ed. Gale Research, 1981"]}, {"page": "Hayley Mills", "response": ["Hayley Catherine Rose Vivien Mills (born 18 April 1946) is an English actress. The daughter of Sir John Mills and Mary Hayley Bell, and younger sister of actress Juliet Mills, she began her acting career as a child and was hailed as a promising newcomer, winning the BAFTA Award for Most Promising Newcomer for her performance in the British crime drama film Tiger Bay (1959), the Academy Juvenile Award for Disney's Pollyanna (1960) and Golden Globe Award for New Star of the Year – Actress in 1961. During her early career, she appeared in six films for Walt Disney, including her dual role as twins Susan and Sharon in the Disney film The Parent Trap (1961). Her performance in Whistle Down the Wind (a 1961 adaptation of the novel written by her mother) saw Mills nominated for BAFTA Award for Best British Actress.", "Mills received an offer to make a film in Britain for Bryan Forbes, Whistle Down the Wind (1961), based on a novel by her mother Mary Hayley Bell, about some children who believe an escaped convict is Jesus. It was a hit at the British box office and she was voted the biggest star in Britain for 1961.Bryan Forbes, A Divided Life, Mandarin, 1993 p29"]}, {"page": "Malvern St James", "response": ["* Mary Hayley Bell (1911-2005), playwright and author of Whistle Down the Wind"]}, {"page": "2005 in literature", "response": ["*December 1 – Mary Hayley Bell, dramatist"]}, {"page": "Crispian Mills", "response": ["Mills is the son of actress Hayley Mills and director Roy Boulting, the grandson of Sir John Mills and Mary Hayley Bell, nephew of Juliet Mills and directors John Boulting and Jonathan Mills, and half-brother to Jason Lawson."]}, {"page": "Cathleen Nesbitt", "response": ["* The Uninvited Guest by Mary Hayley Bell (1953)"]}, {"page": "2005 in the United Kingdom", "response": ["* 1 December – Mary Hayley Bell, actress (born 1911)"]}, {"page": "Shanghai International Settlement", "response": ["* Mary Hayley Bell, English actress"]}, {"page": "Deaths in December 2005", "response": ["*Mary Hayley Bell, 94, British actress, Alzheimer's disease."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Mary Hayley Bell (Acting Diploma 1933)"]}, {"page": "Mary Bell (disambiguation)", "response": ["* Mary Hayley Bell (1911–2005), English actress, writer and dramatist"]}, {"page": "Francis Bell", "response": ["*Francis Hayley Bell (1877–1944), father of Mary Hayley Bell"]}, {"page": "Whistle Down the Wind (film)", "response": ["Whistle Down the Wind is a 1961 British children's crime drama film directed by Bryan Forbes, adapted by Keith Waterhouse and Willis Hall from the 1959 novel of the same name by Mary Hayley Bell. The film stars her daughter Hayley Mills, who was nominated for the BAFTA Award for Best British Actress for this film."]}, {"page": "1911 in the United Kingdom", "response": ["* 22 January – Mary Hayley Bell, actress and dramatist, wife of Sir John Mills (died 2005)"]}, {"page": "Hayley", "response": ["* Mary Hayley Bell (1911–2005), English actress, writer, dramatist", "* Hayley Mills (b. 1946), English actress, daughter of Mary Hayley Bell"]}, {"page": "List of rose cultivars named after people", "response": ["* Mary Hayley Bell (1989 — Kordes, Germany)"]}, {"page": "Sky West and Crooked", "response": ["Sky West and Crooked (known in the United States as Gypsy Girl) is a 1965 romantic drama film, featuring actress Hayley Mills. The film was directed by her father, John Mills, and was co-written by her mother, Mary Hayley Bell."]}, {"page": "The Play of the Week", "response": ["* Duet for Two Hands by Mary Hayley Bell; cast: Signe Hasso, Eric Portman, Patrick Horgan and Lois Nettleton (October 24, 1960)"]}, {"page": "The Big Freeze (film)", "response": ["* Mary Hayley Bell as Nursing Home Resident (uncredited)"]}, {"page": "List of people from the London Borough of Richmond upon Thames", "response": ["|Sisters Juliet Mills and Hayley Mills|| Actresses|| They lived at The Wick on Richmond Hill with their parents John Mills and Mary Hayley Bell.|| ", "|Mary Hayley Bell|| 1911–2005|| Actress, writer and dramatist, and her husband, John Mills (1908–2005), actor|| They lived at The Wick on Richmond Hill.||"]}, {"page": "The Wick", "response": ["The sound of the wind around the house reportedly inspired Mary Hayley Bell, actress, writer and wife of Sir John Mills, to write the novel Whistle Down The Wind which was made into both a film and, later, an Andrew Lloyd Webber musical."]}, {"page": "Sir John Mills' Moving Memories", "response": ["Sir John Mills' Moving Memories is a British documentary film featuring 16mm color home movies shot by the actor Sir John Mills. It documents his life between 1946 and 1969, directed and edited by Marcus Dillistone and produced by his son Jonathan Mills. Commentary was provided by Sir John (who was over 90 years old at the time), Hayley Mills, Juliet Mills and Sir Richard Attenborough. His wife Mary Hayley Bell is also seen towards the end of the film listening to her husband singing at the piano. The scene was later to be screened in full when Sir John appeared on the Parkinson chat show."]}, {"page": "January 1911", "response": ["**Mary Hayley Bell, English dramatist, wife of Sir John Mills (d. 2005)"]}, {"page": "Whistle Down the Wind (1989 musical)", "response": ["Whistle Down the Wind is a musical based on the 1959 novel by Mary Hayley Bell, adapted by Richard Taylor and Russell Labey, with music and lyrics by Richard Taylor."]}, {"page": "Whistle Down the Wind (novel)", "response": ["Whistle Down the Wind was a novella written by Mary Hayley Bell and illustrated by Owen Edwards. It was published in 1959 by Boardman and retailed for 12 shillings and sixpence (62½p). The central characters are three children — Swallow, Brat and Poor Baby. The story of the Great Secret is told by Brat."]}, {"page": "Duet for Two Hands", "response": ["#REDIRECT Mary Hayley Bell"]}, {"page": "Nicholas Selby", "response": ["Selby was born in Holborn, London on 13 September 1925. He served in the British Army during World War II, making his stage debut in Dangerous Corner at Preston, Lancashire, for the forces' entertainment organisation ENSA. In 1948 he enrolled at the Central School of Speech and Drama, receiving commendation for his student performance in Mary Hayley Bell's Men in Shadow. There then followed seasons in repertory at Liverpool, Birmingham, Coventry, York, Hornchurch and Cambridge. His first professional West End appearance was in 1959, in William Douglas-Home's Aunt Edwina, followed by his creation of the hit-man Ben in the London premiere of Harold Pinter's The Dumb Waiter at the Hampstead Theatre Club in January 1960. In 1963 Selby made his first appearances for the Royal Shakespeare Company, as Casca in Julius Caesar, the Bishop of Winchester in The Wars of The Roses and Antonio in The Tempest. His association with the company lasted for ten years, until he followed Peter Hall to the new National Theatre in London in 1976. In his first season there he appeared as Menander in Tamburlaine and the Captain in Tales from the Vienna Woods. He was van Swieten in the inaugural production Amadeus and the parliamentary Speaker in The Madness of George III. His last stage role was as Dilly Knox in Breaking the Code in 1987."]}]}}