{"wiki_id": "http://www.wikidata.org/entity/Q4444835", "itemLabel": "Reginald Stewart", "itemDescription": "British conductor and music educator", "wikipedia_url": "https://en.wikipedia.org/wiki/Reginald_Stewart_(conductor)", "wikipedia_page": {"main": "Reginald Stewart (20 April 1900 in Edinburgh – 8 July 1984 in Santa Barbara, California) was a Scottish conductor, pianist, and music educator who was chiefly active in the United States and Canada.", "link_mentions": [{"page": "Canadian Pacific Railway", "response": ["CPR programming included a series of concert broadcasts from Montreal with an orchestra conducted by Douglas Clarke and a series called Concert Orchestra broadcast from the Royal York Hotel featuring conductor Rex Battle, and another series of concerts, this time sponsored by Imperial Oil and featuring conductor Reginald Stewart with a 55-piece orchestra and some of the leading soloists of the day, also performing at the Royal York."]}, {"page": "Baltimore Symphony Orchestra", "response": ["* Reginald Stewart (1942-1952)"]}, {"page": "Music of Baltimore", "response": ["The Baltimore Symphony Orchestra of the 19th century had floundered in 1899, was replaced by a new orchestra organized by the Florestan Club, which included author H. L. Mencken; the Club ensured that the orchestra would be the first municipally funded company in the country. The reformed Baltimore Symphony Orchestra began in 1916, under the leadership of Gustav Strube, who conducted the orchestra until 1930. In 1942, the orchestra was reorganized as a private institution, led by Reginald Stewart, director of both the Orchestra and the Peabody, who arranged for Orchestra members to receive faculty appointments at the Peabody Conservatory, which helped attract new talent. The Orchestra claims that Joseph Meyerhoff, President of the Orchestra beginning in 1965, and his music director, Sergiu Comissiona began the modern history of the BSO and \"ensured the creation of an institution, which has become the undisputed leader of the arts community throughout the State of Maryland\". Meyerhoff and Comissiona established regular performances and a more professional atmosphere for the Orchestra. Under the next music director, David Zinman, the Orchestra recorded for major record labels, and went on several international tours, becoming the first Orchestra to tour in the Soviet bloc."]}, {"page": "CFCA (AM)", "response": ["CFCA hired Hart House musical director Reginald Stewart, to create and lead Canada's first radio orchestra, consisting of 50 musicians, for the station's regular dance program, Hour of Good Music."]}, {"page": "Albert Pratz", "response": ["Pratz started his career playing in a radio orchestra for the CFRB with conductor Alexander Chuhaldin in 1929. Throughout the 1930s he played in various orchestras including the Canadian Radio Broadcasting Commission and the CBC Radio. From 1933 to 1941 he played in the first violin section of the Toronto Symphony Orchestra. In 1937 he made his solo debut at the Promenade Symphony Concerts performing the Tchaikovsky's Violin Concerto under the baton of Reginald Stewart. He served as the conductor of the CBC's orchestra in Winnipeg from 1940 to 1943."]}, {"page": "Reginald Stewart", "response": ["Reginald Stewart may refer to:", "*Reginald Stewart (conductor), American conductor of Baltimore Symphony Orchestra in 1950s"]}, {"page": "Danzón cubano", "response": ["The Danzón was later expanded for a large orchestra in 1946. It was premiered by the Baltimore Symphony Orchestra on February 17, 1946, Reginald Stewart conducting. However, Copland revisited the piece many times during his professional career. Since then, it has been performed by many of the most important orchestras in the United States, such as the Cleveland Orchestra and the Los Angeles Symphonic Orchestra. The orchestral score was published again shortly after by Boosey & Hawkes in 1947. It was later compiled in an orchestral anthology of Copland's works, together with Quiet City, Lincoln Portrait, the Clarinet Concerto, and Three Latin-American Sketches."]}, {"page": "Norah Drewett de Kresz", "response": ["In 1922, Drewett wrote about the music scene in Berlin for Fanfare, a London-based periodical. In Canada, she played in a piano ensemble performance, with four male pianists (Ernest Seitz, Viggo Kihl, Reginald Stewart, and Alberto Guerrero) in Edmonton in 1927. She also played at the debut performance of the Conservatory String Quartet in 1929."]}]}}