{"wiki_id": "http://www.wikidata.org/entity/Q4444804", "itemLabel": "Leicester Stanhope, 5th Earl of Harrington", "itemDescription": "British Army officer and nobleman", "wikipedia_url": "https://en.wikipedia.org/wiki/Leicester_Stanhope,_5th_Earl_of_Harrington", "wikipedia_page": {"main": "Leicester FitzGerald Charles Stanhope, 5th Earl of Harrington CB (2 September 1784 – 7 September 1862), styled The Honourable Leicester Stanhope until 1851, was an English peer and soldier.", "link_mentions": [{"page": "Elvaston Castle", "response": ["The Fourth Earl and his Countess valued their garden for the romantic seclusion it afforded them, however following the death of their only son aged 4, the couple isolated themselves at the castle, never leaving and forbidding anyone from entering the grounds. (Some sources claim it was the Earl that instigated the seclusion and forbade his wife from leaving)Derby Ghosts and Paranormal - Elvaston Castle Ghosts Ghosts  Following the Fourth Earl's death in 1851, his brother, Leicester Stanhope, 5th Earl of Harrington, opened the gardens to the public. They became renowned as \"a Gothic paradise\", and are Grade II Listed."]}, {"page": "Richard Ryan (biographer)", "response": ["thumb|right|390px|Richard Ryan was editor of one of the earliest books about New Zealand, published in 1832.It is not known if Ryan travelled further than Ireland, but he was editor of several books about expeditions to countries further afield, including Greece, Australia and New Zealand. In October 1824 he edited and wrote the preface to Greece in 1823 and 1824 by Hon. Colonel Leicester Stanhope, 5th Earl of Harrington which detailed Stanhope's correspondence with the Greek committee in England. Stanhope was with Lord Byron when he died in Greece that year and accompanied Byron's body back to England. Ryan was mentioned in The Morning Chronicle as being given documents relating to the book, by Stanhope. These included \"several original letters\" written by Byron to Stanhope, as well as some journals written by Stanhope.Morning Chronicle, 2 October 1824."]}, {"page": "Charles Stanhope, 4th Earl of Harrington", "response": ["Upon his death, the earl was succeeded by his brother, Leicester Stanhope, 5th Earl of Harrington."]}, {"page": "Edward Leeson, 6th Earl of Milltown", "response": ["He married in 1871 Lady Geraldine Stanhope, daughter of the Leicester Stanhope, 5th Earl of Harrington, but had no issue. "]}, {"page": "Leicester FitzGerald Charles Stanhope, 5th Earl of Harrington", "response": ["#REDIRECT Leicester Stanhope, 5th Earl of Harrington"]}, {"page": "Leicester Stanhope", "response": ["#REDIRECT Leicester Stanhope, 5th Earl of Harrington"]}, {"page": "Leicester Stanhope, Earl of Harrington", "response": ["#REDIRECT Leicester Stanhope, 5th Earl of Harrington"]}, {"page": "William Beckett-Denison", "response": ["* Violet Katharine Beckett-Denison (1860–1883), who married Reginald Walkeline Chandos-Pole, grandson of Leicester Stanhope, 5th Earl of Harrington."]}, {"page": "Stanhope (name)", "response": ["* Leicester Stanhope, 5th Earl of Harrington (1784–1862), English peer and soldier"]}, {"page": "Sydney Stanhope, 6th Earl of Harrington", "response": ["Born Mr Sydney Seymore Hyde Stanhope at Ashburnham House in Westminster, London, Stanhope was the second son of Leicester Stanhope, 5th Earl of Harrington and Elizabeth Williams Green, and only became heir to his father's peerage following the premature death of his brother Algernon Russell Gayleard Stanhope (1838–1847). "]}, {"page": "13 Kensington Palace Gardens", "response": ["No. 13, Harrington House, was constructed for Leicester Stanhope, 5th Earl of Harrington, who is described as \"an important landowner in South Kensington\". Lord Harrington had applied for permission to build in March 1851. He was granted the lease of the plot until 1942 (91 years), for a rent of £147 a year, on condition that before January 1853, he construct a house costing no less than £6,000. Construction began in October 1851 and by July 1853, the Earl was living at the house."]}, {"page": "St Bartholomew's Church, Elvaston", "response": ["*Leicester Stanhope, 5th Earl of Harrington (d. 1862)"]}, {"page": "Charles James Richardson", "response": ["From 1845 to 1852 Richardson was master of the architectural class in the school of design at Somerset House. In 1852 he designed Leicester Stanhope, 5th Earl of Harrington's mansion 13 Kensington Palace Gardens; in 1853 he carried out works at Belsize Park, Hampstead, and in 1856 a block of mansions in Queen's Gate, Hyde Park, for W. Jackson. He died in 1871."]}]}}