{"wiki_id": "http://www.wikidata.org/entity/Q4441320", "itemLabel": "Lee Stafford", "itemDescription": "British hairdresser", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Stafford", "wikipedia_page": {"main": "Lee Stafford (born 17 October 1966) is an English celebrity hairdresser.", "link_mentions": [{"page": "Tamara Beckwith", "response": ["In 2007, she appeared on the BBC's reality TV programme Celebrity Scissorhands where Lee Stafford trained celebrities to cut hair, raising money as part of the BBC charity Children in Need.Lee Stafford, Celebrity Scissorhands, accessed 1 November 2007 Beckwith has also appeared in The Vagina Monologues.Tamara Beckwith, presenter and actor, accessed 1 November 2007"]}, {"page": "Jessica-Jane Clement", "response": ["In 2015, she appeared in the Channel 4 documentary show, The Auction House, with her husband, Lee Stafford.", "On 17 February 2013, Clement married hairdresser Lee Stafford. Jessica gave birth to their first child, a son named Angel, in June 2014. She gave birth to their second child, a daughter named Elvis Annie-Jane, in January 2016. In April 2017 she gave birth to their third child, a girl named Sugar May, and a fourth, a boy named Valentine Love, followed in February 2020."]}, {"page": "Celebrity Scissorhands", "response": ["Celebrity Scissorhands is a reality show that is part of the BBC's Children in Need charity campaign, in which celebrities attempt to cut people's hair to raise money for the campaign while trained and watched by professional hairdresser Lee Stafford. It is produced by Endemol, and the format is similar to their previous production The Salon.", "The first series began airing on BBC Three on 5 November 2006; BBC One began airing it in late night on 12 November; and it ran for two weeks, culminating on 17 November, the annual Children in Need night, when it aired as part of the Children in Need telethon on BBC One. It was hosted by Alex Zane. The celebrities were trained by Lee Stafford, a leading hairdresser, at a hair and beauty academy set up at the BBC Television Centre in London which was opened to the public on 4 November. BBC stars and ordinary people had makeovers performed at the academy.", "The second series was shown on BBC Three from 25 October to 15 November 2007. Lee Stafford returned as manager of the salon and first series winner Steve Strange also returned as assistant manager. George Lamb presented the show. Kelly Condron voiced the series.", "Lee Stafford returned as manager of the salon, with series 1 winner Steve Strange back as assistant manager'Scissorhands' contestants unveiled - TV News - Digital Spy and George Lamb again hosting the show."]}, {"page": "Children in Need 2007", "response": ["A second series of Celebrity Scissorhands was shown in the run up to the 2007 event, this year featuring celebrity hairdresser Lee Stafford. The winner was Ninia Benjamin with Aled Haydn Jones as the runner up."]}, {"page": "Nicky Clarke", "response": ["In 2002 Clarke was a guest panelist on Will Self's team for an episode of Shooting Stars; his team went on to win that episode. Clarke was also a member of \"Team Dec\" in Ant & Dec's Saturday Night Takeaway. In 2011, he took part in ITV series 71 Degrees North but was the first to be eliminated. In January 2014, he took part in the Channel 4 series The Jump. In 2016, he was a contestant on Pointless Celebrities, the celebrity edition of the British quiz show Pointless, with fellow celebrity hairstylist Lee Stafford."]}, {"page": "Children in Need 2008", "response": ["A third series of Celebrity Scissorhands was shown in the run up to the 2008 event, again featuring celebrity hairdresser Lee Stafford and Steve Strange as lead stylist. The winner was Sabrina Washington with Jeff Leach as the runner up."]}, {"page": "Nina's Hair Parlour", "response": ["Butkovich-Budden was interviewed on BBC Radio 4's Woman's Hour alongside Nicky Clarke and her entire team appeared on the BBC's Children In Need show Celebrity Scissorhands alongside Lee Stafford and late Steve Strange, as vintage hair and makeup experts."]}, {"page": "Big Brother (British series 11)", "response": ["Housemates being served breakfast in bed by ex-Celebrity Big Brother housemate Anthea Turner, Housemates being treated to a pampering session, Housemates being treated to having their hair done by professional stylist Lee Stafford and his assistant Jo, Housemates having a three-course meal cooked for them by Nancy Lam and housemates being treated to an exclusive performance by Simon Webbe, singing his new single 'Casanova'."]}, {"page": "Stafford (surname)", "response": ["*Lee Stafford (born 1966), celebrity hairdresser"]}, {"page": "List of hairdressers", "response": ["* Lee Stafford — leading British hairdresser from 1998, his clients include Victoria Beckham."]}, {"page": "Dangerous Game (2017 film)", "response": ["*Lee Stafford as Viktor"]}]}}