{"wiki_id": "http://www.wikidata.org/entity/Q44490", "itemLabel": "John Henry Newman", "itemDescription": "English cleric, cardinal and saint", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Henry_Newman", "wikipedia_page": {"main": "John Henry Newman (21 February 1801 – 11 August 1890) was an English theologian, scholar and poet, first an Anglican priest and later a Catholic priest and cardinal, who was an important and controversial figure in the religious history of England in the 19th century. He was known nationally by the mid-1830s, and was canonised as a saint in the Catholic Church in 2019.\nOriginally an evangelical University of Oxford academic and priest in the Church of England, Newman became drawn to the high-church tradition of Anglicanism. He became one of the more notable leaders of the Oxford Movement, an influential and controversial grouping of Anglicans who wished to return to the Church of England many Catholic beliefs and liturgical rituals from before the English Reformation. In this, the movement had some success. After publishing his controversial \"Tract 90\" in 1841, Newman later wrote, \"I was on my death-bed, as regards my membership with the Anglican Church\". In 1845 Newman, joined by some but not all of his followers, officially left the Church of England and his teaching post at Oxford University and was received into the Catholic Church. He was quickly ordained as a priest and continued as an influential religious leader, based in Birmingham. In 1879, he was created a cardinal by Pope Leo XIII in recognition of his services to the cause of the Catholic Church in England. He was instrumental in the founding of the Catholic University of Ireland (CUI) in 1854, although he had left Dublin by 1859. CUI in time evolved into University College Dublin.Newman was also a literary figure: his major writings include the Tracts for the Times (1833–1841), his autobiography Apologia Pro Vita Sua (1865–1866), the Grammar of Assent (1870), and the poem The Dream of Gerontius (1865), which was set to music in 1900 by Edward Elgar. He wrote the popular hymns \"Lead, Kindly Light\", \"Firmly I believe, and truly\" (taken from Gerontius), and \"Praise to the Holiest in the Height\" (taken from Gerontius).\nNewman's beatification was officially proclaimed by Pope Benedict XVI on 19 September 2010 during his visit to the United Kingdom. His canonisation was officially approved by Pope Francis on 12 February 2019, and took place on 13 October 2019.He is the fifth saint of the City of London, behind Thomas Becket (born in Cheapside), Thomas More (born on Milk Street), Edmund Campion (son of a London book seller) and Polydore Plasden (of Fleet Street).", "link_mentions": {}}}