{"wiki_id": "http://www.wikidata.org/entity/Q444953", "itemLabel": "Richard Lydekker", "itemDescription": "English naturalist, geologist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Lydekker", "wikipedia_page": {"main": "Richard Lydekker (; 25 July 1849 – 16 April 1915) was an English naturalist, geologist and writer of numerous books on natural history.\n\n", "link_mentions": [{"page": "Dhole", "response": ["Two years later, Smith connected this word with  'mad, crazy', and erroneously compared the Turkish word with  and  (cfr. also ; ), which are in fact from the Proto-Germanic *dwalaz 'foolish, stupid'. Richard Lydekker wrote nearly 80 years later that the word was not used by the natives living within the species' range. The Merriam-Webster Dictionary theorises that it may have come from the  ('wolf').dhole. Merriam-Webster Dictionary.", "Brian Houghton Hodgson kept captured dholes in captivity, and found, with the exception of one animal, they remained shy and vicious even after 10 months. According to Richard Lydekker, adult dholes are nearly impossible to tame, though pups are docile and can even be allowed to play with domestic dog pups until they reach early adulthood. A dhole may have been presented as a gift to Ibbi-Sin as tribute.McIntosh, J. (2008). The ancient Indus Valley: new perspectives, p. 130, ABC-CLIO, "]}, {"page": "Pterodactylus", "response": ["In 1815, the generic name Ptéro-Dactyle was latinized to Pterodactylus by Constantine Samuel Rafinesque. Unaware of Rafinesque's publication however, Cuvier himself in 1819 latinized the name Ptéro-Dactyle again to Pterodactylus, but the specific name he then gave, longirostris, has to give precedence to von Sömmerring's antiquus. In 1888, English naturalist Richard Lydekker designated Pterodactylus antiquus as the type species of Pterodactylus, and considered Ornithocephalus antiquus a synonym. He also designated specimen BSP AS.I.739 as the holotype of the genus."]}, {"page": "Whale", "response": ["thumb|right|Sperm whale skeleton. Richard Lydekker, 1894."]}, {"page": "List of biologists", "response": ["*Richard Lydekker (1849–1915), English naturalistAbbreviation in zoology: Lydekker influential in the science of biogeography"]}, {"page": "Baphetidae", "response": ["Baphetids were first described by Edward Drinker Cope when he erected the family Baphetidae in 1865 for Baphetes. Richard Lydekker named Loxomatinae in 1889 for Loxomma, which later became known as Loxommatidae. D. M. S. Watson described the group as Loxommidae in 1917. Later studies have shown Baphetes and Loxomma to be close relatives within the same family, and because Baphetidae was named before Loxommatidae, it has seniority and is the valid name of the group."]}, {"page": "Gaur", "response": ["* B. g. readei described by Richard Lydekker in 1903 based on a specimen from Myanmar is thought to range from Upper Myanmar to Tanintharyi Region;"]}]}}