{"wiki_id": "http://www.wikidata.org/entity/Q444380", "itemLabel": "Imogen Holst", "itemDescription": "English composer, arranger, conductor, teacher and festival administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Imogen_Holst", "wikipedia_page": {"main": "Imogen Clare Holst  (née von Holst; 12 April 1907 – 9 March 1984) was a British composer, arranger, conductor, teacher, musicologist, and festival administrator. The only child of the composer Gustav Holst, she is particularly known for her educational work at Dartington Hall in the 1940s, and for her 20 years as joint artistic director of the Aldeburgh Festival. In addition to composing music, she wrote composer biographies, much educational material, and several books on the life and works of her father.\nFrom a young age, Holst showed precocious talent in composing and performance. After attending Eothen School and St Paul's Girls' School, she entered the Royal College of Music, where she developed her skills as a conductor and won several prizes for composing. Unable to follow her initial ambitions to be a pianist or a dancer due to health reasons, Holst spent most of the 1930s teaching, and as a full-time organiser for the English Folk Dance and Song Society. These duties reduced her compositional activities, although she made many arrangements of folksongs. After serving as an organiser for the Council for the Encouragement of Music and the Arts at the start of the Second World War, in 1942 she began working at Dartington. In her nine years there she established Dartington as a major centre of music education and activity.\nIn the early 1950s Holst became Benjamin Britten's musical assistant, moved to Aldeburgh, and began helping with the organisation of the annual Aldeburgh Festival. In 1956 she became joint artistic director of the festival, and during the following 20 years helped it to a position of pre-eminence in British musical life. In 1964 she gave up her work as Britten's assistant, to resume her own compositional career and to concentrate on the preservation of her father's musical legacy. Her own music is not widely known and has received little critical attention; much of it is unpublished and unperformed. The first recordings dedicated to her works, issued in 2009 and 2012, were warmly received by critics. She was appointed CBE in 1975 and received numerous academic honours. She died at Aldeburgh and is buried in the churchyard there.", "link_mentions": {}}}