{"wiki_id": "http://www.wikidata.org/entity/Q4454134", "itemLabel": "John Millar Watt", "itemDescription": "British illustrator, painter and comic artist (1895-1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Millar_Watt", "wikipedia_page": {"main": "John Millar Watt (14 October 1895 – 13 December 1975) was a British painter, illustrator and comics artist who created the comic strip Pop.", "link_mentions": [{"page": "Look and Learn", "response": ["The illustrators who worked on the magazine included Fortunino Matania, John Millar Watt, Peter Jackson, John Worsley, Ron Embleton, Gerry Embleton, C. L. Doughty, Wilf Hardy, Dan Escott, Angus McBride, Oliver Frey, James E. McConnell, Kenneth Lilly, R. B. Davis and Clive Uptton."]}, {"page": "Ranger (magazine)", "response": ["* Treasure Island, drawn by John Millar Watt (based on the novel by Robert Louis Stevenson)"]}, {"page": "Westminster School of Art", "response": ["* John Millar Watt"]}, {"page": "1920s in comics", "response": ["* May 20: John Millar Watt's Pop debuts as Reggie Breaks It Gently."]}, {"page": "1975 in comics", "response": ["* December 13: John Millar Watt, British comics artist (Pop), dies at age 80."]}, {"page": "John Millar", "response": ["*John Millar Watt (1895–1975), Scottish artist"]}, {"page": "List of newspaper comic strips P–Z", "response": ["* Pop (1921–1960) originally by John Millar Watt (UK)"]}, {"page": "John Watt", "response": ["*John Millar Watt (1895–1975), British painter, illustrator and comics artist"]}, {"page": "British girls' comics", "response": ["* John Millar Watt — Princess (Daughters of Adventure, The Scarlet Pimpernel)"]}, {"page": "Princess (comics)", "response": ["True to its name, Princess featured a serial called Famous Royal Daughters by Marjorie Coryn and illustrated by John Millar Watt. Writers whose work was abridged in Princess included Joan Aiken, John Wyndham, Enid Blyton, Sylvia Thorpe, J. R. R. Tolkien, P. L. Travers, T. H. White, and Noel Streatfeild. Other contributors to Princess included David Attenborough, Scott Goodall, Pat Smythe, H. M. Brock, and Tom Kerr.", "* Daughters of Adventure by Marjorie Coryn and John Millar Watt", "* Famous Royal Daughters (1960–1967) by Marjorie Coryn, illustrated by John Millar Watt — continued as the center spread of Princess Tina", "* The Scarlet Pimpernel by John Millar Watt"]}]}}