{"wiki_id": "http://www.wikidata.org/entity/Q445924", "itemLabel": "Alexander Ball", "itemDescription": "British admiral and Governor of Malta (1757-1809)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Ball", "wikipedia_page": {"main": "Sir Alexander John Ball, 1st Baronet (Italian: Alessandro Giovanni Ball, 1757 – 25 October 1809) was a Rear-Admiral and Civil Commissioner of Malta. He was born in Ebworth Park, Sheepscombe, Gloucestershire. He was the fourth son of Robert and Mary (Dickinson) Ball and the younger brother of Ingram Ball.", "link_mentions": [{"page": "Malta", "response": ["On 28 October 1798, Captain Sir Alexander Ball successfully completed negotiations with the French garrison on Gozo, the 217 French soldiers there agreeing to surrender without a fight and transferring the island to the British. The British transferred the island to the locals that day, and it was administered by Archpriest Saverio Cassar on behalf of Ferdinand III of Sicily. Gozo remained independent until Cassar was removed from power by the British in 1801.", "General Claude-Henri Belgrand de Vaubois surrendered his French forces in 1800. Maltese leaders presented the main island to Sir Alexander Ball, asking that the island become a British Dominion. The Maltese people created a Declaration of Rights in which they agreed to come \"under the protection and sovereignty of the King of the free people, His Majesty the King of the United Kingdom of Great Britain and Ireland\". The Declaration also stated that \"his Majesty has no right to cede these Islands to any power...if he chooses to withdraw his protection, and abandon his sovereignty, the right of electing another sovereign, or of the governing of these Islands, belongs to us, the inhabitants and aborigines alone, and without control.\""]}, {"page": "September 11", "response": ["*1800 – The Maltese National Congress Battalions are disbanded by British Civil Commissioner Alexander Ball."]}, {"page": "Samuel Taylor Coleridge", "response": ["In 1804, he travelled to Sicily and Malta, working for a time as Acting Public Secretary of Malta under the Civil Commissioner, Alexander Ball, a task he performed successfully. He lived in San Anton Palace in the village of Attard.  He gave this up and returned to England in 1806. Dorothy Wordsworth was shocked at his condition upon his return. From 1807 to 1808, Coleridge returned to Malta and then travelled in Sicily and Italy, in the hope that leaving Britain's damp climate would improve his health and thus enable him to reduce his consumption of opium. Thomas De Quincey alleges in his Recollections of the Lakes and the Lake Poets that it was during this period that Coleridge became a full-blown opium addict, using the drug as a substitute for the lost vigour and creativity of his youth.  It has been suggested that this reflects De Quincey's own experiences more than Coleridge's."]}, {"page": "List of colonial governors in 1799", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1799–1801)"]}, {"page": "List of colonial governors in 1800", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1799–1801)"]}, {"page": "List of colonial governors in 1801", "response": ["*# Alexander Ball, Civil Commissioner of Malta (1799–1801)"]}, {"page": "List of colonial governors in 1802", "response": ["*# Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1803", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1804", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1805", "response": ["* Malta – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1806", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1807", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1808", "response": ["* Malta – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "List of colonial governors in 1809", "response": ["* Malta Protectorate – Alexander Ball, Civil Commissioner of Malta (1802–1809)"]}, {"page": "Claude-Henri Belgrand de Vaubois", "response": ["Still, on 18 September, a Portuguese squadron of four ships began a blockade of Malta. That blockade - although varying in the number and national composition of the ships - continued until the French surrendered.  Nelson dispatched British forces under the command of Captain Alexander Ball, who arrived on 12 October 1798. The Maltese insurrectionist forces forced the French to withdraw to Valletta and the Three Cities around the Grand Harbour. On 28 October Gozo Island fell as the French commander there surrendered himself and his 217 men to Captain Ball. With General Vaubois's forces besieged in Valletta, Captain Ball's ships continued the blockade. Expecting the imminent French capitulation, Nelson wrote to Ball in January 1799:", "The siege was nearing its end. The French garrison had eaten all the horses, the mules, the dogs, the cats and the rats of Valletta. Finally, on 4 September 1800, Vaubois sent an emissary under a flag of truce to the British commander Major-General Henry Pigot. The following day, Pigot and Captain George Martin, RN, negotiated terms of surrender with General Vaubois and contre-amiral Villeneuve. (Ironically the French excluded Captain Alexander Ball, as chief of the Maltese, from the negotiations, as the French did not want to surrender to the Maltese.) The British granted Vaubois and the French fair terms and the honors of war, including the right to keep their arms and spoils. General Vaubois and his troops were quickly repatriated to Marseilles.", "*mostly about Nelson and also Alexander Ball. But their adversaries feature there too"]}, {"page": "Żejtun", "response": ["Four buildings in Żejtun – the old church of St. Gregory, a villa belonging to Bishop Vincenzo Labini, and two villas belonging to Count Agostino Formosa de Fremaux (Palazzo Fremaux and Villa Arrigo) – were used as hospitals for invalids in the insurgency against the French. Captain Alexander Ball, stayed at Żejtun on 15 January 1799, in order to meet with the leader of a group of irregulars, Vincenzo Borg \"Brared\". The meeting was not held due to the latter's ill health. In recognition of the villagers’ participation in the revolt against the French, a garden was built in 1802 by Alexander Ball, then British High Commissioner, as a gift to the leading representative of Żejtun, Ġuzè Abela. The garden, named Ġnien il-Kmand, served for administrative and embellishment purposes. The garden was designed by Michele Cachia. "]}, {"page": "Connections (British documentary)", "response": ["# \"Feedback\" – Electronic agents on the internet and wartime guns use feedback techniques discovered in the first place by Claude Bernard, whose vivisection experiments kick off animal rights movements called humane societies that really start out as lifeboat crews rescuing people from all the shipwrecks happening because of all the extra ships out there that are using Matthew Maury's data on wind and currents transmitted by the radio telegraph, invented by Samuel Morse, who is also a painter whose hero is Washington Allston, who spends time in Italy with Samuel Taylor Coleridge, who comes to Malta and spies for the governor Alexander Ball, who saved Admiral Horatio Nelson's skin so he can go head over heels for Emma Hamilton in Naples, resulting in an illegitimate son. Emma became notable in the Electrico-Magnetico Celestial Bed, where you go regain your fertility through electricity, and you can get more whisky thanks to Joseph Black, who determined the latent heat of vaporisation in steam. James Watt borrowed that information to make a better steam engine. Watt is linked to Roebuck who discovered chlorine bleach which eventually is used to make white paper. The paper is used for decorating walls by William Morris, who is a socialist with Annie Besant, who is a vegetarian just like the Seventh-day Adventists. And we end up with W.K. Kellogg's cornflakes."]}, {"page": "Battle of Groix", "response": ["All three captured ships were taken into the Royal Navy. The name of Alexandre reverted to the former Alexander, and although James suggests that the ship was never again fit for frontline service, this claim is refuted by Alexander's presence in the line at the Battle of the Nile in 1798 under Captain Alexander Ball.Winfield, p. 51 Tigre retained her French name, while Formidable, as there was already a ship by that name in the Royal Navy, became HMS Belleisle, apparently due to confusion between the islands of Groix and Belle Île in the aftermath of the battle.James, p. 250 Belleisle had a long and successful career, fighting at the Battle of Trafalgar in 1805 under Captain William Hargood."]}, {"page": "Fort Saint Elmo", "response": ["*Conception Bastion, also known as Ball's Bastion – a small pentagonal bastion, containing a number of gun emplacements, magazines, and gun crew accommodation. Sir Alexander Ball was buried in the salient of the bastion."]}, {"page": "List of people on the postage stamps of Malta", "response": ["*Captain Alexander Ball R.N. (1999)"]}, {"page": "HMS Alexander (1778)", "response": ["The Alexander took part in the Battle of the Nile in 1798, under the command of Captain Alexander Ball. On the evening of 1 August 1798, half an hour before sunset, the battle began. She was the second ship to fire upon the French fleet, engaging the flagship, L'Orient. The Alexander sank three French ships before she had to withdraw due to a small fire on board. The Alexander was one of the few ships not carrying a detachment of soldiers."]}, {"page": "Castellania (Valletta)", "response": ["After a successful Maltese uprising against the French occupation, in 1800 Malta became a British protectorate, with the Castellania becoming known as the Gran Corte della Valletta. It was amongst the first public institutions to be reestablished. The documents of the Tribunale della Gran Corte della Castellania were given by Government Alexander Ball to the Gran Corte Vescovile (Court of the Bishop) with other documents of the church and the Inquisition at the request of the ecclesiastic authorities. Apart from those of the Court of the Bishop, the others (including those of the Castellania) were all found to be irrelevant to the church and were transferred to the Palace of the Inquisition in Birgu. The documents of the Tribunale della Valletta were likely transferred to the palace of the Inquisition by mistake but those arriving there never saw their way back to Valletta since. On 8 March 1805, a proclamation declared the restoration of the Courts of Justice. In February 1806, Ball gave instructions to presumably guarantee independence of the Judiciary, whereas the Judges could not be removed at a simple request, and legal persons would not be threatened to be jailed if they disagree with signing legal documents. At the request of the Maltese National Congress, the law was once again reformed to the ancient rights and the Code De Rohan.", "Maltese courts became  on 5 October 1813, months before the Treaty of Paris of 1814, when Malta became a Crown colony. Soon after, in 1813, Civil Commissioner Alexander Ball terminated and transferred the judicial power of the Corte Capitanale of Mdina to the Castellania in Valletta."]}, {"page": "Postage stamps and postal history of Malta", "response": ["After a few months of French occupation, a rebellion broke out and the British, Portuguese and Neapolitans assisted the Maltese rebels. On 7 October 1799 Alexander Ball, the British Civil Commissioner of Malta, issued a notice which set up a mail delivery service in the rebel-held parts of Malta. Some rooms in San Anton Palace were used as a post office, and mail was sent to Sicily every week. After Malta had become a British protectorate in 1800, the Island Post Office was established as a government department handling inland mail and ship letters, and it continued to be housed at the Casa del Commun Tesoro. The Chief Secretariat's Office took responsibility of the Post Office in 1815. Starting from 1819, the Island Post Office used various handstamps reading Malta P Paid, Malta Post Paid or Malta Post Office on mail."]}]}}