{"wiki_id": "http://www.wikidata.org/entity/Q4458236", "itemLabel": "Alexander Titov", "itemDescription": "Rock musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Titov_(rock_musician)", "wikipedia_page": {"main": "Alexander Valentinovich Titov (Russian: Алекса́ндр Валенти́нович Тито́в; born 18 July 1957) is a Russian rock musician, known for his role as bassist of the band Aquarium, a position previously held by Fan (Michael Feinstein-Vasiliev). He has also performed with the bands Avgust, Pop-Mekhanika, and Kino. He was born in Leningrad. Alexander Titov is married to British musician and linguist Elena Titov. They have two children, Anna and Catherine.", "link_mentions": [{"page": "Aquarium (band)", "response": ["Aquarium's lineup in 2017 consisted of Boris Grebenshchikov, Andrey Surotdinov (violin), Alexey Zubarev (guitars), Alexander Titov (bass), Liam Bradley (drums) and Brian Finnegan (flute)."]}, {"page": "Kino (band)", "response": ["In 1984, Kino released their sophomore album, Nachalnik Kamchatki (). The title was inspired by Tsoi's job as a boiler plant operator (\"nachalnik\" means 'chief' or 'boss,' and \"Kamchatka\" is slang for 'a very faraway place' – but also a folk name for the boiler plant where Tsoi worked, now his museum), as well as a reference to the 1967 Soviet comedy Nachalnik Chukotki (). Again, Grebenshchikov served as a producer and brought many of his friends to help with the record. Among them were Alexander Titov (bass guitar), Sergey Kuryokhin (keyboards), Pyotr Troshchenkov (drums), Vsevolod Gakkel (cello), Igor Butman (sax), and Andrey Radchenko (drums). Grebenshchikov played a small keyboard instrument. The album was minimalist in style, with sparse arrangements and usage of fuzz effects on Kasparyan's guitar. \"The album was electric and somewhat experimental in sound and form. I cannot say that the sound and style orientation turned out the way we'd like to see it, but from the point of view of the experiment, it looked interesting,\" said Tsoi later.Andrew Burlaka. Volume II. Kino / / Rock Encyclopedia. Popular Music in Leningrad-St Petersburg 1965–2005 . – M.: Amphora, 2007. – 416 p. – ", "In 2019, the band announced a reunion with concerts planned in the fall of 2020 for the first time in 30 years. It would feature the band's guitarist Yuri Kasparyan and bass guitarists Alexander Titov and Igor Tikhomirov. It would also use Viktor's voice, digitized from original multichannel recordings, and be accompanied by a \"unique video sequence\". Viktor Tsoi's son, Alexander, became the band's producer. However, due to the COVID-19 pandemic, the concerts were postponed to 2021."]}, {"page": "Nachalnik Kamchatki", "response": ["*Alexander Titov – bass guitar, percussion"]}, {"page": "Alexander Titov", "response": ["Alexander Titov may refer to:", "* Alexander Titov (conductor) (born 1954), Russian conductor working regularly with orchestras in St Petersburg, Moscow,and with the BBC Scottish Symphony Orchestra", "* Alexander Titov (ice hockey) (born 1975), retired Russian ice hockey defenceman", "* Alexander Titov (rock musician) (born 1957), Russian rock musician"]}, {"page": "Roksi (periodical)", "response": ["Roksi featured coverage of both Anglo-American and Soviet rock music. Features included editorials, rumor columns, the 'Lengortop' hit parade, interviews with musicians, and translated articles from Western sources, such as Rolling Stone. As the Soviet rock scene grew, local rock news and reviews made up more of the journal's content. Musicians and cultural figures interviewed included Yuri Il'chenko of Mify and Mashina Vremeni, Mike Naumenko, Andrey \"Svin\" Panov of Avtomaticheskie udovletvoriteli, ex-Kino guitarist Aleksei Rybin, ex-Strannye Igry member Aleksandr Davydov, Boris Grebenshchikov, Yuri Morozov, Alexander Titov, Mikhail ‘Fan’ Vasil’ev of Akvarium and Zoopark, Konstantin Kinchev, Vladimir Rekshan of Sankt-Peterburg, Viktor Tsoi, Mikhail Borzykin of Televizor, Leonid Fedorov and Sergei Rogoshkin of Auktyon, sound engineer Andrei Tropillo, Aleksandr Bashlachev, Aleksandr Lipnitsky of Zvuki Mu, and Andrey Makarevich."]}, {"page": "Pop-Mechanics", "response": ["*Alexander Titov — bass guitar"]}]}}