{"wiki_id": "http://www.wikidata.org/entity/Q445538", "itemLabel": "Colin Clive", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Clive", "wikipedia_page": {"main": "Colin Clive (born Colin Glenn Clive-Greig; 20 January 1900 – 25 June 1937) was a British stage and screen actor. His most memorable role was Henry Frankenstein, the creator of the monster, in the 1931 film Frankenstein and its 1935 sequel, Bride of Frankenstein.", "link_mentions": [{"page": "June 25", "response": ["*1937 – Colin Clive, British actor (b. 1900)"]}, {"page": "January 20", "response": ["*  1900   – Colin Clive, English actor (d. 1937)"]}, {"page": "James Whale", "response": ["In 1928 Whale was offered the opportunity to direct two private performances of R. C. Sherriff's then-unknown play Journey's End for the Incorporated Stage Society, a theatre society that mounted private Sunday performances of plays. Set over a four-day period in March 1918 in the trenches at Saint-Quentin, France, Journey's End gives a glimpse into the experiences of the officers of a British infantry company in World War I. The key conflict is between Capt. Stanhope, the company commander, and Lt. Raleigh, the brother of Stanhope's fiancée.Green, et al., p. 272. Whale offered the part of Stanhope to the then barely known Laurence Olivier. Olivier initially declined the role,Cottrell, p. 53. but after meeting the playwright agreed to take it on. Maurice Evans was cast as Raleigh. The play was well received and transferred to the Savoy Theatre in London's West End, opening on 21 January 1929. A young Colin Clive was now in the lead role,Williamson, p. 29. Olivier having accepted an offer to take the lead in a production of Beau Geste.Coleman, p. 31. The play was a tremendous success, with critics uniform and effusive in their praise and with audiences sometimes sitting in stunned silence following its conclusion only to burst into thunderous ovations.Curtis, p. 70. As Whale biographer James Curtis wrote, the play \"managed to coalesce, at the right time and in the right manner, the impressions of a whole generation of men who were in the war and who had found it impossible, through words or deeds, to adequately express to their friends and families what the trenches had been like\".Curtis, p. 71. After three weeks at the Savoy, Journey's End transferred to the Prince of Wales Theatre, where it ran for the next two years.Coleman, p. 32.", "Having purchased the film rights to Journey's End, British producers Michael Balcon and Thomas Welsh agreed that Whale's experience directing the London and Broadway productions of the play made him the best choice to direct the film. The two partnered with a small American studio, Tiffany-Stahl, to shoot it in New York.Low, et al. p. 171. Colin Clive reprised his role as Stanhope, and David Manners was cast as Raleigh.Kelly (1997), p. 65. Filming got underway on 6 December 1929Curtis, p. 98. and wrapped on 22 January 1930.Curtis, p. 102. Journey's End was released in Great Britain on 14 April and in the United States on 15 April.Curtis, p. 104. On both sides of the Atlantic the film was a tremendous critical and commercial success.Curtis, pp 104–05", "In 1931, Universal chief Carl Laemmle, Jr. offered Whale his choice of any property the studio owned. He chose Frankenstein, mostly because none of Universal's other properties particularly interested him, and he wanted to make something other than a war picture.Skal, p. 129. While Mary Shelley's 1818 novel Frankenstein; or, The Modern Prometheus itself was in the public domain, Universal owned the filming rights to a stage adaptation by Peggy Webling. Whale cast Colin Clive as Henry Frankenstein and Mae Clarke as his fiancée Elizabeth. For the Monster, he turned to the little known Boris Karloff, who had wide-ranging experience in supporting roles. Shooting began on 24 August 1931 and wrapped on 3 October.Buehrer, p. 89. Previews were held 29 October,Curtis, p. 151. with wide release on 21 November.Curtis, p. 153. Frankenstein was an instant hit with critics and the public. The film received glowing reviews and shattered box office records across the United States,Curtis, p. 157. earning Universal $12 million on first release.", "With knowledge of his sexuality becoming more common beginning in the 1970s, some film historians and gay studies scholars have detected homosexual themes in Whale's work, particularly in Bride of Frankenstein in which a number of the creative people associated with the cast, including Ernest Thesiger and Colin Clive, were alleged to be gay or bisexual. Scholars have identified a gay sensibility suffused through the film, especially a camp sensibility,Skal, p. 184. particularly embodied in the character of Pretorius (Thesiger) and his relationship with Henry Frankenstein (Clive). Minnie introduces Pretorius to Frankenstein with the line, \"He's a very queer-looking old gentleman,sir....\" at 16:56 in the film."]}, {"page": "1900", "response": ["** Colin Clive, American actor (d. 1936)"]}, {"page": "1937", "response": ["** Colin Clive, British actor (b. 1900)"]}, {"page": "John Galsworthy", "response": ["One More River (a film version of Galsworthy's Over the River) was filmed by James Whale in 1934. The film starred Frank Lawton, Colin Clive (one of Whale's most frequently used actors) and Diana Wynyard, and featured Mrs. Patrick Campbell in a rare sound film appearance."]}, {"page": "Bride of Frankenstein", "response": ["Bride of Frankenstein is a 1935 American science fiction horror film, and the first sequel to Universal Pictures' 1931 film Frankenstein. As with the first film, Bride of Frankenstein was directed by James Whale and stars Boris Karloff as the Monster. The sequel features Elsa Lanchester in the dual role of Mary Shelley and the titular character at the end of the film. Colin Clive reprises his role as Henry Frankenstein, and Ernest Thesiger plays the role of Doctor Septimus Pretorius.", "* Colin Clive as Henry Frankenstein", "Colin Clive and Boris Karloff reprised their roles from Frankenstein as creator and creation, respectively. Hobson recalled Clive's alcoholism had worsened since filming the original, but Whale did not recast the role because his \"hysterical quality\" was necessary for the film. Karloff strongly objected to the decision to allow the Monster to speak. \"Speech! Stupid! My argument was that if the monster had any impact or charm, it was because he was inarticulate – this great, lumbering, inarticulate creature. The moment he spoke you might as well ... play it straight.\"Gifford, p. 55 This decision also meant that Karloff could not remove his dental plate, so now his cheeks did not have the sunken look of the original film. Whale and the studio psychiatrist selected 44 simple words for the Monster's vocabulary by looking at test papers of ten-year-olds working at the studio. Dwight Frye returned to play the doctor's assistant, Karl, having played the hunchback Fritz in the original. Frye also filmed a scene as an unnamed villager and the role of \"Nephew Glutz\", a man who murdered his uncle and blamed the death on the Monster. Boris Karloff is credited simply as KARLOFF, which was Universal's custom during the height of his career. Elsa Lanchester is credited for Mary Wollstonecraft Shelley, but in a nod to the earlier film, the Monster's bride is credited only as \"?\" just as Boris Karloff had been in the opening credits of Frankenstein.", "right|thumb|360px|Colin Clive, Elsa Lanchester, Boris Karloff, and Ernest Thesiger", "In the decades since its release, modern film scholars have noted the possible queer reading of the film. Director James Whale was openly gay, and some of the actors in the cast, including Ernest Thesiger and Colin Clive, were gay or bisexual. Although James Curtis, Whale's biographer, rejects the notion that Whale would have identified with the Monster from a homosexual perspective,Curtis, p. 144 scholars have perceived a gay subtext suffused through the film, especially a camp sensibility,Skal, p. 184 particularly embodied in the character of Pretorius and his relationship with Henry."]}, {"page": "Frankenstein (1931 film)", "response": ["Frankenstein stars Colin Clive as Henry Frankenstein, an obsessed scientist who digs up corpses with his assistant in order to assemble a living being from body parts. The resulting creature, often known as Frankenstein's monster, is portrayed by Boris Karloff. The make-up for the monster was provided by Jack Pierce. Alongside Clive and Karloff, the film's cast also includes Mae Clarke, John Boles, Dwight Frye, and Edward Van Sloan.", "* Colin Clive as Henry Frankenstein"]}, {"page": "A Nice Place to Visit", "response": ["In 1965, a slightly modified version of this story was broadcast on the radio program Theater Five. \"The Land of Milk and Honey\", episode number 154, retained all of the important aspects of this episode, including the innuendos and the surprise ending. On November 14, 1935, the radio program The Fleischmann's Yeast Hour hosted by Rudy Vallee broadcast a play titled The Other Place starring Colin Clive and Leo G. Carroll. It was written by John Balderston and dealt with a similar theme."]}, {"page": "Valerie Hobson", "response": ["In 1935, aged 17, she appeared as Baroness Frankenstein in Bride of Frankenstein with Boris Karloff and Colin Clive. She played opposite Henry Hull that same year in Werewolf of London, the first Hollywood werewolf film. The latter half of the 1940s saw Hobson in perhaps her two most memorable roles: as the adult Estella in David Lean's adaptation of Great Expectations (1946), and as the refined and virtuous Edith D'Ascoyne in the black comedy Kind Hearts and Coronets (1949)."]}, {"page": "Robert Clive", "response": ["* The film Clive of India, based on Minney's play, was released in 1935, and starred Ronald Colman, Loretta Young, and Colin Clive, his descendant."]}, {"page": "Gods and Monsters (film)", "response": ["* Matt McKenzie as Colin Clive"]}, {"page": "1937 in film", "response": ["* June 25  – Colin Clive, 37, British actor, Frankenstein, Bride of Frankenstein"]}, {"page": "1934 in film", "response": ["*Jane Eyre, starring Virginia Bruce and Colin Clive"]}, {"page": "1931 in film", "response": ["*Frankenstein, directed by James Whale, starring Boris Karloff, Colin Clive and Mae Clarke"]}, {"page": "Saint-Malo", "response": ["* Colin Clive (1900–1937), actor"]}, {"page": "Lady Constance Malleson", "response": ["Malleson appeared in many West End productions, including The Orphans at the Lyceum Theatre, and at least one film, Hindle Wakes. She joined the Hull Repertory Theatre Company for the 1925 season appearing in several productions including Peter and Paul and Advertising April, alongside actor Colin Clive, and a C. K. Munro production of At Mrs. Beam's. Malleson believed that the short run plays that define repertory theatre were important for the development of young dramatists because they provided an opportunity to see how an audience reacts to one's work. In March 1928, Malleson produced a stage version of her three-act play The Way at the Arts Theatre Club in London. The cast, which included Una O'Connor and Charles Carson, was headed by Moyna Macgill in the role of Rosaleen Moore, a part written for her by Malleson. The play, which debuted on 25 March, was performed twice and was reviewed by The Times as a \"pretentious sham!\""]}, {"page": "List of tuberculosis cases", "response": ["*Colin Clive (1900–1937), British stage and screen actor"]}, {"page": "List of fictional doctors", "response": ["|Bride of Frankenstein || Dr. Henry FrankensteinDr. Pretorius || Colin CliveErnest Thesiger", "|Frankenstein || Dr. Henry FrankensteinDr. Waldman || Colin CliveEdward Van Sloan"]}, {"page": "Clive", "response": ["* Colin Clive (1900–1937), English stage and screen actor"]}, {"page": "Journey's End", "response": ["Journey's End opened as a semi-staged production running for two nights at the Apollo Theatre. It starred Laurence Olivier, then only 21, offered the role of Stanhope by the then equally unknown director James Whale. Under a new producer, Maurice Browne, the play soon transferred to the Savoy Theatre where it ran for three weeks starting on 21 January 1929.Browne, Maurice. Too Late to Lament: An Autobiography. London, Gollancz, 1955, pp. 306-309. The entire cast from the Apollo reprised their roles (George Zucco playing Osborne and Maurice Evans Raleigh) except for Olivier, who had secured another role and was replaced by Colin Clive as Stanhope.Olivier played the part again in 1934 at a special performance for a post-war charity, with Horne and Zucco from the original cast. See \"Special Performance of 'Journey's End'\", The Times, 3 November 1934, p. 10 The play was extremely well received: in the words of Whale's biographer James Curtis, it \"managed to coalesce, at the right time and in the right manner, the impressions of a whole generation of men who were in the war and who had found it impossible, through words or deeds, to adequately express to their friends and families what the trenches had been like\". It transferred to the Prince of Wales Theatre, where it ran for a further two years.", "In 1930, James Whale directed an eponymous film based on the play, starring Colin Clive, David Manners and Ian Maclaren.\"Journey's End\", The Times, 15 April 1930, p. 14"]}, {"page": "The Invisible Man (1933 film)", "response": ["Whale considered Colin Clive for the film's title role, but he also thought of actor Claude Rains, whom he met at a London performance of The Insect Play in 1923. At the time, Rains' career was as a stage actor in New York and London and Universal discouraged Whale from casting him, not wanting an unknown actor in the lead. Rains had been earning so little money from his work on stage he was considering leaving the theatre completely as he had recently bought a farm in New Jersey. Whale had tracked down a screen test Rains had done for A Bill of Divorcement, which Rains later described as \"terrible\", saying he was \"all over the place! I knew nothing about screen technique, of course, and just carried on as if I was in an enormous theatre. When I saw the test, I was shocked and frightened.\" After viewing the screen test, Whale wanted Rains as the lead and had him do another reading of the scene where Griffin boasts to Dr. Kemp of his plans to rule the world. Universal approved of the screen test and signed Rains for a two-picture deal, including top billing in The Invisible Man. While filming, Rains asked Whale to let him act more emotionally, asking him if he could \"try to express something with [his] eyes\". Whale replied, \"But Claude, old fellow, what are you going to do it with? You haven't any face!\""]}, {"page": "Chapel of the Pines Crematory", "response": ["*Colin Clive (1900–1937), actor, Dr. Henry Frankenstein in Frankenstein (1931) and Bride of Frankenstein (cenotaph here, but ashes were scattered at sea)"]}, {"page": "Victor Frankenstein", "response": ["* The character's first significant film appearance was in Universal Pictures' 1931 film adaptation, directed by James Whale. Here, the character is renamed Henry Frankenstein (a later film shows his tombstone bearing the name Heinrich von Frankenstein) and is played by British actor Colin Clive opposite Boris Karloff as the monster. Clive reprised his role in the 1935 sequel, Bride of Frankenstein, which reunited Clive, Whale and Karloff, as well as first giving Frankenstein the official title of Baron. Although the character is not present in the following sequels due to Clive's death in 1937, an oil painting of Frankenstein (as portrayed by Clive) appears in 1939's Son of Frankenstein; he is also the title character, in spite of having only a cameo, in The Ghost of Frankenstein (1942), where his ghost is portrayed by Cedric Hardwicke (who also plays Henry's son Ludwig Frankenstein in the film)."]}, {"page": "Christopher Strong", "response": ["Christopher Strong (also known as The Great Desire and The White Moth) is a 1933 American pre-Code romantic drama film produced by RKO and directed by Dorothy Arzner. It is a tale of illicit love among the English aristocracy and stars Colin Clive and Katharine Hepburn (in her second screen role). The screenplay by Zoë Akins is an adaptation of the 1932 British novel Christopher Strong by Gilbert Frankau.", "Monica departs to find her father, Sir Christopher Strong (Colin Clive), who is devoted to her mother. Harry follows on a motorbike and crashes. Lady Cynthia Darrington (Katharine Hepburn), a famous aviator, helps him, and goes along: She has never had a love affair and is a great deal older than 20. At the party, Cynthia meets Christopher, a friend of her late father. She takes him flying. ", "* Colin Clive as Sir Christopher Strong", "Christopher Strong earned a slim profit and positive film reviews.Harrison March 25, 1933, p. 47.Variety film review, March 14, 1933, p. 14.  In his review for The New York Times, film critic Mordaunt Hall described Christopher Strong as a star vehicle for Katharine Hepburn, \"... who attracted wide attention through her efficient performance in 'A Bill of Divorcement', is the leading light in a pictorial version of Gilbert Frankau's novel, 'Christopher Strong' ... In this her first stellar rôle, Miss Hepburn is far more fortunate than several other stage actresses have been in their initial Hollywood ventures, for aside from giving her excellent opportunities to display her talent, the story is engrossing, and, furthermore, she is supported by a highly capable cast ...\"Hall, Mourdant. \"Movie review: 'Christopher Strong' (1933); Katharine Hepburn and Colin Clive in a film of a Gilbert Frankau novel.\" The New York Times, March 10, 1933."]}, {"page": "Dracula's Daughter", "response": ["Initially, Lugosi and Jane Wyatt were set to star in the film. Universal also announced that Boris Karloff and Colin Clive, who had starred together in Frankenstein and Bride of Frankenstein, would appear,Rhodes, p. 219 and that Cesar Romero would play Dr. Garth.Mank, p. 365 According to The Hollywood Reporter, Universal had sought Herbert Marshall for the role of Sandor, before casting Pichel. None of them appeared except, after a fashion, Lugosi, in the form of a wax bust molded in his image for use in Dracula's coffin. Some sources report that Lugosi was paid as much as $4,000 for his abortive involvement, but the only confirmed record of any financial arrangement is a letter in which Lugosi consents to the use of his likeness at no cost to create the wax bust."]}, {"page": "AFI's 100 Years...100 Movie Quotes", "response": ["|Colin Clive"]}, {"page": "Ludwig Frankenstein", "response": ["Initially, Ludwig agreed, but after the Monster killed Dr. Kettering in an unprovoked fit of violence and tried to abduct Elsa, he angrily changed his mind and planned to destroy the creature by dissecting the creature. However, the spirit of Henry Frankenstein (also played by Hardwicke without a moustache since Colin Clive had died in 1937) appeared before his son and implored him to reconsider, persuading Ludwig to use his talent at brain surgery to simply give the Monster another brain to replace the abnormal criminal one. Perhaps Ludwig was merely hallucinating, but in any case he was properly inspired to do what his father wished. He made plans to remove the Monster's brain and replace it with that of Dr. Kettering, whom both he and Dr. Bohmer viewed as a model citizen. In so doing, Ludwig hoped, he would end the threat of the Monster forever and clear the Frankenstein family's name."]}, {"page": "Mad Love (1935 film)", "response": ["Mad Love (also released as The Hands of Orlac) is a 1935 American horror film, an adaptation of Maurice Renard's novel The Hands of Orlac. It was directed by German-émigré film maker Karl Freund, and stars Peter Lorre as Dr. Gogol, Frances Drake as Yvonne Orlac and Colin Clive as Stephen Orlac. The plot revolves around Doctor Gogol's obsession with actress Yvonne Orlac. When Stephen Orlac's hands are destroyed in a train accident, Yvonne brings him to Gogol, who claims to be able to repair them. As Gogol becomes obsessed to the point that he will do anything to have Yvonne, Stephen finds that his new hands have made him into an expert knife thrower.", "* Colin Clive as Stephen Orlac. Clive was on loan from Warner Bros. at the time.", "Mad Love was released in the United States on July 12, 1935Youngkin et al, 1982. p.88 and, as Hands of Orlac, in the United Kingdom on August 2, 1935.Johnson, 2006. p.194Johnson, 2006. p.119 Official reaction in the UK was mixed with Edward Shortt of the BBFC initially declaring his intention to ban the film. (reprinted in: ) The initial critical reception, however, was focused on praise for Lorre's performance. The Hollywood Reporter said that \"Lorre triumphs in a characterization that is sheer horror\", Time magazine called him \"perfectly cast\", Graham Greene described his performance as \"convincing\", and Charlie Chaplin called him \"the greatest living actor\". Reviews for the rest of the cast were less positive. The New York Times said that \"Ted Healy, a highly amusing comedian, has gotten into the wrong picture\",Mank, 2001. p.135 and The Hollywood Reporter said that Colin Clive \"jitters his way through\".Mank, 2001. p.148 The Hollywood Reporter wrote that the film was \"neither important or particularly compelling ... falls right in the middle between Art and Box Office\". Time magazine called it \"completely horrible\", and The New York Times wrote that \"Mad Love is not much more than a super-Karloff melodrama, an interesting but pretty trivial adventure in Grand Guignol horror.\"Sennwald, 1935. Mad Love was not a hit at the box office, and had a small domestic gross of $170,000.Mank, 2001. p.149 Its foreign gross was larger, at $194,000."]}, {"page": "Maurice Renard", "response": ["Renard wrote the novel Les Mains d'Orlac (\"The Hands of Orlac\", 1920), in which a virtuoso pianist receives the transplanted hands of a murderer and turns into a killer himself. The book has inspired four film versions as The Hands of Orlac (Orlacs Hände, 1924) with Conrad Veidt, Mad Love (1935) with Colin Clive and Peter Lorre, The Hands of Orlac (1960) with Mel Ferrer and Christopher Lee, and Hands of a Stranger (1962) directed by Newt Arnold."]}, {"page": "Matt McKenzie", "response": ["Matt McKenzie is an actor best known for his voicework in games and movies. He is the voice of Auron in the RPG games Final Fantasy X, Final Fantasy X-2, and Kingdom Hearts II. He also provided the English voice of Borgoff in the movie Vampire Hunter D: Bloodlust, Ptolemy in Reign: The Conqueror, and Major Elliot in the animated movie Final Fantasy: The Spirits Within. McKenzie has also guest starred in some well-known movies (Gods and Monsters with Sir Ian McKellen, in which he portrayed Colin Clive) and TV shows such as Star Trek: Voyager, Star Trek: Deep Space Nine, JAG, 7th Heaven, That '70s Show, The O.C. and recently 24 as Agent Hollister. He also had a cameo role in Clint Eastwood's The Rookie as Inspector Wang. He appeared in an episode of House M.D. as Doctor Fedler, where he talks briefly with Robert Chase about The Beatles. He appeared on two episodes of AMC's Mad Men as Crab Colson. Most notably, he voiced Agent Smith and various Agents in The Animatrix.", "| Colin Clive"]}, {"page": "The Sacred Flame (play)", "response": ["In 1929 Hollywood studio Warner Brothers adapted it as an early sound film The Sacred Flame, followed by a German-language version. In 1935 the studio remade the play as The Right to Live starring Colin Clive and George Brent."]}, {"page": "List of Old Stonyhursts", "response": ["*Colin Clive, actor (Frankenstein; Journey's End)Mank, Gregory William. Hollywood's Maddest Doctors. Midnight Marquee Press: 1998."]}, {"page": "History Is Made at Night (1937 film)", "response": ["History Is Made at Night is a 1937 American romantic comedy-drama film directed by Frank Borzage and starring Jean Arthur, Charles Boyer, and Colin Clive. Its plot follows a woman who falls in love with a Parisian waiter who saves her from a set-up her possessive ship magnate husband has hatched to keep her under his control. "]}, {"page": "Garrett Fort", "response": ["* Frankenstein (1931) with Boris Karloff and Colin Clive"]}, {"page": "Clive of India (film)", "response": ["Clive of India is a 1935 American historical biographical film starring Ronald Colman about the life of Robert Clive. It was based on R. J. Minney's play of the same name, and was co-written by Minney and W. P. Lipscomb and directed by Richard Boleslawski.  Colin Clive, who appears in the film, was a descendant of Clive.", "* Colin Clive as Captain Johnstone"]}, {"page": "John L. Balderston", "response": ["Balderston wrote radio play titled The Other Place for the radio program The Fleischmann's Yeast Hour hosted by Rudy Vallee. It was aired on November 14, 1935, starring Colin Clive and Leo G. Carroll."]}, {"page": "Libel (film)", "response": ["The Broadway play, which had starred Colin Clive, was adapted for radio in 1941 and 1943 using the original references to the First World War. Ronald Colman played the leading role in a one-hour 13 January 1941 CBS Lux Radio Theatre broadcast, with Otto Kruger and Frances Robinson. On 15 March 1943 Colman and Kruger reprised their roles for a second Lux Radio Theatre broadcast. The role of an amnesiac World War I veteran had similarities to Colman's part in the 1942 hit Random Harvest.\"Libel\" on Lux Radio Theater; 13 January 1941; at Internet Archive: Overview  and Recording "]}, {"page": "Batman: Castle of the Bat", "response": ["* Bruce and Alfredo bring the Bat-Man's body to life by having lightning run through it, and when Alfredo sees it moving, he exclaims He lives! Master! He lives! a tribute to some well-known lines by Colin Clive."]}, {"page": "Ian Wolfe", "response": ["Central to Wolfe's appeal as a character actor was that, until he reached actual old age, he always looked considerably older than he actually was. In the film Mad Love (1935), he played Colin Clive's stepfather, yet he was only four years older than Clive.  In the film Houdini (1953), he warned the magician to avoid occult matters, telling him to \"take the advice of an old man\". He appeared in movies for another 37 years; his last film credit was for Dick Tracy (1990)."]}, {"page": "List of American films of 1930", "response": ["|Journey's End||James Whale||Colin Clive, David Manners||War||Tiffany. Co-production with the United Kingdom."]}, {"page": "List of American films of 1933", "response": ["|Christopher Strong || Dorothy Arzner || Katharine Hepburn, Colin Clive || Drama || RKO"]}, {"page": "List of American films of 1934", "response": ["| Jane Eyre || Christy Cabanne || Virginia Bruce, Colin Clive || Drama || Monogram", "|The Key|| Michael Curtiz || William Powell, Edna Best, Colin Clive || Drama || Warner Bros."]}, {"page": "List of American films of 1935", "response": ["| Bride of Frankenstein || James Whale || Boris Karloff, Elsa Lanchester, Colin Clive || Sci-fi, Horror || Universal", "| Clive of India || Richard Boleslawski || Ronald Colman, Loretta Young, Colin Clive || Historical || United Artists", "| Mad Love || Karl Freund || Peter Lorre, Frances Drake, Colin Clive || Drama, Horror || MGM", "| The Man Who Broke the Bank at Monte Carlo || Stephen Roberts || Ronald Colman, Joan Bennett, Colin Clive || Comedy || 20th Century Fox"]}, {"page": "List of American films of 1936", "response": ["|The Widow from Monte Carlo||Arthur Greville Collins||Dolores del Río, Warren William, Colin Clive||Comedy|| Warner Bros."]}, {"page": "List of American films of 1937", "response": ["|History Is Made at Night||Frank Borzage||Charles Boyer, Jean Arthur, Colin Clive||Drama|| United Artists"]}, {"page": "List of horror films of the 1930s", "response": ["| James Whale || Colin Clive, Boris Karloff, Dwight Frye, Edward Van Sloan, Mae Clarke || United States || ", "| James Whale || Boris Karloff, Colin Clive, Valerie Hobson, Elsa Lanchester, Ernest Thesiger, Dwight Frye || United States || ", "| Karl Freund || Peter Lorre, Frances Drake, Colin Clive, Ted Healy, Sara Haden || United States || "]}, {"page": "List of adventure films of the 1930s", "response": ["|Clive of India||Richard Boleslawski||Ronald Colman, Loretta Young, Colin Clive||United States|| "]}]}}