{"wiki_id": "http://www.wikidata.org/entity/Q4454937", "itemLabel": "Henry Keith, Baron Keith of Kinkel", "itemDescription": "Scottish lawyer (1922-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Keith,_Baron_Keith_of_Kinkel", "wikipedia_page": {"main": "Henry Shanks Keith, Baron Keith of Kinkel,   (7 February 1920 – 21 June 2002) was a Scottish judge.\nThe son of James Keith, Baron Keith of Avonholm, Harry Keith was educated in the Edinburgh Academy, at Magdalen College, Oxford, where he graduated with a Master of Arts and the University of Edinburgh, where he graduated with a Bachelor of Law. In the Second World War, he was an officer in the Scots Guards and was mentioned in dispatches, reaching the rank of Captain. He was admitted to the Faculty of Advocates in 1950, and was made a Queen's Counsel in 1962. In 1951, he had been called to the English Bar from Gray's Inn, where he became a bencher in 1976.\nHe appointed as Sheriff of Roxburgh, Berwick and Selkirk in 1970, succeeding David Brand.\nHe was appointed a Senator of the College of Justice with the judicial title Lord Keith in 1971.\nOn 10 January 1977, he was appointed Lord of Appeal in Ordinary and was made additionally a life peer with the title Baron Keith of Kinkel, of Strathummel in the District of Perth and Kinross, following in the footsteps of his father, Lord Keith of Avonholm. One year before he had been invested to the Privy Council. In 1996, he retired as Lord of Appeal and in 1997, he was awarded the Knight Grand Cross of the Order of the British Empire.  It was humorously said within legal circles that wherever there was a negligence case, Lord Keith would always say 'no' to damages.In 1955 he married Alison Brown, now Lady Keith of Kinkel; they had four sons and a daughter, Deborah. The family lived at Loch Tummel, near Pitlochry, Perthshire.\nLord Keith died in 2002.\n\n", "link_mentions": [{"page": "Henry Keith", "response": ["*Henry Keith, Baron Keith of Kinkel (1922-2002), Scottish judge"]}, {"page": "Henry Shanks Keith", "response": ["#Redirect Henry Keith, Baron Keith of Kinkel"]}, {"page": "Baron Keith of Kinkel", "response": ["#Redirect Henry Keith, Baron Keith of Kinkel"]}, {"page": "Lord Keith of Kinkel", "response": ["#Redirect Henry Keith, Baron Keith of Kinkel"]}, {"page": "Henry Shanks Keith, Baron Keith of Kinkel", "response": ["#REDIRECT Henry Keith, Baron Keith of Kinkel"]}, {"page": "List of alumni of Magdalen College, Oxford", "response": ["* Henry Keith, Baron Keith of Kinkel GBE, PC, Senior Lord of Appeal in Ordinary, United Kingdom"]}, {"page": "List of people educated at Edinburgh Academy", "response": ["* Henry Keith, Baron Keith of Kinkel"]}, {"page": "Sheriff of Roxburgh, Berwick and Selkirk", "response": ["* Henry Keith, Baron Keith of Kinkel, QC, 1970–1971 "]}]}}