{"wiki_id": "http://www.wikidata.org/entity/Q4468457", "itemLabel": "William Whitehouse", "itemDescription": "English cellist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Whitehouse", "wikipedia_page": {"main": "William Edward Whitehouse (20 May 1859 – 12 January 1935) was an English cellist.", "link_mentions": [{"page": "Felix Salmond", "response": ["Salmond was born to a family of professional musicians. His father Norman Salmond was a baritone, and his mother Adelaide Manzocchi was a pianist who had studied with Clara Schumann. At age twelve, Salmond started studying with the man who became his primary cello teacher, William Whitehouse. He won a scholarship to continue studies with Whitehouse four years later at the Royal Academy of Music in London. He continued on to the Brussels Conservatoire at age nineteen, where he studied for two years with Édouard Jacobs. His concert debut was in 1908, playing Frank Bridge's Fantasy Trio in C minor and Johannes Brahms's Piano Quartet No. 1 in G minor. Salmond's mother was the pianist, with Bridge on viola and Maurice Sons playing the violin. The recital, which took place at the Bechstein Hall, was very successful, leading to many future engagements for Salmond. He gave recitals across Britain and appeared with the Queen's Hall Orchestra, the London Symphony Orchestra and the Hallé Orchestra, amongst others. He also toured America in a piano quartet with Harold Bauer, Bronisław Huberman and Lionel Tertis."]}, {"page": "Achille Simonetti", "response": ["Simonetti came to England in 1891,Pine, Richard & Charles Acton (eds.): To Talent Alone. The Royal Irish Academy of Music, 1848–1998 (Dublin: Gill & Macmillan, 1998), 460–1. embarking on a career as chamber musician. He became part of the first London Trio, an endeavour which occupied him from 1901 to 1912, along with cellist William Whitehouse and pianist Amina Goodwin."]}, {"page": "Whitehouse, William", "response": ["#redirectWilliam Whitehouse"]}, {"page": "Ivor James", "response": ["James studied under William Whitehouse at the Royal College of Music. After graduating he joined the English String Quartet, at a time when its viola player was Frank Bridge.Margaret Campbell. The Great Cellists. Faber & Faber, 2011. Chapter \"The British Element\".", "In 1919 he became William Whitehouse's assistant at the Royal College of Music, and he subsequently taught at the college for 34 years. In his teaching, he was concerned that there should be a strong technical base; also that, in achieving a good interpretation, the line of the music should be considered. His pupils included James Whitehead, Amaryllis Fleming and Martin Lovett."]}]}}