{"wiki_id": "http://www.wikidata.org/entity/Q4470112", "itemLabel": "Ian Williamson", "itemDescription": "English snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Williamson", "wikipedia_page": {"main": "Ian Williamson (born 1 December 1958) is an English former professional snooker and English billiards player.", "link_mentions": [{"page": "Tony Meo", "response": ["Meo defeated White in the final to win the 1977 Pontins Junior title as well as taking the Warners Pro-Am title by winning against professional Doug Mountjoy 5–4 in the final. Meo took the British under-19 title in 1978 with a 3–1 victory against defending champion Ian Williamson in the final. At the 1978 Canadian Open, he achieved the most notable win of his career to that point by eliminating Alex Higgins in the semi-final, and led 10–6 in the final against Cliff Thorburn before losing the match 15–17. He won a second Warners Open title in 1979, 5–2 against White in the final."]}, {"page": "List of snooker players", "response": ["*Ian Williamson"]}, {"page": "1986 World Snooker Championship", "response": ["In the second qualifying round, the Scottish Professional Championship winner Stephen Hendry made a break of 141 in his victory over Paddy Browne; this was the highest break in qualifying for which Hendry earned a prize of £1,750. He had led 8–3 and 9–8 before winning the match 10–9. Level at 8–8 against Bob Chaperon, Frank Jonik conceded the next frame when 22 points behind, despite the  to stotalling 22 points, enough for him to draw the gamestill being on the table. He then conceded the 18th frame while 53 points behind with six reds still remaining, meaning that up to 75 points were available without , and lost the match 8–10. Jimmy van Rensberg beat Ian Williamson on the final black in the  of their contest, clearing  to brown to win the frame 42–41. On the way to his second-round qualifying match, Steve Newbury was involved in a traffic collision which injured his wife and wrecked his car; despite the accident, Newbury beat Omprakesh Agrawal 10–5. There was one whitewash in the second round, Ray Edmonds beating Billy Kelly 10–0.", "* 114  Ian Williamson"]}, {"page": "1984 World Snooker Championship", "response": ["*100  Ian Williamson"]}, {"page": "1983 World Snooker Championship", "response": ["A two-round qualification tournament was held in March and April across three venues: at the Snooker Centre in Sheffield, Romiley Forum in Stockport, and Redwood Lodge, Bristol. In round one, Mario Morra was 4–9 behind Ian Black, but won five frames to equalise at 9–9. In the deciding frame, Morra made a 51 break, but Black replied with a 37 to win the frame and the match with just two balls remaining. Black compiled a 108 break against Paul Medati in the sixth fame of their second qualifying round, and won seven of the next eight frames to qualify for the main draw with a 10–4 win. Eddie Sinclair recorded a 112 break during a decisive 10–2 defeat of Colin Roscoe. In the second round, Sinclair played Eugene Hughes and led 5–4 after making six breaks over 40. He later won the match 10–8 after making breaks of 99 and 54 in the final two frames. Patsy Fagan failed to qualify for the main draw for the first time in his career, losing 8–10 to Mick Fisher. Les Dodd won a long match against Ian Williamson that concluded at 1:10 am with Dodd winning the deciding frame. Dodd had received a walkover in the first qualifying round after John Dunning did not appear for their match."]}, {"page": "1991 World Snooker Championship", "response": ["* Paul Medati 10–7  Ian Williamson"]}, {"page": "1982 UK Championship", "response": [" Les Dodd 9–1 Ian Williamson "]}, {"page": "1988 Grand Prix (snooker)", "response": ["* 114  Ian Williamson"]}, {"page": "Simon Bedford", "response": ["At the beginning of 2013–14 season, in qualifying against Barry Pinches for the 2013 Australian Goldfields Open a 19-year-old record from the qualifying stage of the 1994 British Open was broken. The match lasted 449 minutes and 46 seconds, the longest ever best-of-nine-frame match in the history of professional snooker. The previous record was 434 minutes and 12 seconds in the match between Ian Williamson and Robby Foldvari. The match began on 31 May 2013 and ended on 1 June 2013 and Bedford won 5–4, after being 4–0 up. However, Bedford only entered in six further events during the season, winning only five matches and after a first round defeat in the UK Championship in November he didn't enter another tournament, resulting in his relegation from the main tour as he ended the season ranked 99th in the world. Bedford returned to play in 2017 Q School and was knocked out in the fifth round of the first event and the second round of event two."]}, {"page": "2008 World Professional Billiards Championship", "response": ["|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson"]}, {"page": "2009 World Professional Billiards Championship", "response": ["|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson"]}, {"page": "2010 World Professional Billiards Championship", "response": ["|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson ", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left;| Ian Williamson "]}, {"page": "2007 World Professional Billiards Championship", "response": ["|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson", "|style=\"text-align:left\"| Ian Williamson "]}, {"page": "2013 Australian Goldfields Open", "response": ["These matches were held between 30 May and 3 June 2013 at The Capital Venue in Gloucester, England. In the match between Barry Pinches and Simon Bedford a 19-year-old record from the qualifying stage of the 1994 British Open was broken. The match lasted 449 minutes and 46 seconds, the longest ever best-of-nine-frame match in the history of professional snooker. The previous record was 434 minutes and 12 seconds in the match between Ian Williamson and Robby Foldvari."]}, {"page": "1979 Canadian Open", "response": ["*English billiards: There were 16 entrants. Joe Johnson defeated Ian Williamson 500–284 in the final."]}, {"page": "1984 International Masters", "response": ["| Jim Meadowcroft||1–2|| Ian Williamson||", "| Ian Williamson||0–2|| Billy Kelly||"]}, {"page": "Ian Williamson (snooker player)", "response": ["#REDIRECT Ian Williamson"]}, {"page": "British Junior English Billiards Championship", "response": ["| 1975 || Eugene Hughes || 440–325 || Ian Williamson || ", "| 1976 || Steve Davis || 435–259 || Ian Williamson || ", "| 1977 || Ian Williamson || 289–133 || John Barnes || ", "| 1978 || Ian Williamson || 328–105 || John Barnes || "]}, {"page": "Mike Hines (snooker player)", "response": ["Hines was accepted as a professional by the World Professional Billiards and Snooker Association (WPBSA) in 1983. His first professional tournament was the 1984 World Snooker Championship, where he defeated Ian Black 10-5 before losing 6–10 to Ian Williamson in the second qualifying round. At the 1985 World Snooker Championship, he eliminated Tony Chappel 10-8 and Paul Watchorn 10-4 before being knocked out 7–10 by Matt Gibson in the third qualifying round. His performance at the 1985 tournament was the furthest he ever progressed in the World Snooker Championship, with his only other appearance being in 1989 when he was defeated 1–10 by Robert Marshall."]}]}}