{"wiki_id": "http://www.wikidata.org/entity/Q447554", "itemLabel": "Anthony Norris Groves", "itemDescription": "British missionary", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Norris_Groves", "wikipedia_page": {"main": "Anthony Norris Groves (1 February 1795 – 20 May 1853) was an English Protestant missionary and the  \"father of faith missions\". He launched the first Protestant mission to Arabic-speaking Muslims, and settled in Baghdad, now the capital of Iraq, and later in southern India. His ideas influenced a circle of friends who became leaders in the Plymouth Brethren. Among these were JN Darby, JV Parnell (Lord Congleton), and George Müller, who had married Groves' sister Mary.\nThe significance of Groves lies in his desire to simplify the task of churches and missions by returning to the methods of Christ and his apostles described in the New Testament. As a missionary, his goal was to help indigenous converts form their own churches without dependence on foreign training, authorisation or finance. His ideas eventually found wide acceptance in evangelical circles.", "link_mentions": [{"page": "Rapture", "response": ["The partial, conditional or selective rapture theory holds that all obedient Christians will be raptured before the great tribulation depending on ones personal fellowship (or closeness) between she or he and God, which is not to be confused with the relationship between the same and God (which is believer, regardless of fellowship.)  Therefore, it is believed by some that the rapture of a believer is determined by the timing of his conversion before the great tribulation. Other proponents of this theory hold that only those who are faithful in their relationship with God (having true fellowship with him) will be raptured, and the rest resurrected during the great tribulation, between the 5th and 6th seals of Revelation, having lost their lives during. Still others hold the rest will either be raptured during the tribulation or at its end. As stated by Ira David (a proponent of this view): “The saints will be raptured in groups during the tribulation as they are prepared to go.” Some notable proponents of this theory are G. H. Lang, Robert Chapman, G. H. Pember, Robert Govett, D. M. Panton, Watchman Nee, Ira E. David, J. A. Seiss, Hudson Taylor, Anthony Norris Groves, John Wilkinson, G. Campbell Morgan, Otto Stockmayer and Rev. J. W. (Chip) White Jr."]}, {"page": "John Nelson Darby", "response": ["Over the next five years, he developed the principles of his mature theology — most notably his conviction that the very notion of a clergyman was a sin against the Holy Spirit, because it limited the recognition that the Holy Spirit could speak through any member of the Church. During this time (1827–28) he joined an interdenominational meeting of believers (including Anthony Norris Groves, Edward Cronin, J. G. Bellett, and Francis Hutchinson) who met to \"break bread\" together in Dublin as a symbol of their unity in Christ. By 1832, this group had grown and began to identify themselves as a distinct Christian assembly. As they traveled and began new assemblies in Ireland and England, they formed the movement now known as the Plymouth Brethren."]}, {"page": "Timeline of Christian missions", "response": ["* 1829 – George Müller, a native of Prussia, goes to England as a missionary to the Jews; Anthony Norris Groves, an Exeter dentist, sets off as a missionary to Baghdad accompanied by John Kitto."]}, {"page": "Plymouth Brethren", "response": ["The Brethren movement began in Dublin, Ireland, where several groups of Christians met informally to celebrate the Lord's Supper together in 1820. Stephen Hunt, Handbook of Global Contemporary Christianity: Movements, Institutions, and Allegiance, BRILL, USA, 2016, p. 362 The central figures were Anthony Norris Groves, a dentist studying theology at Trinity College; Edward Cronin, studying medicine, John Nelson Darby, a curate in County Wicklow; and John Gifford Bellett, a lawyer who brought them together. They did not require ministers or even an order of service, as their guide was the Bible alone.", "* Anthony Norris Groves – missionary to Baghdad and India"]}, {"page": "Christian mission", "response": ["The missions inspired by Taylor and Guinness have collectively been called \"faith missions\" and owe much to the ideas and example of Anthony Norris Groves (1795–1853). Taylor, a thorough-going nativist, offended the missionaries of his era by wearing Chinese clothing and speaking Chinese at home. His books, speaking, and examples led to the formation of numerous inland missions and of the Student Volunteer Movement (SVM, founded in 1886), which from 1850 to about 1950 sent nearly 10,000 missionaries to inland areas, often at great personal sacrifice. Many early SVM missionaries traveling to areas with endemic tropical diseases left with their belongings packed in a coffin, aware that 80% of them would die within two years."]}, {"page": "Exclusive Brethren", "response": [" But a tension had existed since the earliest times, as set out in a letter from Anthony Norris Groves in 1836 to Darby (who was not a believer in adult baptism):"]}, {"page": "Indigenous church mission theory", "response": ["Anthony Norris Groves (1795–1853) attempted to avoid this problem in pioneer areas by guarding against any form of dependency from the start. He chose to represent no foreign denomination or missionary society, and he encouraged full co-operation between all Protestant missionaries for the encouragement of indigenous initiatives. He predated Roland Allen by eighty years as an advocate of Indigeneity rather than Indigenization. Looking directly to God for guidance and provision, he was a formative influence on Hudson Taylor and the \"faith mission\" movement, but the direct influence of his indigenous strategy is more evident in the remarkable movements associated with Bakht Singh in India and Watchman Nee in China. Nee, however, eschewed the label indigenous, saying that the organizing principle of a church was locality and not nationality, so that all believers in a given city were members of the church in that city regardless of national origin."]}, {"page": "Roland Allen", "response": ["Allen became an early advocate of establishing Churches that from the beginning would be self-supporting, self-propagating, and self-governing, adapted to local conditions and not merely imitations of Western Christianity. These views were confirmed by a trip to India in 1910 and by later research in Canada and East Africa. With this background, Allen wrote his book Missionary Methods, which was first published in 1912. It is possible that his thought was influenced in part by the earlier primitivist writings of Anthony Norris Groves and by the Brethren movement.Dann R B: The Primitivist Missiology of Anthony Norris Groves, pp. 227–9", "* Anthony Norris Groves, whose \"back-to-the-Bible\" strategies predated Allen's by eighty years, and whose personal influence may be seen in Allen's desire to recover New Testament mission methods."]}, {"page": "Francis William Newman", "response": ["Born in London, Newman and his brother were both educated at Ealing, and subsequently at Oxford, where he had a distinguished career, obtaining a double first class in 1826. He was elected fellow of Balliol in the same year. In 1827 he went to Delgany, co. Wicklow, where for a year he tutored the sons of Edward Pennefather and fell under the influence of Pennefather's brother-in-law, the Rev John Nelson Darby, one of the nascent group of Plymouth Brethren, who he describes in Phases of Faith as \"the Irish Clergyman\". Conscientious scruples respecting the ceremony of infant baptism led him to resign his fellowship in 1830, and he went to Baghdad as assistant in the faith mission of Anthony Norris Groves. This journey, which included wives, a baby in arms, and an elderly woman, has been described as \"a mad jaunt whose real tragedy — two of the wives died and the men of the party were many times near death — is blurred by silly incompetence and downright nonsense of most of its members.\"Lionel Trilling, \"Matthew Arnold\", W.W. Norton Company, 1939, p. 169 In 1833 he returned to England to procure additional support for the mission, but rumours of unsoundness in his views on the doctrine of eternal punishment had preceded him, and finding himself generally looked upon with suspicion, he gave up the vocation of missionary to become classical tutor in an unsectarian college at Bristol. His letters written home during the period of his mission were collected and published in 1856."]}, {"page": "John Kitto", "response": ["One of his benefactors was the Exeter dentist Anthony Norris Groves, who in 1824 offered him employment as a dental assistant. Living with the Groves family, Kitto was profoundly influenced by the practical Christian faith of his employer. In 1829 he accompanied Groves on his pioneering mission to Baghdad and served as tutor to Groves's two sons. In 1833 Kitto returned to England via Constantinople, accompanied by another member of the Groves mission, Francis William Newman. Shortly afterwards he married, and in due course had several children.", "* Dann, Robert Bernard, Father of Faith Missions: The Life and Times of Anthony Norris Groves (Authentic Media, 2004) "]}, {"page": "George Müller", "response": ["In 1829, Müller offered to work with Jews in England through the London Society for Promoting Christianity Amongst the Jews. He arrived in London on 19 March of that year, but by mid-May, he fell ill and did not think that he would survive. He was sent to Teignmouth to recuperate and, while there he met Henry Craik, who became his lifelong friend.Steer, p. 24 Müller returned to London in September, but after ten days started to feel unwell again. He blamed his failing health on his having been confined to his house because of his studies. He asked the Society to send him out to preach but received no reply. By the end of November, he became doubtful whether the Society was the right place for him and on 12 December made the decision to leave but to wait for a month before writing. Müller returned to Exmouth in East Devon, England on 31 December for a short holiday and preached at various meetings while there. He wrote to the Society in early January, requesting that they might consider allowing him to remain with them if they would allow him \"to labour in regard to time and place as the Lord might direct me\". This they refused to do at a meeting on 27 January 1830, communicating this to Müller in writing, and thus bringing to an end his association with the London Society. He moved from Exmouth to Teignmouth and preached several times for Craik, which led to a number of the congregation asking him to stay and be the minister of Ebenezer Chapel in Shaldon, Devon, on a salary of £55 per annum. On 7 October 1830, he married Mary Groves, the sister of Anthony Norris Groves. At the end of October, he renounced his regular salary, believing that the practice could lead to church members giving out of duty, not desire. He also eliminated the renting of church pews, arguing that it gave unfair prestige to the wealthy (based primarily on James 2:1–9).Müller (2003), p. 54."]}, {"page": "Christianity in India", "response": ["The London Missionary Society was the first Protestant mission in Andhra Pradesh which established its station at Visakhapatnam in 1805. Anthony Norris Groves, a Plymouth Brethren missionary arrived in 1833. He worked in the Godavari delta area until his death in 1852. John Christian Frederick Heyer was the first Lutheran missionary in the region of Andhra Pradesh. He founded the Guntur Mission in 1842. Supported initially by the Pennsylvania Ministerium, and later by the Foreign Mission Board of the General Synod, Heyer was also encouraged and assisted by British government officials. He established a number of hospitals and a network of schools throughout the Guntur region."]}, {"page": "Indian Brethren", "response": ["The Plymouth Brethren was introduced into India in 1833 by Anthony Norris Groves, a dentist by profession who was one of the Plymouth Brethren pioneers in the United Kingdom.  His ministry centred in the Godavari delta area of Bihar, Andhra Pradesh and Tamil Nadu."]}, {"page": "Indian Pentecostal Church of God", "response": ["Protestant evangelical low church movement flourished in Kerala after the translation of the Bible by Hermann Gundert and Benjamin Bailey who also established the first printing press in Kerala in mid 1800s. George Burg, an American-German missionary first introduced the Pentecostal experience in early 1900s. During those times, many evangelical low churches were from the Kerala Brethren and followed reformed puritan practises (Verubadh Sabha) and these churches was pioneered by K.V. Simon, Volbrecht Nagel, Anthony Norris Groves etc. The origins of the Indian Pentecostal Church can be traced back to K E Abraham, who belonged to the Kerala Brethren denomination during the period of the native revival movement in Travancore. Abraham was born on March I, 1899 to Jacobite parents in Mulakuzha, India. He converted to Pentecostalism at age seven in 1906, and was rebaptized on February 27, 1916 by Mahakavi K.V. Simon. During his younger years, Abraham ministered among the youth, and as a result, many people accepted Christianity. As a Christian minister, he had built a small place of worship adjacent to his house in Mulakuzha in 1920 for a Puritan Assembly."]}, {"page": "Parnell, New Zealand", "response": ["Robert Tod purchased  from the Government on 1 September 1841. He quickly subdivided it into 36 sections, which he advertised for sale on 4 September 1841 as the \"Village of Parnell\". In the early 1830s Tod had supplied copies of the Bible to a Plymouth Brethren mission in Baghdad, one of whose members was John Vesey Parnell. Streets in the village of Parnell were named Groves, Cronin and Calman after other missionaries to Baghdad, Anthony Norris Groves, Edward Cronin and Erasmus Scott Calman. These were later renamed Eglon, Fox and Marston Streets."]}, {"page": "Kerala Brethren", "response": ["The modern Brethren movement was introduced into India in 1833 by Anthony Norris Groves,Bahrain Brethren a dentist turned missionary who was one of the original Plymouth Brethren pioneers in Ireland. The Brethren movement began to take root in Kerala when Mathai Upadeshi, who had been an (Anglican) CMS evangelist from Thirunalveli, arrived in 1872.  Another early preacher was Yusthos Joseph, also known as Vidwankutty, a Tamil Brahmin and also a CMS priest like Mathai Upadeshi. He arrived in Kerala in 1875, but his ministry declined after the failure of his prediction that Jesus Christ would return in 1881."]}]}}