{"wiki_id": "http://www.wikidata.org/entity/Q447197", "itemLabel": "Sheila Scott", "itemDescription": "British aviator", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheila_Scott", "wikipedia_page": {"main": "Sheila Scott OBE (27 April 1922 – 20 October 1988), was an English aviator who broke over 100 aviation records through her long distance flight endeavours, which included a 34,000-mile (55,000 km) \"world and a half\" flight in 1971. On this flight, she became the first person to fly over the North Pole in a small aircraft.", "link_mentions": [{"page": "April 27", "response": ["*  1922   – Sheila Scott, English nurse and pilot (d. 1988)"]}, {"page": "October 20", "response": ["*1988 – Sheila Scott, English pilot and author (b. 1922)"]}, {"page": "Worcester, England", "response": ["*Sheila Scott (1922–1988), aviator, was born in Worcester."]}, {"page": "Pimlico", "response": ["Residents have included politician Winston Churchill, designer Laura Ashley, philosopher Swami Vivekananda, actor Laurence Olivier, illustrator and author Aubrey Beardsley, Kenyan president Jomo Kenyatta, Australian prime minister Billy Hughes, lawn-tennis inventor Major Walter Wingfield, and world record–holding pilot Sheila Scott."]}, {"page": "Nimbus program", "response": ["Nimbus satellites (beginning with Nimbus 3 in 1969) blazed the trail into the modern GPS era with operational search and rescue and data collection systems. The satellites tested the first technology that allowed satellites to locate weather-observation stations set up in remote locations and to command the stations to transmit their data back to the satellite. The most famous demonstration of the new technology was through the record-breaking flight of British aviator Sheila Scott, who tested the Nimbus navigation and locator communication system when she made the first-ever solo flight over the North Pole in 1971."]}, {"page": "1966 in aviation", "response": ["* June 20 – Sheila Scott completes a solo round-the-world flight."]}, {"page": "1922 in the United Kingdom", "response": ["* 27 April – Sheila Scott, actress and aviator (died 1988)"]}, {"page": "Piper PA-24 Comanche", "response": ["A 1966 Comanche 260B, named Myth Too and registered  as G-ATOY, was owned by  English aviator Sheila Scott. The aircraft, flown by Scott, holds 90 world-class light aviation records. It is on public display at the National Museum of Flight, Scotland."]}, {"page": "Harmon Trophy", "response": ["|Cmdr. James A. Lovell Jr.; Maj. Edwin E. Aldrin; Maj. Alvin S. White (all USA)Harmon Winners for 1967 {presented in 1967 for 1966} are Named, New York Times September 10, 1967 || Sheila Scott, UK || No award presented", "|Brian Trubshaw, UK; Major André Edouard Turcat, France5 Top Pilots Cited, New York Times, September 21, 1973 || Sheila Scott, UK || No award presented ||"]}, {"page": "Ninety-Nines", "response": ["* Sheila Scott"]}, {"page": "National Museum of Flight", "response": ["* Piper Comanche G-ATOY Myth Too, flown round the world twice by Sheila Scott"]}, {"page": "1988 in the United Kingdom", "response": ["* 20 October – Sheila Scott, aviator (born 1927)"]}, {"page": "List of Hawaii hurricanes", "response": ["*July 1971: Hurricane Denise dissipated before reaching Hawaii, but brought beneficial rain of over one inch to dry farms and sugarcane plantations. Denise's outer winds helped Sheila Scott while she was flying solo around the world and a boat named Winward Passage won the Transpacific Yacht Race. Both were headed to Honolulu."]}, {"page": "The Alice Ottley School", "response": ["*Sheila Scott, the first British pilot to make a solo round-the-world flight"]}, {"page": "1927 in the United Kingdom", "response": ["** Sheila Scott, aviator (died 1988)"]}, {"page": "List of aviators", "response": ["* Sheila Scott"]}, {"page": "Lympne Airport", "response": ["A new terminal building opened in June 1969. Sheila Scott performed the ceremony, arriving in her record-breaking Piper Comanche G-ATOY Myth Too. On 10 June, the airport was renamed Ashford Airport, identifying the airport with the nearby town of Ashford which was scheduled for rapid growth. To mark the occasion a plaque was unveiled by Leader of the Opposition Edward Heath."]}, {"page": "Carolinda Witt", "response": ["Witt, together with her friend Sheila Scott, the famous aviator who amongst her 100 flying records flew solo over the North Pole in 1956, flew her balloon throughout the UK drawing attention to the plight of otters whose habitat was being destroyed.", "* 17 June 1979 — Flew famous aviator Sheila Scott from Sudely Castle  in a Thunder 56 balloon \"Argonaut\" Registration No:G- BDVG."]}, {"page": "Britannia Trophy", "response": ["|1967||Sheila Scott||On the establishment of over 100 point-to-point international records||Piper Comanche"]}, {"page": "Daily Mail Trans-Atlantic Air Race", "response": ["The first civilian competitor to leave London was Anne Alcock, the niece of Sir John Alcock. She was followed by a number of other runners including Stirling Moss, Mary Rand and Sheila Scott, who used her own private aircraft.", "|Sheila Scott"]}, {"page": "List of women aviators", "response": ["* Sheila Scott (1922–1988), first person to fly over the North Pole in a light aircraft"]}]}}