{"wiki_id": "http://www.wikidata.org/entity/Q4484218", "itemLabel": "Augustine Phillips", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Augustine_Phillips", "wikipedia_page": {"main": "Augustine Phillips (died May 1605) was an Elizabethan actor who performed in troupes with Edward Alleyn and William Shakespeare. He was one of the first generation of English actors to achieve wealth and a degree of social status by means of his trade.\nPhillips first enters the historical record as a member of the amalgamation of Lord Strange's Men and the Admiral's Men that performed The Seven Deadly Sins (perhaps by Richard Tarlton) between 1590 and 1592. In the surviving \"plot\" of this performance, Phillips is assigned the role of Sardanapalus; he is one of the few actors not required to play a double role. He is named in the touring warrant issued to Strange's Men in 1592; after the death of their patron Ferdinando Stanley he joined the new Lord Chamberlain's Men, presumably as a sharer.\nPhillips remained with the company through its change to the King's Men and to his death in 1605. Little is known with certainty of his roles with the company, except that he was probably already mature when the company assembled. He appears in the cast lists for Ben Jonson's Every Man in His Humour (1598), Every Man Out of His Humour (1599), and Sejanus (1603). He may be the author of a jig, Phillips His Slipper, entered for publishing in the Stationers' Register in 1595.\nHe was one of the six sharers in the Globe Theatre when it was built in 1598–9, with a one-eighth share. Over time this made him a comparatively wealthy man, at least as far as Elizabethan actors were concerned. Like Shakespeare, Phillips lived for many years near his occupation in Southwark, in Paris Garden near the Swan Theatre, and in Aldgate; but by the time of his death he owned a house in Mortlake, in Surrey.\nIn 1601, he was the representative of the company called to testify before the Privy Council about their involvement with the rebellion of the Earl of Essex; the Chamberlain's Men had been paid by supporters of the Earl to perform Shakespeare's Richard II before the abortive coup. Phillips' testimony seems to have assuaged whatever anger the court may have felt towards the players; they were not punished, and indeed played for Elizabeth at Whitehall on 24 February 1601, the night before Essex was executed. (The choice of Phillips as representative is interesting; why him, and not Shakespeare or Burbage? He testified that the Lord Chamberlain's Men had played at the request of Essex's supporters, specifically because they were offered 40 shillings more than their normal fee. This might indicate that Phillips had a role in keeping the financial accounts of the company.)\nThe evidence suggests a life deeply intertwined with the theater. He was a stepbrother of his fellow King's Man Thomas Pope, and his sister married another actor, Robert Gough.\nPhillips's daughters Magdalen and Rebecca were baptized in the parish of St. Saviour's in Southwark in 1594 and 1596 respectively. A son, Augustine or Austen, was baptized there in 1601 but buried three years later. Phillips's will, which was signed on 4 May 1605 and probated on 13 May 1605, mentions two other daughters, Anne and Elizabeth, and his wife Anne, plus brothers, sisters, and other relations of a large family. The will includes a number of interesting and revealing bequests:\n\na silver bowl worth £5 to each of the executors, John Heminges, Richard Burbage, and William Sly;\na 30-shilling gold piece each to Shakespeare, Henry Condell, and Christopher Beeston (Beeston is described as Phillips's \"servant;\" he was almost certainly a former apprentice);\n20 shillings in gold each to Lawrence Fletcher, Robert Armin, Alexander Cooke, Richard Cowley, and Nicholas Tooley;\n40s. to his apprentice James Sands, along with a cittern, a bandora, and a lute, all pending the \"expiration of his term of years in his indenture of apprenticehood;\"\n40s. to his \"late apprentice\" Samuel Gilburne, plus Phillips's \"mouse-colored\" velvet hose, his black taffeta suit and white taffeta doublet, his purple cloak, his sword and dagger, and his bass viol;\nand £5 to be split among the hired men \"of the company which I am of.\"The musical instruments obviously imply that Phillips was a musician, and as such he was probably involved in the dramatic music used in productions throughout his career.", "link_mentions": [{"page": "English Renaissance theatre", "response": ["*Augustine Phillips"]}, {"page": "Elizabethan era", "response": ["The Essex Rebellion of 1601 has a dramatic element, as just before the uprising, supporters of the Earl of Essex, among them Charles and Joscelyn Percy (younger brothers of the Earl of Northumberland), paid for a performance of Richard II at the Globe Theatre, apparently with the goal of stirring public ill will towards the monarchy. It was reported at the trial of Essex by Chamberlain's Men actor Augustine Phillips, that the conspirators paid the company forty shillings \"above the ordinary\" (i. e., above their usual rate) to stage the play, which the players felt was too old and \"out of use\" to attract a large audience."]}, {"page": "Richard II (play)", "response": ["Shakespeare's play appears to have played a minor role in the events surrounding the final downfall of Essex. On 7 February 1601, just before the uprising, supporters of the Earl of Essex, among them Charles and Joscelyn Percy (younger brothers of the Earl of Northumberland), paid for a performance at the Globe Theatre on the eve of their armed rebellion. By this agreement, reported at the trial of Essex by the Chamberlain's Men actor Augustine Phillips, the conspirators paid the company forty shillings \"above the ordinary\" (i.e., above their usual rate) to stage this play, which the players felt was too old and \"out of use\" to attract a large audience. Eleven of Essex's supporters attended the Saturday performance."]}, {"page": "Globe Theatre", "response": ["The Globe was owned by actors who were also shareholders in the Lord Chamberlain's Men. Two of the six Globe shareholders, Richard Burbage and his brother Cuthbert Burbage, owned double shares of the whole, or 25% each; the other four men, Shakespeare, John Heminges, Augustine Phillips, and Thomas Pope, owned a single share, or 12.5%. (Originally William Kempe was intended to be the seventh partner, but he sold out his share to the four minority sharers, leaving them with more than the originally planned 10%).Gurr (1991: 45–46) These initial proportions changed over time as new sharers were added. Shakespeare's share diminished from 1/8 to 1/14, or roughly 7%, over the course of his career.Schoenbaum, pp. 648–49."]}, {"page": "1603 in literature", "response": ["*May 19 – The London acting company previously known as the Lord Chamberlain's Men comes under the patronage of the new monarch and is chartered as the King's Men. The principals are named as Lawrence Fletcher, William Shakespeare, Richard Burbage, Augustine Phillips, John Heminges, Henry Condell, William Sly, Robert Armin and Richard Cowley."]}, {"page": "1601 in literature", "response": ["*February 17 – Actor Augustine Phillips, a member of the Lord Chamberlain's Men, is deposed by the Privy Council of England."]}, {"page": "Robert Armin", "response": ["In London, he resided in the parish of St Botolph's Aldgate; three of his children named in the parish register appear to have died before adulthood. Fellow King's Man Augustine Phillips bequeathed him twenty shillings as a \"fellow\"; John Davies of Hereford wrote Armin a complimentary epigram. His burial is recorded in the Registers of St Botolph's as 30 November 1615. Nungezer, Edwin (1929), \"A Dictionary of Actors and of Other Persons Associated with the Public Representation of Plays in England, before 1642\", OUP"]}, {"page": "King's Men (playing company)", "response": ["The royal patent of 19 May 1603 which authorised the King's Men company named the following players, in this order: Lawrence Fletcher, William Shakespeare, Richard Burbage, Augustine Phillips, John Heminges, Henry Condell, William Sly, Robert Armin, Richard Cowley, \"and the rest of their associates....\"  The nine cited by name became Grooms of the Chamber. On 15 March 1604, each of the nine men named in the patent was supplied with four and a half yards of red cloth for the coronation procession.", "May 1605 brought the death of Augustine Phillips. In his will, Phillips left legacies to Shakespeare, Burbage, and eight other members of the company, plus two apprentices, and £5 to the hired men \"of the company which I am of\". (Phillips also leaves a bequest to Christopher Beeston, as a former \"servant\". Beeston was almost certainly another former apprentice.)", "Shank would be the company's primary clown in the years to come; his specialties were dancing and knockabout physical comedy. He was a veteran of several troupes over the previous decades, going back perhaps to Pembroke's Men and Queen Elizabeth's Men in the reign of Elizabeth; he had been with the Admiral's/Prince Henry's/Palsgrave's company in the 1610–13 period. Shank may have taken Robert Armin's place in the King's Men after Armin's death in 1615. Shank also trained apprentices for the company – Thomas Holcombe, John Thompson, Thomas Pollard, and John Honyman. Robert Gough had been associated with the actors of the company perhaps as far back as 1591, when he may have been a boy player in The Seven Deadly Sins; he received a legacy in the 1603 will of Thomas Pope, and he witnessed the 1605 will of Augustine Phillips, whose sister he most likely married. Gough was never a prominent actor, and little is known about the roles he played."]}, {"page": "John Heminges", "response": ["Heminges's association with the theatre had begun by 1593, when he and Augustine Phillips were with Lord Strange's Men. By the next year he and Phillips had joined the Lord Chamberlain's Men, later the King's Men. Heminges remained with the Company until his death. Privy Council records from 1630 state that he received £100 to relieve the Company during a period of plague."]}, {"page": "Henry Condell", "response": ["Traditionally, he is associated with the \"Harry\" who appears in the cast list for Richard Tarlton's The Seven Deadly Sins, but this identification is little more than conjecture. If the connection is true, then Condell was an actor as early as 1590, acting in Lord Strange's Men alongside John Heminges and Augustine Phillips. Condell was definitely in London by 24 October 1596, when he married, at St Laurence Pountney, Elizabeth Smart (d.1635), the only child of John Smart of the Strand, gentleman. They settled in St Mary Aldermanbury, the parish in which Heminges lived. Condell, like Heminges, served as churchwarden in that church. Nine children were baptized there, born between 1599 and 1614, of whom only three survived to adulthood: Elizabeth (baptized 26 October 1606), who married Herbert Finch; Henry (baptized 6 May 1610, died 1630); and William (baptized 26 May 1611)."]}, {"page": "Lord Chamberlain's Men", "response": ["Augustine Phillips also came from Strange's Men. He remained with the troupe until his death in 1605.", "The Lord Chamberlain's Men, and its individual members, largely avoided the scandals and turbulence in which other companies and actors sometimes involved themselves. Their most serious difficulty with the government came about as a result of their tangential involvement in the February 1601 insurrection of the Earl of Essex. Some of Essex's supporters had commissioned a special performance of Shakespeare's Richard II in the hope that the spectacle of that king's overthrow might make the public more amenable to the overthrow of Elizabeth (who later remarked, \"I am Richard II, know ye not that?\"). Augustine Phillips was deposed on the matter by the investigating authorities; he testified that the actors had been offered 40 shillings more than their usual fee, and for that reason alone had performed the play on 7 February, the day before Essex's uprising. The explanation was accepted; the company and its members went unpunished, and even performed for Elizabeth at Whitehall on 24 February, the day before Essex's execution."]}, {"page": "Sejanus His Fall", "response": ["The published cast list in Jonson's 1616 folio identifies the principal actors as Richard Burbage, Augustine Phillips, William Sly, John Lowin, William Shakespeare, John Heminges, Henry Condell, and Alexander Cooke (listed in that order). It is not known which parts were played by which actors. David Grote argues that the published list probably mixes two separate productions, as Lowin did not join the King's Men until after the first production. However Grote suggests that the most likely roles for these performers can be identified:"]}, {"page": "Playing company", "response": ["In 1605 the actor Augustine Phillips left specific pieces of his wardrobe to an apprentice in his last will and testament including his \"mouse-colored\" velvet hose, purple cloak, white taffeta doublet, and black taffeta suit. To a modern sensibility, this may sound quaint and odd; but when \"a doublet and hose of seawater green satin cost £3\",Chambers, Vol. 2, p. 184. the monetary value of Phillips' items was not negligible. Actors could face serious penalties for appropriating the costumes of their companies. [See Robert Dawes for an example.] (The players could defray some of their costs in the used clothing market. As an example, the King's Men bought discarded items of Gondomar's wardrobe for the actor playing the Black Knight in A Game at Chess. Melissa D. Aaron, Global Economics: A History of the Theatre Business, the Chamberlain's/King's Men, and Their Plays, 1599–1642, Newark, DE, University of Delaware Press, 2003; p. 120. Often, \"eminent lords and knights at their decease\" would leave articles of their finery to their servants much of it \"unseemly\" for servingmen and women to wear. Such garments would end up the property of the actors.)Gurr, Shakespearean Stage, pp. 194, 198."]}, {"page": "Every Man in His Humour", "response": ["The folio also gives a cast list for the original 1598 production. After Shakespeare, the main players are given in the following order: Richard Burbage, Augustine Phillips, John Heminges, Henry Condell, Thomas Pope, William Sly, Christopher Beeston, William Kempe, and John Duke. (Kempe would leave the company the next year, for his famous morris dance from London to Norwich.)"]}, {"page": "Every Man out of His Humour", "response": ["When the play was reprinted in Jonson's folio collection of 1616, a cast list of the original 1599 production was included. From this, it is known that the leading players were Richard Burbage, John Heminges, Henry Condell, Augustine Phillips, Thomas Pope, and William Sly. Shakespeare was not part of the production, though he had played in Every Man in His Humour the year before."]}, {"page": "Christopher Beeston", "response": ["Little is known of Beeston's early life. In extant records he is known alternately as Beeston and Hutchison. He has not so far been decisively connected with the William Beeston mentioned by Thomas Nashe in Strange News; however, such a connection is possible. Beeston has been conjecturally associated with the \"Kit\" in the surviving plot of Richard Tarlton's The Seven Deadly Sins.E. K. Chambers, The Elizabethan Stage, 4 Volumes, Oxford, Clarendon Press, 1923; Vol. 2, p. 302. It is likely that he began in theatre as a child actor: Augustine Phillips bequeathed \"his servant\" Beeston thirty shillings in his 1605 last will and testament, indicating that Beeston had been that actor's apprentice with the Lord Chamberlain's Men. Beeston played in the company's 1598 production of Ben Jonson's Every Man in His Humour.F. E. Halliday, A Shakespeare Companion 1564–1964, Baltimore, Penguin, 1964; p. 57. So it appears that Beeston started as a boy player and later graduated to adult roles."]}, {"page": "Cuthbert Burbage", "response": ["The Globe provided a stable home for the Chamberlain's Men and their successors, the King's Men, for the next four decades. Cuthbert and his brother had financed the new venue by making five actors (William Shakespeare, John Heminges, Augustine Phillips, Thomas Pope, and William Kempe) as a group, half-sharers in the profits of the house: this arrangement seems to have solidified the structure of the group, helping cement the position of the Chamberlain's Men as the preeminent troupe in London."]}, {"page": "Lord Strange's Men", "response": ["Lord Strange's Men were associated with the Lord Admiral's Men from 1590 to 1594; in the winter of 1591 Strange's Men gave six performances at Court. They were also performing at The Theatre, and perhaps at the Curtain as well. The \"plot\" of one of their plays, The Seven Deadly Sins, survives from this era, with a cast list that includes Richard Burbage, William Sly, Richard Cowley, and Augustine Phillips, more Lord Chamberlain's Men of the future."]}, {"page": "John Gresham", "response": ["*Ursula Gresham (1534-1574), who married Thomas Leveson (1532-1576),.. son of the London mercer Nicholas Leveson (d.1539) and Denise or Dionyse Bodley (d.1561), the daughter of Thomas Bodley (d.1493) and Joan Leche (d. March 1530), by whom she was the mother of William Leveson (d.1621),Thomas Leveson and Ursula Gresham were also the parents of Sir John Leveson (1555–1615); ; Leveson, Sir John (1556–1615), History of Parliament Retrieved 6 April 2013. one of two trustees used by Cuthbert Burbage, Richard Burbage, William Kempe, Thomas Pope (d.1603), Augustine Phillips (d.1605), John Heminges (bap. 1566, d. 1630) and William Shakespeare (1564-1616) to allocate shareholdings in the Globe Theatre in 1599.; ; ."]}, {"page": "Boy player", "response": ["They performed female roles (and, of course, roles of male children if required) alongside adult male actors playing men or older female parts. In reference to Shakespeare's company, variously the Lord Chamberlain's Men (1594–1603) or the King's Men (1603 and after): Augustine Phillips left bequests to an apprentice, James Sands, and a former apprentice, Samuel Gilburne, in his will, read after his death in 1605; company members William Ostler, John Underwood, Nathan Field, and John Rice had all started their acting careers as Children of the Chapel at the Blackfriars Theatre."]}, {"page": "Lawrence Fletcher", "response": ["Augustine Phillips died in May 1605. He left 20 shillings to his \"fellow\" Fletcher. This is less than the 30 shillings he left to Shakespeare, Henry Condell, and Christopher Beeston, but the same sum he left to fellow King's Men Robert Armin, Alexander Cooke, Richard Cowley, and Nicholas Tooley. This seems to suggest that Fletcher was more than a mere name on a document to Phillips, though what more, precisely, is impossible to say, given the limits of the record."]}, {"page": "Nicholas Tooley", "response": ["Recent research has shown that Tooley was born in late 1582 or early 1583; his birth name was not Tooley but Wilkinson. (In 1623 he signed a codicil to his last will and testament \"Nicholas Wilkinson, alias Tooley.\")Edwin Nunzeger, A Dictionary of Actors and of Other Persons Associated with the Public Representation of Plays in England Before 1642, New Haven, Yale University Press, 1929; pp. 374–5. He has been associated with the \"Nick\" in the surviving \"plot\" of The Seven Deadly Sins, dated c. 1591. The association, if accurate, indicates that he began as a boy player. He was apprenticed to Richard Burbage, and may have followed that actor to the Lord Chamberlain's Men when that company re-formed in 1594. Tooley is mentioned in a letter of Joan Alleyn, Edward Alleyn's wife, in 1603, and he received a 20-shilling bequest in Augustine Phillips's 1605 will. He became a sharer in the King's Men in 1605, replacing the short-lived Samuel Crosse."]}, {"page": "Thomas Pope (actor)", "response": ["Nothing is known of Pope's early life. He was one of the English players who toured Denmark and Saxony in 1586–87, along with George Bryan, another future Chamberlain's man. He was in the production of The Seven Deadly Sins c. 1591, which was performed by a combination of personnel from Lord Strange's Men and the Admiral's Men, and which starred Edward Alleyn and included Bryan, Richard Burbage, Augustine Phillips, Richard Cowley, and John Sinklo, all soon-to-be Lord Chamberlain's Men. Pope toured with Lord Strange's Men under Edward Alleyn in 1593, with most of the same personnel."]}, {"page": "William Sly", "response": ["Nothing is known of Sly's early life. He enters the historical record by playing Porrex in the c. 1591 production of the play The Seven Deadly Sins (likely written by Richard Tarleton), along with Augustine Phillips, Thomas Pope, Richard Cowley, and George Bryan, all future colleagues in the Lord Chamberlain's Men. (That production was performed by a combination of personnel from the Lord Strange's Men and the Admiral's Men.) He is generally thought to have been with the Lord Chamberlain's Men at their re-formed start in 1594, probably at first as a hired man; he may have become a sharer in the company when George Bryan retired, c. 1597, though this is uncertain.", "In 1605 Sly became a shareholder in the Globe Theatre; in the same year he was one of the executors of Augustine Phillips's will. He was also one of the shareholders in the Blackfriars Theatre when the King's Men took it over in August 1608, but died soon after, his potential portion being divided among the other sharers. On 16 August 1608 he was buried in St. Leonard's Church in Shoreditch."]}, {"page": "Richard Cowley", "response": ["Cowley was in the c. 1591 production of The Seven Deadly Sins, performed by personnel from the Admiral's Men and Lord Strange's Men — a production that included Richard Burbage and other future King's Men. Cowley acted seven minor roles in that production. He also toured with some of the same personnel under Edward Alleyn in 1593. He is thought to have been an original shareholder in the Lord Chamberlain's Men when they re-formed in 1594; but little is known about his career, except for the fact that he played Verges in Much Ado About Nothing, along with William Kempe as Dogberry. For some reason he is not in the cast lists on the three Ben Jonson plays acted by the company in 1598–1603; but he is still one of the sharers when the company is chartered as the King's Men in 1603, and he receives a bequest in the 1605 will of Augustine Phillips. He is known to have married and had four children; two died young. His wife Elizabeth was buried on 28 September 1616 and his own burial followed on 12 March 1619. His will was witnessed by Cuthbert Burbage, John Heminges, Thomas Ravenscroft, and John Shank."]}, {"page": "George Bryan (actor)", "response": ["Bryan enters the historical record as one of a quintet of English actors who toured Denmark and Saxony in the years 1586 and 1587. He was in the Admiral's Men/Lord Strange's Men production of The Seven Deadly Sins, c. 1591, with Augustine Phillips and William Sly and other future Lord Chamberlain's Men. Bryan may also have toured with the same group of actors under Edward Alleyn in 1593. He is generally believed to have been one of the original members and sharers in the Lord Chamberlain's Men when that company was re-constituted in 1594; he certainly was a key member in 1596, when he and John Heminges received payment for a performance at Court. After that point, however, he apparently left the theatrical profession, seemingly around 1597. In 1603 and in the 1611–13 period, he was recorded as a Groom of the Chamber under James I."]}, {"page": "The Seven Deadly Sins (play)", "response": ["|Augustine Phillips"]}, {"page": "John Underwood (actor)", "response": ["When the brothers Richard and Cuthbert Burbage built The Globe Theatre in early 1599, they organized it as a shareholders' concern, keeping 50% of the business for themselves and dividing the other 50% among four of the Lord Chamberlain's Men – Shakespeare, Pope, Heminges, and Augustine Phillips. (Originally William Kempe was meant to be the seventh partner, but he sold out to the other four minority shareholders, giving each of them a 12.5% stake instead of 10%.) It has been argued that the Burbages pursued this arrangement out of necessity: their financial problems involving The Theatre and the Blackfriars left them in need of outside investors.Gurr, pp. 45–6. It is generally held that the Globe arrangement constituted the first case in which the standard sharers' partnership in a playing company was extended to theatre construction and ownership. Yet the Curtain Theatre shares owned by Underwood and Pope suggest that the Globe was perhaps not the initial instance of such an arrangement, and that the Burbages applied to the Globe a structure that was already familiar to the Lord Chamberlain's Men from the Curtain."]}, {"page": "King's Men personnel", "response": ["* Augustine Phillips – principal actor.", "* James Sands, or Saunder – boy player and Augustine Phillips's apprentice. Phillips left Sands 40 shillings and three musical instruments in his 1605 last will and testament; but William Sly left Sands £40 in his 1608 will.Halliday, pp. 367, 431, 458. An obscure figure, Sands may have been with Queen Anne's Men c. 1617.", "* John Witter – a householder in the Globe, after he married the widow of Augustine Phillips. He forfeited his share in 1613, when the Globe burned down; he declined to invest in its replacement.Adams, pp. 4–5."]}, {"page": "Phillips (surname)", "response": ["*Augustine Phillips (??–1605), English actor"]}, {"page": "Outline of William Shakespeare", "response": ["* Augustine Phillips"]}, {"page": "John Leveson", "response": ["Leveson had a younger brother, William Leveson (d.1621), one of two trustees used by William Kempe, Thomas Pope (d.1603), Augustine Phillips (d.1605), John Heminges (bap. 1566, d. 1630) and William Shakespeare (1564-1616) to allocate shareholdings in the Globe Theatre in 1599.; ; ."]}, {"page": "Thomas Brend", "response": ["Three months after his father's death, Nicholas Brend leased part of his father's Southwark property to Cuthbert Burbage, Richard Burbage, William Shakespeare, Augustine Phillips, Thomas Pope, John Heminges, and William Kempe. The lease agreement took effect at Christmas 1598, although it was not signed until 21 February 1599, by which time, according to Berry, 'the worthwhile pieces of the old Theatre in Shoreditch had probably been lying about the place for some six weeks, ready for assembly' into the new Globe Theatre.."]}, {"page": "Joan Leche", "response": ["*** William Leveson (d.1621) was one of two trustees used by William Kempe, Thomas Pope, Augustine Phillips, John Heminges and William Shakespeare (1564-1616) to allocate shareholdings in the Globe Theatre in 1599.; ; ."]}, {"page": "William Leveson", "response": ["In 1599 Leveson was one of two trustees used by William Kempe, Thomas Pope (d.1603), Augustine Phillips (d.1605), John Heminges (bap. 1566, d. 1630) and William Shakespeare (1564-1616) to allocate shareholdings in the Globe Theatre. At the time, Leveson was churchwarden in the parish of St Mary Aldermanbury. Later, he resided in Philip Lane 'over against the great Digges mansion'.; ; ."]}, {"page": "Thomas Savage (Shakespeare's trustee)", "response": ["In 1599 Savage, together with William Leveson, was one of two trustees used by William Kempe, Thomas Pope (d.1603), Augustine Phillips (d.1605), John Heminges and William Shakespeare to allocate shareholdings in the Globe Theatre."]}, {"page": "Nicholas Brend", "response": ["Nicholas Brend (c. 1560 – 12 October 1601) was an English landowner who inherited from his father the land on which the Globe Theatre was built, and on 21 February 1599 leased it to Cuthbert Burbage, Richard Burbage, William Shakespeare, Augustine Phillips, Thomas Pope, John Heminges, and William Kempe.. He died two years later, leaving the property on which the Globe was built to his infant son, Matthew Brend, who did not come of age until 6 February 1621..", "Shortly after his father's death, Nicholas Brend leased part of his father's Southwark property for 31 years at a yearly rent of £14 10s to Cuthbert Burbage, Richard Burbage, William Shakespeare, Augustine Phillips, Thomas Pope, John Heminges, and William Kempe. The lease agreement took effect at Christmas 1598, although it was not signed until 21 February 1599, and ran until 25 December 1629.. According to Berry:"]}, {"page": "Matthew Brend", "response": ["Sir Matthew Brend (6 February 1600 – 1659) inherited from his father, Nicholas Brend, the land on which the first and second Globe Theatres were built, and which Nicholas Brend had leased on 21 February 1599 for a 31-year term to Cuthbert Burbage, Richard Burbage, William Shakespeare, Augustine Phillips, Thomas Pope, John Heminges, and William Kempe.. During much of the time he was the legal owner of the Globe, Matthew Brend was underage, and his properties were managed for him by Sir Matthew Browne, John Collet, Sir John Bodley, and Sir Sigismund Zinzan. In 1623 Brend conveyed the property on which the Globe was built to his wife, Frances, as part of her jointure. In 1632 he was sued in the Court of Requests by the remaining original lessee, Cuthbert Burbage, and others, for an extension of their original lease.", "Shortly after his own father's death, Nicholas Brend had leased part of his father's Southwark property for 31 years at a yearly rent of £14 10s to Cuthbert Burbage, Richard Burbage, William Shakespeare, Augustine Phillips, Thomas Pope, John Heminges, and William Kempe. The lease agreement took effect at Christmas 1598, although it was not signed until 21 February 1599, and ran until 25 December 1629.."]}, {"page": "Robert Gough (actor)", "response": ["On 13 February 1602 he married Elizabeth Phillips, the sister of Augustine Phillips, the actor, who received from her brother a testamentary bequest of 10l \"of lawfull money of England.\" Under the name Robert Goffe, Goughe is a witness to Phillips's will, which is dated 4 May 1605."]}, {"page": "Samuel Gilburne", "response": ["Samuel Gilburne (fl. 1605, d. after 1623) was an Elizabethan actor who is listed as one of the \"Principall Actors\" in the prefatory material of the First Folio of William Shakespeare's plays. Gilburne is named as a former apprentice to Augustine Phillips, another member of Shakespeare's company, in Phillips' will dated 4 May 1605, in which Gilburne is bequeathed 40 shillings, Phillips's \"mouse-colored\" velvet hose, his black taffeta suit and white taffeta doublet, his purple cloak, his sword and dagger, and his bass viol. A copy of the First Folio held at the Folger Shakespeare Library has a signature thought to be Gilburne's."]}, {"page": "Will (TV series)", "response": ["* Jamie Beamish as Augustine Phillips"]}]}}