{"wiki_id": "http://www.wikidata.org/entity/Q4485139", "itemLabel": "John Forster FitzGerald", "itemDescription": "Irish officer of the British Army", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Forster_FitzGerald", "wikipedia_page": {"main": "Field Marshal Sir John Forster FitzGerald, GCB (c.1785 – 24 March 1877), was a soldier from Ireland who served as an officer in the British Army. He fought in the Peninsular War, seeing action at the Battle of Badajoz, the Battle of Salamanca and the Battle of Vitoria and commanding a brigade during the Battle of the Pyrenees before being captured by the French Army. He became Commandant of Quebec and then went on to be Commandant of Montreal, Quebec. He was given command of the 20th Regiment of Foot in Bombay before being given a divisional command in the Madras Army but shortly afterwards transferring to Bombay where he was given a divisional command of the Bombay Army. He later became a Liberal Member of Parliament.", "link_mentions": [{"page": "John Fitzgerald", "response": ["*Sir John Forster FitzGerald (1785–1877), Irish soldier, officer in British Army during the Napoleonic wars and Liberal MP"]}, {"page": "Arbuthnot baronets", "response": ["* Sir Robert Keith Arbuthnot, 2nd Baronet (1801–1873) married Anne Fitzgerald, daughter of Field Marshal Sir John Forster FitzGerald, G.C.H., and his wife, Charlotte, child of the Hon. William Hazen. Lady Arbuthnot's Chamber is named after Lady Anne, who died at Florence, Italy, 6 March 1882, her husband having predeceased her on 4 March 1873. The couple had five sons and two daughters."]}, {"page": "Royal Irish Regiment (1684–1922)", "response": ["*1850–1877: F.M. Sir John Forster FitzGerald GCB"]}, {"page": "Sir Robert Arbuthnot, 2nd Baronet", "response": ["On 20 March 1828, he married Anne Fitzgerald, daughter of Field Marshal Sir John Forster FitzGerald. They had seven children:"]}, {"page": "John Forster Fitzgerald", "response": ["#REDIRECT John Forster FitzGerald "]}, {"page": "United Kingdom general election records", "response": ["*John Forster FitzGerald, 1852: 66–67"]}, {"page": "John Fitzegrald", "response": ["#REDIRECT John Forster FitzGerald"]}, {"page": "John FitzGerald (general)", "response": ["#REDIRECT John Forster FitzGerald"]}, {"page": "John Foster Fitzgerald", "response": ["#redirect John Forster FitzGerald"]}, {"page": "Sir John FitzGerald", "response": ["#REDIRECT John Forster FitzGerald"]}, {"page": "Sir Archibald Campbell, 1st Baronet", "response": ["In 1813 Campbell was appointed to the rank of major-general in the Portuguese army. In 1816 he was given command of the Lisbon division. He returned to the service of Britain in 1820, after a revolution in Portugal. Campbell was appointed colonel of the 38th Regiment of Foot (in which post he was succeeded by Field Marshal Sir John Forster FitzGerald, GCB) and went to India with it.  For his Peninsula service, Campbell was awarded the Army Gold Cross with one clasp for the battles of Albuera, Vitoria, the Pyrenees, the Nivelle, and the Nive."]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|John Forster FitzGerald", "|John Forster FitzGerald"]}]}}