{"wiki_id": "http://www.wikidata.org/entity/Q448744", "itemLabel": "Emily Gravett", "itemDescription": "English children's illustrator and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Gravett", "wikipedia_page": {"main": "Emily Gravett (born 1972) is an English author and illustrator of children's picture books. For her debut book Wolves published in 2005 and Little Mouse's Big Book of Fears published three years later, she won the annual Kate Greenaway Medal recognising the year's best-illustrated British children's book.\n\n", "link_mentions": [{"page": "University of Brighton", "response": ["Many prominent figures in the arts have attended the University, or the institutions from which it was formed. These include Turner Prize winners Keith Tyson and Rachel Whiteread (1982–85)\"Rachel Whiteread\", Alumni and Associates, Faculty of Arts, University of Brighton studied at the Faculty of Arts, Brighton, as did Keith Coventry, the winner of 2010 John Moores Painting Prize, the photographer Ewen Spencer, the artist Alison Lapper, the designer Julien Macdonald and the writer-illustrator Emily Gravett.", "The list of students, lecturers and researchers once at Brighton includes Kate Greenaway Medal winners Emily Gravett, Raymond Briggs and Quentin Blake; children's writer-illustrator Lucy Cousins; Magnum photographer Mark Power; fashion designer Barbara Hulanicki; world champion bridge player Sandra Landy; and adventurer and conservationist Holly Budge."]}, {"page": "Nestlé Smarties Book Prize", "response": ["::* 6–8 years: Little Mouse's Big Book of Fears by Emily Gravett (Macmillan Children's Books)", "::* 0–5 years: Wolves by Emily Gravett (MacMillan)"]}, {"page": "Kate Greenaway Medal", "response": [" | 2008 || Emily Gravett || Little Mouse's Big Book of Fears || — ", " | 2005 || Emily Gravett || Wolves || — ", "* Emily Gravett, Wolves (Pan Macmillan) @ ", "Wolves by Emily Gravett in its U.S. edition was Gravett's first book as author or illustrator, one year out of school. She won the 49th Greenaway Medal, awarded in the 51st year, called fifty for the anniversary celebration in 2007.", "* Emily Gravett, Orange Pear Apple Bear (Pan Macmillan) @ — four words only", "* Emily Gravett, Little Mouse's Big Book of Fears (Pan Macmillan) @", "* Emily Gravett, Monkey and Me (Pan Macmillan) @", "Gravett won her second medal for her fourth book, with cover title Little Mouse's Emily Gravett's Big Book of Fears.", "* Emily Gravett, Wolf Won't Bite! (Pan Macmillan) @", "* Emily Gravett, Again! (Pan Macmillan)", "* Emily Gravett, Tidy (Two Hoots)"]}, {"page": "Julia Donaldson", "response": ["|rowspan=\"2\"| 2010 || Cave Baby ||  || Emily Gravett ||"]}, {"page": "United Kingdom Literacy Association", "response": ["* 7 to 11 category: The Imaginary by A. F. Harrold and Emily Gravett"]}, {"page": "List of people from Brighton and Hove", "response": ["*Emily Gravett, children's author and illustrator, lives in Brighton"]}, {"page": "University of Brighton School of Art", "response": ["Turner Prize winners Keith Tyson and Rachel Whiteread studied there, as did artists Alison Lapper, Keith Coventry, Sylvia Sleigh, designer Julien Macdonald and writer-illustrator Emily Gravett. ", "Students, lecturers and researchers once at Brighton include sculptor Anthony Gormley, Kate Greenaway Medal winners Emily Gravett, Raymond Briggs and Quentin Blake; artist Mike Chaplin; children's writer-illustrator Lucy Cousins; Magnum photographer Mark Power; fashion designers Barbara Hulanicki and Julien Macdonald.http://www.brighton.ac.uk/news/2004/041103fashionaward.php?PageId=824"]}, {"page": "Blue Peter Book Award", "response": ["** Spells by Emily Gravett (Macmillan)"]}, {"page": "Wolves (book)", "response": ["Wolves is picture book written and illustrated by Emily Gravett, published by Macmillan in 2005. Her first book, it won the annual Kate Greenaway Medal from the Chartered Institute of Library and Information Professionals as the year's best-illustrated children's book published in the United Kingdom."]}, {"page": "Hampshire Book Awards", "response": ["**Meerkat Mail by Emily Gravett", "**Wolves by Emily Gravett", "*2013 Wolf Won't Bite by Emily Gravett"]}, {"page": "Booktrust Early Years Award", "response": ["** Best Emerging Illustrator Award: Emily Gravett, for Monkey and Me (Macmillan)", "***Emily Gravett, for Monkey and Me (Macmillan)", "***Emily Gravett, Orange Pear Apple Bear (Macmillan Children’s)"]}, {"page": "Little Mouse's Big Book of Fears", "response": ["Little Mouse's Big Book of Fears is a children's picture book written and illustrated by Emily Gravett, published by Macmillan in 2007. It won the annual Kate Greenaway Medal from the professional librarians as the year's best-illustrated children's book published in the U.K.", "It is represented as an activity book (intended for the user to document their own fears and how they overcame them) that has been filled in and illustrated by \"Little Mouse\". The front cover illustration shows the title Little Mouse's Emily Gravett's Big Book of Fears and a hole chewed by a mouse. The book was published in the U.S. by Simon & Schuster in 2008. At least in the U.S., the title page also gives that form and notes, \"Previously published in 2007 under title: Emily Gravett's big book of fears.\" That is in the tradition of her first Greenaway Medal-winner Wolves (Macmillan, 2005), about a rabbit, which was published in the U.S. as \"Wolves by Emily Grrrabbit\"."]}, {"page": "Emily (given name)", "response": ["* Emily Gravett (born 1972), British children's author and illustrator"]}, {"page": "The Odd Egg", "response": ["The Odd Egg is a children's picture book written and illustrated by British illustrator Emily Gravett."]}, {"page": "Orange Pear Apple Bear", "response": ["Orange Pear Apple Bear is a children's book written by award-winning author and illustrator Emily Gravett. Throughout the book only the four words \"orange, pear, apple\" and \"bear\" are used, with the exception of a single use of the word \"there\" on the last page, but are placed in a different order every time."]}, {"page": "BookTrust", "response": ["*Storytime Prize: This prize was set up in 2019 and celebrates and promotes the best books for sharing and repeat reading with young children. The first book to win the prize is Cyril and Pat by Emily Gravett."]}, {"page": "List of World Book Day books", "response": ["*Little Book Day Parade by Emily Gravett (Macmillan Children's Books)", "*Evie in the Jungle written by Matt Haig, illustrated by Emily Gravett (Canongate)"]}, {"page": "2012 in literature", "response": ["*Emily Gravett – Matilda's Cat"]}, {"page": "Gravett", "response": ["*Emily Gravett, English children's author and illustrator"]}, {"page": "Template talk:Authority control/Archive 1", "response": ["::::: Re LCCN syntax another editor has explained to me that \"n/2005/72286\" is or recently was necessary for dates in the 2000s. See Emily Gravett#External links for an example that is notable also for my hidden COMMENT on the disunity of VIAF records (please advise)."]}, {"page": "Template talk:Authority control/Archive 2", "response": [":: I can show you what I have done for a score of English-language writers and illustrators. Emily Gravett#External links. "]}, {"page": "The Imaginary (novel)", "response": ["The Imaginary is a 2014 British children's novel written by A. F. Harrold and illustrated by Emily Gravett. It is about a little girl, Amanda, and her imaginary friend, Rudger. An anime film adaptation by Studio Ponoc will open in Japan in Q3 2022."]}, {"page": "Matilda's Cat", "response": ["Matilda's Cat is a 2012 Children's picture book by Emily Gravett. It is about Matilda, a girl dressed in a ginger-striped cat costume, who attempts to involve her similarly ginger-striped cat in various activities to no avail but then eventually snuggles up with the cat in bed."]}]}}