{"wiki_id": "http://www.wikidata.org/entity/Q448543", "itemLabel": "Jean Lambert", "itemDescription": "British politician (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jean_Lambert", "wikipedia_page": {"main": "Jean Denise Lambert (born Jean Denise Archer; 1 June 1950 in Orsett, Essex) is an English politician, and who served as a Member of the European Parliament for the London Region between 1999 and 2019.", "link_mentions": [{"page": "European Parliament", "response": ["The Strasbourg seat is seen as a symbol of reconciliation between France and Germany, the Strasbourg region having been fought over by the two countries in the past. However, the cost and inconvenience of having two seats is questioned. While Strasbourg is the official seat, and sits alongside the Council of Europe, Brussels is home to nearly all other major EU institutions, with the majority of Parliament's work being carried out there. Critics have described the two-seat arrangement as a \"travelling circus\", and there is a strong movement to establish Brussels as the sole seat. This is because the other political institutions (the Commission, Council and European Council) are located there, and hence Brussels is treated as the 'capital' of the EU. This movement has received strong backing from numerous figures, including Margot Wallström, Commission First-Vice President from 2004 to 2010, who stated that \"something that was once a very positive symbol of the EU reuniting France and Germany has now become a negative symbol of wasting money, bureaucracy and the insanity of the Brussels institutions\". The Green Party has also noted the environmental cost in a study led by Jean Lambert MEP and Caroline Lucas MEP; in addition to the extra 200 million euro spent on the extra seat, there are over 20,268 tonnes of additional carbon dioxide, undermining any environmental stance of the institution and the Union. The campaign is further backed by a million-strong online petition started by Cecilia Malmström MEP. In August 2014, an assessment by the European Court of Auditors calculated that relocating the Strasbourg seat of the European Parliament to Brussels would save €113.8 million per year. In 2006, there were allegations of irregularities in the charges made by the city of Strasbourg on buildings the Parliament rented, thus further harming the case for the Strasbourg seat."]}, {"page": "June 1", "response": ["*  1950   – Jean Lambert, English educator and politician"]}, {"page": "Green Party of England and Wales", "response": ["During the 1999 European Parliament elections, the first to be held in the UK using proportional representation, the Greens gained their first Members of the European Parliament (MEPs), Lucas (South East England) and Jean Lambert (London). At the inaugural London Assembly Elections in 2000, the party gained 11% of the vote and returned three Assembly Members (AMs). Although this dropped to two following the 2004 London Assembly elections, the Green AMs proved vital in passing the annual budget of former Mayor Ken Livingstone.", "| Jean Lambert", "Since the first UK election to the European Parliament with proportional representation, in June 1999, the Green Party of England and Wales has had representation in the European Parliament. From 1999 to 2010, the two MEPs were Jean Lambert (London) and Lucas (South East England). In 2010, on election to the House of Commons, Lucas resigned her seat and was succeeded by Keith Taylor. In May 2014, Taylor and Lambert held their seats, and were joined by Molly Scott Cato who was elected in the South West region, increasing the number of Green Party Members of the European Parliament to three for the first time.Green Party of England and Wales election results#European Parliament elections In May 2019, this number rose to seven: Scott Ainslie (London), Ellie Chowns (West Midlands), Gina Dowding (North West England), Magid Magid (Yorkshire and the Humber), Alexandra Phillips (South East England), Catherine Rowett (East of England), and the re-elected Scott Cato.", "|Jean Lambert"]}, {"page": "List of members of the European Parliament for the United Kingdom (1999–2004)", "response": ["| Jean Lambert "]}, {"page": "Members of the European Parliament for the United Kingdom 1999–2004 by region", "response": ["# Jean Lambert"]}, {"page": "Respect Party", "response": ["Respect initially tried to form an electoral pact with the Green Party of England and Wales but this proved unsuccessful.Matthew Tempest \"Monbiot quits Respect over threat to Greens\", The Guardian, 17 February 2004 The Greens stated that they had selected their candidates for the 2004 European Parliamentary elections by postal ballot months previously and that they were also sceptical of the SWP's influence over Respect. After Respect decided to stand candidates against the Greens, Monbiot stepped down from the party in February 2004, claiming that to compete against the Greens might threaten the positions of \"two of the best elected representatives in Britain\", the Green Members of the European Parliament (MEPs) Caroline Lucas and Jean Lambert."]}, {"page": "Leader of the Green Party of England and Wales", "response": ["*Jean Lambert", "| Feb–Sep 1992  || Richard Lawson|| rowspan=2 | Jean Lambert", "| 1998–1999 || Jean Lambert", ":1994: Jean Lambert"]}, {"page": "List of members of the European Parliament (1999–2004)", "response": ["*Jean Lambert"]}, {"page": "Green Party (UK)", "response": ["| Jean Lambert", "|rowspan=3| Jean Lambert"]}, {"page": "President of the European Parliament", "response": ["At the end of Martin Schulz's term, the presidency for the remainder of the eighth European Parliament (2014–2019) would have been due by convention to pass to an EPP member. However, the EPP–S&D agreement appeared broken, making it less certain that Antonio Tajani (EPP, Italy) would be elected president. The other contenders were Gianni Pittella (S&D, Italy), Guy Verhofstadt (ALDE, Belgium), Helga Stevens (ECR, Belgium), Eleonora Forenza (GUE/NGL, Italy) and Jean Lambert (Greens/EFA, UK). On 17 January 2017, Tajani was elected after four rounds of voting, following the withdrawal of Verhofstadt and declaration of support for the EPP candidate by the ALDE."]}, {"page": "List of members of the European Parliament (2004–2009)", "response": ["|Jean Lambert||United Kingdom||London||Greens (E&W)||Greens-EFA"]}, {"page": "Mike Woodin", "response": ["Michael Edward Woodin (6 November 1965 – 9 July 2004) was the Principal Speaker of the Green Party of England and Wales and a city councillor for Oxford from 1994 to 2004. He was Principal Speaker for six of the eight years between 1998 and 2004, firstly alongside Jean Lambert before her election as an MEP, then alongside Margaret Wright, and lastly with Caroline Lucas MEP."]}, {"page": "Jean Lambert MEP", "response": ["#REDIRECT Jean Lambert"]}, {"page": "Newington Green", "response": ["NGUC celebrated its tercentenary in 2008 under the slogan \"300 years of dissent\", marking this with events such as planting a crab apple tree,25 Feb 2009 Newington Green Action Group  organising a picnic in conjunction with the Newington Green Action Group, and hosting a concert of Ottoman classical music.New Unity tercentenary page (Newington Green has a strong Turkish population.)  The following year it commemorated the 250th anniversary of the birth of Mary Wollstonecraft, attaching a large banner to the railings outside the building, proclaiming it the \"birthplace of feminism\", in a nod to the formative years that she spent worshipping there.\"Strength in Unity?\" by Judith Evans. 19 March 2009 The Guardian\"Festival for ‘first feminist’\" by Peter Gruner, 17 April 2009, Islington Tribune NGUC sponsored a series of events, including a return visit and lecture by biographer Barbara Taylor; a panel discussion about women and power, between female politicians Diane Abbott MP, Jean Lambert MEP, and Emily Thornberry MP; an art exhibition entitled Mother of Feminism; a concert featuring Carol Grimes and Adey Grummet to raise money for Stop the Traffik, an anti-trafficking charity; a tombstone tribute at St Pancras Old Church; a birthday cake baked by men; and other activities.\"Birthplace of Feminism\" by Guy Bentham, in N16, issue 41, spring 2009New Unity Wollstonecraft page"]}, {"page": "Antonio Tajani", "response": ["At the end of Martin Schulz's term, the presidency for the remainder of the eighth European Parliament (2014–2019) would have been due by convention to pass to an EPP member. However, the EPP–S&D agreement appeared broken, making it less certain that Tajani, who was selected as EPP candidate, would be elected president. The other contenders were the social-democrat Gianni Pittella, the liberal Guy Verhofstadt, the conservative Helga Stevens, the leftist Eleonora Forenza and the green Jean Lambert. On 17 January 2017, Tajani was elected after four rounds of voting, following the withdrawal of Verhofstadt and declaration of support for the EPP candidate by the ALDE; he was first Italian to hold the office since the Christian democrat Emilio Colombo (1977–1979)."]}, {"page": "London (European Parliament constituency)", "response": ["| colspan = 11 | Jean LambertGreen", "|rowspan=\"1\"| Green(Jean Lambert)", "|rowspan=\"1\"| Green(Jean Lambert)", "|rowspan=\"1\"| Green(Jean Lambert)", "|rowspan=\"1\"| Green(Jean Lambert)"]}, {"page": "Institutional seats of the European Union", "response": ["Critics have described the three-city arrangement as a \"travelling circus\" with a cost an extra 200 million euro over a single location. Defenders of the Strasbourg seat, like the MEP for Germany Bernd Posselt, however claim that the figure is rather a mere 40 million euro, i.e. an extra cost of 8 cents per EU citizen. When Parliament was forced to meet in Brussels in September 2008, due to a fault in the Strasbourg building, it was estimated that Parliament saved between €3 and 4 million, though the exact figure is hard to calculate. As the Commission also meets in Strasbourg when Parliament is out of Brussels, the cost of Commissioners moving amounted to €9.5 million between 2002 and 2007. The Green party has also noted the environmental cost in a study led by Jean Lambert, MEP and Caroline Lucas, MEP; in addition to the extra financial cost, there are over 20,268 tonnes of additional carbon dioxide, undermining any environmental stance of the institution and the Union. Jens-Peter Bonde, former leader of the ID group, stated in 2007 that unless the issue of the seat was tackled, it would be impossible to increase the election's turnout, as the movement of the seat was the issue raised by voters most often. He, along with Green co-leader Monica Frassoni, called for a debate on the issue, which was being blocked by President Hans-Gert Pöttering."]}, {"page": "Felix Dodds", "response": ["After serving the NLYL, Dodds published his first book, Into the Twenty-First Century: An Agenda for Political Realignment. His work called for closer co-operation between Green members on the left in British politics. Contributors to the book included: Jonathon Porritt, Jean Lambert, Peter Hain, Simon Hughes, Michael Meadowcroft, Sara Parkin, Petra Kelly in Germany, Jeremy Seabrook, Peter Tatchell and Hilary Wainwright. In 1988, Dodds co-founded Green Voice, which worked for two years to create a dialogue between Green members on the left of UK politics. In 2018 he published his autobiography about those years: Power to the People: Confessions of a Young Liberal Activists 1975–1988."]}, {"page": "National League of Young Liberals", "response": ["In his final speech as chair of the Young Liberals, Dodds called for \"a rainbow alliance on the left in British politics\". In 1988, he and other Young Liberals formed an informal alliance with leading Green Party members Tim Cooper, Jean Lambert and Liz Crosbie called Green Voice. This alliance investigated how they might be better relations and campaigns joining together members of both parties. The two Green Voice Conferences in 1988 played a key role in enabling leading MPs Simon Hughes and Michael Meadowcroft to outline to the new Social and Liberal Democratic Party the kind of green agenda that the new party should adopt. Hughes, at the press conference for the first Green Voice Conference, announced that he would not join the new Social and Liberal Democrats Party unless it was to accept a strong green agenda. In 2018, Felix Dodds published his autobiography about the Green Guards, Power to the People: Confessions of a Young Liberal Activist 1975-1987.Power to the People: Confessions of a Young Liberal Activist 1975-1987 https://smile.amazon.co.uk/dp/1977047246/ref=cm_sw_r_cp_api_glt_fabc_J60K9RS3872YNHYK9A0J"]}, {"page": "History of the Green Party of England and Wales", "response": ["In the 1999 European elections, two Greens were elected Members of the European Parliament (MEPs): Caroline Lucas (South East England) and Jean Lambert (London). They retained their seats in the 2004 European elections, despite a reduction in number of seats available. Overall, the Party gained 1,033,093 votes in the 2004 European election."]}, {"page": "List of political parties in the United Kingdom by representation", "response": ["|Jean Lambert; Caroline Lucas; Keith Taylor; Molly Scott Cato"]}, {"page": "Lambert (name)", "response": ["* Jean Lambert (b. 1950), politician"]}, {"page": "2009 G20 London summit protests", "response": ["Jenny Jones, a member of the Metropolitan Police Authority, said of reports of police brutality that \"If the police were hitting people who were sitting down with their hands up, we have entered a new era of overt violent policing in Britain that will deter people from protesting and cut back our civil liberties\". A police Commander said that their \"tactics were proportionate and worked\". Jean Lambert, MEP, of the London Green Party, wrote an open letter to the Metropolitan Police Commissioner after the event asking for an explanation of the police tactics at the climate camp."]}, {"page": "Newington Green Unitarian Church", "response": ["The following year it commemorated the 250th anniversary of the birth of Mary Wollstonecraft,\"Festival for ‘first feminist’\" by Peter Gruner, 17 April 2009, Islington Tribune attaching a large banner to the railings outside the building, proclaiming it the \"birthplace of feminism\", in a nod to the formative years that she spent worshipping there. NGUC sponsored a series of events, including a return visit and lecture by biographer Barbara Taylor; a panel discussion about women and power, between female politicians Diane Abbott MP, Jean Lambert MEP, and Emily Thornberry MP;\"Right, so just what do you do all day?\" by Aida Edemariam, 19 May 2009 The Guardian an art exhibition titled Mother of Feminism; a concert featuring Carol Grimes and Adey Grummet, to raise money for Stop the Traffik, an anti-trafficking charity; a tombstone tribute at St Pancras Old Church; a birthday cake baked by men; and other activities.\"Birthplace of Feminism\" by Guy Bentham, in N16, issue 41, spring 2009"]}]}}