{"wiki_id": "http://www.wikidata.org/entity/Q44870707", "itemLabel": "Maddison Jaizani", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Maddison_Jaizani", "wikipedia_page": {"main": "Maddison Jaizani is a British actress and model. She is known for portraying Sophie de Clermont on the Canal+ television series Versailles, Odessa in the AMC series Into the Badlands, and Bess Marvin in the CW series Nancy Drew.", "link_mentions": [{"page": "Into the Badlands (TV series)", "response": ["* Maddison Jaizani as Odessa, a former Doll who becomes one of The Widow's Butterflies, and later is Tilda's lover. (season 2–3)"]}, {"page": "Versailles (TV series)", "response": ["*Maddison Jaizani as Béatrice's daughter Sophie de Clermont, later the Duchesse de Cassel"]}, {"page": "Nancy Drew (2019 TV series)", "response": ["The series is narrated and led by the amateur sleuth Nancy Drew, played by Kennedy McMann, and features an ensemble cast with re-imagined versions of the characters from the books: Leah Lewis as George Fan, Maddison Jaizani as Bess Marvin, Tunji Kasim as Ned Nickerson,and Alex Saxon as Ace. It also stars Scott Wolf as Carson Drew, Alvina August and Riley Smith as new characters invented for the series.", "* Maddison Jaizani as Bess Turani Marvin, a rich city girl with a mysterious past who works as a waitress with Nancy at The Bayside Claw and is also part of the Drew Crew.", "In early 2019, the pilot was cast with Kennedy McMann as the title character, Tunji Kasim as Ned \"Nick\" Nickerson, Alex Saxon as Ace, Leah Lewis as George, Maddison Jaizani as Bess, and Freddie Prinze Jr. as Nancy's father, Carson Drew. Pamela Sue Martin, who played Nancy Drew in the 1970s series The Hardy Boys/Nancy Drew Mysteries, was cast as Harriet Grosset for the pilot in April 2019. On May 9, 2019, it was announced that Scott Wolf had replaced Prinze in the role of Carson Drew. Riley Smith joined cast as Ryan Hudson on May 16, 2019. On October 28, 2019, Miles Gaston Villanueva was cast in a recurring role."]}, {"page": "List of lesbian characters in television", "response": ["| Bess Marvin || Maddison Jaizani || Nancy Drew || Waitress at The Bayside Claw. Romantically involved with Lisbeth, but believing that she was going to die, Bess stood up Lisbeth by not going to the dinner date where she was to be introduced to her parents.", "| Odessa || Maddison Jaizani || Into the Badlands || Former Doll (sex slave). Girlfriend of Tilda (bisexual). Saves Tilda's life and helps her escape from The Widow."]}, {"page": "List of dramatic television series with LGBT characters: 2016–2019", "response": ["|rowspan=\"2\"|2019– ||rowspan=\"2\"| Nancy Drew ||rowspan=\"2\"| The CW || Bess Marvin || Maddison Jaizani || Bess Marvin is a lesbian and a waitress at The Bayside Claw. She develops a romantic interest in Lisbeth."]}]}}