{"wiki_id": "http://www.wikidata.org/entity/Q44833148", "itemLabel": "Vincent Gaffney", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Vincent_Gaffney", "wikipedia_page": {"main": "Vincent Gaffney  (born 25 February 1958) is a British archaeologist and the Anniversary Chair in Landscape Archaeology at the University of Bradford.\nGaffney has directed research projects around the world.  Most recently, he has become known for his work on Doggerland, a submerged landmass that existed in the North Sea in the early Holocene.  Other recent work includes the Anglo-Austrian “Stonehenge Hidden Landscapes Project\", The Curious Travellers Project, the Adriatic islands Project, and the pit alignment at Warren Fields  He was Co-PI on the EPSRC GG-TOP Gravity Gradient Project. Other fieldwork has included analysis of Roman villas on the Berkshire Downs (UK), survey at Roman Wroxeter, Diocletian's Palace, the Cetina Valley in Croatia, Forum Novum and Cyrene, Libya.", "link_mentions": [{"page": "List of archaeologists", "response": ["*Vincent Gaffney (born 1958) British; landscape archaeology"]}, {"page": "Durrington Walls", "response": ["Further investigation by a team led by Vincent Gaffney in 2021 concluded that the pits were human-made, and not natural features. Optically stimulated luminescence tests revealed that soil within the pits had not been exposed to daylight since 2400BC. Examination of the pits demonstrated they were in use from the late neolithic until the middle bronze age. Gaffney described the pits as \"the largest prehistoric structure found in Britain.\""]}, {"page": "Doggerland", "response": ["Interest was reinvigorated in the 1990s by Bryony Coles, who named the area \"Doggerland\" \"after the great banks in the southern North Sea\" – and produced speculative maps of the area.B.J. Coles. \"Doggerland : a speculative survey (Doggerland : une prospection spéculative)\", Proceedings of the Prehistoric Society, , 1998, vol. 64, pp. 45–81 (3 p.1/4) Although she recognised that the current relief of the southern North Sea seabed is not a sound guide to the topography of Doggerland, this topography has more recently begun to be reconstructed more authoritatively using seismic survey data obtained from oil exploration. Between 2003 and 2007, a team at the University of Birmingham led by Vince Gaffney and Ken Thomson mapped around  of the Early Holocene landscape, using seismic data provided for research by Petroleum Geo-Services, as part of the work of the University of Birmingham North Sea Palaeolandscapes Project.North Sea Palaeolandscapes Project The results of this study were published as a technical monograph and a popular book on the history and archaeology of Doggerland.Laura Spinney, \"The lost world: Doggerland\"Vincent Gaffney, Simon Fitch, David Smith, Europe's Lost World: The rediscovery of Doggerland, University of Birmingham, 2009 Names have been given to some of its features: \"The Spines\" to a system of dunes above the broad \"Shotton River\", the upland area of the \"Dogger Bank\", a basin between two huge sandbanks called \"The Outer Silver Pit\". ", "*2013 European Heritage Prize awarded to M. Daniel Thérond and Professor Vincent Gaffney#"]}, {"page": "Christopher Gaffney (archaeologist)", "response": ["He is married to Susan Gaffney and has two children  - James Gaffney and Bella Gaffney.  He is the brother of Vincent Gaffney, also a British archaeologist.", "In the summer of 2007, Gaffney was awarded an honorary degree by the University of Bradford for \"popularising archaeological geophysics via Time Team and other media opportunities\". From October 2007, he was employed as a lecturer in Archaeological Geophysics at the University of Bradford, and is currently Head of the School of Archaeological and Forensic Sciences. As part of the School, Gaffney was active in founding, with Andrew Wilson, Bradford Visualisation in 2013. Bradford Visualisation (BradViz), is a research group dedicated to establishing digital methods and visualisation as an integral part of archaeological research at Bradford. The group has grown significantly since 2013 and is now managed by Gaffney, Wilson, and Vincent Gaffney.  Key research projects associated with Bradford Visualisation and Gaffney include \"Fragmented Heritage\", \"Digitised Diseases\", \"From Cemetery to Clinic\" and \"Augmenting Jordanian Heritage.\""]}, {"page": "Vincent Gaffney", "response": ["Vincent Gaffney  (born 25 February 1958) is a British archaeologist and the Anniversary Chair in Landscape Archaeology at the University of Bradford.", "* Vincent Gaffney's Academia page with extensive bibliographic information "]}]}}