{"wiki_id": "http://www.wikidata.org/entity/Q448303", "itemLabel": "Elliott Bennett", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Elliott_Bennett", "wikipedia_page": {"main": "Elliott Bennett (born 18 December 1988) is an English professional footballer who currently plays for EFL League One club Shrewsbury Town. He is the elder brother of footballer Kyle Bennett .", "link_mentions": [{"page": "Telford", "response": ["thumb|140px|Elliott Bennett, 2009", "* Elliott Bennett (born 1988 in Telford) professional footballer,SoccerBase Database retrieved 7 July 2018 grew up in Telford, plays for Blackburn Rovers. "]}, {"page": "Kyle Lafferty", "response": ["Lafferty made his debut for the team on 10 August, as they began the season with a 1–0 defeat away to Wolverhampton Wanderers, replacing Steven Whittaker for the last 14 minutes of the game. Six days later he made his first start in his first game at Carrow Road, lasting 67 minutes of a 3–0 win over Watford before being replaced by Elliott Bennett. In 20 games18 of those in the leaguehe only scored once, in a 3–2 home win against Cardiff City on 17 January 2015."]}, {"page": "Paul Huntington", "response": ["On 16 July 2010 Huntington signed to Yeovil Town on a two-year contract. He scored his first goal for Yeovil and their 3rd in a 3–1 win over Tranmere Rovers on 11 September and made the League One Team Of The Week. He repeated this achievement on 9 October after a 1–0 win at Rochdale. On 3 January 2011 he scored the only goal in a 1–0 win against Milton Keynes Dons at home and received Man of the Match. He won the League One Player of the Month for January, beating competition from Brighton's Elliott Bennett, Craig Dawson from Rochdale, and AFC Bournemouth's Liam Feeney to win this award which was presented by his manager Terry Skiverton. During this month he scored three times against Sheffield Wednesday, Milton Keynes Dons, and Brentford and was part of a defence that kept four clean sheets. He was appointed captain of the club as Yeovil finished in 14th place, their second highest finish. He was runner-up in the Green and White Player of the Season Award and the Western Gazette Player of the Season Award."]}, {"page": "Simon Lappin", "response": ["By the start of 2011–12, players such as Andrew Surman and Elliott Bennett were regular choices, which resulted in Lappin only making four Premier League appearances, along with two substitute appearances in cup competitions. This included deputising at left back for the last two matches following injuries to both Marc Tierney and Adam Drury."]}, {"page": "Lee Collins (footballer, born 1988)", "response": ["Collins attended Thomas Telford School as a youth, alongside fellow professionals such as Elliott Bennett and Danny Guthrie. Also attending the school was future Port Vale teammate Sam Morsy. Collins and his partner had three daughters, born in 2010, 2016 and 2017."]}, {"page": "Danny Racchi", "response": ["On 28 July, he signed for League Two side Bury. In his first season at the club, Racchi made 24 appearances in all competitions mainly as back up to on-loan winger Elliott Bennett, helping the club reach the play-offs. At the end of the 2009–10 season, he was released by the club."]}, {"page": "List of foreign Premier League players", "response": ["*Elliott Bennett – Norwich City – 2011–14"]}, {"page": "List of Adidas sponsorships", "response": ["*  Elliott Bennett"]}, {"page": "2007–08 Wolverhampton Wanderers F.C. season", "response": ["|align=\"center\"| Young Player of the Season ||align=\"center\"| Elliott Bennett", "| 25 October 2007 ||  Elliott Bennett ||align=\"center\"| Crewe Alexandra ||align=\"center\"|  3 January 2008", "| 31 January 2008 ||  Elliott Bennett ||align=\"center\"| Bury ||align=\"center\"|  End of season"]}, {"page": "History of Brighton & Hove Albion F.C.", "response": ["After moving Brighton to the Championpship as Champions Poyet started rebuilding after the loss 2 key players in the off season; PFA Team of the Year player Elliott Bennett to Norwich for an undisclosed feeBlissful Bennett joins Canaries Sky Sports. Retrieved 19 July 2011 and top scorer Glenn Murray to arch-rivals Crystal Palace on a free transfer after Brighton failed to reach an agreement with the player at the end of his contract.Eagles boss swoops for Murray Sky Sports. Retrieved 19 July 2011 After these losses The Seagulls brought in many players, including League One Top Scorer and £2.5m club record signing Craig Mackail-SmithPoyet hails Mackail-Smith coup Sky Sports. Retrieved 19 July 2011 and Kazenga LuaLua on loan for 3rd time, before purchasing him in mid-November.Seagulls swoop for LuaLua Sky Sports. Retrieved 19 July 2011Brighton & Hove Albion complete Kazenga LuaLua signing BBC. Retrieved 3 December 2011"]}, {"page": "2009–10 Wolverhampton Wanderers F.C. season", "response": ["| 19 August 2009 || Elliott Bennett ||align=\"center\"| Brighton & Hove Albion||align=\"center\"|Undisclosed"]}, {"page": "2010–11 Football League One", "response": ["|align=\"left\"| Elliott Bennett"]}, {"page": "2008–09 Wolverhampton Wanderers F.C. season", "response": ["| 29 July 2008 ||  Elliott Bennett ||align=\"center\"| Bury ||align=\"center\"|  End of season "]}, {"page": "List of foreign EFL Championship players", "response": ["*Elliott Bennett – Norwich City, Brighton & Hove Albion, Bristol City, Blackburn Rovers 2014–17, 2018–"]}, {"page": "2010–11 Brighton & Hove Albion F.C. season", "response": ["*28.1.11: Chairman Tony Bloom confirms that Elliott Bennett has submitted a transfer request. He told seagulls.co.uk \"Nothing has changed. We do not want to sell Elliott, we don't need to sell the player.\"", "| Elliott Bennett", "|align=\"left\"|Elliott Bennett", "| MF || Elliott Bennett || Brighton & Hove Albion"]}, {"page": "Kyle Bennett (footballer)", "response": ["He is the younger brother of footballer Elliott Bennett."]}]}}