{"wiki_id": "http://www.wikidata.org/entity/Q449458", "itemLabel": "Emma Chambers", "itemDescription": "English actress (1964-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Chambers", "wikipedia_page": {"main": "Emma Gwynedd Mary Chambers (11 March 1964 – 21 February 2018) was an English actress. She played the role of Alice Tinker in the BBC comedy The Vicar of Dibley and Honey Thacker in the film Notting Hill (1999).", "link_mentions": [{"page": "List of comedians", "response": ["* Emma Chambers (1964-2018)"]}, {"page": "Battersea", "response": ["*Emma Chambers – actress, known for her role as 'Alice' in The Vicar of Dibley"]}, {"page": "Doncaster", "response": ["* Emma Chambers, an actress. She is famous for her role in The Vicar of Dibley and in Notting Hill."]}, {"page": "1999 in film", "response": ["| Notting Hill || Universal Pictures || Roger Michell (director); Richard Curtis (screenplay); Julia Roberts, Hugh Grant, Richard McCabe, Rhys Ifans, James Dreyfus, Dylan Moran, Hugh Bonneville, Emma Chambers, Tim McInnerny, Gina McKee, Henry Goodman, Julian Rhind-Tutt, Lorelei King, John Shrapnel, Clarke Peters, Arturo Venegas, Yolanda Vazquez, Mischa Barton, Emily Mortimer, Samuel West, Ann Beach, Alec Baldwin, Simon Callow, Joe Cornish, Matthew Modine || Romance, Comedy, Drama || Live action"]}, {"page": "Notting Hill (film)", "response": ["Notting Hill is a 1999 romantic comedy film directed by Roger Michell. The screenplay was written by Richard Curtis, and the film was produced by Duncan Kenworthy. The film stars Julia Roberts and Hugh Grant with Rhys Ifans, Emma Chambers, Tim McInnerny, Gina McKee, and Hugh Bonneville in supporting roles. The story is of a romance between a London bookseller (Grant) and a famous American actress (Roberts) who happens to walk into his shop.", "* Emma Chambers as Honey Thacker"]}, {"page": "The Clandestine Marriage", "response": ["In 1999, the play was made into a film directed by Christopher Miles and starred Nigel Hawthorne, Joan Collins, Timothy Spall, Emma Chambers and Tom Hollander.  The screenplay was written by Trevor Bentham."]}, {"page": "The Vicar of Dibley", "response": ["| Emma Chambers || Alice Horton (née Tinker), the Verger || 24", "| Emma Chambers"]}, {"page": "Roger Lloyd-Pack", "response": ["Lloyd-Pack died of pancreatic cancer at his home in Kentish Town aged 69 on 15 January 2014. His funeral was held at the church of St. Paul's, Covent Garden. It was attended by Sir David Jason, Nicholas Lyndhurst, John Challis and Sue Holderness. Nigel Havers, Stephen Rea, Miranda Richardson, Alison Steadman, Kathy Burke and Joely Richardson paid tribute to him. His body was buried at Highgate Cemetery East.Resting Places In March that year, the Sport Relief special of Only Fools and Horses was dedicated to the memory of both Lloyd-Pack and John Sullivan. Similarly, the final episode of the lockdown edition of The Vicar of Dibley ended with a tribute just before the closing credits reading, \"In loving memory of Liz, John, Emma and Roger\", paying tribute to him and three other late Dibley cast members (Liz Smith, John Bluthal and Emma Chambers)."]}, {"page": "British Comedy Awards", "response": ["* Best TV comedy actress: Emma Chambers (Vicar of Dibley)"]}, {"page": "Verger", "response": ["The symbol of a guild of cathedral vergers is the crossed keys. Perhaps the best-known portrait of an Anglican verger in fiction is in Somerset Maugham's short story, \"The Verger\". In UK popular culture, the BBC sitcom Dad's Army featured a bumbling caricature of a verger named Maurice Yeatman, played by Edward Sinclair. The sitcom The Vicar of Dibley, whose title character is among the Church of England's first female vicars, also featured a female verger, the dim-witted but well-intentioned Alice Tinker (Emma Chambers)."]}, {"page": "Liz Smith (actress)", "response": ["Smith died on 24 December 2016 at her home in Worthing, West Sussex, thirteen days after her 95th birthday. Shane Allen, controller of BBC comedy commissioning, said that Smith had \"brilliantly captured the grandparent in everyone's family\" as Nana in The Royle Family. Mike Leigh said \"She was a complete breath of fresh air... she was not your bog standard middle-aged actress.\" The final episode of the lockdown edition of The Vicar of Dibley ended with a tribute just before the closing credits reading, \"In loving memory of Liz, John, Emma and Roger\", paying tribute to her and also three other late Dibley cast members (John Bluthal, Emma Chambers and Roger Lloyd-Pack)."]}, {"page": "Charlotte Coleman", "response": ["Other television appearances in the 1980s and '90s included roles in Thames Television's The Bill and Central Independent Television's Inspector Morse, the short-lived comedy series Freddie and Max, with Anne Bancroft, a drama about homelessness, Sweet Nothing and another lesbian role, as Barbara Gale in the political satire Giving Tongue (1996). She also appeared in Simon Nye's sitcom How Do You Want Me? (1998–2000), alongside Dylan Moran and Emma Chambers, and voiced the lead female character, Primrose, in the animated adaptation of Brambly Hedge.\"TV Toons: Brambly Hedge (1996–2000)\" Toonhound.com, 2008 Coleman's final television appearance was in the adaptation of Jacqueline Wilson's Double Act, where she played the twins' teacher, Miss Debenham."]}, {"page": "John Bluthal", "response": ["Bluthal's agent confirmed on 16 November 2018 that the actor had died, aged 89, in New South Wales, Australia. Following his death, fellow The Vicar of Dibley actor Dawn French said \"Tons of happy laughs remembered today. Cheeky, naughty, hilarious. Bye darlin' Bluey.\" On 22 December 2018, BBC One aired The Vicar of Dibley December 1996 episode \"The Christmas Lunch Incident\" with a caption at the end remembering Bluthal's death. Similarly the final episode of the lockdown edition of The Vicar of Dibley ended with a tribute just before the closing credits reading, \"In loving memory of Liz, John, Emma and Roger\", paying tribute to him and also three other deceased Dibley cast members  (Liz Smith, Emma Chambers and Roger Lloyd-Pack)."]}, {"page": "Little Robots", "response": ["* Spotty (voiced by Emma Chambers): A round, heavy, yellow Little Robot covered in coloured spots, wears specs, and can retract all her limbs and roll around like a ball for fast locomotion. She has a strong personality, likes rules and orders, and tends to give orders to her friends (often causing conflicts with her friends). In some episodes of the show she has a glassy front which means that there is a reflection of a studio member and camera throughout the series. She is the oldest Little Robot of the series."]}, {"page": "How Do You Want Me?", "response": ["Dylan Moran starred as boy next door Ian Lyons, who recently eloped with country girl Lisa Yardley (Charlotte Coleman).  At the show's start, after a year living in London they move to the village of Snowle, where her intimidating father (Frank Finlay) breeds turkeys.  He and most of Lisa's family (which included Emma Chambers as her sister and Peter Serafinowicz as her thuggish brother) take a dislike to Ian, and much of the comedy comes from how Ian copes with life with her family and village life in general.  The situation is also complicated by Lisa's ex-boyfriend Derek (Mark Heap), who still loves her.", "* Emma Chambers as Helen Yardley, Lisa's sister"]}, {"page": "Bomber (novel)", "response": ["In 1995 the BBC's Radio 4 broadcast a \"real time\" dramatisation of Deighton's documentary novel Bomber, covering the novel's action following RAF Lancaster bomber O-Orange's take-off in 1943, life in the German town that was its allocated target, the bombing raid and the plane's return at night. The drama threaded through the station's unchangeable schedule of news and current affairs from early morning to midnight.  It starred Tom Baker as the narrator, Frank Windsor as Air Marshal Harris, Samuel West as Lambert, Emma Chambers and Jack Shepherd and told how the raid had \"changed the lives\" of many men and women – British and German. It was repeated on Radio 4 Extra on Armistice Day 2011."]}, {"page": "Bravo Two Zero (film)", "response": ["* Emma Chambers as Dinger's wife"]}, {"page": "Shaggy Dog Story (TV)", "response": ["*Emma Chambers (as Alice Tinker from The Vicar of Dibley)"]}, {"page": "V Graham Norton", "response": ["| Emma Chambers and Huey Morgan"]}, {"page": "Storm Management", "response": ["In 2009, Doukas sold a controlling stake in the company to 19 Entertainment. Doukas and her brother Simon Chambers continue to run the business. Their sister was the actress Emma Chambers.Victoria Lambert \"It was either the actress or the cat\", The Daily Telegraph, 22 July 2002"]}, {"page": "1964 in the United Kingdom", "response": ["**Emma Chambers, actress (d. 2018)"]}, {"page": "Martin Chuzzlewit (1994 TV series)", "response": ["* Emma Chambers as Charity Pecksniff"]}, {"page": "Sayaka Kobayashi", "response": ["*Notting Hill (Honey Thacker (Emma Chambers))"]}, {"page": "Red Nose Day 2007", "response": ["| Dawn French, Sting, Trudie Styler, Emma Chambers, Gary Waldhorn, James Fleet, Roger Lloyd-Pack, Trevor Peacock, John Bluthal and Richard Armitage"]}, {"page": "List of American films of 1999", "response": ["|Notting Hill||Roger Michell ||Julia Roberts, Hugh Grant, Hugh Bonneville, Emma Chambers, James Dreyfus, Rhys Ifans, Tim McInnerny, Gina McKee ||Romantic comedy ||BAFTA award; 3 Golden Globe nominations"]}, {"page": "Geraldine Granger", "response": ["Her best friend is Alice Tinker (Emma Chambers); at the end of each episode she tells a joke to Alice, but Alice rarely understands the humour. Geraldine was once going to marry David Horton but decided not to after all. In 2006, she receives a proposal from accountant Harry Kennedy and accepts by running around the village, screaming. In the final episode she marries him in a bizarre wedding with touches of Doctor Who, including the two bridesmaids being dressed as Daleks and with parts of the church decorated with vegetables. She ends up getting married in her pyjamas because her wedding dress has been accidentally covered with mud by Owen Newitt (Roger Lloyd-Pack)."]}, {"page": "Pond Life (TV series)", "response": ["*Belle Stickleback - Voiced by Emma Chambers. Dolly's best friend, whom she has known since school. She seems to be more down-to-earth and sensible than Dolly (although Dolly describes her as 'laid-back and silly' to her mother). Dolly is definitely the dominant half of the partnership, which often frustrates Belle, and the two have their fair share of falling-outs because of it; however, they usually make up soon enough, largely because Belle is too lethargic to break the pattern. Belle is overweight and very sensitive about it (something the tactless Dolly usually fails to consider) and is keen to find a steady boyfriend."]}, {"page": "St Swithun's School, Winchester", "response": ["*Emma Chambers (1964–2018), actress "]}, {"page": "List of people from Doncaster", "response": ["*Emma Chambers – TV, film and stage actress"]}, {"page": "Chambers (surname)", "response": ["* Emma Chambers (1964–2018), English actress", "* Emma Chambers (soubrette) (1848–1933), English mezzo-soprano"]}, {"page": "Hill House School, South Yorkshire", "response": ["*Emma Chambers, actress"]}, {"page": "Take a Girl Like You (TV series)", "response": ["Take a Girl Like You is a 2000 British television comedy series adapted by Andrew Davies from the 1960 novel Take a Girl Like You by Kingsley Amis. It starred Sienna Guillory, Rupert Graves, Hugh Bonneville, Robert Daws, Leslie Phillips, Emma Chambers, Ian Driver and Deborah Cornelius.https://www.imdb.com/title/tt0256420/ It was broadcast on BBC1 in three hour-long episodes directed by Nick Hurran.BFI.org"]}, {"page": "Emma chambers", "response": ["#REDIRECT Emma Chambers "]}]}}