{"wiki_id": "http://www.wikidata.org/entity/Q449142", "itemLabel": "Gwladus Ddu", "itemDescription": "Welsh noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Gwladus_Ddu", "wikipedia_page": {"main": "Gwladus Ddu, (\"Gwladus the Dark Eyes\"), full name Gwladus ferch Llywelyn (died 1251) was a Welsh noblewoman who was a daughter of Llywelyn the Great of Gwynedd and Joan Plantagenet, a daughter of John, King of England. She married two Marcher lords.\nSources differ as to whether Gwladus was Llywelyn's legitimate daughter by his wife Joan or an illegitimate daughter by Tangwystl Goch, but she is widely regarded to be the daughter of Joan. Gwladus is recorded in Brut y Tywysogion as having died at Windsor in 1251.", "link_mentions": [{"page": "Llywelyn the Great", "response": ["In 1217, Reginald de Braose of Brecon and Abergavenny, who had been allied to Llywelyn and married his daughter, Gwladus Ddu, was induced by the English crown to change sides. Llywelyn responded by invading his lands, first threatening Brecon, where the burgesses offered hostages for the payment of 100 marks, then heading for Swansea where Reginald de Braose met him to offer submission and to surrender the town. He then continued westwards to threaten Haverfordwest where the burgesses offered hostages for their submission to his rule or the payment of a fine of 1,000 marks.; ", "Following King John's death Llywelyn concluded the Treaty of Worcester with his successor Henry III in 1218. This treaty confirmed him in possession of all his recent conquests. From then until his death Llywelyn was the dominant force in Wales, though there were further outbreaks of hostilities with marcher lords, particularly the Marshall family and Hubert de Burgh, and sometimes with the king. Llywelyn built up marriage alliances with several of the Marcher families. One daughter, Gwladus Ddu, (\"Gwladus the Dark\") was already married to Reginald de Braose of Brecon and Abergavenny, but with Reginald an unreliable ally Llywelyn married another daughter, Marared, to John de Braose of Gower, Reginald's nephew. He found a loyal ally in Ranulph, Earl of Chester, whose nephew and heir, John the Scot, married Llywelyn's daughter Elen in about 1222. Following Reginald de Braose's death in 1228, Llywelyn also made an alliance with the powerful Mortimer family of Wigmore when Gwladus Ddu married as her second husband Ralph de Mortimer.", "*Gwladus Ddu (1206–1251), who married (1) Reginald de Braose and (2) Ralph de Mortimer, with whom she had issue."]}, {"page": "Reginald de Braose", "response": ["King John acquiesced to Reginald's claims to the de Braose estates in Wales in May 1216. Reginald became Lord of Brecon, Abergavenny, Builth and held other Marcher Lordships but was also very much a vassal of the Welsh leader Llewelyn Fawr, Prince of Gwynedd who had become his father-in-law in 1215Brut y Tywysogion when Reginald married Llywelyn's daughter, Gwladus Ddu."]}, {"page": "Margaret Wake, 3rd Baroness Wake of Liddell", "response": ["She was the daughter of John Wake, 1st Baron Wake of Liddell, (son of Baldwin Wake and Hawise de Quincy) and Joan de Fiennes. By her grandmother Hawise, she was the great-granddaughter of Elen, daughter of Llywelyn the Great (Prince of Gwynedd) and Joan, Lady of Wales (the illegitimate daughter of John I of England). Her mother, Joan de Fiennes, was a daughter of William de Fiennes and Blanche (Lady of Loupeland) de Brienne. She was a sister of Margaret de Fiennes, making Wake a cousin of Roger Mortimer, 1st Earl of March (himself the great-grandson of Gwladus Ddu, Elen's sister). Joan de Fiennes also descended from John of Brienne and Berengaria of León, herself the granddaughter of Eleanor of England, Queen of Castile."]}, {"page": "Joan, Lady of Wales", "response": ["*Gwladus Ddu (1206–1251), who married (1) Reginald de Braose and (2) Ralph de Mortimer, with whom she had issue."]}, {"page": "Gwladys Ddu", "response": ["#REDIRECT Gwladus Ddu"]}, {"page": "Gwladus ferch Llywelyn", "response": ["#REDIRECT Gwladus Ddu "]}, {"page": "Gladys (given name)", "response": ["* Gwladus Ddu (died 1254), Welsh noblewoman, daughter of Llywelyn the Great of Gwynedd"]}, {"page": "13th century in Wales", "response": ["* Reginald de Braose, marries Gwladus Ddu.", "* probable – The widowed Gwladus Ddu marries Ralph de Mortimer of Wigmore.", "** Gwladus Ddu, daughter of Llywelyn the Great"]}, {"page": "Blaenllynfi Castle", "response": ["William de Braose was succeeded by his younger son, Reginald de Braose, who married Gwladus Ddu, the daughter of Llywelyn Fawr (the ruling prince of Gwynedd). Meanwhile, King John's successor, Henry III equally had trouble with his barons, his chief opponent being Richard Marshal, 3rd Earl of Pembroke. In August 1233, Richard refused to attend the king, and was thus declared traitor. Subsequently, Richard formed an alliance with LLywelyn, and jointly attacked Blaenllynfi castle that October."]}, {"page": "Maud de Braose", "response": ["* Reginald de Braose (died between 5 May 1227 and 9 June 1228), married  firstly, Grace, daughter of William Briwere, and secondly, in 1215, Gwladus Ddu, daughter of Welsh Prince Llewelyn the Great. He had issue by his first wife, including William de Braose, who married Eva Marshal."]}, {"page": "Gwladys (disambiguation)", "response": ["* Gwladus Ddu (died 1254), Welsh noblewoman, daughter of Llywelyn the Great of Gwynedd"]}, {"page": "List of people known as the Black", "response": ["* Gwladus Ddu or \"the Dark\" (died 1251), Welsh princess"]}]}}