{"wiki_id": "http://www.wikidata.org/entity/Q449574", "itemLabel": "Maria Fitzherbert", "itemDescription": "Mistress of British king (1756-1837)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maria_Fitzherbert", "wikipedia_page": {"main": "Maria Anne Fitzherbert  (née Smythe, previously Weld; 26 July 1756 – 27 March 1837) was a longtime companion of George IV of the United Kingdom before he became king. In 1785, they secretly contracted a marriage that was invalid under English civil law because his father, King George III, had not consented to it. She was a Roman Catholic so, had the marriage been approved and valid, George would have lost his place in the line of succession, because the law at the time forbade Catholics or spouses of Catholics from becoming monarch. Before marrying the prince, Fitzherbert had been twice widowed. Her nephew from her first marriage, Cardinal Weld, persuaded Pope Pius VII to declare the marriage sacramentally valid.", "link_mentions": [{"page": "Jumping the broom", "response": ["A 1774 usage in the Westminster Magazine also describes an elopement.  A man who had taken his under-age bride off to France discovered it was as hard to arrange a legal marriage there as in England, but declined a suggestion that a French sexton might simply read the marriage service through before the couple as \"He had no inclination for a Broomstick-marriage\".(1774) 2 Westminster Magazine, p. 16 In 1789 the rumoured clandestine marriage between the Prince Regent and Maria Fitzherbert is similarly referred to in a satirical song in The Times: \"Their way to consummation was by hopping o’er a broom, sir\".The Times, Tuesday, 8 September 1789; pg. 4; Issue 1251; col A"]}, {"page": "George IV", "response": ["Soon after he reached the age of 21, the prince became infatuated with Maria Fitzherbert. She was a commoner (though granddaughter of a baronet), six years his elder, twice widowed, and a Roman Catholic. Nevertheless, the prince was determined to marry her. This was in spite of the Act of Settlement 1701, which barred the spouse of a Catholic from succeeding to the throne, and the Royal Marriages Act 1772, which prohibited his marriage without the King's consent.Parissien, p. 64", "The Prince of Wales's debts continued to climb, and his father refused to aid him unless he married his cousin Princess Caroline of Brunswick. In 1795, the prince acquiesced; and they were married on 8 April 1795 at the Chapel Royal, St James's Palace. The marriage, however, was disastrous; each party was unsuited to the other. The two were formally separated after the birth of their only child, Princess Charlotte, in 1796, and remained separated thereafter. The Prince remained attached to Maria Fitzherbert for the rest of his life, despite several periods of estrangement.David, pp. 150–205", "By the spring of 1830, George's imminent end was apparent. Now largely confined to his bedchambers, having completely lost sight in one eye and describing himself \"as blind as a beetle\", he was forced to approve legislation with a stamp of his signature in the presence of witnesses.Parissien, p. 3 His weight was recorded to be . Attacks of breathlessness due to dropsy forced him to sleep upright in a chair, and doctors frequently tapped his abdomen in order to drain excess fluid. Despite his obvious decline, George was admired for clinging doggedly to life. His will to live and still-prodigious appetite astonished observers; in April 1830, the Duke of Wellington wrote that the King had consumed for breakfast \"a Pidgeon and Beef Steak Pye ... Three parts of a bottle of Mozelle, a Glass of Dry Champagne, two Glasses of Port [and] a Glass of Brandy\", followed by a large dose of laudanum. Writing to Maria Fitzherbert in June, the King's doctor, Sir Henry Halford, noted \"His Majesty's constitution is a gigantic one, and his elasticity under the most severe pressure exceeds what I have ever witnessed in thirty-eight years' experience.\"Parissien, p. 6 Though George had been under Halford's care since the time of the Regency, the doctor's social ambitions and perceived lack of competence were strongly criticised, with The Lancet labelling Halford's bulletins on the King's health as \"utterly and entirely destitute of information\", subsequently characterising Halford's treatment of George, which involved administering both opium and laudanum as sedatives, as appearing to lack sense or direction.Parissien, pp. 5–6"]}, {"page": "Caroline of Brunswick", "response": ["The daughter of Charles William Ferdinand, Duke of Brunswick, and Princess Augusta of Great Britain, Caroline was engaged to her cousin George in 1794, despite their never having met. He was already illegally married to Maria Fitzherbert. George and Caroline married the following year but separated shortly after the birth of their only child, Princess Charlotte of Wales, in 1796. By 1806, rumours that Caroline had taken lovers and had an illegitimate child led to an investigation into her private life. The dignitaries who led the investigation concluded that there was \"no foundation\" to the rumours, but Caroline's access to her daughter was nonetheless restricted. In 1814, Caroline moved to Italy, where she employed Bartolomeo Pergami as a servant. Pergami soon became Caroline's closest companion, and it was widely assumed that they were lovers. In 1817, Caroline was devastated when Charlotte died in childbirth. She heard the news from a passing courier as George had refused to write and tell her. He was determined to divorce Caroline, and set up a second investigation to collect evidence of her adultery.", "Caroline and George were married on 8 April 1795 at the Chapel Royal, St. James's Palace, in London. At the ceremony, George was drunk.Plowden, p. 26; Robins, p. 17 He regarded Caroline as unattractive and unhygienic, and told Malmesbury that he suspected that she was not a virgin when they married.Robins, p. 17 He, of course, was not. He had himself already secretly married Maria Fitzherbert, but his marriage to Fitzherbert violated the Royal Marriages Act 1772 and so was not legally valid.Plowden, p. 27", "Nine months after the wedding, Caroline gave birth to Princess Charlotte, George's only legitimate child, at Carlton House on 7 January 1796. Charlotte was second in the line of succession to the British throne after her father. Just three days after Charlotte's birth, George made out a new will. He left all his property to \"Maria Fitzherbert, my wife\", while to Caroline he left one shilling.Plowden, pp. 39–40; Robins, p. 20"]}, {"page": "Royal Pavilion", "response": ["The Prince of Wales, who later became George IV, first visited Brighton in 1783, at the age of 21. The seaside town had become fashionable as a result of the residence of George's uncle, Prince Henry, Duke of Cumberland, whose tastes for fine cuisine, gambling, the theatre, and general fast living the young prince shared, and with whom he lodged in Brighton at Grove House. In addition, the Prince of Wales was advised by his physician that the seawater and fresh air would be beneficial for his gout. In 1786, under a financial cloud with investigation by Parliament for the extravagances incurred in building Carlton House, London, the Prince rented a modest, erstwhile farmhouse facing the Old Steine, a grassy area of Brighton used as a promenade by visitors. Remote from the Royal Court in London, the Pavilion was a discreet location for the Prince to enjoy private liaisons with his long-time companion, Maria Fitzherbert. The Prince had wished to marry her, and did so in secrecy as her Roman Catholic religion prohibited his marrying her under the Royal Marriages Act 1772."]}, {"page": "Fulham", "response": ["Margravine Road recalls the existence of Brandenburg House, a riverside mansion built by Sir Nicholas Crispe in the time of Charles I, and used as the headquarters of General Fairfax in 1647 during the civil wars. In 1792 it was occupied by Charles Alexander, Margrave of Brandenburg-Ansbach and his wife, and in 1820 by Caroline, consort of George IV. His non-political 'wife' was Maria Fitzherbert who lived in East End House in Parson's Green. They are reputed to have had several children.Wilkins, F.H. (1905), Mrs Fitzherbert and George IV, London: Longman and Green. p. 23", "* Maria Fitzherbert (1756-1837), companion, and possibly wife, of King George IV"]}, {"page": "Regency era", "response": ["* Maria Fitzherbert"]}, {"page": "Princess Charlotte of Wales", "response": ["On 7 January 1796, one day short of nine months after the wedding, Caroline gave birth to a daughter at their residence, Carlton House, London. While George was mildly unhappy that she was not a boy, the King, who preferred female babies, was delighted at the birth of his first legitimate grandchild, and hoped that the birth would serve to reconcile George and Caroline. This did not come to pass; three days after the birth, George made a will directing that his wife have no role in the upbringing of their child, and bequeathed all his worldly goods to his mistress, Maria Fitzherbert, while Caroline was left one shilling. Many members of the royal family were unpopular; however, the nation celebrated the princess's birth.  On 11 February 1796, she was christened Charlotte Augusta, after her grandmothers, Queen Charlotte and Augusta, Duchess of Brunswick-Lüneburg, in the Great Drawing Room at Carlton House by John Moore, Archbishop of Canterbury. Her godparents were the King, the Queen and Augusta (for whom Charlotte, Princess Royal, stood proxy)."]}, {"page": "Prince Edward, Duke of Kent and Strathearn", "response": ["The Duke of Kent purchased a house of his own from Maria Fitzherbert in 1801. Castle Hill Lodge on Castlebar Hill, Ealing (West London), was then placed in the hands of architect James Wyatt and more than £100,000 spent (£ in ).T F T Baker, C R Elrington (Editors)"]}, {"page": "Charlotte of Mecklenburg-Strelitz", "response": ["|data-sort-value=\"George IV\"|George IV||12 August 1762||26 June 1830||(1) married 1785 Mrs. Maria Fitzherbert, marriage legally invalid as George III had not consented to the match. (2) 1795, Princess Caroline of Brunswick-Wolfenbüttel; had issue, but no descendants today"]}, {"page": "Susannah York", "response": ["In 1972, she won the Best Actress award at the Cannes Film Festival for her role in Images.\"List of 1972 Festival de Cannes Winners\" Festival de Cannes. Retrieved 15 January 2011. She played Superman's mother Lara on the doomed planet Krypton in Superman (1978) and its sequels, Superman II (1980) and Superman IV: The Quest for Peace (1987). York made extensive appearances in British television series, including Prince Regent (1979), as Maria Fitzherbert, the clandestine wife of the future George IV, and We'll Meet Again (1982).", "| Maria Fitzherbert"]}, {"page": "Edward Ord", "response": ["Ord was born in Cumberland, Maryland, the son of James and Rebecca Ord. Family tradition made James Ord the illegitimate son of George IV of the United Kingdom and Maria FitzherbertGeorgetown University Archives including a Xerox copy of a manuscript entitled \"History of James Ord as related by himself with other facts collected by his sons\" and a copy of a privately printed pamphlet entitled, \"Memoranda Concerning James Ord who died January 25, 1873 by his granddaughter Mary Ord Preston 1896\" original publication in Georgetown University Library, Special Collections, call number 90A469. but he seems likely to have been the son of Ralph Ord, who was baptised at Wapping, Middlesex, in 1757, the son of John Ord, a factor (agent) from Berwick-upon-Tweed.Anthony J. Camp, Royal mistresses and bastards: fact and fiction 1714–1936 (London, 2007) , pp. 149–153. Edward Ord was considered a mathematical genius and was appointed to the United States Military Academy by President Andrew Jackson. His roommate at West Point was future general William Tecumseh Sherman. He graduated in 1839 and was commissioned a second lieutenant in the 3rd U.S. Artillery.  He fought in the Second Seminole War in Florida and was promoted to first lieutenant."]}, {"page": "Marble Hill House", "response": ["In the late 18th century the house was rented by the Prince Regent (the future king, George IV) for his mistress, Maria Fitzherbert, so the two could continue to meet in private."]}, {"page": "Cuckmere Valley", "response": ["Maria Fitzherbert (1756–1837), mistress of George IV, lived at Clapham House in the village."]}, {"page": "Pains and Penalties Bill 1820", "response": ["George despised her, and over the preceding few years had collected evidence to support his contention that Caroline had committed adultery while abroad with Bartolomeo Pergami, the head servant of her household. The day after her return to England, George submitted the evidence to the Houses of Parliament in two green bags. The contents of the bags were identical; one copy was presented to the House of Lords by the Prime Minister, Lord Liverpool, and the other was presented to the House of Commons by the Foreign Secretary, Lord Castlereagh. Each requested that the Houses set up a confidential enquiry to examine the contents of the bags. Replying to Castlereagh in the Commons, Caroline's chief attorney, Henry Brougham, demanded that the papers be publicly disclosed. Brougham was in the opposition Whig party and knew that public sympathy rested with Caroline, rather than her husband or the government, which was weak and unpopular. Disclosure of George's own adulterous affairs, or even his scandalous and unlawful previous marriage to Maria Fitzherbert, could destabilise the Tory government led by Lord Liverpool.", "The first motion was moved by the Duke of Leinster, to the effect that the bill be dismissed. It was an initial test of the government's strength that would gauge support for the King. The motion was lost by 206–41. During the first day and the next, opening speeches by Caroline's defence team, Henry Brougham and Thomas Denman, were well received. In their speeches, Brougham and Denman hinted but did not state explicitly, referring only to \"recrimination\", that George could come off worse because of the bill if his own infidelities (such as his secret marriage to Maria Fitzherbert) were revealed in the course of the debate. In private, the Queen also turned the tables on the King by saying she \"never committed adultery but once, and that was with Mrs Fitzherbert's husband\". quoted in "]}, {"page": "Royal mistress", "response": ["*Maria Fitzherbert, mistress to George IV"]}, {"page": "Mrs Fitzherbert", "response": ["#REDIRECT Maria Fitzherbert"]}, {"page": "William Porden", "response": ["From 1804 to 1808, he designed the stables, riding house and tennis court at the Brighton Pavilion for the Prince of Wales. The riding school was in the \"Indo-Saracenic\" style, inspired by pictures of Indian buildings. The main building was a notable technical accomplishment for the time, being circular and domed, with a diameter of  and a height of . It survives and is now a concert hall called \"The Dome\". Also in 1804, he designed Steine House for Maria Fitzherbert, the Prince's wife."]}, {"page": "Parsons Green", "response": ["*  Holly Bush House – later 'East End', tenancy of Maria Fitzherbert, demolished 1884"]}, {"page": "List of British monarchs", "response": ["|  Maria FitzherbertPark Lane15 September 1785No verified children Caroline of Brunswick-WolfenbüttelSt James's Palace8 April 17951 daughter"]}, {"page": "Princess Frederica Charlotte of Prussia", "response": ["The marriage between Frederica Charlotte and Prince Frederick, Duke of York and Albany was arranged in order to provide the British throne with heirs, as the Prince of Wales was at the time secretly married and his marriage status complicated. Reportedly, the Prince of Wales, who was at the time, albeit not legally, married to Maria Fitzherbert, regarded it unnecessary for him to enter a dynastic marriage, because the eldest of his brothers had married a princess and could provide an heir to the throne in his stead.Mary Beacock Fryer, Arthur Bousfield & Garry Toffoli: Lives of the Princesses of Wales (1984) Frederica Charlotte had been chosen upon the wish of Frederick the Great, who allowed George III to read a letter from Frederica Charlotte displaying her gentle and affectionate nature, successfully anticipating that this would touch George III and make him inquire for her to marry his son."]}, {"page": "Bentworth", "response": ["In 1777 William Urry's daughters Mary and Elizabeth married two brothers, Basil and William Fitzherbert of Swynnerton Hall, Staffordshire. Their sister-in-law was Maria Fitzherbert, the secret wife of the Prince Regent, later King George IV. In about 1800, Mary Fitzherbert (who had eleven children) became owner of Bentworth Manor and Manor Farm."]}, {"page": "St Mary Hoo", "response": ["The Old Rectory at St Mary Hoo is a Grade II house built in the late 18th century. It has a special place in scandals involving the royalty. The rectors from 1788 to 1875 were a father and son, both named R. Burt. The senior of the two, the Rev. Robert Burt, one of the prince's Chaplains in Ordinary, whose debts (of £500) were paid by the prince to release him from the Fleet Prison,Martin J. Levy, \"Maria Fitzherbert,\" Oxford Dictionary of National Biography, Oxford University Press, 2004. performed the illegal marriage ceremony between Prince George (afterwards King George IV) and Mrs Fitzherbert in 1785.Brian Matthews, The History of Strood Rural District, Strood Rural District Council, 1971 A plaque commemorating this event remains hidden in the old church of St Mary."]}, {"page": "Frances Villiers, Countess of Jersey", "response": ["The future George IV began an affair with Lady Jersey, then a 40-year-old grandmother and mother of ten, in 1793. She was also romantically involved with other members of the English aristocracy, including the 5th Earl of Carlisle. It was not until 1794 that she lured the Prince of Wales away from Maria Fitzherbert, with whom he had undergone a form of marriage in a clandestine Church of England ceremony that all parties to it knew was invalid under the Royal Marriages Act 1772."]}, {"page": "List of Old Stonyhursts", "response": ["*The Hon. Charles Langdale, one of the foremost leaders of Catholic Emancipation Days, Member of Parliament (Whig), wrote the memoirs of Maria Fitzherbert"]}, {"page": "Red Rice, Hampshire", "response": ["*1756. Henry Errington becomes the Uncle of Maria Anne Smythe (later to become Maria Fitzherbert). The Smythe family move closer geographically to the Errington family.", "*1785. Henry Errington is heavily involved with his niece's attachment to the Prince of Wales. The secret and illegal marriage did not take place at Red Rice; the wedding occurred in the drawing room of Mrs Maria Fitzherbert's house in Park Street on the evening of 15 December. Her uncle, Henry Errington, gave her away."]}, {"page": "List of people from Brighton and Hove", "response": ["*Maria Fitzherbert, illegitimate wife of George IV (marriage of a Catholic to a member of the Royal Family was illegal)"]}, {"page": "John Rolle, 1st Baron Rolle", "response": ["Rolle backed Pitt on the regency crisis in 1789, making a direct attack on the Prince of Wales' relations with Maria Fitzherbert which was thought inappropriate by the Whigs. Rolle responded by saying that he would have made the same speech if the whole House was against him. In the general election in 1790 he was forced into a token contest against a Bampfylde Whig and declared his \"firm attachment to Mr Pitt, founded on personal esteem as well as public principles\", and was returned with a healthy majority."]}, {"page": "A Royal Scandal", "response": ["Saddled with debt, the Prince of Wales is promised financial support from his father, the reigning King George, only if he marries his coarse and vulgar cousin, Caroline of Brunswick, despite her many faults. The marriage is a disaster from the very start; her efforts to achieve a semblance of grace and majesty fail miserably, and George has no qualms about flaunting his ongoing relationship with Frances Villiers, Countess of Jersey in front of his wife. The two formally separate after the birth of their daughter Charlotte, and George reunites with Maria Fitzherbert, whom he had wed years before meeting Caroline. The union was considered invalid because it had not been approved by the king and the Privy Council.", "*Irene Richard ..... Maria Fitzherbert"]}, {"page": "Catholic Church in England and Wales", "response": ["In 1837, James Arundell, 10th Baron Arundell of Wardour, bequeathed to Stonyhurst the Arundel Library, which contained the vast Arundel family collection, including some of the school's most important books and manuscripts such as a Shakespeare First Folio and a manuscript copy of Froissart's Chronicles, looted from the body of a dead Frenchman after the Battle of Agincourt. Yet Catholic recusants as a whole remained a small group, except where they stayed the majority religion in various pockets, notably in rural Lancashire and Cumbria, or were part of the Catholic aristocracy and squirearchy.Christopher Martin A Glimpse of Heaven: Catholic Churches of England and Wales (London: English Heritage, 2007) Finally, the famous recusant Maria Fitzherbert, who during this period secretly married the Prince of Wales, Prince Regent, and future George IV in 1785. The British Constitution, however, did not accept it and George IV later moved on. Cast aside by the establishment, she was adopted by the town of Brighton, whose citizens, both Catholic and Protestant, called her \"Mrs. Prince\". According to journalist Richard Abbott, \"Before the town had a [Catholic] church of its own, she had a priest say Mass at her own house, and invited local Catholics\", suggesting the recusants of Brighton were not very undiscovered.: Maria FitzherbertRichard Abbott, \"Brighton's unofficial queen\" The Tablet, 1 September 2007, 12–13."]}, {"page": "Swynnerton", "response": ["Maria Fitzherbert's face was one which always displayed its best advantages. Her eyes were peculiarly languishing, and, as she had already been twice a widow, and was six years his senior, she had the advantage over a less experienced lover. Likewise, she was a Catholic, and so by an act of Parliament any marriage he made with her would be illegal. Yet because of all these different objections the prince was doubly drawn to her, and was willing to sacrifice even the throne if he could but win her.", "Maria Fitzherbert died on 27 March 1837.  Although the marriage was declared invalid under English civil law, Pope Pius VII declared the marriage legal."]}, {"page": "Weld family", "response": ["Edward Weld was the third and first surviving son of Humphrey Weld (died 1722) of Lulworth, son of William Weld, and the grandnephew of Humphrey Weld MP, (purchaser in 1641 of the vast Lulworth Estate, who had died without a male heir), and of his wife Margaret Simeons, daughter of Sir James Simeons of Chilworth nr. Oxford. Weld succeeded to his father in 1722. On coming of age he was the fourth generation of Welds to take charge of the vast estate with its portion of the magnificent Jurassic Coast (today a UNESCO World Heritage Site). With the financial help of his mother's family, he developed the castle and its grounds. He was succeeded by his eldest son and heir, Edward Weld (1740–1775), briefly the first husband of Maria Fitzherbert, before being fatally injured in a riding accident. The next proprietor of Lulworth was Edward's youngest brother: "]}, {"page": "Sophia Stacey", "response": ["She eventually married in 1823 a somewhat younger army officer, Captain James Patrick Catty of the Royal Engineers, who was the son of Louis Francois Catty, who was either a refugee from the French Revolution or a French Canadian, sources differ. He anglicised his name to Lewis Frances and taught French for many years during the Napoleonic wars at the Woolwich military academy. The wedding was a significant affair and was followed by a reception given by Maria Fitzherbert, George IV's morganatic wife. "]}, {"page": "1785 in Great Britain", "response": ["* 21 December – Prince of Wales marries Catholic Maria Fitzherbert, secretly, and in contravention of the Royal Marriages Act 1772."]}, {"page": "List of places of worship in Brighton and Hove", "response": ["|The earliest surviving Roman Catholic church in the city was the fourth Catholic church to be consecrated in England since the Reformation, although many had been built since the passing of the Roman Catholic Relief Act 1791 allowed this to happen.  St John the Baptist's is a stuccoed building in the Classical style.  It contains Maria Fitzherbert's tomb, and was England's first electrically lit Catholic church."]}, {"page": "Francis Fitzherbert, 15th Baron Stafford", "response": ["Stafford belongs to the Roman Catholic landed gentry family of Fitzherbert, whose most famous member was Maria Fitzherbert, the first (unrecognized) wife of King George IV. He was educated at Farleigh School, Ampleforth College, the University of Reading and the Royal Agricultural College, Cirencester.OA News  dated 2005 at ampleforth.org.uk"]}, {"page": "Isabella Ingram-Seymour-Conway, Marchioness of Hertford", "response": ["The Marchioness's predecessor as the Prince Regent's mistress had been Maria Fitzherbert, a Roman Catholic. Other Catholics disapproved of the Marchioness's influence over the prince, referring to \"the fatal witchery of an unworthy secret influence\" that they felt had turned him against the idea of Catholic emancipation. George Canning, speaking for the party in power, made use of these comments to say that, if Lady Hertford was really responsible for the prince's political decisions, she was \"Britain's guardian angel\". Isabella made a point of humiliating Mrs Fitzherbert and by 1811 the Prince had formerly separated from her."]}, {"page": "Lady Mary Coke", "response": ["Lady Mary saw evidence of a conspiracy (this time a Catholic one against the Protestant succession) in Margaret Nicholson's attempt to assassinate George III in 1786 and Maria Fitzherbert's rumoured marriage to George, Prince of Wales."]}, {"page": "Litlington, East Sussex", "response": ["Maria Fitzherbert, mistress of George IV, lived at Clapham House."]}]}}