{"wiki_id": "http://www.wikidata.org/entity/Q449758", "itemLabel": "May Morris", "itemDescription": "English artisan, embroidery designer, jeweler, socialist, and editor (1862-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/May_Morris", "wikipedia_page": {"main": "Mary \"May\" Morris (25 March 1862 – 17 October 1938) was an English artisan, embroidery designer, jeweller, socialist, and editor. She was the younger daughter of the Pre-Raphaelite artist and designer William Morris and his wife and artists' model, Jane Morris.", "link_mentions": [{"page": "William Morris", "response": ["Wightwick Manor in the West Midlands, England, is a notable example of the Morris & Co. style, with lots of original Morris wallpapers, fabrics, carpets, and furniture, May Morris art and embroidery, De Morgan tiles, and Pre-Raphaelite works of art, managed by the National Trust. Standen in West Sussex, England, was designed by Webb between 1892 and 1894 and decorated with Morris carpets, fabrics and wallpapers. The illustrator Edward Linley Sambourne chose to decorate his London family home 18 Stafford Terrace with many Morris & Co wallpapers, which have been preserved and can still be seen today. Morris's homes Red House and Kelmscott Manor have been preserved. Red House was acquired by the National Trust in 2003 and is open to the public. Kelmscott Manor is owned by the Society of Antiquaries of London and is open to the public."]}, {"page": "Eric Gill", "response": ["In 1904 Gill married Ethel Hester Moore (1878–1961), later known as Mary, the daughter of a plant nursery owner who was also the head verger at Chichester Cathedral. Gill and Moore would eventually have three daughters (Elizabeth, Petra, and Joanna) and foster a son, Gordian. After a short period in Battersea, the couple moved into 20 Black Lion Lane, Hammersmith in west London, near the (recently married) Johnstons' home on Hammersmith Terrace. A number of artists associated with the Arts and Crafts movement, including Emery Walker and May Morris were already based in the area, as were a number of printing presses, notably the Doves Press. Gill formed a business partnership with Lawrence Christie and recruited a number of staff, including the 14-year old Joseph Cribb, to work in his studio. Gill began giving lectures at the Central School and taught courses in monumental masonary and lettering for stone masons at the Paddington Institute. In 1905 he was elected to the Arts and Crafts Exhibition Society and joined the Fabian Society the following year."]}, {"page": "Pre-Raphaelite Brotherhood", "response": ["* May Morris (embroiderer and designer)"]}, {"page": "Wightwick Manor", "response": ["The Manor has the work of 13 professional female artists on permanent public display, more than any other in the National Trust, including notable examples of works by Lizzie Siddal, Lucy Madox Brown, Marie Spartali Stillman, and May Morris. Most of these artworks were collected by the Manders.  The malthouse gallery now houses a group of works by Evelyn De Morgan and her husband William, on loan from the De Morgan Foundation."]}, {"page": "Kelmscott Manor", "response": ["After William Morris's death in 1896, the Manor continued to be occupied by his widow, Jane Morris (who purchased it in 1913) and later, his daughters. May Morris died in 1938 and bequeathed the house to Oxford University, on the basis the contents were preserved and the public were granted access. The University were unwilling to preserve the house as 'a museum piece' and passed the house and land to the Society of Antiquaries in 1962."]}, {"page": "Lily Yeats", "response": ["Lily continued to work under May Morris for six years, but their relationship was strained (she called her employer \"the Gorgon\" in her scrapbook) In 1895, Lily caught typhoid fever while in France, and her health remained uncertain for the remainder of the decade.Brown 2001, p. 55 After their mother's death in 1900History of the Cuala Press Lily and her sister Elizabeth returned to Ireland with their friend Evelyn Gleeson. In 1902 the three founded a craft studio near Dublin which they named Dun Emer (the Fort of Emer) after Emer, the wife of Irish legendary hero Cuchullain.  Dun Emer became a focus of the burgeoning Irish Arts and Crafts Movement, focusing on embroidery, printing, and rug and tapestry-making. They recruited young local women to the enterprise, teaching them painting, drawing, cooking, sewing, and the Irish language in addition to the Guild's core crafts. Lily Yeats ran the embroidery department, which created textiles for church decoration and domestic use.Sheehy 1980, p. 161Brown 2001, p. 149"]}, {"page": "Gordon Bottomley", "response": ["Bottomley studied the work of artists and was a dedicated collector. He bought artworks when he could afford to and his friends also gave him their art in gratitude for his support and friendship. In the 1940s Bottomley and his wife Emily gave their personal art collection of six hundred paintings, prints and drawings to the Tullie House Museum and Art Gallery in Carlisle, Cumberland. The bequest included a nationally important collection of works by the Pre-Raphaelites including pictures by Dante Gabriel Rossetti, Edward Burne-Jones, William Morris, Arthur Hughes, Ford Madox Brown, Elizabeth Siddal and Simeon Solomon. The collection also included work from artists of other genre including those of Stanley Spencer, Samuel Palmer, Albert Moore, Frederic, Lord Leighton, Henri Fantin-Latour, Lucien Pissarro, William Nicholson, Walter Crane, Charles Conder, Jessie Marion King, William Morris's daughter May Morris, William Rothenstein, Charles Ricketts and of course Paul Nash."]}, {"page": "Red House, Bexleyheath", "response": ["In 1889 Charlesworth sold the Red House for £2900 to Charles Holme (1848–1923), who remained owner until 1903. Holme had become prosperous through a woollen business in Bradford before expanding into the Asian goods trade and by the 1880s he was employed as a buyer for the Liberty department store. Married to Clara Benton, they had three daughters and a son, who moved with him to the House. Holme admired Morris, and it was here in 1893 that he founded the arts magazine, The Studio, which gave importance to the Arts and Crafts movement. The earliest photographs of Red House date from the period in which it was occupied by Holme. He also contributed to the development of the building by encouraging visitors to scratch their signatures into the window panes on the screen dividing the entrance hall from the gallery with either a diamond ring or glass-scratching implement. He collected over one hundred signatures here, from family members, friends, and visitors. Notable names include those of May Morris and Georgina Burne-Jones on their visit in 1897, and the names of Japanese visitors who were in London to collect a battleship docked on the River Thames; among the latter was the future Japanese Prime Minister Saitō Makoto. This would be a tradition continued by some of the later owners, with the latest engraving dating to 1952.", "They asserted that \"We realise that at the present time the public are interested in other and very different movements in architecture and industrial art. We are however confident that, for the sake of its association with the work of William Morris and his group, the importance of this house will be appreciated in the future, and its loss in this regard will be recognised as irreparable.\" By December 1934, the committee's appeal had only raised £550 and the Trust were unwilling to foot the rest of the bill. The committee returned the donations that had been offered. On learning of this, May Morris commented that \"That beautiful house is fated to have bad luck, it seems!\""]}, {"page": "Jane Morris", "response": ["File:Jane and May Morris circa 1865.jpg|Jane and May Morris, c. 1865"]}]}}