{"wiki_id": "http://www.wikidata.org/entity/Q4502479", "itemLabel": "Richard Heber", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Heber", "wikipedia_page": {"main": "Richard Heber (5 January 1773 – 4 October 1833) was an English book-collector.", "link_mentions": [{"page": "Walter Scott", "response": ["Three years after The Lay Scott published Marmion (1808) telling a story of corrupt passions leading up as a disastrous climax to the Battle of Flodden in 1513. The main innovation involves prefacing each of the six cantos with an epistle from the author to a friend: William Stewart Rose, The Rev. John Marriot, William Erskine, James Skene, George Ellis, and Richard Heber: the epistles develop themes of moral positives and special delights imparted by art. In an unprecedented move, the publisher Archibald Constable purchased the copyright of the poem for a thousand guineas at the beginning of 1807, when only the first had been completed.Walter Scott, 2018. Marmion: A Tale of Flodden Field, ed. Ainsley McIntosh. Edinburgh. pp. 292‒93.  Constable's faith was justified by the sales: the three editions published in 1808 sold 8,000 copies. The verse of Marmion is less striking than that of The Lay, with the epistles in iambic tetrameters and the narrative in tetrameters with frequent trimeters. The reception by the reviewers was less favourable than that accorded The Lay: style and plot were both found faulty, the epistles did not link up with the narrative, there was too much antiquarian pedantry, and Marmion's character was immoral.J. H. Alexander, 1976. Two Studies in Romantic Reviewing, Vol. 2. Salzburg. pp. 358‒369.  The most familiar lines in the poem sum up one of its main themes: \"O what a tangled web we weave,/ When first we practice to deceive\"Canto 6, stanza 17 (6.766‒67)."]}, {"page": "John Leyden", "response": ["Through Anderson also he came to know Richard Heber, by whom he came to the notice of Walter Scott, who was then collecting materials for his Minstrelsy of the Scottish Border (1802). Leyden was admirably fitted for helping in this kind of work, for he was a borderer himself, and an enthusiastic lover of old ballads and folklore. Scott tells how, on one occasion, Leyden walked 40 miles to get the last two verses of a ballad, and returned at midnight, singing it all the way with his loud, harsh voice, to the wonder and consternation of the poet and his household."]}, {"page": "Reginald Heber", "response": ["In 1752 Richard Heber received the manor and estate of Hodnet Hall in Shropshire as a bequest from a cousin of his wife. This included patronage of the parish of Hodnet. On Richard Heber's death in 1766 his brother Reginald, who was co-rector of the parish of Malpas in Cheshire, inherited the Shropshire estate and additionally became rector of Hodnet.Hughes, p. 7 His first marriage, to Mary Baylie, produced a son, Richard Heber, who became a noted book collector and Member of Parliament for Oxford University.  His second marriage to Mary Allanson, after Mary Baylie's death, produced two further sons, the elder, born at Malpas on 21 April 1783, being named Reginald after his father."]}, {"page": "Bibliomania", "response": ["The term was coined by John Ferriar (1761–1815), a physician at the Manchester Royal Infirmary.Kendall, Joshua. The man who made lists: love, death, madness, and the creation of Roget's Thesaurus, Penguin Group, USA, 2008, p. 154. Ferriar coined the term in 1809 in a poem he dedicated to his bibliomanic friend, Richard Heber (1773–1833). In the early nineteenth century, \"bibliomania\" was used in popular discourse (such as in periodical essays and poems) to describe obsessive book collectors."]}, {"page": "Book collecting", "response": ["* Richard Heber"]}, {"page": "Heber", "response": ["* Richard Heber, British book-collector"]}, {"page": "Richard", "response": ["* Richard Heber, English book-collector"]}, {"page": "Roxburghe Club", "response": ["*Richard Heber (founder member, 1812)"]}, {"page": "John Leycester Adolphus", "response": ["Adolphus was educated at Merchant Taylors' School and at St. John's College, Oxford. In 1821 he published \"Letters to Richard Heber, Esq.\", in which he discussed the authorship of the then anonymous Waverley novels, and fixed it upon Sir Walter Scott. This conclusion was based on the resemblance of the novels in general style and method to the poems acknowledged by Scott. Scott thought at first that the letters were written by Reginald Heber, afterwards bishop of Calcutta, and the discovery of J. L. Adolphus's identity led to a warm friendship. "]}, {"page": "Marmion (poem)", "response": ["Introduction to Canto 6 (To Richard Heber): Writing from Mertoun at Christmas, Scott celebrates the festive occasion maintaining ancient family traditions, and asserts the imaginative power of the superstitions recorded in the old books amassed by the bibliophile Heber."]}, {"page": "Oxford University (UK Parliament constituency)", "response": ["| Richard Heber || Tory "]}, {"page": "Minstrelsy of the Scottish Border", "response": ["Energetic as Scott's researches had been, he gained still more from the researches of other collectors he befriended or exchanged letters with.  He gained access to several manuscript collections originating from the Borders and from north-east Scotland, notably those of Mrs Brown of Falkland, David Herd and Robert Riddell.  He recruited assistants from widely different strata of society, including the wealthy and learned bibliophile Richard Heber, the lawyer Robert Shortreed, the literary antiquaries Robert Jamieson and Charles Kirkpatrick Sharpe, and later the farmer William Laidlaw and the shepherd-poet James Hogg.  Of these the most invaluable, more a collaborator than an assistant, was John Leyden, a brilliant young linguist and poet who has been called \"the project's workhorse and its architect\".  There have been criticisms of Scott for exploiting his helpers and for letting only his own name appear on the title-page, but all gave their help freely and were fully acknowledged in the body of the book."]}, {"page": "William Smith (poet)", "response": ["Richard Heber owned a manuscript A New Yeares Guift, or a posie upon certen flowers, described as presented to Mary Sidney by the \"author of Chloris\" ; it is now in the British Library, MS. Addit. 35186. Plays signed \"W. Smith\" assigned at some points to Smith were by Wentworth Smith."]}, {"page": "William Henry Miller (book collector)", "response": ["As a book collector, Miller was regarded as the successor of Richard Heber, and many of the rarest works from his collections of the latter passed into the library which he formed at Britwell Court, near Burnham, Buckinghamshire.  He was particular in his choice of copies, and from his habit of carrying about with him a foot rule to measure the size of a 'tall' copy of a book which he wished to buy, he became known at sales and among collectors as 'Measure Miller.’"]}, {"page": "Henry Grey Bennet", "response": ["The sudden ending of Bennet's career in 1824 (apparently due to the death from consumption of his only son six months after that of a daughter) was followed by a continental trip in 1825. His reputation was ruined by the threat of prosecution for importuning a young male servant at Spa in August 1825. Bennet represented himself as the victim of a conspiracy to extort money, but the facts of the case worked against him. When Parliament was dissolved in 1826 his name was linked with that of the homosexual Richard Heber.historyofparliamentonline.org, Bennet, Hon. Henry Grey (1777-1836), of Walton-on-Thames, Surr. and Camelford House, Oxford Street, Mdx.http://www.historyofparliamentonline.org/volume/1820-1832/survey/vi-members"]}, {"page": "Hugh Percy (bishop)", "response": ["*Algernon Charles (29 Jun 1812-24 Jan 1901). served as a Major in the Shropshire Yeomanry and married Emily, daughter of Bishop Reginald Heber; she was heiress to her uncle, Richard Heber MP and, in 1847, he assumed by Royal Licence the additional surname of Heber, becoming Algernon Heber-Percy, after inheriting her family's estates at Hodnet and Airmyn.Burke's Peerage 2003, page 2943 They had five sons, and seven daughters. "]}, {"page": "Christopher Brooke", "response": ["* A Funerall Poem consecrated to the Memorie of that ever honoured President of Soldyership, Sr Arthure Chichester ... written by Christopher Brooke, gent., in 1624. This poem, to which Wither contributed commendatory verses, was printed for the first time by Grosart in 1872. The manuscript had been in the possession of James Bindley, Richard Heber, and Thomas Corser. Corser printed selections in his Collectanea, and Joseph Haslewood described it in the British Bibliographer, ii. 235."]}, {"page": "George Daniel (writer)", "response": ["Daniel bought copies of the first four folio editions of Shakespeare's works, and of many of the quarto editions of separate plays. His collection of black-letter ballads was especially notable, and he issued in 1856 twenty-five copies of 'An Elizabethan Garland, being a Descriptive Catalogue of seventy Black-letter Ballads printed between 1559 and 1597.' Daniel purchased these and seventy-nine other ballads from a Mr. Fitch, postmaster of Ipswich, for £60; he sold the seventy-nine to a bookseller acting for Richard Heber for £70; at the sale of his library, those retained by Daniel fetched £750."]}, {"page": "Henry William Weber", "response": ["* Dramatic Works of John Ford, with Introduction and Explanatory Notes, 1811, 2 vols. He was not skilled in old English literature, and did not collate the early editions of the plays. This work aroused a storm of angry comment.Cf. Ford, Works, ed. Gifford, 1827, vol. i. pp. li–clxxx; Letter to William Gifford, by Octavius Gilchrist, 1811; Letter to J. P. Kemble [anon., by G. D. Whittington], 1811; Letter to Richard Heber (anon., by Rev. John Mitford), 1812) "]}, {"page": "Thomas Park", "response": ["He was brought up as an engraver, and produced mezzotint portraits, including John Thomas, bishop of Rochester, and Miss Penelope Boothby, after Sir Joshua Reynolds; Mrs. Jordan as the Comic Muse, after John Hoppner; and a Magdalen after Ubaldo Gandolfi. In 1797 he abandoned this career, and devoted himself to literature and the study of antiquities. In London he lived in turn in Piccadilly; Marylebone High Street, where Richard Heber used to drink tea two or three times a week; Durweston Street, Portman Square; and Hampstead, where he was involved with local charities."]}, {"page": "Robert Harding Evans", "response": ["He also sold the White Knights library (of George Spencer-Churchill, 5th Duke of Marlborough), those of James Bindley, John Dent, George Hibbert, Dudley Long North, and some portions of Richard Heber's (1836)."]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|21 August 1821||Oxford University||c||Sir William Scott||Richard Heber||Elevated to the peerage", "|22 February 1826||Oxford University||u*||Richard Heber||Thomas Grimston Bucknall Estcourt||Resignation"]}, {"page": "Charles Henry Hartshorne", "response": ["In 1825 Hartshorne was invited by his friend Frederick North, 5th Earl of Guilford, who had been appointed \"archon\" over the University of Corfu he had founded, to accompany him to the island, which was then ruled by the British. He travelled through Italy and made a tour in the Levant. In 1826 he returned to England. There he encountered gossip and innuendo that had blown up in his absence, concerned with a friendship he had made through the Roxburghe Club of bibliophiles with Richard Heber. John Bull hinted over two of its issues at the idea that the relationship of Heber and Hartshorne was homosexual. Heber had abruptly left the country; Hartshorne pursued John Bull successfully through the courts."]}, {"page": "Frances Mary Richardson Currer", "response": ["Thomas Frognall Dibdin wrote in 1838 that her library was one of the best in the country. Althorpe, Chatsworth and Stowe were the only libraries he thought more extensive. Dibdin is quoted as calling her the \"head of all female book collectors in Europe.\"Owned by women, University of Glasgow Special Collections, retrieved 2 November 2014 He estimated that the library contained 20,000 books, but Currer was one of his patrons. Dibdin also spoke well of the book collections of Richard Heber which were larger than Currer's. Heber and Currer had a close relationship and Heber was bailed out by Currer when he had financial difficulties."]}, {"page": "Thomas Pennant Barton", "response": ["Throughout his career as a collector, Barton worked with booksellers, binders, and stationers in both Britain, Europe, and America. He purchased from or through Obadiah Rich, Thomas Rodd, Horatio Rodd, H.G. Bohn, William Pickering, John Russell Smith, F.W. Christern, Joseph Sabin, and numerous others.See: Thomas Pennant Barton correspondence (BPL call no. MS f G.52.9) Through these agents, he was an active buyer at many of the major British book auctions of the mid-nineteenth century, including the sales of Richard Heber (1834), Benjamin Heywood Bright (1845), the Statfold Hall Library sale (1856), and a number of J.O. Halliwell-Phillipps' auctions.See: Barton Collection Catalogue for a list of Barton's annotated sale catalogs."]}, {"page": "Isaac Gosset", "response": ["While still young, Gosset collected books, especially early classics, grammars, and theological works. In London auction rooms he was subjected to gibes of his from Michael Lort, and ridiculed for his impatience during bidding. He regarded Richard Heber as his pupil in book-hunting. He helped Thomas Frognall Dibdin in preparing the second edition of his Introduction to the Classics"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["| 24 August 1821 || Oxford University || William Scott || Tory || Richard Heber || Tory || Scott was elevated to the peerage as Baron Stowell", "| 22 February 1826 || Oxford University||Richard Heber || Tory||Thomas Grimston Estcourt||Tory||Heber vacated seat"]}, {"page": "Heber, Richard", "response": ["#redirectRichard Heber"]}, {"page": "List of LGBT politicians in the United Kingdom", "response": ["|Richard Heber"]}, {"page": "Edme-Bonaventure Courtois", "response": ["He then moved to chateau Rambluzin, near Verdun, between his impressive collection of classical literature.Catalogue des livres composant la bibliothèque de feu M. Edme-Bonaventure For a while he was the mayor (1812-), but on 12 January 1816 during the Bourbon Restauration, when members of the parliament who voted the death of Louis XVI in 1793 and later supported the emperor, were condemned to exile, Courtois was forced to leave the country and moved to Brussels, leaving most of his collection (3723 items) behind.Biographien und Charakteristiken. Band 4, p. 172A Letter from Danton to Marie-Antoinette On 25 January 1816, he tried to avoid the ban by writing to the councillor of State by Louis Becquey to make him aware that he had documents concerning the royal family, found in the papers of Robespierre, and that he offered to the King, including a letter written by Marie Antoinette to her sister-in-law Madame Élisabeth at the time of this ordeal, called \"the testament of the Queen\"; a glove that belonged to the Dauphin; a small bundle of hair from Marie-Antoinette. The collection was bought by Richard Heber."]}, {"page": "Michael Wodhull", "response": ["Thomas Frognall Dibdin and Richard Heber visited Wodhull in the winter of 1815 and found him in bad health. He died at Thenford on 10 November 1816, and was buried in an altar-tomb under a yew-tree on the south side of the chancel."]}, {"page": "Walter Scott's letters", "response": ["Scott had a wide range of correspondents, reflecting his diverse literary and business interests and his close family life.  They include writers, artists, scientists, and the great political figures of his day.  Figures to whom he wrote most often include his wife, Margaret Charlotte Scott; his sons Walter and Charles Scott; his son-in-law John Gibson Lockhart; his sister-in-law Elizabeth McCulloch Scott; his steward William Laidlaw; his clan chief Charles Scott, Duke of Buccleuch; society figures Anne Hamilton, Marchioness of Abercorn and Henry James Montagu-Scott, Lord Montagu; the politicians John Wilson Croker and J. B. S. Morritt; the lawyers Charles Erskine, John Gibson, John Richardson, and James Skene; the printer James Ballantyne; the publishers John Ballantyne, Robert Cadell, Archibald Constable, and John Murray; the poets Joanna Baillie, George Ellis, and Margaret Douglas-Maclean-Clephane, Marchioness of Northampton; the novelist Maria Edgeworth; the antiquaries Richard Heber, David Laing, and Charles Kirkpatrick Sharpe; and the actor Daniel Terry."]}, {"page": "The Cedars, Sunninghill", "response": ["The Cedars was owned by the politician John Yorke in the 18th century; he sold it to the antiquary George Ellis. Ellis was a friend of Prime Minister George Canning. Ellis was a frequent correspondent of the novelist Walter Scott; Scott wrote two cantos of his epic prose poem Marmion in the garden of the residence. A stone in the garden of The Cedars marks Scott's favourite spot. Scott and his wife, Charlotte Charpentier, stayed with Ellis at The Cedars for a week with their friends Richard Heber and Francis Douce. While staying with Ellis and his wife, Scott read the first two or three cantos of the Lay of the Last Minstrel to his hosts under an old oak tree in Windsor Forest."]}, {"page": "Samuel Henshall", "response": ["# The Gothic Gospel of Saint Matthew, from the Codex Argenteus of the Fourth Century; with the corresponding English or Saxon from the Durham Book of the Eighth Century, in Roman characters; a literal English Lesson of each; and Notes, Illustrations, and Etymological Disquisitions on Organic Principles, 1807, dedicated to Richard Heber, to whom Henshall was indebted for the loan of rare books. Four monthly numbers; the fifth, due on 30 September 1807, was stopped by Henshall's last illness. In the \"occasional preface\" he turns upon his critics and threatens in a note to expose \"this mystery of iniquity\", in which \"many Antiquaries, Blackstonians, Electioneering Oxonians, Reviewers, Low Churchmen, Presbyterians, Methodists, and other herds of animals that follow their leader's tail are concerned\"."]}]}}