{"wiki_id": "http://www.wikidata.org/entity/Q4502845", "itemLabel": "Francis Hueffer", "itemDescription": "German-English writer on music, music critic, and librettist", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Hueffer", "wikipedia_page": {"main": "Francis Hueffer (born Franz Carl Christoph Johann Hüffer; 22 May 1845 – 19 January 1889) was a German-English writer on music, music critic, and librettist.", "link_mentions": [{"page": "Ford Madox Brown", "response": ["His daughters Lucy and Catherine were also competent artists.  Lucy married William Michael Rossetti in 1874.  Catherine, married Francis Hueffer; through Catherine, Brown was the grandfather of novelist Ford Madox Ford and great-grandfather of Labour Home Secretary Frank Soskice."]}, {"page": "Ford Madox Ford", "response": ["Ford was born in Wimbledon in London, to Catherine Madox Brown and Francis Hueffer, the eldest of three; his brother was Oliver Madox Hueffer and his sister was Juliet Catherine Emma Hueffer, the wife of David Soskice and mother of Frank Soskice. Ford's father, who became music critic for The Times, was German and his mother English. His paternal grandfather Johann Hermann Hüffer was first to publish Westphalian poet and author Annette von Droste-Hülshoff. He was named after his maternal grandfather, the Pre-Raphaelite painter Ford Madox Brown, whose biography he would eventually write. His mother's older half-sister was Lucy Madox Brown, the wife of William Michael Rossetti and mother of Olivia Rossetti Agresti."]}, {"page": "Jacques Offenbach", "response": ["During Offenbach's lifetime, and in the obituary notices in 1880, fastidious critics (dubbed \"Musical Snobs Ltd\" by Gammond) showed themselves at odds with public appreciation.Gammond, p. 137 In a 1980 article in The Musical Times, George Hauger commented that those critics not only underrated Offenbach, but wrongly supposed that his music would soon be forgotten.Hauger, George. \"Offenbach: English Obituaries and Realities\",  The Musical Times, Vol. 121, No. 1652 (October 1980), pp. 619–621  Although most critics of the time made that erroneous assumption, a few perceived Offenbach's unusual quality; in The Times, Francis Hueffer wrote, \"none of his numerous Parisian imitators has ever been able to rival Offenbach at his best.\"Obituary, The Times, 6 October 1880, p. 3 Nevertheless, the paper joined in the general prediction: \"It is very doubtful whether any of his works will survive.\" The New York Times shared this view: \"That he had the gift of melody in a very extraordinary degree is not to be denied, but he wrote currente calamo, and the lack of development of his choicest inspirations will, it is to be feared, keep them from reaching even the next generation\".\"Jacques Offenbach dead – The end of the great composer of opera bouffe\",  The New York Times, 6 October 1880 After the posthumous production of The Tales of Hoffmann, The Times partially reconsidered its judgment, writing, \"Les Contes de Hoffmann [will] confirm the opinion of those who regard him as a great composer in every sense of the word\". It then lapsed into what Gammond calls \"Victorian sanctimoniousness\"Gammond, p. 138 by taking it for granted that the opera \"will uphold Offenbach's fame long after his lighter compositions have passed out of memory.\"\"France\", The Times, 14 February 1881, p. 5"]}, {"page": "1846 in music", "response": ["*May 22 – Francis Hueffer, music critic (d. 1889)"]}, {"page": "Alexander Mackenzie (composer)", "response": ["By this time, Mackenzie's heavy workload as a teacher and player began to undermine his health. Two of Bülow's pupils in Florence, Italy, Giuseppe Buonamici and George F. Hatton, introduced Mackenzie to the musical philanthropists Carl and Jessie Hillebrand. After a few months' rest in their care, Mackenzie began composing full-time. Apart from a year in England (1885), he made Florence his home until 1888. During this period he spent much time in the company of Franz Liszt. He began composing large-scale works, including instrumental, orchestral and choral music and two operas. His cantatas The Bride and Jason were successfully given, and the Carl Rosa Company commissioned his first opera, Colomba, written to a libretto prepared by Francis Hueffer, music critic of The Times. The opera premiered successfully in 1883.  A second opera, The Troubadour, produced by the same company in 1886, was less successful, though Liszt thought well enough of the piece to begin work on a piano fantasia based on themes from it.  Pablo de Sarasate premiered a violin concerto by Mackenzie at the Birmingham Festival of 1885. For the 1885–86 season, Mackenzie was appointed conductor of Novello's oratorio concerts in London. Liszt paid his final visit to England chiefly to hear his Saint Elisabeth performed under Mackenzie's direction in 1886.", "Mackenzie's operas began in 1883 with Colomba, first produced by the Carl Rosa Company. It was a success, but his second opera The Troubadour (1886) was not.The Times, 9 June 1886, p. 9 Francis Hueffer's libretti for both operas were written in an antiquated style that attracted much criticism. Mackenzie's other operas were a one-act opera, The Cricket on the Hearth, first performed in 1914, The Eve of St John (1924), and two almost-complete operas, The Cornish Opera and Le luthier."]}, {"page": "Frank Soskice", "response": ["Soskice's father,  was from a family of Russian Jewish merchants. David Soskice became involved in the Russian Revolution as part of the Socialist Revolutionary Party and was the personal secretary to Alexander Kerensky. He had briefly edited the Society of Friends of Russian Freedom's newspaper Free Russia, briefly replacing Feliks Volkhovsky (the publication had financial support from the likes of Jacob Schiff and other anti-Tsarist elements). Caught in the Winter Palace during the October Revolution, Soskice fled to Britain as the Kerensykites were ousted and the Bolsheviks came to power. He became a British citizen in 1924. He was married to Frank Soskice's mother Juliet Catherine Emma Hueffer, who was the daughter of Catherine Madox Brown and Francis Hueffer, and so granddaughter of artist Ford Madox Brown, niece of Lucy Madox Brown (her mother's older half-sister) and her husband William Michael Rossetti, sister of Ford Madox Ford and Oliver Madox Hueffer and cousin of Olivia Rossetti Agresti."]}, {"page": "Franz Gehring", "response": ["Gehring was a lecturer on mathematics at first in Bonn, since 1871 at Vienna University, but became known for his music writing, particularly his biographies. Among the most notable are his biography of Mozart published in Francis Hueffer's The Great Musicians series of books, and several articles contributed to the Grove Dictionary of Music and Musicians."]}, {"page": "Franz Hueffer", "response": ["#REDIRECT Francis Hueffer"]}, {"page": "Franz Hüffer", "response": ["#REDIRECT Francis Hueffer"]}, {"page": "Franz Huffer", "response": ["#REDIRECT Francis Hueffer "]}, {"page": "List of British people with German ancestry", "response": ["* Ford Madox Ford, novelist whose father, Francis Hueffer, was from Germany"]}, {"page": "Hueffer", "response": ["* Francis Hueffer (1845–1889), German-English writer"]}, {"page": "Leopold Kaufmann", "response": ["With his brother Alexander, he attended the grammar school of his native city, and in the autumn of 1840, through Ernst Moritz Arndt, who had shortly before been reinstated in his professorship, Kaufmann matriculated as student of law at the University of Bonn. His sister Maria Theresia Julia (Julia) Kaufmann was the mother of Francis Hueffer, German-English music critic and librettist and thus the grandmother of Ford Madox Ford, Oliver Madox Hueffer and Juliet Catherine Emma Hueffer (wife of David Soskice and mother of Frank Soskice). "]}, {"page": "English Musical Renaissance", "response": ["Among the composers championed by proponents of the theory were Hubert Parry, Charles Villiers Stanford and Alexander Mackenzie. Writers who propounded the theory included Francis Hueffer and J A Fuller Maitland.", "The idea of an English musical renaissance was taken up by the music critic of The Times, Francis Hueffer, and his successor J A Fuller Maitland. The latter became the most assiduous proponent of the theory. His 1902 book English Music in the XIXth Century is subdivided into two parts: \"Book I: Before the Renaissance (1801–1850)\", and \"Book II: The Renaissance (1851–1900)\".Burton, Nigel. \"Sullivan Reassessed: See How the Fates\", The Musical Times, Vol. 141, No. 1873 (Winter, 2000), pp. 15–22 Fuller Maitland's thesis was that although \"it would be absurd to claim a place beside Beethoven or Schubert\" for earlier British composers such as Macfarren and Sterndale Bennett, it was not absurd to do so for his favourite British composers of the late 19th century. The Royal College of Music, the centre of the renaissance theory, was founded explicitly \"to enable us to rival the Germans\".Grove, George, quoted in Schaarwächter"]}, {"page": "David Soskice", "response": ["Soskice was born as son of the British Labour Home Secretary Frank Soskice and his wife Susan Isabella Cloudsley Soskice (née Hunter) in London. He shares his first name with his grandfather, the Russian revolutionary journalist , who had fled to England. His paternal grandmother was Juliet Catherine Emma Soskice (née Hueffer), daughter of Francis Hueffer and Catherine Madox Brown, sister of Ford Madox Ford and Oliver Madox Hueffer, granddaughter of Ford Madox Brown, half-niece of Lucy Madox Brown and cousin of Olivia Rossetti Agresti. "]}, {"page": "Oliver Madox Hueffer", "response": ["He was born in 1877 to Catherine Madox Brown and Francis Hueffer, and his brother was Ford Madox Hueffer. Ford Madox Brown was his grandfather. He died on 22 June 1931."]}, {"page": "Oswald Crawfurd", "response": ["In 1867 he became a clerk in the Foreign Office and was subsequently promoted to be H.M.'s consul at Oporto, Portugal. In 1873 Crawfurd founded the New Quarterly Magazine, which he sold to Francis Hueffer in 1877.  He was awarded an Order of St Michael and St George in the 1890 New Year Honours."]}, {"page": "Catherine Madox Brown", "response": ["Catherine Madox Brown Hueffer (11 November 1850 – 3 June 1927), also known as Cathy, the first child of Ford Madox Brown and Emma Hill, was an artist and model associated with the Pre-Raphaelites and married to the writer Francis Hueffer. ", "She married Francis Hueffer on 3 September 1872. They had two surviving sons, Ford Madox Ford born 1873 and Oliver Madox Hueffer, both writers.  Their daughter, Juliet Catherine Emma, married Russian revolutionary journalist , with whom she had a son, Frank Soskice, future Home Secretary.", "Francis Hueffer died in January 1899.Moser, From Olive Garnett's Diary: Impressions of Ford Madox Ford and His Friends, 1890-1906 in Texas Studies in Literature and Language, Vol. 16, No. 3 (Fall 1974), pp. 511-533"]}, {"page": "List of compositions by Julius Harrison", "response": ["* In the Forest for mixed chorus a cappella (1913); words by Heinrich Heine; translation by Francis Hueffer"]}, {"page": "Juliet Soskice", "response": ["She was the daughter of Francis Hueffer and Catherine Madox Brown, and younger sister of the novelist Ford Madox Ford who was born in 1873. After her father died in 1889, there were changes in the household. The legal position was that Charles Rowley and Theodore Watts acted as trustees."]}, {"page": "List of chief music critics", "response": ["* Francis Hueffer. Chief music critic, 1879–1889.Maitland, J.A.F. 'Hueffer, Francis', in The Oxford Dictionary of National Biography"]}]}}