{"wiki_id": "http://www.wikidata.org/entity/Q450214", "itemLabel": "Aly Bain", "itemDescription": "Scottish fiddler", "wikipedia_url": "https://en.wikipedia.org/wiki/Aly_Bain", "wikipedia_page": {"main": "Aly Bain MBE (born 15 May 1946) is a Scottish fiddler who learned his instrument from the old-time master Tom Anderson. The former First Minister of Scotland Jack McConnell called Bain a \"Scottish icon.\"", "link_mentions": [{"page": "Shetland", "response": ["Shetland's culture and landscapes have inspired a variety of musicians, writers and film-makers. The Forty Fiddlers was formed in the 1950s to promote the traditional fiddle style, which is a vibrant part of local culture today.\"The Forty Fiddlers\" , shetlopedia.com, Retrieved 8 March 2011 Notable exponents of Shetland folk music include Aly Bain, Jenna Reid, Fiddlers' Bid, and the late Tom Anderson and Peerie Willie Johnson. Thomas Fraser was a country musician who never released a commercial recording during his life, but whose work has become popular more than 20 years after his death in 1978.Culshaw, Peter (18 June 2006) \"The Tale of Thomas Fraser\" , The Guardian, Retrieved 8 March 2011"]}, {"page": "List of folk musicians", "response": ["*Aly Bain"]}, {"page": "Trow (folklore)", "response": ["Another trowie tune \"Winyadepla\", performed by Tom Anderson on his album with Aly Bain, The Silver Bow."]}, {"page": "Music of Scotland", "response": ["Among native Scots, Aly Bain and Alasdair Fraser are two of the most accomplished, following in the footsteps of influential 20th-century players such as James Scott Skinner, Hector MacAndrew, Angus Grant and Tom Anderson.  The growing number of young professional Scottish fiddlers makes a complete list impossible."]}, {"page": "Michael McGoldrick", "response": ["*Transatlantic Sessions - Series 4: Volume 2 - Jerry Douglas, Aly Bain, & Various (2010)", "*Transatlantic Sessions - Series 4: Volume 3 - Jerry Douglas, Aly Bain, & Various (2010)", "*Transatlantic Sessions - Series 5: Volume 1 - Jerry Douglas, Aly Bain, & Various (2011)", "*Five And Twenty - Aly Bain & Phil Cunningham (2012)", "*Transatlantic Session - Series 6: Volume 3 - Jerry Douglas, Aly Bain, & Various (2014)"]}]}}