{"wiki_id": "http://www.wikidata.org/entity/Q450802", "itemLabel": "Vera Brittain", "itemDescription": "English writer (1893-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vera_Brittain", "wikipedia_page": {"main": "Vera Mary Brittain (29 December 1893 – 29 March 1970) was an English Voluntary Aid Detachment (VAD) nurse, writer, feminist, socialist and pacifist. Her best-selling 1933 memoir Testament of Youth recounted her experiences during the First World War and the beginning of her journey towards pacifism.", "link_mentions": [{"page": "Anglicanism", "response": ["A question of whether or not Christianity is a pacifist religion has remained a matter of debate for Anglicans. The leading Anglican spokesman for pacifist ideas, from 1914 to 1945, was Ernest Barnes, bishop of Birmingham from 1924 to 1953. He opposed both world wars.Stephen Parker, \"'Blessed are the Pacifists':  E. W. Barnes of Birmingham and Pacifism, 1914–45,\" Midland History 34#2 (2009) 204–219. In 1937, the Anglican Pacifist Fellowship emerged as a distinct reform organisation, seeking to make pacifism a clearly defined part of Anglican theology. The group rapidly gained popularity amongst Anglican intellectuals, including Vera Brittain, Evelyn Underhill, and the former British political leader George Lansbury. Furthermore, Dick Sheppard, who during the 1930s was one of Britain's most famous Anglican priests due to his landmark sermon broadcasts for BBC Radio, founded the Peace Pledge Union, a secular pacifist organisation for the non-religious that gained considerable support throughout the 1930s."]}, {"page": "Martin of Tours", "response": ["Many churches are named after Saint Martin of Tours. St Martin-in-the-fields, at Trafalgar Square in the centre of London, has a history appropriately associated with Martin's renunciation of war; Dick Sheppard, founder of the Peace Pledge Union, was Vicar 1914–26, and there is a memorial chapel for him, with a plaque for Vera Brittain, also a noted Anglican pacifist; the steps of the church are often used for peace vigils. Saint Martin's Cathedral, in Ypres, Belgium, is dedicated to him. St. Martin is the patron saint of Szombathely, Hungary, with a church dedicated to him, and also the patron saint of Buenos Aires. In the Netherlands, he is the patron of the cathedral and city of Utrecht. He is the patron of the city of Groningen; its Martini tower and Martinikerk (Groningen) (Martin's Church) were named for him."]}, {"page": "Oxford", "response": ["* Vera Brittain, undergraduate at Somerville."]}, {"page": "Pacifism", "response": ["After the end of the war, it was discovered that \"The Black Book\" or Sonderfahndungsliste G.B., a list of Britons to be arrested in the event of a successful German invasion of Britain, included three active pacifists: Vera Brittain, Sybil Thorndike and Aldous Huxley (who had left the country).Reinhard R. Doerries, Hitler's Intelligence Chief: Walter Schellenberg, New York. Enigma Books, 2013  (p.33)William Hetherington, Swimming Against the Tide:The Peace Pledge Union Story, 1934–2009. London; The Peace Pledge Union,  (p.14)"]}, {"page": "University of Oxford", "response": ["Writers associated with Oxford include Vera Brittain, A.S. Byatt, Lewis Carroll, Penelope Fitzgerald, John Fowles, Theodor Geisel, Robert Graves, Graham Greene, Joseph Heller, Christopher Hitchens, Aldous Huxley, Samuel Johnson, Nicole Krauss, C. S. Lewis, Thomas Middleton, Iris Murdoch, V.S. Naipaul, Philip Pullman, Dorothy L. Sayers, Vikram Seth, J. R. R. Tolkien, Evelyn Waugh, Oscar Wilde, the poets Percy Bysshe Shelley, John Donne, A. E. Housman, Gerard Manley Hopkins, W. H. Auden, T. S. Eliot and Philip Larkin, and seven poets laureate: Thomas Warton, Henry James Pye, Robert Southey, Robert Bridges, Cecil Day-Lewis, Sir John Betjeman, and Andrew Motion.", "* Testament of Youth (2014), a drama film based on the memoir of the same name written by Somerville alumna Vera Brittain."]}, {"page": "1970", "response": ["* March 29 – Vera Brittain, British writer (b. 1893)"]}, {"page": "Somerville College, Oxford", "response": ["Somerville College, a constituent college of the University of Oxford in England, was founded in 1879 as Somerville Hall, one of its first two women's colleges. Among its alumnae have been Margaret Thatcher, Indira Gandhi, Dorothy Hodgkin, Iris Murdoch, Vera Brittain and Dorothy L. Sayers. It began admitting men in 1994. Its library is one of Oxford's largest college libraries. The college's liberal tone  leads back to its founding by social liberals, as Oxford's first non-denominational college for women, unlike the Anglican Lady Margaret Hall, the other to open that year. In 1964, it was among the first to cease locking up at night to stop students staying out late. No gowns are worn at Formal Halls. In 2021 it was recognised as a sanctuary campus by City of Sanctuary UK. It is one of three colleges to offer undergraduates on-site lodging throughout their course. It stands near the Science Area, University Parks, Oxford University Press, Jericho and Green Templeton, St Anne's, Keble and St Benet's. Over a third of its 650 students are not from the UK. Over half the UK admissions are from state schools – close to the university average. Its total net assets in 2018 were £225 million, the seventh highest of an Oxford undergraduate college. Its sister college at Cambridge is Girton.", "Years later, the writer Vera Brittain — a Somerville contemporary of the group, but not one of its members — recalled that the MAS “took themselves very seriously”.", "Once the war ended, the return to normality between Oriel and Somerville was delayed, sparking both frustration and an incident in spring 1919 known as the \"Oriel raid\", in which male students made a hole in the wall dividing the sexes. In July 1919 the principal (Emily Penrose) and fellows returned to Somerville. Alumna Vera Brittain wrote about the impact of the war in Oxford and paid tribute to the work of the principal, Miss Penrose, in her memoir Testament of Youth.", "Amelia Edwards, John Stuart Mill, John Ruskin and Vera Brittain have been notable benefactors to the library. It contains paintings by Mary Somerville, John Constable, Maud Sumner and Patrick George.", "The ground floor contains the Flora Anderson Hall (FAH) and Brittain-Williams Room, named after Vera Brittain and Shirley Williams, the college's most famous mother-daughter alumnae. The room was designed in 2012 by the architect Niall McLaughlin and opened on 29 November 2013 by Williams at an event that included her unveiling a portrait of herself, which now hangs in the room. The FAH is used for lectures and events, notably college parties (or bops) and mock exams, known as Collections.", "Somervillians include Prime Ministers Margaret Thatcher and Indira Gandhi, Nobel Prize winning scientist Dorothy Hodgkin, television personalities Esther Rantzen and Susie Dent, reformer Cornelia Sorabji, writers Marjorie Boulton, A. S. Byatt, Vera Brittain, Susan Cooper, Penelope Fitzgerald, Winifred Holtby, Nicole Krauss, Iris Murdoch and Dorothy L. Sayers, politicians Shirley Williams, Margaret Jay and Sam Gyimah, Princess Bamba Sutherland and her sister, biologist Marian Dawkins, philosophers G. E. M. Anscombe, Patricia Churchland, Philippa Foot and Mary Midgley, psychologist Anne Treisman, archaeologist Kathleen Kenyon, actress Moon Moon Sen, soprano Emma Kirkby, banker Baroness Vadera and numerous (women's rights) activists."]}, {"page": "Peak District", "response": ["Other writers and poets who lived in or visited the Peak include Samuel Johnson, William Congreve, Anna Seward, Jean-Jacques Rousseau, Lord Byron, Thomas Moore, Richard Furness, D. H. Lawrence, Vera Brittain, Richmal Crompton and Nat Gould. The landscapes and historic houses are popular settings for film and television. The classic 1955 film The Dam Busters was filmed at the Upper Derwent Valley reservoirs, where practice flights for the bombing raids on the Ruhr dams had been made during the Second World War."]}, {"page": "Herbert Beerbohm Tree", "response": ["Tree's last professional undertaking was a visit to Los Angeles in 1915 fulfilling a contract with a film company. He was in America for the greater part of 1915 and 1916. He returned to England in 1917 and died, aged 64, from pulmonary blood clots.  According to writer Vera Brittain, he died suddenly in the arms of her friend, the novelist Winifred Holtby, then aged 19 and working as a nursing assistant at a fashionable London nursing home where Tree was recuperating from surgery to repair a broken leg.Brittain, Vera. Testament of Friendship (1940), p. 60 in Virago paperback edition. His remains were cremated, and his ashes are buried at the additional burial ground of St John-at-Hampstead church.\"St. John-at-Hampstead Churchyard, London, England\", NNDB, 2012. Retrieved 10 June 2016"]}, {"page": "Bloomsbury", "response": ["*Vera Brittain (1893–1970) and Winifred Holtby (1898–1935), lived at 58 Doughty Street. "]}, {"page": "Camberwell", "response": ["The building was also the hospital where Vera Brittain served as a nurse and described in her memoir Testament of Youth.Lucky Kunst, The Rise and Fall of Young British Art.  Aurum Press, London 2012, p. 11 "]}, {"page": "Buxton", "response": ["Buxton held a base for British and Canadian troops in the First World War. Granville Military Hospital was set up at the Buxton Hydropathic Hotel, with the Palace Hotel annexed. The author Vera Brittain trained as a Voluntary Aid Detachment nurse at the Devonshire Hospital in 1915. The Royal Engineers based in Buxton used the Pavilion Gardens' lakes for training to build pontoon bridges.", "thumb|140px|Vera Brittain", "*Vera Brittain (1893–1970), Buxton-born authorBiography and List of Works at Litweb website archive retrieved January 2018. of Testament of Youth and mother of Shirley Williams, went to school in Buxton."]}, {"page": "Oriel College, Oxford", "response": ["During the First World War, a wall was built dividing Third Quad from Second Quad to accommodate members of Somerville College in St Mary's Hall while their college buildings were being used as a military hospital. At that time Oxford separated male and female students as far as possible; Vera Brittain, one of the Somerville students, recalled an amusing occurrence during her time there in her autobiography, Testament of Youth:"]}, {"page": "List of books banned by governments", "response": ["| Vera Brittain"]}, {"page": "Chemical weapons in World War I", "response": ["One nurse, Vera Brittain, wrote: \"I wish those people who talk about going on with this war whatever it costs could see the soldiers suffering from mustard gas poisoning. Great mustard-coloured blisters, blind eyes, all sticky and stuck together, always fighting for breath, with voices a mere whisper, saying that their throats are closing and they know they will choke.\""]}, {"page": "The Pilgrim's Progress", "response": ["Scholars have pointed out that Bunyan may have been influenced in the creation of places in The Pilgrim's Progress by his own surrounding environment. Albert FosterAlbert J. Foster, Bunyan's Country: Studies in the Topography of Pilgrim's Progress, (London: H. Virtue, 1911) describes the natural features of Bedfordshire that apparently turn up in The Pilgrim's Progress. Vera Brittain in her thoroughly researched biography of Bunyan, identifies seven locations that appear in the allegory. Other connections are suggested in books not directly associated with either John Bunyan or The Pilgrim's Progress.", "# \"Vanity Fair\" is probably also drawn from a number of sources. Some argue that local fairs in Elstow, Bedford and Ampthill were too small to fit Bunyan's descriptionJohn Bunyan, The Pilgrim's Progress, W.R. Owens, ed., (Oxford: University Press, 2003), 85–86. but Elstow's May fairs are known to have been large and rowdy and would certainly have made a big impression on the young Bunyan. Stourbridge Fair, held in Cambridge during late August and early September fits John Bunyan's account of the fair's antiquity and its vast variety of goods soldE. South and O. Cook, Prospect of Cambridge, (London: Batsford, 1985). and sermons were preached each Sunday during Stourbridge Fair in an area called the \"Dodderey.\"  John Bunyan preached often in Toft, just four miles west of Cambridge, and there is a place known as \"Bunyan's Barn\" in Toft,Vera Brittain, In the Steps of John Bunyan, (London: Rich & Cowan, 1949) so it is surmised that Bunyan visited the notable Stourbridge Fair;"]}, {"page": "Shirley Williams", "response": ["Born in Chelsea, London, Williams was the daughter of the political scientist and philosopher Sir George Catlin and the feminist and pacifist writer Vera Brittain. Williams's grandmother, Brittain's mother, was born in Aberystwyth, Wales. She was educated at various schools, including Mrs Spencer's School in Brechin Place, South Kensington; Christchurch Elementary School in Chelsea; Talbot Heath School in Bournemouth; and St Paul's Girls' School in London. During the Second World War, from 1940-1943, she was evacuated to St. Paul, Minnesota, in the United States, where she attended the all-girls' Summit School. ", "* Vera Brittain: A Life by Paul Berry and Mark Bostridge (1995).", "* Testament of Experience by Vera Brittain (1957)."]}, {"page": "1919 in literature", "response": ["*April and October – The English writers Vera Brittain and Winifred Holtby return after war service to complete their degree courses at Somerville College, Oxford .Oxford Dictionary of National Biography."]}, {"page": "1918 in literature", "response": ["*Vera Brittain – Verses of a VAD"]}, {"page": "1933 in literature", "response": ["*Vera Brittain – Testament of Youth"]}, {"page": "1970 in literature", "response": ["*March 29 – Vera Brittain, English novelist, memoirist and poet (born 1893)"]}, {"page": "List of works published posthumously", "response": ["* Winifred Holtby — South Riding (with Vera Brittain)"]}, {"page": "1893 in literature", "response": ["*December 29 – Vera Brittain, English memoirist, novelist, feminist and pacifist (died 1970)"]}, {"page": "Newcastle-under-Lyme", "response": ["thumb|Vera Brittain", "The town has been the birthplace of several notable politicians and activists. Fanny Deakin was a campaigner for better nourishment for babies and young children and better maternity care for mothers. The former chairwoman of Campaign for Nuclear Disarmament (CND), Janet Bloomfield (née Hood) is a peace and disarmament campaigner. Vera Brittain  writer, feminist (and mother of Liberal Democrat Shirley Williams) was born in the town.", "*Vera Brittain (1893–1970), author, reformer, pacifist, and mother of Shirley WilliamsThe Guardian, 30 August 2003, The making of a peacenik. Retrieved December 2017."]}, {"page": "Macclesfield", "response": ["thumb|140px|Vera Brittain, 1918", "* Vera Brittain (1893–1970) nurse, writer,The making of a peacenik, Mark Bostridge, The Guardian, 30 August 2003 retrieved December 2017 feminist and pacifist, lived in Macclesfield as a child", "* Edward Brittain MC (1895 in Macclesfield – 1918) British Army officer, fought and died in WW1 and was immortalised by his sister Vera Brittain in Testament of Youth"]}, {"page": "World War I in literature", "response": ["After the war many participants published their memoirs and diaries. One of the first was Storm of Steel (1920) by German writer Ernst Jünger, an account of his experiences as an officer on the Western Front (it was first published in English in 1930). The first memoirs of Allied combatants were published in 1922, not long after the armistice: A Tank Driver's Experiences by Arthur Jenkins and Disenchantment by Charles Edward Montague. These were shortly joined with Undertones of War (1928) by Edmund Blunden, Good-Bye to All That (1929) by Robert Graves, A Subaltern's War (1929) by Charles Edmund Carrington, A Passionate Prodigality (1933) by Guy Chapman and Blasting and Bombardiering (1937) by Percy Wyndham Lewis. Memoirs of airmen included Wind in the Wires (1933) by Duncan Grinnell-Milne, Wings of War (1933) by Rudolf Stark and Sagittarius Rising (1936) by Cecil Arthur Lewis. Nurses also published memoirs of their wartime experiences, such as A Diary without Dates (1918) by Enid Bagnold, Forbidden Zone (1929) by Mary Borden, Testament of Youth (1933) by Vera Brittain and We That Were Young (1932) by Irene Rathbone."]}, {"page": "Testament of Youth", "response": ["Testament of Youth is the first instalment, covering 1900–1925, in the memoir of Vera Brittain (1893–1970). It  was published in 1933. Brittain's memoir continues with Testament of Experience, published in 1957, and encompassing the years 1925–1950. Between these two books comes Testament of Friendship (published in 1940), which is essentially a memoir of Brittain's close colleague and friend Winifred Holtby. A final segment of memoir, to be called Testament of Faith or Testament of Time, was planned by Brittain but remained unfinished at her death.", "The book was dramatised by Elaine Morgan as a five-part serial which was transmitted on BBC2 in 1979. This version features Cheryl Campbell as Vera Brittain, Peter Woodward as Roland Leighton, Joanna McCallum as Winifred Holtby and Emrys James and Jane Wenham as Vera's parents.", "In 1998, to commemorate the eightieth anniversary of the Armistice, a fifteen-part radio dramatisation of the letters on which Testament of Youth was partly based was broadcast on BBC Radio Four. Entitled Letters from a Lost Generation, it was dramatised by Mark Bostridge and starred Amanda Root as Vera Brittain and Rupert Graves as Roland Leighton.", "In 2009 it was announced that the feature film Testament of Youth was in development by BBC Films and Heyday Films producer David Heyman, and was to be directed by James Kent. This had the support of the Vera Brittain Estate, Brittain's daughter Shirley Williams, and Brittain's biographer Mark Bostridge who is acting as consultant. Saoirse Ronan was cast to play Brittain in 2012 but was replaced in December 2013 when it was announced that Alicia Vikander would play Vera Brittain in the film which was released in late 2014 as part of the First World War commemorations. On 4 February 2014 Kit Harington joined the cast to play the role of Brittain's fiancé Roland Leighton. On 13 February 2014, Colin Morgan, Taron Egerton, and Alexandra Roach were announced to have joined the film's cast. An ensemble cast was later confirmed as filming began, including Dominic West, Emily Watson, Joanna Scanlan, Hayley Atwell, Jonathan Bailey and Anna Chancellor. It substituted Merton College, Oxford in the scenes showing Brittain's time as a student at Somerville College, arguing that filming in Somerville itself would been too difficult in light of the new buildings constructed there since the film's time period.", "A book by Brittain's biographer and editor Mark Bostridge, entitled Vera Brittain and the First World War: The Story of Testament of Youth was published by Bloomsbury in December 2014. It looks at early versions of the book in the wake of the new film adaptation.", "*Testament of Youth, Vera Brittain's Literary Quest for Peace By Linda S. Coleman Popular Press (1997). Accessed June 2008", "*Mourning through Memoir: Trauma, Testimony, and Community in Vera Brittain's Testament of Youth. by Richard Badenhausen in Twentieth Century Literature, Vol. 49, 2003. Extract accessed June 2008", "* Where did Vera Brittain serve in France during the First World War? at Simon Jones."]}, {"page": "Norman Angell", "response": ["Angell's book The Press And The Organisation of Society is cited as a source in F. R. Leavis' pamphlet Mass Civilisation and Minority Culture (1930). Vera Brittain quoted Angell's statement on \"the moral obligation to be intelligent\" several times in her work."]}, {"page": "Cheyne Walk", "response": ["* Vera Brittain, novelist and pacifist, and her husband, George Catlin, lived at number 2 before and during the Second World War."]}, {"page": "Maida Vale", "response": ["*Vera Brittain (1893–1970), writer, at 111 Wymering Mansions, Wymering Road."]}, {"page": "Liberty (advocacy group)", "response": ["The immediate spur to the organisation's formation was the National Hunger March of 1932. The first Secretary was Ronald Kidd, and first President was the novelist E. M. Forster; Vice-Presidents were the politician and author A. P. Herbert and the journalist Kingsley Martin of the New Statesman. H. G. Wells, Lewis Clive, Vera Brittain, Clement Attlee, Rebecca West, Edith Summerskill and Harold Laski were also founder members.Dyson, Brian (1994): Liberty in Britain 1934–1994: a diamond jubilee history of the National Council for Civil Liberties. Civil Liberties Trust."]}, {"page": "Bernard Williams", "response": ["After Oxford, Williams spent his two-year national service flying Spitfires in Canada for the Royal Air Force. While on leave in New York, he became close to Shirley Brittain Catlin (born 1930), daughter of the novelist Vera Brittain and the political scientist George Catlin. They had already been friends at Oxford. Catlin had moved to New York to study economics at Columbia University on a Fulbright scholarship."]}, {"page": "Uppingham School", "response": ["Uppingham School had been attended by three out of the four First-World-War victims Vera Brittain included as her correspondents in her much-praised Letters from a Lost Generation.Published 1998, London, Little, Brown and Company."]}, {"page": "Legal & General", "response": ["In the 1940s the main office of Legal & General was moved from Temple Bar House in the City of London to a remodelled former girls' school in leafy Kingswood, Surrey, save for some top management functions which remained in London. The girls' school (St. Monica's), which formed the basis for the site, was attended by the novelist Vera Brittain, mother of the politician Shirley Williams. The Kingswood site, which included sports fields, a park, a large and luxurious swimming pool, a canteen and a simulacrum of an English pub, among other facilities, was expanded in the 1950s and again in the 1980s. In 2015, it was announced that the headquarters would close \"potentially before 2025\". In fact, after a period of uncertainty for the staff at Kingswood, it was announced that the site would shut much earlier, in 2018."]}, {"page": "War poet", "response": ["* The 2014 film Testament of Youth tells the story of star-crossed lovers and war poets Vera Brittain (Alicia Vikander) and Roland Leighton (Kit Harrington). As in Hedd Wyn, Roland Leighton is depicted as a tragic hero and his love poetry and war poetry are recited in voiceover at key moments of the film. "]}, {"page": "Asiago", "response": ["Ernest Hemingway fought here. In a later engagement in 1918, Edward Brittain, brother of Vera Brittain, was killed and was buried in the Granezza British military cemetery on the plateau. In 1970 Vera's ashes were scattered on his grave."]}, {"page": "John Middleton Murry", "response": ["Murry's opinions during this period often provoked controversy. He angered many left-wingers (including George Orwell and Vera Brittain) by arguing that Nazi Germany should be allowed to retain control of mainland Europe. Murry believed even though Nazi rule was tyrannical, it was preferable to the horrors of total war.Richard A. Rempel, \"The Dilemmas of British Pacifists During World War II\", The Journal of Modern History, Vol. 50, No. 4, On Demand Supplement (Dec., 1978), pp. D1213-D1229.Lea, pp. 310–12. Murry later \"renounced his pacifism in 1948 and...urged a preventative war against the Soviet Union, ending his life as a Conservative voter\".Quoted in David Goodway,Anarchist Seeds Beneath the Snow (2006), Liverpool University Press, 2006,, p. 208.According to Alan Warwick Palmer and Veronica Palmer, Murry's 1948 book The Free Society   "]}, {"page": "Nancy Cunard", "response": ["Among sixteen responses that Cunard, in her eventually published compendium, grouped under the sceptical heading \"Neutral?\" were H. G. Wells, Ezra Pound, T. S. Eliot and Vera Brittain.Hoskins, Katherine Bail Today the struggle: literature and politics in England during the Spanish Civil War ,University of Texas Press, 1969 (p.19)"]}, {"page": "New feminism", "response": ["New feminists were opposed mainly by young women, especially those in the Six Point Group, particularly Winifred Holtby, Vera Brittain, and Dorothy Evans, who saw this as a retrograde step towards the separate spheres ideology of the 19th century. They were particularly opposed to protective legislation, which they saw as being in practice restrictive legislation, which kept women out of better-paid jobs on the pretext of health and welfare considerations."]}, {"page": "World Peace Council", "response": ["As the non-aligned peace movement \"was constantly under threat of being tarnished by association with avowedly pro-Soviet groups\", many individuals and organizations \"studiously avoided contact with Communists and fellow-travellers.\"Russell, Bertrand, and A. G. Bone (ed.), The Collected Papers of Bertrand Russell (Volume 28): Man's Peril, 1954–55, Routledge, 2003. Some western delegates walked out of the Wroclaw conference of 1948, and in 1949 the World Pacifist Meeting warned against active collaboration with Communists. In the same year, several members of the British Peace Pledge Union, including Vera Brittain, Michael Tippett, and Sybil Morrison, criticised the WPC-affiliated British Peace Committee for what they saw as its \"unquestioning hero-worship\" of the Soviet Union. In 1950, several Swedish peace organizations warned their supporters against signing the WPC's Stockholm Appeal. In 1953, the International Liaison Committee of Organizations for Peace stated that it had \"no association with the World Peace Council\". In 1956, a year in which the WPC condemned the Suez war but not the Russian suppression of the 1956 Hungarian uprising, the German section of War Resisters International condemned it for its failure to respond to Soviet H-bomb tests. In Sweden, Aktionsgruppen Mot Svensk Atombomb discouraged its members from participating in Communist-led peace committees. The WPC attempted to co-opt the eminent peace campaigner Bertrand Russell, much to his annoyance, and in 1957 he refused the award of the WPC's International Peace Prize. In Britain, CND advised local groups in 1958 not to participate in a forthcoming WPC conference. In the US, SANE rejected WPC appeals for co-operation. A final break occurred during the WPC's 1962 World Congress for Peace and Disarmament in Moscow. The WPC had invited non-aligned peace groups, who were permitted to criticize Soviet nuclear testing, but when western activists including the British Committee of 100Driver, Christopher, The Disarmers, London: Hodder and Stoughton, 1964. tried to demonstrate in Red Square against Soviet weapons and the Communist system, their banners were confiscated and they were threatened with deportation.Bulletin of the Atomic Scientists, June 1963, p. 39 As a result of this confrontation, 40 non-aligned organizations decided to form a new international body, the International Confederation for Disarmament and Peace, which was not to have Soviet members.Donald Keys and Homer A. Jack, \"Oxford Conference of Non-aligned Peace Organizations\", 30 January 1963."]}, {"page": "Elaine Morgan", "response": ["She won two BAFTAs and two Writers' Guild awards. She also wrote the script for the Horizon documentary about the disabled fund-raiser Joey Deacon, winning the Prix Italia in 1975. She was honoured with the Writer of the Year Award from the Royal Television Society for her serialisation of Vera Brittain's Testament of Youth (1979)."]}, {"page": "History of the United Kingdom during the First World War", "response": ["There was also a notable group of war poets who wrote about their own experiences of war, which caught the public attention. Some died on active service, most famously Rupert Brooke, Isaac Rosenberg, and Wilfred Owen, while some, such as Siegfried Sassoon survived. Themes of the poems included the youth (or naivety) of the soldiers, and the dignified manner in which they fought and died. This is evident in lines such as \"They fell with their faces to the foe\", from the \"Ode of Remembrance\" taken from Laurence Binyon's For the Fallen, which was first published in The Times in .The Times on  1914. Female poets such as Vera Brittain also wrote from the home front, to lament the losses of brothers and lovers fighting on the front."]}, {"page": "Charles Hudson (VC)", "response": ["In Testament of Youth, After the book's publication, in 1934, Hudson got in touch with Brittain and told her that her brother had been under threat of court martial because of his alleged homosexual relations with men in his company, see Paul Berry and Mark Bostridge, Vera Brittain: A Life, 1995 Vera Brittain describes several meetings with the convalescent Hudson while she was trying to discover the circumstances of the death of her brother, Captain Edward Brittain, who had served under Hudson, and was killed on 15 June 1918 in the attack in which Hudson won his VC."]}]}}