{"wiki_id": "http://www.wikidata.org/entity/Q450493", "itemLabel": "Mara Yamauchi", "itemDescription": "British long distance track, and road running athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Mara_Yamauchi", "wikipedia_page": {"main": "Mara Rosalind Yamauchi (born Mara Myers 13 August 1973) is a British long-distance track and road running athlete. She currently holds the second fastest time by a British woman over the marathon, behind former world-record holder, Paula Radcliffe.", "link_mentions": [{"page": "Oxford", "response": ["Headington Road Runners based at the OXSRAD sports facility in Marsh Lane (next to Oxford City F.C.) is Oxford's only road running club with an average annual membership exceeding 300. It was the club at which double Olympian Mara Yamauchi started her running career."]}, {"page": "Deena Kastor", "response": ["On March 21, 2010, Kastor competed in the first spring running of the New York City Half Marathon. After running the majority of the race in first, on her way to breaking the course record, she dropped to second place to finish behind Great Britain's Mara Yamauchi."]}, {"page": "England at the 2006 Commonwealth Games", "response": [":Mara Yamauchi, Women's 10000 m", "|Mara Yamauchi"]}, {"page": "Norman Myers", "response": ["Myers was born in Whitewell (Lancashire, then Yorkshire) and was raised until the age of 11 on the family farm, without electricity, gas or an internal toilet. He lived in Kenya for over 30 years and later settled in Headington, Oxford, England.Background pp. 1-7. He attended grammar school and then the University of Oxford (BA French and German, Keble College 1958, MA 1963) and became a District Officer in the last few years of the Kenya Administration from 1958 to 1961. He then worked as a high school teacher in Nairobi from 1961 to 1966He was teaching me French after my arrival at Delamere Boys School in Nairobi May 1966 until at least the end of the school year in December and a freelance writer and broadcaster until 1969. In 1972, after PhD studies at the University of California, Berkeley (graduated 1973) he became a consultant for the UN, the World Bank and other organisations, remaining in Kenya until the early 1980s. He and Dorothy have a daughter, retired marathon runner Mara Yamauchi, who they raised in Kenya until the age of 8."]}, {"page": "Great Britain at the 2006 European Athletics Championships", "response": ["|13||Mara Yamauchi||10,000 m W|| 32:07.90||--", "10,000 m: Cathy Butler, Mara Yamauchi, Hayley Yelling"]}, {"page": "Gishu Mindaye", "response": ["Gishu won the 2006 Rotterdam Marathon on April 9 beating Helena Javornik and Isabel Elizmendi after 2:28:30, breaking away from Javornik passing the 35 km mark. In September that year she returned to Rotterdam taking part in the 1/2 Marathon. Gishu finished second behind Mara Yamauchi finishing almost two minutes earlier."]}, {"page": "Aya Manome", "response": ["On September 10, 2006, Manome finished third at the Rotterdam Half Marathon in Rotterdam, The Netherlands. Her time of 1:12:50 was 2:14 behind winner Mara Yamauchi. Manome also finished third in the 2007 Great Scottish Run half marathon."]}, {"page": "2005 IAAF World Half Marathon Championships", "response": ["|align=center| 18 || Mara Yamauchi ||  ||  1:12:40 || ", "|align=center| 5 ||  || Mara YamauchiHayley HainingSusan Partridge ||  3:40:08"]}, {"page": "Osaka International Ladies Marathon", "response": ["|Mara Yamauchi"]}, {"page": "List of British records in athletics", "response": ["|Mara Yamauchi"]}, {"page": "Irina Mikitenko", "response": ["She repeated her performance at the London Marathon in 2009, finishing with a time of 2:22:11, one minute ahead of Britain's Mara Yamauchi. Following the death of her father in July, Mikitenko struggled to find form in the buildup to the 2009 World Championships. Jurgen Mallow, director for the German athletics team, said her withdrawal was a blow for the team hosting the championships, stating that she \"did not manage to hit World Championship form in the St. Moritz altitude training camp. We are very, very sad about this\". Finally she participated in the October 2009 Chicago Marathon, winning with an official time of 2:26:31 and won the half-million dollar WMM jackpot for a second consecutive year.Mikitenko's wins in both the Chicago Marathon and the World Marathon Majors jackpot were awarded in 2014 as a result of an investigation into doping.   See Doping in Russia for details regarding doping involving the competitor who finished first but was disqualified."]}, {"page": "Yamauchi", "response": ["*Mara Yamauchi, British long-distance runner"]}, {"page": "Tokyo bid for the 2016 Summer Olympics", "response": ["Many former Olympic athletes lent their support on the Tokyo bid committee website, including Kōsuke Kitajima (gold medalist for the men's 100m and 200m breaststroke at both the Athens 2004 and Beijing 2008 games). Three other athletes have also expressed their support: Koji Murofushi, the winner of the men's hammer throw in Athens 2004, Mara Yamauchi, a British long distance track and field woman athlete, and Mayumi Narita who holds 15 gold medals in three Paralympics with the women's swimming. In the PR video, French-Japanese TV announcer Christel Takigawa introduces the charm of Tokyo in French, and Riyo Mori, the Miss Universe 2007 winner, spoke in English. Naoko Takahashi, the champion in Sydney 2000 and the former world record holder in the women's marathon, is the project reader of a roughly virtual ekiden (long distance relay) from Tokyo to Copenhagen, the venue of the IOC meeting to determine the host city on October 2, 2009. The Tokyo Marathon is one of the main publicity events for this bid."]}, {"page": "Great Britain and Northern Ireland at the 2007 World Championships in Athletics", "response": ["|9th||Mara Yamauchi||Marathon W||2:32:55||", "Marathon: Tracey Morris, Mara Yamauchi", "Marathon: Tracey Morris, Mara Yamauchi"]}, {"page": "2007 World Championships in Athletics – Women's marathon", "response": ["| 9 ||align=left|Mara Yamauchi ||align=left| || 2:32:55 ||"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Mara Yamauchi"]}, {"page": "Athletics at the 2008 Summer Olympics – Women's marathon", "response": ["|  ||align=left| Mara Yamauchi ||align=left|  || 2:27:29 || "]}]}}