{"wiki_id": "http://www.wikidata.org/entity/Q451701", "itemLabel": "Trevor Wooley", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Wooley", "wikipedia_page": {"main": "Trevor Dion Wooley FRS (born 17 September 1964) is a British mathematician and currently Professor of Mathematics at Purdue University.  His fields of interest include analytic number theory, Diophantine equations and Diophantine problems, harmonic analysis,\nthe Hardy-Littlewood circle method, and the theory and applications of exponential sums.  He has made significant breakthroughs on Waring's problem, for which he was awarded the Salem Prize in 1998.\nHe received his bachelor's degree in 1987 from the University of Cambridge and his Ph.D., supervised by Robert Charles Vaughan, in 1990 from the University of London. In 2007 he was elected Fellow of the Royal Society.", "link_mentions": [{"page": "Fröhlich Prize", "response": ["*2012 Trevor Wooley"]}, {"page": "Bob Vaughan", "response": ["Since 1999 he has been Professor at Pennsylvania State University, and since 1990 Fellow of the Royal Society. He did his PhD at the University of London under supervision of Theodor Estermann. He supervised Trevor Wooley's PhD."]}, {"page": "Zhan Tao", "response": ["Since joining the faculty of Shandong University in 1987, he has been working on classical problems in number theory such as estimates of exponential sums over primes, mean-value theorems for arithmetic progressions, and Goldbach's conjecture. In particular, he has solved the quadratic almost Goldbach conjecture, and has successfully proved a new form of the Three-Prime theorem in arithmetic progressions to large moduli. His results have been generalized by Trevor Wooley in various directions."]}, {"page": "Trevor D. Wooley", "response": ["#redirect Trevor Wooley"]}, {"page": "List of people by Erdős number", "response": ["* Trevor Wooley"]}, {"page": "Wooley", "response": ["* Trevor Wooley (born 1964), British mathematician"]}]}}