{"wiki_id": "http://www.wikidata.org/entity/Q451654", "itemLabel": "Ketevan Arakhamia-Grant", "itemDescription": "British chess player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ketevan_Arakhamia-Grant", "wikipedia_page": {"main": "Ketevan Arakhamia-Grant (née Arakhamia) is a Georgian (former Soviet Union)-born Scottish Grandmaster of chess.", "link_mentions": [{"page": "List of chess players", "response": ["* Ketevan Arakhamia-Grant (Georgia, born 1968)"]}, {"page": "Scottish Chess Championship", "response": ["Recent notable winners include Ketevan Arakhamia-Grant in 2003 – the first woman player to win the Scottish Championship, and Jonathan Rowson, who became the first Scottish player to clinch the Grandmaster title on home soil in 1999, and did the Scottish / British double in 2004.  In 2013 Roddy McKay won the title some 39 years after first winning his first title in 1974.  In 2018 Murad Abdulla became the youngest Double winner of the title.", "*2003 - Paul Motwani, Ketevan Arakhamia-Grant", "*2011 - Ketevan Arakhamia-Grant", "*2016 - Ketevan Arakhamia-Grant (Scottish Champion 6), Matthew J Turner (Open Winner 7.5)"]}, {"page": "Ketevan", "response": ["* Ketevan Arakhamia-Grant (born 1968), Soviet-born Georgian chess grandmaster"]}, {"page": "Qin Kanying", "response": ["Qin reached the final of the Women's World Chess Championship 2000 in New Delhi after she sequentially knocked out Masha Klinova, Ketevan Arakhamia-Grant, Ketino Kachiani-Gersinska, Corina Peptan and Alisa Marić. In the final she faced defending champion Xie Jun, who retained her title by winning 2½-1½ in a four-game match. Also in 2000, Qin finished second in the Asian Women's Championship in Udaipur."]}, {"page": "32nd Chess Olympiad", "response": ["* Board 3:  Ketevan Arakhamia-Grant 8 / 10 = 80.0%"]}, {"page": "Yelena Dembo", "response": ["She has eight medals from World and European championships, including the 2002 European Rapid Championship gold medal for girls 'Under 20', gained in Novi Sad and, most significantly, the bronze medal from the Women's European Individual Chess Championship (held Moldova, 2005). At the 2008 EU Individual Open Chess Championship held in Liverpool, she shared the prize for 'highest placed woman' with Jovanka Houska and Ketevan Arakhamia-Grant."]}, {"page": "List of FIDE federation player transfers", "response": ["|Ketevan Arakhamia-Grant"]}, {"page": "Ketevan Arakhamia", "response": ["#REDIRECT Ketevan Arakhamia-Grant"]}, {"page": "Jovanka Houska", "response": ["At Liverpool in 2008, she became British and English Women's Champion for the first time, finishing a full point ahead of closest rival Susan Lalic and a half point ahead of grandmasters Glenn Flear and Stewart Haslinger. Her second Liverpool visit resulted in a third share of the women's best performance prize (jointly with Ketevan Arakhamia-Grant and Yelena Dembo) at the EU Individual Open Chess Championship."]}, {"page": "EU Individual Open Chess Championship", "response": ["The fourth edition of the Championship saw a return to the venue of 2006—Liverpool's World Museum. Held September 9-18th 2008, during the city's reign as European Capital of Culture, there were one hundred and forty participants, from twenty member states, competing for a record prize fund. The event was won by Jan Werle of the Netherlands, the best tournament success of his chess career to date. He drew with Maxime Vachier-Lagrave in the final round, while Michael Adams, a half point behind, settled for an early draw with Emanuel Berg, thereby securing a share of second place. The women's top spot was shared between Jovanka Houska, Yelena Dembo and Ketevan Arakhamia-Grant, all on 6 points.TWIC 724. Mark Crowther. London Chess Center"]}, {"page": "List of Russian chess players", "response": ["*Ketevan Arakhamia-Grant (born 1968)"]}, {"page": "Keti Grant", "response": ["#redirect Ketevan Arakhamia-Grant"]}, {"page": "USSR Women's Chess Championship", "response": ["| 50 || 1990 ||  Podolsk  || Ketevan Arakhamia-Grant || 13 / 16    "]}, {"page": "Chess Scotland", "response": ["*Ketevan Arakhamia-Grant"]}, {"page": "Marta Michna", "response": ["* In Women's World Chess Championship 2006 in the first round lost to Ketevan Arakhamia-Grant.2006 FIDE Knockout Matches"]}, {"page": "Women's World Chess Championship 2018 (November)", "response": ["#  Ketevan Arakhamia-Grant, GM, 2345 (E16)"]}]}}