{"wiki_id": "http://www.wikidata.org/entity/Q452349", "itemLabel": "Danny MacAskill", "itemDescription": "Scottish mountain bike trials rider", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_MacAskill", "wikipedia_page": {"main": "Daniel \"Danny\" MacAskill  is a Scottish trials cyclist, from Dunvegan on the Isle of Skye. He works professionally as a street trials / Mountain bike rider for Santa Cruz Bicycles. In April 2009, he released a five-minute street trials video to YouTube, filmed by his flatmate Dave Sowerby. This video gained widespread media attention, featuring stunts performed by MacAskill set to  \"The Funeral\" by Band of Horses.As of April 2009, MacAskill had been practising several hours per day for more than 12 years. He gave up his job as a mechanic so he could ride full-time and now lives in Glasgow. In June 2009, MacAskill appeared in the music video for Doves' single \"Winter Hill\".In September 2009, MacAskill was the focus of TV advert filmed by The Leith Agency on behalf of Scottish jobs website s1jobs.com.On 16 November 2010 MacAskill released a new video Way Back Home produced by Red Bull Media House. The video showcases locations around Scotland including Edinburgh Castle, North Berwick, wartime bunkers on the island of Inchgarvie beneath the Forth Bridge and the Cruachan Dam in the Scottish Highlands. In May 2011 Leica Camera released a Go Play promotional video featuring him doing tricks in the city of Cape Town. On 9 August 2011 Cut Media released a video named Industrial Revolutions directed by Stu Thomson. The video, set to \"The Wolves\" by Ben Howard, features MacAskill doing tricks in an abandoned Scottish iron works. It was created for Mike Christie's Channel 4 documentary Concrete Circus.In 2011 MacAskill, along with Inspired Bicycles, released his signature trials frame, the \"Inspired Skye\".In 2012, MacAskill performed the stunts for the movie Premium Rush. MacAskill is currently managed by the German agency Rasoulution.In early May 2013, MacAskill was invited to Taichung, Taiwan by a sponsorship partner, Lezyne, to film a riding video titled Danny MacAskill in Taiwan - powered by Lezyne.In summer 2013, MacAskill published a trial biking project on YouTube called Imaginate which had been shot over 18 months produced by Mike Christie for Red Bull Media House and directed by Stu Thomson. In fewer than three weeks, the video had received over 4 million views (currently 90) .In May 2014, MacAskill released another video through Red Bull Media House called Epecuen, which was shot on location in Epecuén, Argentina. The town has been submerged underwater since 1985 for most of the time, and the video opens with its only resident speaking about it. As of April 2016, the video has accumulated over 10 million views.\nIn October 2014, MacAskill and long-term collaborator Stu Thomson of Cut Media released a film titled The Ridge. It was filmed on his home island, the Isle of Skye, along the steep and rocky Cuillin Ridge. In the first 5 days, the video on YouTube garnered over 10 million views.  The film was accompanied by a BBC Scotland programme Riding the Ridge that documented Danny and the Cut Media crew as they created the viral film.\nCascadia, also produced by Cut Media, appeared in November 2015.\nThe video \"Danny Macaskill's Gymnasium\" was released on 7 January 2020, featuring I'm on My Way by The Proclaimers.In January 2021, Danny released the video \"Danny MacAskill - The Slabs\" featuring Danny riding down a 500-meter section the remote Dubh Slabs which rise out from Loch Coruisk on the Isle of Skye, Scotland. The video was filmed in September 2020 when Scotlands COVID-19 restrictions were temporarily eased and was released with the song \"No Cars Go\" by Arcade Fire. The video gained over a million views within 2 days of being released.", "link_mentions": [{"page": "Stirling", "response": ["#Way Back Home (2010) Has Danny MacAskill perform stunts on his bike on Stirling Bridge."]}, {"page": "Cuillin", "response": ["* Trials cyclist Danny MacAskill, who grew up on the Isle of Skye, filmed the mountain bike edit The Ridge on the Cuillin."]}, {"page": "Sgùrr Dearg", "response": ["In 2014 cyclist Danny MacAskill climbed Sgùrr Dearg without safety ropes, while carrying a mountain bike on his back. The film was viewed over fourteen million times in the week following its launch on 2 October 2014 and has been watched over 73 million times (as of November 2020)."]}, {"page": "Dunvegan", "response": ["Tourist information used to be situated in the parade of shops at Lochside, but is now available on a seasonal basis at Dunvegan Castle's St Kilda Shop. The Giant MacAskill Museum, which celebrates the life of Angus Mòr MacAskill was established in 1989 and is managed by Peter MacAskill, father of the street trials cycle rider Danny MacAskill.Danny MacAskill makes a career from defying death (15 February 2009) The Times. Retrieved 28 May 2010."]}, {"page": "Angus MacAskill", "response": ["The \"Giant MacAskill Museum\" was also established in 1989 at Dunvegan on the Isle of Skye and is operated there by a community group, this museum having several replicated artifacts from the Englishtown museum. It is managed by Peter MacAskill, father of the street trials cycle rider Danny MacAskill.\"Danny MacAskill makes a career from defying death\" (15 February 2009) The Times. Retrieved 28 May 2010."]}, {"page": "List of cyclists", "response": ["* Danny MacAskill"]}, {"page": "I'm on My Way (The Proclaimers song)", "response": ["Scottish trials cyclist Danny MacAskill used the song as the soundtrack for his cycling stunt video of January 2020, Danny MacAskill's Gymnasium. \"I'm on My Way\" was included on the Canadian television show Mr. D on the eleventh episode of the seventh season, as the outro song to send off its seventh season."]}, {"page": "No Cars Go", "response": ["In the UK, the song was also featured in Top Gear's video montage/preview at the beginning of Series Ten, as well as in ITV's coverage of the UEFA Champions League in 2007/8. It has also featured on series 6 of Wheeler Dealers, a motoring programme on the Discovery Channel. In Italy it was used as the main theme of the soccer's Sunday TV-show \"Quelli Che Il Calcio\" hosted by Victoria Cabello, from September 18, 2011 to May 19, 2013 on Rai 2. It also was the soundtrack for the Danny MacAskill film The Slabs."]}, {"page": "List of professional mountain bikers", "response": ["*Danny MacAskill (Santa Cruz)"]}, {"page": "The Funeral (Band of Horses song)", "response": ["* Danny MacAskill (YouTube video of bike trials stunts)\"Stunt video reaches new heights\" BBC News - April 21, 2009"]}, {"page": "Grit (Martyn Bennett album)", "response": ["The song \"Blackbird\" was used in the soundtrack for Danny MacAskill's 2014 film, The Ridge."]}, {"page": "Bothy Culture", "response": ["To celebrate the 20th anniversary of Bothy Culture, and the 25th anniversary of the Celtic Connections festival, arranger and conductor Greg Lawson's GRIT Orchestra, named after Bennett's final album Grit (2003) and containing some 100 traditional folk, classical and jazz musicians, performed the show Bothy Culture and Beyond at the SSE Hydro, Glasgow as part of the festival on 27 January 2018. The shows were billed as a \"music-vision-dance-bike spectacular,\" and feature Lawson's rearrangements of the tracks from the album, as well as visual spectacles, including internationally famous Scottish stunt cyclist Danny MacAskill, whose appearance was inspired by the film The Ridge (2014), in which MacAskill performed a stunt to the soundtrack of Bennett's \"Blackbird\". The show was Lawson and the GRIT Orchestra's second tribute to a Bennett album, following their Celtic Connections tribute to his final album Grit in 2015, although the orchestra was even bigger for Bothy Culture and Beyond, adding a backline of Scottish fiddlers including Duncan Chisholm, Chris Stout and Aidan O'Rourke. Lawson was a friend of Bennett, and when asked why he chose to perform Bothy Culture, he said:", "The bulk of the music was the result of two separate string sections, with numerous Scottish fiddlers leading the traditional melodies in one string section while accompanying soundscapes were provided by classical violins, double bass and cellos in the other. The voice of \"Aye?\" was provided by Innes Watson of the Treacherous Orchestra. David Hayman read Sorley MacLean's English translation of \"Hallaig,\" while in a break from the album, Fiano Hunter and the Glasgow Chapel Choir recreated the Grit song \"Blackbird\", accompanied by Danny MacAskill's stunt cycle work. \"Shputnik in Glenshiel\" was accompanied by whistle from Fraser Fifeld, while “Ud the Doudouk” featured punches of brass, Innes’ spirited chants and a \"perfectly-timed finish.\" Meanwhile, the “impossibly whacky” intro for \"Joik\" was translated to strings, brass and percussion, unifying the folk and classical string sections. \"Waltz for Hector\" was heralded in by drum beats and soft whistles and featured a percussion section from James MacKintosh capturing the song's complex beats."]}, {"page": "Red Bull GmbH", "response": ["Red Bull sponsors extreme cyclists Danny MacAskill and Fabio Wibmer."]}, {"page": "Loch Lomond (band)", "response": ["With help of engineer/producer Rob Oberdorfer, Young crafted the first Loch Lomond album, When We Were Mountains with Ryan Cross and Kate O'Brien in 2004. Over the next few years, Loch Lomond performed around Portland, Oregon and the greater Pacific Northwest in various incarnations. Live performances would range from Young by himself to a full band. During this time, many different recording sessions took place in various studios and homes. These recordings were compiled on the early 2006 EP Lament For Children. In the later half of 2006, Loch Lomond solidified into a nine-person band. In this format, they produced their 2007 album \"Paper the Walls\", which was more reminiscent of traditional chamber folk music while featuring many non-traditional instruments. They toured with The Decemberists in late 2008. In 2010, Loch Lomond's song, Wax and Wire, was featured in the short film Danny MacAskill's Way Back Home produced by Red Bull Media House."]}, {"page": "MacAskill", "response": ["*Danny MacAskill (born 1985), Scottish stunt cyclist"]}, {"page": "Winter Hill (song)", "response": ["The music video for \"Winter Hill\" premiered on 10 June 2009 and features stunt cyclist Danny MacAskill.Pulse Films: Doves \"Winter Hill\" The video was produced by Pulse Films and directed by David Mould, who previously directed the video for Doves' 2002 single \"Caught by the River.\""]}, {"page": "Laureus World Sports Award for Action Sportsperson of the Year", "response": ["| align=left | Antoine Albeau () – windsurfing Chris Cole () – skateboarding Mick Fanning () – surfing Greg Long () – surfing Danny MacAskill () – mountain bike trials", "| align=left | Stephanie Gilmore () – surfing Nyjah Huston () – skateboarding Sage Kotsenburg () – snowboarding Danny MacAskill () – mountain bike trials Gabriel Medina () – surfing "]}, {"page": "The Jezabels", "response": ["The \"Hurt Me\" clip was aired on Australian national television for a number of weeks in February 2010 by the Australian Broadcasting Corporation's music video program rage. It was also the rage Indie Clip of the Week in March 2010.The Jezabels Sydney Show & National Support Tour with Tegan & Sara. LifeMusicMedia. Retrieved on 14 December 2011. \"Easy to Love\" was aired on rage in May 2010. While not an official music video, their song \"A Little Piece\" is featured in the Danny MacAskill bicycle trials video \"Way Back Home\".Danny MacAskill Way Back Home. The Inspiration Room (18 November 2010). Retrieved on 14 December 2011. It is also featured in a video by acclaimed Slovenian dog trainer Silvia Trkman. Her Pyrenean Shepherd, Le, who appears in the video, has gone on to become an international dog agility star.Silvia Trkman, A blind passenger, a famous drummer or just a puppy, having fun?  Retrieved on 2 June 2014 In the opening video on YouTube for Ubisoft's Far Cry 3, the song \"Prisoner\" is played in a very short version.", "In November 2011, \"A Little Piece\" was used for the Under Armour 'Are You From HERE?' commercial that features basketball star Brandon Jennings.  \"A Little Piece\" was also used in the 2010 Red Bull short film \"Way Back Home\", set in Scotland's Isle of Skye, and featuring trials bike rider Danny MacAskill.", "\"Long Highway\" was used in the 2014 Red Bull short film Epecuén, set in the Argentinian village of Villa Epecuén and featuring trials bike rider Danny MacAskill."]}, {"page": "Hope Technology", "response": ["Hope supported Danny MacAskill released the short film 'Inspired' in April 2009. Filmed in and around Edinburgh by his flat mate, the edit shows Danny riding his trials bike performing stunts around the city centre, and now has over 39.7 million views on YouTube."]}, {"page": "Villa Epecuén", "response": ["The town has been featured in the TV shows Abandoned Engineering (season 4, episode 1), and Mysteries of the Abandoned (season 4, episode 1). It was used as a location in the 2010 film And Soon the Darkness, starring Amber Heard and Karl Urban. The city features as the backdrop to one of Danny MacAskill's street trials cycling videos.Archived at Ghostarchive and the Wayback Machine: "]}]}}