{"wiki_id": "http://www.wikidata.org/entity/Q452557", "itemLabel": "Davey Boy Smith", "itemDescription": "British professional wrestler", "wikipedia_url": "https://en.wikipedia.org/wiki/Davey_Boy_Smith", "wikipedia_page": {"main": "David Smith (27 November 1962 – 18 May 2002) was an English professional wrestler. Born in Golborne, Lancashire, Smith is best known for his appearances in the United States with the World Wrestling Federation under the ring names Davey Boy Smith and The British Bulldog. He was trained by Ted Betley in Winwick, England before relocating to Calgary, Alberta, Canada to further his training under Stu Hart. While training with Hart, Smith met Stu and Helen Hart's youngest daughter Diana, whom he married on 7 October 1984. Their son Harry is also an accomplished professional wrestler who wrestled and won tag-team gold in WWE NJPW, Pro Wrestling NOAH,Smith won titles within the WWE in three decades, from the 1980s to the 2000s. He headlined multiple pay-per-view events for the WWF and WCW, which included matches for the WWF and WCW world heavyweight championships. Smith also defeated his real-life brother-in-law Bret Hart for the WWF Intercontinental Championship in the main event of SummerSlam 1992 at London's Wembley Stadium, in front of an alleged 80,355 fans. Hart considers this to be his best match.He was the inaugural WWF European Champion and holds the records for longest single reign (206 days) and total days as champion (253); he also held the title on the sole occasion where a match for that championship headlined a pay-per-view event, at One Night Only in 1997. Prior to finding singles success, Smith achieved stardom as one half of The British Bulldogs tag team, alongside his cousin Dynamite Kid. Smith was inducted into the 2020 WWE Hall of Fame.", "link_mentions": [{"page": "André the Giant", "response": ["His on-air return finally took place at the WWF's Super-Stars & Stripes Forever USA Network special on 17 March 1991, when he came out to shake the hand of The Big Boss Man after an altercation with Mr. Perfect. The following week at WrestleMania VII, he came to the aid of the Boss Man in his match against Mr. Perfect. Roussimoff finally returned to action on 26 April 1991, in a six-man tag-team matchup when he teamed with The Rockers in a winning effort against Mr. Fuji and The Orient Express at a house show in Belfast, Northern Ireland. On 11 May he participated in a 17-man battle-royal at a house show in Detroit, which was won by Kerry Von Erich. This was Andre's final WWF match, although he was involved in several subsequent storylines. His last major WWF storyline following WrestleMania VII had the major heel managers (Bobby Heenan, Sensational Sherri, Slick, and Mr. Fuji) trying to recruit Roussimoff one-by-one, only to be turned down in various humiliating ways (e.g. Heenan had his hand crushed, Sherri received a spanking, Slick got locked in the trunk of the car he was offering to Roussimoff and Mr. Fuji got a pie in his face). Finally, Jimmy Hart appeared live on WWF Superstars to announce that he had successfully signed Roussimoff to tag-team with Earthquake. However, when asked to confirm this by Gene Okerlund, Roussimoff denied the claims. This led to Earthquake's attacking Roussimoff from behind (injuring his knee). Jimmy Hart would later get revenge for the humiliation by secretly signing Tugboat and forming the Natural Disasters. This led to Roussimoff's final major WWF appearance at SummerSlam '91, where he seconded the Bushwhackers in their match against the Disasters. Roussimoff was on crutches at ringside, and after the Disasters won the match, they set out to attack him, but the Legion of Doom made their way to ringside and got in between them and the Giant, who was preparing to defend himself with one of his crutches. The Disasters left the ringside area as they were outnumbered by the Legion of Doom, the Bushwhackers and Roussimoff, who struck both Earthquake and Typhoon (the former Tugboat) with the crutch as they left. His final WWF appearance came at a house show in Paris, France, on 9 October. He was in Davey Boy Smith's corner as the Bulldog faced Earthquake. Davey Boy hit Earthquake with Roussimoff's crutch, allowing Smith to win."]}, {"page": "November 27", "response": ["*  1962   – Davey Boy Smith, English-Canadian wrestler (d. 2002)"]}, {"page": "The A-Team", "response": ["The show featured professional wrestlers such as Hulk Hogan, Professor Toru Tanaka, Ricky \"The Dragon\" Steamboat, The Dynamite Kid, Bobby \"The Brain\" Heenan, Davey Boy Smith (The British Bulldog), Big John Studd and Greg \"The Hammer\" Valentine, in most cases playing themselves. In the episode \"Body Slam\" (which featured Hogan) wrestling interviewer and announcer \"Mean\" Gene Okerlund also appeared."]}, {"page": "1962", "response": ["** Davey Boy Smith, British professional wrestler (d. 2002)"]}, {"page": "2002", "response": ["* May 18 – Davey Boy Smith, British professional wrestler (b. 1962)"]}, {"page": "Lancashire", "response": ["Lancashire has a long history of wrestling, developing its own style called Lancashire wrestling, with many clubs that over the years have produced many renowned wrestlers. Some of these have crossed over into the mainstream world of professional wrestling, including Shak Khan, Billy Riley, Davey Boy Smith, William Regal, Wade Barrett and the Dynamite Kid."]}, {"page": "List of Canadian sports personalities", "response": ["*** Diana Hart (born 1963), involved in 1990s WWE storylines, author of several wrestling books, and one-time wife of British wrestler Davey Boy Smith (1962–2002)", "**** David Hart Smith (Harry Smith) (born 1985), son of Diana Hart and Davey Boy Smith"]}, {"page": "Wembley Stadium (1923)", "response": ["In 1992, the World Wrestling Federation (now known as WWE) drew a sellout of 80,355 when SummerSlam was hosted at Wembley Stadium. In the main event English wrestler Davey Boy Smith won the Intercontinental Championship from Bret Hart. As of April 2016, the WWE considers this to be their fourth largest live gate in history behind only WrestleMania 32 (2016) which drew a reported 101,763, WrestleMania III (1987) which drew a reported 93,173 and WrestleMania 29 (2013) which drew 80,676 fans."]}, {"page": "Lex Luger", "response": ["In the beginning of 1995, Luger formed a tag team with Davey Boy Smith, dubbed The Allied Powers. They made their pay-per-view debut as a tag team at WrestleMania XI, defeating the Blu Brothers. They defeated jobbers on Raw and, after a victory over Men on a Mission (King Mabel and Sir Mo) in June 1995, earned a shot at the WWF Tag Team Championship against Owen Hart and Yokozuna at In Your House 2: The Lumberjacks but failed to win the titles. Shortly after SummerSlam, Luger, whose contract had expired, left the WWF without letting McMahon know beforehand."]}, {"page": "Bret Hart", "response": ["The Hart Foundation won their first of two WWF Tag Team Championship on the February 7, 1987 episode of Superstars of Wrestling when they defeated The British Bulldogs. They then teamed with Danny Davis to face The British Bulldogs and Tito Santana at WrestleMania III. They won the match when Davis pinned Davey Boy Smith after hitting him with Jimmy Hart's megaphone.", "In January 1992, Hart was placed in a feud with The Mountie. This feud came about when the Mountie's manager, Jimmy Hart, threw water on Hart, and The Mountie proceeded to shock Hart with a cattle prod. On January 17, 1992, Hart dropped the Intercontinental Championship to The Mountie. Following the loss, Roddy Piper defeated Mountie with a sleeper hold two days later at the 1992 Royal Rumble, and Bret later pinned Piper for his second Intercontinental Championship at WrestleMania VIII later that year, making him the first wrestler in the WWF - and one of few wrestlers ever - to pin Piper's shoulders to the mat. At a Wrestling Challenge taping on July 21, 1992, Hart defeated Shawn Michaels, with the Intercontinental Championship belt suspended above the ring, in the WWF's first ever ladder match. Hart dropped the Intercontinental Championship to his brother-in-law, Davey Boy Smith, in Hart's first WWF pay-per-view main event at SummerSlam in August 1992, held before over 80,000 fans at Wembley Stadium. Pro Wrestling Illustrated readers voted it the \"Match of the Year\", and WWE named the match as the greatest in the history of SummerSlam. Upon induction into the WWE Hall of Fame class of 2006, Hart cited the contest as his favourite match of his career.Bret Hart's induction speech. WWE Hall of Fame. 2006. \"That was my favourite match that I ever had, and I'm happy to tell you that\".", "Hart eventually lost his WWF Championship at Survivor Series in a submission match against Bob Backlund where the manager of either competitor (Davey Boy Smith for Hart, Owen for Backlund) would have to \"throw in the towel\" for the wrestler they were representing. When Hart was in Backlund's crossface chickenwing and Davey Boy was kayfabe knocked out, Owen persuaded his mother Helen to throw in the towel for Hart, giving Backlund the championship victory. Bret's feud with Backlund would continue into the following year. He was voted the greatest wrestler of 1994 by Pro Wrestling Illustrated readers, winning the vote for the second straight year.", "In a rematch from their SummerSlam 1992 encounter, Hart successfully defended his title against the now heel Davey Boy Smith at In Your House 5: Seasons Beatings. He lost to The Undertaker by disqualification at the 1996 Royal Rumble when Diesel interfered, ultimately retaining the WWF Championship, and defeated The Undertaker by disqualification in a rematch on the February 5 episode of Raw, again due to Diesel's interference.Raw results: February 5, 1996.. Online World of Wrestling. Retrieved February 9, 2011. Hart retained his title once again against Diesel in a steel cage match at In Your House 6, and defeated Hunter Hearst Helmsley, who was undefeated on Raw, on the March 4 episode of the show.Raw results: March 4, 1996. . Online World of Wrestling. Retrieved February 9, 2011. WWF Commissioner Rowdy Roddy Piper ruled that Hart would face Shawn Michaels, who had earned a WWF Championship match at WrestleMania XII by winning the Royal Rumble, in a 60-minute Iron Man match at the event. The wrestler with the most decisions during the 60 minutes would win the match and the WWF Championship.", "That fall, Hart would indeed receive competing offers of employment from both WWF and World Championship Wrestling (WCW). WCW presented a 3-year, $9M contract offer to Hart, while the World Wrestling Federation responded with an unprecedented 20-year contract. Finishing up his original WWF deal, Hart returned to action on a tour of South Africa on September 8, 1996, defeating Davey Boy Smith in Durban. On October 21, Hart elected to re-sign with the World Wrestling Federation.Hitman Hart: Wrestling With Shadows (1998) He was inducted into the Wrestling Observer Newsletter Hall of Fame Class of 1996.", "In the ensuing weeks, Hart denounced American fans, because of their negative reaction to him in the recent weeks in contrast to his continued popularity through the rest of the world, and reunited with brother Owen and brothers-in-law Davey Boy Smith and Jim Neidhart. The family members formed a new Hart Foundation with Brian Pillman; this incarnation was an anti-American stable which was popular within Canada and Europe. As the leader of this stable, Hart routinely carried a Canadian flag to the ring and engaged in promos where he declared the superiority of his home nation; he became so despised by U.S. audiences that they would often throw debris during his ring entrances, interviews, and matches. He was voted by Pro Wrestling Illustrated readers as the \"Most Hated Wrestler of the Year\" in 1997. At In Your House 16: Canadian Stampede, in Hart's home town of Calgary, the Hart Foundation defeated the team of Stone Cold Steve Austin, Ken Shamrock, Goldust, and The Legion of Doom, representing the United States, in a ten-man tag team match main event. The Canada vs. U.S. rivalry escalated on the July 21 episode of Raw Is War in Halifax, Nova Scotia, where Bret, Owen, and Davey Boy Smith, representing Canada and the Hart Foundation, defeated the team of Dude Love, Austin, and The Undertaker, representing the U.S., in a Flag match.Raw results, 1997. Online World of Wrestling. Retrieved February 9, 2011. The Hart Foundation's feud with Austin was named \"Feud of the Year\" by Wrestling Observer Newsletter and voted \"Feud of the Year\" by readers of Pro Wrestling Illustrated. Hart vowed that if he could not defeat The Undertaker for the WWF Championship at SummerSlam, he would never wrestle in the United States again. The Undertaker agreed to the match, and Hart won his fifth and last WWF Championship after spitting in guest referee Shawn Michaels' face; Michaels swung a steel chair in retaliation, which accidentally struck the Undertaker. Michaels, who, as part of another pre-match stipulation, would be banned from wrestling in the United States if he did not remain impartial as referee, had no option but to count the pinfall, giving his rival Hart the victory.", "After SummerSlam, Michaels was pushed as the top heel in the company and negative fan reactions towards Hart in the United States softened somewhat, as he declared, \"I'm not so much anti-American as I am just very, very pro-Canadian\". In real life, Hart did not like the new Attitude Era, instead preferring traditional values. This was used as part of his character, as Hart would insult the U.S. fans because of the success of the Attitude Era. Hart successfully defended his title against The Patriot, with whom Hart had become involved in a feud as part of the Canada vs. U.S. storyline, at Ground Zero: In Your House, avenging a loss to him on the July 28 Raw. The Canada vs. U.S. feud would conclude at Badd Blood: In Your House, where Hart and Davey Boy Smith, representing Canada and The Hart Foundation, defeated The Patriot and Vader, representing the U.S., in a Flag match.WWF Badd Blood Results. prowrestlinghistory.com. Retrieved February 9, 2011. Erstwhile, in a rematch from SummerSlam, The Undertaker challenged Hart for the WWF Championship at One Night Only; after reversing a Tombstone Piledriver attempt from Hart, The Undertaker dumped Hart on the apron when he would not let go of the ropes. As a result, Hart's neck was caught in the ropes, and The Undertaker was disqualified. Hart later cited this as his favourite of all his matches with The Undertaker, and his last great match in the WWF.", "Along with Storm, Roman Reigns and Sami Zayn point to Hart as their top wrestling inspiration; Seth Rollins and Jinder Mahal called him an idol, and Jon Moxley cited him as an influence. Edge listed his three idols within the business as \"Bret, Shawn and Hulk\". Chris Jericho named Bret as his hero (along with Owen Hart), and said he aspired to be \"half of\" what Bret was. Chris Benoit remarked: \"I always emulated him... I spent so many years looking up to, idolizing [Hart]; he was somewhat of a role model to me\". Benoit added that his matches against Hart were \"up on a pedestal\". Koji Nakagawa modelled his character and entire career on Bret Hart by adopting Hart's pink and black attire, an entrance theme identical to Hart's theme song, while also adopting his moveset. Ryback recalled a WWF event from his childhood, saying: \"I remember it was Bret Hart against Diesel inside a steel cage in the main event, and I just knew I wanted to be a WWE wrestler... Bret [Hart], I love\". Drew McIntyre named Hart his favourite wrestler, while Wade Barrett named Hart along with The British Bulldog, The Ultimate Warrior and The Undertaker; he called Hart vs. Bulldog, at SummerSlam 1992, his all-time favorite match.Wade Barrett interview. 103.1 The Buzz. March 2011. \"Number one will always be the \"British Bulldog\" Davey Boy Smith. He was my biggest inspiration...That's [Smith vs. Hart at SummerSlam 1992] actually my favourite match that I've ever seen in my life.\" Scott Dawson said that Hart's work at King of the Ring in 1993 made him want to become a professional wrestler.https://twitter.com/ScottDawsonWWE/status/1139355628504276993  Upon joining All Elite Wrestling for his hotly anticipated return to professional wrestling after seven years, CM Punk wore a Bret Hart T-shirt in one of his first televised appearances, and his first match, against Darby Allin, included several sequences that mirrored a 1994 Hart match against Sean Waltman.", "His seven brothers were either wrestlers or involved backstage with the wrestling business; his four sisters all married professional wrestlers. Two of his brothers-in-law, Davey Boy Smith, and Jim Neidhart had successful careers in the business. His youngest brother Owen Hart had become a decorated wrestler in his own right before his death in 1999, caused in an accident at the WWF pay-per-view Over the Edge. Hart's niece Natalya is a professional wrestler."]}, {"page": "Triple H", "response": ["At WrestleMania XV, Triple H lost to Kane after Chyna interfered on his behalf and she was thought to have rejoined D-X. Later on in the night, he betrayed his long-time friend and fellow D-X member X-Pac by helping Shane McMahon retain the European Championship and joined The Corporation. turning heel in the process. In April, he started to move away from his D-X look, taping his fists for matches, sporting new and shorter wrestling trunks and adopting a shorter hairstyle. His gimmick changed as he fought to earn a WWF Championship opportunity. After failed attempts at winning the championship, Triple H and Mankind challenged then WWF Champion Stone Cold Steve Austin to a triple threat match at SummerSlam, which featured Jesse \"The Body\" Ventura as the special guest referee. Mankind won the match by pinning Austin.Pro Wrestling Illustrated presents: 2007 Wrestling almanac & book of facts. \"Wrestling’s historical cards\" (p.104) The following night on Raw Is War, Triple H defeated Mankind to win his first WWF Championship. He dropped the WWF Championship to Mr. McMahon on the September 16, 1999 episode of SmackDown! before regaining it at Unforgiven in a Six-Pack Challenge that included Davey Boy Smith, Big Show, Kane, The Rock and Mankind. He defeated Stone Cold Steve Austin at No Mercy before dropping the title to Big Show at Survivor Series. Triple H then continued his feud with Mr. McMahon by marrying his daughter Stephanie McMahon and defeating McMahon at Armageddon. As a result of the feud, an angle with Triple H and Stephanie began which carried the WWF throughout the next seventeen months; together they were known as The McMahon-Helmsley Faction.Baer, Randy and R. D. Reynolds. Wrestlecrap: The Very Worst of Pro Wrestling (p.257)"]}, {"page": "Lance Storm", "response": ["On January 18, 2013, Storm worked for the Hart Legacy promotion in Calgary, taking part in a six-man tag team match, where Storm and the Killer Elite Squad (Davey Boy Smith, Jr. and Lance Archer) defeated Bobby Lashley, Chris Masters and Johnny Devine. On June 22, Storm worked for the House of Hardcore promotion, losing to its founder Tommy Dreamer in a main event singles match. On November 9, 2013, Storm and Sean Waltman were defeated by Dreamer and Terry Funk at House of Hardcore 3. On June 14, 2014, Storm faced Mike Bennett in a losing effort at House of Hardcore 6."]}, {"page": "List of former Extreme Championship Wrestling personnel", "response": ["|Davey Boy Smith"]}, {"page": "The Kliq", "response": ["Michaels claims that the name \"The Kliq\" was originally coined by Lex Luger, due to the closeness of the five friends backstage. Although, Lex Luger had suggested that Davey Boy Smith created the name, because the five kept \"clicking\", referring to how often they talked. At the suggestion of Vince Russo, Michaels began referring to his fans as his \"Kliq\". Michaels wrote in his 2006 autobiography that he disliked the idea, and that it \"was not a huge hit\" with the fans."]}]}}