{"wiki_id": "http://www.wikidata.org/entity/Q452142", "itemLabel": "Stephen Maguire", "itemDescription": "Scottish snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Maguire", "wikipedia_page": {"main": "Stephen Maguire (born 13 March 1981) is a Scottish professional snooker player. He has won six major ranking tournaments, including the 2004 UK Championship, and has twice since reached the finals of that event. Maguire turned professional in 1998 after winning the IBSF World Snooker Championship. He was in the top 16 of the snooker world rankings for 11 consecutive years, from 2005 to 2016, twice reaching world no. 2. He is a prolific break-builder, having compiled more than 450 century breaks, including three maximums.", "link_mentions": [{"page": "Snooker", "response": ["With some events having been criticised for matches taking too long, an alternative series of timed tournaments has been organised by Matchroom Sport chairman Barry Hearn. The shot-timed Premier League Snooker was established, with seven players invited to compete at regular United Kingdom venues, televised on Sky Sports. Players had twenty-five seconds to take each shot, with five time-outs per player per match. Although some success was achieved with this format, it generally did not receive the same amount of press attention or status as the regular ranking tournaments. This event has been taken out of the tour since 2013, when the Champion of Champions was established. The event saw players qualify by virtue of winning other events in the season, with 16 champions competing. Reflecting the game's aristocratic origins, the majority of tournaments on the professional circuit require players to wear waistcoats and bow ties. The necessity for this rule has been questioned, and players such as Stephen Maguire have been granted medical exemptions from wearing a bow tie."]}, {"page": "Jimmy White", "response": ["In the 2003–04 season White produced his most consistent season in over a decade. After reaching the semi-finals of the 2003 UK Championship in November 2003, White defeated Neil Robertson, Stephen Hendry and Peter Ebdon to reach the semi-finals of the 2004 Masters – where he lost a tight match against Ronnie O'Sullivan. White followed this up with further victories over Hendry and Robertson en route to the final of the European Open in Malta, but was beaten 3–9 by world number 48 Stephen Maguire. His last ranking victory to date came in April 2004, when White defeated Shaun Murphy, John Parrott, Ian McCulloch, Peter Ebdon and Paul Hunter to win the Players Championship in Glasgow – his first ranking title in over 11 years. Victory in the 2004 World Championship could have given White the number-one ranking, but he was beaten 10–8 by qualifier Barry Pinches after leading 4–2.", "White started the season with a 2–5 loss to Fraser Patrick in the qualifying round of the Wuxi Classic, and a 4–5 second-round loss to Scott Donaldson in the Australian Goldfields Open. He then reached the last 64 of the next two European Tour Events, losing to Stuart Bingham and Stephen Maguire respectively."]}, {"page": "World Snooker Championship", "response": ["John Higgins won his third world title in 2009, beating Shaun Murphy 18–9 in the final. Michaela Tabb refereed the final, becoming the first woman to do so in a World Championship final. There were a record eighty-three century breaks in the Championship, well ahead of the previous highest of sixty-eight. Stephen Hendry won his 1000th  at the Crucible Theatre, the first player to do so. The championship included the second longest ever frame at the Crucible which lasted seventy-four minutes fifty-eight seconds between Stephen Maguire and Mark King.", "Ronnie O'Sullivan won his fourth world title in 2012, defeating Ali Carter 18–11 in the final. On the opening day Hendry made his third maximum break at the Crucible, equalling Ronnie O'Sullivan's record. He announced his retirement from professional snooker following his loss to Stephen Maguire in the quarter-finals. Aged , Luca Brecel became the youngest player to compete at the Crucible."]}, {"page": "Pankaj Advani (billiards player)", "response": ["Advani received an entry in to the wildcard round of the Indian Open and he beat Fang Xiongman 4–2 and Elliot Slessor 4–0, before losing 4–3 to Stephen Maguire in the third round. He won all of his group matches at the Six-red World Championship and then eliminated Lukas Kleckers 6–0 and Yuan Sijun 6–4. Michael Holt withdrew from the event which moved Advani straight in to the semi-finals, where he was defeated 7–4 by Ding Junhui."]}, {"page": "Steve Davis", "response": ["Davis reached his 100th major career final at the 2005 UK Championship in York, his first appearance in the event's final since 1990. He beat defending champion Stephen Maguire and Hendry before he lost 6–10 to Ding Junhui in the final. Davis brushed off suggestions of retirement before the World Championships, and reached the second round where he lost to Murphy. His performances during the 2006–07 season, including reaching the 2006 UK Championship quarter-finals and the Welsh Open semi-finals, ensured that Davis was still a top-16 player at age 50. Although Davis dropped out of the top sixteen a year later, he reached successive quarter-finals at the Shanghai Masters and Grand Prix in 2008. At the 2009 World Snooker Championship, Davis lost 2–10 to Neil Robertson in the first round. At the 2009 UK Championship, he defeated Michael Judge 9–7 to set up a first-round match against Hendry which he lost 6–9."]}, {"page": "Ken Doherty", "response": ["A 6–0 thrashing at the hands of Peter Ebdon ended Doherty's International Championship at the first round stage and he lost 6–3 to Mark Davis in the second round of the 2015 UK Championship, having whitewashed Tony Drago 6–0 in the opener. His best runs of the season were a pair of last 32 exits at the German Masters and Welsh Open, 5–1 to Stephen Maguire and 4–2 to Joe Perry respectively. His end of season ranking of 57 was the lowest of his 26-year professional career. He had two last 16 showings during the 2016–17 season and would have dropped off the tour at the end of the season as he was outside of the top 64 in the world rankings. However, the day before the 2017 World Championship started it was announced that Doherty would receive an invitational tour card for the next two years."]}, {"page": "Ding Junhui", "response": ["Ding was defeated in the first round of the next two consecutive tournaments, losing 5–2 to Stephen Maguire in the 2007 Malta Cup and 5–1 to Jamie Cope in the Welsh Open. In March 2007, Ding qualified for the televised stages of the World Championship for the first time after beating Mark Davis in the final qualifying round. His losing streak in ranking tournaments continued, with a 5–3 loss to Barry Hawkins in the first round of the China Open and a 10–2 loss against O'Sullivan at the World Championship. Despite this, Ding ended the 2006–07 season ranked world number 11.", "Ding began the 2009/2010 season by reaching the quarter-finals of the Shanghai Masters. He reached the final of the Grand Prix by defeating Matthew Stevens 5–4 in the first round, Stephen Maguire 5–1 in the second round, Peter Ebdon 5–2 in the quarter-finals, and Mark Williams 6–1 in the semi-finals, losing to Neil Robertson 9–4 in the final. At the 2009 UK Championship, Ding reached the final after defeating Mike Dunn 9–5, Shaun Murphy 9–3, Ali Carter 9–8, and Stephen Maguire 9–5. He went on to defeat John Higgins 10–8 in the final to win his second UK title.", "In the 2019–20 season, Ding and compatriot Yan Bingtao participated in the World Cup. They beat Andy Lee and Cheung Ka Wai 4–0 in the quarter-finals, before losing 4–1 in the semi-finals to eventual winners John Higgins and Stephen Maguire. Ding reached the quarter-finals of the 2019 International Championship. At the 2019 Six-red World Championship, he reached the quarter-finals, losing to Gary Wilson after a 5–4 lead.", "At the 2019 UK Championship, Ding beat Ronnie O'Sullivan 6–4 in the last 16. He defeated Liang Wenbo in the quarter-finals and Yan Bingtao in the semi-finals, both by 6–2. In the final, Ding beat Stephen Maguire 10–6, clinching his third UK title and his first since 2009. His win made him the fifth player to win the UK title three or more times, and it was his first ranking event win since 2017. Throughout the competition, Ding compiled ten century breaks, including four during the final. Following the event, his ranking increased seven spots to ninth. Due to the COVID-19 outbreak, Ding did not participate at another event until the 2020 World Snooker Championship. At the World Championship Ding led Mark King in the 9–7 in their first round match before King won two 50-minute frames to level the match at 9–9 and send it into a decider. Ding won the deciding frame to progress 10–9 where he would face O'Sullivan in round two. After two very tight sessions, the players were tied at 4–4 and then 8–8 going into the third and final session. O'Sullivan proved too strong in the third session and Ding eventually lost the match 10–13."]}, {"page": "Mark Williams (snooker player)", "response": ["In the 2007 UK Championship, he showed a return to some form. He beat Ricky Walden comfortably 9–3 in the last 32, and in the last 16 he faced Mark Allen who led 4–0 and 5–1. However, a cool comeback saw him win the remaining eight frames to win 9–5. In the quarter-finals, Stephen Maguire was too strong and beat him 9–5.", "After a 2–6 first round loss to Ken Doherty in the Masters, Williams revealed he was considering retirement from the game if he dropped out of the top 32 and was forced to play in all the qualifying competitions, although then only 32 years old. But he also claimed at the Welsh Open at Newport that this statement had been blown out of proportion, and that he would remain a professional. He began to show more consistency for the remainder of the season, reaching the last 16 of three ranking events and a run to the quarter-finals of the China Open, but he could not reach his first semi-final for two years, losing 3–5 to Ryan Day. At the World Championship he defeated Mark Davis; however, a 7–13 defeat to Ronnie O'Sullivan in the second round forced him out of the top 16, pushing him into the qualifiers for 2008/2009. In that match he was on the receiving end of a 147 break from O'Sullivan. On 8 July 2008 it was announced that Williams had split from his management company 110 Sport, following O'Sullivan and Stephen Maguire.", "In the 2009 UK Championship he led Graeme Dott 6–2, before Dott retired due to illness and Williams thus won the match 9–2. After this he lost his next match against Peter Lines 8–9. At the Masters he won his wild card round match, beating Rory McLeod 6–2. Then he won his first round match against Ali Carter 6–3 to progress to the quarter-finals of the event, despite being involved in a traffic accident the day before his match against Carter. It was reported that a car drove into the back of the 4×4 that his sponsors had lent him, which was carrying Williams and Hendry to a restaurant. In the quarter-finals he defeated Shaun Murphy 6–4, but eventually lost a high-quality match in the semi-finals 5–6 against Ronnie O'Sullivan. In the Welsh Open, he reached the quarter-finals, beating Fergal O'Brien 5–2 and Andrew Higginson 5–0, before losing against Stephen Maguire 1–5.", "Williams opened the season by winning the first event of the Players Tour Championship by defeating Stephen Maguire 4–0 in the final, a new addition to the snooker calendar introduced by Barry Hearn, a series of events that Williams has supported. Williams finished 6th on the Players Tour Championship Order of Merit.", "Williams lost in the second round of his first two ranking events of the 2014–15 season. His first quarter-final of the campaign was at the International Championship and he trailed Ronnie O'Sullivan 0–3, before winning five successive frames with a high break of 120. The match went into a deciding frame, which Williams won to beat the five-time world champion for the first time in 12 years. His semi-final match against Mark Allen also went all the way, after Williams had been 4–7 down, and a miss on the final red proved crucial as he was defeated 8–9. He was beaten 2–6 by Stephen Maguire in the third round of the 2014 UK Championship."]}, {"page": "Stephen Hendry", "response": ["Hendry lost 3–6 against reigning World Champion Neil Robertson in the 2011 Masters. Hendry made his 10th 147 break at the 2011 Welsh Open in the opening frame of the last 16 round vs Stephen Maguire, but later lost the game. At the 2011 China Open Hendry whitewashed Matthew Stevens 5–0 in the first round, before losing to Ding Junhui 2–5 in the second round. At the 2011 World Championship, he beat Joe Perry in the deciding frame of their first round tie before going out in the second round, for the second consecutive year, to Mark Selby 4–13.", "Hendry qualified for the 2011 UK Championship after beating Gerard Greene 6–2 in the final qualifying round. It was his first qualifying match since 1989. However, he lost 3–6 to compatriot Stephen Maguire in the first round. He reached the semi-finals of the twelfth PTC event in January 2012, but narrowly lost 3–4, once again to Maguire. Hendry needed to reach the final in order to make the top 24 of the Order of Merit and secure a place in the Finals. Hendry lost 1–5 in a qualifying match against James Wattana for the German Masters and therefore did not play in a ranking tournament for the first time in 15 years.", "Hendry ensured he would feature in his 27th consecutive World Championship when he qualified by beating Yu again, this time by a 10–6 scoreline. He made a 147 on the opening day of the tournament in a match against Stuart Bingham. This was his third maximum break at the Crucible Theatre and his 11th in total, both records which he shared with Ronnie O'Sullivan (O'Sullivan is now on 15 maximums). He advanced to the second round with a 10–4 win over Bingham and then defeated an out of sorts defending champion John Higgins 13–4, his first victory over his compatriot in a ranking event since 2003, to set up a quarter-final meeting with Stephen Maguire. Hendry has reached 19 quarter-finals, with only eight players having played in the tournament that many times. Hendry lost 2–13 to Maguire and immediately announced his retirement from the game citing dissatisfaction with his standard of play in recent years and difficulty balancing competitive, commercial and personal commitments and revealed he had made the decision three months earlier. During his career he had made nearly 9 million pounds in prize money."]}, {"page": "John Higgins", "response": ["Higgins beat Michael Holt, Fergal O'Brien, Ronnie O'Sullivan, and Stephen Maguire en route to the final. His break of 122 in the 29th frame of his semi-final against Maguire, on recovering from a deficit of 10–14 in the final session to prevail 17–15, was the 1,000th century to be made at the Crucible Theatre, Sheffield since the World Championship was first staged there in 1977. In the final, Higgins held a 12–4 advantage over Mark Selby overnight, but Selby reduced his arrears to a single frame on day two. However, at 14–13, Higgins rediscovered his form to win four consecutive frames to clinch the match 18–13 to secure his second World title at 12:54 am, the latest finish to a World final (equalled when Neil Robertson beat Graeme Dott in 2010); and nine years after his first title – the longest time span between successes since Alex Higgins (1972, 1982), and the longest at The Crucible. He regained World no. 1 status.", "Higgins lost in the first round of the Masters 4–6 against Graeme Dott and withdrew from the German Masters after defeating Robert Milkins 5–3 in round one, to return home due to the deteriorating health of his father, who subsequently died after a long battle against cancer. A little over two weeks later, Higgins successfully defended his Welsh Open title by beating Stephen Maguire 9–6 in the final – dedicating victory to his late father. Higgins won the Hainan Classic, defeating Jamie Cope in the final. Higgins reached the quarter-final of the China Open, where he lost 2–5 against Shaun Murphy. Higgins' next tournament was the Scottish Professional Championship, where he defeated Anthony McGill 6–1 in the final.", "Playing with a new cue, Higgins began the 2013–14 season strongly, winning the minor-ranking Bulgarian Open with a 4–1 victory over Neil Robertson in the final, having beaten Shaun Murphy and Ronnie O'Sullivan earlier in the event. This win allowed him briefly to regain his top-10 ranking. He reached the final of the season's first major ranking event, the Wuxi Classic, which he lost 7–10 to Robertson. His form then deteriorated again and he suffered early defeats at a number of minor-ranking events, including a 0–4 loss to Mark King in the last 128 of the Paul Hunter Classic. He changed his cue again before defending his Shanghai Masters title, but lost 1–5 to Mark Davis in the last 16. His Kay Suzanne Memorial Cup title defence ended when he was whitewashed 0–4 by Andrew Higginson in the last 128. He lost 2–4 to Ding Junhui in the last 16 of the 2013 Indian Open, and lost 2–6 to Matthew Stevens in the last 32 of the 2013 International Championship. In the invitational Champion of Champions tournament, he lost 3–4 in the first round to Stephen Maguire.", "In the German Masters, Higgins lost 2–5 to Peter Ebdon in the first round, but he showed improved form and confidence at the Welsh Open, where he defeated Stephen Maguire 5–1 in the quarter-finals, Luca Brecel 6–4 in the semi-finals, and Ben Woollaston 9–3 in the final to claim a record fourth Welsh Open title and his first ranking title in two and a half years. Afterwards, he said that \"It's great to win and get a bit of confidence back.\" In the last 16 of the Indian Open, he suffered a sixth consecutive defeat by Mark Davis when he lost 0–4, scoring only 38 points in the match. He lost 3–4 to Graeme Dott in the last 32 of the World Grand Prix, and lost by the same scoreline to Stephen Maguire in the last 32 of the Players Championship Grand Final. In the China Open, he reached the quarter-finals, defeating Dott and Trump along the way, but lost 4–5 to Ding Junhui. At the World Championship, Higgins won his first match at the Crucible since 2012 with a 10–5 first round victory over Robert Milkins, but he lost 9–13 to Ding Junhui in the second round, despite winning 5 of the first 6 frames.", "| Stephen Maguire", "| Stephen Maguire"]}, {"page": "Stephen Lee (snooker player)", "response": ["Lee enjoyed further success on the PTC calendar as he reached another semi-final, to finish 14th on the Order of Merit and therefore qualified for the last 24 of the Finals. It was in the finals where Lee won his first ranking title for six years as he dropped just three frames during the tournament, including 4–0 whitewashes over Mark Selby and in the final versus Robertson, where Lee became the first player to beat the Australian in a ranking event final. Lee's form in the second half of the season continued into the China Open as he registered his third ranking event semi-final of the year by defeating Judd Trump again, but could not feature in three successive finals as he lost 2–6 to Stephen Maguire. His season did finish in disappointment though as he was beaten in the first round of the World Championship 6–10 by Andrew Higginson. Nevertheless, Lee climbed 10 places in the world rankings to end the season at number 8, the highest he has been since 2003."]}, {"page": "Peter Ebdon", "response": ["Ebdon put his indifferent form behind him at the China Open where he won the ninth ranking event title of his career. He whitewashed Liang Wenbo 5–0 to qualify and once in China beat Matthew Stevens 5–3 to set up a last 16 meeting with John Higgins. He came back from 1–3 down and, despite Higgins finding a snooker he needed in the final frame, he held his nerve to take the match 5–4 and reach his fourth successive China Open quarter-final. There he beat [mNeil Robertson 5–3 to play local favourite Ding Junhui in the semi-finals. Ebdon again came back from 1–3 down, this time winning five successive frames to take the match 6–3 and make it to his first ranking event final since winning the same tournament three years earlier. In the final he played Stephen Maguire and built a 5–1 lead in the first session, which was cut by three frames due to slow play. However, Maguire won seven of the next ten frames to level the match at 8 frames apiece. The final three frames were error strewn and slow, but with the clock approaching 01:00 am Beijing time, Ebdon clinched the frame he required to win the eight-hour match 10–9. The result saw him rise seven places in the rankings to number 21 and during the final he recorded the 300th century break of his career. He made six century breaks during the tournament, the most of any player – four of which were in the final.", "Ebdon began the season by qualifying for the Wuxi Classic and lost 4–5 to an in-form Stuart Bingham in the first round. He then played in the Australian Goldfields Open, beating Michael Holt, Ding Junhui and Shaun Murphy all by 5–4 scorelines. The match against Ding caused a degree of controversy as Ebdon had taken an average of 32 seconds a shot in a nine frame encounter lasting almost 5 hours. In the semi-finals he defeated Marco Fu 6–2, despite his opponent having over a 90% pot success, 80% long pot success and 80% in his safety game success. He faced Barry Hawkins in the final and succumbed to a 3–9 defeat, admitting afterwards that he had struggled in every department of his game. Ebdon lost in the first round of the Shanghai Masters, but continued his good start to the season at the inaugural International Championship. He received a bye through the first round as Stephen Lee had been suspended due to match-fixing allegations, and only conceded one frame in beating Stephen Maguire and Ricky Walden to advance to the semi-finals. There he was thrashed 1–9 by Judd Trump.", "The 2014–15 season was the first time since 1992–93 that Ebdon failed to play in a ranking event quarter-final, with three last 16 finishes being his deepest runs. He did have his best year so far in the minor-ranking European Tour as a quarter-final appearance at the Riga Open and a semi-final at the Bulgarian Open saw him ranked 13th on the Order of Merit, to make his debut at the Grand Final where he lost 1–4 to Anthony McGill in the first round. At the non-ranking World Grand Prix, Ebdon made a 136 total clearance in the deciding frame of his first round match against Shaun Murphy and then defeated Stephen Maguire 4–1. In the quarter-finals Ebdon was ousted 2–4 by Martin Gould. He missed out on playing in the World Championship for the second year in a row as Stuart Carrington beat him 10–7 in the second qualifying round.", "|  Stephen Maguire"]}, {"page": "Matthew Stevens", "response": ["Stevens withdrew from the season's opening ranking event, the Wuxi Classic due to a bad back and could not advance beyond the second round in any of the next three events. At the 2012 UK Championship he beat Dominic Dale 6–1 and Marco Fu 6–4 to reach the quarter-finals for the first time since lifting the trophy in 2003. In a scrappy game versus Mark Davis, Stevens was beaten 4–6. Stevens missed a simple brown at 4–1 up against Mark Williams in the first round of the Masters and then made a series of errors during the rest of the match to lose 4–6. His second quarter-final of the season came at the German Masters, where he was defeated 3–5 by Marco Fu, before losing 2–4 to Stephen Maguire in the second round of the Welsh Open."]}, {"page": "Alan McManus", "response": ["He made a good start to the 2012–13 season, beating Tony Drago and Robert Milkins to qualify for the final stages of the Australian Goldfields Open in Bendigo; there he beat local wildcard James Mifsud 5–0, before exiting the tournament by the same scoreline against Ding Junhui. At the 2013 Welsh Open, McManus reached his first quarter-final since the 2006 Grand Prix, with a 4–2 win over the number 16 seed Barry Hawkins, followed by a dramatic comeback to beat Joe Perry 4–3, after having trailed 0–3. He was beaten in the quarter-final 3–5 by compatriot Stephen Maguire. The following tournament, the Haikou World Open, saw McManus win three matches in qualifying to reach the latter stages of the tournament; he then beat local wildcard Lin Shuai 5–3, before facing compatriot John Higgins. McManus put in a good performance; he ultimately lost 3–5, but picked up valuable ranking points in the process.", "He made a good start to the Players Tour Championship, reaching the quarter-finals of the first event, losing to Andrew Higginson by 4 frames to 3. He carried this good form to the PTC event 2, once again reaching the quarter-finals before losing 1–4 to eventual runner-up Stephen Maguire. However, McManus only managed four last-32 results from the rest of the events. This led to him being ranked 31st in the Order of Merit, just missing out on the top 28 players that qualified for the finals. At the 2013 World Snooker Championship McManus, in qualifying, beat one of India's rising stars Aditya Mehta 10–9, in an epic encounter that lasted just over 9 hours. He then defeated 1995 World finalist Nigel Bond 10–8 in the penultimate qualifying round. In the final qualifying round he led Tom Ford 5–4 after the first session; he then reeled off five of the next six frames to book his place at the Crucible Theatre for the first time since 2006. In the first round he lost to Ding Junhui 5–10, winning £12,000.", "McManus continued his good form into the 2014–15 season by reaching the last 16 of the first ranking event of the season, the 2014 Wuxi Classic, where he was beaten 2–5 by Barry Hawkins. He then reached the last 16 of the Australian Goldfields Open, before losing 3–5 to Judd Trump. McManus reached the quarter-finals of the Shanghai Masters by beating Jamie Jones to qualify, before defeating Ronnie O'Sullivan 5–3 and Stephen Maguire 5–1 but then lost to the eventual winner of the tournament Stuart Bingham 1–5. McManus was able to keep up his 100% record in qualifying matches for the season by comfortably defeating Michael Georgiou to qualify for the International Championship, but was edged out by Anthony McGill in the last 64 of the tournament.", "McManus started strongly in the 2015–16 season, reaching the quarter-finals of the first event, the Riga Open, with wins over Stephen Maguire, Judd Trump and others before losing to the eventual champion Barry Hawkins 2–4. As McManus did not enter the Australian Goldfields Open, his first ranking event of the season came at the Shanghai Masters. He defeated Rory McLeod 5–4 to qualify for the tournament, and then defeated wildcard Yao Pengcheng 5–2, before losing 1–5 to Ding Junhui.", "McManus qualified for the 2016 World Championship with comfortable victories over Michael Wasley, David Morris and Jimmy Robertson. In the first round at the Crucible he defeated his fellow-countryman Stephen Maguire 10–7, before overcoming Ali Carter 13–11 in round two. His quarter-final saw him come from 9–11 down against John Higgins to take the final four frames and win 13–11, setting up his first semi-final appearance at the World Championship since 1993. In that semi-final he lost to Ding Junhui 11–17. His end-of-season ranking of 20 was the highest he had been in a decade."]}, {"page": "Joe Perry (snooker player)", "response": ["Perry's breakthrough came when he reached the final of the European Open in 2001. He first reached the quarter-finals of the World Championship in 2004, beating then defending champion Mark Williams 13–11 along the way, also making the tournament's highest break of 145 (which remains Perry's best in competition), before losing to Matthew Stevens. He repeated this run in 2008 when he defeated Graeme Dott and Stuart Bingham, and bettered it by going on to beat Stephen Maguire 13–12 and earn his place in the semi-finals, which he narrowly lost to Ali Carter. Previously, he had also reached the last 16 on his Crucible debut in 1999, beating Steve Davis on the final black in the last 32.", "Perry was a losing finalist in Event 1 (Ronnie O'Sullivan won 4–0) and Event 12 (Stephen Maguire won 4–2) during the minor-ranking 2011/2012 Players Tour Championship series. These results helped him qualify for the Finals as he finished 11th on the Order of Merit. It was at the Finals where Perry had his best run in a ranking event during the 2011–12 season as he beat Fergal O'Brien and Graeme Dott, before being defeated by Neil Robertson 1–4 in the quarter-finals. In the other ranking events during the year he reached the second round three times, culminating in a 7–13 defeat to Maguire in the World Championship. Perry finished the season ranked world number 24. He began the 2012–13 season by reaching the second round of the Wuxi Classic thanks to the withdrawal of Matthew Stevens and lost 4–5 to Ricky Walden. He was beaten 1–5 by Marco Fu in the first round of the Australian Goldfields Open, before recording his best result of the year at the Shanghai Masters. He beat Barry Pinches in qualifying, Stevens 5–2 in the first round and then whitewashed Neil Robertson 5–0 to make the quarter-finals. There was never a frame between Perry and Mark Williams in their quarter-final, with Perry making a 131 break to force a deciding frame which he lost. He won two more matches in ranking events during the rest of the season, the first being a 4–0 triumph over world number one Mark Selby in the first round of the Welsh Open."]}, {"page": "Graeme Dott", "response": ["At the 2010 World Championship, Dott produced an unlikely run to his third World final in six years. He had not had much success in the 2009–10 season going into the World Championship, with only one ranking last 16 finish in the 2010 Welsh Open. However, a newly inspired Dott convincingly knocked out Peter Ebdon in the first round 10–5. He then thrashed fellow Scot Stephen Maguire 13–6 in the second round, and for the first time since winning the title in 2006, advanced to the quarter-finals where he recovered from 10 to 12 behind to see off Mark Allen 13–12. In his 17–14 defeat of Mark Selby in the semi-final, he scored the second 146 clearance in the 83-year history of the World Championship (the first had been scored by Mark Allen just days earlier in his second round match). Dott was eventually defeated in the final 13–18 by Neil Robertson, who had never beaten Dott previously, an ironic twist after Dott had defeated previous champion Ebdon for the first time in winning his own title in 2006. Despite having to settle for runner-up spot, Dott's efforts were ultimately rewarded with a return to the top 16 for 2010/2011.", "At the 2013 Masters, Dott defeated Stephen Maguire 6–5 and Trump 6–1 to reach the semi-finals. Despite taking a 4–1 lead in his semi-final match, Dott lost 5–6 to eventual tournament winner Mark Selby.", "At the World Championship, Dott defeated Peter Ebdon 10–6 in a first-round match that lasted 7 hours 18 minutes, with an extra session added after the players failed to complete the match in the time allotted for the first two sessions. After the match, Dott criticised Ebdon's slow, deliberative style of play and called for a rule to limit the amount of time a player could spend over a shot. Dott became the only Scottish player to reach the second round, after John Higgins, Stephen Maguire, Marcus Campbell, and Alan McManus all suffered first-round defeats. Facing Shaun Murphy in his second-round match, he trailed 2–6 after the first session. During the second session, he complained about receiving static shocks when he touched the table, and the players took their mid-session interval a frame early while the carpet was sprayed with water to address the problem. Dott managed to level the match at 8–8 after the second session, but went on to lose 11–13. His defeat meant that, for the first time since 1988, no Scottish player competed in the World Championship quarter-finals.", "Dott advanced to the third round of the International Championship courtesy of wins over Jamie Burnett and Peter Ebdon, but he was defeated 1–6 by Neil Robertson. He lost in the second round of the 2015 UK Championship 5–6 to Jack Lisowski. At the German Masters, he knocked out Tian Pengfei 5–0, Barry Hawkins 5–3, and Stephen Maguire 5–1, to play in his first ranking event semi-final in over two years. He was well below his best against Martin Gould as he lost the first four frames of the match and was defeated 2–6. Dott was eliminated in the third round of both the Welsh Open and China Open, 2–4 to Marco Fu and 1–5 to Noppon Saengkham respectively. Three tight wins helped him qualify for the World Championship, but he lost 4–10 to Mark Williams in the opening round."]}, {"page": "David Gray (snooker player)", "response": ["On 28 November 2004 he reached his third – and to date, latest – ranking final in the UK Championship. He lost 10–1 to Stephen Maguire in the final. It was during this tournament that Gray scored his first maximum break – the 50th ever made in professional play – in the fifth frame of his last-32 match against Mark Selby (whom he had defeated in the 2003 Scottish Open final). His semi-final against Joe Perry was particularly memorable as Perry appeared to have won the match 9-7 by potting a colour leaving Gray requiring a snooker, but Perry himself was snookered on the next red, failed to hit it, and didn't score another point as Gray cleared the table then hit a 139 total clearance in the deciding frame."]}, {"page": "Pot Black", "response": ["A one-day Pot Black tournament, held on 29 October 2005, was broadcast on the BBC's Grandstand. The event featured eight players: Ronnie O'Sullivan, Stephen Hendry, Stephen Maguire, Matthew Stevens, Paul Hunter, John Higgins, Jimmy White and Shaun Murphy, with Stevens beating Murphy in the final. The 2006 edition of the tournament took place at the Royal Automobile Club in Central London on 2 September 2006. Mark Williams defeated John Higgins in the final, achieving the highest break in the history of the tournament with a 119 clearance. The 2007 edition, the final Pot Black to date, was aired on Saturday 6 October 2007, with Ken Doherty beating Shaun Murphy 71–36 in the final."]}, {"page": "Terry Griffiths", "response": ["Griffiths resigned as the WPBSA director of coaching in 1998, describing the Association as \"a hopeless set-up with no one giving the staff any direction at all.\" He has coached many top players, including Mark Williams, Marco Fu, Mark Allen, Ali Carter, Joe Perry, Barry Hawkins, Ding Junhui, Stephen Hendry and Stephen Maguire. He has said of his coaching that \"it used to be a lot of technical stuff years ago – probably 90% on the technical side. Now it's the other way about, perhaps 80–20% on the mental side.\" He was the Director of Coaching at the South West Snooker Academy. He also commentates on snooker for the BBC. In 2007, Griffiths was awarded an OBE for \"services to snooker\". In 2021, he launched \"SQ\", a handicapping system for snooker. His son Wayne Griffiths is the head snooker coach at the Hong Kong Sports Institute and has coached three-time women's world champion Ng On-yee. During his career he won over a million pounds in prize money."]}, {"page": "Marco Fu", "response": ["His best result the following season was a quarter-final loss to Ding Junhui at the China Open. He finished the season ranked 25, falling nine places.  A series of first round defeats during the  2005–06 season saw him provisionally drop out of the top 32. However, he had a good run at the 2006 World Championship, beating three seeded players—Alan McManus 10–3, Stephen Maguire 13–4, and Ken Doherty 13–10. He reached the semi-finals where he lost to the 2002 world champion Peter Ebdon 16–17. In that match, Fu was 9–15 down with only one session left to play, but won seven out of the next eight frames to send the match into the deciding frame, which Ebdon eventually won. This run enabled him to stay in the world top 32 for next season, ranked 22.", "In November 2010, Fu participated in the Asian Games, held in Guangzhou. He won the singles competition by defeating Ding Junhui 4–2 in the final. Fu also reached the semi-finals of the Premier League where he lost 2–5 against Shaun Murphy. He lost in the second round of the 2010 UK Championship 2–9 against Stuart Bingham. Fu participated at the Players Tour Championship, where his best results came at the first and second events in Sheffield, where he reached the semi-finals, losing 1–4 against Stephen Maguire and 2–4 against Mark Selby, respectively. He later finished 16th on the Players Tour Championship Order of Merit.", "Fu played in seven minor-ranking Players Tour Championship events and reached the final of the Third Event by defeating veteran players Stephen Maguire, Mark Williams, Ali Carter and Shaun Murphy. He lost to world number 65 Rod Lawler 2–4 in the final. He also reached the quarter-finals of the European Tour Event 3, which helped him finish 21st on the Order of Merit to qualify for the Finals. In the Finals Fu beat Mark Joyce and Carter, before losing 1–4 to Tom Ford in the quarter-finals. Fu won Group 7 of the Championship League courtesy of a 3–0 victory over Maguire and in the Winners Group lost in the semi-finals 0–3 to Carter. In the first round of the World Championship, Fu beat Matthew Stevens 10–7 to face Judd Trump in the last 16. He fell 2–6 behind after the first session, but fought back to trail only 7–8 before losing five consecutive frames to end his season with a 7–13 defeat. Fu finished just short of his early season goal to get back into the top 16 as he finished world number 17, but this did mean he had climbed 11 spots during the year.", "In the 2014–15 season, Fu reached seven quarter-finals. His first came in the opening ranking event, the Wuxi Classic, where he lost 5–4 to Barry Hawkins. He was knocked out in the first round of the Shanghai Masters. He saw off Liam Highfield, David Gilbert and Rod Lawler at the International Championship, before a ranking event quarter-final went the distance for the second time this season as Fu lost 6–5 to Robert Milkins. Ronnie O'Sullivan whitewashed him 6–0 in the last eight of the non-ranking Champion of Champions. Another quarter-final followed at the 2014 UK Championship after Fu came back from 5–3 down to eliminate Shaun Murphy 6–5, with both players criticising the condition of the table after the match. Stephen Maguire knocked him out 6–4."]}, {"page": "Nigel Bond", "response": ["in which he came from 5–7 to win 9–7 against Ken Doherty in the last 32 before losing 9–6 to Ding Junhui in the last 16, was a precursor to his first quarter-final run for 5 years, at the China Open. Victories over David Roe, Stephen Lee and Barry Pinches took him to a meeting with Stephen Maguire, which he lost 5–0."]}, {"page": "Snooker world rankings 2004/2005", "response": ["| Stephen Maguire"]}, {"page": "Snooker world rankings 2003/2004", "response": ["| Stephen Maguire"]}, {"page": "Snooker world rankings 2002/2003", "response": ["| Stephen Maguire"]}, {"page": "Snooker world rankings 2001/2002", "response": ["| Stephen Maguire"]}, {"page": "Snooker world rankings 2000/2001", "response": ["| Stephen Maguire"]}, {"page": "List of snooker players", "response": ["*Stephen Maguire"]}, {"page": "UK Championship", "response": ["In 1993, the format of the final was reduced from the best of 31 frames to the best of 19 frames. This is the format still used for the final to the current day. Ronnie O'Sullivan became the youngest-ever winner of the tournament (and any ranking tournament) aged just 17 years old . Eight years later, in 2001, he delivered the final's best winning margin since it had become the best of 19 frames in the 1993 tournament, beating Ken Doherty 10–1. Three years later, in 2004, Stephen Maguire repeated the feat against David Gray. Doherty almost won the tournament in the 2002 final against Mark Williams, but lost 9–10 in a dramatic deciding frame.", "In 2007, the tournament was won by Ronnie O'Sullivan for the fourth time, again with some ease, as he beat Stephen Maguire 10–2 in the final. The tournament was also notable for the longest televised frame (77 minutes) between Marco Fu and Mark Selby and Ronnie O'Sullivan's maximum 147 break in the deciding frame of the semi-final. The 2009 final saw the reigning world champion John Higgins lose to Ding Junhui, after he missed the brown and the chance to go 8–6 in front."]}, {"page": "Welsh Open (snooker)", "response": ["There have been nine maximum breaks in the history of the tournament. The first was made by Ronnie O'Sullivan in 1999 against James Wattana. The second was made at the qualifying stage of the 2000 event by Barry Pinches against Joe Johnson. The third was made by Andrew Higginson in 2007 against Ali Carter. The fourth 147 was made in 2011 by Hendry against Stephen Maguire. This was Hendry's 10th 147 break and with this he equalled the record for most maximums with Ronnie O'Sullivan. He also became the oldest player to compile a maximum break at the age of 42 years and 35 days. The fifth was made by O'Sullivan in 2014 against Ding Junhui. This was O'Sullivan's 12th 147 break, it was the last visit to the table in the tournament - beating Ding Junhui 9-3 - before the event moved to Cardiff, and with it he set the record for most maximums. Ding Junhui made the sixth at the quarter-finals of the 2016 tournament, against Neil Robertson. Two maximum breaks were made at the 2019 event, one by Neil Robertson in the first round match against Jordan Brown and one by Noppon Saengkham in the third round against Mark Selby. The most recent maximum break was made in 2020 by Kyren Wilson on his first visit to the table in the first round match against Jackson Page."]}, {"page": "Scottish Open (snooker)", "response": ["Steve Davis was the tournament's most prolific winner, with a record 6 wins from 8 finals. This included a 9–0 whitewash of Dennis Taylor in the 1981 final. There have been seven maximum breaks in the history of the tournament, two at the 2000 event. Stephen Maguire at the first qualifying round against Phaitoon Phonbun, and Ronnie O'Sullivan in the last 32 against Quinten Hann. In 2012 Kurt Maflin achieved a 147 in the last 32 against Stuart Carrington. In 2017, eventual runner-up Cao Yupeng made a maximum break in his first round match against Andrew Higginson, and the following year, John Higgins compiled his ninth career 147 in his second round match against Gerard Greene. In 2020, Zhou Yuelong made a maximum break in his first round match with Peter Lines, and the tournament’s most recent maximum break was made in 2021 by Xiao Guodong in his qualifying match against Fraser Patrick."]}, {"page": "China Open (snooker)", "response": ["|  Stephen Maguire", "|  Stephen Maguire", "** Stephen Maguire (2008)"]}, {"page": "Mark King (snooker player)", "response": ["In December 2004, King beat Robin Hull, Mark Williams, Alan McManus and John Parrott en route to the semi-finals of the UK Championship, losing 9–4 to eventual winner Stephen Maguire. At 8–3, a mobile phone went off in the crowd, prompting King to quip \"if that's my missus, tell her I'll be home soon\". In 2005, King beat Ronnie O'Sullivan 9–8 at the same event, having fought back from 5–3 down in a match which saw his opponent sitting with a wet towel draped over his head when King was at the table. King would eventually lose 9–6 in the last 16 to Joe Perry, but made a career best 146 break at the 2006 Championships.", "Defeat to Neil Robertson (he was trailing 7–2 but only lost 10–9) in the qualifying for the World Championship in 2005 cost him the chance of a top 16 return, but King qualified a year later, resiliently losing 10–6 to Stephen Maguire in the first round. In 2007, King went out to David Gilbert in the qualifying round for the event.", "King began the 2012–13 season by failing to qualify for three of the first four ranking events. The one he did reach was the Shanghai Masters, where he beat Zhao Xintong 5–3 in the wildcard round and local favourite Ding Junhui 5–4 in the first round, having trailed 0–3. He lost 3–5 to Shaun Murphy in the following round. King saw off Mark Williams 6–3 in the first round of the 2012 UK Championship, before surrendering a 3–0 lead against 17-year-old Luca Brecel to lose 4–6. He also reached the second round of the German Masters by whitewashing Stephen Maguire 5–0, but then lost in a deciding frame to Matthew Stevens. King failed to qualify for the World Open and lost in the first round of the Welsh Open and China Open. He faced Mark Allen in the opening round of the World Snooker Championship and produced a big shock by fighting back from 6–8 down to produce his best snooker at the end of the match in a 10–8 win. He raced into a 6–2 lead in the first session of his second round match against Ding Junhui, before falling 7–9 behind in the next session and ultimately lost 9–13. King ended the season ranked world number 29.", "King lost in the qualifying rounds of three of the first five ranking events of the 2014–15 season and was knocked out in the first round of the other two. He defeated Steven Hallworth and Michael White both 5–3 to qualify for the German Masters and eliminated world number five Barry Hawkins 5–3 in the first round. In the last 16 he lost 5–2 to Stephen Maguire. A consistent season in the European Tour events saw King finish 24th on the Order of Merit to make his debut in the Grand Final. King secured another win over Hawkins this time 4–2 and looked like moving 3–2 ahead of Judd Trump in the last 16. However, Trump got the snooker he needed and won the next frame to defeat King. King closed the season with a 5–4 loss to Robin Hull in the second round of the China Open and was narrowly edged out 10–9 by Anthony McGill in the final round of World Championship qualifying. He fell outside the top 32 in the rankings for the first time since 1996 at the culmination of the season as he was 36th.", "King saw off Stephen Maguire and Ali Carter both 4–3 to progress to the quarter-finals of the World Grand Prix, where he lost 4–2 to Marco Fu. For the fourth year in a row King could not play in the World Championship as he was beaten 10–4 by Xiao Guodong in the final qualifying round."]}, {"page": "Joe Swail", "response": ["As an amateur, Swail played in many of the Players Tour Championship events. At the Paul Hunter Classic, Swail defeated players such as Jimmy White, Shaun Murphy and Barry Hawkins en route to the final, doubling the black ball in a final frame decider against Hawkins. In the final, he was defeated 1–4 by Mark Selby. This not only booked his place on the tour for the following season, but also qualified him for the PTC Finals in Galway, Ireland, where he defeated Stephen Maguire 4–3, despite being 0–3 down. He lost 0–4 in the Last 16 to fellow Northern Irishman Mark Allen. At the 2013 World Snooker Championship, Swail entered the Pre-Qualifying rounds for amateur players, he won 3 of these matches, as well as his Last 96 and Last 80 matches against Pankaj Advani, and Adam Duffy respectively. He lost his Last 64 match against Mark Joyce 7–10, picking up £4,600 for his efforts."]}, {"page": "Fergal O'Brien", "response": ["After qualifying for the main draw of the 2007 Northern Ireland Trophy by beating Barry Pinches in a deciding frame, O'Brien went on to beat Dave Harold in the first round of the main draw. Victories over John Higgins (in a decider), Barry Hawkins and Ronnie O'Sullivan, before he reached the second ranking-event final of his career by beating Mark Allen by 6 frames to 3. He lost the final to Stephen Maguire, 5–9. This run helped him return to the top 32 of the Snooker world rankings 2007/2008, but the early part of the 2008–09 season proved disappointing, O'Brien not reaching the last sixteen of any of the first four tournaments."]}, {"page": "Dave Harold", "response": ["Harold retained his Top 32 ranking, and started the 2008–09 season ranked at #28, his highest ranking since 2003. In the first ranking event of the new season, the 2008 Northern Ireland Trophy, he beat Ricky Walden 5–2, Graeme Dott 5–3, Stephen Lee 5–4 and defending champion Stephen Maguire to reach the semi-finals, his first appearance at that stage of a ranking event for five years. He then moved into a 5–1 lead against John Higgins and won 6–4, to reach his first final since 1994, which he lost 9–3 to Ronnie O'Sullivan.\"Classy O'Sullivan wins NI Trophy \", BBC Sport, 31 August 2008. Retrieved on 1 September 2008. Harold's performance in this tournament moved him up to 14th in the provisional world rankings. Harold remarked after the final that, aside from claiming the World Championship, his one other remaining ambition in the game is to score a victory over O'Sullivan, who he has never beaten in a ranking tournament. The 2008 Northern Ireland Trophy marked his tenth consecutive failure to do so."]}, {"page": "Masters (snooker)", "response": ["There were a total of 43 wild-card matches. In 19 of these matches the seeded player played the winner of the Qualifying Event. In the remaining 24 matches the seed played a selected wild-card. The players selected as wild-card were Jimmy White (5), Ding Junhui (3), Steve Davis (2), Marco Fu (2), James Wattana (2), Ken Doherty, Peter Ebdon, Andy Hicks, Alex Higgins, John Higgins, Paul Hunter, Stephen Maguire, Ian McCulloch, Ricky Walden and Gary Wilkinson."]}, {"page": "Dominic Dale", "response": ["At the International Championship, Dale defeated Matthew Selt 6–1 and then lost 6–3 to Joe Perry in the second round. His second round match with Peter Ebdon at the UK Championship finished at 1:30am as Dale relinquished a 5–4 advantage to be beaten 6–5. Breaks of 72, 73, 82 and 61 saw Dale sneak past Mark Williams in the opening round of the Players Championship Finals 4–3, before he lost 4–1 to Shaun Murphy. Dale won more than one match at a ranking event for the only time this season when he knocked out Jamie Jones and Darryl Hill at the China Open, but then was beaten 6–1 by Stephen Maguire in the third round."]}, {"page": "John Rea (snooker player)", "response": ["Rea owns the Lucky Break snooker club in Clydebank. Guests at Rea's club have included Stephen Maguire, who he managed."]}, {"page": "Snooker world rankings 1999/2000", "response": ["| Stephen Maguire"]}, {"page": "List of people from Glasgow", "response": ["*Stephen Maguire – top 16 professional snooker player"]}, {"page": "November 2004 in sports", "response": ["*Snooker: Stephen Maguire beats David Gray in the UK Championship 10 frames to 1 (BBC)"]}, {"page": "List of snooker player nicknames", "response": ["| rowspan=\"4\" |  Stephen Maguire || The Merlin of Milton ||"]}, {"page": "Michael Holt (snooker player)", "response": ["The 2010–11 season saw the introduction of Players Tour Championship (PTC) events. At the Prague Classic, Holt won six matches to reach the first final of the career which included victories over Stephen Maguire, Mark Selby and Shaun Murphy. He faced John Higgins who he had failed to beat in 13 previous meetings, but produced a superb performance to win 4–2. Holt dedicated the title to his father who had suffered a stroke two months previously. The result ensured he would qualify for the PTC Finals as he finished 13th on the Order of Merit and he saw off Marco Fu 4–1 and Barry Pinches 4–3 to match his best result in a full ranking event. In the quarter-finals he lost 4–2 against Martin Gould. Despite his late season surge in form he ended it ranked world number 45, the lowest he had been in ten years.", "Holt began the 2014–15 season by advancing to the final of the Yixing Open, but he was beaten 4–2 by Ding Junhui. He eliminated Rory McLeod and Sam Baird at the Wuxi Classic, before losing 5–1 to Neil Robertson in the last 16. A second last 16 ranking event appearance followed at the Shanghai Masters after Holt overcame Ricky Walden 5–2, but he was ousted by reigning world champion Mark Selby 5–2. Holt made a 138 break during his 6–1 victory over Zak Surety in the opening round of the UK Championship, before losing 6–3 to Dechawat Poomjaeng. He lost his first six ranking matches in 2015, but qualified for the PTC Grand Final by finishing sixth on the Asian Order of Merit. There, Holt defeated Jimmy Robertson 4–2 and held on against Stephen Maguire to win 4–3 having been 3–0 up. In his only quarter-final in a ranking event this season, Holt was knocked out 4–1 by Joe Perry."]}, {"page": "Snooker world rankings 2005/2006", "response": ["| Stephen Maguire"]}]}}