{"wiki_id": "http://www.wikidata.org/entity/Q452029", "itemLabel": "Sophia Jex-Blake", "itemDescription": "British physician and suffragist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophia_Jex-Blake", "wikipedia_page": {"main": "Sophia Louisa Jex-Blake (21 January 1840 – 7 January 1912) was an English physician, teacher and feminist. She led the campaign to secure women access to a University education when she and six other women, collectively known as the Edinburgh Seven, began studying medicine at the University of Edinburgh in 1869. She was the first practising female doctor in Scotland, and one of the first in the wider United Kingdom of Great Britain and Ireland; a leading campaigner for medical education for women and was involved in founding two medical schools for women, in London and Edinburgh at a time when no other medical schools were training women.", "link_mentions": [{"page": "Elizabeth Garrett Anderson", "response": ["A companion to her in this struggle was the lesser known Dr. Sophia Jex-Blake. While both are considered \"outstanding\" medical figures of the late 19th century, Garrett was able to obtain her credentials by way of a \"side door\" through a loophole in admissions at the Worshipful Society of Apothecaries. Having privately obtained a certificate in anatomy and physiology, she was admitted in 1862 by the Society of Apothecaries who, as a condition of their charter, could not legally exclude her on account of her sex. She was the only woman in the Apothecaries Hall who sat the exam that year and among the 51 gentlemen candidates was William Heath Strange, who went on the found the Hampstead General Hospital, which was on the site now occupied by the Royal Free Hospital. She continued her battle to qualify by studying privately with various professors, including some at the University of St Andrews, the Edinburgh Royal Maternity and the London Hospital Medical School.", "The same year she was elected to the first London School Board, an office newly opened to women; Garrett's was the highest vote among all the candidates. Also in that year, she was made one of the visiting physicians of the East London Hospital for Children (later the Queen Elizabeth Hospital for Children), becoming the first woman in Britain to be appointed to a medical post,Manton, pp. 193–195 but she found the duties of these two positions to be incompatible with her principal work in her private practice and the dispensary, as well as her role as a new mother, so she resigned from these posts by 1873.Manton, p. 235 In 1872, the dispensary became the New Hospital for Women and Children, treating women from all over London for gynaecological conditions; the hospital moved to new premises in Marylebone Street in 1874. Around this time, Garrett also entered into discussion with male medical views regarding women. In 1874, Henry Maudsley's article on Sex and Mind in Education appeared, which argued that education for women caused over-exertion and thus reduced their reproductive capacity, sometimes causing \"nervous and even mental disorders\".Manton, p. 236 Garrett's counter-argument was that the real danger for women was not education but boredom and that fresh air and exercise were preferable to sitting by the fire with a novel.Manton, p. 237 In the same year, she co-founded London School of Medicine for Women with Sophia Jex-Blake and became a lecturer in what was the only teaching hospital in Britain to offer courses for women.Manton, pp. 241–243 She continued to work there for the rest of her career and was dean of the school from 1883 to 1902. This school was later called the Royal Free Hospital of Medicine,Manton, p. 308 which later became part of what is now the medical school of University College London."]}, {"page": "January 7", "response": ["*1912 – Sophia Jex-Blake, English physician and feminist (b. 1840)"]}, {"page": "1912", "response": ["* January 7 – Sophia Jex-Blake, English physician and feminist (b. 1840)"]}, {"page": "1840", "response": ["* January 21 – Sophia Jex-Blake, English physician (d. 1912)"]}, {"page": "1869", "response": ["* October – The 'Edinburgh Seven', led by Sophia Jex-Blake, start to attend lectures at the University of Edinburgh Medical School, the first women in the United Kingdom to do so (although they will not be allowed to take degrees)."]}, {"page": "1912 in literature", "response": ["*January 7 – Sophia Jex-Blake, English medical writer and pioneer female physician (born 1840 in literature)"]}, {"page": "1884 in literature", "response": ["*Sophia Jex-Blake – The Care of Infants: A Manual for Mothers and Nurses"]}, {"page": "1872 in literature", "response": ["*Sophia Jex-Blake – Medical Women: A Thesis and a History"]}, {"page": "1840 in literature", "response": ["*January 21 – Sophia Jex-Blake, English medical writer and pioneer female physician (died 1912)"]}, {"page": "Hillsdale College", "response": ["Hillsdale survived while nearly 80% of the colleges founded before the Civil War were forced to close. After the war, it regained its normal enrollment; many veterans returned and completed their education. Hillsdale continued to host notable speakers, including the physician and educator Sophia Jex-Blake in October 1865. Hillsdale's Delta Tau Delta chapter, its first fraternity, was chartered on October 19, 1867."]}, {"page": "1840 in science", "response": ["* January 21 – Sophia Jex-Blake (died 1912), English physician."]}, {"page": "1886 in science", "response": ["* Edinburgh School of Medicine for Women is founded by Dr Sophia Jex-Blake."]}, {"page": "St Giles' Cathedral", "response": ["In the north choir aisle, the bronze plaque commemorating Sophia Jex-Blake (died 1912) and the stone plaque to James Nicoll Ogilvie (1928) were designed by Robert Lorimer.Marshall 2011, pp. 40, 50.  Lorimer himself is commemorated by a large stone plaque in the Preston Aisle (1932): this was designed by Alexander Paterson.Marshall 2011, p. 67. A number of plaques in the \"Writers' Corner\" in the Moray Aisle incorporate relief portraits of their dedicatees: these include memorials to Robert Fergusson (1927) and Margaret Oliphant (1908), sculpted by James Pittendrigh Macgillivray; John Brown (1924), sculpted by Pilkington Jackson; and John Stuart Blackie (died 1895) and Thomas Chalmers (died 1847), designed by Robert Lorimer.Marshall 2011, pp. 73-74, 76. Further relief portrait plaques commemorate Robert Inches (1922) in the former session house and William Smith (1929) in the Chambers Aisle; the former was sculpted by Henry Snell Gamley.Marshall 2011, pp. 24, 42. Pilkington Jackson executed a pair of bronze relief portraits in pedimented Hopton Wood stone frames to commemorate Cameron Lees (1931) and Wallace Williamson (1936): these flank the entrance to the Thistle Chapel in the south choir aisle."]}, {"page": "Elsie Inglis", "response": ["In 1887, the Edinburgh School of Medicine for Women was opened by Dr Sophia Jex-Blake and Inglis started her studies there. In reaction to what she saw as Jex-Blake's uncompromising ways, and after two fellow students Grace and Georgina Cadell were expelled, Inglis and her father founded the Edinburgh College of Medicine for Women, under the auspices of the Scottish Association for the Medical Education of Women whose sponsors included Sir William Muir, a friend of her father from India, now Principal of the University of Edinburgh. Inglis's sponsors also arranged clinical training for female students under Sir William MacEwen at the Glasgow Royal Infirmary."]}, {"page": "List of craters on Venus", "response": ["| Jex-Blake ||  || align=right | 31.6 || align=center | 1991 || Sophia Jex-Blake, British pioneer woman physician (1840–1912). || "]}, {"page": "Bruntsfield", "response": ["* Sophia Jex-Blake, (1840 – 1912), English physician, teacher and feminist who established Bruntsfield Hospital for Women"]}, {"page": "Sophia Louisa Jex-Blake", "response": ["#redirectSophia Jex-Blake"]}, {"page": "Elizabeth Blackwell", "response": ["In 1874, Blackwell established a women's medical school in London with Sophia Jex-Blake, who had been a student at the New York Infirmary years earlier. Blackwell had doubts about Jex-Blake and thought that she was dangerous, belligerent, and tactless.Elizabeth Blackwell. Letter to Samuel C. Blackwell. 21 Sep 1874. (Blackwell Family Papers, Library of Congress). Nonetheless, Blackwell became deeply involved with the school, and it opened in 1874 as the London School of Medicine for Women, with the primary goal of preparing women for the licensing exam of Apothecaries Hall. Blackwell vehemently opposed the use of vivisections in the laboratory of the school.", "However, Blackwell had a very strong personality and was often quite acerbic in her criticism of others, especially other women. Blackwell had a falling out with Florence Nightingale after Nightingale returned from the Crimean War. Nightingale wanted Blackwell to turn her focus to training nurses and could not see the legitimacy of training female physicians. After that, Blackwell's comments upon Florence Nightingale's publications were often highly critical.Kitty Barry Blackwell. Letter to Alice Stone Blackwell. 24 Mar 1877. (Blackwell Family Papers, Library of Congress) She was also highly critical of many of the women's reform and hospital organisations in which she played no role, calling some of them \"quack auspices\".Elizabeth Blackwell. Letter to Emily Blackwell. 23 Jan 1855. (Blackwell Family Papers, Schlesinger Library, Radcliffe College) Blackwell also did not get along well with her more stubborn sisters Anna and Emily, or with the women physicians she mentored after they established themselves (Marie Zakrzewska, Sophia Jex-Blake and Elizabeth Garrett Anderson). Among women at least, Blackwell was very assertive and found it difficult to play a subordinate role.", "In 1874, Blackwell worked together with Florence Nightingale, Sophia Jex-Blake, Elizabeth Garrett Anderson, Emily Blackwell, and Thomas Henry Huxley to create the first medical school for women in England, London School of Medicine for Women, for which she acted as the Chair of Hygiene."]}, {"page": "Robert Christison", "response": ["Christison was unequivocally opposed to women studying medicine and qualifying as doctors, and led the campaign against Sophia Jex-Blake and the Edinburgh Seven. He was an influential figure both within the University and in the wider civic life of Edinburgh, and his opinion was held in high regard.", "″Dr Sophia Jex-Blake has made the greatest of all contributions to the end attained. I do not say that she has been the ultimate cause of success. The ultimate cause has been simply this, that the time was at hand. It is one of the lessons of the history of progress that when the time for reform has come you cannot resist it, though if you make the attempt, what you may do is to widen its character or precipitate its advent. Opponents, when the time has come, are not merely dragged at the chariot wheels of progress - they help to turn them. The strongest forces, whichever way it seems to work, does most to aid. The forces of greatest concentration here have been, in my view, on the one hand the Edinburgh University led by Sir Robert Christison, on the other the women claimants led by Dr Sophia Jex-Blake.″"]}, {"page": "Timeline of Edinburgh history", "response": ["1869: Lorimer & Clark's brewery opens on Slateford Road, Gorgie; Sophia Jex-Blake becomes first female medical student"]}, {"page": "List of female scientists before the 20th century", "response": ["* Sophia Jex-Blake (1840–1912), British physician"]}, {"page": "Edinburgh Seven", "response": ["* Sophia Jex-Blake", "Sophia Jex-Blake applied to study medicine in March 1869 and although the Medical Faculty and the Senatus Academicus voted in favour of allowing her to study medicine, the University Court rejected her application on the grounds that the university could not make the necessary arrangements 'in the interest of one lady' ", "The examination was in two parts. English, Latin and mathematics were compulsory subjects; in addition, each candidate had to choose two subjects from a group that included Greek, French, German, higher mathematics, natural philosophy, logic and moral philosophy. Sophia Jex-Blake acted as mathematics tutor to the other women. Of the 152 candidates who sat the exam on 19 October 1869, five were women. Four of the women came in the top seven places.", "In March 1870, the women sat the first examinations in physiology and chemistry. Not only did they all pass, but four of them had obtained honours in both subjects. Edith Pechey, who had written the humble letter to Sophia Jex-Blake (see above), had won first place amongst the candidates sitting the exam for the first time and so had first claim on a Hope Scholarship.", "Sophia Jex-Blake soon moved to London to campaign there. She was active in establishing the London School of Medicine for Women, which opened in autumn 1874 with twelve of its fourteen students having previously studied in Edinburgh. Six of the original \"Seven\" attended the School. Isabel Thorne was an asset to its smooth running since she was more diplomatic than Jex-Blake. She became the honorary secretary of the School, but gave up her own plan to practise as a doctor.", "thumb|Matriculation Signatures: Sophia Jex-Blake, Mary Pechey, Helen Evans, Matilda Chaplin", "*Roberts, S. Sophia Jex-Blake: a woman pioneer in nineteenth century medical reform (1993)"]}, {"page": "Coopers' Company and Coborn School", "response": ["* Prof Michael Spyer, Sophia Jex-Blake Professor of Physiology since 1980 at the UCL Medical Schoolhttps://web.archive.org/web/20110605060013/http://www.ucl.ac.uk/neuroscience/Page.php?ID=12&ResearcherID=405 "]}, {"page": "Women in science", "response": ["James Barry became the first British woman to gain a medical qualification in 1812, passing as a man. Elizabeth Garrett Anderson was the first openly female Briton to qualify medically, in 1865. With Sophia Jex-Blake, American Elizabeth Blackwell and others, Garret Anderson founded the first UK medical school to train women, the London School of Medicine for Women, in 1874."]}, {"page": "UCL Medical School", "response": ["* The London School of Medicine for Women was established in 1874 by Sophia Jex-Blake, as the first medical school in Britain to train women. In 1877 The Royal Free Hospital agreed to allow students from LSMW to complete their clinical studies there and by 1896 was renamed The London Royal Free Hospital School of Medicine for Women and became part of the University of London."]}, {"page": "London School of Medicine for Women", "response": ["The school was formed in 1874 by an association of pioneering women physicians Sophia Jex-Blake, Elizabeth Garrett Anderson, Emily Blackwell and Elizabeth Blackwell with Thomas Henry Huxley. The founding was motivated at least in part by Jex-Blake's frustrated attempts at getting a medical degree at a time when women were not admitted to British medical schools, thus being expelled from Edinburgh University. Other women who had studied with Jex-Blake in Edinburgh joined her at the London school, including Isabel Thorne who succeeded her as honorary secretary in 1877.  She departed to start a medical practice in Edinburgh where she would found the Edinburgh School of Medicine for Women in 1886.", "=== Sophia Jex-Blake ===", "Sophia Jex-Blake was born in Hastings, UK in 1840. After attending various private schools, Jex-Blake attended Queen's College. Jex-Blake's pursuit of an occupation in the field of medicine lead to the desire to enroll in the University of Edinburgh to study medicine. Jex-Blake's desire to attend the University of Edinburgh was hindered because the university did not allow women to attend. To fight this, Jex-Blake opened a court case against the university, resulting in an unsuccessful ruling in favor of the University of Edinburgh. ", "In 1889, the Act of Parliament ruled for degrees for women, largely resulting because of Jex-Blake's struggles. This allowed Sophia Jex-Blake to become one of the first female doctors in the UK. Jex-Blake then founded the London School of Medicine for Women as well as the Edinburgh School of Medicine for Women."]}, {"page": "Rotherfield", "response": ["*Sophia Jex-Blake (1840–1912), one of the first women doctors, lived in Mark Cross: she is buried in Rotherfield graveyard."]}, {"page": "Edinburgh School of Medicine for Women", "response": ["The Edinburgh School of Medicine for Women was founded by Sophia Jex-Blake in Edinburgh, Scotland, in October of 1886, with support from the National Association for Promoting the Medical Education of Women. Sophia Jex-Blake was appointed as both the Director and the Dean of the School. The first class of women to study at the Edinburgh School of Medicine for Women consisted of eight students, the youngest of whom was nineteen years of age. Throughout its twelve years in operation, the school struggled to find financial funding to remain open. A  rival institution, the Edinburgh College of Medicine for Women, set up by  Elsie Inglis with the help of her father John Inglis,  attracted several students of Jex-Blake, including Martha Cadell and  Grace Cadell. St Mungo's College and Queen Margaret College in Glasgow also accepted women medical students and when the Scottish universities began to do so the Edinburgh School of Medicine could no longer compete. The school closed in 1898. Over the twelve years of its operation, the Edinburgh School of Medicine provided education to approximately eighty female students. Of those eighty students, thirty-three completed the full course of medical training at the Edinburgh School while many others chose to finish their education at outside institutions.", "The first step in Sophia Jex-Blake's journey to obtaining entry into a medical program was by requesting permission from Professor JJ Balfour, who served as the Dean of the Medical Faculty, to participate in the University of Edinburgh Medical College’s summer classes. Following this request, the faculty at the University voted to determine the fate of Blake and future women’s admission into their medical program. On one hand, she received support in her pursuit of medical education as long as women were educated solely in the field of obstetrics and gynecology. However, other faculty members were opposed to allowing females to study medicine on the foundation of intellectual inferiority. One such individual was Robert Christison, who believed that allowing women to study medicine would diminish the quality of the medical field because women were not only less intelligent than men, but also too fragile to endure the rigorous coursework demanded by such a profession. In spite of some opposition to Sophia Jex-Blake’s request, the faculty vote ended in favor of her admission to the program. ", "The admission of Sophia Jex-Blake into the University of Edinburgh Medical College did not go without controversy and upheaval from university attendees. After the initial vote granted Jex-Blake admission to the program, Claud Murihead, who worked with the Royal Infirmary, brought forward an appeal to overturn the decision. Backed by a petition signed by approximately 200 students, Murihead’s appeal resulted in a reversal of the decision to admit Jex-Blake. The argument that led to the decision was that men and women should be educated separately, and thus providing courses for a single female student would be inefficient and financially unconscionable.", "After over a decade of refusing to admit women into their medical school, some lecturers at the Extramural School in Edinburgh accepted women into their classes. The “Edinburgh Seven,” consisting of Sophia Jex-Blake, Isabel Thorne, Edith Pechey, Matilda Chaplin, Helen Evans, Mary Anderson, and Emily Bovell were the first women to be admitted into the medical program in 1869. However, acceptance into the program was just the beginning of the challenges they would face. The Edinburgh Seven were charged higher fees than their male counterparts, as a result of smaller class sizes. In addition, while the University had granted their faculty the permission to teach women, it was not a requirement. Professors could refuse to teach female students if they felt it necessary to do so. As a result, these women had to arrange classes on their own instead of being assigned courses by the University program. Furthermore, despite equivalent coursework and lectures, the all-female classes were graded on a different scale than the male classes. This reduced the ability of these women to qualify for scholarships offered by the university based on academic success and achievement. ", "As the opportunity to receive a medical education became increasingly available to women in Edinburgh and abroad, Jex-Blake was inspired to establish her own medical college for female students. Jex-Blake's first step in this endeavor was to notify the National Association for Promoting the Medical Education of Women of her desire to open a school that offered a medical education exclusively to women. However, before she was granted permission to do so by the Association, Jex-Blake began reaching out to potential students and publicizing her medical program. Sophia Jex-Blake's intention for this establishment was to cater to the local community in Edinburgh. Thus, she did not include the price of housing in the proposed cost of tuition and books, as it was assumed that most students would be residents in the Edinburgh area and would be living at home. ", "* Somerville, JM Dr Sophia Jex-Blake and the Edinburgh School of Medicine for Women, 1886–1898 (2005)"]}, {"page": "Louisa Stevenson", "response": ["Louisa Stevenson was a member of the Edinburgh Ladies' Educational Association (which later became the Edinburgh Association for the University Education of Women or EAUEW) and in 1868 she and Flora attended the first course of lectures for women given by Professor David Masson. This was the time when Sophia Jex-Blake was starting her campaign to open up medical education to women and Stevenson was honorary treasurer of a committee formed to support Jex-Blake and help with her legal costs. She and Flora paid for their niece Alice Stewart Ker to study medicine in Bern for a year. Alice was to become the 13th female British doctor."]}, {"page": "Edinburgh Association for the University Education of Women", "response": ["The ELEA was founded by Mary Crudelius, with Sarah Mair and others, in 1867 just before Sophia Jex-Blake started pressing Edinburgh University to admit medical students. Jex-Blake's campaign, covered by the press in both London and Scotland, made Edinburgh a visible part of a nationwide movement demanding higher education opportunities for women. Crudelius wished to keep the ELEA separate from the controversy raging over the women aspiring to become doctors, and she built up support amongst male academics, with strong encouragement from David Masson, Professor of Rhetoric and English Literature, who offered the first university-level lectures to Edinburgh women in 1868, and whose wife Emily Rosaline Orme Masson was a leader in the women's suffrage movement in Edinburgh. The lectures were well-attended and within the next five years the association had arranged for several more subjects to be offered, including science subjects."]}, {"page": "Mary Crudelius", "response": ["Crudelius did not want a separate women's college but the admission of women to universities. Nevertheless, she opposed the idea of co-educational classes and went to some trouble to arrange things so as not to attract criticism. Although Sophia Jex-Blake was campaigning during these years for women's medical education alongside men's, the ELEA tried to stay distant, even gaining the support of some of Jex-Blake's enemies. As the group's first secretary, Crudelius was a respected leader and helped steer the association through a few internal disputes and one dispute with the university about details of the plan to offer a university certificate to women passing examinations after attending ELEA lectures."]}, {"page": "Isabel Thorne", "response": ["Soon she responded to Sophia Jex-Blake's advertisement calling for women to join her in an attempt to qualify as doctors at the University of Edinburgh and so Thorne became one of the Edinburgh Seven (Mary Anderson, Emily Bovell, Matilda Chaplin, Helen Evans, Sophia Jex-Blake, Edith Pechey as well as Thorne). During this time, she won first prize in an anatomy examination. After their attempt to graduate in medicine was blocked, Thorne was one of the women who re-grouped at the London School of Medicine for Women. Her diplomatic temperament meant she was a more acceptable honorary secretary than Jex-Blake whose nomination had threatened to stir up controversy.", "In 1876 an act of parliament made it possible for women to be admitted to examination in medicine. The Edinburgh Seven that set up the London School of Medicine for Women (LSMW) asked Thorne, who agreed to hold the position of Honorary Secretary from 12 June 1877 – 1908, and a seat on the executive, although she never actually qualified in medicine. Thorne gave up her own ambition to be a doctor in order to commit herself to helping the school run smoothly; to become more solidly established. But Dr Lucy Sewall had once written that of all the students at Edinburgh, Isabel Thorne was one most likely to make the best doctor. She was considerate, tactful, hard-working, industrious, and for 30 years the mainstay of the college administration.Roberts, Sophia Jex-Blake, pp.144-5"]}, {"page": "Edith Pechey", "response": ["After Sophia Jex-Blake's sole application to study medicine at the University of Edinburgh was turned down, she advertised in The Scotsman for more women to join her. The second letter she received was from Edith Pechey. In her letter, Pechey wrote:", "Despite her concerns, Pechey became one of the Edinburgh Seven, the first seven female undergraduate medical students at any British university, others being Mary Anderson, Emily Bovell, Matilda Chaplin, Helen Evans, Sophia Jex-Blake and Isabel Thorne. She proved her academic ability by achieving the top grade in the chemistry exam in her first year of study, making her eligible to receive a Hope Scholarship.", "Having used the matter of separate classes as a reason not to award the scholarship to Pechey, Crum Brown felt unable to issue the women with the usual certificates of attendance at his chemistry classes. Instead, he gave them credit for attending a ″ladies″ class in the University. Only the standard certificates met the Faculty's requirements for the medical degree; the Professor's 'Strawberry Jam Labels', as Sophia Jex-Blake referred to them were useless."]}, {"page": "Margaret Houldsworth", "response": ["From 1872 she belonged to the Edinburgh Ladies' Debating Society led by Sarah Mair and, alongside Mair, was a central figure in starting classes and correspondence courses for women, and then in establishing St George's Training College and St George's School for Girls. The causes she supported benefited financially from her family's business success. As well as contributing to educational projects, Houldsworth supported the Edinburgh National Society for Women's Suffrage, and Sophia Jex-Blake's Hospital and Dispensary for Women and Children, a forerunner of Bruntsfield Hospital."]}, {"page": "Ovingdean", "response": ["Among those buried in the churchyard are the inventor Magnus Volk, the stained-glass artist Charles Kempe and the distinguished lawyer Helena Normanton, one of the first female barristers and QCs. Also in the graveyard is a monument to the family of pioneer female medical student Sophia Jex-Blake, who is buried some 25 miles (40 km) away in Rotherfield."]}, {"page": "Bruntsfield Hospital", "response": ["The hospital had its origins in public dispensary opened by Sophia Jex-Blake at 73 Grove Street in September 1878. It moved to 6 Grove Street, a building large enough to provide in-patient services, as the Edinburgh Hospital and Dispensary for Women and Children in 1885."]}, {"page": "Public dispensary", "response": ["In some places the same need might be met by friendly societies organised by the members themselves. Provident dispensaries, on the other hand, were usually set up by prosperous well-wishers and/or by a doctor, as Sophia Jex-Blake did in Edinburgh, with support from a committee."]}, {"page": "Margaret Todd (doctor)", "response": ["Todd is assumed to have been in a romantic relationship with Dr Sophia Jex-Blake, founder of Todd's university and place of employment. On Jex-Blake's retirement in 1899, they moved to Windydene, Mark Cross, where Todd wrote The Way of Escape (1902) and Growth (1906). After Jex-Blake's death, she wrote The Life of Dr Sophia Jex-Blake (1918) under her own name, describing the fight of women in the 19th century to enter the medical profession. The Times described it as \"almost too laboriously minute for the general reader\" but it received praise in other publications.", "* The Life of Sophia Jex-Blake (1918)"]}, {"page": "1912 in the United Kingdom", "response": ["* 7 January – Sophia Jex-Blake, physician and feminist (born 1840)"]}, {"page": "Susan Dimock", "response": ["* Sophia Jex-Blake"]}, {"page": "1886 in the United Kingdom", "response": ["* October – Edinburgh School of Medicine for Women founded by Dr Sophia Jex-Blake."]}, {"page": "1869 in the United Kingdom", "response": ["* October – the 'Edinburgh Seven', led by Sophia Jex-Blake, start to attend lectures at the University of Edinburgh Medical School, the first women in the UK to do so (although they will not be allowed to take degrees). "]}, {"page": "Sophia (given name)", "response": ["* Sophia Jex-Blake (1840–1912), English physician"]}, {"page": "1877 in Ireland", "response": ["* May – Sophia Jex-Blake qualifies as a Licentiate of the King’s and Queen’s College of Physicians of Ireland (LKQCPI)."]}]}}