{"wiki_id": "http://www.wikidata.org/entity/Q452629", "itemLabel": "Frances Houghton", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Frances_Houghton", "wikipedia_page": {"main": "Frances Houghton MBE is a 5 time Olympic rower (2000–2016), 4 times World Champion and 3 times Olympic Silver medallist.\nShe now mentors elite athletes and works as a professional chef.", "link_mentions": [{"page": "Chiswick", "response": ["The Chiswick reach of the Thames is heavily used for competitive and recreational rowing. Championship Course from Mortlake to Putney runs past Chiswick Eyot and Duke's Meadows. The Boat Race is contested on the Championship Course on a flood tide (in other words from Putney to Mortlake) with Duke's Meadows a popular view-point for the closing stages of the race. The finishing post is just downstream of Chiswick Bridge.  Other important races such as the Head of the River Race race the reverse course, on an ebb tide. Chiswick is home to several clubs. The University of London Boat Club is based in its boathouse off Hartington Road, which also houses the clubs of many London colleges and teaching hospitals; recent members include Tim Foster, Gold medallist at the Sydney Olympics and Frances Houghton, World Champion in 2005, 2006 and 2007. Quintin Boat Club lies between Chiswick Quay Marina and Chiswick Bridge. Tideway Scullers School is just downriver of Chiswick Bridge; its members include single sculling World Champion Mahé Drysdale and Great Britain single sculler Alan Campbell."]}, {"page": "Rowing at the 2004 Summer Olympics", "response": ["|Alison MowbrayDebbie FloodFrances HoughtonRebecca Romero"]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Debbie FloodFrances HoughtonAlison MowbrayRebecca Romero"]}, {"page": "Katherine Grainger", "response": ["She first won silver at Sydney in 2000 in the woman's quadruple sculls with Guin Batten, Gillian Lindsay and Miriam Batten losing to a German team. Four years later in Athens in 2004, she won silver again when she took part in the coxless pairs with Cath Bishop, losing to Georgeta Damian and Viorica Susanu of Romania. She returned to the quadruple sculls in Beijing 2008, when she won her third silver with Annabel Vernon, Debbie Flood and Frances Houghton, narrowly losing to China after taking the lead for some of the race. On 3 August 2012, she won an Olympic gold medal at London in the double sculls with Anna Watkins. At the 2016 Olympics, she won a silver medal in double sculls with Vicky Thornley."]}, {"page": "Rowing at the 2004 Summer Olympics – Women's quadruple sculls", "response": ["|20px| Great BritainAlison MowbrayDebbie FloodFrances HoughtonRebecca Romero", "#: Alison Mowbray, Debbie Flood, Frances Houghton and Rebecca Romero 6:15.60 -> Final A", "|Alison Mowbray, Debbie Flood, Frances Houghton, Rebecca Romero"]}, {"page": "Great Britain at the 2000 Summer Olympics", "response": ["|align=left|Frances HoughtonSarah Winckless"]}, {"page": "List of people associated with the University of London", "response": ["* Frances Houghton – Olympic medal-winning rower (KCL)"]}, {"page": "Debbie Flood", "response": ["She won a bronze medal at the 1998 World Junior championships in the double sculls along with partner Frances Houghton. The following year they both won gold in the double sculls at the World Under 23 Championships.", "Having taken a year off in 2009, Flood returned to take World Championships gold again in 2010, in the quad sculls with Beth Rodford, Frances Houghton, and Annabel Vernon.", "At the 2012 Summer Olympics Flood competed in the GB quad scull with Beth Rodford, Frances Houghton, and Melanie Wilson and finished in fifth place."]}, {"page": "2005 World Rowing Championships", "response": ["| Rebecca Romero  Sarah Winckless  Frances Houghton  Katherine Grainger"]}, {"page": "2006 World Rowing Championships", "response": ["|   Debbie Flood Sarah Winckless Frances Houghton  Katherine Grainger"]}, {"page": "List of Olympic medalists in rowing (women)", "response": ["|Alison MowbrayDebbie FloodFrances HoughtonRebecca Romero", "|Annabel VernonDebbie FloodFrances HoughtonKatherine Grainger", "|Katie GrevesMelanie WilsonFrances HoughtonPolly SwannJessica EddieOlivia Carnegie-BrownKaren BennettZoe LeeZoe de Toledo"]}, {"page": "Rebecca Romero", "response": [":2004 – 15px Silver, Quadruple sculls (with Frances Houghton, Debbie Flood, Alison Mowbray)", ":2005 – Gold, Quadruple sculls (with Katherine Grainger, Frances Houghton, Sarah Winkless)"]}, {"page": "Rowing at the 2008 Summer Olympics", "response": ["|Annabel VernonDebbie FloodFrances HoughtonKatherine Grainger"]}, {"page": "List of Old King's Scholars", "response": ["* Frances Houghton  (born 1980), Olympic rower and World Champion"]}, {"page": "2007 World Rowing Championships", "response": ["|   Annabel Vernon (b)Debbie Flood (2)Frances Houghton (3)Katherine Grainger (s) || 6:30.81"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Debbie Flood Katherine Grainger Frances Houghton Annabel Vernon"]}, {"page": "List of alumni of King's College London", "response": ["*Frances Houghton – Olympic gold medal-winning rower", "*Frances Houghton – Olympic medal-winning rower"]}, {"page": "University of London Boat Club", "response": ["* Frances Houghton – Four times World Champion and double Olympic silver medallist, 2004–2010 – women's quadruple scull  "]}, {"page": "Rowing at the 2008 Summer Olympics – Women's quadruple sculls", "response": ["|Annabel VernonDebbie FloodFrances HoughtonKatherine Grainger"]}, {"page": "List of 2008 Summer Olympics medal winners", "response": ["|Annabel VernonDebbie FloodFrances HoughtonKatherine Grainger"]}, {"page": "List of 2004 Summer Olympics medal winners", "response": ["|Alison MowbrayDebbie FloodFrances HoughtonRebecca Romero"]}, {"page": "2010 World Rowing Championships", "response": ["| Debbie FloodBeth RodfordFrances HoughtonAnnabel Vernon|| 7:12.78"]}]}}