{"wiki_id": "http://www.wikidata.org/entity/Q45352758", "itemLabel": "Jane Boyd", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Boyd", "wikipedia_page": {"main": "Jane Boyd (born 20 June 1953) is a British artist. She is best known for her work in light-based installation and drawing and has been exhibiting internationally since 1986. Boyd was the first woman to be elected Fellow Commoner in Creative Arts, a two-year fellowship (1981–83) awarded by Trinity College, Cambridge. Her work is represented in a number of public collections including the Victoria & Albert Museum, the Gibberd Gallery and the British Museum.", "link_mentions": [{"page": "London Waterloo station", "response": ["Two well-received images of the station are the two Southern Railway posters \"Waterloo Station – War\" and \"Waterloo Station – Peace\", painted by Helen McKie for the 1948 centenary of the station. The two pictures show hundreds of busy travellers all in exactly the same positions and poses, but with altered clothing and roles. The preparatory sketches for these were drawn between 1939 and 1942. In 1981, Shell UK ran a competition a work of art to be exhibited above Waterloo's Shell exit. The winner, Jane Boyd, went on to be Fellow Commoner in Creative Arts at Trinity College, Cambridge. Other paintings of the station include the huge 1967 work by Terence Cuneo, in the collection of the National Railway Museum. A statue of Terence Cuneo by Philip Jackson was installed on the concourse in 2004."]}, {"page": "List of British artists", "response": ["* Jane Boyd (born 1953)"]}, {"page": "Philip Esler", "response": ["Esler also writes on the way that biblical stories have been represented in Western art, including his study of two Rembrandt depictions of Saul and David in 1998.Philip F. Esler, \"The Madness of Saul: A Cultural Reading of 1 Samuel 8-31\", in Exum, Cheryl J, and Moore, Stephen D, eds. Biblical Studies/Cultural Studies. (Sheffield: Sheffield Academic Press, 1998), 220 262. In 2004 he co-authored with artist Jane Boyd a book on the Velázquez painting Christ with Martha and Mary in the National Gallery in London which was covered in The Independent on 18 February 2005 under the heading \"Through the looking-glass: how a mirror explains the secrets of a masterpiece\" (p. 3). A work Esler co-authored with Ronald A. Piper, Lazarus, Martha and Mary: A Social-Scientific and Theological Reading of John, contains a chapter on the Lazarus frescoes from the early Christian tombs in the Roman catacombs. More recently Esler has contributed a chapter on the biblical paintings of Welsh artist Ivor Williams to Imaging the Bible in Wales 1800-1975 (edited by Martin O’Kane and John Morgan-Guy)."]}, {"page": "Boyd (surname)", "response": ["*Jane Boyd, British artist"]}, {"page": "List of 20th-century women artists", "response": ["*Jane Boyd (born 1953), installation"]}]}}