{"wiki_id": "http://www.wikidata.org/entity/Q454330", "itemLabel": "Charles Frederick Worth", "itemDescription": "English fashion designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Frederick_Worth", "wikipedia_page": {"main": "Charles Frederick Worth (13 October 1825 – 10 March 1895) was an English fashion designer who founded the House of Worth, one of the foremost fashion houses of the 19th and early 20th centuries. He is considered by many fashion historians to be the father of haute couture. Worth is also credited with revolutionising the business of fashion.\nEstablished in Paris in 1858, his fashion salon soon attracted European royalty, and where they led monied society followed. An innovative designer, he adapted 19th-century dress to make it more suited to everyday life, with some changes said to be at the request of his most prestigious client Empress Eugénie. He was the first to replace the fashion dolls with live models in order to promote his garments to clients, and to sew branded labels into his clothing; almost all clients visited his salon for a consultation and fitting – thereby turning the House of Worth into a society meeting point. By the end of his career, his fashion house employed 1,200 people and its impact on fashion taste was far-reaching. The Metropolitan Museum of Art has said that his \"aggressive self-promotion\" earned him the title of the first couturier. Certainly, by the 1870s, his name was not just known in court circles, but appeared in women's magazines that were read by wide society.Worth raised the status of dressmaking so that the designer-maker also became arbiter of what women should be wearing. Writing on the history of fashion and, in particular, dandyism, in 2002, George Walden said: \"Charles Frederick Worth dictated fashion in France a century and a half before Galliano\".", "link_mentions": [{"page": "Fashion", "response": ["Although tailors and dressmakers were no doubt responsible for many innovations, and the textile industry indeed led many trends, the history of fashion design is generally understood to date from 1858 when the English-born Charles Frederick Worth opened the first authentic haute couture house in Paris. The Haute house was the name established by the government for the fashion houses that met the standards of the industry. These fashion houses have to adhere to standards such as keeping at least twenty employees engaged in making the clothes, showing two collections per year at fashion shows, and presenting a certain number of patterns to costumers.Claire B. Shaeffer (2001). Couture sewing techniques \"Originating in mid- 19th-century Paris with the designs of an Englishman named Charles Frederick Worth, haute couture represents an archaic tradition of creating garments by hand with painstaking care and precision\". Taunton Press, 2001 Since then, the idea of the fashion designer as a celebrity in his or her own right has become increasingly dominant."]}, {"page": "March 10", "response": ["*1895 – Charles Frederick Worth, English-French fashion designer (b. 1825)"]}, {"page": "Maria Feodorovna (Dagmar of Denmark)", "response": ["Dagmar was very fashionable. John Logan, a visitor to Russia, described her as \"the best dressed woman in Europe.\" He claimed that Empress Elisabeth of Austria \"excelled her in beauty\" but that \"no one touched\" her \"in frocks.\"Julia P. Gelardi, From Splendor to Revolution, p. 129 Charles Frederick Worth, a Parisian couturier, greatly admired her style. He said, \"Bring to me any woman in Europe-- queen, artiste, or bourgeoise-- who can inspire me as does Madame Her Majesty, and I will make her confections while I live and charge her nothing.\""]}, {"page": "October 13", "response": ["*1825 – Charles Frederick Worth, English fashion designer, founded House of Worth (d. 1895)"]}, {"page": "1895", "response": ["* March 10 – Charles Frederick Worth, English-born couturier (b. 1825)"]}, {"page": "1825", "response": ["* October 13 – Charles Frederick Worth, English-born fashion designer, father of haute couture (d. 1895)"]}, {"page": "Model (person)", "response": ["Originally, fashion had been displayed in miniature form to clients by fashion dolls, before the clothes were made in human size.Tom Tierney:Great Fashion Designs of the Victorian Era Paper Dolls in Full Color Modelling as a profession was first established in 1853 by Charles Frederick Worth, the \"father of haute couture\", when he asked his wife, Marie Vernet Worth, to model the clothes he designed. The term \"house model\" was coined to describe this type of work. Eventually, this became common practice for Parisian fashion houses. There were no standard physical measurement requirements for a model, and most designers would use women of varying sizes to demonstrate variety in their designs."]}, {"page": "East Midlands", "response": ["Charles Frederick Worth, born in Lincolnshire in 1825, is considered to be the founder of Parisian haute couture, ostensibly as the world's first true fashion designer."]}, {"page": "Lincolnshire", "response": ["* Charles Frederick Worth (1825–1895), fashion designer"]}, {"page": "Eugénie de Montijo", "response": ["The Empress was \"perhaps the last Royal personage to have a direct and immediate influence on fashion\". She set the standard for contemporary fashion at a time when the luxury industries of Paris were flourishing. Gowns, colors, and hairstyles \"à l'impératrice\" were avidly copied from the Empress throughout Europe and America. She was famous for her large crinolines and for rotating her outfits throughout the day, with a different dress for the morning, afternoon, evening, and night. She never wore the same gown twice, and in this way commissioned and acquired an enormous wardrobe, which she disposed of in annual sales to benefit charity. Her favored couturier, Charles Frederick Worth, provided hundreds of gowns to her over the years and was appointed the official dressmaker to the court in 1869. In the late 1860s, she caused a shift in fashion by turning against the crinoline and adopting Worth's \"new\" slimmer silhouettes with the skirt gathered in the back over a bustle."]}, {"page": "Culture of France", "response": ["France renewed its dominance of the high fashion ( or ) industry in the years 1860–1960 through the establishing of the great couturier houses, the fashion press (Vogue was founded in 1892; Elle was founded in 1945) and fashion shows.  The first modern Parisian couturier house is generally considered the work of the Englishman Charles Frederick Worth who dominated the industry from 1858 to 1895.Kelly, 101. In the early twentieth century, the industry expanded through such Parisian fashion houses as the house of Chanel (which first came to prominence in 1925) and Balenciaga (founded by a Spaniard in 1937).  In the post war year, fashion returned to prominence through Christian Dior's famous \"new look\" in 1947, and through the houses of Pierre Balmain and Hubert de Givenchy (opened in 1952).  In the 1960s, \"high fashion\" came under criticism from France's youth culture while designers like Yves Saint Laurent broke with established high fashion norms by launching prêt-à-porter (\"ready to wear\") lines and expanding French fashion into mass manufacturing and marketing.Dauncey, 195. Further innovations were carried out by Paco Rabanne and Pierre Cardin. With a greater focus on marketing and manufacturing, new trends were established in the 70s and 80s by Sonia Rykiel, Thierry Mugler, Claude Montana, Jean Paul Gaultier and Christian Lacroix.  The 1990s saw a conglomeration of many French couture houses under luxury giants and multinationals such as LVMH."]}, {"page": "Victorian fashion", "response": ["Charles Frederick Worth, a prominent English designer, became popular amongst the upper class though its city of destiny always is Paris. Haute couture became popular at the same time when sewing machines were invented. Hand sewn techniques arose and were a distinction in compared to the old ways of tailoring. Princess Eugenie of France wore the Englishman dressmaker, Charles Frederick Worth's couture and he instantly became famous in France though he had just arrived in Paris a few years ago. In 1855, Queen Victoria and Prince Albert of Britain welcomed Napoleon III and Eugenie of France to a full state visit to England. Eugenie was considered a fashion icon in France. She and Queen Victoria became instant friends. Queen Victoria, who had been the fashion icon for European high fashion, was inspired by Eugenie's style and the fashions she wore. Later Queen Victoria also appointed Charles Frederick Worth as her dress maker and he became a prominent designer amongst the European upper class. Charles Frederick Worth is known as the father of the haute couture as later the concept of labels were also invented in the late 19th century as custom, made to fit tailoring became mainstream.", "By the 1860s, when Europe was all about made-to-fit tailoring, crinolines were considered impractical. In the 1870s, women preferred more slimmer silhouettes, hence bodices grew longer and the polonaise, a skirt and bodice made together, was introduced. In 1870s the Cuirass Bodice, a piece of armour that covers the torso and functions like a corset, was invented. Towards the end of Victoria's reign, dresses were flared naturally as crinolines were rejected by middle-class women. Designers such as Charles Frederick Worth were also against them. All these inventions and changes in fashion led to women's liberation as tailored looks improved posture and were more practical.", "Image:Winterhalter Elisabeth.jpg| Dress designed by Charles Frederick Worth for Elisabeth of Austria painted by Franz Xaver Winterhalter.", "* Charles Frederick Worth"]}, {"page": "Bury St Edmunds", "response": ["Moyse's Hall Museum is one of the oldest (c. 1180) domestic buildings in East Anglia open to the public. It has collections of fine art, for example Mary Beale, costume, e.g. Charles Frederick Worth, horology, local and social history, including Witchcraft."]}, {"page": "Culture of the United Kingdom", "response": ["Fashion designer Mary Quant was at the heart of the \"Swinging London\" scene of the 1960s, and her work culminated in the creation of the miniskirt and hot pants.Ros Horton, Sally Simmons, 2007. \"Women Who Changed the World\". Quant named the miniskirt after her favourite make of car, the Mini.Barry Miles, 2009. The British Invasion: The Music, the Times, the Era\". Sterling Publishing Company, Inc., 2009 The Swinging London fashion scene has featured in films, and was spoofed in the Austin Powers comedy series.John Storey (2010). \"Culture and Power in Cultural Studies: The Politics of Signification\". p. 60. Edinburgh University Press The English fashion designer Charles Frederick Worth is widely considered the father of Haute couture.Jacqueline C. Kent (2003). \"Business Builders in Fashion – Charles Frederick Worth – The Father of Haute Couture\". The Oliver Press, Inc., 2003"]}, {"page": "Bourne, Lincolnshire", "response": ["*Charles Frederick Worth (1825–1895), son of a solicitor, lived at Wake House in North Street. He moved to Paris and became a renowned designer of women's fashion and the founder of haute couture. The French government awarded him the Légion d'honneur."]}, {"page": "Norman Hartnell", "response": ["Hartnell successfully emulated his British predecessor and hero Charles Frederick Worth by taking his designs to the heart of world fashion. Hartnell specialised in expensive and often lavish embroidery as an integral part of his most expensive clothes, which he also utilised to prevent exact ready-to-wear copies being made of his clothing. The Hartnell in-house embroidery workroom was the largest in London couture, and continued until his death in 1979, also producing the embroidered Christmas cards for clients and press during quiet August days, a practical form of publicity at which Hartnell was adept. The originality and intricacy of Hartnell embroideries were frequently described in the press, especially in reports of the original wedding dresses he designed for socially prominent young women during the 1920s and 1930s."]}, {"page": "Crinoline", "response": ["The cage crinoline made out of spring steel wire was first introduced in the 1850s, with the earliest British patent for a metal crinoline (described as a 'skeleton petticoat of steel springs fastened to tape.') granted in July 1856.Gernsheim, p.45Breward, pp.157–160 Alison Gernsheim suggests that the unidentified French inventor was probably R. C. Milliet of Besançon, as the July 1856 patent was filed by their British agent, C. Amet. Milliet had already patented a 'tournure de femme' in Paris on 24 April 1856 which was described as comprising 'elastic extensible circles joined together by vertical bands.' Following its introduction, the women's rights advocate Amelia Bloomer felt that her concerns about the hampering nature of multiple petticoats had been resolved, and dropped dress reform as an issue.D'Alleva, p.243 Diana de Marly, in her biography of the couturier Charles Frederick Worth noted that by 1858 there existed steel factories catering solely to crinoline manufacturers, and shops that sold nothing else but crinolines.de Marly, p.76 One of the most significant manufacturers of crinolines was that of Thomson & Co., founded by an American with branches across Europe and the United States. At the height of their success, up to four thousand crinolines were produced by Thomson's London factory in a day, whilst another plant in Saxony manufactured 9.5 million crinolines over a twelve-year period.Gernsheim, p.46 In 1859 the New York factory, which employed about a thousand girls, used 300,000 yards of steel wire every week to produce between three and four thousand crinolines per day, while the rival Douglas & Sherwood factory in Manhattan used a ton of steel each week in manufacturing hoop skirts.Wosk, p.45."]}, {"page": "Ludwigsburg Palace", "response": ["The Landesmuseum Württemberg maintains two subsidiary museums at Ludwigsburg Palace, the Ceramics Museum and Fashion Museum (Keramikmuseum and Modemuseum, respectively), both opened in 2004. The first of these takes up all of the third floor of the Neuer Hauptbau except the apartment of Duke Charles Eugene, a space of  containing more than 4,500 exhibits of porcelain, ceramics, faience and pottery, and of their history, making it one of the largest collections of ceramics in Europe. It includes 2,000 pieces of original Ludwigsburg porcelain and 800 pieces of maiolica, purchased by Charles Eugene from dealers in Augsburg and Nuremberg. It also includes porcelain from the manufactories at Meissen, Berlin, Sèvres, and Vienna, and 20th century Art Nouveau pieces purchased from six countries since 1950. The Fashion Museum, housed in the Festinbau and West Kavalierbau, displays about 700 pieces of clothing and accessories from the 1750s to the 1960s, including works by Charles Frederick Worth, Paul Poiret, Christian Dior, and Issey Miyake."]}, {"page": "Worth", "response": ["*Charles Frederick Worth (1825–1895), an English-born fashion designer of the 19th century"]}, {"page": "List of fashion designers", "response": ["* Charles Frederick Worth"]}, {"page": "1860s in Western fashion", "response": ["The Englishman Charles Frederick Worth had established his first fashion house in Paris in 1858. He was the first couturier, a dressmaker considered an artist, and his ability to dictate design in the 1860s led to the dominance of Parisian haute couture for the next hundred years.", "The Englishman Charles Frederick Worth had established his first fashion house in Paris in 1858. He was the first couturier, a dressmaker considered an artist, and his ability to dictate design in the 1860s led to the dominance of Parisian haute couture for the next hundred years."]}, {"page": "Dressmaker", "response": ["*Charles Frederick Worth"]}, {"page": "Pauline von Metternich", "response": ["Pauline accompanied her husband, an Austrian diplomat, on his missions to the royal Saxon court in Dresden and in 1859 to the imperial French court in Paris, where they lived for more than eleven years until the Franco-Prussian war of 1870/71. She played an important role in the social and cultural life of both Dresden and Paris, and, after 1871, Vienna. Pauline's regular travels between, and extended stays in, Paris and Vienna, permitted her to act as a cross-cultural transmitter of the many trends that interested her in music, political ideas, and sport. She was a close friend and confidante of French Empress Eugénie, and, with her husband, was a prominent personality at the court of Emperor Napoleon III. In 1860 she introduced fashion designer Charles Frederick Worth to the Empress and thus started his rise to fame. She was a leading fashion icon; it was said that she was often the very first one to wear a new fashion, which was secondly adopted by the empress, and then accepted and copied by the rest of high society.Granström, Alvar, Kvinnor och krinoliner: en mode- och sedeskildring från krinolinmodets tid, Carlsson, Stockholm, 1990 (Swedish)"]}, {"page": "Fashion doll", "response": ["During the first half of the 19th-century, fashion dolls were sometimes used to display fashion garments for clients before it was made in the salon of the milliner, seamstress or tailor, until Charles Frederick Worth introduced living human models in the 1850s. Tom Tierney:Great Fashion Designs of the Victorian Era Paper Dolls in Full Color"]}, {"page": "Timeline of Paris", "response": ["**Opening of the House of Worth, the shop of Charles Frederick Worth, the couturier for "]}, {"page": "Isabella Stewart Gardner", "response": ["After the building was ready, Gardner spent a year carefully installing her collection according to her personal aesthetic. The eclectic gallery installations, paintings, sculpture, textiles, and furniture from different periods and cultures combine to create a rich, complex and unique narrative. In the Titian Room,  Titian's masterpiece The Rape of Europa (1561–1562) hangs above a piece of pale green silk, which had been cut from one of Isabella Stewart Gardner's gowns designed by Charles Frederick Worth. Throughout the collection, similar stories, intimate portrayals, and discoveries abound.Anne Higonnet,  \"Private museums, public leadership: Isabella Stewart Gardner and the art of cultural authority.\" in Cultural Leadership in America: Art Matronage and Patronage ed by Wanda Corn (1997) 84 "]}, {"page": "Cora Pearl", "response": ["The highest point of Pearl’s career as courtesan were the years 1865-1870. In his biography of Pearl, The Pearl From Plymouth (1950), W. H. Holden wrote that there was evidence that Pearl regularly sent money to both her mother in England and father in America. For Pearl, money was for spending, for accumulating the luxuries of life, and buying her way to a coveted perch in the upper echelons of society. Her jewel collection alone was valued at some one million francs; at one point, she owned three homes, and her clothing was made for her by the renowned couturier Charles Frederick Worth. As her career prospered, the gifts from her suitors needed to be both costly and imaginative. She pitted her admirers against one other, raising the price for her favours as the game between competitors escalated. In her heyday, she was able to command as high a price as ten thousand francs for an evening's entertainment."]}, {"page": "Rue de la Paix, Paris", "response": ["The rue de la Paix (English: Peace Street) () is a fashionable shopping street in the center of Paris.  Located in the 2nd arrondissement of Paris, running north from Place Vendôme and ending at the Opéra Garnier, it is best known for its jewellers, such as the shop opened by Cartier in 1898.Paris 2e arrondissement Mémoire des rues; Auteur: Meryem Khouya; Éditeur: Parimagine, 2007 Charles Frederick Worth was the first to open a couture house in the rue de la Paix. Many buildings on the street are inspired in design by the hôtels particuliers of Place Vendôme.", "* Charles Frederick Worth was the first to open a couture house at 7 rue de la Paix, and in 1885 created the label of his salon \"Worth 7, Rue de la Paix\"."]}, {"page": "Neckline", "response": ["The off-the-shoulder trend dates back to the Regency and Victorian Era. They were the height of fashion in the early to mid-nineteenth century. Charles Frederick Worth, the father of haute couture, designed many elaborate dresses, many of which featured bodices with off-the-shoulder sleeves and were very popular with prominent figures like . Then in 1960s, French actress Brigitte Bardot put her own twist on this style, wearing off-the-shoulder tops with everything from midi skirts to pants, reviving the style. The style icon made off-the-shoulder sexy and trendy again and off-the-shoulder style also became known as the “Bardot” style."]}, {"page": "Indianapolis Museum of Art", "response": ["The museum's textile and fashion art collection is made up of 7,000 items, including 20th-century, custom-designed costumes by Givenchy, Chanel, and Balmain.  The collection includes a number of the world's fabric traditions, including African textiles donated by sisters Eliza and Sarah Niblack between 1916 and 1933 and a significant collection of Baluchi rugs. Based on the museum's early history of collecting textiles, items range from couture to silks and antique laces spanning 500 years. Some notable pieces include an Imperial Russian court dress by designer Charles Frederick Worth and Bodhisattva of Wisdom (Mañjusri), a Ming Dynasty silk panel. The museum's Design Arts collection is made up of European and American pieces from the Renaissance to the present. The collection includes Eliel Saarinen's sideboard designed in 1929 for The Metropolitan Museum of Art exhibition The Architect and the Industrial Arts: An Exhibition of Contemporary American Design and the Bubbles chaise longue designed by Frank Gehry in 1979 for the Experimental Edges Series. In 2018, the museum added a Sevres lunch service to its decorative arts collection."]}, {"page": "C. F. Worth", "response": ["#REDIRECT Charles Frederick Worth"]}, {"page": "History of fashion design", "response": ["History of fashion design refers specifically to the development of the purpose and intention behind garments, shoes and accessories, and their design and construction. The modern industry, based around firms or fashion houses run by individual designers, started in the 17th century with Charles Frederick Worth who, beginning in 1858, was the first designer to have his label sewn into the garments he created.  ", "An Englishman living in Paris, Charles Frederick Worth (1825 - 1905) is regarded as the first designer in the modern sense of the term, with a large business employing many largely anonymous tailors and seamstresses. A former draper, Worth's success was such that he was able to dictate what customers should wear. Launched into the spotlight as the Empress Eugénie's primary designer, Worth used his royal connections to gain recognition and clients. The proclamation on February 1, 1853 by Napoleon III that no visitors would be received to his court without formal dress meant that the popularity of Worth-style gowns became overwhelming. Ornately decorated and constructed from the finest materials, Worth's gowns are well known for their crinolines (cage-like metal structures that held the dress out in a stylish shape). "]}, {"page": "1825 in the United Kingdom", "response": ["* 13 October – Charles Frederick Worth, fashion designer, father of haute couture (died 1895 in France)"]}, {"page": "Fashion capital", "response": ["During the 19th century, with the powerful British Empire and young Queen Victoria on the throne (from 1837), London once again became a major fashion leader. However, it continued to look to Paris for stylistic inspiration, and the British 'father of haute couture' Charles Frederick Worth relocated to Paris in 1846. He did this to perfect and then commercialize his craft, also holding the first fashion shows and launching the concept of fashion labels there."]}, {"page": "1895 in the United Kingdom", "response": ["* 10 March – Charles Frederick Worth, fashion designer (born 1825)"]}, {"page": "Hamish Bowles", "response": ["Bowles has a large personal collection of designer clothing, including pieces by John Galliano, Mainbocher and Charles Frederick Worth. He has lent items from his collection to exhibitions at the Metropolitan Museum of Art."]}, {"page": "Paris Fashion Week", "response": ["A fashion week consists of a week of organized events of multiple designer's collections. Before this organized event was recognized in New York City, fashion showings were being held in Paris as early as the 1700s. These early showings were only to clients purchasing items and were shown on mannequins.Di Boscio, Chere. \"Timeline: The History of Haute Couture.\" Eluxe Magazine. N.p., 31 Jan. 2015. Web. 5 Feb. 2016.  In the 1800s, showings began to change. Charles Frederick Worth, noted for haute couture, began showing multiple pieces together and of a higher design. Jeanne Paquin is the first designer to make her showings public and Paul Poiret is the first to host parties after his events.McConnell, Molli. \"Paris Fashion Week: A Guide To The Iconic Event.\" The Culture Trip. N.p., n.d. Web. 29 Jan. 2016."]}, {"page": "Fashion design", "response": ["Fashion design is generally considered to have started in the 19th century with Charles Frederick Worth who was the first designer to have his label sewn into the garments that he created. Before the former draper set up his maison couture (fashion house) in Paris, clothing design and creation was handled by largely anonymous seamstresses, and high fashion descended from that worn at royal courts. Worth's success was such that he was able to dictate to his customers what they should wear, instead of following their lead as earlier dressmakers had done. The term couturier was in fact first created in order to describe him. While all articles of clothing from any time period are studied by academics as costume design, only clothing created after 1858 is considered as fashion design."]}]}}