{"wiki_id": "http://www.wikidata.org/entity/Q454424", "itemLabel": "Francis Egerton, 8th Earl of Bridgewater", "itemDescription": "British Earl (1756-1829)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Egerton,_8th_Earl_of_Bridgewater", "wikipedia_page": {"main": "Francis Henry Egerton, 8th Earl of Bridgewater,  (11 November 1756 – 11 February 1829), known as Francis Egerton until 1823, was a noted British eccentric from the Egerton family and supporter of natural theology.Egerton was a Church of England clergyman who held the rectories of Myddle (1781) and Whitchurch (1797) in Shropshire, but the duties were performed by a proxy. He succeeded his brother John in the earldom in 1823, and spent the latter part of his life in Paris. He was a fair scholar, and a zealous naturalist and antiquarian. When he died in February 1829 the earldom became extinct.", "link_mentions": [{"page": "Francis Henry Egerton", "response": ["#REDIRECT Francis Egerton, 8th Earl of Bridgewater"]}, {"page": "Bridgewater Monument", "response": ["A memorial to the Duke was considered by his successor, the 7th Earl of Bridgewater, but it was not until the death of his brother, Francis Egerton, 8th Earl of Bridgewater in 1829 that funds were made available. The 8th Earl left in his will £13,500 and instructions to build a monument to the Canal Duke."]}, {"page": "Francis Henry Egerton Bridgewater", "response": ["#REDIRECT Francis Egerton, 8th Earl of Bridgewater"]}, {"page": "Le Cuisinier Impérial", "response": ["Viard, who called himself \"Homme de Bouche\",M. Fouret, who added 850 articles to the tenth edition (1820), is described on that title page \"ex-Officier de Bouche du Roi d'Espagne\" (copy at the New York Public Library). was the chef de cuisine to Louis Philippe, comte de Ségur and Francis Egerton, 8th Earl of Bridgewater.French Cooks and Cookery, The New Monthly Magazine, 1842, p. 10-12. The cookbook appeared under various titles that reflected regime changes: with the restoration of the Bourbons it became Le Cuisinier Royal (Paris: Barba, 1817) in its ninth edition, and in 1852, in its twenty-second edition, Le Cuisinier National. The co-author Fouret appeared in editions of the 1820s. Its last edition appeared in 1875."]}, {"page": "Francis Henry Egerton, 8th Earl of Bridgewater", "response": ["#REDIRECT Francis Egerton, 8th Earl of Bridgewater"]}, {"page": "Little Gaddesden", "response": ["The church is particularly noted for the Bridgewater Chapel, built as a mausoleum for the Dukes and Earls of Bridgewater of Ashridge and their families. It is covered by a plaster ribbed vaulted ceiling with floral bosses designed by Francis Bernasconi in 1817, and contains a number of sculptured monuments to members of the Bridgewater family. Among these is a monument to the 7th Earl, John William Egerton and his wife Charlotte Catherine Anne, Countess of Bridgewater, designed by the sculptor Sir Richard Westmacott; a monument to Francis Egerton, 8th Earl of Bridgewater (d.1829). also by Westmacott, depicting a seated female accompanied by an elephant, celebrating the 'Works of the Creation'; a memorial to Elizabeth Viscountess Brackley (d.1669). and a monument to the 3rd Duke of Bridgewater, famous as the originator of British inland navigation and the Bridgewater Canal."]}, {"page": "Worsley Navigable Levels", "response": ["In 1812 the Duke of Bridgewater's heir, Francis Egerton, 8th Earl of Bridgewater, wrote a 47-page book on the underground canals entitled \"Description du Plan Incliné Souterrain\".Google eBook of Description du plan incliné souterrain"]}, {"page": "St Alkmund's Church, Whitchurch", "response": ["*1797-1829 - Francis Egerton, 8th Earl of Bridgewater"]}, {"page": "Francis Egerton", "response": ["*Francis Egerton, 8th Earl of Bridgewater (1756–1829), British eccentric, and supporter of natural theology"]}, {"page": "Barton Aqueduct", "response": ["On the day it was first tested the water was allowed to flow in, but one of the arches began to buckle under the weight. Brindley, overcome with anxiety, retired to his bed at the Bishop Blaize tavern in nearby Stretford. Gilbert, realising that Brindley had placed too much weight on the sides of the arch, removed the clay and laid layers of straw and freshly puddled clay; when the water was allowed to flow in again the masonry held firm. According to a statement by Francis Egerton, 8th Earl of Bridgewater printed in 1820, his uncle, the duke, had told him that there was a distortion of one of the arches, and that Gilbert had addressed the problem by placing  more weight on the crown of the arch and less on the haunches. The arch was then covered with straw and allowed to stand until the following spring, when the mortar was set and the arch had become stable, but its curve remained irregular."]}, {"page": "Amelia Egerton, Lady Hume", "response": ["Amelia Egerton,  daughter of John Egerton, was born on the 25 November 1751. Her brothers were the John Egerton, 7th Earl of Bridgewater and Francis Egerton, 8th Earl of Bridgewater. She was granted the rank of earl's daughter in 1805 and was subsequently known as \"Lady Amelia Hume\". She married Sir Abraham Hume in April, 1771. In 1772, Lord Hume inherited Wormleybury, an 18th century private house with a landscape park, from his father, Sir Abraham Hume, 1st Baronet, after his death in 1772. The house is located near Wormley in Broxbourne, Hertfordshire"]}, {"page": "Charlotte Egerton, Countess of Bridgewater", "response": ["On the death in 1829 of her brother-in-law, Francis Egerton, 8th Earl of Bridgewater, she inherited £5719.18s.6d. in dividends from shares in the family's shares in the Bridgewater Canal. The 8th Earl's will also made provision for a monument to be erected to his predecessor, the \"Canal Duke\". Charlotte  objected to the erection of an obelisk, which she considered to be poor taste. Sir Jeffry Wyattville, the architect who completed Ashridge House, was again appointed, and in response to the countess's objections, he designed the monumnent as a Neoclassical Doric column. At Charlotte's behest, the Bridgewater Monument was sited some distance from Ashridge House so as not to be seen.Birtchnell P, A History of Berkhamsted, 1972, Clunberry Press A brass plaque inside the monument records that it was erected \"with the approbation of Charlotte C. Anne, Countess of Bridgewater\"."]}]}}