{"wiki_id": "http://www.wikidata.org/entity/Q454074", "itemLabel": "Louise Leakey", "itemDescription": "Kenyan paleontologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Leakey", "wikipedia_page": {"main": "Princess Louise de Merode  (née Leakey, born 21 March 1972) is a Kenyan paleontologist and anthropologist. She conducts research and field work on human fossils in Eastern Africa.\n\n", "link_mentions": [{"page": "Kenyanthropus", "response": ["In 2003, American palaeoanthropologist Tim D. White was concerned that KNM-WT 40000 was far too distorted to obtain any accurate metrics for classification purposes, especially because the skull was splintered into over 1,100 pieces often measuring less than  across. Because such damage is rarely even seen, he argues that it cannot be reliably reconstructed. Because the skulls of modern ape species vary widely, he suggested further fossil discoveries in the region may prove the Lomekwi hominins to be a local variant of A. afarensis rather than a distinct genus or species. In response, anthropologist Fred Spoor and Meave and Louise Leakey produced much more detailed digital topographical scans of the KNM-WT 40000 maxilla in 2010, permitting the comparison of many more anatomical landmarks on the maxillae of all other early hominins, modern humans, chimps, and gorillas, in order to more accurately correct the distortion. The new reconstruction more convincingly verifies the distinctness of Kenyanthropus."]}, {"page": "Richard Leakey", "response": ["Richard shifted away from palaeontology in 1989, but his wife Meave Leakey and daughter Louise Leakey continue to conduct palaeontological research in Northern Kenya."]}, {"page": "List of Kenyans", "response": ["*Louise Leakey"]}, {"page": "Atlantic College", "response": ["*Louise Leakey (1972–), palaeontologist"]}, {"page": "Meave Leakey", "response": ["Leakey was married to Richard Leakey, a palaeontologist. They have two children, Louise (born 1972) and Samira (born 1974). Louise Leakey continues family traditions by conducting palaeontological research."]}, {"page": "Leakey (surname)", "response": ["*Louise Leakey (born 1972), Kenyan paleontologist"]}, {"page": "Koobi Fora", "response": ["Consequently, the government of Kenya in 1973 reserved the region as Sibiloi National Park, establishing a headquarters for the National Museums of Kenya on Koobi Fora Spit. The reserve is well-maintained and is well-guarded by friendly but armed park police. Protection of sites and especially of wildlife are of prime concern. Exploration and excavation continue under the auspices of the Koobi Fora Research Project (KFRP), which collaborates with a number of interested universities and individuals across the world.For more information, refer to the KFRP Journal site currently being maintained by Louise Leakey. One notable collaboration is the Koobi Fora Field School  conducted yearly by Rutgers University, which combines education and research."]}, {"page": "Brookhouse School", "response": ["*Dr. Louise Leakey, palaeontologist, educator and lecturer"]}, {"page": "Emmanuel de Merode", "response": ["Merode married Louise Leakey in 2003, a paleontologist from Kenya. They have two daughters:"]}, {"page": "House of Merode", "response": ["*Prince Emmanuel de Merode, noted conservationist, Director of the Virunga National Park in the Congo; married to Kenyan paleontologist Louise Leakey."]}, {"page": "List of British scientists", "response": ["* Louise Leakey (born 1972), paleontologist"]}, {"page": "List of paleontologists", "response": ["* Louise Leakey (Kenya, 1972- )"]}, {"page": "Leakey family", "response": ["*Louise Leakey (born 1972), paleontologist; daughter of Meave and Richard Leakey, married to Prince Emmanuel de Merode."]}, {"page": "Artec 3D", "response": ["* Fossil remains of a 1.8 million-year-old crocodile, elephant and giant tortoise at the Turkana Basin in northern Kenya by the Turkana Basin Institute and Louise Leakey;"]}, {"page": "List of women anthropologists", "response": ["| Louise Leakey"]}, {"page": "Jack Daulton", "response": ["Daulton and his partner Roz Ho have also provided financial support to paleoanthropological research and exploration undertaken by the Institute of Human Origins (Donald Johanson, founding director), Arizona State University, where Daulton is on the Research Council, and at the Turkana Basin Institute (Louise Leakey, director), Stony Brook University.http://www.turkanabasin.org/wp-content/uploads/2016/02/TBI-eBook.pdf  In addition, Daulton has provided significant funding to the Last Mile Technology Program (photographer Chris Rainier, director), supplying indigenous groups with modern technology to document their traditional culture."]}, {"page": "Louise N. Leakey", "response": ["#REDIRECT: Louise Leakey"]}, {"page": "List of Kenyan European people", "response": ["*Louise Leakey – artist, writer and archaeologist "]}]}}