{"wiki_id": "http://www.wikidata.org/entity/Q454117", "itemLabel": "Thomas Cavalier-Smith", "itemDescription": "British biologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Cavalier-Smith", "wikipedia_page": {"main": "Thomas (Tom) Cavalier-Smith, FRS, FRSC, NERC Professorial Fellow (21 October 1942 - 19 March 2021), was a Professor of Evolutionary Biology in the Department of Zoology, at the University of Oxford. His research has led to discovery of a number of unicellular organisms (protists) and advocated for a variety of major taxonomic groups, such as the  Chromista, Chromalveolata, Opisthokonta, Rhizaria, and Excavata. He was known for his systems of classification of all organisms.", "link_mentions": [{"page": "Bryozoa", "response": ["However, two well-known zoologists, Claus Nielsen and Thomas Cavalier-Smith, maintain on anatomical and developmental grounds that bryozoans and entoprocts are member of the same phylum, Bryozoa. A molecular phylogeny study in 2007 also supported this old idea, while its conclusions about other phyla agreed with those of several other analyses."]}, {"page": "Euglenozoa", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Percolozoa", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Taxonomy (biology)", "response": ["Thomas Cavalier-Smith, who published extensively on the classification of protists, recently proposed that the Neomura, the clade that groups together the Archaea and Eucarya, would have evolved from Bacteria, more precisely from Actinobacteria. His 2004 classification treated the archaeobacteria as part of a subkingdom of the kingdom Bacteria, i.e., he rejected the three-domain system entirely. Stefan Luketa in 2012 proposed a five \"dominion\" system, adding Prionobiota (acellular and without nucleic acid) and Virusobiota (acellular but with nucleic acid) to the traditional three domains."]}, {"page": "Chaetognatha", "response": ["Chaetognaths are traditionally classed as deuterostomes by embryologists. Lynn Margulis and K. V. Schwartz place chaetognaths in the deuterostomes in their Five Kingdom classification.Systema Naturae 2000 Taxon: Phylum Chaetognatha per Margulis and Schwartz  (select Margulis & Schwartz in 'Classification by')—last retrieved November 25, 2006 Molecular phylogenists, however, consider them to be protostomes. Thomas Cavalier-Smith places them in the protostomes in his Six Kingdom classification.Systema Naturae 2000 Taxon: Phylum Chaetognatha per Cavalier-Smith  (select Cavalier-Smith in 'Classification by')—last retrieved November 25, 2006 The similarities between chaetognaths and nematodes mentioned above may support the protostome thesis—in fact, chaetognaths are sometimes regarded as a basal ecdysozoan or lophotrochozoan. Chaetognatha appears close to the base of the protostome tree in most studies of their molecular phylogeny. This may explain their deuterostome embryonic characters. If chaetognaths branched off from the protostomes before they evolved their distinctive protostome embryonic characters, they might have retained deuterostome characters inherited from early bilaterian ancestors. Thus chaetognaths may be a useful model for the ancestral bilaterian."]}, {"page": "Kingdom (biology)", "response": ["In 1977, Carl Woese and colleagues proposed the fundamental subdivision of the prokaryotes into the Eubacteria (later called the Bacteria) and Archaebacteria (later called the Archaea), based on ribosomal RNA structure; this would later lead to the proposal of three \"domains\" of life, of Bacteria, Archaea, and Eukaryota. Combined with the five-kingdom model, this created a six-kingdom model, where the kingdom Monera is replaced by the kingdoms Bacteria and Archaea. This six-kingdom model is commonly used in recent US high school biology textbooks, but has received criticism for compromising the current scientific consensus. But the division of prokaryotes into two kingdoms remains in use with the recent seven kingdoms scheme of Thomas Cavalier-Smith, although it primarily differs in that Protista is replaced by Protozoa and Chromista.", "Thomas Cavalier-Smith supported the consensus at that time, that the difference between Eubacteria and Archaebacteria was so great (particularly considering the genetic distance of ribosomal genes) that the prokaryotes needed to be separated into two different kingdoms. He then divided Eubacteria into two subkingdoms: Negibacteria (Gram negative bacteria) and Posibacteria (Gram positive bacteria). Technological advances in electron microscopy allowed the separation of the Chromista from the Plantae kingdom. Indeed, the chloroplast of the chromists is located in the lumen of the endoplasmic reticulum instead of in the cytosol. Moreover, only chromists contain chlorophyll c. Since then, many non-photosynthetic phyla of protists, thought to have secondarily lost their chloroplasts, were integrated into the kingdom Chromista."]}, {"page": "Alveolate", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Cryptomonad", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Three-domain system", "response": ["Parts of the three-domain theory have been challenged by scientists including Ernst Mayr, Thomas Cavalier-Smith, and Radhey S. Gupta.  In particular, Gupta argues that the primary division within prokaryotes should be among those surrounded by a single membrane (monoderm), including gram-positive bacteria and archaebacteria, and those with an inner and outer cell membrane (diderm), including gram-negative bacteria.  He claims that sequences of features and phylogenies from some highly conserved proteins are inconsistent with the three-domain theory, and that it should be abandoned despite its widespread acceptance."]}, {"page": "Radiolaria", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Excavata", "response": ["Excavata is a major supergroup of unicellular organisms belonging to the domain Eukaryota. It was first suggested by Simpson and Patterson in 1999 and introduced by Thomas Cavalier-Smith in 2002 as a formal taxon. It contains a variety of free-living and symbiotic forms, and also includes some important parasites of humans, including Giardia and Trichomonas. Excavates were formerly considered to be included in the now obsolete Protista kingdom. They are classified based on their flagellar structures, and they are considered to be the most basal Flagellate lineage. Phylogenomic analyses split the members of the Excavates into three different and not all closely related groups: Discobids, Metamonads and Malawimonads. Except for Euglenozoa, they are all non-photosynthetic.", "Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Heliomonadida", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Chromista", "response": ["Chromista as a biological kingdom was created by British biologist Thomas Cavalier-Smith in 1981 to differentiate some protists from typical protozoans and plants. According to Cavalier-Smith, the kingdom originally included only algae, but his later analysis indicated that many protozoa also belong to the new group. As of 2018, the kingdom is as diverse as kingdoms Plantae and Animalia, consisting of eight phyla. Notable members include marine algae, potato blight, dinoflagellates, Paramecium, brain parasite (Toxoplasma) and malarial parasite (Plasmodium)."]}, {"page": "Heterokont", "response": ["Thomas Cavalier-Smith treats the heterokonts as identical in composition with the stramenopiles; this is the definition followed here. He has proposed placing them in a separate kingdom, the Chromalveolata, together with the haptophytes, cryptomonads, and alveolates. This is one of the most common revisions to the five-kingdom system, but has not been adopted, because Chromalveolata is not a monophyletic group. A few treat the Chromalveolata as identical in composition with the heterokonts, or list them as a kingdom Stramenopila."]}, {"page": "Cercozoa", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Amoebozoa", "response": ["Strong similarities between Amoebozoa and Opisthokonts lead to the hypothesis that they form a distinct clade. Thomas Cavalier-Smith proposed the name \"unikonts\" (formally, Unikonta) for this branch, whose members were believed to have been descended from a common ancestor possessing a single emergent flagellum rooted in one basal body.[1][2]  However, while the close relationship between Amoebozoa and Opisthokonta is robustly supported, recent work has shown that the hypothesis of a uniciliate ancestor is probably false. In their Revised Classification of Eukaryotes (2012), Adl et al. proposed Amorphea as a more suitable name for a clade of approximately the same composition, a sister group to the Diaphoretickes.  More recent work places the members of Amorphea together with the malawimonids and collodictyonids in a proposed clade called Opimoda, which comprises one of two major lineages diverging at the root of the eukaryote tree of life, the other being Diphoda."]}, {"page": "Opisthokont", "response": ["The close relationship between animals and fungi was suggested by Thomas Cavalier-Smith in 1987, who used the informal name opisthokonta (the formal name has been used for the chytrids by Copeland in 1956), and was supported by later genetic studies."]}, {"page": "Evolution of sexual reproduction", "response": ["An alternative theory, proposed by Thomas Cavalier-Smith, was labeled the Neomuran revolution. The designation \"Neomuran revolution\" refers to the appearances of the common ancestors of eukaryotes and archaea. Cavalier-Smith proposes that the first neomurans emerged 850 million years ago. Other molecular biologists assume that this group appeared much earlier, but Cavalier-Smith dismisses these claims because they are based on the \"theoretically and empirically\" unsound model of molecular clocks. Cavalier-Smith's theory of the Neomuran revolution has implications for the evolutionary history of the cellular machinery for recombination and sex. It suggests that this machinery evolved in two distinct bouts separated by a long period of stasis; first the appearance of recombination machinery in a bacterial ancestor which was maintained for 3 Gy, until the neomuran revolution when the mechanics were adapted to the presence of nucleosomes. The archaeal products of the revolution maintained recombination machinery that was essentially bacterial, whereas the eukaryotic products broke with this bacterial continuity. They introduced cell fusion and ploidy cycles into cell life histories. Cavalier-Smith argues that both bouts of mechanical evolution were motivated by similar selective forces: the need for accurate DNA replication without loss of viability."]}, {"page": "Radiata", "response": ["In the early 19th century, Georges Cuvier united Ctenophora and Cnidaria in the Radiata (Zoophytes). Thomas Cavalier-Smith, in 1983, redefined Radiata as a subkingdom consisting of Myxozoa, Placozoa, Cnidaria and Ctenophora. Lynn Margulis and K. V. Schwartz later redefined Radiata in their Five Kingdom classification, this time including only Cnidaria and Ctenophora. This definition is similar to the historical descriptor Coelenterata, which has also been proposed as a group encompassing Cnidaria and Ctenophora."]}, {"page": "Archezoa", "response": ["Archezoa was a kingdom proposed by Thomas Cavalier-Smith (1942–2021 AD) in the 20th century, and was believed to encompass eukaryotes which did not have mitochondria (and are therefore \"amitochondriate\") or peroxisomes. This taxonomic category was proposed upon the discovery that some protists lacked mitochondria, which suggested to Cavalier-Smith that the initial ancestor of eukaryotes emerged prior to the endosymbiosis of mitochondria. Eukaryotes that eventually inducted a mitochondria were placed in a taxonomic group which Cavalier-Smith called the Metakaryota, whereas the Archezoa represented a paraphyletic group representing primitive eukaryotes which evolved prior to the acquisition of mitochondria. Furthermore, the Archezoa kingdom was divided into four phyla. "]}, {"page": "Rhizaria", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Last universal common ancestor", "response": ["The most commonly accepted tree of life, based on several molecular studies, has its root between a monophyletic domain Bacteria and a clade formed by Archaea and Eukaryota. However, a very small minority of studies place the root in the domain Bacteria, in the phylum Firmicutes, or state that the phylum Chloroflexi is basal to a clade with Archaea and Eukaryotes and the rest of Bacteria (as proposed by Thomas Cavalier-Smith)."]}, {"page": "Platyzoa", "response": ["The paraphyletic \"Platyzoa\"  are a group of protostome unsegmented animals proposed by Thomas Cavalier-Smith in 1998. Cavalier-Smith included in Platyzoa the phylum Platyhelminthes (or flatworms), and a new phylum, the Acanthognatha, into which he gathered several previously described phyla of microscopic animals. More recently it has been described as paraphyletic, containing the Rouphozoa and the Gnathifera."]}, {"page": "Two-empire system", "response": ["Some prominent scientists, such as the late Thomas Cavalier-Smith, still hold and held to the two-empire system.  The late Ernst Mayr, one of the 20th century's leading evolutionary biologists, wrote dismissively of the three-domain system, \"I cannot see any merit at all in a three empire cladification.\"  Additionally, the scientist Radhey Gupta argues for a return to the two-empire system, claiming that the primary division within prokaryotes should be among those surrounded by a single membrane (monoderm), including gram-positive bacteria and archaebacteria, and those with an inner and outer cell membrane (diderm), including gram-negative bacteria."]}, {"page": "Amorphea", "response": ["Amorphea are members of a taxonomic supergroup that includes the basal Amoebozoa and Obazoa. That latter contains the Opisthokonta, which includes the Fungi, Animals and the Choanomonada, or Choanoflagellates. The taxonomic affinities of the members of this clade were originally described and proposed by Thomas Cavalier-Smith in 2002."]}, {"page": "Bikont", "response": ["Category:Taxa named by Thomas Cavalier-Smith"]}, {"page": "Coelenterata", "response": ["Complicating the issue is the 1997 work of Lynn Margulis (revising an earlier model by Thomas Cavalier-Smith) that placed the Cnidaria and Ctenophora alone in the branch Radiata within Eumetazoa.Margulis, Lynn and Karlene V. Schwartz, 1997, Five Kingdoms: An Illustrated Guide to the Phyla of Life on Earth, W.H. Freeman & Company,  (The latter refers to all the animals except the sponges, Trichoplax, and the still poorly understood Mesozoa). Neither grouping is accepted universally, however, both are commonly encountered in taxonomic literature."]}, {"page": "Linnean Medal", "response": ["*2007:  and Thomas Cavalier-Smith"]}]}}