{"wiki_id": "http://www.wikidata.org/entity/Q455072", "itemLabel": "Kate Sheppard", "itemDescription": "prominent member of New Zealand's women's suffrage", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Sheppard", "wikipedia_page": {"main": "Katherine Wilson Sheppard (née Catherine Wilson Malcolm; 10 March 1848 – 13 July 1934) was the most prominent member of the women's suffrage movement in New Zealand and the country's most famous suffragist. Born in Liverpool, England, she emigrated to New Zealand with her family in 1868. There she became an active member of various religious and social organisations, including the Women's Christian Temperance Union New Zealand (WCTU NZ). In 1887 she was appointed the WCTU NZ's National Superintendent for Franchise and Legislation, a position she used to advance the cause of women's suffrage in New Zealand. \nKate Sheppard promoted women's suffrage by organising petitions and public meetings, by writing letters to the press, and by developing contacts with politicians. She was the editor of The White Ribbon, the first woman-operated newspaper in New Zealand. Through her skilful writing and persuasive public speaking, she successfully advocated women's suffrage. Her pamphlets Ten Reasons Why the Women of New Zealand Should Vote and Should Women Vote? contributed to the cause. This work culminated in a petition with 30,000 signatures calling for women's suffrage that was presented to parliament, and the successful extension of the franchise to women in 1893. As a result, New Zealand became the first country to establish universal suffrage.\nSheppard was the first president of the National Council of Women of New Zealand, founded in 1896, and helped reform the organisation in 1918. In later life, she travelled to Britain and assisted the suffrage movement there. With failing health, she returned to New Zealand, after which she continued to be involved in writing on women's rights, although she became less politically active. She died in 1934, leaving no descendants. \nSheppard is considered to be an important figure in New Zealand's history. A memorial to her exists in Christchurch. Her portrait replaced that of Queen Elizabeth II on the front of the New Zealand ten-dollar note in 1991.", "link_mentions": {}}}