{"wiki_id": "http://www.wikidata.org/entity/Q456650", "itemLabel": "Fiona Hall", "itemDescription": "British politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Fiona_Hall_(politician)", "wikipedia_page": {"main": "Fiona Jane Hall MBE (née Cutts; born 15 July 1955 in Swinton, Lancashire) is a British politician who was a Member of the European Parliament (MEP) for North East England. She served as leader of the Liberal Democrats in the European Parliament from 2009 to 2014. She was elected to the European Parliament in 2004, and re-elected in 2009, coming in third behind Labour and Conservative candidates with 17% of the vote, the highest of any UK Liberal Democrat candidate.Hall attended Worsley Wardley Grammar School and Eccles College. She went on to study at St Hugh's College, Oxford, and graduated with a degree in Modern Languages. She worked part-time as a teacher after moving to Northumberland, where she campaigned against nuclear power in the early 1990s.Hall began working as a political officer for the Liberal Democrats in 1997 and was a parliamentary researcher two years later. Hall was an Organization for Security and Co-operation in Europe polling station supervisor in Kosovo in 2001 following the 1999 NATO bombing of Yugoslavia.Hall led the European Union's observer mission in Togo during the October 2007 Togolese parliamentary election. She has been vice-president of the European Forum for Renewable Energy Sources since 2008, and is a member of the group MEPs Against Cancer.Hall was appointed a Member of the Order of the British Empire (MBE) in the 2013 New Year Honours List for public and political service.", "link_mentions": [{"page": "Godfrey Bloom", "response": ["On 24 November 2010, Bloom was ejected from the European Parliament after directing a Nazi slogan at German MEP Martin Schulz who was speaking in a debate on the economic crisis in Ireland. Bloom interrupted Schulz and shouted \"Ein Volk, ein Reich, ein Führer\" at him. He then proceeded to call the latter \"an undemocratic fascist\", a remark for which he was removed from the chamber. Labour MEP group leader Glenis Willmott described his behavior as \"an insult to all those who have fought against fascism\" whilst Liberal Democrat group leader Fiona Hall described him as a \"national embarrassment\"."]}, {"page": "List of members of the European Parliament (2004–2009)", "response": ["|Fiona Hall||United Kingdom||North East England||Lib Dem||ALDE"]}, {"page": "North East England (European Parliament constituency)", "response": ["| colspan = 3 | Fiona HallLiberal Democrat"]}, {"page": "2006 Liberal Democrats leadership election", "response": ["*MEPs: Chris Davies, Andrew Duff, Fiona Hall, Sajjad Karim, Baroness Ludford (see above), Baroness Nicholson of Winterbourne (see above), Diana Wallis, Graham Watson"]}, {"page": "Fiona Hall (artist)", "response": ["The 1980s saw Hall establishing a significant artistic profile for herself through involvement in several solo and group exhibitions across Australia. As part of her study, Hall returned to Australia in 1981 to live as the artist-in-residence at the Tasmanian School of Art with the support of a grant from the Visual Arts Board of the Australia Council. There, she created The Antipodean Suite with objects such as banana peel and power cords, an early demonstration of a consistent theme in her work, \"the transformation of the everyday... into creations of imaginative beauty.\" Also in 1981, five photographs by Fiona Hall were acquired by the Art Gallery of New South Wales, the first of her works to enter a public collection. Hall graduated with a MFA in 1982, and in the same year participated in the Biennale of Sydney.", "Between June and October 1991, Hall was Artist in Residence at Philip Institute of Technology in Preston, Victoria. For four months over 1992–1993, the National Gallery of Australia hosted an exhibition of Hall's work titled The Garden of Earthly Delights: The Art of Fiona Hall, which included \"early field photographs, a sampling from several series of studio photographs, as well as sculpture and ceramics.\" In the late 1990s, Hall stopped working in the medium of photography, and the photograph of her father, incorporated into her 1996 large-scale installation Give a Dog a Bone, was the last that she exhibited.", "* 1997 - Fiona Hall : Canberra projects ", "* 2007 - Fiona Hall : force field ", "*2011 - Fiona Hall : When My Boat Comes In", "* Works by Fiona Hall in the National Gallery of Australia", "* Works by Fiona Hall in the Art Gallery of NSW", "* Works by Fiona Hall in the Museum of Contemporary Art, Australia", "* Works by Fiona Hall in the Art Gallery of South Australia", "* Works by Fiona Hall in the National Gallery of Victoria", "* Works by Fiona Hall in the Queensland Art Gallery | Gallery of Modern Art"]}, {"page": "2007 Togolese parliamentary election", "response": ["EU observers began to deploy in Togo on September 18, beginning with 18 observers.\"Les premiers observateurs européens se déploient\", Republicoftogo.com, September 19, 2007 . These 18 \"long-term\" observers were subsequently joined by 62 \"short-term\" observers who arrived on October 6, including the head of the observer mission, Fiona Hall.\"Fiona Hall bien entourée\", Republicoftogo.com, October 8, 2007 . On October 11, six Members of the European Parliament—Valdis Dombrovskis, Patrick Gaubert, Horst Posdorf, Marie-Arlette Carlotti, Neena Gill, and Johan Van Hecke—also arrived to play a part in the observation mission.\"Arrivée à Lomé des députés européens\" , Republicoftogo.com, October 11, 2007 . European Union aid to Togo had been suspended since 1993, and the resumption of EU aid was said to depend on whether the 2007 elections were deemed \"free and transparent\". There were expected to be about 3,500 observers in total, both from Togo and abroad; aside from the EU, other organizations that intended to have observers in place included La Francophonie and the African Union.\"Grandes manoeuvres\", Republicoftogo.com, September 25, 2007 ."]}, {"page": "Fiona Hall", "response": ["Fiona Hall may refer to:", "* Fiona Hall (artist) (born 1953), Australian artist", "* Fiona Hall (politician) (born 1955), British member of the European Parliament"]}, {"page": "Liberal Democrats (UK)", "response": ["* Fiona Hall, 2009–2014"]}, {"page": "Fiona Hall MEP", "response": ["#REDIRECT Fiona Hall (politician)"]}, {"page": "List of members of the European Parliament (2009–2014)", "response": ["#Fiona Hall"]}, {"page": "Fiona Cutts", "response": ["#REDIRECT Fiona Hall (politician)"]}, {"page": "Worsley Wardley Grammar School", "response": ["* Fiona Hall Lib Dem MEP for North East England since 2004"]}, {"page": "2014 European Parliament election in the United Kingdom", "response": ["* Fiona Hall (North East England)"]}, {"page": "2013 New Year Honours", "response": ["* Fiona Hall  – Member of the European Parliament for North East England and leader, Liberal Democrat MEPs. For public and political service."]}, {"page": "2015 Liberal Democrats leadership election", "response": ["* Former MEPs: Fiona Hall."]}, {"page": "2019 European Parliament election in the United Kingdom", "response": ["The Liberal Democrats announced their selected candidates for England and Wales on 17 April 2019 following a membership vote. The party's sole incumbent MEP, Catherine Bearder, was re-selected as its lead candidate for South East England, while former MEPs Chris Davies, Fiona Hall, Bill Newton Dunn and Phil Bennion were selected as lead candidates for their respective regions. Other candidates included in London the entrepreneur Dinesh Dhamija and the former leader of the People's Alliance of Tower Hamlets, Rabina Khan, and former MPs Martin Horwood and Stephen Williams in the South West. The party also stood a full slate in Scotland."]}, {"page": "2019 North of Tyne mayoral election", "response": ["The Liberal Democrats selected former Newcastle Councillor John Appleby to be their candidate. Other people who were discussed as potential candidates included David Faulkner, the former leader of Newcastle City Council, Fiona Hall, a former MEP for North East England, former council group leader Anita Lower, former parliamentary candidate Julie Pörksen and councillor Greg Stone."]}]}}