{"wiki_id": "http://www.wikidata.org/entity/Q456957", "itemLabel": "V V Brown", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/V_V_Brown", "wikipedia_page": {"main": "Vanessa Brown (born 24 October 1983), known professionally as VV Brown, is a British indie pop singer-songwriter, model and record producer.", "link_mentions": [{"page": "1983", "response": ["** V V Brown, English singer, songwriter, model, and producer"]}, {"page": "Marks & Spencer", "response": ["M&S has always run newspaper and/or magazine advertisements since the early 1950s, but the introduction of some famous stars such as Twiggy and David Jason in various TV ads has helped raise the company's profile. Twiggy first appeared in 1967, returning later in 1995 and 2005. Anne Grierson first featured in advertisements during the late 1950s and most of the 1960s. In later years, Erin O'Connor, Myleene Klass, David Beckham, Antonio Banderas, Claudia Schiffer, Helena Christensen, Tatjana Patitz, Lisa Snowdon, Dannii Minogue, V V Brown and Carmen Kass have also featured in a few advertisements, along with many others. John Sergeant, David Jason and Joanna Lumley have either appeared in or voiced over advertisements since 2008."]}, {"page": "Amy Winehouse", "response": ["After the release of Back to Black, record companies sought out female artists with a similar sound and fearless and experimental female musicians in general. Adele and Duffy were the second wave of artists with a sound similar to Winehouse's. A third wave of female musicians that has emerged since the album was released are led by V V Brown, Florence and the Machine, La Roux and Little Boots. In March 2011, the New York Daily News ran an article attributing the continuing wave of British female artists that have been successful in the United States to Winehouse and her absence. Spin magazine music editor Charles Aaron was quoted as saying \"Amy Winehouse was the Nirvana moment for all these women,\" \"They can all be traced back to her in terms of attitude, musical styles or fashion.\" According to Keith Caulfield, chart manager for Billboard, \"Because of Amy, or the lack thereof, the marketplace was able to get singers like Adele, Estelle and Duffy,\" \"Now those ladies have brought on the new ones, like Eliza Doolittle, Rumer and Ellie.\""]}, {"page": "Alain Whyte", "response": ["* V V Brown – \"10 Ft. Tall\""]}, {"page": "Degrassi", "response": ["On January 15, 2009, Program Partners, a subsidiary of Sony Pictures Television, announced that they had acquired the syndication rights to the show, which started showing daily on local stations in the United States during the early evening fringe hours (between 5 and 7 pm) in September 2009. One of the reasons of the program's sale in syndication is that its programming content complies with federal E/I programming requirements. During the show's ninth season, the producers were informed in a meeting with CTV executives that the network did not plan to renew the show. At the same time, Stephen Stohn was in talks with TeenNick to produce 48 episodes of a telenovela-style teen show, which he later pitched as the tenth season of Degrassi: The Next Generation. To promote the series on the new network, TeenNick commissioned a promotional music video, set to \"Shark in the Water\" by V V Brown and themed around a carnival and circus, which contained clues foreshadowing later events of the season. The promo was extremely successful. According to Stephen Stohn, MuchMusic, the network that the series moved to from CTV in Canada, cited the promo as having improved the network's ratings significantly."]}, {"page": "Kele Okereke", "response": ["*\"Faith\" with V V Brown (2014)"]}, {"page": "Pascal Gabriel", "response": ["*V V Brown - Co-wrote and produced \"The Apple\" from her 2013 album Samson & Delilah."]}, {"page": "Glastonbury Festival line-ups", "response": ["* V V Brown", "* V V Brown"]}, {"page": "List of female rock singers", "response": ["* V V Brown"]}, {"page": "Back to Black", "response": ["After the release of Back to Black, record companies sought out more experimental female artists. Other female artists signed to major labels included Adele, Duffy, V V Brown, Florence and the Machine, La Roux and Little Boots. In the years after Back to Black was released, Dan Cairns of The Sunday Times noted that there was a \"notion [by A&R executives, radio playlisters and the public] that women are the driving commercial force in pop\". In March 2011, the New York Daily News ran an article attributing the continuing wave of British female artists that have been successful in the United States to Winehouse and her absence. Spin magazine music editor Charles Aaron was quoted as saying, \"Amy Winehouse was the Nirvana moment for all these women [...] They can all be traced back to her in terms of attitude, musical styles or fashion.\" According to Keith Caulfield, chart manager for Billboard, \"Because of Amy, or the lack thereof, the marketplace was able to get singers like Adele, Estelle and Duffy [...] Now those ladies have brought on the new ones, like Eliza Doolittle, Rumer and Ellie [Goulding].\" Linda Barnard of The Toronto Star finds Winehouse to be amongst \"the British women who claimed chart-topping ownership [...] with powerful voices\" and that her \"impressive\" five Grammy wins for Back to Black put her at the \"pinnacle of pop music\". In 2020, Rolling Stone ranked the album at number 33 on its list of The 500 Greatest Albums of All Time. The album was also included in the book 1001 Albums You Must Hear Before You Die. In a retrospective review for Rolling Stone in 2010, Douglas Wolk gave the album four-and-a-half out of five stars and referred to it as \"an unlikely marvel, a desperately sad and stirring record whose hooks and production (by Remi and Mark Ronson) are worthy of the soul hall-of-famers she namedrops—'Tears Dry on Their Own' is basically 'Ain't No Mountain High Enough' recast as self-recrimination\". In a 2019 poll of music writers conducted by The Guardian, \"Back to Black\" placed first in a ranking of the best albums of the 21st Century."]}, {"page": "2008 in music", "response": ["|V V Brown"]}, {"page": "List of Island Records artists", "response": ["* V V Brown"]}, {"page": "Denial (Sugababes song)", "response": ["\"Denial\" is a song by English girl group Sugababes from their fifth studio album, Change (2007). Coinciding with the commencement of the group's 2008 Change Tour, it was released on 10 March 2008 as the album's third and final single. V V Brown wrote \"Denial\" for the band while she was on London Underground's Victoria line, and attempted to \"get into their mindsets\" in the process. The Sugababes and the song's producers, Flex Turner and Elliot Malloy, co-wrote it. Composed of staccato verses, a harmonious chorus and a solo middle eight, \"Denial\" is an pop rock and disco song that samples \"Standing in the Way of Control\" by the Gossip.", "English singer and songwriter V V Brown wrote \"Denial\" while she was on London Underground's Victoria line. Brown told Metro that songs she writes for enjoyment come spontaneously to her. She composed \"Denial\" specifically for the Sugababes, and attempted to \"get into their mindsets\" in the process. The song was submitted to the group and received by their management; the band enjoyed the song and subsequently recorded it for their fifth studio album Change. Brown described its transferral to the band as \"validation that I'd truly found who I am in both territories as a song writer, as a producer, as a writer and as an artist\".", "Category:Songs written by V V Brown"]}, {"page": "Sound of...", "response": ["| V V Brown"]}, {"page": "Ameris Bank Amphitheatre", "response": ["|align=\"center\"|Kris Allen & V V Brown"]}, {"page": "Glastonbury Festival 2009", "response": ["Bruce Springsteen & the E Street BandKasabianCrosby, Stills and NashDizzee RascalSpinal TapEagles of Death MetalTinariwenV V Brown||", "DovesJamie TJack PeñateLittle BootsMetronomyV V BrownThe VirginsFucked UpThe Rumble StripsDan BlackGeneral Fiasco", "Calvin HarrisMr. ScruffV V BrownRob da BankFrankmusikWonky Pop DJsKissy Sell OutWonky Pop DJsOu EstChris Coco"]}, {"page": "V v brown", "response": ["#REDIRECT V V Brown "]}, {"page": "Leave!", "response": ["\"Leave!\" is a song by English recording artist V V Brown from her debut studio album Travelling Like the Light. It was released on March 2, 2009 as the album's second single and was accompanied by a music video. This single, like her debut single \"Crying Blood\" failed to reach the charts.", "Category:V V Brown songs", "Category:Songs written by V V Brown"]}, {"page": "Travelling Like the Light", "response": ["Travelling Like the Light is the debut studio album by English musician V V Brown, released on 13 July 2009 by Island Records. Initially released in the United Kingdom, the album was digitally released in the United States on 2 February 2010 and was physically released on 20 April 2010. Brown was inspired by an unsuccessful romantic relationship when writing most of the album. Despite some mixed criticism towards its eclectic musical style, the album received generally positive reviews from most music critics.", "* V V Brown – performer, producer", "|align=\"left\"|UK Albums ChartAllen, Gavin. V V Brown says Duffy fell into the trap she avoided. WalesOnline. Retrieved on 2010-02-19.", "* V V Brown interview at The Observer", "Category:V V Brown albums"]}, {"page": "Shark in the Water", "response": ["\"Shark in the Water\" is a song recorded by English singer-songwriter V V Brown for her debut studio album Travelling Like the Light. It was released on 6 July 2009 by Island Records as the album's third single. The song is a metaphorical record about anxiety, and was inspired by Brown's experience with infidelity by a past boyfriend who liked to stalk her in his free time. The song is her first single to get high airplay on U.S. music channels and radio (neither \"Leave!\" nor \"Crying Blood\" were able to achieve this). The song was also re-recorded in the Simlish language of The Sims and is featured in The Sims 3: Ambitions. The song is her first single to chart in the U.S. on Billboard Hot 100 peaking at number sixty-seven. The song was certified Gold in the US.", "Category:V V Brown songs", "Category:Songs written by V V Brown"]}, {"page": "Geeki", "response": ["#REDIRECT V V Brown"]}, {"page": "Little Boots discography", "response": ["| V V Brown"]}, {"page": "V.V. Brown", "response": ["#REDIRECT V V Brown"]}, {"page": "Crying Blood", "response": ["\"Crying Blood\" is the debut single by singer V V Brown (also known by her writing alias Geeki). It was released on 3 November 2008 and was accompanied by a music video. The song did not chart as it was not eligible to do so. It was released as a limited release on Digital download and 7-inch vinyl.", "Category:V V Brown songs", "Category:Songs written by V V Brown"]}, {"page": "I Got Soul", "response": ["* V V Brown"]}, {"page": "PS22 Chorus", "response": ["* The children are visited by artist V V Brown who performs several songs with the chorus. (November 16, 2011)"]}, {"page": "The Invisible Men", "response": ["| rowspan=\"2\" | V V Brown || Game Over "]}, {"page": "List of The Late Late Show with Craig Ferguson episodes", "response": ["|V V Brown sings \"Shark in the Water\""]}, {"page": "Family Ties (The Vampire Diaries)", "response": ["*\"Back in Time\" by V V Brown"]}, {"page": "V. V. Brown", "response": ["#REDIRECT V V Brown"]}, {"page": "A Turtle's Tale: Sammy's Adventures", "response": ["Music for the film was composed by Ramin Djawadi. American pop singer Bruno Mars contributed several songs to the film, including his hit singles \"Count On Me\" and \"Talking to the Moon\". Michael Jackson's cover of \"Ain't No Sunshine\" contributed to Sammy's Adventures after his adventure was done. Other songs can also be heard in the film, including \"Free\" by Donavon Frankenreiter, \"Happy People\" by Dry Spells, \"Love Today\" by Mika, \"Star Jingle Bells\" performed and arranged by Justin Lavallee, \"California Dreamin'\" by The Mamas & the Papas, \"Love Will Find a Way\" by Mishon, \"You're Not Alone\" by Self, and \"Shark in the Water\" by V V Brown."]}, {"page": "Just Dance 2", "response": ["| \"Crying Blood\" (DLC) || V V Brown || 2008"]}, {"page": "Small Sacrifices (House)", "response": ["*\"Shark in the Water\" by V V Brown"]}, {"page": "Rockcorps", "response": ["In 2009, Orange RockCorps returned to London, and also launched in Manchester, UK. The Manchester gig took place on July 13 at the Manchester Apollo with Lady Gaga, N-Dubz, The Enemy, V V Brown and Tinchy Stryder. The London concert took place on September 25 at the Royal Albert Hall with Nelly, Nas, Kelly Rowland and David Guetta, Razorlight, Chase & Status and Akon.", "In France 2010, Orange RockCorps expanded to Marseille, completing the programme with a concert at Le Dôme on July 12 featuring Damian Marley, Nas, Sexion D'Assaut, Alonzo and Soprano. They also returned to Paris and with a concert at Le Zénith on October 5, featuring N*E*R*D, Sexion D'Assaut, Mark Ronson and the Business International featuring Boy George and V V Brown.", "–\tArtists:  Pharrell / NERD, Mark Ronson and the Business International, V V Brown, Stomae, Soprano", "–\tArtists:  Lady Gaga, N-Dubz, The Enemy, V V Brown, Tinchy Stryder"]}, {"page": "List of top 100 singles of 2010 (France)", "response": ["|V V Brown"]}, {"page": "Controversy and criticism of The X Factor (British TV series)", "response": ["V V Brown criticised the show for misleading young singers about how the music industry works, claiming at the 2009 MOBO Awards \"I don't like it – it's making kids think that they can get really famous easily, rather than working really hard to achieve something\". James Morrison stated \"[X Factor] sends out the message that you can be famous for doing fuck all and that you can succeed even if you're not a good singer\". Amy Macdonald criticised the show for making it more difficult for talented youngsters to break through."]}, {"page": "Children (V V Brown song)", "response": ["\"Children\" is a song by English recording artist V V Brown, initially released as the lead single from her shelved second studio album Lollipops & Politics. Written by Brown, the song also guest features American rapper Chiddy and was released to US iTunes on 20 September 2011. Brown later confirmed via Facebook that the song would be released in Europe at a future date; however this planned release was scrapped when Brown decided not to release the album. The song samples the classic children's playground song \"Do Your Ears Hang Low?\" in the beginning and end of the song.", "Category:V V Brown songs", "Category:Songs written by V V Brown"]}]}}