{"wiki_id": "http://www.wikidata.org/entity/Q4574624", "itemLabel": "John Neale Dalton", "itemDescription": "British priest", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Neale_Dalton", "wikipedia_page": {"main": "Canon John Neale Dalton  (24 September 1839 – 28 July 1931) was a Church of England clergyman and author. He was a chaplain to Queen Victoria, a Canon of Windsor, and tutor to the future King George V and his brother Prince Albert Victor.", "link_mentions": [{"page": "George V", "response": ["As a younger son of the Prince of Wales, there was little expectation that George would become king. He was third in line to the throne, after his father and elder brother, Prince Albert Victor. George was only 17 months younger than Albert Victor, and the two princes were educated together. John Neale Dalton was appointed as their tutor in 1871. Neither Albert Victor nor George excelled intellectually.Clay, p. 39; Sinclair, pp. 46–47 As their father thought that the navy was \"the very best possible training for any boy\",Sinclair, pp. 49–50 in September 1877, when George was 12 years old, both brothers joined the cadet training ship HMS Britannia at Dartmouth, Devon.Clay, p. 71; Rose, p. 7"]}, {"page": "Prince Albert Victor, Duke of Clarence and Avondale", "response": ["When Albert Victor was just short of seventeen months old, his brother, Prince George of Wales, was born on 3 June 1865. Given the closeness in age of the two royal brothers, they were educated together. In 1871, the Queen appointed John Neale Dalton as their tutor. The two princes were given a strict programme of study, which included games and military drills as well as academic subjects.Nicolson, pp. 7–9. Dalton complained that Albert Victor's mind was \"abnormally dormant\".Letter from Dalton in the Royal Archives, 6 April 1879, quoted in Cook, p. 52. Though he learned to speak Danish, progress in other languages and subjects was slow.Cook, pp. 52, 56–57; Harrison, pp. 68–69. Sir Henry Ponsonby thought that Albert Victor might have inherited his mother's deafness.Aronson, p. 54; Harrison, p. 34. Albert Victor never excelled intellectually. Possible physical explanations for Albert Victor's inattention or indolence in class include absence seizures or his premature birth, which can be associated with learning difficulties,Aronson, pp. 53–54; Harrison, p. 35. but Lady Geraldine Somerset blamed Albert Victor's poor education on Dalton, whom she considered uninspiring.Aronson, p. 74."]}, {"page": "Prince John of the United Kingdom", "response": ["John was christened on 3 August 1905 in the Church of St Mary Magdalene at Sandringham, the Reverend Canon John Neale Dalton officiating.", "His funeral was the following day at St Mary Magdalene Church, John Neale Dalton officiating.The Times, 22 January 1919."]}, {"page": "Edward Carpenter", "response": ["In 1871 Carpenter was invited to become tutor to the royal princes George Frederick (later King George V) and his elder brother, Prince Albert Victor, Duke of Clarence, but declined the position. His lifelong friend and fellow Cambridge student John Neale Dalton took the position.Aronson p.48. Carpenter continued to visit Dalton while he was tutor. They were given photographs of the pair, taken by the princes.Aronson p.50."]}, {"page": "Hugh Dalton", "response": ["Edward Hugh John Neale Dalton, Baron Dalton,  (16 August 1887 – 13 February 1962) was a British Labour Party economist and politician who served as Chancellor of the Exchequer from 1945 to 1947. He shaped Labour Party foreign policy in the 1930s, opposing pacifism and promoting rearmament against the German threat, and strongly opposed the appeasement policy of Prime Minister Neville Chamberlain in 1938. Dalton served in Winston Churchill's wartime coalition cabinet; after the Dunkirk evacuation he was Minister of Economic Warfare, and established the Special Operations Executive. As Chancellor, he pushed his policy of cheap money too hard, and mishandled the sterling crisis of 1947. His political position was already in jeopardy in 1947 when he, seemingly inadvertently, revealed a sentence of the budget to a reporter minutes before delivering his budget speech. Prime Minister Clement Attlee accepted his resignation; Dalton later returned to the cabinet in relatively minor positions.", "Hugh Dalton was born in Neath, in Wales. His father, John Neale Dalton, was a Church of England clergyman who became chaplain to Queen Victoria, tutor to the princes George (later King George V) and Albert Victor, and a canon of Windsor."]}, {"page": "Hugh Evan-Thomas", "response": ["In 1877, at the age of 15, Hugh Thomas was a naval cadet on the training ship HMS Britannia. In September, the royal princes George Frederick and his elder brother, Prince Albert Victor, Duke of Clarence, both joined the ship as part of their education. The princes' tutor, John Neale Dalton, who accompanied them, approved of Thomas and permitted him to become friends with the boys. Thomas left Britannia in December 1877, but not before a friendship was established. George sent him a Christmas card (from 'Sprat', while Albert was 'herring' and Thomas 'Old Voice'), both wrote letters and Dalton wrote to Thomas requesting that he write back and remain in contact.Gordon, pp. 216–217."]}, {"page": "John Dalton (disambiguation)", "response": ["*John Neale Dalton (1839–1931), Royal chaplain and tutor"]}, {"page": "Alfred Downing Fripp (surgeon)", "response": ["Fripp was the son of the artist Alfred Downing Fripp and Eliza Bannister Roe. His father's first wife, Anne Dalton Allies, was a cousin of John Neale Dalton, tutor to Prince Albert Victor and Prince George and godfather to Fripp. Anne died in 1850 after giving birth to Fripp's half-sister, Annie. Fripp had another sister, Jeanie (Edith Jane), and a brother, Rex (Reginald). Annie married Edward Penny, who became physician to Marlborough College. Rex, a pupil of the school, died aged eighteen - in 1895; their parents died in the same bronchial epidemic. Jeanie had gained a 'Senior Optime' in Mathematics at Girton in 1886 and soon after married William Hale-White, son of Mark Rutherford. Hale-White, a physician, and Fripp, a surgeon, were to work at Guy's Hospital together for over thirty years.", "In 1883, on a visit to Cambridge to visit his sister, Fripp called on his godfather, John Neale Dalton, at Trinity, where the Canon was acting as 'chaperone' to Prince Albert Victor to whom Fripp was introduced. A year later he spent a few days at Cambridge in Prince \"Eddy's\" company. Six years passed in medical studies, sporting activities and theatre-going, when he accepted a two-week job as a locum tenens for Dr. Jalland, M. D., and an old Guy's man - in York. As Prince Eddy was stationed in the area and had to be attended to, they met up again. The Prince insisted that he accompany him to Deeside where Fripp became an accepted, if unofficial, doctor-in-residence to the Prince and other members of the Royal Family. Fripp was sent with Eddy on a Royal Tour to South Wales - with only the Prince's equerry, George Holford, in attendance. At the age of twenty-four, and still with exams to pass, he had the seal of Royal approval. When his \"hope of hopes\",Alfred Fripp by Cecil Roberts Prince Albert Victor, died in the 'flu' epidemic of 1892, he thought his Royal days were over; but four years later Edward, Prince of Wales, made him his Surgeon-in-Ordinary. With Holford's help and his own persistence, he persuaded Edward to preside over the Guy's Hospital Fund, ensuring the financial security of the Hospital - before he had been given a post there. However, after this Cooper Perry and Cosmo Bonsor persuaded the Board to create an Assistant Surgeon post for him. This, and his private practice in his brother-in-law's house in Harley Street, established him as a doctor, teacher and surgeon. A year later, just before his marriage, he set up as a consultant in his own home, 19 Portland Place. For the next thirty years aristocrats, plutocrats and famous stage personalities were frequent visitors - most as patients and friends."]}, {"page": "Deputy Clerk of the Closet", "response": ["* Rev'd Canon John Neale Dalton, KCVO 1897– (re-appointed 1901)"]}, {"page": "1931 in Wales", "response": ["*28 July - John Neale Dalton, chaplain and tutor to the British royal family, settled in South Wales, 91"]}, {"page": "Dalton (surname)", "response": ["*John Neale Dalton (1839–1931), British cleric"]}, {"page": "List of people from Kent", "response": ["*John Neale Dalton (1839–1931) – chaplain to Queen Victoria and tutor to George V of the United Kingdom"]}, {"page": "1830s in Wales", "response": ["**24 September - John Neale Dalton, royal chaplain and tutor (d. 1931)"]}, {"page": "1839 in Wales", "response": ["*24 September (in England) – John Neale Dalton, royal chaplain and tutor (d. 1931)"]}, {"page": "Dean and Canons of Windsor", "response": ["*32. John Neale Dalton 1885–1931"]}, {"page": "HMS Bacchante (1876)", "response": ["The two oldest sons of the Prince of Wales had entered the navy in 1877, and by 1879 it had been decided by the Royal Family and the Government that the two should undertake a cruise. They were assigned to Bacchante, which was then part of a squadron intended to patrol the sea lanes of the British Empire. Queen Victoria was concerned that the Bacchante might sink, drowning her grandchildren. Confident in their ship, the Admiralty sent Bacchante through a gale to prove she was sturdy enough to weather storms. The Princes, with their tutor John Neale Dalton, duly came aboard on 17 September 1879. The Bacchante was to be their home for the next three years."]}, {"page": "Llewelyn Dalton", "response": ["He was the only son of William Edward Dalton and his wife Mathilda. His paternal grandfather was John Neale Dalton, chaplain to Queen Victoria.Mercer (1924), p. 602 Dalton was educated at Marlborough College and went then to Trinity College, Cambridge, graduating with a Bachelor of Arts in the historical tripos in 1900 and a Master of Arts five years thereafter.Debrett (1922), p. 438"]}, {"page": "List of honorary graduates of the University of Leeds", "response": ["* Rev. Canon John Neale Dalton (LLD)"]}, {"page": "1911 Coronation Honours", "response": ["*Canon John Neale Dalton, CVO, CMG"]}, {"page": "Household of Edward VII and Alexandra", "response": ["*1901–?: Reverend Canon John Neale Dalton, CVO, CMG, MA"]}, {"page": "Alexander Macalister", "response": ["On 4 November 1910 the body of King Henry VI in its brick vault in St. George's Chapel, Windsor (since 12 August 1484) was \"investigated\", with King George V's consent, by William Henry St John Hope and Canon John Neale Dalton, in the presence of the Dean and Canons, and various other people such as M.R. James, Provost of King's College, Cambridge (and later of Eton College, both founded by Henry VI), and Dr. A. Macalister, Professor of Anatomy at Cambridge. The vault was emptied of rubble, and at the centre was found a small lead chest containing the fragmented bones of \"a fairly strong man, aged between 45 and 55\", according to Macalister's report, published in The Times on 12 November 1910. The bones had previously been buried in Chertsey Abbey in 1471 until their removal in 1484."]}, {"page": "Household of George V and Mary", "response": ["*1901–1910: Reverend Canon John Neale Dalton, CVO, CMG"]}, {"page": "List of Knights Commander of the Royal Victorian Order appointed by George V", "response": ["|Rev. Canon John Neale Dalton, CVO, CMG"]}, {"page": "Sandleford Priory (monastery)", "response": ["The scite of Sandelford Priory was by the trustees appointed by act of Parliament, 20 June 1651, sold to Thomas Bales of the Middle Temple, and he 25 February sold the same to Alexander Staples, and he settled it on Thomas Staples and his heirs.SGC XV.36.6, and John Neale Dalton, The Manuscripts of St George's Chapel, Windsor Castle, Windsor, 1957, page 309."]}, {"page": "H. Dalton Hall", "response": ["Sylvia was related to the English parliamentarian Hugh Dalton, and his father Rev. John Neale Dalton, Canon of Windsor and Domestic Chaplain to the King. Her father was Adelaide chemist Charles Dalton, for many years with F. H. Faulding."]}, {"page": "Cornelius Neale Dalton", "response": ["He married in 1873 and there were children from the marriage. Cornelius Neale Dalton, the third son of Reverend John Neale Dalton, was a brother of John Neale Dalton."]}]}}