{"wiki_id": "http://www.wikidata.org/entity/Q457881", "itemLabel": "John Tenniel", "itemDescription": "British illustrator, graphic humourist and political cartoonist, very good friends with Spencer Bradshaw (1820-1914)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tenniel", "wikipedia_page": {"main": "Sir John Tenniel (; 28 February 1820 – 25 February 1914) was an English illustrator, graphic humorist and political cartoonist prominent in the second half of the 19th century. He was knighted for artistic achievements in 1893. Tenniel is remembered mainly as the principal political cartoonist for Punch magazine for over 50 years and for his illustrations to Lewis Carroll's Alice's Adventures in Wonderland (1865) and Through the Looking-Glass, and What Alice Found There (1871).", "link_mentions": [{"page": "Dodo (Alice's Adventures in Wonderland)", "response": ["In Tim Burton's adaptation of Alice in Wonderland, the Dodo's appearance retains the subtle apparent nature from John Tenniel's illustration. He bears a down of brilliant blue and wears a navy blue waistcoat and white spats along with glasses and a cane. He is one of Alice's good-willed advisers, taking first note of her abilities as the true Alice. He is also one of the oldest inhabitants. His name is Uilleam, and he is portrayed by Michael Gough. He goes with the White Rabbit, Tweedledee and Tweedledum, and Dormouse to take Alice to Caterpillar to decide whether Alice is the real one. He is later captured by the Red Queen's forces. When Alice came to the Red Queen's castle, he was seen at the Red Queen's castle yard as a caddy for the Queen's croquet game. After the Red Queen orders the release of the Jubjub bird to kill all her subjects from rebelling, he is then seen briefly running from it when the Tweedles went to hide from it and escaped but was snatched by the Jubjub and was never seen again throughout the film."]}, {"page": "Cartoon", "response": ["By the mid 19th century, major political newspapers in many other countries featured cartoons commenting on the politics of the day. Thomas Nast, in New York City, showed how realistic German drawing techniques could redefine American cartooning. His 160 cartoons relentlessly pursued the criminal characteristic of the Tweed machine in New York City, and helped bring it down. Indeed, Tweed was arrested in Spain when police identified him from Nast's cartoons. In Britain, Sir John Tenniel was the toast of London. In France under the July Monarchy, Honoré Daumier took up the new genre of political and social caricature, most famously lampooning the rotund King Louis Philippe."]}, {"page": "Dragon", "response": ["Dragons and dragon motifs are featured in many works of modern literature, particularly within the fantasy genre. As early as the eighteenth century, critical thinkers such as Denis Diderot were already asserting that too much literature had been published on dragons: \"There are already in books all too many fabulous stories of dragons\". In Lewis Carroll's classic children's novel Through the Looking-Glass (1872), one of the inset poems describes the Jabberwock, a kind of dragon. Carroll's illustrator John Tenniel, a famous political cartoonist, humorously showed the Jabberwock with the waistcoat, buck teeth, and myopic eyes of a Victorian university lecturer, such as Carroll himself. In works of comedic children's fantasy, dragons often fulfill the role of a magic fairy tale helper. In such works, rather than being frightening as they are traditionally portrayed, dragons are instead represented as harmless, benevolent, and inferior to humans. They are sometimes shown living in contact with humans, or in isolated communities of only dragons. Though popular in the late nineteenth and early twentieth centuries, \"such comic and idyllic stories\" began to grow increasingly rare after the 1960s, due to demand for more serious children's literature.", "File:Jabberwocky.jpg|John Tenniel's illustration of the Jabberwock for Lewis Carroll's Through the Looking-Glass, showing the dragon as a myopic professor"]}, {"page": "February 25", "response": ["*1914 – John Tenniel, English illustrator (b. 1820)"]}, {"page": "Gilbert Arthur à Beckett", "response": ["The idea of one of Sir John Tenniel's best cartoons for Punch, entitled 'Dropping the Pilot,' illustrative of Bismarck's resignation in 1889, was due to him."]}, {"page": "Jabberwocky", "response": ["John Tenniel reluctantly agreed to illustrate the book in 1871, and his illustrations are still the defining images of the poem. The illustration of the Jabberwock may reflect the contemporary Victorian obsession with natural history and the fast-evolving sciences of palaeontology and geology. Stephen Prickett notes that in the context of Darwin and Mantell's publications and vast exhibitions of dinosaurs, such as those at the Crystal Palace from 1854, it is unsurprising that Tenniel gave the Jabberwock \"the leathery wings of a pterodactyl and the long scaly neck and tail of a sauropod.\"Prickett, Stephen (2005) Victorian Fantasy Baylor University Press p80 ", "* Jabberwock: When a class in the Girls' Latin School in Boston asked Carroll's permission to name their school magazine The Jabberwock, he replied: \"The Anglo-Saxon word 'wocer' or 'wocor' signifies 'offspring' or 'fruit'. Taking 'jabber' in its ordinary acceptation of 'excited and voluble discussion', this would give the meaning of 'the result of much excited and voluble discussion'...\"Carroll, Lewis (Author), Tenniel, John (2003). Alice's Adventures in Wonderland and Through the Looking Glass, pp. 328–331. Penguin Classics.  It is often depicted as a monster similar to a dragon. John Tenniel's illustration depicts it with a long serpentine neck, rabbit-like teeth, spidery talons, bat-like wings and, as a humorous touch, a waistcoat. In the 2010 film version of Alice in Wonderland it is shown with large back legs, small dinosaur-like front legs, and on the ground it uses its wings as front legs like a pterosaur, and it breathes out lightning flashes rather than flame."]}, {"page": "Mad (magazine)", "response": ["Among the irregular contributors with just a single Mad byline to their credit are Charles M. Schulz, Chevy Chase, Andy Griffith, Will Eisner, Kevin Smith, J. Fred Muggs, Boris Vallejo, Sir John Tenniel, Jean Shepherd, Winona Ryder, Jimmy Kimmel, Jason Alexander, Walt Kelly, Rep. Barney Frank, Tom Wolfe, Steve Allen, Jim Lee, Jules Feiffer, Donald Knuth, and Richard Nixon, who remains the only President credited with \"writing\" a Mad article. (The entire text was taken from Nixon's speeches.)"]}, {"page": "Punch (magazine)", "response": ["Illustrator Archibald Henning designed the cover of the magazine's first issues. The cover design varied in the early years, though Richard Doyle designed what became the magazine's masthead in 1849. Artists who published in Punch during the 1840s and '50s included John Leech,  Doyle, John Tenniel, and Charles Keene. This group became known as \"The Punch Brotherhood\", which also included Charles Dickens, who joined Bradbury and Evans after leaving Chapman and Hall in 1843. Punch's authors and artists also contributed to another Bradbury and Evans literary magazine called Once A Week (est. 1859), created in response to Dickens' departure from Household Words."]}, {"page": "Thomas Nast", "response": ["In the early part of his career, Nast used a brush and ink wash technique to draw tonal renderings onto the wood blocks that would be carved into printing blocks by staff engravers. The bold cross-hatching that characterized Nast's mature style resulted from a change in his method that began with a cartoon of June 26, 1869, which Nast drew onto the wood block using a pencil, so that the engraver was guided by Nast's linework. This change of style was influenced by the work of the English illustrator John Tenniel.Paine 1974, pp. 135–136.", "* Uncle Sam, a lanky avuncular personification of the United States (first drawn in the 1830s; Nast and John Tenniel added the goatee)"]}, {"page": "Through the Looking-Glass", "response": ["Through the Looking-Glass includes such verses as \"Jabberwocky\" and \"The Walrus and the Carpenter\", and the episode involving Tweedledum and Tweedledee. The mirror above the fireplace that is displayed at Hetton Lawn in Charlton Kings, Gloucestershire (a house that was owned by Alice Liddell's grandparents, and was regularly visited by Alice and Lewis Carroll) resembles the one drawn by John Tenniel and is cited as a possible inspiration for Carroll.", "Lewis Carroll decided to suppress a scene involving what was described as \"a wasp in a wig\" (possibly a play on the commonplace expression \"bee in the bonnet\"). A biography of Carroll, written by Carroll's nephew, Stuart Dodgson Collingwood, suggests that one of the reasons for this suppression was a suggestion from his illustrator, John Tenniel, who wrote in a letter to Carroll dated 1 June 1870:", "Category:Books illustrated by John Tenniel"]}, {"page": "Walrus", "response": ["File:Briny Beach.jpg|alt=Drawing of walrus, and square-headed men, both perched on rocks, with ocean and cliffs in background|John Tenniel's illustration for Lewis Carroll's poem \"The Walrus and the Carpenter\""]}, {"page": "1820", "response": ["*February 28 – John Tenniel, English illustrator (d. 1914)"]}, {"page": "One Thousand and One Nights", "response": ["Famous illustrators for British editions include: Arthur Boyd Houghton, John Tenniel, John Everett Millais and George John Pinwell for Dalziel's Illustrated Arabian Nights Entertainments, published in 1865; Walter Crane for Aladdin's Picture Book (1876); Frank Brangwyn for the 1896 edition of Lane's translation; Albert Letchford for the 1897 edition of Burton's translation; Edmund Dulac for Stories from the Arabian Nights (1907), Princess Badoura (1913) and Sindbad the Sailor & Other Tales from the Arabian Nights (1914). Others artists include John D. Batten, (Fairy Tales From The Arabian Nights, 1893), Kay Nielsen, Eric Fraser, Errol le Cain, Maxfield Parrish, W. Heath Robinson and Arthur Szyk (1954)."]}, {"page": "The Annotated Alice", "response": ["The Annotated Alice is a 1960 book by Martin Gardner incorporating the text of Lewis Carroll's major tales, Alice's Adventures in Wonderland (1865) and Through the Looking-Glass (1871), as well as the original illustrations by John Tenniel. It has extensive annotations explaining the contemporary references (including the Victorian poems that Carroll parodies), mathematical concepts, word play, and Victorian traditions (such as the parlor game snap-dragons) featured in the two books.", "The original book was first published in 1960.The Annotated Alice: Alice's Adventures in Wonderland & Through the Looking Glass by Lewis Carroll, Illustrated by John Tenniel by Martin Gardner (1960), New York, Bramhall House  It has been reprinted several times and translated into French, Italian, Japanese, Portuguese, Russian, Spanish, German and Hebrew.", "In 2015, The Annotated Alice: 150th Anniversary Deluxe Edition was published, combining the previous works of Gardner and expanded by Mark Burstein, president emeritus of the Lewis Carroll Society of North America. It includes features such as more than 100 new or updated annotations, over 100 new illustrations by Salvador Dalí, Beatrix Potter, Ralph Steadman, and 42 other artists and illustrators (in addition to original art by Sir John Tenniel), and a filmography of every Alice-related film by Carroll scholar David Schaefer.", "* The Annotated Alice: Alice's Adventures in Wonderland & Through the Looking Glass by Lewis Carroll, Illustrated by John Tenniel by Martin Gardner (1960), New York, Bramhall House "]}, {"page": "Butterfly", "response": ["Sir John Tenniel drew a famous illustration of Alice meeting a caterpillar for Lewis Carroll's Alice in Wonderland, c. 1865. The caterpillar is seated on a toadstool and is smoking a hookah; the image can be read as showing either the forelegs of the larva, or as suggesting a face with protruding nose and chin. Eric Carle's children's book The Very Hungry Caterpillar portrays the larva as an extraordinarily hungry animal, while also teaching children how to count (to five) and the days of the week."]}, {"page": "Children's literature", "response": ["Another method of creating illustrations for children's books was etching, used by George Cruikshank in the 1850s. By the 1860s, top artists were illustrating for children, including Crane, Randolph Caldecott, Kate Greenaway, and John Tenniel. Most pictures were still black-and-white, and many color pictures were hand colored, often by children. The Essential Guide to Children's Books and Their Creators credits Caldecott with \"The concept of extending the meaning of text beyond literal visualization\"."]}, {"page": "Alice's Adventures in Wonderland", "response": ["To add the finishing touches he researched natural history in connection with the animals presented in the book, and then had the book examined by other children—particularly those of George MacDonald. Though Dodgson did add his own illustrations, he subsequently approached John Tenniel to illustrate the book for publication, telling him that the story had been well liked by children.", "The manuscript was illustrated by Dodgson himself who added 37 illustrations—printed in a facsimile edition in 1887. John Tenniel provided 42 wood engraved illustrations for the published version of the book. The first print run was destroyed (or sold to the United States) at Carroll's request because he was dissatisfied with the quality. The book was reprinted and published in 1866.", "Tenniel's illustrations of Alice do not portray the real Alice Liddell, who had dark hair and a short fringe. The Guardian states, “John Tenniel’s illustrations to this first edition remain indelibly Alice, with her apron and puffed sleeves and sweep of blond hair.” Alice has provided a challenge for other illustrators, including those of 1907 by Charles Pears and the full series of colour plates and line-drawings by Harry Rountree published in the (inter-War) Children's Press (Glasgow) edition. Other significant illustrators include: Arthur Rackham (1907), Willy Pogany (1929), Mervyn Peake (1946), Ralph Steadman (1967), Salvador Dalí (1969), Graham Overden (1969), Max Ernst (1970), Peter Blake (1970), Tove Jansson (1977), Anthony Browne (1988), Helen Oxenbury (1999), and Lisbeth Zwerger (1999).", "On 26 November 1865, Dodgson's tale was published by Macmillan of London as Alice's Adventures in Wonderland under the pseudonym \"Lewis Carroll\" with illustrations by John Tenniel. The first print run of 2,000 was held back because Tenniel objected to the print quality. A new edition, released in December of the same year for the Christmas market, but carrying an 1866 date, was quickly printed. The text blocks of the original edition were removed from the binding and sold with Dodgson's permission to the New York publishing house of D. Appleton & Company. The binding for the Appleton Alice was identical to the 1866 Macmillan Alice, except for the publisher's name at the foot of the spine. The title page of the Appleton Alice was an insert cancelling the original Macmillan title page of 1865, and bearing the New York publisher's imprint and the date 1866.", "*1961: The Folio Society edition is published, including 42 illustrations by John Tenniel.", "File:The White Rabbit (Tenniel) - The Nursery Alice (1890) - BL.jpg|The White Rabbit by John Tenniel, coloured", "File:John Tenniel- Alice's mad tea party, colour.jpg|Mad tea party, John Tenniel, 1865", "**GASL.org: Alice´s Adventures in Wonderland. With 42 Illustrations by John Tenniel. Kolorierter Neusatz von Günter Jürgensmeier", "**GASL.org: The Complete Works of Lewis Carroll with the illustrations by John Tenniel. First published 1939", "Category:Books illustrated by John Tenniel"]}, {"page": "Alice (Alice's Adventures in Wonderland)", "response": ["The character originated in stories told by Carroll to entertain the Liddell sisters while rowing on the Isis with his friend Robinson Duckworth, and on subsequent rowing trips. Although she shares her given name with Alice Liddell, scholars disagree about the extent to which she was based upon Liddell. Characterized by Carroll as \"loving and gentle\", \"courteous to all\", \"trustful\", and \"wildly curious\", Alice has been variously seen as clever, well-mannered, and sceptical of authority, although some commentators find more negative aspects of her personality. Her appearance changed from Alice's Adventures Under Ground, the first draft of Alice's Adventures in Wonderland, to political cartoonist John Tenniel's illustrations of her in the two Alice books.", "thumb|right|John Tenniel's illustration of Alice and the pig from Alice's Adventures in Wonderland (1865)", "John Tenniel illustrated Alice Adventures in Wonderland (1865) for a fee of £138, which was roughly a fourth of what Carroll earned each year and which he paid for himself. Tenniel was an already successful, well-known lead illustrator for the satirical magazine Punch, when Carroll employed him as an illustrator in April 1864. In contrast, Carroll did not have any literary fame at the time. Tenniel likely based the majority of his illustrations on those in Under Ground, and Carroll carefully oversaw his work; among his suggestions was that Alice should have long, light-coloured hair. Alice's clothes are typical of what a girl belonging to the middle class in the mid-Victorian era might have worn at home. Her pinafore, a detail created by Tenniel and now associated with the character, \"suggests a certain readiness for action and lack of ceremony\". Tenniel's depiction of Alice has its origins in a physically similar character which appeared in at least eight cartoons in Punch, during a four-year period that began in 1860. In an 1860 cartoon, this character wore clothes now associated with Alice: \"the full skirt, pale stockings, flat shoes, and a hairband over her loose hair\". In the cartoons, the character appeared as an archetype of a pleasant girl from the middle classes; she has been described as similar to Alice: \"a pacifist and noninterventionist, patient and polite, slow to return the aggression of others\"."]}, {"page": "The Raven", "response": ["Later publications of \"The Raven\" included artwork by well-known illustrators. Notably, in 1858 \"The Raven\" appeared in a British Poe anthology with illustrations by John Tenniel, the Alice in Wonderland illustrator (The Poetical Works of Edgar Allan Poe: With Original Memoir, London: Sampson Low). \"The Raven\" was published independently with lavish woodcuts by Gustave Doré in 1884 (New York: Harper & Brothers). Doré died before its publication.Scholnick, Robert J. \"In Defense of Beauty: Stedman and the Recognition of Poe in America, 1880–1910\", collected in Poe and His Times: The Artist and His Milieu, edited by Benjamin Franklin Fisher IV. Baltimore: The Edgar Allan Poe Society, 1990. p. 262.  In 1875, a French edition with English and French text, Le Corbeau, was published with lithographs by Édouard Manet and translation by the Symbolist Stéphane Mallarmé."]}, {"page": "Quentin Matsys", "response": ["Matsys' works include A Portrait of an Elderly Man (1513), Christ presented to the People (1518-1520) (Prado), and A Grotesque Old Woman (or The Ugly Duchess) which is perhaps the best-known of his works. It served as a basis for John Tenniel's depiction of the Duchess in Alice's Adventures in Wonderland. It is likely a depiction of a real person with Paget's disease, though it is sometimes said to be a metaphorical portrait of the Margaret, Countess of Tyrol, who was known as Maultasch, which, though literally translated \"satchel mouth\", was used to mean \"ugly woman\" or \"whore\" (because of her marital scandals). His two large triptych altarpieces The Holy Kinship or Saint Anne Altarpiece (1507–1509) and The Entombment of the Lord (1508–1511) are also highly celebrated. Commissioned for the Church of Saint Peter in Leuven, they reflect strong religious feeling and precise detailing characteristic to the majority of his works."]}, {"page": "Bayswater", "response": ["*John Tenniel, artist and cartoonist, was born at 22 Gloucester Place, New Road, Bayswater on 28 February 1820.L. Perry Curtis jun., \"Tenniel, Sir John (1820–1914)\" Retrieved 25 February 2014, pay-walled."]}, {"page": "Alice Liddell", "response": ["In the meantime, Dodgson had decided to rewrite the story as a possible commercial venture. Probably with a view to canvassing his opinion, Dodgson sent the manuscript of Under Ground to a friend, the author George MacDonald, in the spring of 1863.Dodgson's MS diaries, vol.8, p. 89, British Library The MacDonald children read the story and loved it, and this response probably persuaded Dodgson to seek a publisher. Alice's Adventures in Wonderland, with illustrations by John Tenniel, was published in 1865, under the name Lewis Carroll. A second book about the character Alice, Through the Looking-Glass and What Alice Found There, followed in 1871. In 1886, a facsimile of Alice's Adventures Under Ground, the original manuscript that Dodgson had given Liddell, was published."]}]}}