{"wiki_id": "http://www.wikidata.org/entity/Q457856", "itemLabel": "Jessica Mitford", "itemDescription": "British writer and activist (1917-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessica_Mitford", "wikipedia_page": {"main": "Jessica Lucy \"Decca\" Freeman-Mitford (11 September 1917 – 23 July 1996) was an English author, one of the six aristocratic Mitford sisters noted for their sharply conflicting politics.\nJessica married her second cousin Esmond Romilly, who was killed in World War II, and then American civil rights lawyer Robert Treuhaft, with whom she joined the American Communist Party and worked closely in the Civil Rights Congress. Both refused to testify in front of the House Un-American Activities Committee. They resigned from the party in 1958.\nHer 1960 memoir Hons and Rebels and her 1963 book of social commentary The American Way of Death both became classics.", "link_mentions": [{"page": "COINTELPRO", "response": ["* Jessica Mitford"]}, {"page": "J. K. Rowling", "response": ["Rowling's secondary school was Wyedean School and College, a state school which she began attending at age eleven and where she was bullied. Rowling was inspired by her favourite teacher, Lucy Shepherd, who was young, strict, and taught the importance of structure and precision in writing. Smith writes that Rowling \"craved to play heavy electric guitar\", and describes her as \"intelligent yet shy\".  According to Dale Neuschwander, a teacher there, she impressed her teachers with her imagination. When she was a young teenager, Rowling's great-aunt gave her Hons and Rebels, the autobiography of the civil rights activist Jessica Mitford. Mitford became Rowling's heroine, and she read all her books. ", "Five months after arriving in Porto, Rowling met the Portuguese television journalist Jorge Arantes in a bar and found that they shared an interest in Jane Austen. By mid-1992, they were planning a trip to London to introduce Arantes to Rowling's family, when she had a miscarriage. The relationship was troubled, yet they married on 16 October 1992. Their daughter Jessica Isabel Rowling Arantes (named after Jessica Mitford) was born on 27 July 1993 in Portugal. By this time, Rowling had finished the first three chapters of Harry Potter and the Philosopher's Stone – almost as they were eventually published – and had drafted the rest of the novel.", "Rowling has named Jessica Mitford as her greatest influence. She said Mitford \"has been my heroine since I was 14 years old, when I overheard my formidable great-aunt discussing how Mitford had run away at the age of 19 to fight with the Reds in the Spanish Civil War\", and that what inspired her about Mitford was that she was \"incurably and instinctively rebellious, brave, adventurous, funny and irreverent, she liked nothing better than a good fight, preferably against a pompous and hypocritical target\". As a child, Rowling read Lewis's The Chronicles of Narnia, Goudge's The Little White Horse, Manxmouse by Paul Gallico, and books by E. Nesbit and Noel Streatfeild. Rowling describes Jane Austen as her \"favourite author of all time\".", "|| \"The first it girl: J. K. Rowling reviews Decca: the Letters by Jessica Mitford\". Sussman, Peter Y., editor. The Daily Telegraph."]}, {"page": "September 11", "response": ["*  1917   – Jessica Mitford, English-American journalist and author (d. 1996)"]}, {"page": "1917", "response": ["** Jessica Mitford, Anglo-American writer (d. 1996)"]}, {"page": "1996", "response": ["* July 22 – Jessica Mitford, British-American author, journalist and political campaigner (b. 1917)"]}, {"page": "McCarthyism", "response": ["* Jessica Mitford, author, muckraker. Refused to testify to HUAC."]}, {"page": "Grace Darling", "response": ["* Jessica Mitford: Grace Had an English Heart. The Story of Grace Darling, Heroine and Victorian Superstar (1998) "]}, {"page": "List of biographers", "response": ["*Leslie Brody (US, born 1952) – Jessica Mitford"]}, {"page": "Chatsworth House", "response": ["In May 1944 Kathleen Kennedy, sister of John F. Kennedy, married William Cavendish, Marquess of Hartington, elder son of the 10th Duke of Devonshire. However, he was killed in action in Belgium in September 1944 and Kathleen died in a plane crash in 1948. His younger brother Andrew became the 11th Duke in 1950. He was married to Deborah Mitford, one of the Mitford girls, sister to Nancy Mitford, Diana Mitford, Pamela Mitford, Unity Mitford and Jessica Mitford"]}, {"page": "Front Page Challenge", "response": ["Unfortunately, the show's stability proved to be its undoing, as the producers did not see fit to add younger panelists while the regulars aged and the audience demographics became less desirable. The show always was videotaped in or aired live from Toronto prior to 1966. During that year four shows originated from Montreal including one with challenger Jessica Mitford. The show continued going on the road, being videotaped in cities across Canada. The oldest regular, Gordon Sinclair, continued travelling with his fellow panelists to videotaping locations until he was well into his 80s. Although the location of the studio was not always noticeable to home viewers, they did notice the lack of guest challengers from foreign countries after 1979. The program no longer featured internationally known controversial figures to match the likes of Timothy Leary, Indira Gandhi, Menachem Begin (when he was a Knesset member) and William F. Buckley who had held viewers' attention in the 1960s and most of the 1970s. Alex Barris says in his second book that the absence of non-Canadian guests after 1979 resulted from budget cuts for CBC Television that ruled out travel expenses."]}, {"page": "Mitford family", "response": ["*A portion of Jessica Mitford's writing is used as a spoken-word introduction to the song \"Last Act of Defiance\", about the New Mexico State Penitentiary riot, on thrash metal band Exodus's 1989 album Fabulous Disaster.", "File:Jessica Mitford, by William Acton.jpg|Jessica Mitford (1917–1996)"]}, {"page": "Diana Mitford", "response": ["She was educated at home by a series of governesses, except for a six-month period in 1926 when she was sent to a day school in Paris. In childhood, her younger sisters Jessica Mitford (\"Decca\") and Deborah Cavendish, Duchess of Devonshire (\"Debo\"), were particularly devoted to her. At the age of 18, shortly after her presentation at Court, she became secretly engaged to Bryan Walter Guinness.", "At times, she was vague when discussing her loyalties to Britain, her strong belief in fascism, and her attitude to Jews. In her 1977 autobiography A Life of Contrasts, she wrote, \"I didn't love Hitler any more than I did Winston [Churchill]. I can't regret it, it was so interesting.\" In her final interviews with Duncan Fallowell in 2002, she responded that her reaction to the newsreels of death camps was \"Well, of course, horror. Utter horror. Exactly the same probably as your reactions.\" However, when asked about having revulsion against Hitler for this, she said that \"I had a complete revulsion against the people who did it but I could never efface from my memory the man I had actually experienced before the war. A very complicated feeling. I can't really relate those two things to each other. I know I'm not supposed to say that but I just have to.\" At other times, however, she behaved so as to suggest intense anti-semitic attitudes; the journalist Paul Callan remembered mentioning that he was Jewish while interviewing her husband in Diana's presence. According to Callan, \"I mentioned, just in the course of conversation, that I was Jewish—at which Lady Mosley went ashen, snapped a crimson nail and left the room ... No explanation was given but she would later write to a friend: 'A nice, polite reporter came to interview Tom [as Mosley was known] but he turned out to be Jewish and was sitting there at our table. They are a very clever race and come in all shapes and sizes.'\" Diana offered to entertain her teenage half-Jewish nephew, Benjamin Treuhaft on a trip to France. The offer was refused by Benjamin's mother, Jessica, who remained estranged from Diana over the latter's political past.\"Obituary: Jessica Mitford\". The Independent. London. 25 July 1996. In a 2000 interview with The Guardian, Diana said that \"Maybe instead they [European Jews] could have gone somewhere like Uganda: very empty and a lovely climate.\"\"'Maybe the Jews could have gone somewhere like Uganda: empty and a lovely climate'.\" The Guardian. London. 23 November 2000."]}, {"page": "1996 in literature", "response": ["*July 22 – Jessica Mitford, Anglo-American author, journalist and campaigner (born 1917)"]}, {"page": "1979 in literature", "response": ["*Jessica Mitford – Poison Penmanship: the Gentle Art of Muckraking"]}, {"page": "1960 in literature", "response": ["*Jessica Mitford – Hons and Rebels"]}, {"page": "1963 in literature", "response": ["*Jessica Mitford – The American Way of Death"]}, {"page": "Embalming", "response": ["===Jessica Mitford and the Revisionist Position===", "This beneficial perception of the viewing of a properly embalmed deceased person has been challenged, however, by authors such as Jessica Mitford, who point out that there is no general consensus that viewing an embalmed corpse is somehow \"therapeutic\" to the bereaved, and that terms such as \"memory picture\" were invented by the undertakers themselves, who have a financial interest in selling the costly process of embalming to the public. This argument ignores the fact that there is no general consensus for any funeral practice, and the indisputable fact that, ceteris paribus, an embalmed body will look better than an unembalmed one, which is still actively decomposing. Mitford also points out that, in many countries, embalming is rare, and the populace of such countries are still able to grieve normally, although this argument would be of equal validity about any number of technologies or knowledges common in one place but lacking in another that thus manages without them."]}, {"page": "The Loved One", "response": ["Tom Paxton mentions The Loved One, along with Jessica Mitford's book The American Way of Death, as one of the inspirations for his satirical song \"Forest Lawn\".Paxton, Tom. The Compleat Tom Paxton [Even Compleater]. Compact Disc. Rhino Handmade, 2004."]}, {"page": "Hugh M. Hefner First Amendment Award", "response": ["The judges were Rex Armstrong, Attorney and Volunteer Counsel, ACLU of Oregon; Jessica Mitford, author and social activist; and Carl Jensen, Founder, Project Censored."]}, {"page": "William Sloane Coffin", "response": ["* The Trial of Dr. Spock, William Sloane Coffin, Michael Ferber, Mitchell Goodman, and Marcus Raskin, by Jessica Mitford, New York, Knopf, 1969 "]}, {"page": "Bennett Cerf", "response": ["Cerf was interviewed in 1967 and 1968 by Robin Hawkins, a freelancer working for the Oral History Research Office at Columbia University. Cerf claimed that, of all the awards which he'd received in his life, he was \"genuinely proud of\" those bestowed on him by humor magazines The Yale Record and The Harvard Lampoon. Cerf was the subject of Jessica Mitford's exposé, published in the July 1970 issue of Atlantic Monthly, which denounced the business practices of the Famous Writers School which Cerf had founded."]}, {"page": "Harvey Matusow", "response": ["In 1950, Matusow, a young and low-ranking party member employed as a clerk in the Communist Party bookstore in Manhattan, walked in to the FBI and offered his services as a paid informant.Lichtman, Robert M. and Cohen, Ronald. Deadly Farce: Harvey Matusow and the Informer System in the McCarthy Era. University of Illinois Press, 2004. During a 1950 summer road trip to the West Coast, he made a prolonged stop at the San Cristobal Valley Ranch, a resort near Taos, New Mexico, directed by musician Jenny Vincent and her husband and favored by progressives, and filed detailed reports with the Albuquerque office of the FBI there, which paid him $75 a month; he listed the license plate numbers of cars in the resort's parking lot and noted the comings and goings of people he recognized as party members or he alleged were members. Notable visitors to the ranch during his stay included Jessica Mitford and Virginia Durr,Decca: The Letters of Jessica Mitford, ed. Peter Y. Sussman (2010), p. 138. but he does not appear to have identified them in his reports. In December, Matusow was abruptly summoned to New York and expelled from the party; soon afterward, the FBI, deciding that he was of no further use, dropped him from the rolls of its paid informants."]}, {"page": "Esmond Romilly", "response": ["Esmond Marcus David Romilly (10 June 1918 – 30 November 1941) was a British socialist, anti-fascist and journalist, who was in turn a schoolboy rebel, a veteran with the International Brigades during the Spanish Civil War and, following the outbreak of the Second World War, an observer with the Royal Canadian Air Force. He is perhaps best remembered for his teenage elopement with his distant cousin Jessica Mitford, the second youngest of the Mitford sisters.", "At the end of January 1937, while he was recuperating from his Spanish experiences at the home of his distant cousin Dorothy Althusen (widow of the Conservative MP Augustus Henry Eden Allhusen), Romilly met his second cousin Jessica Mitford. According to Mary Lovell's account, Esmond had learned from his brother Giles that Jessica was interested in going to Spain and suggested to Dorothy that the \"pink\" Mitford sister would be a suitable house guest. She was the second-youngest of the renowned Mitford sisters, daughters of the 2nd Baron Redesdale. Despite the family relationship, the two had not previously met, but according to Mitford's own account, \"I had been in love with Esmond for years, ever since I first heard of him\". She was herself a rebel against the restrictions of her upbringing and family life and hoped that Romilly would help her get to Spain. The two found an instant rapport and began immediately to make plans. Romilly had acquired a press card and a contract from the News Chronicle to report on the war and was thus obtained a visa. The plan was that Mitford would travel as his secretary. Mitford had for years accumulated her small savings in what she called her \"Running-away account\", which now stood at around £50. That, Romilly announced, would make things much easier. ", "* Jessica Mitford's account of his death, conveyed to her by Winston Churchill"]}, {"page": "I Know Why the Caged Bird Sings", "response": ["Angelou was deeply depressed in the months following King's assassination, so to help lift her spirits, Baldwin brought her to a dinner party at the home of cartoonist Jules Feiffer and his wife Judy in late 1968. The guests began telling stories of their childhoods and Angelou's stories impressed Judy Feiffer. The next day she called Robert Loomis at Random House, who became Angelou's editor throughout her long writing career until he retired in 2011, and \"told him that he ought to get this woman to write a book\". At first, Angelou refused, since she thought of herself as a poet and playwright.Walker, p. 17 According to Angelou, Baldwin had a \"covert hand\" in getting her to write the book, and advised Loomis to use \"a little reverse psychology\", and reported that Loomis tricked her into it by daring her: \"It's just as well\", he said, \"because to write an autobiography as literature is just about impossible\". Angelou was unable to resist a challenge, and she began writing Caged Bird. After \"closeting herself\"Hagen, p. 57 in London it took her two years to write it. She shared the manuscript with her friend writer Jessica Mitford before submitting it for publication."]}, {"page": "Urn", "response": ["In the modern funeral industry, cremation urns of varying quality, elaborateness, and cost are offered, and urns are another source of potential profit for an industry concerned that a trend toward cremation might threaten profits from traditional burial ceremonies.Jessica Mitford, The American Way of Death Revisited (Random House, 2011), , pp. 115-116. Excerpts available at Google Books.Stephen R. Prothero, Purified by Fire: A History of Cremation in America (University of California Press, 2002), , pp. 196ff. Excerpts available at Google Books. Biodegradable urns are sometimes used for both human and animal burial. They are made from eco-friendly materials such as recycled or handmade paper, salt, cellulose or other natural products that are capable of decomposing back into natural elements, and sometimes include a seed intended to grow into a tree at the site of the burial.\"Biodegradable urns use human remains to grow trees\" CBC News, October 21, 2012.\"RIP: Recycle in Peace\", Discovery News, May 17, 2011.\"Biodegradable Urn Lets You Go Green, Even Six Feet Under\", Time, May 17, 2011."]}, {"page": "Philip Toynbee", "response": ["He was born in Oxford; his father was the historian Arnold J. Toynbee, and his mother was Rosalind Murray. He was educated at Rugby School, where he became rebellious, reacting against the public school system. Inspired by the example of Esmond Romilly, later a friend, he ran away, returned shortly and was expelled.Boadilla by Esmond Romilly, The Clapton Press, London, 2018  He later wrote a memoir of Romilly, and Jasper Ridley (1913–1944), entitled Friends Apart. Through Romilly, Toynbee met Jessica Mitford, who became a close friend after Esmond died in WWII. He was also influenced by bookshop owner and would-be encourager of the young radical element, David Archer, whom he met through David Gascoyne.", "*Faces of Philip; a memoir of Philip Toynbee (1984) Jessica Mitford"]}, {"page": "James Forman", "response": ["During the 1960s and 1970s, Forman lived with Constancia \"Dinky\" Romilly, the second and only surviving child of the British-born journalist, anti-fascist activist and aristocrat, the Hon. Jessica Mitford, and her first husband, Esmond Romilly, who was a nephew-by-marriage of Sir Winston Churchill. Though obituaries and other posthumous articles about Forman have stated that he and Romilly were married, correspondence between Romilly's mother and aunts state that the couple were not legally husband and wife.According to a 13 March 1967 letter written at the time of the birth of the couple's first child by Constancia's aunt Deborah, the Duchess of Devonshire, to her sister Nancy Mitford, Romilly and Forman remained unwed \"because she is white & would be a handicap to him in his political career (he is the right-hand man of one of the leading Negro politicians from the South) & I suppose that is rather insulting ...\" Shortly afterward, Romilly's mother wrote to Nancy Mitford on 6 April 1967, \"I don't quite fathom why she doesn't get married (as the babe's father, Jim Foreman [sic], and her have been living together for ages); but she seems happy with her rum lot, so that's a comfort.\" The full text of the letters and other correspondence regarding Forman and Romilly's relationship and the births of their children appear in the following volume: Charlotte Mosley, editor, \"The Mitfords: Letters Between Six Sisters\", London: Fourth Estate, 2007, pp. 485-486 and 488."]}, {"page": "Tennis the Menace", "response": ["He read Jessica Mitford's book The American Way of Death Revisited, which discusses the funeral industry, and was able to take a tour with funeral salesmen at Westwood Village Memorial Park Cemetery in Los Angeles. At the time, he did not reveal that this was for research, and instead pretended to have a dying relative. According to Maxtone-Graham, the tour helped him find out \"all about urns versus coffins, and cremation. I asked sort of questions about, 'Well, do the bodies smell?' They were very nice and gave me all the answers. It was quite fascinating.\""]}, {"page": "Robert Gottlieb", "response": ["Gottlieb has edited novels by John Cheever, Doris Lessing, Chaim Potok, Charles Portis, Salman Rushdie, John Gardner, Len Deighton, John le Carré, Ray Bradbury, Elia Kazan, Margaret Drabble, Michael Crichton, Mordecai Richler and Toni Morrison, and non-fiction books by Bill Clinton, Janet Malcolm, Katharine Graham, Nora Ephron, Katharine Hepburn, Barbara Tuchman, Jessica Mitford, Robert Caro, Antonia Fraser, Lauren Bacall, Liv Ullmann, Paul Simon, Bob Dylan, Bruno Bettelheim, Carl Schorske, and many others.Paris Review Interviews (2006), Vol. 1, p. 336."]}, {"page": "Natalie Haynes", "response": ["In 2005 and 2006, Haynes wrote and presented documentaries on comic writers, for BBC Radio 4. Her subjects included the modern female writers Jessica Mitford and Dorothy Parker, and the classical male writers Aristophanes, Juvenal and Martial."]}, {"page": "Clifford Durr", "response": ["Durr resigned from the FCC in 1948 after dissenting from its adoption of a loyalty oath demanded by the Truman administration. Although Durr did not know it, the FBI had already put him under surveillance in 1942 because he had defended a colleague accused of left-wing political associations. His wife's vigorous support for racial equality and voting rights for blacks and their friendship with Jessica Mitford, a member of the Communist Party, made both of them even more suspect. The FBI stepped up its interest in Durr in 1949, when he joined the National Lawyers Guild. He subsequently became the President of the Guild."]}, {"page": "List of people from Oakland, California", "response": ["*Jessica Mitford – writer, activist, former Communist ", "*Jessica Mitford – author"]}, {"page": "The Bedford Reader", "response": ["* Jessica Mitford's \"Behind the Formaldehyde Curtain\""]}, {"page": "Oxford \"-er\"", "response": ["Brekker, breakker, or brekkers (for breakfast) is a coinage from the 1880s still in occasional use. In 1996, Jessica Mitford (1917–1996) in one of her final letters to her sister, Deborah, Duchess of Devonshire, referred to \"proper boiled eggs for breakker\".Letter, 23 July 1996: Decca: the Letters of Jessica Mitford (ed Peter Y Sussman, 2006) Shampers (champagne) occurs frequently, often spelt champers: \"They like champers up north\".thelondonpaper, 23 March 2007"]}, {"page": "Harry Potter influences and analogues", "response": ["=== Jessica Mitford ===", "In the Scotsman interview, Rowling described civil rights activist Jessica Mitford as \"my most influential writer\", saying, \"I love the way she never outgrew some of her adolescent traits, remaining true to her politics – she was a self-taught socialist – throughout her life.\" In a review of Decca—The letters of Jessica Mitford, she went further saying, \"Jessica Mitford has been my heroine since I was 14 years old, when I overheard my formidable great-aunt discussing how Mitford had run away at the age of 19 to fight with the Reds in the Spanish Civil War\", and claims what inspired her about Mitford was that she was \"incurably and instinctively rebellious, brave, adventurous, funny and irreverent, she liked nothing better than a good fight, preferably against a pompous and hypocritical target.\""]}]}}