{"wiki_id": "http://www.wikidata.org/entity/Q457165", "itemLabel": "Richard Todd", "itemDescription": "Irish-British actor (1919-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Todd", "wikipedia_page": {"main": "Richard Andrew Palethorpe-Todd  (11 June 1919 – 3 December 2009) was an Irish-British actor known for his leading man roles of the 1950s. He received a Golden Globe Award for Most Promising Newcomer – Male, and an Academy Award for Best Actor nomination and a Golden Globe Award for Best Actor nomination for his performance as Corporal Lachlan MacLachlan in the 1949 film The Hasty Heart. His other notable roles include Jonathan Cooper in Stage Fright (1950), Wing Commander Guy Gibson in The Dam Busters (1955), Sir Walter Raleigh in The Virgin Queen (1955), and Major John Howard in The Longest Day (1962). He was previously a Captain in the British Army during World War II,  fighting in the D-Day landings as a member of the 7th (Light Infantry) Parachute Battalion.", "link_mentions": [{"page": "Alfred Hitchcock", "response": ["Under Capricorn (1949), set in 19th-century Australia, also uses the short-lived technique of long takes, but to a more limited extent. He again used Technicolor in this production, then returned to black-and-white for several years. Transatlantic Pictures became inactive after the last two films. Hitchcock filmed Stage Fright (1950) at Elstree Studios in England, where he had worked during his British International Pictures contract many years before. He paired one of Warner Bros.' most popular stars, Jane Wyman, with the expatriate German actor Marlene Dietrich and used several prominent British actors, including Michael Wilding, Richard Todd and Alastair Sim. This was Hitchcock's first proper production for Warner Bros., which had distributed Rope and Under Capricorn, because Transatlantic Pictures was experiencing financial difficulties."]}, {"page": "December 3", "response": ["*  2009   – Richard Todd, Irish-born British soldier and actor (b. 1919)"]}, {"page": "H. G. Wells", "response": ["* In the BBC2 anthology series Encounters about imagined meetings between historical figures, Beautiful Lies, by Paul Pender  (15 August 1992) centred on an acrimonious dinner party attended by Wells (Richard Todd), George Orwell (Jon Finch), and William Empson (Patrick Ryecart)."]}, {"page": "June 11", "response": ["*  1919   – Richard Todd, Irish-English actor (d. 2009)"]}, {"page": "Saving Private Ryan", "response": ["The film has gained criticism from some war veterans. Film director and military veteran Oliver Stone has accused the film of promoting \"the worship of World War II as the good war,\" and has placed it alongside films such as Gladiator and Black Hawk Down that he believes were well-made, but may have inadvertently contributed to Americans' readiness for the 2003 invasion of Iraq. In defense of the film's portrait of warfare, Brian De Palma commented, \"The level of violence in something like Saving Private Ryan makes sense because Spielberg is trying to show something about the brutality of what happened.\" Actor Richard Todd, who performed in The Longest Day and was among the first Allied soldiers to land in Normandy (Operation Tonga), said the film was \"Rubbish. Overdone.\" American academic Paul Fussell, who saw combat in France during World War II, objected to what he described as, \"the way Spielberg's Saving Private Ryan, after an honest, harrowing, 15-minute opening visualizing details of the unbearable bloody mess at Omaha Beach, degenerated into a harmless, uncritical patriotic performance apparently designed to thrill 12-year-old boys during the summer bad-film season. Its genre was pure cowboys and Indians, with the virtuous cowboys of course victorious.\" Historian Jim DiEugenio took note that the film was actually \"90 percent fiction\" and that Tom Hanks knew this, with his goal being to \"commemorate World War II as the Good War and to depict the American role in it as crucial\".DiEugenio, Jim (October 29, 2013). \"James DiEugenio, Reclaiming Parkland\". Kennedy and King (formerly CTKA)."]}, {"page": "2009", "response": ["* December 3 – Richard Todd, Irish-born British actor (b. 1919)"]}, {"page": "Joan Collins", "response": ["Collins made her Hollywood film debut in the lavish historical drama The Virgin Queen (1955). The British newcomer was given equal billing with established stars Bette Davis and Richard Todd. The same year, Collins was cast in the starring role of Evelyn Nesbitt in The Girl in the Red Velvet Swing with Ray Milland and Farley Granger. The part had originally been intended for Marilyn Monroe, however problems between Monroe and Fox led to Collins gaining the role."]}, {"page": "Wuthering Heights", "response": ["Nigel Kneale's script was produced for BBC Television twice, firstly in 1953, starring Richard Todd as Heathcliff and Yvonne Mitchell as Cathy. Broadcast live, no recordings of the production are known to exist. The second adaptation using Kneale's script was in 1962, starring Claire Bloom as Catherine and Keith Mitchell as Heathcliff. This production does exist with the BFI, but has been withheld from public viewing. Kneale's script was also adapted for Australian television in 1959 during a time when original drama productions in the country were rare. Broadcast live from Sydney, the performance was telerecorded, although it is unknown if this kinescope still exists."]}, {"page": "Rod Steiger", "response": ["In 1962, Steiger appeared on Broadway in Moby Dick—Rehearsed, at the Ethel Barrymore Theatre, as well as playing a detective searching for a scientist's (Alan Ladd's) mugger in Philip Leacock's 13 West Street for Columbia Pictures. Steiger played a small role of a destroyer commander among the large ensemble cast of The Longest Day, which included John Wayne, Richard Todd, Robert Mitchum, Richard Burton, Sean Connery and Henry Fonda. According to co-star Richard Burton, Steiger had privately admitted to him that he was in financial trouble at the time and had a face lift, which Burton thought made him look like \"one half of a naked ass-hole\". The following year, Steiger played ruthless Neapolitan land developer and city councilman Edoardo Nottola, who uses his political power to make personal profit in a large scale suburban real estate deal, in Francesco Rosi's Italian production, Hands over the City (1963). According to biographer Francesco Bolzoni, Rosi had cast Steiger in the Italian language film because he had wanted \"a rich interpreter of great capacity\" in the part of the land developer."]}, {"page": "King Vidor", "response": ["Lightning Strikes Twice (1951): His final picture for Warner Brothers, Vidor attempted to create a film noir tale of a deadly love triangle starring Richard Todd, Ruth Roman and Mercedes McCambridge, a cast that did not suit Vidor.  A standard Warner's melodrama, Vidor declared that the picture \"turned out terribly\" and is largely unrepresentative of his work except in its western setting and its examination of sexual strife, the theme of the film.Durgnat and Simmon, 1988 p. 279: Vidor's \"fullest attempt at film noir 'turned out terribly' owing in part to casting problems...\" See notes on quote with Higham in a 1969 interview with Vidor And: Vidor's \"common success in exploring sexual tension…\" And p. 280: \"...sexual tensions...turn into the film's theme…\"Baxter, 1976 p. 76-77: \"...hardly recognizable as a Vidor film except in its desert setting and its bizarre central situation...[resembling] traditional Warner's melodramas…\" Vidor's next project was proposed by producer Joseph Bernhard after pre-production and casting were nearly complete: Japanese War Bride (1952).Durgnat and Simmon, 1988 p. 281"]}, {"page": "Mary Tudor, Queen of France", "response": ["* In The Sword and the Rose (Walt Disney and Perce Pearce film, 1953), Mary Tudor (played by Glynis Johns) falls for the non-noble Brandon (played by Richard Todd) and attempts to run away from England with him, but is forced by Henry VIII to marry the King of France. She relies on her friend, the Duke of Buckingham, to help her, with nearly disastrous consequences."]}, {"page": "Prospect of Whitby", "response": ["The public house features briefly in an episode of Only Fools And Horses. When Uncle Albert goes missing in one episode, Del Boy and Rodney travel around London looking for him. Nicholas Lyndhurst is shown in one scene walking out of the pub. There is also a scene from the 1956 film D-Day the Sixth of June starring Robert Taylor and Richard Todd where Taylor's character is seen with Dana Wynter's character having drinks together during the Second World War in London."]}, {"page": "The Ten Commandments (1956 film)", "response": ["Jeff Chandler, Tony Curtis, Vince Edwards, Eric Fleming, Arthur Franz, Rock Hudson, Brian Keith, Cameron Mitchell, George Nader, Jack Palance, Michael Pate, Richard Todd, Clint Walker, and Cornel Wilde were considered for the role of the stonecutter Joshua. DeMille's first choice was Wilde, who had worked with him in The Greatest Show on Earth. Wilde's casting was widely mentioned in the press. DeMille later remarked, \"Cornel Wilde declined the role ... thus giving John Derek his opportunity for a noteworthy performance.\""]}, {"page": "Richard Harris", "response": ["Harris played another IRA Volunteer in A Terrible Beauty (1960), alongside Robert Mitchum. He had a memorable bit part in the film The Guns of Navarone (1961) as a Royal Australian Air Force pilot who reports that blowing up the \"bloody guns\" of the island of Navarone is impossible by an air raid. He had a larger part in The Long and the Short and the Tall (1961), playing a British soldier; Harris clashed with Laurence Harvey and Richard Todd during filming."]}, {"page": "Glynis Johns", "response": ["Johns supported Richard Todd in Flesh and Blood (1951) and also appeared in the Hollywood-financed No Highway in the Sky (1951). She co-starred with David Niven in Appointment with Venus (1951) for director Ralph Thomas, and was one of several names in Encore (1951) and The Magic Box (1951).", "She was reunited with Richard Todd for two swashbucklers made for Walt Disney: The Sword and the Rose (1953) (directed by Annakin) and Rob Roy, the Highland Rogue (1953). In between, she made Personal Affair (1953) supporting Gene Tierney."]}, {"page": "Grantham", "response": ["*Richard Todd (1919–2009) actor"]}, {"page": "The Hasty Heart", "response": ["The Hasty Heart is a 1949 war drama film, an Anglo-American co-production directed by Vincent Sherman and starring Ronald Reagan, Patricia Neal, and Richard Todd. The film is based on the 1945 play of the same name by John Patrick.", "Lt Col Dunn (Anthony Nicholls), the senior doctor of the hospital, tells the men that they will be receiving a new patient soon, and that they should be extra kind to him.  He is a Scot, and, while he seems to have recovered from his operation, his abnormal kidney means that he will die within a few weeks. Dunn tells the men that the Scot will be outwardly healthy until one day he will suddenly die when his kidney fails. When the Scot arrives, Cpl. Lachlan 'Lachie' MacLachlan (Richard Todd) is very gruff and mean. He is constantly suspicious of his fellow patients attempting to make friends with him.", "* Richard Todd – Cpl. Lachlan \"Lachie\" MacLachlan, the Scot", "Richard Todd (who won the role over Gordon Jackson) was nominated for the Academy Award for Best Actor. The film also won two Golden Globes (Richard Todd for Most Promising Newcomer – Male and for Best Film Promoting International Understanding)."]}, {"page": "Laurence Harvey", "response": ["Back in Britain, Harvey was cast in the film version of The Long and the Short and the Tall (1961) in a role originally performed by Peter O'Toole during the play's West End run. He clashed with Richard Todd and Richard Harris during filming but the movie was a hit in Britain.Preparation Helped Laurence Harvey Find Room at the Top By Hedda Hopper. The Washington Post, Times Herald 1 Jan 1961: C6. He was announced for some films that were not made (The Disenchanted from the novel by Budd Schulberg, No Bail for the Judge, from Alfred Hitchcock The Lion, The Long Walk) and films made with other actors The Greengage Summer).LAURENCE HARVEY FACES BUSY YEAR: British Actor to Have Roles in 8 Films – Bardot to Be Seen Without Subtitles The New York Times 28 January 1960: 26.", "|Richard Todd, Richard Harris, David McCallum"]}, {"page": "The Dam Busters (film)", "response": ["The Dam Busters is a 1955 British epic war film starring Richard Todd and Michael Redgrave. It was directed by Michael Anderson. The film recreates the true story of Operation Chastise when in 1943 the RAF's 617 Squadron attacked the Möhne, Eder, and Sorpe dams in Nazi Germany with Barnes Wallis's bouncing bomb.", "* Richard Todd as Wing Commander  Guy Gibson, CO of 617 Squadron and pilot of \"George\"", "Following the success of the book The Dam Busters (a RAF-approved history of 617 Squadron), Robert Clark the head of production at Associated British Picture Corporation (ABPC) approached its author Paul Brickhill about acquiring the film rights as a vehicle for Richard Todd. The company's production manager was, however, of the opinion that, due to its numerous personnel and raids, it would not be able to film the book in its entirety. As a result, Clark requested that Brickhill provide a film treatment which described his vision for the film. Brickhill agreed to do it without payment in the hope of selling the film rights. To assist him, Clark teamed him up with Walter Mycroft who was the company's director of production.Dando-Collins. p. 237. Brickhill decided to concentrate the film treatment on Operation Chastise and ignore the later raids.", "The Dambusters received a Royal world premiere at the Odeon Leicester Square on 16 May 1955, the twelfth anniversary of the raid. Princess Margaret attended along with Eve Gibson, Guy Gibson's widow and his father. Richard Todd, Barnes Wallis and the surviving members of 617 Squadron who had taken part in the mission were all guests of honour. The premiere helped to raise money and awareness for various RAF charities.", "Richard Todd considered the film as one of his favourites of all those that he appeared in, and went on to appear at many Dambusters themed events.", "On 16 May 2008, a commemoration of the 65th anniversary was held at Derwent Reservoir, including a flypast by a Lancaster, Spitfire, and Hurricane. The event was attended by actor Richard Todd, representing the film crew and Les Munro, the last surviving pilot from the original raid, as well as Mary Stopes-Roe, the elder daughter of Sir Barnes Wallis."]}, {"page": "1965 in film", "response": ["*Coast of Skeletons, directed by Robert Lynn and starring Richard Todd and Dale Robertson – (U.K./South Africa)"]}, {"page": "1962 in film", "response": ["*The Boys, directed by Sidney J. Furie, starring Richard Todd – (U.K.)"]}, {"page": "1960 in film", "response": ["*Never Let Go, directed by John Guillermin, starring Richard Todd, Peter Sellers, Elizabeth Sellars and Adam Faith – (U.K.)"]}, {"page": "1959 in film", "response": ["*Danger Within, starring Richard Todd, Bernard Lee, Richard Attenborough – (Britain)"]}, {"page": "1958 in film", "response": ["*Chase a Crooked Shadow, starring Richard Todd and Anne Baxter – (Britain)", "*Intent to Kill, starring Richard Todd, Betsy Drake, Herbert Lom"]}, {"page": "1955 in film", "response": ["* The Dam Busters, starring Richard Todd and Michael Redgrave, with an early role by Robert Shaw – (GB)", "* The Virgin Queen, starring Bette Davis, Richard Todd, Joan Collins"]}, {"page": "1950 in film", "response": ["*Stage Fright, directed by Alfred Hitchcock, starring Jane Wyman, Marlene Dietrich, Michael Wilding and Richard Todd – (GB)"]}]}}