{"wiki_id": "http://www.wikidata.org/entity/Q458403", "itemLabel": "Mary Beard", "itemDescription": "English classicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Beard_(classicist)", "wikipedia_page": {"main": "Dame Winifred Mary Beard,  (born 1 January 1955) is an English scholar of Ancient Roman civilisation.\nShe is Professor of Classics at the University of Cambridge, a fellow of Newnham College, and Royal Academy of Arts Professor of Ancient Literature. She is the classics editor of The Times Literary Supplement, where she also writes a regular blog, \"A Don's Life\". Her frequent media appearances and sometimes controversial public statements have led to her being described as \"Britain's best-known classicist\".The New Yorker characterises her as \"learned but accessible\".", "link_mentions": [{"page": "Caligula", "response": ["On 17 January 2011, police in Nemi, Italy, announced that they believed they had discovered the site of Caligula's burial, after arresting a thief caught smuggling a statue which they believed to be of the emperor. The claim has been met with scepticism by Cambridge historian Mary Beard."]}, {"page": "January 1", "response": ["*  1955   – Mary Beard, English classicist, academic and presenter"]}, {"page": "Joke", "response": ["The earliest extant joke book is the Philogelos (Greek for The Laughter-Lover), a collection of 265 jokes written in crude ancient Greek dating to the fourth or fifth century AD. The author of the collection is obscure and a number of different authors are attributed to it, including \"Hierokles and Philagros the grammatikos\", just \"Hierokles\", or, in the Suda, \"Philistion\". British classicist Mary Beard states that the Philogelos may have been intended as a jokester's handbook of quips to say on the fly, rather than a book meant to be read straight through. Many of the jokes in this collection are surprisingly familiar, even though the typical protagonists are less recognisable to contemporary readers: the absent-minded professor, the eunuch, and people with hernias or bad breath. The Philogelos even contains a joke similar to Monty Python's \"Dead Parrot Sketch\"."]}, {"page": "James Randi", "response": ["* Weird Thoughts, Open Media discussion hosted by Tony Wilson for BBC TV, with Mary Beard and others, 1994"]}, {"page": "Latin", "response": ["In the United Kingdom, the Classical Association encourages the study of antiquity through various means, such as publications and grants. The University of Cambridge, the Open University, a number of prestigious independent schools, for example Eton, Harrow, Haberdashers' Aske's Boys' School, Merchant Taylors' School, and Rugby, and The Latin Programme/Via Facilis, a London-based charity, run Latin courses. In the United States and in Canada, the American Classical League supports every effort to further the study of classics. Its subsidiaries include the National Junior Classical League (with more than 50,000 members), which encourages high school students to pursue the study of Latin, and the National Senior Classical League, which encourages students to continue their study of the classics into college. The league also sponsors the National Latin Exam. Classicist Mary Beard wrote in The Times Literary Supplement in 2006 that the reason for learning Latin is because of what was written in it."]}, {"page": "March", "response": ["The name of March comes from Martius, the first month of the earliest Roman calendar. It was named after Mars, the Roman god of war, and an ancestor of the Roman people through his sons Romulus and Remus. His month Martius was the beginning of the season for warfare,Mary Beard, John North, and Simon Price, Religions of Rome (Cambridge University Press, 1998), pp. 47–48 and 53. and the festivals held in his honor during the month were mirrored by others in October, when the season for these activities came to a close.Michael Lipka, Roman Gods: A Conceptual Approach (Brill, 2009), p. 37. The views of Georg Wissowa on the festivals of Mars framing the military campaigning season are summarized by C. Bennett Pascal, \"October Horse,\" Harvard Studies in Classical Philology 85 (1981),  p. 264, with bibliography. Martius remained the first month of the Roman calendar year perhaps as late as 153 BC,H.H. Scullard, Festivals and Ceremonies of the Roman Republic (Cornell University Press, 1981), p. 84; Gary Forsythe, Time in Roman Religion: One Thousand Years of Religious History (Routledge, 2012), p. 14 (on the uncertainty of when the change occurred). and several religious observances in the first half of the month were originally new year's celebrations.Scullard, Festivals and Ceremonies of the Roman Republic, p. 85ff. Even in late antiquity, Roman mosaics picturing the months sometimes still placed March first.Aïcha Ben Abed, Tunisian Mosaics: Treasures from Roman Africa (Getty Publications, 2006), p. 113."]}, {"page": "Parthenon", "response": ["Archaeologist Joan Breton Connelly has recently argued for the coherency of the Parthenon's sculptural program in presenting a succession of genealogical narratives that track Athenian identity back through the ages: from the birth of Athena, through cosmic and epic battles, to the final great event of the Athenian Bronze Age, the war of Erechtheus and Eumolpos. She argues a pedagogical function for the Parthenon's sculptured decoration, one that establishes and perpetuates Athenian foundation myth, memory, values and identity.Joan Breton Connelly, The Parthenon Enigma,\"\" New York, Knopf, 2014, p. 35Daniel Mendelsohn, \"Deep Frieze\", The New Yorker, 14 April 2014 While some classicists, including Mary Beard, Peter Green, and Garry WillsMary Beard, \"The Latest Scheme for the Parthenon\", The New York Review of Books, 6 March 2014Mary Beard, Peter Green, Garry Wills \"‘The Parthenon Enigma’—An Exchange\", The New York Review of Books, 22 May 2014 have doubted or rejected Connelly's thesis, an increasing number of historians, archaeologists, and classical scholars support her work. They include: J.J. Pollitt, Brunilde Ridgway, Nigel Spivey, Caroline Alexander, and A. E. Stallings."]}, {"page": "Roman Empire", "response": ["When Juvenal complained that the Roman people had exchanged their political liberty for \"bread and circuses\", he was referring to the state-provided grain dole and the circenses, events held in the entertainment venue called a circus in Latin. The largest such venue in Rome was the Circus Maximus, the setting of horse races, chariot races, the equestrian Troy Game, staged beast hunts (venationes), athletic contests, gladiator combat, and historical re-enactments. From earliest times, several religious festivals had featured games (ludi), primarily horse and chariot races (ludi circenses).Mary Beard, J.A. North, and S.R.F. Price, Religions of Rome: A History (Cambridge University Press, 1998), p. 66. Although their entertainment value tended to overshadow ritual significance, the races remained part of archaic religious observances that pertained to agriculture, initiation, and the cycle of birth and death.Such as the Consualia and the October Horse sacrifice: Humphrey, pp. 544, 558; Auguste Bouché-Leclercq, Manuel des Institutions Romaines (Hachette, 1886), p. 549; \"Purificazione,\" in Thesaurus Cultus et Rituum Antiquorum (LIMC, 2004), p. 83."]}, {"page": "Vitellius", "response": ["Busts from the time of Vitellius, particularly the one in the Capitoline Museums,Wikimedia Commons represent him as broad-faced with several double chins, and it is this type which informs paintings of the emperor from the Renaissance on. There were once other ancient busts claimed to be of Vitellius which later scholarship has proved to be of someone else. The features of the Grimani Vitellius particularly, according to Mary Beard, were once used by painters to suggest that the character who bears them is destined to come to a bleak end.Sandra Alvarez, \"Emperor Spotting\" with Mary Beard\", Ancient History Magazine, 2 November 2017 Another such bust figures in Michiel Sweerts' Baroque genre piece of a young art student drawing a copy.\"Boy Drawing before the Bust of a Roman Emperor\", Minneapolis Institute of Arts"]}, {"page": "Zeus", "response": ["Depictions of Zeus as a bull, the form he took when abducting Europa, are found on the Greek 2-euro coin and on the United Kingdom identity card for visa holders. Mary Beard, professor of Classics at Cambridge University, has criticised this for its apparent celebration of rape.A Point of View: The euro's strange stories, BBC, retrieved 20 November 2011"]}, {"page": "1955", "response": ["** Mary Beard, English classicist"]}, {"page": "Jupiter (mythology)", "response": ["The Romans believed that Jupiter granted them supremacy because they had honoured him more than any other people had. Jupiter was \"the fount of the auspices upon which the relationship of the city with the gods rested.\"Mary Beard, J.A. North, and S.R.F. Price, Religions of Rome: A History (Cambridge University Press, 1998), vol. 1, p. 59. He personified the divine authority of Rome's highest offices, internal organization, and external relations. His image in the Republican and Imperial Capitol bore regalia associated with Rome's ancient kings and the highest consular and Imperial honours.Orlin, in Rüpke (ed), 58.", "The consuls swore their oath of office in Jupiter's name, and honoured him on the annual feriae of the Capitol in September. To thank him for his help, and to secure his continued support, they sacrificed a white ox (bos mas) with gilded horns.Scheid, in Rüpke (ed), 263–271; G. Dumézil ARR It. tr. p. 181 citing Jean Bayet Les annales de Tite Live édition G. Budé vol. III 1942 Appendix V p. 153 and n. 3. A similar sacrificial offering was made by triumphal generals, who surrendered the tokens of their victory at the feet of Jupiter's statue in the Capitol. Some scholars have viewed the triumphator as embodying (or impersonating) Jupiter in the triumphal procession.Dumézil 1977 p. 259 note 4: cf. Servius Eclogae X 27  \"unde etiam triumphantes habent omnia insignia Iovis, sceptrum palmatamque togam\" \"wherefore also the triumphing commanders have all the insignia of Jupiter, the sceptre and the toga palmata'\". On the interpretation of the triumphal dress and of the triumph, Larissa Bonfante has offered an interpretation based on Etruscan documents in her article : \"Roman Triumphs and Etruscan Kings: the Changing Face of the Triumph\" in  Journal of Roman Studies 60 1970 pp. 49–66 and tables I–VIII. Mary Beard rehearses various views of the triumphator as god or king in The Roman Triumph (Harvard University Press, 2007), pp. 226–232, and expresses skepticism.", "*Mary Beard, J.A. North, and S.R.F. Price, Religions of Rome: A History (Cambridge University Press, 1998)."]}, {"page": "Shropshire", "response": ["* Mary Beard, classicist and public personality at Cambridge University"]}, {"page": "Religious festival", "response": ["A major source for Roman holidays is Ovid's Fasti, a poem that describes and provides origins for festivals from January to June at the time of Augustus. Because it ends with June, less is known about Roman festivals in the second half of the year, with the exception of the Saturnalia, a religious festival in honor of Saturn on December 17 that expanded with celebrations through December 23. Probably the best-known Roman festival, some of its customs, such as gift-giving and the prevalence of candles, are thought to have influenced popular celebrations of Christmas.Mary Beard, J.A. North, and S.R.F. Price, Religions of Rome: A Sourcebook (Cambridge University Press, 1998), vol. 2, p. 124; Craig A. Williams, Martial: Epigrams Book Two (Oxford University Press, 2004), p. 259 (on the custom of gift-giving); entry on \"Bacchanalia and Saturnalia,\" in The Classical Tradition, p. 116; C. Bennet Pascal, \"October Horse,\" Harvard Studies in Classical Philology 85 (1981), p. 289."]}, {"page": "Arles", "response": ["Historians and archaeologists not affiliated with the French administration, among them Paul Zanker, the renowned archaeologist and expert on Caesar and Augustus, were quick to question whether the bust is a portrait of Caesar.Paul Zanker, \"Der Echte war energischer, distanzierter, ironischer\"  , Sueddeutsche Zeitung, May 25, 2008, on-lineMary Beard, \"The face of Julius Caesar? Come off it!\", TLS, May 14, 2008, on-line Nathan T. Elkins, 'Oldest Bust' of Julius Caesar found in France?, May 14, 2008, on-line Many noted the lack of resemblances to Caesar's likenesses issued on coins during the last years of the dictator's life, and to the Tusculum bust of Caesar,Cp. this image at the AERIA library which depicts Julius Caesar in his lifetime, either as a so-called zeitgesicht or as a direct portrait. After a further stylistic assessment, Zanker dated the Arles-bust to the Augustan period. Elkins argued for the third century AD as the terminus post quem for the deposition of the statues, refuting the claim that the bust was thrown away due to feared repercussions from Caesar's assassination in 44 BC.A different approach was presented by Mary Beard, in that members of a military Caesarian colony would not have discarded portraits of Caesar, whom they worshipped as god, although statues were in fact destroyed by the Anti-Caesarians in the city of Rome after Caesar's assassination (Appian, BC III.1.9). The main argument by the French archaeologists that Caesar had founded the colony in 46 BC proved to be incorrect, as the colony was founded by Caesar's former quaestor Tiberius Claudius Nero on the dictator's orders in his absence.Konrat Ziegler & Walther Sontheimer (eds.), \"Arelate\", in Der Kleine Pauly: Lexikon der Antike, Vol. 1, col. 525, Munich 1979; in 46 BC, Caesar himself was campaigning in Africa, before later returning to Rome. Mary Beard has accused the persons involved in the find of having willfully invented their claims for publicity reasons. The French ministry of culture has not yet responded to the criticism and negative reviews."]}, {"page": "Aius Locutius", "response": ["In the broad context of official Roman religion, Aius Locutius is exceptional. Officially, the gods might speak through the cryptic writings and utterances of specialised oracles, or through a complex system of signs in answer to the specific questions of State augurs. They might also grant signs of fortune to their most favoured protégés, or speak privately to them in dreams. Aius Locutius gave clear, urgent instructions of great importance to the State, in a voice \"clearer than human\", but in everyday Latin, to an ordinary plebeian passer-by. Thereafter, according to Cicero, \"having acquired a temple, an altar, and a name, 'Speaker' never spoke again\". Author's paraphrasis of Cicero, De divinatione, 2.69. As a trained augur, Cicero was obliged to successfully identify and expiate any prodigies, including such \"divine noise\" that might signal imminent disaster or divine discontent. Beard (2012) places Aius Locutius at the \"extraordinary limit\" of such sounds, for the unequivocal clarity of the warning, and the consequences of its rejection by Roman authorities; a god \"defined by his voice alone\".Mary Beard, \"Cicero's 'Response of the haruspices' and the Voice of the Gods\", pp. 28-29 in The Journal of Roman Studies, Vol. 102 (2012), pp. 20-39, Society for the Promotion of Roman Studies, available at JSTOR  (subscription required)"]}, {"page": "Felicitas", "response": ["A calendar from Cumae records that a supplicatio was celebrated on April 16 for the Felicitas of the Empire, in honor of the day Augustus was first acclaimed imperator.Mary Beard, J.A. North, and S.R.F. Price, Religions of Rome: A Sourcebook (Cambridge University Press, 1998), vol. 2, p. 70. In extant Roman coinage, Felicitas appears with a caduceus only during the Imperial period.Clark, Divine Qualities, p. 142. The earliest known example is Felicitas Publica on a dupondius issued under Galba.RIC i 205, no. 55; Clark, Divine Qualities, p. 10. Felicitas Temporum (\"Prosperity of the Times\"), reflecting a Golden Age ideology, was among the innovative virtues that began to appear during the reigns of Trajan and Antoninus Pius.Fears, \"The Cult of Virtues and Roman Imperial Ideology,\" p. 913ff. Septimius Severus, whose reign followed the exceedingly brief tenure of Pertinax and unsatisfactory conditions under Commodus, used coinage to express his efforts toward restoring the Pax Romana, with themes such as Felicitas Temporum and Felicitas Saeculi, \"Prosperity of the Age\" (saeculum), prevalent in the years 200 to 202.Along with an emphasis on continuity and permanence (victoria aeterna, \"perpetual victory\"; concordia aeterna, \"eternal harmony\"): Susann S. Lusnia, \"Urban Planning and Sculptural Display in Severan Rome: Reconstructing the Septizodium and Its Role in Dynastic Politics,\" in American Journal of Archaeology 108.4 (2004), pp. 534, 540. Some Imperial coins use these phrases with images of women and children in the emperor's family.Beryl Rawson, Children and Childhood in Roman Italy (Oxford University Press, 2005), pp. 64–68."]}, {"page": "Fontus", "response": ["An inscription includes Fons among a series of deities who received expiatory sacrifices by the Arval Brothers in 224 AD, when several trees in the sacred grove of Dea Dia, their chief deity, had been struck by lightning and burnt. Fons received two wethers.Mary Beard, J.A. North, and S.R.F. Price, Religions of Rome: A Sourcebook (Cambridge University Press, 1998), p. 152. Fons was not among the deities depicted on coinage of the Roman Republic.Michael H. Crawford, Roman Republican Coinage (Cambridge University Press, 1974, 2001), p. 914."]}, {"page": "Hellenism (modern religion)", "response": ["Emically speaking, \"revival\" accurately describes the religious activity occurring in Greece and around the world since one of the main hallmarks is group gatherings and public festival celebrations. Etic observations from a distance by classical scholars, describe contemporary practices as inauthentic and therefore irrelevant or remain open on the issue. British classicist Mary Beard criticized Greek Hellenists worshippers, saying, \"until these eager neo-pagans get real and slaughter a bull or two in central Athens, I shan’t worry that they have much to do with ancient religion at all\", later commented that, “I think I was really responding to the claims made by this group that they were reviving ancient paganism. I am absolutely ok with the idea that religions change. I was reacting to their claims to be a modern version of ancient ‘paganism’.” American classicist, Sarah Iles Johnston affirmed contemporary practice. \"The bricolage and re-imaginings of contemporary Pagans is not entirely different from that of ancient Greek religious culture and that even classical scholars inevitably re-imagine the gods.\" Revivalists view the tradition as a living, changing religion. Hellenic Revivalism allows room for practitioners to decide what feels right to them, and to adapt historical religious practices to modern life."]}, {"page": "Kenneth Clark", "response": ["Despite the family wealth: his parents were Liberal in outlook, and Ruskin's social and political views influenced the young Clark.Secrest, p. 11; and Stourton pp. 5 and 10 Mary Beard wrote in a Guardian article that Clark was a lifelong Labour voter.  His religious outlook was unconventional, but he believed in the divine, rejected atheism, and found the Church of England too secular in its outlook.Stourton, pp. 304–305  Shortly before his death he was received into the Roman Catholic Church.\"Memorial services: Lord Clark, OM, CH\", The Times, 14 October 1983, p. 14"]}, {"page": "Rhodes Scholarship", "response": ["Public criticism has also focused on the alleged hypocrisy of applying for and accepting the Rhodes Scholarship while criticising it, with University of Cambridge academic Mary Beard, writing in The Times Literary Supplement, arguing that Scholars \"[could not] have your cake and eat it here: I mean you can't whitewash Rhodes out of history, but go on using his cash.\" Reacting to this criticism, Qwabe replied that \"all that [Rhodes] looted must absolutely be returned immediately. I'm no beneficiary of Rhodes. I'm a beneficiary of the resources and labour of my people which Rhodes pillaged and slaved.\" A group of 198 Rhodes Scholars of various years later signed a statement supporting Qwabe and arguing that there was \"no hypocrisy in being a recipient of a Rhodes scholarship and being publicly critical of Cecil Rhodes and his legacy – a legacy that continues to alienate, silence, exclude and dehumanise in unacceptable ways. There is no clause that binds us to find 'the good' in Rhodes's character, nor to sanitise the imperialist, colonial agenda he propagated.\""]}]}}