{"wiki_id": "http://www.wikidata.org/entity/Q458755", "itemLabel": "Roland Culver", "itemDescription": "actor (1900-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roland_Culver", "wikipedia_page": {"main": "Roland Joseph Culver,  (31 August 1900 – 1 March 1984) was an English stage, film, and television actor.", "link_mentions": [{"page": "The Importance of Being Earnest", "response": ["Gielgud's performance is preserved on an EMI audio recording dating from 1952, which also captures Edith Evans's Lady Bracknell. The cast also includes Roland Culver (Algy), Jean Cadell (Miss Prism), Pamela Brown (Gwendolen) and Celia Johnson (Cecily).\"The Importance of Being Earnest\", WorldCat, accessed 28 July 2013"]}, {"page": "William Ewart Gladstone", "response": ["*Roland Culver in the television series The Life and Times of David Lloyd George (1981)"]}, {"page": "Here Comes Mr. Jordan", "response": ["Edward Everett Horton reprised his role as Messenger 7013 and Roland Culver took on the role of Mr Jordan in the film's sequel Down to Earth (1947). Warren Beatty later remade the film in 1978 as Heaven Can Wait. The 2001 film Down to Earth, starring Chris Rock, is also based on the play. "]}, {"page": "1948 in music", "response": ["*  The Emperor Waltz starring Bing Crosby, Joan Fontaine, Roland Culver, Richard Haydn and Lucille Watson.  Directed by Billy Wilder."]}, {"page": "Royal Academy of Dramatic Art", "response": ["* Roland Culver – (Thunderball)"]}, {"page": "Arthur Wing Pinero", "response": ["There have been many adaptations of Pinero's works for broadcasting. Television versions include The Gay Lord Quex (1946, 1953 and 1983, starring respectively  Ronald Ward, André Morell and Anton Rogers); The Magistrate (1946, 1951 and 1972, Desmond Walter-Ellis, Richard Goolden and Michael Hordern); Trelawny of the \"Wells\" (1949, 1971 and 1985, Bransby Williams,  Roland Culver, Michael Hordern); Dandy Dick (1948, directed by Athene Seyler) and The Second Mrs Tanqueray starring Elizabeth Sellars (1962).\"Pinero\", BBC Genome. Retrieved 17 February 2019"]}, {"page": "1982 in film", "response": ["| Britannia Hospital || EMI Films || Lindsay Anderson (director); David Sherwin (screenplay); Leonard Rossiter, Graham Crowden, Malcolm McDowell, Joan Plowright, Jill Bennett, Marsha Hunt, Brian Pettifer, John Moffatt, Fulton Mackay, Vivian Pickles, Barbara Hicks, Peter Jeffrey, Mary MacLeod, Robin Askwith, Dave Atkins, Mark Hamill, Frank Grimes, Gladys Crosbie, Richard Griffiths, Arthur Lowe, Alan Bates, Dandy Nichols, Betty Marsden, Liz Smith, T.P. McKenna, Michael Medwin, Roland Culver, Valentine Dyall, Tony Haygarth, John Gordon Sinclair, Brian Glover, Mike Grady, Kevin Lloyd, Robert Pugh, Robbie Coltrane, Patsy Byrne, Edward Hibbert || Black Comedy, Sci-Fi || Live action"]}, {"page": "1980 in film", "response": ["| Rough Cut || Paramount Pictures || Don Siegel (director); Larry Gelbart (screenplay); Burt Reynolds, Lesley-Anne Down, David Niven, Timothy West, Patrick Magee, Al Matthews, Susan Littler, Joss Ackland, Isabel Dean, Wolf Kahler, Andrew Ray, Julian Holloway, Douglas Wilmer, Geoffrey Russell, Ronald Hines, David Howey, Frank Mills, Roland Culver, Alan Webb, Cassandra Harris, Sue Lloyd, Cyril Appleton || Heist || Live action", "| Never Never Land || Sharp Features || Paul Annett (director); Petula Clark, Cathleen Nesbitt, John Castle, Anne Seymour, Heather Miller, Evelyn Laye, Roland Culver || Drama || Live action"]}, {"page": "Kenneth More", "response": ["Roland Culver recommended More audition for a part in a new play by Terence Rattigan, The Deep Blue Sea (1952); he was successful and achieved tremendous critical acclaim in the role of Freddie."]}, {"page": "Nicholas Monsarrat", "response": ["* The Ship That Died of Shame (1955), directed by Basil Dearden, starring Richard Attenborough, George Baker, Bill Owen, Virginia McKenna, Roland Culver, screenplay by Basil Dearden, Michael Relph, John Whiting."]}, {"page": "The Wednesday Play", "response": ["| Roland CulverLally BowersValerie WhiteJohn RinghamJohn SavidentSheila GrantHarry LittlewoodSylvia ColeridgePaul GreenhalghPeter Stenson", "| Roland CulverGareth ForwoodJames CosmoDavid RowlandsRaymond AdamsonNorman MitchellMoray WatsonJohn Nettleton"]}, {"page": "An Ideal Husband", "response": ["The first West End revival was presented by George Alexander  in May 1914 at the St James's Theatre, and featured Arthur Wontner as Sir Robert Chiltern, Phyllis Neilson-Terry as Lady Chiltern, Hilda Moore as Mrs Cheveley and Alexander as Lord Goring. The play was next staged in London at the Westminster Theatre in 1943–44, with Manning Whiley as Sir Robert Chiltern, Rosemary Scott as Lady Chiltern, Martita Hunt as Mrs Cheveley, Roland Culver as Lord Goring and Irene Vanbrugh as Lady Markby.\"An Ideal Husband\", This is Theatre. Retrieved 16 April 2021"]}, {"page": "The First of the Few", "response": ["|Roland Culver || Commander Bride"]}, {"page": "List of James Bond allies", "response": ["* Foreign Secretary (played by Roland Culver)"]}, {"page": "Dead of Night", "response": ["*Roland Culver as Eliot Foley"]}, {"page": "Bonjour Tristesse (film)", "response": ["Bonjour Tristesse (French \"Hello, Sadness\") is a 1958 British-American Technicolor film in CinemaScope, directed and produced by Otto Preminger from a screenplay by Arthur Laurents based on the novel of the same name by Françoise Sagan. The film stars Deborah Kerr, David Niven, Jean Seberg, Mylène Demongeot and Geoffrey Horne, and features Juliette Gréco, Walter Chiari, Martita Hunt and Roland Culver. It was released by Columbia Pictures. This film had color and black-and-white sequences, a technique unusual for the 1950s, but widely used in silent movies and early sound movies."]}, {"page": "One of Our Aircraft Is Missing", "response": ["* Roland Culver as Naval Officer"]}, {"page": "Play of the Month", "response": ["|Athene Seyler,Vivien Merchant,Kathleen Harrison,Michael Gwynn,Roland Culver,Margaret Leighton", "|Freddie Jones,Anthony Hopkins,Ann Bell,Roland Culver,Jenifer Armitage,John Baskcomb,Richard Beale,Stacey Tendeter", "|John Alderton,Graham Crowden,Lally Bowers,Roland Culver,Ian Ogilvy,Anthony Ainley,Lila Kaye,John Dearth,John Cater,Godfrey James,Henry Woolf"]}, {"page": "Perfect Strangers (1945 film)", "response": ["Perfect Strangers (United States title: Vacation from Marriage), is a 1945 drama film made by London Films. It stars Robert Donat and Deborah Kerr as a married couple whose relationship is shaken by their service in the Second World War. The supporting cast includes Glynis Johns, Ann Todd and Roland Culver. It was produced and directed by Alexander Korda from a screenplay by Clemence Dane and Anthony Pelissier based on a story by Clemence Dane. Dane won the Academy Award for Best Story. The music score was by Clifton Parker and the cinematography by Georges Périnal.", "*Roland Culver as Richard"]}, {"page": "The Legend of Hell House", "response": ["*Roland Culver as Rudolph Deutsch"]}, {"page": "Clive Brook", "response": ["Brook returned to England in 1935 because of kidnapping threats toward his children. In 1943, he adapted the comedy On Approval by Frederick Lonsdale and wrote, produced, directed and starred in the film with Beatrice Lillie, Googie Withers and Roland Culver. The costumes were by Cecil Beaton."]}, {"page": "The Life and Times of David Lloyd George", "response": ["* Roland Culver - William Ewart Gladstone"]}, {"page": "Night Train to Munich", "response": ["* Roland Culver as Roberts"]}, {"page": "Tony Award for Best Actor in a Play", "response": ["| Roland Culver"]}, {"page": "Britannia Hospital", "response": ["* Roland Culver as General Wetherby"]}, {"page": "The Iron Maiden", "response": ["* Roland Culver as Lord Upshott"]}, {"page": "French Without Tears", "response": ["*Commander Bill Rogers - Roland Culver"]}, {"page": "Ashenden: Or the British Agent", "response": ["*In the 1950 anthology film Trio, Ashenden was played by Roland Culver in the third story called \"Sanatorium\"."]}, {"page": "Daphne Rye", "response": ["She was married three times. Her marriages to the actor Roland Culver and Dr John Janvrin were dissolved. Sam Ainley, her last husband, predeceased her. Rye had two sons from her first marriage, actor Michael Culver and painter Robin Culver.", "* Roland Culver obituary (2 March 1984). Associated Press."]}, {"page": "The Hunchback of Notre Dame (1982 film)", "response": ["*Roland Culver as Bishop of Paris"]}, {"page": "Espionage (TV series)", "response": ["| Castles in Spain || 19 February 1964 || Anton M. Leader || Roland Culver, David Spenser"]}, {"page": "Michael Culver", "response": ["Michael Culver (born 16 June 1938) is an English actor. He was born in Hampstead, London, the son of actor Roland Culver and casting director Daphne Rye. He was educated at Gresham's School."]}, {"page": "Down to Earth (1947 film)", "response": ["Down to Earth is a 1947 musical comedy film starring Rita Hayworth, Larry Parks, and Marc Platt, and directed by Alexander Hall. The film is a sequel to the 1941 film Here Comes Mr. Jordan, also directed by Hall. While Edward Everett Horton and James Gleason reprised their roles from the earlier film, Roland Culver replaced Claude Rains as Mr. Jordan.", "* Roland Culver as Mr. Jordan"]}, {"page": "The Caesars (TV series)", "response": ["* Roland Culver as Augustus"]}, {"page": "The Pallisers", "response": ["The series begins with the story of Lady Glencora (Susan Hampshire), fiancée of the dry, aristocratic Plantagenet Palliser (Philip Latham) who will inherit the title of the Duke of Omnium and Gatherum from his uncle (Roland Culver). Although they marry, Lady Glencora still pines for her unsuitable but handsome admirer Burgo Fitzgerald (Barry Justice).", "*Roland Culver: Duke of Omnium and Gatherum"]}, {"page": "Rough Cut (1980 film)", "response": ["* Roland Culver as Mr. Lloyd Palmer "]}, {"page": "See How They Run (play)", "response": ["See How They Run is an English comedy in three acts by Philip King. Its title is a line from the nursery rhyme \"Three Blind Mice\". It is considered a farce for its tense comic situations and headlong humour, heavily playing on mistaken identity, doors, and vicars. In 1955 it was adapted as a film starring Roland Culver."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Roland Culver (Acting Diploma 1926)"]}, {"page": "A Man Could Get Killed", "response": ["* Roland Culver as Dr. Mathieson"]}, {"page": "Thunderball (film)", "response": ["* Roland Culver as the Home Secretary: British Minister who briefs the \"00\" agents for Operation Thunderball and has doubts about Bond's efficiency"]}]}}