{"wiki_id": "http://www.wikidata.org/entity/Q45852887", "itemLabel": "Johnnie Spence", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Johnnie_Spence", "wikipedia_page": {"main": "Johnnie Spence, born John Spence Abrahams (4 February 1936 – 15 August 1977), sometimes spelt Johnny Spence, was a British musical arranger, director, and orchestra leader. He is credited with the arrangements and musical direction of numerous records and television light entertainment works throughout the 1960s and 1970s, and was nominated for an Emmy Award for Outstanding Achievement in Music Direction of a Variety, Musical or Dramatic Program for his work on the 1969 television series This Is Tom Jones.", "link_mentions": [{"page": "Matt Monro", "response": ["Monro also covered many of the most popular stage and screen songs of the 1950s and 1960s. Over the years, his recordings featured arrangements by Sid Feller, Billy May, John Barry, Buddy Bregman, Kenny Clayton and Colin Keyes, and Martin himself. He also had a long and fruitful musical partnership with British arranger Johnnie Spence. Monro also teamed up with American star arrangers Nelson Riddle and Billy May and leading British bandleader Ted Heath, for concerts broadcast by the BBC."]}, {"page": "Hello, Dolly! (Ella Fitzgerald album)", "response": ["* Johnnie Spence - Conductor"]}, {"page": "Sentimental Journey (Ringo Starr album)", "response": ["*Johnnie Spence – conductor on \"Blue, Turning Grey Over You\""]}, {"page": "John Spence", "response": ["* Johnnie Spence (died 1977), British musical director"]}, {"page": "Where Am I Going?", "response": ["* Johnnie Spence - musical arranger"]}, {"page": "The Look of Love (Dusty Springfield album)", "response": ["*Johnnie Spence – musical arranger"]}, {"page": "Right Said Fred (song)", "response": ["\"Right Said Fred\" was recorded as a single by Bernard Cribbins and released by Parlophone in 1962. It reached number 10 in the UK Singles Chart.David Roberts. British Hit Singles & Albums. Guinness World Records Limited Cribbins recorded it at the Abbey Road Studios with musical accompaniment, directed by Johnnie Spence."]}, {"page": "Elizabeth Taylor in London", "response": ["The music was composed by John Barry, who was nominated for a 1964 Grammy Award for Outstanding Original Music.Elizabeth Taylor in London soundtrack - John Barry The original album has been re-released on CD with many of the tracks available in the public domain on various John Barry collections. The tune \"Greensleeves\" occurs throughout the score. Unusually, it was not Barry but Johnnie Spence who conducted the score for the film and album release. Like Barry, Spence was signed to Ember Records: as Matt Monro's musical director, he had conducted the version of Barry's From Russia with Love song used in the film earlier in 1963."]}, {"page": "Back to Front (Gilbert O'Sullivan album)", "response": ["Mills decided to double-track most of O'Sullivan's vocals on the album, just as he had on the 1971 single \"No Matter How Hard I Try\". O'Sullivan reflected that: \"The interesting thing about double-tracking is, the less mature your voice, the better it sounds. The better your voice gets, the less it works. So at this point, I wasn't too mad about all the double-tracking on Back to Front.\" Johnnie Spence returns from Himself to provide arrangements throughout the album, though Frank Barbara arranged the song \"That's Love\" when Spence was unavailable.", "Similarly to Himself, the album is bookended by short intro and outro songs. The intro track invites listeners to \"join the hunt,\" and seamlessly segues into \"I Hope You Stay\", which concerns romance and unemployment, which is then followed by \"In My Hole,\" an orchestral pop song with a Johnnie Spence-scored trumpet part reminiscent of Hugh Masekela's 1968 jazz hit \"Grazing in the Grass\" and lyrics concerning an introverted 'hermit' who refuses to engage with the world around him. \"Clair\", meanwhile, concerns O'Sullivan's babysitting of Mills' daughter Clair, and finds the singer in his \"distracted interior monologue\" mode. He wrote the song to Clair's parents as \"almost a thank you to them.\" \"That's Love\" is a characteristically off-kilter love song with a doo-wop turnaround chord sequence, while \"Can I Go with You\" is a tribute to the early work of the Beatles, exuding a youthful idealism, themes of young romance and the \"chiming romanticism\" style of Paul McCartney. These songs are followed by \"But I'm Not,\" which features a twelve-bar blues structure in the style of Fats Domino, who O'Sullivan was introduced to by Rick Davies, O'Sullivan's former Rick's Blues bandmate and later a member of Supertramp. The song is suffixed by an \"outro\" to side one.", "* Johnnie Spence – arrangements"]}, {"page": "Cilla (album)", "response": ["Cilla is the debut studio album by British singer Cilla Black, released on 25 January 1965 by Parlophone Records. The album was a commercial success, reaching No. 5 on the UK Albums Chart.www.Official Charts Company Cilla Black Cilla Official Charts Company The tracks were directed by John Scott, Johnnie Spence and George Martin. Sounds Incorporated accompany her on \"Love Letters\"."]}, {"page": "Play It Again (record label)", "response": ["The Ember Years - Volume Two contained the jazz album (A Handful Of Songs) recorded in 1963 by Annie Ross, plus John Barry's music from Zulu. The former utilised the services of conductor Johnnie Spence and sound engineer Eric Tomlinson, whilst Barry was the record producer."]}, {"page": "A Summer Song", "response": ["The selection was one of a number to be included on the Yesterday's Gone album recorded at CTS Studios Bayswater in June 1964 under the production auspices of Shel Talmy, with Johnnie Spence conducting the orchestra."]}, {"page": "Apache (instrumental)", "response": ["* In 1960, Jerry Lordan recorded his own version together with the Johnnie Spence Orchestra."]}, {"page": "Let There Be Love (Bee Gees song)", "response": ["* Tom Jones covered the song and released it as the closing track on the album Tom in 1970. It was arranged by Johnnie Spence, engineered by Bill Price and produced by Peter Sullivan."]}, {"page": "Himself (Gilbert O'Sullivan album)", "response": ["Himself is the debut album by Irish singer-songwriter Gilbert O'Sullivan, first released in the United Kingdom in August 1971 by MAM Records, following the success of the Top 10 hit \"Nothing Rhymed\", which features on the album. It was produced by Gordon Mills, whom O'Sullivan had contacted after failing to achieve success for three years. The album was originally conceived by O'Sullivan to feature only his voice and piano playing, until Mills persuaded him to use full instrumentation and arrangements by Johnnie Spence. Mills also aided O'Sullivan with his songwriting, which incorporates an observational style and word play, the usage of the latter being influenced by Spike Milligan.", "Gordon Mills produced Himself, which was recorded at Audio International Studios in London with sessions beginning in November 1970. With engineer Peter Rynston, recording sessions would last three hours and would also feature arranger Johnnie Spence. Gilbert O'Sullivan's original intention was to record the album with just piano and voice, but Mills persuaded him to use full instrumentation and string arrangements. In a 1971 interview, O'Sullivan elaborated: \"Gordon says work up to it gradually so probably by the time of my third album it will be done like that. If I'd done it with piano and voice it wouldn't have been successful. It's a question of what fits the songs and I think the backings are appropriate\". Mills had a strong influence even on the structure of the songs, as O'Sullivan would write \"three middle eights and three times as many verses\" and Mills would pick out which lyrics he found best. O'Sullivan considered it \"an awful lot of fun\" to have alternatives to play around with.", "The album begins with a short intro in which O'Sullivan introduces \"this, my first LP debut\". This is followed by \"January Git\", which features a show tune-style horn arrangement by Johnnie Spence. \"Permissive Twit\" was recorded solo in a spare half-hour at the end of a recording session. It tells the story of \"Our Linda\" and her unwanted pregnancy with the baby of the titular twit (\"She thinks his name was Ronald or was it Sid or Len\").  Her family, trying to uphold working class respectability, are mortified about the neighbours knowing but are resigned to letting nature take its course. Watts singled out \"Permissive Twit\" as \"the best song Gilbert has written so far.\" \"Matrimony\", concerning a couple getting wed at the registrar's, garnered much airplay. It saw a belated single release in November 1976 but failed to chart. Despite this lack of chart success, it has become one of O'Sullivan's most famous songs. \"Independent Air\" was one of two songs recorded in the first session for the album, the other being \"Nothing Rhymed\".", "*Johnnie Spence - arrangements"]}, {"page": "I'm a Writer, Not a Fighter", "response": ["The recording of I'm a Writer, Not a Fighter departed from O'Sullivan's previous two albums, as instead of recording within several three hour sessions in various studios, O'Sullivan and his manager and producer Gordon Mills recorded the album \"on and off\" in early 1973 at Mills' recently built studio located beside his home, spending a total of several days in the studio. Mills would play keyboards and add backing vocals to tracks, while a rhythm section was also in place and Johnnie Spence returned to provide string arrangements. Although several overdubs were recorded in the United States, O'Sullivan ultimately referred to the album as largely \"a very ad hock home based project,\" which he felt gave the resulting album a \"continuity running through it, unlike perhaps the previous two albums.\" In August 1973, around the time of the album's completion, O'Sullivan moved house as he felt \"too vulnerable.\"", "*Johnnie Spence – arrangements"]}, {"page": "A Stranger in My Own Back Yard", "response": ["As with Gilbert O'Sullivan's previous albums, A Stranger in My Own Back Yard was produced by Gordon Mills and arranged by Johnnie Spence. The album was O'Sullivan's first not to be recorded at London's Audio International Studios. Sessions instead took place in two American studios: New York's  A & R Recording, where recordings were engineered by Phil Ramone, and at Los Angeles's Sunset Sound Factory, engineered by John Haeny. O'Sullivan would not make another album produced by Gordon Mills. After the release of A Stranger in My Own Back Yard, O'Sullivan discovered his recording contract with MAM Records greatly favoured Mills, and a lawsuit followed.", "* Johnnie Spence - arranger"]}, {"page": "Southpaw (album)", "response": ["* Johnnie Spence - arranger, conductor"]}, {"page": "My Kind of Girl", "response": ["\"My Kind of Girl\" was first released by Matt Monro, and was written by Leslie Bricusse. In February 1961, the British music magazine NME reported that Monro had won ITV's A Song for Britain with \"My Kind of Girl\"; however, according to his daughter Michele's autobiography Matt Monro: The Singer's Singer, Monro came second in this, although the song would later win an Ivor Novello award for \"The Most Performed Work of the Year\". Shortly after the result was announced, Monro, George Martin and Johnnie Spence sped into the studio to record the song but had to record the song's B-side, \"This Time\", beforehand since Spence had left it until late to hand Vic Fraser the score for the record and the copyist had not finished copying the parts for the orchestra.Monro, Michele (2012) Matt Monro: The Singer's Singer, Titan Books. pp. 224-225. Retrieved 13 March 2018."]}, {"page": "Tom Jones Live in Las Vegas", "response": ["Performed and recorded during one of the peaks of his popularity, due to his TV series, This is Tom Jones (from 1969 to 1971) and several hit singles in the late 1960s (\"It's Not Unusual\", \"What's New Pussycat?\", \"Green, Green Grass of Home\", \"Love Me Tonight\"), Tom Jones and his accompanying band, led by Johnnie Spence, gave a tight and highly energetic performance.  Jones' band featured some of the top studio musicians of the day, including Big Jim Sullivan on guitar and Chris Slade (The Firm, AC/DC) on drums.  Jones acknowledged these musicians to the audience at the beginning of the sixth track, \"Danny Boy\" - stating \"I brought with me from England three of the finest musicians that we have there...on drums, we have Chris, on bass, we have John, and on lead guitar, we have Jimmy.\"  Typically a harsh critic of inferior music, Buddy Rich, on The Mike Douglas Show in 1971, stated \"The band that plays behind Tom Jones is one of the great bands of all time.\"", "* Johnnie Spence – conductor, arranger"]}, {"page": "Primetime Emmy Award for Outstanding Music Direction", "response": ["| Johnnie Spence"]}, {"page": "Johnnie Spence and his Orchestra", "response": ["#RedirectJohnnie Spence"]}, {"page": "Love Me Tonight (Tom Jones song)", "response": ["The song was arranged by Johnnie Spence and produced by Peter Sullivan."]}, {"page": "Greg Bowen", "response": ["* 1968 Why Not! (Philips) Johnnie Spence Big Band"]}, {"page": "Gossip Calypso", "response": ["\"Gossip Calypso\" is a novelty calypso song written by Trevor Peacock. It was recorded by Bernard Cribbins and released by EMI on the Parlophone label in 1962. The musical accompaniment was directed by Johnnie Spence, and the producer was George Martin. It reached number 23 in the UK Singles Chart, and was Cribbins' third top 30 hit of the year. "]}]}}