{"wiki_id": "http://www.wikidata.org/entity/Q459344", "itemLabel": "Beryl Reid", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Beryl_Reid", "wikipedia_page": {"main": "Beryl Elizabeth Reid,  (17 June 1919 – 13 October 1996), was an English actress of stage and screen. She won the 1967 Tony Award for Best Actress in a Play for The Killing of Sister George, the 1980 Olivier Award for Best Comedy Performance for Born in the Gardens, and the 1982 BAFTA TV Award for Best Actress for Smiley's People. Her film appearances included The Belles of St. Trinian's (1954), The Killing of Sister George (1968), The Assassination Bureau (1969), and No Sex Please, We're British (1973).", "link_mentions": [{"page": "June 17", "response": ["*  1919   – Beryl Reid, English actress (d. 1996)"]}, {"page": "October 13", "response": ["*1996 – Beryl Reid, English actress (b. 1919)"]}, {"page": "Peter Cook", "response": ["Cook starred in the LWT special Peter Cook & Co. in 1980. The show included comedy sketches, including a Tales of the Unexpected parody \"Tales of the Much As We Expected\". This involved Cook as Roald Dahl, explaining his name had been Ronald before he dropped the \"n\". The cast included Cleese, Rowan Atkinson, Beryl Reid, Paula Wilcox, and Terry Jones. Partly spurred by Moore's growing film star status, Cook moved to Hollywood in that year, and appeared as an uptight English butler to a wealthy American woman in a short-lived United States television sitcom, The Two of Us, also making cameo appearances in a couple of undistinguished films."]}, {"page": "1996", "response": ["* October 13 – Beryl Reid, British actress (b. 1919)"]}, {"page": "British sitcom", "response": ["West Yorkshire, whose theme tune for The Good Life is among his memorable credits.  He was a successful light entertainment composer and musical director including his  arrangements for  comedienne Beryl Reid's 1968-67  Beryl Reid Says Good Evening. He collaborated with many stars including Judy Garland, Pearl Bailey, Sammy Davis Jr., Vic Damone and Bruce Forsyth.   Rhodes was often referred to as \"the musicians’ musician\". He counted musicians such as Ronnie Hazlehurst, Monty Norman and Phil Phillips among his friends.  In 1958 he scored the theme  for  Dr No, the first James Bond film."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["Her habits were parodied by the satirical 1980s television programme Spitting Image. This was the first satirical depiction on television; the makers initially demurred from featuring her, fearing that it would be considered off-limits by most of the viewing public. In the end, she was portrayed as a perpetually tipsy Beryl Reid soundalike. She was portrayed by Juliet Aubrey in Bertie and Elizabeth, Sylvia Syms in The Queen, Natalie Dormer in W.E., Olivia Colman in Hyde Park on Hudson, Victoria Hamilton (Seasons 1 and 2) and Marion Bailey (Seasons 3 and 4) in The Crown, and in The King's Speech by Helena Bonham Carter, who was nominated for an Academy Award for Best Supporting Actress and won a BAFTA Award for Best Actress in a Supporting Role for her portrayal."]}, {"page": "Hereford", "response": ["Broadcaster Gilbert Harding was born there when his father was master of the local workhouse, as was contemporary actress Beryl Reid."]}, {"page": "Eric Sykes", "response": ["Sykes wrote and appeared in two Thames Television specials broadcast during 1980 – The Likes of Sykes and Rhubarb Rhubarb. The latter special, a remake of his 1969 short film Rhubarb which Sykes also directed, featured many of his old friends including Jimmy Edwards, Bob Todd, Charlie Drake, Bill Fraser, Roy Kinnear, Beryl Reid, and Norman Rossington. It was his last screen appearance with Hattie Jacques. The film employed an idea drawn from the British showbiz tradition in which extras used the word \"rhubarb\" to simulate low-level background dialogue, which had also been a running joke in The Goon Show. In 1981, Sykes wrote, directed, and starred in the offbeat comedy If You Go Down in the Woods Today for Thames, with a cast including Roy Kinnear, Fulton Mackay, and George Sewell."]}, {"page": "Hampstead", "response": ["Hampstead's rural feel lends itself for use in film, a notable example being The Killing of Sister George (1968) starring Beryl Reid and Susannah York. The opening sequence has Reid's character June wandering through the streets and alleyways of Hampstead, west of Heath Street, around The Mount Square. The Marquis of Granby pub, in which June drinks at the opening of the film, was actually The Holly Bush,\"The Killing of Sister George film locations\" . Movie-Locations.com (Retrieved 18 June 2009) at 22 Holly Mount. Another example is The Collector (1965), starring Terence Stamp and Samantha Eggar, where the kidnap sequence is set in Mount Vernon."]}, {"page": "Two-Way Stretch", "response": ["* Beryl Reid as Miss Pringle"]}, {"page": "Hattie Jacques", "response": ["On 6 June 1950 Jacques was cast in the first episode of the weekly radio show Educating Archie as Agatha Dinglebody. The \"Archie\" of the title was the ventriloquist's dummy Archie Andrews, operated by Peter Brough. The first series ran for 29 weeks until 19 December. In the show Jacques appeared alongside Max Bygraves, Julie Andrews, Beryl Reid and—in the second series—Tony Hancock. It was on this programme that she first worked with Eric Sykes, who was providing scripts for the series. Sykes had been impressed with Jacques since he visited the Players' in 1948. He later wrote that she \"moved about the stage with an elegance and grace as if she owned it. At the end of her act, to great applause, she leapt in the air, finishing in the splits, landing as softly as a snowflake in July\". After the show Sykes was introduced to Jacques backstage and thought that the meeting was \"the beginning of a new flight\" in his professional life. At the end of the series Jacques returned to the Players' to appear in the Christmas pantomime, Ali Baba and the Thirty-nine Thieves, which she and Joan Sterndale-Bennett had adapted after they had copied it out long-hand at the British Museum. The reviewer in The Times thought that Jacques was \"as appealing as last year\", in her performance as Ali Baba's wife, Cogia."]}, {"page": "1996 in film", "response": ["| style=\"text-align:center;\"| 13 || Beryl Reid || style=\"text-align:center;\"| 77 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "1983 in film", "response": ["| Yellowbeard || Orion Pictures / Hemdale Film Corporation || Mel Damski (director); Graham Chapman, Peter Cook, Bernard McKenna, David Sherlock (screenplay); Graham Chapman, Peter Boyle, Cheech Marin, Tommy Chong, Peter Cook, Marty Feldman, Martin Hewitt, Michael Hordern, Eric Idle, Madeline Kahn, James Mason, John Cleese, Kenneth Mars, Spike Milligan, Stacey Nelkin, Nigel Planer, Susannah York, Beryl Reid, Ferdy Mayne, Peter Bull, Bernard Fox, Nigel Stock, Monte Landis, David Bowie, Greta Blackburn || Comedy || Live action"]}, {"page": "1977 in film", "response": ["| Joseph Andrews || United Artists / Paramount Pictures / Woodfall Film Productions || Tony Richardson (director); Chris Bryant (screenplay); Ann-Margret, Peter Firth, Michael Hordern, Beryl Reid, Jim Dale, Beryl Reid, Natalie Ogle, John Gielgud, Hugh Griffith, Peter Bull, Karen Dotrice, Peggy Ashcroft, James Villiers, Timothy West, Wendy Craig, Ronald Pickup, Penelope Wilton, Kenneth Cranham, Norman Rossington, Patsy Rowlands || Period, Comedy || Live Action "]}, {"page": "1970 in film", "response": ["*Entertaining Mr Sloane, starring Beryl Reid and Harry Andrews - (U.K.)"]}, {"page": "1968 in film", "response": ["*The Killing of Sister George, directed by Robert Aldrich, starring Beryl Reid, Susannah York and Coral Browne"]}, {"page": "Golden Globe Award for Best Actress in a Motion Picture – Drama", "response": ["| Beryl Reid || June \"George\" Buckridge || The Killing of Sister George"]}, {"page": "1965 in literature", "response": ["*June 17 – The London première of Frank Marcus' farce The Killing of Sister George (at the Duke of York's Theatre) is among the first mainstream British plays with lesbian characters. Beryl Reid plays the title rôle. It has been previewed in April at the Bristol Old Vic."]}]}}