{"wiki_id": "http://www.wikidata.org/entity/Q459606", "itemLabel": "Ambrosius Aurelianus", "itemDescription": "post-Roman leader in Britain", "wikipedia_url": "https://en.wikipedia.org/wiki/Ambrosius_Aurelianus", "wikipedia_page": {"main": "Ambrosius Aurelianus (Welsh: Emrys Wledig; Anglicised as Ambrose Aurelian and called  Aurelius Ambrosius in the Historia Regum Britanniae and elsewhere) was a war leader of the Romano-British who won an important battle against the Anglo-Saxons in the 5th century, according to Gildas. He also appeared independently in the legends of the Britons, beginning with the 9th-century Historia Brittonum. Eventually he was transformed by Geoffrey of Monmouth into the uncle of King Arthur, the brother of Arthur's father Uther Pendragon, as a ruler who precedes and predeceases them both. He also appears as a young prophet who meets the tyrant Vortigern; in this guise, he was later transformed into the wizard Merlin.", "link_mentions": [{"page": "King Arthur", "response": ["Several historical figures have been proposed as the basis for Arthur, ranging from Lucius Artorius Castus, a Roman officer who served in Britain in the 2nd or 3rd century, to sub-Roman British rulers such as Riotamus, Ambrosius Aurelianus, Owain Ddantgwyn, the Welsh king Enniaun Girt, and Athrwys ap Meurig. However, no convincing evidence for these identifications has emerged.David, Brian, Review of Nicholas J. Higham, King Arthur: The Making of the Legend in Comitatus: A Journal of Medieval and Renaissance Studies 50:221-222 (2019)  "]}, {"page": "Merlin", "response": ["Geoffrey was also further inspired by Emrys (Old Welsh: Embreis), a character based in part on the 5th-century historical figure of the Romano-British war leader Ambrosius Aurelianus.Ashe, Geoffrey. The Discovery of Arthur, Owl Books, 1987. When Geoffrey included Merlin in his next work, Historia Regum Britanniae (c. 1136), he supplemented his characterisation by attributing to Merlin stories concerning Ambrosius, taken from one of his primary sources, the early 9th-century Historia Brittonum attributed to Nennius. In Nennius' account, Ambrosius was discovered when the British king Vortigern attempted to erect a tower at Dinas Emrys. More than once, the tower collapsed before completion. Vortigen's wise men advised him that the only solution was to sprinkle the foundation with the blood of a child born without a father. Ambrosius was rumoured to be such a child. When brought before the king, Ambrosius revealed that below the foundation of the tower was a lake containing two dragons battling into each other, representing the struggle between the invading Saxons and the native Celtic Britons. Geoffrey retold the story in his Historia Regum Britanniæ, adding new episodes that tie Merlin with King Arthur and his predecessors. Geoffrey stated that this Ambrosius was also called \"Merlin\", therefore Ambrosius Merlinus, and kept him separate from Aurelius Ambrosius."]}, {"page": "Wessex", "response": ["Theories about the settlement of Saxons, Jutes and Angles in Britain are divided into two categories by the historian Peter Hunter Blair (1956), namely \"Welsh\" and \"English\". The Welsh tradition is exemplified by Gildas, in De Excidio et Conquestu Britanniae. In brief, it states that after the Romans left, the Celtic Britons managed to continue for a time without any major disruptions. However, when finally faced with northern invaders, a certain unnamed ruler in Britain (called \"a proud tyrant\" by Gildas) requested assistance from the Saxons in exchange for land. There were no conflicts between the British and the Saxons for a time, but following \"a dispute about the supply of provisions\" the Saxons warred against the British and severely damaged parts of the country. In time, however, some Saxon troops left Britain; under Ambrosius Aurelianus, the British subsequently defeated those who remained. A lengthy conflict ensued, in which neither side gained any decisive advantage until the Britons routed the Saxons at the Battle of Mons Badonicus. After this, there occurred a peaceful period for the Britons, under which Gildas was living at the time he wrote the De Excidio et Conquestu Britanniae.Blair 2003, pp. 13–14 One of the \"English\" traditions about the Saxon arrival concerns Hengest and Horsa. When Bede wrote his Ecclesiastical History of the English People, he adapted Gildas' narrative and added details, such as the names of those involved. To the \"proud tyrant\" he gave the name Vortigern, and the Saxon commanders he named Hengest and Horsa. Further details were added to the story in the Historia Brittonum, which was partially written by Nennius. According to the Historia, Hengest and Horsa fought the invaders of Britain under the condition of gaining the Island of Thanet. The daughter of Hengest, Rowena, later arrived on a ship of reinforcements, and Vortigern married her. However, a war arose in Kent due to a dispute between Hengest and Vortigern's son. After losing several battles, the Saxons finally defeated the British by treacherously attacking them once the two parties had convened for a meeting. Some additional details of the Hengest and Horsa legend are found in the Anglo-Saxon Chronicle. The Chronicle then records subsequent Saxon arrivals, including that of Cerdic, the founder of Wessex, in 495.Blair 2003, pp. 14–16"]}, {"page": "439", "response": ["* Battle of Guoloph: Vitalinus (possibly Vortigern) is defeated at the hands of Ambrosius Aurelianus, and a combined force of Romano-British forces from across southern Britain."]}, {"page": "459", "response": ["* King Vortigern is burnt to death, while being besieged by a Romano-British force under Ambrosius Aurelianus at Ganarew (Herefordshire). "]}, {"page": "479", "response": ["* Ambrosius Aurelianus, war leader of the Romano-British, is proclaimed king of the Britons (according to Historia Regum Britanniae). He rules probably in the south of Britain, and continues the war against the Anglo-Saxons. "]}, {"page": "437", "response": ["* Battle of Wallop: Ambrosius Aurelianus, leader of the Romano-British, defeats the Anglo Saxons under King Vortigern. He is given all the kingdoms of the western side of Britain (according to Historia Brittonum)."]}, {"page": "Battle of Badon", "response": ["The earliest mention of the Battle of Badon is Gildas' De Excidio et Conquestu Britanniae (On the Ruin and Conquest of Britain), written in the early to mid-6th century. In it, the Anglo-Saxons are said to have \"dipped [their] red and savage tongue in the western ocean\" before Ambrosius Aurelianus organized a British resistance with the survivors of the initial Saxon onslaught. Gildas describes the period that followed Ambrosius' initial success:"]}, {"page": "Gildas", "response": ["The work is a sermon in three parts condemning the acts of his contemporaries, both secular and religious.Butler, Rev. Alban, \"The Lives or the Fathers, Martyrs and Other Principal Saints\", Vol. I, D. & J. Sadlier, & Company, 1864 The first part consists of Gildas' explanation for his work and a brief narrative of Roman Britain from its conquest under the Principate to Gildas' time. He describes the doings of the Romans and the Groans of the Britons, in which the Britons make one last request for military aid from the departed Roman military. He excoriates his fellow Britons for their sins, while at the same time lauding heroes such as Ambrosius Aurelianus, whom he is the first to describe as a leader of the resistance to the Saxons. He mentions the victory at the Battle of Mons Badonicus, a feat attributed to King Arthur in later texts, though Gildas is unclear as to who led the battle."]}, {"page": "Romano-British culture", "response": ["The struggles of this period have given rise to the legends of Uther Pendragon and King Arthur. There are many theories, but it is sometimes said that Ambrosius Aurelianus, a resistance leader of the Romano-British forces, was the model for the former, and that Arthur's court of Camelot is an idealised Welsh and Cornish memory of pre-Saxon Romano-British civilisation."]}, {"page": "Uther Pendragon", "response": ["Uther's epithet Pendragon literally means \"head dragon\" in its original Welsh, though it was used figuratively to mean \"highest commander; head leader; top of the command chain.\" Geoffrey of Monmouth in Historia Regum Britanniae misinterpreted it as \"the head of a dragon\" and invented an origin to explain it away: Uther acquired the epithet when he witnessed a portentous dragon-shaped comet, which inspired him to use dragons on his standards.Bromwich, Trioedd Ynys Prydein, p. 512–513. According to Robert de Boronde Boron, Robert. Merlin and the Grail. Tr. Nigel Bryant. Cambridge: D.S. Brewer, 2001. and the cycles based on his work, it was Uther's older brother (elsewhere called Aurelius Ambrosius and likely based on Ambrosius Aurelianus) who saw the comet and received the name \"Pendragon\", Uther taking his epithet after his death. An alternative possibility is it stems from adopting the use of the draco military standard of the Roman cavalry, but this is likely ahistorical conjecture.", "Uther's family is based on some historical figures; Aurelius Ambrosius is Ambrosius Aurelianus, mentioned by Gildas, though his connection to Constantine and Constans is unrecorded. It is possible that Uther himself is based at least partially on Tewdrig, a historical king of Glywysing in the sixth century, given the strong similarities between their death stories. Depending on the source, Uther may either be the son of Constantine III, as is related in the Welsh Triad 51, or he may be the son of Constantine of Dumnonia, as related in Monmouth's History of the Kings of Britain. "]}, {"page": "Vortigern", "response": ["*The tale of Ambrosius Aurelianus and the two dragons found beneath Dinas Emrys.Lupack, Alan. \"Vortigern\", The Camelot Project, University of Rochester  "]}, {"page": "Amesbury", "response": ["The derivation of the name of the town is uncertain. It may derive from an Anglo-Saxon named Ambre, or from the Old English amore-burh meaning 'fortification frequented by buntings or/and Yellowhammers'. It has also been suggested that the name is derived from Ambrosius Aurelianus, leader of Romano-British resistance to Saxon invasions in the 5th century."]}, {"page": "List of locations associated with Arthurian legend", "response": ["*Stonehenge is said to be the burial place of Ambrosius Aurelianus and Uther Pendragon."]}, {"page": "Conisbrough", "response": ["Geoffrey of Monmouth wrote about the town, claiming that it had been fortified by Ambrosius Aurelianus, King of the Britons after his victory over the Anglo-Saxon forces of Hengist (Historia Regum Britanniae viii, 7), that the captive Anglo-Saxon leader Hengist was hacked to pieces by Eldol outside the town walls, and was buried at \"Hengist's Mound\" in the town."]}, {"page": "Dinas Emrys", "response": ["Excavations in 1910 and 1954–56 revealed several periods of habitation at the site. The earliest elements date to the Iron Age, perhaps to the 1st or 2nd century. A pool within the enclosure, thought to be an artificial construction, may date to this phase. It is perhaps connected to the pool found in the popular tale of Vortigern and the dragons. Other traces suggest habitation into the 5th century, which would put it in the time frame for Vortigern and Ambrosius Aurelianus.", "According to legend, when Vortigern fled into Wales to escape the Anglo-Saxon invaders, he chose this lofty hillfort as the site for his royal retreat. Every day his men would work hard erecting the first of several proposed towers; but the next morning they would return to find the masonry collapsed in a heap. This continued for many weeks until Vortigern was advised to seek the help of a young boy not conceived by a mortal man. The King sent his soldiers out across the land to find such a lad. The boy they found was called Myrddin Emrys (Merlin Ambrosius). Vortigern, following the advice of his councillors, was planning to kill the boy in order to appease supernatural powers that prevented him from building a fortress here. Merlin scorned this advice, and instead explained that the hillfort could not stand due to a hidden pool containing two vermes (dragons). He explained how the White Dragon of the Saxons though winning the battle at present, would soon be defeated by the Welsh Red Dragon. After Vortigern's downfall, the fort was given to High-King Ambrosius Aurelianus, known in Welsh as Emrys Wledig, hence its name.Historia Britonum by Nennius (translated by J.A.Giles), The Avalon Project, ch.40-43", "Dinas Ffaraon (Fortress of Pharaoh) or Dinas Ffaraon Dande (Fortress of Fiery Pharaoh) is mentioned in the tale \"Lludd and Llefelys\" as the place where King Lludd of Britain traps and buries two dragons who are ravaging the land. The text explains that the site was later named \"Dinas Emreis\".Koch, p. 598 This tale is a prequel to the older story involving the hero Emrys (Ambrosius Aurelianus) or Myrddin Emrys (Merlin).Bromwich, p. 416. In sources such as the Historia Brittonum and Geoffrey of Monmouth's Historia Regum Britanniae, a tower built on the spot continually collapses until Emrys reveals the buried dragons as the cause; once they are released the tower is successfully constructed and named after him. The name \"Dinas Emrys\" has been associated with a Roman ruin in Snowdonia, a localization that possibly dates as early as the Historia Brittonum."]}, {"page": "Londinium", "response": ["With few troops left in Britain, many Romano-British towns—including Londinium—declined drastically over the next few decades. Many of London's public buildings had fallen into disrepair by this point, and excavations of the port show signs of rapid disuse. Between 407 and 409, large numbers of barbarians overran Gaul and Hispania, seriously weakening communication between Rome and Britain. Trade broke down. Officials went unpaid and Romano-British troops elected their own leaders. Constantine III declared himself emperor over the West and crossed the Channel, an act considered the Roman withdrawal from Britain since the emperor Honorius subsequently directed the Britons to look to their own defence rather than send another garrison force. Surviving accounts are scanty and mixed with Welsh and Saxon legends concerning Vortigern, Hengest, Horsa, and Ambrosius Aurelianus. Even archaeological evidence of Londinium during this period is minimal."]}]}}