{"wiki_id": "http://www.wikidata.org/entity/Q459559", "itemLabel": "Basil Sydney", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Basil_Sydney", "wikipedia_page": {"main": "Basil Sydney (23 April 1894 – 10 January 1968) was an English stage and screen actor.", "link_mentions": [{"page": "Jules Maigret", "response": ["The title role in the 1960s British Maigret TV series was played by the actor Rupert Davies, who made his debut on 31 October 1960.  Davies took over the part after Basil Sydney, who appeared as Maigret in the original transmitted pilot, proved unavailable owing to ill-health. Davies went on to star in 52 adaptations for BBC TV in that decade. His portrayal won two of the highest accolades: his versions were dubbed into French and played across the Channel; and Simenon himself said of Davies \"At last, I have found the perfect Maigret!\" The theme tune to the TV series, ”Midnight in Montmartre”, was composed by Ron Grainer."]}, {"page": "Hamlet (1948 film)", "response": ["Inside the Great Hall of the castle, the court is celebrating the marriage of Gertrude (Eileen Herlie) and King Claudius (Basil Sydney); old King Hamlet has died apparently of an accidental snakebite, and his wife, Gertrude, has, within a month of the tragedy, married the late King's brother. Prince Hamlet (Laurence Olivier) sits alone, refusing to join in the celebration, despite the protests of the new King. When the court has left the Great Hall, Hamlet fumes over the hasty marriage, muttering to himself the words \"and yet, within a month!\"", "* Basil Sydney as Claudius, the King. Claudius is the brother, and murderer, of the late King Hamlet, and he marries his brother's widow only two months after the King's death. An English actor, Sydney had a long and prolific career on both stage and screen. In 1923, at the age of 29, he played Hamlet in a modern-dress stage production. He subsequently appeared with Olivier in The Devil's Disciple."]}, {"page": "The Dam Busters (film)", "response": ["Angry and frustrated, Wallis secures an interview with Sir Arthur \"Bomber\" Harris (played by Basil Sydney), the head of RAF Bomber Command, who at first is reluctant to take the idea seriously. Eventually, however, he is convinced and takes the idea to the Prime Minister, who authorises the project.", "* Basil Sydney as Air Chief Marshal  Sir Arthur Harris, GOC-in-C, RAF Bomber Command"]}, {"page": "1993 in film", "response": ["| Last Action Hero || Columbia Pictures || John McTiernan (director); Shane Black, David Arnott (screenplay); Arnold Schwarzenegger, F. Murray Abraham, Charles Dance, Tom Noonan, Austin O'Brien, Art Carney, Robert Prosky, Anthony Quinn, Mercedes Ruehl, Bridgette Wilson, Frank McRae, Professor Toru Tanaka, Ryan Todd, Bobbie Brown, Tina Turner, Sharon Stone, Robert Patrick, Mike Muscat, Angie Everhart, Maria Shriver, Little Richard, Leeza Gibbons, James Belushi, Damon Wayans, Chevy Chase, Jean-Claude Van Damme, MC Hammer, Wilson Phillips, Ian McKellen, Danny DeVito, Joan Plowright, Colleen Camp, Chris Connelly, Karen Duffy, Larry Ferguson, Keith Barish, Melvin Van Peebles, Noah Emmerich, John Finnegan, Sven-Ole Thorsen, Rick Ducommun, Michael V. Gazzo, Lee Reherman, Henry Kingi, Dagmar Koller, Don LaFontaine, Al Leong, Thomas Rosales Jr., Basil Sydney, Persia White || Action, Comedy, Fantasy || Live action"]}, {"page": "1958 in film", "response": ["*A Question of Adultery, directed by Don Chaffey, starring Julie London, Anthony Steel, Basil Sydney, Donald Houston – (U.K.)"]}, {"page": "1948 in film", "response": ["*Hamlet, directed by and starring Laurence Olivier, with Basil Sydney and Jean Simmons – (GB)"]}, {"page": "1941 in film", "response": ["*The Farmer's Wife, starring Basil Sydney"]}, {"page": "Mary Ellis", "response": ["In 1930, Ellis emigrated to England with Basil Sydney, her third husband, whom she had married in 1929. In London's West End, she starred in Jerome Kern's Music in the Air (1933) and went on to her best remembered roles as the heroines of three Ivor Novello operettas: Glamorous Night (1935), The Dancing Years (1939) and Arc de Triomphe (1943). She also starred in several films in the 1930s, including a film version of Glamorous Night in 1937."]}, {"page": "Bernard Lee", "response": ["Lee's screen debut was in The Double Event (1934), followed by a role as Cartwright in Berthold Viertel's Rhodes of Africa (1936), a biopic of Cecil Rhodes, in which he starred alongside Walter Huston, Oscar Homolka, and Basil Sydney. Although Lee was in wartime service in the army between 1940 and 1946, he had managed to act in several films earlier which were released between 1939 and 1943, including Murder in Soho, The Frozen Limits, and Let George Do It! (known in the US as To Hell with Hitler, 1940) with George Formby."]}, {"page": "Around the World in 80 Days (1956 film)", "response": ["* Basil Sydney as a Reform Club member"]}, {"page": "David Manners", "response": ["The Ackloms by January 1920 had moved again, then to West 123rd Street in Manhattan, where 19-year-old Manners (still Rauff) continued to reside with his parents. He was employed as an assistant publisher and seemed destined to repeat his father's own career choice and live out his life as an editor and publisher.\"The Fourteenth Census of the United States: 1920\", enumeration date January 3, 1920, New York City, New York County, New York. FamilySearch. Retrieved January 3, 1920. Retrieved August 22, 2017. Soon, perhaps in an effort to chart an entirely different course for himself professionally, Manners stopped working as an assistant publisher and returned to Canada to study forestry at the University of Toronto. He found the curriculum there boring; however, he was attracted to stage work on campus. After receiving some drama training, he made his acting debut in 1924 at the school's Hart House Theater in Euripides' play Hippolytus. Despite his father's objections, Manners continued to pursue an entertainment career when he came back to the United States. Before long he was performing in theaters in Chicago, on Broadway, and elsewhere after joining Basil Sydney's Touring Company and later Eva Le Gallienne's Civic Repertory Company in New York. During his time, before he moved to Hollywood at the beginning of the sound era in films, he obtained additional training under Le Gallienne, even though she had remarked that he was \"a very bad actor\" after seeing one of his performances. Manners in this period also appeared on the New York stage with Helen Hayes, with whom he co-starred in Edgar Selwyn and Edmund Goulding's play Dancing Mothers at the Booth Theatre."]}, {"page": "Helen Chandler", "response": ["Born in Charleston, South Carolina,A 1935 Associated Press story about Chandler's wedding to Bramwell Fletcher says Chandler \"was born here ...\", apparently referring to the story's New York dateline. Chandler began her acting career in New York City at the age of eight and was on Broadway two years later in 1917.  Her early performances include  Arthur Hopkins' 1920 production of Richard III, which starred John Barrymore, Macbeth in 1921 with Lionel Barrymore; Hedvig in Henrik Ibsen's The Wild Duck in 1925 and Ophelia in the 1925 modern dress version of Hamlet starring Basil Sydney. By the time of her first film she had been in over twenty Broadway productions."]}, {"page": "Island in the Sun (film)", "response": ["Island in the Sun is a 1957 De Luxe in CinemaScope drama film produced by Darryl F. Zanuck and directed by Robert Rossen. It features an ensemble cast including James Mason, Harry Belafonte, Joan Fontaine, Joan Collins, Dorothy Dandridge, Michael Rennie, Stephen Boyd, Patricia Owens, John Justin, Diana Wynyard, John Williams, and Basil Sydney.  The film is about race relations and interracial romance set in the fictitious island of Santa Marta. Barbados and Grenada were selected as the sites for the movie based on the 1955 novel by Alec Waugh. The film was controversial at the time of its release for its portrayal of interracial romance.", "* Basil Sydney as Julian Fleury, the husband of Mrs. Fleury and father of Maxwell and Jocelyn, who also is hiding things."]}, {"page": "Caesar and Cleopatra (film)", "response": ["* Basil Sydney as Rufio"]}, {"page": "King Claudius", "response": ["Basil Sydney portrayed Claudius in Laurence Olivier's film adaptation of Hamlet."]}, {"page": "Went the Day Well?", "response": ["*Basil Sydney as Kommandant Ortler, alias Major Hammond"]}, {"page": "The Black Sheep of Whitehall", "response": ["The Black Sheep of Whitehall (the opening credits read Black Sheep of Whitehall) is a 1942 British black-and-white comedy war film, directed by Will Hay and Basil Dearden, starring Will Hay, John Mills, Basil Sydney and Thora Hird in her screen debut. It was produced by Michael Balcon and Ealing Studios.", "* Basil Sydney as Costello"]}, {"page": "The 3 Worlds of Gulliver", "response": ["* Basil Sydney as Emperor of Lilliput"]}, {"page": "Booth Theatre", "response": ["Many productions at the Booth in 1925 and 1926 were flops. Among the Booth's productions in 1925 were Horace Liveright's revival of Shakespeare's Hamlet with Basil Sydney and Helen Chandler, as well as the comedy The Patsy with Claiborne Foster. The next year, Ames produced a short-lived version of Philip Barry's comedy White Wings. The Booth finally had another hit in early 1927 with the Maxwell Anderson comedy Saturday's Children with Beulah Bondi, Ruth Gordon, and Roger Pryor, which had 310 performances. Also that year, Leslie Howard and Frieda Inescort returned in Ames's production of John Galsworthy's Escape. The revue Grand Street Follies was presented at the Booth in 1928 and 1929, with James Cagney and Dorothy Sands.;  Ames announced his retirement from producing in October 1929, though he said he would continue to control the Booth Theatre. The same month, the play Jenny opened at the theater, featuring Jane Cowl and Guy Standing.; "]}, {"page": "Ivanhoe (1952 film)", "response": ["* Basil Sydney as Waldemar Fitzurse"]}, {"page": "Lyric Theatre, London", "response": ["William Greet was succeeded as lessee by Edward Engelbach in 1914. For a while, musical productions were not seen at the Lyric, and non-musical drama prevailed, including On Trial, an unusual melodrama that opened with the end of the story and worked backwards to the beginning.Croom-Johnson, A. \"The Drama During War-Time\", The Review of Reviews,  August 1915, p. 165 It had a satisfactory run of 174 performances.Mander and Mitchenson (1963), p. 114 Romance, starring Doris Keane and Owen Nares, transferred from the Duke of York's Theatre to the Lyric, where it finished its run of 1,049 performances.Gaye, p. 1537 Keane then starred in the comedy Roxana (1918); the reviews were excellent. In 1919 she played Juliet opposite the Romeo of her husband, Basil Sydney; this time the reviews were dreadful. The Nurse, played by Ellen Terry, was seen as the saving grace of the production.\"Romeo and Juliet at the Lyric\", The Athenaeum, 25 April 1919, pp. 234–234; \"Doris Keane's Juliet\", The New York Times, 18 May 1919, p. 2; \"Romeo and Juliet Revived\", The Graphic, 19 April 1919, p. 28; and \"Romeo and Juliet\", The Pall Mall Gazette, 14 April 1919, p. 9"]}, {"page": "Red Hot Romance", "response": ["*Basil Sydney as Rowland Stone"]}, {"page": "List of pirate films and television series", "response": ["|Robert Newton, Bobby Driscoll, Basil Sydney"]}, {"page": "Basil Sidney", "response": ["#REDIRECT Basil Sydney"]}, {"page": "John Paul Jones (film)", "response": ["The film stars Robert Stack (in the title role), Marisa Pavan, Charles Coburn, Macdonald Carey, Jean-Pierre Aumont, David Farrar, Peter Cushing, Basil Sydney, and Thomas Gomez. The director's daughter and son Mia Farrow and John Charles Farrow also make their feature film debuts. Bette Davis made a cameo appearance as Empress Catherine the Great. ", "In 1759, twelve-year old John Paul (John Charles Farrow) is forced to flee Scotland when he attacks an English officer trying to enforce English laws against bagpipe playing and wearing kilts, symbols of Scottish nationalism.  Going to sea, John Paul serves on several ships, becoming an experienced navigator by age 17 and by 1773 becoming master of a ship in the British West Indies.  A fight with a mutinous crew member results in the mutineer's death, but because of the sailor's family connections, the governor of Tobago (Basil Sydney) advises Paul to leave and change his name.  Paul adds a new surname, becoming \"John Paul Jones,\" and goes to visit a brother who lives in Fredericksburg, Virginia.", "* Basil Sydney as Sir William Young"]}, {"page": "Salome (1953 film)", "response": ["The film stars Rita Hayworth as Salome, as well as Stewart Granger, Charles Laughton and Judith Anderson, with Cedric Hardwicke, Alan Badel and Basil Sydney.", "* Basil Sydney as Pontius Pilate"]}, {"page": "The Next of Kin", "response": ["* Basil Sydney as a naval captain"]}, {"page": "Mayerling (1957 film)", "response": ["The film was produced and directed by Anatole Litvak, who had previously directed the French film version of Mayerling (1936) which was an international hit and brought Litvak to Hollywood. The 1957 version stars Audrey Hepburn and Mel Ferrer, Raymond Massey, Diana Wynyard, Basil Sydney, Judith Evelyn, Isobel Elsom, Lorne Greene, Nancy Marchand, David Opatoshu, Suzy Parker, Nehemiah Persoff, Pippa Scott, Monique van Vooren, and Lilia Skala."]}, {"page": "The Devil's Disciple (1959 film)", "response": ["While waiting, British soldiers enter Anderson's home and arrest Dick, mistaking him for Anderson, whom they believe illegally retrieved the body. Dick allows them to take him away without revealing his actual identity. He swears Judith to secrecy lest her husband give the secret away and expose himself to arrest. Judith, in a state of great agitation, finds her husband, who asks if Dick has harmed her. Breaking her promise to Dick, Judith reveals that soldiers came to arrest Anderson but Dick went in his place, stunning Anderson, who tells Judith to have Dudgeon keep quiet as long as possible, to give him \"more start\", then quickly drives away. Judith believes her husband to be a coward (not knowing he has gone to seek help from Lawyer Hawkins (Basil Sydney), secretly the leader of the local rebels) while Dick, whom she despised, she now sees as a hero.", "* Basil Sydney – Lawyer Hawkins"]}, {"page": "List of American films of 1920", "response": ["| Romance || Chester Withey || Doris Keane, Basil Sydney || Romance || United Artists"]}, {"page": "List of American films of 1922", "response": ["|Red Hot Romance|| Victor Fleming || Basil Sydney, May Collins || Comedy || First National"]}, {"page": "List of comedy films of the 1920s", "response": ["|Red Hot Romance|| Victor Fleming|| Basil Sydney|| United States ||"]}, {"page": "Hamlet on screen", "response": ["|Jean Simmons as OpheliaEileen Herlie as GertrudeBasil Sydney as ClaudiusFelix Aylmer as Polonius"]}, {"page": "List of fantasy films of the 1960s", "response": ["|The Three Worlds of Gulliver||Jack Sher||Kerwin Mathews, June Thorburn, Basil Sydney, Sherry Alberoni||United States||"]}, {"page": "List of British films of 1940", "response": ["|Shadowed Eyes || Maclean Rogers || Basil Sydney, Patricia Hilliard || Crime ||"]}, {"page": "List of British films of 1941", "response": ["|The Farmer's Wife||Norman Lee, Leslie Arliss||Basil Sydney, Wilfrid Lawson ||Drama||"]}, {"page": "List of British films of 1942", "response": ["|Went the Day Well?||Alberto Cavalcanti ||Leslie Banks, Mervyn Johns, Basil Sydney||World War II ||"]}, {"page": "List of British films of 1948", "response": ["|Hamlet||Laurence Olivier ||Laurence Olivier, Jean Simmons, Basil Sydney||Shakespearean drama ||Number 69 in the list of BFI Top 100 British films; winner of four Academy Awards"]}, {"page": "List of British films of 1950", "response": ["|The Angel with the Trumpet||Anthony Bushell||Eileen Herlie, Basil Sydney, Norman Wooland, Maria Schell||Drama||"]}, {"page": "List of British films of 1961", "response": ["|A Story of David||Bob McNaught||Jeff Chandler, Basil Sydney||Drama|| Co-production with Israel"]}, {"page": "Lance Sieveking", "response": ["**Written by Frank Atkinson and Michael Barringer from the novel \"The Shakespeare Murders\" by Neil Gordon. Starring: Basil Sydney, Molly Lamont, Raymond Lovell, et al."]}, {"page": "Jassy (film)", "response": ["* Basil Sydney as Nick Helmar"]}]}}