{"wiki_id": "http://www.wikidata.org/entity/Q459294", "itemLabel": "Jessie Matthews", "itemDescription": "English actress, singer and dancer (1907–1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessie_Matthews", "wikipedia_page": {"main": "Jessie Margaret Matthews  (11 March 1907 – 19 August 1981) was an English actress, dancer and singer of the 1920s and 1930s, whose career continued into the post-war period.After a string of hit stage musicals and films in the mid-1930s, Matthews developed a following in the USA, where she was dubbed \"The Dancing Divinity\". Her British studio was reluctant to let go of its biggest name, which resulted in offers for her to work in Hollywood being repeatedly rejected.\n\n", "link_mentions": [{"page": "August 19", "response": ["*1981 – Jessie Matthews, English actress, singer, and dancer (b. 1907)"]}, {"page": "Cinema of the United Kingdom", "response": ["Music halls also proved influential in comedy films of this period, and a number of popular personalities emerged, including George Formby, Gracie Fields, Jessie Matthews and Will Hay. These stars often made several films a year, and their productions remained important for morale purposes during World War II."]}, {"page": "March 11", "response": ["*1907 – Jessie Matthews, English actress, singer, and dancer (d. 1981)"]}, {"page": "Peter Sellers", "response": ["Sellers's difficulties in getting his film career to take off, and increasing problems in his personal life, prompted him to seek periodic consultations with astrologer Maurice Woodruff, who held considerable sway over his later career. After a chance meeting with a North American Indian spirit guide in the 1950s, Sellers became convinced that the music hall comedian Dan Leno, who died in 1904, haunted him and guided his career and life-decisions.  Sellers was a member of the Grand Order of Water Rats, the same exclusive theatrical fraternity founded by Leno in 1890. In 1958 Sellers starred with David Tomlinson, Wilfrid Hyde-White, David Lodge and Lionel Jeffries as a chief petty officer in Val Guest's Up the Creek. Guest later claimed that he had written and directed the film as a vehicle for Sellers, and thus had started Sellers's film career. To practise his voice, Sellers purchased a reel-to-reel tape recorder. The film received critical acclaim in the United States and Roger Lewis viewed it as an important practice ground for Sellers. Next, Sellers featured with Terry-Thomas as one of a pair of comic villains in George Pal's Tom Thumb (1958), a musical fantasy film, opposite Russ Tamblyn, Jessie Matthews and Peter Butterworth. Terry-Thomas later said that \"my part was perfect, but Peter's was bloody awful. He wasn't difficult about it, but he knew it\". The performance was a landmark in Sellers's career and became his first contact with the Hollywood film industry."]}, {"page": "1981", "response": ["* August 19 – Jessie Matthews, English dancer, singer and actress (b. 1907)"]}, {"page": "River Thames", "response": ["Jessie Matthews sings \"My river\" in the 1938 film Sailing Along, and the tune is the centrepiece of a major dance number near the end of the film."]}, {"page": "Cole Porter", "response": ["At the age of 36, Porter reintroduced himself to Broadway in 1928 with the musical Paris, his first hit.Kimball (1999), p. 5 It was commissioned by E. Ray Goetz at the instigation of Goetz's wife and the show's star, Irène Bordoni. She had wanted Rodgers and Hart to write the songs, but they were unavailable, and Porter's agent persuaded Goetz to hire Porter instead.Citron (2005), p. 73 In August 1928, Porter's work on the show was interrupted by the death of his father. He hurried back to Indiana to comfort his mother before returning to work. The songs for the show included \"Let's Misbehave\" and one of his best-known list songs, \"Let's Do It\", which was introduced by Bordoni and Arthur Margetson.Kimball (1984), pp. 101 and 104 The show opened on Broadway on October 8, 1928. The Porters did not attend the first night because Porter was in Paris supervising another show for which he had been commissioned, La Revue, at a nightclub.Citron (2005), pp. 74 and 79 This was also a success, and, in Citron's phrase, Porter was finally \"accepted into the upper echelon of Broadway songwriters\".Citron (2005), p. 78 Cochran now wanted more from Porter than isolated extra songs; he planned a West End extravaganza similar to Ziegfeld's shows, with a Porter score and a large international cast led by Jessie Matthews, Sonnie Hale and Tilly Losch. The revue, Wake Up and Dream, ran for 263 performances in London, after which Cochran transferred it to New York in 1929. On Broadway, business was badly affected by the 1929 Wall Street crash, and the production ran for only 136 performances. From Porter's point of view, it was nonetheless a success, as his song \"What Is This Thing Called Love?\" became immensely popular.Citron (2005), pp 80–82"]}, {"page": "Ruislip", "response": ["* Actress Jessie Matthews (1907-1981) is buried in St Martins graveyard."]}, {"page": "Tooting", "response": ["In André Charlot's West End revue The Charlot Show of 1926, Jessie Matthews and Henry Lytton, Jnr. sang \"Silly Little Hill\", which features the lyric \"there's no fishing, there’s no shooting dear / and no cyclists fresh from Tooting dear\", which they also recorded that year."]}, {"page": "Farnham", "response": ["Gerald Flood, stage, TV and film actor, lived in Farnham for most of his life; Peter Lupino, a well-known West End actor of the 1930s and 40s, and member of the famous theatrical family, also lived for many years in Farnham, in Red Lion Lane and was a well-known local character in his retirement. Actor Bill Maynard, the Carry On and Heartbeat actor, was born in the town. The actor Bill Wallis lived in the town and learned his trade on the stage of the Castle Theatre. Opera singer Sir Peter Pears (1910–1986) was born in Farnham and Jessie Matthews, OBE (1907–1981), the actress, dancer, and singer of the 1930s to 1960s, lived in Farnham."]}, {"page": "1948 in music", "response": ["* Maid to Measure London revue opened at the Cambridge Theatre on May 20.  Starring Jessie Matthews, Tommy Fields, Joan Heal and Lew Parker."]}, {"page": "1929 in music", "response": ["* \"Looking At You\" w.m. Cole Porter.  Introduced by Jessie Matthews and Dave Fitzgibbon in the musical Wake Up and Dream"]}, {"page": "1937 in music", "response": ["* Gangway, starring Jessie Matthews", "* Head Over Heels, starring Jessie Matthews"]}, {"page": "1935 in music", "response": ["* First a Girl starring Jessie Matthews and Sonnie Hale"]}, {"page": "1933 in music", "response": ["* The Good Companions, starring Jessie Matthews, Edmund Gwenn and John Gielgud"]}, {"page": "1932 in music", "response": ["* The Midshipmaid, starring Jessie Matthews"]}, {"page": "1931 in music", "response": ["* Hold My Hand (Music: Noel Gay Lyrics: Desmond Carter Book: Stanley Lupino) London production opened at the Gaiety Theatre on December 23.  Starring Jessie Matthews, Sonnie Hale and Stanley Lupino."]}, {"page": "1907 in music", "response": ["*March 11 – Jessie Matthews, British actress and singer (died 1981)"]}, {"page": "John Gielgud", "response": ["Returning to the West End, Gielgud starred in J. B.Priestley's The Good Companions, adapted for the stage by the author and Edward Knoblock. The production ran from May 1931 for 331 performances, and Gielgud described it as his first real taste of commercial success.Gielgud (2000), p. 146 He played Inigo Jollifant, a young schoolmaster who abandons teaching to join a travelling theatre troupe. This crowd-pleaser drew disapproval from the more austere reviewers, who felt Gielgud should be doing something more demanding,Morley, p. 80 but he found playing a conventional juvenile lead had challenges of its own and helped him improve his technique.Gielgud (2000), p. 145 During the run of the play he made another film, Insult (1932), a melodrama about the French Foreign Legion, and he starred in a cinema version of The Good Companions in 1933, with Jessie Matthews. A letter to a friend reveals Gielgud's view of film acting: \"There is talk of my doing Inigo in the film of The Good Companions, which appals my soul but appeals to my pocket.\"Gielgud (2004), p. 16 In his first volume of memoirs, published in 1939, Gielgud devoted two pages to describing the things about filming that he detested.Gielgud (2000), pp. 199–201 Unlike his contemporaries Richardson and Laurence Olivier, he made few films until after the Second World War, and did not establish himself as a prominent film actor until many years after that.Morley, p. 81 As he put it in 1994, \"I was stupid enough to toss my head and stick to the stage while watching Larry and Ralph sign lucrative Korda contracts.\"\"People think I'm about to die\" , The Spectator, 16 March 1994, p. 18"]}, {"page": "1981 in film", "response": ["| style=\"text-align:center;\"| 19 || Jessie Matthews || style=\"text-align:center;\"| 74 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress, Singer || "]}, {"page": "1938 in film", "response": ["*Climbing High, starring Michael Redgrave and Jessie Matthews – (GB)"]}, {"page": "1937 in film", "response": ["*Gangway, starring Jessie Matthews (GB)", "*Head Over Heels, starring Jessie Matthews (GB)"]}, {"page": "1936 in film", "response": ["*It's Love Again, starring Jessie Matthews and Robert Young (GB)"]}, {"page": "1934 in film", "response": ["*Evergreen, directed by Victor Saville, starring Jessie Matthews – (GB)", "*Waltzes from Vienna, directed by Alfred Hitchcock, starring Esmond Knight and Jessie Matthews – (GB)"]}, {"page": "1933 in film", "response": ["*Friday the Thirteenth, directed by Victor Saville, starring Jessie Matthews – (GB)", "*The Good Companions, directed by Victor Saville, starring Jessie Matthews, Edmund Gwenn and John Gielgud – (GB)"]}, {"page": "1932 in film", "response": ["*The Midshipmaid, starring Jessie Matthews – (GB)"]}, {"page": "1907 in film", "response": ["* March 11 – Jessie Matthews, actress, singer (d. 1981)"]}, {"page": "Robert Young (actor)", "response": ["As an MGM contract player, Young was obligated to accept any film assigned to him or risk being placed on suspension—and many actors who were placed on suspension were prohibited from earning a salary from any endeavor at all, even those unrelated to the film industry. In 1936, MGM summarily loaned Young to Gaumont British in the U.K. for two films; the first, Secret Agent, was directed by Alfred Hitchcock, while the other, It's Love Again, co-starred Jessie Matthews. While in England, he was convinced that MGM intended to terminate his contract, but he was mistaken."]}, {"page": "Prince George, Duke of Kent", "response": ["There were \"strong rumours\" that he had affairs with musical star Jessie Matthews,Kenneth J. Panton Historical Dictionary of the British Monarchy, Lanham,MD: Scarecrow Press, 2011, p.217 writer Cecil Roberts,King, Francis Henry. Yesterday Came Suddenly, Constable (London) 1993, p278 and Noël Coward,Barry Day, ed., The Letters of Noël Coward. New York: Alfred A. Knopf, 2007. p. 691 a relationship which Coward's long-term partner, Graham Payn, denied.Brandreth, Gyles (2004). Philip and Elizabeth: Portrait of a Marriage. London: Century. , p. 94 While married, he also had an affair with Margaret Whigham, later known as Margaret Campbell, Duchess of Argyll."]}, {"page": "Terry-Thomas", "response": ["Terry-Thomas made his professional stage début on 11 April 1930 at a social evening organised by the Union of Electric Railwayman's Dining Club in South Kensington. He was billed as Thos Stevens, but only appeared as a minor turn. His performance brought heckles from the drunken audience, but earned him a commission of 30 shillings. After this, he played a few minor roles in Gilbert and Sullivan productions by the Edgware Operatic Society at the Scala Theatre. In 1933, he left Smithfield Market to work briefly with a friend at an electrical shop before he became a travelling salesman of electrical equipment. He enjoyed the job and relished being able to dress up in elaborate clothing in order to make his pitch. In his spare time, he began playing the ukulele with a local jazz band called the Rhythm Maniacs. He took up dancing and formed a partnership with a sister of Jessie Matthews. The act starred in local exhibitions and at minor venues, and they earned well from it. News soon travelled of the couple's talent, and they were engaged as ballroom dancers at a hall in Cricklewood. He found the dance-style too restrictive and he left the act to try other aspects of entertainment."]}, {"page": "Daddy Wouldn't Buy Me a Bow Wow", "response": ["The song featured in the 1934 musical movie Evergreen, sung by Jessie Matthews, and was also revived after World War II."]}, {"page": "Anna Neagle", "response": ["Neagle was born in Forest Gate, Essex, daughter of Florence Neagle and her husband, Herbert William Robertson, a Merchant Navy captain.Springer, John, and Jack Hamilton. They Had Faces Then. Castle Books. p. 319. Her elder brother was the bass-baritone and actor Stuart Robertson (1901–1958).Pearl Records, The Mikado, sleeve notes. Robertson attended primary school in Glasgow and then St Albans High School for Girls. She made her stage debut as a dancer in 1917, and later appeared in the chorus of C.B. Cochran's revues and also André Charlot's revue Bubbly. While with Cochran she understudied Jessie Matthews.Vermilye, Jerry. The Great British Films. Secaucus, New Jersey: Citadel Press, 1978. p. 21."]}, {"page": "Verwood", "response": ["*Jessie Matthews – actress, singer and dancer"]}, {"page": "Norman Hartnell", "response": ["Although expressing the spirit of the Bright Young Things and Flappers, his designs overlaid the harder silhouettes with a fluid romanticism in detail and construction. This was most evident in Hartnell's predilection for evening and bridal gowns, gowns for court presentations, and afternoon gowns for guests at society weddings. Hartnell's success ensured international press coverage and a flourishing trade with those no longer content with 'safe' London clothes derived from Parisian designs. Hartnell became popular with the younger stars of stage and screen, and went on to dress such leading ladies as Gladys Cooper, Elsie Randolph, Gertrude Lawrence (also a client of Edward Molyneux), Jessie Matthews, Merle Oberon, Evelyn Laye and Anna Neagle; even top French stars Alice Delysia and Mistinguett were said to be impressed by Hartnell's designs."]}, {"page": "Simple Simon (musical)", "response": ["\"Dancing on the Ceiling\", cut during the Broadway previews, was eventually sung by Jessie Matthews in the London production of Ever Green, and became a standard."]}, {"page": "Anna Lee", "response": ["In 1934, Lee signed a contract with Gainsborough Pictures, the biggest British production company of the era. She played leading lady roles in a variety of different genres at Gainsborough, including the comedy-thriller The Camels Are Coming, the drama The Passing of the Third Floor Back, the horror film The Man Who Changed His Mind and the war film OHMS. She appeared in the 1935 Jessie Matthews musical First a Girl as the aristocratic playgirl and other woman, Princess Miranoff. In 1937, she starred in one of the studio's large-budget productions, King Solomon's Mines."]}, {"page": "Chorus line", "response": ["*Jessie Matthews"]}, {"page": "Edmund Gwenn", "response": ["Gwenn began his film career in 1916, playing Macbeth in The Real Thing at Last, a satire of the American film industry written by Peter Pan playwright J. M. Barrie. A notable early role was a recreation of his stage character Hornblower in the 1921 Anglo-Dutch silent-film of The Skin Game, which he reprised ten years later in Alfred Hitchcock's early sound version of The Skin Game. His debut in a talking picture was in an adaptation of Shaw's How He Lied to Her Husband, made at Elstree in 1931. Of Gwenn's many British film roles, The Times considered his best known to be Jess Oakroyd in The Good Companions with John Gielgud and Jessie Matthews (1933) and Radfern in Carol Reed's Laburnum Grove with Cedric Hardwicke (1936). His final British film role, as a capitalist trying to take over a family brewery in Cheer Boys Cheer (1939) is credited with being the first authentic Ealing comedy.\"Screen Legends\", The Observer Review, 20 December 2009"]}, {"page": "Eastcote", "response": ["* Actress Jessie Matthews (1907-1981) lived in Eastcote at the time of her death"]}, {"page": "Mrs Dale's Diary", "response": ["The lead character, Mrs Dale, was played by Ellis Powell until she was dismissed in controversial circumstances in 1963 and replaced by Jessie Matthews. ", "In 1975, Matthews's biographer, Michael Thornton, wrote: \"On 19 February, 1963, a plump and embittered fifty-six-year-old character actress called Ellis Powell walked out of Broadcasting House for the last time. She was not a star. In fact, she had earned less than £30 a week. But her voice was as well known in Britain as that of Queen Elizabeth II, for it was heard twice a day by seven million devoted listeners.  Miss Powell was Britain's most sacrosanct fictional paragon, Mrs. Dale, in the radio serial Mrs. Dale's Diary. And now, after fifteen years in the role she had created, the BBC had summarily fired her partly because of her drinking habits, and partly because it was felt that the role, and also the entire programme, was in need of a facelift. Three months later, at the age of fifty-seven, she died. Her friends believed she never recovered from the shock and distress of her summary dismissal by the BBC. In the last weeks of her life she worked as a demonstrator at the Ideal Home Exhibition and as a cleaner in an hotel.Jessie Matthews: A Biography, Michael Thornton, Published: 15 May 1975 Accessed 25 September, 2014\"", "In the same year Charles Simon, who had played Dr Dale in the Jessie Matthews years, did his own continuation of the story, going on tour in At Home With The Dales. This show has its place in theatre history as the first professional venture of Cameron Mackintosh, later renowned for large-scale musicals. The Dales play was written by Charles Henry, who was soon discovered to be the versatile and experienced Charles Simon. Later dates in the tour were cancelled because the audience did not seem to be there. \"It would have been different if Jessie had done the tour\" Charles Simon remarked a few months later (to actor Roger Sansom, with whom he was in a broadcast). He was, however, the only member of the radio cast to make the transition."]}, {"page": "Evelyn Laye", "response": ["Evelyn Laye  (née Elsie Evelyn Lay; 10 July 1900 – 17 February 1996) was an English actress who was active on the London light opera stage, and later in New York and Hollywood. Her first husband, actor Sonnie Hale, left her for Jessie Matthews, earning much public sympathy for Laye. Her second husband was actor Frank Lawton, with whom she often appeared in stage productions.", "Married to the actor Sonnie Hale in 1926, Laye received widespread public sympathy when Hale left her for the actress Jessie Matthews in 1928. She was initially very reluctant to abandon the marriage, but, despite a trial reconciliation, a divorce case eventually followed in 1930. She subsequently married actor Frank Lawton, to whom she remained married until his death."]}, {"page": "Entertainments National Service Association", "response": ["* Jessie Matthews"]}, {"page": "Juke Box Jury", "response": ["* 6 June 1964 – Diana Dors, Charlie Drake, Bunny Lewis, Jessie Matthews", "* 26 August 1967 - Jessie Matthews, Tsai Chin, Cat Stevens, Tony Blackburn"]}, {"page": "Prince of Wales Theatre", "response": ["The theatre then hosted plays such as Avery Hopwood's farce Fair and Warmer (1918) and Ivor Novello's The Rat (1924, Novello's first play, in which he also starred), and revues including A to Z (1921), Co-Optimists (1923), and Charlot's Revue (1924). They starred Gertrude Lawrence, Jack Buchanan, Beatrice Lillie, Stanley Holloway, and Jessie Matthews. Ms Matthews also starred, along with Richard Hearne, in \"Wild Rose\", featuring the memorable Jerome Kern song \"Look for the Silver Lining\". These were followed by The Blue Train (1927), Alibi (1928, directed by Gerald du Maurier with Charles Laughton as Hercule Poirot), By Candlelight (1928), and Journey's End (1929). In 1930, Edith Evans became the manager at the theatre, presenting and starring in Delilah, which was not a success. Beginning in 1932, the theatre presented a series of risqué \"Folies\"-style revues, including Voila! Les Dames (1935) and its last production, Encore les Dames (1937). These shows were so successful that they funded the rapid rebuilding of the theatre in 1937."]}, {"page": "Waltzes from Vienna", "response": ["*Jessie Matthews as Resi Ebezeder"]}, {"page": "Teddy Bears' Picnic", "response": ["* From the 1966 album \"Children's Favourites\" sung by Jessie Matthews"]}, {"page": "List of female movie actors by name: M", "response": ["*Jessie Matthews (1907–1981)"]}, {"page": "Apache (dance)", "response": ["In the 1938 Jessie Matthews musical, Sailing Along, the actress delivers a comic Apache stage performance with her co-star Jack Whiting."]}]}}