{"wiki_id": "http://www.wikidata.org/entity/Q459302", "itemLabel": "Marie Vorobieff", "itemDescription": "Russian-British artist (1892-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marie_Vorobieff", "wikipedia_page": {"main": "Maria Bronislavovna Vorobyeva-Stebelska (Russian: Мария Брониславовна Воробьёва-Стебельская; Maria Bronislavovna Vorobyova-Stebelskaya; 1892 – 4 May 1984), also known as \"Marie Vorobieff\" or Marevna, was a 20th-century, Russian-born painter known for her work with Cubism and pointillism.\nShe is internationally known for convincingly combining elements of cubism (called by her \"Dimensionalism\") with pointillism and – through the use of the Golden Ratio for laying out paintings – structure. She has been accredited with being the first female cubist painter. Though she lived the greater part of her life abroad – her formative years as a cubist painter in France and her mature years in England – she is often referred to as a \"Russian painter\".\nFrom her relationship with the Mexican cubist painter and later muralist Diego Rivera in Paris she had a daughter, Marika Rivera (1919-2010), who became a professional dancer and film actress.\n\n", "link_mentions": [{"page": "Diego Rivera", "response": ["From there he went to Paris, France, a destination for young European and American artists and writers, who settled in inexpensive flats in Montparnasse. His circle frequented La Ruche, where his Italian friend Amedeo Modigliani painted his portrait in 1914. His circle of close friends included Ilya Ehrenburg, Chaïm Soutine, Modigliani and his wife Jeanne Hébuterne, Max Jacob, gallery owner Léopold Zborowski, and Moise Kisling. Rivera's former lover Marie Vorobieff-Stebelska (Marevna) honored the circle in her painting Homage to Friends from Montparnasse (1962)."]}, {"page": "Marie Laurencin", "response": ["Laurencin's works include paintings, watercolors, drawings, and prints. She is known as one of the few female Cubist painters, with Sonia Delaunay, Marie Vorobieff, and Franciska Clausen. While her work shows the influence of Cubist painters Pablo Picasso and Georges Braque, who was her close friend, she developed a unique approach to abstraction which often centered on the representation of groups of women and animals. Her work lies outside the bounds of Cubist norms in her pursuit of a specifically feminine aesthetic by her use of pastel colors and curvilinear forms. Originally influenced by Fauvism, she simplified her forms through the influence of the Cubist painters. From 1910, her palette consisted mainly of grey, pink and pastel tones."]}, {"page": "1962 in art", "response": ["* Marie Vorobieff – Homage to Friends from Montparnasse"]}, {"page": "Athelhampton", "response": ["*\"Marevna's Studio\" at Athelhampton House where the Russian émigrée cubist painter Marie Vorobieff, known also as Marevna, stayed and worked between 1949 and 1957 "]}, {"page": "Marevna", "response": ["#REDIRECT Marie Vorobieff"]}, {"page": "Jean Paul Brusset", "response": ["During the difficult economic times of the 1930s Brusset survived as a decorator, most notably at the Cannes Film Festival. In 1938 he married Marika Rivera, the daughter of the Russian émigré cubist painter Marie Vorobieff (also known as Marevna) and the Mexican cubist painter and muralist Diego Rivera; and they had a son together named Jean Diego Brusset. The marriage did not last long."]}, {"page": "Marika Rivera", "response": ["Rivera was born in Paris, France, the daughter of the Mexican artist Diego Rivera and his mistress, the Russian-born painter Marie Vorobieff (\"Marevna\"). Rivera, who was married to Angelina Beloff at the time, did not accept his daughter, so she grew up under the care of her mother. Rivera participated in dancing and acting classes from an early age; from the age of 3 she was taught dancing by Isadora Duncan. She started performing as a dancer at age 5. "]}, {"page": "List of people from Tbilisi", "response": ["* Marie Vorobieff, painter"]}, {"page": "Vorobyov", "response": ["* Marie Vorobieff (1892–1984), Russian painter"]}]}}