{"wiki_id": "http://www.wikidata.org/entity/Q460630", "itemLabel": "Christianna Brand", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Christianna_Brand", "wikipedia_page": {"main": "Christianna Brand (17 December 1907 – 11 March 1988) was a British crime writer and children's author born in British Malaya.\n\n", "link_mentions": [{"page": "List of children's literature writers", "response": ["*Christianna Brand (1907–1988) – Nurse Matilda series (adapted as Nanny McPhee)"]}, {"page": "Whodunit", "response": ["The \"whodunit\" flourished during the so-called \"Golden Age\" of detective fiction, between the First and Second World Wars, when it was the predominant mode of crime writing. Many of the best-known writers of whodunits in this period were British — notably Agatha Christie, Nicholas Blake, G. K. Chesterton, Christianna Brand, Edmund Crispin, Michael Innes, Dorothy L. Sayers, Gladys Mitchell and Josephine Tey. Others – S. S. Van Dine, John Dickson Carr and Ellery Queen — were American, but imitated the \"English\" style. Still others, such as Rex Stout, Clayton Rawson and Earl Derr Biggers, attempted a more \"American\" style. During the Golden Age, the genre was dominated by female authors. In addition to Christie, Brand, Sayers, Mitchell, and Tey, major writers also included Margery Allingham and Ngaio Marsh. "]}, {"page": "1941 in literature", "response": ["* Christianna Brand "]}, {"page": "1944 in literature", "response": ["*Christianna Brand – Green for Danger"]}, {"page": "1946 in literature", "response": ["* Christianna Brand – Suddenly at His Residence"]}, {"page": "1948 in literature", "response": ["*Christianna Brand – Death of Jezebel"]}, {"page": "1955 in literature", "response": ["*Christianna Brand – Tour de Force"]}, {"page": "1969 in literature", "response": ["* Christianna Brand – Court of Foxes "]}, {"page": "1964 in literature", "response": ["*Christianna Brand – Nurse Matilda"]}, {"page": "Nanny", "response": ["* Nanny McPhee, the titular character in the film Nanny McPhee (2005), based on Christianna Brand's Nurse Matilda book series "]}, {"page": "Edward Ardizzone", "response": ["Ardizzone is particularly noted for having not just illustrated the covers and contents of books, but inked in the title text and author's name in his own hand, giving the books a distinctive look on shelves. An example is Clive King's Stig of the Dump from 1963. The Nurse Matilda series of children's books (1964–74) was written by his cousin Christianna Brand, who was seven years younger. Their shared grandmother had told the stories to both cousins and she had learned them from her father.", "*Naughty Children: An Anthology, (1962), compiled by Christianna Brand", "*Nurse Matilda, (1964), by Christianna Brand", "*Nurse Matilda Goes to Town, (1967), by Christianna Brand"]}, {"page": "Christiana", "response": ["* Christianna Brand (1907–1988), British crime writer and children's author"]}, {"page": "Madeleine Smith", "response": ["Other novels based on the case include The House in Queen Anne's Square (1920) by William Darling Lyell, Lovers All Untrue (1970) by Norah Lofts, and Alas, for Her That Met Me! (1976) by Mary Ann Ashe (pseudonym of Christianna Brand). Alanna Knight's Murder in Paradise (2008) includes Madeleine Smith, William Morris and George Wardle as peripheral characters, including a story of how Madeleine met George."]}, {"page": "Green for Danger (film)", "response": ["Green for Danger is a 1946 British thriller film, based on the 1944 detective novel of the same name by Christianna Brand. It was directed by Sidney Gilliat and stars Alastair Sim, Trevor Howard, Sally Gray and Rosamund John. The film was shot at Pinewood Studios in England. The title is a reference to the colour-coding used on the gas canisters used by anaesthetists.", "The Washington Post (1923-1954); Washington, D.C. [Washington, D.C]24 Aug 1947: L2.  The New York Times called it \"extremely involved.\"GREEN FOR DANGER. By Christianna Brand. 199 pp. New York: Dodd, Mead & Co. $2."]}, {"page": "Sandyford murder case", "response": ["The case is given a passing mention in the last chapter of E.C. Bentley's 1913 detective novel Trent's Last Case, in the thirteenth chapter of Dorothy Sayers' 1937 detective novel Busman’s Honeymoon, and in the third chapter of Gladys Mitchell's 13th Mrs Bradley crime novel, When Last I Died, published in 1941. It was recounted by Jack House in his 1961 book Square Mile of Murder, which was dramatised by the BBC in 1980. The murder, trial and aftermath are covered in scrupulous detail in Heaven Knows Who (1960) by Christianna Brand, otherwise known as a respected writer of mysteries. There are two references to this case in Seeing is Believing (also published as Cross of Murder) a Sir Henry Merrivale novel by Carter Dickson (aka John Dickson Carr) first published by Morrow (US, 1941) and Heinemann (UK, 1942). In Chapter 20 there's quite a long account of the Sandyford Murder Mystery. The third episode of Scotland's Murder Mysteries, titled \"Jessie McLachlan\", details the case with notes from modern experts and is produced by STV Productions. The seventh episode of the fifth series of the BBC One series Murder, Mystery and My Family on 6 July 2021 also reinvestigated the case upholding the original decision."]}, {"page": "Nanny McPhee", "response": ["Nanny McPhee is a 2005 comedy fantasy film based on the Nurse Matilda character by Christianna Brand. It was directed by Kirk Jones, co-produced by StudioCanal, Metro-Goldwyn-Mayer Pictures, Working Title Films, Three Strange Angels, and Nanny McPhee Productions with music by Patrick Doyle and produced by Lindsay Doran, Tim Bevan, and Eric Fellner. Set in Victorian England, the film stars Emma Thompson as Nanny McPhee, along with Colin Firth and Angela Lansbury.", "The film was theatrically released on 28 October 2005 in the UK by United International Pictures and on 27 January 2006 in the US by Universal Pictures. Thompson also scripted the film, which is adapted from Christianna Brand's Nurse Matilda books. A sequel, Nanny McPhee and the Big Bang, was released in 2010. The filming location was Penn House Estate, Penn Street, Buckinghamshire, England, UK.", "On 11 March 2002 Kirk Jones was hired and set to direct Nanny McPhee based on Nurse Matilda by Christianna Brand. Emma Thompson wrote the script for the film. Lindsay Doran, Tim Bevan and Eric Fellner produced the film with the budget of $25 million for release in 2005."]}, {"page": "Nurse Matilda", "response": ["The Nurse Matilda books were written by the British  children's author Christianna Brand (1907–1988) and illustrated by her cousin, Edward Ardizzone.  The books are based on stories told to the cousins by their great-grandfather.", "Nurse Matilda's first appearance in print was in an anthology of children's stories collected by Christianna Brand:", "Category:Novels by Christianna Brand"]}, {"page": "The Top 100 Crime Novels of All Time", "response": ["| Christianna Brand"]}, {"page": "Green for Danger", "response": ["Green for Danger is a popular 1944 detective novel by British writer Christianna Brand, praised for its clever plot, interesting characters, and wartime hospital setting.  It was made into a 1946 film which is regarded by film historians as one of the greatest screen adaptations of a Golden Age mystery novel. (The 2016 BBC Father Brown episode 'The Rod of Asclepius' is also effectively an adaptation of the novel).", "Category:Novels by Christianna Brand"]}, {"page": "Secret People (film)", "response": ["Secret People is a 1952 British drama film, directed by Thorold Dickinson and produced by Sidney Cole for Ealing Studios, with a screenplay from Thorold Dickinson, Wolfgang Wilhelm, Joyce Carey and Christianna Brand. Secret People stars Valentina Cortese, Serge Reggiani and Audrey Hepburn and premiered in the U.K. on 8 February 1952. The film provided Audrey Hepburn with her first significant film role, leading to her big breakthrough in Roman Holiday."]}, {"page": "List of children's books made into feature films", "response": ["| Nurse Matilda (1964–1974) (series), Christianna Brand"]}, {"page": "The Record of a Fallen Vampire", "response": ["Bridget, Strauss, and Adelheid use flashbacks to convey their perspective on the events a thousand years ago. The writer, Kyo Shirodaira, indicates that this method of deriving different truths from the same set of facts was inspired by Christianna Brand's storytelling techniques.Volume 3 afterword."]}, {"page": "Milne (surname)", "response": ["* Mary Christianna Milne Lewis, British mystery writer and children's author who wrote as Christianna Brand"]}, {"page": "Butter in a Lordly Dish", "response": ["* Sweet Death by Christianna Brand on 10 February 1948"]}, {"page": "Written in Blood (novel)", "response": ["Publishers Weekly stated in its review of the novel: \"The skill with which Graham evokes these characters and explores their individual, often damaged, emotional histories rings of Rendell and P.D. James. The few too many coincidences in the plot will be forgiven for the crisp pace and satisfying twist at the end.\" Kirkus Reviews noted: \"Graham, who deserves a wider US readership, starts out as astringently amusing as Christianna Brand in her classic Green for Danger, and then gradually broadens and deepens to P.D. James territory. What more could you want?\" Gail Pool in the Wilson Library Bulletin wrote: \"Revolving around the lives and relationships of group members, this is a complicated, satisfying mystery. For all her humor, Graham makes us feel the pathos of these individuals, some struggling to succeed, others enduring lives of 'quiet desperation,' and one of them dead.\" Emily Melton in Booklist remarked that Graham \"effectively juxtaposes the darkly malignant aspects of human behavior with the … trivialities of everyday life.\""]}, {"page": "Nanny McPhee and the Big Bang", "response": ["Nanny McPhee and the Big Bang (released in the United States and Canada as Nanny McPhee Returns) is a 2010  period fantasy comedy film directed by Susanna White, produced by Tim Bevan, Eric Fellner and Lindsay Doran with music by James Newton Howard and co-produced by StudioCanal, Relativity Media, Working Title Films and Three Strange Angels. It is a sequel to the 2005 film Nanny McPhee. It was adapted by Emma Thompson from Christianna Brand's Nurse Matilda books. Thompson reprises her role as Nanny McPhee, and the film also stars Maggie Gyllenhaal, Ralph Fiennes, Rhys Ifans, Ewan McGregor, Asa Butterfield and Maggie Smith. The film was theatrically released on 20 August 2010 by Universal Pictures."]}, {"page": "Death in High Heels", "response": ["Death in High Heels is a 1947 British crime film directed by Lionel Tomlinson and starring Don Stannard, Elsa Tee and Veronica Rose.BFI | Film & TV Database | DEATH IN HIGH HEELS (1947) It was based on the 1941 novel of the same title by Christianna Brand. It was a very early Hammer Films (here Marylebone-Hammer) production and was released through Exclusive Films, Hammer's original incarnation. Its running time was just over 50 minutes. It was last shown on British television on Channel 4 in 1991."]}, {"page": "Kono Mystery ga Sugoi!", "response": ["|Christianna Brand||Buffet for Unwelcome Guests"]}, {"page": "List of fiction works made into feature films (D–J)", "response": ["| Green for Danger (1944), Christianna Brand"]}, {"page": "Brand (surname)", "response": ["*Christianna Brand (1907–1988), British crime writer and children's author"]}, {"page": "List of fiction works made into feature films (K–R)", "response": ["| Nurse Matilda (1964–1974) (series), Christianna Brand"]}, {"page": "List of biographical dictionaries of women writers in English", "response": ["**entries for: Catherine Aird, Margery Allingham/Maxwell March, Charlotte Armstrong/Jo Valentine, Margot Arnold, Marian Babson, Nikki Baker, Linda Barnes, J. S. Borthwick, Elisabeth Bowers, Mary Elizabeth Braddon/Babington White, Christianna Brand/Mary Ann Ashe/China Thompson, Lilian Jackson Braun, Gwendoline Butler/Jennie Melville, P. M. Carlson, Vera Caspary, Sarah Caudwell, Agatha Christie/Mary Westmacott, Mary Higgins Clark, Anna Clarke, Liza Cody, Susan Conant, Patricia Cornwell, Amanda Cross, Elizabeth Daly, Barbara D'Amato/Malacai Black, Dorothy Salisbury Davis, Doris Miles Disney, Susan Dunlap, Tony Fennelly, E. X. Ferrars, Leslie Ford/David Frome, Katherine V. Forrest, Antonia Fraser, Frances Fyfield/Frances Hegarty, Elizabeth George, B. M. Gill, Dorothy Gilman, E. X. Giroux/Doris Shannon, Paula Gosling/Ainslie Skinner, Sue Grafton, Linda Grant, Leslie Grant-Adamson, Anna Katharine Green, Martha Grimes, Carolyn G. Hart, S. T. Haymon, Joan Hess/Joan Hadley, Georgette Heyer, Patricia Highsmith, Dorothy B. Hughes, P. D. James, Lucille Kallen, Faye Kellerman, Susan Kelly, Susan Kenney, Karen Kijewski, Jane Langton, Emma Lathen/R. B. Dominic, Elizabeth Lemarchand, Elizabeth Linington/Anne Blaisdell/Dell Shannon/Lesley Egan, Marie Belloc Lowndes, Sharyn McCrumb, Val McDermid, Jill McGown/Elizabeth Chaplin, Charlotte MacLeod/Ailsa Craig, Claire McNab, Margaret Maron, Ngaio Marsh, Lia Matera, M. R. D. Meek, Annette Meyers/Maan Meyers, Margaret Millar, Gladys Mitchell/Malcolm Torrie, Gwen Moffat, Susan Moody, Anne Morice/Felicity Shaw, Patricia Moyes, Marcia Muller, Magdalen Nabb, Shizuko Natsuke, Lillian O'Donnell, Emmuska Orczy, Orania Papazoglou/Jane Haddam, Sara Paretsky, Barbara Paul, Anne Perry, Elizabeth Peters/Barbara Michaels, Ellis Peters/Jolyon Carr/John Redfern/Edith Pargeter, Nancy Pickard, Joyce Porter, Sheila Radley, Seeley Regester, Ruth Rendell/Barbara Vine, Craig Rice/Daphne Saunders/Michael Venning, Virginia Rich, Mary Roberts Rinehart, Dorothy L. Sayers, Sarah Shankman/Alice Storey, Dorothy Simpson, Gillian Slovo, Joan Smith, Julie Smith, Susannah Stacey, Dorothy Sucher, Phoebe Atwood Taylor/Alice Tilton/Freeman Dana, Josephine Tey/Gordon Daviot, June Thomson, Masako Togawa, Margaret Truman, Dorothy Uhnak, Patricia Wentworth, Barbara Wilson, Chris Wiltz, Mary Wings, Sara Woods/Anne Burton/Mary Challis/Margaret Leek, L. R. Wright, Margaret Yorke."]}, {"page": "Crippen & Landru", "response": ["*Christianna Brand. The Spotted Cat (“Lost Classics Series”)"]}]}}