{"wiki_id": "http://www.wikidata.org/entity/Q460744", "itemLabel": "Ameet Chana", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ameet_Chana", "wikipedia_page": {"main": "Ameet Chana (born 12 September 1975 in Epsom, Surrey, England) is a British-Indian actor. His most notable role is Adi Ferreira in EastEnders.\nIn May 2006 he took over presenting the Breakdown Show (Bhangra Music) on BBC Asian Network (a National Radio Station).\nHe is married to barrister/actress Shikha Varma of 5 King's Bench Walk Chambers.", "link_mentions": [{"page": "2003 in film", "response": ["| Bend It Like Beckham || Fox Searchlight Pictures || Gurinder Chadha (director/screenplay); Guljit Bindra, Paul Mayeda Berges (screenplay); Parminder Nagra, Keira Knightley, Jonathan Rhys Meyers, Anupam Kher, Shaznay Lewis, Archie Panjabi, Shaheen Khan, Frank Harper, Juliet Stevenson, Ameet Chana, Kulvinder Ghir, Pooja Shah, Preeya Kalidas, Trey Farley, Zohra Sehgal, Saraj Chaudhry, Paven Virk, Gary Lineker, Alan Hansen, John Barnes || Comedy, Drama || || Live Action"]}, {"page": "Bend It Like Beckham", "response": ["Planet Bollywood gave the film a mark of 9 out of 10: the \"screenplay not only explores the development of Jess as a person, but also the changing values and culture of NRI teens: Jess's urge to break the social norm of the Indian home-maker, her sister's (Archie Punjabi) sexually active relationship, and the gay Indian [Tony, played by Ameet Chana].\"Bend It Like Beckham . Planet Bollywood review. (27 June 2003). Retrieved on 3 November 2011."]}, {"page": "BBC Asian Network", "response": ["*Ameet Chana"]}, {"page": "Chana", "response": ["* Ameet Chana (born 1975), British-Indian actor"]}, {"page": "Ameet Channa", "response": ["#REDIRECT Ameet Chana"]}, {"page": "Ameet channa", "response": ["#REDIRECT Ameet Chana"]}, {"page": "List of former EastEnders characters", "response": ["|Adi Ferreira || Ameet Chana || 2003–2005"]}, {"page": "List of feature films with LGBT characters", "response": ["| Ameet Chana"]}, {"page": "Raji James", "response": ["James attended the Royal Welsh College of Music & Drama. In 2007, he started a club night with EastEnders co-star Ameet Chana.Asians in Media - \"Raji James on his new film and on-screen sex\" , accessed 29 December 2010."]}, {"page": "Pooja Shah", "response": ["Shah played the lead role, Sona Virdi, in the play Deranged Marriage, which toured the UK in 2005. In 2006, she took on a lead role in the Britflick Cash and Curry, which was released in 2008. The film also stars Ameet Chana, the actor who played her on-screen brother Adi Ferreira in EastEnders. In 2007 she played the role of Reshna Dewan in the ITV police drama The Bill."]}, {"page": "Ronny Jhutti", "response": ["Born in London, Ronny has recently finished upcoming Britflick Cash and Curry (film). Ronny is the best friend of Ameet Chana and was cast in the part of Rohit a week before shooting commenced on the film."]}, {"page": "Music programmes on the BBC Asian Network", "response": ["*Breakdown, Bhangra with Dipps Bhamrah. Previously presented by Ameet Chana- better known as an actor and Markie Mark who is now the Head of Music at the BBC Asian Network."]}, {"page": "Jhoom Barabar Jhoom", "response": ["* Ameet Chana as Shahriyar"]}, {"page": "List of EastEnders television spin-offs", "response": ["The series ran for ten weeks, featuring ten episodes. Each episode featured an EastEnders star as a co-presenter. In the first episode, Tracy-Ann Oberman who played Chrissie Watts explained that The Queen Victoria pub uses exterior and interior sets for filming. Perry Fenwick who plays Billy Mitchell took part in \"Extractor\", a part of EastEnders Xtra which asks cast members a series of questions. The other co-presenters were Nabil Elouahabi (Tariq Larousi), Pooja Shah (Kareena Ferreira), Jemma Walker (Sasha Perkins), Natalie Cassidy (Sonia Fowler), Ameet Chana (Adi Ferreira), Cliff Parisi (Minty Peterson), Joe Swash (Mickey Miller) and Mohammed George (Gus Smith)."]}, {"page": "List of Sikhs", "response": ["* Ameet Chana – Actor"]}, {"page": "Sarjit Bains", "response": ["His second feature Cash and Curry, starring Ameet Chana and Pooja Shah, was completed in 2008 and was released in 2010 in the UK and Ireland."]}, {"page": "Samad", "response": ["*Samad, a character played by Ameet Chana in the British web series Corner Shop Show."]}, {"page": "It Could Be You (disambiguation)", "response": ["*It Could Be You (film), a 2005 British film featuring Ameet Chana"]}, {"page": "List of people from Epsom", "response": ["*Ameet Chana, actor"]}, {"page": "Tamasha Theatre Company", "response": ["Among the many well-known British Asian artists to have worked with the company are actors Parminder Nagra, Jimi Mistry, Nina Wadia, Chris Bisson, Ameet Chana, Nabil Elouahabi, Ila Arun and Zohra Sehgal; writers Ayub Khan-Din, Abhijat Joshi and Deepak Verma; and composers Shri and Nitin Sawhney."]}, {"page": "Cash and Curry (film)", "response": ["*Ameet Chana as Raj"]}, {"page": "List of EastEnders characters (2003)", "response": ["Dan Ferreira, played by Dalip Tahil, is the head of the Ferreira family, and father to Ash (Raji James), Adi (Ameet Chana), Ronny (Ray Panthaki) and Kareena (Pooja Shah). When he first arrives in Albert Square, he claims to be a widower, talking about his wife, Pushpa (Madhur Jaffrey) as being dead, both to the neighbours and his children, but they have merely separated after she had an affair. Dan disappears suddenly and clears out the family's bank account, and it is later revealed that Tariq Larousi (Nabil Elouahabi) is his illegitimate son.", "Ash Ferreira, played by Raji James, is the eldest son of Dan (Dalip Tahil) and brother of Adi (Ameet Chana), Ronny (Ray Panthaki) and Kareena (Pooja Shah). He is the intelligent member of the family, the standard of his education being much higher than his siblings, so much so that he is a lecturer. He has an on/off problem with gambling. He has a relationship with Shirley Benson (Robyn Moore), but it ends when his father finds out.", "Adi Ferreira, played by Ameet Chana, is the brother of Ash (Raji James), Ronny (Ray Panthaki) and Kareena (Pooja Shah). Adi runs a clothes stall on the market with his sister, and spends a lot of time trying to impress his father, Dan (Dalip Tahil) but fails. He has a romance with Sasha Perkins (Jemma Walker), a pole dancer and escort, who he initially pays to pretend to be his girlfriend. However she has an affair with Danny Moon (Jake Maskall) which ends the relationship.", "Ronny Ferreira, played by Ray Panthaki, is the brother of Ash (Raji James), Adi (Ameet Chana) and Kareena (Pooja Shah). Ronny is a DJ, and has brief relationships with Kelly Taylor (Brooke Kinsella) and Zoe Slater (Michelle Ryan). He is stabbed by a gang while trying to protect his friend Tariq Larousi (Nabil Elouahabi), and needs to have a kidney transplant. When none of his family are a tissue match, Tariq reveals that he is Ronny's half-brother, and he donates a kidney to him.", "Kareena Ferreira, played by Pooja Shah, is the daughter of Dan Ferreira (Dalip Tahil) and sister of Ash (Raji James), Adi (Ameet Chana) and Ronny (Ray Panthaki). Kareena is in a secret relationship with Tariq Larousi (Nabil Elouahabi), though it is not a sexual one. This is not discovered by the Ferreira family until after they break up. It later transpires that Tariq is Kareena's half-brother. She has a relationship with Mickey Miller (Joe Swash), but problems arise when Juley Smith (Joseph Kpobie) gives Kareena cocaine and she is seduced by him.", "Pushpa Ferreira, played by Madhur Jaffrey, is the mother of Ash (Ameet Chana), Adi (Ameet Chana), Ronny (Ray Panthaki) and Kareena (Pooja Shah). She is separated from her husband Dan Ferreira| (Dalip Tahil) after she had an affair with his best friend, with whom she moved in with. Dan claims to Shirley Benson (Robyn Moore) that Pushpa is dead, but his lie is uncovered when she arrives at a wedding and introduces herself to Shirley.", "She is initially shown as Adi Ferreira's (Ameet Chana) escort friend in 2003, whom he hires to pretend to be his girlfriend at a wedding to impress his father, Dan (Dalip Tahil). Originally a guest character, executive producer Louise Berridge opted to bring her back the following year, offering actress Jemma Walker a 6-month contract. Walker commented in 2004, \"I think she's a bit of light relief around the place [...] Sasha called herself an 'escort', but I think she was actually on the game. But she doesn't have any issues with it. You do what you have to do to survive.\" Sasha was reportedly brought in to spice up the Asian Ferreira family, who were heavily criticised in the British media.", "However, Gavin decides to perform one last malicious act as payback. He sabotages the Ferreiras clothing stock with paint. When the Ferreiras attempt to reclaim for the damages on their insurance, they are furious to learn that Adi (Ameet Chana) had forgotten to renew it. Gavin's last appearance is in October 2003."]}, {"page": "List of British films of 2008", "response": ["|Cash and Curry||Sarjit Bains ||Ameet Chana, Ronny Jhutti ||Comedy ||"]}, {"page": "List of British Indians", "response": ["* Ameet Chana, actor"]}, {"page": "List of people from Sylhet", "response": ["*Samad Miah (played by Ameet Chana in Corner Shop Show)"]}, {"page": "Ferreira family", "response": ["The Ferreiras were introduced in 2003 as the first Asian family in EastEnders since Sanjay (Deepak Verma) and Gita Kapoor (Shobu Kapoor), who both departed from the show in 1998. They were also the first large family to arrive since the Slater family's arrival in 2000. The family were the creation of writer Tony Jordan, and Bollywood star Dalip Tahil was cast by the show's executive producer, Louise Berridge, to play Dan Ferreira, the patriarch of the family. The family, from Goa in India, also consisted of Dan's three sons, Ronny (played by Ray Panthaki), Ash (Raji James) and Adi (Ameet Chana), and daughter Kareena (Pooja Shah). Ronny's friend Tariq Larousi, played by Nabil Elouahabi, also joined the show at the same time.", "Following the axing of the family, actor Ameet Chana accused the BBC of discriminating against the family, saying, \"I'm not afraid to admit that the Ferreira family have been treated like [shit]. We've been made scapegoats, discriminated against. They wouldn't do this to the Watts or Slater family. [...] The Ferreira family have had bad storylines and we've taken the blame for it.\""]}, {"page": "Jessica Dromgoole", "response": ["| Khalid Abdalla, Ameet Chana, Elaine Lordan, Saikat Ahamed, John Dougall, Mark Straker, Anthony Glennon and Jasmine Callan"]}, {"page": "Westside 89.6 FM", "response": ["*Ameet Chana former at BBC Asian Network"]}, {"page": "Kavi Shastri", "response": ["In 2014, Shastri returned to London to shoot for Ameet Chana's directorial feature debut Jayden."]}, {"page": "RIFCO Arts", "response": ["Well-known actors who have worked with Rifco include Shabana Azmi, Goldy Notay, Ameet Chana, Shivani Ghai, Rik Makarem, Harvey Virdi, Simon Rivers and Divian Ladwa."]}, {"page": "Islah Abdur-Rahman", "response": ["In March 2011, whilst studying at university, Abdur-Rahman launched his own film production company – IAR Media. In 2011, amongst various client jobs, he created and directed Mandem on the Wall known for its role in the E4 drama series Youngers. In the beginning of 2013, he starred in the feature film Those Four Walls, co-starring Kulvinder Ghir, Rakhee Thakrar, Antony Costa, Juggy D, directed by Ameet Chana. In April 2014 he directed and presented a documentary called British By Dissent which had its own screening and television debut. Since February 2014, he has created, directed, written, starred in the comedy series Corner Shop Show. In 2018, the comedy group known as 'The Halalians' was formed. In December 2018, Abdur-Rahman performed at the Great Muslim Panto 2018, alongside comedians and actors such as Abdullah Afzal, Once Upon A Family and Inayat Kanji. He performed at over 25 cities such as London, Cardiff and Bradford. He was one of the main actors and had meet and greet sessions with fans."]}, {"page": "Corner Shop Show", "response": ["*Ameet Chana as Samad: Malik's older brother who visits from Dubai"]}]}}