{"wiki_id": "http://www.wikidata.org/entity/Q460643", "itemLabel": "Jason Kenny", "itemDescription": "British cyclist (1988-)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Kenny", "wikipedia_page": {"main": "Sir Jason Francis Kenny,  (born 23 March 1988) is an English track cyclist, specialising in the individual and team sprints. Kenny is the holder of most Olympic gold medals (7) and medals (9) for a British athlete. His wife, Laura Kenny, holds the same records on the female side, and together they are the most successful married couple in Olympic history where both spouses have won at least one gold medal (with 12 gold and 3 silver medals between them). Kenny's seven Olympic gold medals place him joint 15th by reference to gold medals won in the Summer Olympic games since 1896. He is the single holder of most Olympic golds and medals for a cyclist.\nAfter winning World and European Junior titles in 2006 and achieving medals in the under-23 European championships in 2007, Kenny was selected to compete for Great Britain at the 2008 Summer Olympics in Beijing. With Chris Hoy and Jamie Staff, he won a gold medal in the team sprint, breaking the world record in the qualifying round. He finished behind Hoy in the final of the individual sprint, gaining a silver medal.\nIn January 2012, he gained his first world championship title, when Grégory Baugé's results were nullified after a backdated 12-month ban for missing a drugs test, and the Union Cycliste Internationale (UCI) promoted Kenny to the gold medal. At the 2012 Summer Olympics in London, he won gold medals in both the team sprint and the individual sprint, beating Baugé in the final. At the 2016 Summer Olympics Kenny again won in the Team Sprint and the Individual Sprint, and also won the Keirin.  In the 2020 Summer Olympics he won the Keirin again.", "link_mentions": [{"page": "Kraftwerk", "response": ["In 2009, Kraftwerk performed concerts with special 3D background graphics in Wolfsburg, Germany; Manchester, UK; and Randers, Denmark. Members of the audience were able to watch this multimedia part of the show with 3D glasses, which were given out. During the Manchester concert (part of the 2009 Manchester International Festival) four members of the GB cycling squad (Jason Kenny, Ed Clancy, Jamie Staff and Geraint Thomas) rode around the Velodrome while the band performed \"Tour de France\". The group also played several festival dates, the last being at the Bestival 2009 in September, on the Isle of Wight.Kraftwerk to headline Bestival , ventnorblog.com (26 February 2009) 2009 also saw the release of The Catalogue box set in November. It is a 12\" album-sized box set containing all eight remastered CDs in cardboard slipcases, as well as LP-sized booklets of photographs and artwork for each individual album."]}, {"page": "March 23", "response": ["*  1988   – Jason Kenny, English cyclist"]}, {"page": "Track time trial", "response": ["The Olympic Record of 9.551 seconds was set by Jason Kenny of Great Britain at the Rio 2016 Olympics, beating his own Olympic Record of 9.713 set at the 2012 London Olympics."]}, {"page": "Sprint (track cycling)", "response": ["Great Britain and Germany currently hold two of the major titles in this event. Jason Kenny is Olympic men's sprint champion, and Kristina Vogel the Olympic women's sprint champion."]}, {"page": "Keirin", "response": ["At the Tokyo 2020 Olympics, the Men's keirin took place on 7 and 8 August 2021, with 30 cyclists from 18 nations competing, and the gold medal going to Jason Kenny from Great Britain.  The Women's keirin took place on 4 and 5 August 2021, with 29 cyclists from 18 nations competing, and the gold medal going to Shanne Braspennincx from The Netherlands."]}, {"page": "1988", "response": ["* March 23 – Jason Kenny, British cyclist"]}, {"page": "Steve Redgrave", "response": ["Redgrave is regarded as one of Britain's greatest-ever Olympians. As of 2016 he was the fourth-most decorated British Olympian, after cyclists Sir Chris Hoy, Sir Jason Kenny and Sir Bradley Wiggins. He has carried the British flag at the opening of the Olympic Games on two occasions. In 2002, he was ranked number 36 in the BBC poll of the 100 Greatest Britons. He received the BBC Sports Personality of the Year – Lifetime Achievement Award in 2011."]}, {"page": "List of people on the postage stamps of the United Kingdom", "response": ["*Jason Kenny (2012 twice)"]}, {"page": "List of British postage stamps", "response": ["**Philip Hindes, Chris Hoy and Jason Kenny – Men's team sprint", "**Jason Kenny – Men's sprint"]}, {"page": "Jason Kenney", "response": ["Kenney studied philosophy at the University of San Francisco, a Jesuit university in San Francisco, California, but failed to complete his coursework. During his time in California, Kenney was interviewed by CNN for a segment exploring \"religious values.\" In the segment, where he was credited as \"Jason Kenny – Anti-abortion Activist,\" he argued against Jesuit professors who declared free speech as essential to a university. Allowing pro-choice activists on campus, Kenney argued, was \"destroying the mission and the purpose of this university.\" In the student newspaper, the San Francisco Foghorn, he suggested that giving a platform to pro-choice groups would mean the school had no basis to refuse a similar platform to pedophiles or to the Church of Satan."]}, {"page": "Manchester Velodrome", "response": ["The Revolution Series opened in 2003 to build on events such as the world championships and World Cup meetings and provide more regular events. There were four Revolution events over the winter of 2003–04. They built good crowds. The seventh, in 2005, sold all the seats with further fans standing. The first official sell-out was Revolution 14. The series of sprint and endurance events runs on Saturday nights. Internationals compete with British stars and up-and-coming talent. Some riders have retired at Revolution events, rewarded with a retirement presentation. A Future Stars competition has races for young riders aged 15 or 16 to test their sprint and endurance. Olympic riders Jason Kenny and Steven Burke came up through this series. In 2012 it was announced that Revolution events would take place at the recently opened London Velodrome and Glasgow Velodrome from 2013."]}, {"page": "Question of Sport", "response": ["On 1 September 2012, Katherine Grainger and Jason Kenny were among the gold medal winners featured."]}, {"page": "Bradley Wiggins", "response": ["Sir Bradley Marc Wiggins, CBE (born 28 April 1980) is a British former professional road and track racing cyclist, who competed professionally between 2001 and 2016. He began his cycling career on the track, but later made the transition to road cycling. He won world titles in four disciplines (Madison, individual pursuit, team pursuit and road time trial), and Olympic gold in three (individual pursuit, team pursuit and road time trial). He is the only rider to have won both World and Olympic championships on both the track and the road as well as winning the Tour de France. He has worn the leader's jersey in each of the three Grand Tours of cycling and held the world record in team pursuit on multiple occasions. He won a gold medal at four successive Olympic Games from 2004 to 2016, and held the record as Great Britain's most decorated Olympian with 8 medals until Jason Kenny won his 9th in 2021. He is the only rider to win both the Tour de France and Olympic Gold in the same year, winning them a week apart in 2012. During his career and afterwards he faced a series of allegations that he exploited a loophole in cycling’s anti-doping regulations to use a performance-enhancing drug, but he did not receive any bans or suspensions in relation to doping during his career."]}, {"page": "Kenny", "response": ["* Jason Kenny (born 1988), English cyclist"]}, {"page": "The Big Fat Quiz of the Year", "response": ["Pre-recorded guest questions came from Joe Wicks, Nick Hewer, Joey Essex, Laura and Jason Kenny, Derren Brown, Ollie Locke from Made in Chelsea and Darcey Bussell. Jonnie Peacock provided the in-studio guest question in the form of sporting celebrations. The children of Mitchell Brook Primary School acted out the Napster lawsuits. Jon Snow reported on The Weather Girls' \"It's Raining Men\". Charles Dance read confusing movie reviews from Amazon customers. The London Philharmonic Choir appeared to sing popular hip-hop and rap tunes in a choral style for the final question."]}, {"page": "List of British cyclists", "response": ["* Jason Kenny"]}, {"page": "Chris Hoy", "response": ["Hoy is eleven-times a world champion and six-times an Olympic champion. With a total of seven Olympic medals, six gold and one silver, Hoy is the second most decorated Olympic cyclist of all time. Between 2012 and 2021 he was the most successful British Olympian and the most successful Olympic cyclist of all time. In 2021 he finally ceded both records to erstwhile colleague and rival Sir Jason Kenny . His seventeen global titles across four disciplines makes Hoy the most successful track cyclist at the global level of all times.", "With his three gold medals in 2008 Summer Olympics, Hoy became Scotland's most successful Olympian, the first British athlete to win three gold medals in a single Olympic Games since Henry Taylor in 1908, and the most successful Olympic cyclist of all time. After winning a further two gold medals (in the keirin and team sprint) at the 2012 Summer Olympics, Hoy has won the second most Olympic gold medals (six) of all British athletes, behind Jason Kenny, and more total medals (seven) than any except fellow cyclists Kenny and Sir Bradley Wiggins.", "Hoy won silver in Berlin, at the 1999 UCI Track Cycling World Championships in the team sprint, riding at man one, Craig MacLean at 2 and Jason Quealley at 3. Regular teammates in the team sprint over the years have included Craig MacLean, Ross Edgar, Jamie Staff, Jason Queally, Matthew Crampton and Jason Kenny.", "He made his return to racing in the UK at the Revolution 22 event in Manchester in December. He received a standing ovation from the Manchester faithful at the start of the event when he was introduced to the crowd. At this event Hoy won both the Sprint and Keirin competitions, defeating likes of Jason Kenny, Jamie Staff, Ross Edgar, Matthew Crampton and Teun Mulder along the way. Hoy competed in the World Cup Classics series' final event in Copenhagen, Denmark in February, helping his team to a gold medal in the team sprint event. However, he crashed out during the men's Keirin final and was forced to miss the final day of competition, including the men's sprint. Although at first, his injury seemed minor, he returned to Manchester where, following a scan, he was diagnosed with a serious de-gloving injury which finished his season and kept him off his bike for almost 3 months. He was unable to compete as planned at the Revolution 24 event in Manchester the following weekend, he did however make an appearance at the event. He had to pull out of the World Championships in Poland at the end of March, where he would have attempted to defend 2 World titles, because of the hip injury.", "Hoy started the 09/10 track season at the National Cycling Centre, Manchester, at the British National Championships where he took only his second (and third) ever individual national titles. He took gold medals in the Keirin, Sprint and was part of the Team Sprint Team representing team SKY along with Jamie Staff and Jason Kenny. Two weeks later, he raced in round one of the UCI World Cup at the same venue and took gold in the Men's Keirin. He then went into day 2 of the competition and took gold in the sprint event, beating fellow Brit Matthew Crampton in the final 2–0. A third World Cup gold came in the Team Sprint on the Sunday. Having ridden and won 12 events over the weekend, he withdrew from the International Japanese Keirin which was consequently won by Crampton.", "Hoy lost in the first round of the men's sprint at the European Championships to Ireland's Felix English. At the Manchester World Cup event in February 2011, Hoy lost in the semi-finals to Jason Kenny. Hoy took the match sprint title at the British National Championships in October 2011.Sir Chris Hoy makes statement of intent in single match sprint victory , guardian.co.uk, 1 October 2011.", "Hoy was an ambassador for the 2012 Olympic Games in London. Hoy led Team GB out as the team's flag carrier at the opening ceremony. He then went on to win gold in the team sprint with Jason Kenny and Philip Hindes, setting a new world record in the velodrome and becoming Team GB's joint gold record holder with Sir Steve Redgrave's tally of five gold medals with a total of six medals (5 gold, 1 silver).", "On 7 August 2012 Hoy won gold in the Keirin to overtake Sir Steve Redgrave and become the most successful British olympian ever, winning a total of 6 gold medals. This also made him the joint holder of most medals won by any British athlete in the Olympic Games with fellow cyclist Sir Bradley Wiggins and Jason Kenny.", "* 2008 – 15px Team sprint (with Jason Kenny and Jamie Staff); 15px Keirin; 15px Sprint", "* 2012 – 15px Team sprint (with Jason Kenny and Philip Hindes); 15px Keirin"]}, {"page": "Cycling at the Summer Olympics", "response": ["Great Britain's Chris Hoy, the first Olympic cyclist to win six gold medals, holds the unique distinction of having won gold across four different disciplines; the Kilo, the team sprint (twice), match sprint and keirin (twice) disciplines. Three cyclists share the record for gold medals in the same event with three; Jason Kenny in team sprint, compatriot Ed Clancy in team pursuit, and American Kristin Armstrong in time trial. All three achieved the feat between 2008 and 2016."]}, {"page": "John Inverdale", "response": ["On the final day of the Olympics coverage, Inverdale was criticised again during a boxing broadcast when he interrupted Joshua to speak about the victorious French boxer Tony Yoka and claimed that Yoka and his partner might have become the first engaged or married couple to both win gold medals at the same Olympics, in spite of British cyclists Laura Trott and her fiancé Jason Kenny both having won golds just days earlier, and married couple Kate Richardson-Walsh and Helen Richardson-Walsh having both won gold medals in the women's hockey just two days prior."]}, {"page": "Great Britain at the Olympics", "response": ["The most successful British Olympian by gold medals won is Jason Kenny, who has won seven gold medals in track cycling. He is followed by Sir Chris Hoy who won six. Kenny also has the most total medals with 9, followed by fellow cyclist Sir Bradley Wiggins who has eight. Laura Kenny, with five gold medals, has the most golds of any British female athlete and became the first British woman to win gold at three consecutive Olympic Games at Tokyo 2020. She shares the designation of most total medals by a British female competitor with horse-rider Charlotte Dujardin. Sir Steve Redgrave is the only British Olympian to win a gold medal in five consecutive Olympic Games, winning his first in 1984 Los Angeles and last in 2000 Sydney.", "* Jason Kenny (Cycling)", "Jason Kenny with seven gold and two silver medals is the most successful British Olympian, most successful British cyclist, indeed the most successful cyclist, in Olympic history. His wife, Laura Kenny is the most successful British female Olympian, and most successful Olympic female cyclist in history, with five golds and one silver."]}, {"page": "Cervélo", "response": [":: 1st 15px  (Philip Hindes, Jason Kenny & Callum Skinner), Men's team sprint", ":: 1st 15px Jason Kenny, Men's keirin", ":: 1st 15px Jason Kenny, Men's sprint"]}, {"page": "British Rail Class 395", "response": ["Following the 2012 Olympics and Paralympics, Southeastern announced that another 12 units would be named after members of Team GB, including Alistair Brownlee, Ed Clancy, Hannah Cockroft, Jessica Ennis, Mo Farah, Jason Kenny, Jonnie Peacock, Victoria Pendleton, Ellie Simmonds, Dame Sarah Storey, Laura Trott and David Weir.", "|align=center|Jason Kenny"]}, {"page": "1988 in the United Kingdom", "response": ["* 23 March – Jason Kenny, English track cyclist"]}, {"page": "List of Olympic medalists in cycling (men)", "response": ["Introduced in the 2000 Summer Olympics in Sydney, Australia, the team sprint is effectively a 750 metre team time trial, with a rider peeling off at the end of each lap. since its introduction, the event has been dominated by Great Britain, with three wins from the six occasions on which the event was held, and two silver medals. Jason Kenny holds the record of three gold and one silver medal in the event, having been a part of the winning team on three consecutive occasions between 2008 and 2016. France, the first winners of the event in Sydney, are the only nation to have won a medal in every edition, with 1 gold, 2 silvers and 3 bronze medals.", "|Chris HoyJason KennyJamie Staff", "|Chris HoyJason KennyPhilip Hindes", "|Philip HindesJason KennyCallum Skinner", "|Jack CarlinJason KennyRyan Owens"]}, {"page": "Craig MacLean", "response": ["MacLean's career as a member of the British elite team came to a close in 2008. He suffered from a mystery illness ( later diagnosed as Coeliac disease) for the majority of his career so could no longer perform at the level required. This, coupled with the form of rising stars like Jason Kenny and resurgence of fellow veteran Jamie Staff, meant that he narrowly missed out on the squad for the World Championships and Olympic games."]}, {"page": "2006–07 UCI Track Cycling World Cup Classics", "response": ["| Team sprint ||  Matthew Crampton Jason Kenny Craig MacLean ||  Theo Bos Teun Mulder Tim Veldt ||  Grégory Baugé Mickaël Bourgain Kévin Sireau", "| Team sprint ||  Chris Hoy  Jamie Staff  Matthew Crampton ||  Grégory Baugé  François Pervis  Kévin Sireau ||  Ross Edgar  Jason Kenny  Jason Queally "]}, {"page": "Cycling at the 2008 Summer Olympics", "response": ["|Jamie StaffJason KennyChris Hoy"]}]}}