{"wiki_id": "http://www.wikidata.org/entity/Q461248", "itemLabel": "Neon Hitch", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Neon_Hitch", "wikipedia_page": {"main": "Neon Hitch (born 25 May 1986) is an English singer and songwriter. She was signed to Mike Skinner and Ted Mayhem's label, The Beats, before it closed down. She was later discovered on MySpace by Benny Blanco, who flew her to New York City to work with him. Their work together earned her a music publishing deal with EMI and a record deal with Warner Bros. Records. Neon's debut album, Anarchy, was released on 22 July 2016 via WeRNeon.", "link_mentions": [{"page": "Sparks", "response": ["* \"Sparks\", a song by Neon Hitch from Eleutheromaniac"]}, {"page": "Busta Rhymes", "response": ["He was featured on \"Devil\", featuring Neon Hitch and B.o.B, a song by Cash Cash. It was released in August 2015. In July 2014, it was announced that Rhymes had amicably departed Cash Records due to creative differences."]}, {"page": "American Top 40", "response": ["Songs with offensive words in their titles were often censored for radio airplay, and is reflected in their inclusion on AT40. In 2011, three such songs have made it to the #1 position on AT40: \"Fuck You\" by CeeLo Green (changed to \"Forget You\"), \"Fuckin' Perfect\" by Pink (changed to \"Perfect\"), and \"Tonight (I'm Fuckin' You)\" by Enrique Iglesias (changed to \"Tonight (I'm Lovin' You)\"). Other notable songs included \"Niggas in Paris\" by Jay-Z & Kanye West (becoming \"In Paris\", peaking at #5), \"Ass Back Home\" by Gym Class Heroes (became \"Get Yourself Back Home\", peaking at #12), \"I Don't Fuck With You\" by Big Sean featuring E-40 (became \"I Don't Mess With You,\" peaking at #34), \"Fuck U Betta\" by Neon Hitch (becoming \"Love U Betta\" and peaking at #29; this song was also first played in Subway's Fresh Buzz Song of the Week), and Bella Poarch's \"Build a Bitch\" (became \"Build a B\", peaking at #27)."]}, {"page": "Gym Class Heroes", "response": ["McCoy had discussed the band's new album, The Papercut Chronicles II, \"We're about 12 demos deep. All I got to say is it's definitely going back to the essence of Gym Class Heroes, which is four dudes sitting in a room, vibing off each other and making organic, dark metal.\"Travis McCoy Says Gym Class Heroes Are Getting Back To Basics. MTV News. On June 9, 2011, Gym Class Heroes released a song entitled \"Stereo Hearts\" which features Adam Levine from Maroon 5. It is the first single to be released from The Papercut Chronicles II. It became available for download on iTunes on June 14, 2011. It peaked at No. 4 on the Billboard Hot 100. On October 18, 2011, Gym Class Heroes released a song entitled \"Life Goes On\" which features Oh Land. It is the first and only promotional single to be released from The Papercut Chronicles II. On October 31, the band released their second single of the album, \"Ass Back Home\", featuring Neon Hitch via iTunes.https://itunes.apple.com/us/album/ @#!*% -back-home-feat.-neon-hitch/id474361377 The third single \"The Fighter\" features Ryan Tedder from OneRepublic and was released on November 8, 2011, one week before the album's release on November 15. On November 20, 2011, Gym Class Heroes performed \"Stereo Hearts\" with Adam Levine on the American Music Awards of 2011. The video for the fourth single, \"Martyrial Girls\", premiered on Fueled by Ramen's YouTube channel on August 27, 2012. Following the release of the single, the group ceased activity and entered a hiatus."]}, {"page": "Wireless Festival", "response": ["* Friday, 2 July: P!nk, The Ting Tings, Gossip, The Temper Trap, Plan B, Bowling For Soup, Hockey, Daisy Dares You, Neon Hitch, Taylor Hawkins and the Coattail Riders, Bluey Robinson"]}, {"page": "List of artists who reached number one on the U.S. Dance Club Songs chart", "response": ["* Neon Hitch (2)"]}, {"page": "Amanda Lepore", "response": ["In June 2011, Lepore debuted her album I...Amanda Lepore at the Highline Ballroom with Cazwell, Kat Deluna, Neon Hitch, Ana Matronic, Jonté, and many others. Her debut full-length album I...Amanda Lepore was released in 2011 on Peace Bisquit.Visco, Gerry (June 29, 2011). Bash Compactor: Golden Girl. New York Press"]}, {"page": "VH1 Top 20 Video Countdown", "response": ["David Cook and David Archuleta, the winner and runner-up of American Idol season 7 were the first guest stars to introduce their own music video at the #1 spot. David Archuleta introduced his video \"Crush\" on November 15, 2008. The following Countdown on November 22, 2008,  Cook made a guest appearance to introduce his music video for \"Light On\" which was making its Countdown Debut at #1. Shinedown joined the group to introduce a song at #1 when their video for \"Second Chance\" was #1 on May 16, 2009. Introducing \"Come Back To Me\" at #1 on May 30, 2009, made David Cook the first to introduce two music videos at #1 on two occasions. Later in 2009 Daughtry introduced their music video for \"No Surprise\" at #1 on July 18, 2009, and Jay Sean introduced his music video for \"Down\" at #1 on October 17, 2009. After four months of no one introducing their own video at #1, Adam Lambert would also join the group as he introduced his video, \"Whataya Want from Me,\" at #1 on February 20, 2010. At VH1's Winter Wonderland Countdown Special, The Script introduced their video, Breakeven at #1 on March 6, 2010. For five months, no one had introduced their song at number one until August 21, 2010, where B.o.B introduced Airplanes at #1. Two months later, on October 9,  Bruno Mars introduced his #1 single, \"Just the Way You Are,\" at #1. Following a four- to five-month absence of an artist introduction at #1, on February 26, 2011, Adele introduced \"Rolling in the Deep\" at #1. On November 5, 2011, Kelly Clarkson introduced \"Mr. Know It All\" at #1 after a nine-month absence. On March 24, 2012, Neon Hitch introduced \"Ass Back Home\" at #1. Since then there has been no one else to introduce their own videos at #1 but it's likely there will be more by looking at past Countdowns where this has occurred.", "|Gym Class Heroes feat. Neon Hitch"]}, {"page": "WPXY-FM", "response": ["June 12, 2012 at the Frontier Field featuring Dev, Neon Hitch, Breath Carolina, Carly Rae Jepsen, Chiddy Bang, Wallpaper., Karmin, and Gym Class Heroes."]}, {"page": "The Bamboozle", "response": [":*Intro – Hype Rally, Matt Clark, Ninjasonik, Neon Hitch, Dean's List, Big Heed and Alien, Chiddy Bang, New Boyz"]}, {"page": "Big Brother (German TV series)", "response": ["| Neon Hitch"]}, {"page": "Busta Rhymes discography", "response": ["! scope=\"row\"| \"Devil\"(Cash Cash featuring Busta Rhymes, B.o.B and Neon Hitch)"]}, {"page": "Gym Class Heroes discography", "response": ["! scope=\"row\"| \"Ass Back Home\"(featuring Neon Hitch) "]}, {"page": "List of former Warner Records artists", "response": ["* Neon Hitch"]}, {"page": "List of former Reprise Records artists", "response": ["* Neon Hitch"]}, {"page": "List of Lollapalooza lineups by year", "response": ["Sunday: Mike's Pawn Shop, Esser, The Greencards, Priscilla Renea (replaced Neon Hitch), Ke$ha", "Sunday: Son of a Bad Man, Neon Hitch, The Band of Heathens, Freelance Whales, Violent Soho"]}, {"page": "Pollo Del Mar", "response": ["To date, Del Mar has released four dance music singles \"How Embarrassing\" (2012), \"Made You Look\" (2013) with Billboard charting artist Kwanza Jones, \"#WhiteLadyProblems\" (2014) and is featured on the song \"Last Night,\" from the 2017 album Ban2oozle by Billboard Top 5 Dance Chart recording artist and openly gay rapper Jipsta. He is heavily featured in the music video \"WannaBe,\" a cover of The Spice Girls by Billboard Dance chart-topping artist Neon Hitch."]}, {"page": "Cash Cash", "response": ["Billboard officially announced the group's fourth full-length album titled, Blood, Sweat & 3 Years on April 29, 2016. The pre-order went live with the single \"How To Love\", featuring Sofia Reyes along with a few previously released songs available for instant download. The album includes songs featuring singers Bebe Rexha, Christina Perri, Dev, John Rzeznik, Julia Michaels, Michael \"Fitz\" Fitpatrick from Fitz and the Tantrums, Neon Hitch; rappers B.o.B, Busta Rhymes, Nelly, and Trinidad James; and groups Little Daylight, and Night Terrors of 1927. Upon the album's pre-order, a music video for the single \"How To Love\" was released online. That same day, the trio also launched their new radio show on Sirius XM's \"BPM\" channel called \"Cash Cash Radio.\" Blood, Sweat & 3 Years debuted at number 125 on the US Billboard 200. On June 20, 2016, they released a music video for \"Broken Drum\", featuring Fitz of Fitz and the Tantrums. The music video was filmed throughout Las Vegas and had a guest appearance by Wiz Khalifa.", "! scope=\"row\" | \"Devil\"(featuring Busta Rhymes, B.o.B and Neon Hitch)"]}, {"page": "Off the Deep End (The Friday Night Boys album)", "response": ["*Neon Hitch – backing vocals on \"Stupid Love Letter\""]}, {"page": "NewNowNext Awards", "response": ["* Neon Hitch (Warner Bros. Records)"]}, {"page": "Dsign Music", "response": ["* 2015: Neon Hitch - \"Sparks\" - single released by WeRNeon & Dsign Music"]}, {"page": "Blah Blah Blah (Kesha song)", "response": ["\"Blah Blah Blah\" is a song by American recording artist Kesha from her debut album, Animal (2010). Produced by Benny Blanco, and co-written by Kesha, Blanco, Neon Hitch and Sean Foreman, it was released as the album's second single on January 29, 2010, and features 3OH!3. Initial writing of the song took place when Kesha, Blanco, Hitch and Foreman were discussing which sex talked more and which one was more \"obnoxious.\" The song is a midtempo electropop song that speaks of men in the same way that they have talked about women in the music industry. The lyrics depict a woman who would rather have sex than listen to a man speak and features blatant come-ons throughout the song.", "\"Blah Blah Blah\" was written by Kesha alongside Neon Hitch, Sean Foreman, and Benny Blanco, who also produced the song. Kesha said that the song originated from a discussion they had in the studio on the politics of female-male relationships which Kesha later explained, \"The song came about when the people that wrote it — me, Benny Blanco, Neon Hitch and [3OH!3's] Sean Foreman — all got in a room, and they were talking about how chicks talk too much,\" [...] \"And me and Neon were like, 'No, no, no, guys talk too much,\" [...] \"So, we had this war of who were more obnoxious, chicks or dudes. And the song kind of came around from that conversation. I think I make a pretty fair point both in this video and in the song, that dudes are way more annoying.\"", "* Songwriting – Kesha Sebert, Benny Blanco, Neon Hitch, Sean Foreman", "Category:Songs written by Neon Hitch"]}, {"page": "Follow Me Down (3OH!3 song)", "response": ["\"Follow Me Down\" is a song by American duo 3OH!3 featuring English singer Neon Hitch from the album Almost Alice (2010).", "Category:Songs written by Neon Hitch"]}, {"page": "Kinetics & One Love", "response": ["Jeremy \"Kinetics\" Dussolliet and Tim \"One Love\" Sommers are a hip-hop group and songwriting duo from New York City. They made their commercial debut as songwriters in 2010 by penning the chorus to B.o.B's single \"Airplanes.\" They have collaborated with R.A. the Rugged Man and Remedy from Wu-Tang Killa Bees, Termanology and the Unknown Prophets, Neon Hitch, Melanie Martinez and Wynter Gordon.", "|rowspan=\"11\"| 2014 ||rowspan=\"7\"| Neon Hitch ||rowspan=\"6\"| 301 to Paradise || \"Intro\""]}, {"page": "B.o.B. discography", "response": ["! scope=\"row\" | \"Devil\"(Cash Cash featuring Busta Rhymes, B.o.B and Neon Hitch)"]}, {"page": "Just Be Good to Green", "response": ["The track was originally made back in 2007 when Professor Green was signed to The Beats. The song was composed and produced by Semothy Jones and, at the time, featured Neon Hitch on the chorus.  Though when The Beats folded the track was put on hold."]}, {"page": "No Hands", "response": ["T-Pain made a remix titled \"No Hands (T-Mix)\". Chamillionaire made a freestyle to the beat titled \"After the Super Bowl\".Archive.org R&B girl group RichGirl created a remix to the song, released on their Fall in Love with RichGirl mixtape, in which member Brave raps.Rap-Up.com || New Music: RichGirl – 'Fall in Love with RichGirl' [Mixtape] In 2011, Cold Blank released a remix titled \"No Hands – Cold Blank's Dirty Radio Mix\". British singer Neon Hitch uploaded a cover version of the song to her official YouTube page in September 2011.Neon Hitch – No Hands (Waka Flocka Cover) [Official Cover Video] – YouTube A remix was made featuring Japanese pop star Kyary Pamyu Pamyu's \"Pon Pon Pon\". Another remix, titled \"No Handz\", was created by CRNKN and uploaded to the Trap City YouTube channel on December 25, 2012."]}, {"page": "Hoppus on Music", "response": ["| 504 || March 8, 2012 || Neon Hitch || (no performance)"]}, {"page": "3OH!3 discography", "response": ["! scope=\"row\"| \"Follow Me Down\" (featuring Neon Hitch)"]}, {"page": "List of people from the Royal Borough of Kingston upon Thames", "response": ["* Neon Hitch, singer (1986)"]}, {"page": "So You Think You Can Dance (American season 8)", "response": ["|\"Follow Me Down\"—3OH!3 feat. Neon Hitch"]}]}}