{"wiki_id": "http://www.wikidata.org/entity/Q462574", "itemLabel": "Diana Mitford", "itemDescription": "British fascist, writer and editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Diana_Mitford", "wikipedia_page": {"main": "Diana Mitford, Lady Mosley (née Freeman-Mitford; 17 June 1910 – 11 August 2003) was one of the Mitford sisters. She was first married to Bryan Walter Guinness, heir to the barony of Moyne, and with whom she was part of the Bright Young Things social group of Bohemian young aristocrats and socialites in 1920s London. Her marriage ended in divorce as she was pursuing a relationship with Sir Oswald Mosley, 6th Baronet of Ancoats, leader of the British Union of Fascists. She married Mosley at the home of Joseph Goebbels in 1936, with Adolf Hitler as guest of honour.\nHer involvement with Fascist political causes resulted in three years' internment during the Second World War. She later moved to Paris and enjoyed some success as a writer. In the 1950s, she contributed diaries to Tatler and edited the magazine The European. In 1977, she published her autobiography, A Life of Contrasts, and two more biographies in the 1980s.Her appearance on the BBC's Desert Island Discs in 1989 was controversial.  She was also a regular book reviewer for Books & Bookmen and later at The Evening Standard in the 1990s. A family friend, James Lees-Milne, wrote of her beauty, \"She was the nearest thing to Botticelli's Venus that I have ever seen\". She was described as \"unrepentant\" about her previous political associations by obituary writers such as the historian Andrew Roberts.", "link_mentions": [{"page": "Wallis Simpson", "response": ["According to the wife of former British Union of Fascists leader Oswald Mosley, Diana Mitford, who knew both Queen Elizabeth and the Duchess of Windsor but was only friendly with the latter, the Queen's antipathy toward her sister-in-law may have resulted from jealousy. Lady Mosley wrote to her sister, the Duchess of Devonshire, after the death of the Duke of Windsor, \"probably the theory of their [the Windsors'] contemporaries that Cake [a Mitford nickname for the Queen Mother] was rather in love with him [the Duke] (as a girl) & took second best, may account for much.\"Letter from Lady Mosley to the Duchess of Devonshire, June 5, 1972, in Mosley, Charlotte (ed.) (2007). The Mitfords: Letters Between Six Sisters. London: Fourth Estate, p. 582"]}, {"page": "Oswald Mosley", "response": ["=== Marriage to Diana Mitford ==="]}, {"page": "Chatsworth House", "response": ["In May 1944 Kathleen Kennedy, sister of John F. Kennedy, married William Cavendish, Marquess of Hartington, elder son of the 10th Duke of Devonshire. However, he was killed in action in Belgium in September 1944 and Kathleen died in a plane crash in 1948. His younger brother Andrew became the 11th Duke in 1950. He was married to Deborah Mitford, one of the Mitford girls, sister to Nancy Mitford, Diana Mitford, Pamela Mitford, Unity Mitford and Jessica Mitford"]}, {"page": "Mitford family", "response": ["*Diana Mitford (17 June 1910 – 11 August 2003) married aristocrat and writer Bryan Walter Guinness in 1929. She left him in 1933 for British fascist leader Sir Oswald Mosley, with whom she had two sons, Alexander and Max Mosley. The couple were interned in Holloway Prison from May 1940 until November 1943.", "File:Diana Mitford by William Acton.jpg|Diana Mitford (1910–2003)"]}, {"page": "Unity Mitford", "response": ["Unity and Diana Mitford travelled to Germany as part of the British delegation from the British Union of Fascists, to the 1933 Nuremberg Rally, seeing Hitler for the first time. Mitford later said, \"The first time I saw him I knew there was no one I would rather meet.\" Biographer Anne de Courcy confirms: \"The Nuremberg rally had a profound effect on both Diana and Unity ... Unity was already, as it were, convinced about Hitler, but this turned conviction into worship. From then on she wanted to be near Hitler as much as possible\".", "At the 1939 Bayreuth Festival, Hitler warned Unity and her sister Diana that war with Britain was inevitable within weeks and they should return home. Diana returned to England, while Unity chose to remain in Germany, though her family sent pleas for her to come home. After Britain's declaration of war on Germany on 3 September 1939, Unity was distraught. Diana Mitford told an interviewer in 1999: \"She told me that if there was a war, which of course we all terribly hoped there might not be, that she would kill herself because she couldn't bear to live and see these two countries tearing each other to pieces, both of which she loved.\" On the morning of 3 September she visited the Gauleiter Adolf Wagner to inquire if she would be detained as an enemy alien, receiving assurances from Wagner that she would not. He was concerned by her demeanor and assigned two men to follow her, but she managed to shake them off by the time she entered the English Garden in Munich, where she took a pearl-handled pistol given to her by Hitler for protection and shot herself in the head. She survived the suicide attempt, and was hospitalised in Munich, where Hitler frequently visited her. He paid her bills and arranged for her return home."]}, {"page": "John Betjeman", "response": ["Betjeman was fond of the ghost stories of M.R. James and supplied an introduction to Peter Haining's book M. R. James – Book of the Supernatural. He was susceptible to the supernatural; Diana Mitford tells the story of Betjeman staying at her country home, Biddesden House, in the 1920s. She says, \"he had a terrifying dream, that he was handed a card with wide black edges, and on it his name was engraved, and a date. He knew this was the date of his death\". For the last decade of his life Betjeman suffered increasingly from Parkinson's disease. He died at his home in Trebetherick, Cornwall, on 19 May 1984, aged 77, and is buried nearby at St Enodoc's Church."]}, {"page": "British Union of Fascists", "response": ["** Diana Mitford (Lady Mosley, after her marriage to Sir Oswald Mosley in 1936)", "* The British novelist Nancy Mitford satirized the BUF and Mosley in Wigs on the Green (1935). Diana Mitford, the author's sister, had been romantically involved with Mosley since 1932."]}, {"page": "Bryan Guinness, 2nd Baron Moyne", "response": ["Bryan Walter Guinness, 2nd Baron Moyne,  (27 October 1905 – 6 July 1992) was an heir to part of the Guinness family brewing fortune, and a lawyer, poet and novelist. He was briefly married to Diana Mitford.", "In 1929, Guinness married Hon Diana Mitford, one of the Mitford sisters.  They had two sons:"]}, {"page": "Diana Mosley", "response": ["#REDIRECT Diana Mitford"]}, {"page": "Cheyne Walk", "response": ["* Diana Mitford lived at number 96 with her first husband Bryan Guinness in 1932."]}, {"page": "Angus Ogilvy", "response": ["His grandmother, Mabell Ogilvy, Countess of Airlie, was a close friend and lady-in-waiting to Queen Mary. His father was a lord-in-waiting to George V and Lord Chamberlain to Queen Elizabeth (later the Queen Mother). He was a second cousin of Diana Mitford, a second cousin of Lavinia Fitzalan-Howard, Duchess of Norfolk, and a second cousin once removed of Robert Gascoyne-Cecil, 5th Marquess of Salisbury."]}, {"page": "HM Prison Holloway", "response": ["Holloway held Diana Mitford under Defence Regulation 18B during World War II, and after a personal intervention from Prime Minister Winston Churchill, her husband Sir Oswald Mosley was moved there. The couple lived together in a cottage in the prison grounds. They were released in 1943."]}, {"page": "Randolph Churchill", "response": ["As a teenager Randolph fell in love with Diana Mitford, sister of his friend Tom Mitford.Soames 2003, p. 283 Tom Mitford was regarded as having a calming influence on him,Lovell 2012, pp. 355–56 although his housemaster Colonel Sheepshanks wrongly suspected Randolph and Tom of being lovers; Randolph replied, \"I happen to be in love with his sister\".Churchill 1997, p. 43"]}, {"page": "Baron Moyne", "response": ["A member of the prominent Guinness brewing family, he was the third son of The 1st Earl of Iveagh, third son of Sir Benjamin Guinness, 1st Baronet, of Ashford. His son, the second Baron, was a poet and novelist, and the first husband of Diana Mitford, one of the famous Mitford sisters, who went on to marry the fascist Sir Oswald Mosley."]}, {"page": "Dolphin Square", "response": ["John Vassall, the Soviet spy, was arrested at apartment 807 in the square's Hood House in 1962. Oswald Mosley and his wife Diana Mitford, Lady Mosley, left their apartment at Dolphin Square for internment in 1940 during the Second World War."]}, {"page": "Max Mosley", "response": ["Mosley was the youngest son of Sir Oswald Mosley, former leader of the British Union of Fascists,  and Diana Mitford. He was educated in France, Germany, and Britain before going on to attend university at Christ Church, Oxford, where he graduated with a degree in physics. He then changed to law and was called to the bar in 1964. In his teens and early twenties, Mosley was involved with his father's post-war political party, the Union Movement (UM). He commented that the association of his surname with fascism stopped him from developing his interest in politics further, although he briefly worked for the Conservative Party in the early 1980s."]}, {"page": "Jonathan Guinness, 3rd Baron Moyne", "response": ["Jonathan Bryan Guinness, 3rd Baron Moyne (born 16 March 1930), is a British peer and businessman. A member of the Guinness family, he is the elder of the two sons of Bryan Guinness, 2nd Baron Moyne, and his first wife Diana Mitford (later Lady Mosley), and until his retirement was a merchant banker for Messrs Leopold Joseph."]}]}}