{"wiki_id": "http://www.wikidata.org/entity/Q462991", "itemLabel": "Eileen Hiscock", "itemDescription": "British athlete (1909-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Eileen_Hiscock", "wikipedia_page": {"main": "Eileen May Hiscock, later Wilson, (25 August 1909 – 3 September 1958) was an English track and field athlete who competed for Great Britain in the 1932 Summer Olympics and in the 1936 Summer Olympics. She was born in Blackheath, London.\nAt the 1930 Women's World Games in Prague she was a member, along with Ethel Scott, Ivy Walker and Daisy Ridgley, of the British 4×100 metre relay team which won the silver medal. In the 1934 World Women's Games, she won the bronze medals in the 100 metres and 200 metres contests.In 1932, she was one of five women entered by the Women's Amateur Athletic Association at the 1932 Los Angeles Summer Olympics as Britain's first female Olympians in athletics events, together with Ethel Johnson, Gwendoline Porter, Nellie Halstead, and seventeen-year-old Violet Webb. They sailed for five days from Southampton to Quebec and then travelled a further 3000 miles by train before arriving in Los Angeles. In the 4 x 100 metres women's relay she won the bronze medal with her team mates Gwendoline Porter, Violet Webb (replacing the injured Johnson) and Nellie Halstead. In the women's 100 metres she came 5th.\nAt the 1934 Empire Games she won the gold medal in the 100 yards competition as well as in the 220 yards contest. She also was a member of the English relay team which won the gold medal in the 110-220-110 yards relay contest and the silver medal in the 220-110-220-110 yards relay competition (with Hiscock, Nellie Halstead, Ethel Johnson and Ivy Walker).In the 1936 Summer Olympics she won the silver medal with her team mates Violet Olney, Audrey Brown and Barbara Burke in the 4×100 metre relay event. In the 100 metre event she was eliminated in the semi-finals.\nShe married John H Wilson in 1936.", "link_mentions": [{"page": "Eileen", "response": ["*Eileen Hiscock (1909–1958), British athlete"]}, {"page": "Great Britain at the 1936 Summer Olympics", "response": ["*Audrey Brown, Barbara Burke, Eileen Hiscock, Violet Olney — 4 × 100 m Relay"]}, {"page": "Great Britain at the 1932 Summer Olympics", "response": ["|  || , Eileen Hiscock,Gwendoline Porter, Violet Webb "]}, {"page": "Athletics at the 1932 Summer Olympics", "response": ["| Nellie HalsteadEileen HiscockGwendoline PorterViolet Webb"]}, {"page": "Athletics at the 1936 Summer Olympics", "response": ["| Eileen HiscockViolet OlneyAudrey BrownBarbara Burke||47.6"]}, {"page": "Violet Olney", "response": ["Violet Rose Olney (later Parish; 22 May 1911 – 3 January 1999) was an English athlete from Southwark, London,England & Wales, FreeBMD Birth Index: Violet R Olney; Apr-May-Jun quarter 1911; District: Southwark; Volume: 1d; Page: 54 who mainly competed in the 100 metres. She competed for Great Britain at the 1936 Summer Olympics held in Berlin, Germany where she won the silver medal in the women's 4 x 100 metres with her teammates Eileen Hiscock, Audrey Brown and Barbara Burke."]}, {"page": "Audrey Brown", "response": ["Whilst at University, Brown competed for the Birchfield Harriers. She competed at the 1933 World Student Games. She competed for Great Britain at the 1936 Summer Olympics held in Berlin, Germany where she won the silver medal in the 4 x 100 metres with her teammates Eileen Hiscock, Violet Olney and Barbara Burke."]}, {"page": "Gwendoline Porter", "response": ["In 1932 she was one of five women entered by the Women's Amateur Athletic Association at the 1932 Los Angeles Summer Olympics as Britain's first female Olympians in athletics events, together with Ethel Johnson, Eileen Hiscock, Nellie Halstead, and seventeen-year-old Violet Webb. They sailed for five days from Southampton to Quebec and then travelled a further 3000 miles by train before arriving in Los Angeles. In the 4 x 100 metres women's relay she won the bronze medal with her teammates Eileen Hiscock, Violet Webb (replacing the injured Johnson) and Nellie Halstead. In the women's 100 metres she came 4th in her heat."]}, {"page": "Nellie Halstead", "response": ["She competed for Great Britain as one of Britain's first women track Olympians in the 1932 Summer Olympics held in Los Angeles, where in the 4×100 metres she won the bronze medal with her team mates Eileen Hiscock, Gwendoline Porter and Violet Webb (replacing the injured Ethel Johnson).", "At the 1934 Empire Games she was a member of the English relay team which won the gold medal in the 110-220-110 yards relay event and the silver medal in the 220-110-220-110 yards relay competition (with Eileen Hiscock, Halstead, Ethel Johnson and Ivy Walker).Commonwealth Games results . CWG. Retrieved 24 October 2015. In the 220 yards she won the bronze medal."]}, {"page": "Violet Webb", "response": ["In 1932, she travelled to Los Angeles as one of five women entered by the Women's Amateur Athletic Association at the 1932 Los Angeles Summer Olympics as Britain's first female Olympians in athletics events. She finished fifth in the 80 metre hurdles event.  She also featured in the 4x100 metre relay, where she replaced the injured Ethel Johnson, and won the bronze medal with her teammates, Eileen Hiscock, Gwendoline Porter and Nellie Halstead."]}, {"page": "Hiscock", "response": ["* Eileen Hiscock (1909–1958), British athlete"]}, {"page": "Athletics at the 1934 British Empire Games", "response": ["|Nellie HalsteadEileen HiscockElsie Maguire||49.4", "|Eileen HiscockIvy WalkerNellie HalsteadEthel Johnson||+1.5 yd"]}, {"page": "Ethel Johnson", "response": ["In 1932, she was one of a team of five women entered by the Women's Amateur Athletic Association at the 1932 Los Angeles Summer Olympics as Britain's first female Olympians in athletics events, together with Gwendoline Porter, Eileen Hiscock, Nellie Halstead, and seventeen-year-old Violet Webb. They sailed for five days from Southampton to Quebec and then travelled a further 3000 miles by train before arriving in Los Angeles. Ethel was eliminated in the first round of the Olympic 100 metre contest. and had to be replaced due to injury by Violet Webb in the women's 4x100 metres relay.", "At the 1934 Empire Games she was a member of the English relay team which won the silver medal in the 220-110-220-110 yards relay competition (with Eileen Hiscock, Nellie Halstead, Johnson and Ivy Walker).Commonwealth Games results . CWG. Retrieved 24 October 2015. In the 100 yards competition she finished fifth and in the 220 yards contest she finished sixth."]}, {"page": "Ivy Walker", "response": ["At the 1930 Women's World Games in Prague she was a member, along with Ethel Scott, Eileen Hiscock and Daisy Ridgley, of the British 4×100 metre relay team which won the silver medal.Eric L. Cowe, Early women's athletics: statistics and history (Bingley: c1999), pp. 112-13. At the 1934 Empire Games she was a member of the English relay team which won the silver medal in the 220-110-220-110 yards relay competition (with Eileen Hiscock, Nellie Halstead, Ethel Johnson and Walker).Commonwealth Games results . CWG. Retrieved 24 October 2015. In the 220 yards competition she was eliminated in the heats."]}, {"page": "List of 1932 Summer Olympics medal winners", "response": ["| Nellie HalsteadEileen HiscockGwendoline PorterViolet Webb"]}, {"page": "Athletics at the 1932 Summer Olympics – Women's 100 metres", "response": ["| 3||align=left| Eileen Hiscock||align=left|  || 12.3 || ", "| 3 ||align=left| Eileen Hiscock ||align=left|  || 12.3 || ", "| 5 ||align=left| Eileen Hiscock ||align=left|  || 12.3 || "]}, {"page": "Athletics at the 1932 Summer Olympics – Women's 4 × 100 metres relay", "response": ["|  ||align=left|Eileen HiscockGwen PorterViolet WebbNellie Halstead || align=left|  || 47.6 || "]}, {"page": "Athletics at the 1936 Summer Olympics – Women's 100 metres", "response": ["| 1 ||align=left|Eileen Hiscock || align=left|  || 12.6 || ", "| 4 ||align=left| Eileen Hiscock ||align=left|  || Unknown ||"]}, {"page": "Athletics at the 1936 Summer Olympics – Women's 4 × 100 metres relay", "response": ["| 2 ||align=left|  || align=left| Eileen Hiscock, Violet Olney, Audrey Brown, Barbara Burke || align=left|47.5|| Q ", "|  ||align=left|  || align=left| Eileen Hiscock, Violet Olney, Audrey Brown, Barbara Burke || align=left| 47.6 || "]}, {"page": "Ethel Scott", "response": ["The British 4x100 relay team, consisting of Ethel Scott, Ivy Walker, Eileen Hiscock and Daisy Ridgley, was more successful. The team completed their qualifying heat on 7 September in 49.7 seconds, and took the silver medal in the final the following day despite a time of 50.5 seconds.Eric L. Cowe, Early women's athletics: statistics and history (Bingley: c1999), pp. 112-13."]}]}}