{"wiki_id": "http://www.wikidata.org/entity/Q462131", "itemLabel": "Joan Fry", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Joan_Fry", "wikipedia_page": {"main": "Joan Craddock Fry (6 May 1906 – 29 September 1985) was a British tennis player. Fry was a finalist at the 1925 Wimbledon Championships where she lost in straight sets to Suzanne Lenglen.She was part of the British team that won the 1930 Wightman Cup against the United States. She lost her singles matches to Helen Wills and Helen Jacobs but together with Ermyntrude Harvey won the doubles match against Sarah Palfrey and Edith Cross.\nIn 1930 she was a finalist at the British Covered Court Championships, played at the Queen's Club in London.\nOn 12 November 1930 she married  Thomas Ashley Lakeman, a lieutenant in the Royal Tank Corps.", "link_mentions": [{"page": "Suzanne Lenglen", "response": ["Lenglen followed up her performance at the French Championships with another triple crown at Wimbledon. She played five singles matches and did not lose a game in the second set of any of them. The five games she dropped in total remain a record for fewest games lost in a singles title run in Wimbledon history. Her opponents included Ryan in her opening match, the defending champion McKane in the semifinals, and Joan Fry in the final. In mixed doubles, she partnered with Jean Borotra to defeat Ryan and de Morpurgo in the final. In doubles, Lenglen and Ryan played their last tournament together and won the title without dropping a set. During the last part of the year, Lenglen led France to a 7–4 victory in a tie against Australia, and defeated Australasian champion Daphne Akhurst in the final of the concurrent Deauville tournament. Later in the year, Lenglen won the doubles and mixed doubles events at the Cromer Covered Courts, the only time she played in England other than Wimbledon and her only indoor wood tournament.", "| style=\"background:#98fb98;\"|Win ||1925|| Wimbledon (6) ||Grass||  Joan Fry || 6–2, 6–0"]}, {"page": "List of Wimbledon mixed doubles champions", "response": ["| 1929 ||  Francis Hunter   Helen Moody ||  Ian Collins   Joan Fry || 6–1, 6–4"]}, {"page": "Henri Cochet", "response": ["Cochet was seeded first at the 1929 Wimbledon Championships. He marched through the earlier rounds, having only one five-set match against Irish champion George Lyttleton-Rogers. In the quarterfinals he beat Hendrik Timmer in straights, then Bill Tilden in the semi-finals also in straights and second seeded compatriot Jean Borotra for the championship in his third straight sets victory in a row. Despite this he lost 63 games throughout the tournament, which was the most among the seeded players (third-seeded semi-finalist Tilden only lost 27). In doubles he reached the quarterfinals with Jacques Brugnon but was beaten by Wilmer Allison and John Van Ryn, who later became champions. In the mixed doubles draw the titleholders Cochet and Eileen Bennett Whittingstall lost to eventual runners-up Joan Fry and Ian Collins in three sets. The singles victory marked the sixth straight time that a French player won Wimbledon and the fifth time that the final was contested between two Frenchmen, counting from the first French victory in 1924. A couple of days later in the Regent's Park the top Wimbledon players participated in an exhibition event to raise funds for children of the British war cripples."]}, {"page": "Helen Wills", "response": ["On advice of her mother Wills did not travel to Europe and therefore did not take part in the Wimbledon Championships or in the first French Championships that were open to players who were neither French citizens nor residents of France. Wills won an invitational tournament in Pasadena in February. In July she traveled to the East Coast to play the tradition grass court warm-up events for the U.S. Nationals. She won the singles titles at the Longwood Invitational in Brookline, against Marion Zinderstein Jessup, and at the Essex Country Club Invitational against Mary Browne. At the Seabright Invitational she lost the final to Elizabeth Ryan who, playing without shoes, dealt better with the heavy, soggy courts which prevented Wills from playing her usual driving game. It would be her only singles loss of the year. At the New York State Championships in Westchester she defeated Mallory in the final in three sets. The third edition of the Wightman Cup was played in August at Forest Hills. Wills won both her singles matches against Joan Fry and McKane but lost the decisive doubles match with Mary Brown against Evelyn Colyer and McKane. At the U.S. Championships which started on August 17, she came back from being a set down in both the quarterfinal, against Fry, and the semifinal, against Eleanor Goss, to reach the singles final. In the final against McKane she again lost the first set but won the next two to win her third consecutive U.S. Championships title at the age of 19. In mid September she also won the California State Championships for the third consecutive time, defeating Lucy McCune in the final without the loss of a game. In late September A. Wallis Myers ranked Wills No. 2 in the world behind Lenglen. Also in September she was elected to the Phi Beta Kappa honor society by the University of California.", "As in 1928 Wills' season started in April when she traveled to France to compete in the French Championships which started on May 20. Edith Cross joined her on the trip. She successfully defended her French singles title by defeating sixth-seeded home favorite Simonne Mathieu in the final. In the doubles event she teamed up with Edith Cross and lost in the quarterfinals to eventual champions Lilí de Álvarez and Kea Bouman. She played in the mixed doubles with Frank Hunter and were beaten in the final by the Anglo-French team of Eileen Bennett and Henri Cochet. Wills then played international matches, as part of a U.S. team, against the Netherlands in May, beating Madzy Rollin Couquerque and Kea Bouman, and against Germany, played at the Rot-Weiss Tennis Club in Berlin in June, where she won against Cilly Aussem and Paula von Reznicek. At the Wimbledon Championships a third final against Lilí de Álvarez was anticipated but instead Wills faced fifth-seeded Helen Jacobs, their first encounter in a Grand Slam final. Wills won her third consecutive Wimbledon singles title in straight sets. With Edith Cross she lost in the third round of the doubles to Ermyntrude Harvey but won the mixed doubles title with Frank Hunter against Ian Collins and Joan Fry. In the seventh edition of the Wightman Cup, played on August 8 and 9 at the West Side Tennis Club, Wills won both her singles matches, including a close two-sets win against Betty Nuthall, to help the U.S. team reclaim the cup but lost her doubles match with Cross against Phoebe Holcroft Watson and Peggy Michell. Later that month she won her sixth U.S. National Championships singles title after a victory in the final against second-seeded foreign player Phoebe Holcroft Watson. She played no further tournaments that year and, despite only competing in three tournaments, was ranked No. 1 in the world by A. Wallis Myers for the third successive time, this time ahead of Holcroft Watson and Jacobs.", "| style=\"background:#98fb98;\"|Win || 1929 || Wimbledon ||Grass||  Frank Hunter ||  Joan Fry Ian Collins || 6–1, 6–4 ||"]}, {"page": "List of US Open women's doubles champions", "response": ["| 1927 || Kitty McKane Godfree  Ermyntrude Harvey || Betty Nuthall  Joan Fry || 6–1, 4–6, 6–4"]}, {"page": "Kathleen McKane Godfree", "response": ["| style=\"background:#98fb98;\"|Win || 1927 || U.S. National Championships || Grass ||  Ermyntrude Harvey ||  Joan Fry Betty Nuthall || 6–1, 4–6, 6–4"]}, {"page": "Daphne Akhurst", "response": ["In 1925 she was part of the first Australian women's team to tour Europe and reached the quarterfinal of the singles event at Wimbledon which she lost to Joan Fry. During her second and last European tour in 1928, she reached the singles quarterfinal at the French Championships, in which Cristobel Hardie defeated her, and the semifinal at Wimbledon, which she lost in straight sets to Lili de Alvarez."]}, {"page": "Francis Hunter", "response": ["| style=\"background:#98fb98;\"|Win || 1929 || [Wimbledon || Grass ||  Helen Wills ||  Joan Fry Ian Collins || 6–1, 6–4 ||"]}, {"page": "Betty Nuthall", "response": ["| style=\"background:#ffa07a;\"|Loss || 1927 || U.S. National Championships || Grass || Joan Fry ||  Kitty McKane   Ermyntrude Harvey || 1–6, 6–4, 4–6"]}, {"page": "1925 Wimbledon Championships", "response": [" Suzanne Lenglen defeated  Joan Fry, 6–2, 6–0 "]}, {"page": "1929 Wimbledon Championships", "response": [" Frank Hunter /  Helen Wills defeated  Ian Collins /  Joan Fry, 6–1, 6–4 "]}, {"page": "1926 French Championships – Women's Singles", "response": ["# Joan Fry Lakeman (Semifinals)"]}, {"page": "1927 U.S. National Championships (tennis)", "response": [" Kitty McKane Godfree /  Ermyntrude Harvey defeated  Betty Nuthall /  Joan Fry 6–1, 4–6, 6–4"]}, {"page": "Indian Open (tennis)", "response": ["| 1937|| Leela Row || Joan Fry Lakeman  || 2–6, 9–7, 6–2"]}, {"page": "Shortest tennis match records", "response": ["*Helen Wills defeated Joan Fry at the 1927 Wightman Cup 6–2, 6–0 in 24 minutes.", "*In the 1925 Wimbledon final Lenglen defeated Joan Fry in 25 minutes, 6–2, 6–0."]}, {"page": "List of British singles finalists at Grand Slam tennis tournaments", "response": ["|Joan Fry || 1925 || || ||"]}, {"page": "British Covered Court Championships", "response": ["|1930 ||  Joan Ridley ||  Joan Fry ||6–2, 6–2 || Wood"]}, {"page": "Violet Tillard", "response": ["In 1919 Tillard travelled to war-torn Germany to help people recover from the effects of the war. She went with a Quaker mission organised by Joan Fry and in December of that year Tillard formally applied to become a member of the Religious Society of Friends. Whilst in defeated Germany she was confronted with immense misery and helped some students in Berlin survive the hardship. She provided relief in Germany as a nurse until October 1921 where she was transferred to famine-ravaged Buzuluk in Russia to help organise the relief work. There she found famine on a grand scale with an estimated five million dead at the conclusion of the food shortage. Confronted with mass impoverishment she wrote:"]}, {"page": "British Hard Court Championships", "response": ["| 1925 ||  Elizabeth Ryan ||  Joan Fry || 6–2, 6–2", "| 1926 ||  Joan Fry ||  Phoebe Holcroft Watson || 6–1, 7–9, 6–1", "| 1930 ||  Joan Fry ||  Madge List || 6–1, 2–6, 6–2"]}, {"page": "1925 Wimbledon Championships – Women's Singles", "response": ["Suzanne Lenglen defeated Joan Fry 6–2, 6–0 in the final to win the Ladies' Singles tennis title at the 1925 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "Surrey Championships", "response": ["| 1926 ||  Joan Fry ||  Phoebe Holcroft Watson || 3–6, 6–1, 6–2"]}, {"page": "Ermyntrude Harvey", "response": ["| Betty Nuthall Joan Fry"]}, {"page": "Ian Collins (tennis)", "response": ["| style=\"background:#ffa07a;\"|Loss ||1929||Wimbledon|| Grass ||  Joan Fry ||  Helen Wills Frank Hunter || 1–6, 4–6"]}, {"page": "1930 in tennis", "response": ["|rowspan=2|March|| rowspan=\"2\"|London Hard Courts ChampionshipsLondon, United Kingdom||  Yoshiro Ohta4–6, 6–2, 6–2, 3–6, 7–5||  Pat Spence ||  Phyllis Mudford6–3, 7–5||  Joan Fry || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=\"2\"|-26 August||rowspan=\"2\"|North of England ChampionshipsScarborough, United Kingdom||  Eskell Andrews6–0, 9–7||  Colin Gregory ||  Mary Heeley6–4, 6–3 ||  Joan Fry || style=\"background:#ededed;\" colspan=\"2\"|", "|rowspan=2|October 22||rowspan=2|British Covered Court ChampionshipsLondon, United Kingdom||  Jean Borotra6–1, 0–6, 2–6, 6–2, 6–4||  Bunny Austin ||  Joan Ridley6–2, 6–2||  Joan Fry || style=\"background:#ededed;\" colspan=\"2\"|"]}, {"page": "Tennis performance timeline comparison (women) (1884–1977)", "response": ["|align=\"left\"|  Joan Fry Lakeman", "|align=\"left\"|  Joan Fry Lakeman"]}, {"page": "1929 in tennis", "response": ["|rowspan=2|February -26||rowspan=2 |Hotel Bristol ChampionshipsBeaulieu-sur-Mer, France||  Umberto de Morpurgo8-10, 6–2, 6–3, 7–5||  Giorgio de Stefani || Betty Nuthall6–2, 6–1 ||  Joan Fry||style=\"background:#ededed;\" colspan=\"2\"|", "||April -17||Magdalen Park Tournament London, United Kingdom||  Yoshiro Ohta5–7, 6–3, 7–5||  John Olliff ||  Joan Fry6–1, 6–1||  Phyllis Covell || style=\"background:#ededed;\" colspan=\"2\"|", "|September -28||North of England Championships Scarborough, United Kingdom||  Charles Kingsley7-9, 6–1, 6–1, 6–4||  Keats Lester ||  Joan Fry || Dorothy Anderson ||style=\"background:#ededed;\" colspan=\"2\"|"]}, {"page": "Joan Ridley", "response": ["In 1930 she won the singles title at the British Covered Court Championships, played at the Queen's Club in London, after defeating Joan Fry in the final in straight sets. In 1929, she was runner-up at the same event to Peggy Saunders Michell. With Stanley Doust, she won the mixed doubles covered court title in 1926."]}, {"page": "July 1925", "response": ["*Suzanne Lenglen of France defeated Joan Fry of the United Kingdom in the Women's Singles Final at Wimbledon."]}, {"page": "Helen Wills career statistics", "response": ["| style=\"background:#98fb98;\"|Win ||1929||Wimbledon||Grass|| Frank Hunter|| Ian Collins Joan Fry||6–1, 6–4", "| Joan Fry", "| Joan Fry", "| Joan Fry"]}, {"page": "Suzanne Lenglen career statistics", "response": ["| style=\"background:#98fb98;\"|Win ||1925 || Wimbledon (6) ||Grass||  Joan Fry Lakeman || 6–2, 6–0", "| Joan Fry"]}, {"page": "Joan Fry Lakeman", "response": ["#REDIRECT Joan Fry"]}]}}