{"wiki_id": "http://www.wikidata.org/entity/Q463312", "itemLabel": "Kate Maberly", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Maberly", "wikipedia_page": {"main": "Kate Elizabeth Cameron Maberly (; born 14 March 1982) is an English actress, director, writer, producer, and musician. She has appeared in film, television, radio and theatre.\n\n", "link_mentions": [{"page": "Four Past Midnight", "response": ["The Langoliers was adapted for a two-part TV movie in 1994. The TV movie stars Kate Maberly, Kimber Riddle, Patricia Wettig, Mark Lindsay Chapman, Frankie Faison, Baxter Harris, Dean Stockwell, David Morse, Christopher Collet, and Bronson Pinchot."]}, {"page": "Battersea", "response": ["*Kate Maberly – actress"]}, {"page": "1982 in music", "response": ["*March 14 – Kate Maberly, English actress, director, writer, producer and musician"]}, {"page": "2000 in film", "response": ["| The Last of the Blonde Bombshells || HBO Films || Gillies MacKinnon (director); Alan Plater (screenplay); Judi Dench, Ian Holm, Olympia Dukakis, Leslie Caron, Cleo Laine, Joan Sims, Billie Whitelaw, June Whitfield, Felicity Dean, Valentine Pelka, John Warnaby, James Cosmo, Romola Garai, Kate Maberly, Clemency Burton-Hill, Peter Youngblood Hills, Kathryn Pogson, Carolyn Bannister, Millie Findlay, Nicholas Palliser, Dom Chapman || Comedy, Music || Live action "]}, {"page": "1995 in film", "response": ["| Stephen King's The Langoliers || ABC / Laurel Entertainment || Tom Holland (director/screenplay); Patricia Wettig, Dean Stockwell, David Morse, Mark Lindsay Chapman, Frankie Faison, Baxter Harris, Kimber Riddle, Christopher Collet, Kate Maberly, Bronson Pinchot, John Griesemer, Stephen King, Tom Holland || Horror, Mystery, Sci-Fi || Live action"]}, {"page": "1982 in American television", "response": ["|Kate Maberly"]}, {"page": "1993 in film", "response": ["| The Secret Garden || Warner Bros. Pictures || Agnieszka Holland (director); Caroline Thompson (screenplay); Kate Maberly, Heydon Prowse, Andrew Knott, Maggie Smith, John Lynch, Irene Jacob, Colin Bruce, Laura Crossley, Walter Sparrow || Drama, Family || Live action"]}, {"page": "The Secret Garden", "response": ["American Zoetrope's 1993 production was directed by Agnieszka Holland with a screenplay by Caroline Thompson and starred Kate Maberly as Mary, Heydon Prowse as Colin, Andrew Knott as Dickon, John Lynch as Lord Craven and Dame Maggie Smith as Mrs Medlock. The executive producer was Francis Ford Coppola."]}, {"page": "Glumdalclitch", "response": ["*In television and film adaptations, the character has been played by Sherry Alberoni, Ági Szirtes, and Kate Maberly, and voiced by Janet Waldo.Internet Movie Database The character was reimagined in the 2010 film adaptation (in a non-speaking role) as a child and treats Gulliver as a baby doll, presumably to keep with the comedy themes."]}, {"page": "Finding Neverland (film)", "response": ["Within the film are scenes of a production of the play, featuring Kelly Macdonald as \"Peter Pan\", Angus Barnett as \"Nana\", Toby Jones as \"Smee\", Kate Maberly as \"Wendy Darling\", Matt Green as \"John Darling\", Catrin Rhys as \"Michael Darling\", Tim Potter as \"Captain Hook\"/\"George Darling\" and Jane Booker as \"Mary Darling\". Mackenzie Crook plays Mr. Jaspers, the theatre usher. Paul Whitehouse plays the stage manager. Eileen Essell, 82 years old at the time, makes one of her first feature film appearances, as Mrs. Snow, an elderly friend and fan of Barrie's. Like Highmore, she also followed Depp to a role in Charlie and the Chocolate Factory. Jimmy Gardner plays her husband."]}, {"page": "The Secret Garden (1993 film)", "response": ["The Secret Garden is a 1993 fantasy drama film directed by Agnieszka Holland, executive-produced by Francis Ford Coppola and distributed by Warner Bros. under their Family Entertainment imprint. The movie stars Kate Maberly, Heydon Prowse, Andrew Knott, John Lynch, and Maggie Smith, was written by Caroline Thompson and based on the 1911 novel of the same name by Frances Hodgson Burnett. The novel was previously adapted into two films: a 1949 drama film and a 1919 silent film, which starred Lila Lee and Spottiswoode Aitken."]}, {"page": "List of female film and television directors", "response": ["* Kate Maberly (UK)"]}, {"page": "Polly Maberly", "response": ["Polly Maberly is an English actress, known for portraying the role of Kitty Bennet in the BBC's 1995 adaptation of Pride and Prejudice. She is the older sister of actress Kate Maberly."]}, {"page": "Gulliver's Travels (miniseries)", "response": ["Gulliver's Travels is an American TV miniseries based on Jonathan Swift's 1726 satirical novel of the same name, produced by Jim Henson Productions and Hallmark Entertainment. This miniseries is notable for being one of the very few adaptations of Swift's novel to feature all four voyages. The miniseries aired in the United Kingdom on Channel 4, and in the United States on NBC in February 1996. The miniseries stars Ted Danson, Mary Steenburgen, Peter O'Toole, John Gielgud, Omar Sharif, Isabelle Huppert, Geraldine Chaplin, Shashi Kapoor, Warwick Davis, Kristin Scott Thomas, Alfre Woodard, Kate Maberly, Tom Sturridge, Richard Wilson and Nicholas Lyndhurst.", "At the mental institution, Gulliver continues to spin his tale. His Lilliputian raft crashes in Brobdingnag, a land populated by Giants. He is found by Farmer Grultrud (Ned Beatty) who exhibits him as a crop guardian. Gulliver is sold to a lady of the royal court, along with the farmer's daughter Glumdalclitch (Kate Maberly) as his caretaker, and presented to the Queen of Brobdingnag (Alfre Woodard). For being the smallest creature, Gulliver displaces court dwarf Grildrig (Warwick Davis), who comes to despise him and later attempts to kill him. Gulliver is examined by doctors who ridicule him for his size. To ingratiate himself, Gulliver discusses many aspects of English culture and politics with the Queen, which she ultimately finds repugnant in comparison to the fair-sharing system of Brobdingnag.", "* Kate Maberly as Glumdalclitch"]}, {"page": "London Film Critics' Circle", "response": [":Kate Maberly – The Secret Garden"]}, {"page": "Friendship's Field", "response": ["*Kate Maberly as Ira"]}, {"page": "Popcorn (2007 film)", "response": ["* Kate Maberly as Annie"]}, {"page": "Like Minds", "response": ["* Kate Maberly as Susan Mueller"]}, {"page": "Peter Pan in Scarlet", "response": ["A radio adaptation of the book was broadcast on BBC Radio 4 shortly after its release, on 14 October 2006.  It starred Robert Glenister as the Narrator, Daniel Mays as Peter Pan, Kate Maberly as Wendy, and Roger Allam as Ravello.", "*Wendy - Kate Maberly"]}, {"page": "Kate (given name)", "response": ["* Kate Maberly (born 1982), English singer-songwriter and actress", "* Kate Maberly (born 1982), English actress"]}, {"page": "List of American films of 2004", "response": ["| Finding Neverland || Miramax Films || Marc Forster (director); David Magee (screenplay); Johnny Depp, Kate Winslet, Julie Christie, Radha Mitchell, Dustin Hoffman, Freddie Highmore, Nick Roud, Joe Prospero, Luke Spill, Ian Hart, Oliver Fox, Mackenzie Crook, Kelly Macdonald, Angus Barnett, Toby Jones, Kate Maberly, Matt Green, Catrin Rhys, Tim Potter, Jane Booker, Eileen Essell, Jimmy Gardner, Paul Whitehouse, Murray McArthur || Biography, Drama ||"]}, {"page": "Mothertime", "response": ["*Kate Maberly as Vanessa", "* Kate Maberly's Profile"]}, {"page": "List of fantasy films of the 1990s", "response": ["|The Secret Garden||Agnieszka Holland||Kate Maberly, Maggie Smith ||United Kingdom||"]}, {"page": "List of British films of 1993", "response": ["|The Secret Garden||Agnieszka Holland||Kate Maberly, Heydon Prowse|| Family ||"]}, {"page": "List of British former child actors", "response": ["*Kate Maberly (born 1982)"]}, {"page": "List of British actors", "response": ["* Kate Maberly (born 1982)"]}, {"page": "Boogeyman 3", "response": ["One year later, Amy (Jayne Wisener) and Jennifer (Kate Maberly) are staying in Sarah’s room. Amy interrupts Jennifer's studies to tell her the story of the “crazy girl” (Sarah) who thought the Boogeyman was real that lived in the room a year ago. It is revealed the college changed the dorm name to keep people from being afraid to move in. Jennifer leaves to go to the library for some peace, noticing that Amy actually seems scared to be alone and taunting her as she leaves. Left alone, Amy is soon attacked and dragged by the Boogeyman beneath her bed to an unknown fate.", "* Kate Maberly as Jennifer"]}, {"page": "Victoria & Albert (TV serial)", "response": ["* Kate Maberly as Princess Alice"]}, {"page": "The Langoliers (miniseries)", "response": ["* Kate Maberly as Dinah Catherine Bellman, a blind girl on her way to Boston to have a surgery to help restore her eyesight. She has strange psychic powers and is able to see and communicate with Toomy telepathically. She is strong-willed and seems to know a lot more of what's going on than anyone else."]}, {"page": "List of science fiction television films", "response": ["|1995||The Langoliers||Tom Holland||Patricia Wettig, Dean Stockwell, David Morse, Kate Maberly||United States||Miniseries"]}, {"page": "The Forest of Hands and Teeth", "response": ["Seven Star Pictures optioned the film rights to The Forest of Hands and Teeth in 2009, intending to fast-track the project. The film is now with Hetherwood Productions and was in production as of May 2016. Maisie Williams is set to star as of September, 2015. Kate Maberly will write and direct the feature with Doug Liman and Fred Roos is set to produce."]}, {"page": "The Booth at the End", "response": ["* Jenny (Kate Maberly) wants to be prettier, and is told to steal $101,043 from a bank or series of banks. She prepares to steal from a bank by buying a gun and scoping out possible banks. During her preparations, she meets Richard, who lives in a car and makes his living by stealing from banks. Jenny brings Richard to meet the Man, and Richard tells the Man that he wishes his father, a cop, would leave him alone. For his task, Richard is told to help Jenny rob banks. She and Richard then attempt to rob a bank, but a shootout occurs and Jenny is shot in the arm. Richard then comes to the Man without Jenny to ask that she accept herself the way she is. Richard is given a new task to call his father, the detective, and tell him he loved him. Rather than continue the task of robbing banks to make Jenny prettier, they decide to leave town."]}, {"page": "Mysteries of Egypt", "response": ["* Kate Maberly - Granddaughter"]}, {"page": "Dunottar School", "response": ["*Kate Maberly, actress and musician"]}, {"page": "Rites of Passage (2012 film)", "response": ["Rites of Passage is a 2012 American thriller film written and directed by W. Peter Iliff. The film stars Wes Bentley, Kate Maberly, Ryan Donowho, Christian Slater and Stephen Dorff.", "*Kate Maberly as Dani"]}, {"page": "15th Youth in Film Awards", "response": ["*Kate Maberly - The Secret Garden (Warner Bros)"]}, {"page": "Young Artist Award for Best Leading Young Actress in a Feature Film", "response": ["|Kate Maberly || The Secret Garden ||Warner Bros."]}, {"page": "London Film Critics Circle Awards 1993", "response": ["*Kate Maberly - The Secret Garden"]}, {"page": "Maberly (surname)", "response": ["*Kate Maberly (born 1984), English actress and singer songwriter"]}, {"page": "Standing Up", "response": ["*Kate Maberly as Margo"]}, {"page": "The Ghastly Love of Johnny X", "response": ["The Ghastly Love of Johnny X is a 2012 American musical science fiction comedy film written, produced, and directed by Paul Bunnell. It stars Will Keenan, Creed Bratton, and De Anna Joy Brooks, Reggie Bannister, Les Williams, Jed Rowen and features, in supporting roles, Kate Maberly, Paul Williams and Kevin McCarthy  It was the last feature film shot in Kodak Plus-X.", "* Kate Maberly as Dandi Conners"]}]}}