{"wiki_id": "http://www.wikidata.org/entity/Q4647958", "itemLabel": "A. J. Pollard", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/A._J._Pollard", "wikipedia_page": {"main": "Anthony James Pollard (born 1941) is a British medieval historian, specialising in North-Eastern England during the Wars of the Roses. He is considered a leading authority on the field. He is Emeritus Professor of the University of Teesside. In addition to works on the Wars of the Roses, he has also written a general history of fifteenth-century England (2000) and books on Robin Hood (2004) and Warwick the Kingmaker (2007), Henry V (2014) and Edward IV (2016).  He has in addition edited collections of essays on fifteenth-century history and the history of the north-east of England as a region.", "link_mentions": [{"page": "Richard Neville, 16th Earl of Warwick", "response": ["More recent historians, such as Michael Hicks and A. J. Pollard, have tried to see Warwick in light of the standards of his own age, rather than holding him up to contemporary constitutional ideals. The insults Warwick suffered at the hands of King Edward—including Edward's secret marriage, and the refusal of the French diplomatic channel—were significant.Keen (2003), p. 374. His claim to prominence in national affairs was not a product of illusions of grandeur; it was confirmed by the high standing he enjoyed among the princes on the continent.Pollard (2007), p. 198. Furthermore, Warwick's cause was not considered unjust by his contemporaries, which can be seen by the earl's popularity exceeding that of the king at the time of his first rebellion in 1469.Ross (1997), pp. 124–5. On the other hand, while Warwick could not easily suffer his treatment by the king, it was equally impossible for Edward to accept the earl's presence on the political scene. As long as Warwick remained as powerful and influential as he was, Edward could not fully assert his royal authority, and eventual confrontation became inevitable.Carpenter (1997), pp. 180–1."]}, {"page": "Princes in the Tower", "response": ["Holinshed's Chronicles, written in the second half of the 16th century, claims that the princes were murdered by Richard III. The chronicles were one of the main sources used by William Shakespeare for his play Richard III, which also portrays Richard as the murderer, in the sense that he commissions Tyrrell to have the boys killed. A. J. Pollard believes that the chronicle's account reflected the contemporary \"standard and accepted account\", but that by the time it was written \"propaganda had been transformed into historical fact\".", "In line with this contemporary opinion many current historians, including David Starkey, Michael Hicks,Richard III by Michael Hicks (2003)  Helen CastorHelen Castor, She-Wolves: the Women who Ruled England before Elizabeth (Faber, 2010), , p. 402 and A. J. PollardPollard p 135 regard Richard himself as the most likely culprit. There was no formal accusation against Richard III on the matter; the Bill of Attainder brought by Henry VII made no definitive mention of the Princes in the Tower, but it did accuse Richard of \"the unnatural, mischievous and great perjuries, treasons, homicides and murders, in shedding of infant's blood, with many other wrongs, odious offences and abominations against God and man\".James Orchard Halliwell-Phillipps, Letters of the Kings of England, Vol. 1 (1846), p. 161.Rotuli Parliamentorum, J. Strachey (ed.), VI, (1777), p. 276 The \"shedding of infant's blood\" may be an accusation of the Princes' murder. Hicks speculated that it was a reference to speeches made in Parliament condemning the murder of the princes, which suggested that Richard's guilt had become common knowledge, or at least common wisdom.", "*A. J. Pollard – Richard III and the Princes in the Tower (1991)"]}, {"page": "John Neville, 1st Marquess of Montagu", "response": ["In the meantime though, John received the first royal patronage of the reign, being granted the royal gold and silver mines in Devon and Cornwall worth £110 annually, for life. This was followed by duty payments from York and Kingston upon Hull and manors belonging to the dead Lancastrian Viscount Beaumont. In June 1461 he received the wardship of Edward Tiptoft, the heir of John Tiptoft, during his minority, and also the lands of Lord Clifford (who had died at Ferrybridge in a sharp encounter the night before Towton). Professor A. J. Pollard has noted, ironically, that Neville \"had to earn his rewards.\" In 1462 he was appointed Steward of the Household of the Palatinate of Durham, for which he received around £40 a year. This was twice the salary his legally-trained and \"non-noble\" successors would receive from the Bishop in later years, and has been described as a \"unique post.\""]}, {"page": "Henry Clifford, 10th Baron Clifford", "response": ["Henry Tudor took the throne as HenryVII and from that point Clifford's position swiftly, and radically, improved. He received a number of local offices and sat on commissions in Westmorland and Yorkshire, although he was not to be appointed justice of the peace in the West Riding until 1497. Following Bosworth, the new King's biggest priority was securing the north, where it was suspected that the Earls of Northumberland and of Westmorland were planning an insurrection. On 18 August Clifford was commissioned to raise a force to crush dissent in the region. He sent the earls to London under arrest and received into the King's grace those who wished to make peace with the new regime (\"for all\", notes A. J. Pollard, \"but a number of named men\"). On 24 October 1486, Clifford wrote to the city of York (at the time, the capital of the north) warning them not sell arms or armour to non-residents."]}, {"page": "Thomas Percy, 1st Baron Egremont", "response": ["It is not certain exactly when the bad blood between the two families begun; A. J. Pollard has pointed out that they were cooperating together over parliamentary elections in 1449, and as late as 1453; the former husting was attended by Sir Thomas Percy shortly before his elevation to the peerage."]}, {"page": "Pollard (surname)", "response": ["* A. J. Pollard (born 1941), English medieval historian"]}, {"page": "Anthony James Pollard", "response": ["#REDIRECT A. J. Pollard"]}, {"page": "A.J. Pollard", "response": ["#REDIRECT A. J. Pollard"]}, {"page": "William Bonville, 1st Baron Bonville", "response": ["The Earl of Devon's continuing alliance with York brought Courtenay further problems in 1452. By then, York felt excluded from the government as the King had a new favourite, Edmund, Duke of Somerset. In February that year York rebelled and marched on London with a large force. He faced the King's army at Blackheath, south-east of London. Courtenay stood alongside him. Somerset and much of the rest of the nobility faced York and Courtenay down: they surrendered without a fight. Bonville had raised a body of men to join the King's army, and subsequently profited from Courtenay's disfavour with the King. The historian A. J. Pollard suggests that Bonville was given \"a free hand\" in the region as a result of York's and Devon's eclipse and according to Cherry, this allowed Bonville to become the predominant figure in county politics. He was commissioned to oversee the arrest and prosecution of the Earl of Devon's men after Blackheath, and the following year King Henry demonstrated the esteem Bonville stood in when, during Henry's royal progress through the south-west, he stayed at Bonville's caput of Shute. Bonville received further offices and responsibilities. He was confirmed as steward of the Duchy of Cornwall, reappointed seneschal of Gascony and also made lieutenant of Aquitaine. Bonville has been described by historians connected to The Gascon Rolls Project as being \"an excellent choice for lieutenant\" and received the constableship of Exeter Castle. He also received grants of lands and estates in South Teign, the castle, borough and manor of Lydford, the conservancy of the River Exe, and forestry rights in Dartmoor, making him, wrote the historian Bertram Wolffe, \"exalted in the west country\". Bonville never took up his seneschalcy as what remained of England's territorial possessions in France were lost at the Battle of Castillon in July 1453. King Henry—now in Exeter—appointed Bonville to a large commission of oyer and terminer to investigate sympathy for York's rebellion in the area, and the King made him a gift of £50."]}, {"page": "John and William Merfold", "response": ["For artisans or labourers who had previously known greater prosperity, even small fines, chevage, and customary emblems of authority became intolerable. In East Anglia, surviving records such as articles of impeachment from 1449 to 1450 against William, Duke of Suffolk, suggest that he used his access to the courts and regime to oppress his tenants and advance himself personally. These injustices and what the medieval historian A. J. Pollard has described as the \"systematic abuse of power in the king's name\" were worst in Kent, but also occurred in Sussex and elsewhere in southern England, and led to a series of insurrections. In January 1450 an uprising was led by a labourer named Thomas Cheyne, who called himself \"the hermit Bluebeard\", occurred in Kent; the authorities acted swiftly and Cheyne was executed as a traitor. In May 1450, a major rebellion by the men of Kent led by Jack Cade marched towards London, forcing the king to retreat to Kenilworth Castle in Warwickshire.  The rebels were able to take the capital before their defeat at the hands of the militia of London, which forced them to disperse and return home. "]}, {"page": "Richard Britnell", "response": ["* (ed., with A. J. Pollard) The McFarlane Legacy: Studies in Late-Medieval Politics and Society. Stroud: Sutton (1995) ."]}]}}