{"wiki_id": "http://www.wikidata.org/entity/Q4652102", "itemLabel": "A-Jay Leitch-Smith", "itemDescription": "English association football player (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/A-Jay_Leitch-Smith", "wikipedia_page": {"main": "Jay Leitch-Smith (born 6 March 1990), known as A-Jay Leitch-Smith, is an English professional footballer who plays as a forward for National League side Altrincham.\nA graduate of the Academy at Crewe Alexandra, he played on loan for Halifax Town, Newcastle Town, ÍBV (Iceland), and Curzon Ashton. He spent six years with Crewe, winning the League Two play-offs in 2012 and the League Trophy in 2013. He signed with Yeovil Town in June 2014, but moved on to Port Vale in July 2015 after a poor season with Yeovil. He finished as Port Vale's top-scorer, before moving on to Shrewsbury Town in June 2016. He joined Scottish Premiership club Dundee on loan for the 2017–18 season. He signed with Morecambe in August 2018 and remained with the club for three seasons. He joined National League side Altrincham in August 2021.", "link_mentions": [{"page": "Rob Page", "response": ["Page needed to avoid a poor start to the 2015–16 season as chairman Norman Smurthwaite warned he was prepared to make \"ruthless decisions\" if the club were struggling by September. Page made nine new signings during pre-season – Sam Kelly, Sam Foley, Anthony Grant, Ben Purkiss, Remie Streete, A-Jay Leitch-Smith, Jak Alnwick, Uche Ikpeazu, and Ryan Inniss – citing the need to sign players who \"desire success\". He was nominated for the League One Manager of the Month award in November following a sequence of three wins out of four which moved Vale to the fringes of the promotion race. However a defeat to League Two side Exeter City in the Second Round of the FA Cup brought speculation over Page's future as manager. He retained his position however, and was named as Football League manager of the week after his side overcame a 2–0 half-time deficit to beat Peterborough United 3–2 on 12 March. He led the club to a 12th-place finish he was linked with various management vacancies in the summer."]}, {"page": "Byron Moore", "response": ["On 11 August 2015, he scored the winning goal in a 1–0 victory over Championship club Burnley in the first round of the League Cup. He went on to score five goals in 41 appearances throughout the 2015–16 campaign and was named in the Football League team of the week and providing an assist for A-Jay Leitch-Smith in a 1–0 win at Blackpool on 9 January. He then departed on a free transfer after rejecting the club's offer of a new contract."]}, {"page": "Ryan McGivern", "response": ["McGivern signed with League One side Shrewsbury Town in June 2016, along with former Port Vale teammates A-Jay Leitch-Smith and Louis Dodds. He made his debut for the club on the opening day of the season, in a 0−1 home defeat against Milton Keynes. Featuring regularly for the club in the early part of the season saw McGivern recalled to the Northern Ireland squad for the first time in nearly two years, however subsequent call-ups limited his first-team opportunities at Shrewsbury during a period which also saw manager Micky Mellon leave the club. He was recalled to the side by new manager Paul Hurst as Shrewsbury kept back-to-back clean sheets in 0−0 draws against former club Port Vale and Fleetwood Town, but a shoulder injury picked up in the next match, a 1−0 victory away at Millwall in December, kept him out of contention for a minimum of three weeks. He was not allocated a squad number ahead of the following season, having been told he was not in the club's future plans. On 31 August 2017, McGivern had his contract terminated by mutual consent."]}, {"page": "List of Port Vale F.C. seasons", "response": ["|A-Jay Leitch-Smith"]}, {"page": "2009–10 Crewe Alexandra F.C. season", "response": ["* 19 March: Crewe sign Lancaster City striker Jordan Connerton for an undisclosed fee on a three-year contract. Crewe loan Connerton back to Lancaster City for the remainder of the season. A-Jay Leitch-Smith also goes out on loan, to Curzon Ashton until the end of the season."]}, {"page": "Ashley Westwood (footballer, born 1990)", "response": ["Born in Nantwich, Cheshire, Westwood started his career in the academy at Crewe Alexandra. He signed his first professional contract in April 2008, along with Luke Danville, Chris Clements, Josh Thompson, A-Jay Leitch-Smith and Luke Murphy. He joined hometown club Nantwich Town, playing in the Northern Premier League Premier Division, on loan in 2008."]}, {"page": "Chris Clements (footballer)", "response": ["Clements began his career with Crewe Alexandra as a member of the club's renowned academy. His career debut came in a loan spell at Nantwich Town in 2008. Following this loan, Clements was sent out on loan to Leigh Genesis during the 2008–09 season, and also to Stafford Rangers, before signing his first professional contract with Crewe. Having signed his first contract, in 2009 Clements was loaned out once more, this time alongside A-Jay Leitch-Smith, to Icelandic club ÍBV, before returning to England early due to an injury crisis at his parent club."]}, {"page": "Crewe Alexandra F.C. Academy", "response": ["* A-Jay Leitch-Smith"]}, {"page": "Ajay Leitch-Smith", "response": ["#REDIRECT A-Jay Leitch-Smith"]}, {"page": "Billy Bodin", "response": ["In March, he was loaned to Crewe Alexandra for the remainder of the season. Bodin made his debut for the club in a 1–0 win over Hereford United on 24 March 2012. On 21 April 2012, Bodin provided his first assist for David Artell to score the only goal in the game in a 1–0 win over Cheltenham Town and provided another assist for A-Jay Leitch-Smith on 5 May 2012 in a 2–2 draw against Aldershot Town."]}, {"page": "2011–12 Crewe Alexandra F.C. season", "response": ["|A-Jay Leitch-Smith "]}, {"page": "2012 Football League Two play-off Final", "response": ["The referee for the match was Craig Pawson which kicked off around 3p.m. in front of a crowd of 24,029.  In the 15th minute, Nick Powell scored to put Crewe 1–0 ahead: Kelvin Mellor found Powell, who beat a defender by flicking the ball up before striking a volley into the Cheltenham net from around .  Jeff Goulding's long-range shot then struck the Crewe crossbar before rebounding to Ben Burgess who missed the target.  In the 25th minute, Goulding struck Burgess' flick-on into the Crewe net but the goal was disallowed for offside. Byron Moore's 81st minute shot was just wide of the Cheltenham's right-hand goalpost but a minute later his shot into the bottom-corner of the net after exchanged passes with A-Jay Leitch-Smith made it 2–0.  Crewe won the match and gained promotion to League One.", "Crewe Alexandra's opposition in the play-off semi-final was Southend United with the first match of the two-legged tie being played at Gresty Road on 12 May 2012.  After a goalless first half, Adam Dugdale scored a header from a Ashley Westwood free kick early in the second half.  Despite Southend having chances to score, the match ended 1–0 to Crewe.  The second leg of the play-off semi-final took place four days later at Roots Hall in Southend-on-Sea.  A-Jay Leitch-Smith put Crewe into the lead in the first half after striking a shot past Cameron Belford.  Freddy Eastwood then saw his goal disallowed after he was adjudged to have been offside.  Both he and Michael Timlin then struck the Crewe goalposts with shots before Neil Harris scored from a Chris Barker cross to level the game.  Max Clayton made it 2–1 to Crewe before Barker himself scored.  The game ended 2–2 and Crewe progressed to the final 3–2 on aggregate.", "|FW ||10||A-Jay Leitch-Smith || || "]}, {"page": "2012–13 Football League One", "response": ["*Fastest goal of the season: 56 seconds, A-Jay Leitch-Smith for Crewe Alexandra against Scunthorpe United (21 August 2012)"]}, {"page": "2012–13 Stevenage F.C. season", "response": ["The club started September with a 1–1 draw against Shrewsbury Town at Broadhall Way. The away side took the lead after just five minutes; Chris Day spilled Marc Richards' free-kick, and Paul Parry was there to prod the ball into the goal on the rebound. Stevenage equalised twenty minutes later when Darius Charles ran from his own half before striking a curling shot from 25-yards that beat Chris Weale in the Shrewsbury goal. A 2–1 away victory against recently relegated Coventry City followed on 9 September, with the game being televised live on Sky Sports. Coventry took the lead after eleven minutes when loanee David McGoldrick turned on the edge of the area, before striking a curling effort into the top corner of the goal. Stevenage equalised ten minutes later when a counterattack culminated with a Luke Freeman shot being parried into the path of an onrushing Robin Shroot, who swept the ball home from just inside the area. The comeback was completed with twenty minutes remaining, substitute Marcus Haber heading in Darius Charles' flick on from a Freeman corner. Six days later, Stevenage faced newly promoted Crewe Alexandra at Broadhall Way. Crewe started brightly and opened the scoring after just six minutes. A Gregor Robertson free-kick was blocked, but found its way to Max Clayton on the left wing, who rifled the ball across goal where A-Jay Leitch-Smith was on hand to connect from close range. Leitch-Smith doubled Crewe's advantage almost instantly, running on to a neat Chuks Aneke pass before finishing calmly with a low driven shot. Luke Freeman halved Stevenage's deficit midway through the first-half when he unleashed a shot from 25-yards, following good work from Patrick Agyemang and Lucas Akins, which left Crewe goalkeeper Alan Martin rooted to the spot. Former Stevenage loanee, Aneke, was sent-off for Crewe in the second half for a two-footed tackle on Anthony Grant. The home side made their numerical advantage count when substitute Robin Shroot scored with a neat turn and finish with ten minutes remaining. A 3–1 home victory over Walsall followed on 18 September. Robin Shroot had given Stevenage a first-half lead with a tidy finish from outside the area, before Walsall's George Bowerman equalised on the hour mark. The home side restored their lead through Greg Tansey, who scored with a driven shot from 30-yards, his first goal for the club. Lucas Akins sealed the victory late-on, when he steered in Tansey's cross at the back post. A week later, on 22 September, Stevenage drew 1–1 at Doncaster Rovers. Loan signing Oliver Risser headed Stevenage into the lead, before Doncaster's Chris Brown levelled in the second-half. The month ended with a 2–2 against Bury at Broadhall Way. The visitors, under the new management of Kevin Blackwell, opened the scoring through Tom Hopper's looping header. After the interval, Stevenage scored twice within the space of two minutes to turn the game on its head. Marcus Haber headed in Luke Freeman's corner to restore parity, before Greg Tansey scored a curling long-range strike. Bury equalised through second-half substitute Mark Cullen, to ensure a share of the spoils."]}, {"page": "2012–13 Crewe Alexandra F.C. season", "response": ["| A-Jay Leitch-Smith", "| A-Jay Leitch-Smith"]}, {"page": "Mathias Pogba", "response": ["Pogba quickly made an impact when he scored twice on his debut against Hartlepool in a League Cup first round tie on 11 August. A week later, he scored on his league debut, notching a 78th minute consolation in a 2–1 defeat to Notts County, which Pogba scored two weeks later, in a 5–1 loss against Brentford. However, Pogba suffered a knee injury that kept him out of action for the most of September. He made his first team return, coming on as a substitute for A-Jay Leitch-Smith in the 62nd minute, in a 1–0 loss against Milton Keynes Dons on 29 September 2012. By the end of December, Pogba scored four more league goals in 20 appearances (against Doncaster Rovers, Colchester United, Sheffield United and Oldham Athletic), while scoring two more goals in separate cup competitions against Wycombe Wanderers and Doncaster Rovers. After two months without scoring, Pogba ended his goal drought when he scored in a 2–1 loss against Bournemouth on 12 February 2013. Pogba later added four more goals - one each against Portsmouth, and Colchester United and a brace against MK Dons. However, Pogba suffered a torn thigh that sidelined him for the rest of the season, resulting him having an operation. Despite missing out for the Football League Trophy Final and the club's promotion to League One, Pogba made 41 appearance and scoring 16 times (making him the club's top scorer of the 2012–13 season) in all competitions."]}, {"page": "Brendon Daniels", "response": ["Born in Stoke-on-Trent, Daniels started his career with Crewe Alexandra at the age of nine, before signing a scholarship in 2010. Back with his local school, Haywood High, he formed a strike partnership with Crewe teammate Ryan Colclough and helped Haywood to reach the Sentinel Schools' Shield final at Vale Park in 2010, where they were beaten 3–1 by Alleyne's. In May 2011, he signed his first professional contract after being handed a two-year deal by manager Dario Gradi. He made his professional debut on 11 August 2012, replacing A-Jay Leitch-Smith as a 78th-minute substitute in a 5–0 win over Hartlepool United at the Alexandra Stadium in the League Cup. He made a total of ten appearances for the \"Railwaymen\" in the first half of the 2012–13 season, though started only two games in League One. On 21 February 2013, he joined Conference North side Chester on a one-month loan. Two days later he scored just 12 minutes into his debut for Neil Young's \"Blues\", in a 2–0 win over Vauxhall Motors at the Deva Stadium. He played just one further game before returning to Crewe, who released him at the end of his contract in May 2013. Manager Steve Davis had told him he did not feature in his plans due to his lack of experience."]}, {"page": "Brad Inman (soccer)", "response": ["The loanee midfielder was named as an unused substitute for the league victory over Crawley Town and FA Cup defeat to Burton Albion. However, Inman made his professional senior debut on 4 December 2012, playing 88 minutes in the Football League Trophy fixture against Doncaster Rovers. Four days later on 8 December 2012, he scored his first goal for Crewe Alexandra, in a 3–1 win over Preston North End. Seven days later on 15 December, Inman scored his first in a 1–0 victory over Bury, and was also named Man of the Match. His third goal for the club came on 26 December 2012, in a 2–1 loss against Tranmere Rovers. On 3 January 2013, Inman's loan at Crewe was extended until 11 February. Several weeks later, on 31 January 2013, Inman's loan at Crewe was extended again until the end of the season. Inman contributed for the club by helping them reach the final of the Football League Trophy, scoring once against Bradford City and twice in the first leg against Coventry City. However, during a 3–0 win over Hartlepool United on 26 February 2013, Inman sustained ankle injury that kept him out for two weeks. It wasn't until on 29 March 2013 when he returned from injury, coming on as a substitute for A-Jay Leitch-Smith and scoring in a 2–2 draw against Bury. This was followed up by scoring the only goal of the game with a win against Preston North End. The following week, Inman started in the final before coming off in the 69th minute, in a 2–0 win over Southend United. Having become a first team regular for Crewe Alexandra, he went on to make twenty–six appearances and scoring eight times for the side."]}, {"page": "2013 Football League Trophy Final", "response": ["|ST ||10 || A-Jay Leitch-Smith || || "]}, {"page": "Uche Ikpeazu", "response": ["Ikpeazu joined League One club Port Vale on a six-month loan in July 2015, having impressed manager Rob Page playing against the Vale for Crewe the previous season. He started the campaign as the club's main striker, and though he dropped out of the first eleven against Oldham Athletic on 29 September he came off the bench to score an equalising goal. Page was hopeful of extending the loan deal until the end of the season, as Ikpeazu was the club's top-scorer throughout the early stages of the campaign. However he lost his first-team place after being sent off against Burton Albion on 24 October as A-Jay Leitch-Smith entered the team and found a rich vein of form. Despite Ikpeazu still being the club's top-scorer his loan spell was not extended in January. He remained in League One however, as he joined Blackpool on loan until the end of the 2015–16 season. Ikpeazu was then released by Watford upon the expiry of his contract."]}]}}