{"wiki_id": "http://www.wikidata.org/entity/Q465981", "itemLabel": "Karen David", "itemDescription": "Indian-born Canadian-British actress, singer and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Karen_David", "wikipedia_page": {"main": "Karen Shenaz David (born 15 April 1979) is an Indian-Canadian actress, singer, and songwriter best known for portraying Princess Isabella Maria Lucia Elizabetta of Valencia in ABC's fairytale-themed musical-comedy television series, Galavant, as well as the Head of Spanish, Cesca Montoya, in the BBC One school-based drama series Waterloo Road and Layla in the American action film The Scorpion King 2: Rise of a Warrior. She starred as Angela in the ITV television series Cold Feet and played Princess Jasmine (from Aladdin) in the American television series Once Upon a Time.\nShe currently has a recurring role on The CW's Legacies as Emma, a guidance counselor and witch, alongside playing regular character Grace Mukherjee in Fear the Walking Dead.", "link_mentions": [{"page": "Aladdin", "response": ["* The characters of Aladdin, Jasmine, Jafar and the Sultan, along with Agrabah as the setting and the genie (jinn) of the lamp were adapted into the sixth season of TV series Once Upon a Time, with Aladdin portrayed by Deniz Akdeniz, Jasmine portrayed by Karen David, and Jafar portrayed by Oded Fehr. Jafar also appeared in the spin-off Once Upon a Time in Wonderland, portrayed by Naveen Andrews. Both were produced by ABC Television Studios and based on the Disney version of the story."]}, {"page": "1979 in American television", "response": ["|Karen David"]}, {"page": "A. R. Rahman", "response": ["Since 2004 Rahman has performed three successful world tours before audiences in Singapore, Australia, Malaysia, Dubai, the United Kingdom, Canada, the United States and India, and has been collaborating with Karen David on her upcoming studio album. A two-disc CD, Introducing A. R. Rahman  (featuring 25 of his Tamil film-score pieces), was released in May 2006 and his non-film album Connections was released on 12 December 2008. Rahman performed at a White House state dinner arranged by US President Barack Obama during an official visit by Indian Prime Minister Manmohan Singh on 24 November 2009."]}, {"page": "Cold Feet", "response": ["The revived series introduced Ceallach Spellman as Matthew, Adam and Rachel's now teenage son, alongside Karen David as Adam's second wife Angela Zubayr following the death of Rachel, and Art Malik as Angela's business tycoon father Eddie, a love interest for Karen Marsden. Pete and Jenny had remarried whilst David's marriage to Robyn was crumbling. Leanne Best was introduced as Tina Reynolds, Adam's partner following his separation from Angela. After his separation from Robyn, Nikki Kirkbright (Siobhan Finneran) is introduced as David's new partner, and Adam later forms a relationship with Karen.", "After a jet-set life in Singapore, Adam returns to Manchester to visit his old friends and to see son Matthew (now portrayed by Ceallach Spellman), breaking the news of his upcoming nuptials with businesswoman Angela Zubayr (Karen David). This isn't well received amongst the group, especially Matthew who sees Angela as a replacement for his mother Rachel. Struggling to support his family, Pete finds himself in two run down jobs and suffering from depression, which Jenny seems oblivious to. Seeing a fault in their love life, she pursues a fling with client Trevor Green (Nicholas Gleaves), who begins to stalk her. Torn apart after the death of Harry (James Bolam), an old man who he was caring for, Pete considers suicide. David is entangled through a wrongdoing at work and is arrested, something which his wife Robyn finds humiliating and throws him out of their luxury Cheshire home. Karen finds herself on the dating game, and soon falls for Adam's father-in-law Eddie (Art Malik), though later discovers that they live in two very different worlds, with Karen's twin daughters Ellie (Ella Hunt) and Olivia (Daisy Edgar-Jones) still dependent on her. Jenny's ex-partner Grant (Robert Webb) from her time in New York City turns up on her doorstep determined to see their daughter Chloe (Madeleine Edmondson), who still believes that Pete is her father. Struggling to cope with living in Manchester and being step-mother to Matthew, Angela decides to end her marriage with Adam, who fell quickly for his landlord Tina Reynolds (Leanne Best). At Adam's 49th Birthday party, the Marsdens' eldest son Josh (Callum Woodhouse) arrives from Spain with former nanny Ramona (Jacey Salles), and it is later revealed that he is gay.", "| scope=\"row\" | Karen David"]}, {"page": "Shillong", "response": ["* Karen David, a Canadian-British actress, singer, and songwriter born in Shillong. She is best known for portraying \"Princess Isabella Maria Lucia Elizabetta of Valencia\" in ABC's fairytale-themed musical-comedy television series, Galavant, as well as Francesca \"Cesca\" Montoya in the BBC television series Waterloo Road, and Layla in the American action film The Scorpion King 2: Rise of a Warrior."]}, {"page": "History of the Jews in India", "response": ["* Karen David (1979- ), British-Canadian actress"]}, {"page": "Provoked (film)", "response": ["Cinematography for the film was handled by Madhu Ambat. The film's score and soundtrack was composed by A. R. Rahman, and the theme song for the film, Alive, was composed by Rahman and sung by Karen David, who has a small cameo in the film.  Shot in London, the film was released theatrically in April 2007.", "*Karen David as Asha", "The score and the theme song of the film were composed by Academy Award winner Indian composer A. R. Rahman. The theme song, Alive was composed by Rahman, and written and performed by Karen David. The other tracks were done by Karen David. According to her blog, these songs were co-written with Rahman, however Rahman has officially confirmed that he has done only a single track for the film. Another version of the song Alive was recorded by Shreya Ghoshal but was not featured in the movie or officially released. The Hindi Version of 'Alive' was named 'Zindagi and was written by Mayur Puri.", "| Alive || 4:20 || (performed by Karen David)"]}, {"page": "Jasmine (Aladdin)", "response": ["In September 2016, a live-action version of Jasmine debuted as a recurring character in the sixth season of the fantasy television series Once Upon a Time, in which she is portrayed by actress Karen David. The character makes a brief first appearance in the season's fourth episode, \"Strange Case,\" before finally starring in the fifth, \"Street Rats,\" in which Jasmine enlists the help of Aladdin to locate a powerful item capable of interrupting Jafar's control over the Sultan. As has become custom with Once Upon a Time's plots, creative liberties were taken with the original film, including Jasmine taking Aladdin to the Cave of Wonders instead of Jafar and the absence of the pair developing romantic feelings for each other, although the iconic scene in which Jasmine is imprisoned in an hourglass is retained. Jasmine's blue outfit was slightly modified for the series. David had previously expressed interest in playing an ethnic Disney heroine such as Pocahontas, Esmeralda or Jasmine on Once Upon a Time, and was finally cast as the third in July 2016. The actress described preparing for the role as exciting yet \"nerve-wracking,\" because \"she's such an iconic and beloved character and all the fans have their idealism of what she should and shouldn't be,\" longing to please fans of both the original film and character."]}, {"page": "SF Sketchfest", "response": ["Audiences binged a bunch of TV events at the fest. A Spotlight on Comedy Central’s Drunk History brought creator Derek Waters and friends Steve Berg, Eric Edelstein, Cameron Esposito, Ron Funches and Kyle Kinane for a late night at the Castro Theatre; John Lurie was joined by Parker Posey to celebrate the 25th Anniversary of Fishing with John; The Kids in the Hall’s Dave Foley, Kevin McDonald and Scott Thompson came together for Three Outta Five Ain’t Bad; BoJack Horseman with Paul F. Tompkins, Lisa Hanawalt, Mike Hollingsworth and creator Raphael Bob-Waksberg, Moderated by Mara Wilson; Dr. Katz Professional Therapist Live with Jonathan Katz and guest patients Maria Bamford, Zach Galifianakis, Janeane Garofalo, Andy Kindler and The Sklar Brothers; Futurama: Nothing New To Report with John DiMaggio, Maurice LaMarche, Lauren Tom and Billy West, moderated by Lee Supercinski; Galavanting with Galavant with Timothy Omundson, Karen David, Mallory Jansen, Luke Youngblood and showrunners John Hoberg and Kat Likkel; It's Adventure Time with John DiMaggio, Maria Bamford, Tom Kenny and Kent Osborne;  Pete & Pete Forever: The Adventures of Pete and Pete Live with Michael C. Maronna, Danny Tamberelli, Toby Huss, Rick Gomez, Mark Mulcahy, and creators Chris Viscardi and Will McRobb; Sledge Hammer! 30th Hammerversary with stars David Rasche, Anne-Marie Martin and Harrison Page and creator Alan Spencer; and The Chris Gethard Show Presents: Chris Gethard versus Vacation Jason in a Literal Fight to the Death!"]}, {"page": "Waterloo Road (TV series)", "response": ["For series 6, former Silent Witness and Brookside actress Amanda Burton joined the cast as new headteacher, Karen Fisher. Linzey Cocker played alongside Burton as on-screen daughter, Jess Fisher and Ceallach Spellman played her on-screen son, Harry Fisher, Coronation Street actor Lucien Laviscount was cast as rebellious teenager Jonah Kirby and Chelsee Healey also reprised her role as Janeece Bryant, not as a pupil, but as the new school secretary. On 21 December 2009, it was announced that former Coronation Street actress Tina O'Brien had been cast as Bex Fisher, and that Britain's Got Talent winner George Sampson would be joining the cast as a new Year 11 student, Kyle Stack – his scenes aired from episode 11. Also from episode 11, Scott Haining played Nate Gurney, a love interest for the newly homosexual Josh Stevenson,  Spandau Ballet member and former EastEnders actor Martin Kemp guest starred as Mr Burley, new character Ronan Burley's (Ben-Ryan Davies)  father,  and Karen David portrayed new Head of Spanish, Francesca \"Cesca\" Montoya. Wil Johnson portrayed new Geography teacher, Marcus Kirby, Jonah's father, and the family was further expanded by the addition of Anna Jobarteh, who played his daughter and new pupil, Ruth. Elaine Symons also reprised her role as Rose Kelly in Episode 6. Series 6 saw the last appearances of Cesca Montoya (Karen David), Ruby Fry (Elizabeth Berrington), Jonah Kirby (Lucien Laviscount), Ruth Kirby (Anna Jobarteh), Marcus Kirby (Wil Johnson), Adanna Lawal (Sharlene Whyte) and Nate Gurney (Scott Haining). It ended on 6 April 2011."]}, {"page": "The Scorpion King 2: Rise of a Warrior", "response": ["* Karen David as Layla", "In August 2007, it was reported that Dwayne \"The Rock\" Johnson would not reprise his role, but instead, Michael Copon was cast as the young Mathayus, Karen David as the lead heroine, Layla, and Randy Couture as the main villain, Sargon."]}, {"page": "Chindians", "response": ["* Karen David, British singer-songwriter born in Meghalaya, India"]}, {"page": "List of Indo-Canadians", "response": ["*Karen David - pop singer"]}, {"page": "List of Waterloo Road characters", "response": ["*Francesca \"Cesca\" Montoya (Karen David, series 6) is the Head of Spanish. She butts heads with Karen Fisher when she reveals she knew about her husband Charlie's affair. She begins an affair with pupil Jonah Kirby, who she later marries, being arrested and losing her job as a result."]}, {"page": "List of Criminal Minds characters", "response": ["| Karen David"]}, {"page": "List of fictional princesses", "response": ["| Princess Isabella Maria Lucia Elizabetta of Valencia. Portrayed by Karen David."]}, {"page": "Top Buzzer", "response": ["Guest stars on the show included Johnny Vaughan, Karen David, Ricky Grover, Howard Marks, Mackenzie Crook, Sean Lock, Edith Bowman, Iain Lee, Bez, Shaun Ryder, rapper Kanye West and presenter Xzibit, Tony Hawk and ex So Solid Crew member Asher D."]}, {"page": "Terry Pratchett's The Colour of Magic", "response": ["The inverted fight between Rincewind and Liessa in the Wyrmberg, by contrast, was the most meticulously choreographed sequence in the film. In addition to the need to add CGI backdrops to every shot, hanging upside down from wires whilst fighting proved to be what David Jason described as \"a nauseous experience\". The sequence had to be filmed in very short bursts as \"all of the actors and stunt people could only manage around four to five minutes before they wanted to [vomit]\". Karen David, who played Liessa, pulled several stomach muscles during the filming, and Jason described the experience as like \"being hung upside-down like the last chicken at Sainsbury's... I wouldn't do that again in a hurry\".", "* Karen David as Liessa, a dragonlady from the Wyrmberg."]}, {"page": "Cold Feet (series 6)", "response": ["* Karen David as Angela Zubayr"]}, {"page": "London Film and Comic Con", "response": ["| 26–28 July 2019|| Olympia||Martin Sheen, Charlie Sheen, Zachary Quinto, Robert Carlyle, Hayden Christensen, Jason Momoa, Carrie-Anne Moss, Brendan Fraser, Tom Ellis, Val Kilmer, Jason Isaacs, Tom Felton, Ben Barnes, Christina Ricci, Gina Torres, Lana Parrilla, Emilie De Ravin, Karen David, Robert Patrick, Christopher Eccleston, Vladimir Furdik, Ian McDiarmid, Matthew Lillard, Lee Majors, William Shatner, Walter Koenig, Shazad Latif, William Zabka, Jacob Bertrand, Xolo Mariduena, Ian Somerhalder, John Barrowman, Alfie Allen, Jenna Coleman, Adam Baldwin, Gareth David-Lloyd, Lisa & Louise Burns, Michael Shanks, Billy Dee Williams, Erin Kellyman, Manu Bennett, Peter Serafinowicz, Finn Jones, Jeff Jarrett, Jessica Henwick, Sacha Dhawan, David Morrissey, Lennie James, Joe Thomas, Blake Harrison, David Naughton, Sean Biggerstaff, Devon Murray, Ethan Phillips, Nicole De Boer, Joe Flanigan, Ian Whyte, Julian Glover, Lourdes Faberes, Mike Carter, Gemma Whelan, Phil Daniels, Bernard Cribbins, Franco Nero, Sylvester McCoy, Daniel Mays, Colin Baker, Sophie Aldred, John Leeson, Jessie Cave, Rick Gonzalez, Kirk Acevedo, Rob Morgan, Corey Dee Williams, Curzon Dobell, Kailia Vernoff, Robert Picardo, Stephen Gevedon, Philip Zhao, Peter Purves, John Levine, John Simpkin, Rusty Goffe, CJ Graham, Annette Jones, Barbara Frankland, Tara Fitzgerald Robert Glenister, Kane Hodder, Hugh Quarshie, Jim Marlow, Leslie Easterbrook, Paul Blake, Nicola Bryant, Katie Purvis, Neil Ellis, James Jude Courtney, Martin Stephens, Lesley Scoble, Teri Scoble, Andy de la Tour, Jonathan Cohen, Rugero Deodato, Me Me Lai, Samuel Oatley, Quentin Pierre, Tony Allen, Derek Arnold, Tom Wilton, David Church, Syd Wragg, Steve Ismay, Alan Fernandes, Ross Beadman, Peter House, Anthony Cece, Guy Henry, Kerry Ingram, Andy Bradford, Pam Rose, Eileen Roberts, Ron Hone, Bill Westley, Peter Ross, Derek Chafer, John Cannon, Terry Francis, Vic Gallucci, Grant Hall, Francesca Ciardi, Nelson Hall, Aimee Garcia, Genevieve Gaunt, Jaime Hill, Alan Harris, Kelly Kelly, Rey Mysterio, Ted Dibiase, Al Snow, Rob Liefeld"]}, {"page": "The Hapa Project", "response": ["Celebrities in the project include Lynda Barry, Wuv Bernardo, Asia Carrera, Karen David, Amy Hill, Sean Lennon, Liz Masakayan, Greg Pak, Sonny Sandoval, and Sandra Tsing Loh."]}, {"page": "Couples Retreat", "response": ["* Karen David as Spa Attendant"]}, {"page": "Phoenix Fan Fusion", "response": ["|Dick Van Dyke, Alan Tudyk, Karen Gillan, Bonnie Wright, Jon Bernthal, Elden Henson, Kevin Conroy, PJ Haarsma, Gabriel Luna, Curtis Armstrong, Danny Trejo, Anthony Michael Hall, Vic Mignogna, Sean Schemmel, Christopher Sabat, Todd Haberkorn, Teddy Sears, Karen David, John de Lancie, Osric Chau, David Anders, Sean Maguire, Rachel Skarsten, Michael Rosenbaum, Neal McDonough, Ciara Renée, Garrett Wang, Robert Duncan McNeill, Jason David Frank, Osric Chau, Ryan Hurst, Peter David, Robin Hobb, Terry Brooks, Michael A. Stackpole, Arthur Suydam, Norm Rapmund, Dan Jurgens, Diane Pershing, Diana Gabaldon, Kevin J. Anderson, Timothy Zahn, Dan Wells, Jim Shooter, Jae Lee, Frank Beddor, Sam Sykes, Myke Cole, Pierce Brown, Jim Butcher, Sherrilyn Kenyon, among others."]}, {"page": "Bollywood Queen", "response": ["* Karen David as Neeta"]}, {"page": "Touch (American TV series)", "response": ["\"Three Little Birds\", sung by Kayla Graham (Karen David), was released as a soundtrack single, on iTunes by 20th Century Fox TV Records on February 28, 2012."]}, {"page": "List of Discworld characters", "response": ["She appears in The Colour of Magic. In the Easter 2008 Sky One adaptation of The Colour of Magic, she is played by Karen David."]}, {"page": "List of Once Upon a Time characters", "response": ["! Karen David", "* Princess Jasmine (season 6) portrayed by Karen David, is the daughter of the Sultan of Agrabah, and Aladdin's lover. When Jafar began residing at the Capital of Agrabah, she tries to get Aladdin to help her free the realm from his tyranny. However, Aladdin frees himself from his savior state and Jafar entraps the capital into a jewel, forcing Jasmine to retreat to the Land of Untold Stories. Thirty years later, ending up in Storybrooke, she reunites with Aladdin and continues their mission to save their home. Confronting Jafar, now a genie, they get the upper hand and kills him, restoring the capital. During the Black Fairy's curse, Jasmine helps Snow locate David with her magic carpet. After the Final Battle is won, she and Aladdin rests on the balcony of their palace, gazing upon their realm."]}]}}