{"wiki_id": "http://www.wikidata.org/entity/Q4666575", "itemLabel": "Abel Henry Smith", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Abel_Henry_Smith", "wikipedia_page": {"main": "Colonel Abel Henry Smith (6 December 1862 – 10 November 1930) was a British Conservative Party politician and an English landowner of the Smith banking family.\nSmith was the son of Abel Smith (1829–98), from whom he inherited the large estate of Woodhall Park, near Watton-at-Stone in Hertfordshire. Over a dozen of his ancestors had sat in the House of Commons over the preceding century.\nAt the 1892 general election, he was elected as Member of Parliament (MP) for Christchurch. He was re-elected in 1895, but at the 1900 general election he stood instead in the Hertford constituency which had been represented by his father until his death in 1898.  He won the 1900 election, and held the seat until he stood down at the general election in January 1910. He was appointed a deputy lieutenant of Hertfordshire in August 1910.After his death in 1930, aged 67, the contents of the family's stately home were dispersed, and the building rented out.", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": ["******** Abel Henry Smith (1862–1930), MP 1892–1910. Son of Abel."]}, {"page": "Christchurch (UK Parliament constituency)", "response": ["| Abel Henry Smith"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Abel Henry Smith"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Abel Henry Smith "]}, {"page": "Heath Mount School", "response": ["In 1771 the original house was damaged in a fire; Thomas Rumbold purchased the estate in 1774. He demolished the remnants of the house and built a new one devised by Thomas Leverton in 1777. This neo-classical house is still extant, although it was enlarged some years later. The house with the surrounding land was then purchased by Samuel Smith (1754–1834), a banker and a Member of Parliament, from Nottingham, in 1801. Four generations of Smiths occupied the house until 1930 after the death of the fourth, Colonel Abel Henry Smith. The contents of the house were dispersed and it became a school, later called Heath Mount School, in 1934."]}, {"page": "Hertford (UK Parliament constituency)", "response": ["| Abel Henry Smith"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["* Abel Smith (1829–1898), MP 1854–98, and son Abel Henry Smith, MP 1892–1910."]}, {"page": "Abel Smith", "response": ["* Abel Henry Smith (1862–1930), MP for Christchurch (1892–1900) and Hertford (1900-1910)"]}, {"page": "Abel Smith (politician, born 1829)", "response": ["Smith married Lady Susan Emma Pelham, daughter of Henry Pelham, 3rd Earl of Chichester, on 7 April 1853. Their son Abel Henry Smith was subsequently MP for Hertford."]}, {"page": "Smith family (bankers)", "response": ["******* Abel Henry Smith (1862–1930)"]}]}}