{"wiki_id": "http://www.wikidata.org/entity/Q4662464", "itemLabel": "Aaron Steele", "itemDescription": "soccer player (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Aaron_Steele_(footballer,_born_1983)", "wikipedia_page": {"main": "Aaron Steele (born 4 February 1983) is an English former professional footballer who played as a  defender in the Canadian Professional Soccer League, USL A-League, and Premier Development League.", "link_mentions": [{"page": "Hamilton Thunder", "response": ["In 2003, Hamilton hired the services of Duncan Wilde as the new head coach with coaching credentials from England. Wilde signed several new additions to the squad - acquiring Aaron Steele, Sergio De Luca, and Dave Simpson. The 2003 campaign started off well with a seven-game undefeated streak placing the Thunder on top of the Western Conference. Unfortunately Wilde announced his resignation as head coach after disagreements with team owner Italo Ferrari, and was replaced by Ivan Marković. Further changes were made by the hiring of former Canadian National Soccer League Commissioner  Rocco Lofranco as the club's new CEO, and the signing of Croatian players Petar Dajak, Mario Zupetic, Vedran Bacek, and Zeljiko Dukic."]}, {"page": "Steele (surname)", "response": ["* Aaron Steele (footballer, born 1983), English football player active in Canada", "* Aaron Steele (footballer, born 1987), English football player for Brentford and Slough Town"]}, {"page": "2005 Canadian Professional Soccer League season", "response": ["|CB ||6 || Aaron Steele || || ", "| D || Aaron Steele  || Oakville Blue Devils"]}, {"page": "Brampton United", "response": ["Former Toronto Lynx head coach, and president of the Premier Soccer Academy Duncan Wilde was appointed manager. Wilde only retained the services of Pop, Dorneval, and Kevin Ricketts from the previous season. He would stack up his roster with players with USL experience particularly from the Toronto Lynx.  The signings included Darren Baxter, Aaron Steele, Shawn Faria, Igor Prostran, Sergio De Luca, and CSL veterans Phil Ionadi, Sa Brahima Traore,  Marko Bedenikovic, Ryan Gamble, Domico Coddington, Angel Velazquez, Orlin Chalmers, and Paul Daccobert. Oakville immediately made an impact by posting a seven-game undefeated streak, and recorded the best offensive record. Oakville finished first in the Western Conference, but had points deducted due to discipline related violations. The deduction resulted in Oalville losing their division title by finishing as runners up. In the first round of the postseason the Blue Devils faced the Windsor Border Stars, and advanced to the semi-finals by a score of 3-1. In the semi-finals Oakville faced Hamilton Thunder, and won the match by a score of 2-0. In the CPSL Championship final match Oakville faced Vaughan Shooters during the match the Shooters struck first with a goal from Stalin Cardenas, ten minutes later De Luca scored the equalizer sending the match to overtime where Gamble came off the bench to score the winning goal and capture the organizations first championship title."]}, {"page": "2006 Open Canada Cup", "response": ["|DF ||32|| Aaron Steele || || "]}, {"page": "All-time Toronto Lynx roster", "response": ["*  Aaron Steele"]}, {"page": "Aaron Steele", "response": ["Aaron Steele may refer to:", "* Aaron Steele (footballer, born 1983), English football player active in Canada", "* Aaron Steele (footballer, born 1987), English football player for Brentford and Slough Town", "* Aaron Steele (Guitar Hero), a fictional character in the Guitar Hero video game"]}, {"page": "List of foreign Canadian Soccer League players", "response": ["* Aaron Steele – Hamilton Thunder, Oakville Blue Devils – 2003, 2005"]}]}}