{"wiki_id": "http://www.wikidata.org/entity/Q4662537", "itemLabel": "Aaron Wildig", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Aaron_Wildig", "wikipedia_page": {"main": "Aaron Keith Wildig (born 15 April 1992) is an English professional footballer who plays for Morecambe in League Two. A midfielder, he began his career with Cardiff City, later moving to Shrewsbury Town.", "link_mentions": [{"page": "Morecambe F.C.", "response": ["Starting in the early 1990s, Morecambe have been engaged in a bitter rivalry with Lancashire neighbours Accrington Stanley.  The Shrimps failed to beat Accrington in 16 attempts after their 2007 promotion to the Football League before Aaron Wildig's goal gave them a 1–0 win over their rivals in August 2015."]}, {"page": "Mark Carrington (footballer)", "response": ["The next day, Carrington made his debut for Hamilton before coming off for Aaron Wildig in the 57th minute in a 2–0 loss against St Johnstone on 2 February 2011. Carrington made 11 more appearance for the club and was subsequently released by Hamilton following their relegation from the SPL."]}, {"page": "Cardiff City F.C. Under-23s and Academy", "response": [" Aaron Wildig"]}, {"page": "List of Hamilton Academical F.C. players", "response": ["|Aaron Wildig||||2011||3||0||"]}, {"page": "2009–10 Cardiff City F.C. season", "response": ["|Aaron Wildig"]}, {"page": "2010–11 Cardiff City F.C. season", "response": ["|28||Aaron Wildig||CM||||Hereford||||21||1||Academy||15 April 2009||Trainee||2012"]}, {"page": "2010 Football League Championship play-off Final", "response": ["|MF ||28||Aaron Wildig"]}, {"page": "2010–11 Hamilton Academical F.C. season", "response": ["| 15 || MF ||  || Aaron Wildig|| 0|| 0 || 0"]}, {"page": "2011–12 Cardiff City F.C. season", "response": ["|Aaron Wildig"]}, {"page": "2011–12 Shrewsbury Town F.C. season", "response": ["|= ||MF || ||20 ||Aaron Wildig || 1 || 0 || 0 || 0 || 1", "|20 || ||MF ||Aaron Wildig || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0", "| Aaron Wildig"]}, {"page": "1992 in England", "response": ["* 15 April - Aaron Wildig, footballer"]}, {"page": "Florent Cuvelier", "response": ["On 26 October 2018, Cuvelier joined Morecambe on a three-month contract and said that \"the last couple of months have been difficult, they've been a roller coaster and I was delivering pizza just to get some money coming in\". Manager Jim Bentley had brought Cuvelier to the Globe Arena after injuries to James Sinclair, Lamin Jagne, Alex Kenyon, Andrew Tutte, Andrew Fleming and Aaron Wildig. However he featured in only one EFL Trophy game for the \"Shrimps\" before his contract expired on 25 January."]}, {"page": "2012–13 Shrewsbury Town F.C. season", "response": ["| Aaron Wildig"]}, {"page": "2013–14 Bolton Wanderers F.C. season", "response": ["Bolton entered the League Cup at the first round stage for the first time since the 2000–01 season, alongside all other Football League clubs except Wigan Athletic and Reading. The draw took place on 17 June 2013 and gave Bolton an away tie at Shrewsbury Town. Bolton took the lead with a long-range goal from Robert Hall, before Shrewsbury Town equalised through Aaron Wildig. Making his full debut for the club, academy graduate Sanmi Odelusi then scored two goals either side of half-time to put Bolton 3–1 up. Bolton saw out the game to progress into the second round of the League Cup. André Moritz also made his debut, coming off the bench, after joining on 1 August 2013. The draw for the second round of the League Cup was made on 8 August, with Bolton playing Tranmere Rovers at Prenton Park on 27 August. At Prenton Park, Bolton went 1–0 down just before half-time as Cole Stockton scored for Tranmere. Bolton equalised through Jermaine Beckford's first goal for the club, but could not find another before the end of normal time, thus forcing the game into extra time. With no goals scored in the extra half-hour, the game moved to a penalty shoot-out. André Moritz and Alex Baptiste both had penalties saved by Owain Fôn Williams to send Bolton out of the League Cup."]}, {"page": "Ryan Woods (footballer, born 1993)", "response": ["Woods began his youth career with local club Walsall, but was released at age 15 and moved to Shrewsbury Town in 2009. He completed a scholarship and signed his first professional contract in May 2012. Woods received his maiden call into the first team squad for a League One match at home to Carlisle United on 15 December 2012, but remained an unused substitute during the 2–1 win. After six further calls into the squad, Woods made his debut as an 89th-minute substitute for Aaron Wildig in a 1–0 home win over Oldham Athletic on 23 April 2013. Four days later he played his only other game of the season, again replacing Wildig for the last six minutes of a 3–2 win against Portsmouth at the New Meadow. He signed a contract extension on 10 June 2013."]}, {"page": "2013–14 Shrewsbury Town F.C. season", "response": ["|| MF |||| 15 ||Aaron Wildig|| 2 || 0 || 1 || 0 || 3", "|| FW |||| 15 ||Aaron Wildig|| 1 || 0 || 0 || 0 || 1", "|15 ||||MF||Aaron Wildig|| 3 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 4 || 0"]}, {"page": "2014–15 Morecambe F.C. season", "response": ["|20 March 2015|| Aaron Wildig|| Shrewsbury Town||19 April 2015||"]}, {"page": "2014–15 Shrewsbury Town F.C. season", "response": ["|15||Aaron Wildig||CM||||Hereford||||71||6||Cardiff City||8 November 2011||Free||2015", "|19 January 2015||21 February 2015||MF||||Aaron Wildig||Kidderminster Harriers||", "|20 March 2015||19 April 2015||MF||||Aaron Wildig||Morecambe||"]}]}}