{"wiki_id": "http://www.wikidata.org/entity/Q4666421", "itemLabel": "Abe Mitchell", "itemDescription": "professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Abe_Mitchell", "wikipedia_page": {"main": "Henry Abraham Mitchell (18 January 1887 – 11 June 1947) was an English professional golfer. Mitchell had eight top-10 finishes out of 17 appearances in the Open Championship, his best performance being fourth in 1920. He was runner-up in the 1912 Amateur Championship and won the 1924 Miami Open.", "link_mentions": [{"page": "Ryder Cup", "response": ["The British team was: George Duncan (captain), James Braid, Arthur Havers, Abe Mitchell, James Ockenden, Ted Ray, James Sherlock, J.H. Taylor, Josh Taylor, and Harry Vardon. The American team was: Emmet French (captain), Clarence Hackney, Walter Hagen, Charles Hoffner, Jock Hutchison, Tom Kerrigan, George McLean, Fred McLeod, Bill Mehlhorn and Wilfrid Reid. Gold medals were presented by Katharine Stewart-Murray, Duchess of Atholl, to each member of the teams at the conclusion of the Glasgow Herald tournament on Saturday afternoon. The medals \"had on one side crossed flags, The Union Jack and Stars and Stripes surmounted by the inscription \"For Britain\" or \"For America\" as the case may be, and on the other side \"America v Britain. First international golf match at \"The Glasgow Herald\" tournament, Gleneagles, 6 June 1921\"", "The British team was: Ted Ray (Captain), Aubrey Boomer, Archie Compston, George Duncan, George Gadd, Arthur Havers, Herbert Jolly, Abe Mitchell, Fred Robson and Ernest Whitcombe. The American team was: Walter Hagen (Captain), Tommy Armour, Jim Barnes, Emmet French, Joe Kirkwood, Fred McLeod, Bill Mehlhorn, Joe Stein, Cyril Walker and Al Watrous. While all ten of the British players subsequently played in the Ryder Cup only three of the Americans did (Hagen, Mehlhorn and Watrous). Armour, Barnes, Kirkwood, McLeod and Walker were excluded by the policy of requiring players to be born in the USA while French and Stein were never selected."]}, {"page": "John Ball (golfer)", "response": ["| 1912 || The Amateur Championship || align=center|38 holes ||  Abe Mitchell"]}, {"page": "1929 in Ireland", "response": ["*Irish Open is won by Abe Mitchell (England)."]}, {"page": "James Braid (golfer)", "response": ["*1920 Galashiels Tournament, McVitie & Price Tournament (joint winner with Abe Mitchell), Amateurs and Professionals Foursomes Tournament (with J. H. Taylor)"]}, {"page": "The Amateur Championship", "response": ["|1912||Royal North Devon Golf Club||John Ball (8) ||||align=\"center\"|38 holes|| Abe Mitchell"]}, {"page": "The Clicking of Cuthbert", "response": ["Vladimir Brusiloff, a famous Russian writer of dreary novels, is in the country on a lecturing tour and comes to Wood Hills, to the delight of Mrs Smethurst and her society. Brusiloff, tired of giving lectures and meeting aspiring writers, is in a bad mood when Mrs Smethurst introduces him to Devine. Devine says he was greatly influenced by Russian writers named Sovietski and Nastikoff, but Brusiloff coldly remarks that they are no good. Devine's prestige in the literary society is immediately shattered and he slinks away. Adeline loses all her respect for him. Brusiloff mentions that he wants to meet the golfers Abe Mitchell and Harry Vardon. (Walter Hagen and Jock Hutchison in the US version of the story.) Cuthbert mentions that he knows them. Brusiloff recognizes Cuthbert's name and is honoured to meet him, since he won the French Open. Adeline now admires Cuthbert. She marries him and becomes a fan of golf. Devine had to leave the neighbourhood and is now writing scenarios for films in California."]}, {"page": "Irish Open (golf)", "response": ["After Duncan's win in 1927, the event was dominated by English golfers, the only other non-English winner before World War II being Bobby Locke in 1938. Ernest Whitcombe won in 1928, the first of four wins by the Whitcombe brothers; Ernest won again in 1935 while Charles won in 1930 and Reg won in 1936. Ernest Whitcombe had rounds of 68 and 69 on the first two days of the 1928 event, to take a seven stroke lead. Rounds of 73 and 78 on the final day were enough to give him a four stroke victory. The 1929 championship was played again at Portmarnock and resulted in a three-way tie on 309, just 3 strokes better than Duncan's score there in 1927. There was a 36-hole playoff the following day. Abe Mitchell and Archie Compston were level after the first round on 75 with Len Holland five behind. Mitchell scored another 75 in the afternoon to win by two strokes from Compston and ten from Holland. Charles Whitcombe dominated the 1930 tournament, winning by 8 strokes from defending champion Abe Mitchell. Whitcombe led by four after the first two rounds and full away further on the final day. the 1931 championship was won by a relative unknown, Bob Kenyon, who won by two after a final round 70. Five players tied for second place, including Ernest Whitcombe who finished with a course-record 66 on the Royal Dublin links.", "| align=center|1931 ||  Bob Kenyon || align=center|291 ||  || 2 strokes ||  Bill Davies Bert Hodson Abe Mitchell Mark Seymour Ernest Whitcombe ||  || Royal Dublin", "| align=center|1930 ||  Charles Whitcombe || align=center|289 ||  || 8 strokes ||  Abe Mitchell ||  || Royal Portrush", "| align=center|1929 ||  Abe Mitchell || align=center|309 ||  || Playoff ||  Archie Compston Len Holland ||  || Portmarnock"]}, {"page": "Open de France", "response": ["| 1926 ||  Aubrey Boomer (3) || align=center|280 ||  || 5 strokes ||  Abe Mitchell || Saint-Cloud"]}, {"page": "Samuel Ryder", "response": ["At the age of 50 he became an enthusiastic golfer and then from 1923 to 1925 he, together with his brother James, started sponsoring a number of golf tournaments and matches mostly at his home club of Verulam near St Albans. From late 1925 he started employing Abe Mitchell as his private coach. In early 1926 the idea for a match between British and American professional golfers was proposed. Ryder became involved and sponsored the event. It had been his intention that the match would be the first Ryder Cup but it was later decided that the match would not be an official contest. The first official event did not take place until 1927 for which Ryder donated a gold trophy.", "*2 June 1924 – Challenge match: Abe Mitchell v Charles Whitcombe at Verulam", "*10 and 11 July 1924 – Annual Test: George Duncan and Abe Mitchell v Walter Hagen and Macdonald Smith at St George's Hill and Oxhey", "*4 June 1925 – Challenge match: George Duncan and Abe Mitchell v Ernest and Charles Whitcombe at Verulam", "*11 July 1925 – Annual Test: Abe Mitchell v Jim Barnes at Verulam", "*15 July 1925 – Challenge match: Jim Barnes and Abe Mitchell v Archie Compston and Ted Ray at Verulam", "=== Abe Mitchell ===", "After the Compston/Ray match in October 1925 it was announced that \"Heath and Heather\" would no longer sponsor golf events. However it was immediately announced that Abe Mitchell would, from Christmas 1925, be taking up a \"private appointment\" with Samuel Ryder with a salary of £500 and £250 for expenses. Although it was formally announced that Mitchell would be Ryder's private coach, a major purpose of the appointment was to enable Mitchell to play in all important tournaments and to practice as much as he wished. Ryder saw Mitchell as the man who could beat the Americans in the Open Championship. The appointment was initially for three years.", "Even though Ryder had started his support of Abe Mitchell in late 1925 and was also financially supporting the Ryder Cup, he continued to sponsor other professional events, although on a personal basis and not under the Heath and Heather name. The most important were:"]}, {"page": "Ted Ray (golfer)", "response": ["Before World War I Ray was often overshadowed by the Great Triumvirate of James Braid, J.H. Taylor and Harry Vardon and then after the war by George Duncan and Abe Mitchell. Despite this he was one of the leading British golfers of the first quarter of the 20th century.", "Apart from his Open Championship success, Ray only won one important stroke-play tournament, the 1923 Daily Mail Tournament. Ray scored 288 to win by a stroke from Len Holland and Abe Mitchell and two from George Duncan, taking the first prize of £300. Ray had been runner-up the previous year, finishing four shots behind Duncan.", "From 1920 to 1927 there was a second big match-play event, the Glasgow Herald Tournament. Ray reached two finals, 1922 and 1927. In 1922 he met Abe Mitchell in the final. Ray led by three after 11 holes of the morning round, but Mitchell finished well to level the match at lunch. Mitchell took a three-hole lead after the first nine holes of the afternoon round and eventually won 2&1, his second successive win in the tournament. In 1927 Ray met Charles Whitcombe in the final. The match was very one-sided with Whitcombe 5-up at lunch. After 8 holes of the afternoon round Whitcombe was dormie-10. Ray won the 9th but Whitcombe won the 10th to win 10&8.", "The England–Scotland Professional Match was not played immediately after the war, and in fact did not resume until 1932. Ted Ray was the non-playing Captain of the England team in 1933. The first important post-war international was a match between British and American teams in 1921 at Gleneagles. Ray played 3rd in the singles, behind George Duncan and Abe Mitchell. Ray was chosen as the British playing-captain for the 1926 international match on the East Course at the Wentworth Club in Surrey. The following year, despite having passed his 50th birthday, Ray was selected for the inaugural Ryder Cup match at Worcester Country Club in Massachusetts. Abe Mitchell was originally chosen as captain but was unable to travel because of illness, and was replaced by Ray."]}, {"page": "George Duncan (golfer)", "response": ["In 1920, he won the first post World War I Open Championship at Royal Cinque Ports in Kent, in one of the greatest comebacks in Open Championship history. After shooting 80 in his first two rounds, Duncan was thirteen shots behind the leader, Abe Mitchell, before the final two rounds were played, but made up the deficit to win by two shots from Sandy Herd.Zullo, Allan (2001) Astonishing but True Golf Facts. Andrew McMeels Publishing, Forest Fairview, North Carolina. . His rounds were 80-80-71-72=303. He is the last player to win a golf major with a score of 80 for a round.", "* 1919 Killermont Tournament, St Andrews Tournament (\"Victory Open\") (joint winner with Abe Mitchell)"]}, {"page": "List of European Ryder Cup golfers", "response": ["|  Abe Mitchell || 1927, 1929, 1931, 1933", "|ENG || align=left|Abe Mitchell || 1929 || 1933 || 3 || 6 || 4 ||  || 4 || 2 || 0 || 1 || 2 || 0 || 3 || 0 || 0 || 0 || 0 || 0"]}, {"page": "British PGA Matchplay Championship", "response": ["| 1930 || Charles Whitcombe (2) ||  || Oxhey Golf Club || align=center|4 & 2 ||  Henry Cotton || align=center|300 || || Abe Mitchell, Syd Easterbrook", "| 1929 || Abe Mitchell (3) ||  || Wentworth Club || align=center|8 & 7 ||  Philip Rodgers || align=center|300 || || Archie Compston, Freddie Beck", "| 1923 || Reg Wilson ||  || Walton Heath Golf Club || align=center|4 & 2 ||  Thomas Renouf || align=center|200 || || Abe Mitchell, Tom Williamson", "| 1920 || Abe Mitchell (2) ||  || Mid-Surrey Golf Club || align=center|3 & 2 ||  Josh Taylor || align=center|100 || || Bert Seymour, Len Holland", "| 1919 || Abe Mitchell ||  || Walton Heath Golf Club || align=center|1 up ||  George Duncan || align=center|100 || || Peter Rainford, Fred Robson"]}, {"page": "1933 Ryder Cup", "response": ["| align=left| Abe Mitchell", "|Abe Mitchell", "|align=left|Abe Mitchell || 2 || 2–0–0 || 1–0–0 || 1–0–0"]}, {"page": "1931 Ryder Cup", "response": ["| align=left| Abe Mitchell", "|Abe Mitchell", "|align=left|Abe Mitchell || 1 || 1–1–0 || 0–1–0 || 1–0–0"]}, {"page": "1929 Ryder Cup", "response": ["| align=left| Abe Mitchell", "|Abe Mitchell", "|align=left|Abe Mitchell || 1 || 1–1–0 || 0–1–0 || 1–0–0"]}, {"page": "1927 Ryder Cup", "response": ["A sub-committee of the Professional Golfers' Association was appointed to choose the Great Britain team for the first official Ryder Cup. This consisted of Harry Vardon, J.H. Taylor and James Braid.\"A Professional Selection Committee\". The Times, Wednesday, March 2, 1927; pg. 8; Issue 44519; col B. In March 1927 an initial group of 9 players was selected to represent Great Britain. These consisted of the above 9 players but with Abe Mitchell instead of  Jolly.\"British Professional Team\". The Times, March 4, 1927; pg. 16; Issue 44521; col E. Later in March it was announced that Abe Mitchell would be the captain of the team.\"British Professional Team\". The Times, March 16, 1927; pg. 6; Issue 44531; col D. However, in May, his health gave some concern. It was eventually decided that he was unfit to travel.\"British Ryder Cup Team\". The Times, May 21, 1927; pg. 5; Issue 44587; col G. Later he was operated on for appendicitis."]}, {"page": "List of male golfers", "response": ["| Abe Mitchell||1887–1947"]}, {"page": "Miami Open (golf)", "response": ["*1924 Abe Mitchell"]}, {"page": "Tooting Bec Cup", "response": ["| 1933 ||data-sort-value=Mitchell | Abe Mitchell || align=center|68", "|1920 || Ted Ray ||  || Worplesdon Golf Club || align=center|149 || 1 stroke ||  Abe Mitchell || align=center|10 || "]}, {"page": "1914 Open Championship", "response": ["|Abe Mitchell ||  ", "|Abe Mitchell ||  || 76-78=154", "|rowspan=3 align=center|T4 || Abe Mitchell ||  || 76-78-79=233 ", "|rowspan=2 align=center|T4 || Abe Mitchell ||  || 76-78-79-79=312 || rowspan=2 align=center|8 15s"]}, {"page": "1920 Open Championship", "response": ["Qualification for the professionals took place the week before on 23 and 24 June at Burhill and Saint George's Hill in Surrey; the leading 72 players and ties qualified. Abe Mitchell led the field at 139; three tied on the qualifying score of 159 and 74 professionals advanced. The amateurs qualified separately, playing 36 holes on 23 June at Sandwich. Eight places were allotted to the amateurs with Cyril Tolley, the Amateur Champion, given an automatic entry. Prize money was increased sixty percent to £200 with a winner's share of £75; the winner also received a gold medal valued at £25.", "Herd and Ted Ray, the 1912 winner, shared the first round lead at 72 on Wednesday morning. Both faltered in the afternoon's second round while Abe Mitchell shot a 73 for a 147 to open up a six-stroke lead over Herd and Jim Barnes. Ray was eight back, Len Holland eleven behind, while Duncan was thirteen back after consecutive rounds of 80 for 160.", "|align=center|3 || Abe Mitchell ||  || align=center|74", "|align=center|1 || Abe Mitchell ||  || 74-73=147", "|Abe Mitchell ||  || 74-73-84=231 ", "|align=center|4 || Abe Mitchell ||  || 74-73-84-76=307 || align=center|15"]}, {"page": "1923 Open Championship", "response": ["|Abe Mitchell ||  || 77-77-72=226", "|Abe Mitchell ||  || 77-77-72-77=303"]}, {"page": "1925 Open Championship", "response": ["|Abe Mitchell ||  || 77-76=153", "|align=center|5 || Abe Mitchell ||  || 77-76-75-77=305 || align=center|£10"]}, {"page": "1926 Open Championship", "response": ["|Abe Mitchell ||  || 78-78-72-71=299"]}, {"page": "1929 Open Championship", "response": ["Windy conditions on Friday caused scores to soar over the final two rounds. Diegel shot 82 in the morning, with Alliss and Abe Mitchell at 76 and 78, respectively. Hagen finished with two rounds of 75 for 292. Diegel was a shot behind runner-up Farrell in third place, while Alliss and Mitchell shared fourth at 300.", "| Abe Mitchell || ", "|align=center|3 || Abe Mitchell ||  || 72-72=144 || align=center|+4 ", "|Abe Mitchell ||  || 72-72-78=222", "|Abe Mitchell ||  || 72-72-78-78=300"]}, {"page": "1931 Open Championship", "response": ["|Abe Mitchell ||  || 77-74=151"]}, {"page": "1932 Open Championship", "response": ["|Abe Mitchell ||  || 77-71-75=223", "|Abe Mitchell ||  || 77-71-75-72=295"]}, {"page": "1933 Open Championship", "response": ["A group of four players shared the 54-hole lead at 216 (–3) at midday on Friday: Henry Cotton, Abe Mitchell, Syd Easterbrook, and Leo Diegel. Wood began the final round a stroke behind, while Shute was three back at even par. The final round was a disaster for the leaders as Easterbrook shot 77 (+4), while Cotton and Mitchell both carded 79 (+6). Shute and Wood tied for the clubhouse lead with rounds of 73 and 75, respectively. Diegel found the 18th green in two and needed only a two-putt to join the playoff. He left his first putt short, then completely missed the ball on his second attempt. The untimely mistake caused him to miss out on the playoff by a single stroke, as did American Gene Sarazen. In the final round Wood managed to hit a  drive at the 5th, but he found a bunker and lost a stroke on the hole.", "|rowspan=2 align=center|T3 || Abe Mitchell ||  || 74-68=142 || rowspan=2 align=center|−4 ", "|Abe Mitchell ||  || 74-68-74=216", "|Abe Mitchell ||  || 74-68-74-79=295"]}, {"page": "SYD2030", "response": ["Cameron Hunter, played by Abe Mitchell, lives the perfect life - heir to a legal legacy, top of the class, beautiful girlfriend - but even he has his secrets. So when his past comes back to get him, how long will it take before the truth's revealed?", "* Abe Mitchell as Cameron Hunter."]}, {"page": "October 1919", "response": ["* English golfer Abe Mitchell won the 12th News of the World Match Play, defeating Scottish golfer George Duncan by one stroke at the Walton Heath Golf Club in Surrey, England."]}, {"page": "List of Ryder Cup records", "response": ["| align=center| 9 & 8 || Abe Mitchell || Olin Dutra || Singles || 1933", "| align=center| 9 & 8 || Leo Diegel || Abe Mitchell || Singles || 1929"]}]}}