{"wiki_id": "http://www.wikidata.org/entity/Q466934", "itemLabel": "Frances Ruffelle", "itemDescription": "English theatre actress and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frances_Ruffelle", "wikipedia_page": {"main": "Frances Ruffelle (29 August 1965) is an English musical theatre actress and recording artist. She won a Tony Award in 1987, and represented the United Kingdom in the 1994 Eurovision Song Contest with the song \"Lonely Symphony (We Will Be Free)\", finishing 10th. The song became a UK Top 30 hit.\nIn 1984, Ruffelle starred as Dinah in the original West End production of Starlight Express. From 1985, she was the original Éponine in the first English-language productions of Les Misérables in the West End and on Broadway, winning the 1987 Tony Award for Best Featured Actress in a Musical. Other stage roles include Yonah in Children of Eden (1991), Roxie Hart in Chicago (2003–04, 2007), the title role in Piaf (2013), Bella in The A to Z of Mrs. P (2014), and Queenie in The Wild Party. Her albums include Fragile (1994), Frances Ruffelle (1998), Showgirl (2004), Imperfectly Me (2010), and I Say Yeh-Yeh (2015).", "link_mentions": [{"page": "Jesus Christ Superstar", "response": ["A 1996 radio production for BBC Radio 2 starred Tony Hadley as Jesus, Roger Daltrey as Judas, Frances Ruffelle as Mary Magdalene and Julian Clary as King Herod; this production was re-broadcast on BBC Radio 4 Extra on 6 August 2016."]}, {"page": "Martika", "response": ["Martika was encouraged by her agent to combine her love of film and music by scoring soundtracks and, in 1990, she wrote and recorded the song \"Blue Eyes Are Sensitive to the Light\" for the soundtrack to the film Arachnophobia. The producers of the album did not like her vocals and so the song was re-recorded by Sara Hickman for the film. The song has also been recorded by Brazilian singers Deborah Blando (on her 1991 debut, A Different Story), Elba Ramalho and Frances Ruffelle."]}, {"page": "Christopher Cross", "response": ["| style=\"text-align:left;\"| \"I Will (Take You Forever)\" (with Frances Ruffelle)"]}, {"page": "Eurovision Song Contest 1994", "response": ["| Frances Ruffelle"]}, {"page": "Chicago (musical)", "response": ["Like its Broadway counterpart, the London production featured many celebrities in the starring roles. For example, Marti Pellow, David Hasselhoff, John Barrowman, Tony Hadley, Jerry Springer, Kevin Richardson and Ian Kelsey have all played the role of Billy Flynn. Maria Friedman, Josefina Gabrielle, Denise Van Outen, Claire Sweeney, Linzi Hateley, Frances Ruffelle, Jennifer Ellison, Jill Halfpenny, Brooke Shields, Sally Ann Triplett, Bonnie Langford, Tina Arena, Ashlee Simpson, Aoife Mulholland, Michelle Williams and Christie Brinkley have all played Roxie Hart. Williams was the first African American woman to play the part of Roxie on the West End stage. James Doherty was a replacement as Amos.West End theatre program, published November 2003"]}, {"page": "Les Misérables (musical)", "response": ["| colspan=\"2\" style=\"text-align:center;\" | Frances Ruffelle", "The original London cast included Colm Wilkinson as Jean Valjean, Roger Allam as Javert, Ken Caswell as the Bishop of Digne, Patti LuPone as Fantine, Zoë Hart, Justine McIntyre, Jayne O'Mahony and Joanne Woodcock as Young Cosette, Danielle Akers, Gillian Brander and Juliette Caton as Young Éponine, Susan Jane Tanner as Madame Thénardier, Alun Armstrong as Thénardier, Frances Ruffelle as Éponine, Rebecca Caine as Cosette, Michael Ball as Marius, David Burt as Enjolras, with Ian Tucker, Oliver Spencer and Liza Hayden sharing the role of Gavroche.", "The musical then premiered on Broadway on 12 March 1987 at The Broadway Theatre. Colm Wilkinson and Frances Ruffelle reprised their roles from the London production. The $4.5 million production had a more than $4 million advance sale prior to its New York opening.", "The original Broadway cast included Colm Wilkinson as Jean Valjean, David Bryant as Marius, Judy Kuhn as Cosette, Michael Maguire as Enjolras, Frances Ruffelle as Éponine, Braden Danner as Gavroche, Donna Vivino as Young Cosette, Jennifer Butt as Madame Thénardier, Leo Burmester as Thénardier, Randy Graff as Fantine, Terrence Mann as Javert, and Chrissie McDonald as Young Éponine.", "The 2010 DVD/Blu-ray release of Les Misérables in Concert: The 25th Anniversary included an announcement of revised plans for a film adaptation which was later confirmed by Mackintosh. Tom Hooper signed on in March 2011 to direct the Mackintosh-produced film from a screenplay by William Nicholson. In June 2011, Working Title Films and Mackintosh announced that the film would begin principal photography in early 2012 for a tentative December release date. The film was given its general US release on Christmas Day 2012. Principal cast members include Hugh Jackman as Jean Valjean, Russell Crowe as Javert, Anne Hathaway as Fantine, Amanda Seyfried as Cosette, Eddie Redmayne as Marius, Samantha Barks as Éponine, Aaron Tveit as Enjolras, and Sacha Baron Cohen and Helena Bonham Carter as the Thénardiers. Other notable actors who played roles in the film include Bertie Carvel as Bamatabois, Colm Wilkinson, the original Valjean, as the Bishop of Digne, Hadley Fraser as the army general and Frances Ruffelle as a prostitute.", "The cast includes Colm Wilkinson as Valjean, Roger Allam as Javert, Patti LuPone as Fantine, Alun Armstrong as Thénardier, Susan Jane Tanner as Mme. Thénardier, Frances Ruffelle as Éponine, Ian Tucker as Gavroche, Michael Ball as Marius, David Burt as Enjolras, Rebecca Caine as Cosette and Zoë Hart", "The cast includes Colm Wilkinson as Valjean, Terrence Mann as Javert, Randy Graff as Fantine, Leo Burmester as Thénardier, Jennifer Butt as Madame Thénardier, Frances Ruffelle as Éponine, Braden Danner as Gavroche, David Bryant as Marius, Judy Kuhn as Cosette, Michael Maguire as Enjolras, and Donna Vivino as Young Cosette.\" 'Les Misérables' Original Broadway Cast\" castalbums.org, retrieved 15, 2019Gans, Andrew. \"Decca Broadway to Release Les Miz Highlights\" Playbill, 21 January 2003", "| Frances Ruffelle"]}, {"page": "Starlight Express", "response": ["The original cast included Stephanie Lawrence, Frances Ruffelle, Jeff Shankley, Jeffrey Daniel and Ray Shell.", "| style=\"text-align:center;\" |Frances Ruffelle"]}, {"page": "Anne Dudley", "response": ["*Frances Ruffelle – \"Stranger to the Rain\" single; "]}, {"page": "Lorna Luft", "response": ["In April 2009, Luft completed a successful U.K. tour of the critically acclaimed Hugh Whitemore play Pack of Lies, in which she played the role of Helen Kroger. She starred with Jenny Seagrove, Simon Shepherd and Daniel Hill. In May 2009, she appeared in W magazine as a special guest performer for the acclaimed avant-garde Theo Adams Company's latest project, \"Performance\", photographed by David Sims. In July 2009, she appeared at the Mermaid Theatre, London to record for the radio series Friday Night Is Music Night. Lorna Luft and Friends – A Tribute to Judy Garland also featured John Barrowman, Frances Ruffelle and Linzi Hateley."]}]}}