{"wiki_id": "http://www.wikidata.org/entity/Q4667527", "itemLabel": "Abi Phillips", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Abi_Phillips", "wikipedia_page": {"main": "Abigail Louise Phillips (born 14 January 1994) is an English actress and singer. She is best known for playing Liberty Savage in Channel 4 soap opera Hollyoaks and for her debut single \"Summer Sunshine\".", "link_mentions": [{"page": "Sutton Coldfield", "response": ["*Abi Phillips – actress in the Hollyoaks TV series"]}, {"page": "1994 in the United Kingdom", "response": ["* 14 January – Abi Phillips, singer-songwriter and actress"]}, {"page": "T4 on the Beach", "response": ["At the event, the cast of Hollyoaks filmed a special episode, in which Liberty Savage (Abi Phillips) performs live on the T4 stage, while Ethan Scott (Craig Vye) and Theresa McQueen (Jorgie Porter) are kissing behind her back."]}, {"page": "Theresa McQueen", "response": ["When Theresa is home alone, she hears a knock on the door, she goes to answer it but there is no one there, she walks up to the bins and finds a black balloon with a picture of a fox on it, she goes back in the house and finds Warren, who accuses her of telling someone that he forced a weak man into the burning building after he escaped, revealing to the viewers that she knew the whole time that Warren wasn't dead. Warren recaps on how he escaped the fire, forcing her for answers of who she told, he threatens to drop her off the village wall arch, this leads her to confess that she killed Calvin. Police officer Ethan Scott (Craig Vye) arrives at the McQueens' home to question Carmel over Warren's fake death. He and Theresa talk and he later brings Kathleen to the McQueens' after she is caught using fake money. Ethan agrees not to arrest Kathleen if Theresa goes for a drink with him. Kathleen discovers the baby is Calvin's child and Theresa admits to killing him. She makes friends with Liberty Savage (Abi Phillips) and soon after discovers she is Ethan's fiancée. When Carmel arranges to christen the baby \"Angel\" without Theresa's consent, Kathleen is furious and brings her priest boyfriend round to conduct her granddaughter's christening in secret, and the baby is christened as \"Kathleen Khloe Angel McQueen\". After the christening, Mercedes reminds Carmel that if she doesn't want to go to jail, then she will comply with her demands. Heeding her sister's warning to save herself from going to prison, Carmel agrees to let Theresa keep her daughter."]}, {"page": "Rae Wilson", "response": ["Rae was involved in a relationship storyline with Ethan Scott (Craig Vye), who was already romancing both Liberty Savage (Abi Phillips) and Theresa McQueen (Jorgie Porter). Viewers were initially unaware that Rae was seeing Ethan, but knew that he was cheating on Theresa and Liberty with an unknown third woman. Porter said Theresa, her character, was incredulous when she saw Ethan kissing Rae. Barlow was also surprised by the twist; she had not expected Rae to be involved. Once the three women discovered the truth about Ethan's infidelity, they decided that \"the best revenge is humiliation\", exposed Ethan's lies and poured gunge over him in front of the entire village. Vye described the storyline as a \"classic case of wanting what you can't have\". He explained that Ethan was not ready to settle down and would end up alone."]}, {"page": "List of Hollyoaks characters (2010)", "response": ["Ethan arrests and questions Warren Fox (Jamie Lomas), convinced he faked his own death. He goes to question Carmel Valentine (Gemma Merna), but instead talks to Carmel's cousin Theresa McQueen (Jorgie Porter). After he catches Kathleen McQueen (Alison Burrows) trying to use fake money, Ethan takes her to the McQueen's and asks Theresa if she wants to go with him for a drink. Theresa soon takes a shine to him, but when she meets a woman named Liberty Savage (Abi Phillips) at her school for enrollment, he appears at the school gates; waiting for Liberty. She then identifies him as her fiancé, leaving Theresa slightly heartbroken. Ethan continues to be suspicious of Theresa. Theresa and her daughter, Kathleen-Angel were kidnapped by Kyle Ryder (Neil Toon), Ethan and Kyle get in a fight which leads to Ethan falling down an elevator shaft breaking his leg. Theresa then tells Ethan that she killed Calvin Valentine (Ricky Whittle).", "Liberty Savage is a fictional character from the British Channel 4 soap opera Hollyoaks, played by actress and singer-songwriter Abi Phillips. She made her first on-screen appearance on 10 December 2010. Phillips was approached by Hollyoaks producers after she submitted one of her songs to be played on the show. Following a strong response to the song, producers invited her to audition for the role of Liberty, in which she was successful. Liberty was introduced to Hollyoaks along with her fiancé, Ethan Scott (Craig Vye)."]}, {"page": "Phillips (surname)", "response": ["*Abi Phillips (born 1994), English actress"]}, {"page": "Liberty Savage", "response": ["Liberty Savage is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by actress and singer-songwriter Abi Phillips from 2010 to 2013, and Jessamy Stoddart from 2018. She made her first on-screen appearance on 10 December 2010. Phillips was approached by Hollyoaks producers after she submitted one of her songs to be played on the show. Following a strong response to the song, producers invited her to audition for the role of Liberty, in which she was successful. Liberty was introduced to Hollyoaks along with her fiancé, Ethan Scott (Craig Vye). After an absence of four months during 2013, it was  announced that Liberty would be written out of the serial, and she departed on 24 July 2013. On 22 May 2018, it was announced that Liberty would return, but this time with Stoddart in the role, and she  returned on 5 June 2018."]}, {"page": "List of Hollyoaks characters (2011)", "response": ["Will Savage, played by James Atherton, is the brother of Liberty Savage (Abi Phillips). He made his first on-screen appearance on 7 April 2011.", "Dirk Savage, played by David Kennedy, is the father of Liberty (Abi Phillips) and Will Savage (James Atherton) and adoptivefather of Dodger Savage (Danny Mac). He made his first on-screen appearance on 15 April 2011. In 2018, the actor made a shock exit on 25 July when the character is killed off, making the fourth Savage family member to be killed off since his wife Anna in 2013, his son Will and brother Dr. Charles Savage.", "In November 2011, it was announced that Rob would be involved in a storyline in which he is run over by Ethan Scott (Craig Vye), who is using his mobile phone while driving. The storyline was to highlight the danger of text messaging while driving, making light of the fact that doing so increases the risk of a car accident by \"23 times\". Hollyoaks partnered with the independent road safety charity Brake for the storyline, which helped launch \"Road Safety Week\". The charity's director, Julie Townsend, said that \"too many young lives are lost and ruined through road crashes\". They added that it was important for television programmes such as Hollyoaks to highlight \"appalling consequences of crashes\". On screen, the storyline plays out when Ethan is texting Theresa McQueen (Jorgie Porter) and Liberty Savage (Abi Phillips) while driving. Ethan is not keeping an eye on the road and Rob steps out and Ethan accidentally run him over. The serial remained secretive about whether or not Rob survives the accident.", "In March 2012, it was announced thart Daytona Lights would return to the series. The band filmed scenes at the Blue Planet Aquarium in Cheshire. Rebecca Wade who works for the aquarium, told Laurie Stocks-Moore of the Ellesmere Port Pioneer that the band had filmed at a number of locations in the attraction, but said the storyline had to remain a secret. The regular characters of Dodger (Danny Mac), Liberty (Abi Phillips) and Dennis Savage (Joe Tracini) also took part in the scenes; which aired later in 2012.", "Soap opera magazine Inside Soap later revealed Dennis' relation to the rest of the Savage family, as being a cousin of Liberty (Abi Phillips), Dodger (Danny Mac) and Will Savage (James Atherton). Dodger is not pleased to see his cousin and does not want him living in his caravan. Dodger convinces Texas Longford (Bianca Hendrickse-Spendlove) and Leanne Holiday (Jessica Forrest) to let Dennis move in with them. Digital Spy said Dennis arrives being \"confident and full of beans\" and said he looks likely to \"cause a stir\".", "| rowspan=\"2\" |  British rapper Fugative and television presenter Georgie Okell make a special cameo appearance backstage at T4 on the Beach, where Liberty Savage (Abi Phillips) is preparing to perform."]}, {"page": "Sam Gray (musician)", "response": ["Samuel Gray is an English singer and songwriter from Hull, England, who has composed songs for a multitude of artists including Hardwell, DJ Katch, Solano, Abi Phillips (from the British soap opera Hollyoaks), Manovski, Ben Saunders, Alle Farben, Julian Martel, The Magician, Julian Perretta, Nile Rodgers, and Tobtok, garnering over 100 million streams in the process along with multiple top chart hits around the world."]}, {"page": "Dodger Savage", "response": ["Mark \"Dodger\" Savage (born Mark Blake) is a fictional character from the British Channel 4 serial drama, Hollyoaks, played by Danny Mac. He made his first on-screen appearance on 7 April 2011 and was introduced as part of the Savage family by creator Paul Marquess. Dodger is played as being a bit \"cocky\" and as thinking he has \"got it all\". For his portrayal, Mac has won and been nominated for various awards. In November 2014 Mac opted to leave the role and Dodger on screen on 20 January 2015. Dodger was the biological son of Patrick Blake (Jeremy Sheffield) and Anna Blake (Saskia Wickham), the twin brother of Sienna Blake (Anna Passey), the adoptive son of Anna's husband Dirk Savage (David Kennedy), the half-brother of Will Savage (James Atherton), Liberty Savage (Abi Phillips) and Minnie Minniver and the father of Nico Blake (Persephone Swales-Dawson) and Myra-Pocahontas Savage-McQueen.", "In March 2011, it was announced that Liberty Savage's (Abi Phillips) family would be introduced to Hollyoaks. Actor Danny Mac was cast in the role of Dodger Savage, the half-brother of Liberty and Will (James Atherton) and the adopted son of Dirk (David Kennedy), following a stint in the West End musical Wicked. Of his casting, Mac commented: \"I am over the moon, the last few weeks have been crazy and Dodger's kept me on my toes every second. It's exciting never knowing what he's going to get up to next, and believe me the limits are endless. I can't wait for people to meet him! [...] I am proud to be a Savage and live in anticipation every moment to see what the next move is for the family!\" Of the family and their introduction, a Hollyoaks spokesperson added: \"The new family will take the village by storm and are set to rub all the McQueens up the wrong way. The Savage family get evicted from their home when Dirk can't keep up with the payments. [...] big brother Dodger has a new house for them to live in! While the McQueens are away on holiday, Dodger moves his family into the empty house and declares squatters' rights!\""]}]}}