{"wiki_id": "http://www.wikidata.org/entity/Q4679393", "itemLabel": "Adam Lehan", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Lehan", "wikipedia_page": {"main": "Adam Lehan is a British musician from Batley, West Yorkshire, England, who has worked with doom metal bands Cathedral and Workshed, thrash metal bands Acid Reign,  Deadline and Lord Crucifier and folk band Beneath the Oak.", "link_mentions": [{"page": "Cathedral (band)", "response": ["* Adam Lehan – guitars (1989–1994)"]}, {"page": "Acid Reign", "response": ["In 1987, the band released the Moshkinstein demo. On the strength of this recording, they were picked up by British thrash metal label Under One Flag (a subsidiary of Music for Nations) in 1988 who released the Moshkinstein EP. Following this release, Jennings was replaced by another future Cathedral member, Adam Lehan (formerly of Lord Crucifier), and the band gained support slots opening for such acts as Flotsam and Jetsam and Death Angel.  Acid Reign struck up a friendship with label mates Nuclear Assault and Exodus, and toured the UK and Europe as support to the Survive and Fabulous Disaster tours.", "*Adam Lehan – guitar (1989–1990)"]}, {"page": "Forest of Equilibrium", "response": ["* Adam Lehan – guitar, acoustic guitar"]}, {"page": "The Ethereal Mirror", "response": ["* Adam Lehan – guitar"]}, {"page": "Cosmic Requiem", "response": ["* Adam Lehan – guitars"]}, {"page": "The Serpent's Gold", "response": ["* Adam Lehan – bass (disc 2: 7), guitar (disc 1: 1, 3–6, 9, 10, 12, 15, disc 2: 1–3, 5, 7, 12)"]}, {"page": "Statik Majik", "response": ["* Adam Lehan – guitar"]}, {"page": "Lehan", "response": ["*Adam Lehan, British guitarist"]}, {"page": "In Memorium", "response": ["* Adam Lehan – guitar"]}, {"page": "Garry Jennings", "response": ["Jennings formed Acid Reign in 1985, along with Howard \"H\" Smith, Kevin \"Kev\" Papworth, Ian Gangwer and Mark Ramsey Wharton, while attending Harrogate High School (then-called \"Granby\"). After recording their debut EP, Jennings departed from the band in 1988, being replaced by Adam Lehan. Then in 1989, Jennings was contacted by ex-Napalm Death vocalist Lee Dorian with the proposition of forming a band together, which would end up becoming Cathedral, and would also include then-Acid Reign guitarist Adam Lehan. In 1994, Jennings would briefly form a band called Septic Tank with Lee Dorrian, Repulsion vocalist and bassist Scott Carlson and Trouble drummer Barry Stern. Cathedral would announce their breakup shortly after the release of their 2013 album The Last Spire, leading to Jennings reforming Septic Tank, this time with Jaime \"Gomez\" Arellano, due to Barry Stern's death in 2005. In 2014, Jennings released the self-titled album for a band he formed in 2010 called \"Death Penalty\". Jennings would also form a band called Lucifer with Andy Prestidge of Angel Witch and Johanna Sadonis, formerly of the Oath; however, Jennings would later depart from the band, being replaced by ex-Entombed drummer Nicke Andersson."]}, {"page": "Mark Wharton", "response": ["Wharton formed Acid Reign in 1985, along with Kevin \"Kev\" Papworth, Ian Gangwer, Howard \"H\" Smith and Gaz Jennings, whom he had met at Granby High School in Harrogate Acid Reign eventually broke up in 1991 after the release of their 1990 album \"Obnoxious\", leading to Wharton joining his ex-Acid Reign bandmates Gaz Jennings and Adam Lehan in Cathedral in 1992. Wharton then proceeded to form the band Asomvel with Jay-Jay Winter (whom he had played with in an early band, called \"Lochenbar\") and Lenny Robinson in 1993. At this time, Wharton would also join Venom vocalist Conrad Lant's eponymous band Cronos, however, by 1996 Wharton was no longer present in any of these projects."]}, {"page": "Workshed", "response": ["Workshed is an English heavy metal band formed in Harrogate in 2014. The band consists of former Cathedral and Acid Reign members Adam Lehan and Mark Wharton, and Helen Storer. Their debut self-titled album, recorded by Jaime Arellano, was released on 13 September 2019 through Rise Above Records.", "*Adam Lehan – vocals, guitar (2014–present), bass (2014–2019)"]}, {"page": "Lehan, Adam", "response": ["#redirectAdam Lehan"]}]}}