{"wiki_id": "http://www.wikidata.org/entity/Q4679044", "itemLabel": "Adam Fergusson", "itemDescription": "British politician (born 1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Fergusson_(MEP)", "wikipedia_page": {"main": "Adam Dugdale Fergusson (born 10 July 1932) is a British journalist, author and Conservative Party politician who served one term in the European Parliament as an MEP. He has remained involved in the field of European Union affairs since, as a Special Adviser to Conservative governments and as a business consultant. Among other books, he wrote When Money Dies, a classic account of hyperinflation in the Weimar Republic. It deals with not only the economic impacts that hyperinflation had upon society in the Weimar Republic, but also the way that society itself changed. Societal norms were broken down in the wake of hyperinflation, and Fergusson approaches this topic. First published in 1975, When Money Dies was hailed as a cult classic in the wake of the Financial crisis of 2007–2008, with copies changing hands on eBay for up to $1,000. As a result, When Money Dies was republished in July 2010, becoming an internet sensation after allegedly being commended by financier, Warren Buffett.", "link_mentions": [{"page": "Gresham's law", "response": ["Adam Fergusson and Costantino Bresciani-Turroni (in his book Le vicende del marco tedesco, published in 1931) pointed out that, during the great inflation in the Weimar Republic in 1923, , as the official money became so worthless that virtually nobody would take it. That was particularly serious because farmers began to hoard food. Accordingly, any currency backed by any sort of value became a circulating medium of exchange. In 2009, hyperinflation in Zimbabwe began to show similar characteristics."]}, {"page": "Pro-Euro Conservative Party", "response": ["The party received an endorsement in The Independent from writer A. N. Wilson, as well as support from Paul Howell, a former Conservative MEP who had been a speechwriter for Margaret Thatcher and Edward Heath, and Sir Anthony Meyer, a former MP and the \"stalking horse\" candidate against Margaret Thatcher in 1989. After William Hague ruled out Britain joining the euro under a Conservative government, former cabinet minister Lord Gilmour of Craigmillar said he would vote for the PECP. Four former Conservative MPs – Sir Julian Critchley, Sir Nicholas Scott, Sir David Knox, and Sir Robert Hicks – and four former MEPs – Margaret Daly, Adam Fergusson, Madron Seligman and Anthony Simpson – wrote in a letter to The Times that \"We would have wished that William Hague's party had put forward a manifesto more like that of the Pro Euro Conservative Party. Like many Conservatives, we shall find it very difficult to know how best to cast our vote on 10 June.\" The Conservative Party threatened to expel any members who supported the PECP, and did expel Critchley and Gilmour a fortnight after the election."]}, {"page": "Tory Reform Group", "response": ["* Pro-Euro Conservative Party: John Stevens MEP, Brendan Donnelly MEP, Ian Gilmour, Tim Rathbone, Sir Julian Critchley, Nicholas Scott, David Knox MP, Robert Hicks, Margaret Daly, Adam Fergusson, Madron Seligman, Anthony Simpson"]}, {"page": "Royal Society of Literature", "response": ["| Adam Fergusson MEP"]}, {"page": "1970 in architecture", "response": ["* September 23–29 – Adam Fergusson's essay criticising inappropriate development in the historic English city of Bath, Somerset, \"The Sack of Bath\", is published in The Times newspaper by the editor William Rees-Mogg, a landmark in concern for architectural conservation in Britain. The series is subsequently expanded into a book with photographs by Snowdon and verses by John Betjeman – "]}, {"page": "List of members of the European Parliament for the United Kingdom (1979–1984)", "response": ["|Adam Fergusson"]}, {"page": "Scotland (European Parliament constituency)", "response": ["| Adam FergussonConservative"]}, {"page": "Adam Fergusson", "response": ["Adam Fergusson may refer to:", "*Adam Fergusson (d.1862) (1783–1862), early Canadian politician", "*Sir Adam Fergusson, 3rd Baronet (1733–1813), British Member of Parliament for Ayrshire and Edinburgh", "*Adam Fergusson (MEP) (born 1932), Member of European Parliament for Strathclyde East, 1979–1984"]}, {"page": "Strathclyde West (European Parliament constituency)", "response": ["| Adam Fergusson || Conservative"]}, {"page": "Adam Dugdale Fergusson", "response": ["#REDIRECT Adam Fergusson (MEP) "]}, {"page": "Timeline of Bath, Somerset", "response": ["** 23–29 September: Adam Fergusson's essay criticising inappropriate development, \"The Sack of Bath\", is published in The Times newspaper by the editor William Rees-Mogg; it is subsequently expanded into a book with photographs by Snowdon and verses by John Betjeman."]}, {"page": "Sir James Fergusson, 8th Baronet", "response": ["*Letters of George Dempster to Sir Adam Fergusson (1934)", "They had two sons: Charles who became 9th Baronet of Kilkerran, and Adam Fergusson (MEP). They had two daughters: Alice, who married Tim Renton, Baron Renton of Mount Harry; and Christian who died in a car crash aged 14."]}, {"page": "James Fergusson (author)", "response": ["Fergusson was born in London, the son of the Scottish journalist, author and MEP, Adam Fergusson, and Penelope Hughes (d.2009). He was educated at Eton College and Brasenose College, Oxford."]}, {"page": "The Sack of Bath", "response": ["The Sack of Bath: A Record and an Indictment is a book written by Adam Fergusson in 1973 about the destructive urban redevelopment of the city of Bath in the 1970s. The original newspaper pieces that the book comprises inspired a resurgence in architectural conservation in the United Kingdom and gave additional strength to the Bath Preservation Trust.", "thumb|St Ann's Place in 2018, which Lord Snowdon and Adam Fergusson photographed in March 1972 for the book, and was subsequently restored", "* The Sack of Bath by Adam Fergusson "]}, {"page": "List of Cambridge History Faculty alumni", "response": ["*Adam Fergusson"]}]}}