{"wiki_id": "http://www.wikidata.org/entity/Q467927", "itemLabel": "John Taylor", "itemDescription": "British jazz pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Taylor_(jazz)", "wikipedia_page": {"main": "John Taylor (25 September 1942 – 17 July 2015) was a British jazz pianist, born in Manchester, England, who occasionally performed on the organ and the synthesizer.", "link_mentions": [{"page": "July 17", "response": ["*  2015   – John Taylor, English pianist and educator (b. 1942)"]}, {"page": "Paolo Fresu", "response": ["* 1993 Contos with Furio Di Castri, John Taylor (EGEA, 1993)"]}, {"page": "September 25", "response": ["*  1942   – John Taylor, English pianist and educator (d. 2015)"]}, {"page": "Bill Evans", "response": ["Evans has left his mark on such players as Chick Corea, Diana Krall, Ralph Towner, Herbie Hancock, John McLaughlin, John Taylor, Steve Kuhn, Vince Guaraldi, Don Friedman, Marian McPartland, Denny Zeitlin, Paul Bley, Bobo Stenson, Warren Bernhardt, Michel Petrucciani, Lenny Breau, Keith Jarrett, Vicente Inti Jones Alvarado, and Rick Wright of Pink Floyd, as well as many other musicians worldwide. The music of Bill Evans continues to inspire younger pianists including Fred Hersch, Bill Charlap, Lyle Mays, and Eliane Elias and arguably Brad Mehldau early in his career."]}, {"page": "John Taylor", "response": ["John Taylor, Johnny Taylor or similar may refer to:", "*John Taylor (Oxford), Vice-Chancellor of Oxford University, 1486–1487", "*John Taylor (classical scholar) (1704–1766), English classical scholar", "*John Taylor (English publisher) (1781–1864), British publisher and Egypt scholar", "*John Taylor, architect of the UK e-Science programme", "*John Taylor, President of University of Pittsburgh", "*John Taylor (mathematician) (born 1664), English mathematician and traveler", "*John Taylor (pathologist) (1932–2010), Canadian and English pathologist and medical researcher ", "*John Taylor (oculist) (1703–1772), surgeon and medical charlatan", "*John Taylor (actor), known for The Ringer", "*John Taylor (documentary filmmaker) (1914–1992), British documentary filmmaker", "*John Taylor (presenter), Australian television presenter", "*John Taylor (voice actor), voice of Sal the space octopus in Astroblast!", "*John Taylor (painter) (c. 1585–1651), artist and friend of Shakespeare", "*John Taylor (1739–1838), English portrait artist", "*John Taylor (poet) (1578–1653), English pamphleteer, poet and waterman", "*John Taylor (journalist) (1757–1832), English oculist, drama critic, editor and newspaper publisher", "*John Taylor (bass guitarist) (born 1960), British bassist for Duran Duran ", "*John Taylor (composer), wrote music for Charlie Girl", "*John Taylor (Geordie songwriter) (1840–1891), songwriter and poet", "*John Taylor (guitarist), lead guitarist for British alternative rock band Young Guns", "*John Taylor (jazz) (1942–2015), English pianist", "*John Taylor (Scottish fiddler), Scottish fiddler from Buckie, appeared in So I Married an Axe Murderer", "*John Taylor (Unitarian hymn writer) (1750–1826), poet and composer from Norwich, England", "*John Taylor (born 1963), Jamaican dancehall musician better known as Chaka Demus.", "*John Taylor (bookseller) (fl. 1710s), English bookseller and publisher in St. Paul's Churchyard, London", "*John Taylor (manufacturer) (1704–1775), English manufacturer and banker of Birmingham", "*John Taylor (civil engineer) (1779–1863), English mining engineer and engineer of the Tavistock Canal", "*John Taylor (paper manufacturer) (1809–1871), Canadian pioneer in the pulp and paper industry", "*John Taylor (architect) (1833–1912), British architect", "*John Taylor (Taylor Ham) (1837–1909), American food inventor and entrepreneur", "*John Taylor (trader) (died 1898), Creole trader killed during Sierra Leone's Hut Tax War", "*John Taylor (Velocette) (fl. 1900s), founder of Veloce Ltd. motorcycle firm", "*John Taylor (inventor) (born 1933), horologist and inventor of controls for electric kettles", "*John Taylor (Australian politician) (1908–1961), Member of the Queensland Legislative Assembly", "*John Taylor (public servant) (1930–2011), senior Australian public servant", "*John Taylor (Manitoba politician) (1834–1925), MLA in Manitoba", "*John Taylor (Nova Scotia politician) (1816–1881), Liberal MHA for Halifax County", "*John Taylor (fl. 1385–1401), MP for Reigate", "*John Taylor (by 1493–1547 or later), MP for Hastings", "*John Taylor (by 1533–1568), MP for Lichfield", "*John Taylor (1655–1729), MP for Sandwich", "*John Taylor, Baron Ingrow (1917–2002),  life peer, brewer and politician, former Lord Lieutenant of West Yorkshire", "*John Taylor, Baron Kilclooney (born 1937), Northern Ireland politician", "*John Taylor, Baron Taylor of Holbeach (born 1943), Conservative life peer and director of Taylor's Bulbs of Spalding", "*John Taylor, Baron Taylor of Warwick (born 1952), Conservative ", "*John Taylor (Dumbarton Burghs MP) (1857–1936), Liberal MP for Dumbarton Burghs, 1918–1922", "*John Taylor (West Lothian MP) (1902–1962), Labour MP 1951–1962", "*John Taylor (Solihull MP) (1941–2017)", "*John Taylor (trade unionist) (1861/2–1942), councillor in Dudley", "*John Taylor (South Carolina governor) (1770–1832), American politician from South Carolina", "*John Taylor (14th Congress), American politician from South Carolina", "*John Taylor of Caroline (1753–1824), American politician & scholar from Virginia", "*John Taylor (Mississippi judge) (died 1821), justice of the first Mississippi Supreme Court", "*John Taylor (19th-century Iowa politician) (born 1808), member of the Iowa Territorial Legislature and Iowa House of Representatives", "*John Taylor (20th-century Iowa politician) (born 1870), member of the Iowa House of Representatives and Iowa Senate", "*John Taylor (Medal of Honor), American Civil War sailor and Medal of Honor recipient", "*John Taylor (Royal Navy) (1775–1848), Scottish sailor who served with Nelson then emigrated to Canada", "*John Taylor (VC) (1822–1857), English sailor", "*John Taylor (archivist) (1921–2008), American military archivist at the National Archives", "*John Taylor (pirate) (fl. 1718–1723), pirate active in the East Indies and Indian Ocean", "*John Taylor (criminal) (born 1956), British convicted murderer and rapist", "*John Taylor, male alias of British woman Mary Anne Talbot (1778–1808), who was a sailor and soldier", "*John Taylor (Master of the Rolls) (c. 1480–1534), British religious leader & jurist", "*John Taylor (bishop of Lincoln) (c. 1503–1554), British religious leader, Bishop of Lincoln", "*John Taylor (dissenting preacher) (1694–1761), English Presbyterian theologian", "*John Taylor (Unitarian hymn writer) (1750–1826), businessman and hymn composer (grandson of above)", "*John Taylor (Baptist preacher) (1752–1833), Baptist preacher in Kentucky", "*John Taylor (missionary in South Africa) (1767–?), first British missionary to settle in South Africa", "*John Taylor (Mormon) (1808–1887), third president of The Church of Jesus Christ of Latter-day Saints, 1880–1887", "*John Taylor (doctor) (died 1821), missionary in India", "*John Taylor (bishop of Sodor and Man) (1883–1961), Church of England bishop, and father of the below Bishop of Winchester", "*John Taylor (bishop of Sheffield) (1912–1971), Bishop of Sheffield in the Church of England", "*John Taylor (bishop of Winchester) (1914–2001), Anglican missionary scholar, and son of the above Bishop of Sodor and Man", "*John Taylor (bishop of St Albans) (1929–2016), British priest, Bishop of St Albans, 1980–1995", "*John Taylor (bishop of Glasgow and Galloway) (1932-2021), British priest, Scottish Episcopal Church, Bishop of Glasgow and Galloway, 1991–1998", "*John Taylor (Australian footballer) (born 1963), Australian football player", "*John Taylor (rugby union, born 1949) (born 1949), rugby union footballer for Australia", "*John Taylor (cricketer, born 1979), former Western Australia cricketer", "*John Taylor (athlete) (1882–1908), runner; first African American Olympic gold medalist", "*John Taylor (American football) (born 1962), football player", "*John Taylor (baseball) (birth/death dates unknown), Negro leagues baseball player", "*John Taylor (volleyball) (born 1944), American former volleyball player", "*John Taylor (basketball) (born 1989), American professional basketball player", "*John Taylor (cricketer, born 1849) (1849–1921), former Nottinghamshire cricketer", "*John Taylor (cricketer, born 1850) (1850–1924), former Yorkshire cricketer", "*John Taylor (cricketer, born 1923) (1923–1991), former Hampshire cricketer", "*John Taylor (cricketer, born 1937), English cricketer", "*John Taylor (Welsh footballer) (1874–?), Wrexham A.F.C. and Wales international footballer", "*John Taylor (footballer, born 1924), English footballer", "*John Taylor (footballer, born 1926), English footballer", "*John Taylor (footballer, born 1928), English footballer", "*John Taylor (footballer, born 1931), English footballer", "*John Taylor (footballer, born 1935), English footballer", "*John Taylor (footballer, born 1939), English footballer", "*John Taylor (English footballer, born 1949), English footballer with Chester City, Rochdale and Stockport County", "*John Taylor (Scottish footballer, born 1949), Scottish football goalkeeper", "*John Taylor (footballer, born 1964), English footballer with Cambridge United and Bradford City", "*John Taylor (racing driver) (1933–1966), British racing driver", "*John Taylor (rallycross) (born 1941), Scottish rallycross (European champion 1973) and rally driver", "*John Taylor (rugby league), rugby league footballer of the 1950s and 1960s", "*John Taylor (rugby union, born 1945) (born 1945), rugby union footballer for British Lions, Wales, Loughborough Colleges, London Welsh, London Counties, and Surrey", "*John Taylor (swimmer) (1904–?), British freestyle swimmer", "*John Taylor (cross-country skier) (born 1908), Canadian Olympic skier", "*John Taylor (hurler), Laois and Portlaoise hurler", "*John Taylor (All Black), rugby player, see List of All Blacks", "*John Taylor (Canadian football) (1925–2005), Canadian Football League player", "*John Taylor, protagonist of the Nightside books by Simon Green", "*John Taylor, one of the protagonists in Call of Duty: Black Ops III, a 2015 video game", "*John Taylor (Nigerian judge) (1917–1973), Nigerian judge", "*Sir John Taylor, 1st Baronet (1745–1786), dilettante", "*John Taylor & Co, English bell foundry", "*John Taylor Collegiate, public high school in Winnipeg, Manitoba, Canada", "*John Taylor (given name)"]}, {"page": "Soft Machine", "response": ["The Soft Machine name was used for the 1981 record Land of Cockayne (with Jack Bruce on bass and, again, Allan Holdsworth on guitar, plus Ray Warleigh and Dick Morrissey on saxes and John Taylor on electric piano), and for a final series of dates at London's Ronnie Scott's Jazz Club in the summer of 1984, featuring Jenkins and Marshall leading an ad hoc lineup of Etheridge, Warleigh, pianist Dave MacRae and bassist Paul Carmichael.", "| Holdsworth, Warleigh, Alan Parker, John Taylor, Jack Bruce, Dick Morrissey"]}, {"page": "Eric Vloeimans", "response": ["Although he studied classical music as a child, he became interested in jazz at the Rotterdam Academy of Music. After graduating in 1988, he moved to New York City and studied trumpet with Donald Byrd. He was a member of big bands led by Mercer Ellington and Frank Foster. In the 1990s, he recorded the album Bitches and Fairy Tales (1999) with Marc Johnson, Joey Baron, and John Taylor. Vloeimans has also worked with Kinan Azmeh, Michiel Borstlap, Lars Danielsson, Jimmy Haslip, Joe LaBarbera, Nguyen Le,  Ernst Reijseger, and Bugge Wesseltoft. "]}, {"page": "Music of the United Kingdom (1970s)", "response": ["Carl Douglas got #1 hits \"Kung Fu Fighting\" (1974), and Biddu Orchestra records also appeared in the charts. \"Kung Fu Fighting\" in particular sold eleven million records worldwide. Popularity of British jazz from the 1950s, 1960s with Kenny Ball and Chris Barbar, UK jazz continued with innovative music scene. Some of the technical musicians during this period include guitarist John McLaughlin and Dave Holland (both of whom joined Miles Davis's group), pianists Keith Tippett and John Taylor, saxophonists Evan Parker, Mike Osborne, and the Canadian-born trumpeter Kenny Wheeler who had settled in Britain.W. Kaufman, H. Slettedahl Macpherson, Britain and the Americas: culture, politics, and history (ABC-CLIO, 2005), pp. 504–5.A. Blake, The land without music: music, culture and society in twentieth-century Britain (Manchester: Manchester University Press, 1997), p. 149. In the 1970s a notable development was the creation of various British jazz rock bands like Soft Machine, Nucleus, Colosseum, Henry Cow(avant garde band), National Health and Ginger Baker's Air Force, making it a major influence on progressive rock music.E. Macan, Rocking the classics: English progressive rock and the counterculture (Oxford: Oxford University Press US, 1997), p. 132."]}, {"page": "Joey Baron", "response": ["With John Taylor"]}, {"page": "Steve Swallow", "response": ["*Parlance (Instant Present, 1995) with John Taylor"]}, {"page": "Kenny Wheeler", "response": ["Wheeler was the trumpeter in the Anthony Braxton Quartet from 1971 to 1976. He was also a member of the chamber jazz trio Azimuth with John Taylor and Norma Winstone from 1977 to 2000. Their first release under this name was a 1977 album issued by ECM; two albums followed, with later albums coming in 1985 and 1995.", "* 2004: Where Do We Go from Here? (CAM Jazz) with John Taylor", "* 2008: Other People (CAM Jazz) with Hugo Wolf String Quartet featuring John Taylor", "* 2011: One of Many (CAM Jazz) with John Taylor and Steve Swallow", "===Collaborations with John Taylor===", "* The Maritime Jazz Orchestra: Now and Now-Again (Justin Time, 2002; recorded 1998) with Norma Winstone and John Taylor"]}, {"page": "Tony Oxley", "response": ["* Live at Roccella Jonica with Norma Winstone, Kenny Wheeler, Paolo Fresu, John Taylor, Paolo Damiani (Ismez/Polis Music, 1985)"]}, {"page": "Gone to Earth (David Sylvian album)", "response": ["*John Taylor – piano (A2)"]}, {"page": "John Dankworth", "response": ["Dankworth's friendship with trumpeter Clark Terry led to Terry's being a featured soloist on Dankworth's 1964 album The Zodiac Variations, together with Bob Brookmeyer, Zoot Sims, Phil Woods, Lucky Thompson and other guests. Other Dankworth recordings during this period featured many other respected jazz names. Some were full-time members of the Dankworth band at one time or another, like Tony Coe, Mike Gibbs, Peter King, Dudley Moore, George Tyndale, Daryl Runswick, John Taylor and Kenny Wheeler, while others such as Dave Holland, John McLaughlin, Tubby Hayes and Dick Morrissey were occasional participants."]}, {"page": "John Surman", "response": ["Many of the musical relationships he established during the 1970s continued for decades. These include a quartet with pianist John Taylor, bassist Chris Laurence, and drummer John Marshall; duets and other projects with Norwegian singer Karin Krog (Surman's long-term partner); and duets and other projects with American drummer/pianist Jack DeJohnette.", "* Morning Glory with John Marshall, Terje Rypdal, Chris Laurence, John Taylor, Malcolm Griffiths (Island, 1973)", "* 1992 Ambleside Days, John Taylor (Ah Um)"]}, {"page": "Ian Carr", "response": ["*1993: Sounds and Sweet Airs (That Give Delight and Hurt Not) (with John Taylor)"]}, {"page": "Tommy Smith (saxophonist)", "response": ["* 2003 Evolution with (John Scofield), (Joe Lovano), (John Taylor), (John Patitucci), (Bill Stewart) (Spartacus)"]}, {"page": "Nucleus (band)", "response": ["* John Taylor – organ"]}, {"page": "British jazz", "response": ["There was also a growth in free jazz inspired by European models more than from American music. It helped to influence the development of a strong European identity in this field. South African and free jazz influences came together in projects like the Brotherhood of Breath big band, led by McGregor. Added to this, more musicians had been raised on rhythm and blues or English forms of rock and roll, which became increasingly significant to the genre. These influences mixed in a way that led to British contemporary jazz of the time developing a distinctive identity distancing it to some extent from American styles. Highly original jazz composers such as Mike Westbrook, Graham Collier, Michael Garrick and Mike Gibbs began to make major contributions during the period and after. The local scene was not unaffected by, what elsewhere came to be known as, the British Invasion; the jazz audience was in numerical decline at this time. One branch of this development was the creation of various British jazz fusion bands like Soft Machine, Nucleus, Colosseum, If, Henry Cow, Centipede, National Health, Ginger Baker's Air Force, to name a few. Some of the most significant musicians to emerge during this period include John McLaughlin and Dave Holland (both of whom joined Miles Davis's group), pianists Keith Tippett and John Taylor, saxophonists Evan Parker, Mike Osborne, John Surman and Alan Skidmore, and the Canadian-born trumpeter Kenny Wheeler who had settled in Britain."]}, {"page": "Everything and Nothing", "response": ["*\"Pop Song\": John Taylor (piano), Steve Jansen."]}, {"page": "Mike de Albuquerque", "response": ["In 1971, in partnership with percussionist Frank Ricotti, Albuquerque released the jazz-rock album First Wind. Under the name 'Ricotti and Albuquerque', the band featured Albuquerque on guitar and vocals and Ricotti on vibraphone, alto saxophone and percussion, with Trevor Tomkins on drums, Chris Lawrence on electric and acoustic bass and John Taylor on electric piano, supplemented by Michael Keen and Henry Lowther on trumpet."]}, {"page": "Maria Pia De Vito", "response": ["A native of Naples, Italy, she studied classical music, opera, and Italian folk music. In 1976 she performed folk songs as a singer, guitarist, and pianist. In 1980 she sang with jazz musicians such as Art Ensemble of Chicago, Michael Brecker, Uri Caine, Peter Erskine, Paolo Fresu, Billy Hart, Maria Joao, Nguyên Lê, Dave Liebman, Bruno Tommaso, Gianluigi Trovesi, Steve Turre, Miroslav Vitous, and Joe Zawinul. In the 1980s she worked with Toots Thielemans and Mike Stern. She collaborated with Rita Marcotulli in the 1990s on the albums Nauplia and Fore Paese. She has often worked with the British composer Colin Towns and with pianist John Taylor."]}, {"page": "Arild Andersen", "response": ["* 1981: Molde Concert (ECM), with John Taylor, Bill Frisell & Alphonse Mouzon"]}, {"page": "Gwilym Simcock", "response": ["Simcock was born in Bangor, Gwynedd. At the age of eleven he attained the highest marks in the country for his Associated Board Grade 8 exams – on both piano and French horn. He studied classical piano, French horn and composition at Chetham's School, Manchester, where he was introduced to jazz by pianist and teacher Les Chisnall and bassist and teacher Steve Berry. He studied jazz piano at The Royal Academy of Music, London with John Taylor, Nikki Iles, Nick Weldon and Geoff Keezer.", "On 5 October 2008, he was featured in an evening at the King's Place Opening Festival in which he performed four concerts leading four different groups including a duo with John Taylor."]}, {"page": "Alan Skidmore", "response": ["He was born in London, England. Skidmore began his professional career in his teens, and early in his career he toured with comedian Tony Hancock. In the 1960s, he appeared on BBC Radio, then worked with Alexis Korner, John Mayall, and Ronnie Scott. He started a band with Harry Miller, Tony Oxley, John Taylor, and Kenny Wheeler, which won awards at the Montreaux Jazz Festival. In the early 1970s, he started a saxophone-only band with John Surman and Mike Osborne. He has also worked with Mose Allison, Kate Bush, Elton Dean, Georgie Fame, Mike Gibbs, George Gruntz, Elvin Jones, Van Morrison, Stan Tracey, Charlie Watts, and Mike Westbrook."]}, {"page": "Gerard Presencer", "response": ["Presencer worked with British musicians Peter King, John Dankworth, John Taylor, Ronnie Scott, Norma Winstone, and Mike Gibbs, as well as with international musicians, including Johnny Griffin, Chris Potter, Mark Turner, Niels-Henning Ørsted Pedersen, Randy Brecker, Red Rodney, Herbie Hancock, Chick Corea, John Abercrombie, and Bob Berg. He is a member of Charlie Watts' various jazz groups, with which he has recorded five albums, and was a featured soloist on US3's Cantaloop, Blue Note's biggest-selling album of the 1990s. He has also released albums as a band leader.", "He is the featured soloist on the 2011 BAFTA Award-winning score for the computer game L.A. Noire, which features Mark Turner, John Taylor, David Freidman, Jeff Ballard, and Larry Grenadier."]}, {"page": "BBC Jazz Awards", "response": ["*Best New Work: John Taylor, Green Man Suite "]}, {"page": "Tony Levin (drummer)", "response": ["His first major position came when he joined Tubby Hayes' Quartet (1965–9). He worked with numerous groups and artists, including the Alan Skidmore quintet (1969), Humphrey Lyttelton band (1969), John Taylor (1970s), Ian Carr's Nucleus (1970s), Stan Sulzmann quartet, Gordon Beck's Gyroscope, duo with John Surman (1976), European Jazz Ensemble, Third Eye (1979), Rob van den Broeck (1982), Philip Catherine's trio and quartet (1990s), Sophia Domancich Trio (with Paul Rogers, double bass; 1991–2000), Philippe Aerts trio and quartet (2000s)."]}, {"page": "Loose Tubes", "response": ["In addition, the band set up their own Loose Tubes record label. The label released albums by the Human Chain duo (Bates and Steve Argüelles), The Iains (a quartet led by Iain Ballamy), a quintet led by Tim Whitehead, a trio led by Steve Berry and a duo with Stan Sulzmann and John Taylor playing the music of Kenny Wheeler."]}, {"page": "Paul Clarvis", "response": ["Clarvis has worked with a number of notable musicians: Mick Jagger, Nina Simone, Stevie Wonder, Steve Swallow, Sir Harrison Birtwhistle, Sir John Dankworth to Sir Paul McCartney, John Taylor and Moondog, Gordon Beck, Bryan Ferry and Elton John. He has recorded with Marc Ribot, Sam Rivers, Richard Thompson, The Orb, John Adams, Michael Nyman, Loreena McKennitt, Mark Anthony Turnage and Michel Legrand as well as his own band Orquestra Mahatma."]}, {"page": "Julian Argüelles", "response": ["Argüelles started playing with big bands, including the European Community Big Band that toured throughout Europe. In 1984 he moved to London. He studied briefly at Trinity College of Music before joining Loose Tubes, staying with them for four years and recording two albums. In 1986 he received the Pat Smythe Award for young musicians. His first album, Phaedrus, included pianist John Taylor. The second, Home Truths, was a quartet which included Steve Swallow. As Above So Below was a large scale work for jazz and classical musicians with the 20 piece Trinity College of Music String Ensemble. The album evolved from a commission that was performed in Saint Wendreda's Church in March, Cambridgeshire in the Fens."]}, {"page": "Cheltenham Jazz Festival", "response": ["* 2004 John Taylor"]}, {"page": "Steve Buckley (musician)", "response": ["Buckley's main area of work has always been within the contemporary jazz scene, playing and recording with artists such as John Taylor, Julian Arguelles, Eddie Parker, Steve Noble, Billy Jenkins, Huw Warren, Christine Tobin, Colin Towns, Seb Rochford, Mike Outram, Joseph Jarman, Jonathon Joseph and Leroy Jenkins."]}, {"page": "FMR Records", "response": ["FMR's first release was by saxophonist Tim Garland. This set the pattern for the label's early years, concentrating on British jazz musicians. Taylor also purchased the right to issue CD versions of successful albums released by other British musicians, including Mike Osborne, Howard Riley, John Surman and John Taylor; sales of these provided FMR with a financial boost. \"By 2007 there were 250 CDs, DVDs and books in the catalogue\"."]}, {"page": "Mark Feldman", "response": ["Feldman has released several albums, including Music for Violin Alone (Tzadik, 1995); Book of Tells (Enja, 2000); What Exit (ECM, 2006 with British pianist John Taylor; To Fly to Steal (Intakt, 2010) with bassist Thomas Morgan and drummer Gerry Hemingway; and Oblivia (Tzadik, 2010) with his wife, Swiss pianist Sylvie Courvoisier."]}, {"page": "Martin Drew", "response": ["Al Cohn - Al Haig - Alan Skidmore - Alec Dankworth - Andrew Cleyndert - Anita O’Day - Anita Wardell - Art Farmer - Arturo Sandoval - Barbara Dennerlein - Barney Kessel - Benn Clatworthy - Benny Carter - Benny Goodman - Bill Holman - Bill Perkins - Bill Watrous - Bobby Hutcherson - Bobby Shew - Bobby Wellins - Bob Wilber - Bosko Petrovic - Buddy Childers - Buddy DeFranco - Bud Shank - Carmen McRae - Charles McPherson - Charlie Mariano - Chet Baker - Chico Freeman - Chucho Valdes - Clark Terry - Conte Candoli - Count Basie - Dame Kiri Te Kanawa - Dave Green - David Gazarov - David Mowatt - Davide Petrocca - Dexter Gordon - Dick Morrissey - Dizzy Gillespie - Eddie Daniels - Eddie \"Lockjaw\" Davis - Ella Fitzgerald - Frank Rossalino - Frank Wess - Freddy Hubbard - Gareth Williams - Gene Harris - George Coleman - Georgie Fame - Gil Evans - Hank Jones - Harold Land - Harry \"Sweets\" Edison - Herb Ellis - James Moody - James Morrison - Jean Alain Roussel - Jim Hart - Jim Mullen - Jimmy Smith - Jimmy Witherspoon - J.J. Johnson - Joe Henderson - Joe Pass - Joe Temperley - John Altman - John Critchinson - Sir John Dankworth - John Lewis - John Pearce - John Taylor - Johnny Griffin - Julian Joseph - Junior Mance - Ken Peplowski - Kenny Davern - Kenny Werner - Kilian Forster - Laurence Cottle - Laurie Holloway - Lanny Morgan - Lee Konitz - Lew Soloff - Liane Carroll - Manny Albam - Marion Montgomery - Mark Murphy - Michael Brecker - Michel Legrand - Milt Jackson - Monty Alexander - Mornington Lockett - Mundell Lowe - Niels-Henning Ørsted Pedersen - Nigel Hitchcock - Niki Harris - Oscar Peterson - Paul McCartney - Paul Morgan - Peanuts Hucko - Peter King - Phillipe Catherine - Phil Woods - Plas Johnson - Ralph Sutton - Randy Brecker - Ray Brown - Red Holloway - Robert Farnon - Robin Aspland - Roland Hanna - Ron Carter - Ron Mathewson - Ronnie Scott - Roy Eldridge - Ruby Braff - Scott Hamilton - Simon Spillett - Stan Getz - Stanley Turrentine - Stephane Grappelli - Steve Melling - Terence Blanchard - Terry Gibbs - Tete Montoliu - Tommy Smith - Toots Thielemans - Ulf Wakenius - Vic Lewis - Warren Vaché Jr. - Woody Herman - Zoot Sims."]}, {"page": "Volker Kriegel", "response": ["* Inside: Missing Link (MPS, 1972) with Albert Mangelsdorff, Alan Skidmore, Heinz Sauer, John Taylor, Eberhard Weber, John Marshall, Peter Baumeister, Cees See", "* Lift! (MPS, 1973) with Zbigniew Seifert, Stan Sulzmann, Eberhard Weber, John Taylor, John Marshall"]}, {"page": "Brian Abrahams", "response": ["Abrahams has worked with groups and artists such as Abdullah Ibrahim, Dudu Pukwana, Ronnie Scott, John Taylor, Johnny Dyani, Brotherhood of Breath, Jim Pepper, Dewey Redman, Mal Waldron, Archie Shepp, and Courtney Pine."]}, {"page": "Palle Danielsson", "response": ["Danielsson has worked with Bill Evans, Keith Jarrett, Kenny Wheeler, Geri Allen, Michel Petrucciani, Charles Lloyd, Peter Erskine, Elvin Jones, Ben Webster, Charlie Shavers, George Russell, Albert Mangelsdorff, Enrico Rava, Collin Walcott, Tomasz Stańko, and John Taylor. He has also led and co-led several bands in Sweden, and released several recordings.", "With John Taylor"]}, {"page": "Land of Cockayne (album)", "response": ["* John Taylor – electric piano "]}, {"page": "Ron Mathewson", "response": ["With John Taylor"]}, {"page": "Chris Laurence", "response": ["With John Taylor"]}, {"page": "Norma Winstone", "response": ["Norma Ann Winstone MBE (born 23 September 1941) is an English jazz singer and lyricist. In a career spanning more than 50 years she is best known for her wordless improvisations. Musicians with whom she has worked include Michael Garrick, John Surman, Michael Gibbs, Mike Westbrook, as well as pianist John Taylor, who was her former husband.", "Winstone has worked with many major European musicians and visiting Americans, as well as with most of her peers in British jazz, including Garrick, John Surman, Michael Gibbs, Mike Westbrook and her former husband, the pianist John Taylor. With Taylor and trumpeter Kenny Wheeler she performed and recorded three albums for ECM as a member of the trio Azimuth between 1977 and 1980; their fifth and last album How It Was Then… Never Again (1995) was given four stars by DownBeat magazine.", "In 1972, Winstone married pianist John Taylor, whom she had met in 1966; they divorced after some years, although they later continued their musical partnership. Their two sons, Alex and Leo, are both musicians.", "* Like Song, Like Weather, with John Taylor (Koch, 1999)"]}, {"page": "Chris Batchelor", "response": ["As a sideman, Chris has appeared alongside many international stars, such as Michael Brecker, Sam Rivers, Hermeto Pascoal, John Taylor and the Jazz Passengers with Deborah Harry. He has enjoyed a long term playing partnership with altoist Steve Buckley in their bands Orchestra Rafiki, Buckley /Batchelor Quartet and most recently with their award-winning international collaboration Big Air, featuring New York based Myra Melford and Jim Black."]}, {"page": "Mike Walker (jazz guitarist)", "response": ["In the 1990s he toured in bands led by saxophonist Tommy Smith. He has worked as George Russell's guitarist, recording with him on several occasions, and with the Creative Jazz Orchestra, Arild Andersen, Tim Berne, Anthony Braxton, Jacqui Dankworth, Tal Farlow, Bill Frisell, Dave Holland, Vince Mendoza, Bob Moses, Palle Mikkelborg, Mica Paris, John Taylor, Mark-Anthony Turnage, and Norma Winstone."]}]}}