{"wiki_id": "http://www.wikidata.org/entity/Q467863", "itemLabel": "Pat Condell", "itemDescription": "stand-up comedian, writer, and Internet personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Condell", "wikipedia_page": {"main": "Patrick Condell (born 23 November 1949) is a British writer, polemicist, and former stand-up comedian. In his early career, he wrote and performed in alternative comedy shows during the 1980s and 1990s in London, winning the Time Out Comedy Award in 1991. He was also a regular panelist on BBC Radio 1's Loose Talk programme.\nIn early 2007 he began uploading to the internet short filmed monologue polemics primarily about religious authority, authoritarianism in government and left-wing politics, and the societal effects of Muslim immigration into Europe, which have featured on the front pages of websites such as YouTube and LiveLeak. They have also been published on DVD, and also as a book of video transcripts. As of June 2017, Condell's YouTube channel has over a third of a million subscribers, with over 70 million views.", "link_mentions": [{"page": "List of comedians", "response": ["* Pat Condell (born 1949)"]}, {"page": "1949", "response": ["** Pat Condell, English comedian, internet personality"]}, {"page": "Bob Mills (comedian)", "response": ["Mills was born in Chester and attended Chester City Grammar School.The Guardian Media Interview 20 Feb 2006. Retrieved 11 May 2013 After a very short spell of training for the Merchant Navy, he quit and worked as a valet in King's Cross, London and as a Hoffman dry cleaning presser operator, driver and delivery man. After seeing Kevin Day and Eddie Zibbin (Pat Condell) at the Market Tavern in Islington in 1983, he decided to become a comedian and was a mainstay for the British 'stand-up' circuit for several years."]}, {"page": "The Comedy Store (London)", "response": ["The Comedy Store, at the Gargoyle and elsewhere, helped start the careers of Paul Merton,\"Comedy Store Players celebrate 25 years of improv\" (22 October 2010) BBC Ben Elton, Keith Allen, Jo Brand, Mark Thomas, Arnold Brown, Andrew Bailey,The Guardian, Monday 23 November 2015 Andrew Bailey: ‘People have violent arguments about whether I'm funny or not’ Pat Condell and John Sparkes."]}, {"page": "Duke of York's Theatre", "response": ["The theatre was Grade II listed by English Heritage in September 1960.English Heritage listing details accessed 28 April 2007 In the late 1970s the freehold of the theatre was purchased by Capital Radio and it closed in 1979 for refurbishment. It reopened in February 1980 and the first production under the patronage of Capital was Rose, starring Glenda Jackson. In 1991 comedian Pat Condell performed sketches at the theatre which were later released on DVD."]}, {"page": "List of satirists and satires", "response": ["*Pat Condell"]}, {"page": "Patrick (given name)", "response": ["*Pat Condell, English stand-up comedian"]}, {"page": "List of former Catholics", "response": ["* Pat Condell, British comedian"]}, {"page": "Young Vic", "response": ["In 1982 the theatre hosted a  Poetry Olympics, where comedian Pat Condell took part. Virginia Woolf taught at Morley College from 1905, which represented the natural precursor of the Young Vic's education and community engagement programme. The latter now runs an office which accommodates and paradoxically houses the 'homeless' Belarus Free Theatre, of Nikolai Khalezin, Natalia Koliada, inspiring a new feminist generation and aesthetic, with Sarah Kane's '4.48 Psychosis' performed underground, illegally in Minsk and Farringdon, in the cold cells of Clerkenwell House of Detention, a secret location in London. Echoing the words of Woolf and mirroring her suicide, Kane's play benefitted from another feminist, Sue Emmas, who since the year 1993 has been Associate Director of the social engagement programme, working closely with Kwame Kwei-Armah and leads the Directors Program which provides initiatives for emerging directors, with emphasis on seeking out and nurturing artists from under-represented backgrounds."]}, {"page": "Censorship by Google", "response": ["In October 2008, YouTube removed a video by Pat Condell titled \"Welcome to Saudi Britain\"; in response, his fans re-uploaded the video themselves and the National Secular Society wrote to YouTube in protest."]}, {"page": "Condell", "response": ["*Pat Condell, English comedian promoting the cause of atheism"]}, {"page": "Religious satire", "response": ["* Pat Condell"]}, {"page": "List of critics of Islam", "response": ["* Pat Condell, comedian and YouTube video blogger, who records videos about Islam and its alleged harmful effects particularly on British society."]}, {"page": "Rational Response Squad", "response": ["The Blasphemy Challenge, started in December 2006, is an Internet-based project which aims to get atheists to come out and declare themselves as atheists. The challenge asks atheists to submit videos to the website YouTube, in which they record themselves blaspheming or denying the existence of the Holy Spirit. According to the RRS' interpretation of several passages of the Bible (specifically, Mark 3:28-29, Matthew 12:30-32 and Luke 12:10), this action is considered an unforgivable sin. Thus, users who took the challenge saw themselves as crossing a point of no return to prove that they truly did not believe in the biblical God and would \"accept the consequences\" if after their death they find that the Christian form of the Abrahamic God does exist. The first 1,001 users who took the challenge received a DVD of Flemming's documentary film The God Who Wasn't There.The Blasphemy Challenge  Official site accessed on February 18, 2007 Magician Penn Jillette, author Christopher Hitchens, philosopher Daniel Dennett,  and Raëlism founder Raël participated in the project.Blasphemy Redux  on Culture and Media Institute accessed on February 18, 2007Rael takes the Blasphemy Challenge on YouTube accessed at February 18, 2007 It was also the first YouTube video of comedian and Internet personality Pat Condell."]}, {"page": "Time Out Comedy Awards", "response": ["* Pat Condell"]}, {"page": "Criticism of Google", "response": ["In February 2008, a video produced by the American Life League that accused a Planned Parenthood television commercial of promoting recreational sex was removed, then reinstated two days later. In October, a video by political speaker Pat Condell criticizing the British government for officially sanctioning sharia law courts in Britain was removed, then reinstated two days later. YouTube also pulled a video of columnist Michelle Malkin showing violence by Muslim extremists. Siva Vaidhyanathan, a professor of Media Studies at the University of Virginia, commented that while, in his opinion, Michelle Malkin disseminates bigotry in her blog, \"that does not mean that this particular video is bigoted; it's not. But because it's by Malkin, it's a target.\"The Googlization of Everything (and Why We Should Worry), Siva Vaidhyanatan, University of California Press, 2011, page 39, "]}, {"page": "Patcondell", "response": ["#REDIRECT Pat Condell"]}, {"page": "List of vegetarians", "response": ["! scope=\"row\" |Pat Condell"]}, {"page": "List of atheists (miscellaneous)", "response": ["* Pat Condell (1951–): English comedian, writer and secularist."]}]}}