{"wiki_id": "http://www.wikidata.org/entity/Q4679500", "itemLabel": "Adam Milner", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Milner", "wikipedia_page": {"main": "Adam Milner (born 19 December 1991), also known by the nickname of \"Adz\", is an English rugby league footballer who plays as a loose forward or hooker for the Castleford Tigers (Heritage № 910) in the Super League.\nHe has represented England at international level. He has played his entire professional club career with Castleford, and only club captain Michael Shenton has made more appearances for the Tigers than him in the current squad.", "link_mentions": [{"page": "Castleford Tigers", "response": ["Under Daryl Powell and Danny Orr, the club has again started to see success on and off the field. The 2014 side were again lauded as Classy Cas for their fast-paced and exciting style, with home grown players such as club captain Michael Shenton, Daryl Clark, Adam Milner, Oliver Holmes, Craig Huby and Andy Lynch, who was returning to the club. The side reached the Challenge Cup final in August 2014, losing to local rivals Leeds 23–10, watched by a crowd of 77,914 at Wembley Stadium. The side would eventually finish 4th in Super League and qualify for the play-offs. They were beaten 41 – 0 by St. Helens in their first game and therefore granted a second chance at progressing with a home tie against Warrington. They were beaten 14 – 30 and therefore knocked out of the play-offs. On 29 September 2015, the club announced the death of chairman Jack Fulton. In 2017, the Tigers enjoyed a phenomenal 23 game regular season as they finished 10 points clear at the top of the table prior to the split having won 20 and losing just 3 of their games. They went into the Super 8's having already secured a top four playoff spot by the end of the Super 8's and winning the League Leaders' Shield in the process. In the semifinal against St Helens, Luke Gale—just days after undergoing an emergency appendectomy—kicked a drop-goal in extra time to send Cas to their first Grand Final with a 23–22 win. Sadly they didn't carry on the form they had shown all season and were deservedly beaten by Leeds Rhinos 24–6 with a late consolation score coming in the last minute to spare Castleford being the first team to fail to score in a Grand Final. Gale was voted Steve Prescott Man of Steel, while Powell picked up the Coach of the Year award for the second time having previously won in 2014."]}, {"page": "Outwood Grange Academy", "response": ["* Adam Milner Rugby League"]}, {"page": "Stanley Rangers", "response": ["*Adam Milner: Castleford Tigers"]}, {"page": "2012 Leeds Rhinos season", "response": ["| Castleford Squad || 1 Richard Owen, 2 Nick Youngquest, 23 Ryan McGoldrick, 4 Kirk Dixon, 5 Josh Griffin, 6 Rangi Chase, 7 Danny Orr, 8 Jacob Emmitt, 15 Adam Milner, 20 Grant Millington, 11 Brett Ferres, 14 Stuart Jones, 21 Oliver Holmes Subs 9 Daryl Clark, 13 Steve Snitch, 17 Lee Mitchell, 22 Nathan Massey"]}, {"page": "2012 Castleford Tigers season", "response": ["At a 'Meet the Coach' club event, Millward confirmed the signing of Leigh Centurions prop Stephen Nash on a two-year deal. Cas confirmed a few changes to the club's backroom staff with long serving physiotherapist Russell Jones to leave the club after 11 years. Shortly after this, Millward signed two new backroom staff for the club: new Athletic Performance Director James Parkes, who is a former rugby union footballer for Leeds Carnegie, and new Head of Physiotherapy Ben Stirling, who was the Head Physio of Wales Rugby League. Tigers Hooker and former England Academy Captain Adam Milner signed a new three-year extension with the club. Castleford handed three Academy players (prop Charlie Martin, winger James Clare & half-back Ben Johnson) full-time contracts. Castleford also announced a new five-year deal for hooker Daryl Clark.", "The Tigers beat Salford City Reds 24–10 in Round 1, Castleford's tries came from Richard Owen who scored 2, Josh Griffin and hooker Adam Milner. Kirk Dixon kicked all 4 goals. The Tigers put up a good fight against an excellent Bradford Bulls side but lost 20–12. Owen scored a try and so did winger Griffin, and Dixon kicked both goals. Castleford travelled to the south of France to face the Catalans Dragons - although the Tigers played well and took an early lead, they eventually succumbed to a good fightback and lost 28–20 with Griffin getting a hat-trick and Joe Arundel scoring. Dixon added 2 goals. Challenge Cup holders Wigan Warriors demolished Castleford 46–4 at The Jungle; Griffin crossed for the Tigers' only try and Dixon missed the conversion.", "Castleford announce that Huddersfield Giants forward Lee Gilmour has signed for the Tigers for 2 years starting in 2013. The Tigers were heavily beaten 40–10 against Widnes Vikings with Nick Youngquest and Stuart Jones crossing for tries and Craig Huby kicked a goal. Castleford announce that Ryan McGoldrick will be leaving the club immediately after handing in a transfer request, he will move to Hull F.C. on a 1 and a half-year deal whilst young scrum half Jamie Ellis has been signed for the Tigers after being released from Hull FC. Castleford destroyed local rivals Huddersfield Giants 52–6 in what is their biggest winning margin in the Super League. Richard Owen scored 2 tries whilst James Clare, Jordan Thompson, Nick Youngquest, Josh Griffin, Adam Milner and Jamie Ellis (on debut) each scored a try each with Ellis kicking 10 goals. Castleford lost 40–26 to Warrington Wolves in Round 21 with Youngquest scoring 2 tries, Rhys Williams, Owen and Lee Mitchell all scored as well. Ellis kicked a goal and the retiring Danny Orr kicked 2 goals. Brett Ferres left the club with immediate effect and joined Huddersfield Giants. The Tigers were beaten 40–16 by leaders Wigan Warriors with Williams, Stuart Jones and Oliver Holmes all scoring, Youngquest kicked 2 goals.", "August started with a 40–12 loss to rivals Wakefield Trinity Wildcats. Paul Jackson and top try scorer Nick Youngquest both scored a try each and Danny Orr kicked 2 goals. Castleford lost to London Broncos 42–20, Adam Milner and Danny Orr both scored a try each whilst Josh Griffin scored 2 and Jamie Ellis kicked 2 goals. Castleford also suffered defeat at the hands of St. Helens by the score of 44–12, Jackson and Steve Snitch provide the Tiger's tries whilst Orr converted both.", "|15|| Adam Milner ||H ||B ||B", "|15|| Adam Milner ||H ||H ||H ||H ||H ||H ||x ||x ||x ||x ||SH ||H ||x ||SH ||B ||x ||H ||H ||H ||H ||H ||H ||SH ||L ||B ||L ||B", "|15|| Adam Milner ||x", "|Adam Milner"]}, {"page": "Super League XIX", "response": ["|Adam Milner  || Castleford Tigers"]}, {"page": "2015 Castleford Tigers season", "response": ["|9|| Adam Milner ||B ||12px ||B ||H ||12px ||H ||H ||B ||B ||B ||B ||B ||12px ||H ||H ||B ||H ||B ||B ||H ||H ||H ||H ||B ||H ||H ||H ||H ||H ||H", "|9|| Adam Milner ||H ", "|Adam Milner"]}, {"page": "2016 Castleford Tigers season", "response": ["|9|| Adam Milner ||B ||B ||B ||B ||H ||H ||H ||H ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x", "|9|| Adam Milner ||x ||x ||x ||x ", "|Adam Milner"]}, {"page": "2017 Super League Grand Final", "response": ["||   Adam Milner "]}, {"page": "Super League XXIII", "response": ["|  Adam Milner"]}, {"page": "2018 Baskerville Shield", "response": ["|BE ||14||Adam Milner", "|BE ||14||Adam Milner"]}, {"page": "International rugby league in 2018", "response": ["|BE ||14||Adam Milner", "* Oliver Holmes, Tom Johnstone, Reece Lyne, Adam Milner, Jamie Shaul, Liam Sutcliffe, Luke Thompson (all England), Lambert Belmas, Paul Marcon, and Anthony Marion (all France) made their Test debuts, while Robbie Mulhern made his debut for England having previously represented Ireland."]}]}}