{"wiki_id": "http://www.wikidata.org/entity/Q467097", "itemLabel": "Linda Fabiani", "itemDescription": "Scottish politician (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Linda_Fabiani", "wikipedia_page": {"main": "Linda Fabiani (born 14 December 1956) HonFRIAS OSSI FCIH is a Scottish politician who served as a Deputy Presiding Officer in the Scottish Parliament from 2016 to 2021. A member of the Scottish National Party (SNP), she was the Member of the Scottish Parliament (MSP) for the East Kilbride constituency from 2011 until her retirement in 2021. She was previously a regional member of the Scottish Parliament for the Central Scotland region from 1999 until 2011.", "link_mentions": [{"page": "December 14", "response": ["*1956 – Linda Fabiani, Scottish politician"]}, {"page": "Battle of Passchendaele", "response": ["One of the newest monuments to be dedicated to the fighting contribution of a group is the Celtic Cross memorial, commemorating the Scottish contribution to the fighting in Flanders during the Great War. This memorial is on Frezenberg Ridge where the 9th (Scottish) Division and the 15th (Scottish) Division fought during the Third Battle of Ypres. The monument was dedicated by Linda Fabiani, the Minister for Europe of the Scottish Parliament, during the late summer of 2007, the 90th anniversary of the battle. In July 2017 a two-day event was organised in Ypres to mark the centenary of the battle. Members of the British Royal family and Prime Minister Theresa May joined the ceremonies, which started in the evening of 30 July with the service at Menin Gate, followed by ceremonies at the Market Square. On the following day, a ceremony was held at Tyne Cot cemetery, headed by the Prince of Wales."]}, {"page": "Lewis chessmen", "response": ["In 2007–2008 a dispute arose as to where the main resting place of the pieces should be. This arose in late in 2007 with calls from Scottish National Party (SNP) politicians in the Western Isles (notably Councillor Annie Macdonald, MSP Alasdair Allan and MP Angus MacNeil) for the return of the pieces to the place they were found. Linda Fabiani, Scottish Minister for Europe, External Affairs and Culture, stated that \"it is unacceptable that only 11 Lewis Chessmen rest at the National Museum of Scotland while the other 67 (as well as the 14 tablemen) remain in the British Museum in London.\""]}, {"page": "Presiding Officer of the Scottish Parliament", "response": ["| rowspan=\"2\" |Linda Fabiani 12 May 2016 – 12 May 2021"]}, {"page": "East Kilbride", "response": ["There is an East Kilbride constituency of the Scottish Parliament. From the opening of the Scottish Parliament, the constituency was represented by Andy Kerr MSP (Labour), until May 2011 when the seat was won by Linda Fabiani MSP (Scottish National Party)."]}, {"page": "Christine Grahame", "response": ["Grahame ran for Depute Leader of the Scottish National Party in the 2004 leadership election, but was defeated by Nicola Sturgeon. In 2011, she was elected MSP for Midlothian South, Tweeddale and Lauderdale. Following the 2016 election to the 5th Scottish Parliament, Grahame was elected Deputy Presiding Officer. She held the position alongside Linda Fabiani from 2016 until 2021. She has served on the Scottish Parliamentary Corporate Body since May 2021.", "In the 2016 Scottish Parliament election, Grahame held the seat, increasing her share of the vote to 45.1%. Following the 2016 election, she was elected as Deputy Presiding Officer of the Scottish Parliament, serving alongside Linda Fabiani MSP. Grahame was also re-elected as Convener of the Cross Party Group on Animal Welfare. During the COVID-19 pandemic, she went into self isolation as someone over 70 years old and therefore at more risk of developing severe COVID-19 symptoms. In April 2020, Scottish Labour's Lewis Macdonald was elected as interim Deputy Presiding Officer in her absence."]}, {"page": "Tartan Day", "response": ["Since 2001 the Scottish Australian Heritage Council and Australian branch of the Scottish National Party have petitioned Canberra for federal recognition of International Tartan Day to celebrate the Scottish contribution to Australian history,'Ex-Pats Demand Day Down Under', The Express (London, 19 February 2001), p. 1. including the influence of Scottish radicalism on the trade union movement and the Labor Party, and Australia's allegedly 'egalitarian and meritocratic' society.John McTerman, 'Why the true patriots do not wear plaid', Scotland on Sunday (7 April 2002), p. 18. In 2008 Scottish culture minister Linda Fabiani floated a proposal to expand the Australian event into an official Scotland Week as part of the Scottish government's international business strategy.Marc Horne, 'No flies on Alex as Tartan Week goes walkabout', Scotland on Sunday (March 30, 2008), p. 3."]}, {"page": "Strathaven", "response": ["*Linda Fabiani, Scottish National Party politician and former Scottish Executive Minister for Europe, External Affairs and Culture"]}, {"page": "List of University of Glasgow people", "response": ["* Linda Fabiani, MSP Minister for Europe, External Affairs and Culture"]}, {"page": "Andy Kerr (Scottish politician)", "response": ["At the 2011 Scottish Parliament election, Kerr was one of many Labour casualties, losing his seat after 12 years to Linda Fabiani of the SNP. Kerr did not stand on the regional list, so therefore did not return as an MSP."]}, {"page": "Central Scotland (Scottish Parliament electoral region)", "response": ["|rowspan=\"2\"|Linda Fabiani(SNP)", "|rowspan=\"3\"|Linda Fabiani(SNP)"]}]}}