{"wiki_id": "http://www.wikidata.org/entity/Q467112", "itemLabel": "Nicola Sturgeon", "itemDescription": "5th First Minister of Scotland and Leader of the Scottish National Party", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicola_Sturgeon", "wikipedia_page": {"main": "Nicola Ferguson Sturgeon (born 19 July 1970) is a Scottish politician serving as First Minister of Scotland and Leader of the Scottish National Party (SNP) since 2014. She is the first woman to hold either position. She has been a member of the Scottish Parliament (MSP) since 1999, first as an additional member for the Glasgow electoral region, and as the member for Glasgow Southside (formerly Glasgow Govan) from 2007.\nA law graduate of the University of Glasgow, Sturgeon worked as a solicitor in Glasgow. After being elected to the Scottish Parliament, she served successively as the SNP's shadow minister for education, health, and justice. In 2004 she announced that she would stand as a candidate for the leadership of the SNP following the resignation of John Swinney. However, she later withdrew from the contest in favour of Alex Salmond, standing instead as depute (deputy) leader on a joint ticket with Salmond. Both were subsequently elected, and as Salmond was still an MP in the House of Commons, Sturgeon led the SNP in the Scottish Parliament as Leader of the Opposition from 2004 to 2007. The SNP won the highest number of seats in the Scottish Parliament in the 2007 election and Salmond was subsequently appointed first minister. He appointed Sturgeon as Deputy First Minister and Cabinet Secretary for Health and Wellbeing. She was appointed as Cabinet Secretary for Infrastructure, Capital Investment and Cities in 2012.\nFollowing the defeat of the Yes Scotland campaign in the 2014 Scottish independence referendum, Salmond resigned and Sturgeon was elected unopposed as SNP leader in November 2014 and appointed as first minister. Sturgeon led the SNP through the 2015 general election when it enjoyed a surge in support, recording a number of swings of over 30% from Labour, as it won 56 of the 59 Scottish seats and replaced the Liberal Democrats as the third-largest party in the British House of Commons. In the 2016 election, the SNP was returned as the largest single party in the Scottish Parliament but fell two seats short of a majority. Sturgeon secured a second term as first minister, forming an SNP minority government. In the 2016 UK referendum on EU membership, Scotland voted by 62% to remain in the European Union, despite Brexit receiving 52% of the vote across the UK. Both before and after the vote to leave the EU, Sturgeon's government has repeatedly advocated for a second referendum on independence. The SNP gained a seat in the 2021 Scottish Parliament election, winning 64 seats, but fell one seat short of a majority. Sturgeon’s government subsequently entered a power-sharing agreement with the Scottish Greens. As First Minister, Sturgeon has been leading the Scottish Government's response to the COVID-19 pandemic in Scotland since 2020.", "link_mentions": [{"page": "List of political scandals in the United Kingdom", "response": ["* The Alex Salmond scandal concerned how the Scottish Government, led by incumbent First Minister of Scotland Nicola Sturgeon, breached its own guidelines in its investigation into the harassment claims against Sturgeon's predecessor as First Minister, Alex Salmond. The Scottish Government lost a judicial review into their actions and had to pay over £500,000 to Salmond for legal expenses. Salmond claimed that senior figures in Sturgeon's government and the ruling Scottish National Party (SNP) conspired against him for political reasons. Critics accused Sturgeon of breaking the Ministerial Code which resulted in calls for her resignation. Sturgeon disputed the allegations, arguing that while mistakes had been made, her government acted appropriately."]}, {"page": "European Free Alliance", "response": ["As of 2021, four European regions are led by EFA politicians: Scotland with Nicola Sturgeon of the Scottish National Party, Flanders with Jan Jambon of the New Flemish Alliance, Corsica with Gilles Simeoni of For Corsica, and Catalonia with Pere Aragonès from the Republican Left of Catalonia."]}, {"page": "List of Scots", "response": ["* Nicola Sturgeon (born 1970), First Minister of Scotland (since 2014) and Leader of the Scottish National Party"]}, {"page": "July 19", "response": ["*  1970   – Nicola Sturgeon, Scottish lawyer and politician, First Minister of Scotland"]}, {"page": "Scotland", "response": ["In the 2021 election, the Scottish National Party (SNP) won 64 of the 129 seats available. Nicola Sturgeon, the leader of the SNP, has been the first minister since November 2014. The Scottish Conservatives, Scottish Labour, the Scottish Liberal Democrats and the Scottish Greens also have representation in the Parliament. The next Scottish Parliament election is due to be held on 7 May 2026.", "During a 2017 visit to the United States, the first minister Nicola Sturgeon met Jerry Brown, Governor of California, where both signed an agreement committing both the Government of California and the Scottish Government to work together to tackle climate change, as well as Sturgeon signing a £6.3 million deal for Scottish investment from American businesses and firms promoting trade, tourism and innovation. During an official visit to the Republic of Ireland in 2016, Sturgeon claimed that is it \"important for Ireland and Scotland and the whole of the British Isles that Ireland has a strong ally in Scotland\". During the same engagement, Sturgeon became the first head of government to address the Seanad Éireann, the upper house of the Oireachtas (the Irish parliament).", "The first minister, Nicola Sturgeon, announced the following day that as a result a new independence referendum was \"highly likely\". On 31 January 2020, the United Kingdom formally withdrew from the European Union. At Holyrood, Sturgeon's governing SNP continues to campaign for such a referendum; in December 2019 a formal request for the powers to hold one under Section 30 of the Scotland Act was submitted. At Westminster, the governing second Johnson ministry of the Conservative Party is opposed to another referendum and has refused the first minister's request. Because constitutional affairs are reserved matters under the Scotland Act, the Scottish Parliament would again have to be granted temporary additional powers under Section 30 in order to hold a legally binding vote."]}, {"page": "Scottish National Party", "response": ["The Scottish National Party (SNP; ,  ) is a Scottish nationalist and social democratic political party in Scotland. The SNP supports and campaigns for Scottish independence from the United Kingdom and for membership of the European Union, with a platform based on civic nationalism. The SNP is the largest political party in Scotland, where it has the most seats in the Scottish Parliament and 45 out of the 59 Scottish seats in the House of Commons at Westminster, and it is the third-largest political party by membership in the United Kingdom, behind the Labour Party  and the Conservative Party. The current Scottish National Party leader, Nicola Sturgeon, has served as First Minister of Scotland since 20 November 2014.", "After an unsuccessful leadership challenge in 2003, Swinney stepped down following disappointing results in the European elections of 2004 with Salmond victorious in the subsequent leadership contest despite initially refusing to be candidate. Nicola Sturgeon was elected Depute Leader and became the party's leader in the Scottish Parliament until Salmond was able to return at the next parliamentary election.", "Following the Yes campaign's defeat, Salmond resigned and Nicola Sturgeon won that year's leadership election unopposed.", "The SNP rebounded from their loss at the independence referendum at the 2015 UK general election eight months later, led by former Deputy Leader Nicola Sturgeon. The party went from holding six seats in the House of Commons to 56, ending 51 years of dominance by the Scottish Labour Party. All but three of the fifty-nine constituencies in the country elected an SNP candidate in the party's most comprehensive electoral victory at any level.", "Having previously defined itself in opposition to the poll tax the SNP has also championed progressive taxation at a local level. Despite pledging to introduce a local income tax the Salmond Government found itself unable to replace the council tax and the party has, particularly since the ending of the council tax freeze under Nicola Sturgeon's leadership, committing to increasing the graduated nature of the tax. Conversely, the party has also supported capping and reducing Business Rates in an attempt to support small businesses.", "Particularly since Nicola Sturgeon's elevation to First Minister the party has highlighted its commitments to gender equality – with her first act being to appoint a gender balanced cabinet. The SNP have also taken steps to implement all-women shortlists whilst Sturgeon has introduced a mentoring scheme to encourage women's political engagement.", "The party aspires to promote universal access to education, with one of the first acts of the Salmond government being to abolish tuition fees - although it has also introduced a cap on the number of Scots who can attend university and cut funding for further education colleges. More recently, the party has turned its attention to widening access to higher education with Nicola Sturgeon stating that education is her number one priority. At school level, the Curriculum for Excellence is currently undergoing a review.", "Official SNP policy is supportive of the monarchy. Many party members are republicans but party leader, Nicola Sturgeon, believes it is a \"model with many merits\", although she has proposed reducing the funds spent on the royal family. Separately, the SNP has always opposed the UK's unelected upper house and would like to see both it and the House of Commons elected by a form of proportional representation. The party also supports the introduction of a codified constitution, either for an independent Scotland or the UK as a whole, going as far as producing a proposed interim constitution for Scotland during the independence referendum campaign.", "|The Right Hon. Nicola Sturgeon (born 1970)", "|The Right Hon. Nicola Sturgeon(born 1970) ", "* Nicola Sturgeon (Glasgow), 2004–2007", "* Nicola Sturgeon (Glasgow Southside) 2014–present", "| data-sort-value=\"Sturgeon\" |  Nicola Sturgeon MSP for Glasgow Southside", "| rowspan=2 align=left| Nicola Sturgeon", "| rowspan=\"3\" align=left| Nicola Sturgeon"]}, {"page": "Politics of the United Kingdom", "response": ["Salmond resigned as First Minister of Scotland and leader of the SNP following the country's rejection of independence in September 2014, and was succeeded in both roles by the deputy First Minister and deputy leader of the SNP, Nicola Sturgeon. Also in the wake of the referendum, Lamont stood down as Scottish Labour leader and Jim Murphy was elected to replace her. Murphy was the leader until the general election in 2015 in which he lost his seat in Westminster. After the defeat, he resigned his position and her deputy MSP Kezia Dugdale became leader of the party and leader of SLP in Holyrood. In 2017 she unexpectedly resigned and was replaced as Scottish Labour leader by the English-born Richard Leonard. He held the post until quitting in January 2021, with Anas Sarwar replacing him the following month.", "The SNP and the Green party won the right to form a Scottish coalition government in May 2021. The precise arrangement is loose and allows the Scottish Green party freedom to criticise official SNP policy on key areas of disagreement. However, it provides FM Nicola Sturgeon with a mandate to call for a new independence referendum after the failed one in 2014. Proponents of a new referendum particularly cite Brexit as changing the political situation, thus leading Scots to be more pro-independence than in 2014. As an issue, Scottish independence is known to cross-cut across party lines, with many Scottish Labour voters in particular being favourable to the prospect of independence."]}, {"page": "University of Glasgow", "response": ["The alumni of the University of Glasgow include some of the major figures of modern history, including James Wilson, a signatory of the United States Declaration of Independence, 3 Prime Ministers of the United Kingdom (William Lamb, Henry Campbell-Bannerman and Bonar Law), 2 Scottish First Ministers (Nicola Sturgeon and Donald Dewar), economist Adam Smith, philosopher Francis Hutcheson, engineer James Watt, physicist Lord Kelvin, surgeon Joseph Lister along with 8 Nobel Prize laureates and numerous Olympic gold medallists, including the current chancellor, Dame Katherine Granger.", "In more recent times, the university was the focus of the \"Glasgow Group\" of poets and literary critics, including Philip Hobsbaum, Tom Leonard and Alasdair Gray. The university boasts one of Europe's largest collections of life scientists, as well as having been the training ground of numerous politicians including former Prime Ministers Bonar Law and Sir Henry Campbell-Bannerman, former First Minister Donald Dewar, former leader of the Liberal Democrats and former Rector Charles Kennedy, Defence Secretaries Liam Fox and Des Browne, the founder of the UK Independence Party Alan Sked, former Labour Party leader John Smith, Business Secretary Vince Cable, former leader of the Liberal Democrats Sir Menzies Campbell, and current First Minister Nicola Sturgeon. Other notable alumni include banker Fred Goodwin, actor Gerard Butler, Rangers and Scottish footballer Neil Murray, actor, writer, television and radio broadcaster Colin Lamont (aka Scottie McClue), novelist Robin Jenkins, founder of the world's largest non-governmental development organisation BRAC Fazle Hasan Abed, television writers Armando Iannucci and Steven Moffat, comedian Greg Hemphill, television presenter Neil Oliver, journalists Andrew Neil and Raman Bhardwaj, and musicians Emeli Sandé and Simon Neil.", "File:Official portrait of Nicola Sturgeon.jpg|Nicola Sturgeon"]}, {"page": "Scottish Parliament", "response": ["The Scotland Act 2012 and the Scotland Act 2016 extended the devolved competencies, including the introduction of taxation powers. The United Kingdom Internal Market Act 2020 seeks to restrict the operation of devolved powers. The latter legislation, passed under the government of Boris Johnson, gives UK ministers extended powers to enforce mutual recognition of regulations across the UK, and the exemptions permitted for the devolved administrations are significantly less extensive than previous exemptions under the EU Single Market rules. On paper, it does not particularly change devolved competences, but it both legally and practically restrains the legislative competence of the Parliament. The business secretary tacitly acknowledged this fact in the impact assessment that the BEIS department was obliged to publish alongside the bill, which states: \"The final cost of this legislation is the potentially reduced ability for different parts of the UK to achieve local policy benefits. While this legislation does not constrain the ability of different parts of the UK to introduce distinct policies, to the extent that those policies may be enforceable on a reduced number of businesses might make it harder to realise fully the benefits of those policies.\" Contains Parliamentary information licensed under the Open Parliament Licence v3.0. Although the UK Government stated on publication that the proposed bill sought to \"protect the integrity of the UK's single market\", the legislation has been heavily criticised for its dealings with the devolved nations. First Minister Nicola Sturgeon called the bill a \"full frontal assault on devolution\". The legislation undermines the freedom of action, regulatory competence and authority of the Parliament, limiting its ability to make different economic or social choices from those made in Westminster, and to focus and plan investment in infrastructure in Scotland."]}, {"page": "The Spectator", "response": ["In August 2015, The Spectator received media attention and criticism after publishing an article by Charles Moore regarding the 2015 Labour Party leadership election titled \"Have Yvette Cooper and Liz Kendall got the looks for a leadership contest?\", in which he wrote \"there is an understanding that no leader – especially, despite the age of equality, a woman – can look grotesque on television and win a general election\" and discussed the looks of the two female candidates in detail. The article was condemned by Liz Kendall; First Minister of Scotland, Nicola Sturgeon; Candidate for Labour nomination for Mayor of London and former Minister and MP Tessa Jowell; along with several journalists and MPs from various parties."]}, {"page": "Ayrshire", "response": ["* Nicola Sturgeon (1970–), current First Minister of Scotland, born in Irvine."]}, {"page": "Prince William, Duke of Cambridge", "response": ["In February 2019, William and Catherine carried out a two-day visit of Northern Ireland, visiting Belfast, Fermanagh, and Ballymena. In March and April 2019, William spent three weeks working for MI6, MI5 and GCHQ. The Duke and Duchess toured Pakistan in October 2019, which was the royal family's first visit to the country in 13 years. In December 2019, William visited Kuwait and Oman, commemorating the 120th anniversary of the Anglo-Kuwaiti Agreement of 1899. In March 2020, the couple carried out a three-day tour of Ireland, visiting County Meath, Kildare, and Galway. In October 2020, the Duke and Duchess met Volodymyr Zelensky, the President of Ukraine, and First Lady Olena Zelenska, at Buckingham Palace, the first royal engagement held at the residence since the start of the COVID-19 pandemic. In December, the couple embarked on a three-day tour of England, Scotland, and Wales via the British royal train \"to pay tribute to the inspiring work of individuals, organisations and initiatives across the country\" in 2020. Prime Minister Boris Johnson expressed his support for the initiative, while First Minister of Scotland Nicola Sturgeon criticised the tour, citing travel restrictions; UK, Scottish and Welsh governments were consulted before planning the tour. In William's capacity as Lord High Commissioner to the General Assembly of the Church of Scotland, the couple toured Edinburgh, Fife and Orkney in May 2021. In Cornwall on 11 June 2021, William and Catherine attended the G7 summit for the first time. They also attended a reception, where the Duke and his father discussed governmental and corporate solutions to environmental problems."]}, {"page": "Tourism in Scotland", "response": ["The Scottish Tourism Alliance Task Force published its recommendations in October 2020, with \"Immediate Actions\" for both the Scottish government and the UK government. The group particularly requested support for the tourism/hospitality industry, including financial grants, the funding of marketing for the sector, and a \"temporary removal of Air Passenger Duty to boost route competitiveness\". On 24 March 2021, First Minister Nicola Sturgeon announced a £25 million tourism recovery programme \"to support the industry for the next 6 months to two years\". Sturgeon also reminded the hospitality/tourism industry that the government had provided \"over £129 million\" in support \"for this sector\"."]}, {"page": "Private finance initiative", "response": ["A specialist unit was set up in the Scottish Office in 2005 to handle PFI projects. In November 2014, Nicola Sturgeon announced a £409m public-private funding package which would be funded through a non-profit distributing model which would cap private sector returns, returning any surplus to the public sector. On Monday 11 April 2016, 17 PFI-funded schools in Edinburgh failed to open after the Easter break because of structural problems identified in two of them the previous Friday; the schools had been erected in the 1990s by Miller Construction."]}, {"page": "Daily Mail", "response": ["In 2014, after Emma Watson spoke at the launch of the United Nations HeForShe campaign, the Mail was criticised for focusing its coverage on Watson's dress and appearance, rather than the content of her speech, in which Watson complained how media had sexualised her in their coverage from when she was 14. The Mail was much criticised for running the front-page headline \"Never mind Brexit, who won legs-it\", accompanying a photograph of Theresa May meeting with Nicola Sturgeon in March 2017, running more than a page of coverage on the two leaders' appearance. Jeremy Corbyn, the Leader of the Labour Party, tweeted \"It's 2017. This sexism must be consigned to history. Shame on the Daily Mail.\" The International Business Times quoted an unnamed Daily Mail staff member describing the headline as \"moronic\", and out of touch with the Daily Mail's largely female readership."]}, {"page": "Steve Bell (cartoonist)", "response": ["In the run-up to the 2015 United Kingdom general election, there was outrage on Twitter over an If... cartoon strip depicting Scottish National Party (SNP) leader Nicola Sturgeon as refusing to compromise on their \"core demand\" for  \"incest and Scottish folk dancing\". Numerous tweets branded Bell as racist, while others said that it was no more outrageous than his cartoons mocking other politicians.Jack Sommers \"SNP Guardian Cartoon By Steve Bell Branded 'Racist' In Social Media Outrage\", The Huffington Post, 11 March 2015 There were over 300 complaints made to The Guardian and nearly 1,000 comments under the online cartoon, mostly negative. The wording referred to a quotation attributed to Sir Arnold Bax, who said a Scottish friend had told him \"You should make a point of trying every experience once, excepting incest and folk dancing\". During the 2014 Scottish independence referendum, Bell's cartoon strip depicted Sturgeon's \"Yes\" campaigning as promising \"No Noness ... and Yes Yesness; Nationalism, Socialism: together they go so well!!\""]}]}}