{"wiki_id": "http://www.wikidata.org/entity/Q4684937", "itemLabel": "Adrian Cole", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Cole_(writer)", "wikipedia_page": {"main": "Adrian Christopher Synnot Cole (born 22 July 1949 in Plymouth, England), is a British writer. He is known for his Dream Lords trilogy, the Omaran Saga and Star Requiem series, and his young adult novels, Moorstones and The Sleep of Giants.", "link_mentions": [{"page": "List of fantasy authors", "response": ["* Adrian Cole, (born 1949) author of the Dream Lords series"]}, {"page": "British Fantasy Society", "response": ["*Adrian Cole, issues ?-6, 1973-?", "*Adrian Cole and David A Sutton, issues 7-?"]}, {"page": "British Fantasy Award", "response": ["* Nick Nightmare Investigates by Adrian Cole"]}, {"page": "Flashing Swords!", "response": ["The two versions of Flashing Swords! #6 together contained nineteen additional stories by eighteen authors, including two by Steve Dilks, two by Robert M. Price, one by Lin Carter with Robert M. Price, and one each by Glynn Owen Barrass, Cliff Biggers, Adrian Cole, Pierre V. Comtois, Jason Ross Cummings, Clayton L. Hinkle, Wayne Judge, Paul R. McNamee, D.M. Ritzlin, Charles R. Rutledge, Frank Schildiner, Richard Toogood, Santiago del Dardano Turann, and Glen Usher with Steve Lines. The only stories common to the two editions are one of the solo pieces by Price, the piece by Toogood, and the piece by Usher and Lines. The piece by Hinkle is a graphic novella.", "Of the stories slated for the original version of Flashing Swords! #6 that were not carried over into the revised version, D. M. Ritzlin's \"A Twisted Branch of Yggdrasil was subsequently published in his collection Necromancy in Nilztiria (DMR Books, 2020), while Adrian Cole's \"The Tower in the Crimson Mist\" and Steve Dilks's \"Tale of the Uncrowned Kings\" were subsequently published in the anthology Savage Scrolls, Volume One (Pulp Hero Press, 2020)."]}, {"page": "Microcon", "response": ["* Microcon 9 (1989): David V. Barrett, Adrian Cole, Storm Constantine, Mary Gentle, Fox, Colin Greenland, John Grant, Dave Langford, Pete Loveday, Terry Pratchett, Fay Sampson, Ron Tiner, Diana Wynne Jones"]}, {"page": "The Year's Best Fantasy Stories: 5", "response": ["*\"Astral Stray\" (Adrian Cole)"]}, {"page": "Shadows over Innsmouth", "response": ["* \"The Crossing\", by Adrian Cole"]}, {"page": "Mike Chinn", "response": ["*Hastur La Vista, Baby (with Adrian Cole) (The Lovecraft Squad: Rising, 2020)", "*Fire All of the Guns At One Time (with Adrian Cole) (Nick Nightmare Investigates, 2014)", "*Hastur La Vista, Baby (with Adrian Cole) (The Lovecraft Squad: Rising, 2020)"]}, {"page": "Heroic Fantasy (anthology)", "response": ["*\"Astral Stray\" (Adrian Cole) "]}, {"page": "Adrian Cole", "response": ["Adrian Cole may refer to:", "* Adrian Cole (writer) (born 1949), English writer", "* Adrian Cole (RAAF officer) (1895–1966), senior commander in the Royal Australian Air Force"]}, {"page": "Dungeons & Dragons (novels)", "response": ["* Adrian Cole"]}, {"page": "Eberron novels", "response": ["* The Crimson Talisman (Adrian Cole, May 2005, )"]}, {"page": "Elak of Atlantis", "response": ["Author Adrian Cole has continued Kuttner's Elak saga in his own series of short stories, most of which appear in his collection Elak, King of Atlantis (2020)."]}, {"page": "Young Thongor", "response": ["Young Thongor is a collection of fantasy short stories by  American writer Lin Carter, with additional material by Robert M. Price, edited and with a foreword by Adrian Cole. It was first published in trade paperback by Wildside Press in May, 2012. Most of the pieces were first published in magazines, anthologies or other books by Carter; the remaining pieces are original to the present work.", "*\"Foreword\" (Adrian Cole)"]}, {"page": "List of Dungeons & Dragons fiction", "response": ["| 05/2005 || Eberron || The Crimson Talisman || Novel || Adrian Cole (writer) ||  || The War-Torn"]}, {"page": "Thongor", "response": ["*Young Thongor (2012) -consisting of stories by Lin Carter, Robert M. Price and Adrian Cole"]}, {"page": "Tales from the Miskatonic University Library", "response": ["*\"The Third Movement\" (Adrian Cole)"]}, {"page": "Lin Carter's Simrana Cycle", "response": ["The collection gathers together all twelve of Carter's tales set in his Lord Dunsany-inspired \"dreamworld\" of Simrana, some previously published and a few previously unpublished, including two newly completed by Robert M. Price and Glynn Owen Barrass. One story, previously published in two versions, \"The Gods of Neol Shendis\" and \"The Gods of Nion Parma,\" is included in both forms. Appended are nine \"Dunsanian\" stories written as tributes to Carter and Simrana by Darrell Schweitzer, Gary Myers, Adrian Cole, Charles Garofalo, and Robert M. Price, along with some of the original stories that inspired Carter, eight by Lord Dunsany himself and one by Henry Kuttner.", "* \"An Unfamiliar Familiar\" (Adrian Cole)", "* \"The Summoning of a Genie in Error\" (Adrian Cole)"]}, {"page": "The Mighty Warriors", "response": ["*\"Spawn of the Sea God\" (Elak of Atlantis) (Adrian Cole)", "*\"Appendix Two: An Adrian Cole Bibliography\""]}, {"page": "Mountains of Madness Revealed", "response": ["*\"Cold Storage\" (Adrian Cole)"]}, {"page": "Lin Carter bibliography", "response": ["# Young Thongor, by Lin Carter, Robert M. Price, and Adrian Cole (Wildside Press, 2012) ()"]}, {"page": "A Place Among the Fallen", "response": ["A Place Among the Fallen is a novel by Adrian Cole published in 1986."]}, {"page": "Elak, King of Atlantis", "response": ["Elak, King of Atlantis is a collection of sword and sorcery short stories by English author Adrian Cole, continuing the stories featuring the title character by American author Henry Kuttner. It was first published in trade paperback and ebook by Pulp Hero Press in July 2020; an ebook edition followed from the same publisher in October of the same year."]}, {"page": "Savage Scrolls, Volume One", "response": ["The book collects eight sword and sorcery tales of protagonists traditional in and new to the subgenre, the former including Henry Kuttner's Elak of Atlantis and Prince Raynor, David C. Smith's Oron, and James Enge's Morlock the Maker. Some are by the authors associated with the original works and others are pastiches by later writers. Two of the stories, Adrian Cole's \"The Tower in the Crimson Mist\" and Steve Dilks's \"Tale of the Uncrowned Kings,\" were recycled from the publisher's aborted anthology Flashing Swords! #6 (July 2020).", "*\"Tower in the Crimson Mist\" (Elak of Atlantis) (Adrian Cole)"]}, {"page": "Pulp Hero Press", "response": ["Authors published by Pulp Hero Press include Robert Adams, Fred Blosser, Joe Bonadonna, Jason Ray Carney, Adrian Cole, Ashley Jude Collie, John Jakes, Brian Murphy, David C. Smith, and Roy Thomas. ", "*Nick Nightmare Investigates, collection by Adrian Cole, Oct. 2019.", "*Elak, King of Atlantis, collection by Adrian Cole, Jul. 2020.", "*Nightmare Cocktails: Further investigations from the Files of Nick Nightmare, collection by Adrian Cole, Oct. 2020.", "*Rebellion, novel by Adrian Cole, Mar. 2021."]}, {"page": "Lin Carter's Flashing Swords! 6", "response": ["*\"The Tower in the Crimson Mist\" (Adrian Cole)", "Of the stories slated for the original version of Flashing Swords! #6 that were not carried over into the revised version, D. M. Ritzlin's \"A Twisted Branch of Yggdrasil\" was subsequently published in his collection Necromancy in Nilztiria (DMR Books, 2020), while Adrian Cole's \"The Tower in the Crimson Mist\" and Steve Dilks's \"Tale of the Uncrowned Kings\" were subsequently published in the anthology Savage Scrolls, Volume One (Pulp Hero Press, 2020)."]}]}}