{"wiki_id": "http://www.wikidata.org/entity/Q4685112", "itemLabel": "Adrian Hollis", "itemDescription": "English chess player (1940-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Hollis", "wikipedia_page": {"main": "Adrian Swayne Hollis (2 August 1940 – 26 February 2013) was an English classical scholar and correspondence chess grandmaster, the title having been awarded in 1976.", "link_mentions": [{"page": "List of Old Etonians born in the 20th century", "response": ["*Adrian Hollis (1940–2013), classical scholar and chess grandmaster"]}, {"page": "Oxford University Chess Club", "response": ["* Adrian Hollis"]}, {"page": "Adrian hollis", "response": ["#REDIRECT Adrian Hollis "]}, {"page": "George Hollis (bishop)", "response": ["He married Mary Margaret Church (1874-1941), herself the daughter of an Anglican minister, at Wells Cathedral on 5 July 1898. Their son Christopher was MP for Devizes from 1945 to 1955,Obituary-Mr Christopher Hollis Writer and former MP  The Times Monday, May 09, 1977; pg. 16; Issue 59998; col E and another son Roger was director general of MI5 from 1956 to 1965. Of grandchildren: Adrian Hollis, Roger's son, was a chess champion and Classics don; while another is, like George, a bishop: Christopher's son, Crispian is the Roman Catholic bishop of Portsmouth."]}, {"page": "1940 in chess", "response": ["* 2 August – Adrian Hollis in Bristol, English ICCGM"]}, {"page": "Christopher Hollis", "response": ["He was the brother of Sir Roger Hollis and the uncle of Adrian Hollis."]}, {"page": "2013 in the United Kingdom", "response": ["* 26 February – Adrian Hollis, 72, correspondence chess grandmaster."]}, {"page": "Deaths in February 2013", "response": ["*Adrian Hollis, 72, English correspondence chess grandmaster.Adrian Swayne Hollis obituary, The Times, 26 February 2013 "]}, {"page": "Hollis (name)", "response": ["* Adrian Hollis (1940–2013), English classical scholar and correspondence chess grandmaster."]}, {"page": "Newcastle Scholarship", "response": ["Distinguished winners of the Newcastle Scholarship in its original form have included Sir Edward Shepherd Creasy (1831), William Johnson Cory (1841),W.C. Lubenow, The Cambridge Apostles 1820–1914: Liberalism, Imagination, and Friendship (Cambridge University Press, 1998), at page 258 WR Inge (1879),W. Sydney Robinson, The Last Victorians: A Daring Reassessment of Four Twentieth Century Eccentrics (Robson Press, 2014) M. R. James (1882),George Woodcock intr., Twentieth Century Fiction (Macmillan Press, 1983), at page 336 Patrick Shaw-Stewart (1905),Miles Jebb, Patrick Shaw-Stewart, An Edwardian Meteor (Dovecote Press, 2010); Evelyn Waugh, Two Lives: Edmund Campion and Ronald Knox (Continuum, 2002), at page 172; Waugh records that the academic strain was such that Shaw-Stewart's hair fell out. Arthur Rhys-Davids(1916), Quintin Hogg, Baron Hailsham of St Marylebone (1925),The New Scientist, Profile: Viscount Hailsham (15 August 1957) Douglas Hurd (1947) and William Waldegrave (1965, currently Provost of Eton College). Those who have become professional classicists include Roger Mynors (1922), Charles Willink (1946), Adrian Hollis (1958), Richard Jenkyns (1966) and Armand D’Angour (1976)."]}, {"page": "Correspondence Chess Olympiad", "response": ["|9th  (1982–1987)||  || Jonathan Penrose, Adrian Hollis, Simon Webb, John Footner, John Toothill and Cris Shephard  || || "]}, {"page": "Adrian Swayne Hollis", "response": ["#REDIRECT Adrian Hollis"]}]}}