{"wiki_id": "http://www.wikidata.org/entity/Q468060", "itemLabel": "Helen Watts", "itemDescription": "Welsh opera singer (1927-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Watts", "wikipedia_page": {"main": "Helen Watts  (7 December 1927 – 7 October 2009) was a Welsh contralto.", "link_mentions": [{"page": "December 7", "response": ["*  1927   – Helen Watts, Welsh opera singer (d. 2009)"]}, {"page": "Oradour-sur-Glane massacre", "response": ["*In 2013, Helen Watts published One Day in Oradour, a short novel based on the events of 1944. Some names of the characters and locations have been changed, and some characters are composites of several individuals."]}, {"page": "Béatrice et Bénédict", "response": ["* Josephine Veasey (Béatrice), John Mitchinson (Bénédict), April Cantelo (Héro), Helen Watts (Ursule), John Cameron (Claudio), John Shirley-Quirk (Don Pedro), Eric Shilling (Somarone), London Symphony Orchestra conducted by Colin Davis. L'Oiseau-lyre SOL 256-7 (1962).", "* Janet Baker (Béatrice), Robert Tear (Bénédict), Christiane Eda-Pierre (Héro), Helen Watts (Ursule), Thomas Allen (Claudio), Robert Lloyd (Don Pedro), Jules Bastin (Somarone), London Symphony Orchestra conducted by Colin Davis. Philips 6700 121 (1977)"]}, {"page": "Semele (Handel)", "response": ["||Jennifer Vyvyan,William Herbert,Anna Pollack,George Pragnell,John Whitworth,Helen Watts,George James", "||Sheila Armstrong,Robert Tear,Helen Watts,Justino Díaz,Mark Deller,Helen Watts,Justino Diaz"]}, {"page": "Music of Wales", "response": ["In the twentieth century, Wales produced a large number of classical and operatic soloists of international reputation, including Ben Davies, Geraint Evans, Robert Tear, Bryn Terfel, Gwyneth Jones, Margaret Price, Rebecca Evans and Helen Watts, as well as composers such as Alun Hoddinott, William Mathias, Grace Williams and Karl Jenkins.  From the 1980s onwards, crossover artists such as Katherine Jenkins, Charlotte Church and Aled Jones began to come to the fore. Welsh National Opera, established in 1946, and the BBC Cardiff Singer of the World competition, launched in 1983, attracted attention to Wales's growing reputation as a centre of excellence in the classical genre."]}, {"page": "Janet Baker", "response": ["* Berlioz: Béatrice et Bénédict, with Christiane Eda-Pierre, Helen Watts, Robert Tear, London Symphony Orchestra, Colin Davis. Recorded Henry Wood Hall, 19–22 December 1977. LP Philips 6700 121.  CD 416 952 2. "]}, {"page": "Samson (Handel)", "response": ["|1978 || Robert Tear,Janet Baker, Helen Watts, Benjamin Luxon,John Shirley-Quirk"]}, {"page": "Rodelinda (opera)", "response": ["|Teresa Stich-Randall,Maureen Forrester,Alexander Young,Hilde Rössel-Majdan,Helen Watts,John Boyden"]}, {"page": "Milford Haven", "response": ["Performing artists from Milford Haven include Helen Watts, a contralto who studied at the Royal Academy of Music and was awarded the CBE in 1978, and singer-songwriter Sarah Howells, founder member of the pop band Paper Aeroplanes.Meet The Band Special: \"Paper Aeroplanes' Sarah Howells Discusses Little Letters\", Milford Mercury, 10 May 2013 The painter and actor George Winter (Scum, Merlin of the Crystal Cave) was born in the town.greatbritishlife.co.uk: George Winter Retrieved 30 January 2010 Television producer Annabel Jones was born and raised in Milford Haven, known for her work on the science fiction anthology series Black Mirror.Black Mirror's Annabel Jones talks about her journey from Milford Milford Mercury article, 20 September 2019 Actor Edward Palmer was born in Milford in 1910, later achieving television and film success in Witchfinder General, The Small Voice, Coronation Street and Upstairs, Downstairs.Edward Palmer (I) (1910–1982) Internet Movie Database, Retrieved 28 July 2017 Novelist Sarah Waters, although born in Neyland, attended Milford Haven Grammar School.\"Sarah Waters\", BBC Southwest Wales. Retrieved 30 January 2010 Notable academics include Sir James Frederick Rees, born in 1883 and the son of a Hakin dock worker, who became Principal of University College, Cardiff, and author of a number of historical texts, including The Story of Milford. He was appointed a Knight Bachelor in the 1945 New Year Honours. Dorothy Meyler, born 1908, joined University College of Wales, Aberystwyth in 1925, and later enjoyed a successful career teaching in the university, in addition to publishing several academic works.The London Mathematical Society  Retrieved 22 April 2014"]}, {"page": "Lenton, Nottingham", "response": ["Helen Watts was brought up in Lenton where her father was the vicar. She achieved local notoriety when she was first arrested for protesting about women's suffrage outside the Houses of Parliament in 1909."]}, {"page": "Heather Harper", "response": ["She initially sang as a mezzo-soprano. She was a member of the Ambrosian Chorus, where her fellow altos included Jean Allister, Pamela Bowden and Helen Watts, the BBC Chorus and the George Mitchell Singers. Her voice at this time was characterised by its \"bright, flexible coloratura\", more typical of a soprano. She studied with Helene Isepp, and retrained as a soprano with Frederick Husler and Yvonne Rodd-Marling, the authors of Singing: The Physical Nature of the Vocal Organ.", "Her recordings include Peter Grimes in both audio and video formats. In 1957, she took part in first recordings, conducted by Antony Hopkins, of sacred works by Michel Richard Delalande for the L'Oiseau-Lyre label. Some 1970s recordings, conducted by Sir Georg Solti, were reissued, notably Mahler's Eighth Symphony with Lucia Popp, Arleen Augér, Yvonne Minton, Helen Watts, René Kollo, John Shirley-Quirk and Martti Talvela; and Die Frau ohne Schatten by Richard Strauss with Helga Dernesch, Ruth Hesse, James King and Walter Berry (Covent Garden, 1976, Fiori). Two of her recordings won the Grammy Award, Peter Grimes in 1979 and Songs Of Maurice Ravel in 1984.  In 1964, the soprano sang in the first recording of Schoenberg's Von heute auf morgen (released in 1971), conducted by Robert Craft."]}, {"page": "Missa in Angustiis", "response": ["* Lord Nelson Mass, performed in 1962 by the King's College Choir and a reduced London Symphony Orchestra with Sylvia Stahlman (soprano), Helen Watts (contralto), Wilfred Brown (tenor), Tom Krause (baritone), Simon Preston (organ), conducted by Sir David Willcocks; recording re-released in 2000 by London/Decca Legends CD 458623"]}, {"page": "Hugh the Drover", "response": ["* HMV SLS 5162: Sheila Armstrong, Robert Tear, Helen Watts, Michael Rippon; Ambrosian Opera Chorus; Royal Philharmonic Orchestra; Sir Charles Groves, conductor (first recording)Hugh Ottaway, Review of recording of Hugh the Drover.  Musical Times, 120(1642), 1011 (1979)."]}, {"page": "Sosarme", "response": ["*L’Oiseau-Lyre OLS 124-6 (1954): Alfred Deller (Sosarme), William Herbert (Haliate), Margaret Ritchie (Elmira), Nancy Evans (Erenice), Helen Watts (Melo), Ian Wallace (Altomaro), John Kentish (Argone) The Saint Cecilia Orchestra; Anthony Lewis, conductorHicks, Anthony, \"Record Reviews: Sosarme\" (July 1972).  The Musical Times, 113 (1553): pp. 673-674."]}, {"page": "Eugene Aynsley Goossens", "response": ["Among his works as a composer are two symphonies (1940, 1945), two \"Phantasy\" concertos (one for piano, one for violin) both composed in the 1940s,Foreman, Lewis, booklet for Chandos CD CHAN 5193 two string quartets (1918, 1942), two violin sonatas (1918 and 1930) and a Concertino for string octet (1928) that became quite popular and was later re-scored for string orchestra.Paul Hindmarsh, notes for Chandos 9472 (1997) The Oboe Concerto (1927), was written for his brother, Léon Goossens. He wrote two operas, both with libretto by Arnold Bennett, which Banfield believes are among his major achievements: Judith (1929) and Don Juan de Manara (1935). The latter was broadcast by the BBC on 11 April 1959 with Monica Sinclair, Marie Collier, Helen Watts, Marion Lowe, Bruce Boyce, Robert Thomas and Andrei McPherson. The performance was conducted by Goossens himself. And between 1949 and 1954 he wrote a large-scale oratorio, The Apocalypse, after the Revelation of St. John.The Apocalypse, Lyrita recording reviewed at MusicWeb International"]}, {"page": "Lamentations of Jeremiah the Prophet", "response": ["** Leçons de Ténèbres, H 96, H 97, H 98/108, H 102, H 103, H 106, H 105, H 109, H 110, H 100 a - Anne Marie Rodde, Sonia Nigoghossian, Helen Watts, Clara Virz, La Grande Écurie et La Chambre du Roy, dir Jean Claude Malgoire. CBS 1978"]}, {"page": "Mavra", "response": ["* Decca: Joan Carlyle, Helen Watts, Monica Sinclair, Kenneth Macdonald; L'Orchestre de la Suisse Romande; Ernest Ansermet, conductor"]}, {"page": "Watts (surname)", "response": ["* Helen Watts, Welsh singer"]}, {"page": "Mitridate, re di Ponto", "response": ["*1971: Mozarteum, Salzburg; Mozarteum-Orchester Salzburg, Leopold Hager/Edda Moser, Arleen Augér, Helen Watts, Pilar Lorengar, Peter Schreier, Peter Baillie, Reingard Didusch (CD) "]}, {"page": "Judas Maccabaeus (Handel)", "response": ["|1971 || Alexander YoungHeather HarperJohn Shirley-QuirkHelen WattsPatricia ClarkJean Temperley|| Johannes SomaryEnglish Chamber OrchestraAmor Artis Chorale|| CD: Vanguard ClassicsCat: OVC 4072"]}, {"page": "Abbots Bromley School", "response": ["*Helen Watts (1927–2009), Welsh contralto singer"]}, {"page": "1978 in Wales", "response": ["*Operatic contralto Helen Watts is appointed a CBE."]}, {"page": "The Midsummer Marriage", "response": ["In 1976 Welsh National Opera staged a production designed by Annena Stubbs,Victoria and Albert Museum page on Annena Stubbs' work on WNO production which toured in cities including Leeds. The cast included Felicity Lott as Jenifer and Helen Watts, who had played the role in London in 1968, and recorded it in 1970, as Sosostris. David Cairns wrote that this production showed the opera \"responds very readily to simple, imaginative staging, and that there were never any serious problems [with it] except in our attitude\".\"Tippett and The Midsummer Marriage\", David Cairns. Sleeve note essay for Lyrita SRCD.2217", "|Helen Watts", "|Helen Watts", "* Philips 6703.027 (1971, 3-LP set, recorded Wembley Town Hall, July 1970). Reissued on CD by Lyrita: SRCD.2217, 1995: Alberto Remedios; Joan Carlyle; Raimund Herincx; Elizabeth Harwood; Stuart Burrows; Helen Watts; Covent Garden Chorus and Orchestra; Colin Davis, conductorKemp, Ian, \"Record Reviews: The Midsummer Marriage (May 1971). The Musical Times, 112 (1539): pp. 454–455."]}]}}