{"wiki_id": "http://www.wikidata.org/entity/Q4685184", "itemLabel": "Adrian Littlejohn", "itemDescription": "English footballer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Littlejohn", "wikipedia_page": {"main": "Adrian Sylvester Littlejohn (born 26 September 1970) is an English former footballer who played as a midfielder and a striker. He scored 74 goals in 425 league appearances in an 18-year career in the English Football League.\nHe began his professional career at Walsall, after moving from West Bromwich Albion in 1989. He moved on to Sheffield United two years later, before making a £100,000 move to Plymouth Argyle in September 1995. He helped Plymouth to win promotion out of the Third Division in 1996, before moving on to Oldham Athletic in March 1998. Eight months later he was sold on to Bury for £75,000. He returned to Sheffield United in October 2001, before transferring to Port Vale in February 2003. In August 2004 he switched to Lincoln City, before ending the season at Rushden & Diamonds. In September 2005 he signed with Mansfield Town before moving on to non-league club Leek Town the following year. He retired in 2008 following a brief spell at Retford United.", "link_mentions": [{"page": "Adrian", "response": ["*Adrian Littlejohn (born 1970), English footballer"]}, {"page": "Brian Horton", "response": ["The club entered a financial crisis following the collapse of ITV Digital, which cost the club £400,000 in revenue. This meant Horton had to build his squad for the 2001–02 season entirely on free transfers, the most influential proving to be former Coventry City striker Stephen McPhee. Vale beat rivals Stoke City, but ended the season in 14th-place. Horton was named as Manager of the Month after his team earned 13 points from a possible 18 in February. Horton signed Jon McCarthy, Brett Angell, Ian Brightwell, Phil Charnock, Sam Collins, and Mark Boyd for the 2002–03 campaign. Four straight defeats were followed by five consecutive victories, as he supplemented his squad with the additions of Lee Ashcroft, Peter Clarke and Adrian Littlejohn. Though relegation was avoided, Horton still remained unpopular with some sections of the Vale's supporters. However the season was dominated by off-the-field issues, as Vale entered administration, and were taken over by Bill Bratt's fan-based consortium."]}, {"page": "Littlejohn", "response": ["* Adrian Littlejohn (born 1970), a British footballer"]}, {"page": "List of people from Wolverhampton", "response": ["* Adrian Littlejohn (born 1970) – footballer, midfielder/forward"]}, {"page": "History of Port Vale F.C.", "response": ["Valiant 2001 eventually secured control of the club after a long and drawn-out process as the season neared its close. Bill Bratt became the new chairman, and even though the finances were still slim for quite a while, Vale were relatively buoyant. On the pitch, a brief cameo from veteran striker Brett Angell had kept the club above the relegation zone before Christmas with seven goals in fifteen games, and prodigy Billy Paynter helping out with five goals in a young-and-old partnership. However, with the financial problems, the funds were not found to keep Angell beyond November, and after a run of poor form Vale slipped into the bottom four in March. With the concern of immediate extinction over, and Horton's resourceful signing of experienced Adrian Littlejohn (who scored three goals) the final ten games saw an upturn in form and Vale eventually finish in seventeenth place. 2003–04 was a new era for the club off the pitch, with the club coming out of administration under a new board of fan-ownership. A reduction in match- and season-ticket prices saw around 3,000 season tickets sold. On the pitch, the club had ridden out administration by avoiding relegation (the ten-point penalty did not apply in 2003) with Brian Horton building a young, pacey side. The club made their best start to a season for many a year and found themselves top of the table at the end of September. Vale remained on course to at least be challenging for the play-offs come May. Their position in the table was based largely on the goals of an attacking front four: Billy Paynter and Adrian Littlejohn played on the right and left, while Steve Brooker and Stephen McPhee forming a partnership up front."]}, {"page": "Adrian Sylvester Littlejohn", "response": ["#REDIRECT Adrian Littlejohn"]}, {"page": "1996 Football League Third Division play-off Final", "response": ["Darlington were the first to settle with Gary Bannister a prominent player in midfield, but Plymouth Argyle eventually found their rhythm and had the first real goalscoring opportunity after ten minutes. Adrian Littlejohn found space after a one-two with Mickey Evans, but his first touch let him down and the opportunity was not taken. Darlington's main threat was coming from attacking full back Appleby and he had their best chance of the match midway through the first half. He carved out the initial chance, having carried the ball half the length of the pitch, but team-mate Steven Gaughan was unable to convert. The hasty clearance from Argyle found its way back to Appleby but he sent his shot over the crossbar with goalkeeper Cherry completely exposed.\"Jim'll fix it\" . The Sunday Mirror. London. 26 May 1996. Retrieved 10 March 2010.", "Plymouth Argyle came close to making their opponents pay for their profligacy in front of goal with Evans lifting a volley over the crossbar. Darlington's captain Andy Crosby was proving to be a formidable figure at the heart of his team's defence, but Argyle fashioned another chance to open the scoring just before half-time. A flick on by Evans presented Adrian Littlejohn with the opportunity to redeem his earlier miss, but he dragged his shot wide.\"Mauge magic\". The Sunday Mirror. London. 26 May 1996. Retrieved 10 March 2010.", "|CF ||9 ||Adrian Littlejohn"]}, {"page": "2002–03 Port Vale F.C. season", "response": ["The season started poorly with four straight defeats and only one goal scored from open play, causing fans to barrack Horton. Their form changed with a 1–0 win over Wigan Athletic at the JJB Stadium – the first in a sequence of five consecutive victories. Following this run victories were sparse for the Vale, and they picked up just four league victories until the beginning of March. The club agreed to sell Stephen McPhee to Wigan Athletic for £300,000, though the deal fell through over personal terms. In October, Lee Ashcroft arrived on loan from Wigan Athletic. Meanwhile, Jon McCarthy was released, and signed with Doncaster Rovers. The next month Brett Angell also departed after rejecting a new deal with the club, and instead joined Queens Park Rangers. A mini-revival began in the new year, as Vale were unbeaten in their three January league games. In February, defender Peter Clarke arrived on a three-month loan deal from Everton. Adrian Littlejohn also joined the club on a monthly contract, having left Lincoln City. There was a turnaround in form following a 1–0 win over Blackpool on 8 March, as eighteen points from the final twelve games of the season were enough to see off the fan's fears of relegation. Horton still remained unpopular with some sections of the Vale's supporters.", "|align=\"left\"|MF||27||align=\"left\"| Adrian Littlejohn", "|–||MF||||27||Adrian Littlejohn||3||0||0||0||3", "| February 2003 || MF ||  || Adrian Littlejohn || Sheffield United || Free transfer || "]}, {"page": "2003–04 Port Vale F.C. season", "response": ["They finished in seventh place with 73 points. They were level on points with Hartlepool United and Swindon Town, but finished outside of the play-off zone due to their inferior goal difference. Stephen McPhee scored 27 goals to become the club's top-scorer, the highest tally since Andy Jones hit 37 in 1986–87. Other major contributions came from Billy Paynter (14), Steve Brooker (8), Marc Bridge-Wilkinson (7) and Adrian Littlejohn (7).", "At the end of the season several players left the club: Neil Brisco (Rochdale); Liam Burns (Bristol Rovers); Adrian Littlejohn (Lincoln City); and Dean Delany (Shelbourne). Stephen McPhee also decided to leave the club, and though Chairman Bill Bratt had rejected offers of £100,000 for the player, McPhee exploited a loophole in his contract to join Portuguese side Beira-Mar. Marc Bridge-Wilkinson also turned down a new lower-paying contract, and instead signed with Stockport County. Player-coach Ian Brightwell also left Vale Park, having lost his assistant manager role to Glover, and joined Horton at Macclesfield Town. One boost was that Billy Paynter and George Pilkington put pen to paper on new long-term deals.", "|align=\"left\"|MF||20||align=\"left\"| Adrian Littlejohn", "|–||MF||||20||Adrian Littlejohn||7||0||0||0||7", "| August 2004 || MF ||  || Adrian Littlejohn || Lincoln City || Free transfer || "]}, {"page": "1991–92 Sheffield United F.C. season", "response": ["|Adrian Littlejohn"]}, {"page": "1997–98 Oldham Athletic A.F.C. season", "response": ["| Adrian Littlejohn"]}, {"page": "2005–06 Mansfield Town F.C. season", "response": ["|align=\"left\"|25||align=\"left\"|MF||align=\"left\"| Adrian Littlejohn"]}]}}