{"wiki_id": "http://www.wikidata.org/entity/Q468855", "itemLabel": "Margaret Hassan", "itemDescription": "British-Iraqi aid worker", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Hassan", "wikipedia_page": {"main": "Margaret Hassan (18 April 1945 – 8 November 2004), also known as \"Madam Margaret\", was an Irish-born aid worker who had worked in Iraq for many years until she was abducted and murdered by unidentified kidnappers in Iraq in 2004, at the age of 59. Her remains have never been recovered.", "link_mentions": [{"page": "List of kidnappings", "response": ["|Margaret Hassan"]}, {"page": "Daniel Pearl", "response": ["* Margaret Hassan"]}, {"page": "Occupation of Iraq (2003–2011)", "response": ["The hostage-taking appears to be uncoordinated, with different groups making various demands. Some hostages are released whilst others are killed, sometimes by beheading. Several kidnappings have been claimed by the Tawhid and Jihad (The Unity of God and Holy War) Islamist group, which changed its name to \"Al-Qaeda in Iraq\" in October 2004. The group was run by the Jordanian-born Palestinian Abu Musab al-Zarqawi. The hostages who have been beheaded by Zarqawi's group, and possibly by Zarqawi himself, include Americans Nick Berg, Eugene Armstrong and Jack Hensley, South Korean Kim Sun-il, Shosei Koda from Japan, and Kenneth Bigley from the UK. Italian Fabrizio Quattrocchi was shot in the head, possibly by another group, as was British aid worker Margaret Hassan. According to the Committee to Protect Journalists, at least 25 journalists have been kidnapped by armed groups in Iraq since April 2004, when insurgents began targeting foreigners for abduction."]}, {"page": "2004 in Iraq", "response": ["*November 16 – Margaret Hassan, 59, British-born Iraqi chief of the humanitarian relief organization CARE International, killed by hostage takers in Iraq (unconfirmed, but presumed dead)"]}, {"page": "Nick Berg", "response": ["* Margaret Hassan"]}, {"page": "Paul Marshall Johnson Jr.", "response": ["* Margaret Hassan"]}, {"page": "2004 in the United Kingdom", "response": ["* 19 October – British aid worker Margaret Hassan is taken hostage in Iraq.", "** It is reported that Margaret Hassan is dead after her family receive a video recording supposedly showing her being killed."]}, {"page": "2004 in Ireland", "response": ["* 19 October – Dublin-born aid worker Margaret Hassan was kidnapped in Iraq.", "* 16 November – Margaret Hassan was murdered by her captors in Iraq.", "* 16 November – Margaret Hassan, aid worker in Iraq, kidnapped and murdered by Iraqi insurgents (born 1945)."]}, {"page": "1945 in Ireland", "response": ["* 18 April – Margaret Hassan, aid worker in Iraq, kidnapped and murdered by Iraqi insurgents (died 2004)."]}, {"page": "Shosei Koda", "response": ["* Margaret Hassan"]}, {"page": "Foreign hostages in Iraq", "response": ["* Margaret Hassan, the director of CARE International -- who held British, Iraqi and Irish citizenship -- was kidnapped in Baghdad on October 19, 2004. Her Iraqi driver and Iraqi unarmed security guard were not taken. She was killed in a video released on November 16, 2004."]}, {"page": "Margaret Fitzsimmons", "response": ["#REDIRECT Margaret Hassan"]}, {"page": "Iraq War", "response": ["* The publicised killing of several contractors; Eugene Armstrong, Jack Hensley, Kenneth Bigley, Ivaylo Kepov and Georgi Lazov (Bulgarian truck drivers.) Other non-military personnel murdered include: translator Kim Sun-il, Shosei Koda, Fabrizio Quattrocchi (Italian), charity worker Margaret Hassan, reconstruction engineer Nick Berg, photographer Salvatore Santoro (Italian) and supply worker Seif Adnan Kanaan (Iraqi.) Four private armed contractors, Scott Helvenston, Jerko Zovko, Wesley Batalona and Michael Teague, were killed with grenades and small arms fire, their bodies dragged from their vehicles, beaten and set ablaze. Their burned corpses were then dragged through the streets before being hung over a bridge crossing the Euphrates."]}, {"page": "International health", "response": ["These organizations often go in harm's way to provide services to people affected by natural disaster or conflict. For example, Médecins Sans Frontières has lost members in the Darfur area, and Care International's Iraq Director, Margaret Hassan (a long-time Iraq resident with dual Iraqi-British citizenship) was brutally murdered on the Internet by Al Qaeda-affiliated terrorists for the \"crime\" of providing services equitably among Iraqis. International Medical Corps was begun in response to the suffering of the Afghan people after the Soviet invasion of 1979, and is adept at providing services in dangerous places (see Attacks on humanitarian workers)."]}, {"page": "Hassan (surname)", "response": ["* Margaret Hassan (1945–2004), Irish aid worker murdered in Iraq"]}, {"page": "Piotr Stańczak", "response": ["* Margaret Hassan"]}, {"page": "Deaths in November 2004", "response": ["*Margaret Hassan, 59, British aid worker, chief of the humanitarian relief organization CARE International, presumed killed by hostage takers in Iraq."]}, {"page": "Harmeet Singh Sooden", "response": ["There have been media reports suggesting the Christian Peacemaker Teams kidnapping is linked to the abductions of British aid worker Margaret Hassan in 2004 and United States journalist Jill Carroll in 2006, and to extrajudicial killings (for example, the death of Muharib Abdul-Latif al-Jubouri in 2007)."]}]}}