{"wiki_id": "http://www.wikidata.org/entity/Q4685424", "itemLabel": "Adrian Weale", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Weale", "wikipedia_page": {"main": "Adrian Weale (born 9 February 1964) is a British writer, journalist, illustrator and photographer of Welsh origin.  He was educated at Latymer Upper School, University of York, Royal Military Academy Sandhurst and the Joint Services Command and Staff College.", "link_mentions": [{"page": "Adrian", "response": ["*Adrian Weale (born 1964), English writer, journalist, illustrator and photographer"]}, {"page": "Heinrich Himmler", "response": ["Historian John Toland relates a story by Günter Syrup, a subordinate of Heydrich. Heydrich showed him a picture of Himmler and said: \"The top half is the teacher, but the lower half is the sadist.\" Historian Adrian Weale comments that Himmler and the SS followed Hitler's policies without question or ethical considerations. Himmler accepted Hitler and Nazi ideology and saw the SS as a chivalric Teutonic order of new Germans. Himmler adopted the doctrine of  (\"mission command\"), whereby orders were given as broad directives, with authority delegated downward to the appropriate level to carry them out in a timely and efficient manner. Weale states that the SS ideology gave the men a doctrinal framework, and the mission command tactics allowed the junior officers leeway to act on their own initiative to obtain the desired results."]}, {"page": "British Free Corps", "response": ["The British Free Corps (; BFC) was a unit of the Waffen-SS of Nazi Germany during World War II, made up of British and Dominion prisoners of war who had been recruited by Germany. The unit was originally known as the Legion of St George. Research by British historian Adrian Weale has identified 54 menWeale (2014), Kindle Locations 3757-3758. Appendix 5 British Members of the British Free Corps and their Aliases. who belonged to this unit at one time or another, some for only a few days. At no time did it reach more than 27 men in strength."]}, {"page": "Gottlob Berger", "response": ["Berger later claimed that he had come up with the idea of SS combat troops wearing camouflage jackets from his own hunting days, and had suggested it to SS-Obergruppenführer Sepp Dietrich, commander of the Leibstandarte SS Adolf Hitler Regiment (LSSAH). From 1938, various forms of Flecktarn camouflage were issued. The author Adrian Weale doubts Berger's account."]}, {"page": "Latymer Upper School", "response": ["*Adrian Weale, writer and historian"]}, {"page": "Collaboration with the Axis powers", "response": ["The British Free Corps (German: Britisches Freikorps) was a Waffen SS unit consisting of British and Dominion prisoners of war recruited by the Nazis. Research by British historian Adrian Weale identified 54 menWeale, Adrian (12 November 2014). Renegades – Appendix 5 British Members of the British Free Corps and their Aliases(Kindle Locations 3757-3758). Random House. Kindle Edition. who belonged to this unit at one time or another, some for a few days. At no time did it reach more than 27 men in strength."]}, {"page": "Cultural impact of the Falklands War", "response": ["The war provided a wealth of material for writers, and many dozens of books came from it; in the United Kingdom (UK) an account was Max Hastings and Simon Jenkins' The Battle for the Falklands. Major General Julian Thompson, of the Royal Marines, wrote his own account as commander in his 1985 book No Picnic: 3 Commando Brigade in the South Atlantic. Other titles focused on the Sea Harrier (Sharkey Ward's Sea Harrier over the Falklands), the land battles leading up to the Argentine surrender (Christian Jennings and Adrian Weale's Green Eyed Boys), and the general experience of battle and life in the surrounding area (Ken Lukowiak's A Soldier's Song and Marijuana Time). Vincent Bramley's \"Forward into Hell\" offers a less apologetic account of the War. In Argentina, one of the best-known is Commodore Pablo Carballo's Halcones de Malvinas, a collection of personal experiences of fighter pilots and many others and mandatory reading for admission to the FAA's Escuela de Aviación Militar."]}, {"page": "List of Allied traitors during World War II", "response": ["*Oswald John Job - Civilian - London-born son of German parents - \"may well have been an informer\" within St Denis internment campAdrian Weale. Renegades: Hitler's Englishmen. London: Weidenfeld & Nicolson, 2nd edition, 2014- Guilty of treachery, executed on 16 March 1944.Sean Murphy. Letting the Side Down: British Traitors of the Second World War, PP45-8; London: The History Press Ltd, 2005.  "]}, {"page": "Heinz Höhne", "response": ["There are a number of references to Höhne's work on the SS by other historians who have written works on Nazi Germany. More recently, Adrian Weale's work, Army of Evil: A History of the SS frequently cites Höhne's The Order of the Death's Head: The Story of Hitler's SS, although challenging some of the assertions found therein."]}, {"page": "Thomas Haller Cooper", "response": ["Cooper was then moved to a subunit based at the Dębica training area near Kraków. His detachment centred on the security and administration of the training area. Cooper was also promoted to SS-Unterscharführer in November 1941. It has been stated that \"the circumstantial case is compelling\" that Cooper was involved in the Holocaust.Adrian Weale. Renegades: Hitler's Englishmen. London: Weidenfeld & Nicolson, 2nd edition, 2014", "Cooper was released in January 1953 and is believed to have emigrated to Japan. He reportedly settled in Tokyo, converted to Buddhism and became a language teacher.Sean Murphy. Letting the Side Down: British Traitors of the Second World War, P215. London: The History Press Ltd, 2005.  Author Adrian Weale states that he subsequently returned to England and died in early 1987, aged 67. Another book, \"Hitler's Bastard\", claims he died in the late 1990s.Hitler's Bastard, Through Hell and Back in Nazi Germany and Stalin's Russia, pg. 228"]}, {"page": "CWA Gold Dagger for Non-Fiction", "response": ["**Adrian Weale, Patriot Traitors: Roger Casement, John Amery and the Real Meaning of Treason (Roger Casement and John Amery, the only Britons to be executed for high treason in the 20th century)"]}, {"page": "Philip Sessarego", "response": ["In 1999, with the assistance of a ghost writer (Adrian Weale) Sessargo wrote an account of his military experiences in the Afghan-Soviet War entitled Jihad! – The Secret War in Afghanistan, which was published in 2000, stating erroneously in its text that he had been in that theatre of operations as a trooper in the Special Air Service. The book sold reasonably well, being serialized in The Sunday Times, with print-runs in several European countries, as well as Australia. A paperback edition was published in 2001. On 11 September 2001 Arab jihadists staged an attack within the continental United States of America, hi-jacking several commercial air-liners and suicidally crashing them into key commercial and governmental landmark buildings, and the aftermath of the event created an immense demand for information on the nature and motivation of the attackers, which transferred into a surge in sales of Jihad! in excess of 50,000 copies, making it a best-seller, and Sessarego (using the pen-name of \"Tom Carew\") an in-demand figure in the British media for expert comment on Jihadism.'The fantasy life & lonely death of the SAS veteran who never was', 'The Guardian', 24 January 2009.", "After the film of the confrontation was broadcast by the BBC's evening Newsnight show, Sessarego was generally ridiculed in the British media for being a \"fantasist\", calling into doubt not just his claims to have been a trooper in the SAS but the whole content of Jihad!. His publisher's attempts to defend the book's validity by offering to remove a small part of its text which had made the erroneous claims regarding the Regiment (with the book's ghostwriter Adrian Weale defending its content by ripping out one page of its text during an interview with the BBC as an illustration of how little space had been taken up with the claims regarding the Special Air Service) were not sufficient in stemming the media's condemnation, and the book was subsequently withdrawn from further sale. Sessarego withdrew from the media spotlight, his publishing/media career at an end.'The fantasy life & lonely death of the SAS veteran who never was,'The Guardian', 24 January 2009."]}]}}