{"wiki_id": "http://www.wikidata.org/entity/Q4685307", "itemLabel": "Adrian Raine", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Raine", "wikipedia_page": {"main": "Adrian Raine (born 27 January 1954) is a British psychologist. He currently holds the chair of Richard Perry University Professor of Criminology & Psychiatry in the Department of Criminology of the School of Arts and Sciences and in the Department of Psychiatry of the School of Medicine at the University of Pennsylvania. He is noted for his research on the neurobiological and biosocial causes of antisocial and violent behavior in children and adults. He was the first scientist to use neuroimaging to study the brains of murderers. His 2013 book The Anatomy of Violence won that year's Athenaeum Literary Award.", "link_mentions": [{"page": "Altruism", "response": ["In fact, in an experiment published in March 2007 at the University of Southern California neuroscientist Antonio R. Damasio and his colleagues showed that subjects with damage to the ventromedial prefrontal cortex lack the ability to empathically feel their way to moral answers, and that when confronted with moral dilemmas, these brain-damaged patients coldly came up with \"end-justifies-the-means\" answers, leading Damasio to conclude that the point was not that they reached immoral conclusions, but that when they were confronted by a difficult issue – in this case as whether to shoot down a passenger plane hijacked by terrorists before it hits a major city – these patients appear to reach decisions without the anguish that afflicts those with normally functioning brains. According to Adrian Raine, a clinical neuroscientist also at the University of Southern California, one of this study's implications is that society may have to rethink how it judges immoral people: \"Psychopaths often feel no empathy or remorse. Without that awareness, people relying exclusively on reasoning seem to find it harder to sort their way through moral thickets. Does that mean they should be held to different standards of accountability?\""]}, {"page": "Compassion", "response": ["In fact, in an experiment published in March 2007 at the University of Southern California neuroscientist Antonio R. Damasio and his colleagues showed that subjects with damage to the ventromedial prefrontal cortex lack the ability to feel their way empathically to moral answers and that when confronted with moral dilemmas, these brain-damaged patients coldly came up with \"end-justifies-the-means\" answers, leading Damasio to conclude that the point was not that they reached immoral conclusions, but that when they were confronted by a difficult issue – in this case as to whether to shoot down a passenger plane hijacked by terrorists before it hits a major city – these patients appear to reach decisions without the anguish that afflicts those with normally functioning brains. According to Adrian Raine, a clinical neuroscientist also at the University of Southern California, one of this study's implications is that society may have to rethink how it judges immoral people: \"Psychopaths often feel no empathy or remorse. Without that awareness, people relying exclusively on reasoning seem to find it harder to sort their way through moral thickets. Does that mean they should be held to different standards of accountability?\""]}, {"page": "Golden Balls", "response": ["British psychologist Adrian Raine criticised the show, arguing that it \"encourages deceitfulness\", and that many of its contestants are celebrated for displaying \"characteristics of psychopathy\".Raine, Adrian. \"21st Century Television's Faltering Moral Compass\". The Economist. 8 April 2009. In a review of another ITV quiz show—The Colour of Money—Charlie Brooker criticised Golden Balls rules, saying that \"[Golden Balls] has more rules and clauses than the European Convention on Human Rights\""]}, {"page": "Raine", "response": ["* Adrian Raine (born 1954), British-American psychologist"]}, {"page": "Helen S. Mayberg", "response": ["Neurolaw, related to Neurocriminology, is based on the concept that MRI and PET scans as well as other means of examining of a person’s brain composition, can be used to hold harmless an alleged perpetrator in a court of law. Or, conversely, to justify a conviction. Adrian Raine was among those who postulated this theory in the 1980s, and it gained attention in the press after the trial and conviction of John Hinckley Jr."]}, {"page": "Carmel College, Darlington", "response": ["* Adrian Raine D. Phil (York) psychologist. Chair, Richard Perry University Professor of Criminology and Psychiatry & University of Pennsylvania. (1965–72)"]}, {"page": "Psychopathy", "response": ["In an experiment published in March 2007 at the University of Southern California neuroscientist Antonio R. Damasio and his colleagues showed that subjects with damage to the ventromedial prefrontal cortex lack the ability to empathically feel their way to moral answers, and that when confronted with moral dilemmas, these brain-damaged patients coldly came up with \"end-justifies-the-means\" answers, leading Damasio to conclude that the point was not that they reached immoral conclusions, but that when they were confronted by a difficult issue – in this case as whether to shoot down a passenger plane hijacked by terrorists before it hits a major city – these patients appear to reach decisions without the anguish that afflicts those with normally functioning brains. According to Adrian Raine, a clinical neuroscientist also at the University of Southern California, one of this study's implications is that society may have to rethink how it judges immoral people: \"Psychopaths often feel no empathy or remorse. Without that awareness, people relying exclusively on reasoning seem to find it harder to sort their way through moral thickets. Does that mean they should be held to different standards of accountability?\""]}, {"page": "Athenaeum of Philadelphia", "response": ["**Adrian Raine, The Anatomy of Violence: The Biological Roots of Crime"]}, {"page": "Ned (Scottish)", "response": ["British psychologist Adrian Raine has expressed contempt for what he feels is the glorification of ned culture in the Scottish media. He has also opined that ned culture is closely correlated with psychopathy.Raine, Adrian. \"21st Century Television's Faltering Moral Compass\". The Economist. 8 April 2009."]}, {"page": "Neurocriminology", "response": ["The origins of neurocriminology go back to one of the founders of modern criminology, 19th-century Italian psychiatrist and prison doctor Cesare Lombroso, whose beliefs that the crime originated from brain abnormalities were partly based on phrenological theories about the shape and size of the human head. Lombroso conducted a postmortem on a serial killer and rapist, who had an unusual indentation at the base of the skull. Lombroso discovered a hollow part in the killer's brain where the cerebellum would be. Lombroso's theory was that crime originated in part from abnormal brain physiology and that violent criminals where throwbacks to less evolved human types identifiable by ape-like physical characteristics. Criminals, he believed, could be identified by physical traits, such as a large jaw and sloping forehead. The contemporary neuroscientists further developed his idea that physiology and traits of the brain underlie all crime. The term “neurocriminology” was first introduced by James Hilborn (Cognitive Centre of Canada) and adopted by the leading researcher in the field, Dr. Adrian Raine, the chair of the Criminology Department at University of Pennsylvania. He was the first to conduct brain imaging study on violent criminals."]}, {"page": "Academy of Experimental Criminology", "response": ["*Adrian Raine (2013-2015)"]}, {"page": "Joker (2019 film)", "response": ["British neurocriminologist Adrian Raine was impressed by how accurate the film's depiction of the psychology of a murderer was. In an interview with Vanity Fair, he described it as \"a great educational tool\" and stated that he planned to present film clips during his classes. Psychiatrist Kamran Ahmed highlighted the factors in Arthur's childhood such as parental abuse and loss, and family history of mental illness in the genesis of his condition. American psychiatrist Imani Walker, who is known for her Bravo television series Married to Medicine Los Angeles and working with violent criminals with mental disorders, analyzed the Joker's apparent mental disorders and circumstances, and noted that Arthur tries to find help before his downfall, only to be abandoned. She says of Arthur and others in poverty who have mental illness: \"We as a society don't even pretend that they're real people. And that's what this movie is about. He never had a chance.\""]}, {"page": "1995 University of Maryland conference on crime and genetics", "response": ["The conference took place from Friday, September 22 to Sunday, September 24, 1995, at the Aspen Institute, a liberal think tank in Queenstown, Maryland. In total, about 70 \"biologists, criminologists, historians, and philosophers\" attended the conference, according to Science. Panelists included Diana Fishbein, Dorothy Nelkin, Evan Balaban, David Comings, Irving Gottesman, Adrian Raine, and Adrienne Asch."]}, {"page": "TEDxVienna", "response": ["Prominent speakers were, for example, Jocelyn Bell Burnell, Adrian Raine, Ron Haviv, Johannes Grenzfurthner of monochrom, Jeffrey Kluger, Jasmin Hagendorfer, Kevin Lieber of Vsauce, Julia Dujmovits, Gurit Birnbaum, "]}]}}