{"wiki_id": "http://www.wikidata.org/entity/Q4685086", "itemLabel": "Adrian Haydon", "itemDescription": "British table tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Haydon", "wikipedia_page": {"main": "Arthur 'Adrian' Haydon (1911 – 12 September 1973)  was a male international table tennis player from England.", "link_mentions": [{"page": "Ann Jones (tennis)", "response": ["Jones was born in Kings Heath, Birmingham, England.Dodd, Ros. \"Interview – Ann Jones: Ann settles out of court,\" Birmingham (UK) Post, Saturday, June 24, 2000. Her parents were prominent table tennis players, her father, Adrian Haydon, having been English number 1 and a competitor at world championships between 1928 and 1953. Ann, as a young girl, also took up the game, participating in five world championships in the 1950s, the best result being losing finalist in singles, doubles and mixed doubles all in Stockholm 1957.World Championship Stockholm SWEDEN 1957. ittf.com Soon after this she wrote the book Tackle Table Tennis This Way.Haydon, Ann (1958) Tackle Table Tennis This Way. S. Paul"]}, {"page": "Charlie Bull", "response": ["Bull spent his winters playing table tennis and was one of the top players in England. He represented England several times in the World Table Tennis Championships. In the 1928 Stockholm World Championship, he was one of the three teenagers in the English team with Fred Perry and Adrian Haydon."]}, {"page": "Johnny Leach", "response": ["Leach tried the new paddles the following year, but found he could not adapt. He was again eliminated in the round of 16 at the 1953 World Championships, this time by Czechoslovakia's Frantisek Tokar. In doubles, Leach and Bergmann again made the final, losing to the Hungarian team of Sidó and József Kóczián in five sets. In the team competition, Leach, Bergman, Adrian Haydon, Brian Kennedy, and Aubrey Simons won the Swaythling Cup, giving Leach a third World Title.  The team title was the first in Great Britain's history, and, as of 2014, has not been duplicated."]}]}}