{"wiki_id": "http://www.wikidata.org/entity/Q4684930", "itemLabel": "Adrian Clarke", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Clarke_(photographer)", "wikipedia_page": {"main": "Adrian Clarke is an English photographer. Originally trained and practising as a civil liberties lawyer, Clarke made the switch to photography in 2003.\nHis work is in a social realist style. His first major set of pictures was Framed, a series of pictures of subjects who had served long prison sentences for crimes they did not commit. Between 2004 and 2007 he worked in partnership with the County Durham Drug and Alcohol Action Team photographing a community of abusers of drugs and alcohol in the north east of England. The work was collected in a book, Gary's Friends, named after Gary Crooks, a reformed dealer who introduced him to friends and relatives. The work was published in September 2007 and was shown at the Durham Arts Festival in June 2008.\nHis most recent work is South Bank a series of portraits of residents of the area between Middlesbrough and Redcar and continues the themes explored in his earlier work. The work was displayed at the Python Gallery in Middlesbrough in May and June 2009.\nClarke was married to the writer Rachel Cusk. While Cusk has written and spoken publicly on their marriage in The Guardian and the BBC, Clarke has not spoken about their marital split.", "link_mentions": [{"page": "Adrian", "response": ["*Adrian Clarke (born 1938), New Zealand rugby player", "*Adrian Clarke (born 1974), English footballer", "*Adrian Clarke (born 1991), Canadian football player", "*Adrian Clarke, British poet", "*Adrian Clarke, English photographer"]}, {"page": "Alexander Masters", "response": ["In 2007, he collaborated with photographer Adrian Clarke on the book Gary's Friends, chronicling the lives of drug and alcohol abusers in North East England."]}, {"page": "Rachel Cusk", "response": ["After a brief first marriage to a banker, Cusk was married to photographer Adrian Clarke, with whom she has two daughters. The couple separated in 2011. Their divorce became a major topic in Cusk's writings."]}, {"page": "Adrian Clarke", "response": ["Adrian Clarke may refer to:", "* Adrian Clarke (footballer) (born 1974), English footballer", "* Adrian Clarke (photographer), English photographer", "* Adrian Clarke (poet), English poet", "* Adrian Clarke (rugby union) (born 1938), New Zealand rugby union player", "* Adrian Clarke (Canadian football) (born 1991), Canadian football player"]}, {"page": "Aftermath: On Marriage and Separation", "response": ["Aftermath: On Marriage and Separation is a 2012 divorce memoir by Rachel Cusk dealing with her marriage and divorce from her husband Adrian Clarke.  It follows two earlier memoirs, one related to their children: A Life's Work: On Becoming a Mother."]}]}}