{"wiki_id": "http://www.wikidata.org/entity/Q4685130", "itemLabel": "Adrian Jack", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Jack", "wikipedia_page": {"main": "Adrian Frederick Joseph Jack (born 16 March 1943, in England) is a British Composer.", "link_mentions": [{"page": "1968 in music", "response": ["| Barraqué, Jean || Le Temps restitué (1956–68) || 1968-04-04 || Royan Festival, France || Pilarczyk – French Radio Choir – Ensemble du Domaine Musical, AmyRose-Marie Janzen, \"A Biographical Chronology of Jean Barraqué\", translated by Adrian Jack, Perspectives of New Music 27, no. 1 (Winter 1989): 234–245. Citation on 242."]}, {"page": "1960 in music", "response": ["| Barraqué, Jean || ... Au delà du hasard || 1960-01-26 || Théâtre de l'Odéon, Paris || Loriod, Semser, Cahn, Codinas, Rostaing, Jazz Groupe de Paris (dir. Hodeir), Domaine Musical – BoulezRose-Marie Janzen, \"A Biographical Chronology of Jean Barraqué\", translated by Adrian Jack, Perspectives of New Music 27, no. 1 (Winter 1989): 234–245."]}, {"page": "Sinan Savaskan", "response": ["Savaskan's music has been programmed widely by organisations and ensembles such as the ICA (Institute of Contemporary Arts, London) – in particular its MusICA series run for many years by Adrian Jack – the BBC, Lontano, the Balanescu Quartet, the Smith Quartet, the S.E.M. Ensemble of New York, and such conductors as Martyn Brabbins, Zsolt Nagy and Petr Kotik."]}, {"page": "Andrew Wilde (pianist)", "response": ["Wilde plays often as a recitalist,Review of Concert at RNCM, Guardian 2001 and has a particular affinity for the music of Chopin.Adrian Jack (1997-03-18),"]}, {"page": "Kevin Kenner", "response": ["His achievements have won him critical acclaim from all over the world. He has been praised as \"one of the finest American pianists to come along in years\" (Howard Reich, Chicago Tribune), \"...fulfilling a criterion which one only knows from great Chopinists such as Rubinstein, Benedetti-Michelangeli and Dinu Lipatti\" (Winfried Wild, Schwaebische Zeitung, Germany).  Adrian Jack of London's Independent describes one of Kenner's recitals as \"...the best performance I have ever heard in the concert hall of all four of Chopin's Ballades\". The Financial Times in London described Kenner as a \"player of grace, subtle variety and strength, with a mature grasp of dramatic structure and proportion: in short, a grown-up musician nearing his peak.\"  And the Washington Post recently proclaimed him \"a major talent ... an artist whose intellect, imagination and pianism speak powerfully and eloquently.\"  The conductor Stanislaw Skrowaczewski, who recorded with pianists such as Arthur Rubinstein, claimed Kenner's Chopin interpretations to be the most sensitive and beautiful he remembered."]}, {"page": "Jack (surname)", "response": ["*Adrian Jack (born 1943), British composer"]}]}}