{"wiki_id": "http://www.wikidata.org/entity/Q468344", "itemLabel": "Stevie Smith", "itemDescription": "Britisch poet, novelist, illustrator, performer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stevie_Smith", "wikipedia_page": {"main": "Florence Margaret Smith, known as Stevie Smith (20 September 1902 – 7 March 1971), was an English poet and novelist. She won the Cholmondeley Award and was awarded the Queen's Gold Medal for Poetry. A play, Stevie by Hugh Whitemore, based on her life, was adapted into a film starring Glenda Jackson.\n\n", "link_mentions": [{"page": "List of English-language poets", "response": ["*Stevie Smith (1902–1971, E)"]}, {"page": "Epigram", "response": [":— Stevie Smith"]}, {"page": "September 20", "response": ["*1902 – Stevie Smith, English author and poet (d. 1971)"]}, {"page": "Scorpion", "response": ["The fable of The Scorpion and the Frog has been interpreted as showing that vicious people cannot resist hurting others, even when it is not in their interests. More recently, the action in John Steinbeck's 1947 novella The Pearl centers on a poor pearl fisherman's attempts to save his infant son from a scorpion sting, only to lose him to human violence. Scorpions have equally appeared in western artforms including film and poetry: the surrealist filmmaker Luis Buñuel made symbolic use of scorpions in his 1930 classic L'Age d'or (The Golden Age), while Stevie Smith's last collection of poems was entitled Scorpion and other Poems. A variety of martial arts films and video games have been entitled Scorpion King."]}, {"page": "University of Tulsa", "response": ["Currently, the library's Department of Special Collections and University Archives houses over twelve million archival items and has over a thousand collections on a wide-ranging array of topics including 20th-century British, Irish, and American literature, which includes the world's second largest collection of materials by James Joyce. It also houses the papers of Nobel Prize winners V.S. Naipaul and Doris Lessing, as well as novelists and poets Jean Rhys, Eliot Bliss, David Plante, Anna Kavan, and Stevie Smith, just to name a few. In addition to these famous novelists, McFarlin Library's houses the papers of Congresswoman Alice Mary Robertson, literary critic Richard Ellmann, comic book innovator E. Nelson Bridwell, Cherokee Principal Chief J.B. Milam, and writer/sexologist Edward Charles, among others.  The Department of Special Collections also contains a vast collection of books on Native American history."]}, {"page": "1971", "response": ["* March 7 – Stevie Smith (Florence Margaret Smith), English poet and novelist (b. 1902)"]}, {"page": "Malcolm Lowry", "response": ["* An Anthology from X (Oxford University Press 1988). X ran from 1959 to 1962. Edited by David Wright & Patrick Swift. Contributions from Lowry, W.H. Auden, Samuel Beckett, Alberto Giacometti, Francis Bacon (painter), Stevie Smith, Robert Graves, David Gascoyne, et al."]}, {"page": "List of poets", "response": ["*Stevie Smith (1902–1971), English poet and novelist"]}, {"page": "Palmers Green", "response": ["* Stevie Smith, poet and novelist, lived at No 3 Avondale Road from 1905 until her death in 1971."]}, {"page": "Tanita Tikaram", "response": ["* Adaptation of the poem \"Not Waving but Drowning\" by Stevie Smith, commissioned by the BBC for their Texts in Time educational series and released on the 1995 Tikaram single \"I Might Be Crying\"."]}, {"page": "Glenda Jackson", "response": ["|Stevie Smith", "|Stevie Smith"]}, {"page": "English poetry", "response": ["John Betjeman and Stevie Smith, who were two other significant poets of this period, who stood outside all schools and groups. Betjeman was a quietly ironic poet of Middle England, with a command of a wide range of verse techniques. Smith was an entirely unclassifiable one-off voice."]}, {"page": "Golden Globe Award for Best Actress in a Motion Picture – Drama", "response": ["| Glenda Jackson || Stevie Smith || Stevie"]}, {"page": "1950 in literature", "response": ["*Stevie Smith – Not Waving but Drowning"]}, {"page": "1971 in literature", "response": ["*March 7 – Stevie Smith (Florence Margaret Smith), English poet and novelist (born 1902)"]}, {"page": "1969 in literature", "response": ["*Queen's Gold Medal for Poetry: Stevie Smith"]}, {"page": "1966 in literature", "response": ["*Cholmondeley Award: Ted Walker, Stevie Smith"]}, {"page": "Jonathan Miller", "response": ["* Stevie Smith, a friend of his mother Betty Miller, \"rather disloyally\" included a thinly-disguised and uncomplimentary version of the nine-year-old Miller, \"precocious and brattish... constantly demanding attention\", in her short story 'Beside the Seaside: A Holiday with Children' (1949)."]}, {"page": "Not Waving but Drowning", "response": ["\"Not Waving but Drowning\" is a poem by the British poet Stevie Smith. It was published in 1957 as part of a collection of the same title.Sternlicht, Sanford V.Stevie Smith. Twayne Publishers (1990) p. 63. The most famous of Smith's poems,Hotz-Davies, Ingrid. \"My Name is Finis: The Loneliness of Stevie Smith\". Rodopi (1994) p.233. it gives an account of a drowned man whose distressed thrashing in the water had been mistaken for waving.Rose, Gillian. Mourning becomes the law: philosophy and representation. Cambridge University Press (1996) p.38. The poem was accompanied by one of Smith's drawings, as was common in her work.", "The poem's personal significance has been the topic of several pieces of literary criticism because Smith was treated for psychological problems. She contemplated suicide at the age of eight after what she described as a difficult childhood and her struggle with the fact that her father abandoned her.Walsh, Jessica. \"Stevie Smith: Girl Interrupted\"Papers on Language and Literature\" Vol.40.", "The image that Smith attached to the poem shows the form of a girl from the waist up with her wet hair hanging over her face. Although the image goes with a poem about a man drowning, the girl's expression appears incongruous with the text of the poem as it forms what Smith scholar Laura Severin describes as a \"mysterious smile\". Jannice Thaddeus suggests that the speaker of the poem, like other figures in Smith's works, changes from male to female as part of a theme of androgyny that exists in many of the poems found in Selected Poems.Thaddeus, Janice.\"Stevie Smith and the Gleeful Macabre,\" Contemporary Poetry Vol. 111, No. 4, 1978, pp. 36-49. Severin suggests that the figure might be Mary, a character in another poem by Smith titled \"Cool as a Cucumber\". The drawing was used as the accompanying image for the poem \"The Frozen Lake\" in Selected Poems, a self-edited compilation of Smith's works published in 1962.Severin, Laura. Stevie Smith's Resistant Antics. Univ. of Wisconsin Press (1997) p.71-72.Smith, Stevie. Collected PoemsNew Directions Publishing (1983) pp 393-396.", "The poem was set to music by singer-songwriter Vic Chesnutt on his debut album Little, with a spoken introduction from a Stevie Smith recording.", "British confessional rapper Loyle Carner used the poem's title for his sophomore album of the same name. The title track features Stevie Smith commenting on the poem over piano chords composed by Jordan Rakei.", "*Stevie Smith reading \"Not Waving But Drowning\" (includes poem text and poet's picture)"]}, {"page": "Person from Porlock", "response": ["It has been suggested by Elisabeth Schneider (in Coleridge, Opium and \"Kubla Khan\", University of Chicago Press, 1953), among others, that this prologue, as well as the person from Porlock, was fictional and intended as a credible explanation of the poem's seemingly fragmentary state as published. The poet Stevie Smith also suggested this view in one of her own poems, saying \"the truth is I think, he was already stuck\".Stevie Smith, \"Thoughts about the Person from Porlock\"", "* Stevie Smith's poem \"Thoughts About the Person from Porlock\" begins as a gentle ribbing of Coleridge and ends in a meditation on loneliness, creativity, and depression. "]}, {"page": "Palgrave's Golden Treasury", "response": ["Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "Granta", "response": ["In this form the magazine had a long and distinguished history. The magazine published juvenilia of a number of writers who later became well known: Geoffrey Gorer, William Empson,John Haffenden, Oxford Dictionary of National Biography Michael Frayn, Ted Hughes, A. A. MilneJ. P. C. Roach, \"The University of Cambridge: The modern university (1882-1939)\", in A History of the County of Cambridge and the Isle of Ely: Volume 3: The City and University of Cambridge (1959), pp. 266–306; and F. A. Rice, The Granta and its contributors, 1889-1914, London: Constable, 1924. Sylvia Plath, Bertram Fletcher Robinson, John Simpson, and Stevie Smith."]}, {"page": "Stella Gibbons", "response": ["In 1915 Stella became a pupil at the North London Collegiate School, then situated in Camden Town. The school, founded in 1850 by Frances Buss, was among the first in England to offer girls an academic education, and by 1915 was widely recognised as a model girls' school.Cockburn et al., pp. 308–10  After the haphazard teaching methods of her governesses, Stella initially had difficulty in adjusting to the strict discipline of the school, and found many of its rules and practices oppressive.Oliver, pp. 26–29 She shared this attitude with her contemporary Stevie Smith, the future Queen's Gold Medal for Poetry winner, who joined the school in 1917.  Although a moderate performer in school subjects, Stella found outlets for her talents by writing stories for her fellow-pupils, becoming vice president of the Senior Dramatic Club, and featuring prominently in the school's Debating Society, of which she became the honorary secretary.", "The literary critic John Carey suggests that the abandonment by intellectuals of \"the clerks and the suburbs\" as subjects of literary interest provided an opening for writers prepared to exploit this underexplored area. He considers John Betjeman and Stevie Smith as two writers who successfully achieved this.Carey, p. 66  Hammill  believes that Gibbons should be named alongside these two, since  in her writings she rejects the stereotypical view of suburbia as unexciting, conventional and limited. Instead, says Hammill, \"Gibbons's fictional suburbs are socially and architecturally diverse, and her characters—who range from experimental writers to shopkeepers—read and interpret suburban styles and values in varying and incompatible ways\".Hammill 2009, p. 75 Hammill adds that Gibbons's strong identification with her own suburban home, in which she lived for 53 years, may have influenced her preference to stay outside the mainstream of metropolitan literary life, and from time to time mock it.Hammill 2009, p. 90"]}, {"page": "Tribune (magazine)", "response": ["Other writers who contributed to Tribune in the 1940s include Naomi Mitchison, Stevie Smith, Alex Comfort, Arthur Calder-Marshall, Julian Symons, Elizabeth Taylor, Rhys Davies, Daniel George, Inez Holden, and Phyllis Shand Allfrey."]}, {"page": "Steven Smith", "response": ["*Stevie Smith (1902–1971), British poet"]}, {"page": "The Second Sex", "response": ["The biographer Deirdre Bair, writing in her \"Introduction to the Vintage Edition\" in 1989, relates that \"one of the most sustained criticisms\" has been that Beauvoir is \"guilty of unconscious misogyny\", that she separated herself from women while writing about them. Bair writes that the French writer Francis Jeanson and the British poet Stevie Smith made similar criticisms: in Smith's words, \"She has written an enormous book about women and it is soon clear that she does not like them, nor does she like being a woman.\" Bair also quotes British scholar C. B. Radford's view that Beauvoir was \"guilty of painting women in her own colors\" because The Second Sex is \"primarily a middle-class document, so distorted by autobiographical influences that the individual problems of the writer herself may assume an exaggerated importance in her discussion of femininity."]}, {"page": "Oxford Book of Contemporary Verse", "response": ["*Stevie Smith"]}, {"page": "J. D. Bernal", "response": ["Bernal was elected a Fellow of the Royal Society in 1937. A fictional portrait of Bernal appears in the novel The Search, an early work of his friend C. P. Snow.  He was also said to be the inspiration for the character Tengal in The Holiday by Stevie Smith. The Bernal Lecture and its successor the Wilkins-Bernal-Medawar Lecture Medal and Lecture were named in his honour."]}, {"page": "Anthology of Twentieth-Century British and Irish Poetry", "response": ["* Stevie Smith"]}, {"page": "The Harvill Book of Twentieth-Century Poetry in English", "response": ["*Stevie Smith"]}, {"page": "The New Oxford Book of English Verse 1250–1950", "response": ["William Allingham - Matthew Arnold - W. H. Auden - William Barnes - Richard Barnfield - John Beaumont - Thomas Lovell Beddoes - Aphra Behn - Hilaire Belloc - John Betjeman - Laurence Binyon - William Blake - Edmund Blunden - Mark Alexander Boyd - Nicholas Breton - Robert Bridges - Emily Brontë - Rupert Brooke - William Browne of Tavistock - Elizabeth Barrett Browning - Robert Browning - John Bunyan - Robert Burns - Samuel Butler - John Byrom - George Gordon Noel Byron - Thomas Campbell - Thomas Campion - Thomas Carew - Lewis Carroll - George Chapman - Thomas Chatterton - Geoffrey Chaucer - G. K. Chesterton - Henry Chettle - John Clare - John Cleveland - Arthur Hugh Clough - Samuel Taylor Coleridge - William Collins - William Congreve - Richard Corbet - William Cornish - William Cory - Abraham Cowley - George Crabbe - Richard Crashaw - Samuel Daniel - George Darley - William Davenant - John Davidson - John Davies - W. H. Davies - Cecil Day-Lewis - Walter de la Mare - Richard Watson Dixon - John Donne - Keith Douglas - Ernest Dowson - Michael Drayton - William Drummond of Hawthornden - John Dryden - William Dunbar - Edward Dyer - T. S. Eliot - William Empson - Richard Fanshawe - Edward Fitzgerald - James Elroy Flecker - Giles Fletcher - Phineas Fletcher - John Ford - Roy Fuller - George Gascoigne - John Gay - Sidney Godolphin - Oliver Goldsmith - James Graham - Robert Graves - Thomas Gray - Robert Greene - Fulke Greville - William Habington - Thomas Hardy - William Ernest Henley - George Herbert - Lord Herbert of Cherbury - Robert Herrick - Ralph Hodgson - Thomas Hood - Gerard Manley Hopkins - A. E. Housman - Henry Howard, Earl of Surrey - James Leigh Hunt - Lionel Johnson - Samuel Johnson - Ben Jonson - Thomas Jordan - James Joyce - John Keats - Henry King - Rudyard Kipling - Francis Kynaston - Charles Lamb - Walter Savage Landor - William Langland - D. H. Lawrence - Edward Lear - Alun Lewis - Thomas Lodge - Richard Lovelace - John Lyly - Thomas Babington Macaulay - Louis MacNeice - Christopher Marlowe - Andrew Marvell - John Masefield - George Meredith - Alice Meynell - John Milton - Thomas Moore - Thomas Osbert Mordaunt - William Morris - Edwin Muir - Anthony Munday - Thomas Nashe - Charles of Orleans - Wilfred Owen - Coventry Patmore - Thomas Love Peacock - George Peele - Alexander Pope - Ezra Pound - Winthrop Mackworth Praed - Matthew Prior - Francis Quarles - Kathleen Raine - Walter Raleigh - Thomas Randolph - Henry Reed - Anne Ridler - Samuel Rogers - Isaac Rosenberg - Christina Rossetti - Dante Gabriel Rossetti - Charles Sackville - Thomas Sackville - Siegfried Sassoon - John Scott of Amwell - Walter Scott - Charles Sedley - William Shakespeare - Percy Bysshe Shelley - William Shenstone - James Shirley - Philip Sidney - Edith Sitwell - John Skelton - Christopher Smart - Stevie Smith - Robert Southwell - Stephen Spender - Thomas Stanley - Robert Louis Stevenson - William Strode - John Suckling - Jonathan Swift - Algernon Charles Swinburne - Alfred Tennyson - Chidiock Tichborne - Dylan Thomas - Francis Thompson - James Thomson (The Seasons) - James Thomson ('B.V.') - Aurelian Townsend - Thomas Traherne - Walter James Turner - Henry Vaughan - Edmund Waller - Isaac Watts - John Webster - Charles Wesley - Robert Wever - Oscar Wilde - John Wilmot - George Wither - Charles Wolfe - William Wordsworth - Henry Wotton - Thomas Wyatt - W. B. Yeats"]}, {"page": "The Faber Book of Twentieth Century Verse", "response": ["L. Aaronson - Lascelles Abercrombie - Dannie Abse - Drummond Allison - W. H. Auden - George Barker - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Wilfrid Scawen Blunt - Robert Bridges - Rupert Brooke - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - G. K. Chesterton - Alex Comfort - A. E. Coppard - John Davidson - Idris Davies - W. H. Davies - Walter de la Mare - C. M. Doughty - Keith Douglas - Lawrence Durrell - T. S. Eliot - William Empson - James Elroy Flecker - David Gascoyne - Wilfrid Gibson - W. S. Graham - Robert Graves - Thomas Hardy - H. D. - Thomas Hennell - Rayner Heppenstall - Ralph Hodgson - A. E. Housman - James Joyce - Patrick Kavanagh - Sidney Keyes - Rudyard Kipling - James Kirkup - D. H. Lawrence - Laurie Lee - Alun Lewis - C. Day Lewis - Hugh MacDiarmid - Patrick MacDonogh - Louis MacNeice - John Masefield - Harold Monro - T. Sturge Moore - Edwin Muir - Henry Newbolt - Robert Nichols - Norman Nicholson - Wilfred Owen - Herbert Palmer - Ruth Pitter - William Plomer - Paul Potts - Ezra Pound - F. T. Prince - Kathleen Raine - Herbert Read - Edgell Rickword - Anne Ridler - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - John Short - Edith Sitwell - Stevie Smith - Sydney Goodsir Smith - Stephen Spender - J. C. Squire - Arthur Symons - Dylan Thomas - Edward Thomas - W. J. Turner - Dorothy Wellesley - Vernon Watkins - Anna Wickham - Charles Williams - W. B. Yeats - Andrew Young"]}, {"page": "Penguin Modern Poets", "response": ["#Edwin Brock, Geoffrey Hill, Stevie Smith"]}, {"page": "British Poetry since 1945", "response": ["A. Alvarez - Kingsley Amis - George Barker - Patricia Beer - Martin Bell - Francis Berry - John Betjeman - D. M. Black - Thomas Blackburn - Alan Bold - Alan Brownjohn - Basil Bunting - Miles Burrows - Charles Causley - Barry Cole - Tony Connor - Iain Crichton Smith - Peter Dale - Donald Davie - Lawrence Durrell - D. J. Enright - Paul Evans - Ian Hamilton Finlay - Roy Fisher - John Fuller - Roy Fuller - Robert Garioch - David Gascoyne - Karen Gershon - Henry Graham - W. S. Graham - Robert Graves - Harry Guest - Thom Gunn - Michael Hamburger - Ian Hamilton Finlay - Lee Harwood - Spike Hawkins - Seamus Heaney - John Heath-Stubbs - Adrian Henri - Geoffrey Hill - Philip Hobsbaum - Anselm Hollo - Ted Hughes - Elizabeth Jennings - Brian Jones - David Jones - Philip Larkin - Peter Levi - Christopher Logue - Edward Lucie-Smith - George MacBeth - Norman MacCaig - Hugh MacDiarmid - Roger McGough - George Mackay Brown - Louis MacNeice - Barry MacSweeney - Derek Mahon - Matthew Mead - Christopher Middleton - Adrian Mitchell - Dom Moraes - Edwin Morgan - Edwin Muir - Jeff Nuttall - Stewart Parker - Brian Patten - Sylvia Plath - Peter Porter - Tom Raworth - Peter Redgrove - Jon Silkin - Stevie Smith - Bernard Spencer - Jon Stallworthy - Nathaniel Tarn - Dylan Thomas - D. M. Thomas - Anthony Thwaite - Charles Tomlinson - Rosemary Tonks - Gael Turnbull - Vernon Watkins - David Wevill"]}, {"page": "Faber Book of Twentieth-Century Women's Poetry", "response": ["Fleur Adcock – Margaret Atwood – Margaret Avison – Elizabeth Bartlett – Patricia Beer – Frances Bellerby – Connie Bensley – Mary Ursula Bethell – Elizabeth Bishop – Louise Bogan – Eavan Boland – Gwendolyn Brooks – Eiléan Ni Chuilleanáin – Amy Clampitt – Gillian Clarke – Jane Cooper – Wendy Cope – Frances Cornford – Elizabeth Daryush – Rosemary Dobson – Freda Downie – Lauris Edmond – U. A. Fanthorpe – Elaine Feinstein – Tess Gallagher – Louise Glück – Barbara Guest – H. D. – Gwen Harwood – Selima Hill – Molly Holden – Robin Hyde – Elizabeth Jennings – June Jordan – Jenny Joseph – Maxine Kumin – Denise Levertov – Gwendolyn MacEwen – Sandra McPherson – Charlotte Mew – Josephine Miles – Edna St. Vincent Millay – Elma Mitchell – Marianne Moore – Lorine Niedecker – P. K. Page – Ruth Pitter – Sylvia Plath – Adrienne Rich – Judith Rodriguez – Muriel Rukeyser – Carol Rumens – E. J. Scovell – Edith Sitwell – Stevie Smith – Anne Stevenson – May Swenson – Anne Szumigalski – Jean Valentine – Ellen Bryant Voigt – Sylvia Townsend Warner – Anna Wickham – Judith Wright – Elinor Wylie"]}, {"page": "Olivia Manning", "response": ["Manning returned to London after the war and lived there until her death in 1980; she wrote poetry, short stories, novels, non-fiction, reviews, and drama for the British Broadcasting Corporation. Both Manning and her husband had affairs, but they never contemplated divorce. Her relationships with writers such as Stevie Smith and Iris Murdoch were difficult, as an insecure Manning was envious of their greater success. Her constant grumbling about all manner of subjects is reflected in her nickname, \"Olivia Moaning\", but Smith never wavered in his role as his wife's principal supporter and encourager, confident that her talent would ultimately be recognised. As she had feared, real fame only came after her death in 1980, when an adaptation of Fortunes of War was televised in 1987.", "Miles did not normally introduce his literary friends to each other, but before his death, he had been forced by circumstance to introduce Manning to the poet Stevie Smith. The two developed an immediate rapport and enjoyed exploring London's backstreets, with regular outings to museums, cinema, and visits to the Palmers Green home that Smith shared with an eccentric aunt. According to a mutual friend, Manning found in Smith's home \"an atmosphere of security and comfort which must have made her room in Oakley Street seem even chillier and more threadbare\". The novelist and critic Walter Allen met Manning in 1937 and observed that she had a \"devastating\" wit \"and was as formidable a young woman as any in London\". Manning and Smith, he added, were a malicious pair of snobs.", "When he met Manning, Smith was on leave from his British Council position as a lecturer in Romania. He had diligently prepared himself for the introduction to Manning by reading her works, and felt that her book The Wind Changes showed \"signs of genius\". He described Manning as a jolie laide, possessing lovely hair, hands, eyes, and skin though an overlong nose, and fell in love at first sight. When he borrowed a half-crown from her on their first meeting and repaid it the next day, he knew they would marry. Manning was less certain of the relationship, but Smith quickly moved into her flat, proposing in bed a few weeks later. They were married at Marylebone Registry Office on 18 August 1939, with Stevie Smith and Louis MacNeice as witnesses. The bridegroom, unconventionally yet true to form, did not produce a ring for the ceremony. A few days after the wedding, the couple received word that Smith had been recalled to Bucharest. They left within a matter of hours; Manning later wrote to Stevie Smith from Romania asking her to find out what had happened to their flat and to take care of her books while she was away.", "Manning spent her days writing; her main project was a book about Henry Morton Stanley and his search for Emin Pasha, but she also maintained an intimate correspondence with Stevie Smith, which was full of Bloomsbury gossip and intrigue. She undertook a dangerous journalistic assignment to interview the former Romanian Prime Minister Iuliu Maniu in Cluj, Transylvania, at the time full of German troops, and soon to be transferred by Romania to Hungary as part of the Second Vienna Award of August 1940, imposed by the Germans and Italians. Like many of her experiences, the interview was to be incorporated into a future work; others included her impromptu baptism of Smith with cold tea because she feared being separated from him after death, and Smith's production of a Shakespeare play, in which she was promised a prime role that was given to another.", "The air raids became intolerable to Manning, and she soon moved back to Cairo, where in late 1941 she became press attaché at the United States Legation. In her spare time, she worked on Guests at the Marriage, an unpublished prototype for The Balkan Trilogy, as well as short stories and poetry, some of which she sent to Stevie Smith in the hopes of getting them published. Over the years, Stevie had brooded over Manning's desertion of their friendship to marry Reggie Smith, and around this time Stevie's jealousy took an overt form; in 1942 she wrote a poem entitled \"Murder\", in which a man stands beside a grave and admits, \"My hand brought Reggie Smith to this strait bed – / Well, fare his soul well, fear not I the dead\". In subsequent reprintings, the name \"Reggie Smith\" was replaced by \"Filmer Smith\", veiling the allusion, but Manning found out and was furious.", "In 1955 Manning published The Doves of Venus, which drew on her experiences in London in the 1930s; the two friends, Ellie Parsons and Nancy Claypole, bore similarities to Manning and Stevie Smith. In the book, an isolated Ellie seeks to escape a stultifying mother. The reviews were generally favourable, but Manning was not satisfied. Perhaps annoyed at her depiction in the novel, Stevie Smith wrote what Manning described as a \"bitchy review\"; the two great friends barely spoke thereafter, despite Smith's efforts at a rapprochement. Eventually, Manning grudgingly forgave her: learning of Smith's final illness, she remarked, \"Well, if she's really ill, we'll have to let bygones be bygones.\"", "Manning wrote reviews, radio adaptations and scripts and several non-fiction books. Her book The Remarkable Expedition (1947) about Emin Pasha and Henry Stanley was generally well reviewed, and when reissued in 1985 was praised for its humour, story telling and fairness to both subjects. Her travel book about Ireland, The Dreaming Shore (1950), received a mixed review even from her old friend Louis MacNeice, but extracts from this and other of Manning's Irish writing have subsequently been admired and anthologised. Manning's book Extraordinary cats (1967) proved to be chiefly about her own well-loved pets, and Stevie Smith's review in the Sunday Times complained that the book was \"more agitated than original\". She also published two collections of short stories, the well-reviewed Growing Up (1946) and A Romantic Hero and Other Stories (1967); the latter included eight stories from the earlier volume, and is imbued with a sense of mortality.", "Manning's books are not easily classified as a part of the feminist canon. Manning supported the rights of women, particularly equal literary fees, but had no sympathy for the women's movement, writing that \"[t]hey make such an exhibition of themselves. None can be said to be beauties. Most have faces like porridge.\" In Manning's books, the word \"feminine\" is used in a derogatory sense, and tends to be associated with female complacency, foolishness, artifice and deviousness, and fulfilment for women comes in fairly conventional roles of wife, mother and the private domain. Elizabeth Bowen remarked that Manning had \"an almost masculine outfit in the way of experience\" that influenced her writing about women and the war. Manning viewed herself not as a female writer, but as a writer who happened to be a woman, and early in her career she obscured her gender using a pseudonym and initials. Manning found it easier to create male characters, and in general her novels tend to minimise differences in gender, writing about people rather than women in particular. Harriet Pringle, for example, moves through processes of self-discovery and empowerment as an individual rather than in feminist solidarity with her sex. In Manning's The Doves of Venus (1960), based on Manning's friendship with Stevie Smith, female characters display \"the 1950s anger more often associated ... with young men\". Treglown comments on how Manning's early books generally took a forthright approach to sex, often initiated by female characters. Her approach became more nuanced in later volumes, with a subtler depiction of sex, sensuality and sexual frustration in Fortunes of War. The Jungian critic Richard Sugg interpreted Manning's female characters as punishing themselves for breaching society's gender norms, including for having erotic feelings. In contrast, Treglown hypothesised that it reflected Manning's ongoing grieving for her stillborn child."]}, {"page": "Penguin poetry anthologies", "response": ["Dannie Abse - Drummond Allison - J. C. Ashby - W. H. Auden - George Barker - William Bell - John Betjeman - Thomas Blackburn - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - Anthony Cronin - Donald Davie - Keith Douglas - Lawrence Durrell - William Empson - Roy Fuller - David Gascoyne - W. S. Graham - Robert Graves - Thom Gunn - Michael Hamburger - John Heath-Stubbs - Brian Higgins - Geoffrey Hill - Ted Hughes - Elizabeth Jennings - Patrick Kavanagh - Sidney Keyes - Philip Larkin - Christopher Logue - Hugh MacDiarmid - Louis MacNeice - Dom Moraes - Edwin Muir - William Plomer - F. T. Prince - Martin Seymour-Smith - C. H. Sisson - Stevie Smith - Dylan Thomas - Anthony Thwaite - Charles Tomlinson - Vernon Watkins"]}, {"page": "Oxford poetry anthologies", "response": ["Henry Aldrich - William Allingham - Drummond Allison - John Amner - Matthew Arnold - W. H. Auden - Philip Ayres - William Baldwin - George Barker - Jane Barker - Clement Barksdale - Richard Barnfield - Thomas Bastard - Francis Beaumont - Samuel Beckett - Thomas Lovell Beddoes - Thomas Beedome - Hilaire Belloc - Sir William Berkeley - John Berryman - John Betjeman - Elizabeth Bishop - Thomas Blackburn - William Blake - Edmund Blunden - Francis William Bourdillon - Anne Bradstreet - Robert Bridges - John Digby, Earl of Bristol - Emily Brontë - Elizabeth Barrett Browning - Robert Browning - John Bunyan - Robert Burns - George Gordon, Lord Byron - Norman Campbell - Roy Campbell - Thomas Campion - Thomas Carew - George Chapman - Thomas Chatterton - Geoffrey Chaucer - G. K. Chesterton - Richard Church - John Ciardi - Arthur Hugh Clough - Mary Coleridge - Samuel Taylor Coleridge - William Collins - William Congreve - Frances Cornford - William Johnson Cory - Francis Coutts - William Cowper - George Crabbe - Hart Crane - Stephen Crane - Richard Crashaw - Robert Creeley - John Crowne - E. E. Cummings - J. V. Cunningham - George Daniel - Sir William Davenant - John Davies of Hereford - W. H. Davies - C. Day-Lewis - Walter De La Mare - Sir John Denham - John Warren, Lord De Tabley - Emily Dickinson - Robert Dodsley - John Donne - Ernest Dowson - William Drummond of Hawthornden - John Dryden - Alan Dugan - Sir Edward Dyer - Clifford Dyment - Richard Eberhart - T. S. Eliot - Ralph Waldo Emerson - William Empson - D. J. Enright - Robert Devereux, Earl of Essex - Sir George Etherege - Gavin Ewart - Mildmay Fane, Earl of Westmorland - Sir Richard Fanshawe - Robert Fitzgerald - Thomas Fitzgerald - Thomas Flatman - James Elroy Flecker - Richard Flecknoe - John Fletcher - Phineas Fletcher - Ford Madox Ford - John Ford - Robert Francis - John Freeman - Robert Frost - Roy Fuller - John Gay - Oliver Goldsmith - Robert Graves - Thomas Gray - Fulke Greville - Ivor Gurney - John Hall - Thomas Hardy - Sir John Harington - Seamus Heaney - Robert Heath - Anthony Hecht - Edward, Lord Herbert of Cherbury - George Herbert - Robert Herrick - Thomas Heywood - Aaron Hill - Ralph Hodgson - A. D. Hope - Gerard Manley Hopkins - A. E. Housman - Ted Hughes - T. E. Hulme - Randall Jarrell - Robinson Jeffers - Elizabeth Jennings - Esther Johnson - Sir William Jones - Ben Jonson - Patrick Kavanagh - P. J. Kavanagh - John Keats - X. J. Kennedy - Henry King - Galway Kinnell - Rudyard Kipling - Mary Lamb - Walter Savage Landor - George Granville, Lord Landsdowne - Philip Larkin - D. H. Lawrence - Laurie Lee - Vachel Lindsay - Richard Lovelace - James Russell Lowell - Robert Lowell - Robert Bulwer-Lytton - Norman MacCaig - Hugh MacDiarmid - Patrick MacDonogh - Phyllis McGinley - Louis MacNeice - Derek Mahon - Edward May - Herman Melville - William Meredith - James Merrill - W. S. Merwin - Charlotte Mew - Alice Meynell - James Michie - Thomas Middleton - Edna St. Vincent Millay - John Milton - Adrian Mitchell - Lady Mary Wortley Montagu - James Graham, Marquis of Montrose - Marianne Moore - Thomas Moore - Thomas Nashe - Howard Nemerov - Margaret Cavendish, Duchess of Newcastle - William Cavendish, Duke of Newcastle - Norman Nicholson - Dudley, Lord North - Wilfred Owen - Edward de Vere, Earl of Oxford - Philip Pain - Coventry Patmore - William Pattison - Thomas Love Peacock - George Peele - Katherine Philips - Eden Phillpotts - Sylvia Plath - Alexander Pope - Ezra Pound - F. T. Prince - Matthew Prior - Francis Quarles - Sir Walter Ralegh - Thomas Randolph - John Crowe Ransom - James Reeves - Edwin Arlington Robinson - John Wilmot, Earl of Rochester - W. R. Rodgers - Theodore Roethke - Christina Rossetti - Dante Gabriel Rossetti - Samuel Rowlands - George William Russell - Thomas Rymer - Charles Sackville, Earl of Dorset - Carl Sandburg - Siegfried Sassoon - Sir Walter Scott - William Shakespeare - Percy Bysshe Shelley - William Shenstone - Sir Edward Sherburne - James Shirley - Sir Philip Sidney - James Simmons - C. H. Sisson - Edith Sitwell - John Skelton - Jonathan Smedley - Stevie Smith - William Jay Smith - Robert Southey - Muriel Spark - Sir John Squire - Sir Richard Steele - James Stephens - Wallace Stevens - Anne Stevenson - Robert Louis Stevenson - Trumbull Stickney - William Strode - Jonathan Swift - Arthur Symons - J. M. Synge - Nahum Tate - Alfred, Lord Tennyson - A. S. J. Tessimond - Dylan Thomas - Edward Thomas - R. S. Thomas - Francis Thompson - Henry Thoreau - Thomas Traherne - George Turbervile - John Updike - Mark Van Doren - Henry Vaughan - Edmund Waller - William Walsh - Vernon Watkins - Samuel Wesley - Walt Whitman - John Greenleaf Whittier - Anna Wickham - John Wigson - Richard Wilbur - Oscar Wilde - William Carlos Williams - Anne Finch, Countess of Winchilsea - William Wordsworth - Judith Wright - Sir Thomas Wyatt - Elinor Wylie - W. B. Yeats - Andrew Young"]}, {"page": "Queen's Gold Medal for Poetry", "response": ["* 1969: Stevie Smith"]}, {"page": "Poems of Today", "response": ["C. Colleer Abbott - John Arlott - W. H. Auden - George Barker - John Bayliss - Frances Bellerby - John Betjeman - Laurence Binyon - Edmund Blunden - Ronald Bottrall - Lilian Bowes Lyon - C. W. Brodribb - Gerald Bullett - Guy Butler - John Buxton - Roy Campbell - Demetrios Capetanakis - Joyce Cary - Richard Church - Alex Comfort - R. N. Currey - W. H. Davies - Walter De La Mare - Patric Dickinson - Keith Douglas - Adam Drinan - Clifford Dyment - T. S. Eliot - Arundell Esdaile - G. S. Fraser - Roy Fuller - Jill Furse - H. W. Garrod - Viola Garvin - David Gascoyne - Wilfrid Gibson - O. St. J. Gogarty - Helen Granville-Barker - Robert Graves - Geoffrey Grigson - Stephen Haggard - J. C. Hall - G. Rostrevor Hamilton - Christopher Hassall - John Heath-Stubbs - J. F. Hendry - Charles Hepburn - F. R. Higgins - Ralph Hodgson - Seán Jennett - Frank Kendon - Sidney Keyes - James Kirkup - Laurie Lee - John Lehmann - Alun Lewis - C. Day-Lewis - C. S. Lewis - Emanuel Litvinoff - Sylvia Lynd - Donagh MacDonagh - Louis MacNeice - John Masefield - E. H. W. Meyerstein - Francis Meynell - Edwin Muir - Norman Nicholson - Herbert Palmer - V. de Sola Pinto - Ruth Pitter - William Plomer - F. T. Prince - John Pudney - Kathleen Raine - Herbert Read - Henry Reed - Alexander Reid - Anne Ridler - W. R. Rodgers - Alan Rook - A. L. Rowse - V. Sackville-West - Siegfried Sassoon - E. J. Scovell - Ian Serraillier - John Short - Edith Sitwell - Osbert Sitwell - Martyn Skinner - Stevie Smith - Stanley Snaith - Helen Spalding - Stephen Spender - James Stephens - L. A. G. Strong - Hal Summers - A. S. J. Tessimond - Dylan Thomas - Terence Tiller - Henry Treece - R. C. Trevelyan - W. J. Turner - John Waller - Rex Warner - Vernon Watkins - Dorothy Wellesley - Laurence Whistler - W. B. Yeats - Andrew Young"]}]}}