{"wiki_id": "http://www.wikidata.org/entity/Q4685285", "itemLabel": "Adrian Portas", "itemDescription": "English musician, singer and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Portas", "wikipedia_page": {"main": "Adrian Portas is an English musician, singer and songwriter. Portas plays several instruments including guitar, keyboards, and drums.He has been a member of the bands Dollface, New Model Army, and Sex Gang Children. Portas wrote all of the songs for Dollface's 1995 album, Giant.He is currently active as a guitarist in Spear of Destiny, and as the singer in the band War Machines of Love.", "link_mentions": [{"page": "New Model Army (band)", "response": ["Thunder and Consolation was released in February 1989, and saw the band moving towards a more folk-rock sound, especially on the tracks including violinist Ed Alleyne-Johnson.  Described as the band's \"landmark\" album, it reached number 20 in the UK charts, the singles \"Stupid Questions\" and \"Vagabonds\" making an impression in America, and the band was able to tour the album there with Alleyne-Johnson also providing additional guitar and keyboards.  At the end of the year however, Harris left the band, to be replaced by Peter \"Nelson\" Nice, who would play with the band for more than 20 years. 1990's Impurity continued the folk-driven theme with Alleyne-Johnson still to the fore and Adrian Portas joining the band on guitar.", "  bar:APortas   text:Adrian Portas"]}, {"page": "Theatre of Hate", "response": ["In May 2012, Theatre of Hate, with a line-up of Brandon, Stammers and Lennard, augmented by Adrian Portas (New Model Army, Sex Gang Children, Spear of Destiny) on guitar and Mike Kelly on drums, reunited again for three Westworld 30th anniversary concerts, held in Bristol, London and Crewe. 2013 concerts in Birmingham and Bristol with this line-up were self-released as the CD/DVD set Live 2013."]}, {"page": "Impurity (New Model Army album)", "response": ["The album sees the band venturing further into the musical territory which they began exploring on their previous album, Thunder and Consolation (1989). Violinist Ed Alleyne-Johnson was again a collaborator. It also contained the guitar work of Adrian Portas.", "*Adrian Portas - guitar"]}, {"page": "The Love of Hopeless Causes", "response": ["The Love of Hopeless Causes is the sixth studio album by British rock band New Model Army, released in 1993. It was produced by Niko Bolas, except \"Afternoon Song\", which was produced by Riku Mattila. It featured guest musicians, guitarist Adrian Portas and Clive Layton, who played the hammond organ on \"Fate\".", "*Adrian Portas – guitar"]}, {"page": "Raw Melody Men", "response": ["*Adrian Portas – guitar"]}, {"page": "BBC Radio One Live in Concert (New Model Army album)", "response": ["*Adrian Portas – keyboards"]}]}}