{"wiki_id": "http://www.wikidata.org/entity/Q46992475", "itemLabel": "John Whitley Stokes", "itemDescription": "Archdeacon of Armagh", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Stokes_(Archdeacon_of_Armagh)", "wikipedia_page": {"main": "John Whitley Stokes (6 January 1801, Dublin  – 27 November 1883, Armagh) was Archdeacon of Armagh from 1842 until his death.\n\nHe was born in Skreen, County Sligo, the second  born and eldest son  of the eight children of the Reverend Gabriel Stokes (died 1834), rector of the parish, and his wife Elizabeth Haughton, daughter of the Reverend John Haughton.  His father's profound Evangelical  views had a strong influence on all four of his sons, three of whom became clergymen. The youngest of the four brothers  was the noted physicist  Sir George Stokes, 1st Baronet. John and  George  remained  close, and George,  who  was  much younger,   lived in John's house while  he  was at school in Dublin. Their mother was remembered in the family as \"beautiful, but very stern\".\nStokes was educated at Trinity College, Dublin. He was for many years Rector of Clogherny.He married in 1827  Caroline Elrington, daughter of Thomas Elrington, Bishop of Ferns and Leighlin and Charlotte Preston. She died  in  1868. They had one  son, Thomas Gabriel Stokes, who followed his father and grandfather into the Church, and became Chancellor of the Diocese of Armagh. He married Sophia Fenwick  of County Donegal  and had a numerous family.\nThere is a memorial to  Archdeacon Stokes on the north wall of the north transept of St Patrick's Cathedral, Armagh.", "link_mentions": [{"page": "Sir George Stokes, 1st Baronet", "response": ["George Stokes was the youngest son of the Reverend Gabriel Stokes (died 1834), a clergyman in the Church of Ireland who served as rector of Skreen, in County Sligo and his wife Elizabeth Haughton, daughter of the Reverend John Haughton.  Stokes home life was strongly influenced by his father's evangelical Protestantism: three of his brothers entered the Church,  of whom the most eminent was John Whitley Stokes,  Archdeacon of Armagh.George Gabriel Stokes Biography John and George  were always close,  "]}, {"page": "Skreen", "response": ["*John Whitley Stokes, Archdeacon  of  Armagh,  elder brother of the previous (1801-1883)."]}, {"page": "Thomas Elrington (bishop)", "response": ["John Whitley Stokes (1801-1883), Archdeacon  of  Armagh, and had a son Thomas Gabriel Stokes. John "]}]}}