{"wiki_id": "http://www.wikidata.org/entity/Q4690", "itemLabel": "Margaret Wycherly", "itemDescription": "English stage and film actress (1881-1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Wycherly", "wikipedia_page": {"main": "Margaret De Wolfe Wycherly (born Margaret De Wolfe, 26 October 1881 – 6 June 1956) was an English stage and film actress. She spent many years in the United States and is best remembered for her Broadway roles and Hollywood character parts. On screen she played mother to Gary Cooper (Sergeant York) and James Cagney (White Heat).", "link_mentions": [{"page": "Tod Browning", "response": ["In a cast featuring some of M-G-M's top contract players including Conrad Nagel, Leila Hyams and Margaret WycherlyNixon, 2006 TCM: \"The suspects are played by a virtual who's-who of recognizable character actors: Conrad Nagel...Leila Hyams, later Venus in Browning's Freaks... Margaret Wycherly...Joel McCrea's scenes were deleted before the film's release.\" Hungarian-American Bela Lugosi, a veteran of silent films and the star of Broadway's Dracula (1924) was enlisted by Browning to play Inspector Delzante, when Lon Chaney declined to yet embark on a talking picture.Nixon, 2006 TCM: \"Lugosi made a number of silent film appearances before his runaway success on Broadway in Dracula.\" And: \"...a matinee idol [in Germany]. His first American film was The Silent Command (1923).\"Barson, 2020: \"...Chaney was not yet open to the notion of making a sound picture, so Hungarian actor Bela Lugosi was recruited to play the police inspector investigating a murder at a seance.\""]}, {"page": "1956", "response": ["** Margaret Wycherly, English stage and film actress (b. 1881)"]}, {"page": "1881", "response": ["* October 26 – Margaret Wycherly, English stage, film actress (d. 1956)"]}, {"page": "Sergeant York (film)", "response": ["Cooper went on to win the Academy Award for Best Actor for his performance, while the film also won Best Film Editing and was nominated in nine other categories, including Best Picture, Director, Supporting Actor (Walter Brennan), and Supporting Actress (Margaret Wycherly). The American Film Institute ranked the film 57th in the its 100 most inspirational American movies. It also rated Alvin York 35th in its list of the top 50 heroes in American cinema.", "* Best Supporting Actress – Margaret Wycherly"]}, {"page": "Random Harvest (film)", "response": ["*Margaret Wycherly as Mrs. Deventer"]}, {"page": "1956 in film", "response": ["* June 6 – Margaret Wycherly, 74, English-American actress, White Heat, Sergeant York"]}, {"page": "List of female movie actors by name: W–Z", "response": ["*Margaret Wycherly (1881–1956)"]}, {"page": "Midnight (1934 film)", "response": ["Midnight is a 1934 American drama film, the first directed by Chester Erskine, and starring Sidney Fox, O.P. Heggie, Henry Hull and Margaret Wycherly. It was based on a Theatre Guild play with the same name by Paul and Claire Sifton. The film was produced for Universal and was shot on a modest budget of $50,000 at Thomas Edison Studios, which producer/director Chester Erskine had re-opened specifically for the shoot.Allen Eyles, Bogart, Macmillan, 1975 p 32", "*Margaret Wycherly ...  Mrs. Weldon"]}, {"page": "Johnny Angel", "response": ["* Margaret Wycherly as Miss Drumm"]}, {"page": "The Loves of Carmen (1948 film)", "response": ["* Margaret Wycherly as Old Crone"]}, {"page": "Keeper of the Flame (film)", "response": ["Over time, O'Malley gains the widow's trust. Christine is the \"keeper of the flame,\" protecting her husband's memory and reputation. O'Malley's instincts tell him that a secret is being kept from him. He discovers that Forrest's elderly, mentally ill mother (Margaret Wycherly) is living in a separate house on the vast estate. Despite her servants' attempts to keep them apart, O'Malley manages to speak with her and obtains more clues from her ramblings.", "* Margaret Wycherly as Mrs. Forrest"]}, {"page": "14th Academy Awards", "response": ["** Margaret Wycherly – Sergeant York as Mary Brooks York"]}, {"page": "The Man with a Cloak", "response": ["* Margaret Wycherly as Mrs. Flynn"]}, {"page": "1956 in the United Kingdom", "response": ["* 6 June – Margaret Wycherly, actress (born 1881)"]}, {"page": "The President's Lady", "response": ["* Margaret Wycherly as Mrs. Robards"]}, {"page": "List of American films of 1934", "response": ["|Midnight|| Chester Erskine||Sidney Fox, Margaret Wycherly, Humphrey Bogart || Drama, Crime|| Universal"]}, {"page": "White Heat", "response": ["White Heat is a 1949 American film noir directed by Raoul Walsh and starring James Cagney, Virginia Mayo, Edmond O'Brien, Margaret Wycherly and Steve Cochran. Written by Ivan Goff and Ben Roberts, White Heat is based on a story by Virginia Kellogg, and is considered to be one of the best gangster movies of all time. In 2003, it was added to the National Film Registry as being \"culturally, historically, or aesthetically significant\" by the United States Library of Congress.", "* Margaret Wycherly as \"Ma\" Jarrett"]}, {"page": "Crossroads (1942 film)", "response": ["* Margaret Wycherly as Madame Pelletier"]}, {"page": "Bayard Veiller", "response": ["He was born on January 2, 1869 in Brooklyn, New York to Philip Bayard Veiller. He was married to English actress Margaret Wycherly from 1901 to 1922; their son, Anthony Veiller, was also a screenwriter."]}, {"page": "The Thirteenth Chair (1929 film)", "response": ["The Thirteenth Chair is a 1929 American pre-Code mystery film directed by Tod Browning. The picture is based on a 1916 play of the same name by Bayard Veiller. It stars Conrad Nagel, Leila Hyams and Margaret Wycherly. The supporting cast features Bela Lugosi, whom Browning would direct as Dracula two years later. ", "Inspector Delzante (Bela Lugosi), investigates a pair of murders near a British mansion in Calcutta. Helen O'Neill (Leila Hyams) becomes a chief suspect based on circumstantial evidence. A fake Irish medium, Madame LaGrange (Margaret Wycherly) is called in to try to help solve the first murder.", "* Margaret Wycherly as \"Madame\" Rosalie La Grange", "Margaret Wycherly, who was at one time married to the writer of The Thirteenth Chair play (Bayard Veiller), also appeared in the original 1916 play."]}, {"page": "Forever Amber (film)", "response": ["* Margaret Wycherly as Mrs. Spong"]}, {"page": "Tobacco Road (play)", "response": ["*Ada Lester  – Margaret Wycherly"]}, {"page": "List of British actors", "response": ["* Margaret Wycherly (1881–1949)"]}, {"page": "List of British Academy Award nominees and winners", "response": ["| Margaret Wycherly"]}, {"page": "Margaret Weycherle", "response": ["#REDIRECT Margaret Wycherly"]}, {"page": "Assignment in Brittany", "response": ["At the Corlay family farm, Madame Henriette Corlay (Margaret Wycherly), Bertrand's mother, eventually realizes Matard is not her son, but does not give him away, although she disapproves of Bertrand's apparent cooperation with the Germans. Matard has better luck fooling both Anne Pinot (Susan Peters) and Elise (Signe Hasso), Bertrand's fiancee and mistress, respectively.", "* Margaret Wycherly as Mme. Henriette Corlay"]}, {"page": "Taboo (1922 play)", "response": ["It is set on a plantation in Louisiana before the American Civil War and in Africa. It opened on April 4, 1922, in the Sam Harris Theater, Harlem. It starred Margaret Wycherly, the only white member of the cast, Paul Robeson, other African American actors, and African students at Columbia University. An African dance was performed by C. Kamba Simango, a Mozambican student at Columbia. This was one of Robeson's first stage opportunities and his performance was praised by critics.Sheila Tully Boyle and Andrew Bunie, Paul Robeson: the years of promise and achievement, pp103-104"]}, {"page": "Something in the Wind", "response": ["* Margaret Wycherly as Grandma Read"]}, {"page": "Anthony Veiller", "response": ["Veiller was born on 23 June 1903 in New York City to playwright and screenwriter Bayard Veiller and English-born actress Margaret Wycherly. He moved to Hollywood in 1930."]}, {"page": "Chickering Hall (Boston, 1901)", "response": ["* W. B. Yeats plays, with Margaret WycherlyBoston Globe, Nov. 26, 1904"]}, {"page": "Heterodoxy (group)", "response": ["*Margaret Wycherly"]}, {"page": "Victory (1940 film)", "response": ["* Margaret Wycherly as Mrs. Schomberg"]}, {"page": "Jessie Bonstelle", "response": ["In 1899, while playing with the Biancke Sisters, Bonstelle produced Heimat by Hermann Sudermann. This was its first performance in the United States, and only the second in English. Later she received a letter from Sudermann in which he thanked her for performing his work. Her career as a manager and director began around 1900 when Jacob J. Shubert offered her the management of a stock company in Rochester. This company, the Lyceum stock company, based at Rochester's Lyceum Theater, included some prominent actors and future stars, such as Orrin Johnson, Margaret Wycherly and Charles Hutchison."]}, {"page": "The Moon Is Down (film)", "response": ["* Margaret Wycherly as Sarah Orden"]}, {"page": "That Man from Tangier", "response": ["* Margaret Wycherly as Mrs. Sanders "]}]}}