{"wiki_id": "http://www.wikidata.org/entity/Q4699650", "itemLabel": "Ajay Nayyar", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ajay_Nayyar", "wikipedia_page": {"main": "Ajay Pratap Singh Nayyar (born 21 September 1982) is a British-Indian film, television and stage actor, producer and director.\nAjay featured in two TV shows in 2009, the Fox thriller drama series 24  and the CBS series NCIS and also starred in a feature film titled Rejouer playing the role of a music producer. This independent feature was the first film to be entirely shot with an HDSLR camera. Originally, Ajay auditioned for the small role of a news reporter, only to be offered a leading role as a music producer. The script was, in turn, rewritten for him to play this role. Two US national commercials for The Hartford, and Subway (restaurant) were to follow in his blossoming acting career. His dream is to, one day, be able to work with his idol, for most of his life, Al Pacino.\nHis passion for the industry has since grown immensely and he decided he didn't want to restrict himself to just acting, realising his potential as a producer. The finance background obviously helped a great deal with this and in 2010, he formed Khando Entertainment in London.", "link_mentions": [{"page": "List of American films of 2009", "response": ["| Hannah Montana: The Movie || Walt Disney Pictures || Peter Chelsom (director); Dan Berendsen (screenplay); Miley Cyrus, Billy Ray Cyrus, Emily Osment, Jason Earles, Mitchel Musso, Moisés Arias, Lucas Till, Vanessa L. Williams, Margo Martindale, Peter Gunn, Melora Hardin, Jared Carter, Barry Bostwick, Beau Billingslea, Katrina Hagger Smith, Emily Grace Reaves, Jane Carr, Rachel Woods, Natalia Dyer, Adam Gregory, Taylor Swift, Rascal Flatts, Tyra Banks, Brooke Bell, Brandi Cyrus, Noah Cyrus, Anne Lockhart, Ajay Nayyar, Brooke Shields"]}, {"page": "Ajay (given name)", "response": ["* Ajay Nayyar (born 1982), British-Indian actor and filmmaker"]}]}}