{"wiki_id": "http://www.wikidata.org/entity/Q4693100", "itemLabel": "Agnes Owens", "itemDescription": "British writer (1926-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Agnes_Owens", "wikipedia_page": {"main": "Agnes Owens (24 May 1926 – 13 October 2014) was a Scottish author.", "link_mentions": [{"page": "James Kelman", "response": ["* Lean Tales (1985, with Alasdair Gray and Agnes Owens)"]}, {"page": "Lean Tales", "response": ["Lean Tales is an anthology of short stories written by Scottish authors Alasdair Gray, Agnes Owens and James Kelman, with author illustrations by Alasdair Gray. Contractually obligated to Jonathan Cape to provide a new book, Gray claimed to find himself without new material or ideas, and so approached Kelman and Owens to bulk out a collection of stories with some of their own. As is often the case with Gray's later stories, some of his own contributions are recycled from his previous writing, including The Story of a Recluse (based on his television play) and A Report to the Trustees of the Bellahouston Travelling Scholarship (based on report written after Gray received a grant to travel abroad as an art student).  "]}, {"page": "Alasdair Grant Taylor", "response": ["Taylor also featured in Portrait of a painter, \"the story of an artist ... who persists in his painting though he remains unrecognized and unrewarded\",World Authors 1980-1985, Vineta Colby, H. W. Wilson, 1991,  Google Books in Gray's 1985 short story anthology Lean Tales, co-written with James Kelman and Agnes Owens."]}, {"page": "West Coast Magazine", "response": ["WCM was probably the first Scottish literary magazine fully produced pre-press in-house to a professional standard, and was the forerunner, in this sense, for many similar Scottish literary publications that came after it. The main aim of West Coast was to help promote new writing, and more specifically, new writers in Scotland. However, it did not exclusively publish Scottish writers or writers resident in Scotland – writers from all over the world contributed to its content. Established writers such as Alasdair Gray (short fiction and poetry), Agnes Owens (short fiction and poetry), Janice Galloway (short fiction), Freddie Anderson, (articles and poetry), Alison Prince (poetry), Dominic Behan (poetry), James Kelman (interview and article), Jeff Torrington (short fiction), Kenneth White (poetry, articles), all of whom also provided great encouragement to the project. New writers who were beginning to produce works of note were featured, such as: Des Dillon (short fiction and poetry),Des Dillon http://www.booksfromscotland.com/Authors/Des-Dillon Brian Whittingham (poetry), Jim Ferguson (short fiction and poetry), Irvine Welsh (short fiction) and Graham Fulton (poetry), and Andrew M Forster (poetry) among others."]}, {"page": "Gerda Stevenson", "response": ["Her play Federer Versus Murray toured to New York in 2012, and her poetry collection If This Were Real was published by Smokestack Books in 2013. She has adapted a number of works for radio: Self-Control by Mary Brunton in which Stevenson played the part of Laura Montreville; For the Love of Willie by Agnes Owens in which Stevenson played the part of Liza; The Heart of Midlothian by Sir Walter Scott for BBC Radio 4, nominated for a Sony Award in 2008, in which Stevenson played the part of the heroine Jeanie Deans; and Sunset Song by Lewis Grassic Gibbon.BBC – Classic Serial – Sunset Song She has written radio plays including: Island Blue,BBC – Woman's Hour Drama – Island Blue Secrets: The Punter's Tale, Secrets: The Escort's TaleBBC – BBC Radio Scotland – Secrets: The Escort's Tale and The Apple Tree.BBC – Afternoon Play – The Apple Tree She directed the Afternoon Play The Price of a Fish Supper.BBC – Afternoon Play – The Price of a Fish Supper"]}, {"page": "Alasdair Gray", "response": ["*Lean Tales (1985) (with James Kelman and Agnes Owens) (1995), "]}, {"page": "List of Scottish short story writers", "response": ["* Agnes Owens"]}, {"page": "2014 in the United Kingdom", "response": ["**Agnes Owens, 88, author."]}, {"page": "Deaths in October 2014", "response": ["*Agnes Owens, 88, Scottish author.Obituary Agnes Owens, author"]}, {"page": "Alasdair Gray bibliography", "response": ["*Lean Tales (1985) (with James Kelman and Agnes Owens) (1995) "]}]}}