{"wiki_id": "http://www.wikidata.org/entity/Q47009127", "itemLabel": "Edwin A. Dawes", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_A._Dawes", "wikipedia_page": {"main": "Edwin Alfred Dawes (born 6 July 1925) is a biochemist and magician from Yorkshire, England. As a biochemist, he authored two textbooks and was the long-term and founding head of the Biochemistry department at the University of Hull, where he led its research into bioplastics. As a magician, he is an internationally recognised authority on the history of magic.", "link_mentions": [{"page": "Magicana", "response": ["* The Edwin A. Dawes Award for Magic Scholarship is a bursary designed to provide doctoral students financial assistance toward the cost of materials and research pertaining a thesis related to the art of magic."]}, {"page": "Walford Bodie", "response": ["His touting of medical skill displeased the medical profession of the time, who labelled him a 'quack,' and took him to court over the use of the word 'doctor.' Yet Bodie was also a great showman and stage performer, and it was the combination of showmanship, as well as his apparent 'cures,' that provided the magnet for his huge success. Ricky Jay, American hypnotist, and author of the best-selling book, 'Learned Pigs and Fireproof Women,' accredits Bodie with the origination of many of today's comic interludes in stage hypnotism. In other words, the originator of much of the 'humorous hypnosis' we see on stage to this very day, while Professor Edwin A. Dawes states that 'as a ventriloquist (in his later stage review, 'Fun on an Ocean Liner') he was superb.'"]}, {"page": "List of Academy of Magical Arts Award Winners", "response": ["|Edwin A. Dawes", "|Edwin A. Dawes"]}, {"page": "Eddie Dawes", "response": ["#REDIRECT Edwin A. Dawes"]}, {"page": "Edwin Dawes", "response": ["#REDIRECT Edwin A. Dawes"]}, {"page": "Amy Dawes", "response": ["#REDIRECT Edwin A. Dawes#With Amy Dawes"]}, {"page": "Edwin Alfred Dawes", "response": ["#REDIRECT Edwin A. Dawes"]}]}}