{"wiki_id": "http://www.wikidata.org/entity/Q4707430", "itemLabel": "Alan Norris", "itemDescription": "English darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Norris_(darts_player)", "wikipedia_page": {"main": "Alan Norris (born 21 February 1972) is a former English darts player. He was the runner-up at the 2014 BDO World Darts Championship and also lost in the final of the 2012 Zuiderduin Masters, with Stephen Bunting prevailing on both occasions. In 2015, he switched to the PDC and, after reaching the quarter-finals of the 2016 World Championship, he was named the PDC Best Newcomer of the year.\n\n", "link_mentions": [{"page": "World Professional Darts Championship", "response": ["|  Alan Norris"]}, {"page": "Andy Fordham", "response": ["Fordham was awarded a wild card for the televised stages at the 2014 BDO World Trophy and faced Alan Norris in the first round. He was beaten 6–2 by Norris."]}, {"page": "Professional Darts Corporation", "response": ["An additional 19 players have won a single title. That list is composed of Justin Pipe, Raymond van Barneveld, Adrian Lewis, Simon Whitlock, John Part, Wes Newton, Steve Beaton, Gary Anderson, Vincent van der Voort, Mervyn King, Robert Thornton, Alan Norris, Max Hopp, Jonny Clayton, Daryl Gurney, Jamie Hughes, Krzysztof Ratajski, Devon Petersen and José de Sousa."]}, {"page": "Jelle Klaasen", "response": ["Klaasen overcame Joe Cullen and Mervyn King to advance to the third round of the World Championship for the first time since 2009. He missed one dart at double 18 to complete a 147 finish and defeat Phil Taylor 4–2, before going 2–0 down in legs in the final set. Taylor missed one dart to win the match and Klaasen took full advantage by winning four legs on the trot, wrapping it up with an 11 darter. In the quarter-finals, Klaasen was 3–1 and 4–3 behind Alan Norris in a race to five. He was two legs to one down in the next set but produced back-to-back 11 dart legs to win it and then clinched the final set without conceding a leg to advance to the semi-finals of a PDC World Championship for the first time, where he faced reigning champion Gary Anderson. Klaasen's victory also marked the first time that a player has won their next game after knocking Taylor out of a PDC World Championship. In the semis he was thrashed 6–0 by Anderson, who averaged 107. Klaasen also reached the semi-finals of the next major event as he whitewashed Kyle Anderson 10–0 at the UK Open, but he lost 10–5 to Peter Wright. He was defeated 10–6 by Steve Beaton in the opening round of the World Matchplay and at the same stage of the World Grand Prix, 2–1 in sets by Adrian Lewis."]}, {"page": "BDO World Darts Championship", "response": ["|  Alan Norris", "|  Alan Norris"]}, {"page": "Darts world rankings", "response": ["* 2014  Alan Norris"]}, {"page": "Finder Darts Masters", "response": ["|  Alan Norris", "|  Alan Norris||align=center|0||align=center|1"]}, {"page": "Andy Jenkins", "response": ["Jenkins had 6–5 and 9–5 wins over Wayne Jones and Richie Corner at the 2016 UK Open, before losing 9–2 to Vincent van der Voort in the fourth round. He had his best run of the year at the eighth Players Championship by knocking out Kevin Painter, Steve Brown, Michael Smith and Justin Pipe to play in the quarter-finals, where he was whitewashed 6–0 by Jamie Caven. Jenkins beat Steve West 6–3 and watched Alan Norris miss match darts to win 6–5 at the European Darts Trophy. He lost 6–3 to James Wade in the third round. As well as his quarter-final, a last 16 finish and a number of last 32 finishes saw Jenkins earn a place in the Players Championship Finals, where he lost 6–3 to Justin Pipe in the first round."]}, {"page": "Darren Webster", "response": ["Webster saw off John Henderson 3–1 in the opening round of the 2016 World Championship, but Michael van Gerwen averaged 109.23 in their second round clash as Webster could only win one leg in a 4–0 defeat. A 9–8 win over Ricky Evans saw him reach the fifth round of the UK Open for the second time in his career and he lost 9–5 to Peter Wright. Webster's first semi-final in over two and a half years came at the ninth Players Championship and he was beaten 6–1 by Benito van de Pas. Another came at the 17th event, but he was whitewashed 6–0 by Van Gerwen. Webster was already eliminated from the Grand Slam of Darts before his third group game with Phil Taylor after losing his opening two matches, but nevertheless thrashed the 16-time world champion 5–0. Webster stated that the result would give him a confidence boost for the remainder of the year. He was right, because at the Players Championship Finals he saw off Jonny Clayton and Simon Whitlock both 6–3, Alan Norris 10–5 and Christian Kist 10–6 to reach the semi-finals of a PDC major for the first time. Webster stormed in to a 6–0 lead over Van Gerwen, but missed a dart to be 7–2 ahead as Van Gerwen closed to 6–6. Webster did take a one leg lead on two further occasions, but would ultimately be defeated 11–8."]}, {"page": "World Darts Federation", "response": ["|  Alan Norris"]}, {"page": "Darryl Fitton", "response": ["After a quiet 2012 season, Fitton entered the 2013 BDO World Darts Championship as the 16th seed. He narrowly defeated Benito van de Pas 3-2 in the first round to secure his first win at Lakeside since 2009. He then caused a big upset by defeating top seed Stephen Bunting 4-2 in the second round. In the quarter-final, Fitton was defeated 5-2 by Wesley Harms. Fitton's form improved after this but his 2014 World Championship was ended in the first round by Tony Eccles, in Eccles's last tournament before being convicted of child grooming. The following year, Fitton reached the quarter-finals again beating previous year's runner-up Alan Norris en route, before losing to Glen Durrant."]}, {"page": "Mark Webster (darts player)", "response": ["Webster did not drop a set in seeing off Mick McGowan and Terry Jenkins at the 2016 World Championship, but then lost 4–1 to Alan Norris in the third round. Two semi-finals and a quarter-final in the UK Open Qualifiers saw him finish fifth on the Order of Merit to enter the UK Open at the third round stage. He defeated Matthew Edgar 9–3, Dirk van Duijvenbode 9–4 and Mensur Suljović 9–5 to reach his third major quarter-final in six months and was comfortably beaten 10–3 by Phil Taylor. Webster and Gerwyn Price lost 4–2 in a doubles match in the second round of the World Cup. After his 10–6 defeat to Adrian Lewis in the opening round of the World Matchplay, Webster said that dartitis, which he has fought over the past few years, was evident in the latter half of the game and that he was trying to beat the player and himself during matches. He reached one Pro Tour quarter-final during the rest of the year as well as losing in the first round of the Players Championship Finals.", "* 2016: Third round (lost to Alan Norris 1–4)"]}, {"page": "Simon Whitlock", "response": ["In the deciding set of his second round match with Alan Norris at the World Grand Prix, Whitlock was 2–1 down in legs, before hitting a 180, a 150 checkout, followed by a 10-darter to end the match with 16 perfect darts. In his first major quarter-final of the year he lost 3–1 to Van Gerwen. He quickly added another title by capturing the 19th Players Championship with a 6–4 win over Chris Dobey."]}, {"page": "Scott Waites", "response": ["Waites had a lower-profile season in 2013–14, suffering early exits in the Winmau Masters and Zuiderduin Masters and not being selected to defend his WDF World Cup singles title. He did enjoy another good run at the PDC Grand Slam, reaching the semi-finals before being defeated by Robert Thornton. However, his season ended in disappointment when, as the defending champion, he was eliminated in the first round of the 2014 BDO World Darts Championship 3–0 by eventual runner-up Alan Norris. It was the first time Waites had lost in the first round of the world championship, and afterwards he complained of a lack of preparation due to injuries as well as a power-cut shortly before his match started, though he still gave credit to Norris for his performance.", "* 2014: 1st round (lost to Alan Norris 0–3)"]}, {"page": "Mick McGowan", "response": ["He played in his second World Cup for Ireland in 2012, again paired with O'Connor and, as in 2010, they reached the second round this time by defeating Malaysia 5–2. They played the same Australian pair as in 2010 next and were whitewashed 0–4. In the rest of 2012 he could not advance beyond the last 64 of any of his events. McGowan finished the year ranked world number 169, well outside of the top 64 who retain their places on the PDC tour and he did not have automatic entry into any event in the future. In the 2015 Tom Kirby Memorial Irish Matchplay final he beat Tom Biggane  6-5 to qualify for the preliminary round of the 2016 PDC World Championship. At Q School, Mick picked up his tour card via the Q School Order Of Merit by reaching the Final on the fourth day, only to lose to Ross Smith 5-4. However, his run on the final day got him inside the Order Of Merit to qualify, earning him a Tour Card for the 2016 and 2017 seasons. At the World Grand Prix, McGowan blew a 1-0 lead to lose 2-1 in sets in his first-round match against James Wilson, while at the Players Championship Finals, McGowan upset Chris Dobey in the first round by a score of 6 legs to three, only to lose by the same score to Alan Norris in the next round. McGowan defeated Radoslaw Szaganski 6-5 in the final of 2016 Tom Kirby Memorial Irish Matchplay to qualify for the 2017 PDC World Championship at Alexandra Palace. As one of the three highest-ranked international qualifiers for the event, McGowan received a bye straight through to the first round of the tournament, where he faced Jamie Lewis in a losing effort."]}, {"page": "Robert Thornton (darts player)", "response": ["Thornton was eliminated at the first round stage of a World Championship for the first time in his career in 2016, when he could only take three legs off Alan Norris in a 3–0 defeat. He relinquished an 8–0 lead in the first round of the Masters to lose 10–9 against Dave Chisnall. On the opening night of the Premier League, Thornton averaged just 75.68 as Chisnall whitewashed him 7–0. He only won two matches out of 16 games to finish eighth in the table. Thornton was knocked out in the second round of the UK Open 6–4 by Arron Monk. Thornton suffered another heavy loss to Chisnall, this time 11–2 in the second round of the World Matchplay and he was beaten 2–1 in sets by Stephen Bunting in the opening round of the World Grand Prix. He lost in the first round of the European Championship 6–4 to Cristo Reyes and was involved in a nine dart shoot-out at the Grand Slam after Thornton and Dimitri Van den Bergh had both won two of their three games and were locked with a plus one leg difference. Thornton won by 345 points to 340 and then was defeated 10–5 by Michael van Gerwen in the second round. After losing 6–3 to Adrian Lewis in the first round of the Players Championship Finals, it meant Thornton had not progressed past the second round of any major event in 2016.", "*2016: First round (lost to Alan Norris 0–3)"]}, {"page": "Stephen Bunting", "response": ["In October 2012, Bunting took his largest career title by winning the Winmau World Masters as the number one seed, defeating Tony O'Shea 7–4 in the final. In December, Bunting won the Zuiderduin Masters, by defeating Alan Norris in the final. Bunting finished 2012 at BDO and WDF World number one.", "Bunting entered the 2014 BDO World Championship as the number one seed for the second year in a row. He defeated Jim Widmayer 3-1 in the first round, Dave Prins 4-0 in the second round with the tournament's highest three-dart average (100.65), and Rick Hofstra 5-2 in the quarter finals after Hofstra led 2-0 and had chances to win the fourth and sixth sets. In the semi-final, Bunting beat fourth seed Robbie Green 6-1 to set up a final with Alan Norris, which Bunting won 7-4 after the match had been level at 3-3.", "|  Alan Norris", "|  Alan Norris", "* 2014: Winner (beat Alan Norris 7–4)"]}, {"page": "Garry Thompson (darts player)", "response": ["Thompson was seeded 10th for the 2011 BDO World Championship, and once again reached the quarter-final stage. He beat German teenager Arno Merk 3-1 in the first round, and Alan Norris 4-2 in the second round, but in the quarter-final he lost 5-4 to Jan Dekker having led 3-0 and 4-2 in sets and missing nine darts at doubles to win the match. Had Thompson won the match and gone on to win his semi-final as well, he would have played the final on his 46th birthday."]}, {"page": "Alan Norris", "response": ["Alan Norris may refer to:", "* Alan Norris (darts player) (born 1972), English darts player"]}, {"page": "Robert Wagner (darts player)", "response": ["Wagner's best run in the World Championship came in 2010. He defeated Alan Norris in the first round 3–1, to face Brian Woods in the second round. Wagner came back from 2–0 and 3–2 behind to win 4–3 in the sudden death leg, three times having to break Woods's throw to stay in the match and seeing Woods miss one dart at bullseye for the match. Both players made a number of high finishes and consistent scoring, and it was very quickly labelled as one of the best matches ever played in the early stage of a World Championship. The win sent Wagner through to the quarter-final for the first time in his career. However, he was unable to replicate his form in the next round and was defeated 5–1 by number 1 seed Tony O'Shea."]}, {"page": "Ross Montgomery", "response": ["Montgomery won the 2010 British Classic as well as the 2010 Zuiderduin Masters, his inaugural major title, where he came from 4–0 down in sets to win 5–4 against Robbie Green, also surviving three match darts. Montgomery finished as the year end number one in WDF Working Rankings Europe for 2010.WDF World Ranking Systems Rolls of Honour 2009–2013 WDF. Retrieved 12 January 2014. At the 2011 BDO World Darts Championship, Montgomery was beaten 3–1 in sets by Alan Norris.", "* 2011: 1st round (lost to Alan Norris 1–3)"]}, {"page": "I Like It Loud", "response": ["The song is also used by some football clubs to boost atmosphere in the stadium, most notably as the anthem for Romanian team Steaua Bucharest, and as the goal-celebration song for German club Borussia Mönchengladbach and American club Philadelphia Union. The Philadelphia Flyers ice hockey team used it as their goal song from the 2011 Stanley Cup playoffs until the end of the 2012/13 season. Slovan Bratislava uses the song as their regular goal song during home matches. It was also used in darts by Alan Norris who used it as his walk-on music during 2016. As of the 2021/22 season, it is used as the goal song of Dutch football clubs SBV Excelsior and TOP Oss."]}, {"page": "Steve West (darts player)", "response": ["West then won his first Open title, winning the 2007 Denmark Open, beating the Netherlands' Niels de Ruiter in the semi-finals and then beat fellow Englishman James Wilson in the final. His performances earned him qualification for the 2008 BDO World Championship. He faced former World Champion Ted Hankey in the first round and lost 3–2 despite leading 2–1. West bounced back from his Lakeside defeat to win the 2008 German Gold Cup beating Andree Welge in the final. He then won the Finnish Open, beating local favourite and former Masters finalist Jarkko Komula in the semi-finals and then beat Norway's Robert Wagner in the final. He also made two semi-final showings in the Belgium Open and the French Open and reached the quarter-finals of the Northern Ireland Open. These performances helped West qualify automatically for the 2009 BDO World Championship at the Lakeside, where he was the number 13 seed. However, he was outclassed by Alan Norris 3–0 in the first round. West could not better this in 2010 either, as once again he relinquished a 2–1 lead this time to Irish débutante Martin McCloskey.  In 2011, West once more lost in the first round to 2010 finalist Dave Chisnall after missing three darts at double top to win before Chisnall came back to force a tiebreak in the final set and eventually win. In 2012, West lost in the first round of the BDO World Championship for the fifth year in a row against former runner-up and world #1 Tony O'Shea. This levelled him with Davy Richardson and Tony Payne for the record of most first-round losses at the World Championship before finally winning.", "In 2016 West's best results came in the second half of the year. Wins over Mike Zuydwijk, William O'Connor, Jeffrey de Zwaan, Simon Whitlock, Cristo Reyes and Ricky Evans at the 16th Players Championship event saw him play in his first PDC final. West was 4–2 down to Michael van Gerwen, but took out a 116 finish to lead 5–4. He threw for the title in a deciding leg and was unable to take out 110 as Van Gerwen won it 6–5. A semi-final followed in the 18th event after beating Adrian Lewis 6–3 and he lost 6–1 to Whitlock. The result qualified him for the World Grand Prix and he pulled off what he called the biggest moment of his darting life by knocking out 11-time winner of the event Phil Taylor 2–1. He lost 3–0 to Daryl Gurney in the second round with each set going to a deciding leg. He met his brother Tony in the first round of the German Darts Championship and averaged 109.98 in a 6–0 whitewash. West went on to see off Stephen Bunting 6–2 and Kim Huybrechts 6–5, before being defeated 6–2 by Alan Norris in the quarter-finals. He qualified for his first European Championship and lost the first five legs against Jelle Klaasen in the opening round and went on to be eliminated 6–3.", "*2009: First round (lost to Alan Norris 0–3)"]}, {"page": "Players Championship Finals", "response": ["| Alan Norris", "| Alan Norris"]}, {"page": "2009 BDO World Darts Championship", "response": [":#  Alan Norris", "|align=\"left\"|  Alan Norris", ":Steve West 0–3 Alan Norris (1–3, 0–3, 0–3)", "The opening match saw Mark Webster begin the defence of his title and he beat Holland's Willy van de Wiel. 2008 Masters runner-up Scott Waites also won against Ross Smith 3–0. 2000 champion Ted Hankey and 2001 champion John Walton both had 3–0 wins over former semi-finalists Brian Woods and Shaun Greatbatch respectively. Greatbatch was diagnosed with multiple myeloma in June 2008.  He received a guard of honour and a standing ovation after his match.  Former World Darts Trophy champion Gary Robson overcame Stephen Bunting 3–1 in a match where he averaged 98.  England's Alan Norris beat number 13 seed Steve West 3–0.", ":Alan Norris 0–4 Scott Waites (0–3, 2–3, 1–3, 2–3)", "Day four saw the start of the second round. Tony O'Shea averaged 92 as he beat Holland's Edwin Max 4–0. Darryl Fitton averaged 98 beating the previous year's finalist Simon Whitlock 4–2 while Whitlock averaged 92. Top seed Gary Anderson made the quarter-finals beating Wales' Robert Hughes 4–2. World Masters runner-up Scott Waites reached the quarter-finals with a 4–0 win over Alan Norris."]}, {"page": "Daniel Larsson (darts player)", "response": ["Larsson reached the semi final of the 2006 WDF Europe Cup, scoring wins over Tony O'Shea and Martin Phillips before losing to Niels de Ruiter. He then reached the final of the Sweden National Championship, losing to Alan Norris.", "*2015: First round (lost to Alan Norris 2–3)"]}, {"page": "2008 Zuiderduin Masters", "response": ["| 1 || align=\"left\"|  Alan Norris || 2 || 2 || 0 || 10 || 5 || +5 || 4", "Alan Norris 86.16 5–2 Geert De Vos 80.82", "Alan Norris 85.80 5–3 Martin Adams 76.26"]}, {"page": "Ross Smith (darts player)", "response": ["In 2018 he won his Tour card back and in 2019 he reached the world championship where he defeated Paul Lim in the first round, but lost to Daryl Gurney in the second round. He also qualified for the UK Open in 2019 where he reached the quarter finals after defeating Dawson Murschell, Yordi Meeuwisse, Alan Norris, Steve West and James Wade. "]}, {"page": "Daryl Gurney", "response": ["Gurney's Irish Matchplay title earned him a place in the preliminary round of the 2015 World Championship and Scott MacKenzie missed one dart to eliminate him 4–0. Instead, Gurney levelled at 3–3 before MacKenzie missed a dart at double 11 to complete a 142 finish which allowed him to step in and seal a 4–3 win. Gurney then lost 3–1 against Ronnie Baxter in the first round. From the last 32 stage of the fifth UK Open Qualifier, Gurney beat Alan Norris, Peter Wright and Dave Chisnall to reach his first PDC semi-final where he was defeated 6–2 by Michael Smith. The performance helped him to enter the UK Open at the third round stage and he thrashed Kevin McDine 9–1 to play John Henderson in the fourth round. Gurney won five legs in a row between 13 and 15 darts to surge 8–7 ahead, before Henderson sent the tie into a deciding leg which he won. His second semi-final came at the 10th Players Championship event and he was eliminated 6–3 by Joe Murnan. Gurney lost 2–0 in sets to Robert Thornton in the first round of the World Grand Prix, but two quarter-final exits saw him play in the Players Championship Finals for the first time. He averaged 101.38 in a 6–2 victory over Kim Huybrechts and then knocked out reigning world champion Gary Anderson 10–4, winning the last six legs in a row, to reach his first major quarter-final. Gurney then advanced to the semi-finals with a 10–5 victory over Benito van de Pas, but from level at 2–2 with Michael van Gerwen, Gurney lost nine successive legs to exit the tournament."]}, {"page": "Wayne Warren", "response": ["Warren also qualified for the 2013 World Championship, but lost in the first round to Alan Norris.", "* 2013: First round (lost to Alan Norris 1–3)"]}, {"page": "2009 in darts", "response": [" The men's pairs were won by Hans Zeelenberg and Niels-Jan Stuiver, beating Alan Norris and Stephan Gerritsen 5–2.", "|align=right| Martin Atkins  ||align=center| 1–3 ||  Alan Norris", "|align=right| Alan Norris  ||align=center| 0–3 ||  Darryl Fitton", ":Quarter-Finals (Losers £100, Best of 5 legs) Tony O'Shea 3–2 Ian White, Martin Phillips 3–1 Garrett Gray, Martin Atkins 3–1 Martin Adams, Andy Roberts 3–1 Alan Norris", ":Quarter-Finals (Losers £150, Best of 5 legs) Colin Fowler 3–2 Martin Adams, Dave Chisnall 3–1 Alan Norris, Paul Hanvidge 3–2 Daryl Gurney, Martin Atkins 3–1 John Henderson"]}, {"page": "German Darts Championship", "response": ["|  Alan Norris "]}, {"page": "2010 BDO World Darts Championship", "response": [":#  Alan Norris"]}, {"page": "German Open (darts)", "response": ["|  Alan Norris"]}, {"page": "French Open (darts)", "response": ["|  Alan Norris", "|  Alan Norris", "* Most wins 2:  Alan Norris,  Peter Evison,  Rod Harrington. ", "* Most Prize Money won €3,800:  Alan Norris."]}, {"page": "Denmark Open (darts)", "response": ["|  Alan Norris"]}, {"page": "Wales Masters", "response": ["|  Alan Norris"]}, {"page": "British Classic (darts)", "response": ["|  Alan Norris"]}, {"page": "Wales Classic", "response": ["|  Alan Norris"]}, {"page": "2011 BDO World Darts Championship", "response": [":#  Alan Norris"]}, {"page": "2009 Zuiderduin Masters", "response": ["| 1 || align=\"left\"|  Alan Norris (8) || 2 || 2 || 0 || 10 || 7 || +3 || 4", "Alan Norris 90.75 5-3 Ian White 83.19 ", "Alan Norris 84.78 5-4 John Henderson 76.62 "]}, {"page": "2016 in sports", "response": ["** Winner:  Alan Norris"]}, {"page": "Joe Cullen (darts player)", "response": ["He took the final qualifying spot from the Pro Tour Order of Merit for the 2016 World Championship, but lost in the opening round for the sixth year in a row as he won just two legs during a 3–0 defeat to Jelle Klaasen. At the UK Open Cullen beat Mark Frost 9–1, Alan Norris 9–6 and Stephen Bunting 9–7 to play in his first major quarter-final. He produced a fightback from 9–3 down to Peter Wright, but would lose 10–7 with an average of 101.83, his highest in a televised match to date. This began a rich vein in form for Cullen as he reached the semi-finals of the first Players Championship event (lost 6–3 to Wright) and the same stage of the German Darts Masters (lost 6–1 to Michael van Gerwen after whitewashing reigning world champion Gary Anderson 6–0 in the quarters)."]}, {"page": "Nigel Heydon", "response": ["Heydon began 2015 70th in the world rankings and so entered Q School in a bid to earn a two-year  PDC tour card. He was successful on the first day by defeating Jim Walker 5–3 in the final round. The highlight of Heydon's year undoubtedly came at the 11th Players Championship event in May, when he overcame Darren Johnson, Alan Norris, Mark Dudbridge, John Bowles and Jelle Klaasen to play in the semi-finals, where he lost 6–4 to Dave Chisnall. Other than that, Heydon was unable to get past the last 32 of any event in 2015."]}]}}