{"wiki_id": "http://www.wikidata.org/entity/Q4706671", "itemLabel": "Alan Gane", "itemDescription": "English footballer and manager (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Gane", "wikipedia_page": {"main": "Alan Gane (born 11 June 1950) is an English former amateur footballer and manager. He is notable for promoting Wycombe Wanderers from the non-League Isthmian League into the Conference National in 1986.", "link_mentions": [{"page": "Wycombe Wanderers F.C.", "response": ["| Alan Gane"]}, {"page": "Wealdstone F.C.", "response": ["* October 1989 – December1990 Alan Gane"]}, {"page": "Sutton United F.C.", "response": ["*Alan Gane, manager 1991–1996"]}, {"page": "Walton & Hersham F.C.", "response": ["*  Alan Gane"]}, {"page": "Gane", "response": ["*Alan Gane (born 1950), English former amateur footballer and manager"]}, {"page": "History of Wycombe Wanderers F.C.", "response": ["Paul Bence was appointed as the new manager and began a rebuilding process bringing in strikers Simon Read and Declan Link from Staines Town. The Hitachi League Cup was won, Farnborough Town being beaten 5–1 over two legs. The side recovered from a slow start in the league to finish third, losing just three of their last 21 games. Champions Sutton United and runners-up Worthing were unable to go into the Gola League and Wycombe finally took the gamble and accepted the invitation to play in a national league for the first time in the club's history. It proved to be a struggle but the team found its feet and held its own until the last two months of the season. An FA Cup run played its part, as Wycombe Wanderers faced Fourth Division Colchester United in the first round. A game that was marred by crowd trouble saw Mark West give the Blues a third-minute lead and Simon read scored a second to seal a 2–0 victory. It was the game that began an unusual rivalry between two clubs who were more than 100 miles apart. The second round pitted the U's neighbours Chelmsford City against the Blues, and another 2–0 victory at Loakes Park saw more crowd trouble. The third round draw was rather unkind and an away tie at York City saw the Ministermen win 2–0. Two crucial factors during the season were the loss of striker Declan Link who left in November to work in the United States and the resignation of Manager Paul Bence in January, due to his business responsibilities. His assistant Alan Gane took over but were unable to halt the slide and the team lost eleven of the last 14 league games. It the penultimate home game of the season the team held Altrincham to goalless draw, left-back Graham Pearce lobbed the ball over his own goalkeeper from 30 yards and into the net. Even worse was to follow when on the final Saturday of the season Wycombe drew 0–0 at home to Kettering Town. Yet their fate wasn't sealed until the following day when relegation rivals Dagenham travelled to FA Trophy finalists Runcorn Dagenham's goalkeeper scored from a wind assisted goal kick in the opening minute. Despite a Runcorn equaliser in the second half the Daggers held onto a point and condemned Wycombe to the first relegation in their history, on goal difference and on equal points with three other clubs.", "The new board increased the club's weekly wage bill at manager Alan Gane's request as the club sought to bounce straight back to the Gola League.Finch, D & Peart, S. (1996). Wycombe Wanderers 1887–1996 The Official History. Yore Publications. Page 63. . New signings arrived including Kevin Durham and the sensational signing of Keith Barrett and Noel Ashford, both from Enfield, for a combined fee of £9,000. Ashford soon established himself as a cult figure at Loakes Park and was nicknamed \"God\". The Blues won their first eight league games and it was soon clear that it would be a two horse race for the title with rivals Yeovil Town. There were two embarrassing cup defeats, a 5–1 thrashing at home to VS Rugby in the FA Cup and a 1–0 replay defeat at Leatherhead in the FA Trophy. However, there were two pieces of good news over the holiday period. Yeovil Town boss Gerry Gow resigned and former striker Declan Link returned from the United States. Despite a 1–0 defeat by Yeovil Town at Loakes Park, a game played in a violent atmosphere, the Wanderers closed in on the title and won the final seven games of the season to win their eighth, and final, Isthmian League Championship and promotion back to the GM Vauxhall Conference. They did it winning 32 of their 42 league matches, earning 101 points and scoring 103 goals.", "The joy of a return to the GM Vauxhall Conference was soon replaced by dismay when Alan Gane resigned after falling out with the new board. Gane wanted to sign some of the top players in non-league football but Chairman Brian Lee rejected the proposals as he was concerned that the wage bill would spiral out of control.Finch, D & Peart, S. (1996). Wycombe Wanderers 1887–1996 The Official History. Yore Publications. Page 64. . Former player Peter Suddaby was appointed as Gane's replacement and a 4–0 defeat at home to Stafford Rangers on the opening day was a sign of things to come. Worse was to follow when iconic striker Noel Ashford was sold to Barnet for a then record non-league fee of £17,000. Dismay soon turned to disgust as local rivals Aylesbury United knocked the Blues out of the FA Cup in the first qualifying round, winning 2–0 at Buckingham Road. The nadir followed when Ashford returned to Loakes Park with Barnet and humiliated the home side with a 7–0 thrashing. Things improved slightly and the team hovered just above the relegation zone but a 5–1 thrashing at the hands of Maidstone United at Loakes Park on 2 January 1988 was the final straw. The club asked for the managers resignation and Peter Suddaby fell on his sword. The board came up with a short-list of two men for the vacancy, Jim Kelman and Martin O'Neill. Only two of the seven directors voted for O'Neill and Jim Kelman was the surprise choice. His first game in charge was a thrilling 5–3 win at home to Cheltenham Town and it proved to be a real catalyst as the new boss slowly guided the team to 18th place, nine points clear of relegation.Finch, D & Peart, S. (1996). Wycombe Wanderers 1887–1996 The Official History. Yore Publications. Page 65. .", "Inspirational captain Glyn Creaser suffered a bad injury to his foot and when the side went on a run of four games without a win in February and March 1993, local rivals Slough Town came within four points of the Blues, having played two games more. The sides met at Adams Park and a then record crowd of 7,230, with many more locked out, saw a tense game that was decided by a 27th winner from Keith Scott. Wanderers had to play most of the second half with ten men when Andy Kerr was sent off, but some determined defending and fine goalkeeping from Paul Hyde ensured the three points. Martin O'Neill signed striker Tim Langford from Telford United for £15,000 and the sides went on another run in the FA Trophy. Wins over Cheltenham Town, Morecambe, Bromsgrove Rovers and Gateshead led the club to semi-final with Sutton United, managed by former boss Alan Gane. The U's sprung a great shock by winning the first leg at Adams Park 3–2. The tie was missed by Keith Scott through injury and he even took to an oxygen chamber to get fit for the second leg. The tension was palpable as more than half the 5,002 crowd at Gander Green Lane travelled to support the Blues. Keith Scott was declared fit and after a number of missed chances, centre-back Matt Crossley headed home from a corner and immediate sunk to his knees with a mixture of joy and relief. The visitors came out in the second half and grabbed the tie by the throat. On 48 minutes Keith Scott headed home from a Guppy corner and three minutes later Matt Crossley swept home another corner, this time from Dave Carroll, to make it 3–0. Keith Scott was replaced by Mark West with 15 minutes and within three minutes with his first touch he crossed for Dave Carroll to finish emphatically to make it 4–0. The 6–3 aggregate win saw the Blues go back to Wembley and the pitch was engulfed by celebrating fans at the final whistle. The following week there was even more celebrations, after a 1–1 draw with nearest challengers Slough Town, a 5–1 thrashing of Runcorn at Adams Park, including a sensational solo goal from Steve Guppy, saw the Wanderers all but seal promotion to the Football League."]}, {"page": "1969–70 Brentford F.C. season", "response": ["| Alan Gane"]}, {"page": "1970–71 Brentford F.C. season", "response": ["|Alan Gane"]}]}}