{"wiki_id": "http://www.wikidata.org/entity/Q4707243", "itemLabel": "Alan Marriott", "itemDescription": "English footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Marriott_(footballer)", "wikipedia_page": {"main": "Alan Marriott (born 3 September 1978) is an English former professional footballer who played as a goalkeeper.\nIn a career that lasted from 1997 until 2014. Marriott came through the ranks at Tottenham Hotspur he went on to notably spend 9 years with Lincoln City where he was involved in two play-off final defeats at the Millennium Stadium whilst playing under Keith Alexander. Marriott amassed 358 League appearances for the Imps and later had a spell with Rushden & Diamonds before a five year stint at Mansfield Town in which he was the clubs player of the season during the 2009–10 season and the Conference National title in 2012.", "link_mentions": [{"page": "Keith Alexander (footballer)", "response": ["Remaining at the club were former Tottenham Hotspur youngsters Alan Marriott and Peter Gain, Northern Ireland B international centre-back Paul Morgan along with midfielders Adam Buckley, Mark Camm and Ben Sedgemore and wing-backs Mark Bailey and Stuart Bimson and Alexander complemented their talents with a series of signings from outside of the Football League. After just one week in the job, Alexander completed his first two signings bringing Ben Futcher and Dene Cropper to the club on initial one-year contracts. One week later, Alexander made a second double swoop with Simon Weaver and Simon Yeo joining the ranks."]}, {"page": "Lewis Price", "response": ["After leaving the Rams, Price signed a 3-year contract to join Crystal Palace as understudy to Julián Speroni. He made his Palace debut in March against Burnley after Speroni had suffered an injury. On Friday 11 April 2014, Price signed for League 2 side Mansfield Town on loan as emergency goalkeeper cover for the injured Alan Marriott.On 17 November 2014, Price signed on loan with League One club Crawley Town until 20 December. At the end of his loan spell he returned to Crystal Palace but on 16 January 2015 it was announced that he had rejoined Crawley until the end of the season. Price was not offered a new contract by Palace at the end of the 2014–15 season."]}, {"page": "Steve Jones (footballer, born 1976)", "response": ["After a short spell with Droylsden, Jones signed for Conference National side AFC Telford United on 18 November 2011. He made his debut the following day in the 0–0 draw against Mansfield Town, he came on for Craig Farrell after 61 minutes and almost scored with his first touch, but his effort was well saved by Mansfield goalkeeper Alan Marriott. On 26 November, he came off the bench in the 1–0 win against Barrow, replacing Sean Newton after 68 minutes and scoring his first goal for the club. He headed in a Richard Davies cross on 76 minutes to give The Bucks their first league win in 9 outings. He made his first start for the club in the 1–1 draw against Luton Town three days later. Jones scored in the 2–2 draw with Stockport County on 24 January 2012. In the 0–0 draw with Alfreton Town on 3 March, Jones suffered a knee ligament injury that would keep him out of action for up to six weeks. He made his return from injury on 17 April, coming on as a 68th-minute substitute in the 1–0 win against Tamworth. The win secured Telford's place in the Conference National for the following season. On 4 May, it was announced on Telford's website that Jones had agreed terms to a contract extension with the club."]}, {"page": "Tony Bullock", "response": ["On 22 March 2001 he became Alan Buckley's first signing for Lincoln City when the Sincil Bank based club agreed to take over his contract until the end of the season. His debut came five days later in the 1–0 defeat at Hartlepool United but he failed to displace Alan Marriott permanently and, after one final appearance, was released by the club at the end of the season."]}, {"page": "Richard Butcher (footballer)", "response": ["Family, friends and fans paid tribute to Butcher at Lincoln City's Sincil Bank stadium on Wednesday 2 February 2011, the service was attended by fellow footballers and close friends Simon Yeo, Ben Futcher, Paul Morgan and Alan Marriott as well as former Macclesfield teammates and Peterborough United director Barry Fry. A private service was held at Lincoln Crematorium service following the thanksgiving service at the stadium."]}, {"page": "Matthew Ghent", "response": ["His league debut came on 2 December 2000 when he was a first-half substitute for the injured Alan Marriott in the 1-1 draw away to Carlisle United. He started the FA Cup surprise defeat at home to Dagenham & Redbridge the following week but after again not settling at Lincoln left the club a short time after."]}, {"page": "Craig Mawson", "response": ["In September 2000, Lincoln City's manager Phil Stant signed Mawson on-loan as cover for his first-choice keeper Alan Marriott. Whilst the loan was extended to a second month, Mawson would remain an unused substitute in each of Lincoln's nine league games during this period before returning to Burnley."]}, {"page": "Simon Rayner", "response": ["He made his league debut for Lincoln on September 25, 2004, but struggled to establish himself due to the presence of Alan Marriott as Lincoln's first choice keeper. Rayner joined non-league Alfreton Town on loan in January 2006."]}, {"page": "2007–08 Lincoln City F.C. season", "response": ["|01 ||  Alan Marriott || Bedford || 29 || Tottenham Hotspur || August 1999 ", "| GK || Alan Marriott || 1 || 0 || 3"]}, {"page": "Ayden Duffy", "response": ["In the summer of 2006, Duffy accepted a one-year professional contract with Lincoln City. His first season saw him spend time on loan at Worksop Town where a broken leg ended his season. He accepted a further one-year contract and on 12 April 2008 made his professional debut, replacing the injured Alan Marriott in the 2–1 victory against Chester City."]}, {"page": "Exodus Geohaghon", "response": ["In August 2011, Geohaghon left Peterborough United by mutual consent. Later that month Geohaghon signed a one-month contract with Barnet following a successful trial period. He played four games in ten days, before leaving the club. In October 2011, he signed with Conference Premier club Darlington, leaving him working with manager Mark Cooper for a third time. He made his debut for the club in a 4–3 win over Stockport County, and four days later he set up Jonathan Sanchez-Munoz for the only goal of a 1–0 win at home to Kidderminster Harriers. Despite this, Cooper was sacked on 25 October. On 21 November, Geohaghon returned to League Two football, signing a three-month loan deal with Dagenham & Redbridge. He made his debut at Victoria Park on 12 December, setting up Brian Woodall for the opening goal of a 2–1 defeat to former club Port Vale. Meanwhile, his parent club Darlington were suffering financial difficulties and Geohaghon's contract was terminated on 16 January 2012, along with the rest of the playing squad and caretaker manager Craig Liddle. Darlington held onto his registration, and on 24 February he signed for Conference Premier rivals Mansfield Town on loan until the rest of the season. He scored his first goal in nearly eighteen months on 13 March, when he headed in a stoppage time equalizer in a 1–1 draw with Conference Premier leaders Fleetwood Town at Field Mill. The \"Stags\" reached the play-offs, but crashed out at the semi-final stage to York City 2–1 on aggregate, with Geohaghon scoring an own goal in the first leg at Bootham Crescent after a communication breakdown with goalkeeper Alan Marriott."]}, {"page": "Steve Cherry", "response": ["Cherry spent three months coaching at Notts County under Sam Allardyce in 1999. He joined Lincoln City as the club's goalkeeping coach in 2001 and registered as a player after signing on non-contract terms in March 2003 to provide cover for first choice goalkeeper Alan Marriott.Alan Marriott says Scott Loach's dedication is behind the keeper's rise to the top, thisislincolnshire.co.uk He spent the 2003–04 season playing for Kidsgrove Athletic in the Northern Premier League Division One and helped the club to win their first Staffordshire Senior Cup with victory over Stafford Rangers in the final. He joined Kidsgrove as cover for the injured Phil McGing and his son also joined the club at the same time. Kidsgrove reported that they were the first club in the country to have father and son goalkeepers in the squad at the same time. He later played for Belper Town. In 2006 he returned to Notts County as a part-time goalkeeping coach, leaving when Ian McParland replaced Steve Thompson as manager the following year. He was appointed as goalkeeping coach at Macclesfield Town in July 2008, but left the job in May 2010 after an illness required that he undergo heart surgery."]}, {"page": "2007 Football League Two play-off Final", "response": ["Bristol Rovers went into the play-offs having won seven and drawn two of their last eleven games.  Their opponents for the other play-off semi-final were Lincoln City and the first leg was held at the Memorial Stadium in Bristol on 14 May 2007.  Craig Disley opened the scoring for the home side on ten minutes when headed in a cross from Rickie Lambert past Alan Marriott, the Lincoln City goalkeeper.  Jeff Hughes equalised for Lincoln City in the 31st minute when he struck his free kick into the top-right corner of the Bristol Rovers goal.  Nine minutes into the second half, Richard Walker scored with a volley from Steve Elliott's free kick to give Bristol Rovers the lead which they held to win the match 2–1.  The second leg was played three days later at Sincil Bank in Lincoln.  Stuart Campbell scored in the third minute for Bristol Rovers with a long-range strike and Lambert volleyed past Marriott to make it 2–0 eight minutes later.  Hughes scored from Jamie Forrester's cross midway through the first half to reduce Lincoln City's deficit before Walker made it 3–1 nine minutes before half time.  Mark Stallard scored for Lincoln City seven minutes later with a half-volley but a second-half Sammy Igoe goal made it 4–2 to Bristol Rovers in the 82nd minute.  Sean Rigg then made it 5–2 in the 90th minute before Hughes scored his second to ensure the match ended 5–3 and Bristol Rovers progressed to the final with a 7–4 aggregate victory."]}, {"page": "Greg Pearson", "response": ["Pearson scored his first two goals for Grimsby on 27 August 2012 against Mansfield Town, scoring the second goal of the game after great work by Aswad Thomas to beat his marker for pace, but was brought down in the box, up came Pearson to confidently score the penalty kick on 45 minutes, he scored the fourth goal of the game on 76 minutes with a superb flick on at the front post that looped over the head of the head of the helpless Alan Marriott into the net, the game finishing a 4–1 to Grimsby. On 15 December 2012 he scored the third goal of the game in the 4–0 thrashing of Havant & Waterlooville in the FA Trophy, a glancing header, from a cross first-time by Marcus Marshall."]}, {"page": "2001 Football League Trophy Final", "response": ["The area finals were two-legged fixtures, Port Vale against Lincoln City, with the first leg at Sincil Bank. Lincoln were the better side in the first half, but Vale came into the game and it was Bridge-Wilkinson who broke the deadlock after scoring direct from a free-kick in the 53rd-minute; Naylor added a second with five minutes to go to give the \"Valiants\" a big advantage for the return fixture. Vale then put in a \"professional display\" in the second leg seven days later, hitting the woodwork three times with Brammer, Smith and Naylor and forcing saves out of Alan Marriott from Brooker and Bridge-Wilkinson; the game finished goalless though and Vale won the tie 2–0 on aggregate."]}, {"page": "History of Rushden & Diamonds F.C.", "response": ["During the summer, Hill brought in a plethora of new faces; including former Lincoln City shot stopper Alan Marriott and former Cambridge midfielder Rob Wolleaston. Hill also brought to the club Dean McDonald, Lee Phillips, Sagi Burton, Jamie McGuiness, Gareth Jelleyman and Daryl Clare from Conference National rivals Burton Albion. Leon Knight was also later brought in, a major coup. On paper, and according to the bookies, Rushden were considered one of the best teams in the league, and were joint-favourites to win the Conference."]}, {"page": "2004 Football League Third Division play-off Final", "response": ["Huddersfield Town's opposition for their semi-final were Lincoln City and the first leg was held at Sincil Bank in Lincoln on 15 May 2004. Iffy Onuora put the visiting side ahead after five minutes with a close-range header from a Rob Edwards corner.  In the 51st minute, Lincoln equalised: a long throw-in from Kevin Ellison eventually found Simon Yeo whose volley was saved by Paul Rachubka but the rebound was scored by Gary Fletcher.  Huddersfield regained the lead through David Mirfin: Andy Holdsworth's corner was headed goalward by Andy Booth and saved by Alan Marriott but the ball fell to Mirfin who scored from a tight angle, ending the match 2–1 to Huddersfield.  The second leg was played four days later at the McAlpine Stadium in Huddersfield.  Richard Butcher scored in the 38th minute after a defensive mix-up between Rachubka and Efe Sodje to give Lincoln a 1–0 lead before Mark Bailey doubled the lead with a shot from the edge of the Huddersfield penalty area.  In the 60th minute, Lincoln's Jamie McCombe fouled Booth to concede a penalty which Danny Schofield converted.  Late in the match, Edwards scored from the edge of the Lincoln box to make it 2–2 and give Huddersfield a 4–3 aggregate victory."]}, {"page": "2005 Football League Two play-off Final", "response": ["The match kicked off around 3p.m. on 28 May 2005 at the Millennium Stadium in Cardiff in front of 19,653 spectators.   The match was an even affair during the first half: early on, Francis Green's header for Lincoln was off-target, and the team then saw a goal from Yeo ruled out.  Southend had two goal-bound chances cleared as the Lincoln goalkeeper Alan Marriott saved shots from both Carl Pettefer and Mark Bentley.  Southend dominated the second half, with Eastwood creating the best chance in the 56th minute but falling over the ball with only Marriott to beat from around .  Green then blocked a shot from Southend's Che Wilson before Bentley was denied a penalty after Paul Morgan appeared to foul him. Regular time ended goalless, sending the match into extra time.  Jamie Jackson, writing in The Observer, described the first 90 minutes of the match as \"tepid, uninventive fare\".   The first goal was scored just before half-time in the first period of extra time.  Spencer Prior flicked on Nicolau's corner and Eastwood struck Matt Bloomer's clearance into the Lincoln goal to make it 1–0.  With ten minutes of extra time remaining, Eastwood ran at the Lincoln defence and passed the ball square to Duncan Jupp who scored his first league goal in a decade to give Southend a 2–0 lead. With no further additions to the scoreline, the match ended 2–0 and Southend secured promotion to League One.", "|GK ||1 ||Alan Marriott"]}, {"page": "1999–2000 Tottenham Hotspur F.C. season", "response": ["| Alan Marriott"]}, {"page": "Dale Roberts (footballer, born 1986)", "response": ["He joined Conference National team Rushden & Diamonds on a one-month loan on 24 January 2008, which was extended for a second month in February. He made 19 first team appearances for the club, including the Conference League Cup Final. Roberts rejoined Rushden for a second loan spell in October 2008 as cover for Alan Marriott who was out with a stomach injury that needed surgery. The loan was extended until January 2009 and he finished the spell with 18 appearances, keeping five clean sheets, and subsequently signed permanently at Nene Park on 2 January 2009. He was named Rushden's player of the season in 2008–09."]}, {"page": "2011 FA Trophy Final", "response": ["The game was a particularly even affair with both sides carving out early chances. Darlington goalkeeper Sam Russell had to be alert early on to clear an Adam Murray pass which had sent Duncan Russell clean through on goal. At the other end, Alan Marriott did well to punch away a corner from Aaron Brown before Liam Hatch could get his head on it. In the 18th minute, a Mansfield corner was met by the head of former Darlington captain Steve Foster, but the ball sailed well over the bar. On 32 minutes, Gary Smith broke into the Mansfield, where he appeared to be brought down by Louis Briscoe. Referee Stuart Attwell, who was well placed, waved away the penalty appeals. Darlington suffered a blow on 38 minutes when Smith, who had been lively in midfield, limped off to be replaced by Aman Verma. The first half of the match concluded with the score at 0–0.", "|GK ||1 || Alan Marriott"]}, {"page": "History of Mansfield Town F.C.", "response": ["David Holdsworth made a fantastic impact in his start at the Stags, winning the majority of his games, instantly guiding the club away from their relegation worries. He shored up the Mansfield defence and with the new signings of Alan Marriott, Scott Garner and Paul Mayo the team broke the club record of consecutive home clean sheets with six in a row, against Crawley Town, Rushden & Diamonds, York City, Kettering Town, Lewes, finally beating the record with a 1–0 victory over Forest Green Rovers. Despite this fantastic home form, Mansfield couldn't pick up enough points to muster enough of a challenge for the play-offs. Another poor, mid-table season followed and in November 2010, David Holdsworth was sacked as manager."]}, {"page": "Alan Marriott", "response": ["Alan Marriott may refer to:", "* Alan Marriott (footballer) (born 1978), English footballer", "* Alan Marriott (voice actor) (born 1971), improv comedian, writer and voice actor"]}, {"page": "Liam Mitchell (footballer)", "response": ["In October 2012, Mitchell joined Mansfield Town on loan to replace injured first choice goalkeeper Alan Marriott, starting in every game of his loan spell and keeping two clean sheets in those three games. Following an impressive showing in goal for Mansfield in a crucial 1–0 win over Forest Green Rovers in October 2012, his manager Paul Cox said of Mitchell, \"he's a quality goalkeeper and is going to be an outstanding goalkeeper once he matures. We are glad we have got him. He is in competition with Mazza and Shane Redmond now.\""]}, {"page": "Dan McPhail", "response": ["McPhail joined Third Division North club Lincoln City in the 1931 close season, as what the Daily Express expected to be \"an efficient substitute\" for Jimmy Maidment, who had just signed for Notts County; Maidment's brother Tom went to Portsmouth in exchange, together with what was described as a small fee. McPhail went straight into the starting eleven, and was ever-present as Lincoln won the 1931–32 Northern Section title. On Boxing Day 1933, he was sent off for striking the opposing centre-forward, Tom Nolan of Port Vale, who had barged into him while he was holding the ball. It transpired that the case was one of mistaken identity. The referee saw McPhail bent over the unconscious Nolan and assumed him to be to blame, but the offending blow had in fact been struck by Lincoln's Alf Young in an off-the-ball incident. In the next match, McPhail suffered a dislocated elbow, an injury that forced his absence from a competitive match for the first time since signing for the club. When he returned to action, he kept his place until near the end of the 1938–39 season, rarely missing a game. His final tally of 309 Football League appearances was at the time a club appearance record for players in any position, and the record for appearances by a goalkeeper lasted until 2007, when it was broken by Alan Marriott."]}, {"page": "2013–14 York City F.C. season", "response": ["York achieved their first home win in five matches after beating Exeter 2–1, with first half goals scored by McCombe and Coulson. Hayhurst's loan was extended to the end of the season, having impressed in his six appearances for the club. Coulson scored again with the only goal, a 41st-minute header, in York's 1–0 away win over AFC Wimbledon. Bowman scored the only goal with a 32nd-minute penalty as York won 1–0 away against Mansfield, in which Fletcher missed the opportunity to extend the lead when his stoppage time penalty was saved by Alan Marriott. York moved one place outside the play-offs with a 2–0 home win over Wycombe, courtesy of a second Bowman penalty in as many matches and a Carson goal from the edge of the penalty area. Coulson scored York's only goal in a 1–0 away win over struggling Portsmouth with a low volley in the fifth minute; this result meant York moved into the play-offs in seventh-place with eight fixtures remaining."]}]}}