{"wiki_id": "http://www.wikidata.org/entity/Q4708059", "itemLabel": "Alan Wilkinson", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Wilkinson_(RAF_officer)", "wikipedia_page": {"main": "Lieutenant Colonel Alan Machin Wilkinson  (21 November 1891 – June 1972) was a British First World War flying ace credited with nineteen aerial victories. He was one of only about 25 pilots twice awarded the DSO during the war, five of whom were also holders of the Victoria Cross.", "link_mentions": [{"page": "John Letts (RAF officer)", "response": ["On the afternoon of 9 April Letts and his observer Lieutenant Harold George Collins, accompanied by an aircraft piloted by Captain Alan Wilkinson with 2nd Lieutenant Laurence W. Allen, engaged five aircraft from Jagdgeschwader 1 – Richthofen's \"Flying Circus\" – in a dogfight over Arras. They jointly claimed two aircraft shot down, even though Letts aircraft was \"cut to ribbons\", and Collins killed. Letts next victory came on 4 May, when he and observer 2nd Lieutenant L. Speller shared in the destruction of an Albatros D.III over Pelves with pilot 2nd Lieutenant H. Smithers and observer AM2 Valentine Reed. On 11 May, in a fight with aircraft from  Jagdstaffel 11, Letts and Jameson, with Smithers and AM2 Rutherford, shared an Albatros D.III shot down over Biache-Dury, but Letts' aircraft was badly damaged, and two other British aircraft were also shot down. Letts managed to nurse his aircraft back over the British front lines before crash landing. The next day he claimed two more enemy aircraft, driving down an Albatros D.III over Beaumont with 2nd Lt. Jameson in the morning, and another D.III driven down over Izel with Lt. Allen in the afternoon, bringing his total to six."]}, {"page": "Alan Wilkinson", "response": ["Alan Wilkinson may refer to:", "* Alan Wilkinson (footballer) (1924–2015), New Zealand former footballer", "* Alan Wilkinson (RAF officer) (1891–1972), British World War I flying ace", "* Alan Wilkinson (speedway rider) (1949–2020), English speedway rider"]}, {"page": "Alan Wilkinson (aviator)", "response": ["#REDIRECT Alan Wilkinson (RAF officer)"]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Alan Wilkinson"]}]}}