{"wiki_id": "http://www.wikidata.org/entity/Q4708035", "itemLabel": "Alan Whicker", "itemDescription": "British journalist and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Whicker", "wikipedia_page": {"main": "Alan Donald Whicker  (2 August 1921 – 12 July 2013) was a British journalist and television presenter and broadcaster. His career spanned almost 60 years, during which time he presented the documentary television programme Whicker's World for over 30 years. He was made a Commander of the Order of the British Empire (CBE) in 2005 for services to broadcasting.", "link_mentions": [{"page": "August 2", "response": ["*1921 – Alan Whicker, Egyptian-English journalist (d. 2013)"]}, {"page": "Rhyming slang", "response": ["In the 20th century, rhyming slang began to be based on the names of celebrities — Gregory Peck (neck; cheque), Ruby Murray [as Ruby] (curry), Alan Whicker [as \"Alan Whickers\"] (knickers), Puff Daddy (caddy), Max Miller (pillow [pronounced ]), Meryl Streep (cheap), Nat King Cole (\"dole\"), Britney Spears (beers, tears), Henry Halls (balls) — and after pop culture references — Captain Kirk (work), Pop Goes the Weasel (diesel), Mona Lisa (pizza), Mickey Mouse (Scouse), Wallace and Gromit (vomit), Brady Bunch (lunch), Bugs Bunny (money), Scooby-Doo (clue), Winnie the Pooh (shoe), and Schindler's List (pissed). Some words have numerous definitions, such as dead (Father Ted, \"gone to bed\", brown bread), door (Roger Moore, Andrea Corr, George Bernard Shaw, Rory O'Moore), cocaine (Kurt Cobain; [as \"Charlie\"] Bob Marley, Boutros Boutros-Ghali, Gianluca Vialli, oats and barley; [as \"line\"] Patsy Cline; [as \"powder\"] Niki Lauda), flares (\"Lionel Blairs\", \"Tony Blairs\", \"Rupert Bears\", \"Dan Dares\"), etc."]}, {"page": "July 12", "response": ["*  2013   – Alan Whicker, Egyptian-English journalist (b. 1925)"]}, {"page": "Michael Palin", "response": ["Starting in 1989, Palin appeared as presenter in a series of travel programmes made for the BBC. It was after the veteran TV globetrotter Alan Whicker and journalist Miles Kington turned down presenting the first of these, Around the World in 80 Days with Michael Palin, that gave Palin the opportunity to present his first and subsequent travel shows."]}, {"page": "History of Norfolk Island", "response": ["In the late 1960s a mini-invasion by British ex-pats followed after the island was featured on a BBC television documentary presented by Alan Whicker. Fifty families decided to emigrate from the United Kingdom to Norfolk Island as a result of the programme.Alan Whicker's Journey of a Lifetime, broadcast on BBC Two, 25 April 2009."]}, {"page": "1925", "response": ["** Alan Whicker, British television presenter (d. 2013)"]}, {"page": "Beatnik", "response": ["By 1960, a small \"beatnik\" group in Newquay, Cornwall, England (including a young Wizz Jones) had attracted the attention and abhorrence of their neighbours for growing their hair beyond shoulder length, resulting in a television interview with Alan Whicker on BBC television's Tonight series."]}, {"page": "François Duvalier", "response": ["Alan Whicker featured Duvalier in a 1969 episode of Whicker's World, which included an interview with the president. Made by Yorkshire Television, the documentary is deeply revealing of Duvalier's character as well as being deeply revealing of the state of Haiti in 1969."]}, {"page": "Alfredo Stroessner", "response": ["Stroessner gave a written television interview to Alan Whicker as part of a documentary called The Last Dictator (UK: 7 April 1970) for the television series Whicker's World. The programme was released in a Region 2 DVD box-set by the UK's Network imprint."]}, {"page": "J. Paul Getty", "response": ["When speaking in a televised interview with Alan Whicker in February 1963, Getty said that he thought guests would want to use a payphone.Talk at the BBC, BBC Four, April 5, 2012 After 18 months, Getty explained, \"the in-and-out traffic flow at Sutton subsided. Management and operation of the house settled into a reasonable routine. With that, the pay-telephone [was] removed, and the dial-locks were taken off the telephones in the house.\"Getty, 1976, p. 320"]}, {"page": "Orient Express", "response": ["* Whicker's World – Aboard The Orient Express: Travel journalist Alan Whicker joined the inaugural service of the Venice-Simplon Orient Express to Venice in 1982, interviewing invited guests and celebrities along the way."]}, {"page": "Battle of Anzio", "response": ["Alan Whicker, who was a war correspondent with the British Army's Film and Photo Unit and was present during the fighting, later said:", "* BBC reporter Alan Whicker was at Anzio as a member of the British Army Film and Photo Unit. His 2004 documentary Whicker's War describes his experiences there."]}, {"page": "ITV Yorkshire", "response": ["Yorkshire Television was a major producer within the ITV network and produced programming in all genres. The presenter Alan Whicker became a shareholder in the company at its inception and made many programmes for the station, most notably interviews with the Cat's Eye inventor Percy Shaw and the Haiti dictator Baby Doc Duvalier.", "In the mid-1980s, Yorkshire broke from the network by refusing to screen the BAFTA Awards, claiming them to be slaps on the backs of the BBC. The film The Sting was a replacement in 1986. As the rest of the network overran in the live BAFTA screening, Yorkshire had to cobble together minor programmes until other regions were able to screen the late-running ITN News. In the 1990s, while Bruce Gyngell was managing director, Yorkshire declined to show several late-night programmes, including The Good Sex Guide. One such series, Hollywood Lovers, was replaced with Alan Whicker repeats."]}, {"page": "American Express", "response": ["In 1975, David Ogilvy of Ogilvy & Mather developed the highly successful \"Don't Leave Home Without Them\" ad campaign for American Express Traveler's Cheques, featuring Oscar-award-winning actor Karl Malden. Malden served as the public face of American Express Travelers Cheques for 25 years. In the UK, the spokesman was the television personality Alan Whicker."]}, {"page": "Randolph Churchill", "response": ["While dining in Hong Kong, he had an altercation with the restaurant staff, who then proceeded to get the manually-operated lift stuck between floors, and to \"accidentally\" get grease on his new sharkskin suit while hauling him out. While Winston Churchill was researching his biography of his father, Alan Whicker, who had been Randolph's dining companion for the evening, confirmed the account which Randolph had given to his son at the time.Churchill 1997, p. 307 He returned to Korea to report on the Inchon Landings, the liberation of Seoul and the UN forces' crossing of the 38th Parallel. He then returned to the UK for an operation (6 February 1951) on his wounded leg."]}, {"page": "Percy Shaw", "response": ["Shaw was inventive, even at an early age, but his most famous invention was the cat's eye for lighting the way along roads in the dark. There are several stories about how he came up with the idea. The most famous involves him driving down the difficult road (Queensbury Road, part of the A647 with a very steep drop to one side) from the Old Dolphin public house in Clayton Heights to his home in Halifax, when a cat on a fence along the edge of the road looked at the car and reflected his headlights back to him, allowing him to take corrective action and remain on the road. In an interview with Alan Whicker, however, he told a different story of being inspired on a foggy night to think of a way of moving the reflective studs on a road sign to the road surface. Further, local schoolchildren who were taken on visits to the factory in the late 1970s were told that the idea came from Shaw seeing light reflected from his car headlamps by tram tracks in the road on a foggy night. The tram tracks were polished by the passing of trams and by following the advancing reflection, it was possible to maintain the correct position in the road.", "He became eccentric in later life, removing the carpets, curtains and much of the furniture from his isolated home, and keeping four televisions running constantly (respectively tuned to BBC1, BBC2 and ITV, all with the sound turned down) with a fourth showing BBC2 in colour. On each Friday a few friends would come to the house and Percy would supply crates of bottled ale and boxes of potato crisps. He told Alan Whicker that the reason for keeping the TVs on simultaneously was so that his friends could watch whichever of the then existing channels they chose to, and there would be no arguments. One luxury was his Rolls-Royce Phantom. He never married and he died from cancer and heart disease at Boothtown Mansion, Halifax, where he had lived for all but two of his 86 years. Despite rumours of a personal fortune, his personal estate was admitted to probate in December 1976 at a value of £193,500. He was an agnostic, but his funeral was held at Boothtown Methodist Church, and he was cremated in Elland."]}, {"page": "John Amery", "response": ["Amery continued to broadcast and write propaganda in Berlin until late 1944 when he travelled to Northern Italy to lend support to Italian dictator Benito Mussolini's Salò Republic. On 25 April 1945, Amery was captured along with his French mistress Michelle Thomas by Italian partisans from the Garibaldi Brigade near Como. Amery and Thomas were initially to be executed, but both of them were eventually sent to Milan, where they were handed over to Allied authorities. Amery was wearing the uniform of the \"Muti Legion\", a fascist paramilitary organisation. The British army officer who took him into custody was Captain Alan Whicker, later known as a broadcaster."]}, {"page": "Grand Prix (1966 film)", "response": ["Title designer Saul Bass was credited as visual consultant, montages and titles. He made extensive use of multiple split screens. During the making of the film, both Frankenheimer and Garner were interviewed by television personality Alan Whicker for the BBC series Whicker's World."]}, {"page": "All You Need Is Cash", "response": ["* Eric Idle as Dirk McQuickly, a parody of Paul McCartney; as The Narrator, a parody of Alan Whicker; and as Stanley J. Krammerhead III, Jr., occasional visiting professor of applied narcotics at the University of Please Yourself, California"]}, {"page": "List of premature obituaries", "response": ["* Alan Whicker (journalist), while reporting on the Korean War. He was flying with an aerial spotter in a Piper Aztec plane behind enemy lines, as part of a story. Although his plane landed safely, a similar craft was shot down on the same day, and was assumed to be Whicker's plane. The resulting newspaper obituary commented on his lack of achievement (Whicker then being far less well-known than he is now).Alan Whicker interview with Michael Parkinson, British Film Institute, September 30, 2002.  He died on July 12, 2013."]}, {"page": "Around the World in 80 Days with Michael Palin", "response": ["Palin accepts the offer from the BBC to attempt travelling around the world in 80 days. After setting off from the Reform Club in London, he boards the Orient Express at Victoria Station in London, while reminiscing on his rigorous preparations for his upcoming circumnavigation, which included a daily exercise programme, a chat with seasoned TV traveller Alan Whicker, who was the BBC's (but not the production team's, who deliberately talked him out of it) first choice for the series and would go on to criticise the show, calling it \"a seven-hour ego trip\", and the purchase of an inflatable globe. He also has dinner with his 'referees', who include Robert Hewison and fellow Pythons Terry Jones and Terry Gilliam. After taking a ferry across the English Channel, Palin crosses the Alps on board the Venice-Simplon Orient Express before being stopped in Innsbruck due to an Italian railway strike. Arriving in Venice by coach, he helps the local sanitation department clean up the city. After that, he travels through the Corinth Canal to Athens, where he sees the world-renowned Evzones, and meets a die-hard Python fan. After a brief stopover in Crete, Alexandria beckons.", "While preparing for the journey, Palin had a chat with renowned documentarist Alan Whicker. In the book and an interview on the DVD, Palin mentions that Whicker had been the BBC's first choice of presenter, but he and two others (Miles Kington and Noel Edmonds) had declined; Palin was fourth on the BBC's list."]}, {"page": "Gary Edwards (photographer)", "response": ["Anthony Worral Thompson, Ray Charles, Kevin Woodford, Lindka Cierach, Eva Herzigova, Alan Whicker, and Ian Botham. "]}, {"page": "Trinity, Jersey", "response": ["Alan Whicker lived here from the 1960s until his death in 2013."]}, {"page": "Alan Wicker", "response": ["#Redirect Alan Whicker"]}, {"page": "Avenue of Stars, London", "response": ["*Alan Whicker"]}, {"page": "Blaster Bates", "response": ["*:Nelson's Pillar in Dublin blown up, after the top was blown off by the IRA. Reporter Alan Whicker. Compilation on demolition."]}, {"page": "Robin Douglas-Home", "response": ["Douglas-Home married the fashion model Sandra Paul in 1959 and they had a son in 1962, Sholto. The couple were divorced in 1965 coinciding with his romance with Princess Margaret, Countess of Snowdon. His divorce was the subject of a BBC television documentary by Alan Whicker."]}, {"page": "The Angry Silence", "response": ["* Alan Whicker as Himself"]}, {"page": "Tonight (1957 TV programme)", "response": ["The programme covered the arts and sciences as well as topical matters and current affairs. There was a mixture of incisive and light-hearted items: unscripted studio interviews, by Derek Hart, Geoffrey Johnson-Smith and Michelmore himself; and filmed reports. Reporters included Alan Whicker, Fyfe Robertson, Kenneth Allsop, Chris Brasher, Julian Pettifer, Brian Redhead and Polly Elwes."]}, {"page": "Sid Waddell", "response": ["During his time with the BBC, Waddell penned ten episodes of a successful children's television series, Jossy's Giants in 1986. He was also the writer of two series of another children's show Sloggers which ran from 1994 to 1996. He was also a director for Mop and Smiff and assistant producer for the follow-up series Mike, Mop and the Moke. His credits also include working with the eccentric scientist Magnus Pyke and he was Alan Whicker's producer on Whicker's Women in 1972. He worked on the Russell Harty Show, and in 1993 did a series for Tyne Tees Television called Waddell's World in which he was a butler to a posh Tweeddale family, a caravanner and on the dole."]}, {"page": "Venice-Simplon Orient Express", "response": ["* British travel journalist Alan Whicker joined the inaugural service in 1982, interviewing invited guests and celebrities along the way for his Whicker's World TV series."]}, {"page": "The Benny Hill Show", "response": ["During his television career, Hill performed impersonations or parodies of such American celebrities as W. C. Fields, Orson Welles (renamed \"Orson Buggy\"), Kenny Rogers, Marlon Brando, Raymond Burr, and fictional characters that range from The Six Million Dollar Man and Starsky and Hutch to The A-Team (parodied as \"The B-Team\", in which he played the roles of both 'Hannibal' and 'B.A.') and Cagney & Lacey. He also impersonated such international celebrities as Nana Mouskouri and Miriam Makeba as well as British stars such as Shirley Bassey, Michael Caine (in his Alfie role), newscasters Reginald Bosanquet, Alan Whicker and Cliff Michelmore, pop-music show hosts Jimmy Savile and Tony Blackburn, musician Roger Whittaker, his former 1960s record producer Tony Hatch, political figures Lord Boothby and Denis Healey and Irish comedian Dave Allen. On a few occasions, Hill even impersonated his former straight man, Nicholas Parsons. A spoof of Who's Afraid of Virginia Woolf? saw him playing both Richard Burton and Elizabeth Taylor."]}, {"page": "Michael Parkinson", "response": ["In 2013, Parkinson again criticised the course British television had taken, comparing series such as The One Show unfavourably with the broadcasting of the recently deceased Alan Whicker and David Frost, as well as claiming the \"cult of youth\" had \"distorted the standards\". Parkinson spoke fondly of the time when \"producers were unencumbered by such irksome obstacles as compliance, health and safety and frustrating commissioning procedures\".Michael Parkinson: programmes like The One Show don’t live up to David Frost’s legacy. Radio Times. 9 September 2013. Retrieved 13 October 2013. Alex Jones, presenter of The One Show, rejected Parkinson's criticism.BBC One Show host Alex Jones hits back at Sir Michael Parkinson. The Daily Telegraph. 15 September 2013. Retrieved 13 October 2013."]}, {"page": "Late Night Line-Up", "response": ["*Alan Whicker 19 May 1968"]}, {"page": "Dave Freeman (British writer)", "response": ["Freeman co-wrote with Benny Hill from 1955 to 1968 for The Benny Hill Show on BBC. The early series were notable for spoofs of popular television personalities of the time, such as the quiz and talent-show host Hughie Green, the globe-trotting journalist Alan Whicker, and the undersea explorers Hans and Lotte Hass."]}, {"page": "The Magic Christian (film)", "response": ["* Alan Whicker as TV commentator (uncredited)"]}, {"page": "TV's 50 Greatest Stars", "response": ["! scope=\"row\" | Alan Whicker"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Alan Whicker – Army war reporter in Italy. After joining the BBC in 1957, he became an international reporter for Tonight. From 1958 on, he presented Whicker's World. He died in 2013."]}, {"page": "The Goodies Rule – O.K.?", "response": ["| Alan Whicker||||"]}, {"page": "List of games on I'm Sorry I Haven't a Clue", "response": ["Similar to \"The Singer and the Song\", except that one member of the team sings the song \"straight\", and the other responds to each line. Examples include \"Underneath the Arches\", sung by Flannagan and Alan Whicker (in which Willie Rushton as Whicker is unable to comprehend the existence of a poor person) and \"Puff the Magic Dragon\" by Peter, Paul and Mary Whitehouse (in which Sandi Toksvig as Whitehouse found double entendres in every line). One notable round had Brooke-Taylor singing \"Won't You Come Home Bill Bailey\", with Bill Bailey responding as \"himself\"."]}, {"page": "Long hair", "response": ["Beat poets during the 1950s wore longer hairstyles. By 1960, a small \"beatnik\" community in Newquay, Cornwall, England (including a young Wizz Jones) had attracted the attention of their neighbors for growing their hair to a length past the shoulders, resulting in a television interview with Alan Whicker on BBC television's Tonight series.Whicker, Alan. Tonight: \"Beatniks in Newquay\". BBC, 1960. The 1960s also introduced The Beatles, who started a more widespread longer hair trend. The social revolution of the 1960s led to a renaissance of unchecked hair growth, and long hair, especially on men, was worn as a political or countercultural symbol or protest and as a symbol of masculinity. This cultural symbol extended to several countries in the Americas, Western Europe, South Africa, and Australia. The trend even spread to some Eastern Bloc countries, such as the Mánička subculture of Czechoslovakia, which was met with discrimination by the authorities, who saw it as unwanted Western capitalistic influence. Specific long hairstyles such as dreadlocks have been part of counterculture movements seeking to define other alternative cultures and lifestyles since this time. Longer hair in general remained popular due to the youth rebellion throughout the liberal decade of the 1960s. The long hair trend grew with the spread of the hippie movement in the 1960s and, in the 1970s, longer hair styles would become the norm among men and women."]}, {"page": "Authored documentary", "response": ["In his will, Alan Whicker established cash awards to encourage the making of authored documentaries in the UK."]}, {"page": "Production of the James Bond films", "response": ["The cinema posters for the film stated \"Sean Connery IS James Bond\", to distance the Eon-produced picture from the independent Casino Royale, which had been released two months earlier. However, during the production, Connery announced that it would be his last film as Bond, leaving Broccoli to tell Alan Whicker, \"it won't be the last Bond under any circumstances—with all due respect to Sean, who I think has been certainly the best man to play this part. We will, in our own way, try to continue the Bond series for the audience because it's too important\"."]}, {"page": "Colin Tennant, 3rd Baron Glenconner", "response": ["Glenconner and his involvement in Mustique has been the subject of multiple documentaries. In 1971, he was interviewed by Alan Whicker for an episode of Whicker's World set on the island. In 2000, a documentary by Joseph Bullman was made, titled The Man Who Bought Mustique, that included Glenconner's first visit to Mustique since his exile. According to a reviewer, Tennant's \"occasionally dictatorial manner\" was \"amply displayed\" in the documentary. To describe Tennant, he wrote, \"you had to imagine your most crotchety uncle on his worst day and magnify that tenfold.\""]}]}}