{"wiki_id": "http://www.wikidata.org/entity/Q4706395", "itemLabel": "Alan Collins", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Collins_(sculptor)", "wikipedia_page": {"main": "Alan Collins (15 August 1928 – 18 October 2016) was an English-born sculptor noted for his work at Guildford Cathedral.  After continuing his career in England, Collins moved to the United States and continued working there as an artist and, for more than 20 years, as a professor of art at Seventh-day Adventist universities.Collins work primarily focused on evocative Biblical stories told in outdoor sculptures, which has been described as \"24-hour, 365-days-a-year silent sermons.\"", "link_mentions": [{"page": "1998 in art", "response": ["*Alan Collins – Legacy of Leadership (bronze, Berrien Springs, Michigan)"]}, {"page": "Runnymede", "response": ["Visitors reach the memorial by treading a steep path of irregular granite steps, intended to symbolise a pilgrimage. There are 50 steps in total. Each step is different from all others, with the entire flight made from 60,000 hand-cut granite setts. Landscape architect Geoffrey Jellicoe designed the garden; sculptor Alan Collins designed and carved the stone inscription."]}, {"page": "1928 in art", "response": ["* August 15 – Alan Collins, English figurative religious sculptor (d. 2016)"]}, {"page": "Wimbledon College of Arts", "response": ["* Alan Collins (sculptor)"]}, {"page": "Collins (surname)", "response": ["*Alan Collins (writer) (1928–2008), Australian-Jewish author", "*Alan Collins (sculptor) (1928–2016), English-born sculptor"]}, {"page": "List of Seventh-day Adventists", "response": ["* Alan Collins (1928–2016) – American sculptor and art professor at Atlantic Union College (1968–1971), Andrews University (1971–1978) and La Sierra University (1978–1989)"]}, {"page": "Alan Collins Sculptor", "response": ["#REDIRECT Alan Collins (sculptor)"]}, {"page": "Exterior sculpture of Guildford Cathedral", "response": ["The exterior sculpture of Guildford Cathedral provides many artistic features, including sculptures, engravings and more by some of England’s finest sculptors and craftsmen of the 1950s and 1960s. The people who worked on the cathedral include: Edward Maufe, Alan Collins, Vernon Hill, Eric Gill, John Hutton, Dennis Huntley and others.Cathedral Church of the Holy Spirit, Guildford. British Listed Buildings. Retrieved 19 August 2012.", "At the West Door are three central windows and at the top of these is the carving “The Hand of God” by sculptor Alan Collins. The hand is surmounted by the sun, moon and stars- an invitation from God to be part of the Christian Community.Exterior Guide Guildford Cathedral. Retrieved 16 August 2012", "Image:Guildford-Hand of God.JPG|The carving “The Hand of God” by Alan Collins", "thumb|A work by Alan Collins above the South Garth", "Having passed through the South Garth there are seven figures carved at the base of the windows and these represent the Seven Christian Virtues- “Charity”, “Hope”, “Faith”, “Courage”, “Temperance”, “Prudence”  and “Justice”. The statue of “Prudence” is it seems based on Prudence Maufe, the wife of the architect; even the shoes are in the style of shoes which she wore. “Hope” and “Justice” were the work of the sculptor Richard Browne. “Faith” was the work of John Cobbett and “Charity”, “Courage”, “Temperance” and “Prudence” were the work of Alan Collins. The statue “Faith” was incidentally a gift from the Women’s Royal Army Corps.", "Image:Guildford Temperance by Alan Collins.JPG|The representation of “Temperance” by Alan Collins", "Image:Guildford-Courage by Alan Collins.JPG|The representation of “Courage” by Alan Collins", "Image:Guildford-Prudence by Alan Collins.jpg|The representation of “Prudence” by Alan Collins", "Image:Guildford Charity by Alan Collins.JPG|The representation of “Charity” by Alan Collins", "The statues of St Cecilia and Lady Margaret Beaufort are the work of Dennis Huntley and those of St Martha of Bethany and St Catherine are by Alan Collins.", "Along the north side of the cathedral are another seven figures at the bases of the seven windows these representing the “Seven Gifts of the Spirit”: wisdom, understanding, counsel, fortitude, knowledge, piety and fear of the Lord. Most of the works were made by Alan Collins, but \"Piety\" was made by Dennis Huntley and \"Fear\" by Karin Jonzen.", "File:Guildford-Knowledge by Alan Collins.JPG|The representation of “Knowledge”, by Alan Collins", "File:Guildford-Fortitude by Alan Collins.JPG|The representation of “Fortitude”, by Alan Collins", "File:Guildford-Counsel.jpg|The representation of “Counsel”, by Alan Collins", "File:Guildford-Close-up Understanding.JPG|Close-up of the representation of “Understanding, by Alan Collins", "File:Guildford-Understanding by Alan Collins.JPG|The representation of “Understanding”, by Alan Collins", "File:Guildford-Wisdom Close-up.JPG|Close-up of the representation of “Wisdom”, by Alan Collins", "File:Guildford-Wisdom by Alan Collins.JPG|The representation of “Wisdom”, by Alan Collins", "Above the inside of the archway of the North Garth is a carving of a hand holding a dove representing the Holy Spirit, this by Alan Collins and on the other side is another Collins carving of a chalice filled with Communion wine, this juxtaposed with the carving at the front of the South Garth which represented the Communion bread or wafer. Thus the two “welcoming arms” of the two garths show the two features of the Eucharist; the Communion wine and the Communion bread."]}, {"page": "Alan Collins", "response": ["Alan Collins may refer to:", "* Alan Collins (writer) (1928–2008), Australian-Jewish author", "* Alan Collins (sculptor) (1928–2016), English-born sculptor", "* Luciano Pigozzi (1927-2008), Italian film actor, often credited under the pseudonym Alan Collins", "* Sir Alan Collins (born 1948), British diplomat"]}, {"page": "Legacy of Leadership", "response": ["Legacy of Leadership is an outdoor 1998 sculpture by Alan Collins, installed on the Andrews University campus in Berrien Springs, Michigan, United States. The bronze sculptural group depicts J. N. Andrews and his children Charles and Mary departing from Boston Harbor in 1874 for missionary work overseas. It was unveiled in front of Pioneer Memorial Church in 1998."]}, {"page": "Regeneration (sculpture)", "response": ["Regeneration is an outdoor 1975 concrete sculpture designed by Alan Collins, located on the Andrews University campus in Berrien Springs, Michigan, United States.", "Regernation was designed by Alan Collins in 1971, specifically for the patio of Andrews University's Science Complex. Andrews offers the following description: \"The looping, curving ribbon resembles the joining and division of molecules, the intricately twisted DNA molecule, or the form of a mandorla, a medieval symbol of Jesus Christ. At no point does the ribbon ever touch itself in its course, suggesting the course of life. The four forms extending out to passersby represent the four primitive elements—earth, air, water and fire—in subject (horizontal) forms at Jesus' Second coming.\" The sculpture's unveiling was intended to coincide with the Science Complex's dedication, but was delayed until the fall of 1975. Nearly  of steel rebar, installed by two faculty members and a student work during the summer of 1975, reinforces the ,  concrete piece."]}, {"page": "2016 in the United Kingdom", "response": ["**Alan Collins, 88, sculptor."]}, {"page": "Deaths in October 2016", "response": ["*Alan Collins, 88, English sculptor.Alan Collins, Sculptor of ‘Silent Sermons,’ Dies at 88"]}, {"page": "Elizabeth Muntz", "response": ["Locals from the area around her Dorset home were known to sit for her as models. In the 1960s, Muntz ran a summer school, employing sculptors including Alan Collins."]}]}}