{"wiki_id": "http://www.wikidata.org/entity/Q470890", "itemLabel": "Harold Laski", "itemDescription": "British academic (1893-1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Laski", "wikipedia_page": {"main": "Harold Joseph Laski (30 June 1893 – 24 March 1950) was an English political theorist and economist. He was active in politics and served as the chairman of the British Labour Party from 1945 to 1946 and was a professor at the London School of Economics from 1926 to 1950. He first promoted pluralism by emphasising the importance of local voluntary communities such as trade unions. After 1930, he began to emphasize the need for a workers' revolution, which he hinted might be violent. Laski's position angered Labour leaders who promised a nonviolent democratic transformation. Laski's position on democracy threatening violence came under further attack from Prime Minister Winston Churchill in the 1945 general election, and the Labour Party had to disavow Laski, its own chairman.Laski was one of Britain's most influential intellectual spokesmen for Communism in the interwar years. In particular, his teaching greatly inspired students, some of whom later became leaders of the newly independent nations in Asia and Africa. He was perhaps the most prominent intellectual in the Labour Party, especially for those on the hard left who shared his trust and hope in Joseph Stalin's Soviet Union. However, he was distrusted by the moderate Labour politicians, who were in charge such as Prime Minister Clement Attlee, and he was never given a major government position or a peerage.\nBorn to a Jewish family, Laski was also a supporter of Zionism and supported the creation of a Jewish state.", "link_mentions": [{"page": "George Bernard Shaw", "response": ["The Intelligent Woman's Guide, Shaw's main political treatise of the 1920s, attracted both admiration and criticism. MacDonald considered it the world's most important book since the Bible; Harold Laski thought its arguments outdated and lacking in concern for individual freedoms. Shaw's increasing flirtation with dictatorial methods is evident in many of his subsequent pronouncements. A New York Times report dated 10 December 1933 quoted a recent Fabian Society lecture in which Shaw had praised Hitler, Mussolini and Stalin: \"[T]hey are trying to get something done, [and] are adopting methods by which it is possible to get something done\". As late as the Second World War, in Everybody's Political What's What, Shaw blamed the Allies' \"abuse\" of their 1918 victory for the rise of Hitler, and hoped that, after defeat, the Führer would escape retribution \"to enjoy a comfortable retirement in Ireland or some other neutral country\". These sentiments, according to the Irish philosopher-poet Thomas Duddy, \"rendered much of the Shavian outlook passé and contemptible\"."]}, {"page": "Pierre Trudeau", "response": ["Trudeau's Harvard dissertation was on the topic of communism and Christianity. At Harvard, a predominantly Protestant American university, Trudeau who was French Catholic, and who for the first time was living outside the province of Quebec, felt like an outsider.  As his sense of isolation deepened, in 1947, he decided to continue his work on his Harvard dissertation in Paris, France. He studied at the Institut d'Études Politiques de Paris. The Harvard dissertation remained unfinished when Trudeau briefly entered a doctoral program to study under the socialist economist Harold Laski at the London School of Economics (LSE). This cemented Trudeau's belief that Keynesian economics and social sciences were essential to the creation of the \"good life\" in a democratic society. He did not begin his LSE dissertation. Over a five-week period he attended many lectures and became a follower of personalism after being influenced most notably by Emmanuel Mounier. He also was influenced by Nikolai Berdyaev, particularly his book Slavery and Freedom. Max and Monique Nemni argue that Berdyaev's book influenced Trudeau's rejection of nationalism and separatism."]}, {"page": "The Communist Manifesto", "response": ["On 23 November, just before the Communist League's Second Congress (29 November – 8 December 1847), Engels wrote to Marx, expressing his desire to eschew the catechism format in favour of the manifesto, because he felt it \"must contain some history.\" On the 28th, Marx and Engels met at Ostend in Belgium, and a few days later, gathered at the Soho, London headquarters of the German Workers' Education Association to attend the Congress. Over the next ten days, intense debate raged between League functionaries; Marx eventually dominated the others and, overcoming \"stiff and prolonged opposition\", in Harold Laski's words, secured a majority for his programme. The League thus unanimously adopted a far more combative resolution than that at the First Congress in June. Marx (especially) and Engels were subsequently commissioned to draw up a manifesto for the League."]}, {"page": "1893", "response": ["**Harold Laski, British political theorist, economist (d. 1950)"]}, {"page": "James Callaghan", "response": ["His union position at the IRSF brought Callaghan into contact with Harold Laski, the Chairman of the Labour Party's National Executive Committee and an academic at the London School of Economics. Laski encouraged him to stand for Parliament, although later on he requested Callaghan several times to study and lecture at the LSE."]}, {"page": "Talcott Parsons", "response": ["After Amherst, he studied at the London School of Economics for a year, where he was exposed to the work of Bronisław Malinowski, R. H. Tawney, L. T. Hobhouse, and Harold Laski. During his days at LSE, he made friends with E. E. Evans-Pritchard, Meyer Fortes, and Raymond Firth, who all participated in the Malinowski seminar. Also, he made a close personal friendship with Arthur and Eveline M. Burns."]}, {"page": "John Beaglehole", "response": ["After three years of post-graduate study Beaglehole obtained his PhD with a thesis on British colonial history. At this time he was much influenced by left-wing teachers, especially R. H. Tawney and Harold Laski, and on returning to New Zealand he found it difficult to obtain an academic post owing to his radical views. For a time he had various jobs including a spell as a Workers Educational Association lecturer, and had time to develop other enthusiasms including civil rights issues, writing poetry, and music, an interest inherited from his mother. In 1932 he took a temporary position as a lecturer in history at Auckland University College, but within months the position was abolished in a retrenchment by the college council. Many believed the decision was due more to the college's reaction to Beaglehole's reputation (albeit exaggerated) for radicalism. His academic career finally took off in 1934 after the publication of his first major book, The Exploration of the Pacific, after which he developed his specialist interest in James Cook. He became lecturer, later professor, at the Victoria University College."]}, {"page": "London School of Economics", "response": ["LSE has a long list of notable alumni and staff, spanning the fields of scholarship provided by the school. The school has over 50 fellows of the British Academy on its staff, while other notable former staff members include Brian Barry, Maurice Cranston, Anthony Giddens, Harold Laski, Ralph Miliband, Michael Oakeshott, A. W. Philips, Karl Popper, Lionel Robbins, Susan Strange, Bob Ward and Charles Webster. Mervyn King, the former Governor of the Bank of England, is also a former professor of economics."]}, {"page": "Brandeis University", "response": ["In early June 1947, Einstein made a final break with the foundation. The veterinary school was closed, despite students' protests and demonstrations. According to George Alpert, a lawyer responsible for much of the organizational effort, Einstein had wanted to offer the presidency of the school to left-wing scholar Harold Laski, someone that Alpert had characterized as \"a man utterly alien to American principles of democracy, tarred with the Communist brush.\" He said, \"I can compromise on any subject but one: that one is Americanism.\" Two of the foundation's trustees, S. Ralph Lazrus and Dr. Otto Nathan, quit the foundation at the same time as Einstein. In response, Alpert said that Lazrus and Nathan had tried to give Brandeis University a \"radical, political orientation.\" Alpert also criticized Lazrus' lack of fundraising success and Nathan's failure to organize an educational advisory committee. Einstein said he, Lazrus, and Nathan \"have always been and have always acted in complete harmony.\""]}, {"page": "H. H. Asquith", "response": ["By the summer of 1922 Asquith's interest in politics was at a very low ebb. He was observed to be \"very heavily loaded\" and was helped up the stairs by Lloyd George at a party of Sir Philip Sassoon's on 16 July 1922, whilst his reputation was further damaged by his portrayal in Aldous Huxley's novel Crome Yellow and by the publication of the first volume of Margot's memoirs, which sold well in the UK and the USA, but were thought an undignified way for a former Prime Minister to make money. On 13 September 1922 Sir Donald Maclean told Harold Laski that Asquith was devoted to bridge and small talk and did not do enough real work. Asquith was increasingly attracted by the thought of making money from writing, with Churchill doing very well from his The World Crisis and Lloyd George rumoured to be being paid handsomely for his memoirs (which in the event did not appear until the mid-1930s). Asquith's books The Genesis of the War finally appeared in September 1923 and Studies and Sketches in 1924. His second son Herbert recorded, \"A large part of my father's later years was occupied with authorship and it was during this period that he wrote most of his longer books.\""]}, {"page": "Robert Conquest", "response": ["Conquest argued that the trials and executions of these former Communist leaders were a minor detail of the purges. By his estimates, Stalinist purges had led to the deaths of some 20 million people. He later stated that the  total number of deaths could \"hardly be lower than some thirteen to fifteen million.\"Robert Conquest, Preface, The Great Terror: A Reassessment: 40th Anniversary Edition, Oxford University Press, USA, 2007. p. xviii Conquest accused Western intellectuals such as Beatrice and Sidney Webb, George Bernard Shaw, Jean-Paul Sartre, Walter Duranty, Sir Bernard Pares, Harold Laski, D. N. Pritt, Theodore Dreiser, Bertolt Brecht, Owen Lattimore, and Romain Rolland, as well as American ambassador Joseph Davies, of being dupes of Stalin and apologists for his regime. Conquest cites various comments made by them where, he argues, they were denying, excusing, or justifying various aspects of the purges.Robert Conquest, The Great Terror: A Reassessment, Oxford University Press (1990) , pp. 466–75."]}, {"page": "K. R. Narayanan", "response": ["In 1944, Narayanan was awarded a Tata Scholarship of Rs. 16,000 by J. R. D. Tata to read politics, economics and journalism at the London School of Economics and was awarded Bachelor of Science honors in Economics with specialisation in political science from University of London.Some of his experiences as a Tata fellow are recounted here . . Retrieved 24 February 2006.   At the LSE (1945) he studied political science under Harold Laski;LSE counts K. R. Narayanan among its distinguished alumni ; his portrait  has been unveiled and placed in a position of honour; B. R. Ambedkar is the only other Indian to have been similarly honoured. . Retrieved 24 February 2006. he also attended lectures by Karl Popper, Lionel Robbins, and Friedrich Hayek.  During his years in London, he (along with fellow student K. N. Raj) was active in the India League under V. K. Krishna Menon. He was also the London correspondent of the Social Welfare Weekly published by K. M. Munshi. At the LSE he shared lodgings with K. N. Raj and Veerasamy Ringadoo (who later became the first president of Mauritius); another close friend was Pierre Trudeau (who later became Prime minister of Canada)."]}, {"page": "Newark-on-Trent", "response": ["Newark elections were central to two interesting legal cases. In 1945, a challenge to Harold Laski, the Chairman of the National Executive Committee of the Labour Party, led Laski to sue the Daily Express, which had reported him as saying Labour might take power by violence if defeated at the polls. Laski vehemently denied saying this, but lost the action. In the 1997 general election, Newark returned Fiona Jones of the Labour Party. Jones and her election agent Des Whicher were convicted of submitting a fraudulent declaration of expenses, but the conviction was overturned on appeal."]}, {"page": "The Fountainhead", "response": ["Ellsworth Monkton Toohey is Roark's antagonist. He is Rand's personification of evilthe most active and self-aware villain in any of her novels.Minsaas, Kirsti. \"The Stylization of Mind in Ayn Rand's Fiction\". In  Toohey is a socialist, and represents the spirit of collectivism more generally. He styles himself as representative of the will of the masses, but his actual desire is for power over others. He controls individual victims by destroying their sense of self-worth, and seeks broader power (over \"the world\", as he declares to Keating in a moment of candor) by promoting the ideals of ethical altruism and a rigorous egalitarianism that treats all people and achievements as equally valuable. Rand used her memory of the democratic socialist British Labour Party Chairman Harold Laski to help her imagine what Toohey would do in a given situation. She attended a New York lecture by Laski as part of gathering material for the novel, following which she changed the physical appearance of the character to be similar to that of Laski. New York intellectuals Lewis Mumford and Clifton Fadiman also helped inspire the character."]}, {"page": "Pluralism (political philosophy)", "response": ["Pluralism is connected with the hope that this process of conflict and dialogue will result in a quasi-common good. This common good is not an abstract value or set in stone, however, but an attempt at balancing competing social interests and will thus constantly shift given present social conditions. Proponents in the contemporary political philosophy of such a view include Isaiah Berlin, Stuart Hampshire and Bernard Williams. An earlier version of political pluralism was a strong current in the formation of modern social democracy (to balance socialist and capitalist ideals), with theorists such as the early Harold Laski and G. D. H. Cole, as well as other leading members of the British Fabian Society. In the United States, President Dwight Eisenhower's \"middle way\" was arguably motivated by a belief in political pluralism.", "* early Harold Laski"]}, {"page": "Subhas Chandra Bose", "response": ["His correspondence reveals that despite his clear dislike for British subjugation, he was deeply impressed by their methodical and systematic approach and their steadfastly disciplinarian outlook towards life. In England, he exchanged ideas on the future of India with British Labour Party leaders and political thinkers like Lord Halifax, George Lansbury, Clement Attlee, Arthur Greenwood, Harold Laski, J.B.S. Haldane, Ivor Jennings, G.D.H. Cole, Gilbert Murray and Sir Stafford Cripps."]}, {"page": "Michael Manley", "response": ["Michael Manley was the second son of premier Norman Washington Manley and artist Edna Manley. He attended the Antigua State College and then served in the Royal Canadian Air Force during World War II. In 1945, he enrolled at the London School of Economics. At the LSE, he was influenced by Fabian socialism and the writings of Harold Laski. He graduated in 1949, and returned to Jamaica to serve as an editor and columnist for the newspaper Public Opinion. At about the same time, he became involved in the trade union movement, becoming a negotiator for the National Workers Union. In August 1953, he became a full-time official of that union."]}, {"page": "Leo Strauss", "response": ["Unable to find permanent employment in England, Strauss moved in 1937 to the United States, under the patronage of Harold Laski, who made introductions and helped him obtain a brief lectureship. After a short stint as Research Fellow in the Department of History at Columbia University, Strauss secured a position at The New School, where, between 1938 and 1948, he worked the political science faculty and also took on adjunct jobs. In 1939, he served for a short term as a visiting professor at Hamilton College. He became a U.S. citizen in 1944, and in 1949 he became a professor of political science at the University of Chicago, holding the Robert Maynard Hutchins Distinguished Service Professorship until he left in 1969."]}, {"page": "Politics and the English Language", "response": ["Orwell chooses five passages of text which \"illustrate various of the mental vices from which we now suffer.\" The samples are: by Harold Laski (\"five negatives in 53 words\"), Lancelot Hogben (mixed metaphors), an essay by Paul Goodman on psychology in the July 1945 issue of Politics (\"simply meaningless\"), a communist pamphlet (\"an accumulation of stale phrases\") and a reader's letter in Tribune (in which \"words and meaning have parted company\"). From these, Orwell identifies a \"catalogue of swindles and perversions\" which he classifies as \"dying metaphors\", \"operators or verbal false limbs\", \"pretentious diction\" and \"meaningless words\". (See cliches, prolixity, peacock terms and weasel words.)"]}, {"page": "Sacco and Vanzetti", "response": ["Grant was another establishment figure, a probate court judge from 1893 to 1923 and an Overseer of Harvard University from 1896 to 1921, and the author of a dozen popular novels.New York Times: \"Ex-Judge Grant, Boston Novelist,\" May 20, 1940 , accessed December 20, 2009 Some criticized Grant's appointment to the Committee, with one defense lawyer saying he \"had a black-tie class concept of life around him,\" but Harold Laski in a conversation at the time found him \"moderate.\" Others cited evidence of xenophobia in some of his novels, references to \"riff-raff\" and a variety of racial slurs. His biographer allows that he was \"not a good choice,\" not a legal scholar, and handicapped by age. Stratton, the one member who was not a \"Boston Brahmin,\" maintained the lowest public profile of the three and hardly spoke during its hearings.Bruce Watson, Sacco and Vanzetti: The Men, the Murders, and the Judgment of Mankind (NY: Viking, 2007), 311–3", "A defense attorney later noted ruefully that the release of the Committee's report \"abruptly stilled the burgeoning doubts among the leaders of opinion in New England.\"Ehrmann, 539; Supporters of the convicted men denounced the Committee. Harold Laski told Holmes that the Committee's work showed that Lowell's \"loyalty to his class ... transcended his ideas of logic and justice.\""]}, {"page": "Irving Layton", "response": ["In 1946 Layton received an M.A. in economics and political science from McGill (with a thesis on Harold Laski). Three years later he began teaching English, history, and political science at the Jewish parochial high school Herzliah (a branch of the United Talmud Torahs of Montreal). He was an influential teacher, and some of his students became writers and artists. Among his students was television magnate Moses Znaimer. Layton continued to teach for the greater part of his life: as a teacher of modern English and American poetry at Sir George Williams University (now Concordia University) and as a tenured professor at Toronto's York University from 1969 to 1978. At York one of his first students was Joseph Pivato who became a writer, critic and academic. Layton delivering many lectures and readings throughout Canada. Layton pursued his PhD in 1948, but he abandoned it due to the demands of his already hectic professional life. In 1976, he received an honorary doctorate from Concordia University."]}, {"page": "Sita Ram Goel", "response": ["Sita Ram Goel had developed a strong Marxist leaning during his student days and was on the verge of joining the Communist Party of India in 1948. The Communist Party, however, was banned in Bengal on the day he planned to officially become its member. He read Karl Marx's Communist Manifesto and Das Kapital, Harold Laski's \"Communism\", and \"came to the conclusion that while Marx stood for a harmonised social system, Sri Aurobindo held the key to a harmonised human personality.\" Later, books by Aldous Huxley, Victor Kravchenko, and Suzanne Labin (\"Stalin's Russia\") convinced him to abandon communism.Goel, Sita Ram, \"How I became a Hindu\", Chapter 6 Subsequently, he wrote many books critical of communism in Calcutta, and worked for the anti-communist \"Society for the Defence of Freedom in Asia\" (SDFA).Goel, Sita Ram, \"How I became a Hindu\" , Chapter 7Elst, Koenraad, \"Ram Swarup (1920–98): outline of a biography\"  According to Goel, when he wanted to apply for a passport in 1955, he was told that his case was receiving attention from the Prime Minister himself, and his application was not granted.Sita Ram Goel Genesis and Growth of Nehruism (1993)"]}, {"page": "Michael Oakeshott", "response": ["In 1945 Oakeshott was demobilised and returned to Cambridge. In 1949 he left Cambridge for Nuffield College, Oxford, but after only two years, in 1951, he was appointed Professor of Political Science at the London School of Economics (LSE), succeeding the leftist Harold Laski, an appointment noted by the popular press. Oakeshott was deeply unsympathetic to the student activism at LSE during the late 1960s, and highly critical of (as he saw it) the authorities' insuffiently robust response. He retired from the LSE in 1969, but continued teaching and conducting seminars until 1980."]}, {"page": "Tribune (magazine)", "response": ["The paper's first editor was William Mellor. Among its journalists were Michael Foot and Barbara Betts (later Barbara Castle), while the board included the Labour MPs Aneurin Bevan and Ellen Wilkinson, Harold Laski of the Left Book Club, and the veteran left-wing journalist and former ILP member H. N. Brailsford."]}]}}