{"wiki_id": "http://www.wikidata.org/entity/Q4707213", "itemLabel": "Alan Macfarlane", "itemDescription": "British anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Macfarlane", "wikipedia_page": {"main": "Alan Donald James Macfarlane  (born 20 December 1941 in Shillong, Meghalaya, India) is an anthropologist and historian, and a Professor Emeritus of King's College, Cambridge. He is the author or editor of 20 books and numerous articles on the anthropology and history of England, Nepal, Japan and China. He has focused on comparative study of the origins and nature of the modern world. In recent years he has become increasingly interested in the use of visual material in teaching and research. He is a Fellow of the British Academy and the Royal Historical Society.", "link_mentions": [{"page": "List of anthropologists", "response": ["*Alan Macfarlane"]}, {"page": "Margaret Murray", "response": ["Murray's work was increasingly criticised following her death in 1963, with the definitive academic rejection of the Murrayite witch-cult theory occurring during the 1970s. During these decades, a variety of scholars across Europe and North America – such as Alan Macfarlane, Erik Midelfort, William Monter, Robert Muchembled, Gerhard Schormann, Bente Alver and Bengt Ankarloo – published in-depth studies of the archival records from the witch trials, leaving no doubt that those tried for witchcraft were not practitioners of a surviving pre-Christian religion."]}, {"page": "Witchcraft", "response": ["Hostile churchmen sometimes branded any magic-workers \"witches\" as a way of smearing them. Englishman Reginald Scot, who sought to disprove witchcraft and magic, wrote in The Discoverie of Witchcraft (1584), \"At this day it is indifferent to say in the English tongue, 'she is a witch' or 'she is a wise woman'\". Folk magicians throughout Europe were often viewed ambivalently by communities, and were considered as capable of harming as of healing,Wilby, Emma (2006) Cunning Folk and Familiar Spirits. pp. 51–4. which could lead to their being accused as \"witches\" in the negative sense. Many English \"witches\" convicted of consorting with demons may have been cunning folk whose supposed fairy familiars had been demonised;Emma Wilby 2005 p. 123; See also Alan Macfarlane p. 127 who notes how \"white witches\" could later be accused as \"black witches\".  many French  (\"diviner-healers\") were accused of witchcraft,Monter () Witchcraft in France and Switzerland. Ch. 7: \"White versus Black Witchcraft\". and over half the accused witches in Hungary seem to have been healers.Pócs 1999, p. 12. Hutton (2017), however, says that \"Service magicians were sometimes denounced as witches, but seem to have made up a minority of the accused in any area studied\". Some of those who described themselves as contacting fairies described out-of-body experiences and travelling through the realms of an \"other-world\".Ginzburg (1990) Part 2, Ch. 1.", "Historians Keith Thomas and his student Alan Macfarlane study witchcraft by combining historical research with concepts drawn from anthropology.Keith Thomas, Religion and the Decline of Magic (1971).Jonathan Barry, \"Introduction: Keith Thomas and the problem of witchcraft\" in Jonathan Barry et al. eds., Witchcraft in early modern Europe: Studies in Culture and Belief (1996) pp. 1–46Alan Macfarlane, Witchcraft in Tudor and Stuart England: A Regional and Comparative Study (1970). They argued that English witchcraft, like African witchcraft, was endemic rather than epidemic. Old women were the favorite targets because they were marginal, dependent members of the community and therefore more likely to arouse feelings of both hostility and guilt, and less likely to have defenders of importance inside the community. Witchcraft accusations were the village's reaction to the breakdown of its internal community, coupled with the emergence of a newer set of values that was generating psychic stress.", "* Alan Macfarlane, Witchcraft in Tudor and Stuart England, Psychology Press, 1999 (orig. 1970) "]}, {"page": "Colin Renfrew", "response": ["*Interview with Alan Macfarlane (video)"]}, {"page": "Famine", "response": ["The Great Famine of 1695–1697 may have killed a third of the Finnish population.\"Finland and the Swedish Empire\". Federal Research Division, Library of Congress. and roughly 10% of Norway's population.Karen J. Cullen (2010). Famine in Scotland: The 'Ill Years' of the 1690s. Edinburgh University Press. p. 20.  Death rates rose in Scandinavia between 1740 and 1800 as the result of a series of crop failures.Alan Macfarlane (1997). The savage wars of peace: England, Japan and the Malthusian trap. p. 63.  For instance, the Finnish famine of 1866–1868 killed 15% of the population.", "There were sixteen good harvests and 111 famine years in northern Italy from 1451 to 1767.Alan Macfarlane (1997). The savage wars of peace: England, Japan and the Malthusian trap. p. 64.  According to Stephen L. Dyson and Robert J. Rowland, \"The Jesuits of Cagliari [in Sardinia] recorded years during the late 1500s 'of such hunger and so sterile that the majority of the people could sustain life only with wild ferns and other weeds' ... During the terrible famine of 1680, some 80,000 persons, out of a total population of 250,000, are said to have died, and entire villages were devastated\".", "Famine still occurred in Eastern Europe during the 20th century. Droughts and famines in Imperial Russia are known to have happened every 10 to 13 years, with average droughts happening every 5 to 7 years. Russia experienced eleven major famines between 1845 and 1922, one of the worst being the famine of 1891–92.Alan Macfarlane. \"The Dimension of Famine\" (PDF). The Russian famine of 1921–22 killed an estimated 5 million."]}, {"page": "Dragon School", "response": ["*James Bruce Lockhart, Alan Macfarlane, Dragon Days: The Dragon School, Oxford, 1949–1955 (CreateSpace Independent Publishing, 2013, )"]}, {"page": "1991 in literature", "response": ["*Alan Macfarlane – The Diary of Ralph Josselin, 1616–1683"]}, {"page": "Nuclear family", "response": ["Historians Alan Macfarlane and Peter Laslett, among other European researchers, say that nuclear families have been a primary arrangement in England since the 13th century. The primary arrangement was different from the normal arrangements in Southern Europe, in parts of Asia, and the Middle East where it was common for young adults to remain in or marry into the family home. In England, multi-generational households were uncommon because young adults would save enough money to move out, into their own household once they married. Sociologist Brigitte Berger argued, \"the young nuclear family had to be flexible and mobile as it searched for opportunity and property. Forced to rely on their own ingenuity, its members also needed to plan for the future and develop bourgeois habits of work and saving.\" Berge also mentions that this could be one of the reasons why the Industrial Revolution began in England and other Northwest European countries. However, the historicity of the nuclear family in England has been challenged by Cord Oestmann."]}, {"page": "Owen Lattimore", "response": ["* Owen Lattimore interview by Caroline Humphrey, filmed by Alan Macfarlane (May 21, 1983) via University of Cambridge"]}, {"page": "Quentin Skinner", "response": ["When Skinner was interviewed by Alan Macfarlane, as part of his series of online conversations with academics, Skinner admitted that he had been a member of the Cambridge Apostles, a secret debating society in Cambridge University.  He also revealed that Amartya Sen was a member at the same time. He commented that they had both been \"outed\" in a book published about the Apostles some time before.", "* Interviewed by Alan Macfarlane 10 January 2008 (video)"]}, {"page": "James C. Scott", "response": ["*interviewed by Alan Macfarlane 26th March 2009 followed by his Mellon Lecture given in Cambridge"]}, {"page": "Tim Hunt", "response": ["*In July 2015, the historian/anthropologist Alan Macfarlane conducted two in-depth interviews with Tim Hunt:"]}, {"page": "Sedbergh School", "response": ["*Alan Macfarlane, Professor Emeritus of Anthropology, King's College, Cambridge"]}, {"page": "Moorestown Friends School", "response": ["* James C. Scott (born 1936), Sterling Professor at Yale University.Scott, James C. (26 March 2009). James Scott interviewed by Alan Macfarlane (VIDEO) 1. Interview with Alan Macfarlane. Cambridge, England. Accessed November 26, 2014."]}, {"page": "List of people associated with the London School of Economics", "response": ["* Alan Macfarlane, social anthropologist and historian"]}, {"page": "Simon Schaffer", "response": ["* Interviewed by Alan Macfarlane 27 June, continued 1 and 2 July 2008 (video)"]}, {"page": "Ad Council Japan", "response": ["During the TV coverage of the 2011 Tōhoku earthquake and tsunami events, the vast majority of advertisers withdrew their advertising, resulting in a massive increase in filler advertisements by AC Japan, many of which promoted traditional Japanese virtues, such as mutual help (giri, on,Ruth Benedict described \"on\" 'obligations passively incurred'. The Chrysanthemum and the Sword, 1946,page116 amaeAlan Macfarlane, Japan Through the Looking Glass, 2007Takeo Doi, The anatomy of dependence, 1971, page34) and the importance of greetings. This later became a popular meme in Japan.acジャパン, Nico Nico Douga"]}, {"page": "Emmanuel Todd", "response": ["* Lineages of Modernity: A History of Humanity from the Stone Age to Homo Americanus, 2019, Polity Press, commentary from renowned anthropologist and historian Alan Macfarlane: \"Emmanuel Todd is an internationally known scholar whose work on the development and influence of family systems around the world has challenged many preconceptions. This is a bold, iconoclastic, wide-ranging study, marshalling a great deal of material from history, anthropology, demography and other disciplines. It is written from an unusual angle and rightly challenges the primacy of economic forces, emphasizing instead the role of family systems, ideology, education and culture in the shaping of human history. There is much to learn from this work.\" and Michael Lind: \"\"To the study of the United States, the Soviet Union and France, Emmanuel Todd has brought a unique combination of empirical rigor and humanist insight. Now, in Lineages of Modernity, this great thinker has found his greatest subject.\" (Où en sommes-nous ? Une esquisse de l'histoire humaine, 2017)"]}, {"page": "Denis Boyles", "response": ["Denis Boyles is a journalist, editor, university lecturer and the author/editor of several books of poetry, travel/history, criticism, humor, practical advice and essays, including Design Poetics (1975), The Modern Man's Guide to Life (1986), African Lives (1989), Man Eaters Motel (1991), A Man's Life: The Complete Instructions (1996), The Pocket Professor series (2001) and Vile France (2005), a satirical examination of French elites. His work, as editor or writer, has appeared in many American and European magazines and newspapers; for several years he wrote commentary on the European press in a column for National Review Online, and was an occasional guest on radio and television programs. In 2008, he wrote Superior, Nebraska, a book about Midwestern political and social values (Doubleday) and in 2009, he co-wrote a documentary film, Femmes de Soldats, with French journalist Alain Hertoghe for Kuiv Productions Paris.  Boyles recently completed a history of the creation and compilation of the Encyclopædia Britannica's 11th edition (1910) for Knopf. He resides in France, where he taught at The Brouzils Seminars, a graduate and undergraduate writing and creative arts program. In 2009, with philosopher Anthony O'Hear, he launched The Fortnightly Review's \"New Series\", of which he is currently co-editor (with Prof. Alan Macfarlane), and from 2012-2015, he was a Visiting Fellow in the School of Humanities at the University of Buckingham. In 2015, he joined the faculties of the Chavagnes Studium, where he teaches literature courses, and l’Institut Catholique d’Études Supérieures in La Roche sur Yon (I.C.E.S.), where he teaches graduate courses in journalism. His MA was awarded by the graduate  Writing Seminars at the Johns Hopkins University; his doctorate is from the Communications and Media Research Institute (CAMRI) at the University of Westminster (London)."]}, {"page": "Ralph Josselin", "response": ["Alan Macfarlane began collecting information relating to Earls Colne and the diary, while working on his doctorate at the Essex Record Office in the 1960s. From it he and Sarah Harrison attempted to \"reconstruct\" a historical community./earlscolne/ Earls Colne Project In 1970, Macfarlane also published an anthropological study of Josselin's family life."]}, {"page": "Digital Himalaya", "response": ["The Digital Himalaya project was established in December 2000 by Mark Turin, Alan Macfarlane, Sara Shneiderman, and Sarah Harrison. The project's principal goal is to collect and preserve historical multimedia materials relating to the Himalaya, such as photographs, recordings, and journals, and make those resources available over the internet and offline, on external storage media. The project team have digitized older ethnographic collections and data sets that were deteriorating in their analogue formats, so as to protect them from deterioration and make them available and accessible to originating communities in the Himalayan region and a global community of scholars.", "* Alan Macfarlane", "The Naga Videodisc is a multimedia resource created by Alan Macfarlane at Cambridge University in the late 1980s. It includes a large amount of ethnographic material about Naga communities. With the support of Sarrah Harrison, the contents of the videodisc were converted into an online database that uses Bamboo as a retrieval system, with easily searchable XML files. Some film clips can be downloaded directly from the Digital Himalaya page, but the full collection can be seen on the Shanti Database at the University of Virginia.", "This is a multimedia archive with photographs, films, census data, and economic and social data of the Gurung village of Thak in central western Nepal. These ethnographic records cover more than 30 years of work, and were collected by Alan Macfarlane and Sarah Harrison. The archive is regularly updated."]}, {"page": "Prof Alan Macfarlane", "response": ["#REDIRECT Alan Macfarlane"]}, {"page": "Professor Alan Macfarlane", "response": ["#REDIRECT Alan Macfarlane"]}, {"page": "Dr Alan Macfarlane", "response": ["#REDIRECT Alan Macfarlane"]}, {"page": "Earls Colne", "response": ["Earls Colne is one of the best recorded villages in the UK and has been the subject of a study undertaken between 1972 and 2002 by Professor Alan Macfarlane and his team from the Department of Social Anthropology at the University of Cambridge.", "* Website of Professor Alan Macfarlane"]}, {"page": "Category talk:Academics of the University of Cambridge", "response": ["Alan Macfarlanenot yet classified"]}, {"page": "Family", "response": ["According to the work of scholars Max Weber, Alan Macfarlane, Steven Ozment, Jack Goody and Peter Laslett, the huge transformation that led to modern marriage in Western democracies was \"fueled by the religio-cultural value system provided by elements of Judaism, early Christianity, Roman Catholic canon law and the Protestant Reformation\"."]}, {"page": "The Fortnightly Review", "response": ["In 2009 a group of British and American scholars and writers, including philosopher Anthony O'Hear, OBE, director of the Royal Institute of Philosophy, began publication of a \"new series\" online at fortnightlyreview.co.uk,The Fortnightly Review with the aim of extending Lewes's original editorial ambitions to modern politics, literature, philosophy, science, and art. New articles are sometimes juxtaposed with significant archival material and scholars are given assistance in research that involves the Fortnightly Review.  In partnership with the University of Kansas, where Harris once attended, the Fortnightly publishes the winning essay of the Trollope Prize and a series of books and monographs under its \"Odd Volumes\" imprint. The current editors are Prof. Alan Macfarlane, FBA (King's College, Cambridge), and Denis Boyles, PhD (CAMRI, University of Westminster)."]}, {"page": "Role of Christianity in civilization", "response": ["Christian culture puts notable emphasis on the family, and according to the work of scholars Max Weber, Alan Macfarlane, Steven Ozment, Jack Goody and Peter Laslett, the huge transformation that led to modern marriage in Western democracies was \"fueled by the religio-cultural value system provided by elements of Judaism, early Christianity, Roman Catholic canon law and the Protestant Reformation\". Historically, extended families were the basic family unit in the Catholic culture and countries. According to a study by the scholar Joseph Henrich from Harvard University, the Catholic church \"changed extended family ties, as well as values and psychology of individuals in the Western world\".The Church, intensive kinship, and global psychological variationTargeting incest and promoting individualism"]}, {"page": "Alan Donald James Macfarlane", "response": ["#REDIRECT Alan Macfarlane"]}, {"page": "Lucy Mair", "response": ["Mair read Classics at Newnham College, Cambridge, graduating with a BA in 1923.Lucy Mair, obituary in Anthropology Today Volume 2, No. 4, August 1986 In 1927 she joined the LSE, studying social anthropology under Bronisław Malinowski, and commenced ethnographic fieldwork in Uganda in 1931.Mair, Lucy Philip, in Marilyn Ogilvie and Joy Harvey (eds.) The Biographical Dictionary of Women in Science, Taylor and Francis (2000), p.832 At Malinowski's directionVideo interview with Lucy Mair hosted by Alan Macfarlane. she spent her time in Uganda studying social change, returning to the UK in 1932 to submit her dissertation and receive her PhD. She began lecturing at LSE the same year, but joined the Royal Institute for International Affairs with the outbreak of World War II. In 1943 she moved to the Ministry of Information, then at the war's end took a job training Australian administrators for work in Papua New Guinea.", "* Interviewed by Jean La Fontaine and Alan Macfarlane, 30 July 1983 (video)"]}, {"page": "Witch-cult hypothesis", "response": ["Murray's work came to be increasingly criticised following her death in 1963, with the definitive academic rejection of the Murrayite witch-cult theory occurring during the 1970s. At this time, a variety of scholars across Europe and North America began to publish in-depth studies of the archival records from the witch trials, leaving no doubt that those tried for witchcraft were not practitioners of a surviving pre-Christian religion. Such critics of Murray included Alan Macfarlane, Erik Midelfort, William Monter, Robert Muchembled, Gerhard Schormann, Bente Alver and Bengt Ankarloo."]}]}}