{"wiki_id": "http://www.wikidata.org/entity/Q4707775", "itemLabel": "Alan Sked", "itemDescription": "British historian and politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Sked", "wikipedia_page": {"main": "Alan Sked  (born 22 August 1947) is a Scottish eurosceptic academic notable for having founded the Anti-Federalist League (in order to oppose the Maastricht Treaty) and its successor the UK Independence Party (UKIP). He is Professor Emeritus of International History at the London School of Economics and has stood as a candidate in several parliamentary elections.", "link_mentions": [{"page": "Enoch Powell", "response": ["In 1993, the twenty-fifth anniversary of Powell's \"Rivers of Blood\" speech, Powell wrote an article for The Times, in which he claimed the concentration of immigrant communities in inner cities would lead to \"communalism\", which would have grave effects on the electoral system: \"communalism and democracy, as the experience of India demonstrates, are incompatible\". In May, he spoke for Alan Sked of the Anti-Federalist League (the forerunner of the United Kingdom Independence Party) who was standing at the Newbury by-election. Sked went on to lose his deposit at the by-election, polling only 601 votes (1.0 per cent). At Michael Portillo's 40th birthday party the same month, Thatcher greeted him enthusiastically and asked him: \"Enoch, I haven't seen you since your eightieth-birthday dinner. How are you?\" Powell replied, \"I'm eighty-one\". Powell's opinion of Thatcher had declined after she endorsed John Major at the 1992 general election, which he believed to be a repudiation of her fight against European integration after the Bruges speech."]}, {"page": "University of Glasgow", "response": ["In more recent times, the university was the focus of the \"Glasgow Group\" of poets and literary critics, including Philip Hobsbaum, Tom Leonard and Alasdair Gray. The university boasts one of Europe's largest collections of life scientists, as well as having been the training ground of numerous politicians including former Prime Ministers Bonar Law and Sir Henry Campbell-Bannerman, former First Minister Donald Dewar, former leader of the Liberal Democrats and former Rector Charles Kennedy, Defence Secretaries Liam Fox and Des Browne, the founder of the UK Independence Party Alan Sked, former Labour Party leader John Smith, Business Secretary Vince Cable, former leader of the Liberal Democrats Sir Menzies Campbell, and current First Minister Nicola Sturgeon. Other notable alumni include banker Fred Goodwin, actor Gerard Butler, Rangers and Scottish footballer Neil Murray, actor, writer, television and radio broadcaster Colin Lamont (aka Scottie McClue), novelist Robin Jenkins, founder of the world's largest non-governmental development organisation BRAC Fazle Hasan Abed, television writers Armando Iannucci and Steven Moffat, comedian Greg Hemphill, television presenter Neil Oliver, journalists Andrew Neil and Raman Bhardwaj, and musicians Emeli Sandé and Simon Neil."]}, {"page": "James Callaghan", "response": ["Historians Alan Sked and Chris Cook have summarised the general consensus of historians regarding Labour in power in the 1970s:"]}, {"page": "A. J. P. Taylor", "response": ["Taylor was badly injured in 1984 when he was run over by a car while crossing Old Compton Street in London. The effect of the accident led to his retirement in 1985. In his last years, he endured Parkinson's disease, which left him incapable of writing. His last public appearance was at his 80th birthday, in 1986, when a group of his former students, including Sir Martin Gilbert, Alan Sked, Norman Davies and Paul Kennedy, organised a public reception in his honour. He had, with considerable difficulty, memorised a short speech, which he delivered in a manner that managed to hide the fact that his memory and mind had been permanently damaged by Parkinson's disease."]}, {"page": "Klemens von Metternich", "response": ["Critical views presuppose Metternich had the ability to shape Europe favorably but chose not to. More modern critiques like that of A. J. P. Taylor have questioned how much influence Metternich actually wielded. Robin Okey, a critic of Metternich, noted that even in the realm of foreign affairs Metternich \"had only his own persuasiveness to rely on\", and this degraded over time. By this interpretation, his task was to create a \"smokescreen\" that hid Austria's true weakness. When it came to choosing a set of sound principles, wrote Taylor, \"most men could do better while shaving.\" The result was that Metternich was no captivating diplomat: Taylor described him as \"the most boring man in European history\". Not only were his failures limited to foreign affairs, critics argue: at home he was equally powerless, failing to effect even his own proposals for administrative reform. In contrast, those who have attempted to rehabilitate Metternich describe him as \"unquestionably [a] master of diplomacy\", someone who perfected and indeed shaped the nature of diplomacy in his era. In a similar vein, Alan Sked argues that Metternich's \"smokescreen\" may well have served a purpose in furthering a relatively coherent set of principles."]}, {"page": "Diplomatic history", "response": ["Sir Winston Churchill's multi-volume The Second World War, especially the first volume The Gathering Storm (1948) set the framework and the interpretation for much later historiography.  His interpretation, echoing his own position before the war, that World War II was caused by the mad ambitions of Adolf Hitler; Churchill damned the cowardly and weak-willed British and French leaders who used appeasement in a futile effort to avoid the war. Churchill did not consider the argument that the alternative to appeasement was a premature war that Germany would win in 1938. The British historian A. J. P. Taylor's 1961 book The Origins of the Second World War challenged Churchill's viewpoint and argued that Hitler had no master-plan for conquering the world. Instead he was an ordinary statesman –-an opportunistic leader seizing whatever chances he had for expansionism. The fact that a world war started over Poland in 1939 was due to diplomatic miscalculation by all the countries concerned, instead of being a case of German aggression.  British historians such as D.C. Watt, Paul Kennedy, George Peden and David Dilks argued that appeasement was not an aberration, and that it was an old British tradition which in this case flowed from numerous structural, economic and military factors. Historians such as Christopher Thorne and Harry Hinsley abandoned the previous focus on individual leaders to discuss the broader societal influences such as public opinion and narrower ones like intelligence on diplomatic relations. In recent years the debates regarding the 1930s have continued, but new approaches are in use, such as an analysis in terms of Britain's national identity.Patrick Finney, \"The romance of decline: The historiography of appeasement and British national identity.\" Electronic Journal of International History 1 (2000) Online.Donald C. Watt, \"The historiography of appeasement.\" in Alan Sked and Chris Cook, eds. Crisis and controversy: Essays in honour of AJP Taylor (1976) pp 100+."]}, {"page": "UK Independence Party", "response": ["UKIP originated as the Anti-Federalist League, a single-issue Eurosceptic party established in London by Alan Sked in 1991. It was renamed UKIP in 1993, but its growth remained slow. It was largely eclipsed by the Eurosceptic Referendum Party until the latter's 1997 dissolution. In 1997, Sked was ousted by a faction led by Nigel Farage, who became the party's preeminent figure. In 2006, Farage officially became leader and, under his direction, the party adopted a wider policy platform and capitalised on concerns about rising immigration, in particular among the White British working class. This resulted in significant breakthroughs at the 2013 local elections, 2014 European Parliamentary elections, and 2015 general election. Farage then stepped down as UKIP leader, later joining the Brexit Party. UKIP subsequently saw its vote share and membership heavily decline, losing almost all of its elected representatives amid much internal instability and a drift toward a far-right, anti-Islam message.", "UKIP began as the Anti-Federalist League, a Eurosceptic political party established in 1991 by the historian Alan Sked. The League opposed the recently signed Maastricht Treaty and sought to sway the governing Conservative Party towards removing the United Kingdom from the European Union (EU). A former Liberal Party candidate, member of the Bruges Group, and professor at the London School of Economics (LSE), Sked had converted to Euroscepticism while teaching the LSE's European Studies programme. Under the Anti-Federalist League's banner, Sked was a candidate for Member of Parliament (MP) for Bath at the 1992 general election, gaining 0.2% of the vote. At a League meeting held in the LSE on 3 September 1993, the group was renamed the UK Independence Party, deliberately avoiding the term \"British\" so as to avoid confusion with the far-right British National Party (BNP).", "| Alan Sked || 3 September 1993 || July 1997 || Party founder; left party in 1997", "| Alan Sked"]}, {"page": "List of political parties in the United Kingdom", "response": ["| Alan Sked", "| Alan Sked"]}, {"page": "Joseph Radetzky von Radetz", "response": ["In 1798, he married Countess Francesca von Strassoldo Grafenberg from Tržič, Carniola (now in Slovenia). She was a descendant of the Austrian princely family of Auersperg, which was one of the hereditary Habsburg duchies in what is now Slovenia. They had five sons and three daughters, only two of whom outlived their father. Radetzky also had a longstanding romantic relationship with his Italian mistress, Giuditta Meregalli of Sesto San Giovanni. She was 40 years his junior and bore him four children, all of whom took his name and were recognized by Radetzky. Meregalli received extensive letters from him, written during his battles.Richard Bassett, For God and Kaiser. The Imperial Austrian Army, Yale University Press, 2015, 299-302 He was a devout lifelong Roman Catholic.Alan Sked (2011), Radetzky: Imperial Víctor and Military Genius, p. 202. I.B. Tauris. New York City, United States.", "* Alan Sked: The survival of the Habsburg Empire: Radetzky, the Imperial Army, and the Class War, 1848. London; New York: Longman, 1979, ", "* Alan Sked: Radetzky: Imperial Victor and Military Genius. London; New York: I.B. Tauris, 2011, "]}, {"page": "Nikolai Tolstoy", "response": ["Tolstoy has stood unsuccessfully for the Eurosceptic and populist United Kingdom Independence Party (UKIP) as a parliamentary candidate in four British general elections, having first been asked by UKIP founder Alan Sked in November 1996.\"Wielding a sabre for the freedom of England.\" The Times, London, 15 November 1996: pg 18. Tolstoy was subsequently UKIP's candidate for the Barnsley East by-election in 1996; where he received 2.1% of the vote, and for Wantage in the 1997 (0.8%), 2001 (1.9%) and 2005 general elections (1.5%). Tolstoy stood for UKIP in Witney at the 2010 general election - against David Cameron - and received 3.5% of the vote."]}, {"page": "Anti-Federalist League", "response": ["The main founder of the Anti-Federalist League was Alan Sked, lecturer at the London School of Economics, leading figure in the Bruges Group and former official of the Liberal Party. The Maastricht Treaty, which greatly increased the powers of the European Commission, was widely unpopular according to opinion polls, but all three of the main parties had pledged to support its ratification in the House of Commons. Sked and others felt that this denied voters a say on a crucial constitutional issue. Running AFL candidates was supposed to make good this shortfall in the democratic process. Another founder was Helen Szamuely. Members of the League included future UKIP leaders Nigel Farage and Gerard Batten.", "The League stood seventeen candidates in the 1992 general election, but failed to make any impact or attract any press attention.  It lost all its deposits.  The following year, Alan Sked represented it in by-elections in Newbury (gaining 1% of the vote) and Christchurch (1.6%)."]}, {"page": "British-American Project", "response": ["* Alan Sked, founder of the United Kingdom Independence Party (UKIP)"]}, {"page": "Dr Alan Sked", "response": ["#REDIRECT Alan Sked"]}, {"page": "Philipp, Prince of Eulenburg", "response": ["Wilhelm often called Eulenburg \"my bosom friend, the only one I have\".Mondimore, Francis Mark A Natural History of Homosexuality Baltimore: JHU Press, 2010 page 207. There is no evidence that Wilhelm and Eulenburg were anything other than best friends. Since Eulenburg was quite open about being gay in the company of his closest friends, and he had been Wilhelm's best friend for twenty-two years, Röhl argued that it is extremely unlikely that Wilhelm knew nothing of Eulenburg's homosexuality as he later claimed.Röhl, John The Kaiser and His Court Cambridge: Cambridge, 1994 pages 61-62. In 2005, Röhl wrote \"This view of Wilhelm II as a repressed homosexual is gathering growing support as the Eulenburg correspondence and similar new evidence is studied and digested.\"Röhl, John & Sombart, Nicolaus  Kaiser Wilhelm II New Interpretations: The Corfu Papers, Cambridge: Cambridge University Press, 2005 page 48. The American historian Isabel V. Hull wrote: \"Wilhelm never resolved his feelings for Eulenburg, never understood them, and certainly never labelled them...He seems to have remained unconscious of the homoerotic basis of his closest friendship, and, by extension of the homosexual aspects of his own character.\" After coming to the throne, Wilhelm largely avoided female company and had a marked preference for surrounding himself with handsome young soldiers, which led the British historian Alan Sked to conclude that Wilhelm had at very least homosexual tendencies. In a letter written in slightly broken English (despite having a British mother, the Kaiser never quite entirely mastered English), Wilhelm told Eulenburg how he detested women, and that: \"I never feel happy, really happy in Berlin...Only Potsdam is 'my el dorado'...where one feels free with the beautiful nature around you and soldiers as much you like, for I love my dear Regiment very much, those such nice young men in it\".Röhl, John The Kaiser and His Court Cambridge: Cambridge, 1994 page 19. Wilhelm went on to tell Eulenburg that he preferred the company of soldiers to his family for only in the all-male world of the Potsdam garrison could he really be himself. Eulenburg himself speculated on these lines, writing in an essay for the benefit of the \"Liebenberg Round Table\" as his social circle came to be known that a disproportionate number of the men of the House of Hohenzollern over the centuries had been gay, and there was something within Wilhelm's blood that made him inclined to same-sex relationships."]}, {"page": "List of people associated with the London School of Economics", "response": ["* Alan Sked, leading Habsburg historian and founder of the United Kingdom Independence Party"]}, {"page": "Euroscepticism in the United Kingdom", "response": ["The financier Sir James Goldsmith formed the Referendum Party as a single-issue party to fight the 1997 General Election, calling for a referendum on aspects of the UK's relationship with the European Union. It planned to contest every constituency where there was no leading candidate in favour of such a referendum, and briefly held a seat in the House of Commons after George Gardiner, the Conservative MP for Reigate, changed parties in March 1997 following a battle against deselection by his local party. The party polled 800,000 votes and finished fourth, but did not win a seat in the House of Commons.  The United Kingdom Independence Party (UKIP),  advocating the UK's complete withdrawal from the European Union, had been founded in 1993 by Alan Sked, but initially had only very limited success. Due to a change in the election principle, the 1999 European Parliament election allowed for the first UKIP parliamentary representation. Many commentators believe over-interest in the issue to be an important reason why the Conservative Party lost the General Election of 2001. They argue that the British electorate was more influenced by domestic issues than by European affairs."]}, {"page": "1991 in the United Kingdom", "response": ["** Alan Sked forms the Anti-Federalist League, a political party aiming to field election candidates opposed to the Maastricht Treaty."]}]}}