{"wiki_id": "http://www.wikidata.org/entity/Q470823", "itemLabel": "Stephen Wiltshire", "itemDescription": "Architectural artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Wiltshire", "wikipedia_page": {"main": "Stephen Wiltshire  (born 24 April 1974) is a British architectural artist and autistic savant. He is known for his ability to draw a landscape from memory after seeing it just once. His work has gained worldwide popularity.\nIn 2006, Wiltshire was made a Member of the Order of the British Empire (MBE) for services to art. In the same year, he opened a permanent gallery on the Royal Opera Arcade in London.", "link_mentions": [{"page": "April 24", "response": ["*  1974   – Stephen Wiltshire, English illustrator "]}, {"page": "Empire State Building", "response": ["The 86th floor observatory contains both an enclosed viewing gallery and an open-air outdoor viewing area, allowing for it to remain open 365 days a year regardless of the weather. The 102nd floor observatory is completely enclosed and much smaller in size. The 102nd floor observatory was closed to the public from the late 1990s to 2005 due to limited viewing capacity and long lines. The observation decks were redesigned in mid-1979. The 102nd floor was again redesigned in a project that was completed in 2019, allowing the windows to be extended from floor to ceiling and widening the space in the observatory overall. An observatory on the 80th floor, opened in 2019, includes various exhibits as well as a mural of the skyline drawn by British artist Stephen Wiltshire."]}, {"page": "1974", "response": ["** Stephen Wiltshire, British architectural artist and autistic savant"]}, {"page": "Richard Wawro", "response": ["*Stephen Wiltshire"]}, {"page": "Savant syndrome", "response": ["* Stephen Wiltshire, British architectural artist"]}, {"page": "Cityscape", "response": ["*Stephen Wiltshire"]}, {"page": "Autism rights movement", "response": ["An autistic savant is an autistic person with extreme talent in one or more areas of study. Although there is a common association between savant syndrome and autism (an association made popular by the 1988 film Rain Man), most autistic people are not savants and savantism is not unique to autistic people, though there does seem to be some relation. 1 in 10 autistic people may have notable abilities, but prodigious savants like Stephen Wiltshire are very rare; only about 100 such people have been described/identified in the century since savants were first identified, and there are only about 25 living identified prodigious savants worldwide. A lay summary is available: "]}, {"page": "List of British artists", "response": ["* Stephen Wiltshire (born 1974) – savant artist"]}, {"page": "Daniel Tammet", "response": ["*Stephen Wiltshire"]}, {"page": "Floating city", "response": ["* Floating Cities, a 1991 book by Stephen Wiltshire"]}, {"page": "Steven Wiltshire", "response": ["#REDIRECT Stephen Wiltshire"]}, {"page": "2006 New Year Honours", "response": ["* Stephen Wiltshire, Artist. For services to Art."]}, {"page": "An Anthropologist on Mars", "response": ["*\"Prodigies\" describes Sacks' relationship with Stephen Wiltshire, a young autistic savant described by Hugh Casson as \"possibly the best child artist in Britain\"."]}, {"page": "Human camera", "response": ["#REDIRECT Stephen Wiltshire"]}, {"page": "Autistic art", "response": ["thumb|Stephen Wiltshire working in 2016", "* Stephen Wiltshire (b. 1974) – typically depicts cityscapes in his work. He is one of the most famous autistic artists and his art usually surrounds architectural features."]}, {"page": "Societal and cultural aspects of autism", "response": ["An autistic savant is an autistic person with extreme talent in one or more areas of study. Although there is a common association between savant syndrome and autism (an association made popular by the 1988 film Rain Man), most autistic people are not savants and savantism is not unique to autistic people, though there does seem to be some relation. One in ten autistic people may have notable abilities, but prodigious savants like Stephen Wiltshire are very rare; only about 100 such people have been described/identified in the century since savants were first identified, and there are only about 25 living identified prodigious savants worldwide."]}, {"page": "Q.E.D. (British TV series)", "response": ["* The Foolish Wise Ones (1987) – a look at the talents and worlds of Autistic Savants, such as Stephen Wiltshire."]}, {"page": "Eidetic memory", "response": ["ISSN 0262-4079  Others have not been thoroughly tested, though savant Stephen WiltshireDaniel A. Weiskopf (2017) An ideal disorder? Autism as a psychiatric kind, Philosophical Explorations, 20:2, 175-190, Rebecca Chamberlain, I. C. McManus, Howard Riley, Qona Rankin & Nicola Brunswick (2013) Local processing enhancements associated with superior observational drawing are due to enhanced perceptual functioning, not weak central coherence, The Quarterly Journal of Experimental Psychology, 66:7, 1448-1466, Gillian J. Furniss (2008) Celebrating the Artmaking of Children with Autism, Art Education, 61:5, 8-12,  can look at a subject once and then produce, often before an audience, an accurate and detailed drawing of it, and has drawn entire cities from memory, based on single, brief helicopter rides; his six-metre drawing of 305 square miles of New York City is based on a single twenty-minute helicopter ride. Another less thoroughly investigated instance is the art of Winnie Bamara, an Australian indigenous artist of the 1950s.K. V. Parish, 'The remarkable art of Winnie Bamara', The Sunday Mail, February 14, 1959, p.7"]}, {"page": "City and Guilds of London Art School", "response": ["* Stephen Wiltshire M.B.E.Biography of Stephen Wiltshire in The Independent (artist, 1990s)"]}, {"page": "List of people claimed to possess an eidetic memory", "response": ["*Stephen Wiltshire is a prodigious savant, capable of drawing the entire skyline of a city after a helicopter ride.David Martin. Savants: Charting \"islands of genius\", CNN broadcast September 14, 2006"]}]}}