{"wiki_id": "http://www.wikidata.org/entity/Q4700409", "itemLabel": "Akbar Ansari", "itemDescription": "cricketer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Akbar_Ansari", "wikipedia_page": {"main": "Akbar Shahzaman Ansari (Urdu: اکبر انصاری; born 3 July 1988) is a Pakistani British First-class and List A cricketer who played his First-class games for  Cambridge University Cricket Club and Cambridge University Centre of Cricketing Excellence, and List A cricket for Marylebone Cricket Club.  He captained Cambridge UCCE in 2009, and Cambridge University in 2009 and 2010.  His highest score of 193 came when playing for Cambridge University in the match against Oxford University Cricket Club.    His best bowling of 4/50 came in the same match.\nHis only List A appearance against Bangladesh A he scored 0 and did not take a wicket. He has a younger brother, Zafar Ansari.\nHe also played 3 Second Eleven Championship games for Surrey's Second XI. and 2 games for them in the Second Eleven Trophy.He was educated at Hampton School and Trinity Hall, Cambridge.", "link_mentions": [{"page": "Khizar Humayun Ansari", "response": ["Ansari was born in Sukkur, Sindh and migrated to the United Kingdom. He is married to professor and South Asian historian Sarah Ansari, and has two sons, test cricketer, Zafar Ansari and first class cricketer Akbar Ansari. Ansari is of Pakistani descent."]}, {"page": "List of British Pakistanis", "response": ["* Akbar Ansari – English first class and List A cricketer who played his first class games for Cambridge University Cricket Club and Cambridge University Centre of Cricketing Excellence and List A cricket for Marylebone Cricket Club"]}, {"page": "Momin Ansari", "response": ["*Akbar Ansari (born 1988), English cricketer of Pakistani descent "]}, {"page": "List of British Muslims", "response": ["* Akbar Ansari  English first-class and List A cricketer who played his First-class games for Cambridge University Cricket Club and Cambridge University Centre of Cricketing Excellence, and List A cricket for Marylebone Cricket Club"]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["*  Akbar Ansari (2008) : Akbar Ansari (Cambridge University)"]}, {"page": "Ansari (surname)", "response": ["*Akbar Ansari (born 1988), English cricketer of Pakistani descent "]}]}}