{"wiki_id": "http://www.wikidata.org/entity/Q4707209", "itemLabel": "Alan MacNaughtan", "itemDescription": "British actor (1920-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_MacNaughtan", "wikipedia_page": {"main": "Alan MacNaughtan (4 March 1920 – 29 August 2002) was a Scottish actor, born in Bearsden, Dunbartonshire, Scotland, UK. He was educated at the Glasgow Academy, trained at RADA, and graduated in 1940 with the Bancroft Gold Medal. An experienced Old Vic, West End and Broadway actor, he became active in television and certain films between 1954 and 1999.", "link_mentions": [{"page": "March 4", "response": ["*  1920   – Alan MacNaughtan, Scottish-English actor (d. 2002)"]}, {"page": "Jean Anouilh", "response": ["* Dinner with the Family (Le Rendez-vous de Senlis). New Theatre, London: 10 December 1957. Directed by Frank Hauser. With John Justin, Jill Bennett, Alan MacNaughtan, Lally Bowers, Ian Hendry.", "* The Fighting Cock (L'Hurluberlu ou le Réactionnaire amoureux). ANTA Playhouse, New York City: 8 December 1959. Directed by Peter Brook. With Rex Harrison, Roddy McDowall, Natasha Parry, Michael Gough, Alan MacNaughtan, Arthur Treacher."]}, {"page": "Victim (1961 film)", "response": ["* Alan MacNaughtan as Scott Hankin"]}, {"page": "The Sandbaggers", "response": ["Sir Geoffrey Wellingham (Alan MacNaughtan)"]}, {"page": "Bearsden", "response": ["*Alan MacNaughtan, actor (b. 1920, d.2002)The Scotsman, 10 September 2002 Retrieved 18 January 2012"]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Alan MacNaughtan"]}, {"page": "Alan MacNaughton", "response": ["*Alan MacNaughtan (1920–2002), British television actor "]}, {"page": "Theatre 625", "response": ["|Hugh Burden,Margery MasonSheila Reid,Ray Brooks,Alan MacNaughtan,Susan George,Kate Story,Carl Forgione,Edward de Souza,Peter Jesson"]}, {"page": "The Champions", "response": ["| colspan=\"5\" style=\"background-color: white;\" |Tracking an unrepentant Nazi who has been released after years in prison in East Germany, the Champions become involved in an attempt to stop him from obtaining an ex-Nazi atom bomb.With Hannah Gordon, Norman Jones, Morris Perry, Derek Newark, Alan MacNaughtan, Basil Henson, Wolf Frees, Michael Lees"]}, {"page": "Play of the Month", "response": ["|Zena Walker,Mary Wimbush,Michael Gwynn,Stanley Meadows,Deborah Lavin,Alan MacNaughtan,Gertan Klauber,Nicholas Smith,Jay Neill"]}, {"page": "List of Bergerac episodes", "response": ["| John Bennett, Susan Fleetwood, Alan MacNaughtan, David John Pope"]}, {"page": "Maelstrom (TV series)", "response": ["|5||\"Into the Vortex\"||5 March 1985|| Alan MacNaughtan (Professor Solberg)  Sheelah Wilcocks (Gerda)  Ulf Borger (Journalist)", "|6||\"Out of the Depths\"||12 March 1985|| Alan MacNaughtan (Professor Solberg)  Sheelah Wilcocks (Gerda)  Marisa Campbell (Freya)"]}, {"page": "Clarence Derwent Awards", "response": ["* 1973 Alan MacNaughtan as Philinte in The Misanthrope"]}, {"page": "McNaughton", "response": ["* Alan MacNaughtan"]}, {"page": "List of The Professionals episodes", "response": ["| Carol Royle, Robert Urquhart, Alan MacNaughtan, André Morell, George Murcell, Shelagh Fraser", "| Sheila Ruskin, Rona Anderson, Alan MacNaughtan, David Neal, Ian Bartholomew, Timothy Block, Rex Robinson, Aimée Delamain, Rob Heyland"]}, {"page": "Frederick Knott", "response": ["Although Dial M for Murder was a hit on the stage, it was originally a BBC television production. As a theatre piece, it premiered at the Westminster Theatre in Victoria, London in June 1952, directed by John Fernald and starring Alan MacNaughtan and Jane Baxter. This production was followed in October by a successful run in New York City at the Plymouth Theater, where Reginald Denham directed Maurice Evans, Richard Derr. Gusti Huber. Knott also wrote the screenplay for the 1954 Hollywood movie which Hitchcock filmed for Warner Brothers in 3D, starring Ray Milland and Grace Kelly, with Anthony Dawson and John Williams reprising their characters from the New York stage production, which had won Williams a Tony Award for his role as Inspector Hubbard. He previously sold the screen rights to Alexander Korda for only £1,000. The play was also made into a 1981 TV movie starring Christopher Plummer and Angie Dickinson, as the 1985 film Aitbaar in India, and as A Perfect Murder in 1998 with Michael Douglas and Gwyneth Paltrow. Based on the same plot, a Soviet TV film Tony Wendice's Mistake (:ru:Ошибка Тони Вендиса) was released in 1981."]}, {"page": "The Scold's Bridle", "response": ["*Alan MacNaughtan as James Gillespie"]}, {"page": "The Hanged Man (TV series)", "response": ["*Alan MacNaughtan – Charles Galbraith"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Alan MacNaughtan"]}, {"page": "List of Bergerac cast members", "response": ["*Alan MacNaughtan"]}, {"page": "The Town of No Return", "response": ["*Alan MacNaughtan as Mark Brandon"]}, {"page": "The Ghost Talks (Randall and Hopkirk (Deceased))", "response": ["*Alan MacNaughtan ...  Major Brenan"]}, {"page": "List of Scottish actors", "response": ["*Alan MacNaughtan (1920–2002)"]}, {"page": "List of The Sandbaggers characters", "response": ["Sir Geoffrey Wellingham, KCMG, DSCSir Geoffrey is shown wearing his KCMG around his neck, and miniature medals of his lesser honours on the lapel of his tailcoat, in episode 1.07, \"Special Relationship\" is the Permanent Undersecretary of State at the Foreign and Commonwealth Office that oversees SIS. As Burnside's former father-in-law, he is also Burnside's contact within Whitehall, and the two both share information and use each other. This avenue of communication is somewhat outside regular channels, and although it can be useful for both Burnside and the SIS, on occasion Burnside's superiors, particularly Deputy Chief Matthew Peele, show resentment of his relationship with Wellingham. Despite their relationship, the two men occasionally become adversaries when their agendas differ. Due to his background, experience, and position, Wellingham can be a formidable opponent for Burnside, and reminds him of that more than once. Wellingham appears in all but two episodes in the series and is played by Alan MacNaughtan."]}, {"page": "Yanks Go Home", "response": ["*Col. Ralph Kruger (Alan MacNaughtan)"]}, {"page": "Crane (TV series)", "response": ["13. The Man In The Gold Waistcoat. The waistcoat caused Crane to be involved in the death of a man found in the desert and now he's running for his life from a band of men intent on killing him. Steve Plytas as Franz Bauer, Alan Wheatley as Dr. Hilfe, William Devlin as Sheik Gamal, Alan MacNaughtan as The Major, Nicolas Chagrin as Selim."]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Mike Reid as Vernon, Alan MacNaughtan as Merrick, Harry Landis as Lenny Bowman, Julian Holloway as Matthews, Leslie Sarony as man in café, Steve Emerson as Merrick's Heavy, Gareth Milne as Gerry, Martin Fisk as Security Guard."]}, {"page": "Screen Two", "response": ["Cast: Trevor Peacock, Alan MacNaughtan, Teddy Turner, Vivian Pickles, Tony Haygarth, Jim Broadbent, Daniel Day-Lewis, Richenda Carey, Geoffrey Palmer, Roger Hammond, Benjamin Whitrow, Oona Kirsch, Richard Kane", "Cast: Warren Clarke, Alan MacNaughtan, Patrick Malahide, Jerome Flynn, June Page, Iain Rattray, Eileen Helsby, Charles Pemberton", "Cast: Richard E. Grant, Jim Carter, Heathcote Williams, Michael Melia, Simon Rouse, Max Harvey, Christopher Burgess, Alan MacNaughtan"]}, {"page": "2002 in Scottish television", "response": ["*29 August – Alan MacNaughtan, 82, actor"]}, {"page": "List of LGBT-related films of 1961", "response": ["|Victim ||  || United Kingdom || Crime, drama || Dirk Bogarde, Sylvia Syms, Dennis Price, Nigel Stock, Peter McEnery, Donald Churchill, Anthony Nicholls, Hilton Edwards, Norman Bird, Derren Nesbitt and Alan MacNaughtan || First English language film to use the word \"homosexual\""]}, {"page": "March 1920", "response": ["**Alan MacNaughtan, Scottish stage, film and TV actor; in Bearsden, Dunbartonshire (d. 2002)"]}, {"page": "Macnaughtan", "response": ["*Alan MacNaughtan (1920–2002), Scottish actor"]}, {"page": "1920 in Scotland", "response": ["* 4 March – Alan MacNaughtan, Scottish actor (died 2002)"]}, {"page": "The Glasgow Academy", "response": ["*Alan MacNaughtan, actor"]}, {"page": "BBC2 Playhouse", "response": ["| Sian PhillipsBarry FosterAlan MacNaughtanDaniel Day-LewisChristopher FairbankRay Callaghan"]}]}}