{"wiki_id": "http://www.wikidata.org/entity/Q47034932", "itemLabel": "John Payzant", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Payzant", "wikipedia_page": {"main": "John Payzant (17 Oct. 1749 in Jersey – 10 April 1834 in Liverpool, N.S.) was a Foreign Protestant, prominent New Light Congregational minister in Liverpool, Nova Scotia and was taken captive for four years with his siblings and pregnant mother after the Raid on Lunenburg (1756).  He was born Jean Paysant in St. Helier, Jersey, Channel Islands to French Huguenots Louis Payzant (1695–1756) and his wife Marie Anne Noget (1711–1796). The family moved to Lunenburg, Nova Scotia, in 1753. At the May 1756 raid, mercenary natives for the French shot and scalped his father and three others. (According to DesBrisay, they were later buried on Heckman's Island, Nova Scotia.)  For the first year, he and his siblings were adopted by the Indigenous family while his pregnant mother was taken to Quebec.  John learned to speak their native language. He later wrote: “I was [later] a languattor [translator] for the Indians as I had learnt that Language when prisoner among them.\" After one year of captivity by the natives, he and his siblings were eventually released to re-connect with their mother in Quebec. “When I arrived at Quebec I was sent to the Jesuits to be instructed in the Learning of that Academy and during my stay there I made great proficiency in the Arts that were taught in that School, and as they were fond to proselyte they took the more pains with me.\" In 1760 they all (including a sister born in Quebec in December 1756) returned to Nova Scotia, settling in Falmouth.  He then became a minister in Liverpool, Nova Scotia (1793). He was part of the Great Awakening and was a follower of Henry Alline and married his sister Mary in 1774. They had one daughter and eight sons. Rev. John Payzant died at 84 and is buried in Liverpool's Old Burying Ground.", "link_mentions": [{"page": "Henry Alline", "response": ["* Rev. John Payzant"]}, {"page": "Captivity narrative", "response": ["The fifth captivity narrative, by John Payzant, recounts his being taken prisoner with his mother and sister in the Maliseet and Mi`kmaq Raid on Lunenburg (1756) during the French and Indian War. After four years of captivity, his sister decided to remain with the natives. In a prisoner exchange, Payzant and his mother returned to Nova Scotia. John Witherspoon was captured at Annapolis Royal during the French and Indian War and wrote about his experience.John Witherspoon, Journal of John Witherspoon, Collections of the Nova Scotia Historical Society, Vol 2, pp. 31–62."]}, {"page": "Heckman's Island, Nova Scotia", "response": ["  Heckman's Island  is a community in the Canadian province of Nova Scotia, located in the Lunenburg Municipal District in Lunenburg County.  After Mi'kmaq fighters killed John Payzant's father and brother in the Raid on Lunenburg (1756), they were buried on Heckman's Island.History of Lunenburg County, p. 498"]}, {"page": "Raid on Lunenburg, Nova Scotia (1756)", "response": ["The Raid on Lunenburg occurred during the French and Indian War when Mi'kmaw and Maliseet fighters attacked a British settlement at Lunenburg, Nova Scotia on May 8, 1756.Diane Marshall in her book Heroes of the Acadian Resistance (Formac, 2011. p. 149) identifies that members of the Mi'kmaq militia were involved in the raid. There are competing primary sources regarding the ethnicity of the fighters.  Rev. John Payzant states in his Journal in 1810 that there were: \"ten Indian[s] from the River St. John. … They took my Mother and her four Children away with them to the River St. John Where we were all ransomed…\" This may be a reference to Maliseet (i.e., St. John River Indians).  At the same time, DesBrisay relays another primary account in which another son of the Payzant family, Lewis Payzant, identified one of the fighters as Mi'kmaq (DesBrisay, p. 496).  The native militia raided two islands on the northern outskirts of the fortified Township of Lunenburg, [John] Rous Island and Payzant Island (present day Covey Island).These islands are located off of the present-day village of Mahone Bay, Nova Scotia.  Mahone Bay was not established as a town until the twentieth century. At the time of the raid, this area was simply part of the farm lots of those who had property in the town of Lunenburg.  Such was the case with Louis Payzant who owned property in the town of Lunenburg and was killed on his farm lot property on Payzant Island (which is present-day Covey Island) during the raid. According to French reports, the Raiding party killed twenty settlers and took five prisoners. This raid was the first of nine the Natives and Acadians would conduct against the peninsula over a three-year period during the war. The Wabanaki Confederacy took John Payzant and Lewis Payzant prisoner, both of whom left written account of their experiences.", "*Son John Payzant's account of the Raid of Lunenburg and his subsequent captivity can be found in Brian C. Cuthbertson, ed. \"The Journal of the Reverend John Payzant (1749-1834)\", Hantsport, N.S.: Lancelot Press, 1981."]}, {"page": "Foreign Protestants", "response": ["File:John Payzant (1744-1834), Nova Scotia.jpg|John Payzant (1749–1834) – taken captive for four years (age 6-10)", "*John Payzant"]}, {"page": "Payzant, John", "response": ["#redirectJohn Payzant"]}]}}