{"wiki_id": "http://www.wikidata.org/entity/Q4707796", "itemLabel": "Alan Smyth", "itemDescription": "British record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Smyth", "wikipedia_page": {"main": "Alan Smyth is an English record producer from Sheffield, England. He has worked with a number of bands, including Pulp, Arctic Monkeys, Reverend and The Makers, The Long Blondes, Milburn, Richard Hawley, The Fever Club, The Scaramanga Six, Smokers Die Younger, Monkey Swallows the Universe, The Lodger, Little Man Tate, 65daysofstatic, Little Lost David, Albany, Dead Like Harry,  The Silverfish, The Magi, Dead World Leaders, Little Ze, Jack's Attic, Smiling Ivy, Pink Sharabang and The Hurriers. He works from his own studio in the city, 2fly Studios.Between 1986 and 1992, he was part of the Indie C&W outfit, Don Valley & The Rotherhides (in which all the members were named after areas of Sheffield), whose songs included \"Thatcher's Dead\". He also played guitar and performed backing vocals in the 1990s Sheffield guitar band Seafruit. Seafruit's single \"Looking For Sparks\" was used for a while on Sky Sports' football coverage.", "link_mentions": [{"page": "Pulp (band)", "response": ["The fold was short-lived however. Steve Mackey, a regular at their Sheffield and London gigs, was also studying in London and was asked to join the band as a bass player.Sturdy, p. 172. The line-up now consisted of Cocker, Mackey, Senior, Candida Doyle, Nick Banks (drums). In mid-1989, they began recording another album for Fire, this time with a bigger budget and production from Alan Smyth, called Separations. This was a progression of the style of Freaks, with Leonard Cohen-esque ballads on side one and an acid house infused track-listing on side two. The disparate styles can be attributed to Cocker and Mackey's different and changing tastes; Mackey introduced Cocker to house music which led to them both going to raves, while Cocker introduced Mackey to \"Scott Walker and Serge Gainsbourg\".Sturdy, p. 175. Like Freaks, the release of Separations was delayed, to an extent lessening the potential impact. In the meantime, however, in 1991, a 12\" recording, \"My Legendary Girlfriend\", became music periodical NMEs single of the week. Stuart Maconie described it in his review as \"a throbbing ferment of nightclub soul and teen opera\".Sturdy, p. 190. Furthermore, \"Countdown\" began to be mentioned in the mainstream press,Robinson, N. The Courier Mail and The Sunday Mail. 15 August 1991.Gallivan, Joseph. \"Rock/gig guide\". The Independent. 29 August 1991. heralding a turning point in Pulp's quest for fame."]}, {"page": "The Lodger (band)", "response": ["The Lodger formed in 2004, after Leeds label Dance to the Radio offered to put out a single on the basis of demos that Ben Siddall recorded in his bedsit, the band name inspired by his accommodation.Carter, Allison (2007) \" For Dancing Or Thinking: A Q&A With The Lodger\", Athens Exchange, 1 November 2007 \"The name comes from the fact that living in the roof of someone’s house in Leeds, that’s kind of the definition of lodger.\" The initial line-up was Siddall on guitar and vocals with Lisa Harker on bass and Katie James on drums.Mason, Stewart \"[ The Lodger Biography]\", allmusic, Macrovision Corporation After 3 sold-out limited 7\"s (\"Many Thanks For Your Honest Opinion\" on Dance to the Radio, \"Watching\" on Double Dragon, and \"Let Her Go\" on Angular Records) and touring around the UK and Europe with bands such as The Long Blondes and The Research, the group released their debut album Grown-Ups, produced by Alan Smyth and James Ford, in June 2007 on Angular Records in the UK, Slumberland Records in the US, Fabtone in Japan and Speak N Spell in Australia. By this time Harker and James had left the band, to be replaced by Joe Margetts and Bruce Renshaw."]}, {"page": "Kiss (Prince song)", "response": ["The band recorded a remix called \"Kisspower\" with Alan Smyth of Fon Studios in November 1986, using Fon's Akai S900 sampler. It included samples from the Prince original, Bruce Springsteen, Run–D.M.C. and other artists. Virgin wanted to release it but it was vetoed by Simon Draper of Virgin America over copyright concerns. It was eventually released as a run of 500 white label promotional copies. If released, it would have been one of the first mainstream sample-based singles, six months before \"Pump Up the Volume\" and \"Say Kids What Time Is It?\". \"Kisspower\" was acclaimed as a \"landmark\" and a \"cut'n'paste trailblazer\" by musician's magazine Electronic Sound. Alt URL"]}, {"page": "Alex Turner", "response": ["In the summer of 2003, Turner played seven gigs in York and Liverpool as a rhythm guitarist for the funk band Judan Suki, after meeting the lead singer Jon McClure on a bus. That August, while recording a demo with Judan Suki at Sheffield's 2fly Studios, Turner asked Alan Smyth if he would produce an Arctic Monkeys demo. Smyth obliged and \"thought they definitely had something special going on. I told Alex off for singing in an American voice at that first session.\" An introduction by Smyth led to the band acquiring a management team, Geoff Barradale and Ian McAndrew. They paid for Smyth and Arctic Monkeys to record numerous three-song demos in 2003 and 2004. Turner was quiet and observant during studio sessions, remembered Smyth: \"Whenever anyone popped in the studio, he would sit and listen to them before he would say anything.\" At their rehearsal room in Yellow Arch Studios, Arctic Monkeys developed a reputation as particularly hard workers; the owner lent the band touring equipment while the owner's wife helped Turner with his singing. Barradale drove the band around venues in Scotland, the Midlands, and the north of England to establish their reputation as a live band. The band handed out free copies of the demo CDs after each show and fans began sharing the unofficial Beneath the Boardwalk demo compilation online. After finishing college in mid-2004, Turner took a year out to focus on the band and deferred vague plans to attend university in Manchester. He began working part-time as a bartender at the Sheffield music venue The Boardwalk. There, he met well-known figures including musician Richard Hawley and poet John Cooper Clarke. By the end of 2004, Arctic Monkeys' audiences were beginning to sing along with their songs and the demo of \"I Bet You Look Good on The Dancefloor\" was played on BBC Radio 1 by Zane Lowe."]}, {"page": "When the Sun Goes Down (Arctic Monkeys song)", "response": ["*Alan Smyth – additional recording"]}, {"page": "Whatever People Say I Am, That's What I'm Not", "response": ["* Alan Smyth – production , additional recording "]}, {"page": "Smyth", "response": ["| Alan Smyth || before 1990 || (living) || EnglishMusic producer"]}, {"page": "Letters and Colours", "response": ["The band's song \"Alpha\" was included in Alt Delete's era defining compilation Digital PenetrationDigital Penetration, Alt-delete.co.uk in 2006. In April 2007, the band released \"Gaunt/Plan A\" on Mother Tongue.Mother Tongue , Indiestore.7digital.com The song was recorded by the Sheffield musician/producer Alan Smyth and was Steve Lamacq's single of the week on his Monday night Radio 1 new music show."]}, {"page": "The State of Things (album)", "response": ["The album includes seven songs that were previously released as free downloads, in a collection of demos entitled Ten Songs produced by Alan Smyth."]}, {"page": "Heavyweight Champion of the World (song)", "response": ["\"Heavyweight Champion Of The World\" tells a story of not just under-achievers, but the majority who are trapped within repetitive lives, with the ironic hook \"just be like everybody else\". Many songs by the band centre on the downward spiral of somebody's life. The song title is taken from a line of Barry Hines book 'A Kestrel For A Knave.' Like the song, the book's main character is an under-achieving young boy growing up in Yorkshire. The song has received rave reviews, and appeared as Zane Lowe's 'Hottest Record In The World Today', and is equally liked by Radio 1 DJs Nick Grimshaw and Greg James. The single is accredited to Jon McClure, Ed Cosens and Alan Smyth, acknowledging the work that Smyth did towards the demo of the song.", "Category:Songs written by Alan Smyth"]}, {"page": "He Said He Loved Me", "response": ["The title track is co-written by Alex Turner of the band Arctic Monkeys: frontman Jon McClure are good friends, to the point of sharing a flat in Sheffield, and have written other songs, such as \"Old Yellow Bricks\", from the Arctic Monkey's second album Favourite Worst Nightmare and also \"The Machine\", which appears on Reverend and the Makers' album The State of Things. \"He Said He Loved Me\", like the debut single \"Heavyweight Champion of the World\" is also attributed to Alan Smyth who produced the original demos for the band. The B-sides, \"You Get So Alone Sometimes It Just Makes Sense\" and \"God is in the TV\" are both co-written by Ed Cosens.", "Category:Songs written by Alan Smyth"]}, {"page": "Open Your Window", "response": ["Category:Songs written by Alan Smyth"]}, {"page": "The Violet May", "response": ["In early 2011, The Violet May toured in Germany with The Chapman Family before releasing their debut EP entitled \"TV\", along with a single of the same name. The EP was recorded in Sheffield's 2Fly Studios with producer Alan Smyth, who had previously worked with other notable bands from the city including Pulp, Arctic Monkeys, Reverend & The Makers, Richard Hawley and The Long Blondes."]}, {"page": "Spiders (British band)", "response": ["Since then the band have gigged almost constantly in and around Yorkshire. So far the band have recorded two EPs with Arctic Monkeys' producer, Alan Smyth; the first, Daring to Wish, Daring to Smile, Daring to Wonder, has received acclaim from regional press. In March 2011, the band formed Subtonic Records, and released their first promotional single \"Where Does this Leave us Now\", which has garnered 60,000 views on YouTube so far. Following up, and with further collaborations with filmmaker, Andy Little, the band has also released further promos: \"Ambitions of a Huckster's Daughter\", and \"Subtle Differences\"."]}, {"page": "List of songs recorded by Arctic Monkeys", "response": ["| Alex TurnerAlan Smyth"]}, {"page": "Cursed (Scaramanga Six album)", "response": ["In 2011, Steven recalled the process as follows: \"As we started bashing out new songs we knew that something wasn’t quite right – there was a feeling of unresolve. We had 'a lost album' and it suddenly hit us all. Could we simply ignore the wealth of music and love we had created with Sir Tim? No… It felt strange at first. These were songs we had heard over and over a few years before and we were playing them all again. But instead of a turgid process of replication we found ourselves reigniting the flame we had then adding more and more to it.\" The Morricones reworked and rewrote the songs as new versions, then recorded them in new sessions at 2fly Studios in Sheffield produced by Alan Smyth (Pulp, Arctic Monkeys, Richard Hawley and others)."]}, {"page": "Reverend and the Makers", "response": ["Reverend and The Makers released a 9-track demo in 2006, entitled \"Ten Songs\". The artwork included a track list with ten songs, track 10 being \"Paris at Night\". However this song was not made available for download; it only surfaced on the internet in August 2007. The demos were recorded at 2Fly Studios, and produced by Alan Smyth, McClure acknowledges the work Smyth put into the demos by accrediting the debut single; \"Heavyweight Champion of The World\" as McClure/Cosens/Smyth. Reverend and the Makers' music is a mix of indie guitar pop, electronica and a touch of Madchester-esque funk. Some of the internet demos feature members of other notable Sheffield musicians such as Alex Turner (Arctic Monkeys), Tim Hampton (Bromheads Jacket) and Mike Hughes (Little Ze). One of Reverend's inspirations is Manchester performance poet John Cooper Clarke and Reverend often performs his own poems, of a similar style, in between songs during his live sets. One of the B-sides to the debut single \"Heavyweight Champion of the World\" is a poem entitled \"Last Resort\" in which John Cooper Clarke and McClure read alternate stanzas. This poem was also duetted live when the band played live at Shoreditch's Spread Eagle in the first tour in May 2006."]}]}}