{"wiki_id": "http://www.wikidata.org/entity/Q4707625", "itemLabel": "Alan Richardson", "itemDescription": "cricketer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Richardson_(cricketer)", "wikipedia_page": {"main": "Alan Richardson (born 6 May 1975 in Newcastle-under-Lyme, Staffordshire) is a retired English cricketer who is the bowling coach for Worcestershire. He played for Derbyshire, Warwickshire, Middlesex and Worcestershire.", "link_mentions": [{"page": "May 6", "response": ["*1975 – Alan Richardson, English cricketer and coach"]}, {"page": "Newcastle-under-Lyme", "response": ["*Alan Richardson (born 1975), cricketer"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Alan Richardson"]}, {"page": "Gloucestershire County Cricket Club in 2005", "response": ["Middlesex won convincingly at Lord's. Ed Joyce continued with his good form, top-scoring with 75 as Middlesex made 390 all out, their highest score of the season so far, on the first day. Gloucestershire faced out a maiden over before the close of play. On the second day, in conditions still favouring the batsmen, 5 wickets from Alan Richardson and 4 from Melvyn Betts saw the visitors crumble to 232. Only Craig Spearman passed 30 for Gloucestershire, as he spent 144 minutes making 69. Middlesex were 93 for 3 in their second innings at stumps.", "Gloucestershire recovered well from last week's defeat at the hands of Glamorgan, to give Middlesex a decent fight and take the most points from a drawn game at Bristol. The hosts batted first, and after losing Craig Spearman and Ramnaresh Sarwan early, Gloucestershire fought back with three partnerships worth more than 60. Alex Gidman, Steve Adshead and Malinga Bandara all recorded fifties; the Sri Lankan Bandara, batting at eight, took the liberty to hit two sixes in an 89-ball 70. For Middlesex, Alan Richardson and Jamie Dalrymple took four wickets each, but gave up more than four runs an over in the process as Glamorgan made 333 in 92.2 overs. Middlesex batted to stumps on day one without loss, but William Rudge removed the top three to set them back slightly. Wickets continued to fall, with Malinga Bandara taking four of them, and Middlesex crashed to 248 for 9 before a last wicket partnership between Melvyn Betts and Stuart Clark took them to 297 before Bandara dismissed Betts lbw to end with five for 71."]}, {"page": "Glamorgan County Cricket Club in 2005", "response": ["Middlesex won the match at Southgate, where only 14 wickets fell in four days, while seven centuries were hit, including a double century. After the first day was shortened by rain, Glamorgan got into their stride on the second day, Dan Cherry taking seven hours to make 226 runs – while Middlesex' best bowling figures came from Melvyn Betts, taking one for 80. Glamorgan declared on 584 for 3, and Middlesex replied in fashion, declaring on 435 for 4 in an attempt to get a result – Ed Joyce scoring 155. Three quick wickets from Alan Richardson gave Middlesex some hope of forcing Glamorgan out, but a 118-ball 84 not out from Sourav Ganguly and Jonathan Hughes' second century of the match resulted in Glamorgan setting a target of 408 in 82 overs – a rate similar to that required in a one-day cricket. However, more centuries awaited, as Ed Smith and Owais Shah took Middlesex to 380 for 1 (admittedly with Ben Hutton retired hurt), and Irishman Ed Joyce made 70 not out to see Middlesex to the target.", "After Paul Weekes had taken Middlesex Crusaders to 149 for 5 after his 72, the young batsmen showed an appetite for runs as Glamorgan Dragons sunk to a defeat in this match between number two and three in the one-day tables. Both Ed Joyce and Ben Hutton made 61 at rates well-over a run a ball, and added 110 for the sixth wicket, before number 11 Alan Richardson finished off with a last-ball six off Robert Croft to bring the total to 284 for 9 after Croft had grabbed three late wickets. Chris Peploe then took four for 38, pinch hitters Croft and Alex Wharf were run out, Owais Shah held four catches despite not being the wicket-keeper, and Glamorgan were bowled out for 173 in 35.4 overs, leaving them losers by 111 runs, their heaviest defeat by runs in one-day cricket all season."]}, {"page": "Sussex County Cricket Club in 2005", "response": ["Jason Lewry then took six Middlesex wickets for 65 runs, reducing them to 244, although if it had not been Jamie Dalrymple's (65) and Paul Weekes' (71) partnership of 140 for the sixth wicket, things would have looked even nastier for Middlesex. In reply, Sussex were cautious in their chase of 314, but a big partnership between Richard Montgomerie and Murray Goodwin nearly won it for them. However, New Zealand all-rounder Scott Styris took four Sussex wickets for 79, and Alan Richardson took four for 38 – including Goodwin and skipper Adams. Sussex lost four wickets for 17 runs to crash to 280 for 6, but Kirtley and Lewry held out as Sussex finished 28 runs short of a victory and Middlesex finished one wicket short of victory in this bottom-fight."]}, {"page": "Nottinghamshire County Cricket Club in 2005", "response": ["The first day at Lord's saw Nottinghamshire, who were put in to bat, progress to 399 for 6, thanks to 117 not out from Australian David Hussey. Alan Richardson starred for Middlesex, taking 5 wickets on his county debut.", "Middlesex Crusaders used their home batting paradise at Southgate to good effect, smashing Nottinghamshire Outlaws bowlers to all corners as they amassed 314 for 7 in 45 overs - Paul Weekes top-scoring with a run-a-ball 106, while Irishman Ed Joyce pushed the accelerator in the final overs with an 18-ball 41 including six boundaries. In reply, Nottinghamshire were always going to be in trouble after crashing to 86 for 4, Weekes ripping out two wickets, but Samit Patel and Chris Read lifted them to 231 for 5 before Alan Richardson removed them both. That ended the Nottinghamshire resistance, as they subsided for 283, 31 runs short with three deliveries remaining."]}, {"page": "Hampshire County Cricket Club in 2005", "response": ["Hampshire won a closely fought match at the Rose Bowl by 64 runs despite the efforts with the ball by New Zealand and Middlesex all-rounder Scott Styris, who took his first ten-wicket haul of his career on a pitch that quickly deteriorated and in Styris' own words was \"junk\". With former England wicket-keeper John Crawley starring in the first innings, making a controlled 84 before being ninth out to Alan Richardson. There were disappointments for England fans, though, who had hoped that Kevin Pietersen would find some form – instead, he was out for a 10-ball duck in the first innings. Hampshire made 275 in their first innings, Alan Richardson and Scott Styris taking four wickets each."]}, {"page": "Surrey County Cricket Club in 2005", "response": ["Surrey edged the first day against Middlesex at Lord's. Initially Surrey reduced their hosts to 148 for 5, but then Jason Dalrymple rescued the innings with 77, supported by Irfan Pathan and Ben Scott. The first day ended with them on 319 for 7. They improved that greatly to 437 on the second day, as Pathan and Scott both made scores in the 60s. Surrey started slowly, moving to 18 for 1 after 15 overs of quality bowling from Pathan and Alan Richardson, but the stranglehold was eased with Richard Clinton scoring freely as he made his way to 73. At close, which came 18 overs early because of bad light, Surrey were 157 for 2, with Mark Ramprakash having retired hurt. Bad light claimed the last 29 overs of the third day too, but an unbeaten 152 from Ali Brown and a Surrey debut score of 81 from New South Wales recruit Dominic Thornely saw Surrey through to 460. The fourth day was always likely to meander into a draw, and exactly that happened; Surrey were simply unable to take wickets quick enough as the hosts were content to bat to 353 for 6 declared. (Cricinfo scorecard)"]}, {"page": "Middlesex County Cricket Club in 2005", "response": ["*  Alan Richardson", "The first day at Lord's saw Nottinghamshire, who were put in to bat, progress to 399 for 6, thanks to 117 not out from Australian David Hussey. Alan Richardson starred for Middlesex, taking 5 wickets on his county debut.", "Hampshire won a closely fought match at the Rose Bowl by 64 runs despite the efforts with the ball by New Zealand and Middlesex all-rounder Scott Styris, who took his first ten-wicket haul of his career on a pitch that quickly deteriorated and in Styris' own words was \"junk\". With former England wicket-keeper John Crawley starring in the first innings, making a controlled 84 before being ninth out to Alan Richardson. There were disappointments for England fans, though, who had hoped that Kevin Pietersen would find some form – instead, he was out for a 10-ball duck in the first innings. Hampshire made 275 in their first innings, Alan Richardson and Scott Styris taking four wickets each.", "Middlesex won convincingly at Lord's. Ed Joyce continued with his good form, top-scoring with 75 as Middlesex made 390 all out, their highest score of the season so far, on the first day. Gloucestershire faced out a maiden over before the close of play. On the second day, in conditions still favouring the batsmen, 5 wickets from Alan Richardson and 4 from Melvyn Betts saw the visitors crumble to 232. Only Craig Spearman passed 30 for Gloucestershire, as he spent 144 minutes making 69. Middlesex were 93 for 3 in their second innings at stumps.", "Jason Lewry then took six Middlesex wickets for 65 runs, reducing them to 244, although if it hadn't been Jamie Dalrymple's (65) and Paul Weekes' (71) partnership of 140 for the sixth wicket, things would have looked even nastier for Middlesex. In reply, Sussex were cautious in their chase of 314, but a big partnership between Robin Montgomerie and Murray Goodwin nearly won it for them. However, New Zealand all-rounder Scott Styris took four Sussex wickets for 79, and Alan Richardson took four for 38 – including Goodwin and skipper Adams. Sussex lost four wickets for 17 runs to crash to 280 for 6, but Kirtley and Lewry held out as Sussex finished 28 runs short of a victory and Middlesex finished one wicket short of victory in this bottom-fight.", "Surrey edged the first day against Middlesex at Lord's. Initially Surrey reduced their hosts to 148 for 5, but then Jason Dalrymple rescued the innings with 77, supported by Irfan Pathan and Ben Scott. The first day ended with them on 319 for 7. They improved that greatly to 437 on the second day, as Pathan and Scott both made scores in the 60s. Surrey started slowly, moving to 18 for 1 after 15 overs of quality bowling from Pathan and Alan Richardson, but the stranglehold was eased with Richard Clinton scoring freely as he made his way to 73. At close, which came 18 overs early because of bad light, Surrey were 157 for 2, with Mark Ramprakash having retired hurt. Bad light claimed the last 29 overs of the third day too, but an unbeaten 152 from Ali Brown and a Surrey debut score of 81 from New South Wales recruit Dominic Thornely saw Surrey through to 460. The fourth day was always likely to meander into a draw, and exactly that happened; Surrey were simply unable to take wickets quick enough as the hosts were content to bat to 353 for 6 declared. (Cricinfo scorecard)", "Middlesex won a high-scoring match at Southgate, where only 14 wickets fell in four days, while seven centuries were hit, including a double century. After the first day was shortened by rain, Glamorgan got into their stride on the second day, Dan Cherry taking seven hours to smash 226 – while Middlesex' best bowler was Melvyn Betts, taking one for 80. Glamorgan declared on 584 for 3, and Middlesex replied in fashion, declaring on 435 for 4 in an attempt to get a result – Ed Joyce scoring 155. Three quick wickets from Alan Richardson gave Middlesex some hope of forcing Glamorgan out, but a quick 84 not out from Sourav Ganguly and Jonathan Hughes' second century of the match resulted in Glamorgan setting a tricky target of 408 in only 80–85 overs – so they thought, anyway. But tons from Ed Smith and Owais Shah lifted Middlesex to 380 for 1 (admittedly with Ben Hutton retired hurt), and Irishman Ed Joyce made 70 not out to see Middlesex to the target.", "Middlesex Crusaders used their home batting paradise at Southgate to good effect, smashing Nottinghamshire Outlaws bowlers to all corners as they amassed 314 for 7 in 45 overs – Paul Weekes top-scoring with a run-a-ball 106, while Irishman Ed Joyce pushed the accelerator in the final overs with an 18-ball 41 including six boundaries. In reply, Nottinghamshire were always going to be in trouble after crashing to 86 for 4, Weekes ripping out two wickets, but Samit Patel and Chris Read lifted them to 231 for 5 before Alan Richardson removed them both. That ended the Nottinghamshire resistance, as they subsided for 283, 31 runs short with three deliveries remaining.", "After Paul Weekes had given Middlesex Crusaders a solid platform with his 72, the young batsmen showed application as Glamorgan Dragons sunk to yet another defeat. Both Ed Joyce and Ben Hutton made 61 at rates well-over a run-a-ball, as the pair added 110 for the sixth wicket, before number 11 Alan Richardson finished off with a last-ball six off Robert Croft to bring the total to 284 for 9 after Croft had grabbed three late wickets. Then, Chris Peploe took four for 38, Owais Shah held four catches despite not being the wicket-keeper, and Glamorgan rolled over for 173 in 35.4 overs.", "Gloucestershire recovered well from last week's defeat at the hands of Glamorgan, to give Middlesex a decent fight and take the most points from a drawn game at Bristol. The hosts batted first, and after losing Craig Spearman and Ramnaresh Sarwan early, Gloucestershire fought back with three partnerships worth more than 60. Alex Gidman, Steve Adshead and Malinga Bandara all recorded fifties; the Sri Lankan Bandara, batting at eight, took the liberty to hit two sixes in an 89-ball 70. For Middlesex, Alan Richardson and Jamie Dalrymple took four wickets each, but gave up more than four runs an over in the process as Glamorgan made 333 in 92.2 overs. Middlesex batted to stumps on day one without loss, but William Rudge removed the top three to set them back slightly. Wickets continued to fall, with Malinga Bandara taking four of them, and Middlesex crashed to 248 for 9 before a last wicket partnership between Melvyn Betts and Stuart Clark took them to 297 before Bandara dismissed Betts lbw to end with five for 71."]}, {"page": "National League Division One in 2005", "response": ["Middlesex Crusaders used their home batting paradise at Southgate to good effect, smashing Nottinghamshire Outlaws bowlers to all corners as they amassed 314 for 7 in 45 overs – Paul Weekes top-scoring with a run-a-ball 106, while Irishman Ed Joyce pushed the accelerator in the final overs with an 18-ball 41 including six boundaries. In reply, Nottinghamshire were always going to be in trouble after crashing to 86 for 4, Weekes ripping out two wickets, but Samit Patel and Chris Read lifted them to 231 for 5 before Alan Richardson removed them both. That ended the Nottinghamshire resistance, as they subsided for 283, 31 runs short with three deliveries remaining.", "After Paul Weekes had given Middlesex Crusaders a solid platform with his 72, the young batsmen showed application as Glamorgan Dragons sunk to yet another defeat. Both Ed Joyce and Ben Hutton made 61 at rates well-over a run-a-ball, as the pair added 110 for the sixth wicket, before number 11 Alan Richardson finished off with a last-ball six off Robert Croft to bring the total to 284 for 9 after Croft had grabbed three late wickets. Then, Chris Peploe took four for 38, Owais Shah held four catches despite not being the wicket-keeper, and Glamorgan rolled over for 173 in 35.4 overs."]}, {"page": "Kemar Roach", "response": ["In February 2011 Bangladesh, India, and Sri Lanka hosted the 50-over World Cup. In the West Indies' second game of the tournament, Roach became the sixth bowler to have claimed a hat-trick in a World Cup. He dismissed Pieter Seelaar, Bernard Loots, and Berend Westdijk for his hat-trick and went on to claim 6/27, the fourth-best bowling figures by a West Indies player in ODIs. He was the West Indies' leading wicket-taker in the tournament with 13 wickets from 6 matches. Roach played just four Tests in 2011, and took seven wickets at a cost of over 50 runs each. Five players bowled more overs in Tests for the West Indies, and each took more wickets and had a better bowling average; four of them took more than 30 wickets. Despite not regularly featuring in the Test side, Roach finished the year as the team's leading wicket-taker in ODIs with 30 dismissals from 23 matches at an average of 31.16. Roach signed a contract in August 2011 to represent Worcestershire in English domestic cricket. At the time the club was struggling to avoid relegation from the first division of the County Championship, the first-class competition, and in the final game of the season managed to ensure they stayed up. According to Roach Worcestershire's seam bowler Alan Richardson helped him learn how to bowl in English conditions, and took 14 first-class wickets at an average of 39.28."]}, {"page": "2008 Stanford Super Series", "response": ["Alan Richardson"]}, {"page": "2005 County Championship", "response": ["|style=\"text-align:center;\"| 57 ||style=\"text-align:center;\"| 25.22 || Alan Richardson || Middlesex"]}, {"page": "Geoffrey Crook", "response": ["Crook made his debut for Staffordshire in the 2000 Minor Counties Championship against Bedfordshire.  Crook played Minor counties cricket for Staffordshire from 2000 to 2002, which included 5 Minor Counties Championship matches and 3 MCCA Knockout Trophy matches.  In 2002, he made his only List A appearance against Warwickshire in the Cheltenham & Gloucester Trophy.  In this match, he took 2 wickets for 43 runs from 10 overs.  With the bat he was dismissed for a duck by Alan Richardson."]}, {"page": "Philip Oliver (cricketer)", "response": ["Following his retirement, Oliver has gone on to write about cricket. He currently runs Cicada Sports alongside Herefordshire cricketer Christopher Boroughs and businessman Steve Copson. The store, which specialises in sporting equipment, has sponsored cricketers Peter Trego, Alan Richardson and Stephen Adshead. The company also provides clothing and equipment to Berkshire, Herefordshire and Cambridgeshire. He is the current coach of the Unicorns cricket team, which plays in the Clydesdale Bank 40. At club level he has played cricket for Newport, Shropshire and Old Hill at Cradley Heath."]}, {"page": "2012 English cricket season", "response": ["* Tim Bresnan, Alastair Cook, Glen Chapple, Alan Richardson, Kumar Sangakkara"]}, {"page": "Alan Richardson", "response": ["Alan Richardson, Allan Richardson, or Allen Richardson may refer to:", "* Alan Richardson (cricketer) (born 1975), English cricketer", "* Alan Richardson (footballer, born 1940) (1940–2015), known as Bull Richardson, Australian rules footballer for Richmond and South Melbourne", "* Alan Richardson (footballer, born 1965), Australian rules coach of St Kilda and former Collingwood footballer", "* Alan Richardson (boxer) (born 1948), English boxer", "* Alan Richardson (composer) (1904–1978), Scottish pianist and composer", "* Alan Richardson (priest) (1905–1975), Dean of York"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Alan Richardson (1999–2004) : A. Richardson (63)"]}, {"page": "2013 County Championship", "response": ["| align=\"left\"| Alan Richardson"]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["* Alan Richardson (2012) : A. Richardson (Warwickshire, Middlesex, Worcestershire)\t"]}]}}