{"wiki_id": "http://www.wikidata.org/entity/Q4708784", "itemLabel": "Alastair Stewart", "itemDescription": "English journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alastair_Stewart", "wikipedia_page": {"main": "Alastair James Stewart OBE (born 22 June 1952) is an English journalist and newscaster. Formerly presenting for ITV News, he joined GB News as a presenter in 2021. He has won the Royal Television Society's News Presenter of the Year award twice.\nStewart joined Southern Television in 1976 then joined ITN in 1980 where he served three years with Channel 4 News and then went on to become a main newsreader with ITV News. He remained in this role for more than 35 years, making him the longest-serving male newsreader on British television, having worked in both local and national news for 44 years. In January 2020, he stepped down as an ITV News presenter after admitting to multiple \"errors of judgement\" in his use of social media which breached ITN editorial guidelines. He has been a relief presenter for TalkRadio since the summer of 2020. \nHe is a patron of a number of charities, including Kids for Kids – helping children in Darfur, disability charity Scope and Brooke – action for working horses and donkeys.", "link_mentions": [{"page": "1952", "response": ["** Alastair Stewart, British newsreader"]}, {"page": "University of Bristol", "response": ["File:Alastair Stewart 31.08.07.jpg|Alastair Stewart, TV journalist", "In current affairs, former students include journalist and McMafia author Misha Glenny, BBC News Chief Political Correspondent James Landale (who founded the university independent newspaper Epigram), author and journalist Julie Myerson, editor-in-chief of the Telegraph Media Group William Lewis, editor-in-chief of The Observer Will Hutton, Radio 4 presenter Sue Lawley, newsreader Alastair Stewart, and Sky News US Correspondent Dominic Waghorn. BBC Breakfast and Good Morning Britain anchor Susanna Reid was an editor of Epigram."]}, {"page": "1987 United Kingdom general election", "response": ["The election night was covered live on the BBC and presented by David Dimbleby, Peter Snow and Sir Robin Day. It was also broadcast on ITV and presented by Sir Alastair Burnet, Peter Sissons and Alastair Stewart."]}, {"page": "Battle of Orgreave", "response": ["The Battle of Orgreave was a violent confrontation on 18 June 1984 between pickets and officers of the South Yorkshire Police (SYP) and other police forces, including the Metropolitan Police, at a British Steel Corporation (BSC) coking plant at Orgreave, in Rotherham, South Yorkshire, England. It was a pivotal event in the 1984–1985 UK miners' strike, and one of the most violent clashes in British industrial history. Journalist Alastair Stewart has characterised it as \"a defining and ghastly moment\" that \"changed, forever, the conduct of industrial relations and how this country functions as an economy and as a democracy\". Most media reports at the time depicted it as \"an act of self-defence by police who had come under attack\". In 2015, the Independent Police Complaints Commission (IPCC) reported that there was \"evidence of excessive violence by police officers, a false narrative from police exaggerating violence by miners, perjury by officers giving evidence to prosecute the arrested men, and an apparent cover-up of that perjury by senior officers\". "]}, {"page": "Channel 4 News", "response": ["*Alastair Stewart (1983–87)"]}, {"page": "Peter Sissons", "response": ["Sissons joined ITN in 1964, working his way up to the role of journalist. He was wounded by gunfire whilst covering the Biafran War in 1968, sustaining severe nerve damage in his left leg. After recovering from his injuries, he became ITN's Industrial Editor, covering many high-profile disputes during the 1970s. On 6 September 1976, Sissons joined the list of presenters of ITN's lunchtime ITN News at One bulletin, alternating with Leonard Parkin. He also co-presented ITN's 1983 General Election Night programmes (with Sir Alastair Burnet and Martyn Lewis) and in 1987 (with Burnet and Alastair Stewart)."]}, {"page": "ITV News Channel", "response": ["Following the February 2004 relaunch, presenters included ITN veteran Alastair Stewart who hosted the flagship Live with Alastair Stewart programme every weekday morning. Andrew Harvey, Lucy Alexander, Leyla Daybelge, Chris Rogers, Phil Gayle, Owen Thomas and Sasha Herriman were also used. All of ITV News' main presenters, except Trevor McDonald, also appeared on the channel. Presenters from ITV's regional news programmes and freelancers regularly appeared on the channel at weekends and holiday periods.", "* 10.00am: ITV News Live with Alastair Stewart ", "*10am: ITV News Live with Alastair Stewart", "*5:30pm: SPECIAL: 5 Years Of the News Channel, presented by Alastair Stewart.", "At the end of the final programme, Alastair Stewart closed the channel with the words:"]}, {"page": "Jon Snow (journalist)", "response": ["By 1978, he was working as a correspondent for ITN, and in November of that year was sent on a mission to Vietnam to report on the plight of the boat people.Jon Snow, Shooting History: A Personal Journey (Harper Collins, 2017), pp. 1–3. He served as ITN's Washington correspondent (1983–1986) and as diplomatic editor (1986–1989) before becoming the main presenter of Channel 4 News in 1989. In 1992, he was the main anchor for ITN's election night programme, broadcast on ITV; he presented the programme alongside Robin Day, Alastair Stewart and Julia Somerville. (Previously ITN's programme had typically been presented by Alastair Burnet, who left ITN in 1991. The 1992 election night programme was the only one hosted by Snow. He was replaced by Jonathan Dimbleby from 1997 onwards.) Snow has won several RTS Awards – two for reports from El Salvador, one for his reporting of the Kegworth air disaster as well as the 1995 Award for Best Male Presenter and the 1980 Award for TV Journalist of the Year for his coverage of Afghanistan, Iran and the Middle East."]}, {"page": "Alistair", "response": ["* Alastair Stewart, ITV News presenter"]}, {"page": "Nick Robinson (journalist)", "response": ["Later on in the election campaign, Labour announced that Tony Blair would be making \"the most important speech of the campaign\" on immigration, with a specially invited audience. Robinson asked Blair why there were only white people in the audience, and Blair pointed out a single Asian man to disprove Robinson. Later, Robinson stated: \"We know that the big two parties carefully select audiences to give a particular appearance. Is it a great controversy to point this out? That's informing the audience.\" On election night, Robinson joined presenters Jonathan Dimbleby and Alastair Stewart to reveal the results with political analysis."]}, {"page": "ITV News", "response": ["First Report was moved to 13:00 and retitled News at One in 1976; Leonard Parkin and Peter Sissons alternated in the presenter's chair. Michael Nicholson continued as main newscaster of the News at 545, with Martyn Lewis replacing Parkin as the relief presenter. In 1986, Nicholson left newscasting to return to war reporting and was replaced by Alastair Stewart. Leonard Parkin retired in 1987, and Peter Sissons became a main newscaster for ITN's Channel 4 News (before moving to the BBC in 1989) – it was at this point that the programme revamped. It was moved to 12:30, and appropriately became the News at 12:30. Julia Somerville joined ITN from the BBC's Nine O'Clock News to host the new programme, with John Suchet and Jon Snow acting as relief presenters. In 1988, the programme returned to its original slot and once again became the News at One; the presenting line-up remained unchanged. In 1989, Somerville left the programme to become a main presenter of News at Ten, leaving Suchet to become the main lunchtime newscaster – the programme was revamped once more. In 1991, the programme moved back to the 12:30 slot, but retained the studio setting. In 1993, graphics were relaunched to bring it in line with other ITN news bulletins.", "News at 545 was replaced by the News at 540 in 1989 (following the introduction of the ITV National Weather forecast), and a new presenting team was formed comprising Carol Barnes, Nicholas Owen, Trevor McDonald, Fiona Armstrong, and Alastair Stewart. The programme lasted until March 1992 when it was renamed and relaunched, in line with other ITN bulletins.", "ITN's regular newscasting team in the 1980s included Alastair Burnet, Sandy Gall, Leonard Parkin, Alastair Stewart, Trevor McDonald, Julia Somerville, Carol Barnes, Fiona Armstrong, John Suchet, Nicholas Owen, and a host of well-known reporters and correspondents.", "With the outbreak of warfare in Iraq in 2003, ITV replaced the ITV News at Ten with a special 45-minute-long ITV News at Nine every Monday to Friday, hosted by Trevor McDonald in Kuwait City and John Suchet in the ITV News studio in London. The News at Nine proved to be very popular, reaching 9.1 million viewers on the first night in comparison to the 5 to 6 million for the BBC's late evening news. The ITV Evening News was extended to 60 minutes, and various ITV news specials ran throughout the schedules. A simulcast of the ITV News Channel aired from 00:00 to 05:30 every night on ITV1. ITN also managed to persuade big name newscasters to return to the organisation to present the special war coverage on ITV: Alastair Stewart, Carol Barnes, Angela Rippon, Jon Nicholson and Anne Leuchars were all back presenting news bulletins and regular slots on the ITV News Channel.", "In August 2009, it was announced that after 16 years co-hosting London Tonight, Alastair Stewart was to leave the regional magazine programme to become the main co-anchor of the ITV Evening News. Mark Austin continued to present some editions of the 18:30 bulletin. It was also revealed that, following his successful stint as presenter of Election Night Live: America Decides in 2008, Stewart was to present the ITN/ITV coverage of the UK general election in 2010.", "The team of Alastair Burnet and Peter Sissons provided many memorable election night programmes on ITV, including the 1984 European elections and Election 87, but by 1992 the faces of ITV's political coverage had changed somewhat. Election 92 was anchored by Jon Snow, with Alastair Stewart providing graphical commentary and Julia Somerville assisting with regular news summaries. Stewart and Somerville were again present for ITV's 1997 coverage of the John Major-Tony Blair election – aptly titled Election 97 – with Jonathan Dimbleby as the anchor. Dimbleby returned for Election 2001 and Election 2005, aided both times by ITV News' political editors John Sergeant (in 2001) and Nick Robinson (in 2005) and a team of correspondents and newscasters around the country at polling stations.", "The US presidential election of November 2008 was covered by ITN on the ITV network between 23:15 and 06:00 in a programme titled Election Night Live: America Decides, which saw ITN team up with fellow news organisation NBC News; Alastair Stewart hosted from the studio in London, supported by MORI-founder Bob Worcester and a team of studio guests throughout the evening. Julie Etchingham, James Mates, Bill Neely and John Irvine provided the all-important presenting and reporting duties from the United States. Stewart also presented ITN coverage of the European elections of 2009, an intimate affair with the newscaster and ITV News election analyst Colin Rallings in the studio. Political Editor Tom Bradby and Senior Political Correspondent Chris Ship provided regular updates, and a team of reporters gave results as they were counted around the country.", "The UK general election campaign of 2010 was covered by ITV under the banner Campaign 2010, prominent in all its news and current affairs programming. There were special election-themed editions of the Tonight programme presented by ITN reporters and newscasters. Alastair Stewart was the moderator for The First Election Debate, the first ever debate between leaders of political parties in the United Kingdom, transmitted on 15 April between 20:30 and 22:00. A weekly discussion programme also began on that date: Campaign 2010 with Jonathan Dimbleby. The weeks of special programming culminated in the 6 May election night coverage on ITV: Election 2010, which was broadcast between 21:55 and 06:00 and presented by Alastair Stewart. Julie Etchingham fronted the traditional ITV election night graphics, Mary Nightingale hosted the ITV election party on the bank of the Thames, and ITV News Election Analyst Colin Rallings provided the all important psephological information. GMTV dedicated its entire 7 May programme to the Election, with contributions from ITV newscasters Etchingham, Nightingale and James Mates. Mark Austin and Katie Derham continued the ITN coverage following GMTV: Election 2010 returned between 09:25 and 10:50. Alastair Stewart then returned with the programme at 12:30 until 15:00. ITV Wales, STV and UTV provided additional programming relevant to their coverage areas.", "At 06:00 on Friday 8 May 2015, ITV's breakfast programme Good Morning Britain aired their first election coverage special on ITV, Good Morning Britain having only launched in the spring of 2014. Hosts Susanna Reid and Ben Shephard were joined by Tom Bradby for breakfast coverage of the results. At 09:25 ITV News resumed with their own coverage of the results with Alastair Stewart and Julie Etchingham at their anchor desks until late afternoon on ITV. During the course of the day there were regular regional news opt outs, with UTV and STV providing more extensive coverage of the election results in their own region.", "ITN/ITV News picked up both Royal Television Society (RTS) and Broadcast awards for coverage of the Beslan school siege, and Alastair Stewart won the RTS News Presenter of the Year award in 2005. The 18:30 ITV Evening News held the title of RTS News Programme of the Year for four years running, starting in 2004. News at Ten was nominated for the award in the RTS Journalism Awards 2007/2008, but lost out to the BBC News at 10. However, in the BAFTA Television Awards ceremony held on Sunday 26 April 2009, News at Ten won in the category News Coverage for their coverage of the 2008 Sichuan earthquake. It was up against its ITN rival Channel 4 News and Sky News, who had two nominations. News at Ten's coverage of the earthquake also won the International Emmy award for News Coverage in September 2009. In June 2010, the programme won the News Coverage BAFTA for the second year running, for their coverage of the 2010 Haiti earthquake."]}, {"page": "2010 United Kingdom general election", "response": ["|| Alastair Stewart"]}, {"page": "ITV News at Ten", "response": ["News at Ten rose to popularity for its winning combination of in-depth, analytical news coverage and populist stories.' It simultaneously helped popularise newscasters such as Alastair Burnet, Andrew Gardner, Reginald Bosanquet, Sandy Gall, Anna Ford, John Suchet, Mark Austin, Alastair Stewart and Trevor McDonald into well-known television personalities.", "The development of satellite technology in the 1980s allowed News at Ten to broadcast live from several locations around the world, including the Great Wall of China during a visit from the Queen in 1986. Alastair Burnet presented News at Ten from the United States during several presidential campaigns, as well as the 1984 conventions of the Republican and Democratic parties. Alastair Stewart presented News at Ten live from Saudi Arabia, the fall of the Berlin Wall in 1989 and the liberated Kuwait City during the 1991 Gulf War.", "McDonald finally retired from News at Ten in October 2008 after hosting the programme's special US election coverage from Washington and was replaced by Mark Austin in November. Austin presented the ITV News at 6:30 simultaneously until he was replaced on that programme by Alastair Stewart.", "*Alastair Stewart (1989–1992, 2009–2020)"]}, {"page": "ITV Evening News", "response": ["Alastair Burnet was the original presenter of the News at 545. Michael Nicholson fronted the bulletin on Fridays, and was also a relief presenter. Immediately after the animated visual 'roll' and electronic theme music at the beginning, an announcer intoned in a hushed tone: \"The news at 5:45, with Alastair Burnett/Michael Nicholson\". Other relief presenters in the late 1970s included Leonard Parkin, who at the time also regularly hosted the News at One, and Martyn Lewis. In March 1980, when Burnet departed the 545 to present News at Ten, Nicholson replaced him as lead presenter, with Carol Barnes taking over as relief presenter. In September 1986, Nicholson left the 545 to return to war reporting, and was replaced by Alastair Stewart.", "On 4 April 1988 the News at 545 underwent some cosmetic changes, with the animated visual 'roll' logo and electronic theme music being dropped in favour of a new computer-generated opening sequence and a more contemporary theme tune; the studio images were still inlaid using chromakey, although these were now also generated by computer. The programme was moved to the main newsroom within the ITN headquarters building, and full-length reports were now featured as part of the programme. ITN dispensed with the \"main\" presenter and relief host format, and instead a \"team\" of newscasters - Alastair Stewart, Fiona Armstrong, Nicholas Owen, Trevor McDonald, Sue Carpenter and Carol Barnes - began presenting the show on a \"rotation\" basis. On 13 February 1989, the introduction of a national weather forecast at the end of the programme led to the bulletin's timeslot starting earlier at 5:40pm, being extended in length and the title being changed to News at 540.", "On 3 August 2009, it was announced that after 16 years co-presenting London Tonight, Alastair Stewart was to leave the regional news programme to become lead co-presenter of the ITV Evening News. Mark Austin would focus on ITV News at Ten, but continue as a relief presenter for the 6.30pm bulletin.", "It was announced in June 2015 that, as part of a wider restructure at ITV News, Mark Austin would return to the programme full-time, alongside Mary Nightingale from October 2015. Alastair Stewart continues to appear on the programme as a relief presenter, alongside his duties on the ITV Lunchtime News. Coinciding with the main presenter line-up, the programme is once again being referred to as the ITV Evening News.", "*Alastair Stewart (1986–1992, 2009–2020)"]}, {"page": "ITV Lunchtime News", "response": ["On 2 February 2004, ITV News was relaunched and the 12:30pm bulletin was restructured: Owen was joined by Katie Derham in a return to a dual-presenting team; then, on 11 April 2005, the programme was extended to 60 minutes. The 15-minute regional news bulletin at 3:00pm was axed and incorporated into the new 60-minute ITV Lunchtime News. On 4 September 2006, the 60-minute format was axed, returning to its shorter length and at a new broadcast time of 1:30pm. On 5 February 2007, Owen left to join BBC News and was replaced by Alastair Stewart. ITV Lunchtime News switched from the traditional 4:3 format to 16:9 widescreen since 3 December 2007.", "*Alastair Stewart (2005–2020)"]}, {"page": "Nina Hossain", "response": ["In June 2010, she replaced Katie Derham as a presenter of London Tonight, initially alongside Donal MacIntyre. However, on 1 November 2010 she became the sole presenter. She also presented the ITV Lunchtime News in a shared role with Alastair Stewart."]}, {"page": "Mark Austin (journalist)", "response": ["On 31 October 2007, ITV confirmed they would be resurrecting the News at Ten in 2008. Trevor McDonald would return as host with Sky News presenter Julie Etchingham co-anchoring the bulletin every night. In August 2008, Austin reported and presented for ITV News' Olympics: Beijing 2008 coverage. On 30 October 2008, ITV confirmed Trevor McDonald was stepping down from News at Ten and Austin would replace him. It was announced in August 2009, that Austin would be replaced by Alastair Stewart on the ITV Evening News, in order for Austin to concentrate on his duties on News at Ten."]}, {"page": "Mary Nightingale", "response": ["Until April 1999, Nightingale was co-presenter with Alastair Stewart of London News Network's flagship news programme London Tonight and was the sole presenter of London Today, Carlton's lunchtime news bulletin. She also presented the daily late news bulletins of London Tonight."]}, {"page": "Fiona Foster", "response": ["Foster worked at BBC Radio Oxford in 1985. She also worked as a waitress and an announcer for Greyhound. Foster was one of the launch presenters of London News Network's London Tonight programme in 1993 together with Alastair Stewart, having previously worked as a financial presenter on the Breakfast Business segment of BBC Breakfast News.", "Foster was the co-presenter of ITV's monthly programme \"Missing\" (similar to Crimewatch but featuring appeals on behalf of the National Missing Persons Helpline) alongside Alastair Stewart."]}, {"page": "Jonathan Gould (presenter)", "response": ["In September 1994 Gould made the move into presenting after an introduction arranged by school friend Jonathan Maitland, joining Cable 17 TV, a Telewest channel for viewers in south-west London. By 1995 he was a full-time sports presenter for Cable 17 Sport and turned freelance in May the following year, working on the sports desk for ITV Carlton's London Tonight with newsreaders Alastair Stewart and Mary Nightingale."]}, {"page": "ITV News at 10.30", "response": ["| 2004–2008 || Alastair Stewart"]}, {"page": "Police Camera Action!", "response": ["It was presented by Alastair Stewart from 1994 until 2002, until his second drink-driving conviction led to a temporary suspension, before he resumed his role with Adrian Simpson from 2007 until its cancellation three years later. In 2010, the final series of the programme was presented by Gethin Jones.", "The first episode broadcast on 7 September 1994 was known as Police Stop!, which was also the name of a similar police programme available initially on VHS video and later on Sky1. To this date, it is the only episode not to be repeated on Men & Motors or ITV4. A spin-off book of the series was released in 1996 by Ebury Press, which was written by Peter Gillbe with a foreword by Alastair Stewart and which featured police footage of bad driving. The book had some footage stills which were not shown on the TV episodes."]}, {"page": "Police Stop!", "response": ["Police Stop! was regularly repeated on Men and Motors and ITV4 during the late 2000s, although the repeats resulted in some confusion for viewers when both channels erroneously listed the series as being presented by Alastair Stewart, confusing it with the former ITV series Police Camera Action!, which Stewart fronted. Notably, only ten of the fourteen episodes were repeated on both channels, with Police Stop! America, Police Stop! Or We'll Shoot, Worst of Police Stop! and Police Stop! 11 remaining unrepeated. Labyrinth Media, who produced the series, also produced two further direct-to-video releases featuring a similar format.", "Riot Police, released in 1994, features graphic footage of riots, including the riot of March 31, 1990 in Trafalgar Square, London. Real Life Rescues, presented by Alastair Stewart and also released in 1994, features camera footage of real-life rescues involving the emergency services."]}, {"page": "Salesian College, Farnborough", "response": ["* Alastair Stewart, journalist and presenter"]}, {"page": "Madras College", "response": ["* Alastair Stewart – ITV newsreader"]}, {"page": "Shriti Vadera, Baroness Vadera", "response": [":Alastair Stewart: \"Final and briefest thought possible – you're a former banker and business person yourself and now a minister – when will we see the green shoots of recovery?"]}, {"page": "Derek Brockway", "response": ["In December 1995 he moved to London, working at The London Studios on South Bank with fellow forecasters Martyn Davies and John Hammond, and briefing weather presenters Siân Lloyd, Laura Greene and Femi Oke. As well as preparing the ITV National Weather and Channel 4 weather, Brockway broadcast on GMTV's The Sunday Programme presented by Alastair Stewart and Steve Richards."]}, {"page": "ITV News at 5:30", "response": ["*Alastair Stewart "]}, {"page": "ITV Weekend News", "response": ["*Alastair Stewart (1986–1992, 2003–2020)"]}, {"page": "ITV News London", "response": ["The flagship programme, initially an hour-long and presented by Alastair Stewart and Fiona Foster, was supplemented by shorter London Today bulletins, launched on 4 January 1993 (LWT discontinued its own local news service the previous weekend). The main evening programme was reduced to 30 minutes a year later, while from 25 November 1996 to September 2002, a half-hour lunchtime edition of London Today was broadcast on weekdays.", "Former notable lead presenters include Katie Derham, Fiona Foster, Nina Hossain,ITV News selects Nina Hossain as lead presenter of Lunchtime News Amy Wilson, Response Source, 30 May 2019 Natasha Kaplinsky, Anna Maria Ashe, Donal MacIntyre, Mary Nightingale, Alastair Stewart and Matt Teale."]}, {"page": "Owen Thomas (journalist)", "response": ["Before it closed down in December 2005, he was a presenter on the ITV News Channel. He and Faye Barker and covered the last hour of the news channel's final broadcast, before handing to Alastair Stewart for a special closing programme. "]}, {"page": "ITV Breakfast", "response": ["| 1995–2001 || Alastair Stewart ||  ||  ||  ||  || || "]}, {"page": "19 (song)", "response": ["Musically, the song was inspired by electro, particularly Afrika Bambaataa, although Hardcastle also \"added a bit of jazz and a nice melody\", and beyond the sampling of the documentary narration, the song incorporated pieces of interviews with soldiers. The song's pivotal hook, the repetitive \"N-n-n-n-nineteen\", was chosen due to the limitations of the early sampling technology used. The E-mu Emulator could only sample for two seconds, so the hook was based around \"the only bit of the narrative that made sense in two seconds\". Hardcastle wasn't optimistic about the song's chances in the charts. His previous two singles for independent labels had failed to make it into the UK's top 40 and the musical policy at Radio 1 was felt to be unsupportive of dance music. News interest in the song helped, with the tenth anniversary of the end of the Vietnam War seeing Hardcastle interviewed by Alastair Stewart of ITN."]}, {"page": "Jeddah Economic Forum", "response": ["*  Alastair Stewart, British television newsreader."]}, {"page": "Category talk:British journalists", "response": ["Alastair Stewartnot yet classified"]}, {"page": "Saturday Live (radio series)", "response": ["In May 2008 the programme, then presented by Fi Glover, was named Best UK Speech Programme at the annual Sony Radio Academy Awards. In February 2011, however, it was highlighted by the journalist and newscaster Alastair Stewart as \"unfunny, self-indulgent, contrived and, worst of all, twee\" and therefore unworthy, in his opinion, of a slot in the Radio 4 schedule. In May 2012, the duration of Saturday Live was increased to its current length of 90 minutes by being extended into the time-slot formerly occupied by the travel programme Excess Baggage. "]}]}}