{"wiki_id": "http://www.wikidata.org/entity/Q4707419", "itemLabel": "Alan Nelson", "itemDescription": "Irish cricketer (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Nelson_(cricketer)", "wikipedia_page": {"main": "Alan Norris Nelson (born 22 November 1965) is a former Irish cricketer.  Nelson was a right-handed batsman who bowled right-arm fast-medium.  He was born at Banbridge, County Down, Northern Ireland.  He was educated at Banbridge Academy.Nelson made his first-class debut for Ireland against Scotland in 1988.  He made three further first-class appearances for Ireland between then and 1991, all of which came against Scotland.  In his four first-class appearances, he took 14 wickets at an average of 22.57, with best figures of 5/27.  With the bat, he scored 56 runs at an average of 18.66, with a high score of 23 not out.  He made his List A debut for Ireland against Gloucestershire in the 1988 NatWest Trophy.  He made five further List A appearances, the last of which came against Yorkshire in the 1993 NatWest Trophy.  In his six List A matches, he took just 4 wickets at an average of 48.50, with best figures of 2/19.  While with the bat, he scored 20 runs at an average of 10.00, with a high score of 9 not out.  He also made six appearances for Ireland in the 1994 ICC Trophy in Kenya.His brother, Noel, played a single first-class match for Ireland, while his son, Liam, has played Youth One Day Internationals for Ireland Under-19s.  Outside of cricket, Nelson works as a despatch clerk.", "link_mentions": [{"page": "Banbridge Academy", "response": ["*Alan Nelson, cricketer"]}, {"page": "Alan Nelson", "response": ["Alan Nelson is the name of:", "*Alan Nelson, director of the Arizona State University Biodesign Institute ", "*Alan Nelson (cricketer), Irish first-class cricketer", "*Alan Nelson (writer), author of \"Man in a Hurry\" in the 1964 anthology The Unquiet Grave"]}, {"page": "1994 ICC Trophy squads", "response": ["* Alan Nelson"]}, {"page": "Noel Nelson", "response": ["Nelson was born at Banbridge in County Down in April 1967, and was educated at Banbridge Academy. An all-rounder at club level,  he played one first-class cricket match for Ireland against Scotland at Edinburgh in 1990. In a drawn match, Nelson batted once and was dismissed without scoring by Craig McKnight. He also bowled fifteen overs with his medium pace, but failed to take a wicket. He toured Zimbabwe in March 1991, playing six minor fixtures. Following this tour, he was not selected again for Ireland, beginning a career as an operations manager instead. His brother, Alan Nelson, also played first-class cricket for Ireland. More recently, his nephew, Lee Nelson, has played first-class cricket for the Northern Knights."]}]}}