{"wiki_id": "http://www.wikidata.org/entity/Q4707519", "itemLabel": "Alan Peters", "itemDescription": "British furniture designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Peters", "wikipedia_page": {"main": "Alan George Peters OBE (17 January 1933 – 11 October 2009) was a British furniture designer maker and one of the very few direct links with the Arts and Crafts Movement, having apprenticed to Edward Barnsley. He set up his own workshop in the Sixties. He is well known for his book Cabinetmaking - a professional approach (re-published in 2009) and his revision (for the fourth edition) of Ernest Joyce's The Technique of Furniture Making.\nIn 1990 he was awarded the OBE for his services to furniture and in 1998 he moved to Minehead in West Somerset. He was a main exponent of the seventies British Craft Revival. His work is rooted in tradition and shows a deep understanding and respect for his material wood. In 2009 fellow furniture designer maker Jeremy Broun made a film and wrote a book called \"Alan Peters - The Makers' Maker\". To a generation of British woodworkers in the seventies and eighties he is considered to be the greatest British furniture designer maker. He died on 11 October 2009 aged 76.He is known for his particularly elegant furniture work, such as an adzed, fan-like table and a tabletop with a bowl carved into it. Although his work was influenced by Japanese woodworking, he rejected Japanese tools after experimenting with them. He is famed among other woodworkers and furniture makers for his use of the No. 7 plane - a particularly large and heavy one - for nearly everything.\nSince 2010 The Alan Peters Award for Excellence has been run as an annual award, established by Jason Heap, a designer maker and director of The Celebration of Craftsmanship and Design exhibitions. The award open to furniture makers under 30 years of age was set up to continue the important legacy of Alan Peters.", "link_mentions": [{"page": "Woodworking", "response": ["* Alan Peters"]}, {"page": "List of furniture designers", "response": ["* Alan Peters (1933-2009)"]}, {"page": "Jeremy Broun", "response": ["His work was included in the 'First Sale of Contemporary British Crafts' at Sotheby's in 1980 and in 2002 at the Centenary exhibition celebrating the Hill House designed by Charles Rennie Mackintosh. In 1989 he gained The Worshipful Company of Furniture Makers Ambrose Heal Award for his craft documentary films. He has written numerous articles on woodworking and design including \"Furniture Today\" and a History of (Furniture) Designer Makers in 2005. In 2006 Broun was voted 'Professional Woodworker of the year 2005' by The Woodworker magazine. In 2007 Broun set up his own publishing company and launched The Revised Bespoke edition of his first book 'The Incredible Router'. In 2008 he was invited to become a freelance inspector for The British Accreditation Council for independent further and higher education. As a musician Jeremy plays the electro-acoustic guitars that he makes and can occasionally be heard busking on the streets of his home town Bath and has performed at the Bath Fringe Festival. In 2009 he was elected a Fellow of The Royal Society of Arts and in 2015 he resigned expressing concern that he felt the Society had drifted from its core aims to promote the Arts and Manufacturing. Since 2010 he has been a judge for the Alan Peters Award for Excellence for furniture makers under 30 years of age.", "*Alan Peters - The Makers' Maker. Published 2009."]}, {"page": "Peters (surname)", "response": ["*Alan Peters (1933–2009), British furniture maker"]}, {"page": "Deaths in October 2009", "response": ["*Alan Peters, 76, British furniture designer."]}, {"page": "The Furniture Society", "response": ["| 2002 || John MakepeaceJere OsgoodAlan Peters"]}, {"page": "Matthew Burt", "response": ["Taking an approach of simplicity and honesty to his chosen materials (in the main, sustainable sources of English woods such as ash, oak, maple, cherry, sycamore, elm and walnut), Burt began his career designing within the idiom of Arts and Crafts furniture but adding contemporary notes such as elegantly bevelled edges and subtly cut-out sections to the top of tapered legs. His designs began to lose weight and added curves. He sought a playful contrast between restraint and elaboration, always aiming at technical perfection, in the manner of the designer-maker Alan Peters."]}]}}