{"wiki_id": "http://www.wikidata.org/entity/Q4708729", "itemLabel": "Alastair King", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alastair_King", "wikipedia_page": {"main": "Alastair King (born 1967) is a British composer and conductor, perhaps best known for his musical contributions to film and television. He frequently collaborates with composers Charlie Mole, Geoff Zanelli, Nicholas Hooper and Rupert Gregson-Williams by either conducting for them or acting as an orchestrator or both.", "link_mentions": [{"page": "Pictures at an Exhibition", "response": ["Many other orchestrations and arrangements of Pictures have been made. Most show debts to Ravel; the original piano composition is, of course, frequently performed and recorded. A version for chamber orchestra exists, made by Taiwanese composer Chao Ching-Wen. Elgar Howarth arranged it for the Philip Jones Brass Ensemble in 1977, subsequently recasting it for Grimethorpe Colliery Band. Kazuhito Yamashita wrote an adaptation for solo classical guitar. Excerpts have also been recorded, including a 78 rpm disc of \"The Old Castle\" and \"Catacombs\" orchestrated by Sir Granville Bantock, and a spectacular version of \"The Great Gate of Kiev\" was scored by Douglas Gamley for full symphony orchestra, male voice choir and organ. The Amadeus Orchestra (UK) commissioned ten composers to orchestrate one movement each to make a version first performed complete in 2012. Movements were provided by Alastair King, Roger May, Tolib Shakhidi, David Butterworth, Philip Mackenzie, Simon Whiteside, Daryl Griffiths, Natalia Villanueva, James McWilliam and Julian Kershaw.", "* Amadeus Orchestra version, with one picture each provided by Alastair King, Roger May, Tolib Shakhidi, David Butterworth, Philip Mackenzie, Simon Whiteside, Daryl Griffiths, Natalia Villanueva, James McWilliam and Julian Kershaw. (2012, for large orchestra)"]}, {"page": "List of film score composers", "response": ["* Alastair King (born 1967)"]}, {"page": "Paul Gambaccini", "response": ["Gambaccini was co-author of The Guinness Book of British Hit Singles and related titles, with Tim and Jo Rice, alongside Radio 1 colleague at that time, Mike Read, between 1977 and 1996. Gambaccini's own books include Love Letters, Radio Boy, Top 100 Albums and Track Records. The Ultimate Man, a musical about a comic book superhero, was co-written with Alastair King and Jane Edith Wilson, and produced at the Bridewell Theatre in London in 2000."]}, {"page": "List of 21st-century classical composers", "response": ["|Alastair King || 1967 ||  || British ||  ||"]}, {"page": "Bath Spa University", "response": ["*Alastair King, TV and film composer, "]}, {"page": "Tom Kerstens", "response": ["Kerstens has been Artistic Director and CEO of the International Guitar Foundation since 1995. In this role, he has commissioned over 80 new works for the guitar, including pieces by Philip Cashian, Graham Fitkin, Alastair King, Bruce MacCombie, Edward McGuire, John Metcalfe, Howard Skempton, Joby Talbot, Kevin Volans and Errollyn Wallen."]}, {"page": "Music of the Harry Potter films", "response": ["| Alastair King", "| Alastair KingSimon WhitesideGeoff AlexanderJulian KershawBradley Miles", "| Nicholas HooperAlastair King", "| Alastair KingJeff AtmajianSimon WhitesideDaryl GriffithBradley Farmer"]}, {"page": "List of compositions for guitar", "response": ["*2002 Alastair King (born 1967) Three Dance Miniatures"]}, {"page": "Ben Foster (composer)", "response": ["Foster left his role as Doctor Who conductor and orchestrator in 2015 and was replaced by Alastair King, who has recently taken up the full role for Series 10."]}, {"page": "Rupert Gregson-Williams", "response": ["|Co-composed with Alastair King"]}, {"page": "Harry Potter and the Order of the Phoenix (soundtrack)", "response": ["Hooper incorporated \"Hedwig's Theme\", the series' theme originally written by John Williams for the first film and heard in all subsequent entries, into the score. In March and April 2007, Hooper, conductor Alastair King and the Chamber Orchestra of London recorded nearly two hours of music at Abbey Road Studios in London with orchestrations provided by King, Geoff Alexander, Julian Kershaw, Bradley Miles and Simon Whiteside. Two new main themes were made to reflect the new character Dolores Umbridge and Lord Voldemort's invasion of Harry's mind. A Japanese Taiko drum was used for a deeper sound in the percussion. The trailer contains a track by X-Ray Dog, entitled \"Divine Crusade\", which first appeared on the album K-9 Empire before being licensed to Order of the Phoenix."]}, {"page": "Filmclub", "response": ["| Alastair King"]}, {"page": "Harry Potter and the Half-Blood Prince (soundtrack)", "response": ["Harry Potter and the Half-Blood Prince is the soundtrack to the 2009 film of the same name, written and composed by Nicholas Hooper. The score was conducted by Hooper alongside Alastair King. It is the second Harry Potter film to be scored by Hooper, who also composed the score for the previous film in the series, Harry Potter and the Order of the Phoenix. The soundtrack was released on 14 July 2009, a day before the film's release, and was nominated for a Grammy Award for Best Score Soundtrack Album for a Motion Picture.", "The score for Half-Blood Prince was conducted by Hooper and Alastair King and performed by the Chamber Orchestra of London, the orchestra that performed the score for Order of the Phoenix, with orchestrations provided by King, Jeff Atmajian, Simon Whiteside, Daryl Griffith and Bradley Farmer. The score featured a more significant role for light choir. Thematically, Hooper referenced his own ideas from the previous score and several elements from Williams' work."]}, {"page": "Hollywood in Vienna", "response": ["Keith Lockhart, John Mauceri, Marc Shaiman, Lisa Gerrard, David Newman, Judith Hill, Olga Scheps, Ramon Vargas, Yury Revich, Frantisek Janoska, Drew Sarich, Valentian Nafornita, Aleksey Igudesman, Lebo M, Louise Dearman, Steven Gätjen, Martin Haselböck, Staatsopernballet (wie immer man das schreibt), Wiener Sängerknaben, Bolschoi Don Kosaken, Richard Bellis, Daniela Fally, Emmanuel Tjeknavorian, Superar Kinderchor, Cassandra Steen, Adrian Eröd, Ildiko Raimondi, Deborah Cox, Jeremy Schonfeld, David Arnold, Al Jarreau, Lalo Schifrin, Natalia Ushakova, Bruce Broughton, David Arnold, Alan Silvestri, Howard Shore, Harald Kloser, Alexander Frey, Barbara Broccoli, John Mauceri, James Shearman, Kate Barry, Klaus Badelt, Nicholas Dodd, Rick Porras, Gedeon Burkhard, John Axelrod, Kevin Costner, John Barry, Patrick Doyle, John Powell, Robert Dornhelm, Rebekka Bakken, Juan Garcia-Herreros, Alastair King, Christian Kolonovits, among others."]}, {"page": "List of compositions for viola: I to K", "response": ["* Alastair King (b. 1967)"]}, {"page": "Nick Roth (composer)", "response": ["Roth was born into a musical family in London; brothers Alex Roth and Simon Roth are also musicians, and mother Joy Mendelsohn is a music teacher (whose past students included Alastair King, George Michael and Andrew Ridgeley). He is married to Ukrainian vocalist Olesya Zdorovetska and since 2001 has been based in Dublin, Ireland."]}, {"page": "Skyscraper (soundtrack)", "response": ["Skyscraper – Original Motion Picture Soundtrack is the film score to the 2018 film of the same name, written and composed by Steve Jablonsky. The score was recorded at Abbey Road Studios in London with an orchestra conducted by Alastair King. Additional mixing was done at Arata Music Studios. The soundtrack was digitally released on July 13, 2018 by Milan Records with the physical soundtrack being released later on August 3, 2018.", "* Orchestra Conducted - Alastair King"]}, {"page": "Aquaman (soundtrack)", "response": ["The score was recorded at the Eastwood scoring stage located at Warner Bros. Studios, Burbank with the Hollywood Studio Symphony with Alastair King and Nick Glennie-Smith serving as conductors. Andrew Kawczynski, Evan Jolly, Forest Christenson, Tom Clarke and Steve Mazzaro provided additional music. The choir section was recorded at Air Lyndhurst Studios with the London Voices choral ensemble."]}, {"page": "City Music Foundation", "response": ["The Trustees are Kate Gee (Royal College of Music), Alastair King, Sir Roger Gifford, and Sir Andrew Parmley. CMF artists include Anna Cavaliero (soprano), Echéa Quartet (string quartet), Iona Fyfe (folksinger), Ariana Kashefi (cello), Mingyuan Ruan (accordion), Iyad Sughayer (piano), Giacomo Susani (guitar), and Rosalind Ventris (viola). CMF is based at Church House, Cloth Fair, London, and is a Registered Charity."]}]}}