{"wiki_id": "http://www.wikidata.org/entity/Q4707343", "itemLabel": "Alan Mitchell", "itemDescription": "British forester, dendrologist and botanist (1922-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Mitchell", "wikipedia_page": {"main": "Alan F. Mitchell (4 November 1922 – 3 August 1995) was a British forester, dendrologist and botanist, and author of several books on trees.\nHe almost single-handedly measured every notable tree in the British Isles, founding the Tree Register of the British Isles (T.R.O.B.I.), which held records of over 100,000 individual notable trees at the time of his death.\nDuring the Second World War, he served with the Fleet Air Arm in the East Asia. Returning by troop ship in the Red Sea at the end of the war, he pondered his future and decided it would be trees. In 1976, the Royal Forestry Society of England, Wales, and Northern Ireland awarded him its Medal for Distinguished Service to Forestry (Gold Medal) during a Society meeting at Westonbirt. (From a tribute by Esmond Harris, Quarterly Journal of Forestry, January 1996, page 67).\nHis 1987 book The Guide to Trees of Canada and North America is dedicated to his sister Christine. The book makes occasional oblique reference to a trip to North America in 1976.\nMitchell's Rule states: \"If there are tree stumps or felled trunks nearby, count the annual growth rings and measure the trunk circumference to find local growth rates\".", "link_mentions": [{"page": "Dendrology", "response": ["*Alan Mitchell"]}, {"page": "Guido Mina di Sospiro", "response": ["Mina di Sospiro's novel The Story of Yew, the memoirs of a two-thousand-year-old female yew tree,\"A Tale Told by a Tree\"\"The Story of Yew\" was inspired by the yew that grows in the cloister of Muckross Abbey, near Killarney, in Ireland. Botanist and dendrologist Alan Mitchell opined that \"As a blend of science and imaginative fiction, this is a remarkable book, far removed from 'science-fiction' as normally understood. It deals with the real world in an inventive way without putting a foot wrong.\"Original Endorsements\""]}, {"page": "Tilia × europaea", "response": ["Tilia × europaea is a large deciduous tree up to  tall with a trunk up to  circumference. The base of the trunk often features burrs and a dense mass of brushwood.Alan Mitchell, The Field Guide to the Trees of Britain and Northern Europe, William Collins & Co Ltd 1974,  (p.359) The leaves are intermediate between the parents,  long and  broad, thinly hairy below with tufts of denser hairs in the leaf vein axils. The flowers are produced in clusters of four to ten in early summer with a leafy yellow-green subtending bract; they are fragrant, and pollinated by bees. The floral formula is ✶ K5 C5 A0+5∞ (5). The fruit is a dry nut-like drupe  diameter, downy and faintly ribbed."]}, {"page": "The Tree Register", "response": ["It contains data from the original hand-written records of the late and internationally acclaimed dendrologist Alan Mitchell, and other historical records taken from reference works going back more than 200 years. . Recent height and girth measurements can be compared to those recorded by the likes of Loudon (1830s), Elwes and Henry (early 1900s) and the Hon. Maynard Greville (1950s), providing a valuable record of growth rates. The Tree Register was one of the founders of the Ancient Tree Hunt campaign."]}, {"page": "Mitchell (surname)", "response": ["*Alan Mitchell (1922–1995), British dendrologist and forester"]}, {"page": "David More", "response": ["More was born in Dingwall and educated in Kent. He has been a botanical illustrator for many years.Library of Congress Name Authority File Books he has illustrated include Collins GEM Trees (1980), Trees of North America (1988), with the late Alan Mitchell, and the Illustrated Encyclopedia of Trees (2003) by John White. He has also contributed artwork for many other books, magazines and posters, including a design for the Natural History Museum in London."]}, {"page": "List of superlative trees", "response": ["The girth of a tree is usually much easier to measure than the height, as it is a simple matter of stretching a tape round the trunk, and pulling it taut to find the circumference. Despite this, UK tree author Alan Mitchell made the following comment about measurements of yew trees:"]}, {"page": "A.F.Mitch.", "response": ["#REDIRECT Alan Mitchell"]}, {"page": "Alan F. Mitchell", "response": ["#REDIRECT Alan Mitchell"]}, {"page": "Alan F Mitchell", "response": ["#REDIRECT Alan Mitchell"]}]}}