{"wiki_id": "http://www.wikidata.org/entity/Q4707935", "itemLabel": "Alan Tudge", "itemDescription": "Australian politician (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Tudge", "wikipedia_page": {"main": "Alan Tudge (born 24 February 1971) is an Australian politician who served as Minister for Education and Youth in the Morrison Government from 2020 to 2021. He is a member of the Liberal Party and has been a member of the House of Representatives since the 2010 federal election.\nTudge grew up in Pakenham, Victoria. Before entering politics he was a management consultant with the Boston Consulting Group and deputy director of the Cape York Institute (2006–2009). He was elected to federal parliament in 2010, representing the Victorian seat of Aston. Tudge became a parliamentary secretary after the 2013 election. He served as a government minister in the Turnbull and Morrison Governments since 2016 and was elevated to cabinet in 2019. Prior to his appointment as education minister he served as Minister for Human Services (2016–2017), Citizenship and Multicultural Affairs (2017–2018), and Cities, Urban Infrastructure and Population (2018–2020).", "link_mentions": [{"page": "Bayswater, Victoria", "response": ["Liberal MP, Alan Tudge, who ran unsuccessfully for the seat of Aston in 2010, won the seat at the 2013 Australian federal election, 2016 Australian federal election and 2019 Australian federal election."]}, {"page": "Greg Hunt", "response": ["In June 2017 Hunt, Michael Sukkar and Alan Tudge faced the possibility of being prosecuted for contempt of court after they made public statements criticising the sentencing decisions of two senior judges while the government was awaiting their ruling on a related appeal. They avoided prosecution by, eventually, making an unconditional apology to the Victorian Court of Appeal."]}, {"page": "Ormond College", "response": ["* Alan Tudge – Minister for Education"]}, {"page": "Division of Aston", "response": ["The current Member for Aston, since the 2010 federal election, is Alan Tudge, a member of the Liberal Party of Australia who currently serves as a minister in the Morrison Government.", "| Alan Tudge", "* Alan Tudge they vote for YOU"]}]}}