{"wiki_id": "http://www.wikidata.org/entity/Q4708777", "itemLabel": "Alastair Seeley", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alastair_Seeley", "wikipedia_page": {"main": "Alastair Seeley (born 4 October 1979 in Carrickfergus) is a motorcycle road racer. During 2021, he competed in Northern Ireland, winning the Ulster Superbike and Supersport Championships.During 2017, he competed in the inaugural British GP2 category within the British Supersport National Championship riding a Spirit motorcycle having a Triumph 675 engine.He competed in the 2016 British Superbike Championship aboard a BMW S1000R, having switched from Tyco BMW in the Superstock class. He was the 2009 British Superstock champion and the 2011 British Supersport champion, and also has a strong record in road racing. \n\n", "link_mentions": [{"page": "North West 200", "response": ["Alastair Seeley from Northern Ireland, holds the record number of 24 wins. Robert Dunlop was the previous record holder with 15 wins. Michael Rutter won fourteen races. Joey Dunlop (Robert's brother) won thirteen races. Michael Dunlop and William Dunlop (both sons of Robert) have also won races at the North West 200.", "|Alastair Seeley", "!Supersport (I) Alastair Seeley", "!Supersport (II) Alastair Seeley", "!Superstock (II) Alastair Seeley", "!Supersport (II) Alastair Seeley", "!Superstock (I) Alastair Seeley", "!Superbike (I) Alastair Seeley", "!Superstock (II) Alastair Seeley", "! Supersport (I) Alastair Seeley", "! Supersport (II) Alastair Seeley", "! Supersport (I) Alastair Seeley", "! Supersport (II) Alastair Seeley", "! Superbike (I)  Alastair Seeley", "! Supersport (I) Alastair Seeley", "! Superstock (I) Alastair Seeley", "! Supersport (I) Alastair Seeley", "! Superstock (I) Alastair Seeley", "! Superstock (I) Alastair Seeley", "! Supersport (II) Alastair Seeley", "! NW 200 Alastair Seeley", "! Supersport Alastair Seeley", "! Supersport (I) Alastair Seeley", "! NW 200 Alastair Seeley", "! Superstock Alastair Seeley", "! Superstock Alastair Seeley"]}, {"page": "Michael Rutter (motorcyclist)", "response": ["For 2010 Rutter took his Bathams Brewery sponsorship to the Ridersmotorcycles.com team, partnering Martin Jessopp on their Ducatis. He scored the team's first win at Knockhill, in wet conditions. He also led race two at Snetterton, but was stopped by a broken gear lever. He took pole at the Brands Hatch Grand Prix circuit, and was leading race one when it was stopped for rain, ultimately coming second to Alastair Seeley."]}, {"page": "John McGuinness (motorcyclist)", "response": ["McGuinness also contested the British Superstock championship, taking victory at Croft after his team-mate Steve Brogan and champion Alastair Seeley tangled in the final corner.Plater and McGuinness take top spot in Superstock and Supersport races  This was his first short-circuit race win since 2001 in the British Supersport series, which he finished in third place overall.", "At the 2010 North West 200 meeting, McGuinness took his fifth win around the 8.9-mile circuit when he took victory in the Superbike race and he followed this up with third in the feature race behind Alastair Seeley and Stuart Easton. He also took fifth and sixth in the two Supersport races and ninth in the Superstock."]}, {"page": "Ryan Farquhar", "response": ["A security alert and worsening weather conditions meant a lengthy delay to proceedings but eventually the Superbikes came to the line and with another good start, Ryan slotted into second behind Michael Dunlop. The duo exchanged positions on the run to Magherabuoy before Alastair Seeley hit the front. As the newly formed trio passed through Dhu Varren, Farquhar lost the back end twice and he was lucky to stay on. Unbeknown to him, the bike had sprung an oil leak although the bike was still running at full power but further along the coast road, Ryan realised something was wrong and he pulled off the course as soon as it was safe to do so and his race was over. The race was subsequently stopped and a clear up process begun but with rain continuing to fall, the organisers were unable to make the track safe for racing and the decision was ultimately made to abandon the rest of the meeting. "]}, {"page": "2006 North West 200 Races", "response": ["|| Alastair Seeley", "|| Alastair Seeley"]}, {"page": "Josh Brookes", "response": ["For 2011 Brookes switched to the Relentless TAS Suzuki team joined by Alastair Seeley who is competing in British Supersport. He a poor start to the season with a massive crash at Oulton Park which wrecked his bike. By mid-season he started to get good results."]}, {"page": "Bruce Anstey", "response": ["The 2015 North West 200 Races again saw Anstey feature prominently in the opening race where he just missed out on a podium position, coming home in 4th position. An improvement followed in the feature Superbike race when he claimed the third tier behind Alastair Seeley and Ian Hutchinson."]}, {"page": "TAS Racing", "response": ["Laverty departed for the AMA in 2009, allowing Lowry to move onto the superbike alongside Atsushi Watanabe.  Lowry had a strong year, finishing fifth overall and narrowly missing out on the team's maiden podium a few times.  Watanabe struggled for much of the year, amassing only 14 points and never breaking into the top ten.  The team did not enter a Supersport bike for this year, but instead fielded a Superstock GSXR1000 for roads rider Alastair Seeley, who won the championship in dominant fashion.  Seeley won the first 9 rounds, and took 3rd in the tenth before stepping up to the BSB class for the final 2 rounds.  Seeley will be joined by the returning Laverty in BSB for 2010.", "In 2010, Laverty finished strongly, always finishing inside the top 10, including a maiden win for the team in a damp and difficult race 2 at Oulton Park. After Oulton Park, Laverty was fourth in the standings with 65 points after 3 rounds. Alastair Seeley has also been strong, only dropping out of the top 6 once, also getting a podium (3rd) and only narrowly missing out on another 3rd in Oulton Park. Alastair Seeley is currently fifth in the standings. Both are currently on to qualify for the 'Showdown'.", "! Alastair Seeley", "! Alastair Seeley"]}, {"page": "Guy Martin", "response": ["In a further interview with BBC Sport, again conducted by Watson and with event director Mervyn Whyte in attendance, Martin apologized for his comments and whilst he was supportive of the event, describing it as a \"mega event,\" he continued that he was not too stuck on the circuit, and that he simply didn't like chicanes. Watson drew Martin's attention to the fact that the comments by this time had been seen by over 300,000 people on Facebook. Martin made light of the situation, stating that he was \"caught in the heat of the moment, and simply let rip.\" He then questioned why he was generating such attention for his comments, when the main attention should not have been directed towards him but rather directed towards the racing, and to the fact that Alastair Seeley had qualified on pole position and had subsequently gone on to win the opening race."]}, {"page": "2008 AMA Superbike Championship", "response": ["|align=\"left\"|  Alastair Seeley"]}, {"page": "2008 North West 200 Races", "response": ["John McGuinness dominated qualifying for the 250cc race, the first to be contested on race day. McGuinness went round the 8.966 mile circuit in a time of 4'57.791, the only rider to break five minutes and qualified on pole by over 3 seconds from the Hondas of Michael Dunlop and Paul Robinson. Hondas took the first eight places on the grid, with Henrik Voit's Aprilia the best non-Honda in ninth. McGuinness also dominated Superbike practice, being fastest both on Tuesday and on Thursday. Having achieved a 4'25.377 on Tuesday, he lowered that mark by over 3 seconds to a 4'22.342 on Thursday. Michael Rutter on the NW200-backed Ducati qualified 2nd on a 4'22.999, with the rest in the 4'24s or higher. This session sets the grid for both Superbike races. Steve Plater qualified on pole for the Supersport races, recording a lap of 4'33.749 on Thursday to put him half a second clear of Alastair Seeley, who qualified second, with Keith Amor qualifying 3rd, to give three different nations placed in the top three places. Amor would go two places better in the qualifying session for the Superstock race. In the fourth session, he set a time of 4'26.446, which would give him the pole by over 1.5 seconds. Seeley was second with his time of 4'28.029 coming in session three and Rutter was third, with a 4'28.138 set in session four. Michael Wilcox was the clear pacesetter in the 125cc qualifying, setting a pole lap of 5'17.528 and was on top by nearly three seconds from the Aprilia of David Lemon with the Hondas of Mark Curtin, Michael Dunlop and Chris Palmer rounding out the top five. Leo Aldersley's Yamaha was fastest in the 400cc session, which occurred at the same time as the 125cc session as those two races are contested in the one race, albeit separated on track. His 5'15.329 was almost three seconds faster than second placed qualifier and fellow Yamaha rider, Oliver Linsdell. Les Shand's Kawasaki was third, with the best Honda belonging to Manxman David Madsen-Mygdal lining up fourth.", "||  Alastair Seeley", "||  Alastair Seeley", "||  Alastair Seeley"]}, {"page": "2009 British Superbike Championship", "response": ["* Metzeler National Superstock 1000 Championship – Champion: Alastair Seeley", "|style=\"background-color:#ffcccc|  Alastair Seeley", "|style=\"background-color:#ffcccc|  Alastair Seeley", "|align=\"left\"|  Alastair Seeley"]}, {"page": "List of 2009 motorsport champions", "response": ["|  Alastair Seeley"]}, {"page": "2009 North West 200 Races", "response": ["Steve Plater and William Dunlop took double victories at the meeting, with Alastair Seeley winning the other race held. Two races were cancelled due to adverse weather conditions.", "||  Alastair Seeley", "Carrickfergus-born Alastair Seeley dominated the first Tuesday Superstock session, setting a lap of 4:28.754, giving him an advantage of over 2.5 seconds. The lap was also good enough for the third fastest lap in the Superbike/Superstock session. Dungannon's Farquhar was second on a Kawasaki, while an all-Irish top three was completed by Kilkenny's John Walsh on his Yamaha. Cummins was fourth on his Kawasaki while William Dunlop's Yamaha rounded out the top five.", "||  Alastair Seeley", "||  Alastair Seeley", "Fastest Lap: Alastair Seeley, 4' 27.40 on lap 2 ()"]}, {"page": "Stuart Easton", "response": ["Easton returned to BSS in 2013 with the Mar-Train Yamaha team, as he had not fully recovered from his road racing injuries and so found it easier to ride a 600 than a Superbike.  Easton and Alastair Seeley were the men to beat all year, with Easton taking 10 wins to Seeley's 7 and winning the championship by 13 points."]}, {"page": "Ian Hutchinson (motorcyclist)", "response": ["Hutchinson started the 2010 season as part of a two-bike team for Padgetts Motorcycles in the British Supersport Championship, riding a Honda CBR600RR alongside teammate Glen Richards. Hutchinson went to the Isle of Man TT meeting in June looking to increase his win tally from three and after a decent showing at the North West 200, taking victory in the second Supersport race as well as taking two runner-up placings in the other Supersport race, and also the Superstock race finishing behind Alastair Seeley and Keith Amor respectively.", "Hutchinson enjoyed early success in the Superstock race at the North West 200, in which he took the TAS BMW S1000RR to first place, with Peter Hickman in second place and Alastair Seeley in third.", "For the 2016 season, Hutchinson again campaigned the Yamaha YZF-R6 in the Supersport Class. Hutchinson opened his account at the 2016 North West 200 by taking 2nd place behind Alastair Seeley in the opening Supersport race on the TTC Yamaha YZF-R6."]}, {"page": "Ian Lowry", "response": ["TAS signed Michael Laverty and Alastair Seeley for 2010, leaving Lowry without a ride. He signed to race in the Spanish Moto2 championship, in a team ran by former Grand Prix winner Jeremy McWilliams, however the deal fell through. He also tested a BSB Motorpoint Yamaha in April 2010, as a potential short-term replacement for the injured Neil Hodgson. With Hodgson announcing his retirement on 22 April 2010, Lowry was confirmed as his replacement. However, two rounds later Lowry was replaced by Andrew Pitt. He made a BSB return for the Kawasaki SRT team in their one-off entry to the Brands Hatch bank holiday triple-header, and this continued into the Nurburgring World Superbike meeting, his debut in this class."]}, {"page": "British Supersport Championship", "response": ["|  Alastair Seeley"]}, {"page": "2010 British Superbike Championship", "response": ["After a spell in the Superbike World Championship, 2006 and 2007 champion Ryuichi Kiyonari returned to the championship and duly picked up his third championship title, with superior results in the seven-race Showdown element of the championship; winning three races, to add to four he picked up in the first part of the season. His HM Plant Honda teammate Josh Brookes finished as runner-up, taking five victories as he finished 24 points behind Kiyonari. Tommy Hill finished third, having tailed off from a positive start to the season, having finished each of the first six races in the top three placings. He ended the season with four victories and 15 podiums. Michael Laverty finished fourth in the championship with two wins, with the Ducati of Michael Rutter – another double race-winner – finishing in between Laverty and his teammate Alastair Seeley, who took a single victory at Brands Hatch. Three other riders took race victories during the season; Swan Honda racers James Ellison and Stuart Easton took three wins between them, as they finished the season in seventh and ninth places respectively, while Tom Sykes took two wins on a single wildcard outing from his normal World Superbike commitments.", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|align=\"left\"|  Alastair Seeley"]}, {"page": "2010 North West 200 Races", "response": ["| align=center|  Alastair Seeley", "| align=center|3.  Alastair Seeley", "| align=center|  Alastair Seeley", "| colspan=2 align=center| 1.  Alastair Seeley", "| align=center|  Alastair Seeley", "| colspan=2 align=center| 1.  Alastair Seeley", "The first Superbike race was won by John McGuinness followed by Alastair Seeley winning the first 600cc Supersport race. First-time winners at the North West 200 were Paul Robinson in the 125cc race and Keith Amor in the 1000cc Superstock Race. Amor's victory was also the first win for BMW and the first non-Japanese manufacturer to claim a victory since 1997. The Blue Riband event, the North West 200 Superbike Race, produced a second win of the meeting for Alastair Seeley and the first local winner of the race since Phillip McCallen in 1997 . The final race of the meeting, the 600cc Supersport 2 race was won by Ian Hutchinson.", "|  Alastair Seeley 1000cc Suzuki", "|  Alastair Seeley 600cc Suzuki", "|  Alastair Seeley 1000cc Suzuki", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley, 4'26.909 on lap 2 ()", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley, 4' 39.386 on lap 3 ()", "|  Alastair Seeley", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley, 4'26.909 on lap 3 ()", "|  Alastair Seeley"]}, {"page": "Seeley (surname)", "response": ["* Alastair Seeley (born 1979), motorcycle racer, currently competing in the British Superbike Championship"]}, {"page": "2006 AMA Superbike Championship", "response": ["|align=\"left\"|  Alastair Seeley", "|align=\"left\"|  Alastair Seeley"]}, {"page": "British Superbike Championship Support Series", "response": ["| Alastair Seeley", "| Alastair Seeley"]}, {"page": "2011 British Supersport Championship", "response": ["With 2010 Champion Sam Lowes moving to the World Supersport Championship and runner up James Westmoreland moving up to British Superbike Championship the field was wide open for the returning Alastair Seeley riding the new Suzuki Supersport bike. ", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|align=\"left\"|  Alastair Seeley"]}, {"page": "2011 North West 200 Races", "response": ["| align=center|  Alastair Seeley", "| align=center|  Alastair Seeley", "| colspan=2 align=center| 1.  Alastair Seeley", "The first race of the day was a switch from the Superbike's to the less powerful Supersport's due to wet conditions. The race was also reduced from six to five laps with two sighting laps. The race was won by Alastair Seeley after a last lap battle with Cameron Donald. The paddock was evacuated  after the race because of a bomb hoax. The second delayed race of the day was for the Superbike race. However, due to deteriorated conditions a number of riders, including the pole sitter Michael Rutter, decided not to take part. Seeley was leading Michael Dunlop when the race was stopped after one lap due to an oil split. The event was abandon at 17:20 BST.", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley – Suzuki, 4 minutes, 55.835 seconds  109.155 mph on lap 5"]}, {"page": "2012 British Superbike Championship", "response": ["|  Alastair Seeley", "|  Alastair Seeley", "|align=\"left\"|  Alastair Seeley"]}, {"page": "2012 North West 200 Races", "response": ["During practice on Tuesday Alastair Seeley set the fastest times in both the Superbike and Supersport classes. Also during Tuesday practice session Martin Jessopp set a new fastest speed trap record of .", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley – Suzuki, 4 minutes, 49.008 seconds;  on lap 6", "|  Alastair Seeley", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley – Suzuki, 4 minutes, 25.570 seconds;  on lap 4"]}, {"page": "2012 British Supersport Championship", "response": ["The 2012 Motorpoint British Supersport Championship Protected By Datatag season was the 25th running of the British Supersport Championship, the rules have stayed as they were from last year with the two race format providing some intense racing. With champion Alastair Seeley leaving for the British Superbike Championship the field should be closer than ever, Ben Wilson stays to see if he can finally capture the title. It proved to be another closely thought championship with Jack Kennedy and the returning former Supersport champion Glen Richards battling all the way to the final race of the championship, where it was down to the second and final race, in a drama packed race Richards fell at westfield on lap 2, meaning Kennedy only needed to finish to win the title, but on lap 8 Kennedy's dreams were ended with a mechanical problem for his MARtrain Yamaha forcing him to retire and hand Richards the title who was unaware of the events until arriving back in the pits."]}, {"page": "2013 British Supersport Championship", "response": ["|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley"]}, {"page": "Brands Hatch race winners", "response": ["|  Alastair Seeley"]}, {"page": "2015 North West 200 Races", "response": ["|  Alastair Seeley", "Fastest Lap: Alastair Seeley – Suzuki, 4 minutes, 35.818 seconds;  on lap 5", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley – Suzuki, 4 minutes, 36.197 seconds;  on lap 6", "|  Alastair Seeley", "Fastest Lap: Alastair Seeley – BMW, 4 minutes, 24.760 seconds;  on lap 5"]}, {"page": "2016 British Superbike Championship", "response": ["|  Alastair Seeley", "| align=\"left\" |  Alastair Seeley"]}, {"page": "2014 British Supersport Championship", "response": ["|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "|  Alastair Seeley", "| Alastair Seeley"]}, {"page": "2017 British Superbike Championship", "response": ["|style=\"background:#ffcccc;\"|  Alastair Seeley", "| align=\"left\" |  Alastair Seeley"]}]}}