{"wiki_id": "http://www.wikidata.org/entity/Q4707185", "itemLabel": "Alan M. Frieze", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_M._Frieze", "wikipedia_page": {"main": "Alan M. Frieze (born 25 October 1945 in London, England) is a professor in the Department of Mathematical Sciences at Carnegie Mellon University, Pittsburgh, United States. He graduated from the University of Oxford in 1966, and obtained his PhD from the University of London in 1975. His research interests lie in combinatorics, discrete optimisation and theoretical computer science. Currently, he focuses on the probabilistic aspects of these areas; in particular, the study of the asymptotic properties of random graphs, the average case analysis of algorithms, and randomised algorithms. His recent work has included approximate counting and volume computation via random walks; finding edge disjoint paths in expander graphs, and exploring anti-Ramsey theory and the stability of routing algorithms.", "link_mentions": [{"page": "Minimum spanning tree", "response": ["Alan M. Frieze showed that given a complete graph on n vertices, with edge weights that are independent identically distributed random variables with distribution function F satisfying F'(0) > 0, then as n approaches +∞ the expected weight of the MST approaches \\zeta(3)/F'(0), where \\zeta is the Riemann zeta function (more specifically is \\zeta(3) Apéry's constant). Frieze and Steele also proved convergence in probability. Svante Janson proved a central limit theorem for weight of the MST."]}, {"page": "Fulkerson Prize", "response": ["** Martin E. Dyer, Alan M. Frieze and Ravindran Kannan for random-walk-based approximation algorithms for the volume of convex bodies."]}, {"page": "Ravindran Kannan", "response": ["* Alan M. Frieze"]}, {"page": "Frieze (disambiguation)", "response": ["*Alan M. Frieze (born 1945), English mathematician"]}, {"page": "List of people by Erdős number", "response": ["* Alan M. Frieze"]}, {"page": "Convex volume approximation", "response": ["However, a joint work by Martin Dyer, Alan M. Frieze and Ravindran Kannan provided a randomized polynomial time approximation scheme for the problem,"]}, {"page": "Erbalajivasan", "response": ["#REDIRECT Alan M. Frieze"]}, {"page": "Alan Frieze", "response": ["#REDIRECT Alan M. Frieze"]}, {"page": "Apollonian network", "response": [" studied power laws in the degree sequences of a special case of networks of this type, formed by subdividing all triangles the same number of times. They used these networks to model packings of space by particles of varying sizes. Based on their work, other authors introduced random Apollonian networks, formed by repeatedly choosing a random face to subdivide, and they showed that these also obey power laws in their degree distribution   and have small average distances.; . Alan M. Frieze and Charalampos E. Tsourakakis analyzed the highest degrees and the eigenvalues of random Apollonian networks. Andrade et al. also observed that their networks satisfy the small world effect, that all vertices are within a small distance of each other. Based on numerical evidence they estimated the average distance between randomly selected pairs of vertices in an -vertex network of this type to be proportional to , but later researchers showed that the average distance is actually proportional to .;."]}, {"page": "List of International Congresses of Mathematicians Plenary and Invited Speakers", "response": ["*Alan M. Frieze"]}, {"page": "Carol Frieze", "response": ["Frieze grew up in a coal mining village in Nottinghamshire, England, and was the first in her family to go to college. Frieze is married to mathematician Alan M. Frieze. They have two adult children and four grandchildren."]}, {"page": "AofA—International Meeting on Combinatorial, Probabilistic, and Asymptotic Methods in the Analysis of Algorithms", "response": ["* 2005 Barcelona, Spain  (Speakers: Alan M. Frieze; Gábor Lugosi; Nicholas Pippenger; Helmut Prodinger; Robert Sedgewick).  Proceedings."]}]}}