{"wiki_id": "http://www.wikidata.org/entity/Q4707520", "itemLabel": "Alan Percy, 8th Duke of Northumberland", "itemDescription": "British noble (1880-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Percy,_8th_Duke_of_Northumberland", "wikipedia_page": {"main": "Alan Ian Percy, 8th Duke of Northumberland,  (17 April 1880 – 23 August 1930) was a British peer, army officer, and newspaper proprietor.", "link_mentions": [{"page": "Royal National Lifeboat Institution", "response": ["Algernon Percy, 6th Duke of Northumberland was President from 1866(7?) to 1899, and Henry Percy, 7th Duke of Northumberland presided from 1911 until his death in 1918. It was he who founded the Duke of Northumberland's Life-boat Essay Competition in Elementary Schools. Alan Percy, 8th Duke of Northumberland, a British Army officer, first became a member upon the death of his father in 1918, then was elected Vice-President in 1921, and was also president and patron of a couple of branches. He died on 23 August 1930."]}, {"page": "Philip de László", "response": ["* Alan Percy, 8th Duke of Northumberland (1927)"]}, {"page": "List of knights and ladies of the Garter", "response": ["| Alan Percy, 8th Duke of Northumberland"]}, {"page": "Warkworth, Northumberland", "response": ["The castle became a scheduled monument in 1915.  In 1922 Alan Percy, 8th Duke of Northumberland, granted custodianship of the castle to the Office of Works which had been made accountable for the guardianship of ancient monuments. The Duke's Chambers remained under direct control of the Percys. The Office of Works undertook excavations in the moat in 1924 and removed the custodian from the gatehouse. English Heritage, who now manage and maintain the site, succeeded as the castle's custodians in 1984."]}, {"page": "Eustace Percy, 1st Baron Percy of Newcastle", "response": ["Percy was born into a noble family: he was the seventh son of Henry Percy, 7th Duke of Northumberland, and Lady Edith, daughter of George Campbell, 8th Duke of Argyll. Henry Percy, Earl Percy, and Alan Percy, 8th Duke of Northumberland, were his elder brothers. His uncle, the ninth Duke of Argyll, was married to HRH Princess Louise, daughter of Queen Victoria. A niece later married the sixth Duke of Sutherland. He was educated at Eton and Christ Church, Oxford."]}, {"page": "Douglas Douglas-Hamilton, 14th Duke of Hamilton", "response": ["In 1937, he married the Lady Elizabeth Ivy Percy, daughter of Alan Percy, 8th Duke of Northumberland, and had five sons:The Peerage, entry for 14th Duke of Hamilton"]}, {"page": "Hugh Percy, 10th Duke of Northumberland", "response": ["Hugh Algernon Percy, 10th Duke of Northumberland (6 April 191411 October 1988), was the son of Alan Percy, 8th Duke of Northumberland, and Lady Helen Gordon-Lennox. He succeeded to the dukedom of Northumberland in 1940, when his brother Henry, 9th Duke, was killed in Belgium in World War II during the retreat to Dunkirk.CWGC entry"]}, {"page": "George Percy, 9th Duke of Northumberland", "response": ["Henry George Alan Percy, 9th Duke of Northumberland (15 July 1912 – 21 May 1940) was the son of Alan Percy, 8th Duke of Northumberland and Lady Helen Gordon-Lennox."]}, {"page": "Alan Ian Percy, 8th Duke of Northumberland", "response": ["#REDIRECT Alan Percy, 8th Duke of Northumberland"]}, {"page": "John Egerton, 6th Duke of Sutherland", "response": ["Sutherland married Lady Diana Percy (23 November 1917 – 16 June 1978), daughter of Alan Percy, 8th Duke of Northumberland, on 29 April 1939. Following the death of his first wife, on 16 August 1979 he married Evelyn Moubray,  a former interior decorator who shared his love of fishing. There were no children from either marriage."]}, {"page": "Lord Lieutenant of Northumberland", "response": ["*Alan Percy, 8th Duke of Northumberland 19 July 1918 – 23 August 1930"]}, {"page": "Elizabeth Douglas-Hamilton, Duchess of Hamilton", "response": ["Elizabeth Ivy Douglas-Hamilton, Duchess of Hamilton, OBE, DL (25 May 1916 – 16 September 2008), was the daughter of Alan Percy, 8th Duke of Northumberland (1880–1930) and his wife, Helen."]}, {"page": "Henry Percy, Earl Percy", "response": ["Percy was the eldest son of Henry Percy, 7th Duke of Northumberland, and his wife Lady Edith, daughter of George Campbell, 8th Duke of Argyll. Alan Percy, 8th Duke of Northumberland, and Eustace Percy, 1st Baron Percy of Newcastle, were his younger brothers.thepeerage.com Henry Algernon George Percy, Earl Percy"]}, {"page": "List of chancellors of Durham University", "response": ["* 1929–1930 Alan Percy, 8th Duke of Northumberland"]}]}}