{"wiki_id": "http://www.wikidata.org/entity/Q4708028", "itemLabel": "Alan West", "itemDescription": "English footballer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_West_(footballer)", "wikipedia_page": {"main": "Alan West (born 18 December 1951 in Hyde, Cheshire) is an English retired football central midfielder. He attended Greenfield Street Boys' Secondary Modern School in Hyde, Cheshire.\nWest began his career at Burnley, a product of the club's prolific youth system. In 1973, he was set for a move to Sunderland but was told by medical staff that he had a condition which meant he would be crippled if he continued playing. He believed there was nothing wrong, and moved to Luton Town that year.\nHe spent eight seasons at Luton Town, becoming an important player as well as club captain. West made his name as a cultured midfielder who though not prolific was a fine passer of the ball. He was ever-present in his one top-flight season with the Hatters (1974–75). In 1976, he moved the Minnesota Kicks of the North American Soccer League, playing with the team through the 1979 season. Moving to Millwall in 1981, West spent two seasons there before moving on to non-League football - as manager of Isthmian League strugglers Hitchin Town, being sacked in September 1988 after a poor start to the season.\nWest is now a pastor at a local church in Luton, named Luton Christian Fellowship. He is also the Club Chaplain at Luton Town Football Club.", "link_mentions": [{"page": "Hyde, Greater Manchester", "response": ["*Alan West (born 1951 in Hyde), footballer, central midfielder for Burnley and Luton Town"]}, {"page": "Minnesota Kicks", "response": ["In 1977, the Kicks won the Western Division again, and averaged 32,775 fans, second only to the New York Cosmos.Steve Holroyd, The Year in American Soccer – 1977, http://homepages.sover.net/~spectrum/year/1977.html  The Kicks were again led by Alan Willey with 14 goals, while midfielder Alan West was named to the All-Star team. The Kicks lost in the playoffs to Seattle.", "1976   Alan Willey, Ace Ntsoelengoe, Peter Brine, Alan Merrick (Captain), Ron Webster, Mike Flater, Chaka Ngcobo, Geoff Barnett, Sam Bick, Ron Futcher, Alan West, Doug Brooks, Smith Eggleston, Nick Owcharuk, Ade Coker, Tom Howe, Jeff Solem, Steve Litt, Frank Spraggon, Peter Short. Freddie Goodwin (Coach), Gary Smith (Trainer), Dave Nowicki (Ass't Trainer), Dr. James Priest (Team Physician).", "1979   Willie Morgan, Gary Vogel, Tony Want, Alan Merrick, Ace Ntsoelengoe, Alan West, Chico Hamilton, Volkmar Gross, Mark Moran, Geoff Barnett, Bjorn Nordqvist (Captain), Alan Willey, Tino Lettieri, Ricardo Alonso, Steve Litt, Greg Villa, Brian Zins, Ron Futcher, Mike McLenaghan, Tim Twellman. Roy McCrohan (Head Coach), Gary Smith (Head Trainer), Jim Mulcahy (Ass't Trainer), Dr. James Priest (Team Physician), Freddie Goodwin (President).", "* 1977 Alan West", "* 1976 Ron Webster & Alan West"]}, {"page": "Brian Horton", "response": ["Horton transferred to Luton Town in August 1981, as the club were competing in the Second Division under the stewardship of David Pleat. He was signed to replace Alan West, who had been sold on to Millwall. Horton was installed as captain and told to play a more attacking midfield role than he had previously been used to, playing in between a midfield three with Lil Fuccillo and Ricky Hill. He was again promoted into the top-flight, as the \"Hatters\" topped the Second Division table in 1981–82 by an eight-point margin, some 18 points clear of fourth-place Sheffield Wednesday. He was named on the PFA Team of the Year for the third time in his career, alongside teammates Kirk Stephens, Ricky Hill, and David Moss."]}, {"page": "Alan West", "response": ["Alan West may refer to:", "*Alan West (footballer) (born 1951), English midfielder", "*Alan West, Baron West of Spithead (born 1948), British politician and admiral in the Royal Navy", "*Alan West, former vocalist of English death metal band Bolt Thrower"]}, {"page": "West (name)", "response": ["* Alan West (footballer) (born 1951), English footballer", "* Alan West, Baron West of Spithead (born 1948), Royal Navy admirals and British peer"]}]}}