{"wiki_id": "http://www.wikidata.org/entity/Q4714090", "itemLabel": "Alec C. Snowden", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alec_C._Snowden", "wikipedia_page": {"main": "Alec Crawford Snowden (1901–1983) was a British film producer.He was the son of Agnes Adamson Wallace née Crawford and the novelist J. Keighley Snowden.", "link_mentions": [{"page": "The Intimate Stranger (1956 film)", "response": ["The Intimate Stranger is a 1956 British film-noir, drama film directed by Joseph Losey, under the pseudonym Alec C. Snowden, and starring Richard Basehart, Mary Murphy, Constance Cummings and Roger Livesey. It was released in the U.S. as Finger of Guilt."]}, {"page": "Timeslip (1955 film)", "response": ["Timeslip (known as The Atomic Man in the United States) is a 1955 British black-and-white science fiction film directed by Ken Hughes and starring Gene Nelson and Faith Domergue. Produced by Alec C. Snowden, it is based on a script by Charles Eric Maine, who also wrote Spaceways.TIMESLIP"]}, {"page": "Scotland Yard (film series)", "response": ["The earlier films were produced by Alec C. Snowden, who was succeeded by Jack Greenwood. Directors included Ken Hughes and Montgomery Tully. The principal character in each film is a Detective Inspector, played by a variety of actors but most frequently by Russell Napier (usually portraying DI Duggan). Many of the films feature, in supporting roles, actors later to become well-known. They include Jill Bennett, Peter Arne, Harry H. Corbett, James Villiers, Arthur Lowe, Peter Halliday, Wilfrid Brambell, Rita Webb, Peter Bowles and Roger Delgado."]}, {"page": "The Key Man (1957 film)", "response": ["The Key Man (released in the USA as Life at Stake) is a 1957 British B movie. The film was shot in black and white during a three week period in 1957 in response to an initiative by Anglo-Amalgamated to increase the number of British made B movies available. Directed by Montgomery Tully, the screenplay was adapted from his own original story by Julian MacLaren-Ross. MacLaren-Ross had been persuaded by producer Alec C. Snowden to write a script in late 1956 and after some doubts about the project delivered a screenplay to Snowden in January 1957, filming was started and completed the next month."]}]}}