{"wiki_id": "http://www.wikidata.org/entity/Q47162845", "itemLabel": "Alex Bayliss", "itemDescription": "British archaeologist, Head of Scientific Dating at Historic England", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Bayliss", "wikipedia_page": {"main": "Alexandra Bayliss is a British archaeologist and academic. She is Head of Scientific Dating at Historic England, and a part-time Professor of Archaeological Science at the University of Stirling in Scotland. Her research focuses on the construction of exact chronologies of European Neolithic archaeological sites, through the application of Bayesian statistical modelling of radiocarbon dates.\nPartnered with Alasdair Whittle from Cardiff University, Bayliss has conducted extensive research on causewayed and related enclosures in the United Kingdom and Ireland. The results of that study, a book co-authored by Bayliss, Whittle and Frances Healey, Cardiff University, titled Gathering Time: dating the early Neolithic Enclosures of Southern Britain and Ireland was named the British Archaeological Awards book of the year in 2012.\nFrom 2012 to 2017, Bayliss and Whittle led a project funded by the European Research Council (ERC). The project named \"The Times of Their Lives\" was a series of studies in precise chronologies and their implications, across several regions and phases of Neolithic Europe.Bayliss has conducted research on additional historic sites in the United Kingdom, Europe and Turkey, using the same methodology of statistical modelling of radiocarbon dates.", "link_mentions": [{"page": "The Trundle", "response": ["The Trundle was one of the sites included in Gathering Time, a project funded by English Heritage and the Arts and Humanities Research Council to reanalyze the radiocarbon dates of nearly 40 causewayed enclosures, using Bayesian analysis.  The authors, Alasdair Whittle, Frances Healy, and Alex Bayliss, published the results in 2011.Healy, Bayliss, and Whittle (2011), pp. 232–239.  Some radiocarbon dates had been obtained from animal bone samples and published in 1988, and these were included.Drewett, Rudling & Gardiner (1988), p. 35.  Four additional samples were taken from finds from the earlier digs.  The limited number of samples meant that it was not possible to construct a chronology with high confidence, but the results suggest that the inner ditch dates to after 3900–3370 BC; the second ditch to after 3650–3520 BC; and the spiral ditch to after 3940–3370 BC.  Overall these results imply a mid-fourth millennium BC construction date for the Neolithic earthworks."]}, {"page": "List of female scientists in the 21st century", "response": ["* Alex Bayliss British archaeologist"]}, {"page": "List of female scientists in the 20th century", "response": ["* Alex Bayliss British archaeologist   "]}]}}