{"wiki_id": "http://www.wikidata.org/entity/Q471879", "itemLabel": "Joss Ackland", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Joss_Ackland", "wikipedia_page": {"main": "Sidney Edmond Jocelyn \"Joss\" Ackland, CBE (born 29 February 1928) is an English actor who has appeared in more than 130 film and television roles. He was nominated for the BAFTA Award for Best Actor in a Supporting Role for portraying Jock Delves Broughton in White Mischief (1987).", "link_mentions": [{"page": "A Little Night Music", "response": ["The musical premiered in the West End at the Adelphi Theatre on April 15, 1975, and starred Jean Simmons, Joss Ackland, David Kernan, Liz Robertson, and Diane Langton, with Hermione Gingold reprising her role as Madame Armfeldt. It ran for 406 performances. During the run, Angela Baddeley replaced Gingold, and Virginia McKenna replaced Simmons."]}, {"page": "C. S. Lewis", "response": ["Lewis has been the subject of several biographies, a few of which were written by close friends, such as Roger Lancelyn Green and George Sayer. In 1985, the screenplay Shadowlands by William Nicholson dramatized Lewis's life and relationship with Joy Davidman Gresham. It was aired on British television starring Joss Ackland and Claire Bloom. This was also staged as a theatre play starring Nigel Hawthorne in 1989 and made into the 1993 feature film Shadowlands starring Anthony Hopkins and Debra Winger."]}, {"page": "February 29", "response": ["*1928 – Joss Ackland, English actor"]}, {"page": "The Screwtape Letters", "response": ["Both \"The Screwtape Letters\" and \"Screwtape Proposes a Toast\" were released on audio cassette and CD, with narrations by John Cleese, Joss Ackland, and Ralph Cosham.https://www.amazon.com/The-Screwtape-Letters-audiobook/dp/B000ICM1G6, Cleese's recording was a Grammy Award Finalist for Best Spoken Word."]}, {"page": "Ingrid Bergman", "response": ["On 29 August 1982 at 12:00 am, her 67th birthday, Ingrid Bergman died in London from breast cancer. Her ex-husband, Lars Schmidt and three others were there, where they drank their last toast to her hours earlier. A copy of The Little Prince was at her bedside, opened to a page near the end. The memorial service was held in Saint Martin-in-the-Fields church in October with twelve hundred mourners in attendance. Her children were in attendance. In addition to the Rossellinis, relatives from Sweden, Liv Ullmann, John Gielgud, Wendy Hiller, Birgit Nilsson, Joss Ackland and many others attended. As part of the service, quotations from Shakespeare were read. Musical selections included \"This Old Man\" from The Inn of the Sixth Happiness, a piece by Beethoven, and strains of \"As Time Goes By\". Bergman's grandson, Justin Daly, recalled the event as hundreds of photographers were waiting and taking pictures. One of the cameras hit on his head. He added, \"In the middle of all this chaos, I could sense that she wasn't just my grandmother. She belonged to everyone else. She belonged to the world.\""]}, {"page": "K-19: The Widowmaker", "response": ["* Joss Ackland as Marshal Zolentsov, Defense Minister"]}, {"page": "Six Degrees of Kevin Bacon", "response": ["Gotts wrote to 300 actors asking to take their pictures, and received permission only from Joss Ackland. Ackland then suggested that Gotts photograph Greta Scacchi, with whom he had appeared in the film White Mischief. Gotts proceeded from there, asking each actor to refer him to one or more friends or colleagues. Eventually, Christian Slater referred him to Bacon. Gotts' photograph of Bacon completed the project, eight years after it began. Gotts published the photos in a book, Degrees (), with text by Alan Bates, Pierce Brosnan, and Bacon."]}, {"page": "Pet Shop Boys", "response": ["Towards the end of 1987, Pet Shop Boys started work on an hour-long film that would incorporate the songs from Please and Actually. Working with director Jack Bond, the short film grew into a full-scale movie, It Couldn't Happen Here, starring Barbara Windsor, Joss Ackland and Gareth Hunt. The film was eventually released in 1988 to mixed reviews. Footage from the film was also used for the music video to \"Always on My Mind\", now released as a single on 30 November; it became both the duo's third number one single in the UK and the Christmas number one single for 1987, beating \"Fairytale of New York\" by The Pogues and Kirsty MacColl. In November 2004, The Daily Telegraph newspaper placed Pet Shop Boys' version of \"Always on My Mind\" at number two in a list of the fifty greatest cover versions of all time."]}, {"page": "Henri Matisse", "response": ["* Matisse was portrayed by Joss Ackland in the 1996 Merchant Ivory production of Surviving Picasso."]}, {"page": "Bideford", "response": ["Sir John Nott, the former Secretary of State for Defence, was born in the town. Writer Roy Kift was born in the town in 1943, as was Paul Seed, a television director and actor. Stuart Anstis, one time lead guitarist with black metal band Cradle of Filth went to school in Bideford, and now runs a guitar shop there. Derry Brownson, formerly of the band EMF is frequently seen around town, and helps run a music studio in the town called Yard 1 studios. Actor Joss Ackland lives near Bideford. T. V. Smith and Gaye Advert, from the punk band The Adverts, are also from the town."]}, {"page": "Dorothy Tutin", "response": ["*Fonsia Dorsey in The Gin Game, Savoy Theatre, March 1999, co-starring with Joss Ackland"]}, {"page": "Unseen University", "response": ["In the Cosgrove Hall animation of Soul Music he was voiced by Graham Crowden. In 2007's miniseries adaptation of Hogfather he was played by Joss Ackland, and in the 2010 adaptation of Going Postal he was portrayed by Timothy West."]}, {"page": "Death of a Salesman", "response": ["* 1966 (BBC): Starring Rod Steiger, Betsy Blair, Tony Bill, Brian Davies, and Joss Ackland and directed by Alan Cooke."]}, {"page": "Murder on the Orient Express", "response": ["John Moffatt starred as Poirot in a five-part BBC Radio 4 adaptation by Michael Bakewell, directed by Enyd Williams, and originally broadcast from 28 December 1992 – 1 January 1993. André Maranne appeared as Bouc, Joss Ackland as Ratchett/Cassetti, Sylvia Syms as Mrs Hubbard, Siân Phillips as Princess Dragomiroff, Francesca Annis as Mary Debenham, and Peter Polycarpou as Dr Constantine."]}, {"page": "2000 in film", "response": ["| Passion of Mind || Paramount Classics || Alain Berliner (director); Ronald Bass, David Field (screenplay); Demi Moore, Stellan Skarsgård, William Fichtner, Peter Riegert, Sinead Cusack, Julianne Nicholson, Joss Ackland, Gerry Bamman, Eloise Eonnet || Romance, Drama || Live action"]}, {"page": "2002 in film", "response": ["| K-19: The Widowmaker || Paramount Pictures / Intermedia / National Geographic Feature Films || Kathryn Bigelow (director); Christopher Kyle (screenplay); Harrison Ford, Liam Neeson, Peter Sarsgaard, Joss Ackland, John Shrapnel, Donald Sumpter, Tim Woodward, Steve Nicolson, Ravil Isyanov, Christian Camargo, George Anton, James Francis Ginty, Lex Shrapnel, Ingvar Eggert Sigurðsson, Sam Spruell, Sam Redford, Peter Stebbings, Shaun Benson, Kristen Holden-Ried, Dmitry Chepovetsky, Tygh Runyan, Jacob Pitts, Michael Gladis, JJ Feild, Peter Oldring, Joshua Close, Jeremy Akerman || Thriller || Live Action"]}, {"page": "1995 in film", "response": ["| Citizen X || HBO Pictures / Citadel Entertainment || Chris Gerolmo (director/screenplay); Stephen Rea, Donald Sutherland, Max von Sydow, Jeffrey DeMunn, Joss Ackland, John Wood, Radu Amzulescu, Imelda Staunton, Andras Balint, Geza Balkay, Ion Caramitru, Jozsa Elek, Marton Elek, Zoltan Gera, Chris Gerolmo, Czeslaw Grocholski, Ralph Nossek, Tusse Silberg || Biography, Crime, Drama || Live action", "| A Kid in King Arthur's Court || Walt Disney Pictures / Tapestry Films / Trimark Pictures || Michael Gottlieb (director); Michael Part, Robert L. Levy (screenplay); Thomas Ian Nicholas, Joss Ackland, Art Malik, Paloma Baeza, Kate Winslet, Daniel Craig, David Tysallas Ratan, Ron Moody, Barry Stanton, Michael Mehlnan, Melanie Oettinger, Rebecca Denton, Michael Kelly, Louise Rosner, Paul Rosner, Bela Unger, Shane Rimmer, Tim Wickham, Daniel Bennett, Debora Weston, Vincent Marzello, Catherine Blake, J. P. Guerin || Comedy, Family || Live action", "*A Kid in King Arthur's Court, starring Thomas Ian Nicholas, Joss Ackland, Kate Winslet"]}, {"page": "Don Camillo and Peppone", "response": ["A BBC Radio English-language radio dramatization of The Little World of Don Camillo was broadcast in 2001 starring Alun Armstrong as Don Camillo, John Moffatt as the Bishop, Shaun Prendergast as Peppone and Joss Ackland as God, and rebroadcast in July 2010 on BBC Radio 7."]}, {"page": "1996 in film", "response": ["| Deadly Voyage || HBO NYC Productions || John Mackenzie (director); Stuart Urban (screenplay); Omar Epps, Joss Ackland, Sean Pertwee, David Suchet, Andrew Divoff, Jean-Claude La Marre, Adewale Akinnuoye-Agbaje, Ilia Volok, Roman Varshavsky, Chiwetel Ejiofor, Omanza Eugene Shaw, Henry Nartey, Oscar Provencal, Wakefield Ackuaku, David Dontoh, Maxine Burth, Michael Byrne, Ravil Isyanov, Tomas Lukes, Zillah Yao || Thriller || Live action", "| Surviving Picasso || Warner Bros. Pictures || James Ivory (director); Ismael Merchant, David L. Wolper (screenplay); Anthony Hopkins, Natascha McElhone, Julianne Moore, Joss Ackland, Peter Eyre, Jane Lapotaire, Joseph Maher, Bob Peck, Diane Venora, Joan Plowright, Dennis Boutsikaris, Peter Gerety, Susannah Harker, Dominic West, Laura Aikman, Nigel Whitmey, Leon Lissek, Andreas Wisniewski, Anthony Milner, Tom Fisher, Vernon Dobtcheff, Hamish McColl, Sandor Eles, Brigitte Kahn, Olegar Fedoro, Rose English, Judith Sharp || Period, Drama || Live action", "| D3: The Mighty Ducks || Walt Disney Pictures || Robert Lieberman (director); Steven Brill, Jim Burnstein (screenplay); Emilio Estevez, Jeffrey Nordling, Heidi Kling, Joss Ackland, Joshua Jackson, David Selby, Margot Finley, Elden Henson, Shaun Weiss, Vincent Larusso, Matt Doherty, Garette Ratliff Henson, Marguerite Moreau, Michael Cudlitz, Christopher Orr, Aaron Lohr, Colombe Jacobsen, Kenan Thompson, Mike Vitar, Ty O'Neal, Justin Wong, Scott Whyte, Benjamin Salisbury, Paul Kariya || Sports, Comedy, Drama || Live action"]}, {"page": "1998 in film", "response": ["| Swept from the Sea || TriStar Pictures / Phoenix Pictures || Beeban Kidron (director); Tim Willocks (screenplay); Vincent Pérez, Rachel Weisz, Ian McKellen, Joss Ackland, Kathy Bates, Tony Haygarth, Fiona Victory, Tom Bell, Zoë Wanamaker || Drama || Live action", "| My Giant || Columbia Pictures / Castle Rock Entertainment || Michael Lehmann (director); Billy Crystal, David Seltzer (screenplay); Billy Crystal, Gheorghe Mureșan, Kathleen Quinlan, Joanna Pacuła, Zane Carney, Dan Castellaneta, Steven Seagal, Doris Roberts, Jere Burns, Raymond O'Connor, Rider Strong, Lorna Luft, Harold Gould, Carl Ballantine, Eric Lloyd, Ajay Naidu, Estelle Harris, Philip Sterling, Max Goldblatt, Michael Papajohn, Heather Thomas, Rick Overton, Richard Portnow, Nicki Micheaux, Lawrence Pressman, Joss Ackland, Verne Troyer || Comedy, Drama || Live action"]}, {"page": "1994 in film", "response": ["|The Princess and the Goblin || Hemdale Film Corporation / J&M Entertainment || József Gémes (director); Robin Lyons (screenplay); Joss Ackland, Claire Bloom, Roy Kinnear, Sally Ann Marsh, Rik Mayall, Peggy Mount || Adventure, Fantasy || Animation"]}, {"page": "1990 in film", "response": ["| The Hunt for Red October || Paramount Pictures || John McTiernan (director); Larry Ferguson, Donald E. Stewart (screenplay); Sean Connery, Alec Baldwin, Scott Glenn, James Earl Jones, Sam Neill, Jeffrey Jones, Joss Ackland, Richard Jordan, Tim Curry, Peter Firth, Ronald Guttman, Stellan Skarsgård, Fred Dalton Thompson, Courtney B. Vance, Anthony Peck, Daniel Davis, Tomas Arana, Peter Zinner, Boris Lee Krutonog, Michael Welden || Action, Thriller || Live action"]}, {"page": "1989 in film", "response": ["| Lethal Weapon 2 || Warner Bros. Pictures / Silver Pictures || Richard Donner (director); Jeffrey Boam (screenplay); Mel Gibson, Danny Glover, Joe Pesci, Joss Ackland, Derrick O'Connor, Patsy Kensit, Darlene Love, Steve Kahan, Mark Rolston, Jenette Goldstein, Dean Norris, Nestor Serrano, Mary Ellen Trainor, Kenneth Tigar, Pat Skipper, Bruce Young, Traci Wolfe, Juney Smith || Action || Live action"]}, {"page": "1988 in film", "response": ["| It Couldn't Happen Here || Liberty Films || Jack Bond (director/screenplay); Neil Tennant, Chris Lowe, Joss Ackland, Neil Dickson, Gareth Hunt, Barbara Windsor || Musical || Live action"]}, {"page": "1987 in film", "response": ["| The Sicilian || 20th Century Fox / Gladden Entertainment || Michael Cimino (director); Steve Shagan, Gore Vidal (screenplay); Christopher Lambert, Terence Stamp, Joss Ackland, John Turturro, Barbara Sukowa, Richard Bauer, Giulia Boschi, Ray McAnally, Barry Miller, Andreas Katsulas, Michael Wincott, Ramon Bieri, Oliver Cotton, Joe Regalbuto, Aldo Ray, Derrick Branche || Action || Live action", "* White Mischief, directed by Michael Radford, starring Greta Scacchi, Charles Dance, Joss Ackland, Trevor Howard, John Hurt - (U.K.)"]}, {"page": "1993 in film", "response": ["| Nowhere to Run || Columbia Pictures || Robert Harmon (director); Joe Eszterhas, Leslie Bohem, Randy Feldman (screenplay); Jean-Claude Van Damme, Rosanna Arquette, Kieran Culkin, Tiffany Taubman, Joss Ackland, Ted Levine, Edward Blatchford, Anthony Starke, James Greene || Action, Drama || Live action", "*Nowhere to Run, starring Jean-Claude Van Damme, Rosanna Arquette, Ted Levine, Kieran Culkin, Joss Ackland"]}, {"page": "1992 in film", "response": ["| Once Upon a Crime || Metro-Goldwyn-Mayer || Eugene Levy (director); Rodolfo Sonego, Giorgio Arlorio, Stefano Strucchi, Luciano Vincenzoni, Charles Shyer, Nancy Meyers, Steve Kluger (screenplay); John Candy, James Belushi, Cybill Shepherd, Sean Young, Richard Lewis, Ornella Muti, Giancarlo Giannini, George Hamilton, Joss Ackland, Ann Way, Caterina Boratto, Elsa Martinelli, Eugene Levy || Comedy, Crime || Live action", "| The Mighty Ducks || Walt Disney Pictures || Stephen Herek (director); Steven Brill (screenplay); Emilio Estevez, Joss Ackland, Lane Smith, Heidi Kling, Josef Sommer, Joshua Jackson, Elden Henson, Shaun Weiss, Brandon Adams, M. C. Gainey, Matt Doherty, J. D. Daniels, Aaron Schwartz, Garette Ratliff Henson, Marguerite Moreau, Vincent Larusso, Jussie Smollett, Danny Tamberelli, Jane Plank, Michael Ooms, Casey Graven, Hal Fort Atkinson III, Basil McRae, Mike Modano, John Beasley, Steven Brill, George Coe, Brock Pierce || Sports, Comedy || Live action"]}, {"page": "1991 in film", "response": ["| Bill & Ted's Bogus Journey || Orion Pictures / Nelson Entertainment || Pete Hewitt (director); Chris Matheson, Ed Solomon (screenplay); Keanu Reeves, Alex Winter, William Sadler, Joss Ackland, George Carlin, Chelcie Ross, Pam Grier, Annette Azcuy, Sarah Trigger, Hal Landon Jr., Amy Stock-Poynton, Ed Gale, Arturo Gil, Tom Allard, Michael \"Boogaloo Shrimp\" Chambers, Bruno \"Taco\" Falcon, Frank Welker, Primus || Sci-Fi, Comedy || Live action"]}, {"page": "1985 in film", "response": ["| A Zed & Two Noughts || Artificial Eye / Channel Four Films || Peter Greenaway (director/screenplay); Andréa Ferréol, Brian Deacon, Eric Deacon, Frances Barber, Joss Ackland || Comedy, Drama || Live action"]}, {"page": "1980 in film", "response": ["| Caligula || Produzioni Atlas Consorziate (P.A.C.) / Analysis Film Releasing Corporation / Penthouse Films International / Felix Cinematografica || Tinto Brass (director/screenplay); Giancarlo Lui, Bob Guccione (directors); Malcolm McDowell, Teresa Ann Savoy, Helen Mirren, Peter O'Toole, John Gielgud, Guido Mannari, Patrick Allen, Giancarlo Badessi, Adriana Asti, Leopoldo Trieste, Paolo Bonacelli, Joss Ackland, John Steiner, Mirella D'Angelo, Richard Parets, Osiride Pevarello, Anneka Di Lorenzo, Bruno Brive, Paula Mitchell, Donato Placido, Lori Wagner, Valerie Rae Clark, Susanne Saxon, Jane Hargrave, Carolyn Patsis, Bonnie Dee Wilson || Historical, Drama || Live action", "| Rough Cut || Paramount Pictures || Don Siegel (director); Larry Gelbart (screenplay); Burt Reynolds, Lesley-Anne Down, David Niven, Timothy West, Patrick Magee, Al Matthews, Susan Littler, Joss Ackland, Isabel Dean, Wolf Kahler, Andrew Ray, Julian Holloway, Douglas Wilmer, Geoffrey Russell, Ronald Hines, David Howey, Frank Mills, Roland Culver, Alan Webb, Cassandra Harris, Sue Lloyd, Cyril Appleton || Heist || Live action", "| The Apple || The Cannon Group / NF Geria II / Filmgesellschaft mbH || Menahem Golan (director/screenplay); Catherine Mary Stewart, Allan Love, Grace Kennedy, George Gilmour, Joss Ackland, Vladek Sheybal, Ray Shell, Miriam Margoyles, Derek Deadman, George S. Clinton, Finola Hughes, Femi Taylor, John Chester, Michael Logan, Francesca Poston, Leslie Meadows, Gunter Notthoff, Clem Davies, Coby Recht, Iris Recht || Sci-Fi, Musical, Comedy || Live action "]}, {"page": "1979 in film", "response": ["| Saint Jack || New World Pictures || Peter Bogdanovich (director/screenplay); Howard Sackler, Paul Theroux (screenplay); Ben Gazzara, Denholm Elliott, James Villiers, Joss Ackland, Rodney Bewes, Mark Kingston, Lisa Lu, George Lazenby, Peter Bogdanovich, Monika Subramaniam, Judy Lim, Joseph Noël || Crime, Comedy || Live Action", "| Caligula || Produzioni Atlas Consorziate (P.A.C.) / Analysis Film Releasing Corporation / Penthouse Films International / Felix Cinematografica || Tinto Brass (director/screenplay); Giancarlo Lui, Bob Guccione (directors); Malcolm McDowell, Teresa Ann Savoy, Helen Mirren, Peter O'Toole, John Gielgud, Guido Mannari, Patrick Allen, Giancarlo Badessi, Adriana Asti, Leopoldo Trieste, Paolo Bonacelli, Joss Ackland, John Steiner, Mirella D'Angelo, Richard Parets, Osiride Pevarello, Anneka Di Lorenzo, Bruno Brive, Paula Mitchell, Donato Placido, Lori Wagner, Valerie Rae Clark, Susanne Saxon, Jane Hargrave, Carolyn Patsis, Bonnie Dee Wilson || Historical, Drama || Live Action"]}, {"page": "1928 in film", "response": ["**Joss Ackland, English actor"]}, {"page": "Lady Jane (1986 film)", "response": ["* Joss Ackland as Sir John Bridges"]}, {"page": "Mansfield Smith-Cumming", "response": ["*He was portrayed by Joss Ackland in the BBC1 TV series Ashenden in 1991."]}, {"page": "BBC Television Shakespeare", "response": ["Prior to the screening of the first episode, UK publicity for the series was extensive, with virtually every department at the BBC involved. Once the series had begun, a major aspect of the publicity campaign involved previews of each episode for the press prior to its public broadcast, so reviews could appear before the episode aired; the idea being that good reviews might get people to watch who otherwise would not. Other publicity 'events' included a party to celebrate the commencement of the third season, at The George Inn, Southwark, near the site of the Globe Theatre, and a similar party at the start of the sixth season, in Glamis Castle, which was attended by Ian Hogg, Alan Howard, Joss Ackland, Tyler Butterworth, Wendy Hiller, Patrick Ryecart and Cyril Cusack, all of whom were on hand for interviews by the many invited journalists.Willis, p. 35."]}, {"page": "Maeve Binchy", "response": ["*How About You (2007) – Irish film based on the short story \"How About You\" (sometimes published as \"The Hard Core\") and starring Vanessa Redgrave, Joss Ackland, Brenda Fricker, and Imelda Staunton, from the short story collection titled This Year It Will Be Different: And Other Stories (1996)."]}, {"page": "Evita (musical)", "response": ["| align=\"center\" | Joss Ackland", "Evita opened at the Prince Edward Theatre on 21 June 1978 and closed on 18 February 1986, after 3,176 performances.Evita at Prince Edward Theatre thisistheatre.com, retrieved 17 March 2010. Elaine Paige played Eva with David Essex as Che, Joss Ackland as Perón, and Siobhán McCarthy as Mistress.Citron, p. 232. Paige was selected from among many hopefuls, after Julie Covington declined the role. The production was directed by Harold Prince, choreographed by Larry Fuller, and produced by Robert Stigwood. Paige was succeeded by Marti Webb, Stephanie Lawrence, Siobhán McCarthy (who had played The Mistress when the show opened), Jacquey Chappell and ultimately, Kathryn Evans with Maria Morgan.Inverne, J. \"Jack Tinker: A Life in Review\", p. 21, Oberon, 1997.", "* Joss Ackland"]}, {"page": "The Ascent of Man", "response": ["The 13-part series was shot on 16 mm film. Executive producer was Adrian Malone; film directors were Dick Gilling, Mick Jackson, David Kennard and David Paterson. Quotations were read by actors Roy Dotrice and Joss Ackland. Series music was by Dudley Simpson with Brian Hodgson and the BBC Radiophonic Workshop. Additional music includes work by Pink Floyd and the Moody Blues, among others. Apart from Bronowski, the only other named people appearing are the sculptor Henry Moore and Polish Auschwitz survivor Stefan Borgrajewicz."]}, {"page": "Jackanory", "response": ["*Joss Ackland (5 programmes reading Danny, the Champion of the World)"]}, {"page": "J. R. Hartley", "response": ["The advertisement shows an elderly gentleman (acted by Norman Lumsden) asking in several second hand bookshops for  \"Fly Fishing by J. R. Hartley\". No bookshop has it, and he goes home dejected. His daughter, sympathising, hands him the Yellow Pages; and one of the shops he phones has a copy. He is delighted. The unheard questioner asks for his name and he responds at dictation speed: 'My name? Oh, yes, it's J. R. Hartley.' The advertisement ends by promoting the Yellow Pages, the voiceover provided by actor Joss Ackland."]}, {"page": "Bill & Ted's Bogus Journey", "response": ["* Joss Ackland as Chuck De Nomolos"]}, {"page": "A Kid in King Arthur's Court", "response": ["* Joss Ackland as King Arthur"]}, {"page": "Kirkby", "response": ["Kirkby served primarily as the basis for the fictional Newtown setting of the 1960s BBC TV series, Z-Cars, along with Seaforth. Z-Cars was one of the first soap operas on television, and featured Brian Blessed, Colin Welland, John Thaw, Joss Ackland and Judi Dench as well as Davy Jones of The Monkees."]}, {"page": "The Visit (play)", "response": ["The Visit was performed at Chichester Arts Festival of 1995. Players included Lauren Bacall and Joss Ackland."]}, {"page": "Citizen X", "response": ["* Joss Ackland as Bondarchuk"]}, {"page": "Joy Davidman", "response": ["Shadowlands is a dramatised version of Davidman's life with C. S. Lewis by William Nicholson which has been filmed twice.  In 1985, a television version was made by the BBC One, starring Joss Ackland as Lewis and Claire Bloom as Davidman.  The BBC production won BAFTA awards for best play and best actress in 1986.  Nicholson's work drew in part from Douglas Gresham's book Lenten Lands: My Childhood with Joy Davidman and CS Lewis. It was also performed in London as an award-winning stage play in 1989–90. The play was transferred successfully to Broadway in 1990–91 with Nigel Hawthorne and Jane Alexander starring, and was also revived in London in 2007. A cinema film version was released in 1993, with Anthony Hopkins as Jack (C. S. Lewis) and Debra Winger (in an Academy Award-nominated performance) as Joy Davidman."]}, {"page": "The Sweeney", "response": ["*Joss Ackland"]}, {"page": "Hitler: The Last Ten Days", "response": ["* Joss Ackland - General Wilhelm Burgdorf"]}]}}