{"wiki_id": "http://www.wikidata.org/entity/Q4718588", "itemLabel": "Alexander Chinnery-Haldane", "itemDescription": "Scottish bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Chinnery-Haldane", "wikipedia_page": {"main": "James Robert Alexander Chinnery-Haldane (14 August 1840 – 16 February 1906) was an Anglican bishop in the last decades of the 19th century and the first decade of the 20th century.", "link_mentions": [{"page": "James Haldane", "response": ["**Among whose children was Alexander Chinnery-Haldane (1842–1906), Bishop of Argyll and the Isles"]}, {"page": "Bishop of Argyll and The Isles (Episcopal)", "response": ["| Alexander Chinnery-Haldane"]}, {"page": "Cathedral of The Isles", "response": ["*Alexander Chinnery-Haldane (1883-1891), concurrently Bishop of Argyll & the Isles (1883-1906)"]}, {"page": "Alexander Mackonochie", "response": ["Mackonochie did not think of taking another parish and moved into the Clergy House of St Alban's as a freelance. This was a happy arrangement for all, and there was no clash between the old priest and the new (Fr Suckling). For a time Mackonochie undertook a fair amount of work in the parish, but he was weakening mentally. He travelled several times to the continent and often visited the Bishop of Argyll, his friend Alexander Chinnery-Haldane, in Ballachulish, Scotland, a place which he loved. Increasingly his home was his brother's house at Wantage, another place very dear to his heart, where he continued to assist in parochial work as much as possible."]}, {"page": "Bishop's House, Iona", "response": ["It was built in 1894, when Iona Abbey was still in ruins, to provide a place for Scottish Episcopalians on the island. It was originally called Saint Columba's House, after the chapel at its centre dedicated to Saint Columba.McNeill, p.58 It was established under Bishop Alexander Chinnery-Haldane, Bishop of Argyll and The Isles from 1883 to 1906, a year after the tenancy was granted by the 9th Duke of Argyll, as a place of \"prayer, study, contemplation and Eucharist\".MacArthur (2002), pp.192,251 Despite protests from the local established church minister the house continued to be supported by the Duke and the Bishop. Thanks to Bishop Chinnery-Haldane's close involvement with the project, the house became known as the Bishop's House, a title which has stuck.MacArthur (2002), p.193"]}, {"page": "James Robert Alexander Chinnery-Haldane", "response": ["#REDIRECT Alexander Chinnery-Haldane"]}, {"page": "Alexander Haldane", "response": ["Haldane married in 1822 Emma Corsbie Hardcastle, daughter of Joseph Hardcastle (1752–1819). They had five daughters, and a son, Alexander Chinnery-Haldane."]}, {"page": "St Bride's Church, Onich", "response": ["The church is noted for its interior inspired by the Arts & Crafts movement with attractive floor tiling and stained glass windows. There is an impressive stone cross in the churchyard commemorating Alexander Chinnery-Haldane, Bishop of Argyll and the Isles."]}, {"page": "Chinnery-Haldane, Alexander", "response": ["#redirectAlexander Chinnery-Haldane"]}]}}