{"wiki_id": "http://www.wikidata.org/entity/Q4717997", "itemLabel": "Alex Wilson", "itemDescription": "Scottish footballer (1908-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Wilson_(footballer,_born_1908)", "wikipedia_page": {"main": "Alexander Adams Wilson (29 October 1908 – 16 March 1971) was a Scottish footballer who played as a goalkeeper, mainly for Greenock Morton and Arsenal.", "link_mentions": [{"page": "Alexander Wilson", "response": ["Alexander or Alex Wilson may refer to:", "* L. Alex Wilson (1909–1960), African-American journalist", "* Alex Wilson (Australian politician) (1920–2004), member of the Queensland Legislative Assembly", "* Alex Wilson (rugby union) (1874–1932), New Zealand rugby union player", "* Alex Wilson (Canadian sprinter) (1907–1994)", "* Alex Wilson (footballer, born 1908) (1908–1971), Scottish football goalkeeper", "* Alex Wilson (footballer, born 1933) (1933–2010), Scottish football defender", "* Alex Wilson (skier) (born 1974), American skier", "* Alex Wilson (baseball) (born 1986), baseball pitcher", "* Alex Wilson (Swiss sprinter) (born 1990)", "* Alex Wilson (basketball) (born 1994), Australian basketball player", "* Alex Wilson (musician) (born 1971), English salsa and Latin jazz pianist"]}, {"page": "George Marks", "response": ["Born in Figheldean, Wiltshire, Marks started his career at local club Salisbury Corinthians before joining Arsenal as an amateur in March 1936; he turned professional two months later. Marks spent two years on loan at Arsenal's nursery club Margate before returning in May 1938. He played twice for Arsenal before the outbreak of war, but served mainly as understudy to George Swindin and Alex Wilson; however he did play the final two games of the 1938-39 season, his debut coming against Derby County on 29 April 1939. His second and final league appearance in goal for Arsenal was memorable, as it was their 2–0 win over Brentford at Highbury, a match recorded on film for the movie The Arsenal Stadium Mystery."]}, {"page": "Alex Wilson (footballer born 1908)", "response": ["#REDIRECT Alex Wilson (footballer, born 1908)"]}, {"page": "1935 FA Charity Shield", "response": ["| ||1 ||  Alex Wilson"]}, {"page": "Joe Wilson (footballer, born 1909)", "response": ["Wilson impressed with his pace and his ability on the ball, and was a regular in the side, although not always at inside right. In the three seasons running up to the Second World War, as Albion finished third, fifth and third, Wilson missed only nine matches in league and FA Cup. During the war he served as a Physical Training Instructor and when duty permitted, appeared for Albion in the wartime competitions. He resumed his career with appearances in all ten of Albion's 1945–46 FA Cup matches and 39 of their 42 fixtures in the first post-war league season. He then retired as a player and was appointed assistant to trainer Alex Wilson. When Alex Wilson left the club in 1952, Wilson succeeded him as trainer, a post he held for 18 years. In 1963, he had a brief spell as caretaker manager between George Curtis's departure and the arrival of Archie Macaulay.Carder & Harris, Albion A–Z, p. 311. After five years as chief scout, he retired in 1974."]}]}}