{"wiki_id": "http://www.wikidata.org/entity/Q4716890", "itemLabel": "Alex Davies", "itemDescription": "English cricketer (born 1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Davies_(cricketer)", "wikipedia_page": {"main": "Alexander Luke Davies (born 23 August 1994) is an English cricketer who plays for Warwickshire. He is a right-handed batsman who also plays as a wicket-keeper. Davies was included in the England Under-19 squad for the 2012 ICC Under-19 Cricket World Cup.In the 2017 County Championship, he became the first wicket-keeper for Lancashire to score 1,000 runs in a season.In July 2021, it was announced that Davies would join Warwickshire ahead of the 2022 season on a 3-year deal.", "link_mentions": [{"page": "Darwen", "response": ["* Alex Davies, cricketer (born 1994)"]}, {"page": "Warwickshire County Cricket Club", "response": ["|style=\"text-align:center\"|—|| Alex Davies ||  ||  || Right-handed || — || "]}, {"page": "Gareth Cross", "response": ["The year after winning the County Championship, Lancashire were relegated to the second division. Cross played in all 16 of Lancashire's Championship matches that year, scoring 547 runs including three haljf-centuries, with a highest score of 74 not out. Cross scored his third first-class century during a drawn match against Hampshire in May 2013, his first in two years. Though Lancashire secured immediate promotion back to the first division of the Championship through winning the second division title, Cross was dropped for the final two matches of the season as Alex Davies was preferred to keep wicket. In September, after scoring 409 runs from 13 Championship matches that year, Cross was released from his contract with the club."]}, {"page": "2012 Under-19 Cricket World Cup squads", "response": ["|| Alex Davies (wk) ||  || Right || None"]}, {"page": "Alex Davies", "response": ["Alex Davies may refer to:", "* Alex Davies (snooker player) (born 1987), English snooker player", "* Alex Davies (cricketer) (born 1994), English cricketer", "* Alex Davies (footballer) (born 2002), Australian rules footballer", "* Alex Davies (musician), musician with the band Elliot Minor", "* Alex Davies (rugby union) (born 1986), English rugby union player"]}]}}