{"wiki_id": "http://www.wikidata.org/entity/Q4719152", "itemLabel": "Alexander Hood, 1st Viscount Bridport", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Hood,_1st_Viscount_Bridport_(British_Army_officer)", "wikipedia_page": {"main": "General Alexander Nelson Hood, 1st Viscount Bridport, 4th Duke of Bronté,  (23 December 1814 – 4 June 1904) of Cumberland Lodge, Windsor, of Cricket St Thomas in Somerset and of 12 Wimpole Street, London, was a British soldier and courtier.", "link_mentions": [{"page": "Viscount Bridport", "response": ["*Alexander Hood, 1st Viscount Bridport (1726–1814)", "*Alexander Hood, 1st Viscount Bridport, 1st Baron Bridport (1726–1814)"]}, {"page": "Bronte", "response": ["** 4th Duke of Bronté, general, better known as Alexander Hood, 1st Viscount Bridport"]}, {"page": "Alexander Hood", "response": ["*Admiral Alexander Hood, 1st Viscount Bridport (1726–1814), British Royal Navy admiral", "*General Alexander Hood, 1st Viscount Bridport (British Army officer) (1814–1904), British soldier and courtier"]}, {"page": "Alexander Hood, 1st Viscount Bridport", "response": ["Admiral Alexander Hood, 1st Viscount Bridport, KB (2 December 17262 May 1814), of Cricket St Thomas, Somerset, was an officer of the British Royal Navy during the French Revolutionary Wars and Napoleonic Wars.", "His elder brother was Admiral Samuel Hood, 1st Viscount Hood (1724–1816). The sons of his first cousin Samuel Hood (1715–1805), a purser in the Royal Navy,Samuel Hood (1715–1805) was the son of Alexander Hood (c.1675 – 1756) of Mosterton, buried at Netherbury, elder brother of Rev. Samuel Hood (1689–1777), Vicar of ButleighPer a letter from Admiral Alexander Hood, 1st Viscount Bridport detailing his ancestry  included Admiral Sir Samuel Hood, 1st Baronet (1762–1814), Captain Alexander Hood (1758–1798)EB 1911 and Captain Arthur Hood (1754–1776).", "He died without issue on 2 May 1814 when the Viscountcy in the Peerage of the United Kingdom became extinct. His Irish barony passed by special remainder to his younger great-nephew Samuel Hood, 2nd Baron Bridport (1788–1868), the husband of Charlotte Mary Nelson, 3rd Duchess of Bronté (1787–1873), daughter and heiress of William Nelson, 1st Earl Nelson, 2nd Duke of Bronté (1757–1835), elder brother and heir of the great Admiral Horatio Nelson, 1st Viscount Nelson, 1st Duke of Bronté (1758–1805). Samuel and Charlotte's son Alexander Hood, 1st Viscount Bridport, 3rd Baron Bridport (1814–1904) (Viscountcy created 1868), 4th Duke of Bronté in Sicily, sold Cricket House and its estate in 1898 to the chocolate manufacturer Francis Fry (d.1918), the estate having become heavily mortgaged."]}, {"page": "Samuel Hood, 2nd Baron Bridport", "response": ["In 1814 he succeeded his childless great-uncle Admiral Alexander Hood, 1st Viscount Bridport, 1st Baron Bridport (1726–1814) as Baron Bridport, under the special remainder of that title in the Peerage of Ireland."]}, {"page": "Cricket St Thomas", "response": ["In the 11th century the manor was held by the de Cricket family. In 1328-9 Michael de Cricket sold the manor to Walter de Rodney, who subsequently conveyed it to John of Clevedon.Victoria County History, Somerset, 1978, quoted by In 1466 it was acquired by Stephen Preston, whose great-grandson and last male descendant was John Preston, whose daughter and heiress Margaret Preston (d.1672), married John Hippisley of Ston Easton in Somerset, and thus Cricket St Thomas passed to her Hippisley descendants. In 1775 Richard Hippisley-Coxe sold it to Admiral Alexander Hood, 1st Viscount Bridport, 1st Baron Bridport (1726-1814), who although having married twice died childless and thus bequeathed it to his younger great-nephew Samuel Hood, 2nd Baron Bridport (1788-1868) (who inherited his Irish barony by special remainder), the husband of Charlotte Mary Nelson, 3rd Duchess of Bronté (1787–1873), daughter and heiress of William Nelson, 1st Earl Nelson, 2nd Duke of Bronté (1757–1835), elder brother and heir of the great Admiral Horatio Nelson, 1st Viscount Nelson, 1st Duke of Bronté (1758–1805). Samuel and Charlotte's son Alexander Hood, 1st Viscount Bridport, 3rd Baron Bridport (1814-1904) (Viscountcy created 1868), 4th Duke of Bronté in Sicily, sold it in 1898 to the chocolate manufacturer Francis Fry (d.1918), the estate having become heavily mortgaged.", "*Admiral Alexander Hood, 1st Viscount Bridport (1726-1814) (title created 1800), on the chancel south wall, who first acquired the estate. Designed by Sir John Soane and bearing his signature, it comprises a black marble base topped by white marble Ionic columns framing an inscribed tablet. ", "*Alexander Hood, 1st Viscount Bridport (1814-1904) (title created 1868), 4th Duke of Bronté in Sicily, the Admiral 1st Viscount's great-great nephew. Situated in the churchyard next to the church it consists of a white marble lifesize standing figure of St Michael the Archangel. A note in the church states that for many years the statue was laid flat, as the white figure at night scared too many locals. ", "The surviving grade II listedListed building text Georgian manor house, known as \"Cricket House\", was built in 1786 by Admiral Alexander Hood, 1st Viscount Bridport (1726-1814), to the designs of the architect Sir John Soane (1753-1837). The Admiral had purchased the estate in 1775 from Richard Hippisley Coxe. It is unknown whether the new house incorporated elements of the earlier 14th century house or whether it was completely new.English Heritage Soane completed further alterations in 1801–7. The Georgian orangery attached to the house was later turned into a parrot house but is now used for bowling by Warner holiday guests. In the grounds is a small garden house known as \"The Admirals Seat\". In 1999 the house was developed into a Warner Leisure Hotels resort."]}, {"page": "George Seymour, 7th Marquess of Hertford", "response": ["His paternal grandparents were Francis Seymour, 5th Marquess of Hertford, and Lady Emily Murray, daughter of David Murray, 3rd Earl of Mansfield.  His maternal grandparents were Alexander Hood, 1st Viscount Bridport, a British Army officer, and Lady Mary Penelope, the daughter of Arthur Hill, 3rd Marquess of Downshire."]}, {"page": "Hugh Seymour, 6th Marquess of Hertford", "response": ["Lord Hertford married the Honourable Mary Hood, daughter of Alexander Hood, 1st Viscount Bridport, on 16 April 1868. They had eight children:"]}, {"page": "Mary Hill", "response": ["* Lady Mary Penelope Hill (1817–1884), daughter of Arthur Hill, 3rd Marquess of Downshire, wife of Alexander Hood, 1st Viscount Bridport"]}, {"page": "Alexander Nelson Hood, 1st Viscount Bridport", "response": ["#REDIRECT Alexander Hood, 1st Viscount Bridport (British Army officer)"]}, {"page": "1st Viscount Bridport", "response": ["#REDIRECT Alexander Hood, 1st Viscount Bridport (British Army officer)"]}, {"page": "Alexander Nelson Hood", "response": ["#REDIRECT Alexander Hood, 1st Viscount Bridport (British Army officer)"]}, {"page": "AN Hood", "response": ["#REDIRECT Alexander Hood, 1st Viscount Bridport (British Army officer)"]}, {"page": "Arthur Hill, 3rd Marquess of Downshire", "response": ["* Lady Mary Penelope Hill (3 September 1817 – 15 July 1884), married Alexander Hood, 1st Viscount Bridport and had issue"]}, {"page": "Arthur Hood, 2nd Viscount Bridport", "response": ["He was the son and heir of General Alexander Hood, 1st Viscount Bridport (1814-1904), 4th Duke of Bronte in Sicily, of Cricket St Thomas in Somerset, by his wife Lady Mary Penelope Hill (d.1884), a daughter of Arthur Hill, 3rd Marquess of Downshire."]}, {"page": "Alexander Hood, 1st Viscount Bridport (1814-1904)", "response": ["#REDIRECT Alexander Hood, 1st Viscount Bridport (British Army officer)"]}, {"page": "List of British Army full generals", "response": ["| Alexander Hood, 1st Viscount Bridport"]}, {"page": "Household of Edward VII and Alexandra", "response": ["*1901–1904: General Alexander Hood, 1st Viscount Bridport, GCB"]}, {"page": "Alexander Hood, 5th Duke of Bronté", "response": ["He was the 4th son of Alexander Hood, 1st Viscount Bridport by his wife Lady Mary Penelope Hill, a daughter of Arthur Hill, 3rd Marquess of Downshire."]}, {"page": "Mary Seymour, Marchioness of Hertford", "response": ["Mary was the daughter of Alexander Hood, 1st Viscount Bridport, and his wife, the former Lady Mary Penelope Hill. She married the future marquess, then an MP and the heir to the marquessate, on 16 April 1868 at Windsor. A photograph of the couple on their wedding day was owned by Queen Victoria and is in the Royal Collection."]}, {"page": "William Hood (cricketer)", "response": ["The son of Alexander Hood, 1st Viscount Bridport and Lady Penelope Hill, he was born at Westminster in January 1848. He served in the Royal Navy as a lieutenant, prior to being placed on the retired list in October 1873. Hood made two appearances in first-class cricket for the Marylebone Cricket Club, playing against Oxford University at Oxford in 1875 and Kent at Lord's in 1880. Hood died at Fulham in October 1921.Death of The Hon. William Nelson Hood. Midland Counties Tribune. 4 November 1921. p. 8 "]}]}}