{"wiki_id": "http://www.wikidata.org/entity/Q4719829", "itemLabel": "Alexander Perceval", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Perceval", "wikipedia_page": {"main": "Colonel Alexander Perceval (1787 – 9 December 1858) was an Irish politician.\nHe was the eldest surviving son of Rev. Philip Perceval of Temple House, Ballymote, Sligo. He succeeded his father in 1800.He sat in the House of Commons for Sligo County from 1831 to 1841, when his growing financial difficulties compelled him to resign his seat. He served briefly as a Junior Lord of the Treasury in Sir Robert Peel's second government (1841).\nHe was Sergeant-at-Arms of the House of Lords from 1841 until his death.He died at Chester Street, London, on 9 December 1858 and was buried at West Norwood Cemetery. He had married Jane Anne, the daughter of Col. Henry Peisley L’Estrange of Moystown, Cloghan, King's County and had a large family. Due to his extravagance Temple House had to be sold but was bought back for the family by his third son, also Alexander (1821-1866).", "link_mentions": [{"page": "Black Rod", "response": ["* 1841: Alexander Perceval"]}, {"page": "First Peel ministry", "response": ["| Alexander Perceval"]}, {"page": "Second Peel ministry", "response": ["| Alexander Perceval"]}, {"page": "Sligo County (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Alexander Perceval \t"]}, {"page": "Percival (disambiguation)", "response": ["*Alexander Perceval (1788–1858), British politician"]}, {"page": "Treasurer of the Ordnance", "response": ["*12 January 1835: Alexander Perceval"]}, {"page": "Temple House Manor and Castle", "response": ["The Perceval family has lived on the lands since 1665. George Perceval (1635–75) had settled in Ireland on acquiring the Temple House property by marriage to an heiress of the Crofton family of Longford House, Colooney. The property passed down in the Perceval family, several of whom were High Sheriffs of Sligo until it descended to Colonel Alexander Perceval (1787–1858) who was MP for Sligo in the UK Parliament and Sergeant-at-Arms in the House of Lords. He rebuilt the previous Gothic house c.1825. He however spent too extravagantly and on his death the house had to be sold, but was bought back for the family by Alexander's third son, also Alexander, who had made a fortune in China. Alexander jnr then enhanced the building c.1864 by adding a 7-bay block at right angles to the existing 5-bay block.", "In 1920, the house was attacked by the IRA, seriously injuring the wife of the then owner, Major Alexander Perceval."]}, {"page": "John Ward (prophet)", "response": ["In 1832, Ward and Twort came into conflict with the authorities at Derby. They had posted placards announcing an address on a religious fast day, 15 July. These were torn down three times by a local clergyman, James Dean (d. 1882), whom Twort assaulted. Ward and Twort were subsequently indicted for blasphemy and assault. Tried on 4 August before Sir James Alan Park, Twort was convicted of the assault, and both were found guilty of blasphemy, and sentenced to 18 months' imprisonment in Derby Gaol. The case had already become something of a cause célèbre, attracting the attention of the radical Richard Carlile, amongst others. On 15 August, Henry Hunt, another political radical and agitator, presented a petition to the House of Commons from 200 citizens of London, expressing \"disgust and indignation\" at the sentence, and praying for the release of Ward and Twort. Hunt made a violent attack on the government for prosecuting opinions; Member of Parliament Joseph Hume spoke in favour of the petition, and the Attorney General opposed. On Hunt's motion, the house was counted out while Alexander Perceval was speaking. No mitigation of the sentence was obtained, but the confinement, as Ward described it, was by no means harsh."]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|Alexander Perceval"]}, {"page": "Alexander Perceval (merchant)", "response": ["Alexander Perceval, (18218May 1866), sometimes spelt \"Percival\", was the third son of the late Colonel Alexander Perceval, Member of Parliament for County Sligo, and subsequently serjeant-at-arms to the House of Lords. His mother was Jane Anne, daughter of Colonel L'Estrange, of Moystown, Moystown, Cloghan, King's County, Ireland."]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Alexander Perceval||"]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["|Alexander Perceval"]}, {"page": "Perceval, Alexander", "response": ["#redirectAlexander Perceval"]}, {"page": "Chester Street", "response": ["The politician Alexander Perceval died at no 28 in 1859. The businessman and banker George Macaulay Booth was living in the same house in 1936."]}]}}