{"wiki_id": "http://www.wikidata.org/entity/Q4711104", "itemLabel": "Albert Richard Smith", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Albert_Richard_Smith", "wikipedia_page": {"main": "Albert Richard Smith (24 May 1816 – 23 May 1860) was an English author, entertainer, and mountaineer.", "link_mentions": [{"page": "1860 in literature", "response": ["*May 23 – Albert Richard Smith, English journalist and humorist (bronchitis, born 1816)"]}, {"page": "Albert Smith", "response": ["* Albert Richard Smith (1816–1860), English author and entertainer"]}, {"page": "Brompton Cemetery", "response": ["* Albert Richard Smith – writer"]}, {"page": "Mary Anne Keeley", "response": ["Mary Anne and Robert Keeley had two daughters, Mary Lucy (circa 1830-1870) and Louise (1835-1877), both of whom followed their parents on to the stage. Mary Lucy married the writer Albert Richard Smith, while Louise married the criminal advocate Montagu Williams, later Queen's Counsel."]}, {"page": "The Cricket on the Hearth", "response": ["Stage adaptations include the successful The Cricket on the Hearth by Albert Richard Smith produced at the Surrey Theatre in 1845, and Dion Boucicault's Dot, A Drama in Three Acts (or simply Dot), first performed at New York's Winter Garden in 1859. It was staged repeatedly in Britain and America for the remainder of the 19th century, starring, at times, John Toole, Henry Irving, and Jean Davenport. The play helped launch the career of American actor Joseph Jefferson (1829–1905)."]}, {"page": "The Battle of Life", "response": ["An adaptation of The Battle of Life by Albert Richard Smith was produced with success at the Surrey Theatre in 1846."]}, {"page": "Curfew Must Not Ring Tonight", "response": ["The material upon which Rose Hartwick Thorpe based her poem is Lydia Sigourney's article \"Love and Loyalty\", which appeared posthumously in Peterson's Magazine in September 1865 and which in turn is very likely to have been based on the earlier work \"Blanche Heriot. A legend of old Chertsey Church\", which was published by Albert Richard Smith in The Wassail-Bowl, Vol. II., in 1843. In this account, the young woman, Blanche Heriot, has a lover known as Neville Audley, and the action takes place during the Wars of the Roses in 1471."]}, {"page": "Henriette d'Angeville", "response": ["D'Angeville's party left for the summit on 4 September 1838 at 2 AM. Along the way d'Angeville proved herself strong and agile enough;Brown 26-28. particularly on rock she climbed as well as the men, though she did suffer from heart palpitations and drowsiness.Riley 33. The party reached the top of the mountain at 1:15 PM. Toasts were made with champagne, doves were released from the summit to announce their success, and d'Angeville was hoisted on the men's shoulders and cheered. A cannon salute welcomed them on their return to Chamonix. The celebrations the next day also included a special guest, at d'Angeville's request, the now sixty-year-old Maria Paradis. Also present in Chamonix during that time, though he left the day before d'Angeville's successful climb, was a young, poor, and hopeful author and mountaineer Albert Richard Smith. Smith had tried to attach himself to an expedition but would not climb the mountain until 1851, after which he turned his experience into a theatrical show; he notes d'Angeville's expedition (and the \"Polish gentleman [sic]\") in his \"Ascent of Mont Blanc.\"Smith 392."]}, {"page": "Angus Reach", "response": ["In 1854 Reach suffered an attack described variously in contemporary accounts as a \"paralytic\" illness and a \"softening of the brain\", and identified by modern biographers as a probable cerebral haemorrhage. The attack left Reach unable to work and to provide for his wife: his friends, led by the author Albert Richard Smith, organised a benefit performance at the Olympia Theatre in London to raise funds to support Reach's family during his incapacitation. The performance included many of the works Reach himself had written or translated: all the seats in the house sold out, and such figures as Charles Dickens numbered among the audience. A repeat performance, at the Drury Lane Theatre, was attended by Queen Victoria and Prince Albert. For another year Shirley Brooks fulfilled Reach's obligations to the Chronicle, writing his columns and paying the proceeds to Reach's wife, but Reach was never to recover and died in November 1856."]}, {"page": "Robert Keeley (comedian)", "response": ["Robert Keeley died on 3 February 1869 at his home in Brompton, London, and was buried in Brompton Cemetery. He had two daughters with his wife: Mary Lucy (c. 1830–1870) and Louise (1835–1877), both of whom followed their parents on to the stage. Mary Lucy married the writer Albert Richard Smith, while Louise married the criminal advocate Montagu Williams, later Queen's Counsel."]}, {"page": "Spelling of Shakespeare's name", "response": ["The matter was widely debated. The Gentleman's Magazine became the forum for discussion of the topic. There was a heated debate in 1787, followed by another in 1840 when the spelling was promoted in a book by Frederic Madden, who insisted that new manuscript evidence proved that the poet always wrote his name \"Shakspere\". Isaac D'Israeli wrote a strongly worded letter condemning this spelling as a \"barbaric curt shock\". There followed a lengthy correspondence, mainly between John Bruce, who insisted on \"Shakspere\" because \"a man's own mode of spelling his own name ought to be followed\" and John William Burgon, who argued that \"names are to be spelt as they are spelt in the printed books of the majority of well-educated persons\", insisting that this rule authorised the spelling \"Shakspeare\". Various other contributors added to the debate.The Gentleman's Magazine, Volume 13, passim. A number of other articles covered the spelling dispute in the 19th century, in which the \"Shakspere\" spelling generally was promoted on the grounds that it was the poet's own. Albert Richard Smith in the satirical magazine The Month claimed that the controversy was finally \"set to rest\" by the discovery of a manuscript which proved that the spelling changed with the weather, \"When the sun shone he made his 'A's, / When wet he took his 'E's.\"Albert Smith & John Leech, The Month, a view of passing subjects and manners, London, 1851, p. 316. In 1879 The New York Times published an article on the dispute, reporting on a pamphlet by James Halliwell-Phillipps attacking the \"Shakspere\" trend.New York Times, 27 December 1879."]}, {"page": "Watts Phillips", "response": ["Acting did not pay well and, at the urging of his father, Phillips trained to be an illustrator under George Cruikshank, who remained a friend for the rest of his life. Phillips also studied oil painting and was a fellow student of Holman Hunt. Through Cruikshank and his theatre connections, Phillips became acquainted with Samuel Phelps, Robert Barnabas Brough and his family, Augustus Mayhew and his brother Henry Mayhew, Albert Richard Smith, Douglas Jerrold and Mark Lemon."]}, {"page": "Samuel Brandram", "response": ["After leaving Oxford Brandram became a student at Lincoln's Inn, and was called to the bar on 22 November 1850. He practised as a barrister till 1876, when for financial reasons he took work as a professional reciter, and became a popular performer. He had amateur experience to build on with the Canterbury Old Stagers and the Windsor Strollers, and had played with Albert Richard Smith and Edmund Yates among others. He gave whole or almost complete plays of Shakespeare, or Sheridan."]}, {"page": "Henry Leigh Murray", "response": ["With Macready, Murray went, in the autumn of 1846, to the Surrey Theatre, where he played secondary characters in Shakespeare and Loveless in The Relapse. On the recommendation of Charles Dickens he was chosen at the Lyceum Theatre to play Alfred Heathfield in Albert Richard Smith's adaptation of The Battle of Life. At the Lyceum he remained under the Keeley and the Mathews managements. His Marquis de Volange in the Pride of the Market (James Robinson Planché) won recognition."]}, {"page": "William Roxby Beverly", "response": ["In 1851 Beverly had some hand in the \"Great Holy Land Diorama\", the largest exhibited up to that time; it was at St George's Gallery, Hyde Park Corner. In the autumn of that year he accompanied Albert Richard Smith to Chamonix, and drew sketches from which he executed his dioramic views for \"The Ascent of Mont Blanc\", presented by Smith at the Egyptian Hall, Piccadilly, on 15 March 1852. After a time this diorama was expanded by views of the River Rhine, an old pleorama by Carl Wilhelm Gropius that Smith salvaged from a site in Birmingham."]}, {"page": "Thomas Butler Gunn", "response": ["Gunn gradually became more involved with writing and in 1857 published The Physiology of New York Boarding-houses, based on his personal experiences, with illustrations by his friends Frank Bellew (pen-name Triangle) and Alfred Waud. This concept of analysing normal life in literature began in Paris and had been used in the 1840s by Albert Richard Smith in Punch, with works such as Physiology of the London Medical Student and Physiology of London Evening Parties."]}, {"page": "Lists of English translations from medieval sources", "response": ["*Bentley's miscellany,Browne, H. Knight., Cruikshank, G., Smith, A., Ainsworth, W. Harrison., Dickens, C. (18371868). Bentley's miscellany. [London: Richard Bentley]. 64 volumes (1837–1868). Successively edited by Charles Dickens, William Harrison Ainsworth, Albert Richard Smith and others."]}]}}