{"wiki_id": "http://www.wikidata.org/entity/Q4719461", "itemLabel": "Alexander MacAulay", "itemDescription": "British mathematician and physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_McAulay", "wikipedia_page": {"main": "Alexander McAulay (9 December 1863 – 6 July 1931) was the first professor of mathematics and physics at the University of Tasmania, Hobart, Tasmania. He was also a proponent of dual quaternions, which he termed \"octonions\" or \"Clifford biquaternions\".\nMcAulay was born on 9 December 1863 and attended Kingswood School in Bath. He proceeded to Caius College, Cambridge, there taking up a study of the quaternion algebra. In 1883 he published an article \"Some general theorems in quaternion integration\". McAulay took his degree in 1886, and began to reflect on the instruction of students in quaternion theory. In an article \"Establishment of the fundamental properties of quaternions\" he suggested improvements to the texts then in use. He also wrote a technical article on integration.\nDeparting for Australia, he lectured at Ormond College, University of Melbourne from 1893 to 1895. As a distant correspondent, he participated in a vigorous debate about the place of quaternions in physics education. In 1893 his book Utility of Quaternions in Physics was published. A. S. Hathaway contributed a positive review and Peter Guthrie Tait praised \nit in these terms:\n\nHere, at last, we exclaim, is a man who has caught the full spirit of the quaternion system: the real aestus, the awen of the Welsh Bards, the divinus afflatus that transports the poet beyond the limits of sublunary things! Intuitively recognizing its power, he snatches up the magnificent weapon which Hamilton tenders us all, and at once dashes off to the jungle on the quest of big game.McAulay took up the position of Professor of Physics in Tasmania from 1896 until 1929, at which time his son Alexander Leicester McAulay took over the position for the next thirty years.\nFollowing William Kingdon Clifford who had extended quaternions to dual quaternions, McAulay made a special study of this hypercomplex number system. In 1898 McAulay published, through Cambridge University Press, his Octonions: a Development of Clifford's Biquaternions.\nMcAulay died on 6 July 1931. \nHis brother Francis Macaulay, who stayed in England, also contributed to ring theory. The University of Tasmania has commemorated the McAulays' contributions in Winter Public Lectures.", "link_mentions": []}}