{"wiki_id": "http://www.wikidata.org/entity/Q4719382", "itemLabel": "Alexander Leith Hay", "itemDescription": "British army officer (1758–1838)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Leith_Hay", "wikipedia_page": {"main": "General Alexander Leith-Hay [formerly Alexander Leith] (1758 – 16 May 1838), was a British Army officer.", "link_mentions": [{"page": "Andrew Leith Hay", "response": ["Andrew Leith Hay was the eldest son of General Alexander Leith Hay of Rannes and Mary Forbes of Ballogie (died 1824), and was born at Aberdeen on 17 February 1785."]}, {"page": "109th (Aberdeenshire) Regiment of Foot", "response": ["The 109th (Aberdeenshire) Regiment of Foot was an infantry regiment of the British Army from 1794 to 1795. Raised by Alexander Leith Hay for service in the French Revolutionary Wars the regiment was briefly deployed in Jersey before it was disbanded in England and its men sent to reinforce the 53rd (Shropshire) Regiment of Foot. The disbandment was controversial as Leith-Hay believed it contravened an assurance given to him in his original letter of service to raise the regiment."]}, {"page": "Rannes, Queensland", "response": ["Rannes was established as a pastoral sheep station property in April 1853 by Scottish brothers James, Norman and Charles Leith Hay. The brothers were the offspring of Peninsula War veteran Andrew Leith Hay and the grandsons of General Alexander Leith Hay of Leith Hall. They were the first Europeans to occupy the region and at that time Rannes was the northern-most outpost of British colonisation in Eastern Australia. The brothers named the property Rannes after a Leith Hay family manor house located near Buckie in Scotland."]}, {"page": "James Leith (British Army officer, born 1763)", "response": ["* Alexander Leith Hay "]}, {"page": "Alexander Hay", "response": ["* Alexander Leith Hay (1758–1838), British army officer"]}, {"page": "Leith Hall", "response": ["The north wing of the house was constructed in 1650, on the site of the earlier Peill Castle, by James Leith of New Leslie (see Castle Croft). The east wing was added in 1756, and the south wing was built in 1797 by General Alexander Leith Hay. The west wing, containing the entrance front, was added in 1868 to complete the courtyard."]}, {"page": "Alexander Forbes-Leith, 1st Baron Leith of Fyvie", "response": ["Born at Aberdeen, Alexander Leith was the youngest son of Rear-Admiral John James Leith and his wife Margaret Forbes, daughter and heiress of Alexander Forbes, a descendant of Duncan Forbes, second son of the second Lord Forbes. He was the grandson of General Alexander Leith Hay and the nephew of Sir Andrew Leith Hay. He was educated at Berlin, Prussia, the École spéciale militaire de Saint-Cyr and Dr. Burney's Naval Academy at Gosport, Hampshire.thepeerage.com Alexander John Forbes-Leith, 1st and last Baron Leith of Fyvie He later assumed the additional surname of Forbes."]}, {"page": "Archibald Crawfurd", "response": ["Crawfurd was born in Ayr, and was left an orphan at the age of eight. After some school education he went, aged 12, to London to learn the trade of baker with his sister's husband. After eight years' he returned to Ayr, and at age 22 attended writing classes of Ayr academy for three months. He was for some time employed in the Edinburgh house of Charles Hay, after which he obtained an engagement in the family of General Alexander Leith Hay of Rannes."]}]}}