{"wiki_id": "http://www.wikidata.org/entity/Q4717819", "itemLabel": "Alex Smith", "itemDescription": "British footballer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Smith_(footballer,_born_1991)", "wikipedia_page": {"main": "Alex Ralph Smith (born 31 October 1991) is an English footballer who plays as a midfielder for Hastings United.", "link_mentions": [{"page": "Alex Smith (disambiguation)", "response": ["Alex Smith (born 1984) is an American football quarterback.", "Alex Smith may also refer to:", "*Alex Smith (footballer, born 1876) (1876–1954), Scottish international footballer (Rangers)", "*Alex Smith (footballer, born 1915) (1915–?), Scottish footballer (Liverpool)", "*Alex Smith (footballer, born 1938), English football goalkeeper (Halifax Town)", "*Alex Smith (footballer, born 1939), Scottish footballer and manager (St. Mirren, Aberdeen, Dundee United)", "*Alex Smith (footballer, born 1940), Scottish footballer (Dunfermline Athletic, Rangers)", "*Alex Smith (footballer, born 1944), English footballer (Middlesbrough)", "*Alex Smith (footballer, born 1947), English footballer (Bradford City, Southend United)", "*Alex Smith (New Zealand footballer), New Zealand international footballer", "*Alex Smith (footballer, born 1976), English footballer (Port Vale, Wrexham)", "*Alex Smith (footballer, born 1985), English footballer (FC Dallas, Sydney Olympic, Wellington Phoenix)", "*Alex Smith (footballer, born 1991), English footballer (Yeovil Town)", "*Alex Smith (golfer) (1874–1930), member of a famous Scottish golfing family", "*Alex Smith (ice hockey) (1902–1963), Canadian NHL hockey player", "*Alex Smith (tight end) (born 1982), American football tight end", "*Alex Smith (hammer thrower) (born 1988), British hammer thrower", "*Alex Smith (builder) (1899–1973), Australian heritage designer-builder on the Redcliffe Peninsula", "*Alex Smith (engineer) (1922–2003), Scottish industrial scientist and educator", "*Alex Smith (politician) (born 1943), Labour MEP for South of Scotland", "*Alex Smith (entrepreneur) (born 1986), Indiana philanthropist", "*Alex Smith, member of British comedy trio Hat Films"]}, {"page": "2013–14 Fulham F.C. season", "response": ["|  Alex Smith"]}, {"page": "2014–15 Yeovil Town F.C. season", "response": ["On 1 November, Yeovil ended their three match losing run with a goalless draw away at Chesterfield, keeping only their second clean sheet of the season. Attacking midfielder Joel Grant was once again called up to the Jamaica national football team for the 2014 Caribbean Cup between 11–18 November. The FA Cup first round saw Yeovil face Crawley Town, on 8 November, and won the game thanks to a first professional goal for Jordy Hiwula. The second round draw saw Yeovil drawn away at the winner of Notts County or Accrington Stanley. The 11 November, saw Yeovil face Western League side Hengrove Athletic in the second round of the Somerset Premier Cup. Yeovil secured a club competition record victory a 13–0 win, despite being only 2–0 up at half-time, thanks to hat-tricks from James Hayter and Jordy Hiwula as well as goals Berrett, Foley, Leitch-Smith, Gillett, Davis and a brace from Seth Nana Twumasi. On 15 November, goalkeeper Chris Weale joined League Two side Burton Albion on a month's loan deal. Later that day Yeovil slipped to the bottom of the league table after 1–0 defeat against Fleetwood Town following a solitary Jeff Hughes goal. On 17 November, Yeovil announced that defender Ryan Inniss had extended his loan from Crystal Palace until 20 December. Yeovil's first victory for two months came away at play-off chasing Notts County, on 22 November, following a controversial red card for Notts midfielder Gary Jones after half an hour, Yeovil eventually won the match 2–1 with two late headers from full back Jordan Clarke. The match was to be Jordy Hiwula last game for the club having been sent back to Manchester City, on 27 November, Yeovil signed Bolton Wanderers forward Tom Eaves on loan until 5 January. On 28 November, Yeovil signed former Fulham and Swindon Town left-sided player Alex Smith on a month-long deal. Yeovil ended the month with a 2–0 defeat against Preston North End, including a goal from former Yeovil captain Paul Huntington, Yeovil ended the game with ten men following a red card for defender Ryan Inniss.", "The end of the season saw new manager Paul Sturrock perform a major clear out of the Yeovil squad, with eleven players released including Fergus Bell, Liam Davis, Craig Eastmond, Joel Grant, James Hayter, Sam Hoskins, Kieffer Moore, Nathan Ralph, Alex Smith, Seth Nana Twumasi and Gozie Ugwu. Club captain Joe Edwards rejected an offer of a new contract and left the club, while midfielder Kevin Dawson and Sam Foley were also offered new contracts and goalkeeper Chris Weale was offered a fresh contract. In addition the club made offers to terminate the contracts of A-Jay Leitch-Smith, James Berrett, Adam Morgan and Artur Krysiak. Morgan was the first of the four to agree to terminate his contract to join Accrington Stanley on a one-year deal, midfielder Berrett left for York City, while Krysiak decided to remain at the club. On 26 May, the Sturrock agreed a new two-year contract with the club having been working with the club informally since April. On 18 June, midfielder Sam Foley rejected the club's offer of a new contract to sign a two-year deal with Port Vale, while the following day Kevin Dawson signed a new two-year contract with the club."]}, {"page": "Alex Smith (footballer born 1991)", "response": ["#REDIRECT Alex Smith (footballer, born 1991)"]}, {"page": "2015–16 Yeovil Town F.C. season", "response": ["The end of the season saw new manager Paul Sturrock perform a major clear out of the Yeovil squad, with eleven players released including Fergus Bell, Liam Davis, Craig Eastmond, Joel Grant, James Hayter, Sam Hoskins, Kieffer Moore, Nathan Ralph, Alex Smith, Seth Nana Twumasi and Gozie Ugwu, while club captain Joe Edwards and midfielder Sam Foley both rejected offers of new contracts. A further four players were offered deals to terminate their contracts early with both James Berrett and Adam Morgan agreeing to leave the club in the close season. Finally midfielder Kevin Dawson signed a new two-year contract with the club."]}, {"page": "Alex Ralph Smith", "response": ["#REDIRECT Alex Smith (footballer, born 1991)"]}]}}