{"wiki_id": "http://www.wikidata.org/entity/Q4717976", "itemLabel": "Alex Wheatle", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Wheatle", "wikipedia_page": {"main": "Alex Alphonso Wheatle MBE (born 3 January 1963) is a British novelist, who was sentenced to a term of imprisonment after the 1981 Brixton riot in London.\n\n", "link_mentions": [{"page": "January 3", "response": ["*  1963   – Alex Wheatle, English author and playwright"]}, {"page": "Brixton", "response": ["*Alex Wheatle, novelist."]}, {"page": "1963 in literature", "response": ["*January 3 – Alex Wheatle, black British young adult fiction writer"]}, {"page": "Guardian Children's Fiction Prize", "response": ["| 2016 || Alex Wheatle || Crongton Knights || Atom Books"]}, {"page": "1981 Brixton riot", "response": ["* Alex Wheatle's novel East of Acre Lane is set in 1981 Brixton and portrays the dissatisfaction felt by the black community that would eventually lead to the Brixton riot."]}, {"page": "Black British people", "response": ["Britain's first major black newspaper, the West Indian Gazette (WIG), was founded by communist activist Claudia Jones in 1958. Notable Black British writers include novelists Caryl Phillips, Zadie Smith, Andrea Levy (whose 2004 book Small Island won the Whitbread Book of the Year, the Orange Prize for Fiction and the Commonwealth Writers' Prize), Bernardine Evaristo, Alex Wheatle, Ferdinand Dennis (winner of the Martin Luther King Memorial Prize for his 1988 travelogue Behind the Frontlines: Journey into Afro-Britain), Mike Phillips, Booker Prize nominee Nadifa Mohamed and Diran Adebayo (first winner in 1995 of the Saga Prize, which was set up by Marsha Hunt to encourage Black British writing and ran for four years).Mark Stein, \"Saga Prize\" , in Alison Donnell (ed.), Companion to Contemporary Black British Culture, Routledge, 2013 reprint, p. 270."]}, {"page": "List of young adult writers", "response": ["*Alex Wheatle: Liccle Bit, Crongton Knights"]}, {"page": "South Norwood Library", "response": ["A new South Norwood Library building was built in a block of flats, due to open in 2019 but remains empty. Since the COVID-19 lockdowns the library service has reopened in the existing 1968 building with reduced opening hours. The Friends of South Norwood Library continue to campaign for the library, supported by authors including Alex Wheatle. A petition also exists to ensure protection for the building due to its architectural merit."]}, {"page": "Alex wheatle", "response": ["#REDIRECT Alex Wheatle "]}, {"page": "Shooting of Mark Duggan", "response": ["Black British novelist Alex Wheatle, who served a term of imprisonment for crimes he committed in the 1981 Brixton riot, asserted that there was \"a deep aggravation\" that despite many black deaths in police custody there had never been a conviction of a police officer."]}, {"page": "Wheatle", "response": ["#REDIRECT Alex Wheatle"]}, {"page": "Joan Anim-Addo", "response": ["At Goldsmiths, she is the convenor for the undergraduate options \"Caribbean Women's Writing\" and \"Black British Literature\", as well as convenor of the \"Literature of the Caribbean and its Diasporas\" pathway within the Comparative Literary Studies MA programme. She is also co-convenor, with Deirdre Osborne, of the world's first MA in Black British Writing,Joan Anim-Addo and Sarah Cox, \"New chapter begins for the Centre for Caribbean and Diaspora Studies\", Goldsmiths, 12 October 2015.Tom Morgan, \"Celebrating Black History Month\", Goldsmiths, 12 October 2015. which Hannah Pool described as a \"landmark for black culture\", while novelist Alex Wheatle sees it adding \"to the fabric of British literature\".Sarah Cox, \"Introducing the MA Black British Writing - 'It’s a story that hasn’t really been told'\", Goldsmiths, 26 October 2015."]}, {"page": "List of black British writers", "response": ["* Alex Wheatle (born 1963)"]}, {"page": "Alistair Fruish", "response": ["Fruish is known for his novel Kiss My ASBO.  Along with a number of other short stories by the writer, the initial section of Kiss My ASBO, \"Double Bubble\", was first published in Philosophy Now. Kiss My ASBO was one of Russell Brand's recommended reads, given as part of his The Reading Agency lecture in November 2014. On its release the book was highly praised by British working-class writers Alan Moore, Russ Litten and Alex Wheatle, with Courttia Newland describing it as \"completely original\". Writer and editor Steve Moore called the book \"a masterpiece\". During a Prison Reading Groups supported visit to maximum-security prison HMP Full Sutton to discuss the book with prisoners, Fruish referred to the book's genre as \"grime fiction\", with prisoners celebrating the colloquial language and lyrical experience of reading the book. Kiss My ASBO  is one of the books that have been banned from Guantanamo Bay."]}, {"page": "Jhalak Prize", "response": ["*Alex Wheatle"]}, {"page": "Derek Owusu", "response": ["Owusu edited the book Safe: On Black British Men Reclaiming Space (2019), an anthology of writing by 20 Black British men. He has said that the idea was given to him by fellow writer Yomi Adegoke, who with Elizabeth Uviebinené had compiled the book called Slay In Your Lane and suggested that something similar from a male perspective would be a good idea.Sinclair, Leah (26 June 2019), \"Black Male Britons Reclaim Their Space In New Book\", The Voice. It includes essays by JJ Bola, Suli Breaks, Alex Wheatle, Courttia Newland and others\"Members' Book Group – Safe ed. by Derek Owusu\", Royal Society of Literature, 12 November 2019. that are, as Alex Mistlin wrote in Vice, \"addressing the conflicts and complexities of being a black man in Britain today\". According to Mistlin, Safe is \"about the multi-faceted nature of the black experience, how blackness intertwines with society, masculinity and sexuality to form a coherent identity that is at once universal and unique.\" Owusu contributes an essay about his experience of foster care.Biswas, K. (12 June 2019), \"How black culture went mainstream\", New Statesman."]}, {"page": "Alex Wheatle (film)", "response": ["Alex Wheatle is a 2020 historical drama film directed by Steve McQueen and co-written by McQueen and Alastair Siddons. It stars Sheyi Cole as Alex Wheatle, a Black British novelist who was sentenced to a term of imprisonment after the 1981 Brixton uprising. The film was released as part of the anthology series Small Axe on BBC One on 6 December 2020 and on Amazon Prime Video on 11 December 2020.", "* Sheyi Cole as Alex Wheatle", "** Asad-Shareef Muhammad as Young Alex Wheatle", "On review aggregator Rotten Tomatoes, the film holds an approval rating of 97% based on 43 critic reviews, with an average rating of 7.4/10. The website's critics consensus reads, \"Sheyi Cole shines in Alex Wheatle, a harrowing biopic that barely scratches the surface of a complex life, but does so with empathy and finesse.\" Metacritic assigned the film a weighted average score of 77 out of 100, based on 17 critics, indicating \"generally favorable reviews.\""]}, {"page": "Ethosheia Hylton", "response": ["In 2018 Ethosheia was presented the inaugural European Academy Gold Fellowship For Women. The award, sponsored by Swarovski, offered a year-long mentorship scheme from the Academy. Driven by stories from untold voices and about community and culture, Ethosheia's work Brixton Rock, an adaptation of author Alex Wheatle's book of the same name, is being turned into a feature film. She is currently directing Ackley Bridge (TV Series on Channel 4)."]}]}}