{"wiki_id": "http://www.wikidata.org/entity/Q4710191", "itemLabel": "Albert Fennell", "itemDescription": "British film and television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Albert_Fennell", "wikipedia_page": {"main": "Albert Fennell (29 March 1920, in Chiswick – 17 April 1988) was a British film and television producer.Fennell's film career began as a production designer and writer. His work as a film producer included Next to No Time, (1958), Peeping Tom (1960), The Innocents (1961) and This Sporting Life (1963).He is best known for his work on the 1960s spy drama The Avengers with Brian Clemens, Fennell also produced (with Clemens) its follow-up, The New Avengers and The Professionals. The New Avengers was made by The Avengers (Film and TV) Enterprises Ltd, and The Professionals was by Mark One Productions. both companies Fennell established with Clemens and composer Laurie Johnson.His later film productions included And Soon the Darkness (1970), Dr. Jekyll and Sister Hyde (1971) and Captain Kronos – Vampire Hunter (1974).", "link_mentions": [{"page": "The Avengers (TV series)", "response": ["After more than 60 actresses had been auditioned, the first choice to play the role was Elizabeth Shepherd. However, after filming one and a half episodes (the pilot, \"The Town of No Return\", and part of \"The Murder Market\"), Shepherd was released. Her on-screen personality was deemed less interesting than that of Blackman's Gale, and it was decided that she was not right for the role. Another 20 actresses were auditioned before the show's casting director, Dodo Watts, suggested that producers Brian Clemens and Albert Fennell check out a televised drama featuring the relatively unknown Rigg (she had earlier guested in an episode of The Sentimental Agent that Clemens had written). Rigg's screen test with Macnee showed that the two immediately worked well together.", "When Rigg left the series in October 1967, the British network executives decided that the current series formula, despite resulting in popular success, could not be pursued further. Thus, they decided that a \"return to realism\" was appropriate for the sixth series (1968–69). Brian Clemens and Albert Fennell were replaced by John Bryce, producer of most of the Cathy Gale-era episodes.", "The production team changed during the series' long run, particularly between the third and fourth series, but the influence of Brian Clemens was felt throughout. He wrote the second episode and became the series' most prolific scriptwriter. Succeeding producers Leonard White and John Bryce, Julian Wintle became the producer of the 4th series with Brian Clemens credited as associate producer and Albert Fennell credited as \"In charge of production\". For series 5, made by A.B.C. Television Films (which was created during the run-up to Associated British Corporation and Associated-Rediffusion forming Thames TV) Clemens and Fennell became co-producers, with Wintle as executive producer. For series 6, after its initial producer John Bryce left, Clemens and Fennell returned as co-producers; early episodes also credit Julian Wintle as consultant to the series and Philip Levene as story consultant."]}, {"page": "Purdey (The New Avengers)", "response": ["When Brian Clemens and Albert Fennell first mapped out the characters for The New Avengers - an updating of The Avengers - the female lead character was to have been named Charlie (or Charley), but the decision was made not to use the name.  Lumley is credited with suggesting the character be named Purdey, after James Purdey and Sons, a famous shotgun manufacturer. Lumley also chose the character's distinctive short haircut."]}, {"page": "The Professionals (TV series)", "response": ["The Professionals was created by Brian Clemens, who had been one of the driving forces behind The Avengers. The show was originally to have been called The A-Squad. Clemens and Albert Fennell were executive producers, with business partner Laurie Johnson providing the theme music. Sidney Hayers produced the first series in 1977, and Raymond Menmuir the remainder."]}, {"page": "And Soon the Darkness", "response": ["Clemens was involved in producing and storyboarding the film, and said it inspired him to try directing. He later commented, \"My business partner (Albert Fennell) said 'You should have directed it' and suddenly I thought 'Yeah, perhaps I should have done'. I knew I could have directed it better.\" He went on to write what became See No Evil for Forbes at EMI; after Forbes left the company the film was made at Columbia. Clemens eventually turned director with Captain Kronos, Vampire Hunter."]}, {"page": "The New Avengers (TV series)", "response": ["The New Avengers is a British secret agent action television series produced during 1976 and 1977. It is a sequel to the 1960s series The Avengers (created by Sydney Newman) and was developed by original series producers Albert Fennell and Brian Clemens.", "An attempt to get Diana Rigg to appear as Emma Peel in the new series was unsuccessful, although old footage of her on the phone from two 1960s episodes of The Avengers (\"The Winged Avenger\" and \"The Hidden Tiger\") were used to allow the character to make a cameo appearance in the episode \"K Is For Kill Part One: The Tiger Awakes\": Sue Lloyd provided the voice of Mrs Peel for these sequences. Ian Hendry, who in the early 1960s had played Steed's original partner, David Keel, also guest-starred in one episode, \"To Catch A Rat\", playing a different role.  \"Obsession\" features two of the stars of the Brian Clemens/Albert Fennell British crime-fighting action series The Professionals: Martin Shaw and Lewis Collins."]}, {"page": "Robert Fuest", "response": ["His first film was Just Like a Woman made in 1967, starring Wendy Craig. He also wrote it. His work on this film brought him to the attention of Avengers producer Albert Fennell, who offered him the chance to direct episodes. He directed seven episodes in total: \"My Wildest Dream\", \"Game\", \"They Keep Killing Steed\", \"The Rotters\", \"Take Me to Your Leader\", \"Pandora\" and \"Take Over\". When the series was later revived as The New Avengers, Fuest was invited back to direct two more episodes, namely \"The Midas Touch\" and \"The Tale of the Big Why\"."]}, {"page": "Fennell", "response": ["*Albert Fennell (1920–1988), British film and television producer"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["John Bryce replaced Brian Clemens and Albert Fennell as producer for the start of series six. By the time Clemens and Fennell returned, three episodes had been filmed: two 90-minute episodes, named \"Invitation To a Killing\" and \"The Great Great Britain Crime\", as well as a standard-length episode, \"Invasion of the Earthmen\". These were considered to be extremely flawed episodes; they would likely have been scrapped, except that time did not exist in which to film new episodes and still meet the American contract. Hence, \"Invitation To a Killing\" was heavily edited and had several new shots filmed to become \"Have Guns — Will Haggle\", while \"The Great Great Britain Crime\" was heavily edited and had some old footage from previous episodes added, as well as some new footage, to become \"Homicide and Old Lace\". \"Invasion of the Earthmen\" was slightly edited as well. No known copies of the original versions of these episodes exist."]}, {"page": "Captain Kronos – Vampire Hunter", "response": ["Captain Kronos – Vampire Hunter is a 1974 British swashbuckling action horror film, written and directed by Brian Clemens, produced by Clemens and Albert Fennell for Hammer Film Productions, and starring Horst Janson, John Carson, Shane Briant, and Caroline Munro. The music score was composed by Laurie Johnson, supervised by Philip Martell. Belatedly released on 7 April 1974, the film was intended as the first in a series focused on the title character and his companions. Due to the film's violence and sexual subtext, Captain Kronos was rated R in North America. This was Clemens' only film as a director."]}, {"page": "Laurie Johnson", "response": ["In 1961, Johnson entered the UK Singles Chart with \"Sucu Sucu\", the theme music from the UK television series Top Secret. It was in this area of television scoring that he was to be most prolific. From the 1960s to the 1980s, he composed over fifty themes and scores, including the theme used on This Is Your Life (entitled \"Gala Performance\"), The Avengers (from 1965), Animal Magic (entitled \"Las Vegas\"), Jason King, The New Avengers and The Professionals. He was one of the founders, with Albert Fennell and Brian Clemens, of Mark One Productions, the television production company responsible for The New Avengers and The Professionals."]}, {"page": "Primetime Emmy Award for Outstanding Drama Series", "response": ["| Albert Fennell and Brian Clemens, producers"]}, {"page": "Night of the Eagle", "response": ["Richard Matheson and Charles Beaumont were admirers of the novel and wanted to work on something together, so the two men decided to adapt it. They were paid $5,000 each by James H. Nicholson of AIP, who passed the project over to AIP's regular co-producers, Anglo-Amalgamated in England. They agreed to finance, allocating the movie to Independent Artists to produce. Producer Albert Fennell bought in George Baxt to work on the script. The original script (commenced by Matheson and completed by Beaumont) was published in the Gauntlet Press edition of He Is Legend, a Matheson tribute anthology, but not in the subsequent paperback."]}, {"page": "Death's Door (The Avengers)", "response": ["Production for the episode was completed on 7 June 1967 and it was aired on ABC on 7 October. The episode was produced by Albert Fennell and Brian Clemens and Executive Producer Julian Wintle, and the production set was designed by Robert Jones. The conference center featured in the episode was shot at the Royal Masonic Senior School."]}, {"page": "The Forget-Me-Knot", "response": ["\"The Forget-Me-Knot\" was not originally part of the planned sixth season of The Avengers. Having decided to cast Linda Thorson as Steed's new sidekick Tara King, producer John Bryce had started filming episodes with the character already in place and - as with her predecessors - no introduction. However Bryce was fired midway through production of the third episode, and the previous series producers, Albert Fennell and Brian Clemens, were re-hired. Clemens abandoned the episode whose production was underway (entitled \"The Great, Great Britain Crime\", scenes of which were later salvaged for the episode entitled \"Homicide and Old Lace\"). Instead, he decided that there needed to be a continuity explanation for the replacement of Mrs Peel by Tara King, and set about hastily developing a storyline which would account for this. Diana Rigg's scenes were shot in four days in December 1967 with production completed the following month. A \"handover\" scene featuring both characters was filmed on the last day of Rigg's contract with ABC Television on 19 December 1967.Rogers, Dave (1995) The Ultimate Avengers, Boxtree"]}, {"page": "Have Guns — Will Haggle", "response": ["Filmed between October 1967 and February 1968, \"Have Guns — Will Haggle\" started as the pilot episode of the sixth series of The Avengers. In its original conception, entitled \"Invitation to a Killing\", it ran for 90 minutes and introduced the character of Tara King. As with Steed's previous companions, the intention was to introduce Tara as already working with Steed. However when original producer John Bryce was replaced by Albert Fennell and Brian Clemens, they decided to begin the series with \"The Forget-Me-Knot\" which explicitly introduced the character, so \"Have Guns — Will Haggle\" was moved to midway through the run. As such, it was edited down to the usual length of around 50 minutes.Rogers, Dave (1995) The Ultimate Avengers, Boxtree"]}, {"page": "John Bryce (producer)", "response": ["Bryce set about developing a feature-length series opener entitled \"Invitation to a Killing\"; this was to introduce Thorson's character Tara King, who was (as with her predecessors) already known to and working with Steed. \"Invasion of the Earthmen\" followed, and work was in progress on the third episode, entitled \"The Great, Great Britain Crime\" when word came from the series' American sponsors that they wanted the outlandish, more fantasy-based element of the series to continue. This, coupled with Bryce's lengthy production time per episode, led to a decision to bring back the previous team, headed by Albert Fennell and Brian Clemens, and Bryce again parted company with the series."]}]}}