{"wiki_id": "http://www.wikidata.org/entity/Q4718302", "itemLabel": "Alexander Balloch Grosart", "itemDescription": "Scottish clergyman and literary editor (1827-99)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Balloch_Grosart", "wikipedia_page": {"main": "Alexander Balloch Grosart (18 June 1827 – 16 March 1899) was a  Scottish clergyman and literary editor. He is chiefly remembered for reprinting much rare Elizabethan literature, a work which he undertook because of his interest in Puritan theology.", "link_mentions": [{"page": "Joseph Hall (bishop)", "response": ["The first complete Works appeared in 1808, edited by Josiah Pratt. Other editions are by Peter Hall (1837) and by Philip Wynter (1863). See also Bishop Hall, his Life and Times (1826), by Rev. John Jones; Life of Joseph Hall, by Rev. George Lewis (1886); Alexander Balloch Grosart, The Complete Poems of Joseph Hall with introductions, etc. (1879); Satires, etc. (Early English Poets, ed. Samuel Weller Singer, 1824). Many of Hall's works were translated into French, and some into Dutch, and there have been numerous selections from his devotional works."]}, {"page": "1899 in literature", "response": ["*March 16 – Alexander Balloch Grosart, Scottish literary editor (born 1827)"]}, {"page": "Samuel Daniel", "response": ["The last time a thorough edition of the works of Daniel appeared in print was in the late nineteenth century, in the five-volume Complete Works in Verse and Prose (1885–1896), edited by Alexander Balloch Grosart. Two collections of selected works were published during the twentieth century: Poems and a Defence of Ryme (1930), an edition that preserves the original early modern spelling and punctuation, edited by Arthur Colby Sprague, and Selected Poetry and a Defense of Rhyme (1998), a modernized edition, edited by Geoffrey G. Hiller and Peter L. Groves. John Pitcher is currently working on a multi-volume critical edition of Daniel's complete works to be published by Oxford University Press.  "]}, {"page": "John Davies of Hereford", "response": ["These rare editions were compiled by Reverend Alexander Balloch Grosart (1827–1899) into a two-volume edition privately printed in one hundred copies in 1875 and 1878 at the Edinburgh University Press by Thomas and Archibald Constable as part of the \"Chertsey Worthies' library\" subscription series. The complete works of John Davies of Hereford (15??-1618) was \"for the first time collected and edited: with memorial introduction, notes and illustrations, glossarial index, and portrait and facsimile, &c.\" Grosart indicated for several of the poems that there was only one extant copy known."]}, {"page": "Abraham Cowley", "response": ["The works of Cowley were collected in 1668, when Thomas Sprat brought out an edition in folio, to which he prefixed a life of the poet. There were many reprints of this collection, which formed the standard edition till 1881, when it was superseded by Alexander Balloch Grosart's privately printed edition in two volumes, for the Chertsey Worthies library. The Essays have frequently been revived. A Satire Against Separatists, printed in 1675, has been variously attributed to Cowley and to Peter Hausted."]}, {"page": "A. B. Grosart", "response": ["#REDIRECT Alexander Balloch Grosart"]}, {"page": "Grosart", "response": ["#REDIRECT Alexander Balloch Grosart"]}, {"page": "Fulke Greville, 1st Baron Brooke", "response": ["Greville's works were collected and reprinted by Alexander Balloch Grosart, in 1870, in four volumes. Poetry and Drama of Fulke Greville, edited by Geoffrey Bullough, was published in 1938. The Prose Works of Fulke Greville, edited by John Gouws, were published in 1986.  The Selected Poems of Fulke Greville edited by Thom Gunn, with an afterword by Bradin Cormack, was published in 2009 (University of Chicago Press, .)"]}, {"page": "Princeton Theological Seminary", "response": ["* Princeton Theological Seminary Library (\"The New Library\") was opened in 2013 and holds the bulk of the seminary's collection. The library is also home to the Center for Barth Studies,Karl Barth>Center for Barth Studies the Reigner Reading Room, and special collections including the Abraham Kuyper collection of Dutch Reformed Protestantism and personal libraries of theologians like Ashbel Green, William Buell Sprague, Joseph Addison Alexander, Alexander Balloch Grosart, William Henry Green, Samuel Miller, and B. B. Warfield. "]}, {"page": "Dr AB Grosart", "response": ["#REDIRECT Alexander Balloch Grosart"]}, {"page": "AB Grosart", "response": ["#REDIRECT Alexander Balloch Grosart"]}, {"page": "1899 in Ireland", "response": ["*16 March – Alexander Balloch Grosart, Presbyterian minister and literary editor (born 1827 in Scotland)"]}, {"page": "Leadhills", "response": ["* A.G.B. (Alexander Balloch Grosart), \"A Trip to the Gold Regions of Scotland, Described in a letter to a Friend (Part I)\", The Gentleman’s Magazine and Historical Review, Vol.39, (May 1853), pp.459-468; \"A Trip to the Gold Regions of Scotland, Described in a letter to a Friend (Part II)\", The Gentleman’s Magazine and Historical Review, Vol.39, (June 1853), pp.589-598."]}, {"page": "A. Grosart", "response": ["#REDIRECT Alexander Balloch Grosart"]}, {"page": "Balloch", "response": ["* Alexander Balloch Grosart (1827–1899), Scottish clergyman and literary editor"]}, {"page": "Alexander Grosart", "response": ["#REDIRECTAlexander Balloch Grosart"]}, {"page": "Edinburgh Cape Club", "response": ["* Further Descriptions of The Cape Club from The Works of Robert Fergusson by Alexander Balloch Grosart, 1851 (Harvard College Library)."]}, {"page": "Robert Tofte", "response": ["It is dedicated to Mistress Anne Herne, but the true \"Laura\" or \"Alba\" (Tofte's muse) appears to have been a lady of the name Caryll. This work includes the first reference to William Shakespeare's play Love's Labour's Lost in print: \"LOVES LABOURS LOST, I once did see a Play, / Ycleped so, so called to my paine\" (third part, stanza 81). Alba was edited and republished by Alexander Balloch Grosart in 1880. It is also included in Nelson's Poetry of Robert Tofte.", "* Alexander Balloch Grosart, Introduction to his edition of Tofte's Alba, 1880."]}, {"page": "A.B. Grosart", "response": ["#redirectAlexander Balloch Grosart"]}, {"page": "A B Grosart", "response": ["#redirectAlexander Balloch Grosart"]}, {"page": "Selimus (play)", "response": ["The work of the Scottish clergyman Alexander Balloch Grosart has been crucial to determining the true authorship of Selimus. It was in Grosart's 1898 reprinting of Selimus that he \"reclaimed\" the play as that of Robert Greene and included the play in the collected works of the playwright.Greene, Robert. The Tragical Reign of Selimus, Sometime Emperor of the Turks. Edited by Alexander B. Grosart, J.M. Dent and Co., 1898. pp. v-xxii. He posits that the initials T.G. on the 1638 title page might have been an \"unlucky misprint for R.G.\"Greene, Robert. The Tragical Reign of Selimus, Sometime Emperor of the Turks. Edited by Alexander B. Grosart, J.M. Dent and Co., 1898. pp. v-xxii. Grosart used analyses of word usage and sentence composition to further link Selimus to Robert Greene. (See Preface to the 1898 edition and Life of Robert Greene vol. i of Works, pp. lxxi – lxxvii). It is possible that Robert Greene did not write Selimus alone; further \"linguistic analysis indicates, however, that Selimus' co-author was [Thomas] Lodge,\"Murphy, Donna M.; “Locrine, Selimus, Robert Greene, and Thomas Lodge”, Notes and Queries, Volume 56, Issue 4, 1 December 2009, Pages 559–563, . an ascription supported by rigorous testing conducted by Darren Freebury-Jones."]}, {"page": "Thomas Blake (minister)", "response": ["The following are the chief works named by Alexander Balloch Grosart, based on a list in Anthony Wood's Athenae Oxonienses:Athenae Oxonienses, p. 431."]}, {"page": "Henry Lok", "response": ["Lok's sonnets are introduced by a separate title-page in the Ecclesiastes volume. Two hundred and four treat of the Christian passions, and these are succeeded by 102, entitled Sundry Affectionate Sonets of a feeling Conscience, and the same theme is pursued in a further sequence of twenty-two, entitled Peculiar Prayers. Some copies contain an appendix of sixty secular sonnets, addressed to personalities of Elizabeth's court. Alexander Balloch Grosart. reprinted all these sonnets, together with the one prefixed to James VI's volume.In his Miscellanies of the Fuller Worthies' Library, vol. ii. 1871."]}, {"page": "Alexander B. Grosart", "response": ["#redirect Alexander Balloch Grosart"]}, {"page": "George Benson (theologian)", "response": ["Benson often conversed with dignitaries such as Lord Chancellor Peter King and Edmund Law, the bishop of Carlisle. According to Alexander Balloch Grosart, writing in the Dictionary of National Biography, Benson's views were \"Socinian\" though at this period the term is often confused with Arian."]}, {"page": "Christopher Brooke", "response": ["* The Ghost of Richard the Third. Expressing himselfe in these three parts: 1, His Character; 2, His Legend; 3, His Tragedie, London, 1614. The unique copy in the Bodleian Library was reprinted by John Payne Collier for the Shakespeare Society in 1844, and by Alexander Balloch Grosart in 1872. It is dedicated to Sir John Crompton and his wife Frances.Brooke held a clerkship under Sir John in his office of Curographer of the Fines: Will of Sir John Crompton 1624, UK National Archives, Catalogue reference prob/11/143 Thomas Rodd the bookseller first attributed this work to Brooke at the beginning of the 19th century. The only direct clue lies in 'C. B.', the signature of the dedication. George Chapman, William Browne, 'Fr. Dyune Int. Temp.,' George Wither, Robert Daborne, and Ben Jonson contributed commendatory verses."]}]}}