{"wiki_id": "http://www.wikidata.org/entity/Q4718930", "itemLabel": "Alexander Gatehouse", "itemDescription": "British Army general (1895-1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Gatehouse", "wikipedia_page": {"main": "Major-General Alexander Hugh Gatehouse DSO & bar MC (20 May 1895 – 21 August 1964) was a senior British Army officer who commanded the 10th Armoured Division during the North African campaign of World War II.", "link_mentions": [{"page": "Herbert Lumsden", "response": ["In the early hours of 25 October Lumsden & Montgomery argued fiercely. The relationship between the two men was worse than ever and Lumsden demanded that his armour should be pulled back whilst Montgomery insisted the attack continue. Lumsden asked one of his tank commanders Major General Alexander Gatehouse commanding 10th Armoured Division, to back him up. In a heated telephone conversation with Montgomery, Gatehouse said that he concurred with Lumsden and that to advance through uncharted and uncleared minefields, covered by strong batteries of anti-tank guns, with the noise of tank tracks making surprise impossible, would be disastrous. Montgomery modified the scope of the attack from six armoured regiments to one: the Staffordshire Yeomanry. It lost all but fifteen of its tanks and the operation ended where it had begun, on the wrong side of the Miteiriya Ridge having failed to break through with the armour.Barnett, Correlli. \"The Desert Generals\". Hachette UK, 2011."]}, {"page": "10th Armoured Division (United Kingdom)", "response": ["|Major-General Alexander Gatehouse"]}, {"page": "Sidney Kirkman", "response": ["Kirkman recalled, in particular, one incident, when he found Major General Alexander Gatehouse, commanding the 10th Armoured Division, who found himself spearheading the Eighth Army's advance. \"Now I thought: in the First World War an empty road always worried me − because you always worried who was in possession: sometimes they were your property or the Boches'. I was always cautious about empty roads. I didn't go motoring on, I remained with those tanks, and eventually I found out they were the leading tanks of Eighth Army.\"Hamilton (1984), p. 40"]}, {"page": "Operation Battleaxe order of battle", "response": ["***4th Armoured Brigade - Brigadier Alexander GatehouseThe 4th Armoured Brigade was under the effective command of Masservy's 4th Indian Infantry Division"]}, {"page": "Second Battle of El Alamein order of battle", "response": [": Major-General Alexander Gatehouse"]}, {"page": "Battle of Alam el Halfa order of battle", "response": ["* 10th Armoured Division – Major-General Alexander Gatehouse"]}, {"page": "Battle of Point 175", "response": ["The Eighth Army planned to engage and destroy the tanks of the Afrika Korps with the tanks of XXX Corps (Lieutenant-General Willoughby Norrie) in the 7th Armoured Division (Major-General William Gott), while the 1st South African Division (Major-General George Brink) covered their left flank. On the right flank, XIII Corps (Lieutenant-General Alfred Reade Godwin-Austen), supported by the 4th Armoured Brigade Group (Brigadier Alexander Gatehouse), would make a clockwise flanking advance west of Sidi Omar with the 2nd New Zealand Division (Major-General Bernard Freyberg), while the 4th Indian Division contained the Axis frontier posts. The New Zealanders were to hold a position threatening the rear of the line of Axis defensive strong points, east from Sidi Omar to the coast at Halfaya. When the Axis tanks had been defeated, XXX Corps was to continue north-west to Tobruk and rendezvous with a break-out by the 70th Infantry Division garrison."]}, {"page": "Gatehouse (disambiguation)", "response": ["* Alexander Gatehouse (1895–1964), British Army officer"]}, {"page": "Gatehouse, Alexander", "response": ["#redirectAlexander Gatehouse"]}, {"page": "Robert Gatehouse", "response": ["Sir Robert Alexander Gatehouse (30 January 1924 – 30 October 2002) was a British barrister and judge. He was  a judge of the High Court (Queen’s Bench Division) from 1985 to 1996."]}]}}