{"wiki_id": "http://www.wikidata.org/entity/Q4717545", "itemLabel": "Alex Neilson", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Neilson", "wikipedia_page": {"main": "Alex Neilson (born 22 September 1982) is an English drummer, percussionist and singer who is based in Glasgow but grew up in Leeds. He is a founding member and main songwriter of folk-rock group Trembling Bells (2008-2018). He is also known for his continuing collaborations with Alasdair Roberts, Will Oldham and Richard Youngs, and for his work with elusive American singer/songwriter Jandek.", "link_mentions": [{"page": "Alasdair Roberts (musician)", "response": ["Since then, Roberts has released two further albums of traditional folk songs – No Earthly Man and Too Long in This Condition – plus three albums of original songs: Farewell Sorrow, The Amber Gatherers and Spoils. A fourth, A Wonder Working Stone, was released in January 2013, credited to Alasdair Roberts and Friends, a group of musicians which includes among others Stevie Jones, Rafe Fitzpatrick, Olivia Chaney and Alex Neilson. In 2015 Roberts released a self-titled album, a return to relative sparseness of earlier albums, and in 2017 Pangs, which was again a more collaborative album, featuring musicians with whom Roberts has previously worked – Stevie Jones, Tom Crossley and Alex Neilson – and backing vocals from Debbie Armour.", "*Drums: Alex Neilson, Shane Connolly, Rian Murphy, Tom Crossley", "*With Alex Neilson, Lavinia Blackwall and Michael Flower – under the group name Black Flowers – Roberts played on the album I Grew From a Stone to a Statue.", "*I Grew From a Stone to a Statue – Bo Weavil, 2009, as a member of the Black Flowers group with Alex Neilson, Lavinia Blackwall and Michael Flower"]}, {"page": "Alastair Galbraith", "response": ["Later that year he was awarded an Arts Foundation of New Zealand Laureate Award and released Belsayer Time, a collaboration with Richard Youngs and Alex Neilson.", "* 2006 – Belsayer Time EP with Richard Youngs and Alex Neilson – Time-Lag – Time-Lag 034"]}, {"page": "Culture in Glasgow", "response": ["The city also boasts a flourishing experimental music scene, and plays home to Alex Neilson and Richard Youngs. Glasgow hosts the long-running Install and Subcurrent annual festivals, which have featured underground artists such as Gustav Metzger and Tony Conrad, as well as reclusive American musician Jandek's first ever live performance. The Soundlab season at Glasgow Concert Halls presents excellent Scottish and international artists; while the Minimal Glasgow season features major names like Steve Reich and Philip Glass alongside up and coming acts."]}, {"page": "Glasgow Sunday", "response": ["Glasgow Sunday is the second of four albums released in 2005 by musician Jandek on Corwood Industries, as (0779). His 41st overall, it was recorded live on October 17, 2004 at The Arches, Glasgow, as part of the Instal festival. This was the first known live appearance of Jandek, who played unannounced with backing from Richard Youngs on bass and Alex Neilson on drums."]}, {"page": "Richard Youngs", "response": ["A keen collaborator, he has released albums with Matthew Bower, Brian Lavelle, Neil Campbell, Stephen Todd, Makoto Kawabata, Alex Neilson, Andrew Paine (under their given names and under the group names Ilk and Urban Parable), Telstar Ponies, and his longest standing partner, Simon Wickham-Smith. He has performed live with Heather Leigh Murray, Vibracathedral Orchestra and also with Matthew Bower's groups Sunroof! and Skullflower. He was also a member of the collective A Band.", "Youngs has also gained attention from his live performances for the notoriously reclusive American avant-folk/blues singer-songwriter Jandek. Youngs can be heard on the Glasgow Sunday, Newcastle Sunday and Glasgow Monday albums, which were recorded at Jandek's first 3 (known) live performances. He also appears on Glasgow Friday and Camber Sands Sunday. There was one further show at which Youngs appeared but drummer Alex Neilson (who completed the line-up on all these shows) has advised the Brainwashed website that this performance - at Mono in Glasgow on 18 May 2006 (the day after the performance released as \"Bristol Wednesday\") - did not record successfully. For some time, this left no further available live performances with Youngs as a participant available for release. However, the trio reunited in Manchester, UK on 21 April 2012 and again in Glasgow on 6 April 2013.", "===With Alex Neilson===", "* House of Constant Song - with Alex Neilson - on Not Alone, a 5-CD benefit album on Jnana Records, with all proceeds donated to Médecins Sans Frontierès specifically to target their work on the AIDS epidemic in Africa - 2006", "* It's All Waves - with Alex Neilson - on George Ferguson McKeating, a 2-CDR compilation by British journalist and writer Scott McKeating with all proceeds going to the Pancreatic Cancer Research Fund (Bells Hill 2009)."]}, {"page": "Birchville Cat Motel", "response": ["Kneale operates the labels Celebrate Psi Phenomenon and Battlecruiser which have issued CDs by artists from New Zealand and overseas, including Matthew Bower (under the name Mirag) and Simon Wickham-Smith with recent releases by Richard Youngs and Alex Neilson and one involving Tony Conrad. Kneale has used Birchville Cat Motel as a vehicle for many collaborations with other musicians, including Lee Ranaldo, Neil Campbell, and Bruce Russell. He also records under the names Black Boned Angel, Brilliant Swords, and Ming and compiled the Prince tribute album Shut Up Already Damn!."]}, {"page": "Ashtray Navigations", "response": ["Reviewing Todd's 36th album, The Love that Whirrs, critic Larry Dolman wrote \"It's a pretty mammoth piece of work – almost 80 minutes of music spread out over six heavy tracks. They tend to start as intense sun-blinding drone-fields, but if you hold on tight for a minute or two and adjust yourself to these new conditions, you'll start to notice a wealth of detail, provided by a real band of ringers. Todd has Alex Neilson (Directing Hand, accompanist with some Jandek live performances) on shimmering, fracturing percussion and Ben Reynolds on raga-style guitar and banjo. (Also, one Melanie Delaney appears on one epic track, playing reeds & tapes.) Trash drone, free skiffle, new electric raga, sun blindness music, call it what you will, this is a powerful statement.\"", "Although Todd still records solo, most recent Ashtray Navigations titles and live shows have been undertaken by a duo of Todd and Melanie Crowley or by a trio of Todd, Crowley and one other, often Phil Legard (Xenis Emputae Travelling Band) although the line-up has also been joined at one time or another by Alex Neilson, Bill Kouligas (Family Battle Snake) and Ruaraidh Sanachan (Nackt Insecten) – the latter two can be heard on \"Backstage Education\" a limited four-disc document of Ash Nav's 2007 summer tour."]}, {"page": "Tanakh (band)", "response": ["Poe relocated to Italy prior to the release of Dieu Deuil after the offer of an ESL teaching job in Florence; further Tanakh performances and tours were based out that city for the next few years. Most of Tanakh's fourth album, 2006's Ardent Fevers,  was written in Italy but recorded in Richmond by Hoffa during a return visit to the city in the summer of 2004. Guest performers on Ardent Fevers included Isobel Campbell and Alex Neilson, who had been introduced to Poe by Alasdair Roberts after the two had played shows together in Scotland."]}, {"page": "Volcano the Bear", "response": ["Moore played drums on the 1999 L.P. Free Surf Music #1 by Alan Jenkins and The Thurston Lava Tube, drummed for The Nightingales for a while, and in 2005 formed the duo Dragon or Emperor with occasional VtB collaborator Stewart Brackley. He also released a solo album The Accidental on which Alex Neilson and Andrew Liles appear. He is currently a member of the Brooklyn band Freetime."]}, {"page": "Not Alone (album)", "response": ["#Alex Neilson & Richard Youngs - \"House of Constant Song\""]}, {"page": "Newcastle Sunday", "response": ["Like 2005's Glasgow Sunday, Newcastle Sunday features the Corwood Representative on vocals and guitar along with bassist Richard Youngs and drummer Alex Neilson, although neither sideman is credited on the album's cover. It is also notable for being Corwood Industries' first-ever double-CD release."]}, {"page": "Live: Take No Prisoners", "response": ["Alex Neilson, writing for The Wire said, \"this is the album I chose to remember Reed by. Gratuitous, conflicted, corrupted by his own brilliance – but, like the judo master who uses his opponent’s strength against him, Reed harnesses these very ingredients to make something truly transcendent.\" Alternately, AllMusic said, \"On the odd moments when Lou is focused enough to actually perform a song from start to finish (such as \"Pale Blue Eyes\" or \"Coney Island Baby\"), he's in fine form, sounding loose but enthusiastic, but those moments don't happen especially often.\" Christgau said it was, \"essentially a comedy record. Lenny Bruce is the obvious influence. And I thank Lou for pronouncing my name right.\""]}, {"page": "Will Oldham discography", "response": ["*Is It The Sea? – Bonnie 'Prince' Billy with Harem Scarem & Alex Neilson (October 20, 2008) UK #172", "*Is It The Sea? – Bonnie 'Prince' Billy with Harem Scarem & Alex Neilson (Domino, 2008)"]}, {"page": "Glasgow Monday", "response": ["Glasgow Monday is the 47th release, third live album, and second-ever double album release, from avant-folk/blues singer/songwriter Jandek.  It is his fifth release of the year (counting the DVD version of Glasgow Sunday) and features \"The Corwood Representative\" on piano and vocals, along with the same rhythm section he performed with at the shows documented on Glasgow Sunday and Newcastle Sunday, bassist Richard Youngs (playing upright bass) and drummer/percussionist Alex Neilson who accents the music with chimes and echoing percussion."]}, {"page": "Taurpis Tula", "response": ["Taurpis Tula is a Glasgow-based band currently comprising David Keenan, Heather Leigh Murray and Alex Neilson.  Initially a duo of Keenan and Murray (both of whom are listed with the surname \"Leigh X\" on their debut album), they expanded to a trio in 2005 with the Steel Rods Bruise Butterflies CDR on Chocolate Monk being the first document of this incarnation. They toured Europe in 2007 with The Skaters, in support of two further albums."]}, {"page": "The One Ensemble of Daniel Padden", "response": ["The One Ensemble is a British musical group, based in Glasgow. The project was initially conceived by Volcano The Bear member Daniel Padden as a vehicle for his solo work, and their first three albums were released under the name The One Ensemble Of Daniel Padden. Two studio albums in this mould were released, an eponymous debut on the Catsup Plate label in 2003 and The Owl Of Fives on Textile Records in 2004. Although mostly recorded by Padden on his own, these albums featured contributions from other musicians including Jeremy Barnes, Alex Neilson and David Keenan.", "After this, the project expanded to a quintet featuring Aby Vulliamy, Peter Nicholson, Chris Hladowski and Alex Neilson. This line-up was documented on the Live at VPRO Radio album released by Brainwashed Recordings in 2004. In 2005, Neilson left, and the group's name was changed to \"The One Ensemble\" with Padden now releasing his solo work under his given name. Their fourth album Wayward The Fourth has been released by the label, Secret Eye in January 2007."]}, {"page": "VHF Records", "response": ["The label was founded by Bill Kellum in 1991, originally to release a single each by his own band, Rake, and that of his friends, Wingtip Sloat. After a handful of releases by both bands, Kellum acquired the US rights to the first releases by UK psychedelic group Flying Saucer Attack including the CD edition of their debut album. Following this, Kellum released an album by Matthew Bower's Skullflower, which in turn led to the release of an LP by Bower and Richard Youngs. Since then, Youngs has released a dozen collaborative albums on the label, including 6 with Simon Wickham-Smith (who has also essayed two solo sets for the imprint), 3 with Alex Neilson, one from his progressive rock unit Ilk (with Andrew Paine) and one with Makoto Kawabata. Kawabata has also released 3 solo albums for the label. Other artists include Vibracathedral Orchestra, Roy Montgomery, Jack Rose, Pelt, and Stephen O'Malley's Æthenor. Matthew Bower released another 2 Skullflower albums on the label, one Total release and several more under his most recent solo alias, Sunroof!."]}, {"page": "Harem Scarem (folk band)", "response": ["The band also appear, with Alex Neilson, on the 2008 Bonnie 'Prince' Billy album Is It the Sea?, a live recording of a 2006 gig at the Queen's Hall in Edinburgh."]}, {"page": "Polly Vaughn", "response": ["|Bonnie 'Prince' Billy, Harem Scarem and Alex Neilson"]}, {"page": "Neilson (name)", "response": ["*Alex Neilson (born 1982), British musician"]}, {"page": "Horsforth School", "response": ["*Alex Neilson, Trembling BellsInterview, Stylus magazine"]}, {"page": "Glasgow Friday", "response": ["Glasgow Friday is a live album by Jandek released in 2008. It is Jandek's 53rd release. The album was recorded on 14 October 2005 at The Arches in Glasgow. Jandek was performing as part of the Instal festival, the same festival and venue at which he had made his unannounced live debut in 2004 (released as Glasgow Sunday). As with his previous Glasgow performances, he was accompanied by Richard Youngs on bass guitar and Alex Neilson on drums."]}, {"page": "Is It the Sea?", "response": ["Is It the Sea? is a 2008 live album by Bonnie \"Prince\" Billy, featuring Harem Scarem and Alex Neilson. It was recorded at the Queen's Hall in Edinburgh during his sold out tour of Scotland and Ireland in the Spring of 2006, and includes songs of the then forthcoming album The Letting Go. Bonnie 'Prince' Billy was accompanied by Edinburgh’s Harem Scarem on close harmonies, fiddle, flute, banjo and accordion and Glasgow’s Alex Neilson on drums and percussion."]}, {"page": "Aleph at Hallucinatory Mountain", "response": ["*Alex Neilson – drums, percussion"]}, {"page": "Trembling Bells", "response": ["Trembling Bells was a Scottish folk rock group formed in 2008 by drummer Alex Neilson, a musician with a history of free and improvised playing with several artists. Based in Glasgow, the group released three albums through Honest Jon's Records. A fourth, The Sovereign Self, was released on 29 June 2015, followed by an EP in 2016, both on Tin Angel Records. Their last album, Dungeness, was released in March 2018. In September 2018, frontwoman Lavinia Blackwall announced she was leaving the band after 10 years. Following a further run of gigs, the band announced they were to split, with members focussing on their individual projects.", "Following Lavinia Blackwall's announcement she was leaving the band, Trembling Bells decided to split at the end of 2018. Their final release was a 2019 Record Store Day 10\", I am the King, a joint work with Alex Neilson's solo project Alex Rex.", "* Alex Neilson (drums, vocal)"]}, {"page": "Sparrow and the Workshop", "response": ["O’Sullivan has also recently released a collaborative album with renowned musicians Alasdair Roberts, Alex Neilson, and Bonnie \"Prince\" Billy under the moniker Three Queens in Mourning(2020).. In addition, she collaborated with Sean Cumming (John Knox Sex Club) on storytelling project Do the Gods Speak Esperanto, released in 2017."]}, {"page": "Zapoppin'", "response": ["Tom Sharpe and Luke Richards met in 2005 while studying at University College Falmouth. The band formed in January 2007 and played their first official show supporting Alex Neilson's and David Keenan's free jazz duo Tight Meat. The following October Zapoppin' self-released their debut album, Z 1."]}, {"page": "Last (Unthanks album)", "response": ["* Alex Neilson – drums"]}, {"page": "The Marble Downs", "response": ["* Alex Neilson - drums, bells, theremin, vocals"]}, {"page": "Jill O'Sullivan", "response": ["O’Sullivan has also recently released a collaborative album with renowned musicians Alasdair Roberts, Alex Neilson, and Bonnie \"Prince\" Billy under the moniker Three Queens in Mourning (2020). In addition, she collaborated with Sean Cumming (John Knox Sex Club) on storytelling project Do the Gods Speak Esperanto, released in 2017. Over the years O'Sullivan has also collaborated with Scott Hutchinson, Emma Pollock, and James Yorkston, amongst others, and toured with the likes of the Pogues and the Brian Jonestown Massacre. O'Sullivan has been playlisted on BBC6 Music, BBC Radio 1 and FM4, and has partaken in Lauren Laverne, Marc Riley and Maida Vale radio sessions, and has performed at Glastonbury, Bestival, Hop Farm Festival, End of the Road, Green Man, London Calling and T in the Park, amongst others."]}, {"page": "Alex Rex", "response": ["#REDIRECT Alex Neilson"]}, {"page": "Rachel Newton", "response": ["The next album from the Furrow Collective, Wild Hog, was released in 2016. As with previous releases the album was make up of new versions of traditional songs. As well as the four members of the group the recording featured Stevie Jones on double bass and Alex Neilson on drums. The album got four-star reviews from The Observer, The Guardian and the Financial Times."]}]}}