{"wiki_id": "http://www.wikidata.org/entity/Q4718789", "itemLabel": "Alexander Dyce", "itemDescription": "Editor and literary historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Dyce", "wikipedia_page": {"main": "Alexander Dyce (30 June 1798 – 15 May 1869) was a Scottish dramatic editor and literary historian.He was born in Edinburgh and received his early education at the high school there, before becoming a student at Exeter College, Oxford, where he graduated B.A. in 1819. He took holy orders, and became a curate at Lantegloss, in Cornwall, and subsequently at Nayland, in Suffolk; in 1827 he settled in London.\nHis first books were Select Translations from Quintus Smyrnaeus (1821), an edition of Collins (1827), and Specimens of British Poetesses (1825). He issued annotated editions of George Peele, Robert Greene, John Webster, Thomas Middleton, Marlowe, and Beaumont and Fletcher, with lives of the authors and much illustrative matter. He completed, in 1833, an edition of James Shirley left unfinished by William Gifford, and contributed biographies of Shakespeare, Pope, Akenside and Beattie to Pickering's Aldine Poets. He also edited (1836–1838) Richard Bentley's works, and Specimens of British Sonnets (1833). His carefully prepared and exhaustive edition of John Skelton, which appeared in 1843, for the first time presented the full oeuvre (so far as it survives) of this unjustly overlooked and often maligned poet of the early Tudor period. It is still indispensable for a serious study of the poet. In 1857 his edition of Shakespeare was published by Moxon; and the second edition was issued by Chapman & Hall in 1866. He also published Remarks on Collier's and Knight's Editions of Shakespeare (1844); A Few Notes on Shakespeare (1853); and Strictures on Collier's new Edition of Shakespeare (1859), which ended the long friendship between Dyce and the literary scholar (and forger) John Payne Collier.\nDyce was closely connected with several literary societies, and undertook the publication of Kempe's Nine Days' Wonder for the Camden Society; and the old plays of Timon of Athens and Sir Thomas More were published by him for the Shakespeare Society. He was associated with Halliwell-Phillips, John Payne Collier and Thomas Wright as one of the founders of the Percy Society, for publishing old English poetry. Dyce also issued Recollections of the Table Talk of Samuel Rogers (1856).\nBy the time of his death, Dyce had collected a valuable library, containing many rare Elizabethan books, and this collection was left to the South Kensington Museum (Victoria and Albert Museum).  Dyce's bequest comprised 80 pictures, 63 miniatures, 802 drawings, 1,511 prints, 74 rings, 27 art objects, and 13,596 books. His wide reading in Elizabethan literature enabled him to explain much that was formerly obscure in Shakespeare. While preserving all that was valuable in former editions, Dyce added much fresh matter. His Glossary, a large volume of 500 pages, was the most exhaustive that had appeared.\nThis entry is updated from the 1911 Encyclopædia Britannica.", "link_mentions": [{"page": "Victoria and Albert Museum", "response": ["One of the great treasures in the library is the Codex Forster, one of Leonardo da Vinci's note books. The Codex consists of three parchment-bound manuscripts, Forster I, Forster II, and Forster III, quite small in size, dated between 1490 and 1505. Their contents include a large collection of sketches and references to the equestrian sculpture commissioned by the Duke of Milan Ludovico Sforza to commemorate his father Francesco Sforza. These were bequeathed with over 18,000 books to the museum in 1876 by John Forster. The Reverend Alexander Dyce was another benefactor of the library, leaving over 14,000 books to the museum in 1869. Amongst the books he collected are early editions in Greek and Latin of the poets and playwrights Aeschylus, Aristotle, Homer, Livy, Ovid, Pindar, Sophocles and Virgil. More recent authors include Giovanni Boccaccio, Dante, Racine, Rabelais and Molière.", "Richard Ellison's collection of 100 British watercolours was given by his widow in 1860 and 1873 'to promote the foundation of the National Collection of Water-Color Paintings'. Over 500 British and European oil paintings, watercolours and miniatures and 3000 drawings and prints were bequeathed in 1868–1869 by the clergymen Chauncey Hare Townshend and Alexander Dyce."]}, {"page": "Aphra Behn", "response": ["After her death in 1689, Behn's literary work was marginalised and often dismissed outright, notwithstanding the 1700 publication of her Histories, Novels, and Translations which preserved her literary production for future re-discovery.Cox, Michael, ed. (2004). The Concise Oxford Chronology of English Literature. Oxford University Press. . Until the mid-20th century Behn was repeatedly dismissed as a morally depraved minor writer. In the 18th century her literary work was scandalised as lewd by Thomas Brown, William Wycherley, Richard Steele and John Duncombe. Alexander Pope penned the famous lines \"The stage how loosely does Astrea tread, Who fairly puts all characters to bed!\". In the 19th century Mary Hays, Matilda Betham, Alexander Dyce, Jane Williams and Julia Kavanagh decided that Behn's writings were unfit to read, because they were corrupt and deplorable. Among the few critics who believed that Behn was an important writer were Leigh Hunt, William Forsyth and William Henry Hudson."]}, {"page": "Richard Bentley", "response": ["He wrote the Dissertation on the Epistles of Phalaris (1699), his major academic work, almost accidentally. In 1697, William Wotton, about to bring out a second edition of his Ancient and Modern Learning, asked Bentley to write out a paper exposing the spuriousness of the Epistles of Phalaris, long a subject of academic controversy. The Christ Church editor of Phalaris, Charles Boyle, resented Bentley's paper. He had already quarrelled with Bentley in trying to get the manuscript in the royal library collated for his edition (1695). Boyle wrote a response which was accepted by the reading public, although it was much later criticised as showing only superficial learning. cites Dr Alexander Dyce, Bentley's Works, 1836–1838 The demand for Boyle's book required a second printing. When Bentley responded, it was with his dissertation. The truth of its conclusions was not immediately recognised, but it has a high reputation.", "* Works of Richard Bentley, collected by Alexander Dyce, 1836. v. 1–2. Dissertations upon the epistles of Phalaris, Themistocles, Socrates, Euripides, and upon the fables of Aesop; also, Epistola ad Joannem Millium – v. 3. Sermons preached at Boyle's lecture; remarks upon a discourse of free-thinking; proposals for an edition of the Greek testament."]}, {"page": "John Payne Collier", "response": ["He produced the Memoirs of Edward Alleyn for the Shakespeare Society in 1841.J.P. Collier, Memoirs of Edward Alleyn, founder of Dulwich College including some new particulars respecting Shakespeare, Ben Jonson, Massinger, Marston, Dekker, &c. (Shakespeare Society, London 1841), (Internet Archive). He followed up this volume with the Alleyn Papers (1843)J.P. Collier, The Alleyn Papers (Shakespeare Society, London 1843), (Internet Archive). and the Diary of Philip Henslowe (1845).J.P. Collier, The Diary of Philip Henslowe: from 1591 to 1609 ; printed from the original manuscript preserved at Dulwich College (Shoberl, London 1845), (Internet Archive). Collier used these opportunities to commence a series of literary fabrications, as the debates of the following decades revealed. His 8-volume edition of the Works of Shakespeare began to appear in 1842.J.P. Collier (ed.), The Works of William Shakespeare. The Text Formed from an Entirely New Collation of the Old Editions: with the Various Readings, Notes, a Life of the Poet, and a History of the Early English Stage, 8 vols (Whittaker and Co., London 1842-1844): Vol. 1; 2; 3; 4; 5; 6; 7; 8 (Google). His edition attracted criticism from his long-time friend, the literary historian Revd. Alexander Dyce, who nonetheless also found much to commend in it, including Collier's biographical essay.A. Dyce, Remarks on Mr. J.P. Collier's and Mr. C. Knight's editions of Shakespeare (Edward Moxon, London 1844), (Internet Archive). In 1847 he was appointed secretary to the Royal Commission on the British Museum.L.A. Fagan, The Life of Sir Anthony Panizzi, K.C.B., 2nd Edition (2 vols), (Remington and Co., London 1880), I, p. 257 (Hathi Trust). ", "Collier's second edition of the Works of Shakespeare appeared in 6 volumes in 1858, and bore both in its Preface and in the notes to the text a scathing attack on (among others) Alexander Dyce, accusing him of selective appropriation of Collier's emendations without acknowledgement, motivated by an intention to disparage.J.P. Collier (ed.), Shakespeare's Comedies, Histories, Tragedies and Poems, 2nd Edition, 6 volumes (Whittaker and Co., London 1858), Vol. 1; 2; 3; 4; 5; 6 (Internet Archive). Their friendship irrecoverably broken, Dyce responded in a full volume by rejecting Collier's charges against him as artful and deliberate misrepresentations.A. Dyce, Strictures on Collier's New Edition of Shakespeare, 1858 (John Russell Smith, London 1859), (Google). "]}, {"page": "James Shirley", "response": ["The standard edition of Shirley's works is The Dramatic Works and Poems of James Shirley, with Notes by William Gifford, and Additional Notes, and some Account of Shirley and his Writings, by Alexander Dyce (6 vols., 1833). A selection of his plays was edited (1888) for the Mermaid Series, with an introduction by Edmund Gosse."]}, {"page": "Samuel Rogers", "response": ["Rogers was in effect a literary dictator in England. He made his reputation by The Pleasures of Memory when William Cowper's fame was still in the making. He became the friend of Wordsworth, Walter Scott and Byron, and lived long enough to give an opinion as to the fitness of Alfred Tennyson for the post of Poet Laureate. Alexander Dyce, from the time of his first introduction to Rogers, was in the habit of writing down the anecdotes with which his conversation abounded. In 1856 he arranged and published selections as Recollections of the Table-Talk of Samuel Rogers, to which is added Porsoniana. Rogers himself kept a notebook in which he entered impressions of the conversation of many of his distinguished friends—Fox, Edmund Burke, Henry Grattan, Richard Porson, John Horne Tooke, Talleyrand, Lord Erskine, Scott, Lord Grenville and the Duke of Wellington. They were published by his nephew William Sharpe in 1859 as Recollections by Samuel Rogers; Reminiscences and Table-Talk of Samuel Rogers, Banker, poet, and Patron of the Arts, 1763–1855 (1903), by GH Powell, is an amalgamation of these two authorities."]}, {"page": "Mark Akenside", "response": ["The authoritative edition of Akenside's Poetical Works is that prepared by Robin Dix (1996). An important earlier edition was prepared by Alexander Dyce (1834) for the Aldine Edition of the British Poets, and reprinted with small additions in subsequent issues of the series. See Dyce's Life of Akenside prefixed to his edition, also Johnson's Lives of the Poets, and the Life, Writings and Genius of Akenside (1832) by Charles Bucke."]}, {"page": "Chronology of Shakespeare's plays", "response": [":First published: 1844, edited by Alexander Dyce for the Shakespeare Society. Published under the name Sir Thomas More, A Play; now first printed."]}, {"page": "George Peele", "response": ["Peele's Works were edited by Alexander Dyce (1828, 1829–1839 and 1861), A. H. Bullen (2 vols., 1888), and by Charles Tyler Prouty (3 vols., 1952–1970).  An examination of the metrical peculiarities of his work is to be found in Richard Lämmerhirt's Georg Peele, Untersuchungen über sein Leben und seine Werke (Rostock, 1882). See also Professor F.B. Gummere, in Representative English Comedies (1903); and an edition of The Battell of Alcazar, printed for the Malone Society in 1907."]}, {"page": "John Forster (biographer)", "response": ["In 1868 appeared his Life of Landor.  On the death of his friend Alexander Dyce, Forster undertook the publication of his third edition of Shakespeare. For several years he had been collecting materials for a life of Jonathan Swift, but he interrupted his studies in this direction to write his standard Life of Charles Dickens. He had long been intimate with the novelist, and it is by this work that John Forster is now chiefly remembered. The first volume appeared in 1872, and the biography was completed in 1874. It was clearly an important work for the late nineteenth century English novelist George Gissing who wrote in his diary in January 1888, that it was \"a book I constantly take up for impulse, when work at a standstill\".Coustillas, Pierre ed. London and the Life of Literature in Late Victorian England: the Diary of George Gissing, Novelist. Brighton: Harvester Press, 1978, p.20. A decade or so later Gissing was asked to revise Forster's work, and this was published by Chapman and Hall in October 1902."]}, {"page": "Sir Thomas More (play)", "response": ["The manuscript was first printed and published in 1844, two and a half centuries after it was written, by the Shakespeare Society, edited by Alexander Dyce; and again in 1911 by the Malone Society, edited by W. W. Greg."]}, {"page": "William Crowe (poet)", "response": ["Crowe's son died in battle in 1815, and in Notes and Queries 1st ser. vii. 6, 144 (1853), there is a Latin monody by his father on his loss. His verses intended to have been spoken at the theatre at Oxford on the installation of the Duke of Portland as chancellor were praised by Rogers and Moore. His sonnet to Petrarch is included in the collections of English sonnets by Robert Fletcher Housman and Alexander Dyce. "]}, {"page": "John Fletcher (playwright)", "response": ["During the Commonwealth, many of the playwright's best-known scenes were kept alive as drolls, the brief performances devised to satisfy the taste for plays while the theatres were suppressed. At the re-opening of the theatres in 1660, the plays in the Fletcher canon, in original form or revised, were by far the most common fare on the English stage. The most frequently revived plays suggest the developing taste for comedies of manners. Among the tragedies, The Maid's Tragedy and especially, Rollo Duke of Normandy held the stage. Four tragicomedies (A King and No King, The Humorous Lieutenant, Philaster and The Island Princess) were popular, perhaps in part for their similarity to and foreshadowing of heroic drama. Four comedies (Rule a Wife And Have a Wife, The Chances, Beggars' Bush and especially The Scornful Lady) were also popular. Fletcher's plays, relative to those of Shakespeare and to new productions, declined. By around 1710, Shakespeare's plays were more frequently performed and the rest of the century saw a steady erosion in performance of Fletcher's plays. By 1784, Thomas Davies asserted that only Rule a Wife and The Chances were still on stage. A generation later, Alexander Dyce mentioned only The Chances. Since then Fletcher has increasingly become a subject only for occasional revivals and for specialists. Fletcher and his collaborators have been the subject of important bibliographic and critical studies but the plays have been revived only infrequently."]}, {"page": "John Skelton", "response": ["See The Poetical Works of John Shelton; with Notes and some account of the author and his writings, by the Rev. Alexander Dyce (2 vols., 1843). A selection of his works was edited by WH Williams (London, 1902). See also Zur Charakteristik John Skeltons by Dr Arthur Koelbing (Stuttgart, 1904); F Brie, \"Skelton Studien\" in Englische Studien, vol. 38 (Heilbronn, 1877, etc.); A Rey, Skelton's Satirical Poems... (Berne, 1899); A Thummel, Studien über John Skelton (Leipzig-Reudnitz, 1905); G Saintsbury, Hist. of Eng. Prosody (vol. i, 1906); and A Kolbing in the Cambridge History of English Literature (vol. iii, 1909)."]}, {"page": "1825 in poetry", "response": ["* Alexander Dyce, editor, Specimens of British Poetesses, anthology"]}, {"page": "Sonnet 77", "response": ["The original quarto's \"blacks\" in line 10 is usually emended to \"blanks\", following Alexander Dyce. Some critics have defended \"blacks\" as referring to printer's type, or to slate notebooks. If it refers to printers type it allows the reference to the quarto itself as a gift to the young man."]}, {"page": "The Humorous Lieutenant", "response": ["Comic material from the play was adapted into a droll during the Interregnum period. Like many plays in Fletcher's canon, The Humorous Lieutenant was revived at the start the Restoration era, in 1660. When the new Theatre Royal at Drury Lane opened on 8 April 1663, The Humorous Lieutenant was the first play staged, and ran for twelve nights in a row—highly unusual in the repertory system of the time. The play remained popular and was performed repeatedly, in various adaptations, into the early eighteenth century.Sprague, pp. 4-5, 10, 15, 20, 76, 109, 121-3. Adapted forms of the play were published in 1697 and 1717, while the manuscript text was first printed by Alexander Dyce in 1830.Potter, p. 9."]}, {"page": "Dyce (disambiguation)", "response": ["* Alexander Dyce (1798–1869), Scottish dramatic editor and literary historian"]}, {"page": "Eliezer Cogan", "response": ["Cogan had a reputation as a Greek scholar. In the section of Porsoniana appended to Alexander Dyce's Table-talk of Samuel Rogers, p. 302, occurs the anecdote that when Richard Porson was introduced to Cogan with the remark that he was intensely devoted to Greek, Porson's reply was, \"If Mr. Cogan is passionately fond of Greek, he must be content to dine on bread and cheese for the remainder of his life.\" William Parr praised Cogan's \"intellectual powers, his literary attainments, and candour\", and in 1821 stated that he had given directions that on his death a ring should be presented to Cogan. Joseph Priestley was his guide in theology and metaphysics. His works were numerous."]}, {"page": "William Nanson Lettsom", "response": ["He published a translation of the Nibelungenlied, with the title ‘The Fall of the Nebelungers; otherwise the book of Kriemhild’, in 1850. He edited from the author's manuscripts William Sidney Walker's ‘Shakespeare's Versification’ (1854) and his ‘Critical Examination of the Text of Shakespeare’ (1860). His friend Alexander Dyce was assisted by Lettsom in his preparation of his edition of Shakespeare. Lettsom also interested himself in textual criticism of the New Testament. "]}, {"page": "The Oxford and Cambridge Magazine", "response": ["* 'Roger's Table Talk.' p. 641–644. A (quite negative) review by William Fulford of Recollections of the Table Talk of Samuel Rogers (1856) by the Scottish writer Alexander Dyce."]}, {"page": "John Mitford (priest)", "response": ["Mitford's collections were dispersed after his death by Sotheby & Wilkinson. His fine art collection of silver Greek coins, cameos, and miniatures was sold on 30 June 1859, the engravings and drawings on 23 July 1859 and two following days, his Greek and Latin classics on 17 December 1859 and six following days. This sale produced £1,029. 19s. The library of English history, plays, and poetry was sold on 24 April 1860 and eleven following days, producing £2,999 2s.; and his manuscripts on 9 July 1860, producing £817 3s. The manuscripts contained three volumes of autograph letters, papers relating to Thomas Gray, his own recollections in fifty-five volumes, the correspondence of Jonathan Toup. Many of the books, with his notes, went to the libraries of Alexander Dyce and John Forster at the South Kensington Museum, or in the library of the British Museum. His commonplace-books are Addit. MSS. 32559-32575 of the British Library, and from them were printed Some Conversations with the Duke of Wellington.Temple Bar, April 1888, pp. 507-13.", "*Thomas Parnell, 1833 and 1866 (with epistle in verse to Alexander Dyce); ", "* Cursory Notes on various Passages in the Text of Beaumont and Fletcher, as edited by Rev. Alexander Dyce, 1856; complimentary to Dyce."]}, {"page": "James Craigie Robertson", "response": ["Robertson died at Canterbury on 9 July 1882, while working on the last volume of his \"Memorials of Becket\". He was a moderate high churchman, out of sympathy with ritualism. Close friends included William MacPherson, John Murray III the publisher, Dean Stanley, and Alexander Dyce; and he knew Alfred Tennyson well."]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* Rev. Alexander Dyce (1798–1869)"]}, {"page": "The Countess of Montgomery's Urania", "response": ["There are no extant eighteenth-century references to Urania. Study of the work resurfaces in the nineteenth century in Alexander Dyce's 1825 Specimens of British Poetesses, in which Dyce reproduces two poems from Pamphilia to Amphilanthus and lists Urania as their source. Later in the nineteenth century, Urania was referenced as an inferior version of the Arcadia in an 1890 history of the English novel by J. J. Jusserand.Paul Salzman, Reading Early Modern Women's Writing, (Oxford: Oxford University Press, 2006), 87."]}, {"page": "Sir Thomas Wyatt (play)", "response": ["The play was first published in 1607, and there is a copy of this edition in the British Library.British Library BLL01000896055 It was not published again until its inclusion in an 1830 edition of the works of John Webster which was put together by Alexander Dyce.British Library BLL01014831826 Most recently, it can be found in Delphi Complete Works of John Webster, an eBook issued by Delphi Classics in 2015, which reproduces the Dyce introduction and text."]}, {"page": "Dyce, Alexander", "response": ["#redirectAlexander Dyce"]}, {"page": "William Maltby", "response": ["Maltby took part in the compilation of the 1813 and 1835 London Institution library catalogues. He also contributed to Recollections of the Table Talk of Samuel Rogers (1866), by Alexander Dyce, an appendix Porsoniana."]}, {"page": "Beachy Head (poem)", "response": ["Early reception of Beachy Head was largely positive, and used the posthumous publication of the volume as an opportunity to praise Smith's career as a poet. An 1807 review in the Annual Review and History of Literature said that \"as a descriptive writer, either in verse or prose, [Smith] was surpassed by few.\" In 1808, a review in British Critic described Beachy Head: With Other Poems as \"some of her best work,\" calling Smith a \"genuine child of genius\" whose \"poetic feeling and ability have rarely been surpassed by any individual of her sex.\" Later, in 1825, Alexander Dyce included extracts from Beachy Head in his anthology, Specimens of British Poetesses: Selected and Chronologically Arranged, in which he praised the poem for its \"fresh and vivid\" descriptions of rural scenery. Dyce praised how Smith's love of botany allowed her to \"paint a variety of flowers with a minuteness and a delicacy rarely equaled.\""]}]}}