{"wiki_id": "http://www.wikidata.org/entity/Q4719184", "itemLabel": "Alexander Hyde", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Hyde", "wikipedia_page": {"main": "Alexander Hyde (1598–1667) was an English royalist clergyman, Bishop of Salisbury from 1665 to 1667.", "link_mentions": [{"page": "Salisbury Cathedral", "response": ["*Alexander Hyde, Bishop of Salisbury (1665–1667)"]}, {"page": "Wylye", "response": ["Rectors include Alexander Hyde, from 1634, who later was bishop of Salisbury."]}, {"page": "Dinton, Wiltshire", "response": ["The rectory and advowson of Dinton were sold in 1585 by Henry Herbert, 2nd Earl of Pembroke (1534–1601) to Lawrence Hyde I (died 1590) of West Hatch, MP for Heytesbury in 1584.History of Parliament biography of Lawrence Hyde I His eldest son Robert Hyde I sold them in 1594 to his brother Sir Lawrence Hyde II (1562–1641), attorney-general to Anne of Denmark, wife of King James I. They were inherited by the latter's son Sir Robert Hyde II (died 1665), Chief Justice of Common Pleas, who died without surviving issue, and then passed to his nephew, Robert Hyde III (died 1722), son of Alexander Hyde, Bishop of Salisbury. Robert III died without progeny and bequeathed the rectory and advowson to his cousin Rev. Robert Hyde IV (died 1723), a Fellow of Magdalen College, Oxford, who in turn passed them to his college, which retained them until 1950, when they passed to the Bishop of Salisbury."]}, {"page": "Bishop of Salisbury", "response": ["| 60px Alexander Hyde"]}, {"page": "Sir Hyde Parker, 5th Baronet", "response": ["Parker was born at Tredington (which was then in Worcestershire). His father, a clergyman, was a son of Sir Henry Parker. His paternal grandfather had married a daughter of Alexander Hyde, Bishop of Salisbury. He began his career at sea in the merchant service. Entering the Royal Navy at the age of 24, he was made lieutenant in 1744, and in 1748 he was made post-captain.Sir Hyde Parker at Oxford Dictionary of National Biography In his royal navy career, he captured a Spanish galleon that was worth £600,000. This gave his family its wealth. Currently, his descendants live in the south wing of Melford Hall."]}, {"page": "Parker baronets", "response": ["The Parker Baronetcy, of Melford Hall in the County of Suffolk, was created in the Baronetage of England on 1 July 1681 for Hugh Parker, an alderman of London. On his death in 1697 the baronetcy descended by special remainder to his nephew, Henry Parker, then of Honington Hall near Stratford on Avon, Warwickshire, Member of Parliament for Evesham and Aylesbury. He married Margaret, daughter and heir of Alexander Hyde, Bishop of Salisbury, first cousin of Edward Hyde, 1st Earl of Clarendon. The most famous member of the family was the naval commander Sir Hyde Parker, the fifth Baronet. His second son was Admiral Sir Hyde Parker. He was the father of the naval commander Admiral Hyde Parker and of John Boteler Parker, a major general in the British Army. The family seat is Melford Hall, Long Melford, Suffolk."]}, {"page": "Robert Tounson", "response": ["He was son of a Renold Toulnesonn, and uncle of Thomas Fuller, On 17 June 1604 he married Margaret, daughter of John Davenant, merchant of London, sister of John Davenant, who succeeded him as bishop of Salisbury, and widow of William Townley. By her he had a large family. Two sons, Robert and John, afterwards received preferment in their uncle Davenant's diocese. His daughter Gertrude married James Harris (1605–1679) of Salisbury, ancestor of the earls of Malmesbury. His daughter Mary married Alexander Hyde.:s:Hyde, Alexander (DNB00)"]}]}}