{"wiki_id": "http://www.wikidata.org/entity/Q472872", "itemLabel": "Jack Cohen", "itemDescription": "British biologist and author (1933-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Cohen_(biologist)", "wikipedia_page": {"main": "Jack Cohen, FRSB (19 September 1933 – 6 May 2019) was a British reproductive biologist also known for his  science books and involvement with science fiction.", "link_mentions": [{"page": "Cosmic microwave background", "response": ["* In Wheelers, a novel (2000) by Ian Stewart & Jack Cohen, CMBR is explained as the encrypted transmissions of an ancient civilization. This allows the Jovian \"blimps\" to have a society older than the currently-observed age of the universe."]}, {"page": "Terry Pratchett", "response": ["Pratchett wrote four Science of Discworld books in collaboration with Professor of mathematics Ian Stewart and reproductive biologist Jack Cohen, both of the University of Warwick: The Science of Discworld (1999), The Science of Discworld II: The Globe (2002), The Science of Discworld III: Darwin's Watch (2005), and The Science of Discworld IV: Judgement Day (2013)."]}, {"page": "Anne McCaffrey", "response": ["McCaffrey immigrated to Ireland with her two younger children in 1970, weeks after filing for divorce. Ireland had recently exempted resident artists from income taxes, an opportunity that fellow science-fiction author Harry Harrison had promptly taken and helped to promote. McCaffrey's mother soon joined the family in Dublin. The following spring, McCaffrey was guest of honour at her first British science-fiction convention (Eastercon 22, 1971). There she met British reproductive biologist Jack Cohen, who would be a consultant on the science of Pern.See forewords or acknowledgments in some Pern books.", "McCaffrey considered most of her work science fiction and enjoyed \"cutting them short when they call me a 'fantasy' writer\". All the Pern books may be considered science fiction, since the dragons were genetically engineered by the Pern colonists. Regarding science, she said \"I don't keep up with developments, but I do find an expert in any field in which I must explain myself and the science involved\". Astronomer Steven Beard often helped with science questions, and McCaffrey acknowledged reproductive biologist Jack Cohen several times."]}, {"page": "The Legacy of Heorot", "response": ["The Legacy of Heorot is a science fiction novel by American writers Larry Niven, Jerry Pournelle, and Steven Barnes, first published in 1987. Reproduction and fertility expert Dr Jack Cohen acted as a consultant on the book, designing the novel life cycle of the alien antagonists, the grendels."]}, {"page": "Ian Stewart (mathematician)", "response": ["Stewart has collaborated with Jack Cohen and Terry Pratchett on four popular science books based on Pratchett's Discworld. In 1999 Terry Pratchett made both Jack Cohen and Professor Ian Stewart \"Honorary Wizards of the Unseen University\" at the same ceremony at which the University of Warwick gave Terry Pratchett an honorary degree.", "*The Collapse of Chaos: Discovering Simplicity in a Complex World, with Jack Cohen (1995)", "*Figments of Reality, with Jack Cohen (1997)", "*Evolving the Alien: The Science of Extraterrestrial Life, with Jack Cohen (2002). Second edition published as What Does a Martian Look Like? The Science of Extraterrestrial Life.", "*The Science of Discworld, with Jack Cohen and Terry Pratchett", "*The Science of Discworld II: The Globe, with Jack Cohen and Terry Pratchett", "*The Science of Discworld III: Darwin's Watch, with Jack Cohen and Terry Pratchett", "*The Science of Discworld IV: Judgement Day, with Jack Cohen and Terry Pratchett", "*Wheelers, with Jack Cohen (fiction)", "*Heaven, with Jack Cohen, , Aspect, May 2004 (fiction)", "*What does a Martian look like? Jack Cohen and Ian Stewart set out to find the answers", "*Press release about Terry Pratchett \"Wizard Making\" of Jack Cohen and Ian Stewart at the University of Warwick"]}, {"page": "Jack Cohen", "response": ["Jack Cohen may refer to:", "*Jack Cohen (biologist) (1933–2019), British biologist and special effects consultant", "*Jack Cohen (politician) (1886–1965), British Conservative Party politician, Member of Parliament for Liverpool Fairfield 1918–1931", "*Jack Cohen (businessman) (1898–1979), British businessman, founded Tesco", "*Jack Cohen (rabbi) (1919–2012), American Reconstructionist rabbi"]}, {"page": "Eastercon", "response": ["|47||1996||Heathrow, London||Evolution||Jack Cohen, Colin Greenland, Paul Kincaid, Bryan Talbot, Maureen Kincaid Speller, Vernor Vinge||?"]}, {"page": "15 Square", "response": [" and scientist Jack Cohen"]}, {"page": "Space elevators in fiction", "response": ["* The Science of Discworld, by Terry Pratchett, Jack Cohen and Ian Stewart, in which Roundworld humanity escapes to the stars via an elevator"]}, {"page": "Future Fantastic", "response": ["Interviewed Story Musgrave (astronaught), Seth Shostak (astronomer), Frank Drake (astronomer), Jill Tarter (astronomer), Arthur C. Clarke (author), Richard F. Haines (scientist), Robert Sheaffer (UFO investigator), Jack Cohen (biologist), John Clute (author), David Bischoff (author), Glenn Campbell (Area 51 Investigator), Bob Lazar (engineer)"]}, {"page": "List of Mensans", "response": ["* Jack Cohen – reproductive biologist and popular science writerMensa  Frequently Asked Questions"]}, {"page": "Earth in culture", "response": ["While in general, a planet can be considered \"too large, and its lifetime too long, to be comfortably accommodated within fiction as a topic in its own right,\" this has not prevented some writers from engaging with the topic (for example, Camille Flammarion's Lumen (1887), David Brin's Earth (1990) or Terry Pratchett's, Ian Stewart's and Jack Cohen's The Science of Discworld (1999)). The iconic photo of Earth known as The Blue Marble, taken by the crew of Apollo 17 (1972), and similar images of Earth from space, might have popularized Earth as a theme in fiction."]}, {"page": "Discworld", "response": ["Pratchett also collaborated with Ian Stewart and Jack Cohen on four books, using the Discworld to illuminate popular science topics. Each book alternates chapters of a Discworld story and notes on real science related to it. The books are:"]}, {"page": "Bristol Festival of Ideas", "response": ["The first festival, held 16–21 May 2005, included speakers Paul Ormerod, A. C. Grayling, Julia Neuberger, Joanna Bourke, John N. Gray, Colin Tudge, Marek Kohn, Jack Cohen, Ian Stewart, John Carey, John Mortimer, Francis Spufford, Deyan Sudjic, Nick Hornby, Julian Baggini, Claudia Hammond, Dick King-Smith, Roger McGough, Brian Patten, David Crystal, Ben Crystal, and Pat Kane Kane – formerly a musician in the band Hue and Cry – was appointed as the UK's first \"thinker in residence\", with a remit to be \"a 'constructive heckler' – identifying broad themes that emerge from the discussions, making connections between realms of knowledge ... being a 'contrarian catalyst'\". Pat Kane, The Play Ethic: The UK's first 'Thinker in Residence' is..., 19 April 2005"]}, {"page": "International Discworld Convention", "response": ["| 8th || 2012 || 24–27 August || Birmingham, UK || The Eighnnnnnnn Discworld Convention  || Sir Terry Pratchett || Colin Smythe, Ian Stewart, Jack Cohen, Rob Wilkins, Lionel Fanthorpe, Stephen Baxter, Bernard Pearson, Jaqueline Simpson, Stephen Briggs, Ian Mitchell || 950", "| 9th || 2014 || 8–11 August || Manchester, UK || The Ankh-Morpork Grand Exhibition || The Black Hat \"to represent Terry in absentia\" (Sir Terry Pratchett attending by video link) || Rob Wilkins (\"representing The Hat for the whole Convention\"), Bernard Pearson, Colin Smythe, Stephen Briggs, Ian Mitchell, Reb Voyce, Jacqueline Simpson, Jack Cohen, Ian Stewart, Daniel Knight, Ben Aaronovitch || ", "| 10th || 2016 || 26–29 August || Warwick, UK || The Band with Rocks In ||  || Rob Wilkins, Bernard Pearson, Colin Smythe, Daniel Knight, Ian Mitchell, Ian Stewart, Jack Cohen, Jacqueline Simpson, Ray Friesen, Reb Voyce, Stephen Briggs, David Brashaw, Diane Duane, Peter Morwood, Mark Oshiro2016 Discworld Convention Guest List || "]}, {"page": "List of University of Birmingham academics", "response": ["* Jack Cohen,  a reproductive biologist also known for his science books and involvement with science fiction."]}, {"page": "Deaths in May 2019", "response": ["*Jack Cohen, 85, British scientist and author.In Memoriam: Jack Cohen"]}, {"page": "Homo narrans", "response": ["The fantasy book The Science of Discworld II: The Globe concludes with the words 'plenty of creatures are intelligent but only one tells stories. That's us: Pan narrans. And what about Homo sapiens? Yes, we think that would be a very good idea.'Terry Pratchett, Ian Stewart and Jack Cohen 2002. (The last sentence is a call back to a quote attributed to Gandhi, included in a footnote earlier in the book, when asked what he thought of civilisation on a visit to London.)"]}, {"page": "Jack Cohen (scientist)", "response": ["#REDIRECT Jack Cohen (biologist)"]}]}}