{"wiki_id": "http://www.wikidata.org/entity/Q4722745", "itemLabel": "Alfred Goodwyn", "itemDescription": "English footballer (1850-1874)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Goodwyn", "wikipedia_page": {"main": "Alfred George Goodwyn (13 March 1850 – 14 March 1874) was an English Royal Engineer, who represented his regiment at football. He was a member of the Regiment's team that was defeated in the very first FA Cup final. He also represented England in the second international football match against Scotland in 1873.", "link_mentions": [{"page": "Royal Engineers A.F.C.", "response": ["*Alfred Goodwyn (1 cap)"]}, {"page": "1872–73 in English football", "response": ["The FA hosted a return match at Kennington Oval on 8 March 1873, now officially rated the first international match in England. England adopted Scotland's 2–2–6 formation but retained only two of the players who had appeared in the November match. These were Harwood Greenhalgh of Notts County in defence and Charles Chenery of the original Crystal Palace club in attack. This team had a strong Wanderers influence with Leonard Howell, Walpole Vidal, Alexander Bonsor, William Kenyon-Slaney and Hubert Heron all selected (there were no Wanderers players in the Glasgow match). Of those, however, only Heron would play more than two matches for England. The other players selected were Alexander Morten in goal, William Clegg (whose brother Charlie had played in the previous match) and two Royal Engineers, Pelham von Donop and Alfred Goodwyn."]}, {"page": "1850s in association football", "response": ["* 13 March – Alfred Goodwyn (d. 1874), England international in 1873 who played in the second official international match; the first international footballer to die."]}, {"page": "1874 in association football", "response": ["* 14 March – Alfred Goodwyn (b. 1850), England defender in the 1873 match against Scotland. Member of the Royal Engineers team in the 1872 FA Cup Final. The first international footballer to die (as a result of a riding injury in India)."]}, {"page": "1872 FA Cup Final", "response": ["|HB || ||  Lieut. Alfred Goodwyn"]}, {"page": "1874 FA Cup Final", "response": ["The final was decided by two goals from Oxford in the first twenty minutes.  Their opponents had spent two weeks training for the match, an innovative concept at the time, but were repeatedly thwarted by Charles Nepean, the Oxford goalkeeper.  The Engineers were said to have missed their best back, Lieut. Alfred Goodwyn, who had been posted overseas.", "Oxford were able to call on their first-choice goalkeeper, Charles Nepean, who had been unable to play in the previous year's final, which Oxford lost.  They also selected William Rawson, whose brother Herbert was in the Engineers' team.  The Engineers, who represented the Corps of Royal Engineers regiment of the British army, had undertaken two weeks of special training before the match, an innovative concept in an era when little importance was placed on training,Warsop, p. 19 but were unable to field Alfred Goodwyn, considered to be their best back, as he had been posted to India earlier in the year.Warsop, p. 81 Oxford's players were not all students, as the team included Arthur Johnson, an ordained clergyman and Fellow of All Souls College.Warsop, p. 91 Around 2,000 spectators were in attendance, a smaller crowd than had attended the previous final.Warsop, p. 41", "As occurred each year until 1882, the winning team did not receive the trophy at the stadium on the day of the match, but later in the year at their annual dinner.Warsop, p. 53 The secretary of the Royal Engineers club, in his official report, stated that Oxford had thoroughly deserved their victory. Some time after the match, the Engineers discovered that Alfred Goodwyn, their absent star player, had died in India on the day of the final of injuries sustained in a fall from a horse."]}, {"page": "List of England international footballers born outside England", "response": ["*Alfred Goodwyn"]}, {"page": "Goodwyn", "response": ["*Alfred Goodwyn (1850–1874), English Royal Engineer who represented his regiment at football"]}, {"page": "Herbert Muirhead", "response": ["Muirhead graduated from RMA Woolwich and joined the Royal Engineers as a Lieutenant on 2 August 1871. Fellow graduates on the same day were two of his fellow FA Cup finalists, Alfred Goodwyn and Edmond Cotter, as well as Richard Ruck, who played in the 1875 FA Cup Final. Muirhead was promoted to Captain twelve years later."]}, {"page": "Edmond Cotter", "response": ["Cotter graduated from RMA Woolwich and joined the Royal Engineers as a Lieutenant on 2 August 1871. Fellow graduates on the same day were two of his fellow FA Cup finalists, Alfred Goodwyn and Herbert Muirhead, as well as Richard Ruck, who played in the 1875 FA Cup Final. Cotter was promoted to Captain twelve years later."]}]}}