{"wiki_id": "http://www.wikidata.org/entity/Q4722607", "itemLabel": "Alfred Hutton", "itemDescription": "British politician (1865-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Hutton_(politician)", "wikipedia_page": {"main": "Alfred Eddison Hutton (31 December 1865 – 30 May 1947) was a British Liberal politician and manufacturer.", "link_mentions": [{"page": "Alfred Hutton", "response": ["thumb|right|220px|Portrait of Alfred HuttonBy John Ernst Breun, photogravure, reproduced in Hutton Cold Steel, frontispiece", "Alfred Hutton FSA (10 March 1839 – 18 December 1910) was a Victorian officer of the King's Dragoon Guards, writer, antiquarian, and swordsman. He originated the first English revival of historical fencing, together with his colleagues Egerton Castle, Captain Carl Thimm, Colonel Cyril Matthey, Captain Percy Rolt, Captain Ernest George Stenson Cooke, Captain Frank Herbert Whittow, Sir Frederick and Walter Herries Pollock.Thimm, Carl Albert. A Complete Bibliography of Fencing and Duelling, London, 1896 Preface", "Alfred Hutton was born on 10 March 1839 at Beverley, Yorkshire the eleventh and youngest child and seventh son of Henry William Hutton (1787–1848) and his wife Marianne (before 1795-1879), only child of John Fleming of Beverley.In Oxford Dictionary of National Biography Henry W Hutton was a captain in the 4th Royal Irish Dragoon Guards, retired 1811.", "thumb|left|Portrait of Alfred Hutton (late 1890s)", "Alfred Hutton arranged combats for numerous London plays, including:", "On 8 October 1911 a memorial tablet - In Memoriam Captain Alfred Hutton Late The King's Dragoon Guards Born March 10, 1839 Died December 18, 1910. A Great Swordsman And Writer On The Art. RIP. - was unveiled in the chancel of St Mary's Church (Astbury) by Lieutenant General Sir Edward Hutton, his nephew.Alfred Hutton's Grave", "Several works of Alfred Hutton have been republished in the past decade: Old sword play: techniques of the great masters (2001, 2010), The sword through the centuries (2002) (original title: The Sword and the Centuries or Old Sword Days and Old Sword Ways), Cold steel: the art of fencing with the sabre (2006).Alfred Hutton's works on WorldCat", "In May 2013 the Forteza Western martial arts studio in Chicago commemorated Hutton via the dedication of the Captain Alfred Hutton Lounge, incorporating a library, research center, museum of historical swords and weapons, art gallery of 19th century fencing prints and a social space.", "* Swordsmanship (1862), written for the members of the Cameron Fencing Club (Simla)This list has been updated based on the Schola Gladiatoria's list of works of Alfred Hutton", "* Notes on Ancient Fence (1895), a descriptive account of the 16th century swordplay, at the Albany Club (Kingston upon Thames), by members of the school of arms, London Rifle Brigade under the direction of Captain Alfred Hutton, FSA and Ernest Stenson Cooke, Esq. With notes on 'Ancient fence' by Captain A Hutton and on the bibliography of the art of fence, by Captain C A Thimm, FRGS"]}, {"page": "Joseph Craven (politician)", "response": ["During Craven’s tenure of the Shipley seat, the local consensus between old Liberals and labour-based groups held firm but as the 1892 General Election approached the Liberal association split into factions respectively supporting Alfred Hutton and William Byles to be the party’s candidate. Hutton, who had earlier been officially adopted as candidate, resigned and in an attempt to reunite the party his supporters asked Craven to stand for re-election as the Gladstonian candidate if Byles would also withdraw. Craven was amenable, but Byles would not withdraw and narrowly carried the seat against a Conservative Unionist at the subsequent election.Pall Mall Gazette, 31 May 1892; Yorkshire Evening Post, 31 May 1892; London Evening Standard, 15 June 1892; Keith Laybourn and Jack Reynolds, Liberalism and the Rise of Labour 1890-1918, Croom Helm Ltd, 1984, Chapter 4."]}, {"page": "Alfred Eddison Hutton", "response": ["#REDIRECT Alfred Hutton (politician)"]}, {"page": "Alfred Hutton (Liberal politician)", "response": ["#REDIRECT Alfred Hutton (politician)"]}]}}