{"wiki_id": "http://www.wikidata.org/entity/Q4725343", "itemLabel": "Alia Bhatt", "itemDescription": "British-Indian actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Alia_Bhatt", "wikipedia_page": {"main": "Alia Bhatt (; born 15 March 1993) is an Indian-born British actress who works in Hindi-language films. Her accolades include four Filmfare Awards. She has appeared in Forbes India's Celebrity 100 list since 2014 and was featured by Forbes Asia in their 30 Under 30 list of 2017.\nBorn into the Bhatt family, she is the daughter of filmmaker Mahesh Bhatt and actress Soni Razdan. After making her acting debut as a child in the 1999 thriller Sangharsh, she played her first leading role in Karan Johar's teen drama Student of the Year (2012). She went on to establish herself with starring roles in several films produced by Johar's studio Dharma Productions, including the romances 2 States (2014), Humpty Sharma Ki Dulhania (2014), and Badrinath Ki Dulhania (2017); and the coming-of-age drama Dear Zindagi (2016). Bhatt won the Filmfare Critics Award for Best Actress for playing a kidnapping victim in the road drama Highway (2014), and three Best Actress awards at the ceremony for playing a Bihari migrant in the crime drama Udta Punjab (2016), an undercover spy in the thriller Raazi (2018), and the volatile girlfriend of an aspiring rapper in the musical drama Gully Boy (2019).\nAdditional to acting in films, Bhatt has launched her own line of clothing and handbags as well as the production company Eternal Sunshine, and is the founder of the ecological initiative CoExist. She has sung six of her film songs, including the single \"Samjhawan Unplugged\" in 2014.", "link_mentions": [{"page": "Amitabh Bachchan", "response": ["In 2017, he appeared in the third instalment of the Sarkar film series: Ram Gopal Varma's Sarkar 3. That year, he started filming for the swashbuckling action adventure film Thugs Of Hindostan with Aamir Khan, Katrina Kaif and Fatima Sana Shaikh which released in November 2018. He co-starred with Rishi Kapoor in 102 Not Out, a comedy-drama film directed by Umesh Shukla based on a Gujarati play of the same name written by Saumya Joshi. This film released in May 2018 and reunited him with Kapoor onscreen after a gap of twenty-seven years. In October 2017, it was announced that Bachchan will appear in Ayan Mukerji's Brahmastra, alongside Ranbir Kapoor, Mouni Roy and  Alia Bhatt."]}, {"page": "March 15", "response": ["*1993 – Alia Bhatt, British actress"]}, {"page": "Madhuri Dixit", "response": ["She next starred in Abhishek Varman's period drama Kalank, featuring an ensemble cast including Sonakshi Sinha, Alia Bhatt, Varun Dhawan, Aditya Roy Kapur and Sanjay Dutt. Set in the 1940s prior to the partition of India, the film featured her as Bahaar Begum, the madam of a brothel. Saibal Chatterjee of NDTV wrote, \"In the blinding glow of Dixit's presence as a nautch girl who can turn on the magic at will, the younger cast members pale somewhat in comparison. She lights up the screen as only she can, pushing the others to strive harder.\" It did not perform well at the box office; however, she gained a third nomination for the Filmfare Award for Best Supporting Actress."]}, {"page": "1993", "response": ["** Alia Bhatt, British-born Indian actress and singer"]}, {"page": "Harry Potter and the Philosopher's Stone", "response": ["| 8 || The Potions Master || 28 May 2020 || 18 mins, 36 secs || Alia Bhatt, Alec Baldwin and Carmen Baldwin"]}, {"page": "1993 in film", "response": ["* March 15 – Alia Bhatt, Indian-British actress"]}, {"page": "Birju Maharaj", "response": ["Maharaj also choreographed and composed music for many Indian movies. Some of the performances that he choreographed included for Saswati Sen in Satyajit Ray's Shatranj ke Khiladi (1977), Madhuri Dixit in Dil To Pagal Hai (1997) and Devdas (2002), Kamal Haasan in Vishwaroopam (2012), Deepika Padukone in Bajirao Mastani (2015) and Alia Bhatt in Kalank (2019). His choreography for Kamal Hassan in Vishwaroopam won him the National Film Award for Best Choreography in 2012, while his choreography for Deepika Padukone in Bajirao Mastani won him a Filmfare Award for Best Choreography in 2016."]}, {"page": "Nepotism", "response": ["The Kapoor family, one of the most prolific generational families involved in Indian cinema, have been known for bringing their children into the industry with their endorsements and influence. In June 2020 a fresh debate on nepotism followed soon after the suicide of actor Sushant Singh Rajput, which fans believe was in reaction to efforts by Bollywood insiders to boycott him. Filmmaker Karan Johar, who Rajput had worked with in the Netflix film Drive, was quickly accused of nepotism by actress Kangana Ranaut, with Rajput's fans calling for a boycott of Johar and his studio, Dharma Productions, as well as of actor Salman Khan and his brothers, who were accused of bullying outsiders in the past. Actors and actresses Alia Bhatt, Varun Dhawan, Janhvi Kapoor, Ishaan Khatter, Ananya Pandey, Athiya Shetty, Tiger Shroff, Arjun Kapoor and Sara Ali Khan, all of whom hail from film families, were also widely criticized."]}, {"page": "Shah Rukh Khan", "response": ["Khan next appeared alongside Kajol, Varun Dhawan and Kriti Sanon in Rohit Shetty's action comedy Dilwale (2015). The film garnered mixed reviews, though it was financially profitable with a gross of . Namrata Joshi of The Hindu commented, \"With Dilwale, Rohit Shetty goes hopelessly wrong despite much that he had at his disposal, including a power-packed cast and producer\", and felt that the attempt to repackage Khan and Kajol had backfired. He then took on dual parts of a superstar and his doppelgänger fan in Maneesh Sharma's action thriller Fan (2016). Peter Bradshaw of The Guardian considered the film to be \"exhausting, bizarre yet watchable\" and thought that Khan was aptly \"creepy\" as the obsessive admirer. The film underperformed at the box office, and trade journalists attributed this failure to the film's non-conformity to mainstream formula. Later that year, Khan portrayed the supporting part of a therapist to an aspiring cinematographer (Alia Bhatt) in Gauri Shinde's coming-of-age film Dear Zindagi."]}, {"page": "List of Indian film actresses", "response": ["* Alia Bhatt"]}, {"page": "List of people from Gujarat", "response": ["|Alia Bhatt||Movie actress"]}, {"page": "Cinema of India", "response": ["The 2000s and 2010s also saw the rise of a new generation of popular actors like Ranbir Kapoor, Ranveer Singh, Varun Dhawan, Sidharth Malhotra, Sushant Singh Rajput, Arjun Kapoor, Aditya Roy Kapur and Tiger Shroff, as well as actresses like Vidya Balan, Priyanka Chopra, Katrina Kaif, Kangana Ranaut, Deepika Padukone, Sonam Kapoor, Anushka Sharma, Sonakshi Sinha, Jacqueline Fernandez, Shraddha Kapoor and Alia Bhatt, with Balan and Ranaut gaining wide recognition for successful female-centric films such as The Dirty Picture (2011), Kahaani (2012), Queen (2014), Tanu Weds Manu Returns (2015) and Manikarnika: The Queen of Jhansi (2019). Kareena Kapoor and Rani Mukerji are among the few working actresses from the 2000s and late 1990s who successfully completed more than 20 years in the industry."]}, {"page": "Kareena Kapoor", "response": ["Kapoor next played the role of Dr. Preet Sahni in Abhishek Chaubey's critically acclaimed Udta Punjab (2016), a crime drama that documents the substance abuse endemic in the Indian state of Punjab. Co-starring alongside Shahid Kapoor, Alia Bhatt and Diljit Dosanjh, Kapoor was initially reluctant to do the film due to the length of her role, but agreed after having read the completed script and partially waived her fees to star in it. Udta Punjab generated controversy when the Central Board of Film Certification deemed that the film represented Punjab in a negative light and demanded extensive censorship before its theatrical release. The Bombay High Court later cleared the film for exhibition with one scene cut. Rediff.com stated that despite being \"the narrative’s most conventional character,\" the film \"greatly relies on [her] for warmth and virtue\" and Mehul S. Thakkar of The Deccan Chronicle wrote that she was successful in \"deliver[ing] a strong and hard hitting performance.\" For her performance, Kapoor received a nomination for Best Supporting Actress at the Filmfare and Zee Cine award ceremonies.", "In late 2021, Kareena decided to become a producer for the first time in a thriller which she will also star in directed by Hansal Mehta. She will also portray the Mughal princess Jahanara Begum in Karan Johar's directorial venture Takht, a historical drama featuring an ensemble cast, including Ranveer Singh, Vicky Kaushal, and Alia Bhatt."]}, {"page": "Karisma Kapoor", "response": ["Kapoor made her comeback as an actress with a leading role in Vikram Bhatt's supernatural thriller Dangerous Ishhq. Co-starring Rajneesh Duggal, the film spans a period of four centuries and tells four different love stories set in different time periods. Kapoor played four characters, one from each century. A major critical and box office failure, the film generated positive reviews for Kapoor's portrayal. Taran Adarsh of Bollywood Hungama commented: \"Karisma Kapoor puts forth her best efforts, getting to deliver lines in varied dialects. She gets the dialects right, especially Urdu and Rajasthani, but there's not much scope for her to display her acting prowess\". In 2013, Kapoor made a special appearance along with several other actors in the titular song of the anthology film Bombay Talkies, which was made to honour the Hindi film industry for completing a hundred years. In 2019, Kapoor made a special appearance in the Aanand L. Rai-directed romantic comedy Zero, a film about dwarfs. The song also feature several other actresses (including Rani Mukherji, Sridevi, Alia Bhatt, Deepika Padukone, Kajol and Juhi Chawla), etc. As of March 2020, Kapoor has finished working on the web-series Mentalhood for ALTBalaji."]}, {"page": "Indian Institute of Management Ahmedabad", "response": ["2 States (2014 film) a Bollywood film based on the eponymous novel by Chetan Bhagat, starring Alia Bhatt and Arjun Kapoor, was shot at the IIM-A campus."]}, {"page": "Pali Hill", "response": ["* Ranbir Kapoor at Vastu Apartment with Alia Bhatt"]}, {"page": "Bhat", "response": ["* Alia Bhatt, Bollywood actress"]}, {"page": "Research and Analysis Wing", "response": ["| The film is based on the book Calling Sehmat, the real-life story of a R&AW officer, portrayed by Alia Bhatt, who is married to a Pakistani military official."]}, {"page": "Priyanka Chopra", "response": ["Chopra will next lead the romantic drama Text for You opposite Sam Heughan and Celine Dion, and has been cast as Sati in The Matrix Resurrections. She will next star alongside Richard Madden in Amazon Prime Video's thriller series Citadel, and as the spiritual guru Ma Anand Sheela in Barry Levinson's Sheela, a film she will produce for Amazon Studios. Chopra has committed to star alongside Mindy Kaling in a comedy about an Indian-American wedding, and will portray the lawyer Vanita Gupta in Gordan's courtroom drama Tulia, an adaptation of a non-fiction book Tulia: Race, Cocaine, and Corruption (2005) based on the 1999 racial injustice case that took place in the city of the same name. She is also set to appear in the action film Cowboy Ninja Viking opposite Chris Pratt. She is also producing over a dozen regional films in various languages under her production company. She is also set to star in Farhan Akhtar's directorial Jee Le Zaraa alongside Katrina Kaif and Alia Bhatt, which is set to release in 2023."]}, {"page": "StarPlus", "response": ["On 27 May 2018, it underwent a rebranding with Alia Bhatt as the face of the campaign with the red crystal star with gold swoosh along with the tagline \"Rishta Wahi, Baat Nayi\" and signature song composed by A. R. Rahman."]}, {"page": "Sanjay Dutt", "response": ["Vidhu Vinod Chopra on 29 September 2016 announced that the third part of Munna Bhai series, starring Dutt in the title role, would begin soon. In 2017, Dutt appeared as the lead in Bhoomi, directed by Omung Kumar. In 2018, he starred in Saheb, Biwi Aur Gangster 3. In 2018, it was also announced that Dutt would feature alongside Ranbir Kapoor and Vaani Kapoor in Shamshera, which will release on 31 July 2020. On 29 June 2018, his biopic Sanju released in which he made a special appearance. Dutt and Alia Bhatt are currently shooting for Sadak 2. In 2019, he joined the cast of historical film Bhuj: The Pride of India, which will feature an ensemble cast consisting of Ajay Devgn, Sonakshi Sinha and Parineeti Chopra. He was seen in the film Prassthanam on 20 September 2019."]}, {"page": "Filmfare Award for Best Actress", "response": ["| Alia Bhatt", "* Nutan and her niece Kajol, with five wins each, have maximum awards. Meena Kumari, Madhuri Dixit and Vidya Balan have four wins each. Vyjayanthimala, Jaya Bachchan, Shabana Azmi, and Alia Bhatt have three wins each. Eight actresses have won the award twice; in chronological order, they are Waheeda Rehman, Dimple Kapadia, Rekha, Sridevi, Karisma Kapoor, Aishwarya Rai, Rani Mukerji and Deepika Padukone.", "* Six actresses have won the award in consecutive years; in chronological order, they are Meena Kumari (1954–55), Jaya Bachchan (1974–75), Shabana Azmi (1984–85), Rani Mukerji (2005–06), Vidya Balan (2012–13) and Alia Bhatt (2019-20).", "* On occasion of an actress receiving multiple nominations in the same year and won in either of them: Shabana Azmi received four nominations in 1984 and holds the record for the highest number of nominations in a single year. Meena Kumari and Kajol received three nominations each in 1963 and 1999 respectively. Vyjayanthimala, Jaya Bachchan, Raakhee, Rekha, Shabana Azmi, Sridevi, Juhi Chawla, Madhuri Dixit, Aishwarya Rai, Preity Zinta, Rani Mukerji, Vidya Balan, Deepika Padukone, and Alia Bhatt each received two nominations in 1959, 1974, 1977, 1981, 1985, 1990, 1994, 1995, 2000, 2004, 2006, 2012, (2014 and 2016), and 2017 respectively. Deepika Padukone is the only actress who achieved this feat twice in 2014 (2 nominations) and 2016 (2 nominations), and won in both years.", "* Nine actresses have won in both Best Actress and Best Actress - Critics categories; in chronological order, they are Dimple Kapadia, Karisma Kapoor, Rani Mukerji, Kareena Kapoor, Priyanka Chopra, Vidya Balan, Kangana Ranaut, Alia Bhatt and Taapsee Pannu. Rani Mukerji is the only actress to win both these awards for the same role in the same year (2006)."]}, {"page": "Karan Johar", "response": ["For his next feature film Student of the Year (2012), Johar chose not to cast established actors for his lead roles and instead recruited three debutante actors (Sidharth Malhotra, Varun Dhawan, and Alia Bhatt). The plot revolved around the quest of a group of students who are all gunning for the title of \"Student of the Year\" at their college. The film was a moderate commercial success and received mixed reviews from critics. Some called it \"supremely entertaining and enjoyable,\" while others called it \"a film which suffers from the lack-of-a-story syndrome.\"", "In August 2018, Johar took to Twitter to announce his next film Takht, a period drama based in the Mughal era, which will feature an ensemble star cast including Ranveer Singh, Kareena Kapoor Khan, Alia Bhatt, Vicky Kaushal, Bhumi Pednekar, Janhvi Kapoor and Anil Kapoor. With a screenplay by Sumit Roy, dialogues by Hussain Haidry & music composed by A. R. Rahman, this will be the second film directed by Johar that he has not written himself. In an interview with Firstpost, Johar stated that Takht would begin filming in September 2019."]}, {"page": "Shahid Kapoor", "response": ["After completing the duties of a talent judge on the dance reality show Jhalak Dikhhla Jaa Reloaded, Kapoor appeared opposite Alia Bhatt in Vikas Bahl's Shaandaar (2015). A critical and commercial failure, it is about insomniacs who fall in love during a destination wedding. Kapoor next took on the role of a drug abusing rock star in Udta Punjab (2016), a crime drama from the director Abhishek Chaubey that documents the substance abuse endemic in the Indian state of Punjab. Kapoor, a teetotaler, found it challenging to play an addict. He based the role on several pop stars, and was interested in bringing out his character's vulnerability despite his obnoxious actions. Udta Punjab generated controversy when the Central Board of Film Certification (CBFC) demanded extensive censorship before its theatrical release, citing that the portrayal of Punjab in it was negative. The demands sparked a debate on freedom of expression in India. After the producers filed a lawsuit against the board, the Bombay High Court cleared it for exhibition with a single scene cut, in which Kapoor's character is shown urinating on people. Sukanya Verma took note of the film's anti-drug message; she considered Kapoor to be \"spectacularly unbridled\" in his part and added that \"the believability he brings to his complex transition while preserving his inherent flakiness deserves all the praise\". Kapoor won the Filmfare Critics Award for Best Actor (shared with Manoj Bajpayee for Aligarh) and received a Best Actor nomination at the same ceremony."]}, {"page": "List of Kashmiri people", "response": ["* Alia Bhatt, actress, singer, producer & entrepreneur"]}, {"page": "Anil Kapoor", "response": ["In September 2015, Kapoor made an appearance as himself in the ad for the upcoming Angry Birds Friends tournament Champions for Earth. Amazon has cast Kapoor in its pilot The Book of Strange New Things. He will play the role of Vikram Danesh, the authoritative head of the base on Oasis. Kapoor has also committed to star in Karan Johar's directorial venture, Takht, a historical drama featuring an ensemble cast, including Ranveer Singh, Alia Bhatt, Bhumi Pednekar, and Vicky Kaushal."]}, {"page": "Soni Razdan", "response": ["Soni Razdan (born 25 October 1956) also known as Soni Bhatt is an Indian-British actress and film director who works in Hindi films. She is married to film director Mahesh Bhatt and is the mother of Bollywood actress Alia Bhatt.", "She is the mother of Shaheen Bhatt (born 28 November 1988) and actress Alia Bhatt (born 15 March 1993), step mother of Pooja Bhatt & Rahul Bhatt and the distant aunt of Emraan Hashmi."]}, {"page": "Pooja Bhatt", "response": ["Bhatt was born on 24 February 1972 to Mahesh Bhatt and Kiran Bhatt (born Loraine Bright). On her father's side, Bhatt is of predominantly Gujarati descent and on her mother's side, she is of English, Scottish, Armenian, and Burmese ancestry. She is the step-daughter of Soni Razdan. She has a brother, Rahul Bhatt and half-sisters Shaheen and Alia Bhatt. Her cousins are Hitarth Bhat and Emraan Hashmi."]}, {"page": "Mahesh Bhatt", "response": ["Bhatt married Lorraine Bright when he was 20 years old. His romance with her was the inspiration for his film Aashiqui. Bright changed her name to Kiran Bhatt. The couple have two children, a daughter Pooja Bhatt, a former actress, now a producer, and a son Rahul Bhatt, an aspiring actor. The marriage ended when Mahesh Bhatt had an affair with 1970s actress, Parveen Babi. The affair did not last long. Bhatt later married Soni Razdan in 1986. The couple have two daughters, Shaheen Bhatt and Alia Bhatt. Emraan Hashmi is his cousin Anwar Hashmi's son and thus his nephew.", "|Sanjay Dutt, Pooja Bhatt, Alia Bhatt, Aditya Roy Kapur"]}, {"page": "Jamnabai Narsee School", "response": ["* Alia Bhatt - Bollywood actress", "* Shaheen Bhatt - Writer & Sister of actress Alia Bhatt"]}, {"page": "Sanjay Leela Bhansali", "response": ["In 2021, Bhansali is coming up with Gangubai Kathiawadi, a biographical, crime film based on a chapter of Hussain Zaidi's book Mafia Queens of Mumbai. The film about Gangubai Kothewali, stars Alia Bhatt as Gangubai, and was scheduled for release on 30 July 2021, but was postponed due to the COVID-19 pandemic."]}, {"page": "Sridevi", "response": ["Sridevi's performances, acting style and technique have been influential and have inspired numerous actresses including Madhuri Dixit, Juhi Chawla, Karisma Kapoor, Kajol, Rani Mukerji, Preity Zinta, Aishwarya Rai Bachchan, Kareena Kapoor, Priyanka Chopra, Katrina Kaif, Vidya Balan, Deepika Padukone, Asin, Alia Bhatt, Nayanthara, Kajal Aggarwal and Anushka Shetty, who have cited her as an inspiration. In a piece for Time magazine, Priyanka Chopra wrote, \"Everyone wanted her and wanted to be like her. She could be childlike, grown-up, funny, serious, beguiling, sexy—she was the ultimate actor. [...] She was my childhood, and one of the big reasons I became an actor.\""]}]}}