{"wiki_id": "http://www.wikidata.org/entity/Q4727305", "itemLabel": "Alistair Mann", "itemDescription": "Television commentator and presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Alistair_Mann", "wikipedia_page": {"main": "Alistair Mann is a freelance football commentator and TV sports presenter.\nHe was born in Salford and attended Manchester Grammar School. He trained as a journalist at the department of Journalism, Media and Communication, University of Central Lancashire.\nMann worked for ITV Granada, where he presented all their sports output including Soccer Night and the daily news magazine show Granada Reports.\nHe began his career with Manchester-based Piccadilly Radio.In 2006, he began commentating on the BBC's Match of the Day. He formed part of the BBC's coverage of four Olympiads coverage: 2008 Beijing, 2012 London and 2016 Rio, including the men's gold medal match, won by Brazil against Germany on penalties. He also commentated for the BBC on the men's football tournament at the Tokyo Olympics in 2021.\nSine 2013, he has been a commentator on the BT Sport channel covering UEFA Champions League, UEFA Europa League, French, German, Italian and MLS football. He's also on UEFA's coverage of international matches and has featured regularly on Sky Sports' coverage of those games.\nMann has won three National Royal Television Society awards and been nominated twice more. He is a winner of the BT Journalist of the Year award.", "link_mentions": [{"page": "List of sports announcers", "response": ["* Alistair Mann – ITV Sport 2001–2006, 2014, Channel 5 2004–2005, BBC Sport 2006–present"]}, {"page": "Match of the Day", "response": ["Match of the Day uses a selection of BBC and freelance commentators, including: Guy Mowbray, Steve Wilson, Jonathan Pearce, Steve Bower, Simon Brotherton, Conor McNamara, Vicki Sparks, Alistair Mann, Martin Fisher, Mark Scott, John Roder, Chris Wise, Robyn Cowen, Steven Wyeth, and Ben Andrews."]}, {"page": "BBC Sport", "response": ["The BBC shows highlights of the Premier League on Match of the Day which has been hosted by Gary Lineker since 1999. Match of the Day 2 and Match of the Day 2 Extra, are presented by Mark Chapman. Dan Walker hosts Football Focus every Saturday lunchtime before Jason Mohammad presents Final Score every Saturday afternoon. Pundits for Match of the Day as well as co-commentators include Alan Shearer, Robbie Savage, Chris Sutton, Don Hutchison, Mark Lawrenson, Danny Murphy, Kevin Kilbane, Jermaine Jenas, Martin Keown, Stephen Warnock, Rio Ferdinand, Matthew Upson, Alex Scott, Faye White, Sue Smith, Lucy Ward, Chris Waddle, Cese Fabregas and Ian Wright while commentators include Guy Mowbray, Steve Wilson, Jonathan Pearce, Simon Brotherton, Steve Bower, Dave Woods, Vicki Sparks, Jacqui Oatley, Alistair Mann, Conor McNamara, Dan O'Hagan, Mark Tompkins, Martin Fisher, Gary Bloom, John Roder, Mark Scott, Chris Wise, Robyn Cowen and Steven Wyeth."]}, {"page": "List of British football commentators", "response": ["|Alistair Mann"]}, {"page": "Granada Reports", "response": ["*Alistair Mann "]}, {"page": "Soccer Night", "response": ["Clive Tyldesley was the lead commentator at launch in 1990, often being sent outside the Granada region to cover matches of North West interest covered by other companies. Alistair Mann was also part of the original team, making his commentary debut in 1991. Rob Palmer, John Helm and Gary Bloom also had spells as the main voice of the programme.", "|| Granada || Matt SmithAlistair Mann (2004–05)"]}, {"page": "Alistair mann", "response": ["#REDIRECT Alistair Mann "]}, {"page": "Football League Extra", "response": ["Commentators and reporters on Football League Extra included Clive Tyldesley, Alistair Mann, Tony Jones, Peter Drury, Ian Payne, Trevor Harris, Ron Atkinson, Dave Beckett and more. The show also included resident club commentators, and this often provided entertainment as the viewer would be able to hear ecstatic celebrations at times."]}, {"page": "Journalism, Media and Communication, University of Central Lancashire", "response": ["* Alistair Mann, Match of the Day commentator"]}, {"page": "BT Sport", "response": ["|Alistair Mann", "|Alistair Mann", "BT Sport currently have exclusive rights to Ligue 1. Lead commentators on Ligue 1 action comes from Wayne Boyce, Simon Brotherton, Paul Dempsey, Dave Farrar, James Fielden, Seb Hutchinson, Alistair Mann, Dan Mason, Jonathan Pearce, John Roder, Dan Roebuck, Adam Summerton, Paul Walker, Oliver Wilson and Steven Wyeth. The co-commentators include Clive Allen, Tony Dorigo, Efan Ekoku, Kevin Gallacher, Don Hutchison, Chris Perry, Stewart Robson, Nigel Spackman and Adam Virgo.", "BT Sport had full exclusive rights to the Bundesliga and 2. Bundesliga. Lead commentary on Bundesliga action comes from Ben Andrews, Steve Bower, Simon Brotherton, Paul Dempsey, Dave Farrar, James Fielden, Seb Hutchinson, Alistair Mann, Dan Mason, Jonathan Pearce, John Roder, Dan Roebuck, Mark Scott, Joe Speight, Adam Summerton, Paul Walker, Oliver Wilson and Steven Wyeth. The co-commentators include Jim Beglin, Tony Dorigo, Efan Ekoku, Kevin Gallacher, Don Hutchison, Chris Perry, Stewart Robson and Nigel Spackman. Occasionally, Premier League pundit and ex Bayern Munich player, Owen Hargreaves also contributes to co-commentary. Ben Andrews, Tim Caple, James Fielden, Mark Scott and Oliver Wilson are the lead commentators on 2. Bundesliga coverage. BT Sport lost rights to the Bundesliga from the 2021-22 season onwards for the next 4 years to Sky Sports."]}]}}