{"wiki_id": "http://www.wikidata.org/entity/Q4722634", "itemLabel": "Alfred Elwes", "itemDescription": "author", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Elwes", "wikipedia_page": {"main": "Alfred Elwes (1819–1888) was a nineteenth-century British author of children's literature, academic, philologist, and occasional translator of French, Italian and Portuguese literature into English. He is perhaps best remembered for his translation of the medieval Arthurian romance Jaufry the Knight and the Fair Brunissende; a Tale of the Times of King Arthur.", "link_mentions": [{"page": "Alexandre de Serpa Pinto", "response": ["In 1881 Serpa Pinto published his 2-volume Como eu atravessei a África, translated by Alfred Elwes and published in English as How I crossed Africa. In the same year French and German translations were also published."]}, {"page": "Jaufre", "response": ["The first modern translation was by  published 1856, illustrated with twenty woodcut engravings by Gustave Doré, using the abridged ms. B text printed in Raynouard's Lexique Roman. The Mary-Lafon translation was set in English that same year by Alfred Elwes, printed in London as Jaufry the Knight and the Fair Brunissende (1856), with an American edition printed in New York (1857). Ross G. Arthur's English translation follows the ms. A text."]}, {"page": "Newcastle Forgotten Fantasy Library", "response": ["# Jaufry the Knight and the Fair Brunissende, translated by Alfred Elwes (October 1979)"]}, {"page": "Alfred Thomas Elwes", "response": ["Elwes was born in Leghorn, Italy, where he was baptised 1 August 1841. His parents were Alfred Elwes and Louisa Anne Elwes.Great Britain, Select Births and Baptisms, 1571–1977 His father was a professor of languages. 1851 England Census From 1872 to 1877 he was employed by the Illustrated London News as the chief draftsman of natural history subjects. In 1882 Elwes wrote How to draw animals, birds and dogs.  He died sometime after 1911 probably around 1917 in Willesden, Middlesex."]}]}}