{"wiki_id": "http://www.wikidata.org/entity/Q4722948", "itemLabel": "Alfred Janes", "itemDescription": "painter (1911-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Janes", "wikipedia_page": {"main": "Alfred George Janes (30 June 1911 – 3 February 1999) was a Welsh artist, who worked in Swansea and Croydon. He experimented with many forms, but is best known for his meticulous still lifes and portraits.\nHe is also remembered as one of The Kardomah Gang, an informal group of young artists in Swansea that included the poets Dylan Thomas and Vernon Watkins, and the composer Daniel Jones.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Alfred Janes (1911–1999), painter"]}, {"page": "Wales", "response": ["Welsh painters gravitated towards the art capitals of Europe. Augustus John and his sister Gwen John lived mostly in London and Paris. However, the landscapists Sir Kyffin Williams and Peter Prendergast lived in Wales for most of their lives, while remaining in touch with the wider art world. Ceri Richards was very engaged in the Welsh art scene as a teacher in Cardiff and even after moving to London. He was a figurative painter in international styles including Surrealism. Various artists have moved to Wales, including Eric Gill, the London-Welshman David Jones and the sculptor Jonah Jones. The Kardomah Gang was an intellectual circle centred on the poet Dylan Thomas and poet and artist Vernon Watkins in Swansea, which also included the painter Alfred Janes."]}, {"page": "Culture of Wales", "response": ["Perhaps the most famous Welsh painters, Augustus John and his sister Gwen John, mostly lived in London and Paris; however the landscapists Sir Kyffin Williams and Peter Prendergast remained living in Wales for most of their lives, though well in touch with the wider art world. Ceri Richards was very engaged in the Welsh art scene as a teacher in Cardiff, and even after moving to London; he was a figurative painter in international styles including Surrealism. Various artists have moved to Wales, including Eric Gill, the London-born Welshman David Jones, and the sculptor Jonah Jones. The Kardomah Gang was an intellectual circle centred on the poet Dylan Thomas and poet and artist Vernon Watkins in Swansea, which also included the painter Alfred Janes."]}, {"page": "Daniel Jones (composer)", "response": ["He attended the Bishop Gore School in Swansea (1924–1931), where his enthusiasm for literature led to a close friendship with the poet Dylan Thomas, and to his going on to study English literature at Swansea University. At this period Jones and Thomas were part of the informal group of aspiring artists who would meet at the Kardomah cafe in Castle Street, Swansea. Other members of the group were the poet Vernon Watkins and the painter Alfred Janes. In 1935 Jones left Swansea to study music at the Royal Academy of Music in London (1935–1938), where his teachers included Sir Henry Wood and Harry Farjeon. Winning the Mendelssohn Scholarship in 1935 allowed him to study in Czechoslovakia, France, the Netherlands and Germany, and to develop his skills as a linguist.", "His archive is held at the National Library of Wales, Aberystwyth. An oil portrait of Jones by Alfred Janes is held by the National Museum Cardiff; a photographic portrait by Bernard Mitchell (1967) is held by the National Portrait Gallery, London."]}, {"page": "Vernon Watkins", "response": ["Others in the Swansea Group known as the \"Kardomah boys\" were the composer Daniel Jenkyn Jones, writer Charles Fisher and the artists Alfred Janes and Mervyn Levy. Vernon wrote the obituary for Dylan Thomas and when he died, Philip Larkin wrote his obituary.", "A portrait of Watkins by his friend Alfred Janes may be seen in the Glynn Vivian Art Gallery, Swansea. A group portrait of the Kardomah Boys by Jeff Phillips was unveiled at Tapestri Arts Centre in Swansea in June 2011. Featured in the painting are Vernon Watkins, John Pritchard, Dylan Thomas, Daniel Jones and Alfred Janes. The picture is based on a BBC Radio Times front cover from October 1949."]}, {"page": "Janes", "response": ["* Alfred Janes (1911–1999), Welsh artist"]}, {"page": "1947 in art", "response": ["* Alfred Janes – Little Cactus"]}, {"page": "1951 in art", "response": ["* Alfred Janes – Portrait of William Grant Murray"]}, {"page": "Mervyn Levy", "response": ["Mervyn Levy (11 February 1914 – 14 April 1996) was a Welsh artist, art teacher and writer on art. Born in Swansea, where he became a friend of the painter Alfred Janes, the poet Dylan Thomas and the musician Daniel Jones, he spent most of his teaching career in Bristol and London, and made several popular television series about painting techniques. He published monographs on contemporary artists, and a catalogue raisonnee of the works of his friend the painter L. S. Lowry.", "Mervyn Montague Levy was born on 11 February 1914, in Swansea, Wales, the son of Louis Levy and Have Levy (née Rubenstein). One of his two siblings was a sister five years younger than he. When he was about seven years old he began attending Mrs Hole's preparatory school in Mirador Crescent, where he met the future poet, Dylan Thomas, with whom he would associate later as one of The Kardomah Gang. When he was eight, Levy's mother died, and his father engaged a series of nurses to look after Mervyn and his siblings.C. Fitzgibbon, The Life Of Dylan Thomas (1965), p.36-39.  Levy went to study art in London at the Royal College of Art, and in 1935 won a prize for Drawing. C. Levi, 'Obituary: Mervyn Levy', in The Independent (1996 May 17) During this period Levy shared rooms with Dylan Thomas and the painter Alfred Janes in Redcliffe Street, and afterwards in rooms where they were joined by the painter William Scott.C. Fitzgibbon, The Life Of Dylan Thomas (1965), p.159, 179-182.  A striking portrait of Levy in 1935 was made by Alfred Janes. Levy drew several portraits of Dylan Thomas.", "A portrait of Mervyn Levy by Alfred Janes (1935) is held by the Glynn Vivian Art Gallery, Swansea."]}, {"page": "1999 in Wales", "response": ["*3 February (in London) - Alfred Janes, artist, 87"]}, {"page": "James Henry Govier", "response": ["Govier was born on 1 August 1910, at Oakley, Buckinghamshire, the only son of Henry Govier and Mary Ann Measey. He had an older sister, Elizabeth, and a younger sister, Florence. In 1914 the family moved to the small town of Gorseinon in Gower near Swansea, where James was educated at the local school. At the age of fourteen he left school to work in one of the local tin works. At the age of seventeen he became an evening student at the Swansea School of Art and Crafts (now part of Swansea Metropolitan University). James was taken to see William Grant Murray, the head of the School, and at the age of twenty gained a Glamorgan County Scholarship to study full-time at the School. From 1930 James came under the influence of William Grant Murray; and he exhibited with many Welsh artists, including Alfred Janes, Ceri Richards and Kenneth Hancock. In 1935 he exhibited with past students at the Glynn Vivian Art Gallery in Swansea.  From 1935 James studied in London at the Royal College of Art under the tutorship of Malcolm Osborne, RA, RE. At this time he became an acquaintance of the poet Dylan Thomas, and worked with other Welsh artists in London. In 1938 he gained his ARCA along with the Art Travelling Scholarship, which he was unable to take up because of the outbreak of war."]}, {"page": "Bishop Gore School", "response": ["* Alfred Janes, artist"]}, {"page": "Glynn Vivian Art Gallery", "response": ["The paintings include work by Richard Wilson, Claude Monet, Thomas Jones, Mark Gertler, Augustus John, Gwen John, Stanley Spencer, Lucien Pissarro, Paul Nash, Guido Reni, Cedric Morris, Ben Nicholson, Alfred Janes, Ceri Richards, Ivon Hitchens, Thomas Lawrence, H. Scott Tuke, Ryszard Zajac, Evan Walters and Kyffin Williams."]}, {"page": "List of people from Swansea", "response": ["*Alfred Janes"]}, {"page": "The Kardomah Gang", "response": ["Regulars members of the Gang included poets Charles Fisher, Dylan Thomas, Bert Trick,  John Prichard and Vernon Watkins, composer and linguist Daniel Jones, artists Alfred Janes and Mervyn Levy, Mabley Owen and Tom Warner."]}, {"page": "Cultural depictions of Dylan Thomas", "response": ["thumb|upright|Alfred Janes' 1934 portrait of Thomas", "*Alfred Janes' 1934 portrait of Thomas is held by the National Museum of Wales. Janes, like Thomas was a member of The Kardomah Gang or The Kardomah Boys, a group of bohemian Swansea friends who met at the Kardomah Café, in Castle Street, Swansea. Janes created three portraits of Thomas, the first of which, painted in Coleherne Road in 1934, is oil on canvas and displays Janes's technique at this period of cutting lines into the paint with his pen-knife, to provide relief and focus."]}, {"page": "1911 in Wales", "response": ["*30 June - Alfred Janes, artist (died 1999)"]}, {"page": "Ifan ab Owen Edwards", "response": ["In 1922, Edwards wrote a letter to the periodical Cymru'r Plant, which led to the founding of the Urdd, and the first Urdd recreational camp was held at Llanuwchllyn in 1928, under his direction. The first Urdd local branch was founded in Treuddyn. It was gradually followed by more permanent camps and residential centres.  In partnership with J. Ellis Williams, he made the first Welsh language sound film, The Quarryman.  In 1947 he was knighted in recognition of his youth work, and the Urdd had his portrait painted by Alfred Janes in 1956.  He was a director of Television Wales and the West and encouraged the making of television programmes in Welsh.  His son, Owen Edwards, would become the first chief executive of S4C."]}, {"page": "Welsh art", "response": ["Perhaps the most famous Welsh-born painters were Augustus John and his sister Gwen John, though they mostly lived in London and Paris; however the landscapists Sir Kyffin Williams (1918–2006) and Peter Prendergast (1946–2007) remained living in Wales for most of their lives, though well in touch with the wider art world. Ceri Richards was very engaged in the Welsh art scene as a teacher in Cardiff, and even after moving to London; he was a figurative painter in international styles including Surrealism. Various artists have moved to Wales, usually the countryside, though paintings of Cardiff of around 1893–97 by the American artist Lionel Walden are in museums in Cardiff and Paris.National Museum of Wales, Walden These included Eric Gill, whose colony included for his most artistically productive period (1924–1927) the London-born Welshman David Jones, and the sculptor Jonah Jones. The Kardomah Gang was an intellectual circle centred on the poet Dylan Thomas and poet and artist Vernon Watkins in Swansea, which also included the painter Alfred Janes; the eponymous cafe was destroyed by a German bomb in 1941."]}, {"page": "List of villages in Gower", "response": ["*Penrice, a hamlet in south Gower, inland from Oxwich Bay, is approachable by steep, narrow roads. On its village green – once a social centre of Gower – stands St Andrew's Church, Penrice and the stone base of a former cross. The painter Alfred Janes has a memorial in the churchyard. Penrice Park contains an 18th-century country-house and the remains of a Norman castle – both known as Penrice Castle."]}, {"page": "List of painters by name beginning with \"J\"", "response": ["*Alfred Janes (1911–1999), Welsh/English artist"]}, {"page": "List of Welsh artists", "response": ["*Alfred Janes (1911–1999), painter "]}, {"page": "Glan Williams", "response": ["Glan Williams was born in Pentrechwyth, Swansea, Wales, the first of five children of Thomas Howell Williams and Mary Ann Owens. After winning a scholarship at age 14, he attended the Swansea School of Arts and Crafts (now part of Swansea Metropolitan University) from 1925-1931 where he became friends with other Swansea artists Mervyn Levy and Alfred Janes. He was appointed City Cartoonist to the London Express Newspapers in 1930 and continued working in the 1930s as a political cartoonist for the Sunday and Daily Express while also contributing illustrations to stories in the Daily Herald. "]}]}}