{"wiki_id": "http://www.wikidata.org/entity/Q4723557", "itemLabel": "Alfred Victor Smith", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Victor_Smith", "wikipedia_page": {"main": "Alfred Victor Smith VC (22 July 1891 – 22 December 1915), known to his family as Victor, was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\n\nSmith was 24 years old, and a second lieutenant in the 1/5th Battalion, East Lancashire Regiment, British Army on 22 December 1915 at Helles, Gallipoli, Ottoman Turkey during the First World War, and who died in action for which he was awarded the VC. His citation reads:For most conspicuous bravery. He was in the act of throwing a grenade when it slipped from his hand and fell to the bottom of the trench close to several officers and men. He immediately shouted a warning and jumped clear to safety. He then saw that the officers and men were unable to find cover and knowing that the grenade was due to explode at any moment, he returned and flung himself upon it. He was instantly killed by the explosion. His magnificent act of self-sacrifice undoubtedly saved many lives.\nHe is buried in Twelve Tree Copse Cemetery in the Gallipoli peninsula, although the precise location of his grave within the cemetery is not known. He was also awarded a French Croix de Guerre.\nAlfred Victor Smith’s father was a Police officer and although Alfred was born in Guildford, the family moved several times in his youth, and Alfred sang as a boy chorister in St Albans Cathedral Choir. At 14 his father was appointed chief constable of Burnley, and they moved to the town, with Alfred completing his education at Burnley Grammar School. After leaving school he joined Blackpool Borough Police force. He is named on commemorative plaques within the former Burnley Grammar School, St Catherine's Church, Burnley, St Albans Cathedral, and the current Blackpool Police headquarters.\nIn November 2015 a commemorative stone was unveiled in Guildford.His VC, along with other items, is on display at the Towneley Hall museum in Burnley.", "link_mentions": {}}}