{"wiki_id": "http://www.wikidata.org/entity/Q4724145", "itemLabel": "Algernon de Horsey", "itemDescription": "Royal Navy admiral (1827-1922)", "wikipedia_url": "https://en.wikipedia.org/wiki/Algernon_de_Horsey", "wikipedia_page": {"main": "Admiral Sir Algernon Frederick Rous de Horsey  (25 July 1827 – 22 October 1922) was a Royal Navy officer, appointed aide-de-camp to Queen Victoria. He distinguished himself in Canada during the Fenian raids, and was thanked in Parliament for suppressing riots in Jamaica.", "link_mentions": [{"page": "Battle of Pacocha", "response": ["The rebels used the ship to harass commercial shipping, especially off Callao, the main commercial port of Peru. However, after she forcibly boarded some British merchant ships, British authorities sent HMS Shah and HMS Amethyst, under command of Rear Admiral Algernon de Horsey, to capture the vessel."]}, {"page": "Tom Phillips (Royal Navy officer)", "response": ["Phillips was the son of Colonel Thomas Vaughan Wynn Phillips, Royal Artillery and Louisa Mary Adeline de Horsey Phillips, daughter of Admiral Algernon de Horsey. Phillips was married to Lady Phillips, of Bude, Cornwall."]}, {"page": "Algernon frederick rous de horsey", "response": ["#REDIRECT Algernon de Horsey "]}, {"page": "Thomas Fellowes (Royal Navy officer, born 1827)", "response": ["Upon the death of Admiral Sir Algernon de Horsey in October 1922, Fellowes became the oldest living officer of the Royal Navy of flag rank. He died in 1923 at age of 95 at Woodfield Park, his home in Stevenage."]}, {"page": "Butterworth Stavely", "response": ["Twain based his story on one sentence in a naval report by Royal Navy officer Algernon de Horsey: \"One stranger, an American, has settled on the island – a doubtful acquisition\", which was probably referring to Peter Butler, a survivor of the 1875 Khandeish shipwreck. The story was probably also inspired by the life of American adventurer Joshua Hill, who briefly ruled the Pitcairn Islands as a dictator in the 1830's."]}, {"page": "Algernon (name)", "response": ["* Algernon de Horsey (1827–1922), English naval officer"]}, {"page": "Algernon Frederick Rous de Horsey", "response": ["#REDIRECT Algernon de Horsey"]}]}}