{"wiki_id": "http://www.wikidata.org/entity/Q4724163", "itemLabel": "Algernon Marsham", "itemDescription": "cricketer (1919-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Algernon_Marsham", "wikipedia_page": {"main": "Algernon James Bullock Marsham (14 August 1919 – 11 February 2004) was an English cricketer.\nMarsham played in 17 first-class cricket matches between 1939 and 1947 as a left-handed batsman and a right arm leg break bowler. He was the last member of the famous Marsham family, which included his father C. H. B. Marsham and grandfather C. D. B. Marsham, to play cricket for Kent.Marsham was educated at Eton and Christ Church, Oxford. During World War II he was commissioned in the King's Royal Rifle Corps and was for some time a prisoner of war in Germany.", "link_mentions": [{"page": "Algernon (name)", "response": ["* Algernon Marsham (1919–2004), English cricket player"]}, {"page": "George Rogers (cricketer, born 1905)", "response": ["He made his only first-class appearance for the Minor Counties cricket team against Oxford University in 1939.  In the Minor Counties first-innings, he was dismissed for a duck by Algernon Marsham.  In their second-innings, he was dismissed for 8 runs by the same bowler."]}, {"page": "Deaths in February 2004", "response": ["*Algernon Marsham, 84, English cricketer."]}, {"page": "Robert Grevett", "response": ["Grevett made a single first-class appearance for Sussex against Oxford University at The Saffrons, Eastbourne, in 1939. Oxford University won the toss and elected to bat, scoring 178 in their first-innings. In response, Sussex made 169 in their first-innings, with Grevett, who batted at number three, being dismissed for a duck by David Macindoe. Oxford University made 324 in their second-innings, leaving Sussex with a target of 334 to win. However, Sussex could only make 277 in their second-innings chase, with Grevett once again dismissed for a duck, this time off the bowling of Algernon Marsham. This was his only major appearance for Sussex."]}, {"page": "Marsham (surname)", "response": [":* Algernon Marsham (1919–2004)"]}, {"page": "Peter Blagg", "response": ["He made a number of stumpings off the Oxford spin bowlers. In the match against Marylebone Cricket Club (MCC) he stumped three off the leg-spin of Algernon Marsham, including Denis Compton.MCC v Oxford University 1939 He batted low in the order, with a highest score of 28 not out against Somerset.Somerset v Oxford University 1939 His last first-class match was the victory over Cambridge University.Oxford University v Cambridge University 1939"]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Algernon Marsham (1946) : A. J. B. Marsham (Kent)"]}]}}