{"wiki_id": "http://www.wikidata.org/entity/Q4727261", "itemLabel": "Alistair Brown", "itemDescription": "British footballer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alistair_Brown_(footballer,_born_1951)", "wikipedia_page": {"main": "Alistair Brown (born 12 April 1951) is a Scottish former football player who played as a striker. He made 496 league appearances over an eighteen-year career in the English Football League, scoring 141 goals.\nHe began his career at Leicester City, and helped to fire the \"Foxes\" to promotion out of the Second Division in 1970–71. He then helped the club to win the 1971 Charity Shield, before he moved on to West Bromwich Albion. He helped the \"Baggies\" to win promotion out of the Second Division in 1975–76, before helping the club to qualify for European football. He spent some time in 1981 playing in America for the Portland Timbers. In 1983, he moved to Walsall via Crystal Palace. He signed with Port Vale in July 1984, and helped the \"Valiants\" to win promotion out of the Fourth Division in 1985–86, before he retired in May 1986. A quality finisher, he was the top-scorer over the course of at least one season at Leicester, West Brom, Walsall, and Port Vale. He later worked as a pub landlord and warehouseman in the Midlands.", "link_mentions": [{"page": "Robbie Earle", "response": ["Earle won a regular first team place in August 1984, and hit 19 goals in 56 games in 1984–85, including a hat-trick against Hereford United at Vale Park on 2 February; Earle and Alistair Brown's partnership got the club a combined total of 40 goals. An ever-present in the 1985–86 Fourth Division promotion squad, he scored 17 goals in 58 games; he and strike partner Andy Jones bagged a total of 35 goals for the club. Earle made 142 consecutive appearances between September 1984 and January 1987, the run coming to an end due to a groin strain. The strain led to a hernia operation in the autumn of 1987, but he returned to first team action in January 1988. He scored seven goals in 35 games in 1986–87 and scored four goals in 11 games in 1987–88. That season he played in the FA Cup upset when Vale knocked out Tottenham Hotspur.  A regular in the 1988–89 season, Rudge claimed that Earle and Ray Walker was one of the best-ever midfield partnerships at the Vale. He scored both goals past Bristol Rovers in the two-legged 1989 play-off final that took Vale through to the Second Division. After the match Earle wept in the tunnel, such was his emotions to have taken his local team to victory in the play-off final. Over the course of the 1988–89 campaign he scored 19 goals in 57 appearances."]}, {"page": "Alistair Brown", "response": ["Alistair Brown may refer to:", "*Alistair Brown (footballer, born 1951), Scottish footballer (Leicester City, West Bromwich Albion)", "*Alistair Brown (footballer, born 1957), Scottish footballer (Dumbarton FC)", "*Alistair Brown (footballer, born 1985), Scottish football goalkeeper (Hibernian FC)"]}, {"page": "1970–71 Football League", "response": ["|10||align=left|  Alistair Brown ||align=left| Leicester City ||15||2||0||17"]}, {"page": "List of Port Vale F.C. seasons", "response": ["|Alistair Brown"]}, {"page": "List of Walsall F.C. seasons", "response": ["|Alistair Brown"]}, {"page": "History of Port Vale F.C.", "response": ["Rudge steadied the ship, slashing the wage bill by £20,000. A young Robbie Earle began to show his promise, though it was veteran Alistair Brown who was the season's top scorer, with 21 strikes. A mid-table finish was acceptable considering the rebuilding effort Rudge made with the squad. In May 1985, young Welshman Andy Jones was purchased from Rhyl for £3,000. He was soon joined by £12,000 defender John Williams and numerous others. Vale were promoted back to the third tier in 1985–86, finishing in fourth place, losing just once at Vale Park. During the season, they went on an eighteen-match unbeaten run, building their record largely on a solid defence. Jones and Earle scored eighteen and seventeen goals respectively. The only downside was the finances, as a loss of £79,474 was recorded, partly due to promotion bonus payouts. In the summer of 1986, new signings included Ipswich Town's reserve goalkeeper Mark Grew on a free, Aston Villa midfielder Ray Walker for £12,000, Sheffield United winger Paul Smith for £10,000 and Walsall striker Richard O'Kelly for £6,000. Rudge also turned down the management position at Preston North End. He also made an attempt to bring a young Steve Bull to Vale Park. After an unconvincing start to 1986–87, Rudge sold John Williams to Bournemouth for £30,000 and brought in Bob Hazell from Reading on a free. This helped transform the club's defence, while Andy Jones' fantastic record of 37 goals helped win the Vale a twelfth-place finish. The only worrying sign was a £53,373 loss, increasing the club's debt to £363,878."]}, {"page": "1984–85 Port Vale F.C. season", "response": ["| July 1984 || FW ||  || Alistair Brown || Walsall || Free transfer || "]}, {"page": "1985–86 Port Vale F.C. season", "response": ["| May 1986 || FW ||  || Alistair Brown || colspan=\"2\"| Retired|| "]}, {"page": "Alistair Brown (footballer born 1951)", "response": ["#REDIRECT Alistair Brown (footballer, born 1951)"]}, {"page": "Len Cantello Testimonial Match", "response": ["The West Brom XI team featured Tony Godden, Paddy Mulligan, Derek Statham, Tony Brown, John Wile, Bryan Robson, Johnny Giles, John Trewick, Alistair Brown, Len Cantello, David Mills, David Stewart, Martyn Bennett and Kevin Summerfield.", "|CF || || Alistair Brown"]}, {"page": "Manchester United 3–5 West Bromwich Albion (1978)", "response": ["|CF ||8 || Alistair Brown"]}]}}