{"wiki_id": "http://www.wikidata.org/entity/Q472835", "itemLabel": "Arthur Cox", "itemDescription": "English footballer (born 1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Cox_(footballer)", "wikipedia_page": {"main": "Arthur Cox (born 14 December 1939 in Southam, Warwickshire) is an English former football manager.\nHe was unable to become a professional football player as he broke his leg playing in a reserve game for Coventry City. He spent time coaching at Sunderland and in Turkey, before he was given his first management position.", "link_mentions": [{"page": "Newcastle United F.C.", "response": ["United dropped once again to the Second Division at the end of the 1977–78 season. Dinnis was replaced by Bill McGarry, and then he was replaced by Arthur Cox. Cox steered Newcastle back to the First Division at the end of the 1983–84 season, with players such as Peter Beardsley, Chris Waddle and ex-England captain Kevin Keegan the fulcrum of the team. However, with a lack of funds, Cox left for Derby County and Keegan retired. With managers such as Jack Charlton and then Willie McFaul, Newcastle remained in the top-flight, until key players such as Waddle, Beardsley and Paul Gascoigne were sold, and the team was relegated once more in 1989. McFaul left the managerial post, and was replaced by Jim Smith. Smith left at the start of the 1991–92 season and the board appointed Osvaldo Ardiles his replacement."]}, {"page": "Jack Charlton", "response": ["Charlton was appointed manager of Newcastle United in June 1984 after being persuaded to take the job by Jackie Milburn. Arthur Cox had left the club after leading the \"Magpies\" to the First Division and key player Kevin Keegan announced his retirement. His first action was to release Terry McDermott from his contract, who refused to agree to Charlton's offer of a new contract. He had little money to spend in preparation for the 1984–85 season, though he did have young talents in Chris Waddle and Peter Beardsley. He signed midfielder Gary Megson and big striker George Reilly. The \"Toon\" finished safely in 14th place, and a teenage Paul Gascoigne was on the verge of breaking into the first team."]}, {"page": "Southam", "response": ["*Arthur Cox, who managed Newcastle United and Derby County football clubs between 1980 and 1993, was born at Southam in December 1939."]}, {"page": "Kevin Keegan", "response": ["Keegan at Newcastle was the senior pro. Keegan, along with Terry McDermott, Jeff Clark and David McCreery, now had a senior status. As a senior pro, his manager, Arthur Cox, who would later join many of Keegan's coaching teams when Keegan would later become a manager, had a different relationship to Keegan than with other players. Cox would ask Keegan his opinion on players.", "In September 1983, Keegan answered a phone call at 1:00 am from Arthur Cox. In the phone call Cox explained to Keegan, sharply, he had signed a player called Peter Beardsley from Vancouver Whitecaps and explained to Keegan that he'd like him; after giving Keegan the message, Cox immediately put the phone down... A few days later Keegan met Beardsley at Benwell. Keegan and his teammates, at first sight, thought Beardsley was just a lad who had won the competition to train with the first team. It was only when they saw him in action that they knew he had something about him. At Beardsley's first training session Keegan could not believe his eyes at what a talent he was witnessing. Keegan once stated about Beardsley, \"At Scunthorpe I always thought Terry Heath had the wow factor, because of his skill on the ball, and when I moved to Liverpool I had never seen anyone with Peter Thompson's ability. By the time I started playing for Newcastle, however, I had played against Cruyff, Maradona and Pelé, and yet I have never had my mind blown as I did on the first day I saw Peter Beardsley.\"", "When Sven-Göran Eriksson became England manager, Eriksson appointed the 64-year-old Tord Grip as his assistant. This caused Keegan to complain that when he was England manager, the FA had told him that he could not have Arthur Cox as his assistant because at 60, Cox was too old. Keegan went on, \"I wasn't allowed to bring in the people I wanted and that was wrong. Mr Eriksson was and I'm delighted for him because that's the way it should be.\""]}, {"page": "Chesterfield F.C.", "response": ["|Arthur Cox|| English||1976–1980"]}, {"page": "Steve Bruce", "response": ["Confident that he was being targeted by clubs from higher divisions, Bruce resolved not to sign a new contract with Gillingham when his existing deal expired at the end of the 1983–84 season.Bruce (1994), p. 60. In an April 1983 match against Newport County, he attempted, in a moment of anger, to deliberately injure opposition player Tommy Tynan, but connected awkwardly and succeeded only in breaking his own leg, leaving him unable to play again for six months.Bruce (1994), p. 62. He returned in time to play a key role in Gillingham achieving two draws against Everton in the FA Cup in 1984, attracting the attention once again of scouts from First Division clubs. Arthur Cox, manager of Bruce's beloved Newcastle United, expressed an interest in signing the player, but resigned from his job before any further action could be taken.Bruce (1994), p. 65. Bruce eventually opted to sign for Norwich City in August 1984 for a fee variously reported as £125,000 or £135,000. In 2009, he was voted into Gillingham's Hall of Fame."]}, {"page": "Mark Pembridge", "response": ["Having established as a left-midfielder, 21-year old Pembridge was signed for second-tier Derby County by manager Arthur Cox in the summer of 1992 for a fee of £1.25 million. He racked up 140 appearances and netted 37 goals over his time with Derby and played at Wembley twice - once in a 3-1 defeat to Cremonese in 1993 and then in a 2-1 defeat to Leicester City in the 1994 Football League First Division play-off Final. Pembridge left to move up a division to Premier League Sheffield Wednesday for a fee of £900,000 in the summer of 1995."]}, {"page": "Dave Penney", "response": ["David Mark Penney (born 17 August 1964) is an English football manager and former player. Born in Wakefield, West Riding of Yorkshire, Penney entered professional football at the relatively late age of 21. He had been working as a bricklayer and playing for nothing at Pontefract Collieries for 5 years before he was spotted by Derby County scout Ron Jukes, who recommended him to manager Arthur Cox. He was offered a contract at the then Third Division club and they climbed two divisions before he left for Oxford United for £175,000. He then went on to Wales, where he played for Swansea City and Cardiff City, latterly signing for Doncaster Rovers in 1998. He played as a midfielder."]}, {"page": "Brett Angell", "response": ["Angell started his career as a defender at Second Division side Portsmouth, but never made the first team and was released in 1987. It wasn't until he joined Cheltenham Town in July 1987 that Angell was converted from defender to a striker by the club's then manager John Murphy, who had discovered the player at a 6-a-side game. He scored 22 goals in 1987–88, becoming the Conference club's top-scorer. In February 1988, he was signed by Arthur Cox at First Division club Derby County for a fee of £45,000."]}, {"page": "Mark Wright (footballer, born 1963)", "response": ["Arthur Cox was the Derby County manager when Wright arrived at the East Midlands club, who had been promoted as champions of the Second Division at the end of the 1986–1987 season. Derby County FC. Retrieved 3 February 2017 Publishing magnate Robert Maxwell, the former chairman of Oxford United, had helped save Derby from going out of business in 1984. Derby Telegraph. 4 March 2014. Retrieved 14 January 2017 Installed as the club's chairman in 1987, Maxwell spent heavily to bolster the Rams' squad for their return to the First Division. Derby Telegraph. 5 November 2011. Retrieved 14 January 2017"]}]}}