{"wiki_id": "http://www.wikidata.org/entity/Q4727205", "itemLabel": "Alison Walker", "itemDescription": "British sports broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Alison_Walker", "wikipedia_page": {"main": "Alison Walker is a Scottish sports broadcaster.Walker took a degree in media and communication studies at the University of Sunderland, followed by a postgraduate diploma in Business and Secretarial Studies.On graduating, her first job was as a runner for a film production company in Glasgow, eventually becoming their producer of corporate and training videos.In 1987 she was recruited by Glasgow CableVision as a Production Assistant and within a year was presenting the local news channel. In 1988 she joined BBC Radio Scotland as a reporter/presenter, moving on to produce Sportsound.\nHer radio work has been combined with presentation and reporting roles for BBC Scotland television, with regular contributions to Sportscene and Reporting Scotland where she was the main sports presenter from 2003 to 2009.\nShe was the first female broadcaster in Scotland to report live on football matches. She has also presented programmes on curling, mountain biking, rugby, swimming, field hockey and shinty. She has reported on seven Olympic Games: Sydney in 2000, Beijing in 2008, Vancouver 2010, London 2012, Sochi 2014, Rio 2016 and was a commentator at the Winter Olympics in Pyeongchang. Notable interviewees include Pelé and Tiger Woods and in the Summer of 2014 she compered the athletics at Hampden Park for the Commonwealth Games where she interviewed Usain Bolt. She reported on the first ever Youth Olympics in 2010, where she was the main commentator on the Opening Ceremony and followed that up with the Winter Youth Games in Innsbruck and the second Summer Games in Nanjing.\nWalker is now a freelance sports journalist, TV presenter and live event host, working for amongst others, BBC 5 Live, World Curling TV, Rangers TV, Eurosport and the Olympic News Channel.", "link_mentions": [{"page": "List of Scots", "response": ["* Alison Walker (born 1963)"]}, {"page": "Hamilton, South Lanarkshire", "response": ["* Alison Walker        (Broadcaster)"]}, {"page": "Walker (surname)", "response": ["*Alison Walker, Scottish broadcaster", "*Alison Walker (scientist), English physicist"]}, {"page": "Reporting Scotland", "response": ["*Alison Walker (2003–2009)"]}, {"page": "Sportscene", "response": ["* Sportscene Results is broadcast on Saturday afternoons on BBC One Scotland and occasionally BBC Scotland (formerly BBC Two Scotland). The show rounds up all of the day's main football scores, whilst debating the major Scottish football stories of the week. It sends reporters to every game in the Scottish Premiership, certain games in the Scottish Championship, as well as Scottish Cup and Scottish League Cup games. BBC Scotland had historically produced a Saturday teatime results round-up programme as an opt-out from Grandstand initially known as Scoreboard which launched on 16 August 1975, but in 1989 a new programme called Afternoon Sportscene was launched. It ran for the entire duration of the time allocated for the day's results, starting at some point between 1 and 5 minutes before the network aired English counterpart Final Score. At the start of the 2001/02 season the programme was renamed Sportscene Results to co-inside with the programme and Final Score, becoming programmes in their own right. Sportscene Results is presented by David Currie previous presenters have included Peter Thomson, Sandy McLeish, Murdoch McPherson, Brian Marjoribanks, Alastair Alexander, Gordon Hewitt, Bill McFarlan, Rob Maclean, Jim Craig, Dougie Donnelly, Hazel Irvine, Alison Walker, Dougie Vipond, Stuart Cosgrove and Eilidh Barbour. The show gives football experts like Pat Nevin and Tony Higgins an opportunity to give their views on the days results and the past week of football. ", "* Grandstand from Scotland / Sunday Grandstand from Scotland (sometimes branded Scottish Grandstand or Grandstand Scotland) was the name of BBC Scotland's sports programme broadcast as an occasional opt-out from the network version of Grandstand on BBC One Scotland from 1961 - 2006 and BBC Two Scotland from 1989 - 2006. it was initially broadcast as a opt-out from the FA Cup Final throughout the 1960s and 1970s but in subsequent years from 1981 the programme was occasionally broadcast to incorporate local and network sporting events if there was live or highlights coverage of Scottish football, rugby, golf, snooker etc. Presenters have included Peter Thomson, Sandy McLeish, Murdoch McPherson, Brian Marjoribanks, Gordon Hewitt, Dougie Donnelly, Bill McFarlan, Hazel Irvine, Rob Maclean, Jill Douglas, Alison Walker and Dougie Vipond.", "Sportscene's main anchors are David Currie and Jonathan Sutherland. Previous Sportscene presenters include Peter Thomson, Sandy McLeish, Bill Malcolm, Archie Henry, Murdoch McPherson, Brian Marjoribanks, Alastair Alexander, Charles Munro, Archie Macpherson, Gordon Hewitt, Andrew Alexander, Dougie Donnelly, Bill McFarlan, Jim Craig, Derek Johnstone, Louise Welsh, Hazel Irvine, Jock Brown, Mark Souster, Alison Walker, Mike Abbott, Richard Gordon, Jill Douglas, Gary Parker, John Beattie, Dougie Vipond, Stuart Cosgrove and Eilidh Barbour."]}]}}