{"wiki_id": "http://www.wikidata.org/entity/Q4722695", "itemLabel": "Alfred Fryer", "itemDescription": "British botanist (1826-1912)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Fryer", "wikipedia_page": {"main": "Alfred Fryer (25 December 1826 Cambridgeshire - 26 February 1912 Chatteris, Cambridgeshire), was an English naturalist and authority on the pond weeds or Potamogetons.The Fryer family had lived in the Fenlands of the Chatteris district for more than 300 years; Alfred's father was a gentleman farmer of considerable means who placed few restrictions on his son. His first schooling was at Leicester where he met Henry Walter Bates and Alfred Russel Wallace. When Bates eventually left England for South America he tried to persuade Fryer, who had just lost his first wife, to do the same.\nIn the 1840s Fryer's circle of London friends included the Rossetti family and Coventry Patmore, company which encouraged him to pursue his interest in poetry, while urging Dante Gabriel Rossetti to focus on poetry rather than painting.\nHe returned to his native Fenlands in 1848 and began to devote his prodigious energy to science. At first his attention was taken up by insects, birds, shells and fossils, and it was only after 1860 that he became preoccupied with botany, corresponding with Cardale Babington, John Gilbert Baker and Arthur Bennett. His intimate knowledge of plants led to his considering a flora of Huntingdonshire, but his growing fascination with Potamogetons, or 'Pots' as he termed them, claimed priority. His circle of friends now reflected this single-mindedness - George Claridge Druce of Oxford, Charles Edward Moss of the Cambridge Botany School, Edward Walter Hunnybun (1848-1918)of Huntingdon and A. H. Evans, also corresponding with Thomas Morong (1827–1894), the American authority on the genus. During this period Fryer was growing Potamogetons in tanks placed in his garden, tracking their development together with that of their numerous wild counterparts. His prolific contributions to the Journal of Botany, British and Foreign led to his 1897 election as Associate to the Linnean Society. Until his death, Robert Morgan (1863-1900), also a Linnean Society Associate, illustrated Fryer's copious articles. Morgan's colour plates delighted Fryer and were praised by later critics.", "link_mentions": {}}}