{"wiki_id": "http://www.wikidata.org/entity/Q4726133", "itemLabel": "Alice Twemlow", "itemDescription": "graphic designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Twemlow", "wikipedia_page": {"main": "Alice Twemlow is a writer, critic and educator from the United Kingdom whose work focuses on graphic design. She has been a guest critic at the Yale University School of Art, Maryland Institute College of Art (MICA), and Rhode Island School of Design (RISD). In 2006, the School of Visual Arts (SVA) in New York named Twemlow the chair and co-founder of its Master of Fine Arts in Design Criticism (D-Crit). According to her SVA biography: “Alice Twemlow writes for Eye, Design Issues, I.D., Print, New York magazine and The Architect’s Newspaper.”  Twemlow is also a contributor to the online publication: Voice: AIGA Journal of Design. In 2012 Core77 selected Twemlow as a jury captain for the “Design Writing and Commentary” category of the Core77 Design Awards. Twemlow was head of the MA in Design Curating & Writing at Design Academy Eindhoven, 2017-2018, and is now Lector Design at the Royal Academy of Fine Arts (KABK) in The Hague, and Associate Professor at Leiden University.", "link_mentions": [{"page": "Peter Saville (graphic designer)", "response": ["Saville's output from this period included re-appropriation from the canon of art and design. Design critic Alice Twemlow wrote: \"... in the 1980s ... he would directly and irreverently \"lift\" an image from one genre—art history for example—and recontextualise it in another. A Fantin-Latour \"Roses\" painting in combination with a colour-coded alphabet became the seminal album cover for New Order's Power, Corruption & Lies (1983), for example.\"The Dark Prince, Alice Twemlow"]}, {"page": "Design Academy Eindhoven", "response": ["* Alice Twemlow"]}, {"page": "Steven Heller (design writer)", "response": ["In 2008, Heller co-founded the MFA in design criticism program (D-Crit) with Alice Twemlow. The program was intended to help non-designers find a place in the design field. As of 2019, His on the faculty of the School of Visual Arts as co-chair of the MFA Design Department, special assistant to the president, and co-founder of the MFA Design Criticism, MPS Branding, MFA Interaction Design, MFA Products of Design programs. Heller's pupils have included Deborah Adler."]}, {"page": "Alliance Graphique Internationale", "response": ["| Alice Twemlow"]}, {"page": "Eye (magazine)", "response": ["Frequent contributors include Phil Baines, Steven Heller, John-Patrick Hartnett, Richard Hollis, Paul Kahn, Robin Kinross, Jan Middendorp, J. Abbott Miller, John O’Reilly, Rick Poynor, Elizabeth Resnick, Alice Twemlow, Kerry William Purcell, Steve Rigley, Adrian Shaughnessy, David Thompson, Christopher Wilson, Steve Hare and many others. Recent issues have included photographs by Philip Sayer, Maria Spann and Francesco Brembati.  "]}, {"page": "Design Observer", "response": ["Frequent contributors over the years have included; Steven Heller, John Foster, Adrian Shaughnessy, Dmitri Siegel, Alice Twemlow, Tom Vanderbilt, Lorraine Wild, Rob Walker, Alexandra Lange, Mark Lamster, John Thackara, Véronique Vienne, Julie Lasky and more."]}, {"page": "Twemlow (surname)", "response": ["*Alice Twemlow, British writer, critic, and educator"]}, {"page": "SVA MFA Design Criticism (D-Crit)", "response": ["D-Crit is the Design Criticism MFA department at the School of Visual Arts in New York City, chaired by Alice Twemlow and co-founded along with Steven Heller in 2006. In Fall 2008, the department enrolled 15 students, who became the inaugural class to complete the two-year program and graduate, in May 2010, with a Design Criticism Master of Fine Arts degree. In the fall of 2014, the program morphed into a one-year Master of Arts degree in Design Research, Writing, and Criticism.http://designresearch.sva.edu/", "*Alice Twemlow", "*Alice Twemlow", "*Alice Twemlow"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Alice Twemlow"]}, {"page": "Twemlow, Alice", "response": ["#redirectAlice Twemlow"]}]}}