{"wiki_id": "http://www.wikidata.org/entity/Q4726339", "itemLabel": "Alick Horsnell", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Alick_Horsnell", "wikipedia_page": {"main": "Alick Horsnell (1881–1916) was an architect, draughtsmen and artist working in London during the early years of the 20th Century.", "link_mentions": [{"page": "Victoria and Albert Museum", "response": ["Not only are all the major British architects of the last four hundred years represented, but many European (especially Italian) and American architects' drawings are held in the collection. The RIBA's holdings of over 330 drawings by Andrea Palladio are the largest in the world;Douglas Lewis, The Drawings of Andrea Palladio, 2nd edition, 2000. other Europeans well represented are Jacques GentilhatreRosalys Coope, Catalogue of the Drawings Collection of the RIBA: Jacques Gentilhatre, 1972. and Antonio Visentini.John McAndrew, Catalogue of the Drawings Collection of the RIBA: Antonio Visentini, 1974. British architects whose drawings, and in some cases models of their buildings, in the collection, include: Inigo Jones,John Harris & Gordon Higgott, Inigo Jones Complete Architectural Drawings, 1989. Sir Christopher Wren, Sir John Vanbrugh, Nicholas Hawksmoor, William Kent, James Gibbs, Robert Adam,Alister Rowan, Catalogues of Architectural Drawings in the V&A: Robert Adam, 1988. Sir William Chambers,Michael Snodin (ed.), Catalogues of Architectural Drawings in the V&A: Sir William Chambers, 1996. James Wyatt, Henry Holland, John Nash, Sir John Soane,Pierre de la Ruffuniere du Prey, Catalogues of Architectural Drawings in the V&A: Sir John Soane, 1985. Sir Charles Barry, Charles Robert Cockerell, Augustus Welby Northmore Pugin,Alexandra Wedgwood, Catalogues of Architectural Drawings in the V&A: A. W. N. Pugin and the Pugin Family, 1985. Sir George Gilbert Scott, John Loughborough Pearson, George Edmund Street, Richard Norman Shaw, Alfred Waterhouse, Sir Edwin Lutyens, Charles Rennie Mackintosh, Charles Holden, Frank Hoar, Lord Richard Rogers, Lord Norman Foster, Sir Nicholas Grimshaw, Zaha Hadid and Alick Horsnell."]}, {"page": "Ralph Knott", "response": ["In 1908 Knott set up his own practice together with E. Stone Collins. The first substantial commission they applied for was for offices for the London County Council. Despite many very well known names entering, Knott won at the age of 29. Designs for the construction were brought to life by the architect and perspectivist Alick Horsnell. His design was altered significantly before construction began, including the familiar semicircular terrace being moved from the land to the river-side of the building. Construction was held up by the First World War, during which Knott worked on designs for Royal Air Force bases, and partially completed in 1922 (except for the northern third). In June 1921 he was elected a fellow of the Royal Institute of British Architects."]}, {"page": "Horsnell", "response": ["*Alick Horsnell (1882–1916), English architect, draughtsman, and artist "]}, {"page": "Alick", "response": ["*Alick Horsnell (1881–1916), English architect"]}]}}