{"wiki_id": "http://www.wikidata.org/entity/Q4727306", "itemLabel": "Alistair McGowan", "itemDescription": "British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Alistair_McGowan", "wikipedia_page": {"main": "Alistair Charles McGowan (born 24 November 1964) is an English impressionist, comic, actor, singer and writer best known to British audiences for The Big Impression (formerly Alistair McGowan's Big Impression), which was, for four years, one of BBC1's top-rating comedy programmes – winning numerous awards, including a BAFTA in 2003. He has also worked extensively in theatre and appeared in the West End in Art, Cabaret, The Mikado and Little Shop of Horrors (for which he received a Laurence Olivier Award nomination). As a television actor, he played the lead role in BBC1's Mayo. He wrote the play Timing (nominated as Best New Comedy at the whatsonstage.com awards) and the book A Matter of Life and Death or How to Wean Your Man off Football with former comedy partner Ronni Ancona. He also provided voices for Spitting Image.\nHe made his debut broadcast as a tennis commentator for BBC Sport at the 2011 Wimbledon Championships.In 2012, McGowan wrote and hosted the ITV comedy sports show You Cannot Be Serious!, in which his impressions included Roy Hodgson, Jedward and Louie Spence.He has written and starred in three plays for BBC Radio 4 about Erik Satie: Three Pieces in the Shape of a Pear), John Field (The Peregrinations of a Most Musical Irishman) and George Bernard Shaw (The 'B' Word). He devised stage shows showcasing the music and verse of Noël Coward (Sincerely Noel), and the music and writings of Erik Satie (Erik Satie's-faction). He wrote the stage play Timing (nominated as Best New Comedy at the 2009 whatsonstage.com awards", "link_mentions": [{"page": "Ann Widdecombe", "response": ["Widdecombe took part in a television series 24 Hours in the Past, along with Colin Jackson, Alistair McGowan, Miquita Oliver, Tyger Drew-Honey and Zoe Lucker. The four-part series was aired from 28 April–19 May 2015 on BBC One and involved the celebrities experiencing life as workers in a dustyard, coachhouse, pottery and finally as workhouse inmates in 1840s Britain. She took part in an episode of Tipping Point: Lucky Stars in 2016. In 2017, Widdecombe took part in ITV's Sugar Free Farm."]}, {"page": "Follies", "response": ["|colspan='1' align=center| Alistair McGowan"]}, {"page": "Through the Looking-Glass", "response": ["* The BBC Radio 4 show Saturday Drama broadcast an adaptation by Stephen Wyatt on 22 December 2011. The broadcast featured Lewis Carroll, voiced by Julian Rhind-Tutt, as both the narrator and an active character in the story. Other actors include Lauren Mote (Alice), Carole Boyd (Red Queen), Sally Phillips (White Queen), Nicholas Parsons (Humpty-Dumpty), Alistair McGowan (Tweedledum & Tweedledee), and John Rowe (White Knight).Wyatt, Stephen. 2011. \"Lewis Carroll - Alice Through the Looking Glass\" [radio broadcast], Saturday Drama. UK: BBC Radio 4. Retrieved via BBC Radio on 10 April 2020."]}, {"page": "Severus Snape", "response": ["In a 2004 sketch on Saturday Night Live in which Lindsay Lohan appears as Hermione Granger, Snape is portrayed by Will Forte. Snape has also been parodied in UK television. Comic Relief released a story called Harry Potter and the Secret Chamberpot of Azerbaijan, in which Snape is played by Jeremy Irons. Snape appeared in a Harry Potter parody named \"Louis Potter and the Philosopher's Scone\" in Alistair McGowan's Big Impression show, played by Alistair McGowan himself. In the Harry Bladder sketches in All That, Snape appears as Professor Chafe (portrayed by Jeremy Rowley), whose legs were badly chafed, causing him to be unnecessarily mean. Many sketches feature students brewing potions that did silly things, like enlarge students' behinds, give males large breasts, or change people into bras. In a sketch comedy named \"Cooking With...\" on Australian TV series The Wedge, Snape is played by Anthony Ahern, and catches Harry and Hermione making love. In Team Starkid's A Very Potter Musical, Snape is played by actor Joe Moses."]}, {"page": "British sitcom", "response": ["The series which centres on the character of Geraldine Granger, the new vicar of the village of Dibley,  almost immediately exploited the 1992 changes in the Church of England that permitted the ordination of women. The show included cameos from many actors and celebrities, many appearing as themselves, and included  Sarah, Duchess of York, Hugh Bonneville, Mel Giedroyc, Richard Griffiths, Miranda Hart, Alistair McGowan, Geraldine McNulty, Philip Whitchurch, Nicholas Le Prevost, Brian Perkins and Roger Sloman, Pam Rhodes, Kylie Minogue, Rachel Hunter, Terry Wogan, Jeremy Paxman, Martyn Lewis, Darcey Bussell, Sean Bean,Richard Ayoade, Orla Brady, Fiona Bruce, Annette Crosbie, Johnny Depp, Ruth Jones, Hilary Kay, Damian Lewis, Maureen Lipman, Jennifer Saunders, Sting and his wife Trudie Styler, Stephen Tompkinson, Dervla Kirwan, and Emma Watson. Dibley received multiple British Comedy Awards, two International Emmys, and was a multiple British Academy Television Awards nominee. In 2004, it placed third in a BBC poll of Britain's Best Sitcoms. In addition to the twenty main episodes between 1994 and 2007, the series includes numerous shorter charity specials, as well as 'lockdown' episodes produced during the 2020-2021 COVID-19 pandemic. The theme music is a setting of Psalm 23 composed by Howard Goodall, and performed by the choir of Christ Church Cathedral, Oxford, with George Humphreys singing the solo. The conductor was Stephen Darlington. Goodall originally wrote it as a serious piece of church choral music."]}, {"page": "Hermione Granger", "response": ["Hermione has been parodied in numerous sketches and animated series. On Saturday Night Live, Hermione was played by Lindsay Lohan. On his show Big Impression, Alistair McGowan did a sketch called \"Louis Potter and the Philosopher's Scone\". It featured impressions of Nigella Lawson as Hermione. In 2003, Comic Relief performed a spoof story called Harry Potter and the Secret Chamberpot of Azerbaijan, in which Miranda Richardson, who plays Rita Skeeter in the Harry Potter films, featured as Hermione. Hermione also features in the Harry Bladder sketches in All That, in which she appears as Herheiny and is portrayed by Lisa Foiles. The Wedge, an Australian sketch comedy, parodies Hermione and Harry in love on a \"Cooking With...\" show before being caught by Snape. Hermione also appears as Hermione Ranger in Harry Podder: Dude Where's My Wand?, a play by Desert Star Theater in Utah, written by sisters Laura J., Amy K. and Anna M. Lewis.HighBeam In the 2008 American comedy film Yes Man, Allison (played by Zooey Deschanel) accompanies Carl (Jim Carrey) to a Harry Potter-themed party dressed as Hermione."]}, {"page": "Pete and Dud", "response": ["The comic and personal relationship between Cook and Moore is the subject of the play Pete and Dud: Come Again, by Chris Bartlett and Nick Awde. In 2010, a group of comedians, Hugh Dennis, Angus Deayton and Alistair McGowan among them, recreated some of the Pete and Dud comic routines on BBC Two in Pete and Dud: the Lost Sketches."]}, {"page": "Ludlow", "response": ["Dick Heckstall-Smith (1934–2004) from Ludlow was an English jazz and blues saxophonist. Sheena Porter (born 1935) a British author of children's novels, lives in Ludlow. The actor John Challis (1942-2021) who played Boycie in Only Fools & Horses lived near Ludlow, as did Pete Postlethwaite (1946–2011). The actress Holly Davidson (born 1980) (from Casualty and The Bill) grew up locally. Hollie Robertson (born 1985), winner of the BBC's Strictly Dance Fever in 2006 is from Ludlow. Impressionist Alistair McGowan (born 1964), now lives in Ludlow, where he is patron of the Ludlow Fringe Festival in which he has appeared performing live.Report by Rory Smith."]}, {"page": "List of British comedians", "response": ["*Ronni Ancona (born 1968), Alistair McGowan's Big Impression ", "*Alistair McGowan (born 1964), Alistair McGowan's Big Impression"]}, {"page": "Rudolph the Red-Nosed Reindeer", "response": ["| Burl Ives  ||  ||  ||  || Richard Dreyfuss  ||  Alistair McGowan (impersonating Alan Hansen) (U.K.)Dan Dierdorf (U.S.)", "| uncredited || || || || || Alistair McGowan (impersonating Des Lynam) (U.K.)Dick Enberg (U.S.)"]}, {"page": "Richard Briers", "response": ["In 2014, BBC Radio 4 broadcast Memories of a Cad, an affectionate comedy drama by Roy Smiles about the relationship between Terry-Thomas and Briers, played by Martin Jarvis and Alistair McGowan respectively. Set in 1984 when he had suffered from Parkinson's disease for many years, Terry-Thomas is delighted by the visit to his home in Ibiza of the much younger Briers, whom he recognises from television, and who proves to be his first cousin once removed. Briers cheers him up by recalling the career the film-star has long forgotten.Afternoon Drama: Memories of a Cad. BBC Radio 4, 30 December 2014. It was re-broadcast in 2016."]}, {"page": "Evesham", "response": ["* Alistair McGowan, impressionist and actor.  Born in Evesham on 24 November 1964."]}, {"page": "University of Leeds", "response": ["Alumni from the arts include musicians Dan Smith, Kyle Simmons and Chris Wood of the band Bastille; Mark Knopfler of the band Dire Straits; Simon Rix, bassist of Leeds-based band the Kaiser Chiefs; singers Corinne Bailey Rae and Little Boots; and the band members of alt-J Film director Shona Auerbach, impersonator and actor Alistair McGowan, screenwriter Jeremy Dyson, Hong Kong singer and actor Leslie Cheung, actress Emma Mackey and poet Tony Harrison are also alumni of the university."]}, {"page": "Spitting Image", "response": ["*Alistair McGowan (1991–1996) "]}, {"page": "Terry-Thomas", "response": ["Some of the innovations Terry-Thomas brought into his earlier television programmes were later copied by others; How Do You View? provided the \"prologue\" format of Up Pompeii!, and was the first to use regular BBC announcers as foils in comic sketches—a practice continued later, particularly with the shows of Morecambe and Wise. Terry-Thomas's anecdotes, stringing several stories together, later inspired Ronnie Corbett in his monologue spot in his series The Two Ronnies. In 2014, BBC Radio 4 broadcast Memories of a Cad, a comedy drama by Roy Smiles about the relationship between Terry-Thomas and Richard Briers, played by Martin Jarvis and Alistair McGowan respectively."]}, {"page": "Gareth Gates", "response": ["Gates played Prince Charming in the pantomime Cinderella at New Wimbledon Theatre, from December 2008 to January 2009 alongside Joanna Page and Alistair McGowan. Further pantomime roles followed, including the Prince in Snow White and the Seven Dwarfs at Woking in 2010–11 and Aladdin in Milton Keynes in 2011–12. In 2016, Gates joined May Mcfettridge and played the role of Prince Charming in \"Cinderella\" at the Grand Opera House in Belfast. In 2017/18 he played Jack in Jack and the Beanstalk at the Wolverhampton Grand alongside Lisa Riley."]}, {"page": "The Big Impression", "response": ["The Big Impression, known as Alistair McGowan's Big Impression for the first three series, is a British comedy sketch show. It features Alistair McGowan and Ronni Ancona impersonating personalities from entertainment and sport. Four series and a number of specials were made by Vera Productions and it was first broadcast on BBC One between 2000 and 2004.", "McGowan and Ancona first met at a comedy club, and later started dating. They worked together on a number of projects, with their first television series being The Staggering Stories of Ferdinand de Bargos in 1989. After performing in his own show in Edinburgh in 1998, McGowan was approached by a BBC executive about working on a series, which he wanted Ancona to be involved in. Alistair McGowan's Big Impression first aired on BBC One in 2000, with the couple splitting up just before filming began. Speaking with The Independent, Ancona said working on the series was \"exciting but it was tricky and there were some very low points. [...] But, if anything, the tension added a little frisson to some of the sketches and it made the show better.\"", "===Alistair McGowan===", "There have been many characters that Alistair McGowan and Ronni Ancona have impersonated. Some celebrities that McGowan has done impressions of include:", "* Alistair McGowan's 2000 Impressions (30 December 2000)", "* Alistair McGowan's Big 'Enders (10 August 2001)", "* Alistair McGowan's Big World Cup (31 May 2002)", "* Alistair McGowan's Big Jubilee (2 June 2002)", "| National Television Awards || Nominated || Most Popular Comedy Performance (Alistair McGowan)", "| Royal Television Society Programme Awards || Won || Entertainment Performance (Alistair McGowan)", "| National Television Awards || Nominated || Most Popular Comedy Performance (Alistair McGowan)"]}, {"page": "2DTV", "response": ["The series was directed by Tim Searle. 2DTV was first broadcast in March 2001, but an unbroadcast pilot episode was recorded nearly six months earlier. The pilot episode featured the resident newsreader played by Alistair McGowan, but the character was not carried over when the full seven-part first series was commissioned by ITV. Each episode in the first series lasted 10 minutes."]}, {"page": "Trinny Woodall", "response": ["Woodall came to prominence as co-host and fashion advisor for five series of the BBC television series What Not to Wear. She and Constantine worked on the show from 2001 to 2005, combining their knowledge of fashion to improve the dress sense of the candidates selected for the show. What Not to Wear made Woodall a household name, and she and Constantine became jointly known as Trinny and Susannah. They became infamous for their straight-talking advice. The New York Times wrote \"Trinny Woodall, one of the upper-crusty and scathingly blunt hosts of What Not to Wear, a hugely popular fashion makeover show on the BBC, does not mince words.\" Woodall has been spoofed on many comedy-themed television shows, including Big Impression, on which impressionist Alistair McGowan took to spoofing her presenting techniques on What Not to Wear."]}, {"page": "Jonathan Creek", "response": ["Many well-known actors have appeared in the series, including Bob Monkhouse, Rik Mayall (who had been considered to play Jonathan) and Jack Dee who are better known for their comedy roles. Other guest stars, both comedy and straight, have included: Rob Jarvis who made two appearances, each time as a different character, Colin Baker, Sheila Gish, Alistair McGowan, John Bluthal, Lysette Anthony, Simon Day, Selina Cadell, Peter Davison, Pippa Haywood, Dermot Crowley, Deborah Grant, Amanda Holden, Nicola Walker, Francis Matthews, Griff Rhys Jones, Maxine Peake, Rebecca Front, Terrence Hardiman, Michael Brandon, Jim Bowen, Dinah Sheridan, Hattie Hayridge, Steven Berkoff, Mary Tamm, Bill Bailey, Sophie Thompson,  Maureen Lipman, Celia Imrie, Judy Parfitt, Katherine Parkinson, Paul McGann, Ian McNeice, Joanna Lumley, Paula Wilcox, Raquel Cassidy, Kieran Hodgson, June Whitfield, Josie Lawrence and Warwick Davis."]}, {"page": "Cabaret (musical)", "response": ["In September 2006, a new production of the show opened at the Lyric Theatre, directed by Rufus Norris, and starring Anna Maxwell Martin as Sally, James Dreyfus as the Emcee, Harriet Thorpe as Fräulein Kost, and Sheila Hancock as Fräulein Schneider. Hancock won the Olivier Award for Best Supporting Performance in a Musical. Replacements later in the run included Kim Medcalf and Amy Nuttall as Sally, Honor Blackman and Angela Richards as Fräulein Schneider, and Julian Clary and Alistair McGowan as the Emcee. This production closed in June 2008 and toured nationally for two years with a cast that included Wayne Sleep as the Emcee and Samantha Barks as Sally, before Siobhan Dillon took over the role.", "*The Emcee: Julian Clary, Alistair McGowan"]}, {"page": "Tony Hawks", "response": ["Hawks staged a special charity performance of his comedy musical Midlife Cowboy at the Lyric Theatre in London on 25 April 2016. It starred Hawks, Jack Dee, Doon Mackichan, Ben Miller, Alistair McGowan and Charlotte Page. Proceeds from the performance were donated to the Tony Hawks Care Home in Moldova."]}, {"page": "Kind Hearts and Coronets", "response": ["In May 2012 BBC Radio 4 broadcast a sequel to the film called Kind Hearts and Coronets – Like Father, Like Daughter, written by David Spicer. In it, Unity Holland, the illegitimate daughter of Louis and Sibella, is written out of the title by Edith Duchess of Chalfont. Unity then murders the entire D'Ascoyne family, with all seven members played by Alistair McGowan."]}, {"page": "David Baddiel", "response": ["In 2001, Baddiel wrote and starred in Baddiel's Syndrome, a sitcom for Sky 1 which also starred Morwenna Banks, Stephen Fry and Jonathan Bailey, which ran for fourteen episodes. He also wrote the comedy film, The Infidel, starring Omid Djalili, Richard Schiff, Matt Lucas and Miranda Hart. Baddiel has since adapted the film into a musical with music by Erran Baron Cohen. Baddiel directed the production which ran at London's Theatre Royal Stratford East in late 2014. Baddiel's other writing credits include The Norris McWhirter Chronicles for Sky 1, which starred Alistair McGowan and John Thomson and which Baddiel also directed, and two episodes of the ITV reboot of Thunderbirds, Thunderbirds Are Go!"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Alistair McGowan"]}, {"page": "Paul Daniels", "response": ["Daniels refused to attend magic conferences in the UK since they \"...were ruined for me by bitchiness and jealousy...now I only go to foreign conventions where, to be honest, I am greeted with respect and civility AND I have tons of 'foreign' magician friends.\" He was dismissive of modern illusionists, once describing David Blaine as \"not very original\". He commented on other television personalities such as Anne Robinson and Chris Morris, claiming that Robinson had hated him ever since his 1987 Halloween special hoax performance, while describing Morris as \"just nasty.\" He was dismissive of the younger generation of impressionists, saying: \"Forget Alistair McGowan. There's been no-one good since Mike Yarwood.\" Daniels was also critical of journalists, stating \"I don't really understand why journalism has to be so nasty, so sarcastic and intrusive\"."]}, {"page": "The Vicar of Dibley", "response": ["Hugh Bonneville, Mel Giedroyc, Richard Griffiths, Miranda Hart, Alistair McGowan, Geraldine McNulty, Philip Whitchurch, Nicholas Le Prevost, Brian Perkins and Roger Sloman have all made one guest appearance each."]}, {"page": "Vic and Bob", "response": ["In 2005, a full series was commissioned and was given the new name Monkey Trousers. The series retained most of the same characters, and featured several guests in common with The All Star Comedy Show, plus some new faces including Mackenzie Crook, Iain Lee, John Thomson and Alistair McGowan."]}, {"page": "Alistair", "response": ["* Alistair McGowan, English impressionist and comedian"]}, {"page": "Decline and Fall", "response": ["The novel was dramatised as the 1969 film, Decline and Fall... of a Birdwatcher starring Robin Phillips and also by Jeremy Front in a 2008 BBC Radio 4 production starring Alistair McGowan as Pennyfeather, Jim Broadbent as Grimes, Andrew Sachs as Prendergast, Edward Hardwicke as Dr. Fagan, Jonathan Kidd as Philbrick, Joanna David as Margot Beste-Chetwynde, Emma Fielding as Flossie, and Richard Pearce as Peter."]}, {"page": "Duke of York's Theatre", "response": ["* Little Shop of Horrors (12 March 2007 – 23 June 2007) by Alan Menken, starring Sheridan Smith, Paul Keating and Alistair McGowan"]}, {"page": "Impressionist (entertainment)", "response": ["In the 1990s there was a certain absence of impressionists on television, with the demise of Spitting Image and Rory Bremner mainly concentrating on political figures (notably John Major, Tony Blair, Gordon Brown, and also members of the Royal Family). Then in 1999 came Alistair McGowan's Big Impression with Alistair McGowan and Ronni Ancona, and in 2002 Dead Ringers. Both these shows featured impressions of celebrities and television personalities, as well as sporting figures on the former and politicians on the latter. In the same year as Dead Ringers' debut, Channel 4 began broadcasting an adult sketch show created by and starring comedian Leigh Francis, Bo' Selecta! which spoofed singers including Craig David, Mel B and Michael Jackson, however the show focused on making caricatures out of celebrities, rather than impersonating them."]}, {"page": "Anglo-Indian people", "response": ["* Alistair McGowan, impressionist, comedian and actor"]}, {"page": "Ronni Ancona", "response": ["For many years Ancona worked extensively in radio and on television shows, such as Fist of Fun, as well as performing stand-up comedy. She co-wrote and performed in shows such as Comedy Nation, Pulp Video, and The Sketch Show alongside Lee Mack. In 2000 she teamed up with Alistair McGowan, with whom she had previously worked on The Staggering Stories of Ferdinand De Bargos and Standing Room Only, to create The Big Impression. The show was one of BBC1's top-rating comedy programmes for four years, and won both a Variety Club Comedy Award and a BAFTA. In 2003 she won \"Best Actress\" at the British Comedy Awards.", "Ancona's first Edinburgh Festival appearance was in 1992, during which she performed in two shows: The Inexplicable World of Lionel Nimrod with Stewart Lee and Richard Herring, and a stand-up show with Alistair McGowan.", "In 2009 A Matter of Life and Death: How to Wean a Man Off Football, by Ancona and Alistair McGowan, was published by Faber & Faber.", "Ancona had a seven-year relationship with Alistair McGowan which ended shortly before they started working together professionally. Ancona is married to Gerard Hall,England & Wales, Civil Registration Marriage Index, 1916–2005 a consultant rheumatologist with whom she has two daughters. They live in West London."]}, {"page": "Baddiel and Skinner Unplanned", "response": ["| 3 || 2 || 21/03/2002 || Rob - Student of special effects || Old Man River (Red Book, Song 7) || Romford births, Special effects, German Three Lions, Most famous person in phone book, Up the auntie, Likely lads, Alistair McGowan, Ex-partners, Bono vs George Bush"]}, {"page": "The Plough Arts Centre, Torrington", "response": ["In 2014 a 60-year-old 35mm celluloid Westar projector was supplemented with a digital projector and enhancements to technical capabilities at the centre, including a new box office system. The money was raised by public fundraising backed by Alistair McGowan, who is a patron of The Plough. The campaign was also boosted by the $4,500 raised at an event with Michael Portillo."]}, {"page": "Fist of Fun", "response": ["Many other comedians who appeared in the series went on to fame themselves, including the actor Kevin Eldon, Peter Baynham, Ronni Ancona, Alistair McGowan, Al Murray, Ant & Dec, John Thomson, Rebecca Front, Mel Giedroyc, Sue Perkins, Ben Moor and Sally Phillips."]}, {"page": "The Imaginatively Titled Punt & Dennis Show", "response": ["Impressionists Alistair McGowan and Ronni Ancona were among the guests on the show."]}, {"page": "Alistair MacGowan", "response": ["#REDIRECT Alistair McGowan"]}, {"page": "What Not to Wear (British TV series)", "response": ["On the show Big Impression, Alistair McGowan and Ronni Ancona took to spoofing Trinny and Susannah's presenting techniques on What Not to Wear.No, seriously . . . does my cheque look big in this? — telegraph.co.uk. Retrieved 8 March 2007.McGowan's latest makeover  — thisislondon.co.uk. Retrieved 30 August 2007. Trinny and Susannah were also spoofed in a sketch on 2DTV when it showed them giving Santa Claus a makeover, where they substituted his red suit for a casual shirt and trousers.What to wear if you want to make a big impression — mirror.co.uk. Retrieved 15 March 2007."]}, {"page": "The Canterville Ghost", "response": ["*A reading of the story by Alistair McGowan was broadcast on BBC Radio 7 in December 2007."]}, {"page": "Dot Cotton", "response": ["Dot has been generally well received by critics: she has been referred to as a cultural archetype and Brown has won multiple awards for her portrayal. However, aspects of the character such as her smoking and her religious beliefs have been criticised, with religious groups suggesting Dot's faith is used in a pejorative manner. The character has also made an impact on popular culture; she has been spoofed, most notably by Alistair McGowan, and has been credited as inspiration for catwalk collections.", "The character of Dot Branning has been spoofed in the cartoon sketch show 2DTV. She was also impersonated by Alistair McGowan in his television series Big Impression. As part of the sketch, Dot and her son Nick were morphed into a version of the sitcom duo Steptoe and Son. McGowan stated in 2001 that Dot was his favourite impression, because he \"looks a bit like her\"."]}, {"page": "Pygmalion (play)", "response": ["*2011: Rupert Everett (later Alistair McGowan) and Kara Tointon at the Garrick TheatreTointon's indisposition on 25 August 2011 enabled understudy Rebecca Birch to make her West End début in a leading role (insert to Garrick Theatre programme for Pygmalion)."]}, {"page": "Robbie the Reindeer", "response": ["* Alistair McGowan as Des Yeti and Alan Snowman: Commentators for The Reindeer Games. The characters are parodies of presenter Des Lynam and football commentator Alan Hansen, who both starred on BBC One's Match of the Day in the 1990s. Appear  in Hooves of Fire and Legend of the Lost Tribe."]}, {"page": "Miquita Oliver", "response": ["Oliver was a part of the four-part BBC TV series 24 Hours in the Past, along with Colin Jackson, Alistair McGowan, Ann Widdecombe, Tyger Drew-Honey and Zoe Lucker which went out between 28 April and 19 May 2015 on BBC One."]}, {"page": "Stephen Tompkinson", "response": ["In 1994, he was Private Simon 'Spock' Matlock, a history teacher and intellectual in BBC comedy drama All Quiet on the Preston Front, written by Tim Firth and set in Lancashire. Alistair McGowan replaced him after the first series because Tompkinson had other commitments. That same year he was in  Downwardly Mobile – a Yorkshire Television sitcom about a group of Yuppies – aired for one season but failed to make an impression and was not recommissioned.British TV Comedy: Downwardly Mobile, undated "]}]}}