{"wiki_id": "http://www.wikidata.org/entity/Q4722715", "itemLabel": "Alfred Gell", "itemDescription": "British anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Gell", "wikipedia_page": {"main": "Alfred Antony Francis Gell,  (; June 12, 1945 – January 28, 1997) was a British social anthropologist whose most influential work concerned art, language, symbolism and ritual.  He was trained by Edmund Leach (MPhil, Cambridge University) and Raymond Firth (PhD, London School of Economics) and did his fieldwork in Melanesia and tribal India.  Gell taught at the London School of Economics, among other places. He was also a Fellow of the British Academy.  He died of cancer in 1997, at the age of 51.", "link_mentions": [{"page": "List of anthropologists", "response": ["*Alfred Gell"]}, {"page": "Abductive reasoning", "response": ["In anthropology, Alfred Gell in his influential book Art and Agency defined abduction (after Eco) as \"a case of synthetic inference 'where we find some very curious circumstances, which would be explained by the supposition that it was a case of some general rule, and thereupon adopt that supposition. Gell criticizes existing \"anthropological\" studies of art for being too preoccupied with aesthetic value and not preoccupied enough with the central anthropological concern of uncovering \"social relationships\", specifically the social contexts in which artworks are produced, circulated, and received.Bowden, R. (2004) A critique of Alfred Gell on Art and Agency. Retrieved Sept 2007 from: Find Articles at BNET Abduction is used as the mechanism for getting from art to agency.  That is, abduction can explain how works of art inspire a sensus communis: the commonly held views shared by members that characterize a given society.Whitney D. (2006) \"Abduction the agency of art\". Retrieved May 2009 from: University of California, Berkeley "]}, {"page": "List of people associated with the London School of Economics", "response": ["* Alfred Gell, anthropologist"]}, {"page": "Anthropology of art", "response": ["One of the central problems in the anthropology of art concerns the universality of 'art' as a cultural phenomenon. Several anthropologists have noted that the Western categories of 'painting', 'sculpture', or 'literature', conceived as independent artistic activities, do not exist, or exist in a significantly different form, in most non-Western contexts.Robert Layton. (1981) The Anthropology of Art. Thus, there is no consensus on a single, cross-cultural definition of 'art' in anthropology.Howard Morphy & Morgan Perkins. (2006) Introduction, in The Anthropology of Art: A Reader.G. Angioni, Fare dire sentire: l'identico e il diverso nelle culture, Nuoro, il Maestrale, 2011 To surmount this difficulty, anthropologists of art have focused on formal features in objects which, without exclusively being 'artistic', have certain evident 'aesthetic' qualities. Boas' Primitive Art, Claude Lévi-Strauss' The Way of the Masks (1982) or Geertz's 'Art as Cultural System' (1983) are some examples in this trend to transform the anthropology of 'art' into an anthropology of culturally-specific 'aesthetics'. More recently, in his book Art and Agency, Alfred Gell proposed a new definition of 'art' as a complex system of intentionality, where artists produce art objects to effect changes in the world, including (but not restricted to) changes in the aesthetic perceptions of art audiences.Alfred Gell. (1998) Art and Agency. Gell's ideas have stirred a large controversy in the anthropology of art in the 2000s.Ross Bowden. (2004) A Critique of Alfred Gell on Art and Agency. Oceania, 74: 309-325Robert H. Layton. (2003) Art and Agency: A reassessment. Journal of the Royal Anthropological Institute, 9: 447-464Howard Morphy. (2009). Art as a Mode of Action: Some Problems with Gell’s Art and Agency. Journal of Material Culture, 14 (1): 5-27"]}, {"page": "1990s in anthropology", "response": ["*Alfred Gell"]}, {"page": "Gell", "response": ["* Alfred Gell (1945–1997), British social anthropologist"]}, {"page": "Sister exchange", "response": ["Alfred Gell who studied Umeda believed that \"sister exchange\" is not an appropriate term for this type of marriage referring to the fact that the \"exchanged\" women do not cease being sisters to their brothers; he also argued that sister exchange is not a proper exchange either."]}, {"page": "‘Alfred’ Antony Francis Gell", "response": ["#REDIRECT Alfred Gell"]}, {"page": "(Antony Francis) 'Alfred' Gell", "response": ["#REDIRECT Alfred Gell"]}, {"page": "Coral Gardens and Their Magic", "response": ["Coral Gardens and Their Magic, properly Coral Gardens and Their Magic Volume I: A Study of the Methods of Tilling the Soil and of Agricultural Rites in the Trobriand Islands and Coral Gardens and Their Magic Volume II: The Language of Magic and Gardening, is the final two-volume book in anthropologist Bronisław Malinowski's ethnographic trilogy on the lives of the Trobriand Islanders. It concentrates on the cultivation practices the Trobriand Islanders used to grow yams, taro, bananas and palms which Malinowski's more famous ethnography Argonauts of the Western Pacific briefly mentioned in passing. It describes the gardens in which the Trobrianders grew food as more than merely utilitarian spaces, even as works of art. In 1988 Alfred Gell called the book \"still the best account of any primitive technological-cum-magical system, and unlikely ever to be superseded in this respect\". The book has been described as Malinowski's magnum opus."]}]}}