{"wiki_id": "http://www.wikidata.org/entity/Q4723437", "itemLabel": "Alfred Sherman", "itemDescription": "Economist & journalist (1919-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Sherman", "wikipedia_page": {"main": "Sir Alfred Sherman (10 November 1919 – 26 August 2006) was an English writer, journalist, and political analyst. Described by a long-time associate as \"a brilliant polymath, a consummate homo politicus, and one of the last true witnesses to the 20th century\", he was a Communist volunteer in the Spanish Civil War but later changed his views completely and became an adviser to Margaret Thatcher.", "link_mentions": [{"page": "Sherman (name)", "response": ["*Sir Alfred Sherman (1919–2006), British journalist"]}, {"page": "Centre for Policy Studies", "response": ["It was co-founded by Sir Keith Joseph, Alfred Sherman and Margaret Thatcher"]}, {"page": "Martin Smyth", "response": ["Smyth was on the parliamentary advisory board of Western Goals (UK) which held a well-attended fringe meeting at the Conservative Party conference in October 1988 on the subject of \"International Terrorism – how the West can fight back\". He was one of numerous high-profile speakers including General Sir Walter Walker, Andrew Hunter MP, Sir Alfred Sherman and Harvey Ward.Labour Research, November 1988, p.2. Hunter and Ward both gave considerable detail to the meeting concerning top-level links between the IRA and ANC.Young European Newsletter, December 1988 edition, published by Western Goals (UK), London."]}, {"page": "Federation of Conservative Students", "response": ["In The Observer, Toby Young wrote: \"As nights of mob terror go, last Monday's party at the Federation of Conservative Students' Conference was pretty tame\". Both Young and Sir Alfred Sherman believed that Gummer's actions were motivated by his opposition to the libertarian ideology of some of the FCS' members which closely resembled some of Mrs Thatcher's personal beliefs. Sherman wrote that Gummer's actions were \"directed against the Prime Minister\". Tim Hames and Nick Robinson later admitted that the bill presented for damage was less than £20, and that the media reports were as a result of an \"astute spinning operation\" by Wet delegates from the University of Oxford, who \"directed journalists to students who offered harrowing accounts of the boorish behaviour of libertarian activists.\""]}, {"page": "Alfredo Cristiani", "response": ["After becoming President of El Salvador, he, with members of his cabinet, and other colleagues visited Europe and London. He was the principal guest at a dinner held in his honour by the Western Goals Institute at Simpsons-in-the-Strand, London, on 25 September 1989. The guest list included figures such as Sir Alfred Sherman (policy advisor to Margaret Thatcher), Professor Antony Flew, Zigmunt Szkopiak, Denis Walker and Dr Harvey Ward, all of whom were active anti-communists.The Daily Telegraph and Times, Court & Social page, 26 September 1989 This visit, along with others that included Spain, Italy, United States, Mexico, Venezuela, Argentina, Chile, Uruguay, and all Central American countries, was part of a diplomatic effort carried out by Cristiani and his delegates in order to find and secure international support for the peace negotiation efforts that were being carried out by his government. Support was actively and officially sanctioned by Venezuela, Mexico, and Spain, who would play an active role, along with the United Nations, in the negotiating process."]}, {"page": "Antony Flew", "response": ["Politically Flew was a libertarian-leaning conservative and wrote articles for The Journal of Libertarian Studies. His name appears on letterheads into 1992 as a vice-president of the Conservative Monday Club, and he held the same position in the Western Goals Institute.Labour Research, November 1988, p. 2. He was one of the signatories to a letter in The Times along with Lord Sudeley, Sir Alfred Sherman, and Dr. Harvey Ward, on behalf of the institute, \"applauding Alfredo Cristiani's statesmanship\" and calling for his government's success in defeating the Cuban and Nicaraguan-backed communist FMLN in El Salvador.The Times, 29 September 1989."]}, {"page": "Pandora's Box (British TV series)", "response": ["* Sir Alfred Sherman"]}, {"page": "Conservative Philosophy Group", "response": ["Other members included Alan Clark MP, Enoch Powell MP, Maurice Cowling, Edward Norman, Sir Alfred Sherman, Paul Johnson, T. E. Utley, Lord Black, Lord Bauer, Lord Blake, Lord Sieff, Lord Weinstock, Lord Thomas and Lord Quinton. The following addressed the group: F. A. Hayek, Milton Friedman, Michael Oakeshott, Elie Kedourie, and Harold Macmillan."]}, {"page": "Western Goals Institute", "response": ["The institute was reaching out to a variety of robustly conservative associations which were also opposed to communism. In August Lauder-Frost was forging links with Joachim Siegerist of Die Deutschen Konservativen e.V., in Hamburg, and London's Time Out magazine carried a report headlined \"Bad Taste\" in September saying that the Western Goals hierarchy, in addition to courting Jean-Marie Le Pen, and Franz Schönhuber of the German Republikaner Party, had been dining at Simpsons-in-the-Strand, London, with El Salvador's Arena Party President Major Roberto d'Aubuisson, who subsequently became one of the institute's patrons.Time Out magazine, London, Sept 13-20, 1989, no.995. This was followed by a letter in The Times signed by Lord Sudeley, Sir Alfred Sherman, Professor Antony Flew and Dr. Harvey Ward, on behalf of the institute, \"applauding Alfredo Cristiani's statesmanship\" and calling for his government's success in defeating the Cuban and Nicaraguan-backed communist FMLN terrorists.The Times, 29 September 1989.Labour Research, November 1988, p. 2, where Sir Alfred Sherman and his son Gideon, as well as Professor Antony Flew, are mentioned as WG members. The following year, on 21 February 1990, Lauder-Frost appeared on BBC's 'Newsnight' opposing Labour MP Alice Mahon's support for Communist insurgents in Central America. ", "The WGI initially worked towards its goals via members of the British Conservative Party, and in particular via the right-wing Conservative Monday Club with whom it also shared some members: Andrew Smith had been a former chairman of the Club's Young Members Group, Paul Masson and Stuart Notholt, \"one-time member of the editorial board of the Conservative 'Dreadnaught Group'\", also Monday Clubbers, were all on Western Goals' first UK Directorate. Western Goals activists Lauder-Frost, Anthony Murphy, and Dr.Harvey Ward all held \"key positions in the Monday Club Executive\".City Limits, 9-16 Aug 1990, p. 8, Others included Sir Alfred Sherman and his son Gideon.", "On 25 September 1989, Lord Sudeley chaired a Western Goals dinner at Simpson's-in-the-Strand for El Salvador's President, Alfredo Cristiani, and his inner cabinet. The guest list included figures such as Sir Alfred Sherman (policy advisor to Margaret Thatcher), Lord Nicholas Hervey, Antony Flew, Zigmunt Szkopiak, Denis Walker and Harvey Ward.The Daily Telegraph and Times, Court & Social page, 26 September 1989"]}, {"page": "Hackney Downs School", "response": ["* Alfred Sherman, journalist"]}, {"page": "Harvey Ward", "response": ["At the October 1988 Conservative Party Conference, Western Goals (UK) (which Ward had also joined) held a fringe meeting on the subject of \"International Terrorism - how the West can fight back\". Harvey Ward, Sir Alfred Sherman, Rev Martin Smyth, MP, and Andrew Hunter, MP, were the speakers. The latter spoke concerning top-level links between the Provisional Irish Republican Army (IRA) and African National Congress (ANC).Young European Newsletter, December 1988 edition, published by Western Goals (UK), London."]}, {"page": "Denis Walker", "response": ["A robust anti-communist, Denis Walker was a guest on 25 September 1989 at the Western Goals Institute Dinner at Simpsons-in-the-Strand, London, in honour of the President of El Salvador, Alfredo Cristiani, and his inner cabinet. Others present included Sir Alfred Sherman (policy advisor to Margaret Thatcher), Monday Club vice-president Professor Antony Flew, Dr Zigmunt Szkopiak (foreign affairs minister for the Polish government-in-exile), the Monday Club's Colonel Barry Turner RE (Retd), Sam Swerling (former Monday Club chairman), Andrew VR Smith, Stuart Notholt and Gideon Sherman (WGI Directors), Gregory Lauder-Frost and Harvey Ward of the Monday Club's Foreign Affairs Committee and both vice-presidents of Western Goals."]}, {"page": "Warren Zimmermann", "response": ["Within days of meeting Zimmermann, Izetbegović withdrew his signature and renounced the peace plan he agreed to in Lisbon, suddenly declaring his opposition to any type of ethnic division of Bosnia and Herzegovina. Within weeks a full blown war developed. Three and a half years later, the Dayton Accord that all three sides accepted in November 1995 thus ending the war, featured a very similar canton system, dividing Bosnia-Herzegovina internally along ethnic lines. Writing in 1997, Alfred Sherman, British political analyst and an adviser to Margaret Thatcher, described Zimmermann's involvement in Bosnia, along with American overall foreign policy in the Balkans, as: \"lying and cheating, fomenting war in which civilians are the main casualty, and in which ancient hatreds feed on themselves\".America's Intervention in the Balkans;March 1997"]}, {"page": "Deaths in August 2006", "response": ["*Sir Alfred Sherman, 86, British journalist, writer and political analyst.", "*Alfred Sherman, 86, British co-founder of the Centre for Policy Studies."]}, {"page": "After Dark (TV programme)", "response": ["John Underwood wrote of the programme broadcast on 6 August 1988: \"I recall hosting an edition of... After Dark in which (Bianca Jagger) intellectually crushed Dr John Silber, a senior adviser to Ronald Reagan, and Roberto Ferrey, an apologist for the Contras. Furthermore, she left Sir Alfred Sherman lost for words, a feat rarely achieved before or since.\"John Underwood, 'Bianca For President', The Independent, 16 May 1992"]}]}}