{"wiki_id": "http://www.wikidata.org/entity/Q4722620", "itemLabel": "Alfred Egerton", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Egerton", "wikipedia_page": {"main": "The Honourable Alfred John Francis Egerton (6 February 1854 – 25 September 1890), was a British Conservative politician from the Egerton family.\nHe was the youngest son of the Second Earl of Ellesmere and Lady Mary Campbell. He was educated at Eton College, joining the Grenadier Guards aged 18 and served seven years as a lieutenant. He married Isabelle Clarisande Gertrude Gorges in 1881.\nIn 1885 he was elected as Conservative MP for Eccles in Lancashire, and was re-elected in the following year. His last public address was at Worsley Primrose League on 7 July 1888.He died after a long illness (consumption) at Burwood House, his mother's residence in 1890, aged 36.", "link_mentions": [{"page": "Earl of Ellesmere", "response": ["The Hon. Alfred Egerton, younger son of the second Earl, represented Eccles in Parliament."]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Hon. Alfred Egerton"]}, {"page": "Paul Rosbaud", "response": ["After the war, Rosbaud took up residence in England. He worked for Butterworth-Springer, a company set up in response to a Scientific Advisory Board that included Alfred Egerton, Charles Galton Darwin, Edward Salisbury, and Alexander Fleming. When the Butterworth Company decided to pull out of the English/German liaison, Robert Maxwell acquired 75% while 25% rested with Rosbaud. The company name was changed to Pergamon Press; the partners, with their considerable language skills, cooperated in establishing new academic journals until 1956.Joe Haines (1988) Maxwell, Houghton Mifflin,  After a disagreement, Rosbaud left. Maxwell said Rosbaud \"was an outstanding editor of the European type from whom I learned some of the trade in the early days\"."]}, {"page": "Eccles (UK Parliament constituency)", "response": ["| Alfred Egerton"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Alfred Egerton"]}, {"page": "Egerton (name)", "response": ["* Alfred Egerton (1854–1890), British politician"]}, {"page": "Alfred John Francis Egerton", "response": ["#REDIRECT Alfred Egerton"]}, {"page": "1890 Eccles by-election", "response": ["The by-election was caused by the death of the sitting Conservative MP the Hon. Alfred John Francis Egerton on 25 September 1890.Obituary: Alfred Egerton,  The Times, September 27, 1890, p. 10 Egerton had held the seat at the 1886 general election with a majority of 292 votes."]}]}}