{"wiki_id": "http://www.wikidata.org/entity/Q4722268", "itemLabel": "Alfred B. Mullett", "itemDescription": "American architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_B._Mullett", "wikipedia_page": {"main": "Alfred Bult Mullett (April 7, 1834 – October 20, 1890) was a British-American architect who served from 1866 to 1874 as Supervising Architect, head of the agency of the United States Treasury Department that designed federal government buildings. His work followed trends in Victorian style, evolving from the Greek Revival to Second Empire to Richardsonian Romanesque.", "link_mentions": [{"page": "Mullet", "response": ["* Alfred B. Mullett (1834–1890), American architect"]}, {"page": "Boise, Idaho", "response": ["Designed by Alfred B. Mullett, the U.S. Assay Office at 210 Main Street was built in 1871 and today is a National Historic Landmark."]}, {"page": "Portland, Maine", "response": ["The spire of the Cathedral of the Immaculate Conception has been a notable feature of the Portland skyline since its completion in 1854. In 1859, Ammi B. Young designed the Marine Hospital, the first of three local works by Supervising Architects of the U.S. Treasury Department. Although the city lost to redevelopment its 1867 Greek Revival post office, which was designed by Alfred B. Mullett of white Vermont marble and featured a Corinthian portico, Portland retains his equally monumental 1872 granite Second Empire–Renaissance Revival custom house."]}, {"page": "List of architects", "response": ["*Alfred B. Mullett (1834–1890), American"]}, {"page": "Glendale, Ohio", "response": ["* Alfred B. Mullett, architect"]}, {"page": "Knoxville, Tennessee", "response": ["Knoxville is home to the nation's largest concentration of homes designed by noted Victorian residential architect George Franklin Barber, who lived in the city.Knox Heritage, George Barber Homes Trolley Tour Booklet , 2007. Retrieved: January 7, 2012. Other notable local architects include members of the Baumann family, Charles I. Barber (son of George), R. F. Graf, and more recently, Bruce McCarty. Nationally renowned architects with works still standing in the city include Alfred B. Mullett (Greystone), John Russell Pope (H.L. Dulin House), and Edward Larrabee Barnes (Knoxville Museum of Art)."]}, {"page": "Daniel Chester French", "response": ["*Peace and Vigilance (alternatively America at War and Peace) US Customhouse & Post Office, St. Louis, Missouri, Alfred B. Mullett architect (1876–1882)"]}, {"page": "Taunton", "response": ["*Alfred B. Mullett (1834–1890), architect to Abraham Lincoln, born in Taunton"]}, {"page": "1834 in architecture", "response": ["* April 7 – Alfred B. Mullett, English-born American architect (d. 1890)"]}, {"page": "1890 in architecture", "response": ["* October 20 – Alfred B. Mullett, American architect (born 1834)"]}, {"page": "Benjamin Bristow", "response": ["Fulfilling the press's reformer expectation, Bristow immediately went to work. He drastically reorganized the Treasury Department, abolished the corrupt office of supervising architect made famous by Alfred B. Mullett, and  dismissed the second-comptroller and his subordinates for inefficiency. Bristow shook up the detective force and consolidated collection districts in the Customs and Internal Revenue Services.   He dismissed over 700 people and implemented civil service rules in the Treasury Department."]}, {"page": "List of United States Post Offices", "response": ["* Post Office, Portland, Maine, designed by Alfred B. Mullett, demolished in 1965"]}, {"page": "Eisenhower Executive Office Building", "response": ["It was designed by Alfred B. Mullett, Supervising Architect. Patterned after French Second Empire architecture that clashed sharply with the neoclassical style of the other Federal buildings in the city, it was generally regarded with scorn and disdain, and Mullett, the exterior architect, ended his life by suicide, while in litigation. The OEOB was referred to by Mark Twain as \"the ugliest building in America.\" President Harry S. Truman called it \"the greatest monstrosity in America.\" Historian Henry Adams called it Mullett's “architectural infant asylum.”", "Category:Alfred B. Mullett buildings"]}, {"page": "San Francisco Mint", "response": ["The second building, completed in 1874, was designed by Alfred B. Mullett in a conservative Greek Revival style with a sober Doric order. The building had a central pedimented portico flanked by projecting wings in an E-shape; it was built around a completely enclosed central courtyard that contained a well—the features that saved it during the fire of 1906, when the heat melted the plate glass windows and exploded sandstone and granite blocks with which it was faced. The building sat on a concrete and granite foundation, designed to thwart tunneling into its vaults, which at the time of the 1906 fire held $300 million, fully a third of the United States' gold reserves. Efforts by Superintendent of the Mint, Frank A. Leach, and his men preserved the building and the bullion that then backed the nation's currency.  The mint resumed operation soon thereafter, continuing until 1937."]}, {"page": "List of people from Cincinnati", "response": ["*Alfred B. Mullett – architect"]}, {"page": "Carson City Mint", "response": ["The building that housed the mint was the first designed by Alfred B. Mullett after becoming Supervising Architect of the Department of the Treasury. The construction supervisor was Abraham Curry, also known as the \"Father of Carson City.\" The simple Renaissance Revival-style stone facade has pairs of round-headed windows and a center portico. It is now the home of the Nevada State Museum. Although the mint has not struck United States coins since 1893, Coin Press No. 1 (the original coin press from the mint) is still in the building and used to strike commemorative medallions with the \"CC\" mint mark. The most recent of these are medallions commemorating the 75th anniversary of the museum.", "Category:Alfred B. Mullett buildings"]}, {"page": "Adolf Cluss", "response": ["Cluss maintained his solo private practice but became a Building Inspector for the Board of Public Works in Washington, DC. The Board was the most powerful entity in the city. Cluss wrote building regulations and was a major proponent of the use of building permits and inspections. On October 18, 1872, he was appointed by President Ulysses S. Grant as a member of the Board of Public Works and City Engineer. This came at the recommendation of Governor Cooke, Alexander \"Boss\" Shepherd and his predecessor Alfred B. Mullett.Change in the Board of Public Works - Evening Star October 19, 1872 - page 1"]}, {"page": "Office of the Supervising Architect for the U.S. Treasury", "response": ["* Alfred B. Mullett, 1865 to 1874"]}, {"page": "Alfred B. Mullet", "response": ["#redirect Alfred B. Mullett"]}, {"page": "Pioneer Courthouse", "response": ["Category:Alfred B. Mullett buildings"]}, {"page": "Mullett", "response": ["* Alfred B. Mullett, an American architect"]}, {"page": "West Virginia Independence Hall", "response": ["The building has gone a number of alterations since its construction, many of which have subsequently been reversed to bring the building close to the original vision of the architect, Ammi B. Young.  Young's design had a low-pitch roof that was found inadequate for proper drainage, and was steepened in the late 1860s to a design by Alfred B. Mullett.  The roof was raised when a fourth floor was added in the 20th century; the fourth floor was removed during restoration, but Mullett's roofline was retained."]}, {"page": "Joseph Goldsborough Bruff", "response": ["After returning to Washington, Bruff went to work as a draftsman in the office of the supervising architect in the United States Department of the Treasury.  In that position, he designed the ornamentation for the south and west wings of the Treasury building in Washington as well as architectural ornamentation for Treasury offices throughout the country.  During his tenure in the office, he served under supervising architects Ammi B. Young, Isaiah Rogers, and Alfred B. Mullett.  Bruff did not get along with Mullett and left the office in 1869, transferring to the department's registry office.  He returned to the Treasury architect's office in 1876 to serve under his friend James G. Hill.  By 1887, Bruff was the oldest employee of the United States Government.\"Personal and Impersonal\", Wyandott Herald, Kansas City, Kansas, 10 February 1887, p.1\"Personal and Impersonal\", Lawrence Daily Journal, Lawrence, Kansas, 19 February 1887, p. 2.  He remained in his Treasury position until he became ill in early 1889."]}, {"page": "Old Customs House (Knoxville, Tennessee)", "response": ["Congress appropriated funding for Knoxville's Customs House in 1856, and reappropriated the funding in 1869.United States Treasury Department, A History of Public Buildings Under the Control of the Treasury Department (Washington, D.C.: Government Printing Office, 1901), p. 553. Construction of the original portion of the Customs House (at the corner of Clinch and Market), designed by U.S. government chief architect Alfred B. Mullett (1834–1890), began in 1871 and was completed in 1874. The first floor was used as a post office, while the second and third floors were used for the federal court and office space for federal officials.", "Category:Alfred B. Mullett buildings"]}, {"page": "Greystone (Knoxville, Tennessee)", "response": ["Category:Alfred B. Mullett buildings"]}, {"page": "Assay Office (Boise, Idaho)", "response": ["Category:Alfred B. Mullett buildings"]}, {"page": "Federal Building (Raleigh, North Carolina)", "response": ["The Federal Building, also known as the Century Post Office, is a historic building located on Fayetteville Street in Raleigh, Wake County, North Carolina. It was the first Federal Government project in the South following the Civil War. Construction of the building began in 1874 and was completed in 1878. The building's Second Empire design was by Alfred B. Mullett whose more famous works included the Old Executive Office Building located near the White House. The Federal Building was listed on the National Register of Historic Places in 1971 and is a Raleigh Historic Landmark.", "Category:Alfred B. Mullett buildings"]}, {"page": "Second Empire style", "response": ["The style quickly spread and evolved as Baroque Revival architecture throughout Europe and across the Atlantic. Its suitability for super-scaling allowed it to be widely used in the design of municipal and corporate buildings. In the United States, where one of the leading architects working in the style was Alfred B. Mullett, buildings in the style were often closer to their 17th-century roots than examples of the style found in Europe.Copplestone, p. 311."]}, {"page": "United States Customhouse and Post Office (St. Louis, Missouri)", "response": ["It was designed by architects Alfred B. Mullett, William Appleton Potter, and James G. Hill,St. Louis, Missouri, 1884, Federal Judicial Center and was constructed between 1873 and 1884. Located at the intersection of Eighth and Olive Streets, it is one of four surviving Federal office buildings designed by Mullett.  The others are the Eisenhower Executive Office Building in Washington, D.C., the Century Post Office in Raleigh, N.C.\"The St. Louis Old Post Office and Custom House\", Your Missouri Courts and the U.S. Custom House in Portland, Me. It is in the Second Empire architectural style popular in the post Civil-War era. Mullett's other Second Empire buildings in Boston, Cincinnati, New York City and Philadelphia have been demolished.", "Category:Alfred B. Mullett buildings"]}, {"page": "Alfred Bult Mullett", "response": ["#redirect Alfred B. Mullett"]}, {"page": "New Opera House (Charles Town, West Virginia)", "response": ["The Old Opera House is located in the Shenandoah Valley in Charles Town, West Virginia, once known as the New Opera House or simply The Opera House, is a restored theater, designed by T.A. Mullett of Washington, D.C., son of architect Alfred B. Mullett.  The theater opened in 1911, bringing minstrel shows, vaudeville, touring theater groups, circuses and wild west shows to Charles Town. By the 1930s a projection machine was installed, but the theater closed in 1948.  It has since re-opened as a community-supported performance space."]}, {"page": "Gibson-Todd House", "response": ["The house was designed by Thomas A. Mullett, son of Alfred B. Mullett. Mullett also designed the New Opera House and the new Charles Town jail."]}, {"page": "Jefferson County Courthouse (West Virginia)", "response": ["The first courthouse on the site was built in 1803 on a lot donated by Charles Washington, but was destroyed in a fire. Its replacement, the core of the present courthouse, was built in 1836–37 with its present Doric pedimented porch. During the American Civil War the courthouse was heavily damaged by cannon fire and was salvaged for metal. Was it torn down? From 1865 to 1872 the courthouse was vacant, and court was held in Shepherdstown at McMurran Hall. In 1871–72 the building was reconstructed to a design by Phillips and Cockrill, keeping the façade, but little else. A disproportionately large cupola was added for the town clock on top of the porch at this time. In 1910 Alfred B. Mullett designed an extension to the rear, with a later Georgian Revival addition comprising a jail and sheriff's offices.", "Category:Alfred B. Mullett buildings"]}, {"page": "Governors Island (Lake Winnipesaukee)", "response": ["In 1872, the island was sold to Isaac Merrill and Henry Brown of Gilford, who in turn sold it to its most famous modern owner in 1880. The buyer was Stilson Hutchins of Washington, DC, founding owner and editor of The Washington Post. Hutchins had a grand mansion built out of granite there in 1885, which he used as his summer home. The architect was Alfred B. Mullett, the supervising architect of the U.S. Treasury, and the construction manager was Job W. Angus, who had built the Smithsonian Institution in Washington, DC. Hutchins had U.S. presidents as summer guests, including Grover Cleveland and Theodore Roosevelt. From 1903 to 1908, Hutchins leased the island to the German ambassador to the United States, Count von Sternburg, and during summers the island served as the location of the German Embassy to the United States with a staff of twenty."]}, {"page": "Tennessee marble", "response": ["In 1873, federal architect Alfred B. Mullett used Tennessee marble for Knoxville's Post Office and Customs House, sparking a nationwide curiosity in the stone. Mullett acquired the marble from a quarry at Forks-of-the-River, where the Holston and French Broad rivers join to form the Tennessee River east of Knoxville.  After the building's completion, businessman George Ross and several associates organized the Knoxville Marble Company to assume control of this quarry, and provided marble for the construction of the Mullett-designed Customs House in St. Louis during the mid-1870s.  Following Ross's death, his son, John M. Ross, became president of the company."]}, {"page": "Architecture of St. Louis", "response": ["Other significant civic buildings from the late 19th century and early 20th century include the U.S. Customhouse and Post Office by Alfred B. Mullett (1873) and the stately St. Louis Public Library by Cass Gilbert (1912). While the Old Post Office has been renovated, the St. Louis Public Library is slated for renovation as of 2010. In 1923 the city passed an $87 million bond issue for the re-development of the Civic Plaza along the lines of the City Beautiful movement.  This development resulted in some of St. Louis's major civic architecture:  the Soldiers' Memorial, the Civil Courts Building, and Kiel Auditorium."]}, {"page": "1890 in the United States", "response": ["* October 20 – Alfred B. Mullett, architect (born 1834)"]}, {"page": "Samuel Taylor Suit Cottage", "response": ["The fifteen-room interior features a ballroom  wide and  long. The design is attributed to Washington architect Alfred B. Mullett, who is alleged to have drawn a rough sketch of the plan on a tablecloth at the Berkeley Springs Hotel. The design may have been based on elements of Berkeley Castle in Gloucestershire, United Kingdom. Detailed design and construction supervision was carried out by Snowden Ashford, who designed Washington's Eastern Market, apprenticed for Mullett and is also credited as an architect.  Mrs. Suit entertained lavishly at the house until her money ran out and the property was sold in 1913."]}]}}