{"wiki_id": "http://www.wikidata.org/entity/Q4723512", "itemLabel": "Alfred Thesiger", "itemDescription": "British judge (1838-1880)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Thesiger", "wikipedia_page": {"main": "Alfred Henry Thesiger (15 July 1838 – 20 October 1880), styled The Hon. Alfred Thesiger from 1858 to 1877 and The Rt Hon. Lord Justice Thesiger from 1877, was a British lawyer and judge.", "link_mentions": [{"page": "Viscount Chelmsford", "response": ["Several other members of the Thesiger family have also gained distinction. Sir Frederic Thesiger (died 1805), uncle of the first Baron, was a captain in the Royal Navy and served as Aide-de-Camp to Lord Nelson at the Battle of Copenhagen in 1801. The Hon. Charles Wemyss Thesiger (1831–1903), second son of the first Baron, was a Lieutenant-General in the Army. His eldest son George Thesiger was a temporary Major-General in the Army and was killed in the First World War. His son Sir Gerald Thesiger was a Judge of the High Court of Justice. The Hon. Alfred Thesiger, third son of the first Baron, was a Lord Justice of Appeal. The Hon. Sir Edward Pierson Thesiger (1842–1928), fourth son of the first Baron, was Clerk-Assistant to Parliament from 1890 to 1917. His second son Sir Bertram Sackville Thesiger (1875–1966) was a naval commander and served as Commander-in-Chief of the East Indies Station between 1927 and 1929 while his third son Ernest Thesiger was an actor. The Hon. Wilfred Gilbert Thesiger (1871–1920), third son of the second Baron, was Consul-General and Minister Plenipotentiary to Addis Ababa. His eldest son Sir Wilfred Thesiger was an explorer and travel writer. The Hon. Eric Thesiger, fourth son of the second Baron, was a soldier and courtier."]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Hon. Alfred Thesiger (1838–1880)"]}, {"page": "Alfred Henry Thesiger", "response": ["#REDIRECT Alfred Thesiger"]}, {"page": "Thesiger LJ", "response": ["#REDIRECT Alfred Thesiger"]}, {"page": "List of Marylebone Cricket Club players (1827–1863)", "response": ["* Alfred Thesiger (1861) : A. H. Thesiger ()"]}]}}