{"wiki_id": "http://www.wikidata.org/entity/Q4730892", "itemLabel": "Allan O'Keefe", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Allan_O%27Keefe", "wikipedia_page": {"main": "Allan O'Keefe is a British actor, known mostly for his work on British television.\nOne of his first roles was playing Quando in The Villains (1964), a series of unrelated televised plays, which only have the subject of villainy in common. He later went on to have roles in the Adam Faith television series Budgie (1971) and the supernatural television series What's Next? (1974).\nO'Keefe's most notable role was playing PC Fred Render in the successful police drama Z-Cars. He remained in that role from 1971 til the series' went off air in 1978. He went on to play a role in the hospital drama Maybury (1981) and in 1985 he joined the cast of the BBC soap opera EastEnders. O'Keefe played Chris Smith, the father of the wayward punk Mary Smith, played by Linda Davidson. O'Keefe appeared periodically until 1987, when he was introduced as a main cast member. He remained in the role until 1988.\nSince his departure O'Keefe has appeared in Emmerdale and Last of the Summer Wine.\n\n", "link_mentions": [{"page": "Z-Cars", "response": ["| PC Fred Render || Allan O'Keefe || 1971–1978 || 6–12 || 65"]}, {"page": "List of former EastEnders characters", "response": ["|Chris Smith || Allan O'Keefe || 1985–1988"]}, {"page": "List of Brookside characters", "response": ["|Bob Gossage || Allan O'Keefe || 1983"]}, {"page": "Mary Smith (EastEnders)", "response": ["Despite this, Mary refuses to stop prostituting herself, even when the healthcare worker, Carmel Roberts (Judith Jacob), warns her that her baby might be taken away from her if she continues. Mary is furious and rampages around to find out who had reported her to Carmel. An anonymous letter from Dot Cotton puts Sue in the frame, and this leads to Mary viciously attacking Sue in the café one night. Mary is later arrested for soliciting, which leaves her with a large fine. However, even this doesn't stop her prostituting herself. Mary's unsocial hours mean that she is often forced to leave baby Annie alone at night whilst she goes out to work the streets. This culminates in Annie nearly dying in a fire one night when she is left alone. Luckily for Mary, she is rescued by Arthur Fowler (Bill Treacher)  before she is harmed. Dot can no longer stand the maltreatment of Annie so she contacts Mary's parents, Chris Smith (Allan O'Keefe) and Edie Smith (Eileen O'Brien), who arrive in Walford and demand to take Annie back with them to Stockport. Mary initially refuses, but she eventually realises that her burnt-out flat is no place for a baby, so she begrudgingly allows Annie to go."]}, {"page": "Rod Norman", "response": ["Rod is first seen in Albert Square in July 1987 as an acquaintance of fellow punk, Mary Smith (Linda Davidson). Rod is a greasy loafer, but underneath his scruffy appearance lies a kind-hearted, genuine guy who will go out of his way to help anyone in need. Mary becomes the first lady who Rod takes under his wing. Mary is going through a hard time around the time of his arrival. She has been arrested for solicitation, lost her baby to social services due to neglect, and as well as continuing to prostitute herself, she is using recreational drugs heavily. Seeing how desperate Mary has become, Rod makes it his mission to help her out of the mess she has got herself into. He moves in with her, gets her a job as a cleaner at The Dagmar, weans her off drugs and prostitution, and is instrumental in helping her work towards getting her baby back, who is now in the care of Mary's parents in Stockport. Although there are initial problems (mainly because Mary's parents refuse to give Annie back to her), by the end of the year Mary's father Chris (Allan O'Keefe) arrives in Walford with Annie, and mother and daughter are finally reunited."]}, {"page": "List of EastEnders characters (1985)", "response": ["Annie is once left alone in the launderette by accident while Mary goes drinking in The Queen Victoria pub. Debbie Wilkins (Shirley Cheriton) finds her and returns her to her mother, along with a few choice words for Mary. Mary also has a tendency to leave Annie home alone whilst she goes out to prostitute herself at night. On one such occasion, Annie throws her blanket at the electric fan heater, causing a fire. Arthur Fowler (Bill Treacher) rescues her but as a result, Annie is removed from Mary's care and given to her grandparents, Chris Smith (Allan O'Keefe) and Edie Smith (Eileen O'Brien), who live in Stockport. With the help of Mary's boyfriend, Rod Norman (Christopher McHallem), and Carmel Jackson (Judith Jacob), Annie is eventually reunited with her mother, although it takes a lot of persuading to make Edie return her, as she feels that Mary is not capable of caring for a young child. Annie spends Christmas Day 1987 in hospital after Chris, who is drunk, abducts her in an attempt to take her back to Stockport and crashes his car into a wall, though Annie is unharmed. Eventually, Mary decides to leave Albert Square for good with Annie in May 1988.", "Chris Smith (initially credited as 'Man', then as Mary's father), played by Allan O'Keefe, is the father of Mary Smith (Linda Davidson). A haulage driver from Stockport, he is first seen in Walford in May 1985 when he comes to visit his wayward daughter. Mary (or Theresa as she was known to Chris) had left Stockport to escape her family, so she is not pleased when Chris arrives and tries to persuade her to return with him so he can help bring up her young daughter. After several ill-fated attempts, Mary sends him away."]}, {"page": "List of EastEnders characters (1987)", "response": ["A religious and strict woman, Edie alienated her daughter so much that she ran away from Stockport to escape her. Mary moves to London after becoming pregnant and chooses not to inform her family about her child. When Mary's father, Chris Smith (Allan O'Keefe), tracks her down and discovers he has a granddaughter, Mary makes him promise not to tell Edie. Mary worries that her mother will interfere and take over. Chris pays heed to his daughter's wishes for several years. However, when he discovers that Mary has left her daughter Annie Smith alone in her flat to prostitute herself, he decides to take action. He informs Edie and she comes to Walford in May 1987 to sort Mary out. Despite Mary's protests, she takes Annie back to Stockport to live with her, leaving Mary distraught.", "| Mary Smith's (Linda Davidson) brother. He comes to Walford from Stockport with his mother, Edie (Eileen O'Brien) to visit his father, Chris (Allan O'Keefe) and niece, Annie, in hospital after Chris got drunk and attempted to take Annie to Stockport, but he crashed the car into a Postbox."]}, {"page": "List of EastEnders characters (1988)", "response": ["|  An old business associate of Chris Smith (Allan O'Keefe) from Stockport, who provides Chris with money for his new haulage firm, Smith & Jameson Haulage.\"Harry Jameson\", walford.net. Retrieved 27 April 2007."]}]}}