{"wiki_id": "http://www.wikidata.org/entity/Q4730987", "itemLabel": "Allan Stewart", "itemDescription": "English guitarist and bassist", "wikipedia_url": "https://en.wikipedia.org/wiki/Allan_Stewart_(musician)", "wikipedia_page": {"main": "Allan William Stewart (born 21 January 1977 in Coventry, England) is an English musician. He is the second guitarist in Idlewild, the bassist in Holy Mountain and guitarist for the band Desalvo. He grew up in Farnborough, Hampshire.Stewart joined Idlewild as a touring guitarist in 2000 and became a full member in 2003. He features on the Idlewild albums Warnings/Promises, Make Another World and Post Electric Blues, of which, on the latter he is also pictured on the cover. He co-wrote \"I Never Wanted\" on The Remote Part. \nFollowing Idlewild's hiatus in 2010, Stewart joined Glasgow band Holy Mountain with Pete Flett (drums) and Andy McGlone (vocals). Stewart also commenced work as a guitar, bass and drum tech for many popular touring bands such as Mogwai, The Jesus & Mary Chain, Franz Ferdinand, Primal Scream, Belle & Sebastian and Icelandic band, Of Monsters and Men.In 2019, Stewart once again took up touring guitarist duties for Idlewild whom he continues to perform with. He continues to reside in Glasgow, Scotland, U.K. with his partner.", "link_mentions": [{"page": "The Remote Part", "response": ["Bookending two UK tours, \"You Held the World in Your Arms\" was released as the album's lead single on 15 April 2002. The second and third singles \"American English\" and \"Live in a Hiding Place\" were released on 1 July and 21 October 2002, respectively. During a stint of Europe, bassist Bob Fairfoull left the band, and was temporarily replaced by technician Alex Grant. They then supported Coldplay on their tours of the UK and Europe. In November 2002, Gavin Fox of Turn and touring guitarist Allan Stewart joined as official members. Two further tours of the UK followed in late 2002 and early 2003; they then went on a headlining US tour, before supporting Pearl Jam in that territory for two months.", "\"I Never Wanted\", co-written between the band, previous guitarist Jeremy Mills, and touring guitarist Allan Stewart, is a mid-tempo ballad that is reminiscent of The Soft Bulletin (1999)-era Flaming Lips. The Ash-indebted \"(I Am) What I Am Not\" was influenced by the writing of Fernando Pessoa in his book The Book of Disquiet (1982). \"Live in a Hiding Place\" is an acoustic track with piano during the chorus sections. \"Out of Routine\" was originally titled \"Ceilidh Hard\", which was named after \"Party Hard\" (2001) by Andrew W.K. \"Century After Century\" is a mid-tempo song; \"Tell Me Ten Words\" evokes the sound of R.E.M., and opens with a country-like guitar intro. \"Stay the Same\" is a hard rock song. The album's closing track \"In Remote Part/Scottish Fiction\" ends with a spoken-word narrative from Morgan about the band's Scottish identity. When first contacting Morgan, Woomble had sent him a letter where he told him of his admiration for Morgan's work. Woomble had been a fan of Morgan's since his teenage years, and detailed identity and belonging in his letter. Morgan replied with his own letter, which concluded with a poem that ended up becoming \"Scottish Fiction\".", "* Allan Stewart – extra guitar (track 11)"]}, {"page": "Idlewild (band)", "response": ["As 2001 began, the band re-entered the studio, this time with producer Stephen Street, to record songs written in the last half of 2000. While happy with the results the band put their next album aside to tour America. American music magazine Spin named 100 Broken Windows the \"number one album you didn't hear in 2000\" and the album received other rave reviews in the American press on its release in April. Whilst touring the album in America, Allan Stewart replaced Jeremy Mills as touring guitarist. Readers of The Skinny magazine in Scotland would retrospectively vote 100 Broken Windows 'The Scottish Album of the Decade' in December 2009.", "In the immediate aftermath of Fairfoull's departure, Idlewild fulfilled their tour dates for the rest of the year with Grant on bass. On 20 November, Idlewild unveiled Gavin Fox of the Irish band Turn as their new bassist, with touring guitarist Allan Stewart also becoming a permanent member of the band. Fairfoull approved of being replaced as Idlewild bassist by his good friend Fox, though he also added, \"It felt a bit like if you left your wife, and a week later she started shagging your brother. But I realised there’s no point being bitter, they’ve got to continue as a band.\"", "An end to the band's hiatus was made public in September 2013, by which point Gareth Russell and Allan Stewart had left to be replaced by multi-instrumentalist Luciano Rossi. The band started recording a new album in January 2014. Seventh studio album, Everything Ever Written, was released in February 2015.  In addition to Woomble, Jones and Newton, the album also included contributions from new members Rossi and bassist Andrew Mitchell of The Hazey Janes.", "Idlewild marked the 15th anniversary of The Remote Part by playing the album in full at two Christmas 2017 shows at the ABC in Glasgow, which sold out within a day, and KOKO in London. The second Glasgow show was notable for surprise guest appearances by former Idlewild members Allan Stewart and Bob Fairfoull.The band then spent 2018 working on a new album, and playing another The Remote Part anniversary show in Edinburgh with Fairfoull once again appearing as a special guest. The resultant album, Interview Music, was released on 5 April 2019, and Allan Stewart rejoined on second guitar for the live shows.", "* Allan Stewart – guitar (2001–2002, 2019–present; official member 2003–2010)", " bar:Allan text:\"Allan Stewart\""]}, {"page": "List of guitarists", "response": ["*Allan Stewart (Idlewild)"]}, {"page": "Warnings/Promises", "response": ["Warnings/Promises is the fourth studio album by Scottish rock band Idlewild, released on 7 March 2005 by Parlophone. Following the release of their third studio album The Remote Part (2002), Gavin Fox replaced bassist Bob Fairfoull, and touring guitarist Allan Stewart became a permanent member. They spent the majority of 2003 writing material, before traveling to Malmö, Sweden to record at Tambourine Studios with producer Dave Eringa. After finishing five tracks, they went to Los Angeles to work at Sunset Sound Recorders with producer Tony Hoffer. Due to the laidback nature of the sessions, the band had to re-record everything; recording concluded in October 2004. Described as an college rock and folk rock album, Warnings/Promises emphasized more acoustic instrumentation than its predecessor.", " Despite the album receiving favourable press in the US, the band's American label Capitol Records declined to promote it in that territory. While this was occurring, the post-punk revival became mainstream, with fellow Scottish band Franz Ferdinand overtaking Idlewild's popularity. Bassist Bob Fairfoull left the band in October 2002, and was temporarily replaced by bass technician Alex Grant. The following month, Gavin Fox of Turn became the band's full-time bassist, and Allan Stewart, who had been part of the band's crew, became their second guitarist.", "* Allan Stewart – guitar"]}, {"page": "Make Another World", "response": ["Guitarist Allan Stewart noted that \"the new songs are getting a great reception when we play them live. I think people were expecting more acoustic stuff, so the fact that it’s more upbeat surprises some people. I think people like the loud songs live, but there is still a mix on it. It is balanced – it’s pretty heavy in places!” and said that the band “wrote this record when we didn’t have a label, so there were no A&R people on the phone. We were on our own, we wrote the record and then when Sanctuary came to us it was all but done. It was nice in that way that we had so much freedom.\"", "* Allan Stewart – guitars, vocals"]}, {"page": "Allan Stewart", "response": ["Allan Stewart may refer to:", "*Allan Stewart (artist) (1865–1951), painter of military scenes and battles", "*Allan Stewart (comedian) (born 1950), British comic and impressionist", "*Allan Stewart (footballer), Scottish international footballer, 1888–1889", "*Allan Stewart (ice hockey) (born 1964), retired National Hockey League left winger", "*Allan Stewart (Jacobite), legendary Jacobite in \"the Appin murder\" who inspired both Walter Scott and Robert Louis Stevenson", "*Allan Stewart (musician) (born 1977), guitarist in the bands Idlewild and DeSalvo", "*Allan Stewart (politician) (1942−2016), Conservative Party Scottish politician", "*Allan Stewart (rugby union) (born 1940), New Zealand rugby union player", "*Allan Stewart, Commendator of Crossraguel Abbey, tortured by Gilbert Kennedy, 4th Earl of Cassilis"]}, {"page": "Post Electric Blues", "response": ["* Allan Stewart – guitars, vocals"]}, {"page": "Holy Mountain (band)", "response": ["Holy Mountain is a psychedelic rock band from Glasgow, Scotland, comprising Andy McGlone (guitar and vocals), Pete Flett (drums) and Allan Stewart (Idlewild/Desalvo). The band is currently signed to Chemikal Underground Records.", "Andy McGlone and Pete Flett met in the Captains Rest in Glasgow, December 2008 and started the band as a two-piece. They were later joined by Allan Stewart in April 2010. They take their name from the 1973 film by Alejandro Jodorowsky.", "* Allan Stewart - bass (2010 – present)"]}, {"page": "Everything Ever Written", "response": ["In 2013, Woomble and Jones began writing with one another again: \"For two or three years we didn’t really have much contact with each other, creatively speaking, but very naturally, at the start of 2013 it started to happen. [...] There was always an understanding between Rod and myself and Colin that we’d work on another record at some point, whether it would be two years, three years, ten years. We’d come too far to just close the door.\" Long-time guitarist Allan Stewart and bass guitarist Gareth Russell remained absent from the sessions, with Woomble noting, \"Gareth and Allan have not been involved much so far due to both their other touring commitments, but they will be in time, as will others.\" Ultimately, both did not participate in the writing and recording of Everything Ever Written and amicably parted from the band. Allan Stewart eventually rejoined Idlewild in 2019."]}]}}