{"wiki_id": "http://www.wikidata.org/entity/Q47463135", "itemLabel": "Connor Lawson", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Connor_Lawson", "wikipedia_page": {"main": "This is a list of characters that were introduced in CBBC's The Dumping Ground. The series is based on The Story of Tracy Beaker by Jacqueline Wilson. It has aired since 2013 and has aired eight series so far. The series follows The Story of Tracy Beaker that ran for five series from 2002 to 2005, and Tracy Beaker Returns that ran for three series from 2010 to 2012. Connor Byrne has played the role of Mike Milligan for all three programmes although he left in Series 7 Episode 24 to live with his family in Ireland.", "link_mentions": [{"page": "The Academy at Shotton Hall", "response": ["The actor Connor Lawson actor who played Alex Walker in The Dumping Ground and Billy Elliot in the West End attended the school."]}, {"page": "List of The Dumping Ground characters", "response": ["May-Li, Mike and the young people are invited to meet their new neighbours, Peter and Janet Umbleby (Simon Ludders and Alison Pargeter), who mistake the young people for Mike and May-Li's children and when they find out them being from a care home, they decide to hold a public meeting. May-Li and Mike are panicked that they may receive another OFSTED visit and Ryan (Lewis Hamilton) believes he is going to leave the 'Dumping Ground' after overhearing a conversation, however, Joseph (Yousef Naseer) chooses to volunteer to leave, but it turns out it was for a theme park trip as a representative. May-Li and Mike are not happy when Chloe (Hannah Moncur) disappears with a girl, Candi Rose (Carma Hylton), when she is out with Ryan and May-Li figures out Kazima likes the Umblebys son, Edward Umbleby (Jaimie Boubezari) when she hates the way Peter is with Edward. Chloe is shocked when Candi-Rose arrives at the 'Dumping Ground' with May-Li, as is Candi-Rose when she sees Chloe, as they both lied and Candi-Rose promises she intended to tell Chloe the truth and Chloe tearfully confides in May-Li she wanted a friend to like her for herself as she does not like herself. May-Li helps Archie (Jethro Baliba) when he injures himself and Archie offers to help May-Li do a border in the garden, coming up with plans, and Archie denies to Ryan that he has got May-Li confused as a mum. May-Li and Mike find out about Archie's feelings when Ryan is accused of trashing the border, but May-Li reassures him he is special. Floss is picked to appear in a commercial and May-Li helps her when Floss struggles with how to act with a TV Mum without having her own and she tells May-Li and Mike she wants to be adopted. When Archie is convinced he is getting younger, May-Li and Mike give him a parcel of things from his dad. May-Li returns from a holiday, where a boy and an old man, Alex (Connor Lawson) and George (Paul Barber), are in the attic, who Kazima and Tyler are trying to help. May-Li finds out about it when Alex confronts Kazima over George disappearing, who does it to get Alex to stay at the 'Dumping Ground', which the young people do not like. Kazima receives a video call from her father in Denmark, Kazima chooses to join him and May-Li takes Kazima to the airport.", "Alex Walker,Dawn Harrison on Twitter: @DominicKane4 Alex's surname is Walker played by Connor Lawson, made his first appearance on 3 March 2017 in series 5 of The Dumping Ground during the episode \"Belief\".", "Mike comes across a letter from a development firm in the garden and everyone is horrified to learn that they are planning to knock The Dumping Ground down and build flats. After a visit to the council, Mike and Tyler (Miles Butler-Houghton) tell everyone the decision was taken to close The Dumping Ground was down to money. When there's a visit by the mayor, Ryan borrows Mike's MBE to help keep The Dumping Ground open, but Alex (Connor Lawson) eggs the Mayor and Peter. The Dumping Ground appears on the news and Mike is horrified that Peter is head of building planning and Janet exaggerates the young people's behaviour. Peter later reveals that the sale has been brought forward to the following day due to the management of The Dumping Ground. Elektra (Jessica Revell) returns to The Dumping Ground and greets everyone before sarcastically insulting the Umblebys. The Umblebys receive an email about the sale being put on hold due to the reports of Roman remains on the site, which the young people, Mike and May-Li are delighted about. Peter comes across Frank (Chris Slater) at the council whilst trying to find the boss, but Frank tells him his boss is away and is working on the site report. Elektra emerges when Peter leaves, impressed with how things are going. Alex overhears Peter and Janet discussing their own hired archaeological expert, who he will bribe with money to get his own way. Frank and Tyler look into Peter's plans when their archaeological plan flans and realise that Peter and Janet will gain a luxury house for the development. Janet returns the stolen money to Tyler and the theft was arranged by Peter. Janet tells Tyler that she wants to remain where she is and Tyler gets Frank to search something. Mike tricks Peter inside and the young people tell him they know he is getting a new house and Peter gives in."]}, {"page": "The Dumping Ground (series 5)", "response": ["18-year-old Connor Lawson, 19-year-old Emily Burnett, 9-year-old Jasmine Uson and 12-year-old Carma Hylton were cast as Alex, Charlie, Taz and Candi-Rose respectively."]}, {"page": "Durham Sixth Form Centre", "response": ["*Connor Lawson, star of CBBC's The Dumping Ground"]}]}}