{"wiki_id": "http://www.wikidata.org/entity/Q47467184", "itemLabel": "Kate McNicol", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_McNicol", "wikipedia_page": {"main": "Kate McNicol (born 19 July 1961) is a former British rower who competed at the 1984 Summer Olympics.", "link_mentions": [{"page": "Great Britain at the 1984 Summer Olympics", "response": ["* Astrid Ayling, Ann Callaway, Alexa Forbes, Gillian Hodges, Kate Holroyd, Belinda Holmes, Sarah Hunter-Jones, Kate McNicol, Sue Bailey "]}, {"page": "Ann Redgrave", "response": ["Having taken up the sport in 1981, Redgrave rowed in the women's eight at the 1984 Los Angeles Olympics. The team which consisted of Astrid Ayling, Alexa Forbes, Gillian Hodges, Kate Holroyd, Belinda Holmes, Sarah Hunter-Jones, Kate McNicol and Sue Bailey (cox) finished in fifth place."]}, {"page": "Teresa Millar", "response": ["Millar was part of the coxless fours crew, with Katie Ball, Kareen Marwick, Kate McNicol and Sue Bailey, that won the national title rowing for the A.R.A Squad, at the 1983 National Rowing Championships. Also during 1983 she competed at the 1983 World Rowing Championships in Wedau, Duisburg."]}, {"page": "Katie Ball", "response": ["Ball was part of the coxless fours crew, with Tessa Millar, Kareen Marwick, Kate McNicol and Sue Bailey, that won the national title rowing for the A.R.A Squad, at the 1983 National Rowing Championships which led to selection for the Great Britain team at the 1983 World Rowing Championships."]}, {"page": "Alexa Forbes", "response": ["In 1984 she was selected to represent Great Britain in the women's eight event at the 1980 Olympics in Moscow. The team which consisted of Astrid Ayling, Ann Callaway, Gillian Hodges, Kate Holroyd, Belinda Holmes, Sarah Hunter-Jones, Kate McNicol and Sue Bailey (cox) finished in fifth place."]}, {"page": "Katherine McNicol", "response": ["#REDIRECTKate McNicol"]}, {"page": "Belinda Holmes", "response": ["She was selected to represent Great Britain at the 1984 Olympic Games in the women's eight event. The crew of Ann Callaway, Alexa Forbes, Gill Hodges, Kate Holroyd, Kate McNicol, Sarah Hunter-Jones and Sue Bailey finished in fifth place."]}, {"page": "Sarah Hunter-Jones", "response": ["In 1983 she went to her second World Championships when rowing at the 1983 World Rowing Championships at Wedau in Duisburg. The following year she was selected by Great Britain for the women's eight event at the 1984 Olympics in Los Angeles. The crew which consisted of Astrid Ayling, Ann Callaway, Alexa Forbes, Gillian Hodges, Kate Holroyd, Belinda Holmes, Kate McNicol and Sue Bailey (cox) finished in fifth place."]}, {"page": "Sue Bailey (rowing)", "response": ["Bailey was part of the coxless fours crew, with Tessa Millar, Kareen Marwick, Katie Ball and Kate McNicol, that won the national title rowing for the A.R.A Squad, at the 1983 National Rowing Championships. "]}, {"page": "Kareen Marwick", "response": ["Marwick was part of the coxless fours crew, with Tessa Millar, Katie Ball, Kate McNicol and Sue Bailey, that won the national title rowing for the A.R.A Squad, at the 1983 National Rowing Championships. "]}, {"page": "1982 British Rowing Championships", "response": ["|Women 2-   || Thames Tradesmen's / Tideway Scullers SchoolLin Clark & Gill Hodges   || London UniversityNicola Boyes & Kate McNicol      ||", "|Women 8+  || A.R.A CompositeAlexa Forbes, Belinda Holmes, Melanie Holmes, Pauline Janson, Kate Panter, Sally Bloomfield, Jo Toch, Jane Cross, Zena Kitching (cox) || CompositeKatie Ball, Gill Parker, Nicola Boyes, Kate McNicol, Lin Clark, Beryl Mitchell, Clare Carpenter, Jean Genchi, Sean Bolton (cox)   ||"]}, {"page": "1983 British Rowing Championships", "response": ["|Women 4+  || A.R.A SquadTessa Millar, Kareen Marwick, Kate McNicol, Katie Ball, Sue Bailey (cox) || Durham University || CompositeGwynne Betty, Jane Cross, Melanie Holmes, Gill Parker, C Grant (cox)"]}]}}