{"wiki_id": "http://www.wikidata.org/entity/Q47491152", "itemLabel": "Fiona Peever", "itemDescription": "British sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Fiona_Peever", "wikipedia_page": {"main": "Fiona Leonora H. Peever, née Winkler (born in 1964), is a British sculptor based in Oxfordshire, England. With her husband and fellow-sculptor Alec Peever, she is a director of Lettering and Sculpture Limited, a sculpture studio. She carves in stone and other materials, and has produced public art, along with art for educational and religious institutions, besides private commissions. She is known for her sculpture of Thomas Attwood in Birmingham (1993), made in collaboration with Siobhan Coppinger. This statue is unusual in that it appears to have stepped down from its soapbox to sit on the steps, seemingly reading some notes.", "link_mentions": [{"page": "Lettering and Sculpture Limited", "response": ["Lettering and Sculpture Limited is a sculpture studio in Ducklington, Oxfordshire. It was incorporated in 2008, and the directors are sculptors Alec and Fiona Peever, a married couple who create art in collaboration with each other, with other sculptors, and with writers. Before and during the life of this company, the two sculptors have shown work at many art exhibitions, executed many commissions, supported several institutions, and won several awards.", "The company is run by City and Guilds-trained sculptors Alec (born 1954) and Fiona Peever (born 1964). Births Jun 1964 Winkler Fiona L.H. Willis Westminster 5C 467 They are business partners, and have been artistic collaborators since 1983. Births Sep 1954 Peever Alec T. Lowrey Surrey N.W. 5g 755"]}, {"page": "Alec Peever", "response": ["#REDIRECT Fiona Peever"]}, {"page": "Fiona Leonora H. Winkler", "response": ["#REDIRECT Fiona Peever"]}, {"page": "Fiona Leonora Winkler", "response": ["#REDIRECT Fiona Peever"]}, {"page": "Fiona Winkler", "response": ["#REDIRECT Fiona Peever"]}, {"page": "Fiona Leonora H. Peever", "response": ["#REDIRECT Fiona Peever"]}, {"page": "Fiona Leonora Peever", "response": ["#REDIRECT Fiona Peever"]}]}}