{"wiki_id": "http://www.wikidata.org/entity/Q4749602", "itemLabel": "Amédée Forestier", "itemDescription": "British artist (1854-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Am%C3%A9d%C3%A9e_Forestier", "wikipedia_page": {"main": "Sir Amédée Forestier (Paris 1854 – 18 November 1930 London) was an Anglo-French artist and illustrator who specialised in historical and prehistoric scenes, and landscapes.", "link_mentions": [{"page": "Nebraska Man", "response": ["In February 1922, Harold Cook wrote to Dr. Henry Osborn to inform him of a tooth that he had had in his possession for some time. The tooth had been found years prior in the Upper Snake Creek beds of Nebraska along with other fossils typical of North America. Osborn received the specimen in March 1922, and quickly set out to identify it. Osborn, along with Dr. William D. Matthew soon came to the conclusion that the tooth had belonged to an anthropoid ape. They then passed the tooth along to William K. Gregory and Dr. Milo Hellman, who agreed that the tooth belonged to an anthropoid ape more closely related to humans than to other apes. Only a few months later, an article was published in Science announcing the discovery of a manlike ape in North America.  An illustration of H. haroldcookii was done by artist Amédée Forestier, who modeled the drawing on the proportions of \"Pithecanthropus\" (now Homo erectus), the \"Java ape-man,\" for the Illustrated London News. Osborn was not impressed with the illustration, calling it: \"a figment of the imagination of no scientific value, and undoubtedly inaccurate\"."]}, {"page": "Henri Lehmann", "response": ["*Amédée Forestier"]}, {"page": "Forestier", "response": ["* Amédée Forestier"]}, {"page": "Paleoart", "response": ["* Amédée Forestier deceased 1930"]}, {"page": "Amedee Forestier", "response": ["#REDIRECT Amédée Forestier"]}, {"page": "George William Thomson Omond", "response": ["* Bruges and West Flanders, painted by Amédée Forestier, London: Adam & Charles Black: London, 1906.", "* Brabant and East Flanders, painted by Amédée Forestier, London: Adam & Charles Black: London, 1907.", "* Liège and the Ardennes, painted by Amédée Forestier, London: A. & C. Black, [1908].", "* Belgium, illustrated by Amédée Forestier, London: Adam & Charles Black, Series: Peeps at Many Lands, 1907."]}, {"page": "John F. Baddeley", "response": ["His most outstanding work was Russia, Mongolia, China; being some record of the relations between them from the beginning of the XVIIth century to the death of the Tsar Alexei Mikhailovich, A.D. 1602–1676; rendered mainly in the form of narratives dictated or written by the envoys sent by the Russian tsars, or their voevodas in Siberia, to the Kalmuk and Mongol khans & princes, and to the emperors of China; with introductions, historical and geographical; also a series of maps showing the progress of geographical knowledge in regard to northern Asia during the XVIth, XVIIth & early XVIIIth centuries. The texts taken more especially from manuscripts in the Moscow Foreign Office Archives; the whole by John F. Baddeley; a monumental work, published in 1919 in two volumes as a limited edition of only 250 copies, with an elaborate frontispiece (\"the book epitomised in a series of pictures\", said Baddeley) drawn by Amédée Forestier and engraved by Emery Walker. It bore a dedication To my friend of many years The Right Honourable Sir William Mather, stating that the production of the book was due to his generosity alone. It earned Baddeley the Victoria Medal of the Royal Geographical Society, and has been later republished as facsimile."]}, {"page": "Amédée", "response": ["*Amédée Forestier (1854 – 1930), French-British artist"]}]}}