{"wiki_id": "http://www.wikidata.org/entity/Q4746344", "itemLabel": "Amina Mama", "itemDescription": "Nigerian-British writer, feminist and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Amina_Mama", "wikipedia_page": {"main": "Amina Mama (born 19 September 1958) is a Nigerian-British writer, feminist and academic. Her main areas of focus have been post-colonial, militarist and gender issues. She has lived in Africa, Europe, and North America, and worked to build relationships between feminist intellectuals across the globe.\n\n", "link_mentions": [{"page": "Nuruddin Farah", "response": ["From 1966 to 1970, he pursued a degree in philosophy, literature and sociology at Panjab University in Chandigarh, India, where he met his first wife, Chitra Muliyil Farah, with whom he had a son (the marriage later ended in divorce). Farah subsequently went to England, attending London University (1974–75) and studying for a master's degree in theatre at Essex University (1975–76). His mother died in 1990, and in 1992 he married British-Nigerian academic Amina Mama and they have a son and a daughter."]}, {"page": "List of Nigerian writers", "response": ["*Amina Mama (born 1958)"]}, {"page": "Funmilayo Ransome-Kuti", "response": ["Biographer Cheryl Johnson-Odim notes that Funmilayo Ransome-Kuti's name remains well known throughout Nigeria and that \"no other Nigerian woman of her time ranked as such a national figure or had [such] international exposure and connections\". Nigerian activist Hajiya Gambo and politician Margaret Ekpo both named Ransome-Kuti as a strong influence on their work, and Nigerian-British feminist writer Amina Mama has cited Ransome-Kuti's activism as having shaped her personal beliefs and perspectives. Ghanaian politician Kwame Nkrumah (later the first Prime Minister of Ghana) was heavily inspired by Ransome-Kuti in his early organizing of the Ghana Women's Association."]}, {"page": "Amina (disambiguation)", "response": ["*Amina Mama (born 1958), Nigerian-British writer, feminist and academic"]}, {"page": "Women in Ghana", "response": ["Feminist organizing has increased in Ghana as women seek to obtain a stronger role in their democratic government. In 2004, a coalition of women created the Women's Manifesto for Ghana, a document that demands economic and political equality as well as reproductive health care and other rights.Interview with Manifesto organizers Dzodzi Tsikata, Rose Mensah-Kutin, and Hamida Harrison, conducted by Amina Mama: \"In Conversation: The Ghanaian Women's Manifesto Movement \", in Feminist Africa 4, 2005. Within this idea of gender inequality comes other problems such as patrilineal and matrilineal inheritance, equal education, wage gaps, and social norms and assigned roles for women. These are some of the main issues Ghanaian women face."]}, {"page": "Ghanaian people", "response": ["Feminist organizing has increased in Ghana as women seek to obtain a stronger role in the nation's democratic governmen. In 2004, a coalition of women created the Women's Manifesto for Ghana, a document that demands economic and political equality as well as reproductive health care and other rights.Interview with Manifesto organizers Dzodzi Tsikata, Rose Mensah-Kutin, and Hamida Harrison, conducted by Amina Mama: \"In Conversation: The Ghanaian Women's Manifesto Movement \", in Feminist Africa 4, 2005. The National Council for Women and Development (NCWD) is fervent in its stance that the social and economic well-being of women, who compose slightly more than half of the nation's population, cannot be taken for granted. The Council sponsored a number of studies on women's work, education, and training, and on family issues that are relevant in the design and execution of policies for the improvement of the condition of women. Among these considerations the NCWD stressed family planning, child care, and female education as paramount.Owusu-Ansah, David. \"The Position of Women\", in A Country Study: Ghana (La Verle Berry, ed.). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain."]}, {"page": "Feminist Africa", "response": ["Feminist Africa is a peer-reviewed academic journal that addresses feminist topics from an \"African continental perspective\". It is published by the African Gender Institute (University of Cape Town). Its founding editor-in-chief is Amina Mama (Mills College and University of California, Davis).\"Amina Mama\" on SSRC (Social Science Research Council), accessed 24 October 2012. It was accredited in 2005 by the South African Department of Education. This allows authors publishing in the journal to collect publication subsidy. The journal is primarily online but also distributes a small number of print copies."]}, {"page": "African Gender Institute", "response": ["The AGI describes itself as specifically feminist and seeks to promote feminism on the African continent. The AGI serves as a point of contact for feminist intellectuals across Africa, many of whom suffer from isolation and discrimination at their academic institutions.See Sylvia Tamale, profiled in: Gretchen L. Wilson, \"African Female Scholars Share Virtual Lifeline\", Women's eNews on WorldPress, 21 December 2006. Amina Mama—a key figure at the AGI—has argued that the organization constitutes a key exception to neoliberal commodification of and control over African academics.Amina Mama interviewed by Elaine Salo, \"Talking about Feminism in Africa\", reproduced in Women's World from Agenda, \"African Feminisms I\", no. 50 (2001). A major goal of the AGI is to maintain an institutional space for African feminists to network, collaborate, teach, and research.", "Faced with budget cuts and shifting institutional support, the AGI found itself split from the project of Gender Studies at UCT. The AGI, under the directorship of Jane Bennett from 2008 to 2017, focused on consolidating its core intellectual positions and its institutional position at UCT, and continued to run successful projects, especially in sexuality and reproductive justice work. These efforts were generally successful, and in 2017, Yaliwe Clarke took over the directorship of the AGI with new agendas for strengthening black, queer and African work especially among young women. This was strongly supported by a new Advisory Board Amina Mama, \"Gender studies for Africa's transformation\", in African Intellectuals: Rethinking Politics, Language, Gender and Development, ed. Thandika Mkandawire, London: Zed Books and CODESRIA, 2006."]}, {"page": "Women's Manifesto for Ghana", "response": ["The Manifesto came out of increased women's organizing in Ghana, particularly around a Domestic Violence Bill and the 2000 elections. This organizing also coincided with a number of murders of women in Accra, which triggered protests at Osu Castle. Activists also opposed the creation of a Ministry of Women's Affairs, which they believed would ghettoize women's issuesInterview with Manifesto organizers Dzodzi Tsikata, Rose Mensah-Kutin, and Hamida Harrison, conducted by Amina Mama: \"In Conversation: The Ghanaian Women's Manifesto Movement\", published in Feminist Africa 4, 2005."]}]}}