{"wiki_id": "http://www.wikidata.org/entity/Q47467038", "itemLabel": "Elizabeth Paton", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Paton_(rower)", "wikipedia_page": {"main": "Elizabeth McVeigh (née Paton) (born 8 November 1952) is a British rower. She competed in the women's eight event at the 1980 Summer Olympics.", "link_mentions": [{"page": "Great Britain at the 1980 Summer Olympics", "response": ["* Gillian Hodges, Joanna Toch, Penny Sweet, Lin Clark, Elizabeth Paton, Rosie Clugston, Nicola Boyes, Beverly Jones, Pauline Wright"]}, {"page": "Elizabeth Paton", "response": ["Isabella Begg had heard of Elizabeth Paton as \"rude and uncultivated to a great degree... with a thorough (though unwomanly) contempt for every sort of refinement.\"' In a letter to Robert Chambers she describes Elizabeth as \"A well developed, plain-featured peasant girl, frank and independent ..\" and for these reasons a favourite with Burns's mother. She goes on to say that Elizabeth Paton had a \"masculine understanding\" and contempt for anything that savoured of culture.Hecht, Page 55", "No poems seem to have been inspired directly by Elizabeth Paton, but she may have been in the poet's mind when he wrote \"The Rantin' Dog.\" A few lines in Burns's first Commonplace Book dated September 1784 relate to her."]}, {"page": "Pauline Wright", "response": ["In 1980 she coxed the women's eight that was selected to go to the Olympic Games in Moscow, the crew which contained Nicola Boyes, Gill Hodges, Joanna Toch, Penny Sweet, Lin Clark, Elizabeth Paton, Rosie Clugston and Beverly Jones finished in fifth place. She was part of the eight that won the national title rowing for Great Britain senior squad boat at the 1981 National Championships."]}, {"page": "Nicola Boyes", "response": ["After rowing at the 1979 World Rowing Championships in Bled. she was part of the women's eight event that was selected to go to the 1980 Olympic Games in Moscow, the crew which contained Boyes, Gill Hodges, Joanna Toch, Penny Sweet, Lin Clark, Elizabeth Paton, Rosie Clugston, Beverly Jones and Pauline Wright (cox) finished in fifth place. A third World Championship appearance ensued in 1983, when she competed in the eights at the 1983 World Rowing Championships in Wedau, Germany."]}, {"page": "Beverly Jones", "response": ["She was selected to represent Great Britain in the women's eight event at the 1980 Olympic Games in Montreal. The crew which consisted of Gill Hodges, Joanna Toch, Penny Sweet, Lin Clark, Elizabeth Paton, Rosie Clugston, Nicola Boyes and Pauline Wright (cox) finished in fifth place."]}]}}