{"wiki_id": "http://www.wikidata.org/entity/Q4749171", "itemLabel": "Amy Elizabeth Thorpe", "itemDescription": "American spy (1910-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Amy_Elizabeth_Thorpe", "wikipedia_page": {"main": "Amy Elizabeth \"Betty\" Thorpe (November 22, 1910 – December 1, 1963) was, according to William Stephenson of British Security Coordination, an American spy, codenamed \"Cynthia\", who worked for his agency during World War II. British Security Coordination was a cover organization that had been set up in New York City by the British Secret Intelligence Service (MI6) in May 1940.", "link_mentions": [{"page": "Cynthia", "response": ["*Amy Elizabeth Thorpe (1910–1963), an American spy codenamed \"Cynthia\""]}, {"page": "William Stephenson", "response": ["He hired hundreds of people, mostly Canadian women, to staff his organization and covered much of the expense out of his own pocket. His employees included secretive communications genius Benjamin deForest \"Pat\" Bayly and future advertising wizard David Ogilvy. Stephenson employed Amy Elizabeth Thorpe, codenamed CYNTHIA, to seduce Vichy French officials into giving up Enigma ciphers and secrets from their Washington embassy.Amy Elizabeth Thorpe: WWII's Mata Hari At the height of the war Bayly, a University of Toronto professor from Moose Jaw, created the Rockex, the fast secure communications system that would eventually be relied on by all the Allies."]}, {"page": "Marion Elizabeth (Walsh) de Chastelain", "response": ["At the outbreak of war between Great Britain and Germany in 1939, she took her children to stay with relatives in England and returned to Romania. In 1940 she returned to England and took the children by sea to live with her parents in New York, USA. There she was recruited to work for Canadian Sir William Stephenson (to whom Winston Churchill had given the codename \"INTREPID\"), travelling regularly to Washington, D.C. to debrief agents working on behalf of the allies for Stephenson. Working with Amy Elizabeth Thorpe, De Chastelain was able to establish covert relationships between British and American intelligence agencies."]}, {"page": "Château de Castelnou", "response": ["The castle was taken by the troops of James II of Majorca en 1286, and again in 1483. Largely demolished in 1559, it was no longer restored or inhabited and deteriorated throughout the 17th and 18th centuries.  At the time of the French Revolution it became the property of the commune.  It was sold to Viscount Satgé in 1875 and, by 1900, had become again an elegant and habitable fortress. It was acquired in 1946 by Charles-Emmanuel Brousse who was married to Amy Elizabeth Thorpe, a famed spy who worked for Britain's MI6 during World War II. Having been ravaged by a terrible fire, in 1987 it was sold and has since been restored."]}, {"page": "Mary S. Lovell", "response": ["She has written biographies of Beryl Markham, Amelia Earhart, Jane Digby, Richard Francis Burton, Amy Elizabeth Thorpe, the Mitford Girls, Bess of Hardwick and the Churchills. Her book on Markham, Straight on Till Morning, researched and written in under a year, after weeks of interviews with the subject in Nairobi, became an immediate international bestseller when it was published in 1987 and was twelve weeks on the New York Times Best Seller list.", "*Amy Elizabeth Thorpe - Cast No Shadow; Women in WW II Espionage (1992)"]}, {"page": "Vichy France", "response": ["* Amy Elizabeth Thorpe"]}, {"page": "George C. Thorpe", "response": ["He married Cora Wells of Minnesota, and the marriage produced daughter Amy Elizabeth Thorpe, who became an American spy, codenamed \"Cynthia\", who worked for William Stephenson during World War II, director of British Security Coordination, a cover organization in New York City set up by British Secret Intelligence Service (MI6) in May 1940.", "George Thorpe died July 28, 1936 at Bethesda Naval Hospital in Bethesda, Maryland and is buried at Arlington National Cemetery.Burial Detail: Thorpe, George C (Section 6, Grave 9287) – ANC Explorer He married Cora Edna Wells, on April 8, 1908, the daughter of a Minnesota senator. They had had three children; the eldest, Amy Elizabeth Thorpe, was a successful World War II spy."]}, {"page": "Amy Elizabeth Brousse", "response": ["#REDIRECT Amy Elizabeth Thorpe"]}, {"page": "Amy Brousse", "response": ["#redirect Amy Elizabeth Thorpe"]}, {"page": "Betty Pack", "response": ["#redirectAmy Elizabeth Thorpe"]}, {"page": "List of women in Bletchley Park", "response": ["* Amy Elizabeth Thorpe"]}, {"page": "Elizabeth Thorp Pack", "response": ["#redirect Amy Elizabeth Thorpe"]}, {"page": "Elizabeth Thorpe Pack", "response": ["#redirect Amy Elizabeth Thorpe"]}, {"page": "Alberto Lais", "response": ["In 1962 British author H. Montgomery Hyde claimed, in his book The Quiet Canadian: The Secret Service Story of Sir William Stephenson, that while serving as naval attaché in Washington Lais had been seduced by American spy (working for the British secret service) Amy Elizabeth Thorpe, known as Cynthia, and persuaded to hand over to her the codebooks of the Italian Navy, leading to British victory in the battle of Cape Matapan. Lais's son Lucio, also a naval officer, sued Hyde in 1966 for defamation against his deceased father; he won the trial and the publisher withdrew the book from the Italian market already before the sentence. The Italian Ministry of Defense stated that Lais had indeed passed information to Cynthia, but that she had deliberately been given false information, as a counter-espionage operation. In the 1970s it was revealed that Italian naval codes had been broken by the Government Code and Cypher School without the use of codebooks.\"Chapter 5: Breaking Naval Enigma\". In Smith, Michael (2011). The Bletchley Park Codebreakers. Biteback Publishing. pp. 79–92."]}]}}