{"wiki_id": "http://www.wikidata.org/entity/Q4749365", "itemLabel": "Amy Rosenthal", "itemDescription": "British playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Amy_Rosenthal", "wikipedia_page": {"main": "Amy Rosenthal (born 1974) is a British playwright from Muswell Hill, London. She is a recipient of The Sunday Times Drama Award.", "link_mentions": [{"page": "D. H. Lawrence", "response": ["*On the Rocks: a 2008 stage play by Amy Rosenthal showing Lawrence, his wife Frieda Lawrence, short-story writer Katherine Mansfield and critic and editor John Middleton Murry in Cornwall in 1916–17."]}, {"page": "Robin of Sherwood", "response": ["| colspan=\"3\" | David de Keyser as Joshua de Talmont, Katharine Levy as Sarah de Talmont, Amy Rosenthal as Esther de Talmont, Adam Rosenthal as Samuel de Talmont"]}, {"page": "Jack Rosenthal", "response": ["He married actress Maureen Lipman in 1974;Obituary, BBC, 29 May 2004 they have two grown-up children, writers Amy Rosenthal and Adam Rosenthal. Jack Rosenthal was a Manchester United fan all his life."]}, {"page": "Frieda Lawrence", "response": ["She is an important character in On the Rocks, a play by Amy Rosenthal which deals with her sometimes difficult relationship with D.H. Lawrence."]}, {"page": "John Middleton Murry", "response": ["Murry appears as a character in Amy Rosenthal's D.H. Lawrence biodrama On The Rocks. In the 2008 Hampstead Theatre production Murry was played by Nick Caldecott with Ed Stoppard as Lawrence and Charlotte Emmerson as Mansfield."]}, {"page": "Tracy-Ann Oberman", "response": ["In July 2008 Oberman continued her theatre run by starring in the world premiere of On the Rocks as Frieda Lawrence, wife of novelist D. H. Lawrence. The play, by Amy Rosenthal, follows the marriage of the Lawrences during one idyllic summer in 1916, and received generally favourable reviews, with Arts critic Michael Billington describing Oberman's performance as \"capturing Frieda's intense love-hate relationship with her impossible partner\". The censure was echoed by Nicholas de Jongh in the Evening Standard in his less than enthusiastic review of the play, criticising Oberman for her \"often unintelligible German accent\". However, most reviews followed the line taken by Benedict Nightingale of The Times in declaring Oberman to have given a \"fine performance... as a gloriously sensual, blowsily defiant Frieda\"."]}, {"page": "Ed Stoppard", "response": ["In 2007, he played the title role in the BBC's drama-documentary Tchaikovsky: Fortune and Tragedy.Tchaikovsky on the BBC TimeOut. 24 January 2007 In 2008 Stoppard returned to the stage in the Hampstead Theatre production of Amy Rosenthal's D. H. Lawrence biodrama On the Rocks, alongside Nick Caldecott and Charlotte Emmerson."]}, {"page": "UK Jewish Film Festival", "response": ["The 16th UK Jewish Film Festival opened at the NFT1, BFI Southbank with the UK premiere of Sophie Lellouche's debut feature film Paris Manhattan. The Opening Night Gala was attended by many VIPs including French film director Sophie Lellouche, Israeli actor Ohad Knoller, British actor Maureen Lipman, journalist and film critic Jason Solomons, playwright Amy Rosenthal as well as UKJF Honorary Life Patron Sir Sydney Samuelson.", "The Best Screenplay Award jury was headed by film producer Nik Powell and also comprised filmmaker Josh Appignanesi, screenwriter Phillipa Goslett, playwright Amy Rosenthal, actor Georgia Slowe and TV producer Derek Wax. The Award went to Death of a Poetess, directed by Dana Goldberg and Efrat Mishori."]}, {"page": "Charlotte Bray", "response": ["In 2015 Bray's chamber opera Entanglement received its premiere from the Nova Music Opera. Charlotte collaborated with the librettist Amy Rosenthal on the story of Ruth Ellis, the last woman to be hanged in Britain. Also premiered in 2015, Out of the Ruins, commissioned by the Royal Opera House Covent Garden for their youth company, mezzo-soprano and orchestra; Come Away for the Chester Cathedral Choir; and a new work for cellist Guy Johnston."]}, {"page": "Richard Williams (theatre director)", "response": ["He is currently (2020) Course Leader of the BA Acting at Drama Centre London,'Richard Williams', at Central Saint Martins website. and remains associated with Dartington.See short biographical notice in Dartington August 2018 blurb for Oh! What a Lovely War. Williams' recent work includes directing the British premiere of Vivaldi’s opera L'Olimpiade at the Bath International Music Festival,'Opening Night Gala Opera', Bath Abbey website. also presented at the Eilat Festival. His work with Nova Music Opera under George Vass includes stage direction of several contemporary operas, including Stephen McNeff's Prometheus Drown'd (2014, to Williams's libretto),P. Reed, 'Nova Music Opera double-bill,' Classical Source 29 July 2014. Charlotte Bray and Amy Rosenthal's Entanglement (2015),'UK Tour, 2015', Nova Music - Opera. and Joseph Phibbs and Laurie Slade's Juliana (2018).A. Clements, 'Juliana review - Miss Julie reworking makes for a convincing, effective new opera', The Guardian, 17 July 2018."]}, {"page": "On the Rocks (Amy Rosenthal play)", "response": ["#REDIRECTAmy Rosenthal"]}, {"page": "Sixty-Six Books", "response": ["| Romans || The Man Who Came to Brunch || Amy Rosenthal ||"]}, {"page": "2015 in British music", "response": ["* Charlotte Bray and Amy Rosenthal – Entanglement"]}, {"page": "2015 in classical music", "response": ["* Charlotte Bray and Amy Rosenthal – Entanglement"]}, {"page": "K. S. Lewkowicz", "response": ["KS Lewkowicz lives and works in London, where he has a close ongoing working relationship with the Arcola Theatre in London's Off West End, the theatre where most of his writing has been developed and produced. Most recently with playwright Amy Rosenthal he wrote the music and lyrics for The Queen and I – a musical about Queen Victoria and her close relationship with her Indian servant. The first reading of The Queen and I took place in August 2015 at Arcola theatre as part of their Grimeborn festival, followed by a second reading in August 2016 funded by an Arts Council grant. The musical is currently being developed by the Arcola theatre."]}, {"page": "Clare Lizzimore", "response": ["Lizzimore is well known for directing premiers of new writing including Jonah and Otto by Robert Holman at The Royal Exchange Manchester, Faces in The Crowd by Leo Butler at The Royal Court Theatre, One Day When We were Young by Nick Payne as part of the Paines Plough/Sheffield Roundabout Season and On the Rocks, a play written by Amy Rosenthal about the turbulent life of writer D.H. Lawrence."]}, {"page": "Entanglement (opera)", "response": ["Entanglement is a one-act chamber opera by the British composer Charlotte Bray and the librettist Amy Rosenthal.  The work was commissioned by the Nova Music Opera and was first performed on 6 July 2015 at the Cheltenham Music Festival, with the conductor George Vass leading soprano Kirsty Hopkins, baritone Howard Croft, tenor Greg Tassell, and the Nova Music Opera Ensemble.Bray, Charlotte (2015). Entanglement: Program Note. Retrieved January 7, 2016."]}, {"page": "On the Rocks (2008 play)", "response": ["On the Rocks is a 2008 play written by Amy Rosenthal and directed by Clare Lizzimore about real events surrounding novelist, short story writer, poet and playwright D. H. Lawrence in the tiny village of Zennor in Cornwall in 1916 in the middle of World War I. It played at the Hampstead Theatre in London from 1 to 26 July 2008. It was shortlisted for the Susan Smith Blackburn Prize in 2009.", "*Writer: Amy Rosenthal"]}, {"page": "Lara Macgregor", "response": ["* On the Rocks by Amy Rosenthal (2010)"]}]}}