{"wiki_id": "http://www.wikidata.org/entity/Q4746902", "itemLabel": "Amita Dhiri", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Amita_Dhiri", "wikipedia_page": {"main": "Amita Emmanuelle Dhiri (born 1965 in Brighton, England) is an English actress. She has also performed ballet, and contemporary and modern dance.", "link_mentions": [{"page": "This Life (1996 TV series)", "response": ["* Amita Dhiri as Djamila \"Milly\" Nassim"]}, {"page": "List of female movie actors by name: D", "response": ["*Amita Dhiri (born 1968)"]}, {"page": "The Last Train (TV series)", "response": ["|align=\"left\"|Amita Dhiri"]}, {"page": "List of people from Brighton and Hove", "response": ["*Amita Dhiri, actress, born in Brighton"]}, {"page": "List of The Bill characters", "response": ["The Bills roster of Detective Constables investigate crimes under the direction of their sergeants. Kevin Lloyd, as Alfred \"Tosh\" Lines, appeared in more episodes than any other DC, in 383 episodes between 1988 and 1998. In the series finale, \"Respect\", Amita Dhiri, Chris Simmons, Patrick Robinson, and Bruce Byron play Constables Dasari, Webb, Banks, and Perkins. Other notable Detective Constables include Eva Sharpe, played by Diane Parish, who departed in 2004 but went on to headline the second series of Murder Investigation Team in 2005, and Rae Baker as Juliet Becker, who departed the series in the 2003 live episode \"Fatal Consequences\". ", "| Grace Dasari || Amita Dhiri || 2007-2010 || style=\"text-align:center;\"|95 || D.C."]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Amita Dhiri"]}, {"page": "Amita Emmanuelle Dhiri", "response": ["#REDIRECT Amita Dhiri"]}, {"page": "Amita", "response": ["* Amita Dhiri (born 1966), English actress"]}, {"page": "Frontline (The Bill)", "response": ["* DC Grace Dasari - Amita Dhiri"]}, {"page": "I Love the '90s (British TV series)", "response": ["Presented by Amita Dhiri (from This Life).  Opening titles: \"Female of the Species\" by Space. Ending credits: \"Slight Return\" by The Bluetones."]}, {"page": "Second Generation (film)", "response": ["Estranged from her family for nine years, feisty, independent Heere (Parminder Nagra) is living with her white, music journalist fiancé, Jack (Danny Dyer). When her father, Sharma (Om Puri), falls into a coma, her older sisters, Pria (Rita Wolf) and Rina (Amita Dhiri), get back in touch.", "* Amita Dhiri as Rina Chatterjee"]}, {"page": "The Law (2002 film)", "response": ["The film was shot throughout the summer of 2000 and was originally slated for broadcast on 1 September 2000; however, for reasons unknown, the film was shelved and not rescheduled for broadcast until over 18 months later. The film starred Douglas Hodge as Detective Inspector Jack Raleigh; who is partnered with Junior Detective Constable Stephen Connor, played by Joe McFadden. Amita Dhiri, Sharon Duce, Barbara Flynn and William Gaminara are also credited amongst the main cast. The film gathered 5.42 million viewers. The film has never been released on VHS or DVD.", "* Amita Dhiri as Helen Galloway"]}, {"page": "Talking to the Dead (TV series)", "response": ["* Amita Dhiri as Mrs. Rattigan "]}, {"page": "Ragdoll (TV series)", "response": ["* Amita Dhiri as Deputy Commissioner Vanita"]}]}}