{"wiki_id": "http://www.wikidata.org/entity/Q47412343", "itemLabel": "Jackie Morris", "itemDescription": "UK writer and illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Jackie_Morris", "wikipedia_page": {"main": "Jackie Morris (born 1961) is a British writer and illustrator. She was shortlisted for the Kate Greenaway Medal in 2016 and won it in 2019 for her illustration of The Lost Words, voted the most beautiful book of 2016 by UK booksellers. She is a recipient of the Tir na n-Og Award for children's book Seal Children.", "link_mentions": [{"page": "Kate Greenaway Medal", "response": ["|Jackie Morris", "* Jackie Morris, Something About a Bear (Frances Lincoln)", "* Jackie Morris, The Lost Words (Hamish Hamilton), by Robert Macfarlane"]}, {"page": "British Book Awards", "response": ["* 2018 – The Lost Words by Robert Macfarlane and Jackie Morris — The Hate U Give - Angie Thomas (joint winners) "]}, {"page": "Robert Macfarlane (writer)", "response": ["With the artist Jackie Morris, Macfarlane published The Lost Words: A Spell Book in October 2017. The book became what the Guardian called 'a cultural phenomenon', winning Children's Book of the Year at the British Book Awards jointly with The Hate U Give by Angie Thomas. The \"lost\" words of the book's title are twenty of the names for everyday nature—from \"Acorn\" through to \"Wren\" by way of \"Bluebell\", \"Kingfisher\", \"Lark\" and \"Otter\"—that were controversially dropped from inclusion in the Oxford Junior Dictionary due to under-use by children. Grassroots campaigns sprang up to raise money to place copies of the book in every primary and special school in all of Scotland, half of England and a quarter of Wales.", "Most of Macfarlane's books have been jacketed with original work by the artist Stanley Donwood, known for his close association with the band Radiohead, exceptions include his book The Lost Words, for example, which was illustrated by Jackie Morris. Macfarlane also collaborated with Donwood and writer Dan Richards on Holloway, published in an edition of 277 by Quive-Smith Press in 2012, and a trade edition by Faber & Faber in May 2013, which became a Sunday Times best-seller."]}, {"page": "British Fantasy Award", "response": ["*Jackie Morris"]}, {"page": "Three hares", "response": ["*Jackie Morris water colour painter/illustrator/author and winner of the Kate Greenaway Medal and Tir na n-Og Award, Painting of three hares."]}, {"page": "East of the Sun and West of the Moon", "response": ["* East of the Sun, West of the Moon, 2013, written and illustrated by Jackie Morris"]}, {"page": "Kerry Andrew", "response": ["She performs alt-folk under the name You Are Wolf. Her debut album, Hawk to the Hunting Gone (2014, Stone Tape), explored British birds and folklore. Her second album, Keld (Firecrest, 2018) was awarded fRoots magazine's Editor's Choice! Album of the Year 2018 and chosen by the Guardian as a Top Ten Folk Album 2018. She has collaborated with Robert Macfarlane and Jackie Morris, setting texts from their book The Lost Words."]}, {"page": "Judy Dyble", "response": ["In May 2009, early review copies of the new album with Robert Fripp were sent out. Dyble's Myspace showed samplers of some of the album tracks, and directly from her, and from Tim Bowness's Burning Shed, signed numbered early release copies sold out very quickly. 27 August 2009 saw an intimate gig by Dyble at the 100 Club in London, supported by Tim Bowness, Alistair Murphy, and Simon Nicol, her first solo gig in London in over 40 years. Dutch label Tonefloat released a vinyl version of the album in 2010, and Dyble added additional vocals to the 2 November 2009 single release \"Every Sentimental Moment\" by UK rock band Kings Cross. Termo records in Norway announced a Scandinavian release in February 2010, with revised artwork by noted artist and children's illustrator Jackie Morris, and a bonus track from the album sessions \"Fragile\". This release was supported by promotional television appearances in Norway, notably on the breakfast show God morgen, Norge!. Two tracks were performed live, \"Jazzbirds\", and \"Grey October Day\". Dyble, Bowness, and Murphy also recorded an as yet unseen clip for the programme Lydverket.", "| November 2012 || Europe || 500 only, with Jackie Morrisa/w"]}, {"page": "Tir na n-Og Award", "response": ["* English-language: The Seal Children, Jackie Morris", "* English-language: Cities in the Sea, Siân Lewis & Jackie Morris"]}, {"page": "Morris (surname)", "response": ["* Jackie Morris (born 1961), British writer and illustrator"]}, {"page": "Seckou Keita", "response": ["Also in 2019, Keita was part of Spell Songs, which brought together folk musicians, and the artwork and text of Robert McFarlane's and Jackie Morris's children's book The Lost Words: A Spell Book; performances included the Hay International Literary Festival, with a followup concert hall tour planned for early 2022. "]}, {"page": "National Book Awards Children's Book of the Year", "response": ["* The Lost Words by Robert Macfarlane and Jackie Morris — The Hate U Give - Angie Thomas (joint winners) "]}, {"page": "James Mayhew", "response": ["Mayhew has published over 50 books. They include the Ella Bella Ballerina series, Miranda the Castaway, Boy, illustrations for the Mouse and Mole books (animated for BBC television, with the voices of Alan Bennett, Richard Briers and Imelda Staunton), Koshka's Tales (a collection of Russian Folk stories), Can you see a Little Bear?; Mrs Noah's Pockets (story by Jackie Morris) and Bubble and Squeak (with illustrations by Clara Vulliamy). Mayhew has had books published in Japan, China, Korea, Germany, France, Greece, Estonia, Spain, Catalonia, Scandinavia, Russia, Turkey, the US, and other countries. He has also written for television (Melody and Driver Dan's Story Train). In 2018 he illustrated the first in a series of books by BBC Radio 4 broadcaster Zeb Soanes, called Gaspard the Fox, about a real urban fox that visits the author in North London.https://www.graffeg.com/gaspard-fox-signs-three-book-deal/", "*Mrs Noah's Pockets (by Jackie Morris)", "*Can You See a Little Bear? (illustrated by Jackie Morris)", "*Starlight Sailor (illustrated by Jackie Morris)"]}, {"page": "Talking with Strangers", "response": ["The first UK pressing featured the artwork of 1960s psychedelic artist John Hurford and inner sleeve illustration by Koldo Barroso. This version is sold out and deleted as of December 2009. The second UK pressing (and subsequent releases feature the artwork and designs of Jackie Morris.", "| Jan 2010 || 2nd UK || 'Jackie Morris artwork'", "| November 2012 || Vinyl || reissue 500 only with Jackie Morris Artwork"]}, {"page": "James Burton (conductor)", "response": ["*The Lost Words (2019) Upper Voices & Orchestra (or Piano) 32] The Lost Words has 12 short movements which are settings of words from the award-winning 2017 book The Lost Words by Robert Macfarlane and Jackie Morris. Commissioned jointly by the Hallé Concerts Society and the Boston Symphony Orchestra, movements of the work were performed in 2019 by the Boston Symphony Orchestra and the Boston Symphony Children's Choir at the Tanglewood Festival, and by the Southbank Sinfonia and the National Youth Choir of Great Britain at the BBC Proms."]}, {"page": "David Gemmell Awards for Fantasy", "response": ["** Nominated: Jackie Morris and Stephen Raw for Assassin’s Fate by Robin Hobb"]}, {"page": "Wainwright Prize", "response": ["|  and Jackie Morris|||| ||"]}, {"page": "2017 in the United Kingdom", "response": ["*Robert Macfarlane and Jackie Morris' children's poetry book The Lost Words."]}, {"page": "2017 in literature", "response": ["*Robert Macfarlane (illustrated by Jackie Morris) – The Lost Words: A Spell Book (October, UK)"]}, {"page": "2017 in poetry", "response": ["* Robert Macfarlane, The Lost Words: A Spell Book (illustrated by Jackie Morris)"]}, {"page": "Books Are My Bag Readers' Awards", "response": ["| rowspan=\"6\" |Lost Words by Robert Macfarlane and Jackie Morris", "|Lost Words by Robert Macfarlane and Jackie Morris"]}, {"page": "Jack Morris (disambiguation)", "response": ["* Jackie Morris (born 1961), British writer and illustrator"]}]}}