{"wiki_id": "http://www.wikidata.org/entity/Q4746341", "itemLabel": "Amina Kamara", "itemDescription": "Miss West Africa 2008", "wikipedia_url": "https://en.wikipedia.org/wiki/Amina_Kamara", "wikipedia_page": {"main": "Amina Kamara (born 31 January 1987 in London, United Kingdom) was the first winner of the title Miss West Africa in 2008, where she represented Sierra Leone at the inaugural Miss West Africa pageant in London.Amina Kamara was born in London, England in 1987 to Sierra Leonean parents, Abass Alieu Kamara and Kadi Kamara\nShe grew up in North West London and attended school at Harlesden Primary School before moving on to Queens Park Community School in 1997. As tough as life in Harlesden was for ethnic minorities, Amina Kamara always looked up to her both her parents and especially her brother Alieu Kamara who was 10 years older. Alieu Kamara usually took the responsibility of looking after and advising Amina and her 2 sisters. She socialised well with her peers and took pride in the people of her neighbourhood, and still today she regularly visits.\nShe attended QPCS up to year 9 and then her parents decided to move to East London. Amina then attended a school in Chingford called Rush Croft School and finished her GCSEs there. Separated from her West African origins, her one great wish was to travel around the world and experience different cultures and meet all sorts of people, including being a strong part of the growth of her home country Sierra Leone.\nShe then moved on to Waltham Forest College where she began to study Tourism for 3 years and achieved an Advanced Vocational Certificate in Tourism. Highly influenced by her brother Alieu, Amina Kamara lived her young days as a tom boy, climbing over fences to play football and basketball with the guys, never knowing she would eventually one day become a beauty pageant winner of an African region where she would then explore her lifelong intent to travel the world.\nShe then attended the University of Kent to study a BA Hons in Tourism Management, where she learnt the importance of Tourism planning and development and managing tourism in countries. Amina's time at Kent was tough due to social differences amongst her peers. At this stage, feeling distant from her peers, Amina had to drop her tom boy lifestyle and began wearing dresses and make up. Although Amina's dream towards touring the world was coming closer and closer, she still faced much difficulties with her social life. Just as things began to pick up, she received a phone call from Alieu her brother, to inform her that he had travelled to America and he had been diagnosed due to a brain tumour.\nFear for his life made it difficult for Amina to keep focused at Uni, but he returned to London reassuring Amina not to worry about his conditions as everything would be ok. When he returned to America, Amina was soon to find out from her mum that he had died from an aggressive brain tumour. It took Amina roughly 3–4 months before she could get back to her studies motivated by his strong words and influences.\nSooner in life, Amina then also picked up an interest in modelling and engaged in various modelling activities before coming across an invite by Nana Tamakloe to participate in the first ever Miss West Africa beauty pageant.", "link_mentions": [{"page": "Miss West Africa", "response": ["| Amina Kamara"]}]}}