{"wiki_id": "http://www.wikidata.org/entity/Q47507956", "itemLabel": "Blanche Georgiana Vulliamy", "itemDescription": "English ceramic artist, painter, and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Blanche_Georgiana_Vulliamy", "wikipedia_page": {"main": "Blanche Georgiana Vulliamy (1869 – 4 August 1923) was an English ceramic artist, painter, and writer.\nHalf-Belgian, after training as a portrait artist Vulliamy worked mainly as a designer of art pottery and is best known for her work portraying bats, goblins, and other grotesque creatures. She was also a writer, and at least one of her plays was produced in London.", "link_mentions": [{"page": "Ipswich", "response": ["Actor and director Richard Ayoade, best known for his role as Maurice Moss in The IT Crowd, was brought up in Ipswich, as was the ceramic artist Blanche Georgiana Vulliamy.VULLIAMY, Blanche Georgina  (sic) at suffolkartists.co.uk, accessed 28 January 2018 Hugh Catchpole (OBE, CBE, Hilal-i-Imtiaz), a noted educationist with over 60 years of association with military schools and colleges in India and Pakistan, was born in Ipswich."]}, {"page": "Constance Markievicz", "response": ["Gore-Booth wished to train as a painter, to her family's dismay; in 1892, she went to study at the Slade School of Art in London, where she lived at the Alexandra House for Art Pupils, Kensington Gore, founded five years before by Sir Francis Cook, a wealthy great-uncle of Maud Gonne. One of her contemporaries there was Blanche Georgiana Vulliamy. It was at this time that Gore-Booth first became politically active and joined the National Union of Women's Suffrage Societies (NUWSS). Later she moved to Paris and enrolled at the prestigious Académie Julian where she met her future husband, Casimir Markievicz, an artist from a wealthy Polish family from Ukraine. Markievicz was known in Paris as Count Markievicz, a title that was the norm for large landowners in Poland at this time. When the Gore-Booth family enquired as to the validity of the title, they were informed through Pyotr Rachkovsky of the Russian Secret Police that he had taken the title \"without right\", and that there had never been a \"Count Markievicz\" in Poland."]}, {"page": "Christchurch Mansion", "response": ["*A collection of seventy-seven pastels by Blanche Georgiana Vulliamy of First World War searchlightsObscure Secure booklet (Colchester and Ipswich Museum Service, 2014) online at obscuresecureproject.files.wordpress.com, accessed 3 February 2018"]}, {"page": "Benjamin Lewis Vulliamy", "response": ["He was a great-uncle of the art potter Blanche Georgiana Vulliamy."]}, {"page": "Vulliamy family", "response": ["*****Blanche Georgiana Vulliamy (1869–1923)"]}, {"page": "Lewis Vulliamy", "response": ["He was a great-uncle of the art potter Blanche Georgiana Vulliamy."]}, {"page": "George John Vulliamy", "response": ["He was a cousin of the art potter Blanche Georgiana Vulliamy."]}, {"page": "Vulliamy", "response": ["*Blanche Georgiana Vulliamy (1869–1923), an English artist"]}, {"page": "Blanche Vulliamy", "response": ["#REDIRECT Blanche Georgiana Vulliamy"]}, {"page": "Torquay pottery", "response": ["Notable potters included Blanche Georgiana Vulliamy."]}]}}