{"wiki_id": "http://www.wikidata.org/entity/Q4758229", "itemLabel": "Andrew Pears", "itemDescription": "British barber and soap innovator", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Pears", "wikipedia_page": {"main": "Andrew Pears was a farmer's son from Cornwall, born around 1770, who invented transparent soap. He moved to London in 1789 from his home in Mevagissey, Cornwall, where he had trained as a barber.He opened a barber's shop in the then-fashionable residential area of Gerrard Street, Soho, and attracted the custom of many wealthy families. He noticed that the London upper classes cultivated a delicate white complexion whereas a tanned face was associated with the working class who toiled in the outdoors. Andrew Pears realised that there was a need for a gentle soap for these delicate complexions.\nAfter much trial and error he found a way of removing the impurities and refining the base soap before adding the delicate perfume of garden flowers. His product was a high-quality soap, and had the additional benefit of being transparent. Soap refined in this way is transparent and makes longer-lasting bubbles. The transparency was the unique product plus that established the image of Pears soap. His method of mellowing and ageing each long-lasting Pears Bar, for over two months, is still used today where natural oils and pure glycerine are combined with the delicate fragrance of rosemary, cedar and thyme.\nIn 1835 he took on a partner, his grandson Francis Pears, and they moved to new premises at 55 Wells Street, just off Oxford Street.\nAndrew Pears retired from business in 1838, leaving his grandson, Francis, to continue the business of the London-based firm of A & F Pears. He died in 1845.\nHis great great grandson, Thomas Clinton Pears (1882–1912), was travelling First Class aboard RMS Titanic on the ship's maiden voyage from England to New York in April, 1912 with his wife, Edith Ann (Wearne) Pears (1889–1956). Thomas was lost, while Edith was rescued.", "link_mentions": {}}}