{"wiki_id": "http://www.wikidata.org/entity/Q4757149", "itemLabel": "Andrew Graham", "itemDescription": "Bishop of Newcastle; Bishop of Bedford (born 1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alec_Graham", "wikipedia_page": {"main": "Andrew Alexander Kenny Graham (7 August 1929 – 9 May 2021) was an English Anglican bishop.Graham was educated at Tonbridge School and St John's College, Oxford. After studies at Ely Theological College he was ordained in 1956. He was ordained in the Church of England: made a deacon on Trinity Sunday 1955 (5 June)\n and ordained a priest the Trinity following (27 May 1956), both times by George Bell, Bishop of Chichester, at Chichester Cathedral. His first post was as a curate at Hove from where he moved to be a lecturer at Worcester College, Oxford. After time as warden of Lincoln Theological College he was appointed the Bishop of Bedford in 1977. He was consecrated a bishop on 31 March 1977, by Donald Coggan, Archbishop of Canterbury at Westminster Abbey.With his nomination on 21 May and confirmation on 29 June 1981, he was translated to Bishop of Newcastle where he stayed for sixteen years. In retirement he was an honorary assistant bishop in the Diocese of Carlisle.\nGraham died at his home in Butterwick, on 9 May 2021, at the age of 91.\n\n", "link_mentions": [{"page": "Andrew Graham", "response": ["Andrew Graham may refer to:", "* Andrew Graham (economist) (born 1942), English academic", "* Andrew Graham (astronomer) (1815–1908), Irish astronomer", "* Andrew Graham (naturalist) (1730s–1815), Scottish scientist", "* Andrew Graham (baseball) (born 1982), Australian baseball player", "* Andrew Graham (bishop of Dunblane), Bishop of Dunblane between 1573/1575 and 1603", "* Sir Andrew Graham, 5th Baronet (born 1956), British general", "* Andrew Graham (politician) (1843–1926), New Zealand politician", "* Andrew Graham (Australian footballer) (born 1963), former Australian rules footballer", "* Andrew Graham, a character in Mobile Fighter G Gundam", "* Andrew Graham-Yooll (1944–2019), author", "* Andrew Graham-Dixon (born 1960), British art historian"]}]}}