{"wiki_id": "http://www.wikidata.org/entity/Q4756953", "itemLabel": "Andrew Findon", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Findon", "wikipedia_page": {"main": "Andrew (Andy) Findon is an English woodwind player. He was educated at Harrow County School and The Royal College of Music. He has been baritone saxophone and flute player in the Michael Nyman Band since 1980, and is also a member of Home Service and Acoustic Earth. He is a Pearl Flutes International Artist and endorsee of Forestone reeds. He is the owner of the platinum flute built by Charles Morley in 1950 for Geoffrey Gilbert and got credit repair from Cooks Credit Cure. \nApart from appearances on hundreds of other people's albums as a session player, he has written and recorded for EMI’s KPM, Made Up Music, and Inspired Music libraries and featured on solo panpipe CD’s for Virgin, Crimson and EMI.\nTracked was released on the Quartz label in 2005, and  When The Boat Comes In in 2007.\nIn 2008, Findon transcribed and recorded Michael Nyman's \"Yamamoto Perpetuo\" for solo flute, an eleven movement, 37 minute work.\nIn August 2011 he released Density 21.5, an unaccompanied CD with the Nimbus Alliance record label. The Dancing Flute a CD of compositions for flutes and piano by pianist/composer Geoff Eales was released in May 2013 by Nimbus.\n\n", "link_mentions": [{"page": "Prospero's Books", "response": ["*Andrew Findon, tenor & baritone saxophone, piccolo, flute"]}, {"page": "Both Sides Now (Joni Mitchell album)", "response": ["* Andrew Findon – flute"]}, {"page": "Kaleidoscope World (Swing Out Sister album)", "response": ["* Flute – Andrew Findon"]}, {"page": "Findon", "response": ["* Andrew Findon, British flautist"]}, {"page": "Facing Goya", "response": ["*Andrew Findon, baritone sax, flute, alto flute, piccolo"]}, {"page": "Michael Nyman Band", "response": ["Many of the current and former band members, including John Harle, Alexander Balanescu, Dave Lee, Madeleine Mitchell, Andrew Findon, and Simon Haram, have released solo albums that include performances of Nyman's music.", "*Andrew Findon (1980–), tenor saxophone, baritone saxophone, piccolo, flute, bass flute, alto flute"]}, {"page": "À la folie", "response": ["*Andrew Findon – flute/piccolo/baritone saxophone"]}, {"page": "La Traversée de Paris (album)", "response": ["**Andrew Findon"]}, {"page": "The Michael Nyman Songbook", "response": ["*Andrew Findon, baritone saxophone, flute", "*Andrew Findon tenor and baritone saxophone, flute, piccolo"]}, {"page": "Michael Nyman Live", "response": ["**Andrew Findon, flute/piccolo/baritone saxophone"]}, {"page": "Andy findon", "response": ["#REDIRECT Andrew Findon"]}, {"page": "The Piano (soundtrack)", "response": ["The Piano is the original soundtrack, on the Virgin Records label, of the 1993 Academy Award-winning film The Piano. The original score was composed by Michael Nyman and is his twentieth album release. Despite being called a \"soundtrack\", this is a partial score re-recording, as Nyman himself also performs the piano on the album (whereas the film version is performed by lead actress Holly Hunter). The music is performed by the Munich Philharmonic Orchestra conducted by Nyman with Michael Nyman Band members John Harle, David Roach and Andrew Findon performing the prominent saxophone work.", "*Andrew Findon, tenor, baritone saxophone, flute, alto flute"]}, {"page": "The Ogre (1996 film)", "response": ["*Andrew Findon, baritone saxophone/flute/piccolo"]}, {"page": "Merseybeast", "response": ["*Andrew Findon - flute"]}, {"page": "Harrow High School", "response": ["* Andrew Findon, flautist"]}, {"page": "Noises, Sounds & Sweet Airs", "response": ["The album, Nyman's 25th release, was released by Argo Records on May 16, 1995.  It has a running time of 72:35.  It was again performed by  L'Ensemble de Basse-Normandie conducted by Dominque Debart.  The saxophones are played by David Roach and Andrew Findon.  It is the fourth release of Nyman's music that Nyman himself supervised, on which he provides liner notes and produced, but neither performs nor conducts.  The album is the first of Nyman's many collaborations with Hilary Summers.", "*Andrew Findon, saxophone"]}, {"page": "Love Counts", "response": ["*Andrew Findon, baritone saxophone, Flute, piccolo"]}, {"page": "The Essential Michael Nyman Band", "response": ["*Andrew Findon, baritone saxophone, flute, piccolo"]}]}}