{"wiki_id": "http://www.wikidata.org/entity/Q4756252", "itemLabel": "Andrew Baggaley", "itemDescription": "British table tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Baggaley", "wikipedia_page": {"main": "Andrew Baggaley (born 26 February 1983) is a professional table tennis player from Milton Keynes. He is England's leading table tennis medal winner of all time in the Commonwealth Games, winning two gold medals in Manchester, England (2002), 1 silver medal in Melbourne, Australia (2006), 1 silver and 1 bronze medal in Delhi, India (2010) and 1 silver in Glasgow, Great Britain.He is also World Champion 2015 of Ping Pong, after beating reigning champion Maxim Shmyrev in the semi-final and Alexander Fleming in the final. He also won the World Championship of Ping Pong in 2016, 2019, beating three previous champions on his way to the trophy, and 2020.\nBaggaley was born in Northampton. He started playing the sport with his mother Yvonne in the back garden of the family home in Milton Keynes in the Summer of 1987 aged 4 and has been coached almost exclusively by his brother Stephen Baggaley throughout his career.\nHe is a triple English Men’s Singles National Champion by winning the senior title in Sheffield in 2002, 2008 and 2010.At the time, his 2002 victory aged just 19 was the youngest winner of the Men’s Singles National Title for 40 years and he is still only one of 3 teenage winners of the title.\nHe also became the youngest ever British Men’s Singles Champion aged 15 when he won the British Home Countries Title in Oban, Scotland (1998).\nAndrew Baggaley became Britain’s youngest ever professional table tennis player by signing terms to play for Brussels-based Belgian National League team TTC Logis Auderghem aged 13 (1996). He has subsequently played in national leagues across Europe including Germany, Sweden and Spain.\nAndrew Baggaley made his England Junior International début aged 12 in the European Cadet (Under 14) Six Nations Championships in Soham (1995), and went on to win European Youth Medals at both Cadet and Junior (Under 17) categories; England’s first medals at these prestigious events for almost a decade alongside the likes of David Melder.\nHe made his England Senior International début at the French Open in 1997 aged 14 and also represented England at the 44th World Table Tennis Championships in Manchester, England later that year.\nBaggaley has won 23 English National Junior titles and has been ranked England number 1 in every age group (Under 10,11,12,14,17,21) culminating in becoming England number 1 senior aged 20 (2003), the youngest at the time for 20 years.\nBaggaley has defeated many world-class players from both Europe and Asia including victories over Peter Karlsson (Sweden) and Jean-Michel Saive (Belgium) both former European Singles Champion, Chiang Peng-Lung (Chinese Taipei) the former Asian Singles Champion, Gao Ning (Singapore) the Asian Cup champion and Jörgen Persson (Sweden) the 1991 World Champion.\nIn November 2011 Andrew Baggaley officially became the highest-ranked British player on the ITTF ranking list with a World Ranking of 142.Andrew Baggaley was the Table Tennis motion capture actor for the Xbox 360 game Kinect Sports.He was a Bid Ambassador for the London 2012 Olympics where he was selected to play in the Team GB Table Tennis team.", "link_mentions": [{"page": "Milton Keynes", "response": ["* Andrew Baggaley, English table tennis champion"]}, {"page": "Milton Keynes Dons F.C.", "response": ["Other notable fans who are either Dons fans or regularly attend games are: Gabi Downs, Paralympic fencer; Andrew Baggaley, table tennis Commonwealth Games double gold medallist; Gail Emms, badminton world champion; James Hildreth and James Foster both England cricketers; Mark Lancaster, local member of parliament and government minister in 2012; Craig Pickering, 100m sprinter – bronze medal at the World Championship in 2007; Craig Gibbons, London 2012 Olympic 100 metre swimmer; Mikey Burrows, Sky Sports Radio presenter; and the late musician and radio broadcaster George Webley."]}, {"page": "England at the 2002 Commonwealth Games", "response": [":Andrew Baggaley & Gareth Herbert, men's doubles", ":Andrew Baggaley, Alex Parry, Matthew Syed, Terry Young & Gareth Herbert, men's team"]}, {"page": "England at the 2006 Commonwealth Games", "response": [":Andrew Baggaley & Andrew Rushton, Men's Doubles", "* Andrew Baggaley", "|align=\"center\"|Andrew Baggaley 3–0Moses Kamau", "|align=\"center\"|Andrew Baggaley 3–0Stephen Jenkins", "|align=\"center\"|Andrew Baggaley 3–1Kashif Razzaq", "|align=\"center\"|Andrew Baggaley 3–0Pitiyage Silva", "|align=\"center\"|Andrew Baggaley 3–0Alan Resture", "|align=\"center\"|Andrew Baggaley 1–3Sequn Toriola", "|align=\"center\"|Andrew Baggaley 3–1Faazil Kassam", "|align=\"center\"|Andrew Baggaley 3–1Trevor Brown"]}, {"page": "1983 in the United Kingdom", "response": ["* 26 February – Andrew Baggaley, English table tennis player "]}, {"page": "England at the 2010 Commonwealth Games", "response": ["|  || England Andrew Baggaley Paul Drinkhall Darius Knight Liam PitchfordDaniel Reed || Table tennis || Men's team || 9 October", "|  || Andrew BaggaleyLiam Pitchford|| Table tennis || Men's doubles || 13 October"]}, {"page": "Baggaley", "response": ["*Andrew Baggaley, an English table-tennis player"]}, {"page": "Table tennis at the 2010 Commonwealth Games", "response": ["Andrew BaggaleyPaul DrinkhallDarius KnightLiam PitchfordDaniel Reed"]}, {"page": "English National Table Tennis Championships", "response": ["| 2009/10||Andrew Baggaley||Joanna Parker||Gavin Evans  Liam Pitchford||Joanna Parker  Kelly Sibley||Paul Drinkhall  Joanna Parker", "| 2007/08||Andrew Baggaley||Kelly Sibley||Paul Drinkhall  Darius Knight||Kelly Sibley  Joanna Parker||Paul Drinkhall  Joanna Parker", "| 2001/02||Andrew Baggaley||Nicola Deaton||Andrew Baggaley  Gareth Herbert||Nicola Deaton  Helen Lower||Alex Perry  Helen Lower", "| 1999/00|| Andrew Baggaley||Georgina Walker", "| 31||Andrew Baggaley||Male||3||1||0||4"]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["| style=\"text-align:left;\" | Andrew BaggaleyPaul DrinkhallLiam Pitchford"]}, {"page": "October 2010 in sports", "response": ["***Men's doubles:  Sharath Kamal/Subhajit Saha   Gao Ning/Yang Zi   Andrew Baggaley/Liam Pitchford "]}, {"page": "World Championship of Ping Pong", "response": ["The World Championship of Ping Pong, also known as WCPP, is an annual ping pong tournament that has been held since 2011. The current champion is Andrew Baggaley, who beat Alexander Flemming in the 2020 final to beat Maxim Shmyrev's record of winning three championships, and become the record-breaking four-time champion.", "| 2015 Chris Osborne, \"Ping pong: Andrew Baggaley practised for a month to win $20k\", BBC, 28 January 2015.", "|  Andrew Baggaley ", "| 2016 Phil Shepka, \"Andrew Baggaley: UK's least well-known world champion?\", BBC, 27 January 2016.", "|  Andrew Baggaley ", "| Andrew Baggaley", "|  Andrew Baggaley "]}, {"page": "Table tennis at the 2012 Summer Olympics – Men's team", "response": ["|Paul Drinkhall (107)||Andrew Baggaley (133)||Liam Pitchford (143)"]}, {"page": "Maxim Shmyrev", "response": ["In February 2011, he participated in an inaugural World Championship of Ping Pong held in Las Vegas, USA. In the final match he defeated Ernesto Ebuen from Philippines 3–1. Then in 2012 he was once again selected (as part of the Russian team) to play at the second worlds championship  held in London, UK. He went undefeated again, winning his very tough final match vs Sule Olaleye from Nigeria with the score of 3–2. In January 2014 he easily defeated 3-0 Ilija Lupulesku (United States) in the final of the third WCPP. However, in the fourth WCPP held at the same location in January 2015 he lost his semifinal match to the eventual winner Andrew Baggaley."]}, {"page": "England at the 2010 Commonwealth Games (S–Z)", "response": ["|Andrew Baggaley (9)", "|Andrew Baggaley &Liam Pitchford", "Andrew Baggaley, Paul Drinkhall, Darius Knight, Liam Pitchford, Daniel Reed"]}, {"page": "England at the 2014 Commonwealth Games", "response": ["|align=left|Andrew Baggaley", "|align=left|Andrew BaggaleyPaul DrinkhallLiam PitchfordDaniel ReedSam Walker"]}, {"page": "Table tennis at the 2014 Commonwealth Games", "response": ["Andrew BaggaleyPaul DrinkhallLiam PitchfordDaniel ReedSam Walker"]}]}}