{"wiki_id": "http://www.wikidata.org/entity/Q4758751", "itemLabel": "Andrew Toovey", "itemDescription": "British composer (b. 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Toovey", "wikipedia_page": {"main": "Dr Andrew Toovey (born 1962, in London) is a classical composer, and recipient of composition awards including the Tippett Prize, Terra Nova Prize, the Bernard Shore Viola Composition Award and an RVW Trust Award. Two portrait CDs of his music were released on the Largo label in 1998, and many individual pieces are represented on others CD labels including NMC. His music is partially published by Boosey and Hawkes, and most of his output is available to view on YouTube on his own channel. There is an comprehensive website (www.andrewtoovey.co.uk) where all of Toovey's music can be seen in PDF format with a complete worklist, timeline outlining events of each year and performance list. He has worked extensively on education projects for Glyndebourne Opera, English National Opera, Huddersfield Festival, the South Bank Centre and the London Festival Orchestra, and has been composer-in-residence at Opera Factory and the South Bank Summer School. He is now a full-time composer, but used to teach part-time at Bishop Ramsey School, Ruislip, Middlesex and Alperton Community School in Wembley. He currently teaches composition at the Royal Birmingham Conservatoire part of BCU.\nToovey consciously places himself outside what he regards as useless or outmoded conventions, whilst reserving the right to draw on, allude to, shoplift from absolutely anywhere. Not only are Toovey’s musical sympathies unusually diverse and deliberately unaligned to the readymade categories of our recent past (minimalism, neo-Romanticism, new complexity), but the fundamental stylistic “gesture” can be as readily compared to the visual arts as to any music - to the work of Robert Motherwell, Barnett Newman, Robert Rauschenberg or Stanley Hayter.\nAndrew Toovey studied composition with Jonathan Harvey, Michael Finnissy and briefly with Morton Feldman. After completing his BMus(hons)  music degree at the University of Surrey he went on to take both an MA and MPhil at the University of Sussex, specialising in both composition and aesthetics. He also did a secondary school PGCE at the institute of Education  at London University and a PhD at Birmingham City University. \nToovey was associate composer for the Young Concert Artists Trust (YCAT) from 1993-5 and has been the artistic director of the new music ensemble IXION since 1987. Extensive archive website at www.ixionensemble.co.uk. He was composer-in-residence at the Banff Centre, Canada for four successive years with his Ubu opera and music theatre work The spurt of blood. He has worked extensively on education projects for Glyndebourne Opera, English National Opera, Huddersfield Festival, the South Bank Centre and the London Festival Orchestra, and has been composer-in-residence at Opera Factory and the South Bank Summer School.\nToovey's works have been performed throughout the UK, Europe, Canada, Japan, China, Australia, New Zealand and the USA. His works have also been featured at the Bergen, Brighton, Gaudeamus, Huddersfield and ISCM festivals and the Darmstadt and Dartington International Summer School. His music has been frequently broadcast on BBC Radio 3 and various European radio stations.\nToovey's work embraces a huge diversity of influences, from musical extremes such as Feldman and Finnissy, or the poetry of Artaud, Cummings and Rilke, to a passion for 20th-century art - especially that by Bacon, Beuys, Davies, Hayter, Klee, Miro, Newman, Rauschenberg, Riley, Rothko and many more.\nRecent commissions have included Music for the Painter Jack Smith (Brighton Festival), Dutch Dykes (De Ereprijs), Self-portrait as a Tiger! and Wenke (Ensemble Reconsil Wein), Going Home (Szymanowski String Quartet). He was commissioned by the BBC to write a viola concerto, premiered by Lawrence Power and the BBC Scottish Symphony Orchestra in Glasgow. He also composed a half-hour orchestral suite based on music from his first opera UBU also for the BBC conducted by IIan Volkov. Longer terms compositions include an opera 'Narrow Rooms' based on a novel by James Purdy to a libretto by Michael Finnissy and a collection of poetry settings for voice/violin (or viola) as well as a range of compositions for chamber ensemble and solo instruments. \nOther commissions have included Acrobats, for CoMA, mini opera I'll be there for you, commissioned by English Touring Opera, solo violin work Transparencies written for an exhibition of artist Julian Grater, and Noh for solo cello written for sculptor John Davies.", "link_mentions": [{"page": "Ubu Roi", "response": ["The play was adapted into an opera, with libretto by Michael Finnissy and Andrew Toovey and music by Toovey. It was produced by the Banff Centre Theatre, Canada, in collaboration with Music Theatre Wales, in May 1992, directed by Keith Turnbull."]}, {"page": "Music Theatre Wales", "response": ["* Ubu Andrew Toovey and Michael Finnissy (commission 1992)"]}, {"page": "Toovey", "response": ["*Andrew Toovey (born 1962), English composer"]}, {"page": "Andrew toovey", "response": ["#REDIRECT Andrew Toovey "]}, {"page": "Robert Chevara", "response": ["For Opera, his productions include West End Girl (a new version of Puccini's La Fanciulla del West, King's Head Theatre); Albert Herring (Britten, Copenhagen Opera House); La Voix Humaine (Cocteau/Poulenc, Stockholm Opera House, awarded Best Contemporary Opera production in Sweden); Powder Her Face (Thomas Adès, Ystad Opera, awarded Best Contemporary Opera Production in Sweden); Potent Shakespeare (Andrew Toovey, Festival Hall, London); Pascal Dusapin's To Be Sung (world premiere, Banff Centre); Puccini's Madama Butterfly (New Zealand Opera); Stravinsky's The Rake's Progress, Bizet's Carmen, Verdi's Macbeth, Beethoven's Fidelio, Massenet's Werther (all English Touring Opera); Barber's A Hand of Bridge; Gershwin's Blue Monday; and Bernstein's Trouble in Tahiti (all Barbican Centre, designed by Chevara); Mozart's Magic Flute (Holland Park Opera, London); Dvořák's The Cunning Peasant; Poulenc's Les Dialogue des Carmélites; and Britten's Albert Herring (all Guildhall School of Music and Drama; Mozart's Idomeneo, Rossini's La Cenerentola and Britten's A Midsummer Night's Dream (all Copenhagen Opera Academy); Prokofiev's The Fiery Angel (Royal Opera House, Associate Director with David Freeman); Rossini's The Barber of Seville (Dublin Grand Opera); Maderna's Satyricon (Opera Factory/The Drill Hall, London); as well as numerous operas by Rameau, Haydn, Verdi, Bizet, Rossini, Handel, Donizetti (all Royal Academy of Music and Royal College of Music)"]}, {"page": "Toovey, Andrew", "response": ["#redirectAndrew Toovey"]}]}}