{"wiki_id": "http://www.wikidata.org/entity/Q4756366", "itemLabel": "Andrew Blain Baird", "itemDescription": "Scottish aviator", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Blain_Baird", "wikipedia_page": {"main": "Andrew Blain Baird (1 January 1862 – 9 September 1951) was a Scottish blacksmith and aviation pioneer.", "link_mentions": [{"page": "1910 in aviation", "response": ["* 17 September – Andrew Blain Baird makes the first powered monoplane flight in Scotland, at Ettrick Bay on the Isle of Bute in a self-built machine."]}, {"page": "1951 in Scotland", "response": ["* 9 September – Andrew Blain Baird, engineer and aviation pioneer (born 1862)"]}, {"page": "1910 in Scotland", "response": ["* 17 September – Andrew Blain Baird makes the first powered monoplane flight in Scotland, at Ettrick Bay on the Isle of Bute in a self-built machine."]}, {"page": "1862 in Scotland", "response": ["* 1 January – Andrew Blain Baird, engineer and aviation pioneer (died 1951)"]}, {"page": "Christopher Richard Markwell", "response": ["The Baird of Bute Society was established in 2011 by Christopher Markwell, who now in retirement, lives part of the year in Bute. Markwell was instrumental in bringing Andrew Blain Baird to the fore for the centenary of his historic flight and arranged all of the events of the centenary and most since."]}, {"page": "Baird of Bute Society", "response": ["The Baird of Bute Society recognizes and promotes the historical achievements of Andrew Blain Baird, the Bute blacksmith who on 17 September 1910, at Ettrick Bay on Bute, flew a plane of his own design and manufacture to record the First All-Scottish Heavier-than-air Powered Flight.", "The Baird of Bute Society is focused on the advancement of education and information related to Andrew Blain Baird and his aviation and entrepreneurial activity and uses his inspirational example to inspire the youth of Scotland to aspire to greatness in their own lives. The Society strongly participates in the advancement of the arts, heritage, culture and science on the Isle of Bute and beyond.", "| 150th anniversary of the birth of Andrew Blain Baird"]}, {"page": "Andrew Baird", "response": ["* Andrew Blain Baird (1862–1951), Scottish blacksmith and aviation pioneer"]}]}}