{"wiki_id": "http://www.wikidata.org/entity/Q4756645", "itemLabel": "Andrew Collins", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Collins_(actor)", "wikipedia_page": {"main": "Andrew Collins is a British actor, best known for playing recurring character Jarrett Maxwell in the CBS soap opera The Bold and the Beautiful as well as appearing in Parenthood, The Newsroom and Gilmore Girls.\nHe is a regular performer in Big Finish Productions, where he stars as Barnabas Collins in the Dark Shadows audio dramas, various characters in Doctor Who, Gallifrey, Earthsearch, and Stargate SG-1.In the UK, his stage name is Andy Coleman.", "link_mentions": [{"page": "Dark Shadows", "response": ["In 2006, Big Finish Productions continued the Dark Shadows saga with an original series of audio dramas, starring the original cast. The first season featured David Selby (Quentin Collins), Lara Parker (Angelique), Kathryn Leigh Scott (Maggie Evans), and John Karlen (Willie Loomis). Robert Rodan, who played Adam in the original series, also appears in the fourth story, playing a new character. Barnabas Collins is played by Andrew Collins. A second series was released in 2010. In addition to the cast's returning from Series One, Kingdom of the Dead also featured Lysette Anthony, Alec Newman, Lizzie Hopley, Jerry Lacy, and David Warner."]}, {"page": "Barnabas Collins", "response": ["In the 1991 NBC revival version of Dark Shadows, British actor Ben Cross played the role of Barnabas Collins. Alec Newman played the part in the unreleased 2004 pilot film. In the recent series of audio dramas produced by Big Finish Productions, he is portrayed by Andrew Collins, while Frid returned to portray the role a final time in The Night Whispers. The role is played by Johnny Depp in director Tim Burton's 2012 film, Dark Shadows."]}, {"page": "Andrew Collins", "response": ["Andrew Collins may refer to:", "* Andrew Collins (actor) (born 1973), British actor", "* Andrew Collins (broadcaster) (born 1965), British journalist, scriptwriter, and broadcaster", "* Andrew Collins (cricketer) (1972–1999), British cricketer", "* Andrew Collins (footballer, born 1965), former Australian rules footballer for Hawthorn", "* Andrew Collins (footballer, born 1988), former Australian rules footballer for Carlton", "* Andrew Collins (judge) (born 1942), English barrister and judge", "* Andrew Collins (politician), American politician in Arkansas"]}, {"page": "Collins (surname)", "response": ["**Andrew Collins (judge) (born 1942), English barrister and judge", "**Andrew Collins (footballer born 1965), former Australian rules player for Hawthorn", "**Andrew Collins (broadcaster) (born 1965), British journalist, scriptwriter and broadcaster", "**Andrew Collins (cricketer) (1972–1999), English cricketer", "**Andrew Collins (actor) (born 1973), British actor", "**Andrew Collins (footballer born 1988), current Australian rules player for Carlton", "**Kevin Andrew Collins (born 1974), child abducted from San Francisco in 1984"]}, {"page": "List of The Bold and the Beautiful cast members", "response": ["! scope=\"row\"| Andrew Collins"]}, {"page": "List of The Bold and the Beautiful characters", "response": [":Andrew Collins (2004–)"]}, {"page": "Dark Shadows: The House of Despair", "response": ["*Mr Strix – Andrew Collins"]}, {"page": "Dark Shadows: The Book of Temptation", "response": ["*Barnabas Collins – Andrew Collins"]}, {"page": "Dark Shadows: The Christmas Presence", "response": ["*Barnabas Collins – Andrew Collins"]}, {"page": "Dark Shadows: The Rage Beneath", "response": ["*Barnabas Collins – Andrew Collins"]}, {"page": "Angelique's Descent", "response": ["*The Dark Lord – Andrew Collins"]}, {"page": "Dark Shadows: Kingdom of the Dead", "response": ["*Andrew Collins – Barnabas Collins"]}, {"page": "Badults", "response": ["The series was developed under the working title The Secret Dude Society.Badults on the BBC Media Centre Andrew Collins was Script Editor."]}, {"page": "List of The Bold and the Beautiful characters (2017)", "response": ["Sally is called by her great aunt, the original Sally Spectra to save the old Spectra building and revive Spectra Fashions. Sally begins building a social media presence by pulling hamulating stunts at Steffy Forrester's (Jacqueline MacInnes Wood) expense to garner free publicity and media attention for Spectra Fashions. She invites Eye on Fashion reporter Jarrett Maxwell (Andrew Collins) who works for Spencers Publications to a early preview of Spectra Fashions. Maxwell takes a liking to Sally's designs angering his boss Bill Spencer. Bill writes a disparaging article against Sally and Spectra Fashions while using Maxwell's name on the article, in a attempt to destroy the business and quickly push through the sale of the old Spectra building. "]}]}}