{"wiki_id": "http://www.wikidata.org/entity/Q4758589", "itemLabel": "Andrew Sinclair", "itemDescription": "British surgeon, botanist, New Zealand Colonial Secretary and scientific collector (1794-1861)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Sinclair_(botanist)", "wikipedia_page": {"main": "Andrew Sinclair (13 April 1794 – 26 March 1861) was a British surgeon who was notable for his botanical collections. He served as New Zealand's second Colonial Secretary.", "link_mentions": [{"page": "Meryta sinclairii", "response": ["Puka first came to European attention when William Colenso found a single tree growing at the head of Whangaruru Bay in Northland (on the New Zealand mainland). This tree was protected by a fence, and declared sacred by Māori, who told Colenso that they had brought the tree from the Poor Knights Islands. Colenso made frequent visits to Whangaruru Bay over several years in the vain hope of procuring flowers and fruit. Colenso pointed out the tree to Dr Andrew Sinclair, (1794–1861), Colonial Secretary and naturalist, for whom the tree would eventually be named. Colenso and Sinclair sent specimens of the foliage to Kew. Later William Mair found the tree, and he eventually succeeded in procuring specimens of the leaves and fruit, which were forwarded to Dr Joseph Hooker at Kew. From these specimens the original description of the tree was made under the name Botryodendrum sinclairii.Kirk 1869", "* Biography of Andrew Sinclair, from An Encyclopaedia of New Zealand, edited by A. H. McLintock, originally published in 1966. Te Ara - The Encyclopedia of New Zealand, updated 26 September 2006. URL:SINCLAIR, Andrew"]}, {"page": "Ministers in the New Zealand Government", "response": ["Originally, the Executive Council functioned as an advisory group to the Governor, and ministerial functions were performed by appointed officials, not politicians. The various \"ministers\" serving on the Council, such as the Colonial Secretary (Andrew Sinclair since 1844) and the Colonial Treasurer (Alexander Shepherd since 1842), reported to the Governor. When Parliament was established, however, many believed that they would soon replace these appointed officials, with ministerial positions being given to members of Parliament instead. The Acting Governor, Robert Wynyard, did not agree, however, saying that the levers of government could not be turned over to Parliament without approval from Britain. The issue was controversial, and ended with the Acting Governor attempting (with only partial success) to suspend the 1st New Zealand Parliament."]}, {"page": "List of botanists by author abbreviation (A)", "response": ["* A.Sinclair – Andrew Sinclair (1796–1861)"]}, {"page": "Thomas Gillies", "response": ["He died in his Auckland home, after being \"seized with apoplexy\". Gillies's first wife, Catherine, died in 1865); he married secondly, in 1867, Agnes (d. 1884), daughter of John Sinclair, of Glasgow, niece of Andrew Sinclair, second Colonial Secretary of New Zealand, and sister-in-law of David Bruce. He had six children altogether from both marriages.Debrett's House of Commons and the Judicial Bench, ed. R. H. Mair, Debrett's, 1885, p. 419"]}, {"page": "1861 in New Zealand", "response": ["* 26 March: Andrew Sinclair, British surgeon notable for his botanical collections"]}, {"page": "Colonial Secretary of New Zealand", "response": ["| Andrew SinclairSINCLAIR, Andrew – 1966 Encyclopaedia of New Zealand"]}, {"page": "Epyaxa lucidata", "response": ["This species was first described by Francis Walker in 1862 using material collected by Andrew Sinclair and named Larentia lucidata. The holotype specimen is held at the Natural History Museum, London."]}, {"page": "1856 Sewell Ministry", "response": ["Previously, the Executive Council had functioned as an advisory group to the Governor, and ministerial functions were performed by appointed officials, not politicians. The various \"ministers\" serving on the Council, such as Andrew Sinclair (Colonial Secretary since 1844) and Alexander Shepherd (Colonial Treasurer since 1842), retired from their roles."]}, {"page": "List of New Zealand governments", "response": ["The New Zealand Constitution Act 1852 was an Act of the Parliament of the United Kingdom and was the second enactment to grant the colony of New Zealand self-government. The first elections for a New Zealand House of Representatives were held during 1853, and this lower house met for the first time in 1854 in Auckland. In practice, the country was initially governed by the Governor, George Grey, with the advice of the Civil Secretary and some officials that were appointed back in 1840/41, namely Andrew Sinclair (Colonial Secretary), William Swainson (Attorney-General), and Alexander Shepherd (Colonial Treasurer)."]}, {"page": "A.Sinclair", "response": ["#REDIRECT Andrew Sinclair (botanist)"]}, {"page": "David Bruce (minister)", "response": ["In Auckland in 1859, Bruce married Mary Alexander Sinclair, daughter of John Sinclair, of Glasgow, and niece of Andrew Sinclair, second Colonial Secretary of New Zealand. Her sister, Agnes, was the wife of the lawyer, judge, and politician Thomas Gillies.Debrett's House of Commons and the Judicial Bench, ed. R. H. Mair, Debrett's, 1885, p. 419Ewing's Annals of the Free Church, reproduced at http://ecclegen.com- URL: http://ecclegen.com/ministers-b Date Retrieved 6 September 2017 She died in Scotland in 1870. They had three sons and four daughters. Their eldest daughter, Agnes (\"Essie\") married the physician and writer Sir H. E. B. Bruce-Porter;Armorial Families, seventh edition, A. C. Fox-Davies, Hurst & Blackett Ltd, 1929, p. 245Dod's Peerage, Baronetage and Knightage of Great Britain and Ireland, Including All the Titled Classes, Charles Roger Dod, Robert Phipps Dod, 1921, p. 697"]}, {"page": "Mathew Richmond", "response": ["Richmond was further promoted to become Superintendent in early 1844. The Southern District was the area to the south of Cape Egmont. In his role, he was only responsible to the Governor (first Robert FitzRoy and then George Grey) and the Colonial Secretary (Andrew Sinclair) in Auckland. With the arrival of Edward John Eyre as Governor of New Munster, Richmond became resident magistrate at Nelson. From 1853 to 1858, Richmond was Commissioner of Crown Lands in Nelson. He lived at The Cliffs in Nelson."]}, {"page": "Joachim Steetz", "response": ["*Andrew Sinclair"]}, {"page": "James Coates (parliamentary official)", "response": ["When Robert FitzRoy took office as governor in late 1843 he appointed (with effect from 15 January 1844) Coates, together with the newly appointed Colonial Secretary, Andrew Sinclair, and Registrar of Deeds, Robert Appleyard Fitzgerald, as \"Commissioners, pro tempore, to examine the public accounts of the colony\".New Zealand Government Gazette, 20 January 1844, page 15 Coates performed this role for about a year, without additional pay, while continuing to hold the position of clerk of councils.Blue Book of Statistics, 1845 and 1846", "Governor George Grey appointed Coates as chief clerk in the office of the colonial secretary on 1 March 1846. After this appointment Coates relinquished his position as clerk of councils for a period, but was reappointed to it again on 1 October 1848, while still retaining the position of chief clerk.Blue Book of Statistics, 1845,1847 & New Ulster 1848 He continued to hold the positions of Chief Clerk and Clerk of councils until 1853, occasionally acting as colonial secretary when Andrew Sinclair was absent. When the Auckland Provincial Council met for the first time in October 1853, Coates became its first clerk.Auckland Provincial Government Gazette, 2 February 1854, page 23, (resolution re Coates pay as Clerk of the Council)Daily Southern Cross, 21 October 1853, page 2Daily Southern Cross, 28 October 1853, page 2New Zealander, 22 February 1854, page 3"]}, {"page": "Acianthus sinclairii", "response": ["Acianthus sinclairii was first formally described in 1853 by Joseph Dalton Hooker and the description was published in The Botany of the Antarctic Voyage of H.M. Discovery Ships Erebus and Terror in the years 1839–1843, under the Command of Captain Sir James Clark Ross. Hooker noted that this species is similar to Acianthus fornicatus \"but differs in the lip [labellum] being less glandular\". The specific epithet (sinclairii) honours Andrew Sinclair, a Scottish botanist and friend of Hooker."]}, {"page": "Francis Eastwood Campbell", "response": ["In 1856 the Wellington Independent newspaper, in a series of articles about the General Assembly, described Campbell and his work as Clerk of the House: \"The Clerk in suit of solemn black and scarlet stockings, sits immediately under the Speaker's chair, at the head of the long table which runs through the center of the House for a third of its length. Charged with the whole of the documentary business of the House, he revels in red tape and pigeon holes, and ought to have (we have no doubt: Mr Campbell has) the organs of order and memory enormously developed. His business in the House consists in taking accurate minutes of the proceedings, recording divisions, reading documents, etc. But independently of this he has his hands full of office work connected with reports of committees, summoning committee men, printing orders of the day, and so forth. Nor do his labours cease with the session. The preparation of the blue books [containing the proceedings of the House], the publication of the Acts, and other multifarious business is his; and very well he earns his salary before he gets it. During the session he has an Assistant Clerk [Alexander S. Martin, of whom Campbell complained to the Colonial Secretary about his \"continued non-attendance... caused by his having abandoned himself to habits of intemperance\"Campbell letter to Andrew Sinclair of 18 October 1855, Archives NZ document R23523528] and several Committee Clerks to help him.\"Wellington Independent, 29 Oct 1856"]}, {"page": "George Friend (parliamentary official)", "response": ["The year after Friend's arrival in New Zealand,  the Administrator of the Government Robert Wynyard  appointed him as an Extra Clerk in the  Colonial Secretary's (Andrew Sinclair's) Department, with effect from 4 May 1854.Blue Book of Statistics 1854, IA12/15 page 108 In January 1855 Friend was transferred to the Office of the Auditor General and, in June 1855, he was promoted to the position of Second Clerk.Blue Book of Statistics 1855, IA12/17 page 130"]}, {"page": "Mesopotamia, New Zealand", "response": ["=== Dr. Andrew Sinclair ===", "Notable botanist and Colonial Secretary to New Zealand, Doctor Andrew Sinclair drowned while crossing the Rangitata River in 1861. Sinclair is buried on Mesopotamia Station in a marked grave near the river. "]}, {"page": "Elizabeth Stack", "response": ["Stack describes collecting a variety of ferns on Waiheke Island with her sister-in-law Emma Jones (née Buchanan):\"The ferns and nikau palms were most graceful and gave the forest quite a tropical look. We found a great variety of small ferns of which Emma and I procured some good specimens for our collections.\" Huruhi, Waiheke Island, 25 February 1857. Stack collected fern, lichen, seaweed and moss specimens as she travelled around New Zealand. In 1858 Stack was introduced by Mrs Wynyard to Dr Andrew Sinclair, a keen botanist, who offered to help her to identify items in her collection. Later that year, Stack describes a trip to the Pink and White Terraces where she was pleased to have ventured to the top of Te Tarata:\"We were very proud of having achieved the rarely accomplished feat and seized the opportunity to gather specimens of mosses and ferns which have never been dry and never felt cold. Some of the mosses were a foot high and we got three varieties of ferns which grew on the brink of the boiling pool, and procured healthy leaves which were dipping in the hot water. Manuka shrubs were thriving in the moist heat, as well as ferns and mosses.\" Te Tarata, p109 In her journal, Stack also describes collecting weta, lizards and stalactites for her 'museum'. In 1859 she says both Dr Sinclair and Captain Haultain (probably Theodore Haultain) offered to help organise her ferns. Stack's journal describes many occasions hunting ferns and mosses for her collection, often with her brother Humphrey and his wife Emma. On one such trip, in the Remutaka Ranges in 1859, she writes about meeting two botanists sent out by a gardening firm from England, who gave Stack's party some fronds of Lomaria elongata, and exchanged other specimens with Stack."]}, {"page": "New Zealand Legislative Council (1841–1853)", "response": ["| Andrew Sinclair || Colonial Secretary || 8 January 1844 || (1)"]}, {"page": "Jovellana sinclairii", "response": ["Jovellana honours the 18th century patron of Botany Gaspar Melchor de Jovellanos and sinclairii is after Andrew Sinclair, a Colonial Secretary of New Zealand and naturalist (c.1796 - 1861)."]}, {"page": "List of plant genera named for people (Q–Z)", "response": ["|data-sort-value=\"Sinclair\"|Andrew Sinclair (1794–1861)"]}, {"page": "Andrew Sinclair (disambiguation)", "response": ["Andrew Sinclair (1935–2019) was a British novelist and polymath.", "Andrew Sinclair may also refer to", "* Andrew Sinclair (botanist) (1794–1861), British surgeon and botanist", "* Andrew Sinclair (politician) (1861–1938), Australian politician ", "* Andrew Sinclair (privy counsellor) (1555–1625), Scottish-born Danish privy counsellor"]}, {"page": "Calliprason sinclairi", "response": ["Calliprason sinclairi, Sinclair's longhorn, is a longhorn beetle species in the genus Calliprason.White, A (1843). List of the annulose animals hitherto recorded as found in New Zealand, with the descriptions of some new species. In ‘Travels in New Zealand, Volume II’. (Ed. E. Dieffenbach.) pp. 265–296. (John Murray: London.) It is endemic to New Zealand. Sinclair's longhorn was named for Dr. Andrew Sinclair who found the insect in New Zealand, and presented it, with many other New Zealand insects, to the British Museum."]}]}}