{"wiki_id": "http://www.wikidata.org/entity/Q4756697", "itemLabel": "Andrew Coyle", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Coyle", "wikipedia_page": {"main": "Andrew Coyle CMG is Emeritus Professor of Prison Studies at the University of London.Between 1997 and 2005, Coyle was founding director of the International Centre for Prison Studies at the School of Law, King's College London. In 2003, he was appointed Professor of Prison Studies at the same School of Law. He was a visiting professor at the University of Essex from 2011 to 2014.He has a PhD from the School of Law at the University of Edinburgh and was appointed a Fellow of King’s College London in 2004.From 1973 to 1997, Coyle was a prison governor and successively governed Greenock, Peterhead, Shotts, and Brixton prisons. HM Chief Inspector of Prisons credited him with achieving \"a remarkable transformation' at Brixton.He was a member of the Judicial Appointments Board for Scotland from 2009 until 2014 and of the UK Administrative Justice and Tribunals Council from 2009 until 2013. From 2005 until 2010, he sat as a member of the inquiry into the murder of Billy Wright at Maze Prison, which was set up following the Northern Ireland Peace Agreement. From 2012 to 2013, at the request of the Scottish Government, Coyle carried out a review of proposed arrangements for the independent monitoring of prisons in Scotland. In 2015, he assisted the Inspector of Prisons for Ireland in reviewing the culture and organisation of the Irish Prison Service. He has been a specialist adviser to several UK parliamentary committees, most recently to the Justice Select Committee in its review of the government's proposals for prison reform in England and Wales.\nCoyle has been an adviser on prison and criminal justice matters to the Office of the UN High Commissioner on Human Rights, the UN Office on Drugs and Crime, the UN Latin American Institute for the Prevention of Crime, and the Council of Europe, including its Committee for the Prevention of Torture (CPT). He was an expert member of the CPT's first two inspection visits to places of detention in the Russian Federation, in 1998 and 1999.He was a member of the UK Foreign Secretary's Advisory Committee against Torture from 2003 to 2010 and negotiated with the Israeli government and the Palestinian Authority for the oversight of certain Palestinian prisoners between 2002 and 2006.Andrew Coyle is president of the Howard League Scotland, vice president of the Prison Visitors Association, and patron of Unlock and of Prisoners Abroad.He was appointed a Companion of the Order of St Michael and St George (CMG) in the New Year's Honours 2003 for his contribution to international penal reform.", "link_mentions": [{"page": "Billy Wright (loyalist)", "response": ["June 2005 saw the Billy Wright inquiry open, chaired by Lord MacLean. Also sitting on the inquiry were academic professor Andrew Coyle from the University of London and the former Bishop of Hereford, the Reverend John Oliver. On 14 September 2010, the findings of the panel were released publicly at Stormont House in Belfast and found that there was no evidence of collusion between the authorities and the INLA.\"Negligence not collusion led to Billy Wright murder\". BBC News Northern Ireland. 14 September 2010 Retrieved 3 October 2011 The inquiry, which had cost £30 million, did find a number of failings within the security of the prison. There was the main question of how the weapons were smuggled inside the prison to the killers. There was also the issue regarding the decision to house the INLA and LVF in H Block 6, when it was known that they were deadly rivals, neither of which was on ceasefire, and the INLA had vowed to kill Wright given the opportunity. McWilliams and Kennaway had been transferred to the Maze from Maghaberry the previous May. One month before their transfer, when Wright had still been at Maghaberry, they had organised an unsuccessful hostage-taking incident at the prison. This was meant to end in the assassination of Wright; he was subsequently moved to the Maze. Other questions were raised after the discovery that on the morning of the killing, Prison Officer Raymond Hill was stood down from his post in the watchtower overlooking A and B wings of H-Block 6 where the INLA prisoners were housed. The CCTV camera placed in the area was also found to have been nonfunctioning for several days prior to the shooting. The visitors lists for 27 December 1997 had been circulated in both the LVF and INLA wings the day before thereby giving Wright's assassins time to prepare for the killing as the list clearly stated that Wright was scheduled to receive a visit on 27 December. The LVF prison van had been parked outside the INLA wing that morning instead of following the normal procedure which was to park outside the LVF wing. And the gates leading from the forecourt were automatically locked as soon as the killers were spotted on the roof. This had prevented the van from driving off and thus effectively trapped Wright in the rear."]}, {"page": "Vivien Stern, Baroness Stern", "response": ["She has honorary doctorates from the University of Kent (15 July 2014) Bristol University, Oxford Brookes University, the University of Stirling, the University of Glasgow and the University of Edinburgh and is an Honorary Fellow of the London School of Economics. She is married to Professor Andrew Coyle."]}, {"page": "Coyle", "response": ["*Andrew Coyle (contemporary), British law professor and prison official"]}, {"page": "World Prison Brief", "response": ["The founding director is Andrew Coyle. The current director is Dr Jessica Jacobson. Baroness Stern is a senior research fellow at the centre."]}, {"page": "Cory Collusion Inquiry", "response": ["* June 2005 saw the Billy Wright inquiry open, chaired by Lord MacLean. Also sitting on the inquiry are academic professor Andrew Coyle from the University of London and the former Bishop of Hereford, the Reverend John Oliver. "]}, {"page": "Christopher \"Crip\" McWilliams", "response": ["In June 2005 an inquiry into Wright's murder began, chaired by Lord MacLean. Also sitting on the inquiry were academician Andrew Coyle of the University of London and the former Bishop of Hereford, the Right Reverend John Oliver."]}, {"page": "Coyle, Andrew", "response": ["#redirectAndrew Coyle"]}]}}