{"wiki_id": "http://www.wikidata.org/entity/Q4756721", "itemLabel": "Andrew Cross", "itemDescription": "Australian rules footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Cross_(footballer)", "wikipedia_page": {"main": "Andrew Cross (born 13 April 1961) is a former Australian rules footballer who played with St Kilda, Fitzroy and Richmond in the Victorian Football League (VFL).  \nCross, a rover, was recruited locally and made his league debut in 1979. He appeared just twice in 1980 and then didn't play senior VFL football in either of the next two seasons. When he returned in 1983, he played the best football of his career, averaging 20 disposals and kicking 14 goals from his eight games. The following year he made more regular appearances, playing 15 games.He finished his career with one seasons stints at both Fitzroy and Richmond. At Fitzroy, he missed just three games all year and then crossed to Richmond. Despite commanding a high transfer fee, he played just once for his new club.Cross also played for VFA club Frankston under the coaching of Jeff Sarau.", "link_mentions": [{"page": "Andrew Crosse", "response": ["Andrew Crosse (17 June 1784 – 6 July 1855) was a British scientist who was born and died at Fyne Court, Broomfield, Somerset. Crosse was an early pioneer and experimenter in the use of electricity. He became known after press reports of an electrocrystallization experiment he conducted in 1836, during which insects \"appeared\".", "A number of documents related to Andrew Crosse and his work are held in the Somerset Record Office. In December 2008 Somerset County Council acquired a further two letters for the sum of 400 pounds to add to the collection."]}, {"page": "List of Fitzroy Football Club players", "response": ["| 1985||Andrew Cross||19||12||1985"]}, {"page": "St. Andrew's Cross", "response": ["Saint Andrew's Cross or Andrew Cross may refer to:", "* Andrew Cross Award, a British award for religious journalism", "*Andrew Crosse (1784–1855), a British amateur scientist ", "*Andrew Cross (footballer) (born 1961), an Australian rules footballer "]}, {"page": "List of St Kilda Football Club players", "response": ["| 1979||Andrew Cross||31||31||1979–1980, 1983–1984"]}, {"page": "List of Richmond Football Club players", "response": ["| 1986||Andrew Cross||1||0||1986"]}]}}