{"wiki_id": "http://www.wikidata.org/entity/Q4757553", "itemLabel": "Andrew Justice", "itemDescription": "British rower (1951-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Justice", "wikipedia_page": {"main": "Andrew Justice (19 January 1951 – 17 June 2005) was a British rower who competed in the 1976 Summer Olympics and in the 1980 Summer Olympics.\nIn 1976 he was a crew member of the British boat which finished ninth in the quadruple sculls event.\nFour years later he won the silver medal with the British boat in the 1980 eights competition.", "link_mentions": [{"page": "Rowing at the 1980 Summer Olympics", "response": ["| Duncan McDougallAllan WhitwellHenry ClayChris MahoneyAndrew JusticeJohn PritchardMalcolm McGowanRichard StanhopeColin Moynihan (cox)"]}, {"page": "Great Britain at the 1976 Summer Olympics", "response": ["*Thomas Bishop, Mark Hayter, Andrew Justice, Allan Whitwell"]}, {"page": "Great Britain at the 1980 Summer Olympics", "response": ["* Henry Clay, Andrew Justice, Chris Mahoney, Duncan McDougall, Malcolm McGowan, Colin Moynihan, John Pritchard, Richard Stanhope, and Allan Whitwell — Rowing, Men's Eights", "* Henry Clay, Andrew Justice, Chris Mahoney, Duncan McDougall, Malcolm McGowan, John Pritchard, Richard Stanhope, Allan Whitwell, Colin Moynihan"]}, {"page": "Deaths in June 2005", "response": ["*Andrew Justice, 54, British Olympic rower."]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Duncan McDougallAllan WhitwellHenry ClayChris MahoneyAndrew JusticeJohn PritchardMalcolm McGowanRichard StanhopeColin Moynihan"]}, {"page": "1981 World Rowing Championships", "response": ["|   Mark Andrews (b)John Bland (2)Colin Seymour (3)Christopher Mahoney (4)Andrew Justice (5)John Pritchard (6)Malcolm McGowan (7)Richard Stanhope (s)Colin Moynihan (c) || 6:04.31"]}, {"page": "Justice Andrews", "response": ["*Andrew Justice (1951–2005), British rower"]}, {"page": "Rowing at the 1976 Summer Olympics – Men's quadruple sculls", "response": ["| Andrew JusticeMark HayterAllan WhitwellThomas Bishop"]}, {"page": "Justice, Andrew", "response": ["#redirectAndrew Justice"]}, {"page": "Mark Hayter", "response": ["Hayter won the coxed pairs title rowing for the Kingston and Leander composite, with Richard Ayling, at the 1973 National Rowing Championships. He was selected by Great Britain as part of the quad sculls at the 1975 World Rowing Championships in Nottingham, the quad finished in sixth place in the A final. At the 1976 Olympic Games he rowed as part of the men's quadruple sculls with Andrew Justice, Tom Bishop and Allan Whitwell, the crew finished in ninth place."]}, {"page": "Thomas Bishop (rower)", "response": ["He was selected by Great Britain as part of the quad sculls at the 1975 World Rowing Championships, the quad finished in sixth place in the A final. At the 1976 Olympic Games he rowed as part of the men's quadruple sculls with Andrew Justice, Mark Hayter and Allan Whitwell, the crew finished in ninth place."]}, {"page": "Justice (surname)", "response": ["* Andrew Justice (1951–2005), British rower"]}]}}