{"wiki_id": "http://www.wikidata.org/entity/Q4757823", "itemLabel": "Andrew M. Butler", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_M._Butler", "wikipedia_page": {"main": "Andrew M. Butler is a British academic who teaches film, media and cultural studies at Canterbury Christ Church University. He is a former editor of Vector, the Critical Journal of the British Science Fiction Association and was membership secretary of the Science Fiction Foundation. He is a former Arthur C. Clarke Award judge and is now a member of the Serendip Foundation which administers the award.\nHe has published widely on science fiction and, less often, fantasy, in journals such as Foundation, Science Fiction Studies, Vector and The Lion and the Unicorn. His interests include Philip K. Dick, Terry Pratchett (Terry Pratchett: Guilty of Literature, co-edited with Edward James and Farah Mendlesohn was nominated for a Hugo Award), Jeff Noon, Iain M. Banks, Ken MacLeod, Christopher Priest and Philip Pullman. An article for Science Fiction Studies, \"Thirteen ways of looking at the British Boom\", on the British science fiction boom won the Science Fiction Research Association Pioneer Award in 2004.", "link_mentions": [{"page": "Iain Banks", "response": ["*The Science Fiction Foundation have published an analysis of Ken MacLeod's work titled The True Knowledge Of Ken MacLeod (2003; ), edited by Andrew M. Butler and Farah Mendlesohn. As well as critical essays and material on MacLeod, it includes MacLeod's introduction to the German edition of Banks' Consider Phlebas and essays comparing the works of the two authors."]}, {"page": "Ken MacLeod", "response": ["The Science Fiction Foundation have published an analysis of MacLeod's work titled The True Knowledge Of Ken MacLeod (2003; ), edited by Andrew M. Butler and Farah Mendlesohn. As well as critical essays it contains material by MacLeod himself, including his introduction to the German edition of Banks' Consider Phlebas."]}, {"page": "Terry Pratchett", "response": ["A collection of essays about his writings is compiled in the book Terry Pratchett: Guilty of Literature, edited by Andrew M. Butler, Edward James and Farah Mendlesohn, published by Science Fiction Foundation in 2000 (). A second, expanded edition was published by Old Earth Books in 2004 (). Andrew M. Butler wrote the Pocket Essentials Guide to Terry Pratchett published in 2001 (). Writers Uncovered: Terry Pratchett is a biography for young readers by Vic Parker, published by Heinemann Library in 2006 ()."]}, {"page": "The Owl in Daylight", "response": ["However, Andrew M. Butler's alternative plot summaries seem to suggest that he might have become fascinated by Dante's Divine Comedy as a form of theophany. In his final completed work, The Transmigration of Timothy Archer, his narrator, Angel Archer, shows similar appreciation for Dante's masterpiece, which suggests that this argument may have some merit.", "By contrast, Andrew M. Butler cites multiple sources for his own contentions about the possible plot, which are cited below. They include references within Greg Rickman's The Last Testament (1985), Lawrence Sutin's In Pursuit of VALIS (1991), and the interview collection What if Our World is Their Heaven? (2006), cited above.", "However, Andrew M. Butler offers several alternative summaries which contradict the Lee/Dick interview cited above. A god-like being, Ditheon, fuses the Torah and Jesus Christ into a single being and takes over an individual. A scientist travels through the events of Dante's Divine Comedy, and a Beethoven-like composer is writing a film score, while pursued by aliens. "]}, {"page": "57th World Science Fiction Convention", "response": ["Andrew M. Butler"]}, {"page": "Jury Prize (Cannes Film Festival)", "response": ["Film academic Andrew M. Butler regards jury prizes such as Cannes' as a way of helping a film gain a distribution deal."]}, {"page": "Paul Kincaid", "response": ["* As co-editor, with Andrew M. Butler, The Arthur C. Clarke Award: A Critical Anthology (Daventry, Northants: Serendip Foundation, 2006)"]}, {"page": "Andrew Butler (disambiguation)", "response": ["* Andrew M. Butler, British academic"]}, {"page": "BSFA Award for Best Non-Fiction", "response": ["||  & Andrew M. Butler || || Serendip Foundation"]}]}}