{"wiki_id": "http://www.wikidata.org/entity/Q4758372", "itemLabel": "Andrew Reed", "itemDescription": "British clergyman", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Reed_(minister)", "wikipedia_page": {"main": "Andrew Reed (27 November 1787 – 25 February 1862) was an English Congregational minister and hymnwriter, who became a prominent philanthropist and social reformer.  He was the father of Sir Charles Reed and grandfather of Talbot Baines Reed.", "link_mentions": [{"page": "Orphanage", "response": ["| Rev Andrew Reed", "| Rev Andrew Reed", "| Rev Andrew Reed"]}, {"page": "Royal Earlswood Hospital", "response": ["In 1847, Ann Serena Plumbe took an interest in the plight of the learning disabled, or \"idiots\" as they were termed at the time, and began to discuss what could be done to assist them. In discussion with Dr John Conolly (of the Hanwell Asylum) and Rev Dr Andrew Reed (a philanthropist and founder of several orphanages) they determined to educate such people. Reed toured Europe to gather information on institutions serving the purpose and in October the project to found The Asylum for Idiots, as it was originally called, began with the appointment of a board of management.", "A property known as Park House in Highgate was purchased in March 1848 and the first patients were admitted in April 1848, including a 13 year-old Andrew Reed Plumbe. The building became too small and a purpose-built facility was commissioned. Queen Victoria subscribed 250 guineas in the name of the Prince of Wales who became a life member. The hospital was designed by William Bonython Moffat and built by John Jay. Prince Albert took a special interest from the beginning. He laid the foundation stone in June 1853 and opened the Asylum in June 1855. In 1862 Queen Victoria conferred a Royal charter on the asylum. One notable inmate in the early years of the asylum was artist James Henry Pullen (1835–1916)."]}, {"page": "Reedham railway station (London)", "response": ["The station was opened by the South Eastern and Chatham Railway on its branch line to Tattenham Corner as Reedham Halt on 1 March 1911. Situated  from Purley railway station, it was built with  long platforms and adjoined an overbridge crossing Old Lodge Lane in Purley. It took its name from the nearby Reedham Asylum for Fatherless Children, founded in Richmond by philanthropist Andrew Reed in 1844. The asylum was renamed Reedham Orphanage in 1904 and Reedham School in 1950. It closed in 1980, but the trust which ran it still occupies the original lodge (gatehouse) of the estate."]}, {"page": "Andrew Reed (Reverend)", "response": ["#REDIRECT Andrew Reed (minister)"]}, {"page": "William Milne (missionary)", "response": ["After William Milne's death in 1822, his four surviving children were sent back to England, to receive further education under the care of Rev. Andrew Reed (1787–1862). Both Robert George and William Charles Milne graduated from Homerton Academy and Marischal College of Aberdeen University. Later, William Charles followed his father's steps and became a missionary to China being sent by London Missionary Society, and a tutor to British translators in China. William Charles died in 1863 and was buried in a Russian cemetery at Beijing. Robert George Milne served as a Dissenting minister in Lancaster, and died in 1882.   thumb|left|200px|The Anglo-Chinese College in Malacca, Malaya (Malaysia) in 1834."]}, {"page": "Reverend Andrew Reed", "response": ["#REDIRECT Andrew Reed (minister)"]}, {"page": "Andrew Reed", "response": ["Andrew Reed may refer to:", "*Andrew Reed (minister) (1787–1862), British Congregational minister and philanthropist", "*Andrew Reed (police officer) (1837–1914), inspector in the Irish policeforce", "*Andrew Reed (rower), American rower"]}, {"page": "Andrew Reed (clergyman)", "response": ["#REDIRECT Andrew Reed (minister)"]}, {"page": "Reedham Orphanage", "response": ["Reedham Orphanage was founded in 1844 in Richmond, London as the Asylum for Fatherless Children by Rev Andrew Reed taking children of both sexes and giving them food, shelter and education until the age of 13 and 14.", "When Andrew Reed died in 1862 the asylum's name was changed to Reedham in his honour."]}, {"page": "Snaresbrook Crown Court", "response": ["Construction of the building began in 1841 and finished two years later. It was built in the Jacobean gothic style by the English architects George Gilbert Scott and William Bonython Moffatt, who were prolific designers of workhouses, hospitals and churches. Snaresbrook Crown Court was originally built as an orphanage at the behest of the philanthropist Andrew Reed who named it the Infant Orphanage Asylum; later it became the Royal National Children's Foundation. Under various titles, it remained an orphanage until 1938 when it became the Royal Wanstead School. The building continued as a school until 1971 when it passed into the ownership of British government who converted the building into a crown court at a cost of £1.6m in 1973. The building opened as a Crown Court on 26 November 1974.", "The Wanstead Infant Orphan Asylum was founded by the philanthropist Andrew Reed in 1827 and was based in Hackney. In the 1830s, and owing to a lack of space in the current building, Reed applied to the Crown Estate for a section of land in Snaresbrook, which was then part of Wanstead Forest, and a grant to help fund the building of a new premises. The application was successful and construction started on 27 June 1841.. Scott and Moffatt were chosen to design the orphanage; the foundation stone was laid by Albert, Prince Consort in 1841.\"Wanstead Infant Orphan Asylum, Wanstead, London\", Children's Homes website. Retrieved 5 August 2015. The Infant Orphanage Asylum was officially opened on 27 June 1843 by Leopold I of Belgium.\"A History: Snaresbrook Crown Court\", Information leaflet produced by HM Courts & Tribunals Service, p. 2. It is designed in the Jacobean gothic style and cost £35,000 to construct. Queen Victoria was the first in a long line of royal patrons."]}, {"page": "Phoebe Hinsdale Brown", "response": ["In 1819, Brown wrote two hymns which were overlooked by Nettleton, and did not appear till 1831 in Thomas Hastings's Spiritual Songs. These were, \"How sweet the melting lay. Morning.\" and \"0 Lord, Thy work revive. For a Revival.\" Both are found in Lyra Sacra Americana, pp. 28–30. The second of these was altered by the author for Elias Nason's Congregational Hymn Book, 1857. This, according to Nason, was her authorized text. It was widely used in the U.S., and was also found in a few English collections, including Andrew Reed's Hymn Book and the New Congregational Hymn Book, and sometimes was attributed in error to Hastings. Browns' later hymns were: \"Great God, we would to Thee make known\", which appeared in the Mother's Hymn Book, 1834; We come. 0 Lord, before Thy throne. For Suitors.; Grant the abundance of the sea. For Sailors, two hymns for sailors, which appeared in Linsley and Davis' Select Hymns, 1830; Assembled at [round] Thine altar, Lord. Holy Communion, which also appeared in the Select Hymns, 1834, and was altered for Nason's Cong. H. Bk., 1857; and Jesus, this mid-day hour. Soon, which was written by special request for the \"Fulton Street [Noon] Prayer Meeting\", about 1857. In addition to the foregoing, there were four hymns by her in Parish Hymns (Philadelphia), 1843,; and there may be many others in various collections which were uncredited."]}, {"page": "List of last words (19th century)", "response": [":— Andrew Reed, English Congregational minister and hymnwriter (25 February 1862), pondering the fate of the souls of intellectually disabled persons"]}]}}