{"wiki_id": "http://www.wikidata.org/entity/Q4757891", "itemLabel": "Andrew Marshall", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Marshall_(screenwriter)", "wikipedia_page": {"main": "Andrew Paul Marshall (born 27 August 1954) is a British comedy screenwriter, most noted for the domestic sitcom 2point4 children. He was also the inspiration for Marvin the Paranoid Android in The Hitchhiker's Guide to the Galaxy. Although he had also previously adapted stories for Agatha Christie's Poirot, in 2002 he made a further move into writing \"straight\" drama, with the fantasy horror series Strange. He has also written several screenplays.", "link_mentions": [{"page": "British sitcom", "response": ["If You See God, Tell Him (1993) is an ingenious BBC1 mini-series in four 45-minute episides written by Andrew Marshall (Dad, 2 Point 4 Children) and David Renwick (One Foot in the Grave, Jonathan Creek),starring Richard Briers (The Good Life), Adrian Edmondson (The Young Ones, Bottom), and Imelda Staunton (Up the Garden Path, Is it Legal?), and also Martin Clunes (Doc Martin). Four episodes were produced.  The very dark humour is about a man who after a bump on the head believes he must do everything the adverts tell him, with hilarious catastrophic results. The Independent wrote: \"It's not really a disaster but there's something decidedly uneven underfoot here, a feeling that this is the working model for a new type of comedy rather than the finished product. [...] while it's sustained with considerable energy by the actors and direction you have to doubt whether it really stands up for one episode, let alone four.\" Conversely, a retrospective review in The Guardian highlighted the series as \"a gem from an era when the BBC took its black comedy seriously\", praising both its dark content and humour, \"a Richard Briers sitcom that's the opposite of The Good Life.\" The series was only broadcast once and never repeated; according to The Guardian  ...\"possibly because it was too much of a leap for fans of The Good Life, but it has grown in cult status over the years.\""]}, {"page": "Dad (TV series)", "response": ["Toby Ross-Bryant played Alan's son Vincent, and Julia Hills played Alan's wife Beryl. It was written by Andrew Marshall, who was best known for his popular sitcom 2point4 Children. The title of each episode was a pun on the word 'Dad'.", "The final episode was a Christmas special that aired on 21 December 1999, this time a Tuesday, at 8.30 pm. It broke with the tradition of punning on 'Dad' for the title, and was named 'Nemesis', although Andrew Marshall later revealed that the original title \"Feliz Navidad\" was nixed by the BBC, feeling it too obscure.", "The show received less critical acclaim than the similar BBC family sitcom 2point4 Children, also written by Andrew Marshall.", "During the second series, writer Andrew Marshall was convinced the show would go to a third series. Kevin McNally also believed they'd be doing the show for quite a while. However, after 13 episodes, and despite going from strength to strength, 'Dad' ended with a 1999 Christmas special. McNally commented that the show got 'somehow lost', and its cancellation was to do with a regime change at the BBC. George Cole believed the shows cancellation was down to focus groups that began to decide what TV shows should be axed.", "The estate agent named on the 'for sale' signs in the first episode of series 2 are called 'Renwick'; a nod to Andrew Marshall's ex-writing partner, David Renwick."]}, {"page": "Jonathan Miller", "response": ["*In the BBC Radio Four series The Burkiss Way edition 35, broadcast on 2 April 1979, he was impersonated by Nigel Rees in a fairly lengthy parody \"The Blood Gushing All over the Screen in Question\", in which the history of nasty diseases was traced and the style of Miller's presentation was  sent up. It was written by Andrew Marshall and David Renwick."]}, {"page": "Bernard Quatermass", "response": ["Andrew Marshall and Rob Grant, produced directed and wrote the Radio 4 Series \"The Quanderhorn Xperimentations\".", "The Quanderhorn Xperimentations: Andrew Marshall and Rob Grant Interview They also created a novel of the same name released by Gollancz Publishers.The Quanderhorn Xperimentations: FantasticFiction.com"]}, {"page": "Rob Grant", "response": ["Robert Grant is an English comedy writer, television producer and co-creator of Red Dwarf. Since Red Dwarf, Grant has written two television series, The Strangerers and Dark Ages, and four solo novels, his most recent being Fat. During his career Grant has been involved in two distinct writing partnerships: the first with Doug Naylor, and the second and most recent with Andrew Marshall.", "In 2018, Grant collaborated with Andrew Marshall to produce, direct and write the BBC Radio 4 Series, \"The Quanderhorn Xperimentations\" - and also the novel version published by Gollancz Publishers.", "*The Quanderhorn Xperimentations (2018), with Andrew Marshall, a science fiction story set in 1952 with echoes of Quatermass.", "*The Nether Regions (2019), with Andrew Marshall (BBC Radio 4)"]}, {"page": "List of BBC Radio 4 programmes", "response": ["*The Quanderhorn Xperimentations (2018), a science fiction spoof by Rob Grant and Andrew Marshall"]}, {"page": "Andrew Marshall (author)", "response": ["#REDIRECT Andrew Marshall (screenwriter)"]}, {"page": "Strange (TV series)", "response": ["All six episodes of the series were written by Andrew Marshall, a scriptwriter primarily known for his comedy work. It was directed by Joe Ahearne, who had previously been responsible for both writing and directing the World Productions vampire serial Ultraviolet for Channel 4.", "Broadcast on Saturday nights, the series was hampered by frequent timeslot changes, the long gap between the pilot and the series and the BBC's decision not to repeat the pilot before the series aired. The viewing figures were low, and a second series was not commissioned. However, to mark five years since the original broadcast, creator Andrew Marshall wrote an additional short story entitled 'Ramset.'"]}, {"page": "Q... (TV series)", "response": ["While Flying Circus had four series between 1969 and 1974, because of Milligan's tempestuous relationship with the BBC, he had to wait until 1975 for his second series, Q6, to be commissioned. The series continued sporadically after this. Q7 appeared in 1978, Q8 shortly after in 1979 (two years before the Kuwait Petroleum Corporation registered the trademark; the TV series' opening credits showed the characters 'Q8' being formed from the word 'Kuwait'), Q9 in 1980 and There's a Lot of It About in 1982. Milligan resented the BBC for the cold attitude they took towards the series in comparison with series like Flying Circus, and always maintained that, given the opportunity, he would have produced more.  The shows were written by Milligan and his writing collaborator Neil Shand, with occasional episodes (especially in later years) giving \"additional contribution\" credit to any or all of David Renwick, Andrew Marshall, and John Antrobus."]}, {"page": "Hordes of the Things (radio series)", "response": ["Hordes of the Things is a 1980 BBC radio comedy series parodying J. R. R. Tolkien's The Lord of the Rings and to a greater extent the fantasy genre in general, in a style similar to The Hitchhiker's Guide to the Galaxy. It was written by \"A. P. R. Marshall and J. H. W. Lloyd\" (Andrew Marshall and John Lloyd) and produced by Geoffrey Perkins. It is unrelated to the game of the same name.", "*Hordes of the Things fan site approved by Andrew Marshall"]}, {"page": "Hot Metal", "response": ["Written by David Renwick and Andrew Marshall, it is very much a continuation in style from their previous sitcom Whoops Apocalypse!. It was produced by Humphrey Barclay."]}, {"page": "Ormiston Denes Academy", "response": ["* Andrew Marshall, screenwriter, who wrote and created 2point4 Children, wrote Radio 4's 1970s The Burkiss Way (with David Renwick), and was Douglas Adams' inspiration for the character Marvin in The Hitchhiker's Guide to the Galaxy"]}, {"page": "1954 in radio", "response": ["*27 August – Andrew Marshall, English comedy scriptwriter"]}, {"page": "Andrew Marshall", "response": ["Andrew Marshall may refer to:", "*Andrew Marshall (screenwriter) (born 1954), British comedy screenwriter", "*Andrew Marshall (journalist), British journalist and radio presenter", "*Andrew Marshall (Asia journalist) (born 1967), British journalist specialising in South East Asia", "*Andrew Marshall (American football) (1879–1965), American football player", "*Andrew Marshall (Canadian football) (born 1990), Canadian football player", "*Andrew Marshall (golfer) (born 1973), English professional golfer", "*Andrew Marshall (soccer) (born 1984), American footballer", "*Andrew Marshall (foreign policy strategist) (1921–2019), American foreign policy strategist"]}, {"page": "1954 in British television", "response": ["* 27 August – Andrew Marshall, scriptwriter"]}, {"page": "Health and Efficiency (TV series)", "response": ["Health and Efficiency is a British sitcom that was originally broadcast from 30 December 1993 to 10 February 1995 on BBC1 for a total of 12 episodes over 2 series. It was written by Andrew Marshall, writer of the sitcom 2point4 Children."]}, {"page": "Freddie Fox (actor)", "response": ["| Andrew Marshall and Rob Grant", "| Andrew Marshall and Rob Grant"]}, {"page": "Andrew Marshall (writer)", "response": ["#REDIRECT Andrew Marshall (screenwriter)"]}, {"page": "Quanderhorn", "response": ["Quanderhorn (titled The Quanderhorn Xperimentations for series 1 and Quanderhorn 2 for the second series) is a science fiction comedy radio series written by Andrew Marshall and Rob Grant. The first series was originally broadcast in the United Kingdom by BBC Radio 4 in 2018, and a second in 2020. The series has elements that pastiche Nigel Kneale's Professor Bernard Quatermass.The Quanderhorn Xperimentations: Andrew Marshall and Rob Grant Interview", "Andrew Marshall and Rob Grant also created a novel based on series one entitled \"The Quanderhorn Xperimentations\" and released by Gollancz Publishers.The Quanderhorn Xperimentations: FantasticFiction.com"]}, {"page": "The Kenny Everett Television Show", "response": ["The Kenny Everett Television Show is a comedy sketch show broadcast on BBC1 from 1981 to 1988. It was presented by its main performer Kenny Everett, who wrote the material with Barry Cryer and Ray Cameron. Later in 1986 they were joined by writing team Andrew Marshall and David Renwick after Cameron's departure the previous year. It was similar in style to Everett's previous programme The Kenny Everett Video Show, broadcast on ITV from 1978 to 1981, but with greater emphasis on comedy sketches than musical numbers. However, each edition would still have at least one music act. A total 47 episodes, including 6 Christmas specials and 2 compilations over 5 series, were produced by the BBC, broadcast between 24 December 1981 and 18 January 1988 inclusive."]}, {"page": "1954 in British radio", "response": ["*27 August – Andrew Marshall, comedy scriptwriter"]}]}}