{"wiki_id": "http://www.wikidata.org/entity/Q47525715", "itemLabel": "Larry Flanagan", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Larry_Flanagan", "wikipedia_page": {"main": "Larry Flanagan (born Scotland 1955) is a Scottish trade union leader and former politician.\nFlanagan attended the University of Stirling before becoming a teacher at Blantyre High School.  He also became active in the Militant Tendency and in the Labour Party.  He was elected to Glasgow City Council, where he called for the party to oppose the Poll Tax with a campaign of non-payment.  He hoped to stand in the 1988 Glasgow Govan by-election, but was not considered as a candidate due to his involvement with Militant.Early in the 1990s, Flanagan was suspended from the Labour group on the council due to disagreements about strategy with relation to the Poll Tax.  He instead focused on his teaching career, at Penilee High School in Paisley and then Hillhead High School in Glasgow.  He also became increasingly prominent in the Educational Institute of Scotland (EIS) trade union, being elected to its council and convening its education committee.  In 2012, he was elected as the union's general secretary.  He also represents the union on the General Council of the Trades Union Congress, and the General Council of the Scottish Trades Union Congress.", "link_mentions": [{"page": "Educational Institute of Scotland", "response": [":2012: Larry Flanagan", "Threats of industrial action by the EIS  evoke memories for many of the long-running teacher strikes of the 1980s  During the 1984-86 industrial action almost 15 million pupil days were lost .across Scotland.  It was a sustained campaign of industrial action in  Scottish education in oppostion to the  Conservative Government. Larry Flanagan has described it as “the first time that any group of workers, anywhere in the UK, successfully stood firm in defiance of a concerted, ideologically driven attack by the Tory government.”"]}, {"page": "List of trade unions in the United Kingdom", "response": ["|Larry Flanagan"]}, {"page": "General Council of the Trades Union Congress", "response": ["| rowspan=10 | Larry Flanagan"]}]}}