{"wiki_id": "http://www.wikidata.org/entity/Q4758626", "itemLabel": "Andrew Stahl", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Stahl_(artist)", "wikipedia_page": {"main": "Andrew Michael Stahl  (born 1954 in London) is a British painter who lives and works in the UK. He is known for his large figurative paintings. He is Professor of Fine Art and Head of Undergraduate Painting at the Slade School of Fine Art.\nIn 1979, he won the Abbey Major Scholarship and spent two years in Rome returning to the UK for his first solo show in London at the Arts Council funded AIR Gallery in 1981. Since, then he has shown widely internationally.\nIn 2000 Stahl did a British Council funded residency at Chiang Mai University. Much of his recent work reflects on travels to Japan and Thailand and addresses the conflation of time, space and cultures that long-haul travel brings. His paintings approach cultural differences and connections using pictorial language, imagination and figuration. Images become vehicles to carry painterly experimentation. This was underpinned by a further series of residencies in Thailand, plus residencies in Australia (Sydney) and China (Guangzhou).\nRecent solo shows include at Robert Steele Gallery, New York City and Matthew Bown Gallery, London, 2007; Anywhere Anytime Anyhow, Ardel Gallery Bangkok 2009 and New Paintings, Robert Steele Gallery, New York, 2010, a two-person show with Panya Vijinthanasarn in 2014 at Thavibu Gallery Bangkok. Group shows include the British Council show Monologue/Dialogue featuring artists from the UK and Thailand, Part 1 in Bangkok, 2006 and Part 2 in London, 2008; Stew, Artspace, London, 2008; Same as it ever was, University of the Arts, London, 2008; Painting of the 80s, Matthew Bown Gallerie, Berlin, 2009 and Select, Peppercannister Gallery, Dublin, 2010. In June 2014, interested in transcultural interaction, Stahl both curated and participated in Monologue/Dialogue 3 Fragility and Monumentality, a group show at the BACC in Bangkok, Thailand of 12 British and Thai Artists funded by the British Council and the Thai Ministry of Culture.", "link_mentions": [{"page": "Slade School of Fine Art", "response": ["* Andrew Stahl (born 1954), painter"]}, {"page": "Andrew Michael Stahl", "response": ["#REDIRECT Andrew Stahl (artist)"]}, {"page": "Sinta Tantra", "response": ["After completing a BTEC diploma in Fine Art at Middlesex University in 1999, Tantra took her BA at the Slade School of Fine Art from 2000 to 2003, under the tutor Andrew Stahl, head of Painting. It was here that she met the sculptor Nick Hornby, who she would go on to collaborate with in the future. "]}]}}