{"wiki_id": "http://www.wikidata.org/entity/Q47501274", "itemLabel": "Maura Dooley", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Maura_Dooley", "wikipedia_page": {"main": "Maura Dooley is a British poet and writer. She has published 5 collections of Poetry and edited several anthologies. She is winner of the Eric Gregory Award in 1987, the Cholmondeley Award in 2016 and was shortlisted for the Forward Poetry Prize (single poem) in 1997 and again in 2015. Her poetry collections Life Under Water (2008) and Kissing A Bone (1996) were shortlisted for the T. S. Eliot Prize.", "link_mentions": [{"page": "1987 in literature", "response": ["*Eric Gregory Award: Peter McDonald, Maura Dooley, Stephen Knight, Steve Anthony, Jill Maughan, Paul Munden"]}, {"page": "Royal Society of Literature", "response": ["| Maura Dooley"]}, {"page": "T. S. Eliot Prize", "response": ["*Maura Dooley, Life Under Water"]}, {"page": "Eric Gregory Award", "response": ["*1987: Peter McDonald, Maura Dooley, Stephen Knight, Steve Anthony, Jill Maughan, Paul Munden"]}, {"page": "Cholmondeley Award", "response": ["* Maura Dooley"]}, {"page": "Imtiaz Dharker", "response": ["With Poetry Live, she reads to over 25,000 students a year, travelling across the country with poets including Duffy, Simon Armitage, John Agard, Gillian Clarke, Daljit Nagra, Grace Nichols, Owen Sheers, Jackie Kay and Maura Dooley. Dharker divides her time between London, Wales, and Mumbai. She says she describes herself as a \"Scottish Muslim Calvinist\" adopted by India and married into Wales.  Her daughter, Ayesha (whose father is Anil Dharker), is an actress in international films, television and stage."]}, {"page": "1987 in poetry", "response": ["* Eric Gregory Award: Peter McDonald, Maura Dooley, Stephen Knight, Steve Anthony, Jill Maughan, Paul Munden"]}, {"page": "Bloodaxe Books", "response": ["One of Bloodaxe’s most significant achievements has been to transform the publishing opportunities for women poets. For many years Bloodaxe has been unusual in having a poetry list which is 50:50 male: female, not the result of positive discrimination but rather in relation to literary excellence. The first of several influential Bloodaxe anthologies of women poets, Jeni Couzyn’s Bloodaxe Book of Contemporary Women Poets (1985) was published at a time when very little poetry by women was readily available to readers. Others have included Carol Rumens’s New Women Poets (1990), Linda France’s Sixty Women Poets (1993), Maura Dooley’s Making for Planet Alice (1997), Robyn Bolam's Eliza's Babes: four centuries of women's poetry in English (2005), and Deryn Rees-Jones’s Modern Women Poets (2005), published as the companion anthology to her critical study Consorting with Angels (2005)."]}, {"page": "New Blood (book)", "response": ["In the order presented in the anthology the contributors are: John Kinsella · Pauline Sainer · Deborah Randall · Marion Lomax · Imtiaz Dharker · Geoff Hattersley · Brendan Cleary · Maura Dooley · W. N. Herbert · Jackie Kay · Ian Duhig · Elizabeth Garrett · Linda France · Anne Rouse · Moniza Alvi · Stephen Knight · Katie Donovan · Chris Greenhalgh · Ann Sansom · Tracy Ryan · Maggie Hannan · Gwyneth Lewis · Julia Copus · Eleanor Brown · Tracey Herd · Katrina Porteous · Roddy Lumsden · Gillian Ferguson · Jane Holland · Jackie Hardy · Clare Pollard · Frieda Hughes · Nick Drake · Amanda Dalton · Christina Whitehead · Polly Clark · Joanne Limburg · Jane Griffiths"]}, {"page": "2008 in poetry", "response": ["** Maura Dooley, editor, Life Under Water"]}, {"page": "Poetry Translation Centre", "response": ["British poets who have contributed translations include Maura Dooley, Carole Satyamurti, Choman Hardi, David Harsent, Jane Duran, Jo Shapcott, Katherine Pierpoint, Lavinia Greenlaw, Mark Ford, Mimi Khalvati, Sarah Maguire, Sean O'Brien and W. N. Herbert."]}, {"page": "Matthew Sweeney", "response": ["Bill Swainson, Sweeney's editor at Allison and Busby in the 1980s, recalls: \"As well as writing his own poetry, Matthew was a great encourager of poetry in others. The workshops he animated, and later the residencies he undertook, were famous for their geniality and seriousness and fun. Sometime in the late 1980s I attended one of these workshops in an upstairs room of a pub in Lamb's Conduit Street, Bloomsbury, where the poems were circulated anonymously and carefully read and commented on by all. Around the pushed-together tables were Ruth Padel, Eva Salzman, Don Paterson, Maurice Riordan, Jo Shapcott, Lavinia Greenlaw, Michael Donaghy, Maura Dooley and Tim Dooley.\" Sweeney later had residencies at the University of East Anglia and London's Southbank Centre, among many others. at British Council, Literature. He read at three Rotterdam Poetry Festivals, in 1998, 2003 and 2009."]}, {"page": "Twice Through the Heart", "response": ["Turnage, who had previously composed one full-length opera, Greek, worked on the musical version of Twice between 1994 and 1996. It was commissioned by the John S. Cohen Foundation. He had learnt of Kay's original work after he was shown a copy of the BBC video by poet and artistic director Maura Dooley. It was a difficult development with Turnage at one point abandoning the work in favour of other pieces. Composer and librettist had started out with the intention of developing a full-length opera including both soprano and baritone narrators.Nick Kimberley, \"Two from the Heart\", The Independent, Tuesday, 17 June 1997. Retrieved 11 December 2009. (The original television script had included poems for the judge as well as for the woman.) However, the creators felt that their attempts at redeveloping and expanding the original work \"water[ed] down its impact\" and they eventually cut everything apart from the woman's words. Both text and setting also underwent repeated changes in detail. Kay changed some of the wording to make it easier to sing. Similarly, Turnage revised the music after trying it out with Sally Burgess who was to give the first performance. He had become Composer in Association with English National Opera (ENO) in 1995 and was able to thoroughly workshop Twice and its companion piece with ENO's Contemporary Opera Studio before arriving at their respective final versions.Sue Knussen, \"Mark-Anthony Turnage: Defying the Stereotype\" in Philip Reed (ed.) (1997), Programme for From the House of the Dead and Twice Through the Heart, London, English National Opera. Three pages in publication without page numbering."]}, {"page": "2016 in poetry", "response": ["* Cholmondeley Award: Maura Dooley, David Morley, Peter Sansom, Iain Sinclair"]}, {"page": "Warwick Prize for Women in Translation", "response": ["|Maura Dooley; Elhum Shakerifar"]}]}}