{"wiki_id": "http://www.wikidata.org/entity/Q47544159", "itemLabel": "Victoria Willing", "itemDescription": "British actress, voice actress, writer and playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Willing", "wikipedia_page": {"main": "Victoria C. Willing (born 1959 or 1972) is a British actress, voice artist, playwright and writer, known for her work on The Inbetweeners and various Jim Henson Company productions. In January 2020, Willing appeared in an episode of the BBC soap opera Doctors as Gwen Hubbard, and in August 2020, she appeared in an episode of the BBC medical drama Casualty.In 1972, Willing was born in Marylebone, Central London to artist parents. She is the daughter of Dame Paula Rego and Victor Willing.", "link_mentions": [{"page": "The Hoobs", "response": ["* Steven Kynman, Victoria Willing, Ivestyn Evans, Robert Skidmore and Susan Beattie served as assistant puppeteers in the series."]}, {"page": "List of former EastEnders characters", "response": ["|Sue Miller || Victoria Willing || 2002"]}, {"page": "List of EastEnders two-hander episodes", "response": ["With Rebecca Miller asleep upstairs, Sonia ransacks the house for money in order to make her getaway. Dot frantically knocks at the door, shouting that Rebecca's adoptive parents, Neil Miller (Robin Sneller) and Sue Miller (Victoria Willing), were going to call the police unless Sonia lets her in. Sonia tries to deny Rebecca is there, but Dot knows otherwise and makes it clear that she is there to retrieve the baby for the Millers. Sonia becomes distressed by this, arguing that as she is Rebecca's mother she can look after her. The Millers have given Dot a deadline of 15 minutes to persuade Sonia to surrender Rebecca or they will involve the police."]}, {"page": "Mopatop's Shop", "response": ["The show features a large green dragon-like Muppet named Mopatop (performed by Mak Wilson (series 1 and 2) and William Todd-Jones (series 3 and 4) and his red and yellow platypus-like dog-duck hybrid assistant Puppyduck (performed by Victoria Willing). Together they run Mopatop's Shop, a shop where one can buy anything they could ever think or dream of. They interact with characters including the Mouse family, local deliveryman Lamont the sloth, neighbor Claudia Bird, a rabbit named Odd-Job Gerald."]}, {"page": "Captain Abercromby", "response": ["|additional puppeteers:||Neil Sterenberg, Victoria Willing"]}, {"page": "The Object of Beauty", "response": ["* Victoria Willing as Portuguese maid #1"]}, {"page": "Little Princess (TV series)", "response": ["*The Maid (voiced by Victoria Willing)"]}, {"page": "List of EastEnders characters (2005)", "response": ["Margaret Wilson, played by Janet Amsden, is the adoptive grandmother of Sonia (Natalie Cassidy) and Martin Fowler's (James Alexandrou) daughter, Rebecca Miller, and mother of Rebecca's adoptive mother, Sue Miller (Sadie Shimmin/Victoria Willing). When Sue, along with her husband Neil (Robin Sneller) were killed in a car crash in 2005 Margaret became the parental guardian of Rebecca."]}, {"page": "List of EastEnders characters (2001)", "response": ["Sue Miller, played by Sadie Shimmin in 2001 and Victoria Willing in 2002, is the adoptive mother of Sonia Jackson (Natalie Cassidy) and Martin Fowler's (James Alexandrou) daughter. Sonia gave birth to baby Chloe in 2000, but decided to give her daughter up for adoption. Chloe was placed with Sue and her husband Neil (Robin Sneller), a childless couple. Martin's mother, Pauline Fowler (Wendy Richard), Sonia and Martin are seen visiting Chloe occasionally at the Millers' house Sue and Neil changed Chloe's name to Rebecca.", "Neil is first seen in January 2001, when Martin and his mother Pauline visit Rebecca. In 2002, Sonia kidnaps Rebecca while Neil and Sue (now Victoria Willing) are out. Sonia tells their babysitter that she is a family friend, and snatches Rebecca, taking her to Walford. Neil and Sue work this out and trace her. While Sonia barricades herself inside her house, the Millers give Dot Branning (June Brown) fifteen minutes to persuade Sonia to hand Rebecca over before they phone the police. Just before the Millers are about to call the police, Dot successfully persuades Sonia to hand Rebecca over.", "|  A social worker who takes over from Ameena Badawi (Shobna Gulati) on the case of Chloe Jackson, when Ameena is promoted. She eventually finds Chloe a home with Neil (Robin Sneller) and Sue Miller (Victoria Willing), who rename her Rebecca."]}, {"page": "Behind Closed Doors (2003 film)", "response": ["* Victoria Willing - Kara Phillips "]}, {"page": "List of The Inbetweeners characters", "response": ["| Mrs Cartwright || colspan=\"4\" style=\"background:pink;\"| Victoria Willing || colspan=\"2\" style=\"background:white;\"|", "* Played by Victoria Willing"]}, {"page": "Him & Her", "response": ["* Sue (Victoria Willing; 4 episodes), Becky and Laura's aunt"]}, {"page": "The Curious Incident of the Dog in the Night-Time (play)", "response": ["| align=\"center\" | Victoria Willing"]}, {"page": "List of EastEnders characters (2000)", "response": ["Sonia does not know she is pregnant until she goes into labour and Mo Harris (Laila Morse) delivers the baby. After her daughter is born, Sonia is taken to hospital and tells her social worker Ameena Badawi (Shobna Gulati) upon meeting her that she does not want her baby. She names her baby Chloe and Sonia decides she wants Chloe adopted. Sonia hands Chloe over to Ameena, who takes Chloe into foster care. Martin and his mother, Pauline Fowler (Wendy Richard), discover Martin is the father, Pauline wants custody of Chloe, which Sonia is against. Martin agrees that he wants Chloe for Pauline's sake, but admits to his brother, Mark Fowler (Todd Carty), that he does not want to be a father and Chloe is adopted by Neil and Sue Miller (Sadie Shimmin). The Millers change Chloe's name to Rebecca. In 2002, Sonia, now suffering depression over the guilt of abandoning her daughter, kidnaps Rebecca and barricades herself inside her house. Neil and Sue (now Victoria Willing), understandably upset about Sonia's actions, give Dot Branning (June Brown) fifteen minutes to persuade Sonia to give Rebecca back before they phone the police. Dot successfully persuades Sonia to give Rebecca back."]}, {"page": "Paula Rego, Secrets & Stories", "response": ["*Victoria Willing Paula's younger Daughter"]}, {"page": "List of Doctors characters (2020)", "response": ["| Victoria Willing"]}, {"page": "Willing, Victoria", "response": ["#redirectVictoria Willing"]}]}}