{"wiki_id": "http://www.wikidata.org/entity/Q4758888", "itemLabel": "Andrew West", "itemDescription": "British sinologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_West_(linguist)", "wikipedia_page": {"main": "Andrew Christopher West (Chinese: 魏安; pinyin: Wèi Ān; born 31 March 1960) is an English Sinologist. His first works concerned Chinese novels of the Ming and Qing dynasties.  His study of Romance of the Three Kingdoms used a new approach to analyse the relationship among the various versions, extrapolating the original text of that novel.West compiled a catalogue for the Chinese-language library of the English missionary Robert Morrison containing 893 books representing in total some 10,000 string-bound fascicules.His subsequent work is in the minority languages of China, especially Khitan, Manchu, and Mongolian. He proposed an encoding scheme for the 'Phags-pa script, which was subsequently included in Unicode version 5.0.\nWest has also worked to encode gaming symbols and phonetic characters to the UCS, and has been working on encodings for Tangut and Jurchen.\n\n", "link_mentions": [{"page": "Affix", "response": ["In orthography, the terms for affixes may be used for the smaller elements of conjunct characters. For example, Maya glyphs are generally compounds of a main sign and smaller affixes joined at its margins. These are called prefixes, superfixes, postfixes, and subfixes according to their position to the left, on top, to the right, or at the bottom of the main glyph. A small glyph placed inside another is called an infix.Robert Sharer & Loa Traxler, 2006, The Ancient Maya, Stanford University Press.  Similar terminology is found with the conjunct consonants of the Indic alphabets. For example, the Tibetan alphabet utilizes prefix, suffix, superfix, and subfix consonant letters.Andrew West, \"Precomposed Tibetan Part 1 : BrdaRten\"  BabelStone, September 14, 2006"]}, {"page": "Romance of the Three Kingdoms", "response": ["* Andrew West, The Textual History of Sanguo Yanyi The Mao Zonggang Recension, at Sanguo Yanyi 三國演義. Based on the author's, Quest for the Urtext: The Textual Archaeology of The Three Kingdoms (PhD. Dissertation. Princeton University, 1993), and his 三國演義版本考 (Sanguo Yanyi Banben Kao Study of the Editions of The Romance of the Three Kingdoms) (Shanghai: Shanghai Guji Chubanshe, 1996)", "* Andrew West, The Textual History of Sanguo Yanyi: The Manchu Translation."]}, {"page": "Liubo", "response": ["* Andrew West, Pictures of funerary statuettes of Liubo Players"]}, {"page": "Caron", "response": ["The term caron is used in the official names of Unicode characters (e.g., \"LATIN CAPITAL LETTER Z WITH CARON\"). The Unicode Consortium explicitly states that the reason for this is unknown, but its earliest known use was in the United States Government Printing Office Style Manual of 1967, and it was later used in character sets such as DIN 31624 (1979), ISO 5426 (1980), ISO/IEC 6937 (1983) and ISO/IEC 8859-2 (1985).Andrew West, Antedating the Caron Its actual origin remains obscure, but some have suggested that it may derive from a fusion of caret and macron.Unicode.org Though this may be folk etymology, it is plausible, particularly in the absence of other suggestions."]}, {"page": "Simplified Chinese characters", "response": ["* Andrew West, Proposal to Encode Obsolete Simplified Chinese Characters"]}, {"page": "Luo Guanzhong", "response": ["* Andrew West, The Textual History of Sanguo Yanyi - Authorship"]}, {"page": "Yi people", "response": ["The Chinese government recognizes six mutually unintelligible Yi languages, from various branches of the Loloish family:Andrew West, The Yi People and Language"]}, {"page": "German orthography", "response": ["* In the past, long s (ſ) was used as well, as in English and many other European languages.Andrew West (2006): \"The Rules for Long S\"."]}, {"page": "Rime dictionary", "response": ["** electronic version (under construction), by Andrew West.", "** \"Untangling the Web of Characters\", by Andrew West, April 2010."]}, {"page": "Balti language", "response": ["* Andrew West, Tibetan Extensions 2 : Balti"]}, {"page": "Om mani padme hum", "response": ["* Andrew West, An article on Om Mani Padme Hum in different scripts"]}, {"page": "List of sinologists", "response": ["* Andrew West (born 1960)"]}, {"page": "Robert Morrison (missionary)", "response": ["*Andrew West, The Morrison Collection", "*Andrew West, A Chronology of Morrison's Life"]}, {"page": "Gari Ledyard", "response": ["* Andrew West. The Mĕnggŭ Zìyùn 蒙古字韻 \"Mongolian Letters arranged by Rhyme\""]}, {"page": "Spesmilo", "response": ["In Unicode, the character is assigned Proposed New Characters - Pipeline Table in version 5.2.Andrew West, BabelStone: What's new in Unicode 5.2?"]}, {"page": "Second round of simplified Chinese characters", "response": ["*Andrew West, Proposal to Encode Obsolete Simplified Chinese Characters (PDF version), section 4: Second Stage Simplified Characters (1977)"]}, {"page": "CJK Unified Ideographs", "response": ["The proposal of disunification of U+4039Andrew West and John Jenkins, proposal of disunification of U+4039 was accepted and the new character is encoded at U+9FC3 (鿃) in Unicode 5.1."]}, {"page": "Tangut script", "response": ["*Tangut script, by Andrew West"]}, {"page": "Help:Multilingual support", "response": ["* BabelStone Marchen, a font made by Andrew West", "* BabelStone Ogham Fonts, a series of free fonts for Ogham made by Andrew West", "* BabelStone Anglo-Saxon Runic fonts, a series of free font for Runes that are used in Frisian and Anglo-Saxon inscriptions from the 5th to 11th centuries, made by Andrew West."]}, {"page": "Luo Zhenyu", "response": ["He was also the first modern scholar to become interested in the Tangut script, and published a number of dissertations on the subject in 1912 and 1927.Andrew West, Tangut Coins "]}, {"page": "Gerard Clauson", "response": ["*2016. Gerard Clauson's Skeleton Tangut (Hsi Hsia) Dictionary: A Facsimile Edition. With an introduction by Imre Galambos. With Editorial notes and an Index by Andrew West. Prepared for publication by Michael Everson. Portlaoise: Evertype. ."]}, {"page": "Bopomofo", "response": ["|align=left|From the character . It represents the minimal vowel of  though it is not used after them in transcription.Michael Everson, H. W. Ho, Andrew West, \"Proposal to encode one Bopomofo character in the UCS\", SC2 WG2 N3179."]}, {"page": "Tibetan calligraphy", "response": ["* Andrew West, Phags-pa script"]}, {"page": "Origin of Hangul", "response": ["* Andrew West, The Měnggǔ Zìyùn 蒙古字韻 \"Mongolian Letters arranged by Rhyme\""]}]}}