{"wiki_id": "http://www.wikidata.org/entity/Q4756727", "itemLabel": "Andrew Cuerden", "itemDescription": "British ballroom dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Cuerden", "wikipedia_page": {"main": "Andrew Cuerden is a Ballroom & Latin American dancer. Born in Zimbabwe, and growing up in South Africa, Cuerden moved to England to further his dance career in 1996. Dancing with partner Hanna Haarala they reached 4th place in the UK amateur Latin rankings, before turning pro on 5 February 2004. He, along with Haarala were chosen to tutor a celebrity in the third series of Strictly Come Dancing - partnered with Jaye Jacobs, he was eliminated in week 2, but performed in many professional demonstrations.Previously ranked 25th in the world professional Latin rankings with professional partner Hanna Haarala, and 2nd in the Finnish Latin Rankings as well as reaching the Quarter Final of “The International Championships” Professional Latin 2006. Andrew and Hanna retired from competing in May 2008. They remain dance partners and now teach in and around London as well as perform their Latin Emotion Cabaret performance around the world.\nCuerden created Dance Savoir Faire Ltd in 2013. A company that offers Ballroom and Latin American Dance related events and services. \nCuerden is also a Yoga Alliance accredited Yoga and meditation coach which he combines with his dance services and events to facilitate holistic well-being.", "link_mentions": [{"page": "Strictly Come Dancing", "response": ["! Andrew Cuerden", "Over the years, many dancers from the show have formed both professional and personal partnerships, dancing together competitively, on the show, or both. Darren Bennett and Lilia Kopylova are married, as are James and Ola Jordan and Aljaž Škorjanec and Janette Manrara, who became engaged after joining the show in 2013 and were married in 2017. Matthew and Nicole Cutler are divorced but remain professional partners; Karen Hauer and Kevin Clifton were engaged when Clifton entered the show in 2013 and were married prior to the 2015 series, before divorcing in 2018, while Neil and Katya Jones entered the show as a married couple before separating in 2019. Anton Du Beke and Erin Boag have danced as a professional couple since 1997, while Vincent Simone and Flavia Cacace are former Argentine Tango world champions as a duo and have done multiple tours together. Brendan Cole and Camilla Dallerup danced together for many years, including a stint in the original series of Come Dancing; following their split in 2004, Cole and Katya Virshilas formed a professional partnership, before parting in November 2009. Other current and former professional partnerships featured on the show include Dallerup and Ian Waite, Paul Killick and Hanna Karttunen, Andrew Cuerden and Hanna Haarala, Brian Fortuna and Kristina Rihanoff, Rihanoff and Robin Windsor, Pasha Kovalev and Anya Garnis, siblings Kevin and Joanne Clifton, AJ Pritchard and Chloe Hewitt, and Gorka Márquez and Karen Hauer.", "In 2005, the third series commenced. Brendan Cole, Anton Du Beke, Erin Boag, Camilla Dallerup, Darren Bennett, Ian Waite and Lilia Kopylova returned from the second series. Nicole Cutler, Paul Killick and Hazel Newberry did not return. They were replaced by Karen Hardy, Hanna Haarala, Izabela Hannah, Andrew Cuerden and Matthew Cutler.", "|Andrew Cuerden", "This series introduced four new professional dancers: Flavia Cacace, James Jordan, Ola Jordan and Vincent Simone. Andrew Cuerden, Hanna Haarala and Izabela Hannah did not return to the programme. This series also saw the return of Nicole Cutler, who had taken part in series 2 but not in series 3."]}, {"page": "Jaye Jacobs", "response": ["In Autumn 2005, Jacobs appeared in the third series of Strictly Come Dancing, dancing with professional partner Andrew Cuerden. However, the couple were eliminated in the second week of the contest and finished in 11th place on the show."]}, {"page": "Hanna Haarala", "response": ["Hanna Haarala (born in Finland) is a professional Latin American dancer. She has represented Finland with Mikko Kaasalainen at the European and World Games. Her current professional partner is Andrew Cuerden. She competed in series 3 of the BBC's successful dance show Strictly Come Dancing in 2005, reaching seventh place with actor Will Thorp."]}]}}