{"wiki_id": "http://www.wikidata.org/entity/Q4766605", "itemLabel": "Ann Pasternak Slater", "itemDescription": "British scholar and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Pasternak_Slater", "wikipedia_page": {"main": "Dr Ann Pasternak Slater (born 3 August 1944) is a literary scholar and translator who was formerly a Fellow and Tutor at St Anne's College, Oxford.\nAnn Pasternak Slater is the daughter of Lydia Pasternak Slater (1902–1989), chemist, translator and poet who was the youngest sister of the poet, translator, and novelist Boris Pasternak (1890–1960), by her marriage to the British psychiatrist Eliot Slater (1904–1983). Her grandfather, the Russian Impressionist painter Leonid Pasternak, was a friend of Tolstoy's and illustrator for the novel Resurrection and several of Tolstoy's other works.\nPasternak Slater was educated at the Oxford High School for Girls in North Oxford. She joined St Anne's College, Oxford in 1976 and became the Hazel Eardley-Wilmot Fellow in English there.Pasternak Slater has written many books. She is involved with the Evelyn Waugh Society. She has written and lectured on her uncle Boris Pasternak's translations into Russian of Shakespeare plays. She has translated A Vanished Present, the memoirs of her uncle Alexander Pasternak (1893–1982), an architect, as well as Leo Tolstoy's The Death of Ivan Ilyich and Master and Man.  She prepared the fourth edition of the Everyman complete English works of George Herbert, revising the edition of C. A. Patrides.Ann Pasternak Slater is married to Craig Raine, an English poet and a Fellow of New College, Oxford, and they have four children. She retired in 2009.", "link_mentions": [{"page": "Craig Raine", "response": ["In 1972 he married Ann Pasternak Slater, a now retired fellow of St Anne's College, Oxford. They have one daughter and three sons. Moses Raine is a playwright and Nina Raine a director and playwright."]}, {"page": "Scoop (novel)", "response": ["* Ann Pasternak Slater: \"The hapless hack\", analysis in The Guardian, 25 October 2003"]}, {"page": "Oxford High School, England", "response": ["* Ann Pasternak Slater, academic"]}, {"page": "Areté", "response": ["The magazine  published contributions by a wide range of authors, including Ian McEwan, Patrick Marber, Tom Stoppard, and Julian Barnes. It has also promoted new authors such as Adam Thirlwell, Jeremy Noel-Tod, Sam Gardiner, Peter Morris, James Womack and Tom Welsford. Members of Craig Raine's immediate family such as his wife Ann Pasternak Slatere.g. Mauschwitz, issue 39, Winter 2012 and children Mosese.g. Jimmy Luck, issue 14, Autumn 2005. and Nina Rainee.g. Service, issue 26, Autumn 2008 were also frequent contributors."]}, {"page": "Park Town, Oxford", "response": ["* Leonid Pasternak (1862–1945), Russian painter, spent the last six years of his life living with his daughter Lydia Pasternak Slater (1902–1989), chemist and poet, at no. 20.Christopher J. Barnes, Boris Pasternak: A Literary Biography, Volume 2 (Cambridge University Press, 2004), p. 164 Leonid Pasternak was the father of Boris Pasternak, poet and author of Doctor Zhivago, but he remained in Russia until his death. Ann Pasternak Slater, academic and translator, is the daughter of Lydia Pasternak Slater."]}, {"page": "Richard Pevear and Larissa Volokhonsky", "response": ["Their 2010 translation of Boris Pasternak's Doctor Zhivago met with adverse criticism from Pasternak's niece, Ann Pasternak Slater, in a book review for The Guardian, but earned praise for \"powerful fidelity\" from Angela Livingstone, a Ph.D. and translator who has translated some of Pasternak's writings into English, in The Times Literary Supplement.Livingstone, Angela, (24/06/2011) Meaning Every Word of It. TLS."]}, {"page": "Nina Raine", "response": ["Nina Raine is an English theatre director and playwright, the only daughter of Craig Raine and Ann Pasternak Slater, and a grand niece of the Russian novelist Boris Pasternak."]}, {"page": "Evelyn Waugh bibliography", "response": ["|Appeared in The Pistol Troop Magazine, 1912. Published in Evelyn Waugh: The Complete Short Stories, Ann Pasternak Slater (ed.), Everyman's Library (David Campbell Publishers Ltd), London 1998"]}, {"page": "Lydia Pasternak Slater", "response": ["Pasternak sought exile in Britain, joining Eliot Trevor Oakeshott Slater, a psychiatrist she had met in Munich. The two married later in 1935 and settled in Oxford, where they were joined by Lydia's parents, then by her sister Josephine and her family.Eliot Slater, 'Autobiographical Sketch', in Man, Mind and Heredity, ed. J. Shields and I. I. Gottesman (The Johns Hopkins Press, 1971) They had two sons and two daughters, including Ann Pasternak Slater, before divorcing in 1946. Her new family responsibilities meant that Lydia Pasternak could not continue her work in biochemistry, but she went on to become a published poet in German, Russian, and English, and she translated the poems of her brother Boris, winner of the Nobel Prize in Literature for 1958, into English.George Butchard, Poet Lydia Pasternak steps out of the shadow  dated August 22, 2012, at rbth.ru, accessed 28 October 2012"]}, {"page": "Moses Raine", "response": ["Moses Raine (born 7 August 1984) is a playwright and screenwriter. He was born in Oxford and is the son of the poet and critic Craig Raine and Ann Pasternak Slater; he is also a grand nephew of the Russian novelist Boris Pasternak."]}]}}