{"wiki_id": "http://www.wikidata.org/entity/Q4768546", "itemLabel": "Anne Locke", "itemDescription": "English poet and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Locke", "wikipedia_page": {"main": "Anne Locke (Lock, Lok) (c.1533 – after 1590) was an English poet, translator and Calvinist religious figure. She was the first English author to publish a sonnet sequence, A Meditation of a Penitent Sinner (1560).", "link_mentions": [{"page": "Reformation", "response": ["Following the excommunication of Luther and condemnation of the Reformation by the Pope, the work and writings of John Calvin were influential in establishing a loose consensus among various churches in Switzerland, Scotland, Hungary, Germany and elsewhere. After the expulsion of its Bishop in 1526, and the unsuccessful attempts of the Berne reformer Guillaume (William) Farel, Calvin was asked to use the organisational skill he had gathered as a student of law to discipline the \"fallen city\" of Geneva. His \"Ordinances\" of 1541 involved a collaboration of Church affairs with the City council and consistory to bring morality to all areas of life. After the establishment of the Geneva academy in 1559, Geneva became the unofficial capital of the Protestant movement, providing refuge for Protestant exiles from all over Europe and educating them as Calvinist missionaries. These missionaries dispersed Calvinism widely, and formed the French Huguenots in Calvin's own lifetime and spread to Scotland under the leadership of John Knox in 1560. Anne Locke translated some of Calvin's writings to English around this time. The faith continued to spread after Calvin's death in 1563 and reached as far as Constantinople by the start of the 17th century."]}, {"page": "Penguin poetry anthologies", "response": ["Francesco Petrarca - Geoffrey Chaucer - Thomas Wyatt - Henry Howard, Earl of Surrey - Anne Locke - George Gascoigne - Edmund Spenser - Fulke Greville - Philip Sidney - Walter Ralegh - George Chapman - Henry Constable - Mark Alexander Boyd - Samuel Daniel - Michael Drayton - John Davies of Hereford - Charles Best - William Shakespeare - John Davies - John Donne - Ben Jonson - Lord Herbert of Cherbury - William Drummond of Hawthornden - Mary Wroth - Robert Herrick - George Herbert - John Milton - Charles Cotton - Thomas Gray - Charlotte Turner Smith - William Blake - Robert Burns - William Wordsworth - Samuel Taylor Coleridge - Robert Southey - Mary F. Johnson - Leigh Hunt - George Gordon, Lord Byron - Percy Bysshe Shelley - John Clare - John Keats - Hartley Coleridge - Thomas Lovell Beddoes - Elizabeth Barrett Browning - Henry Wadsworth Longfellow - Charles Tennyson Turner - Edgar Allan Poe - Alfred, Lord Tennyson - Robert Browning - Aubrey Thomas de Vere - George Eliot - Frederick Goddard Tuckerman - Matthew Arnold - George Meredith - Dante Gabriel Rossetti - Christina Rossetti - Algernon Charles Swinburne - Thomas Hardy - Robert Bridges - Gerard Manley Hopkins - Emma Lazarus - Oscar Wilde - W. B. Yeats - Ernest Dowson - Edwin Arlington Robinson - Trumbull Stickney - Rupert Brooke - Alice Dunbar-Nelson - Robert Frost - Edward Thomas - Ezra Pound - Elinor Wylie - Siegfried Sassoon - Robinson Jeffers - Marianne Moore - Edwin Muir - T. S. Eliot - John Crowe Ransom - Claude McKay - Archibald MacLeish - Edna St. Vincent Millay - Wilfred Owen - Dorothy Parker - E. E. Cummings - Jean Toomer - Robert Graves - Edmund Blunden - Louise Bogan - Hart Crane - Roy Campbell - Countee Cullen - Patrick Kavanagh - W. H. Auden - Louis MacNeice - Malcolm Lowry - Stephen Spender - Elizabeth Bishop - George Barker - Robert Hayden - John Berryman - Weldon Kees - Dylan Thomas - Margaret Walker - Gwendolyn Brooks - Charles Causley - Robert Lowell - William Meredith - Amy Clampitt - Howard Nemerov - Hayden Carruth - Marie Ponsot - Richard Wilbur - Philip Larkin - Anthony Hecht - Jane Cooper - Donald Justice - James K. Baxter - James Merrill - John Ashbery - W. S. Merwin - James Wright - Donald Hall - Thom Gunn - John Hollander - Adrienne Rich - Derek Walcott - Geoffrey Hill - Sylvia Plath - John Updike - Jean Valentine - Robert Mezey - Grace Schulman - Charles Wright - June Jordan - Judith Rodriguez - Frederick Seidel - John Fuller - Tony Harrison - Les Murray - Charles Simic - Frank Bidart - Seamus Heaney - Stanley Plumly - Billy Collins - Douglas Dunn - Marilyn Hacker - David Huddle - Charles Martin - William Matthews - Louise Glück - Ellen Bryant Voigt - Eavan Boland - J. D. McClatchy - Leon Stokesbury - Star Black - Marilyn Nelson - Bruce Smith - Molly Peacock - Hugh Seidman - Rachel Hadas - Denis Johnson - Sherod Santos - Julia Alvarez - Dana Gioia - Medbh McGuckian - Paul Muldoon - Rita Dove - Mark Jarman - Elizabeth Macklin - Tom Sleigh - Rosanna Warren - David Baker - Phillis Levin - John Burnside - Carol Ann Duffy - Robin Robertson - Karl Kirchwey - Deborah Laser - Jacqueline Osherow - James Lasdun - Kate Light - Joe Bolton - Rafael Campo - Mike Nelson - Daniel Gutstein - Beth Ann Fennelly - Jason Schneiderman"]}, {"page": "Women as theological figures", "response": ["*Anne Locke (1530 – ?), Calvinist poet"]}, {"page": "Lok", "response": ["* Anne Locke, Lock or Lok (1530–after 1590), English poet, translator and Calvinist"]}, {"page": "Women in the Protestant Reformation", "response": ["The Bible study and literacy promoted during the Reformation did have an effect on women's position, as secular women becoming publicly known as writers and authors, which had been uncommon before.  The Calvinist Anne Locke was a translator and poet, who published the first English sonnet sequence."]}, {"page": "Women in Christianity", "response": ["In 1569 Lutheran Magdalena Heymair became the first woman ever to have her writings listed on the Index Librorum Prohibitorum. She published a series of pedagogical writings for elementary-age teaching and also wrote poetry.  Calvinist Anne Locke was a translator and poet who published the first English sonnet sequence. In 1590, Christine of Hesse published the Lutheran psalm-book Geistliche Psalmen und Lieder."]}, {"page": "Pamphilia to Amphilanthus", "response": ["Pamphilia to Amphilanthus is a sonnet sequence by the English Renaissance poet Lady Mary Wroth, first published as part of The Countess of Montgomery's Urania in 1621, but subsequently published separately. It is the second known sonnet sequence by a woman writer in England (the first was by Anne Locke).  The poems are strongly influenced by the sonnet sequence Astrophel and Stella (1580) penned by her uncle Sir Philip Sidney. Like Sidney's sequence, Wroth's sonnets passed among her friends and acquaintances in manuscript form before they were published in 1621.An exhibition at the Folger Shakespeare Library, including Lady Mary Wroth's Manuscripts In Wroth's sequence, she upends Petrarchan tropes by making the unattainable object of love male (as opposed to female)."]}, {"page": "Edward Dering (priest)", "response": ["Shortly after this Dering's health began to give way. In 1572 he married Anne Locke, who nursed him as he succumbed to tuberculosis.Francis J. Bremer, Tom Webster, Puritans and Puritanism in Europe and America: A Comprehensive Encyclopedia (2006), p. 74. He died 26 June 1576 at Thoby, in the parish of Mountnessing, Essex."]}, {"page": "Anne Lok", "response": ["#REDIRECT Anne Locke"]}, {"page": "Anne Lock", "response": ["#REDIRECT Anne Locke"]}, {"page": "Anne Lock Prowse", "response": ["#REDIRECT Anne Locke"]}, {"page": "Anne Vaughan Lock", "response": ["#REDIRECT Anne Locke"]}, {"page": "Ann Lok", "response": ["#REDIRECT Anne Locke"]}, {"page": "Women in Church history", "response": ["In 1569 Lutheran Magdalena Heymair became the first woman ever to have her writings listed on the Index Librorum Prohibitorum. She published a series of pedagogical writings for elementary-age teaching and also wrote poetry.  Calvinist Anne Locke was a translator and poet who published the first English sonnet sequence. In 1590, Christine of Hesse published the Lutheran psalm-book Geistliche Psalmen und Lieder."]}, {"page": "Anne Dowriche", "response": ["The writer Anne Locke was a fellow Protestant reformer who was connected to Dowriche through intermarried family members.White 2005, p. 12. Like Dowriche, Anne Locke was a female poet who also wrote in support of the Protestant faith. Some scholars have noted similarities between Locke’s poem entitled \"The Necessitie and Benefite of Affliction,\" and Dowriche’s \"Verses Written by a Gentlewoman, Upon the Jaylor’s Conversion\".White 2005, p. 14. Both poems advocate Protestantism and encourage the reader to repent and follow God. Some scholars speculate that, given the women’s geographic and ideological proximity, Dowriche and Locke may have directly impacted one another’s writing.White 2005, p. 13."]}]}}