{"wiki_id": "http://www.wikidata.org/entity/Q4762488", "itemLabel": "Angela Little", "itemDescription": "education specialist", "wikipedia_url": "https://en.wikipedia.org/wiki/Angela_Little_(academic)", "wikipedia_page": {"main": "Angela W. Little is Professor Emerita at the Institute of Education, University of London. She is known for her work in primary education policy and practice in developing countries as well as education planning, program evaluation and assessment. In particular she has focussed in seven main areas:\n\nEducation for All and the Millennium Development Goals\nMultigrade education\nGlobalisation and education\nQualifications, motivation and aspirations\nEducation in Sri Lanka\nEducation in China\nEducation and developmentShe has been adviser to various governmental, multilateral and non-profit organisations on education policy, planning and evaluation, including SIDA, the World Bank, DFID, UNESCO, ILO, the Ford Foundation, UNICEF, AusAid and others. Her country experience includes work in Sri Lanka, Ghana, Nigeria, Ethiopia, Zimbabwe, India, Bangladesh, Malaysia, Japan and China.\nLittle was Professor of Education and International Development at the Institute of Education, University of London between 1987 and 2010. She was previously a Fellow of the Institute of Development Studies at the University of Sussex. Little is Honorary professor at Zhejiang University and Flinders University, advisory professor at East China Normal University and Honorary Fellow at the University of Sussex.She is a founding member of the London International Development Centre. She chairs the International advisory group for the Young Lives longitudinal study of 12,000 children in Ethiopia, India, Peru and Vietnam. She is a member of the Academy of Social Sciences and trustee of the United Kingdom Forum on International Education and Training.Little is the author and/or editor of numerous books and monographs, six special journal issues, many journal articles, book chapters and reports. She has been involved in the direction of two films – The Diploma Disease (with Ronald Dore, released 1982) and The Qualification Chase (1996)", "link_mentions": [{"page": "Douglas, Isle of Man", "response": ["* Angela Little (born 1949 in Douglas) Professor Emerita at the Institute of Education, University of London works in primary education policy and practice in developing countries"]}, {"page": "Angela (given name)", "response": ["* Angela Little (academic) (born 1949), British education and development academic", "* Angela Little (actress) (born 1972), American model and actress"]}, {"page": "List of people associated with Goldsmiths, University of London", "response": ["*Angela Little (academic)"]}, {"page": "Angela Little", "response": ["Angela Little may refer to:", "*Angela Little (academic) (born 1949), British education and development academic", "*Angela Little (actress) (born 1972), American model and actress"]}]}}