{"wiki_id": "http://www.wikidata.org/entity/Q4768380", "itemLabel": "Anne Gilchrist", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Gilchrist_(writer)", "wikipedia_page": {"main": "Anne Gilchrist (née Burrows; 25 February 1828 – 29 November 1885) was an English writer, best known for her connection to American poet Walt Whitman.", "link_mentions": [{"page": "Walt Whitman", "response": ["Part of Whitman's role at the Attorney General's office was interviewing former Confederate soldiers for Presidential pardons. \"There are real characters among them\", he later wrote, \"and you know I have a fancy for anything out of the ordinary.\"Loving, 293. In August 1866, he took a month off to prepare a new edition of Leaves of Grass which would not be published until 1867 after difficulty in finding a publisher.Kaplan, 318–319. He hoped it would be its last edition.Loving, 314. In February 1868, Poems of Walt Whitman was published in England thanks to the influence of William Michael Rossetti,Callow, 326. with minor changes that Whitman reluctantly approved.Kaplan, 324. The edition became popular in England, especially with endorsements from the highly respected writer Anne Gilchrist.Callow, 329. Another edition of Leaves of Grass was issued in 1871, the same year it was mistakenly reported that its author died in a railroad accident.Loving, 331. As Whitman's international fame increased, he remained at the attorney general's office until January 1872.Reynolds, 464. He spent much of 1872 caring for his mother, who was now nearly eighty and struggling with arthritis.Kaplan, 340. He also traveled and was invited to Dartmouth College to give the commencement address on June 26, 1872.Loving, 341."]}, {"page": "1885 in literature", "response": ["*November 29 – Anne Gilchrist, English-born American critic and biographer (emphysema, born 1828)"]}, {"page": "1863 in literature", "response": ["*Alexander Gilchrist (posthumously, edited by Anne Gilchrist) – Life of William Blake, \"Pictor Ignotus\"; with selections from his poems and other writings "]}, {"page": "Haslemere", "response": ["* Anne Gilchrist (1828-1885) – writer, lived in Shottermill from 1861 to 1871"]}, {"page": "1863 in art", "response": ["* Alexander Gilchrist's Life of William Blake, \"Pictor Ignotus\" is published in London, edited posthumously by Anne Gilchrist."]}, {"page": "William Michael Rossetti", "response": ["Anne Gilchrist, who became one of the first to write about Whitman, first read his poetry from Rossetti's edition, and Rossetti helped initiate their correspondence."]}, {"page": "Percy Gilchrist", "response": ["Gilchrist was born in Lyme Regis, Dorset, the son of Alexander and Anne Gilchrist and studied at Felsted and the Royal School of Mines. He caught scarlet fever from his sister and was very ill. His father then caught the disease and died in November 1861."]}, {"page": "Old MacDonald Had a Farm", "response": ["Several versions were collected in England in around the turn of the twentieth century by folklorists, such as one called \"The Farmyard Song\" taken from a John Lloyd of Manchester in the 1880s by Anne Gilchrist, and another called \"Father's Wood I O\" collected in 1906 in Scotter, Lincolnshire by Percy Grainger; both of the original transcriptions of these versions are available via the Vaughan Williams Memorial Library website."]}, {"page": "Pace Egg play", "response": ["Pace Egging songs are categorised as number 614 and 610 in the Roud Folk Song Index. Percy Grainger collected a version in Kirkby Lonsdale, Westmoreland in 1905, and Anne Gilchrist collected one in nearby Casterton in 1909. In the early 1930s, the American folklorist James Madison Carpenter recorded a version from a man named Herbert James Blades in Hunton, Yorkshire, who had learnt the song 40 years prior from a Thomas Thompson (born c.1810); the recording is available on the Vaughan Williams Memorial Library website."]}, {"page": "Anne Gilchrist", "response": ["Anne Gilchrist may refer to:", "*Anne Gilchrist (writer) (1828–1885), English writer ", "*Anne Gilchrist (collector) (1863–1954), British folk-song collector"]}, {"page": "Life of William Blake", "response": ["The book was largely written by Alexander Gilchrist, who had spent many years compiling the material and interviewing Blake's surviving friends. However, Gilchrist had left it incomplete at his sudden death from scarlet fever in 1861. The work was published two years later, having been completed by his widow Anne Gilchrist with help from Dante Gabriel Rossetti and William Michael Rossetti.", "Anne Gilchrist appended a memoir of her husband, Alexander, to the second volume."]}, {"page": "Roberts Brothers", "response": ["Messrs. Roberts Brothers (1857–1898) were bookbinders and publishers in 19th-century Boston, Massachusetts. Established in 1857 by Austin J. Roberts,Boston Directory. 1857, 1858, 1861, 1862. John F. Roberts,Boston Directory. 1857, 1858. and Lewis A. Roberts,Boston Directory. 1857, 1858, 1861, 1862, 1868. Lewis A. Roberts worked as a bookbinder in Boston prior to the establishment of the Roberts Brothers firm; cf. Boston Almanac, 1853. the firm began publishing around the early 1860s. American authors included: Louisa May Alcott, Susan Coolidge, Emily Dickinson, Maud Howe Elliott, Louise Imogen Guiney, Julia Ward Howe, Helen Hunt Jackson, Abigail May Alcott Nieriker. British and European authors included: Berthold Auerbach, Caroline Bauer,  Mathilde Blind,  Juliana Horatia Ewing, Anne Gilchrist, David Gray, Philip Gilbert Hamerton, Jean Ingelow, Vernon Lee, William Morris, Silvio Pellico, Adelaide Ristori, A. Mary F. Robinson, George Sand, Charlotte Mary Yonge, Helen Zimmern.", "* Anne Gilchrist. Mary Lamb. 1883."]}, {"page": "Elizabeth Porter Gould", "response": ["In 1900, Gould published a study of Anne Gilchrist, Whitman's friend and fellow writer. Anne Gilchrist and Walt Whitman presents an idealized view of Gilchrist and her relationship with Whitman, but it was carefully researched and one of the first books to provide a substantive account of Gilchrist's critical abilities and her importance in Whitman's life.", "* Anne Gilchrist and Walt Whitman, 1900"]}]}}