{"wiki_id": "http://www.wikidata.org/entity/Q4761475", "itemLabel": "Andy Whitmore", "itemDescription": "Worked at Lloyds Bank at 16 for 4 years before turning professional as a session keyboard player", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Whitmore", "wikipedia_page": {"main": "Andy Whitmore is a British keyboard player and record producer from London, UK. He works from his own studio Greystoke studios in Ealing, West London. Whitmore has produced 14 UK top-ten hits including \"Flava\" by Peter Andre and \"I've Got a Little Something for You\" by MN8.  He also produced the 2000 album Love Science 101 by Phoenix J.", "link_mentions": [{"page": "EMS VCS 3", "response": ["*Andy Whitmore (Greystoke Studios)"]}, {"page": "List of Moog synthesizer players", "response": ["*Andy Whitmore Record Producer / Keyboard Player, London UK"]}, {"page": "EMS Synthi AKS", "response": ["*Andy Whitmore (Greystoke Studios)"]}, {"page": "Roland Jupiter-4", "response": ["*Andy Whitmore (Greystoke Studios)"]}, {"page": "Show You the Way to Go", "response": ["Australian singer Dannii Minogue's version of \"Show You the Way to Go\" was produced by Bruce Forest and Andy Whitmore and was the first single released from her second album, Get into You. In 1992 it appeared on the NME charity album Ruby Trax, before being remixed and released as a single, reaching No. 30 on the UK Singles Chart in August of that year."]}, {"page": "Ladies' Night (song)", "response": ["In 2003, American R&B band Kool & the Gang asked English girl group Atomic Kitten to re-record \"Ladies Night\" for their The Hits: Reloaded tribute album. The band subsequently asked them if they could include it on their then-untitled third album which they eventually named after the song in honor of the collaboration following Kool's approval. The re-recording was produced by Khalis Bayyana and Andy Whitmore; Andy Whitmore is credited as a co-producer, while Ash Howes and Martin Harrington served as additional prodcuers. \"Ladies Night\" was released as the lead single from The Hits: Reloaded and served as the second single from Atomic Kitten's Ladies Night album. The song peaked at number three in Spain, and reached number eight on the UK Singles Chart, outpeaking the original version of the track.", "* Andy Whitmore – co-producer, programming, additional keyboards"]}, {"page": "Oberheim OB-8", "response": ["*Andy Whitmore (Greystoke Studios)"]}, {"page": "Jump to the Beat", "response": ["Australian singer Dannii Minogue released a cover of \"Jump to the Beat\" in 1991. Her version was produced by Les Adams, Emma Freilich (L.A. Mix) and Andy Whitmore and received a mixed reception from music critics. It was released as the third single from her debut album, Love and Kisses in the third quarter of 1991 and reached the top-five in Ireland and the top-ten in the United Kingdom, and became Minogue's second top ten single. In Australia, the song did not perform as well, charting outside the top-forty. In North America, the single was released as Minogue's debut release in November 1991; however, it failed to generate much interest outside of the United Kingdom and Australia.", "*Les Adams, Emma Freilich, Andy Whitmore – production"]}, {"page": "Andy Park (Mr. Christmas)", "response": ["In 2005, he released a single entitled \"It's Christmas Every Day\", with a video featuring Mike Read and produced by Andy Whitmore."]}, {"page": "Roland MKS-80", "response": ["* Andy Whitmore (Record Producer / Keyboard Player, London UK)"]}, {"page": "Greystoke Studios", "response": ["#REDIRECT Andy Whitmore"]}, {"page": "Mytown", "response": ["Shortly after the band were signed to Universal Records, they began harmonizing and writing songs together. Their debut single, \"Do It Like This\", was released in Ireland in March 1997, to moderate success. They then began writing their debut album with several well-known producers, including Teddy Riley, Rick Nowels, Billy Steinberg, Wanya Morris of Boyz II Men and Andy Whitmore. Apart from the two cover versions, the entire set of their debut album was co-written by Sheehan, Daly and O'Donoghue, and Eamonn Maguire served as executive producer. In 1999, the band began promoting the album, releasing the single \"Body Bumpin'\" in the United States, the second single \"Now That I Found You\" in the United States and Australia, and \"Party All Night\", which was released worldwide. Although the album was planned for release worldwide, both the British and Irish releases never saw the light of day due to an internal struggle within Universal Records in the US.  When Cherry Entertainment was dropped as a label on Universal, Mytown were released from their contract and the band decided to pursue their own individual paths. Years later, Sheehan and O'Donoghue met drummer Glen Power, and The Script was born."]}, {"page": "Greystoke studios", "response": ["#REDIRECT Andy Whitmore"]}, {"page": "L.A. Mix", "response": ["In 1990, the first of three singles from L.A. Mix's second album was released. \"Coming Back for More\", also the title track of the new album, was released as a single. The song featured vocals from Franseco (Leslie George), and charted at #50. In 1991, \"Mysteries of Love\", featuring Beverlei Brown on lead vocals, Marcus C on rap and co-production from Andy Whitmore, was released and made #46. Their final single, \"We Shouldn't Hold Hands in the Dark\", also featured vocals from Franseco but also from Juliet Roberts and charted at #69.  L.A. Mix also produced two UK top 40 singles (one of which was a top ten hit) for Dannii Minogue's 1991 album, Love and Kisses; \"I Don't Wanna Take This Pain\" and \"Jump to the Beat\". They also produced work for Krush vocalist Ruth Joy, on her 1992 MCA album, Pride and Joy."]}, {"page": "Alex Loves...", "response": ["*Andy Whitmore – guitars; keyboards; programming", "*Andy Whitmore – keyboards; programming", "*Andy Whitmore – keyboards; programming", "*Andy Whitmore – keyboards; programming", "*Andy Whitmore – keyboards; programming", "*Andy Whitmore – guitars; keyboards; programming", "*Andy Whitmore – guitars; keyboards; programming", "*Andy Whitmore – keyboards; programming", "*Andy Whitmore – keyboards; programming"]}, {"page": "Five Questions: The New Journey", "response": ["* Andy Whitmore - bass guitar", "* Andy Whitmore - strings"]}, {"page": "Oberheim OB-1", "response": ["*Andy Whitmore (Greystoke Studio)"]}]}}