{"wiki_id": "http://www.wikidata.org/entity/Q4768511", "itemLabel": "Anne Knight", "itemDescription": "British suffragist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Knight", "wikipedia_page": {"main": "Anne Knight (2 November 1786 – 4 November 1862) was an English social reformer, abolitionist and pioneer of feminism. She attended the 1840 Anti-Slavery convention, where the need to improve women's rights became obvious. In 1847 Knight produced what is thought to be the first leaflet for women's suffrage and formed the first UK women's suffrage organisation in Sheffield in 1851.", "link_mentions": [{"page": "Chelmsford", "response": ["*Anne Knight (born 1786), anti-slavery and feminist activist."]}, {"page": "List of feminists", "response": ["|1700–1799||data-sort-value=\"Knight, Anne\"|Anne Knight ||United Kingdom||1786||1862||Social reformer; pioneer of feminism||"]}, {"page": "Lady Byron", "response": ["Byron never sought custody of Ada, though he sent for both of them shortly before his death in Greece on 19 April 1824. Lady Byron's obsession with him did not end with his death. Ultimately her relationship with him defined her life, though she committed herself to social causes, such as prison reform and the abolition of slavery. In furtherance of the latter, Lady Byron attended the 1840 World Anti-Slavery Convention, where she was one of the few women included in its commemorative painting.The Anti-Slavery Society Convention, 1840, Benjamin Robert Haydon, accessed 19 July 2008The others were Elizabeth Pease, Amelia Opie, Anne Knight, Mary Anne Rawson, Mrs John Beaumont, Elizabeth Tredgold, Thomas Clarkson's daughter Mary and right at the back Lucretia Mott."]}, {"page": "History of feminism", "response": ["German women were involved in the Vormärz, a prelude to the 1848 revolution. In Italy, Clara Maffei, Cristina Trivulzio Belgiojoso, and Ester Martini Currica were politically active in the events leading up to 1848. In Britain, interest in suffrage emerged from the writings of Wheeler and Thompson in the 1820s, and from Reid, Taylor, and Anne Knight in the 1840s. While New Zealand was the first sovereign state where women won the right to vote (1893), they did not win the right to stand in elections until later. The Australian State of South Australia was the first sovereign state in the world to officially grant full suffrage to women (in 1894)."]}, {"page": "William Allen Miller", "response": ["Miller was born in Ipswich, Suffolk and educated at Ackworth School and King's College London. He was related to William Allen and first cousin to the leading suffragist Anne Knight."]}, {"page": "Slavery Abolition Act 1833", "response": ["In 1823, the Anti-Slavery Society was founded in London. Members included Joseph Sturge, Thomas Clarkson, William Wilberforce, Henry Brougham, Thomas Fowell Buxton, Elizabeth Heyrick, Mary Lloyd, Jane Smeal, Elizabeth Pease, and Anne Knight.Slavery and abolition. Oxford University Press Jamaican mixed-race campaigners such as Louis Celeste Lecesne and Richard Hill were also members of the Anti-Slavery Society."]}, {"page": "List of suffragists and suffragettes", "response": ["* Anne Knight (1786–1862) – social reformer, pioneer of feminism, early suffragette and pamphleteer"]}, {"page": "Society for Effecting the Abolition of the Slave Trade", "response": ["Despite the little influence they carried, many female abolitionists made a big impact on the abolition of the slave trade. An important campaigner was Anne Knight. She was born into a Quaker family in Essex and took active roles in the anti-slavery campaigns. Knight formed the Chelmsford Female Anti-Slavery Society. She also toured France, giving lectures on the immorality of slavery."]}, {"page": "Marion Kirkland Reid", "response": ["Marion was the only Scotswoman present at the World Anti-Slavery Convention an event in London during the month of June 1840, Kirkland and other British spectators, including Anne Knight, witnessed some American woman delegates were unable to take part in the convention. There was a large debate after which Kirkland met the leader of the American woman delegates, Lucretia Mott. This event, and an article on \"Women's rights and duties\" in the Edinburgh Review of 1841, may have inspired Kirkland's book A Plea for Women, written in 1843. Anne Knight sent a copy of this book to Lucretia Mott with her highest recommendation, and its influence grew in America. A Plea for Women is most likely the first work in Britain or the USA that gave importance to gaining both civil and political rights for women. The book was especially significant in the early years of the women's suffrage movement in the USA. A Plea for Woman was, as Susanne Ferguson points out in the preface to the modern reprint of the first edition, \"a landmark book as the first to be written by a woman, for women, specifically arguing that the possession of the vote is crucial in ending discrimination\" against women in education and employment, and to gain equal rights under the law."]}, {"page": "1862 in the United Kingdom", "response": ["* 4 November – Anne Knight, social reformer (b. 1786)"]}, {"page": "Anne Knight", "response": ["Anne Knight (2 November 1786 – 4 November 1862)Edward H. Milligan: Knight, Anne (1786–1862). Oxford Dictionary of National Biography (Oxford: OUP, 2004) Retrieved 4 November 2010. was an English social reformer, abolitionist and pioneer of feminism. She attended the 1840 Anti-Slavery convention, where the need to improve women's rights became obvious. In 1847 Knight produced what is thought to be the first leaflet for women's suffrage and formed the first UK women's suffrage organisation in Sheffield in 1851.", "Anne Knight was born in Chelmsford in 1786. She the daughter of William Knight (1756–1814), a Chelmsford grocer, and his wife Priscilla Allen (1753–1829). Her parents’ families were both Quakers and several of their members took an active part in the temperance and anti-slavery movements.", "Anne Knight never married. She died at Waldersbach, near Strasbourg, France, on 4 November 1862, at the house of the grandson of Jean-Frédéric Oberlin (1740–1820), a philanthropist whose work she revered.", "Some of the new student accommodation at the University of Essex, Anne Knight House, is named after her. So also is Anne Knight House, opened in January 2005 by the Colchester Quaker Housing Association a hostel for young people. A Grade II listed building opposite the railway station in Chelmsford, her birthplace, used as a Quaker Meeting House from 1823 until the 1950s, was named Anne Knight Building in her honour. It formed part of the Anglia Ruskin University central campus until this was relocated in 2008. The building was subsequently vacant until 2015 when it enjoyed a brief period of use as a cultural project before being turned into a family-owned chain restaurant."]}, {"page": "Isaac Ironside", "response": ["In 1846, Ironside was elected to Sheffield Town Council representing Ecclesall, where he founded the Central Democratic Association to raise socialist and Chartist demands. By 1849, this grouping had grown to 22 members and was able to force the creation of a health committee and the construction of a model farm on broadly Owenite principles at Hollow Meadows. Utilising Joshua Toulmin Smith's localist ideas, he set up a system of \"wardmote\" committees where any local citizen could influence council policy. With their support, he ensured that Sheffield's streets were paved and underground sewers were laid during the 1850s. He also supported women's suffrage, and encouraged Anne Knight to found the Sheffield Female Political Association.Jane Rendall, \"Glossary \", Women's Politics in Britain 1780-1870: Claiming Citizenship."]}, {"page": "Sheffield Female Political Association", "response": ["The group was founded in February 1851 by several Sheffield women who were also active in the Chartist movement, led by Anne Kent and Anne Knight.Anne Knight (1786-1862)   It also gained the support of Isaac Ironside's local Central Democratic Association.Jane Rendall, Glossary: Women's Politics in Britain 1780-1870: Claiming Citizenship "]}, {"page": "Free Villages", "response": ["One village was named after Anne Knight, a female Quaker abolitionist. Pickering and Tyrell said that naming was \"a brave initiative that honoured women in an active, albeit gendered role as reformers at a time when custom frowned on their participation in the public world\".Contested Sites by Pickering and Tyrell, 2004"]}, {"page": "Knight (surname)", "response": ["* Anne Knight (1786–1862), British-born author, social reformer and pioneer of feminism", "* Anne Knight (children's writer) (1792–1860), British children's writer and educationalist", "* Anne Knight, pseudonym of American author Rhondi A. Vilott Salsitz"]}, {"page": "List of women's rights activists", "response": ["*Anne Knight (1786–1862) – feminist and social reformer"]}, {"page": "1786 in Great Britain", "response": ["* 2 November – Anne Knight, social reformer (died 1862)"]}, {"page": "Waldersbach", "response": ["* Anne Knight, an early British feminist and abolitionist, died here in 1862."]}, {"page": "Elizabeth Heyrick", "response": ["In 1823, Heyrick joined the new Anti-Slavery Society, the Society for the Mitigation and Gradual Abolition of Slavery Throughout the British Dominions. Other founder members included Mary Lloyd, Jane Smeal, Elizabeth Pease, Joseph Sturge, Thomas Clarkson, William Wilberforce, Henry Brougham, Thomas Fowell Buxton and Anne Knight.Slavery and abolition. Oxford University Press. [dead link - needs investigation]"]}, {"page": "Elizabeth Pease Nichol", "response": ["Before the convention opened, Sturge, the British organiser, told the six women delegates they would not be allowed to participate. Leading English Anti-Slavery members had rebuked him for thinking this \"insane innovation, this woman-intruding delusion,\" should be allowed.  At the time, women attendees were required to sit in segregated areas out of sight of the male delegates. The matter became contentious because some of the male delegates from the United States supporting the women's participation. They included George Bradburn, Wendell Phillips, James Mott, William Adam, Isaac Winslow, J. P. Miller and Henry B. Stanton. William Lloyd Garrison, who did not arrive until 17 June,Frances H. Bradburn, A Memorial of George Bradburn, 1883 refused to take his seat until women had equality in seating.Harriet H. Robinson, Massachusetts in the woman suffrage movement. A general, political, legal and legislative history from 1774, to 1881, accessed 19 July 2006 Henry Grew, an American Baptist spoke in favour of the men's right to exclude women, despite his daughter's being one of those affected. The result was that the American women had to join British women observers, such as Lady Byron, Anne Knight and Pease, in a segregated area.", "Pease attended with Anne Knight and several other friends, but it was only Knight and Pease of their circle who were among the women notables chosen for the painting. Other women included were Amelia Opie, Baroness Byron, Mary Anne Rawson, Mrs John Beaumont, Elizabeth Tredgold, Mary Clarkson and, at the back, Lucretia Mott."]}]}}