{"wiki_id": "http://www.wikidata.org/entity/Q4768345", "itemLabel": "Anne Foy", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Foy", "wikipedia_page": {"main": "Anne Foy (born 23 January\n1986 in Langold, Worksop) is a children's television presenter for the BBC. Until March 2008, she worked for the CBBC Channel and on CBBC. She can currently be heard as the voiceover on the music channel 4Music.", "link_mentions": [{"page": "Worksop", "response": ["*Anne Foy (b.1986), former BBC Children's TV presenter"]}, {"page": "Sam Nixon", "response": ["Nixon married former CBBC presenter Anne Foy on 23 December 2012. They welcomed their first child, a daughter, Meridon, born 4 October 2014. Sam announced on 13 April that he became a father to their second child, a son, Doyle."]}, {"page": "Wizadora", "response": ["In 2003, Entertainment Rights produced a 9-minute pilot for a proposed rebooted series for Channel 5's Milkshake! strand with Anne Foy as Wizadora. Although a new version of the original theme tune was used and the overall look of the set generally in keeping with the earlier version, characters were given varying makeovers, with none of the original models being used, and several new minor characters introduced. CGI and Chroma key effects featured heavily. The proposed new series was not picked up, reportedly due to it being considered too costly."]}, {"page": "Current TV", "response": ["*Anne Foy"]}, {"page": "SMart", "response": ["|| Anne Foy "]}, {"page": "21st World Scout Jamboree", "response": ["The entire UK contingent arrived one day before the rest of the world, and had a party on the Tropical Hub stage with performances from Liberty X and Lemar, along with Radio 1 DJ Jason King and CBBC TV presenter Anne Foy. Peter Duncan, UK Chief Scout, was also on the stage."]}, {"page": "Bad Penny (TV series)", "response": ["It starred CBBC presenter Anne Foy as the happy and sweet, yet troubled, Penny Dreadful, who was constantly trying to thwart the surreal and crooked dealings of her wayward family. Penny's dim-witted and henpecked father, Pa, was played by comedian Graham Fellows a.k.a. John Shuttleworth."]}, {"page": "Stitch Up!", "response": ["Notable pranks included Anne Foy pretending to be a news reader, appearing on TV screens in an electrical store, revealing embarrassing stories about a victim, who was watching the screens in horror whilst shopping with his family.  Another surreal, ongoing sketch involved actors in knights' costumes and other strange outfits, fighting and doing bizarre things in a busy street, to the confusion of shoppers.  Calum Callaghan played a boy who invited people to play card games with him in a train station and always accused them of cheating.  Marvin Benoit played street magician 'David Plain' - a spoof of the famous magician David Blaine.  Simon Kane played Remote Controlled Kid in all three series.  He would enter a shop and ask a member of staff confusing and totally random questions.", "The show originally starred Marvin Benoit, Calum Callaghan, Anne Foy and Simon Kane, but new presenters, Adam Selkirk-Brown and Sita Thomas, later joined for the 2004 series."]}, {"page": "Anne foy", "response": ["#REDIRECT Anne Foy "]}, {"page": "Roman Mysteries (TV series)", "response": ["On 22 May 2007, after just two episodes, Anne Foy announced on CBBC on BBC One that the show has been postponed due to recent events in the news and would return later in the year on CBBC on BBC One. Since \"The Pirates of Pompeii\" was about children being kidnapped, the postponement was most likely due to the then recent disappearance of Madeleine McCann. On 19 June the series began broadcasting again from the beginning."]}, {"page": "CBBC (TV channel)", "response": ["CBBC has had a relatively similar presentation to that of its strand counterpart. The logo has consistently remained the same until 2016 as the service; green coloured blobs at the beginning of its life and the green and white logo from September 2007 until now. The logo today is all different colours unlike the last one. CBBC has mainly utilised presenters from the main service, with a few presenters appearing mostly on the new channel; Gemma Hunt and Anne Foy being notable examples and appearing consistently until August 2007. At the beginning of September 2007-2001, along with the relaunch, the same presenters of CBBC would also feature on CBBC on BBC One and Two."]}, {"page": "List of CBBC presenters", "response": ["| Anne Foy || 2003–08 ||"]}, {"page": "List of continuity announcers in the United Kingdom", "response": ["| Toby Anstis, Zoë Ball, Angellica Bell, Ana Boulter, Warrick-Brownlow Pike (as Oucho T. Cactus), Simeon Courtie, Andy Crane, Josie D'Arby, Liam Dolan, Adrian Dickson, Matt Edmondson, Adam Fleming, Philippa Forrester, Anne Foy,Jennifer Gay, Simon Grant, Dani Harmer, London Hughes, Jake Humphrey, Gemma Hunt, Richard McCourt, Sophie McDonnell, Sam Nixon, Kirsten O'Brien, Simon Parkin, Andi Peters, Ed Petrie, Mark Rhodes, Philip Schofield,Andrew Hayden-Smith, Iain Stirling, Michael Underwood, Holly Walsh, Steve Wilson, Dominic Wood, Lauren Layfield, Katie Thistleton, Karim Zeroual"]}, {"page": "Foy (name)", "response": ["*Anne Foy (born 1986), British TV presenter"]}]}}