{"wiki_id": "http://www.wikidata.org/entity/Q476785", "itemLabel": "Stevie Chalmers", "itemDescription": "Scottish footballer (1935-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stevie_Chalmers", "wikipedia_page": {"main": "Thomas Stephen Chalmers (26 December 1935 – 29 April 2019) was a Scottish footballer who played as a centre-forward and spent the majority of his career with Celtic. He is the club's fifth-highest goalscorer with 236 goals and is considered one of their greatest players. He is particularly known for scoring the winning goal in the 1967 European Cup Final against Inter Milan. Chalmers later played for Morton and Partick Thistle. He also represented Scotland five times in international matches.", "link_mentions": [{"page": "Celtic F.C.", "response": ["* Stevie Chalmers"]}, {"page": "Troon F.C.", "response": ["Brazil played Scotland at Hampden Park on June 25, 1966, as part of the South American side’s World Cup warm-up schedule. The game finished 1-1 with Stevie Chalmers scoring for Scotland in the first minute before Servilio equalised for Brazil on 15 minutes.", "European Cup winners John Clark, Bobby Murdoch, Stevie Chalmers and Lou Macari were in the Celtic ranks that day, which the Hoops triumphed in 7-2."]}, {"page": "Lisbon Lions", "response": ["Alessandro Mazzola opened the scoring for Inter with a 7th-minute penalty after Jim Craig had brought down Renato Cappellini. The Italians then retreated into their famous 11-man defence. Inter did not win a single corner and forced Celtic goalkeeper Ronnie Simpson to make only two saves. Celtic had two shots off the crossbar, and 39 other attempts on goal, 13 of which were saved by Italian goalkeeper Giuliano Sarti, seven were blocked or deflected, and 19 were off-target. Craig made amends for his penalty mistake on 63 minutes, when he laid off the ball for Tommy Gemmell to fire home for the Celtic equaliser. With 83 minutes on the clock, Gemmell was allowed space, and he played the ball to Bobby Murdoch, whose long-range shot was deflected by Stevie Chalmers past Sarti into the net.", "#Stevie Chalmers "]}, {"page": "Jock Stein", "response": ["Stein was very confident entering the 1966–67 season, saying to his players that he believed \"we could win everything\". Celtic won the first Old Firm game of the season 2–0, scoring both goals in the first five minutes. The team went on a long unbeaten run that was finally ended by a 3–2 defeat by Dundee United on 31 December. Stein surprised some observers by signing forward Willie Wallace from Hearts in December, when the team was already scoring freely and had strikers Stevie Chalmers and Joe McBride at his disposal. As it happened, McBride soon afterwards suffered a knee injury that required surgery."]}]}}