{"wiki_id": "http://www.wikidata.org/entity/Q4761065", "itemLabel": "Andy Morris", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Morris_(boxer)", "wikipedia_page": {"main": "Andy Morris (born 10 March 1983) is a British former boxer who competed professionally from 2003 to 2010. He held the British featherweight title from 2005 to 2006 and challenged twice for the vacant Commonwealth super featherweight title in 2010. As an amateur, he won a bronze medal in the lightweight division at the 2002 Commonwealth Games in Manchester, England.", "link_mentions": [{"page": "England at the 2002 Commonwealth Games", "response": [":Andy Morris, lightweight 60 kg"]}, {"page": "Andrew Morris", "response": ["Andrew or Andy Morris may refer to:", "*Andy Morris (boxer) (born 1983), British boxer", "*Andy Morris (footballer) (born 1967), English football player for Chesterfield"]}, {"page": "List of British featherweight boxing champions", "response": ["|align=left | Andy Morris"]}, {"page": "Rendall Munroe", "response": ["Munroe had his first professional fight in September 2003, when he stopped journeyman Joel Viney in the third round at the Harvey Hadden Leisure Center in Nottingham. After 10 wins he challenged Andy Morris for the British featherweight title and lost a 12-round decision in Edinburgh. Munroe's first title win came three fights later when he beat Marc Callaghan for the vacant English super bantamweight title.Rendall Munroe pro record In an interview for Boxing News, Munroe said that he faced the toughest man to date so far during his career in this period, the Kenyan David Kiilu.  Munroe said \"He taught me a boxing lesson but I came through with grit and determination\"Boxing News 5/9/8 60 Second interview"]}, {"page": "Ricky Burns", "response": ["Burns success in the ring had elevated him to the number one ranking with the WBO's rankings. Burns' promoter Frank Warren tried to negotiate a match with the reigning champion Roman Martínez. The bout with the Puerto Rican champion had been subject to numerous delays with the fight scheduled for both Scotland and Puerto Rico at various intervals only for the fight never to materialise and for Martinez to make a voluntary defence of his title instead. The uncertainty for Burns meant that a proposed British title contest against Gary Sykes never happened with Sykes winning the title against Burns replacement Andy Morris and defending against the man Burns had defeated in his last Commonwealth title defence Kevin O'Hara. Finally after almost a year of frustration Burns re-entered the ring on 15 May 2010, on the undercard of Kevin Mitchell's world title shot against Michael Katsidis at the Boleyn Ground. Burns continued his winning streak and kept ticking over with an eight-round win over journeyman and former foe Youssef Al Hamidi. Burns claimed after the fight that he hoped the fight with Román Martinez would materialise around July and that it would be in Glasgow."]}, {"page": "John Simpson (boxer)", "response": ["On 5 November 2005, exactly one-year after his last title challenge, Simpson fought Andy Morris for the vacant British featherweight title. Simpson was defeated by a unanimous decision with scores of 118–111, 117–111 and 118–110. Following this fight, Simpson lost to Stephen Foster Jr. via a unanimous points decision in a challenge for the WBU featherweight title.", "On 9 December 2006, Simpson fought Andy Morris in his third challenge for the British featherweight title. Simpson claimed the title after stopping Morris in the 5th round. The fight was stopped after referee John Keane deemed that a cut over Morris' left eye was too severe to allow the fight to continue. Morris' trainer Bob Shannon has argued that his fighter should have been allowed to continue.", "On 7 September 2007, Simpson fought Andy Morris for a third time and defeated him via a seventh-round knockout to defend his British title. After the fight, Simpson said \"I hope I can go on to bigger and better things now. Hopefully now I can go on to European and World titles, I started boxing to win a World title and that is my ambition\".", "|Win || align=left| Andy Morris", "|Win || align=left| Andy Morris", "|Loss || align=left| Andy Morris"]}, {"page": "Rocky Dean", "response": ["On 5 March 2005 Dean fought for the Southern Area Featherweight title defeating Mickey Coveney over 10 rounds at the Goresbrook Leisure Centre in Dagenham.  The win set up a shot at the vacant English title in his next fight only for Dean to lose for the sixth time in his career to Andy Morris, a man who would go on to claim the full British belt.  On 18 September 2005 Dean fought and defeated novice boxer Gary Davies with a fourth round stoppage win.  Davis became the fourth boxer Dean had fought that would go on to become a full British champion.  Dean finished the year by traveling to the Ukraine to fight Andrey Isaev only to lose in the 12th round of his challenge for the WBF International title."]}, {"page": "Gary Sykes", "response": ["On 29 May 2009 Sykes faced his biggest challenge so far against Anthony Crolla in an eliminator for British super featherweight Title, winning over the 10 round distance. Two more victories followed against Ibrar Riyaz and Dean Mills before getting the chance to fight for the title on 5 March 2010.  The fight, against Andy Morris a former British featherweight champion, resulted in a close points win over 12 rounds at the Huddersfield Leisure Centre.Boxrec News | Gary Sykes vs Andy Morris . News.boxrec.com (2010-03-06). Retrieved on 2012-11-19.  Morris, who also won a Commonwealth games bronze medal as an amateur, had stepped in at last notice following the withdrawal of original opponent Ricky Burns.BBC sport | Gary Sykes wins British super featherweight title. BBC News (2010-03-06). Retrieved on 2012-11-19.  On 28 May 2010 Sykes made a successful first defence of his belt beating Kevin O'Hara again over 12 rounds at the Huddersfield Leisure Centre.Gary Sykes v Kevin O'Hara. Secondsout.com (2002-03-14). Retrieved on 2012-11-19.", "|style=\"text-align:left;\"| Andy Morris Jr."]}, {"page": "Anthony Crolla", "response": ["Crolla begun 2009 on 14 March with a repeat victory over former opponent Carl Allen and then on 29 May took part in his most significant bout to date, a British title eliminator at the Fenton Manor Sports Complex in Stoke. The fight resulted in a second career defeat for Crolla as he lost a ten-round points decision to Gary Sykes. On 25 September, he returned to ring and scored another victory over an opponent he had already met, Jon Baguley and then on 27 November met and defeated the former world champion Michael Brodie who had returned to the ring following a long lay off.Crolla back on track. Boxingnewsonline.net. Retrieved on 2012-11-19. He continued his winning run in 2010 with victories over Jason Nesbitt, Sid Razak and Chris Riley before on 2 October challenging Andy Morris for the English super featherweight title. The fight at the De Vere Whites hotel in Bolton resulted in a 7th round stoppage for Crolla and a first career title.", "|style=\"text-align:left;\"| Andy Morris"]}, {"page": "Andrew Morris (boxer)", "response": ["#REDIRECT Andy Morris (boxer)"]}, {"page": "England Boxing National Amateur Championships Lightweight Champions", "response": ["| 2002 || Andy Morris || West Wythenshawe ABC "]}]}}