{"wiki_id": "http://www.wikidata.org/entity/Q4764200", "itemLabel": "Angus McKie", "itemDescription": "artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_McKie", "wikipedia_page": {"main": "Angus McKie (born July 1951) is a British artist who has worked as a colourist in the comics industry.\nHe is best known as an English science fiction illustrator whose work appeared on the covers of numerous science fiction paperback novels in the mid-1970s and 1980s, as well as in Stewart Cowley's Terran Trade Authority series of illustrated books. His illustrations often present highly detailed spacecraft against vividly colored backgrounds and high-tech constructions as demonstrated by his pioneering work on The Dome: Ground Zero for DC Comics imprint Helix in 1998. Like Peter Elson, Tony Roberts, Chris Foss and some other artists of the period, he influenced an entire generation of science fiction illustrators and concept artists. This influence may be seen in the look of for the Homeworld video game.In 1993 he wrote and drew the first 2 parts of a science fiction comic published by Dark Horse entitled \"The Blue Lily\", based on Dave Weir's short story. As of 2011, McKie was reportedly working on the last 2 parts of the work in his spare time. He also wrote and illustrated a story entitled \"So Beautiful and So Dangerous\" for Heavy Metal magazine, which later became a segment in the film Heavy Metal.", "link_mentions": [{"page": "List of science fiction and fantasy artists", "response": ["*Angus McKie (born 1951)"]}, {"page": "Heavy Metal (film)", "response": ["Based on the comic of the same name by Angus McKie.", "* Angus McKie – writer"]}, {"page": "Bryan Talbot", "response": ["*Neil Gaiman’s Mr. Hero the Newmatic Man (Issue #1,  6 pages pencils and inks, written by Rick Veitch, coloured by Angus McKie, 1995)", "*Neil Gaiman’s Mr. Hero the Newmatic Man (Issue #2,  5 pages, inked by Angus McKie (1995, Tekno Comix Written by Rick Veitch, coloured by Angus McKie, 1995)", "*Neil Gaiman’s Wheel of Worlds One shot, 11 pages (1995, Tekno Comix Written by Rick Veitch, coloured by Angus McKie,)"]}, {"page": "Valérian and Laureline", "response": [" The influence of Valérian has been noticed in such strips as  (by Víctor Mora and Carlos Giménez) and Gigantik (by Mora and José Maria Cardona). The visual style of Valérian has also influenced some American comics artists, notably Walt Simonson and Gil Kane. Sometimes the impact of Valérian has gone beyond mere influence; following a complaint by Mézières, the artist Angus McKie admitted that several panels of his strip So Beautiful and So Dangerous were copied from Ambassador of the Shadows."]}, {"page": "Brian Bolland", "response": ["In 1972, Bolland attended the British Comic Art Convention at the Waverley Hotel in London, and met \"a lot of the people who were key in the comics scene of the time,\" including Dez Skinn, Nick Landau, Richard Burton, Angus McKie and – crucially – Dave Gibbons.Bolland, \"1970s – Powerman\" in The Art of Brian Bolland, p. 37 Bolland and Gibbons became firm friends. After finishing his college course, Bolland was hit with \"the stark reality of unemployment\" and on the advice of GibbonsSalisbury, p. 13 joined art agency Bardon Press Features. \"A few two-page strips\" for D.C. Thomson resulted, but Bolland would refer to this period as his \"lowest time.\" Bardon did however produce a client called Pikin which was \"planning a bi-weekly comic about an African superhero,\" Powerman, which was to be sold in Nigeria. Gibbons and Bolland were to draw alternate issues (Bolland's first issue was Powerman No. 2.), and Bolland recalls that \"soon Dave had drawn his entire story and I had produced just a few pages.\" This knowledge – \"that Dave could produce a page a day... and that I was going to have to do the same\" – was a shock, but proved to be \"the very best kind of training ground.\" With comics purportedly being new to Nigeria, Bolland recalls this work being created specifically to be \"really simple; six panels on a page and [all] the panels had to be numbered.\" Not only was this work \"[t]he best way to learn the simple rules of comic book storytelling,\" but \"better still, it was going someplace where nobody I knew could see it.\" He \"drew around 300 pages of that very straightforward, simple-to-follow work, and I guess the storytelling flowed naturally from that.\"Salisbury, p. 12 Even so, he \"was always struggling to get the last eight or ten pages finished,\" and was occasionally helped by friends, both from his \"Norwich School of Art days,\" Gibbons and future-2000 AD and League of Extraordinary Gentlemen artist Kevin O'Neill.Bolland, \"The 1970s – Help from Friends\" in The Art of Brian Bolland, p. 42"]}, {"page": "Dave Gibbons", "response": ["*The Dome: Ground Zero (w, with Angus McKie, graphic novel, tpb, 64 pages, Helix, 1998, )"]}, {"page": "Helix (comics)", "response": ["| Angus McKie"]}, {"page": "Jean-Claude Mézières", "response": ["Mézières' arrival on the French comics scene with Valérian was contemporaneous with the debuts of other notable French science-fiction strips including Luc Orient by Greg and Eddy Paape and Lone Sloane by Philippe Druillet. The success of these strips eventually led to the creation of Métal Hurlant, the highly influential French comics magazine dedicated to science fiction. Mézières' influence has been noticed in such strips as  (by Víctor Mora and Carlos Giménez) and Gigantik (by Mora and José Maria Cardona). His visual style also influenced some American comics artists, notably Walt Simonson and Gil Kane. On occasion this went beyond mere influence – following a complaint by Mézières, the artist Angus McKie admitted that several panels of his strip So Beautiful and So Dangerous were copied from the Valérian album Ambassador of the Shadows."]}, {"page": "Hypothesis (album)", "response": ["The cover artwork for Hypothesis is by Angus McKie, and is merely a \"borrowed\" illustration he drew for a series of novels by SF author Brian Stableford, featuring the spacecraft Hooded Swan, mentioned in the books."]}, {"page": "United Kingdom Comic Art Convention", "response": ["| 20-21 Sept. 1986 || University of London Union ||Bill Marks, Seth, Dean Motter, David Lloyd, Frank Miller, Lynn Varley, Steve Leialoha, Lew Stringer, Glen Fabry, Gil Kane, John Bolton, Karen Berger, Alan Moore, Neil Gaiman, Jenette Kahn, Dave Gibbons, Kevin O'Neill, Brett Ewins, Carl Potts, Alan Grant, Barry Windsor-Smith, Bryan Talbot, Bill Sienkiewicz, and Chris Claremont || Cover by Alan Davis & Dave Gibbons; interior art by Bryan Talbot,  Greg Theakston, Alan Davis, Paul Neary, Ron Smith, Angus McKie, Ian Gibson, Phil Elliott, Kevin O’Neill, Leigh Baulch, Lew Stringer, Mike Collins, Mark Farmer, Dicky Howett, John Bolton, Barry Windsor-Smith, Kev Hopgood, John Higgins, Brian Bolland, Brendan McCarthy, John Ridgway, Hunt Emerson, Graham Higgins, Cam Kennedy, Eddie Campbell, David Pugh, and Mike Matthews ||", "| [Early] Sept. 1991 || London  ||  Murphy Anderson and Dan Jurgens || Cover by Simon Bisley; interior work by Paul Johnson, David Pugh, Philip Bond, Martin Hand, Mark Buckingham, Paul Grist, Craig Dixon, Mike Gibas, Arthur Ranson, Woodrow Phoenix, Mike Collins, Sean Phillips, Hunt Emerson, Lew Stringer, Phil Elliott, Leigh Baulch, Barry Kitson, Duncan Fegredo, Angus McKie, Murphy Anderson, Peter Doherty, Kevin O'Neill, Bob Lynch, Davey Jones, Darryl Cunningham, John Higgins, Simon Harrison, John McCrea, Rian Hughes, Kev F. Sutherland, Gary Erskine, Martin Griffith, Art Wetherell, Davy Francis, Ed McHenry, Shane Oakley, Alan Davis, Martin Nodell, and Lee Sullivan  ||", "| 14–15 Mar. 1992 || Glasgow City Halls, Candleriggs, Glasgow || Peter DavidDavid, Peter A. \"But I Digress: Glasgow Comic Art Convention, Part 2,\" PeterDavid.net (24 April 1992). and Peter Bagge, as well as participants in the \"Deadline Mini-Tour\": Nick Abadzis, Rachel Ball, Philip Bond, Glyn Dillon, D'Israeli, Evan Dorkin, Jamie Hewlett, Alan Martin, Shaky 2000, and Si Spencer || Cover by Jamie Hewlett featuring Fireball; interior art by Evan Dorkin, Colin MacNeil, Peter Bagge, Darick Robertson, Dan Brereton, Angus McKie, Hunt Emerson, David Pugh, Jon Beeston, Paul Johnson, Cam Kennedy, Davy Francis, Paul Grist, Woodrow Phoenix, Philip Bond, John McCrea, Gary Erskine, Tony O'Donnell, Sean Phillips, Dave Alexander, Gerry Dolan, Kev F. Sutherland, Charlie Adlard, Rian Hughes, Padam Singh, Guy Lawley, Paul Peart, Craig Dixon, Bryan Talbot ||", "| 24–25 Mar. 1993 || Glasgow City Halls, Glasgow || Jim Shooter, David Pugh, John Ostrander, Colin MacNeil, Cam Kennedy, Dave Alexander, John Beeston || Cover by Steve Pugh featuring Animal Man; interior art by Tim Perkins, Davy Francis, Mark Buckingham, Bryan Talbot, Philip Bond, John McCrea, Sean Phillips, Phil Elliott, Bob Lynch, Duncan Fegredo, Hunt Emerson, David Pugh, Jim Baikie, Kev F. Sutherland, Charlie Adlard, D'Israeli, Rian Hughes, Stu Jennett, David Lloyd, Frank Quitely, Brett Ewins, Doug Braithwaite, Kevin O'Neill, Tony O'Donnell, Cam Kennedy, John Ostrander, Woodrow Phoenix, Angus McKie, Carl Critchlow, Colin MacNeil, Dave Alexander, Simon Jacob, Paul Johnson || Admission price for both days: £15;Black, Ian. \"Zap! Kraak! Pow! Comic culture has landed in Glasgow,\" The Times (18 April 1993). presentation of the UK Comic Art AwardsER. \"International Miscellanea: 1993 UK Comic Art Awards,\" The Comics Journal #161 (August 1993), p. 40."]}, {"page": "Vader's Quest", "response": ["Vader's Quest  is a four-issue comic book miniseries set in the Star Wars Expanded Universe, written by Darko Macan and drawn by Dave Gibbons and Angus McKie. Published by Dark Horse Comics, the original four issues appeared in February through May 1999; a trade paperback reprinting all four was released in December of that same year."]}, {"page": "Angus mckie", "response": ["#REDIRECT Angus McKie "]}, {"page": "Alan Moore: Portrait of an Extraordinary Gentleman", "response": ["Other contributors and artists include: Adam Hughes, Ashley Wood, Ben Templesmith, Brad Meltzer, Bryan Talbot, Carla Speed McNeil, Dave Sim, Eduardo Risso, Eric Shanower, Gabriele Dell'Otto, Howard Chaykin, Iain Sinclair, Jean-Marc and Randy Lofficier, Jeff Smith, Jim Lee, Jimmy Palmiotti, Len Wein, Mark Buckingham, Mark Millar, Metaphrog, Art (Ferran) Brooks, Michael Avon Oeming, Michael Moorcock, Neil Gaiman, Pat Mills, Rich Johnston, Sam Kieth, Sean Phillips, Angus McKie, Steve Niles, Terry Gilliam, Trina Robbins, Walt Simonson and Will Eisner."]}, {"page": "The Dome: Ground Zero", "response": ["The Dome: Ground Zero, is a one-shot graphic novel published in 1998 under the short-lived DC Comics imprint, Helix. Written and laid out by Dave Gibbons and illustrated by Angus McKie, The Dome used computer-rendered graphics to augment the latter's illustrations. Despite suffering by its association with the poorly received Helix line, The Dome won praise both for the high quality of its art and for its well-constructed storyline set in the south Pacific waters of a recognizably contemporary Earth environment, replete with the conflicting ideologies of US techno-military forces and Christian fundamentalist eco-warriors.", "As part of the creative process for The Dome, Angus McKie employed some illustrative techniques which were considered novel at the time, involving a computer-driven process from start to finish. After Gibbons finished the script he produced page layouts using Photoshop which he then provided to McKie who combined them with the letters and panel borders using Freehand. Painted 3D images were rendered and then opened using Photoshop for reworking and finally pasted onto the letters and panel borders. The result was to produce computer generated characters which were considered (at the time) more lifelike and preserved the recognizable biomechanical attributes of human anatomy without sacrificing texture and detail."]}, {"page": "Martha Washington Goes to War", "response": ["Gibbons won the Eisner Award for \"Best Artist/Penciller/Inker or Penciller/Inker Team\" in 1995 for Martha Washington Goes to War, and Angus McKie won for \"Best Colorist/Coloring\".https://www.comic-con.org/awards/1990s-recipients 1991-1999"]}, {"page": "Lee Harris (South African writer)", "response": ["The Chester P Hakenbush trilogy was republished in one volume in 1982. A third edition was published in 1999, titled Bryan Talbot's Brainstorm: The Complete Chester P Hakenbush and Other Underground Classics. Talbot has become a renowned graphic novelist, creator of The Adventures of Luther Arkwright, The Tale of One Bad Rat, and Grandville. Brainstorm Fantasy Comix published one issue in 1977, taking a new direction. It included work by Brian Bolland, Hunt Emerson, Angus McKie, and the first published work by John Higgins."]}, {"page": "List of Eisner Award winners", "response": ["*1995 Angus McKie, Martha Washington goes to War (Dark Horse)"]}, {"page": "McKie", "response": ["*Angus McKie, English illustrator"]}, {"page": "No Man's Sky", "response": ["The limited edition retail version includes an art book and a comic written by Dave Gibbons, James Swallow and Angus McKie; Sony previously expressed interest in companion fiction for the game's release, and Murray had engaged with Gibbons on developing such a work. Swallow also helped with some of the in-game narrative. A limited-run \"Explorer's Edition\" for the Windows version, published by iam8bit, included a miniature replica of one of the game's spacecraft alongside other materials. Sony released a limited edition bundle with No Man's Sky and a custom face plate for the PlayStation 4 in Europe."]}]}}