{"wiki_id": "http://www.wikidata.org/entity/Q4767095", "itemLabel": "Anna Hume", "itemDescription": "Scottish translator, poet, writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_Hume", "wikipedia_page": {"main": "Anna Hume (floruit 1644) was a Scottish translator, poet and writer.\nHume was the daughter of Jacobean poet and historian David Hume of Godscroft. She superintended the posthumous publication of her father's History of the House and Race of Douglas and Angus, published The Triumphs of Love, Chastitie, Death: translated out of Petrarch by Mrs. Anna Hume, and is also said to have translated many of her father's Latin poems.\nControversy surrounded her publication of History of the House and Race of Douglas and Angus, as William Douglas, 11th Earl of Angus, and first marquis of Douglas, was dissatisfied with Hume's work. Douglas consulted Drummond of Hawthornden, who admitted various defects and extravagant views in Hume. Hawthornden, however, did not fight to stop the publication of the work, as be believed that the suppression of the book would ruin the gentlewoman, 'who hath ventured, she says, her whole fortune' on its publication. Drummond of Hawthornden, after observing Anna Hume's commendatory verses, declared himself unworthy of 'the blazon of so pregnant and rare a wit.’", "link_mentions": [{"page": "List of English-language poets", "response": ["*Anna Hume (fl. 1644, S)"]}, {"page": "Scottish literature", "response": ["The tradition of neo-Latin poetry reached its fruition with the publication of the anthology of the Deliciae Poetarum Scotorum (1637), published in Amsterdam by Arthur Johnston (c. 1579–1641) and Sir John Scott of Scotstarvet (1585–1670) and containing work by the major Scottish practitioners since Buchanan. This period was marked by the work of the first named female Scottish poets.T. van Heijnsbergen, \"Culture: 7 Renaissance and Reformation (1460–1660): literature\", in M. Lynch, ed., The Oxford Companion to Scottish History (Oxford: Oxford University Press, 2001), , pp. 127–8. Elizabeth Melville's (f. 1585–1630) Ane Godlie Dream (1603) was a popular religious allegory and the first book published by a woman in Scotland.I. Mortimer, The Time Traveller's Guide to Elizabethan England (Random House, 2012), , p. 70. Anna Hume, daughter of David Hume of Godscroft, adapted Petrarch's Triumphs as Triumphs of Love: Chastitie: Death (1644)."]}, {"page": "Mary Oxlie", "response": ["She along with other women such as Anna Hume, may have been part of the Hawthornden literary circle or coterie: Phillips terms her \"a friend of the Poet Drummond\" (p. 259)."]}, {"page": "David Hume of Godscroft", "response": ["Hume's History of the House and Race of Douglas and Angus was printed at Edinburgh in 1644 by Evan Tyler, the king's printer. He is thought to have finished the history between 1625 and 1630 (around the year of his death). The political message of the work includes the idea that direct action against \"evil advisers\" of a king is permissible to defend customary rights; and even against the king. The title-pages of early copies vary, with some having the title A Generall History of Scotland, together with a particular History of the Houses of Douglas and Angus. Confusion arose when the editor, Anna Hume, encountered opposition of Angus, who resented the use which Hume had made of some of the material in the family archives. ", "Hume married in 1594 Barbara Johnston, widow of his friend James Haldane. They had five children. His daughter Anna Hume was known as an editor, and his son  ( 1630) as a mathematician."]}, {"page": "Literature in early modern Scotland", "response": ["The tradition of neo-Latin poetry reached its fruition with the publication of the anthology of the Deliciae Poetarum Scotorum (1637), published in Amsterdam by Arthur Johnston (c.1579–1641) and Sir John Scott of Scotstarvet (1585–1670) and containing work by the major Scottish practitioners since Buchanan. This period was marked by the work of the first named female Scottish poets.T. van Heijnsbergen, \"Culture: 7 Renaissance and Reformation (1460–1660): literature\", in M. Lynch, ed., The Oxford Companion to Scottish History (Oxford: Oxford University Press, 2001), , pp. 127–8. Elizabeth Melville's (f. 1585–1630) Ane Godlie Dream (1603) was a popular religious allegory and the first book published by a woman in Scotland.I. Mortimer, The Time Traveller's Guide to Elizabethan England (Random House, 2012), , p. 70. Anna Hume, daughter of David Hume of Godscroft, adapted Petrarch's Triumphs as Triumphs of Love: Chastitie: Death (1644)."]}, {"page": "Poetry of Scotland", "response": ["The tradition of neo-Latin poetry reached its fruition with the anthology of the Deliciae Poetarum Scotorum (1637), published in Amsterdam by Arthur Johnston (c.1579–1641) and Sir John Scott of Scotstarvet (1585–1670) and containing work by the major Scottish practitioners since Buchanan. This period was marked by the work of female Scottish poets.T. van Heijnsbergen, \"Culture: 7 Renaissance and Reformation (1460–1660): literature\", in M. Lynch, ed., The Oxford Companion to Scottish History (Oxford: Oxford University Press, 2001), , pp. 127–8. Elizabeth Melville's (f. 1585–1630) Ane Godlie Dream (1603) was a popular religious allegory and the first book published by a woman in Scotland.I. Mortimer, The Time Traveller's Guide to Elizabethan England (Random House, 2012), , p. 70. Anna Hume, daughter of David Hume of Godscroft, adapted Petrarch's Triumphs as Triumphs of Love: Chastitie: Death (1644)."]}, {"page": "List of women translators", "response": ["* Anna Hume (c.1600–c.1650)"]}]}}