{"wiki_id": "http://www.wikidata.org/entity/Q4764226", "itemLabel": "Angus Purden", "itemDescription": "British television presenter from Scotland", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_Purden", "wikipedia_page": {"main": "Angus Purden (born circa 1974) is a Scottish television presenter. A former Mr. Scotland and model, he wrote for a Scottish  newspaper and is now best known for presenting do-it-yourself and Scottish lottery shows. One of the regular presenters for the BBC series Cash in the Attic since 2002, he also appeared in programmes such as Channel 4's Room For Improvement (2004-2010) and Ghost Towns (2005–2006) for Living TV, and he was a street prize presenter and public face of People's Postcode Lottery. In April 2010, Angus became the main host of STV gameshow Postcode Challenge.", "link_mentions": [{"page": "List of Scots", "response": ["* Angus Purden (born 1974)"]}, {"page": "List of gay, lesbian or bisexual people: P–Q", "response": ["| Angus Purden"]}, {"page": "Cash in the Attic", "response": ["During its run on the BBC the show was hosted by presenters including Angela Rippon, Jennie Bond, Gloria Hunniford, Lorne Spicer, Ben Fogle, Chris Hollins, Aled Jones, Alistair Appleton, Angus Purden, Jules Hudson. In 2021, Hudson, already a presenter of a number of Channel 5 shows based at Cannon Hall Farm (such as Winter on the Farm),Channel 5 listings: Radio Times, page 72 in the 4-10 December 2021 issue was hired to present a new series of Cash in the Attic alongside Chris Kamara, a series which will be ready for broadcast on Channel 5 in the second half of 2022. "]}, {"page": "Derek Acorah's Ghost Towns", "response": ["The first series aired every Monday night at 9pm on LivingTV between 7 November and 12 December. The show was hosted by Danniella Westbrook and Angus Purden. After each episode aired, a \"behind the scenes\" show \"Ghost Towns Revealed\" aired which followed the team as they filmed the episode.", "The second series aired every Tuesday night at 9pm on LivingTV between 31 January 2006 and 4 April 2006. Once again, Danniella Westbrook and Angus Purden joined Derek on the show.", "In early 2006, Ghost Towns broadcast two live events. The events would each last for three nights from 9pm until midnight. The studio host for the show was Liz Bonnin. Danniella Westbrook was unable to take part in the first live event and was replaced by Emmerdale actress Nicola Wheeler. Angus Purden was present for both live events and Danniella Westbrook returned for the second live event. Two companion shows aired during the live events. \"Early Doors\" aired 1 hour before the investigation began which featured interviews with the team. \"Revealed\" allowed viewers to call into the studio to discuss the nights events. This show aired for 1 hour after the live event.", "A book based on the investigation of the locations of series one is available. It was written by Derek Acorah and has contributions from Danniella Westbrook and Angus Purden."]}, {"page": "Postcode Challenge", "response": ["Postcode Challenge is a Scottish television game show presented originally by Carol Smillie and then by Angus Purden, produced by STV Studios for broadcast on STV.", "The format changed for the Angus Purden era, with teams of four and each player having to pull their weight on the 90-second general knowledge round. The questions stick with each player till they get one right and there are minus points for wrong answers."]}, {"page": "People's Postcode Lottery", "response": ["From 2008 to 2010, People's Postcode Lottery sponsored Postcode Challenge, a quiz show hosted by Angus Purden on STV."]}, {"page": "The Hour (2009 TV programme)", "response": ["*Angus Purden (2010)"]}, {"page": "Laura Hamilton", "response": ["On 24 March 2012, Hamilton appeared on Winter Wipeout's first celebrity special. She failed to progress to the \"Wipeout Zone\" final, after being eliminated in 4th place at the 'Winter Blunderland' stage. On 13 December 2012, Hamilton appeared on Celebrity Eggheads alongside Alistair Appleton, Simon O'Brien, Ed Hall and Angus Purden in the \"house and home experts\" team."]}]}}