{"wiki_id": "http://www.wikidata.org/entity/Q4769283", "itemLabel": "Annie Fortescue Harrison", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Annie_Fortescue_Harrison", "wikipedia_page": {"main": "Annie Jessie Fortescue Harrison (30 December 1848 – 12 February 1944), also known as Annie, Lady Hill and Lady Arthur Hill, was an English composer of songs and piano pieces.She was born in Calcutta, British India, the daughter of James Fortescue Harrison, MP of Kilmarnock. In 1865, they moved to Crawley Down, Sussex, where her father built a mansion called Down Park. In 1877, she married Lord Arthur Hill, who had been a widower. They had one daughter.\nTwo of her piano instrumentals are:\n\"The Elfin Waltzes\"\n\"Our Favourite Galop\"Two of her operettas are:\n\nThe Ferry Girl\nThe Lost HusbandHer most popular song was \"In the Gloaming\" (1877), with lyrics by Meta Orred.", "link_mentions": [{"page": "1898 in music", "response": ["* \"In The Gloaming\" (w. Meta Orred m. Annie Fortescue Harrison)  –  Roger Harding on Berliner Gramophone"]}, {"page": "List of women composers by birth date", "response": ["* Annie Fortescue Harrison (1851–1944)"]}, {"page": "Meta Orred", "response": ["Meta Caroline Orred (1845 or 1846, in Edinkillie, Elginshire, Scotland – 23 May 1925, in Bournemouth) was an author and poet. Though born in Scotland, she lived most of her life in England, where she produced her literature and poetry. The lyric for the 1877 popular song \"In the Gloaming\", with music by Annie Fortescue Harrison, comes from Poems."]}, {"page": "Lady Arthur Hill", "response": ["#REDIRECT Annie Fortescue Harrison"]}, {"page": "Annie Harrison", "response": ["* Annie Fortescue Harrison (1850 or 1851–1944), English composer"]}, {"page": "1944 in British music", "response": ["*12 February – Annie Fortescue Harrison, songwriter and composer of piano music (born 1850 or 1851)"]}, {"page": "In the Gloaming (song)", "response": ["\"In the Gloaming\" is an 1877 British song composed by Annie Fortescue Harrison with lyrics taken from a poem by Meta Orred. Orred's poem (of the same title as the song) appeared in her 1874 book Poems. \"Gloaming\" is a regional dialect term of Scots origin denoting \"twilight\"."]}, {"page": "List of Private Passions episodes (1995–1999)", "response": ["|Annie Fortescue Harrison"]}]}}