{"wiki_id": "http://www.wikidata.org/entity/Q4760483", "itemLabel": "Andy Byford", "itemDescription": "British civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Byford", "wikipedia_page": {"main": "Andy Byford (born 1965) is a British civic employee whose career has been defined by serving in chief positions in a number of top public transport corporations around the world. \nHe has been chief operating officer for RailCorp in New South Wales, Australia, and worked in a number of managerial positions with London Underground. \nHis six-year career as the chief executive officer of the Toronto Transit Commission (TTC) led to several changes in the system, including service improvements and modernizations. He served as the president of the New York City Transit Authority (NYCTA) from 2018 to 2020. Shortly after his resignation from the NYCTA, Byford was appointed as the commissioner of Transport for London (TfL).\n\n", "link_mentions": [{"page": "Toronto Transit Commission", "response": ["The day-to-day operations of the TTC are managed by the chief executive officer (formerly the chief general manager or CGM), currently Rick Leary, who succeeded Andy Byford in January 2018."]}, {"page": "Line 3 Scarborough", "response": ["In June 2016, city planning staff proposed to eliminate two of the three stops along the planned Scarborough Subway Extension terminating Line 2 Bloor–Danforth at Scarborough Town Centre in order to free up funding for a proposed Crosstown East LRT line extension of Line 5 Eglinton. The eliminated intermediate stops were at Lawrence Avenue and Sheppard Avenue. However, subsequently the cost estimate for the one-stop subway extension increased to $3.2billion leaving the Crosstown East LRT unfunded. Given the rising cost for the subway extension and the loss of funding for the LRT line, a group of city councillors led by Josh Matlow reopened the subway versus LRT debate. Matlow proposed scrapping the one-stop subway extension in order to provide funding for 24 LRT stops on two LRT lines within Scarborough. TTC CEO Andy Byford said the cost of the LRT line following the Line 3 route may have risen to as high as $3billion because of \"delays and redesign\" since 2013, but Brad Ross also of the TTC warned of \"caveats around numbers and assumptions\" associated with that estimate. After Council's vote, Byford admitted that the cost estimates for \"delays\" was unnecessary, which assumed the LRT's completion would be in 2026, the same date as the subway option. However, according to Michael Warren, a former TTC chief general manager, the LRT could have been completed in 2020 at a cost of $1.8billion, an estimate not presented to City Council when it voted. There was also the issue whether there would be space for both expanded GO service and an LRT north of Kennedy station; however, Metrolinx subsequently denied there would be such a problem. On July 13, Toronto City Council voted down Matlow's proposal by a margin of roughly 2 to 1."]}, {"page": "New York City Subway", "response": ["By 2018, CBTC was in the process of being installed on several other routes as well, particularly the IND Queens Boulevard Line () and IND Culver Line (). Eventually, the MTA has plans to automate a much larger portion, using One Person Train Operation (OPTO) in conjunction with CBTC. At the current pace of installation, it would take 175 years for CBTC to be installed at a cost of $20 billion. The Flushing line operated at almost 30 trains an hour using the signal system installed when the line was built, but after CBTC is installed it is possible that an additional two trains per hour could be operated. In March 2018, New York City Transit Authority president Andy Byford announced a new plan for resignaling the subway with CBTC, which would only take 10 to 15 years, compared to the previous estimate of 40 years. This would cost $8 to $15 billion."]}, {"page": "New York City Transit Authority", "response": ["The Transit Authority has its own management structure which is responsible for its day-to-day operations, with executive personnel reporting to the agency president. The position of president is vacant , following the resignation of its most recent president, Andy Byford.", "| Andy Byford || 2018–2020"]}, {"page": "Williamsburg Bridge", "response": ["In 2017, it was announced that between April 2019 and June 2020, during the 14th Street Tunnel shutdown, traffic restrictions would be implemented on the Williamsburg Bridge during the daytime. The restrictions would take place seven days a week between 5 a.m. and 10 pm. The bridge would be restricted to buses, trucks, and vehicles with more than 3 passengers during these times. The peak-hour high-occupancy vehicle restriction would allow the Williamsburg Bridge to accommodate three Select Bus Service bus rapid transit routes between Brooklyn and Manhattan. It was projected that during the shutdown, 70 buses in each direction would travel across the Williamsburg Bridge every hour. This was later revised upward to 80 buses per hour. However, in January 2019, it was announced that the 14th Street Tunnel would not completely shut down. As a result, New York City Transit Authority head Andy Byford stated that the Williamsburg Bridge's HOV lanes were no longer needed."]}, {"page": "Line 1 Yonge–University", "response": ["Outgoing TTC CEO Andy Byford said: \"People say '[build] there and they will come.' I think the most pressing need is to now focus on subway expansion where it's not so much that they will come, it's [that] there's already a demonstrable need.\" However, Globe and Mail columnists Oliver Moore and Jeff Gray wrote in the context of the TYSSE: \"But that advice will have to compete with the growing power of the suburbs, and the eagerness of Queen's Park to court them.\" Toronto city councillor and TTC commissioner Glenn de Baeremaeker said: \"Whether [the subway], quote, merits on a technical sense, the ridership or not, it's a philosophical decision the city has made and society has made. People like subways.\""]}, {"page": "110th Street station (IRT Lexington Avenue Line)", "response": ["In May 2018, New York City Transit Authority President Andy Byford announced his plan subway and bus modernization plan, known as Fast Forward, which included making an additional 50 stations compliant with the Americans with Disabilities Act of 1990 during the 2020–2024 Metropolitan Transportation Authority (MTA) Capital Program to allow most riders to have an accessible station every two or three stops. The draft 2020–2024 Capital Program released in September 2019 included 66 stations that would receive ADA improvements. In December, the MTA announced that an additional twenty stations, including 110th Street, would be made ADA-accessible as part of the Capital Program."]}, {"page": "Mosholu Parkway station", "response": ["In May 2018, New York City Transit Authority President Andy Byford announced his plan subway and bus modernization plan, known as Fast Forward, which included making an additional 50 stations compliant with the Americans with Disabilities Act of 1990 during the 2020–2024 Metropolitan Transportation Authority (MTA) Capital Program to allow most riders to have an accessible station every two or three stops. The draft 2020–2024 Capital Program released in September 2019, included 66 stations that would receive ADA improvements, including Mosholu Parkway."]}, {"page": "Kingsbridge Road station (IRT Jerome Avenue Line)", "response": ["In May 2018, New York City Transit Authority President Andy Byford announced his plan subway and bus modernization plan, known as Fast Forward, which included making an additional 50 stations compliant with the Americans with Disabilities Act of 1990 during the 2020–2024 Metropolitan Transportation Authority (MTA) Capital Program to allow most riders to have an accessible station every two or three stops. The draft 2020–2024 Capital Program released in September 2019 included 66 stations that would receive ADA improvements. In December, the MTA announced that an additional twenty stations, including Kingsbridge Road, would be made ADA-accessible as part of the Capital Program."]}, {"page": "Burnside Avenue station", "response": ["In May 2018, New York City Transit Authority President Andy Byford announced his plan subway and bus modernization plan, known as Fast Forward, which included making an additional 50 stations compliant with the Americans with Disabilities Act of 1990 during the 2020–2024 MTA Capital Program to allow most riders to have an accessible station every two or three stops. The draft 2020–2024 Capital Program released in September 2019 included 66 stations that would receive ADA improvements. In December, the MTA announced that an additional twenty stations, including Burnside Avenue, would be made ADA-accessible as part of the Capital Program."]}, {"page": "New York City Subway stations", "response": ["In 2018, New York City Transit president Andy Byford implemented a \"group station manager\" program, where 24 people would be hired to oversee up to 25 stations. This replaced a previous system where station managers could be responsible for up to 100 stations. Group station managers were generally responsible for coordinating repairs and operations, as well as providing customer service in each of the stations under their purview. These group station managers had repaired over 62,000 issues by early 2020."]}, {"page": "Commissioner of Transport for London", "response": ["In October 2019, TfL announced that Mike Brown would be leaving his role as Commissioner in May 2020 to chair the Delivery Authority for the restoration of the Houses of Parliament. In May 2020, Andy Byford, former president of the New York City Transit Authority (NYCTA) and former CEO of the Toronto Transit Commission was announced as the new Commissioner by the TfL Board.", "*2020–: Andy Byford"]}, {"page": "History of the New York City Subway", "response": ["Several improvements were made in response to the transit crisis. In the short term, signals, trains, and tracks were improved under the \"Fast Forward\" program. Further, the MTA's 2020-2024 capital plan called for adding elevators and ramps to 66 subway stations and adding modern signaling systems to parts of six more physical lines, to be funded by congestion pricing in Manhattan. Additionally, several other changes were proposed to improve service. For instance, in February 2019, several politicians wrote a letter to the MTA, asking the agency to consider splitting the R train in half to increase reliability. In January 2020, Stringer sent a letter to NYCTA president Andy Byford stated that the \"abundance\" of shuttered entry points along subway routes was contributing to severe overcrowding and longer commute times, and requested that the MTA develop and publicize plans for restoring closed entry points. The state of emergency ended on June 30, 2021, after previously being renewed 49 times."]}, {"page": "Denzil Minnan-Wong", "response": ["Andy Byford was hired as Webster's replacement."]}, {"page": "History of the Toronto Transit Commission", "response": ["* Andy Byford, acting CGM and chief executive officer (CEO) 2012–2017"]}, {"page": "Toronto Transit Commission fares", "response": ["On 28 November 2012, TTC CEO Andy Byford, TTC chair Karen Stintz, and Metrolinx signed the master agreement committing the TTC to the Presto fare payment system. The agreement fell under another master agreement that for the next ten years the new four LRT lines would be built by Metrolinx and operated by the TTC. The TTC was the last system to commit to Presto, while also being the largest system with the most users in Canada. On 30 November 2014, the Flexity Outlook streetcars became the first surface vehicles on the TTC to be equipped with this system. The older Canadian Light Rail Vehicle (CLRV) and Articulated Light Rail Vehicle (ALRV) streetcars would follow one year later on 14 December 2015, when those cars were retrofitted with Presto machines as well, and all remaining surface vehicles (including buses) and at least one entrance of all subway stations were equipped with this system by 23 December 2016."]}, {"page": "501 Queen", "response": ["In 2013, the TTC considered setting up a transit mall on the downtown portion of either Queen or King Street. TTC CEO Andy Byford wanted a car-free corridor along one of the city's two busiest streetcar lines (either 501 Queen or 504 King) to prevent bunching, gaps and service delays. Byford would ban general automobile traffic along the streetcar corridor but allow cyclists, taxicabs and delivery trucks. Byford preferred King Street for the transit mall because of recent condominium development along that street. There were similar proposals for a transit mall in 2001 and 2007. Ultimately, the King Street Transit Priority Corridor was established in late 2017."]}, {"page": "36th Street station (BMT Fourth Avenue Line)", "response": ["In May 2018, New York City Transit Authority President Andy Byford announced his plan subway and bus modernization plan, known as Fast Forward, which included making an additional 50 stations compliant with the Americans with Disabilities Act of 1990 during the 2020–2024 Metropolitan Transportation Authority (MTA) Capital Program to allow most riders to have an accessible station every two or three stops. The draft 2020–2024 Capital Program released in September 2019, included 66 stations that would receive ADA improvements, including 36th Street."]}, {"page": "Transit Enforcement Unit", "response": ["Andy Byford, the CEO of the TTC, requested in October 2013 that the Toronto Police Services Board restore the special constable program in an effort to implement an independent complaints process and public awareness campaign."]}, {"page": "Signaling of the New York City Subway", "response": ["Speed limits have remained relatively unchanged even as improvements in track geometry and car design allow trains to operate at higher speeds. Where possible, the agency has sought to increase speed limits. In summer 2018, New York City Transit president Andy Byford created the SPEED Unit to reduce delays by modifying operating and service practices. Soon after, the MTA began testing timers as part of the first systemwide review of timers to determine whether they are allowing trains to run at the posted maximum speed. The MTA eventually identified 267 faulty timer signals that disallowed trains from proceeding at the speed limit, and thus, forced trains to run significantly slower than intended. Train operators that pass the signals at or near their posted speeds have gotten punished due to the agency's strict discipline culture even though the signals are malfunctioning. Byford stated that \"I don't think that safety and speed are incompatible.\" By December 2018, the SPEED Unit had found 130 locations where the speed limit could be increased, some of which were in the process of being fixed. It was also announced that speed limits would be doubled in some parts of the system, and that average speeds would generally be increased from  to . In January 2019, it was announced that 95% of timers had been tested, and that the 320 faulty timers discovered were in the process of being fixed. In addition, 68 locations had been approved for increases in speed limits. The following month, the MTA hired subway-signal expert Pete Tomlin. , the MTA had increased speed limits at 64 locations since the preceding year.", "In March 2018, New York City Transit Authority president Andy Byford announced that he had created a new plan for resignaling the subway with CBTC, which would only take 10 to 15 years, compared to the previous estimate of 40 years. However, this would be very expensive, as it would cost $8 to $15 billion. Byford subsequently announced his $19 billion subway modernization plan at a MTA board meeting in May 2018. The plan involved upgrading signals on the system's five most heavily used physical lines, as well as accelerating the deployment of ISIM-B to all subway lines that did not already have either automatic train supervision or CBTC.", "The same year, it was reported that full implementation of CBTC systemwide might take 40 to 50 years. Following the subway system's state of emergency that year, MTA Chairman Joe Lhota described the timeline of CBTC installation as \"simply too long,\" instead proposing ways to speed up the work and hosting the Genius Transit Challenge to find quicker ways to upgrade the signals. Some of the proposals included a wireless signaling system, a completely new concept that had never been tested in any other railroad or subway network. In March 2018, the MTA announced that four entities had submitted two winning proposals to the challenge. One of the proposals used ultra-wideband signaling technology. The other proposal entailed installing sensors and cameras on trains, with minimal installations on tracks. New York City Transit Chairman Andy Byford stated that he wanted to test ultra-wideband technology at the same time that more established systems, like CBTC, are being installed. In March 2019, contracts for UWB installation on the Canarsie and Flushing Lines were awarded. Four trains on each line were equipped with UWB. The MTA then tested the equipment for nine months, and in a January 2020 press release, announced that the test had been \"successful\"."]}, {"page": "Relief Line (Toronto)", "response": ["In March 2012, TTC Chief Executive Office (CEO) Andy Byford stated there is great need for additional subway capacity with the increasing population of Toronto, and capacity issues along Line 1 Yonge–University: \"The downtown relief line has got to be looked at and has got to be talked about right now.\" Metrolinx officials stated that capacity issues may allow the Relief Line to be given higher priority in the regional transportation plan, The Big Move. Metrolinx CEO Bruce McCuaig stressed that the Downtown Relief Line should be prioritized and completed in 15 years, as part of Metrolinx's \"next wave\" of projects in The Big Move transit expansion plan. In February 2013, the Metrolinx Board approved changes to The Big Move that re-prioritized the eastern segment of the Relief Line to the 15-year plan, and made it one of the 15 top priority projects in the Greater Toronto and Hamilton Area."]}, {"page": "University of Pau and the Adour Region", "response": ["* Andy Byford, British transport executive"]}, {"page": "R179 (New York City Subway car)", "response": ["By the start of December 2018, some trains had to be taken out of service due to manufacturing defects such as doors, propulsion, and air compressors issues. The next month, the MTA revealed that 162 cars had been delivered, of which 128 (comprising sixteen 8-car trains) had been placed in service. In early January 2019, NYCTA President Andy Byford ordered more R179 cars to be removed from passenger service and the temporary suspension of the delivery of further cars until Bombardier corrected all defects found within them. After the issues were resolved, deliveries recommenced in early February 2019. On May 10, 2019, it was found that there was a welding defect on the collision pillars of the R179, but not all trains on property at the time were pulled from service."]}, {"page": "List of closed New York City Subway stations", "response": ["In response to a request made by State Senator Martin Dilan, the Metropolitan Transportation Authority (MTA) stated that 119 stations either had a closed street stair or closed control area, and that 130 stations had closed entrances. Within these 130 stations, there are 114 closed control areas and 298 closed street stairs. 188 of these were connected to closed control areas, with the remainder connected to control areas that remain open. Of these, many entrances were closed between the 1970s and 1990s due to legitimate crime concerns, due to low ridership, and to cut costs. As crime has decreased, and as ridership has gone up, these entrances, for the most part have not been revisited. During some station renovation projects, closed entrances have been reopened. New York City Comptroller Scott Stringer delivered a letter to the New York City Transit Authority President Andy Byford in January 2020, demanding that the MTA develop, and make public, plans for restoring abundance of unavailable entryways along subway routes. The \"long-shuttered entry points\" contribute to severe overcrowding at stations and longer commute times."]}, {"page": "Flexity Outlook (Toronto)", "response": ["According to CEO Andy Byford in 2015, the first Flexity streetcars were so poorly manufactured that the TTC would not accept them for fear they would break down on bumpy city streets. At the Thunder Bay plant, when workers went to attach the under-frame to the sidewalls, they had found they were not square. To solve the problem, they wanted to rivet the two pieces together. The TTC rejected that solution, as according to Byford, rivets pop. There were still issues with loose screws, wiring and electrical connectors . To address these problems, Bombardier retooled its Mexican operation in Ciudad Sahagún, Hidalgo (a former Concarril facility) and implemented new quality-assurance processes at Thunder Bay.", "In December 2014, Bombardier was behind schedule in delivering new vehicles. By mid-December, Bombardier should have delivered 43 vehicles but had only delivered three. Seven new vehicles should have been delivered in 2013. TTC CEO Andy Byford had warned Bombardier that he would insist that they meet the final schedule of all vehicles in time for new streetcars to replace the old fleet by 2019, or he would impose the penalty clauses in the delivery contract. One additional vehicle was expected to be delivered before the end of the year.", "On September 28, 2016, TTC CEO Andy Byford said that there were 22 of the new streetcars in operation, and expressed doubts that Bombardier would be able to meet its promise of 30 total deliveries by the end of 2016. However, Bombardier shipped the 30th vehicle on December 14, which arrived in Toronto on December 21. With the TTC's permission, Bombardier shipped the last four Flexity streetcars of 2016 to the Hillcrest Complex in an almost-finished state and completed them at the Leslie Barns. This allowed Bombardier to meet its 2016 delivery promise. However, according to Bombardier's original delivery plan, there should have been 100 Flexity streetcars in Toronto at the end of 2016.", "On October 28, 2015, the TTC board voted in favour of a lawsuit against Bombardier \"for at least $50million to recoup lost costs\", according to Chair Josh Colle, because of the company's failure to deliver the additional Flexity streetcars. TTC chief executive Andy Byford indicated that he was not interested in the money per se, and simply wants the streetcars. In a statement late that afternoon, Bombardier responded that it would not comment on the TTC's plan and would not offer \"any speculation on potential impacts\" on their operations. In April 2019, the TTC and Bombardier reached a settlement for an undisclosed sum.", "As early as June 2013, TTC CEO Andy Byford expressed the need for the TTC to order an additional 60 vehicles. According to a 2015 TTC report, the extra vehicles would address rising streetcar demand due to residential growth downtown. The option for 60 additional vehicles would cost of $361million. The TTC can purchase an additional 60 vehicles at the current price, if the additional vehicles are ordered before the 60th vehicle is delivered. In September 2016, the TTC Board rejected the recommendation citing the Bombardier Flexity delivery delays, the extra cost of keeping the old fleet running, and the possibility of buying buses at a lower price with federal funding. Byford said that using buses instead of streetcars was inefficient due to capacity differences. TTC Chair Josh Colle said not considering the option is part of \"our ongoing dramas and pressures with Bombardier.\" According to the Bombardier contract, the option for an additional 60 streetcars expired when the 60th car of the original order was delivered."]}, {"page": "List of heads of public transport authorities in London", "response": ["*Andy Byford, 2020-"]}, {"page": "Vincent Crisanti", "response": ["Andy Byford was hired as Webster's replacement."]}, {"page": "East Bayfront LRT", "response": ["On August 29, 2014, The Globe and Mail reported that senior City of Toronto officials had gone over the head of City Council, and made an appeal for funding for the line right to more senior levels of government. TTC General Manager Andy Byford and City Manager Joe Pennachetti had made their proposal to their opposite numbers in the Provincial bureaucracy. According to The Globe and Mail, they had not yet approached provincial and federal politicians."]}, {"page": "Byford (surname)", "response": ["*Andy Byford (born 1965), former president of the New York City Transit Authority"]}]}}