{"wiki_id": "http://www.wikidata.org/entity/Q4766807", "itemLabel": "Anna Acton", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_Acton", "wikipedia_page": {"main": "Anna Acton (born 29 January 1977) is an English actress who is best known for her roles as Rochelle Barratt, the wife of a borough commander, in the ITV television series The Bill, and DC Emma Summerhayes in the BBC One soap opera EastEnders. Prior to appearing in The Bill, Acton played the long-suffering yet bubbly Geri Evans in the soap opera Family Affairs for three and a half years.Acton also appeared in two episodes of Doctors as Rachel Cook (April 2006) and later as Keira Chesterton (February 2008) and Hollyoaks (October 2006) as DC Mullins. In May 2007, she starred as Louise Martin in two episodes of HolbyBlue for the BBC. In August 2008 she appeared with Paul Nicholls in Harley Street (ITV) and was also seen as Dorothy in the CGI Sketch Show for BBC The Wrong Door.\nFrom 2013 to 2015, Acton played the role of Joy in the CBeebies programme Topsy and Tim. From 21 April 2014 to 2 January 2015, she portrayed DC Emma Summerhayes, the police officer investigating Lucy Beale's (Hetti Bywater) murder, in the BBC One soap opera EastEnders.From 2015 to 2016, Acton appeared in the BBC One medical soap Casualty as Nikki Chisom. In 2018, she appeared in Birches, a UK-based feature based on the novel Silver Birches published in 2009 by Adrian Plass. Birches was turned into a film directed by Randall Stevens, with screenplay by Mark Freiburger. It starred Natasha Little and Todd Carty. In May 2021, she appeared in an episode of the BBC soap opera Doctors as Vicki.", "link_mentions": [{"page": "Family Affairs", "response": ["In 2002, Cat Webb's niece Geri (Anna Acton) moved to Stanley Street, as did the troubled Davenport family, who moved into the flat originally occupied by Declan, Gabby and Clive. Mother Ginny (Joanna Foster) was recovering from a severe bout of depression, and husband Robert (Brian Cowan) worked to launch a catering business on Stanley Street. Their three teenage children Jessica (Sammy Glenn), Cameron (Rupert Hill) and Lewis (Sam Stockman) were soon joined by Robert's much younger adoptive brother Jude Davenport. Jude was openly despised by Ginny, Cameron and Lewis after he romantically pursued Jessica. Cameron and Paul Webb became close friends, until Paul learned of Cameron's brief affair with his fiancée Gemma. A furious Paul left Gemma at the altar and left Charnham.", "|Geri Evans || Anna Acton || 2002–2005"]}, {"page": "Marlow, Buckinghamshire", "response": ["*Actress Anna Acton was born in Marlow."]}, {"page": "Ian Beale", "response": ["Ian is pessimistic when Lucy decides to set up her own property business and later becomes concerned about her when he discovers she is sleeping with Lee Carter (Danny-Boy Hatchard) and is taking cocaine. He confronts her and admits she is the child he is most proud of, but this is overheard by Peter, resulting in Lucy storming out. Ian tries to contact her when she does not return home that night, but is later informed by DC Emma Summerhayes (Anna Acton) and DS Cameron Bryant (Glen Wallace) that Lucy has been found dead. He identifies her body and then shares his devastating news with Jane, Denise, Cindy, Bobby and finally Peter. Struggling with their grief, Ian and Jane share a passionate encounter, giving Ian hope that they might reunite. When Jane dashes his hopes, Ian takes his anger out on Bobby and Jane decides it would be best if she take Bobby away for a while. Cindy also leaves the Square to return to Devon with her aunt, Gina Williams. Increasingly alone, Ian leans on Phil for support and questions how he can move on from his daughter's death. With Peter's help, he stages an opening for the new and improved restaurant, but during opening night Summerhayes reveals that Lucy's body has been released for burial. Ian leaves early with Peter to see her, but is unable due to his grief. He wants to organise the funeral for as soon as possible but discovers that Max and Lucy were together; Ian angrily attacks Max as he carries Lucy's coffin down the aisle of the church and it is clear that Ian is not coping. Worried, Sharon believes that he is relying on pills to numb the pain of his grief and she and Carol Jackson (Lindsey Coulson) comfort him."]}, {"page": "Peter Beale", "response": ["Peter becomes reliant on Lauren for support as she was Lucy's best friend and business partner in a letting agency. His need for support from her increases when Jane and Bobby leave for Birmingham and Cindy is sent back to her aunt in Devon. A rift forms between him and Lola over his reliance on Lauren over her and they break up when Peter realises he is in love with Lauren and Lola is responsible for the publication of a well-meant article about Lucy that paints her as a rebellious teenager. Lauren rejects his advances as she has recently started dating Dean Wicks (Matt Di Angelo), but realises she is still in love with him when he heroically rescues Kat Moon (Jessie Wallace) from a fire. Peter plans to leave Walford to live with Steven, but Lauren stops him and they declare their love for each other. They are unnerved to realise they are being followed, but are told by Max's new girlfriend DC Emma Summerhayes (Anna Acton) that it is just a reporter. Peter then leaves for a holiday with Steven in New Zealand. When he returns, he proposes to Lauren with Cindy's help (who has returned from Devon)  and she accepts, but calls off the engagement almost immediately when Ian reveals that Peter was Lucy's cocaine dealer. Peter explains that he simply handled the drugs so Lucy would not come into contact with any dangerous drug dealers and she became addicted since they were staying in Devon several years ago with the addiction becoming stronger when Ian had his breakdown. Despite knowing this, Ian disowns Peter although Jane convinces him to let Peter move back in. In February 2015, Peter finds out that Lauren is pregnant with his child. When he offers to support her, she tells him that Lucy was murdered at home, leaving Peter thinking that either Ian or Jane killed Lucy. When the whole family learns that Bobby is the real killer, despite Jane trying to cover for him as she convinced him that he didn't, they try to tell him what he did. When Peter sees that the rest of the family now do not want Bobby to know, he gets angry and leaves the house in a rage, sleeping on a park bench all night. After realising that he cannot live with this secret, Peter announces he is moving to New Zealand to live with Steven and invites Lauren to join him. At first she rejects him as she is going to live with her mum in Devon, but comes around soon after. Whilst stood in the middle of the market, Peter buys a baby-grow, revealing Lauren kept the baby, and they both leave the Square together."]}, {"page": "List of former EastEnders characters", "response": ["|Emma Summerhayes || Anna Acton || 2014–2015"]}, {"page": "Denise Fox", "response": ["On New Year's Eve, a pregnant Kim surprises Denise and accuses Ian of ruining Denise's life. The next day, Kim finds bruises on Patrick's arms and realises Denise had beaten him and confronts her. At the pub, Denise gets drunk, and after hearing of Emma Summerhayes' (Anna Acton) death, drunkenly slurs that Lucy's killer would be jailed if Emma had done her job properly. In anger of Denise's disrespectfulness, Ian says that despite what Kim said, Denise has been ruining her own life. On arriving home, she tells Kim she cannot be Patrick's carer any more. After an argument with Denise in The Queen Victoria public house, Kim goes into labour and gives birth to a daughter named Pearl. Although she disowns Denise, they eventually reconcile the next day. After Pearl's christening, she tells Denise that her husband doesn't exist and she made him up because of fear of being alone. However, Kim's confessions to Shirley, Kat Moon (Jessie Wallace), Linda Carter (Kellie Bright) and Patrick reveal that her husband does exist but she left him when she found out that he was a criminal. Eventually, when her husband Vincent Hubbard (Richard Blackwood) tracks her down in Walford, Kim works up the courage to tell Denise the truth about him and explains her experience when she went to tell him she was pregnant. Denise and Patrick soon become wary of Vincent's intentions."]}, {"page": "Ben Mitchell (EastEnders)", "response": ["Ben had instructed Jay to bury Lucy's purse and phone, which has been missing since her death. Denise Fox (Diane Parish) digs them up in Patrick Trueman's (Rudolph Walker) allotment and takes them to Ian, who calls the police before Ben convinces him that he found them on Good Friday in a bag in the Square and had no part in Lucy's murder. Ian lies to the police and protects Ben. When Phil is arrested on suspicion of attempting to kill Ronnie, he puts Ben in charge of his garage. Max Branning (Jake Wood) starts helping him with deals, only to trick Ben into signing over the garage to him as revenge for the death of his girlfriend Emma Summerhayes (Anna Acton), which Max has blamed Phil for, though Phil eventually gets the garage back. Ben then starts a sexual relationship with Paul Coker (Jonny Labey), whilst maintaining his relationship with Abi. Ben grows frustrated with Abi's controlling behaviour, and she is suspicious, so Ben has sex with her to allay her fears. Phil catches Ben and Paul half-naked together at the car lot, and angrily tells Ben to leave as he broke his trust, both in hiding his homosexuality and being loyal to Abi. Ben ends his relationship with Paul, leaving Paul heartbroken. Paul tries to speak to Ben on numerous occasions, but fails to win Ben's affections over. Ben and Abi decide to find their own home after realising they can no longer stay with Phil after Sharon leaves him. Ben and Paul flirt and arrange to go to the cinema but when Abi finds them and leaves in anger feeling Ben is not taking their plans seriously, Ben follows her, leaving Paul alone. Paul later tells Ben that he loves him and says Ben must decide who really wants and accept who he really is. To give himself more time, Ben books tickets for Abi to visit a friend on holiday, and then tells Paul he loves him back. Jay sees them kissing, and tells Ben to admit to Abi that he loves Paul. When Phil is later sent to hospital and informed that he will be dead within 12 months unless he has a liver transplant, Ben, alongside Sharon and Jay, refuse to visit him, and Sharon has him change the locks on the house so Phil cannot enter when he is discharged."]}, {"page": "Max Branning", "response": ["Many of Max's storylines focus on his relationships, including his marriages to Tanya Branning (Jo Joyner), Kirsty Branning (Kierston Wareing) and Rainie Cross (Tanya Franks), and relationships with Gemma Clewes (Natalie J. Robb), Stacey Slater (Lacey Turner), Vanessa Gold (Zöe Lucker), Lucy Beale (Hetti Bywater), Emma Summerhayes (Anna Acton), Karin Smart (Denise van Outen), Carmel Kazemi (Bonnie Langford), Fi Browning (Lisa Faulkner), Ruby Allen (Louisa Lytton) and Linda Carter (Kellie Bright), many of which are extramarital affairs. Max has also embarked on feuds with his father Jim Branning (John Bardon), brothers Jack Branning (Scott Maslen) and Derek Branning (Jamie Foreman), as well as Sean Slater (Robert Kazinsky), Harry Gold (Linal Haft), Janine Butcher (Charlie Brooks), Phil Mitchell (Steve McFadden), Cora Cross (Ann Mitchell), Jay Brown (Jamie Borthwick), Carl White (Daniel Coonan), Charlie Cotton (Declan Bennett), Ben Mitchell (Harry Reid/Max Bowden), Ian Beale (Adam Woodyatt), Jane Beale (Laurie Brett), Steven Beale (Aaron Sidwell), Mick Carter (Danny Dyer), Martin Fowler (James Bye), Stuart Highway (Ricky Champ) and Kathy Beale (Gillian Taylforth).", "Remembering the moving eulogy Max made at Bradley's funeral, Ian turns to him for advice over Lucy's impending funeral. Abi becomes irate when she sees Max supporting Ian and reveals that she knows that he was sleeping with Lucy and was the person that sent him the email of him and Lucy together. Abi's boyfriend Jay Brown (Jamie Borthwick) witnesses the confrontation between them and tells Phil, who in turn reveals the truth to a horrified Ian. At the funeral, Ian attacks Max when he sees him carrying Lucy's coffin and later Phil and Alfie Moon (Shane Richie) visit him and tell him that he is no longer welcome in any of Ian or Phil's businesses or The Queen Vic. Max then begins a sexual relationship with DC Emma Summerhayes (Anna Acton), the detective who is investigating Lucy's murder. Emma ends things when Max's rival, Dot's grandson Charlie Cotton (Declan Bennett) discovers their relationship and threatens to report it. When Stacey is released after an appeal, Max employs her at the car lot, but she decides to leave when he admits he still has feelings for her and it was those feelings that drove him to have the affair with Lucy. Stacey then encourages him to get back in touch with Emma, and she and Max resume their relationship. He impresses Emma's parents when they visit but when Emma wants to end their relationship because of the pressures of the case, Max makes an anonymous call to the police which starts an investigation into Emma's misconduct. Max is angry when Emma gives Lauren's laptop to the police, and as a result, Abi's behaviour regarding Max and Lucy is revealed to both the police and Lauren. After Emma is hit by a car in the Square, Max takes her to hospital where she dies from a bleed to the brain. Max finds Emma's case notes in his kitchen cupboard and rips them up in front of Carol, and then turns to alcohol to deal with his grief. Thinking Phil was responsible for the crash, he takes revenge by tricking his son Ben (Harry Reid) into signing over The Arches to him. When Max discovers Phil has been framed, he refuses to sign the business back to Phil despite Ben later telling him that Nick Cotton (John Altman) was responsible for the crash. After he is banned from Emma's funeral, Max visits Phil in prison to tell him he has taken over ownership of The Arches. Phil swears revenge on Max, and after being released, Phil regains the garage and also takes the car lot from Max."]}, {"page": "Cindy Williams (EastEnders)", "response": ["A heavily pregnant Cindy returns to Walford and meets Ian, who is trying to reconcile with fiancée Denise Fox (Diane Parish). He shows little interest until he notices Cindy is in labour, and she admits that she ran away after discovering Gina and Bev were planning to have her baby adopted. Ian helps her deliver her daughter Beth Williams. She reconciles with Ian, but this is marred by Denise leaving him and TJ struggling to bond with Beth. TJ admits he cannot cope with being a father and moves to Milton Keynes with his family. Cindy struggles to cope with being a single mother. She confides in Liam but when she tries to kiss him, he turns her down realising that it would be for the wrong reasons. Cindy finds a Christmas present addressed to Beth; inside is Lucy's jewellery box. Former police officer Emma Summerhayes (Anna Acton) tries to get information from Cindy in her grief about her involvement in Lucy's death, but fails."]}, {"page": "Abi Branning", "response": ["After her break up with Jay, Abi becomes a much nastier and bitter person. She begins a relationship with Ben (now played by Harry Reid), which is discovered by Emma Summerhayes (Anna Acton) who informs Max of the relationship. Max demands that Abi does not see Ben any more, which Abi refuses to do. Abi later discovers that Max used Ben to sign over part of Phil's businesses to him. In February 2015, Abi is accused by Max of killing Lucy. Abi did not kill Lucy, but it is revealed that on the night Lucy died, Abi had a confrontation with Lucy about her affair with Max, which resulted in Abi slapping Lucy. After Max tells her that Tanya would like her to move to Devon with her, Abi refuses and instead moves in with Ben and his family. and Abi believes she finally has a stable home life. After she moves in, Ben reveals to her that he might still be gay and is worried he will never get over his homosexuality but Abi assures him that they will make things work. She continuously mocks Jay and accuses him of being jealous of her relationship with Ben. Jay tries to make Abi see that Ben is not interested in her, but she pretends not to care about what Jay says. Abi discovers a letter from Sharon's birth mother and Sharon says that she intends on meeting her birth father after discovering that her mother has died. When Paul Coker (Jonny Labey) arrives in Walford, Abi suspects Ben of cheating on her with Paul. She and Ben have sex, so Ben can convince her he is not gay. Following Ben's arrest for Lucy's murder, Abi tells Phil that Max assaulted Lucy to get Ben off. Despite being innocent, Max turns himself in and is formally charged while Ben is released. Stacey visits Max, who tells her that he thinks Abi killed Lucy. Stacey confronts Abi, who attacks Stacey, blaming her for her parents' split and Bradley's death, and later vents to her aunt Carol Jackson (Lindsey Coulson) that she does not think Max cares about her. Carol visits Max in prison, where he informs her that the reason he thinks Abi killed Lucy is because she attacked and beat her on the night of the murder. After confronting Abi on this, Carol agrees that she has been out of control lately and advises her to call Tanya for moral support. During the phone call, Abi finds out that not only is Oscar ill, but Cora had apparently not stayed with Tanya at her house as she had earlier said. Abi, Carol and Jane Beale (Laurie Brett) find Cora living rough and bring her home. She reveals she saw Max and Abi cleaning the car lot after Lucy was killed, forcing Abi to admit that Max and Lucy had argued there and she was helping Max clean Lucy's blood. Abi then gives a statement to the police. Max is later found guilty of the murder."]}, {"page": "Lauren Branning", "response": ["Peter asks Lauren to marry him. Lauren accepts, but after finding out that Peter was selling drugs to Lucy, she tells him that she cannot marry him.  On New Year's Day 2015, Max's girlfriend Emma Summerhayes (Anna Acton) is killed in a car accident after meeting someone who she thinks killed Lucy. Although Max tears up Emma's case notes, Lauren finds most of the pages and puts them together, suspicious about who killed Lucy. Lauren asks Peter to marry her and he accepts. However, after finding a previously torn off piece of a page from Emma's case files and trying to use Emma's phone, Lauren starts to doubt if she should marry Peter and drinks most of a half-bottle of whisky in Max's office. When Lauren nearly faints, Stacey buys her a test and discovers that Lauren is pregnant. Stacey confronts her about it but Lauren reveals that she knows who killed Lucy, but refuses to divulge the identity to the police. When Stacey calls the police, she is upset at her inability to keep a secret but hands in most of Emma's case files, while keeping the torn-off piece. She writes a card addressed to Jane, saying that Lucy was killed at home, and abruptly leaves to book an abortion. However, during the consultation, Peter interrupts her and offers to support her through all her issues. Lauren says she is confused and that she knows what happened to Lucy, leading him to discover the truth about the murder at home. When Peter decides to emigrate to New Zealand, he asks Lauren to go with him. She initially refuses, planning to join Tanya in Devon but after he tells her that his brother Bobby Beale (Eliot Carrington) is Lucy's killer, she changes her mind and decides to go to New Zealand. They dispose of Emma's remaining evidence and SIM card, deciding not to tell the police about Bobby being Lucy's killer. She says goodbye to Max and Abi and leaves with Peter, taking an outfit for their unborn child with them."]}, {"page": "List of The Bill characters", "response": ["In addition to its large ensemble of police officers The Bill also features supporting actors in auxiliary roles. Jason Barnett, as Crime Scene Examiner Eddie Olosunje, appeared in the series finale \"Respect\", after appearing regularly from 2008. Moya Brady's character, Robbie Cryer, is notable for being the niece of Sergeant Bob Cryer, played by Eric Richard. Marilyn Chambers, played by Vickie Gates, was engaged to PC Reg Hollis (Jeff Stewart), while Rochelle Barrett, played by Anna Acton, was married to Chief Superintendent Ian Barrett and embarked on an affair with PC Dan Casper. ", "| Rochelle Barrett || Anna Acton || 2005 || style=\"text-align:center;\"|20 || Drugs Referral Officer"]}, {"page": "List of Family Affairs characters", "response": ["Geri Evans was played by Anna Acton from 2002 until the end of the series in 2005."]}, {"page": "Natasha Little", "response": ["In 2018,  she appeared in \"Birches\" UK based feature,. based on the novel 'Silver Birches' (published in 2009 by Adrian Plass), which was turned into a film directed by Randall Stevens, with screenplay by Mark Freiburger and it also starred Anna Acton and Todd Carty."]}, {"page": "Jay Brown", "response": ["Lucy Beale (Hetti Bywater) is murdered by an unknown assailant (see Who Killed Lucy Beale?), and Jay discovers that Max is having a fling with a detective involved in the case, Emma Summerhayes (Anna Acton). He agrees to keep quiet for the sake of the investigation. Emma and her colleagues organise an appeal to raise public awareness into the murder inquiry, and display CCTV footage of a man in a beanie hat on the same bus as Lucy on the night she died. Jay is skittish on seeing the footage and later burns the hat. He then makes arrangements to move away with Abi when she gets accepted into the Bolton University. On hearing that the police have a new lead on the man on the bus, Jay makes plans to leave for Bolton with Abi immediately after saying goodbye to Phil at a barbecue, but during the proceedings Summerhayes and her superior, DI Samantha Keeble (Alison Newman) arrive and question Jay (as seen in scenes available online) over a robbery at a shop near to where Lucy was killed, and it is revealed he was with another man at the time. He denies any involvement and is released without charge. He later confides in Shirley that he was with Ben on the day Lucy was killed, but he has only seen Ben twice since he was released from prison. Shirley forces him to tell Phil, and his initial anger leads Jay to move in with Abi for a while, and he plans to move to Bolton before Phil marries Sharon Rickman (Letitia Dean). Jay later reconciles with Phil and reunites him with Ben. It is revealed that, under Ben's instruction, Jay buried Lucy's phone and purse in the allotment. On the day of Sharon and Phil's wedding, Jay and Abi split up when Abi realises Jay is harbouring feelings for Lola. When Phil is accidentally shot by Shirley, Jay and Ben are instructed by Ronnie Mitchell (Samantha Womack) to throw the gun in the canal. The Mitchells, including Phil, decide to cover for Shirley by saying that a random person shot Phil."]}, {"page": "Roxy Mitchell", "response": ["On her wedding day to Charlie Cotton (Declan Bennett), Ronnie goes into labour. On the way to the hospital, Roxy, Charlie and Ronnie are all involved in a car accident after Charlie's father Nick Cotton (John Altman) cut the brakes as the vehicle crashes. Emma Summerhayes (Anna Acton) is killed after being run over by the car and Ronnie is seriously injured and comatised. While Ronnie is in her coma, Roxy and Charlie have sex, later agreeing that it was a mistake. Later, Charlie learns that Roxy has feelings for him. Aleks finds out that Roxy and Charlie had sex, and he and Roxy make plans to leave for Latvia immediately, but they split after Roxy admits to Aleks she does not love him, so Aleks leaves with Marta and Ineta. Charlie admits to Roxy that he thinks he is falling in love with her but says they should stay apart. Roxy confesses to Ronnie about her one-night stand, and their relationship becomes strained."]}, {"page": "Mark Freiburger", "response": ["* Writer of Birches UK based feature. Based on the novel 'Silver Birches' (published in 2009 by Adrian Plass), was turned into a film starring Natasha Little, Anna Acton and Todd Carty. "]}, {"page": "Ben Hull", "response": ["Hull is married to actress and former Family Affairs co-star Anna Acton."]}, {"page": "List of EastEnders characters (2008)", "response": ["In October, with DC Emma Summerhayes (Anna Acton), she bumps into Max as he is leaving Ian's house. Summerhayes is surprised to discover Max and Keeble know each other. Keeble informs Ian that they had traced and eliminated all the witnesses from the bus. Keeble takes Summerhayes off the case, after discovering that she has been having a sexual relationship with Max. Keeble tells Summerhayes that she has jeopardised the murder investigation and faces an investigation by the force's professional standards department. Keeble visits Max when he complains about a reporter stalking his daughter Lauren (Jacqueline Jossa). Keeble assures Max that the police have spoken to the so-called journalist, who is actually Detective Sergeant Cameron Bryant (Glen Wallace), and told him to back off. Keeble then warns Summerhayes, telling her not to put her police career at any further risk by remaining with Max."]}, {"page": "Characters of Casualty", "response": ["Dixie's latest storyline began airing October 2015, which saw her meet paramedic Jess Cranham (Kerry Bennett) whilst taking part in a HART training course. However, a new dimension was added to the storyline when Jess was later found down the bottom off a deep hole in the middle of woodlands. Her partner, Nikki Chisom (Anna Acton) is present along with Jess's daughter, Olivia (Grace Doherty), at the time of the incident, causing Dixie to become concerned for the welfare and safety of Jess and Olivia. Dixie is later reported by Jess after interfering in their relationship. Hossington revealed that Dixie would play a major role in a domestic abuse storyline, which will climax on 9 January 2016 where events take a dark and potentially deadly turn."]}, {"page": "Lucy Beale", "response": ["The next day, Lucy's body is found on Walford Common after having been murdered the previous night. That afternoon, police officers DC Emma Summerhayes (Anna Acton) and DS Cameron Bryant (Glen Wallace) tell Ian that Lucy is dead. Ian identifies her body at Walford mortuary. Her funeral takes place, and the police continue to investigate her murder. When Peter proposes to Lauren, he confesses that he supplied drugs to Lucy. After the proposal, Lee finds a video that proves Lauren has given a false alibi."]}, {"page": "1977 in British television", "response": ["*1 January – Anna Acton, actress"]}, {"page": "Adrian Plass", "response": ["His novel 'Silver Birches' (published in 2009), was turned into a film directed by Randall Stevens, with screenplay by Mark Freiburger and starred Natasha Little, Anna Acton and Todd Carty."]}, {"page": "Acton (surname)", "response": ["* Anna Acton (born 1979), British actress"]}, {"page": "List of EastEnders characters (2012)", "response": ["Les appears again to arrange Nick Cotton's (John Altman) funeral, although it is later revealed to be a scam in which Les is in on. Les moves his funeral business, Coker & Sons Funeral Parlour, to Turpin Road following the relocation of Pam's flower stall to Bridge Street Market. When walking home one night, Fatboy (Ricky Norwood) notices Les being handed money by Dot Branning's (June Brown) grandson, Charlie Cotton (Declan Bennett). Fatboy tries to tell Dot what Les and Charlie are up to, but is unsuccessful. In July, Les hires Billy Mitchell (Perry Fenwick) at the undertakers, however he is disappointed when Billy doesn't turn up for work on his first day. Pam is upset when Les insults Emma Summerhayes (Anna Acton) while drunk, fearful it will reveal a big secret they have been keeping; that she euthanised their dying son, Lawrie. Billy eventually establishes a good working relationship with Les and a friendship as they spend Christmas together. Billy discovers the business is deeply in debt and forces Les to tell Pam this. They vow no more secrets, but after Les meets with his 'other woman', Claudette Hubbard (Ellen Thomas) and gives her an expensive necklace. Claudette and Pam are revealed to be old friends, as Claudette is a foster mother and Pam used to help children in care. Les holidays in Gran Canaria with Claudette, although Pam sees it as a coincidence when she learns from Claudette's foster daughter Donna Yates (Lisa Hammond) that they are both there at the same time."]}, {"page": "List of EastEnders characters (2014)", "response": ["Pam makes her first appearance on 14 April 2014. She is delighted that her husband Les has bought 53 Turpin Road for their funeral parlour. The following week, the couple move into the upstairs flat, and Pam opens up her flower stall as the Spring Lane street market has been merged with the Bridge Street market. Pam is not in competition with anyone. She enjoys listening to the arguments and gossip between other rival stall holders. While Pam babysits for Billy Mitchell (Perry Fenwick) and Lola Pearce (Danielle Harold), she discovers photographs of the recently murdered Lucy Beale (Hetti Bywater) behind Billy's fridge. Pam confronts Billy who explains that the photographs of Lucy are not his but are her twin brother Peter's (Ben Hardy). Pam befriends Sonia Fowler (Natalie Cassidy) and helps her organise a naked charity calendar, posing nude herself with Mo Harris (Laila Morse) for the month of April. She becomes upset when DC Emma Summerhayes (Anna Acton) tells her that secrets always have a habit of revealing themselves. On the anniversary of her son, Lawrie's, death, she goes missing with Janet. When she returns with Janet, Billy is upset with her. Pam discloses to Emma that she used to be a social worker until accusations were made that she brought about the death of Lawrie, her terminally ill son; telling Emma that the accusations were false, but confessing to Billy that they were true. When Billy discovers the funeral parlour is in trouble because Les cannot bring himself to push bereaved families to pay overdue bills, Billy insists Les tell Pam the truth. Les is unwilling to upset Pam on their anniversary, but eventually confesses, and the pair agree to have no more secrets. However, Les is then revealed to be secretly meeting another woman to whom he gives a necklace. When Pam organises a 30th birthday party for Donna Yates (Lisa Hammond) soon afterwards, she secretly invites Donna's foster mother Claudette Hubbard (Ellen Thomas) – the same woman Les is secretly meeting. It is then revealed that Pam placed Donna in Claudette's care when she was a social worker and that the two are good friends.", "Detective Constable Emma Summerhayes, portrayed by Anna Acton, appears between 21 April 2014 and 2 January 2015. She is the Police Family Liaison Officer for the Beales after Lucy Beale (Hetti Bywater) is murdered.", "Cameron arrives with his colleague, DC Emma Summerhayes (Anna Acton), at the Beale household, when they inform Ian Beale (Adam Woodyatt) that his daughter, Lucy, is dead. He orders officers to search Lee Carter's (Danny-Boy Hatchard) bedroom and takes a DNA sample for forensics. When Max Branning (Jake Wood) changes his statement about his movements on the night of Lucy's death, Cameron returns with Emma to clarify Max and his daughter Abi's (Lorna Fitzgerald) statements. Cameron searches Phil Mitchell's (Steve McFadden) house in connection with a robbery committed by Jay Brown (Jamie Borthwick), the night Lucy was killed.", "On the day of Charlie and Ronnie's wedding, Nick escapes from his room and cuts the brakes of Ronnie's sister, Roxy's (Rita Simons) car, as revenge against Ronnie, who wants her cousin, Phil (Steve McFadden), to dispose of him. At Charlie and Ronnie's wedding party, Ronnie's waters break, but whilst Roxy is driving them to the hospital, they knock DC Emma Summerhayes (Anna Acton), down, killing her and the car crashes, placing Ronnie in a coma. Charlie and Ronnie's baby is safely delivered and Yvonne is delighted to be a grandmother, but Ronnie is still in a critical condition. The day after the accident, Yvonne discovers what Nick has done, but he convinces her to frame Phil, by putting the oil rag in his coat pocket. Phil is arrested and charged, but after witnessing Charlie beat up Phil's son, Ben (Harry Reid), she tells Charlie the truth about the accident. When Charlie discovers that Nick cut the brakes of Roxy's car and that Yvonne helped to frame Phil, he and Dot order them both to leave. Yvonne tells Charlie how much she loves him before packing her bags and leaving Walford.", "| A police officer investigating the murder of Lucy Beale (Hetti Bywater). He questions Lauren Branning (Jacqueline Jossa) along with DC Emma Summerhayes (Anna Acton) about Lucy's last known movements, the night she was killed. He later informs the Beales that her former lover Danny Pennant (Gary Lucy) has an alibi for the night of her death. He is later approached by Lauren about an anonymous email Lucy responded to the night she died, but Holt tells her they are already investigating the matter. The week after, Holt arrests Jake Stone (Jamie Lomas) on suspicion of murder and questions him along with DC Summerhayes. Holt later speaks to Max Branning (Jake Wood) after it is revealed that he was having a secret relationship with Lucy. Holt tells Max that he is not a suspect in the investigation.", "| The father of DC Emma Summerhayes (Anna Acton). Along with his uptight wife Margot, he has dinner with Emma and her new partner Max Branning. (Jake Wood), and is impressed by Max's genuinely caring nature.", "| The mother of DC Emma Summerhayes (Anna Acton). Along with her husband Henry, she attends dinner at Emma's partner Max Branning's (Jake Wood) house; she initially dislikes Max and his family but she is impressed by his cooking and how he genuinely seems to care about Emma. Margot later visits Max on the day of Emma's funeral and expresses her upset over his absence. She then comforts him and Max's sister Carol Jackson (Lindsey Coulson) witnesses this and accuses Max of making a pass at Margot."]}, {"page": "Casualty (series 30)", "response": ["Amy Noble made four guest appearances throughout the series as PC Kate Wilkinson. Kerry Bennett joined the cast in a recurring capacity as HART paramedic Jess Cranham in episode six, along with Anna Acton and Grace Doherty, who joined the cast as Jess's partner and daughter Nikki Chisom and Olivia Cranham in episode twelve, were part of a storyline which saw Dixie take \"center stage\". They were involved in a domestic abuse storyline which concluded in episode eighteen, broadcast on 9 January 2016, when a hostage situation and fire occurred leading to Nikki being arrested. Bennett and Doherty continued to appear in the series until episode twenty-one when they departed alongside Hazlegrove. The show's co-creator Paul Unwin pitched a storyline which saw Ethan and Cal discover they are adopted. Carol Royle was introduced as the brothers' biological mother Emilie Groome in episode sixteen. Her final appearance was made in episode twenty-seven, where she died at the seaside accompanied by Cal and Ethan. Hannah Spearritt joined the cast in a recurring capacity as Mercedes Christie, a drug addict that attacked Noel and later blackmailed Big Mac in a long-running storyline. She made her debut in episode twenty for one episode, and returned for more prominent appearances from episode twenty-four. Kelli Hollis joined the cast in episode twenty-four as Shelle Jones, Mercedes' drug dealer. Mercedes son and partner, Connor Christie and Vince Callaghan were introduced in episode twenty-eight, played by Toby Murray and Andrew Knott respectively. Connor departed in episode thirty-three, whilst Mercedes, Shelle and Vince made their final appearance in the following episode.", "* Anna Acton as Nikki Chisom"]}, {"page": "Acton, Anna", "response": ["#redirectAnna Acton"]}, {"page": "Who Killed Lucy Beale?", "response": ["For a major part of the storyline, the premise was that every character on the show (except for Stacey Branning (Lacey Turner), who was in prison at the time) could be a suspect. Following the episode that aired on 1 January 2015, the number of official suspects was whittled down to a list of fourteen, when character Emma Summerhayes (Anna Acton) sent a text message to the person she believed was the killer, with the fourteen characters all being on screen when the message reached its unspecified recipient's phone. By the end of January, Lauren Branning (Jacqueline Jossa) no longer appeared as a suspect in promotional material ahead of the anniversary episode, bringing the list of suspects down to thirteen. On 20 February 2015, it was revealed that Emma had sent the text message to Jane Beale (Laurie Brett), who was in fact covering for her adoptive son, Bobby Beale (Eliott Carrington).", "The next morning, Lucy's body is discovered by a young girl walking with her grandfather on Walford Common. DC Emma Summerhayes (Anna Acton) and DS Cameron Bryant (Glen Wallace) visit Ian to inform him they have found Lucy's body. Ian is inconsolable as he identifies her body and breaks the news to Jane, Denise, Cindy, Bobby and, later, Peter. It is revealed Lucy died because of a deliberate head injury. The police question the family and search Lucy's bedroom. Cindy tells Ian that Lucy was an habitual user of cocaine. Ian says that he was at his restaurant the previous evening, but Cindy says she went there and did not see him. Ian laments that he did not know his daughter at all and furiously throws Cindy out, forcing her to return to Devon. The police take a DNA sample from Lee before he returns to Afghanistan. Summerhayes returns to say that there has been a leak at the police station and the press have got hold of some vital information. It is explained that there was very little blood found at the common, meaning that Lucy was not killed in a mugging, but was murdered elsewhere, then dumped on the Common. Her purse and phone are also missing. David Wicks (Michael French) discovers Max's sexual relationship with Lucy and accuses him of killing her. Max denies it but David later finds CCTV footage of Max and Lucy arguing on the night of her death. David does not tell the police because he is worried that if Max is questioned it will affect the health of his cancer-stricken fiancée Carol Jackson (Lindsay Coulson), who is Max's sister. He says that he does not believe Max killed her and together they burn all computer evidence of the footage."]}, {"page": "Charlie Cotton (2014 character)", "response": ["Carol Jackson (Lindsey Coulson) asks Charlie to speak to her grandson, Liam Butcher (James Forde), as the police are asking questions about drug dealing. Charlie leaves his phone in the house, which Carol answers and discovers that Nick is alive. She confronts Charlie, who says Dot is better off without Nick and now he cannot return to her life. Carol tells Charlie to tell Dot the truth or she will, but eventually decides not to as Dot enjoys having Charlie around. However, Dot's stepson Max Branning (Jake Wood) is still suspicious of Charlie, and talks to DC Emma Summerhayes (Anna Acton), who cannot prove that Charlie is a police officer. However, when Charlie reveals to Emma that he knows about her affair with Max, he tells her to back off or he will expose her. Charlie shows up at a care home where he is greeted by Yvonne. She tells him that he is late for work and it is revealed that he is in fact a caretaker. Charlie's car window is smashed, and he receives a text message from Nick, confirming he did it. When Yvonne finds out, she insists they flee him to Ireland, and she forces him to say goodbye to Dot. He is unable to do so, and returns to Dot. With Yvonne gone, he moves in with her. He shows his angry side once again when he believes that Carol has told Dot about Nick still being alive, and, as a result, Carol's distrust grows and she orders him to do a DNA test to prove he is Dot's grandson. They intend to take DNA from Dot's toothbrush, she catches them but participates, and the tests reveal that Charlie is who he says he is."]}, {"page": "List of EastEnders characters (2015)", "response": ["|  A doctor who treats Emma Summerhayes (Anna Acton) in hospital after she is struck by Roxy Mitchell's (Rita Simons) car. He later informs Emma's partner Max Branning (Jake Wood) of her death. He appears again when Phil Mitchell (Steve McFadden), Ian Beale (Adam Woodyatt), and Steven Beale (Aaron Sidwell) arrive at the hospital after discovering that Ben Mitchell (Harry Reid) has been injured in a fight. Dr McLaughlin informs Ian and Phil that Ben has died of his injuries. When Phil and Ian identify the body and discover that it is actually Paul Coker (Jonny Labey) who has died, McLaughlin apologises to them for his mistake."]}, {"page": "The Gulf (play)", "response": ["Featuring Louisa Lytton and Anna Acton"]}]}}