{"wiki_id": "http://www.wikidata.org/entity/Q4761277", "itemLabel": "Andy Sandell", "itemDescription": "British footballer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Sandell", "wikipedia_page": {"main": "Andy Sandell (born 8 September 1983) is an English professional footballer who plays as a striker after a professional career as a left sided defender or midfielder.", "link_mentions": [{"page": "Sandell", "response": ["* Andy Sandell (born 1983), British football player"]}, {"page": "2006–07 Bristol Rovers F.C. season", "response": ["|align=\"left\"|Andy Sandell||3||0||3", "|align=\"left\"|Andy Sandell|| ||3"]}, {"page": "Billy Jones (footballer, born 1983)", "response": ["On 12 September 2013 Jones joined Newport County on a monthly contract as cover for the injured Andy Sandell. Jones made his debut for Newport County versus Morecambe on 14 September 2013 and scored within two minutes of kick-off. He was released by Newport in January 2014 and subsequently joined Gloucester City."]}, {"page": "2007–08 Bristol Rovers F.C. season", "response": ["|17 August|| Andy Sandell||Salisbury City||1 month||Loan", "|31 August|| Andy Sandell||Salisbury City||3 years||Undisclosed"]}, {"page": "2008–09 Aldershot Town F.C. season", "response": ["|  || Lincoln City || Home || Won 2–0 || align=\"center\"|2,625 || Andy Sandell, Scott Davies", "|  || Gillingham || Away || Draw 4–4 || align=\"center\"|5,974 || Andy Lindegaard, Dave Winfield, OG, Andy Sandell", "* 2 January: Andy Sandell joins in a permanent move following a successful loan spell from Salisbury City while Shots defender Dave Winfield moves in the opposite direction on a month-long loan deal."]}, {"page": "Dave Winfield (footballer)", "response": ["Having begun training at the end of 2008, Winfield was loaned out to Salisbury City of the Conference Premier in January 2009 on a one-month deal that saw Andy Sandell move the other way on a permanent deal. Winfield made his Football League debut in Aldershot's 2–1 defeat to Exeter City in February 2009."]}, {"page": "2007 Football League Trophy Final", "response": ["|MF || 17 || Andy Sandell || || "]}, {"page": "2007 Football League Two play-off Final", "response": ["|DF ||17 ||Andy Sandell"]}, {"page": "2009–10 Aldershot Town F.C. season", "response": ["|align=\"left\"|Andy Sandell||1||0||1"]}, {"page": "List of Newport County A.F.C. players", "response": ["*  Andy Sandell"]}, {"page": "2010–11 Wycombe Wanderers F.C. season", "response": ["|align=\"left\"|3||align=\"left\"|DF||align=\"left\"| Andy Sandell"]}, {"page": "2010–11 Aldershot Town F.C. season", "response": ["|DF|| Andy Sandell ||  Wycombe Wanderers || Free || 30 Jun 2010"]}, {"page": "2011–12 Newport County A.F.C. season", "response": ["The new year began with the short away trip to bottom-placed Bath City. County again took an early lead through Nat Jarvis in the 13th minute but lost the game 3–2 to give Bath only their third victory of the season. That loss pushed County back to the brink of the relegation zone, only staying out on goal difference. Away to Luton Town County lost 2–0 after debutant Ryan Charles was sent off after 32 minutes. After a home 0–0 draw with Forest Green Rovers County made the long trip to Gateshead. Finding themselves 2–0 down after 53 minutes Elliot Buchanan pulled a goal back in the 57th minute. As the game drew to a close another County defeat looked likely. However County were awarded a penalty in the 90th minute. Sam Foley's spot-kick was initially saved but he was quick to tap in the rebound. The comeback was complete in the 94th minute when substitute Jake Harris scored a 20-yard winner. Despite the victory County had now slipped back into the relegation zone. County's next game saw a return to Stockport County's Edgeley Park for the first time since January 1988. Finding themselves 1–0 behind after just seven minutes Andy Sandell equalised in the 50th minute before being sent off just eight minutes later. After Daniel Rowe grabbed his second of the game just minutes later the hosts were back in front with Newport a man down. As the clock ticked towards full-time Jake Harris scored the equaliser in the 87th minute having only been on the pitch for nine minutes. The next game saw a 1–0 revenge victory at home over Bath City. County had now left the relegation zone and leapt four places to 17th in the table. The following game saw another 1–0 revenge victory, this time against high-flying Mansfield Town. That victory took County to 16th in the table – the highest they had been since August. In the next game away at Tamworth County took an early lead through a 6th-minute Sam Foley penalty. As the game entered the final minutes this looked to be the third straight County victory but Tamworth equalised in the 83rd minute. Two minutes later and the hosts had won it, the final score a 2–1 County defeat. After an away 1–1 draw at Southport County were at home to mid-table Braintree Town. After only seven minutes on the clock Lee Minshull was sent off. County eventually lost 4–3 having played 83 minutes of normal time and 12 minutes of stoppage time with only ten men. By this point in the season County knew they had made the FA Trophy Final at Wembley but were still in danger of relegation. Away at Cambridge United County trailed 1–0 until Andy Sandell scored a penalty five minutes from time to earn County a 1–1 draw. Next up was a first trip to Lincoln City's Sincil Bank since the Third Division encounter in October 1985. The game was lost 2–0 and County found themselves just one place and one point above the relegation zone. County achieved their second double of the season in the next game, beating Gateshead 1–0 at home, but were still only one place and one point above relegation. The next game was the first of the three encounters with promotion hopefuls York City. County won 2–1. The third home game in a week resulted in a 0–0 draw against Telford United to take seven points out of the nine available. Away to Kidderminster Harriers Jake Reid scored for County within 10 seconds of kick-off and Sam Foley doubled the lead on 36 minutes. With full-time approaching Elliot Buchanan gave away a penalty in the 86th minute. Substitute Nick Wright duly converted it and full-time was up. However, in a disastrous spell of injury time Wright scored Kidderminster's equaliser in the 93rd minute and then the winner in the 95th minute for his hat-trick. The next game was the second of three games against York City. County again started well with Nat Jarvis scoring in the 4th minute. York equalised in the 59th minute and the game ended a 1–1 draw. County now knew that they only needed a point against relegated Darlington to secure league safety barring some statistically improbable results elsewhere. That point came with a 0–0 draw. Any doubts that County were now safe were extinguished by the following 1–0 victory over Alfreton Town. Manager Justin Edinburgh had achieved his aim of avoiding relegation. The final two league games of the season, results now immaterial, were a home 1–0 loss to second-placed Wrexham and a 3–1 loss to Barrow.", "|28||MF||align=\"left\"| Andy Sandell||10 (0)||2||0 (0)||0||10 (0)||2", "|6 Jan 2012||DF|| Andy Sandell||Chippenham Town||Free"]}, {"page": "2011–12 Stockport County F.C. season", "response": ["On 11 February Stockport stretched their unbeaten home run in the league to 5 games with a 2 - 2 draw against Newport County. Stockport's goals were both scored by Danny L. Rowe — The second of which was direct from a free kick. Andy Sandell pulled one back for Newport before being sent off eight minutes later. Jake Harris rescued a point for the visitors in the 86th minute. On 18 February Stockport lost 2–1 away at York City. Danny L. Rowe scored Stockport's only goal. Jamie Reed and Matthew Blinkhorn scored for York. On 25 February Stockport won 1–0 at home to Wrexham after Wrexham goalkeeper Joslain Mayebi put through his own net.Jay Harris was also sent-off for Wrexham. After the game both Danny M. Rowe (as a left back) and Jim Gannon (as manager) were named as part of the Non-League Paper's team of the day."]}, {"page": "2011–12 Wycombe Wanderers F.C. season", "response": ["| Andy Sandell"]}, {"page": "2012–13 Newport County A.F.C. season", "response": ["|13||DF||align=\"left\"| Andy Sandell||42 (0)||9||3 (0)||0||45 (0)||9", "|LM ||13 || Andy Sandell"]}, {"page": "2013 Conference Premier play-off Final", "response": ["As the game looked certain to go into extra time Jolley headed a warning shot just wide of goal in the 83rd minute. Wrexham failed to heed the warning and in the 86th minute a long up-field pass from Andy Sandell was headed backwards by Wrexham's David Artell into the path of Jolley who made no mistake in lifting it over the on-rushing Chris Maxwell and into the goal.", "|LM ||13 ||Andy Sandell"]}, {"page": "2013–14 Newport County A.F.C. season", "response": ["The season started with the visit of Accrington Stanley. This game was selected as one of the Football League's \"anniversary fixtures\" to mark the 125th anniversary of the first Football League season. With Harry Worley scoring the historic first League goal, a brace from Chris Zebroski and a goal from Christian Jolley 10 minutes into the second half, County won 4–1 and were top of the League Two table. In the next game away to Northampton, Conor Washington scored his first League goal but the club suffered a 3–1 loss. The next home game, the Severnside derby with Bristol Rovers saw County's highest gate of the season; Andy Sandell's first-half penalty being enough to take all three points. The next three games were all drawn 1–1 with County slipping out of the play-off places as a result. The next home game, against Morecambe, will forever be remembered as the \"Tom Naylor game\": Scoring within three minutes, Billy Jones had made the perfect start to his début game before Naylor scored an own goal to level the match. Robbie Willmott restored Newport's lead before Naylor's second own goal again levelled things. With 20 minutes remaining Naylor conceded a penalty which allowed Morecambe to take the lead and eventually win the game. County's first away win of the season in the next game at Exeter, followed by a home win to Torquay United took County back to the brink of the play-off positions, but following the next two games they were back down to 12th. County then embarked on a successful spell, losing only once at Fleetwood until visiting Burton Albion in the last game of 2013. That last game was lost 1–0, but County finished the year in a play-off position.", "The new year began in a disastrous fashion: The wettest winter on record in Britain combined with drainage problems with the Rodney Parade pitch caused a rash of game postponements. County failed to beat bottom-of-the-table Northampton and were denied even one point when Andy Sandell's 88th-minute penalty was saved. Previous wins against Accrington, Bristol, Southend and Hartlepool were cancelled out with only two draws to show from the four matches. A solitary home win against Oxford United lifted County back to the brink of the play-offs again, but then another terrible run resulted in only three points from the next eight games. With County now lying in 14th position, any hope of the play-offs was gone. County's first double of the season against Torquay in next game briefly lifted them to 12th, but following the second 0–0 draw with Bury of the season, previous wins against Portsmouth and Chesterfield were cancelled out. Following a home loss against Plymouth Argyle County recorded only their third win of 2014 against relegation-threatened Wycombe Wanderers. In the next two games County squandered leads to draw both games, slipping down to their lowest league position of the season in the process. The penultimate game of the season was the trip to promotion-chasing York. County failed to improve on their recent form as the home side guaranteed themselves a play-off place with a 1–0 win. The final game of the season against Rochdale was an eerie reminder of County's last Football League season in 1987–88. That time the visitors has triumphed 1–0 and they would be hoping for another win to seal the League Two title. Despite taking the lead in the 28th minute, Aaron O'Connor cancelled out the advantage just before half time. Rochdale should have won the game after winning a penalty in the 83rd minute, but Matthew Lund's penalty was saved by Ian McLoughlin. Ten-man County made them pay four minutes later as Robbie Willmott's free kick was headed over Josh Lillis by Kevin Feely to seal a 2–1 victory and a happy end to County's 2013–14 campaign.", "|13||DF||align=\"left\"| Andy Sandell||21 (2)||3||0 (1)||0||2 (0)||0||1 (0)||0||24 (3)||3"]}, {"page": "2014–15 Newport County A.F.C. season", "response": ["|13||Andy Sandell||LB||||Calne||||121||14||Chippenham Town||1 January 2012||Free||2015", "|12 May 2015||DF|| Andy Sandell||Released|||| "]}, {"page": "List of Chippenham Town F.C. seasons", "response": ["|Andy Sandell", "|Andy Sandell", "|Andy Sandell"]}, {"page": "Joe Parker (footballer)", "response": ["Parker made his Football League debut for Newport County in the League Two fixture versus Cambridge United on 17 January 2015 as a second-half substitute for Andy Sandell. Newport lost the match 4–0. He was released by Newport in May 2015 at the end of his contract.Newport players released"]}, {"page": "2015–16 Southern Football League", "response": ["| Andy Sandell"]}]}}