{"wiki_id": "http://www.wikidata.org/entity/Q4760118", "itemLabel": "Andrée Bernard", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Andr%C3%A9e_Bernard", "wikipedia_page": {"main": "Andrée Bernard is an English actress best known for her major role as Liz Burton in the British soap opera Hollyoaks. Only Fools & Horses, recurring guest artist in Holby City and West End lead roles in Hair, Kiss Me Kate. She has been working with Steven Berkoff over recent years including playing Sarah in The Actors Lament & Eve in 6 Actors In Search Of A Director in Londons West End.\nBorn as Andree Barnard, she started acting in her early teens and, by the age of 17 in 1983, was appearing in episodes of The Two Ronnies and playing one of the two leading characters in the 1984 television film Sharon & Michelle. She also starred in Only Fools and Horses as Nervous Nerys In 1991 she played Gordon Brittas' secretary Angie throughout the first series of The Brittas Empire and appeared as Nervous Nerys, barmaid in the Nag's Head, in Only Fools and Horses. In 1995 she appeared as Terri Gordon in The Black Orchid an episode of \"Taggart \". She appeared in episodes of Lovejoy, Silent Witness and Agatha Christie's Poirot and has made various, multiple appearances in The Bill. She appeared as \"Dolly\" in the Doctor Who episode \"The Shakespeare Code\". Most recently appeared in Steven Berkoff's play 6 Actors in Search of a Director, together with Neil Stuke (\"Silk\"). Bernard also provided the voice of Nancy Hamilton in the video game, Clock Tower 3.She has also starred in Holby City (2015-2017), Playing Dead (2018), The Bill playing various roles between 1992-2009, Crossroads (2002), Casualty (1993 and 1997), Taggart (1995)", "link_mentions": [{"page": "The Crying Game", "response": ["* Andrée Bernard as Jane"]}, {"page": "The Brittas Empire", "response": ["Cast alterations in the series: 'Angie' (Andrée Bernard), who appears as a main character in the first series, is replaced by 'Julie' from series two onwards. 'Laura' left the show after series five, at the same time as the creators and writers.  She is replaced in series six by the character 'Penny' (Anouschka Menzies). 'Penny' did not return in series seven."]}, {"page": "The Two Ronnies", "response": ["Before achieving fame in the sitcom Hi-De-Hi, Barry Howard appeared in several early episodes as an uncredited extra. Other actors who appeared as extras before their rise to fame include Andrée Bernard and John Scott Martin."]}, {"page": "Evil Queen", "response": ["Actresses who have played the Wicked Queen in \"Snow White\" stage productions (usually pantomime plays) have included Stephanie Beacham, Lucy Benjamin, Andrée Bernard (as Queen Lacretia), Jennifer Ellison, Jade Goody, Jerry Hall, Lesley Joseph, Patsy Kensit, Josie Lawrence (as Morgiana the Wicked Queen), Joanne Malin, Vicki Michelle, Denise Nolan, Su Pollard, Priscilla Presley, Liz Robertson, and Toyah Willcox. The role was also played by \"Lily Savage\" (Paul O'Grady) and Craig Revel Horwood."]}, {"page": "Hercule Poirot's Christmas", "response": ["*Andrée Bernard as Magdalene Lee"]}, {"page": "Bernard and the Genie", "response": ["* Andrée Bernard as Judy"]}, {"page": "List of former Hollyoaks characters", "response": ["|Liz Burton || Andrée Bernard || 2003–2006"]}, {"page": "Mel Burton", "response": ["In the lead up to her mother, Liz Burton's (Andrée Bernard) wedding to Richard Taylor (Richard Calkin), Mel agrees to be a bridesmaid. Bernard said Liz is delighted as Mel has taken some persuading. Following the wedding, Mel overhears her stepbrother Ali Taylor (Luti Fagbenle) telling Richard that her father's death was suicide rather than a heart attack. Bernard commented that \"all hell breaks loose!\" Mel confronts her mother at the reception, devastating her brother Justin (Chris Fountain). Things are made worse when Mel and Justin realise that Sophie knew the truth because she found their father's body. Of Liz's decision to keep the truth from her children, Bernard explained: \"Liz thought she was doing what was best by keeping it from Mel and Justin, because she wanted to protect them. But now it's out, they have to revisit their grief all over again.\" The actress added the storyline would have \"far-reaching\" consequences for the whole family."]}, {"page": "List of Only Fools and Horses characters", "response": ["\"Nervous\" Nerys (Andrée Bernard) was the Nag's Head barmaid who appeared in two episodes, Dates and Sickness and Wealth. She briefly dated Rodney, although she was left terrified when a gang of yobs chased them in the van. Nerys was later scared again when she interrupted the seance that the Trotters were attending."]}, {"page": "André Bernard", "response": ["* Andrée Bernard (born 1966), English actress"]}, {"page": "The Shepherd: Border Patrol", "response": ["* Andrée Bernard as Lexxie"]}, {"page": "Paradise 5", "response": ["*Lorelei – Andrée Bernard"]}, {"page": "List of Hollyoaks characters (2003)", "response": ["But to prove he was not gay, Joe began dating Jodie Nash (Kate McEnery) after the pair met on a dating spree contest. However it wasn't too last for too long as Joe moved on to his next relationship, this time with Sophie Burton (Connie Powney). The pair seemed like love's young dream couple, but Joe felt the strain after he thought Sophie became too pushy in the relationship after introducing Joe to her mother Liz Burton (Andrée Bernard). Soon after, Sophie ended the relationship with Joe after learning that he was going to dump her. Joe soon built up a good friendship relations with Dannii Carbone (Christina Baily), Russ Owen (Stuart Manning) and Jeremy Peterson (Simon Cole). He also revealed that he had a rocky relationship with his alcoholic father, a police officer, who was abusive towards Joe's mother. He was also smitten with ice-queen Louise Summers (Roxanne McKee), despite the fact she has shown no interest in him.", "Elizabeth Burton (also Taylor) is played by Andrée Bernard and first appeared on 10 October 2003. She single mother of three teenagers Mel, Sophie, and Justin, Liz spent most of her life trying to maintain the peace between her offspring, after their father committed suicide. She had a difficult relationship with her stepdaughter Darlene, made worse when Darlene found out that her brother Ali had (accidentally) stabbed school bully Stephen \"Macki\" Mackintosh to death, but told the police that she suspected Liz's son Justin of being the killer. Darlene changed her testimony in court, which contributed towards Justin being acquitted of killing Macki and Liz was grateful to Darlene for this. After Justin returned home, Liz chucked Richard out for having an affair with a colleague but said Darlene could stay with them. Liz had decided that her family should move away from Hollyoaks to Colchester, to start afresh. However, all of her children were unwilling to move with her and she left Hollyoaks without Mel, Sophie and Justin."]}, {"page": "Andree Bernard", "response": ["#REDIRECT Andrée Bernard"]}, {"page": "The Feast of Axos", "response": ["*Joanna Slade – Andrée Bernard", "*Andrée Bernard played Dolly Bailey in \"The Shakespeare Code\"."]}, {"page": "The Sea Change", "response": ["* Andrée Bernard - Sarah"]}, {"page": "Andrée (given name)", "response": ["* Andrée Bernard (born 1966), English television actress"]}, {"page": "Raf di Lucca", "response": ["Fletch later enters Raf into a charity date auction and Serena's friend Sian Kors (Andrée Bernard) is the winning bidder. When asked if Raf was ready for love, McFadden replied that he was \"mortified\". Raf initially believes that Sian is not serious about their date, but she soon turns up on AAU and he feels a bit intimidated by her, as she knows what she wants. McFadden explained that Raf decides to go out with Sian when it appears Cara is not interested in pursuing a relationship with him. McFadden assured fans that there would be a resolution to the pair's \"will-they-won't they\" romance, but said there were some \"shocks in store\" for them. The couple became popular with fans on social media, and McFadden pointed out that they had been given the portmanteau \"Rara\". Weeks later, Cara suddenly kissed Raf, leading him to believe that she wanted to start a relationship with him. However, the kiss only proved to Cara that she was not over her ex-husband, while Fletch was forced to point out to Raf that Cara was not ready for a new romance. An Inside Soap columnist thought the development could be the end to any potential relationship between Raf and Cara, unless the nurse changed her mind later on."]}, {"page": "A Full Day's Work", "response": ["* Andrée Bernard - La mère Rousseau, 15 ans plus tot"]}]}}