{"wiki_id": "http://www.wikidata.org/entity/Q4768278", "itemLabel": "Anne Donovan", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Donovan_(author)", "wikipedia_page": {"main": "Anne Donovan is a Scottish author from Glasgow best known for her novel Being Emily (Canongate, 2003). Her short story collection Hieroglyphics and Other Stories was published in 2001. This is currently one of the prose set texts for Scottish Literature in Scottish schools. Her first novel, Buddha Da, was shortlisted for the Orange Prize in 2003. A second novel, Being Emily, followed in 2008. Her most recent novel Gone Are The Leaves (Canongate, 2014), was short-listed for the 2014 Saltire Scottish Literary Book of the Year Award.\n\n", "link_mentions": [{"page": "List of Women's Prize for Fiction winners", "response": ["|Anne Donovan, Buddha DaShena Mackay, HeligolandCarol Shields, UnlessZadie Smith, The Autograph ManDonna Tartt, The Little Friend"]}, {"page": "Coatbridge", "response": ["Janet Hamilton, the nineteenth century poet and essayist, died in Langloan in 1873. Present-day writers Anne Donovan (Orange prize winner), Brian Conaghan (the author of three novels The Boy Who Made it Rain' (2011) 'When Mr Dog Bites' (2014) and 'The Bombs That Brought Us Together' (2016)) and award-winning author Des Dillon are all from Coatbridge. Coatbridge has regularly featured in Des Dillon's work. Two of his books about Coatbridge have been turned into plays."]}, {"page": "Glasgow Caledonian University", "response": ["The Caledonian Cultural Fellows Initiative was set up in 2009 with the aim of enhancing university cultural life and promoting cultural engagement with wider community. Liz Lochhead, the Scots Makar, is the current Honorary President of the Fellowship, whose membership includes writer Anne Donovan, poet and novelist Jackie Kay, and artist Toby Paterson."]}, {"page": "Anne Donovan", "response": ["*Anne Donovan on Find A Grave"]}, {"page": "Buddha Da", "response": ["Buddha Da (2003) is a novel by Scottish author Anne Donovan.  It was shortlisted for the 2003 Orange Prize, and the 2003 Whitbread Book Award for a first novel.", "*Interview with Anne Donovan"]}, {"page": "Association for Scottish Literary Studies", "response": ["Since its first issue in 1983, many contemporary Scottish writers have had early work published in ASLS's annual anthology of new short fiction and poetry, New Writing Scotland, including Leila Aboulela, Lin Anderson, Iain Banks, Polly Clark,  Anne Donovan, Janice Galloway, Jane Harris, Gail Honeyman, Kathleen Jamie, A L Kennedy, James Meek, Ian Rankin, James Robertson, Suhayl Saadi, Ali Smith, Chiew-Siah Tei, Irvine Welsh, and others. New Writing Scotland is part-funded by Creative Scotland."]}, {"page": "2003 in Scotland", "response": ["* Anne Donovan's first full-length novel Buddha Da is published."]}, {"page": "2001 in Scotland", "response": ["* Anne Donovan's collection Hieroglyphics and Other Stories is published."]}, {"page": "Lu Kemp", "response": ["| Anne Donovan"]}]}}