{"wiki_id": "http://www.wikidata.org/entity/Q4768414", "itemLabel": "Anne Hampson", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Hampson", "wikipedia_page": {"main": "Anne Hampson (28 November 1928 – 25 September 2014) was a British writer of over 125 romance novels in Mills & Boon from 1969 to 1998. She published historical romance novels under the pseudonym Jane Wilby. Although she retired in 1998, in 2005 she published two romance and a crime novel. She has written an autobiography entitled Fate Was My Friend.", "link_mentions": [{"page": "Wilby", "response": ["* Jane Wilby, pseudonym of Anne Hampson (1928–2014), author"]}, {"page": "Harlequin Enterprises", "response": ["At the time that Harlequin purchased Mills & Boon, the company published only one line of category romances.  Six novels were released each month in this line, known as Harlequin Romance.  At John Boon's urging, in 1973 Harlequin introduced a second line, Harlequin Presents.  Designed partially to highlight three popular and prolific authors, Anne Hampson, Anne Mather, and Violet Winspear, these novels were slightly more sensual than their Harlequin Romance counterparts.  Although Mary Bonnycastle disapproved of the more sensual nature of these novels, they had sold well in Great Britain, and the company chose to distribute them in North America as well.  Within two years the Harlequin Presents novels were outselling Harlequin Romance."]}, {"page": "Anne Mather", "response": ["In 1973, she became a launch author for the new Harlequin Presents line of category romance novels. Harlequin Presents books were more sensual than the previous line, Harlequin Romance, under which Anne Mather had been published. She was chosen to be a launch author because she, along with Violet Winspear and Anne Hampson were the most popular and prolific of Harlequin's authors."]}, {"page": "Jane Wilby", "response": ["#REDIRECT Anne Hampson"]}, {"page": "Violet Winspear", "response": ["In 1973, she became a launch author for the new Mills & Boon-Harlequin Presents line of category romance novels. Presents line books were more sexually explicit than the previous line, Romance, under which Winspear had been published. She was chosen to be a launch author because she, along with Anne Mather and Anne Hampson were the most popular and prolific British authors of Mills and Boon."]}, {"page": "Hampson", "response": ["*Anne Hampson, British novelist"]}, {"page": "Hampson (surname)", "response": ["*Anne Hampson (1928–2014), British novelist"]}, {"page": "List of Harlequin Romance novels released in 1971", "response": ["| # 1467 || Beyond The Sweet Waters || Anne Hampson || February 1971 ", "| # 1491 || When The Bough Breaks || Anne Hampson || May 1971 ", "| # 1522 || Love Hath An Island || Anne Hampson || September 1971 ", "| # 1551 || Stars Of Spring || Anne Hampson || December 1971 "]}]}}