{"wiki_id": "http://www.wikidata.org/entity/Q4762435", "itemLabel": "Angela Feeney", "itemDescription": "singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Angela_Feeney", "wikipedia_page": {"main": "Angela Feeney (born 19 October 1954  in West Belfast) is an Irish opera singer.\nShe made her professional singing debut as Cherubino in \"The Marriage of Figaro\" in 1977 and continued her studies in Munich.\nShe was the first Irish singer to be signed as a soloist by the Munich State Opera and has made guest appearances with the Bamberger Symphoniker and the Hamburg State Opera and Frankfurt Opera companies.\nHer performances include: Elvira in English National Opera's Don Giovanni and Un giorno di regno,  as Giulietta at the Wexford Festival (recorded live for BBC Radio 3). She opened Cork City Opera's first season as Leonora in Il trovatore and returned the following year in La bohème as Mimi. She has performed Madame Butterfly at the Berlin State Opera. Other performances have been as Marie in The Bartered Bride, Michaela in Carmen and Nedda in Pagliacci\nAngela Feeney is founder of the Belfast Classical Music Bursary Scheme and initiated Féile an Phobail's West Belfast Classical Bursary Awards, and has promoted various charities and tourism in local and wider Northern Ireland. In 2002 she was recognised by the Belfast City Council and given a special award by the judges in recognition of her outstanding services.\nIn 2006, she was honored by Queen's University at Belfast at which Queen’s Senator Brian Hanna stated: \"“Angela is an international opera singer who has made an outstanding contribution to the arts both on the international stage and here in her native city where her name is synonymous with the West Belfast Classical Music Bursary Awards which began in 1994 and now continue as the Belfast Classical Music Bursaries.\"", "link_mentions": [{"page": "List of Irish people", "response": ["* Angela Feeney – opera singer"]}, {"page": "1954 in Northern Ireland", "response": ["*19 October – Angela Feeney, opera singer."]}, {"page": "Feeney", "response": ["* Angela Feeney, Northern Irish singer"]}, {"page": "List of operas performed at the Wexford Festival", "response": ["|1981 || Un giorno di regno ||  Verdi || Italian || 1840 ||  James Judd ||  Sesto Bruscantini ||  Tim Reed ||  Angela Feeney, Lucia Aliberti,Sesto Bruscantini"]}, {"page": "St Rose's Dominican College", "response": ["* Angela Feeney (born 1954) – opera singer"]}]}}