{"wiki_id": "http://www.wikidata.org/entity/Q4766568", "itemLabel": "Ann Michelle", "itemDescription": "British actor and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Michelle", "wikipedia_page": {"main": "Ann Michelle (born 11 August 1952 in Chigwell, Essex) is a British actress and writer.\nHer father Joseph was a fish trader at Billingsgate Fish Market and her mother Shirley an actress. One of her sisters is the actress Vicki Michelle. While her parents were at work, they employed Elke Sommer as an au-pair girl to look after Michelle and her three sisters.Michelle's most notable acting roles were as Jane Pettibone in the cult British horror film Psychomania (1973) as well as House of Whipcord (1974), Mistress Pamela (1974), Cruel Passion (1977), Young Lady Chatterley (1977), Haunted (1977), and French Quarter (1978).Michelle also starred in Virgin Witch (1972) opposite her sister Vicki. She  later disowned Virgin Witch, according to an article in the Sarasota Herald of 12 November 1973, saying that the producer had just wanted nude scenes.In 1981 Michelle had a prominent role in the TV adaptation of Levkas Man.Michelle is a director of the Trading Faces celebrity agency.She was married to the Reading Racers speedway rider Richard May.", "link_mentions": [{"page": "Vicki Michelle", "response": ["The eldest of four daughters, Michelle was born in Chigwell, Essex. Her father Joseph was a fish trader at Billingsgate Fish Market and her mother Shirley an actress. One of her sisters is the actress and writer Ann Michelle. While her parents were at work, they employed an au-pair girl to look after Michelle and her three sisters; the girl they employed was future Hollywood actress Elke Sommer. Michelle attended Knewnham Junior School in Wanstead and then West Hatch High School. After O-levels she stayed on at school to complete a secretarial course. Hoping to become a ballet dancer she joined the Aida Foster stage school."]}, {"page": "Lee Ann Michelle", "response": ["Lee Ann Michelle (born 17 March 1960) is an English model and actress. She was chosen as Playboy magazine's Playmate of the Month for the February 1979 issue. Her centerfold was photographed by Mario Casilli. She is the first Playmate to have been born in the 1960s."]}, {"page": "Widows (TV series)", "response": ["* Ann Michelle as Jackie Rawlins"]}, {"page": "Virgin Witch", "response": ["*Ann Michelle as Christine ", "The Michelle sisters have disowned the film. Vicki's website makes no mention of it, while Ann's refers to it as \"not an experience Ann cares to remember\".Vicki Michelle's websiteAnn Michelle's website"]}, {"page": "Come Back Mrs. Noah", "response": ["*Ann Michelle as Scarth Dare"]}, {"page": "David Whitaker (composer)", "response": ["* 1974: Mistress Pamela, directed by Jim O'Connolly, starring Ann Michelle"]}, {"page": "List of British films of 1971", "response": ["|Psychomania||Don Sharp ||Nicky Henson, Lee Ann Michelle, Roy Holder ||Horror ||", "|Virgin Witch||Ray Austin||Ann Michelle, Vicki Michelle||Horror||"]}, {"page": "List of British films of 1974", "response": ["| House of Whipcord || Pete Walker || Patrick Barr, Ray Brooks, Ann Michelle || Horror ||", "|Mistress Pamela||Jim O'Connolly ||Ann Michelle, Julian Barnes||Drama||"]}, {"page": "Mistress Pamela", "response": ["Mistress Pamela is a 1973 British sex comedy drama film directed by Jim O'Connolly and starring Ann Michelle,  Dudley Foster, Anna Quayle and Anthony Sharp. It was loosely based on the 1740 novel Pamela, or Virtue Rewarded by Samuel Richardson.", "* Ann Michelle as Pamela Andrews"]}, {"page": "List of horror films of 1973", "response": ["| Nicky Henson, Mary Larkin, Ann Michelle "]}, {"page": "List of horror films of 1971", "response": ["| Ann Michelle, Vicki Michelle "]}, {"page": "Cruel Passion", "response": ["*Ann Michelle as Pauline"]}, {"page": "House of Whipcord", "response": ["Anne-Marie soon falls foul of Margaret's cruelty as she reminds the evil matron of the charge she killed and whose death cost her her career and reputation. Meanwhile, Anne-Marie's concerned flatmate Julia (Ann Michelle) and Julia's boyfriend Tony (Ray Brooks) track down Mark, who has now discovered the full extent of his mother's murderous deeds at the prison after seeing her minions dispose of a prisoner's corpse.", "*Ann Michelle  ...\t      Julia"]}, {"page": "Levkas Man", "response": ["* Ann Michelle - Nicola"]}, {"page": "Young Lady Chatterley", "response": ["* Ann Michelle as Gwen"]}, {"page": "French Quarter (film)", "response": ["The film stars Virginia Mayo, Bruce Davison, Alisha Fontaine, Ann Michelle and Lindsay Bloom in the lead roles, with Lance LeGault appearing uncredited.", "*  Ann Michelle as Coke-Eyed Laura / Policewoman in French Hotel"]}, {"page": "Haunted (1977 film)", "response": ["Haunted (also released as The Haunted) is a 1977 American independent horror film written and directed by Michael DeGaetano and starring Aldo Ray, Virginia Mayo, and Ann Michelle."]}]}}