{"wiki_id": "http://www.wikidata.org/entity/Q4761765", "itemLabel": "Aneurin Williams", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Aneurin_Williams", "wikipedia_page": {"main": "Aneurin Williams (11 October 1859 – 20 January 1924) was a British Liberal Party politician.", "link_mentions": [{"page": "North West Durham (UK Parliament constituency)", "response": ["|| 1914 || Aneurin Williams || Liberal", "thumb|120px|Aneurin Williams"]}, {"page": "Public Accounts Committee (United Kingdom)", "response": ["| Mr Aneurin Williams"]}, {"page": "National Liberal Club", "response": ["*Aneurin Williams, Liberal MP 1910 & 1914–22."]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| Aneurin Williams"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Aneurin Williams"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Aneurin Williams"]}, {"page": "Consett (UK Parliament constituency)", "response": ["|| 1918 || Aneurin Williams || Liberal", "thumb|140px|Aneurin Williams"]}, {"page": "1924 in Wales", "response": ["*20 January – Aneurin Williams, politician, 64‘WILLIAMS, Iolo Aneurin’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2007; online edn, Oxford University Press, Dec 2007 accessed 8 Jan 2014"]}, {"page": "Plymouth (UK Parliament constituency)", "response": ["| Aneurin Williams"]}, {"page": "1859 in Wales", "response": ["*11 Oct – Aneurin Williams, politician (died 1924)"]}, {"page": "Penry Williams", "response": ["Penry Williams (5 September 1866 – 26 June 1945) was a Liberal Party politician in England.  He was born in Middlesbrough, the son of Edward Williams, a Cleveland ironmaster.  He was a brother of Aneurin Williams MP."]}, {"page": "1914 North West Durham by-election", "response": ["*The Liberal candidate adopted on 4 January 1914 was the radical Aneurin Williams. He was Liberal MP for Plymouth (UK Parliament constituency) between the two general elections of 1910. He was chairman of the executive committee of the Land Nationalisation Society and a director of the First Garden City Ltd. He belonged to a Middlesbrough firm of ironmasters.", "thumb|150px|Aneurin Williams", "The Liberal candidate Aneurin Williams launched his campaign at a public meeting in Consett on 5 January 1914, at which he was supported by his brother, the Liberal MP for Middlesbrough, Penry Williams.Dundee Courier, Angus, 6 Jan 1914 On 6 January 1914, Williams spoke at the Co-operative Hall, Stanley sharing a platform with Mr. Straughan.Newcastle Journal, Tyne and Wear, 7 Jan 1914 On 9 January 1914 Williams spoke at a public meeting in Quebec alongside the Rev. Thomas Dale of Waterhouses, who said the Liberal party in the division had secured a very worthy candidate.Newcastle Journal, Tyne and Wear, 10 Jan 1914", "On 20 January 1914, the Liberal candidate, Aneurin Williams declared that he advocated Irish Home Rule, religious equality in Wales, the abolition of Plural voting, further reform of the House of Lords, land and housing reform and popular control over licences.Dundee Courier, Angus Other issues to feature in his campaign included a defence of National Insurance and improvements to the conditions of agricultural labourers.The Times 2 Feb 1914 p10", "The issue of Women's suffrage also featured in the campaign. A combination of the Unionist Party, the Irish Nationalists and a minority of Liberals had defeated the measure earlier in the parliament. The Liberal candidate, Aneurin Williams was a vocal supporter of giving women the vote while his Unionist opponent Hardicker was an opponent. Despite this, the National Union of Women's Suffrage Societies chose to enter the campaign in support of the Labour Party candidate, greatly increasing the chances of victory for the anti-suffrage Unionist candidate.Barry Dackombe, Journal of Liberal History, Volume 57 It was announced on 15 January 1914 that the Militant Women's Social and Political Union had established campaign headquarters in Consett to also campaign in support of the Labour candidate.Western Daily Press, Bristol, 16 Jan 1914", "The influential Durham Miners' Association had initially withheld their official support from the Labour Party candidate, but their executive committee passed a motion calling on all miners to support the Socialist candidate.The Times, 8/1/1914 p8 Although there was a sizeable mining community in the constituency, the Association had not pressed to have their own candidate. The fact that the Labour Party candidate was neither local nor a miner, meant he had limited appeal to their members. At this time the Durham Miners were fairly evenly split between those like their President William House, who supported the Labour Party and those like their General Secretary John Wilson who supported the Liberal Party. The pro-Labour Party element of the Union were still reeling from the 1913 Houghton-le-Spring by-election when House stood as a DMA endorsed Labour Party candidate and came third, while miners lodges across the constituency supported the Liberal, who won despite not being a miner.Political Change and the Labour Party 1900-1918 by Duncan Tanner However, that did not stop individual miners leaders taking different sides in the campaign. On 20 January, the Liberal Aneurin Williams spoke at the Council School, Tanfield Lea. He shared the platform with J. J. Gray, a checkweigher at the Tanfield Lea Colliery.", "*Liberal Party: Aneurin Williams"]}, {"page": "Edward Williams (composer)", "response": ["Edward Aneurin Williams (20 August 1921 – 8 December 2013) was a British composer and electronic music pioneer, best known for his work on the BBC Television series Life on Earth, and as the creator of Soundbeam. Two of the documentaries he composed scores for were Academy Award winners, including Dylan Thomas (1961), which won an Oscar in 1963,Thomas, Colin. Obituary, The Guardian, 19 December, 2013 and Wild Wings (1965), which won an Oscar in 1967.Short Film Winners: 1967 Oscars-YouTube", "Although of Welsh descent, Edward Williams was born in Hindhead, Surrey. His father Iolo Aneurin Williams was a poet, journalist, folk song collector and politician, and his American mother Francion Elinor Dixon was the musical daughter of a Colorado cattle rancher. He was the grandson of Liberal politician Aneurin Williams, the nephew of politician Ursula Williams, and a distant relative of the Welsh poet Iolo Morganwg. Williams was initially educated at Rugby School, and later went on to read Languages at Trinity College, Cambridge. He then served in the Royal Navy during World War II, working on minesweeping vessels."]}, {"page": "Ursula Williams", "response": ["She was the daughter of Liberal MP, Aneurin Williams and Helen Elizabeth Pattinson.‘WILLIAMS, Aneurin’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2007; online edn, Oxford University Press, Dec 2007 accessed 8 Jan 2014 Her brother was Iolo Aneurin Williams.‘WILLIAMS, Iolo Aneurin’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2007; online edn, Oxford University Press, Dec 2007 accessed 8 Jan 2014 She was awarded the British Empire Medal. Her nephew was the composer Edward Williams.", "Her brother Iolo Aneurin Williams was also involved in politics as Liberal candidate for Chelsea in 1924 and 1929.British parliamentary election results 1918-1949, Craig, F.W.S."]}, {"page": "List of titles in the Home University Library of Modern Knowledge", "response": ["* Co-partnership and Profit-sharing by Aneurin Williams"]}, {"page": "Iolo Aneurin Williams", "response": ["Captain Iolo Aneurin Williams (18 June 1890 – 18 January 1962), was a British author, journalist and Liberal Party politician. His son was the composer Edward Williams.", "Williams was born in Middlesbrough, the son of Aneurin Williams, who was a Liberal member of parliament. He was the brother of Ursula Williams who was also a Liberal politician. He was educated at Rugby School and King's College, Cambridge. In 1920 he married Francion Elinor Dixon. They had one son and two daughters.‘WILLIAMS, Iolo Aneurin’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2014 ; online edn, April 2014 accessed 8 April 2016"]}, {"page": "Edward Williams (iron-master)", "response": ["Williams was the grandson of the famous Iolo Morganwg and the son of Taliesin Williams. Edward's three sons Illtyd, Aneurin Williams and Penry Williams were also prominent figures in the North East of England, and the Welsh communities on Teesside. Penry Williams won the seats of Middlesbrough for the Liberal Party and Aneurin also won the Consett seat in 1918.", "Through Aneurin, he is the grandfather of Ursula Williams and Iolo Aneurin Williams. Iolo's son, also named Edward was a composer and electronic music pioneer."]}]}}