{"wiki_id": "http://www.wikidata.org/entity/Q4766711", "itemLabel": "Ann Trevor", "itemDescription": "British actress (1899-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Trevor", "wikipedia_page": {"main": "Ann Trevor (1899–1970) was a British actress. Her stage work included the original production of Noël Coward's Hay Fever at London's Ambassadors Theatre, in 1925.", "link_mentions": [{"page": "Daniel Deronda", "response": ["In 1921 a British silent drama film was produced starring Reginald Fox, Ann Trevor and Clive Brook. Walter Courtney Rowden made the film at Teddington Studios by Master Films."]}, {"page": "Hay Fever (play)", "response": ["| Ann Trevor"]}, {"page": "Maria Marten, or The Murder in the Red Barn", "response": ["*Ann Trevor as Nan, the maid"]}, {"page": "Build Thy House", "response": ["Build Thy House is a 1920 British silent film directed by Fred Goodwins, and starring Henry Ainley, Ann Trevor, Reginald Bach and Claude Rains in his film debut. The screenplay was written by Eliot Stannard from the story by S. Trevor Jones.BFI Database entry", "* Ann Trevor - Helen Dawson "]}, {"page": "Daniel Deronda (film)", "response": ["Daniel Deronda is a 1921 British silent drama film directed by Walter Courtney Rowden and starring Reginald Fox, Ann Trevor and Clive Brook. It is an adaptation of the 1876 novel Daniel Deronda by George Eliot. The short film was made at Teddington Studios by Master Films.", "* Ann Trevor - Mirah Lapidoth"]}, {"page": "Wuthering Heights (1920 film)", "response": ["* Ann Trevor - Cathy"]}, {"page": "A Tale of Two Cities (1922 film)", "response": ["A Tale of Two Cities is a 1922 British silent drama film directed by Walter Courtney Rowden and starring Clive Brook, Ann Trevor and J. Fisher White. The film is an adaptation of the 1859 novel A Tale of Two Cities by Charles Dickens, and its plot concerns events taking place during the French Revolution. It was made as part of the \"Tense Moments with Great Authors Series\" of films.", "* Ann Trevor as Lucie Manette"]}, {"page": "List of British films of 1920", "response": ["|Build Thy House || Fred Goodwins || Henry Ainley, Ann Trevor || ||"]}, {"page": "List of British films of 1921", "response": ["|Daniel Deronda||Walter Courtney Rowden||Reginald Fox, Ann Trevor, Clive Brook||Drama||"]}, {"page": "List of British films of 1922", "response": ["|A Rogue in Love || Albert Brouett || Frank Stanmore, Ann Trevor || Drama ||", "|A Tale of Two Cities||Walter Courtney Rowden||Clive Brook, Ann Trevor||Drama||"]}, {"page": "The Captive (play)", "response": ["*Ann Trevor – Gisele De Montcel"]}, {"page": "The Headmaster (film)", "response": ["* Ann Trevor as Antigone Sanctuary  "]}, {"page": "A Rogue in Love", "response": ["A Rogue in Love is a 1922 British silent film directed by Albert Brouett and starring Frank Stanmore, Ann Trevor and Gregory Scott.Goble p.172", "* Ann Trevor as Pattie Keable  "]}, {"page": "The Young Idea", "response": ["*Gerda (his daughter) – Ann Trevor", "The play was revived at the Embassy Theatre, Swiss Cottage, in North London in July 1931 and transferred to the St Martin's Theatre in the West End the following month, running for a total of 81 performances. Cecil Parker played George Brent, Ann Trevor was again Gerda and Arthur Macrae played Sholto.Mander and Mitchenson, p. 19"]}]}}