{"wiki_id": "http://www.wikidata.org/entity/Q4761490", "itemLabel": "Andy Williams", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Williams_(footballer,_born_1986)", "wikipedia_page": {"main": "Andrew David Williams (born 14 August 1986) is an English professional footballer who plays for EFL League One club Cheltenham Town. He plays as either a forward or a winger.", "link_mentions": [{"page": "Andrew Williams", "response": ["Andrew or Andy Williams may refer to:", "*Andy Williams (1927–2012), American singer", "**Andy Williams (album), eponymous 1958 compilation album", "*Andy Williams (Doves) (born 1970), English musician, member of the band Doves", "*Andy Williams (drummer) (born 1970), British musician, Casting Crowns member", "*Andy Williams (guitarist) (born 1977), American guitarist and professional wrestler", "*Andy Williams (K-Klass) (fl. 1990s), British musician, member of the dance band K-Klass", "*Andy Williams (The X Factor) (fl. 2007), contestant in series 4 of The X Factor UK", "*Andy Williams (visual effects), visual effects supervisor", "*Andy Williams (footballer, born 1962), English footballer", "*Andy Williams (Jamaican footballer) (born September 1977), Canadian-born Jamaican football (soccer) player", "*Andy Williams (Welsh footballer) (born October 1977), Wales international footballer", "*Andy Williams (footballer, born 1986), English footballer for Cheltenham Town", "*Andy Williams (rugby union) (born 1981), Welsh international rugby union player", "*Andy Williams (American football) (fl. 1990s), American football coach for Washburn University in Topeka, Kansas", "*Andy Williams (surgeon) (born 1964), British surgeon"]}, {"page": "List of Swindon Town F.C. seasons", "response": ["| Andy Williams (22)"]}, {"page": "2006 Conference National play-off Final", "response": ["Hereford equalised seven minutes later when Mkandawire won possession and found Adam Stansfield on the right wing, before continuing on a decoy run into the Halifax box. Stansfield's cross evaded the Halifax defence and found Andy Williams at the back post, who scored with a diving header. The first half ended with the run of play fairly equal, with Halifax making the better start to the match and Hereford responding after going a goal down.", "|FW ||16||Andy Williams || || "]}, {"page": "List of Swindon Town F.C. players", "response": ["|Andy Williams ||||FW||2012–15 ||105||35"]}, {"page": "John Marquis", "response": ["Marquis made his Doncaster Rovers debut in the opening game of the season at Accrington Stanley, where he started and played the full 90 minutes of a 3–2 loss. On 16 August 2016 he scored his first Doncaster Rovers goal, in a 1–0 win over Cambridge United, and he scored in the next game, another 1–0 win, over Cheltenham Town. He quickly established himself in the first team and formed a striking partnership with Andy Williams. He then scored twice on 10 September 2016, in a 5–1 win over Morecambe. He captained the side on 4 October 2016 in the EFL Trophy match against Derby County U21. After scoring seven times by the end of 2016, including a brace against Exeter City on 12 November 2016, his performances continued to receive praise; he was described by Ferguson as \"one of my best ever signings.\" He then went on a goal–scoring spree throughout January, scoring seven goals, against Portsmouth (twice), Barnet, Crewe Alexandra, Yeovil Town (twice) and Morecambe. His performances earned him a nomination for January's Player of the Month, but he lost out to Matt Godden. He went on to score eight more goals, including a brace against Leyton Orient on 18 March 2017 and a hat–trick against Grimsby Town on 1 April 2017. His good performances resulted in him being shortlisted for the Sky Bet League Two Player of the Season in March 2017 and winning the award after the end of the season. Having become a fans' favourite at the club, Marquis was voted the club's Player of the Season, scorer of the Goal of the Season and Players' Player of the Year, shared with James Coppinger. He was also named in the EFL League Two PFA Team of the Year. After scoring 26 goals in 40 league games by the end of the 2016–17 season, winning the Golden Boot and helping the side to promotion to League One the following season, Marquis stated that he would like a contract extension. It came after Marquis attracted interest from other clubs, including Mansfield Town."]}, {"page": "List of Northampton Town F.C. seasons", "response": ["|align=left| Andy Williams || 12"]}, {"page": "Bristol Rovers F.C.–Swindon Town F.C. rivalry", "response": ["|style=\"text-align:left;\"|Andy Williams||style=\"text-align:left;\"|||2007–2010||87||8||2012–2015||89||31"]}, {"page": "2012–13 Football League Cup", "response": ["|align=left|Andy Williams"]}, {"page": "2013–14 Yeovil Town F.C. season", "response": ["Yeovil's Championship season started with a trip to The Den to face Millwall, on 3 August. Yeovil won the match 1–0 thanks to a late goal from midfielder Ed Upson. On 6 August, Yeovil travelled to Southend to face Southend United in a Football League Cup first round tie, a first half goal from Kevin Dawson was enough for Yeovil to record a 1–0 victory and progress to the second round. The draw for the second round of the League Cup took place, on 8 August, and presented Yeovil with a home tie against Championship rivals Birmingham City. Yeovil then faced Birmingham City in their first home match in the Championship, the game started badly with goalkeeper Marek Štěch breaking his hand in two places after just eight minutes, Yeovil lost the match 1–0 through an unfortunate own-goal from centre back Danny Seaborne. After the match it was confirmed that striker Paddy Madden had been called up to the Republic of Ireland national team squad for the first time for their friendly against Wales. On 12 August, it was announced that Welsh international goalkeeper Wayne Hennessey had been lined up to join the club on loan from Wolverhampton Wanderers for an initial month, following the injury to Štěch, but this loan was scrapped after Hennessey suffered an injury setback while on international duty. On 14 August, striker Paddy Madden made his international debut as a 69th-minute substitute in the Republic of Ireland's 0–0 draw against Wales. On 16 August, Yeovil signed Cardiff City midfielder Joe Ralls on loan until January 2014. Prior to Yeovil's match with Burnley, the club confirmed the signings of Manchester United goalkeeper Sam Johnstone on a three-month loan deal, replacing the injured Wayne Hennessey, and former Northampton Town goalkeeper Chris Dunn on a one-year contract as further goalkeeper cover. Yeovil lost the first competitive meeting of the two sides 2–0 after second half goals from Keith Treacy and Sam Vokes. On 19 August, Yeovil's fringe players faced their Exeter City counterparts in a friendly which Yeovil won 3–2 thanks to a brace from Kieffer Moore and a goal from Michael Ngoo. The following day the club confirmed that new goalkeeper Sam Johnstone had suffered a finger injury prior to the match against Burnley and would be returning to Manchester United. The following day the club confirmed that Wolves keeper Wayne Hennessey would be rejoining the club on loan for an initial month. On 22 August, Yeovil confirmed that versatile midfielder/full-back Joe Edwards had signed a one-year contract extension to keep him at the club until the summer of 2015. The next day the club confirmed that former striker Andy Williams had re-signed for the club on a season long loan from Swindon Town. On 24 August, Yeovil lost their third consecutive match a 3–0 home defeat at the hands of Derby County. Following the match it was confirmed that Chelsea midfielder Billy Clifford had returned to his parent club prematurely, having featured only once during his loan spell.", "Yeovil travelled to Elland Road to face Leeds United on 2 November. A second half brace from Scottish forward Ross McCormack saw Yeovil lose the game 2–0 to slip to the foot of the Championship table. Following the game the club confirmed that striker Andy Williams had suffered a serious knee injury in training ruling him out for the rest of the season. Williams returned to parent club Swindon Town for treatment but officially remained on loan at Yeovil for the remainder of the season, with Yeovil still having to pay a portion of his wages. On 5 November, Yeovil faced Conference South side Weston-super-Mare in the second round of the Somerset Premier Cup, Yeovil won the match 4–1 but saw defender Luke Ayling sent off after being involved in a twenty-man brawl. Ayling being suspended for three non-first team matches for his violent conduct. On 10 November, Yeovil played Wigan Athletic and for the fourth time this season suffered a 1–0 home defeat. The game marked the final match of Wayne Hennessey's loan spell, and with the club confirming that first choice keeper Marek Štěch would be out for a further month with his hand injury Stuart Taylor arrived on a month loan from Reading. During the international break Yeovil faced the Latvian national team in a friendly at Huish Park on 18 November, Taylor made his non-competitive debut in this game. A 75th-minute goal from Valērijs Šabala was enough to earn Latvia a 1–0 victory. On 20 November, the club confirmed that just two days after joining the club goalkeeper Stuart Taylor was returning to Reading for \"personal reasons\". Yeovil traveled to Doncaster Rovers, on 22 November, with Chris Dunn making his debut in goal. Yeovil conceded early on but courtesy of a goal from former Doncaster player Byron Webster the game was level with ten minutes to go when Doncaster were reduced to ten men with sending off of midfielder Dean Furman. Despite this Yeovil lost the match 2–1 after conceding a late goal. On 26 November, last season's top goalscorer Paddy Madden was placed on the transfer list by the club. The loan transfer deadline day on 28 November, saw Yeovil sign three players on month long loan deals, Everton midfielder John Lundstram, Nottingham Forest forward Ishmael Miller and Liverpool forward Adam Morgan whose loan is set to be made permanent in the new year, while defender Danny Seaborne joined League One side Coventry City on loan until January. On 30 November, Yeovil traveled to Watford with all three loan signings making their debuts. Yeovil won the match 3–0 courtesy of goals from Byron Webster, Joe Edwards and Ishmael Miller with a goal on his debut. Following the game the club confirmed that Everton defender Shane Duffy had extended his loan for a third and final month until 27 December."]}, {"page": "2014–15 Football League One", "response": ["|align=\"left\"| Andy Williams"]}, {"page": "2014–15 Swindon Town F.C. season", "response": ["| Andy Williams || 21 || 0 || 0 || 1 || 22", "| Andy Williams || 2 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 0", "|Most appearances || Andy Williams", "|Top scorer || Andy Williams"]}, {"page": "2014–15 Yeovil Town F.C. season", "response": ["On 2 October, Manchester City striker Jordy Hiwula joined Yeovil on loan until 5 January. The 4 October, saw Yeovil face Milton Keynes Dons at Huish Park, MK Dons won the match 2–0 thanks to two second-half goals against a ten-man Yeovil side following Ben Nugent's dismissal for a second bookable offence. On 11 October, Yeovil travelled to Port Vale and lost the match 4–1 with an Aaron Martin goal the only thing to show for Yeovil's efforts as the club slipped back into the relegation zone of League One. Following the match, Yeovil signed Crystal Palace defender Ryan Inniss on a youth loan for an initial month. Inniss made his debut in an improved performance, on 18 October against Swindon Town. Despite James Hayter giving Yeovil a first-half lead a goal from former Glover Andy Williams earned Swindon a 1–1 draw. The following week saw Yeovil lose 2–0 away at Sheffield United, followed by a 3–0 home defeat to Rochdale which saw the club drop to 23rd in League One. On 27 October, Yeovil were drawn at home to Crawley Town in the first round of the FA Cup."]}]}}