{"wiki_id": "http://www.wikidata.org/entity/Q4769390", "itemLabel": "Annie Meinertzhagen", "itemDescription": "Scottish ornithologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Annie_Meinertzhagen", "wikipedia_page": {"main": "Annie Meinertzhagen (2 June 1889 – 6 July 1928) was a Scottish ornithologist who contributed to studies on British birds, most significantly the moulting patterns in ducks and waders. She married fellow ornithologist Richard Meinertzhagen in 1921 and died from a gunshot fired under suspicious circumstances.", "link_mentions": [{"page": "List of ornithologists", "response": ["*Annie Meinertzhagen – Scotland"]}, {"page": "Meinertzhagen", "response": ["* Annie Meinertzhagen (1889–1928), British ornithologist"]}, {"page": "Tibetan blackbird", "response": ["The Tibetan blackbird is one of 65 species in the genus Turdus. It was previously treated as a subspecies of the common blackbird (Turdus merula). However, a 2008 phylogenetic study by Johan Nylander and colleagues showed the Tibetan blackbird to be only distantly related to the common blackbird, with the species instead being sister to Kessler's thrush. Richard and Annie Meinertzhagen described a proposed subspecies buddae on the basis of the smaller bills of birds from Sikkim and Gyangtse in 1925, but this character is not consistent throughout the population, and the species is consequently treated as being monotypic."]}, {"page": "Swordale, Ross-shire", "response": ["The ornithologist Anne Constance Jackson was born at Swordale in 1889. She married fellow ornithologist and intelligence officer Richard Meinertzhagen, and was killed at Swordale in 1928, under circumstances which remain controversial (see Annie Meinertzhagen#Death)."]}, {"page": "Antipodes snipe", "response": ["The Antipodes Island snipe was first collected by Fairchild in 1887, and by Andreas Reischek in 1888.  It was first described by Walter Rothschild in 1893 as Gallinago tristrami in honour of Henry Baker Tristram. However, doubts were raised about the provenance of the type specimen, which appeared to be from the Auckland Islands, and Rothschild made a new description in 1927, recognising the Antipodes Island form as a subspecies of Coenocorypha aucklandica. The subspecific name honours British ornithologist Annie Meinertzhagen, the second wife of ornithologist Richard Meinertzhagen.Hartert (1927)."]}, {"page": "Anne Meinertzhagen", "response": ["#Redirect Annie Meinertzhagen"]}, {"page": "Anne Constance Jackson", "response": ["#Redirect Annie Meinertzhagen"]}, {"page": "Index of women scientists articles", "response": ["*Annie Meinertzhagen"]}]}}