{"wiki_id": "http://www.wikidata.org/entity/Q4768270", "itemLabel": "Anne Digby", "itemDescription": "British children's novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Digby", "wikipedia_page": {"main": "Anne Digby (born 5 May 1943 in Kingston upon Thames, Surrey) is a prolific British children's writer best known for the Trebizon series published between 1978 and 1994.\nDigby attended North London Collegiate School before becoming a magazine journalist, and lived in Paris for a time. She then worked as a press officer for Oxfam in Oxford. Her first novel was A Horse Called September (1975). From 1978 to 1994 she wrote fourteen school story novels set in the fictional Cornish boarding school Trebizon. She has also written the Me, Jill Robinson series of books, the Jug Valley Juniors series, Quicksilver Horse and The Big Swim of the Summer. She added six books to Enid Blyton's 1940–52 Naughtiest Girl series, 1999 to 2001 – which publisher Hachette catalogues as Naughtiest Girl, volumes 5 to 10 – and created the Three R Detective books for younger readers.\nFidra Books of Edinburgh has published a collector's edition of Fifth Year Friendships at Trebizon, which has a foreword by Digby, while new mass-market paperback editions of the first seven titles in the Trebizon series were published by Egmont in 2016 with more titles scheduled for 2017.[1]. All fourteen titles in the series also remain widely available as e-books.\nShe formerly lived in Dorset but now lives in East Sussex.", "link_mentions": [{"page": "List of children's literature writers", "response": ["*Anne Digby (born 1935) – Trebizon series"]}, {"page": "Trebizon", "response": ["Trebizon is a series of school story novels by Anne Digby set in the fictional school of that name. The fourteen novels were published between 1978 and 1994. Like Enid Blyton's much earlier creation, Malory Towers, Trebizon is located in Cornwall."]}, {"page": "The Naughtiest Girl", "response": ["The Naughtiest Girl is a series of novels written by Enid Blyton in the 1940s–1950s.  Unusually, they are set at a progressive boarding school rather than a traditional one. The school, Whyteleafe, bears a striking resemblance to the independent Suffolk boarding school, Summerhill.Blyton, Gillian, Introduction to ‘The Naughtiest Girl in the School’, Blyton, Enid, Hodder Children's Books, 2007,  Anne Digby, author of the Trebizon series, has written some additional books in the series.", "===Anne Digby continuation===", "The titles added by Anne Digby, at the invitation of the Enid Blyton copyright proprietors, were described as \"seamless\" by one reviewer in that they persuasively recreated the genuine publication and atmosphere but \"with welcome touches of greenness and conservationism\"Issue Archive | Books For Keeps  These are:"]}, {"page": "Fidra Books", "response": ["Other Fidra Books authors have included Olivia FitzRoy, Anne Digby,Overview of Trebizon series. Victoria Walker, Primrose Cumming, Elinor Lyon,Reissued titles described. Mabel Esther Allan, and Ruby Ferguson. These books have reappeared as larger-format paperbacks with thick paper and stiff card covers. Fidra Books uses in its reprints elements of the original dust wrapper; all contain a forward."]}, {"page": "Tammy (comics)", "response": ["Writers featured included Jenny McDade, who wrote Star Struck Sister, the first Bella Barlow story and Come Back, Bindi; Benita Brown, who wrote the science fiction story Tomorrow Town; Gerry Finley-Day, who wrote The Camp on Candy Island; Maureen Spurgeon, who wrote the Molly Mills stories;  Pat Mills, who wrote Granny's Town, Thursday's Child and Glenda's Glossy Pages; Malcolm Shaw, who wrote E.T. Estate; Ian Mennell, who wrote Namby Pamby and Cuckoo in the Nest; Alison Christie, who specialised in heart-tugging stories such as A Gran for the Gregorys and Cassie's Coach; Jay Over, who wrote Slave of the Clock and Pam of Pond Hill from the Jinty merger; Primrose Cumming, who wrote the later Bella Barlow stories; and Anne Digby, who wrote Olympia Jones; Terence Magee, who wrote The Four Friends at Spartan School, The Witch of Widecombe Wold and Sally In A Shell."]}, {"page": "The Naughtiest Girl Keeps a Secret", "response": ["The Naughtiest Girl Keeps a Secret (1999) is the first of a continuation of Enid Blyton's The Naughtiest Girl series by Anne Digby. The series follows four books first written by Enid Blyton in the 1940s, continuing Elizabeth Allen's adventures at Whyteleafe School. Elizabeth is still in the first form."]}, {"page": "The Naughtiest Girl Helps a Friend", "response": ["The Naughtiest Girl Helps a Friend is the second of Anne Digby's continuation of \"The Naughtiest Girl\" series (originally by Enid Blyton), and the sixth book about Elizabeth Allen, the \"Naughtiest Girl\" of the title."]}, {"page": "British girls' comics", "response": ["* Anne Digby — Tammy (Olympia Jones)"]}]}}