{"wiki_id": "http://www.wikidata.org/entity/Q4764100", "itemLabel": "Angus Dalgleish", "itemDescription": "Professor of Oncology at St George's, University of London and member of the United Kingdom Independence Party (UKIP)", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_Dalgleish", "wikipedia_page": {"main": "Angus George Dalgleish (born May 1950) FRCP FRCPath FMedSci is a professor of oncology at St George's, University of London, best known for his contributions to HIV/AIDS research. Dalgleish stood in 2015 for Parliament as a UKIP candidate.", "link_mentions": [{"page": "Dalglish", "response": ["* Angus Dalgleish (born 1950), British researcher"]}, {"page": "2015 United Kingdom general election debates", "response": ["| Angus Dalgleish"]}, {"page": "Issues in the 2016 United Kingdom European Union membership referendum", "response": ["On 9 June 2015, Angus Dalgleish, a professor at St George's, University of London, argued that leaving the EU would not damage UK's science as European collaboration in science, such as CERN and European Space Agency, had existed long before the Lisbon treaty was ratified, adding that it was a myth to think that if Britain left the EU, Britain would not be part of the collaborations, which already included many non-EU countries, such as Israel, Switzerland and Norway.EU Referendum: Brexit ‘will not damage UK research’ A. Dalgleish, Times Higher Education, 9 June 2016 If Britain left the EU, Dalgleish argued, reduction in opportunities for students to travel and study elsewhere in Europe would not make any difference: as far as education was concerned, a negative side to being in the EU was that it discriminated against students coming to Britain from non-EU countries. Dalgleish argued that a focus on British researcher's success in winning EU research grants ignored Britain's overall higher contribution to the EU budget and criticised some EU funded positions in academia, saying that the role of Jean Monnet Programmes was to \"politicise universities and push EU principles\""]}, {"page": "Brexit and arrangements for science and technology", "response": ["Commenting in 2016, Kurt Deketelaere, secretary-general of the League of European Research Universities in Leuven, Belgium, whose purpose is to influence policy in Europe and to develop best practice through mutual exchange of experience, said that the potential loss of mobility and collaboration was worrying for scientists across Europe, as scientists wished 'to work with the best in their field'. However, for Angus Dalgleish, a cancer and HIV researcher at St George’s, University of London, who once stood for election as a member of the pro-Brexit UK Independence Party, universities already maintained successful collaborations with non-EU members, so opting out would have 'no negative impact on scientific collaboration whatsoever'."]}, {"page": "Steven C. Quay", "response": ["In September 2021, Steven published a book, The Origin of the Virus: The hidden truths behind the microbe that killed millions of people, along with Angus Dalgleish and Paolo Barnard."]}]}}