{"wiki_id": "http://www.wikidata.org/entity/Q4764258", "itemLabel": "Angus Sutherland", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_Sutherland_(politician)", "wikipedia_page": {"main": "Angus Sutherland CB (1848 – 16 January 1922) was a Scottish Liberal politician.\nAngus was the son of William Sutherland, a crofter whose parents had suffered eviction as a consequence of the Highland Clearances. He grew up in Helmsdale and was educated at the parish school. He went on to Edinburgh Training College and Glasgow University. He taught in Aberfeldy and later became tutor to John Sinclair who was later to become Secretary for Scotland from 1905 to 1912.  In 1885 he stood as crofter's candidate for the parliamentary seat of Sutherland against the incumbent member, the Marquess of Stafford, who was eldest son of the Duke of Sutherland. Although he was unsuccessful, when there was a further election in 1886, the Marquess chose not to stand, and Sutherland was elected as an MP. After nine years as an MP, in 1894 he resigned his post and became Chairman of the Fishery Board. In this role he chaired the Scottish Departmental Committee on the North Sea Fishing Industry \nHe was also a Member of Royal Commission on Highlands and Islands of Scotland, of the Congested Districts Board for Scotland and of the Royal Commission on Congestion in Ireland.\nHe was appointed a Companion of the Order of the Bath in 1907.", "link_mentions": [{"page": "Sutherland (UK Parliament constituency)", "response": ["|  Angus Sutherland"]}, {"page": "Crofters Party", "response": ["* Angus Sutherland was defeated in Sutherland, but won in 1886, when the incumbent Marquess of Sutherland did not stand. In 1894, Angus Sutherland was appointed Chairman of the Fishery Board for Scotland, causing a by-election in which John MacLeod was elected unopposed; MacLeod defeated the Liberal Unionist candidate the following year."]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Angus Sutherland"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Angus Sutherland"]}, {"page": "List of United Kingdom by-elections (1885–1900)", "response": ["|Angus Sutherland"]}, {"page": "William Sutherland (Liberal politician)", "response": ["Sutherland was born in Glasgow, the son of Alan Sutherland. He was educated at The High School of GlasgowBrian R.W. Lockart, The Town School – A History of The High School of Glasgow, Birlinn, Edinburgh, 2010 Page 163 and at Glasgow University where he gained an MA degree.,The Times, 20 September 1949, p7 and was admitted to the Middle Temple on 18 January 1904,Sturgess, H.A.C. (1949). Register of Admissions to the Honourable Society of the Middle Temple. Butterworth & Co. (Publishers) Ltd.: Temple Bar. Vol. 2, p.734. withdrawing without being Called to the Bar on 3 March 1927. On 27 August 1921 he married Annie Christine Fountain, CBE of Birthwaite Hall, near Barnsley. The wedding was attended by Prime Minister David Lloyd George and Mrs Lloyd George.The Times, 29 August 1921, p11 His wife died in 1949. His uncle, Angus Sutherland was Liberal MP for Sutherland from 1886 to 1894.Ewen A Cameron, Angus Sutherland in Dictionary of National Biography, OUP 2004–08"]}, {"page": "Angus Sutherland", "response": ["Angus Sutherland may refer to:", "* Angus Sutherland (actor) (born 1982), Canadian-American actor", "* Angus Sutherland (politician) (1848–1922), Scottish Liberal politician"]}, {"page": "John Macleod (Sutherland MP)", "response": ["Through the 1880s, he campaigned for the Highland Land League, and was one of the founders of the Sutherland county branch of the movement. He was the campaign agent for Angus Sutherland in the 1885 and 1886 general elections, when Sutherland was elected as the Crofters candidate for the county. In 1888 he moved to Inverness, where he became an editor of the Highland News. He was again active in the county Liberal association, and helped support the election of Donald MacGregor there in 1892. In 1893 he was elected as a representative for Lewis - where he had never visited - on the Ross-shire county council, and appointed Secretary of the Highland Land League.", "When Angus Sutherland stood down as an MP in 1894, Macleod was well-placed to secure the Liberal nomination as his successor. He was challenged by Dr. Donald Murray of Brora (later to become MP for the Western Isles), who felt that the county should have consulted more widely before selecting a candidate. Murray stood down in the interests of party unity, though not without a public rebuke to Macleod and his use of the Highland News.John o' Groat Journal, 26 October 1894"]}]}}