{"wiki_id": "http://www.wikidata.org/entity/Q4768533", "itemLabel": "Anne Lenner", "itemDescription": "English female vocalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Lenner", "wikipedia_page": {"main": "Anne Lenner (1912–1997) was a popular English female vocalist, singing with the dance bands of the 1930s and 1940s. She is most closely associated with Carroll Gibbons and the Savoy Orpheans, a band who regularly played at the Savoy Hotel in London; she made many studio recordings with this band. The British bands played a softer version of the swing jazz popular in the USA during the 1930s and 1940s.", "link_mentions": [{"page": "Carroll Gibbons", "response": ["Gibbons made occasional return trips to the United States but settled permanently in England, though he did spend a couple of years (1930–1931) in Hollywood, where he worked as a staff composer for MGM films. He took exclusive leadership of the Savoy Hotel Orpheans, which recorded hundreds of popular songs (many of which were sung by Anne Lenner) between June 1932 and his death in 1954, all featuring Gibbons on piano. Starting in about 1931, he also recorded many sophisticated records featuring a piano-led small group playing pop tunes and medleys under the name of Carroll Gibbons and his Boy Friends, of which some contained tracks by singer Hildegarde."]}, {"page": "British dance band", "response": ["* Anne Lenner"]}, {"page": "1997 in jazz", "response": ["** Anne Lenner, English singer (born 1912)."]}, {"page": "Ann Lenner", "response": ["#REDIRECT Anne Lenner"]}, {"page": "List of years in jazz", "response": ["* 1997 in jazz, deaths of Anne Lenner, Arthur Prysock, Bernard Anderson, Beverly Peer, Big Nick Nicholas, Carola Standertskjöld, Carson Smith, Charles Moffett, Chuck Andrus, Chuck Wayne, Dardanelle Hadley, Dick Marx, Dick Shearer, Doc Cheatham, Duncan Swift, Eddie Jones Eric Von Essen, Fela Kuti, George Chisholm, George Handy, Horst Lippmann, Hugh Lawson, Jimmy Witherspoon, Joe Roccisano, Johnny \"Hammond\" Smith, Johnny Coles, Johnny Mince, Lou Bennett, Louis Barbarin, Mouse Randolph, Rolf Ericson, Seldon Powell, Shake Keane, Stan Barker, Stéphane Grappelli, Tete Montoliu, Thelma Carpenter, Thurman Green, Tommy Tedesco, Tommy Turrentine, Tony Williams, Wally Rose, and Zachary Breaux; birth of Barbra Lica.", "* 1912 in jazz, births of Al Lucas, Alix Combelle, Alvin Alcorn, Anne Lenner, Anselmo Sacasas, Asser Fagerström, Beverly Peer, Bill Johnson, Bob Zurke, Clarence Profit, Dave Barbour, Don Byas, Erhard Bauschke, Ernst Höllerhagen, Franz Jackson, Fritz Schulz-Reichel, George T. Simon, Gil Evans, Gösta Törner, Harry Parry, Irving Fazola, Jean Omer, Jiří Traxler, John Levy, Johnny Mince, Joseph Reinhardt, Léo Marjane, Les Brown, Marshal Royal, Nellie Lutcher, Paloma Efron, Paul Bascomb, Paul Weston, Red Richards, Red Saunders, Svein Øvergaard, Ted Donnelly, Teddy Wilson, Thore Ehrling, Trummy Young, and Will Bradley."]}, {"page": "Deaths in June 1997", "response": ["*Anne Lenner, 84, English vocalist."]}, {"page": "1912 in jazz", "response": ["* 24 – Anne Lenner, English singer (died 1997)."]}, {"page": "Lenner", "response": ["*Anne Lenner (1912–1997), English singer"]}, {"page": "Peace Work", "response": ["When they return home to the UK, Spike leaves the Bill Hall Trio and joins the Ann Lenner Trio with Anne Lenner and old friend Reg O'List.    Their first engagement is another Army Welfare Show called Swinging Along.  They perform in Hamburg, Celle, Hanover, Kronenberg and Klagenfurt."]}]}}