{"wiki_id": "http://www.wikidata.org/entity/Q4760826", "itemLabel": "Andy Holmes", "itemDescription": "English footballer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Holmes_(footballer)", "wikipedia_page": {"main": "Andrew John Holmes (born 7 January 1969) is an English former footballer who played in the Football League for Doncaster Rovers and Stoke City.", "link_mentions": [{"page": "Billy Bremner", "response": ["New additions for the 1990–91 campaign were Peterborough United goalkeeper Paul Crichton, Stoke City defender Andy Holmes and Tottenham Hotspur midfielder Eddie Gormley, as well as his former Leeds captain Brendan Ormsby. Rovers were top of the table at the turn of the year, but injuries and lack of form caused results to fall away, as did hopes of promotion, and Doncaster finished the campaign in 11th place. Rovers started the 1991–92 season badly and Bremner tendered his resignation on 2 November, with the club sitting bottom of the Football League."]}, {"page": "Mark Gardiner", "response": ["The following season was a struggle, Northwich flirted with relegation, finally finishing 18th, and were knocked out of the FA Trophy by Runcorn in the 2nd Round. On 3 October 2000, with Northwich bottom of the Conference with only 9 points from 12 games, Gardiner was sacked, joining Leek Town as a player, making his debut in a draw at Altrincham. Within a fortnight of Gardiner signing for Leek, Andy Holmes was sacked as Leek manager and on 3 November 2000, Gardiner was given his job. However, with Leek desperately short of money and struggling in the league, it was never going to be an easy task. In January 2001, Gardiner was told to cut the wage bill after having his budget cut and promptly resigned. He almost immediately joined Nantwich Town as a player, making his debut at left-back in a 2–0 win over Ramsbottom United. He was still playing for Nantwich in 2004."]}, {"page": "Andy Holmes", "response": ["Andrew John Holmes (15 October 1959 – 24 October 2010)Olympic Rowing Champion Andy Holmes dies aged 51, The Telegraph, 25 October 2010 was a British rower.", "He died in London in 2010 after contracting Weil's disease, a severe form of leptospirosis, which results from contact with urine from infected animals or ingesting water contaminated with urine from infected animals.Olympic rowing star Andy Holmes dies 'from water bug' Metro, 25 October 2010", "Andy Holmes: Rower whose partnership with Steve Redgrave sparked a British renaissance in the sport, The Independent, 27 October 2010", "* Andy Holmes interview by Nick Greenslade in The Observer newspaper, 5 March 2006"]}, {"page": "1987–88 Stoke City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Andy Holmes"]}, {"page": "1989–90 Stoke City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Andy Holmes"]}, {"page": "Andrew Holmes", "response": ["Andrew Holmes or Andy Holmes may refer to:", "* Andy Holmes (1959–2010), rower", "* Andy Holmes (footballer) (born 1969), English footballer"]}]}}