{"wiki_id": "http://www.wikidata.org/entity/Q4767682", "itemLabel": "Annabel Lamb", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Annabel_Lamb", "wikipedia_page": {"main": "Annabel Lamb (born 1955) is an English singer-songwriter.\n\n", "link_mentions": [{"page": "Steve Hogarth", "response": ["*1983: Once Bitten – Annabel Lamb (keyboards)"]}, {"page": "Ferry Aid", "response": ["* The Alarm, John Altman, Debee Ashby, Al Ashton, Rick Astley, Bananarama, Simon Bates, Alison Bettles, Jenny Blythe, Errol Brown, Miquel Brown, Bucks Fizz, Jay Carly, The Christians, Nick Conway, Linda Davidson, Hazell Dean, Anne Diamond, Difford and Tilbrook, Doctor and the Medics, The Drifters, Drum Theatre, Frankie Goes to Hollywood, Roy Gayle, Go West, Carol Hitchcock, Felix Howard, Gloria Hunniford, Imagination, Jenny Jay, Ellie Laine, Annabel Lamb, Stephanie Lawrence, Loose Ends, Linda Lusardi, Ruth Madoc, Bobby McVey, Suzanne Mizzi, The New Seekers, Sadie Nine, The Nolans, Hazel O'Connor, Mike Osman, Su Pollard, Tim Polley, Pamela Power, Maxi Priest, Princess, Jimmy Pursey, Suzi Quatro, Mike Read, Sally Sagoe, Nejdet Salih, Ray Shell, Mandy Smith, Neville Staple, Alvin Stardust, Steve Strange, Sylvia Tella, Terraplane, Bonnie Tyler, Maria Whittaker, Working Week."]}, {"page": "Riders on the Storm", "response": ["==Annabel Lamb version==", "In 1983, Annabel Lamb recorded a studio version of the song. It was released as a single from her debut album Once Bitten which peaked at number 27 on the UK Singles Chart. She performed the song later that year on Top of the Pops."]}, {"page": "Once Bitten (Annabel Lamb album)", "response": ["Once Bitten was Annabel Lamb's 1983 debut album. The U.S. version of the album differed from the U.K. release and as well as different cover artwork, contained the single \"Riders on the Storm\" which was not present on the original U.K. issue.", "All tracks composed by Annabel Lamb; except where indicated", "*Annabel Lamb - lead vocals, backing vocals, synthesizer, piano, Hammond organ", "Category:Annabel Lamb albums"]}, {"page": "Damon and Debbie", "response": ["The music played over the opening and closing credits was written by Steve Wright, who had also written the Brookside theme. Dani Ali performed \"Talk to Me\", a song written for the show's closing credits, on episodes one and three, with a recording by English singer-songwriter Annabel Lamb accompanying the credits of episode two. Both versions of the song were releases on the Ariola label through BMG; Ali's version as the A-side, with Lamb's version on side B (titled \"Her Song\"). There is no record of the single gaining a chart position. The title was also the closing spoken line of dialogue in all three episodes."]}, {"page": "Cherry Red Records", "response": ["* Annabel Lamb"]}, {"page": "James Stevenson (musician)", "response": ["During 1994 and 1995, he provided additional guitar playing for The Cult during their world tour. He also contributed guitar to the song \"Brand New You're Retro\" by Tricky from his Maxinquaye album. He has contributed as a session guitarist on numerous recordings including artists as diverse as Scott Walker (The Drift and Bish Bosch), Henry Badowski (who he was at Chiswick Community School with), Charlie Harper, Duncan \"Kid\" Reid, Jimmy Nail, Helen Terry, Annabel Lamb, Louise and the Hothouse Flowers among others, and has composed music for TV and film."]}, {"page": "Lamb (surname)", "response": ["* Annabel Lamb, British singer-songwriter"]}, {"page": "List of performances on Top of the Pops", "response": ["* Annabel Lamb – \"Riders on the Storm\""]}, {"page": "List of A&M Records artists", "response": ["* Annabel Lamb"]}, {"page": "The Flame (Annabel Lamb album)", "response": ["The Flame is a 1984 album by British singer Annabel Lamb. The album was produced by Lamb's husband Wally Brill, and David Anderle.", "All tracks composed by Annabel Lamb; except where indicated", "*Annabel Lamb - vocals, keyboards, background vocals", "Category:Annabel Lamb albums"]}, {"page": "A&M Records", "response": ["In the late 1960s, through direct signing and licensing agreements, A&M added several British artists to its roster, including Cat Stevens, Joe Cocker, Procol Harum, Humble Pie, Fairport Convention, Free, the Move, Strawbs and Spooky Tooth. In the 1970s, under its manufacturing and distribution agreement with Ode Records, A&M released albums by Carole King and the comedy duo Cheech & Chong. Other notable acts of the time included Nazareth, Y&T, the Tubes, Styx, Supertramp, Joan Armatrading, Bell and James, Chris de Burgh (who went on to greater mainstream success in the 1980s), Rick Wakeman, the Ozark Mountain Daredevils, Chuck Mangione, Squeeze, and Peter Frampton. On March 10, 1977, A&M \"signed\" the Sex Pistols outside Buckingham Palace in a mock signing ceremony after the band had been dropped by EMI, although the real signing had actually occurred the prior day;https://www.westword.com/music/the-sex-pistols-signed-with-aandm-outside-buckingham-palace-35-years-ago-today-5702105 however, A&M dropped the band within a week. A&M sustained its success during the 1980s with a roster of noted acts that included Orchestral Manoeuvres in the Dark, Henry Badowski, Janet Jackson, the Police, Sting, the Brothers Johnson, Falco, Atlantic Starr, the Go-Go's, Bryan Adams, Suzanne Vega, Righeira, Brenda Russell, Jeffrey Osborne, Oingo Boingo, the Human League, Ozark Mountain Daredevils, Sharon, Lois & Bram, Annabel Lamb,  Jim Diamond, Vital Signs, Joe Jackson, Charlie Peacock, and Scottish rock band Gun. They also, through a deal with Christian music label Myrrh, distributed back catalog recordings of Amy Grant as well as her new recordings, starting with 1985's Unguarded, to the mainstream marketplace, a vital component in her subsequent breakthrough as a mainstream artist."]}, {"page": "Brides (album)", "response": ["Brides is a music album released in 1987 by English singer Annabel Lamb. Its original release on vinyl contained ten tracks, including a cover of the Velvet Underground's 1970 song, \"Sweet Jane\". An additional bonus track was added when the compact disc version was released.", "*All songs written by Annabel Lamb, except: track 2 (Leonard Bernstein, Stephen Sondheim, Mark Damron), track 3 (Lamb, Scott Davidson), track 4 (Lamb, Liam Sternberg), track 7 (Lou Reed), track 8 (Dani Ali, Lamb) and track 11 (Elmer Rice, Kurt Weill, Langston Hughes)", "Category:Annabel Lamb albums"]}, {"page": "Mica Paris discography", "response": ["|rowspan=\"3\"| Annabel Lamb"]}, {"page": "John McKenzie (musician)", "response": ["He toured the world as a musician for Lionel Richie, Shakira, David Bowie, Tina Turner, Eric Burdon, Kajagoogoo, Dr. John, Johnny Mathis, Everything But The Girl, Todd Sharpville, Branford Marsalis, Rui Veloso, Tim Finn, Ive Mendes, Tom Scott, David Dundas, Danny Tenaglia, The Christians, Phenix Horns, Duran Duran's Andy Taylor, Jimmy Iovine, Dave Stewart, Wild, Leon Ware, Eternal, James Ingram, Francis Rossi, Soft Machine's Karl Jenkins, Albert Lee, Barbara Dickson, Davy Spillane, Charles Aznavour, Raw Stylus, Linda Taylor, Blair Cunningham, Andy Newmark, Teresa Teng, Annabel Lamb, Nadirah X, Bob Clearmountain, Mitchell Froom, Arthur Louis, as well as Royal Philharmonic Orchestra and Reggae Philharmonic Orchestra."]}, {"page": "Annabelle (given name)", "response": ["* Annabel Lamb, singer"]}, {"page": "Kalvøyafestivalen", "response": ["* 1984: The Alarm, Annabel Lamb, Beranek, Jon Eberson Group. The festival was held on Sunday, July 1."]}]}}