{"wiki_id": "http://www.wikidata.org/entity/Q4768610", "itemLabel": "Anne Marie Rafferty", "itemDescription": "British nurse, administrator, academic and researcher", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Marie_Rafferty", "wikipedia_page": {"main": "Dame Anne Marie Rafferty  FRCN (born 7 May 1958) is a British nurse, academic and researcher. She is professor of nursing policy and former dean of the Florence Nightingale Faculty of Nursing, Midwifery and Palliative Care at King's College London. She served as President of the Royal College of Nursing from 2019 to 2021. \nShe is a fellow of the Royal College of Nursing, the American Academy of Nursing, and the Academy of Medical Sciences.  In 2008, she was seconded to the Department of Health to work with Lord Ara Darzi on the Next Stage Review of the NHS and was subsequently appointed Commander of the Order of the British Empire (CBE) for services to healthcare. She was a member of the Prime Minister's Commission on the Future of Nursing and Midwifery between 2009-10 and a member of the Parliamentary Review of Health and Social Care in Wales which reported in 2018. She is a current member of the NHS Assembly. In 2020, she was appointed Dame Commander of the Order of the British Empire (DBE) for services to nursing.\n\n", "link_mentions": [{"page": "May 7", "response": ["*  1958   – Anne Marie Rafferty, English nurse and academic"]}, {"page": "Harkness Fellowship", "response": ["*Professor Dame Anne Marie Rafferty DBE, British nurse, currently Professor of Nursing Policy Florence Nightingale School of Nursing and Midwifery, King's College London and President of the Royal College of Nursing, UK."]}, {"page": "Florence Nightingale Faculty of Nursing and Midwifery", "response": ["File:Rafferty.jpg|Anne Marie Rafferty", "* Anne Marie Rafferty, Professor and former Dean of the Florence Nightingale School of Nursing and Midwifery at King's College London and Fellow of the Royal College of Nursing"]}, {"page": "Rafferty", "response": ["* Anne Marie Rafferty (born 1958), British nurse and academic"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2020: Caroline Allen, The Baroness Benjamin, Mary Berry, Muffy Calder, The Baroness Campbell of Loughborough, Siobhan Davies, Clare Gerada, Lynn Gladden, Teresa Graham, Gillian Guy, Victoria Heywood, Susan Hill, Elaine Inglesby-Burke, Diana Johnson, Donna Langley, Maureen Lipman, Olivia Newton-John, Magdalene Odundo, Caroline Palmer Yeates, Linda Pollard, Anne Marie Rafferty, Lesley Regan, Rose Tremain, Julia Unwin, Emma Walmsley, Sarah Whatmore, Sharon White, Sarah Worthington"]}, {"page": "2009 New Year Honours", "response": ["*Professor Anne Marie Rafferty, Dean, Florence Nightingale School of Nursing and Midwifery. For services to Healthcare."]}, {"page": "Anne Marie Rafferty (RCN)", "response": ["#REDIRECT Anne Marie Rafferty"]}, {"page": "Anne Marie Rafferty (nurse)", "response": ["#REDIRECT Anne Marie Rafferty"]}, {"page": "NHS Long Term Plan", "response": ["56 people were recruited in early 2019 to form a forum which is to advise on the implementation of the plan.  The assembly is to be chaired by Dr Clare Gerada and Professor Sir Chris Ham and will meet four times a year.  It has a very varied membership including people from the voluntary sector, Rachel Power, the Chief Executive of the Patients Association,  Charlotte Pickles, who previously advised Iain Duncan Smith, Polly Toynbee, and the president of the Royal College of Nursing Anne Marie Rafferty."]}, {"page": "2020 Birthday Honours", "response": ["* Professor Anne Marie Rafferty CBE — Professor of Nursing Policy, King's College London and President, Royal College of Nursing. For services to Nursing"]}]}}