{"wiki_id": "http://www.wikidata.org/entity/Q4761460", "itemLabel": "Andy Watson", "itemDescription": "association football player (b. 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Watson_(footballer,_born_1959)", "wikipedia_page": {"main": "Andrew Watson (born 3 September 1959) is a Scottish former professional footballer and coach.\nDuring his playing career, Aberdeen-born Watson had spells at Aberdeen, Leeds United, Heart of Midlothian and Hibernian.  As a coach, he has worked with clubs in Scotland and England, and has been part of the Scottish national team management setup in two separate spells.", "link_mentions": [{"page": "Andy Watson", "response": ["Andy Watson may refer to:", "*Andy Watson (scientist), British scientist", "*Andy Watson (footballer, born 1959), Scottish footballer and coach", "*Andy Watson (footballer, born 1967), English footballer", "*Andy Watson (footballer, born 1978), English footballer", "*Andy Watson (mayor), mayor of Rangitikei in New Zealand", "*Andy Watson (Ontario politician), Canadian politician"]}, {"page": "1983 European Cup Winners' Cup Final", "response": ["|MF ||14|| Andy Watson"]}, {"page": "2007–08 Birmingham City F.C. season", "response": ["November started with an away game at Goodison Park against Everton. An early Yakubu goal was cancelled out in the 80th minute by Kapo, only for two injury-time goals from Lee Carsley and James Vaughan saw Everton snatch all three points. Next up was the Second City derby against Aston Villa at St Andrew's. An early Ridgewell own goal gave Villa a first-half lead. Forssell tied the game early in the second half, but Gabriel Agbonlahor gave Villa all three points. The Villa game was to be the last game in charge of the Blues for Steve Bruce, who left the club to join Wigan Athletic on 20 November 2007. This left Bruce's assistant Eric Black in charge for the game against Portsmouth at St Andrew's. Debutant goalkeeper Richard Kingson was at fault for Portsmouth's first goal as Sulley Muntari's shot rolled under the arms of the keeper. Niko Kranjčar added a late second as Portsmouth strolled to victory. Black's short reign as Blues manager ended on 26 November as he left to join Bruce at Wigan. The following day, former Scotland manager Alex McLeish was appointed manager of the club. McLeish had quit Scotland the day before to take over at the midlands club, and brought his two Scottish assistants, Andy Watson and former Villa caretaker manager Roy Aitken."]}, {"page": "Andy Watson (Scottish footballer)", "response": ["#REDIRECT Andy Watson (footballer, born 1959)"]}, {"page": "2011–12 Birmingham City F.C. season", "response": ["After leading the club to victory in the League Cup and relegation from the Premier League in 2010–11, Alex McLeish unexpectedly resigned on 12 June, having already made two signings and with another two players close to an agreement with the club. He was immediately linked with the managerial vacancy at Aston Villa. Acting chairman Peter Pannu threatened to report Villa to the League for making an illegal approach to McLeish, and insisted that they could speak to him only if they agreed to pay the £5.4 million compensation due under the terms of his contract. On 17 June, McLeish was appointed manager of Aston Villa. The matter was finally settled on 11 July, when the clubs issued a joint statement confirming that Villa would pay an undisclosed amount in compensation, all proposed legal action would cease, and coach Peter Grant and medical officer Dr Ian McGuinness would be free to follow McLeish to his new club. Chris Hughton, who had led Newcastle United to the Championship title in 2010, was appointed manager on 21 June. He confirmed that promotion back to the Premier League, rather than progress in the Europa League, was his main objective for the season, and brought Paul Trollope in to replace Andy Watson as first-team coach."]}, {"page": "Marcus Harness", "response": ["On 7 August 2015, he joined Northern Premier League Premier Division side Ilkeston on a one-month loan. He was sent off during injury-time in a 4–3 win over Stourbridge on 23 August. Manager Gavin Strachan extended his loan spell at the \"Robins\" until the new year after he made a positive start to the season. However he was recalled by Burton so as to allow him a chance to play higher-level football, and caretaker-manager Andy Watson said that \"we were delighted to have had Marcus here and his loan deal wasn't far from ending\". On 27 November 2015, Harness joined National League club Aldershot Town on a five-week loan. However he made just two substitute appearances for Barry Smith's \"Shots\" during his spell at the Recreation Ground. He went on to make five substitute appearances for Burton as the club achieved promotion out of League One and he \"impressed with his pace and direct running\" during these games and was named as Burton's 'Most Improved Young Player' for the 2015–16 season, after which his contract was extended for a further year. He played ten Championship matches in the 2016–17 season, and Albion took up a one-year extension to Harness's contract in May 2017."]}, {"page": "Andy Watson (footballer born 1959)", "response": ["#REDIRECT Andy Watson (footballer, born 1959)"]}, {"page": "Daniel Udoh", "response": ["He signed on non-contract terms alongside former teammate Harold Joseph with Kidderminster Harriers. Kidderminster loaned him out to Worcester City, Wingate & Finchley, North Greenford United and Grays Athletic, but he became frustrated by a lack of match time, and ended the season at Hoddesdon Town. He was invited to a trial at Ilkeston by manager Gavin Strachan, and impressed in pre-season enough to earn a one-year contract in 2015. He remained a first team regular after Andy Watson replaced Strachan as manager in October, forming a successful partnership with Lee Ndlovu."]}]}}