{"wiki_id": "http://www.wikidata.org/entity/Q4761194", "itemLabel": "Andy Provan", "itemDescription": "Professional footballer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Provan", "wikipedia_page": {"main": "Andrew McKelvie Hughes Provan (born 1 January 1944 in Greenock), also known as Drew Provan, is a Scottish former footballer who played in the Scottish Football League for St Mirren, in the Football League for Barnsley, York City, Chester, Wrexham, Southport and Torquay United, and in the North American Soccer League for the Philadelphia Atoms.", "link_mentions": [{"page": "Philadelphia Atoms", "response": ["* 1973 Chris Dunleavy, Jim Fryatt, Andy Provan"]}, {"page": "Bradley Beattie", "response": ["Beattie, an inside forward, was an apprentice with Torquay United when he made his league debut on 20 April 1974 against Chester at Plainmoor in place of regular number 8, Eddie Rowles. Although Rowles returned for the following game, Beattie kept his place, at the expense of Dave Kennedy. He failed to establish himself the following season, making just two appearances, both as a substitute. The first was in December 1974 as a replacement for Dave Tearse in a 0–0 draw at home to Swansea City, with the second, his final appearance for Torquay on 1 February 1975 as a replacement for Andy Provan in a 3–1 defeat at home to Lincoln City."]}, {"page": "Al Miller (soccer)", "response": ["Miller decided to build the Atoms around a core of native U.S. players.  This was significant in that most NASL teams used U.S. players as goalkeepers or bench warmers.  Miller took Bob Rigby with the first pick in the 1973 NASL college draft.  Rigby went on to become one of the best goalkeepers in the NASL.  In the second round, Miller selected Bobby Smith who was selected as a second team All Star his rookie year.  Miller then took his team to England to train.  While there noticed several players who he thought could help his team.  He negotiated an on loan arrangement for Andy Provan, Jim Fryatt and Chris Dunleavy."]}, {"page": "Drew Provan", "response": ["#REDIRECT Andy Provan"]}, {"page": "1973 North American Soccer League season", "response": ["|Andy Provan, Philadelphia"]}, {"page": "Provan", "response": ["*Andy Provan, Scottish footballer"]}, {"page": "Cross-border derby", "response": ["|Andy Provan||1968–70||82||18||1970–72||51||10"]}]}}