{"wiki_id": "http://www.wikidata.org/entity/Q4760907", "itemLabel": "Andy Kiwomya", "itemDescription": "English professional footballer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Kiwomya", "wikipedia_page": {"main": "Andrew Derek Bara Kiwomya (born 1 October 1967) is an English former professional footballer who played as both a left winger and a striker. \nKiwomya was notably employed by Huddersfield Town as head performance coach in 2010 in this role Huddersfield went on to achieve a 43-game unbeaten run.He is currently head of club performance at Bradford City.", "link_mentions": [{"page": "Sheffield F.C.", "response": ["|Andy Kiwomya"]}, {"page": "Bradford City A.F.C.", "response": ["| Andy Kiwomya"]}, {"page": "Chris Kiwomya", "response": ["His nephew is Alex Kiwomya, the son of his brother Andy Kiwomya."]}, {"page": "St Bede's Grammar School", "response": ["*Andy Kiwomya, footballer"]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Andy Kiwomya||||1995–1997||43||3||"]}, {"page": "1997–98 Burnley F.C. season", "response": ["||FW|| Andy Kiwomya || Bradford City || Loan || 2 September 1997"]}, {"page": "1996 Football League Second Division play-off Final", "response": ["City's chairman Geoffrey Richmond was reported to have told his team before the match: \"Well boys, you can either play Bury or Manchester City next season – it's up to you!\" Two times league champions Manchester City had been relegated from the Premier League whereas Bury had been just promoted from the Third Division. Three of the City players, Richard Huxford, Wayne Jacobs and Andy Kiwomya – all Christians – went onto the pitch to pray before the match.", "|LW ||7||  Andy Kiwomya || || "]}, {"page": "Alex Kiwomya", "response": ["Kiwomya was born on 20 May 1996 in Sheffield. He attended Notre Dame High School, Sheffield before joining Chelsea's Youth Academy. He is the son of former professional footballer Andy Kiwomya and the nephew of Chris Kiwomya. He had been a junior athletics champion in the 100m; at the age of 14 he ran the event in 10.98 seconds."]}]}}