{"wiki_id": "http://www.wikidata.org/entity/Q4768724", "itemLabel": "Anne Poole", "itemDescription": "former Chief Nursing Officer, Department of Health", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne_Poole", "wikipedia_page": {"main": "Dame Avril Anne Barker Poole DBE, RGN, RM, RHV, CBIM (born 11 April 1934), known as Anne Poole, is a former British civil servant who was Chief Nursing Officer for England at the Department of Health, from 1982 to 1992.On 27 January 1997 she was named to serve on the Criminal Injuries Compensation Appeal Panel.\nShe resides in Ancaster House, Church Hill, Merstham, Surrey.", "link_mentions": [{"page": "List of Dames Commander of the Order of the British Empire", "response": ["*1992: Jocelyn Barrow, Ann Ebsworth, Rangimarie Hetet, Edna Lewis, Moura Lympany, Wendy Mitchell, Shirley Oxenbury, Anne Poole, Norma Restieaux, Angela Rumbold, Elisabeth Schwarzkopf, The Baroness Serota, Janet Smith"]}, {"page": "Annette Kuhn", "response": ["Kuhn earned a bachelor's degree in 1969 and master's degree in 1975 in sociology at the University of Sheffield. While at Sheffield, she served as the Research Officer at the Sheffield Students' Union, during which period she worked on a campaign for a University crèche. Kuhn also co-convened the Sheffield University Women's Studies Group, organising public seminars and film screenings. While a student in the early 1970s, she co-authored a survey of British university graduates with Anne Poole which supported the notion that first children among several have higher educational achievement than their siblings. During the same period, she also co-authored a second survey with Anne Poole and R. Keith Kelsall, published as \"Graduates: The Sociology of the Elite\", which looked at women graduates and their careers, or lack thereof."]}, {"page": "Chief Nursing Officer (United Kingdom)", "response": ["* 1982 to 1992: Anne Poole'POOLE, Dame (Avril) Anne (Barker)', Who's Who 2017, A & C Black, an imprint of Bloomsbury Publishing plc, 2017; online edn, Oxford University Press, 2016; online edn, Nov 2016 accessed 18 Oct 2017 "]}]}}