{"wiki_id": "http://www.wikidata.org/entity/Q4766723", "itemLabel": "Ann Valentine", "itemDescription": "English composer and organist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Valentine", "wikipedia_page": {"main": "Ann Valentine (11 January 1762 – 13 October 1842 or 13 October 1845) was an English organist and composer, part of a talented family of Leicester musicians.", "link_mentions": [{"page": "List of women composers by birth date", "response": ["* Ann Valentine (1762–1842)"]}, {"page": "Leicester Cathedral", "response": ["*Sarah Valentine 1800–1843 (sister of Ann Valentine, who was organist at St Margaret's Church, Leicester)"]}, {"page": "List of Classical-era composers", "response": ["*Ann Valentine (1762–1842)"]}, {"page": "Valentine (name)", "response": ["* Ann Valentine (1762–1842), English organist and composer"]}, {"page": "Robert Valentine (composer)", "response": ["Born c. 1671, he was baptized in Leicester on 16 January 1674.Lasocki (1999), p. 11 He was the son of Thomas Follentine or Follintine, who lived in Leicester from c. 1670 and worked as a town musician there accompanied by his elder sons Thomas and Henry. The family became a prominent one in the musical life of Leicester; descendants included John Valentine, who was the grandson of Robert's eldest brother Thomas, and John Valentine's daughter Ann Valentine.Drage."]}, {"page": "St Margaret's Church, Leicester", "response": ["*1785–1845 Ann Valentine"]}, {"page": "John Valentine (composer)", "response": ["John Valentine was a member of a musical family in Leicester. He was the great-nephew of composer Robert Valentine. John's son Thomas Valentine (1759 – c. 1800) was also a violinist, who performed in the Handel Commemoration and in the London area for at least a decade. John's uncle, Henry Valentine, played oboe and also operated a music shop in Leicester. John Valentine married Tabitha Simpson (b. 1728) in 1755 and they had six children, including Sarah, John, Charles and Ann. Ann Valentine was a composer with work available in modern editions. Sarah (1771–1843) served as an organist at St Martin's Church in Leicester from 1800–40, and composed at least one work, The British March and Quickstep for the Pianoforte. John Valentine died in Leicester and was buried at St Margaret's Church."]}, {"page": "Anne Valentine", "response": ["#redirect Ann Valentine"]}, {"page": "List of musicians at English cathedrals", "response": ["*Sarah Valentine 1800–1843 (sister of Ann Valentine, who was organist at St Margaret's Church, Leicester)"]}]}}