{"wiki_id": "http://www.wikidata.org/entity/Q4764183", "itemLabel": "Angus Mackay", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_Mackay_(historian)", "wikipedia_page": {"main": "Angus Mackay (born 1939 in Lima, Peru) is a Scottish historian and Hispanist, specialising in Later Medieval Spain.\nHaving spent four years as a lecturer in history at the University of Reading, most of his career has been at University of Edinburgh, where he was awarded Doctor of Philosophy in 1970 for his thesis, Economy and society in Castile in the Fifteenth Century. He became Professor of Medieval History there in 1986, taking over the Chair from his mentor, Denys Hay.He is considered, together with Raymond Carr and John Elliott, a major figure in developing Spanish historiography.", "link_mentions": [{"page": "John Elliott (historian)", "response": ["His studies of the Iberian Peninsula and the Spanish Empire helped the understanding of the problems confronting 16th- and 17th-century Spain, and the attempts of its leaders to avert its decline. He is considered, together with Raymond Carr and Angus Mackay, a major figure in developing Spanish historiography.Delanty, Gerard Handbook of Contemporary European Social Theory. Routledge, 2006   at Google Books"]}, {"page": "Angus McKay", "response": ["* Angus Mackay (Victorian politician) (1824–1866), member of the Victorian Legislative Assembly", "* Angus Mackay (Queensland politician) (1834–1910), member of the Queensland Legislative Assembly", "* Angus Mackay, 6th of Strathnaver (died 1403)", "* Angus Mackay (historian) (born 1939), Scottish historian"]}, {"page": "Imperator totius Hispaniae", "response": ["There is some controversy over Alfonso's use of the title \"Emperor of the Two Religions\" (al-Imbraţūr dhī-l-Millatayn), which appears in a surviving letter he sent to King al-Mu‘tamid ibn Abbād of Seville.García Gallo 1945, 215: “Del emperador de las dos religiones, el rey excelente Alonso Ben Sancho, a Motámid Bilah”. The two letters exchanged between the two kings in 1085 are preserved only in Arabic in the text of the fourteenth-century chronicle Al-Ḥulal al-Mawšiyya fi Ḍikr al-Ajbār al-Marrākušiyya. Most modern historians, such as Ambrosio Huici Miranda and Bernard F. Reilly, have questioned the authenticity of all the documents incorporated into this chronicle.Reilly 1988, 181 n. 74.Mackay and Benaboud 1978, 233. Menéndez Pidal accepted their authenticity in his study of Alfonso's imperial title, and beginning in the late 1970s a debate opened up between medievalist Angus Mackay and orientalist Muhammad Benaboud on the one hand, arguing for their trustworthiness, and Hebraicist Norman Roth on the other, arguing against it."]}, {"page": "David Ditchburn", "response": ["*Atlas of Medieval Europe. London: Routledge, 1997. [co-edited with Angus Mackay, Edinburgh]   Also published in Spanish edition as Atlas de Europa Medieval, Madrid: Cátedra, 1999 "]}, {"page": "Raymond Carr", "response": ["He is considered, together with Angus Mackay and Sir John Huxtable Elliott, a major figure in developing Spanish historiography.Delanty, Gerard Handbook of Contemporary European Social Theory. Routledge, 2006   at Google Books"]}, {"page": "Hispanist", "response": ["*Angus Mackay (born 1939)"]}, {"page": "Angus (given name)", "response": ["* Angus Mackay (born 1939), Scottish historian"]}, {"page": "Spain: A History", "response": ["The book is a compilation of essays on Spanish history over the long-term, with contributions by Sebastian Balfour, Roger Collins, A. T. Fear, Felipe Fernández-Armesto, Richard Fletcher, Richard Herr, Henry Kamen, and Angus Mackay (as well as Carr himself)."]}, {"page": "Emperor of the Two Religions", "response": ["The authenticity of the letters was accepted by Ramón Menéndez Pidal, Luis García de Valdeavellano and the Egyptian scholar Muḥammad ʿAbd Allāh ʿInān. It was argued for in a series of papers by Angus Mackay and Muḥammad Benaboud. On the other hand, Ambrosio Huici Miranda lumped them with other \"fabricated official letters\" and has been followed by Bernard Reilly.Reilly 1988, 181 n. 74. Roth strongly objects to their authenticity, arguing that fabricated letters between enemies were common in late medieval Islamic historiography.Roth 1984. If authentic, the letters must have been originally written in Arabic."]}]}}