{"wiki_id": "http://www.wikidata.org/entity/Q4773139", "itemLabel": "Anthony Morley", "itemDescription": "British model and murderer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Morley", "wikipedia_page": {"main": "Anthony Morley (born 1972) is an English former model and convicted murderer. He won the first Mr Gay UK contest in 1993. In 2008 he was imprisoned for the killing, dismemberment and partial cannibalisation of his lover, magazine executive Damian Oldfield.\nIn 1996, Morley was a contestant on the television programme God's Gift; one of the audience members of that edition was Damian Oldfield. Oldfield was a contestant of another edition of the show in October 1996.On 2 May 2008, it was announced that Morley had been arrested for the murder of Oldfield, who worked for the gay lifestyle magazine Bent. After inviting Oldfield into his Leeds flat, police believed that Morley killed him, removed a section of his leg and began cooking it, before he stumbled into a nearby kebab house around 02:30 in the morning, drenched in blood and asking that someone call the police. He was found guilty on 17 October 2008 and sentenced to life imprisonment for the crime.", "link_mentions": [{"page": "Human cannibalism", "response": ["In 2008, a British model called Anthony Morley was imprisoned for the killing, dismemberment and partial cannibalisation of his lover, magazine executive Damian Oldfield. In 1996, Morley was a contestant on the television programme God's Gift; one of the audience members of that edition was Damian Oldfield. Oldfield was a contestant of another edition of the show in October 1996. On 2 May 2008, it was announced that Morley had been arrested for the murder of Oldfield, who worked for the gay lifestyle magazine Bent. After inviting Oldfield into his Leeds flat, police believed that Morley killed him, removed a section of his leg and began cooking it, before he stumbled into a nearby kebab house around 2:30 in the morning, drenched in blood and asking that someone call the police. He was found guilty on 17 October 2008 and sentenced to life imprisonment for the crime."]}, {"page": "Mr Gay UK", "response": ["In 2008 the first winner of the contest, Anthony Morley, was convicted of murder and cannibalism.", "|  style=\"width:140px;\"|Anthony Morley"]}, {"page": "LGBT culture in Leeds", "response": ["* Anthony Morley, the first Mr Gay UK and a convicted murderer."]}, {"page": "Morley, Anthony", "response": ["#redirectAnthony Morley"]}]}}