{"wiki_id": "http://www.wikidata.org/entity/Q4773608", "itemLabel": "Anthony Trewavas", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Trewavas", "wikipedia_page": {"main": "Anthony James Trewavas (born 1939)  FRS FRSE is Emeritus Professor in the School of Biological Sciences of the University of Edinburgh best known for his research in the fields of plant physiology and molecular biology. His research investigates plant behaviour.", "link_mentions": [{"page": "Silent Spring", "response": ["A 2012 review article in Nature by Rob Dunn commemorating the 50th anniversary of Silent Spring and summarizing the progressive environmental-policy changes made since then, prompted a response in a letter written by Anthony Trewavas and co-signed by 10 others, including Christopher Leaver, Bruce Ames, Richard Tren and Peter Lachmann, who quote estimates of 60 to 80 million deaths \"as a result of misguided fears based on poorly understood evidence\"."]}, {"page": "The John Roan School", "response": ["* Prof Anthony Trewavas, Professor of Plant Biochemistry since 1990 at the University of Edinburgh"]}, {"page": "The Cult of the Amateur", "response": ["Anthony Trewavas, professor at the Institute of Molecular Plant Science at the University of Edinburgh, discussed the book in an article in Trends in Biotechnology. Trewavas wrote that Keen's \"concern is the blurring of the distinction between the qualified and informed professional and the uninformed and unqualified amateur\", expressing concerns that this social change can hold back agricultural development. Trewavas stated as well, \"in agriculture, pesticides, food and farming, expert scientific knowledge and experience is seemingly regarded as having no more weight than that of the opinionated, unqualified (and inexperienced) environmentalist.\" The book has also been discussed in academic publications negatively, expressing how Keen has considered the worst aspects of a complex social movement while ignoring the demonstrable benefits that have been brought through initiatives such as OpenStreetMap, an expression of Volunteered Geographic Information.Parker, C.J., May, A.J. and Mitchell, V. (2014), “User-centred design of neogeography: the impact of volunteered geographic information on users’ perceptions of online map ‘mashups’.”, Ergonomics, Vol. 57 No. 7, pp. 987–97.Brown, M., Sharples, S., Harding, J., Parker, C.J., Bearman, N., Maguire, M., Forrest, D., et al. (2013), “Usability of Geographic Information: Current challenges and future directions”, Applied Ergonomics, Applied Ergonomics: Special Issue GI Data Usability, Vol. 44 No. 6, pp. 855–865."]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Anthony Trewavas"]}, {"page": "Trewavas", "response": ["*Anthony Trewavas (born 1939), British professor"]}]}}