{"wiki_id": "http://www.wikidata.org/entity/Q4773478", "itemLabel": "Anthony Sloman", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Sloman", "wikipedia_page": {"main": "Anthony B. Sloman (born 6 May 1945 in Waltham Abbey, Essex) is an English film producer and screenwriter.Tony Sloman is a cinema critic and historian, whose long career has encompassed many facets of film making.  He has worked intermittently in the film and television industry since 1964, as an actor, director, editor, sound editor, production manager, producer and screenwriter.\nIn the 1970s he directed two British sex drama films – Not Tonight, Darling! (1971) and Foursome (1971).He has written a regular internet film column, \"Sunset and Wardour\" for the \"International Film Studio\" and he also contributes film criticism for the BBC weekly listings magazine Radio Times. He once finished second on the BBC quiz programme  \"Film Buff of the Year\". He is a longtime member of the National Film Theatre for whom he has served several terms as a governor of the British Film Institute. He has also programmed several retrospectives for the National Film Theatre.\nSloman has interviewed such figures as Sir David Lean, Ann Miller and Stanley Donen for the Guardian Interview series. He has also written many obituaries of film figures for The Independent.\nIn 2021, his memoirs, entitled 'Reel Life - An Autobiocine Memoir' were published by Quoit Media Limited.", "link_mentions": [{"page": "This Sporting Life", "response": ["Anthony Sloman wrote"]}, {"page": "Sloman", "response": ["* Anthony Sloman, English film critic"]}, {"page": "Category talk:British journalists", "response": ["Anthony Slomannot yet classified"]}, {"page": "Tony Sloman", "response": ["#redirectAnthony Sloman"]}, {"page": "Murder by Contract", "response": ["Variety's original 1958 review singles out Perry Botkin's music for the film for praise, noting that the all-guitar score gives \"fine atmospheric backing.\" Writing in the Radio Times, film-maker Anthony Sloman called Murder by Contract \"a real gem and total justification for the existence of the B-movie\", praising the \"darkly sinister plot [which] masks a deeply original screenplay proffering philosophical insights into what makes hitman Vince Edwards tick.\" He summarised the film as \"stunningly well directed by Irving Lerner and cleverly produced on a shoestring, this might be called pretentious by some; another view is that it's original, clever and absorbing. Also tough as nails.\""]}, {"page": "32nd Cairo International Film Festival", "response": ["* Anthony Sloman, English director"]}, {"page": "Reginald Beck", "response": ["In his comprehensive obituary, Anthony Sloman singles out Accident (1967) as the pinnacle of their filmmaking, writing \"There is a sustained exterior hold in Accident that is totally of the cutting room: it is breathtaking in its audacity, and became influential in its style.\" The film was the second collaboration between Losey and Harold Pinter. Roy Perkins and Martin Stollery single out the editing of The Go-Between (1971), the third and last film of the Losey-Pinter collaboration, writing that \"sharply cut, initially cryptic alternations between time-past and time-present are deftly integrated into the narrative.\"."]}, {"page": "Sloman, Anthony", "response": ["#redirectAnthony Sloman"]}]}}