{"wiki_id": "http://www.wikidata.org/entity/Q4772488", "itemLabel": "Anthony Farrar-Hockley", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Farrar-Hockley", "wikipedia_page": {"main": "General Sir Anthony Heritage Farrar-Hockley  (8 April 1924 – 11 March 2006), nicknamed Farrar the Para, was a British Army officer and a military historian who fought in a number of British conflicts. He held a number of senior commands, ending his career as Commander-in-Chief of NATO's Allied Forces Northern Europe. Throughout his four decades of army life, he spoke plainly, and both before and after his retirement in 1982 wrote on the conflicts he had experienced and the Second World War.", "link_mentions": [{"page": "April 8", "response": ["*  1924   – Anthony Farrar-Hockley, English general and historian (d. 2006)"]}, {"page": "Parachute Regiment (United Kingdom)", "response": ["In 1960, Britain decided to withdraw from Aden, which was then part of the Federation of South Arabia, with independence scheduled for 1968. This decision started a campaign by the local tribes against the regular army. Supported by Egypt, communist infiltration reached a head in 1963 when Britain was forced to take action in support of the local government in what was called the Aden Emergency. The British force, known as Radforce, comprised a mixture of troops including a company from the 3rd Battalion.Ryan, p. 78 The rest of the 3rd Battalion, under the command of Lieutenant-Colonel Anthony Farrar-Hockley, was also sent to Aden to conduct operations in the Radfan mountains, capturing the Bkri ridge in May 1964.Reynolds, p.116 Farrar-Hockley was awarded the bar for his Distinguished Service Order (DSO) for this operation. The rest of the battalion were awarded two Military Crosses (MC) and one Military Medal (MM), and a number were mentioned in dispatches. By 1964, the terrorist attacks had spread to Aden, south of Radfan; to protect British servicemen and their dependents, the 1st Battalion was deployed on security duties throughout the areas of Crater and Khormasker. In January 1967, the 1st Battalion returned to Aden on an emergency tour to cover the final withdrawal of British troops from the region. For a series of actions in June in the Sheik Othman and Al Mansura districts of Aden, the battalion's commanding officer, Lieutenant-Colonel Michael J. H. Walsh, was awarded the DSO. The rest of the battalion were awarded three MCs and one MM, and a number were mentioned in dispatches."]}, {"page": "Battle of the Imjin River", "response": ["* Captain Anthony Farrar-Hockley, 1st Battalion, Gloucestershire Regiment"]}, {"page": "Gloucester Valley Battle Monument", "response": ["* Anthony Farrar-Hockley, a British full-ranking general and a veteran of the same Battle."]}, {"page": "Philip Curtis", "response": ["Anthony Farrar-Hockley, adjutant of the Glosters at Imjin River, witnessed Lieutenant Curtis' gallant deed, a desperate counterattack to regain a key position lost to the Chinese advance. At sunrise a Chinese attack was repulsed, but the British position was untenable. Below is part of Farrar-Hockley's account."]}, {"page": "Hubert Gough", "response": ["Gough's admiring biographer Anthony Farrar-Hockley pointed out that during the Battle of the Somme Gough had captured more difficult ground than Rawlinson, had taken more prisoners (17,723 as opposed to 15,630) but had suffered only half as many casualties (125,531 as opposed to 227,194).Farrar-Hockley 1974, pp. 193, 208 Farrar-Hockley also pointed out that not only did Gough not have enough artillery to succeed at Ypres in August 1917, but also argues that the limited advances advocated by \"Tavish\" Davidson were no cheaper in lives and did not stand any chance of achieving breakthrough or capturing German guns.Farrar-Hockley 1974, p. 238"]}, {"page": "First day on the Somme", "response": ["Prior and Wilson wrote that the conventional account of the day has soldiers burdened by  of equipment, obeying \"doltish\" orders to walk shoulder-to-shoulder towards the German lines and being mown down by German machine-gunners, who had time to climb out of shelters and man the parapet. Prior and Wilson ascribed the origin of this narrative to John Buchan in The Battle of the Somme (1917) in which the bravery of soldiers is extolled, rather than faulty infantry tactics being criticised. Prior and Wilson traced the narrative through the writing of B. H. Liddell Hart, J. E. Edmonds the official historian, C. R. M. F. Cruttwell, Martin Middlebrook, Correlli Barnett and Paul Kennedy. In 1970, Anthony Farrar-Hockley questioned the narrative but reverted to the orthodox view soon after. Prior and Wilson did not dispute the facts of  and  but wrote that the Tactical Notes issued by Rawlinson did not dictate the way that advances were to be made but were \"ambiguous\", referring to \"celerity of movement\", \"a steady pace\" and \"a rapid advance of some lightly-equipped men\" and did not prescribe a formation to be adopted for the advance."]}, {"page": "Operation Gladio", "response": ["Clandestine stay-behind (SB) units  were created with the experience and involvement of former SOE officers. Following Giulio Andreotti's October 1990 revelations, General John Hackett, former commander-in-chief of the British Army on the Rhine, declared on November 16, 1990, that a contingency plan involving \"stay behind and resistance in depth\" was drawn up after the war. The same week, Anthony Farrar-Hockley, former commander-in-chief of NATO's Forces in Northern Europe from 1979 to 1982, declared to The Guardian that a secret arms network was established in Britain after the war. Hackett had written in 1978 a novel, The Third World War: August 1985, which was a fictionalized scenario of a Soviet Army invasion of West Germany in 1985. The novel was followed in 1982 by The Third World War: The Untold Story, which elaborated on the original. Farrar-Hockley had aroused controversy in 1983 when he became involved in trying to organise a campaign for a new Home Guard against a potential Soviet invasion.Dan van der Vat. \"Obituary: General Sir Anthony Farrar-Hockley,\" Guardian. 15 March 2006"]}, {"page": "Gloucestershire Regiment", "response": ["By the afternoon of 24 April, the Glosters, with C Troop 170th Mortar Battery now fighting alongside as infantry, had been reduced to an effective fighting force of 400–450 men. They were low on ammunition, though in their favour the 45th Field Regiment were still able to provide support. Estimates of the opposing force range from a regiment (three battalions) to a division (three regiments).Salmon pp. 129, 203–206 The Glosters fought through the night of 24–25 April, during which the peak was briefly occupied by the Chinese, thus threatening the Glosters' whole position on the hill. It was recaptured in a counter-attack led by the adjutant, Captain Anthony Farrar-Hockley, and the Chinese launched seven attacks in one hour in an attempt to take it again, all without success. Their assault on the hill was finally broken up after sunrise by airstrikes. That morning, with Chinese forces infiltrating miles behind the lines, UN forces began to withdraw to Line Delta. On Hill 235, the Glosters had very little ammunition, no hope of relief and, with the 45th Field Regiment on the move, no artillery support. Carne received permission to attempt a breakout at 06:05. He had no choice but to leave the wounded, estimated at some 100. The survivors split into small groups and attempted to evade the Chinese surrounding them to reach friendly lines. Just 63 men made it.Salmon pp. 206–225", "* 1978 General Sir Anthony Farrar-Hockley KCB DSO MBE MC M.Litt"]}, {"page": "Allied Forces Northern Europe", "response": ["*1979-1982 General Sir Anthony Farrar-Hockley"]}, {"page": "Westland Scout", "response": ["In Aden and Radfan, a number of Scouts were shot down, although these usually resulted in a forced landing and the aircraft were recovered, repaired and returned to service. An example of this occurred on 26 May 1964 when the commanding officer of 3rd Battalion, The Parachute Regiment, Lt Col Anthony Farrar-Hockley, used a Scout to reconnoitre the Wadi Dhubsan area, Radfan. The aircraft was hit by enemy fire and the pilot made an emergency landing behind enemy lines. The aircraft was subsequently recovered; Farrar-Hockley rejoined the unit and was awarded the Bar to his Distinguished Service Order for his leadership. Three Scouts were written off during the campaign, the first, XR634, was through pilot error whilst landing on 16 May 1966. Although initially repairable, this aircraft was subsequently damaged beyond economic repair when it was dropped by the RAF Westland Wessex sent to recover it. The second aircraft, XT635, flew into a hillside during a night patrol at Jebal on 5 May 1967, killing the two crew and the two passengers. The third aircraft, XT641, was destroyed on the ground in an incident where the pilotThe Times, 7 September 1967, p.4 and his Foreign Office intelligence officer passenger were captured and shot dead by the National Liberation Front after landing in a wadi bed whilst on a flight from Ataq to Mayfa’ah on 3 September 1967. The NLF then set fire to and destroyed the aircraft. On 1 August 1968, Westland Sioux XT123 crashed at Sharjah, Oman, and was subsequently written off when it was dropped by the Westland Scout that was attempting the recovery."]}, {"page": "Aide-de-camp general", "response": ["| General Sir Anthony Farrar-Hockley || 24 April 1981 || 14 February 1983 ||"]}, {"page": "Deaths in March 2006", "response": ["*Sir Anthony Farrar-Hockley, 81, British soldier and military historian."]}, {"page": "2006 in the United Kingdom", "response": ["* 11 March – Sir Anthony Farrar-Hockley, Army general and military historian (born 1924)"]}, {"page": "General Sir Anthony Farrar-Hockley", "response": ["#REDIRECT Anthony Farrar-Hockley"]}, {"page": "Sir Anthony Farrer-Hockley", "response": ["#REDIRECT Anthony Farrar-Hockley"]}, {"page": "Shane Gough, 5th Viscount Gough", "response": ["Lord Gough was educated at Abberley Hall School and Winchester College. He served as an officer in the Irish Guards (Household Division, British Army),'GOUGH', Who's Who 2010, A & C Black, 2010; online edn, Oxford University Press, Dec 2009 ; online edn, Nov 2009. following in family tradition. Although he followed his father into the Guards, his most famous military forebear is undoubtedly Field Marshal Hugh Gough, 1st Viscount Gough.Anthony Farrar-Hockley, \"Goughie: the life of General Sir Hugh Gough\", Hart-David, MacGibbon, 1975. See family tree on page 383. After leaving military service he worked as a stockbroker."]}, {"page": "Dair Farrar-Hockley", "response": ["Major General Charles Dair Farrar-Hockley, MC (born 2 December 1946) is a retired British Army officer, and a former Director General of the Chartered Institute of Arbitrators. He is the son of General Sir Anthony Farrar-Hockley."]}, {"page": "List of military figures by nickname", "response": ["*\"Farrar the Para\" – Anthony Farrar-Hockley, British general"]}, {"page": "1924 in the United Kingdom", "response": ["* 8 April – Anthony Farrar-Hockley, army general and military historian (died 2006)"]}, {"page": "Sir Anthony Farrar-Hockley", "response": ["#REDIRECT Anthony Farrar-Hockley"]}, {"page": "Exeter School", "response": ["*General Sir Anthony Farrar-Hockley, soldier\"Obituary - General Sir Anthony Farrar-Hockley\", The Guardian, 15 March 2006"]}, {"page": "Farrar (surname)", "response": ["* Anthony Farrar-Hockley (1924–2006), British general and historian"]}, {"page": "List of former Parachute Regiment personnel", "response": ["* Sir Anthony Farrar-Hockley  †"]}, {"page": "List of Knights Grand Cross of the Order of the British Empire", "response": ["*1982: Anthony Farrar-Hockley, John Fieldhouse, Anthony Jolliffe, Anthony Morton, Francis Vallat"]}, {"page": "Richard Lawson (British Army officer)", "response": ["He was appointed Commander-in-Chief of Allied Forces Northern Europe, a NATO post, on 15 November 1982, replacing Anthony Farrar-Hockley, and was promoted to general on his appointment. He was succeeded by Geoffrey Howlett on 10 February 1986. He retired from the army on 28 May 1986."]}, {"page": "Western Front Association", "response": ["Past Vice Presidents: The Earl Kitchener TD, DL Tony Noyes CEng MICE  John TolandThe Prince Albrecht, Duke of BavariaGeneral Sir Anthony Farrar-Hockley, GBE, KCB, DSO, MCThe Earl Haig, OBE, KStJ, DLCol Terry Cave CBE Leonard G. Shurtleff"]}]}}