{"wiki_id": "http://www.wikidata.org/entity/Q4775151", "itemLabel": "Kate Perugini", "itemDescription": "English Victorian-era painter and child of Charles Dickens (1839-1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Perugini", "wikipedia_page": {"main": "Catherine Elizabeth Macready Perugini (née Dickens; 29 October 1839 – 9 May 1929) was an English painter of the Victorian era and the daughter of Catherine Dickens and Charles Dickens.", "link_mentions": [{"page": "Charles Dickens", "response": ["In early September 1860, in a field behind Gads Hill, Dickens made a bonfire of most of his correspondence; only those letters on business matters were spared. Since Ellen Ternan also destroyed all of his letters to her,. the extent of the affair between the two remains speculative.. In the 1930s, Thomas Wright recounted that Ternan had unburdened herself to a Canon Benham and gave currency to rumours they had been lovers.. That the two had a son who died in infancy was alleged by Dickens's daughter, Kate Perugini, whom Gladys Storey had interviewed before her death in 1929. Storey published her account in Dickens and Daughter,.. but no contemporary evidence exists. On his death, Dickens settled an annuity on Ternan which made her financially independent. Claire Tomalin's book, The Invisible Woman, argues that Ternan lived with Dickens secretly for the last 13 years of his life. The book was subsequently turned into a play, Little Nell, by Simon Gray, and a 2013 film. In the same period, Dickens furthered his interest in the paranormal, becoming one of the early members of The Ghost Club.."]}, {"page": "List of British painters", "response": ["*Kate Perugini (1839–1929)"]}, {"page": "Bedford College, London", "response": ["*Kate Perugini (1839–1929), English painter and daughter of Charles Dickens"]}, {"page": "Ellen Sharples", "response": ["* Kate Perugini"]}, {"page": "Women artists", "response": ["* Kate Perugini"]}, {"page": "Barbara Bodichon", "response": ["*Kate Perugini"]}, {"page": "Mary Baker", "response": ["* Kate Perugini"]}]}}