{"wiki_id": "http://www.wikidata.org/entity/Q4777245", "itemLabel": "Antony Price", "itemDescription": "British fashion designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Antony_Price", "wikipedia_page": {"main": "Antony Price is an English fashion designer best known for evening wear and suits, and for being as much an \"image-maker\" as a designer. He has collaborated with a number of high-profile musicians, including David Bowie, Robert Palmer, Iva Davies, Steve Strange, and Duran Duran, but especially Bryan Ferry and Roxy Music, whose look was defined by Price's designs. The manner in which Price dressed – or in many cases, undressed – the \"Roxy girls\" on the covers of their albums helped to define the band's pop retro-futurism.\nMore recently, Price has been noted for dressing celebrities such as Tara Palmer-Tomkinson, Patsy Kensit, Anjelica Huston, Jerry Hall, Camilla Parker Bowles. Diana Ross, Melanie Griffith, Yasmin Le Bon and burlesque performer Dita Von Teese.", "link_mentions": [{"page": "Roxy Music", "response": ["They were assisted in this by a group of friends and associates who helped to sculpt the classic Roxy Music 'look', notably fashion designer Antony Price, hair stylist Keith Mainwaring, photographer Karl Stoecker, the group's \"PR consultant\" Simon Puxley (a former university friend of Mackay's) and Ferry's art school classmate Nicholas De Ville. Well-known critic Lester Bangs went so far as to say that Roxy represented \"the triumph of artifice\". Ferry later attributed the band's look to his interest in American music and popular culture icons including Marilyn Monroe, Motown and Stax Records artists. He also stated he wanted to create an alternative image to publicity shots of pop and rock groups at the time which would feature artists \"in a dreary street, looking rather sullen. Which was the norm.\""]}, {"page": "Duran Duran", "response": ["From the beginning of their career, all the members had a keen sense of visual style. They worked with stylist Perry Haines and fashion designers such as Kahn & Bell and Antony Price to build a sharp and elegant image, soon outgrowing the ruffles and sashes of the pirate-flavoured early New Romantic look that had been popularised by Adam Ant during 1980–81. They have continued to present fashion as part of their package throughout their career. In the 1990s they worked with Vivienne Westwood and in the 2000s with Giorgio Armani. The band retained creative control of their visual presentation having worked closely with graphic designer Malcolm Garrett and many others over the years to create album covers, tour programs and other materials."]}, {"page": "Brintons", "response": ["In 1993, Brintons launched an advertising campaign featuring costumes made from the company's carpets designed by Vivienne Westwood. A second Westwood designed campaign followed in 1995, based on dress styles from 1783, the year the company was founded.  The photography for both campaigns was by David Bailey.  A third campaign was launched in 1996 and in 2000, British designer Antony Price created evening gowns constructed from carpet and photographed by Patrick Lichfield (Lord Lichfield) for these advertisements."]}, {"page": "Duran Duran (1983 video)", "response": ["Duran Duran travelled to the island of Antigua in May 1982 to film the vivid music video for \"Rio\", which featured iconic images of the band in colourful Antony Price silk suits, singing and playing around on a yacht sailing the Caribbean. Short segments show band members trying to live out their assorted daydreams, only to be teased, tormented, and made fools of by a body-painted vixen."]}, {"page": "List of fashion designers", "response": ["* Antony Price"]}, {"page": "Amanda Lear", "response": ["On 11 December 1965 in the UK, she married Morgan Paul Lear, a Scottish architecture student, and adopted his name. After showing up at Lucie Daouphars' Parisian model school (known as Lucky), she was sent by Gérald Nanty to Karl Lagerfeld's then model maker at Jean Patou's. Amanda Lear was a runway model for Lagerfeld and meets Catherine Harlé, the head of a modelling agency, who offered her a contract. With her modelling assignment, she walked for rising star Paco Rabanne in 1967. Just as Harlé had predicted, her looks were very much in demand. Soon after her debut Lear was photographed by Helmut Newton, Charles Paul Wilp and Antoine Giacomoni for magazines such as Beau (1966), mr. (1966), Le Nouveau Candide,  (1967), Scandal, , Nova, The Daily Telegraph, Stern, Bravo and Vogue. She modelled for fashion designers including Yves Saint Laurent and Coco Chanel in Paris and Mary Quant, Ossie Clark and Antony Price in London. After some time, Lear dropped out of art school to model full-time and went on to lead a bohemian and flamboyant life in the Swinging London of the 1960s. Lear's acquaintances included The Beatles and fellow top models Twiggy, Pattie Boyd and Anita Pallenberg. In late 1966, she began dating Brian Jones whom she first met prior through Tara Browne. Their relationship inspired Mick Jagger and Keith Richards for the track \"Miss Amanda Jones\" from Between the Buttons, alluding the romance between Jones and Lear as she's described as \"Ms. Jones\".Il paraîtrait que cette Miss Amanda Jones n'est autre qu'Amanda Lear qui en effet traînait avec Brian., Frédéric , « Rolling Stones 63/90 Le Chemin des pierres », Musicien, Hors-série, , « Spécial Rolling Stones », 1990, . She became a \"stalwart of London's demimonde\", an exotic name on the nightclub circuit and a regular fixture in the gossip columns. The model was arrested in 1967 by the police with drugs belonging to The Rolling Stones. Lear appeared in several advertisements for major brands, modelling among others for a Chantelle underwear range and the Detchema fragrance by a French company Révillon Frères in 1967, and in 1968 played a minor role in a French comedy film Ne jouez pas avec les Martiens and made an appearance in the 1968 British psychedelic film Wonderwall."]}, {"page": "Siren (Roxy Music album)", "response": ["The cover features band member Bryan Ferry's then-girlfriend, model Jerry Hall, on rocks near South Stack, Anglesey. Graham Hughes, working during August 1975, took the cover photo directly below the central span of the bridge on a south-side slope. He worked from sketches produced by Antony Price, with photography featuring Hall striking various poses. The idea for the location was Bryan Ferry's, after he saw a TV documentary about lava flows and rock formations in Anglesey, in which South Stack was heavily featured."]}, {"page": "For Your Pleasure", "response": ["* Antony Price – clothing/wardrobe, make-up, hair stylist"]}, {"page": "The Bride Stripped Bare (album)", "response": ["* Antony Price – design"]}, {"page": "Roxy Music (album)", "response": ["Roxy Music, particularly the album's LP incarnation, has been released in different packages over the years. The album's original cover, as issued in 1972 by Island Records, featured a gatefold sleeve picturing the band (including original bass guitarist Graham Simpson) in stage attire designed by Antony Price, and did not include the track \"Virginia Plain\". The album's original US release, in late 1972 on Warner Bros. Records' Reprise subsidiary, included \"Virginia Plain\", which had since been issued as a single in the UK. The original US release also featured a gatefold sleeve, but replaced Simpson's photo with that of Rik Kenton, who played bass on \"Virginia Plain\" following Simpson's departure from the group."]}, {"page": "Manifesto (Roxy Music album)", "response": ["The cover design which featured a variety of mannequins (a concept also used for the covers of the singles from the album), was created by Bryan Ferry with fashion designer Antony Price and American TV actress Hilary Thompson amongst others. The picture disc version of the album featured a version of the design in which the mannequins are unclothed. The cover's typography, as well as the album's title, were inspired by the first edition of Wyndham Lewis's literary magazine Blast."]}, {"page": "Stranded (album)", "response": ["The gatefold cover photograph was taken by Karl Stoecker and styled by Antony Price, and shows Playboy model Marilyn Cole. In an interview with the writer Tony Barrell in 2007, Cole recalled:"]}, {"page": "Boys and Girls (album)", "response": ["* Antony Price – photography"]}, {"page": "Rio (song)", "response": ["Director Russell Mulcahy filmed the vivid music video for \"Rio\", which featured iconic images of the band in Antony Price suits, singing and playing around on a yacht speeding over the crystal blue Caribbean Sea. The yacht in the music video was the Eilean. Short segments show band members trying to live out their assorted daydreams, only to be teased and tormented by body-painted vixen Reema Medawar."]}, {"page": "Paul Gorman", "response": ["In 2008, Gorman launched fashion label The Look Presents through Topman with three collections based on artist and designers featured in his book The Look: Adventures In Rock & Pop Fashion: T-shirts by Wonder Workshop; T-shirts by Granny Takes a Trip founder Nigel Waymouth; and Priceless – a menswear range by Antony Price, designer for Roxy Music and Duran Duran."]}, {"page": "Christopher Kane", "response": ["In December 2006, Kane was photographed by David Bailey for British Vogue alongside Antony Price, whose 1980s bombshell evening dresses and curvaceous feminine styles foreshadowed Kane's bandage-tight tailoring. In August 2014, Kane was one of 200 public figures who were signatories to a letter to The Guardian opposing Scottish independence in the run-up to September's 2014 Scottish independence referendum."]}, {"page": "Another Time, Another Place (Bryan Ferry album)", "response": ["* Antony Price – fashion"]}, {"page": "The Look Presents", "response": ["The Look Presents was available through British retailer TopmanMetro, July 14, 2008 with three collections in 2008-10: T-shirts by the 70s label Wonder Workshop and Nigel Waymouth, founder of King's Road store Granny Takes a Trip, as well as Priceless, ready-to-wear suits and other menswear by Antony Price, designer for Roxy Music, Bryan Ferry and Duran Duran."]}, {"page": "List of people from Bradford", "response": ["* Antony Price – (born 1945) London fashion designer. Born in Keighley."]}, {"page": "Anthony Price (disambiguation)", "response": ["*Antony Price (born 1945), London fashion designer"]}, {"page": "Judy Blame", "response": ["On returning to London and its club scene, Barnes changed his name to Judy Blame; \"Judy\" was a nickname given to him by designer Antony Price, and the surname \"Blame\" was suggested by Scarlett Cannon, a hairdresser friend. Blame said he deliberately assumed a female name in order to confuse people. When asked his birth name, Blame refused to answer."]}, {"page": "Janey Ironside", "response": ["Ironside's students included Bill Gibb, Ossie Clark, Zandra Rhodes, Moya Bowler, Janice Wainwright, Sally Tuffin and Marion Foale. She introduced a menswear course and was laughed at when she said she thought Mick Jagger stylish. Antony Price, a student on the menswear course, went on to create the suited look favoured by Bryan Ferry and others. When the College was given the power to award degrees, however, her School of Fashion was excluded. After Ironside lost her post in 1968, according to her daughter in her book Janey and Me, there followed a downward spiral of alcohol abuse and depression."]}, {"page": "Stirling Cooper", "response": ["Menswear was also included in the new store and was designed by Antony Price, who had been co-opted by Whiteside straight from the Royal College of Art and was then 24. Less than a month later, Times fashion journalist Anthony King-Deacon previewed the new men's range, describing Price as: \"one of the brightest young men in menswear designing in London.\" The article featured an image of Price in a long Stirling Cooper coat and described a limited range that featured safari jackets and wide-collared, pleated-sleeved shirt-waisters.", "*Antony Price and Sheilagh Brown at the Stirling Cooper store in Wigmore Street at Hope and Glitter"]}]}}