{"wiki_id": "http://www.wikidata.org/entity/Q4773482", "itemLabel": "Anthony Smee", "itemDescription": "British theatre producer and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Smee", "wikipedia_page": {"main": "Anthony Smee (22 November 1949), known professionally as Tony Smee, is an English theatre producer, writer, and actor who has worked in radio, theatre, television, and film since 1972.", "link_mentions": [{"page": "Ernest Simpson", "response": ["He was played by Anthony Smee in Bertie and Elizabeth (2002)."]}, {"page": "Bishop Douglass Catholic School", "response": ["Niamh Parker-Arnull, headmistress of nearby Finchley Catholic High School, was a former pupil. Actor Anthony Smee was briefly a P.E. teacher at the school in 1979."]}, {"page": "List of Brookside characters", "response": ["|Keith Tench || Anthony Smee || 1984, 1986"]}, {"page": "Miss Marple (TV series)", "response": ["|Gwen Watford, Moray Watson, Trudie Styler, Jess Conrad, Ciaran Madden, Keith Drinkel, Debbie Arnold, Frederick Jaeger, Valentine Dyall, Raymond Francis, David Horovitch, Anthony Smee, Andrew Cruickshank, Hugh Walters, Arthur Bostrom, Stephen Churchett, John Moffatt"]}, {"page": "Comedy Firsts", "response": ["| style=\"font-size: 100%;\" |Davy Kotowski (played by Griff Rhys Jones) is a petty officer aboard submarine HMS Wolverine. Following a rigged arm-wrestling contest, half the crew are in slings. Kotowski is then brought before the Captain, Alec McCleod (John Docherty) for the ninth time. He is sentenced to denial of shore leave and 20 hours laundry duty, most of which he delegates to the simple sailor Chris Cheese (William Ivory). Kotowski then plots his revenge on Lionel Pinner (Ian Bartholomew) and Cheese ends up having a £100 grudge darts match with Pinner on Kotowski's behalf. Also starring Anthony Smee as Roger Tench, Paul Shearer as Proudlove, Peter-Hugo Daly as Galloway, Perry Benson as Coxswain, Ben Miller as Simon Adair, Alexander Armstrong as Alastair Simpson and Jake Abraham as Mickey Davis."]}, {"page": "List of Star Wars cast members", "response": ["| Anthony Smee"]}, {"page": "List of people from the London Borough of Hackney", "response": ["* Anthony Smee, theatre producer, writer, stage, radio, television and film actor"]}, {"page": "The Silent World of Nicholas Quinn", "response": ["The cast included John Thaw as Inspector Endeavour Morse, Kevin Whately as Sergeant Robert Lewis, Barbara Flynn as Monica Height, Michael Gough as Philip Ogleby, Clive Swift as Dr Bartlett, Anthony Smee as Dr Roope, Roger Lloyd-Pack as Donald Martin, Lyndam Gregory as Sergeant Dixon, Phil Nice as Nicholas Quinn."]}, {"page": "The Queen (British TV serial)", "response": ["*Anthony Smee as Robin Janvrin"]}, {"page": "The Body in the Library (film)", "response": ["*Anthony Smee as Basil Blake  "]}, {"page": "Smee (disambiguation)", "response": ["*Anthony Smee (born 1949), English theatre producer and actor"]}, {"page": "Bliss (1995 TV series)", "response": ["* Anthony Smee as Dr. Graham Fairfax (In Memoriam — All Fall Down)"]}, {"page": "Framed (TV series)", "response": ["* Anthony Smee as Superintendent Glycin"]}, {"page": "Smee, Anthony", "response": ["#redirectAnthony Smee"]}, {"page": "Betty Davies (radio)", "response": ["| Maxine Audley, Patricia Quinn, Rosalind Shanks, Jane Wenham, Gladys Spencer, Carole Boyd, Michael Shannon, Michael Deacon and Anthony Smee."]}, {"page": "Heil Caesar", "response": ["*Aide-de-camp to Messala: Anthony Smee "]}, {"page": "Lucky Jim (2003 film)", "response": ["* Anthony Smee as Mr. Pringle"]}]}}