{"wiki_id": "http://www.wikidata.org/entity/Q4773049", "itemLabel": "Anthony May", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_May", "wikipedia_page": {"main": "Anthony May (born 23 May 1946) is an English stage, television and film actor. He trained at R.A.D.A. from 1965 to 1967.", "link_mentions": [{"page": "Richard Cromwell", "response": ["Cromwell has been depicted in historical films. They include Cromwell (1970), where he was portrayed by Anthony May, and To Kill a King (2003), where he was played by John-Paul Macleod."]}, {"page": "1980 in film", "response": ["| McVicar || Crown International Pictures / The Who Films / Polytel || Tom Clegg (director/screenplay); John McVicar (screenplay); Roger Daltrey, Adam Faith, Cheryl Campbell, Billy Murray, Georgina Hale, Steven Berkoff, Brian Hall, Matthew Scurfield, Harry Fielder, Ian Hendry, Malcolm Tierney, Robert Walker Jr., James Marcus, Tony Haygarth, Anthony May, Peter Jonfield, Leonard Gregory, Joe Turner, Jeremy Blake, Anthony Trent, Terence Stuart, Charles Cork, Paul Kernber, Ronald Herdman, Tony Rohr, Michael Feast, Richard Simpson, Ricky Parkinson || Drama || Live action"]}, {"page": "The Wednesday Play", "response": ["| Rosemary NicolsGlyn OwenAnthony MayPaul GreenwoodElian WynArtro MorrisJulia HandGerard HelyGeorge Giles"]}, {"page": "Cromwell (film)", "response": ["* Anthony May as Richard Cromwell: son of Oliver Cromwell, who would succeed him as Lord Protector."]}, {"page": "Here Come the Double Deckers", "response": ["* Anthony May in episode 7.", "# I Gotta Get Through (from episode 7, sung by Anthony May)"]}, {"page": "No Trams to Lime Street", "response": ["The play was remade for television a second time, again by the BBC, in 1970, for the Wednesday Play strand. Transmitted on 18 March 1970, this time on BBC1 this version was directed by Piers Haggard starred Rosemary Nicols, Glyn Owen, Anthony May, Eilian Wyn and Paul Greenwood; and included songs and music by Marty Wilde and Ronnie Scott (not the famous jazz saxophonist and club owner).Startrader synopsis of the Wednesday Play series Retrieved 1 September 2009 This version survives as a black and white telerecording, although it was made in colour.\"Missing episode in programme The Wednesday Play\", lostshows.com"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Anthony May (Acting Diploma 1967)"]}, {"page": "Les Bicyclettes de Belsize", "response": ["Les Bicyclettes de Belsize is a 1968 British musical short film (30 mins) starring Judy Huxtable and Anthony May. It was directed by Douglas Hickox, and played on cinemas as a supporting feature to Roy Boulting's controversial horror film Twisted Nerve. The two films also shared a soundtrack release, with each score occupying one side each of a 1969 Polydor Records album (Polydor 583 728).Schhh, high camp, and Mr Sloane", "The film opens from a vantage point over the rooftops, showing some of the morning occurrences through the windows of the houses.  A young man (Anthony May) dressed in a fashionable mod style prepares for the day from his rooftop flat and cycles around to the theme song. He then takes his bicycle and descends to the streets of the leafy suburbs.  Cycling down some steps he crashes into the bike of a little girl (Leslie Goddard) and is knocked unconscious.  She stands over him showing her pigtails, glasses and braces and gazes at him, clearly besotted.  The man awakes and asks the girls name. She tells him she is called Kate.  He bids her farewell and cycles off, she follows behind.  As he cycles the man sings a song about how he does not envy the responsible, monotonous lives of older people.  The girl blows a raspberry as she passes a queue of people at the bus stop; this starts a disagreement between the people at the stop which ends with a food fight."]}, {"page": "The Triple Echo", "response": ["* Anthony May as Subaltern"]}, {"page": "McVicar (film)", "response": ["*Anthony May as Billy"]}, {"page": "List of British films of 1968", "response": ["|Les Bicyclettes de Belsize||Douglas Hickox ||Judy Huxtable, Anthony May ||Musical ||Short film"]}, {"page": "The Breaking of Bumbo", "response": ["* Anthony May as Art Student"]}, {"page": "Dickens of London", "response": ["*Anthony May as Hullah"]}, {"page": "Ottershaw School", "response": ["*Anthony May"]}, {"page": "The Tenant of Wildfell Hall (1968 TV series)", "response": ["*Anthony May – Fergus Markham"]}, {"page": "Les Bicyclettes de Belsize (song)", "response": ["\"Les Bicyclettes de Belsize\" (translation: \"The Bicycles of Belsize\")  is a song written and composed by Les Reed and Barry Mason. Used as the theme song of the 1968 eponymous musical film, it was sung by Anthony May in the movie.  As a 45-rpm single, it was a big hit that year, in parallel English and French versions, for Engelbert Humperdinck and Mireille Mathieu, respectively.  The French version premiered on Mathieu's 1968 Columbia album Les Bicyclettes de Belsize; the English version premiered as a single in 1968, and was then included on Humperdinck's 1969 album Engelbert."]}, {"page": "May, Anthony", "response": ["#redirectAnthony May"]}, {"page": "Zigger Zagger", "response": ["The National Youth Theatre's original production of Zigger Zagger opened at the Jeanetta Cochrane Theatre in August 1967 and was broadcast on television by the BBC in the same year.Zigger Zagger (1967), bufvc.ac.uk; accessed 22 March 2018.Zigger Zagger - Christopher Cameron's Archive on the BBC Plays Department: Single Drama 1965 - 1987 The play opened at the Strand Theatre in the West End in March 1968 with a professional cast which included Anthony May, Michael Cashman, Alun Lewis, Peter DenyerPeter Denyer: actor and scriptwriter - The Times, 2 October 2009Obituaries - Peter Denyer: Actor who played the slow but lovable Dennis in 'Please Sir! - The Independent and Esta Charkham but closed after two weeks.Peter Jobin, Beyond Walls: Theatre Passe Muraille 1968 - 1975, The Porcupine's Quill (2018)- Google Books pg. 101 The play received eight revivals and tours over the next 20 yearsZigger Zagger, Zigger Zagger, Oi, Oi, Oi! - Wilton's Music Hall Productions including in 1975 when it was revived at the Shaw Theatre again directed by Michael Croft. A studio production was filmed by BBC Schools and featured Michael Tarn in the title role, Cheryl Murray as Edna while sisters Gillian Taylforth and Kim Taylforth played Sandra and Glennis, and Peter Turner playing Harry.Zigger Zagger (1975) - BBC School Broadcasting - British Film Institute database", "*Anthony May - Zigger Zagger"]}]}}