{"wiki_id": "http://www.wikidata.org/entity/Q4776548", "itemLabel": "George Hogarth", "itemDescription": "Scottish newspaper editor; father-in-law of Victorian-era novelist Charles Dickens, father of Catherine Hogarth Dickens", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Hogarth", "wikipedia_page": {"main": "George Hogarth WS (6 September 1783 – 12 February 1870) was a Scottish lawyer, newspaper editor, music critic, and musicologist. He authored several books on opera and Victorian musical life in addition to contributing articles to various publications.", "link_mentions": [{"page": "Charles Dickens", "response": ["In 1833, Dickens submitted his first story, \"A Dinner at Poplar Walk\", to the London periodical Monthly Magazine.. William Barrow, Dickens's uncle on his mother's side, offered him a job on The Mirror of Parliament and he worked in the House of Commons for the first time early in 1832. He rented rooms at Furnival's Inn and worked as a political journalist, reporting on Parliamentary debates, and he travelled across Britain to cover election campaigns for the Morning Chronicle. His journalism, in the form of sketches in periodicals, formed his first collection of pieces, published in 1836: Sketches by Boz – Boz being a family nickname he employed as a pseudonym for some years... Dickens apparently adopted it from the nickname 'Moses', which he had given to his youngest brother Augustus Dickens, after a character in Oliver Goldsmith's The Vicar of Wakefield. When pronounced by anyone with a head cold, \"Moses\" became \"Boses\" – later shortened to Boz.. Dickens's own name was considered \"queer\" by a contemporary critic, who wrote in 1849: \"Mr Dickens, as if in revenge for his own queer name, does bestow still queerer ones upon his fictitious creations.\" Dickens contributed to and edited journals throughout his literary career. In January 1835, the Morning Chronicle launched an evening edition, under the editorship of the Chronicles music critic, George Hogarth. Hogarth invited him to contribute Street Sketches and Dickens became a regular visitor to his Fulham house – excited by Hogarth's friendship with Walter Scott (whom Dickens greatly admired) and enjoying the company of Hogarth's three daughters: Georgina, Mary and 19-year-old Catherine.", "On 2 April 1836, after a one-year engagement, and between episodes two and three of The Pickwick Papers, Dickens married Catherine Thomson Hogarth (1815–1879), the daughter of George Hogarth, editor of the Evening Chronicle. They were married in St Luke's Church, Chelsea, London. After a brief honeymoon in Chalk in Kent, the couple returned to lodgings at Furnival's Inn.. The first of their ten children, Charles, was born in January 1837 and a few months later the family set up home in Bloomsbury at 48 Doughty Street, London (on which Charles had a three-year lease at £80 a year) from 25 March 1837 until December 1839.. Dickens's younger brother Frederick and Catherine's 17-year-old sister Mary Hogarth moved in with them. Dickens became very attached to Mary, and she died in his arms after a brief illness in 1837. Unusually for Dickens, as a consequence of his shock, he stopped working, and he and Catherine stayed at a little farm on Hampstead Heath for a fortnight. Dickens idealised Mary; the character he fashioned after her, Rose Maylie, he found he could not now kill, as he had planned, in his fiction, and, according to Ackroyd, he drew on memories of her for his later descriptions of Little Nell and Florence Dombey.. His grief was so great that he was unable to meet the deadline for the June instalment of The Pickwick Papers and had to cancel the Oliver Twist instalment that month as well. The time in Hampstead was the occasion for a growing bond between Dickens and John Forster to develop; Forster soon became his unofficial business manager and the first to read his work."]}, {"page": "Rinaldo (opera)", "response": ["The 19th-century music critic George Hogarth wrote of Rinaldo that \"[t]he romantic interest of the subject, the charms of the music, and the splendour of the spectacle, made it an object of general attraction\".Hogarth, p. 272"]}, {"page": "George Thomson (musician)", "response": ["His father was the schoolmaster at Limekilns, Dunfermline, and he had some legal training. In 1780 he gained a clerical appointment with the Board of Trustees for the Encouragement of Art and Manufactures in Scotland on the recommendation of John Home, and spent the rest of his career with this body set up under the Treaty of Union to promote Scottish trade with money given by Parliament in compensation for losses in the Darien Scheme and for taking on a share of England's national debt, eventually becoming Chief Clerk. He joined the Edinburgh Musical Society, playing the violin in the orchestra and singing in the choir. For 59 years he worked for the Board of Trustees for the Encouragement of Art and Manufactures in Scotland. His daughter Georgina was the wife of editor and music publisher George Hogarth, and his granddaughter  Catherine married the novelist Charles Dickens."]}, {"page": "James Ballantyne", "response": ["In 1817, James, along with his brother-in-law George Hogarth, purchased the Edinburgh Weekly Journal where he acted as editor. His brother, John, was the musical and drama critic while George managed the finances.", "James is the brother of John Ballantyne, who was his business partner at times.  His wife's brother, George Hogarth, was a well-known music critic and writer.  He was the uncle, through his younger brother Alexander, of R. M. Ballantyne, Scottish author and artist.  His niece, Catherine Hogarth, was the wife of Charles Dickens."]}, {"page": "Larks of Dean", "response": ["Dean is a small community within the east Lancashire valley of Rossendale, near Water between Rawtenstall and Burnley, part of the area in which the textile industry expanded massively during the Industrial Revolution. In 1835 the Scottish writer George Hogarth noted 'In the densely populated manufacturing districts ... music is cultivated among the working classes to an extent unparalleled in any other part of the country', in his Musical History, referring to the industrialised parts of England. Soon after, in 1862 Edwin Waugh describing Manchester in the Cotton Famine mentions 'swarms of strange, shy, sad-looking singers and instrumental performers in the work-worn clothing of factory-operatives'. Making music provided one of the few ways to find relief from the hardship of working in the new mill factories of Lancashire.The First Industrial Society: Lancashire; Chris Aspin; Carnegie 1995;  The Larks of Dean were one notable group of musicians that grew from this situation, as well as from the non-conformist religious background of the area."]}, {"page": "Georgina Hogarth", "response": ["'Georgy' Hogarth was one of 10 children born in Scotland to music critic George Hogarth and his wife Georgina. In 1834, Georgy and her family moved to England where her father had taken a job as a music critic for The Morning Chronicle."]}, {"page": "Catherine Dickens", "response": ["She was the eldest daughter of 10 children to George Hogarth. Her father was a journalist for the Edinburgh Courant, and later became a writer and music critic for the Morning Chronicle, where Dickens was a young journalist, and later the editor of the Evening Chronicle. Dickens immediately took a liking to the attractive 19-year-old Catherine and invited her to his 23rd birthday party. Catherine and Dickens later became engaged in 1835 and were married on 2 April 1836 in St Luke's Church, Chelsea, going on their honeymoon in Chalk, near Chatham in Kent.  They set up a home in Bloomsbury, and went on to have ten children. During that period, Charles wrote that even if he were to become rich and famous, he would never be as happy as he was in that small flat with Catherine."]}, {"page": "Artaxerxes (opera)", "response": ["*\"Fair Aurora, pr'ythee stay\" (sung by Arbaces and Mandane in act 1) was heard in the United States as early as 1769 in a concert at New York's Vauxhall Gardens and again in that city in 1794 in a concert at the City Tavern. It was also sung by Raynor Taylor and Miss Huntley in a concert in Philadelphia in 1796 and published that same year as an arrangement for piano and voice by Filippo Trisobio with the title, \"A Celebrated Duett in Artaxerxes. Fair Aurora\".. Filippo Trisobio was an Italian voice teacher and composer living in Philadelphia, where he died in 1798. Unlike the more bravura pieces in the opera, it was described by George Hogarth in 1835 as \"a charming imitation of the simpler Italian style of that period\"."]}]}}