{"wiki_id": "http://www.wikidata.org/entity/Q4772592", "itemLabel": "Anthony Gilbert", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Gilbert_(author)", "wikipedia_page": {"main": "Anthony Gilbert, the pen name of Lucy Beatrice Malleson (15 February 1899 – 9 December 1973), was an English crime writer who was a cousin of actor-screenwriter Miles Malleson. She also wrote fiction as Anne Meredith and the autobiography Three-a-Penny (1940) under the Meredith name.Lucy Malleson was born in London. When her stockbroker father lost his job the family suffered financial hardship, and she took up shorthand typing to earn a living. She began writing poetry, and then, inspired by the play The Cat and the Canary by John Willard (1922), she tried her hand at detective novels, using the name J Kilmeny Keith. The first was The Man Who Was London, published in 1925. She published over sixty crime novels as Anthony Gilbert, most of which featured her best-known character, Arthur Crook. Crook is a vulgar London lawyer totally (and deliberately) unlike the sophisticated detectives, such as Lord Peter Wimsey and Philo Vance, who dominated the mystery field when Gilbert introduced him. Instead of dispassionately analysing a case, he usually enters it after seemingly damning evidence has built up against his client, then conducts a no-holds-barred investigation of doubtful ethics to clear him or her. As fellow mystery author Michael Gilbert noted, \"...he behaved in a way which befitted his name and would not have been approved by the Law Society.\"  The first Crook novel, Murder by Experts, was published in 1936 and was immediately popular. The last Crook novel, A Nice Little Killing, was published in 1974.\nHer novel The Vanishing Corpse (1941) was adapted as the film They Met in the Dark (1943), another novel, The Mouse Who Wouldn't Play Ball (1943) was filmed as Candles at Nine in 1944, and her novel on abduction and a faked identity, The Woman in Red, which features Arthur Crook and his assistant Bill Parsons (1941), was adapted as the 1945 film noir, My Name Is Julia Ross. \"You'll Be the Death of Me,\" an October 1963 episode of The Alfred Hitchcock Hour, was adapted from Gilbert's short story \"The Goldfish Button\" in the February 1958 Ellery Queen Mystery Magazine. Her short stories \"Door to a Different World\" and \"Fifty Years After\" were Edgar Award nominees.\nThe 1942 novel Something Nasty in the Woodshed (American title Mystery in the Woodshed) was adapted for stage by Dennis Hoey as The Haven, opening in New York in 1946. Cook was played by Melville Cooper. The production received poor reviews and lasted only five performances.While Malleson's books sold well enough to keep publishers asking for more, she was never a best-seller. However, in 2017 interest in her was revived through the reissue of the Anne Meredith crime novel Portrait of a Murderer under the British Library's Crime Classics imprint. Martin Edwards believes this novel to be \"a major departure. Dostoevsky was her model, although Anthony Berkeley's influence was also in play.\" Although quickly forgotten in 1933 it did win the praise of Dorothy L Sayers. The reissue sold many more copies than the original edition, and was followed by a reissue of the 1933 Anthony Gilbert novel, Death in Fancy Dress, as well as the Anne Meredith autobiography Three-a-Penny in December 2019. The title of the latter was taken from a remark made to her by Sayers: “Although authors are three-a-penny to us, they are quite exciting to other people.”  Three-a-Penny was also serialised on BBC Radio 4. The book also paints a vivid portrait of poverty between the wars in the East End of London.", "link_mentions": {}}}