{"wiki_id": "http://www.wikidata.org/entity/Q4772871", "itemLabel": "Anthony Kappes", "itemDescription": "Road and track racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Kappes", "wikipedia_page": {"main": "Anthony Edward Kappes MBE (born 1 March 1973) is an English road and track racing cyclist and Paralympian.", "link_mentions": [{"page": "List of British cyclists", "response": ["* Anthony Kappes"]}, {"page": "Jason Queally", "response": ["Queally retired from able-bodied cycling after failing to qualify for the 2008 Summer Olympics. He subsequently worked with Paralympic cyclist Anthony Kappes with the aim of competing together on a tandem at the 2012 Summer Paralympics. However he returned to able-bodied competition when he received a call up to the British squad for the 2010 UCI Track Cycling World Championships. After not being selected for the 2012 Summer Olympics he rejoined the British paralympic cycling squad as a pilot for the tandem events in November 2012."]}, {"page": "Royal National College for the Blind", "response": ["Graduates of the college include David Blunkett, British Labour Party politician and former Home Secretary, and Alfred Hollins, English composer and organist. Giles McKinley, who starred in a groundbreaking television commercial for Sauza Tequila during the 1990s, is a former RNC student. The actor Ryan Kelly, who in 1997, became the first completely blind student to join the Bristol Old Vic Theatre School, and plays the role of Jack \"Jazzer\" McCreary in Radio 4's The Archers, attended RNC. The Paralympic cyclist Anthony Kappes also studied at the college. The Hereford born studio potter Simon Carroll taught at the RNC in the early 1990s. Carroll has permanent collections at the V&A museum London and Amgueddfa Cymru."]}, {"page": "Craig MacLean", "response": ["Craig MacLean MBE (born 31 July 1971) is a Scottish track cyclist who has represented Great Britain and Northern Ireland at the 2000 Summer Olympics in Sydney and the 2004 Summer Olympics in Athens, winning a silver medal in the Team Sprint at the 2000 Olympics. As a sighted guide, McLean returned to the sport in its Paralympic form, piloting Neil Fachie to two gold medals in the 2011 UCI Para-cycling Track World Championships, and Anthony Kappes to a gold medal in the 2012 Paralympic Games. MacLean is only the second athlete, after Hungarian fencer Pál Szekeres, ever to win medals at both the Olympic and Paralympic Games.", "In 2012, he switched to piloting Anthony Kappes, with Barney Storey piloting Fachie; the move was a success for both tandems, as each tandem team won a gold medal at the 2012 Paralympic Games. In doing so, MacLean became only the second athlete to win medals at both Olympic and Paralympic Games."]}, {"page": "British National Tandem Sprint Championships", "response": ["| 2007   || Yasumitsu SchlappAnthony GillSimon Churton || VC St Raphael/PCA Ciclos Uno Ben ElliottJohn Saysell || Yasumitsu SchlappJon NorfolkAnthony Kappes ", "| 2008   || Yasumitsu Schlapp/ClitheroeJon NorfolkAnthony Kappes ||Yasumitsu SchlappAnthony GillSimon Churton  ||VC St Raphael/PCA Ciclos Uno Ben ElliottJohn Saysell ", "|2010  ||VC St RaphaelNeil FachieBarney Storey || Liverpool MercurySimon JacksonCraig MacLean || Yasumitsu SchlappAnthony KappesDave Readle", "|2011 ||Yasumitsu Schlapp/VC St RaphaelAnthony KappesBarney Storey || VC St RaphaelBen ElliottRowan Elliott   ||VC St RaphaelPeter Boyd Dave Heald", "|2014 || Yasumitsu Schlapp/Performance CCAnthony KappesPeter Mitchell || Brooks Cycles/Sportcity VeloPhilip HoultonThomas Rotherham  ||  Newport Velo Youth CyclingMatthew EllisIeuan Williams"]}, {"page": "Cycling at the 2008 Summer Paralympics", "response": ["|  Anthony Kappes  Barney Storey", "|  Anthony Kappes  Barney Storey"]}, {"page": "Antony Kappes", "response": ["#REDIRECT Anthony Kappes"]}, {"page": "Jon Norfolk", "response": ["He gained selection onto the Great Britain Cycling Team himself in November 2003 following a number of successful years of track sprint competition and many national titles. He went on to represent Great Britain in a numerous of international competitions including World Cup events in Sydney (Aus) and Mexico. Following this, he began working as a tandem pilot with the paralympic athlete Anthony Kappes and took a three-year break from competition in order to qualify for the Beijing Paralympics.", ":3rd Tandem Sprint, British National Track Championships (with Anthony Kappes)", ":1st Kilo, VISA Paralympic World Cup (with Anthony Kappes)", ":1st Sprint, VISA Paralympic World Cup (with Anthony Kappes)"]}, {"page": "Anthony Edward Kappes", "response": ["#REDIRECT Anthony Kappes"]}, {"page": "List of athletes who have competed in the Paralympics and Olympics", "response": ["In 2012, Craig MacLean, a British track cyclist and Olympic silver medalist was the sighted pilot for Anthony Kappes as they won gold in the 2012 Paralympic Games. For the first time in those games, the sighted guides of blind athletes were also awarded medals, and MacLean, although not himself disabled, became only the second athlete to win medals in both the Olympic and Paralympic Games."]}, {"page": "List of 2008 Summer Paralympics medal winners", "response": ["|  Anthony Kappes  Barney Storey", "|  Anthony Kappes  Barney Storey"]}, {"page": "Cycling at the 2008 Summer Paralympics – Men's time trial", "response": ["| align=center | || Anthony KappesPilot: Barney Storey ||  ||1:02.864 WR "]}, {"page": "Barney Storey", "response": ["At the 2004 Summer Paralympics he participated in two tandem track cycling events, acting as the sighted pilot for Daniel Adam Gordon. The pair finished fourth in the sprint and fifth in the 1 km time trial. In 2005 he won the British national title for the 200 metres tandem sprint competing with Craig MacLean. At the 2006 British National Tandem Sprint Championships held in Newcastle Storey defended the title partnered by partially sighted Paralympian Anthony Kappes; this made them the first Paralympic team to hold the able-bodied national title. Storey won gold medals in both the sprint and time trial at the 2006 World Disability Championships and defended both titles successfully in 2007."]}, {"page": "List of Royal National College for the Blind people", "response": ["*Anthony Kappes, Paralympic cyclist"]}, {"page": "Chapel-en-le-Frith High School", "response": ["*Paralympic triple Gold Medallist Anthony Kappes MBE went to the school."]}, {"page": "2011 UCI Para-cycling Track World Championships", "response": ["| Barney Storey,Anthony Kappes||", "| Barney Storey,Anthony Kappes|| 1:02.681"]}, {"page": "2011 UCI Para-cycling Track World Championships – Men's 1 km time trial", "response": ["|Anthony Kappes,Barney Storey", "|  ||align=left| Anthony Kappes,Barney Storey ||align=left|  || 1:02.681"]}, {"page": "2011 UCI Para-cycling Track World Championships – Men's sprint", "response": ["| 2 ||align=left| Anthony KappesBarney Storey ||align=left|  || 10.351 || Q", "| 2 || 1 ||align=left| Anthony KappesBarney Storey ||align=left|  || 10.722 || 10.860||  || Q", "| 2 || 1 ||align=left| Anthony Kappes,Barney Storey ||align=left|  || 11.149 || 10.820 || || Q", "|  ||align=left| Anthony Kappes,Barney Storey ||align=left|  || 10.821 ||  || "]}, {"page": "2011 UCI Para-cycling Track World Championships – Men's individual pursuit", "response": ["| 7 ||align=left| Anthony Kappes,Barney Storey ||align=left|  || 4:28.064 || "]}, {"page": "Great Britain at the 2012 Summer Paralympics", "response": ["Jody Cundy won a bronze medal in the men's C4 individual pursuit, but was controversially not allowed a restart after a problem with his start in the men's C4-5 time trial. Former RAF technician Jon-Allan Butterworth, competing in his first Paralympics, won the silver medal in that event along with two other silver medals in the men's C5 individual pursuit and as part of the C1-5 sprint team. In the men's B time trial, the tandem of Anthony Kappes and pilot Craig MacLean twice had a mechanical problem with their chain and were not allowed a second restart. Neil Fachie and pilot Barney Storey won the gold medal in a world record time. Both pairings met in an all-British final in the men's B sprint event, where Kappes and MacLean won the gold medal after breaking the world record time during the qualification round. Mark Colbourne set two new world records on the way to gold in the men's C1 individual pursuit, while David Stone won gold in the T1-2 road race, defending the title he won in 2008.", "|Anthony KappesCraig MacLean (pilot)", "|Anthony KappesCraig MacLean (pilot)"]}, {"page": "Event winners at the 2012 Summer Paralympics", "response": ["|Anthony Kappes"]}, {"page": "Neil Fachie", "response": ["Fachie entered his third Para-Cycling Track World Championships, this time held in Los Angeles, USA. His pilot in America again was Storey, who would team up with Fachie at the 2012 Summer Paralympics in London. The pair took the silver in the Kilo. That year, in the Paralympics, Fachie and Storey competed in the Men's 1 km time trial for riders with a visual impairment. The pair set a world record time of 1:01.351, and after team mates and main rivals Anthony Kappes and Craig MacLean suffered a mechanical failure, took the gold medal."]}, {"page": "Cycling at the 2012 Summer Paralympics – men's 1 km time trial B", "response": ["| Anthony KappesPilot: Craig MacLean"]}, {"page": "Cycling at the 2012 Summer Paralympics – Men's sprint", "response": ["| Anthony KappesPilot: Craig MacLean"]}, {"page": "Sophie Thornhill", "response": ["Thornhill comes from Poynton near Stockport in Cheshire. She attended Poynton High School, also attended by para-cyclist Sarah Storey. She has only 7–9% vision owing to oculocutaneous albinism, which causes visual impairment. She met the para-cyclist Anthony Kappes, also visually impaired, via her uncle; he encouraged her to train as a track cyclist."]}, {"page": "List of Paralympic Games records in track cycling", "response": ["|Anthony KappesCraig Maclean (pilot)"]}, {"page": "Kappes", "response": ["*Anthony Kappes (born 1973), British road and track racing cyclist"]}, {"page": "Kappes, Anthony", "response": ["#redirectAnthony Kappes"]}]}}