{"wiki_id": "http://www.wikidata.org/entity/Q4783330", "itemLabel": "Arabella Elizabeth Roupell", "itemDescription": "British artist (1817-1914)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arabella_Elizabeth_Roupell", "wikipedia_page": {"main": "Arabella Elizabeth Roupell (23 March 1817 Newport, Shropshire – 31 July 1914 Swallowfield, Berkshire) was an English flower painter, noted for an anonymous set of flower paintings published in 1849 under the title 'Specimens of the flora of South Africa by a Lady.'\nRoupell was the daughter of Rev. John Dryden Piggott, rector and squire of Edgmond, and married Thomas Boone Roupell, an East India Company official, on 16 September 1840. In 1843, shortly after the birth of her eldest son, her husband was posted to the Cape for a period of service leave and she chose to accompany him.During her two-year stay in South Africa Roupell painted local flowers. A visitor to the Cape, Nathaniel Wallich, who was at that time in charge of the Calcutta Botanical Garden, and a guest at the same Cape Town hotel as the Roupells, was struck by the quality of her work. Wallich accompanied Roupell on collecting trips to the Cape countryside, and introduced her family to his friends Thomas Maclear, the Cape Astronomer Royal, and his wife Mary, leading to a lasting friendship between the women. Among the others Roupell befriended were Baron von Ludwig, planner and developer of the Botanical Garden in Cape Town, and the Kew plant collector, James Bowie.\nThe Roupells returned to Madras in 1845 where Arabella Roupell continued her botanical painting. When Wallich retired to London from Calcutta in 1846, he persuaded her to allow him to take along some of her paintings to show to Sir William Jackson Hooker. Hooker was delighted with her work and with Arabella's botanist brother-in-law, George Roupell, chose ten of the plates for publication. Having received the blessing of both Hooker and Wallich, the plates were handed to the eminent Victorian lithographer, Paul Gauci, who prepared the illustrations for the printer W. Nicol of the Shakespeare Press on Pall Mall. The descriptive text accompanying the plates was provided by William Henry Harvey, the Irish botanist. One hundred subscribers were listed, a large portion being from the Peerage, and not counting Victoria, Prince Albert and the Directors of the East India Company. The book was well received not only in England, but also on the Continent, where the author was elected a member of the Regensburg Society of Arts. The work is dedicated to Wallich in recognition of his 'flattering encouragement and scientific guidance' with 'every feeling of grateful and affectionate esteem.' It is thought that only 110 copies of the atlas folio were printed, making the work rare, expensive and highly desirable to collectors.The East India Company was dissolved in 1858 whereupon the Roupells retired to Loddar Court near Reading in Berkshire. By this time the family was financially secure, Thomas having been promoted to sessions judge while in India, and posted first to Coimbatore and later to Cuddalore. Roupell took up landscape gardening and spent part of each year at Sundorne Castle, her father's inheritance in Shropshire.\nThe hundred or so plates that had not been published were located in the 1930s through Elizabeth Chute Roupell, the widow of Norton Aylmer Roupell, and daughter-in-law of the artist. They had passed into the possession of George Roupell, a grandson of the artist and nephew of Elizabeth Chute Roupell. Repeated letters from his aunt and from Pretoria went unanswered by George and the matter seemed to have got nowhere. In a surprising development, a package arrived in Irene from England for General Jan Smuts during his final illness. The parcel remained unopened until after Smuts' death in 1950 when it was passed on to Illtyd Pole-Evans, who in 1930 had accompanied John Hutchinson and Jan Smuts on a two-month botanising expedition through Southern and Northern Rhodesia to Nyasaland and Lake Tanganyika. Pole Evans passed the paintings on to Mary Gunn, librarian at the Botanical Research Institute, who immediately recognised them as the long sought-after collection.  After being displayed at an exhibition held at the Johannesburg Public Library in November 1951, the Smuts family presented the paintings to the University of Cape Town, which passed them on to the library of the Bolus Herbarium. Eleven of the plates from this collection were published under the title 'More Cape Flowers by a Lady' in 1964, while the same plates, with the addition of two more and biographical material, appeared under the title 'Arabella Roupell' in 1975. A painting of a Cape Erica, which had been given to Lady d'Urban, Sir Benjamin d'Urban's wife, is now held by the Museum Africa in Johannesburg.\nRoupell is commemorated by Protea roupelliae, named by the Swiss botanist Carl Meissner. The short-lived taxon Roupellia grata, a flowering creeper from Sierra Leone and named to honour various members of the Roupell family, was lumped as Strophanthus gratus by the French botanist Henri Ernest Baillon.", "link_mentions": {}}}