{"wiki_id": "http://www.wikidata.org/entity/Q4786803", "itemLabel": "Archie Styles", "itemDescription": "English footballer (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Archie_Styles", "wikipedia_page": {"main": "Arthur Styles (born 3 September 1949), known as Archie Styles, is an English former professional footballer who played as a left back. He made more than 150 appearances in the Football League for several clubs.\nStyles was born in Liverpool, and joined home-town club Everton on leaving school in 1965. He won representative honours for England at schoolboy and youth level. He was unable to make himself a regular part of Everton's first team, making only 23 league appearances in seven years at the club. In February 1974, together with Howard Kendall, he moved from Everton to Birmingham City in part-exchange for Bob Latchford, the whole deal valuing Latchford at £350,000 which was at the time a British transfer record. At Birmingham, facing competition from Garry Pendrey and others, he failed to establish himself as first choice at left back. In 1978, he moved to Peterborough United where he spent one season, followed by one season at Portsmouth, after which he joined the coaching staff at the club.", "link_mentions": [{"page": "Bob Latchford", "response": ["Latchford was born in Kings Heath, Birmingham. He was transferred from Birmingham City to Everton for £350,000, a British transfer record at the time (Howard Kendall and Archie Styles were transferred to Birmingham City as part of the same deal, with Birmingham being paid just £80,000). At Everton, Latchford was the top scorer for six successive seasons. He scored 30 goals in the 1977–78 season, winning a £10,000 prize offered by a national newspaper for the first footballer to reach that number in a single season.Bob Latchford , Everton F.C. website During the mid-seventies, Latchford was widely considered one of the top English forwards of his generation. He earned his first full cap for England in a World Cup qualifier against Italy in 1977. In April 2006 a book was published telling the story of his 1977/78 season. Co-written with journalist Martin O'Boyle, the book supports Everton's former players charity."]}, {"page": "List of Birmingham City F.C. records and statistics", "response": ["Trevor Francis, who joined Birmingham as a 15-year-old, became the first British footballer to be transferred for a fee of at least £1 million when Brian Clough signed him for league champions Nottingham Forest in February 1979. The basic fee was below £1mClough claimed in his autobiography to have set the fee at £999,999 because he did not want the idea of being the first £1m player going to Francis's headbut VAT and the transfer levy raised the total payable to £1.18m. Within three months he scored the winning goal in the 1979 European Cup Final.Matthews (2000), \"Francis, Trevor\", p. 86. Some four years earlier, Birmingham had also been involved in a British record transfer when they sold Bob Latchford to Everton, in part exchange for Howard Kendall and Archie Styles, the deal valuing Latchford at £350,000.Matthews (2000), \"Latchford, Bob\", p. 132. The initial £25m reportedly received from Borussia Dortmund for Jude Bellingham in 2020 made him the most expensive 17-year-old in world football history."]}, {"page": "Mick Rathbone", "response": ["Rathbone was born in Sheldon, Birmingham, and attended Sir Wilfrid Martineau School. His parents were both factory workers. He had ambitions to become a doctor, but decided instead to pursue a career in football when Birmingham City, the club he supported, offered him an apprenticeship in December 1974; as a schoolboy Rathbone had been associated with local rivals Aston Villa. He was capped twice at youth level by England. The 17-year-old Rathbone made his first-team debut on 31 August 1976 in a League Cup defeat to Blackpool at Bloomfield Road, and had a poor game as he later admitted that \"I was at fault for both goals\" and \"had absolutely no confidence at all\" due to what he deemed to be an intimidating atmosphere in the Birmingham City dressing room. He was so low on confidence that he tried to avoid manager Willie Bell so as to avoid training with or playing for the first team. He also recalled how he was never able to effectively pass the ball, either in training or in matches, to star forward Trevor Francis due to the nerves he felt in the presence of his childhood hero. However, he made his league debut on 20 October, as a substitute replacing Archie Styles in a 1–0 defeat to Tottenham Hotspur at White Hart Lane.Matthews, p. 212."]}, {"page": "January 1975", "response": ["*Everton became the new leaders of the English Soccer First Division with 16 games remaining after a brace from Bob Latchford and an own goal from Archie Styles that secured a 3–0 victory at Birmingham City. Previous leader Ipswich was defeated, 1–2, at Carlisle United.http://www.statto.com/football/stats/results/1975-01-18"]}, {"page": "1977–78 Birmingham City F.C. season", "response": ["!scope=\"row\"| Archie Styles"]}, {"page": "1976–77 Birmingham City F.C. season", "response": ["!scope=\"row\"| Archie Styles"]}, {"page": "1975–76 Birmingham City F.C. season", "response": ["!scope=\"row\"| Archie Styles"]}, {"page": "1974–75 Birmingham City F.C. season", "response": ["!scope=\"row\"| Archie Styles"]}, {"page": "1973–74 Birmingham City F.C. season", "response": ["In February 1974, by which time he had already scored 18 goals for Birmingham, centre-forward Bob Latchford signed for Everton in part-exchange for Howard Kendall, Archie Styles, and £80,000. The whole package was valued at a British record transfer fee of £350,000.", "!scope=\"row\"| Archie Styles"]}, {"page": "History of Birmingham City F.C. (1965–present)", "response": ["Goodwin had converted the attractive but inconsistent football of Cullis's teams to a skilful, aggressive game capable of drawing crowds – average home league attendance rose to over 32,000 – and maintaining top-flight status.Matthews (1995). Complete Record. pp. 37–38. Yet five years later, the Birmingham Mail sports editor, Dennis Shaw, wrote what a colleague described as a \"a dossier of despair on the wasted seventies at St Andrew's. It was a chronicle of lack of achievement, sales of star players and unsuccessful replacements, growing disenchantment among the fans.\" Seven wins and a draw in the last eight matches took Birmingham to a mid-table finish in 1972–73, but by February 1974, the team lay 20th, the club needed to raise money, and Latchford was sold to Everton in a part-exchange deal: £80,000 cash plus players Howard Kendall and Archie Styles, valued at a British record fee of £350,000. Without a goalscorer of that quality, the team struggled,Matthews (1995). Complete Record. pp. 38–39, 209–15. but they avoided relegation, and stayed up again in 1974–75, as well as reaching another FA Cup semi-final. This time they lost to Second Division Fulham in a replay when, in the last seconds of extra time, a goalkeeping clearance rebounded off a Fulham player and trickled over the line."]}, {"page": "Archie Styles (footballer, born 1949)", "response": ["#REDIRECT Archie Styles"]}]}}