{"wiki_id": "http://www.wikidata.org/entity/Q4785570", "itemLabel": "Archange Nkumu", "itemDescription": "English football player (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Archange_Nkumu", "wikipedia_page": {"main": "Archange Nkumu (born 5 November 1993) is an English footballer who plays as a defender or midfielder for 1. deild karla side Þróttur Reykjavík.\n\n", "link_mentions": [{"page": "2012–13 Colchester United F.C. season", "response": ["|Archange Nkumu"]}, {"page": "2012–13 Yeovil Town F.C. season", "response": ["Yeovil's season began with a Football League Cup first round home tie against Colchester United on 14 August. A first half brace from centre back Richard Hinds and a debut goal from winger Keanu Marsh-Brown helped Yeovil to a comfortable 3–0 victory over their League One rivals. The draw for the second round of the League Cup took place the following day and presented Yeovil with a home tie against Premier League side West Bromwich Albion. Prior to the first match of the league season, on 18 August, the Football League Trophy draw took place on Soccer AM with Yeovil drawn away against Bristol Rovers in the first round of the competition. Later in the day, in Yeovil's opening league match against Coventry City the club fell behind early from a Cody McDonald header, before Richard Hinds scored his third goal in a week as the game ended in a 1–1 draw. The following Tuesday, Yeovil's first away game saw a trip to Brentford in an eventful game Yeovil ran out 3–1 victors thanks to a brace from James Hayter and a penalty save from Marek Štěch. Hinds's goal scoring form and impressive performances earned him a place in the League One Team of the Week. On 23 August, Chelsea youngster Archange Nkumu joined the club on a one-month loan deal as cover for injured fellow Chelsea loanee Rohan Ince, and Curtis Haynes-Brown left the club to join League Two side AFC Wimbledon on a one-month loan deal. Yeovil's next away trip saw a match against bottom of the League side Scunthorpe United and courtesy of a first half goal from Keanu Marsh-Brown and second half goals from Reuben Reid and a brace from Gozie Ugwu gave Yeovil a 4–0 away victory. The result sent Yeovil to the top of League One for the first time in their history, the result saw four players receive recognition from the Football League Team of the Week goalkeeper Marek Štěch was joined by full backs Luke Ayling and Jamie McAllister along with midfielder Ed Upson. On 28 August in the League Cup second round tie against West Brom despite an impressive performance and a brace from forward Reuben Reid, the match saw Yeovil eventually overpowered to lose 4–2. Yeovil's performances in the month of August led to the nomination of Gary Johnson for Manager of the Month and defender Richard Hinds for Player of the Month, both though lost out to Ronnie Moore and Andy Robinson, both of Tranmere Rovers, respectively."]}, {"page": "Archange", "response": ["*Archange Nkumu (born 1993), English footballer"]}, {"page": "2017 KA Fotball season", "response": ["|Archange Nkumu"]}, {"page": "List of foreign Úrvalsdeild players", "response": ["*Archange Nkumu – KA – 2017–"]}]}}