{"wiki_id": "http://www.wikidata.org/entity/Q4781999", "itemLabel": "April Bloomfield", "itemDescription": "chef", "wikipedia_url": "https://en.wikipedia.org/wiki/April_Bloomfield", "wikipedia_page": {"main": "April Bloomfield (born 1974), is a British chef best known for opening two restaurants: The Spotted Pig (closed January 26, 2020) and The Breslin Bar & Dining Room. She had previously worked at a number of restaurants in the United Kingdom, including The River Café and Bibendum.", "link_mentions": [{"page": "70 Pine Street", "response": ["Rose and DTH Capital transformed 70 Pine Street into a mixed-use building featuring luxury rental apartments and a variety of retail and restaurants starting in 2015. Leasing of the residential units started in December 2015, and the renovation was completed the next year. Unlike the top floors of other converted residential buildings, which were generally turned into penthouse apartments, Rose decided to add amenities to the top floors of 70 Pine Street. Space in 70 Pine Street's lobby and upper floors was originally set to contain restaurants by April Bloomfield and Ken Friedman, who withdrew from the project in July 2016. Ultimately, the upper-floor restaurant spaces hosted James Kent and Jeff Katz's restaurant Crown Shy, which opened in 2019. Mint House opened a 132-unit hotel for business travelers in November 2020, and the Saga restaurant opened atop the building in late 2021."]}, {"page": "Ecco Press", "response": ["Notable titles published by Ecco since 1999 include the paperback edition of Anthony Bourdain's Kitchen Confidential: Adventures in the Culinary Underbelly and Patti Smith's memoir, Just Kids. Currently, Ecco releases between 35 and 40 titles a year, usually a mixture of literary novels, biographies, memoirs, and culinary titles, by authors such as Joyce Carol Oates, Richard Ford, T.C. Boyle, Amy Tan, Margaret Atwood, Jonathan Lethem, Jelani Cobb, Simon Schama, Richard Dawkins, Russell Banks, Vendela Vida, Jorie Graham, Mario Batali, Daniel Boulud, and April Bloomfield."]}, {"page": "List of Iron Chef America episodes", "response": ["|style=\"background:silver\"| April Bloomfield", "|style=\"background:silver\"|April Bloomfield"]}, {"page": "Anthony Bourdain: No Reservations", "response": ["*Chefs who appeared on the program include Ferran and Albert Adrià, Éric Ripert, Gastón Acurio, Thomas Keller, Jacques Pépin, Mario Batali, Masaharu Morimoto, José Andrés, David Chang, Marco Pierre White, Jun Sakamoto, Wylie Dufresne, Homaro Cantu, Michael Symon, Juan Mari Arzak and Elena Arzak, Andoni Aduriz, April Bloomfield, Fergus Henderson, Gabrielle Hamilton, Jiro Ono, Scott Conant, Chris Cosentino, Pino Posteraro, Hidekazu Tojo, Vikram Vij, Edward Tuson, Martin Picard, Joël Robuchon, Alvin Leung, David Munoz, Olivier Rollinger, Paul Kahan, Chris Cheung, Michael Lomonaco, McDang, Chef Wan, Matt Moran, Neil Perry, Luke Mangan and Emeril Lagasse."]}, {"page": "Food & Wine", "response": ["|April Bloomfield, Gabriel Bremer, Gabriel Rucker, Gavin Kaysen, Ian Schnoebelen, Johnny Monis, Matthew Dillon, Paul Virant, Sean O’Brien, Steve Corry"]}, {"page": "Saturday Kitchen", "response": ["* April Bloomfield"]}, {"page": "The River Café (London)", "response": ["The River Café is also notable for the number of successful chefs that have trained in its kitchens. These include Theo Randall, Ed Baines of Randall & Aubin, April Bloomfield of The Spotted Pig in New York, and celebrity chefs Jamie Oliver, Hugh Fearnley-Whittingstall, Ben O'Donoghue and Tobie Puttock."]}, {"page": "Frank Bruni", "response": ["Where You Go Is Not Who You'll Be was published by Grand Central Publishing, an imprint of the Hachette Book Group, in March 2015 and was reissued in an expanded, updated paperback a year later. In a review of it in The Washington Post, Wesleyan University President Michael Roth called it \"a humane, measured book\" with \"lessons for a very wide audience indeed.\" In February 2017, Bruni released his first cookbook, written with his Times colleague Jennifer Steinhauer titled A Meatloaf in Every Oven. It includes recipes from such prominent chefs as Bobby Flay and April Bloomfield."]}, {"page": "List of chefs", "response": ["* April Bloomfield"]}, {"page": "List of English people", "response": ["* April Bloomfield (born 1974)"]}, {"page": "Ace Hotel", "response": ["*Ace Hotel New York worked with Roman and Williams to redesign the former Hotel Breslin, a 1904 building in Midtown Manhattan. This location features a Stumptown Coffee and Chef April Bloomfield's  Michelin-starred The Breslin restaurant."]}, {"page": "Michael Colameco", "response": ["Colameco’s popular long-running TV series, Mike Colameco's Real Food, is a pioneer in food television. Shot documentary-style, the show provides a backstage look at how the most influential people in today’s restaurant scene transform the way we think about food. Featured chefs include Daniel Boulud, Thomas Keller, Gabrielle Hamilton, Dan Barber, Alice Waters, Eric Ripert, Alain Ducasse, April Bloomfield and countless other industry taste makers. Mike Colameco's Real Food has been on the air since 2000 via New York's flagship PBS affiliate, WNET, as well as NJTV. In 2014, the show was picked up for national distribution and airs year-round on the CREATE TV Channel. He is the host and the producer of the show."]}, {"page": "Beat Bobby Flay", "response": ["| April Bloomfield, Scott Gerber, Maureen Petrosky", "|Frank Prisinzano, Roberto Treviño, April Bloomfield", "|Andrew Carmellini, Madison Cowan, April Bloomfield", "| Michael Lomonaco, April Bloomfield, Wylie Dufresne", "| Erik Ramirez, April Bloomfield, Joey Campanaro", "| Madison Cowan, April Bloomfield, Jimmy Bradley", "| Najmieh Batmanglij, April Bloomfield, Kristin Sollenne", "| Michael Psilakis, April Bloomfield, Drew Nieporent"]}, {"page": "Roman and Williams", "response": ["Among the firm's completed commercial projects are: the renovation of the Royalton Hotel, the interiors of the Standard Hotel (including The Standard Grill and the 18th Floor Club, also known as the Boom Boom Room), for hotelier Andre Balazs, and the Ace Hotel, for hotelier Alex Calderwood – including The Breslin and John Dory restaurants, created by celebrated chef April Bloomfield and restaurateur Ken Friedman, and Stumptown Coffee Shop."]}, {"page": "The Spotted Pig", "response": ["The Spotted Pig was a gastropub located at 314 West 11th Street (at Greenwich Street) in the West Village in Manhattan in New York City.\"The Spotted Pig\" New York Magazine The 100-seat gastropub was owned by Ken Friedman. Mario Batali served as a primary investor. The chef was April Bloomfield, a British expatriate celebrity chef who was hired after flying to New York and interviewing with Mario Batali and Freidman. The restaurant held a single Michelin Star from about 2006 to 2016. The restaurant closed on January 26, 2020.", "In December 2017, owner Ken Friedman was accused of multiple cases of sexual harassment in an article published in the New York Times. The authors interviewed many employees who said April Bloomfield was aware of his behavior, but did nothing to shield employees from it. The article included the statement that \"several other employees say they also brought their complaints and concerns about Mr. Friedman to Ms. Bloomfield. Her response was always the same. 'That's who he is. Get used to it. Or go work for someone else'\". April Bloomfield was also aware of her restaurant's third floor nickname, \"the rape room\". Mario Batali, an investor, was a frequent visitor and also accused of criminal behavior on the third floor. Friedman subsequently resigned from management duties of their restaurant group. Shortly after in December 2017, Bloomfield posted an apology on Twitter for not protecting her staff. On January 7, 2020, Ken Friedman agreed to pay $240,000 and 20% of his profits to former employees who accused him of sexual harassment and discrimination."]}, {"page": "The Mind of a Chef", "response": ["The first season premiered on November 9, 2012, with host David Chang. Season 2 premiered on September 7, 2013, and starred chefs Sean Brock and April Bloomfield. Season 3 premiered on September 6, 2014, and stars chefs Edward Lee and Magnus Nilsson. Chefs Gabrielle Hamilton and David Kinch were featured in Season 4.  Season 5 featured chef Ludo Lefebvre."]}, {"page": "Ruth Rogers", "response": ["After her experiences in France and Italy, Rogers was inspired to open an Italian restaurant in London in 1987 with Rose Gray, initially almost as a canteen to feed the staff at Rogers's architecture practice based nearby at Thames Wharf, Hammersmith. Her husband designed the minimalist space.  The River Café developed a strong reputation for the seasonality and quality of its food, and its intense focus on authentic Italian cooking.  Its cookbooks, such as The River Café Cook Book (first published in 1995), have become best-sellers, and Gray and Rogers presented The Italian Kitchen on Channel 4 in 1998.  The restaurant has trained a series of successful chefs, including April Bloomfield, Hugh Fearnley-Whittingstall, Jamie Oliver, and Theo Randall, and it has held a Michelin star since 1998.  Rogers has continued to run the restaurant after the death of her business partner Rose Gray from cancer in 2010.The NS Interview: Ruth Rogers, chef, New Statesman, 1 August 2011"]}, {"page": "Bloomfield (surname)", "response": ["* April Bloomfield (born 1974), English chef"]}, {"page": "Culinary diplomacy", "response": ["*April Bloomfield, Chef at The Spotted Pig and The Breslin, and owner of two Michelin stars"]}, {"page": "41st Daytime Emmy Awards", "response": ["**April Bloomfield, Sean Brock - The Mind of a Chef"]}, {"page": "List of oyster bars", "response": ["* John Dory Oyster Bar – Manhattan, New York CityApril Bloomfield: the English chef taking Manhattan by storm | Life and style | The Observer"]}, {"page": "James Beard Foundation Award: 2010s", "response": ["* New York City Chef: April Bloomfield, The Spotted Pig, New York, NY", "* Craig Claiborne Distinguished Restaurant Review Award: Counter Intelligence: \"The Hearth & Hound, April Bloomfield's New Los Angeles Restaurant, Is Nothing Like a Gastropub\"; \"There's Crocodile and Hog Stomach, but Jonathan Gold Is All About the Crusty Rice at Nature Pagoda\"; and \"At Middle Eastern Restaurants, It All Starts with Hummus. Jonathan Gold says Bavel's Is Magnificent\" by Jonathan Gold, Los Angeles Times"]}]}}