{"wiki_id": "http://www.wikidata.org/entity/Q4786621", "itemLabel": "Archie Bland", "itemDescription": "British newspaper editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Archie_Bland", "wikipedia_page": {"main": "James Franklin Archibald \"Archie\" Bland (born 7 October 1983), is a British newspaper journalist. He is the only child of Sir Christopher Bland, and half-brother to four siblings from his mother's earlier marriage to Thomas Edmund Byng, the 8th Earl of Strafford.Bland was the deputy editor of The Independent, a national British newspaper, a post to which he was appointed in April 2012, at the age of 28. He was also the editor of the Saturday edition of The Independent. He was one of the youngest people to have ever been appointed to a senior editorial post in the British national newspaper industry, described as \"easily the youngest deputy editor in the paper's history, the youngest in national newspapers today and perhaps ever on Fleet Street\".In July 2013, Bland took up a new role as senior writer at both The Independent and The Independent on Sunday newspapers, and in September 2014, he joined The Guardian newspaper. He later became Deputy National Editor of The Guardian.", "link_mentions": [{"page": "October 7", "response": ["*1983 – Archie Bland, English journalist and author"]}, {"page": "The Weakest Link (British game show)", "response": ["A normal daytime edition of the show was made, with some of Anne's favourite contestants from over the years taking part, and with no audience present during filming or changes to the money tree (see above). The first round of questions was notably different and was mainly about Weakest Link and the host, Anne Robinson. The last question asked was \"If the Roman numeral 'X' is halved, the result can be represented by which other Roman numeral?\", the answer being \"V\". The last UK winner was Archie Bland, the editor of The Independent newspaper's Saturday edition, who won £2,090."]}, {"page": "Kentish Town", "response": ["* Archie Bland, journalist, writer and Deputy Editor of The Independent newspaper"]}, {"page": "The Independent", "response": ["* Archie Bland"]}, {"page": "Georgia Byng", "response": ["Georgia Byng was born on 6 September 1965, in London, England. She grew up in a village, Abbots Worthy near City of Winchester in Hampshire. She has three brothers and one sister. She is the elder daughter and second child of Thomas Edmund Byng, the eighth Earl of Strafford and his first wife, Jennifer May (daughter of Irish politician William Morrison May. Byng is the elder sister of Jamie Byng, publisher of Canongate Books. Through her late stepfather, Sir Christopher Bland, Byng is the half-sister of Archie Bland, Guardian writer and sub editor.\"List addict prepared to tick off BT television\". Jane Martinson. The Guardian. 10 February 2006. Retrieved 4 September 2012. Based on an interview of Sir Christopher Bland."]}, {"page": "Rod Liddle", "response": ["Selfish Whining Monkeys: How we Ended Up Greedy, Narcissistic and Unhappy, appeared in 2014. Admitting to having paid little attention to Liddle's journalism, Will Self, in his review for The Guardian wrote: \"it's so much more authoritative to hear a man condemned out of his own mouth over 200-plus pages than it is to assay him on the basis of newspaper columns, which, by and large, favour polarised views tendentiously expressed.\" Despite his serious reservations about Liddle's writing, Self concludes: \"The peculiar thing is that I can't find it in my heart of hearts to dislike the man, I think there's good in him and that he can change his bilious complexion.\"Will Self \"Selfish, Whining Monkeys by Rod Liddle review – why is he so angry?\", The Guardian, 22 May 2014 Liddle responded to Self's review in an interview with Archie Bland of The Independent a few weeks later: \"He reviewed what he thought I was, not what the book was about. Bizarre. I think it's slightly deranged.\"Archie Bland \"Rod Liddle gives his critics plenty of reasons to dislike him - but why does he seem to loathe himself so much?\", The Independent, 12 June 2014"]}, {"page": "Varsity (Cambridge)", "response": ["The paper has also launched the careers of many news journalists, including in recent times former Observer Political Editor Gaby Hinsliff, Guardian New York correspondent Oliver Burkeman, Guardian music critic Alexis Petridis, author and columnist Iain Hollingshead, Guardian columnist Archie Bland, the Independent's New York business correspondent Stephen Foley, The Sunday Times News Review Editor Martin Hemming, as well as former Independent columnist Johann Hari. The BBC and Evening Standard reporter Andrew Gilligan was once a news editor. Other notable contributors who have had later success in other fields include Michael Frayn, Germaine Greer, Clive James, Gavin Lyall, Robert Jenrick and Charles, Prince of Wales.", "Some notable editors of the Varsity include Archie Bland (Michaelmas 2004), Amol Rajan (Lent 2005), Laura-Jane Foley (Lent 2004), and James Dacre (Michaelmas 2005).", "It was successful in the 2004 Guardian Student Media Awards where it won the prize for best columnist (Archie Bland) and came runner-up in best sports writer category (Sam Richardson). In 2005 Varsity writer Sam Richardson won the Guardian's Student Diversity Writer of the Year award."]}, {"page": "Abbots Worthy", "response": ["* Archie Bland - Writer, journalist and Deputy Editor of The Independent newspaper"]}, {"page": "Christopher Bland", "response": ["The Bland family, consisting of the couple, their son, Archie Bland, and four stepchildren, lived at Abbots Worthy House,Caroline McGhie, \"Property: Crazy times – we had them\", The Telegraph, 11 December 2009. Retrieved 16 September 2012. the home of Lady Bland and her former husband, later the Earl of Strafford,\"The real Byng\", The Scotsman, 2 June 2006. Retrieved 16 September 2012. in the village of Abbots Worthy in Hampshire, with a London flat in Catherine Place, near St James's Park,BLAND – Sir (Francis) Christopher Buchan Bland, Burke's Peerage. Retrieved 16 September 2012. moving their main residence to Blissamore HallElizabeth Sheinkman and James Byng, The New York Times, 3 July 2005. Retrieved 16 September 2012. in the village of Clanville near Andover (also in Hampshire), in 1998.Helen Studd, \"BT boss takes on 'squatters'\", The Times, 23 July 2001. Retrieved 16 September 2012.", "Bland was the father of print journalist and former deputy editor of The Independent newspaper, Archie Bland,Interview: Sir Christopher Bland – List addict prepared to tick off BT television The Guardian, 10 February 2006. Retrieved 4 September 2012. and from 1981 became stepfather to four children, who include the 9th Earl of Strafford, the author Lady Georgia Byng, and the Managing Director of the Edinburgh-based publishing house Canongate Books, Jamie Byng, following his wife's earlier marriage to Viscount Enfield (1963–1981)."]}, {"page": "Guardian Student Media Award", "response": ["| Archie Bland || Varsity || University of Cambridge || Tim Hill || Student Direct || University of Manchester"]}, {"page": "Jamie Byng", "response": ["Byng grew up in the village of Abbots Worthy in Hampshire, England.\"The real Byng\", The Scotsman, 2 June 2006. The second son of the 8th Earl of Strafford and Jennifer May, he is brother to the author Lady Georgia Byng, and through his stepfather, Sir Christopher Bland (the former chairman of the BBC, British Telecom and Royal Shakespeare Company), he is the half-brother of Archie Bland, print journalist and former deputy editor of The Independent.Jane Martinson, \"List addict prepared to tick off BT television\" (interview with Sir Christopher Bland), The Guardian, 10 February 2006. Retrieved 4 September 2012.\"GQ and ei's 100 Most Connected Men 2014\", GQ, 8 December 2014."]}, {"page": "Clanville", "response": ["* Archie Bland – writer, journalist and former Deputy Editor of The Independent newspaper"]}, {"page": "The Last Weekend (TV series)", "response": ["The Independent's Archie Bland wrote \"no one is to be entirely trusted, [the] gun is definitely going to go off, and I'm looking forward to finding out who fires it.\""]}, {"page": "Archie bland", "response": ["#REDIRECT Archie Bland "]}, {"page": "List of alumni of Emmanuel College, Cambridge", "response": ["* Archie Bland"]}, {"page": "Mrs. Brown's Boys D'Movie", "response": ["Mark Kermode gave the film a scathing review, calling it \"an absolute stinker\" and \"not funny on any level, at all\", saying that: \"it's good that the cast [laugh at themselves in the bloopers] because were it not for the cast laughing at the jokes, there wouldn't be anybody laughing in the cinema... there are no laughs. None. Nul points. Nil.\"  Archie Bland of The Independent said that he \"couldn't argue\" with actor Rory Cowan who said that the views of critics were \"totally irrelevant\", but still found the film \"dreadful... slow, sentimental, and altogether cynical\", saying that \"I'm afraid I can't say I laughed, or even smiled, once in the whole godforsaken 93 minutes.\" He concluded by saying that \"I don't see why anyone is obliged to like [the film] just because it does well at the box office... In any case, it doesn't really matter. It is now absolutely clear that Mrs Brown is a slating-proof juggernaut.\""]}, {"page": "The Mancunion", "response": ["In 2004, Stuart MacLean was runner-up for Reporter of the Year and Journalist of the Year. In the same year, Tim Hill was named runner-up for Columnist of the Year behind now-Guardian journalist Archie Bland."]}, {"page": "RSL Christopher Bland Prize", "response": ["The initial panel of judges was chaired by Gillian Slovo, and comprised Sanjeev Bhaskar, Archie Bland (son of Sir Christopher) and Anne Chisholm. "]}]}}