{"wiki_id": "http://www.wikidata.org/entity/Q4786275", "itemLabel": "Archibald Corble", "itemDescription": "fencer", "wikipedia_url": "https://en.wikipedia.org/wiki/Archibald_Corble", "wikipedia_page": {"main": "Archibald Corble (26 May 1883 – 22 January 1944) was a British fencer. His weapon was the sabre. He competed at three Olympic Games - 1912, 1924 and 1928. He was twice British Sabre Champion, in 1922 and 1927. He was the great uncle of the playwright and director Simon Corble.\nThe Corble Cup is now competed for annually as the British national sabre trophy.\nCorble was a great collector of both swords and books on fencing. At the end of his life he donated most of his vast collection to the Catholic University of Leuven. The collection contains around 1,900 items, dating from the 15th to the 20th century, mainly from France, England, South America, Italy and Germany. Notable are the personal details, such as letters addressed to Corble, photographs of fencers, notes and comments, which are an integral part of the collection. Corble, as well as the previous owners, such as Cyril Matthey, Alfred Hutton, JR Garcia Donnell, Frederick Pollock and Jacopo Gelli, opted for new personal bindings, added ex-libri to their copies.", "link_mentions": [{"page": "Bartitsu", "response": ["Via correspondence with Professor Jigoro Kano, the founder of Kodokan Judo, and other contacts in Japan, Barton-Wright arranged for Japanese jujutsu practitioners Kaneo Tani, Seizo Yamamoto and the nineteen-year-old Yukio Tani to travel to London and serve as instructors at the Bartitsu Club. Kaneo Tani and Yamamoto soon returned to Japan, but Yukio Tani stayed and was shortly joined by another young jujutsuka, Sadakazu Uyenishi. Swiss master-at-arms Pierre Vigny and wrestler Armand Cherpillod were also employed as teachers at the Club. As well as teaching well-to-do Londoners, their duties included performing demonstrations and competing in challenge matches against fighters representing other combat styles. In addition, the Club became the headquarters for a group of fencing antiquarians led by Captain Alfred Hutton and it served as their base for experimenting with historical fencing techniques, which they taught to members of London's acting elite for use in stage combat. It is likely that the actors Esme Beringer and Charles Sefton, as well as fencer Archibald Corble, were among Hutton's historical fencing students at the Bartitsu Club."]}, {"page": "Great Britain at the 1912 Summer Olympics", "response": ["| Archibald Corble", "| Edward Brookfield  Harry Butterworth  Archibald Corble  Richard Crawshay  Alfred Ridley-Martin  William Marsh"]}, {"page": "Great Britain at the 1924 Summer Olympics", "response": ["| Archibald Corble", "| Edward Brookfield  Archibald Corble  Robin Dalglish  William Hammond  Cecil Kershaw  William Marsh"]}, {"page": "Fencing at the 1912 Summer Olympics – Men's sabre", "response": ["| 4 ||align=left| Archibald Corble ||align=left|  || 0 || "]}, {"page": "Simon Corble", "response": ["Simon Corble is an English playwright, director and performer. He is the great nephew of Archibald Corble, the British fencer. He grew up in rural Oxfordshire, the son of a country vicar. The family moved north in 1974, and at the age of sixteen he played Hamlet at Lymm Grammar School, Cheshire and \"never looked back\". After training as an actor at Manchester Polytechnic (now Manchester Metropolitan University) he went on to create his own dramatic works. He has explored the potential of site-specific theatre in both his own works and those of others. On his website he writes that his strengths lie in \"comedy, site-specific and promenade theatre, audio work, directing Shakespeare, and in creating unique theatrical experiences\".Simon Corble's website"]}, {"page": "Fencing at the 1924 Summer Olympics – Men's team sabre", "response": ["* Archibald Corble"]}, {"page": "Archie Corble", "response": ["#REDIRECT Archibald Corble"]}, {"page": "Corble", "response": ["*Archibald Corble (1883–1944), British fencer, great uncle of Simon"]}]}}