{"wiki_id": "http://www.wikidata.org/entity/Q4786532", "itemLabel": "Archibald Sturrock", "itemDescription": "British railway engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Archibald_Sturrock", "wikipedia_page": {"main": "Archibald Sturrock (30 September 1816 – 1 January 1909) was a Scottish mechanical engineer who was born at Petruchie, Angus, Scotland. He was locomotive superintendent of the Great Northern Railway from 1850 until c. 1866, having from 1840 been Daniel Gooch's assistant on the Great Western Railway.\nArchibald Sturrock is often remembered for his unsuccessful experiment with steam tenders. However, his principal achievement was the opening of the Great Northern main line and the establishment of GNR’s reputation for a reliable and comfortable passenger service from London to York and beyond.", "link_mentions": [{"page": "Great Western Railway", "response": ["A number of engineers trained at or worked for the GWR, before moving to other companies including Archibald Sturrock (GNR), Thomas Russell Crampton (SER among others), James Holden (GER), Harold Holcroft (SECR, SR), William Stanier (LMS)."]}, {"page": "Booster engine", "response": ["An early type of booster used in Great Britain was the steam tender, which was tried in 1859 by Benjamin Connor of the Caledonian Railway on four 2-4-0 locomotives. Archibald Sturrock of the Great Northern Railway (GNR) patented a similar system on 6 May 1863 (patent no. 1135). It was used on fifty GNR 0-6-0 locomotives: thirty converted from existing locomotives between 1863 and 1866, and twenty built new in 1865 (nos. 400–419). The equipment was removed from all fifty during 1867–68."]}, {"page": "4-2-2", "response": ["The first 4-2-2 to have a bogie was built by Archibald Sturrock of the Great Northern Railway (GNR) in 1853. This had  flangeless driving wheels, and was only moderately successful, having a tendency to derail. By the 1870s, improved design of bogies giving more flexibility enabled designers to create fast standard gauge express passenger locomotives of this type. On the GNR, Patrick Stirling built 53 examples with outside cylinders at Doncaster railway works between 1870 and 1895, for use on the main line between London and York. They ran at an average speed of more than 60 mph during the race to the north, and were called eight-footers because of the driving wheel, that was more than 8 ft. in diameter. Stirling's successor Henry Ivatt built a further twelve singles between 1898-1901 before moving on to larger 4-4-2 designs."]}, {"page": "0-8-0", "response": ["Two examples of 0-8-0T tank locomotives were built by Archibald Sturrock of the United Kingdom’s Great Northern Railway in 1866, but the design was not perpetuated. A tender locomotive version was introduced on the Barry Railway Company in 1889 to haul coal trains."]}, {"page": "William Barton Wright", "response": ["Barton Wright became an apprentice at the Swindon Works of the Great Western Railway (GWR) at the age of 17, under Daniel Gooch. There he served in the erecting shop, and then the drawing office, before becoming assistant to Archibald Sturrock, the works manager. Having completed his apprenticeship in 1851, he was given the charge of the GWR's locomotive depot at Paddington."]}, {"page": "LNER Peppercorn Class A1", "response": ["| 60118 || SturrockArchibald Sturrock ||data-sort-value=\"1948-11-15\"|November 1948||Doncaster||data-sort-value=\"1965-10-15\"| October 1965 ||", "* Names of people: W. P. Allen (an LNER locomotive driver who became a member of the Railway Executive in 1948), Archibald Sturrock, Patrick Stirling, H. A. Ivatt, Sir Vincent Raven, Wilson Worsdell, Edward Fletcher (Locomotive Superintendents of pre-grouping railways), Sir Walter Scott, Saint Mungo"]}, {"page": "Yorkshire Engine Company", "response": ["The idea of a locomotive builder based near Sheffield was first suggested in 1864 by W. G. Eden, who later became the fourth Baron Auckland. At the time, Eden was Chairman of the South Yorkshire Railway, and a director of the Manchester, Sheffield and Lincolnshire Railway (MSLR), posts which he had taken up after retiring as a diplomat. He invited Archibald Sturrock, who was employed by the Great Northern Railway as its locomotive engineer, to be the Chairman of the new company. Alfred Sacré would be the Managing Director, and his older brother, Charles, then the Engineer and Locomotive Superintendent for the MSLR, was also part of the team."]}, {"page": "Avonside Engine Company", "response": ["In 1872 on the recommendation of Sir Charles Fox and Sons, Avonside built two large 42-ton  Fairlies for shipment to Canada, one each to the Toronto, Grey and Bruce Railway and the Toronto and Nipissing Railway. The Avonside Works Manager at the time these locomotives were built was Alfred Sacré, the brother of Charles Sacré Locomotive Engineer of the Manchester Sheffield & Lincolnshire Railway. Alfred Sacré trained under Archibald Sturrock at the Doncaster Plant of the Great Northern Railway and in 1872 moved from Avonside to the Yorkshire Engine Company, Sheffield where he built more Fairlie types."]}, {"page": "R. B. Longridge and Company", "response": ["Business increased in 1846 with about sixty engines for the London and Birmingham Railway, the Midland Railway and the London, Brighton and South Coast Railway. While the export trade experienced a lull, orders continued to be fulfilled for the home railways, including ten 4-2-0 Crampton locomotives for the Great Northern Railway, which were later converted to 2-2-2s by Archibald Sturrock."]}, {"page": "Charles Sacré", "response": ["Charles Sacre was one of thirteen children born to John Joseph Berlot de Sacre. The family was of Huguenot origin. He was articled to Archibald Sturrock at the Great Northern Railway works at Boston, Lincolnshire in 1846, and upon the completion of the apprenticeship, he was appointed Assistant Locomotive Superintendent at Peterborough. (This was an out-station of the new central workshop at Doncaster, which opened in 1853.)"]}, {"page": "Sturrock", "response": ["*Archibald Sturrock (1816–1909), Scottish mechanical engineer"]}, {"page": "Holy Trinity, Sloane Street", "response": ["There is a memorial on the north wall of the church to Archibald Sturrock (1816–1909), the Chief Locomotive Engineer of the Great Northern Railway from 1850 to 1866. After his early retirement from the railway, he became a magistrate and lived in Upper Chelsea."]}, {"page": "Locomotives of the Great Northern Railway (Great Britain)", "response": ["==Archibald Sturrock (1850–1866)=="]}, {"page": "1909 in Scotland", "response": ["* 1 January – Archibald Sturrock, steam locomotive engineer (born 1816)"]}, {"page": "1816 in Scotland", "response": ["* 30 September – Archibald Sturrock, steam locomotive engineer (died 1909)"]}, {"page": "5th Battalion, York and Lancaster Regiment", "response": ["The 20th RVC was recruited largely from employees of the Great Northern Railway (GNR) at Doncaster Works and was commanded by the railway's locomotive superintendent, Archibald Sturrock.Army List. The other units in the battalion were mainly recruited from coal mining and related industries. A Rotherham Rifle Band was formed and by August 1861 it was competing in brass band competitions.Brass Band Results."]}]}}