{"wiki_id": "http://www.wikidata.org/entity/Q4786717", "itemLabel": "Archie Kelly", "itemDescription": "Scottish footballer (1921-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Archie_Kelly", "wikipedia_page": {"main": "Archibald Kelly (9 December 1921 – 15 July 2005) was a Scottish footballer who played as a centre forward. He is best remembered for his time with Motherwell, his goals helping the side to their first victories in both the Scottish Cup and Scottish League Cup. He was born in Glasgow.", "link_mentions": [{"page": "City Life Comedian of the Year", "response": ["In the first year, the competition was won by Caroline Aherne, who went on to create Mrs Merton and The Royle Family and in subsequent years all three writers of the successful sitcom Phoenix Nights - Peter Kay, Dave Spikey and Neil Fitzmaurice - won the competition.  Notable runners-up include Dave Gorman, Archie Kelly and Johnny Vegas."]}, {"page": "George Hamilton (footballer)", "response": ["Hamilton returned to Aberdeen at the end of global hostilities and enjoyed his most successful period, lifting the transitional 1945–46 League Cup then scoring the winner in the 1947 Scottish Cup Final against Hibernian. Despite this, when Heart of Midlothian offered £8000 plus the younger Archie Kelly for his services in December 1947, the Reds considered it good value for a 30-year-old, and accepted."]}, {"page": "List of Aberdeen F.C. seasons", "response": ["|align=\"left\"|Archie Kelly||10"]}, {"page": "List of Heart of Midlothian F.C. seasons", "response": ["|Archie Kelly||15||19,570", "|Scottish Division One||30||10||8||12||37||42||-5||28||9th||Second Round||Quarter-Final||Archie Kelly||11||22,694"]}, {"page": "1950–51 Scottish Cup", "response": ["|CF || Archie Kelly"]}, {"page": "Kelly (surname)", "response": ["*Archie Kelly (1921–2005), Scottish footballer"]}, {"page": "1950 Scottish League Cup Final", "response": ["The 1950 Scottish League Cup Final was played on 28 October 1950, at Hampden Park in Glasgow and was the final of the fifth Scottish League Cup competition. The final was contested by Hibernian and Motherwell. Motherwell won the match 3–0 thanks to goals by Jim Forrest, Archie Kelly and Willie Watters.", "In the 74th minute, Tommy Younger could only parry a shot by Archie Kelly, who headed in the rebound to score the opening goal. Two minutes later, a deep cross by Archie Shaw was headed back across by Willie Watters, and Forrest headed in Motherwell's second goal. The third goal came when Younger miskicked a clearance into the path of Watters, who lobbed the Hibs' keeper. Younger had to be consoled by his opposite number after the game, while the Motherwell players celebrated their victory.", "|CF ||||Archie Kelly"]}, {"page": "1952 Scottish Cup Final", "response": ["The 1952 Scottish Cup Final was played on 19 April 1952, at Hampden Park in Glasgow and was the final of the 67th Scottish Cup competition. The final was contested by Dundee and Motherwell. Motherwell won the match 4–0 thanks to goals by Jimmy Watson, Willie Redpath, Wilson Humphries and Archie Kelly.", "|CF || Archie Kelly"]}, {"page": "List of Motherwell F.C. seasons", "response": ["|align=\"center\"|Archie Kelly (15)", "|align=\"center\"|Archie Kelly (20)", "|align=\"center\"|Archie Kelly (19)"]}, {"page": "List of Motherwell F.C. players", "response": ["|Archie Kelly||||1949–1953||104||65||"]}]}}