{"wiki_id": "http://www.wikidata.org/entity/Q4799119", "itemLabel": "Arthur Hopcraft", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Hopcraft", "wikipedia_page": {"main": "Arthur Hopcraft (30 November 1932 – 22 November 2004) was an English scriptwriter, well known for his TV plays such as The Nearly Man, and for his small-screen adaptations such as Tinker Tailor Soldier Spy; Hard Times, Bleak House, and Rebecca. Before taking up writing for TV, he was a sports journalist for The Guardian and The Observer, writing The Football Man: People and Passions in Soccer. He also had four other books published, including an autobiographical account of his childhood, and wrote the screenplay for the film Hostage. Hopcraft won the BAFTA writer's award in 1985.", "link_mentions": [{"page": "November 22", "response": ["*2004 – Arthur Hopcraft, English screenwriter and journalist (b. 1932)"]}, {"page": "1979 in film", "response": ["| Agatha || Warner Bros. / Casablanca FilmWorks / First Artists || Michael Apted (director); Kathleen Tynan, Arthur Hopcraft (screenplay); Dustin Hoffman, Vanessa Redgrave, Timothy Dalton, Helen Morse, Celia Gregory, Paul Brooke, Carolyn Pickles, Timothy West, Tony Britton, Alan Badel, Robert Longden, Donald Nithsdale, Yvonne Gilan, Sandra Voe, Barry Hart, David Hargreaves, Tim Seely, Jill Summers, Chris Fairbank, Liz Smith, Peter Arne || Drama, Thriller || Live Action"]}, {"page": "Cannock", "response": ["* Arthur Hopcraft (1932–2004) author, reporter & TV scriptwriter, wrote perceptively of his upbringing in Cannock"]}, {"page": "2004 in the United Kingdom", "response": ["**Arthur Hopcraft, screenwriter (born 1932)"]}, {"page": "Play for Today", "response": ["Writers who contributed plays to the series included Ian McEwan, John Osborne, Dennis Potter, Stephen Poliakoff, David Hare, Willy Russell, Alan Bleasdale, Arthur Hopcraft, Alan Plater, Graham Reid, David Storey, Andrew Davies, Rhys Adrian and John Hopkins. Several prominent directors also featured, including Stephen Frears, Alan Clarke, Michael Apted, Mike Newell, Roland Joffé, Ken Loach, Lindsay Anderson, and Mike Leigh. Some of the best remembered plays broadcast in the strand include Edna, the Inebriate Woman (1971), The Foxtrot (1971), Home (1972), Bar Mitzvah Boy (1976), The Other Woman (1976), Abigail's Party (1977), Blue Remembered Hills (1979) and Just a Boys' Game (1979). Certain other well known plays, including Penda's Fen (1974), Nuts in May (1976), were commissioned by David Rose of the BBC's English Regions Drama department based in Birmingham."]}, {"page": "Hywel Bennett", "response": ["Bennett's television career resumed with appearances in episodes of Play for Today (1973) and The Sweeney (1976). In 1978, he appeared in Dennis Potter's musical drama Pennies from Heaven as Tom, a pimp. In 1979, Bennett appeared as the field agent Ricki Tarr in Arthur Hopcraft's six-part BBC2 adaptation of John le Carré's novel Tinker, Tailor, Soldier, Spy (1979), playing the character with \"an ever-thinning veneer of boyish charm masking years of self-delusion and betrayal\" according to the BFI. Bennett then starred in two further BBC miniseries - Malice Aforethought (1979) and The Consultant (1981). In 1981, he played occult novelist Gideon Harlax in David Rudkin's television play Artemis 81."]}, {"page": "Rebecca (novel)", "response": ["Rebecca, a 1997 Carlton Television drama serial, starred Emilia Fox (Joanna David's daughter, in the same role played by her mother in 1979), Charles Dance as de Winter, and Dame Diana Rigg as Mrs Danvers. It was directed by Jim O'Brien, with a screenplay by Arthur Hopcraft. It was broadcast in the United States by PBS as part of Masterpiece Theatre. This adaptation is noteworthy for featuring an appearance by Rebecca, played by Lucy Cohu. It also shows Maxim saving Mrs Danvers from the fire, ending with an epilogue showing Maxim and the second Mrs de Winter relaxing abroad, as she explains what she and Maxim do with their days now they are unlikely ever to return to Manderley."]}, {"page": "Bleak House (1985 TV serial)", "response": ["Bleak House is a BBC television drama first broadcast in 1985. The serial was adapted by Arthur Hopcraft from the Charles Dickens novel Bleak House (1853)."]}, {"page": "Roy Clarke (footballer)", "response": ["He later managed Northwich Victoria for a brief period, before returning to Manchester, where he opened a sports shop in Fallowfield. Through his friendship with Bert Trautmann he gained a contract to become the first Adidas merchant in the area,Rowlands, Trautmann: The Biography, p190 but the shop closed a few years later as Clarke wished to concentrate upon activities at Manchester City. Clarke became the manager of the Manchester City social club in 1966; he and his wife Kathleen ran the social club together for nearly 25 years. The social club was open seven days a week, providing an opportunity for players, management and supporters to form closer bonds. It received praise in Arthur Hopcraft's 1968 book The Football Man, for providing a counterpoint to football clubs who \"largely ignored [their fans] except when they were inside the ground\". During his time at the social club Clarke was a founder of two other Manchester City organisations: the Development Association, which acts as a fund for ground improvements and youth development, and the Former Players' Association, which was co-founded with Paddy Fagan and Roy Little, Clarke serving as secretary. In 2004, he was inducted into the Manchester City Hall of Fame, receiving a lifetime achievement award. Towards the end of his life he suffered from Alzheimer's disease, and died on 13 March 2006, leaving a wife and three daughters."]}, {"page": "Rebecca (1997 TV series)", "response": ["Rebecca is a 1997 British-German television drama directed by Jim O'Brien. The teleplay by Arthur Hopcraft is based on the 1938 novel of the same name by Daphne du Maurier. The serial was filmed for Carlton Television by Portman Productions in association with WGBH and Tele München. It was broadcast in the United States as a presentation of Masterpiece Theatre on PBS."]}, {"page": "Kathleen Tynan", "response": ["She published a novel, The Summer Aeroplane, in 1975. The novel was later adapted into the film Agatha about the disappearance of Agatha Christie in the 1920s starring Dustin Hoffman and Vanessa Redgrave. Tynan collaborated with Arthur Hopcraft on the screenplay. She later wrote a screenplay based on Louise Brooks' autobiography, Lulu in Hollywood, although that film was never produced."]}, {"page": "1932 in the United Kingdom", "response": ["* 30 November – Arthur Hopcraft, scriptwriter (died 2004)"]}, {"page": "1970s in television", "response": ["The BBC, supported by its licence fee and with no advertisers to placate, continued fulfilling its brief to entertain and inform. The Play for Today was a continuation of the Wednesday Play which had run from the mid-1960s. As the title implied, it presented TV drama which had relevance to current social and economic issues, done in a way calculated to intrigue or even shock the viewer. As well as using established writers, it was effectively an apprenticeship for new ones who were trying to make a name for themselves; Dennis Potter, John Mortimer, Arthur Hopcraft and Jack Rosenthal all served time on Play for Today before going on to write their own independent series. In style, the plays could go from almost documentary realism (of which Cathy Come Home is the best known example) to the futuristic or surrealist (The Year of the Sex Olympics, House of Character)."]}, {"page": "The Nearly Man", "response": ["The Nearly Man is a UK TV play and series from the mid-1970s, about a middle-class Labour MP.Nationalarchives.gov.uk Both play and series were written by Arthur Hopcraft; actors in the cast of both include Tony Britton in the title role, Wilfred Pickles, Ann Firbank and Michael Elphick.", "Arthur Hopcraft was a well-respected UK scriptwriter known for his adaptations of TV plays and novels. He won the BAFTA writer's award in 1985, and is best known for TV miniseries including Tinker Tailor Soldier Spy (1979), Bleak House (1985), A Perfect Spy (1987) and A Tale of Two Cities (1989)."]}, {"page": "Hard Times (British TV series)", "response": ["Screenonline wrote \"The four-part adaptation by Arthur Hopcraft is streamlined but generally very faithful to the book and, as directed by John Irvin, the serial is presented with considerable panache.\""]}, {"page": "Nova (UK magazine)", "response": ["Long-form contributors to Nova included such notable and disparate writers as Graham Greene, Lynda Lee-Potter, Christopher Booker, Susan Sontag, Kenneth Allsop, Robert Robinson, Elizabeth David, with agony aunt Irma Kurtz and astrologer Patric Walker\"Patric Walker – ‘the world's greatest astrologer’\". Independent obituary, 9 October 1995. making his name as Novalis. Nova also published the autobiographical writing of Arthur Hopcraft, later expanded into his 1970 book The Great Apple Raid and Other Encounters of a Tin Chapel Tiro.Richard Holt, \"Hopcraft, Arthur Edward (1932–2004)\", Oxford Dictionary of National Biography, Oxford University Press, January 2008; online edn, January 2011, Retrieved 30 May 2011. In the early 1970s it featured experimental \"impressionistic\" fashion photographs by Helmut Newton, Don McCullin, Hans Feurer and Terence Donovan.Robin Muir, \"Donovan, Terence Daniel (1936–1996)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, October 2006, Retrieved 30 May 2011. Illustrators included Mel Calman and Stewart Mackinnon.Simon Heneage, \"Calman, Melville (1931–1994)\", Oxford Dictionary of National Biography, Oxford University Press, 2004, Retrieved 30 May 2011."]}, {"page": "Deaths in November 2004", "response": ["*Arthur Hopcraft, 71, British author (The Football Man), sports journalist, and screenwriter."]}, {"page": "Bob Lord (football chairman)", "response": ["Lord's media exclusions also extended to members of the press who he felt had slighted him. At the time of a 1966 interview with Arthur Hopcraft, Lord had banned three newspapers and six individual journalists from the Turf Moor press box, and Burnley players faced fines if they spoke to journalists without prior permission.Hopcraft, p. 148. His bearing and attitude led one press report to describe him as \"the Khrushchev of Burnley\".Hopcraft, p147."]}, {"page": "Graham Finlayson", "response": ["Finlayson was able to photograph L. S. Lowry, usually uncooperative with the press, and had a particularly successful working relationship with the writer Arthur Hopcraft.Conrad Astley, \"The big picture: Graham Finlayson\", The Manchester Evening News, 29 August 2007. Accessed 16 February 2013."]}, {"page": "Nightingale's Boys", "response": ["Tweety (by Arthur Hopcraft)", "Decision (by Arthur Hopcraft)"]}, {"page": "Dennis Hackett", "response": ["Mirror Magazine published on Wednesdays and it reflected all of Hackett’s chutzpah and sense of zeitgeist, its October 1969 launch issue deciding on a future with the Butlins Redcoats for the 21-year-old Prince of Wales. Hackett hired a youthful editorial team led by Mike Molloy, who went on to edit the Mirror itself. Others who made their reputations here included Eve Pollard on fashion (later editor of the Sunday Mirror and Sunday Express), Jeffrey Bernard as low-life columnist, Delia Smith in her first writing role as cook, playwright Keith Waterhouse likewise writing his first columns, as well as screenwriter Arthur Hopcraft and the astrologer Patric Walker.\"Patric Walker – ‘the world's greatest astrologer’\". Independent obituary, 9 October 1995."]}, {"page": "Chadsmoor", "response": ["*Arthur Hopcraft (1932-2004), Author & Dramatist. "]}, {"page": "1959–60 Burnley F.C. season", "response": ["The 1959–60 campaign was Burnley's 13th consecutive season in the Football League First Division, since promotion from the Football League Second Division in 1946–47. The team had finished the previous season in seventh place and had reached the sixth round of the FA Cup. They ended the season with 8 wins out of 13 in the league, and approached the new season with confidence.Quelch (2015), p. 211 Burnley's chairman, Bob Lord, was elected to the position in 1955. He only appointed managers with a previous playing career at the club; he selected Harry Potts for the post in February 1958. Burnley had become one of the most progressive clubs under Lord,Quelch (2015), pp. 199–206 who was described by Arthur Hopcraft as \"the Khrushchev of Burnley\" as a result of his authoritative attitude. They were one of the first to set up a purpose-built training centre (at Gawthorpe in 1955), which included a medical room, a gymnasium, three full-size pitches and an all-weather surface.Quelch (2015), p. 253 Burnley also became renowned for their youth policy and scouting system. Their scouts—including Jack Hixon—were particularly based in North East England, Scotland and Northern Ireland."]}, {"page": "History of Burnley F.C.", "response": ["In 1946–47, the first season of post-war League football, Burnley took second place in the Second Division and gained promotion under manager Cliff Britton. The team's defence was nicknamed the \"Iron Curtain\", conceding only 29 goals in 42 league matches.Thomas (2014), pp. 25–26 The season also saw a run to the 1947 FA Cup Final, but ended in a 1–0 defeat after extra time to Charlton Athletic at Wembley. Burnley finished third in 1947–48; during the season, Turf Moor recorded its highest seasonal average attendance with 33,621, and the largest attendance at a league match with 52,869 against Blackpool.Simpson (2007), pp. 246–247 Former Burnley player Alan Brown was appointed manager in 1954 and Bob Lord chairman a year later;Quelch (2015), pp. 207–208 Lord was later described by Arthur Hopcraft as \"the Khrushchev of Burnley\" as a result of his combative attitude. The club became one of the most progressive under their tenures.Quelch (2015), pp. 199–206 Burnley was one of the first football clubs to set up a purpose-built training ground, at Gawthorpe in July 1955, and included a medical room, a gymnasium, three full-size pitches and an all-weather surface.Quelch (2015), p. 253 Brown helped to dig out the ground and \"volunteered\" several of his players to assist. During the following years, the club became renowned for its youth policy and scouting system, which yielded many young, talented footballers. Their scouts—including Jack Hixon—were particularly based in North East England, Scotland and Northern Ireland."]}]}}