{"wiki_id": "http://www.wikidata.org/entity/Q4799294", "itemLabel": "Arthur Joseph Davis", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Joseph_Davis", "wikipedia_page": {"main": "Arthur Joseph Davis  (21 May 1878, Kensington, London – 22 July 1951, Kensington, London) was an English architect.\nDavis studied at the École des Beaux-Arts, Paris in the 1890s. He was the co-partner in the firm Mewes & Davis, with Charles Mewès. The firm designed the elevations and interior decoration of the London Ritz Hotel which introduced modern French comfort and luxury enabled by an innovative steel frame construction. In addition, the partnership took on numerous private commissions including Luton Hoo for Sir Julius Wernher, Coombe Court for Countess De Grey and Polesden Lacey for the Hon Mrs Ronald Greville. Prior to World War I, Davis worked on a number of ocean liners such as the Aquitania (1911–14); and after his military service he designed a number of banks in London. His last major commission was the Queen Mary (1935).\nIn 1949 he gave his recreations as golf and water-colour sketching.", "link_mentions": [{"page": "Regent Street", "response": ["The architect Norman Shaw, then aged 73, was brought in to draw up proposals for the Circus and the Quadrant after early plans were considered unsatisfactory. His scheme was approved in principle but subject to indecision and dispute, both on property acquisition and retailers' demand for bigger display windows. Shaw's design for the Piccadilly Hotel was completed in 1908 with modifications, while the Quadrant was rebuilt by Blomfield, adapting Shaw's designs. The work started in 1923 and was completed by 1928. Significantly, no accommodation was built above any of the retail properties, contributing to the demise of the West End as a place of residence. A limited number of architects were responsible for the redesigned street, including Sir John James Burnet, Arthur Joseph Davis and Henry Tanner."]}, {"page": "1936 in architecture", "response": ["* May 27 –  begins her maiden Atlantic crossing. Interior design, under the direction of E. C. Leach, is by Arthur Joseph Davis and J. C. Whipp of Mewès & Davis (UK) and Benjamin Wistar Morris (USA) with much craftsmanship undertaken by the Bromsgrove Guild of Applied Arts."]}, {"page": "1878 in architecture", "response": ["* May 21 – Arthur Joseph Davis, English Beaux-Arts architect and interior designer (died 1951)"]}, {"page": "1951 in architecture", "response": ["* July 22 – Arthur Joseph Davis, English architect (born 1878)"]}, {"page": "RMS Aquitania", "response": ["Aquitania was launched on 21 April 1913 after being christened by Alice Stanley, the Countess of Derby, and fitted out over the next thirteen months. Notable installations were electrical wiring and decorations. The fitting out was led by Arthur Joseph Davis and his associate Charles Mewès. On 10 May 1914, she was tested in her sea trials and steamed at one full knot over the expected speed. On 14 May, she reached Mersey and stayed at a port there for fifteen days, during which she underwent a final major cleaning and finishing in preparation for her maiden voyage.", "Although Aquitania lacked the lean, yacht-like appearance of running mates Mauretania and Lusitania, the greater length and wider beam allowed for grander and more spacious public rooms. Her public spaces were designed by the British architect Arthur Joseph Davis of the interior decorating firm Mewès and Davis. This firm had overseen the construction and decoration of the Ritz Hotel in London and Davis himself had designed several banks in that city. His partner in the firm, Charles Mewès, had designed the interiors of the Paris Ritz, and had been commissioned by Albert Ballin, head of Germany's Hamburg America Line (HAPAG), to decorate the interiors of the company's new liner Amerika in 1905."]}, {"page": "Luton Hoo", "response": ["In 1903 the house was bought by Sir Julius Wernher, who had made his fortune from the diamond mines of South Africa. Wernher remodelled the interior to the designs of Charles Mewes and Arthur Joseph Davis, the architects of the Ritz Hotel in London. It was at this time that the mansard roof was added, to increase the amount of staff accommodation. This alteration, coupled with the newly installed casement windows was in the Second Empire style of architecture."]}, {"page": "1936 in art", "response": ["* May 27 –  begins her maiden Atlantic crossing. Interior design, under the direction of E. C. Leach, is by Arthur Joseph Davis and J. C. Whipp of Mewès & Davis (UK) and Benjamin Wistar Morris (USA) with much craftsmanship undertaken by the Bromsgrove Guild of Applied Arts. Graphic artists commissioned to supply work include Edward Wadsworth and Anna and Doris Zinkeisen."]}, {"page": "Arthur Davis", "response": ["* Arthur Joseph Davis (1878–1951), British architect"]}, {"page": "Charles Mewès", "response": ["Although Mewès only spoke French, he opened firms in both London and Cologne, Germany, with Arthur Joseph Davis, who had been his classmate at the École des Beaux-Arts, and with the Swiss Alphonse Bischoff. "]}, {"page": "Architecture of Liverpool", "response": ["An important example of industrial architecture of this era is the Mersey Match Factory (1919–21), Garston, it is the first example in the UK of flat slab concrete construction, by engineer Sven Bylander, architects Charles Mewès & Arthur Joseph Davis.Pevsner & Pollard (2006), p430 The Littlewoods Pools building 1938 probably designed by architect Gerald de Courcey Fraser is a striking art deco industrial building. The former Slaughterhouse, now Liverpool Meat and Fish Market (1929–31), Prescot Road, Tue Brook, was designed by the Corporation Surveyor Albert D. Jenkins.Pevsner & Pollard (2006), p482", "* Arthur Joseph Davis, joint architect of the Mersey Match Factory"]}, {"page": "Mandarin Oriental Hyde Park, London", "response": ["Between 1911 and 1912, the Ballroom was redecorated in a style of Louis XVI.  In 1925, the architects Charles Frédéric Mewès and Arthur Joseph Davis, who also remodeled some of the principal rooms in a traditional Louis XV style, added a Palm Court."]}, {"page": "List of Royal Academicians", "response": ["| Arthur Joseph Davis   ||align=\"center\" |  1942  || "]}, {"page": "St Sarkis, Kensington", "response": ["The construction of the church was funded by Calouste Gulbenkian, an Ottoman-born Armenian oil magnate. He agreed to finance it with the precondition to dedicate it to his parents, Sarkis and Takouhi. Besides being his father's name, Sarkis is also the name of one of Armenia's most celebrated saints—Saint Sarkis the Warrior. The church was designed by Arthur Joseph Davis and built by Holloway Brothers. Its construction began in February 1922 and it was consecrated on 11 January 1923. The church was expanded twice; first in 1937 a baptistery was added to the north side along with a new entrance, and, in 1950, a sacristy was added in the south-east side of the church.", "Category:Arthur Joseph Davis buildings"]}, {"page": "Henry Walter Barnett", "response": ["File:Arthur Joseph Davis.jpg|Arthur Joseph Davis"]}]}}