{"wiki_id": "http://www.wikidata.org/entity/Q4798680", "itemLabel": "Arthur Fell", "itemDescription": "English solicitor and Conservative Party politician (1850-1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Fell", "wikipedia_page": {"main": "Sir Arthur Fell (7 August 1850 – 29 December 1934) was an English solicitor and Conservative Party politician. After a notorious legal case in 1906 where a biased judge dismissed an election petition against him, Fell sat in the House of Commons from 1906 to 1922 for Great Yarmouth.  He was noted as an opponent of free trade and as a persistent advocate of a Channel Tunnel.", "link_mentions": [{"page": "Great Yarmouth (UK Parliament constituency)", "response": ["| (Sir) Arthur Fell", "*Unionist: Arthur Fell"]}, {"page": "Fellside, Gauteng", "response": ["Fellside lies on land that once made up the farm called Klipfontein, one of many large farms that make what is Johannesburg and its suburbs. The suburb was proclaimed in 1904. No houses were built before 1910 and the suburb's name possibly originates from the African City Properties Trust's founder, Sir Arthur Fell."]}, {"page": "1934 in New Zealand", "response": ["* 29 December – Sir Arthur Fell, politician (born 1850)"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Sir Arthur Fell"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Arthur Fell"]}, {"page": "Anthony Fell (politician)", "response": ["He was elected at the 1951 general election as Member of Parliament (MP) for Great Yarmouth, a seat which had been held at the start of the 20th century by his grandfather Sir Arthur Fell.  Yarmouth returned him to the Commons at three further elections.  At the 1966 general election, Labour's Hugh Gray won the seat, with a majority of 797."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Arthur Fell; MP for Great Yarmouth (1906–1922)"]}, {"page": "Martin White (politician)", "response": ["At the 1906 general election, he failed to be elected at Great Yarmouth. He lodged an election petition, attempting to have the result overturned due to alleged bribery, treating and illegal payments by his Conservative opponent Arthur Fell. The election court found that treating and bribery had indeed taken place, but the two judges sitting on the case did not agree whether Fell was responsible for the actions of a Mr Baker who was found to have had acted illegally. The first judge, Justice Channell, held that Baker was acting as an agent of Fell; but the more senior judge, Justice Grantham, held that Fell was not responsible, and the petition was therefore dismissed.  However, the outcome was widely denounced as perverse, and was one of a series of election petition judgments in which Grantham (himself a former Conservative MP) was seen to have acted in a partisan manner. The judgment in the Yarmouth petition was the subject of a debate in the Commons in July 1906 in which Grantham's partisanship was widely condemned."]}, {"page": "Sir Arthur Fell", "response": ["#REDIRECT Arthur Fell"]}, {"page": "Fell, Arthur", "response": ["#REDIRECT Arthur Fell"]}, {"page": "Charles Fell", "response": ["Fell was born in Nelson in 1844.Fell, Charles Yates, 'Whos Who in New Zealand and the Western Pacific 1908, Gary H Scholefield and E Schwabe (Editors), Gordon and Gotch Proprietary Limited (Publisher) He was the son of Alfred Fell, merchant and early settler, brother of the English politician Arthur Fell and grandson of Henry Seymour, after whom Seymour Square in Blenheim is named."]}, {"page": "Alfred Fell", "response": ["Fell was born at Nelson, New Zealand, on 17 January 1878, the son of Nelson mayor and painter, Charles Fell. He was educated at Nelson College (1887–1896),Nelson College Old Boys Register 1856–1924, edited W Devenish, Harry H Tombs Limited 1926, page 110 a school his grandfather, Alfred Fell, helped found in 1856. British politician, Sir Arthur Fell was his uncle."]}, {"page": "Fell (surname)", "response": ["*Arthur Fell (1850–1934), English solicitor and Conservative Party politician"]}, {"page": "Henry Seymour (New Zealand politician)", "response": ["Fanny Seymour and Alfred Fell married on 26 October 1843. Their first son, Charles Fell (1844–1918), was later Mayor of Nelson during the 1880s. Their third son, Alfred George Fell (1848–1917), was Mayor of Blenheim in the 1870s. Their fourth son, also called Arthur Fell (1850–1934), was an English solicitor and represented the Conservative Party in the Parliament of the United Kingdom. Their seventh and youngest son, Edward \"Nelson\" Fell (1857–1928), emigrated to the United States, where he founded two townships in Florida: Narcoossee and Fellsmere."]}, {"page": "1918 New Year Honours", "response": ["*Arthur Fell  MP for Great Yarmouth. Author of pamphlets on fiscal question. Chairman of House of Commons Channel Tunnel Committee."]}, {"page": "Alexander Wallace Rimington", "response": ["Ancestry.com. Dresden, Germany, Marriages, 1876–1922 [database on-line]. Provo, UT, USA: Ancestry.com Operations, Inc., 2015.Original data: 6.4.25 Eheaufgebote/Eheregister. Digital images. Stadtarchiv der Landeshauptstadt Dresden, Dresden, Germany.Alice Harÿ Ottilie von Rosenberg's sister Annie married Sir Arthur Fell. Following the death of Charlotte in 1913, Rimington remarried to fellow watercolourist, Evelyn Jane Whyley (1870–1958)."]}, {"page": "Thomas Armstrong (Oxford University cricketer)", "response": ["He passed the final law examination in 1875. He was in a partnership with Arthur Fell, as solicitors; it was dissolved in 1897. He died at Leigh Hall, East Grinstead in 1929."]}, {"page": "List of Knights Bachelor appointed in 1918", "response": ["|Arthur Fell, Esq., MP"]}]}}