{"wiki_id": "http://www.wikidata.org/entity/Q4799955", "itemLabel": "Arthur Pentelow", "itemDescription": "British actor (1924-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Pentelow", "wikipedia_page": {"main": "Arthur William Pentelow (14 February 1924 – 6 August 1991) was an English actor who was best known for playing Henry Wilks in Emmerdale Farm (later renamed Emmerdale), appearing from the first episode in 1972 until 1991.\n\n", "link_mentions": [{"page": "Wizzard", "response": ["Also in the line-up were saxophone players Mike Burney and Nick Pentelow (the son of actor Arthur Pentelow). Prior to the recording of the band's second album, Introducing Eddy and the Falcons, McDowell left and was not replaced (he returned to ELO), and during the recording of the album Bill Hunt also departed and was replaced by Bob Brady (also from Mongrel). Prior to the 1975 recording of the band's final album, Main Street (released 2000),  drummer Keith Smart departed the band and was not replaced."]}, {"page": "Theatre 625", "response": ["|Jeanne Moody,Ronald Hines,Sylvia Kay,Ronald Leigh-Hunt,Judi Dench,Arthur Pentelow,Fulton MacKay,Nicholas Pennell,Talfryn Thomas,Colin Jeavons,Tony Steedman", "|David Buck,Caroline Mortimer,Toke Townley,Joan Hickson,Arthur Pentelow,Thomas Baptiste,Sheila Grant,Frederick Piper,Winifred Dennis,John Herrington,Reg Lever"]}, {"page": "United!", "response": ["*Arthur Pentelow as Dan Davis (53 episodes, 1965–1966)"]}, {"page": "The First Churchills", "response": ["*Marquess of Carmarthen: Arthur Pentelow"]}, {"page": "Seth Armstrong", "response": ["An amusing postscript occurred in 1991, when Alan Turner and Henry Wilks (Arthur Pentelow) read Amos Brearly's (Ronald Magill) diaries and discovered that Seth was, in fact, an illegitimate descendant of the Verney family. However, any possible claims to ownership of Home Farm was obscured by NY's purchase and subsequent sale to Frank Tate (Norman Bowler)."]}, {"page": "Annie Sugden", "response": ["Commenting on her character in 1985, Mercier said: \"Annie Sugden has changed a great deal over the years. At the beginning she was very terse. She was the head of the family and let everyone know it. She ruled with a rod of iron. She'd had a tough life. She'd had a rough ride with her husband Jacob, who used to drink the money away and sit in the Woolpack until all hours. Her son Jack didn't live at home then and it was Annie who kept the farm together. Until Henry Wilks (Arthur Pentelow) came along they were poor farmers, living hand-to-mouth. But now things are different. Jack has made a success of Emmerdale and Henry's interest in the farm and Annie herself has made her relax. She's mellower now.\""]}, {"page": "Amos Brearly", "response": ["Amos Brearly is a fictional character from the British television soap opera Emmerdale, played by Ronald Magill. He made his first appearance during the serial's debut episode on 16 October 1972. Amos ran The Woolpack pub and was the village gossip. A double act was later formed between Amos and Henry Wilks (Arthur Pentelow), which lasted for 19 years. Amos became known for this bushy sideburns and catchphrase \"Nay, Mr Wilks\". Magill left the show in January 1991, but reprised the role for several brief appearances until July 1995.", "Amos is one of Emmerdale's original characters conceived by creator Kevin Laffan. He was known for his bushy sideburns, which were the result of Magill having rushed to the audition from playing an Edwardian character in a stage play. He thought he would be asked to shave the sideburns if he secured the part, but the producer told him they were ideal for the part and to keep them. At the beginning of the serial, Amos is the landlord of The Woolpack pub. Anthony Hayward described him as having a \"dour manner and pernickety ways.\" Magill saw himself in his character, although he admitted that he was more of \"a city slicker\". He also said Amos was the village gossip and a loner. This changed with the introduction of Henry Wilks (Arthur Pentelow), who formed a comic double act with Amos for 19 years. Magill explained: ", ":\"I saw him as a man who found it difficult to make friends, yet, once he was behind the bar and lord of all he surveyed, he was able to relate to people. But he had the bar between them, of course. Originally, Henry Wilks had nothing to do with the pub, but Kevin Laffan, the creator, spotted a rapport between me and Arthur Pentelow and came up with the idea of moving Henry into the Woolpack. Henry was originally to have been the villain of the piece and Amos was to find a wife and get married. Arthur and I had so much in common. We both loved doing The Times crossword every day – which is a great bond – both smoked a pipe and both liked good food and a bottle of wine.\""]}, {"page": "Sarah Sugden", "response": ["In September 1988, Jack leaves for Italy to see old flame Marian Wilks (Debbi Blythe) leaving Sarah unaware of where they stand. Jack returns in August after Jackie is killed in a gun accident and stays for his funeral before leaving again but makes a permanent return in November which a nosey Amos Brearly (Ronald Magill) makes sure Sarah is aware of. Jack declares his relationship with Marian is over and it is Sarah he wants. In 1990, Sarah agrees to move in with Jack in the farm but keeps the connecting door nailed shut to stop his mother Annie Sugden's (Sheila Mercier) habit of wandering in declaring she was used to living alone. Sarah refuses to help out on the farm at first but later agrees when the Sugdens find themselves shorthanded. The mobile library closes in June 1990 so Jack gets Sarah a job as barmaid in the woolpack working for Amos and Henry Wilks (Arthur Pentelow). who are impressed with her work ethic."]}, {"page": "Henry Wilks", "response": ["Henry Wilks is a fictional character from the British television soap opera Emmerdale, played by Arthur Pentelow. He ran the Woolpack public house alongside Amos Brearly (Ronald Magill) for nearly 20 years.", "Henry is one of the eight original main characters conceived by the creator of Emmerdale, Kevin Laffan.Hayward 1997, pp.9–11. The serial centred around the Sugdens, a farming family who owned Emmerdale Farm on the outskirts of Beckindale village. Laffan explained that he was interested by the notion that farming was \"a way of life\" and not just a way to earn a living, as well as \"the mental attitude\" that set them apart. This is why he introduced Henry, \"an industrialist from the outside world\" who comes into the farming community. After the show's story was mapped out, Laffan joined casting director Sue Whatmough, producer David Goddard, and director Tristan de Vere Cole for the casting process and interviews were carried out in May 1972 at Yorkshire Television's London offices. Laffan recalled that they wanted to cast actors that would gel well together, and Arthur Pentelow was \"an immediate choice\" for the role of Henry. Gail Harrison was cast as Henry's daughter Marian Wilks. Henry was introduced in the show's debut episode, broadcast on 16 October 1972.Hayward 1997, pp.20–21."]}, {"page": "The Gladiators (film)", "response": ["* Arthur Pentelow as British General"]}, {"page": "Charlie Bubbles", "response": ["* Arthur Pentelow as Man with Car"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Arthur Pentelow"]}, {"page": "Big Breadwinner Hog", "response": ["* Walker            –          Arthur Pentelow"]}, {"page": "Privilege (film)", "response": ["* Arthur Pentelow as Leo Stanley"]}, {"page": "List of science fiction films of the 1960s", "response": ["|The Gladiators||Peter Watkins||Arthur Pentelow, Frederick Danner, Hans Bendrik||Sweden||"]}, {"page": "List of former Emmerdale characters", "response": ["|Henry Wilks || Arthur Pentelow || 1972–1991"]}, {"page": "List of former Coronation Street characters", "response": ["|George Greenwood || Arthur Pentelow || 1968, 1971"]}, {"page": "List of longest-serving soap opera actors", "response": ["|Arthur Pentelow || Henry Wilks || Emmerdale || 1972–1991 ||  years ||"]}, {"page": "List of Emmerdale Farm characters (1972–1973)", "response": ["Marian Rosetti (also Wilks) was first played by Gail Harrison from 1972 to 1978, then by Debbie Blythe for two stints in 1987 and 1988. She first appeared on the show's first ever episode and was the first character to be seen on screen, riding on horseback. She was the daughter of wealthy retired factory owner Henry Wilks (Arthur Pentelow) who later ran the Woolpack with long standing landlord Amos Brearly (Ronald Magill). Marian embarked on a brief affair with Jack Sugden (Andrew Burt) in the first few months of the show."]}, {"page": "1991 in British television", "response": ["*5 September – The actor Arthur Pentelow, who died on 6 August, makes his final on screen appearance as Henry Wilks in Emmerdale. The character dies off screen on 3 October.", "|Arthur Pentelow"]}, {"page": "Hadleigh (TV series)", "response": ["| Arthur Pentelow, Sheila Fearn, Michael Brennan, Arnold Peters, Caroline Dowdeswell"]}, {"page": "Trojan Horse (The Avengers)", "response": ["* Arthur Pentelow as George Meadows "]}, {"page": "List of television performers who died during production", "response": ["| Arthur Pentelow"]}, {"page": "Pentelow", "response": ["* Arthur Pentelow (1924–1991), English actor"]}]}}