{"wiki_id": "http://www.wikidata.org/entity/Q4799811", "itemLabel": "Arthur Napier", "itemDescription": "British linguist", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Napier", "wikipedia_page": {"main": "Arthur Sampson Napier  (1853–1916) was a British philologist. He was Merton Professor of English Language and Literature, University of Oxford, from 1885 and also Rawlinsonian Professor of Anglo-Saxon since 1903. Napier was appointed a fellow of Merton College, Oxford, in 1885 and of the British Academy in 1904.Born in Wilmslow on 30 August 1853, Napier studied at Owens College, Exeter College, Oxford, and the University of Göttingen.Napier was also an avid collector of the Oxford college stamp issues and gave talks and displays on this subject. He also wrote many articles for Gibbons Stamp Monthly on the college stamp issues. He was Vice President of the Oxford Philatelic Society from 1892 onwards.Napier died on 10 May 1916.", "link_mentions": [{"page": "1885 in literature", "response": ["**Arthur Napier is appointed first Merton Professor of English Language and Literature in the University of Oxford."]}, {"page": "Roger Sherman Loomis", "response": ["He earned a Bachelor of Arts degree from Williams College in 1909, a Master of Arts degree from Harvard University in 1910, and, as a Rhodes Scholar, a Bachelor of Letters (BLitt) degree at New College, Oxford, in 1913. His BLitt dissertation, written under the supervision of Arthur Napier and C. F. Bell, was titled Illustrations of the Romances in Mediæval English Art. He held honorary degrees from Columbia, Williams, the University of Wales, and the University of Rennes in France."]}, {"page": "Franks Casket", "response": ["Although the Sigurd-Grani thesis remains the most widely accepted interpretation of the right panel, Arthur Napier remarked already in 1901, \"I remain entirely unconvinced by the reasons [Wadstein] puts forward, and believe that the true explanation of the picture has still to be found.\"Napier (1901: 379 n.2).  Napier (p. 364) reports that Dr. Söderberg of Lund had anticipated Wadstein's proposal already in the Academy, referring to a brief mention in the Notes and News section of The Academy, A Weekly Review of Literature, Science and Art, August 2nd 1890, p.90, col.1."]}, {"page": "Rawlinson and Bosworth Professor of Anglo-Saxon", "response": ["* 1903–16 Arthur Napier (1853–1916)"]}, {"page": "Arthur Sampson Napier", "response": ["#REDIRECTArthur Napier"]}, {"page": "Arthur S. Napier", "response": ["#REDIRECTArthur Napier"]}, {"page": "The Old English Boethius", "response": ["* The Napier Fragment (known as MS N), apparently from the first half of the tenth century. This was a fragment of a single leaf of the text, edited by Arthur Napier in 1886. The fragment was lost soon after, however, and has not since been found."]}, {"page": "William Cash (accountant)", "response": ["He was a lay reader in the Diocese of London and bursar to the Oxford and Bermondsey Mission (1914–19). He married, in 1932, Hilda Mary Napier, who died in 1962; she was the daughter of the Oxford Professor Arthur Napier."]}, {"page": "A. S. Napier", "response": ["#REDIRECT Arthur Napier"]}, {"page": "Kenneth Sisam", "response": ["With a Rhodes scholarship, Sisam matriculated at Merton College, Oxford, in 1910. He completed a B.Litt. there under Arthur Napier in 1915, producing an edition of the Salisbury Psalter. He married that year. In this period he taught students including J. R. R. Tolkien.John Garth, Tolkien and the Great War: The Threshold of Middle-earth (Boston: Houghton Mifflin, 2003), p. 34. Poor health ruled out military service, and he went to work part-time on the Oxford English Dictionary. In 1916 he published on the Beowulf manuscript."]}]}}