{"wiki_id": "http://www.wikidata.org/entity/Q4798571", "itemLabel": "Arthur Edward Hardinge", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Edward_Hardinge", "wikipedia_page": {"main": "General Sir Arthur Edward Hardinge  (2 March 1828 – 15 July 1892) was Governor of Gibraltar.", "link_mentions": [{"page": "Coldstream Guards", "response": ["* General Sir Arthur Edward Hardinge, 1890–1892"]}, {"page": "Hannah Primrose, Countess of Rosebery", "response": ["As early as 1876, there were rumours of an engagement.Crewe, Vol 1, p. 119. However, several hurdles had to be overcome before a marriage could take place. While the Jewish Rothschilds were accepted into society, and indeed were close friends of some members of the royal family including the Prince of Wales, as elsewhere in Europe, antisemitic feelings were prevalent in the upper echelons of society; particularly so among those closest to the Queen at court, where following the death of the Prince Consort in 1861 the Rothschilds became pointedly excluded.Ferguson, p. 772. The Queen's equerry Arthur Edward Hardinge referred to the Rothschilds' dining tables as \"resplendent with the Hebrew gold\" going so far as to say a visiting Russian royal needed a \"corrective\" visit to Westminster Abbey following acceptance of Rothschild hospitality. Queen Victoria herself expressed antisemitic views in 1873 when it was proposed that Lionel de Rothschild be elevated to the peerage; the Queen refused, and expressed a reluctance to make a Jew a peer, saying that \"to make a Jew a peer is a step she could not consent to\" and furthermore stating that to give \"a title and mark of her approbation to a Jew\" was something she would not do.Two quotes by Queen Victoria from Ferguson, p. 773. Queen Victoria was eventually persuaded to elevate Hannah de Rothschild's cousin Nathaniel de Rothschild to the peerage in 1884. The present Lord Rothschild is his great-grandson. However, he was not the first Jew to be so honoured, as in 1876 the Queen had elevated her favourite Disraeli to an earldom. Ferguson p774 suggests that although the Queen admitted to an aversion \"to making a person of the Jewish religion a peer\" her true reasons were as much social and political as religious Lord Spencer advised the Prince and Princess of Wales against attending a Rothschild ball with the words \"The Prince ought only to visit those of undoubted position in Society.\" However, this did not prevent the Prince from accepting Rothschild's invitations and gifts privately. While one could be friends with Jews and accept their hospitality, their social status was still not sufficiently elevated to include marriage into the peerage without unfavourable comment.McKinstry, p74 states:\"Anti-Semitism was a powerful force in late Victorian England\".Henry Labouchère used his magazine Truth as an organ to attack all Jews when writing of the Rosebery's wedding."]}, {"page": "Hardinge", "response": ["*Sir Arthur Edward Hardinge (1828–1892), British Army general, Governor of Gibraltar"]}, {"page": "Royal Inniskilling Fusiliers", "response": ["*1881–1886: (2nd Battalion) Gen. Hon. Sir Arthur Edward Hardinge, KCB, CIE "]}, {"page": "Fordcombe", "response": ["* Sir Arthur Edward Hardinge (1828–1892), British Army general, Governor of Gibraltar"]}, {"page": "Ivone Kirkpatrick", "response": ["Kirkpatrick was born on 3 February 1897 in Wellington, India, the elder son of Colonel Ivone Kirkpatrick (1860–1936) of the South Staffordshire Regiment, and his wife, Mary Hardinge (d. 1931), daughter of General Sir Arthur Edward Hardinge, later Commander-in-Chief, Bombay Army, and Governor of Gibraltar."]}]}}