{"wiki_id": "http://www.wikidata.org/entity/Q4799494", "itemLabel": "Arthur Leonard Bateman", "itemDescription": "British politician (1879-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Bateman_(politician)", "wikipedia_page": {"main": "Arthur Leonard Bateman (22 August 1879 – 8 May 1957) was a British businessman and Conservative Party politician.Born in London, he was privately educated before entering business as a sack manufacturer. He was a member of the Worshipful Company of Basketmakers and a Freeman of the City of London. He became involved in local politics as a member of the Conservative-backed Municipal Reform Party. He was elected to Camberwell Borough Council in 1922 and was the mayor of Camberwell in 1929–1930. In 1931 he was elected to represent Peckham on the London County Council.At the 1931 general election he was chosen to contest the seat of Camberwell North on behalf of the Conservatives. The election had been called following the formation of a National Government. This had caused a split in the Labour Party with the majority opposing the coalition. Among these were Charles Ammon, sitting MP for Camberwell North. Bateman was the government candidate, with the Liberal Party stepping aside from the contest. Bateman was elected, overturning a Labour majority of 7,823 to win by 765 votes.Bateman proved to be a controversial member of parliament. In April 1932 the North Camberwell Liberal and Radical Association organised protests calling for his resignation. The Liberals claimed he had broken his election pledges and voted to support taxes on food. Bateman countered that his loyalty was not to the voters but to the National Government and that he would not resign. By the time the next election was called in 1935 Bateman had made it clear that he no longer wished to represent North Camberwell as the constituency had shown him \"no gratitude\". He stated that in.. \"some parts of North Camberwell I have had to have as many as fifty policemen to get me out of meetings. I will not risk my life any longer.\" He initially hoped that the Conservative Party would find another constituency for him to contest. When this did not occur he decided to stand as an independent in the neighbouring seat of Peckham, although he withdrew his candidacy prior to the election.In 1942 Bateman moved to Warwick, where he was to be a member of the borough council. By the time of the 1945 general election he had healed his rift with the Conservatives and contested Tottenham South, but failed to be elected.Apart from his political and business activities, Bateman was the founder of a charity, the Camberwell Children's Christmas Treat and Summer Holiday Camp Fund. As part of fundraising activities for the organisation he paraded along Bond Street dressed in a coronet.He died at his home in Warwick in May 1957 aged 77.", "link_mentions": {}}}