{"wiki_id": "http://www.wikidata.org/entity/Q4799502", "itemLabel": "Arthur Letts", "itemDescription": "American businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Letts", "wikipedia_page": {"main": "Arthur Letts Sr. (June 17, 1862 – May 18, 1923) was an immigrant from England who made his fortune in Los Angeles, California, in the early years of the 20th century. He built his wealth by transforming a small, bankrupt dry goods store in Downtown Los Angeles into the prominent The Broadway department store, later adding the Bullock's store.", "link_mentions": [{"page": "Playboy Mansion", "response": ["The  house is described as in the \"Gothic-Tudor\" style by Forbes magazine, and sits on . It was designed by Arthur R. Kelly in 1927 for Arthur Letts Jr., son of the Broadway department store founder Arthur Letts and acquired by Playboy in 1971 for $1.1 million, from Louis D. Statham (1908–1983), an engineer, inventor and chess aficionado.Playboy Enterprises Annual Report . Accessed July 9, 2014. In early 2011, it was valued at $54 million. It sits close to the northwestern corner of the Los Angeles Country Club, near University of California, Los Angeles, and the Bel-Air Country Club. $15 million has been invested in renovation and expansion."]}, {"page": "Westwood, Los Angeles", "response": ["Westwood was developed on the lands of the historic Wolfskill Ranch, a  parcel that Arthur Letts, the successful founder of the Broadway, and Bullock's department stores, purchased in 1919. Upon Arthur Lett's death, his son-in-law, Harold Janss, vice president of Janss Investment Company, inherited the land. He began to develop the area and started to advertise for new homes in 1922."]}, {"page": "Letts", "response": ["*Arthur Letts, English-born millionaire developer of Holmby Hills, Los Angeles, California"]}, {"page": "Nichols Canyon, Los Angeles", "response": ["A Boy Scout camp was operating in the canyon as early as 1918, the year that Arthur Letts bought property for a permanent camp at a cost of $6,000.\"Acreage Sales,\" Los Angeles Times, September 30, 1917, image 76\"Would Honor President,\" Los Angeles Times, November 9, 1918, image 116"]}, {"page": "Bullock's", "response": ["Bullock's was founded in 1907 at Seventh and Broadway in downtown Los Angeles by John G. Bullock, with the support of The Broadway Department Store owner Arthur Letts. In 1923, Bullock and business partner P.G. Winnett bought out Letts' interest after his death and the companies became completely separated. In 1929 Bullock & Winnett opened a luxury branch on Wilshire Boulevard, referred to at the time as Bullock's Wilshire (the apostrophe would later be removed)."]}, {"page": "The Broadway", "response": ["The Broadway was a mid-level department store chain headquartered in Los Angeles, California. Founded in 1896 by English-born Arthur Letts, Sr., and named after what was once the city's main shopping street, the Broadway became a dominant retailer in Southern California and the Southwest. Its fortunes eventually declined, and Federated Department Stores (now Macy's, Inc.) bought the chain in 1995. In 1996, Broadway stores were either closed or converted into Macy's and Bloomingdales.", "In 1895, J. A. Williams formed J. A. Williams & Co., built and opened his Broadway Department Store on August 29, 1895. In February, 1896 the store was liquidated, and Arthur Letts bought the name, assets, fixtures, and the building lease for $8377 and, on February 24, 1896, the Broadway started operating under Letts. The previous owners had a good location in a recently constructed building at the southwest corner of Broadway and Fourth Streets, but had all of its assets seized by their creditors for failure to pay its bills after just four short months of operations. In contrast, Letts was able to pay off all of his creditors in a short period of time after acquiring the assets for the failed store by the quick sale of the same assets and by watching his expenses.", "The nine stories Beaux Arts building with its restrained Italian Renaissance Revival ornamentation at the southwest corner of Broadway and Fourth was designed by architects John Parkinson and Edwin Bergstrom to serve as the headquarters and the flagship store for Arthur Letts' Broadway Department store chain with the first phase of construction completed in 1913. Construction, which included demolition of the previous store and expansion to the rest of the block when additional property were acquired, continued on several different stages until 1924. The Broadway occupied this location from 1913 to 1973."]}, {"page": "Los Angeles Country Club", "response": ["* Arthur Letts, department store founderMcGroarty, John Steven. Los Angeles from the Mountains to the Sea, American Historical Society, 1921"]}, {"page": "Holmby Hills, Los Angeles", "response": ["The development of Holmby Hills began when Arthur Letts Sr., purchased  of the original Wolfskill ranch at $100 an acre. He called the development \"Holmby Hills,\" which was loosely derived from the name of his birthplace, a small hamlet in England called Holdenby, and it was also the name of his estate in Hollywood. Letts died suddenly in 1923, before he could realize his vision. His son-in-law, Harold Janss, took over the project. Zoning for the community, which straddles Sunset Boulevard, was designed to accommodate lot sizes up to . The streets were named after places in Great Britain: Devon Avenue after Devon, the county in southwestern England; Charing Cross Road after Charing Cross junction in London; Conway Avenue after Conwy in Wales, etc. In the 1920s, English-style streetlamps were added specifically for the neighborhood. After the Wall Street Crash of 1929, grand mansions were constructed.", "*The son of Arthur Letts (1862–1923) lived in a mansion designed by architect Arthur Rolland Kelly located at 10236 Charing Cross Road.Beale, Lauren (March 27, 2010). Streets of gold: L.A.'s most desirable addresses, Los Angeles Times. The residence became known as the Playboy Mansion when Hugh Hefner purchased it."]}, {"page": "List of people from Los Feliz, Los Angeles", "response": ["* Arthur Letts"]}, {"page": "Rancho San Jose de Buenos Ayres", "response": ["Rancho San Jose de Buenos Ayres was sold to John Wolfskill in 1884. Wolfskill secured a judgment against the Los Angeles and Santa Monica Land and Water Company and the Los Angeles and Pacific Railroad. The railroad had a \"right of way\" through Rancho San Jose de Buenos Ayres that was thirty feet wide and had set up eight hundred lots for the town of Sunset. In February, 1891, Wolfskill was awarded $293,000 due to him for the railroads confiscation of the ranch. The ranch was returned to Wolfskill, but it wasn't worked or utilized for agriculture. When Wolfskill died, the land was left to his heirs.  Abstract of Title, Rancho San Jose de Buenos Ayres In 1919 the Wolfskill heirs sold the Rancho to Arthur Letts, the founder of the Broadway Department Store chain."]}, {"page": "Janss Investment Company", "response": ["In 1911 Harold Janss married Arthur Letts's daughter Gladys. In 1923 after Arthur Letts, Sr., died, they took control of the  William Wolfskill ranch on Rancho San Jose de Buenos Ayres. In a deal to get the University of California, Los Angeles, in 1925 Janss Investment Company sold  to the cities of Los Angeles, Santa Monica and Beverly Hills at the bargain price of $1.2 million — about a quarter of its value. The cities, whose voters had passed bond issues to pay for the site, turned around and donated it to the state.University of California History - Los Angeles: Historical Overview The UCLA campus's \"Janss Steps\" are named for the two brothers. While the UCLA campus was being built, Janss Investment Company went to work developing the Westwood Village commercial area and surrounding residential neighborhoods.Tom Sitton, William Francis Deverell, 2001, Metropolis in the making: Los Angeles in the 1920s, University of California Press, Richard W. Longstreth, 1998,City Center to Regional Mall:Architecture, the Automobile, and Retailing in Los Angeles, 1920-1950, MIT Press,  Due to racial covenants included in the deeds of the buildings in Westwood Village, people of color were barred from patronizing businesses in the area.Janss Investment Co. v. Walden "]}, {"page": "Roland Coate", "response": ["Together with Reginald Davis Johnson (1882-1952) and Gordon Kaufmann (1888–1949), Coate designed the All Saints Episcopal Church in Pasadena, California in 1923, listed on the National Register of Historic Places.Pacific Coast Architecture Database: All Saints' Episcopal Church, Pasadena, CA'All Saints' church in Pasadena to have new home', The Los Angeles Times, 5, 06/10/1923'All Saints' Church, Pasadena', Architectural Digest, 8: 2, 69, 1931 In 1924, they designed Camp Arthur Letts, named after Arthur Letts, of the Boy Scouts of America in the Hollywood Hills.Pacific Coast Architecture Database: Camp Arthur Letts, Boy Scouts of America, Hollywood Hills, CA The same year, they designed the Hale Solar Laboratory and the Griffith House (at 1275 Hillcrest Avenue) in Pasadena.Pacific Coast Architecture Database: Hale Solar Laboratory, Pasadena, CAPacific Coast Architecture Database: Griffith House In 1924-1925, they designed a new building for Saint Paul's Episcopal Cathedral located at 615 South Figueroa Street; it was demolished in the 1970s.Pacific Coast Architecture Database: Saint Paul's Episcopal Cathedral He also designed the private residence of H.C. Lippiatt & M.P. Taylor in Bel Air, Los Angeles.Pacific Coast Architecture Database: C. Lippiatt & M.P. Taylor House, Bel Air, Los Angeles, CA"]}, {"page": "James Boon Lankershim", "response": ["Lankershim married Carolina \"Carrie\" Adelaide Jones in 1881. By 1900, they separated and she moved to Paris, only to return briefly during the First World War. They had two children, Jack Lankershim and Doria Lankershim. In the 1920s, he retired and moved to the Biltmore Hotel in downtown Los Angeles. On April 2, 1921, he donated  20 acres of the San Fernando Valley to the Boys Scouts of America, later known as the Arthur Letts Boy Scout Camp after Arthur Letts (1862–1923). In 1940, they built an obelisk in his honor on the donated land."]}, {"page": "Owlwood Estate", "response": ["The first owners were businessman Charles H. Quinn (1876–1975) and his wife, Florence Letts Quinn (1868–1944), the widow of Arthur Letts (1862–1923), the original developer of Holmby Hills. Arthur Letts chose 141 South Carolwood Drive from all the development's acreage for his family's estate. However, he died before building commenced, and his widow inherited the property, a 3.7-acre lot at the end of a cul-de-sac bordering the Los Angeles Country Club. It was the only property excluded from the original Holmby Hills offerings.FindAGrave: Florence Martha (Letts) Quinn Florence Letts selected prominent architect Robert D. Farquhar to design and build the estate, and was responsible for the European influences seen in the selections and finishes."]}, {"page": "Joseph Francis Sartori", "response": ["Sartori was key to the development of the Millennium Biltmore Hotel.  In April 1921, Sartori called a meeting of forty prominent business and financial leaders to develop a great hotel for the great city of Los Angeles. This included Harry Chandler, Arthur Letts, Cecil B. De Mille, Henry M. Robinson, Moses Sherman, Marco Hellman, Ben R. Meyer, Andrew M. Chaffey, Charles H. Toll, and George I. Cochran.  Their major objective was to see that Los Angeles was on the cutting edge of the American Experience.  The group voted to acquire land at the southwest corner of Fifth and Olive Streets, which would be near the railway terminals and on main traffic avenues.  They agreed that none of group should profit from the transaction. On October 6, they formed the Central Investment Corporation, and elected financier Lee A. Phillips as president."]}, {"page": "Arthur Letts Sr.", "response": ["#REDIRECT Arthur Letts"]}, {"page": "Arthur Letts, Sr.", "response": ["#REDIRECT Arthur Letts"]}, {"page": "History of Los Angeles Metro Rail and Busway", "response": ["The northern tunnel was built and opened in 1925 as the Belmont Tunnel, better known as the \"Hollywood Subway\", through which the Glendale–Burbank, Hollywood and Valley Red Car lines ran until closing in the 1950s. The Subway Terminal Building was built as its downtown terminus, and envisioned as the hub of a much more extensive subway system. The western tunnel or \"Vineyard Subway\" was never built, but in 1917, Arthur Letts and other business leaders formed a \"Subway Rapid Transit Association\" and spent $3.5 million ($ in  adjusted for inflation) to buy a partial right-of-way for one through the Wilshire Center area. None of the other subway tunnels ever came to fruition."]}, {"page": "Walker Scott", "response": ["Trained under Arthur Letts at Los Angeles' Broadway department store,\"$20,000,000 Invested Here in the Dry Goods Business\", Los Angeles Herald, vol. XXXVIII, no. 220, June 8, 1912 Ralf Marc Walker was the co-founder/co-worker owner of the 125,000-square-foot department store known as the Fifth Street Store at Fifth and Broadway in downtown Los Angeles, established in 1905. Walker also owned what would later become known as the Houdini Mansion in Laurel Canyon. He died six months before the opening of the San Diego store on October 3, 1935. "]}, {"page": "Ralf Marc Walker", "response": ["In his native Bellevue, Michigan, Walker worked in a grocery store for a certain Mr. C. D. Kimberley. He would later spend time in Wisconsin and DetroitObituary, Grand Rapids Press, 2 September 1935 before heading to Los Angeles where Arthur Letts trained him at Letts' Broadway department store,\"$20,000,000 Invested Here in the Dry Goods Business\", Los Angeles Herald, vol. XXXVIII, no. 220, 8 June 1912 Walker was the co-founder/co-worker owner of the 125,000-square-foot department store known as the Fifth Street Store at Fifth and Broadway in downtown Los Angeles, established in 1905. Walker also owned what would later become known as the Houdini Mansion in Laurel Canyon. He died six months before the opening in San Diego of the first Walker Scott store – which would go on to become a regional chain – on October 3, 1935."]}]}}