{"wiki_id": "http://www.wikidata.org/entity/Q4797837", "itemLabel": "Arthur Armstrong", "itemDescription": "artist born in Northern Ireland, 1924-1996", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Armstrong_(painter)", "wikipedia_page": {"main": "Arthur Armstrong (12 January 1924 – 1996) was a painter from Carrickfergus, County Antrim, Northern Ireland, who often worked in a Cubist style and produced landscape and still-life works.\nArmstrong was born in Carrickfergus on 12 January 1924. He was the son of a house painter and attended Strandtown Primary School. Later he studied architecture at Queen's University Belfast, but after two years he moved to study art at Belfast College of Art. The influence of Cubism and the School of Paris can be clearly seen in his work, which took him to England, France and Spain. He also travelled and painted in the West of Ireland and Connemara inspired some of his best work. In 1950 his work was exhibited in the Grafton Gallery in Dublin, and subsequent exhibitions took place in England, Spain and the United States, as well as in Belfast and Dublin. In 1957 he was awarded a travelling scholarship from the Council for the Encouragement of Music and the Arts (a forerunner of the Arts Council of Great Britain) and went to Spain. He eventually settled in Dublin in 1962 and began showing work at the Royal Hibernian Academy.In 1968 he was awarded the Douglas Hyde Gold Medal at the Oireachtas Exhibition. In 1969 he designed sets (with George Campbell and Gerard Dillon) for the Seán O'Casey play, Juno and the Paycock, at the Abbey Theatre in Dublin. He became a member of the Royal Hibernian Academy in 1972 and in 1973 he was awarded the Art in Context prize from the Arts Council of Northern Ireland. He became a member of Aosdána in 1981, the same year that a retrospective exhibition of his work from 1950 to 1980 was held by the Arts Council of Northern Ireland.Armstrong died in 1996.", "link_mentions": [{"page": "List of artists from Northern Ireland", "response": ["*Arthur Armstrong (1924–1996)"]}, {"page": "1996 in Northern Ireland", "response": ["*Arthur Armstrong, painter (born 1924)."]}, {"page": "1924 in Northern Ireland", "response": ["*12 January – Arthur Armstrong, painter (died 1996)."]}, {"page": "Arthur Armstrong", "response": ["Arthur Armstrong may refer to:", "*Arthur Armstrong (painter) (1924–1996), painter from Northern Ireland"]}, {"page": "List of Ulster University people", "response": ["*Arthur Armstrong (1924–1996), painter who worked in a Cubist style*"]}, {"page": "Deaths in 1996", "response": ["*Arthur Armstrong, Irish painter (b. 1924)"]}, {"page": "List of members of Aosdána", "response": ["|\tArthur Armstrong"]}]}}