{"wiki_id": "http://www.wikidata.org/entity/Q4797859", "itemLabel": "Arthur Atkins", "itemDescription": "British footballer (1925-1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Atkins_(footballer)", "wikipedia_page": {"main": "Arthur Walter Atkins (21 February 1925 – 7 January 1988) was an English professional footballer who played as a centre half. Born in Tokyo, his parents having business in Japan, he was educated in Erdington, Birmingham, where he was spotted by Second Division club Birmingham City. He played more than 100 games for the club in all competitions, and played a big part in the club reaching the 1950–51 FA Cup semifinal. He later played for Shrewsbury Town. He died in Sutton Coldfield, Warwickshire aged 62.", "link_mentions": [{"page": "Arthur Atkins", "response": ["Arthur Atkins may refer to:", "*Arthur Atkins (painter) (1873–1899), tonalist landscape painter", "*Arthur Atkins (footballer) (1925–1988), English footballer "]}, {"page": "1987–88 in English football", "response": ["* 7 January 1988: Arthur Atkins, 62, played 97 league games for Birmingham City between 1948 and 1954 before completing his career with 16 games in two seasons at Shrewsbury Town."]}, {"page": "1950–51 Birmingham City F.C. season", "response": ["Twenty-two players made at least one appearance in nationally organised competitive football during the season, and there were thirteen different goalscorers. Goalkeeper Gil Merrick, full-back Arthur Atkins and winger Johnny Berry were ever-present in the 48-game season, and Cyril Trigg was the leading goalscorer with 19 goals, of which 17 came in league matches.", "Blackpool were the class team, but \"Birmingham, with their fiery, quick tackling, their spirit and the snapping up of stray chances, have swept class aside before now.\" Though failing to sweep Blackpool aside, they did stop them scoring, combatting the attacking threat by switching the pacy Jack Badham to the left to man-mark Matthews and using the other defenders, among whom Arthur Atkins stood out, to cut out his crosses. With two minutes left, Jackie Stewart's \"terrific left-foot shot struck a post, then passed out, with thousands of horrified Blackpool supporters on the verge of doing likewise.\""]}]}}