{"wiki_id": "http://www.wikidata.org/entity/Q4799482", "itemLabel": "Arthur Legge", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Legge_(British_Army_officer)", "wikipedia_page": {"main": "General The Honourable Arthur Charles Legge DL (25 July 1800 – 18 May 1890), was a British soldier and politician.\nLegge was the fourth son and tenth child of George Legge, 3rd Earl of Dartmouth, by Lady Frances, daughter of Heneage Finch, 3rd Earl of Aylesford. He was the younger brother of William Legge, 4th Earl of Dartmouth and the Honourable Heneage Legge.Legge was a General in the British Army. He succeeded his elder brother Heneage Legge as Member of Parliament for Banbury in 1826, a seat he held until 1830. He was also a Deputy Lieutenant of Kent. On 8 May 1868, he was appointed honorary colonel of the 3rd Administrative Battalion of Staffordshire Rifle Volunteers.Legge was twice married. He married firstly the Honourable Anne Frederica, daughter of John Holroyd, 1st Earl of Sheffield, in 1827. She died in August 1829. He married secondly Caroline, daughter of  James Charles P. Bouwens, in 1837. They had at least two children. Caroline died in March 1887. Legge remained a widower until his death in May 1890, aged 89.", "link_mentions": [{"page": "Earl of Dartmouth", "response": ["Several other members of the Legge family have also gained distinction. The Hon. Henry Bilson-Legge, fourth son of the first Earl, was a politician and served three times as Chancellor of the Exchequer. Sir Arthur Kaye Legge, sixth son of the second Earl, was an admiral in the Royal Navy. The Hon. Edward Legge, seventh son of the second Earl, was Bishop of Oxford. The Hon. Heneage Legge, second son of the third Earl, sat as Member of Parliament for Banbury. Arthur Legge, fourth son of the third Earl, was a general in the British Army and Member of Parliament for Banbury. The Hon. Augustus Legge, fifth son of the fourth Earl, was Bishop of Lichfield. The Hon. Heneage Legge, sixth son of the fourth Earl, was Member of Parliament for St George's Hanover Square. "]}, {"page": "Legge", "response": ["*Arthur Legge (British Army officer) (1800–1890), British soldier and politician", "*Arthur Legge (footballer) (1881–1941), Australian sportsman"]}, {"page": "Banbury (UK Parliament constituency)", "response": ["|| 1826 || Hon. Arthur Legge"]}, {"page": "William Legge, 4th Earl of Dartmouth", "response": ["Dartmouth was the son of George Legge, 3rd Earl of Dartmouth, by Lady Frances, daughter of Heneage Finch, 3rd Earl of Aylesford. Heneage Legge and Arthur Legge were his younger brothers.thepeerage.com William Legge, 4th Earl of Dartmouth"]}, {"page": "Heneage Legge (1788–1844)", "response": ["Legge was the second son of George Legge, 3rd Earl of Dartmouth, by Lady Frances Finch, daughter of Heneage Finch, 3rd Earl of Aylesford. William Legge, 4th Earl of Dartmouth, and General the Hon. Arthur Legge were his brothers.thepeerage.com Hon. Heneage Legge"]}, {"page": "Arthur Charles Legge", "response": ["#REDIRECT Arthur Legge (British Army officer)"]}, {"page": "Arthur Legge", "response": ["Arthur Legge may refer to:", "*Arthur Legge (British Army officer) (1800–1890), British soldier and politician", "*Arthur Legge (footballer) (1881–1941), Australian sportsman"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|Banbury||Arthur Legge||"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|10 February 1826||Banbury||Heneage Legge||||Arthur Legge||||Heneage Legge appointed to Crown office"]}]}}