{"wiki_id": "http://www.wikidata.org/entity/Q4793936", "itemLabel": "June Lloyd, Baroness Lloyd of Highbury", "itemDescription": "British paediatrician and life peer", "wikipedia_url": "https://en.wikipedia.org/wiki/June_Lloyd,_Baroness_Lloyd_of_Highbury", "wikipedia_page": {"main": "June Kathleen Lloyd, Baroness Lloyd of Highbury, DBE, FRCP, FRCP Edin, FRCGP  (1 January 1928 – 28 June 2006) was a British paediatrician and, in retirement, a cross bench member of the House of Lords. June Lloyd was a determined advocate for children's health and was instrumental in the establishment of the Royal College of Paediatrics and Child Health. In 1996 the college gained its royal status. She was also known for discovering that the damage caused to patients by the rare metabolic disease oQ-betalipoproteinaemia, that could be avoided by the use of Vitamin E. She was also known for discovering the role of lipid metabolism in health and disease in childhood, which was original and difficult to investigate at that time.\n\n", "link_mentions": [{"page": "Baroness Lloyd of Highbury", "response": ["#REDIRECT June Lloyd, Baroness Lloyd of Highbury"]}, {"page": "June Kathleen Lloyd, Baroness Lloyd of Highbury", "response": ["#REDIRECT June Lloyd, Baroness Lloyd of Highbury"]}, {"page": "Lady Lloyd of Highbury", "response": ["#REDIRECT June Lloyd, Baroness Lloyd of Highbury"]}, {"page": "June Lloyd", "response": ["#REDIRECT June Lloyd, Baroness Lloyd of Highbury"]}, {"page": "June Kathleen Lloyd", "response": ["#REDIRECT June Lloyd, Baroness Lloyd of Highbury"]}, {"page": "Deaths in June 2006", "response": ["*June Lloyd, Baroness Lloyd of Highbury, 78, British paediatrician and life peer.Lady Lloyd of Highbury"]}, {"page": "Royal High School, Bath", "response": ["* June Lloyd, Baroness Lloyd of Highbury, Nuffield Professor of Child Health from 1985 to 1992 at the British Postgraduate Medical Federation, Professor of Child Health from 1975 to 1985 at St George's Hospital Medical School, and President from 1988 to 1991 of the British Paediatric Association"]}, {"page": "June (given name)", "response": ["*June Lloyd, Baroness Lloyd of Highbury (1928–2006), British paediatrician and, in retirement, a cross bench member of the House of Lords"]}]}}