{"wiki_id": "http://www.wikidata.org/entity/Q4798586", "itemLabel": "Arthur Egerton, 3rd Earl of Wilton", "itemDescription": "British politician (1833-85)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Egerton,_3rd_Earl_of_Wilton", "wikipedia_page": {"main": "Arthur Edward Holland Grey Egerton, 3rd Earl of Wilton (25 November 1833 – 18 January 1885), styled Viscount Grey de Wilton from 1833 to 1882, was a British peer and Conservative Member of Parliament from the Egerton family.\nWilton was the third but eldest surviving son of Thomas Egerton, 2nd Earl of Wilton and his first wife Lady Mary Stanley, daughter of Edward Smith-Stanley, 12th Earl of Derby.\nHe was educated at Eton and Christ Church, Oxford and was elected to Parliament for Weymouth in 1859, a seat he held until 1865, and also represented Bath between 1873 and 1874.\nIn 1875, seven years before he succeeded his father in the earldom, he was raised to the peerage as Baron Grey de Radcliffe, in the County Palatine of Lancaster.\nLord Wilton married Lady Elizabeth Charlotte Louisa Craven, daughter of William Craven, 2nd Earl of Craven, in 1858. The marriage was childless. Lord Wilton died in January 1885, aged 51. On his death the barony of Grey de Radcliffe became extinct while he was succeeded in the earldom by his younger brother Seymour John Grey Egerton.", "link_mentions": [{"page": "Earl of Wilton", "response": ["****15px Arthur Egerton, 3rd Earl of Wilton (1833–1885)"]}, {"page": "Thomas Egerton, 2nd Earl of Wilton", "response": ["* Arthur Egerton, 3rd Earl of Wilton (1833–1885)."]}, {"page": "William Craven, 4th Earl of Craven", "response": ["His father was the second son of nine children born to William Craven, 2nd Earl of Craven and Lady Emily Mary Grimston, herself the daughter of James Grimston, 1st Earl of Verulam.  His grandfather also served as Lord Lieutenant of Warwickshire from 1853 to 1856.  His paternal aunt, Lady Elizabeth Craven, married Arthur Egerton, 3rd Earl of Wilton, and another, Lady Blanche Craven, married George Coventry, 9th Earl of Coventry, and another, Lady Beatrix Jane Craven, married George Cadogan, 5th Earl Cadogan.  His mother was the second daughter of George Barrington, 7th Viscount Barrington, who was a Member of Parliament for Eye and served as Captain of the Honourable Corps of Gentlemen-at-Arms and Captain of the Yeomen of the Guard under Queen Victoria in the 1880s.  His maternal aunt, Constance Mary Barrington, was married to Lawrence Palk, 2nd Baron Haldon."]}, {"page": "Arthur Edward Holland Grey Egerton, 3rd Earl of Wilton", "response": ["#REDIRECT Arthur Egerton, 3rd Earl of Wilton"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Arthur Egerton, 3rd Earl of Wilton"]}, {"page": "Egerton (name)", "response": ["* Arthur Egerton, 3rd Earl of Wilton (1833–1885), British peer and politician"]}, {"page": "William Craven, 2nd Earl of Craven", "response": ["* Lady Elizabeth Charlotte Louisa Craven (1836–1919), who married Arthur Egerton, 3rd Earl of Wilton in 1858. After his death, she married Arthur Vickris Pryor in 1886."]}, {"page": "Seymour Egerton, 4th Earl of Wilton", "response": ["His elder brother was Arthur Egerton, 3rd Earl of Wilton.  His father was Thomas Egerton, 2nd Earl of Wilton (1799–1882) and his mother was Lady Mary Margaret Stanley, daughter of Edward Smith-Stanley, 12th Earl of Derby.  His paternal grandfather was Robert Grosvenor, 1st Marquess of Westminster."]}, {"page": "1st Manchester Rifles", "response": ["* Arthur Egerton, 3rd Earl of Wilton (former CO) appointed 14 October 1863"]}]}}