{"wiki_id": "http://www.wikidata.org/entity/Q4795149", "itemLabel": "Arnold Long", "itemDescription": "English cricketer (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arnold_Long", "wikipedia_page": {"main": "Arnold \"Ob\" Long (born 18 December 1940 in Cheam) is a former English first-class cricketer. He played for Surrey between 1960 and 1975, then spent the remainder of his career at Sussex, whom he captained between 1978 and 1980. A wicketkeeper and left-handed batsman, Long claimed 1046 victims from his 452 games over a 20-year career. Of these, 805 were for Surrey between 1960 and 1975, putting him third in the county's all-time wicketkeeping records. In 1962 he took 74 catches, and made 91 dismissals in all, both of which are Surrey records for one season. He was a member of the Surrey side that won the County Championship in 1971.[1].[2]", "link_mentions": [{"page": "Surrey County Cricket Club", "response": ["*  Arnold Long"]}, {"page": "International cricket in South Africa from 1971 to 1981", "response": ["DH Robins' XI team squad comprised: Tony Brown; David Brown; Frank Hayes; Jackie Hampshire; Robin Hobbs; David Hughes; Robin Jackman; Roger Knight; John Lever; Peter Lewington;  Arnold Long; John Murray; Clive Radley; Mike Smith; David Turner; Peter Willey;  Bob Willis;"]}, {"page": "Benson & Hedges Cup", "response": ["The final was played at Lord's, initially in mid-July, but latterly in late June. Viv Richards of Somerset made the highest score in a final, an unbeaten 132. Ken Higgs of Leicestershire took a hat-trick (Alan Butcher, Pat Pocock and Arnold Long) against Surrey in the final of 1974, but still ended on the losing side.  Other notable performances in its later days include Mark Alleyne's century for Gloucestershire in 1999, 112 from Aravinda de Silva as Kent lost in 1995, and Ben Hollioake's 115-ball 98 for Surrey in 1997."]}, {"page": "John Barclay (cricketer)", "response": ["He was an opening batsman who never got quite as many runs as he should have, though having an excellent technique and eye. He also bowled off-spin, dismissing Ian Botham and Viv Richards several times. He succeeded Arnold Long as the County Captain of Sussex County Cricket Club in 1981 and led the team to second place in the County Championship. He was rated as one of the best county captains around and he was tipped for the Test captaincy. He was forced to retire in 1986, due to a finger injury."]}, {"page": "Fred Stedman", "response": ["His best year was 1901, when he made 87 dismissals (71 catches, 16 stumpings), all for Surrey. This remained a Surrey record until 1962, when Arnold Long managed 91."]}, {"page": "List of Surrey first-class cricket records", "response": ["|  Arnold Long|| 1960–1975", "|  Arnold Long || 1962", "|  Arnold Long || v Sussex || Hove || 1964"]}, {"page": "List of Surrey List A cricket records", "response": ["|  Arnold Long || 1963–1975", "|  Arnold Long || 1971"]}, {"page": "Alan Mansell", "response": ["The 1975 season was to be his last with Sussex, with Mansell making twenty first-class appearances, the last of which came against Lancashire in that season's County Championship. He scored 448 runs in his final season, which came at an average of 16.00, with a high score of 52. One of two half centuries he made that season, this score came against Oxford University. Behind the stumps he took 40 catches. In List A cricket, he made seventeen appearances in that season which were spread across the Benson & Hedges Cup, John Player League and Gillette Cup, with his final appearance coming against Lancashire. He scored 70 runs in his seventeen matches, which came at an average of 7.00, with a high score of 17. In total, Mansell made 58 first-class appearances, scoring 1,098 runs at an average of 15.25, with a high score of 72 not out, which was one of four half centuries he made. Behind the stumps, he took 109 catches and 6 sumpings, This makes him Sussex's fourteenth most successful wicket-keeper in first-class cricket. In List A cricket, he made a total of 39 appearances, scoring 165 runs at an average of 7.17, with a high score of 28. Behind the stumps, he took 39 catches and made 5 stumpings. He is the seventh most successful wicket-keeper for Sussex in List A cricket. He left Sussex at the end of that season and was replaced with Surrey wicket-keeper Arnold Long."]}, {"page": "1978 Gillette Cup Final", "response": ["The Sussex captain, Arnold Long, won the toss and chose to bowl first, hoping that morning dew might give his bowlers an advantage. Brian Rose scored 14 runs from the first over, bowled by Imran, who later took Somerset's first wicket, bowling Denning before the batsman had scored a run. That brought Richards to the crease, and Long immediately changed both of his bowlers, replacing the quick bowling of the openers with the slower deliveries of Giles Cheatle and John Spencer. Cheatle dismissed Rose in his first over, caught down the leg side by the wicket-keeper, Long after scoring 44 runs. Peter Roebuck also got out to Cheatle, scoring nine runs before being caught by Mendis. Botham joined Richards in the middle, and immediately scored a four with a straight drive, followed by two hooks for sixes. Cheatle and Spencer each bowled their entire allocation of 12 overs without a break, and were followed by the introduction of another slow bowler, John Barclay. Although Richards finished as the competition's leading run-scorer, Woodcock said that he struggled to score fluently, particularly against the spin bowling of Barclay and Cheatle. In the Wisden Cricketers' Almanacks summary of the season, Jack Alridge praised Long's captaincy in the final, highlighting the use of slower bowling against Richards and Ian Botham as being particularly commendable.Preston 1979, pp. 547–48. Vic Marks, who also played in the match for Somerset, suggested that Botham was the only Somerset batsman to play with freedom, and said that the rest of the team were nervous and intimidated by the prospect of winning Somerset's first trophy.Marks 1984, pp. 61–63. Richards scored 44 runs, and Botham 80, including three sixes, but none of the rest of the middle- or lower-order batsmen made a significant score and Somerset finished their innings on 207 for 7. Along with Barclay, Spencer bowled particularly economically for Sussex.", "! scope=\"row\" style=\"font-weight: normal;\" | Arnold Long * "]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Arnold Long (1963–1973) : A. Long (Surrey)"]}]}}