{"wiki_id": "http://www.wikidata.org/entity/Q4799742", "itemLabel": "Arthur Montford", "itemDescription": "Scottish sports journalist (1934-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Montford", "wikipedia_page": {"main": "Arthur Montford (25 May 1929 – 26 November 2014) was a Scottish Television sports journalist, best known for his 32-year tenure as the presenter of Scottish Television's Scotsport.  Although he was most associated with football, he covered a number of other sports for ITV, notably golf.", "link_mentions": [{"page": "List of Scots", "response": ["* Arthur Montford (1929–2014)"]}, {"page": "University of Glasgow", "response": ["All students at the university are eligible to vote in the election of the Rector (officially styled \"Lord Rector\"), who holds office for a three-year term and chairs the University Court. In the past, this position has been a largely honorary and ceremonial one, and has been held by political figures including William Gladstone, Benjamin Disraeli, Bonar Law, Robert Peel, Raymond Poincaré, Arthur Balfour, Charles Kennedy and 1970s union activist Jimmy Reid, and latterly by celebrities such as TV presenters Arthur Montford and Johnny Ball, musician Pat Kane, and actors Richard Wilson, Ross Kemp and Greg Hemphill. In 2004, for the first time in its history, the university was left without a Rector as no nominations were received. When the elections were run in December, Mordechai Vanunu was chosen for the post, even though he was unable to attend due to restrictions placed upon him by the Israeli government. In 2014, Edward Snowden, an American computer specialist, a former Central Intelligence Agency (CIA) employee, and former National Security Agency (NSA) contractor—who came to international attention when he disclosed a large number of classified NSA documents to several media outlets—was elected. In 2017, Aamer Anwar a Scottish lawyer and former student of the university was elected rector  until 2020 when rector elections had to be postponed due to the COVID-19 pandemic. On April 21, 2021, Rita Rae, Lady Rae a Scottish lawyer, judge and former Senator of the College of Justice was appointed Rector after a decisive victory."]}, {"page": "Scotsport", "response": ["Despite being one of the world's longest-running sports television programmes, there were only five main anchors in its 51 years on air, largely due to the 32-year tenure of Arthur Montford, who retired in May 1989. Montford was succeeded by Jim White (now with Sky Sports), Jim Delahunt, and finally, the pairing of Grant Stott and Andy Walker, who also anchored STV's Champions League coverage.", "* World of Sport from Scotland (billed as Scotsport Special) was broadcast as a occasional opt out from the network version of World of Sport on Saturday afternoons, it was presented by Arthur Montford and largely featured live and highlights coverage of Scottish sporting events incorporated with the network sporting events. ", "* Scotsport Results launched on 15 August 1964 and was broadcast on Saturday teatimes at around 5pm during the football season. It was presented by Arthur Montford, and latterly, Jim White until the end of the 1992/93 football season. Since then, A Scottish football results programme has been broadcast on BBC One Scotland known as Afternoon Sportscene (now Sportscene Results)."]}, {"page": "Rector of the University of Glasgow", "response": ["|1974–1977 || Arthur Montford ||  || sports journalist"]}, {"page": "Jimmy Delaney", "response": ["Delaney was held in high regard as a player by Matt Busby with Arthur Montford, 1973 who, when the war ended in 1946, signed him for Manchester United in a £4,000 deal. Delaney helped United win the 1948 FA Cup Final and finished his United career with 28 goals from 184 total appearances.James \"Jimmy\" Delaney, MUFCinfo"]}, {"page": "Susan Montford", "response": ["She was born in Glasgow, Scotland. She is related to the Scottish football commentator Arthur Montford."]}, {"page": "World of Sport (British TV programme)", "response": ["Eamonn Andrews was the first host and the programme itself was \"compiled for Independent Television\" by ABC Weekend Television. From the summer of 1968 it was produced by London Weekend Television - under the ITV Sport banner, with the other ITV stations supplying footage of events in their regions. Thames Television took over LWT's responsibilities for Bank Holiday editions. Dickie Davies also took over as host in 1968 and would remain the face of the show until it ended in 1985. Other presenters were Fred Dinenage, Steve Rider and Jim Rosenthal. STV and Grampian occasionally opted out and showed their own version of World of Sport (billed as Scotsport Special) presented by Arthur Montford."]}, {"page": "List of British football commentators", "response": ["|Arthur Montford"]}, {"page": "Jim White (presenter)", "response": ["White became presenter of STV's Scotsport in 1989, succeeding Arthur Montford. He also presented its spinoff show Scotsport Extra Time."]}, {"page": "Category talk:British journalists", "response": ["Arthur Montfordnot yet classified"]}, {"page": "List of FIFA World Cup broadcasters", "response": ["|Hugh JohnsGerry HarrisonGerald SinstadtMartin TylerArthur Montford (Scotland)", "|Hugh JohnsKeith MacklinGerry HarrisonGerald SinstadtArthur Montford (Scotland)"]}, {"page": "Montford (surname)", "response": ["*Arthur Montford (born 1934), Scottish television sports journalist"]}, {"page": "1989 in Scottish television", "response": ["*20 May – Arthur Montford presents his final edition of Scotsport after 32 years with live coverage of the Scottish Cup final.", "*6 August – After being a co-host on the show last season, Jim White takes on the main presenting role on Scotsport replacing the now-retired Arthur Montford."]}, {"page": "1929 in Scotland", "response": ["* 25 May – Arthur Montford, Scottish Television sports journalist (died 2014) "]}, {"page": "2014 in British television", "response": ["|Arthur Montford"]}, {"page": "2014 in Scottish television", "response": ["*25 November – Arthur Montford, 85, Sports broadcaster"]}, {"page": "2014 in the United Kingdom", "response": ["**Arthur Montford, 85, football commentator."]}, {"page": "Bunkered", "response": ["* Arthur Montford - 1996–present"]}, {"page": "2014–15 in Scottish football", "response": ["*26 November: Arthur Montford, 85, Scotsport commentator."]}, {"page": "Deaths in November 2014", "response": ["*Arthur Montford, 85, Scottish football commentator.Football broadcaster Arthur Montford dies, aged 85"]}, {"page": "2014 BBC Sports Personality of the Year Award", "response": ["*Arthur Montford"]}, {"page": "2015–16 Greenock Morton F.C. season", "response": ["After the conclusion to the 2014-15 season, manager Jim Duffy dedicated the title triumph to Greenock broadcaster Arthur Montford."]}, {"page": "Alienation (speech)", "response": ["Reid stood for the CPGB in Central Dunbartonshire (which included Clydeside) in the February and October 1974 general elections, losing decisively to the Labour candidate both times.  His term as rector ended in 1974 and he was replaced by Arthur Montford, a football commentator.  Reid later moved away from the CPGB and joined Labour, for which he unsuccessfully stood in Dundee East in the 1979 general election.  Afterwards, he presented a series of BAFTA-winning documentaries about the USSR on Grampian Television.  He became disillusioned with New Labour and, in 2005, joined the Scottish National Party.  He died in 2010."]}]}}