{"wiki_id": "http://www.wikidata.org/entity/Q4798983", "itemLabel": "Arthur Hartley", "itemDescription": "civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Hartley", "wikipedia_page": {"main": "Arthur Clifford Hartley, CBE (7 January 1889 – 28 January 1960) was a British civil engineer. Graduating with a bachelor's degree from Imperial College London, Hartley worked for the North Eastern Railway and an asphalt manufacturer before joining the Royal Flying Corps during World War I. He became a qualified pilot, with the rank of major and joined the Air Board where he was involved with the development of interrupter gear. His war work was rewarded with his appointment as an Officer of the Order of the British Empire (OBE). He left the corps after the war and spent five years as a consulting engineer before he joined the Anglo-Persian Oil Company (later Anglo-Iranian).\nDuring the Second World War Hartley was seconded to the government where he was involved in the development of the bombsight which sank the Tirpitz, the Operation Pluto pipeline project and the FIDO fog dispersion system. Following the war he was rewarded with an appointment as Commander of the Order of the British Empire (CBE), a United States Medal of Freedom and £9000 cash. He retired from Anglo-Iranian in 1951 and was elected president of the Institution of Mechanical Engineers. He was elected president of the Institution of Civil Engineers in 1959, but died three months into his tenure.", "link_mentions": [{"page": "Amphibious warfare", "response": ["Operation Pluto was a scheme developed by Arthur Hartley, chief engineer with the Anglo-Iranian Oil Company, to construct an undersea oil pipeline under the English Channel between England and France to provide logistical support to the landed armies. Allied forces on the European continent required a tremendous amount of fuel. Pipelines were considered necessary to relieve dependence on oil tankers, which could be slowed by bad weather, were susceptible to German submarines, and were also needed in the Pacific War. Geoffrey William Lloyd, the Minister for Petroleum gained the support of Admiral Mountbatten, Chief of Combined Operations for the operation."]}, {"page": "Fog Investigation and Dispersal Operation", "response": ["Fog Investigation and Dispersal Operation (FIDO) (which was sometimes referred to as \"Fog Intense Dispersal Operation\" or \"Fog, Intense Dispersal Of\") was a system used for dispersing fog and pea soup fog (dense smog) from an airfield so that aircraft could land safely. The device was developed by Arthur Hartley for British RAF bomber stations, allowing the landing of aircraft returning from raids over Germany in poor visibility by burning fuel in rows on either side of the runway."]}, {"page": "List of presidents of the Institution of Civil Engineers", "response": ["On 18 December 1956 Harold Gourley died just six weeks after assuming the office in November.  Gourley was the first regularly elected president to die in office (Telford, who was elected president for life, died in office) and the ICE council, who were authorised to fill any vacancy except that of President, were forced to call a Special General Meeting of members.  As a result of this meeting, Sir Frederick Arthur Whitaker was elected to the position in February 1957 and was allowed to serve out the remainder of Gourley's term in addition to his own full term. Subsequent deaths-in-office saw Sir Herbert Manzoni succeed Arthur Hartley in February 1960; and Tony Ridley succeed Edmund Hambly in March 1995."]}, {"page": "Herbert Manzoni", "response": ["In February 1960, Manzoni was elected president of the Institution of Civil Engineers, a position he served in for 21 months instead of the customary year-long tenure due to the untimely death of his predecessor Arthur Hartley."]}, {"page": "Petroleum Warfare Department", "response": ["On 15 April 1942, Arthur Hartley, chief engineer with the Anglo-Iranian Oil Company, attended a meeting of the Overseas Development Committee of the Oil Control Board in place of Sir William Fraser who was unable to attend.  Here Hartley saw a chart of the English Channel which piqued his curiosity. Inquiring, Hartley learned about PLUTO and its many difficulties."]}, {"page": "Alexander Rankine", "response": ["This work was done with the Petroleum Warfare Department, and he contributed to both the design and testing done on the system in wind tunnels at the Empress Hall, Earls Court. The system was then developed further by Arthur Hartley, and when brought into operation helped to save the lives of many World War II aircrews."]}, {"page": "Hartley (surname)", "response": ["* Arthur Hartley (1889–1960), British civil engineer"]}, {"page": "Clifford Hartley", "response": ["#REDIRECT Arthur Hartley"]}]}}