{"wiki_id": "http://www.wikidata.org/entity/Q4799112", "itemLabel": "Arthur Holt", "itemDescription": "British politician (1914-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Holt_(politician)", "wikipedia_page": {"main": "Arthur Frederick Holt (8 August 1914 – 23 August 1995) was a hosiery manufacturer and Liberal Party politician in the United Kingdom, and Member of Parliament for thirteen years.", "link_mentions": [{"page": "1964 United Kingdom general election", "response": ["*Arthur Holt (Bolton West)"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Arthur Holt"]}, {"page": "Bolton West (UK Parliament constituency)", "response": ["| Arthur Holt"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Arthur Holt"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Arthur Holt"]}, {"page": "List of Liberal Party (UK) MPs", "response": ["* Arthur Holt, Bolton West, 1951–64"]}, {"page": "John Lewis (British politician)", "response": ["After making a fortune in industrial rubber, Lewis was elected as Member of Parliament (MP) for the two-seat constituency of Bolton at the 1945 general election, and became Parliamentary Private Secretary to the Postmaster-General. The constituency was divided in a boundary review for the 1950 general election, when he was returned as MP for the new Bolton West constituency. At the 1951 general election he lost his seat to the Liberal candidate Arthur Holt."]}, {"page": "Donald Wade, Baron Wade", "response": ["In 1958, a movement promoted by Edward Martell grew for a formal alliance of Conservatives and Liberals in an \"Anti-Socialist Front\". The Liberal Party Executive rejected the idea, whereupon Martell demanded a statement from Wade and from Arthur Holt, MP for Bolton West, who had been elected as a result of a similar pact."]}, {"page": "Holt (surname)", "response": ["* Arthur Holt (sportsman) (1911–1994), Hampshire cricketer and Southampton footballer", "* Arthur Holt (politician) (1914–1995), English politician"]}, {"page": "Chief Whip of the Liberal Democrats", "response": ["|Arthur Holt"]}, {"page": "1960 Bolton East by-election", "response": ["At the 1964 general election, a more organised Labour campaign in Bolton East saw Taylor voted out by a margin of more than 3,000 votes. A Conservative stood in Bolton West for the first time since 1950, resulting in a Labour gain from the Liberal Arthur Holt by roughly the same margin."]}, {"page": "Arthur Holt", "response": ["Arthur Holt may refer to:", "* Arthur Holt (politician) (1914–1995), British Liberal Party politician and MP", "* Arthur Holt (cricketer) (1911–1994), English cricketer for Hampshire, who also played football with Southampton"]}, {"page": "Bolton RUFC", "response": ["Between 1919 and 1939, Bolton had a club that boasted International players, and even the former Bolton MP Arthur Holt played for them, but World War II finally saw the demise of the game in Bolton. The start of the modern era was due to several former pupils of Hayward School, who formed a team to play on Saturdays calling themselves the 'Old Haywardians'. "]}, {"page": "President of the Liberal Party", "response": ["|Arthur Holt"]}, {"page": "Liberal Party Frontbench Team, 1945–56", "response": ["*1952: Arthur Holt becomes Parliamentary Chairman of the Liberal Party.", "*1955: Arthur Holt replaced as Parliamentary Chairman of the Liberal Party."]}]}}