{"wiki_id": "http://www.wikidata.org/entity/Q4798034", "itemLabel": "Arthur Blyth", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Blyth", "wikipedia_page": {"main": "Sir Arthur Blyth  (19 March 1823 – 7 December 1891) was Premier of South Australia three times; 1864–65, 1871–72 and 1873–75.", "link_mentions": [{"page": "December 7", "response": ["*1891 – Arthur Blyth, English-Australian politician, 9th Premier of South Australia (b. 1823)"]}, {"page": "March 19", "response": ["*1823 – Arthur Blyth, English-Australian politician, 9th Premier of South Australia (d. 1891)"]}, {"page": "Premier of South Australia", "response": ["| data-sort-value=\"Blyth, Arthur\"| Arthur Blyth(1823–1890)MHA for Gumeracha", "| data-sort-value=\"Blyth, Arthur\"| Arthur Blyth", "| data-sort-value=\"Blyth, Arthur\"| Arthur Blyth"]}, {"page": "Bishops' House", "response": ["Samuel Blyth was the last of the family to live in the house, dying in 1753, after which his sons sold the house to a William Shore. The Blyth family subsequently moved to Birmingham.Blyth, E.L.I. 1893, The family of Blythe or Blyth of Norton and Birchet Notable descendants were Benjamin Blyth, Sir Arthur Blyth and Benjamin Blyth II. The house was subsequently let to a tenant farmer and his labourer, at which point the house was sub-divided into two dwellings."]}, {"page": "Agent-general", "response": ["* Arthur Blyth, 1877–1891", "* Sir Arthur Blyth (acting), 1887–1888"]}, {"page": "Richard Chaffey Baker", "response": ["Baker earned an M.A. in 1870, and was appointed as Attorney-General in the third ministry of John Hart in May 1870, but returned to the backbenches in July 1871 in order to manage the affairs of his ailing father, and did not recontest his seat at the election late that year. Two years later, Baker visited England, and on his return in early 1875, he declined an offer to serve in the cabinet of Sir Arthur Blyth. He nevertheless recontested his old seat of Barossa, but was defeated. Two years later, Baker chose to instead contest a seat in the Legislative Council, and was successful. He held his seat until federation, serving a twelve-month stint as education minister in the Colton ministry in 1884–1885, and serving as President of the Legislative Council from 1893 until 1901. He founded the National Defence League in 1891 as an immediate response to the perceived threat from the Labor Party."]}, {"page": "1891 in Australia", "response": ["* 7 December - Arthur Blyth (born 1823), Premier of South Australia"]}]}}