{"wiki_id": "http://www.wikidata.org/entity/Q4797989", "itemLabel": "Arthur Berry", "itemDescription": "American artist and writer (1925-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Berry_(playwright)", "wikipedia_page": {"main": "Arthur Berry (7 February 1925 – 4 July 1994) was an English playwright, poet, teacher and artist, who was born in Smallthorne, Stoke-on-Trent. His individual creative work became deeply rooted in the culture, people and landscape of the industrial pottery town of Burslem.", "link_mentions": [{"page": "Stoke-on-Trent", "response": ["Edwardian School of Art in Burslem has been refurbished with £1.2 million, and is now run without a public subsidy. The Hothouse Centre for Ceramic Design, and the Roslyn Works complex of craft studios operate in Longton. Also based in Burslem is the Barewall Gallery, which has a large collection of work by local artists including original art by Arthur Berry (The Lowry of The Potteries), Jack Simcock, and by new emerging Potteries artists.", "Stoke-on-Trent is the birthplace of several artists including Arthur Berry (also a novelist, playwright & poet), Glenys Barton (sculptor), Arnold Machin (sculptor, coin & stamp designer) and Sidney Tushingham, A.R.E."]}, {"page": "Burslem", "response": ["Many of the novels of Arnold Bennett evoke Victorian Burslem, with its many potteries, mines, and working canal barges. The Burslem of the 1930s to the 1980s is evoked by the paintings and plays of Arthur Berry."]}, {"page": "Shelton Bar", "response": ["The industrial landscapes of Shelton Bar were depicted in art by Arthur Berry, in poetry by Charles Tomlinson and in fiction by Arnold Bennetthttp://www.thepotteries.org/people_famous/bennett/locations.htm. The human side of steelmaking was depicted on the stage and BBC TV as \"The Fight for Shelton Bar\" (1973). In fiction, the landscape of Shelton Bar was the setting of the short story \"The Cone\" by H.G. Wells, who had lived nearby. It's believed that Wells also found inspiration for The War of the Worlds there: he wrote in a letter to a friend from the area that \"the district made an immense impression on me.\" The inspiration for some of his descriptions in it is thought to have come from his short time spent there, seeing the iron foundry furnaces burn over the city, shooting huge red light into the skies."]}, {"page": "Robert MacBryde", "response": ["Robert MacBryde died in 1966 in Dublin as a result of a street accident. Anthony Cronin, a friend of MacBryde and Colquhoun, describes them both with affection and respect in his memoir Dead as Doornails, as does the English painter, playwright and poet Arthur Berry in his autobiography A Three And Sevenpence Half Penny Man."]}, {"page": "Smallthorne", "response": ["* Arthur Berry, playwright, poet, teacher and artist"]}, {"page": "Stoke-on-Trent College of Art", "response": ["Burslem School of Art was perhaps the best known art school in the Potteries.  It was provided with a fine building in 1905.  Burslem continued to be the home of the Department of Fine Art for some years after the formation of North Staffordshire Polytechnic.  Staff at Burslem included Arthur Berry who taught at the Polytechnic until 1985 by which time Fine Art had moved to College Road."]}, {"page": "New Vic Theatre", "response": ["The theatre continues to keep close to its Potteries roots.  One of the plays in its re-opening season was by local playwright Arthur Berry."]}, {"page": "Burslem School of Art", "response": ["Gordon Forsyth, who had designed for Pilkington's Lancastrian Pottery & Tiles, was principal of the Stoke-on-Trent Art Schools in the period 1920–44 and taught at Burslem School of Art.Designers - Gordon Forsyth 1879–1952, Gray's PotteryGordon Forsyth, SOT Museums  Reginald George Haggar, who was Minton's art director in the 1930s, was the Master-in-Charge of the Burslem School of Art from 1941 to 1945. Other notable staff members included Arthur Berry who featured in at least two television programmes in the Monitor series with Huw Weldon.", "* Arthur Berry artist and playwright, Berry also taught at his alma mater"]}, {"page": "Wolstanton", "response": ["* Arthur Berry (1925–1994): a playwright, poet, teacher and artist"]}, {"page": "Gordon Forsyth", "response": ["Forsyth was the tutor of a number of notable students at the Burslem School of Art including Susie Cooper,Andrew Casey, Elegance with Utility: The work of Susie Cooper (1902-1995) Glyn Colledge, Clarice Cliff, Charlotte Rhead, Arthur Berry, and Mabel Leigh. At that time, Forsyth was described as a \"pottery designer, educator and writer...and one of the main spokespersons on industrial pottery design.\"Jerry Palmer & Mo Dodson, Design and Aesthetics: a Reader, London: Routledge, 1995, p.210 And the pivotal role he played in British ceramic design has inspired some to call him \"the magus of the mid-twentieth century pottery industry.\"S. Beddoe, Potters and Paintresses: Women Designers in the Pottery Industry 1870–1955, Jnl Design History (1990) 3 (2-3): 197-198", "*Arthur Berry"]}, {"page": "John Shelton (artist)", "response": ["Shelton attended the Burslem School of Art from 1937 to 1942 where he studied under Reginald Haggar.Death of Art Student - Fall Down Stairs, The Sentinel, 20 December 1943 A contemporary and friend of Arthur Berry, he was awarded a scholarship for the Slade School of Fine Art, London which he joined in 1945. He left the Slade in March 1946 due to the financial hardships of artistic life in LondonArthur Berry, A Three and Sevenpence Halfpenny Man, Kermase Editions (1884) pp. 182-9 before returning to complete his scholarship from 1948-50. It was this in-between period in which Shelton changed his name from Hancock.", "Shelton's work resides in the Potteries Museum & Art GalleryPublic Catalogue Foundation, Oil Paintings in Public Ownership in Staffordshire, p. 154 and in many private collections, including those of the actor Freddie Jones and the late Pat Phoenix.The Sentinel, Stray cat turns up at auction, The Sentinel 06/07/2012, p. 14. Shelton's work was most recently exhibited in October 2012 alongside that of fellow students Arthur Berry and Norman Cope.The Sentinel, 19 October 2012, \"Exhibition brings art school pals together \", Accessed 4 June 2013"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Arthur Berry (1925–1994), playwright, poet, teacher and artist."]}, {"page": "Berry (surname)", "response": ["*Arthur Berry (disambiguation), several people", ":* Arthur Berry (playwright) (1925–1994), English playwright, poet, teacher and artist", ":* Arthur Berry (footballer) (1888–1953), English amateur footballer", ":* Arthur Berry (politician) (1879–1943), politician in Manitoba, Canada", ":* Arthur Berry (cricketer) (1928–2016), New Zealand cricketer", "*Richard James Arthur Berry (1867–1962), British surgeon and professor of anatomy in Australia"]}, {"page": "Arthur Berry", "response": ["Arthur Berry may refer to:", "* Arthur Berry (playwright) (1925–1994), English playwright, poet, teacher and artist", "* Arthur Berry (footballer) (1888–1953), English amateur footballer", "* Arthur Berry (politician) (1879–1943), politician in Manitoba, Canada", "* Arthur Berry (cricketer) (1928–2016), New Zealand cricketer"]}, {"page": "Jack Simcock", "response": ["Simcock started exhibiting at London's Piccadilly Gallery from 1957 after encouragement from Arthur Berry and went on to have more than fifty solo shows worldwide.The Sentinel, 15/05/2012, \" Artist Jack Simcock dies on eve of exhibition \", 14/05/2013 His work is in various public collections in the UK which can be viewed through the Art UK website.", "He died on the eve of the opening of \"The Boys\",The Sentinel, 15/05/2012, \" Artist Jack Simcock dies on eve of exhibition \", 14/05/2013 an exhibition at Keele University, of his paintings, together with those of his fellow Burslem School of Art alumni, Enos Lovatt and Arthur Berry."]}, {"page": "Bedford Gardens, London", "response": ["* #77 Arthur Berry (1925-1994), painter, poet, playwright and teacher"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Arthur Berry (playwright)"]}]}}