{"wiki_id": "http://www.wikidata.org/entity/Q4795297", "itemLabel": "Arnold Ward", "itemDescription": "English cricketer (1876-1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arnold_Ward", "wikipedia_page": {"main": "Arnold Sandwith Ward (1876–1950) was an English journalist and Conservative Party politician.  He served as the MP for the constituency of Watford between 1910 and 1918.\nWard was the son of Humphry \"Thomas\" Ward, a fellow and tutor of Brasenose College and Mary Augusta Ward, a popular author; grandson of Tom Arnold; greatgrandson of Thomas Arnold, the famous headmaster of Rugby School. He was educated at Eton and Balliol College, Oxford.While at Oxford he played one first-class cricket match for the university side as a lower-order right-handed batsman and medium-pace right-arm bowler; he also played Minor Counties cricket for Hertfordshire and Buckinghamshire between 1896 and 1905.", "link_mentions": [{"page": "Aldbury", "response": ["An heir to the Stocks estate, James Adam Gordon (d.1854), was a friend of the Scottish author Sir Walter Scott, and it is reputed that the writer visited Gordon at Stocks House. Gordon's widow, Emma Katherine, married the politician Richard Bright, who died at Stocks in 1878. Emma Katherine died in 1891, and left the estate to Foreign Secretary Sir Edward Grey, as a descendant of Samuel Whitbread.  He shortly afterwards sold the house, as all that remained, to the author Mary Augusta Ward, whose husband was also a writer, Thomas Humphry Ward.Encyclopædia Britannica, Eleventh Edition While the Wards lived at Stocks, it became a bustling literary salon, welcoming leading intellectuals and writers of the day, including their nephews Aldous Huxley and Julian Huxley, their son-in-law George Macaulay Trevelyan, and Eric Blair (George Orwell). Mary Ward died in 1920 and Stocks was inherited by her son, politician Arnold Ward."]}, {"page": "Watford (UK Parliament constituency)", "response": ["| Arnold Ward", "*Unionist: Arnold Ward"]}, {"page": "Violet Bonham Carter", "response": ["In October 1907 Violet had a proposal of marriage from Arnold Ward, a college friend of her brother Raymond. She turned it down. Sutherland suggests her parents were against the match: financial matters were probably a factor, and the Wards were Tories.", "Violet was close to Winston Churchill, promoted to the Liberal Cabinet in 1908: Churchill said later they were \"practically engaged\", and they were friends for life. He actually became engaged that year to Clementine Hozier, whom Violet thought \"as stupid as an owl\". In late August, between his engagement and his marriage, Churchill spent a holiday with the Asquith family at New Slains Castle on the Scottish coast. Some days after his departure, but while Arnold Ward remained a guest, Violet went out one evening, to look for a book left on the rocks. She was discovered after a search of several hours, lying uninjured but unconscious near the coastal path. Michael Shelden suggests Violet's experience may have been \"an unhappy young woman's cry for attention\".Shelden 2013, pp. 180–91."]}, {"page": "Thomas Humphry Ward", "response": ["Ward married Mary Augusta Arnold, who became a best-selling novelist of various genres including victorian values as Mrs Humphry Ward. Arnold was the daughter of a fellow Oxford academic, Tom Arnold and the marriage connected Ward to the influential intellectual families of the Arnolds and the Huxleys. They lived at 17 Bradmore Road in North Oxford, which Ward leased in 1872. They had one son and two daughters, including the MP Arnold Ward and the author and activist Janet Trevelyan."]}, {"page": "Stocks House", "response": ["While the Wards lived at Stocks, it became a bustling salon of leading intellectual luminaries. Upon Ward's death, Stocks was inherited by her son, a Member of Parliament, Arnold Ward. who sold Stocks to the Blezard family, who later sold it to the bachelor Arthur Brown of the Luton quaker family of timber millers."]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Arnold Ward"]}, {"page": "Cricklade (UK Parliament constituency)", "response": ["thumb|120px|Arnold Ward"]}, {"page": "List of sportsperson-politicians", "response": ["|data-sort-value=\"Ward,Arnold\"| Arnold Ward || Cricket || MP for Watford (1910-1918)"]}, {"page": "Ward (surname)", "response": ["* Arnold Ward (1876–1950), British journalist and politician"]}, {"page": "Arnold Sandwith Ward", "response": ["#REDIRECT Arnold Ward"]}, {"page": "Chris Braithwaite", "response": ["Braithwaite became a member of the National Union of Seamen, and in 1930 joined the Seamen's Minority Movement, a rank-and-file group organised by the Communist Party of Great Britain (CPGB). Taking the pseudonym \"Chris Jones\" to avoid victimisation by his employer, Braithwaite had joined the CPGB by 1931. He helped distribute the Negro Worker, and with Arnold Ward helped launch the Negro Welfare Association, publicising the case of the Scottsboro Boys. In 1933 he followed George Padmore in resigning from the CPGB in protest at the implicit shift away from anti-imperialism involved with the emerging \"Popular Front\" strategy."]}, {"page": "Janet Trevelyan", "response": ["Trevelyan was born Janet Penrose Ward in Oxford on 6 November 1879. She was the daughter of art critic Humphry Ward and writer Mary Augusta Ward, and through her mother was related to Matthew Arnold and Thomas Arnold. Her brother was the Conservative MP Arnold Ward. "]}]}}