{"wiki_id": "http://www.wikidata.org/entity/Q4799104", "itemLabel": "Arthur Holland", "itemDescription": "British politician (1862-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Holland_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant-General Sir Arthur Edward Aveling Holland  (13 April 1862 – 7 December 1927) was a British Army officer and Conservative and Unionist politician.", "link_mentions": [{"page": "I Corps (United Kingdom)", "response": ["General Officer Commanding: Lieut-Gen Sir Arthur Holland", "* 1917–1918 Lieutenant-General Sir Arthur Holland"]}, {"page": "Royal Military Academy, Woolwich", "response": ["*1912–1914 Brigadier-General Arthur Holland"]}, {"page": "1st Infantry Division (United Kingdom)", "response": ["* 1915–1916 Major-General Arthur Holland"]}, {"page": "Battle of Hill 70", "response": ["Horne began to make plans for the capture of Lens during the Third Battle of the Scarpe (3–4 May). Horne wanted the Canadian Corps to continue its operations east of Vimy Ridge to capture Méricourt and La Coulotte, which would endanger the German defences of Sallaumines Hill, south-east of Lens, as I Corps (Lieutenant-General Arthur Holland) north of the Souchez, with twelve tanks, captured Hill 65 (Reservoir Hill) and Hill 70. The attacks would envelop Lens on three sides and give forward observation officers (FOO) sight of the German defences in the city, potentially to force the 6th Army to retire without the need for a frontal attack. In May, Holland had surveyed the I Corps front, noted the importance of Hill 70 and that the Germans would make great efforts to re-capture it."]}, {"page": "Cecil Malone", "response": ["Malone dissociated himself from the Communist Party of Great Britain and joined the Independent Labour Party, which was affiliated to the Labour Party, in 1922. He was the Labour candidate for Ashton-under-Lyne in the 1924 general election, but was unsuccessful. However, following the death of Arthur Holland in 1927, Malone was elected as MP for Northampton in the ensuing 1928 by-election. He was re-elected at the 1929 general election, and served in Ramsay MacDonald's government as the Parliamentary Private Secretary to the Minister of Pensions, Frederick Roberts, in 1931. He was not re-elected in the 1931 general election."]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|Arthur Holland"]}, {"page": "Arthur Holland", "response": ["Arthur Holland may refer to:", "*Arthur Holland (British Army officer) (1862–1927), British Conservative and Unionist Member of Parliament for Northampton", "*Arthur Holland (referee) (1916–1987), English football referee of the 1950s and '60s"]}, {"page": "Arthur Edward Aveling Holland", "response": ["#REDIRECT Arthur Holland (British Army officer)"]}, {"page": "Northampton (UK Parliament constituency)", "response": ["|Sir Arthur Holland"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Arthur Holland; MP for Northampton (1924–1927)"]}, {"page": "Arthur Holland (UK politician)", "response": ["#REDIRECT Arthur Holland (British Army officer)"]}, {"page": "1928 Northampton by-election", "response": ["The sitting Conservative MP, Sir Arthur Holland died on 7 December 1927, causing a by-election. He had been the MP here since 1924, when he gained the seat from Labour."]}, {"page": "Robert Leycester Haymes", "response": ["During World War I, Haymes went to France in command of the 6th Siege Battery (September 1914). He took part in the First Battle of Ypres (October 2014) and the Battle of Neuve Chapelle (10 March 1915).  He was one of the first to establish an OP in the Battle of Neuve Chapelle.  After the Battle of Neuve Chapelle Haymes was recommended by Sir Arthur Holland KCB KCMG DSO MVO (then Brigadier General 8th Division) in despatches and in June 1915 created a Companion of the Distinguished Service Order. In 1915, he was badly wounded in the foot while in command of the 6th Siege Battery and mentioned in despatches twice. Haymes was forced to retire in 1919 on account of wounds."]}, {"page": "Greenwich Cemetery", "response": ["* Lieutenant-General Sir Arthur Holland (1862–1927), Commandant of the Royal Military Academy, died MP for Northampton"]}, {"page": "1918 New Year Honours", "response": ["*Tmp Lt.-Cmdr. Arthur Holland Asquith  Royal Naval Volunteer Reserve"]}, {"page": "General Holland", "response": ["*Arthur Holland (British Army officer) (1862–1927), British Army lieutenant general"]}]}}