{"wiki_id": "http://www.wikidata.org/entity/Q4794343", "itemLabel": "Margaret Turner-Warwick", "itemDescription": "British medical doctor and thoracic specialist (1924-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Turner-Warwick", "wikipedia_page": {"main": "Dame Margaret Elizabeth Turner-Warwick   FACP (née Harvey Moore; 19 November 1924 – 21 August 2017) was a British medical doctor and thoracic specialist. She was the first woman president of the Royal College of Physicians (1989–1992) and, later, chairman of the Royal Devon and Exeter Health Care NHS Trust (1992–1995).", "link_mentions": [{"page": "November 19", "response": ["*  1924   – Margaret Turner-Warwick, English physician and academic (d. 2017)"]}, {"page": "City of London School for Girls", "response": ["* Margaret Turner-Warwick, first female president of the Royal College of Physicians "]}, {"page": "List of people associated with University College London", "response": ["* Dame Margaret Turner-Warwick, President, Royal College of Physicians 1989–92"]}, {"page": "Leslie Turnberg, Baron Turnberg", "response": ["In 1992, on the resignation of Margaret Turner-Warwick as President of the Royal College of Physicians of London, Turnberg was elected as her successor. During his presidency, he improved the involvement of patients in the College's activities, expanded the College's premises in Regent's Park, and opened regional offices. His presidency saw the splitting off of the paediatricians and the formation of the Royal College of Paediatrics and Child Health (RCPCH), the formation of the Academy of Medical Royal Colleges (initially the Conference of Colleges), the establishment of the Academy of Medical Sciences, and the formation of bodies coordinating medical ethics and postgraduate medical training. He remained in position until 1997, when he was succeeded by George Alberti."]}, {"page": "UCL Medical School", "response": ["* Margaret Turner-Warwick, first female president elected at the Royal College of Physicians (1989-1992)"]}, {"page": "1924 in the United Kingdom", "response": ["** Margaret Turner-Warwick, physician and thoracic specialist (died 2017)"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*1991: Barbara Cartland, Stella Casey, Eugenia Charles, The Baroness Digby, Gwen Ffrangcon-Davies, Jane Gow, Malvina Major, Shirley Porter, Paddy Ridsdale, Lucie Rie, Sue Tinson, Margaret Turner-Warwick"]}, {"page": "Walthamstow Hall", "response": ["* Margaret Turner-Warwick, physician and first female president of the Royal College of Physicians."]}, {"page": "Nuffield Council on Bioethics", "response": ["* Margaret Turner-Warwick (1991-00)"]}, {"page": "Harveian Oration", "response": ["*1994 Dame Margaret Turner-Warwick, The Marvel of the Lung and Human Responsibility - A Great Contempt of God's Good Gifts?"]}, {"page": "List of presidents of the Royal College of Physicians", "response": ["*1989–1992 Dame Margaret Turner-Warwick DBE"]}]}}