{"wiki_id": "http://www.wikidata.org/entity/Q4799537", "itemLabel": "Arthur Llewelyn Davies", "itemDescription": "British lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Llewelyn_Davies", "wikipedia_page": {"main": "Arthur Llewelyn Davies (20 February 1863 – 19 April 1907) was an English barrister, but is best known as the father of the boys who were the inspiration for the stories of Peter Pan by J. M. Barrie.", "link_mentions": [{"page": "J. M. Barrie", "response": ["Arthur Llewelyn Davies died in 1907, and \"Uncle Jim\" became even more involved with the Davies family, providing financial support to them. (His income from Peter Pan and other works was easily adequate to provide for their living expenses and education.) Following Sylvia's death in 1910, Barrie claimed that they had recently been engaged to be married. Her will indicated nothing to that effect but specified her wish for \"J. M. B.\" to be trustee and guardian to the boys, along with her mother Emma, her brother Guy du Maurier and Arthur's brother Compton. It expressed her confidence in Barrie as the boys' caretaker and her wish for \"the boys to treat him (& their uncles) with absolute confidence & straightforwardness & to talk to him about everything.\" When copying the will informally for Sylvia's family a few months later, Barrie inserted himself elsewhere: Sylvia had written that she would like Mary Hodgson, the boys' nurse, to continue taking care of them, and for \"Jenny\" (referring to Hodgson's sister) to come and help her; Barrie instead wrote, \"Jimmy\" (Sylvia's nickname for him). Barrie and Hodgson did not get along well but served together as surrogate parents until the boys were grown."]}, {"page": "Sylvia Llewelyn Davies", "response": ["She met the young barrister Arthur Llewelyn Davies at a dinner party in 1889 and they became engaged shortly thereafter.Birkin, Andrew, J. M. Barrie and the Lost Boys. She married him in 1892, and they had five children, all boys: George (1893–1915), Jack (1894–1959), Peter (1897–1960), Michael (1900–1921), and Nicholas (Nico) (1903–1980)."]}, {"page": "Arthur Davies", "response": ["* Arthur Llewelyn Davies (1863–1907), father of the boys who served as the inspiration for the children of J. M. Barrie's stories of Neverland"]}, {"page": "Llewelyn Davies boys", "response": ["The Davies boys (the middle name Llewelyn was a tradition begun with their grandfather, not a true double-barreled surname, though the family sometimes treated it as such) were the inspiration for J. M. Barrie's Peter Pan, in which several of the characters were named after them. They were the sons of Sylvia (1866–1910) and Arthur Llewelyn Davies (1863–1907). Their mother was a daughter of French-born cartoonist and writer George du Maurier and sister of actor Gerald du Maurier, whose daughter was author Daphne du Maurier. Their father was a son of preacher John Llewelyn Davies, and brother of suffragist Margaret Llewelyn Davies."]}, {"page": "Oliver Millar", "response": ["Millar was born in Standon in Hertfordshire.  He was the elder son of Gerald Millar, MC and his wife Ruth.  His paternal grandmother, Beatrix (\"Trixie\"), was the daughter of author George du Maurier and the sister of Gerald du Maurier (himself the father of Daphne du Maurier) and Sylvia Llewelyn Davies (whose children with Arthur Llewelyn Davies were adopted by J.M. Barrie); she had married Charlie Millar in the 1880s.Footnote to letter from Peter Llewelyn Davies to J. M. Barrie, 20 June 1916; Letter from George du Maurier to Tom Armstrong, 25 March 1890."]}, {"page": "The Lost Boys (miniseries)", "response": ["*Arthur Llewelyn Davies - Tim Pigott-Smith"]}, {"page": "St John-at-Hampstead", "response": ["*Arthur Llewelyn Davies and his wife Sylvia (née du Maurier) who befriended J M Barrie and whose children inspired Peter Pan", "*John Llewelyn Davies, preacher and theologian, father of Arthur Llewelyn Davies and Margaret Llewelyn Davies"]}, {"page": "History of labour law in the United Kingdom", "response": ["***May E. Abraham and Arthur Llewelyn Davies, Law relating to Factories and Workshops (London, 1897 and 1902)"]}, {"page": "Egerton House, Berkhamsted", "response": ["London barrister Arthur Llewelyn Davies and his wife Sylvia moved with their five sons in 1904 from Kensington Park Gardens in London to live in Egerton House. By this time, the family had become close friends with the Scottish author and playwright J.M. Barrie, who had based his Peter Pan on stories he had made up for the children while they lived in Kensington (the character of Peter Pan was based on the boys but named after Peter Llewelyn Davies). Barrie's play, Peter Pan, or The Boy Who Wouldn't Grow Up, debuted at London's Duke of York's Theatre in the same year."]}, {"page": "Peter and Alice", "response": ["*Stefano Braschi as Arthur Llewelyn Davies / Reginald Hargreaves / Michael Llewelyn Davies", "* Christoper Leveaux for Peter Pan, Arthur Llewelyn Davies, Reginald Hargreaves and Michael Llewelyn Davies;"]}, {"page": "Charles John Crompton", "response": [":* Arthur Llewelyn Davies (1863–1907) who married Sylvia du Maurier, their sons, the Llewelyn Davies boys, inspired the story of Peter Pan."]}, {"page": "Moya Llewelyn Davies", "response": ["In 1910, she married lawyer Crompton Llewelyn Davies, a brother of Arthur Llewelyn Davies and uncle of the boys who inspired the creation of Peter Pan. They had two children: Richard and Catherine."]}, {"page": "Dorothea Ponsonby", "response": ["She was a close friend of the Llewelyn Davies' family, a connection that started with her mother, Elizabeth Maude Herbert, who was friends (and admirer) of Margaret Llewelyn Davies, and Dolly became friends with Arthur Llewelyn Davies and in particular close friend with Sylvia du Maurier. She was also a close friend of J. M. Barrie."]}, {"page": "Theodora Llewelyn Davies", "response": ["Theodora Llewelyn Davies was born in Birkenhead on 18 April 1898 to Maurice Llewelyn Davies and May Roberts. She was one of three children with brother Roland and sister Mary. Her mother died in childbirth when she was four. Llewelyn Davies was raised by her father and her mother's sister, Nellie. She came from an illustrious family. Her father's sister was Margaret Llewelyn Davies and his brother was Arthur Llewelyn Davies. Her great aunt Emily Davies was the founder of Girton College in Cambridge, the first college for women. Her grandfather was Rev. John Llewelyn Davies, Rector of Christ Church, Marylebone, who was a strong advocate for women's education. She had a cousin Winifred Nicholson who was an artist. Her daughter is Jane Wynne Willson. Llewelyn Davies attended Birkenhead High School before going on to St. Paul’s Girls’ School in London. She studied law in London University for a year in 1916 when the First world war had created capacity with so many students away fighting. In 1917 she went to Girton College. Her brother Roland died in October 1918 in France.", "During her first dinner at the Inner Temple, her sister walked her to the door while the custodian at the hall ensured she was not harassed by newspaper reporters and ensured she got a seat she could manage with her long skirts. There were no bathrooms for women in the facility so Llewelyn Davies was given a key to the Benchers' House which had a cloakroom for women guests at social events. Her uncle Arthur Llewelyn Davies had been a member of the Inner Temple. Her cousins Sir Malcolm Macnaghten and Theo Mathew, better known as the writer ‘O’, took on her training in the chambers. She worked there for seven years taking on some dock briefs, attending assizes and written work."]}, {"page": "John Llewelyn Davies", "response": ["John Llewelyn Davies (26 February 1826 – 18 May 1916) was an English preacher and theologian, an outspoken foe of poverty and inequality, and was active in Christian socialist groups.Obituary of John Llewelyn Davies, The Times, Friday, 19 May 1916 He was an original member of the Alpine Club and the first ascendant of the Dom. His daughter was suffragist Margaret Llewelyn Davies. His son Arthur Llewelyn Davies was the father of the boys who were the inspiration for the stories of Peter Pan by J. M. Barrie. His sister Emily Davies was one of the founders of Girton College."]}]}}