{"wiki_id": "http://www.wikidata.org/entity/Q4799905", "itemLabel": "Arthur Palliser", "itemDescription": "Royal Navy admiral (1890-1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Palliser", "wikipedia_page": {"main": "Admiral Sir Arthur Francis Eric Palliser, KCB, DSC (20 July 1890 – 22 February 1956) was a prominent British naval officer during the Second World War.", "link_mentions": [{"page": "Sinking of Prince of Wales and Repulse", "response": ["About 1730, just a half-hour before sunset, Force Z was spotted by three Aichi E13A seaplanes, which had been catapulted off the Japanese cruisers Yura, Kinu and Kumano, which were escorting the transports. These aircraft continued shadowing. At about 1830, Tenedos was detached to return to Singapore, because she was running low on fuel, with instructions to contact Rear Admiral Arthur Palliser, detailed to act as liaison to RAF in Malaya,Stephen, p. 106. Phillips' intention was no longer to attack Singora, though Phillips changed course at 1900 toward Singora, to deceive the shadowing aircraft, then south toward Singapore at 2015, when darkness covered him. Tenedos dutifully reported at 2000, thereby preserving the secrecy of Phillips' position."]}, {"page": "American-British-Dutch-Australian Command", "response": ["** Rear Admiral Arthur Palliser, (British) Royal Navy, deputy commander naval forces"]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**Arthur Palliser, Fourth Sea Lord", "**Arthur Palliser, Fourth Sea Lord", "**Sir Arthur Palliser, Fourth Sea Lord", "**Sir Arthur Palliser, Fourth Sea Lord", "**Sir Arthur Palliser, Fourth Sea Lord", "**Sir Arthur Palliser, Fourth Sea Lord", "**Sir Arthur Palliser, Fourth Sea Lord", "**Sir Arthur Palliser, Fourth Sea Lord"]}, {"page": "Palliser", "response": ["* Arthur Palliser (1890–1956), British Royal Navy admiral"]}, {"page": "Fourth Sea Lord", "response": ["*Vice Admiral Sir Arthur Palliser 1944–1946"]}, {"page": "Geoffrey Layton", "response": ["In January 1942, the short-lived American-British-Dutch-Australian Command (ABDACOM) was formed, to direct Allied forces in South East Asia and the South West Pacific. On 5 January, the deputy commander of ABDA naval forces, Rear Admiral Arthur Palliser, made Layton the senior naval officer at Tanjung Priok, the port for Batavia (Jakarta), Java. His main role was organising better convoy protection."]}, {"page": "Michael Palliser", "response": ["Born in Reigate, Surrey, the son of Admiral Sir Arthur Palliser, he received his education at Wellington College and Merton College, Oxford. Appointed a Second Lieutenant 21 November 1942, he served in the Coldstream Guards during World War II. In 1947, he joined the British Diplomatic Service and held a number of appointments at home and abroad including Head of the Policy Planning Staff, Private Secretary to the Prime Minister, Minister at the British Embassy in Paris, Ambassador and Permanent Representative to the European Communities, and, from 1975–1982, Permanent Under-Secretary of State and Head of the Diplomatic Service. From April to July 1982, during the Falklands campaign, he served as Special Adviser to the Prime Minister in the Cabinet Office."]}, {"page": "Tom Phillips (Royal Navy officer)", "response": ["The earlier grounding of the carrier  left the capital ships without naval air cover. Phillips had long held the opinion that aircraft were no threat to surface ships, and so he took Force Z, consisting of HMS Prince of Wales, HMS Repulse, and four destroyers (HMS Electra, HMS Express, HMAS Vampire and HMS Tenedos) to intercept the Japanese without air cover. That decision has been discussed ever since. Force Z sailed from Singapore at 17:35 on 8 December. Admiral Phillips left his chief of staff, Rear Admiral Arthur Palliser, at the command post ashore. Phillips used HMS Prince of Wales as his flagship."]}, {"page": "East Indies Station", "response": ["|36 ||Admiral || 25px || Sir Arthur Palliser ||(1946–1948)"]}, {"page": "Alan Scott-Moncrieff", "response": ["After the war, Scott-Moncrieff was made Chief of Staff to Admiral Sir Arthur Palliser, Commander-in-Chief in the East Indies and then commanded  from 1949. He was made Chairman of the Naval Advisory Committee at the North Atlantic Treaty Organisation in 1950 and second-in-command Far East Fleet and commander of 5th Cruiser Squadron in 1951. He was appointed Commander of the Commonwealth Naval Forces serving in the Korean War in 1952 and Admiral commanding the Reserves in 1953. His last appointment was as Commander-in-Chief, Far East Fleet in 1955; in September 1955 he paid an official visit to Australia.Navy chief off to Australia The Straits Times, 13 September 1955, Page 2 He retired in 1958."]}, {"page": "List of Old Bradfieldians", "response": ["* Admiral Sir Arthur Palliser (1890 – 1956), Royal Navy officer during World War I."]}, {"page": "Arthur Francis Eric Palliser", "response": ["#REDIRECT Arthur Palliser"]}]}}