{"wiki_id": "http://www.wikidata.org/entity/Q4798813", "itemLabel": "Arthur Gibbs", "itemDescription": "English cricketer (1894-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Gibbs_(cricketer)", "wikipedia_page": {"main": "Arthur Holland Dyer Gibbs (15 April 1894 – 29 October 1963) played first-class cricket for Somerset in 1919 and 1920. He was born at Weston-super-Mare, Somerset and died at Uphill, also in Somerset. In CricketArchive's records, he is referred to as \"Holland Gibbs\", and in Wisden Cricketers' Almanack's scorecards of the matches in which he played he is \"Mr H. Gibbs\".\nGibbs was a right-handed batsman and wicketkeeper, and his club cricket was for Weston-super-Mare Cricket Club. In 1919, he came into the Somerset side for the two matches of the annual August cricket festival at Weston, batting at No 10 and keeping wicket. In the second match of the festival, against Essex, he was at the wicket when the ninth Somerset wicket fell with the score at 236 and was joined by Jimmy Bridges, who survived a dropped catch before he had scored. The pair then put on 143 for the 10th wicket in 70 minutes, which remained the Somerset first-class record until broken by Ian Blackwell and Nixon McLean more than 80 years on. The Times reported that the first 50 runs came in 40 minutes, and the second 50 in only eight further minutes. Gibbs' contribution was 41, and he was out, caught by Charles McGahey off the bowling of Essex captain Johnny Douglas, when Bridges had reached 99. Bridges never made a first-class century. In the second innings, Gibbs and Bridges were promoted to bat at No 7 and No 8, and Gibbs made 18 out of a Somerset total of just 84. Despite this success, Gibbs played only one further first-class match, and failed to score in either innings in the game against Gloucestershire at Taunton in 1920.", "link_mentions": [{"page": "List of Somerset County Cricket Club players", "response": ["* Arthur Gibbs (1919–1920) 3 matches CA"]}, {"page": "Holland Gibbs", "response": ["#REDIRECT Arthur Gibbs (cricketer)"]}, {"page": "Arthur Gibbs", "response": ["Arthur Gibbs may refer to:", "*Arthur Gibbs (cricketer), English cricketer", "*Arthur Gibbs (footballer), Australian rules footballer"]}]}}