{"wiki_id": "http://www.wikidata.org/entity/Q4798236", "itemLabel": "Arthur Charles Evans", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Charles_Evans", "wikipedia_page": {"main": "Arthur Charles Evans CBE (21 March 1916 – 18 March 2011) was best known as the author of Sojourn in Silesia: 1940 – 1945, in which he recounts his experiences of his time in World War II, between 1940 and 1945, in the prisoner-of-war camp, Stalag VIIIB.  \nThousands of young men were incarcerated in Stalag VIIIB, in Lamsdorf, by the Germans during World War II. Evans recounted these experiences both in his book, as well as on his website, Lamsdorf Remembered. The website was created due to public response from the children and grandchildren of former inmates of Stalag VIIIB, the website originally named Lamsdorf Reunited was created to record stories and photographs from that experience. Evans encountered the respected RAF pilot Douglas Bader while at Stalag VIIIB, and talked about his escape attempts in his book.  Evans himself is mentioned in a book called POW: Allied Prisoners in Europe, 1939–1945 by Adrian Gilbert who used Sojourn in Silesia for his information. Evans was a member of The National Ex-Prisoner of War Association, whose patron is Dame Vera Lynn, DBE, LLD, M.MUS, and is mentioned in the August 2001 newsletter.More recently, on his website Lamsdorf Remembered, a half-hour Radio Kent interview with Evans was published, as well as a blog called Letters from Stalag VIIIB, which is made up of Evans' letters home during his four years as a prisoner-of-war. The blog was published as a book in February 2014 by Evans' daughter Kathryn Gower.", "link_mentions": [{"page": "James Callaghan", "response": ["Callaghan was popular with Labour MPs, and was elected to the Shadow Cabinet every year while the Labour Party was in opposition from 1951 to 1964. He was now a staunch Gaitskellite on the Labour right wing. He was Parliamentary Adviser to the Police Federation from 1955 to 1960 when he negotiated an increase in police pay with then-General Secretary Arthur Charles Evans. He ran for the Deputy Leadership of the party in 1960 as an opponent of unilateral nuclear disarmament, and despite the other candidate of the Labour right (George Brown) agreeing with him on this policy, he forced Brown to a second vote. In November 1961, Callaghan became Shadow Chancellor. When Hugh Gaitskell died in January 1963, Callaghan ran to succeed him, but came third in the leadership contest, which was won by Harold Wilson. However, he did gain the support of right-wingers, such as Denis Healey and Anthony Crosland, who wanted to prevent Wilson from being elected leader but who also did not trust George Brown."]}, {"page": "Irish Guards", "response": ["*Arthur Charles Evans, writer CBE"]}, {"page": "Port Sunlight", "response": ["*Arthur Charles Evans (1916–2011), author, employed at Lever Brothers"]}, {"page": "List of people with surname Evans", "response": ["***Arthur Charles Evans (1916–2011), author of Sojourn in Silesia: 1940 – 1945"]}, {"page": "Arthur Evans (disambiguation)", "response": ["*Arthur Charles Evans (1916–2011), English author of Sojourn in Silesia: 1940–1945"]}, {"page": "List of people from Wirral", "response": ["*Arthur Charles Evans CBE (author, ex-PoW and ex-General Secretary of the Police Federation)"]}, {"page": "2011 in the United Kingdom", "response": ["**Arthur Charles Evans, World War II soldier (b. 1916)"]}, {"page": "Deaths in March 2011", "response": ["*Arthur Charles Evans, 94, British author and police officer."]}, {"page": "Arthur Charles Evans CBE", "response": ["#REDIRECT Arthur Charles Evans"]}]}}