{"wiki_id": "http://www.wikidata.org/entity/Q4799132", "itemLabel": "Arthur Howard", "itemDescription": "British actor (1910-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Howard", "wikipedia_page": {"main": "Arthur Howard (born Arthur John Steiner; 18 January 1910 – 18 June 1995) was an English stage, film and television actor.", "link_mentions": [{"page": "1995 in film", "response": ["| style=\"text-align:center;\"| 18 || Arthur Howard || style=\"text-align:center;\"| 85 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "The Dam Busters (film)", "response": ["* Arthur Howard (uncredited) as RAF Pay Clerk in NAAFI"]}, {"page": "1977 in film", "response": ["| The Haunting of Julia || Astral Films / Cinema International Corporation / Canadian Film Development Corporation || Richard Loncraine (director); Dave Humphries (screenplay); Mia Farrow, Keir Dullea, Tom Conti, Jill Bennett, Robin Gammell, Cathleen Nesbitt, Anna Wing, Edward Hardwicke, Mary Morris, Pauline Jameson, Arthur Howard, Peter Sallis, Damaris Hayman, Sophie Ward, Hilda Fenemore, Nigel Havers, Samantha Gates, Denis Lill, Julian Fellowes, Michael Bilton, Susan Porrett || Horror || Live Action"]}, {"page": "Kill or Cure (1962 film)", "response": ["*Arthur Howard — Green Glades Desk Clerk"]}, {"page": "Comedy Playhouse", "response": ["The Mallard Imaginaire (5 July 1966) starring Robert Coote, Moira Lister, Daphne Anderson and Arthur Howard. This was the pilot episode of the BBC series, The Whitehall Worrier."]}, {"page": "The Man in the White Suit", "response": ["*Arthur Howard as Roberts"]}, {"page": "List of fictional butlers", "response": ["| Cavendish || Butler to Sir Hugo Drax in James Bond movie Moonraker || Arthur Howard || 1979 ||"]}, {"page": "The Belles of St. Trinian's", "response": ["Arabella tells her father the disastrous news of Arab Boy's strength and suggests they \"nobble\" the horse, but Clarence rejects that idea. Arabella suggests he give it some thought and, should he change his mind, come to St Trinian's the next day, ostensibly for the field hockey match. Crawley and some of the sixth form girls are setting up the net for the match, when the girls run off. Crawley chases them and finds them, with two men and Miss Drownder, having a \"French lunch\", as she later reports to Fritton. Fritton explains that she need not worry: the men are former ministry inspectors Eric Rowbottom-Smith (Guy Middleton), now the school's gardener, and Wilfred Woodley (Arthur Howard), the new fencing master."]}, {"page": "Whack-O!", "response": ["* Mr Oliver Pettigrew played by Arthur Howard in 1956–60 and Julian Orchard in 1971"]}, {"page": "The Happiest Days of Your Life (film)", "response": ["* Arthur Howard as Anthony Ramsden"]}, {"page": "One of Our Dinosaurs Is Missing", "response": ["*Arthur Howard as Thumley"]}, {"page": "The Magnificent Seven Deadly Sins", "response": ["* Arthur Howard as Kenneth"]}, {"page": "Julian Orchard", "response": ["He played teacher Mr Oliver Pettigrew in the TV series Whack-O! in 1971 (the role having been created by Arthur Howard in 1956–60)."]}, {"page": "Lady Godiva Rides Again", "response": ["*Arthur Howard as Soap Publicity Man"]}, {"page": "Fiddlers Three (play)", "response": ["*Arthur Howard"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Charles Farrell, Arthur Howard, Douglas Muir, Brian Murphy, David Webb, Donald Morley"]}, {"page": "American Friends", "response": ["* Arthur Howard - Voe"]}, {"page": "The Adventures of Quentin Durward", "response": ["* Arthur Howard as the injured monk at Liege (uncredited)"]}, {"page": "Laughter in Paradise", "response": ["*Arthur Howard as passenger in train with Herbert (uncredited)"]}, {"page": "Arthur Howard (disambiguation)", "response": ["Arthur Howard (1910–1995) was a British film and television actor.", "Arthur Howard may also refer to:", "*Arthur Howard (English cricketer) (1882–1946), English cricketer active in 1921", "*Arthur Howard (New Zealand cricketer) (1866–1951), New Zealand cricketer", "*Arthur Howard (South African cricketer) (born 1936), South African cricketer active in 1961", "*Arthur Howard (politician) (1896–1971), British Member of Parliament for Westminster St George's, 1945–1950", "*Arthur Howard, American television actor; starred in Square One Television", "*Arthur Howard, American artist; cover artist for Ginger Pye"]}, {"page": "Alan Howard", "response": ["Howard was born in Croydon, Surrey, the only son of actor Arthur Howard and his wife Jean Compton (Mackenzie). His uncle was Leslie Howard, the film star,Michael Coveney \"Alan Howard obituary\" , The Guardian, 18 February 2015 while his aunt was the casting director Irene Howard. On his mother's side he was also a great-nephew of the actress Fay ComptonSheridan Morley Plays and Players, September 1969  and the novelist Sir Compton Mackenzie. He was educated at the independent school Ardingly College in Ardingly, West Sussex."]}, {"page": "Irene Howard", "response": ["Irene Mary Steiner Howard (17 June 1903 – December 1981) was a British casting director. Her brothers Leslie Howard and Arthur Howard, and nephew, Alan Howard, became successful actors. She died, aged 78, in Camden Town, North London, England."]}, {"page": "London Belongs to Me", "response": ["* Arthur Howard as Mr Chinkwell"]}, {"page": "Steptoe and Son (film)", "response": ["* Arthur Howard as Vicar"]}, {"page": "Cosh Boy", "response": ["* Arthur Howard as Registrar (uncredited)"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Arthur Howard"]}, {"page": "Rockets Galore!", "response": ["* Arthur Howard as Meeching"]}, {"page": "Bottoms Up (1960 film)", "response": ["*Arthur Howard as Oliver Pettigrew"]}, {"page": "The Story of Gilbert and Sullivan", "response": ["The film starred Robert Morley as W. S. Gilbert, Maurice Evans as Arthur Sullivan, Peter Finch as Richard D'Oyly Carte, Eileen Herlie as Helen Carte and Martyn Green as George Grossmith. Appearances were also made by Dinah Sheridan as Grace Marston, Wilfrid Hyde-White as Mr. Marston, Leonard Sachs as Smythe, Owen Brannigan as the company's principal heavy baritone, Thomas Round as the company's principal tenor, Isabel Dean as Mrs. Gilbert, Arthur Howard as the Usher in Trial by Jury, Muriel Aked as Queen Victoria and Michael Ripper as Louis.\"Cast: The Story of Gilbert and Sullivan\", Gilbert and Sullivan Archive, 17 April 2009, accessed 8 May 2019.  See also BFI.", "*Arthur Howard as Usher in Trial by Jury"]}, {"page": "Footsteps in the Fog", "response": ["* Arthur Howard as Vicar"]}, {"page": "List of British films of 1960", "response": ["|Bottoms Up||Mario Zampi ||Jimmy Edwards, Arthur Howard ||Comedy ||"]}, {"page": "Grand National Night", "response": ["*Arthur Howard as Hotel Manager "]}, {"page": "East London Cemetery", "response": ["* Arthur Howard"]}, {"page": "The Intruder (1953 film)", "response": ["* Arthur Howard as Bertram Slake"]}, {"page": "One Way Out (film)", "response": ["* Arthur Howard as Marriott"]}, {"page": "Law and Disorder (1958 film)", "response": ["* Arthur Howard as Burrows"]}, {"page": "The Best House in London", "response": ["* Arthur Howard - Mr. Fortnum"]}, {"page": "Ladies Who Do", "response": ["*Arthur Howard as Chauffeur"]}, {"page": "Christmas Night with the Stars", "response": ["Broadcast on Thursday 25 December 1958. Introduced by David Nixon and starring Charlie Chester with Eric 'Jeeves' Grier, The George Mitchell Singers and The Television Toppers, The Beverley Sisters, Charlie Drake with Dave Freeman, Perry Como, Ted Ray with Kenneth Connor, David Nixon with Sheila Holt, Tony Hancock with Totti Truman Taylor, Alec Bregonzi and Percy Edwards, Vera Lynn with The Lynnettes, Jimmy Edwards with Arthur Howard, John Stirling, David Langford and Jeremy Roughton, Billy Cotton and his Band with Alan Breeze and The Leslie Roberts Silhouettes, Jack Warner with Arthur Rigby, Jeannette Hutchinson, Peter Byrne, Anthony Parker, Moira Mannion and Graham Ashley.", "Broadcast on Sunday 25 December 1960. Introduced by David Nixon and starring The Mitchell Minstrels, The Television Toppers, Sid James with Bill Kerr, Liz Fraser, Sydney Tafler, Nina and Frederik, Harry Worth with Deryck Guyler, Hugh Lloyd, George Roderick, Kenneth McKellar with The Showtime Dancers, David Nixon and Robert Harbin, Stanley Baxter and Betty Marsden, Joan Regan, Jimmy Edwards with Arthur Howard, Cyril Fletcher, Pip Hinton, Eric Robinson, Johnny Vyvyan, Chan Canasta, The Showtime Dancers and the George Mitchell Singers"]}, {"page": "The Constant Husband", "response": ["* Arthur Howard as Clerk of the Court"]}, {"page": "Hardcore (1977 film)", "response": ["* Arthur Howard as Vicar"]}]}}