{"wiki_id": "http://www.wikidata.org/entity/Q4798132", "itemLabel": "Arthur Bunting", "itemDescription": "English rugby league footballer and coach (1936-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Bunting", "wikipedia_page": {"main": "Arthur Bunting (13 June 1936 – 7 June 2017) was an English professional rugby league footballer who played in the 1950s and 1960s, and coached in the 1960s, 1970s and 1980s. He played at club level for Hull Kingston Rovers, as a scrum-half, i.e. number 7, and coached at club level for Hull Kingston Rovers and Hull F.C.", "link_mentions": [{"page": "Hull Kingston Rovers", "response": ["* Arthur Bunting (237) 1959 – circa 1968"]}, {"page": "Hull F.C.", "response": ["With the coaching appointment of Arthur Bunting in 1978, Hull F.C. began a period of dominance. Hull F.C. won all of their 26 Division Two matches in 1978–79, the only time a club has won all of its league matches in a season and returning to the top flight. The Airlie Birds lost the 1980 Challenge Cup final against Hull Kingston Rovers 10–5 and never won at Wembley until 2016. It was reputed that a makeshift sign was left on the A63 (the major westerly road out of Hull) that read \"last one out turn the lights off!\" due to most of the city travelling to Wembley for the final. In 1982, Hull F.C., crushed by Widnes in the Premiership Final, avenged the defeat with an 18–9 Challenge Cup replay win at Elland Road.", "* Arthur Bunting 1978–85"]}, {"page": "1984–85 Challenge Cup", "response": ["|colspan=\"4\"| Arthur Bunting"]}, {"page": "1982 Kangaroo tour of Great Britain and France", "response": ["|colspan=\"4\"| Arthur Bunting"]}, {"page": "1980 New Zealand rugby league tour of Great Britain and France", "response": ["Hull F.C.: George Robinson, Graham Walters, Chris Harrison, Tim Wilby, Paul Prendiville, Ian Wilson, Clive Pickerill, Keith Tindall, Ian Crowther, Vince Farrar, Charles Birdsall, Keith Boxall, Sammy Lloyd. Res – Robert Gaitley, Charlie Stone. Coach – Arthur Bunting"]}, {"page": "Bunting (surname)", "response": ["*Arthur Bunting, British rugby league footballer and coach"]}]}}