{"wiki_id": "http://www.wikidata.org/entity/Q4798790", "itemLabel": "Arthur Gaskin", "itemDescription": "English illustrator, painter, teacher and designer of jewellery and enamelwork", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Gaskin", "wikipedia_page": {"main": "Arthur Joseph Gaskin RBSA (16 March 1862 – 4 June 1928) was an English illustrator, painter, teacher and designer of jewellery and enamelwork.\nGaskin and his wife Georgie Gaskin were members of the Birmingham Group of Artist-Craftsmen, which sought to apply the principles of the Arts and Crafts movement across the decorative arts. Like many of the group, Gaskin studied at the Birmingham School of Art under Edward R. Taylor and later taught there.", "link_mentions": [{"page": "Chipping Campden", "response": ["H. J. Massingham, the rural writer who celebrated the traditions of the English countryside, also settled near the town, as did Arthur Gaskin. Ananda Coomaraswamy, the Sri Lankan philosopher and art critic and his wife the handloom weaver Ethel Mairet, settled at Broad Campden where Ashbee adapted the Norman chapel for him.Norman Chapel House, British Listed Buildings, Retrieved 21 October 2015"]}, {"page": "Birmingham Guild of Handicraft", "response": ["The Guild also produced fine books under the 'Press of the Birmingham Guild of Handicraft, Limited' and a periodical titled The Quest.  The Quest began in November 1894 and aimed to appear three times a year, but was short-lived. William Morris was a contributor.  Those involved with the Press were Ernest Treglown, Arthur Gaskin, and Charles March Gere. Charles Carr and Mary Newill were book illustrators for the Guild.  The Press was still active in 1919, when it published Memorials: The Work of the Architect and Craftsman in the Design and Execution of War Memorials."]}, {"page": "Joseph Southall", "response": ["Although Southall was never on the staff of the Birmingham School of Art, he maintained close friendships with the core of staff and pupils at the school who would later be identified as the Birmingham Group of Artist-Craftsmen - introducing artists such as Henry Payne, Maxwell Armfield and Arthur Gaskin (a lifelong friend) to his methods during technical demonstrations at his studio in Edgbaston."]}, {"page": "Birmingham Group (artists)", "response": ["File:Culhwch (1900).jpg|Kilhwych, The King's Son (1901) by Arthur Gaskin", "* Arthur Gaskin (1862–1928)"]}, {"page": "Georgie Gaskin", "response": ["With her husband Arthur Gaskin, Georgie was one of the original members of the Birmingham Group of Artist-Craftsmen which formed around Joseph Southall in the 1890s, and reflected the influence of the Arts and Crafts movement at the Birmingham School of Art under the headmastership of Edward R. Taylor.", "thumb|ABC an Alphabet (1895) by \"Mrs Arthur Gaskin\"", "Georgie France was born in Shrewsbury, the elder daughter of William Hanmer France and Frances Emily Cave-Brown-Cave. She studied at the Birmingham School of Art, while there she met Arthur Gaskin, who also studied, as well as taught, there. They married on 21 March 1894. and had two daughters, Joscelyne (b. 1903) and Margaret (b. 1907). Arthur and Georgie Gaskin began their married life living in Acocks Green, Birmingham, before moving to Olton, Solihull. Another move, in 1924, took them to the High Street in Chipping Campden. A few years after Arthur's death in 1928, Georgie moved to West Malling, Kent where she died in 1934. They are buried together, in the churchyard of St James's Church in Chipping Campden.", "The Gaskins were leading jewellers of the Arts and Crafts movement, mostly in the Birmingham area. In 1899 the Gaskins started producing jewellery together, under the name of Mr and Mrs Arthur Gaskin. Despite having no technical expertise initially, they learnt many skills and employed others where necessary.  Georgie designed all of the jewellery that they made together, though both were involved in making it. "]}, {"page": "List of people from Wolverhampton", "response": ["* Arthur Gaskin (1862–1928) – illustrator, painter, teacher and designer of jewellery and enamelwork; he and his wife Georgie Gaskin were members of the Birmingham Group"]}, {"page": "Bernard Sleigh", "response": ["Born in Birmingham, Sleigh was apprenticed to a wood engraver at the age of 14 and attended the Birmingham School of Art. He was a student of Arthur Gaskin (1862–1928), who had worked with Edward Burne-Jones. While at the school, he came under the influence of the Birmingham Group. Being especially skilled in wood engraving, he soon caught the public eye through his engravings for books. He joined the Society of Mural Decorators and Painters in Tempera. His advertising after 1918 says he could do wall paintings, memorial windows and inscriptions in metal. At exhibitions of the Royal Birmingham Society of Artists, he offered to create furniture inlays. In 1897 he became a member of the Bromsgrove Guild, receiving commissions for decorating churches such as Wallasey Memorial Unitarian Church in Cheshire, and designing stained-glass windows.", "Sleigh retired to Chipping Campden in 1937, like his mentor Arthur Gaskin, moving into Old Forge Cottage in Cider Mill Lane. His imagery by then had turned from romantic medievalism to a world peopled by fairies and elves.Methodist Church  He died on 7 December 1954, leaving an estate valued at £2,187, and probate was granted to Miss Ivy Ann Ellis.Sleigh Bernard in Probate Index for 1955 at probatesearch.service.gov.uk, accessed 29 June 2019 Ellis had been \"his regular collaborator and constant companion right up until the time of death\". Research done by private company, accessed 18 August 2020. "]}, {"page": "Arthur Joseph Gaskin", "response": ["#REDIRECT Arthur Gaskin"]}, {"page": "Maxwell Armfield", "response": ["Born to a Quaker family in Ringwood, Hampshire, Armfield was educated at Sidcot School and at Leighton Park School. In 1887 he was admitted to the Birmingham School of Art, then under the headmastership of Edward R. Taylor and considered a major centre of the Arts and Crafts Movement. There he studied under Henry Payne and Arthur Gaskin and, outside of the school, received instruction in tempera painting from Joseph Southall at Southall's studio in Edgbaston."]}, {"page": "John D. Batten", "response": ["At the end of the 1890s he turned to the painting technique of egg tempera and played an important part in its revival with Birmingham artists such as Arthur Gaskin. His Pandora in this medium was exhibited at the Royal Academy in 1913 and presented to Reading University in 1918, where it has now been restored.“Pandora by J.D. Batten”, Reading University Batten also served as a Secretary to the Society of Painters in Tempera and published in 1922 an article on The Practice of Tempera Painting."]}, {"page": "List of Birmingham City University people", "response": ["*Arthur Gaskin", "*Arthur Gaskin (also staff)"]}, {"page": "William Smedley-Aston", "response": ["He was married to Irene Smedley-Aston, who featured in many photographs, paintings, and drawings of the Arts and Crafts movement because the couple were friends with other members of the Birmingham School of Art and the Birmingham Group (artists) such as Joseph Southall, Arthur Gaskin and Maxwell Armfield. Armfield's wife Constance, née Smedley was William's first cousin. Constance was a successful writer who like her husband had attended Birmingham School of Art.“A World Fellowship”: The Founding of the International Lyceum Club for Women Artists and Writers, Grace Brockington, Academia.edu, Retrieved 21 June 2016"]}, {"page": "Art of Birmingham", "response": ["The key individual artist however was Joseph Southall, arguably the most important of all Arts and Crafts painters and the leader of the revival of painting in tempera in the late 1880s. Although he never taught at the School of Art, he provided training in tempera techniques at his studio in Edgbaston to other group members such as Arthur Gaskin and Maxwell Armfield, and exhibited widely internationally, particularly in France, where he was widely admired.", "The results of this revolution in art education were far-reaching. Over the course of the 1880s and 1890s the Birmingham School of Art became the focus of a generation of distinguished designers, all of whom had studied there and most of whom went on to teach there, who became known as the Birmingham Group. This included the stained glass designers Henry Payne, Sidney Meteyard, Florence Camm and Bernard Sleigh; the wood engravers and book illustrators E. H. New and Charles March Gere; the jewellers and metalworkers Arthur Dixon, Arthur Gaskin and Georgie Gaskin; and the furniture designers Ernest Barnsley and Sidney Barnsley.;  The influence of the school's teaching also permeated beyond this inner circle, and important work in an Arts and Crafts style was also produced by organisations such as the Birmingham Guild of Handicraft, the Bromsgrove Guild of Applied Arts, the Kynoch Press and the Ruskin Pottery; and commercial firms such as the silversmiths A. E. Jones, the stained glass workshops of T. W. Camm and Co. and the metalworkers Henry Hope and Son."]}, {"page": "Antiques Roadshow (series 29)", "response": ["– Sweet Charity necklace decorated with moonstones by Arthur & Georgie Gaskin ('Mr & Mrs Arthur Gaskin') of the Arts and Crafts Movement, £3,000"]}, {"page": "Bernard Cuzner", "response": ["Cuzner was born in Alcester in Warwickshire and initially trained as a watchmaker, before showing talent as a silversmith while taking evening classes in Redditch at the Redditch School of Art. He moved to Birmingham to train at the Vittoria Street School of Jewellery and Silversmithing, and Birmingham School of Art where he was influenced by Robert Catterson Smith and Arthur Gaskin. From 1900 he taught at the school and began designing for W. H. Haseler and Liberty & Co."]}, {"page": "List of jewellery designers", "response": ["* Arthur Gaskin"]}, {"page": "Queen Anne's Walk", "response": ["The armorial bearings on the structure are illustrated and described in Blaylock's 1985 survey. As the contemporary brass tablet affixed to the east parapet suggests, they represent the members of the Corporation of Barnstaple, viri ipsi ornatissimi & honorabiles, \"men themselves honourable and most illustrious\", who financed the building work. Nine of them are members of a tightly-knit group closely related by blood or marriage, namely: Acland, Hooper, Basset, Davie, Clevland, Chichester, both Incledons and Lethbridge (see pedigree chart illustration). In 1913 the arms shown on the entablature were repeated on twelve small escutcheons and crests in coloured enamels on small decorative brass plates stamped \"PARTRIDGE 1913\" made by May Hart Partridge (born c.1881 in Harborne, Staffordshire – died 1917), an art enameller who studied at the Birmingham School of Art. She was \"the most notorious pupil of Arthur Gaskin\".For career of Mary Hart Partridge see: Toni Lesser Wolf, Women Jewelers of the British Arts and Crafts Movement, Journal of Decorative and Propaganda Arts, Vol. 14 (Autumn, 1989), pp. 28-45 Her works are mainly in the Arts and Crafts style. She later worked at London County Council schools and at home.Occupation given in Census Returns of England and Wales, 1911 'Artist & Art Jeweller' working on own account, his wife May is an 'Art enameller' working at 'LCC and other Schools', also working at homeMapping the Practice and Profession of Sculpture in Britain and Ireland 1851-1951, University of Glasgow History of Art and HATII, online database 2011, Frederick James Partridge"]}, {"page": "William George Paulson Townsend", "response": ["Not only did Townsend contribute to the publication, he was successful in garnering contributions from several notable writers on the Arts and Crafts movement including Walter Crane, Alexander Fisher, A. Romney Green, James Guthrie, J. Illingworth Kay, May Morris, Bernard Rackham, Silvester Sparrow, Alfred Stevens and Lawrence Weaver. Articles included reviews of the works of Charles Robert Ashbee, Sidney Barnsley, Walter Crane, Bernard Cuzner, Alexander Fisher, Arthur Gaskin, Ernest Gimson, Ambrose Heal Jr., Ernestine Mills, May Morris, Charles Spooner, Heywood Sumner, Mary Seton Fraser Tytler (Mrs G. F. Watts), C.F.A. Voysey and Paul Woodroffe."]}, {"page": "Suffrage jewellery", "response": ["* Arthur Gaskin"]}, {"page": "Frederick James Partridge", "response": ["His wife, May Hart Partridge (born c.1881 in Harborne, Staffordshire - died 1917), was an art enameller who studied at the Birmingham School of Art. She was \"the most notorious pupil of Arthur Gaskin\".For career of Mary Hart Partridge see: Toni Lesser Wolf, Women Jewelers of the British Arts and Crafts Movement, Journal of Decorative and Propaganda Arts, Vol. 14 (Autumn, 1989), pp. 28-45 Her works are mainly in the Arts and Crafts style. She later worked at London County Council schools and at home.Occupation given in Census Returns of England and Wales, 1911 'Artist & Art Jeweller' working on own account, his wife May is an 'Art enameller' working at 'LCC and other Schools', also working at home"]}]}}