{"wiki_id": "http://www.wikidata.org/entity/Q4800666", "itemLabel": "Arthur Wiggins", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Wiggins", "wikipedia_page": {"main": "Arthur Frederick Reginald Wiggins (4 December 1891 – 23 July 1961) was a British rower who competed in the 1912 Summer Olympics.Wiggins was born in Bournemouth. He was educated at New College, Oxford. In 1912 he was a member of the Oxford Boat in the Boat Race. He was then a crew member of the New College eight which won the silver medal for Great Britain rowing at the 1912 Summer Olympics. Wiggins rowed for Oxford again in the Boat Race in 1913 and 1914.", "link_mentions": [{"page": "Great Britain at the 1912 Summer Olympics", "response": ["| , Beaufort Burdekin, William Fison,Thomas Gillespie, Charles Littlejohn, William Parker,Frederick Pitman, John Walker, Arthur Wiggins || Rowing", "| Robert Bourne  Beaufort Burdekin  William Fison  Thomas Gillespie  Charles Littlejohn  William Parker  Frederick Pitman  John Walker (cox)  Arthur Wiggins"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|  William Fison  William Parker  Thomas Gillespie  Beaufort Burdekin  Frederick Pitman  Arthur Wiggins  Charles Littlejohn  Robert Bourne  John Walker"]}, {"page": "Rowing at the 1912 Summer Olympics", "response": ["|  New College, OxfordWilliam Fison  William Parker  Thomas Gillespie  Beaufort Burdekin  Frederick Pitman  Arthur Wiggins  Charles Littlejohn  Robert Bourne  John Walker"]}, {"page": "The Boat Race 1929", "response": ["Cambridge were coached by Francis Escombe and P. Haig-Thomas (four-time Blue who had rowed between 1902 and 1905).  Oxford's coaches were Harcourt Gilbey Gold (Dark Blue president for the 1900 race and four-time Blue), Guy Oliver Nickalls (who had rowed three times between 1921 and 1923) and Arthur Wiggins (who had rowed for Oxford in the 1912, 1913 and 1914 races).Burnell, pp. 110–111  For the third year the umpire was Charles Burnell who had rowed for Oxford in the 1895, 1896, 1897 and 1898 races.Burnell, pp. 49, 97 Charles Kent, who rowed for Oxford in the 1891 race, was the finishing judge for the second consecutive year.Burnell, p. 49"]}, {"page": "The Boat Race 1913", "response": ["The Oxford crew weighed an average of 12 st 6.375 lb (78.9 kg),  per rower more than their opponents.  Cambridge's crew included two rowers with Boat Race experience in Sidney Swann and Ralph Shove, the former making his third appearance in the event.  The Oxford crew saw five participants return, including Leslie Wormald and cox Henry Wells who were both taking part in their third race.  Edgar Burgess, Swann, Wormald and Ewart Horsfall had all won gold medals in the men's eight at the 1912 Summer Olympics, rowing for Leander Club.  They defeated New College in the final for whom Dark Blue Arthur Wiggins rowed."]}, {"page": "The Boat Race 1914", "response": ["The Cambridge crew weighed an average of 12 st 9.25 lb (80.2 kg),  per rower more than their opponents.  The Oxford crew saw five participants return, including cox Henry Wells who was taking part in his fourth race.  Cambridge's crew also included five participants with Boat Race experience, including Sidney Swann who was making his fourth appearance in the event.  Swann and Ewart Horsfall had both won gold medals in the men's eight at the 1912 Summer Olympics, rowing for Leander Club.  They defeated New College in the final for whom Arthur Wiggins, Beaufort Burdekin and Frederick Pitman rowed."]}, {"page": "The Boat Race 1930", "response": ["Cambridge were coached by Francis Escombe, J. C. Holcroft, J. A. MacNabb (who had rowed in the 1924 race) and P. H. Thomas (a four-time Blue between 1902 and 1905).  Oxford's coaches were Stanley Garton (who had rowed three times between 1909 and 1911), P. C. Mallam (a Dark Blue from 1921 to 1924 inclusive) and Arthur Wiggins (who had rowed for Oxford in the 1912, 1913 and 1914 races).Burnell, pp. 110–111  For the fourth consecutive year the umpire was Charles Burnell who had rowed for Oxford in the 1895, 1896, 1897 and 1898 races.Burnell, pp. 49, 97  Charles Kent, who rowed for Oxford in the 1891 race, was the finishing judge for the third consecutive year.Burnell, p. 49"]}, {"page": "List of 1912 Summer Olympics medal winners", "response": ["|  New College, OxfordWilliam Fison  William Parker  Thomas Gillespie  Beaufort Burdekin  Frederick Pitman  Arthur Wiggins  Charles Littlejohn  Robert Bourne  John Walker"]}, {"page": "List of people from Bournemouth", "response": ["* Arthur Wiggins (1891–1961) rower who competed in the 1912 Summer Olympics"]}]}}