{"wiki_id": "http://www.wikidata.org/entity/Q4805457", "itemLabel": "Ashley Grimes", "itemDescription": "Footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ashley_Grimes_(footballer,_born_1986)", "wikipedia_page": {"main": "Ashley James Grimes (born 9 December 1986) is an English semi-professional footballer who plays as forward or attacking midfielder.\nBorn in Swinton, Greater Manchester, he began his career as a youth player with Manchester United. After a spell with Bolton Wanderers, he joined Manchester City in 2003. He went professional in 2006, but struggled to break into the first team and went on loan to Swindon Town in 2007 then moved to Millwall a year later. He spent the 2010–11 season on loan with Lincoln City before a permanent transfer to Rochdale at the end of the season. After two seasons with Rochdale, he moved to Bury in 2013 and then Walsall a year later. In July 2015 he signed for Barrow.", "link_mentions": [{"page": "Michael Symes", "response": ["On the final day of the January 2012 transfer deadline window, Symes rejoined his former Accrington manager John Coleman by joining Rochdale on loan for the rest of the season. He made his debut on 14 February, replacing Ashley Grimes in the 58th minute of a 1–0 loss to Scunthorpe United at Glanford Park. His first goals for the Dale came on 17 March in a 3–2 win over neighbours Oldham Athletic, a hat-trick concluding with a penalty which he won after being fouled by James Tarkowski. Two weeks later, he scored the only other goal of his 15-match loan spell, an 82nd-minute penalty in a 3–3 draw with Walsall at Spotland, having earlier missed an open goal when set up by Jean-Louis Akpa Akpro. On 14 May, he was one of four players released by new Bournemouth manager Paul Groves."]}, {"page": "Ashley Grimes", "response": ["Ashley Grimes may refer to:", "*Ashley Grimes (footballer, born 1957) (born 1957), former Irish footballer", "*Ashley Grimes (footballer, born 1986) (born 1986), English footballer"]}, {"page": "Andrew Tutte", "response": ["On 6 August 2011, Tutte made his re-debut for the club in a 2–0 loss against Sheffield Wednesday before coming off for Chris O'Grady which was last appearance before joining them. On 10 September 2011, Tutte provided assist for Ashley Grimes to score an opener in a 4–2 win over Bury. On 6 March 2012, Tutte provided assist for Jason Kennedy again to score the only goal for the club in a match against Carlisle which they lost 2–1. The next game on 10 March 2012, Tutte scored his first goal for Rochdale with a maiden strike in a 2–2 draw against Huddersfield Town. His goal was later a Goal of the season at Rochdale's end-of-season awards on Sunday night on 29 April 2012. Eventually, Tutte couldn't save Rochdale and was relegated after losing 2–1 against Chesterfield. After the 2011–12 season, The club revealed Tutte would remain as Rochdale player under contract for the next season. On 4 June 2013 Tutte further extended his Rochdale career when he signed a two-year contract."]}, {"page": "2011–12 Rochdale A.F.C. season", "response": ["|1 ||FW || ||10 ||Ashley Grimes || 3 || 0 || 2 || 0 || 5", "| Ashley Grimes", "| Ashley Grimes"]}, {"page": "Anton Forrester", "response": ["In July 2013, Forrester joined Bury of League Two on loan until 1 January 2014. He made his debut for the \"Shakers\" in the opening game of the 2013–14 season, where he came on as a substitute for Ashley Grimes 60 minutes into a 2–0 defeat to Chesterfield at Gigg Lane. On 17 August, he scored his first goal in the Football League, in a 3–0 home win over Accrington Stanley. He then scored in the next game seven days later, in a 2–2 draw at Burton Albion. Three days later, he scored again in the second round of the League Cup, in a 6–3 defeat to Norwich City at Carrow Road. The following month he scored two goals in two games against Southend United and Dagenham & Redbridge. After scoring his sixth goal just 43 seconds into a 2–1 win over York City on 29 December, his loan deal was extended until the end of the season. The goal against York was later voted the club's 'Goal of the Season' at the end of season awards dinner. He added a seventh goal to his tally in a 1–0 win over Wycombe Wanderers on 1 February. However, he suffered a knee injury against Fleetwood Town on 11 March, which brought his season to an end."]}, {"page": "Callum Camps", "response": ["Camps came through the Rochdale youth team to make his senior debut on 13 April 2013, replacing Ashley Grimes 68 minutes into a 2–2 draw with Port Vale at Spotland. In September 2013, Camps signed his first professional contract, keeping him until 2016. At the end of the 2013–14 season, Camps was awarded Maureen Peacock Youth Player of the Year."]}]}}