{"wiki_id": "http://www.wikidata.org/entity/Q4804358", "itemLabel": "Ash Atalla", "itemDescription": "Egyptian-born British television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ash_Atalla", "wikipedia_page": {"main": "Ash Atalla (born 18 June 1972) is an Egyptian-born British television producer. He has produced several British TV series such as The Office, The IT Crowd, Man Stroke Woman and People Just Do Nothing. He has also made cameo appearances in productions such as Ricky Gervais' Politics.", "link_mentions": [{"page": "Chris Morris (satirist)", "response": ["Morris was a cast member in The IT Crowd, a Channel 4 sitcom which focused on the information technology department of the fictional company Reynholm Industries. The series was written and directed by Graham Linehan (with whom Morris collaborated on The Day Today, Brass Eye and Jam) and produced by Ash Atalla. Morris played Denholm Reynholm, the eccentric managing director of the company. This marked the first time Morris has acted in a substantial role in a project which he has not developed himself. Morris' character appeared to leave the series during episode two of the second series. His character made a brief return in the first episode of the third series."]}, {"page": "University of Bath", "response": ["*Ash Atalla, TV producer"]}, {"page": "Ricky Gervais", "response": ["The Office started when Stephen Merchant had to make his own short film while on a BBC production course. In August 1999 he made a docu-soap parody, set in an office, with help from Ash Atalla who was shown a 7-minute video called 'The Seedy Boss'. Thus the character of David Brent was created. Merchant passed this tape on to the BBC's Head of Entertainment Paul Jackson at the Edinburgh Fringe, who then passed it on to Head of Comedy Jon Plowman, who eventually commissioned a full-pilot script from Merchant and Gervais."]}, {"page": "List of Egyptians", "response": ["* Ash Atalla"]}, {"page": "Look Around You", "response": ["The second series is composed of six 30-minute episodes and is presented in the pop-science vein of programmes such as Tomorrow's World. The series was directed by Tim Kirkby, and Ash Atalla (producer of The Office) worked as executive producer. Running from 31 January to 7 March 2005 on BBC Two at 10 p.m., Series 2 comprised the following episodes:"]}, {"page": "The Office (British TV series)", "response": ["The Office is a British television mockumentary sitcom first broadcast in the UK on BBC Two on 9 July 2001. Created, written and directed by Ricky Gervais and Stephen Merchant, and produced by Ash Atalla, the programme follows the day-to-day lives of office employees in the Slough branch of the fictional Wernham Hogg paper company. Gervais also stars in the series, playing the central character David Brent.", "Ash Atalla showed the tape to BBC2 head Jane Root who commissioned a series based on it. Filming took place in an office at Teddington Studios."]}, {"page": "The IT Crowd", "response": ["The IT Crowd is a British sitcom originally broadcast by Channel 4, written by Graham Linehan, produced by Ash Atalla and starring Chris O'Dowd, Richard Ayoade, Katherine Parkinson, and Matt Berry. Set in the offices of the fictional Reynholm Industries in London, revolves around the three staff members of its IT (Information Technology) department: computer programmer Maurice Moss (Richard Ayoade), work-shy Roy Trenneman (Chris O'Dowd), and Jen Barber (Katherine Parkinson), the department head/relationship manager who knows nothing about IT. The show also focuses on the bosses of Reynholm Industries: Denholm Reynholm (Chris Morris) and later, his son Douglas (Matt Berry). Goth IT technician Richmond Avenal (Noel Fielding), who resides in the dark server room, also appears in a number of episodes."]}, {"page": "Man Stroke Woman", "response": ["Man Stroke Woman is a British television comedy sketch show directed by Richard Cantor and produced by Ash Atalla and starring Amanda Abbington, Ben Crompton, Daisy Haggard, Meredith MacNeill, Nicholas Burns and Nick Frost.  In addition to being broadcast on digital channel BBC Three in the United Kingdom, all the episodes were available for streaming from the BBC website.  Series 2 started in January 2007 and is also available for streaming from the BBC website."]}, {"page": "University of Bath School of Management", "response": ["* Ash Atalla, television producer"]}, {"page": "The Office Christmas specials", "response": ["A \"clerical error\" at the BBC meant Gervais was initially omitted for consideration for a British Academy Television Award for Best Comedy Performance in 2004. Crook, Freeman and Davis were all long-listed for the award.Deans, Jason (15 January 2004). \"Gervais falls victim to BBC Bafta bungle\". MediaGuardian. Guardian News and Media. Retrieved on 21 October 2008. A last-minute reprieve allowed Gervais to be included on the list, and he went on to win the BAFTA for Best Comedy Performance. Freeman had also been shortlisted. The specials themselves won in the Best Situation Comedy category. The award was presented to Gervais, Merchant and producer Ash Atalla.\"Past Winners and Nominations - Television 2004\". British Academy of Film and Television Arts. Retrieved on 21 October 2008. At the Royal Television Society Programming Awards, the specials won in the Situation Comedy and Comedy Drama category.\"RTS Programme Awards 2003 \". Royal Television Society. Retrieved on 21 October 2008. The RTS jury commented \"The problem of writing a final episode of a much-loved comedy was fully resolved. Tim gets Dawn. Dawn gets her oil paints. Brent gets the girl and we are carried along with it all. Perfection!\"\"Jury's comments\". Royal Television Society. (archived from the original on 18 January 2005) Retrieved on 6 March 2009. Gervais was also nominated in the Comedy Performance category. The specials were nominated for Best TV Comedy at the British Comedy Awards,Armstrong, Stephen (11 November 2004). \"BBC laughs all the way to the comedy awards\". The Guardian. Guardian News and Media. Retrieved on 21 October 2008. but lost to Little Britain, though Gervais and Merchant won the Writer of the Year award.\"Past Winners 2004 \". British Comedy Awards. Retrieved on 21 October 2008."]}, {"page": "List of Copts", "response": ["* Ash Atalla, British television producer"]}, {"page": "Ash (name)", "response": ["* Ash Atalla (born 1972), British television producer"]}, {"page": "Primetime Emmy Award for Outstanding Television Movie", "response": ["| Anil Gupta and Jon Plowman, executive producers; Paul Lee, executive producer for BBC America; Ash Atalla, producer"]}, {"page": "Treloar School", "response": ["*Ash Atalla, TV producer"]}, {"page": "British Academy Television Award for Best Scripted Comedy", "response": ["|rowspan=\"4\" style=\"text-align:center;\"|2002 || style=\"background:#B0C4DE;\"|The Office (series 1)  || style=\"background:#B0C4DE;\"|Anil Gupta, Ash Atalla, Ricky Gervais, Stephen Merchant || style=\"background:#B0C4DE;\"|BBC Two ", "|rowspan=\"4\" style=\"text-align:center;\"|2003 || style=\"background:#B0C4DE;\"|The Office (series 2)  || style=\"background:#B0C4DE;\"|Ash Atalla, Anil Gupta, Ricky Gervais, Stephen Merchant || style=\"background:#B0C4DE;\"|BBC Two ", "|rowspan=\"4\" style=\"text-align:center;\"|2004 || style=\"background:#B0C4DE;\"|The Office (The Office Christmas Specials) || style=\"background:#B0C4DE;\"|Ash Atalla, Ricky Gervais, Stephen Merchant || style=\"background:#B0C4DE;\"|BBC One ", "| The IT Crowd  (series 1) || Ash Atalla, Graham Linehan, Derrin Schlesinger, Lorraine Heggessey ", "| The IT Crowd  (series 2) || Graham Linehan, Ash Atalla, Jamie Glazebrook, Barbara Wiltshire || Channel 4", "|rowspan=\"4\" style=\"text-align:center;\"|2009 || style=\"background:#B0C4DE;\"|The IT Crowd (series 3)  || style=\"background:#B0C4DE;\"|Graham Linehan, Richard Boden, Ash Atalla || style=\"background:#B0C4DE;\"|Channel 4 ", "|rowspan=\"4\" style=\"text-align:center;\"|2020 || style=\"background:#B0C4DE;\"|Stath Lets Flats (series 2)  || style=\"background:#B0C4DE;\"|Jamie Demetriou, Tom Kingsley, Seb Barwell, Ash Atalla || style=\"background:#B0C4DE;\"|Channel 4 "]}, {"page": "List of Celebrity Juice episodes", "response": ["| Ash Atalla, Daisy Goodwin"]}, {"page": "Atalla", "response": ["*Ash Atalla, a British television producer"]}, {"page": "People Just Do Nothing", "response": ["The YouTube videos were seen by producer Jon Petrie, who worked with Ash Atalla at Roughcut TV.  Petrie later explained, \"It wasn't fully-formed, but the more you watched it, the more you could see there was proper detail to the characters. I had no idea about garage, really, but I just loved them as comic creations.\" Atalla arranged to produce a pilot episode for BBC Three, released in August 2012. The pilot was the most shared video on iPlayer that month, and the BBC ordered a full series."]}, {"page": "Asim Chaudhry", "response": ["Asim Chaudhry is from Hounslow, London. In high school, Chaudhry made a play parodying the 1972 crime film The Godfather, called The Poppadom Father. On a media studies course at college, he met Hugo Chegwin, Steve Stamp, and Allan Mustafa. The group made a series of YouTube mockumentaries, filmed by Chaudhry, based on their experiences as DJs on a pirate radio station in London. The mockumentaries were seen by Ash Atalla, producer of the mockumentary series The Office, and Atalla commissioned the group to make the BBC Three series People Just Do Nothing."]}]}}