{"wiki_id": "http://www.wikidata.org/entity/Q4800650", "itemLabel": "Arthur West Haddan", "itemDescription": "British churchman and historian (1816–1873)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_West_Haddan", "wikipedia_page": {"main": "Arthur West Haddan (31 August 1816–8 February 1873) was an English churchman and academic, of High Church Anglican views, now remembered as an ecclesiastical historian, particularly for Councils and Ecclesiastical Documents relating to Great Britain and Ireland, written with William Stubbs.", "link_mentions": [{"page": "Lucius of Britain", "response": ["The first mention of Lucius and his letter to Eleutherius is in the Catalogus Felicianus, a version of the Liber Pontificalis created in the 6th century. Why the story appears there has been a matter of debate. In 1868 Arthur West Haddan and William Stubbs suggested that it might have been pious fiction invented to support the efforts of missionaries in Britain in the time of Saint Patrick and Palladius.Heal, p. 614."]}, {"page": "Anglo-Saxon law", "response": ["* Arthur West Haddan and William Stubbs, Councils of Great Britain, i.-iii. (Oxford, 1869–1878)."]}, {"page": "Image of God", "response": ["While Irenaeus represents an early assertion of the substantive view of the image of God, the specific understanding of the essence of the image of God is explained in great detail by Augustine, a fifth century theologian who describes a Trinitarian formula in the image of God. Augustine's Trinitarian structural definition of the image of God includes memory, intellect, and will. According to Augustine, \"will […] unites those things which are held in the memory with those things which are thence impressed on the mind's eye in conception.\"Augustine. \"De Trinitatae.\" Translated by Arthur West Haddan. From \"Nicene and Post-Nicene Fathers, First Series, Vol. 3.\" Edited by Philip Schaff. Buffalo, NY: Christian Literature Publishing Co., 1887, XIII.26 Augustine believed that, since humanity reflects the nature of God, humanity must also reflect the Triune nature of God. Augustine's descriptions of memory, intellect, and will held a dominant theological foothold for a number of centuries in the development of Christian Theology."]}, {"page": "De Excidio et Conquestu Britanniae", "response": ["Gildas's treatise was first published in 1525 by Polydore Vergil, but with many avowed alterations and omissions. In 1568 John Joscelyn, secretary to Archbishop Parker, issued a new edition of it more in conformity with manuscript authority; and in 1691 a still more carefully revised edition by Thomas Gale appeared at Oxford. It was frequently reprinted on the Continent during the 16th century, and once or twice since. The next English edition, described by August Potthast as editio pessima, was that published by the English Historical Society in 1838, and edited by the Rev. J. Stevenson. The text of Gildas founded on Gale's edition collated with two other manuscripts, with elaborate introductions, is included in the Monumenta Historica Britannica. Another edition is in Arthur West Haddan and William Stubbs, Councils and ecclesiastical documents relating to Great Britain and Ireland (Oxford, 1869); the latest edition is that by Mommsen in Monumenta Germaniae Historica auct. antiq. xiii. (Chronica min. iii.), 1898. The text as it is used today is thus a scholarly reconstruction; the prime witness and possibly the entire manuscript stemma may not actually preserve the original page order of the autograph.Rosenbaum, S. \"Evidence of Transmission Errors Affecting the Text of Gildas's De Excidio\" in Peritia Journal of the Medieval Academy of Ireland, Volume 31 (2021)"]}, {"page": "Councils of Clovesho", "response": ["The strongest candidate for the location of Clovesho has long been Brixworth in Northamptonshire, where the surviving Anglo-Saxon church of All Saints' Church, Brixworth is indicative of the importance of the settlement during the Anglo-Saxon period.R. H. C. Davis (1962) Brixworth and Clofesho, Journal of the British Archaeological Association, 25:1, 71, DOI: 10.1080/00681288.1962.11894762 Alternative locations have included Cliffe (previously called Cliffe-at-Hoo), AbingdonJ. Lingard (1854), The Antiquities of the Anglo-Saxon Church, J.Murphy & Co, p.91 and TewkesburySaxons in England, II, 191. (which were considered by Arthur West Haddan and William Stubbs to be based upon unreliable evidenceW. Bright (1875), Early English Church History, Oxford University Press, p.246), as well as Hitchin, Hertfordshire.Slater, Terry and Goose, Nigel. A county of small towns: the development of Hertfordshire's urban landscape to 1800, p. 191, 2008, Univ of Hertfordshire Press, , "]}, {"page": "Daniel of Winchester", "response": ["Two letters of Daniel to Boniface are preserved.Arthur West Haddan and William Stubbs, Councils, III, 304 and 343. In the second of these epistles, which was written after his loss of sight, Daniel takes farewell of his correspondent: \"Farewell, farewell, thou hundredfold dearest one.\" Another letter gives advice to Boniface on how best to weaken pagan faith in their gods.Yorke Conversion of Britain p. 102 Letters from Boniface to Daniel are still extant, where Boniface asks the bishop for a book that had previously belonged to Boniface's teacher.Lawrence Medieval Monasticism p. 63"]}, {"page": "Herbert Thorndike", "response": ["Thorndike's collected works were published in the Library of Anglo-Catholic Theology, in six volumes (1844–56), of which the last four were edited by Arthur West Haddan, the first two by another hand. These volumes included, besides the works published in Thorndike's lifetime, the following pieces left by him in manuscript*"]}, {"page": "Christian Remembrancer", "response": ["Contributors to the Christian Remembrancer included John Armstrong, Richard William Church, Charles John Ellicott (1819–1905), Robert Wilson Evans (1789–1866), Philip Freeman (1818–75), Arthur West Haddan (1816–73), Walter Farquhar Hook, Anne Mozley, John Mason Neale, John Oxlee (1779–1854), Mark Pattison, Baden Powell, James Seaton Reid (1798–1851), George Williams and Samuel Wix."]}, {"page": "Thomas Henry Haddan", "response": ["Haddan was eldest son of Thomas Haddan, solicitor, of Lime Street Square, London, by Mary Ann, daughter of John Haddan, and brother of Arthur West Haddan. He was born in London in 1814, and educated at a private school at Finchley. He matriculated at Brasenose College, Oxford, 2 July 1833, gained a scholarship there, took a double first in 1837, and graduated BA on 5 May in that year. He was Petrean fellow of Exeter College from 30 June 1837 until 11 January 1843. His essay entitled ‘The Test of National Prosperity considered’ obtained the chancellor's prize in 1838. He gained an Eldon Law Scholarship in 1840. He proceeded MA 1840, and BCL 1844 where he earnt the Vinerian Scholarship."]}, {"page": "On the Trinity", "response": ["The Retractations, which refer to it, are usually dated not later than 428. The letter to Bishop Aurelius also states that the work was many years in progress and was begun in Saint Augustine's early manhood. It was finished in his old age. Arthur West Haddan inferred from this evidence that it was written between 400, when he was forty-six years old and had been Bishop of Hippo about four years, and 428 at the latest; but it probably had been published ten or twelve years earlier, in around 417.Translator's Preface", "* Logos Library - Augustine: On the Trinity –  translated by Arthur West Haddan"]}, {"page": "Ecclesiastical history of the Catholic Church", "response": ["The first major Catholic work on the general ecclesiastical history of Ireland was that of Lanigan, Ecclesiastical History of Ireland (4 vols., 2nd ed., Dublin, 1829), reaching only to the beginning of the 13th century. A single volume work is that of the Franciscan Michael John Brenan, Ecclesiastical History of Ireland (2nd edition, Dublin, 1864).Works dealing with particular epochs and aspects of Irish history: Arthur West Haddan and William Stubbs, Councils and Ecclesiastical Documents relating to Great Britain and Ireland (London, 1873); William Maziere Brady, \"The Episcopal Succession in England, Scotland and Ireland, 1400-1873\" (Rome, 1876); James Ware and Walter Harris, \"History of the Bishops, Antiquities, and Writers of Ireland\" (non-Catholic, 3 vols., Dublin, 1739-1845); Sylvester Malone, \"Church History of Ireland from the Anglo-Norman Invasion to the Reformation\" (Dublin, 1882); O'Hanlon's \"Lives of the Irish Saints\"; Killen, \"Ecclesiastical History of Ireland\" (Presbyterian, London, 1875). Good Catholic accounts of the early Irish Church are those of Greith (Freiburg, 1867), Moran (Dublin, 1864), Gargan (Dublin, 1864), Salmon (Dublin, 1900). Protestant views were set forth by Stokes, \"Ireland and the Celtic Church to 1172\" (London, 1886), Loofs (1882), and Zimmer (1907). For a good bibliography of Irish ecclesiastical history see Bellesheim, \"Gesch. der kathol. Kirche in Irland\" (3 vols., Mains, 1890-)."]}, {"page": "Library of Anglo-Catholic Theology", "response": ["*John Bramhall, 5 volumes, edited by Arthur West Haddan", "*Herbert Thorndike, 6 volumes, edited by Arthur West Haddan"]}, {"page": "List of English translations from medieval sources: A", "response": ["* The works of Aurelius Augustine (1872–1876).Augustine, S., Dods, M. (1872-1876). The works of Aurelius Augustine. Edinburgh: T. & T. Clark. Edited by Marcus Dods (1834–1909).Gray, William Forbes (1912). \"Dods, Marcus\". In Dictionary of National Biography, 1912 Supplement. 1. London. pp. 510-512. Translated by:  M. Dods; John Richard King (1835–1907); Robert Ernest Wallis (1820–1900); J. G. Pilkington; James Innes (1832–1894); John Gibb (1835–1915); S. D. F. Salmond (1838–1905) William Findlay (born 1830); Arthur West Haddan (1816–1873); John George Cunningham (born 1835); Richard Stothert (1833–1898); and Peter Holmes (1815–1878)."]}]}}