{"wiki_id": "http://www.wikidata.org/entity/Q4800588", "itemLabel": "Arthur Wakerley", "itemDescription": "British architect and politician (1862-1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Wakerley", "wikipedia_page": {"main": "Arthur Wakerley (1862–4 April 1931) was a British architect, businessman and politician.", "link_mentions": [{"page": "Highfields, Leicester", "response": ["In 1898, the respected local architect Arthur Wakerley designed the Highfield Street synagogue. This place of worship served a newly established Jewish community that was beginning to settle in the area."]}, {"page": "North Evington", "response": ["The area was designed and constructed as a suburb by Arthur Wakerley from the 1880s onwards.  By the First World War the area was entirely developed.  The area, which was originally outside the borough boundary, was annexed to the borough of Leicester in 1892."]}, {"page": "Modern Style (British Art Nouveau style)", "response": ["File:Bâtiment_Art_Nouveau_à_Leicester.jpg|The Turkey Cafe by Arthur Wakerley (1900)"]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Arthur Wakerley (architect)"]}, {"page": "Welford Road Cemetery", "response": ["* Arthur Wakerley – architect"]}, {"page": "Coleman, Leicester", "response": ["The area was designed and constructed as a suburb, by Arthur Wakerley from the 1880s onwards.  By the First World War the area was entirely developed.  The area, which was originally outside the borough boundary, was annexed to the borough of Leicester in 1892."]}, {"page": "Turkey Cafe", "response": ["The site of the Turkey Cafe was owned by James Wesley, a grocer and confectioner, from 1877 to 1899. Wesley sold the site to architect Arthur Wakerley, a well-known Leicester architect who was also a prominent supporter of the Temperance Movement. Upon completion he leased it to John Winn, who owned a number of other cafes in Manchester and the Oriental Cafe in Leicester. The offices of Wakerley's architectural practice were above Winn's Oriental Cafe, making it easy to negotiate a deal regarding the construction and occupancy of a new cafe on Granby Street. Wakerley approached the Royal Doulton Company for help constructing his design for the new \"Turkey Cafe\".Farquhar 1987, pp. 3–4"]}, {"page": "List of lord mayors of Leicester", "response": ["*1897 Arthur Wakerley"]}]}}