{"wiki_id": "http://www.wikidata.org/entity/Q4800191", "itemLabel": "Arthur Rullion Rattray", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Rullion_Rattray", "wikipedia_page": {"main": "Rear Admiral Sir Arthur Rullion Rattray  (2 May 1891 – 10 August 1966) was a British naval officer who served in the Royal Indian Marine, and also on attachment to the Royal Naval Flying Service / Royal Flying Corps. He later rose to senior rank in the Royal Indian Navy during World War II.", "link_mentions": [{"page": "Royal Indian Navy mutiny", "response": ["On 19 February, the commander-in-chief of the Royal Indian Navy, John Henry Godfrey sent out a communication via the All India Radio, stating that the most stringent measures would be utilised to suppress their mutiny, including if necessary the destruction of the Navy itself. Rear Admiral Arthur Rullion Rattray, second-in-command to the Royal Indian Navy, and the commanding officer at the Bombay Harbour conducted an inspection in person which confirmed that the unrest was widespread and beyond his control. Rattray insisted on a parley with the mutineers but Auchinleck and Godfrey were both opposed to the idea. The events at HMIS Talwar had motivated sailors across Bombay and the Royal Indian Navy to join in by the prospects of a revolution to overthrow the British Raj and in solidarity with the grievances of their naval fraternity."]}, {"page": "No. 104 Squadron RAF", "response": ["The squadron was formed at Wyton, England on 4 September 1917 equipped with the DH 9. It then moved to Andover, prior to being posted to France in May 1918 to form part of the Independent Air Force. The squadron later began re-equipping with the Airco DH.10 Amiens, however the armistice arrived before this was completed and the squadron returned home, first to Turnhouse and then to Crail where it disbanded on 30 June 1919. Eight flying aces served within its ranks, including future Rear Admiral Arthur Rullion Rattray, Jeffrey Batters Home-Hay, William Bottrill, Richard Gammon and W. Harrop."]}, {"page": "William Harrop (RAF officer)", "response": ["Sergeant Harrop served as an observer/gunner aboard the Airco DH.9s of 104 Squadron, teamed with Lt. George Smith. He drove down a Pfalz D.III over Boulay Airfield on 1 August 1918 for his first victory. On a morning patrol on the 12th, Harrop and Smith destroyed another Pfalz D.III, aided Arthur Rullion Rattray and his pilot in destroying an Albatros D.V, and drove down a third German fighter out of control over Saverne. One of these victories was over Vfw. Heinrich Krueger of Jasta 70. Three days later, at 1830 hours, Harrop and Smith drove another Pfalz down out of control, to make both men aces. Both were taken prisoner on 22 August 1918 after a raid on Mannheim. Harrop's final score was 1 (& 1 shared) destroyed, 2 (& 1 shared) 'out of control'.Franks et.al. (1997), p. 87."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Arthur Rullion Rattray"]}, {"page": "1948 New Year Honours", "response": ["* Rear-Admiral Arthur Rullion Rattray, , Royal Indian Navy, Flag Officer, Bombay (dated 14 August 1947)."]}, {"page": "1945 Birthday Honours", "response": ["*Rear-Admiral Arthur Rullion Rattray, CIE, Royal Indian Navy."]}, {"page": "1943 New Year Honours", "response": ["*Commodore Arthur Rullion Rattray, Royal Indian Navy."]}, {"page": "Martin Henry St. Leger Nott", "response": ["In mid-1945, Nott moved to Karachi as the Naval Officer-in-Charge (NOIC), based out of HMIS Monze. On 1 November 1945, he was appointed Director of Training and Education at Naval HQ. This stint was to be of immense help post-Independence when most of the training establishments were allotted to Pakistan. In April 1946, Nott was appointed Chief Staff Officer (CSO) to the Flag Officer Bombay (FOB), Rear Admiral Arthur Rullion Rattray. After a short stint, in February 1947, he took command of HMIS Venduruthy as the Naval Officer-in-charge Cochin. Soon after taking over, he saw the potential of the base and envisioned the development of Cochin as a combined training base. With Nott's efforts, multiple training establishments were set up in Cochin. On 31 May 1947, he was promoted to the substantive rank of captain."]}]}}