{"wiki_id": "http://www.wikidata.org/entity/Q4805369", "itemLabel": "Ashley Blake", "itemDescription": "British newsreader", "wikipedia_url": "https://en.wikipedia.org/wiki/Ashley_Blake", "wikipedia_page": {"main": "Ashley Blake (born 1969 in Lozells, Birmingham, England) is a British former television presenter and newsreader. A well-known personality in the English Midlands, he worked mostly for the BBC, where his credits include reporting and presenting on Midlands Today, the region's edition of Inside Out, and briefly on the TV series Watchdog. In September 2009 he was sentenced to two years' imprisonment after being convicted of wounding. He was released on 8 June 2010, after serving nine months of his sentence, as part of the home curfew system for early release. He is now a Sky News reporter.", "link_mentions": [{"page": "Blake (surname)", "response": ["*Ashley Blake (born 1969), British television presenter"]}, {"page": "BBC Birmingham", "response": ["*Ashley Blake"]}, {"page": "Midlands Today", "response": ["Former presenters have included Tom Coyne, Kay Alexander (the programme's longest serving presenter), Alan Towers, Alastair Yates, David Davies, Sue Beardsmore, Stuart Linnell, Matt Smith, Julian Worricker, Ashley Blake (who was sacked in August 2009 after a criminal court case), Suzanne Virdee and Jackie Kabler."]}, {"page": "Watchdog (TV programme)", "response": ["For the 1993 series, the BBC decided upon assigning Anne Robinson as the new host of Watchdog. This decision had a change in style brought about by Robinson's style of presenting, including her approach to interviews with notable figures from within the companies featured in investigations on the programme. For her first series, she was teamed up with Simon Walton and Alice Beer, the latter having been an assistant producer until she was brought on as a co-presenter, assigned with being a link between the consumers (on the phone in earlier years, and e-mail in later years) and the main presenter. Walton left after the first series, while Beer remained until 1999, whereupon she was replaced by Charlotte Hudson, who remained until 2001. Because of her workload requiring her to be present with hosting the British and American versions of The Weakest Link, Robinson also left the programme that same year. Following Robinson's departure, the BBC replaced her with Nicky Campbell as the programme's main presenter, with Paul Heiney joining a year later as a regular co-presenter of his team; additional co-presenters in the team were changed during Campbell's tenure, and included Ashley Blake, Saima Mohsin, Nick Lawrence, and Dan Penteado. Between 2001 and 2004, Campbell was joined by Kate Gerbeau as the other main presenter of the programme, while between 2005 and 2009, he was joined by Julia Bradbury, who was temporarily replaced during her last series in 2009 by Anita Rani between 6 February and 20 April;\"Asian journalist Anita Rani replaces Julia Bradbury as Watchdog host\" Thaindian News, 3 March 2009 Rani was retained as a reporter following this, taking the place of Mohsin.", "| 2002–04 || Paul Heiney and Ashley Blake"]}, {"page": "HM Prison Birmingham", "response": ["* Ashley Blake, television presenter"]}, {"page": "HM Prison Stafford", "response": ["* Ashley Blake, television presenter"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Ashley Blake – presenter and reporter on BBC London News and 'Watchdog' during the early-2000s: he also briefly presented BBC Breakfast. He then presented Midlands Today in his native Birmingham, until he was sacked in 2009 following a criminal court case. "]}, {"page": "Category talk:British journalists", "response": ["Ashley Blakenot yet classified"]}, {"page": "Mary Rhodes", "response": ["In 2011, she took over as presenter of BBC West Midlands show Inside Out after the programme went through several guest presenters following the sacking of previous presenter Ashley Blake. Rhodes also became a reporter on Midlands Today alongside her Inside Out duties and, in 2012, she became the main presenter of Midlands Today when Suzanne Virdee left the programme. She shares main presented duties with Nick Owen."]}, {"page": "Nativity!", "response": ["*Ashley Blake as himself"]}, {"page": "Birmingham Metropolitan College", "response": ["* Ashley Blake†"]}]}}