{"wiki_id": "http://www.wikidata.org/entity/Q480033", "itemLabel": "Frank Roy", "itemDescription": "British politician (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Roy", "wikipedia_page": {"main": "Frank Roy (born 29 August 1958) is a former British Labour Party politician, who was the Member of Parliament (MP) for Motherwell and Wishaw from 1997 to 2015. He was a Government Whip and Lord Commissioner of HM Treasury from 2006 to 2010, after having served as an Assistant Whip from 2005.", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Frank Roy", "| Frank Roy"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Frank Roy"]}, {"page": "Jim Murphy", "response": ["From 1999 to 2001, Murphy was a member of the Public Accounts Select Committee, which oversees public expenditure. In February 2001, he was appointed as the Parliamentary Private Secretary (PPS) to Helen Liddell, the Secretary of State for Scotland, after the resignation of Frank Roy over the Carfin Grotto fiasco. Upon becoming a PPS, he stood down from his previous other roles as the Vice Chair of the Labour Party's Treasury, Northern Ireland and Culture, Media and Sport Committees."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Motherwell and Wishaw || Frank Roy || Labour || (boundary changes) || Labour"]}, {"page": "Motherwell and Wishaw (UK Parliament constituency)", "response": ["| 1997 || Frank Roy || Labour"]}, {"page": "List of United Kingdom MPs: R", "response": ["*Frank Roy"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Frank Roy, Motherwell and Wishaw, 1997–2015"]}, {"page": "Our Lady's High School, Motherwell", "response": ["* Frank Roy, former MP (1997-2015)"]}, {"page": "Motherwell College", "response": ["*Frank Roy"]}, {"page": "List of MPs for constituencies in Scotland (2005–2010)", "response": ["|Frank Roy"]}, {"page": "Brown ministry", "response": ["| Frank Roy"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Frank Roy", "**Frank Roy", "**Frank Roy"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Motherwell and Wishaw||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Frank Roy (L)||Seat held"]}, {"page": "List of MPs for constituencies in Scotland (2010–2015)", "response": ["|Frank Roy"]}, {"page": "2010 Labour Party leadership election (UK)", "response": ["*David Miliband (81): Bob Ainsworth, Douglas Alexander, Willie Bain, Gordon Banks, Hugh Bayley, Stuart Bell, Ben Bradshaw, Russell Brown, Richard Burden, Liam Byrne, David Cairns, Alan Campbell, Jenny Chapman, Ann Clwyd, Ann Coffey, Rosie Cooper, Mary Creagh, Stella Creasy, Alex Cunningham, Simon Danczuk, Alistair Darling, Gloria De Piero, Brian Donohoe, Gemma Doyle, Angela Eagle, Julie Elliott, Louise Ellman, Chris Evans, Jim Fitzpatrick, Caroline Flint, Paul Flynn, Mike Gapes, Barry Gardiner, Pat Glass, Mary Glindon, Fabian Hamilton, David Hanson, Tom Harris, Mark Hendrick, Margaret Hodge, George Howarth, Tristram Hunt, Alan Johnson, Tessa Jowell, Gerald Kaufman, Liz Kendall, Ivan Lewis, Michael McCann, Gregg McClymont, Siobhain McDonagh, Pat McFadden, Anne McGuire, Ian Mearns, Alun Michael, Jessica Morden, Meg Munn, Jim Murphy, Ian Murray, Pamela Nash, Fiona O'Donnell, Toby Perkins, Bridget Phillipson, Yasmin Qureshi, Nick Raynsford, Jamie Reed, Jonathan Reynolds, Frank Roy, Chris Ruane, Anas Sarwar, Virendra Sharma, Barry Sheerman, Angela Smith, Nick Smith, Peter Soulsby, Graham Stringer, Mark Tami, Gareth Thomas, Valerie Vaz, Phil Wilson, John Woodcock, Shaun Woodward", "| Frank Roy || David Miliband || None || None || None || None"]}, {"page": "2011 Scottish Labour leadership election", "response": ["Parliamentary nominations - MSPs: Claire Baker, Neil Bibby, Kezia Dugdale, Mary Fee, Mark Griffin, Ken Macintosh, Margaret McCulloch, Margaret McDougall, Jenny Marra, Michael McMahon, John Park, Graeme Pearson, Richard Simpson. MPs: Willie Bain, Gordon Banks, Alistair Darling, Russell Brown, Thomas Docherty, Brian Donohoe, Frank Doran, Gemma Doyle, Mark Lazarowicz, Anne McGuire, Jim Murphy, Frank Roy. MEPs: Catherine Stihler.", "Parliamentary nominations - MSPs: Jackie Baillie, Claire Baker, Claudia Beamish, Neil Bibby, Kezia Dugdale, Patricia Ferguson, Mark Griffin, James Kelly, Hanzala Malik, Jenny Marra, Paul Martin, Michael McMahon, Siobhan McMahon, Duncan McNeil, Anne McTaggart, John Park, Graeme Pearson, John Pentland, Drew Smith. MPs: Douglas Alexander, Willie Bain, Gordon Banks, Russell Brown, Tom Clarke, Alistair Darling, Thomas Docherty, Gemma Doyle, Sheila Gilmore, Tom Greatrex, Jim Hood, Cathy Jamieson, Eric Joyce, Mark Lazarowicz, Michael McCann, Gregg McClymont, Anne McGuire, Iain McKenzie, Jim Murphy, Ian Murray, Pamela Nash, Fiona O'Donnell, Frank Roy, Anas Sarwar. MEPs: Catherine Stihler."]}, {"page": "List of United Kingdom MPs by seniority (2010–2015)", "response": ["|214||Frank Roy||style=\"background-color: \"|Lab||Motherwell and Wishaw||rowspan=4|"]}, {"page": "List of MPs elected in the 2015 United Kingdom general election", "response": ["| Motherwell and Wishaw||style=\"background-color: \"| ||Labour||style=\"background-color: \"| || (SNP)||Seat gain, defeated incumbent Frank Roy "]}, {"page": "Marion Fellows", "response": ["In 2007, Fellows unsuccessfully contested the Motherwell and Wishaw Scottish Parliament constituency against the incumbent, then-First Minister of Scotland Jack McConnell, and then in 2010 unsuccessfully contested the Motherwell and Wishaw United Kingdom Parliament constituency, losing to the incumbent Frank Roy."]}, {"page": "List of MPs who lost their seat in the 2015 United Kingdom general election", "response": ["|data-sort-value=\"Roy, Frank\"|Frank Roy"]}, {"page": "Third Blair ministry", "response": ["! scope=\"row\" | Frank Roy", "! scope=\"row\" | Frank Roy"]}, {"page": "List of MPs for constituencies in Scotland (2001–2005)", "response": ["|Frank Roy"]}, {"page": "List of MPs for constituencies in Scotland (1997–2001)", "response": ["|Frank Roy"]}]}}