{"wiki_id": "http://www.wikidata.org/entity/Q4805326", "itemLabel": "Ashleigh Whitfield", "itemDescription": "British continuity announcer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ashleigh_Whitfield", "wikipedia_page": {"main": "Ashleigh Whitfield (born 15 March 1980) is a British continuity announcer for BBC One and BBC Two, employed by BBC and based at Media City in Manchester and Broadcast Centre in White City, London.\nWhitfield was born in Newcastle upon Tyne and after completing a degree in Media & Cultural Studies at the University of Sunderland, won a competition to become a traffic and travel presenter at Century Radio (now Real Radio, Gateshead) in 2001.\nAfter a brief stint at Trafficlink, Birmingham, Whitfield became the weekend overnight presenter at Metro Radio and then the afternoon drive presenter on Magic 1152 in 2002. She went on to broadcast on the Magic Network across the north before making a move to the Breakfast Show at 103.4 Sun FM in 2004, where she co-hosted for two years along with Simon Grundy.\nIn 2006, Whitfield became the lunchtime presenter at 103.4 Sun FM and also presented a weekend show at TFM Radio. Other voiceover works included Cineworld Sunderland, Instore Radio Productions (Dalton Park, Furniture to Go and Wynsors World of Shoes) and recording the University of Sunderland podcasts for their website.\nIn January 2009, Whitfield moved to London to become a continuity announcer for BBC One and BBC Two. She was also heard on BBC Three, BBC HD. Whitfield was one of the last voices to be heard on BBC Three, along with fellow colleagues Emily Chiswell and Duncan Newmarch.\nIn October 2012, Whitfield began presenting her own weekday programme at My Social Radio.\nIn September 2013, Whitfield returned to 103.4 Sun FM to present the weekend evening shows. She also presents the showbiz segments during the station's breakfast show and throughout the day.She is also an ambassador for the British Tinnutis Association.\nAfter a brief stint on Heat Radio and covering holidays on Sun FM until 2016, Whitfield is currently one of the BBC's main channel voices on BBC One and BBC Two, and continues to carry out voice over work for Maple Street Voices and London Voiceover.\nTo date, she has carried out voice over work for Asda, NHS, Early Learning Centre, Calender Club, Phuket FM, Music Radio Creative, Open University, Espresso Education, Barclays, British Airways, NTwine and The Perfume Shop sponsor for Blind Date. She is also editor in chief of the cool luxury lifestyle website Luxe Bible.", "link_mentions": [{"page": "Ashleigh", "response": ["*Ashleigh Whitfield (born 1980), British broadcaster"]}, {"page": "List of continuity announcers in the United Kingdom", "response": ["|Dan Blake, Lindsey Chapman, Emily Chiswell (freelancer), Jenni Crane, Russell Evans (also known as Nii Odartei Evans), Deb Grant (freelancer), Toni Green, Kieran Hammersley, Delroy Haynes, Scott Hoatson, Louise Hulland (freelancer), Matthew Jackson (freelancer), Natalie Jaque (freelancer), Chyna Johnson (freelancer), Dave Johnson, Anthony Lewis (freelancer), Dean Lydiate, Maria Major, Kath Melandri (freelancer), Duncan Newmarch, Peter Offer (freelancer),Sian Polhill-Thomas, Alyson Slorach, Mark Thompson, David Vickery, Phil Vowels, Kate Walsh, Ashleigh Whitfield, Lynsey Young", "| Lola Buckley, Emily Chiswell, Collette Collins, Kieron Elliot, Louise Hulland, Gavin Inskip, Jen Long, Duncan Newmarch, Jayne Sharp, Alyson Slorach (freelance), Jose Vanders, Ashleigh Whitfield"]}]}}