{"wiki_id": "http://www.wikidata.org/entity/Q4805582", "itemLabel": "Ashley Sammons", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ashley_Sammons", "wikipedia_page": {"main": "Ashley George Sammons (born 10 November 1991) is an English footballer who plays as a midfielder for Southern League Premier Division Central club Stratford Town.\nSammons began his career with Birmingham City, for whom he made only one appearance, in the League Cup. He moved into non-league football with Hereford United, Worcester City, Redditch United (three spells), Corby Town and Hednesford Town before joining National League club Solihull Moors in 2017. He then joined Redditch for a fourth time, initially on a dual registration, in November 2017, and left Moors in January 2018.\nHe represented his country at under-17 level.", "link_mentions": [{"page": "Martin Foyle", "response": ["Foyle was appointed manager of newly relegated Conference club Hereford United on 30 May 2012. He appointed Andy Porter as his assistant. His first signings were defender Luke Graham and goalkeeper James Bittner on free transfers from Forest Green Rovers. Three further free transfers arrived in defenders Andy Gallinagh and Chris Carruthers, and attacker Marlon Jackson. He further added wingers Marley Watkins and Ryan Bowman to bring his squad to 18 players. More youngsters arrived in the form of loanee Tom Nichols and former Birmingham City youth team midfielder Ashley Sammons."]}, {"page": "Langley School, Solihull", "response": ["*Ashley Sammons, footballer"]}, {"page": "Sammons", "response": ["* Ashley Sammons, English footballer"]}, {"page": "2008–09 Birmingham City F.C. season", "response": ["!scope=\"row\"|Ashley Sammons"]}, {"page": "Greg Sammons", "response": ["He now plays in Italy for Mogliano. His younger brother Ashley Sammons is a professional football player for Birmingham City F.C."]}, {"page": "2009–10 Birmingham City F.C. season", "response": ["!scope=\"row\"| Ashley Sammons"]}, {"page": "2010 HKFC International Soccer Sevens", "response": ["* Birmingham City: Jack Butland, Fraser Kerr, Dan Preston, Luke Rowe, Luke Hubbins, Ashley Sammons, Jake Jervis, Jordon Mutch, Brice Ntambwe"]}, {"page": "2009 HKFC International Soccer Sevens", "response": ["* Birmingham City: Jared Wilson, Krystian Pearce, Jacob Rowe, Ashley Sammons, Jake Jervis, Luke Hubbins, Shaun Timmins, Dan Preston, Tony Breeden, Jordan Mutch (Manager: Terry Westley)"]}, {"page": "2011–12 Birmingham City F.C. season", "response": ["At the end of the 2010–11 season, Birmingham released first-team players Sebastian Larsson, Kevin Phillips, Martin Jiránek, Lee Bowyer, Maik Taylor and Stuart Parnaby, and fringe players Marcus Bent, Jay O'Shea, Dan Preston and Robin Shroot. All the loanees returned to their owning clubs. The club attempted to agree a new contract with James McFadden but failed to do so before his existing deal expired. Teenage midfielders Luke Hubbins and Ashley Sammons were given contract extensions, and Belgian midfielder Brice Ntambwe and American defender/midfielder Will Packwood, both internationals at under-17 level, signed their first professional contracts.", "| 30 June 2012 || Ashley Sammons || Released || (Hereford United)"]}, {"page": "2012–13 Birmingham City F.C. season", "response": ["At the end of the 2011–12 season, Birmingham released first-team players Caleb Folan, Luke Hubbins, Cian Hughton, Ashley Sammons and Enric Vallès. In late June, goalkeeper Ben Foster's loan at West Bromwich Albion was made permanent and midfielder Jordon Mutch joined Cardiff City, both for undisclosed fees. Following publication of the 2011 accounts, and reflecting increased financial prudence and revenue raised from player sales, the Football League lifted the club's transfer embargo in early July. In the next few days, they signed three players on free transfers – Denmark international forward Peter Løvenkrands, veteran goalkeeper David Lucas, and midfielder Hayden Mullins – and paid an undisclosed fee for Crystal Palace midfielder Darren Ambrose. Lucas signed a one-year deal and the others signed for two years. Before the transfer window closed, they added two loan signings: attacking midfielder Ravel Morrison from West Ham United for the season, and Chelsea left-back Ben Gordon until January. Despite rumours linking Žigić with Real Mallorca and Butland with Everton, the only movement on deadline day was a loan swap bringing Swindon Town full-back Paul Caddis in for the season with Adam Rooney going the other way."]}, {"page": "Ashley George Sammons", "response": ["#REDIRECT Ashley Sammons"]}, {"page": "Jamie Sheldon", "response": ["Sheldon and two Birmingham team-mates, Dean Lyness and Ashley Sammons, were selected for the England under-17 squad for the Nordic Tournament in Denmark in July and August 2007. He played in all three group matches, and scored from  in the 2–1 win against Finland, but losing to Sweden meant they failed to qualify for the final. Sheldon scored again as England beat Norway 4–1 in the third-place play-off."]}]}}