{"wiki_id": "http://www.wikidata.org/entity/Q480184", "itemLabel": "Angus Robertson", "itemDescription": "British politician (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Angus_Robertson", "wikipedia_page": {"main": "Angus Struan Carolus Robertson (born 28 September 1969) is a Scottish politician serving as the Cabinet Secretary for the Constitution, External Affairs and Culture since 2021. Former Depute Leader of the Scottish National Party (SNP) from 2016 to 2018, he has served as the Member of the Scottish Parliament (MSP) for Edinburgh Central since 2021. Robertson previously served as a Westminster MP for Moray from 2001 to 2017, where he served from 2007 to 2017 as the Leader of the SNP in the House of Commons.\nA graduate of the University of Aberdeen, Robertson previously worked as a journalist. He was first elected to the House of Commons in 2001. In 2017, he sought re-election as the MP for Moray and lost to the Scottish Conservative candidate, Douglas Ross. He was succeeded as SNP Westminster Leader by Ian Blackford.\nRobertson resigned as SNP Depute Leader in February 2018, before launching the pro-independence think tank Progress Scotland in 2019, alongside Mark Diffley. In the 2021 Scottish Parliament election, Robertson was elected to the Scottish Parliament for Edinburgh Central.\n\n", "link_mentions": [{"page": "Antisemitism", "response": ["In 2016, the Home Affairs Select Committee held an inquiry into the rise of antisemitism in the UK. The inquiry called David Cameron, Tim Farron, Angus Robertson, Jeremy Corbyn, Ken Livingstone and others to give evidence."]}, {"page": "September 28", "response": ["*  1969   – Angus Robertson, Scottish politician"]}, {"page": "Scottish National Party", "response": ["At the 2017 UK general election the SNP underperformed compared to polling expectations, losing 21 seats to bring their number of Westminster MPs down to 35 – however this was still the party's second best result ever at the time. This was largely attributed by many, including former Deputy First Minister John Swinney, to their stance on holding a second Scottish independence referendum and saw a swing to the Unionist parties, with seats being picked up by the Conservatives, Labour and the Liberal Democrats and a reduction in their majorities in the other seats. Stephen Gethins, MP for North East Fife, came out of this election with a majority of just 2 to the Liberal Democrat candidate. High-profile losses included SNP Commons leader Angus Robertson in Moray and former party leader and First Minister Alex Salmond in Gordon.", "|The Right Hon. Angus Robertson (born 1969) ", "* Angus Robertson (Moray), 2007–2017", "| data-sort-value=\"Campbell\" |  Angus Robertson MSP for Edinburgh Central"]}, {"page": "Glasgow", "response": ["Voter turnout has often been lower in Glasgow than in the rest of the United Kingdom. In the Referendum of 2014 turnout was 75%, the lowest in Scotland;Who won? How Glasgow voted in Scotland's independence referendum – results map and charts  at cityam.com (retrieved 12 August 2017) in the Brexit referendum the city's voters, while joining the rest of Scotland in voting to remain part of the EU, again had a low turnout of 56.2%, although SNP MP Angus Robertson placed this in the historical context of traditional low turnout in Glasgow.EU referendum: Glasgow votes Remain by two to one  at The Scotsman website (retrieved 12 August 2017)"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["Notable newcomers to the House of Commons included David Cameron, David Miliband, Boris Johnson, John Thurso, George Osborne, Nigel Dodds, Chris Grayling, Andy Burnham, Adam Price, Alistair Carmichael, Angus Robertson, Chris Bryant, Norman Lamb, and Tom Watson (many of whom would go on to reach senior positions in government and/or their respective parties).", "| Angus Robertson"]}, {"page": "Politics of Edinburgh", "response": ["|Angus Robertson"]}, {"page": "Prime Minister's Questions", "response": ["|rowspan=\"3\"| Angus Robertson || 2015"]}, {"page": "Scottish Government", "response": ["| data-sort-value=\"Campbell\" |  Angus Robertson "]}, {"page": "List of current members of the British Privy Council", "response": ["| Angus Robertson"]}, {"page": "Adam Price", "response": ["In the 2018 Plaid Cymru leadership election Price was elected leader of Plaid Cymru with almost half of members' votes, defeating incumbent leader, Leanne Wood. Price announced a new frontbench team the following month. In October 2018, Price revealed that he had recruited the SNP's former deputy leader Angus Robertson to oversee a review of Plaid Cymru's campaign strategy. Guest speaking at that month's SNP conference, he backed calls for a second referendum on the UK's membership of the European Union, and said he and his party would campaign to remain in the EU in the event of another referendum."]}, {"page": "Anne Moffat", "response": ["On 23 May 2007, she compared the newly elected Scottish First Minister Alex Salmond to Adolf Hitler, saying \"proportional representation gave Germany Adolf Hitler and in Scotland to a lesser degree we've had the member for Banff and Buchan\" during a debate in the House of Commons on the 2007 Scottish Parliament election. Angus Robertson criticised Moffat's conduct, saying, \"It was ignorant, it was ill-judged, it was plain wrong, and it was very dangerous.\" Moffat said \"What I was referring to was the voting system, the proportional representation and electoral voting system, not about individuals. I was just giving examples.\""]}, {"page": "Pete Wishart", "response": ["In February 2018, he warned that the SNP risked alienating Scottish voters who had voted \"Leave\" in the 2016 referendum on European Union membership. In an article for The National, he wrote that his party had to \"face up\" to the reality that Scotland would be leaving the European Union, and made the case for an alternative vision of Scottish independence which involved a \"graduated\" re-entry to the European Union from  \"EEA, then EFTA then full EU membership\", stressing that the final step of rejoining the EU should only be done with the \"full consent of an independent Scottish Parliament\". Later in February, he ruled himself out of the 2018 Scottish Depute Leadership election following the resignation of Angus Robertson. Wishart concluded that he did not have \"sufficient support\" to run for the Depute Leadership of the Scottish National Party."]}, {"page": "Pola Uddin, Baroness Uddin", "response": ["Scottish National Party MP Angus Robertson called for an investigation on the report to the House of Lords authorities and the police. Uddin said, \"I do not believe that I have done anything wrong or breached any House of Lords rules.\" She stated \"I strongly deny that I have never lived there. Indeed I have stayed there regularly since buying it\"."]}, {"page": "Fiona Hyslop", "response": ["Whilst working in Edinburgh, Hyslop spent her spare time campaigning for the SNP and was an active member of the Young Scots Nationalists, the SNP's youth wing. She worked along with Charlie Reid of the Proclaimers and Angus Robertson. She worked on motions to move the SNP to a more centre-left, social democratic party. Hyslop became Vice Convener for Policy and served on the SNP Executive Committee. "]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Angus Robertson (b. 1969)"]}]}}