{"wiki_id": "http://www.wikidata.org/entity/Q4800152", "itemLabel": "Arthur Roberts", "itemDescription": "English footballer (1907-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Roberts_(footballer,_born_1907)", "wikipedia_page": {"main": "Albert Arthur Roberts (27 January 1907 – 27 January 1957), more commonly known as Arthur Roberts, was an English footballer who played as a full back for Southampton in the 1930s.", "link_mentions": [{"page": "Arthur Roberts", "response": ["Arthur Roberts may refer to:", "* Arthur Roberts (actor) (born 1938), American actor", "* Arthur Roberts (British Army officer) (1870–1917)", "* Arthur Roberts (comedian) (1852–1933), British music hall entertainer and actor", "* Arthur Roberts (film editor) (1890–1961), American film editor", "* Arthur Roberts (cricketer) (1874–1961), English cricketer", "* Arthur Roberts (footballer, born 1876) (1876–?), English football player for Stoke", "* Arthur Roberts (footballer, born 1907) (1907–1957), English football player", "* Arthur Roberts (Australian footballer) (1911–1984), Australian rules footballer", "* Arthur Roberts (physicist) (1912–2004), American physicist and composer"]}, {"page": "Arthur Roberts (footballer born 1907)", "response": ["#REDIRECT Arthur Roberts (footballer, born 1907)"]}, {"page": "1929–30 Southampton F.C. season", "response": ["Several players left Southampton at the end of the 1928–29 season. In May, inside-forward Tommy Taylor joined Welsh side Rhyl Athletic, while centre-forward Douglas Vernon – signed as an emergency replacement for Willie Haines in February – was recalled by the Royal Air Force. In June, the club sold outside-left Billy Murphy to fellow Second Division club Oldham Athletic, with fellow winger Reg Watson moving the other way as part of the deal. Also in June, the Saints signed inside-forward Bill Fraser from Aldershot Town in an \"unusually complicated deal\" including an initial payment of £60, another £200 from a friendly match between the two sides, £50 if he made 20 appearances for the first team during the season (which he did not), and a 5% share of any future transfer fee. The following month, inside-left Charlie Petrie and Scottish centre-forward Archie Waterston both moved to the Third Division North – the former joined York City, while the latter joined Tranmere Rovers. In August, Southampton brought in two more players – inside-right Oswald Littler joined from Rochdale (after a Football Association suspension for the player was lifted upon appeal by the club), and full-back Arthur Roberts signed from Ardsley Athletic.", "!scope=\"row\"|Arthur Roberts"]}, {"page": "1930–31 Southampton F.C. season", "response": ["!scope=\"row\"|Arthur Roberts"]}, {"page": "1931–32 Southampton F.C. season", "response": ["!scope=\"row\"|Arthur Roberts"]}, {"page": "1932–33 Southampton F.C. season", "response": ["!scope=\"row\"|Arthur Roberts"]}, {"page": "1933–34 Southampton F.C. season", "response": ["Southampton used 22 different players during the 1933–34 season, thirteen of whom scored during the campaign. The team played in a 2–3–5 formation throughout, using two full-backs, three half-backs, two outside forwards, two inside forwards and a centre-forward. Outside-right Dick Neal appeared in all but one of the club's league games during the campaign, while Arthur Roberts, Bill Adams and Stan Woodhouse all played in 39 of the 42 games in the Second Division. Centre-forward Ted Drake finished as the season's top scorer with 20 goals in the Second Division, followed by inside-forward Arthur Holt on six goals, then Norman Cole and Fred Tully on five each. Frank Campbell was the highest-scoring half-back of the season, with three goals during the league campaign.", "!scope=\"row\"|Arthur Roberts", "|align=\"left\"|Arthur Roberts"]}]}}