{"wiki_id": "http://www.wikidata.org/entity/Q4819165", "itemLabel": "Aubrey Menen", "itemDescription": "British satirist", "wikipedia_url": "https://en.wikipedia.org/wiki/Aubrey_Menen", "wikipedia_page": {"main": "Salvator Aubrey Clarence Menen was an English writer of Irish and Malayali parentage who was primarily a satirist. He was also a drama critic, theater director, advertising agency executive, and an alumnus of University College London.\nHis essays and novels explore the nature of nationalism and the cultural contrast between his own Irish-Indian ancestry and his traditional British upbringing.  The first sentence of \"Dead Man in the Silver Market\" offers an example of his good-humored approach to this contentious topic: \"Men of all races have always sought for a convincing explanation of their own astonishing excellence and they have frequently found what they were looking for.\"\nMenen's 1954 retelling of the classic Hindu epic Ramayana meant as a funny and readable version of the work was banned in India for some years, as devout Hindus were horrified by the liberties Menen took with a sacred text.\nMenen states that his goal is to, \"aim at reviving,\" Valmiki's, \"attitude of mind.\" Menen's humor did not undercut his love for India, however, as can be seen in his book on Hindu mystics and his text to Roloff Beny's great book of photographs of India (India, 1969).", "link_mentions": [{"page": "Olympias", "response": ["* Olympias is a character in Aubrey Menen's A Conspiracy of Women (1965)."]}, {"page": "William Beckford (novelist)", "response": ["In 1974, Aubrey Menen published Fonthill: A Comedy, a satirical portrait of Beckford."]}, {"page": "Valmiki", "response": ["British satirist Aubrey Menen says that Valmiki was \"recognized as a literary genius,\" and thus was considered, \"an outlaw,\" presumably because of his \"philosophic scepticism,\"Menen, Aubrey (1954). \"Introduction\", The Ramayana, p.4. Charles Scribner's Sons: New York. . . . as part of an \"Indian Enlightenment\" period.Menen (1954). \"The Indian Enlightenment\", p.9. Valmiki is also quoted as being the contemporary of Rama. Menen claims Valmiki is \"the first author in all history to bring himself into his own composition.\"Menen (1954). \"The Heritage of the Gluttons\", p.81."]}, {"page": "Roxana", "response": ["* Roxana appears as one of the characters in A Conspiracy of Women by Aubrey Menen, 1965."]}, {"page": "List of satirists and satires", "response": ["*Aubrey Menen (1912–1989, Britain, India) – satirist, novelist and philosopher"]}, {"page": "Fiction set in ancient Greece", "response": ["* Aubrey Menen, A Conspiracy of Women (1965) "]}, {"page": "Aubrey menen", "response": ["#REDIRECT Aubrey Menen"]}, {"page": "Agapemonites", "response": ["The Abode of Love by Aubrey Menen – \"an appallingly inaccurate popular account\" according to one review  – is a novelisation of the history of the Agapemonites under Prince's leadership."]}, {"page": "Roloff Beny", "response": ["*1969 – India, Roloff Beny and Aubrey Menen, Thames & Hudson Ltd, "]}, {"page": "List of books banned in India", "response": ["| Aubrey Menen"]}]}}