{"wiki_id": "http://www.wikidata.org/entity/Q4819157", "itemLabel": "Aubrey Manning", "itemDescription": "zoologist, broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Aubrey_Manning", "wikipedia_page": {"main": "Aubrey William George Manning, OBE, FRSE, FRSB, (24 April 1930 – 20 October 2018) was an English zoologist and broadcaster.\n\n", "link_mentions": [{"page": "Chiswick", "response": ["Notable people born before the Second World War include the cricketers Patsy Hendren (1899–1962) and Jack Robertson (1917–1996), the novelist Iris Murdoch (1919–1999) who lived on Eastbourne Road, the theatre and film director Peter Brook (1925– ), zoologist and broadcaster Aubrey Manning (1930–2018), and marine geologist Frederick Vine (1939– ). The Who rock musicians John Entwistle (1944–2002) and Pete Townshend (1945– ) were both born in Chiswick during the Second World War. Deep Purple lead singer Ian Gillan was born in Chiswick on 19 August 1945."]}, {"page": "The Wildlife Trusts", "response": ["Charles, Prince of Wales serves as the patron of the Wildlife Trusts. David Bellamy was president of The Wildlife Trusts for ten years between 1995 and 2005, and was succeeded by Aubrey Manning. Sir David Attenborough, Simon King and Tony Juniper are all Presidents Emeritus. Stephanie Hilborne OBE was chief executive for 15 years, and left in October 2019. Craig Bennett became CEO from April 6, 2020.New leader for The Wildlife Trusts rarebirdalert.co.uk accessed 14 December 2019"]}, {"page": "Manning", "response": ["* Aubrey Manning (1930–2018), English zoologist and broadcaster"]}, {"page": "David Bellamy", "response": ["His opinions changed the way some organisations viewed Bellamy. The Royal Society of Wildlife Trusts stated in 2005, \"We are not happy with his line on climate change\", and Bellamy, who had been president of the Wildlife Trusts since 1995, was succeeded by Aubrey Manning in November 2005.  Bellamy asserted that his views on global warming resulted in the rejection of programme ideas by the BBC. "]}, {"page": "Aubrey", "response": ["* Aubrey Manning (1930–2018), English zoologist and broadcaster"]}, {"page": "North Wales Wildlife Trust", "response": ["*2005 Aubrey Manning"]}, {"page": "Long Man of Wilmington", "response": ["Archaeological work performed in 2003 by Professor Martin Bell of the University of Reading, in association with Aubrey Manning's Open University programme Landscape Mysteries, strongly suggested that the figure dates from the Early Modern period – the 16th or 17th century AD. Bell found that the slope on which the Long Man was cut had gone through a period of instability in this time, after a very long prior period of stability, suggesting that the figure was first cut then. This has opened up the possibility that the Long Man could be a Tudor or Stuart-era political satire in the manner recently posited for the Cerne Abbas giant, or possibly a religious image associated with the Reformation: Professor Ronald Hutton noted that \"we can at least celebrate the fact that we have our first, apparently unequivocally, Early Modern hill figure, and historians now have to reckon with it.\""]}, {"page": "Seven Natural Wonders", "response": ["|5||The South||30 May||Aubrey Manning||The Needles, Lulworth Cove, Devil's Punch Bowl, The Ridgeway, Stokenchurch Gap, Finchampstead Ridges, Cuckmere Haven"]}, {"page": "Frederick Vine", "response": ["Vine's PhD thesis was on 'Magnetism in the Seafloor' and supervised by Drummond Matthews. Having met Harry Hess he was aware of sea floor spreading, where the ocean bed acts as a 'conveyor belt' moving away from the central ridge.BBC / Open University broadcast series Earth Story, Vine interviewed by Professor Aubrey Manning Vine's work, with that of Drummond Matthews and Lawrence Morley of the Geological Survey of Canada, helped put the variations in the magnetic properties of the ocean crust into context in what is now known as the Vine–Matthews–Morley hypothesis. Specifically they supported Dietz's (Nature 1961) idea that sea floor spreading was occurring at mid-ocean ridges. Vine and Matthews showed that basalt created at a mid-ocean ridge records earth's current magnetic field polarity (and strength), thus turning Hess's theoretical 'conveyor belt' into a 'tape recorder'. Furthermore, they showed that magnetic reversals 'frozen' into these rocks, as suggested by Allan Cox (Nature 1963), can be seen as parallel strips as you travel perpendicularly away from the ridge crest."]}, {"page": "Strode's College", "response": ["*Aubrey Manning, zoologist and broadcaster"]}, {"page": "Science Week Ireland", "response": ["The guest lecturers include Professor Aubrey Manning, distinguished zoologist and broadcaster; Gerry Johnston, director of Special Effects Ireland;  Dr. Cynthia Breazeal, Associate Professor at Massachusetts Institute of Technology; Stephen Attenborough of Virgin Galactic; and Patrick Collison, Irish Young Scientist of the Year winner 2005. These can be viewed on YouTube."]}, {"page": "BBC Natural History Unit filmography", "response": ["| Earth Story || 1998 || Aubrey Manning finds out how old our planet is and what it looked like when it was newly formed. || Aubrey Manning (presenter) || Yes || Yes"]}, {"page": "Margaret Bastock", "response": ["After completing her D.Phil., Bastock continued working on courtship behaviour and wrote a textbook on the subject. She collaborated with another student of Tinbergen, Aubrey Manning, whom she married in 1959. Bastock moved to Edinburgh with Manning in the 1960s and they had two sons. Bastock continued to work in science, studying child development and aggressive behaviour. She died of cancer on 10 June 1982 in Charminster, Dorset, aged 62."]}, {"page": "Derek Goodwin", "response": ["He was known as a prolific bird correspondents and was elected as a corresponding member of Deutsche Ornithologen-Gesellschaft in the 1970s, though he never studied German in school. He also taught and mentored noted ornithologists, such as Aubrey Manning, Rob Hume and Desmond Morris when they were students."]}, {"page": "Lazăr Șăineanu", "response": ["With La Création métaphorique, the researcher inventoried the representations of animals in the late medieval imaginary: lions and cocks as representations of courage, hunting dogs as icons of arrogance, pigs as symbols of gluttony etc.Esther Cohen, \"Animals in Medieval Perceptions: The Image of the Ubiquitous Other\", in Aubrey Manning, James Serpell (eds.), Animals and Human Society: Changing Perspectives, Routledge, London, 1994, p.63.   The books notably showed the traditional semantic parallelisms between cats, monkeys and apes, as codified in several Romance languages, and investigated the animals' respective roles within popular demonology and metaphors of drunkenness.Michel Masson, \"Cats and Bugs: Some Remarks about Semantic Parallelisms\", in Martine Vanhove (ed.), From Polysemy to Semantic Change: Towards a Typology of Lexical Semantic Associations, John Benjamins, Amsterdam & Philadelphia, 2008, p.372-376, 382.   With Les Sources indigènes de l'étymologie française, Șăineanu offered clues on the obscure origin of various French words. Șăineanu thus sourced the French and English harlequin beyond the Italian-language arlechino in Commedia dell'arte, and back to a medieval legend in Middle French.Pierre Louis Duchartre, The Italian Comedy: The Improvisation, Scenarios, Lives, Attributes, Portraits, and Masks of the Illustrious Characters of the Commedia dell'arte, Dover Publications, New York City, 1966, p.138-139.  "]}, {"page": "Silver Medal (Zoological Society of London)", "response": ["| 2003 || Peter Olney || Aubrey Manning"]}, {"page": "Earth Story", "response": ["Earth Story is a 1998 BBC documentary series on geology presented by Aubrey Manning. A number of filming locations were used around the world including Alaska, India, and Barbados."]}, {"page": "Tinbergen Lecture", "response": ["*1987 Aubrey Manning"]}, {"page": "Aubrey W.G. Manning", "response": ["#REDIRECTAubrey Manning"]}, {"page": "D. G. M. Wood-Gush", "response": ["In 1978 the Poultry Research Centre decided to relocate to Roslin, Midlothian and began more industry-based research. Given David’s disapproval of this and his lack of driving licence (due to his missing arm) making it very difficult to reach this remote site. He moved to more academic roles in Edinburgh instead. In 1978 he began teaching Applied Animal Behaviour at the University of Edinburgh. He was given an Honorary Professorship by the University of Edinburgh in 1981. In the same year he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Noel Farnie Robertson, Aubrey Manning, John Mitchison, Peter M. B. Walker, Peter McDonald and John E. Dale."]}, {"page": "Alistair Lawrence", "response": ["With Aubrey Manning he oversees the David Wood-Gush Trust Fund that set up and supports the annual Wood-Gush lecture."]}, {"page": "Rob Morrison (scientist)", "response": ["In 1972 he was awarded a Churchill Fellowship to study in the UK, and in 1972–73 he was a post-doctoral Research Fellow in animal behaviour at the University of Edinburgh, working with the noted animal behavior expert and television presenter Professor Aubrey Manning."]}, {"page": "John Alexander Loraine", "response": ["In 1947 he joined the staff of the Clinical Endocrinology Research Unit. He was promoted to assistant director in 1958 and director in 1961. In 1972 he joined the staff of the University of Edinburgh lecturing in community medicine. In 1978 he was elected a fellow of the Royal Society of Edinburgh. His proposers were Anne McLaren, Roger Valentine Short, Aubrey Manning, Douglas Scott Falconer and H. John Evans."]}, {"page": "J. G. Scaife", "response": ["Scaife returned to Britain in 1968 first (briefly) to the MRC Molecular Genetics Unit in London, then to the University of Edinburgh in autumn of 1968 as a lecturer under William Hayes. He became a senior lecturer in molecular biology in 1974 and reader in 1978. He started in the new field of molecular parasitology in 1979. He was created Professor of Molecular Biology in 1984. In 1991 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were E. C. R. Reeve, G. H. Beale, A. E. H. Emery, John O. Bishop, Douglas Scott Falconer and Aubrey Manning."]}, {"page": "Deaths in October 2018", "response": ["*Aubrey Manning, 88, English zoologist and broadcaster.Professor Aubrey Manning, zoologist and population campaigner who enthralled  students as well as television audiences – obituary"]}, {"page": "Ruth Clayton", "response": ["Later in her career Clayton pursued a series of studies in collaboration with University of Edinburgh zoologist Aubrey Manning. Rodent models and cell cultures were used to assess the potentially deleterious effects on foetal neural development of low-level exposure to pharmaceuticals and environmental contaminants during pregnancy. They found that common anticonvulsant drugs and aluminium sulfate had measurable neurochemical and behavioural effects on pups, dams or pup-dam interactions following low-level pre-natal exposure, and that some of these changes were modified by genetics.Sedowofia SK, Clayton RM. Effects of anticonvulsant drugs on brain cultures from chick embryos: a comparison with cultures from embryos treated in ovo. Teratog Carcinog Mutagen. 1985;5(3):205-17..Sedowofia SK, Innes J, Peter A, Alleva E, Manning A, Clayton RM. Differential effects of prenatal exposure to phenobarbital on the behaviour and neurochemistry of CBA and C57BL/6J mice. Psychopharmacology (Berl). 1989;97(1):123-30. PubMed .Clayton RM, Sedowofia SK, Rankin JM, Manning A. Long-term effects of aluminium on the fetal mouse brain. Life Sci. 1992;51(25):1921-8. PubMed .Laviola G, Terranova ML, Sedowofia K, Clayton R, Manning A. A mouse model of early social interactions after prenatal drug exposure: a genetic investigation. Psychopharmacology (Berl). 1994 Jan;113(3-4):388-94. "]}, {"page": "Laurids Smith", "response": ["Smith held the view that animals are intellectual and sentient beings that are meant to experience happiness and joy as God intended.Hauskeller, Michael. (2007). Biotechnology and the Integrity of Life: Taking Public Fears Seriously. Ashgate Publishing. pp. 63-64.  In 1791, Smith authored a book on the nature of animals and human duties towards them.Maehle, Andreas-Holger. Cruelty and Kindness to the 'Brute Creation': Stability and Change in the Ethics of the Man-Animal Relationship, 1600-1850. In Aubrey Manning and James Serpell. (2003). Animals and Human Society: Changing Perspectives. Routledge. pp. 81-105.  The purpose was to bring \"alleviation to the brute creation which is groaning under its sufferings\". The book attempts to substantiate demands for kindness to animals with evidence of animal intelligence. It was published in Danish and German.Ingesman, Per. (2016). Religion as an Agent of Change: Crusades – Reformation – Pietism. Brill Publishers. p. 225.  Smith was influenced by a 1711 work by Adam Gottlieb Weigen, another early animal rights writer."]}]}}