{"wiki_id": "http://www.wikidata.org/entity/Q4817141", "itemLabel": "John Bowman", "itemDescription": "English football player and manager (1879-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bowman_(footballer)", "wikipedia_page": {"main": "John William Bowman (23 April 1879 – 26 January 1943) was an English football player and manager.\nHe played one cup game for Burslem Port Vale in 1899, having previously appeared for a number of nearby amateur sides. He then spent two seasons with Stoke, playing four games in the Football League, before he joined Queens Park Rangers in 1901. In four years with QPR he played more than 100 matches, before he was selected to serve Norwich City as manager. He stepped down in 1907, returning to the game in 1912 for a four-year stint as Croydon Common manager. He then returned to QPR as a director, though briefly took the managerial reins in 1931.", "link_mentions": [{"page": "Norwich City F.C.", "response": ["The earliest known recorded link between the club and canaries comes in an interview recorded in the Eastern Daily Press with the newly appointed manager, John Bowman in April 1905. The paper quotes him saying \"Well I knew of the City's existence... I have... heard of the canaries.\" \"This as far as we can tell is the first time that the popular pastime of the day ie... rearing... canaries was linked with Norwich City FC... the club still played in blue and white, and would continue to do so for another two seasons.\"", "| style=\"text-align:left;\"|John Bowman"]}, {"page": "List of Norwich City F.C. managers", "response": ["Norwich City Football Club is an association football club based in Norwich, Norfolk, and was founded in 1902. As of the 2019–20 season, they play in the Premier League. The club's first manager, John Bowman, was appointed in 1905. Since then, 39 men have held the job on a permanent basis.  , the former Borussia Dortmund reserve-team coach Daniel Farke occupies the role.", " The club officials, including Turner, had to be removed from office and Norwich were ousted from the amateur game at the end of the season.Eastwood, p.23 The response was swift: at a meeting two days later, it was resolved to find a place in professional football. On 30 May 1905, they were elected to play in the Southern League, in place of Wellingborough. By then the club had secured their first professional manager, John Bowman.  Bowman served two years in the role.  He also has a place in Norwich City history for making the first recorded link between the team and its nickname \"Canaries\", although at this time the club nickname was \"Citizens\".Eastwood p.24 The earliest recorded link between the club and canaries, came in a 1905 newspaper interview with Bowman, quoting him saying: \"Well I knew of the City's existence ... I have ... heard of the canaries.\" At the time, this was a reference to Norwich's link to breeding canaries; the club's canary colours and crest would follow the adoption of the nickname."]}, {"page": "John Bowman", "response": ["John Bowman may refer to:", "* John Bowman (actor) (1651-1739), British stage actor", "*John Bowman (Nevada politician) (1824/25–1899), American lawyer, served as member and speaker of the Nevada Assembly", "*John Bowman (broadcaster) (born 1942), Irish historian and broadcaster", "*John Bowman (Canadian football) (born 1982), currently with the Montreal Alouettes", "*John Bowman (Canadian politician), mill owner and reeve of the Township of Markham, Ontario", "*John Bowman (footballer) (1879–1943), English football player and manager", "*John Bowman (pastoralist), South Australian pioneer", "*John Bowman (pioneer) (1738–1784), Virginia and Kentucky soldier and official", "*John Bowman (New York politician) (1782–1853), New York politician, served in both houses of the state legislature", "*John Bowman (screenwriter), writer for Saturday Night Live", "*John Bowman of the Bowman baronets", "*John Bowman (1701–1797), Lord Provost of Glasgow"]}, {"page": "John William Bowman", "response": ["#REDIRECT John Bowman (footballer)"]}, {"page": "John Bowman (football manager)", "response": ["#REDIRECT John Bowman (footballer)"]}]}}