{"wiki_id": "http://www.wikidata.org/entity/Q4810625", "itemLabel": "Henry Ainley", "itemDescription": "English stage actor (1879-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Ainley", "wikipedia_page": {"main": "Henry Hinchliffe Ainley (21 August 1879 – 31 October 1945) was an English actor.", "link_mentions": [{"page": "1945", "response": ["** Henry Ainley, British actor (b. 1879)"]}, {"page": "Laurence Olivier", "response": ["Following Olivier's success in Shakespearean stage productions, he made his first foray into Shakespeare on film in 1936, as Orlando in As You Like It, directed by Paul Czinner, \"a charming if lightweight production\", according to Michael Brooke of the British Film Institute's (BFI's) Screenonline. The following year Olivier appeared alongside Vivien Leigh in the historical drama Fire Over England. He had first met Leigh briefly at the Savoy Grill and then again when she visited him during the run of Romeo and Juliet, probably early in 1936, and the two had begun an affair sometime that year. Of the relationship, Olivier later said that \"I couldn't help myself with Vivien. No man could. I hated myself for cheating on Jill, but then I had cheated before, but this was something different. This wasn't just out of lust. This was love that I really didn't ask for but was drawn into.\" While his relationship with Leigh continued he conducted an affair with the actress Ann Todd, and possibly had a brief affair with the actor Henry Ainley, according to the biographer Michael Munn."]}, {"page": "Jon Pertwee", "response": ["Born in Chelsea, London, and having French Huguenot ancestry (his surname was an Anglicisation of \"Perthuis\"; the origins of his surname being \"de Perthuis de Laillevault\", the family being Counts descended from Charlemagne),Jon Pertwee: The Biography, Bernard Bale, André Deutsch, 2000, p. 2An Hour with Jon Pertwee, broadcast by BBC7 on 30 March 2009 Jon was the son of screenwriter and actor Roland Pertwee and distant cousin of actor Bill Pertwee. Pertwee's mother, Avice Scholtz, separated from his father Roland when Pertwee was young. His father remarried, and his mother found a new partner, Louis Auguste De La Garde, with whom Pertwee did not build a relationship; she died in 1951, leaving Pertwee's older brother Michael as her executor.Interview \"Mind of Evil\" DVD, released 2013. Avice's sister Daphne married Captain Philip Cecil Clowes and became the mother of Pertwee's cousin, the writer St John Legh Clowes (1907–1951). Actor Henry Ainley, a close friend of his father, was his godfather. Coincidentally, Ainley's son Anthony appeared as the Master – a renegade Time Lord who was The Doctor's greatest enemy – alongside Pertwee in the Doctor Who anniversary story The Five Doctors (1983)."]}, {"page": "Claude Rains", "response": ["| Henry Ainley"]}, {"page": "The Prisoner of Zenda", "response": ["* The Prisoner of Zenda (1915): Starring Henry Ainley, Gerald Ames, George Bellamy, Marie Anita Bozzi, Jane Gail, Arthur Holmes-Gore, Charles Rock and Norman Yates. It was adapted by W. Courtney Rowden and directed by George Loane Tucker."]}, {"page": "It's That Man Again", "response": ["|Mary O'Farrell (1892–1968) was an actress who worked mostly for the BBC. Starting her career in the West End, she first broadcast in 1923 in a production with Henry Ainley, and was later a long-time member of the BBC Repertory Company. Among her best-known roles was the eponymous \"composeress\" Hilda Tablet in Henry Reed's series of radio comedies between 1953 and 1959."]}, {"page": "Royal Academy of Dramatic Art", "response": ["* Henry Ainley (1931-1933)"]}, {"page": "Michael Hordern", "response": ["After a brief holiday with Eve in Scotland in 1938,Hordern, p. 57. Hordern returned to London, where he appeared in Quinneys, a radio play broadcast by the BBC in June of that year.\"Broadcast of Quinneys\", Bath Chronicle and Weekly Gazette, 10 June 1939, p. 8. The main part went to Henry Ainley whom Hordern described as \"a great actor, who, sadly, was past his best\"."]}, {"page": "She Stoops to Conquer", "response": ["*She Stoops to Conquer, a 1914 silent movie directed by George Loane Tucker and starring Henry Ainley and Jane Gail"]}, {"page": "Kensal Green Cemetery", "response": ["*Henry Ainley (1879–1945), actor"]}, {"page": "1920 in film", "response": ["*Build Thy House directed by Fred Goodwins, starring Henry Ainley"]}, {"page": "1915 in film", "response": ["* The Prisoner of Zenda, starring Henry Ainley and Gerald Ames (GB)"]}, {"page": "Alistair Cooke", "response": ["In 1932 Cooke became engaged to Henrietta Riddle, the daughter of the English actor Henry Ainley and the Baroness von Hütten, but she broke off the engagement the following year while he was in America on a Commonwealth Fund Fellowship. He met Ruth Emerson, a great-grandniece of Ralph Waldo Emerson, in 1933, and they married on 24 August 1934. Their son, John Byrne Cooke, was born 5 October 1940 in New York City, New York. "]}, {"page": "Granville Bantock", "response": ["*Macbeth (1926, Shakespeare, Sybil Thorndike's Prince Theatre, London production with Thorndike, Henry Ainley, Lewis Casson, and design by Frank Brangwyn, 1926, music later incorporated in Macbeth Overture)"]}, {"page": "The Moon and Sixpence", "response": ["The book was made into a stage play in 1925 at the New Theatre, with Henry Ainley as Strickland and Eileen Sharp as Ata. A film of the same name directed and written by Albert Lewin, was released in 1942, starring George Sanders as Charles Strickland."]}, {"page": "Goethe's Faust", "response": ["*In 1908, Stephen Phillips and J. Comyns Carr freely adapted the first part of Faust for a production at Her Majesty's Theatre. It starred Henry Ainley as Faust, Herbert Beerbohm Tree as Mephistopheles and Marie Lohr as Margaret."]}, {"page": "Fay Compton", "response": ["Compton had a reputation for versatility, and in 1931 she appeared successively in the title role of the pantomime Dick Whittington and Ophelia to Henry Ainley's Hamlet. Throughout the 1930 Compton moved between West End plays, mostly ephemeral, pantomime and Shakespeare – Titania, Lady Rosaline, Calpurnia, and Paulina in The Winter's Tale, one of her favourite parts – and toured in Australia and New Zealand in  Victoria Regina, Tonight at 8.30 and George and Margaret. In 1930 she played Ophelia to the Hamlet of John Gielgud, first at the Lyceum and then at Elsinore Castle."]}, {"page": "St James's Theatre", "response": ["After Alexander died in 1918, the lease was taken over by Gilbert Miller, an American impresario, who presented his own productions from time to time, but more often sub-let the theatre to other managers. The first was Gertrude Elliott who presented and starred in an American fantasy play, The Eyes of Youth, which ran for 383 performances.Duncan, p. 298 After this, Miller went into partnership with the actor Henry Ainley, and in 1920 they presented Julius Caesar, with Ainley as Mark Antony and a cast including Basil Gill, Claude Rains, Milton Rosmer and Lilian Braithwaite, which ran for 83 performances.MacQueen-Pope, pp. 194–195 There followed a succession of society dramas and light comedies including Polly With a Past (1921) in which many future stars appeared, including Helen Haye, Edith Evans and Noël Coward.Duncan, p. 300 In 1923 The Green Goddess, a melodrama by William Archer, started a run of 417 performances.MacQueen-Pope, p. 198"]}, {"page": "Anthony Ainley", "response": ["Ainley was born in Stanmore, Middlesex, the son of the actor Henry Ainley, on 20 August 1932, although his birth was not registered until January 1938 at around the time that he was admitted to the actors' orphanage. The birth certificates of Anthony and his brother Timothy identify their mother as Clarice Holmes and it is under this surname that they are recorded in the Official Register. Although no father is named on the birth certificates Timothy's marriage certificate identifies Henry Ainley as his father."]}, {"page": "Arthur Bourchier", "response": ["Bourchier returned to manage the Garrick in 1912 for two years.  In 1913, he appeared in a revival of London Assurance in aid of King George's Actors' pension fund with other stars including Tree, Henry Ainley, Charles Hawtrey, Weedon Grossmith and Marie Tempest.The Observer, 8 June 1913, p. 9  In 1916 he again played Brutus in Julius Caesar, at the Theatre Royal, Drury Lane, for the Shakespeare tercentenary with Frank Benson as Caesar, H. B. Irving as Cassius and Ainley as Antony.The Manchester Guardian, 3 May 1916, p. 4  The same year, Bourchier took over management of His Majesty's.  In 1917, he created the part of Bruce Bairnsfather's \"Old Bill\" in a stage adaptation called The Better 'Ole at the Oxford Music Hall, where it ran for over 800 performances."]}, {"page": "Charles Ricketts", "response": ["After the First World War Ricketts resumed his theatrical activity, and designed The Betrothal, by Maurice Maeterlinck (with Gladys Cooper) at the Gaiety Theatre (1921), Shaw's Saint Joan (with Sybil Thorndike) at the New Theatre (1924), Henry VIII (with Lewis Casson and Thorndyke) at the Empire Theatre (1925) and Macbeth (with Henry Ainley, Thorndyke and Casson) at the Princes Theatre (1926). In the same year he designed costumes and scenery for the D'Oyly Carte Opera Company's production of The Mikado at the Savoy Theatre, and did the same in 1929 for their The Gondoliers at the same theatre. Most of Ricketts's costume designs for The Mikado were retained by subsequent designers of the D'Oyly Carte productions for more than 50 years.Bell, pp. 148–152"]}, {"page": "Rupert of Hentzau", "response": ["*1915 film version Rupert of Hentzau starring Gerald Ames in the title role and Henry Ainley as Rassendyl"]}, {"page": "Bobby Peel", "response": ["During his playing days, Peel was famous and well-respected—the actor Henry Ainley claimed that the highlight of his life was carrying Peel's bag. According to the historian David Frith, Peel was not a considerate husband. Frith also suggests that he was sometimes involved in embarrassing situations; for example, when Ranjitsinhji invited him on a hunting trip, \"Peel blasted eight barrels at a hare, removing its legs, an ear and much else before chasing the remnants of the animal into a neighbouring property, still firing away, until all life was extinguished\".Frith, p. 212. Frith believes that Peel had a \"perverse\" character, exemplified by Lord Hawke's comment that he showed no pleasure at his many successes. Pearson suggests that some of Peel's problems may have been connected to depression, but Frith records that he mellowed in later life."]}, {"page": "List of William Shakespeare screen adaptations", "response": ["|Olivier's first performance of Shakespeare on screen. It was also the final film of stage actors Leon Quartermaine and Henry Ainley and featured an early screen role for Ainley's son Richard as Sylvius, as well as for John Laurie, who played Orlando's brother Oliver. Laurie would go on to co-star with Olivier in the three Shakespearean films that Olivier directed."]}, {"page": "Margaretta Scott", "response": ["Scott began acting as a child, giving private performances of verse-speaking and dance drama to entertain her family and  friends.  In 1926, at the age of 14, she made her acting debut on the London stage as Mercutio's Page in a Fellowship of Players revival of Romeo and Juliet.The Strand Theatre with Lawrence Anderson as Romeo; Jean Forbes Robertson, Juliet and Robert Lorraine, Mercutio. Scott became a leading exponent of the work of William Shakespeare through a series of notable performances in the early and mid-1930s: Cast firstly as the Player Queen and then Ophelia in Hamlet,Twice in 1930 and at The Haymarket in 1931 with Henry Ainley and later Godfrey Tearle as Hamlet. she followed this with Beatrice in Much Ado About Nothing for the Oxford University Dramatic Society.With George Devine, William Devlin and Hugh Hunt."]}, {"page": "Terence Alexander", "response": ["*Jennie: Lady Randolph Churchill (1974) as Henry Ainley"]}, {"page": "Malvolio", "response": ["The role was first played by Richard Burbage at the Globe Theatre. John Marston observed that the actors of his time often played the role with \"contemptuous superiority\"; by contrast his favourite Malvolio, William Ferrin, performed it with \"lofty condescension\". Other actors known for their performance of Malvolio include Sir Alec Guinness, Henry Irving, E. H. Sothern, Herbert Beerbohm Tree, Henry Ainley, Sir John Gielgud, Simon Russell Beale, Maurice Evans, Ken Dodd, Richard Briers, Sir Nigel Hawthorne and Sir Derek Jacobi. Richard Wilson took on the role for the Royal Shakespeare Company's 2009 production.  In 2012, Stephen Fry assumed the role at Shakespeare's Globe. In 2017, actress Tamsin Greig portrayed a female version of the character (renamed Malvolia) in Simon Godwin's revival of the play at the National Theatre."]}, {"page": "Frank Benson (actor)", "response": ["Benson's company toured widely, with few London seasons, and became a training ground for several generations of young performers, including Henry Ainley, Oscar Asche, Lilian Braithwaite, Isadora Duncan, Nigel Playfair, Nancy Price and Harcourt Williams.", "Another celebrated aspect of Benson's life and work was the training of new generations of actors. A touring company paying modest salaries inevitably suffered a constant loss of its leading players to stardom and better pay in the West End, and Benson's company had a continual influx and outflow of actors. In 1913 The Times printed a list of more than 90 \"Old Bensonians\" – eminent actors and actresses who \"learnt their art under the inspiration of Mr Benson\". The men included Henry Ainley, Oscar Asche, Matheson Lang, Nigel Playfair, William Poel and Harcourt Williams. Among the women were Lilian Braithwaite, Isadora Duncan, Kitty Loftus and Nancy Price.\"Mr Benson's Canadian and American Visit\", The Times, 18 September 1913, p. 9"]}, {"page": "Richard Ainley", "response": ["Born in Middlesex, England, Ainley was the son of Henry Ainley and half-brother of Anthony Ainley."]}, {"page": "Malcolm Keen", "response": ["Keen was the father of actor Geoffrey Keen, and the two both played Iachimo in Cymbeline opposite Peggy Ashcroft: Malcolm at the Old Vic in 1932, Geoffrey at the Shakespeare Memorial Theatre in 1957. Keen played the Caliph in a production of James Elroy Flecker's Hassan at His Majesty's Theatre in London in 1923. Incidental music for the play was by Frederick Delius, and the ballet in the House-of-the-Moving Walls was created by Fokine. Also in the cast, Henry Ainley as Hassan, Isabel Jeans as Yasmin.Fabia Drake, Blind Fortune ,  p. 50-51"]}, {"page": "George Alexander (actor)", "response": ["Alexander followed Robertson and the Kendals in preferring a naturalistic style of writing and acting to the extravagantly theatrical manner favoured by some earlier actor-managers. He built around him a company of fine actors, many of whom were or later became leading figures in the profession, including Henry Ainley, Arthur Bourchier, Constance Collier, Julia Neilson, Fred Terry and Marion Terry. As an actor, Alexander's range was limited, and he did not attempt the great heroic roles or play much tragedy. His genre was naturalistic, and rarely very profound, comedy and drama, in which he was a recognised leader.", "The young poet Stephen Phillips furnished Alexander with a verse drama, Paolo and Francesca,  based on an episode in Dante's The Divine Comedy, produced at the St James's in March 1902. Alexander played the fierce and sombre Giovanni Malatesta, a part far removed from his more usual urbane roles; the young Henry Ainley and Evelyn Millard were well received as the eponymous lovers, and the play ran for 134 performances.\"St James's Theatre\", The Times, 7 March 1902, p. 3 In February 1906 Alexander presented and appeared in Pinero's new drama His House in Order, which was an artistic and box-office success, running for 427 performances. Wearing comments that Alexander was a leader of fashion, starting a trend in men's attire by appearing in this play wearing a soft-collared shirt with a lounge suit."]}, {"page": "Irene Vanbrugh", "response": ["Vanbrugh's first big stage success of the post-war years was in Milne's Mr Pim Passes By in 1920. She and her husband opened it in Manchester, and such was its reception that they brought it into the West End. From 1927 to 1929, she toured Australia and New Zealand, playing a variety of parts. Her other appearances in the inter-war years included Gertrude to Henry Ainley's Hamlet in 1931, Millicent Jordan in Dinner at Eight (1933), the Duchess of Marlborough in Viceroy Sarah, (1935) and Mistress Page in The Merry Wives of Windsor with her sister Violet as Mistress Ford (1937).\"Blackfriars Ring – 'The Merry Wives of Windsor'\", The Times, 15 March 1937, p. 12 In 1939, she created the role of Catherine of Braganza in Shaw's In Good King Charles's Golden Days."]}, {"page": "As You Like It (1936 film)", "response": ["It was the final film of stage actors Leon Quartermaine and Henry Ainley, and featured an early screen role for Ainley's son Richard as Sylvius, as well as for John Laurie, who played Orlando's brother Oliver. (Laurie would go on to co-star with Olivier in the three Shakespearean films that Olivier directed.)", "Duke Frederick (Felix Aylmer) has usurped and deposed his older brother, Duke Senior (Henry Ainley). Frederick allows the exiled Duke's daughter, Rosalind (Elisabeth Bergner), however, to stay, as she is the closest friend of his daughter, Celia (Sophie Stewart). Orlando (Laurence Olivier), who has been forced to flee his home due to the oppression from his brother, Oliver (John Laurie), comes to the Frederick's Duchy, and enters a wrestling tournament. On leaving the Duchy, Orlando encounters Rosalind, and it is love at first sight. Frederick then becomes angry, and banishes Rosalind. Celia decides to accompany her, along with a jester, Touchstone (Mackenzie Ward)."]}, {"page": "1945 in the United Kingdom", "response": ["**Henry Ainley, actor (born 1879)"]}, {"page": "Durward Lely", "response": ["Lely sometimes sang with his wife in amateur performances, for example as Lionel opposite her Nancy in Martha in Dundee in 1888. In 1892, he toured with his wife accompanying him at the piano in an entertainment called \"Scottish Song and Story\". They again toured with this entertainment in the US and Canada in 1895 and again in 1898, going on to Australia and New Zealand. In 1905, at the St. James's Theatre and then on tour, he starred in a stage adaptation of Beside the Bonnie Brier Bush with Henry Ainley and Lilian Braithwaite.The Observer, 3 December 1905, p. 5 Lely also appeared as Francis Osbaldistone in the 1911 film of Rob Roy. He became a close friend of fellow D'Oyly Carte principal Henry Lytton, even though Lytton's long tenure with the company took place mostly after Lely had left it.\"Durward Lely\", Memories of the D'Oyly Carte website, retrieved 25 November 2009 Lely continued to act and sing in Scottish plays with his own company until 1925."]}, {"page": "Harcourt Williams", "response": ["One of Williams's most notable parts of this period was General Lee in John Drinkwater's Abraham Lincoln in 1919; he later switched to the role of the Chronicler in the same production.\"Abraham Lincoln Revisited\", The Times, 28 November 1919, p. 10 In 1922, in Mary Stuart by Drinkwater, he was \"exquisitely repulsive\" as Darnley.\"Mary Stuart\", The Times, 26 September 1922, p. 8 In a third historical drama by the same author he was John Hampden in Oliver Cromwell at His Majesty's in 1923, to the Cromwell of Henry Ainley.Parker, p. lxi In 1923 he directed G K Chesterton's play Magic at the Everyman Theatre.Parker, p. lxvii In 1926 he appeared in John Barrymore's production of Hamlet at the Haymarket Theatre, as the Player King.Parker, p. cxvi"]}, {"page": "List of assassinations in fiction", "response": ["* Rupert of Hentzau — 1923 film by Victor Heerman in which the King of Ruritania (Bert Lytell) is assassinated (but not his look-alike, as in the novel by Anthony Hope) — also, earlier 1916 version with Henry Ainley"]}, {"page": "List of British films before 1920", "response": ["| Called Back || George Loane Tucker || Henry Ainley, Jane Gail, Charles Rock || Crime || ", "|She Stoops to Conquer||George Loane Tucker ||Henry Ainley, Jane Gail ||Comedy ||Based on the play by Oliver Goldsmith", "| Brother Officers || Harold M. Shaw || Henry Ainley, Gerald Ames || War drama || ", "| The Great Adventure || Laurence Trimble || Henry Ainley, Esme Hubbard || Comedy ||", "| A Man of His Word || George Loane Tucker || Henry Ainley, Mary Dibley, Gerald Ames || Drama ||", "| The Prisoner of Zenda||George Loane Tucker||Henry Ainley, Jane Gail|| Adventure||", "|Rupert of Hentzau||George Loane Tucker||Henry Ainley, Jane Gail|| Adventure||", "| Sweet Lavender || Cecil M. Hepworth || Henry Ainley, Chrissie White, Alma Taylor || Romance ||", "| Iris || Cecil M. Hepworth || Henry Ainley, Alma Taylor, Stewart Rome || Romance ||", "| The Manxman || George Loane Tucker || Henry Ainley, Adeline Hayden Coffin, Will Corrie || Drama || ", "|The Marriage of William Ashe||Cecil M. Hepworth || Henry Ainley, Alma Taylor || Drama || ", "| Sowing the Wind || Cecil Hepworth || Henry Ainley, Alma Taylor, Stewart Rome || Romance ||", "|Quinneys||Rex Wilson||Henry Ainley, Isobel Elsom||Romance||"]}, {"page": "Fabia Drake", "response": ["Back in London in 1921 and unemployed, she spent time with Meggie Albanesi in her dressing room during her 'waits' in Albanesi's current success A Bill of Divorcement at St Martin's Theatre. Drake wrote \"Albanesi was by now established as the most talented young actress in England, under contract to Basil Dean...the warmth and sympathy of her personality was like a lodestar in my bleak night sky.\"  Having tried, and failed, to gain employment with J.E.Vedrenne, Drake decided to join Madame Alice Gachet's French acting classes at RADA, another teacher of brilliance, her most famous pupil - Charles Laughton. She then signed with Vedrenne for 18 months, playing small parts, and understudying and was then sent to Basil Dean who was about to produce James Elroy Flecker's Hassan. This proved a memorable production, incidental music was by Frederick Delius, the great ballet in the House-of-the-Moving-Walls was devised by Fokine, and the cast included  Malcolm Keen as the Caliph and Henry Ainley as Hassan. Drake, an understudy, playrf both of the two women's parts in the play, Yasmin and Pervaneh - Isabel Jeans (Yasmin) and Laura Cowrie (Parveneh), both went down with influenza in the epidemic of 1923."]}, {"page": "Build Thy House", "response": ["Build Thy House is a 1920 British silent film directed by Fred Goodwins, and starring Henry Ainley, Ann Trevor, Reginald Bach and Claude Rains in his film debut. The screenplay was written by Eliot Stannard from the story by S. Trevor Jones.BFI Database entry", "* Henry Ainley - Arthur Burnaby "]}, {"page": "Leontes", "response": ["Actors who have given notable performances as Leontes include Johnston Forbes-Robertson, Henry Ainley, John Gielgud, Jeremy Irons, Patrick Stewart and Antony Sher."]}, {"page": "Lizzie Caswall Smith", "response": ["Lizzie Caswall Smith (1870–1958) was an early 20th-century British photographer who specialised in society and celebrity studio portraits, often used for postcards.  She was associated with the Women's Suffrage movement and photographed many suffragettes including Flora Drummond, Millicent Fawcett and Christabel Pankhurst. She also photographed actors including Henry Ainley, Camille Clifford, Sydney ValentineSydney Valentine, by Lizzie Caswall Smith, published by  Rotary Photographic Co Ltd, 1904 at National Portrait Gallery, London, accessed 5 August 2016 Billie Burke, and Maude Fealy."]}, {"page": "List of British films of 1932", "response": ["|The First Mrs. Fraser||Sinclair Hill||Joan Barry, Henry Ainley, Harold Huth||Romantic drama||"]}, {"page": "Ainley", "response": ["*Henry Ainley (1879–1945), English Shakespearean stage and screen actor"]}, {"page": "Robert Eddison", "response": ["In his early career, he spent a year at the Westminster Theatre, making his London debut in The Anatomist again with Flora Robson and Henry Ainley and directed by Tyrone Guthrie. He later spent a long period in weekly rep in Croydon. In 1934 he caught the attention of Ben Greet and until 1939 appeared in several productions, over the course of three seasons, at the Open Air Theatre, Regent's Park. He was seen and noted by Noël Coward whilst performing in a comedy titled 'Yes and No' and later invited by Val Gielgud to appear in radio productions at the BBC.Robert Eddison (1992) Majestic Service: An Autobiographical Memoir, The British Society of Theatre Research"]}, {"page": "List of bisexual people (A–F)", "response": ["| Henry Ainley"]}]}}