{"wiki_id": "http://www.wikidata.org/entity/Q4822862", "itemLabel": "Austen Harrison", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Austen_Harrison", "wikipedia_page": {"main": "Austen St. Barbe Harrison (1891–1976) was a British-born architect. While British, Harrison spent most of his career overseas, and mainly in the Middle East. His works include the British Representative's Residence, Amman, the High Commissioner's Residence, Jerusalem, the Rockefeller Museum, Jerusalem, 1935, and Nuffield College, Oxford.", "link_mentions": [{"page": "Nuffield College, Oxford", "response": ["The architect Austen Harrison, who had worked in Greece and Palestine, was appointed by the University to design the buildings. His initial design, heavily influenced by Mediterranean architecture, was rejected by Nuffield, who called it \"un-English\" and refused to allow his name to be associated with it. Harrison reworked the plans, aiming for \"something on the lines of Cotswold domestic architecture\", as Nuffield wanted. The plans were approved by Lord Nuffield in 1940. Construction of the college began after the war in 1949. Restrictions on construction after the Second World War meant that work on the college was not completed until 1960. The original plan for the college to occupy land on both sides of Worcester Street was scaled down as a result of budget and material shortages, and to this day the land to the west of the college is occupied by a \"temporary\" car park. In one change, the tower, which had been planned to be ornamental, was redesigned to hold the college's library. It was the first tower built in Oxford for 200 years and is about  tall, including the flèche on top. The buildings are arranged around two quadrangles, with residential accommodation for students and fellows in one, and the hall, library and administrative offices in the other. The chapel has stained glass windows designed by John Piper."]}, {"page": "Rockefeller Archeological Museum", "response": ["The museum was designed by Austen Harrison (Austen St. Barbe Harrison), chief architect of the Mandatory Department of Public Works, who drew up blueprints for a white limestone building integrating eastern and western architectural elements. The cornerstone of the new museum was laid on June 19, 1930, but construction was delayed due to the discovery of tombs dating to the fifth century B.C. at the building site. The museum features a stone bas-relief of the meeting of Asia and Africa above the main entrance together with ten stone reliefs illustrating different cultures and a gargoyle fountain in the inner courtyard carved in 1934 by the British sculptor Eric Gill (1882–1940). Gill also produced stone carved signage throughout the museum in English, Hebrew, and Arabic."]}, {"page": "Nigrita", "response": ["*Austen Harrison, town planner of Nigrita after WWI"]}, {"page": "Palestine Technical University – Kadoorie", "response": ["Kadoorie is one of two of agricultural schools founded as agricultural schools by the British during the Mandatory Palestine period with contributions from a bequest of the Iraqi-born Jewish philanthropist Sir Ellis Kadoorie, who died in the British colony of Hong Kong in 1922. Kadoorie contributed 1,000,000 British Pounds. However, when Kadoorie's testament was read it became clear that the Yishuv would not inherit the money - the government of Britain would - and that Kadoorie ordered in his testament to invest the money either in Palestine or in Iraq. Initially an agricultural school was built in Tulkarm. This opened in 1930 with an English principal; the school had the character of a British colonial institution. Soon after many institutions and leaders of the Yishuv made a petition to Herbert Samuel for the establishment of a Jewish school. The British authorities endorsed the idea of a Palestinian Jewish agricultural school similar to the Palestinian Arab school in Tulkarm. The foundations for the second school were laid down in 1931 at Um Jabal, next to the village of Kfar Tavor and the Jewish Kadoorie Agricultural High School was opened in 1933.Shapira, Anita (2008) Yigal Allon, Native Son; a Biography translated by Evelyn Able, University of Pennsylvania press.  pp 35-36 Both school buildings were designed by British architect Austen Harrison, chief architect of the Public Works Department of British Mandatory Palestine's government."]}, {"page": "Buildings of Nuffield College, Oxford", "response": ["The buildings of Nuffield College, one of the colleges of the University of Oxford, are to the west of the city centre of Oxford, England, and stand on the site of the basin of the Oxford Canal. Nuffield College was founded in 1937 after a donation to the University by the car manufacturer Lord Nuffield; he gave land for the college, as well as £900,000 (approximately £246 million in present-day terms) to build and endow it. The architect Austen Harrison, who had worked in Greece and Palestine, was appointed by the University to design the buildings. His initial design, heavily influenced by Mediterranean architecture, was rejected by Nuffield, who called it \"un-English\" and refused to allow his name to be associated with it. Harrison reworked the plans, aiming for \"something on the lines of Cotswold domestic architecture\", as Nuffield wanted.", "Administration of Nuffield's donation was the responsibility of the University, as the college did not become an independent body until after the Second World War. A sub-committee, consisting of three heads of Oxford colleges (Sir William Beveridge from University College; Alfred Emden from St Edmund Hall; and Linda Grier from Lady Margaret Hall), was appointed to choose the architect; Emden appears to have played the major part in the group's work.Colvin, p. 167 Eight architects were initially asked to compete, including Louis de Soissons, Vincent Harris, Austen Harrison, Charles Holden, Edward Maufe, and Hubert Worthington. All but Holden and Maufe submitted photographs of their work, and the sub-committee then recommended Harrison, a decision confirmed after he was interviewed on 17 June 1938. At that time, Harrison had never worked in Britain: although he had qualified there, he had practised in Greece and Palestine.Colvin, p. 168  Indeed, the college seems to have been his only project in the country, and remains his best known work, along with his later University of Ghana.  Harrison was not given any restrictions or limitations on style; Nuffield agreed to Harrison's appointment, but was not consulted on the architectural style of the college before Harrison started work.Colvin, p. 173 When Nuffield's donation was announced, it was reported that the \"general idea\" was that the college buildings should be sited behind gardens, similar to the memorial gardens at Christ Church, Oxford, so that those entering Oxford from the west would be faced with a \"beautiful vista of well-planned gardens seen through railings\"; this idea did not form part of Harrison's designs."]}, {"page": "Central Post Office Building (Jerusalem)", "response": ["The building was built as General Post Office during the British Mandate, one of three government buildings in this area. Construction was between 1934 and 1938 to the design of the main architect of the public works department of the British Mandate, Austen Harrison and the Government architect Percy Harold Winter. The total cost was £120,000 for the building to house the administrative and engineering staff of Palestine Post, Telegraph & Telephone, the Jerusalem central telephone exchange and the Jerusalem post office. The opening ceremony  was held on 18 June 1938, in the presence of the High Commissioner and hundreds of guests. The building is typical of the 'Mandatory' style."]}, {"page": "List of Oxford architects", "response": ["* Austen Harrison"]}, {"page": "Dimitri Papadimos", "response": ["Dimitri Papadimos met the British architect Austen St. Barbe Harrison, in Cairo in the late 1930s . In 1939, Austen Harrison sent Papadimos to study cinematography in Paris but the outbreak of World War II put an early end to his studies.  During WWII, Papadimos served as \"War Photographer\" for the Greek Forces that fought by the side of the Allies. Throughout his professional career he met many European writers, including Robin Maugham, Patrick Balfour, 3rd Baron Kinross, A. W. Lawrence, Philip Sherrard, Francis Noel-Baker and Arab intellectuals such as Hassan Fathy; and was the contributing photographer to many of their works (see Books with photographs by Dimitri Papadimos).", "image:Austen2 Wiki.jpg|Austen Harrison", "File:DP35.05.65.jpg|Durrell with Philip Sherard and Austen Harrison, Athens", "File:Papadimos Harrison Cyprus.jpg|Papadimos and Austen Harrison, Cyprus", "File:Harrison Papadimos.jpg|Austen Harrison with his \"adopted family\" in Athens. Papadimos and his wife Liana "]}, {"page": "Austen (given name)", "response": ["*Austen Harrison (1891–1976), British architect"]}]}}