{"wiki_id": "http://www.wikidata.org/entity/Q4828986", "itemLabel": "Avison Scott", "itemDescription": "English cricketer (1848-1925)", "wikipedia_url": "https://en.wikipedia.org/wiki/Avison_Scott", "wikipedia_page": {"main": "Reverend Avison Terry Scott (18 July 1848 – 18 June 1925) was an English first-class cricketer active from 1867–71, and who played for Cambridge Town Club (aka Cambridgeshire) and Cambridge University. He was born in Cambridge and died in Marylebone. He later became an Anglican priest.", "link_mentions": [{"page": "Richard Murdoch", "response": ["Murdoch was born on 6 April 1907 at his family's home in Keston, Kent, the only son of Bernard Murdoch, a tea merchant, and his wife, Amy Florence, daughter of the Ven Avison Scott, archdeacon of Tonbridge. He was educated at Charterhouse School in Surrey, and Pembroke College, Cambridge, which he left without taking a degree. His biographer Barry Took comments that Murdoch's appetite for a career in show business was \"whetted by success with the Cambridge Footlights\"."]}, {"page": "George Arbuthnot Scott", "response": ["Scott was the son of Avison Terry Scott, who had played first-class cricket for Cambridge University and Cambridgeshire in the 1860s and 1870s. His younger brother, Arthur Avison Scott, played one first-class match for the Royal Navy cricket team in 1912. Scott's mother was a Tillard: her brother, Scott's uncle, Charles Tillard, played first-class cricket for Cambridge University and Surrey, and Charles' son Elliot Tillard, Scott's first cousin, played for the Europeans in the Bombay Triangular tournament in India and in 1912 for Somerset."]}, {"page": "Elliot Tillard", "response": ["Several of Tillard's family played first-class cricket. Tillard's father Charles Tillard played for Cambridge University and Surrey; his grandfather Edward Dowell played for Cambridge University. An uncle Avison Terry Scott played for both Cambridge University and Cambridgeshire in first-class matches; Scott's son George Arbuthnot Scott played for Cambridge University, while a second son (Tillard's cousin) Arthur Avison Scott played one first-class match for the Royal Navy cricket team."]}, {"page": "Avison", "response": ["*Avison Scott (18481925), English first class cricketer"]}, {"page": "List of Cambridge Town Club and Cambridgeshire cricketers", "response": ["* Avison Scott (1867–1871) : A. T. Scott"]}, {"page": "Archdeacon of Tonbridge", "response": ["*1906–18 June 1925 (d.): Avison Scott, Vicar of St James's Tunbridge Wells (first archdeacon)"]}, {"page": "Arthur Scott (cricketer)", "response": ["Arthur Avison Scott  (3 December 1883 – 6 January 1968) was an English first-class cricketer and Royal Navy officer.", "The son of the Reverend Avison Scott and Dorothea Sarah Tillard, he was born at Bootle in December 1883. He attended the Britannia Royal Naval College, from where he graduated into the Royal Navy as an acting paymaster sub-lieutenant. He was confirmed in the rank of sub-lieutenant in April 1904, with promotion to lieutenant following in October 1905. Scott made a single appearance in first-class cricket for the Royal Navy against the British Army cricket team at Lord's in 1912. He took 2 wickets in the match and scored 9 runs. "]}]}}