{"wiki_id": "http://www.wikidata.org/entity/Q4853252", "itemLabel": "Bam Bam", "itemDescription": "British radio host", "wikipedia_url": "https://en.wikipedia.org/wiki/Bam_Bam_(radio_presenter)", "wikipedia_page": {"main": "Peter Jarrod Poulton (born 2 January 1970), known professionally as Bam Bam and briefly as Peter Jarrod, is a British radio personality. Born in Chester, Poulton has lived in the London Borough of Barnet with his girlfriend Emma and their two children since 2003.", "link_mentions": [{"page": "Radio Academy Awards", "response": ["|Bam Bam Breakfast", "|Bam Bam Breakfast"]}, {"page": "Kiss (UK radio station)", "response": ["In June 2006, Kiss 100 was fined a record fee for any UK commercial radio station of £175,000 by media regulator Ofcom. Ofcom punished Kiss 100 for \"numerous and serious breaches\" of broadcasting codes after receiving 10 complaints from April to November 2005. They involved prank calls on the Bam Bam breakfast show where consent was not sought from the \"victims\" and controversial material aired when children were likely to be listening. Kiss 100 said it accepted the findings and apologised for any offence", "Since 2000, DJs and presenters have included: Bam Bam, Andy C, John Digweed, Ali B, Robin Banks, Adam F, DJ EZ, Steve Smart, Carl Cox, Logan Sama, DJ Hatcha, Paul Oakenfold Armin van Buuren, Rickie Haywood Williams, Melvin Odoom, Charlie Hedges, Hed Kandi, Philip George, and DJ S.K.T."]}, {"page": "Heart Kent", "response": ["* Bam Bam (later at Galaxy 105, then Kiss 100 and Capital 95.8"]}, {"page": "Atlantic 252", "response": ["* Bam Bam (real name Peter Poulton, also used Peter Jarrod)"]}, {"page": "Bam Bam", "response": ["Bam Bam may refer to:", "* Bam Bam (nickname)", "* Bam Bam (radio presenter) (born 1970), UK personality on Jack FM", "* Bam Bam (wrestler) (born 1985), Mexican professional wrestler ", "* Bam Bam Bigelow (1961–2007), American professional wrestler", "*Bam Bam (band), American pop band created by Chris Westbrook", "*Bam Bam, Seattle band founded by Tina Bell in 1983", "* \"Bam Bam\" (song), a 1982 song by Sister Nancy", "* \"Bam Bam\", a 2011 song by King Charles (musician)", "* \"Bam Bam\", a 1966 song by The Maytals"]}, {"page": "Peter Poulton", "response": ["#REDIRECT Bam Bam (radio presenter)"]}, {"page": "Peter Jarrod", "response": ["#REDIRECT Bam Bam (radio presenter)"]}, {"page": "Greatest Hits Radio South Coast", "response": ["Celador then rebranded the station as Jack FM,Radio Today: Jack FM to Replace The Coast to bring it in line with its sister station in Bristol, from 4 July 2011.  All prior presenters except Robin Caddy were removed from the station, which switched to a format also used by Celador's other Jack stations - a presenter-led breakfast show (hosted by Bam Bam),RadioToday:Bam Bam launches Jack FM South Coast a Saturday morning \"World Of Sport\" show presented by Robin Caddy and automated music interspersed with topical one-liners in between songs voiced by actor Paul Darrow at other times."]}, {"page": "Capital Yorkshire", "response": ["* Bam Bam"]}, {"page": "1970 in British radio", "response": ["*2 January – Bam Bam (Peter Jarrod Poulton), radio presenter"]}, {"page": "Bam Bam (DJ)", "response": ["#REDIRECT Bam Bam (radio presenter)"]}, {"page": "Bam Bam (nickname)", "response": ["As a nickname, Bam Bam may refer to:", "* Bam Bam Bigelow (1961–2007), American professional wrestler", "* Bam Bam (wrestler) (born 1985), Mexican professional wrestler ", "* Bam Bam (radio presenter) (born 1970), a UK personality on Jack FM", "* Bam Bam (disambiguation)"]}, {"page": "Timeline of Kiss", "response": ["** January – Controversial changes are made to the station following Emap's decision to align the station with the rest of its operations. The on-air changes lead to criticisms from presenters and listeners who feel that the station is losing its musical direction. The changes see Bam Bam take over as presenter of the breakfast show.", "**April – Bam Bam is fired shortly before the station is handed a then record fine of £175,000 for a series of breaches which include prank calls being broadcast on his show without the consent of the 'victims.'", "**Robin Banks replaces Bam Bam as host of the breakfast show."]}]}}