{"wiki_id": "http://www.wikidata.org/entity/Q4857705", "itemLabel": "Baptist Wriothesley Noel", "itemDescription": "English evangelical clergyman", "wikipedia_url": "https://en.wikipedia.org/wiki/Baptist_Wriothesley_Noel", "wikipedia_page": {"main": "The Reverend The Honourable Baptist Wriothesley Noel ( REYE-əths-lee; 16 July 1798 – 19 January 1873) was an English evangelical clergyman of aristocratic family. He was minister of St John's Chapel, Bedford Row, London, from 1827 to 1848,  In 1849 he  became a Baptist minister and pastor of the nearby John Street Baptist Church in Bloomsbury, following the death of the former pastor, James Harington Evans. Noel twice served as President of the Baptist Union. A portrait of him hangs outside the library of Regent's Park College, Oxford.", "link_mentions": [{"page": "Earl of Gainsborough", "response": ["Several other members of the Noel family have also gained distinction. The Honourable William Noel, third son of the second Baronet and Lady Barham, was Member of Parliament for Rutland. The Honourable Baptist Wriothesley Noel, tenth son of the second Baronet and Lady Barham, was an evangelical clergyman. His second son Ernest Noel was a politician. The Honourable Gerard Noel, second son of the first Earl, was a Conservative politician. The Honourable Roden Noel, son of the first Earl by his fourth marriage, was a poet. His son Conrad Noel was a clergyman and prominent Christian Socialist. Lady Victoria Noel, daughter of the first Earl by his fourth marriage, was a philanthropist."]}, {"page": "T. A. Denny", "response": ["Thomas Anthony \"T. A.\" Denny (2 April 1818 – 25 December 1909) was an Irish bacon merchant, a self-described \"pork philanthropist\". Although not a member of the Salvation Army, he supported it financially. His philanthropic activities also included support for education. In April 1868, he married Mary Jane Noel (1829-1887), daughter of Baptist Wriothesley Noel. In 1893, he married the evangelist Elizabeth Hope, who was 24 years his junior. His son was the first-class cricketer and British Army officer Ernest Denny."]}, {"page": "Daniel Wilson (bishop)", "response": ["* MacAulay, in Life and Letters of Lord Macaulay appears to suggest that there was a life written by Wilson's successor at Bedford Row, Baptist Wriothesley Noel (see ), but this seems not to be listed at COPAC."]}, {"page": "Sir Gerard Noel, 2nd Baronet", "response": ["* Baptist Wriothesley Noel (1799–1873)"]}, {"page": "Ernest Noel", "response": ["Noel was the second son of the Reverend Baptist Wriothesley Noel and Jane Noel (née Baillie). His father was the tenth son of Sir Gerard Noel and Diana, Baroness Barham and brother of Charles Noel, 3rd Baron Barham (later 1st Earl of Gainsborough)."]}, {"page": "Baptist Wriotheseley Noel", "response": ["#REDIRECT Baptist Wriothesley Noel"]}, {"page": "Baptist Noel", "response": ["*Baptist Wriothesley Noel (1799–1873), English evangelical clergyman of aristocratic family"]}, {"page": "Wriothesley", "response": ["*Baptist Wriothesley Noel (1799–1873), English evangelical clergyman of aristocratic family"]}, {"page": "Thomas Dealtry", "response": ["In 1835 he became Archdeacon of Calcutta, remaining in the post until 1848 when he returned to England on furlough, succeeding Baptist Wriothesley Noel as pastor of St John's Church on Bedford Row."]}, {"page": "George Patten", "response": ["Patten had patronage in the painting of presentation portraits, many of which appeared in the exhibitions of the Royal Academy. Among these were portraits of Richard Cobden, Lord Francis Egerton, Hugh Boyd M'Neile, Baptist Wriothesley Noel, and Paganini the violinist, exhibited in 1833. He exhibited his own portrait in 1858."]}, {"page": "Prophetic conference", "response": ["A Morning Watch campaign, with Spencer Perceval, to continue the Apocrypha Controversy against the British and Foreign Bible Society was if anything counter-productive. James Edward Gordon was founder of the British Society for Promoting the Religious Principles of the Reformation, closely related to the Albury Circle, and also was a \"Recordite\", an associate of The Record edited by Alexander Haldane.  Critics of the Circle included the brothers Gerard Thomas Noel and Baptist Wriothesley Noel. The former was a prophetical exegete with a closely related approach; the latter a prominent evangelical."]}, {"page": "Diana Noel, 2nd Baroness Barham", "response": ["She was married on 21 December 1780 to Gerard Edwardes, who was a Cambridge-educated banker and member of Parliament. In 1798, he inherited the estates of his uncle, Henry Noel, 6th Earl of Gainsborough, and changed his surname to Noel. They had eighteen children, one of whom, Baptist Wriothesley Noel, stated that his parents' home \"combined whig politics, evangelical devotion, aristocratic unconventionality, and strong-mindedness in a potent blend\"."]}, {"page": "Gerard Thomas Noel", "response": ["Born on 2 December 1782, he was second son of Sir Gerard Noel, 2nd Baronet, and Diana Noel, a baroness in her own right as the only child of Charles Middleton, 1st Baron Barham; one of a family of 18, he was elder brother of Baptist Wriothesley Noel. The eldest son Charles was created an Earl in 1841, and the brothers were given the courtesy prefix The Honourable. His mother was a noted patron of evangelical ministers and abolitionist."]}, {"page": "Mary Jane Kinnaird", "response": ["Kinnaird was born Mary Jane Hoare in 1816 at Blatherwick Park in Northamptonshire. Her parents William Henry and Louisa Elizabeth died in 1819 and 1816 respectively leaving her an orphan whilst still a child. She lived with her paternal grandfather Henry Hoare of Mitcham Grove until he died in 1828, when her elder brother Henry Hoare (1807–1866) became her legal guardian.Jane Garnett, 'Kinnaird , Mary Jane, Lady Kinnaird (1816–1888)', Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2006 accessed 30 May 2017 Her day-to-day care was left to aunts and uncles and a governess. She was inspired by reading the evangelist William Romaine's works to Bible study, daily prayers and evangelism. In 1837 she became her uncle's de facto secretary. He was the Honourable and Reverend Baptist Wriothesley Noel who was based at St John's Chapel in Bedford Row in London. She established her own projects and formed St John's Training School for Domestic Servants in 1841. Another pet project was to help fund a Calvin memorial hall in Geneva. She and the Reverend Noel wanted to encourage the spread of European Protestantism and she was visited several times by both the Swiss minister Jean-Henri Merle d'Aubigné and the French minister Frédéric Monod."]}, {"page": "Caroline Maria Noel", "response": ["Noel was born on 10 April 1817 into an aristocratic family, daughter to Church of England cleric Gerard Thomas Noel and Charlotte Sophia, and was the niece of aristocratic clergyman Baptist Wriothesley Noel. She had 5 sisters; Anna Sophia, Louisa Diana, Charlotte, Emma and Elizabeth. She started to write poems aged 17, but ceased to do so for many years afterwards. In the last 25 years of her life she was struck down by crippling illness which left her bedridden. Due to this illness, Noel returned to writing poems and published a collection of verses in 1870 called The Name of Jesus. She died at 39 Cumberland Place, Hyde Park, London, on 7 December 1877 aged 60. She was buried at Romsey Abbey."]}, {"page": "James Harington Evans", "response": ["In about 1843 Evans started to suffer from head pains.  A dozen leeches were administered by his physician but his condition failed to improve.  His doctor then suggested that he rest and have a change of diet.  This eased the problem for a period, but he was unable to continue full time work.  Requiring assistance he appointed Baptist minister, Rev Charles Arundel Morice Shepherd (1806-1855), who he knew from his visits to the Barnstable area of Devon.  He was pastor of the Baptist chapels in the local parishes of Eastacombe, Hiscott and Lovacott, built by Chapman’s cousin, Thomas Pugsley.  Evans’ health never fully recovered, although at times he was able to minister on a limited basis.  In 1847 he had a bout of bronchitis brought on after he attended the funeral of his step-mother on a bitterly cold day. In 1849 Rev Shepard was indisposed and Evans pondered asking Rev Baptist Wriothesley Noel to minister temporarily.  Noel had recently seceded from the Established Church and Evans was of a mind to offer him the chapel on the surrender of his own life interest.  In August 1849 Noel was baptised into the John Street Chapel by Rev Shepherd with Evans in attendance.", "===Rev Baptist Wriothesley Noel===", "The Hon. and Rev. Baptist Wriothesley Noel, M.A., (1799–1873) was the son of Baroness Barham and Sir Gerard Noel-Noel, Bart; one of his brothers was Earl of Gainsborough.  He was educated at Trinity College, Cambridge, becoming one of the chaplains to the Queen in August 1841.  For twenty-one years he was the minister of St John’s Chapel, Bedford-row, London, resigning in 1848 when he seceded from the Established Church.  As a Dissenting minister he could have been prohibited from preaching within his former London diocese, but Bishop Blomfield took no such action.  Noel swore an oath as prescribed by 52 Geo Vol III, before preaching his first sermon at Mr Binney’s, Congregational Weigh House Chapel, where he received the Lord’s Supper."]}]}}