{"wiki_id": "http://www.wikidata.org/entity/Q4850612", "itemLabel": "Baldwin Wake Walker", "itemDescription": "British Royal Navy admiral (1802-1876)", "wikipedia_url": "https://en.wikipedia.org/wiki/Baldwin_Wake_Walker", "wikipedia_page": {"main": "Admiral Sir Baldwin Wake Walker, 1st Baronet,  (6 January 1802 – 12 February 1876) was Surveyor of the Navy from 1848 to 1861. and was responsible for the  Royal Navy's warship construction programme during the 1850s naval arms race and at the time of the introduction of the Ironclad warship; it was his decision to build HMS Warrior. He was created 1st Baronet Wake Walker, of Oakley House in 1856.", "link_mentions": [{"page": "Walker (surname)", "response": ["*Baldwin Wake Walker (1802–1876), English naval officer"]}, {"page": "John Pakington, 1st Baron Hampton", "response": ["With the Tories back in power, Pakington again held office under Lord Derby, as First Lord of the Admiralty from 1858 to 1859 and from 1866 to 1867. As First Lord he commissioned the first ironclad warship, HMS Warrior, launched in 1860. Following design work by John Scott Russell working with Baldwin Wake Walker, the time was ripe, given the French appointment of the naval architect Henri Dupuy de Lôme."]}, {"page": "HMS Vanguard (1835)", "response": ["Vanguard was commissioned in 1837 by Captain Sir Thomas Fellowes, with the normal picked complement of officers, including Baldwin Walker as First LieutenantWhilst Lambert claims that Walker was First Lieutenant (The Last Sailing Battlefleet, p159), an online biography of Walker states that Walker had been promoted to commander on 15 July 1834, and was commander (i.e. executive officer or 2nd in command) on Vanguard from 1 September 1836 until 24 November 1838 (Online biography of Admiral Sir Baldwin Wake Walker (1802-1876)) and Mr Miller, one of Symonds's favourite sailing masters. The object was clear. Symonds wanted his ships to be tried by men capable of making the best of their qualities... Out in the Mediterranean Vanguard soon made a name for herself as the fastest ship in the fleet, with the handiness of a frigate when beat out of Grand Harbour [Malta].' At the end of her first three-year commission Captain Fellowes wrote that Vanguard had 'great stability' was 'very easy at sea and works less than ships of her class' and had 'great advantage in all points of sailing.'Fellowes to Admiral Sir E Codrington C-in-C Portsmouth 29 Mar 1840 - UK National Archives ADM 87/10, quoted in Lambert, The Last Sailing Battlefleet, p159.", "*Online biography of Admiral Sir Baldwin Wake Walker (1802-1876)"]}, {"page": "Order of the Red Eagle", "response": ["* Baldwin Wake Walker"]}, {"page": "Order of Saint Anna", "response": ["*Baldwin Wake Walker"]}, {"page": "Defence-class ironclad", "response": ["In 1859 the Admiralty was not yet convinced that the very expensive (£377,000) s, which was more than twice that of wooden, steam-powered ships of the line,Brown, p. 14 had to be accepted as the norm. They noted that the  armour plate of the Warriors was adequate to deflect all ordnance currently afloat, and high speed was not necessary to prevent existing wooden ships from massing their fire against the ironclads. Their Lordships therefore requested a design which, while carrying the same armour, was smaller and slower, and thus cheaper, than the Warriors. Rear Admiral Sir Baldwin Wake Walker, Controller of the Navy, proposed that six ships be built to this design, but he was over-ruled and only two were ordered on 14 December 1859."]}, {"page": "Prince Consort-class ironclad", "response": ["When the first British ironclads were conceived, the Surveyor (Rear Admiral Sir Baldwin Wake Walker) said, \"They must be regarded as an addition to our force, as a balance to those of France, and not as calculated to supersede any existing class of ship; indeed no prudent man would, at present, consider it safe to risk up the performance of ships of this novel character, the naval Supremacy of Great Britain.\"Submission to Board of 27 July 1858, quoted in Lambert, \"Warrior\", p16.   For this reason, the Royal Navy continued to lay down and complete steam  two-deckers and three-deckers.Lambert, \"Battleships in Transition\", p122-140.  However, in 1861, it was clear that Britain was falling behind in ironclads laid down (see table below).The data in the table refer to sea-going iron clads.  It excludes coast defence ships.  The ten French ironclads laid down in 1861 were the start of the French programme of 1860, which was intended over a number of years to produce: 20 sea-going ironclads for the active fleet, 10 sea-going ironclads for the reserve fleet, and 11 floating batteries.Parkes, \"British Battleships\", p30.", "On 7 February 1861 Rear Admiral Sir Baldwin Wake Walker resigned as Controller.  He was replaced by Rear Admiral Sir Robert Spencer Robinson.Lambert, \"Battleships in Transition\", p 79–82."]}, {"page": "Surveyor of the Navy", "response": ["* Sir Baldwin Wake Walker  5 February 1848 – 1859.Lambert, The Last Sailing Battlefleet, p56", "*Rear-Admiral Sir Baldwin Wake Walker, 1859–1861"]}, {"page": "Baldwin Walker", "response": ["#REDIRECT Baldwin Wake Walker"]}, {"page": "Sir Baldwin Wake Walker, 1st Baronet", "response": ["#REDIRECT Baldwin Wake Walker"]}, {"page": "HMS Barham (1811)", "response": ["* Commander Baldwin Wake Walker"]}, {"page": "Robert Spencer Robinson", "response": ["On 7 Feb 1861 Rear Admiral Sir Baldwin Wake Walker resigned as Controller of the Navy.  Rear Admiral Robinson was appointed to replace him.Pages 79-82, Lambert, Andrew   Battleships in Transition, the Creation of the Steam Battlefleet 1815-1860, published Conway Maritime Press, 1984.  "]}, {"page": "Baldwin Wake-Walker", "response": ["#REDIRECT Baldwin Wake Walker"]}, {"page": "Wake-Walker", "response": ["* Baldwin Wake Walker  (1802–1876), surveyor of the Royal Navy"]}, {"page": "Arthur Cumming (Royal Navy officer)", "response": ["Cumming was posted to the brig HMS Espiegle on 2 October 1844, serving under Captain Thomas Pickering Thompson For more on Thomas Pickering Thompson see:  in the East Indies until 27 March 1845. The next day he was appointed to HMS Caledonia, a first-rate commanded by Alexander Milne that served as the flagship of his father Admiral Sir David Milne who was the Commander-in-Chief, Plymouth. On 29 April Cumming transferred to the first-rate HMS Queen, under the command of Baldwin Wake Walker and the flagship of John West in Devonport. Cumming was transferred again on 13 July 1845 to the second-rate HMS Albion, captained by Nicholas Lockyer and remained aboard until 30 November 1846."]}, {"page": "HMS Constance (1846)", "response": ["HMS Constance was a 50-gun fourth-rate frigate of the Royal Navy launched in 1846. She had a tonnage of 2,132 and was designed with a V-shaped hull by Sir William Symonds.Mariner's pp 64–68 She was also one of the last class of frigates designed by him.Brock p26 On her shakedown voyage from England to Valparaiso she rounded Cape Horn in good trim, her captain for this voyage being Sir Baldwin Wake Walker, who commented \"I think her a good sea boat, and a fine man of war\". On the voyage she encountered a hurricane at 62° south. Walker wrote that \"nothing could have exceeded the way she went over it, not even straining a rope yarn\".Sharp p698 In August 1848 her captain George William Courtenay, for whom the town of Courtenay was named,Akrigg p54 led 250 sailors and marines from Fort Victoria to try to intimidate the Indians.Gough p46"]}, {"page": "Wilson Fox", "response": ["In April 1887, he was suddenly summoned to the deathbed of his eldest brother at Wellington. Thence he went northwards towards his home at Rydal for a rest, but was seized with pneumonia on the way and died on 3 May at Preston, Lancashire. He was buried at Taunton on 6 May 1887. A bust in the Shire Hall, Taunton, was unveiled on 25 October 1888. His first wife died in 1870; by her he left three sons and three daughters. In 1874 he married Evelyn, daughter of Sir Baldwin Wake Walker, and widow of Captain Burgoyne, who was capsized off Cape Finisterre during a gale on 7 September 1870."]}, {"page": "1893 New Year Honours", "response": ["* Captain Sir Baldwin Wake Walker, , Royal Navy, for services as Senior Naval Officer engaged in the protection of the Newfoundland Fisheries."]}, {"page": "List of Royal Navy admirals (1707–current)", "response": ["|Sir Baldwin Wake Walker, 1st Baronet, KCB, CMG"]}, {"page": "3rd Cruiser Squadron", "response": ["|1|| Rear-Admiral || 25px || Sir Baldwin Wake Walker, Bt. ||June, 1902 – November, 1904 || "]}, {"page": "Westbourne Terrace", "response": ["Numbers 32 to 68 were developed by William Kingdom, whose architect was Thomas Marsh Nelson. They are Grade II listed.  Susan Lawrence, one of the earliest female Labour MPs, lived at number 44.   Civil engineer Charles Manby (1804–1884) lived at number 60 during 1870–77. Uriah Maggs opened his first bookshop at 44 Westbourne Terrace North in 1844.\"Maggs Brothers: A Note\" The Private Library. Vol. 4, No. 8 (October 1963), pp. 161-162 (p. 161).  Admiral Baldwin Wake Walker lived at number 66.    Field-Marshal Sir William Robertson (1860–1933) lived at number 88 during his retirement.Robertson, Sir William Robert, first baronet. Oxford Dictionary of National Biography. Retrieved 6 August 2018."]}, {"page": "Pearl-class corvette", "response": ["In 1856 Sir Baldwin Wake Walker submitted a ship design featuring a light deck supporting pivot guns disposed fore and aft.  , the first Pearl-class corvette to be built, reflected this design, followed by ,  and ."]}]}}