{"wiki_id": "http://www.wikidata.org/entity/Q4857499", "itemLabel": "Bap Kennedy", "itemDescription": "Northern Irish singer, songwriter and guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Bap_Kennedy", "wikipedia_page": {"main": "Martin Christopher Kennedy (17 June 1962 – 1 November 2016), known as Bap Kennedy, was a singer-songwriter from Belfast, Northern Ireland. He was noted for his collaborations with Steve Earle, Van Morrison, Shane MacGowan and Mark Knopfler, as well as for writing the song \"Moonlight Kiss\" which was on the soundtrack for the film Serendipity.Kennedy was in the rock band Energy Orchard for many years and also recorded a number of well-received solo albums including Domestic Blues, The Big Picture, The Sailor's Revenge, Let's Start Again and Reckless Heart. During his solo career, Kennedy performed, wrote and recorded songs with artists such as Steve Earle (on Domestic Blues), Van Morrison (on The Big Picture) and Mark Knopfler (on The Sailor's Revenge). Following the releases of The Big Picture and The Sailor's Revenge, he toured the US and Europe with Mark Knopfler of Dire Straits, who also produced Kennedy's 2012 album The Sailor's Revenge.\n\n", "link_mentions": [{"page": "1962", "response": ["* June 17 – Bap Kennedy, Northern Irish singer-songwriter (d. 2016)"]}, {"page": "Van Morrison", "response": ["Morrison has typically been supportive of other artists, often willingly sharing the stage with them during his concerts. On the live album A Night in San Francisco, he had as his special guests, among others, his childhood idols: Jimmy Witherspoon, John Lee Hooker and Junior Wells. Although he often expresses his displeasure (in interviews and songs) with the music industry and the media in general, he has been instrumental in promoting the careers of many other musicians and singers, such as James Hunter, and fellow Belfast-born brothers, Brian and Bap Kennedy."]}, {"page": "Energy Orchard", "response": ["Energy Orchard were a guitar-based rock band of the late 1980s and early 1990s, from Belfast, Northern Ireland. Fronted by Bap Kennedy (brother of singer-songwriter Brian Kennedy), their style drew heavily on the influence of Van Morrison and other rhythm and blues acts, but incorporated traditional elements of Irish folk music. The band emerged from the remnants of one other Belfast-based punk/new wave band, 10 Past 7.", "* Bap Kennedy (lead vocals)"]}, {"page": "Michael McGoldrick", "response": ["*The Sailor's Revenge - Bap Kennedy (2012)"]}, {"page": "Killyleagh", "response": ["*Killyleagh Castle is a private family residence that is said to be the oldest inhabited castle in Ireland. It has been the home of the Hamilton family since the 17th century Plantation of Ulster and acquired its fairy-tale silhouette in the 1850s when the turrets were added, but it is mostly the same castle that the second Earl of Clanbrassil rebuilt in 1666. The castle hosts occasional concerts. In the past performers have included Van Morrison, Arlo Guthrie, Jackson Browne, Glen Hansard and Bap Kennedy."]}, {"page": "Holywood", "response": ["* Bap Kennedy, singer-songwriter and record producer"]}, {"page": "BAP", "response": ["* Bap Kennedy (1962–2016), Northern Irish singer/songwriter"]}, {"page": "Serendipity (film)", "response": ["* \"Moonlight Kiss\" - Bap Kennedy"]}, {"page": "Summer Sundae", "response": ["*Bap Kennedy"]}, {"page": "Brian Kennedy (singer)", "response": ["Brian Edward Patrick Kennedy (born 12 October 1966) is an Irish singer-songwriter and author from Belfast. He scored a number of hit singles and albums in the UK and Ireland during the 1990s and 2000s. He represented Ireland in the Eurovision Song Contest 2006 and finished in 10th place. Brian is the younger brother of the late musician Bap Kennedy."]}, {"page": "Killyleagh Castle", "response": ["It is currently the home of Gawn Rowan Hamilton and his young family. The castle hosts occasional concerts; performers have included Van Morrison, Glen Hansard and Bap Kennedy. The gate lodges provide self-catering holiday accommodation. From 2012 to 2014, the castle was used to film CBBC show Dani's Castle."]}, {"page": "Glastonbury Festival line-ups", "response": ["* Bap Kennedy"]}, {"page": "Kill to Get Crimson", "response": ["Knopfler supported the release of Kill to Get Crimson with the Kill to Get Crimson Tour of Europe and North America, which started on 29 March 2008 in Amsterdam, and included 94 concerts in 88 cities, ending on 31 July 2008 in Miami, Florida. The tour lineup included Mark Knopfler (guitars, vocals), Richard Bennett (guitars), Danny Cummings (drums), Guy Fletcher (keyboards), Matt Rollings (keyboards), Glenn Worf (bass) and John McCusker (fiddle, cittern). The tour included a six-night run at the Royal Albert Hall in London, with Bap Kennedy as the supporting act. Jesca Hoop was the opening act for the North America leg of the tour."]}, {"page": "E-Squared Records", "response": ["E-Squared Records was a record label founded in 1996 by singer-songwriter and producer Steve Earle and seasoned music executive Jack Emerson.  The label produced a series of albums by Earle, starting with 1996's I Feel Alright.  Warner Bros. supported the label on many early releases.  Earle and Emerson soon began signing and releasing additional artists, such as 6 String Drag, The V-Roys, Bap Kennedy, and Cheri Knight.  According to Billboard the label developed a reputation for \"releasing fine albums by artists who excel at songcraft and whose music is happily uncategorizable — hovering around rock, country and pop but never landing in any one camp.\"\"Artemis Records Signs Steve Earle; Announces Co-Venture With E-Squared\", Business Wire, October 27, 1999"]}, {"page": "List of train songs", "response": ["*\"People Get Ready\" (Curtis Mayfield) by The Rance Allen Group, Lee Atwater, Jeff Beck, George Benson, The Blind Boys of Alabama, Billy Bragg, Eva Cassidy, Glen Campbell, Paul Carrack, The Chambers Brothers, Petula Clark, David Clayton-Thomas, Phil Collins, Tom Constanten, John Denver, The Doors, Bob Dylan, Jonathan Edwards, The Everly Brothers, Aretha Franklin, Janie Fricke, Al Green, Glen Hansard, The Housemartins, The Impressions, Jimmy James & the Vagabonds, Lyfe Jennings & Alicia Keys, Wynonna Judd, Bap Kennedy, Ladysmith Black Mambazo, Greg Lake, George Lynch, The Manhattans, Bob Marley, Ziggy Marley, Curtis Mayfield, The Meters, Ronnie Milsap, Aaron Neville, John Oates, Jimmy Osborne, Johnny Osbourne, Maceo Parker, The Persuasions, Johnny Rivers, David Sanborn, Dusty Springfield, Slim & the Supreme Angels, Pops Staples, Rod Stewart, Sonny Terry & Brownie McGhee, Hans Theessink, Phil Upchurch, Vanilla Fudge, Michelle Wright, Yellowman"]}, {"page": "2009 in Irish music", "response": ["| 19 October|| \"Howl On\" || Bap Kennedy ||  || || Taken from the album Howl On."]}, {"page": "Glastonbury Festival 2009", "response": ["Kilfenora Céilí BandTindersticksNewton FaulknerLisa HanniganGary Louris and Mark OlsonLúnasaBap KennedyHope&SocialStornowayCora Smyth Band"]}, {"page": "List of 2009 albums", "response": ["| Bap Kennedy"]}, {"page": "British Grove Studios", "response": ["*The Sailor's Revenge by Bap Kennedy (2012)"]}, {"page": "The Big Picture (Bap Kennedy album)", "response": ["The Big Picture is the sixth solo studio album by Bap Kennedy, released on August 2, 2005 on Loose Records.  It is a mix of country, Americana and Celtic soul with guest vocals by Shane MacGowan and also features a song co-written with Van Morrison. On \"Moriarty's Blues\", Carolyn Cassady recites from her book, Off the Road.", ":All songs and music by Bap Kennedy, except where noted.", "# \"Milky Way\" – (Van Morrison) (Bap Kennedy) - 3:49", "Category:Bap Kennedy albums"]}, {"page": "Howl On", "response": ["Howl On the fourth solo studio album by Bap Kennedy, was released on August 3, 2009 (see 2009 in music) on Kennedy's new label, Lonely Street Discs.  Excluding a cover of \"Hey Joe\", all songs on the album were written by Kennedy.  This is the first album he has written and recorded in his native Northern Ireland. This album features songs that were inspired by Kennedy's childhood memories of growing up with the influence of the popular American music rock icons Elvis Presley and Jimi Hendrix and the country music of Hank Williams. The songs also relate to 1960s American political figures: John F. Kennedy and to events: the 1969 moon landing and with Kennedy's childhood obsession with the American Dream.  Although the worldwide release was August 3, 2009, the album was released in Northern Ireland on July 4, 2009, with Kennedy's appearance at the Black Box in Belfast.", "Kennedy performed on the Acoustic Stage at the Glastonbury Festival on June 27, 2009, featuring songs from the album, with the official launching in Northern Ireland on July 4, 2009, with Bap Kennedy and his band's appearance at the Black Box in Belfast.", ":All songs and music by Bap Kennedy, except where noted.", "*Bap Kennedy – guitar, vocal", "*Produced by Bap Kennedy", "*Bap Kennedy Official videos: Hey Joe", "*Review: Bap Kennedy – Howl On|The Skinny", "Category:Bap Kennedy albums"]}, {"page": "Catfish Records", "response": ["The company latterly issued a number of historical recordings in other genres including jazz, country and bluegrass, but also featured releases from several contemporary artists including Michael Messer, Steve Earle, Bap Kennedy, Townes Van Zandt and Terry Clarke. The company also handled DVD releases for projects including Bill Wyman's Blues Odyssey, and the award-winning alt country documentary, Heartworn Highways."]}, {"page": "Domestic Blues", "response": ["Domestic Blues was the first solo album from Northern Ireland–based singer-songwriter, Bap Kennedy, and was released in 1998. The album was generally well-received, with allmusic calling it \"an exceptionally intelligent recording\" and Uncut saying that \"[Domestic Blues is] a fine collection of songs\" and reached number 8 in the billboard Americana chart", "*Bap Kennedy – acoustic guitar and vocals on all tracks", "Category:Bap Kennedy albums"]}, {"page": "Carwyn Ellis", "response": ["====With Bap Kennedy===="]}, {"page": "List of tributes to Hank Williams", "response": ["Irish singer/songwriter Bap Kennedy covered 11 songs by Hank Williams on his 1999 album Hillbilly Shakespeare.  His follow-up album Lonely Street, released in 2000, contains numerous references to Hank Williams, and on the sleeve notes, Kennedy acknowledges that the songs were inspired by Williams, as well as Elvis Presley."]}, {"page": "Simon Hanson", "response": ["In the early 1990s, Hanson worked with Tina Hamilton at Session Connection, playing drums with Ace of Base, Natalia Imbruglia, Hall and Oates and the P.F. Project amongst others. By the mid-nineties he started touring with Energy Orchard and worked on the Pain Killer album released in 1995. Hanson recorded with artist Bap Kennedy on MCA label. In 1995 he toured with Energy Orchard replacing drummer Dave Toner, as they were the support band of The Animals' tour in Germany."]}, {"page": "Proper Records", "response": ["* Bap Kennedy"]}, {"page": "The Sailor's Revenge", "response": ["The Sailor's Revenge is the eighth solo album by Bap Kennedy. The album was produced by Mark Knopfler. All eleven songs were written by Bap Kennedy.", "Category:Bap Kennedy albums"]}, {"page": "Mark Knopfler discography", "response": ["* The Sailor's Revenge (2012) by Bap Kennedy was recorded at British Grove Studios in 2011."]}, {"page": "Ed Deane", "response": ["Later, he appeared in the Mike Figgis movie Stormy Monday (which featured Tommy Lee Jones, Sting and Melanie Griffith). He also contributed substantially to the soundtrack and was the only featured guitarist apart from B B King. Ed also played on the soundtracks of the films Leaving Las Vegas and Serendipity (with Bap Kennedy).", "In recent years Deane has recorded on two albums with Belfast songwriter Bap Kennedy (The Big Picture and Lonely Street). He toured extensively with Kennedy, and together they have toured with Van Morrison, both as members of a band and as a duo."]}, {"page": "Privateering (album)", "response": ["Privateering was Knopfler's first album in three years. In January 2011, Knopfler produced the album The Sailor's Revenge for Bap Kennedy at British Grove Studios in London. Knopfler built the award-winning studio in 2005 and recorded Kill to Get Crimson (2007) and Get Lucky (2009) at the state-of-the-art facility. For the Bap Kennedy project, Knopfler enlisted the help of several top session players, including Jerry Douglas, Glenn Worf, John McCusker and Michael McGoldrick. They were joined by James Walbourne, Ian Thomas and Guy Fletcher. By March 2011, Knopfler and Guy Fletcher returned to British Grove to begin work on Knopfler's next album.", "By late May 2011, Knopfler and Fletcher were joined in the studio by Glenn Worf (bass), Richard Bennett (guitars, bouzouki, and tiple), and Jim Cox (piano, organ), as well as Ian Thomas (drums) who had played on the Bap Kennedy sessions earlier in the year. In early June, this core group was joined by folk musicians John McCusker (fiddle, cittern), Michael McGoldrick (whistles, uilleann pipes), and Phil Cunningham (accordion), with Paul Franklin (pedal steel guitar) joining later in the month. The recording process Knopfler and Fletcher chose for this album involved pre-tracking the songs with the core lineup and later bringing in the folk musicians to overdub their parts. For some tracks, the core group recorded their basic tracks over preliminary tracks that Knopfler and Fletcher worked out."]}, {"page": "James Brown (Elvis impersonator)", "response": ["Initially a career Belfast postman, Brown became a singer after the positive reaction he received performing \"Suspicious Minds\" and \"The Wonder of You\" at a bar in Belfast, and attracting the attention of local singer-songwriter, record producer & former Energy Orchard frontman Bap Kennedy. Brown describes himself as a lifelong Elvis fan and claims that rather than impersonating Elvis, his singing voice naturally sounds-alike."]}, {"page": "2016 in the United Kingdom", "response": ["**Bap Kennedy, 54, singer-songwriter."]}, {"page": "Last Chance Records", "response": ["* Bap Kennedy"]}]}}