{"wiki_id": "http://www.wikidata.org/entity/Q485904", "itemLabel": "Bob Weston", "itemDescription": "English guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Weston_(guitarist)", "wikipedia_page": {"main": "Robert Joseph Weston (1 November 1947 – c. 3 January 2012) was a British rock guitarist, who was a member of Fleetwood Mac in the early 1970s. He also recorded and performed with a number of other musicians, including Graham Bond, Long John Baldry, Murray Head, Sandy Denny and Danny Kirwan.", "link_mentions": [{"page": "Fleetwood Mac", "response": ["Primarily a British blues band at first, Fleetwood Mac scored a UK number one with \"Albatross\", and had other hits such as the singles \"Oh Well\" and \"Man of the World\". All three guitarists left in succession during the early 1970s, to be replaced by guitarists Bob Welch and Bob Weston and vocalist Dave Walker. By 1974, Welch, Weston and Walker had all either departed or been dismissed, leaving the band without a male lead vocalist or guitarist. In late 1974, while Fleetwood was scouting studios in Los Angeles, he heard American folk-rock duo Lindsey Buckingham and Stevie Nicks, and asked Buckingham to be their new lead guitarist, and Buckingham agreed on condition that Nicks could also join the band.", "thumb|1973 line-up with Christine McVie, Mick Fleetwood, Bob Weston, John McVie, and Bob Welch.", "In the three albums they released in this period they constantly changed line-ups. In September 1972 the band added guitarist Bob Weston and vocalist Dave Walker, formerly of Savoy Brown and Idle Race. Bob Weston was well known as a slide guitarist and had known the band from his touring period with Long John Baldry. Fleetwood Mac also hired Savoy Brown's road manager, John Courage. Fleetwood, The McVies, Welch, Weston and Walker recorded the band's seventh studio album, Penguin, which was released in January 1973. After the tour the band fired Walker because they felt his vocal style and attitude did not fit well with the rest of the band.", "Original Fleetwood Mac bassist Bob Brunning died on 18 October 2011 at the age of 68. Former guitarist and singer Bob Weston was found dead on 3 January 2012 at the age of 64. Former singer and guitarist Bob Welch was found dead from a self-inflicted gunshot wound on 7 June 2012 at the age of 66. Don Aaron, a spokesman at the scene, stated, \"He died from an apparent self-inflicted gunshot wound to the chest.\" A suicide note was found. Welch had been struggling with health issues and was dealing with depression. His wife discovered his body."]}, {"page": "1947", "response": ["** Bob Weston, British musician (d. 2012)"]}, {"page": "Mick Fleetwood", "response": ["By early 1971, with Christine McVie becoming an official member of the band, Fleetwood and the group boarded a plane to San Francisco. Spencer, fearful following the recent 1971 San Fernando earthquake, reluctantly boarded the plane. He left the hotel abruptly one afternoon and disappeared. He was found several days later to have joined Family International, then known as Children of God, a religious group. Once more, Fleetwood attempted to mediate; however, Spencer would not return. Bob Welch would become their next member.Carroll (2004) p. 33. Their next album, Future Games, was released later that year. Bare Trees came a year later, in 1972.Carroll (2004) p. 34–35. During the subsequent tours to promote the latter, Fleetwood once more adopted the role of mediator. Kirwan's self-destructive personality and problems with alcohol culminated in a refusal to go on stage before one concert; Fleetwood himself made the decision to fire the band member.Carroll (2004) p. 35–36. Furthermore, there were early signs of strife in the marriage of John and Christine McVie. Fleetwood again stepped in to mediate between the two members, talking Christine out of a decision to leave the group.Carroll (2004) p. 35. The band added guitarist Bob Weston and vocalist Dave Walker, formerly of Savoy Brown and the Idle Race. The resulting turmoil, however, negatively affected their next album, Penguin, released in 1973 to poor reviews.Carroll (2004) p. 37. Walker was subsequently asked to leave the group, and the next album Mystery to Me was received more warmly.Carroll (2004) p. 38–39."]}, {"page": "Dave Walker", "response": ["In August 1972 Danny Kirwan was fired from Fleetwood Mac and was replaced by Walker on vocals and Bob Weston on guitar. They joined Fleetwood Mac at a time when the band were struggling to record the Penguin album (1973, Reprise Records). Walker only appears on two tracks, his self-penned \"The Derelict\" and a cover of Jr. Walker & the All Stars' Motown classic \"(I'm A) Roadrunner\"."]}, {"page": "Bob Welch (musician)", "response": ["Over the next three albums Fleetwood Mac released, they constantly changed line-ups around the core of Mick Fleetwood, the McVies and Welch. Kirwan was replaced by Savoy Brown lead singer Dave Walker and Bob Weston on lead guitar. Both Walker and Weston played on Penguin. Released in January 1973, the album reached No. 49 on the Billboard Top 200 album chart in the United States. This album contained songs \"Bright Fire\" and \"Revelations\" by Welch."]}, {"page": "Nick Mason", "response": ["* Chimera – Chimera (1969/70; re-released 2002), w/ Rick Wright and Bob Weston collaborating"]}, {"page": "John McVie", "response": ["| \"Forever\" (McVie, Bob Weston, Welch)"]}, {"page": "Bob Weston", "response": ["Bob Weston (born 1965) is an American musician, producer, recording engineer, and record mastering engineer. Critic Jason AnkenyAnkeny, Jason. \"[ Bob Weston: Overview]\" from Allmusic.com declares that \"Weston's name and fingerprints are all over the American underground rock of the post-punk era, producing and engineering dates for a seemingly endless number of bands.\" As a performer, Weston is best known as the bass guitarist in the groups Volcano Suns and Shellac.", "Weston was born and raised in Waltham, Massachusetts. During the summers of 1985 and 1987, he marched as a bugler with the renowned Garfield Cadets Drum and Bugle Corps from Garfield, New Jersey.\"Engineers ,\" from Chicago Mastering Service The corps won the Drum Corps International World Championships in both those years. Weston still plays trumpet, as on the albums The Sea and the Bells by Rachel's (1996) and Things We Lost in the Fire by Low (2001).\"[ Bob Weston: Credits],\" from Allmusic.com", "Weston joined Steve Albini and Todd Trainer in Shellac in 1991. Under Albini, Weston honed his studio production skills and has gone on to record and mix material for bands including Sebadoh, June of 44, Polvo, The Coctails, Archers of Loaf, Chavez, Rachel's, Ken Vandermark, 33.3 and Rodan. Weston was also Albini's Assistant Engineer on Nirvana's In Utero album. According to a 2006 interview,Mitts, Eric. \"Bob Weston of Shellac \", 2006 being a musician has helped shape Weston's work recording, mixing and mastering: \"It’s obvious to me that the best recording engineers have played in bands. You understand the dynamic better and can almost become an unofficial band member during the session. And it’s pretty easy to tell on what sort of session your musical opinion is wanted or not.\" However, Weston's recording and mixing work is not limited to music: he occasionally freelances for National Public Radio, often working on comedy quiz show Wait, Wait, Don't Tell Me, which is headquartered in Chicago.DeRogatis, Jim. 2005. \" Weston remains one of the most in-demand bass players.\"Wait, Wait, Don't Tell Me: This Week's Show June 29, 2002\"", "* A detailed gear diagram of Bob Weston's Shellac bass rig is well-documented.Cooper, Adam (2000). \"Bob Weston's 2000 Shellac Bass Rig\". GuitarGeek.Com."]}, {"page": "Danny Kirwan", "response": ["His reaction after being sacked was initially one of surprise, and it seemed he had little idea of how alienated from the other band members he had become. Shortly afterwards, he met his replacement, Bob Weston, in a musicians' bar in London. Weston described the meeting: \"He was aware that I was taking over and rather sarcastically wished me the best of luck – then paused and added, 'You're gonna need it.' I read between the lines that he was pretty angry with the band.\"", "Kirwan's last album, Hello There Big Boy!, recorded in London in January 1979, featured guitar contributions from his Fleetwood Mac replacement Bob Weston on two tracks, \"Getting the Feeling\" and \"You\". Weston said later, \"As an experience it was difficult. Danny was barricaded in a womb of studio baffle boards much of the time. He had become totally reclusive. Danny appears to have played rhythm guitar on that album, but he couldn't handle the lead guitar work. It was evident he'd fallen totally apart.\""]}, {"page": "Law and Order (album)", "response": ["Two promotional music videos were shot for Law and Order, \"Trouble\" and \"It Was I\", both directed by Jerry Watson and produced by Paul Flattery. \"Trouble\" featured friends of Buckingham playing either guitar or drums. They included Mick Fleetwood, Bob Welch, and Bob Weston from Fleetwood Mac and singer-songwriter Walter Egan."]}, {"page": "Trouble (Lindsey Buckingham song)", "response": ["The distinctive music video for \"Trouble\" features a multi-instrumental \"big band\" consisting of male musicians—four as guitarists and two bassists, besides Buckingham, and six as drummers, including Mick Fleetwood. Walter Egan also appears in the music video as the second guitarist from the front. The video also features ex-Fleetwood Mac guitarists Bob Welch and Bob Weston,Trouble Video – Spot the players as well as Dwight Twilley and Andy Ward (the drummer from Camel). "]}, {"page": "Bob Weston (Guitarist)", "response": ["#REDIRECT Bob Weston (guitarist) "]}, {"page": "Penguin (album)", "response": ["Penguin is the seventh studio album by British-American rock band Fleetwood Mac, released in March 1973. It was the first Fleetwood Mac album after the departure of Danny Kirwan, the first to feature Bob Weston and the only one to feature Dave Walker.", "After Kirwan was fired following an altercation with the other band members during the Bare Trees tour, the band added guitarist Bob Weston and vocalist Dave Walker (formerly of Savoy Brown and The Idle Race) in September 1972. Weston was well known for playing slide guitar and had known the band from his touring period with Long John Baldry. Fleetwood Mac also hired Savoy Brown's road manager, John Courage. Rather than recording Penguin in a London studio, they hired the Rolling Stones Mobile Studio and brought it to Hampshire in order to record their next album within the domestic atmosphere of Benifold, their communal house. The album was subsequently mixed at AIR Studios in London.", "\"Caught in the Rain\", an instrumental, was the only track on a Fleetwood Mac record where Bob Weston received the sole writing credit.", "*Bob Weston – lead guitar, slide guitar on track 1, banjo and harmonica on track 5, harmony vocals on track 7"]}, {"page": "Mystery to Me", "response": ["Mystery to Me is the eighth studio album by British-American rock band Fleetwood Mac, released on 15 October 1973. This was their last album to feature Bob Weston. Most of the songs were penned by guitarist/singer Bob Welch and keyboardist/singer Christine McVie, who were instrumental in steering the band toward the radio-friendly pop rock that would make them successful a few years later.", "The album's name comes from a line in the chorus of \"Emerald Eyes\". \"Hypnotized\" was a minor US radio hit. \"Forever\" is one of only two Fleetwood Mac tracks to feature Bob Weston as a composer and one of only a small handful to feature John McVie in this capacity. \"Keep On Going\" was written by Bob Welch, but sung by Christine McVie because Welch decided her voice was better suited to the song than his. This was one of very few occasions when a member of Fleetwood Mac composed a song which was sung by another member. Bob Welch actually played bass guitar on this track, and is the only time a member of Fleetwood Mac has done so, other than the band's bassist John McVie.", "During the band's 1973 American tour, they appeared on the Midnight Special, but during the venture, it became clear that Bob Weston was having an affair with Mick Fleetwood's wife Jenny. Although Fleetwood tried to carry on playing with Weston, regardless of the extramarital issues, it soon became clear that something had to give and after a gig in Lincoln, Nebraska, Fleetwood told the McVies and Welch that he could no longer play with Weston in the line-up. John Courage, the band's road manager, fired Weston and put him on a plane back to the UK. With the tour cut short, the band also went back to England to break the news to their manager Clifford Davis, who was so angry that he sent another group of musicians on the road as Fleetwood Mac, claiming that he owned the name.", "*Bob Weston – electric guitar, slide guitar, acoustic guitar, backing vocals"]}]}}