{"wiki_id": "http://www.wikidata.org/entity/Q4858819", "itemLabel": "Barbara Clegg", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Barbara_Clegg", "wikipedia_page": {"main": "Barbara Clegg (born 1 March 1926) is a British actress and scriptwriter for television and radio.", "link_mentions": [{"page": "The Chrysalids", "response": ["The novel was adapted for BBC radio by Barbara Clegg in 1982, with a further adaptation by Jane Rogers in 2012. It was also adapted for the theatre by playwright David Harrower in 1999.", "The novel was adapted by Barbara Clegg as a single 90-minute drama for BBC Radio 4, directed by Michael Bartlett, and first broadcast on 24 April 1981. The cast includes:"]}, {"page": "Enlightenment (Doctor Who)", "response": ["Enlightenment is the fifth serial of the 20th season of the British science fiction television series Doctor Who, which was originally broadcast in four twice-weekly parts on BBC1 from 1 to 9 March 1983. It was the 127th serial of the series,From the Doctor Who Magazine series overview, in issue 407 (pp26-29). The Discontinuity Guide, which counts the unbroadcast serial Shada, lists this as story number 128. Region 1 DVD releases follow The Discontinuity Guide numbering system. and was written by Barbara Clegg and directed by Fiona Cumming, making it the first serial to be both written and directed by women.", "After penning a number of radio and TV scripts, including episodes of Crossroads and Waggoner's Walk, Barbara Clegg submitted a story idea to Doctor Who script editor Eric Saward, an acquaintance from the BBC drama department. Interested in writing for the series, Clegg had been inspired when distant relatives had stayed with her and demanded constant entertainment during their visit, basing the character of the Eternals upon them. Initially titled The Enlighteners, her submission involved ships racing through space that, with the addition of the Black Guardian sub-plot, eventually evolved into the story as screened. Saward and series producer John Nathan-Turner liked Clegg's ideas, and they commissioned the script in September 1981. ", "Writer Barbara Clegg based the Eternals on a wealthy group of her relatives who, upon visiting her, had demanded constant entertainment, treating other family members almost as \"lesser beings\". Clegg drew inspiration from the Bible's Book of Genesis, deriving the prize of enlightenment from The Tree of Knowledge within it; also, having read about Solar winds, she decided to use them as the basis of propulsion for space vessels. Clegg highlighted the nature of enlightenment, showing it not to be knowledge, as the Eternals believe, but wisdom, as demonstrated by Turlough's rejection of the Black Guardian.", "A novelisation of this serial, written by story author Barbara Clegg, was published by Target Books in May 1984, with a cover by Andrew Skilleter, and was numbered 85 in the ongoing range. It was the first Doctor Who novelisation to be penned by a woman. On its publication Doctor Who Magazine was underwhelmed by the book, claiming in their review that \"In many ways, it falls into the familiar Terrance Dicks pitfalls, being a straightforward reworking of the script with \"said\" following all the speeches. For all its faults, Enlightenment remains a good read, simply because of the strength of the story...\" The book was repackaged as part of The Sixth Doctor Who Gift Set later in 1984, along with three other Doctor Who novels; The Dominators, Mawdryn Undead and The Five Doctors.", "Enlightenment was released on VHS in February 1993. It was subsequently released on DVD as part of the Black Guardian Trilogy, along with preceding stories Mawdryn Undead and Terminus on 10 August 2009. The second disc of the DVD includes a \"Special Edition\" version of the story; a movie-style edit featuring new CGI graphics throughout, with a newly recorded introduction by director Fiona Cumming.  Doctor Who Magazine was not enthusiastic about the new edit suggesting, that \"...what is special about it is up for debate.\" The reviewer disparaged the new special effects, stating that \"...this is ironic as there are few Doctor Who stories less in need of replacement effects than Enlightenment. The original model work is gorgeous, while this substitute material is crude and unsophisticated in comparison.\" Alongside the special edition, the DVD contained a number of extra features, including a Making of... documentary and extended interviews with director Fiona Cumming, writer Barbara Clegg and actor Mark Strickson, a documentary on the Guardians plus an excerpt from the Russell Harty Christmas Party TV special featuring Peter Davison. This serial was also released as part of the Doctor Who DVD Files in issue 57 on 9 March 2011."]}, {"page": "Marc Platt (writer)", "response": ["*Doctor Who: The Lost Stories Point of Entry (with Barbara Clegg)"]}, {"page": "Emergency Ward 10", "response": ["* Barbara Clegg as Nurse Jo Buckley, staff nurse"]}, {"page": "Victoria Wicks", "response": ["|(BBC R4) By Barbara Clegg"]}, {"page": "List of Doctor Who novelisations", "response": ["|127 ||85||Enlightenment || data-sort-value=\"Clegg, Barbara\"|Barbara Clegg || 16 February 1984 || 24 May 1984|| 3 September 2020"]}, {"page": "1926 in the United Kingdom", "response": ["** Barbara Clegg, actress and scriptwriter"]}, {"page": "List of unmade Doctor Who serials and films", "response": ["Written by Barbara Clegg this was submitted in late 1982. It dealt with a race of intelligent youths controlled by a lone Dalek. It was later adapted by John Dorney for Big Finish's The Lost Stories in October 2011, which backdated the story to after the events of the Season 20 serial Arc of Infinity, with Nyssa and Tegan as companions of the Fifth Doctor.", "Written by Barbara Clegg, this story was submitted in late 1982 and dealt with the Doctor searching for a missing Time Lord who has regenerated to merge with his TARDIS.", "Written by Barbara Clegg, this story was submitted in late 1982 and saw the Doctor travel down the River Styx in Ancient Greece where he would discover an alien race, the Hadeans, kidnapping the women of Greece due to their own race being rendered infertile.", "Written by Barbara Clegg, this storyline involved the Doctor and Peri in Elizabethan London as an alien race, the Omnim, return via an Aztec knife. It was also to feature Christopher Marlowe. It was later adapted by Marc Platt for Big Finish as part of their The Lost Stories series in April 2010."]}, {"page": "Clegg (name)", "response": ["* Barbara Clegg, British actor"]}, {"page": "Point of Entry (audio drama)", "response": ["*Barbara Clegg wrote the 1983 TV story Enlightenment.  Another of her lost stories, The Elite, was adapted by Big Finish in 2011."]}, {"page": "John Dorney", "response": ["| Doctor Who: The Lost Stories – The Elite || Big Finish Productions || Writer (based on the outline by Barbara Clegg), October 2011"]}, {"page": "The Chrysalids (radio drama)", "response": ["Dramatized by Barbara Clegg"]}, {"page": "The Elite (audio drama)", "response": ["* Barbara Clegg wrote the 1983 TV story Enlightenment.  Another of her lost stories, Point of Entry, was adapted by Big Finish in 2010."]}, {"page": "Waggoners' Walk", "response": ["Most of the storylines involved the tenants of No. 1 Waggoners' Walk, a large townhouse divided into several flats. Other settings included the local pub The Waggoners, the offices of the Hampstead Herald, Minden Road and the nearby Belsize Park. Hyem and Downer continued to produce scripts for the programme throughout its run and were joined by other writers including Peter Ling, Barbara Clegg and Terry James. The directors included Piers Plowright, who later became the programme's executive producer, David Spenser, Glyn Dearman, Anton Gill, David Johnston and Kay Patrick. "]}, {"page": "Gems (TV series)", "response": ["Scriptwriters included: Guy Meredith, Christopher Russell, Martin Worth (Series 1), Barbara Clegg (Series 1-2), Ben Steed (Series 1), Bill Lyons (Series 1), Valerie Georgeson (Series 1), Jenny McDade (Series 1), Liane Aukin (Series 2), Ted Rhodes (Series 2) and Tony Slattery (Series 3)."]}]}}