{"wiki_id": "http://www.wikidata.org/entity/Q4863673", "itemLabel": "Barrington Hill", "itemDescription": "English cricketer (1915-1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barrington_Hill", "wikipedia_page": {"main": "Barrington Julian Warren Hill (31 July 1915 – 7 August 1985) was an English cricketer.  Hill was a right-handed batsman who bowled right-arm off break.  He was born in Broadstairs, Kent.\nEducated at St. Lawrence College, Ramsgate, where he represented the college cricket team, Hill progressed to study at Christ Church, Oxford, making his first-class debut for Oxford University against Leicestershire in 1935.  He next played for the university in 1937, making three first-class appearances that season, one each against Lancashire, the Army and the Free Foresters.  In his 4 first-class appearances for the university, he scored 46 runs at an average of 9.20, with a high score of 28.  With the ball, he took 5 wickets at a bowling average of 25.80, with best figures of 2/48.Having been on the books of Kent since 1935, Barrington played for the county Second XI in the Minor Counties Championship until 1939, but did not make any First XI appearances.  Following World War II, he played once for Buckinghamshire against Dorset in the 1946 Minor Counties Championship.  Later in life he became an author, writing a number of books on diverse subjects, including as joint-author of The history of I Zingari.  He was also a master at Eton College for many years.  He died in Sandwich, Kent on 7 August 1985 following a long illness.", "link_mentions": [{"page": "Ian Henry", "response": ["Henry made a single first-class appearance for the Free Foresters against Oxford University at University Parks in 1937. In a match which Oxford University won by ten wickets, Henry top-scored with 80 in the Free Foresters first-innings, before he was dismissed by David Macindoe, while in their second-innings he was dismissed for 4 runs by Barrington Hill. This was his only first-class appearance."]}]}}