{"wiki_id": "http://www.wikidata.org/entity/Q4863660", "itemLabel": "Barrington Dacres", "itemDescription": "Royal Navy officer during the French Revolutionary Wars and the Napoleonic Wars (died 1806)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barrington_Dacres", "wikipedia_page": {"main": "Barrington Dacres (died 25 October 1806) was an officer of the Royal Navy, who saw service during the French Revolutionary and Napoleonic Wars.  He eventually rose to the rank of Post-Captain. He did not see action in many significant engagements, and is chiefly remembered for the accidental loss of his ship to the French, and for the unsuccessful chase of two French ships in the English Channel. He did command a number of ships of the line under several of the leading naval commanders of his time. His early death though prevented him from achieving the same seniority and degree of fame as his relatives did.", "link_mentions": [{"page": "HMS Guerriere (1806)", "response": ["The two ships arrived off Cape Prior on 2 September, when they were again spotted, this time by a British squadron under the command of Commodore Sir Edward Pellew. The only ship ready and able to pursue the French was HMS Culloden, under the command of Captain Barrington Dacres. He immediately began a pursuit and after a chase, managed to close the French and open fire. Duguay-Trouin, being the weathermost ship, got into Corunna first. The forts defending the port opened fire on Culloden, but she continued to engage Guerrière, until almost within the port, at which point she hauled off and returned to the squadron. Culloden suffered four men wounded, whilst Guerrière had suffered considerable damage to her masts and rigging and had lost six men killed and 15, including her captain and first lieutenant, wounded."]}, {"page": "James Richard Dacres (Royal Navy officer, born 1788)", "response": ["Dacres was born in Lowestoft on 22 August 1788, the son of Captain, later Vice-Admiral, James Richard Dacres and his wife Eleanor Blandford Pearce. The Dacres would eventually become a substantial naval dynasty, James's elder brother Barrington Dacres embarked on a naval career and rose to be post-captain, while their uncle, Richard Dacres became a vice-admiral. His cousin, Richard's son Sydney Dacres would eventually be an admiral, and First Sea Lord. James Richard Dacres entered the navy in 1796 at the age of eight, serving aboard his father's old ship, the 64-gun , as a first class volunteer. He moved aboard the 98-gun  in 1797 and was present during the expedition to Ferrol in August 1800 as a lieutenant aboard the 74-gun HMS Impetueux."]}, {"page": "Sydney Dacres", "response": ["Dacres was born in 1804, the son of Captain, later Vice-Admiral, Sir Richard Dacres and Martha Phillips Milligan. The Dacres had a long history of naval service, Sydney's uncle, James Richard Dacres, was a vice-admiral, while his cousins Barrington Dacres and James Richard Dacres would both serve in the navy, the former becoming a post-captain, the latter a vice-admiral. His father, Richard Dacres, had served with Sir Sidney Smith as his flag captain aboard HMS Pompee during his Mediterranean campaign, and under Captain Sir John Colpoys, while Colpoys was commander of  and . His elder brother Sir Richard James Dacres was a general in the British Army and was also awarded the GCB."]}, {"page": "Richard Dacres (British Army officer)", "response": ["Richard James was born in 1799, the son of Richard Dacres, who became a vice-admiral in the Royal Navy, and his wife Martha Phillips Milligan. The Dacres had a long history of naval service, Sydney's uncle, James Richard Dacres, was a vice-admiral, while his cousins Barrington Dacres and James Richard Dacres would both serve in the navy, the former becoming a post-captain, the latter a vice-admiral. His younger brother, Sydney Dacres, also had a naval career, eventually reaching the rank of Admiral, and serving as a First Naval Lord. Richard James attended the Royal Military Academy, Woolwich, in 1815, and embarked on a career with the army when he joined the Royal Artillery as a second lieutenant on 15 December 1817."]}, {"page": "James Richard Dacres (Royal Navy officer, born 1749)", "response": ["Dacres had married Eleanor Blandford Pearce, of Cambridge, on 1 August 1777 during a period in Britain while in command of the Ceres. The marriage took place at Totnes, Devon and subsequently produced two sons. Both had substantial naval careers, the elder, Barrington Dacres became post-captain, the younger, James Richard Dacres rose to be a Vice-Admiral.  Dacres retired from active service in 1809 having amassed considerable wealth from his time in Jamaica. He did not live long to enjoy it though, dying on 6 January 1810 at the age of 60 after a fall from his horse."]}, {"page": "Dacres", "response": ["*Barrington Dacres (died 1806), Royal Navy captain"]}, {"page": "Barrington (name)", "response": ["*Barrington Dacres (died 1806), Royal Navy captain"]}, {"page": "Blockade of Saint-Domingue", "response": ["At Ferrol, a British battle squadron cruised off the port under the command of Commodore Sir Edward Pellew, HMS Culloden under Captain Barrington Dacres sailing at some distance from the remainder of the squadron. On 2 September, Touffet's small squadron appeared to windward sailing for the port of Corunna and Dacres was well situated to intercept them, opening fire at long range at 11:50. The French were faster than Culloden however, Duguay-Trouin successfully entering Corunna ahead of Guerrière as the Spanish batteries opened fire on the British ship. Although Dacres managed to damage Guerrière's masts and rigging severely, inflicting casualties of six killed and 15 wounded, the French frigate was able to enter Corunna ahead of Culloden. Dacres, who had brought his ship right into the entrance to the port was forced to retire, having suffered four men wounded.Clowes, p. 323"]}]}}