{"wiki_id": "http://www.wikidata.org/entity/Q4864689", "itemLabel": "Barry Rose", "itemDescription": "British organist and choir director", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Rose", "wikipedia_page": {"main": "Barry Michael Rose OBE FRAM FRSCM HonFRCO (born 24 May 1934) is a choir trainer and organist. He is best known for founding the choir and the pattern of daily sung worship at the new Guildford Cathedral in 1961, as well as directing the music at the 1981 wedding of Charles, Prince of Wales and Diana, Princess of Wales at St Paul's Cathedral in London.", "link_mentions": [{"page": "Giovanni Pierluigi da Palestrina", "response": ["*: a 1971 concert performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "St Albans Cathedral", "response": ["The earliest known name of an organist at St Albans is Adam from the early 13th century. Robert Fayrfax, the prominent English Renaissance composer, is recorded as being organist from 1498 to 1502, and was buried there following his death some 20 years later. Since 1820 the post of organist and master of the music has been held by a number of well-known musicians, including Peter Hurford, Stephen Darlington and Barry Rose. The current master of the music, since 1998, is Andrew Lucas.Andrew Lucas (St Albans Bach Choir)  The assistant master of music at the cathedral is sometimes also the master of music at St Albans School — for example, Simon Lindley and Andrew Parnell."]}, {"page": "Chris Squire", "response": ["Squire was born on 4 March 1948 in the north west London suburb of Kingsbury, to Peter and Joanne Squire. He grew up there and in the nearby Queensbury and Wembley areas.Welch 2008, p. 24.Hedges 1982, p. 15. His father was a cab driver and his mother a secretary for an estate agent. As a youngster Squire took a liking to Lena Horne and Ella Fitzgerald records belonging to his father, though his main interest was church music. At age six,Welch 2008, p. 25. he joined the church choir at St Andrew's in Kingsbury as a treble with Andrew Pryce Jackman, a friend of his who lived nearby. The choir got to perform at St. Paul's Cathedral. Their choirmaster Barry Rose was an early influence on Squire. \"He made me realise that working at it was the way to become best at something\". Squire also sang in the choir at his next school, Haberdashers' Aske's Boys' School, then located in Hampstead.Welch, Chris.: Close to the Edge: The Story of Yes. (London: Omnibus Press, 1999). He played the harmonica on his way home from school."]}, {"page": "Samuel Sebastian Wesley", "response": ["*: a \"live\" 1970 performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "List of Anglican church composers", "response": ["*Barry Rose"]}, {"page": "William Henry Harris", "response": ["*: a 1970 concert performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "William Mathias", "response": ["* : a 1969 performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "Harold Darke", "response": ["*: a 1968 performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "Fish Out of Water (Chris Squire album)", "response": ["The introduction to \"Hold Out Your Hand\" features a passage played on the pipe organ at St Paul's Cathedral by cathedral organist Barry Rose, who had known Squire and Jackman during their boyhoods. The organ continues throughout the song, creating a rather original sound and reflecting Squire and Jackman's experiences together as church choristers. The title of \"Lucky Seven\" refers to the song being in a 7/8 time signature. A melodic passage from Yes' song \"Close to the Edge\" appears in the finale of \"Safe (Canon Song)\". The closing passage on \"Safe\" was played on the 4-string bass section of a double-neck guitar, using only the pickups of the 6-string guitar section.", "* Barry Rose – pipe organ (track 1)"]}, {"page": "List of organists", "response": ["* Barry Rose (born 1934) "]}, {"page": "Robert Parsons (composer)", "response": ["*: a 1973 performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "Elizabeth Poston", "response": ["*: a 1970 performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "Run with the Fox", "response": ["Andrew Pryce Jackman, a childhood friend and frequent collaborator of Squire, was in charge of orchestration and since they had both been boy choristers with Barry Rose at St. Andrew's Church, Kingsbury, they contacted him to provide a boys choir to do the backing. By this time Rose was at St.Paul's Cathedral, so it is the St.Paul's boys who appear on the song. The B-side of the single, \"Return of the Fox\", is an instrumental variation of \"Run with the Fox'. It features Dave Lawson (ex-Greenslade keyboardist) on keyboards, and Squire's then wife Nikki on backing vocals. Following \"Run with the Fox\", both musicians collaborated again in the band Cinema which ultimately led to the reformation of Yes.  The song would feature on Squire's festive album Chris Squire's Swiss Choir with another choir dubbed onto the track."]}, {"page": "Sir George Monoux College", "response": ["* Barry Rose OBE, conductor and organist of Guildford Cathedral from 1960–74"]}, {"page": "Carol Symphony", "response": ["Two sections from the First Nowell section were used for the 1943 Children's Hour adaptation of John Masefield's The Box of Delights. The work was later used as the opening and closing titles of the 1984 BBC Television adaptation of the same novel. It featured a recording conducted by Barry Rose in 1966 of the Pro Arte Orchestra at Guildford Cathedral. During World War II, the book had been adapted for radio on the BBC's Children's Hour, and Hely-Hutchinson's same music had been used. Prof Hely-Hutchinson later became the BBC's Director of Music, in 1944, until his death in 1947.", "* Pro-Arte Orchestra, Barry Rose at Guildford Cathedral recorded by EMI in 1966 (HMV Classics and EMI)"]}, {"page": "Alan Gray", "response": ["The Magnificat and Nunc dimittis has been recorded by the Westminster Abbey Choir, conducted by James O'Donnell.Parry: Songs of farewell & works by Stanford, Gray & Wood, Hyperion CDA68301 (2020) The 1914 partsongs - 'Peace', 'The Dead', and 'The Soldier' - have been recorded by Truro Cathedral Choir.Blow out, ye bugles Regent REGCD451 (2015), reviewed at MusicWeb International Barry Rose and the Guildford Cathedral Choir also recorded 'The Dead' and  'The Soldier'.Creator Spirit: A 20th Century Choral Anthology, Guild GMCD7110 (1995) John Kitchen has recorded the Organ Sonata No 2.Victorian Organ Sonatas - Volume 2, Priory PRCD805 (2005)", "* Performance of 'The Soldier' from the cycle 1914, Guildford Cathedral Choir, conducted by Barry Rose"]}, {"page": "1934 in the United Kingdom", "response": ["** Barry Rose, choir director and organist"]}, {"page": "The Crucifixion (Stainer)", "response": ["The composer Ernest Walker dismissed the work, writing in 1924 that \"Musicians today have no use for The Crucifixion\";  though Stainer himself characterised his work as \"rubbish,\"Stainer: The Crucifixion, @ allmusic.com the work continues to be performed today. The oratorio has been recorded several times, including a popular recording released by RCA Victor in 1930, featuring Richard Crooks and Lawrence Tibbett.Barry Rose: \"Not Another Crucifixion?\" in The American Organist 37:4 (April 2003) on Rose's arrangement for orchestra (publ. Novello)", "Stainer's work has in recent times been performed in an orchestrated version. For instance Craig Hawkins' arrangement of the work has been performed in the USA (2004 premiere, New York) and the UK (Norwich, 2010). Barry Rose has also produced an orchestration."]}, {"page": "Choir of Leeds Parish Church", "response": ["The parish church uses the New English Hymnal and its 2006 supplement \"New English Praise\" 2006; the Worcester Psalter edited by Sir Ivor Atkins provides the pointing of the psalms. Other collections include Anthems for Unison and Two-Part Singing, Volumes and 2 RSCM, Anthems for Men's Voices, the Favourite Anthem Book Volume 5, Sing Low Novello edited by Dr Barry Rose, Advent for Choirs edited by Malcolm Archer & Stephen Cleobury, Lent, Passiontide and Easter for Choirs edited by Lionel Dakers and John Scott, Hilariter [RSCM Ripon and Leeds] - a resource book for Eastertide edited by Simon Lindley, The University Carol Book - edited by Dr Erik Routley and Hymns for Choirs edited by Sir David Willcocks, and 100 Carols for Choirs edited by Sir David Willcocks and John Rutter."]}, {"page": "Wedding of Prince Charles and Lady Diana Spencer", "response": ["Three choirs, three orchestras and a fanfare ensemble played the music for the service. These were the Bach Choir, the Choir of St Paul's Cathedral, the Choir of the Chapel Royal, the Orchestra of the Royal Opera House, the Philharmonia Orchestra and the English Chamber Orchestra and a fanfare ensemble from the Royal Military School. The choirs were conducted by Barry Rose, the choirmaster at St Paul's. The cathedral's organist, Christopher Dearnley; and its sub-organist, John Scott; played the organ. The Orchestra of the Royal Opera House, the Philharmonia Orchestra and the English Chamber Orchestra were conducted by Sir David Willcocks, who was the director of the Royal College of Music and of the Bach Choir; Richard Popplewell, the organist at Chapel Royal; and Sir Colin Davis, who was the musical director of Covent Garden. Music and songs used during the wedding included the \"Prince of Denmark's March\", \"I Vow to Thee, My Country\", \"Pomp and Circumstance No.4\" and the British National Anthem (\"God Save the Queen\"). New Zealand soprano, Kiri Te Kanawa sang \"Let The Bright Seraphim\" from G. F. Handel's Samson."]}, {"page": "St Albans Cathedral Choir", "response": ["*1988 Barry Rose"]}, {"page": "Barry Rose (American football)", "response": ["Barry Rose is a former wide receiver in the National Football League. Rose was drafted in the tenth round of the 1992 NFL Draft by the Buffalo Bills and would play with the Denver Broncos during the 1993 NFL season. Later he would play with the Hamilton Tiger-Cats of the Canadian Football League in 1995 and was drafted by the London Monarchs of the World League of American Football in 1997. He was inducted into the University of Wisconsin-Stevens Point Athletics Hall of Fame in 2006."]}, {"page": "Rose (surname)", "response": ["*Barry Rose (born 1934), English choir trainer and organist"]}, {"page": "List of musicians at English cathedrals", "response": ["Organists at Guildford Cathedral have included choral director Barry Rose and the composer Philip Moore.", "*1961 Barry Rose (later Master of the Choir St Paul's Cathedral, London and Master of the Music at St Albans Cathedral)", "* 1974–84 Barry Rose OBE  (Master of the Choir 1977–84; later Master of Music St Albans Cathedral)", "* 1977–1984 Barry Rose OBE 1977–1984 (Master of the Choir)", "The posts of organist and master of the music at St Albans Cathedral have been held by a number of well-known musicians, including Peter Hurford, Stephen Darlington and Barry Rose. Andrew Lucas is the current Master of the Music.Andrew Lucas (St Albans Bach Choir) . Since 1963 the cathedral has been home to the St Albans International Organ Festival, winners of which include Dame Gillian Weir, Thomas Trotter and Naji Hakim.", "*1988 Barry Rose"]}, {"page": "1934 in music", "response": ["*May 24 – Dr Barry Rose, English choir-trainer and organist"]}, {"page": "Festival Te Deum (Britten)", "response": ["*: a 1970 performance by Guildford Cathedral Choir, directed by Barry Rose"]}, {"page": "1934 in British music", "response": ["*24 May – Barry Rose, choir-trainer and organist"]}, {"page": "May 1934", "response": ["*Born: Barry Rose, choir trainer and organist, in Chingford, England"]}, {"page": "The Box of Delights (TV series)", "response": ["The recording used in the 1984 adaption was from a 1966 EMI recording (LP catalogue No. ESD 7021) featuring the Pro Arte Orchestra conducted by Barry Rose. Incidental music is by Roger Limb of the BBC Radiophonic Workshop using a combination of orchestral and synthesised instruments. Tom Urges notes that Limb's incidental music \"adds to the heady mix of ancient and modern, of reality and fantasy, and builds on the atmosphere we are prepared for as viewers by one of the best choices of theme music in the history of British TV.\""]}, {"page": "St Albans Bach Choir", "response": ["* Barry Rose 1989 - 1997"]}, {"page": "Thou knowest, Lord, the secrets of our hearts (Purcell)", "response": ["* , sung by the Guildford Cathedral Choir conducted by Barry Rose"]}, {"page": "Nigel McClintock", "response": ["Nigel McClintock was born in Belfast, Northern Ireland and studied at Methodist College Belfast. He then moved to London, studying piano, organ and choral conducting at the Royal College of Music under Nicholas Danby, Patricia Carroll and Paul Spicer. During his studies, he held organ scholarships at Mill Hill School and St Albans Cathedral, where he worked under Barry Rose.", "Between his undergraduate and postgraduate studies at the Royal College of Music, he worked as director of Music at St George's Parish Church, Belfast. There, he produced numerous recordings of the boy choristers with Lammas Records, which were produced by Barry Rose. After received an MMus in Choral Conducting, he worked as director of music at Croydon Parish Church from 2000 to 2007. "]}]}}