{"wiki_id": "http://www.wikidata.org/entity/Q4867226", "itemLabel": "Basil Moss", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Basil_Moss", "wikipedia_page": {"main": "Basil David Moss (25 May 1935 – 28 November 2020) was a British character actor, who featured regularly on television in the 1960s and on radio in the 1970s.", "link_mentions": [{"page": "Albert Campion", "response": ["Various stories were adapted for BBC Radio over the years. Campion was played by James Snell, Richard Hurndall, William Fox, and Basil Moss."]}, {"page": "Doppelgänger (1969 film)", "response": ["*Basil Moss as Monitoring Station Technician"]}, {"page": "Play of the Month", "response": ["|Leonard Rossiter,Keith Barron,David Langton,John Phillips,Nicholas Pennell,Bernard Hepton,Burt Kwouk,Michael Culver,Stephanie Bidmead,Anthony Jacobs,Basil Moss,Peter Copley,Godfrey James"]}, {"page": "Trevor Sather", "response": ["Along with Sacha Tarter, Sather co-wrote and co-starred in the 2006 British movie The Gigolos, directed by Richard Bracewell. Sather played the 'gent' to Tarter's 'player' in the movie about a fantasy world of London gigolos and their clients. The movie also starred Susannah York, Anna Massey, Siân Phillips, and British actor and singer Basil Moss."]}, {"page": "Pathfinders (TV series)", "response": ["|John Arnatt, John Barron, Edd Byrnes, Brian Grellis, Rutger Hauer, Roy Holder, John Horsley, David Lodge, Basil Moss, Julian Orchard, Johnnie Wade, Kenneth Watson, Hans De Vries, Richard Shaw"]}, {"page": "Sacha Alexander", "response": ["With Trevor Sather, Alexander co-wrote and co-starred in the 2006 British movie The Gigolos, directed by Richard Bracewell. Sather played the 'gent' to Alexander's 'player' in the movie about a fantasy world of London gigolos and their clients. The movie also starred Susannah York, Anna Massey, Siân Phillips, and British actor and singer Basil Moss."]}, {"page": "List of Old Paulines", "response": ["*Basil Moss (1935–2020); television and radio actor"]}, {"page": "Michael Spice", "response": ["Spice played the character of Peter Tyson in the BBC Radio play The Ropewalk in January 1969. The play evolved into the long-running BBC Radio Two serial Waggoners' Walk, in which Basil Moss took over the role of Peter Tyson, with Spice taking the role of Matt Prior, a role he played until the serial's end in May 1980."]}, {"page": "Clinic Exclusive", "response": ["* Basil Moss as Philip Eveleigh "]}, {"page": "The Rat Catchers", "response": ["It hangs in the air around us. It is invisible and yet pointed with deadly accuracy. Can Hurst and Smith save the nation? Also stars Reginald Marsh, Sylvia Kay, Morris Perry and Basil Moss."]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Geoffrey Hutchings as Heart Attack, Gavin Richards as Vic, James Saxon as Harry, George Sweeney as Little Pete, George Raistrick as Monty, Basil Moss as Vicar."]}, {"page": "One Brief Summer", "response": ["* Basil Moss as John Robertson  "]}, {"page": "Waggoners' Walk", "response": ["* Peter Tyson worked as Personnel Officer at Abercrombies, a central London department store. After resigning his job he worked part-time at a boatyard. Played by Basil Moss."]}, {"page": "Thirteen Against Fate", "response": ["Principal Cast: Pamela Brown, Daphne Heard, Moultrie Kelsall, Barry Jackson, Sheila Grant, Christopher Burgess, Basil Moss, Will Stampe, Trevor Baxter, Reginald Barratt"]}, {"page": "Exposed (UFO)", "response": ["* Basil Moss — Dr. Frazer\t", "Actor Basil Moss is one of 11 actors to have appeared in the TV series and the 1969 movie Doppelgänger."]}, {"page": "The Dalotek Affair", "response": ["* Basil Moss — Dr. Frazer\t"]}, {"page": "Ordeal (UFO)", "response": ["* Basil Moss — Dr. Frazer\t"]}, {"page": "Deaths in November 2020", "response": ["*Basil Moss, 85, British actor (Emergency Ward 10, First Among Equals, David Copperfield).Basil Moss (1935 – 2020)"]}, {"page": "Deadline Midnight (TV series)", "response": ["* Basil Moss as John Mundy"]}]}}