{"wiki_id": "http://www.wikidata.org/entity/Q4864517", "itemLabel": "Barry Miller", "itemDescription": "English footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Miller_(footballer)", "wikipedia_page": {"main": "Barry Steven Miller (born 29 March 1976) is an English former professional footballer and was active between 1996 and 2004 and played in England. He played in the Football League for Gillingham, and also had spells with clubs including Doncaster Rovers, Wokingham, Gillingham, Woking, Hucknall Town, Leigh RMI, Farnborough Town and Burton Albion.", "link_mentions": [{"page": "Barry Miller", "response": ["Barry Miller may refer to:", "*Barry Miller (actor) (born 1958), American actor", "*Barry Miller (politician) (1864–1933), Texas state legislator and lieutenant governor, 1925–1931", "*Barry Miller (footballer) (born 1976), retired English football defender"]}, {"page": "1999–2000 Gillingham F.C. season", "response": ["The club signed several other new players before the start of the season.  Taylor's first signing was Junior Lewis, a  midfielder who joined from non-League club Hendon; he had previously played under Taylor's management at Dover Athletic.  Barry Miller, a defender, also stepped up from non-League football, having last played for Farnborough, and former Port Vale defender Brian McGlinchey also joined the club; both players had been released by their previous clubs at the end of the preceding season but played for Gillingham on a trial basis during pre-season and performed well enough to be offered contracts.  Andy Thomson and Christian Lee, both forwards,  were signed from Oxford United and Northampton Town respectively; Gillingham paid transfer fees of £25,000 for Thomson and £35,000 for Lee.  The club also signed Anthony Williams on loan from Blackburn Rovers to act as back-up for Vince Bartram, the club's first-choice goalkeeper.  The team prepared for the upcoming season with a number of friendly matches against non-League teams.  Writing in The Times, Nick Szczepanik did not tip Gillingham for a top-six finish, stating that the team had \"missed their chance\" following the previous season's play-off final defeat."]}, {"page": "Brentford F.C. Reserves and Academy", "response": ["* Barry Miller†"]}]}}