{"wiki_id": "http://www.wikidata.org/entity/Q4867223", "itemLabel": "Basil Mitchell", "itemDescription": "philosopher (1917-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Basil_Mitchell_(academic)", "wikipedia_page": {"main": "Basil George Mitchell  (9 April 1917 – 23 June 2011) was an English philosopher and at one time Nolloth Professor of the Philosophy of the Christian Religion at the University of Oxford. Mitchell argued for the place of religious belief in public debate and criticized liberal humanism.", "link_mentions": [{"page": "Faith", "response": ["Reformed epistemology is a view about the epistemology of religious belief, which holds that belief in God can be properly basic. Analytic philosophers Alvin Plantinga and Nicholas Wolterstorff develop this view. Plantinga holds that an individual may rationally believe in God even though the individual does not possess sufficient evidence to convince an agnostic. One difference between reformed epistemology and fideism is that the former requires defence against known objections, whereas the latter might dismiss such objections as irrelevant. Plantinga has developed reformed epistemology in Warranted Christian Belief as a form of externalism that holds that the justification conferring factors for a belief may include external factors. Some theistic philosophers have defended theism by granting evidentialism but supporting theism through deductive arguments whose premises are considered justifiable. Some of these arguments are probabilistic, either in the sense of having weight but being inconclusive, or in the sense of having a mathematical probability assigned to them. Notable in this regard are the cumulative arguments presented by British philosopher Basil Mitchell and analytic philosopher Richard Swinburne, whose arguments are based on Bayesian probability. In a notable exposition of his arguments, Swinburne appeals to an inference for the best explanation."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* Basil Mitchell (academic)"]}, {"page": "John Bampton", "response": ["*1992 Basil Mitchell, Faith and Criticism"]}, {"page": "Gifford Lectures", "response": ["*1974-76 Basil Mitchell Morality, Religious and Secular"]}, {"page": "Noor Inayat Khan", "response": ["After the outbreak of the Second World War, when France was invaded by German troops, the family fled to Bordeaux and, from there by sea, to England, landing at Falmouth in Cornwall, on 22 June 1940. Initially they stayed in Southampton, at the parental home of the philosopher Basil Mitchell, whose father had been an early disciple of Noor's father.Jean Overton Fuller, Born For Sacrifice (Pan Books, 1957) pp. 43, 56–57."]}, {"page": "King Edward VI School, Southampton", "response": ["* Basil Mitchell (academic)"]}, {"page": "The Newman Society", "response": ["Other distinguished speakers who addressed the society in the course of the 20th century include Baron Friedrich von Hügel, Fr Ronald Knox, Fr Martin d'Arcy, Sir Alec Guinness, Arthur Michael Ramsey, The Princess Royal, Rowan Williams, John Finnis, Malcolm Muggeridge, Lord Longford, Immanuel Jakobovits, Viscount Monckton, Maurice Wiles, Terry Eagleton, William Rees-Mogg, Hans Adolf Krebs, Basil Mitchell, Dorothy Hodgkin, Auberon Waugh, Richard Southern, F. R. Leavis, Ninian Smart, Dan Berrigan, Herbert McCabe and Martin Gilbert."]}, {"page": "R. B. Braithwaite", "response": ["Although he was positivistically inclined, Braithwaite was a Christian, having been brought up a Quaker and becoming an Anglican later. According to theologian Alister McGrath, Braithwaite's 1955 Eddington Memorial Lecture \"An Empiricist's View of the Nature of Religious Belief\"Braithwaite, Richard. \"An Empiricist's View of the Nature of Religious Belief\" in Basil Mitchell (ed.). The Philosophy of Religion. Oxford University Press, 1970, pp. 72–91. is to date the most widely cited publication (e.g. by Anglican priest Don Cupitt) from a genre of 1970s–1980s theological works arguing that \"God\" and \"religion\" are human constructs—having no independent reality of their own—and that human dignity and freedom may best be advanced by systematic deconstruction of these two ideas, although Braithwaite himself had little sympathy for vague claims like these.Alister E. McGrath. A Scientific Theology. Wm. B. Eerdmans, 2001, pp.74–75."]}, {"page": "List of Oriel College, Oxford, people", "response": ["*Basil Mitchell – British philosopher and Nolloth Professor of the Philosophy of the Christian Religion, Fellow 1968."]}, {"page": "Problem of religious language", "response": ["The analogy of games – most commonly associated with Ludwig Wittgenstein – has been proposed as a way of establishing meaning in religious language. The theory asserts that language must be understood in terms of a game: just as each game has its own rules determining what can and cannot be done, so each context of language has its own rules determining what is and is not meaningful. Religion is classified as a possible and legitimate language game which is meaningful within its own context. Various parables have also been proposed to solve the problem of meaning in religious language. R. M. Hare used his parable of a lunatic to introduce the concept of \"bliks\" – unfalsifiable beliefs according to which a worldview is established – which are not necessarily meaningless. Basil Mitchell used a parable to show that faith can be logical, even if it seems unverifiable. John Hick used his parable of the Celestial City to propose his theory of eschatological verification, the view that if there is an afterlife, then religious statements will be verifiable after death.", "===Basil Mitchell===", "Basil Mitchell responded to Flew's falsification principle with his own parable. He described an underground resistance soldier who meets a stranger who claims to be leading the resistance movement. The stranger tells the soldier to keep faith in him, even if he is seen to be fighting for the other side. The soldier's faith is regularly tested as he observes the stranger fighting for both sides, but his faith remains strong. Mitchell's parable teaches that although evidence can challenge a religious belief, a believer still has reason to hold their views. He argued that although a believer will not allow anything to count decisively against his beliefs, the theist still accepts the existence of evidence which could count against religious belief."]}, {"page": "1917 in the United Kingdom", "response": ["* 9 April – Basil Mitchell, philosopher (died 2011) "]}, {"page": "British Society for the Philosophy of Religion", "response": ["* Basil Mitchell"]}, {"page": "Illtyd Trethowan", "response": ["It was a position that took its distance from the standard empiricism of his day which characterized much English-language academic philosophy of religion [e.g. Basil Mitchell, Antony Flew, Alasdair MacIntyre, and Richard Swinburne]. Trethowan had been educated in an Oxford dominated by ethical intuitionists like H.A. Prichard and W.D. Ross, and their non-natural theory of value was close to his own appreciation of the absolute in ethical experience, articulated most clearly in his books Absolute Value: a study in Christian theism and The Absolute and the Atonement. As noted by Baxter, Trethowan firmly held that: "]}, {"page": "2011 in the United Kingdom", "response": ["*23 June – Basil Mitchell, philosopher (b. 1917)"]}, {"page": "Deaths in June 2011", "response": ["*Basil Mitchell, 94, British philosopher."]}, {"page": "Basil Mitchell", "response": ["Basil Mitchell may refer to:", "* Basil Mitchell (American football) (born 1975), former National Football League running back", "* Basil Mitchell (academic) (1917–2011), British philosopher"]}, {"page": "Basil Mitchell (philosopher)", "response": ["#REDIRECT Basil Mitchell (academic)"]}, {"page": "Martin Stopford", "response": ["Stopford was born in Bolton, Lancashire in 1947, son of a clergyman. He was educated at Prestfelde School, Shrewsbury and Denstone College, Staffordshire. In 1966 he won an Abbott Scholarship to Keble College, Oxford in 1969 where he studied Politics, Philosophy and Economics (PPE) under Adrian Darby, James Griffin, Paul Hayes, and Basil Mitchell. Stopford went on to receive a Doctor of Philosophy Degree in Economics from Birkbeck College, part of the University of London, which he completed in 1979."]}, {"page": "Christopher Evans (theologian)", "response": ["In 1948, he was elected as both a fellow and tutor of Corpus Christi College, Oxford, where he would soon become renowned for his tutoring in teachings of the New Testament beside the likes of J. R. Porter and Dennis Nineham. On 16 February 1956 he spoke at the Oxford Socratic Club along with the philosopher Basil Mitchell on \"Mythology in the New Testament\"."]}, {"page": "Newcastle Scholarship", "response": ["| 1993 || Professor Basil Mitchell (Oxford University) || Sacks, The Persistence of Faith"]}, {"page": "Nolloth Professor of the Philosophy of the Christian Religion", "response": ["* 1968–1985 Basil Mitchell "]}, {"page": "Basil George Mitchell", "response": ["#REDIRECT Basil Mitchell (academic)"]}, {"page": "Kelly James Clark", "response": ["Clark's books include God and the Brain, Strangers, Neighbors, Friends, Religion and the Sciences of Origins, Abraham’s Children, Return to Reason, The Story of Ethics, When Faith Is Not Enough, and 101 Key Philosophical Terms of Their Importance for Theology, many of which have been translated into multiple languages. In 1995, his book Philosophers Who Believe was named one of Christianity Today’s Books of the Year. That book detailed the spiritual and intellectual autobiographies of philosophers such as Alvin Plantinga, Nicholas Wolterstorff, Basil Mitchell, Mortimer Adler, Richard Swinburne, Frederick Suppe, Linda Zagzebski, and Nicholas Rescher."]}]}}