{"wiki_id": "http://www.wikidata.org/entity/Q4864214", "itemLabel": "Barry Evans", "itemDescription": "British actor (1943-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Evans_(actor)", "wikipedia_page": {"main": "Barry Joseph Evans (18 June 1943 – 9 February 1997) was an English actor best known for his appearances in British sitcoms such as Doctor in the House and Mind Your Language.", "link_mentions": [{"page": "June 18", "response": ["*1943 – Barry Evans, English actor (d. 1997)"]}, {"page": "1997", "response": ["** Barry Evans, English actor (b. 1943)"]}, {"page": "1943", "response": ["** Barry Evans, English actor (d. 1997)"]}, {"page": "Guildford", "response": ["Stuart Wilson, Christopher Gaze, Barry Evans, David Hemmings and Bonnie Langford are from the town, and Monty Python member Terry Jones attended the Royal Grammar School."]}, {"page": "Golders Green Crematorium", "response": ["* Barry Evans, English actor (location of ashes unknown)"]}, {"page": "1997 in film", "response": ["| style=\"text-align:center;\"| 11 || Barry Evans || style=\"text-align:center;\"| 53 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1971 in film", "response": ["*Die Screaming, Marianne, starring Susan George and Barry Evans- (U.K.)"]}, {"page": "Mind Your Language", "response": ["The show is set in an adult education college in London and focuses on the class in English as a Foreign Language directed by Mr. Jeremy Brown (Barry Evans), who is manipulated to teach a group of enrolled foreigners.", "* Barry Evans (42 episodes) as Jeremy Brown, the English teacher and focal point of most of the series. He is a good-natured, earnest single man in his thirties who lives alone. He has a Bachelor of Arts from Oxford University. He was hired in the series pilot, in which he was warned that the students drove the previous teacher insane. Mr. Brown is up to the challenge but often exasperated by the students' creative interpretations of the English language.", "The series continues to be screened internationally, particularly in the countries represented in the series onscreen.Jonathan Rigby, DVD commentary on Die Screaming Marianne starring Barry Evans, 2005. The series was sold to Pakistan, Australia, New Zealand, Sri Lanka, India, Malaysia, Kenya, Nigeria,The International World of Electronic Media, Lynne S. Gross, McGraw-Hill, 1995, page 243 Ghana and Singapore. It was also one of the first British TV programmes shown in South Africa after the end of the boycott by the British Actors' Equity Association.New Statesman and Society, 30 September 1994, page 31 It was also broadcast in Canada on CBC Television from 1978 until 1982. The series was screened by some minor or independent ABC TV stations in the United States during 1985.TV Guide, Volume 33, Triangle Publications, 1985, page A-36"]}, {"page": "Bisley, Surrey", "response": ["Actor Barry Evans attended Bisley boys' school, which was an orphanage run by Shaftesbury Homes.Barry Evans "]}, {"page": "Yalding", "response": ["*Barry Evans, (1943–1997), actor best known for the sitcoms Doctor In The House and Mind Your Language, lived in Yalding for a short time."]}, {"page": "Patsy Rowlands", "response": ["On 7 March 1971, she starred in a single episode (You've Really Landed Me In It This Time) of the ITV sitcom Doctor at Large, with Barry Evans and George Layton, as a nymphomaniac secretary, the kind of role she had played in Carry On Loving."]}, {"page": "Doctor in the House (franchise)", "response": ["*Michael Upton (Barry Evans), an easy-going, serious and somewhat anxious son of a doctor who is essentially following in his father's footsteps.", "*Duncan Waring (Robin Nedwell), Michael's best friend and roommate.  He is just as bright as Upton, but far less serious in his studies, although he generally does well.  After Barry Evans left the show, Nedwell returned as Waring to become the focus of the show."]}, {"page": "Dino Shafeek", "response": ["During the run of It Ain't Half Hot Mum, Shafeek played the part of student Ali Nadim in the ITV/London Weekend Television sitcom Mind Your Language (1977–79). Along with Barry Evans as their teacher, Ali was one of a group of people from diverse backgrounds in an English as a Foreign Language class at a London night-school. Ali was a Muslim Pakistani who had emigrated to the United Kingdom, and was frequently seen bickering with Ranjeet Singh (Albert Moses), a Sikh from India. Ali told Ranjeet he will \"kick [him] up the Khyber\" (\"Khyber Pass\" being rhyming slang for \"arse\"). As the series progresses, their relationship mellows into one of friendly and mutual supportiveness."]}, {"page": "Barry Evans (Actor)", "response": ["#REDIRECT Barry Evans (actor)"]}, {"page": "Die Screaming, Marianne", "response": ["* Barry Evans as Eli Frome"]}, {"page": "1997 in the United Kingdom", "response": ["* 9 February – Barry Evans, actor (born 1943)"]}, {"page": "Claybrooke Magna", "response": ["In 1997, TV actor Barry Evans was found dead at his home in Claybrooke Magna.  A youth was charged with attempted murder but later released.  The exact circumstances surrounding his death remain a mystery."]}, {"page": "List of people with surname Evans", "response": ["*Barry Evans (disambiguation), multiple people", "**Barry Evans (actor) (1943–1997), English actor and television performer", "**Barry Evans (baseball) (born 1956), American Major League Baseball third baseman", "**Barry Evans (rugby union) (born 1962), English rugby player", "**Barry Evans (footballer, born 1963), Australian rules footballer for Collingwood", "*Barry Evans (EastEnders)"]}, {"page": "Sex comedy", "response": ["Soon came Adventures of..., directed by Stanley Long, which started with Adventures of a Taxi Driver, starring sitcom star Barry Evans, and was followed by Adventures of a Private Eye and Adventures of a Plumber's Mate, starring future record producer Christopher Neil. Long began his career as a photographer before producing striptease shorts (or \"glamour home movies\", as they were sometimes known), for the 8 mm market. Beginning in the late fifties, Long's feature film career would span the entire history of the British sex film, and as such exemplifies its differing trends and attitudes. His work ranges from coy nudist films (Nudist Memories 1959), to moralizing documentary (The Wife Swappers, 1970) to a more relaxed attitude to permissive material (Naughty!, 1971) to out and out comedies at the end of the 1970s. He did not like sex scenes and was dismissive of pornography, saying it did not turn him on and he turned his back when such scenes were being filmed."]}, {"page": "Here We Go Round the Mulberry Bush (film)", "response": ["Here We Go Round the Mulberry Bush is a 1968 British comedy film produced and directed by Clive Donner, based on the 1965 novel of the same name by Hunter Davies. The film stars Barry Evans, Judy Geeson and Angela Scoular. It was listed to compete at the 1968 Cannes Film Festival, but the festival was cancelled due to the events of May 1968 in France.", "Jamie McGregor (Barry Evans) is a virginal sixth-former in a Swinging Sixties new town, delivering groceries for the local supermarket. However he is more interested in matters sexual and sets out to lose his virginity by attempting to seduce the local girls – Linda, Paula, Caroline, and his dream girl, Mary. He ultimately succeeds in bedding the sexually aggressive Audrey, only to learn too late that sex isn't as important as he initially believed.", "* Barry Evans as Jamie McGregor"]}, {"page": "Open verdict", "response": ["In February 1997, actor Barry Evans was found dead in his home by police. The police discovered Evans' body in his living room after going to the house to tell him they had recovered his stolen car which had been reported missing the day before. The cause of his death has never been confirmed. The coroner found a blow to Evans' head and also found high levels of alcohol in his system. A short written will was found on a table next to his body, and a spilled packet of aspirin (bearing a pre-decimalisation price tag indicating that the pack was at least 26 years old) was found on the floor, although the coroner concluded that Evans had not taken any of these. An open verdict was eventually given. An 18-year-old man was arrested but later released without charge due to insufficient evidence."]}, {"page": "Stanley Long", "response": ["He made several sex comedy movies in the 1970s, the most successful being Adventures of a Taxi Driver (1976), Adventures of a Private Eye (1977) and Adventures of a Plumber's Mate (1978); these starred a host of talented comedy performers including Barry Evans, Diana Dors, Irene Handl, Harry H. Corbett, Liz Fraser and Fred Emney."]}, {"page": "The White Bus", "response": ["*Barry Evans – Boy"]}, {"page": "Alfred the Great (film)", "response": ["*Barry Evans as Ingild"]}, {"page": "The Mystery of Edwin Drood (1993 film)", "response": ["The Mystery of Edwin Drood is a 1993 film, the fourth film adaptation of the Charles Dickens unfinished 1870 novel of the same name. This was the last film of Barry Evans.", "* Barry Evans as Bazzard"]}, {"page": "List of British films of 1967", "response": ["|Here We Go Round the Mulberry Bush||Clive Donner ||Barry Evans, Judy Geeson ||Drama ||"]}, {"page": "List of British films of 1971", "response": ["|Die Screaming, Marianne||Pete Walker ||Susan George, Barry Evans ||Horror thriller ||"]}, {"page": "List of British films of 1976", "response": ["|Adventures of a Taxi Driver||Stanley Long||Barry Evans, Judy Geeson||Sex comedy||", "|Under the Doctor||Gerry Poulson||Barry Evans, Liz Fraser||Sex comedy||"]}, {"page": "Doctor at Large (TV series)", "response": ["*Barry Evans - Dr Michael Upton"]}, {"page": "Adventures of a Taxi Driver", "response": ["Adventures of a Taxi Driver is a 1976 British sex comedy film directed by Stanley Long and starring Barry Evans, Judy Geeson and Adrienne Posta. There were two sequels, Adventures of a Private Eye and Adventures of a Plumber's Mate.", "* Barry Evans as Joe North"]}, {"page": "List of orphans and foundlings", "response": ["* Barry Evans, English actor, abandoned as an infant, raised in an orphanage"]}, {"page": "Barry Evans", "response": ["Barry Evans may refer to:", "*Barry Evans (actor) (1943–1997), English actor and television performer", "*Barry Evans (baseball) (born 1955), former Major League Baseball third baseman", "*Barry Evans (EastEnders), fictional character in the British TV soap opera EastEnders", "*Barry Evans (footballer, born 1936), Australian footballer for South Melbourne", "*Barry Evans (footballer, born 1963), Australian footballer for Collingwood", "*Barry Evans (rugby union) (born 1962), English rugby player"]}, {"page": "Under the Doctor", "response": ["Under the Doctor is a 1976 British sex comedy directed by Gerry Poulson and starring Barry Evans, Liz Fraser and Hilary Pritchard.BFI.org The screenplay concerns a Harley Street doctor who enjoys a number of dalliances with three of his female patients.", "* Barry Evans as Doctor Boyd, Psychiatrist / Mr Johnson / Lt Cranshaw / Colin Foster"]}, {"page": "Doctor in Charge", "response": ["Doctor in Charge is a British television comedy series based on a set of books by Richard Gordon about the misadventures of a group of doctors.  The series follows directly from its predecessor Doctor at Large. It was produced by London Weekend Television and broadcast on ITV during 1972 and 1973. Barry Evans was unable to return for this series."]}, {"page": "Doctor in the House (TV series)", "response": ["* Barry Evans – Michael A. Upton"]}, {"page": "Chips with Everything", "response": ["The play opened on Broadway at the Plymouth Theatre (and then the Booth Theatre) on 1 October 1963 after one preview, and closed on 8 February 1964 after 149 performances. British actors Alan Dobie (as Corporal Hill), Barry Evans (as First Airman) and George Layton (as First Corporal) made their Broadway debut. The director was John Dexter, with a cast that featured Gary Bond as 276 Thompson (Pip), Corin Redgrave (Pilot Officer), Norman Allen (Fourth Airman), John Levitt as 277 Cohen (Dodger), John Noakes and Gerald McNally (Third Airman).\"Listing\" Internet Broadway Database, accessed May 16, 2013"]}, {"page": "BFI Flipside", "response": ["The BFI Flipside charts \"the untold history of British film\",Watts, P (2011) BFI Flipside celebrates forgotten British film, The Independent 25 February, retrieved 23 September 2011 and includes performances by such celebrated actors as John Hurt, Jane Asher, Ian McNeice, Richard O'Brien, Tom Bell, Peter Cook, Barry Evans, Denholm Elliott and Judy Geeson in films directed by the likes of Clive Donner, Richard Lester, Barney Platts-Mills, John Irvin, Stuart Cooper, Guy Hamilton, Peter Watkins and James Hill. Each BFI Flipside edition includes a feature film presentation that is complemented by additional film content (sometimes a second feature film by the same director, or a selection of short films which are related to the main feature by subject, era, actor or director). Each release is packaged in distinctive artwork which carries the volume number on the spine and with a comprehensive booklet containing informative essays, full cast and credit information, original film reviews and reproductions of original promotional material."]}, {"page": "Legacy of Murder", "response": ["* Barry Evans as Robin Bright"]}]}}