{"wiki_id": "http://www.wikidata.org/entity/Q48699894", "itemLabel": "Joseph Crawford", "itemDescription": "British trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Crawford_(trade_unionist)", "wikipedia_page": {"main": "Joseph Crawford, OBE (born April 1910, died August 1997) was a British trade unionist.\nCrawford grew up in Annfield Plain in County Durham, where he attended the local school, then began working as a coal miner at the age of fourteen.\nHe married Hannah Jane Horswill on 3 June 1933. They had three children Trevor, Jean and Pauline.\nAt the age of 29, he was promoted to become a deputy, and joined the National Association of Colliery Overmen, Deputies and Shotfirers (NACODS). He became increasingly active in the union, as secretary of his local branch, then as general secretary of its Durham area and a member of the National Council. In 1953, he was elected as the union's vice president, then in 1956 he became its president, and finally in 1960 he was elected as general secretary of the national union.As leader of the union, Crawford represented it at the Trades Union Congress (TUC), and he served on its General Council. Between 1972 and 1973, he was the President of the TUC. He retired from his trade union posts later that year.\nCrawford spoke at many conferences around the globe including being presented a gold Hartford University graduation ring for attending and speaking at a seminar at the University whilst in America.\nIn his spare time, Crawford also served on the Mining Qualifications Board, as a governor of Ruskin College, the United World College of the Atlantic, and Welbeck College, and was a member of the council of St George's House (Windsor Castle). He was appointed an OBE and made an Officer of the Order of the British Empire in the 1971 Birthday Honours. for his services to the Mining Industry (particularly towards working conditions and Health and Safety). https://en.wikipedia.org/wiki/National_Association_of_Colliery_Overmen,_Deputies_and_Shotfirers\nHe also served for many years as a Methodist laypreacher and was wholly religious.", "link_mentions": [{"page": "Annfield Plain", "response": ["* Joseph Crawford - President of the Trades Union Congress and General Secretary of the National Association of Colliery Overmen, Deputies and Shotfirers"]}, {"page": "National Association of Colliery Overmen, Deputies and Shotfirers", "response": [":1960: Joseph Crawford"]}, {"page": "Joseph Crawford", "response": ["*Joseph Crawford (trade unionist) (1910–?), British trade unionist", "*Buddie Petit (1890–1931), American musician born Joseph Crawford"]}, {"page": "1971 Birthday Honours", "response": ["*Joseph Crawford, General Secretary, National Association of Colliery Overmen, Deputies and Shotfirers."]}, {"page": "General Council of the Trades Union Congress", "response": ["|rowspan=4| Joseph Crawford"]}]}}