{"wiki_id": "http://www.wikidata.org/entity/Q4863520", "itemLabel": "Barrie Gavin", "itemDescription": "film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Barrie_Gavin", "wikipedia_page": {"main": "Barrie Gavin  (born 10 June 1935) is a British film director.", "link_mentions": [{"page": "Robert Simpson (composer)", "response": [": is dedicated to the film-maker Barrie Gavin and his wife Jamila. Of the four movements, the first begins with an Adagio introduction exploring an enigmatic harmony, prefacing a large-scale Vivacissimo; the second is an intermezzo-like Con moto; grazioso ed intensivo, the third a complex Canon marked Molto tranquillo with an Allegretto grazioso middle section, and the finale is marked Molto rapido – these correspond to the layout of Beethoven's op.59 no.3, which begins with a slow introduction exploring a particular harmony and includes an archaic form (a Minuet) as its third movement."]}, {"page": "List of film and television directors", "response": ["*Barrie Gavin"]}, {"page": "Erich Wolfgang Korngold", "response": ["*In 2001, ArtHaus Musik released on DVD (UPC 807280036398) a documentary titled Erich Wolfgang Korngold – The Adventures of a Wunderkind (also Between Two Worlds), directed by Barrie Gavin, in the Composers of Our Time series."]}, {"page": "Royal Philharmonic Society", "response": ["** Barrie Gavin"]}, {"page": "Gavin", "response": ["* Barrie Gavin (born 1935), British film director"]}, {"page": "Alexander Frey", "response": ["In Barrie Gavin's documentary film, Erich Wolfgang Korngold-Adventures of Wunderkind: A Portrait and Concert, Frey performs several solo keyboard works and the first public hearing of Korngold's second symphony, which exists only in a manuscript piano score. Most of the background piano music in the film is also taken from Frey's performances of the composer's music.", "Since the 1990s, Frey has maintained a strong commitment to both contemporary music and the film music of Hollywood which has been evident in the many world and regional premieres he is given. At the 2009 \"Hollywood in Vienna Festival\" held in Vienna, Austria, Frey gave the first public live performance of John Williams' music to Jean-Jacques Annaud's film Seven Years in Tibet when he played a piano transcription of the complete score to that movie. He also performed the world premieres of Max Steiner's Wiener Lob and a large-scale piano transcription of David Arnold's music for the film Independence Day in concert with Arnold in attendance. In Mexico, Frey conducted the Latin American premiere performances of both Bernard Herrmann's music for Alfred Hitchcock's film Vertigo and Franz Waxman's music for the 1941 film Dr. Jekyll and Mr. Hyde. He also gave the first public performance of Erich Wolfgang Korngold's music for the 1944 film Between Two Worlds, as well as the European premiere of the Suite from Schindler's List, composed and arranged by John Williams. In Barrie Gavin's documentary film, Erich Wolfgang Korngold-Adventures of Wunderkind: A Portrait and Concert, Frey performs the first public hearing of Korngold's second symphony, composed in Hollywood at the end of the composers life and exists only in piano score, in addition to playing several solo keyboard works and most of the background piano music."]}, {"page": "Robin Maconie", "response": ["*1980. Tuning In. Script for BBC 1 Omnibus TV documentary on Karlheinz Stockhausen, directed by Barrie Gavin."]}, {"page": "A Night at the Chinese Opera", "response": ["The Kent Opera production was recorded for television by the BBC in 1988, directed by Barrie Gavin.A Night at the Chinese Opera (1988) , British Film Institute database, accessed 22 July 2015."]}, {"page": "Scorched (album)", "response": ["The work on Scorched is used in the film portrait of Turnage by Barrie Gavin (Getting Scorched: Mark-Anthony Turnage, DVD, 2009)"]}, {"page": "Images (Skempton)", "response": ["The work was commissioned by Channel 4's HTV West for \"Images\", a six-part television series of documentaries dealing with various aspects of photography. The series was created to mark the 150th anniversary of the invention of photography. The producer, Barrie Gavin, wanted the music to be similar in concept to Erik Satie's Gymnopedies: in the words of the composer, the pieces were to be \"like a sculpture viewed from different angles in a changing light.\" The pianist who performed Images for the TV series was Michael Finnissy."]}, {"page": "List of compositions by Robert Simpson", "response": ["* String Quartet No. 6 (1975), dedicated to the film-maker Barrie Gavin and his wife Jamila"]}, {"page": "Gerard McBurney", "response": ["Gerard McBurney has written, researched and presented more than two dozen documentary television films for British and German television channels, mostly working with the director Barrie Gavin."]}, {"page": "Robert Vas", "response": ["In the BBC documentary tribute to Vas directed by Barrie Gavin, Karel Reisz said of him that his aim was to \"inspire thought, to remind and warn\".", "* Barrie Gavin and Alan Rosenthal, 'Witness: In Memoriam, Robert Vas', Sight and Sound, Summer 1978 pp. 186–189", "*  (BBC, broadcast 3/5/1978, Barrie Gavin)"]}, {"page": "Mike Dibb", "response": ["In 1983, Dibb left the staff of the BBC to work independently. He joined Third Eye Productions, a company formed by several other ex-members of the BBC Music and Arts department, including Barrie Gavin, Peter West and Geoff Haydon. After 1986 Dibb began to make many of his films through his own company, Dibb Directions Ltd (DD)."]}, {"page": "BFI Production Board", "response": ["In 1974, Barrie Gavin took over from Hassan as Head of Production, but resigned fourteen months later. \"Yet his short tenure remains one of the most audacious periods in the Board's history\", with the production of 12 political documentaries by far-left and feminist film collectives such as the Berwick Street Collective. He selected few fiction features for production, the most notable being Horace Ové's Pressure, the first black feature film produced in the UK."]}, {"page": "Charivari (Gruber)", "response": ["The composition is dedicated to Barrie Gavin and was finished in Vienna on 7 December 1981. It was premiered by the London Sinfonietta conducted by Simon Rattle at the Queen Elizabeth Hall, in London, on 23 August 1983. However, Gruber decided to make a revised version of the composition later that year. The revised version was premiered by the Vienna Philharmonic Orchestra, conducted by Ivan Fischer in Vienna, on 22 January 1984. The initial version was published by Boosey and Hawkes in 1981, and the revised version followed in 1984."]}, {"page": "New Year's Eve Concert 1992: Richard Strauss Gala", "response": ["* Barrie Gavin (b. 1935), director", "File:Barrie Gavin.jpg|Barrie Gavin"]}, {"page": "Ulrich Mosch", "response": ["From 1990 to 2014 Mosch was research assistant of the  in Basel. There he was responsible for more than twenty-four estates and collections of music manuscripts and other documents of composers, including the collections of Igor Stravinsky, Luciano Berio, Hans Werner Henze, Helmut Lachenmann and Wolfgang Rihm as well as the collection of documentary films by Barrie Gavin. Mosch is a member of the advisory board of the magazine  (Positionen. Texte zur aktuellen Musik)."]}, {"page": "List of Private Passions episodes (2000–2004)", "response": ["|rowspan=\"8\"|Barrie Gavin"]}]}}