{"wiki_id": "http://www.wikidata.org/entity/Q4877557", "itemLabel": "Beaumont Cranfield", "itemDescription": "English cricketer (1872-1909)", "wikipedia_url": "https://en.wikipedia.org/wiki/Beaumont_Cranfield", "wikipedia_page": {"main": "Beaumont Cranfield (28 August 1872 – 20 January 1909) was an English professional cricketer who played first-class cricket for Somerset County Cricket Club and the Marylebone Cricket Club (MCC) between 1897 and 1908. A slow left-arm orthodox bowler, Cranfield took 621 wickets in first-class cricket, and took 100 or more wickets in a season in three successive years at his peak.Cranfield first played for Somerset in 1897, and took five wickets on his debut. Somerset hoped that he would be able to replace Ted Tyler, whose career was effectively ended in 1900 when he was repeatedly no-balled for throwing. At his prime, Cranfield was capable of bowling with significant curve, sufficient to allow him to place almost all of his fielders on the leg side. However, he lacked consistency, particularly regarding the length of his bowling.In 1901, 1902 and 1903, Cranfield took 100 or more wickets in first-class cricket, peaking in the middle year, when he claimed 141, at an average of 18.56. He was invited to play for representative sides twice, appearing for the Players against the Gentlemen at Scarborough in 1902, and then for the \"Players of the South\" against the Gentlemen in 1904. Despite his professional status, Cranfield also appeared for the \"Gentlemen of England\" in 1903 against Oxford University, taking seven wickets in the match. His best bowling performance came the following year, when he claimed eight wickets for 39 runs against Gloucestershire. In all, he took five wickets in an innings 47 times, and on twelve occasions he claimed 10 wickets in a match. Cranfield's batting was lowly regarded, and club historian Eddie Lawrence describes him as \"an obvious number eleven in the batting order\".Cranfield was rarely a healthy man, and in January 1909, he caught a chill while watching a football match. Four days later, he died of pneumonia. His brother, Lionel Cranfield, and his nephew (Lionel's son) Monty Cranfield both also played first-class cricket.", "link_mentions": {}}}