{"wiki_id": "http://www.wikidata.org/entity/Q4877117", "itemLabel": "Beatrice Beckett", "itemDescription": "first wife of the British politician Anthony Eden", "wikipedia_url": "https://en.wikipedia.org/wiki/Beatrice_Beckett", "wikipedia_page": {"main": "Beatrice Helen Beckett (27 July 1905 – 29 June 1957) was the first wife of British politician Anthony Eden.", "link_mentions": [{"page": "Beckett", "response": ["*Beatrice Beckett (1905–1957), the first wife of the British statesman Anthony Eden"]}, {"page": "Eden baronets", "response": ["******** Anthony Eden, Earl of Avon (1897–1977) m. (1) Beatrice Beckett; m. (2) Clarissa Spencer-Churchill"]}, {"page": "Anthony Eden", "response": ["Eden read the writings of Lord Curzon and was hoping to emulate him by entering politics with a view to specialising in foreign affairs.Rhodes James 1986, p. 622. Eden married Beatrice Beckett in the autumn of 1923, and after a two-day honeymoon in Essex, he was selected to fight Warwick and Leamington for a by-election in November 1923. His Labour opponent, Daisy Greville, Countess of Warwick, was by coincidence his sister Elfrida's mother-in-law and also mother to his wife's step-mother, Marjorie Blanche Eve Beckett, née Greville. On 16 November 1923, during the by-election campaign, Parliament was dissolved for the December 1923 general election.Aster 1976, p. 11. He was elected to Parliament at the age of twenty-six.Rhodes James 1986, pp. 78–79.", "On 5 November 1923, shortly before his election to Parliament, he married Beatrice Beckett, who was then eighteen.Rhodes James 1986, pp. 68–72. They had three sons: Simon Gascoigne (1924–1945), Robert, who died fifteen minutes after being born in October 1928, and Nicholas (1930–1985).Rhodes James 1986, pp. 96–97."]}, {"page": "Beatrice Eden", "response": ["#redirect Beatrice Beckett"]}, {"page": "Sir William Eden, 7th Baronet", "response": ["* Robert Anthony Eden (later 1st Earl of Avon) (1897–1977), who served as Prime Minister of the United Kingdom. He married twice, first in 1923 to Beatrice Beckett, daughter of Sir Gervase Beckett, Bt. After their 1950 divorce, he married Clarissa Spencer-Churchill, daughter of Jack Churchill and niece of Winston Churchill, in 1952."]}]}}