{"wiki_id": "http://www.wikidata.org/entity/Q4879034", "itemLabel": "Bede Camm", "itemDescription": "English Benedictine monk and scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Bede_Camm", "wikipedia_page": {"main": "Dom Bede Camm, O.S.B., (26 December 1864 – 8 September 1942) was an English Benedictine monk and martyrologist. He is best known for his many works on the English Catholic martyrs, which helped to keep their memories alive in the newly reemerging Catholic Church of Victorian England.", "link_mentions": [{"page": "John Story (martyr)", "response": ["In 1563, he was again arrested and committed to the Marshalsea, but managed to escape to Flanders, where he became a pensioner of King Philip II, and acted as the King's almoner for the Catholic exiles. Engaged by the Duke of Alba (Alva in Dutch), Governor of the Spanish Netherlands, to prevent the export of heretical books from the Netherlands to England, he was lured onto a trading boat at Antwerp in 1570 and conveyed to Yarmouthand thence to imprisonment in the Tower of London. According to Bede Camm, Story represented the old order, and was well known among the Catholic refugees. Brought home by fraud and violence and then executed, Camm sees this as meant to send a message to the exiles, demonstrating \"how strong Elizabeth was to punish and how powerless Spain to protect\".Camm, Bede. Lives of the English Martyrs, Intro p. xxii, Longmans, Green and Company, 1914 "]}, {"page": "John Chapman (priest)", "response": ["He subsequently entered the Benedictine Maredsous Abbey in Belgium, where he had been preceded by a friend from Cuddesdon, Bede Camm. Chapman was given the religious name of \"John\", and professed simple vows on 25 March 1893. He made his solemn vows on Whitsuntide 1895. After his priestly ordination in 1895, he went to Erdington Abbey, near Birmingham, where he stayed until 1912, serving the community as novice master and later as prior.Rees, Daniel. \"Chapman, John (1865-1933)\", Encyclopedia of Monasticism, (William M. Johnston, ed.), Routledge, 2013,  "]}, {"page": "Nicholas Garlick", "response": ["Garlick used the time to give the people a long sermon on the salvation of their souls, ignoring the attempts of officials to make him stop. He closed his speech by throwing into the crowd a number of papers which he had written in prison, and which he said would prove what he affirmed. Bede Camm reports a tradition that everyone into whose hands these papers fell was subsequently reconciled to the Catholic Church. Simpson was apparently to have been executed first, but reports state that Garlick hastened to the ladder before him and kissed it, going up first, either because, as suggested by Anthony Champney,Anthony Champney. History of the Reign of Queen Elizabeth, quoted in Challoner, p. 131. Simpson was showing some signs of fear, or, as suggested by Challoner, Garlick suspected that there was a danger that his companion's courage might fail him.Challoner, p. 131 Simpson was executed next, and, according to an eyewitness, \"suffered with great constancy, though not with such (remarkable) signs of joy and alacrity as the other two\".Challoner, p. 132 Ludlam was the last of the three to be executed, and is reported to have stood smiling while the execution of Garlick was being carried out, and to have continued smiling when his own turn came."]}, {"page": "Thomas Pickering (martyr)", "response": ["* Bede Camm (1931) Nine Martyr Monks, pp. 344–348."]}, {"page": "Thomas Sprott", "response": ["Hunt was born in Norfolk in approximately 1573. Bede Camm says that his real name was probably Bensted or Benstead, as that was how Henry Garnet referred to him.Camm O.S.B., Bede. \"Fresh Light on Our Martyrs from the Valladolid Manuscript\", The Month: An Illustrated Magazine of Literature, Science and Art p. 352, vol. 92, 1900. He studied for the priesthood at the Royal English College in Valladolid and subsequently the English College of Seville, being ordained in 1599. His service in England was brief, being initially imprisoned at Wisbech, where he then escaped with five others. "]}, {"page": "Thomas Belchiam", "response": ["Thomas Belchiam (1508–1537) was an English Franciscan who died in Newgate Prison in the reign of Henry VIII. He is a Catholic martyr, declared venerable by Pope Leo XIII. The year of death is in question: the Victoria County History for Kent puts the events in 1534. It references Thomas Bourchier's Historia Ecclesiastica de Martyrio Fratrum..., \"though the writer assigns them to 1537\". Dom Bede Camm, O.S.B., places Belchiam's date of death as 3 August 1537.Camm, Bede. \"Ven. Thomas Belchiam.\" The Catholic Encyclopedia Vol. 2. New York: Robert Appleton Company, 1907. 3 August 2018 Notes and Queries lists him as dying in 1538.Notes and Queries, London, John Francis, 1882, p. 23"]}, {"page": "Come Rack! Come Rope!", "response": ["The book was written nearly nine years after Benson's reception into the Catholic Church. The inspiration for the story comes from Dom Bede Camm's account of the recusant Fitzherbert family in Forgotten Shrines (1910), and from Benson's own visit in 1911 to Padley, home of the Fitzherberts, and scene of part of the novel, to preach at the annual pilgrimage there.Philip Caraman: Foreword to the 1956 edition of Come Rack! Come Rope! The title of the book is taken from a letter of Saint Edmund Campion in which, after torture, he assured Catholics that he had revealed \"no things of secret, nor would he, come rack, come rope.\"Hugh Ross Williamson: Introduction to the 1959 edition of Come Rack! Come Rope! Most of the characters in the book are historical people; only the hero and heroine, their parents, and some minor characters are fictional."]}, {"page": "Frederick Bligh Bond", "response": ["He practised as an architect in Bristol from 1888. His work includes schools, such as the board schools in Barton Hill, Easton, and Southville, Greenbank Elementary School and St George's School. He designed the schools of medicine and engineering at Bristol University and the Music School of Clifton College. He also undertook a number of domestic commissions for the King's Weston estate of Philip Napier Miles, including a number of substantial houses in Shirehampton, the Miles Arms public house in Avonmouth, the now-demolished King's Weston estate office and the public hall in Shirehampton. Cossham Memorial Hospital is also an example of his work. The style of his mature works in the Edwardian years might be described as English Baroque or Queen Anne Revival. In addition he oversaw the restoration of a number of churches, became an acknowledged authority on the history of church architecture, and in 1909 published, with Dom Bede Camm, a two-volume treatise entitled Roodscreens and Roodlofts."]}, {"page": "Nicholas Fitzherbert", "response": ["Fitzherbert matriculated at Exeter College, Oxford, where his name appears in the matriculation register as a senior undergraduate member of the College in 1571 and 1572. However he would not have been able to obtain a degree because of his religion, and therefore like many he went abroad in order that he might practice his Catholic religion.Forgotten Shrines: An Account of Some Old Catholic Halls and Families by Bede Camm, p. 66, 2002. Retrieved 18 February 2008, "]}, {"page": "English post-Reformation oaths", "response": ["**Bede Camm, Lives of the English Martyrs (London, 1904)."]}, {"page": "Ralph Fitzherbert", "response": ["Both Ralph's and Elizabeth's wills are still available, and her will states that she \"should be buried in the church of Saint Barloke before the image of Saint Nicholas and beside the body of her husband, Ralph Fitzherbert.\"Forgotten Shrines by Bede Camm, Published 2004, Gracewing Publishing, "]}, {"page": "Joseph Creswell", "response": ["Creswell's character and conduct in connection with his difficulties over the seminaries in Seville and Valladolid, and his controversies about the Benedictine vocations have been criticized.Bede Camm, Life of Ven. John Roberts, and Pollen, The Month, London, September–October 1899. Father Creswell had considerable intercourse with Sir Charles Cornwallis, the English resident at Madrid, till the Gunpowder Plot, when Creswell was summoned to Rome."]}, {"page": "German Gardiner", "response": ["**Bede Camm, Lives of English Martyrs (London, 1904), i, 543–7;"]}, {"page": "William Davies (priest)", "response": ["**Bede Camm, In the Brave Days of Old (London, 1899)."]}, {"page": "William Hart (priest)", "response": ["**Bede Camm, Lives of the English Martyrs, II (London, 1904-5), 600-634"]}, {"page": "Richard Thirkeld", "response": ["Six of his letters survive, and were summarized by Bede Camm."]}, {"page": "Robert Grissold", "response": ["*Bede Camm, Forgotten Shrines"]}, {"page": "John Marshall (priest)", "response": ["**Bede Camm, Life of Allen (London, 1908)"]}, {"page": "Teignmouth Abbey", "response": ["The Benedictine community at Teignmouth dated back to the establishment of the first English Benedictine convent on the continent, founded in Brussels in 1598 by Lady Mary Percy. From Brussels, Dame Lucy Knatchbull, Magdalene Digby, sister of Everard Digby, and several other nuns established a daughter house in Ghent in 1624. In 1662, Ghent founded, in turn, a daughter house in Dunkirk. In 1784, the sister community at Pontoise was dissolved with the nuns joining those at Dunkirk.Nolan, Patrick. \"English Convents in the Low Countries\", The Irish Dames of Ypres, Benziger, 1908, p. 26 et seq. According to Bede Camm, the Teignmouth community had a reliquary cross supposedly from Fountains Abbey. It is traditionally believed that it was brought to them by Lady Abbess Messenger of Pontoise, who was related to the owners of Fountains.Camm, Bede. Forgotten Shrines, MacDonald & Evans, London, 1910, p. 380  "]}, {"page": "September 1942", "response": ["**Bede Camm, 77, English Benedictine monk and martyrologist"]}, {"page": "Reginald Camm", "response": ["#REDIRECT Bede Camm"]}, {"page": "Reginald Percy John Camm", "response": ["#REDIRECT Bede Camm"]}]}}