{"wiki_id": "http://www.wikidata.org/entity/Q487554", "itemLabel": "Anatole de Grunwald", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anatole_de_Grunwald", "wikipedia_page": {"main": "Anatole \"Tolly\" de Grunwald (25 December 1910 – 13 January 1967) was a Russian British film producer and screenwriter.", "link_mentions": [{"page": "January 13", "response": ["*1967 – Anatole de Grunwald, Russian-English screenwriter and producer (b. 1910)"]}, {"page": "Terence Rattigan", "response": ["*French Without Tears (1940; Anatole de Grunwald and Ian Dalrymple were credited as screenwriters, although Rattigan also played a major role)", "*English Without Tears (1944; with Anatole de Grunwald; U.S. title Her Man Gilbey)", "*Quiet Wedding (1940; with Anatole de Grunwald; based on the play by Esther McCracken)"]}, {"page": "Anthony Asquith", "response": ["Asquith was a longtime friend and colleague of Terence Rattigan (they collaborated on ten films) and producer Anatole de Grunwald. His later films included Rattigan's The Winslow Boy (1948) and The Browning Version (1951), and Oscar Wilde's The Importance of Being Earnest (1952)."]}, {"page": "The First of the Few", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Freedom Radio", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Margaret Leighton", "response": ["Margaret Leighton, CBE (26 February 1922 – 13 January 1976) was an English actress, active on stage and television, and in film.Obituary Variety, 21 January 1976, page 111. Her film appearances included (her first credited debut feature) in Anatole de Grunwald's The Winslow Boy (1948). For The Go-Between (1971), she won the BAFTA Award for Best Actress in a Supporting Role and was nominated for the Academy Award for Best Supporting Actress."]}, {"page": "\"Pimpernel\" Smith", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "The V.I.P.s (film)", "response": ["The V.I.P.s (also known as Hotel International) is a 1963 British drama film in Metrocolor and Panavision. It was directed by Anthony Asquith, produced by Anatole de Grunwald, and distributed by Metro-Goldwyn-Mayer. The film was written by Terence Rattigan, with a music score by Miklós Rózsa.", "Category:Films produced by Anatole de Grunwald"]}, {"page": "List of people from Saint Petersburg", "response": ["* Anatole de Grunwald (1910–1967), Russian British film producer and screenwriter"]}, {"page": "Major Barbara (film)", "response": ["Major Barbara is a 1941 British film starring Wendy Hiller and Rex Harrison. The film was produced and directed by Gabriel Pascal and edited by David Lean. It was adapted for the screen by Marjorie Deans and Anatole de Grunwald, based on the 1905 stage play Major Barbara by George Bernard Shaw. It was both a critical and a financial success.Valerie Pascal. The Disciple and His Devil. New York: McGraw-Hill, 1970.", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "The Way to the Stars", "response": ["The Way to the Stars is a 1945 Anglo-American black-and-white second world war drama film made by Two Cities Films. The film was produced by Anatole de Grunwald, directed by Anthony Asquith, and stars Michael Redgrave, John Mills, Rosamund John, and Stanley Holloway. In the United States it was distributed by United Artists under the title Johnny in the Clouds and was shortened by 22 minutes.Variety film review; 20 June 1945, p. 11.", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "The Glass Slipper (film)", "response": ["Caron had just had a big hit at the studio in Lili so MGM reunited her with that film's producer and director for Glass Slipper. Anatole de Grunwald was assigned to write the script. However eventually script duties went to Helen Deutsch, who wrote Lilli."]}, {"page": "Rodney Ackland", "response": ["His final work for the cinema was on the screenplay for The Queen of Spades (1949), an adaptation of Alexander Pushkin's short story. Ackland intended to direct the film, but fell out with the producer Anatole de Grunwald and star Anton Walbrook. Thorold Dickinson took over at short notice and rewrote Ackland's script with the help of de Grunwald."]}, {"page": "Come Fly with Me (film)", "response": ["Category:Films produced by Anatole de Grunwald"]}, {"page": "Pygmalion (1938 film)", "response": ["The resulting Pygmalion scenario by Cecil Lewis and W.P. Lipscomb removed exposition unnecessary outside a theatrical context and added new scenes and dialogue by Shaw. Ian Dalrymple, Anatole de Grunwald and Kay Walsh also made uncredited contributions to the screenplay. A long ballroom sequence was added, introducing an entirely new character, Count Aristid Karpathy (seen both here and in the musical My Fair Lady, named as Professor Zoltan Karpathy – mentioned in the final scene of the original play, but with no name or onstage appearance), written wholly by Shaw. Against Shaw's wishes, a happy ending was added, with Eliza fleeing Higgins with Freddy but then returning to Higgins's home (though whether permanently or on her own terms is left deliberately ambiguous). Shaw and his fellow writers did, however, retain the controversial line \"Not bloody likely!\" from the play's text, making Hiller possibly the first person to utter that swear word in a British film and giving rise to adverts for the film reading \"Miss Pygmalion?  Not ****** likely!\".", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Ralph Block", "response": ["| Spy for a Day || Screenplay collaboration with Anatole de Grunwald, Emeric Pressburger, and Hans Wilhelm"]}, {"page": "The Winslow Boy (1948 film)", "response": ["The Winslow Boy is a 1948 British drama film adaptation of Terence Rattigan's 1946 play The Winslow Boy. It was made by De Grunwald Productions and distributed by the British Lion Film Corporation. It was directed by Anthony Asquith and produced by Anatole de Grunwald with Teddy Baird as associate producer. The adapted screenplay was written by de Grunwald and Rattigan based on Rattigan's play. The music score was by William Alwyn and the cinematography by Freddie Young.", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "The Yellow Rolls-Royce", "response": ["The Yellow Rolls-Royce is a 1965 dramatic composite film written by Terence Rattigan, produced by Anatole de Grunwald, and directed by Anthony Asquith, the trio responsible for The V.I.P.s (1963).", "In early April 1964, Robert H. O'Brien, President of Metro-Goldwyn-Mayer informed the press about the upcoming Rolls-Royce project, with production set to start on 6 April. Along with the announcement, Anatole de Grunwald was assigned to produce the original screenplay by Terence Rattigan. By that time, Ingrid Bergman, Rex Harrison, Shirley MacLaine, Alain Delon, Jeanne Moreau, George C. Scott and Omar Sharif were already cast in the key roles.", "Category:Films produced by Anatole de Grunwald"]}, {"page": "The Demi-Paradise", "response": ["The Demi-Paradise (also known as Adventure for Two) is a 1943 British comedy film made by Two Cities Films. It stars Laurence Olivier as a Soviet Russian inventor who travels to England to have his revolutionary propeller manufactured, and Penelope Dudley-Ward as the woman who falls in love with him. It was directed by Anthony Asquith and produced by Anatole de Grunwald and Filippo Del Giudice from a screenplay by de Grunwald. The music score was by Nicholas Brodszky and the cinematography by Bernard Knowles. The film was shot at Denham Studios with sets designed by the art director Carmen Dillon.", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "Unpublished Story", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Libel (film)", "response": ["Libel is a 1959 British drama filmVariety film review; 21 October 1959, page 6.Harrison's Reports film review; 24 October 1959, page 170. starring Olivia de Havilland, Dirk Bogarde, Paul Massie, Wilfrid Hyde-White and Robert Morley. The film's screenplay was written by Anatole de Grunwald and Karl Tunberg from a 1935 play of the same name by Edward Wooll.Libel!, written by Edward Wooll and directed by Anthony Asquith, played on Broadway for 159 performances in 1935-1936. ", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "I Thank a Fool", "response": ["I Thank a Fool is a 1962 British Metrocolor crime film made by Eaton (De Grunwald Productions) and Metro-Goldwyn-Mayer in CinemaScope. It was directed by Robert Stevens and produced by Anatole de Grunwald from a screenplay by Karl Tunberg based on the 1958 novel of the same title by Audrey Erskine Lindop. The music score was by Ron Goodwin and the cinematography by Harry Waxman.", "Category:Films produced by Anatole de Grunwald"]}, {"page": "BAFTA Award for Outstanding British Film", "response": ["|The Queen of Spades || Thorold Dickinson || Anatole de Grunwald"]}, {"page": "The Day Will Dawn", "response": ["The Day Will Dawn, released in the US as The Avengers, is a 1942 British war film set in Norway during World War II. It stars Ralph Richardson, Deborah Kerr, Hugh Williams and Griffith Jones, and was directed by Harold French from a script written by Anatole de Grunwald, Patrick Kirwan and Terence Rattigan, based on a story by Frank Owen.Allmovie Credits The music by Richard Addinsell was performed by the London Symphony Orchestra conducted by Muir Mathieson.", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "The Queen of Spades (story)", "response": ["One of the most notable adaptations of The Queen of Spades was a film produced by Anatole de Grunwald completed in 1949. This film is recognized for its fidelity to the original story with few differences such as the depiction of the backstory about how the Countess acquired the secret of the three winning cards. This film was directed by Thorold Dickinson. It received widespread critical acclaim and was nominated for the BAFTA award for Best British Film.", "* The 1949 British film The Queen of Spades produced by Anatole de Grunwald "]}, {"page": "Anatole de grunwald", "response": ["#REDIRECT Anatole de Grunwald "]}, {"page": "St James's Club", "response": ["*Anatole de Grunwald (1910–1967), film producerde GRUNWALD, Anatole in Who Was Who 1897–2006 online (accessed 10 January 2008)"]}, {"page": "The Queen of Spades (1949 film)", "response": ["The screenplay was adapted from a short story of the same name by Alexander Pushkin, with a script written by Arthur Boys and Rodney Ackland. Ackland was also originally the film's director, before disagreements with producer Anatole de Grunwald and star Walbrook, caused him to be replaced at a few days notice by Thorold Dickinson, who also rewrote sections of the script.", "Category:Films produced by Anatole de Grunwald"]}, {"page": "The Holly and the Ivy (film)", "response": ["The Holly and the Ivy is a 1952 British drama film adapted from the 1950 play of the same name by Wynyard Browne. It was directed by George More O'Ferrall, produced by Anatole de Grunwald and co-scripted by Browne and de Grunwald. It is about an Irish clergyman whose neglect of his grown offspring, in his zeal to tend to his parishioners, comes to the surface at a Christmas family gathering. Starring Ralph Richardson, Celia Johnson, ", "According to the November 2009 Moviemail Catalogue, \"Russian screen writer Anatole de Grunwald imbues this poignant adaptation of Wynward Browne's West End stage hit with Chekhov's spirit and relocates the Russian's genius for deftly-drawn characters to a rambling Norfolk parsonage on Christmas Eve. [...] while The Holly and The Ivy now radiates a nostalgic glow, it is actually a revealing record of a country on the cusp of the dramatic social, economic and cultural change that has, sadly, made faith, fidelity and family feel like relics of a distant past.\"P. Peters, Moviemail Catalogue, November 2009", "Category:Films produced by Anatole de Grunwald", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "French Without Tears (film)", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Jeannie (film)", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Innocents in Paris", "response": ["Innocents in Paris is a 1953 British-French international co-production comedy film produced by Romulus Films, directed by Gordon Parry and starring Alastair Sim, Ronald Shiner, Claire Bloom, Margaret Rutherford, Claude Dauphin, and Jimmy Edwards, and also featuring James Copeland.Innocents in Paris (1953) - IMDb Popular French comedy actor Louis de Funès appears as a taxi driver, and there are cameo appearances by Christopher Lee, Laurence Harvey and Kenneth Williams. The writer and producer was Anatole de Grunwald, born in Russia in 1910, who fled to Britain with his parents in 1917. He had a long career there as a writer and producer, including the films The Way to the Stars, The Winslow Boy, Doctor's Dilemma, Libel, and The Yellow Rolls Royce.Innocents in Paris - BFI", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "Women of Twilight", "response": ["Women of Twilight is a 1951 play by Sylvia Rayman that became a 1952 film directed by Gordon Parry. The latter stars Freda Jackson, Rene Ray and Lois Maxwell, with a screenplay by Anatole de Grunwald.BFI.org It was the first British film to receive the recently introduced X certificate."]}, {"page": "Secret Mission", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Bond Street (film)", "response": ["*'Britmovie' called the film an \"entertaining portmanteau comedy-drama charting the events occurring during a typical 24-hour period on London’s thoroughfare Bond Street. Linking the four stories together is the impending wedding of society girl Hazel Court and Robert Flemyng. Producer Anatole de Grunwald and co-writer Terence Rattigan would later revisit the formula for Anthony Asquith’s The V.I.P.s (1963) and The Yellow Rolls-Royce (1964).\"", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "The Doctor's Dilemma (film)", "response": ["Anatole de Grunwald and Anthony Asquith had been developing a film about T. E. Lawrence to star Dirk Bogarde, but it was cancelled at the last minute. This film was offered to Bogarde as an alternative.Margarita Landazuri, 'The Doctor's Dilemma', Turner Classic Movies, accessed 26 June 2012", "Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "Daily Mail National Film Awards", "response": ["Best Film - Way to the Stars. Collected by Anatole de Grunwald (Producer) and Anthony Asquith (Director)"]}, {"page": "Quiet Wedding", "response": ["Quiet Wedding is a 1941 British romantic comedy film directed by Anthony Asquith and starring Margaret Lockwood, Derek Farr and Marjorie Fielding. The screenplay was written by Terence Rattigan and Anatole de Grunwald based on the play Quiet Wedding by Esther McCracken. The film was remade in 1958 as Happy Is the Bride.", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Penn of Pennsylvania", "response": ["The idea of a film about Penn was developed by the producer Richard Vernon.Capua, p. 15 After listening to a radio broadcast by President Franklin Delano Roosevelt, Vernon had been struck by how similar his views were to the Quaker philosophy of William Penn the next morning he approached bosses at British National Films and pitched the idea of a Penn biopic to them, securing their support.McFarlane, p.19 Anatole de Grunwald hastily wrote a screenplay and the film began production at Elstree Studios on 10 February 1941.", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "They Met in the Dark", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Home at Seven (film)", "response": ["Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "Anatole (given name)", "response": ["* Anatole de Grunwald (1910–1967), British film producer and screenwriter"]}, {"page": "While the Sun Shines", "response": ["Category:Films with screenplays by Anatole de Grunwald", "Category:Films produced by Anatole de Grunwald"]}, {"page": "Treasure Hunt (1952 film)", "response": ["TV Guide called it \"A tedious comedy\";http://www.tvguide.com/movies/treasure-hunt/review/121192/ Britmovie called it a \"Minor farce\";http://www.britmovie.co.uk/films/Treasure-Hunt_1952/ while Sky Movies wrote, \"Producer Anatole de Grunwald adapted the stage play by M J Farrell and John Perry in an enjoyably straightforward way. Director John Paddy Cartairs handles the film with appropriate vitality, making the most of the basically conventional stage Irish characters. Martita Hunt and Athene Seyler stand out in a large cast, among whom are such familiar faces as Miles Malleson, Alfie Bass and Hammer Films regular Michael Ripper.\"http://www.sky.com/tv/movie/treasure-hunt-1952", "Category:Films with screenplays by Anatole de Grunwald"]}, {"page": "The Last Days of Dolwyn", "response": ["Category:Films produced by Anatole de Grunwald"]}]}}