{"wiki_id": "http://www.wikidata.org/entity/Q4875072", "itemLabel": "Baz Bamigboye", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Baz_Bamigboye", "wikipedia_page": {"main": "Baz Bamigboye (born 17 September 1957) is a British gossip columnist and entertainments writer for the Daily Mail group of newspapers.  Born in Nigeria, he is the son of Bamidele, the Oba of Iresi, Nigeria\nHe began his journalistic career working on a local newspaper in Kingston-upon-Thames, Surrey. He has been mentioned in other British publications (e.g., The Guardian, The Daily Telegraph, and the BBC).  He was given the \"Showbusiness Reporter of the Year\" award at the British Press Awards in 2003.TV appearances include Have I Got News for You, Club Mix on Channel 4, The James Whale Radio Show on ITV, Jack and Baz on BSkyB, and appearances on US TV.", "link_mentions": [{"page": "List of Have I Got News for You episodes", "response": ["|Baz Bamigboye"]}, {"page": "Tomorrow Morning (musical)", "response": ["On 25 March 2021, Baz Bamigboye of the Daily Mail announced a forthcoming feature film adaptation to be released in late 2021 starring Samantha Barks and Ramin Karimloo directed by Nick Winston."]}, {"page": "British Independent Film Awards 2009", "response": ["* Baz Bamigboye"]}, {"page": "Baz (name)", "response": ["*Baz Bamigboye, British journalist"]}, {"page": "Bamigboye", "response": ["*Baz Bamigboye, British gossip columnist"]}, {"page": "64th Evening Standard Theatre Awards", "response": ["The Advisory Judging Panel consisted of Evening Standard chief theatre critic Henry Hitchings, Daily Mail columnist Baz Bamigboye, The Guardian culture writer and broadcaster Mark Lawson, WhatsOnStage theatre critic Sarah Crompton, The New York Times International theatre critic Matt Wolf and Evening Standard editor George Osborne."]}, {"page": "63rd Evening Standard Theatre Awards", "response": ["The advisory judging panel consisted of Daily Mail columnist Baz Bamigboye, WhatsOnStage theatre critic Sarah Crompton, Evening Standard chief theatre critic Henry Hitchings, The Guardian culture writer and broadcaster Mark Lawson, The New York Times International theatre critic Matt Wolf and Evening Standard editor George Osborne."]}, {"page": "62nd Evening Standard Theatre Awards", "response": ["The advisory judging panel comprised Daily Mail columnist Baz Bamigboye, WhatsOnStage writer Sarah Crompton, Evening Standard chief theatre critic Henry Hitchings, The Guardian culture writer and broadcaster Mark Lawson, Evening Standard editor Sarah Sands and New York Times International London theatre critic Matt Wolf."]}]}}