{"wiki_id": "http://www.wikidata.org/entity/Q4882032", "itemLabel": "Belbury Poly", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Belbury_Poly", "wikipedia_page": {"main": "Belbury Poly is the studio band of Ghost Box Records co-founder Jim Jupp. Jupp is the main composer and producer and also plays synth, keyboards and guitar. Other members are session musicians, that have included: Christopher Budd on bass and lead guitar, Jim Musgrave on drums, James Allen on drums, David Sharp on acoustic guitar and Jon Brooks on piano.", "link_mentions": [{"page": "Arthur Machen", "response": ["In music, the composer John Ireland found Machen's works to be a life-changing experience that directly influenced much of his composition. Mark E. Smith of The Fall also found Machen an inspiration. Likewise, Current 93 have drawn on the mystical and occult leanings of Machen, with songs such as \"The Inmost Light\", which shares its title with Machen's story. Some artists on the Ghost Box Music label like Belbury Poly and The Focus Group draw heavily on Machen. It is an interest also shared by film directors like Mexican Rogelio A. González who made a successful version of \"The Islington Mystery\" as El Esqueleto de la señora Morales (1960), adapted by Luis Alcoriza, a frequent collaborator in Luis Buñuel's classic films. This interest in Machen's works among filmmakers is also shared by Guillermo del Toro and Richard Stanley. Other notable figures with an enthusiasm for Machen have included Brocard Sewell, Barry Humphries, Stewart Lee and Rowan Williams, Archbishop of Canterbury."]}, {"page": "Daphne Oram", "response": ["* \"Spaceship UK: The Untold Story of the British Space Programme\" (2010), promotional 7\" split single with Belbury Poly"]}, {"page": "Chanctonbury Ring", "response": ["The album Chanctonbury Rings by Justin Hopper, Sharron Kraus and Belbury Poly, released on Ghost Box Records in 2019, contains prose and poetry detailing the geography and legends relating to the rings and its environs."]}, {"page": "Ghost Box Records", "response": ["Ghost Box is an independent, UK-based electronic music record label, launched in 2004 by graphic designer Julian House and producer Jim Jupp. Its roster includes artists such as Jupp's Belbury Poly, House's The Focus Group, and the Advisory Circle, as well as releases by Broadcast and John Foxx among others.", "Jupp and House have described the label as existing in an imagined or misremembered past. Influenced by school textbooks and the rigid design grid of Penguin and Pelican paperback books, Ghost Box records and CDs were always intended to look and sound like artefacts from a parallel world, familiar, elegant, but somehow \"wrong\". It’s a world outside of time where cultural references from a roughly 20-year period (1958-1978) are happening all at once.Interview: Belbury Poly, FACT magazine", "Ghost Box’s key artists are House's own The Focus Group and Jupp’s Belbury Poly as well as The Advisory Circle, the recording name for the work of producer and longest serving Ghost Box collaborator Jon Brooks.", "| Belbury Poly || Farmer's Angle (2004) || 3\" CD-EP || GBX001 ", "| Belbury Poly || The Willows (2005) || CD/LP || GBX003", "| Belbury Poly || The Owl's Map (2006) || CD/LP || GBX007", "| Belbury Poly || From an Ancient Star (2009) || CD || GBX011", "| Belbury Poly || Farmer's Angle (Revised Edition) (2010) || CD/10\" || GBX014", "| Belbury Poly || The Belbury Tales (2012) || CD/LP || GBX016", "| The Belbury Poly || New Ways Out (2016) || CD/LP || GBX024", "| Justin Hopper & Sharron Kraus with The Belbury Poly|| Chanctonbury Rings (2019) || CD/LP || GBX033", "| Belbury Poly|| The Gone Away (2020) || CD/LP || GBX035", "| Belbury Poly and Moon Wiring Club || Study Series 01: Youth and Recreation (2010) || Single || GBX701", "| Belbury Poly and Mordant Music || Study Series 03: Welcome to Godalming (2010) || Single || GBX703", "| Belbury Poly and The Advisory Circle || Study Series 08: Inversions (2012) || Single || GBX708", "| Belbury Poly and Spacedog || Study Series 10: Message and Method (2013) || Single || GBX710", "| Pye Corner Audio with Belbury Poly || Other Voices 05: Machines are Obsolete/ Pathways (2015) || Single || GBX715", "| Belbury Poly & Moon Wiring Club || Other Voices 09: The Music Room/ Moonling (2017) || Single || GBX719", "| Sharron Kraus with Belbury Poly || Other Voices 10: Something Out of Nothing/Something Out of Nothing (Belbury Poly Mix) (2019) || Single || GBX720", "| Beautify Junkyards & Belbury Poly || Painting Box/Ritual in Transfigured Time (2021) || Single || GBX722"]}, {"page": "Eric Zann", "response": ["Eric Zann is an alias of electronic musician Jim Jupp (along with Belbury Poly). Jupp's releases are on the Ghost Box Music label, of which he is a co-founder. The name references a minor H. P. Lovecraft short story, The Music of Erich Zann."]}, {"page": "The Owl's Map", "response": ["The Owl's Map is an album by Jim Jupp, under the pseudonym of Belbury Poly. The album was released on 10 September 2006 on the Ghost Box Music label.", "Category:Belbury Poly albums"]}, {"page": "The Willows (album)", "response": ["The Willows is an album by Jim Jupp, under the pseudonym of Belbury Poly. The album was released in 2004 on the Ghost Box Music label. It is named after a short story by Algernon Blackwood.", "Category:Belbury Poly albums"]}, {"page": "We Are All Pan's People", "response": ["We Are All Pan's People is an album by Julian House, under the pseudonym of The Focus Group. It was released on 26 March 2007 on the Ghost Box Music label. The title and artwork owe a simultaneous debt to the 1970s dance troupe Pan's People and the stories - the novella The Great God Pan specifically - of Arthur Machen; labelmates Eric Zann and Belbury Poly have also acknowledged a debt to the author."]}, {"page": "Farmer's Angle", "response": ["Farmer's Angle is an EP by Jim Jupp, under the pseudonym of Belbury Poly. It was released in 2004 on CD-R and was the first release on the Ghost Box Music label.", "Category:Belbury Poly albums"]}, {"page": "From an Ancient Star", "response": ["From an Ancient Star is an album by Belbury Poly.", "Category:Belbury Poly albums"]}, {"page": "Jim Jupp", "response": ["Jim Jupp is a producer, composer, and along with the graphic designer Julian House he co-owns the Ghost Box record labelAlexis Petridis Interview with Ghost BoxThe GuardianInterview with Julian House , FACT Magazine and manager of Belbury Music Publishing.Interview with Jim Jupp, 15 QuestionsInterview with Jim Jupp, Cyclic Defrost He records as Belbury Poly.", "Since 2004 he has recorded six albums for Ghost Box with Belbury Poly,Belbury Poly and Ghost Box feature reviewThe GuardianBelbury Tales reviewBBC Music and one album as Eric Zann and also records with Jon Brooks as The Belbury Circle. He has collaborated on Ghost Box singles and EPs with John Foxx, Pye Corner Audio, Spacedog, The Advisory Circle and Moon Wiring Club,Ghost Box Catalogue , - from the Ghost Box website Jupp has remixed work by Pye Corner Audio, The Advisory Circle, Moon Wiring Club, Bill Ryder-Jones, John Foxx, Mirrors, Bernard Fevre, The Memory Band, Sharron Kraus. The track \"The Willows\" taken from the first Belbury Poly album of the same name was reworked by Paul Weller as \"Earth Beat\"https://hauntedgeneration.co.uk/2020/05/08/jim-jupp-intermission-and-ghost-box-records/ Interview with Jim Jupp by The Haunted Generation Blog for his 2020 album On Sunset. The debut EP by Belbury Poly, Farmer's Angle was included in an Electronic Sound magazine feature, A History of Electronic Music in 75 Records.https://electronicsound.co.uk/product/issue-65-print-edition/", "In interviews Jupp has cited several influences including French soundtrack composer François de Roubaix, Harmonia, the BBC Radiophonic Workshop, Broadcast, Caravan and more generally Early Music, Folk music, Krautrock, 1970s TV Soundtracks and Electronic Music of the 60s & 70s.Belbury Poly Interview, FACT magazineGhost Box Label feature, CLASH magazineInterview with Jim Jupp, Cardboard Cutout SundownInterview with Jim Jupp, Diabolique Magazine"]}, {"page": "Dimly Lit", "response": ["The album incorporates elements of psychedelia, library music recordings, jazz and krautrock. Bands such as Stereolab, Broadcast and Silver Apples have been noted as being an influence on the album, which can be heard in the drum patterns, keyboard lines and vocal melodies, as well as in the production of the songs which feature strong use of spring reverb, valve amplifiers and tape delay. The short, hauntology-esque vignettes between various songs also bear resemblance to releases from the Ghost Box record label, such as those by The Focus Group and Belbury Poly. Studio La Vache, the studio at which the album was recorded in rural Toulouse, uses a mixing desk once belonging to the famous cabaret venue Moulin Rogue."]}, {"page": "The Belbury Tales", "response": ["The Belbury Tales is a 2012 concept album by Jim Jupp, under the pseudonym of Belbury Poly. It was released on 24 February 2012 on CD, online download, and 12\" vinyl record. Rob Young contributed the short story \"The Journeyman’s Tale\" to the liner notes.", "Category:Belbury Poly albums"]}, {"page": "New Ways Out", "response": ["New Ways Out is a 2016 album by Jim Jupp, under the pseudonym of Belbury Poly. It was scheduled to be released on 27 May 2016 by independent record label Ghost Box Music on CD, online download, and 12\" vinyl record.", "Category:Belbury Poly albums"]}, {"page": "Hauntology (music)", "response": ["The term hauntology was introduced by French philosopher Jacques Derrida in his 1993 book Specters of Marx as a term for the post-Marxist understanding of what is perceived as the tendency of Karl Marx's ideas to \"haunt Western society from beyond the grave\". In music journalism, Derrida's ideas were invoked by critic Ian Penman for his 1995 essay on the production style of Tricky's album Maxinquaye, though Penman did not use the phrase \"hauntology.\" In the mid-2000s, the word began to be more widely appropriated by writers and theorists such as Simon Reynolds and Mark Fisher, who referred to the work of Philip Jeck, William Basinski, Burial, The Caretaker, and artists associated with the UK label Ghost Box as hauntology. Fisher attributed this renewed discussion of hauntology to the emergence of lo-fi musician Ariel Pink in the mid-2000s. In an 2006 article for The Wire, Reynolds identified Ghost Box's the Focus Group, Belbury Poly, the Advisory Circle as prominent in the trend, along with Broadcast, the Caretaker, and Mordant Music."]}]}}