{"wiki_id": "http://www.wikidata.org/entity/Q4885773", "itemLabel": "Ben Hall", "itemDescription": "English footballer (1881-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Hall_(footballer,_born_1879)", "wikipedia_page": {"main": "Benjamin Hall (6 March 1879 – 1963) was an English football player, manager and trainer, who played as a centre half.\nHall's playing career saw him represent Grimsby Town, Derby County, Leicester Fosse, Hyde, Heywood United and South Shields before the First World War. After the war he worked as a trainer for Huddersfield Town before being appointed as Bristol Rovers' first Football League manager in 1920.Three of his brothers, Harry, Ellis and Fretwell, also played in the Football League.", "link_mentions": [{"page": "Bristol Rovers F.C.", "response": ["* Ben Hall 1920–1921"]}, {"page": "Benjamin Hall", "response": ["Benjamin or Ben Hall may refer to:", "* Ben Hall (baseball) (born 1983), American college baseball coach and former second baseman", "* Ben Hall (bushranger) (1837–1865), Australian bushranger", "** Ben Hall (TV series), 1975", "* Ben Hall (actor) (1899–1985), American actor ", "* Ben Hall (footballer, born 1879) (1879–1963), English football player, manager and trainer", "* Ben Hall (footballer, born 1997), Northern Irish football player for Falkirk", "* The Legend of Ben Hall, a 2016 Australian film about the bushranger"]}, {"page": "List of Bristol Rovers F.C. managers", "response": ["Although the club were founded in 1883, they did not appoint a full-time manager until 1899, when Alfred Homer, who was assistant secretary of Aston Villa, was appointed as manager-secretary of Bristol Rovers, a position he held for twenty-one years. On joining the Football League in 1920, the club appointed Ben Hall to the manager's post. Hall held the job for one year before handing over to Andrew Wilson, the club's first non-English manager."]}, {"page": "Fretwell Hall", "response": ["Hall began his football career with South Shields of the North-Eastern League in early 1913. His brother Ellis was already on their books, and Ben Hall was to join later. He remained with the club until February 1915, when he signed for Goole Town of the Midland League. Hall served in the Royal Army Veterinary Corps during the First World War. Afterwards, a trial with Derby County, though promising, came to nothing, and he spent the 1919–20 season with Norwich City, for whom he made 30 appearances in the Southern League."]}]}}