{"wiki_id": "http://www.wikidata.org/entity/Q4888868", "itemLabel": "Benjamin Jacob", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Jacob", "wikipedia_page": {"main": "Benjamin Jacob (1 April 1778 – 24 August 1829) was an English organist, conductor, and composer. He was a pupil of Willoughby, William Shrubsole, and Samuel Arnold (1796).Jacob was born and died in London.  He was an organist at various churches, finally at Surrey Chapel (1794–1825). With Wesley and Crotch, he gave organ recitals to immense audiences from 1808 to 1814. He conducted a series of oratorios in 1800, and the Lenten Oratorios at Covent Garden in 1818. His works include National Psalmody (London, 1819) and other collections, as well as glees, songs, and an arrangement of the Macbeth music.", "link_mentions": [{"page": "1778", "response": ["* April 1 – Benjamin Jacob, British musician (d. 1829)"]}, {"page": "Samuel Wesley", "response": ["Wesley seems to have become acquainted with the works of Johann Sebastian Bach sometime between 1796 and 1808. In 1810, he and Charles Frederick Horn collaborated in publishing the first English edition of J.S. Bach's Well-Tempered Clavier. Their joint publication and popularisation of Bach's work have been described as an \"English Bach awakening\".  No time was lost in converting others to the Bach cause; Wesley's principal converts were William Crotch and Charles Burney.  In a series of letters to his friend, Benjamin Jacob, Wesley documented how he made Bach better appreciated."]}, {"page": "Benjamin R. Jacobs", "response": ["Benjamin Ricardo Jacobs, Ph.D. (March 15, 1879 – February 3, 1963) was born at the American Consulate in Lima, Peru to Rosa Mulet Jacobs of Valparaíso, Chile, a French-Chilean, and Washington Michael Jacobs of South Carolina in the United States. Originally christened on April 5, 1879 as Ricardo Benjamin Jacobs, he later changed his name, once by reversing the order of his first and middle name, and then in some records by anglicizing the name Ricardo to Richard. His mother was the accomplished and well-educated daughter of a noted French merchant in Valparaíso. At the time of his birth, his father was the American vice-consul to Peru. A businessman with many interests in the United States, including mining, his father also was engaged in mining in several countries in South America and he published the Imprenta Americana and a semi-weekly newspaper, El Tumbes.", "When the War of the Pacific broke out between Chile and the united forces of Bolivia and Peru, his family moved to Oakland, California, the state where his father had resided previously and retained business interests. They soon moved to Tucson, Arizona. In 1880, his father opened the Jacobs Assay Office (still in operation by his descendants). During the 1880s through the 1890s, Washington M. Jacobs managed varied mining interests, and was elected Justice of the Peace of the Tucson Precinct of Pima County in 1887, serving for two years. Benjamin Jacobs grew up in multi-cultural Tucson and learned the basics of chemistry in his father's assay and chemical laboratory. He also worked in the family mining businesses in Arizona and Mexico, one of which at Ajo, Arizona later became a major copper producer. After his father's death in 1899, Benjamin Jacobs relocated his mother and younger sisters to Oakland, where nearby, he attended and briefly taught chemistry at the University of California, Berkeley."]}, {"page": "Surrey Chapel, Southwark", "response": ["Surrey Chapel, though owned and managed by independent trustees primarily as a Nonconformist chapel, was operated as a venue for music, singing, and for the meetings of charities, associations and societies, several of which became closely associated with it. For a time, the composer and arranger Benjamin Jacob was organist, attracting thousands; a practical response to Rowland Hill's well known concern about chapel music of the time:  'Why should the Devil have all the good tunes ?' ."]}, {"page": "List of mayors of Belo Horizonte", "response": ["| bgcolor=#CCFFCC | Benjamin Jacob"]}, {"page": "Clavier-Übung III", "response": ["The organist, composer and music teacher Samuel Wesley (1766–1837) played a significant role in awakening interest in Bach's music in England, mostly in the period 1808–1811. After a lull in his own career, in the first half of 1806 he made a hand copy of Nägeli's Zürich edition of The Well-Tempered Clavier. In early 1808 Wesley visited Charles Burney in his rooms in Chelsea where he played for him from the copy of Book I of the '48' that Burney had received from C.P.E. Bach in 1772. As Wesley later recorded, Burney \"was very delighted ... and expressed his Wonder how much abstruse Harmony & such perfect & enchanting Melody could have been so marvelously united!\" Wesley subsequently consulted Burney, now a convert to the music of Bach, on his project to publish his own corrected transcription, stating, \"I believe I can fairly securely affirm that mine is now the most correct copy in England.\" This project was eventually undertaken in with Charles Frederick Horn, published in four installments between 1810 and 1813. In June 1808 after a concert the Hanover Square Rooms during which Weseley performed some excerpts from the '48', he commented that, \"this admirable Musick might be played into Fashion; you see I have only risked one modest Experiment, & it has electrified the Town just in the way that we wanted.\" Further concerts took place there and in the Surrey Chapel with Benjamin Jacob, a fellow organist with whom Wesley corresponded copiously an effusively about Bach. The musicologist and organist William Crotch, another advocate of Bach, lectured on Bach in 1809 in the Hanover Square Rooms prior to publishing his edition of the E major fugue BWV 878/2 from The Well-Tempered Clavier II. In the introduction, after commenting that Bach fugues were \"very difficult of execution, profoundly learned and highly ingenious\", he described their \"prevailing style\" as \"the sublime\". By 1810, Wesley had stated his intention to perform the E flat fugue BWV 552/2 from Clavier-Übung III in St. Paul's Cathedral. In 1812, in the Hanover Square Rooms he performed an arrangement of the E flat prelude for organ duet and orchestra with the arranger Vincent Novello, founder of the music publishing firm Novello & Co, that would later bring out an English edition of Bach's complete organ works. In 1827, the E flat fugue had been arranged for organ or piano duet by Jacob and was even performed by three players two years later on the organ in St. James, Bermondsey, where the pedal could be played on a supplementary keyboard. It had also been used for auditions for organists: Wesley's son Samuel Sebastian Wesley himself played it in 1827, when seeking employment (unsuccessfully). The chorale preludes from Clavier-Übung III were also performed during this period: in his letters to Benjamin, Wesley mentions in particular Wir glauben BWV 680, which had become known as the \"giant fugue\", because of the striding figure in the pedal part. By 1837, pedal technique on the organ had developed sufficiently in England that the composer and organist Elizabeth Stirling (1819–1895) could give concerts in St Katherine's, Regent's Park and St. Sepulchre's, Holborn containing several of the pedaliter chorale preludes (BWV 676, 678, 682, 684) as well as the St Anne Prelude BWV 552/1. (These were the first public recitals in England by a female organist; in 1838 she performed BWV 669–670 and the St Anne fugue BWV 552/2 at St Sepulchre's.) In the same year Wesley and his daughter were invited to the organ loft of Christ Church, Newgate for a Bach recital by Felix Mendelssohn. As Mendelssohn recorded in his diary,", "*Benjamin Jacob (1778–1829), arrangement of prelude and fugue BWV 552 for piano duet"]}, {"page": "Ben Jacobs", "response": ["* Benjamin Jacobs (dentist) (1919–2004), dentist who survived Auschwitz", "* Benjamin Jacob (1778–1829), English organist, conductor, and composer"]}, {"page": "William Shrubsole", "response": ["Shrubsole became organist of Spa Fields Chapel, London, and held the post till his death on 18 January 1806. He was a successful teacher in London, and among his pupils were William Russell and Benjamin Jacob. The 1794 Musical Directory describes him as an alto singer, and in that capacity he is said to have sung at Drury Lane and Westminster Abbey."]}, {"page": "Jacob, Benjamin", "response": ["#redirectBenjamin Jacob"]}, {"page": "Reception of Johann Sebastian Bach's music", "response": ["The organist, composer and music teacher Samuel Wesley (1766–1837) played a significant role in awakening interest in Bach's music in England, mostly in the period 1808–1811. After a lull in his own career, in the first half of 1806 he made a hand copy of Nägeli's Zürich edition of The Well-Tempered Clavier. In early 1808 Wesley visited Charles Burney in his rooms in Chelsea where he played for him from the copy of Book I of the '48' that Burney had received from C.P.E. Bach in 1772. As Wesley later recorded, Burney \"was very delighted ... and expressed his Wonder how much abstruse Harmony & such perfect & enchanting Melody could have been so marvelously united!\" Wesley subsequently consulted Burney, now a convert to the music of Bach, on his project to publish his own corrected transcription, stating, \"I believe I can fairly securely affirm that mine is now the most correct copy in England.\" This project was eventually undertaken in with Charles Frederick Horn, published in four installments between 1810 and 1813. In June 1808 after a concert the Hanover Square Rooms during which Weseley performed some excerpts from the '48', he commented that, \"this admirable Musick might be played into Fashion; you see I have only risked one modest Experiment, & it has electrified the Town just in the way that we wanted.\" Further concerts took place there and in the Surrey Chapel with Benjamin Jacob, a fellow organist with whom Wesley corresponded copiously an effusively about Bach. The musicologist and organist William Crotch, another advocate of Bach, lectured on Bach in 1809 in the Hanover Square Rooms prior to publishing his edition of the E major fugue BWV 878/2 from The Well-Tempered Clavier II. In the introduction, after commenting that Bach fugues were \"very difficult of execution, profoundly learned and highly ingenious\", he described their \"prevailing style\" as \"the sublime\". By 1810, Wesley had stated his intention to perform the E flat fugue BWV 552/2 from Clavier-Übung III in St. Paul's Cathedral. In 1812, in the Hanover Square Rooms he performed an arrangement of the E flat prelude for organ duet and orchestra with the arranger Vincent Novello, founder of the music publishing firm Novello & Co, that would later bring out an English edition of Bach's complete organ works. In 1827, the E flat fugue had been arranged for organ or piano duet by Jacob and was even performed by three players two years later on the organ in St. James, Bermondsey, where the pedal could be played on a supplementary keyboard. It had also been used for auditions for organists: Wesley's son Samuel Sebastian Wesley himself played it in 1827, when seeking employment (unsuccessfully). The chorale preludes from Clavier-Übung III were also performed during this period: in his letters to Benjamin, Wesley mentions in particular Wir glauben BWV 680, which had become known as the \"giant fugue\", because of the striding figure in the pedal part. By 1837, pedal technique on the organ had developed sufficiently in England that the composer and organist Elizabeth Stirling (1819–1895) could give concerts in St Katherine's, Regent's Park and St. Sepulchre's, Holborn containing several of the pedaliter chorale preludes (BWV 676, 678, 682, 684) as well as the St Anne Prelude BWV 552/1. (These were the first public recitals in England by a female organist; in 1838 she performed BWV 669–670 and the St Anne fugue BWV 552/2 at St Sepulchre's.) In the same year Wesley and his daughter were invited to the organ loft of Christ Church, Newgate for a Bach recital by Felix Mendelssohn. As Mendelssohn recorded in his diary,"]}]}}