{"wiki_id": "http://www.wikidata.org/entity/Q4883359", "itemLabel": "Bella Goodall", "itemDescription": "British actor and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bella_Goodall", "wikipedia_page": {"main": "Isabella Goodall (10 August 1851 – 2 February 1884) was an English soubrette of the Victorian theatre. She made her name on the stage in her native city, Liverpool, and later became a star of the London theatre, both in burlesque and comic plays.", "link_mentions": [{"page": "La Vivandière (Gilbert)", "response": ["| Bella Goodall"]}, {"page": "The Merry Zingara", "response": ["*Max (his valet) – Bella Goodall", "The critics noted that the mandatory quotient of pretty actresses in short skirts, or playing men's roles in tights was duly delivered: although the hero was always a woman in these types of pieces, in this case, of the nine members of the cast, four were actresses playing roles en travesti.  Gilbert renounced this practice as soon as he was in a professional position to do so.Stedman, Jane. \"From Dame to Woman: W. S. Gilbert and Theatrical Transvestism\", Victorian Studies, Vol. 14, No. 1, September 1970   The critic of The Sporting Times wrote, \"My friend, a stern and powerful man, held me down in my stall when Miss Bella Goodall appeared … Miss Annie Bourke, too, was something which could not be looked upon without the deepest emotion.\"The Sporting Times, 4 April 1868, p. 109 The piece ran for 120 nights, but Gilbert later said, \"It suffered from comparison with Mr. F. C. Burnand's Black-Eyed Susan, which it immediately followed [at the Royalty], and which had achieved the most remarkable success recorded in the annals of burlesque.\"Gilbert, W. S., \"William Schwenck Gilbert – An Autobiography\", The Theatre, 2 April 1883, p. 217"]}, {"page": "Harlequin Cock Robin and Jenny Wren", "response": ["*Satana (a supernatural preternatural and altogether utterly unnatural Mephistophelian personage – in league with Miasma) – Miss Goodall.Evidently not Bella Goodall, who was appearing in a rival Christmas show at the time"]}]}}