{"wiki_id": "http://www.wikidata.org/entity/Q4885964", "itemLabel": "Ben Joyce", "itemDescription": "British footballer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Joyce", "wikipedia_page": {"main": "Ben Patrick Joyce (born 9 September 1989) is an English footballer who plays as a Midfielder for Plymouth Parkway.", "link_mentions": [{"page": "Ashley Westwood (footballer, born 1976)", "response": ["Conference National side Kettering Town underwent a financial crisis in 2011–12, and caretaker manager Mark Cooper walked out on the club on 18 January after his players went unpaid. Three days later, Westwood was announced as the club's temporary manager; he was also registered with the club as a player. Later that day, his new team lost 4–1 to Wrexham at the Racecourse Ground, having only been able to name two substitutes. The \"Poppies\" then won their next two games at Nene Park to move out of the relegation zone. After being told his job was secure until the end of the season, he picked himself to play for the first time in the 1–0 defeat at Hayes & Yeading on 10 March; also in March he signed Ben Joyce and Max York. Kettering failed to turn things around, and were relegated in last place having conceded 100 goals in 46 league games. In May 2012, he signed a one-year playing contract with Lincoln City, also in the Conference. Lincoln manager David Holdsworth reluctantly allowed Westwood to leave the club on 6 July 2012, having failing to kick a ball for the Imps."]}, {"page": "Ben Tozer", "response": ["Born in Plymouth, Tozer began his career as a youth player at his local club Plymouth Argyle, where he studied for a BTEC National Diploma in Sport at City College Plymouth and was part of the college's Football Development Centre. Former Argyle youth coach David Byrne, who by this point had taken up a similar role at Swindon Town persuaded the Tozer family to allow Ben to join him in Wiltshire alongside fellow Argyle youngster Ben Joyce."]}, {"page": "Sean Morrison (footballer)", "response": ["Born in Plymouth, Devon, Morrison was a keen sportsman as a teenager, playing football and competing in athletics events. He favoured the long jump and represented his county and the South-West England team in the event. At the age of fourteen, he gave up athletics due to the travelling involved and to focus on his football career. Morrison joined his hometown club Plymouth Argyle in 2006, playing in the club's youth system for a year. However, he was released by Plymouth at the age of sixteen after being told by coaches that he \"didn't use (his) size well enough.\" He subsequently joined Swindon Town in the summer of 2007, after being spotted by youth team manager Paul Bodin, signing an 18-month professional contract in February 2008, before being promoted to the first team in March 2008. Swindon manager Maurice Malpas commented that he would like to see Morrison and fellow youth player Ben Joyce gain first team experience, and Morrison made his professional debut on 26 April 2008 against Gillingham at the age of seventeen, coming on as a first-half substitute for Jerel Ifil during a 1–1 draw. He made his first start for Swindon on the final day of the season, 3 May 2008, in a 2–1 victory over Millwall."]}, {"page": "2009–10 Torquay United F.C. season", "response": ["|Ben Joyce", "|Ben Joyce", "|Ben Joyce"]}]}}