{"wiki_id": "http://www.wikidata.org/entity/Q4885554", "itemLabel": "Ben Drinkwater", "itemDescription": "Motor-cycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Drinkwater", "wikipedia_page": {"main": "Ben Drinkwater (Reuben Thomas Drinkwater, 13 February 1910 – 9 June 1949) born in Rochdale, Lancashire, England, was a railway signalman and motorcycle racer who competed in the Isle of Man TT races and the Manx Grand Prix.\nAfter riding in the 1946 Manx Grand Prix, the first post-war event on the Snaefell Mountain Course, Ben Drinkwater returned to race in the 1947 Isle of Man TT, finishing in third place in the controversial 1947 250 cc Lightweight TT race won by Manliff Barrington.While competing in the 1949 350cc Junior TT race, the first ever race of the new FIM World Championship, Drinkwater collided with a bank trying to avoid a fellow competitor near Cronk Bane farm, close to the 11th milestone marker post, and was killed. The distinctive S-bend corner on the Mountain Course near to the accident location was renamed \"Drinkwater's Bend\" or the 11th Milestone.", "link_mentions": [{"page": "1949 Isle of Man TT", "response": ["British 350 cc rider Ben Drinkwater was killed in the Junior TT race at the 11th Milestone.Isle of Man Examiner page 4 17 June 1949"]}, {"page": "1948 Isle of Man TT", "response": ["|| Ben Drinkwater"]}, {"page": "1947 Isle of Man TT", "response": ["|| Ben Drinkwater"]}, {"page": "Manliffe Barrington", "response": ["|| Ben Drinkwater"]}, {"page": "11th Milestone, Isle of Man", "response": ["During the 1949 350 cc Junior TT race the popular amateur racer Ben Drinkwater crashed fatally at this point and the corner became known as Drinkwater's Bend, although subsequently the name became partly disused.Daily Herald page 1 Tuesday 14 June 1949Motorcourse History of the Isle of Man Tourist Trophy Races pages 54 & 58 by Nick Harris (1990) First Edition Hazelton Publishing  Graficias Estella SA "]}, {"page": "List of Isle of Man TT Mountain Course fatalities", "response": ["|  Ben Drinkwater"]}, {"page": "Drinkwater", "response": ["*Ben Drinkwater (1910–1949), motor-cycle racer"]}, {"page": "Rider deaths in motorcycle racing", "response": ["Listed are fatalities of riders in the World Grand Prix Motorcycle Racing Championship races since its foundation in 1949. In total, 104 riders have died from incidents that occurred at a Grand Prix motorcycle racing event, with Ben Drinkwater being the first in 1949. Three riders died in the 1940s; twenty-nine in the 1950s; twenty-seven in the 1960s; twenty-four in the 1970s; fourteen in the 1980s; two in the 1990s; one in the 2000s; three in the 2010s; and one in the 2020s. The most recent fatal accident occurred in May 2021 when Jason Dupasquier was killed after a crash during qualifying at the Italian Grand Prix, while the most recent fatal accident to occur in the 500cc/MotoGP class happened in October 2011, when Marco Simoncelli was killed after he was struck by Valentino Rossi and Colin Edwards during the Malaysian Grand Prix."]}, {"page": "List of named corners of the Snaefell Mountain Course", "response": ["| A distinctive S-bend, also known as \"Drinkwater's Bend\", named after Ben Drinkwater who crashed fatally at this point during the 1949 350 cc Junior TT Race."]}]}}