{"wiki_id": "http://www.wikidata.org/entity/Q48816785", "itemLabel": "Sarah Robertson", "itemDescription": "British field hockey player (1993-)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Robertson_(field_hockey)", "wikipedia_page": {"main": "Sarah Robertson  (born 27 September 1993) is a Scottish international field hockey player who plays as a midfielder or forward for Scotland and Great Britain.She plays club hockey in the Women's England Hockey League Premier Division for Hampstead & Westminster. \nRobertson has also played club hockey for Edinburgh University Women's Hockey Club, KHC Dragons in Belgium and Holcombe. \nShe made her senior international debut for Scotland in 2012 and her international debut for Great Britain in 2015.She represented Scotland at the 2014 Commonwealth Games and 2018 Commonwealth Games.", "link_mentions": [{"page": "List of Olympic medalists in field hockey", "response": ["|Giselle AnsleyGrace BalsdonFiona CracklesMaddie HinchSarah JonesHannah MartinShona McCallinLily OwsleyHollie Pearne-WebbIsabelle PetterEllie RayerSarah RobertsonAnna TomanSusannah TownsendLaura UnsworthLeah Wilkinson"]}, {"page": "Scottish Olympic medallists", "response": ["|  || Sarah Robertson || Field hockey || Women's tournament"]}, {"page": "Hampstead & Westminster Hockey Club", "response": ["* Sarah Robertson"]}, {"page": "Field hockey at the 2020 Summer Olympics", "response": ["|Giselle AnsleyGrace BalsdonFiona CracklesMaddie HinchSarah JonesHannah MartinShona McCallinLily OwsleyHollie Pearne-WebbIsabelle PetterEllie RayerSarah RobertsonAnna TomanSusannah TownsendLaura UnsworthLeah Wilkinson"]}, {"page": "Sarah Robertson (painter)", "response": ["alt=Oil painting by Sarah Robertson, depicting a group of people of different ages seated outdoors in a circle, on chairs and on the grass|thumb|Le Repos, c. 1926. Oil on canvas. In the permanent collection of the National Gallery of Canada.During her last few years at the Art Association, Robertson joined former and current students, and fellow artists, along with her teacher Randolph Hewton, in the Beaver Hall Group. A. Y. Jackson was the president of the group named after the Montreal street, Beaver Hall Hill. Robertson became close friends with Prudence Heward. Both painters were dedicated to their art and often painted together. Robertson's work was shown in a solo exhibition at the National Gallery of Canada in 1951. Robertson also exhibited in the United States, in group exhibitions at the Yale University Art Gallery in 1944, the Museu Nacional de Belas Artes in Rio de Janeiro, and the Riverside Museum in New York.Alan Klinkhoff Gallery: Sarah Robertson (By Barbara Meadowcroft)- Retrieved 2017-11-26", "alt=Oil painting by Sarah Robertson, depicting a man and woman in a farm field|thumb|Joseph and Marie-Louise, c. 1930. Oil on canvas. In the permanent collection of the National Gallery of Canada.", "The Beaver Hall Group was a Montreal-based group of Canadian painters who met in late 1910 while studying art at a school run by the Art Association of Montreal. Nora Collyer, Emily Coonan, Prudence Heward, Mabel Lockerby, Mabel May, Kathleen Morris, Lilias Torrance Newton, Sarah Robertson, Anne Savage and Ethel Seath were part of this group, sometimes known the Beaver Hall Hill Group or Beaver Hall Women. This association of nineteen Montreal artists, eight of whom were women, had been committed to developing distinctive artistic visions while acknowledging the influence of the Group of Seven, and French modernism. The Beaver Hall artists held their annual exhibition at their studios on Beaver Hall Hill. By the end of 1921, the Beaver Hall group ran into serious financial difficulties which necessitated relinquishing their studios. The men went their own way, but most of the women remained in close touch with each other."]}, {"page": "Holcombe Hockey Club", "response": ["* Sarah Robertson"]}, {"page": "Scotland at the 2018 Commonwealth Games", "response": ["*Sarah Robertson"]}, {"page": "List of 2020 Summer Olympics medal winners", "response": ["|Giselle AnsleyGrace BalsdonFiona CracklesMaddie HinchSarah JonesHannah MartinShona McCallinLily OwsleyHollie WebbIsabelle PetterEllie RayerSarah RobertsonAnna TomanSusannah TownsendLaura UnsworthLeah Wilkinson"]}]}}