{"wiki_id": "http://www.wikidata.org/entity/Q4885787", "itemLabel": "Ben Harding", "itemDescription": "Footballer (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Harding", "wikipedia_page": {"main": "Benjamin Scott Harding (born 6 September 1984) is an English professional footballer who plays for Truro City as a midfielder.", "link_mentions": [{"page": "Northampton Town F.C.", "response": ["David Cardoza moved quickly and Gary Johnson was unveiled as the new manager on 4 March 2011. However, things didn't go well under Gary Johnson: the club slid further down the table in League 2 and only just avoided relegation at the end of the 2010–11 season. The beginning of the 2011–12 season saw no improvement for the Cobblers and Gary Johnson left the club on 14 November 2011 by mutual consent. In November 2011, Northampton appointed ex-Watford manager Aidy Boothroyd as their new manager. After drafting in players such as Ben Harding, Luke Guttridge and Clarke Carlisle, Boothroyd managed to keep Northampton in the league and in the summer set about transforming the club into a club with promotion ambitions. On 18 May 2013, Northampton reached the League 2 play-off final, losing 3–0 to Bradford City at Wembley Stadium."]}, {"page": "Dean Holdsworth", "response": ["His team went unbeaten throughout March to virtually ensure the club's survival in the Football League. The upturn in form prompted speculation that the team could mount a charge for the play-offs. Though the club could only draw in their final game of the month at home to Accrington Stanley, Aldershot were left only seven points behind seventh placed Rotherham United. March also saw defender Jamie Vincent released from the club after not featuring in Holdsworth's first team plans, as well as a first team opportunity for youth team winger Adam Mekki. The \"Shots\" continued their unbeaten run into the first half of April, before defeat finally came at home to Burton Albion. At the end of the campaign Aldershot posted a comfortable mid-table finish, and Holdsworth handed out contracts to young players Adam Mekki, Doug Bergqvist and Henrik Breimyr. He also released nine players in Ben Harding, John Halls, Marvin Morgan, Damian Spencer, Tim Sills, Mikhael Jaimez-Ruiz, Wade Small, Clayton Fortune, and Jack Randall."]}, {"page": "Anthony Charles", "response": ["Charles was loaned to Aldershot Town for the end of the 2006–07 season, his second spell with the club and made the deal permanent after being released by Barnet. He was a championship winning defender in the 2007–08 season, and in recognition of this feat he was named in the Conference Premier team of the year along with Aldershot's Nikki Bull, Ben Harding, Lewis Chalmers and John Grant. At the end of the 2007–08 season, Charles signed a new two-year contract. Charles was a regular starter for Aldershot Town, in their first season back in the Football League and he was rewarded with a double award by winning the Supporters Club Player of the Season Award and Players Player Award. In June 2010, Charles signed a new one-year contract with Aldershot Town."]}, {"page": "2009–10 Aldershot Town F.C. season", "response": ["| Ben Harding"]}, {"page": "2010–11 Aldershot Town F.C. season", "response": ["September: Aldershot continued their early unbeaten run with a third consecutive 1–1 draw at home to Northampton, though the Shots needed a Ben Harding volley in the 5th minute of injury time to salvage a point. The next game - away to promotion-chasing Port Vale - promised to be a tough test, and this was proved right as the club suffered its first loss of the season, Gary Roberts scoring the only goal of the game. On 16 September the management brought in winger Marlon Jackson on loan from Bristol City, a player who assistant manager Gary Owers believed would help the team in the attacking third. Wycombe were the next visitors to the Recreation Ground, which meant a return for former Shots' boss Gary Waddock, who led the club to the Football Conference championship in the 2007–08 season. The match failed to live up to expectations, ending in a dull goalless draw. This fifth low-scoring draw of the season encouraged fears that the side were not good enough up front, and were not converting the few chances being presented to them. The squad responded by taking a 2–0 lead away to Stockport in their next game, only to throw it away in the final minutes to draw yet again. A win did come before the end of the month, however, Morgan again netting in the final ten minutes to snatch all three points away to Torquay.", "|align=\"left\"|8||align=\"left\"|MF||align=\"left\"| Ben Harding"]}, {"page": "2011–12 Wycombe Wanderers F.C. season", "response": ["| Ben Harding", "| Ben Harding"]}, {"page": "2011–12 Aldershot Town F.C. season", "response": ["| Ben Harding"]}, {"page": "2011–12 Northampton Town F.C. season", "response": ["| Ben Harding", "| 27 || CM || style=\"text-align:left;\" |  Ben Harding", "| Ben Harding"]}, {"page": "2012–13 Northampton Town F.C. season", "response": ["| 8 || CM || style=\"text-align:left;\" |  Ben Harding"]}, {"page": "Harding (surname)", "response": ["*Ben Harding (born 1984), English footballer", "*Ben Harding (guitarist)"]}, {"page": "2013 Football League Two play-off Final", "response": ["|CM ||8||Ben Harding"]}, {"page": "2013–14 Torquay United F.C. season", "response": ["|8||  || MF || Ben Harding || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0", "|Ben Harding"]}, {"page": "2007–08 Milton Keynes Dons F.C. season", "response": ["| rowspan=\"2\" | 1 July 2007 || MF ||  Ben Harding ||  colspan=\"2\" | Released || "]}, {"page": "AFC Wimbledon–Milton Keynes Dons F.C. rivalry", "response": ["! scope=\"row\"| Ben Harding"]}, {"page": "2006–07 Milton Keynes Dons F.C. season", "response": ["| 31 August 2006 || MF ||  Ben Harding || Aldershot || January 2007 || ", "| 3 January 2007 || MF ||  Ben Harding || Grays Athletic || End of season || "]}]}}