{"wiki_id": "http://www.wikidata.org/entity/Q4885614", "itemLabel": "Ben Everson", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Everson", "wikipedia_page": {"main": "Benjamin James Everson (born 11 February 1987) is an English footballer who plays for Dandenong City as a striker. He previously played for Norton & Stockton Ancients, Shildon, Guisborough Town, El Paso Patriots, Bradenton Academics, West Texas United Sockers, Tindastóll, Breiðablik, York City, Gateshead, AFC United and KA Akureyri.", "link_mentions": [{"page": "Everson", "response": ["* Ben Everson (born 1987), English footballer"]}, {"page": "El Paso Patriots", "response": ["*  Ben Everson"]}, {"page": "IMG Academy Bradenton", "response": ["*  Ben Everson"]}, {"page": "Middlesbrough Futsal Club", "response": ["*  Ben Everson, English footballer", "|align=\"left\"|Ben Everson"]}, {"page": "Midland-Odessa Sockers FC", "response": ["*  Ben Everson"]}, {"page": "All-time El Paso Patriots roster", "response": ["*  Ben Everson"]}, {"page": "2012 1. deild karla", "response": ["|Ben Everson"]}, {"page": "2012–13 York City F.C. season", "response": ["Jonathan Smith made a permanent move to Luton for a fee of £50,000 shortly after the transfer window opened. York won 3–0 in their New Year's Day home fixture against Burton, with Walker, McLaughlin and Blair scoring. Carlisle completed a permanent transfer to Northampton after the conclusion of his loan, while Henderson signed for Gateshead permanently after an agreement was reached over the remainder of his York contract. York were beaten 2–1 at home to Exeter, with a Rodman own goal giving the visitors the lead in the 14th minute. Potts equalised for York five minutes later, before Exeter scored the winning goal on 53 minutes through Jimmy Keohane. Rodman's loan from Aldershot was extended until the end of the season. Walker scored in the 84th minute to secure York a 1–1 draw away to Cheltenham, who had taken the lead in the 67th minute through Shaun Harrad. Striker Ben Everson, who last played for Breiðablik in the Úrvalsdeild karla, was signed on a contract for the rest of the season. Platt was loaned out for the second time in a season, joining Conference North club FC Halifax Town for one month. Everson made his debut as a 71st-minute substitute in a 0–0 draw at home to Aldershot.", "|Ben Everson", "|Ben Everson", "|Ben Everson", "!scope=row|Ben Everson"]}, {"page": "List of IMG Academy alumni", "response": ["* Ben Everson"]}, {"page": "2013 1. deild karla", "response": ["|Ben Everson"]}, {"page": "2013–14 York City F.C. season", "response": ["Following the previous season's conclusion Lee Bullock, Jon Challinor, Chris Doig, Ben Everson, Scott Kerr, David McDaid, Paddy McLaughlin, Michael Potts, Jamie Reed and Jason Walker were released by York, while Matty Blair departed for Fleetwood Town. David McGurk, Lanre Oyebanjo, Daniel Parslow, Tom Platt and Chris Smith signed new contracts with the club. New players signed ahead of the start of the season were goalkeeper Chris Kettings on a season-long loan from Blackpool, defender Ben Davies on loan from Preston North End, midfielders Craig Clay from Chesterfield and Lewis Montrose from Gillingham, winger Sander Puri from St Mirren, and strikers Ryan Bowman from Hereford United, Richard Cresswell from Sheffield United, Wes Fletcher from Burnley and Ryan Jarvis from Torquay United. Defender Mike Atkinson and striker Chris Dickinson entered the first-team squad from the youth team after agreeing professional contracts."]}, {"page": "Vestri (football club)", "response": ["| 2013 ||align=\"left\"| Ben Everson ||1. deild|| 12 || 10 || 2"]}, {"page": "List of foreign Úrvalsdeild players", "response": ["*Ben Everson – Breiðablik – 2012"]}, {"page": "Benjamin James Everson", "response": ["#REDIRECT Ben Everson"]}]}}