{"wiki_id": "http://www.wikidata.org/entity/Q4885680", "itemLabel": "Ben Freeman", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Freeman", "wikipedia_page": {"main": "Benedict Freeman (born 8 April 1980) is an English actor, known for portraying the role of Scott Windsor in the ITV soap opera Emmerdale. After leaving Emmerdale in 2007, he embarked on a career in musical theatre, and has since played various roles in the West End. In 2021, he joined the cast of the BBC soap opera EastEnders as Caleb Malone.", "link_mentions": [{"page": "Legally Blonde", "response": ["Legally Blonde also had a three-year run at the Savoy Theatre in London's West End, starring Sheridan Smith, Susan McFadden, and Carley Stenson as Elle, and Duncan James, Richard Fleeshman, Simon Thomas, and Ben Freeman as Warner. During its run, the cast also included Alex Gaumond, Denise Van Outen, and Lee Mead."]}, {"page": "Wicked (musical)", "response": ["* Fiyero: Alistair Brammer, Mark Evans, Ben Freeman, Lee Mead, Oliver Tompsett, Matt Willis, David Witts"]}, {"page": "Zoe Tate", "response": ["sex with Scott Windsor (Ben Freeman) but has no memory of the event."]}, {"page": "Viv Hope", "response": ["Viv arrives in Beckindale to view the post office with her husband, Vic (Alun Lewis), and their children, Scott (Toby Cockerell; Ben Freeman), Donna (Sophie Jeffery; Verity Rushworth) and Kelly (Adele Silva).  She finds it hard to adapt to country life and does not realize how much her children are affected by the plane crash in December 1993.  She intended to sue the Sugdens after Donna has an accident on their tractor and later supports Vic when he appears in court for assaulting looters. In June 1994, Reg Dawson (Niven Boyd), Viv's ex-husband and Scott's father, arrives in the village after being released from prison.  He later takes Viv and Shirley Turner (Rachel Davies) hostage during a siege at the post office. Reg tries to shoot Viv but kills Shirley instead when she throws herself in front of her in an attempt to protect her. Reg later dies after being shot by a police marksman and Viv is rescued, unharmed. Reg leaves her £30,000 in his will, on condition that she gets a divorce from Vic. Viv, however, declines and stays with Vic."]}, {"page": "Kelly Windsor", "response": ["In 1998, Kelly realises that she has romantic feelings for her stepbrother, Scott Windsor (Ben Freeman). After sleeping together, Kelly returns to Roy and they get engaged. Whilst planning their wedding, Kelly continues to see Scott but refuses to leave Roy so Scott exposes their affair but Kelly denies it. After they get married, Kelly and Roy have financial problems and become cleaners. When Kelly \"borrows\" jewellery from a client, Miss Curtis, and stages a dinner party at her house, the police are called. Wanting to protect Kelly, Roy accepts responsibility and is imprisoned. Whilst he is away, Kelly sleeps with Scott again after meeting him at a hotel and they admit their love for each other, sending Kelly into a deep depression. After writing letters to her family and admitting to the affair on tape, Kelly attempts suicide. She is saved but loses the baby she was carrying, unsure if the father was Scott or Roy. Scott burns the letters but Kelly confesses to Roy and decides to start a new life in London, bankrolled by Chris Tate. Although she and Roy have a brief reconciliation, they are unable to make their marriage work and he leaves for Ibiza without her. Feeling rejected again, Kelly tries seducing Viv's new fiancé, Bob Hope (Tony Audenshaw), but he tells Viv and this leads to a vicious fight between Viv and Kelly, also revealing Scott and Kelly's affair. With no friends or family willing to talk to her, Kelly leaves for London, with only her younger sister, Donna (now played by Verity Rushworth), sad to see her go.", "Silva couldn’t wait to go back to the show,\" Silva told The Sun. [...] I've done quite a lot since leaving but it was difficult at first because I was a bit typecast. \"I look quite young and everyone thought of me as being Kelly the schoolgirl. I struggled to get away from the little girl image. I've grown up a lot, though, and I'm looking forward to going back and showing the cast and crew that I'm now a sexy woman. I'm hoping Kelly will be really badly behaved. It would be fun if she had a few flings, too. I want to really show them what I'm made of. It'll be great to catch up with the actors there too - I can't wait to see them again.\" [...]. When the show's producers approached Silva, she said she'd only come back if they would promise not to make her character nice,\" Silva told the Sunday Mirror Kelly is still nasty as ever Kelly’s return storyline saw her at the bedside of her stepbrother Scott (Ben Freeman) who had been injured by Zoe Tate (Leah Bracknell)."]}, {"page": "Scott Windsor", "response": ["From 1993 to 1996, Scott was played by Toby Cockerell. In 1996, Scott left the village to join the army and when he returned in 1998, Ben Freeman took over the role and played Scott until early 2007.", "In 1993 series producer Nicholas Prosser introduced Scott as part of the new Windsor family. Among them were Scott's mother, Viv Windsor (Deena Payne), Viv's husband, Vic Windsor (Alun Lewis), Vic's daughter and Scott's adoptive sister, Kelly (Adele Silva), and Scott and Kelly's half-sister, Donna Windsor (Sophie Jeffery). In 1998 producer Mervyn Watson recast the role to Ben Freeman.", "In early 2007, Scott Windsor was written out due to the court case of Freeman's rape allegations. Freeman was expected to return but it had not been confirmed if he would return to the show, he had been absent since January 2007. On 16 December 2007 Digital Spy confirmed that Ben Freeman had been axed from Emmerdale. However, the ITV website claims that Freeman had simply not renewed his contract, for practical reasons. His contract was due to expire at the end of 2007. In October 2008, Freeman was cleared of rape charges, and reports surfaced that he might return to the role of Scott. However in June 2009 Freeman announced he would not be returning to the soap."]}, {"page": "Robert Sugden", "response": ["After leaving school, Robert gets a job working as a mechanic at Scott Windsor's (Ben Freeman) garage. After having sex with her in the back of his car, Robert starts dating Donna, who is Scott's half-sister. He also starts secretly dating Elaine Marsden (Samantha McCarthy). However, Donna finds out about Robert's cheating and dumps him. Robert continues his romance with Elaine, but in September 2003, he and Elaine are involved a car accident while Robert is driving. Panicking, Robert flees the scene, leaving Elaine unconscious in the car. Robert manages to lie his way out of trouble, as Elaine has no memory of how the accident happened. She later realizes the truth when she sees bruising from the seat belt across his chest, which suggests that Robert was driving, not her as Robert told everyone. In December 2003, Elaine and her family leave the village. Robert and Donna reconcile that month. Despite this, Robert begins an affair with Katie, now Andy's fiancée. Robert and Katie are caught by Andy's half-brother, Daz Eden (Luke Tittensor), in January 2004 when he sees them kissing in the garage. Katie threatens Daz, telling him he will be put into care if he says anything. Daz tells Andy but Katie convinces him that Daz is lying and is too much for them to cope with so he is returned to foster care. Victoria (now Hannah Midgley) also catches them together. Robert swears her to secrecy and Katie threatens her so she becomes too scared to talk and uses a puppet to speak through instead."]}, {"page": "List of former EastEnders characters", "response": ["| Caleb Malone || Ben Freeman || 2021"]}, {"page": "Chloe Atkinson", "response": ["Chloe begins a relationship with Scott Windsor (Ben Freeman). Off-screen Nuttall and Freeman were in a relationship. The actress told Ruki Sayid from the Daily Mirror that when they filmed Chloe and Scott's first kiss, the director guessed that they were romantically involved. One storyline depicts Chloe starting an affair with Scott's best friend Syd Woolfe (Nathan Gladwell).  Chloe becomes annoyed with Scott's illegal car scam business. Syd then orchestrates the affair after he lodges in Chloe and Scott's home. When Scott discovers their infidelity he rages at Chloe. But Gladwell told Steve Hendry from the Sunday Mail that \"There's no doubt he blames Syd\". Nuttall viewed it as her first notable storyline. She was also pleased to portray \"a bit of naughtiness\" that saw Chloe drop her \"Miss Goody-Two-Shoes\" image. The actress found intimate bedroom scenes with Gladwell challenging to film because of the crew and her romance with Freeman. The actress revealed to an Inside Soap reporter that it was her \"magic moment\" because she found it \"fun\". She also liked that there were \"lots of argument scenes\" and the chance to slap Freeman."]}, {"page": "Amy Nuttall", "response": ["Nuttall dated fellow Emmerdale cast member Ben Freeman for four years.Ellis, James. (27 October 2009) Amy Nuttall | Metro News. Metro.co.uk. Retrieved on 11 February 2013. She married long-term boyfriend, the actor Andrew Buchan, on 8 September 2012.Amy Nuttall joins Downton Abbey and reveals she is getting married to long-term boyfriend Andrew Buchan. mirror.co.uk, 12 September 2011 Their first child was born in 2015."]}, {"page": "Karl Davies", "response": ["As one of the young male characters in the show he was invited to take part in a soap calendar for Now Magazine in 2004 alongside fellow actors Ben Freeman and Kelvin Fletcher. The character's final romantic storyline involved an affair with the married Sadie King, played by Patsy Kensit. This storyline received media attention when Kensit reportedly objected to a relationship with a younger actor. Kensit however clarified the reasons for this in an interview with Leeds Today News stating \"When I first heard about the storyline, I said 'but he looks like one of James's friends, so boyish and young'. But Karl is so adorable and we had a lot of fun filming those scenes\". The brotherly feud which dominated much of Davies' time on the show was used by producers as the vehicle for a high-profile attempt to compete with rival soap EastEnders in the television ratings war and to secure Emmerdale's place as the second most popular soap opera in the UK. The chosen storyline involved Andy's attempts to kill Robert which led to his father, Jack Sugden(Clive Hornby) being shot. The story was to prove a success securing viewing figures of 7.6 million compared with 6.4 million for EastEnders. This was the first time Emmerdale has secured such a ratings victory."]}, {"page": "Chris Tate", "response": ["In 2003, Chris is shocked when Zoe gets pregnant and gives birth to a baby girl - whom she names Jean (Megan Pearson) in honor and Chris' late mother. He is later appalled to learn that Jean's father is wayward bad boy Scott Windsor (Ben Freeman) and furiously accuses him of raping Zoe due to her being a lesbian as well as the pair having a fling whilst she was undergoing issues with her condition. Wanting revenge, Chris begins a hate campaign against Scott. This involves Chris evicting Scott and his friends from his house, having his garage vandalized, increasing Scott's rent, and arranging for Scott's garage to be torched in an arson attack. Later on, he bribes a prostitute named Yolanda Howie (Charlotte Faber-Scott) to date Scott and then implicate him under false rape charges. This works successfully until Zoe eventually learns the extent of Chris' vendetta and, also discovering Scott never raped anyone to begin with, pays Yolanda to drop the charges."]}, {"page": "Soapstar Superstar", "response": ["* Lopez was a replacement for Ben Freeman, who was forced to deal with a court case abroad at the time."]}, {"page": "Debbie Dingle", "response": ["She was introduced as the foster child of Paddy Kirk (Dominic Brunt) and Emily Kirk (Kate McGregor) before being revealed as the daughter of Charity Dingle (Emma Atkins) and Cain Dingle (Jeff Hordley). She has featured in many storylines on Emmerdale including  her relationships with Andy Sugden (Kelvin Fletcher), which lead to her pregnancy at 15, Jasmine Thomas (Jenna Louise Coleman) and Scott Windsor (Ben Freeman), her daughter Sarah being diagnosed with a blood disorder, her disastrous relationship with Cameron Murray (Carl King's, Gennie Walker's and Alex Moss's real killer) (Dominic Power), which sparked the 2013 week of episodes known as \"The Woolpack Siege,\"; a relationship with Pete (Anthony Quinlan), who she later marries and her affair with Ross (Michael Parr), a relationship with Tom Waterhouse later revealed as Joe Tate (Ned Porteous) and being conned by him but later forgiving him and getting back together, accidentally having Ross as the victim of an acid attack, learning Sarah suffers from heart failure and needs a transplant, and dealing with the false revelation that Cain killed Joe (although it was later revealed that he is alive).", "Emily returns Sarah to Andy and Debbie tells Andy that she does not want to be a mother. Lisa Dingle (Jane Cox) deliberately asks Debbie to visit when Sarah is there, hoping to create a mother-daughter relationship. She's successful and Debbie asks Andy for access but he refuses. Debbie starts dating Scott Windsor (Ben Freeman) but that ends when Scott leaves. Debbie gets Eli Dingle (Joe Gilgun) to pose as Scott so she can get a bank loan. Debbie, Chas Dingle (Lucy Pargeter) and Lexi King (Sally Oliver) decide to stage a jewellery scam at Home Farm so they can steal a valuable necklace and share the proceeds. Debbie wants more money so she gets Eric Pollard (Chris Chittell) to help scam Chas and Lexi but Lexi discovers the truth and the pair fight in the street, accidentally dropping the necklace down a drain."]}, {"page": "Denise Fox", "response": ["Denise and Kush's relationship continues and she supports him through the death of his brother Shakil Kazemi (Shaheen Jafargholi). They become engaged, however Denise is unaware that Kush has had a one-night stand with a waitress, Talia. After growing apart, Denise decides to end their relationship. In March 2019, Denise and Kim set up a beauty salon, Fox & Hair, funded by Patrick, and they employ Lola Pearce (Danielle Harold) and Mitch Baker (Roger Griffiths). Denise and Kim clash over their vision for the business and Kim begins a feud with employee Chantelle Atkins (Jessica Plummer) who Denise grows close to. Soon after, she starts dating Jack Branning (Scott Maslen). In September 2019, Denise is attacked by Hunter Owen (Charlie Winter) after he escapes from prison. When Patrick returns with his new wife Sheree Trueman (Suzette Llewellyn), Denise grows suspicious of her. She suspects that Sheree is having an affair and confronts her, leading to her departure. Denise later learns that Sheree had been contacting her son Isaac Baptiste (Stevie Basula). In September 2020, Denise learns through Callum Highway (Tony Clay) that her son Raymond has been involved in a car accident, which has killed his adoptive parents Jonah and Lydia. She is reunited with Raymond and meets his adoptive grandmother Ellie Nixon (Mica Paris). Denise continues to visit Raymond in hospital, disguising as a friend of his adoptive mother Lydia. She keeps this a secret from Jack and refuses to tell Phil, but they both find out and Phil also starts visiting Raymond, despite Denise's attempts to stop him. Ellie discovers the truth and forbids them from seeing Raymond. Phil discovers that Ellie is a gangster and he persuades Denise into seeking custody of Raymond, but she only agrees to do so on the condition that Phil has no involvement in his life. This strains her relationship with Jack and they briefly separate. After Phil blackmails Ellie, she relinquishes custody of Raymond and he moves in with Denise. Denise initially struggles to bond with Raymond but is supported by Jack. She decides to take Raymond to church on Christmas Day 2020 and is reunited with Chelsea and Lucas, who has recently been released from prison. Denise is upset that Chelsea has been secretly contacting Lucas, and she remains fearful that Lucas is back to settle a few scores. When she learns that Chelsea is taking Lucas on holiday, she is devastated, and later goes to confront him when he upsets Chelsea by refusing to follow  her. He lashes out at Denise and they disappear, leading to a search for her after it is assumed that Lucas has hurt her when they discover blood in his flat. It is later revealed that Chelsea's ex-fiancé Caleb Malone (Ben Freeman) has kidnapped Denise, and Chelsea later reveals that she owes Caleb money and is using Lucas to smuggle drugs for him. Denise reluctantly agrees to help Chelsea plant drugs on Lucas, believing that he owes Chelsea. Lucas discovers the truth and agrees to help, although he is later caught and sent back to prison. Denise and Jack become engaged. "]}, {"page": "Chelsea Fox", "response": ["In December 2020, Denise is surprised to see Chelsea (now played by Zaraah Abrahams) with her father Lucas, who has recently been released from prison. Chelsea later returns to Albert Square, where she reveals to Denise that she has been in communication with Lucas for months and is upset with Denise for not telling her about her son Raymond. After an argument with Denise, Chelsea leaves with Lucas. Patrick, in cooperation with Raymond's father Phil Mitchell (Steve McFadden), meets Chelsea at The Queen Victoria public house to find out about Lucas' whereabouts. Later that day, Lucas is attacked in front of Chelsea after they leave a restaurant. Phil is blamed for Lucas's attack, but it is Chelsea's ex-boyfriend Caleb Malone (Ben Freeman) who arranged Lucas's attack. Chelsea is indebted to Caleb after fleecing him and she is planning on using Lucas to smuggle drugs for Caleb. Chelsea arranges to travel to Spain with Lucas, planning to use him to smuggle drugs, but ultimately fails. Denise confronts Lucas about upsetting Chelsea, and they both go missing. Chelsea finds blood in Lucas's flat, and believes that Lucas has hurt Denise and kidnapped her, but Chelsea later discovers that Caleb is responsible. Denise discovers the truth and reluctantly agrees to help Chelsea frame Lucas. They try to convince Lucas to follow Chelsea to Ibiza, but he later discovers their intentions. Lucas vows to kill Caleb but Chelsea threatens to abandon Lucas, having not forgiving him for faking Denise's death, and warns him that Caleb will kill her. When Denise's boyfriend and Chelsea's ex-lover Jack discovers Chelsea's plan, she attempts to seduce him to stop him from reporting her to the police. Lucas is ashamed of Chelsea's behavior, and refuses to do the job unless she follows him to church, where he tells Chelsea to go to the police and face imprisonment. After a heart to heart, Lucas agrees to do the job, but changes his mind leaving Chelsea alone. He is later arrested after being caught, and Chelsea later tips the police off when Caleb asks her to meet him, and he is arrested."]}, {"page": "Terry Woods (Emmerdale)", "response": ["Now single, Terry takes up ballroom dancing with Viv Windsor (Deena Payne) wife of his best friend, Vic (Alun Lewis). After a while, they begin an affair and when Vic finds out, Viv and their daughter, Donna (Sophie Jeffrey), move into the Woolpack with Terry. Terry and Viv's relationship does not last and she and Donna go back to live with Vic and his daughter Kelly. 150px|thumb|left|Terry Woods in 1996. Terry's job at the Woolpack comes to a violent end in 1998 when he sleeps with his boss, Alan's, granddaughter, Tricia Stokes, only to discover she is also sleeping with Scott Windsor (Ben Freeman). When he exposes Tricia's lack of morals in front of the entire village at Kelly Windsor's (Adele Silva) 18th birthday party in the village hall, Alan punches Terry and fires him."]}, {"page": "Power Inquiry", "response": ["*Ben Freeman"]}, {"page": "Freeman (surname)", "response": ["* Ben Freeman, British actor"]}, {"page": "Len Reynolds", "response": ["Len develops feelings for local pensioner Edna Birch (Shirley Stelfox) but she does not reciprocate. However, he found love again with flamboyant newcomer Pearl Ladderbanks (Meg Johnson). Enchanted by Pearl’s sunny personality, Len invites her to move in with him and Danny. Pearl, however, is hiding a secret. Her son, Frank Bernard Hartbourne (Rob Parry), whom she had said was a financial advisor, has been paroled after serving a sentence for rape. When Len discovers the truth, he is horrified, but realises what Pearl had been through and agrees to stand by her. Problems escalate when Frank's arrival is announced in the Hotten Courrier and the villagers are irate and turn their frustrations on and Len and Pearl. Only vicar Ashley Thomas (John Middleton) and Edna stood by them. After Frank is savagely beaten by Scott Windsor (Ben Freeman), he moves into a bail hostel in Leeds. Devastated at being treated so cruelly by their neighbours, the couple decided to leave Emmerdale for a few weeks and contemplated moving to Cheshire nearer to Sean and Tara. Len and Pearl eventually return and rebuild bridges with their neighbours."]}, {"page": "Danny Daggert", "response": ["Danny has a brief dalliance with new Jo Stiles (Roxanne Pallett), but finds that her lifestyle was a bit too wild for him and they remaine friends. Jo helps Danny when he realizes there was a woman for him right under his nose - Single mum Dawn Woods (Julia Mallam), who he had become good friends with and there is a spark. The relationship is happy for a while but with Dawn's ex-boyfriend Scott Windsor (Ben Freeman) receiving parole, things are difficult. Eventually, Scott and Danny come to blows and Dawn decides she is better off with neither man. "]}, {"page": "Dawn Woods", "response": ["Dawn then begins a relationship with Scott Windsor (Ben Freeman). They start seeing each other just before she divorces Terry and the only person Dawn tells is Bob, who disapproves due to him being married to Scott's mother Viv Hope (Deena Payne). Scott and Dawn move in together but Dawn is devastated and angry when Scott leaves her to flee to America with Zoe Tate (Leah Bracknell), the mother of his daughter, Jean Tate (Megan Pearson). Scott had kept it a secret from everyone and sends Dawn a letter in the post explaining that as she was his step-sister, and if their relationship went further, people would think it was weird, and he had \"convinced\" himself not to love her, and he was leaving with Zoe to be with his daughter in Home Farm, not wanting stay with her and TJ while Zoe left with Jean. Dawn then goes to Spain to stay with her mother because she could not bear to see Scott and Zoe. Dawn ignores Bob's telephone calls, unaware that he is contacting her to inform her that Scott was in critical condition in hospital after being injected with ketamine after attempting to rape Zoe. Viv's daughter Donna Windsor (Verity Rushworth) finally manages to get through to Bob in hospital, and he tells her about Dawn's letter from Scott. The letter was then discovered by Viv, and Dawn flies back from Spain just in time for Scott to wake up. Although Dawn initially forgives him, when Paddy Kirk (Dominic Brunt) drops out as a witness against Zoe at her trial, Dawn discovers that Scott had been blackmailing and threatening Paddy, and as a result Zoe is found not guilty of attempted murder. Scott then attacks Paddy and while Dawn and Marlon Dingle (Mark Charnock) try to break up the fight, he punches her by mistake. A shaken Dawn locks herself in her house with T.J and calls the police. Scott is arrested for assault, and he tries to claim he was provoked by Paddy but is shocked to discover that the assault charges were for hurting Dawn. Dawn has seen Scott's true colours, and finally realizes he is capable of what Zoe claimed he had done, and Dawn ends their relationship for good as she is scared he would rape her. While Scott was serves a prison sentence for the assault, Dawn dates Danny Daggert (Cleveland Campbell), but breaks up with him after she realizes she isn't ready to settle down. After his release, Scott takes revenge on Dawn for rejecting him by reporting her for benefit fraud. Dawn had been taking odd jobs to better support T.J and is officially charged and serves three weeks of a six-week prison sentence."]}, {"page": "Pearl Ladderbanks", "response": ["Frank Bernard stayed with Len and Pearl in the village but his arrival was announced in the local paper and the villagers turned against Pearl and Len, leaving only vicar Ashley Thomas (John Middleton) standing by them. Frank was beaten up by Scott Windsor (Ben Freeman) and Syd Woolfe after a misunderstanding involving Scott's sister, Donna (Verity Rushworth). Frank realised his presence was harming his mother and moved to Leeds. Devastated at being treated so shabbily, the couple decided also decided to move away but were persuaded to stay and rebuild their lives."]}, {"page": "Jo Stiles", "response": ["When Dawn's ex-boyfriend, Scott Windsor (Ben Freeman) tries to seduce Jo, she rejects him but Dawn suspects there is some thing going on. Jo is later evicted by Dawn's mother, Jean Hope"]}, {"page": "Celebrities Under Pressure", "response": ["*Show 6 - Ben Freeman, Lesley Joseph, Andrew Whyment"]}, {"page": "Jennifer Biddall", "response": ["In December 2009 Biddall and actor Ben Freeman were engaged; on 10 September 2010 they were married at The Manor House Hotel, Castle Combe where Biddall's former Hollyoaks castmate Zoe Lister (Zoe Carpenter) was her bridesmaid."]}, {"page": "Charity Dingle", "response": ["Charity begins an \"unlikely relationship\" with wheelchair-bound, local millionaire, Chris Tate (Peter Amory). Charity realises she likes Chris when she becomes involved with his businesses. Charity thinks he is sweet and they get on well. When Chris suspects Charity is cheating on him, her flirtatious habits do little to reassure him. Charity denies Chris's accusations that she is seeing somebody else. Atkins told Claire Brand of Inside Soap \"Charity has been trying to convince Chris that nothing is going on. She's been having blazing rows with him and saying 'How could you possibly accuse me?' She's making him feel really guilty about suspecting her and he ends up wallowing in self pity, thinking he's blown it with her.\" Atkins went on to say Charity is very clever and makes Chris do what she says, as opposed to the other way round, which Chris is used to. Charity flirts with many of the men in the village to make Chris jealous. Chris decides to trap Charity and invites all the major suspects – Marlon Dingle, Scott Windsor (Ben Freeman) and Rodney Blackstock (Patrick Mower) – to an important party Charity is helping to organise. Atkins said viewers would be surprised to find out who Charity is seeing behind Chris's back."]}, {"page": "1980 in the United Kingdom", "response": ["** Ben Freeman, actor"]}, {"page": "Eli Dingle", "response": ["Eli had several negative encounters with the law and the other villagers, including being wrongly arrested for Tom King's (Ken Farrington) murder after unknowingly stealing the murder weapon from Home Farm. There was some flirtation with Kelly Windsor (Adele Silva) and after aborting Jimmy King's (Nick Miles) baby, Kelly ended up drunkenly kissing Eli. This was caught on film by Debbie Dingle (Charley Webb) who used it to blackmail Kelly. After Jimmy dumped Kelly at the altar, Eli helped her leave town by stealing Debbie's car. Eli later began an on/off relationship with his cousin Debbie after agreeing to help her with some money-making schemes, including pretending to be Scott Windsor (Ben Freeman) in order for her to obtain a loan to buy his garage business."]}, {"page": "Nicola King", "response": ["Nicola undergoes a personality change and falls out with Emily but they reconcile. She seduces   Robert Sugden (Karl Davies) much to the annoyance of the village due to Robert's age. Nicola is bridesmaid when Emily marries Paddy Kirk (Dominic Brunt) in October 2002. Nicola frequently clashes with Viv Hope (Deena Payne), and local siren Chloe Atkinson (Amy Nuttall). She dumps Robert by allowing him to see her having sex with builder Syd Woolfe (Nathan Gladwell) in her living room. Nicola's relationship with Syd comes to a halt when she finds out he is also having an affair with Chloe who is dating  Scott Windsor (Ben Freeman).."]}, {"page": "Legally Blonde (musical)", "response": ["Susan McFadden replaced Sheridan Smith as Elle on January 10, 2011. McFadden was later replaced by Carley Stenson on July 11, 2011. Other notable replacements included Richard Fleeshman and Ben Freeman as Warner, Denise van Outen and Natalie Casey as Paulette, Lee Mead and Stephen Ashfield as Emmett, Carley Stenson as Margot, and Siobhan Dillon as Vivienne."]}, {"page": "List of former Emmerdale characters", "response": ["|rowspan=\"2\"|Scott Windsor || Ben Freeman || rowspan=\"2\"| 1993–1996, 1998–2007"]}, {"page": "Lucas Johnson", "response": ["Lucas sees one of the men who attacked him with Chelsea and confronts him, soon realising that Chelsea is trying to set him up for drug smuggling. Chelsea later tells Lucas she is taking him on a trip to Ibiza, but he warns her that he would be breaking his parole conditions if he left the country. However, determined to carry out her plan, Chelsea lies to Lucas and tells him she has told the police about their trip and that he has been cleared to go. However, on the day of the trip, Lucas fails to turn up for their taxi. Denise finds a devastated Chelsea crying and thinks that Lucas has let her down, so goes round to the flat to confront him. While Denise has a go at Lucas, he goes into a breakdown and lashes out at Denise. Jack and Chelsea later call round to the flat and find blood on the floor and Lucas and Denise missing. After calling the police, Jack finds Lucas walking around the square and chases after him, with Callum Highway (Tony Clay) in tow. Despite Callum's requests to have Lucas arrested, Jack kidnaps him and holds him hostage in the Arches. Lucas insists he has nothing to do with Denise's disappearance. Jack tries to beat Lucas up, but is restrained by Callum. While Callum and Jack argue, Lucas escapes. Denise is later found kidnapped by an unknown assailant, who is later revealed to be Caleb Malone (Ben Freeman), putting Lucas in the clear. Caleb later lets Denise go after Chelsea agrees to return the drugs she owes him. Chelsea is forced to tell Denise about her plan. Denise is furious with Chelsea but covers for her when Jack asks what happened. Denise later tells Chelsea she will get Lucas to come back and do the job. Denise meets Lucas and tells him to go away with Chelsea. Lucas, knowing Denise and Chelsea's true intentions, starts to question why he is trying to change. He later saves Raymond from been hit by a trailer. Denise and Chelsea are grateful. Lucas talks to Denise about Chelsea's plan to set him up. Denise tells him who really kidnapped her. Lucas vows to find Caleb and kill him and steals Chelsea's phone to track him down. Chelsea warns Lucas that if he hurts Caleb, she wants nothing more to do with him. She tells him that Caleb will kill her if he goes near him and tells him to stay away from Caleb and do the job if he wants her forgiveness but Chelsea makes it clear that she will always hate Lucas for what he did. Chelsea books the flight and tells Lucas the job will be in a couple of weeks. Lucas tries to make amends with Chelsea and makes dinner for them. When Denise later tells Jack about the job, Chelsea comes on to Jack in an unsuccessful bid to try and stop him reporting her. Lucas and Denise are disappointed to hear of their daughter's recent actions and confront her. Chelsea breaks down in tears and tells Lucas she regrets what she did. Lucas later sees Chelsea and Jack arguing. Chelsea gloats about how she could have gotten with Jack if she really wanted to, leaving Lucas disappointed with her actions."]}, {"page": "List of Grange Hill characters", "response": ["| Ben Freeman "]}, {"page": "Roy Glover", "response": ["The five-strong Glover family, consisting of parents Ned Glover (Johnny Leeze) and Jan Glover (Roberta Kerr), and their three children Dave Glover (Ian Kelsey), Linda Glover (Tonicha Jeronimo) and Roy were introduced in August 1994. In their fictional backstory, the Glovers came from the South, like the McAllisters and Windsors who were introduced in 1993, but they were a hardworking Yorkshire family. The Glovers initially live in a caravan on the Sugden's land, after being forced out of their old plot by developers. Roy is the youngest member of the family, and an Inside Soap columnist predicted he would make friends with fellow teen Scott Windsor (Ben Freeman) and get up to \"plenty of pranks\"."]}, {"page": "List of Emmerdale characters (2007)", "response": ["Since Bob and Viv's remarriage in 2006 they had both wanted a child together. However, plans changed when Bob's daughter Dawn Woods (Julia Mallam) died in a show home explosion in July 2006. On the day of Dawn's funeral, Viv collapses and was found by her daughter Donna Windsor (Verity Rushworth). At the hospital, doctors revealed that Viv was pregnant. News spread quickly as Donna tells her brother and Viv's son Scott Windsor (Ben Freeman) and her husband Marlon Dingle (Mark Charnock) and Scott tells Dawn's ex-husband Terry Woods (Billy Hartman). Both Terry and Scott told Bob while his ex-wife Jean Hope (Susan Penhaligon) with Terry and Dawn's son T.J. Woods (Connor Lee) was inside. In August 2006, Viv was ready to have an abortion when Bob, Jean, Scott and Donna stopped her."]}, {"page": "List of Emmerdale characters (2004)", "response": ["Martin is the investigating officer when Jack Sugden (Clive Hornby) is accidentally shot in the chest by his adoptive son, Andy (Kelvin Fletcher). He returns to the village when he invesitgates Scott Windsor (Ben Freeman) and Syd Woolfe's (Nathan Gladwell) savage beating of Pearl Ladderbanks' (Meg Johnson) rapist son, Frank Bernard Hartbourne (Rob Parry). Martin is attracted to  Woolpack barmaid, Louise appleton. Louise offers to babysit landlady Diane Sugden's stepdaughter Victoria (Hannah Midgley) and takes her to  a Karate class where she bumps into Martin. There is a spark between them but there is delay in them getting together. Martin's daughter, Kayleigh Gibbs (Lily Jane Stead) is often a source of conflict between Martin and Louise, as Martin is a single father with full custody following his divorce. ", "Frank Bernard arrives in Emmerdale to live with Pearl and her partner Len Reynolds (Peter Martin) after being released from prison for raping a neighbour of Pearl's.  He was previously accused by a colleague but the case was dropped due to lack of evidence. Frank's first interactions are with postmistress Viv Hope (Emmerdale) and her daughter Donna Windsor (Verity Rushworth) and they are civil to him, not realising his identity. Frank later mingles with the locals in the Woolpack but when he confirms his identity to barmaid Louise Appleton (Emily Symons), prompting an angry reaction from Viv and many other villagers. Viv's son, Scott (Ben Freeman) and his friend Syd Woolfe (Nathan Gladwell) then eject Frank from the pub."]}, {"page": "List of Emmerdale characters (2003)", "response": ["Jean Tate is the daughter of Zoe Tate (Leah Bracknell) and Scott Windsor (Ben Freeman). She appeared from 2003 to 2005.", "In 2005, Denzil has a brief relationship with Chas Dingle after he offers to change a flat tyre for her when she breaks down on the side of the road. However, she later falls in love with Carl King. Denzil breaks up with Chas when she repeatedly lies for her lawbreaking father Shadrach Dingle (Andy Devine), who steals Denzil's patrol car, humiliating him. Denzil returns to give evidence at Zoe's trial for the attempted murder of Scott Windsor (Ben Freeman) in September."]}, {"page": "List of Emmerdale characters (2001)", "response": ["Ray started growing closer to Louise during 2002 and they started going out. But it was obvious that Ray had a darker, more menacing side to him. He got involved with Scott Windsor (Ben Freeman) in a car scam, which was run by one of his right hand men, Tony. But Tony soon disappeared after Ray and Scott talked. Another example of Ray's dodgy side was when he got involved with Chris Tate (Peter Amory) and his wife, Charity (Emma Atkins), through Tate Haulage. He wanted certain goods to be transported, but Charity and Terry Woods (Billy Hartman) soon found out that there were more than just goods in the truck. They discovered that Ray had been bringing illegal immigrants into the country. When Charity confronted Ray, his nasty streak appeared when he pinned Charity up against the wall and threatened her. Despite all this, Louise continued to turn a blind eye to his activities unaware that Ray was hiding more than just his dodgy deals from his girlfriend, he had also hidden the fact that he had diabetes. He proposed to her in September 2002, but she turned him down."]}, {"page": "List of Emmerdale characters (1997)", "response": ["Lyn taunts Kelly Windsor about her relationship with teacher, Tom Bainbridge (Jeremy Turner-Welch), causing the two girls to fight and forcing Tom to separate them. Despite this, Lyn and Kelly later become friends. Lyn bullies Emma Cairns (Rebecca Loudonsack) about her teenage pregnancy. She dates Roy Glover (Nicky Evans) and Marlon Dingle (Mark Charnock), who she then cheats on with Scott Windsor (Ben Freeman). Lyn breaks up with Marlon on his 25th birthday. Lyn and Scott start a relationship, which ends when she discovers Scott has been having an affair with Kelly, who is his stepsister. Disgusted by this, Lyn ends her relationship with Scott and leaves the village."]}, {"page": "List of Emmerdale characters (2002)", "response": ["Sydney \"Syd\" Woolfe, played by Nathan Gladwell., made his first on-screen appearance on 25 March 2002 and departed on 25 November 2004. Prior to receiving the role of Syd, Gladwell had previously starred in hairdressing drama Cutting It. On the day Gladwell received the role, he flew out to New Zealand on holiday and started the day he got back. He said: \"They e- mailed me the script and I flew home, jet-lagged to hell and started my first day at Emmerdale. \"I had to use a circular saw and was convinced they were trying to kill me. I didn't know what day it was, I could hardly keep my eyes open and was put in charge of this very dangerous blade. It wasn't my finest hour.\" One of Syd's earliest storylines is a love triangle with Scott Windsor (Ben Freeman) and Chloe Atkinson (Amy Nuttall). \"I'd be lying if I said it hasn't been fun, But what can you do? You've just got to get on with it.\" Of his character, Gladwell said  \"You could never leave Syd in the house with your girlfriend because he'd be trying it on like mad no matter how good a mate you were. But he's likeable. He's not someone you hate. He added  \"I was going to say you wouldn't trust him with your life, but you probably would - you just wouldn't trust him with your wife.\" Gladwell was initially contracted until December."]}, {"page": "List of Emmerdale characters (1999)", "response": ["Richie goes into business with his friend Scott Windsor (Ben Freeman) and rents a room from Sarah and Jack Sugden (Clive Hornby). He develops feelings for Sarah and they soon begin an affair. Sarah agrees to leave Jack, but Richie becomes frustrated when weeks go by and she keeps stalling. He eventually packs her bags for her on the day of the May Fair and when the couple return home, Richie tells Jack the truth. Sarah and Richie leave the farm together. Sarah wins custody of her daughter Victoria (Hannah Midgley), but Richie is not keen on being a father figure to her. Sarah eventually ends the affair. One night Richie asks Sarah if they can talk and they go into a barn at the farm together. They hide when they hear someone enter and assume it is Jack. However, it is Andy Sugden (Kelvin Fletcher), who sets fire to the barn as part of an insurance scam. Richie manages to escape, but Sarah cannot leave as she is too scared. Richie is knocked down by an explosion, but continues to try and save her. Jack rushes out of the house to help, but the barn blows up killing Sarah instantly. Richie later leaves the village. Years later, Victoria (now Isabel Hodgins) tracks Richie down and asks him for the truth about Sarah's death, having long believed that Jack was responsible. Richie says Jack is covering for someone, and even takes the blame, but he becomes scared Victoria will call the police, so he leaves."]}, {"page": "List of Emmerdale characters (1998)", "response": ["Tricia tried to help out in the Woolpack but contributed towards its destruction when fireworks she bought set alight and burned down the pub. She slept with both Terry and Scott Windsor (Ben Freeman), but was mortified both when Scott told Terry about their fling and when Terry spilled the beans to the drinkers in the village hall. She felt terribly guilty about her treatment of Terry and was sorry when he came back to the village on Christmas Day only to discover the tragic news about his friend Vic Windsor (Alun Lewis)."]}]}}