{"wiki_id": "http://www.wikidata.org/entity/Q4885474", "itemLabel": "Ben Crompton", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Crompton", "wikipedia_page": {"main": "Benjamin Lorton Crompton (born 1974) is an English actor and standup comedian, best known for his performance on the BBC sketch show Man Stroke Woman and as Colin in the BBC Three sitcom Ideal. From 2012 to 2019, Crompton portrayed Eddison Tollett on the HBO high-fantasy series Game of Thrones.", "link_mentions": [{"page": "2000 in film", "response": ["| 102 Dalmatians || Walt Disney Pictures || Kevin Lima (director); Kristen Buckley, Brian Regan, Bob Tzudiker, Noni White (screenplay); Glenn Close, Gérard Depardieu, Ioan Gruffudd, Alice Evans, Tim McInnerny, Eric Idle, Ben Crompton, Carol MacReady, Ian Richardson, Jim Carter, Ron Cook, David Horovitch, Timothy West, Mike Hayley, Kerry Shale, Hugh Futcher, Jack Angel, Bill Farmer, Patrick Pinney, Phil Proctor || Comedy, Family || Live action"]}, {"page": "2002 in film", "response": ["| All or Nothing || United Artists || Mike Leigh (director/screenplay); Timothy Spall, Lesley Manville, James Corden, Alison Garland, Ruth Sheen, Marion Bailey, Paul Jesson, Sam Kelly, Kathryn Hunter, Sally Hawkins, Helen Coker, Daniel Mays, Ben Crompton, Robert Wilfort, Gary McDonald, Dorothy Atkinson, Alan Williams || Drama || Live Action"]}, {"page": "1998 in film", "response": ["| Les Misérables || Columbia Pictures / Mandalay Entertainment || Bille August (director); Rafael Yglesias (screenplay); Liam Neeson, Geoffrey Rush, Uma Thurman, Claire Danes, Hans Matheson, Jon Kenny, John McGlynn, Kelly Hunter, Lennie James, Peter Vaughan, Julian Rhind-Tutt, David Birkin, Ben Crompton, Patsy Byrne, Frank O'Sullivan, Christopher Adamson, Tim Barlow, Shannon McCormick, Reine Brynolfsson, Kathleen Byron, Toby Jones, Edward Tudor-Pole, Gillian Hanna || Drama || Live action"]}, {"page": "List of A Song of Ice and Fire characters", "response": ["In the HBO television adaptation, he is portrayed by Ben Crompton."]}, {"page": "102 Dalmatians", "response": ["* Ben Crompton as Ewan"]}, {"page": "Les Misérables (1998 film)", "response": ["* Ben Crompton as Grantaire"]}, {"page": "Ben", "response": ["*Ben Crompton (born 1974), English actor"]}, {"page": "Clocking Off", "response": ["It was effectively an anthology programme, following the lives of a group of workers at a Manchester textile factory, with each episode focusing on the home life of a different character. Well-known actors who appeared in the series included Christopher Eccleston, Sophie Okonedo, Philip Glenister, John Simm, Lesley Sharp, Siobhan Finneran, Emma Cunniffe, Diane Parish, David Morrissey, Ricky Tomlinson, Julian Rhind-Tutt, William Ash, Ben Crompton, Jack Deam, Jack P. Shepherd, Tina O'Brien, Jason Merrells, Pam Ferris, Wil Johnson, Ashley Jensen, Susan Cookson, Mark Benton, Sarah Lancashire, Crissy Rock, Marshall Lancaster, Marc Warren, Claire Sweeney and Maxine Peake.", "* Ben Crompton as Barney Watson (Series 2–4)"]}, {"page": "Man Stroke Woman", "response": ["Man Stroke Woman is a British television comedy sketch show directed by Richard Cantor and produced by Ash Atalla and starring Amanda Abbington, Ben Crompton, Daisy Haggard, Meredith MacNeill, Nicholas Burns and Nick Frost.  In addition to being broadcast on digital channel BBC Three in the United Kingdom, all the episodes were available for streaming from the BBC website.  Series 2 started in January 2007 and is also available for streaming from the BBC website."]}, {"page": "Ideal (TV series)", "response": ["* Colin (Ben Crompton): a bouncy, childlike petty criminal who is usually on probation, as he frequently reminds people."]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", "response": ["| Alfie Allen, Josef Altin, Jacob Anderson, John Bradley-West, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, Maisie Williams", "| Alfie Allen, Ian Beattie, John Bradley-West, Gwendoline Christie, Emilia Clarke, Michael Condron, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Stephen Dillane, Peter Dinklage, Nathalie Emmanuel, Tara Fitzgerald, Jerome Flynn, Brian Fortune, Joel Fry, Aiden Gillen, Iain Glen, Kit Harington, Lena Headey, Michiel Huisman, Hannah Murray, Brenock O'Connor, Daniel Portman, Diana Rigg, Iwan Rheon, Owen Teale, Sophie Turner, Carice van Houten, Indira Varma, Maisie Williams, Tom Wlaschiha", "| Alfie Allen, Jacob Anderson, Pilou Asbæk, John Bradley West, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Joe Dempsie, Peter Dinklage, Richard Dormer, Nathalie Emmanuel, Jerome Flynn, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Kristofer Hivju, Rory McCann, Hannah Murray, Staz Nair, Daniel Portman, Bella Ramsey, Richard Rycroft, Sophie Turner, Rupert Vansittart, Maisie Williams"]}, {"page": "All or Nothing (film)", "response": ["* Ben Crompton as Craig"]}, {"page": "John Bramwell", "response": ["The next album, called The Light Fantastic, is planned for release in 2020. On 27 September 2019 the single \"I Am The Sky\" with a video starring Ben Crompton and the Newcastle dance company Ballet Lorent was released. The release was paired with a competition for fans."]}, {"page": "Crompton (surname)", "response": ["*Ben Crompton (born 1974), English actor"]}, {"page": "Housewife, 49", "response": ["It also documents the lead character's changing relationships with those around her; standing up to her domineering husband (David Threlfall), developing a close but sometimes strained friendship with Mrs Waite (Stephanie Cole) the head of the Local Women's Voluntary Service, and her changing relationships with her eldest son Arthur (Ben Crompton), and her younger son Cliff (Christopher Harper) who is altered by his experiences of combat.Nella Last's War, p. 276. It is also implied that Cliff, who in real life became a sculptor in Australia,Nella Last's War, p. 301. was gay; although Nella either does not realise or refuses to acknowledge it.", "* Ben Crompton as Arthur Last, eldest son"]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Ben Crompton"]}, {"page": "All the King's Men (1999 film)", "response": ["*Ben Crompton – Private Davy Croft"]}, {"page": "Iain Forsyth and Jane Pollard", "response": ["In 2009 they were commissioned by the British Film Institute to produce a new work for the BFI Gallery (the contemporary art space at BFI Southbank) called \"Radio Mania: An Abandoned Work\"  a multi-screen 3D video installation featuring Kevin Eldon, Caroline Catz, Terrence Hardiman and Fenella Fielding with Martians played by Ben Crompton, Iain Lee and Ben Moor. The project was curated by Elisabetta Fabrizi, who invited the artists to access the BFI National Archive of film and television, the largest of its kind in the world, to create a new commission.Fabrizi, Elisabetta (ed), 'The BFI Gallery Book', BFI, London 2011, pp.159-170Fabrizi, Elisabetta, 'Is this Cinema? Am I right to keep on Trying?' in 'Artists Moving image in Britain since 1989', edited by Balsom, Erika, Perks, Sarah, Reynolds,Lucy, Paul Mellon/Yale University Press, London 2019."]}, {"page": "The Sinking of the Laconia", "response": ["* Ben Crompton - Harry Townes, acting leading seaman, RMS Laconia"]}, {"page": "List of Game of Thrones characters", "response": ["| Ben Crompton || Eddison Tollett ||  || colspan=5  ||  || ", "* Eddison Tollett (seasons 2–8) portrayed by Ben Crompton, is a steward of the Night's Watch, known to all as \"Dolorous Edd\" for his dour face and outlook. Despite his continual gloom and doom he is well-liked by the other Brothers in Black, and is one of few Night's Watchmen to have few if any enemies among his brothers. He is part of the expeditionary force beyond the Wall. In Season 3 he is one of the few remaining survivors from the battle at the Fist of the First men and they manage to retreat to Craster's Keep. He fights against the mutineers after the death of Lord Commander Mormont. In season 4, he and Grenn manage to return to Castle Black, but they join Jon Snow on his mission to kill the mutineers. He survives the ensuing battle and is seen dragging Locke's corpse back to Craster's Keep with the other slain Night's Watch brothers. In the wildling attack on Castle Black, Eddison remains atop the Wall on Jon's orders to stop the wildlings from breaching the gate. He sends down flaming oil barrels and ultimately delivers the blow that sends the wildlings retreating by swinging a huge scythe across the Wall, causing the ice to break and sending many falling to their deaths. He lives through the battle and personally burns Grenn's body at the funeral. In season 5, he witnesses Mance Rayder's execution, supports Jon in becoming the new Lord Commander, and drags Janos Slynt into the courtyard when Jon sentences him to die. He begrudgingly agrees to Jon's proposal to rescue the wildlings from Hardhome before the White Walkers can reach them. He accompanies Jon and the Night's Watch to Hardhome and is one of the few who escape the massacre alive. Following Jon's death in a mutiny, he is one of Jon's loyalists who find his body and barricade themselves inside his quarters, refusing to acknowledge Thorne's leadership. Davos Seaworth sends him to fetch Tormund and the wildlings for help, and he succeeds just in time, ordering the mutineers locked up. He witnesses Jon's resurrection by Melisandre, and the mutineers' execution. Jon relinquishes his command to Edd, naming him the new acting Lord Commander. When Jon leaves Castle Black to retake Winterfell from Ramsay Bolton, Edd shares a good-natured farewell with him. In Season 8, he is killed during the Battle of Winterfell."]}, {"page": "The Suspicions of Mr Whicher", "response": ["* Ben Crompton ...  William Nutt"]}, {"page": "List of British films of 2012", "response": ["|| Director: Nick Murphy   Cast: Paul Bettany, Mark Strong, Stephen Graham, Brian Cox, Naomi Battrick, Ben Crompton, Natasha Little, Zoe Tapper"]}, {"page": "Game of Thrones (season 2)", "response": ["* Ben Crompton as Eddison Tollett", "Others were also added to the cast, either in a small recurring role or with reduced prominence. The most notable example is Tony Way's Ser Dontos Hollard, a drunkard knight, who had a pivotal role in Sansa Stark's storyline that ran in the course of two novels, while in the series the role was reduced to a small scene in the opening episode. Others include: Ben Crompton as \"Dolorous Edd\" Tollet, a man of the Night's Watch. Robert Pugh as the Wildling Craster, father and husband to Gilly. Kerr Logan as Davos Seaworth's pious son Matthos."]}, {"page": "Pramface", "response": ["* Ben Crompton as Keith Prince"]}, {"page": "The North Remembers", "response": ["This episode introduces several prominent characters, most notably Stannis Baratheon (Stephen Dillane), Ser Davos Seaworth (Liam Cunningham), and Melisandre (Carice van Houten). The three of them represent the head of an entirely new storyline that intertwines with other plotlines as the season progresses. Other recurring characters introduced in this episode are drunken knight Ser Dontos Hollard (Tony Way), the Starks' captive Alton Lannister (Karl Davies), Melisandre's opponent Maester Cressen (Oliver Ford Davies), Davos's son Matthos Seaworth (Kerr Logan), Night's Watch member Dolorous Edd (Ben Crompton), Wildling Craster (Robert Pugh), and his daughter and wife Gilly (Hannah Murray)."]}, {"page": "Game of Thrones (season 3)", "response": ["* Ben Crompton as Eddison Tollett"]}, {"page": "Hit & Miss", "response": ["* Ben Crompton as Liam – brother of Wendy"]}, {"page": "List of awards and nominations received by Game of Thrones", "response": ["| data-sort-value=\"Altin, Josef\"| Josef Altin, Jacob Anderson, John Bradley, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, and Maisie Williams", "| data-sort-value=\"Allen, Alfie\"| Alfie Allen, Ian Beattie, John Bradley, Gwendoline Christie, Emilia Clarke, Michael Condron, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Stephen Dillane, Peter Dinklage, Nathalie Emmanuel, Tara Fitzgerald, Jerome Flynn, Brian Fortune, Joel Fry, Aidan Gillen, Iain Glen, Kit Harington, Lena Headey, Michiel Huisman, Hannah Murray, Brenock O'Connor, Daniel Portman, Iwan Rheon, Owen Teale, Sophie Turner, Carice Van Houten, Maisie Williams, and Tom Wlaschiha", "| data-sort-value=\"Allen, Alfie\"| Alfie Allen, Pilou Asbæk, Jacob Anderson, John Bradley, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Joe Dempsie, Peter Dinklage, Richard Dormer, Nathalie Emmanuel, Jerome Flynn, Iain Glen, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Kristofer Hivju, Rory McCann, Hannah Murray, Staz Nair, Daniel Portman, Bella Ramsey, Richard Rycroft, Sophie Turner, Rupert Vansittart, and Maisie Williams", "| data-sort-value=\"Altin, Josef\"| Josef Altin, Jacob Anderson, John Bradley, Thomas Brodie-Sangster, Dominic Carter, Dean-Charles Chapman, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead-Wright, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, Indira Varma and Maisie Williams"]}, {"page": "Game of Thrones (season 4)", "response": ["* Ben Crompton as Eddison Tollett", "|scope=\"row\"| Josef Altin, Jacob Anderson, John Bradley, Dominic Carter, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Charles Dance, Peter Dinklage, Natalie Dormer, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, and Maisie Williams"]}, {"page": "Blood (2012 film)", "response": ["*Ben Crompton as Jason Buleigh"]}]}}