{"wiki_id": "http://www.wikidata.org/entity/Q4885555", "itemLabel": "Ben Drury", "itemDescription": "British graphic designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Drury", "wikipedia_page": {"main": "Ben Drury (born 4 January 1972), is a British freelance designer.\nHe was art director of Mo' Wax recordings and has worked extensively in the music industry, creating album artwork for Turin Brakes and Dizzee Rascal amongst others. He maintains long-term creative collaborations with James Lavelle of Mo' Wax and Singapore based clothing label Surrender & Will Bankhead, also formerly of Mo' Wax, and currently the cult T-shirt company, Answer. He worked closely with artist Futura 2000 designing a compilation of his work, entitled “Futura”, published in 2000 by Booth-Clibborn Editions [1]. In 2006 he collaborated with Nike to produce the \"Air U Breathe\" Air Max 1 Premium training shoe and Windrunner jacket. In December 2009 he rebooted the partnership to create the Nike Air Max 90 Current “Silent Listener\".", "link_mentions": [{"page": "Futura (graffiti artist)", "response": ["Years later James Lavelle resurrected Futura's career by getting him, alongside Ben Drury, to produce the artwork for several releases on Mo' Wax records; this also led to Futura producing the imagery which has largely defined Lavelle's Unkle project.", "*2000: Futura. Texts by Ben Drury, Liz Farrelly, Andrew Holmes. Booth-Clibborn. ."]}, {"page": "Unkle", "response": ["In March the Lazarides Gallery in London showcased War Paint, an exhibition of artworks inspired by the recent Unkle album War Stories, with works from Robert Del Naja, Warren du Preez, Nick Thornton Jones, Will Bankhead and Ben Drury."]}, {"page": "Mo' Wax", "response": ["The original Mo' Wax logo as used on the early releases was designed by UK graphic designer Ian Swift \"Swifty\", but the label grew their reputation by featuring artwork contributions from Futura, Robert Del Naja (from Massive Attack), She One and Req 1. Ben Drury was the main designer responsible for the art direction and design of the label."]}, {"page": "Endtroducing.....", "response": ["* Ben Drury – sleeve design"]}, {"page": "Psyence Fiction", "response": ["* Ben Drury – sleeve design"]}, {"page": "Mighty Force Records", "response": ["Although the store ceased to trade in 1995, the label relocated to London and continued to release music by deep house artists such as Peach Palf and the Classic / Music For Freaks recording artists, Luke Solomon and Justin Harris under the alias Robotic Movement until 1998. Label design was by Ben Drury, known for his innovative work with James Lavelle's Mo' Wax label and collaborations with former graffiti artist and The Clash's sometime sleeve designer, Futura 2000."]}, {"page": "Push the Button (Money Mark album)", "response": ["* Ben Drury – design, button photography"]}, {"page": "Strictly Turntablized", "response": ["* Ben Drury – logo design"]}, {"page": "Who Needs Actions When You Got Words", "response": ["* Ben Drury – design, additional photography, art direction"]}, {"page": "Mark's Keyboard Repair", "response": ["* Ben Drury – sleeve design"]}, {"page": "Wordpower, Vol. 2: Directrix", "response": ["*Ben Drury - artwork"]}, {"page": "More Stories", "response": ["The cover art was designed by Kazuki, with additional design by Ben Drury and James Lavelle."]}, {"page": "Big Soup", "response": ["Big Soup was released on 7 July 1997 by Mo' Wax. The sleeve artwork for the album was designed by Ben Drury."]}, {"page": "Pain Killer (Turin Brakes song)", "response": ["* Ben Drury – Turin Brakes logo and sleeve artwork"]}, {"page": "Drury (surname)", "response": ["* Ben Drury (born 1972), British freelance designer"]}, {"page": "Once Smitten", "response": ["* Ben Drury – art direction, design"]}]}}