{"wiki_id": "http://www.wikidata.org/entity/Q4889129", "itemLabel": "Benjamin Pine", "itemDescription": "English colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Pine", "wikipedia_page": {"main": "Sir Benjamin Chilley Campbell Pine (1809–1891) was at various times administrator of Natal, the Gold Coast, Antigua, the Leeward Islands and Western Australia.", "link_mentions": [{"page": "List of South Africans", "response": ["*Benjamin Pine, Natal governor (1809–1891)"]}, {"page": "1873", "response": ["* July 22 – Sir Benjamin Pine becomes Lieutenant-governor of the Colony of Natal."]}, {"page": "Governor of Western Australia", "response": ["| Sir Benjamin PineAlthough formally appointed Governor, Pine never actually came to Western Australia to take up his post; the role was filled by an administrator, Lieutenant Colonel John Bruce."]}, {"page": "List of colonial governors in 1868", "response": ["*# Sir Benjamin Pine, Governor of Western Australia (1868–1869)"]}, {"page": "List of colonial governors in 1869", "response": ["*# Sir Benjamin Pine, Governor of Western Australia (1868–1869)"]}, {"page": "Sir Benjamin Pine", "response": ["#REDIRECT Benjamin Pine"]}, {"page": "Pinetown", "response": ["Pinetown was named after the governor of Natal, Sir Benjamin Pine. The town was established in 1850 around the Wayside Hotel, itself built in 1849 along the main wagon route between Durban and Pietermaritzburg. In the Victorian era Pinetown was known as health resort.", "* Benjamin Pine Primary School"]}, {"page": "1873 in South Africa", "response": ["** Sir Benjamin Pine (from 22 July).", "* 22 – Sir Benjamin Pine becomes Lieutenant-governor of the Colony of Natal."]}, {"page": "1874 in South Africa", "response": ["* Lieutenant-governor of the Colony of Natal: Sir Benjamin Pine."]}, {"page": "Government House, Natal", "response": ["The Old Government House in Pietermaritzburg, South Africa, was the official residence of the Lieutenant-Governor of Natal, Sir Benjamin Pine, who arrived in Natal in 1851. The building was completed in the late 1860s. The Natal Government later bought it from Pine and established it as the Government House."]}, {"page": "Benjamin Chilley Campbell Pine", "response": ["#REDIRECT Benjamin Pine"]}, {"page": "Monarchy of Australia", "response": ["|colspan=4|Governors of New South Wales: Sir George Gipps, Sir Charles FitzRoy, Sir William Denison, Sir John Young, Somerset Lowry-Corry, 4th Earl Belmore, Sir Hercules Robinson, Lord Augustus Loftus, Charles Wynn-Carington, 3rd Baron Carrington, Victor Child Villiers, 7th Earl of Jersey, Sir Robert Duff, Henry Brand, 2nd Viscount Hampden, William Lygon, 7th Earl BeauchampGovernors of Western Australia: Sir James Stirling, John Hutt, Sir Andrew Clarke, Charles Fitzgerald, Sir Arthur Kennedy, John Hampton, Sir Benjamin Pine, Sir Frederick Weld, Sir William Robinson, Sir Harry Ord, Sir Frederick Broome, Sir Gerard SmithGovernors of South Australia: George Gawler, Sir George Grey, Frederick Robe, Sir Henry Young, Sir Richard MacDonnell, Sir Dominick Daly, Sir James Fergusson, Sir Anthony Musgrave, Sir William Jervois, Sir William Robinson, Algernon Keith-Falconer, 9th Earl of Kintore, Sir Thomas Buxton, Hallam Tennyson, 2nd Baron TennysonGovernors of Victoria: Sir Charles Hotham, Sir Henry Barkly, Sir Charles Darling, John Manners-Sutton, 3rd Viscount Canterbury, Sir Sir George Bowen, George Phipps, 2nd Marquess of Normanby, Sir Henry Loch, John Hope, 7th Earl of Hopetoun, Thomas Brassey, 1st Earl BrasseyGovernors of Tasmania: Sir Henry Young, Sir Thomas Browne, Sir Charles Du Cane, Sir Frederick Weld, Sir John Lefroy, Sir George Strahan, Sir Robert Hamilton, Jenico Preston, 14th Viscount GormanstonGovernors of Queensland: Sir George Bowen, Samuel Blackall, George Phipps, 2nd Marquess of Normanby, Sir William Cairns, Sir Arthur Kennedy, Sir Anthony Musgrave, Sir Henry Norman, Charles Cochrane-Baillie, 2nd Baron LamingtonGovernor-general: John Hope, 7th Earl of HopetounPrime minister: Edmund Barton"]}, {"page": "1868 in Australia", "response": ["*Governor of Western Australia – Dr John Hampton, then Sir Benjamin PineAlthough formally appointed Governor, Pine never actually came to Western Australia to take up his post; the role was filled by an administrator, Lieutenant Colonel John Bruce."]}, {"page": "1869 in Australia", "response": ["*Governor of Western Australia – Sir Benjamin Pine (appointed, but not sworn in), Sir Frederick Weld (from 18 September)", "*Governor of Western Australia – Sir Benjamin Pine,Although formally appointed Governor, Pine never actually came to Western Australia to take up his post; the role was filled by an administrator, Lieutenant Colonel John Bruce. then The Hon. Sir Frederick Weld GCMG."]}]}}