{"wiki_id": "http://www.wikidata.org/entity/Q4888572", "itemLabel": "Benjamin Farjeon", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Farjeon", "wikipedia_page": {"main": "Benjamin Leopold Farjeon (12 May 1838 – 23 July 1903) was an English novelist, playwright, printer and journalist. As an author, he was known for his huge output.", "link_mentions": [{"page": "Eleanor Farjeon", "response": ["Eleanor Farjeon was born in the Strand, London,\"Eleanor Farjeon\". Find a Grave. Retrieved 21 June 2013. on 13 February 1881. The daughter of Benjamin Farjeon and Maggie (Jefferson) Farjeon, Eleanor came from a literary family, her two younger brothers, Joseph and Herbert Farjeon, were writers, while the oldest, Harry Farjeon, was a composer. Her father was Jewish.100 Ideas for Assemblies: Primary School Edition By Fred Sedgwick, p. 52", "In 1960, Farjeon donated her family book collection to the Dunedin Public Library. Her father had been a journalist in Dunedin in the 1860s before returning to England. The collection includes works by Farjeon, her father, brothers and niece. It also includes some music, photographs and correspondence, and two pictograph letters by Nicholas Chevalier, who was a family friend and illustrated many of Benjamin Farjeon's books."]}, {"page": "List of Oceanian Jews", "response": ["* Benjamin Farjeon, writer"]}, {"page": "Otago Daily Times", "response": ["Vogel was editor, with the day to day commercial management under the control of Benjamin Farjeon, who had come to Dunedin from Victoria in 1861. Farjeon also acted as sub-editor, contributor and frequently compositor. During Farjeon's time at the ODT he wrote the novels. Shadows on the Snow (1965) and Grif: a story of colonial life (1866) and he composed and set them in type in the office of the newspaper. Daniel Campbell, who had been Cutten's manager for some years, became manager of the mechanical departments of the business."]}, {"page": "Harry Farjeon", "response": ["Harry Farjeon was born in Hohokus Township, New Jersey, United States, the eldest son of author Benjamin Farjeon, who was from the East End of London, and Margaret, the daughter of American actor Joseph Jefferson. His parents returned to Britain when he was a baby, and he lived in Hampstead in London for the rest of his life. His younger sister, Eleanor Farjeon (b. 1881), with whom he shared a rich imaginary life,Farjeon, Annabel (1986): Morning Has Broken: A Biography of Eleanor Farjeon wrote children's books and poetry, including the hymn, Morning Has Broken. His younger brothers were J. Jefferson Farjeon (b. 1883), novelist, and Herbert Farjeon (b. 1887), writer of theatrical revues."]}, {"page": "List of British Jewish writers", "response": ["* Benjamin FarjeonOxford Dictionary of National Biography: \"His parents were Orthodox Jews\"", "* Eleanor Farjeon, daughter of Benjamin Farjeon"]}, {"page": "Benjamin Leopold Farjeon", "response": ["#REDIRECT Benjamin Farjeon"]}, {"page": "Otago Witness", "response": ["Cutten sold his share in both the publications to Vogel in November 1864. Vogel took on Benjamin Farjeon as his junior partner in what became J. Vogel & Co."]}, {"page": "Benjamin L Farjeon", "response": ["#redirect Benjamin Farjeon"]}, {"page": "Joseph Jefferson Farjeon", "response": ["Born in Hampstead, London, Farjeon was the grandson of the American actor Joseph Jefferson, after whom he was named.In Edwards's Introduction to the 2014 reissue of Mystery in White. A Christmas Crime Storey (London: British Library, [1937]). His parents were Jefferson's daughter Maggie (1853–1935) and Benjamin Farjeon (1838–1903), a Victorian novelist, who was born in Whitechapel to an impoverished immigrant family and travelled widely before returning to England in 1868. Joseph Jefferson Farjeon's brothers were Herbert, a dramatist and scholar, and Harry, who became a composer. His sister Eleanor became a children's author.Lewis Melville, \"Farjeon, Benjamin Leopold (1838–1903)\", rev. William Baker. ODNB, Oxford University Press, 2004 Retrieved 21 November 2014, pay-walled. His daughter Joan Jefferson Farjeon (1913–2006) was a theatre set designer.Obituary in The Independent, 14 August 2006. Retrieved 21 November 2014."]}, {"page": "Farjeon", "response": ["*Benjamin Farjeon (1838–1903), British novelist, playwright, printer and journalist"]}, {"page": "1866 in Australian literature", "response": ["* Benjamin Farjeon – Grif : A Story of Colonial Life"]}, {"page": "1865 in Australian literature", "response": ["* Benjamin Farjeon – Shadows on the Snow : A Christmas Story"]}, {"page": "B. L. Farjeon", "response": ["#REDIRECT Benjamin Farjeon"]}, {"page": "Farjeon, Benjamin", "response": ["#redirectBenjamin Farjeon"]}, {"page": "Joan Jefferson Farjeon", "response": ["Farjeon was born in London's West End Lane on 26 May 1913 into a literary family. Her father, the dramatist and novelist Joseph Jefferson Farjeon, was the third child of actor's Joseph Jefferson daughter Margaret and the novelist Benjamin Farjeon. Her American mother, Frances Wood, was friendly with the Jefferson family. Farjeon's birth was recorded in the poem Nursery Rhymes of London Town by her aunt Eleanor Farjeon in 1916. She moved to Billingshurst, Sussex during the First World War before returning to London after the war ended. In 1925, Farjeon won a solo dancing contest at the Lyric Theatre. A collection of poems, Joan's Play, was named after her in 1926, and inspired by her life in Sussex. Farjeon was educated at Lindores School in Bexhill-on-Sea, and after two years of formal education left school at age 16, enrolling at the Westminster School of Art."]}]}}