{"wiki_id": "http://www.wikidata.org/entity/Q4885882", "itemLabel": "Ben Hunt-Davis", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Hunt-Davis", "wikipedia_page": {"main": "(Francis) Benedict Hunt-Davis MBE (born 15 March 1972) is a former British competition rower and an Olympic champion. He was appointed Member of the Order of the British Empire in the 2001 New Year Honours list.", "link_mentions": [{"page": "Rowing at the 2000 Summer Olympics", "response": ["|nowrap|Andrew LindsayBen Hunt-DavisSimon DennisLouis AttrillLuka GruborKieran WestFred ScarlettSteve TrapmoreRowley Douglas"]}, {"page": "Simon Dennis (rower)", "response": ["* 2000 — Gold, Eight (with Andrew Lindsay, Ben Hunt-Davis, Louis Attrill, Luka Grubor, Kieran West, Fred Scarlett, Steve Trapmore, Rowley Douglas)"]}, {"page": "Great Britain at the 2000 Summer Olympics", "response": ["| Simon DennisRowley Douglas (cox)Ben Hunt-DavisLuka GruborAndrew LindsayFred ScarlettSteve TrapmoreKieran West || Rowing", "|align=left|Louis AttrillSimon DennisLuka GruborBen Hunt-DavisAndrew LindsayFred ScarlettSteve TrapmoreKieran WestRowley Douglas (cox)"]}, {"page": "Great Britain at the 1992 Summer Olympics", "response": ["*Martin Cross, Jim Walker, Ben Hunt-Davis, Jonny Singfield, Rupert Obholzer, Richard Phelps, Stephen Turner, Tim Foster, Adrian Ellison"]}, {"page": "Great Britain at the 1996 Summer Olympics", "response": ["|align=left|Peter BridgeRoger BrownRichard HamiltonBen Hunt-DavisMatthew ParishGraham SmithAlex StoryJames WalkerGarry Herbert (cox)"]}, {"page": "Shiplake College", "response": ["* Ben Hunt-Davis Gold Olympian rower in the Sydney 2000 Summer Olympics in the men's VIII."]}, {"page": "Kieran West", "response": ["At the Olympic Games Britain were the joint favourites for the gold medal, alongside the USA, who had not raced internationally that season. A poor row in the first round, West's 23rd birthday, saw them lose to a strong Australian crew, but they won the repechage. In the final Britain led from start to finish to win the gold medal for the first time since the 1912 Stockholm Olympic Games, with West being the youngest member of the crew, and the first member of Cambridge University to win at the Olympics while still a student. Australia took the silver. The crew of Andrew Lindsay, Ben Hunt-Davis, Simon Dennis, Louis Attrill, Luka Grubor, Kieran West, Fred Scarlett, Steve Trapmore and Rowley Douglas were all subsequently awarded the MBE for \"services to rowing\" in the 2001 New Year Honours."]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Andrew LindsayBen Hunt-DavisSimon DennisLouis AttrillLuka GruborKieran WestFred ScarlettSteve TrapmoreRowley Douglas"]}]}}