{"wiki_id": "http://www.wikidata.org/entity/Q4885944", "itemLabel": "Ben Jones-Bishop", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Jones-Bishop", "wikipedia_page": {"main": "Ben Jones-Bishop is a Jamaica international rugby league footballer who plays as a winger or fullback for Sheffield Eagles in the RFL Championship.He played for the Leeds Rhinos in the Super League, and on loan from Leeds at Harlequins RL in the top flight. Jones-Bishop has also played for the Salford Red Devils and Wakefield Trinity in the Super League, and has played for the England Knights at international level.\n\n", "link_mentions": [{"page": "Sheffield Hallam University", "response": ["* Ben Jones-Bishop, Leeds Rhinos rugby league player"]}, {"page": "Ben Jones", "response": ["*Ben Jones-Bishop (born 1988), English rugby league player for Leeds Rhinos"]}, {"page": "Sheffield Eagles", "response": ["|  Ben Jones-Bishop || York City Knights || 1 Year || November 2021"]}, {"page": "Jamaica national rugby league team", "response": ["In 2018, Jamaica entered the World Cup qualifying stages for a third time with the matches also doubling up as the 2018 Americas Rugby League Championship.  On 13 November 2018, Jamaica played Canada for a place in the qualification play-off. They defeated Canada 38-8 with Ben Jones-Bishop getting two tries in the victory. On 17 November 2018, Jamaica met the United States at Hodges Stadium, Jacksonville, Florida to play for a place in the 2021 Rugby League World Cup. Jamaica raced into a 16-0 lead within the first 30 minutes of the game only for the United States to score 2 tries before half-time and pull the score back to 16-10 at the break. The second half was a tighter contest with defence becoming the priority for Jamaica and the half would ultimately end scoreless. Jamaica beat the United States 16-10, defeating United States for the first time in Jamaica's history and qualifying for the 2021 World Cup.", "|Ben Jones-Bishop", "* Ben Jones-Bishop"]}, {"page": "British African-Caribbean people", "response": ["An England international rugby union player, Danny Cipriani is of Afro-Trinidadian, Italian and English ancestry. Other professional players of Afro-Jamaican heritage include Ashton Golding, Michael Lawrence and Ben Jones-Bishop."]}, {"page": "2008 Leeds Rhinos season", "response": ["|Ben Jones-Bishop"]}]}}