{"wiki_id": "http://www.wikidata.org/entity/Q4895015", "itemLabel": "Bert Coleman", "itemDescription": "English footballer (1889-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bert_Coleman", "wikipedia_page": {"main": "Ernest Herbert \"Bert\" Coleman (19 October 1889 – 15 June 1958) was an English footballer, notable for making an appearance in 1921 with the English national side despite playing for non-league Dulwich Hamlet.", "link_mentions": [{"page": "Dulwich Hamlet F.C.", "response": ["During the 1920s the club had two players capped by the full England team. Bert Coleman was capped whilst playing for Dulwich in 1921, whilst Edgar Kail won three caps against France, Belgium and Spain in 1929. Kail was the last amateur player to play for England whilst solely with an amateur club, and shunned many approaches from professional clubs to stay with Dulwich Hamlet, his local side, for whom he scored over 400 goals, and is still the subject of terrace songs by fans of the club.Football's local hero  BBC Sport, 17 February 2003"]}, {"page": "Ernest Coleman", "response": ["*Bert Coleman (1889–1958), English footballer, played for England and Dulwich Hamlet"]}, {"page": "Jules Dewaquez", "response": ["His first international selection was on 18 January 1920 in a 9–4 defeat by Italy. In his next match, on 29 February he scored in a 2–0 victory over Switzerland, and appeared in all France's international matches in 1920, including two matches in the 1920 Olympics held in Antwerp, being eliminated in a 4–1 defeat by Czechoslovakia. He was selected for all the French internationals over the next two years, including a match against an England amateur XI on 5 May 1921, when he scored in a 2–1 victory. This was the first time in which a French national team had defeated its English equivalent. This game is recognised as a full international by the French Football Federation but not by the Football Association who consider it as an amateur match.Report on French Football Federation  (Of the England players, only Bert Coleman, Alfred Bower and Albert Read were later selected for the full England XI.)"]}, {"page": "1923 FA Charity Shield", "response": ["| ||1 || Bert Coleman, Dulwich Hamlet"]}]}}