{"wiki_id": "http://www.wikidata.org/entity/Q4895496", "itemLabel": "Bertha Lewis", "itemDescription": "British opera singer and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Bertha_Lewis", "wikipedia_page": {"main": "Bertha Amy Lewis (12 May 1887 – 8 May 1931) was an English opera singer and actress primarily known for her work as principal contralto in the Gilbert and Sullivan comic operas with the D'Oyly Carte Opera Company.", "link_mentions": [{"page": "The Pirates of Penzance", "response": ["|Ruth||Louie René||Bertha Lewis||Bertha Lewis||Dorothy Gill||Ella Halman"]}, {"page": "The Mikado", "response": ["|Katisha||Bertha Lewis||Bertha Lewis||Dorothy Gill||Ella Halman||Ella Halman", "In 1926, the D'Oyly Carte Opera Company made a brief promotional film of excerpts from The Mikado. Some of the most famous Savoyards of the day are seen in this film, including Darrell Fancourt as The Mikado, Henry Lytton as Ko-Ko, Leo Sheffield as Pooh-Bah, Elsie Griffin as Yum-Yum, and Bertha Lewis as Katisha.Shepherd, Marc. \"The 1926 D'Oyly Carte Mikado Film\" , The Gilbert & Sullivan Discography, 15 April 2009, accessed 31 July 2016The first phonoscènes in the UK were presented at Buckingham Palace in 1907 and included Tit-Willow, sung by George Thorne.Schmitt, Thomas. The Genealogy of Clip Culture, in Henry Keazor and Thorsten Wübbena (eds.) Rewind, Play, Fast Forward: The Past, Present and Future of the Music Video, transcript Verlag (2010), pp. 45 et seq., "]}, {"page": "Iolanthe", "response": ["|Fairy Queen||Bertha Lewis||Bertha Lewis||Dorothy Gill||Ella Halman||Ella Halman"]}, {"page": "Ruddigore", "response": ["|Dame Hannah||Rosina Brandram||Elsie Cameron||Bertha Lewis||Bertha Lewis||Evelyn Gardiner"]}, {"page": "H.M.S. Pinafore", "response": ["In 1911, H. L. Mencken wrote: \"No other comic opera ever written – no other stage play, indeed, of any sort – was ever so popular. ... Pinafore ... has been given, and with great success, wherever there are theaters – from Moscow to Buenos Aires, from Cape Town to Shanghai; in Madrid, Ottawa and Melbourne; even in Paris, Rome, Vienna and Berlin.\"Mencken, H. L. \"Pinafore at 33\", Baltimore Evening Sun, 1911, reproduced at The Gilbert and Sullivan Archive, accessed 10 March 2009 After the deaths of Gilbert and Sullivan, the D'Oyly Carte Opera Company retained exclusive rights to perform their operas in Great Britain until 1962, touring throughout Britain for most of the year and, beginning in 1919, often performing in London for a season of about four months. The Times gave the company's 1920 London production an enthusiastic review, saying that the audience was \"enraptured\", and regretting that Pinafore would be played for only two weeks. It praised the cast, singling out Leo Sheffield as the Captain, Henry Lytton as Sir Joseph, Elsie Griffin as Josephine, James Hay as Ralph, Bertha Lewis as Little Buttercup and the \"splendid\" choral tone. It concluded that the opera made a \"rollicking climax to the season\".\"H.M.S. Pinafore. Revival at Princes Theatre\", The Times, 21 January 1920, p. 10 Two years later, it gave an even more glowing report of that season's performances, calling Derek Oldham an \"ideal hero\" as Ralph, noting that Sydney Granville \"fairly brought down the house\" with his song, that Darrell Fancourt's Deadeye was \"an admirably sustained piece of caricature\" and that it was a \"great pleasure\" to hear the returning principals.\"H.M.S. Pinafore. Sullivan Opera Season Nearing The End\", The Times, 3 January 1922, p. 8 A 1961 review of the company's Pinafore is much the same.\"Novelty and Tradition in Savoy Operettas\", The Times, 12 December 1961, p. 5", "|Buttercup||Bertha Lewis||Bertha Lewis||Dorothy Gill||Ella Halman"]}, {"page": "The Yeomen of the Guard", "response": ["|Dame Carruthers||Bertha Lewis||Bertha Lewis||Evelyn Gardiner||Ella Halman||Ella Halman"]}, {"page": "1931 in music", "response": ["*May 8 – Bertha Lewis, singer and actress with the D'Oyly Carte Opera Company (born 1887) (car accident)"]}, {"page": "1887 in music", "response": ["*May 12 – Bertha Lewis, operatic contralto (died 1931)"]}, {"page": "The Sorcerer", "response": ["|Lady Sangazure||Bertha Lewis||Bertha Lewis||Evelyn Gardiner||Lyndsie Holland||Patricia Leonard"]}, {"page": "Princess Ida", "response": ["|Lady Blanche||Rosina Brandram||Genevieve Reynolds||Alice Carle||Bertha Lewis||Bertha Lewis", "|Lady Blanche||Bertha Lewis||Evelyn Gardiner||Ann Drummond-Grant||Christene Palmer||Lyndsie Holland"]}, {"page": "George Baker (baritone)", "response": ["For the BBC, Baker recorded: 1966 Trial (Judge) and 1966 Ida (King Gama). He is also heard on a 1970 recording compiling many of his early recordings, called A Tribute to George Baker: Vintage Compilation.A Tribute to George Baker (HQM1200)   A Gilbert and Sullivan Discography In 1973, for an LP set, The Art of the Savoyard, Baker recorded his reminiscences of Richard Temple, Henry Lytton, Bertha Lewis, C. H. Workman, Walter Passmore and other original Savoyards.(Pearl LP set GEM 118/120)"]}, {"page": "The Gondoliers", "response": ["|Duchess||Bertha Lewis||Bertha Lewis||Evelyn Gardiner||Ella Halman||Ella Halman"]}, {"page": "Bertha", "response": ["* Bertha Lewis (1887–1931), English opera singer and actress"]}, {"page": "Patience (opera)", "response": ["|Jane||Bertha Lewis||Bertha Lewis||Dorothy Gill||Ella Halman"]}, {"page": "Martyn Green", "response": ["In 1931, Lytton was injured in a car accident in which D'Oyly Carte principal contralto Bertha Lewis received fatal injuries. Green took over Lytton's nine patter roles until Lytton's return about two months later. Afterwards, two of the roles – Major-General Stanley in Pirates and Robin Oakapple in Ruddigore – were assigned to Green permanently in 1932.Wilson and Lloyd, p. 128 He also began substituting more frequently for Lytton in the role of Jack Point. In 1934, Lytton's retirement left Green as the principal comedian of the D'Oyly Carte company, playing all of the comic roles in their repertory over the next five years, which included London seasons and extended British and American tours. Green gained enthusiastic notices for, among other things, his excellent diction and comedic stage movement, despite the World War I injury to his knee. Green finally added John Wellington Wells in The Sorcerer to his long list of roles when the company revived that work in 1938, and he appeared in the film version of The Mikado in the role of Ko-Ko in 1939. Green was a slim song-and-dance man who could make audiences laugh with a mere \"twitch of a toe... [or] punctilious verbal articulation, nasally pompous\", while bringing elements of seriousness and pathos to some of the roles. His director in the film, Victor Schertzinger, said of Green: \"He has that special sort of comedian's quality that only Chaplin has so far developed to perfection. He can make you laugh and cry at the same moment.\"Lejeune, C. A. \"Films of the Week: Gentlemen of Japan\", The Observer, 3 July 1938, p. 14."]}, {"page": "D'Oyly Carte Opera Company", "response": ["From 1909 to 1934, the principal comedian was Henry Lytton, who had been playing a variety of roles with the company steadily since 1887. He received a knighthood for his performances during his long tenure with the company.Wilson and Lloyd, p. 125 Lytton's voice deteriorated during his later career, and when HMV embarked on a series of complete recordings of the operas after World War I, he was not invited to record most of his roles. Instead, the concert singer George Baker was brought in to substitute. Other performers from this period include the mezzo-soprano Nellie Briercliffe, bass-baritone Darrell Fancourt, who is estimated to have portrayed the Mikado of Japan more than 3,000 times, contralto Bertha Lewis, tenor Derek Oldham, soprano Elsie Griffin and baritones Leo Sheffield and Sydney Granville.Wilson and Lloyd, pp. 90–112"]}, {"page": "Henry Lytton", "response": ["Lytton was knighted in the 1930 Birthday Honours; he is the only person to have received the accolade for achievements as a Gilbert and Sullivan performer.Stone, David. \"Henry A. Lytton\", Who Was Who in the D'Oyly Carte Opera Company, Gilbert and Sullivan Archive, 2005. Retrieved 19 September 2020 The award was celebrated by international press such as The Scotsman,\"Mr Henry Lytton\", The Scotsman, 3 June 1930, p. 10 The Los Angeles Times\"King offers honors list\", The Los Angeles Times, 3 June 1930, p. 2 and The Ottawa Citizen.\"King's Birthday Honors\", The Ottawa Citizen, 3 June 1930, p. 13 In May the following year Lytton, driving in heavy rain, crashed his car; his passenger, his fellow D'Oyly Carte principal Bertha Lewis, was killed, and he was injured. He was absent for six weeks, during which Martyn Green, his understudy and eventual successor, took over his roles.Rollins and Witts, p. 155; and \"Famous Savoyard's Return\", Gloucester Journal, 20 June 1931, p. 10 In August 1931 Lytton permanently handed over two of his roles to Green – Robin Oakapple and the Major General.Rollins and Witts, p. 156"]}, {"page": "A Welsh Sunset", "response": ["*Gwenny Davis – Bertha Lewis"]}, {"page": "Cultural influence of Gilbert and Sullivan", "response": ["Film adaptations of the operas have included a 1926 D'Oyly Carte Opera Company short promotional film of The Mikado that featured some of the most famous Savoyards, including Darrell Fancourt, Henry Lytton, Leo Sheffield, Elsie Griffin, and Bertha Lewis.Shepherd, Marc. 1926 Mikado  at A Gilbert and Sullivan Discography In 1939, Universal Pictures released a ninety-minute technicolor film adaptation of The Mikado. The film stars Martyn Green as Ko-Ko and Sydney Granville as Pooh-Bah.  The music was conducted by Geoffrey Toye, who was credited with the adaptation.  William V. Skall received an Academy Award nomination for Best Cinematography.  Similarly, in 1966, the D'Oyly Carte produced a film version of The Mikado, which showed much of their traditional staging at the time, although there are some minor cuts.  It stars John Reed (Ko-Ko), Kenneth Sandford (Pooh-Bah), Valerie Masterson (Yum-Yum), Donald Adams (the Mikado), Peggy Ann Jones (Pitti-Sing), and Philip Potter (Nanki-Poo).Sullivan, Dan. \"The Mikado (1967)\". The New York Times, 15 March 1967, accessed 22 March 2010"]}, {"page": "Winifred Lawson", "response": ["In 1944 Lawson was elected vice-president of the Gilbert and Sullivan Society and frequently joined Society meetings and events. Her autobiography, A Song to Sing-O!, with foreword by Sir Malcolm Sargent, was published by Michael Joseph in 1955.WorldCat  The Times said that the book \"gives a delightful picture of those happy days in the operas, with Henry Lytton, Bertha Lewis, Leo Sheffield and Darrell Fancourt\"."]}, {"page": "Citizen Radio", "response": ["*Bertha Lewis"]}, {"page": "Louie René", "response": ["René left D'Oyly Carte again for a year, rejoining on tour in March 1910.Rollins and Witts, p. 126  During this time, she appeared in her old roles, as well as in the part of Lady Blanche in Princess Ida, until December 1914.Rollins and Witts, pp. 126–31  After this, she left the company for the last time (succeeded in her roles by Bertha Lewis) and pursued a career in Edwardian musical comedy.  Among other productions, she appeared in Mark Blow's musical comedies TrouvilleThe Manchester Guardian, 6 May 1919, p. 1 and Toto, in 1919,The Manchester Guardian, 27 September 1919, p. 1 and in a revival of A Waltz Dream late in her career."]}, {"page": "Anna Bethell", "response": ["She left the company in 1912 but returned the next year, touring in the same roles and also as Peep-Bo in The Mikado. From 1915, Bethell sang in the chorus, again playing Saphir from 1917. In 1918, she began to understudy the principal contralto roles, then played by Bertha Lewis, and began to play Mrs. Partlett in The Sorcerer and Inez in The Gondoliers. Between 1918 and 1924, she also toured, from time to time, in two plays by Stanley Houghton, Hindle Wakes (as Fanny Hawthorn) and The Younger Generation.The Manchester Guardian, 23 October 1918, p. 1; 7 May 1921, p. 1; and 24 July 1924, p. 1Oldham, Derek. \"Sydney Granville\", Memories of the D'Oyly Carte Opera Company website; accessed 8 November 2016 In 1921, she resumed the small part of Chloe, with D'Oyly Carte, and the next year also began again to play Kate.  In 1923, she sometimes played the role of Cousin Hebe in H.M.S. Pinafore, Melissa in Princess Ida, Pitti-Sing in The Mikado, and Tessa in The Gondoliers. After this, until 1925, she played the parts of Mrs. Partlett, Chloe and Inez.Stone, David. \"Anna Bethall\" (sic), Who Was Who in the D'Oyly Carte Opera Company, 2 December 2002; accessed 30 November 2009."]}, {"page": "Malcolm Sargent discography", "response": ["*** Henry Lytton, George Baker, Charles Goulding, Darrell Fancourt, Sydney Granville, Stuart Robertson, Elsie Griffin, Bertha Lewis, Nellie Briercliffe, chorus and orchestra, HMV, 1930", "*** George Baker, Darrell Fancourt, Derek Oldham, Sydney Granville, Leslie Rands, Bertha Lewis, Nellie Briercliffe, Alice Moxon, Nellie Walker, Winifred Lawson, Chorus and Light Opera Orchestra, chorus and orchestra, HMV, 1930", "*** Darrell Fancourt, Martyn Green, Derek Oldham, George Baker, Leslie Rands, Nellie Briercliffe, Marjorie Eyre, Rita Mackay, Bertha Lewis, Winifred Lawson, chorus and orchestra, HMV, 1931", "*** (abridged): George Baker, Darrell Fancourt, Stuart Robertson, Derek Oldham, Sydney Granville, Muriel Dickson, Bertha Lewis, chorus and orchestra, HMV, 1931"]}, {"page": "Herbert Heyner", "response": ["In 1910 Heyner married the Savoyard contralto Bertha Lewis, who died in May 1931 after being involved in a car accident. He did not attend the funeral. In June 1931 he married Mary Louise Hamilton (1902–1973), with whom he had two daughters, Susan, born in 1936 and Diana, born in 1937."]}, {"page": "1931 in British music", "response": ["*8 May – Bertha Lewis, singer and actress with the D'Oyly Carte Opera Company, 43 (car accident)"]}, {"page": "Evelyn Gardiner", "response": ["Gardiner joined the D'Oyly Carte Opera Company in 1921 singing in the chorus of their Gilbert and Sullivan operas. Within months, she was cast as the understudy for the company's principal contralto, Bertha Lewis. Her first principal role with the company was Inez in The Gondoliers in 1923, and the following season, she occasionally filled in as the Duchess of Plaza-Toro in that opera. She left the Company in 1925.Stone, David. \"Evelyn Gardiner\", Who Was Who in the D'Oyly Carte Opera Company, 24 May 2004, accessed 12 May 2015 Gardiner next appeared in films and in pantomime and variety.  She appeared in plays in London at the Regent Theatre from 1928 to 1931."]}, {"page": "Cambridge City Cemetery", "response": ["*Bertha Lewis, the principal contralto with the D'Oyly Carte Opera Company.", "File:Bertha Lewis Grave.jpg|The grave of opera singer Bertha Lewis"]}, {"page": "Dorothy Gill", "response": ["After returning to England, she joined the main D'Oyly Carte company in September 1931 after the accidental death of Bertha Lewis. Until her retirement in June 1936, she was the company's principal contralto, playing the roles of Lady Sangazure in The Sorcerer, Little Buttercup in H.M.S. Pinafore, Ruth, Lady Jane, the Fairy Queen, Lady Blanche in Princess Ida, Katisha, Dame Hannah, Dame Carruthers in The Yeomen of the Guard and the Duchess of Plaza Toro. When the company visited New York City in 1934, Gill made a strong impression upon American audiences.Zellnik, Laurie. \"Fifty Years Ago – The Birth of a Society\", The Palace Peeper, The Gilbert & Sullivan Society of New York, October 1986, pp. 3–4 American fans dedicated to her a book of their tributes to the company, \"Nothing But Toffee\" (1934) and petitioned Rupert D'Oyly Carte, unsuccessfully, to bring Gill back to New York in 1936."]}]}}