{"wiki_id": "http://www.wikidata.org/entity/Q4893276", "itemLabel": "Bernard J. Taylor", "itemDescription": "American composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_J._Taylor", "wikipedia_page": {"main": "Bernard J. Taylor is a writer and composer of musicals and stage plays. His stage works have been produced around the world and translated into German, Romanian, Polish, Hungarian, Spanish and Italian. He is also the writer of 14 novels and three non-fiction books.\nTaylor was born and educated in Cape Town, South Africa. His forebears included John Taylor, the first British missionary to southern Africa. He left South Africa for England in 1969 and remained in England until 1998, after which he spent a year in Australia before settling in the United States. He lives in San Antonio, Texas.", "link_mentions": [{"page": "Pride and Prejudice", "response": ["A 1936 stage version was created by Helen Jerome played at the St James's Theatre in London, starring Celia Johnson and Hugh Williams. First Impressions was a 1959 Broadway musical version starring Polly Bergen, Farley Granger, and Hermione Gingold.  In 1995, a musical concept album was written by Bernard J. Taylor, with Claire Moore in the role of Elizabeth Bennet and Peter Karrie in the role of Mr Darcy.  A new stage production, Jane Austen's Pride and Prejudice, The New Musical, was presented in concert on 21 October 2008 in Rochester, New York, with Colin Donnell as Darcy. The Swedish composer Daniel Nelson based his 2011 opera Stolthet och fördom on Pride and Prejudice.Stolthet och fördom / Pride and Prejudice (2011), work details"]}, {"page": "Wuthering Heights", "response": ["The novel has been popular in opera and theatre, including operas written by Bernard Herrmann, Carlisle Floyd, and Frédéric Chaslin (most cover only the first half of the book) and a musical by Bernard J. Taylor."]}, {"page": "Nosferatu", "response": ["* Bernard J. Taylor adapted the story into the 1995 musical Nosferatu the Vampire. The title character is called Nosferatu, and the plot of the musical follows the plot of Murnau's film, yet other characters’ names are reverted to names from the novel (Mina, Van Helsing, etc.)."]}, {"page": "Paul McGann", "response": ["After hearing him sing in The Monocled Mutineer, composer Bernard J. Taylor invited McGann to create the role of Benedict in the concept studio recording of the Much Ado, a musical based on Shakespeare's Much Ado About Nothing."]}, {"page": "Bonnie Langford", "response": ["* Wuthering Heights (original cast recording of Bernard J. Taylor's musical)"]}, {"page": "List of musicals: A to L", "response": ["| Bernard J. Taylor"]}, {"page": "Lesley Garrett", "response": ["Garrett created the role of Cathy in the London studio recording of Bernard J. Taylor's operatic version of Wuthering Heights, which also featured Dave Willetts, Bonnie Langford and other leading British musical theatre performers. Her rendition of \"I Belong to the Earth\" was included on two of her solo albums."]}, {"page": "List of musicals: M to Z", "response": ["| Bernard J. Taylor", "| Bernard J. Taylor", "| Bernard J. Taylor", "| Bernard J. Taylor", "| Bernard J. Taylor"]}, {"page": "Peter Karrie", "response": ["Karrie was brought up in Wales, where he had radio and television shows on BBC Wales. He began his career as the lead singer of pop group Peter and the Wolves, and went on to star in several West End musical productions, including Les Misérables and Chess. He also played Daddy Warbucks in Annie, Fagin in Oliver! and Tevye in Fiddler on the Roof for Aberystwyth Arts Centre. In 2005 he starred with Shan Côthi in the Mal Pope musical Amazing Grace at the Wales Millennium Centre for the Wales Theatre Company. He performed alongside John Owen Jones and Nic Greenshields in the one-off Three Phantoms concert in aid of George Thomas Hospice Care. He also created roles in three Bernard J. Taylor musicals, and the title role of Nosferatu was written for him. In 2012 he appeared in the 33rd edition of The Royal Nova Scotia International Tattoo in Halifax, Nova Scotia, Canada, where he and Brenna Conrad performed a Cole Porter tribute and a rendition of Phantom of the Opera."]}, {"page": "Dave Willetts", "response": ["Since then, Willetts has appeared in a concert version of Jesus Christ Superstar, taken the lead role in Leicester Haymarket's acclaimed production of Stephen Sondheim's Sweeney Todd, appeared as Old Deuteronomy in the 20th anniversary production of Andrew Lloyd Webber's Cats in London,The House That Dave Built, Coventry Telegraph, 14 May 2001  and as Jean Valjean in the 10th anniversary production of Les Misérables in Sydney, Australia. He took the role of Heathcliff in the studio recording of Bernard J. Taylor musical version of Wuthering Heights."]}, {"page": "Mario Frangoulis", "response": ["In 1995, Frangoulis returned to London to play the role of Lun-Tha in the Rodgers and Hammerstein musical The King and I during the Covent Garden Festival. This highly acclaimed performance received great comments from a number of newspapers including the Times and The Guardian. He also sang the title role in the musical Yusupov in Oxford as well as Johnny in \"Sail away\" (Savoy theatre in London). In 1995 he participated in the recording of Bernard J. Taylor's rock opera Nosferatu the Vampire.bernardjtaylor.com. Nosferatu the Vampire  He also sang as a Les Misérables alumnus in the Tenth Anniversary Concert of the show at the Royal Albert Hall.", "*Bernard J. Taylor: Nosferatu the Vampire (in the role of Jonathan)"]}, {"page": "List of BDSM authors", "response": ["* Bernard J. Taylor"]}, {"page": "Mark Wynter", "response": ["Wynter played the leading role in Conduct Unbecoming for more than a year at the Queen's Theatre in London, and for six months in Australia. He appeared with Julia McKenzie in On the Twentieth Century, and in Charley's Aunt. He also starred in Side By Side By Sondheim in Toronto, Chichester, and on the UK tour. In the 1982 Chichester Festival season he acted in several plays including On The Rocks and Henry V, and also sang in Valmouth. His other work in musicals during the 1980s included the role of the King in a revival of The King and I, the title roles in Hans Andersen and Barnum, the 1986 revival of Charlie Girl with Cyd Charisse and Paul Nicholas in London, and the part of Robert Browning in Robert and Elizabeth. During the 1990s Wynter spent two years in Cats, and was also seen as the Phantom and M. Andre in The Phantom of the Opera, and starred as Vittorio opposite Bonnie Langford in the 1998 West End revival of Sweet Charity. He has appeared frequently in the rest of the UK and portrayed Emile de Becque in a UK national tour of South Pacific. In 1994 he created the role of Van Helsing in the studio recording of the opera/musical \"Nosferatu\" by Bernard J. Taylor."]}, {"page": "Gay Soper", "response": ["Gay Soper is an English actress. She is perhaps best known for her performance in the musical Godspell in 1971, as well as Mme. Thenardier on the Complete Symphonic Recording of Les Misérables. She also performed all the voices for The Flumps, a famous children's TV series in Britain, and created the role of Mrs Bennett in Bernard J. Taylor's musical version of Pride and Prejudice."]}, {"page": "Much Ado", "response": ["Much Ado, Bernard J. Taylor's musical version of Shakespeare's Much Ado About Nothing, was recorded as a concept album in 1995, featuring Paul McGann, Peter Karrie and other West End stars.  It received its world premiere at Stratford-on-Avon in 1996. It was partly inspired by the Kenneth Branagh film version.  The most recent production was in Budapest, Hungary, opening in June 2007.", "*Bernard J. Taylor's website", "*Bernard J. Taylor's website"]}, {"page": "Nosferatu The Vampire (musical)", "response": ["Nosferatu the Vampire is a rock opera musical by Bernard J. Taylor inspired by the 1922 silent movie classic by Friedrich Wilhelm Murnau.", "*Nosferatu the Vampire, Bernard J. Taylor website"]}, {"page": "Pride and Prejudice (musical)", "response": ["Pride and Prejudice is a musical by Bernard J. Taylor based on Jane Austen's 1813 novel Pride and Prejudice. It was first produced as a concept studio recording in London, England, with singers including Peter Karrie, Claire Moore, Christopher Biggins, and others. It received its world premiere at the Madison Theatre, Peoria, Illinois in 1993, and by 2007 had received more than 20 productions worldwide, including Britain, Germany, Australia and New Zealand.", "*Bernard J. Taylor"]}, {"page": "Claire Moore (singer)", "response": ["From 2000 to 2001, Moore played Mrs Anna (as alternate for Elaine Paige) in the London Palladium production of The King and I.Claire's centre stage in 'King', Lancashire County Publications, 8 September 2000 She has also played Fantine and Madame Thenardier in Les Misérables;The Big Interview: Claire Moore and Barry James, Matthew Amer, London Theatre Guide, 6 October 2005 and also appeared in the musicals of Bernard J. Taylor.Larkin, Colin; John Martland (1999). The Virgin Encyclopedia of Stage and Film Musicals. London: Virgin in association with Muze UK Ltd. .", "She is featured on albums including the original cast recordings of Miss Saigon, The Phantom of the Opera – Highlights, Cabaret, Oliver! and Les Misérables, as well as The Music of Andrew Lloyd Webber, Leading Ladies and two solo albums of songs by Bernard J. Taylor.Home town girl who keeps her feet on the ground, Lancashire County Publications, 2 June 2000"]}, {"page": "Jane Austen in popular culture", "response": ["* Pride and Prejudice (1995), a musical by Bernard J. Taylor"]}, {"page": "Wuthering Heights (musical)", "response": ["Wuthering Heights is Bernard J. Taylor's musical/operatic version of Emily Brontë's 1847 novel of the same name. The musical first appeared in 1992 as a studio recording featuring Lesley Garrett as Cathy, Dave Willetts as Heathcliff, Bonnie Langford as Isabella Linton and other stars of Britain's West End stage. The show has since been translated into six languages from the original English and has been extensively staged in the UK,  USA, The Netherlands,  Germany, Poland, Romania, Australia and New Zealand. In 2008 a production was being planned in Budapest, Hungary, where Taylor's Much Ado received its European continental premiere in 2007. Lesley Garrett has included her recording of 'I Belong To The Earth' on two of her solo albums.", "Mark Seaward, Editor of the Bronte Society's magazine, wrote: \"Wuthering Heights is an intensely dramatic work, charged with emotion; it is not surprising that many dramatists, choreographers, lyricists and composers have been drawn to recreate it for stage and screen. There have been seven major films between 1920 and 1991 and in addition there has been a ballet (1982), and opera (1967) and numerous adaptations and plays, including several for television — and not forgetting Kate Bush’s song “Wuthering Heights” which topped the charts! Bernard J. Taylor's work marks the first time that the true spirit and drama of Emily Brontë's masterpiece has been captured in a musical.\"", "The summer, 1992 edition of Show Music Magazine, USA, reported: \"Bernard J. Taylor's big, sweepingly romantic score sustains a feeling of dark passion entirely appropriate for an adaptation of Emily Bronte's novel concerning the ill-fated love between Cathy and Heathcliff.\"", "*, Bernard J. Taylor website"]}, {"page": "Success!", "response": ["Success! is a musical by Bernard J. Taylor that was first recorded in 1993 as a studio concept album featuring various West End performers including Lon Satton (who created the role of Poppa in Andrew Lloyd Webber's Starlight Express), Claire Moore,  Kathryn Evans, Jessica Martin and Maurice Clarke.  It had its world premiere stage production in Rotherham, Yorkshire, in 1995. "]}, {"page": "Barry James", "response": ["James can be heard on cast recordings of Beauty and the Beast, My Fair Lady, \"She Loves Me\" and two Bernard J. Taylor musicals - Nosferatu the Vampire (in which he created the role of \"Renfeld\"), Much Ado in which he created the role of Leonato, and Monsieur Firmin in The Phantom of the Opera 25th Anniversary Concert.  He is also Thenardier in the 1988 symphonic cast recording of Les Misérables."]}, {"page": "List of people from Hastings", "response": ["*Bernard J. Taylor. Composed a number of his works whilst resident in Hastings."]}, {"page": "List of musicals by composer: M to Z", "response": ["* Bernard J. Taylor (born 1944)"]}, {"page": "Lady Edith Foxwell", "response": ["It was reported, in the April 2004 issue of GQ magazine, that Lady Foxwell and Marvin Gaye had an affair. The report quoted writer/composer Bernard J. Taylor as saying he was told by Foxwell that she and Gaye had discussed marriage before his death."]}, {"page": "Adaptations of Wuthering Heights", "response": ["* Wuthering Heights (1994), a musical by Bernard J. Taylor. It was first recorded in 1992 as a concept album starring Lesley Garrett, Dave Willetts, Bonnie Langford and Clive Carter. It has been translated into German, Romanian and Polish.Wuthering Heights  by Bernard J. Taylor"]}]}}