{"wiki_id": "http://www.wikidata.org/entity/Q4895196", "itemLabel": "Bert Lipsham", "itemDescription": "English footballer and manager (1878-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bert_Lipsham", "wikipedia_page": {"main": "Herbert Broughall Lipsham (29 April 1878 – 23 March 1932) was a professional footballer who won the 1902 FA Cup Final with Sheffield United.", "link_mentions": [{"page": "Millwall F.C.", "response": ["There have been 34 permanent and 15 caretaker managers since the appointment of the club's first professional manager, Bert Lipsham on 4 May 1911. From 1890 to 1910, Millwall directors Kidd, Stopher and Saunders were honorary managers, also working under the title of club secretary. Bob Hunter is Millwall's longest serving manager, having stayed at the helm for 15 years. Prior to becoming manager, he was the club's trainer for 21 years. He died in office in 1933, having served at the club for a total of 36 years. Steve Claridge holds the shortest tenure at the club, having been in charge for a period of 36 days without ever taking charge of a first-team game. Every Millwall manager has come from the United Kingdom or Ireland.", "|1911–1918|| Bert Lipsham"]}, {"page": "King's School, Chester", "response": ["*Bert Lipsham, England International footballer and FA Cup winner with Sheffield United in 1902."]}, {"page": "List of people from Chester", "response": ["*Bert Lipsham, footballer."]}, {"page": "1901 FA Cup Final", "response": ["In the first round, Sheffield were drawn away to Sunderland at Roker Park. This was a difficult hurdle as Sunderland were one of the leading teams in the First Division, eventually finishing as runners-up behind champions Liverpool. The match was played on Saturday, 9 February and Sheffield United won 2–1 with goals by Bert Lipsham and Fred Priest. Sunderland's goal was scored by Colin McLatchie.", "Less than a minute later, Sheffield equalised with a goal that Mike Collett has described as \"one of the most controversial ever scored in a final\". It is unclear what exactly happened but, according to Collett, the most likely scenario is that Tottenham's goalkeeper George Clawley tried to catch a shot by Bert Lipsham and fumbled it. The ball dropped behind Clawley and he spun round to try and kick it away under pressure from Walter Bennett. The ball went out of play over the dead ball line and the linesman signalled a corner, as he thought Clawley had been the last player to make contact with the ball. The referee, however, overruled him and signalled a goal kick, as he thought Bennett had the last contact. Before Clawley could take the goal kick, the referee changed his mind and awarded a goal to Sheffield with Bennett named as the scorer. ", "|LW || Bert Lipsham", "|LW || Bert Lipsham"]}, {"page": "1902 FA Cup Final", "response": ["Two minutes into the game, Southampton goalkeeper Robinson stumbled when trying to intercept a cross by Bert Lipsham, allowing George Hedley to score the opening goal for Sheffield. Playing against the wind, Southampton pressed for an equaliser and Foulke was kept busy throughout the rest of the first half but Southampton wasted their chances. According to The Times, \"Boyle and Needham were very good\" for Sheffield, while Common was always a danger when running down the right wing. Sheffield maintained their lead until half-time.", "|LW || Bert Lipsham", "|LW || Bert Lipsham"]}]}}