{"wiki_id": "http://www.wikidata.org/entity/Q4893656", "itemLabel": "Bernard Smith", "itemDescription": "English professional footballer (born 1908)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Smith_(footballer)", "wikipedia_page": {"main": "Bernard Smith (1908 – after 1938) was an English professional footballer who made 68 appearances in the Football League playing for Birmingham and Coventry City. He played as a left back.\nSmith was born in Sileby, Leicestershire. He played for Loughborough Corinthians, and after an unsuccessful trial with Derby County, joined Birmingham in February 1932.At the start of the 1932–33 season, Birmingham's regular left back Ned Barkas was recovering from an appendicitis operation, so left-half Jimmy Cringan took his position. Cringan broke a collarbone in his first game, and was replaced by reserve left-back Jack Randle, who played four games before Smith, the second reserve, was drafted in for his debut at Derby County on 17 September 1932, which finished as a 2–2 draw. This was the first of a run of games, but when the experienced Barkas returned to the side Smith could not dislodge him.Smith moved on to Coventry City in August 1935, and contributed to their Third Division South championship in his first season. He played 56 league games for Coventry, and retired in 1939.Smith is the grandfather of The Times' football journalist Rory Smith.", "link_mentions": [{"page": "Bernard Smith", "response": ["Bernard Smith may refer to:", "* Bernard Smith (d. 1591) (1522–1591), MP for Totnes", "* Bernard Smith (New Jersey politician) (1776–1835), U.S. Congressman from New Jersey", "* Bernard Smith (footballer) (1908–?), English footballer for Birmingham and Coventry", "* Bernard Smith (abbot) (1812–1892), Irish Benedictine monk", "* Bernard Smith (art historian) (1916–2011), Australian art historian", "* Bernard Smith (editor) (1907–1999), American editor, critic and film producer", "* Bernard Smith (organ builder) (c. 1630 – 1708), English organ builder", "* Bernard Smith (sailboat designer) (1910–2010), American high-speed sailboat designer"]}]}}