{"wiki_id": "http://www.wikidata.org/entity/Q4895257", "itemLabel": "Bert Paddington", "itemDescription": "English footballer (1881-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bert_Paddington", "wikipedia_page": {"main": "Albert Hillman Paddington (30 June 1881 – 3 April 1932) was an English professional footballer who played as a half-back for Southampton and Brighton & Hove Albion in the 1900s. During his career he was always known as \"Paddy\".", "link_mentions": [{"page": "Paddington (disambiguation)", "response": ["* Bert Paddington (born 1881), English footballer with Southampton and Brighton & Hove Albion"]}, {"page": "Albert Paddington", "response": ["#REDIRECT Bert Paddington"]}, {"page": "1899–1900 Southampton F.C. season", "response": ["| Bert Paddington"]}, {"page": "1901–02 Southampton F.C. season", "response": ["The second replay took place at Reading's Elm Park ground on Monday 3 February, in front of a crowd of only 6,000. The pitch was described as \"like a skating rink\" covered in snow, with the touchlines painted blue; the match kicked off with snow still falling. Lee's place at left-half was taken by Bert Paddington, making a rare first-team appearance. In the first half, Paddington struggled against the pace of the Spurs' forwards, including John Cameron and Sandy Brown but, with the assistance of George Molyneux, survived a goalless first-half. After the interval, C. B. Fry was beaten by Patrick Gilhooley who crossed the ball to Jack Kirwan for a simple tap-in. Saints responded quickly, equalising when Archie Turner \"screwed in a tricky shot\". For the remainder of the match, Southampton were stronger, spending most of the time in the Spurs half of the pitch. The Spurs goalkeeper, Fred Griffiths, made a \"wonderful\" save from Chadwick before Sandy Tait turned the ball against his own post. In the final few minutes of the match, Saints managed to take the lead when Tait made a poor backpass, which was seized on by Albert Brown who beat Griffiths, leading to scenes of \"indescribable enthusiasm\" amongst the Southampton fans."]}, {"page": "List of people from Hampshire", "response": ["*Bert Paddington, footballer, was born in Bishopstoke"]}]}}