{"wiki_id": "http://www.wikidata.org/entity/Q4895827", "itemLabel": "Bertram Wallis", "itemDescription": "English actor-singer (1874-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bertram_Wallis", "wikipedia_page": {"main": "Bertram Wallis (22 February 1874 – 11 April 1952) was an English actor and singer known for his performances in plays, musical comedies and operettas in the early 20th century, first as leading men and then in character roles.  He also later appeared in several film roles.", "link_mentions": [{"page": "St James's Theatre", "response": ["Under Alexander, the St James's did not solely concentrate on drawing-room comedy and society drama. There were costume dramas, including the Ruritanian swashbuckler, The Prisoner of Zenda, which ran for 255 performances; and occasional ventures into Shakespeare, notably As You Like It, with Alexander as Orlando, Julia Neilson as Rosalind and a supporting cast that included C. Aubrey Smith, Bertram Wallis, H. B. Irving, Robert Loraine and H. V. Esmond.\"As You Like It\", The Era, 5 December 1896, p. 13 At the end of 1899 Alexander closed the theatre to have it largely reconstructed, producing what The Era called \"one of the handsomest temples of the drama in London\", while retaining its charm and cosiness. The rebuilding provided increased seating capacity, which enhanced the financial viability of the theatre. The decor was by Percy Macquoid, carried out by the leading London decorators Messrs. Morant and Co.Sheppard, F. H. W. (ed.) \"King Street\", Survey of London, vols. 29 and 30, St James Westminster, Part 1 (1960), pp. 295–307, accessed 30 March 2007"]}, {"page": "George Alexander (actor)", "response": ["The play chosen to fill the gap left by the withdrawal of The Importance was The Triumph of the Philistines by Henry Arthur Jones. Alexander had earlier presented Jones's The Masqueraders (1894) with some success, but the new play, a satire of small-town narrow-mindedness, received mixed reviews and quickly closed;\"The Theatres in 1895\", The Times, 3 January 1896, p.12 Alexander fell back on revivals, including The Second Mrs Tanqueray (without Mrs Patrick Campbell).\"St. James's Theatre\", The Morning Post, 21 June 1895, p. 3 In two productions during 1896 Alexander and his company moved temporarily away from drawing-room comedy and society drama, first with the Ruritanian swashbuckler, The Prisoner of Zenda, which ran for 255 performances; and at the end of the year a rare venture into Shakespeare, in As You Like It, with Alexander as Orlando, Julia Neilson as Rosalind and a supporting cast that included C. Aubrey Smith, Bertram Wallis, H. B. Irving, Robert Loraine and H. V. Esmond.\"As You Like It\", The Era, 5 December 1896, p. 13 At the end of 1899 Alexander closed the theatre to have it largely reconstructed, producing what The Era called \"one of the handsomest temples of the drama in London\", while retaining its charm and cosiness."]}, {"page": "A Country Girl", "response": ["The musical opened at Daly's Theatre in London, managed by George Edwardes, on 18 January 1902 and ran for 729 performances, which was the fourth longest run for any piece of musical theatre up to that time.  It starred Hayden Coffin, Bertram Wallis, Evie Greene, Huntley Wright, Lilian Eldeé, Topsy Sinden, Ethyl Irving and Rutland Barrington. Isabel Jay joined the cast later, and Gertie Millar starred in the 1914 revival.Gänzl, Kurt.  \"Millar, Gertrude (1879–1952)\", Oxford Dictionary of National Biography, Oxford University Press (2004), accessed 16 April 2008", "*Lord Grassmere - Bertram Wallis  "]}, {"page": "The Balkan Princess", "response": ["The Balkan Princess is a musical in three acts by Frederick Lonsdale and Frank Curzon, with lyrics by Paul Rubens and Arthur Wimperis, and music by Paul Rubens. It opened at London's Prince of Wales Theatre on 19 February 1910. The cast included Isabel Jay and Bertram Wallis.  There was a successful Broadway run in 1911 that used a libretto by Leonard Liebling, and the show toured widely thereafter.", "*The Grand Duke Sergius – Bertram Wallis"]}, {"page": "King of Cadonia", "response": ["King of Cadonia is an English musical in two acts with a book by Frederick Lonsdale, lyrics by Adrian Ross and Arthur Wimperis and music by Sidney Jones and Frederick Rosse. It opened at the Prince of Wales Theatre in London on 3 September 1908, produced by Frank Curzon, and ran for 333 performances. It starred Isabel Jay, Huntley Wright, and Bertram Wallis. There was a brief Broadway production in 1910 with additional music by Jerome Kern at the Fifth Avenue Theatre and directed by Joseph W. Herbert.", "*Alexis, King of Cadonia – Bertram Wallis"]}, {"page": "The Count of Luxembourg", "response": ["The original production opened at Daly's Theatre in London in 1911 and ran for 345 performances, starring Lily Elsie, Huntley Wright, W. H. Berry and Bertram Wallis. It was followed by a UK tour and also had a good run at the New Amsterdam Theatre in New York in 1912 with the libretto further adapted by Glen MacDonaugh. It played in Australia in 1913. Adaptations included a 1967 BBC television production and an American silent film version made in 1926. A new English language adaptation of Der Graf von Luxemburg, more closely following the original score and libretto, was produced under the name The Count of Luxembourg and recorded by New Sadler's Wells Opera in 1983 and toured by the D'Oyly Carte Opera Company in 1997.", "*Count René of Luxembourg – Bertram Wallis", "The Count of Luxembourg opened at Daly's Theatre in London on 20 May 1911 and ran for a successful 345 performances,Traubner, p. 238; some sources say 240 performances, but it is clear from The Times that the higher number must be correct, as the paper says in March 1912 that the piece continues to play strongly: \"Daly's Theatre\", The Count Of Luxembourg, The Times, 11 March 1912, p. 11, and it includes notices for further performances of the operetta as late as 4 May. starring Lily Elsie, Huntley Wright, W. H. Berry and Bertram Wallis. The opening night was conducted by Lehár and attended by King George V and Queen Mary.  The Times particularly praised the singing and dancing of Elsie and Wallis, as well as Lehár's music, though the paper judged the story to be thin and improbable.\"The King and Queen at Daly's Theatre\", The Count of Luxembourg, The Times, 22 May 1911, p. 10  It was followed by a UK tour starring Eric Thorne, Robert Michaelis, Lauri de Frece and Daisy Burrell,Lionel Carson (ed). The Stage Year Book (1912), p. 185 and it also had a good run at the New Amsterdam Theatre in New York in 1912 with the libretto further adapted by Glen MacDonaugh.The Count of Luxembourg, Musical Theatre Guide, accessed January 17, 2012Blumenfeld, p. 136 It played in Australia in 1913.Gänzl, p. 568 There was a Broadway revival in 1930.The Count of Luxembourg, IBDB database, accessed January 19, 2012  In 1967, the BBC broadcast their own television production, conducted by David Lloyd-Jones.\"More Opera on B.B.C. Television\", The Times, 9 November 1966, p. 7; and Julian Critchley, \"Cup final breaks the boredom\", The Times, 22 May 1967, p. 8"]}, {"page": "A Southern Maid", "response": ["A Southern Maid is an operetta in three acts composed by Harold Fraser-Simson, with a book by Dion Clayton Calthrop and Harry Graham and lyrics by Harry Graham and Harry Miller.  Additional music was provided by Ivor Novello and George H. Clutsam, with additional lyrics by Adrian Ross and Douglas Furber. It starred José Collins and Bertram Wallis.", "*Francesco del Fuego – Bertram Wallis"]}, {"page": "The Happy Day", "response": ["The musical opened at Daly's Theatre in London on 13 May 1916 and ran for 241 performances.  It starred Winifred Barnes, José Collins and Arthur Wontner, who played the Ruritanian prince. Later Bertram Wallis joined the cast."]}, {"page": "Miss Hook of Holland", "response": ["The show also had a Broadway run starring Bertram Wallis and an Australian production in 1907 and enjoyed various tours and revivals, including a 1914 revival starring Phyllis Dare.  There was also a \"matinee version\" of the show called Little Miss Hook of Holland, played by children for children.  The musical was popular with amateur theatre groups, particularly in Britain, from 1911 through the 1950s.Bond, Ian. \"Rarely Produced Shows\" . St. David's Players, Retrieved 22 July 2010"]}, {"page": "Madame Pompadour (operetta)", "response": ["The first English adaptation, by Frederick Lonsdale and Harry Graham (lyrics), which opened at Daly's Theatre in London in 1923, ran for a very successful 469 performances. It starred Bertram Wallis as Louis XV, Derek Oldham as René, Huntley Wright as Joseph Calicott and Evelyn Laye in the title role."]}, {"page": "List of British films before 1920", "response": ["|The Cost of a Kiss||Adrian Brunel||Bertram Wallis, Ethel Griffies||Drama||"]}, {"page": "Christie MacDonald", "response": ["in the operetta brand of musical theater. MacDonald's first starring role came in 1900 when she assumed the title role in the Kirke La Shelle and Julian Edwards comic opera The Princess Chic. MacDonald starred or co-starred in The Belle of Mayfair (1906) with Valeska Suratt, Miss Hook of Holland (1908) with Bertram Wallis and The Mikado (1910) with Fritzi Scheff. In 1910 she starred in one of her best-known musicals, The Spring Maid by Victor Herbert. In 1913 she popularised Herbert's Sweethearts.Pictorial History of the American Theatre 1860-1970 originally by Daniel Blum c.1953 ; expanded edition c.1970"]}, {"page": "George Graves (actor)", "response": ["In 1925, Graves made the first of many broadcasts for the BBC.\"Broadcasting\", The Times, 9 November 1925, p. 22 His first new musical comedy of the 1920s was in 1926, when Robert Courtneidge directed Lehár's The Blue Mazurka on tour and then at Daly's, with Gladys Moncrieff and Bertram Wallis. The Times thought Graves not altogether comfortable in the show: \"His methods are not quite suited to the sentimental humours of the piece.\"\"Daly's Theatre – 'The Blue Mazurka'\", The Times, 21 February 1927, p. 10 Graves appeared on Broadway several times, in 1907, 1929 and in the early 1930s. Graves's daughter, Georgina, died in 1930 at the age of 23.\"Well Known Actor's Loss\", Western Daily Press, 17 December 1930, p. 4 He returned to the stage the following year where he appeared in a revival of Florodora at Daly's.\"Daly's Theatre – 'Florodora'\", The Times, 30 June 1931, p. 10 In 1932 he once again played Popoff in The Merry Widow.\"Hippodrome – 'The Merry Widow'\", The Times, 30 September 1932, p. 10"]}, {"page": "The Wandering Jew (1933 film)", "response": ["* Bertram Wallis as Prince Bohemund of Tarentum"]}, {"page": "The Cost of a Kiss", "response": ["The Cost of a Kiss is a 1917 British silent drama film directed by Adrian Brunel and starring Bertram Wallis, Marjorie Day and Edward Cooper. It marked the feature film debut of Brunel who went on to become a leading British director of the 1920s. It was the only film produced by Mirror Films, a company set up by Brunel and the screenwriter H. Fowler Mear.", "* Bertram Wallis as Lord Darlington"]}, {"page": "Victory and Peace", "response": ["* Bertram Wallis as Bob Brierley"]}, {"page": "Bertram (name)", "response": ["*Bertram Wallis (1874-1952), English actor and singer"]}, {"page": "Zig-Zag!", "response": ["Zig-Zag! was a revue staged at the London Hippodrome, London during World War I. It was devised by Albert de Courville, Wal Pink and George Arnold, with music by Dave Stamper (with arrangements and orchestrations by the musical director, Julian Jones), lyrics by Gene Buck, and additional songs by George M. Cohan. The revue opened on 31 January 1917 starring George Robey, Daphne Pollard, Cicely Debenham, Shirley Kellogg, Marie Spink and Bertram Wallis. It ran for 648 performances.\"Zig-Zag!\", The Guide to Musical Theatre, accessed 2 April 2014"]}, {"page": "1910 in British music", "response": ["*19 February – The Balkan Princess, by Frederick Lonsdale and Frank Curzon, with lyrics by Paul Rubens and Arthur Wimperis, and music by Paul Rubens, opens at the Prince of Wales Theatre, starring Isabel Jay and Bertram Wallis; it runs for 176 performances."]}, {"page": "List of fictional princes", "response": ["|Portrayed by Bertram Wallis."]}]}}