{"wiki_id": "http://www.wikidata.org/entity/Q4892066", "itemLabel": "Berkeley Moynihan, 1st Baron Moynihan", "itemDescription": "British Army general and surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/Berkeley_Moynihan,_1st_Baron_Moynihan", "wikipedia_page": {"main": "Berkeley George Andrew Moynihan, 1st Baron Moynihan    (2 October 1865 – 7 September 1936), known as Sir Berkeley Moynihan, 1st Baronet, from 1922 to 1929, was a noted British abdominal surgeon.", "link_mentions": [{"page": "Andrew Moynihan", "response": ["His son became a prominent surgeon being raised to the peerage as Berkeley Moynihan, 1st Baron Moynihan."]}, {"page": "Leeds General Infirmary", "response": ["*Berkeley Moynihan, 1st Baron Moynihan, Pioneer in abdominal surgery."]}, {"page": "List of people from Leeds", "response": ["*Berkeley Moynihan, 1st Baron Moynihan KCB,  - British Major-General of the First World War; surgeon"]}, {"page": "Berkeley George Andrew Moynihan, 1st Baron Moynihan", "response": ["#REDIRECT Berkeley Moynihan, 1st Baron Moynihan"]}, {"page": "List of people educated at Christ's Hospital", "response": ["*Berkeley Moynihan, 1st Baron Moynihan – Abdominal surgeon"]}, {"page": "Berkeley George Andrew Moynihan", "response": ["#Redirect Berkeley Moynihan, 1st Baron Moynihan"]}, {"page": "Patrick Moynihan, 2nd Baron Moynihan", "response": ["Moynihan was born in Leeds in 1906, the only son of the surgeon Berkeley Moynihan, 1st Baron Moynihan.  He studied law and became a barrister at Lincoln's Inn.  He then became a stockbroker, moving to New York City, where he was active during the Wall Street Crash, then joined the New York Stock Exchange in 1932.\"Obituary: Lord Moynihan\", The Guardian, 1 May 1965 He succeeded his father as 2nd Baron Moynihan in 1936.Leigh Rayment's Peerage Page"]}, {"page": "Charles Thackray", "response": ["The company bought a sterilizer in 1906 meant to develop another side to the business, supplying sterilized dressings to the Leeds General Infirmary, the nearby Women's and Children's Hospital and neighbouring nursing homes.  The early years of the firm coincided with major advances in surgical techniques. Leeds was a centre of high-calibre surgeons, many of whom made their names at the Infirmary; best known was Berkeley Moynihan, 1st Baron Moynihan, who achieved worldwide recognition for his contribution to abdominal surgery. It was Moynihan who first suggested to Charles Thackray that he should make instruments; and the firm, with its experience in repairs at their premises just across the road, was well placed to do so. By 1914 Thackray's was employing 25 people, including eight instrument makers and three full-time representatives. Salesmen visited customers over a wide area, supplying wholesale pharmaceuticals not only to hospitals and nursing homes but also to general practitioners serving rural areas. The War Office's acceptance of Thackray's ‘Aseptic’ range as standard field dressings was important to the firm, both ensuring large contracts for drugs and sundries. By 1918 Thackray's employed fourteen instrument makers, out of a total workforce of 32. In the 1930s the firm began to make its own hospital sterilizers, operating tables and other items of theatre furniture."]}, {"page": "Berkeley Moynihan", "response": ["#REDIRECT Berkeley Moynihan, 1st Baron Moynihan"]}]}}