{"wiki_id": "http://www.wikidata.org/entity/Q4893557", "itemLabel": "Bernard Quaife", "itemDescription": "English cricketer (1899-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Quaife", "wikipedia_page": {"main": "Bernard William Quaife (24 November 1899 – 27 November 1984) was an English first-class cricketer who played more than 300 matches between the wars. He played first for Warwickshire, but later found much more success at Worcestershire, where (unlike at his original county) he became the usual wicket-keeper. He was the son of England Test player Willie Quaife.\nQuaife was educated at Solihull School.He made his first-class debut for Warwickshire against Somerset at Bath in June 1920; he scored 11 and 20.\nHe played off and on for the next couple of years, though made no significant scores. One remarkable incident occurred in 1922, when Warwickshire played Derbyshire: Billy Bestwick and his son Robert bowled for Derbyshire against Willie Quaife and his son Bernard.He had a better year in 1923, playing regularly and almost making a maiden hundred against Northamptonshire: he was 99 not out in the first innings when he ran out of partners.\nHe also took the first of his small haul of wickets when he dismissed Worcestershire's William Fox in late May.\nHowever, this season was to be a one-off: the 704 runs he made easily exceeded the aggregate from his other six summers at Edgbaston, and after 1926 he left Warwickshire.\nQuaife played not at all in 1927, making his Worcestershire debut the following June against Sussex and hitting 77 not out in the first innings.\nHe ended the year with over 900 first-class runs at a little under 26, including his long-awaited first century: 136 not out versus Glamorgan at the start of August.\nQuaife captained Worcestershire for the first time in this game, as he was to do frequently later in his career. He was not at this point the regular wicket-keeper. That position did not fall to him until 1929, there then being no keeper already in the side,\nthough he did stand in two other matches in 1928.\nFrom 1929 until the end of his career in 1937, Quaife was a regular in the Worcestershire side. His batting, said his Wisden obituarist, was \"solid and consistent rather than brilliant\",\nbut he still managed to pass a thousand runs for the season on two occasions, in 1933 and 1935, and to score two further hundreds. He made 107 against Middlesex in 1931, sharing a fourth-wicket stand of 277 with Harold Gibbons (183);\nas of 2008 this remains the record Worcestershire partnership against Middlesex for any wicket.\nHe also struck 109 versus Leicestershire in 1935.By 1937, Syd Buller had taken over behind the stumps for Worcestershire, and Quaife was coming under pressure from other, younger players. He retired at the end of the season, although he acted as captain for a large number of games in the absence through illness of usual captain Charles Lyttelton for most of the summer.\nApart from his Test-playing father, Quaife had one other notable cricketing relative: his uncle, Walter Quaife, played over 200 first-class games, mainly for Sussex and Warwickshire, between 1884 and 1901.", "link_mentions": {}}}