{"wiki_id": "http://www.wikidata.org/entity/Q4895168", "itemLabel": "Bert Kirby", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bert_Kirby", "wikipedia_page": {"main": "Bert Kirby (2 December 1908 – 1975) was an English flyweight boxer, who became British flyweight champion in 1930.", "link_mentions": [{"page": "Benny Lynch", "response": ["In March 1933 he began an unbeaten run that would last three years. He beat Bert Kirby on points in October 1933, and in January 1934 beat Jim Brady in an eliminator for the Scottish Area flyweight title, beating Jim Campbell in May to take the title. He successfully defended the title against Campbell a month later. Lynch rounded off the year with further wins over opponents including Maurice Huguenin, Jim Brady, Valentin Angelmann, and Pedro Ruiz.", "|align=left| Bert Kirby"]}, {"page": "Jackie Brown (English boxer)", "response": ["In October 1929, he won the vacant British flyweight title, knocking out Bert Kirby in three rounds. The BBBofC subsequently recognised Brown as the World Champion, succeeding the later Johnny Hill, and received confirmation from the New York State Athletic Commission that they were willing to allow him to defend the title in the US. In March 1930, he defended the British title against Kirby, and was knocked out in the third round. In February 1931, he met Kirby for the third time, winning back the title with fifteen-round points decision.", "|align=left| Bert Kirby", "|align=left| Bert Kirby", "|align=left| Bert Kirby", "|align=left| Bert Kirby"]}, {"page": "Cuthbert Taylor", "response": ["On returning to Wales he turned professional fighting Manchester's Jackie Brown at Merthyr Tydfil on 29 December 1928. The contest ended in a draw, which was followed by his first professional win, over Lud Abella and a loss to Phineas John. By May 1929 Taylor was invited to fight at the National Sporting Club in London, losing by points in a 15-round match against Bert Kirby."]}, {"page": "List of British flyweight boxing champions", "response": ["|align=left | Bert Kirby"]}, {"page": "Dick Corbett", "response": ["According to his traceable fight record Corbett remained undefeated between 1926 (the year of his pro debut) and 1927. His first defeat was at the hands of future British flyweight champion, Bert Kirby. Dick fought and beat Willie Smith while defending the Empire bantamweight title. Dick fought and beat Johnny King for the vacant British bantamweight title and the Commonwealth (British Empire) bantamweight title, and would fight Johnny King a further four times. In their second bout Corbett lost his British and Commonwealth bantamweight titles to King, but he regained both titles in their third meeting. Their fourth and fifth fights were both draws and so left Corbett the title holder. Corbett also won the British (Southern Area) Featherweight Title by defeating Dave Crowley."]}, {"page": "Nipper Pat Daly", "response": ["During 1928 he fought 25 times, defeating many of Britain's leading flyweights, plus the reigning flyweight champion of Italy, Giovanni Sili. A points win over top British flyweight title contender (and future British flyweight champion) Bert Kirby, put Daly in line for a shot at the title, then held by Leith's Johnny Hill. But by late 1928 Daly had outgrown the flyweight class and did not get a title shot. By early 1929 he had moved up to bantamweight.", "|style=\"text-align:left;\"| Bert Kirby"]}, {"page": "Phineas John", "response": ["1929 started with a loss through disqualification to Billy Clarke, before recording seven straight wins, including a victories over Cuthbert Taylor and Bert Kirby, and a successful defence of his flyweight title to Merthyr fighter Jerry O'Neil. During this period, John and his brother Eddie, who was also fighting at flyweight, were classed as the highest ranked fighters in the Welsh Area and a fight for the title was considered between them. The Welsh Boxing Association wrote to the British Boxing Board of Control who decided the fight should not take place. His winning streak was stopped on 22 April 1929, when he faced Jackie Brown at the National Sporting Club. John lost on points to Brown, who later that year would become British flyweight champion. John faced further disappointment that year when he lost his Welsh flyweight title to Freddy Morgan on 22 July."]}, {"page": "Fred Dyer", "response": ["After retiring from fighting Dyer ran various boxing gyms in London, successfully managing British flyweight champion Bert Kirby. Dyer then became a physical culture coach and was at the forefront of a diet fad in the 1920s based on fruit and vegetable drinks. Little is known of his life after the Second World War and he faded into anonymity.", "After retiring from boxing, a decision forced on him by his ailing knee, Dyer focused on his theatre appearances. His voice though, was not as it once was, and he strained to reach the higher notes of his range and bookings began to dry up. Dyer then refocussed on boxing, but this time as a manager. In the 1920s he moved to London, where he set himself up as a physical culture expert and ran a small stable of fighters. The three fighters training under him were Bristolians George Rose and Reggie Hobbs and most notably Bert Kirby from Birmingham. Kirby went on to become the British flyweight champion when he took the title from Jackie Brown in 1930. Dyer also ran a gym for gentleman on the Strand, which was used by fighters such as Bantamweight champion Teddy Baldock and American Packey McFarland who Dyer faced when the two men were boxing instructors in the US Army. The gym was later demolished to make way for a new hotel and Dyer was forced to find a new location."]}, {"page": "Young chocolate", "response": ["#REDIRECT Bert Kirby#Career"]}, {"page": "Young Chocolate", "response": ["#redirectBert Kirby#Career"]}]}}