{"wiki_id": "http://www.wikidata.org/entity/Q4895338", "itemLabel": "Bert Tindill", "itemDescription": "English footballer (1926-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bert_Tindill", "wikipedia_page": {"main": "Herbert \"Bert\" Tindill (31 December 1926 – 10 July 1973) was an English footballer who played as an inside forward. He made over 550 Football League appearances in the years after the Second World War.", "link_mentions": [{"page": "John Atyeo", "response": ["Bristol City spent another season in 1957–58 struggling to avoid dropping into the relegation places. A poor run in mid season of only a single win in 14 matches between mid November and the start of March 1958 prompted a change of manager with Pat Beasley sacked on 6 January. There followed a three-week spell of caretaker management until Harry Dolman secured Peter Doherty as the new manager from Doncaster Rovers whom Dolman had first sought some nine years earlier. Doherty was quick to sign inside right Bert Tindill from Doncaster Rovers for £6,400 on 3 February and seven wins in the last 12 games lifted the \"Robins\" to safety and a 17th-place finish in the Second Division. The forward line had a distinctly more stable look in 1957–58 with wingers Hinshelwood and Watkins, Atyeo at centre forward and Etheridge at inside left. Tommy Burden, Curtis, Eisentrager and latterly Tindill also all featured in short spells across the forward line. Atyeo was the only ever present player with 42 appearances and ended as leading scorer with 23 goals including a hat-trick in a 3–0 win at Sheffield United. Tindill scored ten goals in only 14 appearances including successive hat-tricks in April wins v Barnsley and at Fulham. In the FA Cup the 5th round tie v Bristol Rovers at Ashton Gate drew a crowd of 39,160 but resulted in a 3–4 defeat to the local rivals. Atyeo scored twice in a mid season friendly 4–3 win over Tottenham Hotspur.", "Bristol City started 1959–60 poorly despite the club record fee signing of left wing pairing Malcolm Graham and Johnny McCann from Barnsley for a combined £20,000 with Bert Tindill leaving in the opposite direction. Other additions of left half Tommy Casey from Newcastle United and inside forward Tommy Cavanagh from Doncaster Rovers together with the return of Jimmy Rogers from Coventry City all gave City fans hope of a good season but by mid September the side were bottom of the table and between 21 November 1959 and the end of the season the \"Robins\" never rose above the two relegation places eventually being relegated as 22nd and bottom of the table. The season was beset by injury with McCann breaking his leg in Boxing Day match and Graham scoring 8 goals from only 14 appearances through persistent knee injuries. Atyeo finished a disappointing season as one of only two ever presents in the team, the other being the goalkeeper Tony Cook. Atyeo was also joint top scorer for Bristol City with 16 goals from his 42 appearances. Rogers also scored 16 goals from only 31 appearances on his return to Ashton Gate. Manager Peter Doherty was dismissed on 15 March and relegation confirmed by defeat at Leyton Orient on 23 April. The new manager Fred Ford was not appointed until July 1960."]}, {"page": "Tindill", "response": ["*Bert Tindill (1926–1973), English footballer"]}, {"page": "List of Doncaster Rovers F.C. records and statistics", "response": ["* Most consecutive League appearances: Bert Tindill, 139 (11 September 1948 – 24 November 1951)"]}]}}