{"wiki_id": "http://www.wikidata.org/entity/Q4899410", "itemLabel": "Beverley Goodway", "itemDescription": "photographer (1943-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Beverley_Goodway", "wikipedia_page": {"main": "Beverley Goodway (13 October 1943 – 4 November 2012) was an English photographer known for his glamour shots which were published on Page 3 of The Sun newspaper in the United Kingdom.\nHe began his career with a news agency in 1965 after he was turned down for a place at medical school. Goodway subsequently worked for the Daily Mail and The Times. He joined The Sun in 1968, subsequently photographing models for Page Three from 1970. He retired in 2003.", "link_mentions": [{"page": "Page 3", "response": ["On 17 November 1970, the tabloid celebrated its first anniversary with a photograph of Singapore-born model Stephanie Khan in her \"birthday suit\" (i.e. in the nude). Sitting in a field, backlit by the sun, with one of her breasts fully visible from the side, Khan was photographed by Beverley Goodway, who became The Suns principal Page 3 photographer until he retired in 2003."]}, {"page": "Kathy Lloyd", "response": ["Lloyd left school at 16 and worked at the Top Shop clothing store in Liverpool before venturing into modelling. Some of her early photos were taken by Beverley Goodway, a famous UK glamour photographer who persuaded her to send some photos to  The Sun. She first appeared as a Page 3 girl in The Sun in early 1986, at the age of 18, where she quickly became a regular and voted page 3 girl of the year three times in 1986, 1990 and 1994."]}, {"page": "Suzanne Mizzi", "response": ["After leaving school at 15, Mizzi opened a clothes shop in Bethnal Green, London, where she was discovered by a photographer while working. She made her Page 3 debut in 1984 aged 17 and immediately endeared herself to the public, although it took her parents a while to become comfortable with her career choice. In the first six months of her modelling career, Mizzi shot 26 calendars and was in high demand for personal appearances. Her success was helped by Page 3 photographer Beverley Goodway, whose pictures helped to establish her career. She could command fees of over £1,000 for a personal appearance."]}, {"page": "Goodway", "response": ["*Beverley Goodway (1943–2012), British photographer "]}, {"page": "2012 in the United Kingdom", "response": ["**Beverley Goodway, 69, glamour photographer."]}, {"page": "Deaths in November 2012", "response": ["*Beverley Goodway, 69, British glamour photographer, prostate cancer.Beverley Goodway"]}, {"page": "Alison Webster (photographer)", "response": ["Alison Valda Webster was the official Page 3 photographer for The Sun newspaper. She has worked in the British national newspaper industry for 30 years. Following the retirement of longtime principal Page 3 photographer Beverley Goodway in 2003, Webster took over the role in 2005. Her work on Page 3 came to an end when The Sun discontinued the Page 3 print edition in January 2015 and closed down the Page3.com website in 2017."]}, {"page": "Beverly (name)", "response": ["*Beverley Goodway (1943–2012), British glamour photographer"]}]}}