{"wiki_id": "http://www.wikidata.org/entity/Q4893252", "itemLabel": "Bernard Ingham", "itemDescription": "British journalist (born 1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Ingham", "wikipedia_page": {"main": "Sir Bernard Ingham (born 21 June 1932) is a British journalist and former civil servant. He was Margaret Thatcher's chief press secretary throughout her time as Prime Minister of the United Kingdom from 1979 to 1990. He was knighted in Thatcher's 1990 resignation honours list.\n\n", "link_mentions": [{"page": "June 21", "response": ["*1932 – Bernard Ingham, English journalist and civil servant "]}, {"page": "Hillsborough disaster", "response": ["===Bernard Ingham===", "In 1996, Sir Bernard Ingham, former press secretary to former Prime Minister Margaret Thatcher, caused controversy with his comments about the disaster. In a letter addressed to a victim's parent, Ingham wrote that the disaster was caused by \"tanked up yobs\". In another letter written to a Liverpool supporter, also written in 1996, Ingham remarked that people should \"shut up about Hillsborough\". On the day of the inquest verdict, Ingham refused to apologise or respond to the previous comments he made, telling a reporter, \"I have nothing to say.\" There have since been calls to have Ingham stripped of his knighthood."]}, {"page": "Michael Heseltine", "response": ["Thatcher discussed sacking Heseltine with close colleagues over Christmas; but, as she later admitted in her memoir, refrained from doing so as he was too popular and important as a political figure. She also decided against sending him a letter threatening him with the sack, which had been drafted. Instead she asked Mayhew to write to Heseltine complaining of what he thought were \"material inaccuracies\" in his letter to Horne, and asking Heseltine to write to Horne again, correcting them. Mayhew's letter of rebuke to Heseltine – marked \"Confidential\" – reached Heseltine at lunchtime on Monday 6 January and was immediately leaked to the press by Colette Bowe, an information officer at the Department of Trade and Industry, at Brittan's request (some years later he admitted that he acted on the \"express\" instructions of Charles Powell and Bernard Ingham, Thatcher's two senior advisers). Heseltine was able to produce extra documents which Mayhew accepted as backing up his letter to Horne, but not before The Sun had called Heseltine \"You Liar!\" on its front page (the newspaper was later required to make a donation to charity in lieu of libel damages).Crick 1997, pp. 283–5.", "Heseltine wrote a six-page public letter to his local Association chairman, calling for more regard for the wide range of opinions in the party. Heseltine then left for the Middle East to visit King Hussein of Jordan and Israeli Prime Minister Yitzhak Shamir. Association officers sent him a 97-word reply (5 November) saying that they supported Thatcher's leadership. The party's regional agent had been present at their meeting, but they insisted he had not interfered with their reply. Round about the same time Thatcher's press secretary Bernard Ingham briefed journalists that Heseltine had \"lit the blue touch paper then retired\", although he denied having demanded that Heseltine \"put up or shut up\"; the Daily Mail front page asked \"does he have the courage?\" and The Times commented that if he did not throw his hat into the ring he would deserve to have it \"stuffed down his throat\". Thatcher brought the annual leadership election forward by a fortnight, causing Alastair Campbell  to write in the Daily Mirror that \"Tarzan the Tory Ape Man had made a right monkey of himself\". A week later, after meeting Heseltine, the constituency officers issued another letter saying that they regretted how their reply had been construed as criticism."]}, {"page": "Yes Minister", "response": ["Thatcher performed a short sketch with Eddington and Hawthorne on 20 January 1984 at a ceremony where the writers were presented with an award from Mary Whitehouse's NVLA, an event commemorated on the cover of the satirical magazine Private Eye. Authorship of the sketch is unclear. In Britain's Best Sitcom, Bernard Ingham says that he wrote it; other sources give Thatcher sole credit, while Michael Cockerell says that she wrote it with Ingham's help. Another source gives renegade credit to Charles Powell. The actors, who were starring in separate West End plays at the time, were not enthusiastic at the idea and asked Lynn to \"get them out\" of it. The writer, however, was not in a position to help. Hawthorne says he and Eddington resented Thatcher's attempts to \"make capital\" from their popularity. Ingham says that it \"went down a bomb\", while Lynn brands it a \"dreadful sketch\" that was only funny because Thatcher was doing it. Accepting the award from the NVLA, Lynn thanked Thatcher \"for taking her rightful place in the field of situation comedy.\" Everyone, except the Prime Minister, laughed.", "The British Prime Minister of the time, Mrs Margaret Thatcher was so taken by the show that she wrote a sketch herself (together with her Press Secretary Bernard Ingham). In it she played herself as the Prime Minister, Paul Eddington played Jim Hacker and Nigel Hawthorne played Sir Humphrey. It was played on the National Viewers and Listeners Association Awards 1984 (and can be viewed on YouTube).\"The Thatcher Script – The Yes (Prime) Minister Files\" webpage"]}, {"page": "Purley, London", "response": ["*Sir Bernard Ingham, Margaret Thatcher's former press secretary, lives in Purley."]}, {"page": "Hebden Bridge", "response": ["*Bernard Ingham, Chief Press Secretary to Margaret Thatcher, was educated at Hebden Bridge Grammar School."]}, {"page": "John Sergeant (journalist)", "response": ["One of his most memorable moments was when he waited outside the British embassy in Paris for Thatcher, in the hope of hearing her reaction to the first ballot in the party leadership contest of 1990, only to be pushed aside by her press secretary, Sir Bernard Ingham, when Thatcher emerged from the building. For this broadcast, Sergeant won the British Press Guild award for the most memorable broadcast of the year, beating Paul Gascoigne who had been nominated for bursting into tears during the 1990 Football World Cup Semi-final against West Germany."]}, {"page": "Reform Club", "response": ["* Sir Bernard Ingham"]}, {"page": "10 Downing Street", "response": ["* The No. 10 Press Office (press and public relations) – The press office has grown in significance as media attention on the PM has intensified. Thatcher's press secretary Bernard Ingham was one of her most important advisors. Alastair Campbell's influence as Blair's press secretary was even greater;"]}, {"page": "Mary Whitehouse", "response": ["In 1984, the NVALA gave an award to Antony Jay and Jonathan Lynn, writers of the situation comedy Yes Minister and Thatcher, who had declared the show her favourite programme, presented the award. Whitehouse sat laughing next to Thatcher as the Prime Minister acted out a sketch, written principally by her press secretary Bernard Ingham, alongside a reluctant Paul Eddington and Nigel Hawthorne, the lead actors in the programme. In accepting the award, Lynn thanked Whitehouse and the NVALA and congratulated Thatcher for \"taking her rightful place in the world of situation comedy\"."]}, {"page": "Geoffrey Howe", "response": ["In the following month of July 1989, the then little-known John Major was unexpectedly appointed to replace Howe as Foreign Secretary, and the latter became Leader of the House of Commons, Lord President of the Council and Deputy Prime Minister. In the reshuffle, Howe was also offered, but turned down, the post of Home Secretary. Although attempts were made to belittle this aspect, Howe's move back to domestic politics was generally seen as a demotion, especially after Thatcher's press secretary Bernard Ingham belittled the significance of the deputy prime minister appointment, saying that the title had no constitutional significance, at his lobby briefing the following morning."]}, {"page": "Robert Harris (novelist)", "response": ["Harris's first book, A Higher Form of Killing (1982) with fellow BBC journalist Jeremy Paxman, was a study of chemical and biological warfare. Other non-fiction works followed: Gotcha! The Government, the Media and the Falklands Crisis (1983) covering the Falklands War; The Making of Neil Kinnock (1984); Selling Hitler (1986), an investigation of the Hitler Diaries scandal; and Good and Faithful Servant (1990), a study of Bernard Ingham, Margaret Thatcher's press secretary.", "* Good and Faithful Servant: The Unauthorized Biography of Bernard Ingham. London: Faber and Faber, December 1990 "]}, {"page": "Leon Brittan", "response": ["In 1989, Brittan revealed in a Channel 4 programme that two senior Downing Street officials, Bernard Ingham and Charles Powell, had approved the leaking of the letter from the Solicitor General. Brittan's claim led to calls from some Labour MPs for there to be a new inquiry into the Westland affair."]}, {"page": "Westland affair", "response": ["Over Christmas, Thatcher discussed with close colleagues the option of sacking Heseltine, as Brittan had urged her to do (Chief Whip John Wakeham cautioned against), but—as she later admitted in her memoirs—she shrank from doing so as he was too popular and weighty a political figure. Thatcher and ministerial colleagues spent two and a half hours writing three successive drafts of a letter threatening Heseltine with the sack, but did not send it as her press adviser Bernard Ingham advised that Heseltine might use it an excuse to resign.", "Sir Robert Armstrong, the Cabinet Secretary, held an inquiry into the leaking of Mayhew's letter and reported his findings to the Prime Minister on 21 January. Armstrong concluded that Brittan had told Bowe to leak Mayhew's letter through a telephone conversation to Roger Mogg, Brittan's private secretary. Thatcher is said to have asked Brittan four times: \"Leon, why didn't you tell me.\" Havers, who demanded the inquiry, later claimed: \"Unless the PM is the most marvellous actress I've ever seen in my life she was as shocked as anybody that in fact it was on Leon Brittan's instructions.\" At the time Brittan claimed he had misunderstood Thatcher's wishes but later (on the television programme The Thatcher Factor on 7 April 1989) admitted that he had acted on the \"express\" instructions of Charles Powell and Bernard Ingham, Thatcher's two senior advisers. On 23 January, Thatcher had to make a speech to the Commons on Armstrong's inquiry. The following day's Glasgow Herald described Thatcher's speech as \"lackluster\". Scottish Conservative MP and former Trade Minister, Alex Fletcher responded by saying that \"the integrity of the Cabinet\" was at stake and asked Thatcher if she thought her statement had \"enhanced the integrity of your Cabinet?\", reportedly causing Mayhew and Havers, to wince. "]}, {"page": "John Biffen", "response": ["On 9 February 1986, he said that Toryism was \"not a raucous political faction\" and after the Conservative Party's losses in the 1986 local government elections, and poor performances in the two parliamentary by-elections held simultaneously, Biffen was interviewed on Weekend World by Brian Walden on 11 May as the government's spokesman. He called the results \"Black Thursday\", said the Conservatives needed to fight the next general election on a \"balanced ticket\" and that \"no one seriously supposes that the Prime Minister would be Prime Minister throughout the entire period of the next Parliament\".John Campbell, Margaret Thatcher: The Iron Lady (Jonathan Cape, 2003), p. 448. This alienated him from Thatcher and resulted in his being dropped from the Cabinet after the 1987 general election. His dismissal was no surprise, in that Thatcher's press secretary Bernard Ingham had already famously called him a \"semi-detached\" member of the Cabinet. Thatcher in her memoirs described Biffen's desire for a balanced ticket as \"foolish\" and \"a recipe for paralysis.\"Margaret Thatcher, The Downing Street Years (HarperCollins, 1993), p. 422. In the month after his sacking Biffen likened Thatcher's governing style to that of a \"Stalinist regime\".The Sunday Telegraph (London), 5 July 1987"]}, {"page": "Percy Shaw", "response": ["In 2005, he was listed as one of the 50 greatest Yorkshire people in a book by Bernard Ingham."]}, {"page": "Mark Thatcher", "response": ["Sir Bernard Ingham, the Prime Minister's press secretary, suggested that he could best help the government win the 1987 general election by leaving the country. Margaret Thatcher's biographer, David Cannadine, stated that Mark Thatcher \"traded shamelessly on his mother's name\" and that he \"continued to attract controversy and investigation from the tax authorities\", much to his mother's embarrassment. Alan Clark mentions the \"Mark problem\" in his published diaries. He moved to Texas, where he worked for David Wickins of Lotus Cars and British Car Auctions and met his first wife in 1987. "]}, {"page": "Cloud cuckoo land", "response": ["The phrase has been used by British and American politicians as well as writers.  Margaret Thatcher used this phrase in the 1980s: \"The ANC is a typical terrorist organisation... Anyone who thinks it is going to run the government in South Africa is living in cloud-cuckoo land.\"  Bernard Ingham, Margaret Thatcher's spokesman, who, when asked if the ANC might overthrow the government of South Africa by force, replied: \"It is cloud-cuckoo land for anyone to believe that could be done\". MP Ann Widdecombe used the phrase in a debate on drug prohibition with a representative of Transform Drug Policy Foundation: \"...it is cloud cuckoo land to suggest that [people who don't currently use heroin would not start using it if it became legal]\"."]}, {"page": "Apartheid", "response": ["Other Western countries adopted a more ambivalent position. In Switzerland, the Swiss-South African Association lobbied on behalf of the South African government. The Nixon administration implemented a policy known as the Tar Baby Option, pursuant to which the US maintained close relations with the Apartheid South African government. The Reagan administration evaded international sanctions and provided diplomatic support in international forums for the South African government. The United States also increased trade with the Apartheid regime, while describing the ANC as \"a terrorist organisation.\"Joseba Zulaika and William Douglass, \"Terror and Taboo\" (Routledge, 1996), p. 12  Like the Reagan Administration, the government of Margaret Thatcher termed this policy \"constructive engagement\" with the apartheid government, vetoing the imposition of UN economic sanctions. U.S. government justification for supporting the Apartheid regime were publicly given as a belief in \"free trade\" and the perception of the anti-communist South African government as a bastion against Marxist forces in Southern Africa, for example, by the military intervention of South Africa in the Angolan Civil War in support of right-wing insurgents fighting to topple the government. The U.K. government also declared the ANC a terrorist organisation, and in 1987 Thatcher's spokesman, Bernard Ingham, famously said that anyone who believed that the ANC would ever form the government of South Africa was \"living in cloud cuckoo land\". The American Legislative Exchange Council (ALEC), a conservative lobbying organisation, actively campaigned against divesting from South Africa throughout the 1980s.ALEC's \"Institutional Corruption\", From Backing Apartheid to Assault on Clean Energy, Public Sector. Democracy Now! 11 December 2013."]}, {"page": "1990 Conservative Party leadership election", "response": ["The pro-European former Cabinet minister Michael Heseltine had resigned from the Cabinet over the Westland affair in January 1986 and had been conducting himself as a Prime Minister in waiting, critical of Thatcher's leadership, ever since. He now wrote a six-page public letter to his local Association chairman, calling for more regard for the wide range of opinions in the party before leaving for a trip to the Middle East. His Association officers sent him a 97-word reply on 5 November saying that they supported Thatcher's leadership. The party's regional agent had been present at their meeting, although they insisted he had not interfered with their reply. At about the same time, Thatcher's press secretary Bernard Ingham briefed journalists that Heseltine had \"lit the blue touch paper then retired\", although he denied having demanded that Heseltine \"put up or shut up\"; Heseltine was also taunted along similar lines by the pro-Conservative press, including the Daily Mail and The Times. Thatcher brought the annual leadership election forward by a fortnight."]}, {"page": "Wilberforce (cat)", "response": ["According to Bernard Ingham, the former press secretary to Margaret Thatcher, Wilberforce was a normal cat for whom Thatcher once bought \"a tin of sardines in a Moscow supermarket\"."]}, {"page": "Kevin McNally", "response": ["| 2020|| || Bernard Ingham"]}, {"page": "Political history of the United Kingdom (1979–present)", "response": ["By winning the 1987 general election, by another landslide on the economic boom (with unemployment finally falling below 3,000,000 that spring) and against a stubbornly anti-nuclear Labour opposition (now led by Neil Kinnock Following Michael Foot's resignation four years earlier), she became the longest serving Prime Minister of the United Kingdom since the 1820s. Most newspapers supported her – with the exception of The Daily Mirror and The Guardian — and were rewarded with regular press briefings by her press secretary, Bernard Ingham."]}, {"page": "Sir bernard ingham", "response": ["#REDIRECT Bernard Ingham"]}, {"page": "David Wolfson, Baron Wolfson of Sunningdale", "response": ["Wolfson was director of Great Universal Stores (GUS) from 1973 to 1978 and from 1993 to 2000, and chairman from 1996 to 2000. The retailer had been founded by his uncle Isaac Wolfson as a mail order clothing company. He was first introduced to Margaret Thatcher by the Conservative Party treasurer Alistair McAlpine in 1975. In 1978 and 1979 he was Secretary to the Shadow Cabinet and between 1979 and 1985 Chief of Staff of the Political Office, 10 Downing Street. In that role he interviewed Bernard Ingham in 1979, before Ingham was made Thatcher's press secretary. The first official Chief of Staff in Number 10, he was the sole holder of the office until Jonathan Powell in 1997."]}, {"page": "Kill the Messenger", "response": ["* Kill the Messenger...Again, a nonfiction book by Bernard Ingham"]}, {"page": "Calder High School", "response": ["* Sir Bernard Ingham, journalist and former civil servant"]}, {"page": "Premiership of Margaret Thatcher", "response": ["Thatcher thought Heseltine too powerful and popular a figure to sack. After a period in early January 1986 in which Heseltine and the Thatcher/Brittan camp leaked material damaging to each other's case to the press, Cabinet agreed (9 January) that all statements on the matter, including repetitions of those already made, must be cleared through the Cabinet Office. Heseltine resigned and walked out of the meeting in protest, claiming that Thatcher had broken the conventions of cabinet government. He remained an influential critic and potential leadership challenger and would eventually prove instrumental in Thatcher's fall in 1990. Brittan was then forced to resign for having, earlier that month and with the agreement of Thatcher's press adviser Bernard Ingham, ordered the leak of a confidential legal letter critical of Heseltine. For a time, Thatcher's survival as prime minister seemed in doubt, but her involvement in the leak remained unproven, and she survived after a poor debating performance in the Commons (27 January) by Opposition leader Neil Kinnock.", "Thatcher led her party to a landslide victory in the 1987 general election with a 102-seat majority. Her resolute personality played a key role in overcoming the well-organised, media-wise Labour campaign led by Neil Kinnock, who was weakened by his party's commitment to unilateral nuclear disarmament at a time Thatcher was helping to end the Cold War. Fleet Street (the national newspapers) mostly supported her and were rewarded with regular press briefings by her press secretary, Bernard Ingham. Polls showed that Thatcher's leadership style was more important for voters than party identification, economic concerns, and indeed all other issues. She entered the record books, becoming the longest continuously-serving prime minister since Lord Liverpool (1812–1827), and the first to win three successive elections since Lord Palmerston in 1865. On New Year's Day 1988, Thatcher became the longest-serving Prime Minister of the 20th century, having bested H.H. Asquith and Winston Churchill's records."]}, {"page": "Sir Bernard Ingham", "response": ["#REDIRECT Bernard Ingham"]}]}}