{"wiki_id": "http://www.wikidata.org/entity/Q4893086", "itemLabel": "Bernard Dunstan", "itemDescription": "British artist (1920-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Dunstan", "wikipedia_page": {"main": "Bernard Dunstan  (19 January 1920 – 20 August 2017) was a British artist, teacher, and author, best known for his studies of figures in interiors and landscapes. At the time of his death, he was the longest serving Royal Academician.", "link_mentions": [{"page": "January 19", "response": ["*1920 – Bernard Dunstan, English painter and educator (d. 2017)"]}, {"page": "Kew", "response": ["* Bernard Dunstan  RA (1920–2017) lived in Kew. He was an artist, teacher, and author, best known for his studies of figures in interiors and landscapes. At the time of his death, he was the longest serving Royal Academician."]}, {"page": "Byam Shaw School of Art", "response": ["Among those who studied at the Byam Shaw School of Art are artists such as Winifred Nicholson, Bernard Dunstan, Yinka Shonibare, Mona Hatoum, the stained glass artist Evie Hone and the wood-engraver Blair Hughes-Stanton; theatre designers including Maria Björnson, Laurence Irving and Stefanos Lazaridis; the inventor James Dyson; the actor John Standing and the musician Paul Simonon."]}, {"page": "New English Art Club", "response": ["*Bernard Dunstan"]}, {"page": "Royal West of England Academy", "response": ["Among the paintings in the permanent collection are works by artists from the Newlyn, St Ives and Bloomsbury Schools and paintings by Elizabeth Blackadder, Bernard Dunstan, Mary Fedden, Matthew Hale, David Inshaw, Derek Balmer, Anne Redpath, George Swaish and Carel Weight.", "*1974-1984 Bernard Dunstan RA"]}, {"page": "Bernard dunstan", "response": ["#REDIRECT Bernard Dunstan "]}, {"page": "City and Guilds of London Art School", "response": ["* Bernard Dunstan (R.A. painter)"]}, {"page": "Theodore Mendez", "response": ["Theodore R P Mendez (1934–1997) was an English abstract artist who taught at Camberwell College of Arts in London for over thirty years. After attending Strand School, he entered Camberwell College of Arts in 1950 as a student, where his contemporaries included Terry Frost, Howard Hodgkin, Euan Uglow, Roy Turner Durrant, Bernard Dunstan and Gillian Ayres. He returned as a teacher; and from 1976-1984 was head of the Textile Department."]}, {"page": "List of museums in Bristol", "response": ["| Royal West of England Academy || 125px || Clifton || Bristol || Art || The Royal West of England Academy (RWA) is an art gallery. It was financed by a donation of £2000 in the 1849 will of Ellen Sharples and a group of artists in Bristol, known as the Bristol Society of Artists, these were mostly landscape painters and many were well known such as William James Müller, Francis Danby, J.B. Pyne and John Syer. In 1844, when the Bristol Academy for the Promotion of Fine Arts was founded, the Bristol Society of Artists was incorporated into it. During World War II the Academy became the temporary home of various organisations including the Bristol Aeroplane Company and the U.S. Army. It was not until 1950 that the building was returned to its original function after the intervention of the then Prime Minister, Clement Attlee. Among the paintings in the permanent collection are works by artists from the Newlyn, St Ives and Bloomsbury Schools. Paintings by George Swaish, Matthew Hale, Anne Redpath, Mary Fedden, Carel Weight, Bernard Dunstan and Elizabeth Blackadder are also valued additions to the collection. The building is a grade II* listed building constructed in 1857. The interiors are by Charles Underwood and façade by JR Hirst, altered in 1912 by SS Reay and H Dare Bryan. The first floor is in 3 sections, the outer ones articulated by paired Corinthian pilasters flanking large shell head niches with statues of Flaxman and Reynolds. A large carving of 3 female figures crowns the parapet. The interior includes coloured marble."]}, {"page": "Richard Eurich", "response": ["Eurich was a shy man but formed a few lasting friendships. John Bickerdike, the sculptor, introduced him to African sculpture when he was a student in London, and Eurich and Bickerdike remained good friends in later life. Eurich was greatly influenced by Sidney Schiff, who wrote under the name Stephen Hudson, and many of his letters to him are in the Tate Archive. He had a long correspondence was the artist Edward Wadsworth. Later on, Bernard Dunstan, who also taught at Camberwell, and his wife Diana Armfield were amongst the few with whom Eurich kept in regular touch."]}, {"page": "Dunstan (surname)", "response": ["*Bernard Dunstan (1920–2017), British artist"]}, {"page": "Diana Armfield", "response": ["Armfield was born in Ringwood, Hampshire and attended Bedales School, a co-educational independent school in the village of Steep in Hampshire, from which she graduated in 1937. She has a Quaker background. Her uncle, Maxwell Armfield, was an English artist, illustrator and writer.  Armfield met her future husband Bernard Dunstan while she was at the Slade School of Fine Art. They married in 1949 and have three sons. She lives in Kew, south-west London and also has a home in Wales.", "Armfield has exhibited in London, and is particularly associated with the Browse & Darby Gallery. She had a solo show at the Tegfryn Art Gallery, Anglesey in 1975 and 1978. In 1988 she was featured in a combined retrospective with Bernard Dunstan at the Oriel 31 Gallery in Newtown and Welshpool. Armfield's work includes commissions from The National Trust in 1988 and from The Prince of Wales in 1989. Her work is held by The British Museum, the Contemporary Art Society for Wales and the Government Picture Collection."]}, {"page": "List of alumni of the Byam Shaw School of Art", "response": ["* Bernard Dunstan"]}, {"page": "2017 in the United Kingdom", "response": ["**Bernard Dunstan, 97, artist."]}, {"page": "Deaths in August 2017", "response": ["*Bernard Dunstan, 97, British artist.Bernard Dunstan"]}]}}