{"wiki_id": "http://www.wikidata.org/entity/Q4893576", "itemLabel": "Bernard Rebel", "itemDescription": "British actor (1901-1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Rebel", "wikipedia_page": {"main": "Bernard Rebel (6 October 1901, Poland – 30 September 1964, London, England) was a Polish-born British actor. His work included the role of Wormtongue in the 1955-56 BBC radio version of The Lord of the Rings.", "link_mentions": [{"page": "The Rebel (1961 film)", "response": ["* Bernard Rebel...Art dealer"]}, {"page": "The Captain's Paradise", "response": ["* Bernard Rebel – Mr Wheeler"]}, {"page": "The Lord of the Rings (1955 radio series)", "response": ["*Bernard Rebel - Wormtongue"]}, {"page": "The Curse of the Mummy's Tomb", "response": ["\"Egypt in the year 1900\". The mummy of Ra-Antef, son of Ramesses VIII, is discovered by three Egyptologists: Englishmen John Bray (Ronald Howard) and Sir Giles Dalrymple (Jack Gwillim) as well as French Professor Eugene Dubois (unbilled Bernard Rebel, who died three weeks before the film's UK premiere).  Assisting in the expedition is Professor Dubois' daughter, and Bray's fiancée, Annette (Jeanne Roland), herself an Egyptology expert.  All the artifacts are brought back to London by the project's backer, American showman Alexander King (Fred Clark), who plans to recoup his investment by staging luridly sensational public exhibits of the Egyptian treasures.  Soon after arrival, however, the mummy revives and starts to kill various members of the expedition, while it becomes evident that sinister Adam Beauchamp (Terence Morgan), a wealthy arts patron whom members of the expedition meet on the ship returning to England, harbors a crucial revelation of the mummy's past and future."]}, {"page": "Anna Karenina (1948 film)", "response": ["*Bernard Rebel as Professor Leverrin"]}, {"page": "Crook's Tour", "response": ["* Bernard Rebel as Klacken"]}, {"page": "Chance of a Lifetime (1950 film)", "response": ["*Peter Jones, Bernard Rebel and Eric Pohlmann as the Xenobians"]}, {"page": "Laughing Anne", "response": ["* Bernard Rebel – Pianist"]}, {"page": "Top Secret (1952 film)", "response": ["* Bernard Rebel - Trubiev"]}, {"page": "The Young Lovers (1954 film)", "response": ["* Bernard Rebel as Stefan"]}, {"page": "Mark of the Phoenix", "response": ["* Bernard Rebel ...  Vachek"]}, {"page": "Wheel of Fate (film)", "response": ["* Bernard Rebel   "]}, {"page": "Little Red Monkey", "response": ["* Bernard Rebel - Vinson - Spy Henchman"]}]}}