{"wiki_id": "http://www.wikidata.org/entity/Q4893447", "itemLabel": "Bernard Mordaunt Ward", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Mordaunt_Ward", "wikipedia_page": {"main": "Bernard Mordaunt Ward (20 January 1893 – 12 October 1945) was a British author and third-generation soldier most noted for his support of the Oxfordian theory of Shakespeare authorship and writing the first documentary biography of Edward de Vere, 17th Earl of Oxford.", "link_mentions": [{"page": "Bernard Ward", "response": ["*Bernard Mordaunt Ward (1893–1945), British soldier and biographer"]}, {"page": "List of Oxfordian theory supporters", "response": ["* Bernard Mordaunt Ward — military officer, author"]}, {"page": "Percy Allen (writer)", "response": ["Soon, however, Allen's views began to diverge from Looney's. Looney wrote that Allen and another follower, Bernard Mordaunt Ward, were \"advancing certain views respecting Oxford and Queen Eliz. which appear to me extravagant & improbable, in no way strengthen Oxford's Shakespeare claims, and are likely to bring the whole cause into ridicule.\"Christopher Paul, \"A new letter by J. T. Looney brought to light\", Shakespeare Oxford Newsletter, vol. 43, no. 3, pp. 8–9. PDFShapiro, James (2010), Contested Will: Who Wrote Shakespeare?, UK edition: Faber and Faber (US edition: Simon & Schuster), pp.196–210. This was the suggestion that the queen had a son by Oxford, which first appears in an appendix to The Life Story of Edward De Vere. The child is not identified. Allen argues that a passage in Two Gentlemen of Verona is a reference to the queen's pregnancy, which could easily be concealed in those days by the \"fashion of dress of great ladies\".Percy Allen, The Life Story of Edward De Vere, p. 364. The passage in 'Two Gentlemen of Verona is in Act II scene I in which Speed refers to Sylvia having a \"passing deformity\", interpreted by Allen to mean pregnancy. A later book claimed that the child was an actor named William Hughes, and then finally Allen argued that it was Henry Wriothesley, 3rd Earl of Southampton, the dedicatee of Shakespeare's poems.Helen Hackett, Shakespeare and Elizabeth: the meeting of two myths, Princeton University Press, 2009, pp.157–60"]}, {"page": "B. M. Ward", "response": ["#redirect Bernard Mordaunt Ward"]}]}}