{"wiki_id": "http://www.wikidata.org/entity/Q4892947", "itemLabel": "Bernard Braine", "itemDescription": "British Conservative Party politician, MP 1950–1992", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Braine", "wikipedia_page": {"main": "Bernard Richard Braine, Baron Braine of Wheatley, PC (24 June 1914 – 5 January 2000) was a Conservative Party politician in the United Kingdom. He was a Member of Parliament (MP) for 42 years, from 1950 to 1992, representing constituencies in Essex.", "link_mentions": [{"page": "Conservative Monday Club", "response": ["* Bernard Braine (Castle Point)"]}, {"page": "Lord Braine of Wheatley", "response": ["#redirect Bernard Braine"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Sir Bernard Braine"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["| Bernard Braine"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Sir Bernard Braine"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["Notable newcomers to the House of Commons included Edward Heath, Horace King, Fred Mulley, Bernard Braine, Harry Hylton-Foster, Iain Macleod, Gerald Nabarro, Reginald Maudling, Robert Carr, Bill Deedes, Enoch Powell, David Ormsby-Gore, Christopher Soames, Anthony Crosland, and Jo Grimond.", "|Bernard Braine"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Sir Bernard Braine"]}, {"page": "List of United Kingdom MPs: B", "response": ["* Bernard Braine (1950–1992)"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Sir Bernard Braine"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Sir Bernard Braine (1914–2000)"]}, {"page": "Bernard Richard Braine", "response": ["#REDIRECT Bernard Braine"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Bernard Braine"]}, {"page": "Castle Point (UK Parliament constituency)", "response": ["| Sir Bernard Braine"]}, {"page": "Billericay (UK Parliament constituency)", "response": ["| Bernard Braine"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Bernard Braine"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Bernard Braine"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Bernard Braine"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Bernard Braine"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Bernard Braine"]}, {"page": "Conservative government, 1957–1964", "response": ["|Bernard Braine||8 February 1961 – 16 July 1962|| ", "|Bernard Braine||16 July 1962 – 16 October 1964|| ", "|Bernard Braine||28 October 1960 – 8 February 1961|| "]}, {"page": "Repatriation of Cossacks after World War II", "response": ["Between 2 October-30 November 1989, the much publicised libel trial of Tolstoy vs. Aldington took place and ended with the jury ruling in the favour of the latter and awarding him £1.5 million. The judgement, which forced Tolstoy into bankruptcy, was widely criticized as excessive and unfair. The way in which the Ministry of Defence supplied Aldington with certain documents that were denied to Tolstoy has been an especially controversial aspect of the trial, and Tolstoy continues to maintain that he was a victim of \"the Establishment\". Tolstoy retained a loyal set of defenders consisting of the Conservative MP Bernard Braine, the philosopher Roger Scruton, the journalist Chapman Pincher, the writer Nigel Nicolson, Lord Cranborne and from farther afield Solzhenitsyn, who was living in exile in the United States at the time.Burgh, Hugo de Investigative Journalism, Milton Park, Taylor & Francis 2000 p.250 The Tolstoy vs. Aldington case attracted much publicity as the British journalist Hugo de Burgh wrote: \"From 1989 to 1993 a historical investigation became news in tabloid and broadsheet media alike as argument raged over the merits of combatants in a struggle over who might have done what over a few days in 1945. The case of \"the Cossacks\" has been perhaps the single most prominent example of historical investigation to be turned into journalism, not only in acres of newsprint devoted to the story and based upon several books on the subject, but also in a programme in the BBC historical series, Timewatch\".Burgh, Hugo de Investigative Journalism, Milton Park, Taylor & Francis 2000 p.240"]}]}}