{"wiki_id": "http://www.wikidata.org/entity/Q4898929", "itemLabel": "Betty Miller", "itemDescription": "Irish writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Betty_Miller_(author)", "wikipedia_page": {"main": "Betty Miller (née Spiro; 1910 – 24 November 1965) was an Irish author of both literary fiction and non-fiction. She wrote her first novel, The Mere Living (1933), whilst studying journalism at University College, London. Her literary reputation was established by the publication of her biography of Robert Browning (1952), which earned her election to the Royal Society of Literature. After the Second World War she wrote extensively for literary journals including Horizon, The Cornhill Magazine and The Twentieth Century. Of her seven novels, two are still in print: Farewell, Leicester Square (1941), published by Persephone Books in 2000, and On the Side of the Angels (1945), published by Capuchin Classics in 2012.\nBetty Spiro was born in Cork, Ireland, the daughter of Sara (Bergson) and Simon Spiro. Her parents were Lithuanian Jews. In 1933, she married Emanuel Miller (1892–1970), the founding father of British child psychiatry. The couple had two children: Sarah, (died 2006), and Sir Jonathan Miller (1934–2019), the theatre and opera director.", "link_mentions": [{"page": "1910 in literature", "response": ["*Betty Miller, Irish-born Jewish writer (died 1965)"]}, {"page": "1941 in literature", "response": ["*Betty Miller – Farewell, Leicester Square"]}, {"page": "1965 in literature", "response": ["*November 24 – Betty Miller, Irish-born Jewish writer (born 1910)"]}, {"page": "Jonathan Miller", "response": ["Miller grew up in St John's Wood, London, in a well-connected Jewish family. His father Emanuel (1892–1970), who was of Lithuanian descent and suffered from severe rheumatoid arthritis, was a military psychiatrist and subsequently a paediatric psychiatrist at Harley House. His mother, Betty Miller (née Spiro) (1910–1965), was a novelist and biographer who was originally from County Cork, Ireland. Miller's elder sister Sarah (died 2006) worked in television for many years and retained an involvement with Judaism that Miller, as an atheist, always eschewed.", "* Stevie Smith, a friend of his mother Betty Miller, \"rather disloyally\" included a thinly-disguised and uncomplimentary version of the nine-year-old Miller, \"precocious and brattish... constantly demanding attention\", in her short story 'Beside the Seaside: A Holiday with Children' (1949)."]}, {"page": "1910 in Ireland", "response": ["** Betty Miller, writer (died 1965)."]}, {"page": "Notting Hill and Ealing High School", "response": ["*Betty Miller (1910-1965), author"]}, {"page": "Spiro (name)", "response": ["*Betty Miller (née Spiro) (1910–1965), Irish author"]}, {"page": "Betty Miller", "response": ["Betty Miller may refer to:", "* Betty Miller (author) (1910–1965), Jewish author", "* Betty Miller (pilot) (1926–2018), first female pilot to fly solo across the Pacific Ocean, 1963"]}, {"page": "List of Irish women writers", "response": ["*Betty Miller (1910–1965), novelist, non-fiction writer, biographer, columnist"]}, {"page": "Robert Hale (publishers)", "response": ["Farewell Leicester Square by Betty Miller was published in 1941. The company went on to publish her three final novels."]}, {"page": "Betty Spiro", "response": ["#REDIRECT Betty Miller (author)"]}, {"page": "List of women writers (M–Z)", "response": ["*Betty Miller (1910–1965, Ireland), fiction & non-f. wr."]}]}}