{"wiki_id": "http://www.wikidata.org/entity/Q4908085", "itemLabel": "Bill Bedford", "itemDescription": "British test pilot", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Bedford", "wikipedia_page": {"main": "Alfred William Bedford OBE AFC FRAeS (18 November 1920 – 20 October 1996) was a British test pilot and pioneered the development of V/STOL aircraft.\nBedford was born on 18 November 1920 at Loughborough and was educated at Loughborough College. He was serving an electrical a mechanical apprenticeship and training to be a steeplejack when the war started.\nBedford joined the Royal Air Force as a fighter pilot in 1940. He flew the Hawker Hurricane and the Republic Thunderbolt with No. 605 Squadron RAF and No. 135 Squadron RAF, and the North American Mustang with No. 65 Squadron RAF. Bedford was awarded the Air Force Cross in 1945. After the war, he took a permanent commission with the RAF and became an all-weather flying instructor and tutor at the Empire Test Pilots' School.\nOn 24 August 1950, an Eon Olympia glider flown by Bill Bedford broke the British distance record by flying 310 km in 3:50 hr. On 2 May 1951 Bedford broke this record with a flight of 413 km from Farnborough to Newcastle.\nOn his retirement in 1951, he joined Hawker Siddeley and was chief test pilot from 1956 till 1967. Together with his colleague Hugh Merewether he pioneered Hawker's development of V/STOL aircraft. Bedford was the first pilot to fly the Hawker P.1127, Kestrel, and Harrier. In addition to his land-based test pilot duties, he also pioneered the operation of V/STOL aircraft from a ship - the P.1127 on HMS Ark Royal in 1963.\nFrom 1968, he became the Sales Manager for Hawker Siddeley Aviation and later marketing manager when it became British Aerospace. Bedford retired in 1986 and died on 20 October 1996 in a cottage opposite one of the ponds in  West End Esher, Surrey.\nBedford's awards include the King's Commendation, the Order of the British Empire, and the Air Force Cross. In addition, he was awarded the Britannia, Segrave and de Havilland trophies. In 1994, he was awarded the Sir Peter Masefield Gold Medal.", "link_mentions": [{"page": "Hawker Siddeley", "response": ["*Bill Bedford"]}, {"page": "Test pilot", "response": ["*Bill Bedford"]}, {"page": "Bell X-14", "response": ["The X-14 first flew on 19 February 1957 as a vertical takeoff, hover, then vertical landing. The first transition from hover to horizontal flight occurred on 24 May 1958. In 1959, its Viper engines were replaced with General Electric J85 engines. That year the aircraft was delivered to the NASA Ames Research Center as the X-14A. During the development of the P.1127, Hawker test pilots Bill Bedford and Hugh Merewether visited NASA Ames to fly the X-14 and acquaint themselves with jet V/STOL aircraft handling prior to the first flights of the prototype P.1127. It served as a test aircraft with NASA until 1981."]}, {"page": "Stanley Hooker", "response": ["In the late 1980s, test pilot Bill Bedford gave a talk in Christie's auction room in South Kensington in London. He had been the original test pilot for the Harrier at Dunsfold. Bedford talked about the various fighters he had flown, many of which had been powered by Hooker's engines. On the screen behind him, towards the end of his talk, he showed a picture of Hooker, and said, \"I'll have to think about this a bit, but if I was asked who was Britain's greatest ever engineer, I'd have to decide between Brunel and Sir Stanley Hooker, but I'd probably go for Sir Stanley.\""]}, {"page": "Hawker Siddeley P.1127", "response": ["On 13 February 1961, XP831 performed its first conventional flight, flown by Bill Bedford and lasting for 22 minutes.Mason 1967, p. 8. Soon after this, XP831 was refitted with a new model of the Pegasus engine, capable of generating  of thrust, prior to embarking on new hovering trials in May 1961. In June, XP831 attained another milestone in the program when it performed the first transition from vertical hover to horizontal flight, initially flying the length of Dunsfold's runway at a height of 50 meters.", "The nine aircraft were ordered as the Kestrel FGA.1, which was essentially an improved version of the P.1127. On 7 March 1964, XS688 became the first Kestrel to conduct its maiden flight, flown by Bill Bedford. The Kestrel had fully swept wings and a larger tail than the early P.1127s,Mason 1971, p. 375. and the fuselage was modified to take the larger 15,000 lbf (85 kN) Pegasus 5 engine as in the P.1127/Kestrel prototype XP984, in addition to some other changes, such as addition of ultra high frequency (UHF) radio and assorted operational equipment in a bay house within the rear fuselage. Prior to the availability of the Kestrel for testing, a pair of NASA pilots visited Dunsfold to perform a complete set of handling trials using the earlier P.1127 in its place.", "On 15 October 1964, the Tri-partite Evaluation Squadron (TES) was formed at RAF West Raynham, staffed by a diverse mix of military test pilots from Britain, the United States and West Germany.Jefford 2006, p. 41. The personnel comprising the squadron were highly experienced pilots; prior to flying the Kestrel, each received a week's ground training at Bristol's in-house facility and a week's ground instruction at Dunsfold prior to a three-hour flight conversion instructed by Bill Bedford. The purpose of the squadron was to evaluate the suitability of V/STOL aircraft for field operations, compare competing styles and methods of taking off/landing, develop normal flight operating procedures, perform instrument flight assessments, conduct night flight operations, and explore jet-borne maneuvering throughout the Kestrel's flight envelope."]}, {"page": "Segrave Trophy", "response": ["| 100px|alt=Lithograph of Bill Bedford in 1995"]}, {"page": "List of glider pilots", "response": ["* Bill Bedford test pilot - first to fly Hawker P.1127  and Harrier."]}, {"page": "Hugh Merewether", "response": ["* Bill Bedford"]}, {"page": "Reaching for the Skies", "response": ["# \"Vertical Flight\": This episode examines the history of vertical flight, beginning with the early helicopters, through the pivotal breakthrough of the Cierva Rotor-head, the helicopters of Igor Sikorsky (with a contemporary interview), and the two great periods of helicopter military lifesaving in the Korean and Vietnam Wars, featuring the recollections of several decorated veterans of the conflicts. The episode continues with further developments in helicopter aviation, as well as a range of vertical aircraft such as the early Kestrel and Harrier programs, discussed in detail by test pilot Bill Bedford and designer John Fozard."]}, {"page": "List of Harrier Jump Jet family losses", "response": ["| Crashed after a cold nozzle detached in flight and the aircraft became uncontrollable during approach to normal horizontal landing. Pilot Bill Bedford ejected unhurt. Aircraft hit a barn and caught fire.Aircraft Profile No. 198, The Hawker p. 1127 & Kestrel by Francis K. Mason - Profile Publications, 1966 - p. 9.", "| Crashed while flying at low speed and low altitude during a display at the 1963 Paris Air Show, pilot Bill Bedford climbed from the aircraft unhurt. Crash was caused by a speck of dust in a nozzle-control air motor which caused momentary failure of the nozzles to follow pilot's commands while the aircraft was being mostly supported by engine lift.Aircraft Profile No. 198, The Hawker p. 1127 & Kestrel by Francis K. Mason - Profile Publications, 1966 - p. 10."]}, {"page": "EoN Olympia", "response": ["On 24 August 1950 an Eon Olympia flown by Bill Bedford broke the British distance record by flying 310 km in 3:50 hr. On 2 May 1951 Bedford broke his record with a flight of 413 km from Farnborough to Newcastle. Olympias also broke height records on occasions, culminating in a flight by Gordon Rondel on 18 June 1960 in a thunderstorm to 9,321 m (30,580 ft) with gain of height of 8,870 m (29,100 ft), absolute National height and gain of height records. An example is now on display at the Gliding Heritage Centre."]}, {"page": "November 1960", "response": ["* The Hawker Siddeley P.1127, the first V/STOL jet aircraft (vertical short take-off and landing) capability, made its first untethered flight. Test pilot Bill Bedford lifted, hovered, and landed the jet at the Royal Aircraft Establishment ground at Thurleigh.Francis K. Mason, Hawker aircraft since 1920 (Naval Institute Press, 1991) p84"]}, {"page": "Deaths in 1996", "response": ["*Bill Bedford, British test pilot and pioneered the development of V/STOL aircraft (b. 1920)"]}, {"page": "Ralph Hooper", "response": ["In early 1960, work at NASA's Ames Research Center had demonstrated that transition from vertical to conventional flight would be possible. On 22 June 1960, the project finally received a contract and finance from the Ministry of Aviation.  XP831 first flew (tethered) on 21 October 1960 (now at the Royal Air Force Museum London) with a Pegasus 2 engine at Hawker's Dunsfold Aerodrome flown by Bill Bedford. Untethered flight first took place on 19 November 1960. The first conventional flight took place on 13 March 1961 from RAE Bedford, and it was there on 12 September 1961 that the first full transition from vertical to conventional flight took place, surprisingly with little incident. The first crash took place (XP636) on 14 December 1961 with the pilot successfully ejecting. Anhedral tailplanes were introduced in 1962."]}, {"page": "Deaths in October 1996", "response": ["*Bill Bedford, 75, British test pilot."]}]}}