{"wiki_id": "http://www.wikidata.org/entity/Q49081", "itemLabel": "Christopher Hitchens", "itemDescription": "British-American author and journalist (1949-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Hitchens", "wikipedia_page": {"main": "Christopher Eric Hitchens (13 April 1949 – 15 December 2011) was a British-American author, journalist, orator and columnist. He wrote, co-wrote, edited or co-edited over 30 books, including five of essays on culture, politics and literature.\nHitchens originally described himself as a democratic socialist, and he was a member of various socialist organisations throughout his life, including the International Socialists. Hitchens eventually stopped describing himself as a socialist, but he continued to identify as a Marxist, supporting Marx's materialist conception of history. Hitchens was very critical of aspects of American foreign policy, such as American involvement in war crimes in Vietnam, Chile and East Timor. However, he also supported the United States in the Kosovo War, the Afghanistan War, the Iraq War and other military interventions.\nHitchens described himself as an anti-theist, who saw all religions as false, harmful and authoritarian. He argued for free expression and scientific discovery, and asserted that they were superior to religion as an ethical code of conduct for human civilisation. He also advocated separation of church and state. The dictum \"What can be asserted without evidence can also be dismissed without evidence\" has become known as Hitchens's razor.A heavy smoker and drinker since his teenage years, Hitchens died from complications related to esophageal cancer in December 2011.", "link_mentions": [{"page": "April 13", "response": ["*  1949   – Christopher Hitchens, English-American essayist, literary critic, and journalist (d. 2011)"]}, {"page": "Arthur Miller", "response": ["In 1999 the writer Christopher Hitchens attacked Miller for comparing the Monica Lewinsky investigation to the Salem witch hunt. Miller had asserted a parallel between the examination of physical evidence on Lewinsky's dress and the examinations of women's bodies for signs of the \"Devil's Marks\" in Salem. Hitchens scathingly disputed the parallel. In his memoir, Hitch-22, Hitchens bitterly noted that Miller, despite his prominence as a left-wing intellectual, had failed to support author Salman Rushdie during the Iranian fatwa involving The Satanic Verses."]}, {"page": "Ann Widdecombe", "response": ["In 2009, Widdecombe appeared with Archbishop John Onaiyekan in an \"Intelligence Squared\" debate in which they defended the motion that the Catholic Church was a force for good. Arguing against the motion were Stephen Fry and Christopher Hitchens, who won the debate overall."]}, {"page": "Bill Clinton", "response": ["* Christopher Hitchens No One Left to Lie to: The Triangulations of William Jefferson Clinton (1999) "]}, {"page": "Conspiracy theory", "response": ["Christopher Hitchens described conspiracy theories as the \"exhaust fumes of democracy\": the unavoidable result of a large amount of information circulating among a large number of people."]}, {"page": "December 15", "response": ["*  2011   – Christopher Hitchens, English-American essayist, literary critic, and journalist (b. 1949)"]}, {"page": "Daniel Dennett", "response": ["Dennett is an atheist and secularist, a member of the Secular Coalition for America advisory board,, and a member of the Committee for Skeptical Inquiry, as well as an outspoken supporter of the Brights movement. Dennett is referred to as one of the \"Four Horsemen of New Atheism\", along with Richard Dawkins, Sam Harris, and the late Christopher Hitchens."]}, {"page": "Edmund Burke", "response": ["Burke believed that property was essential to human life. Because of his conviction that people desire to be ruled and controlled, the division of property formed the basis for social structure, helping develop control within a property-based hierarchy. He viewed the social changes brought on by property as the natural order of events which should be taking place as the human race progressed. With the division of property and the class system, he also believed that it kept the monarch in check to the needs of the classes beneath the monarch. Since property largely aligned or defined divisions of social class, class too was seen as natural—part of a social agreement that the setting of persons into different classes, is the mutual benefit of all subjects. Concern for property is not Burke's only influence. Christopher Hitchens summarises as follows: \"If modern conservatism can be held to derive from Burke, it is not just because he appealed to property owners in behalf of stability but also because he appealed to an everyday interest in the preservation of the ancestral and the immemorial\"."]}, {"page": "George Orwell", "response": ["In Orwell's Victory, Christopher Hitchens argues: \"In answer to the accusation of inconsistency Orwell as a writer was forever taking his own temperature. In other words, here was someone who never stopped testing and adjusting his intelligence\".", "Peter Davison's publication of the Complete Works of George Orwell, completed in 2000,Peter Davison The Complete Works of George Orwell Random House,  made most of the Orwell Archive accessible to the public. Jeffrey Meyers, a prolific American biographer, was first to take advantage of this and published a book in 2001Jeffrey Meyers Orwell: Wintry Conscience of a Generation W.W. Norton & Company, Incorporated, 2001  that investigated the darker side of Orwell and questioned his saintly image. Why Orwell Matters (released in the United Kingdom as Orwell's Victory) was published by Christopher Hitchens in 2002.Also see: "]}, {"page": "Henry Kissinger", "response": ["Kissinger remains a controversial and polarizing figure in U.S. politics, both condemned as an alleged war criminal by many journalists, political activists, and human rights lawyers, \"[...] many consider Kissinger a war criminal, most famously Christopher Hitchens, who, in a lengthy two-part article for Harper's in 2001 (later expanded into the book and documentary, The Trial of Henry Kissinger), laid out his case that Kissinger should be brought up on charges 'for war crimes, for crimes against humanity, and for offenses against common or customary or international law, including conspiracy to commit murder, kidnap, and torture'. and venerated as a highly effective U.S. Secretary of State by many prominent international relations scholars. With the death of centenarian George Shultz in February 2021, Kissinger is the oldest living former U.S. Cabinet member and the last surviving member of Nixon's Cabinet.", "Some have blamed Kissinger for injustices in American foreign policy during his tenure in government. In September 2001, relatives and survivors of General Rene Schneider (former head of the Chilean general staff) filed civil proceedings in Federal Court in Washington, DC, and, in April 2002, a petition for Kissinger's arrest was filed in the High Court in London by human rights campaigner Peter Tatchell, citing the destruction of civilian populations and the environment in Indochina during the years 1969–75.\"Why the law wants a word with Kissinger\", Fairfax Digital, April 30, 2002 British-American journalist and author Christopher Hitchens authored The Trial of Henry Kissinger, in which Hitchens calls for the prosecution of Kissinger \"for war crimes, for crimes against humanity, and for offenses against common or customary or international law, including conspiracy to commit murder, kidnap, and torture\". Critics on the right, such as Ray Takeyh, have faulted Kissinger for his role in the Nixon administration's opening to China and secret negotiations with North Vietnam. Takeyh writes that while rapprochement with China was a worthy goal, the Nixon administration failed to achieve any meaningful concessions from Chinese officials in return, as China continued to support North Vietnam and various \"revolutionary forces throughout the Third World,\" \"nor does there appear to be even a remote, indirect connection between Nixon and Kissinger's diplomacy and the communist leadership's decision, after Mao's bloody rule, to move away from a communist economy towards state capitalism.\""]}, {"page": "Hampshire", "response": ["Hampshire's literary connections include the birthplace of authors Jane Austen, Wilbert Awdry and Charles Dickens, and the residence of others, such as Charles Kingsley and Mrs Gaskell. Austen lived most of her life in Hampshire, where her father was rector of Steventon, and wrote all of her novels in the county. Alice Liddell, also known as Alice Hargreaves, the inspiration for Alice in Lewis Carroll's Alice's Adventures in Wonderland, lived in and around Lyndhurst, Hampshire after her marriage to Reginald Hargreaves, and is buried in the graveyard of St Michael and All Angels Church in the town. Hampshire also has many visual art connections, claiming the painter John Everett Millais as a native, and the cities and countryside have been the subject of paintings by L. S. Lowry and J. M. W. Turner. Selborne was the home of Gilbert White. Journalist and social critic Christopher Hitchens was born into a naval family in Portsmouth. Broadcasters Philippa Forrester, Amanda Lamb and Scott Mills also are from the county. American actor and gameshow host, Richard Dawson, was born and raised here. Richard St. Barbe Baker Founder of the International Tree Foundation and responsible for planting over two billion trees was born in West End."]}, {"page": "Jerry Falwell Sr.", "response": ["Following the September 11 attacks in 2001, Falwell said on Pat Robertson's The 700 Club, \"I really believe that the pagans, and the abortionists, and the feminists, and the gays and the lesbians who are actively trying to make that an alternative lifestyle, the ACLU, People For the American Way, all of them who have tried to secularize America. I point the finger in their face and say 'you helped this happen.'\"Falwell speaks about WTC disaster, Christian Broadcasting Network  In his opinion, LGBT organizations had angered God, thereby in part causing God to let the attacks happen. Falwell believed the attacks were \"probably deserved\", a statement which Christopher Hitchens described as treason.\"Christopher Hitchens and Ralph Reed Square Off over Late Leader's Influence; the Christian Right.\"  Hannity & Colmes. May 17, 2007. FOX News. Retrieved June 23, 2009. Following heavy criticism, Falwell said that no one but the terrorists were to blame, and stated, \"If I left that impression with gays or lesbians or anyone else, I apologize.\" Falwell was subsequently the object of some of his own followers' outrage for retracting his statements about divine judgment on America and its causes, because they had heard the same themes in his preaching over many years that America must repent of its lack of devotion to God, immoral living, and timid support of Israel if America wanted divine protection and blessing.Winters, Michael Sean. (2012). God's Right Hand: how Jerry Falwell made God a Republican and baptized the American right. New York: HarperOne, pp. 383-384. .", "Social commentator and antitheist Christopher Hitchens described his work as \"Chaucerian fraud\" and a \"faith-based fraud.\" Hitchens took special umbrage with Falwell's alignment with \"the most thuggish and demented Israeli settlers\", and his declaration that 9/11 represented God's judgment on America's sinful behaviour; deeming it \"extraordinary that not even such a scandalous career is enough to shake our dumb addiction to the 'faith-based.'\" Hitchens also mentioned that, despite his support for Israel, Falwell \"kept saying to his own crowd, yes, you have got to like the Jews, because they can make more money in 10 minutes than you can make in a lifetime\".Hitchens, Christopher. \"Jerry Falwell, faith-based fraud .\" Slate. May 16, 2007. Retrieved September 3, 2013. Appearing on CNN a day after Falwell's death, Hitchens said, \"The empty life of this ugly little charlatan proves only one thing: that you can get away with the most extraordinary offenses to morality and to truth in this country if you will just get yourself called 'reverend'.\""]}, {"page": "Kosovo War", "response": ["Aside from politicians and diplomats, commentators and intellectuals also supported the war. Michael Ignatieff called NATOs intervention a \"morally justifiable response to ethnic cleansing and the resulting flood of refugees, and not the cause of the flood of refugees\" while Christopher Hitchens said NATO intervened only, \"when Serbian forces had resorted to mass deportation and full-dress ethnic \"cleansing.\" Writing in The Nation, Richard A. Falk wrote that, \"the NATO campaign achieved the removal of Yugoslav military forces from Kosovo and, even more significant, the departure of the dreaded Serbian paramilitary units and police\" while an article in The Guardian wrote that for Mary Kaldor, Kosovo represented a laboratory on her thinking for human security, humanitarian intervention and international peacekeeping, the latter two which she defined as, \"a genuine belief in the equality of all human beings; and this entails a readiness to risk lives of peacekeeping troops to save the lives of others where this is necessary.\" Reports stated there had been no peace between Albanians and Serbs, citing the deaths of 1,500 Albanians and displacement of 270,000 prior to NATO intervention."]}, {"page": "King James Version", "response": ["The Authorized Version has been called \"the most influential version of the most influential book in the world, in what is now its most influential language\", \"the most important book in English religion and culture\", and \"the most celebrated book in the English-speaking world\". David Crystal has estimated that it is responsible for 257 idioms in English; examples include feet of clay and reap the whirlwind. Furthermore, prominent atheist figures such as Christopher Hitchens and Richard Dawkins have praised the King James Version as being \"a giant step in the maturing of English literature\" and \"a great work of literature\", respectively, with Dawkins then adding, \"A native speaker of English who has never read a word of the King James Bible is verging on the barbarian\"."]}, {"page": "Kingsley Amis", "response": ["Yet according to James, Amis reached a turning point when his drinking ceased to be social and became a way of dulling his remorse and regret at his behaviour towards Hilly. \"Amis had turned against himself deliberately.... It seems fair to guess that the troubled grandee came to disapprove of his own conduct.\" His friend Christopher Hitchens said: \"The booze got to him in the end, and robbed him of his wit and charm as well as of his health.\"Kingsley Amis, Everyday Drinking, New York: Bloomsbury USA, 2008, editor's introduction.", "*2008 Everyday Drinking: The Distilled Kingsley Amis, Introduction by Christopher Hitchens (an omnibus edition of On Drink, Everyday Drinking and How's Your Glass?)"]}, {"page": "Leon Trotsky", "response": ["* Uncommon Knowledge. Interview with Christopher Hitchens and Robert Service about Leon Trotsky"]}, {"page": "North Korea", "response": ["Juche was initially promoted as a \"creative application\" of Marxism–Leninism, but in the mid-1970s, it was described by state propaganda as \"the only scientific thought... and most effective revolutionary theoretical structure that leads to the future of communist society\". Juche eventually replaced Marxism–Leninism entirely by the 1980s, and in 1992 references to the latter were omitted from the constitution. The 2009 constitution dropped references to communism and elevated the Songun military first policy while explicitly confirming the position of Kim Jong-il. However, the constitution retains references to socialism. Juches concepts of self-reliance have evolved with time and circumstances, but still provide the groundwork for the spartan austerity, sacrifice, and discipline demanded by the party. Scholar Brian Reynolds Myers views North Korea's actual ideology as a Korean ethnic nationalism similar to statism in Shōwa Japan and European fascism.Christopher Hitchens: A Nation of Racist Dwarfs – Kim Jong-il's regime is even weirder and more despicable than you thought  (2010)"]}, {"page": "Diana, Princess of Wales", "response": ["Diana's relationship with the press and the paparazzi has been described as \"ambivalent\". On different occasions she would complain about the way she was being treated by the media, mentioning that their constant presence in her proximity had made life impossible for her, whereas at other times she would seek their attention and hand information to reporters herself. Writing for The Guardian, Peter Conrad suggested that it was Diana who let the journalists and paparazzi into her life as she knew they were the source of her power; thus, she \"overburdened herself with public duties\" and destroyed the border between private and public life. This view was supported by Christopher Hitchens, who believed that \"in pursuit of a personal solution to an unhappy private life, she became an assiduous leaker to the press\". Nevertheless, Diana also used the media's interest in her to shine light on her charitable efforts and patronages."]}, {"page": "Portsmouth", "response": ["Portsmouth has been home to a number of famed authors; Charles Dickens, whose works include A Christmas Carol, Great Expectations, Oliver Twist and A Tale of Two Cities, was born there.  Arthur Conan Doyle, author of the Sherlock Holmes stories, practised medicine in the city and played goal for the amateur Portsmouth Association Football Club. Rudyard Kipling (poet and author of  The Jungle Book) and H. G. Wells, author of The War of the Worlds and The Time Machine, lived in Portsmouth during the 1880s. Novelist and historian Walter Besant, author of By Celia's Arbour, A Tale of Portsmouth Town, was born in Portsmouth. Historian Frances Yates, known for her work on Renaissance esotericism, was born in the city. Francis Austen, brother of Jane Austen, briefly lived in the area after graduating from Portsmouth Naval Academy. Contemporary literary figures include social critic, journalist and author Christopher Hitchens, who was born in Portsmouth. Nevil Shute moved to the city in 1934 when he relocated his aircraft company, and his former home is in Southsea. Fantasy author Neil Gaiman grew up in Purbrook and Southsea."]}, {"page": "Prayer", "response": ["Christopher Hitchens (2012) argued that praying to a god which is omnipotent and all-knowing would be presumptuous. For example, he interprets Ambrose Bierce's definition of prayer by stating that \"the man who prays is the one who thinks that god has arranged matters all wrong, but who also thinks that he can instruct god how to put them right.\""]}, {"page": "Religion", "response": ["Critics like Hector Avalos Regina Schwartz, Christopher Hitchens and Richard Dawkins have argued that religions are inherently violent and harmful to society by using violence to promote their goals, in ways that are endorsed and exploited by their leaders."]}, {"page": "Rubaiyat of Omar Khayyam", "response": ["* In the opening chapter of his book God is Not Great (2007), Christopher Hitchens quotes from Richard Le Gallienne's translation of Khayyam's famous quatrain:"]}, {"page": "Rolf Ekéus", "response": ["According to the journalist Christopher Hitchens, Ekéus  \"told me that he'd been offered by Tariq Aziz in person, to his face, a bribe of a million and a half dollars to change his inspection report. That was going on throughout the entire process. Rolf wouldn't, of course, agree to take it, but if they were asking him, it means they were asking everybody.\" The story has also been covered by The Telegraph."]}, {"page": "Richard Dawkins", "response": ["Dawkins has risen to prominence in public debates concerning science and religion since the publication of his most popular book, The God Delusion, in 2006, which became an international bestseller. As of 2015, more than three million copies have been sold and the book has been translated into over 30 languages. Its success has been seen by many as indicative of a change in the contemporary cultural zeitgeist and has also been identified with the rise of New Atheism. In the book, Dawkins contends that a supernatural creator almost certainly does not exist and that religious faith is a delusion—\"a fixed false belief\". In his February 2002 TED talk entitled \"Militant atheism\", Dawkins urged all atheists to openly state their position and to fight the incursion of the church into politics and science. On 30 September 2007, Dawkins, Christopher Hitchens, Sam Harris, and Daniel Dennett met at Hitchens's residence for a private, unmoderated discussion that lasted two hours. The event was videotaped and entitled \"The Four Horsemen\". See also ", "While some critics, such as writer Christopher Hitchens, psychologist Steven Pinker and Nobel laureates Sir Harold Kroto, James D. Watson, and Steven Weinberg have defended Dawkins's stance on religion and praised his work, others, including Nobel Prize-winning theoretical physicist Peter Higgs, astrophysicist Martin Rees, philosopher of science Michael Ruse, literary critic Terry Eagleton, philosopher Roger Scruton, academic and social critic Camille Paglia, atheist philosopher Daniel Came and theologian Alister McGrath, have criticised Dawkins on various grounds, including the assertion that his work simply serves as an atheist counterpart to religious fundamentalism rather than a productive critique of it, and that he has fundamentally misapprehended the foundations of the theological positions he claims to refute. Rees and Higgs, in particular, have both rejected Dawkins's confrontational stance toward religion as narrow and \"embarrassing\", with Higgs going as far as to equate Dawkins with the religious fundamentalists he criticises. Atheist philosopher John Gray has denounced Dawkins as an \"anti-religious missionary\", whose assertions are \"in no sense novel or original,\" suggesting that \"transfixed in wonderment at the workings of his own mind, Dawkins misses much that is of importance in human beings.\" Gray has also criticised Dawkins's perceived allegiance to Darwin, stating that if \"science, for Darwin, was a method of inquiry that enabled him to edge tentatively and humbly toward the truth, for Dawkins, science is an unquestioned view of the world.\" In response to his critics, Dawkins maintains that theologians are no better than scientists in addressing deep cosmological questions and that he is not a fundamentalist, as he is willing to change his mind in the face of new evidence."]}, {"page": "Received Pronunciation", "response": ["* Christopher Hitchens, late author and journalist"]}]}}