{"wiki_id": "http://www.wikidata.org/entity/Q4908953", "itemLabel": "Bill Farrimond", "itemDescription": "cricketer (1903-1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Farrimond", "wikipedia_page": {"main": "William Farrimond (23 May 1903 – 15 November 1979) was an English cricketer who played in four Tests from 1931 to 1935. He was born and died at Westhoughton, Lancashire.\nBill Farrimond was widely regarded in the late 1920s and across the 1930s as the second best wicketkeeper in English first-class cricket, but the man regarded as the best was his Lancashire colleague George Duckworth – and for many years both of them were kept out of the England team by Leslie Ames, who was a much better batsman. The result was that Farrimond played only a handful of county matches each season from 1925 to 1937 before, on the retirement of Duckworth, he finally played two full seasons in 1938 and 1939.\nDespite being second string wicketkeeper at Lancashire, Farrimond played four Tests. In 1930-31, he was picked as second wicketkeeper to Duckworth on the tour to the South Africa, and played in two matches when Duckworth was injured. Four years later, he toured the West Indies and played one Test, with regular keeper Les Ames playing just as a batsman in that match. His only home Test match was the game at Lord's in 1935 against South Africa, when Ames again played as a batsman only.\nAn unobtrusive wicketkeeper, unlike Duckworth, Farrimond was the second wicketkeeper, after Tiger Smith, to make seven dismissals in an innings, then the world record. A useful lower order batsman, his one century came playing for the Minor Counties side.\nHe played one first-class match in 1945, a friendly \"Roses\" match, but at 42 years of age he did not play again when regular cricket resumed after the Second World War.", "link_mentions": [{"page": "Lancashire County Cricket Club", "response": ["|align=left|1. Bill Farrimond2. Warren Hegg"]}, {"page": "Westhoughton", "response": ["*Bill Farrimond – cricketer, played for England."]}, {"page": "List of Test cricketers", "response": ["Bill Farrimond ·"]}, {"page": "Daisy Hill F.C.", "response": ["Daisy Hill were established in 1894. in the 1896–97 season they were Wigan & District League champions and also won the Westhoughton Cup, achieving both honours without losing a game all season. By the time of World War I the club were playing at their present ground, New Sirs and competing in the Leigh & District Senior Sunday School League. They then joined the Westhoughton League winning a number of honours in the 1920s and 1930s and during this time, Lancashire County Cricket Club cricketers Dick Pollard and Bill Farrimond both played football for Daisy Hill. Alf Gray, the future Torquay United player, also started his career with the club in the early 1930s."]}, {"page": "English cricket team in the West Indies in 1934–35", "response": ["* Bill Farrimond, wicketkeeper"]}, {"page": "List of Lancashire County Cricket Club records", "response": ["|align=left|1. Bill Farrimond2. Warren Hegg"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* Bill Farrimond (1930/31–1934/35) : W. Farrimond (Lancashire). Tours: South Africa (1930/31); West Indies (1934/35)."]}, {"page": "William Farrimond", "response": ["#REDIRECTBill Farrimond"]}, {"page": "Farrimond", "response": ["*Bill Farrimond (1903–1979), English cricketer"]}]}}