{"wiki_id": "http://www.wikidata.org/entity/Q4907964", "itemLabel": "Bill Atkins", "itemDescription": "English footballer (born 1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Atkins_(footballer)", "wikipedia_page": {"main": "William Mark Atkins (born 9 May 1939 in Solihull) is an English former professional footballer who played as a forward in the Football League in the 1960s and 1970s.He made league appearances for six different clubs, including two spells and 200 appearances with Halifax Town. His first spell with Halifax ended in March 1967 when he moved to Stockport County in a swap-deal with David Shawcross.", "link_mentions": [{"page": "List of Swindon Town F.C. seasons", "response": ["|Bill Atkins (12)"]}, {"page": "William Atkins", "response": ["* Bill Atkins (cricketer) (born 1938), former English cricketer", "* Bill Atkins (footballer) (born 1939), former professional footballer"]}, {"page": "1969–70 Football League", "response": ["|=||align=left|  Bill Atkins ||align=left| Halifax Town /Portsmouth ||7+2||1||0||10"]}, {"page": "1970–71 Football League", "response": ["|9||align=left|  Bill Atkins ||align=left| Halifax Town ||18||0||1||19"]}, {"page": "Jim Fryatt", "response": ["A regular scorer for all of his club sides, the stockily built forward was the archetypal journeyman, spending most of his career switching between lower league sides. However whilst appearing for Bradford Park Avenue against Tranmere Rovers on 25 April 1964 Fryatt established a Football League record by scoring after only 4 seconds, the fastest goal in the competition's history.Barry Hugman, Football League Players Records, 1981, p. 18 Fryatt was well regarded for his time at Stockport County, where his strike partnership with Bill Atkins was so formidable that the two have been inducted into the club's Hall of Fame as a unit.Jim Fryatt & Bill Atkins Fryatt signed for Oldham Athletic from Blackburn Rovers for a sum of £8,000 in 1970 and although he only spent 21 months at Boundary Park, he became an instant hit and legend among supporters for scoring 42 goals in 81 appearances in all competitions.Jim Fryatt (1940-2020)"]}, {"page": "William Atkins (footballer)", "response": ["#REDIRECT Bill Atkins (footballer)"]}, {"page": "List of Rochdale A.F.C. players (25–99 appearances)", "response": ["|Bill Atkins"]}]}}