{"wiki_id": "http://www.wikidata.org/entity/Q4902942", "itemLabel": "Biba", "itemDescription": "fashion company", "wikipedia_url": "https://en.wikipedia.org/wiki/Biba", "wikipedia_page": {"main": "Biba was a London fashion store of the 1960s and 1970s. Biba was started and primarily run by the Polish-born Barbara Hulanicki with help of her husband Stephen Fitz-Simon.", "link_mentions": [{"page": "The Angry Brigade", "response": ["In 2009, British family care activist and novelist Erin Pizzey was successful in a libel case against Macmillan Publishers after Andrew Marr's History of Modern Britain had falsely linked her to the Angry Brigade. The publisher also recalled and destroyed the offending version of the book, and republished it with the error removed. The link to the Angry Brigade was made in 2001, in an interview with The Guardian, in which the article states that she was \"thrown out\" of the feminist movement after threatening to inform police about a planned bombing by the Angry Brigade of the clothes shop Biba. \"I said that if you go on with this – they were discussing bombing Biba [the legendary department store in Kensington] – I'm going to call the police in, because I really don't believe in this.\""]}, {"page": "List of Polish people", "response": ["* Barbara Hulanicki, fashion designer, founder of Biba"]}, {"page": "Miniskirt", "response": ["An alternative origin story for the miniskirt came from Barbara Hulanicki of the London boutique Biba, who recalled that in 1966 she received a delivery of stretchy jersey skirts that had shrunk drastically in transit. Much to her surprise, the ten-inch long garments rapidly sold out."]}, {"page": "Andrew Marr", "response": ["In May and June 2007, the BBC broadcast Andrew Marr's History of Modern Britain. He presented the series of five one-hour documentaries chronicling the history of Britain from 1945 to 2007. Unsold copies of the book of the series, a best-seller, were recalled in March 2009 by publishers Macmillan when legal action was taken over false claims that domestic violence campaigner Erin Pizzey had been a member of The Angry Brigade terrorist group.Jones, Sam; Kennedy, Maev (9 March 2009).\"Marr book urgently withdrawn\". The Guardian (London). According to her own account, in a Guardian interview in 2001, Pizzey had been present at a meeting when they discussed their intention of bombing Biba, a fashion store, and threatened to report their activities to the police. Damages were paid to Pizzey and Marr's book was republished with the error removed."]}, {"page": "Kensington High Street", "response": ["Kensington High Street was also the site of Biba in the 1960s and early 1970s. When Derry & Toms closed, the iconic store took the building and accentuated its Art Deco style further. But the 1970s recession, coupled with idealistic business ideas, killed Biba in 1975. The Derry & Toms roof gardens still remain, now known as the Kensington Roof Gardens which Richard Branson's Virgin occupied as a tenant from 1981 to 2018."]}, {"page": "Celtic Revival", "response": ["The interlace design motif remains popular in Celtic countries, above all Ireland where it is a national style signature. In recent decades, it had a re-revival in 1960s designs (for example, in the Biba logo) and has been used worldwide in tattoos and in various contexts and media in fantasy works with a quasi-Dark Ages setting. The Secret of Kells is an animated feature film of 2009 set during the creation of the Book of Kells which makes much use of Insular design."]}, {"page": "Erin Pizzey", "response": ["The head office of the Women's Liberation Workshop (a women's workshop within the WLM) was in Little Newport Street, in Chinatown, Covent Garden, straddling the City of Westminster and Borough of Camden. Along with her friend, Alison, and other members of the Goldhawk Road Group, Pizzey found herself at odds with Artemis and Gladiator, who led a clique of younger women within the WLM Workshop head office. Pizzey distanced herself from this clique when she witnessed what she described as \"irregular and disrespectful behaviour\" towards the money donated by desperate women across the UK. She confronted them over this behaviour, which, according to her, included claiming that telephones were tapped, and labelling of people they did not like as MI5, police and CIA informers or agents. She also was concerned about overhearing discussion of plans to bomb the London store Biba; she reported on this to the police after warning the people involved. Subsequently, Pizzey became aware that the police had the group and offices under surveillance. Pizzey says that she and her fellow members of the Goldhawk Road group were seen as troublesome, because they did not accept others' behaviors and views.", "In 2009 Pizzey was successful in a libel case against Macmillan Publishers over content in the Andrew Marr book A History of Modern Britain. The publication had falsely claimed she had once been part of a militant group, The Angry Brigade, that staged bomb attacks in the 1970s. The publisher also recalled and destroyed the offending version of the book, and republished it with the error removed. The link to the Angry Brigade was made in 2001, in an interview with The Guardian, in which the article states that she was \"thrown out\" of the feminist movement after threatening to inform police about a planned bombing by the Angry Brigade of the clothes shop Biba. \"I said that if you go on with this – they were discussing bombing Biba [the legendary department store in Kensington] – I'm going to call the police in, because I really don't believe in this.\""]}, {"page": "Anna Wintour", "response": ["\"I think my father really decided for me that I should work in fashion\", she recalled in The September Issue. He arranged for his daughter's first job, at the influential Biba boutique, when she was 15.Oppenheimer, 42–44. The next year, she left North London Collegiate and began a training program at Harrods. At her parents' behest, she also took fashion classes at a nearby school. Soon she gave them up, saying, \"You either know fashion or you don't.\"Oppenheimer, 51. Another older boyfriend, Richard Neville, gave her her first experience of magazine production at his popular and controversial Oz.Oppenheimer, 58–62."]}, {"page": "Madeline Smith", "response": ["Smith was born in Hartfield, Sussex, the only child of Robert and Ursula Smith (née Boas). Her father owned an antiques shop and painting restoration business near Kew Gardens, and her Swiss mother was a translator. After a convent school education, in her late teens she had a temporary job at Biba, the famous boutique located on Kensington High Street, London. It was at the instigation of Barbara Hulanicki, founder of Biba, that she became a model. In the late 1960s and early '70s, she was regularly featured in the work of Disc cartoonist J Edward Oliver, who on one occasion devoted an entire strip to her entitled 'The Life and Habits of the Madeline Smith'."]}, {"page": "Kensington Roof Gardens", "response": ["The building housed the department store Derry and Toms until 1973, and then Biba until 1975. In 1978, the garden's Art Deco tea pavilion was redeveloped into a nightclub, in 1981 Virgin Limited Edition bought the lease to the roof garden and the pavilion, and in 2001 Virgin turned the pavilion into the Babylon restaurant."]}, {"page": "Stiletto heel", "response": ["After an initial wave of popularity in the 1950s, the heels reached their most refined shape in the early 1960s, when the toes of the shoes which bore them became as slender and elongated as the stiletto heels themselves. As a result of the overall sharpness of outline, it was customary for women to refer to the whole shoe as a \"stiletto\", not just the heel, via synecdoche (pars pro toto). Although they faded from the scene after the Beatles era began, their popularity continued at street level, and women stubbornly refused to give them up even after they could no longer readily find them in the mainstream shops. A version of the stiletto heel was reintroduced in 1974 by Manolo Blahnik, who dubbed his \"new\" heel the \"Needle\". Similar heels were stocked at the big Biba store in London, by Russell & Bromley and by smaller boutiques. Old, unsold stocks of pointed-toe stilettos and contemporary efforts to replicate them (lacking the true stiletto heel because of changes in the way heels were by then being mass-produced) were sold in street fashion markets and became popular with punks and with other fashion \"tribes\" of the late 1970s until supplies of the inspirational original styles dwindled in the early 1980s. Subsequently, round-toe shoes with slightly thicker (sometimes cone-shaped) semi-stiletto heels, often very high in an attempt to convey slenderness were frequently worn at the office with wide-shouldered power suits. The style survived through much of the 1980s but almost completely disappeared during the 1990s when professional and college-age women took to wearing shoes with thick, block heels. The slender stiletto heel staged a major comeback after 2000 when young women adopted the style for dressing up office wear or adding a feminine touch to casual wear, like jeans."]}, {"page": "Katy Manning", "response": ["Manning was born in Guildford, Surrey, the younger daughter of politician turned sports columnist J. L. Manning OBE and Amy Manning (née Jenkins); her elder sister Jane Dressler (née Manning) moved to New York City, U.S. and became a fashion model for Eileen Ford. Manning spent her early years in Dulwich Village. Due to Manning being severely myopic, teachers failed to understand her condition and she was teased by the other children for having poor eyesight and wearing large glasses. After finishing primary school, Manning attended Miss Dixon and Miss Wolfe's School for Girls where she became best friends with classmate Liza Minnelli, daughter of Judy Garland, and spent a lot of time at Garland and Sidney Luft's home in Chelsea. Manning socialised with stars such as James Mason and Dirk Bogarde, and had tea with Noël Coward at The Savoy. As a teenager, Manning became a model for Biba. "]}, {"page": "Lipstick", "response": ["In the 1970s, a number of cosmetic companies introduced lipsticks in more unusual colors such as iridescent light blue (Kanebo), frosted lime green (Conga Lime by Revlon), and silver sparkled navy blue (Metallic Grandma by Biba). M•A•C cosmetics continues to release limited edition and highly collectible lipsticks in a wide range of colors and finishes, including unusual hues of violets, blues, and greens."]}, {"page": "Mujhse Shaadi Karogi", "response": ["The producers sponsored several contests as part of Mujhse Shaadi Karogi marketing campaign, with prizes including a foreign honeymoon trip and wedding clothing by Biba and Neeta Lulla. They released a 64-page, palm-sized book with information about the characters' love triangle, tips about how to woo a woman and pictures of the three main characters. The film was released on 30 July 2004. Zee TV brought its UK distribution rights, the first film distributed by the channel."]}, {"page": "List of terrorist incidents in London", "response": ["* 1 May 1971: A bomb planted by the Angry Brigade exploded at the Biba boutique in Kensington"]}, {"page": "Dorothy Perkins", "response": ["In the late 1960s, Dorothy Perkins co-funded Biba's expansion into a large boutique on Kensington High Street. From 1970 to 1973 it owned a 70% stake in the business allowing Biba to extend from womenswear into accessories, beauty products, menswear, children's clothing and home goods."]}, {"page": "Almudena Fernández", "response": ["Fernández has been the cover girl for fashion magazines such as Elle, Marie Claire, Vogue, Cosmopolitan, Madame Figaro, Shape, Biba, Joyce and Harper's Bazaar among others. She has been photographed by photographers like Michael Thompson, Ruben Afanador, Raphael Mazzucco, Walter Chin, David Bailey, Mark Baptist, Diego Uchitel, Norman Jean Roy for campaigns for Hermès, Givenchy, Cartier, Wolford, Revlon, Lacoste, Carolina Herrera, Lancel, Gianfranco Ferré, L'Oréal, Carrera y Carrera, Victoria's Secret, and Kookai. She also adorned the Hello!/Carrera y Carrera photo session with matador Eugenio de Mora, based upon the novel Blood and Sand by Vicente Blasco Ibáñez."]}, {"page": "List of people from Brighton and Hove", "response": ["*Barbara Hulanicki, fashion designer and founder of Biba, moved to Brighton aged 12, studied at Brighton Art College"]}, {"page": "Donyale Luna", "response": ["Arriving in December 1965, London proved to be where Luna would make her name as a model, emerging in Swinging London, part of a youth cultural revolution associated with Beatlemania and in fashion Mary Quants miniskirts with other models of color like Kellie Wilson and Hazel Collins in the stylized-bobs of Vidal Sassoon, Mods, Teddy Boys and bright colors and patterns and fashions like those sold in shops like Barbara Hulanickis Biba or seen in the street culture of Carnaby Street or Chelsea. She was photographed in London by David Bailey, William Klein, Helmut Newton, Charlotte March (image in infobox, above) and William Claxton. Keen to join the London arts scene, she would become friends with Mick Jagger, Julie Christie, Michael Caine, Iain Quarrier and Yul Brynner. She rented an apartment by the Thames and bought a pet Maltese dog she named \"Christianne\".Beauty's Engima, Ben Arogundade, 2012, p. 16."]}, {"page": "May 1971", "response": ["*The Angry Brigade set off a bomb at the Biba store in London."]}, {"page": "Bohemian style", "response": ["A biographer of Edward Burne-Jones, writing a century after Shaw (Fiona MacCarthy, 2011), has noted that, in 1964, when the influential Biba store was opened in London by Barbara Hulanicki, the \"long drooping structureless clothes\", though sexier than the dresses portrayed in such Burne-Jones paintings as The Golden Stairs or The Sirens, nevertheless resembled them.Fiona MacCarthy (2011) The Last Pre-Raphaelite The interior of Biba has been described by the biographer of British 20th century designer Laura Ashley as having an atmosphere that \"reeked of sex ... [It] was designed to look like a bordello with its scarlet, black and gold plush fitments, but, interestingly, it implied an old-fashioned, Edwardian style of forbidden sex with its feather boas, potted palms, bentwood coat racks and dark lighting\"Anne Sebba (1990) Laura Ashley: a Life By Design MacCarthy observed also that \"the androgynous appearance of Burne-Jones's male figures reflected the sexually ambivalent feeling\" of the late 1960s.MacCarthy, op. cit.", "Beatlemania did not of itself create the apparent iconoclasm of the 1960s; however, as one writer put it, \"just as Noël Coward and Cole Porter reflected the louche, carefree attitude of the [Nineteen] Twenties, so did the Beatles' music capture the rhythm of breaking free experienced by an entire generation of people growing up in the Sixties\". By the middle of the decade, British pop music had stimulated the fashion boom of what Time called  \"swinging London\".Time, 15 April 1966 Associated initially with such \"mod\" designs as Quant's mini-skirt, this soon embraced a range of essentially Bohemian styles. These included the military and Victorian fashions popularised by stars who frequented boutiques such as Granny Takes a Trip, the \"fusion of fashion, art and lifestyle\" opened by Nigel Waymouth in the King's Road, Chelsea in January 1966,See Times Magazine, 24 June 2006; David Moss in Antiques Trade Gazette, 27 August 2011 (number 2004) and, by 1967, the hippie look largely imported from America (although, as noted, London stores such as Biba had, for some time, displayed dresses that drew on Pre-Raphaelite imageryFiona MacCathy (2011) The Last Pre-Raphaelite). The Rolling Stones' Keith Richards, whose early girl friend, Linda Keith, had, in her late teens, been a bohemian force in West Hampstead, noted on the Stones' return from an American tour in 1967 how quickly hippiedom had transformed the London scene.Keith Richards (2010) Life"]}, {"page": "Amanda Mealing", "response": ["After the birth of her first son, the desire to find out more about her background became \"hard to ignore\"; she also wanted him to \"know his heritage\". Investigations took Mealing to New York, where she eventually found her birth mother, a model for Biba in London during the swinging sixties. She discovered that her biological father was a half-Ghanaian poet and activist. She gets on well with her mother and takes the children to visit her in New York but her father died some years earlier. She also found out that she has a sister, a year younger, also adopted in Britain. Her sister did not know of the relationship until she was 16, but had watched Mealing in Grange Hill, with people saying 'you look like that girl on TV'. Now close, when they first met their similarities were unbelievable — \"we talk the same, walk the same, even our actions are the same\"."]}, {"page": "Barbara Hulanicki", "response": ["Barbara Hulanicki  (b. 1936) is a fashion designer, born in Warsaw, Poland, to Polish parents and best known as the founder of clothes store Biba.'Most girls want to be thin – enjoy it while you can BBC News. 3 September 2015", "In 1964, she opened her Biba shop in the Kensington district of London with the help of her late husband, Stephen Fitz-Simon. The shop soon became known for its \"stylishly decadent atmosphere\" and decor inspired by Art Nouveau and Art Deco. It became a hangout for artists, film stars and rock musicians, including Mick Jagger and The Rolling Stones, David Bowie, Marianne Faithfull and Cathy McGowan, presenter of British pop/rock TV programme Ready Steady Go!. In the shop, a young clientele bought affordable mini-skirts, floppy felt hats, feather boas, velvet trouser suits and unisex tee-shirts dyed in rich, muted colours. Anna Wintour started in fashion at age 15 as a Biba employee.", "British retailer Topshop opened a New York City store in April 2009 and later that month launched a collection featuring Hulanicki's designs. She produced a collection for Topshop featuring billowing chiffon dresses and blouses reminiscent of her original Biba style along with several jersey pieces printed with her original illustrations, bikinis and a cropped suede jacket. In the same month, a handbag in her Art Deco style was made by the Italian label Coccinelle.", "In 2009, the British department store group House of Fraser bought the rights to the Biba label. In 2014, Hulanicki agreed to serve as a consultant for Biba, the first time since 1975 that she had been involved with her created brand."]}, {"page": "1973 in the United Kingdom", "response": ["** The fashion store Biba re-opened in Kensington High Street."]}, {"page": "1969 in the United Kingdom", "response": ["* 16 September – Iconic 1960s fashion store Biba reopened on Kensington High Street."]}, {"page": "1971 in the United Kingdom", "response": ["** A bomb planted by the Angry Brigade exploded in the Biba Kensington store."]}, {"page": "History of fashion design", "response": ["Many of the radical changes in fashion developed in the streets of London, with such gifted designers as Mary Quant (known for launching the mini skirt) and Barbara Hulanicki (the founder of the legendary boutique Biba). Paris also had its share of new and revolutionary designers, including Pierre Cardin (known for his visionary and skillfully cut designs), André Courrèges (known for his futuristic outfits and for launching the mini skirt along with Mary Quant), Yves Saint Laurent (known for his revolutionary yet elegant fashions), and Emanuel Ungaro (known for his imaginative use of color and bold baroque contrasts). In the United States, Rudi Gernreich (known for his avant-garde and futuristic designs) and James Galanos (known for his luxurious ready-to-wear) were also reaching a young audience. The main outlets for these new young fashion designers were small boutiques, selling outfits that were not exactly 'one-offs', but were made in small quantities in a limited range of sizes and colors. However, not all designers took well to the new style and mood. In 1965, Coco Chanel mounted a rearguard action against the exposure of the knee and Balenciaga resolutely continued to produce feminine and conservative designs."]}, {"page": "Samantha Juste", "response": ["Juste and Dolenz began a relationship, prompting such headlines as \"Samantha traps Monkee\" and \"Pops girl goes ape\". Dolenz appears not to have realised that Juste was a celebrity and the publicity took him by surprise. \"Monkeemania\" was such that some of the Monkees' female fans resented Juste – \"she even showed up one day with ink stains on the emerald green dress\" – and Dolenz claimed the couple spent a week in her London flat. For much of 1967, Juste and Dolenz spent time together in England and the US. Ric Klein, Dolenz's friend and best man at his wedding, described a holiday with him in England, during which Juste acted as \"permanent guide\", travelling with them to Stratford-upon-Avon in a rented Triumph car. Then, a few days later, savouring \"Swinging\" London:Micky and I went to the Carlton Towers to see Samantha Juste in a fashion show and she looked outasite. After the show, we took off for Carnaby Street again and we went crazy buying clothes ... Micky really dug all the clothes at Biba's and Susan Lockes and practically bought out the stores. He also bought a dress for Samantha. It was the same dress that Sam wore in the fashion show and it looked fantastic on her.\"Never Enough...\" The Official Micky Dolenz Website"]}, {"page": "Cathy McGowan (presenter)", "response": ["McGowan was an early patron of Biba, whose first store opened in September 1964, and had her own fashion range at British Home Stores.Richard Wiseman (2006) Whatever Happened to Simon Dee? She endorsed a portable make-up set known as \"Cathy's Survival Kit\". Barbara Hulanicki, who founded Biba, observed that \"the girls aped Cathy's long hair and eye-covering fringe and soon their little faces were growing heavy with stage make-up\". Julia Baird, half-sister of John Lennon of the Beatles, recalled how, despite wearing black eye make-up, black polo necks and dyed black jeans \"à la Cathy McGowan\", she was unable to convince doormen at the Cavern Club in Liverpool, where the Beatles came to prominence, that she was over 18, the age for admission.Julia Baird (2007) Imagine This It has been claimed that the formation in 1966 of a British Society for the Preservation of the Miniskirt was prompted by McGowan's indicating that she would wear a long skirt on RSG."]}, {"page": "John Stephen", "response": ["Such was the popularity of Carnaby Street that it was paved and pedestrianised in 1973. Thereafter it became home to tourist and novelty outlets, as London fashion's centre moved west to Chelsea, with such psychedelic stores as Michael Rainey's Hung On You, Granny Takes a Trip, Mr Freedom and Dandie Fashions, and Kensington, Biba and Bus Stop."]}, {"page": "Shoulder pads (fashion)", "response": ["Shoulder pads made their next appearance in women's clothing in the early 1970s, through the influence of British fashion designer Barbara Hulanicki and her label Biba. Biba produced designs influenced by the styles of the 1930s and 1940s, and so a soft version of the shoulder pad was revived. Ossie Clark was another London designer using shoulder pads at the time. At the same time, a few Paris designers also presented padded shoulders with an explicit 1940s inspiration. Leading designer Yves Saint Laurent presented 1940s-inspired outfits in his couture collections of 1970 and 1971, Thierry Mugler did likewise in his first, almost unheralded collection in 1971, Daniel Hechter did the same in 1973, and Jean-Louis Scherrer did it in 1974. Such a small, disparate scattering of designers showing the look didn't constitute more than a minor trend, one limited mostly to fashion groupies in Paris and London, and thus these padded shoulders never reached mainstream acceptance – Saint Laurent's forties-revival attempts in particular were widely criticized, and so the look was relatively limited in reach, with designers showing and the public preferring the relaxed, natural, often jeans-based clothing styles typical of the times, a norm that would last through the mid-1970s."]}, {"page": "Dedicated Follower of Fashion", "response": ["In the mid-1960s fashion in Britain was becoming increasingly daring and outrageous, driven by the youth-oriented culture of Swinging London. Boutiques such as Biba, designers like Mary Quant, and the television personalities like Cathy McGowan who popularised them became celebrated as much as the entertainers who wore their mod clothes."]}, {"page": "Andrew Marr's History of Modern Britain", "response": ["In 2009, Marr's publisher, Macmillan Publishers, was successfully sued for libel by activist Erin Pizzey after his book A History of Modern Britain claimed she had once been part of the militant group Angry Brigade that staged bomb attacks in the 1970s. Pizzey became an opponent of the group and threatened to report their activities to the police when they discussed their intention of bombing Biba, a lively fashion store. The publisher also recalled and destroyed the offending version of the book, and republished it with the error removed."]}, {"page": "Retail design", "response": ["The next evolution of retail design was the creation of the boutique in the 1960s, which emphasized retail design run by individuals. Some of the earliest examples of boutiques are the Biba boutique created by Barbara Hulanicki and the Habitat line of stores made by Terence Conran. The rise of the boutique was followed, in the next two decades, with an overall increase in consumer spending across the developed world. This rise made retail design shift to compensate for increased customers and alternative focuses. Many retail design stores redesigned themselves over the period to keep up with changing consumer tastes. These changes resulted on one side with the creation of multiple \"expensive, one-off designer shops\" catering to specific fashion designers and retailers."]}, {"page": "Spring 2008 New York Fashion Week", "response": ["|Anna Sui || September 10 || Busby Berkeley musicals and Biba influences, bright-colored sequins, neons, metallic feathers, platform sandals, color-blocking, boleros, knee-length shirtwaist dresses with puff sleevesPhelps, Nicole.  || "]}, {"page": "Fall 2008 fashion weeks", "response": ["| Biba || February 10 || ||"]}, {"page": "Jessica Gomes", "response": ["Beyond her South Korean success, Gomes has appeared in Vogue, Teen Vogue, Glamour, American Glamour and Victoria's Secret catalogue, has modeled for DKNY Jeans, Garnier, Levi's, Motorola, Urban Outfitters and Victoria's Secret, and appeared on the cover of Biba. She signed with Estee Lauder as the face of Sean John's Unforgivable fragrance. She has been featured in ads for Jay-Z Rocawear. In 2009, she was in a Cass Beer ad campaign with Lee Min-ho. She was the Maxim Cover girl for November 2011. On Friday 22 March 2013, Gomes was announced as the fashion ambassador for Australian retail giant David Jones Limited, replacing Miranda Kerr and joining Megan Gale, Jason Dundas, Montana Cox, Gai Waterhouse and Emma Freedman. That July, she debuted for Jones on the runway. After Gomes became the face of Enprani Cosmetics, she launched a lip gloss named Gomes Pink. Gomes has also shot editorials for the Australian and Vietnamese editions of Harper's Bazaar and modelled for the cover of Cleo."]}, {"page": "Molly Parkin", "response": ["To support her two daughters, Parkin turned to fashion. After making hats and bags for Barbara Hulanicki at Biba, and working alongside Mary Quant, she opened her own Chelsea boutique, which was featured in a Newsweek article about Swinging London. After selling the shop to business partner Terence Donovan, she joined Nova magazine in 1965, when the radical Dennis Hackett became its editor. David Gibbs' comprehensive anthology\"Nova 1965–1975, by David Gibbs (Editor), David Hillman (Compiler), Harri Peccinotti (Photographer)\". Pavilion Books, 1993, page 39. of Nova pages and images says of Parkin: \"A dynamic sense of colour and design was all she needed to guide her. Unfettered by the accepted wisdom of the fashion system, she introduced an unconventional and startling view of what women could wear... always teasing the edges of taste... She set the standard.\""]}, {"page": "Prudence Millinery", "response": ["Prudence was born in New-York, USA. A graduate of New York's Fashion Institute of Technology and a former assistant buyer for the Associated Merchandising Corporation, she left New York and moved to London in 1986. After working as a free-lance fashion stylist, she trained for several years in couture millinery. Her hats are made in the classical manner using only traditional millinery techniques. Prudence designed her first collection for spring 1991 under her own label, Prudence Millinery, and received orders from Bergdorf Goodman and Henri Bendel both in New York City. Her collaboration with Vivienne Westwood started in 1990 and she still creates today hat collections for Vivienne Westwood and has created designs for many other top fashion designers such as Yves Saint Laurent, Gucci, Julien MacDonald, Biba and many others. Prudence currently designs and makes the hats for the Couture Collections for James Lock & Co., the world's oldest hat shop located in Mayfair, London.", "== Yves Saint Laurent, Tom Ford, Biba, Julien MacDonald, Balenciaga, Lacoste… ==", "Prudence has created two collections for Balfour Hats and designed an exclusive collection for the store Le Bon Marché in Paris. In 1993 she began designing ladies' hats for Bond Street hatter Herbert Johnson and in that same year designed a spring collection for Joseph in Knightsbridge. She has worked with French sportswear label Lacoste designing and producing women's caps and bands for the spring / summer 2006 collections in New York. Prudence has been designing and making hats for French designer Charles Anastase's since autumn / winter 2007. Since spring / summer 2008, she has been designing and creating hats for Hector Castro at Biba and for Julien MacDonald She also has made hats for Swiss born designers,  English designer Isa Arfen and for the London store Liberty of London."]}, {"page": "Doreen Spooner", "response": ["Spooner's first front page scoop came in the summer of 1963 when, in a shadowy London pub, she surreptitiously snapped Christine Keeler and Mandy Rice-Davies, the two notorious call girls at the heart of the Profumo Affair. In the 1960s and 70s, Spooner worked closely with Felicity Green, the Mirror's fashion editor, in promoting the revolutionary fashions and styles of 'Swinging London', photographing all the iconic figures of those years: Mary Quant, Vidal Sassoon, Barbara Hulanicki of Biba as well as the great models like Twiggy of whom Spooner was especially fond.  'It was simply impossible to take a bad photograph of her.' This was the heyday of the Daily Mirror, when it reached a circulation of around 5 million and celebrated with a party at the Royal Albert Hall, where The Beatles performed the cabaret. "]}]}}