{"wiki_id": "http://www.wikidata.org/entity/Q4908938", "itemLabel": "Bill Eyden", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Eyden", "wikipedia_page": {"main": "William James  \"Bill\" Eyden (4 May 1930, Hounslow, Middlesex – 15 October 2004, Isleworth, Middlesex) was an English jazz drummer.", "link_mentions": [{"page": "Procol Harum", "response": ["At Olympic Studios, southwest London, with session drummer (and non-Paramount) Bill Eyden, producer Denny Cordell and sound engineer Keith Grant, the group recorded \"A Whiter Shade of Pale\", and it was released on 12 May 1967. With a structure reminiscent of Baroque music, a countermelody based on J. S. Bach's Orchestral Suite N° 3 in D Major played by Fisher's Hammond organ, Brooker's vocals and Reid's lyrics, the single reached No. 1 on the UK Singles Chart and the Canadian RPM Magazine chart. It did almost as well in the United States, reaching No. 5 on 29 July 1967. In Australia, it was No. 1 for many weeks, setting a record of 8 weeks in Melbourne."]}, {"page": "2004 in the United Kingdom", "response": ["* 15 October – Bill Eyden, jazz drummer (born 1930)"]}, {"page": "Ronnie Scott", "response": [":Ronnie Scott (tenor sax), Tubby Hayes (tenor sax, vibraphone), Terry Shannon (piano), Phil Bates (double bass), Bill Eyden (drums)"]}, {"page": "A Whiter Shade of Pale", "response": ["Procol Harum recorded \"A Whiter Shade of Pale\" at Olympic Sound Studios in London, England. The recording was produced by Denny Cordell. Because they did not have a regular drummer, the drums were played by Bill Eyden, a session musician. The track was completed in two takes, with no subsequent overdubbing.", "The first promotional clip for \"A Whiter Shade of Pale\" was shot in the ruins of Witley Court in Worcestershire, England. It features four of the five musicians who played on the hit single: Gary Brooker, Matthew Fisher, David Knights and Ray Royer, in performance and walking through the ruins. Only the drummer in the video is not on the record: early band member Bobby Harrison is seen miming to session man Bill Eyden's drumming. The film was directed by Peter Clifton, whose insertion of Vietnam War newsreel footage caused it to be banned from airplay on the BBC's Top of the Pops TV show.", "* Bill Eyden – drums", "*Bill Eyden Obituary"]}, {"page": "Procol Harum (album)", "response": ["* Bill Eyden – drums (US 1)"]}, {"page": "B. J. Wilson", "response": ["While he was busy with session drumming, former bandmate Gary Brooker had put together a new band, Procol Harum, and despite having a huge hit with \"A Whiter Shade of Pale\" (which featured jazz session drummer Bill Eyden) had difficulty getting a stable band for recording follow-up material. Eventually, Wilson joined Procol Harum in the summer of 1967, along with fellow ex-Paramount Robin Trower."]}, {"page": "Dick Morrissey", "response": [" he appeared regularly at the Marquee Club from August 1960, and recorded his first solo album at the age of 21, It’s Morrissey, Man! (1961) for Fontana, featuring Stan Jones on piano, Colin Barnes on drums, and The Jazz Couriers founding member Malcolm Cecil on bass. He spent most of 1962 in Calcutta, India as part of the Ashley Kozak Quartet, playing three two-hour sessions seven days a week, before returning to the UK and forming his quartet with Harry South – who had also been in the quartet in Calcutta – on piano. They were joined by former The Jazz Couriers bassist Phil Bates and variously, another ex-The Jazz Couriers member, Bill Eyden, Jackie Dougan or Phil Seamen on drums. The Dick Morrissey Quartet recorded three LPs, Have You Heard? (1963); the live recording Storm Warning! (1965) on Mercury; and Here and Now and Sounding Good! (1966). The quartet, played regular London gigs at The Bull's Head, Barnes and at Ronnie Scott's, whose manager, Pete King, once said that Ronnie's was kept going in those days due to the crowds Dick Morrissey pulled in. During this time he also played extensively in bands led by Ian Hamer and Harry South, including The Six Sounds, featuring Ken Wray and Dick Morrissey, a band which by 1966 had developed into the Ian Hamer Sextet featuring South, Dick Morrissey, Keith Christie, Kenny Napper and Bill Eyden, among other leading UK-based jazz musicians."]}, {"page": "Spike Robinson", "response": ["For most of the next 30 years he lived and worked in Colorado, eventually taking up music again, this time playing tenor saxophone and working nights at local clubs. A constant musical companion of these times was Dave Grusin. In 1981, Robinson recorded for the first time since his London sessions, which also featured pianist Victor Feldman and bassist Ray Brown. His album was Spike Robinson Plays Harry Warren. Encouraged to visit the UK by a British fan, in 1984 Robinson began a series of tours which were so successful that he took early retirement from his engineering job to turn to a full-time career in music, appearing with established British jazz musicians such as fellow tenor Dick Morrissey, pianist Bill Le Sage, bassist Alec Dankworth and drummer Bill Eyden, among others."]}, {"page": "1930 in the United Kingdom", "response": ["* 4 May – Bill Eyden, jazz drummer (died 2004)"]}, {"page": "Here and Now and Sounding Good!", "response": ["*Bill Eyden - drums"]}, {"page": "Sonny Stitt / Live at Ronnie Scott's", "response": ["*Bill Eyden - drums"]}, {"page": "The Jazz Couriers", "response": ["The quintet's first line-up consisted of Tubby Hayes and Ronnie Scott on tenor saxophones,Ronnie Scott discography at David Taylor's British jazz web site  with Terry Shannon (piano), Malcolm Cecil (bass) and Bill Eyden (drums) and made their debut on the opening night at the new Flamingo Club in Wardour Street, Soho. They shared the gig with Tony Kinsey's Quintet featuring Joe Harriott.The Jazz Couriers at David Taylor's British jazz web site  The Jazz Couriers were chosen by the National Jazz Federation to play the opening sets when the Dave Brubeck Quartet made their first tour of the UK in February 1958."]}, {"page": "The Greatest Little Soul Band in the Land", "response": ["*Bill Eyden - drums"]}, {"page": "Live at the Bull – Tribute Vols. 1–2", "response": ["Live at the Bull – Tribute Vols. 1–2 is a 2-CD tribute album released in 2007 featuring  tenor saxophonists  Dick Morrissey and Spike Robinson accompanied by Bill Le Sage, Bill Eyden, Alec Dankworth, John Pearce and Simon Morton. It was recorded live at The Bull's Head, Barnes, London in 1987 and 1988.", "*Bill Eyden - drums"]}, {"page": "The Bull's Head, Barnes", "response": ["*Live at the Bull – Tribute Vols. 1–2. Featuring Dick Morrissey, Spike Robinson, Bill Le Sage, Alec Dankworth, Bill Eyden (recorded 1987/8). Bulls Head Music. 2007"]}, {"page": "Sound Venture", "response": ["*Bill Eyden – drums"]}, {"page": "Ian Hamer (musician)", "response": ["In 1963, together with Harry South, he led a band called The Six Sounds, featuring Ken Wray and Dick Morrissey, and which by 1966 had developed into his own band, the Ian Hamer Sextet. The Sextet featured variously South, Dick Morrissey, Keith Christie, Kenny Napper, Bill Eyden, Tubby Hayes, Alan Skidmore, Spike Wells, Daryl Runswick, Alan Branscombe and Ron Mathewson. Also in 1966, Hamer joined the Top of the Pops studio orchestra conducted by Johnny Pearson."]}, {"page": "Georgie Fame and the Blue Flames", "response": ["Reece became ill in 1964 and was replaced by Tommy Frost. Jimmie Nicol spent a brief period as drummer, then left to replace Ringo Starr for 13 days on a Beatles tour. Phil Seamen and Micky Waller sat in for Nicol until Bill Eyden became the band's full-time drummer in September 1964."]}, {"page": "1930 in jazz", "response": ["* 4 – Bill Eyden, English drummer (died 2004)."]}, {"page": "Deaths in October 2004", "response": ["*Bill Eyden, 74, British jazz drummer."]}, {"page": "2004 in jazz", "response": ["* 15 – Bill Eyden, English drummer (born 1930)."]}, {"page": "List of years in jazz", "response": ["* 2004 in jazz, deaths of Anthony Lacen, Artie Shaw, Barney Kessel, Bent Jædig, Bill Eyden, Billy May, Billy \"Uke\" Scott, Bjørnar Andresen, Bob Maize, Calvin Jones, Coleridge-Taylor Perkinson, Colin Smith, Cy Coleman, Dick Heckstall-Smith, Don Cornell, Don Tosti, Ella Johnson, Elvin Jones, Frank Isola, Frank Mantooth, G. T. Hogan, Gil Coggins, Gil Mellé, Gordon Brisker, Hank Garland, Hank Marr, Illinois Jacquet, J. R. Mitchell, Jack Sperling, Jackie Paris, James Williams, Jimmy Coe, Joe Bushkin, Joe Kennedy Jr., Joe Springer, John Guerin, John LaPorta, John Mayer, John R. T. Davies, Louis Satterfield, Lucille Dixon Robertson, Malachi Favors, Mark Ledford, Max Geldray, Michel Colombier, Milt Bernhart, Neil Ardley, Pete Jolly, Pete Strange, Preston Love, Randolph Colville, Ray Charles, Rick Henderson, Robin Kenyatta, Sigurd Køhn, Steve Lacy, Tony Lee, Tony Mottola, Vernon Alley, Waldren Joseph, Wallace Davenport, and Walter Perkins.", "* 1930 in jazz, births of Abbey Lincoln, Ack van Rooyen, Ahmad Jamal, Andy White, Annie Ross, Ben Tucker, Benny Powell, Big Tiny Little, Bill Berry, Bill Eyden, Bill Hughes, Blue Mitchell, Bob Hammer, Bob Havens, Booker Ervin, Buddy Bregman, Buddy Montgomery, Chris Barber, Christiane Legrand, Claude Bolling, Clifford Brown, Dakota Staton, Dave McKenna, David Amram, Derek Bailey, Derek Humble, Donald Washington Sr., Ed Thigpen, Ed Wiley Jr., Eddie Bo, Eddie Costa, Eddie Locke, Einar Iversen, Eric Dixon, Erich Kleinschuster, Erik Moseholm, Francis Coppieters, Frank Strazzeri, Friedrich Gulda, George Girard, Gerhard Aspheim, Grover Mitchell, Hank Garland, Hank Mobley, Helen Merrill, Herb Pomeroy, Herbie Mann, Irene Reid, Jack Nimitz, Jack Sharpe, Jackie Dougan, Jay Migliori, Jim Hall, Jimmy Deuchar, Joe Maini, Joe Porcaro, John Fischer, John Mayer, John Neely, Johnny Varro, Joyce Collins, Kenny Ball, Kenny Wheeler, Little Walter, Marilyn Moore, Marty Grosz, Maxine Daniels, Mike Zwerin, Mikkel Flagstad, Morgana King, Muhal Richard Abrams, Nancy Harrow, Ornette Coleman, Oscar Klein, Papa Bue, Pat Halcox, Paul Horn, Pepper Adams, Pete Fountain, Ray Charles, Richard B. Boone, Richard Davis, Richie Kamuca, Rolf Billberg, Ron Collier, Ronnell Bright, Roy Fisher, Sabu Martinez, Sam Most, Sam Noto, Shungo Sawada, Sivuca, Sonny Rollins, Spike Robinson, Stan Greig, Tommy Bryant, Tommy Flanagan, Tommy Tedesco, Vic Ash, and Walter Benton."]}, {"page": "List of Procol Harum members", "response": ["Procol Harum were formed in April 1967 by former Paramounts pianist and vocalist Gary Brooker and his songwriting partner Keith Reid, who enlisted Ray Royer, David Knights, Matthew Fisher and Bobby Harrison for the group's initial incarnation. For the recording of the band's debut single \"A Whiter Shade of Pale\", producer Denny Cordell brought in session drummer Bill Eyden in place of Harrison. Shortly after the single was released, Royer and Harrison left Procol Harum to form Freedom, with Brooker's former Paramounts bandmates Robin Trower and Barrie \"B. J.\" Wilson taking their respective positions. The new lineup released Procol Harum, Shine On Brightly and A Salty Dog, before Fisher and Knights left in late 1969. They were replaced by another former Paramounts member, Chris Copping."]}]}}