{"wiki_id": "http://www.wikidata.org/entity/Q4913196", "itemLabel": "Billy Rafferty", "itemDescription": "British footballer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Rafferty", "wikipedia_page": {"main": "William Henry Rafferty (born 30 December 1950) is a retired Scottish footballer who played as a forward. He appeared in the Football League for Coventry City, Blackpool, Plymouth Argyle, Carlisle United, Wolverhampton Wanderers, Newcastle United, Portsmouth and AFC Bournemouth, scoring 145 goals in 468 matches. He finished his career in Portugal with spells at Louletano and Farense.\nRafferty began his league career with Coventry City after joining them from Port Glasgow but found opportunities few and far between. A move to Blackpool in 1972 saw him play and score more regularly before joining Plymouth Argyle a year later. With his striking partner, Paul Mariner, he became an important player in the Argyle side that won promotion to the Football League Second Division in 1975. Their partnership contributed 47 goals to the campaign, with Rafferty scoring 26.\nHe then joined Carlisle United where he continued to score regularly. He moved on to Wolverhampton Wanderers and Newcastle United. After Newcastle he joined Portsmouth in 1980. At Portsmouth, Rafferty once again became a key striker, winning the Third Division championship in 1983 before joining AFC Bournemouth, which would be his last league club in England.", "link_mentions": [{"page": "2003–04 Plymouth Argyle F.C. season", "response": ["*17 January 2004: Billy Rafferty and Paul Mariner make a guest appearance at Home Park. Argyle played Rushden & Diamonds on that day and won 3–0."]}, {"page": "Tommy Hutchison", "response": ["In 1972, Coventry City manager Joe Mercer offered £140,000 cash plus Billy Rafferty for Hutchison's services. He signed for the Midlands club, leaping at the chance to play in the First Division on a regular basis. 'Hutch' remained at Highfield Road for eight years, playing 355 games and scoring 30 goals. During his time at Coventry he played probably the best football of his career, winning all of his 17 Scottish caps while at the club. Nicknamed \"Mr Magic\" by the club chairman, Derrick Robins, he was voted supporter's Player of the Season three times during his eight-year spell at Highfield Road – a feat no other Sky Blues player has yet equalled."]}, {"page": "Rafferty", "response": ["* Billy Rafferty (born 1950), Scottish footballer"]}, {"page": "History of Blackpool F.C. (1962–present)", "response": ["The season's main transfer dealing involved Tommy Hutchison, who left for Coventry City, with Billy Rafferty going in the opposite direction. The biggest change, however, came in the manager's office when Bob Stokoe left in November for Sunderland in his native North-East."]}, {"page": "List of Portsmouth F.C. seasons", "response": ["|Billy Rafferty"]}, {"page": "List of foreign Primeira Liga players", "response": ["*Billy Rafferty – Farense – 1985–1988"]}, {"page": "Brian Johnson (footballer, born 1955)", "response": ["He began his career as an apprentice with Plymouth Argyle before making his first team debut in August 1973 at the age of 17.\"Brian Johnson\". Greens on Screen. Retrieved 25 June 2010. A key member of the side that won promotion to the Second Division in 1975, alongside the strike-duo of Paul Mariner and Billy Rafferty, he was considered to be a reliable and consistent performer throughout his stay with the Pilgrims. During a reserve team game in 1981, Johnson was knocked unconscious in a collision with teammate Neil Hards. He suffered a fractured cheekbone and damage to both eyes, which required surgery and his jawbone to be wired up. He resumed training four weeks later, but during his second loan stint with Torquay United he experienced severe pain when heading the ball. Rather than risk permanent blindness, Johnson retired at the age of 26."]}, {"page": "List of Coventry City F.C. seasons", "response": ["|align=left| Chris Chilton Billy Rafferty"]}, {"page": "History of Plymouth Argyle F.C.", "response": ["After spending six years in Division Three, Argyle finally returned to Division Two in 1974–75, under the management of Tony Waiters. This was mainly thanks to strike partners Paul Mariner and Billy Rafferty, who scored a very impressive 46 goals between them."]}, {"page": "PFA Team of the Year (1970s)", "response": ["!scope=row|Billy Rafferty"]}]}}