{"wiki_id": "http://www.wikidata.org/entity/Q4910105", "itemLabel": "Bill McFettridge", "itemDescription": "Scottish footballer (1862-1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_McFettridge", "wikipedia_page": {"main": "William McLintock McFettridge (22 April 1864 – 9 May 1931) was a Scottish professional footballer who played as a wing half. He played his early football for Thornliebank, a club based in the south of the city of Glasgow, Scotland and appeared as a 16 year old in the 1880 Scottish Cup Final. Thornliebank were beaten 3–0 by Queen's Park, and McFettridge played centre-half. In 1883 he moved to England to play for Padiham, then a power in Lancashire football. In 1886 he transferred to Burnley.\nMcFettridge soon established himself in the Burnley team and showed himself to be a versatile player with an ability to play in attack or defence. However, he soon made the right-half position his own and built a strong relationship with left-half Jack Keenan. He played with a hard, robust style proving very effective in those early days.", "link_mentions": [{"page": "Ross McMahon", "response": ["Ross McMahon was signed by Burnley in November 1888 and on 10-Nov-1888 McMahon made his debut at Turf Moor, Burnley, when the visitors were West Bromwich Albion. McMahon played centre-forward in place of Bill McFettridge. Burnley defended well in both the 1st and 2nd halves and kept their first clean sheet of the season. Burnley scored a goal in each half to win 2–0. Although a happy debut for McMahaon it was marred by him getting injured in the fortieth minute and Burnley having to play with ten men for most of the match. McMahon was fit enough to play three weeks after his debut. This time the venue was Thorneyholme Road, Accrington home of Accrington. Again McMahon had to go off injured before half-time but this time he team were heavily beaten 5-1 by the home side. And that was his last League game for Burnley."]}, {"page": "1889–90 Burnley F.C. season", "response": ["|Bill McFettridge"]}, {"page": "1890–91 Burnley F.C. season", "response": ["|Bill McFettridge"]}, {"page": "1891–92 Burnley F.C. season", "response": ["|Bill McFettridge"]}, {"page": "1880 Scottish Cup Final", "response": ["|HB ||  Bill McFettridge"]}]}}