{"wiki_id": "http://www.wikidata.org/entity/Q4913244", "itemLabel": "Billy Riley", "itemDescription": "British professional wrestler", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Riley", "wikipedia_page": {"main": "Billy Riley (22 June 1896 – 27 August 1977) was an English practitioner and teacher of catch wrestling.  As a trainer in the sport, he taught some of the leading post-World War II figures in catch wrestling at his training school \"The Snake Pit\" in Wigan, Lancashire, England.\n\n", "link_mentions": [{"page": "Lancashire", "response": ["Lancashire has a long history of wrestling, developing its own style called Lancashire wrestling, with many clubs that over the years have produced many renowned wrestlers. Some of these have crossed over into the mainstream world of professional wrestling, including Shak Khan, Billy Riley, Davey Boy Smith, William Regal, Wade Barrett and the Dynamite Kid."]}, {"page": "Giant Haystacks", "response": ["Throughout Haystacks' homeland success he also wrestled all over the world. Ruane wrestled in Calgary, Alberta, Canada for Stu Hart's Stampede Wrestling promotion as the Loch Ness Monster, managed by J.R. Foley from Wigan, England (alias John Foley, alumnus of Billy Riley's Wigan Snakepit wrestling school). He also regularly worked for the CWA in Germany and Austria, winning several trophy tournaments there."]}, {"page": "Shoot wrestling", "response": ["Karl Gotch is one of the most important figures in the development of shoot wrestling. Karl Gotch would begin his journey into wrestling in the German and North American professional wrestling circuits, where Gotch found moderate success. However, it was in his tours of Japan that the early formations of shoot wrestling took place. Gotch was a student of the \"Snake Pit\" gym, run by the renowned catch wrestler Billy Riley of Wigan. The gym was the centre of learning submission wrestling as practiced in the mining town of Wigan, popularly known as catch-as-catch-can wrestling. It was here that Karl Gotch honed his catch wrestling skills. Karl Gotch also travelled to India to practice the wrestling form of Pehlwani; later on he would propagate the exercises using the \"Hindu mace\" (large clubs) and would go on to incorporate the Indian system of exercises using push-ups, neck exercises, yogic breathing exercises and \"Hindu squats\" for conditioning. Gotch attained legendary status in Japan, earning the nickname God of Wrestling. In the 1970s he taught catch wrestling-based hooking and shooting to the likes of Antonio Inoki, Tatsumi Fujinami, Yoshiaki Fujiwara, Satoru Sayama, Masami Soranaka, and Akira Maeda. Most of these professional wrestlers already had backgrounds in legitimate martial arts. Masami Soranaka had been a student of full contact karate, kodokan judo, and sumo. Yoshiaki Fujiwara was already a black belt in judo, while Satoru Sayama had studied Muay Thai with Toshio Fujiwara and went on to study sambo with Victor Koga. This would eventually lead to the added influences of karate, Muay Thai and judo to the wrestling style."]}, {"page": "Genki Sudo", "response": ["Billy Riley → Karl Gotch → Yoshiaki Fujiwara → Masakatsu Funaki → Genki Sudo"]}, {"page": "Karl Gotch", "response": ["Istaz's professional wrestling career began after training in the \"Snake Pit\", run by the renowned catch wrestler Billy Riley. He debuted in the 1950s, wrestling throughout Europe under the ring name Karl Krauser, and winning various titles including the German Heavyweight Championship and the European Championship."]}, {"page": "Ad Santel", "response": ["The impact of these performances on Japan was immense. The Japanese were fascinated by the submissions taught in catch wrestling, and Japanese fighters traveled to Europe in order to either participate in various tournaments or to learn catch wrestling at European schools such as Billy Riley's Snake Pit in Wigan, UK. Okabe and the judo challengers were effectively expelled from Kodokan, but some of them followed Santel to the United States to train with him, among them Hikoo Shoji, who became a freestyle wrestling pioneer in Japan."]}, {"page": "Catch wrestling", "response": ["Pins were the predominant way to win, to the point some matches didn't even include submissions as an additional way; submission holds (also called \"punishment holds\") were instead exclusively for control and to force the opponent into a pin under the threat of pain and injury. According to Tommy Heyes, student of Billy Riley, there are no registers of a single classical catch wrestler winning by submission. This is the reason why leglocks and neck cranks were emphasized as valid techniques, as while they are difficult to use as finishing moves without a good base, they can be used to force movement. Also, just as today \"tapping out\" signifies a concession as does shouting out \"Uncle!\", back in the heyday of catch wrestling rolling to one's back could also signify defeat, as it would mean a pin. Catch-as-catch-can toeholds typically only exert force if the opponent sits still; therefore, Frank Gotch won many matches by forcing his opponent to roll over onto their back with the threat of his signature toehold.Frank Gotch: World's Greatest Wrestler, Publisher: William s Hein & Co (January 1991), ", "Karl Gotch was a catch wrestler and a student of Billy Riley's \"Snake Pit\" training school in the Aspull area of Wigan in then Lancashire. Gotch taught catch wrestling to Japanese professional wrestlers in the 1970s including Antonio Inoki, Tatsumi Fujinami, Hiro Matsuda, Osamu Kido, Satoru Sayama (Tiger Mask) and Yoshiaki Fujiwara. Starting from 1976, one of these professional wrestlers, Inoki, hosted a series of mixed martial arts bouts against the champions of other disciplines, including a legit mixed-rules match against boxer Muhammad Ali. This resulted in unprecedented popularity of the clash-of-styles bouts in Japan. His matches showcased catch wrestling moves like the sleeper hold, cross arm breaker, seated armbar, Indian deathlock and keylock.", "* Billy Riley"]}, {"page": "Billy Robinson", "response": ["Robinson began his amateur wrestling career in Britain in 1955. He was the British National Wrestling Champion in 1957, and in 1958 he was the European Open Wrestling Champion in the light heavyweight class, beating an Olympic bronze medal winner in the finals. Billy Robinson also attended the fabled wrestling gym of legendary trainer Billy Riley in Wigan, (nicknamed the \"Snake Pit\" - years later, affiliate \"Snake Pit\" gyms would later be established in Japan and the United States.) Riley's Gym was one of the most respected catch wrestling training schools in all of the world. Legends such as Karl Gotch had trained in catch wrestling with Riley at his gym. Lou Thesz also briefly trained at his gym. Robinson had to survive bare minimum amenities (luxuries such as a toilet were not provided at Riley's Gym), a very rough training environment (Riley was very impatient with those who showed even the slightest bit of weakness on the mat) and rigorous conditioning. Robinson stayed at the \"Snake Pit\" for eight years."]}, {"page": "Snake pit (disambiguation)", "response": ["* The Snake Pit, a catch wrestling training school run by Billy Riley in Wigan, England"]}, {"page": "Wigan", "response": ["Wigan is also home of the Snake Pit, one of the world's oldest and most important Catch Wrestling schools, founded by professional wrestler Billy Riley."]}, {"page": "Jack Dempsey (wrestler)", "response": ["Adopting his grandmother's surname, he began wrestling under the name Jack Dempsey and gained a large following while wrestling for promoter Billy Riley during the next several years. By the 1950s, he had begun pursuing the British Welterweight Championship held by Tony Lawrence and eventually defeated him for the title in 1953. Dempsey would defend his title for over three years before losing to Mick McManus in London, England on 5 January 1957. Feuding with McManus over the next year, he would regain the Welterweight Championship in one of the most anticipated matches of the era defeating McManus in London on 23 April 1958.", "He would remain Welterweight champion for eight years until vacating the title due to illness in October 1966. Upon doctors orders, he eventually retired from active competition so as to work with his wife Theresa in their Vine Street store in Whelley and later worked at Gullicks in Wigan. During the 1970s, he became an instructor at Riley's gym along with Billy Riley's son Ernie and head trainer Roy Wood. He later appeared in a 1989 ITV documentary on the gym, First Tuesday - The Wigan Hold, which eventually prompted government funding to move the gym to a location with modern facilities several miles from the original gym.  In the years following his retirement, Moore became known as a popular local character often seen wearing a trademark bow tie and beret as well as smoking a King Edward cigar, often telling stories of his wrestling days in local pubs."]}, {"page": "List of Baki the Grappler characters", "response": [":A catch wrestler who is beaten by Orochi Katsumi in round 1.  He lost despite managing to dislocate two of Katsumi's joints. He is fairly well known as Doppo knew quite a bit about him. He is trained by Billy Riley, who happened to be a real-life legendary trainer of catch wrestlers in Great Britain. He later fights and is choked out by Yujiro. He was given the nickname \"Lion Slayer\" for fighting lions while training in Africa."]}, {"page": "First Tuesday (TV programme)", "response": ["* The Wigan Hold (1989, filmed 1988), about wrestling at Riley's Gym, featuring former professional wrestlers and Riley's Gym alumni Tommy Moore and Ernie Riley (son of Billy Riley)"]}, {"page": "William Riley", "response": ["*Billy Riley (1889–1977), wrestler", "*Billy Riley (baseball) (1855–1887), outfielder in Major League Baseball"]}, {"page": "List of oldest surviving professional wrestlers", "response": ["| Billy Riley || M ||  years || June 22, 1896 || August 27, 1977 || 1968 || Last known match took place in 1968."]}, {"page": "Brad Suggs", "response": ["Suggs appeared on more than eight Sun records (more than Elvis Presley, Billy Riley, Warren Smith, Jerry Lee Lewis, Johnny Cash, and Charlie Rich) (1). Suggs also sang and got label credit on \"Don’t Believe\" (Sun 216),  \"Are You Ashamed of Me?\" (Sun 225), and \"Bad Girl\" (Sun 238), which were recorded with the Slim Rhodes' band.", "*Billy Riley—\"One More Time\" (Sun 322)"]}, {"page": "Yorinaga Nakamura", "response": ["* Billy Riley/Frank Wolfe  → Karl Gotch → Satoru Sayama → Yorinaga Nakamura"]}, {"page": "1977 in professional wrestling", "response": ["*August 27 - Billy Riley, 81"]}, {"page": "1968 in professional wrestling", "response": ["* Billy Riley (1920s-1968) "]}]}}