{"wiki_id": "http://www.wikidata.org/entity/Q4912671", "itemLabel": "Billy Harper", "itemDescription": "English footballer (1897-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Harper_(footballer,_born_1897)", "wikipedia_page": {"main": "William Harper (17 August 1897 – 20 January 1982)  was an English professional footballer who played as a right-back. Born in Blackburn, Lancashire, he started his career in local football with Feniscowles in the Blackburn Amateur League. While playing for Feniscowles, he was scouted by former Everton and Blackpool player William Williams, who recommended Harper to Third Division North side Nelson. He subsequently joined Nelson in August 1924, initially as an amateur player.\nHarper was given a professional contract in December 1924, and went on to make his debut for Nelson on 18 March 1925 in the 1–2 defeat away at Lincoln City. He lost his place in the team following that match, but returned to the starting line-up later the same month in place of the unavailable Bob Lilley. Harper made a total of six league appearances for Nelson in the 1924–25 season. However, he was not retained at the end of the campaign and returned to non-League football with Lancashire Combination club Darwen. He later had a spell with Chorley. Harper died in Blackpool in 1982 at the age of 84.", "link_mentions": [{"page": "William Harper", "response": ["* Billy Harper (footballer, born 1897) (1897–1982), English footballer", "* Billy Harper (footballer, born 1877) (1877–1947), English footballer", "* Billy Harper (born 1943), American jazz saxophonist"]}, {"page": "Billy Harper", "response": ["Billy Harper (born January 17, 1943) is an American jazz saxophonist, \"one of a generation of Coltrane-influenced tenor saxophonists\" with a distinctively stern, hard-as-nails sound on his instrument.Chris Kelsey, Billy Harper Biography, AllMusic", "Harper has played with some of jazz's greatest drummers; he served with Art Blakey's Messengers for two years (1968–1970); he played very briefly with Elvin Jones (1970), he played with the Thad Jones/ Mel Lewis Orchestra in the 1970s, and was a member of Max Roach's quartet from 1971–1978. In 1979, Harper formed his own group, touring with it and documenting its music on the recording Billy Harper Quintet in Europe, and he was featured as a soloist on a 1983 recording, Such Great Friends, with virtuoso, visionary pianist and record producer Stanley Cowell.  After a period of relative inactivity in the 1980s, Harper came back strong with another international tour, which ended with perhaps his most ambitious recording: the three-volume Live on Tour in the Far East (1991).  In the new millennium, Harper's recording activity has been subdued and sporadic, though more recently he appeared as a regular member of pianist-jazz historian Randy Weston's ensembles.  In 2013, they recorded their first album as a duo, entitled The Roots of the Blues. \"Randy Weston & Billy Harper on The Roots of the Blues\", Open Sky Jazz, November 28, 2013.", "A retrospective of Billy Harper's career would include the following among its highlights: The saxophonist performed on Gil Evans' 1973 album Svengali, and contributed two of the most-performed tunes in the band's repertoire: \"Priestess\" and \"Thoroughbred\". Harper's own 1973 album Capra Black \"remains one of the seminal recordings of jazz's black consciousness movement – a profoundly spiritual effort that channels both the intellectual complexity of the avant garde as well as the emotional potency of gospel\".Jason Ankeny, Capra Black review, AllMusic The Italian jazz label Black Saint was launched with Harper's 1975 album, Black Saint. His later releases have mostly been on SteepleChase and Evidence Records.", "Long associated almost exclusively with the inner circle of the New York City jazz scene — except for breaks while touring with his ensembles to Europe and the far East — Harper, in mid-2017, suddenly attained a degree of international prominence, because of his short but key role in the acclaimed jazz film, I Called Him Morgan. Released for home streaming and purchase in June 2017, the film documents the music and life of trumpet prodigy Lee Morgan and the woman who saves and restores him after he hit rock bottom due to heroin addiction. It is a movie that makes the viewer a partner with its Swedish director, in his seven-year search for the evidence that might help explain how the same woman who was Morgan's savior, would become his killer at the instant he was retaking the bandstand for the last set at Slug's Saloon, a jazz club on the Bowery in lower East Manhattan. Walking right alongside Lee Morgan at this moment — the someone who hears a \"bang\" that for the next several extended seconds leaves both men — the actual victim and the bandmate — equally stunned and confused — was Billy Harper.", "*1975: Black Saint (Billy Harper Quintet On Tour In Europe '75) (Black Saint)", "*1979: Billy Harper Quintet in Europe (Soul Note)", "*1980: Billy Harper Quintet [live] (PolJazz)"]}, {"page": "1924–25 Nelson F.C. season", "response": ["While there were several changed to the playing staff, the core of the team that had played in the Second Division remained intact. Centre forward Joe Eddleston, Nelson's top goalscorer in each of the previous three seasons, was retained along with captain Clem Rigg, Welsh half-back Jack Newnes and goalkeeper Harry Abbott. The two most senior squad members, David Wilson and goalkeeper Joseph Birds, retired from professional football aged 40 and 36 respectively. Inside forward Dick Crawshaw, who had been the team's second-highest scorer in 1923–24 with five goals, moved to Stalybridge Celtic.Dykes (2009), p. 30 Scottish forward Mike McCulloch ended his two-year association with the club by joining Chesterfield on a free transfer, while half-back Leigh Collins signed for New Brighton. Other players, including William Lammus and Ernest Gillibrand, left Nelson having failed to establish themselves in the first-team during their time with the club.Dykes (2009), p. 37 Manager Wilson spent a total of £750 (£ as of 2011) on new players in the summer of 1924. Billy Bottrill and Bill Ellerington arrived from Middlesbrough, while Barrow full-back James Phizacklea was signed to bolster the defensive line.Dykes (2009), p. 58 Several young players were acquired from local non-League football during the close season, including Ambrose Harris from Briercliffe and Billy Harper, formerly of Feniscowles. The Nelson squad was considered by the local newspaper to be stronger than the one which had won the Third Division North two seasons earlier.", "| Billy Harper", "|align=\"left\"|Billy Harper"]}]}}