{"wiki_id": "http://www.wikidata.org/entity/Q4912217", "itemLabel": "Billy Bland", "itemDescription": "British athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Bland_(runner)", "wikipedia_page": {"main": "Billy Bland (born 1947) is a British former long-distance runner. He was one of the most prominent fell runners from the mid-1970s until the late 1980s, and is arguably the best long-distance fell runner in the history of the sport.\nHe was born in 1947 in Borrowdale in the Lake District. His father Joe Bland was a guides racer and several other members of Billy's family also became fell runners, including his brothers Stuart and David.Bland took part in professional guides races early in his career and was reinstated as an amateur around the time of the inaugural Borrowdale Fell Race in 1974. By 1976 he had improved enough to finish eighth in the British Championships. This was followed by further progression until 1980 when he became the British Champion.Bland is a former holder of the record for the fell running challenge the Bob Graham Round which involves a circuit of forty-two Lake District peaks, covering around sixty-six miles. He accomplished this in a time of 13:53 on 19 June 1982. This stood as the fastest time until 8 July 2018 when it was beaten by Kilian Jornet.Among Bland's other outstanding records are that for the Wasdale Fell Race, which he completed in 3:25:21 in 1982 (only three weeks after his Bob Graham Round record). This time has not been approached in recent years, despite the event being one of the counting races in the national championships on several occasions. He also holds the record for the Borrowdale Fell Race, having run 2:34:38 in 1981.", "link_mentions": [{"page": "Fell running", "response": ["*Wasdale Fell Race AL 21 miles (34 km) 9,000 ft (2750 m) - male record 3:25:21 (Billy Bland, 1982), female record 4:12:17 (Janet McIver and Jackie Lee, 2008)"]}, {"page": "Bob Graham Round", "response": ["The Round was first repeated, in a better time, in 1960 by Alan Heaton. Since then over 2500 individuals have completed the Round with the fastest time being 12hr 52m set by Kilian Jornet in 2018, surpassing by more than an hour, Billy Bland's record which had stood for 36 years. The women's record is 14hr 34m set by Beth Pascall in 2020. The Lakeland 24 Hour record has also been improved with the current holder, Kim Collison, successfully reaching 78 summits in the allotted time.", "* 1976: Billy Bland – 18:50", "* 1982: Billy Bland – 13:53"]}, {"page": "Joss Naylor", "response": ["* Billy Bland (runner)"]}, {"page": "Rob Jebb", "response": ["In July 2016, Jebb completed the Bob Graham Round in 14 hours 30 minutes, then the second-fastest round of all time and the first time any runner had come within an hour of Billy Bland's 1982 record of 13 hours 53 minutes."]}, {"page": "William Bland (disambiguation)", "response": ["*Billy Bland (1932–2017), American singer/songwriter", "*Billy Bland (runner) (born 1947), British fell runner"]}, {"page": "Gavin Bland", "response": ["Gavin is a nephew of Billy Bland and several members of his family were active in fell running. As a youth, Gavin took part in races with significant success. Perhaps the most notable performance in the early part of his running career was a second place in the junior race at the World Mountain Running Trophy in 1990.Bill Smith, “Profile: Gavin and Jonathan Bland”, The Fellrunner, Feb 1993, 14-15. He also represented England in senior races at the World Mountain Running Trophy in 1991WMRA: World Mountain Running Trophy 1991. and 1992.WMRA: World Mountain Running Trophy 1992."]}, {"page": "Ben Nevis Race", "response": ["| Billy Bland"]}, {"page": "Borrowdale Fell Race", "response": ["The men's course record is held by Billy Bland with a time of 2:34:38 set in 1981.The Fell Runner, Dec 1981, 24-27. The fastest time in the years since then is 2:35:18 by Simon Booth in the 1999 event when the race was featured on the BBC’s Grandstand.\"Bland Clinches Fell Running Title in Front of Home Crowd\", Cumberland & Westmorland Herald, 14 Aug 1999. The women’s record is 3:14:36 by Menna Angharad in 1997.The Fellrunner, Oct 1997, 14, results section, 28.", "Simon Booth has the most wins, with twelve between 1995 and 2010. Billy Bland won ten times between 1976 and 1988. Sarah Haines won the women’s race five times between 1985 and 1990.", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland"]}, {"page": "Wasdale Fell Race", "response": ["Although it is held in July, the race has on many occasions been affected by inclement weather. Navigational problems in poor visibility have often caused runners to go off course. In 1985 even Billy Bland, the course record holder and winner on several occasions, went the wrong way in the mist after Seatallan, finding himself on the wrong side of Haycock and having to go over Haycock and Scoat Fell to get back on course.Steve Chilton, It's a Hill, Get Over It (Dingwall, 2013), 80; CFRA: Wasdale 1993 Results;  CFRA: Wasdale 1996 Results; CFRA: Wasdale 2010 Results.", "The men's course record is 3:25:21, set by Billy Bland in 1982. Bland considers the record to be one of his best performances along with the Borrowdale Fell Race record, and better than his Bob Graham Round record which he had set three weeks before the 1982 Wasdale Race.Steve Chilton, The Round: In Bob Graham's Footsteps (Dingwall, 2015). No other runner has run within five minutes of Bland's Wasdale record.", "Billy Bland has the most wins, with nine between 1980 and 1988. Jasmin Paris has won the women's race six times between 2012 and 2018.", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland"]}, {"page": "Langdale Horseshoe", "response": ["Langdale has one of the oldest course records in fell running, with a time of 1:55:03 set by Andy Styan in 1977. Styan felt that he had been able to run so quickly due to the good conditions and the very strong competition on the day. Styan, Billy Bland, Alan McGee and Mike Short all finished in between 1:55:03 and 1:56:08 that year.Steve Chilton, It's a Hill, Get Over It (Dingwall, 2013), 159-60. Since then, the fastest winning time has been 1:56:13 by Gavin Bland in 1997.", "Billy Bland won five time between 1978 and 1987 and his nephew Gavin Bland won five times between 1990 and 2003. In the women’s race, Pauline Haworth and Ruth Pickvance have the most wins with three each.", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland"]}, {"page": "Three Shires Fell Race", "response": ["| Billy Bland"]}, {"page": "Isle of Jura Fell Race", "response": ["| Billy Bland"]}, {"page": "Ennerdale Horseshoe Fell Race", "response": ["In the 1986 event, Billy Bland waited at the start until five minutes after everyone else had begun so that the other runners could not follow him and take advantage of his detailed route knowledge. Bland then ran through the field and was able to overtake everyone except Hugh Symonds.Richard Askwith, Feet in the Clouds (London, 2004), 151.", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland", "| Billy Bland"]}, {"page": "Sedbergh Hills Fell Race", "response": ["| 1979 || Billy Bland || 2:14:40 || Bridget Hogge || 2:05:26 || Bill Smith, Stud Marks on the Summits (Preston, 1985), 324-27. [Note 1]"]}, {"page": "British Fell Running Championships", "response": ["|Billy Bland"]}, {"page": "Coniston Fell Race", "response": ["| Billy Bland", "| Billy Bland"]}, {"page": "Andy Styan", "response": ["He won the Langdale Horseshoe in 1977, when he set the still-standing record of 1:55:03.Ambleside AC: Langdale Horseshoe. He believed he was able to run so quickly due to the good conditions and the very strong competition on the day from Billy Bland, Alan McGee and Mike Short.Neil Shuttleworth, \"The Record has Stood…\", Up & Down, Sep/Oct 1990, 24-25; Andy Styan, \"That Langdale Record\", The Fellrunner, Summer 2007, 104-05."]}]}}