{"wiki_id": "http://www.wikidata.org/entity/Q4913401", "itemLabel": "Billy Tuft", "itemDescription": "English footballer (1874-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Tuft", "wikipedia_page": {"main": "Willam Tuft (1874 – after 1906) was an English professional association football player in the years prior to the First World War. He made 170 appearances in the Football League.", "link_mentions": [{"page": "List of people from Wolverhampton", "response": ["* Billy Tuft (born 1874) – footballer, full back"]}, {"page": "Phil Bach", "response": ["Two months later, in April 1899, he signed for Middlesbrough again, but failing to break into the first team he was on the move again a year later joining Bristol City. Bach made his debut for Bristol City in the Southern League at right back in a 1–0 win at Swindon Town on 1 September 1900. Bach made 29 appearances in the Southern League, 10 appearances in the Western League and 3 appearances in FA Cup ties during 1900–01 as Bristol City finished runners up in the Southern League. Bristol City gained Football League status for 1901–02 but in the summer of 1901 manager Sam Hollis signed Billy Tuft from Walsall who established himself as the regular right back for the next four seasons. Bach spent four years at Ashton Gate after helping City gain Football League status in 1901 making only 3 League appearances in 1903–04. Bach made his football league debut for Bristol City at right back in the 5–0 win v Glossop on 12 September 1903. In 1904 he was re-instated as an amateur, turning out for Cheltenham Town.History of Cheltenham Town"]}, {"page": "Joe Cottle", "response": ["Born in Bedminster in 1886, Cottle played locally for Dolphins in Bristol before Harry Thickett signed him in June 1905 to play professionally for Bristol City. Cottle made his debut at left back on 30 September 1905 in a 2–1 win at Bradford City. This was the 5th match of a run of 14 successive wins achieved by Bristol City between September and December 1905. Cottle had replaced Billy Tuft in the left back position and retained his place for the rest of the season making 33 appearances as Bristol City won the Second Division championship. Cottle and Archie Annan formed a formidable full back partnership for Bristol City under manager Harry Thickett during the first decade of the 20th century. The following season 1906-07 Cottle missed only one league match making 37 appearances as the \"Robins\" finished runners up in the First Division. Cottle made 36 appearances in both 1907-08 and 1908-09 missing only 2 league matches in each First Division season. In 1908-09 Cottle also played in all 10 FA Cup ties including the 1909 FA Cup Final as City lost 0–1 to Manchester United at the Crystal Palace, the only time that Bristol City have reached the FA Cup Final. He also earned his one cap for England v Ireland in a 4–0 win at Bradford Park Avenue on 13 February 1909., Retrieved 25 September 2018 Cottle was ever present in 1909-10 making 38 appearances. He played in the opening 24 league games of 1910-11 before sustaining a broken leg during a 0–4 defeat at Preston North End on 28 January 1911. Bristol City were relegated back to the Second Division at the end of the season and Cottle left the club in the summer of 1911. There is no mention of Joe Cottle making any appearances for Bristol Rovers in the Southern League. Cottle later joined Mid Rhondda with Bill Demmery the club managed by Archie Annan. Finally Cottle was a publican in Bedminster, Bristol and remained locally until his death in 1958."]}]}}