{"wiki_id": "http://www.wikidata.org/entity/Q4912993", "itemLabel": "Billy McEwan", "itemDescription": "Scottish association football player and manager (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_McEwan_(footballer,_born_1951)", "wikipedia_page": {"main": "William Johnston McGowan McEwan (born 20 June 1951) is a Scottish former professional footballer and manager. He had a 14-year playing career in the Scottish and English professional leagues, playing for seven different clubs. McEwan then undertook a coaching career; he has managed six different English league clubs, plus one club on a caretaker basis twice. McEwan was most recently the manager of Antigua Barracuda but left the post in 2011.", "link_mentions": [{"page": "Sheffield United F.C.", "response": ["With a new ambitious board in place United recruited Ian Porterfield as manager in June 1981. He had an immediate impact, winning the Division Four championship in his first season and taking the club back into the second tier two years later on a meagre budget. Despite this many fans were unhappy with the style of football and odd team selections and Porterfield was sacked in 1986 following supporter protests. Coach Billy McEwan was promoted to the position of manager but failed to improve the standard of play and with attendances falling and the team in danger of relegation once more he was sacked in January 1988. United now turned to the colourful character of Dave Bassett who had most recently had a short, unsuccessful spell as manager of Watford. It was to prove an astute appointment as although he could not prevent relegation in his first season he built a solid, hard working team on a small budget and won back to back promotions, returning the club to the top flight and achieving regular mid-table finishes. With the formation of the Premier League United's old financial problems and willingness to sell star players without replacing them meant the side eventually succumbed to relegation and when an immediate return was not forthcoming Basset was sacked in December 1995."]}, {"page": "Rotherham United F.C.", "response": ["|Billy McEwan"]}, {"page": "Mansfield Town F.C.", "response": ["Haslam left the club, as the \"Three Amigos\" of Perry, Middleton and Saunders purchased the club (but not the ground) for £1 and installed Billy McEwan as manager. He was replaced after Christmas by David Holdsworth. Holdsworth's two-and-a-half year reign bought little improvement to the club and he was dismissed as manager.", "|align=left|Billy McEwan"]}, {"page": "Ian Porterfield", "response": ["The following season, the playing staff was cut and promotion was achieved, but only due to Hull City only beating Burnley 2–0. A third goal would have seen the Humberside club promoted instead. However, ground improvement required by promotion to the Second Division meant there was no further funds for new players. Porterfield was unable to complete the final step into the First Division and finally paid the price being replaced by Billy McEwan on 27 March 1986."]}]}}