{"wiki_id": "http://www.wikidata.org/entity/Q4918556", "itemLabel": "Jamie Scott", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Scott", "wikipedia_page": {"main": "Jamie Scott (born James Christopher Needle; 12 February 1984) is an Ivor Novello Award winning English singer, songwriter and producer.", "link_mentions": [{"page": "1984 in music", "response": ["*February 12 – Jamie Scott, English singer-songwriter"]}, {"page": "The Dome at America's Center", "response": ["| August 27, 2014 || One Direction || Jamie Scott || Where We Are Tour || 52,315 / 52,315 || $4,281,608 ||"]}, {"page": "One Tree Hill (TV series)", "response": ["The ninth and final season mainly focuses on the kidnapping of Nathan, while Haley faces multiple problems running the new Karen's Cafe. Brooke and Julian adjust to life as parents, which leads Julian to make a life-changing mistake. A mysterious problem haunts Clay and he ends up in psychiatric care, where he meets his son, Logan, with the support of Quinn. Millicent is forced to deal with Mouth's sudden weight gain, and Chase starts a friendship with Chris Keller. Lucas returns to Tree Hill as Haley reaches out to him for help. Nathan is later found alive with the help of Dan before he passes away. The series ends as Tric celebrates its tenth anniversary while the entire Tree Hill family (except Lucas and Peyton) face new and exciting possibilities for their futures. Jamie Scott is now a teenager and is the Ravens' new shooting guard.", "| style=\"text-align:center;\"| Jamie Scott"]}, {"page": "Rose Bowl (stadium)", "response": ["| rowspan=3|5 Seconds of SummerJamie Scott"]}, {"page": "James Scott", "response": ["*Jamie Scott (disambiguation)", "*Jamie Scott (born 1984), British singer"]}, {"page": "David Guetta", "response": ["During the summer, David Guetta headlined Tomorrowland, providing a main stage performance for Night 3 on both weekends. In addition Guetta was a guest during Martin Garrix's closing set, during which they debuted their yet to be released single \"So Far Away\" which featured vocals from Jamie Scott and Ellie Goulding. David Guetta also had Dimitri Vegas & Like Mike join him on stage to premier their new song \"Complicated\" which was released on the Friday of the festival's second weekend. During this time Guetta, Vegas, and Mike also performed the latter two's long-awaited single with W&W: \"Crowd Control\".", "On 1 December 2017, Guetta released his long-awaited single \"So Far Away\" being released on Garrix's label STMPD RCRDS. The single version contained vocals from Jamie Scott and Romy Dya. Ellie Goulding's vocals were cut from the song as her label was pushing back the release. That is the reason why the two DJs decided to replace her and use the vocals of Romy Dya. On 25 January 2018 Guetta released a remix version of Sia's Helium along with Dutch DJ Afrojack. This marks Guetta's and Sia's sixth collaboration."]}, {"page": "Dane Bowers", "response": ["In 2010, Bowers returned to making music and signed with independent record label Conehead UK to record a pop album, with the first single, \"All She Needs\", written by Jamie Scott, released in July 2010.Jordan&Alex want me to DJ at their wedding. Closer Magazine. Closeronline.co.uk (8 June 2010). Retrieved on 2012-04-11."]}, {"page": "Magic (TV channel)", "response": ["| Marvin Gaye, Terence Trent D'Arby, Lionel Richie, Simply Red, Chicago, Wet Wet Wet, The Pretenders, Fine Young Cannibals, Aztec Camera, A-ha, Laura Branigan, Howard Jones, Sister Sledge, Christopher Cross, Detroit Spinners, Patti Austin & James Ingram, Grover Washington, Jr., Womack & Womack, Teddy Pendergrass, Randy Crawford, Seal, Prince, Toni Braxton, Savage Garden, Simply Red, Alannah Myles, Marc Cohn, Paula Cole, Mr. Big, Donna Lewis, Julee Cruise, Eddi Reader, East 17 feat Gabrielle, All Saints, En Vogue, Brand New Heavies, Brandy & Monica, Everything But The Girl, KD Lang, Cher, James Blunt, Michael Buble, James Morrison, Will Young, Westlife, LeAnn Rimes & Brian McFadden, Kelly Rowland, Damien Rice, Josh Groban, David Gray, Ronan Keating, Jamie Scott & The Town, Peter Cincotti, Luther Vandross, Alicia Keys, All Saints, Gnarls Barkley, Vanessa Carlton, Darren Hayes, Anastacia"]}, {"page": "Cities 97 Sampler", "response": ["#Jamie Scott – \"Story of My Life\""]}, {"page": "Jamie", "response": ["* Jamie Scott (born 1984), English singer-songwriter and producer"]}, {"page": "Nate James", "response": ["James has also worked with several noted co-writers that included David Brant (Mis-Teeq, Liberty X, Jamie Scott), Eg White (Adele's Chasing Pavements) on Universal, David Sneddon (Hurts, Lana Del Rey) and Jake Gosling (Ed Sheeran, Wiley (rapper)) on The Message, Andreas S. Jensen (Writer of Armand Van Heldens: MyMyMy), Peter-John Vettese (Annie Lennox: Walking On Broken Glass), Jamie Hartman (Will Young's All Time Love) on Justify Me and Emily Friendship (Sarah Connor's: You're the Kinda Man)."]}, {"page": "Singfest", "response": ["*Jamie Scott"]}, {"page": "Step Up (film)", "response": ["* Jamie Scott as Colin, Lucy's college aged boyfriend"]}, {"page": "Thomas Troelsen", "response": ["*2020 \"Inside Out\" by Steve Aoki with Felix Jaehn feat. Jamie Scott from Neon Future IV"]}, {"page": "AT&T Stadium", "response": ["| Jamie Scott"]}, {"page": "Step Up (Original Soundtrack)", "response": ["Step Up (Original Soundtrack) is the film soundtrack for the film Step Up. It was released on August 8, 2006, on Jive Records and features new music from Mario, Drew Sidora, Ciara, Chamillionaire, Kelis, Chris Brown, Jamie Scott, Yung Joc and 3LW. The lead singles from the soundtrack are Sean Paul's \"(When You Gonna) Give It Up to Me\" featuring Keyshia Cole and Ciara's \"Get Up\" featuring Chamillionaire. Other tracks include Kelis' \"80's Joint\", Anthony Hamilton's \"Dear Life\", Youngbloodz's \"I'mma Shine\", and Petey Pablo's \"Show Me the Money\"and Dolla's\"Feelin 'Myself\". The title track is performed by newcomer Samantha Jade and produced by Wyclef Jean. The soundtrack was certified gold by the Recording Industry Association of America on May 3, 2007.", "| 16. || Made || Jamie Scott"]}, {"page": "List of One Tree Hill characters", "response": ["| style=\"text-align:center;\"| Jamie Scott", "===Jamie Scott==="]}, {"page": "List of Virgin Records artists", "response": ["* Jamie Scott"]}, {"page": "Free (Estelle song)", "response": ["The music video for \"Free\" was directed by Andy Hylton. As well as featuring an appearance from guest rapper Megaman, the video features cameos from fellow British singers Beverley Knight, Natasha Bedingfield, Terri Walker, Kelli Young of Liberty X, Jamie Scott, Indo-Canadian singer Raghav and US singer John Legend."]}, {"page": "Jamie Scott And The Town", "response": ["#REDIRECT Jamie Scott"]}, {"page": "Jamie Scott Baylin", "response": ["#REDIRECT Jamie Scott"]}, {"page": "27 Dresses", "response": ["*\"Lady West\" – Jamie Scott and The Town"]}, {"page": "Jamie Scott and the Town", "response": ["#REDIRECT Jamie Scott"]}, {"page": "Flicker (album)", "response": ["*Jamie Scott – background vocals ", "*Jamie Scott – recording , additional programming "]}, {"page": "Summer Breeze (rock festival)", "response": ["* Jamie Scott & The Town"]}, {"page": "Linda Perry production discography", "response": ["===Jamie Scott & The Town - Park Bench Theories===", "Written by Jamie Scott & Linda Perry"]}, {"page": "Ryan Tedder discography", "response": ["|Jamie Scott "]}, {"page": "David Guetta discography", "response": ["! scope=\"row\"| \"So Far Away\"(with Martin Garrix featuring Jamie Scottand Romy Dya)"]}, {"page": "Mozella", "response": ["|Jamie Scott, Niall Horan, Zayn Malik, Harry Styles, Louis Tomlinson, Liam Payne", "|Matt Rad, Jamie Scott"]}, {"page": "Heartbeat (Enrique Iglesias song)", "response": ["\"Heartbeat\" is a song by Spanish singer and songwriter Enrique Iglesias. The song was written by Iglesias, along with his long-term collaborators Jamie Scott and Mark Taylor, for his ninth studio album Euphoria (2010). The mid-tempo ballad, produced by Taylor, features guest vocals from American singer Nicole Scherzinger. The song has a melody based on futuristic piano sounds and incorporates elements of dance music. The Rudi Wells' Open Heart Remix of the song later appeared on Scherzinger's debut studio album Killer Love (2011).", "\"Heartbeat\" is a mid-tempo electropop dance ballad featuring a melody lead by futuristic piano notes. It was written by Iglesias, Jamie Scott and Mark Taylor, who also produced the song. Stephen Thomas Erlewine of AllMusic pointed out that the song had an \"icy texture\" while Becky Bain of Idolator noted that the duo's vocals carry much emotion. \"Heartbeat\" was also featured on Nicole Scherzinger's debut album, Killer Love (2011). The version featured on the album is the \"Rudi Well's Open Heart Remix\". Ellwood noted that the remix \"added beats changing the tone of the song completely.\" and changed the song from dance, to more electronic rock and electro-industrial tendencies.", "*Songwriting – Enrique Iglesias, Jamie Scott, Mark Taylor", "*Piano – Jamie Scott", "Category:Songs written by Jamie Scott"]}, {"page": "Graffiti6", "response": ["Graffiti6 is a collaboration founded in London in 2009. Made up of Jamie Scott (songwriter and lead vocals) and Tommy \"D\" Danvers (producer and songwriter). Graffiti6 are known for their \"blend of characterful voice and crisp, intricate groove created from an infectious alliance of electric piano and offbeat guitar\".", "Singer/songwriter Jamie Scott and producer/songwriter TommyD started collaborating in 2008. Both London-based multi-instrumentalists, they began making music together in 2009 under the name Graffiti6. Initially, Scott was considering working with a producer to repackage a solo album, when an A&R executive at Polydor suggested he meet Danvers. Scott introduced Danvers to \"an idea...for a folk thing\", which would later become the track \"Stare Into the Sun\", their first collaboration. The track, first done on acoustic guitar, was developed further by Danvers. It was submitted to The Sun newspaper and was chosen as the soundtrack for a TV ad campaign for the newspaper.", "* Jamie Scott - vocals, guitar, keyboards", "(All songs by Jamie Scott & Tommy D)"]}, {"page": "Drag Me Down", "response": ["\"Drag Me Down\" is a midtempo pop rock track written by Jamie Scott, Julian Bunetta and John Ryan, who wrote and produced several songs on One Direction's previous two albums Midnight Memories (2013) and Four (2014). According to Los Angeles Timess editor Mikael Wood, the production contains springy guitars that recall The Police or \"Rude\" by Magic!. The song is written in C minor with a tempo of 138 beats per minute.One Direction \"Drag Me Down\" Sheet Music musicnotes.com", "Category:Songs written by Jamie Scott"]}, {"page": "Killer Love", "response": ["* Jamie Scott & The Town – pianist"]}, {"page": "Christina Perri discography", "response": ["| Jamie Scott"]}, {"page": "Home Again (song)", "response": ["Category:Songs written by Jamie Scott"]}]}}