{"wiki_id": "http://www.wikidata.org/entity/Q4910699", "itemLabel": "Bill Rollo", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Rollo", "wikipedia_page": {"main": "Lieutenant General Sir William Raoul Rollo  (born August 1955) is a former senior British Army officer.\n\n", "link_mentions": [{"page": "Rollo (disambiguation)", "response": ["* Bill Rollo (born 1955), British Army officer"]}, {"page": "Commonwealth War Graves Commission", "response": ["The affairs of the CWGC are overseen by a Board of Commissioners.  The President of the board is HRH Prince Edward, Duke of Kent, the Chairman is the United Kingdom's Secretary of State for Defence Ben Wallace MP and the Vice Chairman is Lieutenant General Sir Bill Rollo. Claire Horton was appointed Director-General of the CWGC in 2020"]}, {"page": "Operation Telic order of battle", "response": ["*GOC Multi-National Division (South-East): Major General Bill Rollo (July 2004 to November 2004)", "*GOC Multi-National Division (South-East): Major General Bill Rollo (November 2004 to January 2005)", "*Senior British Military Representative and Deputy Commanding General, Multinational Force, Iraq: Lieutenant-General Bill Rollo (July 2007 to December 2007)", "*Senior British Military Representative and Deputy Commanding General, Multinational Force, Iraq: Lieutenant-General Bill Rollo (December 2007 to March 2008)"]}, {"page": "4th Infantry Brigade and Headquarters North East", "response": ["* 1998–2000 Brigadier Bill Rollo"]}, {"page": "Multi-National Division (South-East) (Iraq)", "response": ["* July–November 2004: Major-General Bill Rollo, British Army"]}, {"page": "Richard Dannatt", "response": ["Dannatt was appointed Colonel, The Green Howards on 1 December 1994, succeeding Field Marshal Sir Peter Inge. He was in turn relieved by Brigadier John Powell in May 2003. Dannatt succeeded Sir Christopher Wallace as Deputy Colonel Commandant of the Adjutant General's Corps on 1 April 1999, holding the title until 17 June 2005, when he was relieved by Major General Bill Rollo. He was appointed Colonel Commandant of the King's Division, in succession to Sir Scott Grant, on 1 July 2001. He relinquished the title on 10 December 2005 to fellow Green Howard, Lieutenant General (later General Sir) Nick Houghton."]}, {"page": "William Raoul Rollo", "response": ["#REDIRECT Bill Rollo"]}, {"page": "Assistant Chief of the General Staff (United Kingdom)", "response": ["* Major-General Bill Rollo (2005–2007)"]}, {"page": "Commander Force Development and Capability", "response": ["*2009-2010 Lieutenant-General Bill Rollo"]}, {"page": "King Edward VII's Hospital", "response": ["*Lieutenant General Sir Bill Rollo"]}, {"page": "MoneyForce", "response": ["Development of the MoneyForce programme was overseen by Lieutenant-General Sir Bill Rollo."]}, {"page": "William Rollo", "response": ["* Bill Rollo (born 1955), British Army officer"]}, {"page": "General Rollo", "response": ["*Bill Rollo (fl. 1970s–2010s), British Army lieutenant general"]}]}}