{"wiki_id": "http://www.wikidata.org/entity/Q4912856", "itemLabel": "Billy Kirkwood", "itemDescription": "Scottish footballer (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Kirkwood", "wikipedia_page": {"main": "William Kirkwood (born 1 September 1958) is a Scottish coach and former footballer. He began as a forward before moving to midfield. He began his career with Dundee United, where he made 399 appearances in two spells between 1975 and 1987. He won three major domestic trophies with the club, the Scottish League Cup in 1979 and 1980 and the Premier Division title in 1983. He also featured for United in many European runs including to the 1983–84 European Cup semi final and the 1987 UEFA Cup Final.\nHe also played for Hibernian, Dunfermline Athletic and Dundee. Since retiring as a player he has coach and managed at numerous clubs. He is currently a Rangers youth coach and a Senior manager at Rangers Academy.", "link_mentions": [{"page": "List of Scots", "response": ["* Billy Kirkwood (born 1958), football player"]}, {"page": "Rangers F.C.", "response": ["| Billy Kirkwood"]}, {"page": "Dundee United F.C.", "response": ["*  Billy Kirkwood"]}, {"page": "1995–96 Dundee United F.C. season", "response": ["Manager Billy Kirkwood continued to rebuild the team over the close season, bringing in Motherwell defender Rab Shannon, Rangers keeper Ally Maxwell and Neil Caldwell, also from Ibrox. Another two ex-Rangers players arrived before the start of the season, with Steven Pressley and Sandy Robertson both arriving from Coventry City. The Rangers connection continued when the Ibrox club made a bid of £1.5 million for Gordan Petric, which United accepted and this money helped to re-shape the team well into the new season. Also out the door went Juan Ferrari, walking out after not being promised a first team place, and the Brazilian Sergio left for Kuwait.", "Into October, and Robbie Winters scored twice as United beat Dunfermline 4–0 at East End Park in the semi-finals of the League Challenge Cup to go through to the final at McDiarmid Park. Billy Kirkwood then signed yet another former Rangers player, Gary McSwegan, from Notts County, and he made his debut in the 1–0 defeat to Dumbarton at Boghead Park. Goals seemed to be hard to come by in the league, so Kirkwood brought yet another striker to Tannadice. Owen Coyle arrived from Bolton Wanderers and scored on his debut in a 2–1 win over St Johnstone at Tannadice. McSwegan scored his first goal for the club in a 1–0 away win over Hamilton, and both strikers scored in a 3–1 win over Dunfermline at Tannadice. United then finished the month with their 4th straight win with a 3–0 home victory over Clydebank."]}]}}