{"wiki_id": "http://www.wikidata.org/entity/Q4911264", "itemLabel": "Bill Walker", "itemDescription": "Scottish Conservative politician (1929-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Walker_(Scottish_Conservative_politician)", "wikipedia_page": {"main": "William Connoll Walker OBE (20 February 1929 – 6 June 2017), known as Bill Walker, was a British Conservative Party politician who served as Deputy Chairman of the Scottish Conservative Party from 2000 until 2008. He was Member of Parliament (MP) for Perth and East Perthshire later Tayside North from 1979 to 1997. He never held any office in government and was one of the Maastricht Rebels against the embattled administration of John Major during the mid-1990s.", "link_mentions": [{"page": "1979 United Kingdom general election", "response": ["|Bill Walker"]}, {"page": "Neil Hamilton (politician)", "response": ["Hamilton resumed his activities as a supporter of pressure groups, including the Western Goals Institute, led by ex-Young Monday Club Chairman, Andrew V. R. Smith and attracting the support of other parliamentarians such as Sir Patrick Wall, Bill Walker, Nicholas Winterton and the Revd. Martin Smyth. He was on their parliamentary advisory board.Labour Research, November 1988, p. 2. The Western Goals Institute achieved notoriety by inviting Jean-Marie Le Pen (leader of the French National Front) and Alessandra Mussolini (Benito Mussolini's granddaughter, a Deputy sitting for the Italian neo-fascist MSI) to address fringe meetings at the 1992 Conservative Party conference. The Party Chairman Sir Norman Fowler was outraged, and said the Conservative Party was not related to the Western Goals Institute. In the event the meetings were cancelled, for neither Le Pen nor Mussolini could come to Britain."]}, {"page": "Donald Stewart (Scottish politician)", "response": ["In 1981 Stewart attempted to introduce some provisions for Gaelic through a private members bill, but it was met with hostility from the Conservatives and talked out by Bill Walker. It was only with the introduction of the Gaelic Language (Scotland) Act 2005 by the devolved Scottish Parliament, that the language was afforded some official recognition."]}, {"page": "Maastricht Rebels", "response": ["The Labour Party brought in MPs who had just had surgery and others who had suffered heart attacks - the stretcher vote - to vote in the House of Commons, in an effort to bring the government down. The loyalists and rebels in the Conservative Party also brought in their own stretcher vote; for example, Bill Cash organised for one MP (Bill Walker), who was seriously ill, to fly from Scotland secretly, then hid him at the rebels' headquarters in Great College Street, before, with Labour connivance, hiding him in the family room of the Commons so that the Conservative whips would not know; the government consequently lost a vote.", "*Bill Walker (North Tayside)"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Bill Walker"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Bill Walker"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Bill Walker"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Bill Walker"]}, {"page": "Perth and North Perthshire (UK Parliament constituency)", "response": ["The seat was one of eleven in Scotland to elect an SNP MP to Parliament at the 1974 October general election. With a rearrangement (redistribution) of seats in 1979 the successor seat of North Tayside went on to return Conservative candidate Bill Walker to Parliament until he was defeated by John Swinney of the SNP at the 1997 UK general election - from that point onwards the seat elected successive SNP members as its MP. Conservatives narrowly missed out on gaining the seat at the 2005 UK general election: Douglas Taylor coming behind Pete Wishart by 1,521 votes. Wishart increased his majority such as with 9,641 votes clearance in 2015. The Conservative missed out on gaining the seat by 21 votes at the 2017 general election, the third-closest result in the nation after North East Fife and Kensington, but ahead of Kensington if ranked by percentage of the votes locally cast."]}, {"page": "Bill Walker", "response": ["Bill Walker may refer to:", "* Bill Walker (Australian footballer, born 1883) (1883–1971), Australian rules footballer for Fitzroy", "* Bill Walker (Australian footballer, born 1942), Australian rules footballer for Swan Districts", "* Bill Walker (American football) (1933–2019), American football player", "* Bill Walker (baseball) (1903–1966), American baseball pitcher", "* Bill Walker (Toledo basketball) (born c. 1926), American basketball player", "* Henry Walker (basketball) (born 1987), American basketball player previously known as Bill Walker", "* Bill Walker (American politician) (born 1951), American lawyer and politician, former Governor of Alaska", "* Bill Walker (Canadian politician) (born 1966), Member of the Legislative Assembly of Ontario", "* Bill Walker (Scottish Conservative politician) (1929–2017), Scottish politician, Conservative Party MP, 1979–1997", "* Bill Walker (SNP politician) (born 1942), Scottish politician, MSP for Dunfermline, 2011–2013", "* Bill Walker (music director) (born 1937), Australian music composer and director", "* Bill Walker (actor) (1896–1992), American television and film actor, co-star of 1961 film The Mask", "* Bill Walker (artist) (1917–2011), Chicago muralist", "* Bill Walker (broadcaster) (1922–1995), Canadian broadcaster and actor"]}, {"page": "Perth and East Perthshire (UK Parliament constituency)", "response": ["| Bill Walker"]}, {"page": "Western Goals Institute", "response": ["From the mid-1980s, Western Goals had established a parliamentary advisory committee of Conservative MPs which included Sir Patrick Wall, Nicholas Winterton, Neil Hamilton and Bill Walker, as well as Martin Smyth of the Ulster Unionist Party for Belfast South."]}, {"page": "North Tayside (UK Parliament constituency)", "response": ["|1983 || Bill Walker || Conservative"]}, {"page": "Burrelton", "response": ["*Bill Walker, former MP of the Conservative Party lived close to the village"]}, {"page": "Ewan Dow", "response": ["In April 1995 Dow was elected to the newly formed Perth and Kinross Council and following the abolishment of Tayside Regional Council in 1996 served as depute leader and finance convener in the Perth and Kinross Council's SNP administration until losing his council seat in the 1999 Scottish local government elections.  During that time Dow led the fight against both the then Conservative and subsequent Labour Governments for funding for the proposed multimillion-pound Perth Flood Prevention Scheme much to the ire of local Tory Member of Parliament for North Tayside Bill Walker. \"£21m flood defences for Perth\" The Herald - 25 September 1997 UK Parliament Early Day Motion 570 - February 1997"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Bill Walker; MP for Perth and East Perthshire (1979–1983) and North Tayside (1983–1997)"]}, {"page": "Bill Walker (SNP politician)", "response": ["A case was brought against Walker and was heard at Edinburgh Sheriff Court on nine days over a two-week period and adjourned on 2 August 2013. On 22 August 2013, Walker was convicted of 23 charges of assault and one breach of the peace in relation to three ex-wives and a stepdaughter.http://www.scotland-judiciary.org.uk/8/1109/PF-v-BILL-WALKER Sheriff's verdict in PF v Bill Walker", "On 20 September 2013, he was sentenced to 12 months in prison by Edinburgh Sheriff Court. When sentencing him, Sheriff Kathrine Mackie said \"Having regard to the gravity of these offences as a result of the cumulative effect of them, your extreme denial and complete absence of any remorse, and the assessment of risk, I have come to the conclusion that a custodial sentence is the only appropriate disposal. In my opinion, the repeated abuse and violent behaviour towards your three former wives and stepdaughter over a period of 28 years outweighs other factors.\"http://www.scotland-judiciary.org.uk/8/1131/PF-v-BILL-WALKER Sheriff's sentencing statement in PF v Bill Walker Within a few weeks, lawyers acting on his behalf appeared at the High Court in Edinburgh to appeal against a custodial sentence and this was quickly dismissed.", "He married long-term partner, June, shortly after his election as an MSP in 2011. After he was sent to prison, Walker apparently approached a Scottish publishing firm to see if they were interested in his autobiography; he was turned down. In September 2017, his autobiography was published and made available online under the title Bill Walker: My Story.", "*Bill Walker's website"]}, {"page": "List of United Kingdom MPs who died in the 2010s", "response": ["|Bill Walker"]}, {"page": "2017 in the United Kingdom", "response": ["**Bill Walker, 88, politician, MP for Perth and East Perthshire (1979–1983) and North Tayside (1983–1997)."]}, {"page": "Deaths in June 2017", "response": ["*Bill Walker, 88, Scottish politician, MP for Perth and East Perthshire (1979–1983) and North Tayside (1983–1997).Obituary - Bill Walker, Scots Tory MP who lost his seat in 1997 wipeout"]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Bill Walker"]}, {"page": "List of MPs for constituencies in Scotland (1992–1997)", "response": ["|Bill Walker"]}, {"page": "List of MPs for constituencies in Scotland (1987–1992)", "response": ["|Bill Walker"]}, {"page": "List of MPs for constituencies in Scotland (1983–1987)", "response": ["|Bill Walker"]}, {"page": "1979 United Kingdom general election in Scotland", "response": ["|Bill Walker"]}, {"page": "List of MPs for constituencies in Scotland (1979–1983)", "response": ["|Bill Walker"]}]}}