{"wiki_id": "http://www.wikidata.org/entity/Q4912349", "itemLabel": "Willie Clarke", "itemDescription": "Scottish footballer (1878–1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Clarke_(footballer)", "wikipedia_page": {"main": "William Gibb Clarke (3 March 1878 – 1949) was a Scottish professional footballer who played as a winger. Clarke was the first Black professional footballer to score in the English Football League, while playing for Aston Villa in December 1901. He was also the second Black player to represent Scotland, after Andrew Watson, by playing for the Scottish FA's junior side in 1897.", "link_mentions": [{"page": "Walter Tull", "response": ["Walter Daniel John Tull (28 April 1888 – 25 March 1918) was an English professional footballer and British Army officer of Afro-Caribbean descent. He played as an inside forward and half back for Clapton, Tottenham Hotspur and Northampton Town and was the third person of mixed heritage to play in the top division of the Football League after Arthur Wharton and Willie Clarke. He was also the first black player to be signed for Rangers in 1917 while stationed in Scotland.", "In the history of mixed-heritage footballers in Britain, Tull may be mentioned alongside Robert Walker of Third Lanark, Andrew Watson, an amateur who is credited as the earliest black international football player winning his first cap for Scotland in 1881, Arthur Wharton, a goalkeeper for several clubs including Darlington and became the first mixed-heritage professional in 1889, John Walker of Hearts and Lincoln who died aged 22, the Anglo-Indian Cother brothers, Edwin and John, who began their careers at Watford in 1898 and Willie Clarke who played for Aston Villa and Bradford City in the Edwardian era."]}, {"page": "Andrew Watson (footballer, born 1856)", "response": ["* Willie Clarke (footballer), the first black player to score in the English Football League, he played for Scotland at a junior level."]}, {"page": "William Clark (disambiguation)", "response": ["* Willie Clarke (footballer) (1878–1940), born William Clark, Scottish football player for Aston Villa, Bradford and Bristol Rovers"]}, {"page": "William Clarke", "response": ["* Willie Clarke (footballer) (1878–1940), Scottish footballer", "*Willie Clarke (disambiguation)"]}, {"page": "List of Aston Villa F.C. records and statistics", "response": ["* First English football club to have a Black player on the scoresheet in the English Football League, when Willie Clarke scored on Christmas Day 1901, in a 3–2 victory over Everton."]}, {"page": "Willie Clarke (footballer, born 1878)", "response": ["#REDIRECT Willie Clarke (footballer)"]}, {"page": "Billy Clarke (footballer born 1878)", "response": ["#REDIRECT Willie Clarke (footballer)"]}, {"page": "Willie Clarke", "response": ["Willie Clarke may refer to:", "* Willie Clarke (politician) (born 1966), Irish republican politician from Northern Ireland", "* Willie Clarke (songwriter), American musician and songwriter", "* Willie Clarke (footballer) (1878–1949), Scottish footballer"]}, {"page": "Robert Walker (Third Lanark footballer)", "response": ["* Willie Clarke (footballer) - the first black player to score in the English Football League, a Scottish footballer who played for Third Lanark in the late 1890s."]}, {"page": "John Walker (footballer, born 1878)", "response": ["Walker was not the first black footballer, being preceded by the likes of Robert Walker (no relation), Andrew Watson and Arthur Wharton, but he was among the first to play in the Scottish Football League, and to appear for league clubs in both Scotland and England – alongside his contemporary Willie Clarke."]}, {"page": "Billy Clarke (footballer, born 1878)", "response": ["#REDIRECT Willie Clarke (footballer)"]}, {"page": "1969–70 Aston Villa F.C. season", "response": ["Tommy Docherty, then Manager saw two Zambians, Emment Kapengwe and Freddie Mwila in action and signed them on. They arrived in Birmingham in August 1969 and signed for Villa for two years. There, they met Brian Tiler who would later coach the Zambian national team. Kapengwe made three football league appearances and Mwila featured only once,Neil Brown's Aston Villa Player Registry becoming the second and third black players to play for Villa since Willie Clarke in 1901. Unfortunately, results were not very good and Villa were relegated to the third division. Docherty left the team and the duo decided to come back home after 9 months with Villa."]}, {"page": "1901–02 Aston Villa F.C. season", "response": ["On Wedneday 25 December 1901, Villa won 3–2 away to  Everton in front of a crowd of 18,000 at Goodison Park.AVFC History: 1901–02 season Villa scorer, Willie Clarke became the first non-white player to score in the English First Division.", "*  Willie Clarke, 16 appearances"]}, {"page": "1902–03 Aston Villa F.C. season", "response": ["*  Willie Clarke, 20 appearances"]}, {"page": "1903–04 Aston Villa F.C. season", "response": ["*  Willie Clarke, 2 appearances"]}, {"page": "1904–05 Aston Villa F.C. season", "response": ["*  Willie Clarke, 5 appearances"]}, {"page": "1905–06 Aston Villa F.C. season", "response": ["*  Willie Clarke, the first Black professional footballer to score in the English Football League."]}]}}