{"wiki_id": "http://www.wikidata.org/entity/Q4913041", "itemLabel": "Billy Mitchell", "itemDescription": "Northern Irish politician (1939-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Mitchell_(loyalist)", "wikipedia_page": {"main": "Billy Mitchell (1940 – 22 July 2006) was a community activist and member of the Progressive Unionist Party. Mitchell was a leading member of the loyalist Ulster Volunteer Force (UVF) and served a life sentence for his part in a double murder. He later abandoned his UVF membership and took up cross-community work.", "link_mentions": [{"page": "Ulster Volunteer Force", "response": ["The UVF's nickname is \"Blacknecks\", derived from their uniform of black polo neck jumper, black trousers, black leather jacket, black forage cap, along with the UVF badge and belt.Kate Fearon. The Conflict's Fifth Business: a brief biography of Billy Mitchell. 2 February 2002. p. 27 This uniform, based on those of the original UVF, was introduced in the early 1970s.Nelson, Sarah (1984). Ulster's Uncertain Defenders: Protestant Political, Paramilitary and Community Groups and the Northern Ireland Conflict. Belfast: Appletree Press. p. 208"]}, {"page": "Progressive Unionist Party", "response": ["Former UVF member Billy Giles, who spent 14 years in the Maze Prison for a sectarian killing, was part of the PUP's negotiating team at the Good Friday Agreement in April 1998.Taylor, Peter (1999). Loyalists. London: Bloomsbury. p.8 Others involved in this process included Billy Mitchell, David Ervine, Jim McDonald, William 'Billy' Greer, Winston Churchill Rea and William \"Plum\" Smyth; all former UVF and Red Hand Commando members."]}, {"page": "Dáithí Ó Conaill", "response": ["In 1974, at a secret meeting arranged by journalist Kevin Myers, Ó Conaill and Brian Keenan had talks with Ulster Volunteer Force (UVF) leaders Billy Mitchell and Jim Hanna in Lough Sheelin, County Cavan. Myers summarised the purpose of the talks: \"The IRA simply wished to discuss the terms of the loyalist surrender and the loyalists wished merely to assure the IRA they had no intention of surrendering.\"Kevin Myers, Caught between the devils and the IRA, The Sunday Times, 22 October 2006 The meeting lasted four hours. Mitchell later recalled that \"We just wanted to get to know one another. And we thought we could find a way to call an end to everything.\" \"I really liked David. And neither of us accused the other of anything\".Nordirland, Die Zeit"]}, {"page": "Combined Loyalist Military Command", "response": ["Subsequently, and merely weeks after the dissident republican murders, the groups which had made up the CLMC made separate announcements to the media that arms had been decommissioned.  Dawn Purvis, now leader of the PUP mentioned above, quoting the input of influential liberal loyalists such as Billy Mitchell and Billy McCaughey, announced on behalf of the UVF and the RHC that all weapons had been put beyond use.  Frankie Gallagher, speaking for the UDA/UFF via the UPRG, stated that their process was underway.  This was confirmed by General de Chastelain hours later."]}, {"page": "Billy Hutchinson", "response": ["Sent to prison in Long Kesh in 1975, Hutchinson, like many other young UVF inmates, came under the influence of Gusty Spence, a founder of the modern UVF who had begun a conversion to political methods. Hutchinson had already known Spence as the two had spoken on a few occasions during 1972 when Spence, aided by his nephew Frankie Curry, had escaped from prison for a few months.Garland, Gusty Spence, p. 143 Hutchinson had served as Spence's bodyguard briefly and had been in his company the day Spence was recaptured.Garland, Gusty Spence, p. 153 In the prison Hutchinson, along with the likes of David Ervine, Eddie Kinner, Billy Mitchell and William \"Plum\" Smith, was convinced by Spence that loyalism needed to develop a more political side to its agenda and Spence encouraged these younger members to become involved in this development.Garland, Gusty Spence, pp. 174–175 In 1977 when Spence advocated a policy of dialogue with republicans, Hutchinson and Mitchell co-authored a letter to UVF members on the outside endorsing Spence's call.Garland, Gusty Spence, p. 217 Whilst in prison Hutchinson took a degree in social sciences and a diploma in town planning with the Open University."]}, {"page": "Gusty Spence", "response": ["Spence was increasingly disillusioned with the UVF and he imparted these views to fellow inmates at Long Kesh. According to Billy Mitchell, Spence quizzed him and others sent to the Maze about why they were there, seeking an ideological answer to his question. When the prisoner was unable to provide one Spence would then seek to convince them of the wisdom of his more politicised path, something that he accomplished with Mitchell.McKay, Northern Protestants, p. 55 David Ervine and Billy Hutchinson were among the other UVF men imprisoned in the mid-1970s to become disciples of Spence.Taylor, Loyalists, pp. 141–142 In 1977 he publicly condemned the use of violence for political gain, on the grounds that it was counter-productive. In 1978 Spence left the UVF altogether. His brother Bobby, also a UVF member, died in October 1980 inside the Maze, a few months after the death of their brother Billy.Garland, Roy. Gusty Spence. p. 242"]}, {"page": "Billy Giles", "response": ["Despite his degree, he was unable to obtain a proper job that paid a decent salary. On the night of 24–25 September after composing a four-page letter of explanation and naming himself a \"victim of the Troubles\", Billy Giles hanged himself in his living room.Taylor, pp.9–11 He was 41 years old. Peter Taylor visited Giles' family in east Belfast on the eve of the funeral. He described Giles as lying in the coffin wearing his best suit, and his UVF badge with the inscribed words \"For God and Ulster\" was pinned to his lapel.Taylor, p.11 One of his last lines in his letter read, \"Please let the next generation live normal lives\".Taylor, p.11 This line was quoted during a speech given by Colm Cavanagh, vice-president of The Alliance Party of Northern Ireland on 3 March 2006 to The Department of Education. His friend and former UVF colleague Billy Mitchell, who was strongly critical of trauma counselling and a psychological approach to former paramilitaries, suggested that Giles' suicide had been prompted by a \"trauma workshop\" Giles had attended in South Africa. This was in contrast to Taylor, who believed that Giles took his own life because of the remorse he felt about his involvement in UVF violence."]}, {"page": "Bill Mitchell", "response": ["Bill or Billy Mitchell may refer to:", "* Billy Mitchell (saxophonist) (1926–2001), American jazz tenor saxophonist", "* Billy Mitchell (pianist) (born 1943), American jazz pianist", "* Billy Mitchell, performer on the Canadian television game show Acting Crazy (1991–1994)", "* Billy Mitchell, performer with the American rhythm and blues/doo-wop vocal group The Clovers", "* Billy Mitchell, performer with the English folk rock and progressive rock band Lindisfarne", "* Billy Mitchell, performer with the folk rock/electric folk group Jack the Lad", "* Billy Mitchell (EastEnders), fictional character from the BBC soap opera EastEnders", "* Billy Mitchell (rugby) (1890–1959), New Zealand rugby footballer", "* Billy Mitchell (billiards player) (1854–1931), player of English billiards", "* Billy Mitchell (footballer) (born 2001), English professional footballer", "* Billy Mitchell (1879–1936), United States Army general", "* Billy Mitchell (politician), member of the Georgia House of Representatives", "* Billy Mitchell (loyalist) (1940–2006), Northern Irish community activist", "* Billy Mitchell (gamer) (born 1965), American video game player", "* Billy Mitchell (volcano), a volcano in the central part of the island of Bougainville", "* Billy Mitchell Airport, a public use airport in Dare County, North Carolina"]}]}}