{"wiki_id": "http://www.wikidata.org/entity/Q4913458", "itemLabel": "Billy White", "itemDescription": "English footballer (1936-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_White", "wikipedia_page": {"main": "William White (13 October 1936 – 7 December 2000) was an English footballer.", "link_mentions": [{"page": "Billy White (disambiguation)", "response": ["Billy White (1936–2000) was an English football player.", "Billy White may also refer to:", "* Billy White, Belize, a village in Cayo District, Belize", "* Billy White (basketball), American basketball player"]}, {"page": "Billy White (footballer)", "response": ["#REDIRECT Billy White"]}, {"page": "1961–62 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | Billy White"]}, {"page": "1959–60 Burnley F.C. season", "response": ["The club's First Division campaign began with a 3–2 win over Leeds United at Elland Road on 22 August, with goals from Brian Pilkington, John Connelly and forward Ray Pointer.Simpson (2007), p. 294 Tommy Cummings played the game in an unfamiliar left-back role, where he would remain the following six matches before being reinstated at centre-back. Ahead of Burnley's first home match of the season against Everton at Turf Moor, Potts wrote in the club's matchday programme: \"We pride ourselves on being a footballing team and no club can be more eager to meet the demand for better play. That being so strongly ingrained in our intentions we confidently anticipate providing you with good displays\".Quelch (2015), p. 74 The team defeated Everton 5–2, with two goals from Connelly, and one each from Pilkington, Pointer and Robson. A 3–1 defeat at home against West Ham United followed, despite taking the lead through Connelly, before Everton were beaten 2–1 in the reverse fixture after being 1–0 down. Burnley's form remained inconsistent: a 4–1 away loss against Chelsea was followed by two 2–1 wins at home against Preston North End and West Bromwich Albion, after coming from behind on both occasions. McIlroy picked up an injury against West Brom, after he landed on his shoulder following a hard challenge from Maurice Setters.Quelch (2015), pp. 87–88 Potts had selected the same starting line-up for the first seven matches, but he made several changes to his side before the reverse fixture against local rivals Preston on 15 September: McIlroy was replaced by Billy White, while Bobby Seith had contacted giant urticaria and was replaced by Cummings, leaving the left-back position open for the 18-year old Elder to make his debut.Simpson (2007), p. 295 Burnley lost the fixture 1–0 but Elder played well against his opponent Tom Finney and remained in the starting line-up."]}]}}