{"wiki_id": "http://www.wikidata.org/entity/Q4912947", "itemLabel": "Billy Marsden", "itemDescription": "English footballer (1901-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Marsden", "wikipedia_page": {"main": "William Marsden (10 November 1901 –  19 September 1983) was an English international footballer, who played as a left half, and later managed Doncaster Rovers.", "link_mentions": [{"page": "William Marsden", "response": ["* Billy Marsden (1901–1983), English international footballer"]}, {"page": "History of Crystal Palace F.C.", "response": ["Back in 1919, the Palace minute book contained an entry instructing the Secretary to investigate the possibility of obtaining a lease on the 'ground at Selhurst', although calling it a 'ground' was a little misleading since at the time it was a piece of wasteland valuable only to the London, Brighton and South Coast Railway Company. At one time it had been a brickfield, and two chimney stacks still remained. On 3 January 1922, the club purchased the ground at a cost of £2,750, and renowned football stadium architect Archibald Leitch was commissioned to design Selhurst Park. Leitch had designed stands at Craven Cottage, Stamford Bridge, White Hart Lane and Leeds Road, but the design for Selhurst Park was unusual in that it had no roof gable. The other three sides of the ground remained open banking with just the lower parts being terraced. Construction work was delayed by industrial disputes, and when the ground was opened by the Lord Mayor of London on 30 August 1924, the stand had not been completed. It did however boast many luxuries, including \"offices, tea rooms, training quarters, plunge, slipper, shower and needle baths\". The opening fixture was against The Wednesday, and in front of a crowd of 25,000, Palace lost 0–1, with the first goal at Selhurst Park being scored by Billy Marsden. That defeat set the tone for the season, with the club eventually finishing in twenty-first place – and were relegated along with Coventry City. A win in the last game at home to Oldham Athletic would have secured survival, but Palace lost by a single goal and it would be almost 40 years before the club would again grace the second level of English football. The following year saw Selhurst Park stage the England versus Wales international on 1 March 1926. It remains the only full international match to be played at the ground.Matthews, pp.30, 33–35"]}, {"page": "Alfred Strange", "response": ["Strange was selected to represent the Football League three times, before receiving his first England cap for the match against Scotland on 5 April 1930. He played at right half as England won 5–2, with Vic Watson and Strange's Wednesday teammate Ellis Rimmer each scoring twice. Two other Sheffield Wednesday players, Ernie Blenkinsop and Billy Marsden, also played in this match."]}]}}