{"wiki_id": "http://www.wikidata.org/entity/Q4924137", "itemLabel": "Blair MacKichan", "itemDescription": "British actor and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Blair_MacKichan", "wikipedia_page": {"main": "Blair MacKichan is a British musician and songwriter.\nHe started his musical career playing drums, then later progressed to the piano. As a musician he fronts a band named Blair and Friends.MacKichan writes a lot of his own material. He won a Brit Award for the 2004 song \"Your Game\" after it became a hit for Will Young. He also wrote for Lily Allen.", "link_mentions": [{"page": "Oxo (food)", "response": ["Oxo launched another long-running advertising campaign in the UK in 1983, when a second \"Oxo Family\" debuted on commercial television.  The father was played by Michael Redfern, the mother was played by Lynda Bellingham, while the children were played by Blair MacKichan, Colin McCoy and Alison Reynolds. The advertisements typically featured the family sitting down to a meal at which Oxo gravy would be served.  The product was not always mentioned by name, occasionally appearing only as a logo in the corner of the screen at the end of the commercial.  Throughout the 1980s and 1990s, the family were seen to grow older, and, when the campaign was retired in 1999, the family moved out of the house."]}, {"page": "Blair", "response": ["*Blair MacKichan, English musician"]}, {"page": "Bro'Sis", "response": ["In March 2004, all three bands collaborated on a promotional remake of \"With a Little Help from My Friends\" for the 2004 Red Nose Day. The same month, Bro'Sis released \"U Build Me Up\", the first single from their third studio album Showtime. It became the group's eighth consecutive top twenty entry on the German Singles Chart but was less successful than previous lead singles. The band took a bigger role in writing and recording Showtime, which saw them working with several new producers and songwriters, including Fredrik \"Fredro\" Ödesjö, Blair MacKichan and Marek Pompetzki.Dunja M. Pechner, Michael Fuchs-Gamböck: Popstars backstage. Verlag Buhmann & Haeseler, , S. 209 Released in August 2004, it underperformed commercially when it failed to chart in Austria and Switzerland and peaked at number 24 on the German Albums Chart, resulting in lackluster sales in general and the release of no further physical singles."]}, {"page": "Healing Is Difficult", "response": ["* Blair MacKichan played violin on and produced track 4."]}, {"page": "Introduction (Alex Parks album)", "response": ["#\"Stones & Feathers\" - 3:07 (Justin Gray, Blair MacKichan, Stefan Skarbek, Parks)  "]}, {"page": "Friday's Child (album)", "response": ["*Blair MacKichan – guitar, backing vocals", "*Blair MacKichan – producer, programmer"]}, {"page": "Your Game", "response": ["\"Your Game\" is the second single from Will Young's second studio album, Friday's Child (2003), and also appears on the international version of Young's third album, Keep On (2005). The song was co-written by Young, Tayo Onile-Ere and Blair MacKichan. Released on 15 March 2004, \"Your Game\" reached number three on the UK Singles Chart. The song won the Brit Award for \"British Single\" in 2005.", "Category:Songs written by Blair MacKichan"]}, {"page": "Alright, Still", "response": ["* Blair MacKichan – production "]}, {"page": "Fink (singer)", "response": ["During the extensive European and American tours which accompanied Biscuits, Greenall began to write songs for the follow-up album. For this, he collaborated both with his bandmates and third parties, teaming up with Blair MacKichan for the writing of the \"This is the Thing\", and producer Andy Barlow of Lamb. The eventual album, Distance and Time, was released through Ninja Tune in October 2007, and was immediately recognised as a more robust, band-led affair than its predecessor, with musicOMH stating that \"the soft-spoken confessionals of their debut are more accomplished this time, taken to the big city and returned home just as wounded, but more worldly-unwise than their little brothers.\"  The tour following Distance's release took Fink to new territories such as Germany, South Africa and Canada, and also saw the band supporting Italian rock band Negramaro at their climactic San Siro stadium show in Milan."]}, {"page": "Shame for You", "response": ["\"Shame for You\" is a song by British recording artist Lily Allen from her debut studio album, Alright, Still. Written by Allen and Blair MacKichan, while sampling Jackie Mittoo's \"Loving You\" melody, the song was released as the A-Side to her fourth single, \"Alfie\", exclusively in the United Kingdom on 5 March 2007, by Regal Recordings.", "Category:Songs written by Blair MacKichan"]}, {"page": "Lady Croissant", "response": ["* Blair MacKichan – composer"]}, {"page": "Ma philosophie", "response": ["Written by Blair MacKichan and arranged by Diam's,https://www.whosampled.com/Amel-Bent/Ma-Philosophie/ the song has lyrics that reveal the positive sides of women."]}, {"page": "List of songs recorded by No Angels", "response": ["| Hiten Bharadia  Iain Farquharson  Blair MacKichan"]}, {"page": "The Jack Docherty Show", "response": ["Accompanying Docherty and guests was a house band, whose line-up changed from time to time. It was first briefly led by Pete Baikie, followed a few weeks later by Richard Allen. They named the studio band Pete Baikie and the Peetles and Richard Allen and the Allenoids respectively. In September 1997 a new house band, Blair, fronted by Blair MacKichan, took over the role and remained until the house band was dispensed with some time in 1998. MacKichan was better known for his appearance in the Oxo adverts during the 1980s, but was an accomplished musician."]}, {"page": "MacKichan", "response": ["*Blair MacKichan, English actor, musician and songwriter"]}, {"page": "Fall to Grace", "response": ["\"Agony\" was written by Faith, Paddy Byrne, and Blair MacKichan. Faith also worked with the latter two for her debut single, \"Stone Cold Sober\". Byrne and MacKichan are also credited for original production of \"Stone Cold Sober\". Byrne is also credited for additional production. \"Agony\" was not released as a single. \"Let Your Love Walk In\" was written by Faith and Ed Harcourt, who worked with Faith on her third single, \"Do You Want the Truth or Something Beautiful?\". \"Let Your Love Walk In\" was not released as a single. \"30 Minute Love Affair\" was written by Faith and Chris Braide, who returned to work with Faith on her later album (\"A Perfect Contradiction\"), towards the song \"Impossible Heart\". Both songs used synthesized instrumentation. \"Impossible Heart\" was not released as a single. Francis \"Eg\" White worked with Faith twice on this album, towards the tracks \"Black & Blue\" and \"Beauty of the End\". Only the former was released as a single."]}, {"page": "Worry About You (song)", "response": ["Category:Songs written by Blair MacKichan"]}, {"page": "List of songs recorded by Shinee", "response": ["| Junji Ishiwatari, Blair MacKichan, Luke Bingham "]}, {"page": "Bed of Stone", "response": ["Bed of Stone is the third studio album by Nigerian-French recording artist Aṣa. It was released on 25 August 2014 through Naive Records. Recorded in the East-Sussex area in the UK, the album was co-written and produced by Blair MacKichan, a British producer that has already worked with Sia and Lily Allen. Bed of Stone is, according to the label company an album that goes \"right to the heart\". It features a folk sound similar to her previous albums Beautiful Imperfection and Aṣa."]}, {"page": "List of songs recorded by Olly Murs", "response": ["| Olly Murs  Matt Prime  Blair MacKichan"]}, {"page": "List of songs recorded by Sia", "response": ["| Sia FurlerBlair MacKichanFelix HowardKevin Armstrong", "| Sia FurlerBlair MacKichan"]}, {"page": "Don't Bring Me Down (Sia song)", "response": ["The track was written by Sia and Blair MacKichan who had recently worked with Will Young's on his Brit Award winning song, \"Your Game\". The track received little promotion and did not chart.", "Category:Songs written by Blair MacKichan"]}, {"page": "U Build Me Up", "response": ["\"U Build Me Up\" is a song by the German pop group Bro'Sis. It was written by Blair MacKichan and produced by Fredrik \"Fredro\" Ödesjö for the band's third studio album Showtime (2004). The mid-tempo track was released as the album's only physical single and reached the top twenty of the German Singles Chart.", "Category:Songs written by Blair MacKichan"]}]}}