{"wiki_id": "http://www.wikidata.org/entity/Q4925409", "itemLabel": "Blaster Bates", "itemDescription": "English explosives and demolition expert", "wikipedia_url": "https://en.wikipedia.org/wiki/Blaster_Bates", "wikipedia_page": {"main": "Blaster Bates was the name used by Derek Macintosh Bates (5 February 1923 – 1 September 2006), an English explosives and demolition expert and raconteur, who was born in Crewe. He made a series of sound recordings from the 1960s to 1980s, recounting bizarre and funny experiences from his long career, and tales of his hobbies of motorcycling, hunting and shooting. He was much in demand as an after-dinner speaker. His tales often featured coarse language. Once, for instance, he was hired to clear out a farm's septic tank using explosives, an episode Bates described as \"The Shower of Shit Over Cheshire\". On another occasion he surprised a young couple in what he described as 'a compromising position' whilst clearing trees for the Oulton Park racing circuit, an incident which gave the Knickerbrook corner its name.Bates served with the Royal Air Force during the Second World War as a Handley Page Halifax bomber pilot, and then learned his explosives skills as a bomb disposal specialist. After the war he returned to his previous employer Rolls Royce, hoping to resume his old job, but was told \"We're cutting down, you know\". Bates then started his own demolition business, drawing on his wartime expertise. He later noted that it was a good decision, as \"over the years I've managed to do all right while Rolls Royce have gone steadily bust\".\nHe was known for carrying sticks of explosive in his pockets, even producing them while giving testimony in trials, to the horror of the court. Most high explosives are harmless unless used with a detonator, but this is not generally understood.\nBates had diabetes. In August 2006 he was admitted to hospital with congestive heart failure, and on 1 September 2006 he died, aged 83. He was buried at St Mary's church in Sandbach town centre.", "link_mentions": [{"page": "Crewe", "response": ["*Blaster Bates a.k.a. Derek Macintosh Bates (1923 in Crewe – 2006), an English explosives and demolition expert and raconteur"]}, {"page": "Blaster", "response": ["* Blaster Bates (1923–2006), an explosives expert and comedian"]}, {"page": "Oulton Park", "response": ["The corner is named after an event that occurred when the British demolition expert and raconteur, Blaster Bates, was removing tree stumps with dynamite close to the corner with a colleague. After the first detonation, a courting couple were seen to run off at speed and in some disarray from a nearby a bush or bank. On the closer investigation, the pair discovered some ladies underwear in the brook and this resulted in the naming of the corner.Laughter with a Bang album (Big Ben Records no. BB00-01 1967)"]}, {"page": "Bates", "response": ["*Blaster Bates (1923–2006), British demolition expert"]}]}}