{"wiki_id": "http://www.wikidata.org/entity/Q4932308", "itemLabel": "Bob Downs", "itemDescription": "English racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Downs", "wikipedia_page": {"main": "Robert Downs (born 24 July 1955) is a former English professional cyclist from Basildon, Essex.", "link_mentions": [{"page": "Basildon", "response": ["* Bob Downs – former professional cyclist"]}, {"page": "Stephen Roche", "response": ["He also finished on the podium at the early-season Paris–Ezy road race and finished 14th overall in the Sealink International stage race which was won by Bob Downs. However, a knee injury caused by a poorly fitted shoe plate led to a disappointing ride in Moscow, where he finished 45th. However, on return to France, August to October saw Roche win 19 races. That led to a contract with the Peugeot professional cycling team for 1981."]}, {"page": "List of British cyclists", "response": ["* Bob Downs"]}, {"page": "Manchester Wheelers' Club", "response": ["*Bob Downs"]}, {"page": "Cinnibar Flats", "response": ["*4: Neal Barrett, Jr., writer/Willis, pencils/Bob Downs, inks."]}, {"page": "Tour of Ireland", "response": ["|24|| 1984 || Bob Downs ||  ||  || ||"]}, {"page": "Paul Curran (cyclist)", "response": ["In 1988 Curran was selected for the Olympic Games road race finishing 36th, the race was won by Olaf Ludwig. After dominating the British amateur scene for several years in 1989 Curran finally turned professional. He joined Percy Bilton riding alongside Bob Downs and Steve Joughin. In his first season, he won the British National professional Criterium championships and was 6th in the Kellogg's Tour of Britain, finishing ahead of Sean Kelly. However, when in 1990 the British-based professional season collapsed, Curran was left without a team and he reverted to amateur status in 1991. He went down with double pneumonia and subsequently missed half of the season but bounced back in 1992 finishing 3rd in the British Road Race Championship."]}, {"page": "Premier Calendar", "response": ["| align=center|Bob Downs", "| align=left|Bob Downs", "| align=left|Bob Downs"]}, {"page": "John Herety", "response": ["He then joined the French team, Athletic Club Boulogne-Billancourt in Paris, Europe's most successful sports club with fellow British riders Sean Yates and Jeff Williams. Herety won his second race for the ACBB which was a circuit of Toulon finishing in a bunch sprint. Herety spent one season with the ACBB and was offered a professional contract with Mercier riding alongside Joop Zoetemelk. In 1982 he had hoped to get a ride in the Tour de France.'John Herety – Champion Talk', Brian Cookson, Cyclist Monthly, 1983, p25-29. However, a poor performance in the Tour de l' Aude resulted in him not being selected by the Coop-Mercier manager Jean–Pierre Danguillame. Herety subsequently returned to England and won the Professional British National Road Race Championships. He also had success in the Grand Prix Pino Cerami finishing second after being outsprinted from a small group of riders by Ronny Van Holen. However, after three seasons with Mercier he had reached a level that he was unable to improve on.'Sealink Review', Martin Ayres, Cyclist Monthly, 1984, p22-23, Herety explained: “My trouble is that I can’t recover quickly enough after a hard stage race or a race.\" \"When I’ m racing abroad that is no good, with so many races to ride one after the other.” In 1985 he consequently decided to join the British-based professional team Ever Ready allowing him to race on the weekends and if needed have the whole week to recover. In 1986 he then joined Percy Bilton riding alongside Bob Downs and Steve Joughin. The following season he won a stage in the Milk Race and was runner up in the British National Road Race Championships. John owed his successes to his powerful sprint. However, his inability to climb and recover during hard stage races limited his palmares. Herety was not a general classification rider – evidence his 52nd overall in the 1984 Sealink International."]}, {"page": "Steve Joughin", "response": ["In 1986 Joughin won two stages of the Milk Race leaving behind Djamolidine Abdoujaparov. After four seasons with Moducel he joined Percy Bilton riding alongside Bob Downs and John Herety. That same season he had arguably his greatest ever victory winning stage three in the 1987 Kellogg's Tour of Britain from Manchester to Birmingham, beating some of the biggest names in the sport of cycling such as Sean Kelly. Joughin got into a breakaway and then went clear with Stuart Coles as the race approached Perry Barr on the outskirts of Birmingham. The pair stayed clear of the field all the way to the finish line in Victoira Square in Birmingham city centre, with Joughin winning the sprint comfortably (https://www.youtube.com/watch?v=1bPb3mlkqMM)"]}, {"page": "Robert Downs", "response": ["* Bob Downs (born 1955), British cyclist"]}, {"page": "Robert Downs (cyclist)", "response": ["#REDIRECTBob Downs"]}, {"page": "List of Commonwealth Games medallists in cycling", "response": ["|1982||Joseph WaughMalcolm ElliottBob DownsSteve Lawrence||02:09:27||John WattersRemo SansonettiRicky FloodMichael Lynch||02:09:36||Blair StockwellJack SwartStephen CartonStephen Cox||02:10:56"]}, {"page": "England at the 1978 Commonwealth Games", "response": ["|Bob Downs ||road race||"]}, {"page": "England at the 1982 Commonwealth Games", "response": ["|Bob Downs ||team time trial||1 x gold"]}, {"page": "Steve Lawrence (cyclist)", "response": ["He represented England in the road race, at the 1978 Commonwealth Games in Edmonton, Alberta, Canada. Four years later he represented England in the road race and team time trial, at the 1982 Commonwealth Games in Brisbane, Queensland, Australia. He finished just outside the medals in fourth place in the road race but won a gold medal in the team time trial with Joseph Waugh, Malcolm Elliott and Bob Downs."]}]}}