{"wiki_id": "http://www.wikidata.org/entity/Q4933939", "itemLabel": "Bob Shankly", "itemDescription": "Scottish footballer and manager (1910-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Shankly", "wikipedia_page": {"main": "Robert Fleming Blyth Shankly (25 February 1910 – May 1982) was a professional football player and manager from the village of Glenbuck in Ayrshire, Scotland.", "link_mentions": [{"page": "Ayrshire", "response": ["* Bob Shankly (1910-1982) Football Manager, born in Glenbuck"]}, {"page": "Auchinleck Talbot F.C.", "response": ["Winger Robertson was signed by Willie Thornton for Dundee from Talbot in 1957 at the age of 17 while working as a miner at Barony Colliery. He was a member of the Dark Blues League title winning side in 1961–62 managed by Bob Shankly and their subsequent European campaigns including an 8–1 rout of FC Cologne at Dens Park. Robertson was capped once for Scotland in a November 1961 World Cup qualification play-off against Czechoslovakia, setting up both Scotland goals for Ian St John in a 4–2 defeat. Shankly himself played for Talbot for a season in 1929 before joining his own local club, the famous Glenbuck Cherrypickers."]}, {"page": "Dundee F.C.", "response": ["The club's most successful era was in the 1960s when, under the management of Bob Shankly, Dundee won the Scottish Football League title in 1962, before reaching the semi-finals of the 1962–63 European Cup. The club would once again win the League Cup in the 1973–74 season, but have yet to win another major honour since. Since the late 1970s, the club has experienced issues with frequent relegations and financial issues, though have found stability in the latter as of late.", "Bob Shankly (brother of Bill Shankly) was appointed manager in 1959. Dundee became champions of Scotland when they won the Division One league title in the 1961–62 season. With players such as Bobby Cox, Bobby Wishart, Pat Liney, Alan Cousin, Andy Penman, Hugh Robertson, Alan Gilzean, Alex Hamilton, Bobby Seith, Gordon Smith and Ian Ure they clinched the title with a win against St Johnstone, which in turn relegated St Johnstone to the then Second Division. Gordon Smith earned the distinction of being the only player to win the Scottish football championship with three clubs (Hibs, Hearts and Dundee), none of them either half of the traditionally dominant Old Firm.", "* Bob Shankly (2010)", "| Bob Shankly || 1959–1965"]}, {"page": "Falkirk F.C.", "response": ["|Bob Shankly - Managerial Period & Record, bettermeddle.org.uk. Retrieved 28 June 2012."]}, {"page": "Jock Stein", "response": ["It was announced on 31 January that Stein would leave Hibs for Celtic at the end of the 1964–65 season. Stein left Hibs in early March, after he had arranged for Dundee manager Bob Shankly to take the Hibs job. When Stein left, Hibs were near the top of the league and in the semi-finals of the 1964–65 Scottish Cup. Hibs had defeated Rangers in the quarter-final, in his last game as Hibs manager. They failed to win either competition, however, and Stein later admitted that \"leaving Hibs at that time was probably my most embarrassing experience in football\". Stein was statistically the best ever manager of Hibs, with a win rate of 62%."]}, {"page": "Third Lanark A.C.", "response": ["|Bob Shankly"]}, {"page": "Dens Park", "response": ["Following Dundee's successful league campaign during the 1998–99 season, Dens park had to be redeveloped to adhere to the new Scottish Premier League seat-capacity guidelines. Dundee were therefore required to redevelop the East and West terraces. Barr Stadium Construction were charged with the task of removing the existing concrete terraces and the construction of two 3,000-seat stands. The stands were built in a record time of 82 days for the start of the 1999–00 season. The two near-identical single-tier Bobby Cox and Bob Shankly Stands sit at either end of the ground. The former usually houses home supporters while the latter houses the away supporters. A new Club Shop and ticket office were also built. Dens Park was the first stadium in Dundee to have its floodlights upgraded in the twenty-first century. Undersoil heating was installed in 2005.", "thumb|left|View of the 'Bob Shankly Stand'"]}, {"page": "Stirling Albion F.C.", "response": ["Under the vastly experienced Bob Shankly, Stirling made progress, achieving consecutive 3rd place finishes in 1971–72 and 1972–73, narrowly missing out on promotion to the top tier."]}, {"page": "Craig Brown (footballer, born 1940)", "response": ["Brown was the first signing of Dundee manager Bob Shankly. Although knee surgery meant he barely played for the first team during his loan, the move was made permanent in the summer of 1961. Brown always traveled with the Dundee first team squad but this was before substitutes were commonly used. Thus he didn't make a competitive appearance until November 1961, then waited until February 1962 for his league debut when captain Bobby Cox was injured. Brown played in nine consecutive league games before becoming injured himself on 31 March in a 3–2 win against bottom placed Stirling Albion.Played for Dundee and Rangers – Craig Brown, Dundee FC, 25 February 2019 Dundee won the Scottish league title that season and Brown's nine appearances entitled him to a medal. Brown stayed at Dundee for four and a half injury-affected years, making 16 total appearances for the Dark Blues but playing no active part in the club's European Cup run, or the 1964 Scottish Cup Final which they lost to Rangers. During that time he also completed a course in physical education and primary teaching at Jordanhill College, and was also a member of the pop music group Hammy and the Hamsters formed by six Dundee players.Hammy & The Hamsters - 1964, The Dundee Futba Shrine, 13 November 2008"]}, {"page": "Peter Cormack", "response": ["His best season at Hibs was 1964-65 during the 12 months they were managed by Jock Stein (Stein had a 62% win rate at Hibs). Hibs challenged for league and cup until Stein left before the end of the season to manage Celtic in March 1965. Cormack scored twice when Hibs won 4–2 against Rangers at Ibrox Park on 10 October 1964 in one of three victories against Rangers. The 4–2 win at Ibrox was three days after Cormack and Hibs had beaten Real Madrid 2–0 in a challenge match at Easter Road. Cormack scored the opener against Real volleying home a cross by Neil Martin. Stein was replaced by Bob Shankly with whom Hibs finished fourth in the league and lost in the Scottish Cup semi final to Dunfermline Athletic. Cormack played regularly with Hibs in Europe but was unable to progress past the quarter final stage. The most significant of Cormack's wins in Europe with Hibs was the November 1967 6-4 aggregate success against S.S.C. Napoli featuring Dino Zoff. Napoli won the first leg 4–1 in Italy. Cormack scored the third as Hibs won the second leg 5–0. Napoli were league leaders in Serie A at the time. Hibs had knocked out F.C. Porto in the previous round when Cormack scored a double in the 3–0 home leg win. They were eliminated 2–1 on aggregate in the quarter final by Don Revie's Leeds United."]}]}}