{"wiki_id": "http://www.wikidata.org/entity/Q4933800", "itemLabel": "Bob Roberts", "itemDescription": "Welsh footballer (1863-1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Roberts_(footballer,_born_1863)", "wikipedia_page": {"main": "Robert \"Bob\" Roberts (1863 – 24 March 1950) was a Welsh footballer who played at full back for Wrexham in the 1880s and 1890s. He made two appearances for Wales, one as an emergency goalkeeper.", "link_mentions": [{"page": "Robert Roberts", "response": ["Robert, Rob, or Bob Roberts may refer to:", "*Bob Roberts (Australian politician) (born 1952), Member of the New South Wales Legislative Assembly", "*Bob Roberts (footballer, born 1859) (1859–1929), West Bromwich Albion F.C. and England international football goalkeeper", "*Bob Roberts (footballer, born 1863) (1863–1950), Wrexham A.F.C. and Wales international footballer", "*Bob Roberts (Australian footballer) (born 1930), former Australian rules footballer", "*Bob Roberts (singer) (1871–1930), American vaudeville singer and recording artist", "*Bob Roberts (folksinger) (1907–1982), British musician, sailor, journalist and author", "*Bob Roberts (cinematographer), American cinematographer of Argentine cinema", "*Bob Roberts, a 1992 film written and directed by and starring Tim Robbins"]}, {"page": "Bob Roberts (footballer, born 1859)", "response": ["Robert John Roberts (9 April 1859 – 20 October 1929), better known as Bob Roberts, was an English football goalkeeper. He spent the majority of his career at West Bromwich Albion, with whom he won an FA Cup winner's medal, and also played for Sunderland Albion and Aston Villa. He won three caps for England and is the first West Bromwich Albion player to have appeared at international level. He was nicknamed Long Bob and The Prince of Goalkeepers.", "Roberts played in Albion's first ever Football League match on 8 September 1888, keeping a clean sheet in the 2–0 victory over Stoke (the match was played at Victoria Ground, Stoke (registration & fee required)). His appearance made him one of only two players (alongside Ezra Horton) to have played in both Albion's first FA Cup game and their first league game. He was ever-present in that first league season of 1888–89, making 22 appearances and keeping four clean sheets (and kept the opposition to one-in-a-match on four separate occasions. When Bob Roberts played as goalkeeper on 13 October 1888 against Preston North End he was 29 years 187 days old; that made him, on that sixth weekend of League football, West Bromwich Albion' oldest player.). In October 1889 he was suspended by the FA for four matches, after he took part in an unsanctioned match at Walsall. Roberts made 84 appearances in the league and the FA Cup during his Albion career; taking into account friendlies and local cup competitions, he appeared around 400 times for the club."]}, {"page": "Bob (given name)", "response": ["* Bob Roberts (Australian politician) (born 1952), former Member of the New South Wales Legislative Assembly", "* Bob Robertson (1885–1961), American lawyer and politician", "* Bob Roberts (folksinger) (1907–1982), British folk singer and songwriter", "* Bob Roberts (singer) (1879–1930), American novelty singer", "* Bob Roberts (cinematographer) (died after 1955), American cinematographer", "* Bob Robertson (born 1946), American first baseman", "* Bob Roberts (Australian footballer) (born 1930), Australian rules footballer", "* Bob Roberts (footballer, born 1859) (1859–1929), English goalkeeper", "* Bob Roberts (footballer, born 1863) (1863–1950), Welsh full back", "* Robert Roberts (footballer, born 1864) (1864–1932), known as Bob Roberts, Welsh midfielder", "* Bob Robertson (ice hockey) (born 1927),  Canadian hockey player"]}, {"page": "Bob Roberts (footballer born 1863)", "response": ["#REDIRECT Bob Roberts (footballer, born 1863)"]}, {"page": "History of the Wales national football team (1876–1976)", "response": ["With all the Home Nations competing regularly, the decision was taken to introduce a competitive tournament between the sides, and the British International Championship (later to become better known as the British Home Championship) was created in 1884. The inaugural tournament was won by Scotland who won all three of their ties. Having defeated Ireland 6–0 in their opening match, Wales went on to finish third after suffering successive defeats to England and Scotland. The early stages of the competition continued on the same lines; England and Scotland competed for the title, while Wales would finish third by defeating Ireland. In the first three years of competition, Wales' only points other than in matches against Ireland was a 1–1 draw with England in the 1884–85 tournament. In the 1886–87 edition, Wales finished bottom of the competition for the first time after losing all three of their matches, including a 4–1 defeat to Ireland in the nation's first victory in international football. Wales had struggled to raise a team for the match and included Wrexham defender Bob Roberts playing as the goalkeeper. FAW secretary Alexander Hunter also stepped in when Humphrey Jones withdrew late. Hunter had never played football at such a level and his performance was described as \"glaringly deficient\"."]}]}}