{"wiki_id": "http://www.wikidata.org/entity/Q4935517", "itemLabel": "Bobby Roberts", "itemDescription": "Footballer (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bobby_Roberts_(footballer)", "wikipedia_page": {"main": "Robert Roberts (born 2 September 1940) is a Scottish former football player and manager who played as a midfielder.", "link_mentions": [{"page": "Motherwell F.C.", "response": ["*1961–62 –  Bobby Roberts"]}, {"page": "Wrexham A.F.C.", "response": ["The summer of 1982 saw Bobby Roberts appointed the club's new manager. Relegation meant the club had dire financial problems, resulting in the sale of many of the club's experienced and talented players. Frank Carrdus, Ian Edwards, Mick Vinter and Wayne Cegieski had already left during the summer, Steve Fox, Joey Jones, Dixie McNeil and Billy Ronson soon followed. Wrexham were again relegated to the Fourth Division after plummeting from apparent mid-table security. The club's slide continued into the following season, and only goal difference prevented Wrexham from being forced to apply for re-election to the League.", "The 1984–85 season saw Wrexham take on FC Porto in European competition. Wrexham won the home leg with a 1–0 victory, but in the second leg Porto showed their class and were 3–0 up after 38 minutes, however Wrexham pulled goals back and the game finished 4–4 with Wrexham advancing on away goals. The second round draw was to pair Wrexham with Italian AS Roma, managed by Sven-Göran Eriksson. Wrexham lost 3–0 on aggregate over the two legs. Their league performance was even more dire than the previous year, and by the time Bobby Roberts was finally removed from his post, Wrexham were rock-bottom of the entire Football League.", "* 1982–85 Bobby Roberts"]}, {"page": "Grimsby Town F.C.", "response": ["1987–88 saw Grimsby Town suffer a second consecutive relegation, placing them in the Fourth Division. The club's financial situation was also dismal, and as the 1988–89 season began, the task at Grimsby was to avoid relegation to the Football Conference, avoid expulsion from the FA and avoid going out of business completely. This was achieved, finishing 9th. Following the resignation of Dave Booth in 1986 (to pursue outside business interests) the club had two managers in two years (Mick Lyons and Bobby Roberts). Alan Buckley was appointed after the 1988 relegation and by 1991 had led the club to two successive promotions with the chairman at that time being Peter Furneaux. Grimsby were to remain in football's second flight for six years. Buckley's crop of players consisting of some of the most popular and biggest cult heroes in the club's history; players such as Shaun Cunnington, Keith Alexander, Mark Lever, Dave Gilbert, Steve Livingstone, Paul Futcher, Paul Groves and Clive Mendonca made the club a solid second-tier side (the Second Division became Division One in 1992 upon the creation of the Premier League from the old First Division). In 1992–93, Grimsby finished 9th in the new Division One, and until well into April they were in the hunt for a play-off place that would have given them the chance of a third promotion in four years. They dipped to 16th place a year later, though they were never in any real danger of relegation.", "|  Bobby Roberts"]}]}}