{"wiki_id": "http://www.wikidata.org/entity/Q4933014", "itemLabel": "Bob Kerr", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Kerr_(musician)", "wikipedia_page": {"main": "Robert Kerr (born 14 February 1940, Kensington, west London, England) is a comic musician who plays trumpet and cornet.  He was originally a member of the Bonzo Dog Doo-Dah Band and was persuaded by Geoff Stephens to join The New Vaudeville Band, before forming his own combo, Bob Kerr's Whoopee Band.  Kerr was a part of a reunited Bonzo Dog Doo-Dah Band line-up of surviving members, which toured in 2006 and 2008.\nHe and his son, Matt, also operate a t-shirt printing business. Kerr's musical career is described in David Christie's Doo Dah Diaries.", "link_mentions": [{"page": "Bob Kerr's Whoopee Band", "response": ["thumb|Bob Kerr's Whoopee Band in Germany (probl. 1975)", "Bob Kerr's Whoopee Band, also billed as Bob Kerr and His Whoopee Band, is a jazz band which started in 1967 and continues to perform today. It was an offshoot of the eclectic Bonzo Dog Doo-Dah Band, and shared many similarities with other outfits of the time such as The New Vaudeville Band and The Temperance Seven. Founder Bob Kerr had been a member of both the Bonzos and the New Vaudeville Band.", "By 1971, for the album Making Whoopee, the band's membership consisted of Bob Kerr, Vernon Dudley Bowhay Nowell, Sam Spoons, James Chambers, John \"Evil Gieves\" Watson, Biff Harrison, Franklin Tomes and David Glasson.", "In 1976, for the album The Whoopee Band, the membership consisted of Evil John Gieves Watson (banjo), Vernon Dudley Bowhay Nowell (tenor banjo), Biff Harrison, David Glasson (piano), Jim \"Golden Boots\" Chambers, and Bob Kerr.", "For an August 1977 gig, the membership consisted of Bob Kerr (trumpet, trombone), Vernon Dudley Bowhay-Nowell (banjo), \"Gentleman Frankie\" Tooms (sousaphone), Sam Spoons (drums), \"Evil John\" Gieves Watson (banjo), Biff Harrison (clarinet, saxophone), Jim \"Golden Boots\" Chambers (saxophone), and David \"Mr. Piano\" Glasson (piano).", "In 1978, for the Hard Pressed album, the membership consisted of Bob Kerr (cornet), Jim \"Golden Boots\" Chambers (alto sax), Vernon Dudley Bowhay Nowell (tenor banjo), \"Evil\" John Gieves Watson, Biff Harrison, David Glasson (piano), Sam Spoons (drums) and Frank Tooms.", "In 1981, for the Things That Go Bump in the Mike album, the membership consisted of Bob Kerr, Jim Chambers, Vernon Dudley Bowhay Nowell, Biff Harrison, Sam Spoons, Hugh Crozier (piano) and Frank Tooms.", "By the time of a 1987 performance in Germany, the Whoopee Band consisted of Bob Kerr - tuba, Vernon Dudley Bowhay-Nowell - banjo, Richard White - clarinet, Hugh Crozier - piano, Frank Tomes - sousaphone and Colin Bowden - drums", "Members of Bob Kerr's Whoopee Band are Bob Kerr, John \"The Professor\" Percival, Malcolm Sked, Bert Lamb and Henri Harrison."]}, {"page": "Robert Kerr", "response": ["* Bob Kerr (cricket official) (1939–2007), former head of the Irish Cricket Union", "* Bob Kerr (Australian footballer) (1875–1943), Australian rules footballer", "* Bob Kerr (musician) (born 1940), English comic musician; member of the Bonzo Dog Doo-Dah Band, The New Vaudeville Band and Bob Kerr's Whoopie Band", "* Bob Kerr (author and artist) (born 1951), New Zealand author, illustrator and artist", "* Bob Kerr (radio presenter) (died 2003), CBC radio classical music presenter, see List of Canadian Broadcasting Corporation personalities"]}, {"page": "The New Vaudeville Band", "response": ["When Stephens received several requests for the New Vaudeville Band to tour and to record a full-length album, he had to put together a group, for the song had been recorded by session musicians hired only for the recording. He contacted the Bonzo Dog Doo-Dah Band, which played similar music at the time. Only Bob Kerr from that group was interested, so he left the Bonzos in order to help Stephens form a touring version of The New Vaudeville Band, which included original session drummer Henri Harrison. Meanwhile, John Carter had no interest in continuing with the group as a singer, though he still co-wrote the occasional song with Stephens for use by the group.  The new lead singer of the group was Alan Klein, who was billed as 'Tristam, Seventh Earl of Cricklewood'. Klein also wrote some of the group's material. Mick Wilsher, on guitars, also sang occasional lead vocals. The official line-up as of late 1966 was:", "The New Vaudeville Band was managed by Peter Grant. Kerr left the group following disputes with Grant; he then formed his own group, Bob Kerr's Whoopee Band."]}, {"page": "Roger Ruskin Spear", "response": ["After the Bonzos parted company, Spear was part of the short-lived band biGGrunt, with Vivian Stanshall. He also toured with his solo show 'Roger Ruskin Spear and his Giant Kinetic Wardrobe' (a.k.a. 'Giant Orchestral Wardrobe'). In 1979, Spear formed Tatty Ollity with Dave Glasson, former member of Bob Kerr's Whoopee Band, Sam Spoons and Dave Knight. They released a single, \"Punktuation\" on Rough Trade. In 1982, Spear took part in The Cut Price Comedy Show, a weekly confection of corny sketches and ironic, end-of-the-pier jokes. Produced by ITV region TSW and screened on the then-new Channel 4, it ran for ten programmes and was then dropped."]}, {"page": "Magical Flight", "response": ["*Bob Kerr - trumpet"]}, {"page": "Pour l'Amour des Chiens", "response": ["The album was performed by original group members Neil Innes, Roger Ruskin Spear, Rodney Slater, 'Legs' Larry Smith, Vernon Dudley Bowhay-Nowell, Martin 'Sam Spoons' Ash, and Bob Kerr, with New Millennium Bonzos Adrian Edmondson, Stephen Fry, and Phill Jupitus. Also credited are Mickey Simmonds (musical director), David Catlin-Birch (guitar and vocals), Johnny Marter (drums and percussion) and Steve Barnacle (bass and jazz guitar)."]}, {"page": "Bonzo Dog Doo-Dah Band", "response": ["Thanks to Tracey's contacts, the band made their TV debut in February 1966, performing \"Won't You Come Home Bill Bailey\" on the children's show Blue Peter, introduced by John Noakes. In spring, Bob Kerr replaced Leon Williams and shortly after this, Sid Nicholls left.", "Although The Bonzos had started out playing and parodying trad jazz and 1920s-style popular music, by 1967 they were contemplating embracing a more contemporary style of rock music, in order to counter claims that they sounded too much like The Temperance Seven or the fictional, studio-concocted New Vaudeville Band. In fact although they were now exclusively managed by Gerry Bron, The Bonzos were invited to perform live as the New Vaudeville Band in order to capitalise on the fictional group's recent chart success with \"Winchester Cathedral\"—an offer The Bonzos immediately declined in favour of retaining their own artistic control.Richie Unterberger (2000) \"Urban Spacemen and Wayfaring Strangers\" 109–121(San Francisco: Miller Freeman)  However, Bob Kerr happily agreed to help form a real New Vaudeville Band, allegedly taking the bulk of his former bandmates' stage act with him, a move which finally forced The Bonzos' hand over the change of direction (Kerr later went on to create his own long-standing early Bonzos/Vaudevilles-style band, Bob Kerr's Whoopee Band, which included other ex-Bonzos Sam Spoons and Vernon Bowhay-Nowell in its future line-ups). According to Neil Innes, The Bonzos had learned a salutary lesson about the pitfalls of show business: ", "Our trumpeter then was Bob Kerr, great player, and a fun guy. But he was friends with (songwriter and producer) Geoff Stephens, who'd made \"Winchester Cathedral\" with session men. And he knew Bob, so he rang Bob up saying: 'What am I going to do? \"Winchester Cathedral\"'s a hit, and I've got no band to promote it.'  So Bob came, flushed with excitement, to the rest of us at our digs, saying, 'We can be The New Vaudeville Band!' and we said, 'Certainly not, no way!' So, Bob couldn't understand this, so we said, 'Well, go, you go and do it then, if you want to. Go, never darken our towels again!', kind of thing. But the next thing, on Top of the Pops, was the New Vaudeville Band, with the singer looking exactly like Viv, in a sort of lamé suit, all the musicians wearing the kind of suits we were wearing, with two-tone shoes. They'd even nicked the cutout comic speaking balloons, which we made out of hardboard, with a fret saw, and painted white, and then wrote, 'Wow, I'm really expressing myself!' to hold over somebody's head while they did a saxophone solo. There was the entire image, and for the next few weeks people were saying to us, 'Hey, you're like that New Vaudeville Band!' And that's when I think Legs Larry Smith said, \"Well, look ...'—he'd always been arguing for doing some more modern material, so we all said, 'Right, now we start writing our own stuff.' \"Neil Innes, quoted in the radio documentary Big Shot: A Journey Through the Canyons of Vivian Stanshall's Mind (BBC, 2001)", "On 28 January 2006 most of the surviving members of the band played a concert at the London Astoria, to celebrate the band's official 40th anniversary. Neil Innes, \"Legs\" Larry Smith, Roger Ruskin Spear, Rodney Slater, Bob Kerr, Sam Spoons and Vernon Dudley Bowhay-Nowell appeared. There were also a number of special guests attempting with various degrees of success to be Vivian Stanshall, one of two members of the band not still living (the other being bass player Dennis Cowan).  The various Stanshall impersonators included Stephen Fry, Ade Edmondson, Phill Jupitus and Paul Merton (who needed to read the words to \"Monster Mash\" from cue cards at the show). The classic Bonzo stage antics were in evidence, including performances on the Theremin Leg and Trouser Press. The show was filmed and was broadcast on BBC Four and also released on DVD in May 2006.", "Whilst Vernon allied with Bob Kerr to play as 'Bonzomania', Roger, Rodney and Sam remained together and joined up with pianist David Glasson (ex Whoopee Band) and performed as Three Bonzos and a Piano. Since October 2008, they have undertaken regular gigs.  They have included appearances from \"Legs\" Larry Smith and Vernon Dudley Bowhay-Nowell. Three Bonzos and a Piano launched a new CD Hair of the Dog at the Bloomsbury Theatre, London on 6 February 2010, featuring new numbers from all band members and some re-workings of older favourites.  Larry and Vernon were at the Bloomsbury gig. In 2012 they released another CD, Bum Notes.", "A configuration under the name 'Almost the Bonzo Dog Doo Dah Band' performed from 2012, more regularly featuring Legs and the now 82-year-old Vernon.  This grouping played their final gig together as a five piece, alongside Andy Roberts, Dave Glasson and the eleven-piece Keynsham Town Band in Milton Keynes. The following week, Sam Spoons' \"Bill Posters Will Be Band\" played their last, and the week after, \"Bob Kerr's Whoopee Band\" (with Vernon guesting) also disbanded. Spoons died on 27 September 2018 following a long illness.", "The band's onstage line-up varied, sometimes on a weekly basis, and they also invited a number of guest musicians into the recording studio. Additional members of various duration include: Vernon Dudley Bowhay-Nowell, Martin \"Sam Spoons\" Ash, Leon \"lenny\" Williams, John Parry, Raymond Lewitt, Sydney \"Big Sid\" Nicholls, Bob Kerr, Dave Clague, Joel Druckman, \"Borneo\" Fred Munt, Chalky Chalkey, Dennis Cowan, Aynsley Dunbar, Jim Capaldi, Anthony 'Bubs' White, Andy Roberts, Dave Richards, Dick Parry, Hughie Flint, Tony Kaye, and Glen Colson. Keith Moon, who became great friends with both Stanshall and Smith, played drums for part of The Bonzo's set at the 1969 Plumpton Festival (The Who were headlining that night). Moon also played drums for the majority of the Bonzos set at Bristol Locarno, using one drumstick and a brick. He was on a West Country tour with his valet, Dougal Butler who describes it in his book 'Full Moon'. ", "  bar:Bob       text:\"Bob Kerr\""]}, {"page": "1940 in jazz", "response": ["* 14 – Bob Kerr, English trumpeter and cornetist, Bonzo Dog Doo-Dah Band."]}, {"page": "Dorris Henderson", "response": ["After marrying Mac McGann, formerly of the Levee Breakers, Henderson settled in Twickenham and largely retired from music, bar some jingle work and a few appearances with Bob Kerr. Following a re-release of There You Go in 1999, Henderson returned to music on a more regular basis, culminating in the 2003 album Here I Go Again, a work featuring Renbourn and a number of other former colleagues and described by Henderson as 'my musical autobiography'."]}, {"page": "List of Nattjazz artists", "response": ["*Bob Kerr and his Woopee Band, at Torgallmenningen", "*Bob Kerr and his Woopee Band, at Trædesalen, USF Verftet"]}, {"page": "List of years in jazz", "response": ["* 1940 in jazz, deaths of Arthur Whetsel, Charley Straight, Charlie Dixon, Curtis Boyd, Einar Aaron Swan, Guy Kelly, Hal Kemp, Johnny Dodds, and Walter Barnes; births of Adam Makowicz, Al Jarreau, Alan Kay, Alex Riel, Allan Botschinsky, Arthur Blythe, Astrud Gilberto, Bennie Maupin, Billy Hart, Bjørn Johansen, Bjørn Stokstad, Bob Cornford, Bob Kerr, Bobby Graham, Boris Lindqvist, Brian Priestley, Carlos Ward, Casey Jones, Chuck Mangione, Chuck Rainey, Clem Curtis, Dave Burrell, Dave MacRae, Dick Morrissey, Dick Shearer, Don Myrick, Don Thompson, Doudou Gouirand, Eberhard Weber, Eddie Henderson, Egil Kapstad, Frank Zappa, Frode Thingnæs, Gary Bartz, Gene Perla, George Adams, Gustavo Bergalli, Hamiet Bluiett, Hans Dulfer, Henry Franklin, Herbie Hancock, James Dapogny, Janet Lawson, Jay Leonhart, Jerry Granelli, John Brunious, John DeFrancesco, John Pochee, John Roache, John Stevens, Karel Růžička, Kenny Cox, Keith Smith, Kenny Rankin, Larry Rosen, Larry Willis, Larry Young, Laudir de Oliveira, Lew Tabackin, Lindsay L. Cooper, Lisle Atkinson, Lonnie Hillyer, Lonnie Liston Smith, Louis Moholo, Lyn Cornell, Manfred Mann, Mani Neumeier, Mario Pavone, Maurice J. Summerfield, Mick Pyne, Mike Nock, Monica Dominique, Nancy King, Neal Creque, Ole Jacob Hansen, Paul Rutherford, Peter King, Pharoah Sanders, Pierre Courbois, Ralph Towner, Ramon Carranza, Ray Draper, Rod Mason, Roger Dawson, Ronald Shannon Jackson, Roscoe Mitchell, Roy Ayers, S. Frederick Starr, Sirone, Sonny Sharrock, Steve Swallow, Sue Raney, Terri Quaye, Thurman Green, Tom McGrath, Tony Levin, Vagif Mustafazadeh, Waymon Reed, Wendell Logan, and Wilton Felder."]}]}}