{"wiki_id": "http://www.wikidata.org/entity/Q4933198", "itemLabel": "Bob Lord", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Lord_(football_chairman)", "wikipedia_page": {"main": "Robert William \"Bob\" Lord (19 June 1908 – 8 December 1981) was an English businessman best known as the chairman of Burnley Football Club.\nBorn in 1908 in Burnley, Lancashire, Lord was the son of a barber. As a boy he worked for a local butcher until the age of 19 when he started his own business. Lord's butchery business eventually grew into 14 shops.Lord was an avid follower of his local football club, Burnley, and in 1950 attempted to join the board. This approach was blocked, but another position became available a year later. Lord was the sole candidate and thus became a board member. He became chairman in 1955.The early years of Lord's chairmanship were the most successful in the club's history. Following the appointment of Harry Potts as manager in 1958, Burnley were league champions in 1960, and reached the FA Cup Final in 1962. The club became renowned for their youth policy, which yielded players such as Jimmy McIlroy, Willie Morgan and Martin Dobson, and investment in a new training ground gave Burnley some of the most advanced facilities in the country. Lord oversaw major redevelopment of Turf Moor, including a new stand at the Cricket Field end, and a replacement for the Main Stand that Lord named after himself. Both stands were opened by a friend of Lord, the Conservative Party leader Edward Heath. As of 2020, both the Cricket Field Stand and Bob Lord stand are still in use.\nLord's media exclusions also extended to members of the press who he felt had slighted him. At the time of a 1966 interview with Arthur Hopcraft, Lord had banned three newspapers and six individual journalists from the Turf Moor press box, and Burnley players faced fines if they spoke to journalists without prior permission. His bearing and attitude led one press report to describe him as \"the Khrushchev of Burnley\".Lord was a staunch critic of televised football. He wrote at length on the subject in his 1963 autobiography, arguing that live coverage would \"damage and undermine attendances\". When the BBC highlights programme Match of the Day began in 1964, Lord banned the BBC from televising matches from Burnley's Turf Moor ground, and maintained the ban for five years. As a result of his stance, no game is broadcast between 2.45pm and 5.15pm on Saturday in the United Kingdom, excluding the FA Cup Final. It is known as the \"3pm Blackout\".Lord was a guest of honour at a dinner given by the Variety Club of Great Britain in March 1974, but his speech led to a walkout by participants. Lord said: \"We have to stand up against a move to get soccer on the cheap by the Jews who run TV.\" Manny Cussins, who was Jewish and chairman of Leeds United, said he would walk out of the Elland Road boardroom if Lord visited when Burnley was playing there. Lord told his own board to stay away from the game.In 1962 neighbouring football club Accrington Stanley were bottom of the Fourth Division and facing severe financial difficulties. Lord and Sam Pilkington took control of the club, but following a meeting on 5 March at which debts of £62,000 came to light, Lord withdrew his support. The club resigned from the Football League the following day.A frequent critic of the football authorities, Lord relished the role of the outsider. In his autobiography he asked rhetorically \"Who was the butcher's boy to be telling the big shots how to run their mismanaged business?\" He regularly made complaints to the Football League, to the point where the minutes of a League meeting stated that \"It was decided unanimously that the Committee could not tolerate the irresponsible comments of Mr Lord.\" Among the positions he took on governance issues were support for the Professional Footballers' Association (PFA) campaign to end the maximum wage, and calls for an end to the ban on paid directors and the introduction of professional referees. Despite his clashes with authority Lord sought to become part of the football establishment. He was admitted to the Football League's Committee in 1967, nine years after his first attempt. While on the Committee, Lord was a strong opponent of matches being played on Sundays, an idea first proposed during the Three-Day Week fuel shortages of 1974. He attempted to become League President twice. In the 1972 contest he had to withdraw through illness; in 1974 he lost to Lord Westwood by 41 votes to 6. Lord was made President of the Alliance Premier League (now the National League) upon its creation in 1979, and had a non-league cup competition, the Bob Lord Trophy named after him. Following the resignation of Lord Westwood in March 1981, Lord became acting President of the Football League. However, ill health forced him to relinquish the position three months later. His chairmanship of Burnley ended in September 1981 when he sold most of his shares in the club. Though Lord was still a Burnley director, by this time he was seriously ill, and died of cancer in December 1981.", "link_mentions": {}}}