{"wiki_id": "http://www.wikidata.org/entity/Q4931744", "itemLabel": "Bob Barratt", "itemDescription": "English record producer for EMI and founder of record-label Grasmere Records", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Barratt", "wikipedia_page": {"main": "Denis Mervyn \"Bob\" Barratt (22 March 1938 – 30 January 2004) was an English record producer for EMI and founder of record-label Grasmere Records.\nBarratt died of liver cancer on 30 January 2004, leaving his wife and three daughters.", "link_mentions": [{"page": "Grasmere (village)", "response": ["*Bob Barratt (1938 or 1939–2004) was the founder of the Grasmere Records label for brass band and organ music."]}, {"page": "Marmalade (band)", "response": ["Becoming popular in Scotland, and under the management of Billy Grainger, in early 1964 they were championed by Scottish music journalist Gordon Reid, which led to them being signed to EMI's Columbia label by Norrie Paramor after auditions at Glasgow's Locarno Ballroom. They went on to record four singles, including a cover of the 1963 Chubby Checker US hit \"Twenty Miles\", which was a big seller locally but failed to chart nationally. The Columbia releases, although uncredited, were all produced by Bob Barratt, EMI staff producer, with Norrie Paramor as executive. Paramor played the celesta on \"What's The Matter With Me\"; the b-side of \"Twenty Miles\". In 1965, they played a long stint in Germany at the Storyville in Cologne and also in Duisburg. By this time The Gaylords had attained status as one of the top groups in Scotland, borne out in music poll results, but were ambitious, and so on their return from Germany to London in early 1965, they decided to try for success in the UK as a whole, and remained in London, where they changed management and agency representation, as Billy Grainger wished to remain in Glasgow."]}, {"page": "Trisha Noble", "response": ["* \"I Was Only Foolin' Myself\" (Bob Barratt). Recorded with orchestra arranged and conducted by Martin Slavin. London, 1963 "]}, {"page": "Confessions from a Holiday Camp", "response": ["The title track to the film was called Give Me England and was performed by scrumpy and western band, The Wurzels, arranged and conducted by Ed Welch and produced by Bob Barratt. It was released on 45 by EMI records Ltd (EMI 2677)."]}, {"page": "Lust for a Vampire", "response": ["Jimmy Sangster replaced Terence Fisher as director at very short notice. Partially due to censorship restraints from the British Board of Film Classification, this film and the next one, Twins of Evil, had increasingly less overt lesbian elements in the story than did The Vampire Lovers. Carmilla, for example, in this film falls in love with a man. Ingrid Pitt was offered the lead, but turned it down. Peter Cushing was supposed to have appeared in the film, but bowed out to care for his sick wife. Cushing was replaced by Ralph Bates, who described Lust for a Vampire as \"one of the worst films ever made\". Bates had earlier appeared in Taste the Blood of Dracula with Madeline Smith, who starred in the previous Karnstein film, The Vampire Lovers. The song \"Strange Love\" was recorded for the film by Tracy, a teen singer from Wembley and produced as a 45\" by Bob Barratt."]}, {"page": "Malcolm Tomlinson", "response": ["Tomlinson was born in Isleworth, Middlesex, England, and attended Spring Grove Grammar School, where he was classmates with drummer Mick Underwood. A multi-instrumentalist, singer and songwriter, he started out in the early 1960s playing drums in West London band The Panthers. In January 1963, he joined Jeff Curtis & The Flames, regulars at the Ealing Club. The group recorded a five-track acetate with Joe Meek before Tomlinson left in mid-1964 to join The Del Mar Trio with singer Jimmy Marsh (born James Marsh, 9 April 1941, Salem, Carmarthenshire, Wales), guitarist Allen Bevan and bass player Tony Rowland. In February 1965, the group recorded four tracks for EMI at Abbey Road under the supervision of Bob Barratt. Two months later, the band changed name to James Deane & The London Cats and headed for southern Germany where the band spent a year playing clubs, including in Furth, Munich and Nuremberg. The drummer also spent three months working with a German band."]}, {"page": "George Martin (comedian)", "response": ["Recordings: LP record Basil Brush! (EMI) SRS5051 A Starline Original, 1970 – Producer Bob Barratt. (George was heard as Basil's sidekick, performing a monologue and skits with Basil – also included several original Martin compositions and parodies.)"]}, {"page": "Scrumpy & Western EP", "response": ["Scrumpy & Western EP was the second record released by Adge Cutler and The Wurzels, containing the two tracks from their original 1966 hit single, \"Drink Up Thy Zider\" and \"Twice Daily\", with two further tracks \"Pill, Pill\" and \"Hark At 'Ee Jacko\". The band's first single had reached number 45 in the UK Singles Chart, despite the B-side, \"Twice Daily\" being banned by the BBC for being too raunchy. The subsequent Scrumpy & Western EP, released the following year, did not achieve a chart placing, however it gave its name to whole new genre of music: Scrumpy and Western. All the tracks were recorded live by Bob Barratt at The Royal Oak Inn, Nailsea, on 2 November 1966."]}, {"page": "Barratt (surname)", "response": ["*Bob Barratt (died 2004), British record producer"]}, {"page": "Tracy (English singer)", "response": ["Tracy was a UK teen singer from Wembley who recorded 1969–1971 for Columbia UK record producer Bob Barratt. In 1971 she recorded \"Strange Love\" for the Hammer Horror film Lust for a Vampire, and again as a 45\".Randall D. Larson Music from the House of Hammer 1996John Kenneth Muir Horror Films of the 1970s 2002 p. 62Ten Years of Terror British Horror Films of the 1970s \"'Strange Love' performed by Tracy, Its specific placement within the film..."]}, {"page": "Finland in the Eurovision Song Contest 1973", "response": ["The winning song Tom Tom Tom was performed in Finnish in the national selection but translated into English for the international Song Contest. The English lyrics were written by Bob Barratt. However, the song title didn't change."]}]}}