{"wiki_id": "http://www.wikidata.org/entity/Q4934923", "itemLabel": "Bobby Delahay", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Bobby_Delahay", "wikipedia_page": {"main": "William James 'Bobby' Delahay (2 September 1900 – 12 September 1978) was a Welsh international rugby union who played club rugby for Bridgend and Cardiff. Although he played at scrum-half he was also selected for Wales at centre and fly-half.", "link_mentions": [{"page": "Cardiff RFC", "response": ["* Bobby Delahay 1926"]}, {"page": "1924–25 New Zealand rugby union tour of Britain, Ireland and France", "response": ["Wales: Tom Johnson (Cardiff), Ernie Finch (Llanelli), Albert Jenkins (Llanelli), Albert Stock (Newport), Rowe Harding (Swansea), Jack Wetter (Newport) capt., Eddie Williams (Neath), Bobby Delahay (Cardiff), Dai Parker (Swansea), Jack Gore, (Blaina), Charlie Pugh (Maesteg), Steve Morris (Cross Keys), Cliff Williams (Llanelli), Douglas Marsden-Jones (London Welsh), Dai Hiddlestone (Neath) "]}, {"page": "1978 in Wales", "response": ["*12 September - Bobby Delahay, Wales rugby union captain, 78"]}, {"page": "1900 in Wales", "response": ["* 2 September – Bobby Delahay, Wales rugby union captain (died 1978)"]}, {"page": "1922 Five Nations Championship", "response": [" Wales: Joe Rees (Swansea), Cliff Richards (Pontypool), Brinley Evans (Llanelli), Islwyn Evans (Swansea), Frank Palmer (Swansea), Billy Bowen (Swansea), Bobby Delahay (Bridgend), Tom Parker (Swansea) (capt.), Jack Whitfield (Newport), Thomas Jones (Newport), Steve Morris (Cross Keys), Tom Roberts (Risca), John Griffiths Stephens (Llanelli), Dai Hiddlestone (Neath), William Cummins (Treorchy)"]}, {"page": "Ernie Finch", "response": ["Finch was back in the Welsh squad in 1925 when he again faced France in the Five Nations Championship, this time in Wales at the Cardiff Arms Park. It was a more convincing Welsh performance and Finch scored two tries in an 11-5 victory. Finch held onto his place for the season's final Welsh international against Ireland, but found himself on the losing side against an impressive Irish team. In 1926 he played just one match, as part of Bobby Delahay's Welsh team to France, which Wales were narrow victors."]}, {"page": "Dai Hiddlestone", "response": ["Hiddlestone was born in Hendy, Carmarthenshire, where he played his early rugby with local club, Hendy RFC. After the end of World War I he joined Llanelli a first class team within Welsh club rugby. He left Llanelli under poor circumstances, some sources stating that Hiddlestone was considered \"too dirty\" for the club,Not only Neath may be cast into outer darkness The Independent 18-12-2001 though at the time of leaving the club he was the present team captain, a position elected by the club members. Whatever the reason for his leaving Llanelli, Hiddlestone was accepted to play for Neath. In 1922 he was first selected to represent Wales as part of the Home Nations Championship in a game against England. The Welsh team he joined had many new caps, including Swansea's Islwyn Evans and Frank Palmer, Bridgend's Bobby Delahay and William Cummins from Treorchy. Led by Tom Parker, Wales overran the English team, scoring a record eight tries against England; Hiddlestone himself not only scored one of the tries, but is also credited as being the central linchpin in the Welsh attack that won the game so comfortably.Smith (1980), pg 205."]}, {"page": "Tommy Rees (rugby)", "response": ["In 1926, Rees was playing for Welsh exile team London Welsh, and after an excellent victory against Cross Keys at Blackheath on 6 March, Rees along with teammates Windsor Lewis and Wick Powell, was selected to face Ireland as part of the 1926 Five Nations Championship.Jones (1985), pg 81. The game was played at St. Helen's, Swansea, with the Welsh team being led by Swansea's Rowe Harding. The Wales team were victorious over Ireland, robbing the Irish of both the Triple Crown and Grand Slam. Rees scored his first international points during the game with a single conversion, and at the end of the match, the three London Welsh players were carried from the pitch shoulder-high. The press recorded that Rees had \"a great game that caused intense enthusiasm\". Rees was reselected for the next Wales international, the final game of the 1926 tournament, away to France. Now captained by Bobby Delahay, Wales won the game 7–5."]}]}}