{"wiki_id": "http://www.wikidata.org/entity/Q4932329", "itemLabel": "Bob Dunn", "itemDescription": "British politician (1946-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Dunn_(politician)", "wikipedia_page": {"main": "Robert John Dunn (14 July 1946 – 24 April 2003), known as Bob Dunn, was a British Conservative Party politician.\n\n", "link_mentions": [{"page": "1979 United Kingdom general election", "response": ["|Bob Dunn"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Bob Dunn"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Bob Dunn"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Bob Dunn"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Bob Dunn"]}, {"page": "List of ministers under Margaret Thatcher", "response": ["!scope=row|Bob Dunn"]}, {"page": "Robert Dunn", "response": ["Robert or Bob Dunn may refer to:", "* Bob Dunn (American football) (1904–1978), American football player", "* Bob Dunn (politician) (1946–2003), British Conservative Party MP for Dartford, 1979–1997", "* Bob Dunn (cartoonist) (1908–1989), American cartoonist", "* Bob Dunn (musician) (1908–1971), pioneer Western swing musician"]}, {"page": "Dartford (UK Parliament constituency)", "response": ["| Bob Dunn"]}, {"page": "List of United Kingdom MPs: D", "response": ["*Bob Dunn (1979–1997)"]}, {"page": "Co-op Academy Swinton", "response": ["* Bob Dunn, Conservative Party politician, (1946–2003) "]}, {"page": "Robert John Dunn", "response": ["#REDIRECT Bob Dunn (politician)"]}, {"page": "Sydney Irving", "response": ["Irving was twice Member of Parliament for Dartford, originally elected in 1955. In Harold Wilson's Labour Government 1964-1970, he was the government's Deputy Chief Whip and Treasurer of the Household from 1964 to 1966, and served as a Deputy Speaker of the House of Commons from 1966 to 1970, when he lost his seat to the Conservatives. He was re-elected in 1974, but lost the seat again in 1979, to the Conservative Bob Dunn.  Subsequently, on 10 July 1979, Irving was created a life peer as Baron Irving of Dartford, of Dartford in the County of Kent."]}, {"page": "2003 Dartford Borough Council election", "response": ["Elections to Dartford Borough Council were held on 1 May 2003.  The whole council was up for election on new boundaries, which reduced the total number of seats from 47 to 44. The election in Longfield, New Barn and Southfleet ward was postponed following the death of Bob Dunn, one of the Conservative candidates. The delayed election returned three Conservative councillors, increasing their number to 21."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Bob Dunn; MP for Dartford (1979–1997)"]}, {"page": "Second Thatcher ministry", "response": ["|Bob Dunn||13 June 1983 – June 1987|| "]}, {"page": "Third Thatcher ministry", "response": ["|rowspan=6|Under-Secretary of State, Education and Science||Bob Dunn||June 1987 – 26 July 1988|| "]}, {"page": "Bob Dunn (1946-2003)", "response": ["#REDIRECT Bob Dunn (politician)"]}, {"page": "Specialist school", "response": ["The CTC programme was supported and announced by education secretary Kenneth Baker. Although most major companies and businessmen saw no reason to support the programme, sponsors were found in people like Lord Harris (later the sponsor of the Harris Federation), Harry Djanogly, Stanley Kalms and Michael Ashcroft. The City Technology Colleges Trust led by Cyril Taylor also sponsored, oversaw and delivered the programme. Taylor was the main supporter of specialist schools, often being regarded as their pioneer. The supporters within the government were Chris Patten, Tony Kerpel, Alistair Burt, George Walden, Bob Dunn and Virginia Bottomley. Prime Minister Margaret Thatcher and her chief policy adviser, Brian Griffiths, also offered their guidance and feedback on the programme. Thatcher's main motivation for this was her opposition to the LEAs and her vision to move schools out of their control. Griffiths often compared them to Soviet republics, bringing this comparison to anti-communist Thatcher:"]}, {"page": "List of United Kingdom MPs who died in the 2000s", "response": ["|Bob Dunn"]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Bob Dunn"]}]}}