{"wiki_id": "http://www.wikidata.org/entity/Q4944315", "itemLabel": "Marianne Davies", "itemDescription": "English singer who also played flute and harpsichord", "wikipedia_url": "https://en.wikipedia.org/wiki/Marianne_Davies", "wikipedia_page": {"main": "Marianne Davies (1743 or 1744 – c. 1818) was an English musician, and the sister of the classical soprano Cecilia Davies. She was a singer who also played flute and harpsichord.\nIn 1762 she became the first person to publicly perform on the glass harmonica (also known as the armonica), an instrument consisting of variously sized and tuned glass bowls that rotate on a common shaft, played by touching the spinning glass with wet fingers. She toured in concerts with her sister, performing in Dublin (1763), London, and on the Continent where the two girls became acquainted with the Mozart family. Beethoven also composed music for the instrument.\nShe corresponded regularly with Benjamin Franklin, who invented the instrument. Various correspondence in the historical archives outlines her failing health, and her desire to have the opportunity to play the instrument again before her death.", "link_mentions": [{"page": "Glass harmonica", "response": ["Benjamin Franklin invented a radically new arrangement of the glasses in 1761 after seeing water-filled wine glasses played by Edward Delaval at Cambridge in England in May 1761. Franklin worked with London glassblower Charles James to build one, and it had its world premiere in early 1762, played by Marianne Davies.", "Marianne Davies, who played flute and harpsichord – and was a young woman said to be related to Franklin – became proficient enough at playing the armonica to offer public performances. After touring for many years in duo performances with her celebrated vocalist sister, she was also said to have been afflicted with a melancholia attributed to the plaintive tones of the instrument. Marianne Kirchgessner was an armonica player; she died at the age of 39 of pneumonia or an illness much like it.Bossler, Heinrich (1809-05-10).  Marianne Kirchgessner obituary. Allgemeine Musikalische Zeitung, 10 May 1809. Obituary written by Marianne Kirchgessner's manager Heinrich Bossler. However many others, including Franklin, lived long lives.", "* Marianne Davies"]}, {"page": "1762 in music", "response": ["* The first public concert with a glass harmonica is performed by Marianne Davies."]}, {"page": "Davies", "response": ["* Marianne Davies, English musician"]}, {"page": "Marianne (given name)", "response": ["* Marianne Davies, musician"]}, {"page": "Anne Ford", "response": ["Ford gave a performance at Spring Gardens in 1761, \"English airs\". accompanying herself on the musical glasses. She also wrote a published work, Instructions for Playing on the Musical Glasses. The instrument was comparable to the glass harp of Richard Pockrich consisting of individual glass goblets tuned with water, and preceded the 1761 mechanized armonica (Glass harmonica) invention of Benjamin Franklin and played by Marianne Davies."]}, {"page": "Timeline of United States inventions (before 1890)", "response": ["* Also known as the glass harmonica or glass armonica, Benjamin Franklin invented a musical instrument in 1761, an arrangement of glasses after seeing water-filled wine glasses played by Edmund Delaval in Cambridge, England. Dr. Franklin, who called his invention the \"armonica\" after the Italian word for harmony, worked with London glassblower Charles James to build one, and it had its world première in early 1762, played by Marianne Davies. In this version, 37 bowls were mounted horizontally nested on an iron spindle. The whole spindle turned by means of a foot-operated treadle. The sound was produced by touching the rims of the bowls with moistened fingers. Rims were painted different colors according to the pitch of the note."]}, {"page": "Cecilia Davies", "response": ["Cecilia Davies (c. 1756 – 3 July 1836) was an English classical soprano who had an active international career in concerts and operas during the second half of the 18th century. In Italy she was known as \"l'Inglesina\". She was the sister of Marianne Davies who was the first professional glass harmonica musician. She sang in several world premieres during her career, including Thomas Arne's Love in a Village (1762, Margery) and Josef Mysliveček's La Circe (1779, title role)."]}]}}