{"wiki_id": "http://www.wikidata.org/entity/Q4942781", "itemLabel": "Mary Cholmondeley", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Cholmondeley", "wikipedia_page": {"main": "Mary Cholmondeley (usually pronounced /ˈtʃʌmli/, 8 June 1859 – 15 July 1925) was an English novelist. Her bestseller, Red Pottage, satirised religious hypocrisy and the narrowness of country life. It was adapted as a silent film in 1918.\n\n", "link_mentions": [{"page": "1917 in literature", "response": ["*Mary Cholmondeley – Under One Roof"]}, {"page": "1906 in literature", "response": ["*Mary Cholmondeley – Prisoners"]}, {"page": "1921 in literature", "response": ["*Mary Cholmondeley – The Romance of His Life"]}, {"page": "1899 in literature", "response": ["*Mary Cholmondeley – Red Pottage"]}, {"page": "1925 in literature", "response": ["* July 15 – Mary Cholmondeley, English novelist (born 1859)"]}, {"page": "1893 in literature", "response": ["*Mary Cholmondeley – Diana Tempest"]}, {"page": "1886 in literature", "response": ["*Mary Cholmondeley – The Danvers Jewels"]}, {"page": "1859 in literature", "response": ["*June 8 — Mary Cholmondeley, English writer (died 1925)"]}, {"page": "Rhoda Broughton", "response": ["Rhoda Broughton developed a taste for literature as a young girl, especially poetry. She was influenced by William Shakespeare, as frequent quotations and allusions throughout her works show. Presumably after reading The Story of Elizabeth by Anne Isabella Thackeray Ritchie, she had the idea of trying her own talent. She produced her first work within six weeks. Parts of this novel she took with her on a visit to her uncle Sheridan le Fanu, himself a successful author, who was highly pleased with it and assisted her in having it published – her first two novels appeared in 1867 in his Dublin University Magazine. Le Fanu also introduced her to the publisher Richard Bentley, who refused her first novel on the grounds of it being improper material, but accepted the second. Broughton in turn introduced Mary Cholmondeley to her publishers in about 1887.ODNB entry on Mary Cholmondeley by Kate Flint: Retrieved 4 May 2012. Broughton's writing style was to influence other writers like Mary Cecil Hay, who is thought to have a similar style of dialogue."]}, {"page": "Market Drayton", "response": ["* Mary Cholmondeley (born in Hodnet 1859 – 1925) was an English novelist. Her best-selling novel, (published in 1899) Red Pottage, satirised religious hypocrisy and the narrowness of country life. It was adapted into a silent film in 1918. "]}, {"page": "Under One Roof", "response": ["* Under One Roof, a 1917 novel by Mary Cholmondeley"]}, {"page": "Condover", "response": ["* The novelist Mary Cholmondeley (1859-1925) lived briefly at Condover Hall in 1896 before her family left and sold the estate."]}, {"page": "Hodnet", "response": ["* Mary Cholmondeley (1859–1925) an English novelist, lived in Hodnet until about 1896.Literary Heritage West Midlands...; Mary Cholmondeley site by biographer Carolyn Oulton: "]}, {"page": "Condover Hall", "response": ["Owned by the Owen family until 1863, the house then passed to the Cholmondeley family, and novelist Mary Cholmondeley (1859–1925) lived in the hall for a few months in 1896 before moving to London. Her uncle, Reginald Cholmondeley (1826–1896), owned the house when it was visited by the American writer Mark Twain (1835–1910) in 1873 and 1879.An Illustrated Literary Guide to Shropshire, p.94. The house and estate was sold by the family in 1897 to Edward Brocklehurst Fielden, who later sold it in 1926."]}, {"page": "Percy Lubbock", "response": ["*Mary Cholmondeley: A Sketch from Memory (1928)"]}, {"page": "Bookman list of bestselling novels in the United States in the 1900s", "response": ["# Red Pottage by Mary Cholmondeley"]}, {"page": "Stella Benson", "response": ["Benson was born to Ralph Beaumont Benson (1862–1911), a member of the landed gentry, and Caroline Essex Cholmondeley in Easthope, Shropshire in 1892. Stella's aunt, Mary Cholmondeley, was a well-known novelist. Stella was often ill during her childhood and throughout her life. By her sixth birthday, she and her family, based in London, had moved frequently. She spent some of her childhood in schools in Germany and Switzerland. She began writing a diary at the age of 10 and kept it up for all of her life. By the time she was writing poetry, her parents separated; subsequently, she saw her father infrequently. When she did see him, he encouraged her to quit writing poetry for the time being, until she was older and more experienced. Instead, Stella increased her writing output, adding novel-writing to her repertoire. When her father died, Stella learned that he had been an alcoholic."]}, {"page": "Andrew Melrose", "response": ["| 1910  || Patricia Wentworth || A Marriage Under the Terror || Flora Annie Steel, Mary Cholmondeley, Mrs Henry de la Pasture ", "| 1913  || Margaret Peterson || The Lure of the Little Drum || Joseph Conrad, Mary Cholmondeley, W. J. Locke "]}, {"page": "Jane Findlater", "response": ["From then until the outbreak of World War I, the sisters published a series of novels, including their co-authored work, and two collaborations with Kate Douglas Wiggin and Allan McAulay (pseudonym of Charlotte Stewart). Their popularity led to a much wider circle of acquaintances, including friendship with Ellen Terry and Mary Cholmondeley. After meeting Henry James, they got to know his brother William and his sister-in-law Alice while on a lecture tour to the United States in 1905."]}, {"page": "After All", "response": ["* After All, a novel by Mary Cholmondeley"]}, {"page": "List of nicknames of European royalty and nobility: M", "response": ["*Mary Cholmondeley "]}, {"page": "Tolmers Park", "response": ["In 1761, Tolmers Park was in the hands of Sir Frances Vincent, who replaced the Tudor house with the present building in the classical style with an Ionian porch. An Enclosure Act of 1806 allowed part of Northaw Common to be enclosed and planted with specimen trees to form Home Wood. The whole estate was sold at auction in 1834. It was bought by Samuel Mills, of Russell Square, a textile and property magnate, who already owned adjoining land in Cuffley. The estate then passed to his son, Thomas Mills, who was MP for Totnes and then to his other son, John Remington Mills, also an MP (for Wycombe). In 1860, Tolmers was leased to Thomas Bazley, a Manchester cotton mill owner who had been a Royal Commissioner for the Great Exhibition and was MP for Manchester. He became 1st Baronet Bazley of Tolmers in 1869 (motto: Finem Respice). The ownership of the estate eventually passed to Samuel Mills’ two great-granddaughters, one of whom was the novelist Mary Cholmondeley. From 1910 to 1918 the eastern edge of the estate was busy with excavations for the Hertford Loop railway line, one of the last great projects of the railway age."]}, {"page": "Ufford, Suffolk", "response": ["*Mary Cholmondeley (1859–1925), novelist, lived in Ufford for some years before the First World War.ODNB entry: Kate Flint: Retrieved 4 May 2012."]}, {"page": "Red Pottage (film)", "response": ["Red Pottage is a 1918 British silent drama film directed by Meyrick Milton and starring C. Aubrey Smith, Mary Dibley and Gerald Ames.BFI.org It is an adaptation of the 1899 novel Red Pottage by Mary Cholmondeley."]}, {"page": "Red Pottage", "response": ["* Red Pottage (novel), an 1899 British novel by Mary Cholmondeley"]}, {"page": "Cholmondeley (surname)", "response": ["* Mary Cholmondeley (1859–1925), English writer"]}, {"page": "Mary Cholmondeley (heiress)", "response": ["Cholmondeley was born as Mary Holford in late 1562 or January 1563 to Christopher Holford and Elizabeth Mainwaring in Holford manor, Great Budworth, Cheshire, England and christened (baptised) on 20 January 1563.  She married Sir Randall Brereton of Malpas but he soon died.  Around 1581, she married Sir Hugh Cholmondeley.  They had eight children, named Robert, Hatton, Hugh, Thomas, Francis, Mary, Lettice, and Frances, before Sir Hugh's death in 1601.  Mary Cholmondeley died on 15 August 1625 at the age of sixty-three in Vale Royal, Whitegate, Cheshire, England and was buried the next day in the church at Malpas, Cheshire, England.Susanna Calkins, ‘Cholmondeley , Mary, Lady Cholmondeley (bap. 1563, d. 1625), Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 24 Nov 2014", "Cholmondeley came to notice following the legal disputes over Holford Manor and the estates of her father, Christopher Holford, who died on 27 January 1581.  His half-brother, George Holford of Newborough, was the next male-heir of the Holfords, but the recently married Mary challenged his legal claim to the land.  The lawsuit between them went on for forty years.  Finally, around 1620, they came to a settlement, under which Mary Cholmondeley received the Holford manorhouse and George Holford received the manor of Iscoit in Flintshire.  The case was not settled but intercession led to Mary agreeing to share the estate with those who disputed her title. However it was Mary that inherited the manor. She renovated and enlarged the Holford manorhouse.", "In 1615, nearly a century after the Dissolution of the Monasteries, Mary Cholmondeley bought Vale Royal Abbey and its surrounding land.  She built a house on the site, rebuilt the old hall, and in 1625 added a lath and plaster wing.  James I held court at Vale Royal for three days and dubbed Mary Cholmondeley the \"bolde lady of Cheshire\" because she rebuffed his offer to advance the political careers of her sons.  She lived at Vale Royal from 1616 to her death."]}, {"page": "Red Pottage (novel)", "response": ["Red Pottage is an 1899 novel by English author Mary Cholmondeley."]}]}}