{"wiki_id": "http://www.wikidata.org/entity/Q4952735", "itemLabel": "Dani Harmer", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Dani_Harmer", "wikipedia_page": {"main": "Danielle Jane Harmer (Born 8 February 1989) is an English actress, television personality, acting coach, and former singer. She is best known for her lead role as Tracy Beaker in the CBBC series The Story of Tracy Beaker (2002–2006), Tracy Beaker Returns (2010–2012), for which she won a BAFTA in 2010, The Tracy Beaker Survival Files (2011–2012), My Mum Tracy Beaker, and The Beaker Girls (both 2021). Harmer played the role of Molly Louise Venables in the BBC One comedy series After You've Gone (2007), and later starred in her own CBBC sitcom Dani's House (2008–2012) and its spin-off series Dani's Castle (2013–2014).\nIn 2008, Harmer branched into the music industry and signed a £3m record deal with Universal Group. She recorded her debut studio album, Superheroes, in September 2009, and released the single and theme from Dani's House, \"Free\", but the album was never released and it was later confirmed she had abandoned her music career indefinitely.  \nIn 2012, Harmer competed in the fourth series of Let's Dance for Sport Relief alongside Tyger Drew-Honey, in which they both finished as joint runners-up. Later that year, she competed in the tenth series of Strictly Come Dancing, partnered with Vincent Simone, reaching the final and finishing in fourth place.", "link_mentions": [{"page": "Berkshire", "response": ["* Dani Harmer (born 1989; actress)"]}, {"page": "Nicholas Lyndhurst", "response": ["In 2007, Lyndhurst returned to the BBC with his first new sitcom in fourteen years, After You've Gone, in which he plays a divorced dad moving back into the marital home to look after his daughter (Dani Harmer) and son (Ryan Sampson) together with his mother-in-law, played by Celia Imrie, after his ex-wife goes to work as a recovery nurse on a third world disaster relief mission."]}, {"page": "Bracknell", "response": ["Tracy Beaker actress Dani Harmer was brought up in Bracknell."]}, {"page": "My Family", "response": ["* Dani Harmer"]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:pink;\"|Dani Harmer", "|Dani Harmer & Vincent Simone", "|Dani Harmer"]}, {"page": "Dani", "response": ["* Dani Harmer (born 1989), British actress"]}, {"page": "Jacqueline Wilson", "response": ["* The Story of Tracy Beaker (2002–2005, CBBC). Starring Dani Harmer as Tracy and Lisa Coleman (whose sister, Charlotte, appeared in Double Act as Miss Debenham) as Cam. Original broadcast dates: 8 January 2002 – 18 December 2005.", "* Tracy Beaker Returns (2010–2012). This is a series in which Tracy (Dani Harmer) returns to the \"Dumping Ground\" (Stowey House, whose name has been changed to Elm Tree House) to earn money for her new book because she used Cam's credit card without permission to publish it. She realises that Elm Tree House has changed and the new children act just like she did herself in her days. At times, she tries to help the children, concluding in the new social workers almost firing her. But sometimes she only gets the child's part of the story, then being told the whole thing and being totally confused and outraged."]}, {"page": "The Story of Tracy Beaker", "response": ["The Story of Tracy Beaker was adapted for television by the BBC ran for five series on CBBC from 8 January 2002 to 9 February 2006, featuring Dani Harmer as Tracy Beaker. The first series was filmed in London, but from series two, the series moved to Wales due to a suggestion from the producer, Jane Dauncey. In 2008, a spin-off from The Story of Tracy Beaker, was announced under the working title of 'Beaker's Back', but the show was named 'Tracy Beaker Returns' instead. It aired on CBBC for three series from 8 January 2010 to 23 March 2012. The former La Sagesse School in Jesmond, Newcastle upon Tyne was used as The Dumping Ground set In March 2012, Amy Leigh Hickman announced a spin-off from Tracy Beaker Returns called The Dumping Ground in the CBBC HQ. It had been announced following Dani's decision to quit her role as Tracy and has aired on CBBC since 4 January 2013; it is currently in its ninth series. The first series was filmed at the same location as Tracy Beaker Returns, but since series two, the series has been filmed in Morpeth, Northumberland. The series have also had spin-off series."]}, {"page": "Tracy Beaker", "response": ["Tracy Beaker is the lead character in the Tracy Beaker franchise. After first appearing as the main character in Jacqueline Wilson's 1991 book The Story of Tracy Beaker, she appeared in the children's television drama of the same name, portrayed by Dani Harmer, and its sequel series Tracy Beaker Returns, as well as numerous spin-offs, Jacqueline Wilson books, a play and a video game. Harmer reprised her role as Tracy in the 2021 television series My Mum Tracy Beaker followed by The Beaker Girls.", "In 2002, the BBC made a children's series based on the books, The Story of Tracy Beaker, starring Dani Harmer as Tracy. The programme ran for five series on CBBC and included a one-off feature-length movie, Tracy Beaker's Movie of Me. Harmer first took on the role at the age of 12 and has maintained it for 10 years. The character returned for an additional three series of Tracy Beaker Returns, in which an adult Tracy Beaker helps a new generation of kids at the Dumping Ground.", "The first few episodes of the fifth series do not feature Tracy, as she is on holiday with Cam in Egypt. She contacts the DG daily. However, she returns to the care home afterwards, when Cam's new boyfriend Gary moves in with them. Most episodes do not include Tracy as Dani Harmer (who plays Tracy) was suffering from migraines during filming. Tracy Beaker makes a shock return to the Dumping Ground. Tracy has decided that she cannot live with Cam anymore because Cam wants her new boyfriend Gary to move in with them. Tracy is forced to think about her future, So she agrees to spend time with Cam and Gary and, to her surprise, they get on very well, until Cam drops the bombshell that they are getting married – this is way too much for Tracy to handle and she wants nothing to do with the 'sordid' affair. Cam and Gary get married and Tracy only manages to make it thanks to Crash and Jackie. In the end, Cam and Gary tell Tracy they are going to adopt her."]}, {"page": "Danielle Harmer", "response": ["#Redirect Dani Harmer"]}, {"page": "Danielle", "response": ["*Dani Harmer (born 1989), British actress, television presenter and former singer"]}, {"page": "SMart", "response": ["|| Dani Harmer "]}, {"page": "The British Soap Awards", "response": ["| \"Best Young Performance\"Presented by Joey Essex and Dani Harmer|| Ellis Hollins (Tom Cunningham in Hollyoaks) || Alex Bain (Simon Barlow in Coronation Street)Oliver Woollford (Tom Finlayson in Doctors)Mimi Keene (Cindy Williams in EastEnders)Joe Warren-Plant (Jacob Gallagher in Emmerdale)"]}, {"page": "1989 in the United Kingdom", "response": ["* 8 February – Dani Harmer, actress"]}, {"page": "Harmer", "response": ["*Dani Harmer (born 1989), British actress"]}, {"page": "After You've Gone (TV series)", "response": ["After You've Gone is a British comedy that aired on BBC One from 12 January 2007 to 21 December 2008. Starring Nicholas Lyndhurst, Celia Imrie, Dani Harmer and Ryan Sampson, After You've Gone was created by Fred Barron, who also created My Family. The writers include Barron, Ian Brown, Katie Douglas, James Hendie, Danny Robins, Andrea Solomons and Dan Tetsell. Three series and two Christmas specials aired, and work on scripts for a fourth series had already begun when the BBC withdrew the commission in November 2008 and cancelled the series.", "| Dani Harmer || Molly Louise Venables  || 2007–2008 || 1–3 || 25 || Main", "Amanda Abbington (Siobhan) is seen less frequently in Series Three due to her real-life pregnancy. Nicholas Lyndhurst and Celia Imrie were already household names by the time they appeared on the programme: Lyndhurst had appeared in Only Fools and Horses and Goodnight Sweetheart while Imrie previously featured in dinnerladies and Calendar Girls. Dani Harmer and Ryan Sampson had appeared in various roles previously – the most notable being Harmer in The Story of Tracy Beaker – but have both gone on to more solid roles since. Harmer went on to star in her own programme called Dani's House (with the result that she was on BBC One for two half-hour programmes on Fridays) while Sampson had a leading role in two 2008 episodes of Doctor Who, as well as appearing in a pilot programme for BBC Three called The Things I Haven't Told You (which has not been picked up)."]}, {"page": "New Kid in Town (disambiguation)", "response": ["* \"New Kid in Town\", a 2010 single by Dani Harmer. "]}, {"page": "Vincent Simone", "response": ["| Dani Harmer", "| Dani Harmer", "| Dani Harmer", "| Dani Harmer", "| Dani Harmer", "| Dani Harmer", "In 2012, Simone partnered Tracy Beaker actress, Dani Harmer. They reached the final and came fourth. Cacace won the series with her partner Louis Smith.", "|Dani Harmer", "===Dani Harmer==="]}, {"page": "The Story of Tracy Beaker (TV series)", "response": ["Series 1 builds upon the characters introduced within Jacqueline Wilson's books; Tracy, (Dani Harmer), Justine (Montanna Thompson), Louise (Chelsie Padley), Peter Ingham (Joe Starrs), Elaine Boyak (Nisha Nayar), Jenny (Sharlene Whyte) and Cam (Lisa Coleman), whilst introducing other caseworkers and children who live in Stowey House. Three episodes in Series 1 form the basis of the show and make the format and atmosphere easy to understand, \"Sneaking in Ben\" shows Tracy's friendships, \"The Truth Is Revealed\" shows Tracy's way of thinking and \"Friend\" shows Tracy's way of understanding things."]}, {"page": "Montanna Thompson", "response": ["In 2002, Thompson began appearing as Justine Littlewood in the CBBC series The Story of Tracy Beaker, based on the Jacqueline Wilson book of the same name. Justine was introduced in the first episode as the arch-enemy of the title character, Tracy Beaker (Dani Harmer). In 2012, Thompson reprised her role as Justine Littlewood in Tracy Beaker Returns. Thompson reprised her role once again in the 2021 series My Mum Tracy Beaker."]}, {"page": "The Beeps", "response": ["The show features several notable actors: Timmy Mallett, Dani Harmer, Daniel Peacock, Ellie Grace, Sadie Wilson, Bob Golding, Tim Whitnall and Tom Baker as the narrator. The show's theme tune and original score are composed by Gareth Cousins. Peter Gosling provided the Beep Tree Song featured in every episode."]}, {"page": "Coming of Age (2008 TV series)", "response": ["| Dani Harmer || Chloe \"Clo\" Wheeler || Pilot || Pilot || 1", "Twenty-three episodes of Coming of Age were broadcast over the course of three series. There are number of differences between the pilot and the subsequent series. Most notably, Alex Kew and Amy Yamazaki, who played Ollie and Jas in the pilot, have been replaced by Ceri Phillips and Hannah Job. Also, Dani Harmer originally played Chloe, but was replaced by Anabel Barnston. As well as new sets, the theme tune also changed, from \"Steady, As She Goes\" by The Raconteurs to a specially written piece by Birmingham band KateGoes and Richie Webb."]}, {"page": "Redroofs Theatre School", "response": ["Former pupils include Kate Winslet, Joanne Froggatt, Kris Marshall, Dani Harmer and many other working industry performers, dance teachers, theatre producers, theatre directors, writers, stage managers, singers, dancers, stunt coordinators and actors.", "*Dani Harmer - actress"]}, {"page": "Touch Me, I'm Karen Taylor", "response": ["*Miss Harper is a divorced substitute teacher, who is desperate for sex and finds herself attracted to her male students. She finds various excuses to see their bodies by, for example, making them write lines in their underwear as punishment for wrongdoings, or by demonstrating, using the boys, inappropriate conduct in the workplace. The sketch is set in Taylor's home town, Barrow-in-Furness in the fictional Gradwell Lane Secondary School. Dani Harmer and Jamie Sweeney feature as some of her students. (Series 1 & 2)"]}, {"page": "Pasha Kovalev", "response": ["Kovalev took part in the Strictly Come Dancing Live! 2012 Tour with his celebrity partner Chelsee Healey from 20 January to 26 February, and was partnered with Series 10 finalist Dani Harmer on the 2013 Tour, starting 18 January 2013."]}, {"page": "Amy Pearson", "response": ["Also, along with Klaus Derendorf and Tom Nichols, Pearson also shares a writing credit in British singer and actress Dani Harmer's debut single \"Free\", which was released in the UK on 25 May 2009, taken from Harmer's upcoming album. The song was originally recorded by Pearson herself and was made an iTunes-only B-side of her single \"Don't Miss You\" in 2007."]}, {"page": "Jesmond", "response": ["The La Sagesse School in Jesmond (now closed and converted into housing) was used as a set for The Dumping Ground, a spin-off of the popular children's television series Tracy Beaker Returns, starring Dani Harmer."]}, {"page": "List of British former child actors", "response": ["*Dani Harmer (born 1989)"]}]}}