{"wiki_id": "http://www.wikidata.org/entity/Q4955936", "itemLabel": "Braintax", "itemDescription": "British rapper", "wikipedia_url": "https://en.wikipedia.org/wiki/Braintax", "wikipedia_page": {"main": "Joe Christie, better known as Braintax, is a British hip hop artist and producer. Christie had also recorded or appeared under the pseudonyms Brando Flux and Joey Brains. All of his releases were on his own record label, Low Life Records.\nOriginally Braintax was a duo, consisting of Christie and DJ Test, who also contributed vocals and production. Test departed following the 1997 release of the Future Years EP and Christie retained the Braintax name; it has since become synonymous with him as a solo artist. On the track \"Monsoon Funk\" on Panorama, Christie explained Braintax means \"we can all get busy if we use our brains.\" Braintax's lyrics have made multiple references to spirituality, healthy eating, the state of hip hop music, environmentalism, and politics. On Mr. Scruff's 2002 album Trouser Jazz, Braintax was featured on the song \"Vibrate\".\nIn 2008, Braintax suddenly announced his retirement with the release of his final album titled My Last And Best Album and also the end of Low Life Records.", "link_mentions": [{"page": "List of hip hop musicians", "response": ["* Braintax"]}, {"page": "2001 in music", "response": ["|Biro Funk || Braintax ||-"]}, {"page": "List of one-word stage names", "response": ["* Braintax, British hip hop artist and producer"]}, {"page": "Mr. Scruff", "response": ["Several of Mr. Scruff's records also feature guest vocalists and musicians. These include Sneaky (from Fingathing), Roots Manuva, Niko, Braintax, Alice Russell and Danny Breaks."]}, {"page": "British hip hop", "response": ["Other notable labels at the time included Liberty GroovesEar To The Ground Magazine, Issue 1 1993 in Tooting, South London. The label itself started in late 1989 with the first release in 1990 by Whirlwind D & Johnny F of Solid n Mind. Other artists included Gutter Snypes,Rap Trade Magazine, June 1994 Issue 6, Publisher: Pure Impact True Style and DJ Noize. Liberty Grooves was also a shop and many notable artists such as MC Mell O and Braintax would perform there.", "Birmingham and the West Midlands gave rise to Credit to the Nation, whose MC Fusion would espouse conscious anti-racist, sexist and homophobic lyrics. The band would also find some brief mainstream success with their indie rock crossover sound. Leeds spawned Braintax and Breaking the Illusion (who together founded Low Life Records) as well as Nightmares on Wax. Greater Manchester gave birth to the Ruthless Rap Assassins, Krispy 3 (later Krispy), the Kaliphz, Jeep Beat Collective and MC Tunes.", "A new generation of artists emerged following the turn of the century, including Jehst, Skinnyman, Nicky Spesh, Foreign Beggars and Usmaan. At the same time, a new style of electronic music emerged in the early 2000s, derivative of UK garage and jungle, with influences from dancehall, drum and bass and hip hop; this new genre was dubbed \"grime\" (sometimes called eskibeat or sublow) and effectively superseded UK hip hop in both popularity and the mainstream conscious. Grime is generally considered to be distinct from hip-hop due to its roots primarily being genres such as UK garage and jungle. In 2001, Roots Manuva claimed that British hip hop \"is more healthy\" than American hip-hop, and is more about making the music than is it about exploiting wealth or hitting it rich.Success followed The Streets' 2002 album Original Pirate Material, and he became one of the first of the new breed of British hip hop artists to gain respectable sales, though his verbal style resulted in him being shunned by many artists in the scene. Such success has caused a surge in media exposure of other British hip hop acts. Welsh rap group Goldie Lookin Chain also achieved chart success with their tongue-in-cheek take on hip-hop. Key records such as Skinnyman's Council Estate of Mind, and Klashnekoff's The Sagas Of... were released, cementing the reputations of the artists and opening up the floor for new artists to emerge. Labels Low Life Records, run by prominent political rapper Braintax, and Young N' Restless started and became the starting point for many. At the same time, just as garage was losing momentum, grime was creating interest. Wiley's Treddin' on Thin Ice was a cornerstone of the genre, and one-time friend Dizzee Rascal won a Mercury Music Prize for his debut Boy in da Corner. From then on, grime artists were the only MC's for interested record labels, and UK Hip-Hop's momentum dried up.A new generation of young socially conscious hip-hop musicians emerged as a counter to the grime scene that many in the UK Hip Hop scene perceived as commercial. These rappers strived to bring attention to both positivity and lyricism as well as the injustices of war, gentrification and racism, following in the tradition of conscious rappers such as Nas, Mos Def and Talib Kweli. Amongst this new generation included artists such as Klashnekoff, Akala, Lowkey and the Poisonous Poets."]}, {"page": "Hilltop Hoods", "response": ["On 1 April 2006, the group followed with their fourth album, The Hard Road, which peaked at number one. It was the first Australian hip hop album to do so. It was certified gold within a week of being released. Its lead single, \"Clown Prince\", reached the top 30 on the related ARIA Singles Chart. It featured guest verses from New York rapper, Omni, and British MCs, Mystro and Braintax. The Hilltop Hoods received the inaugural Australian Independent Record (AIR) Award for Independent Artist of the Year and Best Performing Independent Album for The Hard Road in 2006. The track, \"The Blue Blooded\", is a collaboration with Australian MCs: Funkoars, Hau from Koolism, Mortar, Vents, Drapht, Muph & Plutonic, Pegz and Robby Balboa. On 27 April of the same year, Hilltop Hoods performed at the Bass in the Grass music festival in Darwin alongside fellow hip hop group, The Herd. That same day they issued a second single, the title track from the album. Its video includes fellow members from the Certified Wise Crew – Cross Bred Mongrels, Terrafirma and Funkoars."]}, {"page": "Skinnyman", "response": ["*Biro Funk – Braintax, 2001"]}, {"page": "2006 in music", "response": ["* Braintax (first studio album since 2001)"]}, {"page": "Trouser Jazz", "response": ["#\"Vibrate\" (featuring Braintax)  – 3:09"]}, {"page": "Biro Funk", "response": ["Biro Funk is the debut studio album by Braintax, released on Low Life Records in 2001. By the time of the album's release, Braintax was a solo artist - Joseph Christie. Prior to the release of Biro Funk, Braintax had released a number of EPs and 12\" singles, originally as a two-piece band. The album was recorded at Christie's own Low Life Records studio in Shepherd's Bush. It features guest appearances from other stars of UK hip hop and scratches performed by DJ Harry Love of the Scratch Perverts.", "Category:Braintax albums"]}, {"page": "Low Life Records", "response": ["#REDIRECT Braintax"]}, {"page": "Jehst", "response": ["* 'Riviera Hustle' from Braintax's album Biro Funk (2001)"]}, {"page": "The Hard Road", "response": ["The Hard Road's lead single, \"Clown Prince\", reached the top 30 on the related ARIA Singles Chart. This featured guest verses from New York rapper, Omni, and British MCs, Mystro and Braintax. Hilltop Hoods received the inaugural Australian Independent Record (AIR) Award for Independent Artist of the Year and Best Performing Independent Album for The Hard Road in 2006. The track, \"The Blue Blooded\", is a collaboration with Australian MCs: Funkoars, Hau from Koolism, Mortar, Vents, Drapht, Muph & Plutonic, Pegz and Robby Balboa. On 27 April of the same year, Hilltop Hoods performed at the Bass in the Grass music festival in Darwin alongside fellow hip hop group, The Herd. That same day they issued a second single, the title track from the album. Its music video includes fellow members from the Certified Wise Crew – Cross Bred Mongrels, Terrafirma and Funkoars.", "#\"Obese Lowlifes\" featuring Mystro and Braintax - 2:24", "#*Verse 3: Braintax"]}, {"page": "Lowlife Records", "response": ["#REDIRECT Braintax"]}, {"page": "The Sun Never Sets (album)", "response": ["# \"Effortless\" (Featuring Braintax) - 4:26", "* Braintax - vocals on \"Effortless\""]}, {"page": "Task Force (band)", "response": ["Task Force's debut album, New Mic Order was produced by Mark B and features guest appearances from fellow Mud Family member Skinnyman and Mr. Thing of the Scratch Perverts. Task Force's releases have consisted for the most part of vinyl-only EPs and singles. In 2000, Task Force released Voice of the Great Outdoors, which featured Braintax and Jehst, on Braintax's Low Life Records. Task Force started their own label, Music from the Corner in 2001, and released Music from the Corner Volume 1. A darker, more intense series of predominantly self-produced albums followed. Chester P released his long-awaited solo album From the Ashes in 2008, which was largely a hit with the Task Force fan base, despite receiving a mixed review (3 out of 5) from UK hip-hop magazine Hip-Hop Connection (as Chester had previously ripped the magazine on MFTC 2). Both Farma G and Louis Slipperz contributed to the album. The first single released from the album was \"Oh No (He Loves a Ho)\" featuring Farma G. The song was more light hearted than the recent Music from the Corner series.", "*Rawdog - \"Arrest the President\" (with Braintax) (2003, Obese)", "*Braintax - Godnose (2001, Low Life Records)"]}, {"page": "Council Estate of Mind", "response": ["Skinnyman self-recorded the album, taking it to Low Life Records for a formal release. Label owner Joseph Christie, also known as Braintax, shut down the label a few years after the release of Council Estate of Mind, disappearing without compensating Skinnyman with album royalties."]}, {"page": "Panorama (Braintax album)", "response": ["Panorama is the second studio album by Braintax, released in 2006."]}, {"page": "The Travel Show", "response": ["The Travel Show is an EP by British rapper Braintax, was released through Low Life Records in 1999. The EP was never released on CD; however, it can be purchased on the Internet as a digital download in MP3 format.", "Braintax produced all songs on this EP, expect \"Go There,\" which Ben Grymm produced. Scratches on \"Go There\" are by Giacomo and scratches on \"Making Moves\" are by Lewis Parker; \"Making Moves\" also features Lewis Parker and Supa T.The Travel Show EP. Discogs. Accessed 8 July 2007. The Travel Show was the first album recorded after DJ T.E.S.T. left the Braintax duo. Joseph Christie thus became the sole member of Braintax and started using Braintax as his recording name.", "Category:Braintax albums"]}, {"page": "Joseph Christie", "response": ["#REDIRECT Braintax"]}, {"page": "Brando Flux", "response": ["#REDIRECT Braintax"]}, {"page": "Joey Brains", "response": ["#REDIRECT Braintax"]}, {"page": "Brain tax", "response": ["#REDIRECT Braintax"]}, {"page": "Hard Working / Escúchame", "response": [" #REDIRECT Braintax"]}, {"page": "Hard Working / Escuchame", "response": ["#REDIRECT Braintax"]}, {"page": "Hard Working Escúchame", "response": ["#REDIRECT Braintax"]}, {"page": "Hard Working Escuchame", "response": ["#REDIRECT Braintax"]}, {"page": "Hard Working", "response": ["#REDIRECT Braintax"]}, {"page": "Escúchame", "response": ["#REDIRECT Braintax"]}, {"page": "Escuchame", "response": ["*Hard Working / Escúchame, 2000 EP by Braintax"]}, {"page": "Badmeaningood Vol.2", "response": ["# Braintax feat. Task Force - \"Godnose\" – 3:59"]}, {"page": "Dubbledge", "response": ["He has appeared on releases by UK hip hop artists including Foreign Beggars, Micall Parknsun, Braintax, and Jehst"]}, {"page": "Hydrofunk Records", "response": ["In 1997 Hydrofunk released its first L.P. with Blunted Stylus's self-titled record. One year later Hydrofunk released Resin Dogs' Grinnin' which received significant airplay on both local and national radio, followed by the Volcanic Lab EP in 1998 which gained the band momentum with touring nationally. This success enabled Hydrofunk Records to secure a label distribution deal with Virgin/EMI in 1999. In 2002, Hydrofunk Records licensed its first overseas label, London's underground hip hop label, Low Life Records with artists like Rodney P, Braintax and Jehst."]}, {"page": "2008 in hip hop music", "response": ["| style=\"text-align:center;\"|Braintax"]}]}}