{"wiki_id": "http://www.wikidata.org/entity/Q4960868", "itemLabel": "Brendan Donnelly", "itemDescription": "British politician (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brendan_Donnelly_(politician)", "wikipedia_page": {"main": "Brendan Patrick Donnelly (born 25 August 1950) is a pro-European Union British politician.\nBorn in London, Donnelly was educated at St Ignatius' College in Tottenham, and then at Christ Church, Oxford.  He worked at the Foreign Office from 1976 until 1982, when he joined the secretariat of the Conservative Group in the European Parliament.  From 1986 to 1987, he was a political adviser to Lord Cockfield, and then from 1987 to 1990 worked as an independent consultant on the European Community.  At the 1989 European Parliament election, he stood unsuccessfully for the Conservatives in London West.Donnelly was elected as a Member of the European Parliament (MEP) in Sussex South and Crawley at the 1994 European Parliament election for the Conservative Party.  He then left the party, continued as an independent for a period, and then co-founded and became deputy leader of the Pro-Euro Conservative Party at the 1999 European elections.He failed to get elected and subsequently joined the Liberal Democrats. He stood in the 2009 European elections under the Yes2Europe political label. He stood in the 2014 European elections for the 4 Freedoms Party (UK EPP). He stood in the 2021 London Assembly election for Rejoin EU. He was unsuccessful in each case. He stood for Rejoin EU in the June 2021 Chesham and Amersham by-election.Donnelly is director of the Federal Trust and, until 6 March 2010, was chair of the Federal Union, when he was succeeded by Richard Laming.", "link_mentions": [{"page": "Pro-Euro Conservative Party", "response": ["The Pro-Euro Conservative Party was a British political party announced by John Stevens and Brendan Donnelly in February 1999, formed to contest the 1999 European Parliament election. The founders were Members of the European Parliament who had resigned from the UK Conservative Party in protest at its anti-euro stance. Their reported aim was to replace Eurosceptic William Hague as Conservative leader with Europhile Kenneth Clarke. Stevens later said that they had intended to push Ken Clarke, Michael Heseltine, Chris Patten and other pro-Europeans in the Conservative Party into \"an SDP-style breakaway, in combination with the Liberal Democrats\". The Pro-Euro Conservative Party disbanded in 2001."]}, {"page": "List of political parties in the United Kingdom", "response": ["| John Stevens Brendan Donnelly"]}, {"page": "List of members of the European Parliament (1994–1999)", "response": ["*Brendan Donnelly"]}, {"page": "1999 European Parliament election in the United Kingdom", "response": ["*Brendan Donnelly, former Conservative MEP (West Midlands)"]}, {"page": "List of members of the European Parliament for the United Kingdom (1994–1999)", "response": ["|Brendan Donnelly", "* Brendan Donnelly and John Stevens resigned from the Conservative Party in January 1999 and subsequently established the Pro-Euro Conservative Party."]}, {"page": "South East England (European Parliament constituency)", "response": ["| Brendan DonnellyConservative (1994 – 1999)Joined the Pro-Euro Conservatives in March 1999Pro-Euro Conservative (1999)"]}, {"page": "List of political parties in the United Kingdom by representation", "response": ["|Brendan Donnelly; John Stevens"]}, {"page": "John Stevens (English politician)", "response": ["He was the Conservative Member of the European Parliament (MEP) for Thames Valley from 1989 to 1999, before leaving the party in protest over its increasingly Eurosceptic positioning.  He then co-founded, along with Brendan Donnelly, the Pro-Euro Conservative Party (PECP) in that year. He contested the 1999 Kensington and Chelsea by-election for the PECP and came fourth."]}, {"page": "Yes2Europe", "response": ["#REDIRECT Brendan Donnelly (politician)"]}, {"page": "Brendan Patrick Donnelly", "response": ["#REDIRECT Brendan Donnelly (politician)"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Brendan Donnelly"]}, {"page": "Donnelly (surname)", "response": ["* Brendan Donnelly (born 1950), British politician", "* Brendan Donnelly (born 1971), baseball player"]}, {"page": "Brendan Donnelly MEP", "response": ["#REDIRECT Brendan Donnelly (politician)"]}, {"page": "2021 Chesham and Amersham by-election", "response": ["*Rejoin EU – Brendan Donnelly, a former Conservative Member of European Parliament."]}]}}