{"wiki_id": "http://www.wikidata.org/entity/Q49615", "itemLabel": "Rowan Williams", "itemDescription": "Archbishop of Canterbury (2002–2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rowan_Williams", "wikipedia_page": {"main": "Rowan Douglas Williams, Baron Williams of Oystermouth,  (born 14 June 1950) is a Welsh Anglican bishop, theologian and poet.  He was the 104th Archbishop of Canterbury, a position he held from December 2002 to December 2012. Previously the Bishop of Monmouth and Archbishop of Wales, Williams was the first Archbishop of Canterbury in modern times not to be appointed from within the Church of England.\nWilliams's primacy was marked by speculation that the Anglican Communion (in which the Archbishop of Canterbury is the leading figure) was on the verge of fragmentation over disagreements on contemporary issues such as homosexuality and the ordination of women. Williams worked to keep all sides talking to one another. Notable events during his time as Archbishop of Canterbury include the rejection by a majority of dioceses of his proposed Anglican Covenant and, in the final general synod of his tenure, his unsuccessful attempt to secure a sufficient majority for a measure to allow the appointment of women as bishops in the Church of England.\nHaving spent much of his earlier career as an academic at the universities of Cambridge and Oxford successively, Williams speaks three languages and reads at least nine.  After standing down as archbishop, Williams took up the position of chancellor of the University of South Wales in 2014 and served as  master of Magdalene College, Cambridge between 2013 and 2020. He also delivered the Gifford Lectures at the University of Edinburgh in 2013.\nJustin Welby succeeded Williams as the Archbishop of Canterbury on 9 November 2012, being enthroned in March 2013. On 26 December 2012, 10 Downing St announced Williams's elevation to the peerage as a life peer, so that he could continue to speak in the Upper House of Parliament. Following the creation of his title on 8 January and its gazetting on 11 January 2013, he was introduced to the temporal benches of the House of Lords as Baron Williams of Oystermouth on 15 January 2013, sitting as a crossbencher. He retired from the House on 31 August 2020 and from Magdalene College that Michaelmas, returning to Abergavenny, in his former diocese (Monmouthshire).", "link_mentions": [{"page": "Anglican Communion", "response": ["The Primates' Meeting voted to request the two churches to withdraw their delegates from the 2005 meeting of the Anglican Consultative Council. Canada and the United States decided to attend the meeting but without exercising their right to vote. They have not been expelled or suspended, since there is no mechanism in this voluntary association to suspend or expel an independent province of the communion. Since membership is based on a province's communion with Canterbury, expulsion would require the Archbishop of Canterbury's refusal to be in communion with the affected jurisdictions. In line with the suggestion of the Windsor Report, Rowan Williams (the then Archbishop of Canterbury) established a working group to examine the feasibility of an Anglican covenant which would articulate the conditions for communion in some fashion."]}, {"page": "Anglicanism", "response": ["The Archbishop of Canterbury has a precedence of honour over the other primates of the Anglican Communion, and for a province to be considered a part of the communion means specifically to be in full communion with the see of Canterbury – though this principle is currently subject to considerable debate, especially among those in the so-called Global South, including American Anglicans. The archbishop is, therefore, recognised as primus inter pares (\"first amongst equals\"), even though he does not exercise any direct authority in any province outside England, of which he is chief primate. Rowan Williams, the Archbishop of Canterbury from 2002 to 2012, was the first archbishop appointed from outside the Church of England since the Reformation: he was formerly the Archbishop of Wales."]}, {"page": "Alcuin", "response": ["The interpretation of homosexual desire has been disputed by Allen Frantzen, who identifies Alcuin's language with that of medieval Christian amicitia or friendship. Douglas Dales and Rowan Williams say \"the use of language drawn [by Alcuin] from the Song of Songs transforms apparently erotic language into something within Christian friendship – 'an ordained affection."]}, {"page": "Archbishop of Canterbury", "response": ["The Archbishop of Canterbury is the senior bishop and principal leader of the Church of England, the symbolic head of the worldwide Anglican Communion and the diocesan bishop of the Diocese of Canterbury. The current archbishop is Justin Welby, who was enthroned at Canterbury Cathedral on 21 March 2013. Welby is the 105th in a line which goes back more than 1400 years to Augustine of Canterbury, the \"Apostle to the English\", sent from Rome in the year 597. Welby succeeded Rowan Williams.", "The current archbishop, Justin Welby, the 105th Archbishop of Canterbury, was enthroned at Canterbury Cathedral on 4 February 2013. As archbishop he signs himself as + Justin Cantuar. His predecessor, Rowan Williams, 104th Archbishop of Canterbury, was enthroned at Canterbury Cathedral on 27 February 2003. Immediately prior to his appointment to Canterbury, Williams was the bishop of Monmouth and archbishop of Wales. On 18 March 2012, Williams announced he would be stepping down as archbishop of Canterbury at the end of 2012 to become master of Magdalene College, Cambridge.", "The archbishop is also a president of Churches Together in England (an ecumenical organisation). Geoffrey Fisher, 99th Archbishop of Canterbury, was the first since 1397 to visit Rome, where he held private talks with Pope John XXIII in 1960. In 2005, Rowan Williams became the first archbishop of Canterbury to attend a papal funeral since the Reformation. He also attended the inauguration of Pope Benedict XVI. The 101st archbishop, Donald Coggan, was the first to attend a papal inauguration, that of Pope John Paul II in 1978.", "* 2002–2012: Rowan Williams", "| Rowan Williams"]}, {"page": "Creationism", "response": ["* consider that there is no conflict between the spiritual meaning of creation and the science of evolution. According to the former archbishop of Canterbury, Rowan Williams, \"...for most of the history of Christianity, and I think this is fair enough, most of the history of the Christianity there's been an awareness that a belief that everything depends on the creative act of God, is quite compatible with a degree of uncertainty or latitude about how precisely that unfolds in creative time.\"", "In the UK, a 2006 poll on the \"origin and development of life\", asked participants to choose between three different perspectives on the origin of life: 22% chose creationism, 17% opted for intelligent design, 48% selected evolutionary theory, and the rest did not know. A subsequent 2010 YouGov poll on the correct explanation for the origin of humans found that 9% opted for creationism, 12% intelligent design, 65% evolutionary theory and 13% didn't know. The former Archbishop of Canterbury Rowan Williams, head of the worldwide Anglican Communion, views the idea of teaching creationism in schools as a mistake. In 2009, an Ipsos Mori survey in the United Kingdom found that 54% of Britons agreed with the view: \"Evolutionary theories should be taught in science lessons in schools together with other possible perspectives, such as intelligent design and creationism.\"", "Other Christians have expressed qualms about teaching creationism. In March 2006, then Archbishop of Canterbury Rowan Williams, the leader of the world's Anglicans, stated his discomfort about teaching creationism, saying that creationism was \"a kind of category mistake, as if the Bible were a theory like other theories.\" He also said: \"My worry is creationism can end up reducing the doctrine of creation rather than enhancing it.\" The views of the Episcopal Churcha major American-based branch of the Anglican Communionon teaching creationism resemble those of Williams."]}, {"page": "C. S. Lewis", "response": ["Lewis continues to attract a wide readership. In 2008, The Times ranked him eleventh on their list of \"the 50 greatest British writers since 1945\". Readers of his fiction are often unaware of what Lewis considered the Christian themes of his works. His Christian apologetics are read and quoted by members of many Christian denominations. In 2013, on the 50th anniversary of his death, Lewis joined some of Britain's greatest writers recognised at Poets' Corner, Westminster Abbey. The dedication service, at noon on 22 November 2013, included a reading from The Last Battle by Douglas Gresham, younger stepson of Lewis. Flowers were laid by Walter Hooper, trustee and literary advisor to the Lewis Estate. An address was delivered by former Archbishop of Canterbury Rowan Williams. The floor stone inscription is a quotation from an address by Lewis:"]}, {"page": "Church of England", "response": ["Under the guidance of Rowan Williams and with significant pressure from clergy union representatives, the ecclesiastical penalty for convicted felons to be defrocked was set aside from the Clergy Discipline Measure 2003. The clergy union argued that the penalty was unfair to victims of hypothetical miscarriages of criminal justice, because the ecclesiastical penalty is considered irreversible. Although clerics can still be banned for life from ministry, they remain ordained as priests."]}, {"page": "List of English-language poets", "response": ["*Rowan Williams (born 1950, W/E)"]}, {"page": "Filioque", "response": ["In 1994, the General Convention of the Episcopal Church (US) resolved that the Filioque should be deleted from the Nicene Creed in the next edition of the Prayer Book. The enthronement ceremonies of three recent archbishops of Canterbury (Robert Runcie, George Carey, Rowan Williams) included recitations of the Nicene Creed that omitted the Filioque; this has been considered to have been \"a gesture of friendship toward Orthodox guests and their Communions\". Note: Published before Justin Welby's enthronement"]}, {"page": "Freemasonry", "response": ["Since the founding of Freemasonry, many Bishops of the Church of England have been Freemasons, such as Archbishop Geoffrey Fisher. In the past, few members of the Church of England would have seen any incongruity in concurrently adhering to Anglican Christianity and practising Freemasonry. In recent decades, however, reservations about Freemasonry have increased within Anglicanism, perhaps due to the increasing prominence of the evangelical wing of the church. The former archbishop of Canterbury, Dr Rowan Williams, appeared to harbour some reservations about Masonic ritual, whilst being anxious to avoid causing offence to Freemasons inside and outside the Church of England. In 2003 he felt it necessary to apologise to British Freemasons after he said that their beliefs were incompatible with Christianity and that he had barred the appointment of Freemasons to senior posts in his diocese when he was Bishop of Monmouth."]}, {"page": "House of Lords", "response": ["By custom at least one of the archbishops or bishops reads prayers in each legislative day (a role taken by the chaplain in the Commons). They often speak in debates; in 2004 Rowan Williams, the Archbishop of Canterbury, opened a debate into sentencing legislation. Measures (proposed laws of the Church of England) must be put before the Lords, and the Lords Spiritual have a role in ensuring that this takes place."]}, {"page": "June 14", "response": ["*1950 – Rowan Williams, Welsh archbishop and theologian"]}, {"page": "Lord's Prayer", "response": ["Former archbishop of Canterbury Rowan Williams explains this phrase as a petition that people may look upon God's name as holy, as something that inspires awe and reverence, and that they may not trivialize it by making God a tool for their purposes, to \"put other people down, or as a sort of magic to make themselves feel safe\". He sums up the meaning of the phrase by saying: \"Understand what you're talking about when you're talking about God, this is serious, this is the most wonderful and frightening reality that we could imagine, more wonderful and frightening than we can imagine.\""]}, {"page": "Origen", "response": ["In other passages, Origen rejected the belief that the Son and the Father were one hypostasis as heretical. According to Rowan Williams, because the words ousia and hypostasis were used synonymously in Origen's time, Origen almost certainly would have rejected homoousios, as a description for the relationship between the Father and the Son, as heretical. "]}, {"page": "Pacifism", "response": ["The Peace Pledge Union is a pacifist organisation from which the Anglican Pacifist Fellowship (APF) later emerged within the Anglican Church. The APF succeeded in gaining ratification of the pacifist position at two successive Lambeth Conferences, but many Anglicans would not regard themselves as pacifists. South African Bishop Desmond Tutu is the most prominent Anglican pacifist. Rowan Williams led an almost united Anglican Church in Britain in opposition to the 2003 Iraq War.  In Australia Peter Carnley similarly led a front of bishops opposed to the Government of Australia's involvement in the invasion of Iraq."]}, {"page": "Received Pronunciation", "response": ["* Rowan Williams, former archbishop of Canterbury (2002–2012)"]}, {"page": "Sharia", "response": ["In 2008, Rowan Williams, the Archbishop of Canterbury, has suggested that Islamic and Orthodox Jewish courts should be integrated into the British legal system alongside ecclesiastical courts to handle marriage and divorce, subject to agreement of all parties and strict requirements for protection of equal rights for women. His reference to the sharia sparked a controversy. Later that year, Nicholas Phillips, then Lord Chief Justice of England and Wales, stated that there was \"no reason why sharia principles [...] should not be the basis for mediation or other forms of alternative dispute resolution.\" A 2008 YouGov poll in the United Kingdom found 40% of Muslim students interviewed supported the introduction of sharia into British law for Muslims.Killing for religion is justified, say third of Muslim students  The Telegraph (26 July 2008) Michael Broyde, professor of law at Emory University specializing in alternative dispute resolution and Jewish law, has argued that sharia courts can be integrated into the American religious arbitration system, provided that they adopt appropriate institutional requirements as American rabbinical courts have done."]}, {"page": "University of Oxford", "response": ["Oxford has also produced at least 12 saints, 19 English cardinals, and 20 Archbishops of Canterbury, the most recent Archbishop being Rowan Williams, who studied at Wadham College and was later a Canon Professor at Christ Church. Duns Scotus' teaching is commemorated with a monument in the University Church of St. Mary. Religious reformer John Wycliffe was an Oxford scholar, for a time Master of Balliol College. John Colet, Christian humanist, Dean of St Paul's, and friend of Erasmus, studied at Magdalen College. Several of the Caroline Divines e.g. in particular William Laud as President of St. John's and Chancellor of the university, and the Non-Jurors, e.g. Thomas Ken had close Oxford connections. The founder of Methodism, John Wesley, studied at Christ Church and was elected a fellow of Lincoln College. Britain's first woman to be an ordained minister, Constance Coltman, studied at Somerville College. The Oxford Movement (1833–1846) was closely associated with the Oriel fellows John Henry Newman, Edward Bouverie Pusey and John Keble. Other religious figures were Mirza Nasir Ahmad, the third Caliph of the Ahmadiyya Muslim Community, Shoghi Effendi, one of the appointed leaders of the Baháʼí Faith, and Joseph Cordeiro, the first Pakistani Catholic cardinal."]}, {"page": "Christ's College, Cambridge", "response": ["Some of the college's other famous alumni include former archbishop of Canterbury Rowan Williams, theologian William Paley, historian Simon Schama, South African Prime Minister Jan Smuts, Lord Louis Mountbatten of Burma, medical doctor, scientist, and diplomat Davidson Nicol, and comedians John Oliver, Sacha Baron Cohen, and Andy Parsons.", "File:Rowan Williams 2007.jpg|Rowan Williams", "|Rowan Williams"]}, {"page": "Cohabitation", "response": ["During the past decades, in Western countries, there has been an increase in unmarried couples cohabiting. Historically, many Western countries have been influenced by Christian doctrines on sex, which opposes unmarried cohabitation. As social norms have changed, such beliefs have become less widely held by the population and some Christian denominations today view cohabitation as a precursor to marriage. Pope Francis has married a cohabiting couple who had children, while former Archbishop of Canterbury Rowan Williams and the Archbishop of York John Sentamu have expressed tolerance of cohabitation."]}, {"page": "Cambridge", "response": ["From the 1930s to the 1980s, the size of the city was increased by several large council estates. The biggest impact has been on the area north of the river, which are now the estates of East Chesterton, King's Hedges, and Arbury where Archbishop Rowan Williams lived and worked as an assistant priest in the early 1980s."]}, {"page": "Philip Pullman", "response": ["Pullman has found support from some Christians, most notably Rowan Williams, the former Archbishop of Canterbury, who argued that Pullman's attacks focus on the constraints and dangers of dogmatism and the use of religion to oppress, not on Christianity itself. Williams recommended His Dark Materials for discussion in Religious Education classes, and said that \"to see large school-parties in the audience of the Pullman plays at the National Theatre is vastly encouraging\". Pullman and Williams took part in a National Theatre platform debate a few days later to discuss myth, religious experience and its representation in the arts."]}, {"page": "His Dark Materials", "response": ["Pullman found support from some other Christians, most notably from Rowan Williams, the former archbishop of Canterbury (spiritual head of the Anglican Communion), who argued that Pullman's attacks focus on the constraints and dangers of dogmatism and the use of religion to oppress, not on Christianity itself."]}, {"page": "Arthur Machen", "response": ["In music, the composer John Ireland found Machen's works to be a life-changing experience that directly influenced much of his composition. Mark E. Smith of The Fall also found Machen an inspiration. Likewise, Current 93 have drawn on the mystical and occult leanings of Machen, with songs such as \"The Inmost Light\", which shares its title with Machen's story. Some artists on the Ghost Box Music label like Belbury Poly and The Focus Group draw heavily on Machen. It is an interest also shared by film directors like Mexican Rogelio A. González who made a successful version of \"The Islington Mystery\" as El Esqueleto de la señora Morales (1960), adapted by Luis Alcoriza, a frequent collaborator in Luis Buñuel's classic films. This interest in Machen's works among filmmakers is also shared by Guillermo del Toro and Richard Stanley. Other notable figures with an enthusiasm for Machen have included Brocard Sewell, Barry Humphries, Stewart Lee and Rowan Williams, Archbishop of Canterbury."]}, {"page": "Pope Benedict XVI", "response": ["Also in 2006, Benedict met Rowan Williams, Archbishop of Canterbury and spiritual head of the Anglican Communion. In their Common Declaration, they highlighted the previous 40 years of dialogue between Catholics and Anglicans while also acknowledging \"serious obstacles to our ecumenical progress\". Benedict also acknowledged the Lutheran church, saying that he has had friends in that denomination."]}, {"page": "Swansea", "response": ["Rowan Williams, Archbishop of Canterbury, was born in Swansea. He was educated at the state-sector Dynevor School, Swansea before reading theology at Christ's College, Cambridge. Catherine Zeta-Jones was born and raised in Swansea and still owns a home in Mumbles. Swansea is the home town of Non Stanford, the 2013 ITU Triathlon World Champion.Non Stanford The thriller writer, Mark Ellis was educated in Swansea.", "* Rt Hon Rowan Williams : 31 July 2010."]}, {"page": "List of Welsh people", "response": ["*Rowan Williams (born 1950), Archbishop of Canterbury from 2003 to 2012"]}, {"page": "Canterbury", "response": ["In November 2012, Rowan Williams was awarded Freedom of the City for his work as Archbishop of Canterbury between 2003 and 2012."]}, {"page": "Bartholomew I of Constantinople", "response": ["In April 2008, he was included on the Time 100 most influential people in the world list.Bartholomew I  by Archbishop Rowan Williams Time Retrieved on 1 May 2008 On 13 March 2007, the third anniversary of the death of Cardinal Franz König, Bartholomew was awarded in Vienna's St. Stephen Cathedral the \"Cardinal König Prize\" from the Foundation \"Communio et Progressio\"."]}, {"page": "London School of Economics", "response": ["Recent prominent speakers have included Kofi Annan, Ben Bernanke, Tony Blair, Gordon Brown, David Cameron, Noam Chomsky, Bill Clinton, Philip Craven, Niall Ferguson, Vicente Fox, Milton Friedman, Muammar Gaddafi, Julia Gillard, Alan Greenspan, Tenzin Gyatso, Lee Hsien Loong, Boris Johnson, David Harvey, Jean Tirole, Angelina Jolie, Paul Krugman, Dmitri Medvedev, Mario Monti, George Osborne, Robert Peston, Sebastián Piñera, Kevin Rudd, Jeffrey Sachs, Gerhard Schroeder, Carlos D. Mesa, Luiz Inácio Lula da Silva, Aung San Suu Kyi, Amartya Sen, George Soros and Rowan Williams.  Previously, the school has hosted figures including Nelson Mandela and Margaret Thatcher."]}]}}