{"wiki_id": "http://www.wikidata.org/entity/Q4963595", "itemLabel": "Brian Dougans", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Dougans", "wikipedia_page": {"main": "Brian Dougans (born 1968) is a British musician, and a member of the British electronic duo, the Future Sound of London (FSOL).\nHe is the more technical member of FSOL, doing most of the programming, circuit bending et cetera and creating electronic instruments at his home studio in Glastonbury, Somerset. He is currently head of FSOLdigital (FSOL's record label) and co designer of the FSOL:Digitana SX-1 Synthesiser. \nDougans' first releases were as \"Humanoid\", releasing the acid house single \"Stakker Humanoid\", which reached number 17 in the UK Singles Chart in 1988, and also charted in 1992 and 2001. \"Stakker Humanoid\" was No.1 for five weeks in the UK Dance Chart (December 1988) and has been cited as a major influence on early Aphex Twin releases. Dougans music as Humanoid is also part of the MOMA NY collection via Stakker Eurotechno. Dougans has always been the quiet, technical workhorse of FSOL whilst Garry Cobain brings in his melody and softness to balance Dougans' technical wizardry.", "link_mentions": [{"page": "Rave", "response": ["* Acid house and Acid techno – 808 State, Guru Josh, Brian Dougans, The KLF, Josh Wink, Michele Sainte, Phuture, Luke Vibert, Acidwolf, Lone"]}, {"page": "Rephlex Records", "response": ["*Brian Dougans"]}, {"page": "The Future Sound of London", "response": ["The Future Sound of London (often abbreviated to FSOL) is a British electronic music group composed of Garry Cobain and Brian Dougans. Described as a \"boundary-pushing\" electronic act by AllMusic, their work covers many areas of electronic music, such as techno, ambient, house music, trip hop, psychedelia, and dub.", "Garry Cobain and Brian Dougans met in the mid-1980s while studying electronics at university in Manchester, England. Dougans had already been making electronic music for some time, working between Glasgow and Manchester, when the pair first began working together in various local clubs. In 1988, Dougans embarked on a project for the Stakker graphics company. The result was Stakker Humanoid, a single that went on to reach number 17 in the UK charts, becoming the first credible UK acid house tune to cross over into the mainstream. Cobain contributed to the accompanying album. A video was also produced."]}, {"page": "Bruno Brookes", "response": ["Brookes was also an early supporter of the fledgling acid house scene by championing Stakker Humanoid, a November 1988 hit for Humanoid (AKA Brian Dougans). In a 2013 interview with The Guardian, Brookes explained that he was given a white label of the record and immediately fell under its spell. \"It just got to me. I remember listening to it and thinking it was one step ahead of everything techno that was coming out. It wasn't copying anything else; it was just fabulous.\" As a result, he played the record twice in one show – a very unusual step for a prime-time radio DJ."]}, {"page": "The Hitman and Her", "response": ["The show acted as both an outlet to showcase artists from the PWL stable – such as Kylie Minogue, 2 Unlimited, Anticapella, and Opus III, as well as featuring the key club tunes from the day – largely as a result of Waterman's interest in the fledgling acid house scene. Speaking to The Guardian in November 2013, Waterman explained \"I loved acid house and trance. I just absolutely adored it.\" One track the show championed in particular was \"Stakker Humanoid\" by Brian Dougans, which Waterman described as \"a Hitman and Her tune\"."]}, {"page": "Accelerator (The Future Sound of London album)", "response": ["* The original 1991 release also included the following credits: production on \"Expander\" by Mental Cube, production on \"Stolen Documents\" by Luco, and writing on \"Calcium\" by Yage. These three credits were removed for the 2001 release, which simply states: \"All titles written by Brian Dougans / Garry Cobain. Produced and mixed by The Future Sound of London.\""]}, {"page": "Slavestate", "response": ["With Slavestate, Godflesh sought to diversify their metal-dominated sound by introducing elements of dance music and electronic body music. Still, the music retained the harsh guitar and vocals of frontman Justin Broadrick, as well as the extreme aspects of Godflesh. Ira A. Robbins of Trouser Press wrote, \"The four-song Slavestate EP finds the band charging full-on into an industrial-dance realm, giving Streetcleaner's lurch-and-crunch the twist of a rhythmic basis.\" The EP's title track contains a sample of the song \"Stakker Humanoid\" by Brian Dougans."]}, {"page": "Papua New Guinea (song)", "response": ["This led Cobain going to the University of Manchester Institute of Science and Technology. At the school  he met Brian Dougans who was studying sound recording and was also a fan of Factory Records bands like A Certain Ratio.  Cobain described Dougans as \"I was well envious of Brian, and he was also a couple of years older, which seemed to be very significant when I was in my late teens. He was very much a guiding force, and he was also extremely charismatic.\" "]}, {"page": "Teachings from the Electronic Brain", "response": ["*Written by – Brian Dougans, Elizabeth Fraser (tracks: 7), Garry Cobain"]}, {"page": "Garry Cobain", "response": ["Cobain was born on 16 May 1967 in Bedford. He left Bedford for Manchester in his late teens to study at a time when alternative music in that part of Britain was taking off; the dance music scene in particular was becoming more and more popular, not just in Manchester but all over the country and in the States too. Cobain, drawn to the city by bands like The Chameleons and The Smiths, embraced this atmosphere and joined a band he had seen rehearsing in a studio and stayed with them for a year; after his spell with that band he met Brian Dougans."]}, {"page": "Alice in Ultraland", "response": ["All tracks by Garry Cobain and Brian Dougans"]}, {"page": "Humanoid (disambiguation)", "response": ["* Humanoid (band), the name used for early releases by Brian Dougans"]}, {"page": "Stakker Humanoid", "response": ["The project behind the track started out with Stakker, a collaborative project by the video artists Mark McClean and Colin Scott. They needed music to support their video and contacted Brian Dougans. ", "They sent a demo video tape containing graphics and some music to Morgan Khan who (although he didn't appreciate the video) invited Brian Dougans to record two demos at his Dance Studios in Ealing London. The sample \"Humanoid\", taken from the video game Berzerk, provided the name of the track.", "The track was originally called \"Humanoid\" to be put out by Stakker through Morgan Khan's label Westside Records, though Morgan released it as \"Stakker Humanoid\" by 'Humanoid' to avoid copyright issues. A dispute had arisen between Brian Dougans and Colin Scott / Mark McClean and before the record was in the shops, Stakker and Brian Dougans split, ending their working relationship which had lasted just over a year. However, McClean and Dougans were to continue working together on the Future Sound of London project.", "* Composed by Brian Dougans", "* Produced and mixed by Brian Dougans, John Laker"]}, {"page": "Peelennium", "response": ["| Brian Dougans"]}, {"page": "Graham Massey", "response": ["Massey released the solo album Subtracks under the name Massonix on Skam Records.  He has side projects with 'Toolshed' and 'Sisters of Transistors', and remixed Brian Dougans's (of The Future Sound of London) track \"Stakker Humanoid\" for the remix album, \"Your Body Sub Atomic\". He has also remixed FSOL before on \"Papua New Guinea\"."]}, {"page": "Environments (album)", "response": ["Originally planned for release in 1994 under the Amorphous Androgynous alias, it was scrapped, despite being given a catalogue number for its US release and being announced in the liner notes of Lifeforms.Environments CD release out on 21 July! Some of the material featured on live shows, the ISDN album, and the From The Archives series. In 2007, Brian Dougans reconstructed the album from archived material. Contained within the record are samples and elements from released tracks such as \"Tired\", \"Wookii\", \"Cascade Part 1\", \"Life Form Ends\" and \"Ill Flower\". Further Environments records - volumes II & III - are planned for digital release in 2008.", "*Written, performed and produced by Brian Dougans and Garry Cobain"]}, {"page": "The San Monta Tapes", "response": ["Brian Dougans, Garry Cobain."]}, {"page": "Hand-Made Devices", "response": ["Hand-Made Devices is an album by The Future Sound of London under the alias Polemical; it is the first album under the pseudonym. The nature of the music is very experimental and is created almost entirely using Brian Dougans' electronic creations, including glitch devices and the like. There are videos on Dougans own YouTube channel (\"STAKKERHUMANOID\") demonstrating the devices he has made. The website FSOLDigital.com says that all the devices used were modified by the band. The album is available only at their digital download site.", "*Produced by Brian Dougans"]}, {"page": "4 Forests", "response": ["4 Forests is another experimental album by Brian Dougans under the alias Part-Sub-Merged from 2007 which was released on The Future Sound of London's digital download website. It is the soundtrack to a short film made by the duo called \"Part-Sub-Merged\" to be released on FSOLdigital.com at some point in the near future. The music is darker than his \"Polemical \" work with analogue techno beats and synth ambience.", "Composed, produced by Brian Dougans"]}, {"page": "Global (Humanoid album)", "response": ["Global is the debut album by Brian Dougans, most famous for being part of the British electronica group The Future Sound of London. Unlike FSOL's ambient, breakbeat and trip hop styles, it is composed largely of US style vocal house, including Ben Ofoedu, most famous for his work with duo Phats & Small in the 1990s. Also contained is the breakthrough acid house single, \"Stakker Humanoid\", and industrial track \"Sunshine & Brick\", featuring FSOL's Gaz Cobain on vocals.", "*Written by Brian Dougans", "*Produced by Brian Dougans & John Laker", "*Mixed by Brian Dougans & John Laker"]}, {"page": "Eurotechno", "response": ["Eurotechno refers to the musical soundtrack by English group Stakker for their 1989 experimental short film of the same name. The original film was an avant-garde experiment in the audiovisual videola genre and features rapidly shifting colourful computer graphics, reflecting the influence of rave culture. Although the visuals of the film were primarily the work of Stakker members Marek Pytel, Mark McClean and Colin Scott, the musical soundtrack was largely the work of Brian Dougans, later of The Future Sound of London. The 25-minute soundtrack was recorded using a Roland TB-303, and reflects the fast-shifting momentum of the film by incorporating fragmented elements of acid house, Chicago house and Detroit techno that shift after their brief appearances, thus contributing to an intricately layered style.", "The film was released by Virgin Video Music in 1989 and became influential on other film-makers, although the soundtrack itself did not initially receive its own release. Over the years, the music proved influential on other producers, including Squarepusher and Aphex Twin. The latter released the soundtrack on CD and vinyl for the first time in January 2003 on his Rephlex label, which had been inspired by the music. The album received positive reviews for its early acid techno sound and was hailed as innovative.  It was followed by another release of early Brian Dougans music, Sessions 84-88, later that year.", "The music and sound for Eurotechno was credited to Brian Dougans, McClean and Scott, with Dougans responsible for performing the music. He found a Roland TB-303 – a synthesiser pivotal to acid house music – in the basement of his college, and proceeded to feature it heavily in the production of the film's soundtrack. With its origins in the early days of Madchester, it was one of the producer's earliest projects. Dougan's 1988 acid house hit \"Stakker Humanoid\", regarded as one of the earliest examples of acid house to break into the mainstream, also originated from the producer's work with Stakker, and was described as a companion project. Released on VHS by Virgin Video Music in 1989, Eurotechno went on to become a \"dance-culture classic\" and a pioneering video for \"bedroom digital production,\" even influencing a television advertisement for Pot Noodle. The advertisement, which aired in 1992, was controversial for inducing seizures on several viewers.", "All music written by Brian Dougans, Mark McClean and Colin Scott", "* Music composed by Brian Dougans, Mark McClean and Colin Scott."]}, {"page": "Sessions 84–88", "response": ["Sessions 84–88 is a compilation album released in 2003 alongside Eurotechno on the Rephlex label. Brian Dougans, under the alias Humanoid; it is mostly experimental in nature and similar to the Stakker Humanoid release from Dougans also; Sessions also includes a remix of that track.", "* Composed by Brian Dougans", "* Produced by Brian Dougans (tracks: 1 to 15, 18) as Zeebox (tracks: 16, 17, 19 to 23)"]}, {"page": "Slam (Humanoid song)", "response": ["\"Slam\" was the second single released by Brian Dougans under his moniker \"Humanoid\", in 1989, and featured on the Global album. The track itself was the only other acid house single of the era, after Stakker Humanoid, with the following singles released from the album being more vocal led.  The track itself features female and male vocals, the former sung and the latter in the form of an MC, distancing itself from the previous single.", "*Composed and Produced by Brian Dougans"]}, {"page": "Tonight (Humanoid song)", "response": ["#REDIRECT Brian Dougans"]}, {"page": "You Took My Love", "response": ["*Composed By - Brian Dougans, Garry Cobain"]}, {"page": "The Pulse EP", "response": ["Written By Brian Dougans, Garry Cobain"]}]}}