{"wiki_id": "http://www.wikidata.org/entity/Q4965350", "itemLabel": "Brian Souter", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Souter", "wikipedia_page": {"main": "Sir Brian Souter (born 5 May 1954) is a Scottish businessman. With his sister, Ann Gloag, he founded the Stagecoach Group of bus and rail operators. He also founded the bus and coach operator Megabus, the train operating company South West Trains, his investments company Souter Holdings Ltd, and the Souter Charitable Trust.\nSouter has been politically active in Scotland, and supported the Scottish National Party financially. In 2000, when the Scottish Executive proposed to repeal Section 2A of the Local Government Act, which prevented local authorities from \"promoting homosexuality\", Souter started the Keep the Clause campaign to oppose their plans, spending £1 million of his own money to organise a private referendum across Scotland. This campaign and other controversial statements have led opponents to accuse him of homophobia.\nIn 2011, he was knighted for services to transport and the voluntary sector. The honour was criticised by Scottish Labour Party politicians and by gay rights campaigners.\nIn October 2019, Souter made what is possibly the biggest charitable donation from a Scot since Andrew Carnegie gave away his fortune. His donation of £109 million came on top of £98M he had already gifted to the Souter Charitable Trust which has supported 13,000 causes over 13 years.According to the Sunday Times Rich List in 2020, Souter and his sister Ann Gloag are worth £730 million, a decrease of £145 million from the previous year.", "link_mentions": [{"page": "Dundee", "response": ["Abertay University was founded as Dundee Institute of Technology in 1888.  Previously, the buildings formed Bell Street Technical College, a further education college. It was granted university status in 1994 under the Further and Higher Education Act, 1992. The university is noted for its computing and creative technology courses, particularly in the fields of computer games technology and cyber-security. Notable alumni include David Jones, founder of DMA Design (now known as Rockstar North), Sir Brian Souter, founder of Stagecoach, and Lord Iain McNicol, former General Secretary of the Labour Party."]}, {"page": "List of Scots", "response": ["* Brian Souter (born 1954), entrepreneur and co-founder of Stagecoach Group"]}, {"page": "Perth, Scotland", "response": ["* Ann Gloag (b. 1942) and Brian Souter (b. 1954), co-founders Stagecoach Group"]}, {"page": "University of Strathclyde", "response": ["In business:John Barton, Chairman of Next plc and EasyJet; Sir Thomas Hunter, Entrepreneur and Philanthropist; Jim McColl, Scotland's richest man;John Giannandrea, Vice President at Google, head of Google Search; Brian Souter, co-founder of the Stagecoach Group; Sanjay Jha, chief executive officer of Motorola; chief executive officer of Motorola Mobile Devices; Alastair Storey, chief executive officer of Global Foundries, chairman and chief executive officer of Westbury Street Holdings; and Andrew Wyllie, civil engineer, chief executive officer of the Costain Group and president of the Institution of Civil Engineers."]}, {"page": "South West Trains", "response": ["Major measures performed by SWT to expand the network's capacity included the substantial redevelopment of its London Waterloo station and the procurement of new rolling stock. Christian Roth, SWT's engineering director, claimed in 2015 that the firm was in the process of delivering similar capacity improvements to the Thameslink programme at a tenth of the cost and a quarter of the time. While some rival companies chose to pursue driver-only operated trains, eliminating the necessity of a guard, SWT senior manager Brian Souter promised to keep a guard on every service; one consequence of this agreement was strong relations between the company and the trade unions."]}, {"page": "Church of the Nazarene", "response": ["* Scottish businessman Brian Souter (born 1954 in Perth, Scotland), the prominent leader of the Keep the Clause campaign, is an active member of the denomination; "]}, {"page": "Airdrie Savings Bank", "response": ["In August 2010 it was announced that a new branch would be opened after a cash injection of £10 million, from a group of Scottish entrepreneurs who support the bank's mutual model. Sir Angus Grossart, Sir David Murray, Ann Gloag, Brian Souter, Sir Tom Farmer and Ewan Brown each provided £1 million. Soutar stated that \"Airdrie Savings Bank represents what Scottish banks once stood for – security of funds, a focus on savings and outstanding personal service\". He went on to say that: \"We believe the mutual principle is fundamental to the integrity of the bank. We are doing this because so many Scots are dismayed at what has happened within the banking sector\".Campsie, Alison (28 August 2010) \"Tycoons hand last independent bank £10 million\". Glasgow: The Herald."]}, {"page": "Russell T Davies", "response": ["Like Queer as Folk, Bob & Rose contributed to the contemporary political debate around LGBT rights: a subplot involves the fictional pressure group Parents Against Homphobia (PAH), led by Bob's mother Monica (Penelope Wilton), an ardent gay rights activist, and their campaign to repeal Section 28 of the Local Government Act 1988, which prohibited local authorities from \"intentionally promot[ing]\" homosexuality. The subplot climaxes in the fourth episode, when Monica and Bob lead a rally into direct action by handcuffing themselves to a bus run by a company whose management donated millions to keeping the law on the books; the scene directly parallels protests against the transport company Stagecoach due to their founder Brian Souter's financial and political support of Section 28—at one point, Davies intended to explicitly name Stagecoach in the script— and is inspired by earlier protests undertaken by the LGBT rights pressure group OutRage!."]}, {"page": "George Foulkes, Baron Foulkes of Cumnock", "response": ["In the Scottish Parliament, Foulkes was part of Labour's opposition to the minority SNP government, regularly tabling parliamentary questions criticising the Scottish Government's conduct. He highlighted several supposed irregularities, including the taxpayer-funded entertaining of wealthy SNP backers at Bute House and preferential treatment for Stagecoach in the Forth hovercraft project, after their co-founder Brian Souter donated £500,000 to the SNP. Foulkes became a target of criticism by SNP bloggers, whom he branded \"Cybernats\". He was also part of a campaign for presumed consent on organ donation."]}, {"page": "Wendy Alexander", "response": ["As Communities Minister, Alexander fought hard to bring about the repeal of Section 28 to contribute to social acceptance and greater equality for the LGBT community by removing a ban on the promotion of homosexuality by local authorities.Scottish Parliament repeals Section 28Independent 22 June 2000 in the face of a sustained campaign by Stagecoach millionaire and later SNP donor Brian Souter to keep the legislation. In the end the repeal, contained in the  ethical Standards in Public Life (Scotland) Bill was passed by 99 votes to 17.Official Report, 21 June 2000 Scottish Parliament During the final debate, Alexander said, \"Repeal is not, and never has been, about the promotion of homosexuality in our schools. It is not about political correctness or, even less, about marriage. It is about building a tolerant Scotland. We know that teachers are confused about the meaning of section 2A, we know that bullying exists in our schools and elsewhere, and we know that children's organisations overwhelmingly back repeal.\"Official Report, 21 June 2000 Scottish Parliament"]}, {"page": "Nicola Sturgeon", "response": ["Sturgeon stood for election to the Scottish Parliament in the first Scottish Parliament election in 1999 as the SNP candidate for Glasgow Govan. Although she failed to win the seat, she was placed first in the SNP's regional list for the Glasgow region, and was thus elected as a Member of the Scottish Parliament. During the first term of the Scottish Parliament, Sturgeon served as a member of the Shadow Cabinets of both Alex Salmond and John Swinney. She was Shadow Minister for Children and Education from 1999 to 2000. In the role she backed Labour's efforts to repeal Section 28 – a law that banned the promotion of homosexuality in schools. There was however significant public opposition to repeal and an unscientific postal vote on the issue – organised by SNP donor Brian Souter – suggested most Scots wanted to keep the clause. Acknowledging this, Sturgeon suggested: \"That is why the SNP have urged a policy for many months that we believe can provide people with the necessary reassurance, by providing a statutory underpinning to the guidelines, and resolve this difficult debate. We believe that the value of marriage should be clearly referred to in the guidelines, without denigrating other relationships or children brought up in other kinds of relationship.\" The compromise had the support of Souter but an amendment to that effect was voted down by MSPs who expressed concerns it would stigmatise children from single parent and unmarried families."]}, {"page": "Dennis Specialist Vehicles", "response": ["In March 2004 Mayflower was placed in administration amid accusations of four years of falsifying crucial company records as to customers' payments to HSBC, counting the same income twice. Transbus was also placed in administration.Engineering The Times 19 April 2004; pg. 20; issue 68053 Eventually Transbus Plaxton was sold to its managers, Brian Davidson and Mike Keane with the support of a private equity group.Managers buy Plaxton The Times 17 May 2004; pg. [19]; issue 68077MBO heralds TransBus deal by end of this week The Scotsman 17 May 2004 Transbus Alexander and Transbus Dennis were bought by a consortium which included David Murray, Brian Souter and Ann Gloag, and was branded Alexander Dennis.Mayflower chiefs may be liable for pension hole The Times 22 May 2004; pg. 54; issue 68082Completed Acquisition by Alexander Dennis Limited of Transbus Limited Office of Fair Trading 23 September 2004"]}, {"page": "Abertay University", "response": ["*Sir Brian Souter, Stagecoach founder"]}, {"page": "Stagecoach Group", "response": ["Stagecoach was born out of deregulation of the British express coach market in the early 1980s, though its roots can be traced back to 1976 when Ann Gloag and her husband Robin Gloag set up a small recreational vehicle and minibus hire business called Gloagtrotter in Perth, Scotland. Ann's brother, Brian Souter, an accountant, joined the firm and expanded the business into bus hire. In 1982, with the collapse of his marriage to Ann, Robin Gloag sold his ownership stake in the business and ceased any involvement. The Transport Act 1980, which freed express services of 35 miles and over from regulation by the Traffic Commissioner, brought new opportunities for the company and services were launched from Dundee to London using second-hand Neoplan coaches. For a while, the company offered a very personal service with Brian Souter doing the driving and Ann Gloag making up sandwiches and snacks for the passengers.", "Stagecoach Group plc is listed on the London Stock Exchange. Founder Brian Souter and his sister Ann Gloag are the largest shareholders with a combined 26% shareholding at April 2019.Annual Report 30 April 2019 Stagecoach plc", "The Stagecoach Group has also indirectly attracted criticism through controversial statements and actions made by its chairman and co-founder, Brian Souter, regarding certain public statements and his funding of a campaign to block the repeal of the Section 28 law. In 2000, OutRage! spokesman Peter Tatchell, called for a boycott of the bus and rail group."]}, {"page": "Alexander Dennis", "response": ["A group of Scottish investors, Noble Grossart, David Murray, Brian Souter and Ann Gloag, purchased the business from administrator Deloitte in May 2004.Mayflower chiefs 'may be liable for pension hole'. The Times, 22 May 2004; pg. 54; Issue 68082Sir Angus jumps the bus Sunday Herald 26 December 2004"]}, {"page": "Souter", "response": ["* Brian Souter (born 1954), Scottish businessman"]}, {"page": "Plaxton President", "response": ["The Mayflower Group, the parent company of TransBus International, went into administration in March 2004. It was bought out in May 2004 by a consortium including Brian Souter, the owner of the Stagecoach Group and was renamed Alexander Dennis. A programme of restructuring began within Alexander Dennis which, at the time, saw the Plaxton coach division divested and the TransBus product range rationalised. In turn a decision was taken to close the former Northern Counties plant in Wigan  and phase out the President in favour of the Falkirk-built ALX400. The final Presidents were built at the Wigan plant in January 2005 and both it and the ALX400 would be phased out in favour of the semi-integral Alexander Dennis Enviro400 which took over from end of 2005. The Enviro400 has elements of the ALX400 and President in its design."]}, {"page": "Northern Counties (bus manufacturer)", "response": ["On 31 March 2004, TransBus International was put into administration.Update: re Administration Mayflower Corporation 22 April 2004 On 21 May 2004, TransBus International was bought by a consortium of merchant banker Noble Grossart, and businessmen David Murray and Brian Souter.Murray and Souter join forces to buy TransBus The Scotsman 21 May 2004 The new company was named Alexander Dennis. On 26 January 2005, the former Northern Counties Wigan plant closed, after completing outstanding orders of Plaxton President bodies.Bob's life on the buses Wigan Evening Post 8 September 2006"]}, {"page": "Dollar Academy", "response": ["*2012 Sir Brian Souter"]}]}}