{"wiki_id": "http://www.wikidata.org/entity/Q4966709", "itemLabel": "Bridget Cleary", "itemDescription": "Irish woman executed as alleged witch", "wikipedia_url": "https://en.wikipedia.org/wiki/Bridget_Cleary", "wikipedia_page": {"main": "Bridget Cleary (née Boland; Irish: Bríd Uí Chléirigh; c. 1869 – 15 March 1895) was an Irish woman killed by her husband in 1895. Her death is notable for several peculiarities: the stated motive for the crime was her husband's belief that she had been abducted by fairies with a changeling left in her place; he claimed to have slain only the changeling. The gruesome nature of the case – she was either burnt to death or set on fire immediately following her death – prompted extensive press coverage. The trial was closely followed by newspapers in both Ireland and Britain. As one reviewer commented, nobody, with the possible exception of the presiding judge, thought it was an ordinary murder case.", "link_mentions": [{"page": "1895", "response": ["** Bridget Cleary is killed and her body burned in County Tipperary, Ireland, by her husband, Michael; he is subsequently convicted and imprisoned for manslaughter, his defence being a belief that he had killed a changeling left in his wife's place after she had been abducted by fairies."]}, {"page": "Death by burning", "response": ["In 1895, Bridget Cleary (née Boland), a County Tipperary woman, was burnt by her husband and others, the stated motive for the crime being the belief that the real Bridget had been abducted by fairies with a changeling left in her place. Her husband claimed to have slain only the changeling. The gruesome nature of the case prompted extensive press coverage. The trial was closely followed by newspapers in both Ireland and Britain.McCullough (2000), The Fairy Defense As one reviewer commented, nobody, with the possible exception of the presiding judge, thought it was an ordinary murder case."]}, {"page": "Changeling", "response": ["Fairies would also take adult humans, especially the newly married and new mothers; young adults were taken to marry fairies instead while new mothers were often taken to nurse fairy babies. Often when an adult was taken instead of a child an object such as a log was left in place of the stolen human, enchanted to look like the person.Katherine Briggs, A Dictionary of Fairies \"Changelings\" This object in place of the human would seem to sicken and die, to be buried by the human family, while the living human was among the fairies. Bridget Cleary is one of the most well known cases of an adult thought to be a changeling by her family; her husband killed her attempting to force the fairies to return his 'real' wife.", "Two 19th-century cases reflect the belief in changelings. In 1826, Anne Roche bathed Michael Leahy, a four-year-old boy unable to speak or stand, three times in the Flesk; he drowned the third time. She swore that she was merely attempting to drive the fairy out of him, and the jury acquitted her of murder.Silver (1999) p. 62 In 1895, Bridget Cleary was killed by several people, including her husband and cousins, after a short bout of illness (probably pneumonia). Local storyteller Jack Dunne accused Bridget of being a fairy changeling. It is debatable whether her husband Michael actually believed her to be a fairy; many believe that he concocted a \"fairy defense\" after murdering his wife in a fit of rage. The killers were convicted of manslaughter rather than murder, as even after the death they claimed to be convinced they had killed a changeling, not Bridget Cleary herself.Silver (1999) pp. 64–65"]}, {"page": "Rome Rule", "response": ["As the Irish nationalist movement recovered in the 1890s from the division caused by Parnell's relationship with Mrs O'Shea, it embraced Gaelic games and a growing Irish language revival movement, which were often encouraged by the Catholic Church for the good of its parishioners, but which also alienated Irish Protestants. The fate of Bridget Cleary in 1895 suggested that many rural Irish Catholics were still unduly superstitious. An \"Irish-Ireland\" ideology of nationalism was developed by David Moran, who stated in 1905 that it was essential to be Catholic to be Irish."]}, {"page": "Clonmel", "response": ["* Bridget Cleary (1869-1895), burned alive by her husband, Michael Cleary, because she was believed to be a shapeshifting fairy. The ensuing criminal trial was very high profile."]}, {"page": "1895 in Ireland", "response": ["*22 March – the burned body of Bridget Cleary is discovered in County Tipperary; her husband, Michael, is subsequently convicted and imprisoned for manslaughter, his defence being a belief that he had killed a changeling left in his wife's place after she had been abducted by fairies."]}, {"page": "John Byner", "response": ["On May 26, 2017, it was reported that Byner had been cast in a supporting role in the Amazon Video horror anthology series Lore, which is based on the podcast of the same name. Byner portrays Patrick Boland, the father of Bridget Cleary (played by Holland Roden). Lore premiered on October 13, 2017."]}, {"page": "Witch trials in the early modern period", "response": ["In 1895, Bridget Cleary was beaten and burned to death by her husband in Ireland because he suspected that fairies had taken the real Bridget and replaced her with a witch."]}, {"page": "Michael Cleary", "response": ["*Michael Cleary, Irish criminal who killed his wife Bridget Cleary in 1895"]}, {"page": "Michael Cleary (criminal)", "response": ["#REDIRECT Bridget Cleary"]}, {"page": "Folie à deux", "response": ["* Psychologists  H. O'Connell and  P.G. Doyle believe folie à plusiers to have been at least a partial factor in the murder of Bridget Cleary. In 1895, Michael Cleary convinced several friends and relatives that his wife, Bridget Cleary, was a changeling who had been replaced by a fairy. They assisted him in physically abusing her to \"cast the fairies\" out before he ultimately burned her to death shortly afterwards. O’Connell, H., & Doyle, P. G. (2006). The burning of Bridget Cleary: Psychiatric aspects of a tragic tale. Irish Journal of Medical Science, 175(3), 76-78. doi:10.1007/bf03169179"]}, {"page": "Holland Roden", "response": ["Holland Roden (born October 7, 1986) is an American actress. She is known for her roles as Lydia Martin in MTV's teen drama series Teen Wolf, Zoe Woods in Syfy's horror anthology series Channel Zero: Butcher's Block, Bridget Cleary in Amazon Prime Video's horror anthology documentary series Lore and as Erin Isaacs in the 2020 horror film No Escape.", "On May 25, 2017, Roden was cast as the lead in the third season of Syfy's horror anthology series Channel Zero, titled Butcher's Block. She portrayed Zoe Woods, a young woman who struggles with mental illness. The show premiered on February 7, 2018. On May 31, 2017, Roden was cast as the lead in the Amazon Prime Video horror anthology series Lore, in which she played the role of Bridget Cleary. Lore premiered on October 13, 2017.", "| Bridget Cleary"]}, {"page": "Fairy Witch of Clonmel", "response": ["#redirect Bridget Cleary"]}, {"page": "Lore (TV series)", "response": ["* Holland Roden as Bridget Cleary"]}, {"page": "The Hidden People", "response": ["The Hidden People is a historical fantasy and horror novel by English writer Alison Littlewood, first published in the United Kingdom in October 2016 by Jo Fletcher Books. It is based on the 1895 incident in Tipperary, Ireland where Bridget Cleary was burnt alive by her husband who believed she was a fairy changeling.", "The Hidden People is based on the 1895 incident in Clonmel, Tipperary in Ireland where Bridget Cleary, an Irish dressmaker, was burnt alive by her husband because he maintained that fairies had abducted her and replaced her with a changeling. In 19th-century rural Ireland, superstitious beliefs in fairies and other mythological creatures were strong amongst the working classes. Folklore at the time deemed that setting someone on fire would banish the changeling and bring back the stolen person."]}, {"page": "Maija Sofia", "response": ["Bath Time featured songs relating to marginalised women such as Elizabeth Siddall and Bridget Cleary."]}, {"page": "Death of Michael Leahy", "response": ["* Bridget Cleary – an Irish woman killed by her husband in 1895. Her husband claimed that she was a changeling."]}]}}