{"wiki_id": "http://www.wikidata.org/entity/Q4960931", "itemLabel": "Brendan Hughes", "itemDescription": "Irish republican", "wikipedia_url": "https://en.wikipedia.org/wiki/Brendan_Hughes", "wikipedia_page": {"main": "Brendan Hughes (June 1948 – 16 February 2008), also known as \"The Dark\", and \"Darkie\"  was a leading Irish republican and former Officer Commanding (OC) of the Belfast Brigade of the Provisional Irish Republican Army (IRA). He was the leader of the 1980 Irish hunger strike.", "link_mentions": [{"page": "2008", "response": ["* February 16 – Brendan Hughes, Northern Irish paramilitary leader (b. 1948)"]}, {"page": "HM Prison Maze", "response": ["However, Special Category Status was short-lived. As part of a new British policy of \"criminalisation\", and coinciding with the end of internment, the new Secretary of State for Northern Ireland, Merlyn Rees, ended Special Category Status from 1 March 1976. Those convicted of \"scheduled terrorist offences\" after that date were housed in the eight new \"H-Blocks\" that had been constructed at Long Kesh, now officially named Her Majesty's Prison Maze (HMP Maze). Existing prisoners remained in separate compounds and retained their Special Category Status with the last prisoner to hold this status being released in 1986. Some prisoners changed from being Special Category Status prisoners to being common criminals. Brendan Hughes, an IRA prisoner, had been imprisoned with Special Category Status in Cage 11, but was alleged to have been involved in a fight with warders. He was taken to court and convicted then returned to the jail as a common prisoner and incarcerated in the H-Blocks as an ordinary prisoner, all within the space of several hours."]}, {"page": "Official Irish Republican Army", "response": ["Initially there was much confusion among republicans on the ground; Martin McGuinness for example, joined the Official IRA in 1970, unaware that there had been a split and only later joined the Provisionals. The Provisionals eventually extended their armed campaign from defence of Catholic areas. Despite the reluctance of Cathal Goulding and the OIRA leadership, their volunteers on the ground were inevitably drawn into the violence. The Official IRA's first major confrontation with the British Army came in the Falls Curfew of July 1970, when over 3,000 British soldiers raided the Lower Falls area for arms, leading to three days of gun battles. The Official IRA lost a large amount of weaponry, and their members on the ground blamed the Provisionals for starting the firing and then leaving them alone to face the British. The bad feeling left by this and other incidents led to a feud between the two IRAs in 1970, with several shootings carried out by either side. The two IRA factions arranged a truce between them after the OIRA killing of Provisional activist, and Belfast brigade D-Company commander, Charlie Hughes (a cousin of the well-known Provisional Brendan Hughes)."]}, {"page": "Hunger strike", "response": ["In 1980, seven Irish Republican prisoners, six from the IRA and one from the Irish National Liberation Army, in the Maze Prison launched a hunger strike as a protest against the revocation by the British Government of a prisoner-of-war-like Special Category Status for paramilitary prisoners in Northern Ireland. The strike, led by Brendan Hughes, was called off before any deaths, when the British government seemed to offer to concede their demands; however, the British Government then reneged on the details of the agreement. The prisoners then called another hunger strike the following year. This time, instead of many prisoners striking at the same time, the hunger strikers started fasting one after the other in order to maximise publicity over the fate of each one."]}, {"page": "Bloody Friday (1972)", "response": ["'Bloody Friday' was the IRA's response to the breakdown of the talks. According to the IRA's Chief of Staff, Seán Mac Stíofáin, the main goal of the bombing operation was to wreak financial harm.\"Bloody Friday: What Happened\". BBC News, 16 July 2002. Retrieved 7 March 2011. It was a \"message to the British government that the IRA could and would make a commercial desert of the city unless its demands were met\".Maloney, Ed. Voices From the Grave: Two Men's War in Ireland. US: Faber & Faber, 2010. p.104 The attack was carried out by the IRA's Belfast Brigade and the main organiser was Brendan Hughes, the brigade's Officer Commanding.", "For the IRA, it was \"an operation gone awry\".White, Robert William. Ruairí Ó Brádaigh: The Life and Politics of an Irish Revolutionary. Indiana University Press, 2006. p.190 IRA Chief of Staff, Seán Mac Stíofáin, said the civilian casualties \"compromised the intended effect\" of the bombings. Brendan Hughes, Officer Commanding of the IRA's Belfast Brigade, viewed the attack as a disaster. He described his reaction in an interview organised by Boston College:"]}, {"page": "1981 Irish hunger strike", "response": ["On 27 October 1980, republican prisoners in HM Prison Maze began a hunger strike. One hundred and forty-eight prisoners volunteered to be part of the strike, but a total of seven were selected to match the number of men who signed the Easter 1916 Proclamation of the Republic. The group consisted of IRA members Brendan Hughes, Tommy McKearney, Raymond McCartney, Tom McFeeley, Sean McKenna, Leo Green, and INLA member John Nixon."]}, {"page": "Murder of Jean McConville", "response": ["The IRA did not admit involvement until after the signing of the Good Friday Agreement. It claimed she was killed because she was passing information about republicans to the British Army. Former IRA member Brendan Hughes claimed the IRA had searched her flat some time before her death and found a radio transmitter, which they confiscated.Moloney, Ed. Voices from the Grave: Two Men's War in Ireland. Faber and Faber, 2010. pp. 128-129 He and other former republicans interrogated her and claimed she admitted the British Army was paying her for information about republicans. Hughes claims that, because of her circumstances, they let her go with a warning. However, he claims when the IRA found she had resumed working for the British Army, it decided to \"execute\" her.", "Boston College had launched an oral history project on the Troubles in 2001. It recorded interviews with republicans and loyalists about their involvement in the conflict, on the understanding that the tapes would not be released until after their deaths.\"What are the Boston tapes?\" . BBC News, 1 May 2014. Two of the republican interviewees, Brendan Hughes and Dolours Price, both now deceased, admitted they were involved in McConville's kidnapping. Both became diehard opponents of the Good Friday Agreement and Sinn Féin's support of it. They saw Sinn Féin president Gerry Adams as a traitor for negotiating the agreement and persuading the IRA to end its campaign."]}]}}