{"wiki_id": "http://www.wikidata.org/entity/Q4965139", "itemLabel": "Brian Roberts", "itemDescription": "English association football player (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Roberts_(English_footballer)", "wikipedia_page": {"main": "Brian Leslie Ford Roberts (born 6 November 1955), commonly known by his nickname Harry Roberts, is an English former professional footballer who played as a defender. He made more than 400 appearances in the Football League for Coventry City, Hereford United, Birmingham City and Wolverhampton Wanderers.After ten years as a professional at Coventry City he joined Birmingham City for a fee of £10,000 raised through a supporters' \"Buy a Player Fund\". He won the club's Player of the Year award for 1989. Nicknamed \"Harry\" after the 1960s police-killer Harry Roberts, he published an autobiography entitled Harry's Game.He went on to coach at Coventry City before becoming head of sport at a private school in Leamington Spa.", "link_mentions": [{"page": "Birmingham City F.C.", "response": ["A number of supporters' clubs are affiliated to the football club, both in England and abroad. An action group was formed in 1991 to protest against chairman Samesh Kumar, the club blamed an internet petition for the collapse of the purchase of player Lee Bowyer in 2005, and antipathy towards the board provoked hostile chanting and a pitch invasion after the last match of the 2007–08 season, but when the club was in financial difficulties, supporters contributed to schemes which funded the purchase of players Brian Roberts in 1984 and Paul Peschisolido in 1992. A supporters' trust was formed under the auspices of Supporters Direct in 2012."]}, {"page": "Harry Roberts", "response": ["*Brian Roberts (English footballer) aka Harry Roberts (born 1955), Coventry and Birmingham defender"]}, {"page": "Steve Hunt (footballer, born 1956)", "response": ["Hunt took a large pay cut to return to the English Football League with Coventry City, having been signed for a £40,000 fee. He scored on his debut in a 2–0 win at Derby County. Manager Gordon Milne moved Tommy Hutchison to the right-wing to accommodate Hunt in the team. Coventry played the Cosmos on 16 May 1979 in a friendly game arranged as part of Hunt's transfer. Having struggled to adapt back to the physical English game in the 1978–79 season, he established himself in the \"Sky Blues\" starting eleven for the 1979–80 campaign, playing as a left-sided midfielder rather than a pure winger. He formed a good understanding with Brian Roberts, who had succeeded Bobby McDonald at left-back. The Coventry team were young and inexperienced as established stars were sold off by chairman Jimmy Hill to fund the development of the club's training ground, the Sky Blue Connexion. Coventry also reached the League Cup semi-finals in 1981, where they were beaten by West Ham United. The young Coventry team had come from two goals down to win the first leg 3–2 at Highfield Road, but would lose the return fixture 2–0."]}, {"page": "Brian Roberts", "response": ["Brian Roberts may refer to:", "*Brian Roberts (Australian rules footballer) (1945–2016), Australian rules footballer", "*Brian Roberts (English footballer) (born 1955), English football defender", "*Brian Roberts (New Zealand footballer) (born 1967), New Zealand international footballer", "*Brian Roberts (baseball) (born 1977), American baseball player", "*Brian Roberts (soccer) (born 1982), American soccer player", "*Brian Roberts (basketball) (born 1985), American basketball player", "*Brian Roberts (historian) (born 1930), British historian on South African history", "*Brian Robertson (disambiguation)"]}]}}