{"wiki_id": "http://www.wikidata.org/entity/Q4964097", "itemLabel": "Brian Horne", "itemDescription": "English footballer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Horne", "wikipedia_page": {"main": "Brian Simon Horne (born 5 October 1967) is an English former footballer. He played professionally for Millwall, Middlesbrough, Stoke City, Portsmouth and Hartlepool United.", "link_mentions": [{"page": "Millwall F.C.", "response": ["|1987|| Brian Horne", "* Brian Horne"]}, {"page": "Hartlepool United F.C.", "response": ["* 1996  Brian Horne"]}, {"page": "Canvey Island F.C.", "response": ["*Record transfer fee received: £4,500 from Farnborough Town for Brian Horne"]}, {"page": "Erich Kunzel", "response": ["* The Great Fantasy Adventure Album, featuring Timothy Berens, May Festival Chorus directed by Robert Porco featuring Brian Horne, with John Birge, Charles Pagnard, Paul Piller, Marc Wolfley, Fred Thiergartner, Heather MacPhail, Marcia Labella, Juliet Stratton, Elizabeth Motter (Miklós Rósza; John Williams; Michael Kamen; Patrick Doyle; James Horner; Bernard Herrmann; Alan Silvestri; Laurence Rosenthal; Danny Elfman; Jerry Goldsmith; Mark Knopfler; Lee Holdridge; Basil Poledouris; Michael Bishop, Scott Burgess, Tom Letizia; Brad Fiedel, Julie Spangler) (1994)"]}, {"page": "Keith Houchen", "response": ["He released goalkeeper Brian Horne, who he described as a \"fat slob\"; this proved to be an unpopular move with \"a lot of nasty people who support Hartlepool... who purport to support this club [but] would rather back fat professional players than people who really care about Hartlepool United\". As his replacement he signed Stephen Pears from Liverpool, as well as young defenders Glen Davies and Chris McDonald, teenage winger David Clegg, Exeter City midfielder Mark Cooper, and Blackpool midfielder Chris Beech. Hartlepool started the 1996–97 campaign with wins over Colchester United and Fulham, but his playing career came to an end after the fifth game of the season, against Wigan Athletic, when he retired due to a persistent knee injury. He continued to bemoan refereeing decisions which seemed to consistently go against Hartlepool. This in turn led to continued punishments from the FA over his use of foul language towards officials. With his team on a poor run of results at the foot of the table, he left the club by mutual consent on 4 November 1996. His assistant Mick Tait led the club to a 20th-place finish, and organised a benefit match for Houchen against Middlesbrough, which raised £23,000."]}]}}