{"wiki_id": "http://www.wikidata.org/entity/Q4968482", "itemLabel": "Netta Muskett", "itemDescription": "British novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Netta_Muskett", "wikipedia_page": {"main": "Netta Muskett (1887 in Sevenoaks, Kent, England – 29 May 1963 in Putney) was a British writer of more than 60 romance novels from 1927 to 1963, who also wrote under the pseudonym Anne Hill. Her novels have been translated to several languages, including: Spanish, French, Portuguese, Finnish, Swedish and Danish.\nNetta Muskett was co-founder and vice-president of the Romantic Novelists' Association, that created in her honour the Netta Muskett Award for new writers, now called the RNA New Writers Scheme.", "link_mentions": [{"page": "May 29", "response": ["*1963 – Netta Muskett, English author (b. 1887)"]}, {"page": "1963", "response": ["* May 29 – Netta Muskett, British novelist (b. 1887)"]}, {"page": "Sevenoaks", "response": ["*Netta Muskett (1887–1963), novelist"]}, {"page": "1963 in the United Kingdom", "response": ["* 29 May – Netta Muskett, novelist (born 1887)"]}, {"page": "Romantic Novelists' Association", "response": ["The Romantic Novelists' Association (RNA) is the professional body that represents authors of romantic fiction in the United Kingdom. It was founded in 1960 by Denise Robins (first president), Barbara Cartland (first vice-president), Vivian Stuart (first elected chairman), and other authors including Elizabeth Goudge, Netta Muskett, Catherine Cookson, Rosamunde Pilcher and Lucilla Andrews.", "The RNA has a membership approaching 1000, composed of authors and publishing professionals. It promotes and celebrates excellence in romantic fiction across all sub-genres. It offers a programme of events throughout the year including an annual conference and workshops/seminars on aspects of writing craft and the publishing industry. The organisations also supports a number of regional chapters, who meet regularly to discuss issues of concern to writers of romantic fiction. The organisation also runs the New Writers' Scheme, under which unpublished authors receive an appraisal of their work from an experienced member of the Association. Netta Muskett was co-founder and vice-president of the association and the Netta Muskett Award for new writers, now called the RNA New Writers Scheme, was created in her honour.", "* Netta Rachel Muskett (Netta Muskett, Anne Hill)"]}, {"page": "List of people from Sevenoaks", "response": ["*Netta Muskett (1887–1963) novelist"]}, {"page": "Netta (disambiguation)", "response": ["* Netta Muskett (1887–1963), British romance novelist"]}, {"page": "Netta Rachel Muskett", "response": ["#REDIRECT Netta Muskett"]}, {"page": "Anne Hill (novelist)", "response": ["#REDIRECT Netta Muskett"]}, {"page": "Muskett", "response": ["*Netta Muskett (1887–1963), English writer"]}]}}