{"wiki_id": "http://www.wikidata.org/entity/Q4963900", "itemLabel": "Brian Griffiths", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Griffiths_(artist)", "wikipedia_page": {"main": "Brian Griffiths (born 1968) is an artist based in London. He produces three-dimensional collages using a range of sources, including old textbooks, 1950s and 1960s furniture, remnants of cut linoleum and polystyrene. His most well known works are his full-size cardboard reconstructions of computer workstations.\nGriffiths was born in Stratford-Upon-Avon, UK. He received his BA from the University of Humberside in 1992. From 1995 to 1996 he studied for his M.A. in Fine Art at Goldsmiths College, University of London.\nGriffiths has shown work internationally in many exhibitions including New Blood at the Saatchi Gallery in London, the 2001 Tirana Biennale, Haemorrhaging States at Tent in Rotterdam and Hey, You Never Know at Kenny Schachter in New York City. He participated in the 2001 Beck's Futures prize and was a selector for the 2006 Bloomberg New Contemporaries.\nGrittiths is also a tutor at the Royal Academy of Arts and a part-time tutor at Camberwell College of Arts for BA sculpture", "link_mentions": [{"page": "Francis Upritchard", "response": ["In December 2001, Upritchard co-founded an artist-run space, the Bart Wells Institute, with fellow artist Luke Gottelier in a semi-derelict Hackney warehouse. The Bart Wells Institute ran for about two years and exhibitions were curated by artists including Sam Basu, Brian Griffiths, David Thorpe and Harry Pye."]}, {"page": "Art on the Underground", "response": ["Since 2000, an entire disused platform at Gloucester Road station has used as a backdrop for temporary exhibitions including sculptures, murals or photographs. The first piece commissioned for Gloucester Road was an Elephant sculpture by Kendra Haste, which is now on permanent display at Waterloo tube station. Artists displayed at Gloucester Road have included David Shrigley, Chiho Aoshima and Brian Griffiths. In 2018, British artist Heather Phillipson filled the 80m platform with egg sculptures and video screens in an installation titled \"my name is lettie eggsyrub\", to critical acclaim."]}, {"page": "List of people associated with Goldsmiths, University of London", "response": ["*Brian Griffiths"]}, {"page": "Brian Griffiths", "response": ["Brian Griffiths may refer to:", "* Brian Griffiths (artist) (born 1968), artist based in London", "* Brian Griffiths (footballer) (born 1933), Welsh former footballer", "* Brian Griffiths, Baron Griffiths of Fforestfach (born 1941), British Conservative politician"]}, {"page": "David Thorp", "response": ["The exhibition included environments created by Marc Camille Chaimowicz, David Medalla, Georgina Starr, Brian Griffiths. Plastique Fantastique (David Burrows and Simon O'Sullivan). There were Installations, social events, and performances by Spartacus Chetwynd (Helmut Newton Ladies Nights), Bob & Roberta Smith with Le Suisse Marocain and Leonardo Ulian (kiosk & piano bar), Mark Titchner (psychosomatic acid test), Gail Pickering (convention centre), Tai Shani (tableau performance), Reza Aramesh (street occupation), Alexander Hidalgo (fashion/music event), Lindsay Seers (cinema performance), Pil and Galia Kollectiv (sci-fi banquet), Anthony Gross (LED eyes), Luke Oxley (shop), Adam Nankervis (performance), Paul O'Neill (General Idea films and DJ set), David Burrows and Kit Poulson (contacting angels), David Blamey and Craig Richards (sound).  The Exhibition included live music by the Apathy Band, the Readers, the No No Band, Victor Mount, Leigh Clarke. 'Sawing off the Branch I'm Sitting on': Selection by John Millar with Ruby Pester & Nadia Rossi, Hysteria on Film (films by Carol Morley and Richard Squires), Cara Ball Tolmie, Omnivore Demon, Let Me Feel Your Finger First, Ming Ming and the Ching Chings and Colin Miller & David James Grinly. Mark Pearson (stagtronic). Jason Underhill (karaoke). Evel Gazebo play Hawkwind's 'Space Ritual'. Young UK fashion show, Poker All Stars, Bistrotheque Monday Cabaret with Bourgeois & Maurice and Jonny Woo, and more."]}, {"page": "198 Contemporary Arts and Learning", "response": ["During the course of its 28-year existence, 198 Contemporary Arts and learning has hosted projects and solo exhibitions showcasing the work of more than four hundred British and international artists, including: Keith Piper, Eva Sajovic, Hew Locke, Brian Griffiths, Fernando Palma Rodriguez, Quilla Constance, Barby Asante, Delaine Le Bas, and Godfried Donkor"]}, {"page": "Mary Ramsden", "response": ["Ramsden studied art at Leith School of Art (LSA) and Edinburgh College of Art. She continued her education and graduated in 2013 from the three-year postgraduate art school at the Royal Academy of Arts, RA, in London, studying with artists Richard Kirwan, Brian Griffiths and Vanessa Jackson. While still at the RA Ramsden's first solo gallery show was held in 2012 at Pilar Corrias and a second was held there in January 2015."]}]}}