{"wiki_id": "http://www.wikidata.org/entity/Q4963428", "itemLabel": "Brian Cookson", "itemDescription": "English racing cyclist and cycling executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Cookson", "wikipedia_page": {"main": "Michael Brian Cookson OBE (born 22 June 1951) is the former president of the Union Cycliste Internationale (UCI), having been elected to the post in September 2013 at the 2013 UCI Road World Championships.\nCookson previously served as president of British Cycling from 1997 to 2013, after becoming a member of an emergency committee to rescue it from insolvency in 1996. He has been credited with turning the sport around since taking on his unpaid role as president and under his presidency, British cyclists have won 19 Olympic gold medals, 28 Paralympic Gold medals, the Tour de France five times, and multiple World Championship titles in disciplines of Road, Track and BMX.", "link_mentions": [{"page": "June 22", "response": ["*1951 – Brian Cookson, British cyclist and sports administrator"]}, {"page": "British Cycling", "response": ["In 1996, the BCF incurred large debts as a result of a legal dispute with Tony Doyle, who resigned from his position as President of the Federation shortly after its Board attempted to remove him. Doyle had been elected to the Presidency in late 1995 on a platform of increasing transparency and accountability in the Federation: the campaign to remove him was based on claims that he had failed to declare his role as a consultant to a company that wanted to act as the promoter for the 1996 UCI Track Cycling World Championships in Manchester. In December 1996, the report of auditors from the UK Sports Council into the Federation's finances and management found that there were serious shortcomings in its procedures for accounting and control of finances and potential conflicts of interests between board members and leading companies in the cycling sector. The board were then removed by the membership and replaced with an emergency management committee. As a result of the report, Minister for Sport Iain Sproat warned that the BCF's Sports Council grants could be withdrawn and that it could be banned from applying for Lottery money. Brian Cookson was elected as President soon afterwards: he described the organisation's situation at the time as \"close to bankruptcy, 14,000 members and falling, one Olympic gold in 76 years and not much  "]}, {"page": "Jens Voigt", "response": ["The record attempt was successful. In front of an audience of 1600 people, Voigt rode 51.110 kilometers during the course of an hour, beating the previous record by 1.410 kilometers. He reached the previous mark on the 199th lap of the velodrome, with 1:28 remaining. Voigt used a modified version of the Trek Speed Concept frame, with dual disc wheels and standard aero bars. He also used a front gearing of 54 teeth and a rear gearing of 14 teeth. Voigt stood up on his machine a couple of times during the event. He was faster at the end of the attempt, as he covered some laps (250 meters) in under 17 seconds. Voigt is the oldest rider to ever beat the record and his average power output was 412 watts. He is also the first German to hold the record. The UCI president, Brian Cookson, believed that this event could be the start of a cascade of attempts by other riders who perform well in time trials."]}, {"page": "Herne Hill Velodrome", "response": ["A £200,000 grant from British Cycling allowed the track to be resurfaced, and £1.5 million was secured from Sport England and the London Marathon Trust for the construction of a new pavilion, which began in April 2016 and was completed in 2017. The pavilion, designed by Mike Taylor of Hopkins Architects (who also designed the London Olympic Velodrome), was opened in March 2017 with a ribbon-cutting ceremony carried out by Union Cycliste Internationale President Brian Cookson."]}, {"page": "Hutton Grammar School", "response": ["*Brian Cookson OBE, former President of the International Cycling Union and British Cycling"]}, {"page": "Pendle Borough Council", "response": ["Brian Cookson OBE retired in March 2013 from his position as Executive Director for Regeneration, a post he had held for nine years, in parallel (after 2007) with that of President of British Cycling. Subsequently becoming the President of the Union Cycliste Internationale (UCI), the world governing body for sports cycling."]}, {"page": "Harold \"H\" Nelson", "response": ["A number of past riders have moved on to other roles within the sport: four have been GB team masseurs for major events including the World Championships and the Olympic Games. One rider, Dan Guillemette has moved from the parallel route of Nelson's tutelage and qualifying and working physiotherapist to working with the professional racing team, Team Sky. Rob Palmer, another former rider, has worked as a chiropractor with a number of professional teams including Garmin and Cannondale. Also, a former rider, Brian Cookson, having been the President of British Cycling (1997-2013), since September 2013 has been the President of the Union Cycliste Internationale."]}, {"page": "Pat McQuaid", "response": ["On Friday 27 September 2013, he was a candidate for a third term as UCI President, with Brian Cookson, who had previously backed McQuaid, UCI offer public show of unity in face of mounting pressure - Cookson stands by UCI leadership, Cycling News, Feb 3 2013, David Benson, visited Sept 14 2018 the only other candidate.  He had originally been nominated by the cycling federations of his countries of origin, Ireland, and residence, Switzerland, but both nominations were withdrawn.  The election proceeded based on two third country nominations, allowed under a then-new UCI rule.  The election took place at the UCI Congress in Florence, and Cookson prevailed by 24-18 votes. McQuaid had pledged not to launch a legal challenge should he be defeated, in particular with reference to allegations of that votes had been \"bought\" by a member of the Management Committee who wanted McQuaid removed.Pat McQuaid defeated in cycling's presidential election, theguardian.com, Friday 27 September 2013, retrieved 19 January 2014.Former UCI chief Pat McQuaid had laptop seized after election loss, theguardian.com, Thursday 24 October 2013, retrieved 19 January 2014."]}, {"page": "2008 New Year Honours", "response": ["*Michael Brian Cookson, President, British Cycling Federation. For services to Sport. (Clitheroe, Lancashire)"]}, {"page": "Cookson", "response": ["*Brian Cookson (born 1951), British cyclist, and president of British Cycling"]}]}}