{"wiki_id": "http://www.wikidata.org/entity/Q4964632", "itemLabel": "Brian Maxine", "itemDescription": "British professional wrestler and cabaret artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Maxine", "wikipedia_page": {"main": "Brian Maxine (born 13 August 1938), known as 'Goldbelt', was a professional wrestler and cabaret artist. He held the British Welterweight Championship from 1969 to 1971. He won the British middleweight championship in 1971 and by briefly holding the two belts simultaneously he became the first champion at two weights since the post-war reorganisation of British titles. Maxine, who was known for his regular and flamboyant appearances in the 1970s on World of Sport, officially held the title (which was inactive).  He retired from wrestling undefeated.  \nMaxine also recorded country and western albums, backed by Fairport Convention.", "link_mentions": [{"page": "William Regal", "response": ["Matthews went on to tour worldwide, including Germany and South Africa. In 1991 he received a tryout match with the World Wrestling Federation. Matthews relayed that through Lord Alfred Hayes, WWF has become interested in seeing the young wrestler and offered him an opportunity at the WWF UK Rampage Show on 24 April 1991. Wrestling in a dark match, he appeared as Steve Regal and teamed with Dave Taylor and Tony St. Clair to defeat Drew McDonald, Chic Cullen, & Johnny South. Later that year he received a second booking and wrestled Brian Maxine at the Battle Royal at Albert Hall in London, England on 3 October 1991. Two months later Matthews was again wrestling on the UK swing of a major American promotion, although this time it was World Championship Wrestling. Appearing as Steve Regal, he wrestled six matches on WCW's tour of the United Kingdom and faced Terrance Taylor, Jimmy Garvin, Giant Haystacks, and Oz (Kevin Nash)."]}, {"page": "Trevor Lucas", "response": ["* Brian Maxine Ribbon of Stainless Steel (1974)"]}, {"page": "Salvatore Bellomo", "response": ["Bellomo was trained to wrestle by Nino. He debuted in his native Belgium in the early-1970s, wrestling at carnivals. In 1973, he toured the United Kingdom as \"Tino Salvadore\", losing to Brian Maxine in the Royal Albert Hall in London and appearing on World of Sport. In February 1975, he began wrestling in Guadalajara and Mexico City in Mexico with Empresa Mexicana de Lucha Libre as \"Adonis Romano\", primarily appearing in six-man tag team matches. In August 1975, he returned to Europe. He spent the next two years wrestling in Austria and Germany before relocating to Canada in late-1977."]}, {"page": "British Welterweight Championship", "response": ["|Brian Maxine"]}, {"page": "British Middleweight Championship", "response": ["Joint Promotions established a British Middleweight title in 1952 in compliance with the resolutions of the Mountevans Committee. By 1971, this title was in the possession of Brian Maxine who continued to claim the title without dispute in an unbroken reign until 2000. Also a successful musician, Maxine wore his championship belt on the cover of record releases."]}, {"page": "Dave Swarbrick discography", "response": ["==On Brian Maxine albums=="]}, {"page": "Maxine, Brian", "response": ["#redirectBrian Maxine"]}]}}