{"wiki_id": "http://www.wikidata.org/entity/Q4969317", "itemLabel": "Rosa Newmarch", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosa_Newmarch", "wikipedia_page": {"main": "Rosa Harriet Newmarch (18 December 1857 – 9 April 1940) was an English poet and writer on music.", "link_mentions": [{"page": "Leoš Janáček", "response": ["In Janáček's 70th year (1924), his biography was published by Max Brod, and he was interviewed by Olin Downes for The New York Times. In 1925, he retired from teaching but continued composing and was awarded the first honorary doctorate to be given by Masaryk University in Brno. In the spring of 1926, he created his Sinfonietta, a monumental orchestral work, which rapidly gained wide critical acclaim. In the same year, he went to England at the invitation of Rosa Newmarch. A number of his works were performed in London, including his first string quartet, the wind sextet Youth, and his violin sonata.Drlíková (2004), p. 109 Shortly after, and still in 1926, he started to compose a setting to an Old Church Slavonic text. The result was the large-scale orchestral Glagolitic Mass."]}, {"page": "Bedřich Smetana", "response": ["Almost three years passed before Smetana was declared the winner of Harrach's opera competition. Before then, on 5 January 1866, The Brandenburgers had been performed to an enthusiastic reception at the Provisional Theatre—over strong opposition from Maýr, who had refused to rehearse or conduct the piece. The idiom was too advanced for Maýr's liking, and the opera was eventually staged under the composer's own direction. \"I was called on stage nine times,\" Smetana wrote, recording that the house was sold out and that the critics were full of praise.Large, p. 145 Music historian Rosa Newmarch believes that, although The Brandenburgers has not stood the test of time, it contains all the germs of Smetana's operatic art.Newmarch, p. 64", "Dissatisfied with his first large-scale orchestral work, the D major Overture of 1848,Large, p. 46 Smetana studied passages from Beethoven, Mendelssohn, Weber and Berlioz before producing his Triumphal Symphony of 1853. (Section 7)  Though this is dismissed by Rosa Newmarch as \"an epithalamium for a Habsburg Prince\",Newmarch, p. 59 Smetana's biographer Brian Large identifies much in the piece that characterises the composer's more mature works.Large, p. 62 Despite the symphony's rejection by the Court and the lukewarm reception on its premiere, Smetana did not abandon the work. It was well received in Gothenburg in 1860,Large, p. 108 and a revised version was performed in Prague in 1882, without the \"triumphal\" tag, under Adolf Čech. The piece is now sometimes called the Festive Symphony."]}, {"page": "1940 in music", "response": ["*April 9 – Rosa Newmarch, music writer, 82"]}, {"page": "Leopold Stokowski", "response": ["Stokowski also became known for modifying the orchestrations of some of the works that he conducted, as was a standard practice for conductors prior to the second half of the 20th century. Among others, he amended the orchestrations of Beethoven, Tchaikovsky, Sibelius, Johann Sebastian Bach, and Brahms. For example, Stokowski revised the ending of the Romeo and Juliet Fantasy Overture, by Tchaikovsky, so it would close quietly, taking his notion from Modest Tchaikovsky's Life and Letters of Peter Ilych Tchaikovsky (translated by Rosa Newmarch: 1906) that the composer had provided a quiet ending of his own at Balakirev's suggestion. Stokowski made his own orchestration of Mussorgsky's Night on Bald Mountain by adapting Rimsky-Korsakov's orchestration and making it sound, in some places, similar to Mussorgsky's original. In the film Fantasia, to conform to the Disney artists' story-line, depicting the battle between good and evil, the ending of Night on Bald Mountain segued into the beginning of Schubert's Ave Maria."]}, {"page": "1857 in music", "response": ["*December 18 – Rosa Newmarch, née Jeaffreson, English musicologist (died 1940)"]}, {"page": "Ivan Aivazovsky", "response": ["During his 60-year career, Aivazovsky produced around 6,000 paintings of, what one online art magazine describes, \"very different value ... there are masterpieces and there are very timid works\". However, according to one count as many as 20,000 paintings are attributed to him. The vast majority of Aivazovsky's works depict the sea. He rarely drew dry-landscapes and created only a handful of portraits. According to Rosa Newmarch Aivazovsky \"never painted his pictures from nature, always from memory, and far away from the seaboard.\" Rogachevsky wrote that \"His artistic memory was legendary. He was able to reproduce what he had seen only for a very short time, without even drawing preliminary sketches.\" Bolton praised \"his ability to convey the effect of moving water and of reflected sun and moonlight.\""]}, {"page": "John Lane (publisher)", "response": ["* The Country HandbooksPublisher's advertisement in: Rosa Newmarch, Henry J. Wood, London and New York: John Lane, 1904. Retrieved 28 April 2020. ", "* Living Masters of MusicRosa Newmarch, The Life & Letters of Peter Ilich Tchaikovsky, London: John Lane/The Bodley Head and New York: John Lane Company, 1906. Retrieved 28 April 2020.", "* The Music of the MastersPublisher's advertisement in: Rosa Newmarch, Poetry and Progress in Russia, London and New York: John Lane, 1907. Retrieved 28 April 2020."]}, {"page": "Symphony No. 4 (Sibelius)", "response": ["In the year before beginning the symphony, Sibelius had met many of his contemporaries in central Europe, including Arnold Schoenberg, Igor Stravinsky, and others; his encounter with their music provoked a crisis in his own compositional life. He said in a letter to his friend (and biographer) Rosa Newmarch about the symphony: \"It stands as a protest against present-day music. It has absolutely nothing of the circus about it.\" Later, when asked about the symphony, he quoted August Strindberg: \"Det är synd om människorna\" (One feels pity for human beings)."]}, {"page": "Astra Desmond", "response": ["Desmond succeeded Liza Lehmann, Cécile Chaminade, Fanny Davies, Rosa Newmarch and Myra Hess as president of the Society of Women Musicians in the UK, and also president of the Incorporated Society of Musicians."]}, {"page": "Society of Women Musicians", "response": ["The group had a number of influential musicians as presidents, including Cécile Chaminade, Astra Desmond, Myra Hess, Rosa Newmarch, Evelyn Suart and Elizabeth Poston. The post of vice-president was largely honorary, and was held by woman musicians such as Nadia Boulanger, Imogen Holst, Elisabeth Lutyens, Elizabeth Maconchy and Fanny Waterman."]}]}}