{"wiki_id": "http://www.wikidata.org/entity/Q4964354", "itemLabel": "Brian Kingcome", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Kingcome", "wikipedia_page": {"main": "Group Captain Charles Brian Fabris Kingcome  (31 May 1917 – 14 February 1994) was a British flying ace of the Second World War, most notable for serving with No. 92 Squadron in 1940 during the Battle of Britain. He frequently led the squadron on a temporary basis before receiving full command early in 1941.\nKingcome later served in North Africa, Sicily, Italy and over Yugoslavia with the RAF, Royal Canadian Air Force and South African Air Force Supermarine Spitfire and heavy bomber units. His total personal score stood at eight enemy aircraft destroyed, three shared, five probable and 13 damaged. Kingcome was awarded the Distinguished Flying Cross (DFC) in 1940, a Bar to the DFC in 1941, and the Distinguished Service Order in 1942.", "link_mentions": [{"page": "The First of the Few", "response": ["Wing Commander Bunny Currant (\"Hunter Leader\")\"Wing Commander 'Bunny' Currant.\" The Telegraph, 20 March 2006. Retrieved: 17 December 2015.Reynolds, Mark. \"£80,000 auction for the RAF medals of 'Bunny' Currant, a great British hero.\" Daily Express, 19 December 2007. Retrieved: 17 December 2015. Squadron Leader Tony Bartley, Squadron Leader Brian Kingcome, Flying Officer David Fulford, Flight Lieutenant 'Jock' Gillan, Squadron Leader P. J. Howard-Williams and Flight Lieutenant J. C. 'Robbie' RobsonBowman 2015 are among the pilots and RAF Fighter Command personnel who make uncredited appearances. Some pilots seen in the early sequences did not survive to see the completed film. Jeffrey Quill is the test pilot who flies the Spitfire prototype in the scene demonstrating its ability to climb to 10,000 feet and dive at more than 500 miles per hour.\"Film Locations: 'The First of the Few'.\" South Central MediaScene. Retrieved: 17 December 2015."]}, {"page": "No. 92 Squadron RAF", "response": ["* Brian Kingcome eight kills and 3 shared destroyed, one 1 shared unconfirmed, five probables, 13 damaged"]}, {"page": "Jagdgeschwader 2", "response": ["During the winter, 1941/1942, the Stabstaffel moved from Beaumont-le-Roger to Saint-Pol-de-Léon, then to Brest–Guipavas. In February 1942, it moved eastward, to Caen, then Marck, Pas-de-Calais. I. Gruppe moved to Brest in mid-1941, before returning eastward to Caen and Marck in February 1942. II. Gruppe remained at Abbeville until the end of 1941, and then made a series of transfers similar to the other gruppen. III. Gruppe moved to Mont-de-Marsan, Bernay, Rocquancourt, Liegescourt, St. Pol-Brias, Théville and Coxyde. The purpose of the moved to the French Atlantic coast was to provide air cover for the Kriegsmarine heavy ships in dock at Brest. In February 1942 the navy executed Operation Cerberus. The Luftwaffe supported the \"Channel Dash\" with Operation Donnerkeil. 252 fighters from JG 1, JG 2 and JG 26 were ordered into the operation. The night fighter unit I./NJG 1 flew 19 sorties, protecting the ships during the night, until replaced by JG 2 at 08:00. The British aerial response began as JG 26 relieved JG 2. Successive waves of JG 2's fighters—each 16-aircraft strong—maintained a series of 30-minute vigils over the ships. Fighter Command and Fleet Air Arm forces were slow to react, but appeared just as JG 2 handed over responsibility to Gerhard Schöpfel's JG 26. Lieutenant Commander Eugene Esmonde, acting as Squadron Leader, No. 825 Squadron FAA took off with his Fairey Swordfish formation to attack the ships. Squadron Leader Brian Kingcome's No. 72 Squadron RAF offered their only protection but were overwhelmed by the German fighters. All the Swordfish were shot down and Esmonde was awarded the Victoria Cross. Only five of the original eighteen Swordfish crew survived. JG 2 made five claims, JG 26, three. The German ships claimed an exaggerated total of 10."]}, {"page": "Karl-Heinz Greisert", "response": ["The day of the operation was blustery and rainy, obscuring visibility. The German vessels slipped Brest at 9:00 pm in the dark of the evening of 11 February. Daybreak found them steaming towards the Strait of Dover. The ships were nearly through when they were finally spotted at 11:00 am. They had just cleared the straits with JG 2's period of responsibility coming to an end when the German warships came under air attack. 6 torpedo carrying Fairey Swordfish of 825 Squadron under the command of Eugene Esmonde approached at low level. The Swordfish had set off to the target alone, but by good fortune were spotted en route by 72 Squadron commanding officer Brian Kingcome, who attempted to cover them on their way in with his 10 Spitfires. Unfortunately the attack came in just as the Germans were handing off responsibilities from JG 2 to JG 26, and aircraft from both jagdgeschwader were present as Esmonde approached the force. Kingcome's escorting Spitfires were soon heavily engaged by German fighters, allowing the low cover aircraft of JG 2 to attack the Swordfish unimpeded. Greisert, flying in the low cover group, closed to attack as the force was some 10 kilometers north of Gravelines, and was credited with two Fairey Swordfish shot down."]}, {"page": "Jagdgeschwader 26", "response": ["1942 began with Galland planning and executing the air superiority plan Operation Donnerkeil to support the Channel Dash, a redeployment of two Kriegsmarine battleships and one heavy cruiser to Germany from Brest, France. JG 1, JG 2 and JG 26 were involved in the surprise operation. Schöpfel led the JG 26 element of the operation over the Dover Strait personally at the head of III. Gruppe. Fighter Command and Fleet Air Arm forces were slow to react, but appeared just as JG 2 handed over responsibility to Schöpfel. Lieutenant Commander Eugene Esmonde, acting as Squadron Leader, No. 825 Squadron FAA took off with his Fairey Swordfish formation to attack the ships. Squadron Leader Brian Kingcome's No. 72 Squadron RAF offered their only protection but were overwhelmed by the German fighters. All the Swordfish were shot down and Esmonde was awarded the Victoria Cross. Only five of the original eighteen Swordfish crew survived. Fighter Command lost eight fighters in aerial combat—401 Squadron are known to have suffered on loss against JG 26; no loss or damage in 72 Squadron was listed. In March 1942, post-war analysis credits JG 26 with 27 Fighter Command fighters destroyed; though it sustained many more unattributed losses."]}, {"page": "Geoffrey Wellum", "response": ["Wellum's close colleagues included Brian Kingcome., Curiously, in Wellum's book, Kingcome is spelled all the time as \"Kingcombe\". Wellum describes Kingcome as \"the finest fighter pilot I ever flew with\" and recommends his book A Willingness to Die"]}, {"page": "Ben Aldridge (actor)", "response": ["| Brian Kingcome"]}, {"page": "Northwest African Tactical Air Force", "response": ["| No. 244 WingIan Gleed (RAF) KIA April 16, 1943W. G. G. Duncan Smith (RAF)Brian Kingcome (RAF)"]}, {"page": "Operation Donnerkeil", "response": ["Lieutenant Commander Eugene Esmonde, acting as Squadron Leader, No. 825 Squadron FAA took off with his Fairey Swordfish formation at 12:25 to attack the ships. No. 411 and 64 Squadron were to escort the FAA but arrived over Manston 15 minutes late and missed the rendezvous. The only unit to keep to mission orders was Squadron Leader Brian Kingcome's No. 72 Squadron. Unaware of the Swordfish squadron's location, they ran into each other by fortunate accident. Owing to low cloud cover, they dropped to between 50 and 100 feet. The heavy German fighter cover put an end to the protection the Spitfire's could provide as the RAF fighters now had to look after themselves. The Spitfires and Swordfish were engaged by Fw 190s of 8 staffel and 9 staffel./JG 26 led by Gruppenkommandeur (Group Commander) Gerhard Schöpfel of III./JG 26. The Fw 190s were just relieving fighters of JG 2. Frail and slow, the Swordfish forced German pilots to lower their undercarriages to prevent overshooting the biplanes. In the event all six Swordfish were shot down. The Spitfires destroyed three Fw 190s in return. Several Swordfish managed to fire off their torpedoes but none found their mark. Lieutenant Commander Esmonde was shot down and killed by an Fw 190.Weal 1996, p. 17. He was awarded the Victoria Cross. Only five of the original eighteen Swordfish crew survived. No. 41 Squadron RAF claimed three Bf 109s (most likely from JG 1) destroyed and one damaged off the Belgian coast. No. 72 Squadron claimed three Fw 190s destroyed and four damaged in the battles around 13:00. No. 410 Squadron claimed two Bf 109s destroyed and two damaged in the same dogfights.Hooton 1994, p. 115.Weal 1996, p. 17.Foreman 2005, pp. 127–128Caldwell 1996, p. 207.Jackson 2002, pp. 56–57. The German ships consumed very little ammunition, as the action had been carried out largely by the Luftwaffe.Garrett 1978, p. 104."]}, {"page": "John Fraser Drummond", "response": ["On 5 September he was posted to 92 Squadron, serving with several legendary pilots including Bob Stanford Tuck, Brian Kingcome, Allan Wright and Geoffrey Wellum. He had been promoted flying officer on 3 September 1940."]}, {"page": "May 1917", "response": ["* Born: Jean Rouch, French filmmaker, considered the father of Nigerian cinema and a pioneer of cinéma vérité in films including Moi, un noir and Chronicle of a Summer, in Paris (d. 2004); Brian Kingcome, British air force officer, commander of No. 92 Squadron during the Battle of Britain, recipient of the Distinguished Flying Cross and Distinguished Service Order, in Calcutta (d. 1994); Billie Rogers, American jazz musician, noted for her collaborations with Woody Herman and Jerry Wald and one of the first major female musicians of the big band era, in North Plains, Oregon (d. 2014)"]}, {"page": "Kingcome", "response": ["*Brian Kingcome (1917–1994), British flying ace in World War II"]}, {"page": "List of people educated at Bedford School", "response": ["*Group Captain Brian Kingcome DSO DFC & Bar (1917–1994), Second World War flying ace"]}, {"page": "The 400 Club", "response": ["During World War II, the 400 Club was frequented by people in the armed forces. These included Battle of Britain pilots, one of whom, Brian Kingcome, recollected in his memoirs spending time at \" . . . the Four Hundred, whose dimly lit dance floor and seductive music were excellent backdrops for young men in uniform trying their luck with the 'I'm off to war tomorrow and may never come back' routine . . . \"Brian Kingcome, \"A Willingness to Die,\" Tempus Publishing Ltd, May 1 1999; also available in Kindle edition."]}, {"page": "Kingcome, Brian", "response": ["#redirectBrian Kingcome"]}]}}