{"wiki_id": "http://www.wikidata.org/entity/Q4965385", "itemLabel": "Brian Steenson", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Steenson", "wikipedia_page": {"main": "Brian Steenson was a former Grand Prix motorcycle road racer. His best season was in 1968 when he finished the year in ninth place in the 350cc world championship. In 1969, Steenson finished second to Giacomo Agostini in the Isle of Man Junior TT. He was killed while competing in the 1970 Isle of Man TT.", "link_mentions": [{"page": "1968 Grand Prix motorcycle racing season", "response": ["|  Brian Steenson"]}, {"page": "1969 Grand Prix motorcycle racing season", "response": ["|align=\"left\"|  Brian Steenson", "|  Brian Steenson"]}, {"page": "1970 Grand Prix motorcycle racing season", "response": ["|align=\"left\"|  Brian Steenson"]}, {"page": "1969 Isle of Man TT", "response": ["|  Brian Steenson"]}, {"page": "List of Isle of Man TT Mountain Course fatalities", "response": ["|  Brian Steenson"]}, {"page": "Colin Seeley", "response": ["During the late 1960s and early 1970s when almost all the major motorcycle manufacturers had pulled out of Grand Prix racing, the Seeley-designed chassis became the race bike of choice for privateer racers of the era. John Cooper won the 500cc class at the 1968 North West 200, while Brian Ball finished second to Giacomo Agostini in the Senior TT at the 1968 Isle of Man TT, both riders on a Seeley-Matchless. At the 1969 North West 200, John Blanchard and Brian Steenson placed first and second in the 500 class aboard Seeley-designed motorcycles. In the 1969 Isle of Man TT, Seeley placed four of his machines in the top ten in the Senior TT race with third, fourth, sixth and seventh-place finishes. His best result as a constructor came in 1970 when Tommy Robb rode one of his machines to a fourth-place finish in the 500cc world championship. Seeley later used other Japanese engines in his chassis, most notably using a Hi-Tac Suzuki T500 engine for Barry Sheene in 1971. Sheene used the bike to win the British national championship and declared it the best-handling motorcycle he had ever ridden."]}, {"page": "1970 French motorcycle Grand Prix", "response": ["|  Brian Steenson", "|  Brian Steenson"]}, {"page": "Steenson", "response": ["*Brian Steenson, former Grand Prix motorcycle road racer"]}, {"page": "Steenson, Brian", "response": ["#redirectBrian Steenson"]}]}}