{"wiki_id": "http://www.wikidata.org/entity/Q4960646", "itemLabel": "Brenda Chamberlain", "itemDescription": "British artist (1912-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brenda_Chamberlain_(artist)", "wikipedia_page": {"main": "Brenda Irene Chamberlain (17 March 1912 – 11 July 1971) was a Welsh artist, poet and novelist. She also wrote a memoir of 15 years spent living on Bardsey Island. She won the first two Gold Medals awarded by the National Eisteddfod of Wales in the Fine Art category, for her paintings Girl with a Siamese Cat (1951) and The Cristin Children (1953). An expatriate on the island of Hydra, Greece, from 1961 to 1967, she then returned to Wales, where she died in 1971. Her papers are preserved by the National Library of Wales; examples of her artworks are found in several collections.", "link_mentions": [{"page": "Hydra (island)", "response": ["*Brenda Chamberlain (artist) (1912-1971) Welsh artist and writer", "* A Rope of Vines: Journal from a Greek Island, Brenda Chamberlain (1965) ()"]}, {"page": "Alun Lewis (poet)", "response": ["After the outbreak of the Second World War Lewis first joined the British Army's Royal Engineers as a Private because he was a pacifist, but still wanted to fight fascism. However, he then inexplicably sought and gained a commission in an infantry battalion. In 1941 he collaborated with artists John Petts and Brenda Chamberlain on the \"Caseg broadsheets\". His first published book was the collection poetry Raider's Dawn and other poems (1942), which was followed up by a volume of short stories, The Last Inspection (1942). In 1942 he was sent to India with the 6th battalion South Wales Borderers."]}, {"page": "Aberdaron", "response": ["Dilys Cadwaladr, the former school teacher on Bardsey Island, in 1953 became the first woman to win the Crown at the National Eisteddfod for her long poem Y Llen; and artist Brenda Chamberlain twice won the gold medal for Art at the Eisteddfod; some of the murals she painted can still be seen on the walls of Carreg, her island home from 1947 to 1962. Wildlife artist Kim Atkinson, whose work has been widely exhibited in Wales and England, spent her childhood on the island and returned to live there in the 1980s.\"Enlli and the Arts\" . Bardsey Island Trust. Retrieved 16 August 2009"]}, {"page": "Bardsey Island", "response": ["Dilys Cadwaladr, a former schoolteacher on the island, in 1953 became the first woman to win the Crown at the National Eisteddfod, for her long poem Y Llen. Artist Brenda Chamberlain twice won the Gold Medal for Art at the Eisteddfod; in 1951 for Girl with Siamese Cat, and in 1953 with The Christin Children.Y Cafn : Spring 2007 : Island Artist : Brenda Chamberlain (1912-71)  Retrieved 16 August 2009 Some of the murals she painted can still be seen on the walls of Carreg, her home from 1947 to 1962. Wildlife artist Kim Atkinson, whose work has been widely exhibited in Wales and England, spent her childhood on the island and returned to live there in the 1980s.", "* Tide-race, by Brenda Chamberlain, 1962 ()"]}, {"page": "War poet", "response": ["After the outbreak of the Second World War in September 1939, Lewis first joined the British Army Royal Engineers as an enlisted man because he was a pacifist, but still wished to aid the war effort. However, he then inexplicably sought and gained an officer's commission in an infantry battalion. In 1941 he collaborated with artists John Petts and Brenda Chamberlain on the \"Caseg broadsheets\". His first published book was the collection poetry Raider's Dawn and other poems (1942), which was followed up by a volume of short stories, The Last Inspection (1942). In 1942 he was sent to British India with the South Wales Borderers."]}, {"page": "1949 in art", "response": ["* Brenda Chamberlain – The Fisherman's Return (National Museum of Wales)"]}, {"page": "Rachub", "response": ["*The artist and writer Brenda Chamberlain (1912–1971) and her husband the artist John Petts (1914–1991) lived in Rachub, where they set up the Caseg Press. "]}, {"page": "John Petts (artist)", "response": ["In 1935 Petts married the artist Brenda Chamberlain in London and the couple set up home near Llanllechid in north Wales, where they held two joint exhibitions of their art and supported themselves by creating and selling greeting cards and doing some part-time teaching in Bangor. With Chamberlain, Petts bought a hand operated printing press and set up the Caseg Press in 1937 to produce bookplates, greeting cards and prints of local scenes. Petts collaborated with the poet Alun Lewis on illustrations for a number of Welsh-language magazines before the latter died in the Second World War. At the start of the war Petts had registered as a conscientious objector and was required to undertake farm work away from Wales. Petts and Chamberlain separated in 1943 after which Petts volunteered to join a Royal Army Medical Corps Parachute Field Ambulance unit. He served in Europe and the Middle East during 1944 before transferring to the Royal Army Educational Corps. He taught art at an army college in Palestine before working as an army publications editor in Cairo. "]}, {"page": "1971 in Wales", "response": ["*11 July – Brenda Chamberlain, poet and artist, 59"]}, {"page": "1958 in Wales", "response": ["*Brenda Chamberlain – The Green Heart"]}, {"page": "Raymond Garlick", "response": ["Raymond Garlick was born on 21 September 1926 at Harlesden in London, the elder son of an employee of the National Bank; but as a child he spent holidays at his grandparents' house in Deganwy in Conwy County Borough in Wales. When he was five years old a severe illness and operation left him with a permanently disabled foot. Just before World War II he was evacuated to Gwynedd, and was educated in Llandudno at the John Bright County School, where his interest in English language and literature was encouraged. He left school at the age of fifteen. Before he went on to study English literature at Bangor University he became interested in Christian theology, considered joining the Franciscan order, and studied for the Anglican presbyterate at the Community of the Resurrection near Leeds.  At Bangor University he was taught by R. T. Jenkins, H. D. Lewis and Charles Davies, and became an admirer of the craftsmanship of the poets Dylan Thomas and Roy Campbell. He met the painter, Brenda Chamberlain, and when she separated from the artist John Petts and went to live on Bardsey island, he rented from her part of her cottage, Ty'r Mynydd."]}, {"page": "Rolf on Art", "response": ["# Brenda Chamberlain"]}, {"page": "1912 in Wales", "response": ["*17 March - Brenda Chamberlain, artist and poet (died 1971)Jill Piercy, Brenda Chamberlain: Artist and Writer (Parthian Books 2013).  "]}, {"page": "Chamberlain (surname)", "response": ["*Brenda Chamberlain (born 1952), Canadian politician", "*Brenda Chamberlain (artist) (1912–1971), Welsh artist and poet"]}, {"page": "Parthian Books", "response": ["*A Rope of Vines, Brenda Chamberlain", "*The Water-castle, Brenda Chamberlain"]}, {"page": "List of painters by name beginning with \"C\"", "response": ["*Brenda Chamberlain (1912–1971), Welsh artist, poet and novelist"]}, {"page": "56 Group Wales", "response": ["Of those invited to join, nine accepted: Trevor Bates, Hubert Dalwood, George Fairley, Arthur Giardelli, Robert Hunter, Heinz Koppel, Will Roberts, John Wright and Ernest Zobole.Rowan 1985, pp. 125–129 Brenda Chamberlain, the only female artist invited, declined.Moore 2012, pp. 7, 32."]}, {"page": "List of Welsh artists", "response": ["*Brenda Chamberlain (1912–1971), Welsh artist, working in Wales and Greece"]}, {"page": "The Welsh Group", "response": ["Former members have included major names from the field of modern Welsh art including Peter Bailey, William Brown, Brenda Chamberlain, Mary Fogg, Arthur Giardelli, Tony Goble, Bert Isaac, John Petts, David Tinker, Laurie Williams and Ernest Zobole."]}, {"page": "List of Welsh women writers", "response": ["*Brenda Chamberlain (1912–1971), artist and poet"]}, {"page": "List of women artists associated with Wales", "response": ["*Brenda Chamberlain (1912–1971), Welsh artist, working in Wales and Greece"]}, {"page": "List of Welsh women", "response": ["*Brenda Chamberlain (1912–1971), artist, poet"]}, {"page": "Llanllechid", "response": ["* Brenda Chamberlain (1912–1971) — artist"]}, {"page": "List of women writers (A–L)", "response": ["*Brenda Chamberlain (1912–1971, Wales), poet, nv. & artist"]}]}}