{"wiki_id": "http://www.wikidata.org/entity/Q4964690", "itemLabel": "Brian McDermott", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_McDermott_(rugby_league)", "wikipedia_page": {"main": "Brian G. McDermott (born 16 March 1970) is an English professional rugby league coach who is employed as head coach at Featherstone Rovers in the RFL Championship. He is a former professional rugby league player.He was previously the head coach of the Leeds Rhinos in the Super League and of the USA national team. Nicknamed 'Big Mac', McDermott was a Great Britain international forward who played his entire career at club level for Bradford Bulls, winning Super League Grand Finals and Challenge Cups with them.\nHe began his coaching career in 2003 as an assistant at Huddersfield Giants, taking his first senior coaching role with Harlequins RL in 2006, before joining Leeds as head coach in 2010. McDermott coached Leeds to several major trophies including the 2011, 2012, 2015 and 2017 Super League titles, the 2012 World Club Challenge, and the 2014 and 2015 Challenge Cups.", "link_mentions": [{"page": "Huddersfield Giants", "response": ["In 2003 under Smith, Huddersfield established themselves as a Super League club, finishing 10th, above Wakefield Trinity and Halifax. After guiding Huddersfield back to Super League, Smith and assistant coach Brian McDermott moved onto Headingley to take control of Leeds. St Helens assistant coach and former Hull forward Jon Sharp was appointed head coach for 2004 and the team improved again, finishing 7th in the league and making their first appearance in the Challenge Cup semi-finals since 1971."]}, {"page": "London Broncos", "response": ["On 8 July 2006, Ian Lenagan removed Tony Rea as head coach, and moved him \"upstairs\" to a position on the club's board of directors. In his place, Brian McDermott, an assistant coach at Leeds Rhinos, was appointed as head coach. Results at home improved, taking Harlequins RL to 7th place in Super League XI. ", "*  Brian McDermott: 2006–2010"]}, {"page": "United States national rugby league team", "response": ["Following the World Cup, the national team was put on hiatus while the governance dispute between the AMNRL and the USARL was resolved. The team subsequently lost the right to automatic qualification for the 2017 Rugby League World Cup. In November 2014, stewardship of the national team was transferred to the USARL, and the team was rebranded from Tomahawks to Hawks. Brian McDermott was subsequently appointed head coachBrian McDermott to coach USA Hawks and his first job was to help the USA re-secure the World Cup qualification that they first won four years earlier. The team performed the qualification tournament, held in the US, in December 2015. The team qualified for their second consecutive World Cup after winning both their matches.", "| align=left  | Brian McDermott ", "| align=left  | Brian McDermott "]}, {"page": "Mac Diarmada", "response": ["* Brian McDermott (disambiguation), several people", "** Brian McDermott (rugby league), rugby coach", "** Brian McDermott (footballer), football manager of Reading F.C.", "** Brian McDermott (murder victim), child who was murdered in Belfast in 1973"]}, {"page": "Joe Vagana", "response": ["Despite competition from other Super League and Australian clubs, Vagana signed for the Bradford Bulls in 2001. He became one part of the Bradford Bulls' Awesome Foursome, a phrase coined by the media, alongside Stuart Fielden, Brian McDermott and Paul Anderson. Vagana played for the Bradford Bulls at prop forward in their 2001 Super League Grand Final victory against the Wigan Warriors. As Super League VI champions, the Bradford Bulls played against 2001 NRL Premiers, the Newcastle Knights in the 2002 World Club Challenge. Vagana played as a prop forward in Bradford's victory. He also played for Bradford at prop forward in their 2002 Super League Grand Final loss against St. Helens. Vagana played for the Bradford Bulls at prop forward in their 2003 Super League Grand Final victory against the Wigan Warriors. Having won Super League VIII, Bradford played against 2003 NRL Premiers, the Penrith Panthers in the 2004 World Club Challenge. Vagana played from the interchange bench in the Bradford Bulls' 22–4 victory. He also played for Bradford at prop forward in their 2004 Super League Grand Final loss against the Leeds Rhinos. Vagana played for the Bradford Bulls from the interchange bench in their 2005 Super League Grand Final victory against the Leeds Rhinos."]}, {"page": "Stuart Fielden", "response": ["Stuart made his Bradford Bulls début against his hometown club Halifax in May 1998. He played for them at front row forward in the 1999 Super League Grand Final which was lost to St. Helens. Fielden made rapid progress alongside experienced props Joe Vagana, Brian McDermott and Paul Anderson, and was named Super League's young player of the year in 2000."]}, {"page": "Tony Rea", "response": ["On 8 July 2006, after a disappointing run of form for the team, the Harlequins Rugby League club announced a re-organisation of the coaching set-up.  Rea was replaced as head coach by Leeds Rhinos' assistant coach Brian McDermott, but was appointed onto the club's board of directors."]}, {"page": "Sean Rutgerson", "response": ["Rutgerson was appointed assistant coach of the USA national team under Brian McDermott in 2015,McDermott lands USA head coach role eventually taking over from McDermott as head coach in 2018."]}]}}