{"wiki_id": "http://www.wikidata.org/entity/Q4964623", "itemLabel": "Brian Masters", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Masters", "wikipedia_page": {"main": "Brian Masters (born 1939) is a British writer, best known for his biographies of serial killers. He has also written books on French literature, the British aristocracy, and theatre, and has worked as a translator.\n\n", "link_mentions": [{"page": "Marie Corelli", "response": ["Corelli avoided being seen in public, and according to biographer Brian Masters, was possessed of a \"positive terror of being photographed\". She finally allowed a photograph of herself to be published as the frontispiece of her 1906 novel Treasure of Heaven, though it was apparently airbrushed to depict her as \"a sweet young lady in her early twenties\". Around the same time, Mark Twain wrote the following description of Corelli's appearance in his diary during a visit to Stratford:"]}, {"page": "James Bolam", "response": ["In 2002, Bolam played the serial killer Harold Shipman in Shipman, the ITV adaptation of Brian Masters' book on the case, Prescription for Murder b and Father Leonard Tibbings in Dalziel and Pascoe (Ser. 7, Ep. 1 'Sins of the Fathers'). He portrayed Harold Wilson, the former Prime Minister, in the 2006 BBC documentary The Plot Against Harold Wilson. He appeared in Frank Loesser's musical How to Succeed in Business Without Really Trying at the Chichester Festival Theatre during the 2005 summer season. He played the role of Grandpa in the Cbeebies show Grandpa in My Pocket. In 2009 he played Ken Lewis, CEO of the Bank of America, in the television dramatisation The Last Days of Lehman Brothers."]}, {"page": "Masters (surname)", "response": ["*Brian Masters (born 1939), British writer", "*Brian Masters (bishop) (1932–1998), Church of England bishop"]}, {"page": "Sibyl Colefax", "response": ["* Great Hostesses by Brian Masters. Constable, London, 1982."]}, {"page": "CWA Gold Dagger for Non-Fiction", "response": ["*Brian Masters, Killing for Company \t"]}, {"page": "Prion Humour Classics", "response": ["|  Brian Masters"]}, {"page": "Jason Watkins", "response": ["| Brian Masters"]}, {"page": "Killing for Company", "response": ["* Killing for Company: The Case of Dennis Nilsen, a book by Brian Masters"]}, {"page": "St Dunstan's College", "response": ["The festival was quickly dubbed 'The Edinburgh Festival of South London' and comprised over twenty main events and 'a rich and enterprising fringe'. The 1994 college Chronicle describes the festival as 'catering for the souls' and it contained an array of eclectic events including the St Dunstan's jazz group, lectures given by writers Brian Masters and Gwendoline Butler, and a Shakespeare play with a twist, entitled 'A Pocket of Midsummer Night's Dream'."]}, {"page": "Masters, Brian", "response": ["#redirectBrian Masters"]}, {"page": "Radio Lives", "response": ["|Brian Masters"]}, {"page": "Des (TV series)", "response": ["* Jason Watkins as biographer Brian Masters"]}]}}