{"wiki_id": "http://www.wikidata.org/entity/Q4960680", "itemLabel": "Brenda Gibbs", "itemDescription": "Australian politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brenda_Gibbs", "wikipedia_page": {"main": "Brenda Gibbs (née Coombs; born 3 September 1947) is an Australian politician. Gibbs was elected to the Australian Senate for Queensland in 1996, representing the Australian Labor Party. Her first term began on 1 July 1996, she was not re-elected at the 2001 Australian federal election, and her term expired on 30 June 2002.\nGibbs' husband Bob Gibbs had been a Queensland ALP Minister for all but two years between 1989 and 1999 and had a stint as Queensland ALP President in 1995.", "link_mentions": [{"page": "Women in the Australian Senate", "response": ["|Brenda Gibbs \t", "  from:1996 till:2002 color:AL text:\"Brenda Gibbs (1996–2002)\""]}, {"page": "Candidates of the 2001 Australian federal election", "response": ["#Brenda Gibbs"]}, {"page": "Candidates of the 1996 Australian federal election", "response": ["#Brenda Gibbs*"]}, {"page": "Candidates of the 1998 Australian federal election", "response": ["Six seats were up for election. The Labor Party was defending two seats. The Liberal Party was defending two seats. The National Party was defending one seat. The Australian Democrats were defending one seat. Senators Andrew Bartlett (Democrats), Ron Boswell (National), Brenda Gibbs (Labor), John Herron (Liberal), John Hogg (Labor) and Ian Macdonald (Liberal) were not up for re-election."]}, {"page": "Bob Gibbs (Australian politician)", "response": ["Gibbs' wife Brenda Gibbs served as a Senator in the Federal Parliament between 1996 and 2002."]}, {"page": "Results of the 1998 Australian federal election (Senate)", "response": ["| Brenda Gibbs"]}, {"page": "Results of the 1996 Australian federal election (Senate)", "response": ["| Brenda Gibbs"]}, {"page": "List of senators from Queensland", "response": ["|rowspan=5|Brenda Gibbs(Labor)"]}, {"page": "List of British champions in high jump", "response": ["|Brenda Gibbs"]}]}}