{"wiki_id": "http://www.wikidata.org/entity/Q4964796", "itemLabel": "Brian Moore", "itemDescription": "British sports commentator and presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Moore_(commentator)", "wikipedia_page": {"main": "Brian Baden Moore (28 February 1932 – 1 September 2001) was an English football commentator and television presenter who covered nine World Cups and more than twenty Cup finals.", "link_mentions": [{"page": "Brian Clough", "response": ["That week, Clough, as a television football pundit, memorably called Poland goalkeeper Jan Tomaszewski a \"circus clown in gloves\" before the crucial World Cup qualifier with England at Wembley. The match, which England had to win in order to qualify for the 1974 World Cup finals, ended 1–1, and Tomaszewski made numerous magnificent saves, some of them unconventionally, to ensure his nation qualified for the finals at England's expense. When commentator Brian Moore said \"You call him a clown, Brian, but he saved his side\", Clough insisted \"Would you want him in your team every week?\""]}, {"page": "Gillingham F.C.", "response": ["The Gills have played at Priestfield Stadium throughout their existence.  The ground was originally purchased by the founders of the club through an issue of 1,500 £1 shares. Sources differ on whether the ground was named after the road on which the land stood, Priestfield Road, or whether the road was named after the ground; if the latter is the case then the origin of the ground's name is unknown. The ground was extensively developed prior to the 1930s, but there was then little change until the late 1990s and the arrival of Paul Scally as chairman. Three of the four stands were demolished and rebuilt between 1995 and 2000. The fourth stand, known as the Town End, was demolished to make way for a new stand, to be named the Brian Moore Stand after television sports commentator Brian Moore, who was a well-known Gills fan, but the club's financial situation has not allowed the new stand to be built.  A temporary stand was erected in 2003 and remains in place as of 2021.  From 2007 until 2010 the stadium was officially named KRBS Priestfield Stadium as part of a sponsorship deal with the Kent Reliance Building Society.  In 2011 it was rebranded again, this time, to MEMS Priestfield Stadium under another such agreement.", "*Brian Moore's Head Looks Uncannily Like London Planetarium – webzine devoted to the club, which previously existed from 1988 to 2006 as a paper fanzine. Named in honour of the club's most famous supporter, the late commentator Brian Moore."]}, {"page": "London Weekend Television", "response": ["The Sports Department at LWT featured programmes such as World of Sport which ran for 20 years on a Saturday afternoon and was billed as ITV's answer to BBC1's Grandstand. Other shows included Saint and Greavsie, On the Ball, and The Big Match (renamed The Match between 1988 and 1992). The latter two shows were hosted for many years by ITV's main football commentator Brian Moore."]}, {"page": "List of sports announcers", "response": ["* Brian Moore – BBC Radio 1961–1968, ITV Sport 1968–1998, Talksport 1999–2001", "* Brian Moore – BBC Sport 2002–present, talkSPORT 2011, 2013–present, BBC Radio 5 Live 2015"]}, {"page": "Kevin Keegan", "response": ["In 1979 Keegan and his wife, participated with ITV's \"Brian Moore meets Kevin Keegan,\" documentary filmed over the season at the family's Hamburg home and during his personal business appearances, including in France, as an insight and rare glimpse into the life of a modern millionaire footballer, away from the pitch.First broadcast on ITV in 1979 \"Brian Moore meets Kevin Keegan\" sports documentary. Re-broadcast on 30 December 2020 on ITV4."]}, {"page": "Gillingham, Kent", "response": ["*Brian Moore – sport commentator and journalist"]}, {"page": "Talksport", "response": ["The new line-up involved a number of presenters and commentators, including Alan Brazil, Mark Nicholas, Chris Cowdrey, Geoffrey Boycott, Mike Parry, Peter Shilton, Brian Moore, Brough Scott, Tom Watt, Gary Newbon, Ian Darke, Tony Banks, and Alvin Martin.", "* September 2011: Talksport broadcast the 2011 Rugby World Cup, with exclusive commentary of all 48 matches in New Zealand. Commentary was provided by John Taylor, Rupert Bell, John Anderson, Russell Hargreaves and Andrew McKenna with punditry from Brian Moore, Jeff Probyn, David Campese, Chris Sheasby, Michael Owen, Scott Quinnell, Gavin Hastings, and Paul Wallace, with presentation from Mark Saggers and Mike Bovill. Additional reporting from Roger Hughes, David Brady, and Stuart CamerontalkSPORT unveil Rugby World Cup plan Radio Today, 8 August 2011"]}, {"page": "2001–02 in English football", "response": ["*1 September 2001: Brian Moore, 69, former BBC Radio and ITV commentator, died of cancer three years after retiring from football commentary."]}, {"page": "Ron Atkinson", "response": ["Atkinson was already working as a pundit for ITV Sport and after leaving management he continued in this role. For a number of years he covered most of the channel's live matches, sometimes as a studio guest, but more often as the \"ex-football insider\" member of a two-man commentary team. His commentaries with Brian Moore and then Clive Tyldesley provided the basis for the 1990s and early-2000s ITV Champions League nights. He was also the main co-commentator for ITV's coverage of the European Championships and the World Cup during this period. He also fronted two series of Extra Time With Ron Atkinson for Central ITV with Ron interviewing football personalities like Kevin Keegan, Terry Venables and Martin O'Neill."]}, {"page": "Don Revie", "response": ["After two years of living in Surrey, in the Spring of 1986 Revie moved to Kinross, Scotland, where he intended to retire, but he was diagnosed with motor neurone disease in May 1987. Revie publicly announced his illness in August of that year, and made his final public appearance on 11 May 1988 at Elland Road in a wheelchair, at a charity football match held to raise money for research into motor neurone disease. He died in his sleep in Murrayfield Hospital in Edinburgh on 26 May 1989, aged 61, and was cremated four days later at Warriston Crematorium in Edinburgh. Though his funeral was well attended by representatives of Leeds United and many others involved in football such as Kevin Keegan, Brian Moore, Lawrie McMenemy, Denis Law and Alex Ferguson, The Football Association did not send any officials to the funeral."]}, {"page": "Brian Moore", "response": ["Brian Moore may refer to:", "* Brian Moore (footballer, born 1933) (1933–2006), association football player from Northern Ireland", "* Brian Moore (footballer, born 1938), English footballer", "* Brian Moore (soccer), retired American soccer midfielder", "* Brian Moore (rugby league) (1944–2014), Australian rugby league footballer and coach", "* Brian Moore (rugby union) (born 1962), English rugby union footballer and commentator", "* Brian Moore (political activist) (born 1943), Socialist Party USA and Liberty Union Party nominee for president", "* Brian Moore (Iowa politician) (born 1962), member of the Iowa House of Representatives", "* Brian Moore (novelist) (1921–1999), Northern Irish novelist and screenwriter", "*Brian Moore (commentator) (1932–2001), British sports commentator and television presenter", "* Brian Moore (scientist) (born 1946), professor of auditory perception", "* Brian Moore (police officer) (born 1959), former of the UK Border Force, former Chief Constable of Wiltshire Police, England", "* Brian Moore, American police officer who was shot in 2015; see shooting of Brian Moore"]}, {"page": "Mike Bassett: England Manager", "response": ["*Alan Green, Brian Moore, Clive Tyldesley and Martin Tyler are commentators on England games."]}, {"page": "Brian Moore's Head Looks Uncannily Like London Planetarium", "response": ["Brian Moore's Head Looks Uncannily Like London Planetarium was a fanzine devoted to Gillingham F.C.", "It took its title from a line in the Half Man Half Biscuit song \"Dickie Davies Eyes\". Brian Moore was formerly a director of the club, and in the absence of any other notable supporters it was decided to honour him in the title.Glanville, Brian. \"Brian Moore\". The Guardian, 4 September 2001. Archived on 2008-10-05.\"Brian Moore\". The Telegraph, 22 November 2001. Archived on 2008-10-05.Goodbody, John. \"Moore takes his final bow with controlled emotion\", The Times (London), 9 June 1998. p. 50", "* Brian Moore's Head Looks Uncannily Like London Planetarium"]}, {"page": "Alan Brazil", "response": ["In the late 1990s, Brazil joined radio station Talk Radio to present evening sports programming, titled \"It's Just Like Watching Brazil\". When the station became Talk Sport in early 2000, he became co-presenter on the weekday 610am programme. The show has since been renamed the 'Alan Brazil Sports Breakfast'. He has had various co-presenters over the years, including Mike Parry, Graham Beecroft and Ronnie Irani. Since Irani left the show in 2013, there has been a variety of co-presenters including Matt Holland, Ray Parlour, David Ginola, Dominic Cork, Neil Warnock and Brian Moore."]}, {"page": "Cranbrook School, Kent", "response": ["* Brian Moore, football commentator"]}, {"page": "Après Match", "response": ["The show mocks famous, mostly Irish, soccer stars and pundits including Bill O'Herlihy, Eamon Dunphy, Johnny Giles, Liam Brady, Frank Stapleton, Colm Murray, Graeme Souness, Jackie Fullerton and Pat Jennings as well as pundits from the British channels, including Richard Keys, Andy Gray, Jamie Redknapp, Gary Lineker, Alan Hansen, Des Lynam, Jimmy Hill, Gordon Strachan, Terry Venables, Ian St John, Jimmy Greaves, Trevor Brooking, Brian Clough, Kevin Keegan, Barry Davies, David Coleman, Brian Moore and Gabby Logan. They also mock Irish television and radio personalities such as Marian Finucane, Miriam O'Callaghan, Vincent Browne, Tom McGurk, David McWilliams, Brent Pope, George Hook, Joe Duffy, Pat Kenny and Gerry Ryan. As of 2010, they have added politicians such as Brian Cowen, Brian Lenihan and Joan Burton to their repertoire. The Après Match team have sold-out venues all over Ireland including Vicar Street, the Olympia Theatre and the Gaiety Theatre."]}, {"page": "Peter West", "response": ["He was educated at Cranbrook School as were his fellow commentators Barry Davies and Brian Moore."]}, {"page": "Barry Davies", "response": ["Davies was born in London and was educated at Cranbrook School in Cranbrook, Kent – which also numbers commentators Brian Moore and Peter West amongst its alumni – and King's College London, where he read Dentistry, although contrary to what has often been reported he never qualified or practised as a dentist. He says in his autobiography that his original aim was to become a doctor, but although he did well in his school exams, he didn't quite get the grades required to win a university place to read medicine. Dentistry was therefore a second choice that he \"soon came to regret\" and eventually he \"flunked out\" due to spending too much time playing and watching sport.", "His spell with ITV continued for another three years, providing commentaries for ABC and Granada Television. Davies also covered the 1968 Olympic Games in Mexico City, commentating on a number of sports. When LWT launched in 1968, he was the choice of the Deputy Head of Sport John Bromley to commentate on and present their new football show The Big Match. Bromley's boss Jimmy Hill won the argument though and installed his choice, Brian Moore, in the role that he would fill for the next thirty years (Moore had commentated on the 1966 World Cup Final for BBC radio), although Davies and Moore both claimed to have been unaware of this until many years later."]}, {"page": "Priestfield Stadium", "response": ["The fourth side of the ground was redeveloped in 2003 when the Town End terracing was removed and a temporary stand put in its place, named after the late football commentator and Gillingham supporter Brian Moore.  It was hoped that work would begin on a permanent Brian Moore Stand in 2004, but due to talk of relocating the club to a new ground and the club's current financial problems, this has been put on hold.", "The pitch is surrounded by four all-seater stands – the Medway Stand, the Rainham End, the Gordon Road Stand and the Brian Moore Stand. All are covered with the exception of the Brian Moore Stand.  The Medway Stand, which replaced the old Main Stand and part of the terracing at each end, is the largest and northernmost of the four. It has two tiers with a row of twenty executive boxes between the top and bottom tier. The stand also contains the changing rooms, physiotherapy facilities, club offices and club shop. The Rainham End, located behind the goal at the eastern end of the pitch, opened in 1999 and houses 2,400 fans.  This stand, like the terrace it replaced, is known for housing the club's most vocal supporters. The Gordon Road Stand, which seats 2,600, was opened in 1997 and is opposite the Medway Stand.  Due to planning requirements, the stand had a height restriction placed upon it, making it significantly lower than the other three sides of the ground, and due to the road layout behind it is narrower at one end than the other. A gantry for television cameras is located on the roof of this stand.", "Opposite the Rainham End is the Brian Moore Stand.  This stand is a temporary one, and accommodates visiting supporters. It occupies the site of the former Town End terracing, which was unusual in that it had a pronounced slope, with one end of the terracing being higher up than the other.  In 1955 the pitch, which previously sloped at that end of the stadium, was levelled out but the gradient of the Town End was left unchanged.", "thumb|right|300px|The current Brian Moore Stand, at the Gillingham end of the stadium, has been constructed on a temporary basis only."]}, {"page": "Martin Tyler", "response": ["Throughout the 1980s, Tyler established himself as the ITV network's number two commentator behind Brian Moore. He led the team at the 1984 European Championships and also described all the main matches at the 1986 World Cup – except the final, for which Moore flew out from London (the first time he had ever commentated on a World Cup match for ITV, having previously worked from London as anchorman). From 1983 ITV began to show live Football League matches, with Tyler involved in several such broadcasts over the next seven years."]}, {"page": "Peter Brackley", "response": ["The summer of 1982 saw Brackley make the switch to television, initially with ITV company Central Independent Television replacing Hugh Johns. During his initial spell with the network he covered the 1986 FIFA World Cup and the European Championship in France in 1984 – including commentaries on semi-final matches in both tournaments. His first live match for ITV Sport was the First Division contest between Manchester United and Sheffield Wednesday in April 1986. He also stepped into the breach during the live broadcast of the 1986 European Cup Final between Barcelona and Steaua Bucharest alongside that night's ITV studio co-pundit, Ron Atkinson, when communication with the commentary team in Seville, Brian Moore and Kevin Keegan, was lost.", "In 1988 Brackley left ITV. Still stuck behind Brian Moore, Martin Tyler and Alan Parry in the pecking order he made the move to Rupert Murdoch's Sky Television. The bulk of his work would be for the pan-European channel Eurosport, then part-owned by Sky. He led their commentary team at the 1990 FIFA World Cup in Italy, with Ian Darke, Paul Dempsey and Gary Bloom among his colleagues. Brackley was also behind the mic for Sky's first live matches, which came in the Zenith Data Systems Cup."]}, {"page": "World of Sport (British TV programme)", "response": [":12:20 On The Ball - football preview with Brian Moore and in later years Ian St. John and Jimmy Greaves."]}, {"page": "List of British football commentators", "response": ["|Brian Moore"]}, {"page": "Derek Dougan", "response": ["In 1967, Dougan represented Leicester City on the television show Quizball. A fan of psychedelic rock, he cut his own single, A Goal for Dougie, in 1968. In 1969 published his first autobiography, Attack!. His media appearances became more frequent in the 1970s, and he was asked to make up part of ITV's four man panel to provide coverage of the 1970 FIFA World Cup, along with Malcolm Allison, Pat Crerand and Bob McNab. Presenter Brian Moore said that the panel \"gave football punditry a fresh intoxicating sparkle\". Dougan went on to host a half-hour show on BBC Radio Birmingham, which previewed the weekend's football. He published a second autobiography, The Sash He Never Wore, in 1972 (in 1997, he republished the book under the name The Sash He Never Wore – 25 Years On)."]}, {"page": "Alan Parry", "response": ["From 1981 he largely relinquished his radio football commentary to commentate for Match of the Day on BBC television. In 1985, he left the BBC to join ITV, initially as an athletics commentator after the commercial channel won the rights to cover British athletics. However, by the late 1980s, Parry had also become a key football commentator for the network, and in 1990, Parry was Brian Moore's number two at the World Cup – this was a role he would retain until he left the network. As well as covering national football and athletics, Parry was also heavily involved on a regional level, being Central's lead commentator for a number of years. Between 1992 and 1996, the ITV regions held the rights to live coverage of the Football League, and Parry commentated on a live match almost every Sunday for the Central region."]}, {"page": "Clive Tyldesley", "response": ["Clive Tyldesley (born 21 August 1954) is an English television sports broadcaster. Until he was replaced by Sam Matterface in 2020, he was ITV's senior football commentator since the retirement of Brian Moore following the 1998 World Cup final. In that role, he has led the ITV commentary team at the subsequent four World Cups and four European Championships, and been lead commentator on the last 17 UEFA Champions League finals and a commentator on nine FA Cup finals for ITV. He won the prestigious Royal Television Society Sports Commentator of the Year in 1998, 2000, 2002 and 2005, and was voted the Sony Radio Awards' Sports Broadcaster of the Year in 1983."]}, {"page": "Gerald Sinstadt", "response": ["Sinstadt covered four World Cups for ITV, from 1970 in Mexico to 1982 in Spain, with the main matches he covered including the live 1978 third-place play-off between Brazil and Italy, and the 1982 semi-final between France and West Germany. He was also part of the ITV team at the European Championships in Italy in 1980. Sinstadt was ITV's number three commentator behind Brian Moore and Hugh Johns, covering the UEFA Cup finals in 1974 and 1976 and the 1978 League Cup Final replay between Nottingham Forest and Liverpool in 1978. "]}, {"page": "2001 in the United Kingdom", "response": ["* 1 September – Brian Moore, sports commentator (born 1932)"]}, {"page": "John Helm (commentator)", "response": ["When ITV's regional system of football coverage was largely abolished in 1983, Helm found himself fourth in the network pecking order covering matches for The Big Match and Midweek Sports Special. Martin Tyler and Peter Brackley were chosen above him to cover UEFA Euro 1984 in France, while Brian Moore headed for South America to cover the concurrent England tour of the continent."]}, {"page": "Look-in", "response": ["Introduced mainly as a vehicle for children to find out what was on ITV, it included highlight listings for each ITV region, of programmes likely to appeal to its target market, but Look-in also spotlighted popular children's topics and pastimes of the day. Skateboarding, BMX and YoYoing were all featured in the magazine. Although primarily a television magazine, it also often featured articles on sport such as On The Ball with Brian Moore, as well as science articles written by Peter Fairley. DJ Ed Stewart became a regular face in Look-in, appearing in the first issue in a feature about a day in his life, he was later given his own pages called Stewpot's Newsdesk which ran until 1980. Alan Fennell, who edited Look-in, wrote episodes for most of Gerry Anderson's series."]}]}}