{"wiki_id": "http://www.wikidata.org/entity/Q4963826", "itemLabel": "Brian Gayle", "itemDescription": "English footballer (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Gayle", "wikipedia_page": {"main": "Brian Wilbert Gayle (born 6 March 1965) is an English former professional footballer who played as a central defender.Gayle began his career at Wimbledon as an apprentice, signing a full contract in October 1984. He spent time with New Zealand club Napier City Rovers before breaking into the first team. He helped Wimbledon to the sixth round of the 1987–88 FA Cup, which the club ultimately won, but was given a red card for a foul on Malcolm Allen in the match, against Watford, and did not feature in later rounds. In July 1988, Gayle joined Manchester City for £325,000.He was transferred to Ipswich Town for £330,000 in January 1990, and then joined Sheffield United in a £750,000 deal in September 1991. While at the Blades, in 1992, Gayle scored an own goal in a match against local rivals Leeds United, which led to a 2–3 defeat. This, coupled with Manchester United losing to Liverpool, gave Leeds the First Division title.", "link_mentions": [{"page": "Dennis Wise", "response": ["He was a member of the infamous Wimbledon \"Crazy Gang\" that reached the 1988 FA Cup Final. On 12 March 1988, he provided the free-kick from which Brian Gayle headed in the clinching goal against Watford to secure passage to the semi-finals of the FA Cup. In Wimbledon's semi-final match against Luton Town on 9 April, he scored the winner as they reached the final with a 2–1 victory. In the final on 14 May, he played an influential role in defeating heavy favourites Liverpool at Wembley, containing winger John Barnes and supplying the cross from a free kick from which Lawrie Sanchez headed home the winning goal. Wimbledon were unable to compete in the 1988–89 European Cup Winners' Cup, due to the ongoing ban on English teams from European competitions, following the actions of a group of Liverpool supporters in the 1985 European Cup Final Heysel disaster."]}, {"page": "1992–93 FA Premier League", "response": ["| Brian Gayle"]}, {"page": "Mean Machine (film)", "response": ["The film included actors who had formerly played professional football, including three players who were teammates with the film's star, Vinnie Jones, at different times in their careers. Charlie Hartfield (prisoners' team in the film) played with Jones for Sheffield United, while Paul Fishenden and Brian Gayle (guards' team in the film) played with Jones for Wimbledon. Nevin Saroya (prisoners' team) was once a Brentford youth team player and Perry Digweed (guard's team), played as a goalkeeper primarily for Brighton & Hove Albion, although in the film, he is a defender. Ryan Giggs, then playing for Manchester United and the Wales national football team, appears briefly (at minute 77:00) as a warden."]}, {"page": "1993–94 FA Premier League", "response": ["| Brian Gayle"]}, {"page": "List of Sheffield United F.C. players", "response": ["| Brian Gayle"]}, {"page": "1991–92 Ipswich Town F.C. season", "response": ["| Brian Gayle"]}, {"page": "1991–92 Sheffield United F.C. season", "response": ["|Brian Gayle"]}, {"page": "1997–98 Bristol Rovers F.C. season", "response": ["| Brian Gayle"]}, {"page": "Gayle, Brian", "response": ["#redirectBrian Gayle"]}]}}