{"wiki_id": "http://www.wikidata.org/entity/Q4961007", "itemLabel": "Brendan McVeigh", "itemDescription": "Gaelic football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Brendan_McVeigh", "wikipedia_page": {"main": "Brendan McVeigh is a Gaelic football player from County Down, Northern Ireland. He plays for the Down senior inter county football team and for his club An Ríocht as a goalkeeper. McVeigh made his first start in 2005 against Tyrone he also played Midfield in the 2005 Championship, scoring a point.\nHe played in the 2010 All-Ireland Football Final in which Down were defeated 0-15 to 0-16 by Cork.In October 2010, McVeigh was named as the goalkeeper in the 2010 All Star football team for his performances for Down during the 2010 season; it was his first All Star Award. In November 2010, McVeigh was also named in the 2010 GPA Gaelic Football Team of the Year.", "link_mentions": [{"page": "List of All Stars Awards winners (football)", "response": ["| GK || 20px|border Brendan McVeigh || Down || 1"]}, {"page": "GPA Gaelic Team of the Year", "response": ["Brendan McVeigh (Down), Charlie Harrison (Sligo), Michael Shields (Cork), Philly McMahon (Dublin),"]}, {"page": "2010 All-Ireland Senior Football Championship Final", "response": ["Ciarán Sheehan of Cork's goal-bound effort was saved by Brendan McVeigh, Down's goalkeeper, in the first minute. Down were leading by 0-7 to 0-2 after 27 minutes. Cork's two points in this period included a free taken by Daniel Goulding. In the 32nd minute Goulding was also the player to score Cork's first point from open play. Cork's Donncha O'Connor also contributed to reducing the gap between the sides as half-time approached. At half-time Cork were behind by three points, having scored 0-5 to Down's 0-8.", "|1 || Brendan McVeigh"]}, {"page": "2010 Down county football team season", "response": ["| Brendan McVeigh || James Colgan || Mark Doran"]}, {"page": "2011 Down county football team season", "response": ["Michael Magee, John Clarke, Martin Clarke, Brendan McVeigh, Ronan Murtagh, Peter Fitzpatrick, Luke Howard, Kalum King, Conor Maginn, Gerard McCartan, Kevin McKernan Cathal Murdock, Aidan Carr, Paul McPolin, Paul McComiskey, Aidan Brannigan, Conor Laverty, Dan Gordon, Liam Doyle, Conor Poland, Mark Poland, Brendan Coulter, Ronan Sexton, Colm Murney, Daniel Hughes, Declan Alder", "Declan Alder, Aidan Branagan, Aidan Carr, Martin Clarke James Colgan, Brendan Coulter, Mark Doran, Liam Doyle, Kevin Duffin, Peter Fitzpatrick, Conor Garvey, Dan Gordan, Michael Magee, Conor Maginn, Kevin McKernan, Anton McArdle, Brendan McArdle, John McAreavey, Daniel McCartan, Eoin McCartan, Gerard McCartan, Paul McComiskey, Paul McPolin, Brendan McVeigh, Cathal Murdock, Sean Murdock, Paul Murphy, Ronan Murtagh, Darren O'Hagan, Conor Poland, Mark Poland, Damien Rafferty, Ambrose Rodgers, Declan Rooney, Caolan Mooney"]}, {"page": "An Ríocht GAC", "response": ["The Senior Football team are in Division 2 and play in the Down Senior Football Championship. An Ríocht is regularly represented on Down GAA teams. In 2010 three An Ríocht players started on the Down team which lost the All-Ireland Final to Cork - Brendan McVeigh, Martin Clarke and John Clarke, while James Colgan was a member of the 2010 Down panel. Brendan McVeigh and Martin Clarke also picked up GAA GPA All Stars Awards in 2010.", "* Brendan McVeigh, former Down goalkeeper and 2010 All Star"]}, {"page": "2012 Down county football team season", "response": ["Brendan McVeigh Gk,", "Brendan McVeigh,", "Brendan McVeigh,"]}, {"page": "2014 Down county football team season", "response": ["* On Wednesday 8 August, former All Star goalkeeper Brendan McVeigh announced his retirement from intercounty football."]}, {"page": "Down county football team", "response": ["* Brendan McVeigh, An Ríocht, All Ireland winner & All Star in 2010. Down GAA First division winner 2007. Only Down keeper to ever win an all star.", "* 2010: Brendan McVeigh, Daniel Hughes, Martin Clarke, Benny Coulter"]}]}}