{"wiki_id": "http://www.wikidata.org/entity/Q4961067", "itemLabel": "Brendan Patricks", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Brendan_Patricks", "wikipedia_page": {"main": "Brendan Patricks (born 3 December 1980) is a British actor and magician from Reading, England. He is well known for playing the role of \nEvelyn Napier in Downton Abbey.\nPatricks was born in Reading to an Irish father and English mother, and attended the University of Hull before training at the London Academy of Music and Dramatic Art. Besides acting, he is in a magic double act with comedian Nick Mohammed.After graduating from drama school he has worked in theatre and made his TV debut in The Curse of King Tut's Tomb.", "link_mentions": [{"page": "Evelyn (name)", "response": ["*Evelyn Napier, a character from Downton Abbey, portrayed by Brendan Patricks"]}, {"page": "Progress Theatre", "response": ["*Brendan Patricks, a London based magician and actor from Downton Abbey."]}, {"page": "The Curse of King Tut's Tomb (2006 film)", "response": ["* Brendan Patricks as Brian Eastcliff, a British aristocrat who joins Fremont in his expedition."]}, {"page": "Cultural depictions of Winston Churchill", "response": ["* The Professor and the Madman (2019) – Brendan Patricks"]}, {"page": "List of British films of 2009", "response": ["||My Last Five Girlfriends||Julian Kemp||Brendan Patricks, Naomie Harris|| Comedy|| 19 March||"]}, {"page": "My Last Five Girlfriends", "response": ["My Last Five Girlfriends, a 2009 film from Julian Kemp starring Brendan Patricks, is a British dark comedy based on pop-philosopher Alain De Botton's book, Essays In Love (U.S. title On Love).", "After yet another failed relationship, 30-something Duncan (Brendan Patricks) decides to quiz his last five girlfriends to find out what went wrong in order to figure out how to find love. With advice from bizarre sources and intense flights of fancy, finally Duncan realises that love is a battleground where only the fittest can survive.", "* Brendan Patricks as Duncan"]}, {"page": "List of Downton Abbey characters", "response": ["| Brendan Patricks", "Evelyn Napier (played by Brendan Patricks) is the son and heir of Viscount Branksome and a suitor for Lady Mary, but later becomes engaged to \"one of the Semphill girls\". This engagement is broken off and during the war he is injured."]}, {"page": "Fearless (British TV series)", "response": ["* Brendan Patricks as DCI Nicholas Staines, a Metropolitan Police Service detective"]}, {"page": "Downton Abbey (series 1)", "response": ["* Brendan Patricks as The Hon. Evelyn Napier; suitor for Lady Mary"]}, {"page": "In the Club (TV series)", "response": ["*Brendan Patricks as Dr Chris Bellingham, a doctor at the hospital who is in a relationship with midwife Vicky and is the father of her baby. Their colleagues are not aware of the relationship. Vicky gives birth to their son named Ben. In Series 2, Vicky mentions that he is travelling to find the wife, whom he married for money, to divorce her. Once divorced, he can marry Vicky. He later returns home after traveling."]}, {"page": "Downton Abbey (series 2)", "response": ["* Brendan Patricks as The Hon Evelyn Napier; Suitor for Lady Mary (Recurring)"]}, {"page": "List of Outlander characters", "response": ["* Brendan Patricks as Captain Claremont"]}, {"page": "Mr. Sloane", "response": ["*Brendan Patricks as Reggie"]}, {"page": "Madame (2017 film)", "response": ["* Brendan Patricks as Toby"]}, {"page": "Gentleman Jack (TV series)", "response": ["* Brendan Patricks as Reverend Thomas Ainsworth, a man who raped Ann Walker and later proposes to her"]}]}}