{"wiki_id": "http://www.wikidata.org/entity/Q4977699", "itemLabel": "Bruce Hyman", "itemDescription": "British producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bruce_Hyman", "wikipedia_page": {"main": "Bruce Anthony Hyman is a British radio and TV producer. A barrister by profession, in 2007 Hyman was the first person in his profession in 800 years to be incarcerated for attempting to pervert the course of justice.", "link_mentions": [{"page": "List of The Hitchhiker's Guide to the Galaxy characters", "response": ["On radio, he was played by Bill Wallis and appears in . On television, he appears in , played by Joe Melia. He is played by Steve Pemberton in the movie version. He appears in , despite not appearing in , voiced by Bruce Hyman; this Prosser exists on a parallel Earth where the cottage he wishes to demolish is the home of both Arthur Dent and Fenchurch."]}, {"page": "Perverting the course of justice", "response": ["*Bruce Hyman, an English barristerperverting the course of justice"]}, {"page": "The Hitchhiker's Guide to the Galaxy (radio series)", "response": ["In November 2003, two years after Adams's death and 23 years after the production on the Secondary Phase had ceased, a new radio adaptation of Adams' unadapted novel Life, the Universe and Everything was announced. This would become the third series of the Hitchhiker's Guide to the Galaxy on radio. Dirk Maggs, a friend of Adams, was chosen to create, direct and co-produce the adaptations. Maggs had previously consulted with Adams on potential radio adaptations for the final three books in 1993 and 1997. The project was restarted in September 2001 by Maggs, Helen Chattwell and Bruce Hyman, with help from Jane Belson and Ed Victor."]}, {"page": "The Hitchhiker's Guide to the Galaxy Tertiary to Hexagonal Phases", "response": ["The Hitchhiker's Guide to the Galaxy: Tertiary Phase, based on Life, the Universe and Everything, ran on BBC Radio 4 from Tuesday 21 September to 26 October 2004, with repeats on the following Thursdays. Episodes were subtitled \"Fit the Thirteenth\" through \"Fit the Eighteenth\". The third novel was adapted by Dirk Maggs, John Langdon and Bruce Hyman following instructions left by Adams.", ":* Deodat: Bruce Hyman", "The \"Quandary Phase\" was released in a 2-CD set in late May 2005. The CDs contain material not present in the original transmissions, due to time constraints. The enclosed booklet contains notes from Dirk Maggs, Simon Jones, Bruce Hyman and Helen Chattwell. A 2-CD release of the \"Quintessential Phase\" was released in mid-June 2005, with similar material left out of the original transmissions, and notes in the booklet by the same four individuals."]}, {"page": "The Hitchhiker's Guide to the Galaxy cast lists", "response": ["|Bruce Hyman", "|Bruce Hyman"]}]}}