{"wiki_id": "http://www.wikidata.org/entity/Q4975768", "itemLabel": "Brough Scott", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brough_Scott", "wikipedia_page": {"main": "John Brough Scott, MBE is a British horse racing journalist, radio and television presenter, and former jockey. He is also the grandson and biographer of the noted Great War soldier \"Galloper Jack\" Seely.\nScott was educated at Radley College and Corpus Christi College, Oxford, where he read History. His riding career saw him ride over 100 winners including the Imperial Cup and The Mandarin Handicap Chase. He joined ITV in 1971, and was regularly seen and heard on The ITV Seven and later Channel 4 Racing for thirty years. He also briefly presented football coverage for Channel 5. He was racing correspondent for The Sunday Times (where he succeeded Roger Mortimer) and wrote for the Racing Post (which he co-founded with Sheikh Mohammed), The Independent on Sunday and The Sunday Telegraph. He was appointed an MBE in the Queen's birthday honours list in 2009.In 2013, Scott published Henry Cecil: Trainer of Genius, a book about Henry Cecil. It won the 2014 British Sports Book Awards in the \"Best Horse Racing Book\" category.In 2017, forty-six years after he first broadcast on ITV, Scott returned to the channel when it resumed broadcasting horseracing after a long break.", "link_mentions": [{"page": "Horse racing in Great Britain", "response": ["As with other sports, many of the people who have presented racing on TV through the years have become inseparably linked with racing in the public consciousness. Foremost among these for many years was the BBC's Sir Peter O'Sullevan, known as 'the voice of racing', who commentated on 50 Grand Nationals. Channel 4's most recognisable racing figure was John McCririck, famed for his eccentric dress sense and use of the bookmakers' sign language 'tic-tac'. Other notable presenters of Channel 4's coverage included Derek Thompson, John Francome, John Oaksey and Brough Scott. Clare Balding transferred from the BBC in 2013 to become lead presenter."]}, {"page": "Talksport", "response": ["The new line-up involved a number of presenters and commentators, including Alan Brazil, Mark Nicholas, Chris Cowdrey, Geoffrey Boycott, Mike Parry, Peter Shilton, Brian Moore, Brough Scott, Tom Watt, Gary Newbon, Ian Darke, Tony Banks, and Alvin Martin."]}, {"page": "Radley College", "response": ["*Brough Scott, horse racing journalist, radio and television presenter, and former jockey."]}, {"page": "J. E. B. Seely, 1st Baron Mottistone", "response": ["Whilst still on active service in South Africa during the Boer War, Seely was elected Member of Parliament for the Isle of Wight as a Conservative at a by-election in May 1900 and re-elected at the \"Khaki\" General Election that autumn.Brough Scott, \"The mighty Warrior, who led one of history's last-ever cavalry charges\", The Telegraph, 23 March 2008 (5 November 2014)", "Seely's grandson Brough Scott, who presented horseracing television programmes, wrote a biography of Seely, Galloper Jack (2003)."]}, {"page": "ITV Racing", "response": ["Over the years, the live coverage was presented by John Rickman (until 1977), Brough Scott, Ken Butler, Lord Oaksey (initially known on the programme as John Lawrence, and subsequently becoming John Oaksey after he succeeded to the peerage), and Derek Thompson and Jim McGrath (from 1981 onwards). Race commentators were Tony Cooke and Bob Haynes (in the first couple of years), John Penney and Raleigh Gilbert (the main commentators from 1972 to 1980) and Graham Goode (the main commentator from 1981).", "| 1971–present || Brough Scott || Analyst"]}, {"page": "Ewhurst, Surrey", "response": ["*Brough Scott"]}, {"page": "Channel 4 Racing", "response": ["Since its inception in 1984, Channel 4 Racing featured many of racing's best known journalists and presenters, including Derek Thompson, Lesley Graham, John Francome, John Oaksey, John McCririck, Brough Scott, Mike Cattermole and Stewart Machin."]}, {"page": "ITV Sport", "response": ["* Brough Scott"]}, {"page": "Montjeu", "response": ["Montjeu stayed in training as a four-year-old and won his first four races. He began his season by moving down in distance to ten furlongs to win the Tattersalls Gold Cup at the Curragh by one and a half lengths from Greek Dance. On 2 July he won the Grand Prix de Saint-Cloud by five lengths from Daring Miss and the 1998 Arc de Triomphe winner Sagamix. Four weeks later he ran in Great Britain for the first time in his career when he contested the King George VI and Queen Elizabeth Stakes at Ascot. Montjeu showed signs of temperament in the preliminaries, as he refused to enter the paddock, but was never in danger in the race itself. Starting at odds of 1/3 he \"cruised\" into the lead in the straight and won very easily by one and three-quarter lengths from Fantastic Light. Brough Scott, of the Daily Telegraph described the performance as \"devastating\" and compared Montjeu to past champions such as Ribot, Nijinsky, Mill Reef and Shergar."]}, {"page": "Battle of Moreuil Wood", "response": ["At 08:30 on 30 March, General Seely and his aides travelled towards the Moreuil Woods from where his forces were stationed on the other side of the River Avre, with orders to cross the river and delay the enemy advance as much as possible.Article The mighty warrior about Seely by his grandson Brough Scott on page 25 of The Sunday Telegraph(Issue 2,441, dated 23 March 2008) At 09:30, upon reaching the wood, having received fire from German forces that were occupying it, Seely ordered The Royal Canadian Dragoons to send sections to protect the village of Moreuil, while other sections were to seize the northeast corner of the wood itself. While this was being undertaken, Lord Strathcona's Horse was ordered to occupy the southeast face of the wood and disperse any German units found there (both the Royal Canadian Dragoons and Lord Strathcona's Horse were two units making up the Canadian Cavalry Brigade)."]}]}}