{"wiki_id": "http://www.wikidata.org/entity/Q4979951", "itemLabel": "Bryan Appleyard", "itemDescription": "British journalist/author", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryan_Appleyard", "wikipedia_page": {"main": "Bryan Appleyard  (born 24 August 1951, Manchester) is a British journalist and author.", "link_mentions": [{"page": "Philip Larkin", "response": ["The view that Larkin is not a nihilist or pessimist, but actually displays optimism in his works, is certainly not universally endorsed, but Chatterjee's study suggests the degree to which old stereotypes of Larkin are now being transcended. Representative of these stereotypes is Bryan Appleyard's judgement (quoted by Maeve Brennan) that of the writers who \"have adopted a personal pose of extreme pessimism and loathing of the world ... none has done so with quite such a grinding focus on littleness and triviality as Larkin the man\".Brennan 2002, p. 109. Recent criticism of Larkin demonstrates a more complex set of values at work in his poetry and across the totality of his writings.Ingelbien 2002, p. 13."]}, {"page": "Rupert Sheldrake", "response": ["Bryan Appleyard writing in The Sunday Times commented that Sheldrake was \"at his most incisive\" when making a \"broad critique of contemporary science\" and \"scientism,\" but on Sheldrake's \"own scientific theories\" Appleyard noted that \"morphic resonance is widely derided and narrowly supported. Most of the experimental evidence is contested, though Sheldrake argues there are 'statistically significant' results.\" Appleyard called it \"highly speculative\" and was unsure \"whether it makes sense or not.\""]}, {"page": "Stephen Greenblatt", "response": ["He wrote his 2018 book Tyrant: Shakespeare on Politics out of anxiety over the result of the 2016 US presidential election.\"What can Macbeth teach us about President Trump's next move?\" by Eliot A. Cohen, The Washington Post, May 3, 2018\"Stephen Greenblatt interview: on Shakespeare, Trump and his new book about the 'strong men' who lead the world\" by Bryan Appleyard, The Times, May 20, 2018 "]}, {"page": "London Weekend Television", "response": ["In May 1976, LWT was reorganised to form a new company, LWT (Holdings) Limited\"LWT forms new company to acquire its equity\", The Times, 20 May 1976; p.26 which allowed the company to expand into a number of new ventures, including Hutchinson Publishing. The LWT Chairman & Chief Executive John Freeman said \"an important factor was the deal would provide revenue from a wholly different source thus in part insulating LWT from the effects of any future adverse fluctuations in advertising revenue\".Bryan Appleyard, \"London Weekend TV group pays £3.9 million cash to take over Hutchinson the publishers\", The Times, 17 May 1978; p.19 In the same month he stood down as Chief Executive, and the Board appointed Brian Tesler as the company's managing director. Cyril Bennett died later that year, and Tesler doubled as the company's Director of Programmes until he appointed Michael Grade to that role in February 1977. Three decades later the official history of ITV, Independent Television in Britain, observed \"Under Brian Tesler's Managing Directorship LWT was to become the success for which its founders (almost all of whom had by that time left the company) had so earnestly striven.\"Independent Television in Britain Vol 3, Palgrave Macmillan"]}, {"page": "K Foundation art award", "response": ["In a piece published in 2006, The Sunday Times quoted author James F. English's description of The K Foundation's Art Award as \"hostile philanthropy\".English, J. F., THE ECONOMY OF PRESTIGE Prizes, Awards and the Circulation of Cultural Value (), Harvard University Press, 2005. Sunday Times writer Bryan Appleyard added that the \"K Foundation's witty exploitations of artistic greed ... are essential aspects of the prize itself. They promote the prize, reassure the organisers that, culturally speaking, they are in the thick of it and console the artists with evidence that their work provokes strong reactions. More importantly, for English, such conflicts demonstrate the autonomous nature of the event. These prizes should not be seen as any real or lasting judgment about art, but rather as things in themselves.\"Appleyard, B., \"And the winners are...\", The Sunday Times (London), 8 January 2006, Features p52."]}, {"page": "Bernie Ecclestone", "response": ["In 2011 Faber and Faber published Tom Bower's biography No Angel: The Secret Life of Bernie Ecclestone, which was written with Ecclestone's co-operation. Bower has written exposé biographies of figures such as Robert Maxwell and Simon Cowell, leading commentators including Bryan Appleyard of the New Statesman to express surprise over Ecclestone's co-operation."]}, {"page": "Michael Jackson (television executive)", "response": ["Prior to the launch of The Late Show in January 1989, there was some scepticism as to whether or not the programme, running four nights per week on BBC 2 in a late night slot after Newsnight, would be a success. In a feature for The Times newspaper on television arts coverage, published two months prior to the show's launch, Bryan Appleyard wrote that: \"the real tension is building up around The Late Show and its young creator, Michael Jackson.\" Appleyard pointed out that: \"the investment financial, intellectual and egotistical in the programme is enormous... Yentob is determined to put his own cultural stamp on BBC2 and Jackson has everything to prove.\" However, the programme went on to be a success, running for six years. Looking back at The Late Show and other television arts programming in a feature for The Guardian in 2003, David Herman felt that the programme represented the last great era of television arts coverage. \"The Late Show cast its net wider in terms of formats... What drove it was the enthusiasm and passions of its presenters, producers and editors, and this built a certain eclecticism and unashamed highbrowness into its agenda... It could be argued that the real high point of intellectual life on British television was not the 1960s or the 1970s, but the decade between the beginning of Channel 4 and the end of The Late Show in 1995.\""]}, {"page": "Humanists UK", "response": ["In January 2008 Humanists UK (known as the BHA at the time) and the National Secular Society approached the Scouts Association about a conflict between the claims of inclusivity on their website and their oath. In February 2008 journalists Bryan Appleyard and Deborah Orr criticised both Humanists UK and the National Secular Society for the (ultimately successful) campaign to end discrimination against non-religious children in the Scouts' Oath of Allegiance. In April 2008 Jonathan Petre, The Daily Telegraph religious affairs journalist, countered this position pointing out that the Scout Oath of Allegiance was discriminatory. After consultation with Humanists UK over a five-year period, Girlguiding UK in June 2013 and eventually the UK Scout Association in October 2013 recognised the discrimination and amended their oaths to accommodate non-religious young people from 1 January 2014."]}, {"page": "John Gray (philosopher)", "response": ["Gray's work has been praised by, amongst others, the novelists J. G. Ballard, Will Self and John Banville, the theologian Don Cupitt, the journalist Bryan Appleyard, the political scientist David Runciman, investor and philanthropist George Soros, the environmental scientist James Lovelock and the author Nassim Nicholas Taleb.False Dawn: The Delusions of Global CapitalismBlack Mass: Apocalyptic Religion and the Death of Utopia"]}, {"page": "Nassim Nicholas Taleb", "response": ["In a 2008 article in The Times, the journalist Bryan Appleyard described Taleb as \"now the hottest thinker in the world\". The Nobel Laureate Daniel Kahneman proposed the inclusion of Taleb's name among the world's top intellectuals, saying \"Taleb has changed the way many people think about uncertainty, particularly in the financial markets. His book, The Black Swan, is an original and audacious analysis of the ways in which humans try to make sense of unexpected events.\" Taleb was treated as a \"rock star\" at the World Economic Forum annual meeting in Davos in 2009; at that event he had harsh words for bankers, suggesting that bankers' recklessness will not be repeated \"if you have punishment\"."]}, {"page": "Apostolos Doxiadis", "response": ["Doxiadis' next project, which took over five years to complete, was the graphic novel Logicomix (2009), a number one bestseller on the New York Times Best Seller list and an international bestseller, already published in over twenty languages. Logicomix was co-authored with computer scientist Christos Papadimitriou, with art work by Alecos Papadatos (pencils) and Annie Di Donna (colour). Renowned comics historian and critic R. C. Harvey, in the Comics Journal, called Logicomix \"a tour-de-force\" a \"virtuoso performance\", while The Sunday Times Bryan Appleyard called it \"probably the best and certainly the most extraordinary graphic novel\" he has read. Logicomix is one of Paul Gravett's 1001 Comics You Must Read Before you Die. "]}, {"page": "Muhammad Tahir-ul-Qadri", "response": ["He has authored 1000 works out of which 550 are published books, including  an \"eight-volume, 7,000-page Qur’anic Encyclopaedia in English covering all 6,000-plus verses of the Koran.\"Bryan Appleyard, \"The Koran is a work of peace, not violence\", The Times. Retrieved 3 October 2019. He has delivered over 6000 lectures and has been teaching subjects such as Islamic jurisprudence, theology, sufism, Islamic philosophy, law, Islamic politics, hadith, seerah, and many other traditional sciences."]}, {"page": "Hallelujah (Leonard Cohen song)", "response": ["Since 1991, \"Hallelujah\" has been performed by a wide variety of singers: over 300, and in various languages. Statistics from the Recording Industry Association of America (RIAA), the Canadian Recording Industry Association, the Australian Recording Industry Association, and the International Federation of the Phonographic Industry, show that, by late 2008, more than five million copies of the song sold in CD format. It has been the subject of a BBC Radio documentary, a book, and been in the soundtracks of numerous films and television programs.Appleyard, Bryan (9 January 2005).\"Hallelujah! — One Haunting Ballad Has Been the Soundtrack to Many Lives Recently. But Why? Bryan Appleyard on Leonard Cohen's Uber-Song\". The Times. Retrieved 13 February 2010. Different interpretations of the song may include different verses, out of the over 80 verses Cohen originally wrote."]}, {"page": "Mark LeVine", "response": ["British journalist Bryan Appleyard gave it a mixed review in the London Sunday Times . Appleyard was sternly critical of the book's style and organization, and disparaged the ideological underpinnings, rooted in \"idealism,\" which, he claimed, informed Levine's work. Appleyard nevertheless wrote,  \"LeVine is absolutely right and, indeed, quite brave to insist on the reality of complexity. Terrorism and war both tend to simplify world views and, without doubting their intellectual status, so do the utopians of the new right... Perhaps his book’s greatest virtue is that it introduces both the many shades of opinion and cultural complexity of the, largely, Arab world... LeVine detonates the uneasy but nonetheless profound complacency that seems to have invaded politics.\"Bryan Appleyard,'Politics: Why They Don't Hate Us by Mark LeVine,'London Sunday Times 14 August 2005."]}, {"page": "British Press Awards 2006", "response": ["* Bryan Appleyard (The Sunday Times magazine)"]}, {"page": "Lust, Caution", "response": ["It has been noted by critics (including Bryan Appleyard) that the Hong Kong sequences in the film set in the late 1930sSee  (5.2 MB) include \"London taxis\" of two types (FX3, FX4) that were only manufactured onwards from 1948 and 1958 respectively."]}, {"page": "Bryan appleyard", "response": ["#REDIRECT Bryan Appleyard "]}, {"page": "Yo, Blair", "response": ["In a comment on Hoggart's piece, Bryan Appleyard concluded that the \"Yo, Blair\" version became \"entrenched as recorded fact\" because it corresponded to the \"perceived 'inner truth' of the Blair–Bush poodle–master relationship\"."]}, {"page": "Appleyard", "response": ["* Bryan Appleyard, journalist and author"]}, {"page": "Category talk:British journalists", "response": ["Bryan Appleyardnot yet classified"]}, {"page": "The Dawkins Delusion?", "response": ["Bryan Appleyard in the New Scientist says"]}, {"page": "Outnumbered (British TV series)", "response": ["In 2008 review in The Times, Bryan Appleyard described Outnumbered as \"the best British sitcom in years and among the best ever\"."]}, {"page": "Physics of the Impossible", "response": ["Bryan Appleyard considers this book to be a demonstration of renewed confidence in the possibilities of physics. He also sees the book as a depiction of how the public believes in an especially optimistic view of the future. Discussing the book's author, he writes, \"Kaku, when on home territory, is an effective and gifted dramatiser of highly complex ideas. If you want to know what the implications would be of room-temperature superconductors, or all about tachyons, particles that travel faster than the speed of light and pass through all points of the universe simultaneously, then this is the place to find out.\""]}, {"page": "Stoner (novel)", "response": ["Williams' novel has been praised for both its narrative and stylistic aspects. In a 2007 review of the recently reissued work, scholar and book critic Morris Dickstein acclaims the writing technique as remarkable and says the novel \"takes your breath away\". Bryan Appleyard's review quotes critic D.G. Myers as saying that the novel was a good book for beginners in the world of \"serious literature\". Another critic, author Alex Preston, writes that the novel describes \"a small life ... in a small, precise way: the dead hand of realism.\" In 2010, critic Mel Livatino noted that, in \"nearly fifty years of reading fiction, I have never encountered a more powerful novel—and not a syllable of it sentimental.\"Mel Livatino, \"A Sadness Unto the Bone - John Williams's Stoner, The Sewanee Review, 118:3, p. 417. Steve Almond reviewed Stoner in The New York Times Magazine in 2014. Almond claims Stoner focuses on the \"capacity to face the truth of who we are in private moments\" and questions whether any of us is truly able to say we are able to do that. Almond states, \"I devoured it in one sitting. I had never encountered a work so ruthless in its devotion to human truths and so tender in its execution.\" Sarah Hampson of The Globe and Mail sees Stoner as an \"antidote\" to a 21st-century culture of entitlement. She says that the novel came back to public attention at a time when people felt entitled to personal fulfillment, at the cost of their own morality, and Stoner shows that there can be value even in a life that seems failed. In 2013 it was named Waterstones Book of the Year and The New Yorker called it \"the greatest American novel you've never heard of.\" Writing in The Washington Post in 2015, literary critic Elaine Showalter was less enthusiastic, noting that she, \"along with other female readers, [was] put off by Williams’s misogyny.\""]}, {"page": "Nudge (book)", "response": ["British journalist Bryan Appleyard, in a review for The Times, was critical of the book, describing it as a \"very, very dull read, a dogged march through social policies with boring lists of what nudges should be imposed and how\" and that \"what the book needs is not more examples but more elaboration of the central idea\"."]}, {"page": "The Master and His Emissary", "response": ["Reviewing The Master and His Emissary in the American Journal of Psychiatry, Jacob Freedman wrote the book “valiantly addresses the effect hemispheric asymmetry has had on Western civilization\" and that it chronicled \"how the left brain's determined reductionism and the right brain's insightful and holistic approach have shaped music, language, politics, and art.\" A review by Bryan Appleyard in Times Online described the book as suggesting \"we are thinking more and more like machines, and risk losing what makes us human\", while David Cox in the Evening Standard wrote that the author \"shows convincingly that the degeneracy of the West springs from our failure to manage the binary division of our brains.\""]}, {"page": "A Brief History of Crime", "response": ["Conservative newspapers assessed the book more favourably. Bryan Appleyard, writing in The Sunday Times, described it as \"a marvellous, angry polemic\" that accounts for and charts how the British Police force became so \"institutionally bureaucratic, sullen, chippy and ineffectual\". In The Sunday Telegraph, Theodore Dalrymple agreed with the main arguments in the book, writing \"Mr Hitchens places the blame firmly where it belongs: on a supine and pusillanimous political establishment that, for four decades at least, has constantly retreated before the verbal onslaught of liberal intellectuals whose weapons have been mockery allied to sentimental guilt about their prosperous and comfortable lives, and whose aim has been to liberate themselves from personally irksome moral constraints, without regard to the consequences for those less favourably placed in society\"."]}, {"page": "Robert Crampton", "response": ["The author and journalist Bryan Appleyard described his Beta Male column as \"light in tone, insightful but unpretentious, and above all, just the right length. I always enjoy Crampton – a naturally funny, likeable columnist. He's the kind of fellow you'd like to go for beer with, so he'd make a good US President. It's a real drag when he's away and a substitute fills in for him.http://www.bryanappleyard.com/blog/2008/10/robert-crampton-great-wakering-and-fan.php\""]}, {"page": "The Mind's Eye (book)", "response": ["Bryan Appleyard, reviewing the book for Literary Review, wrote: \"Sacks the doctor once again dramatises the most strange and thrilling scientific and cultural issue of our time—the nature of the human mind—through the simple act of telling stories.\""]}, {"page": "Unrelated", "response": ["Unrelated premiered at the London Film Festival in 2007, where it won the FIPRESCI International Critics Prize. On its release in September 2008 it was hailed as one of the most original British films of the year. Critics remarked on its 'un-British' style and atmosphere, drawing comparisons to Ozu, Rohmer and Chabrol. Writing in The Sunday Times, Bryan Appleyard called it 'radical' for portraying a group of British middle class characters \"simply as another tribe, one with its own customs, failings, virtues and, above all, human, all too human, anguish...In terms both of style and content, this is a radical and brilliant film that will, if there is any justice, come to be seen as a turning point for British cinema\". In their December 2009 list of the 'Top 100 Films of The Decade', the film critics of The Guardian newspaper put Unrelated at no. 21, the highest British film in the list. It currently holds an 87% rating score on Rotten Tomatoes."]}, {"page": "Bristol Festival of Ideas", "response": ["The festival, from 9–25 May, was themed around the bicentenary of Isambard Kingdom Brunel. It looked at \"Brunellian themes of creativity and progress and apply[ing] these to issues of contemporary concern and opportunity.\" Speakers included Richard Dowden, Ekow Eshun, A. C. Grayling, Christopher Hitchens, Andrew Roberts, Lola Young, Jeremy Isaacs, Geoff Dyer, Jonathan Kaplan, Andrea Levy, Tariq Ramadan, Tariq Modood, Julia Hobsbawm, Bryan Appleyard, Joan Bakewell, Tim Harford, Lewis Wolpert, Geoff Mulgan, Philip Ball, Carmen Callil, Lesley Chamberlain, Geoff Mulgan, Chris Smith, Eric Sykes, Roy Hattersley, James Lovelock, Charles Handy, Pankaj Mishra, Paul Rusesabagina, Sebastian Junger, and Margaret Atwood"]}, {"page": "Medicine Unboxed", "response": ["In 2012, the Medicine Unboxed theme was Belief. Contributors included Sebastian Faulks, John Burnside, Marius Brill, Bryan Appleyard, Rupert Sheldrake, Tim Parks, Richard Holloway, Iona Heath, Matthew Flinders, Richard Horton, Clare Short, Darian Leader, Raymond Tallis, Jo Shapcott, Jan Royall, Jane Macnaughton, Adam Kay, Charles Fernyhough and Rhidian Brook. Medicine Unboxed 2012: belief took place on November 24–25, 2012 at the Parabola Arts Centre in Cheltenham."]}, {"page": "James Le Fanu", "response": ["*Bryan Appleyard"]}]}}