{"wiki_id": "http://www.wikidata.org/entity/Q4977207", "itemLabel": "Bruce Byron", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Bruce_Byron", "wikipedia_page": {"main": "Bruce Michael Byron is an English actor best known for his role as DC Terry Perkins in The Bill. He originally followed a career in music, before started acting at 20.", "link_mentions": [{"page": "1959", "response": ["** Bruce Byron, English actor "]}, {"page": "2001 in film", "response": ["| The Mummy Returns || Universal Pictures / Alphaville Films || Stephen Sommers (director/screenplay); Brendan Fraser, Rachel Weisz, John Hannah, Freddie Boath, Oded Fehr, Arnold Vosloo, Patricia Velásquez, Alun Armstrong, Adewale Akinnuoye-Agbaje, Shaun Parkes, Dwayne \"The Rock\" Johnson, Bruce Byron, Joe Dixon, Tom Parker, Aharon Ipale || Adventure || Live action"]}, {"page": "The Mummy Returns", "response": ["* Bruce Byron as Red"]}, {"page": "List of former EastEnders characters", "response": ["|Gary Bolton || Bruce Byron || 2001"]}, {"page": "Robbie Jackson", "response": ["Robbie decides to track down his birth father, Gary Bolton (Bruce Byron), in 2001. He finds him in Portsmouth, and discovers he has a half brother, Kevin (Rupert Hill). The meeting ends up being a disappointment for Robbie, when he discovers Gary had left his own mother to be with his half-brother's mother. He leaves angrily, but Gary later traces Robbie to Walford and gives him a large cheque which allows him to travel around India, and pay for sister Sonia's nursing training."]}, {"page": "Tanya Byron", "response": ["Byron married The Bill actor Bruce Byron in Barnet, London, in 1997. They have a daughter (born 1995, Hendon, London) and a son (born 1998, Barnet).Marriages and Births England and Wales 1984–2006 Tanya and Bruce met when Bruce applied to the very first ARTTS course. "]}, {"page": "Bruce Michael Byron", "response": ["#REDIRECT Bruce Byron"]}, {"page": "List of The Mummy (film series) characters", "response": ["Red Willits (Bruce Byron) is the leader of the three thieves that were under the employ of British Museum curator turned cultist leader Baltus Hafez. Red and his gang (which include the ignorant and skittish Jacob Spivey (Tom Fisher) and the superstitious and more practical Jacques Clemons (Joe Dixon) were ordered to steal the Bracelet of Anubis when they were interrupted by a tidal wave Evy inadvertently caused. After they failed to obtain the chest, Red and his gang were ordered to obtain a chest from an unknown mausoleum, which turns out to be the very same chest that resulted in the deaths of Burns, Dr. Chamberlain, Henderson and Daniels from the first film. After a disagreement with the payment, Meela locks the three thieves into a train car and tricks them into opening the chest, after which they are all killed by Imhotep."]}, {"page": "List of The Bill characters", "response": ["The Bills roster of Detective Constables investigate crimes under the direction of their sergeants. Kevin Lloyd, as Alfred \"Tosh\" Lines, appeared in more episodes than any other DC, in 383 episodes between 1988 and 1998. In the series finale, \"Respect\", Amita Dhiri, Chris Simmons, Patrick Robinson, and Bruce Byron play Constables Dasari, Webb, Banks, and Perkins. Other notable Detective Constables include Eva Sharpe, played by Diane Parish, who departed in 2004 but went on to headline the second series of Murder Investigation Team in 2005, and Rae Baker as Juliet Becker, who departed the series in the 2003 live episode \"Fatal Consequences\". ", "| Terry Perkins || Bruce Byron || 2003-2010 || style=\"text-align:center;\"|210 || D.C."]}, {"page": "ARTTS International", "response": ["*Bruce Byron - Acting (United Kingdom) (1990)"]}, {"page": "The Eustace Bros.", "response": ["* Bruce Byron as Terry Hennessy "]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Bruce Byron"]}, {"page": "Branning family", "response": ["The Branning family, together with the Jackson family are a fictional, extended family in the BBC soap opera EastEnders. Introduced in 1993 were the Jackson family, consisting of Carol Jackson (Lindsey Coulson), her partner (later husband) Alan Jackson (Howard Antony), and Carol's four children, Bianca Jackson (Patsy Palmer), Sonia Jackson (Natalie Cassidy), Robbie Jackson (Dean Gaffney), and Billie Jackson (Devon Anderson). Billie is the only child fathered by Alan, while Bianca is the daughter of David Wicks (Michael French), Sonia's father is Terry Cant (Brian Conley) and Robbie's is Gary Bolton (Bruce Byron). The family becomes a more dominating presence in the early 2000s, when Carol's father Jim Branning (John Bardon) moves to Walford following the death of his wife Reenie (Joy Graham) to cancer. Since then, all six of Jim's children have appeared, many of them with family."]}, {"page": "Last Resort (2000 film)", "response": ["*Bruce Byron as Police Officer"]}, {"page": "List of EastEnders characters (2001)", "response": ["The following is a list of characters that first appeared in the BBC soap opera EastEnders in 2001, by order of appearance. All characters were introduced by the show's executive producer, John Yorke. The first character to be introduced was Jill Marsden, a detective chief inspector who investigates the shooting of local hardman Phil Mitchell (Steve McFadden). April saw the introductions of: Ritchie Stringer (Gareth Hunt), an associate of Phil, Paul Trueman (Gary Beadle), the son of Audrey Trueman (Corinne Skinner-Carter) and brother of Anthony Trueman (Nicholas Bailey), and Donna Andrews (Alison Senior; Paula Jennings), the mistress of Trevor Morgan (Alex Ferns). Harry Slater (Michael Elphick), the brother of Charlie Slater (Derek Martin), and Gary Bolton (Bruce Byron), the father of Robbie Jackson (Dean Gaffney), made their debuts in May, whereas Margaret Walker (Susan George), a love interest for Terry Raymond (Gavin Richards), and Angel Hudson (Goldie), a gangster, made their first appearances in June.", "Gary Bolton, played by Bruce Byron, is the biological father of Robbie Jackson (Dean Gaffney), who appears in three episodes between 17 May and 10 July 2001.", "|  The son of Gary Bolton (Bruce Byron), and half-brother of Robbie Jackson (Dean Gaffney). He appears when Robbie and his half-sister Sonia (Natalie Cassidy) track Gary down to Portsmouth. He is jealous of Robbie's presence in his father's life."]}, {"page": "Assault on Sun Hill", "response": ["* DC Terry Perkins - Bruce Byron"]}, {"page": "The Mummy (franchise)", "response": ["|Bruce Byron"]}, {"page": "Proof of Life (The Bill)", "response": ["|DC Terry Perkins || Bruce Byron"]}, {"page": "Tomorrow La Scala!", "response": ["* Bruce Byron as Thomas"]}, {"page": "Toby Swift", "response": ["| Ray Burdis, Sheyla Shehovich, Bruce Byron, Sharon Duce and Ewan Bailey"]}, {"page": "Daylight Robbery (TV series)", "response": ["* Bruce Byron as Phil Murphy (Series 1—2)"]}, {"page": "The Anniversary, Part Two", "response": ["* DC Terry Perkins (Bruce Byron)"]}, {"page": "List of Stars in Their Eyes episodes", "response": ["| Bruce Byron"]}, {"page": "Lenny Blue", "response": ["* Bruce Byron as DC Gerry Singleton (Series 1)"]}, {"page": "List of Doctors characters (2020)", "response": ["| Bruce Byron"]}, {"page": "List of people from the London Borough of Hammersmith and Fulham", "response": ["* Bruce Byron, actor, born in Fulham."]}, {"page": "A Song for Jenny", "response": ["*Bruce Byron as Taxi Driver"]}]}}