{"wiki_id": "http://www.wikidata.org/entity/Q4977273", "itemLabel": "Bruce Clark", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Bruce_Clark_(journalist)", "wikipedia_page": {"main": "Bruce Clark is the International Security Editor of The Economist, and the author of Twice A Stranger: How Mass Expulsion Forged Modern Greece and Turkey.\nThe son of Wallace Clark, a Northern Irish author and businessman, he was educated at Shrewsbury and St John's College, Cambridge. His writing for The Economist usually focuses on religion or defence.\nClark wrote for Reuters and was The Times correspondent in Moscow 1991-1993. His book Twice A Stranger is a history of the population exchange between Greece and Turkey which took place in the early 1920s following the Treaty of Lausanne. The book won the Runciman Award in 2007.", "link_mentions": [{"page": "Shrewsbury School", "response": ["* Bruce Clark (born 1958), author and International Security Editor of The Times"]}, {"page": "Population exchange between Greece and Turkey", "response": ["According to Bruce Clark, leaders of Greece and Turkey, and some circles in the international community, saw the resulting ethnic homogenization of their respective states as positive and stabilizing since it helped strengthen the nation-state natures of these two states. Nevertheless, the deportations brought significant challenges: social, such as forcibly being removed from one's place of living, and more practical such as abandoning a well-developed family business. Countries also face other practical challenges: for example, even decades after, one could notice certain hastily developed parts of Athens, residential areas that had been quickly erected on a budget while receiving the fleeing Asia Minor population. To this day, Greece and Turkey still have properties, and even villages such as Kayaköy, that have been left abandoned since the exchange."]}, {"page": "Twice A Stranger: How Mass Expulsion Forged Modern Greece and Turkey", "response": ["Twice A Stranger: How Mass Expulsion Forged Modern Greece and Turkey (also published as Twice A Stranger: The Mass Expulsions that Forged Modern Greece and Turkey) is a book by Bruce Clark published in 2006 concerning the population exchange between Greece and Turkey which took place in the early 1920s, following the Treaty of Lausanne. "]}, {"page": "List of Old Salopians", "response": ["* Bruce Clark (1958-), journalist and author "]}, {"page": "Runciman Award", "response": ["Previous winners have included Mark Mazower, Antony Beevor, Richard Clogg and Bruce Clark. The only person to have won it four times is Roderick Beaton.", "|rowspan=\"2\" | 2007 || Bruce Clark|| Twice a Stranger|| Granta Books"]}, {"page": "Bruce Clark", "response": ["Bruce Clark (or Clarke) may refer to:", "*Bruce Clark (gridiron football) (born 1957), American NFL football player who played for the New Orleans Saints and Kansas City Chiefs", "*Bruce Clark (journalist), international security editor of The Economist", "*Bruce Clark (bishop) (born 1939), Anglican bishop of Riverina, Australia", "*Bruce Clark (rugby league) (born 1958), Australian rugby league player", "*Bruce Clarke (musician) (1925–2008), Australian jazz musician", "*Bruce Clarke (soccer) (1910–?), South African footballer"]}, {"page": "Wallace Clark", "response": ["He continued sailing late into life, and completed another reconstruction journey in 2009 when he recreated the 1814 journey of his ancestor Robert Harvey to the Western Isles. Having sold his last boat Agivey in 2009, Wallace was to complete one last cruise in the summer of 2010 along the Croatian coast with old friends. He died on 8 May 2011, and is survived by his wife June and his son, the journalist  Bruce. His last book, The Call of the Running Tide, an all-new work edited by Bruce Clark and Tara Mackie, looking back on his long sailing career, was launched on Rathlin Island on 7 July 2012."]}, {"page": "Jovo Martinović", "response": ["In a letter written from Milo Đukanović, Montenegro’s Prime Minister, to Dunja Mijatović, the media freedom representative of the Organization for Security and Co-operation in Europe; Montenegro’s government said Martinović arrest was unrelated to his journalistic work. Among the international journalists who have publicly supported Martinović are. Bruce Clark of The Economist, Till Krause of Suddeutsche Zeitung, Michael Montgomery of the Center for Investigative Reporting and Philip Sherwell of the Daily Telegraph. On September 2, the International Federation of Journalists and its affiliate in Montenegro, the Trade Union of Media of Montenegro, also  called for Martinović’s release."]}, {"page": "The Thirty-Year Genocide", "response": ["In The New York Times, journalist Bruce Clark writes that \"The reader is left wondering what the authors ultimately feel about the treatment of civilians in situations of total war.\" By weighing up the arguments for and against the forced deportation of civilians in certain situations, the authors imply, in contrast to established international law, that it might sometimes be justified. However, he praises the book for \"offer[ing] a subtle diagnosis of why, at particular moments over a span of three decades, Ottoman rulers and their successors unleashed torrents of suffering\". In Agos, Vicken Cheterian criticizes the book, saying that it offers few new insights. \"The two authors, by posing this question as the start of their investigation, give the impression as if no historian had noticed before them about the exterminations of Ottoman Christians, as if no one had written this history before them.\" Alex J. Bellamy opined that the \"important, beautifully crafted book\" \"contributes significantly to our understanding of what happened during these 30 years of violence, as well as to our understanding of genocide more broadly\"."]}]}}