{"wiki_id": "http://www.wikidata.org/entity/Q4993730", "itemLabel": "Colin Heath", "itemDescription": "footballer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Heath", "wikipedia_page": {"main": "Colin Heath (born 31 December 1983) is an English former footballer who played as a striker or attacking midfielder for Cambridge United, Swindon Town, Chesterfield and Macclesfield Town and for Belgian club Royal Antwerp.", "link_mentions": [{"page": "Brian Horton", "response": ["Despite high expectations, Horton's men were not to challenge for promotion in the 2005–06 season. The club were hit by financial troubles after being told they had to pay fines totalling £250,000, and at one point were at risk of being wound up. As a result, Horton was forced to cope without assistant John Askey, after Askey was dismissed to cut costs. The sale of top-scorer Jon Parkin also robbed Horton of his best player. Following a poor start to the season he placed four players on the transfer-list. He also placed Kevin Townson on the transfer-list, before sacking the striker after Townson displayed \"serious misconduct\". Throughout the campaign, Horton signed goalkeeper Tommy Lee, striker Clyde Wijnhard, midfielder Alan Navarro, forward Allan Russell, and striker Matty McNeil. The \"Silkmen\" finished in 17th-place, five points above the relegation zone. Horton prepared for the 2006–07 campaign by searching for a new midfield player, and found one in Shrewsbury Town's Jamie Tolley. He also signed versatile attacker Colin Heath, defender Carl Regan, and former Port Vale goalkeeper Jonny Brain; whilst releasing five players. Horton was sacked in October 2006, after his team failed to win any of their opening twelve league games, leaving them bottom of the Football League."]}, {"page": "Royal Antwerp F.C.", "response": ["*  Colin Heath"]}, {"page": "Matthew Williams (footballer)", "response": ["Although he failed to make an appearance in the first team, he did train with the first team regularly in his Manchester United career. Williams was involved in the reserve team that featured players such as Luke Chadwick, Paul McShane, Michael Stewart, Sylvan Ebanks-Blake, Kieran Richardson, Phil Bardsley, Giuseppe Rossi, Gerard Piqué, Richard Eckersley, Chris Eagles, Ritchie Jones and strike partner Colin Heath; who have all also left the club since Williams' departure."]}, {"page": "2005–06 Manchester United F.C. season", "response": ["In mid-January, United released Finnish forward Jami Puustinen, English midfielder David Fox, and American forward Kenny Cooper. At the end of January, English forward Colin Heath was also released. South African midfielder Quinton Fortune departed United at the start of June.", "|  Colin Heath", "|  Colin Heath"]}, {"page": "2003–04 Manchester United F.C. season", "response": ["| Colin Heath"]}, {"page": "2004–05 Manchester United F.C. season", "response": ["|  Colin Heath"]}, {"page": "2006–07 Macclesfield Town F.C. season", "response": ["|align=\"left\"|8||align=\"left\"|FW||align=\"left\"| Colin Heath"]}]}}