{"wiki_id": "http://www.wikidata.org/entity/Q4997158", "itemLabel": "Bulstrode Whitelocke", "itemDescription": "English politician (1605-1675)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bulstrode_Whitelocke", "wikipedia_page": {"main": "Sir Bulstrode Whitelocke (6 August 1605 – 28 July 1675) was an English lawyer, writer, parliamentarian and Lord Keeper of the Great Seal of England.", "link_mentions": [{"page": "August 6", "response": ["*1605 – Bulstrode Whitelocke, English lawyer (d. 1675)"]}, {"page": "July 28", "response": ["*1675 – Bulstrode Whitelocke, English lawyer and politician (b. 1605)"]}, {"page": "John Milton", "response": ["He praised Oliver Cromwell as the Protectorate was set up; though subsequently he had major reservations. When Cromwell seemed to be backsliding as a revolutionary, after a couple of years in power, Milton moved closer to the position of Sir Henry Vane, to whom he wrote a sonnet in 1652.Christopher Hill, God's Englishman (1972 edition), p. 200. The group of disaffected republicans included, besides Vane, John Bradshaw, John Hutchinson, Edmund Ludlow, Henry Marten, Robert Overton, Edward Sexby and John Streater; but not Marvell, who remained with Cromwell's party. Milton had already commended Overton, along with Edmund Whalley and Bulstrode Whitelocke, in Defensio Secunda.William Riley Parker and Gordon Campbell, Milton (1996), p. 444. Nigel Smith writes that"]}, {"page": "Ralph Cudworth", "response": ["Cudworth emerged as a central figure among that circle of theologians and philosophers known as the Cambridge Platonists, who were (more or less) in sympathy with the Commonwealth: during the later 1650s, Cudworth was consulted by John Thurloe, Oliver Cromwell's Secretary to the Council of State, with regard to certain university and government appointments and various other matters.T. Birch, Account of the Life and Writings (1743), pp. viii–x (pp. 16–18 in pdf).'Life of Cudworth, Appendix A: Letters to Thurloe', in W.R. Scott, An Introduction to Cudworth's Treatise concerning Eternal and Immutable Morality (Longmans, Green & Co.: London, 1891), pp. 19–23 (Hathi Trust). During 1657, Cudworth advised Bulstrode Whitelocke's sub-committee of the Parliamentary \"Grand Committee for Religion\" on the accuracy of editions of the English Bible.C. Anderson, The Annals of the English Bible (William Pickering: London, 1845), ii, Book 3, p. 394 (Google). Cudworth was appointed Vicar of Great Wilbraham, and Rector of Toft, Cambridgeshire Ely diocese (1656), but surrendered these livings (1661 and 1662, respectively) when he was presented, by Dr Gilbert Sheldon, Bishop of London, to the Hertfordshire Rectory of Ashwell (1 December 1662).Clergy of the Church of England database."]}, {"page": "1605", "response": ["** Bulstrode Whitelocke, English lawyer (d. 1675)"]}, {"page": "1675", "response": ["* July 28 – Bulstrode Whitelocke, English lawyer (b. 1605)"]}, {"page": "Thomas Baltzar", "response": ["Through contacts at Germany's embassy in Sweden (where, by 1653, Baltzar was employed), he may have come in contact with English musicians accompanying Bulstrode Whitelocke's mission to Queen Christina. This possible encounter may have been the impetus for Baltzar's decision to emigrate to England in 1655, leaving behind his newly attained position of Ratslutenist of Lübeck (he had returned briefly to his home city, probably shortly after Christina's abdication in June 1654). Hartlib's writings indicate that the Swedish ambassador to England, Christer Bonde, took in Baltzar."]}, {"page": "William Lilly", "response": ["Lilly was a controversial character who was both aided and abetted by powerful friends and enemies. He attracted the attention of many members of Parliament, through the support of Sir Bulstrode Whitelocke, Lord Keeper of the Great Seal of England, (to whom he dedicated his Christian Astrology), but also accused Members of Parliament of engineering charges against him in 1651. To his supporters he was an \"English Merlin\"; to his detractors he was a \"juggling wizard and imposter\".", "He then began to issue his prophetical almanacs and other works, which met with serious attention from some of the most prominent members of the Long Parliament.  Lilly was on intimate terms with Bulstrode Whitelocke, William Lenthall the speaker, Sir Philip Stapleton, Elias Ashmole and others. Even John Selden seems to have acknowledged him, and probably the chief difference between him and the mass of the community at the time was that, while others believed in the general truth of astrology, he ventured to specify the future events to which he referred."]}, {"page": "Merchant Taylors' School, Northwood", "response": ["* Sir Bulstrode Whitelocke – Civil War politician who enshrined the principle that only parliament could dissolve parliament"]}, {"page": "Thomas Coventry, 1st Baron Coventry", "response": ["Lord Coventry held the great seal for nearly fifteen years (1625–40), and was enabled to collect a large fortune. He was an able judge, and he issued some important orders in chancery, probably alluded to by Wood, who ascribes to him a tract on \"The Fees of all law Officers\".Anthony Wood, Athenae Oxonienses ii. 650. Bulstrode Whitelocke accuses him of mediocrity, but his contemporaries in general have united in extolling his judicial ability, his quick despatch of business and his sound and sterling character. Clarendon in particular praises his statesmanship, and compares his capacity with Lord Strafford's, adding, however, that he seldom spoke in the council except on legal business and had little influence in political affairs; to the latter circumstance he owed his exceptional popularity. He describes him as having \"in the plain way of speaking and delivery a strange power of making himself believed,\" as a man of \"not only firm gravity but a severity and even some morosity,\" as \"rather exceedingly liked than passionately loved.\""]}, {"page": "Thomas Fairfax", "response": ["In calling over the court, when the crier pronounced the name of Fairfax, it is said that his wife, Anne Fairfax, shouted from the gallery that \"he had more wit than to be there\". Later when the court said that they were acting for \"all the good people of England\", she shouted \"No, nor the hundredth part of them!\". This resulted in an investigation and Anne was asked or required to leave the court. It was said that Anne could not forbear, as Bulstrode Whitelocke says, to exclaim aloud against the proceedings of the High Court of Justice. In February 1649 Fairfax was elected Member of Parliament for Cirencester in the Rump Parliament. Anne was later approached to intercede on the King's behalf to prevent his execution."]}, {"page": "John Selden", "response": ["In 1643, he participated in the discussions of the Westminster Assembly, where his Erastian views were opposed by George Gillespie.Francis J. Bremer, Tom Webster. Puritans and Puritanism in Europe and America: A Comprehensive Encyclopedia (2006), p. 105. Selden's allies included Thomas Coleman, John Lightfoot, and Bulstrode Whitelocke."]}, {"page": "Rump Parliament", "response": ["# Members of Parliament who were professional lawyers and cooperated to oppose the reformation of the English legal system. Some of the best-known lawyer allies were Bulstrode Whitelocke, Sir Thomas Widdrington, Nicholas Lechmere and Lisliborne Long."]}, {"page": "John Wildman", "response": ["In December 1659, when the Army had turned out the Long Parliament, Wildman was employed by the Council of Officers, in conjunction with Bulstrode Whitelocke, Charles Fleetwood, and others, to draw a form of government for a free state. cites Whitelocke, Memorials, iv. 385. At the same time he was plotting to overthrow the rule of the Army, and offered to raise three thousand horse if Whitelocke, who was constable of Windsor Castle, would declare for a free commonwealth.  Whitelocke declined, and Wildman, seeing which way the tide was running, helped Colonel Henry Ingoldsby to seize the castle for the Long Parliament. On 28 December 1659 the House promised that the good service of those who had assisted Ingoldsby should be duly rewarded, Commons' Journals, vii. 798; A Letter concerning the securing of Windsor Castle to the Parliament, 1659, 4to."]}, {"page": "1682 in literature", "response": ["*Bulstrode Whitelocke – Memorials of the English Affairs from the Beginning of the Reign of Charles I (Puritan viewpoint)"]}, {"page": "Algernon Sidney", "response": ["After Cromwell's death in 1658, the army abolished the Protectorate in 1659 and reconvened the Rump Parliament, with Sidney taking up his seat in the Commons. During 1659–1660 he was part of a delegation to help arbitrate peace between Denmark and Sweden, as war would threaten England's naval supplies, as well as those of the Dutch. The delegation was commanded by Edward Montagu, with Sidney and Sir Robert Honeywood. The third planned plenipotentiary, Bulstrode Whitelocke, declined because: \"I knew well the overruling temper and height of Colonel Sydney\"."]}]}}