{"wiki_id": "http://www.wikidata.org/entity/Q4993506", "itemLabel": "Tiffany Page", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Tiffany_Page", "wikipedia_page": {"main": "Tiffany Page (born 16 April 1986) is an English singer-songwriter based in London. Her debut single \"Walk Away Slow\" was released on 15 March 2010. Her second single, \"On Your Head\", started to receive airplay on radio stations across the UK.\nIn 2010 she toured with Hole as their supporting artist.\nIn 2015, a new single, \"Suburbia\" was released, followed by 2016 releases called \"Believer\" and \"Girls\".   \nIn 2017, she teamed up with Nicholas Dagnall and Harry Valentine on their California Indie album for two tracks, entitled \"Too Good to Lose\" and \"Late Night Drive\".", "link_mentions": [{"page": "V Festival", "response": ["* Tiffany Page"]}, {"page": "Summer Sundae", "response": ["*Tiffany Page"]}, {"page": "Klaus Derendorf", "response": ["In 2008, Derendorf was reportedly been working on tracks with such stars as Delta Goodrem, Beto Cuevas, British artists Tiffany Page, Amy Pearson and Australian rockers Michael Paynter and The Androids."]}, {"page": "Calling Festival", "response": ["* Tiffany Page"]}, {"page": "Rune Westberg", "response": ["He has written and produced for artists including  Adam Lambert, Colbie Caillat, Daughtry, Prince Royce, Jesse & Joy, Rachel Platten, Nina Nesbitt, Alvaro Soler, Haley Reinhart, Axelle Red, Better Than Ezra, Reece Mastin, Bonnie Anderson, Casey Abrams, Kris Allen, Jessica Sanchez, The Saturdays, David Cook, Tegan Marie, Axelle Red, Kristinia DeBarge, Hedley, Natalie Grant, Brooke White, The JaneDear Girls, MoZella, Tiffany Page, Our Lady Peace, Beth Hart, Hiroko, Tyler Hilton, Jason Reeves, Alphabeat, Saybia, Carpark North, Tue West, Magtens Korridorer, Poul Krebs and Mani Spinx."]}, {"page": "Glastonbury Festival 2010", "response": ["Sean RowleyGood ShoesThe BeesThe Magic NumbersThe Mystery JetsFanfarloDetroit Social ClubTubelordTiffany PageFrank TurnerFiction PlaneThe Beat"]}, {"page": "Apple Music Festival", "response": ["* July 16: Amy Macdonald + Tiffany Page"]}, {"page": "Tiffany Page (singer)", "response": ["#REDIRECT Tiffany Page"]}, {"page": "On Your Head", "response": ["#REDIRECT Tiffany Page"]}, {"page": "On Your Head (Tiffany Page Song)", "response": ["#REDIRECT Tiffany Page"]}]}}