{"wiki_id": "http://www.wikidata.org/entity/Q4990116", "itemLabel": "Julie T. Wallace", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Julie_T._Wallace", "wikipedia_page": {"main": "Julie Therese Wallace (born 28 May 1961) is an English actress.", "link_mentions": [{"page": "1987 in film", "response": ["| The Living Daylights || United Artists / Eon Productions || John Glen (director); Richard Maibaum, Michael G. Wilson (screenplay); Timothy Dalton, Maryam d'Abo, Joe Don Baker, Art Malik, John Rhys-Davies, Jeroen Krabbé, Andreas Wisniewski, Thomas Wheatley, Julie T. Wallace, Desmond Llewelyn, Robert Brown, Walter Gotell, Caroline Bliss, Geoffrey Keen, Virginia Hey, John Terry, Nadim Sawalha, John Bowe, Catherine Rabett, Dulice Liecier || Spy || Live action"]}, {"page": "The Living Daylights", "response": ["* Julie T. Wallace as Rosika Miklos, James Bond's contact in Bratislava, Czechoslovakia who works at the TransSiberian Pipeline."]}, {"page": "The Life and Loves of a She-Devil", "response": ["|Julie T. Wallace", "The novel was adapted in 1986 as an award-winning BBC television serial, starring Patricia Hodge as Mary Fisher, Dennis Waterman as Bobbo and Julie T. Wallace as Ruth, with only minor changes from the book."]}, {"page": "Andrew Keir", "response": ["Keir died in hospital in London, aged 71, on 5 October 1997. From 1948 until 1977, he was married to Julia Wallace, with whom he had two sons and three daughters. In 1977, he married Joyce Parker Scott, who survived him, along with his five children from his previous marriage. One of his daughters is the actress Julie T. Wallace."]}, {"page": "Hawks (film)", "response": ["*Julie T. Wallace – Ward Sister"]}, {"page": "Sharpe's Regiment", "response": ["The novel was adapted as the opening episode of the fourth season of the Sharpe television series. The adaptation introduced Abigail Cruttenden as Jane and Caroline Langrishe as Lady Anne and guest starred Nicholas Farrell as Fenner, Mark Lambert as Girdwood, Julian Fellowes as the Prince Regent and Julie T. Wallace as Maggie Joyce. It also introduced James Laurenson as an original character, Major-General Ross, who took on the role given to Nairn in the book. The adaptation was faithful to the novel but omitted D'Alembord and Price along with various scenes, including much of the aftermath of the Hyde Park sequence."]}, {"page": "Catterick (TV series)", "response": ["Tony's Mum: Tony's mum (Julie T. Wallace) is very concerned about her son's behaviour, but is more than willing to give him what for if he steps out of line."]}, {"page": "The Thekla", "response": ["* Julie T. Wallace (actress)"]}, {"page": "List of Last of the Summer Wine characters", "response": ["| colspan=\"2\" | Julie T. Wallace", "(Julie T. Wallace, 2000–2001) Lolita “Lolly” Minerva Avery, known as Mrs. Avery to most, was Tom's live-in \"associate\"; much larger than him, and something of a battle-axe, yet rather easily manipulated. Although Tom always insisted that she was merely an acquaintance, Mrs Avery always wanted more, and was under the impression that Tom had promised to marry her. After a brief spell of living in the pair's bus, they moved into the deceased Compo's home, next-door to Nora Batty. During her stay at Compo's home, she began a rivalry with Nora, often copying each other (cleaning their windows or vacuuming their rugs). This was not to last; she threw Tom out and disappeared from the series after two years on the show."]}, {"page": "Julie (given name)", "response": ["* Julie T. Wallace (born 1961), English actress"]}, {"page": "Sharpe's Regiment (TV programme)", "response": ["* Julie T. Wallace as Maggie"]}, {"page": "Sir Bernard's Stately Homes", "response": ["Each house is named after a character or actor from Grange Hill.  Further popular culture is revisited at the end of episode 5, in which the pair eat snacks on a rollercoaster dressed as scouts, in a similar fashion to a group of scouts in a well-known edition of Jim'll Fix It.  David Foxxe, Paul Putner, Rowland Rivron, Rhys Thomas, and Julie T. Wallace appeared throughout the series. The script editor was Barry Cryer."]}, {"page": "Zorro (1990 TV series)", "response": ["* Julie T. Wallace"]}, {"page": "British Academy Television Award for Best Actress", "response": ["|Julie T. Wallace "]}, {"page": "Fags, Mags and Bags", "response": ["* Julie T. Wallace (The Fifth Element)"]}, {"page": "List of British actors", "response": ["* Julie T. Wallace (born 1961)"]}, {"page": "Anchoress (film)", "response": ["* Julie T. Wallace as Bertha"]}, {"page": "Edward Bryant (actor)", "response": ["He is perhaps best known for his appearances in the films Rita starring alongside Julie T. Wallace and the 2006 film The Rulers and Dealers by Stephen Lloyd Jackson with Philippe Deguara, Terence Anderson and Freema Agyeman in which he played Fletcher. He also played the character of Mum in Steven Berkoff's production of East which ran at the Vaudeville Theatre in London's West End theatre district during 1999."]}, {"page": "B. Monkey", "response": ["*Julie T. Wallace as Mrs. Sturge"]}, {"page": "Enchanted (Marc Almond album)", "response": ["Enchanted is the sixth studio album by the British singer/songwriter Marc Almond. It was released on 7 August 1990 and reached number 52 on the UK Albums Chart and number 81 on the Dutch albums chart. Enchanted includes the singles \"A Lover Spurned\" (a UK Top 30 hit featuring actress Julie T. Wallace), \"The Desperate Hours\" and \"Waifs and Strays\" (the latter of which was remixed by The Grid).", "**Julie T. Wallace – voice"]}, {"page": "Selling Hitler", "response": ["*Julie T. Wallace as Edith Lieblang"]}, {"page": "Lighthouse Hill (film)", "response": ["* Julie T. Wallace - Bunny "]}, {"page": "Big School (TV series)", "response": ["| Julie T. Wallace "]}, {"page": "The Life and Loves of a She-Devil (TV series)", "response": ["* Julie T. Wallace as Ruth", "| Julie T. Wallace", "| Julie T. Wallace "]}, {"page": "Julie Wallace", "response": ["#REDIRECT Julie T. Wallace"]}]}}