{"wiki_id": "http://www.wikidata.org/entity/Q4996724", "itemLabel": "Bulldog Irvine", "itemDescription": "Scottish rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Bulldog_Irvine", "wikipedia_page": {"main": "Doctor Robert W. Irvine, (1853–1897) nicknamed \"Bulldog\", was a Scotland international rugby football player.", "link_mentions": [{"page": "Edinburgh Academical Football Club", "response": ["*  Bulldog Irvine"]}, {"page": "Robert Irvine (disambiguation)", "response": ["*Bulldog Irvine (1853–1897), Scottish rugby player"]}, {"page": "Robert Irvine (rugby union)", "response": ["#REDIRECT Bulldog Irvine"]}, {"page": "Duncan Irvine", "response": ["He played for East of Scotland District against Edinburgh District in January 1887. His brother Bulldog Irvine played for Edinburgh; Duncan was deemed a Aberdeen Rangers player.", "His parents were Alexander Robertson Irvine and Sophia Jane Stewart Robertson. He married Sally Green in Victoria, Canada in 1900. He was the older brother of Bulldog Irvine, who was also capped for Scotland, including the first ever rugby international.Bath, p4"]}, {"page": "R.W. Irvine", "response": ["#REDIRECT Bulldog Irvine"]}, {"page": "RW Irvine", "response": ["#REDIRECT Bulldog Irvine"]}, {"page": "List of Scotland national rugby union players", "response": ["|11||IrvineBulldog Irvine||style=\"text-align:center; background:#ccffcc;\"|forward||1871-03-27||v England at Edinburgh"]}, {"page": "List of international rugby union families", "response": ["*Bulldog Irvine and Duncan Irvine; brothers"]}, {"page": "Irvine (name)", "response": ["*Bulldog Irvine (1853–1897), Scottish rugby union footballer"]}, {"page": "1873–74 Scottish Districts season", "response": ["Edinburgh District: J. L. Patullo (Edinburgh Wanderers), W. Blackwood (back), Angus Buchanan (Royal HSFP) (quarter back), G. Couper (Warriston) (half back), A. Finlay and J. Finlay- Forsyth, Bulldog Irvine (Edinburgh Academicals) (captain), J. Leslie (Royal HSFP) (back), R. Lindsay, John Lisle Hall McFarlane (Edinburgh University) (quarter back), Thomas Roger Marshall (Edinburgh Academicals) (half back), James Andrew Whitelock Mein (Edinburgh Academicals), Alexander Petrie (Royal HSFP), G. Rayner (Royal HSFP) (back), A. Reid, Duncan Robertson (Edinburgh Academicals) and James Robertson (Royal HSFP), Alexander Stewart (Edinburgh University) (quarter back), Charles Villar (Warriston), and P. Wood, A. C. Rose (Edinburgh Wanderers)", "Edinburgh District: J. Leslie (Royal HSFP), T. Marshall (Edinburgh Academicals), G. Rayner (Royal HSFP), J. McFarlane (Edinburgh University), G. Drysdale (Merchistonians), E. Carswell (Edinburgh Wanderers), Alexander Stewart (Edinburgh University), Bulldog Irvine (Edinburgh Academicals), J. Mein (Edinburgh Academicals), J. FInlay (Edinburgh Academicals), A. Finlay (Edinburgh Academicals), D. Robertson (Edinburgh Academicals), Arthur Young (Edinburgh Academicals), R. Lindsay (Edinburgh University), A. G. Petrie (Royal HSFP), J. Knott (Royal HSFP), J. G. Robertson (Edinburgh Academicals), J. Reid (Edinburgh Wanderers), Charles Villar (Warriston)"]}, {"page": "1874–75 Scottish Districts season", "response": ["Edinburgh District: R. Johnstone (Warriston), G. F. Raynor (Royal HSFP), N. J. Finlay (Edinburgh Academicals), J. Montgomery (Edinburgh Wanderers), L. Aitken (Edinburgh Academicals), W. Connell (Edinburgh Wanderers), George Paterson (Warriston), Bulldog Irvine (Edinburgh Academicals) [captain], J. Mein (Edinburgh Academicals), R. Duncan (Edinburgh Academicals), Arthur Marshall (Edinburgh Academicals), J. G. Petrie (Royal HSFP), A. Wood (Royal HSFP), James Robertson (Royal HSFP), J. Reid (Edinburgh Wanderers), C. Hawkins (Edinburgh Wanderers), C. Villar (Warriston), Nat Brewis (Edinburgh Institution F.P.), W. Forsyth (Edinburgh University), Gussie Graham (Edinburgh Academicals)"]}, {"page": "1875–76 Scottish Districts season", "response": ["Edinburgh District: R. Johnstone (Edinburgh Academicals), J. Smith (Edinburgh University), N. J. Finlay (Edinburgh Academicals), George Paterson (Edinburgh Academicals), G. A. Scott (Royal HSFP), J. Rutherford (Edinburgh Wanderers), James Robertson (Royal HSFP), Bulldog Irvine (Edinburgh Academicals), Arthur Marshall (Edinburgh Academicals), G. Finlay (Edinburgh Academicals), J. G. Coupar (Edinburgh Academicals), Gussie Graham (Edinburgh Academicals), J. Reid (Edinburgh Wanderers), C. Villar (Edinburgh Wanderers), A. G. Petrie (Royal HSFP), R. B. Murrie (Royal HSFP), J. G. Smith (Edinburgh University), Charles Walker Cathcart (Edinburgh University), G. Atkinson (Edinburgh University), N. T. Brewis (Institution)", "Edinburgh District: John Smith (Edinburgh University), Ninian Finlay (Edinburgh Academicals), G. A. Scott (Royal HSFP), George Paterson (Edinburgh Academicals), James Robertson (Royal HSFP), Bulldog Irvine (Edinburgh Academicals) [captain], Arthur Finlay (Edinburgh Academicals), G. Finlay (Edinburgh Academicals), Gussie Graham (Edinburgh Academicals), James Andrew Whitelock Mein (Edinburgh Academicals), R. B. Murrie (Royal HSFP), Charles Walker Cathcart (Edinburgh University), James Reid (Edinburgh Wanderers), Charles Villar (Edinburgh Wanderers), Nat Brewis (Edinburgh Institution F.P.)", "East of Scotland District: Backs: J. Smith (Edinburgh University), J. Leslie (Dundee);Half-backs: Ninian Finlay (Edinburgh Academicals), J. A. Scott (Royal HSFP),Quarter-backs: George Paterson (Edinburgh Academicals), R. Johnstone (Royal HSFP),Forwards: Bulldog Irvine (captain) (Edinburgh Academicals), G. Finlay (Edinburgh Academicals) Gussie Graham (Edinburgh Academicals),D. R. Irvine (Edinburgh Academicals), Thomas Torrie (Edinburgh Academicals), Alexander Petrie (Royal HSFP), R. B. Murrie (Royal HSFP),J. Reid (Edinburgh Wanderers), C. Hawkins (Edinburgh Wanderers), G. Atkinson (Edinburgh University), Charles Walker Cathcart (Edinburgh University),L. A. Auldjo (Abertay), D. Barron (St Andrews University), H. Hill (Dundee) "]}, {"page": "East of Scotland District (rugby union)", "response": ["*  Bulldog Irvine"]}]}}