{"wiki_id": "http://www.wikidata.org/entity/Q5006493", "itemLabel": "C. H. Herford", "itemDescription": "British literary scholar and critic", "wikipedia_url": "https://en.wikipedia.org/wiki/C._H._Herford", "wikipedia_page": {"main": "Charles Harold Herford, FBA (18 February 1853 – 25 April 1931) was an English literary scholar and critic. He is remembered principally for his biography and edition of the works of Ben Jonson in 11 volumes. This major scholarly project was published from 1925 onwards by Oxford University Press, and completed with Percy and Evelyn Simpson. It took half a century, being agreed on in 1902.", "link_mentions": [{"page": "The Winter's Tale", "response": ["A theory explaining the existence of the seacoast in Bohemia offered by C. H. Herford is suggested in Shakespeare's chosen title of the play. A winter's tale is something associated with parents telling children stories of legends around a fireside: by using this title, it implies to the audience that these details should not be taken too seriously.See C.H. Herford, ed. The Winter's Tale, The Warwick Shakespeare edition, p.xv."]}, {"page": "Nicholas Grimald", "response": ["** C. H. Herford, Studies in the Literary Relations of England and Germany (pp. 113–119, 1886). "]}, {"page": "Sebastian Brant", "response": ["*C. H. Herford, The Literary Relations of England and Germany in the 16th Century (1886) discusses the influence of Brant in England."]}, {"page": "Robert Southwell (Jesuit)", "response": ["Ben Jonson remarked to Drummond of Hawthornden that \"so he had written that piece of [Southwell's], 'The Burning Babe', he would have been content to destroy many of his.\"Ben Jonson. Works. Ed. C. H. Herford and Percy Simpson. 11 Vols. Oxford: The Clarendon Press, 1925–52, 1.137. In fact, there is a strong case to be made for Southwell's influence on his contemporaries and successors, among them Drayton, Lodge, Nashe, Herbert, Crashaw, and especially Shakespeare, who seems to have known his work, both poetry and prose, extremely well.Brownlow, pp.93–6, 125. Also John Klause. Shakespeare, the Earl and the Jesuit. Madison & Teaneck, NJ: Fairleigh Dickinson University Press, 2008, passim."]}, {"page": "Mermaid Series", "response": ["Notes by Brinsley Nicholson and C. H. Herford, three volumes"]}, {"page": "Charles Harold Herford", "response": ["#REDIRECT C. H. Herford"]}, {"page": "Charles Herford", "response": ["#REDIRECT C. H. Herford"]}, {"page": "Charles H. Herford", "response": ["#REDIRECT C. H. Herford"]}, {"page": "Siegfried Herford", "response": ["Siegfried Herford was born in 1891, the son of academic C. H. Herford. As a child he may have been autistic, subject to long periods of silence punctuated by violent outbursts of physical energy—behaviour coupled with a natural proclivity to mathematical thought. Siegfried enrolled at the University of Manchester in 1909, in the School of Engineering, and dabbled at rock climbing for a year or so. By 1911 he had invented the \"girdle traverse\", practising at Castle Naze in the Derbyshire Peak District before applying his concept to the face of Scafell. Although Herford spent considerable time on the crags, the quality of  his academic work was superior, and he was at the top of his class in mathematics and physics when he graduated in 1912. He then received a postgraduate scholarship which allowed him to do aeronautical research at the Royal Aircraft Factory at Farnborough."]}, {"page": "Herford, Charles Harold", "response": ["#REDIRECT C. H. Herford"]}, {"page": "C H Herford", "response": ["#REDIRECT C. H. Herford "]}, {"page": "C.H. Herford", "response": ["#REDIRECT C. H. Herford "]}, {"page": "CH Herford", "response": ["#REDIRECT C. H. Herford "]}, {"page": "Red Cotton Night-Cap Country", "response": ["Red Cotton Night-Cap Country, or Turf and Towers (1873) is a poem in blank verse by Robert Browning. It tells a story of sexual intrigue, religious obsession and violent death in contemporary Paris and Normandy, closely based on the true story of the death, supposedly by suicide, of the jewellery heir Antoine Mellerio.  Red Cotton Night-Cap Country has never been one of Browning's more popular poems, originally because of the perceived sordidness of the story, and later on grounds thus summarised by the critic C. H. Herford:", "The poet followed on the heels of the journalist, and borrowed, it must be owned, not a little of his methods. If any poem of Browning's may be compared to versified special correspondence, it is this. He tells the story, in his own person, in blank verse of admirable ease and fluency, from which every pretence of poetry is usually remote.C. H. Herford Robert Browning (Edinburgh: William Blackwood, 1905) p. 107."]}, {"page": "R. Travers Herford", "response": ["He was the grandson of John Gooch Robberds and brother of Professor C. H. Herford, of Manchester University.Essays and addresses p96 Herbert McLachlan - 1950 \"John Gooch Robberds was the grandfather of Professor C. H. Herford, of Manchester University, and Dr. R. Travers Herford, the rabbinical scholar, both of whom were reared in the Cross Street tradition\" Herford was educated at Owens College, Manchester, and Manchester New College, London (B.A. 1880) Then, as a Hibbert Scholar, he studied at the University of Leiden.Joseph Estlin Carpenter Freedom and truth: modern views of Unitarian Christianity   1925 \"R. Travers Herford was born in 1860, and was educated at Owens College, Manchester, and Manchester New College, London, graduating BA in 1880. Subsequently, as a Hibbert Scholar, he studied at the University of Leiden\" From 1914 to 1925 he was librarian of Dr Williams's Library, Grafton Street, London.Pirke Aboth: the Ethics of the Talmud : Sayings of the Fathers Robert Travers Herford - 1962."]}, {"page": "Taylorian Lecture", "response": ["*1897: C. H. Herford, “Goethe’s Italian Journey”"]}, {"page": "Herford (surname)", "response": ["* C. H. Herford (1853–1931), English literary scholar"]}, {"page": "Brinsley Nicholson", "response": ["Encouraged by William Tennant Gairdner, Nicholson brought out in 1886 a reprint of Reginald Scot's Discoverie of Witchcraft (1584). His edition of The Best Plays of Ben Jonson, which was published posthumously in 1893, with an introduction by C. H. Herford, in the Mermaid Series (3 vols.) His edition of John Donne's poems was completed for the Muses' Library in 1895."]}, {"page": "List of fellows of the British Academy elected in the 1920s", "response": ["* Professor C. H. Herford"]}]}}