{"wiki_id": "http://www.wikidata.org/entity/Q5006543", "itemLabel": "C. J. F. Williams", "itemDescription": "British logician (1930-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/C._J._F._Williams", "wikipedia_page": {"main": "Christopher John Fardo Williams (31 December 1930 – 25 March 1997) was a British philosopher. His areas of interest were philosophical logic, on which topic he did most of his original work, and ancient philosophy, as an editor and translator.", "link_mentions": [{"page": "Truth", "response": ["A variant of redundancy theory is the disquotational theory which uses a modified form of Tarski's schema: To say that '\"P\" is true' is to say that P.  A version of this theory was defended by C. J. F. Williams in his book What is Truth?  Yet another version of deflationism is the prosentential theory of truth, first developed by Dorothy Grover, Joseph Camp, and Nuel Belnap as an elaboration of Ramsey's claims.  They argue that sentences like \"That's true\", when said in response to \"It's raining\", are prosentences, expressions that merely repeat the content of other expressions.  In the same way that it means the same as my dog in the sentence My dog was hungry, so I fed it, That's true is supposed to mean the same as It's raining—if you say the latter and I then say the former.  These variations do not necessarily follow Ramsey in asserting that truth is not a property, but rather can be understood to say that, for instance, the assertion \"P\" may well involve a substantial truth, and the theorists in this case are minimizing only the redundancy or prosentence involved in the statement such as \"that's true.\""]}, {"page": "Identity (philosophy)", "response": ["Some philosophers have denied that there is such a relation as identity. Thus Ludwig Wittgenstein writes (Tractatus 5.5301): \"That identity is not a relation between objects is obvious.\" At 5.5303 he elaborates: \"Roughly speaking: to say of two things that they are identical is nonsense, and to say of one thing that it is identical with itself is to say nothing.\" Bertrand Russell had earlier voiced a worry that seems to be motivating Wittgenstein's point (The Principles of Mathematics §64): \"[I]dentity, an objector may urge, cannot be anything at all: two terms plainly are not identical, and one term cannot be, for what is it identical with?\" Even before Russell, Gottlob Frege, at the beginning of \"On Sense and Reference,\" expressed a worry with regard to identity as a relation: \"Equality gives rise to challenging questions which are not altogether easy to answer. Is it a relation?\" More recently, C. J. F. WilliamsC.J.F. Williams, What is identity?, Oxford University Press 1989. has suggested that identity should be viewed as a second-order relation, rather than a relation between objects, and Kai WehmeierKai F. Wehmeier, \"How to live without identity—and why,\" Australasian Journal of Philosophy 90:4, 2012, pp. 761–777. has argued that appealing to a binary relation that every object bears to itself, and to no others, is both logically unnecessary and metaphysically suspect."]}, {"page": "Midsomer Norton", "response": ["* C. J. F. Williams (1930–1997), philosopher"]}, {"page": "List of Catholic philosophers and theologians", "response": ["*C. J. F. Williams (1930-1997)"]}, {"page": "Christopher Williams", "response": ["*C. J. F. Williams (1930–1997), English philosopher"]}, {"page": "List of philosophers born in the 20th century", "response": ["* C. J. F. Williams (1930–1997)"]}, {"page": "Analysis (journal)", "response": ["* 1971–1976 C. J. F. Williams"]}, {"page": "Plato's beard", "response": ["The argument has been favored by prominent philosophers including Bertrand Russell, A. J. Ayer and C. J. F. Williams. Declaring that not p (¬p) cannot exist, one may be forced to abandon truisms such as negation and modus tollens. There are also variations to Quine's original, which included its application both to singular and general terms. Quine initially applied the doctrine to singular terms only before expanding it so that it covers general terms as well."]}, {"page": "Deaths in March 1997", "response": ["*C. J. F. Williams, 66, British philosopher, cardiac arrest."]}]}}