{"wiki_id": "http://www.wikidata.org/entity/Q5022998", "itemLabel": "Callum Wilson", "itemDescription": "English association football player, born 1992", "wikipedia_url": "https://en.wikipedia.org/wiki/Callum_Wilson_(footballer,_born_1992)", "wikipedia_page": {"main": "Callum Eddie Graham Wilson (born 27 February 1992) is an English professional footballer who plays as a striker for Premier League club Newcastle United and the England national team.", "link_mentions": [{"page": "Newcastle United F.C.", "response": ["|2021|| Callum Wilson"]}, {"page": "AFC Bournemouth", "response": ["In Bournemouth's first season in the Premier League, the team was beset by a number of crippling injuries, including to Callum Wilson, star striker from the previous season. The team struggled for most of the first half of the season but an upturn in form during the second half of the season saw a reversal of fortunes. Bournemouth eventually finished 16th in the league, avoiding relegation.", "|align=\"left\"|Callum Wilson", "| Callum Wilson"]}, {"page": "Tamworth F.C.", "response": ["* Callum Wilson"]}, {"page": "Eddie Howe", "response": ["Howe was appointed to replace Steve Bruce as the manager of Premier League club Newcastle United on 8 November 2021, signing a contract until the summer of 2024. Howe watched from the stands as the club drew 1–1 with Brighton & Hove Albion, in which Graeme Jones was acting as caretaker manager, who was retained as first team assistant coach as part of Howe's new coaching staff, which also included Jason Tindall, Stephen Purches and Simon Weatherstone, whom he worked with at AFC Bournemouth, as well as retained Newcastle goalkeeping coach Simon Smith. His appointment at Newcastle also reunited him with former players at AFC Bournemouth, such as Callum Wilson, Matt Ritchie and Ryan Fraser. On 19 November 2021, Newcastle announced that Howe had tested positive for COVID-19 and would miss the first game in charge. He watched his first game as manager from a hotel room as Newcastle drew 3–3 with Brentford on 20 November."]}, {"page": "England national football team records and statistics", "response": ["|Callum Wilson", "|Callum Wilson"]}, {"page": "Darren O'Dea", "response": ["O'Dea then signed with championship club Blackpool in December 2014, making his debut in a 6–1 loss to Bournemouth. Bournemouth's fourth goal was scored by Brett Pitman, converting a penalty shot incurred by O'Dea (who fouled Callum Wilson in the penalty area). Against Wolverhampton Wanderers, the BBC reported that he \"got into a terrible muddle trying to cut out a pass from Kevin McDonald\" and allowed Benik Afobe (in his first game for Wolverhampton) to score the second goal. O'Dea was injured in a match against Nottingham Forest in February 2015, forcing him to miss the game with Blackburn Rovers. Released when his contract expired in May, he said the club had a \"disastrous season\". O'Dea played 20 times for Blackpool."]}]}}