{"wiki_id": "http://www.wikidata.org/entity/Q5028122", "itemLabel": "Campbell Money", "itemDescription": "Scottish footballer and manager (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Campbell_Money", "wikipedia_page": {"main": "Israel Campbell Money (born 31 August 1960 in Maybole, Ayrshire) is a Scottish former football goalkeeper and former manager of Stranraer, Ayr United and Stenhousemuir.", "link_mentions": [{"page": "Campbell", "response": ["* Campbell Money (born 1960), Scottish footballer"]}, {"page": "Ayr United F.C.", "response": ["| Campbell Money"]}, {"page": "Stranraer F.C.", "response": ["With the league reformation at the end of the 1993–94 season, champions Stranraer found themselves leapfrogging six relegated teams and playing in the new First Division in season 1994–95, finishing last, with only 17 points from 36 games. With Campbell Money at the helm Stranraer spent three seasons in the Second Division before winning promotion back to the First Division at the end of the 1997–98 season. Once again, they finished bottom of the league, with the same points total as before and 29 defeats. During that season a notable league win was secured at Easter Road against Hibernian. During Money's reign the club lifted the Scottish League Challenge Cup, defeating St Johnstone 1–0 at Broadwood on 3 November 1996. Saints' Danny Griffin was the unfortunate scorer of an own goal."]}, {"page": "List of one-club men in association football", "response": ["|align=\"left\"|||align=\"left\"|Scotland||St Mirren||1981||2006||15||336Campbell Money , Post War English & Scottish Football League A–Z Players Database"]}, {"page": "2006–07 in Scottish football", "response": ["| Stenhousemuir ||  Des McKeown || Resigned || 1 November 2006 ||  Campbell Money || 10 November 2006"]}, {"page": "2007–08 in Scottish football", "response": ["| Stenhousemuir ||  Campbell Money || Resigned || 29 September ||  John Coughlin || 12 October"]}, {"page": "Kenny McDowall", "response": ["During his playing career, McDowall played for Partick Thistle and St Mirren; he was top scorer for formative club Partick in 1983–841980 - Easter Youth in Lille, Partick Thistle History Archive when playing as a striker after replacing his friend Mo Johnston who had left the Jags for England a year earlier,Kenny sets his sights on top, Evening Times, 29 September 1984, via Partick Thistle History Archive and after transferring to St Mirren soon afterwards (involving a £30,000 cash-plus-player deal involving Alan Logan)1984 Logan Arrives McDowall Departs, Partick Thistle History Archive he featured in the 1987 Scottish Cup Final as the Buddies defeated Dundee United 1–0. Later converting to a midfielder (and deputising in an emergency for injured goalkeeper Campbell Money),Dundee Utd 2 St Mirren 3 | League (Premier Division), Arab Archive he made a total of 291 appearances for St Mirren before retiring due to injury in 1993, and was rewarded with a testimonial in 1996Photo: 1996 Kenny McDowall Benefit, Partick Thistle History Archive after twelve years service at the Paisley club, including the last three as coach and assistant manager."]}, {"page": "2007–08 Scottish Third Division", "response": ["|  Campbell Money"]}]}}