{"wiki_id": "http://www.wikidata.org/entity/Q5026253", "itemLabel": "Cameron Gordon", "itemDescription": "American mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Cameron_Gordon_(mathematician)", "wikipedia_page": {"main": "Cameron Gordon (born 1945) is a Professor and Sid W. Richardson Foundation Regents Chair in the Department of Mathematics at the University of Texas at Austin, known for his work in knot theory.  Among his notable results is his work with Marc Culler, John Luecke, and Peter Shalen on the cyclic surgery theorem.  This was an important ingredient in his work with Luecke showing that knots were determined by their complement. Gordon was also involved in the resolution of the Smith conjecture.\nAndrew Casson  and Gordon defined and proved basic theorems regarding strongly irreducible Heegaard splittings, an important concept in the modernization of Heegaard splitting theory. They also worked on the slice-ribbon conjecture, inventing the Casson-Gordon invariants in the process.\nGordon was a 1999 Guggenheim Fellow.\nIn 2005 Gordon was elected a Corresponding Fellow of the Royal Society of Edinburgh.", "link_mentions": [{"page": "Figure-eight knot (mathematics)", "response": ["* Robion Kirby, Problems in low-dimensional topology, (see problem 1.77, due to Cameron Gordon, for exceptional slopes)"]}, {"page": "List of conjectures", "response": ["|c.1984||Collective work||Smith conjecture||knot theory||Based on work of William Thurston on hyperbolic structures on 3-manifolds, with results by William Meeks and Shing-Tung Yau on minimal surfaces in 3-manifolds, also with Hyman Bass, Cameron Gordon, Peter Shalen, and Rick Litherland, written up by Bass and John Morgan."]}, {"page": "List of Guggenheim Fellowships awarded in 1999", "response": ["* Cameron Gordon, Sid W. Richardson Foundation Regents Professor of Mathematics, University of Texas at Austin: Studies in three-dimensional manifolds."]}, {"page": "Peter Shalen", "response": ["His work with Marc Culler related properties of  representation varieties of hyperbolic 3-manifold groups to decompositions of 3-manifolds.  Based on this work, Culler, Cameron Gordon, John Luecke, and Shalen proved the cyclic surgery theorem.  An important corollary of the theorem is that at most one nontrivial Dehn surgery (+1 or −1) on a knot can result in a simply-connected 3-manifold.   This was an important piece of the Gordon–Luecke theorem that knots are determined by their complements.  This paper is often referred to as \"CGLS\"."]}, {"page": "Hyperbolic Dehn surgery", "response": ["The figure-eight knot and the (-2, 3, 7) pretzel knot are the only two knots whose complements are known to have more than 6 exceptional surgeries; they have 10 and 7, respectively.  Cameron Gordon conjectured that 10 is the largest possible number of exceptional surgeries of any hyperbolic knot complement.  This was proved by Marc Lackenby and Rob Meyerhoff, who show that the number of exceptional slopes is 10 for any compact orientable 3-manifold with boundary a torus and interior finite-volume hyperbolic.  Their proof relies on the proof of the geometrization conjecture originated by Grigori Perelman and on computer assistance.  However, it is not currently known whether the figure-eight knot is the only one that achieves the bound of 10.  A well-known conjecture is that the bound (except for the two knots mentioned) is 6.  Agol has shown that there are only finitely many cases in which the number of exceptional slopes is 9 or 10.", "*Robion Kirby, Problems in low-dimensional topology, (see problem 1.77, due to Cameron Gordon, for exceptional slopes)"]}, {"page": "Smith conjecture", "response": [" showed that a non-trivial orientation-preserving diffeomorphism of finite order with fixed points must have a fixed point set equal to a circle, and asked in  if the fixed point set could be knotted.   proved the Smith conjecture for the special case of diffeomorphisms of order 2 (and hence any even order).  The proof of the general case was  described by  and depended on several major advances in 3-manifold theory, In particular the work of William Thurston on hyperbolic structures on 3-manifolds, and results by William Meeks and Shing-Tung Yau on minimal surfaces in 3-manifolds, with some additional help from Bass,  Cameron Gordon, Peter Shalen, and Rick Litherland."]}, {"page": "Cameron Gordon", "response": ["Cameron Gordon may refer to:", "* Cameron Gordon (mathematician), professor of mathematics at the University of Texas, Austin", "* Cameron Gordon (American football) (born 1991), American football linebacker"]}, {"page": "Gordon–Luecke theorem", "response": ["The theorem was proved by Cameron Gordon and John Luecke.  Essential ingredients of the proof are their joint work with Marc Culler and Peter Shalen on the cyclic surgery theorem, combinatorial techniques in the style of Litherland, thin position, and Scharlemann cycles.", "*Cameron Gordon and John Luecke, Knots are determined by their complements.  J. Amer. Math. Soc. 2 (1989), no. 2, 371–415. ", "*Cameron Gordon, Links and their complements.  Topology and geometry: commemorating SISTAG, 71–82, Contemp. Math., 314, Amer. Math. Soc., Providence, RI, 2002."]}, {"page": "List of people by Erdős number", "response": ["* Cameron Gordon"]}, {"page": "Berge knot", "response": ["John Berge constructed these knots as a way of creating knots with lens space surgeries and classified all the Berge knots. Cameron Gordon conjectured these were the only knots admitting lens space surgeries. This is now known as the Berge conjecture."]}, {"page": "Marc Culler", "response": ["incompressible surfaces in the manifold.  Based on this work, Shalen, Cameron Gordon, John Luecke, and Culler proved the cyclic surgery theorem."]}, {"page": "Cyclic surgery theorem", "response": ["In three-dimensional topology, a branch of mathematics, the cyclic surgery theorem states that, for a compact, connected, orientable, irreducible three-manifold M whose boundary is a torus T, if M is not a Seifert-fibered space and r,s are slopes on T such that their Dehn fillings have cyclic fundamental group, then the distance between r and s (the minimal number of times that two simple closed curves in T representing r and s must intersect) is at most 1. Consequently, there are at most three Dehn fillings of M with cyclic fundamental group. The theorem appeared in a 1987 paper written by Marc Culler, Cameron Gordon, John Luecke and Peter Shalen.M. Culler, C. Gordon, J. Luecke, P. Shalen (1987). Dehn surgery on knots. The Annals of Mathematics (Annals of Mathematics) 125 (2): 237-300."]}, {"page": "John Edwin Luecke", "response": ["Luecke specializes in  knot theory and 3-manifolds. In a 1987 paperM. Culler, C. Gordon, J. Luecke, P. Shalen (1987). Dehn surgery on knots. The Annals of Mathematics (Annals of Mathematics) 125 (2): 237-300. Luecke, Marc Culler, Cameron Gordon, and Peter Shalen proved the cyclic surgery theorem.  In a 1989 paperCameron Gordon and John Luecke, Knots are determined by their complements.  J. Amer. Math. Soc. 2 (1989), no. 2, 371–415. Luecke and Cameron Gordon proved that knots are determined by their complements, a result now known as the Gordon–Luecke theorem."]}, {"page": "List of International Congresses of Mathematicians Plenary and Invited Speakers", "response": ["*Cameron Gordon"]}]}}