{"wiki_id": "http://www.wikidata.org/entity/Q5024038", "itemLabel": "Calum MacDonald", "itemDescription": "British politician (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Calum_MacDonald_(politician)", "wikipedia_page": {"main": "Calum Alistair MacDonald (Scottish Gaelic: Calum Alasdair Dòmhnallach; born 7 May 1956) is a Scottish former politician who served as Member of Parliament (MP) for Western Isles from 1987 to 2005. A member of the Labour Party, he was a Parliamentary Under-Secretary of State for Scotland from 1997 to 1999.\n\n", "link_mentions": [{"page": "Judit Polgár", "response": ["In 1995, the Isle of Lewis chess club in Scotland attempted to arrange a game between Polgár and Nigel Short in which the famous Lewis chessmen would be used. The Lewis chessmen is a chess set carved in the 12th century. However, the British Museum refused to release the set despite assurances that the players would wear gloves. Scottish member of parliament Calum MacDonald pointed out that the set would be safe, especially as chess was not a contact sport. In the end, the Museum allowed the chess set to be displayed at the Isle of Lewis festival tournament, but they were not used in any games. Polgár won the double round-robin tournament of four GMs, scoring five points in the six games and winning both her games against Short."]}, {"page": "May 7", "response": ["*  1956   – Calum MacDonald, Scottish journalist and politician"]}, {"page": "Donald Stewart (Scottish politician)", "response": ["In March 1985 Stewart announced he would retire from front-line politics at the next election, although continued to represent the Western Isles until 1987.  At the General Election of that year his replacement as SNP candidate Ian Smith, then the party's spokesman on transport, was defeated by Calum MacDonald of the Labour Party. The SNP vote dropped by 26% and the constituency saw an SNP to Labour swing of 19.6% in what was included by election analysts David Butler and Robert Waller as among the \"exceptional results\" seen in \"individual constituencies\" in that election."]}, {"page": "Maastricht Rebels", "response": ["At Third Reading, on 20 May 1993, the Labour whip was to abstain. Despite this, 66 Labour MPs chose to vote against the Bill, while five (Andrew Faulds, John Home Robertson, Calum MacDonald, Giles Radice and Brian Sedgemore) supported the Government. The Bill passed Third Reading 292–112."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Calum MacDonald"]}, {"page": "Calum Alistair Macdonald", "response": ["#REDIRECT Calum MacDonald (politician)"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Calum MacDonald"]}, {"page": "Stornoway", "response": ["*Calum MacDonald - politician"]}, {"page": "Calum Alasdair Macdonald", "response": ["#redirect Calum MacDonald (politician)"]}, {"page": "List of University of California, Los Angeles people", "response": ["* Calum MacDonald – former Member of Parliament in the United Kingdom"]}, {"page": "Point, Lewis", "response": ["*Calum MacDonald: Retired MP for the Western Isles"]}, {"page": "Na h-Eileanan an Iar (UK Parliament constituency)", "response": ["| Calum MacDonald"]}]}}