{"wiki_id": "http://www.wikidata.org/entity/Q5028081", "itemLabel": "Campbell Hardy", "itemDescription": "Royal Amrines general", "wikipedia_url": "https://en.wikipedia.org/wiki/Campbell_Hardy", "wikipedia_page": {"main": "General Sir Campbell Richard Hardy,  (24 May 1906 – 29 July 1984) was a Royal Marines officer who served as Commandant General Royal Marines from 1955 to 1959.", "link_mentions": [{"page": "3 Commando Brigade", "response": ["*1944–1945 Brigadier Campbell Hardy", "*1948–1951 Brigadier Campbell Hardy"]}, {"page": "No. 5 Commando", "response": ["In late December 1944 XV Corps, under Lieutenant General Philip Christison, went on the offensive and on 29 December the 3rd Commando Brigade, then commanded by Brigadier Campbell Hardy,Sir Campbell Richard Hardy, later Commandant-General of the Royal Marines. carried out an unopposed landing on the island of Akyab.Saunders 1959, p. 310. Following this reconnaissance operations were undertaken around the Myebon Peninsula and on the surrounding islands. During one of these patrols, a group of commandos from No. 5 Commando had a brief contact with a Japanese force during which they killed four of them without suffering loss themselves."]}, {"page": "No. 46 (Royal Marine) Commando", "response": ["No. 46 (Royal Marine) Commando was formed in August 1943, under the command of Lieutenant Colonel Campbell Hardy as part of the conversion of the Royal Marines Division into commandos. Following training it was allocated to the 1st Special Service Brigade. It took part in the Normandy landings of 6 June 1944, serving on the Orne River bridgehead alongside the British 6th Airborne Division. It suffered heavy casualties in Normandy and at the end of September 1944 was returned to the United Kingdom to refit. Returning to mainland Europe in January 1945 it was the Antwerp guard force. The commando then participated in a number of assault river crossings during the advance into Germany. At the end of the war the commando took part in the occupation of Germany before being disbanded in February 1946.Moreman, p.93"]}, {"page": "Battle of Hill 170", "response": ["In late December 1944, XV Indian Corps—commanded by Lieutenant General Christison—went on the offensive, and on 29 December the 3rd Commando Brigade—then commanded by Brigadier Campbell Hardy—carried out an unopposed landing on the island of Akyab.Saunders, p. 310 Following this reconnaissance, operations were undertaken around the Myebon Peninsula and on the surrounding islands. During one of these patrols, a group of commandos from No. 5 Commando had a brief contact with a Japanese force during which they killed four Japanese without suffering loss themselves."]}, {"page": "List of Old Felstedians", "response": ["* General Sir Campbell Hardy (1906–84), Commandant Gen. Royal Marines (1955–59), Dir. Coal Utilization Council 1960–70 (Who's Who)"]}, {"page": "List of Royal Marines full generals", "response": ["| Sir Campbell Hardy"]}, {"page": "Sir Campbell Hardy", "response": ["#REDIRECT Campbell Hardy"]}]}}