{"wiki_id": "http://www.wikidata.org/entity/Q5021365", "itemLabel": "Stanley Cohen", "itemDescription": "British sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Cohen_(sociologist)", "wikipedia_page": {"main": "Stanley Cohen  (23 February 1942 – 7 January 2013) was a sociologist and criminologist, Professor of Sociology at the London School of Economics, known for breaking academic ground on \"emotional management\", including the mismanagement of emotions in the form of sentimentality, overreaction, and emotional denial. He had a lifelong concern with human rights violations, first growing up in South Africa, later studying imprisonment in England and finally in Palestine. He founded the Centre for the Study of Human Rights at the London School of Economics.", "link_mentions": [{"page": "Vandalism", "response": ["Criminological research into vandalism has found that it serves many purposes for those who engage in it and stems from a variety of motives. Sociologist Stanley Cohen describes seven different types of vandalism:Cohen 1973."]}, {"page": "Satanic panic", "response": ["SRA and the so-called \"Satanic Panic\" have been called a moral panic and compared to the blood libel and witch-hunts of historical Europe, and McCarthyism in the United States during the 20th century. Stanley Cohen, who originated the term moral panic, called the episode \"one of the purest cases of moral panic.\" The initial investigations of SRA were performed by anthropologists and sociologists, who failed to find evidence of SRA actually occurring; instead they concluded that SRA was a result of rumors and folk legends that were spread by \"media hype, Christian fundamentalism, mental health and law enforcement professionals and child abuse advocates.\" Sociologists and journalists noted the vigorous nature with which some evangelical activists and groups were using claims of SRA to further their religious and political goals. Other commentators suggested that the entire phenomenon may be evidence of a moral panic over Satanism and child abuse. Skeptical explanations for allegations of SRA have included an attempt by radical feminists to undermine the nuclear family, a backlash against working women, homophobic attacks on gay childcare workers, a universal need to believe in evil, fear of alternative spiritualities, \"end of the millennium\" anxieties, or a transient form of temporal lobe epilepsy."]}, {"page": "Moral panic", "response": ["Stanley Cohen, who developed the term, states that moral panic happens when \"a condition, episode, person or group of persons emerges to become defined as a threat to societal values and interests.\" While the issues identified may be real, the claims \"exaggerate the seriousness, extent, typicality and/or inevitability of harm.\" The concept of moral panic can now be found in several disciplines, including sociology and criminology, media studies, and cultural studies.", "As a social theory or sociological concept, the concept was first developed in the United Kingdom by Stanley Cohen, who introduced the phrase moral panic in a 1967–69 PhD thesis that became the basis for his 1972 book Folk Devils and Moral Panics. In the book, Cohen describes the reaction among the British public to the rivalry between the \"mod\" and \"rocker\" youth subcultures of the 1960s and 1970s. Cohen's initial development of the concept was for the purpose of analyzing the definition of and social reaction to these subcultures as a social problem.Mannion, Russell, and Neil Small. 2019 December 1. \"On Folk Devils, Moral Panics and New Wave Public Health.\" International Journal of Health Policy and Management 8(12):678-83. . .", "First to name the phenomenon, Stanley Cohen investigated a series of \"moral panics\" in his 1972 book Folk Devils and Moral Panics. In the book, Cohen describes the reaction among the British public to the seaside rivalry between the \"mod\" and \"rocker\" youth subcultures of the 1960s and 1970s. In a moral panic, Cohen says, \"the untypical is made typical.\"", "In early 1960s Britain, the two main youth subcultures were Mods and Rockers. The \"Mods and Rockers\" conflict was explored as an instance of moral panic by sociologist Stanley Cohen in his seminal study Folk Devils and Moral Panics,Cohen, Stanley (2002). Folk devils and moral panics: the creation of the Mods and Rockers. London New York: Routledge. . which examined media coverage of the Mod and Rocker riots in the 1960s.British Film Commission (BFC) (PDF), Film Education."]}, {"page": "Mods and rockers", "response": ["His retrospective study of the mods and rockers conflict led sociologist Stanley Cohen to develop the term \"moral panic\". In his 1972 study Folk Devils and Moral Panics, he examined media coverage of the mod and rocker riots in the 1960s. He concedes that mods and rockers had some fights in the mid-1960s, but argues that they were no different from the evening brawls that occurred between youths throughout the 1950s and early 1960s, both at seaside resorts and after football games. He argues that the UK media turned the mod subculture into a negative symbol of delinquent and deviant status.Cohen, Stanley. Folk Devils and Moral Panics, p. 27."]}, {"page": "List of sociologists", "response": ["* Stanley Cohen, British sociologist (criminology)"]}, {"page": "Stanley Cohen", "response": ["Stan or Stanley Cohen may refer to:", "* Stanley Cohen (biochemist) (1922–2020), American Nobel Prize Laureate in Physiology and Medicine", "* Stanley Cohen (physicist) (1927–2017), founder and president of Speakeasy Computing Corporation", "* Stanley Cohen (sociologist) (1942–2013), Martin White Professor of Sociology at the London School of Economics", "* Stanley Cohen (attorney) (born 1953), attorney and human rights advocate"]}, {"page": "Folk devil", "response": ["The concept of the folk devil was introduced by sociologist Stanley Cohen in  1972, in his study Folk Devils and Moral Panics,Cohen, S. (1973). Folk Devils and Moral Panics. St Albans: Paladin which analysed media controversies concerning Mods and Rockers in the United Kingdom of the 1960s.", "The backlash against goth subculture after the Columbine shooting draws many parallels to Stanley Cohen's research on the mods and rockers, two other youth subcultures cast as folk devils by society. In both instances the groups were portrayed in one distinct, dumbed-down image, ostracized, stripped of any redeeming qualities, and blamed for wrongdoings in society.Griffiths, Richard. \"The Gothic Folk Devils Strike Back! Theorizing Folk Devil Reaction in the Post-Columbine Era.\" Journal of Youth Studies 13.3 (2010): 403-22. Print."]}, {"page": "C. Wright Mills", "response": ["Stanley Cohen: was a sociologist and criminologist, Professor of Sociology at the London School of Economics, known for breaking academic ground on \"emotional management\", including the mismanagement of emotions in the form of sentimentality, overreaction, and emotional denial."]}, {"page": "Deviancy amplification spiral", "response": ["According to sociologist Stanley Cohen, the spiral starts with some deviant act. Usually the deviance is criminal, but it can also involve lawful acts considered morally repugnant by a large segment of society. With the new focus on the issue, hidden or borderline examples that would not themselves have been newsworthy are reported, confirming the pattern."]}, {"page": "Mod (subculture)", "response": ["During the early to mid-1960s, as mod grew and spread throughout the UK, certain elements of the mod scene became engaged in well-publicised clashes with members of a rival subculture: rockers.  The mods and rockers conflict led sociologist Stanley Cohen to use the term \"moral panic\" in his study about the two youth subcultures, which examined media coverage of the mod and rocker riots in the 1960s.", "John Covach wrote that in the United Kingdom, rockers were often engaged in brawls with mods. BBC News stories from May 1964 stated that mods and rockers were jailed after riots in seaside resort towns on the south and east coasts of England, such as Margate, Brighton, Bournemouth and Clacton. The \"mods and rockers\" conflict was explored as an instance of \"moral panic\" by sociologist Stanley Cohen in his study Folk Devils and Moral Panics, which examined media coverage of the mod and rocker riots in the 1960s. Although Cohen acknowledged that mods and rockers had some fights in the mid-1960s, he argued that they were no different from the evening brawls that occurred between non-mod and non-rocker youths throughout the 1950s and early 1960s, both at seaside resorts and after football games.Cohen, Stanley. Folk Devils and Moral Panics. page 27"]}, {"page": "Rocker (subculture)", "response": ["The mass media started targeting these socially powerless youths and cast them as \"folk devils\", creating a moral panicStanley Cohen; (1972). Folk Devils and Moral Panics; The Creation of the Mods and Rockers Routledge. . through highly exaggerated and ill-founded portrayals.Resistance through rituals: youth subcultures in post-war Britain By Stuart Hall, Tony Jefferson. Routledge, 1990. The sociology of youth culture and youth subcultures: Sex and drugs and rock 'n' roll by Mike Brake 1980 Routledge & Kegan Paul,  From the 1960s on, due to the media fury surrounding the mods and rockers, motorcycling youths became more commonly known as rockers, a term previously little known outside small groups. The public came to consider rockers as hopelessly naive, loutish, scruffy, motorized cowboys, loners or outsiders.Nuttall, Jeff. Bomb Culture Paladin, London 1969. pp. 27-29", "*Stanley Cohen; (1972). Folk Devils and Moral Panics; The Creation of the Mods and Rockers. Routledge. ."]}, {"page": "New Society", "response": ["*Stanley Cohen"]}, {"page": "Birzeit University", "response": ["The South African-born sociologist Stanley Cohen worked at Birzeit in support of Palestinian staff and students while a Professor in Criminology at the Hebrew University between 1980 and 1996.Pioneers of Qualitative Research Stan Cohen UK Data Service,  funded by the ESRC, Economic and Social Data Service, undated, retrieved 30 September 2015."]}, {"page": "List of people associated with the London School of Economics", "response": ["* Stanley Cohen, sociologist"]}, {"page": "Laurie Taylor (sociologist)", "response": ["Taylor has a particular interest in criminology. He was one of the founder members of the National Deviancy Conference.van Swaaningen, R. (1997) Critical Criminology: Visions from Europe, London: SAGE pg.78 As a popular author writing on the media and fame, he has published widely in criminology. Perhaps his best-known early work was the book co-written with Stanley Cohen: Escape Attempts: The Theory and Practice of Resistance to Everyday Life. The book arose from research into the wellbeing of long-term prisoners. He has collaborated with bank robber turned author, John McVicar, on research."]}, {"page": "List of Durham University people", "response": ["* Stanley Cohen – Emeritus Professor of Sociology at the London School of Economics"]}, {"page": "311 Boyz", "response": ["Some research argues that the 311 Boyz phenomenon fits into Stanley Cohen's definition of a media-induced moral panic, with specific reference to The Las Vegas Review-Journal's newspaper coverage of the 311 Boyz incidents. Excessive amounts of highly critical coverage by The Las Vegas Review-Journal may have created the appearance of an imminent danger to the community where little existed. High school boys involved in a violent altercation were presented by news coverage as a unique youth phenomenon and a dangerous new type of gang, one that was savagely and randomly attacking community members. The coverage seems to have employed the classic myth of the violent teen, similar to the mods and rockers, as well as a deviancy amplification spiral.Folk Devils, moral panics, and the violent youth narrative: an analysis of the Las Vegas Review-Journal's coverage of the 311, by Stephan Hart Robley, M.A."]}, {"page": "Counterculture of the 1960s", "response": ["During the early to mid 1960s, as mod grew and spread throughout the UK, certain elements of the mod scene became engaged in well-publicised clashes with members of rival subculture, rockers.  The mods and rockers conflict led sociologist Stanley Cohen to use the term \"moral panic\" in his study about the two youth subcultures, which examined media coverage of the mod and rocker riots in the 1960s."]}, {"page": "Independent Jewish Voices", "response": ["Signatories include Lisa Appignanesi, Sir Geoffrey Bindman, Gerald Cohen, Stanley Cohen, Lady Ellen Dahrendorf, Jenny Diski, Nicole Farhi, Stephen Fry, Alexander Goehr, Eric Hobsbawm, Ann Jungman, Anne Karpf, Beeban Kidron, Brian Klug, David Lan, Mike Leigh, Steven Lukes, Shula Marks, Mike Marqusee, Adam Phillips, Harold Pinter, Nigel Rodley, Jacqueline Rose, Leon Rosselson, Andrew Samuels, Richard Sennett, Avi Shlaim, Gillian Slovo, Shawn Slovo, Janet Suzman, Zoë Wanamaker, Sami Zubaida and David Feldman."]}, {"page": "National Deviancy Symposium", "response": ["The conference was revived in 2011 and held at the University of York. Many of the original contributors attended, including Jock Young, Stanley Cohen and Tony Jefferson. New blood mixed with the old, and speeches from scholars such as Robert Reiner, Steve Hall, Keith Hayward, Simon Hallsworth, Paul Hamilton, Phil Hodgeson John Lea, Mike Sutton, Simon Winlow, Andrew Wilson, Kevin Stenson and Mark Horsley called for new theories to analyse crime and control in today's world. The conference was organized by Simon Winlow and Rowland Atkinson."]}, {"page": "Stanley (name)", "response": ["* Stanley Cohen (biochemist) (born 1922), American Nobel Prize in Physiology or Medicine Laureate", "* Stanley Cohen (physicist) (born 1927), founder and president of Speakeasy Computing Corporation", "* Stanley Cohen (sociologist) (1942–2013), Martin White Professor of Sociology at the London School of Economics"]}, {"page": "Jews for Justice for Palestinians", "response": ["* Stanley Cohen"]}, {"page": "1970s in sociology", "response": ["*Stanley Cohen's Folk Devils and Moral Panics is published."]}, {"page": "Social panic", "response": ["A social panic is a state where a social or community group reacts negatively and in an extreme or irrational manner to unexpected or unforeseen changes in their expected social status quo. According to Folk Devils and Moral Panics by Stanley Cohen,  the definition can be broken down to many different sections. The sections, which were identified by Erich Goode and Nachman Ben-Yehuda in 1994, include concern, hostility, consensus, disproportionality, and volatility. Concern, which is not to be mistaken with fear, is about the possible or potential threat. Hostility occurs when an outrage occurs toward the people who were a part of the problem and agencies who are accountable. These people are seen as the enemy since their behavior is viewed as a danger to society. Consensus includes a distributed agreement that an actual threat is going to take place. This is where the media and other sources come in to aid in spreading of the panic. Disproportionality compares people's reactions to the actual seriousness of the condition. Volatility is when there is no longer any more panic.", "The media plays a crucial part in delivering social reaction. According to Stanley Cohen, there are three processes that the media expresses: Exaggeration and distortion, prediction, and symbolization.", "Angela McRobbie and Sarah Thornton claim that Stanley Cohen's work on moral panic is outdated and argue that more modern information is required. McRobbie suggests that idea of moral panic has become so common that the media knowingly and mindfully uses it. Thornton argues that the media originally caused moral panics inadvertently; however, the media now manipulates it on its own."]}, {"page": "ESDS Qualidata", "response": ["* Stanley Cohen's Folk Devils and Moral Panics (1967)"]}, {"page": "British Academy Book Prize", "response": ["* 2002 Stanley Cohen  for States of Denial: Knowing about Atrocities and Suffering"]}, {"page": "Witness to Innocence", "response": ["WTI member and the 100th former death row prisoner to be exonerated, Ray Krone, was also featured on Good Morning America and an episode of Extreme Makeover in its third season. The play and made-for-cable television film, The Exonerated, features Witness to Innocence members Delbert Tibbs (played by Delroy Lindo) and David Keaton (played by Danny Glover) as two of its characters.  Other projects that feature innocent former death row prisoners include John Grisham's first nonfiction work, The Innocent Man, Frank Baumgartner's The Decline of the Death Penalty and the Discovery of Innocence,  and sociologist Stanley Cohen's The Wrong Men: America's epidemic of wrongful death row convictions."]}, {"page": "Mike Sutton (criminologist)", "response": ["Sutton's early research into vandalismSutton, Mike (1987) Differential Rates of Vandalism in a New Town: Towards A Theory of Relative Place. Unpublished PhD Thesis, University of Central Lancashire, October. identified Peer Status Motivated Vandalism as the seventh sub-type of vandalism that was missing from the typology created by Stanley Cohen.Cohen, S. (1973) 'Property Destruction: Motives and Meanings’, in C. Ward (Ed.) Vandalism, London: Architectural Press Sutton's sub-type was identified years later by Mathew Williams (criminologist) in an article in the Internet Journal of Criminology as the most suitable explanation for the motivation behind the \"virtual vandalism\" he studied in a 3D Internet community."]}, {"page": "Criminology", "response": ["Symbolic interactionism draws on the phenomenology of Edmund Husserl and George Herbert Mead, as well as subcultural theory and conflict theory.  This school of thought focused on the relationship between state, media, and conservative-ruling elite and other less powerful groups. The powerful groups had the ability to become the \"significant other\" in the less powerful groups' processes of generating meaning. The former could to some extent impose their meanings on the latter; therefore they were able to \"label\" minor delinquent youngsters as criminal. These youngsters would often take the label on board, indulge in crime more readily, and become actors in the \"self-fulfilling prophecy\" of the powerful groups. Later developments in this set of theories were by Howard Becker and Edwin Lemert, in the mid-20th century. Stanley Cohen developed the concept of \"moral panic\" describing the societal reaction to spectacular, alarming social phenomena (e.g. post-World War 2 youth cultures like the Mods and Rockers in the UK in 1964, AIDS epidemic and football hooliganism)."]}, {"page": "2013 in the United Kingdom", "response": ["**Stanley Cohen, 70, sociologist."]}, {"page": "Deaths in January 2013", "response": ["*Stanley Cohen, 70, British sociologist, Parkinson's disease."]}, {"page": "New Escapologist", "response": ["* Stanley Cohen, London School of Economics-based Sociologist"]}]}}