{"wiki_id": "http://www.wikidata.org/entity/Q503443", "itemLabel": "Mitch Murray", "itemDescription": "British songwriter, musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mitch_Murray", "wikipedia_page": {"main": "Mitch Murray  (born Lionel Michael Stitcher; 30 January 1940) is an English songwriter, record producer and author. He has won two Ivor Novello Awards, including the Jimmy Kennedy Award.  Murray has written, or co-written, songs that have produced five UK and three US chart-topping records. He has also been awarded the Gold Badge of Merit by the British Academy of Songwriters, Composers and Authors.", "link_mentions": [{"page": "Terry Scott", "response": ["Scott's novelty record \"My Brother\" (written by Mitch Murray, released in 1962 on Parlophone) was based on a schoolboy character (he dressed in the uniform to sing it on TV). In the 1970s, he had a role in TV commercials for Curly Wurly caramel bars, in which he again appeared dressed as a schoolboy, with short trousers and cap. He repeated this performance several times on BBC TVs long-running variety show The Good Old Days. Scott had played a small role in the very first of the Carry On films series of films, Carry On Sergeant in 1958. In 1968 he returned to the series with a role in Carry On Up the Khyber (1968), playing main roles in six of the later films."]}, {"page": "Mill Hill", "response": ["John Wilkes all lived locally. Pop singer Paul Young has lived at Hyver Hall, and songwriter Mitch Murray lived in Sunnyfield for many years."]}, {"page": "1963 in music", "response": ["* \"How Do You Do It?\"     w.m. Mitch Murray", "* \"I Like It\"     Mitch Murray", "* \"You Were Made For Me\"     Mitch Murray"]}, {"page": "Gerry and the Pacemakers", "response": ["The band was the second to sign with Brian Epstein, who later signed them to Columbia Records (a sister label to the Beatles' label Parlophone under EMI). They began recording in early 1963 with \"How Do You Do It?\", a song written by Mitch Murray.The Beatles Anthology: Episode 1, chapter 16 \"Please Please Me\"-\"We're No.1\" The song was produced by George Martin and became a number one hit in the UK, the first by an Epstein-managed Liverpool group to achieve this on all charts.The Beatles Bible: How Do You Do It Retrieved 22 August 2008 \"How Do You Do It?\" was also reluctantly recorded by the Beatles (they eventually convinced Martin to let them release their song \"Love Me Do\"Tune In by Mark Lewisohn as a single instead)."]}, {"page": "United Kingdom in the Eurovision Song Contest 1973", "response": ["| Mitch Murray, Tony Macaulay"]}, {"page": "Juke Box Jury", "response": ["* 21 December 1963 – Alma Cogan, Angela Douglas, Rolf Harris, Mitch Murray and a 'surprise guest'"]}, {"page": "Kiki Dee", "response": ["Songwriter Mitch Murray created her stage name, and penned her first single, \"Early Night\". In the United States she became the first white British artist to be signed by Motown, releasing her first Motown single in 1970."]}, {"page": "Love Me Do", "response": ["On 4 September 1962, Brian Epstein paid for the Beatles—along with their new drummer, Ringo Starr—to fly down from Liverpool to London. After first checking into their Chelsea hotel, they arrived at EMI Studios early in the afternoon where they set up their equipment in Studio 3 and began rehearsing six songs including: \"Please Please Me\", \"Love Me Do\" and a song originally composed for Adam Faith by Mitch Murray called \"How Do You Do It?\" which George Martin \"was insisting, in the apparent absence of any stronger original material, would be the group's first single\". Lennon and McCartney had yet to impress Martin with their songwriting ability, and the Beatles had been signed as recording artists on the basis of their charismatic appeal: \"It wasn't a question of what they could do [as] they hadn't written anything great at that time.\" \"But what impressed me most was their personalities. Sparks flew off them when you talked to them.\" During the course of an evening session that then followed (7:00 pm to 10:00 pm in Studio 2) they recorded \"How Do You Do It\" and \"Love Me Do\". An attempt at \"Please Please Me\" was made, but at this stage it was quite different from its eventual treatment and it was dropped by Martin. This was a disappointment for the group as they had hoped it would be the B-side to \"Love Me Do\"."]}, {"page": "Paper Lace", "response": ["On the basis of Opportunity Knocks' performances, songwriters (Mitch Murray and Peter Callander) offered the band \"Billy Don't Be a Hero\", with the possibility of more songs if it took off. \"Billy Don't Be a Hero\" would spend three weeks at Number 1 on the UK Singles Chart in March 1974, with a total of 14 weeks on the chart. It was followed by another Murray/Callander composition, the story song \"The Night Chicago Died\" which reached Number 3 and spent 11 weeks on the charts. A third Murray/Callander-penned release, \"The Black-Eyed Boys\", took Paper Lace to number 11 in late 1974\"Paper Lace\" , spending a total of 10 weeks on the charts. Sons and Lovers website, 2003. Retrieved 9 September 2006. and number 37 in Canada."]}, {"page": "The Tremeloes", "response": ["|\"Even the Bad Times Are Good\"  (Peter Callander / Mitch Murray) "]}, {"page": "Lance Percival", "response": ["Working, like many British comics of the era, with George Martin at Parlophone, Percival had one UK Singles Chart hit, his cover version of a calypso-style song entitled \"Shame and Scandal in the Family\" which reached number 37 in October 1965, and recorded several other comedy songs, including \"The Beetroot Song\" (\"If You Like Beetroot I'll Be True To You\", 1963), written by Mitch Murray, and \"The Maharajah of Brum\" (1967), written with Martin."]}, {"page": "Tony Christie", "response": ["Discovered and managed by Harvey Lisberg, he had three hits in 1971, beginning with \"Las Vegas\" which reached number 21 in the UK, and went on to have two Top Twenty hits in the UK Singles Chart with \"I Did What I Did for Maria\", which reached number two, and \"Is This the Way to Amarillo\", which peaked at number 18, all in 1971.  Subsequently, he had a minor hit with \"Avenues and Alleyways\" which reached number 37, and was the theme to the television series The Protectors.  In addition he charted with 'Drive Safely Darlin' in early 1976 which was recorded on the MCA label and reached 35 in the UK chart.  \"Is This the Way to Amarillo\" had sold more than one million copies by September 1972, and was awarded a gold disc. His early songs were dramatic big-voiced numbers, many of which were written by Mitch Murray and Peter Callander."]}, {"page": "Can't Stand the Rezillos", "response": ["#\"I Like It\" (Mitch Murray) – 1:46", "#\"I Like It\" (Mitch Murray) – 1:46"]}, {"page": "Please Please Me (song)", "response": ["\"Please Please Me\" has a diverse history.  George Martin has stated that the original version of this song was \"rather dreary\", was too slow and consequently had little prospect of being the big hit the band were looking for. Martin said, \"I was still thinking that we should release their [earlier] recording of 'How Do You Do It?'\", a previously taped Mitch Murray composition that Martin insisted the Beatles record which he had seriously considered as an alternative debut single instead of \"Love Me Do\". The group replied that they were only interested in recording their own material. McCartney said: \"It was symptomatic of our group that we turned down 'How Do You Do It?'.\" Ringo Starr commented: \"I remember us all being ready to stand up for the principle of, 'We have written these songs and we want to do them'\". George Martin was ultimately sympathetic to their appeals, but said later: \"[I] would still have issued \"How Do You Do It?\" had they not persuaded me to listen to another version of \"Please Please Me\". Martin's confidence in \"How Do You Do It?\" proved justified when it subsequently became a number one hit for Gerry & the Pacemakers."]}, {"page": "Murray (surname)", "response": ["*Mitch Murray (born 1940), English songwriter, record producer, and author"]}, {"page": "I Did What I Did for Maria", "response": ["\"I Did What I Did for Maria\" is a song recorded by British singer Tony Christie. It was written and produced by Mitch Murray and Peter Callander, who were also responsible for Christie's \"Las Vegas\" and \"Avenues and Alleyways\". The song is about a widower who, on the eve of his execution, recalls how he remorselessly avenged his dead wife, hence the title. It reached number two in the UK Singles Chart in June 1971, and was also a major hit in Ireland, where it also reached number two.  It was a number-one hit in New Zealand,http://www.flavourofnz.co.nz/index.php?qpageID=search%20listener&qartistid=832#n_view_location and also peaked at number three in Australia.", "Category:Songs written by Mitch Murray"]}, {"page": "Billy Don't Be a Hero", "response": ["\"Billy Don't Be a Hero\" is a 1974 pop song that was first a UK hit for Paper Lace and then, some months later, a US hit for Bo Donaldson and The Heywoods. The song was written and composed by two British songwriters, Mitch Murray and Peter Callander.", "Category:Songs written by Mitch Murray"]}, {"page": "The Night Chicago Died", "response": ["\"The Night Chicago Died\" is a song by the British group Paper Lace, written by Peter Callander and Mitch Murray. The song reached number one on the Billboard Hot 100 chart for one week in 1974, reached number 3 in the UK charts, and number 2 in Canada. It is about a fictional shoot-out between the Chicago Police and members of the Al Capone Syndicate. The narrator retells his mother's anguish while awaiting news of the fate of her husband, a Chicago policeman. The song is featured in the theatrical trailer of the 2000 comedy-drama film High Fidelity, and featured in a Season 1 episode of That '70s Show. This song begins with an electronic synthesizer sound impersonating a police siren. The first four lines in the Intro are spoken by the group. It also features the sound of a ticking clock, heard in the third verse.", "Songwriters Peter Callender and Mitch Murray said in interviews (most notably on Beat Club shortly after the song's smash success) that they had never been to Chicago before that time, and that their knowledge of the city and that period of its history had been based on gangster films. (Callender defended his interpretation of Chicago's geography by saying, \"There's an East Side of everywhere!\")", "Category:Songs written by Mitch Murray"]}, {"page": "Geoff Stephens", "response": ["Geoffrey Stephens (1 October 1934 – 24 December 2020) was an English songwriter and record producer, most prolific in the United Kingdom in the 1960s and 1970s.  He wrote a long series of hit records, often in conjunction with other British songwriters including Tony Macaulay, John Carter, Roger Greenaway, Peter Callander, Barry Mason, Ken Howard, Alan Blaikley, Don Black, Mitch Murray, and Les Reed."]}, {"page": "Ain't She Sweet (album)", "response": ["#\"How Do You Do It?\" (Mitch Murray)", "#\"I'm Telling You Now\" (Freddie Garrity, Mitch Murray)"]}, {"page": "Världens bästa servitris", "response": ["| 3. || Ge mig en chans (\"How Do You do it?\")  || Mitch Murray, Mikael Wendt, Christer Lundh || ?"]}, {"page": "A Bit of Liverpool", "response": ["#\"How Do You Do It?\" (Mitch Murray)"]}, {"page": "By Tomorrow", "response": ["Category:Songs written by Mitch Murray"]}, {"page": "The Beatles' recording sessions", "response": ["90 days after their EMI audition, the Beatles returned to EMI Studios, with their new drummer, Ringo Starr, to record their debut single in Studio 2. Before the session, they rehearsed five songs, including \"Please Please Me\", in Studio 3 with Ron Richards, between 2.30 and 5.30 pm. They began work on Mitch Murray's \"How Do You Do It\", which Martin had chosen for them, but they disliked the song and wanted to release an original composition. They recorded at least two takes of \"How Do You Do It\" and at least 15 takes of \"Love Me Do\", then the best take of each song was mono mixed and pressed onto an acetate disc for Martin and Epstein to listen to. The session tapes were later destroyed, as was common practice until 1963. This session's version of \"Love Me Do\" was released as the Beatles' first single; however, it was later replaced with a version recorded seven days later, and the original was destroyed. When the original was later released on compilations, it had to be sourced from an original mono 45 rpm single."]}, {"page": "List of people from the Isle of Man", "response": ["*Mitch Murray, songwriter, record producer."]}, {"page": "The Beatles Anthology (TV series)", "response": ["#**Audio of performance by Mitch Murray."]}, {"page": "List of television theme music", "response": ["*The Protectors  (\"Avenues and Alleyways\") - Mitch Murray and Peter Callender,  performed by Tony Christie"]}, {"page": "Avenues and Alleyways", "response": ["\"Avenues and Alleyways\" is a 1973 single recorded by Tony Christie as the theme song for the television series The Protectors. It was written and produced by Mitch Murray and Peter Callander, who were also responsible for Christie's \"Las Vegas\" and \"I Did What I Did for Maria\". Following the chart-topping success of the re-release of \"(Is This the Way to) Amarillo\" in 2005, this song was also re-released and peaked at No. 26 on the UK Singles Chart. On its original release, it had only reached No. 37. It is included in the soundtrack of the 2000 film Love, Honour and Obey, starring Ray Winstone and Jude Law.", "Category:Songs written by Mitch Murray"]}, {"page": "The Ballad of Bonnie and Clyde", "response": ["\"The Ballad of Bonnie and Clyde\" is a song, written by Mitch Murray and Peter Callander, and recorded by the British rhythm and blues singer Georgie Fame. Released as a single, the song reached number one in the UK Singles Chart for one week from 24 January 1968. The song reached number seven in the US Billboard Chart later the same year.", "Category:Songs written by Mitch Murray"]}, {"page": "How Do You Do It?", "response": ["The song was written by Mitch Murray, who offered it to Adam Faith and Brian Poole but was turned down. George Martin of EMI, feeling the song had enormous hit potential, decided to pick it up for the new group he was producing, the Beatles, as the A-side of their second single. The Beatles recorded the song on 4 September 1962 with Ringo Starr on drums. The group was initially opposed to recording it, feeling that it did not fit their sound, but worked out changes from Murray's demo-disc version. These included a new introduction, vocal harmony, an instrumental interlude, small lyric changes and removal of the half-step modulation for the last verse. Although Murray disliked their changes, the decision not to release the Beatles' version was primarily a business one.Lewisohn (2013), p. 699 In fact, George Martin came very close to issuing \"How Do You Do It?\" as the Beatles' first single before settling instead on \"Love Me Do\", recorded during the same sessions. Martin commented later: \"I looked very hard at 'How Do You Do It?', but in the end I went with 'Love Me Do', it was quite a good record.\" McCartney would remark: \"We knew that the peer pressure back in Liverpool would not allow us to do 'How Do You Do It'.\"", "Category:Songs written by Mitch Murray"]}, {"page": "The Brothers (band)", "response": ["The Brothers all hail from Mauritius.Mentioned on Top Of The Pops, 2 Feb 2012, BBC Four repeat by Tony Blackburn They recorded for Bus Stop, a UK record label founded by Mitch Murray and Peter Callander. Murray and Callander, who had already helped develop the career of UK pop group Paper Lace, are credited with producing \"Sing Me\" and another single, \"Beautiful.\" Murray and Callander also composed some of the group's songs, including \"Beautiful,\" \"Love Don't Change\" (the B-side to \"Sing Me\") and \"You Don't Have to Be an Angel\" (the B-side to \"Beautiful\"). "]}, {"page": "Peter Callander", "response": ["He often worked in conjunction with Mitch Murray whom he met in 1966, with Murray's writing the music and Callander the lyrics. The two also teamed together to produce recording artists such as Paper Lace, Tony Christie, and The Brothers.", "* \"The Ballad of Bonnie and Clyde\" (1968); written by Mitch Murray and Peter Callander; recorded by Georgie Fame", "* \"The Night Chicago Died\" (1974); written by Mitch Murray and Peter Callander; recorded by Paper Lace", "* \"Billy, Don't Be a Hero\" (1974); written by Mitch Murray and Peter Callander; recorded by both Paper Lace and Bo Donaldson and The Heywoods ", "* \"Beautiful\" (1977); written by Mitch Murray and Peter Callander; recorded by The Brothers", "* \"Sing Me\" – The Brothers (1977) (with Mitch Murray) – UK No. 8", "* \"Beautiful\" – The Brothers (1977) (with Mitch Murray)"]}, {"page": "I Like It (Gerry and the Pacemakers song)", "response": ["\"I Like It\" is the second single by Liverpudlian band Gerry and the Pacemakers. Like Gerry Marsden's first number one \"How Do You Do It\", it was written by Mitch Murray. The song reached number one in the UK Singles Chart on 20 June 1963, where it stayed for four weeks. It reached No. 17 in the American charts in 1964.", "Category:Songs written by Mitch Murray"]}, {"page": "I'm Telling You Now", "response": ["\"I'm Telling You Now\" is a 1963 song by Freddie Garrity and Mitch Murray, originally performed by Freddie and the Dreamers, which, in 1965, reached number one on the American Billboard Hot 100. ", "Category:Songs written by Mitch Murray"]}, {"page": "Power to All Our Friends", "response": ["\"Power to All Our Friends\" is a song by Cliff Richard which was chosen as the  entry to the Eurovision Song Contest 1973, by a postal vote which was decided by BBC viewers after Richard performed six contending songs on A Song For Europe, featured on Cilla Black's BBC1 Saturday evening show Cilla. The runner-up song was \"Come Back Billie Jo\", written by Mitch Murray and Tony Macaulay, which was included as the B-side on the single. \"Power to All Our Friends\" came third in the Eurovision Song Contest."]}]}}