{"wiki_id": "http://www.wikidata.org/entity/Q50365639", "itemLabel": "Alfie Clarke", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfie_Clarke_(actor)", "wikipedia_page": {"main": "Alfie Clarke (born 18 November 2007) is an English actor, who has appeared as Arthur Thomas in Emmerdale since 22 October 2009.", "link_mentions": [{"page": "Gabby Thomas (Emmerdale)", "response": ["Gabby is the daughter of Ashley Thomas (John Middleton) and Bernice Blackstock (Samantha Giles), the stepdaughter of Laurel Thomas (Charlotte Bellamy) and Lawrence White (John Bowe) and half-sister to Arthur Thomas (Alfie Clarke) and Dotty Thomas. Gabby's storylines have included her mother Bernice coming in and out of her life, dealing with her father and stepmother's break up and them eventually reconciling, learning that her father has dementia and dealing with his death, her teenage rebellion and becoming a teenage parent.", "Gabby is born on Christmas Day to Bernice Blackstock (Samantha Giles), and a DNA test later reveals Ashley Thomas (John Middleton) to be her father. Bernice does not take to motherhood easily and leaves the village. Gabby occasionally visits her mother, who later marries a man named Charlie Willis in 2004 and has a second daughter, Dee Dee (Mia Gibson-Reed). Gabby and her half-brother Arthur (Alfie Clarke) both learn that Ashley has dementia. In Bernice's salon, Gabby discovers a sex tape of Kerry Wyatt (Laura Norton) and Dan Spencer (Liam Fox) and she shares it online. Bernice discovers Gabby is responsible for leaking the video and Gabby is forced to clean at the salon. When Bernice refuses to let Gabby get her eyebrows done, Gabby draws them on with permanent maker and Bernice does not allow her to go on a skiing trip. When alcohol is found, Ashley suspects it belongs to Laurel, but it is discovered that it belongs to Gabby. Gabby confesses to Ashley, who reacts angrily to her underage drinking."]}, {"page": "Inside Soap Awards", "response": ["| Alfie Clarke (Arthur Thomas in Emmerdale)"]}, {"page": "List of British current child actors", "response": ["* Alfie Clarke (born 2007)"]}, {"page": "List of longest-serving soap opera actors", "response": ["|Alfie Clarke || Arthur Thomas || Emmerdale || 2009— ||  years ||"]}, {"page": "List of Emmerdale characters (2007)", "response": ["The family began to move on from the tragedy of Daniel's death, but Daniel's postmortem revealed that he had been a carrier for cystic fibrosis. Ashley, Laurel and her parents were puzzled as neither family knew of any relative with that condition. Hilary became concerned when she learned Melanie Doland (Caroline Strong), whose son, Arthur (Alfie Clarke), who was born the same day as Daniel, said her sister had died of cystic fibrosis. A few weeks later, Greg Doland (Shaun Prendergast) told Hilary that Arthur was allergic to seafood. This was common in Hilary's family. Hilary became convinced that Daniel was not Laurel and Ashley's son, and despite Douglas, Ashley and Laurel thinking what Hilary was saying was due to her grief, she convinced the doctor to check the blood types again. This proved what Hilary had been saying - that Daniel was not Ashley and Laurel's son. Laurel was devastated and slapped Hilary for adding to their agony. Hilary felt guilty for what her daughter had gone through, but told Doug she knew the Dolands were raising Laurel's and Ashley's son.", "Born on 26 August 2007, an accidental baby-swap in the hospital saw Daniel given to Ashley and Laurel Thomas, while their biological son Arthur (Alfie Clarke) is given to the Dolands. He is christened in December 2007, with Shadrach Dingle (Andy Devine) acting as godfather, who surprises people by caring very much for Daniel and promising to teach him things when he is older. On 21 February 2008, Daniel dies in his sleep of cot death, leaving Laurel and Ashley devastated. Laurel's mother Hilary Potts (Paula Wilcox) soon starts to think that Arthur is not Laurel and Ashley's son, and eventually DNA tests prove this, and that Daniel was Greg and Mel's son. Greg and Mel leave the village in July 2008, after Laurel and Ashley are awarded custody of Arthur.", "Mel first appears along with Greg when she is giving birth at the same time as Laurel Thomas (Charlotte Bellamy). Unbeknown to either couple, their babies are accidentally swapped at the hospital, and Mel's biological son, Daniel, goes home with Laurel and Ashley Thomas (John Middleton), while Laurel's biological son, Arthur (Alfie Clarke), goes home with the Dolands. The couples become friends and their children are baptised at the same time by Bishop George Postlethwaite (Peter Cartwright). The Dolands become more frequent visitors to Emmerdale village when Greg, a builder, and Jack Sugden (Clive Hornby) come to an arrangement for the redevelopment of Annie's Cottage. When Jack later sells Annie's Cottage, the Dolands buy it and move to the village.", "Jake first appears when visiting the village for the christening of his half brother Arthur (Alfie Clarke) in November 2007. He is also Arthur's godfather."]}, {"page": "List of awards and nominations received by Emmerdale", "response": ["| Best Young Actor || Alfie Clarke || "]}, {"page": "List of Emmerdale characters (2016)", "response": ["Dotty Thomas, played by Tilly-Rue Foster and Ellerie Carroll, made her first appearance on 2 September 2016. She is the daughter of Ashley Thomas (John Middleton) and Laurel Thomas (Charlotte Bellamy), the sister of Arthur Thomas (Alfie Clarke) and half-sister of Gabby Thomas (Rosie Bentham).", "Lydia Dingle (also Hart), otherwise known as “Jenny Finn” played by Karen Blick, made her first appearance on 19 September 2016. Lydia is the leader of a bereavement support group that Jimmy King (Nick Miles) attends by mistake. He explains that his wife has died and Lydia supports him, unaware his wife is alive. Lydia later arrives at the local vets and agrees to a date with vet Paddy Kirk (Dominic Brunt). After he is warned about Lydia's personality, Rhona Goskirk (Zoe Henry) and Chas Dingle (Lucy Pargeter) claim to be Paddy's wife and mistress respectively, outraging Lydia. She returns after meeting Rishi Sharma (Bhasker Patel) on a dating website and agreeing to go on a date. Despite deciding not to go on a second date with Rishi, Lydia is employed as a cleaner in his factory as well as at Home Farm estate. Lydia later goes on a date with Sam Dingle (James Hooton), but he decides to focus on his son instead. After helping Arthur Thomas (Alfie Clarke) grieve for his father, Sam suggests that Lydia begin lodging with the Thomas family."]}, {"page": "Alfie (name)", "response": ["* Alfie Clarke (actor) (born 2007), English actor"]}]}}