{"wiki_id": "http://www.wikidata.org/entity/Q5039223", "itemLabel": "Carey Young", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Carey_Young", "wikipedia_page": {"main": "Carey Young (born 1970) is a visual artist whose work is inspired by multiple disciplines, including economics, law, politics, science and communication. These fields's tools act as material for her installations, text works and photographs, and for videos in which absurd relationships develop between the performer and the rhetoric of political, commercial and legal discourse. Young's work often develops from the professional cultures she explores. In her installations, she often dons attire appropriate to the business and legal worlds, and enacts scenarios examining and questioning each institution's power to shape society. Young also teaches internationally at art colleges such as the Slade School of Fine Art in London where she is also an Associate Professor in Fine Art.", "link_mentions": [{"page": "Manchester Metropolitan University", "response": ["* Carey Young – artist"]}, {"page": "Beck's Futures", "response": ["The 2003 prize, presented by Wim Wenders, was awarded on 29 April at the Institute of Contemporary Arts. As well as Nashashibi, the shortlisted artists were Bernd Behr, Nick Crowe, Alan Currall, Inventory, David Sherry, Lucy Skaer, Francis Upritchard and Carey Young. The panel of judges was chaired by the artist Michael Landy, and also included the curators Russell Ferguson, Maria Lind and Hans Ulrich Obrist."]}, {"page": "Slide show", "response": ["Other known artists who have used slide shows in their work include Bas Jan Ader, Francis Alys, Jan Dibbets, Dan Graham, Rodney Graham, Nan Goldin, Louise Lawler, Ana Mendieta, Jonathan Monk, Dennis Oppenheim, Allan Sekula, Carey Young and Krzysztof Wodiczko."]}, {"page": "Contemporary Art Museum St. Louis", "response": ["The museum has mounted more than 120 exhibitions and exhibited over 260 artists. It usually shows six Main Gallery exhibitions each year of American and international artists. It has exhibited work by Richard Aldrich, Laylah Ali, Lutz Bacher, Rosa Barba, Leslie Hewitt, Hayv Kahraman, Wyatt Kahn, Elad Lassry, Marilyn Minter, Gedi Sibony, Carey Young, Richard Artschwager, Jim Hodges, Sean Landers, Cindy Sherman, Arcangelo Sassolino, and Amy Sherald."]}, {"page": "Anna Livia Löwendahl-Atomic", "response": ["In 2003 a dispute over an alleged relationship between Löwendahl-Atomic's earlier work and a later work by another conceptual artist, Carey Young, shortlisted for the Beck's Futures prize arose. Young's contribution to the show was entitled Non-Disclosure Agreement. The exhibition sponsor had to sign a non-disclosure agreement promising not to tell about an art work by her which only he has seen. Young denied copying Löwendahl-Atomic's work.BBC News 24 website, Tuesday April 29, 2003."]}, {"page": "Institutional Critique", "response": ["In recent years, Maurizio Cattelan, Ellen Harvey, Matthieu Laurette, monochrom, Tameka Norris, Tino Sehgal, Carey Young, and others have taken a critical eye to the art museum and its role as a public and private institution.https://www.guggenheim.org/exhibition/maurizio-cattelan-america"]}, {"page": "Young (surname)", "response": ["*Carey Young (born 1970), artist"]}, {"page": "Post-YBAs", "response": ["Post-YBA artists include Tim Noble and Sue Webster,Village Voice , 17 November 2003 Carey Young,artext , Spring, 2002 Oliver Payne and Nick Relph,ArtForum, Jan 2004 "]}, {"page": "Eastside Projects", "response": ["Group exhibitions have featured artists and organisations such as Art & Language, Mel Bochner and Grizedale Arts, while past solo shows include Liam Gillick, Shezad Dawood, Carey Young, William Pope.L, and Dan Graham. Since the space opened in 2008, it has made a substantial contribution to Birmingham and its burgeoning reputation as a centre for contemporary art; through Extra Special People, the We Are Eastside Consortium, and other partnerships, it has successfully supported the developing ecology of artists, projects, and independent culture in the surrounding area in order to enrich the life of the city and region."]}, {"page": "Arts Catalyst", "response": ["Arts Catalyst has commissioned more than 120 contemporary artist's projects that engage with science. Notable artists the organisation has commissioned include Tomas Saraceno, The Otolith Group (Kodwo Eshun, Anjalika Sagar), Critical Art Ensemble, James Acord, Laurie Anderson, Nahum,  Marcel.li Antunez Roca, Lise Autogena, Brandon Ballengée, Anne Bean, Steve Beard, Andy Bichlbaum (Jacques Servin), Ansuman Biswas, Brian Catling, Oron Catts, Helen Chadwick, Gina Czarnecki, Beatriz da Costa, Adam Dant, Jan Fabre, Simon Faithfull, Jem Finer, Alec Finlay, Vadim Fishkin, Stefan Gec, Jack Klaff, Tim Knowles, Andrew Kotting, Steve Kurtz, Yuri Leiderman, Aleksandra Mir, Kira O'Reilly, Marko Peljhan, Esther Polak, Snæbjörnsdóttir | Wilson, Ashok Sukumaran, Aaron Williamson, Carey Young, Ariel Guzik"]}, {"page": "Random Institute", "response": ["Random Institute is a non-profit art institution based in Zurich, Switzerland that is devoted to researching new exhibition formats. Since 2007 they have produced over 70 exhibitions, events, publications and field research in Europe, Asia, North America, Africa and the Atlantic Ocean. New exhibition formats included works by established artists such as Richard Long, James Lee Byars, Cory Arcangel, Zilvinas Kempinas, Guido van der Werve, Bethan Huws, Eva and Franco Mattes, Carey Young, Julian Charrière, Federico Herrero, as well as many emerging artists. "]}, {"page": "Drew Heitzler", "response": ["In 2003, Heitzler opened Champion Fine Art with Flora Wiegmann. The artist-run gallery followed a strict criteria by which each exhibition was curated by an artist Heitzler and Wiegmann selected. The gallery published a zine-style catalog for each exhibition in edition of 100, distributed for free to gallery visitors. Each exhibition was titled with a number starting with #21. The shows descended numerically to #1, after which the gallery shut its doors. In this way, the gallery's ultimate demise was built into its programming. The gallery was located in Williamsburg, Brooklyn until August, 2004 when it relocated to the Culver City section of Los Angeles. Artists who curated or appeared in exhibitions at Champion Fine Art included Sylvie Fleury, Vincent Szarek, Bjorn Copeland, Carol Bove, Allyson Vieira, Alex Kwartler, Steven Parrino, Lizzi Bougatsos, Mai-Thu Perret, Josh Smith, Seth Price, Kelley Walker, Emily Sundblad, Monique Van Genderen, Valentin Carron, Gardar Eide Einarsson, Huma Bhabha, Nancy Shaver, Aleksandra Mir, Roe Ethridge, Fia Backström, Jessica Jackson Hutchins, Matt Johnson, Hannah Greely, Kalup Linzy, Shana Lutker, Stephen Rhodes, Jonas Wood, Shio Kusaka, Nate Lowman, Tony Matelli, Bert Rodriguez, Mary Weatherford, Charles Irvin, Ellen Altfest, Tyson Reeder, Scott Reeder, Katherine Bernhardt, Brian Bress, Alix Lambert, John Armleder, Cyprien Gaillard, Jan Groover, Jordan Wolfson, John Tremblay, Rose Kallal, Jonah Freeman, Chuck Nanney, Adam McEwen, Peter Coffin, Craig Kalpakjian, Stephen Shore, Joe Scanlan, James Welling, Eric Wesley, Carey Young, Walead Beshty, Anna Sew Hoy, Carter Mull and Adam Putnam."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Carey Young, artist"]}, {"page": "Gavin Delahunty", "response": ["* Carey Young: The New Architecture. Dallas Museum of Art, 2017."]}, {"page": "Nahum (artist)", "response": ["Some KOSMICA participants have included Kevin Fong, Tomás Saraceno, Ariel Guzik, Aleksandra Mir, Empress Stah, Yuri Suzuki, Honor Harger, Roger Malina, Marko Peljhan, Nelly Ben Hayoun, Katie Paterson, Agnes Meyer-Brandis, Kapwani Kiwanga, Bompas & Parr, Frederik De Wilde, Nicola Triscott, Anais Toneur, Carey Young, Christopher Riley, Dragan Živadinov, Sarah Jane Pell and Tania Candiani. \"KOSMICA created an open, affable environment where the topics ranged from philosophy to the social importance of Star Trek.\""]}, {"page": "KOSMICA", "response": ["KOSMICA activities have put together an international network of artists, cultural practitioners and space professionals. Among the 180 participants are Kevin Fong, Tomás Saraceno, Ariel Guzik, Aleksandra Mir, Empress Stah, Yuri Suzuki, Honor Harger, Roger Malina, Marko Peljhan, Nelly Ben Hayoun, Katie Paterson, Agnes Meyer-Brandis, Kapwani Kiwanga, Bompas & Parr, Frederik De Wilde, Nicola Triscott, Anais Toneur, Carey Young, Christopher Riley, Dragan Živadinov, Sarah Jane Pell, Semiconductor, Angelo Vermaulen (Seeker), Richard Clar, Patricio Guzmán, Tania Candiani and Nahum."]}, {"page": "Global Feminisms", "response": ["* Carey Young"]}, {"page": "Marcos Lutyens", "response": ["An instance of Hypnotic Show was performed at the Solomon R. Guggenheim Museum in New York City as a part of the exhibition Tales of Our Time in 2017. A video was also produced along with this performance. Previous events have involved scripts by artists and writers, including Pierre Huyghe, Joachim Koester, John Menick, Sofía Hernández Chong Cuy, Carey Young, Etienne Chambaud and Robert Barry."]}, {"page": "Maria Lind", "response": ["During her directorship at Kunstverein München, Maria Lind and her team (Curator Sören Grammel, Assistant Curators Katarina Schlieben, Judith Schwartzbart, Tessa Praun and Julienne Lorz) privileged process, long-term collaborations and collective thinking. A group of fifteen artists, curators and critics (including Apolonija Šušteršič, Carey Young, Matts Leiderstam, Lynne Cooke and Jan Verwoert) acting as “Sputniks” (fellow travellers), were invited to reimagine the role of this art institution and to work closely with it. The program also included projects by Oda Projesi, Bojan Šarčević and Chantal Akerman. Marion von Osten’s research-based “project exhibition” Studio Europe was an early discussion on art and post-Fordism. Retrospectives with Christine Borland and Rirkrit Tiravanija experimented with the format of mid-career survey exhibitions. The group project Totally Motivated: A Sociocultural Manoeuvre was a playful collaboration between five curators and ten artists exploring the relationship between professional and amateur art practices.", "* 2002–2004: As Director, Kunstverein München. Curator of exhibitions by Deimantas Narkevicius, Oda Projesi, Bojan Sarcevic, Chantal Akerman, Philippe Parreno and Marion von Osten, Christine Borland and Rirkrit Tiravanija; and group project Totally Motivated: A Sociocultural Manoeuvre, with Luca Frei, Carla Zaccagnini, Matias Faldbakken and others. During thres years, Carey Young, Apolonija Šušteršič, Jan Verwoert, Lynne Cooke, Matts Leiderstam and others functioned as “sputniks”, fellow travellers, to the institution."]}]}}