{"wiki_id": "http://www.wikidata.org/entity/Q503183", "itemLabel": "Arthur Gore", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Gore_(tennis)", "wikipedia_page": {"main": "Arthur William Charles Wentworth Gore (2 January 1868 – 1 December 1928) was a British tennis player.He is best known for winning three singles titles at the Wimbledon Championship and was runner-up a record 5 times (shared with Herbert Lawford). He also won gold medals at the 1908 Summer Olympics in London, England, winning the Men's Indoor Singles and the Men's Indoor Doubles (with Herbert Barrett). He also competed at the 1912 Summer Olympics in Stockholm, Sweden. Gore's Wimbledon win in 1909, at age 41, makes him the oldest player to date to hold the Wimbledon Gentlemen's Singles title.", "link_mentions": [{"page": "1928", "response": ["** Arthur Gore, British tennis player (b. 1868)"]}, {"page": "The Championships, Wimbledon", "response": ["| Arthur Gore", "|  Arthur Gore"]}, {"page": "1902 in sports", "response": ["* Wimbledon Men's Singles Championship – Laurence Doherty (GB) defeats Arthur Gore (GB) 6–4 6–3 3–6 6–0"]}, {"page": "1901 in sports", "response": ["* Wimbledon Men's Singles Championship – Arthur Gore (GB) defeats Reginald Doherty (GB) 4–6 7–5 6–4 6–4"]}, {"page": "1907 in sports", "response": ["* Wimbledon Men's Singles Championship – Norman Brookes (Australia) defeats Arthur Gore (GB) 6–4 6–2 6–2"]}, {"page": "1908 in sports", "response": ["* Wimbledon Men's Singles Championship – Arthur Gore (GB) defeats Herbert Barrett (GB) 6–3 6–2 4–6 3–6 6–4"]}, {"page": "1909 in sports", "response": ["* Wimbledon Men's Singles Championship – Arthur Gore (GB) defeats Josiah Ritchie (GB) 6–8 1–6 6–2 6–2 6–2"]}, {"page": "1899 in sports", "response": ["* Wimbledon Men's Singles Championship – Reginald Doherty (GB) defeats Arthur Gore (GB) 1–6 4–6 6–3 6–3 6–3"]}]}}