{"wiki_id": "http://www.wikidata.org/entity/Q5039166", "itemLabel": "Carey Bonner", "itemDescription": "British hymnwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Carey_Bonner", "wikipedia_page": {"main": "Carey Bonner, Rev  (1 May 1859 – 16 June 1938) was a Baptist minister who served as the General Secretary of the National Sunday School Union from 1900 until 1929 and as Joint Secretary of the World Sunday School Association.\n\n", "link_mentions": [{"page": "Away in a Manger", "response": ["Kirkpatrick's melody was later published in numerous hymn-books, and was the setting that, in Hill's words, \"first carried the words beyond the confines of the United States\", being included in collections such as Carey Bonner's Sunday School Hymnary (1905). It remains the most popular musical setting of \"Away in a Manger\" outside the United States."]}, {"page": "W. E. Cule", "response": ["In 1906 Cule was appointed on the recommendation of Andrew Melrose and Rev Carey Bonner to head the publishing activities of the Baptist Missionary Society (BMS).Brian Stanley, History of the Baptist Missionary Society 1792–1992, Edinburgh: T&T Clark, 1992. Cule worked as an editor of missionary publications, including the monthly Missionary Herald and a children's magazine Wonderlands. He was instrumental in setting up the Carey Press as the BMS's commercial publishing arm.", "Cule, who served as a Sunday School teacher and Baptist deacon, wrote two hymns of distinction, \"Creator Lord of Life and Light\" and \"The Morning's Golden Glory\", published in Hymns for Today.Carey Bonner, Some Baptist Hymnists, Baptist Union Publication Department, 1937 p.428"]}, {"page": "John Pounds", "response": ["A unitarian chapel named in his memory stands in Old PortsmouthJohn Pounds Memorial Unitarian Church and his life was celebrated in a sacred cantata Greatheart: The Story of John Pounds, by the Rev Carey Bonner. In 2005, the John Pounds Centre was opened in Queen Street, Portsmouth to encourage \"a happier and healthier lifestyle, should that be through learning, physical or social activities.\" Until 1975 there was a girl's secondary modern in Portsea named after him:National Archives it is now a community centre.John Pounds Centre "]}, {"page": "Rawdon College", "response": ["*Carey Bonner  (1859–1938) was General Secretary of the National Sunday School Union from 1900 until 1929 and Joint Secretary of the World Sunday School Association. He trained as a missionary at Rawdon"]}]}}