{"wiki_id": "http://www.wikidata.org/entity/Q5047591", "itemLabel": "Carwyn Ellis", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Carwyn_Ellis", "wikipedia_page": {"main": "Carwyn Ellis (born Carwyn Meurig Ellis; 9 August 1973) is a Welsh musician, composer, arranger, multi-instrumentalist and record producer. He is known as the frontman of British alternative band Colorama, as a member of The Pretenders and as a long-time collaborator with Edwyn Collins. In 2014, they worked together on the soundtrack to the film The Possibilities Are Endless which won the Mojo 'Film of the Year' Award.Ellis has also recorded electronic music as Zarelli, releasing an album, Soft Rains in 2015 which featuring the voice of Leonard Nimoy narrating the Ray Bradbury short story There Will Come Soft Rains. \nIn 2017 Ellis formed the Welsh folk group Bendith and their self-titled album was nominated for the Welsh Music Prize and went on to win the Welsh Language Album of the Year 2017 award at National Eisteddfod of Wales.Since 2016 Ellis has hosted a regular themed radio show on Soho Radio.In 2019, Ellis embarked on the first solo project under his own name, Carwyn Ellis & Rio 18. A collaborative project sung in Welsh and recorded mainly in Rio de Janeiro. The album, Joia! was nominated for the Welsh Music Prize. A documentary film on the making of the record, Carwyn Ellis: Ar Y Cei Yn Rio went on to win the Best Welsh language short Film award at the Wales International Documentary Festival.In 2020, Ellis releases Single Cherry Blossom Promenade and EP Ti to raise funds for personal protective equipment (PPE) for Welsh health and care workers.During lockdown in UK, Ellis released Chaos Wonderland under the Colorama project on 31 July 2020  and the follow-up to 2019’s Welsh Music Prize shortlisted Joia!, Ellis released Carwyn Ellis & Rio 18's second album Mas on 25 February 2021.The most recent album Yn Rio by the Carwyn Ellis & Rio 18 features the BBC National Orchestra of Wales was released on 22 October 2021, originally performed live and broadcast in March 2021 on BBC Radio Cymru and BBC Radio 6 Music.", "link_mentions": [{"page": "The Pretenders", "response": ["In September 2012, Pretenders re-grouped (Hynde, Chambers, Heywood, Walbourne, Wilkinson) as part of the entertainment line-up for the 2012 Singapore Grand Prix. They were joined by keyboardist/acoustic guitarist Carwyn Ellis in autumn 2012. On 6 September 2016, Stevie Nicks announced that Pretenders would tour with her on a 27-city tour for the last three months of 2016. The live band consisted of Hynde, Chambers, Heywood, Walbourne, Wilkinson, as before. Pretenders released their 10th studio album, Alone, on 21 October 2016. However, as on Packed!, Hynde was the only Pretender on the album, which was otherwise played entirely by session musicians. In May 2017, Ellis resumed touring with Pretenders who toured Australia and New Zealand with Nicks. In October 2017, Pretenders appeared on Austin City Limits."]}, {"page": "Benllech", "response": ["*Carwyn Ellis, lead singer for Colorama had a nomadic childhood before his family eventually settled in Benllech."]}, {"page": "Quruli", "response": ["*Carwyn Ellis (keyboards, guitar, banjo, bouzouki, piano) "]}, {"page": "There Will Come Soft Rains (short story)", "response": ["* In 2015, shortly after Leonard Nimoy's death, the concept album Soft Rains was released featuring Nimoy's 1975 reading, set to music by producer Carwyn Ellis under the pseudonym Zarelli."]}, {"page": "Ian Siegal", "response": ["* Carwyn Ellis – bass, vocals"]}, {"page": "List of The Pretenders band members", "response": ["The Pretenders is an English-American rock band from Hereford. Formed in 1978, the group originally consisted of vocalist and rhythm guitarist Chrissie Hynde, lead guitarist and keyboardist James Honeyman-Scott, bassist Pete Farndon, and drummer Martin Chambers. The band's current lineup includes Hynde and Chambers alongside bassist Nick Wilkinson (since 2005), lead guitarist James Walbourne, pedal steel guitarist Eric Heywood (both since 2008) and keyboardist Carwyn Ellis (since 2017).", "|Carwyn Ellis", "*Carwyn Ellis – keyboards, guitar "]}, {"page": "Colorama (band)", "response": ["Colorama is the longest running musical project of Welsh singer-songwriter, multi-instrumentalist and producer, Carwyn Ellis and an ever-revolving cast of collaborators. Stylistically best described as alternative indie pop, Colorama is an eclectic hybrid of genres and languages. ", "Colorama emerged as a Carwyn Ellis home-recording project when he moved from London to Liverpool in 2006, the first shows being as a duo with Ellis's best friend David Fletcher, on double bass.", "Following Some Things Just Take Time, Ellis worked extensively both with The Pretenders and with Edwyn Collins. Whilst on tour in South America, Chrissie Hynde suggested that he make an album in Welsh with Brazilian musicians – this he did in Rio de Janeiro late in 2018, releasing Joia! as the first solo project under his own name, Carwyn Ellis & Rio 18 in 2019.", "* In conversation with Carwyn Ellis at Wales Arts Review", "* The changing man – Carwyn Ellis at Western Mail", "* Interview – Carwyn Ellis talks new Colorama album Some Things Just Take Time, songwriting, and Wales at Getintothis  ", "* IN CONVERSATION – Colorama’s Carwyn Ellis on new ‘Chaos Wonderland’ album at Getintothis "]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Carwyn Ellis (rock musician, composer, arranger)"]}, {"page": "People Gonna Talk", "response": ["*Carwyn Ellis – organ"]}]}}