{"wiki_id": "http://www.wikidata.org/entity/Q5042276", "itemLabel": "Carlos Logan", "itemDescription": "British association football player (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carlos_Logan", "wikipedia_page": {"main": "Carlos Sean Logan (born 7 November 1985) is an English footballer who plays in midfield for Ashton United. He left Droylsden after the 2012–13 season, joining there from Northwich Victoria in March 2011. He played for Barrow from 2008 until the end of the 2009–10 season. He made over 50 appearances in The Football League between 2005 and 2007.", "link_mentions": [{"page": "Adam Smith (footballer, born February 1985)", "response": ["Smith played in the Huddersfield and District Association Football League for Lepton Highlanders. He trialled at Football League clubs Huddersfield Town and Oldham Athletic at the ages of 14 at 15 respectively. While playing for Kirkheaton he was spotted by Chesterfield and was invited for a trial match, and was eventually offered a place on the club' scholarship scheme. He began training with the first team during the 2001–02 season and was first named on the bench for Chesterfield's 1–0 victory over Reading at the Madejski Stadium on 1 December 2001. He made his debut in a Football League Trophy match against Port Vale on 22 November 2002, where he came on as a substitute in the 77th minute, and scored in the penalty shoot-out that was eventually lost 4–3. His Football League debut came on 13 September 2003 after coming on as a substitute for the injured Mark DeBolla in the 79th minute of a 1–0 defeat to Notts County. He went on to make further appearances that month against Brighton & Hove Albion and Brentford, where he played on the left wing. He was offered a two-year professional contract with Chesterfield in March 2004, effective from the 2004–05 season. His first league start for Chesterfield came in a 1–0 defeat to Hull City on 10 October. He underwent laparoscopic surgery on his knee to repair cartilage damage in February 2005, which was expected to rule him out for six weeks. He made his return on 18 March after coming on as a 60th-minute substitute for Carlos Logan in a 2–2 draw with Brentford. Soon after making his return, he picked up an injury to his left ankle, which was sustained during Chesterfield's 3–2 defeat to AFC Bournemouth. This ruled him out for the rest of the season, which he finished with 19 appearances."]}, {"page": "Shay Logan", "response": ["Logan was a product of the Manchester City youth academy and signed a three-year contract in the summer of 2007. His elder brother, Carlos Logan, is also a former Manchester City trainee. He first came into prominence after impressing during the U18s run to the 2005–06 FA Youth Cup final. Logan made his first-team debut in the 2–1 League Cup second round victory over Bristol City in August 2007 and made a second appearance in the next round against Norwich City in September 2007. He made his Premier League debut for Manchester City in a 2–0 away defeat to Portsmouth on 14 February 2009, starting the game and playing the full 90 minutes. In September 2010, Logan was a surprise inclusion in Manchester City's 25-man Premier League squad, making him City's 11th Englishman and 12th home-grown player in the list. Logan was released at the end of the 2010–11 season, having made just three first team appearances."]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Carlos Logan||||2007||4||0||"]}, {"page": "2006–07 Bradford City A.F.C. season", "response": ["|align=\"left\"|22||align=\"left\"|MF||align=\"left\"| Carlos Logan"]}, {"page": "2010 FA Trophy Final", "response": ["|MF ||11|| Carlos Logan || || "]}, {"page": "Logan (surname)", "response": ["* Carlos Logan (born 1985), English footballer"]}]}}