{"wiki_id": "http://www.wikidata.org/entity/Q5040151", "itemLabel": "Carl Forgione", "itemDescription": "British actor (1944-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carl_Forgione", "wikipedia_page": {"main": "Carl Forgione (3 May 1944 – 10 September 1998) was a British actor, best known for his television appearances.\nHe appeared in two Doctor Who serials - Planet of the Spiders in 1974 and Ghost Light in 1989.\nOther TV credits include Dixon of Dock Green, Jesus of Nazareth, Blake's 7, Star Cops, Coronation Street, Emmerdale Farm and The House of Eliott.", "link_mentions": [{"page": "1977 in film", "response": ["| Jesus of Nazareth || ITC Entertainment / RAI / NBC || Franco Zeffirelli (director/screenplay); Anthony Burgess, Suso Cecchi d'Amico (screenplay); Robert Powell, Anne Bancroft, Ernest Borgnine, Laurence Olivier, Christopher Plummer, Anthony Quinn, Rod Steiger, James Earl Jones, Peter Ustinov, Claudia Cardinale, Valentina Cortese, James Farentino, Stacy Keach, Tony Lo Bianco, James Mason, Ian McShane, Donald Pleasence, Fernando Rey, Ralph Richardson, Michael York, Olivia Hussey, Cyril Cusack, Ian Holm, Yorgo Voyagis, Ian Bannen, Marina Berti, Regina Bianchi, Maria Carta, Lee Montague, Renato Rascel, Oliver Tobias, Norman Bowler, Robert Beatty, John Phillips, Ken Jones, Nancy Nevinson, Renato Terra, Roy Holder, Jonathan Adams, Oliver Smith, Murray Salem, Tony Vogel, Michael Cronin, Derek Godfrey, Renato Montalbano, John Duttine, Keith Skinner, Cyril Shaps, John Tordoff, Francis de Wolff, Mark Eden, Bruno Barnabe, Simon MacCorkindale, Forbes Collins, Martin Benson, Carl Forgione, Donald Sumpter, Pino Colizzi, Robert Brown, Harold Bennett, Abdelmajid Lakhal || Epic, Drama || Live Action"]}, {"page": "Jesus of Nazareth (TV series)", "response": ["* Carl Forgione as Plotinus"]}, {"page": "Theatre 625", "response": ["|Hugh Burden,Margery MasonSheila Reid,Ray Brooks,Alan MacNaughtan,Susan George,Kate Story,Carl Forgione,Edward de Souza,Peter Jesson"]}, {"page": "List of fictional butlers", "response": ["| Nimrod || Neanderthal butler in the Doctor Who tale Ghost Light || Carl Forgione || 1989 ||"]}, {"page": "Ghost Light (Doctor Who)", "response": ["Michael Cochrane and Frank Windsor had both previously appeared in Doctor Who alongside Peter Davison; Cochrane as Charles Cranleigh in Black Orchid in Season 19, while Windsor played Ranulf in The King's Demons in Season 20. Carl Forgione appeared in the final serial of the Jon Pertwee era, Planet of the Spiders."]}, {"page": "Planet of the Spiders", "response": ["Ysanne Churchman had provided the voice of Alpha Centauri in both The Curse of Peladon (1972) and its sequel The Monster of Peladon (the serial immediately preceding Planet of the Spiders); she would briefly reprise the role in \"Empress of Mars\" (2017). Kismet Delgado, the widow of Roger Delgado, was one of the voices for the Spiders. Carl Forgione would later play Nimrod in Ghost Light (1989). Christopher Burgess had previously played Swann in The Enemy of the World (1968). John Dearth had provided the voice of the computer, BOSS, in The Green Death (1973)."]}, {"page": "Star Cops", "response": ["Guest Stars: Vikki Chambers (as Lina Margello), Andre Winterton (as Pordenne), Carl Forgione (as Tour Guide)."]}, {"page": "Play of the Month", "response": ["|David Leland,Gabrielle Lloyd,Richard Durden,Patrick Stewart,Allan Surtees,Barry Jackson,John Kane,Alan Gerrard,Forbes Collins,Reg Pritchard,Eric Mason,Edwin Finn,John Herrington,George Cormack,Trevor Lawrence,Carl Forgione,Brian Grellis"]}, {"page": "Eric Pollard", "response": ["Eric arrives in Beckindale (later Emmerdale), and immediately annoys Sandie Merrick (Jane Hutcheson). He makes himself very unpopular, and is involved in a number of illegal schemes, often with his crooked business associate, Charlie Aindow (David Fleeshman). Sandie finds that he is fiddling the accounts at Hotten Market, and he loses his position as manager. He befriends Marian Rosettii (Debbie Blyth) and her husband Paolo (Carl Forgione), and tries to burgle their house, and Paolo chases him. Paolo accidentally shoots himself with a gun, but never discovers it was Eric who was the thief. Once Eric finds out Paolo had been taken to hospital after being shot, he leaves Beckindale for a few months. Upon his return, Eric applies for his old job as an auctioneer but loses out to Sandie, starting another feud. Eric finds romance with Debbie Wilson (Debbie Arnold) and they soon become engaged. However, Debbie leaves with £2,000 and valuable goods that Eric gave to her to start an antiques shop, to which he intended to divert goods from Hotten Market."]}, {"page": "Neanderthals in popular culture", "response": ["| Ghost Light|| Alan Wareing  || TV series||a 1989 three-part serial in the television series Doctor Who, a Neanderthal called \"Nimrod\" (Carl Forgione) is the butler of a Victorian era household."]}, {"page": "List of Scottish actors", "response": ["*Carl Forgione (1944–1998)"]}, {"page": "List of former Emmerdale characters", "response": ["|Paolo Rosetti || Carl Forgione || 1987"]}, {"page": "1944 in Scotland", "response": ["* 3 May – Carl Forgione, actor (died 1998 in England)"]}, {"page": "Deaths in September 1998", "response": ["*Carl Forgione, 54, British actor."]}, {"page": "Forgione", "response": ["*Carl Forgione (1944–1998), British actor"]}]}}