{"wiki_id": "http://www.wikidata.org/entity/Q5044535", "itemLabel": "Carol Rumens", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Carol_Rumens", "wikipedia_page": {"main": "Carol Rumens FRSL (born 10 December 1944) is a British poet.", "link_mentions": [{"page": "Edward Thomas (poet)", "response": ["In February 2013 his poem \"Words\" was chosen as the poem of the week by Carol Rumens in The Guardian."]}, {"page": "Stevie Smith", "response": ["Smith's poems have been the focus of writers and critics around the world. James Antoniou writes in The Australian that her 'apparent innocence masks such fierce complexities, such ambition and startling originality, that many people baulk at her work', while Michael Dirda affirms in The Washington Post that, 'certainly, an outward charm is part of Smith's aesthetic strategy, though there’s nothing naive or whimsical beneath her surface.' Carol Rumens writes in The Guardian that Smith 'skewered formality, though formally deft, and challenged, with a Victorian school marm's brisk tartness, the lingering shades of late-Victorian social hypocrisy.'"]}, {"page": "Palgrave's Golden Treasury", "response": ["Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "Royal Society of Literature", "response": ["| Carol Rumens"]}, {"page": "The Penguin Book of Contemporary British Poetry", "response": ["Poets included in the book were Anne Stevenson, Carol Rumens, Christopher Reid, Craig Raine, David Sweetman, Derek Mahon, Douglas Dunn, Fleur Adcock, Hugo Williams, James Fenton, Jeffrey Wainwright, Medbh McGuckian, Michael Longley, Paul Muldoon, Penelope Shuttle, Peter Scupham, Seamus Heaney, Tom Paulin, and Tony Harrison."]}, {"page": "Faber Book of Twentieth-Century Women's Poetry", "response": ["Fleur Adcock – Margaret Atwood – Margaret Avison – Elizabeth Bartlett – Patricia Beer – Frances Bellerby – Connie Bensley – Mary Ursula Bethell – Elizabeth Bishop – Louise Bogan – Eavan Boland – Gwendolyn Brooks – Eiléan Ni Chuilleanáin – Amy Clampitt – Gillian Clarke – Jane Cooper – Wendy Cope – Frances Cornford – Elizabeth Daryush – Rosemary Dobson – Freda Downie – Lauris Edmond – U. A. Fanthorpe – Elaine Feinstein – Tess Gallagher – Louise Glück – Barbara Guest – H. D. – Gwen Harwood – Selima Hill – Molly Holden – Robin Hyde – Elizabeth Jennings – June Jordan – Jenny Joseph – Maxine Kumin – Denise Levertov – Gwendolyn MacEwen – Sandra McPherson – Charlotte Mew – Josephine Miles – Edna St. Vincent Millay – Elma Mitchell – Marianne Moore – Lorine Niedecker – P. K. Page – Ruth Pitter – Sylvia Plath – Adrienne Rich – Judith Rodriguez – Muriel Rukeyser – Carol Rumens – E. J. Scovell – Edith Sitwell – Stevie Smith – Anne Stevenson – May Swenson – Anne Szumigalski – Jean Valentine – Ellen Bryant Voigt – Sylvia Townsend Warner – Anna Wickham – Judith Wright – Elinor Wylie"]}, {"page": "Patience Agbabi", "response": ["The poems in her first book R.A.W., published in 1995, \"owe much to the rhythms, verbal and associational genius of rap\".George Stade, Karen Karbiener (eds), \"Agbabi, Patience (1965– )\", Encyclopedia of British Writers, 1800 to the Present, Volume 2, Fact On File, 2009, p. 8. Her next collection was Transformatrix (2000), a commentary on contemporary Britain that draws inspiration from popular music forms. In 2008 Agbabi published Bloodshot Monochrome, a collection that, as described by one reviewer, highlights social and political issues, captures and considers moments in time through long-dead authors, and offers readers a diverse sampling of the author's views of life in a variety of places\".J. J. Furman, \"Bloodshot Monochrome\", Women Writing London, 29 July 2013. Carol Rumens has said: \"Agbabi characteristically makes poetry an opportunity for conversation with the past, not swamping it but setting new lexical terms.\"Carol Rumens, \"Poem of the week: Skins by Patience Agbabi\", The Guardian, 28 March 2016."]}, {"page": "John Cornford", "response": ["His best-known poem, usually titled (after Cornford's death) \"To Margot Heinemann,\" partakes of the same emotional directness, but in a more tender vein. The poem has been described by the poet Carol Rumens as \"one of the most moving and memorable 20th-century love poems\". While the form is in some respects traditional—ballad-form quatrains rhyming abcb—its rhythms are skillfully irregular, with two to three stresses per line, and its rhymes often slant, including those of the moving last stanza: \"And if bad luck should lay my strength Into the shallow grave, Remember all the good you can; Don't forget my love.\" Rumens says: \"You feel as if you have been presented with a photograph of a young soldier's inner life. He is a passionate lover and a passionate warrior: these qualities are held in perfect psychic balance. And they are timeless. The speaker could be one of Homer's heroes. He could be a Spartan at Thermopylae.\" But the famous opening lines \"Heart of the heartless world, / Dear heart, the thought of you\" actually contain a blind quotation from Marx, who in the Introduction to his Critique of Hegel's Philosophy of Right describes religion as \"the heart of a heartless world.\""]}, {"page": "Waldo Williams", "response": ["*The Waldo Williams Society, contents page at . Waldo's Life and Work at ; Poet at , Pacifist at , Quaker at , Politician at , Waldo's wife Linda Llewellyn at , What they have said – appreciations of Waldo by Rowan Williams, Jim Perrin, Professor M. Wynn Thomas and Carol Rumens at , Dr Robert Rhys's lecture on Waldo & D. J. Williams at , and three English translations of Waldo's poems : 'Between Two Fields', translated by Rowan Williams , 'Remembrance' (Cofio) translated by Alan Llwyd and 'Preseli', Waldo's own translation : all retrieved 18 December 2017."]}, {"page": "T. S. Eliot Prize", "response": ["*2004 – Douglas Dunn, Paul Farley and Carol Rumens"]}, {"page": "Cholmondeley Award", "response": ["* Carol Rumens"]}, {"page": "Encounter (magazine)", "response": ["* Carol Rumens (11)"]}, {"page": "Alice Hunt Bartlett Prize", "response": ["* 1981: Thomas McCarthy for The Sorrow Garden and Carol Rumens for Unplayed Music"]}, {"page": "The Honest Ulsterman", "response": ["A series of over 30 poetry pamphlets were published along with the magazine itself, including work by Heaney, Mahon, Muldoon, McGuckian, Foley, Ormsby, Carson, Johnstone, Ewart, Tom Paulin, Carol Rumens, Iain Crichton Smith, Sean O'Brien, Geoffrey Squires, Harry Clifton, Tom Matthews and others."]}, {"page": "1998 in poetry", "response": ["* Carol Rumens, Holding Pattern"]}, {"page": "1995 in poetry", "response": ["*Carol Rumens, Best China Sky"]}, {"page": "1993 in poetry", "response": ["* Carol Rumens, Thinking of Skins"]}, {"page": "1988 in poetry", "response": ["* Carol Rumens, The Greening of the Snow Beach"]}, {"page": "1987 in poetry", "response": ["* Carol Rumens, Plato Park"]}, {"page": "1985 in poetry", "response": ["* Carol Rumens, Direct Dialling"]}, {"page": "1984 in poetry", "response": ["* Cholmondeley Award: Michael Baldwin (poet), Michael Hofmann, Carol Rumens"]}, {"page": "1983 in poetry", "response": ["* Carol Rumens, Star Whisper"]}, {"page": "1981 in poetry", "response": ["* Carol Rumens, Unplayed Music"]}, {"page": "1978 in poetry", "response": ["* Carol Rumens, A Necklace of Mirrors"]}, {"page": "1973 in poetry", "response": ["* Carol Rumens, A Strange Girl in Bright Colours"]}, {"page": "Bloodaxe Books", "response": ["One of Bloodaxe’s most significant achievements has been to transform the publishing opportunities for women poets. For many years Bloodaxe has been unusual in having a poetry list which is 50:50 male: female, not the result of positive discrimination but rather in relation to literary excellence. The first of several influential Bloodaxe anthologies of women poets, Jeni Couzyn’s Bloodaxe Book of Contemporary Women Poets (1985) was published at a time when very little poetry by women was readily available to readers. Others have included Carol Rumens’s New Women Poets (1990), Linda France’s Sixty Women Poets (1993), Maura Dooley’s Making for Planet Alice (1997), Robyn Bolam's Eliza's Babes: four centuries of women's poetry in English (2005), and Deryn Rees-Jones’s Modern Women Poets (2005), published as the companion anthology to her critical study Consorting with Angels (2005)."]}, {"page": "1944 in poetry", "response": ["* December 10 – Carol Rumens, English poet, writer, literary editor and academic"]}, {"page": "David Constantine", "response": ["David John Constantine (born 1944) is an English poet,Carol Rumens, \"Poem of the week: Frieze by David Constantine\", The Guardian, 22 June 2009. author and translator.Katherine Bucknell, \"The Boys in Berlin: Auden's Secret Poems\", The New York Times, 4 November 1990."]}, {"page": "Tower Poetry", "response": ["| Mark Ford and Carol Rumens"]}, {"page": "Ian Parks", "response": ["His collections include A Climb Through Altered Landscapes (Blackwater, 1998), Shell Island (Waywiser, 2006), The Cage (Flux Gallery Press, 2008), Love Poems 1979-2009 (Flux Gallery Press, 2009) The Landing Stage (Lapwing, Belfast, 2010), The Exile's House (Waterloo, 2012) and \"Citizens\" (Smokestack 2017). His poems have appeared in Poetry Review, The Times Literary Supplement, The Observer, The Liberal, Poetry Salzburg Review, The Independent on Sunday, Poetry (Chicago), London Magazine, The Chiron Review, The Rialto, Stand, Acumen, Poetry Greece, Modern Poetry in Translation and have been broadcast on BBC Radio 3. His pamphlet, A Paston Letter was published by Rack Press. A selection of his poems appears in Old City: New RumoursOld City: New Rumours eds. Gregson and Rumens (Five Leaves Press, 2010) edited by Carol Rumens and Ian Gregson. His versions of the modern Greek poet Constantine Cavafy - \"The Cavafy Variations\" (Rack Press) was published in 2013 and was a Poetry Book Society Choice. ″If Possible: Cavafy Poems\" was published by Calder Valley Poetry in 2018 and was shortlisted for the Michael Marks Award. His Selected Poems of Harold Massingham is due from Calder Valley Poetry in 2020."]}, {"page": "Steinunn Thorarinsdottir", "response": ["250px|right|'Voyages' in the City of Hull, England. 'Voyages' is Steinunn's two part sculpture that was commissioned by the British and Icelandic governments. The sister statues gaze out over the waters between Hull, England and Vik, Iceland. The two fishing towns have a long history of trade relations spanning over 1000 years which was colored by the Cod War in the 1950s and 1970s. The statues symbolize the reestablishment of friendship between the two towns. Poets Angela Leighton, Carol Rumens, Cliff Forshaw, and David Wheatley composed poems in honor of the unveiling of the sculptures."]}]}}