{"wiki_id": "http://www.wikidata.org/entity/Q5049310", "itemLabel": "Josh Webster", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Josh_Webster", "wikipedia_page": {"main": "Josh Webster (born 6 February 1994 in Chelmsford) is a British auto racing driver.", "link_mentions": [{"page": "Porsche Carrera Cup", "response": ["|  Josh Webster"]}, {"page": "Autosport BRDC Award", "response": ["| Jack HawksworthJosh HillJordan KingMelville McKeeJosh Webster"]}, {"page": "British Formula Renault Championship", "response": ["|  Josh Webster"]}, {"page": "List of Formula Renault 2.0 champions", "response": ["| Alice Powell Josh Webster"]}, {"page": "Porsche Carrera Cup Great Britain", "response": ["|  Josh Webster"]}, {"page": "Thomas Mills High School", "response": ["*Josh Webster, racing driver"]}, {"page": "Status Grand Prix", "response": ["|  Josh Webster", "|align=\"left\"|  Josh Webster"]}, {"page": "2010 Formula Renault 2.0 UK Championship", "response": ["Fortec Motorsport again took honours for the Series, as main season Graduate Cup winner Alex Lynn won the title after winning three of the six races to be held. He finished 17 points clear of teammate Joni Wiman, who made his Formula Renault début during the series having competed in ADAC Formel Masters, and claimed a victory at Pembrey. Jack Hawksworth finished third in his first single-seater championship, having taken two podiums and five top-ten finishes in his first six races out of karting for Mark Burdett Motorsport. Atech GP driver Richie Stanaway and Oliver Rowland of CRS Racing claimed the remaining victories as they finished in fifth and seventh places respectively. With five class wins, Fortec's Josh Webster won the BARC Winter Cup for the Formula Renault BARC competitors.", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2010 Formula Renault BARC season", "response": ["Hillspeed driver Alice Powell became the first female driver to win any Formula Renault championship after overhauling a 16-point deficit to rival Mitchell Hale of Fortec Motorsport at the season's final meeting at Thruxton. Powell won two races at Silverstone and Thruxton with five second places compared to Hale's three victories at Brands Hatch, Silverstone and Snetterton. Third place was also resolved at the final round of the season between Powell's teammate James Theodore and Josh Webster, who started the season as Hale's teammate but took part in the final meeting for Welch Motorsport. Theodore, a race-winner at Croft, Rockingham and Thruxton, got the better of Webster by three points, after he finished ahead of Webster in the final race of the season. Other race wins were taken by Joseph Reilly at Snetterton and Rockingham, Luke Wright at Croft, and Euan Hankey in a one-off appearance at Brands Hatch.", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2011 Formula Renault BARC season", "response": ["|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2011 Formula Renault 2.0 UK Championship", "response": ["|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2012 Formula Renault BARC season", "response": ["Following a second-place finish in the final race at Silverstone, Scott Malvern secured the championship title after achieving three victories during the season and eleven podiums in total, driving for Cliff Dempsey Racing in the opening half of the season and Cullen Motorsport thereafter. MGR Motorsport driver Josh Webster finished the season as runner-up for the second consecutive year; although he won five races – tied for most wins in the season along with Fortec Motorsport's Seb Morris – during the campaign, a less consistent finishing record allowed Malvern to take the title by 33 points via dropped scores. Morris was third at the end of the season, having started half of the season's races from pole position in his first year in the series having graduated from Ginetta Juniors. The only other race winner was Webster's team-mate David Wagner, who finished fourth in the championship.", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2012 Masters of Formula 3", "response": ["|  Josh Webster", "|  Josh Webster", "|  Josh Webster"]}, {"page": "2013 GP3 Series", "response": ["|  Josh Webster", "* Josh Webster moved from the Formula Renault BARC championship to GP3, racing for Status Grand Prix.", "|align=left|  Josh Webster"]}, {"page": "2013 Catalunya GP2 and GP3 Series rounds", "response": ["|  Josh Webster", "|  Josh Webster", "|  Josh Webster"]}, {"page": "2014 GP3 Series", "response": ["* Josh Webster, who drove for Status Grand Prix in 2013, left the series and switched to Porsche Carrera Cup Great Britain."]}, {"page": "2014 Porsche Supercup", "response": ["|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2014 Porsche Carrera Cup Great Britain", "response": ["For the majority of the season, the championship battle revolved around Redline Racing team-mates Josh Webster and Michael Meadows, running under the Samsung UHD TV Racing banner. Meadows won more races than Webster – Meadows with nine overall wins plus a further two class wins, while Webster took five overall wins with a further class win – but Webster's greater consistency allowed him to take the overall championship by nine points, ahead of the two-time defending champion Meadows. Webster finished each race as one of the best three finishers in class, including the overseas round at Le Mans, where he was seventh overall. Third place in the championship went to Paul Rees, who took a race victory at Rockingham, and three further podium finishes. The only other drivers to take race victories were Ben Barker, who achieved an overall victory at Le Mans – as well as two victories in the guest car in the opening Brands Hatch round – and Daniel Cammish, who took a win in the guest car at the final round. Redline Racing were comfortable winners of the teams' championship, finishing almost 200 points clear of In2Racing, the next best team.", "|  Josh Webster ", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "List of 2014 motorsport champions", "response": ["|  Josh Webster"]}, {"page": "2015 Porsche Carrera Cup Germany", "response": ["|  Josh Webster", "|align=\"left\"|  Josh Webster"]}, {"page": "2015 Porsche Supercup", "response": ["|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2015 Porsche Carrera Cup Great Britain", "response": ["With eleven victories and five second-place finishes from the sixteen races, Redline Racing driver Dan Cammish was the winner of the overall drivers' championship. Cammish, who at one point won 6 consecutive races, finished nearly 100 points clear of his next closest rival, team-mate Michael Meadows who was running under the Samsung SUHD TV Racing banner. Meadows took ten podium finishes, but only one victory, coming at Oulton Park. The championship top three was completed by defending champion Josh Webster (Team Parker Racing), who like Meadows, took one victory during the season, at Spa-Francorchamps. The only other drivers to win races were IDL Racing's Tom Sharp at Brands Hatch and GT Marques driver Dino Zamparelli, who swept the Silverstone weekend. In the Pro-Am classes, despite taking fewer class wins than Jordan Witt (Redline Racing), Juta Racing driver Ignas Gelžinis won the Pro-Am 1 title by five points. While in Pro-Am 2, six class wins were enough for John McCullagh to complete a championship sweep for Redline Racing.", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2016 IMSA SportsCar Championship", "response": ["|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2016 Renault Sport Trophy", "response": ["|  Josh Webster", "|align=left|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2016 International GT Open", "response": ["|  Josh Webster", "|  Nicky Pastorelli Josh Webster"]}, {"page": "2016 Porsche Supercup", "response": ["|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "Michael Meadows", "response": ["In 2012 and 2013, he became the overall champion in Porsche Carrera Cup Great Britain. For the past five years, he has finished in the top two. In 2014, Meadows won more races than Josh Webster, but Webster's greater consistency allowed him to take the overall championship by nine points, ahead of the two-time defending champion Meadows. In 2015, he was beaten by Daniel Cammish, the ex-champion in British Formula Ford. In the ten years he has raced, Meadows has notched up 31 career wins."]}, {"page": "2017 24H Series", "response": ["|  Josh Webster"]}, {"page": "2017 Dubai 24 Hour", "response": ["|  Jordan Grogor Louis Delétraz Jean-Éric Vergne Josh Webster Bassam Kronfli"]}, {"page": "2017 Porsche Carrera Cup Germany", "response": ["|  Josh Webster"]}, {"page": "2017 Porsche Supercup", "response": ["|  Josh Webster", "| align=left |  Josh Webster"]}, {"page": "2016 12 Hours of Sebring", "response": ["| rowspan=\"2\"|  Franz Konrad Terry Borcheller Christopher Brück Josh Webster"]}, {"page": "2018 Porsche Supercup", "response": ["|  Josh Webster", "| align=left |  Josh Webster"]}, {"page": "2019 24H GT Series", "response": ["|  Josh Webster"]}, {"page": "2019 Porsche Carrera Cup Great Britain", "response": ["|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "2019 Dubai 24 Hour", "response": ["|  Saeed Al Melaihi Robert Barff Gregory Caton Phil Quaife Josh Webster"]}, {"page": "2019 Porsche Supercup", "response": ["|  Josh Webster", "| align=left |  Josh Webster"]}, {"page": "2020 Porsche Carrera Cup Great Britain", "response": ["|  Josh Webster", "|  Josh Webster", "|  Josh Webster", "|align=left|  Josh Webster"]}, {"page": "Harry King (racing driver)", "response": ["In November 2019, King was announced as the Porsche Carrera Cup GB Junior driver for the 2020 and 2021 seasons, and he signed a contract with Team Parker Racing in February 2020. The championship start was delayed from the end of March to the start of August due to the COVID-19 pandemic in the United Kingdom; at the season-opening meeting at Donington Park, King took pole position by two tenths of a second, and was leading the opening race of the weekend before clipping a tyre wall at the final chicane. The resulting damage from this hit slowed King's car, and as a result, he lost the race lead to teammate Josh Webster, but maintained second place until the end of the race. In the second race – with a partially-reversed grid – King started third but led by the end of the first lap, and ultimately went on to claim his first win in the series. King swept the races at Brands Hatch and Oulton Park, before his five-race win streak was ended at Knockhill, after he was forced to retire with a coolant leak. In the second race, King started from tenth on the grid but made his way through the order, passing erstwhile race leader Scott McKenna on the final lap to take the victory. King retired from the lead in both races at Thruxton due to punctures, but then won the last six races of the season – wrapping up the championship title with a round to spare."]}]}}