{"wiki_id": "http://www.wikidata.org/entity/Q5044456", "itemLabel": "Carol MacReady", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Carol_MacReady", "wikipedia_page": {"main": "Carol Macready is an English actress. She is perhaps best known for the role of Mrs. Dribelle in Bodger and Badger. Carol is married to actor James Laurenson.\nOther television shows she appeared in include:\n\nAgatha Christie's Poirot - Milly Croft in \"Peril at End House\" and Miss Johnson in \"Cat Among the Pigeons\"\nThe Darling Buds of May - Mrs Daw\nThe Alleyn Mysteries - Mrs Ives in \"Death at the Bar\"\nThe Woman in White - Mrs Michelson\nTales of the Unexpected - Liz Ferguson in \"A Harmless Vanity\"\nUnion Castle - Elizabeth Steel\nMapp and Lucia - Daisy Quantock\nThe Vicar of Dibley - Mrs Tinker (Alice's mother) in \"The Christmas Lunch Incident\"\nCasualty - Evelyn Thomson in \"A Life Less Ordinary\"\nMy Family - Olga in \"The Guru\"\nMidsomer Murders - Hatty Down in \"Vixen's Run\"\nThe Flame Trees of Thika - Mrs Nimmo\nPlay for Today - Dorothy in Dennis Potter's \"Schmoedipus\"\nShakespeare & Hathaway: Private Investigators - Dolly Tearsheet - Episode 3.3 \"The Sticking Place\"", "link_mentions": [{"page": "July 4", "response": ["*  1952   – Carol MacReady, English actress"]}, {"page": "2000 in film", "response": ["| 102 Dalmatians || Walt Disney Pictures || Kevin Lima (director); Kristen Buckley, Brian Regan, Bob Tzudiker, Noni White (screenplay); Glenn Close, Gérard Depardieu, Ioan Gruffudd, Alice Evans, Tim McInnerny, Eric Idle, Ben Crompton, Carol MacReady, Ian Richardson, Jim Carter, Ron Cook, David Horovitch, Timothy West, Mike Hayley, Kerry Shale, Hugh Futcher, Jack Angel, Bill Farmer, Patrick Pinney, Phil Proctor || Comedy, Family || Live action"]}, {"page": "Agatha Christie's Poirot", "response": ["!scope=\"row\" rowspan=\"2\"| Carol MacReady"]}, {"page": "1989 in film", "response": ["| Murderers Among Us: The Simon Wiesenthal Story || HBO Pictures / Citadel Entertainment || Brian Gibson (director); Abby Mann, Robin Vote, Ron Hutchinson (screenplay); Ben Kingsley, Renée Soutendijk, Craig T. Nelson, Anton Lesser, Jack Shepherd, Paul Freeman, David Threlfall, Anna Cropper, Vernon Dobtcheff, Oliver Ford Davies, Philip Franks, Zoltán Gera, Patrick Godfrey, Henry Goodman, Jack Klaff, Carol MacReady, Miriam Margoyles, Harry Towb, Louisa Milwood-Haigh, Robert Morelli, Sándor Téri || Biography || Live action "]}, {"page": "1982 in film", "response": ["| The Scarlet Pimpernel || CBS / London Films || Clive Donner (director); William Bast (screenplay); Anthony Andrews, Jane Seymour, Ian McKellen, James Villiers, Eleanor David, Malcolm Jamieson, Richard Morant, Dominic Jephcott, Christopher Villiers, Denis Lill, Ann Firbank, Tracey Childs, Julian Fellowes, Mark Drewry, John Quarmby, David Gant, Geoffrey Toone, Joanna Dickens, Richard Charles, Gordon Gostelow, Carol MacReady, Daphne Anderson, Nick Brimble, Tony Caunter, Timothy Carlton, Kate Howard || Romance, Adventure || Live action"]}, {"page": "Spot (franchise)", "response": ["*Carol MacReady – Grandma"]}, {"page": "The Darling Buds of May (TV series)", "response": ["* Carol MacReady as Mrs. Daws, a local shopkeeper (4 episodes)"]}, {"page": "102 Dalmatians", "response": ["* Carol MacReady as Agnes Wilford "]}, {"page": "Bodger & Badger", "response": ["*Mrs Cecilia Dribelle (Carol MacReady) - The extravagantly dressed businesswoman from whom Bodger rents his flat in Series 6 and 7. She has a distinct dislike for animals (apart from cats) and forbids her tenants from keeping pets, resulting in Bodger having to constantly hide Badger whenever she visits. She dislikes Bodger intensely and tries everything she can think of to evict him, she also expressed a dislike for pop music in one episode. She is fond of cakes and biscuits, and likes to profit from silly ideas. She is nicknamed 'Mrs Dribble' and 'Dribbly Bibbly' by Badger. She drives around in a car which varied in different episodes with the registration plate 'DRIB 1' and has a cat called Fluffykins. In her early episodes she is made aware of Badger's presence by her sidekick, Elton, but never actually sees him as Elton's plans to catch Badger always fail. She eventually decides that Elton is imagining Badger. However, she has spotted Badger herself on several occasions - in one episode she saw Badger when she got knocked out, mistakenly thinking that Badger was her pet cat Fluffykins. Another was when Fluffykins had disappeared and Badger was inside the cat box pretending to be Fluffykins. Another time was when Badger was hiding behind a picture frame which Mrs Dribelle thought was a picture of a Badger. After spending the majority of Series 6 trying to find ways to evict Bodger, Mrs Dribelle later employs him as her handyman in Series 7. Later on she allowed her niece, Vicky, to stay in the first floor flat above Bodger's after she evicted Alec Smart. After Vicky left to go touring with a band, Mrs Dribelle temporarily moved into the vacant flat while her house was being decorated."]}, {"page": "Marmalade Atkins", "response": ["Also featuring John Bird and Lynda Marchal as her parents Mr & Mrs Atkins (the latter replaced by Carol MacReady for the Marmalade at Work series), the programmes were produced by Thames Television for ITV. The show's creator, Andrew Davies, went on to author a series of Marmalade Atkins books.  The theme track for Educating Marmalade was written and performed by Bad Manners."]}, {"page": "The Scarlet Pimpernel (1982 film)", "response": ["* Carol MacReady as Madame Duval, the wife of Duval"]}, {"page": "Afternoon Off", "response": ["* Carol MacReady as Shoe-Shop customer"]}, {"page": "Macready", "response": ["*Carol MacReady, English actress"]}, {"page": "Forever Young (1983 film)", "response": ["*Carol MacReady ... Brenda"]}, {"page": "Me! I'm Afraid of Virginia Woolf", "response": ["*Carol MacReady - Wendy"]}, {"page": "A Feast at Midnight", "response": ["*  Carol MacReady - Miss Plunder  "]}, {"page": "Screen Two", "response": ["Cast: Pam Ferris, Ken Christiansen, Charlotte Coleman, Constance Chapman, David Ryall, Danny Webb, Peter Blythe, Jim Carter, Gary McDonald, Emily Piercy, Kate Fenwick, Amanda Symonds, Jill Spurrier, Carol MacReady, Maeve Murphy and Jonathan Wrather"]}, {"page": "Children's Film Unit", "response": ["How's Business (1991) Adapted from the book by Alison Prince, this wartime drama follows young Howard Grainger as he is evacuated from London during the Blitz and relocated to the countryside, where he begins a series of schemes to try and accrue sufficient funds to return home. Cast includes: Ben Brazier, Ron Moody, Paul Brightwell, Paul Copley, Sara Clee, Richard Digance, Don Henderson, Brett Fancy, Emily Richard, Ann Way, Carol MacReady"]}, {"page": "Ladies in Lavender (stage play)", "response": ["The original cast was led by Hayley Mills as Ursula, Belinda Lang as Janet, Carol MacReady as Dorcas and Robert Rees as Andrea.  Robert Duncan played Dr Mead and Abigail Thaw was Olga."]}, {"page": "Stanley's Dragon", "response": ["* Carol MacReady - Mrs. Batley"]}, {"page": "The Christmas Lunch Incident", "response": ["The vicar is also invited to attend four Christmas lunches, the first she happily accepts and reluctantly accepts the next three as she does not want to disappoint or offend those offering who are relying on her attendance. The first one is with two of her fellow parish council members Frank Pickle (John Bluthal) and Jim Trott (Trevor Peacock). The next one is with David Horton (Gary Waldhorn) and his son Hugo (James Fleet). The third is with Alice, her mother (Carol MacReady) and her more dim-witted sister Mary (Mel Giedroyc). The fourth is offered to her after she's attended the other three by the remaining parish council member Owen Newitt (Roger Lloyd-Pack), he initially told the vicar he was not going to invite her much to her relief but he mistakes her joy as a subtle way of asking to join him for lunch."]}, {"page": "The Woman in White (1982 TV series)", "response": ["* Carol MacReady as  Mrs. Michelson"]}, {"page": "Union Castle", "response": ["* Carol MacReady as Elizabeth Steel"]}]}}