{"wiki_id": "http://www.wikidata.org/entity/Q504726", "itemLabel": "Dennis Taylor", "itemDescription": "British snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Taylor", "wikipedia_page": {"main": "Dennis Taylor (born 19 January 1949) is a Northern Irish retired professional snooker player and current commentator. He is best known for winning the 1985 World Snooker Championship, where he defeated the defending champion Steve Davis in a final widely recognised as one of the most famous matches in professional snooker history. Despite losing the first eight frames, Taylor recovered to win 18–17 in a dramatic duel on the last black ball. The final's conclusion attracted 18.5 million viewers, setting UK viewership records for any post-midnight broadcast and for any broadcast on BBC Two that still stand to this day.\nTaylor had previously been runner-up at the 1979 World Snooker Championship, where he lost the final 16–24 to Terry Griffiths. His highest world ranking of his career was in 1979–1980, when he was second. He won one other ranking title at the 1984 Grand Prix, where he defeated Cliff Thorburn 10–2 in the final, and also won the invitational 1987 Masters, defeating Alex Higgins 9–8 in the final. He made the highest break of his career at the 1987 Carling Challenge, a 141.\nBeginning in 1983, Taylor wore distinctive glasses designed by Jack Karnehm specifically for playing snooker. Often described as looking upside-down, they gave him a unique look on the circuit. Since retiring from the main professional tour in 2000, he has been a regular commentator on BBC snooker broadcasts. He competed on the World Seniors Tour until he announced the end of his competitive playing career in 2021, aged 72. Outside snooker, he appeared on the third series of Strictly Come Dancing, finishing eighth alongside dance partner Izabela Hannah.\n\n", "link_mentions": [{"page": "Northern Ireland", "response": ["Northern Ireland has produced two world snooker champions; Alex Higgins, who won the title in 1972 and 1982, and Dennis Taylor, who won in 1985. The highest-ranked Northern Ireland professional on the world circuit presently is Mark Allen from County Antrim. The sport is governed locally by the Northern Ireland Billiards and Snooker Association who run regular ranking tournaments and competitions."]}, {"page": "Snooker", "response": ["The return of the game to the public consciousness was due to the growth of colour television. In 1969, David Attenborough (then the controller of BBC2) commissioned the snooker tournament television series, Pot Black, primarily to showcase the potential of the BBC's new colour service, as the green table and multi-coloured balls provided an ideal opportunity to demonstrate the advantages of the new broadcasting technology. The series became a ratings success and was, for a time, the second-most popular show on BBC2 behind Morecambe and Wise. Interest in the game increased in the next decade and the 1978 World Snooker Championship was the first to receive daily television coverage. Snooker quickly became regarded as a mainstream game in the United Kingdom, Ireland, and much of the Commonwealth, and has remained consistently popular since the late 1970s, with most of the major tournaments being televised. In 1985, an estimated 18.5 million viewers watched the conclusion of the World Championship final between Dennis Taylor and Steve Davis, a record viewership in the UK for any broadcast after midnight.", "Steve Davis (no relation to Joe or Fred) won his first World Championship in 1981, becoming the 11th world champion since 1927. He won six world titles (1981, 1983, 1984, and 1987–1989) and competed in the most-watched snooker match, the 1985 World Snooker Championship final, which he lost to Dennis Taylor. Stephen Hendry became the 14th world champion in 1990, aged 21 years and 106 days; he is the youngest player ever to have lifted the world title. Hendry dominated the sport through the 1990s, winning the World Championship seven times (1990, 1992–1996, and 1999)."]}, {"page": "1949", "response": ["** Dennis Taylor, Irish snooker player"]}, {"page": "County Tyrone", "response": ["* Dennis Taylor, former world snooker champion"]}, {"page": "1979 in sports", "response": ["* World Snooker Championship – outsider Terry Griffiths beats Dennis Taylor 24-16"]}, {"page": "Bill Werbeniuk", "response": ["A memorable incident occurred during a televised match against Dennis Taylor in the World Team Tournament. Werbeniuk tried to stretch across the table, but due to his size was having some difficulty. Eventually he split his trousers. The ripping noise it made caused many in the audience, including his opponent, to laugh out loud. Werbeniuk took it in good humour, asking the audience \"who did that?\" as if insinuating that the noise was attributed to flatulence."]}, {"page": "1985 in sports", "response": ["* World Snooker Championship – Dennis Taylor beats Steve Davis 18-17 in one of the greatest snooker matches of all time"]}, {"page": "List of sports announcers", "response": ["* Dennis Taylor – BBC Sport 1993–present, ITV Sport 1990, 1991, 2011, Eurosport/Quest 2016"]}, {"page": "Alex Higgins", "response": ["The unorthodox play of Higgins was encapsulated in his break of 69, made under extreme pressure, against Jimmy White in the penultimate frame of their World Professional Snooker Championship semi-final in 1982. Higgins was 0–59 down in that frame, but managed to compile an extremely challenging clearance during which he was scarcely in position until the colours. In particular, former world champion Dennis Taylor considers a three-quarter-ball pot on a blue into the green pocket especially memorable, not only for its extreme degree of difficulty but for enabling Higgins to continue the break and keep White off the table and unable to clinch victory at that moment. In potting the blue, Higgins screwed the cue-ball on to the side cushion to bring it back towards the black/pink area with extreme left-hand sidespin, a shot Taylor believes could be played 100 times without coming close to the position Higgins reached with cue-ball. He went a little too far for ideal position on his next red but the match-saving break was still alive.", "Another came at the 1990 World Championship; after losing his first-round match to Steve James, he punched tournament official Colin Randle in the abdomen before the start of a press conference at which he announced his retirement, and abused the media as he left. This followed another incident at the World Cup, where he repeatedly argued with fellow player and compatriot Dennis Taylor, and threatened to have him shot. For his conduct, Higgins was banned for the rest of the season and all of the next."]}, {"page": "Jimmy White", "response": ["However White toiled for the remainder of the season, and his struggles continued at the 1993 World Championship.  He did, however, manage to overcome Joe Swail, Doug Mountjoy and Dennis Taylor to reach the semi-finals. White lost the first five frames of his semi-final with James Wattana but, from 2–6, he won 12 successive frames en route to a 16–9 victory. However he proved no match for Stephen Hendry in the final, and Hendry's century break in his first visit to the table proved portentous, as White was beaten 18–5 with a session to spare. Only John Parrott (in 1989) has suffered a heavier defeat in a World Championship final. White did, however, manage to end the season on a high note when he beat Alan McManus to win the Matchroom League."]}, {"page": "World Snooker Championship", "response": ["The 1979 championship was won by Terry Griffiths who had only turned professional seven months prior to the tournament, and needed to win two qualifying matches to reach the Crucible. Griffiths was trailing 16–17 against Eddie Charlton in the semi-final, before eventually winning the match 19–17 at 1.40 am. He then beat Dennis Taylor 24–16 in the final, winning the record first prize of £10,000. Canadian Bill Werbeniuk made a break of 142 in his quarter-final match against John Virgo, equalling the championship record set by Rex Williams in South Africa in 1965.", "| 1985 || Dennis Taylor", "In the 1985 final, also known as the black ball final, Dennis Taylor beat Steve Davis 18–17 on the final ball of the final frame, in one of the most closely contested matches of all time. It finished at 00:19 and, with an audience of 18.5 million, it remains the most-watched programme in the history of BBC2, and holds the record for a post-midnight audience for any channel in the United Kingdom. Davis met sixteenth seed Joe Johnson in the 1986 final. Johnson led 13–11 at the start of the evening session and won five of the first six frames to win 18–12. Johnson had trailed 9–12 in his quarter-final against Terry Griffiths but won the last four frames to win 13–12. Johnson and Davis met again in the 1987 final although, on this occasion, Davis was the winner by a score of 18–14.", " The format for the World Championship has been largely unchanged since 1982. It has a knock-out format with 32 players, contested over 17 days ending on the first Monday in May, which is a public holiday in the United Kingdom. Before 1982 there were a number of different formats used for the Championship. In 1980 and 1981, 24 players played in the final stages at the Crucible. The top eight seeds had a bye in the first round while seeds 9 to 16 played in the first round against eight qualifiers. From 1977 to 1979, the first three years at the Crucible, only 16 players reached the final stages, eight seeds playing eight qualifiers in the first round. Before 1980, the final was not always played over a set number of frames- for example, in 1978 Ray Reardon beat Perrie Mans in a best-of-49 frames match 25–18 and, the following year, Terry Griffiths defeated Dennis Taylor 24–16 in a best-of-47.", "David Vine continued to be the main host for the BBC's TV coverage until 2000, with David Icke as prominent second host from 1985 to 1990, and Dougie Donnelly through the 1990s. For some years commentary was primarily by Ted Lowe, Clive Everton and Jack Karnehm although John Pulman, Vera Selby and others were used. In 1986 Jim Meadowcroft, John Spencer and John Virgo were used as summarisers. From 2001 to 2009 the BBC coverage was hosted by Hazel Irvine or Ray Stubbs. From 2010, Hazel Irvine took over with highlights presented by Rishi Persad. In February 2013, the BBC announced that Rishi Persad had been replaced by Jason Mohammad, who himself later stepped down from those duties after the conclusion of the 2019 Masters and was replaced by Seema Jaswal. Commentators have included Willie Thorne, Dennis Taylor, John Virgo, John Parrott, Steve Davis, Ken Doherty, Stephen Hendry, Terry Griffiths and Neal Foulds."]}, {"page": "Wrexham", "response": ["*Dennis Taylor – ex-snooker World Champion, currently living in Llay."]}, {"page": "Steve Davis", "response": ["Steve Davis  (born 22 August 1957) is an English retired professional snooker player. He is best known for dominating the sport during the 1980s, when he reached eight World Snooker Championship finals in nine years, won six world titles, and held the world number one ranking for seven consecutive seasons. The first player to make an officially recognised maximum break in professional competition, and the first to earn £1 million in career prize money, he famously was runner-up to Dennis Taylor in one of the sport's most memorable matches, the 1985 World Snooker Championship final. Its dramatic black-ball conclusion attracted 18.5 million viewers, setting UK records for any broadcast after midnight and any broadcast on BBC Two that still stand to this day. Named the BBC's Sports Personality of the Year in 1988, he remains the only snooker player to win the award.", "Davis won the English Under-19 Billiards Championship in 1976. One of his last wins as a snooker amateur was against Tony Meo, another future professional, in the final of the 1978 Pontins Spring Open. He defended his title a year later, defeating future rival Jimmy White 7–4 in the final. Davis applied in 1978 to become a professional and was initially rejected, before being accepted with effect from 17 September 1978, becoming the youngest of the professional players.  He made his professional television debut on Pot Black, where he played against Fred Davis. He played in his first World Snooker Championship in 1979, having won two qualifying matches, but lost 11–13 to Dennis Taylor in the first round proper.", "At the 1980 World Snooker Championship he reached the quarter-finals, defeating Patsy Fagan and defending champion Terry Griffiths before losing to Alex Higgins 9–13. He won his first major title that year, the 1980 UK Championship, beating Griffiths 9–0 in the semi-finals and Higgins 16–6 in the final. After winning his first title, he won the Wilson's Classic in 1980, the Yamaha Organs and English Professional in 1981, and was the bookmakers' favourite to win the 1981 World Snooker Championship despite being seeded 13th. Davis reached the final by defeating White in the first round, Higgins in the second round, Griffiths in the quarter-finals and defending champion Cliff Thorburn in the semi-final. In the final, he won 18–12 against Doug Mountjoy to take his first world championship. Davis completed a 9–0 whitewash victory over Dennis Taylor in the International Open final and retained the UK Championship with a 16–3 win over Griffiths in the final, winning five events in 1981. In January 1982, Davis compiled the first televised maximum break at the Classic at Queen Elizabeth Hall in Oldham against John Spencer. As Lada were sponsoring the event, they offered Davis a car for completing the break. He reached the final, but lost 8–9 to Griffiths in the final. However, later that month Davis defeated Griffiths 9–5 in the Masters final, to win his first title.", "At the 1985 World Snooker Championship, Davis defeated Neal Foulds, David Taylor, Griffiths and Reardon en route to the final, where his opponent was Dennis Taylor. He won all of the frames in the first , and the first of the evening session, to lead 8–0 but Taylor recovered to trail 7–9. From 11 to 11, they traded frames before Davis forged ahead to lead 17–15. Taylor won the next two frames to level the match at 17–17 and force a deciding frame. With the scores close, Taylor potted the final  to leave the . The player who potted the ball would win the championship; after a series of safety shots and attempts to pot it, Davis over-cut the black and left Taylor with a reasonably-straightforward pot to secure the championship. Taylor potted the ball to win the tournament. The final was watched by 18.5 million viewers, setting records for BBC Two and for a post-midnight audience on British television. The final, later called the \"black ball final\", was voted the ninth-greatest sporting moment of all time in a 2002 Channel 4 poll; Davis's disbelief and Taylor's triumphant, pointing finger have been replayed many times on television."]}, {"page": "Joe 90", "response": ["Both Anderson and Cull suggest that the series, with its bespectacled protagonist, boosted the self-confidence of young viewers who wore glasses. The name \"Joe 90\" has become a popular term of endearment for both children and adults who wear glasses similar to Joe's, such as snooker player Dennis Taylor. During the 1990s, comparisons were made between Joe and then-Prime Minister John Major, also known for his large glasses.Cook, p. 113. Jeff Evans, author of The Penguin TV Companion, criticises the glasses as a plot device, writing that they make Joe \"look more like the class swot than a secret agent.\""]}, {"page": "Coalisland", "response": ["* Dennis Taylor (b. 1949) - 1985 Snooker World Champion."]}, {"page": "1985 World Snooker Championship final", "response": ["! scope=\"col\" |Dennis Taylor", "The 1985 World Snooker Championship final, also known as the black ball final, was played on the weekend of  1985 at the Crucible Theatre in Sheffield, England. The final of the 1985 World Snooker Championship was between defending world champion Steve Davis and 1979 runner-up Dennis Taylor. It was Davis's fourth appearance in a final and Taylor's second. The best-of-35- match was split into four . Davis won every frame in the first session to lead 7–0 but only led 9–7 and 13–11 after the second and third sessions. Until the match was over, Taylor was never ahead in frames but had tied the contest three times at 11–11, 15–15 and 17–17. The  culminated in a number of shots on the final . After both players had failed to  it several times, Taylor potted the black to win his only world championship. Media outlets reported this as a major shock: Davis had been widely predicted to win the match, having lifted three of the previous four world championship titles.", "Dennis Taylor, ranked 11, led Silvino Francisco 8–1 in the opening session, and won the match 10–2. In the second round, Taylor played Eddie Charlton where he won 13–6. Taylor played Cliff Thorburn in the quarter-finals, in a match full of slow play. He led 10–5 after an over nine-hour second session, but won the first three frames in the final session to win 13–5. In the semi-final Taylor lost the first two frames against Tony Knowles, but won 16 of the next 19 to win 16–5, the same scoreline as Davis.", "!scope=\"col\" colspan=2|Dennis Taylor", "|colspan=\"12\" align=\"center\"| Dennis Taylor wins the 1985 Embassy World Snooker Championship = Winner of frame", "* 1985 World Snooker Championship – Steve Davis v Dennis Taylor Black Ball Final on YouTube (World Snooker Tour edit, 44 minutes)"]}, {"page": "Stephen Hendry", "response": ["In his first season, he reached the last 32 in the Classic and was the youngest ever Scottish Professional champion, winning the 1986 edition. He also became the youngest player ever to qualify for the World Championship, a record he held until 2012 when Luca Brecel qualified at the age of 17 years and one month. He lost 8–10 to Willie Thorne who then applauded him out of the arena. In the next season he retained the Scottish Professional Championship title and reached the quarter-finals of both the Grand Prix and World Championship, losing 12–13 to defending champion Joe Johnson, and the semi-finals of the Classic. Hendry and Mike Hallett combined to win that year's World Doubles Championship. In the 1987–88 season, Hendry won his first world ranking titles, the Grand Prix, beating Dennis Taylor 10–7 in the final, and the 1988 British Open. He also claimed three other tournament victories, retaining both the Scottish Professional Championship and the World Doubles Championship (with Hallett), and the Australian Masters. By the end of that season he was ranked world no. 4 and was voted the BBC Scotland Sports Personality of the Year.", "Hendry's World Snooker profile states that he is \"One of snooker’s all-time greats\". Former player Dennis Taylor (in 2013), and former player and coach of Ronnie O’Sullivan, Ray Reardon (in 2004), have stated that he has been superseded by O'Sullivan. In 2005 John Higgins, who competed with both players at their respective peaks, concurred, proclaiming O'Sullivan as \"the best that's ever played the game\". Steve Davis—a six-times former world champion and BBC pundit—is more divided on the issue, considering O'Sullivan to be the best player but Hendry the greatest winner. Jimmy White also regards O'Sullivan as the best player he's ever seen, but considers Steve Davis his toughest opponent. Dell Hill—a snooker coach who has worked with some of the game's top players—also considers O'Sullivan the best player \"without a shadow of a doubt\", but believes that O'Sullivan has \"under-achieved\" next to Hendry. O'Sullivan himself has dismissed the suggestion that he is the greatest player and believes that a player must equal Hendry's haul of seven world titles to be regarded as such. Former world champion Stuart Bingham also takes a statistical view of the question, stating that O'Sullivan is the \"best player to pick up a cue\" but Hendry's record of seven world titles settles the debate as to who the greatest player is. Desmond Kane of Eurosport has argued that if it were purely a statistical question then Joe Davis's fifteen world championships would settle the issue, that there is no real difference between the \"greatest\" and the \"best\", and that O'Sullivan has played snooker to a higher standard than anyone.", "|  Dennis Taylor", "|  Dennis Taylor", "|  Dennis Taylor"]}, {"page": "Joe Johnson (snooker player)", "response": ["Johnson started the season unranked. His first event was the 1981 International Open in which he beat Jim Donnelly 5–4 in Round 1, Murdo MacLeod 5–1 in Round 2 and received a walkover against John Pulman in Round 3. In Round 4 Johnson beat Jim Wych 5–3 and then lost in Round 5, the last 32, 5–3 to Graham Miles. In the 1981 UK Championship Johnson began the event with a comprehensive 9–1 win over Tommy Murphy in Round 2. This was followed by a Round 3 9–3 defeat of Mike Watterson and in Round 4 a 9–4 win over Cliff Wilson. In round 5 Johnson beat the former three-time world champion John Spencer 9–5 and this earned Johnson a last 16 appearance at the UK Championship against another former world champion, Ray Reardon, to whom Johnson narrowly lost 9–7. At the 1982 International Masters, Johnson began the event in the pre-qualifying group stage with a 2–1 loss against Dave Martin, and 2–0 wins over both Geoff Foulds and Cliff Wilson. The results were enough to take Johnson into the next qualifying round where he lost 2–1 to John Virgo, but beat John Spencer 2–1 and Dave Martin (again) 2–0. In the third and final group stage Johnson lost 2–0 to Dennis Taylor and Reardon but beat Virgo 2–1, but the win was not enough to take Johnson out of the group stage. In Round 1 of the 1982 World Championship Johnson beat Vic Harris 9–4 and reached the last 48, where he lost 9–8. After a 2–0 Round 1 defeat by Jackie Rea in the 1982 Bass and Golden Leisure Classic Johnson ended the season with no ranking points, £2,950 prize money – 25th in the money list, but was again unranked.", "Johnson's wins in the previous season had provided him with his first ranking points and they were enough for him to be ranked 23rd in the world. In the last 48 of the 1983 International Open Johnson beat Dennis Hughes 5–1 and then lost 5–2 to Eddie Charlton in the last 32. Johnson began the untelevised 1983 Professional Players Tournament in fine form with an opening frame 117 break in a last 64 5–3 win over Pascal Burke. In the last 32 Johnson beat a young up and coming Jimmy White 5–3 to set up a rematch against Eddie Charlton, which this time Johnson won 5–0 and included a 111 break. In the quarter final Johnson beat the highly ranked Cliff Thorburn 5–1 and in the semi final Johnson beat Tony Meo 9–6 in order to reach his first major final against Tony Knowles. 1–6 down to Tony Knowles at one stage, Johnson fought back to take the match to a decider, and losing 9–8. At the 1983 UK Championship Johnson beat Matt Gibson 9–6. In the last 32 Johnson made a 119 break on his way to beating John Virgo 9–6 in the last 32. In the last 16 Johnson beat David Taylor 9–3 to earn himself another quarter final appearance where he lost 9–2 to Terry Griffiths. At the 1984 Classic Johnson beat Frank Jonik 5–2 in the last 48 before losing 5–4 to John Spencer in the last 32[29]. At the 1984 International Masters Johnson lost 2–0 to Colin Roscoe and Doug French in the qualifying group stage. In qualifying for the 1984 World Championship Johnson won his first match, a last 48 encounter with Matt Gibson 10–3 and this earned Johnson made his debut at the Crucible stage of the 1984 World Snooker Championship, where he was beaten 10–1 by Dennis Taylor. Johnson ended the season with prize money of £12,900 the 18th highest for the season and 4 ranking points.", "Johnson started the 1984/85 season ranked 19th in the World. At the 1984 Costa Del Sol Classic Johnson made a 105 break in his 3–1 quarter final win over Mick Fisher and then lost 3–2 in the semi final to Dennis Taylor. At the 1984 International Open Ranking event, Johnson beat Mario Morra 5–0 in the last 48 and Eddie Charlton 5–1 in the last 32 before losing again to Dennis Taylor, this time 5–2 in the last 16. In the following ranking event, the 1984 Grand Prix Johnson beat Paul Medati 5–1 in the last 64 but then lost 5–4 to Ian Williamson last 32.> At the 1984 UK Championship Johnson beat John Rea 9–6 in the last 48 and John Spencer by the same scoreline in the last 32. In the last 16 Kirk Stevens beat Johnson 9–2. In the 1985 Mercantile Credit ranking event Johnson reached the semi-final with a last 48 5–4 win over Ray Edmonds, a 5–1 last 32 win over Tony Knowles and a 5–0 whitewash of Cliff Wilson in the last 16 and a 5–1 win over Warren King in the quarter final. In the semi-final Johnson met Cliff Thorburn and apart from a single century from Thorburn, Johnson lost the low scoring match by 9 frames to 2.", "In the 1990 UK Championship Johnson narrowly beat Warren King 9–8 in the last 64 and followed that with a 9–5 victory over Gary Natale in the last 32 before losing to John Parrot 9–8 in the last 16. In the following ranking event, the 1991 Classic, Johnson beat Paddy Browne in the last 64 and a 5–0 win over John Campbell took Johnson into the last 16 where he lost 5–3 to Rod Lawler. A last 64 win against Chris Cookson in the 1991 British Open took Johnson to the last 32 where he lost to Mike Hallet. In 1991 European Open Johnson beat Andrew Cairns to set up another last 32 appearance where he 5–0 to Stephen Hendry. A 10–8 victory over Nigel Bond saw Johnson qualify for his last appearance at the Crucible in the World Championship where he lost 10–6 in the last 32 to Dennis Taylor."]}, {"page": "John Higgins", "response": ["In the World Championship in 2009, Higgins beat Michael Holt 10–5 in round one. His second-round and quarter-final matches both went the full distance of 25 frames, with Higgins overcoming 10–12 and 11–12 deficits against Jamie Cope and Mark Selby, respectively, to win 13–12. He established a 13–3 lead in the semi-final against Mark Allen and progressed 17–13 – withstanding a comeback by the Northern Irishman. Higgins recorded an 18–9 victory over Shaun Murphy in the final to become the ninth player to win the World title three or more times after Joe Davis, Fred Davis, John Pulman, John Spencer, Ray Reardon, Steve Davis, Stephen Hendry and Ronnie O'Sullivan. He joined Steve Davis, Hendry and O'Sullivan as the only players to have lifted the trophy three or more times at The Crucible. At two weeks before his 34th birthday, Higgins became the oldest player to triumph since Dennis Taylor in 1985, who was 36 years of age."]}, {"page": "John Virgo", "response": ["Virgo's snooker-playing fortunes peaked in 1979 when he reached the semi-final of the World Championship, and went on to win the 1979 UK Championship (though this was not a ranking event at the time). En route to the final, he beat Tony Meo, Steve Davis and Dennis Taylor. He overcame the reigning world champion Terry Griffiths in the final, despite being controversially docked two frames because of a miscommunication regarding the start time of the next session of play. He reached his highest ranking, world number 10, during the 1979–80 season.", "|  Dennis Taylor"]}, {"page": "Graeme Dott", "response": ["It stands as the longest final ever, and was, at the time, the latest to finish (John Higgins's victory over Mark Selby the following year now holds the record). The previous record holder had been the classic final frame black ball finish 1985 final between Englishman Steve Davis and Northern Irishman Dennis Taylor, which ended at 12:19 a.m. (GMT). The Dott–Ebdon match finished half an hour later, despite featuring three fewer frames, reflecting the slow overall pace of the match, so slow that both afternoon sessions only had six frames, rather than the usual eight. Moreover, at over 74 minutes, the 27th frame was the then longest in the history of the World Championship, beating the previous record of 70 minutes set by Canadian Cliff Thorburn and Welshman Doug Mountjoy, a record that would stand until 2009."]}, {"page": "Graham Miles", "response": ["This form continued in January 1979, when he reached the final of the Holsten Lager International by defeating John Pulman, Dennis Taylor and Alex Higgins. He led John Spencer 7–6 in the final, having made a break of 107, but eventually lost 7–11 to take £2000 as runner-up.Everton Clive (Ed.) Snooker Scene, February 1979, pp13-15.", "|  Dennis Taylor"]}, {"page": "Tony Meo", "response": ["He retired from professional play after the 1996–97 snooker season and became a wrist watch consultant.  In 1986, Meo was one of five players under Barry Hearn's management (along with Davis, Terry Griffiths, Willie Thorne and Dennis Taylor) who appeared on \"Snooker Loopy\", a hit single about the game recorded with Chas & Dave.", "In 1982, Meo signed up to be managed by Barry Hearn, Davis's manager.  With Davis, Meo won four World Doubles titles, and was also part of the victorious England team at the 1983 World Team Classic. In 1986, Meo was one of five players under Hearn's management (along with Davis, Griffiths, Thorne and Dennis Taylor) who appeared on \"Snooker Loopy\", a hit single about the game recorded with Chas & Dave. He was nicknamed \"The Cat\" and \"Meo, Meo\". The highest ranking that he attained was tenth."]}, {"page": "Ray Reardon", "response": ["Reardon won his fifth world title at the 1976 World Snooker Championship, defeating John Dunning 15–7, Dennis Taylor 15–2 and Perrie Mans 20–10. During the final against Higgins, Reardon complained about the television lighting, which was changed, the quality of the table, to which adjustments were subsequently made, and the referee, who was replaced. Higgins led in the early stages of the match, but Reardon won twelve of the next fifteen frames from 15 to 13 for a 27–16 victory. He also won the 1976 World Professional Match-play Championship in Australia, defeating the event's promoter Charlton 31–24 in the final.", "1979 saw Reardon regain his Pot Black title by defeating Mountjoy 2–1 in the final. It was Reardon's first win since he won the inaugural event in 1969, although he was runner up in 1970, 1972 and 1980. At the 1979 World Championship, he lost to Dennis Taylor in the quarter-final, and was eliminated by David Taylor at the same stage in 1980. He went a stage further in 1981, beating Spencer 13–11 and Werbeniuk 13–10 before being defeated Mountjoy in the semi-finals. Mountjoy scored a championship record break of 145 during the match, which he won 16–10."]}, {"page": "Terry Griffiths", "response": ["Terence Martin Griffiths  (born 16 October 1947) is a Welsh retired professional snooker player and current snooker coach and pundit. In his second professional tournament, he became world champion when he won the 1979 World Snooker Championship. He was the second qualifier to win the title after Alex Higgins achieved the feat in 1972; only Shaun Murphy has done it since, winning the title in 2005. Griffiths defeated Dennis Taylor by 24  to 16 in the final. Nine years later, in 1988, Griffiths reached the final of the competition again. He was tied with Steve Davis at 8–8, but lost the match 11–18.", "In his first professional match, in the qualifying competition for the 1978 UK Championship, Griffiths lost 8–9 to Rex Williams after leading 8–2. Williams took a 2–1 lead, before Griffiths won the next seven frames, and Williams took the following seven. In the , Griffiths rushed when potting the  and went , a  shot. Williams later potted the pink to secure victory. After qualifying for the 1979 World Championship, by eliminating Bernard Bennett 9–2 (from 0–2 behind) and Jim Meadowcroft 9–6 (from 6–6), Griffiths defeated the previous year's runner-up Perrie Mans 13–8 in the first round and Alex Higgins 13–12 in the quarter-finals. After beating Eddie Charlton 19–17 in a long semi-final that finished at 1:40 am, Griffiths told interviewer David Vine \"I'm in the final now, you know.\" In the final, he faced Dennis Taylor, who, having been a professional since 1973, was also playing in his first world championship final. The match was close for the first four of the six , and the match was level at 15–15 before Griffiths took a 17–16 lead and went on to win 24–16, becoming world champion at the first attempt, in only his second tournament as a professional. He was only the second player to win the championship after playing in qualifying, after Higgins in 1972, and the first to win it at the Crucuble as a qualifier. The only other player to achieve this, as at 2021, was Shaun Murphy in 2005."]}, {"page": "John Spencer (snooker player)", "response": ["Spencer gained important TV exposure by winning BBC TV's Pot Black series in 1970 (reversing his defeat by Ray Reardon in the 1969 final) and again in 1971 when he beat Fred Davis in the final. Spencer also claimed the highest break prize in 1972, was runner-up in 1974, and won the event again in 1976 (beating Dennis Taylor in the final), thus becoming the first three-time winner.", "In 1974, he lost 13–15 to Perrie Mans in the second round. Spencer refused to blame the defeat on a dose of flu from which he had been suffering (and Mans did indeed defeat Spencer again in the 1978 event). Spencer's only consolation was a plate competition for first and second round losers where he easily crushed his opponents, notching up six centuries in defeating David Greaves 5–1, Dennis Taylor 9–4, Jim Meadowcroft 9–3 and John Pulman 15–5 in the final.Everton, Clive (ed.), Snooker Scene, June 1974, pp. 9 & 18.", "In January 1980, Spencer won £3,000 (a record for a two-day event) at the Wilson's Classic. Broadcast by Granada TV, the final contained another notorious push-shot incident adjudged against Spencer's opponent Alex Higgins.Everton, Clive (ed.), Snooker Scene, February 1980 pp. 16–17. See also https://www.youtube.com/watch?v=XZW6VxHK-hY Higgins received a £200 fine for his reaction to Jim Thorpe's controversial decision.Everton, Clive (ed.), Snooker Scene, March 1980, p. 21. Spencer also won the Winfield Australian Masters in 1980, beating Dennis Taylor in the final. This was Spencer's last professional solo tournament victory (he was runner-up in the 1981 event).", "Such a victory only partially made up for Spencer's great disappointment at the 1981 Masters event. Having dispatched Dennis Taylor 5–2 and Ray Reardon 5–1, Spencer led Terry Griffiths 5–2 with Griffiths needing two snookers in the next frame. However, Griffiths managed to recover the match and eventually won by 6–5 after almost six hours of play. Spencer thus missed out on a major final with old rival Alex Higgins.Everton, Clive (ed.), Snooker Scene, March 1981, p. 11.", "After falling to a career low 34th in the rankings for the 1986/87 season, Spencer continued to work hard on his game. In the 1986 BCE International Championship, he recorded breaks of 104 and 134 against Ian Williamson;Everton, Clive (ed.), Snooker Scene, October 1986, p. 16. the 134 being the highest break of that year's entire event.Everton, Clive (ed.), Snooker Scene November 1986, p. 21; Spencer took an additional £875 prize money; the highest break in the main competition was just 116 by Cliff Thorburn. Spencer also made a break of 129 in defeating Terry Whitthread 5–2 in the Dulux British Open a month later. In the final stages of this event, Spencer defeated then World Champion Joe Johnson 5–3 en route to the quarter-final. This last-eight match against old friend Jimmy White saw Spencer compile a century and capture the sixth frame after needing six snookers (in a frame which took just 18 minutes to play). Spencer lost the match 3–5 but gained his highest ever snooker payday with a cheque for £9,000.Everton, Clive (ed.), Snooker Scene, May 1987, p. 11 Another late career highlight came when Spencer defeated old friend Fred Davis 5–0 in the 1988 British Open and followed this with a 5–0 televised win over Dennis Taylor on 27 February. Spencer lost just 4–5 in the fifth round to Rex Williams, who thus recorded his first ever tournament victory over Spencer.Everton, Clive (ed.), Snooker Scene, April 1988, pp.8 & 15.", "His last TV appearance as a player came in 1997 when he took part in Seniors Pot Black. Spencer later admitted that he was suffering from severe depression caused by his illness when he played this match. He generated applause with some of his shots during a frame against Dennis Taylor, which he lost 47–74. Despite matches only being a single frame, Spencer did not play in the Senior Masters Competition in June 2000, leaving a field of 15. This event was won by Willie Thorne.Everton, Clive (ed.), Snooker Scene, July 2000, pp. 24–25.", "|  Dennis Taylor", "|  Dennis Taylor", "|  Dennis Taylor"]}, {"page": "Cliff Thorburn", "response": ["At the 1973 World Snooker Championship, his first tournament on the professional snooker circuit, Thorburn defeated Dennis Taylor 9–8 in the first round then lost 15–16 to Williams in the second round. Later that year, he had a 4–0 win over Pat Houlihan at the 1973 Norwich Union Open before losing 2–4 to Higgins in the quarter-final. In the 1974 World Snooker Championship he defeated Alex McDonald 8–3 in qualifying then lost 4–8 to Paddy Morgan in the first round. He started the 1974–75 snooker season with a victory in the 1974 Canadian Open, knocking out Willie Thorne and Graham Miles to reach the final, where he won 8–6 against Taylor. He reached the quarter-finals of the 1975 World Snooker Championship with wins over Morgan and Miles, losing the quarter-final 12–19 to Eddie Charlton, and, the following year, was eliminated 14–15 by Higgins in the first round of the 1976 World Snooker Championship.", "He enjoyed a resurgence in form during the 1984–85 season. He reached the final of the Grand Prix, where he lost to Dennis Taylor 2–10. In the semi-final, Thorburn had defeated the reigning world champion Steve Davis 9–7. He also reached the final of the Classic in January 1985, where he met Thorne, with the latter winning five frames in a row to win 13–8 after the pair had been tied at 8–8. Thorburn was again runner-up in the 1986 Classic, this time losing to Jimmy White in the final 12–13. Thorburn fluked a pot on the  in the deciding frame, to leave White requiring  from Thorburn in order to win. White potted the brown and , then laid a snooker on the . Thorburn failed to hit the pink, which gave White the penalty points he needed, and White then potted the pink and black to win the title."]}, {"page": "Doug Mountjoy", "response": ["At the 1977 World Championship a couple of months later, he defeated Higgins again in the first round but lost to Dennis Taylor in the quarter-final 11–13. At the end of 1977, he reached the final of the first UK Snooker Championship, losing to Patsy Fagan 9–12. He won the title at the 1978 UK Championship, however, beating David Taylor 15–9, and he defeated Ray Reardon in the same season to win the Irish Masters 6–5. He won the 1980 Champion of Champions, with a 10–8 victory over John Virgo in the final. Mountjoy also won the 1978 Pot Black event.", "After being part of the winning Wales team in the first two snooker World Challenge Cups, in 1979 and 1980, and winning the 1980 Welsh Professional Championship he had an attack of Bell's palsy which partially paralysed his face. Recovering from the attack, he reached the final of the 1981 World Championship, defeating Eddie Charlton, Dennis Taylor and, in the semi-final, Ray Reardon (against whom he made a 145 break, a championship record at the time). He then played Steve Davis in the final. Davis was favourite to win his first world title, and appeared to be racing to an easy victory by winning the first six frames of the match. However, Mountjoy recovered and came close to drawing level on several occasions. Trailing 11–13, and with the score at 60–63 in the 25th frame, he looked certain to cut Davis's lead to one frame but missed a simple blue from its spot; Davis went on to clear the colours,  the final black. Mountjoy won only one more frame as Davis won the match 18–12."]}, {"page": "Willie Thorne", "response": ["He reached the quarter-finals of the World Snooker Championship in 1982 and 1986. Thorne won the 1986 Hong Kong Masters by 8–3 over Dennis Taylor in the final with century breaks of 102 and 106, and then defeated Davis 10–9 to claim the 1986 Matchroom Professional Championship.", "| Dennis Taylor", "| Dennis Taylor"]}, {"page": "List of snooker players", "response": ["*Dennis Taylor"]}, {"page": "World Open (snooker)", "response": ["The format was slightly tweaked for 2007, after complaints (notably from Dennis Taylor) that the system was too random. Matches increased in length from best-of-5 to best-of-7, to give the better player more chance to win. The main tie-breaker for players level on wins was changed, with frame difference now taking precedence over results between the players who are level on points. Notably, under the 2007 format, 2006 runner-up Jamie Cope would have been eliminated in the groups, as he defeated third-placed Michael Holt but had an inferior frame-difference.", "|  Dennis Taylor", "|  Dennis Taylor", "|  Dennis Taylor", "The 1985 final between Steve Davis and Dennis Taylor is the longest one-day final in snooker history. It lasted 10 hours and 21 minutes."]}, {"page": "Irish Masters", "response": ["|  Dennis Taylor"]}, {"page": "Scottish Open (snooker)", "response": ["Steve Davis was the tournament's most prolific winner, with a record 6 wins from 8 finals. This included a 9–0 whitewash of Dennis Taylor in the 1981 final. There have been seven maximum breaks in the history of the tournament, two at the 2000 event. Stephen Maguire at the first qualifying round against Phaitoon Phonbun, and Ronnie O'Sullivan in the last 32 against Quinten Hann. In 2012 Kurt Maflin achieved a 147 in the last 32 against Stuart Carrington. In 2017, eventual runner-up Cao Yupeng made a maximum break in his first round match against Andrew Higginson, and the following year, John Higgins compiled his ninth career 147 in his second round match against Gerard Greene. In 2020, Zhou Yuelong made a maximum break in his first round match with Peter Lines, and the tournament’s most recent maximum break was made in 2021 by Xiao Guodong in his qualifying match against Fraser Patrick."]}, {"page": "Classic (snooker)", "response": ["The tournament started as the Wilsons Classic in January 1980. It was an eight-man invitation event recorded by Granada Television. John Spencer defeated Alex Higgins 4–3 in the final to become the inaugural champion. The second event was held in December the same year, with Steve Davis defeating Dennis Taylor 4–1 in the final.", "|  Dennis Taylor"]}, {"page": "Australian Goldfields Open", "response": ["|  Dennis Taylor", "|  Dennis Taylor"]}, {"page": "Bargain Hunt", "response": ["| Dennis Taylor and Willie Thorne"]}]}}