{"wiki_id": "http://www.wikidata.org/entity/Q50405079", "itemLabel": "James Barnes-Miller", "itemDescription": "British snowboarder", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Barnes-Miller", "wikipedia_page": {"main": "James Barnes-Miller is a British snowboarder from Isle of Thanet. He competes in snowboarding events for athletes with upper limb disabilities after being born with an incomplete right arm.\nHe participated at the 2018 Winter Paralympics,He won the bronze medal in the men's dual banked slalom SB-UL event at the 2021 World Para Snow Sports Championships held in Lillehammer, Norway. Barnes-Miller and Ollie Hill also won the bronze medal in the men's team event.", "link_mentions": [{"page": "Great Britain at the 2018 Winter Paralympics", "response": ["|align=\"left\"|James Barnes-Miller", "|align=\"left\"|James Barnes-Miller"]}, {"page": "Owen Pick", "response": ["He represented Great Britain at the 2018 Winter Paralympics, competing in Banked Slalom and SBX events alongside Ben Moore and James Barnes-Miller. Snowboarding was first added to the Paralympics in Sochi 2014, with 2018 being the first time that Great Britain has been represented. Pick describes his pride for being selected: \"I feel honoured to be among the first British athletes competing in snowboard\", as well as describing himself as the \"least experienced snowboarder\" in his category. "]}, {"page": "Snowboarding at the 2018 Winter Paralympics – Men's snowboard cross", "response": ["|6|| 4 || align=\"left\" |James Barnes-Miller || align=\"left\" | ||1:03.11||1:06.56||1:03.11||Q"]}, {"page": "Ben Moore (snowboarder)", "response": ["Moore was a keen skateboarder before he had his accident. He qualified and started work as a snowboard instructor in Canada after being inspired to take up the sport during a holiday in Bulgaria. Moore missed the bus to work one day and, rather than waiting for the next one, decided to hitchhike instead. This led to a chance encounter with competitive snowboarders who gave him the idea of competing himself. Moore began competing and achieved success when he won bronze in the banked slalom SB-UL 2017 Para Snowboard World Championships in Big White Ski Resort, Canada. He is set to represent Great Britain at the 2018 Winter Paralympics, competing in Banked Slalom and SBX events alongside Owen Pick and James Barnes-Miller. Snowboarding was first added to the Paralympics in Sochi 2014, with 2018 being the first time that Great Britain has been represented and the first time that upper limb category has been added to the events."]}, {"page": "Snowboarding at the 2018 Winter Paralympics – Men's banked slalom", "response": ["|10|| 1 || align=\"left\" |James Barnes-Miller || align=\"left\" | ||58.23||57.00||||57.00"]}, {"page": "Barnes-Miller, James", "response": ["#redirectJames Barnes-Miller"]}, {"page": "2021 World Para Snow Sports Championships", "response": ["|Ollie HillJames Barnes-Miller"]}]}}