{"wiki_id": "http://www.wikidata.org/entity/Q504314", "itemLabel": "Andrew Claude de la Cherois Crommelin", "itemDescription": "Irish/British astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Claude_de_la_Cherois_Crommelin", "wikipedia_page": {"main": "Andrew Claude de la Cherois Crommelin (6 February 1865 – 20 September 1939) was an astronomer of French and Huguenot descent who was born in Cushendun, County Antrim, Ireland.\nHe was educated in England at Marlborough College and Trinity College, Cambridge. After a spell teaching at Lancing College he found permanent employment at the Royal Greenwich Observatory in 1891. He joined the Royal Astronomical Society in 1888 and was its president from 1929-1931. In 1895 he joined the British Astronomical Association and was president from 1904-1906 and directed its comet section 1898-1901 and 1907-1938.In 1910 for their studies of Halley’s Comet Crommelin and Philip Herbert Cowell jointly received the Prix Jules Janssen from the Société astronomique de France. For this work they also received the Lindemann prize of the Astronomische Gesellschaft in Germany.In 1914 Crommelin published an introductory book on astronomy “The Star World”.Crommelin had four children, of whom two died in a climbing accident on Pillar Rock, Ennerdale, in 1933. The de la Cherois line was succeeded through Crommelin's daughter Andrina. The author May Crommelin was one of Andrews cousins.\n\nAn expert on comets, his calculation of orbits of previously identified Comet Pons 1818 II, Comet Coggia-Winnecke 1873 VII, and Comet Forbes 1928 III in 1929, showed that these were one and the same periodic comet. It thus received the rather unwieldy name \"Comet Pons-Coggia-Winnecke-Forbes\".  In 1948, he was posthumously honored when the comet was renamed after him alone (today, in modern nomenclature, it is designated 27P/Crommelin). This is similar to the case of Comet Encke, where the periodic comet is named after the person who determined the orbit rather than the possibly-multiple discoverers and re-discoverers at each apparition. In 1937 Crommelin and Mary Proctor jointly published a book entitled \"Comets: Their Nature, Origin, and Place in the Science of Astronomy”.Crommelin took part in several solar eclipse expeditions including those of 1896, 1900 and 1905. In 1919 he went to Sobral, in Brazil, and measured the amount of deflection of light caused by the gravitational field of the Sun. The results from these observations were crucial in providing confirmation of the General Theory of Relativity, which Albert Einstein had proposed in 1916.\n\n", "link_mentions": [{"page": "May 29", "response": ["*1919 – Albert Einstein's theory of general relativity is tested (later confirmed) by Arthur Eddington and Andrew Claude de la Cherois Crommelin."]}, {"page": "1939", "response": ["** Andrew Claude de la Cherois Crommelin, French astronomer (b. 1865)"]}, {"page": "List of astronomers", "response": ["| Andrew Claude de la Cherois Crommelin || UK || 1865 || 1939", "*Andrew Claude de la Cherois Crommelin (UK, 1865–1939)"]}, {"page": "Inex", "response": ["* Andrew Claude de la Cherois Crommelin (1901), \"The 29-Year Eclipse-Cycle\", The Observatory, 24 (1901), 379–382 online link."]}, {"page": "Andrew Crommelin", "response": ["#REDIRECT Andrew Claude de la Cherois Crommelin"]}, {"page": "1939 in Ireland", "response": ["* 20 September – Andrew Claude de la Cherois Crommelin, astronomer (born 1865)."]}, {"page": "Crommelin, Andrew Claude de la Cherois", "response": ["#redirectAndrew Claude de la Cherois Crommelin"]}, {"page": "Andrew C. Crommelin", "response": ["#REDIRECT Andrew Claude de la Cherois Crommelin"]}, {"page": "May Crommelin", "response": ["While growing up, she and her family often lived elsewhere because of the political situation at home, and Crommelin was educated by governesses. The family moved to England in the 1880s and after the death of her traditionalist father in 1885 she lived independently in her own flat in London. Though her family were \"French gentry\"- the Crommelins being in possession of considerable property at Armandcourt in Picardy and created Seigneurs de Camas- and descended from the Huguenot linen merchant Louis Crommelin, they were not at all wealthy, and Crommelin earned a living by writing. One of her cousins was the astronomer Andrew Claude de la Cherois Crommelin."]}, {"page": "Crommelin", "response": ["* Andrew Claude de la Cherois Crommelin (1865–1939), British astronomer"]}, {"page": "1939 in Northern Ireland", "response": ["*20 September – Andrew Claude de la Cherois Crommelin, astronomer (born 1865)"]}, {"page": "1865 in Ireland", "response": ["*6 February – Andrew Claude de la Cherois Crommelin, astronomer (died 1939)."]}, {"page": "A. C. D. Crommelin", "response": ["#REDIRECT Andrew Claude de la Cherois Crommelin"]}, {"page": "Andrew claude de la cherois crommelin", "response": ["#REDIRECT Andrew Claude de la Cherois Crommelin "]}, {"page": "Solar eclipse of May 29, 1919", "response": ["Albert Einstein's prediction of the bending of light by the gravity of the Sun, one of the components of his general theory of relativity, can be tested during a solar eclipse, when stars with apparent position near the sun become visible. Following an unsuccessful attempt to validate this prediction during the Solar eclipse of June 8, 1918,Ethan Siegel, \"America's Previous Coast-To-Coast Eclipse Almost Proved Einstein Right\", Forbes, Aug 4, 2017. Retrieved August 4, 2017. two expeditions were made to measure positions of stars during this eclipse (see Eddington experiment). They were organized under the direction of Sir Frank Watson Dyson. The first was led by Sir Arthur Eddington to the island of Príncipe (off the west coast of Africa), the second by Andrew Claude de la Cherois Crommelin and Charles Rundle Davidson to Sobral in Brazil.”Eclipse 1919”,  Web site commemorating the 1919 Solar Eclipse expedition, 2019. Retrieved December 10, 2021.  The stars that both expeditions observed were in the constellation Taurus."]}, {"page": "Meanings of minor-planet names: 1001–2000", "response": ["| 1899 Crommelin ||  || Andrew Claude de la Cherois Crommelin (1865–1939), British astronomer || "]}]}}