{"wiki_id": "http://www.wikidata.org/entity/Q5047616", "itemLabel": "Cary Cooper", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Cary_Cooper", "wikipedia_page": {"main": "Sir Cary Lynn Cooper  (born 28 April 1940), is an American-born British psychologist and 50th Anniversary Professor of Organizational Psychology and Health at the Manchester Business School, University of Manchester.\nBefore moving to Manchester he was Distinguished Professor at Lancaster University. Cooper was Head of the Manchester School of Management (within UMIST) from the early 1980s. In 1995 he became Pro-Vice-Chancellor and then Deputy Vice-Chancellor of UMIST until 2002. From 1979 to 1980 he was chairman of the Management Education and Development Division of the Academy of Management and was elected as Founding President of the British Academy of Management. In June 2005 he was appointed head of the Sunningdale Institute, which, managed by the United Kingdom National School of Government, brings international academics and industry figures together to advise on issues facing UK public sector organisations. He was Chair of the Academy of Social Sciences, a body representing over 88,000 social scientists and 46 learned societies in the social sciences (including the Royal Geographical Society, British Psychological Society, the Political Studies Association, and the Royal Statistical Society).  In 2010 he was Chair of the Chronic Diseases and Mental Health Global Agenda Council of the World Economic Forum. He is immediate past President of Relate, Clinical Advisor to Anxiety UK, President of the Institute of Welfare, President of the Chartered Institute of Personnel and Development 2016-, Co-Chair of the National Forum for Health & Wellbeing at Work (2016-) and past President of the British Association for Counselling and Psychotherapy. Cooper is also a director of well-being specialists and business psychologists at Robertson Cooper Limited, a university spin off company which he set up in 1999 with Ivan Robertson. He was the founding editor-in-chief of the Journal of Organizational Behavior.\nCooper's parents were Jews from Romania and Ukraine who settled in West Hollywood. He became a British citizen in 1993.\n\n", "link_mentions": [{"page": "List of psychologists", "response": ["* Cary Cooper"]}, {"page": "List of business theorists", "response": ["* Cary Cooper"]}, {"page": "Tau Epsilon Phi", "response": ["*Sir Cary Cooper CBE - Professor and renowned British psychologist, President of the British Academy of Management, President of Chartered Institute of Personnel and Development"]}, {"page": "Fairfax High School (Los Angeles)", "response": ["* Cary Cooper, psychologist"]}, {"page": "BBC Breakfast", "response": ["* Cary Cooper (psychologist)"]}, {"page": "Cooper (surname)", "response": ["*Cary Cooper (born 1940), American-born British psychologist"]}, {"page": "British Association for Counselling and Psychotherapy", "response": ["*Cary Cooper, CBE, Psychologist, Honorary BACP President 1976–1979"]}, {"page": "Professor Cary Cooper CBE", "response": ["#REDIRECT Cary Cooper"]}, {"page": "Relate Institute", "response": ["In February 2007, the Rt Hon Alan Johnson MP, Secretary of State for Education and Skills, delivered the inaugural lecture of the Relate Institute. Since then, the lecture has been delivered by the Rt Hon David Cameron MP, the Rt Hon Nick Clegg MP, and Professor Cary Cooper of Lancaster University."]}, {"page": "Premiership of Gordon Brown", "response": ["In February 2010 Christine Pratt, founder of the National Bullying Helpline said that the helpline had taken calls from Downing Street staff, although she later stated that the calls did not refer to Brown himself. This led to the resignations of three of the charity's patrons; Cary Cooper, Ann Widdecombe and Sarah Cawood. The Charity Commission later said that it had received over 160 complaints about the helpline's handling of the situation. The helpline service was voluntarily suspended; it resumed two days later."]}, {"page": "Journal of Organizational Behavior", "response": ["The Journal of Organizational Behavior is a peer-reviewed academic journal published eight times a year by Wiley-Blackwell. The journal publishes empirical reports and theoretical reviews spanning the spectrum of organizational behavior research. It was established in 1980 as the Journal of Occupational Behavior, obtaining its current title in 1988. The founding editor-in-chief was Cary Cooper (Manchester Business School), who was succeeded by Neal Ashkanasy (UQ Business School). The current editor-in-chief is Suzanne S. Masterson (University of Cincinnati)."]}, {"page": "International Journal of Management Reviews", "response": ["The International Journal of Management Reviews is a quarterly peer-reviewed academic journal, established by Cary Cooper in 1999, and published by Wiley-Blackwell on behalf of the British Academy of Management.British Academy of Management Website Accessed 9 February 2021 It is the leading global review journal in organisation and management studies. The current editors are Dermot Breslin (ESC Rennes School of Business), Jamie Callahan (Durham University) and Marian Iszatt-White (Lancaster University).  "]}, {"page": "Cary Lynn Cooper", "response": ["#redirectCary Cooper"]}, {"page": "British Academy of Management", "response": ["The British Academy of Management was founded in 1986, exactly 50 years after the AoM was formed in Chicago. Professor Sir Cary Cooper CBE was its first President and Andrew Pettigrew was its first chairman. During the AoM conference in San Diego in 1985 they realize the lack of a multidisciplinary association in the UK and decided to establish BAM.", "BAM's founders wanted to start publishing a journal. Cary Cooper managed one of the AoM divisions that had its own journal and he suggested that BAM should do the same.  Cooper coordinated a small group from Council who interviewed a number of  publishing companies for a five-year contract, John Wiley won the first contract. The British Journal of Management (BJM) was launched in early 1990 and had 4 issues a year running into 64 pages. The General Editor was David Otley and the Associate Editors were John Burgoyne, John McGee, Roy Payne, Nigel Piercy and Roy Rothwell. BJM purpose was to receive articles from a full range of business and management disciplines and to have a multi and inter disciplinary orientation.", "The success of the British Journal of Management (BJM) was joined by BAM's acquisition of the International Journal of Management Reviews (IJMR). Cary Cooper and Alan Pearson had been the first editors."]}, {"page": "2014 Birthday Honours", "response": ["* Professor Cary Cooper,  – Distinguished Professor of Organisational Psychology and Health, Lancaster University"]}, {"page": "Snowflake (slang)", "response": ["In 2017, a U.S. marketing company created a \"snowflake test\" to be used in its hiring process to \"weed out overly sensitive, liberal candidates who are too easily offended\".  Many questions were designed to assess a candidate's stance on America, police, and guns. However, psychologist and academic from the Manchester Business School at the University of Manchester, Cary Cooper suggests it is a poor strategy for attracting talented younger workers."]}, {"page": "LID Publishing", "response": ["LID's series of short business books named \"The Concise Advice Series\" has featured authors including psychologist Sir Cary Cooper and Sanyin Siang."]}]}}