{"wiki_id": "http://www.wikidata.org/entity/Q5044248", "itemLabel": "Carol Barnes", "itemDescription": "British newsreader", "wikipedia_url": "https://en.wikipedia.org/wiki/Carol_Barnes", "wikipedia_page": {"main": "Carol Lesley Barnes (13 September 1944 – 8 March 2008) was a British television newsreader and broadcaster. She worked for ITN from 1975 to 2004.", "link_mentions": [{"page": "September 13", "response": ["*1944 – Carol Barnes, English journalist (d. 2008)"]}, {"page": "1944", "response": ["** Carol Barnes, British newsreader (d. 2008)"]}, {"page": "Channel 4 News", "response": ["*Carol Barnes (1984–92)"]}, {"page": "Denis MacShane", "response": ["From 1975 to 1981 MacShane had a relationship with broadcaster Carol Barnes. Their daughter, Clare Barnes, died in March 2004 after her parachute failed to open on her 200th skydiving jump in Australia. MacShane married Liliana Kłaptoć, originally from Poland, in 1983, but the relationship lasted only a few years. In 1987, he married Nathalie Pham, an interpreter of French-Vietnamese origin; they have a son and three daughters. They divorced in 2003. His relationship with writer Joan Smith ended in 2010 after seven years. In 2012, he began a relationship with the economist Vicky Pryce, who had been married to the former Energy Secretary Chris Huhne.Friends of Vicky Price fear for her health, standard.co.uk; accessed 25 February 2015."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Carol Barnes and Phil Tufnell"]}, {"page": "Dermot Murnaghan", "response": ["Murnaghan presented the European Business Channel in Switzerland before being recalled by ITN to present the World News on The Channel 4 Daily between 1991 and 1992 after the departure of original anchor Carol Barnes."]}, {"page": "ITV News", "response": ["News at 545 was replaced by the News at 540 in 1989 (following the introduction of the ITV National Weather forecast), and a new presenting team was formed comprising Carol Barnes, Nicholas Owen, Trevor McDonald, Fiona Armstrong, and Alastair Stewart. The programme lasted until March 1992 when it was renamed and relaunched, in line with other ITN bulletins.", "ITN's regular newscasting team in the 1980s included Alastair Burnet, Sandy Gall, Leonard Parkin, Alastair Stewart, Trevor McDonald, Julia Somerville, Carol Barnes, Fiona Armstrong, John Suchet, Nicholas Owen, and a host of well-known reporters and correspondents.", "In 1991, ITN moved into its new building at Gray's Inn Road, London (previously owned by The Sunday Times). From this year, ITN news programmes revamped and moved to be presented from the ITV newsroom, foremostly to show the impressive atrium in the newly purchased headquarters – with the exception of the lunchtime programme which continued with its own studio and music, but took on elements of the new revamp – such as the serif font style newly introduced for ITN bulletins. The News at 12:30 bulletin itself was renamed the Lunchtime News in 1992. The main lunchtime newscasters between 1992 and 1995 were Nicholas Owen and Carol Barnes. Dermot Murnaghan, Sonia Ruseler and Julia Somerville acted as relief newscasters until 1995, when Murnaghan and Somerville became the bulletin's regular newscasters.", "News at 540 was renamed the Early Evening News on 2 March 1992 and presented from the ITV newsroom adjacent to the ITN atrium. John Suchet was the main newscaster for the Early Evening News, and relief presenters included Carol Barnes, Nicholas Owen and Dermot Murnaghan.", "With the outbreak of warfare in Iraq in 2003, ITV replaced the ITV News at Ten with a special 45-minute-long ITV News at Nine every Monday to Friday, hosted by Trevor McDonald in Kuwait City and John Suchet in the ITV News studio in London. The News at Nine proved to be very popular, reaching 9.1 million viewers on the first night in comparison to the 5 to 6 million for the BBC's late evening news. The ITV Evening News was extended to 60 minutes, and various ITV news specials ran throughout the schedules. A simulcast of the ITV News Channel aired from 00:00 to 05:30 every night on ITV1. ITN also managed to persuade big name newscasters to return to the organisation to present the special war coverage on ITV: Alastair Stewart, Carol Barnes, Angela Rippon, Jon Nicholson and Anne Leuchars were all back presenting news bulletins and regular slots on the ITV News Channel."]}, {"page": "ITV News at Ten", "response": ["*Carol Barnes (1985–1992)"]}, {"page": "ITV Evening News", "response": ["Alastair Burnet was the original presenter of the News at 545. Michael Nicholson fronted the bulletin on Fridays, and was also a relief presenter. Immediately after the animated visual 'roll' and electronic theme music at the beginning, an announcer intoned in a hushed tone: \"The news at 5:45, with Alastair Burnett/Michael Nicholson\". Other relief presenters in the late 1970s included Leonard Parkin, who at the time also regularly hosted the News at One, and Martyn Lewis. In March 1980, when Burnet departed the 545 to present News at Ten, Nicholson replaced him as lead presenter, with Carol Barnes taking over as relief presenter. In September 1986, Nicholson left the 545 to return to war reporting, and was replaced by Alastair Stewart.", "On 4 April 1988 the News at 545 underwent some cosmetic changes, with the animated visual 'roll' logo and electronic theme music being dropped in favour of a new computer-generated opening sequence and a more contemporary theme tune; the studio images were still inlaid using chromakey, although these were now also generated by computer. The programme was moved to the main newsroom within the ITN headquarters building, and full-length reports were now featured as part of the programme. ITN dispensed with the \"main\" presenter and relief host format, and instead a \"team\" of newscasters - Alastair Stewart, Fiona Armstrong, Nicholas Owen, Trevor McDonald, Sue Carpenter and Carol Barnes - began presenting the show on a \"rotation\" basis. On 13 February 1989, the introduction of a national weather forecast at the end of the programme led to the bulletin's timeslot starting earlier at 5:40pm, being extended in length and the title being changed to News at 540.", "*Carol Barnes (1982–1994)"]}, {"page": "ITV Lunchtime News", "response": ["On 2 March 1992, News at 12:30 was relaunched as the Lunchtime News with a dual-presenting team comprising Nicholas Owen and Carol Barnes. On 6 March 1995, ITN's news bulletins were relaunched with a cohesive identity. The Lunchtime News on air team was revamped, this time with a returning Julia Somerville alongside Dermot Murnaghan. Owen and Barnes remained as relief presenters."]}, {"page": "Ed Mitchell", "response": ["In January 2008, an ITV documentary, Saving Ed Mitchell, was shown about his struggle with huge credit card debts, alcoholism and homelessness. The end of the documentary, presented by his ITN colleague Carol Barnes, showed him being given an opportunity to return to presenting if he attended the Priory clinic for rehabilitation. He has successfully continued to abstain from drinking since then. He is the author of the best-selling book, From Headlines to Hard Times, which was published by Blake Publishing in January 2009. He made enough money from the book's sales to eventually move into a flat in Shoreham-by-Sea. A revised and updated paperback was published in 2010.Anguish of an alcoholic ex-ITN reporter  The Guardian. 18 January 2008"]}, {"page": "List of people from Sheffield", "response": ["*Carol Barnes, newsreader"]}, {"page": "Nicholas Owen (journalist)", "response": ["Owen moved to ITN in 1984, as Channel 4 News' Business and Economics Correspondent. During the First Gulf War he presented the highly acclaimed Midnight Special Programmes when they were launched on Channel 4. He also anchored The Parliament Programme, Channel 4's first daytime political series. Between 1991 and 1994, he co-presented the ITN-produced ITV Lunchtime News with Carol Barnes."]}, {"page": "Affairs of the Heart (TV series)", "response": ["*Carol Barnes - Herself"]}, {"page": "List of people from Brighton and Hove", "response": ["|Commemorated by Brighton & Hove Bus Company bus number 701 and by The Argus newspaper's Carol Barnes Courageous Child of the Year Award "]}, {"page": "ITV Weekend News", "response": ["*Carol Barnes (1975–2004)"]}, {"page": "ITN World News", "response": ["*Carol Barnes – Special Presenter [Gulf War Coverage], 1991"]}, {"page": "St Martin-in-the-Fields High School for Girls", "response": ["* Carol Barnes"]}, {"page": "Barnes (name)", "response": ["*Carol Barnes (1944–2008), British newsreader"]}, {"page": "2008 in British television", "response": ["|Carol Barnes"]}, {"page": "The Channel Four Daily", "response": ["*Carol Barnes (1989–1991)"]}, {"page": "2008 in the United Kingdom", "response": ["* 8 March – Carol Barnes, newsreader (born 1944)"]}, {"page": "Deaths in March 2008", "response": ["*Carol Barnes, 63, British ITN news presenter, stroke."]}, {"page": "September 1944", "response": ["*Born: Carol Barnes, television newsreader and broadcaster, in Norwich, England (d. 2008); Jacqueline Bisset, actress, in Weybridge, Surrey, England; Peter Cetera, singer, songwriter, bassist and original member of rock band Chicago, in Chicago, Illinois"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Carol Barnes – worked for ITN, 1975–2004, as both reporter and newscaster; died in March 2008"]}, {"page": "1944 in British television", "response": ["** Carol Barnes, journalist (died 2008)"]}, {"page": "List of ITV News on air staff", "response": ["*Carol Barnes (1980–1999, 2003-2004)"]}, {"page": "Sarah Cullen", "response": ["After being sent for a brief period at the Liverpool Daily Post, she worked as a scriptwriter and desk editor for the broadcaster, before auditioning as an on-screen reporter. She was one of ITN's first female reporters along with Carol Barnes, Joan Thirkettle and Sue Lloyd-Roberts, and was appointed their Home Affairs Correspondent in 1983. On one occasion, her reporting was teased in a review for The Observer by Clive James: \"'Each school will have to raise the cost of their computer,' announced Sarah Cullen on News at Ten ... Each channel will have to clean up their grammar: this is getting ridiculous.\"The Observer, 12 April 1981: see Clive James (1983) Glued to the Box"]}, {"page": "Joan Thirkettle", "response": ["Thirkettle began her career in journalism as a trainee researcher with Associated Rediffusion in 1965 and as a researcher for Radio Caroline, before moving into print journalism, first joining the Daily Mail and later working for the Sunday Times as property correspondent and a business writer in 1969. She moved to radio in 1970, reporting for the BBC and the British Forces Broadcasting Service, and in 1973 was one of the founding members of London's news station London Broadcasting Company (LBC). She joined ITN the following year and quickly became a familiar presence on television screens. Along with Carol Barnes, Sarah Cullen and Sue Lloyd-Roberts, Thirkettle was one of the first female reporters to be seen on the broadcaster. Along with Barnes, Thirkettle was recruited by editor Nigel Ryan and the two were later known as \"Ryan’s Daughters\"."]}, {"page": "Carol A. Barnes", "response": ["To study spatial learning and memory, Carol Barnes utilized a maze to test whether mice could remember the location of an escape box on a platform. The Barnes Maze has become a standard tool of memory testing in laboratories. Designed in 1979, Barnes's maze was an alternative to study memory without the use of external reward or punishment, while also reducing the stress put on the animal throughout the process."]}, {"page": "2008 in Europe", "response": ["*8 March – Carol Barnes, British newsreader"]}, {"page": "List of University of Sheffield people", "response": ["* Carol Barnes, ITN Newsreader"]}, {"page": "Cyriel Pennartz", "response": ["He uncovered replay of reward information in the ventral striatum during sleep, using in vivo ensemble recordings made with tetrode arrays, a technique he introduced to the Netherlands in collaboration with Bruce McNaughton and Carol Barnes at the University of Arizona (Tucson, U.S.A.)"]}, {"page": "List of people from Norwich", "response": ["*Carol Barnes (1944–2008), journalist and broadcaster, born in Norwich"]}]}}