{"wiki_id": "http://www.wikidata.org/entity/Q5040391", "itemLabel": "Carl Johanneson", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Carl_Johanneson", "wikipedia_page": {"main": "Carl Johanneson (born 1 August 1978) is a British former professional boxer. He held the British super featherweight title from 2006 to 2008. His nickname, \"Ingemar\" is a nod to the famous Swedish boxer Ingemar Johansson and is the nephew of former Leeds United player Albert Johanneson.  He served for four years in the Duke of Wellington's Regiment of the British Army.", "link_mentions": [{"page": "Albert Johanneson", "response": ["In 1963 Johanneson married Norma Comrie, a pharmacist originally from Jamaica. Together they had two children: Yvonne and Alicia. The couple's marriage lasted 11 years, ending in divorce. Albert was dogged by problems with alcohol and ill health before his death in 1995. His body lay undiscovered for a week in his flat in Gledhow Towers, North Leeds. Albert's nephew Carl Johanneson is a former Leeds super featherweight boxer."]}, {"page": "Lonsdale Belt", "response": ["! scope=\"row\" |  Carl Johanneson"]}, {"page": "List of people from Leeds", "response": ["* Carl Johanneson - Super-Featherweight boxer and ranked number 2 in Europe in his weight class"]}, {"page": "Kevin Mitchell (boxer)", "response": ["Further success followed on 28 October 2006, when Mitchell defeated George Ashie by twelve-round unanimous decision to win the vacant Commonwealth super-featherweight title.\"Mitchell battles to Ashie victory\" BBC Sport. BBC. 28 October 2006. Retrieved 14 January 2016. Two defences of this title came against Harry Ramogoadi on 10 March 2007 (sixth-round TKO)\"Win rewards Mitchell's patience\". BBC Sport. BBC. 9 March 2007. Retrieved 14 January 2016. and Carl Johanneson on 8 March 2008 (ninth-round TKO). In the Johanneson fight, Mitchell also won the British super-featherweight title, but it would be prove to a very tough outing for him, as Johanneson had managed to draw level on the judges' scorecards by the time of the stoppage.\"Mitchell delivers KO blow\". Sky Sports. Sky. Retrieved 14 January 2016.", "|style=\"text-align:left;\"| Carl Johanneson"]}, {"page": "Martin Lindsay (boxer)", "response": ["Lindsay turned professional in December 2004 in Crystal Palace, London on an undercard of bill that included Carl Johanneson and Leva Kirakosyan. In his debut Lindsay defeated previously unbeaten Welshman Dai Davies with a first round knockout."]}, {"page": "Michael Gomez", "response": ["Gomez found himself once again drawn to boxing after watching a fight between Alex Arthur and Carl Johanneson, and resumed training. In May 2007, fifteen months after his fight with McDonagh, he returned to the ring to face Daniel Thorpe at the Altrincham Leisure Centre, Manchester.", "Gomez had left the Phoenix Gym and was now training at Bobby Rimmers' Boxing Academy in Stalybridge, Manchester, and had returned to fight in the super featherweight division. The fight was billed as \"The Last Stand\", and the venue was sold out with fellow fighters Ricky Hatton and his brother Matthew Hatton cheering him on from ringside. Gomez won the fight with a stoppage in the third round. The following month Gomez also beat Youssef Al Hamidi, again with a third round stoppage. Following two comeback fights against journeyman opposition Gomez was rumoured to be in line for fights against many of Britain and Ireland's top level super featherweights and lightweights including Kevin Mitchell, Amir Khan, and Carl Johanneson; Gomez himself was seeking a rematch against Peter McDonagh.", "|style=\"text-align:left;\"|Carl Johanneson"]}, {"page": "Ricky Burns", "response": ["Burns next had a crack at the British title almost exactly a year later when in February 2007, he met reigning champion Carl Johanneson at the Town Hall in Leeds. The fight ended once again in defeat with Burns losing a 12-round decision to the experienced champion. Johanneson intent on winning well before his home crowd hounded Burns throughout the fight and managed to knock Burns down three times.", "|style=\"text-align:left;\"| Carl Johanneson"]}, {"page": "Scott Lawton (boxer)", "response": ["Following the Murray defeat, Lawton took the decision to move down a weight division to super featherweight.  His first fight at the weight saw him return to Stoke-on-Trent to fight on the Hatton Promotions card held in the city. His first opponent was a man moving up in weight, the former WBU champion Derry Mathews. Lawton won the fight via stoppage in the sixth round and afterwards claimed it was the \"biggest fight of his career\".BBC Sport | I can mix with the best - Lawton  The win paved the way for a crack at the vacant super featherweight European title against former holder French based Armenian Leva Kirakosyan.  Kirakosyan, whose last visit to the UK saw him defeat the then British champion Carl Johanneson, held the title in 2007 only to lose it to Belarusian Sergey Gulyakevich.  The fight on 19 February 2010 topped the bill of a Hatton Promotions bill in Stoke ended in a third round defeat for Lawton with the Armenian putting him down in the first minute and causing him to have a standing count in the second."]}, {"page": "Johanneson", "response": ["*Carl Johanneson (born 1978), super featherweight boxer"]}, {"page": "Gary Sykes", "response": ["On 5 March 2011 Sykes returned to the ring for the second defence of his British title against former champion Carl Johanneson of Leeds, the mandatory challenger for the title.Dewsbury reporter | Sykes in peak condition for british title defence. Examiner.co.uk (2011-03-04). Retrieved on 2012-11-19.  The fight, at the Huddersfield Sports Centre, resulted in a close points victory for Sykes after suffering a knockdown in the 9th round, eventually running out a 116–112, 115–112 and 115–113 winner.  After the fight Sykes paid tribute to former champion Johanneson saying \"To beat him means the world to me...when I first sparred with him I never thought I could last 12 rounds let alone beat him.\"Sykes shows his steel. Sky Sports (2011-03-08). Retrieved on 2012-11-19.  For his third defence Sykes faced Gary Buckland with the two meeting on 24 September 2011.  In a close back and forth contest Sykes lost the title to Buckland with the Welshman being awarded the decision over 12 rounds resulting in a second career defeat for Sykes.Wales Online | Gary Buckland dethrones Gary Sykes to win British title. Walesonline.co.uk (2011-09-25). Retrieved on 2012-11-19.", "|style=\"text-align:left;\"| Carl Johanneson"]}, {"page": "Stephen Foster (boxer)", "response": ["Only one fight in the next two years on 31 October 2008, resulted in Foster scoring a win over the journeyman Jason Nesbitt before returning to the ring on 15 January 2010 to defeat the Georgian boxer Kakhaber Avetisian at the Altrincham Leisure Centre. Two more wins in 2010 followed against Youssef Al Hamidi at the Fenton Manor Sports Complex in Stoke-on-Trent and Aleksander Vakhtangashvili at the Ponds Forge Arena in Sheffield, before on 2 October 2010 travelling to Bolton to fight at the De Vere Whites Hotel in a contest for the European super featherweight title. Foster's opponent, the Russian Levan Kirakosyan, had a reputation for winning in the UK and had already beaten the Carl Johanneson twice and on his last visit won the title against Scott Lawton.Boxrec | Levan Kirakosyan professional record Signalling his return to the top of British boxing Foster defeated Kirakosyan with a third round stoppage to lift the title.Eastside boxing | Stephen Foster halts Kirakosyan in 3rd round"]}, {"page": "Jason McCalmon", "response": ["His third fight was against the experienced Dean Walker on the Gary Sykes vs Carl Johanneson undercard. Jason McCalmon battered Sheffield’s Dean Walker over four rounds, decking the experienced man twice on his way to a comfortable 40-34 victory. Dean Walker went down in the third round from a right to the temple and went down again in the fourth and final round."]}, {"page": "List of British super-featherweight boxing champions", "response": ["|align=left | Carl Johanneson"]}]}}