{"wiki_id": "http://www.wikidata.org/entity/Q5040568", "itemLabel": "Carl Motteram", "itemDescription": "English footballer (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carl_Motteram", "wikipedia_page": {"main": "Carl Motteram (born 3 September 1984) is an English professional footballer who plays as a midfielder for South Molton F.C. in the North Devon Premier League.\nMoterram was born in Birmingham and joined Birmingham City as a 12-year-old. He progressed through the youth and trainee sides and turned professional in August 2003. He made the substitutes' bench for the trip to Tottenham Hotspur on 7 January 2004, but that was the closest he got to playing for Birmingham's first team.\nHe joined Conference club Tamworth on loan in November 2005 where he played for them against Hartlepool United on their FA Cup run. He then moved on to Torquay United on a free transfer in July 2006.He made his Torquay debut in the League Cup defeat at home to Norwich City on 23 August 2006, coming on as a late substitute for Chris McPhee. He struggled to establish himself at Torquay, finding himself even further away from the starting line-up once Ian Atkins, who had signed him, was replaced by new manager Lubos Kubik. In December 2006 he was given a one-month extension to his contract, but on 22 January 2007 it was announced that he would be released at the end of the month.He signed for Moor Green of the Conference North in February 2007. Moor Green merged with Solihull Borough in the summer of 2007 and Motteram was retained by the newly formed Solihull Moors.", "link_mentions": [{"page": "2003–04 Birmingham City F.C. season", "response": ["!scope=\"row\"| Carl Motteram"]}, {"page": "2005–06 Birmingham City F.C. season", "response": ["| 30 June 2006 || Carl Motteram || Released || (Torquay United)", "| Carl Motteram || Tamworth || 2 January 2006", "!scope=\"row\"| Carl Motteram"]}, {"page": "2004–05 Birmingham City F.C. season", "response": ["!scope=\"row\"| Carl Motteram"]}, {"page": "Motteram", "response": ["*Carl Motteram (born 1984), English footballer"]}]}}