{"wiki_id": "http://www.wikidata.org/entity/Q504800", "itemLabel": "Andrew Fuller", "itemDescription": "English Baptist minister and controversialist", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Fuller", "wikipedia_page": {"main": "Andrew Fuller (6 February 1754 – 7 May 1815) was an English Particular Baptist minister and theologian. Known as a promoter of missionary work, he also took part in theological controversy.", "link_mentions": [{"page": "1754", "response": ["* February 6 – Andrew Fuller, Particular Baptist Theologian and minister (d. 1815)"]}, {"page": "Regent's Park College, Oxford", "response": ["Helwys Hall, known affectionately by some in the undergraduate community as 'Hell Hall' or, more rarely, 'Hell Hole', is an imposing room with a very high ceiling clad in Canadian pine. Above the High Table there is a symbolic representation of the main emphases of Baptist life and faith designed by H. Wheeler Robinson (principal 1920–1942). Helwys Hall is home to a series of portraits which, taken together, present a brief history of the college. Most of the former principals' portraits are displayed including a recent portrait of Professor Paul Fiddes. There are also portraits of Joshua Marshman, Hannah Marshman, William Carey, and Willam Ward who were all missionaries to India and Andrew Fuller who was a missionary and first secretary of the Baptist Missionary Society. Helwys Hall was completely renovated in 2009 with a gift to the college's Annual Fund from an anonymous donor."]}, {"page": "Reformed Baptists", "response": ["Reformed Baptist churches in the UK go back to the 1630s. Notable early pastors include the author John Bunyan (1628–88), Benjamin Keach (1640–1704), the theologian John Gill (1697–1771), John Brine (1703–64), Andrew Fuller, and the missionary William Carey (1761–1834). Charles Spurgeon (1834–92), pastor to the New Park Street Chapel (later the Metropolitan Tabernacle) in London, has been called \"by far the most famous and influential preacher the Baptists had.\" The Metropolitan Tabernacle itself has been particularly influential in the Reformed Baptist movement in the UK. Benjamin Keach, John Gill, John Rippon (1751–1836), Charles Spurgeon, and Peter Masters (mentioned below) have all pastored this same congregation. Their characteristic traits may be the founder (Keach, signer of the 1689), theologian (Gill), hymnist (Rippon), preacher (Spurgeon), and restorer (Masters)."]}, {"page": "Kettering", "response": ["William Carey, born in 1761 at Paulerspury, spent his early life in Kettering before leaving for India as a missionary in 1793. Carey Mission House and Carey Street were named after him. Andrew Fuller helped Carey found the Baptist Missionary Society and he is remembered in the Fuller Church and Fuller Street. In 1803 William Knibb was born in Market Street and became a missionary and emancipator of slaves; he is commemorated by the Knibb Centre and Knibb Street. Toller Chapel and Toller Place take their names from two ministers, father and son, who preached in Kettering for a total of 100 years. The chapel was built in 1723 for those who since 1662 had been worshipping in secret."]}]}}