{"wiki_id": "http://www.wikidata.org/entity/Q5040563", "itemLabel": "Carl Morgan", "itemDescription": "British rapper and murderer", "wikipedia_url": "https://en.wikipedia.org/wiki/Carl_Morgan", "wikipedia_page": {"main": "Carl Morgan (born 1981) is a former producer of the rap group So Solid Crew. In October 2005, he was sentenced to 30 years for murdering a love rival.\nHe was tried before a jury for the murder of 24-year-old Colin Leyon Scarlett in Tooting, South London, in November 2004.Colin Scarlett, the partner of Morgan's ex-girlfriend (who has two children by Morgan), had beaten Morgan up earlier on the day of the murder. Morgan then returned with a gun and shot Scarlett.\nThe jury failed to reach a verdict on the same charge faced by So Solid Crew rapper Megaman, who faced a retrial in March 2006 where the jury was discharged before a verdict could be reached. A second retrial began in September 2006, and on 28 September Megaman was found not guilty of murder at the Old Bailey.\nMorgan's trial judge recommended that he should spend at least 30 years in prison before being considered for parole, a recommendation that is expected to keep him behind bars until at least 2034 and the age of 53.Morgan appeared in So Solid Crew's video for the track \"21 Seconds\".", "link_mentions": [{"page": "So Solid Crew", "response": ["*Carl Morgan ", "In 2002, they were the subject of the Channel 4 television documentary This Is So Solid directed and narrated by David Upshal, later released on DVD by Universal along with a live performance. Members Harvey, Romeo and Lisa Maffia have all appeared on the Channel 4 celebrity reality show The Games. In 2012, Romeo and Harvey each appeared in a separate series of Celebrity Big Brother, in the 9th and 10th series respectively; they both finished in sixth place in their respective series. The band's former producer, Carl Morgan, was convicted of murder in October 2005. Group member Dwayne Vincent (Megaman) was also accused but was cleared after a retrial."]}, {"page": "Winstanley and York Road Estate", "response": ["*Carl Morgan"]}]}}