{"wiki_id": "http://www.wikidata.org/entity/Q5043847", "itemLabel": "Carne Rasch", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Carne_Rasch", "wikipedia_page": {"main": "Sir Frederic Carne Rasch, 1st Baronet (9 November 1847 – 27 September 1914) was a British Conservative politician.\n\nRasch was born in London, the only son of Frederick Carne Rasch, a prominent Chancery barrister, and his wife Catherine James Edwards, daughter of James Edwards. He was educated at Eton College and Trinity College, Cambridge. He then became a lieutenant in the 6th Dragoon Guards (the Carabineers) and served with them for ten years. Subsequently, he became Captain and Honorary Major of the 4th Battalion of the Essex Regiment. He was a J.P. a Deputy Lieutenant, and county alderman for Essex.\nRasch stood unsuccessfully for the Elland Division of the North-West Riding in 1875. He was elected Member of Parliament for Essex South-East in 1886, a seat he held until 1900, and then represented Chelmsford until 1908. In 1903 he was created a Baronet, of Woodhill in Danbury in the County of Essex.\nAlthough the name Rasch is considered of German origin, Sir Carne Rasch was descended from a line originating in the Danish Duchy of Schleswic in Holstein. Rasch married Katherine Anne, daughter of Henry Lyons Griffinhoofe, in 1879. He died in September 1914, aged 66. Lady Rasch died in 1944. Sir Frederic Carne Rasch was succeeded in the baronetcy by his eldest son, also named Frederick Carne although he was known and referred to by intimates as \"Carne\" rather than as Frederick.", "link_mentions": [{"page": "Sir Gilbert Parker, 1st Baronet", "response": ["In May 1905, Parker publicly claimed to have seen a \"vision\" of fellow house member, Frederic Carne Rasch, despite the fact that Rasch was known to be bedridden at home with influenza."]}, {"page": "Chelmsford (UK Parliament constituency)", "response": ["| Sir Carne Rasch, Bt"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Carne Rasch "]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Carne Rasch"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Carne Rasch "]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| Carne Rasch "]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Carne Rasch"]}, {"page": "Rasch", "response": ["*Carne Rasch (1847–1914), British politician"]}, {"page": "South East Essex (UK Parliament constituency)", "response": ["| Carne Rasch"]}, {"page": "Rasch baronets", "response": ["The Rasch Baronetcy, of Woodhill in Danbury in the County of Essex, is a title in the Baronetage of the United Kingdom. It was created on 29 August 1903 for Frederic Carne Rasch, Conservative Member of Parliament for South East Essex and Chelmsford. He was succeeded in the baronetcy by his eldest son, also named Frederic but known as 'Carne', as the second Baronet. He was a Colonel in the Army. On Sir 'Carne' Rasch's death the title passed to his nephew, Richard Guy Carne Rasch, the third Baronet. Richard was the son of Brigadier Guy Elland Carne Rasch, the younger son of the first Baronet who had been a gentleman usher to King George VI and afterwards Queen Elizabeth II. The fourth baronet, Sir Simon (Anthony Carne) Rasch, succeeded to the baronetcy in 1996.", "*Sir Frederic Carne Rasch, 1st Baronet (1847–1914)", "*Sir (Frederic) Carne Rasch, 2nd Baronet (1880–1963)'RASCH, Sir (Frederic) Carne', Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2014 ; online edn, April 2014 accessed 14 Dec 2016", "*Sir Richard Guy Carne Rasch, 3rd Baronet (1918–1996)", "*Sir Simon Anthony Carne Rasch, 4th Baronet (born 1948)"]}, {"page": "FC Rasch", "response": ["#REDIRECT Carne Rasch"]}, {"page": "Carne Rasch, 1st Baronet", "response": ["#REDIRECT Carne Rasch"]}, {"page": "Sir Carne Rasch, 1st Baronet", "response": ["#REDIRECT Carne Rasch"]}, {"page": "1908 Chelmsford by-election", "response": ["Sir Carne Rasch had been Conservative MP for the seat of Chelmsford since the 1900 general election. His resignation came at the age of 61.", "The local Liberal Association re-selected A.H. Dence to attack the seat. Dence had been defeated at Chelmsford by Sir Carne Rasch in January 1906. His slogan: 'Don't be rash, Vote for Dence' was countered by the successful Conservative's 'Don't be dense, Vote for Rasch.'A Liberal Chronicle: Journals and Papers of J.A. Pease"]}]}}