{"wiki_id": "http://www.wikidata.org/entity/Q504409", "itemLabel": "Black", "itemDescription": "English pop singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Black_(singer)", "wikipedia_page": {"main": "Colin Vearncombe (26 May 1962 – 26 January 2016), known by his stage name Black, was an English singer-songwriter. He emerged from the punk rock music scene and achieved mainstream pop success in the late 1980s, most notably with the 1986 single \"Wonderful Life\", which was an international hit the next year.William Ruhlmann of AllMusic described Vearncombe as a \"smoky-voiced singer/songwriter, whose sophisticated jazz-pop songs and dramatic vocal delivery place him somewhere between Bryan Ferry and Morrissey\". Michael Hann of The Guardian described his voice as a \"slightly frayed baritone\".\n\n", "link_mentions": [{"page": "May 26", "response": ["*1958 – Ronnie Black, American golfer", "*1962 – Black, English singer-songwriter (d. 2016)"]}, {"page": "1962", "response": ["** Malorie Blackman, British author of young adult fiction ", "** Black, English singer-songwriter (d. 2016)"]}, {"page": "2016", "response": ["* December 25 – 2016 Russian Defence Ministry Tupolev Tu-154 crash: A Tupolev Tu-154 jetliner of the Russian Defence Ministry crashes into the Black Sea shortly after taking off from Sochi International Airport, Russia, while en route to Khmeimim Air Base, Syria. All 92 people on board, including 64 members of the Alexandrov Ensemble choir of the Russian Armed Forces, are killed.", "** Black, English singer-songwriter (b. 1962)"]}, {"page": "List of one-word stage names", "response": ["* Black (1962–2016), British singer-songwriter"]}, {"page": "List of people who died in traffic collisions", "response": ["| singer for rock band Black Lace", "|align=\"left\"| Black (singer), real name Colin Vearncombe", "|align=\"left\"| Steven Blackford", "|align=\"left\"| J. Stuart Blackton", "| rugby union player and former All Black", "|align=\"left\"| Lord Taylor of Blackburn"]}, {"page": "Ugly Man Records", "response": ["Ugly Man Records is a British independent record label based in Rhos on Sea, Wales, originally in Manchester. It released debut singles for many Manchester bands, including Elbow, the Man From Delmonte and I Am Kloot. It was set up in Bootle, Merseyside in 1986 with the release of \"Wonderful Life\" by the Liverpool-based band Black, which reached number 72 in the UK Singles Chart.", "* Black"]}, {"page": "Black (disambiguation)", "response": ["Black is a color corresponding to the absence of light.", "Black may also refer to:", "*Black people, a racial categorization of humans mostly used for people of Sub-Saharan African descent and the indigenous peoples of Oceania.", "*Black (singer) (1962–2016), a stage name for Colin Vearncombe", "*Black (surname), a list of people and fictional characters", "*List of people known as the Black, various people, real or fictional", "*The Black Sea, a sea between Europe and Asia", "*Black, Alabama, a town, United States", "*Black, Illinois, an unincorporated community, United States", "*Black, Missouri, an unincorporated community, United States", "*Black, West Virginia, an unincorporated community, United States", "*Black Glacier, Victoria Land, Antarctica", "*Black Head (disambiguation)", "*Black Hill (disambiguation)", "*Black Island (disambiguation)", "*Black Lake (disambiguation)", "*Black Mountain (disambiguation)", "*Black Mountains (disambiguation)", "*Black Peak (disambiguation)", "*Black River (disambiguation)", "*Black Town, another name for George Town, in India", "*Black Township (disambiguation)", "*Black Volcano, an inactive volcano near Albuquerque, New Mexico, United States", "*The Black-E, a community arts centre in Liverpool, England", "*Black (crater), a lunar crater", "*11207 Black, a main-belt asteroid", "*Black (2004 film), a Malayalam film directed by Ranjith Balakrishnan", "*Black (2005 film), a Hindi film directed by Sanjay Leela Bhansali", "*Black (2008 film), a French heist film directed Pierre Laffargue", "*Black (2015 Belgian film), a Belgian crime film by Adil El Arbi and Bilall Fallah", "*Black (2015 Bengali film), a Bengali film directed by Raja Chanda", "*Black (South Korean TV series), a 2017 South Korean TV series", "*Black (Indian TV series), a 2009 Hindi-language Indian television series", "*Pacific Rim: The Black, a 2021 Netflix animated television series", "*\"Black\" (Supernatural), a 2014 television episode of the Supernatural fantasy U.S. TV show", "*Black (video game), a 2006 first-person shooter", "*Pokémon Black and White, 2011 video games for the Nintendo DS", "*Twisted Metal: Black, a 2001 vehicle combat video game", "*White and Black in chess", "*Black (novel), a novel in the Circle Trilogy by Ted Dekker", "*Black (play), a play by Joyce Carol Oates", "*Black (event), a Dutch hardstyle event", "*Black (singer), stage name of English singer Colin Vearncombe", "*Black (video), a live performance video by Psychic TV", "*Black (Bangladeshi band), a Bangladeshi rock band", "*The Black (American band), an American rock band", "*Black (band Black album), 2011", "*Black (singer Black album), 1987", "*Black (Dierks Bentley album) or the title song (see below), 2016", "*Black (Lee Hyori album) or the title song, 2017", "*Black (Lita Ford album) or the title song, 1994", "*Black (Project Pitchfork album), 2013", "*The Black (album) or the title song, by Asking Alexandria, 2016", "*The Black (EP), by William Control, 2017", "*\"Black\" (Dierks Bentley song), 2016", "*\"Black\" (Pearl Jam song), 1991", "*\"Black\" (Sevendust song), 1997", "*\"Black\" (Trivium song), 2012", "*\"Black\", by Basement from Colourmeinkindness, 2012", "*\"Black\", by Danger Mouse and Daniele Luppi from Rome, 2011", "*\"Black\", by Dave from Psychodrama, 2019", "*\"Black\", by Guru Randhawa, 2019", "*\"Black\", by Motionless in White from The Whorror, 2007", "*\"Black\", by Neurosis from Pain of Mind, 1987", "*\"Black\", by Sarah McLachlan from Solace, 1991", "*\"Black\", by Will Oldham from I See a Darkness, 1999", "*Black (horse), a coat color of horse", "*Black (turkey), a breed of domestic turkey", "*Black (automobile), a 19th-century U.S. automobile", "*Black Motor Company, an American automobile manufacturer from 1908 to 1910", "*Boeing Black, a phone by Boeing", "*A slang for a Black & Mild, a tobacco product", "*Black and white (disambiguation)", "*Black's (disambiguation)", "*Blacks (disambiguation)", "*Black v Chrétien, a Canadian law case"]}, {"page": "Kate Ryan", "response": ["In January 2016, Ryan released another single via iTunes, this time a cover of British singer Black's song \"Wonderful Life\". In June 2016, she released a new single via iTunes, \"Comment te dire adieu\", a cover of French singer Françoise Hardy, which as well is a French-language cover of the song \"It Hurts to Say Goodbye\", originally performed by American singer Margaret Whiting."]}, {"page": "The Prince's Trust", "response": ["* 1988: Bee Gees, Black, Elton John, Eric Clapton, Howard Jones, Joe Cocker, Leonard Cohen, Mark Knopfler, Midge Ure, Peter Gabriel, Phil Collins, Rick Astley, T'Pau, Wet Wet Wet, Brian May", "* 1989: Joan Baez, Andy Bell, Beverley Brown, City of Birmingham Symphony Orchestra, Will Downing, John Farnham, Tony Hadley, Nigel Kennedy, Nichola Kerr, Level 42, Ladysmith Black Mambazo, Mike + The Mechanics, Van Morrison, Anne Nightingale, Alexander O'Neal, Mica Paris, Dashiell Rae, Swing Out Sister"]}, {"page": "Tina Cousins", "response": ["In 2005, Cousins released her first single in five years with \"Wonderful Life\", a cover of the Black song, which had originally been released in Australia. In 2007, \"Wonderful Life\" was adopted by Hoyts as their primary pre-feature theme music. \"Wonderful Life\" reached No. 15 in Australia and spent four months in the Top 50, becoming her biggest radio hit."]}, {"page": "One 2 Many", "response": ["Kolsrud went on to join the band Guys in Disguise, after which he pursued a solo career. He later became a-ha's world tour musical director.  Griehsel met British singer Colin Vearncombe (a.k.a. Black) and married him in 1990. She went on to become an opera singer and has lived and performed in London and Cork, Ireland. In 2008 she released an album, Rum and Chocolate."]}, {"page": "Idool 2004", "response": ["|\"Wonderful Life\" (Black)", "|\"Black\" (Pearl Jam)"]}, {"page": "Magic (TV channel)", "response": ["| Gabrielle, The Corrs, Boyzone, R. Kelly, Elton John, Seal, Crowded House, Dina Carroll, Peter Cetera, Bill Withers, Yvonne Elliman, Dobie Gray, Marvin Gaye, Bryan Ferry, Commodores, Dr Hook, Barry White, 10cc, Robert Palmer, Wet Wet Wet, Geri Halliwell, Sixpence None the Richer, Sheryl Crow, Backstreet Boys, Simply Red, Another Level, Bee Gees, Gloria Estefan & the Miami Sound Machine, Lighthouse Family, Paul Young, Paul Weller, Christopher Cross, Carly Simon, Labi Siffre, Mr. Mister, Black, Air Supply, The Christians, Ladysmith Black Mambazo feat Des'ree", "| S Club, Emma Bunton, David Sneddon, Shania Twain, Vanessa Carlton, DJ Sammy, Dido, George Michael, Appleton, Nelly Furtado, Style Council, The Corrs, Marti Pellow, Texas, Oleta Adams, Simply Red, Des'ree, Stevie Wonder, Bill Withers, Commodores, Ronan Keating, Elton John, Gabrielle, Boyzone, Elvis Costello, Dionne Warwick, Dusty Springfield, Aretha Franklin, Eurythmics, The Bangles, Deacon Blue, Lisa Loeb, Malachai, Rod Stewart, Lighthouse Family, Paul Young & Zucchero, Black, Jackson 5, Hall & Oates, Tavares"]}, {"page": "List of bands and artists from Merseyside", "response": ["*Cilla Black: 1960s singer discovered by Brian Epstein, later to become a successful television presenter", "*Black: 1980s singer-songwriter best known for the hit \"Wonderful Life\"", "*The Black Velvets: 2000s rock band", "*Kathryn Williams released her first album, Dog Leap Stairs on her own Caw Records label in 1999 with a budget of £80. The follow-up, Little Black Numbers, garnered a Mercury Prize nomination in 2000"]}, {"page": "Gavin Harrison", "response": ["Gavin started to work professionally in 1979. He worked as a freelance session drummer on records and tours for the following artists: Incognito, Lisa Stansfield, Lewis Taylor, Artful Dodger, Paul Young, Iggy Pop, Level 42, Porcupine Tree, OSI, King Crimson, Shooter, Dizrhythmia, The Pineapple Thief, The Kings Of Oblivion, Sam Brown, Tom Robinson, Go West, Black, Gail Ann Dorsey, B J Cole, Dave Stewart and Barbara Gaskin, Nathan East, Yasuaki Shimizu, Camouflage, Kevin Ayers, Claudio Baglioni, Franco Battiato, Chizuko Yoshihiro, Renaissance, Mick Karn, Eros Ramazzotti, Nick Johnston, Randy Goodrum, and Fates Warning.", "|Black", "|Blackfield", "|Blackfield", "|Blackfield", "|Blackfield II"]}, {"page": "Steve Sidwell (musician)", "response": ["* Comedy - Black (1988)", "* Black - Black (1991)", "* The Accused - Black (1999)", "* Back to Black - Amy Winehouse (2006)"]}, {"page": "Everything's Coming Up Roses", "response": ["In 1974, Ethel Merman appeared in a television advertisement singing new lyrics to the tune of \"Everything's Coming Up Roses\" to promote the Colgate-Palmolive dishwashing liquid Vel. That same year Merman recorded \"Everything's Coming Up Roses\" for her album Merman Sings Merman recorded with Stanley Black & the London Festival Orchestra. She again recorded the song for The Ethel Merman Disco Album in 1979. In a cameo in the 1980 film Airplane!, Merman sings a few bars of \"Everything's Coming Up Roses\" in what became her final film appearance."]}, {"page": "Colin Vearncombe", "response": ["#REDIRECT Black (singer)"]}, {"page": "Wonderful Life (Black song)", "response": ["\"Wonderful Life\" is a song by the English singer Black from his 1986 album of the same name. It was released twice as a single and was successful the second time, becoming a top ten hit in Austria, France, Germany, Italy, Switzerland, the Netherlands and the UK. Black, who wrote the song while broke, commented: \"I was really being ironic... Most people took it at face value.\"", "The song was described by AllMusic as a \"seductive, bittersweet ballad\". The Daily Telegraph said, \"Its oddly uplifting lyrics... combined with Black's melancholy croon created, as one critic observed, 'luxuriantly melodic pop that sounds something like a male version of Sade'.\"", "The music video, shot in black and white, was filmed around the English seaside resort of Southport, Merseyside, as well as Wallasey near Black's hometown of Liverpool, and features New Brighton Lighthouse and promenade. The video includes the Looping Star rollercoaster, a ride at Pleasureland at the time, as well as The Galleon fairground ride, the shrimping boat, local shops and residents. It was directed by Gerard de Thame, husband of television presenter Rachel de Thame, and won an award at the New York Film Festival in 1988.", "*The song was used in TV advertisements for Fleury Michon meat products in France in the 2000s, but was not sung by Black.", "Category:Black (singer) songs", "Category:Black-and-white music videos"]}, {"page": "Wonderful Life (Black album)", "response": ["Wonderful Life is the debut album by English singer Black (the stage name of Colin Vearncombe). Released in 1987, it peaked at #3 on the UK Albums Chart in September of that year.", "In 1985 Vearncombe wrote the minor key song \"Wonderful Life\". It was released independently through Ugly Man Records, and got Black noticed by A&M Records who signed Vearncombe and launched his international career. Vearncombe said:", "Category:Black (singer) albums"]}, {"page": "Calum Malcolm", "response": ["His working credits also include The Boys of the Lough, Brian McNeill, It's Immaterial, Josef K, Mike Lindup, Stéphane Grappelli, The Happy Family, Tom Anderson, Tommy Smith, William Jackson and on Black's 2015 album, Blind Faith."]}, {"page": "Roy Martin (musician)", "response": ["Martin has worked with The Zutons, Snowy White (Pink Floyd, Thin Lizzy), Aretha Franklin, Modern English, Jimmy Barnes, David Gray, Patricia Kaas, The Christians, Bono (U2), Regina Belle, Thea Gilmore, The Cheap Seats, Viv Stanshall, Lightning Seeds, Gavin Friday, Roland Gift (Fine Young Cannibals), Russell Watson, Robert Palmer, Pete Wylie, Barclay James HarvestShow of Hands, Black, Shalom Hanoch, Cock Robin, Jack Bruce, Ant and Dec (Pj & Duncan, Oui 3, Nut, Paul Young (Mike + the Mechanics), Sad Café, Diesel, Gerry Thomas (Fatback Band), Elisha La'Verne, Donna McGhee, Johhny Conquest, Mike Peters (The Alarm), Glen Matlock, David Essex, Billy Brannigan, Show of Hands, Ronnie Peterson, Breed 77, Nigel Stonier, Terry Reid (The Rolling Stones, Bonnie Raitt, Fleetwood Mac)"]}, {"page": "List of songs recorded by Ace of Base", "response": ["!scope=row |Black Sea", "!scope=row |Reality (In Black and White)", "|Black", "* \"Reality (In Black and White)\" (November 10, 2011)"]}, {"page": "Lyriel", "response": ["Lyriel signed with AFM Records in 2011. A fourth album named Leverage was released in February 2012. Among a mix of soft folk rock as well as symphonic metal, it features a duet with Schandmaul vocalist Thomas Lindner. Leverage received positive reviews in Germany, Austria and the United Kingdom. It was however noted that the \"album does lose some steam near its conclusion\" and that the band should have dared to evolve towards harder metal songs. Leverage contains two songs \"The Road Not Taken\" and \"Parting\" that are based on lyrics by Robert Frost and Charlotte Brontë respectively On the extended edition there is a version of \"Everything's Coming Up Roses\" by Black.", "The septet designate their music \"Dark Romantic Celtic Rock\". Lyriel's repertoire ranges from medievally inspired ballads to hard rock pieces with elements of classical and folk music. Interview. Early recordings were frequently compared to Blackmore's Night, but the band has evolved towards symphonic metal with gothic influences."]}, {"page": "Mall (album)", "response": ["*Black, Dave Clarke, Linda Taylor, Louise Goffin, Stan Loubières - backing vocals"]}, {"page": "Neal Snyman", "response": ["Returning to South Africa in 1995 Snyman continued as a freelance, setting up a working base within the SABC complex. Either as producer or engineer, he has recorded Mango Groove,  Springbok Nude Girls, Brenda Fassie, Bayete, Stimela, Prime Circle, The Parlotones, Josie Field, Kaolin Thompson, Collective Soul, Live, Arno Carstens, Colin Vearncombe (Black), Callum MacColl, Christie Henessy, Tananas, Wendy Oldfield, Ian Herman, Eminent Child, Johannes Kerkorrel, Johnny Clegg, Freshly Ground, Karen Zoid, Van Coke Kartel, Chris Chameleon, Frank Opperman and Cassette."]}, {"page": "List of songs in SingStar games (PlayStation 3)", "response": ["| \"Back To Black\"", "| Black", "|The Black Eyed Peas", "|Muse || \"Supermassive Black Hole\"", "| Soprano – Blacko", "| Black Kids", "| \"Black And Gold\""]}, {"page": "Jimmy Hughes (British musician)", "response": ["Hughes' subsequent work includes taking part in the first rock tour of the Middle East with the theatre rock band Famous Names; guesting on tracks for the rockabilly band Whirlwind; Alan Wilder's solo album Hydrology Parts 1 and 2; as writer and performer on Paradise Now for the Norwegian rock band Oceans Apart; television appearances with La Toya Jackson; and playing with a diverse range of musicians including Mick Jagger, Jeff Beck, members of Cameo, Black, Greg Phillinganes, and Omar Hakim."]}, {"page": "Black (singer Black album)", "response": ["Black is a self-titled album by Black, the musical vehicle of Colin Vearncombe. It is a retrospective album released in 1987 by Black's former label Warner Music Group after his commercial breakthrough with the album Wonderful Life (on A&M Records) and comprises several singles recorded while Vearncombe was signed to Warner.", "* http://www.discogs.com/Black-Black/release/795628", "Category:Black (singer) albums"]}, {"page": "Comedy (Black album)", "response": ["Comedy was the second official album by Black, released in 1988. It reached No.32 in the UK Albums Chart.", "*Black - guitar, vocals", "Category:Black (singer) albums"]}, {"page": "Luís Jardim", "response": ["With Black", "* Black (A&M Records, 1991)"]}, {"page": "Black (English band)", "response": ["#REDIRECT Black (singer)"]}, {"page": "Leverage (album)", "response": ["Among a mix of soft folk rock as well as symphonic metal and Gothic Metal it features a duet with Schandmaul vocalist Thomas Lindner. Leverage contains two songs \"The Road Not Taken\" and \"Parting\" that are based on lyrics by Robert Frost and Charlotte Brontë respectively On the extended edition there is a version of \"Everything's Coming Up Roses\" by Black."]}, {"page": "Brit Award for Best New Artist", "response": ["* Black", "* Black Grape"]}, {"page": "Tomato (design collective)", "response": ["Tomato is a multi-discipline design and film collective, founded in London in 1991 by Steve Baker, Dirk van Dooren, Simon Taylor, John Warwicker and Graham Wood, plus musicians Karl Hyde and Rick Smith of the electronic group Underworld and Colin Vearncombe, the artist also known as Black. They were joined by Jason Kedgely in 1994."]}, {"page": "The Voice: la plus belle voix (season 3)", "response": ["| Wonderful Life – Black", "| Back to Black – Amy Winehouse", "| I Love Rock 'n' Roll – Joan Jett & the Blackhearts"]}, {"page": "Funny Looking Angels", "response": ["The album contains four covers: \"Only You\" by Yazoo, Black's \"Wonderful Life\", \"Funny Looking Angels\" by Delta, and \"On and On\" by Longpigs."]}]}}