{"wiki_id": "http://www.wikidata.org/entity/Q5040323", "itemLabel": "Carl Hoddle", "itemDescription": "English footballer (1967-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carl_Hoddle", "wikipedia_page": {"main": "Carl Hoddle (8 March 1967 – 2 March 2008) was an English football player and coach.\nThe younger brother of England international Glenn Hoddle, Carl began his career with Tottenham Hotspur in 1984. After two years he moved to Barnet, where he stayed until 1988 before moving to Bishop's Stortford in a swap deal for former Barnet player Ian Fergusson. After one season he was signed by Leyton Orient, where he played 29 times, before returning to Barnet in 1991, ending his senior career in 1995 after 100 appearances. He also had a spell with Conference National side Woking. \nOne notable game he played for Barnet was in the FA Cup against Chelsea in 1994, who were at the time managed by his older brother. He later worked in the used car trade and as a pub landlord before joining his older brother as a coach and scout at Wolverhampton Wanderers between 2004 and 2006. He died on 2 March 2008 after he was found collapsed in his home from what was initially suspected to be a heart attack but later confirmed as a brain aneurysm.", "link_mentions": [{"page": "Glenn Hoddle", "response": ["In 1996, his younger brother, former footballer Carl Hoddle, overdosed on paracetamol, but recovered. In March 2008, Carl Hoddle died at the age of 40 after collapsing suddenly from a brain aneurysm. Glenn Hoddle was reportedly \"devastated\" by the death of his brother."]}, {"page": "2007–08 in English football", "response": ["*2 March 2008 – Carl Hoddle, 40, former Barnet and Leyton Orient midfielder; brother of Glenn Hoddle."]}, {"page": "2008 in association football", "response": ["* 2 March – Carl Hoddle (40), English footballer"]}, {"page": "List of foreign Malaysian League players", "response": ["* Carl Hoddle – Negeri Sembilan FA – 1986"]}, {"page": "Burnt Mill Academy", "response": ["*Carl Hoddle, footballer, coach"]}, {"page": "Deaths in March 2008", "response": ["*Carl Hoddle, 40, English footballer (Leyton Orient, Barnet), brain aneurysm."]}, {"page": "Hoddle", "response": ["* Carl Hoddle (1967–2008), English football player and coach"]}, {"page": "List of English association football families", "response": ["* Glenn Hoddle, Carl Hoddle (brother)"]}, {"page": "1992 Football League Fourth Division play-off Final", "response": ["Blackpool faced Barnet in the other semi-final and the first match was played on 10 May 1992 at Underhill in London.  Mark Carter scored from close range in the 27th minute when Carl Hoddle's shot was not gathered by Blackpool's goalkeeper Steve McIlhargey to give Barnet the lead.  With the second half goalless, the match ended 1–0.  The second leg took place three days later at Bloomfield Road in Blackpool.  Both Dave Bamber and Mitch Cook made goal-line clearances for Blackpool after McIlhargey failed to clear crosses, but in the 41st minute, the home side took the lead.  Bamber headed a corner from David Eyres back across goal for Paul Groves who scored with a header from close range.  After McIlhargey had made a save to deny a diving header from Jonathan Hunt, Andy Garner doubled Blackpool's lead from the penalty spot after Mick Bodley was penalised for handball.  Blackpool won the match 2–0 and progressed to the final with a 2–1 aggregate victory."]}]}}