{"wiki_id": "http://www.wikidata.org/entity/Q5055982", "itemLabel": "Cecil Burton", "itemDescription": "English County cricketer (1887-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Burton", "wikipedia_page": {"main": "David Cecil Fowler Burton, better known as Cecil Burton, (13 September 1887 – 24 September 1971) was a first-class cricketer, who played for Cambridge University (1907-1908), Marylebone Cricket Club (MCC) (1910-1922) and Yorkshire (1907-1921). He captained Yorkshire from 1919 to 1921.\nHe was born in Bridlington, East Riding of Yorkshire, England. A right-handed batsman, Burton scored 3,057 runs in his 130 first-class matches, with a highest score of 142* against Hampshire. His other century, 110, came against Leicestershire. He averaged 20.24 with the bat, and took 54 catches in the field. His brother Claude Burton, cousin David S.G. Burton and uncle Arthur Trollope, all played first-class cricket.\nBurton died at the age of 84 in September 1971, in Chertsey, Surrey.", "link_mentions": [{"page": "Bridlington", "response": ["*Cecil Burton (1887–1971), cricketer and former Yorkshire County Cricket Club captain, was born in the town, as was his younger brother Claude Burton (1891–1971), who also played for Yorkshire."]}, {"page": "English cricket team in the West Indies in 1912–13", "response": ["* Cecil Burton"]}, {"page": "David Burton (cricketer, born 1888)", "response": ["Born Stuart Gaselee Burton in Bath, Somerset, Burton batted mostly in the lower order, and did not make many runs. He did not bowl on the tour and never played first-class cricket again afterwards. His cousin Cecil Burton was also on the tour and later captained Yorkshire; Cecil's brother Claude played first-class cricket for Oxford University and Yorkshire."]}, {"page": "Claude Burton (cricketer)", "response": ["Burton was born in Bridlington, East Riding of Yorkshire, England, the younger brother of Cecil Burton, who captained Yorkshire at cricket after World War I. Burton was educated at Malvern College and Brasenose College, Oxford, and appeared in several matches for Oxford University from 1911 to 1914, without ever becoming a regular player. In the 1914 season, he made two appearances for Yorkshire, scoring 47 in his first match against Somerset, and taking useful wickets in the second against Gloucestershire. After the war, Burton played only two more first-class matches: once for the Demobilised Officers' side against a combined Army and Navy team at Lord's in 1919, and then, in 1928, for the amateur Harlequins team that played the 1928 West Indies tourists at Eastbourne."]}, {"page": "David Burton", "response": ["* David Cecil Burton (1887–1971), cricketer and captain of Yorkshire CCC"]}, {"page": "Arthur Trollope", "response": ["Trollope's nephews, Cecil Burton and Claude Burton both played first-class cricket."]}, {"page": "Herbert Sutcliffe's cricket career (1919–1927)", "response": ["Yorkshire had been hit by a double tragedy in recent years with the deaths of Alonzo Drake (illness) and Major Booth (killed in action during the war) and a rebuilding process was necessary.  The success of Holmes and Sutcliffe went a long way towards completing that process.  Otherwise, Yorkshire relied mainly on their Edwardian veterans George Herbert Hirst, Wilfred Rhodes, David Denton and wicket-keeper Arthur Dolphin.  As always in the era of Lord Hawke, now club president, the team captain was an amateur player and from 1919 to 1921 it was Cecil Burton who filled the role.  Other mainstays of the team that Sutcliffe joined were pace bowler Abe Waddington, all-rounder Roy Kilner and seam bowler Emmott Robinson.  But it was not a settled team and Yorkshire used a total of 21 players in the 1919 County Championship."]}, {"page": "List of Yorkshire cricket captains", "response": ["* 1919 – 1921 Cecil Burton – champions 1919"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Cecil Burton (1919–1921)"]}, {"page": "List of Marylebone Cricket Club players (1895–1914)", "response": ["* Cecil Burton (1910/11–1922) : D. C. F. Burton (Yorkshire). Tours: West Indies (1910/11); West Indies (1912/13)."]}]}}