{"wiki_id": "http://www.wikidata.org/entity/Q5052813", "itemLabel": "Catherine Mayer", "itemDescription": "author, journalist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Mayer", "wikipedia_page": {"main": "Catherine Mayer (born 24 January 1961) is an American-born British author and journalist, and the co-founder and President of the Women's Equality Party (WE) in the UK.\n\n", "link_mentions": [{"page": "Time (magazine)", "response": ["In 2017, editor and journalist Catherine Mayer, who also founded the Women's Equality Party in the UK, sued Time through attorney Ann Olivarius for sex and age discrimination.Emma Graham-Harrison, \"Top journalist sues Time magazine for 'sex and age discrimination' \", The Guardian, August 5, 2017; Mayer v. Time, Inc, No. 1:2017cv05613  The suit was resolved in 2018.Vanessa Thorpe and Emma Graham-Harrison, \"Sandi Toksvig sparks new gender pay row over QI fee ,\" The Guardian, September 8, 2018."]}, {"page": "Charles, Prince of Wales", "response": ["Charles has made frequent visits to Saudi Arabia in order to promote arms exports for companies such as BAE Systems. In 2013, 2014, and 2015, he met with the commander of Saudi Arabia's National Guard Mutaib bin Abdullah. In February 2014, he took part in a traditional sword dance with members of the Saudi royal family at the Janariyah festival in Riyadh. At the same festival, British arms company BAE Systems was honoured by Prince Salman bin Abdulaziz. Charles was criticised by Scottish MP Margaret Ferrier in 2016 over his role in the sale of Typhoon fighter jets to Saudi Arabia. According to Charles's biographer Catherine Mayer, a Time magazine journalist who claims to have interviewed several sources from Prince Charles's inner circle, he \"doesn't like being used to market weaponry\" in deals with Saudi Arabia and other Arab Gulf states. According to Mayer, Charles has only raised his objections to being used to sell weapons abroad in private."]}, {"page": "Andy Gill", "response": ["Gill was born in Manchester, England, UK, on 1 January 1956. He was married to Catherine Mayer, a journalist and the co-founder of the Women's Equality Party."]}, {"page": "Lise Mayer", "response": ["Mayer had a relationship with Rik Mayall, co-writer and star of The Young Ones. She has a son, Isaac, with comedian and television presenter Angus Deayton, with whom she was in a relationship from 1991 to 2015. Her sister, Catherine Mayer, co founded the Women's Equality Party with Sandi Toksvig."]}, {"page": "Orwell Prize", "response": ["**Catherine Mayer"]}, {"page": "Women's Equality Party", "response": ["The Women's Equality Party (WEP) is a feminist political party set up in the United Kingdom in 2015. The idea was conceived by Catherine Mayer and Sandi Toksvig at the Women of the World Festival, when they concluded that there was a need for a party to campaign for gender equality to the benefit of all. The launch meeting was on 28 March 2015 under the title \"The Women's Equality Party needs you. But probably not as much as you need the Women's Equality Party\". The party's full policy was launched by its then-leader Sophie Walker at Conway Hall on 20 October 2015. In January 2020, Mandu Reid took over as party leader.", "On 2 March 2015, author and journalist Catherine Mayer attended a \"Women in Politics\" event at the Women of the World Festival (at the Southbank Centre in central London). The panel was chaired by Jude Kelly (Artistic Director, Southbank Centre), and the panel consisted of Katie Ghose (CEO, Electoral Reform Society), Margot James (Conservative), Stella Creasy (Labour) and Jo Swinson (Lib Dem). Having watched the panelists agreeing collegially with each other on almost every point, Mayer stood up and said, \"What about if I found a Women's Equality Party, tell you what, I'm going to go to the bar afterwards, anyone interested in discussing this come and see me.\"", "The inaugural Women's Equality Party conference took place in Manchester on 25–27 November 2016, with opening speeches by founders Catherine Mayer and Sandi Toksvig on the first day, and Sophie Walker's leader's speech on the second day. Video."]}, {"page": "2019 European Parliament election in the United Kingdom", "response": ["The Women's Equality Party stood in the London constituency, with the party's co-founder Catherine Mayer as the lead candidate."]}, {"page": "Happy Now (album)", "response": ["#\"Change the Locks\" (Andy Gill, Catherine Mayer) – 4:07", "#\"White Lies\" (Andy Gill, Catherine Mayer) – 3:43", "#\"Paper Thin\" (Andy Gill, Catherine Mayer) – 3:38", "*Catherine Mayer – mixing on \"One True Friend\", \"Change the Locks\", \"White Lies\" and \"Paper Thin\"; production on \"One True Friend\", \"Change the Locks\", \"White Lies\" and \"Paper Thin\""]}, {"page": "Attack of the 50 Ft. Women", "response": ["#REDIRECT Catherine Mayer"]}]}}