{"wiki_id": "http://www.wikidata.org/entity/Q5053490", "itemLabel": "Cathy Shipton", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Cathy_Shipton", "wikipedia_page": {"main": "Catherine Ellen Shipton (born 27 March 1957) is an English actress, known for portraying the role of Lisa \"Duffy\" Duffin in the BBC medical drama Casualty. After leaving the series in 2020, she has since appeared in the Channel 4 soap opera Hollyoaks as Lydia.", "link_mentions": [{"page": "Casualty (TV series)", "response": ["Casualty follows the professional and personal lives of the medical and ancillary staff of Holby City Hospital's emergency department. It features an ensemble cast of regular characters, and began with ten main characters in its first series. The original characters are consultant Ewart Plimmer (Bernard Gallagher), senior house officer Baz Samuels (Julia Watson), charge nurse Charlie Fairhead (Derek Thompson), staff nurse Clive King (George Harris), state enrolled nurse Megan Roach (Brenda Fricker), student nurse Lisa \"Duffy\" Duffin (Cathy Shipton), paramedics Sandra Mute and Andrew Ponting (Lisa Bowerman and Robert Pugh), receptionist Susie Mercier (Debbie Roza) and porter Kuba Trzcinski (Christopher Rozycki)."]}, {"page": "List of former Hollyoaks characters", "response": ["| Lydia Smith || Cathy Shipton || 2021"]}, {"page": "Christopher Guard", "response": ["Guard has two daughters from his marriage with Lesley Dunlop and one daughter with actress Cathy Shipton.Barber, Richard (13 July 2005). I'd rather be single than go out with a loser; TV'S LESLEY DUNLOP ON FINDING LOVE AFTER 40, Daily Mirror, Retrieved 28 November 2012 His brother is the former actor Dominic Guard and he is a cousin of actress Pippa Guard. He is the son of actor Philip Guard and actress Charlotte Mitchell.| Online biography of Philip Guard and Charlotte Mitchell"]}, {"page": "Fatal Consequences (The Bill)", "response": ["* Liz Clough - Cathy Shipton"]}, {"page": "Inside Soap Awards", "response": ["| Cathy Shipton (Lisa \"Duffy\" Duffin, Casualty)"]}, {"page": "Characters of Casualty", "response": ["Ash joined the hospital as a staff nurse and was promoted to senior staff nurse in series 7. When Lisa \"Duffy\" Duffin (Cathy Shipton) left the hospital, Ash became a charge nurse later on. He was suspended from the hospital when a racist thug that threatened him with a knife accuses him of assault, but was acquitted when Matt Hawley (Jason Merrells) admits he overheard the man threatening Ash. Ash continued his role of charge nurse until his departure. Ash returned to the ED in 2013 as a locum consultant, who was eventually given a permanent place within the hospital.", "Lisa \"Duffy\" Duffin, played by Cathy Shipton, is one of the show's original characters and is a senior ward sister and senior midwife. Shipton revealed in 2016 that upon receiving the job, she was \"flying about, doing the job, learning and lines and trying not to bump into the furniture\". Shipton revealed that \"in the early days\" of appearing on the show, many young children would recognise her in the supermarket because of her portrayal of Duffy. She also stated that a nurse working on the show told her that she became a nurse because of her portrayal of the character. Shipton remained on the show until December 1993, but returned for a guest appearance in February 1998. She reprised her role permanently in September 1998, but left the role for the second time in April 2003. Shipton made various guest appearances from September 2006.", "Jan Jenning, portrayed by Di Botcher, made her first appearance on 19 May 2018. The character and Botcher's casting details were first published in a TV Times interview with Lucy Raffety. Jan is a paramedic and operational duty manager, who takes control of the Holby Ambulance Service. Sophie Dainty of Digital Spy billed Jan as \"bold, brash and bossy\", which makes her clash with her colleagues, especially paramedics Iain Dean (Michael Stevenson) and Sam Nicholls (Charlotte Salt). Raffety joked that Jan would \"read them the riot act and whip them into shape\". Despite her assertive personality, Jan always protects the people on her team. Her backstory states that she is already friends with nurse Lisa \"Duffy\" Duffin (Cathy Shipton). On the character, Dainty commented, \"Give this one a go, she'll grow on you.\"", "In her first episode, Louise fell out with the paramedic duty manager, Dixie Dixon (Jane Hazlegrove) and when she returned as a receptionist, it was shown that they had still fallen out but episodes later, Louise had to get details of a patient who was in resus however, she was scared of going in because of the blood. Dixie noticed this and helped her overcome this fear. Louise and Dixie then became friends. Louise became 'frenemies' with Big Mac (Charles Dale) and Noel and was often to be found in argument with them. She also helped Noel when he was left homeless and was support for Big Mac when he was held hostage by Iain's unstable army colleague, Kenny. In July 2015, it is revealed that Louise has history with new senior staff nurse Jacob Masters (Charles Venn), but asks that he does not reveal their past. It is later discovered that Louise was previously a nurse, but left the role. In August, original character Lisa \"Duffy\" Duffin (Cathy Shipton) makes a two-episode appearance, having previously appeared in the show for twelve years. Duffy inspires Louise to become a nurse again, a post she returns to. When Duffy returned to the ED full-time in August, it was revealed that Louise had been mentored by Duffy.", "Ciaran is also incorporated into senior nurse Duffy's (Cathy Shipton) dementia story when he questions her capability. Warden pointed out that Ciaran is concerned about her living with dementia and having a senior position in the ED. Shipton told Alice Penwill of Inside Soap that Ciaran is a \"box-ticker\" and Duffy's dementia status is an issue. His concerns leads to Duffy resigning from her job. Duffy then begins a non-clinical role, but is involved in an incident with Connie, who blames her. Ciaran believes that Duffy is innocent, but needs her to be a witness against Connie. Warden thought that the scenes were \"sensitive [and] nuanced\"."]}, {"page": "List of longest-serving soap opera actors", "response": ["|Cathy Shipton || Lisa \"Duffy\" Duffin || Casualty || 1986–1993, 1998–2003, 2006, 2015, 2016–2020 ||  years ||"]}, {"page": "Patrick Spiller", "response": ["Patrick arrives at Holby City Hospital as the emergency department's new senior registrar. He discovers he is working alongside SHO Holly Miles (Sandra Huggett), who he previously dated. In an attempt to get to know Holly again, he asks her out for a drink on her birthday, but she turns him down. Patrick has an arrogant attitude, which leads to staff nurse Lisa Duffin (Cathy Shipton) reprimanding him, and sees him invited to work a shift with the paramedics after dismissing their importance."]}, {"page": "Holby City (series 2)", "response": ["*Cathy Shipton as Lisa 'Duffy' Duffin (episode 5)"]}, {"page": "Casualty (series 1)", "response": ["*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 2)", "response": ["The second series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The majority of the cast from the previous series continue to appear in this series. Bernard Gallagher portrayed emergency medicine consultant Ewart Plimmer. Derek Thompson appeared as charge nurse Charlie Fairhead, whilst Cathy Shipton starred as staff nurse Lisa \"Duffy\" Duffin. Brenda Fricker played state enrolled nurse Megan Roach. Lisa Bowerman and Robert Pugh portrayed paramedics Sandra Mute and Andrew Ponting. Debbie Roza starred as receptionist Susie Mercier while Christopher Rozycki appeared as porter Kuba Trzcinski. Nigel Anthony and Sonia Woolley also appear as Ted Roach and Ros Plimmer in a recurring capacity. ", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 3)", "response": ["The third series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 8 roles with star billing. Bernard Gallagher portrayed emergency medicine consultant Ewart Plimmer. Derek Thompson appeared as charge nurse Charlie Fairhead, whilst Brenda Fricker played state enrolled nurse Megan Roach. Cathy Shipton and Eddie Nestor starred as staff nurses Lisa \"Duffy\" Duffin and Cyril James. Ella Wilder and Geoffrey Leesley portrayed paramedics Shirley Franklin and Keith Cotterill. Christopher Rozycki portrayed porter Kuba Trzcinski. Brian Capron also appeared in two episodes as locum emergency medicine medical registrar Peter.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 4)", "response": ["The fourth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 6 roles with star billing. Derek Thompson continues his role as charge nurse Charlie Fairhead, while Brenda Fricker plays state enrolled nurse Megan Roach. Cathy Shipton stars as sister Lisa \"Duffy\" Duffin, and Eddie Nestor appears as staff nurse Cyril James. Geoffrey Leesley portrays paramedic Keith Cotterill, and Susan Franklyn appears as administrator Valerie Sinclair.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 6)", "response": ["The sixth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 8 roles with star billing. Nigel Le Vaillant appears as specialist registrar and later, emergency medicine consultant Julian Chapman, while Mamta Kaash plays senior house officer Beth Ramanee. Derek Thompson continues his role as charge nurse Charlie Fairhead, and Cathy Shipton stars as sister Lisa \"Duffy\" Duffin. Patrick Robinson appears as staff nurse Martin \"Ash\" Ashford, while Ian Bleasdale and Caroline Webster portray paramedics Josh Griffiths and Jane Scott. Robson Green continues to portray porter Jimmy Powell.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 5)", "response": ["The fifth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 6 roles with star billing. Derek Thompson continues his role as charge nurse Charlie Fairhead, Cathy Shipton stars as sister Lisa \"Duffy\" Duffin, and Brenda Fricker appears as state enrolled nurse Megan Roach. Geoffrey Leesley and Ian Bleasdale portrays paramedics Keith Cotterill and Josh Griffiths, while Robson Green plays porter Jimmy Powell.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 7)", "response": ["The seventh series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 8 roles with star billing. Nigel Le Vaillant stars as emergency medicine consultant Julian Chapman. Derek Thompson continues his role as charge nurse Charlie Fairhead, while Cathy Shipton plays sister Lisa \"Duffy\" Duffin. Patrick Robinson and Maureen Beattie appear as staff nurses Martin \"Ash\" Ashford and Sandra Nicholl. Ian Bleasdale and Caroline Webster portray paramedics Josh Griffiths and Jane Scott. Anne Kristen continues to portray receptionist Norma Sullivan. Additional cast who appear in a recurring capacity included Imogen Boorman, Nicola Jefferies and Ken Sharrock who portray Ash's girlfriend Nikki Wyatt, receptionist Jenny and Maxine's dad Kevin Price respectively.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 8)", "response": ["The eighth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 7 roles with star billing. Clive Mantle starred as emergency medicine consultant Mike Barratt. Derek Thompson continued his role as charge nurse Charlie Fairhead. Cathy Shipton and Patrick Robinson appeared as staff nurses Lisa \"Duffy\" Duffin and Martin \"Ash\" Ashford. Ian Bleasdale portrayed paramedic Josh Griffiths while Caroline Webster starred as paramedic and later, general manager Jane Scott. Anne Kristen continued to appear as receptionist Norma Sullivan. Jo Unwin appeared in two episodes as paramedic Lucy Cooper, before joining the recurring cast in episode twenty. Brian Miller appeared in two episodes as Norma's husband, Chris Sullivan. David Ryall also appeared in four episodes as locum emergency medicine consultant Tom Harley.", "*Cathy Shipton as Lisa \"Duffy\" Duffin (until episode 13)"]}, {"page": "Casualty (series 12)", "response": ["The series' opening episode saw the introduction of six new characters: general manager Elliot Matthews (Peter Guinness); senior house officer Georgina \"George\" Woodman (Rebecca Lacey); senior staff nurse Mark Grace (Paterson Joseph); staff nurse Tina Seabrook (Claire Goose); receptionist Amy Howard (Rebecca Wheatley); and porter Derek \"Sunny\" Sunderland (Vincenzo Pellegrino). Barbara Marten also joined the cast in episode thirteen as senior staff nurse (later, sister) Eve Montgomery. Donna Alexander returned to the cast as paramedic Penny Hutchens, now a regular cast member following guest appearances in the previous series. Patrick Robinson, Brenda Fricker, Cathy Shipton and Clive Mantle reprised their roles as Martin \"Ash\" Ashford, Megan Roach, Lisa \"Duffy\" Duffin and Mike Barratt for the two-part season finale which saw Charlie and Baz marry. Six cast members departed throughout this series: Cusack, Birch and Devaney departed in episodes ten, eleven and twelve respectively; and Watson, O'Brien and Guinness left at the conclusion of the series.", "*Cathy Shipton as Lisa \"Duffy\" Duffin (episodes 25−26)"]}, {"page": "Casualty (series 13)", "response": ["Episode one featured four new cast members: Robert Gwilym (clinical director and emergency medicine consultant Max Gallagher); Gerald Kyd (senior house officer Sean Maddox); Jan Anderson (staff nurse Chloe Hill); and Pal Aron (bed manager Adam Osman). Susan Cookson also made her first appearance as recurring character, nurse Julie Day in episode one. Following a guest stint at the end of the previous series, Cathy Shipton reprised her role as original character Lisa \"Duffy\" Duffin in episode four. Duffy returned as an agency nurse, but was later invited to join the team as a senior staff nurse. Joseph decided to leave the series in 1998; Mark Grace departed in episode 18. Lacey also chose to leave the series and her character, George Woodman, left at the conclusion of the series.", "*Cathy Shipton as Lisa \"Duffy\" Duffin (from episode 4)"]}, {"page": "Casualty (series 14)", "response": ["The fourteenth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series begins with 13 roles receiving star billing, which is an increase from the previous series. Robert Gwilym stars as emergency medicine consultant and clinical director Max Gallagher and Gerald Kyd appears as senior house officer Sean Maddox. Derek Thompson continues his role as charge nurse Charlie Fairhead while Barbara Marten portrays sister Eve Montgomery. Cathy Shipton features as Lisa \"Duffy\" Duffin, a senior staff nurse who is promoted to sister. Jan Anderson, Claire Goose and Jonathan Kerrigan star as staff nurses Chloe Hill, Tina Seabrook and Sam Colloby. Pal Aron appears as bed manager Adam Osman, who is later hired as a staff nurse. Ian Bleasdale and Donna Alexander portray paramedics Josh Griffiths and Penny Hutchens. Rebecca Wheatley stars her role as Amy Howard and Vincenzo Pellegrino features as Derek \"Sunny\" Sunderland. Susan Cookson also continues her semi-regular role as nurse Julie Day.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 15)", "response": ["*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 16)", "response": ["*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Casualty (series 17)", "response": ["*Cathy Shipton as Lisa \"Duffy\" Duffin (until episode 31)"]}, {"page": "Casualty (series 21)", "response": ["*Cathy Shipton as Lisa \"Duffy\" Duffin (episodes 1−2)"]}, {"page": "Coloma Convent Girls' School", "response": ["* Cathy Shipton, actress who played Duffy in Casualty"]}, {"page": "Casualty (series 30)", "response": ["Cathy Shipton guest starred as original character Lisa \"Duffy\" Duffin in the two-part series opener. Her guest return was announced on 24 August 2015, with Shipton commenting, \"I was surprised and delighted to be asked to recreate the role of 'Duffy' to launch the 30th series – especially as Paul Unwin, one of the original creators, was not only writing but also directing.\" Shipton's permanent return to the series was announced on 7 June 2016, with Kent commenting, \"All of us at Casualty are incredibly excited that the fabulous Cathy Shipton has agreed to bring Duffy back to the Emergency Department.\" Duffy was confirmed to make a guest appearance in episode thirty-nine, the show's thousandth episode, before returning permanently in the following series. Mark Letheren made a guest appearance in episode four as counsellor Ben Harding, a role he has played on-off since 2007. Sarah Jayne Dunn, who appeared for five months in the previous series, made a cameo appearance in episode seven as Cal's ex-girlfriend Taylor Ashbie, before making a more prominent appearance in the red-button episode which followed the episode, entitled \"On Call\". Guy Henry, who appears regularly in Holby City as the hospital's chief executive officer Henrik Hanssen made three guest appearances throughout the series: episode nineteen, episode thirty-four, and episode thirty-five. Henry previously appeared in several episodes in 2011. Tom Chambers made two guest appearances as his Holby City character Sam Strachan in episodes twenty-three and twenty-four, whilst Emily Carey returned in the role of Grace Beauchamp in a storyline which reunited Sam with Connie, his former partner and Grace's mother. Rosie Marcel made a guest appearance as her Holby City character Jac Naylor in episode twenty-three.", "* Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "2016 in British television", "response": ["|BBC One airs the 1000th episode of Casualty. The episode sees the return of one of the original cast members when Cathy Shipton reprises her role as Lisa Duffin."]}, {"page": "Casualty (series 31)", "response": ["It was announced on 7 June 2016 that, following three guest appearances in the previous series, Cathy Shipton had returned to the show as a regular cast member. Her character, Lisa \"Duffy\" Duffin, who appeared in the show across various stints since its inception, returned in the opening episode of the series. Of Shipton's return, Kent said, \"All of us at Casualty are incredibly excited that the fabulous Cathy Shipton has agreed to bring Duffy back to the Emergency Department.\" Arthur made his final appearance in episode 9 when his character Glen Thomas jilts his fiancée, Robyn Miller (Henderson). Tom Chambers guest appeared in episode 3 as Sam Strachan, Grace's father, following two appearances in the previous series. Chambers was a regular cast member in the show's spin-off show, Holby City, between 2006 and 2008. Hossington announced that Sam would be reintroduced to the series after receiving a job as the hospital's medical director. Sam returned in episode 24. Chambers later revealed that he would be leaving at the end of his contract due to a prior commitment. It was announced on 7 February 2017 that the show had filmed a funeral for a regular character, and episode 33 featured the death of Cal Knight (Winsor) after he was stabbed by a white supremacist who blamed Ethan for his father's death. Winsor decided to leave the series of his own accord, but was initially surprised to discover his character would be killed off, before coming round to the idea.", "* Cathy Shipton as Lisa \"Duffy\" Duffin "]}, {"page": "Too Old for This Shift", "response": ["Several actors who have previously appeared on Casualty during its thirty years on air made a cameo appearance during the special, while Ian Bleasdale reprised his role as Josh Griffiths for the entirety of the episode. The episode also marked the return of Cathy Shipton in her role of Lisa \"Duffy\" Duffin, following her guest appearances in the thirtieth series. The special also featured character crossovers from sister show Holby City, with Jac Naylor (Rosie Marcel), Henrik Hanssen (Guy Henry) and Adrian \"Fletch\" Fletcher (Alex Walkinshaw) appearing in the episode. The episode was watched by 7.20 million viewers and received mixed reviews. Fans of the show praised the episode and demanded it receive an award. Sharon Marshall of The Daily Mirror enjoyed the episode and believed it \"showcased what Casualty does best\", while Midlands Air Ambulance Charity branded the episode as \"insensitive\". On 6 November 2017, the helicopter crash won the \"Best Drama Storyline\" accolade at the Inside Soap Awards.", "*Lisa \"Duffy\" Duffin – Cathy Shipton", "* The episode marked the permanent return of Cathy Shipton to the show, reprising her role as original nurse Lisa \"Duffy\" Duffin, following her guest appearances in the previous series, while Ian Bleasdale made a guest appearance throughout the episode, reprising his role as former paramedic Josh Griffiths. Three Holby City actors also performed as their characters for the special, their appearances announced on 28 June 2016 – these were Rosie Marcel as consultant cardiothoracic surgeon, Jac Naylor, Guy Henry as chief executive officer Holby City NHS Trust and consultant general surgeon, Henrik Hanssen, and Alex Walkinshaw as ward manager and former Casualty character, Adrian Fletcher."]}, {"page": "Abs Denham", "response": ["The show planned two special episodes set in Cambodia to commemorate Casualty's twentieth anniversary. Redmond was one of five cast members who travelled to the country to film the episodes. In the storyline the team go to help Lisa Duffin (Cathy Shipton) on a medical mission. The cast filmed on various locations around the country. Martina Laird (who plays Comfort Jones) told Steve Hendry from the Sunday Mail that they had to work in \"extreme conditions\" where facilities were rather sparse. They also had to contend with high temperatures. It was also the rainy season and on one occasion they had to be evacuated after their location became a flood risk. The crew needed to cram in as much filming during daylight hours as possible. This meant 4.30 AM starts, first attending hair and make up and then going to the location shoots with long days on set."]}, {"page": "Duffy (Casualty)", "response": ["Lisa \"Duffy\" Duffin is a fictional character from the BBC medical drama Casualty, played by Cathy Shipton. Duffy was created by Jeremy Brock and Paul Unwin as one of the serial's ten original characters. Shipton received her audition just as she was thinking of giving up her acting career. She thought her chances of being cast were slim, as she had on bandages following a fall, however, producer Geraint Morris was fascinated by the incident and asked her about her time in the hospital. Shipton was initially considered for the role of receptionist Susie Mercier, before being cast as Duffy. She made her debut in the pilot episode of the first series, broadcast on 6 September 1986.", "Duffy is one of ten original characters conceived by the creators of Casualty Jeremy Brock and Paul Unwin. Cathy Shipton was working as an aerobics instructor and thinking of giving up her acting career when she received an audition for the show. The audition for the role was held on 11 January 1986. Not wanting to appear in her instructor's outfit, she borrowed some clothes and ran across London to get to the audition on time. Shipton had been teaching an aerobics class the day prior to the audition and fell over. She went to an accident and emergency department where they treated her for a sprained ankle and placed bandages on her. The actress was convinced that this would ruin her chances with casting directors. But Casualty producer Geraint Morris was fascinated by the incident and quizzed Shipton about her time at the hospital. She explained that an angry nurse had treated her and acted out part of the procedure. This intrigued Morris and his team of writers who decided to hire her.Kingsley 1995, p.74.", "A reporter for The Daily Telegraph named Duffy as one of the 10 best Casualty characters. They said, \"Reliable, super-efficient Duffy (Cathy Shipton) featured in the original cast when the medical drama launched in 1986 and is one of Casualty's most iconic and longest-serving characters\". The Western Mail's Madelein Brindley branded Duffy \"a stalwart\" of Casualty, and wrote \"regarded as the mother of A&E she was both caring when needed but not afraid to be strict when necessary.\" Sharon Marshall writing for the Daily Mirror praised Shipton, Thompson and Bleasdale's \"sterling performance\" during the 30th anniversary episode. She added that one particular scene with all three made her cry, adding that it was like \"saluting our NHS heroes\"."]}, {"page": "Tina Seabrook", "response": ["Duffy (Cathy Shipton) informs Tina that Chloe is having an abortion, and Tina offers to drive Chloe to the hospital. Tina also begins talking to Sean again. She takes part in a charity parachute jump with consultant Max Gallagher (Robert Gwilym). They kiss and begin a relationship, but have trouble telling Sean. He later walks in on them kissing and the men fight. Tina realises she still has feelings for Sean, but struggles to tell Max because he is grieving for his son, so she dates them both. Tina learns Sean is leaving for Australia and she races to the train station, where she finds Sean and asks him to marry her. Tina decides to leave Holby to be with Sean. She flies to Alice Springs and meets Byron (John Gibson), who tells her Sean is working with his daughter Katie (Maya Stange). On the way to meet him, Byron blacks out and crashes the car. Tina goes in search of help and collapses due to dehydration. Sean and Katie find Byron and later Tina. Sean proposes and Tina accepts. She calls the hospital and apologises to Max, who tells the staff Sean and Tina are getting married."]}, {"page": "One (Casualty)", "response": ["\"One\" is the thirty-first series finale of the British medical drama television series Casualty and the 1,049th episode of the overall series. The episode is written by Paul Unwin, the show's co-creator, and directed by Jon Sen. It premiered on BBC One and BBC One HD on 29 July 2017. \"One\" is a fly on the wall episode following an hour in Holby City Hospital's emergency department (ED) with additional focus on sister Lisa \"Duffy\" Duffin (Cathy Shipton) mentoring two work experience girls and paramedic Jez Andrews (Lloyd Everitt) grieving the death of a baby.", "Jez and Iain drive to the emergency department; they encounter a male who has come off his motorbike after colliding with a car. They request another ambulance and continue to the ED. As the pair arrive, sister Lisa \"Duffy\" Duffin (Cathy Shipton) greets two schoolgirls: Diamond Whittaker (Georgia Sandle) and Chloe Robinson (Kassius Nelson). Duffy is tasked with acting as Diamond and Chloe's mentor.", "\"One\" is a fly-on-the-wall episode exploring life at the emergency department (ED) of Holby City Hospital, the setting for Casualty. Specifically, the episode focuses on Sister Lisa \"Duffy\" Duffin (Cathy Shipton) mentoring two girls, Chloe (Kassius Nelson) and Diamond (Georgia Sandle), who are on work experience in the ED as they decide whether to pursue a career in medicine. Duncan Lindsay, writing for the Metro, reported that the events of the episode would challenge Duffy both \"emotionally and professionally\". The episode sees an increased focus on the ED's nursing staff, which Shipton described as \"a lovely echo back to the show's origins\". She liked the additional focus since the nurses \"soak everything up in emergencies\". Shipton felt \"One\" reflects original Casualty producer Geraint Morris' aim to portray nurses as being at the front of emergency departments."]}, {"page": "Casualty (series 32)", "response": ["The thirty-second series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The majority of the cast from the previous series return to this series. Amanda Mealing reprises her role as Connie Beauchamp, clinical lead and consultant in emergency medicine. William Beck and Jaye Griffiths continue as consultants Dylan Keogh and Elle Gardner. George Rainsford portrays specialty registrar Ethan Hardy, who is later promoted to consultant and acting clinical lead, while Crystal Yu plays speciality registrar Lily Chao. Chelsea Halfpenny appears as Alicia Munroe, a doctor undergoing the second year of foundation training and later a specialty registrar in emergency medicine. Charles Venn portrays clinical nurse manager Jacob Masters, who later resigns to become a senior staff nurse, whilst Derek Thompson stars as senior charge nurse and emergency nurse practitioner Charlie Fairhead, who later becomes clinical nurse manager. Cathy Shipton appears as sister, who later becomes senior sister, and senior midwife Lisa \"Duffy\" Duffin, while Amanda Henderson, Azuka Oforka and Jason Durr play staff nurses Robyn Miller, Louise Tyler and David Hide. Michael Stevenson and Lloyd Everitt star as paramedics Iain Dean and Jez Andrews. Tony Marshall and Jamie Davis appear as receptionist Noel Garcia and porter Max Walker respectively. Emily Carey, Lucy Benjamin, Mitch Hewer and Will Austin also appear as Grace Beauchamp-Strachan, Denise Ellisson, Mickey Ellisson and Scott Ellisson in a recurring capacity.", "*Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "List of Casualty specials", "response": ["Casualty has produced 19 special episodes, including the first webisode commissioned for a BBC continuing drama. Belinda Campbell, who executively produced the drama between 2007 and 2011, thought that webisodes would be a \"new [way] to add value for our loyal fans\", something which the team constantly look to do. Casualty filmed a sketch for charity telethon Children in Need in 2009, featuring charity mascot Pudsey Bear. In 2010, cast members on the show filmed a tribute to BBC soap opera EastEnders and Blue Peter presenter Joel Defries presented a segment of the show from the Casualty set. To celebrate Casualty thirtieth anniversary, original cast members Derek Thompson and Cathy Shipton filmed a special episode, \"Back to Ours\", showing moments from their careers on the show.", "\"Back to Ours\" is an online special which coincides with the show celebrating 30 years in production. Back to Ours, a concept based on Gogglebox and first adopted by EastEnders, features actors Derek Thompson (Charlie Fairhead) and Cathy Shipton (Lisa \"Duffy\" Duffin) watching a selection of their \"most memorable scenes\". The special was announced on 18 August 2016 and was released two days later. In the special, the actors discuss Casualty being debated in the House of Commons as well as Hollywood actress Kate Winslet's guest appearance in 1993."]}, {"page": "Casualty (series 33)", "response": ["The thirty-third series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The majority of the cast from the previous series continue to appear in this series. Amanda Mealing appears as clinical lead and consultant in emergency medicine Connie Beauchamp, while William Beck, George Rainsford and Jaye Griffiths portray consultants Dylan Keogh, Ethan Hardy, and Elle Gardner respectively. Chelsea Halfpenny portrays specialty registrar Alicia Munroe, who later specialises in pediatric emergency medicine. Neet Mohan appears as F1 doctor Rash Masum, while Derek Thompson stars as Charlie Fairhead, the clinical nurse manager, senior charge nurse and emergency nurse practitioner. Cathy Shipton appears as Lisa \"Duffy\" Duffin, a sister and midwife. Charles Venn portrays senior staff nurse Jacob Masters, while Azuka Oforka features as staff nurse Louise Tyler, who is later promoted to senior staff nurse. Amanda Henderson and Jason Durr play staff nurses Robyn Miller and David Hide. Charlotte Salt, Michael Stevenson and Maddy Hill portray paramedics Sam Nicholls, Iain Dean, and Ruby Spark respectively. Tony Marshall stars as receptionist Noel Garcia. Additionally, four cast members feature on the series in a recurring capacity: Rebecca Ryan features as porter Gemma Dean; Kai Thorne portrays Blake Gardner; Joe Gaminara appears as F1 doctor Eddie McAllister; and Di Botcher plays operational duty manager and paramedic Jan Jenning.", "* Cathy Shipton as Lisa \"Duffy\" Duffin"]}, {"page": "Timeline of BBC One", "response": ["*25 June – BBC One airs the 1000th episode of Casualty. The episode sees the return of one of the original cast members when Cathy Shipton reprises her role as Lisa Duffin."]}]}}