{"wiki_id": "http://www.wikidata.org/entity/Q5052020", "itemLabel": "Cathal Breslin", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Cathal_Breslin", "wikipedia_page": {"main": "Cathal Breslin is a concert pianist originally from Derry, Northern Ireland, now living in Phoenix, Arizona in the United States. He has performed extensively in solo recitals, as a concerto soloist with orchestra and a chamber musician in major concert halls throughout Europe, North America, South America and Asia. \nHe is currently Associate Professor of Piano at the Arizona State University School of Music, Dance and Theatre in the Herberger Institute for Design and the Arts in the United States. He is an exclusive Yamaha Performing Artist.\nIn 2008 he founded the Walled City Music Festival with his wife, American flautist Dr. Sabrina Hu. It has featured artists such as the Kronos Quartet, Bang on a Can All Stars, BBC Ulster Orchestra, Sir James Galway, Katia and Marielle Labèque, Augustin Dumay, Anne Akiko Meyers, Dmitry Sitkovetsky, Jan Vogler, Raphael Wallfisch, Jeffrey Zeigler, Jonathan Lemalu, Brodsky Quartet, Fitzwilliam Quartet, Houston Winds, Jeremy Denk, Awadagin Pratt, Kirill Troussov, among many others.He has performed concertos as soloist with many orchestras internationally, including the Turin Philharmonic in Italy, Greensboro Symphony in North Carolina, National Symphony Orchestra of Ireland, Jackson Symphony Orchestra in TN, Arizona MusicFest Chamber Players, Ulster Orchestra, Camerata Ireland, RTÉ Concert Orchestra and the National Youth Orchestra of Ireland, and with conductors such as Vladimir Altschuler, Barry Douglas, Christian Gansch, Giovanni Battista Rigon, Dmitry Sitkovetsky, Niklas Willén, Stephen Bell, David Brophy, Gearóid Grant, Robert Houlihan, Courtney Lewis, Peter Shannon, Matthew Coorey, and Robert Moody.\nVenues of his solo recitals include Carnegie Hall, Wigmore Hall in London, National Centre for the Performing Arts (China) in Beijing, Tianjin Grand Theatre, Ateneo de Madrid, Palácio Foz in Lisbon, Zala Bulgaria in Sofia, Chopin Society in Warsaw, National Concert Hall in Dublin, Kumho Art Hall in Seoul, Peking University in Beijing, Central Conservatory of Music in Beijing, and major concert halls in Ningbo, Qingdao, Chongqing, Nanjing, Suzhou in China, Tokyo and Hamamatsu in Japan, and many venues in Hong Kong. He has played duo recitals with flutist Sir James Galway, violinists Augustin Dumay, Anne Akiko Meyers, Dmitry Sitkovetsky, Kirill Troussov, cellists Jan Vogler, Raphael Wallfisch and Jeffrey Zeigler, oboist Nicholas Daniel, and chamber music with the Brodsky Quartet, Houston Winds, and the Coull Quartet. As a member of the flute-cello-piano trio, Trio Festivale, along with Dr. Sabrina Hu (flute), Gerald Peregrine (cello), he commissions new works and tours internationally on a regular basis.\nHis competition wins have included at the 2007 Viotti International Piano Competition in Vercelli/ Milan, Italy, at the 2007 Iowa International Piano Competition in the U.S., at the 2004 Carlet International Piano Competition in Valencia, Spain, and at the 2004 Grand Konzerteum International Piano Competition in Athens, Greece, and the 2003 AXA Dublin International Piano Competition, at which he won the Brennan prize and the John Field prize.His live performances have been broadcast on BBC Radio 3 (including on the \"In Tune\" and \"Recital\" programs), BBC Radio Ulster, RTÉ Ireland, RTHK Hong Kong, RTVE Spain, and on television in Japan, China, Hong Kong, Spain and Ireland. He recorded extensively for the European Broadcasting Union, solo sonatas for the Mozart Project 2006 and the Takemitsu Riverrun Piano Concerto with the RTÉ Concert Orchestra for the Poets and Literature Series 2010. These recordings have been broadcast worldwide throughout the EBU network. In addition, CD releases have included the complete piano works of Philip Hammond, and Sean O'Riada's Nomos for piano and orchestra, recorded as soloist with the National Symphony Orchestra of Ireland, and a recent solo album entitled \"Mirage\" released on Blue Griffin Records.He was educated at the Royal College of Music in London with John Barstow (1997–2001), receiving a BMus (Hons) Degree with Distinction. From 2001 to 2003 he studied at the Royal Northern College of Music in Manchester with Kathryn Stott, Benjamin Frith and Alexander Melnikov, graduating with a Masters of Music (MM) with Distinction, Postgraduate Diploma (PGDip) and Professional Performance Diploma(PPRNCM). From 2003 to 2005 he was at the Real Conservatorio Superior de Musica de Madrid with Joaquín Soriano.  From 2005 until 2008 he was a teaching assistant at the University of Michigan as a Fulbright Scholar, graduating with a Doctor of Musical Arts Degree in Piano Performance, studying with Arthur Greene. For three years he was visiting faculty in piano performance, collaborative piano, and chamber music at the National University of Ireland at Maynooth and at the Queen's University in Belfast.  From 2013 to 2019, he was an Assistant Professor of Piano and Director of Piano Studies at the University of Memphis in Tennessee. In 2019, he began teaching at Arizona State University (ASU) School of Music, Dance and Theatre, where he is an Associate Professor of Piano. In recent years, he has become an ambassador and pioneer of Yamaha Disklavier Technology, where he has taught masterclasses and performed recitals throughout the U.S., China and Korea. in 2020, he successfully initiated the first historic 4-way connection between 4 cities in the U.S. and China, between Tempe AZ, Beijing, Wuhan and Nanjing.\n\n", "link_mentions": [{"page": "Yamaha Artist", "response": ["* Cathal Breslin"]}, {"page": "Viotti International Music Competition", "response": ["In the fifty years since its inception, thousands of competitors have taken part, many of whom have reached international fame. They include Luigi Alva, Claudio Abbado, Cathal Breslin, Luciano Pavarotti, Mirella Freni, Nicola Martinucci, Salvatore Accardo, Joaquín Achúcarro, Daniel Barenboim, Renato Bruson, Piero Cappuccilli,  Raina Kabaivanska, Sumi Jo, Yeol Eum Son, Jeanne You, Violetta Egorova.", "*3:  Cathal Breslin"]}, {"page": "2006 Valencia International Piano Competition Prize Iturbi", "response": ["|  Yukiko Akagi ||  Orlando Alonso ||  Cathal Breslin ||  Catalina Butcaru ||  Claudio Carbó", "|  Yukiko Akagi ||  Cathal Breslin ||  Claudio Carbó ||  Miguel Ángel Castro ||  Josu de Solaun "]}, {"page": "Cathal", "response": ["*Cathal Breslin (b. 1978), concert pianist from Northern Ireland"]}, {"page": "Breslin", "response": ["* Cathal Breslin, classical pianist from Northern Ireland"]}]}}