{"wiki_id": "http://www.wikidata.org/entity/Q505660", "itemLabel": "Andrew Kennedy Hutchison Boyd", "itemDescription": "British writer and minister", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Kennedy_Hutchison_Boyd", "wikipedia_page": {"main": "Andrew Kennedy Hutchison Boyd (3 November 1825 – 1 March 1899), miscellaneous writer, son of Rev. Dr. Boyd of Glasgow, was originally intended for the English Bar but entered the Church of Scotland, and was minister latterly at St. Andrews.", "link_mentions": [{"page": "St Andrews Cathedral", "response": ["* Andrew Kennedy Hutchison Boyd"]}, {"page": "Timothy McSweeney's Quarterly Concern", "response": ["| align=\"center\" | Winter 2010/11 || \"Timothy McSweeney's Thirty-sixth Issue\"(illustrated \"head\" box containing journal, eight other booklets, four postcards, uncut roll of fortune-cookie fortunes, insert card, and cardboard spacer)  || Letters: Christopher Benz, Steve Delahoyde, Jesse Eisenberg, Marco Kaye, L. E. Leone, Gideon Lewis-Kraus, Mary Miller, Davy Rothbart, Aulden Timmer Contributing writers: Wajahat Ali, Andrew Kennedy Hutchison Boyd, John Brandon, Michael Chabon, Paul Collins, Sophia Cara Frydman, Tim Heidecker, Maggie Lemere, Adam Levin, Ricardo Nuila, Jack Pendarvis (writing as L. P. Eaves), Ismet Prcic, Ishmael Reed, Colm Tóibín, Gregg Turkington, Zoë West Contributing illustrators: Sophia Cara Frydman (Frydman), Ian Huebert (postcards), Daniel Krall (Ali cover), Léon Krier (Chabon), Michael Kupperman (Eaves), Connie Sun (Ali interior) Box illustration: Matt Furie"]}, {"page": "Boyd (surname)", "response": ["*Andrew Kennedy Hutchison Boyd (1825–1899), Scottish writer"]}, {"page": "Andrew Boyd", "response": ["*Andrew Kennedy Hutchison Boyd (1825–1899), Scottish minister and writer"]}, {"page": "George Washington Sprott", "response": ["Sprott graduated with a BA in 1849. He had introductions to the families of Norman Macleod the younger, Andrew Kennedy Hutchison Boyd, and Laurence Lockhart, brother of John Gibson Lockhart."]}, {"page": "A. K. H. Boyd", "response": ["#REDIRECT Andrew Kennedy Hutchison Boyd"]}, {"page": "A.K.H.B.", "response": ["#REDIRECT Andrew Kennedy Hutchison Boyd"]}, {"page": "A. K. H. B.", "response": ["#REDIRECT Andrew Kennedy Hutchison Boyd"]}]}}