{"wiki_id": "http://www.wikidata.org/entity/Q5052698", "itemLabel": "Catherine Gladstone", "itemDescription": "wife of British Prime Minister", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Gladstone", "wikipedia_page": {"main": "Catherine Gladstone (née Glynne; 6 January 1812 – 14 June 1900) was the wife of British statesman William Ewart Gladstone for 59 years, from 1839 until his death in 1898.", "link_mentions": [{"page": "William Ewart Gladstone", "response": ["Sheila Fletcher, ‘Gladstone, Helen (1849–1925)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2006 accessed 10 March 2017 The cause of death is officially recorded as \"Syncope, Senility\". \"Syncope\" meant failure of the heart and \"senility\" in the 19th century was an infirmity of advanced old age, rather than a loss of mental faculties.Matthew, Gladstone. 1875–1898, p. 382, n. ‡. The House of Commons adjourned on the afternoon of Gladstone's death, with A.J. Balfour giving notice for an Address to the Queen praying for a public funeral and a public memorial in Westminster Abbey. The day after, both Houses of Parliament approved the Address and Herbert Gladstone accepted a public funeral on behalf of the Gladstone family.Matthew, Gladstone. 1875–1898, p. 383. His coffin was transported on the London Underground before his state funeral at Westminster Abbey, at which the Prince of Wales (the future King Edward VII) and the Duke of York (the future King George V) acted as pallbearers. His wife, Catherine Gladstone (née Glynne), died two years later on 14 June 1900 and was buried next to him.", "* Near Hawarden in the town of Mancot, there is a small hospital named after Catherine Gladstone. A statue of Gladstone stands prominently in the front grounds of the eponymous Gladstone's Library (formerly known as St. Deiniol's), near the commencement of Gladstone Way at Hawarden."]}, {"page": "Gladstone (disambiguation)", "response": ["*Catherine Gladstone (1812–1900), wife of William Ewart Gladstone"]}, {"page": "Burgess Park", "response": ["The early stages of the expansion of the park led to the incorporation of the North Camberwell Open Space in 1965. That open space included the churchyard of St George's, Camberwell, which had been designed by Francis Bedford in 1824. The churchyard had ceased to be used for burials in 1856. In 1886 it was acquired as a public open space by the Metropolitan Public Gardens Association and laid out as a public garden with funds provided by Viscountess Ossington. Catherine Gladstone opened the garden in 1887. After the churchyard was incorporated into the North Camberwell Open Space, it was re-landscaped in 1966. However, the church closed in 1970 and was allowed to become derelict. When the church was adapted to private housing in 1994, most of the garden was allowed to become a private garden."]}, {"page": "Liverpool Cathedral", "response": ["* Wife of prime minister William Ewart Gladstone Catherine Gladstone, known for founding orphanages and her wit (1812-1900)"]}, {"page": "Hawarden Bridge", "response": ["Hawarden Bridge was designed by the civil engineer C.A. Hobson; he decided to opt for a metal structure, using steel, which was a recent but proven material amongst railway engineers of that era. The bridge was constructed by John Cochrane & Sons Contractors. The construction process took roughly two years and cost around £70,000 to complete. To overcome the challenging conditions of the estuary, the foundations were built using a series of brick-lined wells, a technique mandated by the project’s chief engineer, Frances Fox. The bridge was officially opened to traffic on 3 August 1889; the opening ceremony was officiated by Catherine Gladstone, the wife of Prime Minister William Ewart Gladstone. Reportedly, Gladstone himself had laid the first cylinder in the river in an earlier ceremony to mark the commencement of the bridge’s construction.“Hawarden Bridge.” ‘’shotton-tc.co.uk’’, Retrieved: 30 July 2018."]}, {"page": "Newington Gardens", "response": ["Newington Gardens is located on Harper Road in Southwark, London, England. To the north-west is the Inner London Sessions House, a Crown Court. Its area is . The park occupies part of the site of an old prison that was closed in 1878. The park was opened by Catherine Gladstone, wife of the then prime minister, on 5 May 1884."]}, {"page": "Georgina Battiscombe", "response": ["Her best known books were biographies of the Victorian romantic novelist Charlotte Mary Yonge (1943); Catherine Gladstone, the wife of Prime Minister William Ewart Gladstone (1956); English churchman John Keble (1963); and Alexandra of Denmark (1969). The biography of Keble was awarded the James Tait Black Memorial Prize."]}, {"page": "Spouse of the prime minister of the United Kingdom", "response": ["| 75px|Portrait of Catherine Gladstone", "| data-sort-value=\"Glynne, Catherine\"|Catherine Gladstone()", "| 75px|Portrait of Catherine Gladstone", "| data-sort-value=\"Glynne, Catherine\"|Catherine Gladstone()", "| 75px|Portrait of Catherine Gladstone", "| data-sort-value=\"Glynne, Catherine\"|Catherine Gladstone()", "| 75px|Portrait of Catherine Gladstone", "| data-sort-value=\"Glynne, Catherine\"|Catherine Gladstone()"]}, {"page": "Women's Liberal Federation", "response": ["|Catherine Gladstone"]}, {"page": "1900 in the United Kingdom", "response": ["* 14 June – Catherine Gladstone, widow of Prime Minister W. E. Gladstone and philanthropist (born 1812)"]}, {"page": "HMS Benbow (1885)", "response": ["Benbow was laid down at Thames Iron Work's Blackwall shipyard on 1 November 1882. She was launched by Catherine Gladstone, wife of former Prime Minister  William Gladstone, on 15 June 1885, and was completed in June 1888."]}, {"page": "1900 in Wales", "response": ["* 14 June – Catherine Gladstone (née Glynne), wife of British Prime Minister, William Ewart Gladstone, 88"]}]}}