{"wiki_id": "http://www.wikidata.org/entity/Q5056123", "itemLabel": "Cecil Hickley", "itemDescription": "English admiral and cricketer (1865-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Hickley", "wikipedia_page": {"main": "Admiral Cecil Spencer Hickley,  (22 January 1865 – 1 May 1941) was a career Royal Navy officer who finished as a vice-admiral, promoted to full admiral in retirement in 1925. He also played first-class cricket for Western Province in South Africa in 1890/91 and for Somerset in 1898 and 1899. He was born at Ashcott, Somerset and died in London.", "link_mentions": [{"page": "HMS Vanguard (1909)", "response": ["The ship was recommissioned on 28 March 1912 and rejoined the 1st Division shortly before it was renamed the 1st Battle Squadron on 1 May. She participated in exercises with the 1st Fleet in October. Vanguard was refitted in December, with new bilge keels being installed. On 5 June 1913, Captain Cecil Hickley replaced Ricardo upon the latter's promotion to commodore, second class."]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Cecil Hickley (1898–1899) 5 matches CA"]}, {"page": "HMS Porcupine (1895)", "response": ["In 1896 Porcupine was in reserve at Chatham. She took part in the 1896 British Naval Manoeuvres, attached to the Channel Fleet operation from Milford Haven.Brassey 1897, pp. 141–143, 149. Porcupine undertook a refit at Chatham in late 1899, and was passed into the Fleet Reserve 15 January 1900. The following month she succeeded HMS Cygnet as part of the Medway Instructional Flotilla, taking the latter ship's crew, including Commander Cecil Hickley in command. Lieutenant George Geoffrey Codrington was appointed in command in January 1902, and she paid off at Chatham on 31 July 1902, following which she had her boilers retubed. She took part in the fleet review held at Spithead on 16 August 1902 for the coronation of King Edward VII. In 1910, Porcupine was part of the Sixth Destroyer Flotilla, based at The Nore, still being based at the Nore in 1912. Porcupine ran aground off Clacton on 18 October 1910. Her commanding officer was reprimanded in the resulting Court Martial. On 30 August 1912 the Admiralty directed all destroyers were to be grouped into classes designated by letters based on contract speed and appearance. After 30 September 1913, as a 27-knotter, Porcupine  was assigned to the A class.Gardiner and Gray 1985, p. 18.Manning 1961, pp. 17–18.Dittmar and Colledge 1972, p. 56."]}, {"page": "HMS Cygnet (1898)", "response": ["Cygnet commissioned at Chatham in March 1900 and was assigned to the Harwich Flotilla, Commander Cecil Hickley in command. In 1899–1900 she was part of the Medway instructional Flotilla. In 1900 she cruised to the East Indies with the cruiser  and the destroyers ,  and ."]}, {"page": "Cecil Spencer Hickley", "response": ["#REDIRECT Cecil Hickley"]}, {"page": "Hickley", "response": ["* Cecil Hickley (1865–1941), British Royal Navy officer"]}]}}