{"wiki_id": "http://www.wikidata.org/entity/Q5056351", "itemLabel": "Cecil Weld-Forester, 1st Baron Forester", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Weld-Forester,_1st_Baron_Forester", "wikipedia_page": {"main": "Cecil Weld-Forester, 1st Baron Forester (baptised 7 April 1767 – 23 May 1828) was a Tory British Member of Parliament and later peer.", "link_mentions": [{"page": "Baron Forester", "response": ["*Cecil Weld-Forester, 1st Baron Forester (1767–1828)"]}, {"page": "George Anson (British Army officer, born 1797)", "response": ["Anson married The Hon. Isabella Elizabeth Annabella Weld-Forester, daughter of Cecil Weld-Forester, 1st Baron Forester, and wife Lady Katherine Mary Manners, in 1830. They had three daughters. Isabella survived her husband by only a year and died in December 1858."]}, {"page": "Charles Manners, 4th Duke of Rutland", "response": ["*Lady Katherine Mary Manners (died 1 May 1829), married on 16 June 1800 Cecil Weld-Forester, 1st Baron Forester"]}, {"page": "Orlando Bridgeman, 3rd Earl of Bradford", "response": ["Lord Bradford married the Honourable Selina Weld-Forester, daughter of Cecil Weld-Forester, 1st Baron Forester, on 20 April 1844. They had four children:"]}, {"page": "Robert Carrington, 2nd Baron Carrington", "response": ["He married twice, firstly, in 1822, the Hon. Elizabeth Katherine Weld-Forester (1803–1832), daughter of Cecil Weld-Forester, 1st Baron Forester, and Lady Katherine Mary Manners. They had one daughter. After the death of his first wife (from cholera), he married, secondly, in 1840, the Hon. Charlotte Augusta Annabella Drummond-Willoughby (1815–1879), daughter of Peter Drummond-Burrell, 22nd Baron Willoughby de Eresby, and Lady Sarah Clementina Drummond. They had three sons and two daughters."]}, {"page": "Francis Bridgeman (British Army officer)", "response": ["Bridgeman was the second son of Orlando Bridgeman, 3rd Earl of Bradford.Fox-Davies (1895), p. 123. His mother was Hon. Selina Louisa Forester, the daughter of Cecil Weld-Forester, 1st Baron Forester. Bridgeman was educated in Harrow School and joined afterwards the British Army.Welch (1894), p. 263."]}, {"page": "John Weld-Forester, 2nd Baron Forester", "response": ["Forester, born in Sackville Street, London, was the eldest son of Cecil Weld-Forester, 1st Baron Forester, and Lady Katherine Mary Manners, daughter of Charles Manners, 4th Duke of Rutland.Kidd, Charles, Williamson, David (editors). Debrett's Peerage and Baronetage (1990 edition). New York: St Martin's Press, 1990,  The Prince of Wales, later King George IV, a friend of his father, was godfather.,"]}, {"page": "George Weld-Forester, 3rd Baron Forester", "response": ["Weld-Forester, born at Sackville Street, London was the second son of Cecil Weld-Forester, 1st Baron Forester, and Lady Katherine Mary Manners, daughter of Charles Manners, 4th Duke of Rutland. His elder brother John Weld-Forester, 2nd Baron Forester, was also a Tory politician.thepeerage.com General George Cecil Weld Forester, 3rd Baron Forester of Willey Park  Both the brothers had, as godfather at the same christening, the Prince of Wales, later King George IV, a personal friend of their father.Obituary of the 2nd Baron."]}, {"page": "Orlando Weld-Forester, 4th Baron Forester", "response": ["Weld-Forester was a younger son of Cecil Weld-Forester, 1st Baron Forester, and Lady Katherine Mary Manners. His elder brothers John Weld-Forester, 2nd Baron Forester, and George Weld-Forester, 3rd Baron Forester, were both Tory government ministers."]}, {"page": "William Denison, 1st Earl of Londesborough", "response": ["His paternal grandfather was Henry Conyngham, 1st Marquess Conyngham (his father being the fourth son of the Marquess). His mother was the fourth daughter of Cecil Weld-Forester, 1st Baron Forester, and Lady Katharine Mary Manners (second daughter of Charles Manners, 4th Duke of Rutland)."]}, {"page": "Robert Smith, 1st Baron Carrington", "response": ["| rowspan=2 | Hon. Robert John Smith,later 2nd Baron Carrington || rowspan=2 |  || Married, firstly, Hon. Elizabeth Weld-Forester, daughter of Cecil Weld-Forester, 1st Baron Forester, and Lady Katherine Manners; had issue. || rowspan=2 | The 2nd Baron changed his last name to Carrington by Royal Licence in 1839."]}, {"page": "Anne Stanhope, Countess of Chesterfield", "response": ["Stanhope was born in 1802, the eldest daughter of Cecil Weld-Forester, 1st Baron Forester, M.P., and Lady Katherine Manners, the daughter of Charles Manners, 4th Duke of Rutland. The family home was Willey Park in Shropshire."]}, {"page": "1st Baron Forester", "response": ["#REDIRECT Cecil Weld-Forester, 1st Baron Forester"]}, {"page": "George Stanhope, 7th Earl of Chesterfield", "response": ["Chesterfield was the only son of George Stanhope, 6th Earl of Chesterfield, and the Hon. Anne Elizabeth, daughter of Cecil Weld-Forester, 1st Baron Forester. He was educated at Eton. He played club cricket for I Zingari and for Old Etonians in 1851."]}, {"page": "Weld (name)", "response": ["* Cecil Weld-Forester, 1st Baron Forester (1767-1823), Anglican, Member of Parliament, added Weld name for inheritance"]}, {"page": "Cecil Weld-Forester", "response": ["* Cecil Weld-Forester, 1st Baron Forester (1767–1828), British Member of Parliament and peer"]}, {"page": "Sir Philip Grey Egerton, 12th Baronet", "response": ["His paternal grandparents were Sir Philip Grey Egerton, 10th Baronet and the former Anna Elizabeth Legh.  His grandfather was a Member of Parliament for Chester, South Cheshire, and West Cheshire.  His aunt, Cecily Louisa Grey-Egerton was married to Dunbar Douglas, 6th Earl of Selkirk.  His mother was the eldest daughter of Albert Denison, 1st Baron Londesborough and Hon. Henrietta Maria Forester (fourth daughter of Cecil Weld-Forester, 1st Baron Forester)."]}]}}