{"wiki_id": "http://www.wikidata.org/entity/Q5056292", "itemLabel": "Cecil Raleigh", "itemDescription": "British actor and playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Raleigh", "wikipedia_page": {"main": "Cecil Raleigh was the pseudonym of Abraham Cecil Francis Fothergill Rowlands (27 January 1856 – 10 November 1914, London, England), an English actor and playwright.", "link_mentions": [{"page": "1897 in music", "response": ["* The Yashmak – Adaptation of an Armenian operetta, Leblébidji Horhor, with music by Napoleon Lambelet and libretto by Cecil Raleigh and Seymour Hicks, runs from 31 March 1897 to 31 July 1897 (121 performances) at the Shaftesbury Theatre, London."]}, {"page": "May Whitty", "response": ["|1895-04-15||Fanny||George Robert Sims and Cecil Raleigh||London||Royal Strand||Grace Dormer"]}, {"page": "George Robert Sims", "response": ["His most successful collaboration was with Henry Pettitt, with whom he created a substantial body of hits, including In the Ranks (1883, 457 performances at the Adelphi Theatre) and The Harbour Lights (1885, 513 performances at the Adelphi).  Their Gaiety Theatre musical burlesques included Faust up to Date (1888), which remained a hit for several years and coined a new meaning for the phrase \"up-to-date\", meaning \"abreast\" of the latest styles and facts.Eliot, T. S., Christopher Ricks (ed.) Inventions of the March Hare: Poems 1909–1917, Houghton Mifflin Harcourt (2015), p. 173  Their next hit was Carmen up to Data (1890).  Both of these were composed by the Gaiety's music director, Meyer Lutz.  With Cecil Raleigh, he wrote the hit burlesque opera, Little Christopher Columbus (1893), and among his other musical plays were Blue-eyed Susan at the Prince of Wales Theatre (1892, starring Arthur Roberts) and The Dandy Fifth (Birmingham, 1898) and Dandy Dick Whittington (1895), at the Avenue Theatre, with a score by Ivan Caryll.Adams, William Davenport (1904). A Dictionary of the Drama: a Guide to the Plays, Playwrights, Vol. 1, pp. 374–75, Chatto & Windus  Robert Buchanan and Sims co-authored five melodramas at the Adelphi between 1890 and 1893, including The Trumpet Call (1891), starring Mrs Patrick Campbell early in her career.  On stage, one night, Mrs. Campbell's costume collapsed which, her biographer suggests, extended the run of that play.  Sims and Mrs Campbell had an affair, but she tired of it before he did.Peters, M. (1984). Mrs Pat: the life of Mrs Patrick Campbell, Knopf, p. 92,  In 1896, Sims wrote the melodrama Two Little Vagabonds with Arthur Shirley (an adaptation of Les deux gosses) which was a hit at Princess's Theatre and enjoyed many revivals.  He also co-wrote some pantomimes, including Puss in Boots produced at the Drury Lane Theatre."]}, {"page": "Augustus Harris", "response": ["*The Derby Winner: A new and original sporting and spectacular drama, (Cecil Raleigh and Hamilton) 1894"]}, {"page": "John Halliday (actor)", "response": ["Making his Broadway debut in 1912 in Cecil Raleigh and Henry Hamilton's The Whip, he became a familiar presence there, especially in sophisticated comedies such as W. Somerset Maugham's The Circle (1921), Vincent Lawrence's Sour Grapes (1926), Louis Verneuil's Jealousy (1928) and S. N. Behrman's  Rain from Heaven (1934)."]}, {"page": "Agnes Booth", "response": ["In 1878 she played Madeleine Renaud in the Union Square Theatre's production of A Celebrated Case, the program noting that she had \"kindly undertaken this part in order to strengthen the cast.\" From 1881 to 1891, she was with the Madison Square Company. After 1891, she went to Europe, then returned to the United States where she resided in the artist community of New Rochelle, New York and resumed her work on Broadway in nearby New York City. Booth gained fame for her role in the melodrama The Sporting Duchess (The Derby Winner by Cecil Raleigh) along with fellow actress and New Rochelle neighbor Cora Tanner.New York: A Guide to the Empire State; The Workers of the Writers' Program of the Works Projects Administration in the State of New York, p. 244"]}, {"page": "The Whip (play)", "response": ["The Whip is a melodrama by Henry Hamilton and Cecil Raleigh, first performed in 1909 at the Drury Lane Theatre in London.  The play's original production had intricate scenery and spectacular stage effects, including a horse race and a train crash.  The production would tour overseas and inspire a 1917 film by the same name."]}, {"page": "Lyric Theatre, London", "response": ["Sedger had an early success with his production of Edmond Audran's La cigale, in an English adaptation by F. C. Burnand with additional music by Ivan Caryll; it ran for 423 performances from October 1890.Gaye, p. 1530 Apart from a short season by the celebrated Italian actress Eleonora Duse in her first appearance in Britain,\"Signora Duse at the Lyric Theatre\", The West Australian, 14 August 1893, p. 6 Sedger continued with musical works: The Mountebanks by W. S. Gilbert and Alfred Cellier (1892),Stedman, p. 285 Incognita (1892), an adaptation of Charles Lecocq's Le coeur et la main;Gänzl and Lamb, p. 394 The Magic Opal (1893) by Arthur Law and Isaac Albéniz;Clark, p. 85 The Golden Web (1893) by Stephenson, Frederick Corder and Arthur Goring Thomas;\"The Golden Web\", The Era, 11 February 1893, p. 7 and Little Christopher Columbus (1893) by G. R. Sims, Cecil Raleigh and Caryll.\"Little Christopher Columbus\", The Daily News, 11 October 1893, p. 6 Some of these were critical and artistic successes, but overall they lost money, and Sedger went bankrupt.\"Horace Sedger's Affairs\", The Era, 14 June 1896, p. 6"]}, {"page": "The Yashmak", "response": ["The Yashmak, A Story of the East is a musical play, with a libretto by Cecil Raleigh and Seymour Hicks, adapted from an Armenian operetta, Leblébidji Horhor, which had been a success in 1896 in Constantinople.  The music was composed by Napoleon Lambelet (1864-1932), and additional songs were composed by Leslie Stuart and others.  The Yashmak was first produced at the original Shaftesbury Theatre in London from 31 March 1897 to 31 July 1897, for a run of 121 performances.  Scott Russell, a former leading D'Oyly Carte Opera Company tenor, left the Savoy Theatre to star in the production with Aileen D'Orme,Gänzl, Kurt. \"Cartesians: the little soprano who remade herself... into a star!\", Kurt of Gerolstein, 1 August 2020 who was later replaced by Marguerite Cornille, a music hall star. Kitty Loftus played Dora Selwyn, while Topsy Sinden was principal dancer in the piece.The Era,  4 June 1898, p. 10"]}, {"page": "Little Christopher Columbus", "response": ["Little Christopher Columbus is a burlesque opera in two acts, with music by Ivan Caryll and Gustave Kerker and a libretto by George R. Sims and Cecil Raleigh. It opened on 10 October 1893 at the Lyric Theatre in London and then transferred to Terry's Theatre,Archer, William. The Theatrical World of 1894, p. 302, London: Walter Paternoster (1895) running for a total of 421 performances, which was a very successful run at the time.   May Yohé created the title role, and Furneaux Cook and E. J. Lonnen were in the cast.  Mabel Love, Geraldine Ulmar and Florence St. John joined the cast as replacements."]}, {"page": "The Sunshine Girl", "response": ["The Sunshine Girl is an Edwardian musical comedy in two acts with a book by Paul A. Rubens and Cecil Raleigh, lyrics and music by Rubens and additional lyrics by Arthur Wimperis.  The story involves a working girl who falls in love with the heir to the factory. He is in disguise and wants to be loved for himself, not his position, so he gets his friend to pose as the heir, leading to complications for both men."]}, {"page": "Richard Bennett (actor)", "response": ["| Academy of Music, New YorkWritten by Cecil Raleigh and Henry Hamilton, produced by Charles Frohman", "| Academy of Music, New YorkWritten by Cecil Raleigh, produced by Charles FrohmanCast includes Lionel Barrymore"]}, {"page": "Furneaux Cook", "response": ["After this, Cook continued to act in London for another ten years.  In 1892, he appeared in Gilbert and Cellier's The Mountebanks (Cellier's last opera) as innkeeper Elvino di Pasta.  In 1893, he played in Little Christopher Columbus, a very successful musical burlesque with music by Ivan Caryll and Gustave Kerker and a libretto by George Robert Sims and Cecil Raleigh.  In 1894, Cook was in The House of Lords by Harry Greenbank with music by George Byng (who conducted some of the 1920s recordings of the Gilbert and Sullivan operas) and Ernest Ford.Description of 1894 stage works"]}, {"page": "Dick Whittington and His Cat", "response": ["*1894 at the Theatre Royal, Drury Lane, with a libretto by Cecil Raleigh and Henry Hamilton.  The cast included Ada Blanche as Dick, Dan Leno as Jack the idle apprentice, Herbert Campbell as Eliza the cook and Marie Montrose as Alice.The Times, 27 December 1894, p. 3"]}, {"page": "Henry Hamilton (playwright)", "response": ["His 1897 melodrama, The White Heather, written with Cecil Raleigh, at the Theatre Royal, Drury Lane, achieved success in both London and New York.\"The Theatrical World – The White Heather at Drury Lane\", St James's Gazette, 17 September 1897, p. 12, accessed 15 April 2018, via British Newspaper Archive \"At Gotham's Playhouses\", The Opera Glass, p. 188 (November 1897, Vol. 4, No. 11); and Advertisement, New York Tribune (rightmost column has theatre listings for 30 April 1897 and notes \"last day\" of the play.) It was adapted as an American silent film in 1919.Progressive Silent Film List: The White Heather, SilentEra.com, accessed 20 April 2018 Thereafter he collaborated with Raleigh several times.", "*Dick Whittington and His Cat, a Drury Lane Theatre pantomime version of this tale, co-written with Augustus Harris and Cecil Raleigh, which opened on Boxing Night 1894.\"Dick Whittington at Drury Lane\", St James's Gazette, 27 December 1894, p. 5, accessed 15 April 2018, via British Newspaper Archive "]}, {"page": "Effie Adelaide Rowlands", "response": ["Effie Adelaide Maria Henderson was born about 1858 or 1859 in New South Wales, Australia. She was the illegitimate daughter of the English Alexander Henderson (1828–1886) and Maria Nelson (her parents' marriage wasn't legal, because her father was already married). Her sister Caroline Sidney Henderson (alias Carrie Hope) and her niece Maria Effie Hallatt (alias May Hallatt), were actresses. In 1882 she married Cecil Rowlands, a playwright who used the stage name Cecil Raleigh, and she started to write before they divorced in 1893.  "]}, {"page": "Caroline Hill", "response": ["Hill and her husband were reported as being in London in 1890: \"Miss Hill has been before the public a good many years, and is still young; but it is not every lady of her age on whom nearly a quarter of a century of stage service leaves so insignificant a mark.\" In October 1890 Hill was at the Standard Theatre, New York, in Reckless Temple, by Augustus Thomas, as Mrs Billingsley, where her performance was described as \"something of a disappointment\". She returned to England in the early 1890s when her marriage with Kelcey ended. In 1892, she played Lady Jones in The Guardsman by George R. Sims and Cecil Raleigh at the Court Theatre; a reviewer wrote that she \"doesn't look as if she is out of her teens, plays with great spirit and success as a fashionable society lady\". She remained at that theatre until at least 1893. In 1896 Hill played Dora Thornhaugh in Home at the Haymarket Theatre."]}, {"page": "Shangani Patrol", "response": ["News of the patrol's fate was quickly relayed from Rhodesia to South Africa, and then on to the rest of the British Empire and the world. In England, a patriotic play overtly influenced by the incident, Cheer, Boys, Cheer!, was written by Augustus Harris, Cecil Raleigh and Henry Hamilton, and staged at the Theatre Royal, Drury Lane, starting in September 1895. The show tells the story of a young colonial army officer in South Africa and Rhodesia, culminating in the third act with a fictionalised account of the First Matabele War. This itself climaxes with a scene strongly reminiscent of Wilson's last stand. The production ran for nearly six months in London, and then toured the British provinces for more than two years,; ;  reportedly drawing large crowds. According to historian Neil Parsons, it contributed to the patrol \"fast gain[ing] mythological status\"."]}, {"page": "Jeffreys Lewis", "response": ["and as Muriel in The Sporting Duchess by Sir Augustus Harris, Cecil Raleigh and Henry Hamilton.Six years of drama at the Castle Square theatre: with portraits of the ... By Charles Elwell French (1903)"]}, {"page": "Julian Royce", "response": ["Royce was christened in Chorlton-upon-Medlock. In 1889 he married an actress, Elizabeth Mary Day (\"Nora Day\"). The two toured together in 1891, by which time he had adopted the stage name Julian Royce. They appeared together in 1897 in The New Magdalen, and in 1898 they appeared in Sporting Life, by Seymour Hicks and Cecil Raleigh, at the Shaftesbury Theatre in London, with Royce as the evil Malet de Carteret. In 1898 Nora died, of cancer, aged 40. The next year, Royce married Ivy Herzog, who had been in the cast of Sporting Life. The two then sometimes performed and toured together. In 1900, they travelled to America with Lillie Langtry, and played Sir William and Lady Saumarez in The Degenerates on Broadway. After they returned to Britain, they toured in The Messenger Boy, with Julian as the villainous Pyke. For Charles Frohman, he played the title character in William Gillette's play Sherlock Holmes several times over the next years. He and Herzog also toured with Mrs Patrick Campbell. He returned to Broadway in Detective Sparks (1909), Caste (1910), Passers-by (1911), Declassee (1919–1920) and Death Takes a Holiday, as Duke Lambert (1931)."]}, {"page": "Saba Raleigh", "response": ["thumb|Mrs. Cecil Raleigh, from a 1903 publication.", "Saba Raleigh was the pseudonym of Isabel Pauline Rowlands, née Ellissen (b. 8 August 1862 – d. 22 August 1923), an English actress. On 31 March 1894 she became the second wife of Abraham Cecil Francis Fothergill Rowlands, the actor and playwright Cecil Raleigh, and was often billed as \"Mrs. Cecil Raleigh\".", "* The Two Orphans (1915) billed as Mrs. Cecil Raleigh", "* The Clemenceau Case (1915) billed as Mrs. Cecil Raleigh"]}, {"page": "The Derby Winner", "response": ["The Derby Winner is a 1915 British silent sports drama film directed by Harold M. Shaw and starring Edna Flugrath, Gerald Ames and Mary Dibley.BFI.org It is an adaptation of an 1895 play The Derby Winner by Henry Hamilton, Augustus Harris and Cecil Raleigh."]}, {"page": "Garden Theatre", "response": ["*Little Christopher Columbus (called Little Christopher after March 12, 1894), George R. Sims and Cecil Raleigh, music by Ivan Caryll and Gustave Kerker, October 15, 1894. 208 perfs.", "*Hearts Are Trumps, Cecil Raleigh, February 21, 1900."]}, {"page": "Lyceum Theatre (Park Avenue South)", "response": ["*The Guardsman, George R. Sims and Cecil Raleigh, 4/3/1893."]}, {"page": "Theatre productions of Dan Leno", "response": ["| By Augustus Harris, Cecil Raleigh and Henry Hamilton. Herbert Campbell played the dame called Alice.", "| By Augustus Harris, Cecil Raleigh and Arthur Sturgess.  The lavish production included a carriage drawn by real horses and \"the use of thousands of lights\".Penny Illustrated Paper, 28 December 1895, p. 7Anthony, p. 133"]}, {"page": "Katherine Compton", "response": ["A turning point in Compton's career came in 1885, with the production of her husband's first play (written in collaboration with Cecil Raleigh), The Great Pink Pearl. According to The Times,  \"That play was so successful that Mr Carton, hitherto an actor, was encouraged to devote himself entirely to playwriting. In the part of a Russian Princess Miss Compton gave a foretaste of the great lady, dignified, drily humorous and imperturbable, which was to be her characteristic part in later years\". Thereafter she appeared mainly in plays written by her husband, who wrote leading female roles in his works with her in mind. In the 1880s there was Juno Johnstone in The Treasure, Strand Theatre, 1888. In the 1890s there were  Mrs Bute Curzon in Robin Goodfellow, Garrick Theatre, 1893; Lady Gwendoline in A White Elephant, Comedy Theatre, 1896; and Lady Algy in Lord and Lady Algy, Comedy, 1898. In the last of these her co-star was Charles Hawtrey, and Henry Kemble, Eric Lewis, A. E. Matthews, Frederick Volpe and  Arthur Williams were in the cast.\"Lord and Lady Algy\", The Era, 23 April 1898, p. 15 Her last play of the decade was Carton's Wheels Within Wheels at the Criterion Theatre in 1899."]}, {"page": "The Princess and the Butterfly", "response": ["| Mrs. Cecil Raleigh "]}, {"page": "Kinsey Peile", "response": ["In addition to acting, Peile was a playwright. His works written for the West End included Solomon's Twins, 1897; An Interrupted Honeymoon, 1899; Lyre and Lancet, 1902; The Man Who Was, 1903; Money and the Girl, 1910; Bill, Twelve o'clock, and  The Shooting Star, all 1912; The Pink Nightgown, 1913; and Who Laughs Last, 1919. He wrote the music and lyrics for The Belle of Cairo (1896), a musical comedy with a book by Cecil Raleigh, starring May Yohé and Giulia Warwick.\"The London Theatres\", The Era, 17 October 1896, p. 10 "]}, {"page": "The White Heather", "response": ["The White Heather is a lostThe Library of Congress/FIAF American Silent Feature Film Survival Catalog:The White Heather 1919 American silent drama film directed by Maurice Tourneur and starring Holmes Herbert, Ben Alexander and Ralph Graves. It was based on an 1897  play of the same title by Cecil Raleigh and Henry Hamilton. The future matinee idol John Gilbert appeared in a supporting part."]}, {"page": "Arthur Collins (theatre manager)", "response": ["Following the death of Augustus Harris in 1896, Collins became managing director of the Drury Lane Theatre, a post he held until 1924.Frankau, p. 41 Collins's brother Horace remembered that, after Harris died, Collins had at short notice to raise £1,000 \"with which he took up the option on the lease. He then had to interview the Duke of Bedford's agent. It was the Duke's intention to pull down the historic building and use the site for a new potato market.  There was a loud outcry in the Press against the destruction of the [theatre]. The agent was somewhat diffident about granting a long lease of the theatre to an inexperienced man of thirty-one, but Arthur overcame his objections and, probably impressed by the results of his management under Harris, he advised the Duke to grant Arthur a forty years' lease, which was subsequently extended to eighty.\"Collins, pp. 75–76 The first Drury Lane production under the proprietorship of Arthur Collins was a play called The White Heather, by Cecil Raleigh and Harry Hamilton, Collins, p. 76 for which Collins invited his sister-in-law's sister, the fashion and society writer Eliza Davis, to assist in designing the costumes. She wrote, under her pen name \"Mrs Aria\": \"There were no less than ninety frocks altogether\".Aria, pp. 72–73 "]}, {"page": "Edna Luby", "response": ["Luby was back in New York by 1900 where she made her professional stage debut at the Garden Theatre as a stand-in for actress May Buckley in Hearts Are Trumps that year during its  February to May run. Hearts Are Trumps, a four-act melodrama, was written by Cecil Raleigh, produced by Charles Frohman and had also introduced to Broadway theatergoers a young Cecil B. De Mille. In late 1902 Luby was well received at the Madison Square Theatre, New York after she succeeded Jessie Busley in the rôle of Estelle in The Two Schools.The Two Schools Internet Broadway Database accessed 5.10.13 In December 1903 Luby played Greta opposite Fritzi Scheff in Babette at the Broadway Theatre,Babette Internet Broadway Database accessed 5.10.13  and a subsequent road tour. In May 1907 she joined the cast of the Anna Held hit musical comedy A Parisian Model at the Broadway Theatre.A Parisian Model Internet Broadway Database accessed 5.10.13  and later that year she appeared in the original 1907 Ziegfeld Follies production, playing Miss Mimique and Miss Edna Might.Ziegfeld Follies of 1907  Internet Broadway Database accessed 5.10.13"]}, {"page": "The Whip (1917 film)", "response": ["The Whip is a 1917 American silent drama film directed by Maurice Tourneur that is based on the play of the same name by Henry Hamilton and Cecil Raleigh. The film stars Alma Hanlon, June Elvidge, and Irving Cummings. It also features Bobby Vernon, Wallace Beery, as well as Gloria Swanson in one of her early film roles. The film survives and has been released on DVD.The Whip at silentera.com"]}, {"page": "Adrienne Augarde", "response": ["She next appeared in mid-1906 at the Prince of Wales Theatre in See-See, an Edwardes musical set in China, composed by Sidney Jones with lyrics by Adrian Ross and a book by Charles Brookfield. During the run of the show, Augarde and her aunt Amy appeared in a charity matinée of Trial by Jury at the Theatre Royal, Drury Lane, along with stars such as Rutland Barrington, Henry Lytton, Courtice Pounds and Gertie Millar, with W.S. Gilbert as the Associate.Sardeson, p. 59 Later in 1906, Augarde created the role of the Princess in The New Aladdin, another Edwardes show at the Gaiety Theatre. In 1907 she appeared at the Lyric Theatre in the role of Lady Betty Noel in Tom Taylor's historical drama Clancarty, and later that year, at Drury Lane, Augarde played Gwendolyn Ashley in The Sins of Society by Cecil Raleigh and Henry Hamilton. In 1908, at His Majesty's Theatre, she played Rosa Budd in a stage adaptation of The Mystery of Edwin Drood."]}, {"page": "Raleigh (disambiguation)", "response": ["* Cecil Raleigh (1856–1914), English actor and playwright"]}, {"page": "Best of Friends (disambiguation)", "response": ["*The Best of Friends, a 1902 play by Cecil Raleigh"]}, {"page": "The Whip (1928 film)", "response": ["The Whip is a 1928 American silent drama film directed by Charles Brabin and starring Dorothy Mackaill. It was based on a 1912 play The Whip by Cecil Raleigh and Henry Hamilton and distributed by First National.The Whip on Broadway November 1912 to April 1913; at the Manhattan Opera House This film was a silent released with a Vitaphone soundtrack of music and effects.The AFI Catalog of Feature Films: The Whip It is set in the horse racing world of England."]}, {"page": "Joseph Lyons (caterer)", "response": ["He was an accomplished watercolourist who showed his paintings at the Royal Institution where they were bought by Sir Spencer Wells, surgeon to Queen Victoria, and Admiral Earldey-Wilmot, commander of the Channel Fleet. He also wrote short novels with the dramatist Cecil Raleigh."]}, {"page": "The Sporting Duchess (1920 film)", "response": ["The Sporting Duchess is a lostThe Library of Congress/FIAF American Silent Feature Film Survival Catalog: The Sporting DuchessThe Sporting Duchess; Greta de Groat website 1920 American silent drama film directed by George Terwilliger and starring Alice Joyce. It is based on the 1895 play The Sporting Duchess by Henry Hamilton, Cecil Raleigh, and Augustus Thomas. It was produced and released by the Vitagraph Company of America.Progressive Silent Film List: The Sporting Duchess at silentera.comThe AFI Catalog of Feature Films: The Sporting Duchess"]}]}}