{"wiki_id": "http://www.wikidata.org/entity/Q5056349", "itemLabel": "Cecil Wedgwood", "itemDescription": "English potter", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Wedgwood", "wikipedia_page": {"main": "Major Cecil Wedgwood, DSO (28 March 1863 – 3 July 1916) was a British soldier and partner in the Wedgwood pottery firm. He was the first Mayor of Stoke-on-Trent.Wedgwood was the only son of Godfrey Wedgwood and his first wife Mary Jane Jackson Hawkshaw, (daughter of the great civil engineer Sir John Hawkshaw, and the poet Ann Hawkshaw) who died shortly after he was born.  He was the great-great-grandson of the potter Josiah Wedgwood.Wedgwood became a partner in the firm in 1884 with his uncle Laurence Wedgwood and later his cousin Francis Hamilton Wedgwood. He married Lucie Gibson in 1888, and they had two daughters, one of whom married a brother of the Wedgwood pottery designer Daisy Makeig-Jones;\n\nPhoebe Sylvia Wedgwood (1893–1972) remained unmarried.\nDoris Audrey Wedgwood (1894–1968) married Thomas Geoffrey Rowland Makeig-Jones in 1928.Wedgwood was commissioned a lieutenant in the 4th (Militia) Battalion, North Staffordshire Regiment in 1883. He was promoted to captain on 9 May 1887. The battalion was embodied after the outbreak of the Second Boer War in late 1899, and he left Queenstown for South Africa on the SS Kildonan Castle with other men of the battalion in March 1900. Promoted to major on 12 September 1900, he served as Station Commandant in South Africa. After the end of hostilities he returned home in June 1902, and resigned from his commission the following month. He was awarded the Distinguished Service Order (DSO) in the October 1902 South African Honours list for his services during the war.He was the first Mayor of the Federated County Borough of Stoke-on-Trent in 1910 and 1911.On the outbreak of World War I in 1914 he raised the 7th Battalion, North Staffordshire Regiment.  He was killed at the La Boiselle during the Battle of the Somme in July 1916.  His body was found and identified by James Leather, a 21-year-old bandsman and stretcher bearer.  He is buried at the Bapaume Post Military Cemetery in Albert, Somme.He was succeeded as chairman and managing director of Wedgwood by his cousin Francis Hamilton Wedgwood.", "link_mentions": [{"page": "Stoke-on-Trent", "response": ["Between 1910 and 1928 the Borough, and later, City of Stoke-on-Trent had a Mayor rather than a Lord Mayor.  The first Mayor of Stoke-on-Trent was Cecil Wedgwood of the Wedgwood pottery dynasty."]}, {"page": "List of women who died in childbirth", "response": ["*Mary Jane Jackson Hawkshaw (1863), daughter of Ann And John Hawkshaw and mother of Cecil Wedgwood"]}, {"page": "Cheadle, Staffordshire", "response": ["* Major Cecil Wedgwood (1863–1916), partner in the Wedgwood pottery firm,  Wedgwoodmuseum.org.uk website archive retrieved January 2018 first mayor of Stoke-on-Trent, won the Distinguished Service Order during the Boer War, killed in 1916 during the Battle of the Somme"]}, {"page": "Godfrey Wedgwood", "response": ["He married twice, first to Mary Jane Jackson Hawkshaw (c. 1836-1863) on 24 June 1862 at St. Peter Pimlico, Westminster, Middlesex with whom he had a son Cecil Wedgwood (1863-1916); but she died in 1863 due to complications of the birth of Cecil. And secondly on 14 October 1876 in Marylebone Register Office to his cousin Hope Elizabeth Wedgwood, daughter of Hensleigh Wedgwood. They leased Caverswall Castle in Staffordshire between 1878 and 1888. They had a daughter Mary Euphrasia Wedgwood (1880-1952). Godfrey Wedgwood died at Idlerocks and is buried All Saints Churchyard in Moddershall, Staffordshire."]}, {"page": "Francis Hamilton Wedgwood", "response": ["He became managing director of Wedgwood in 1916 when his cousin Cecil Wedgwood was killed at the Battle of the Somme.  He was also a director of the LMS Railway.  He was High Sheriff of Staffordshire for 1929–30."]}, {"page": "Wedgwood", "response": ["*Major Cecil Wedgwood DSO (1863–1916), son of Godfrey Wedgwood, partner from 1884, first Mayor of the federated County Borough of Stoke-on-Trent (1910–1911), was chairman and managing director of Wedgwood until his death in battle in 1916."]}, {"page": "Daisy Makeig-Jones", "response": ["Makeig-Jones was born in Wath-upon-Dearne near Rotherham, Yorkshire, the eldest of seven children. Her father, K. Geoffrey Makeig-Jones, was of Welsh descent and was a medical doctor, and her mother was the daughter of Thomas Reeder, a solicitor. Makeig-Jones was taught by a governess at home, then attended a boarding school near Rugby. After her family moved to Torquay, she entered the Torquay School of Art.  After an introduction from a relative to the managing director of Cecil Wedgwood, Makeig-Jones joined the firm as an apprentice painter in 1909.", "One of Cecil Wedgwood's daughters, Doris Audrey Wedgwood, married her brother Thomas Geoffrey Rowland Makeig-Jones in 1928. She died in 1945."]}, {"page": "Federation of Stoke-on-Trent", "response": ["On 16 December 1908, less than a week after the committee made its announcement, the six towns informed the committee that an agreement had been reached and that a differential rating system for the next 20 years had been settled on. No valuation of assets would be undertaken and each town was responsible for discharging any outstanding loans as of 31 December 1907. At this point the committee redrafted the bill according to the terms agreed by the towns and it was passed by the House of Lords on 19 December 1908. Returned to the House of Commons the bill was passed by the Commons the same day, with Royal Assent being received on 21 December 1908. The Local Government Provisional Order (No. 3) Confirmation Act (8 Edw. 7 c.clxiv) came into force on 31 March 1910 with the new council consisting of 78 councillors representing 26 wards. The new council as one of its first actions voted Cecil Wedgwood to be the first mayor of the county borough of Stoke-on-Trent., as cited by Darwin Correspondence Project Database Wedgwood had previously been appointed acting mayor (primarily to act as returning officer for the first municipal elections) by the Local Government Board. So as not to show bias towards any of the six town halls, the council held its inaugural meeting at the North Stafford Hotel."]}, {"page": "List of people from Stoke-on-Trent", "response": ["**Cecil Wedgwood DSO (1863–1916), soldier and potter."]}, {"page": "Ann Hawkshaw", "response": ["On 24 June 1862 the eldest of Hawkshaws' children, Mary, married Godfrey Wedgwood, with her brother John Clarke marrying Godfrey's sister Cecily in 1865. Mary and Godfrey's first child, Cecil Wedgwood, was born on 28 March 1863 and fifteen days later Mary died from puerperal mania. Three of the Hawkshaws' six children had now died.", "Hawkshaw's final collection, Cecil's Own Book, was published for private circulation in 1871. The collection of three short stories and ten poems was written to amuse her young grandson Cecil Wedgwood, the surviving son of Ann's daughter Mary who had died shortly after childbirth in 1863. The collection is dedicated to her memory. Of particular note is the collection's final poem, 'In Memoriam', a touching elegy on childhood death which traces the loss of the Hawkshaws' three children."]}, {"page": "List of lord mayors of Stoke-on-Trent", "response": ["Between 1910 and 1928 the Borough, and later, City of Stoke-on-Trent had a Mayor rather than a Lord Mayor. The first Mayor of Stoke-on-Trent was Cecil Wedgwood of the Wedgwood pottery dynasty. The title of Lord Mayor was first conferred on the City of Stoke-on-Trent by King George V on 10 July 1928."]}, {"page": "Felix Wedgwood", "response": ["Wedgwood was commissioned as a second lieutenant in the 5th Bn North Staffordshire Regiment, a Territorial Force infantry unit, in 1909,The London Gazette, Issue 28252, p. 3765, 18 May 1909. and was recommissioned in 1911.The London Gazette, Issue 28539, p. 7286, 6 October 1911.  The First World War began in 1914, the 1/5th Bn North Staffs landed in France at Le Havre in May 1915, forming part of the 46th (North Midland) Division which saw action at Loos and The Somme,The North Staffordshire Regiment, The Long, Long Trail, The British Army in the Great War of 1914-1918. where his cousin Major Cecil Wedgwood DSO of the 8th Bn was killed in July 1916.\"Casualty details - Wedgwood, Cecil\", Commonwealth War Graves Commission.  Felix Wedgwood had been promoted to Temporary Captain in May 1916,http://www.london-gazette.co.uk/issues/29588/pages/4982/page.pdf becoming a permanent Captain in September 1916.The London Gazette, Issue 29761, p. 9318, 22 September 1916. Captain A. F. Wedgwood died on active service in March 1917 and was buried at Rossignol Wood Cemetery in Hébuterne, Pas-de-Calais,\"Casualty details - Wedgwood, Arthur Felix\", Commonwealth War Graves Commission. alongside other men mostly from the North and South Staffs Regiments and New Zealand.CWGC.  A brief note was published in The Times.The Times, Wednesday, March 21, 1917; p. 11; Issue 41432; col C Deaths Category: Deaths.  His estate was sufficient to receive notice in The London GazetteThe London Gazette, Issue 30192, p. 7367, 20 July 1917."]}]}}