{"wiki_id": "http://www.wikidata.org/entity/Q5052806", "itemLabel": "Catherine Maria Fanshawe", "itemDescription": "British poet and etcher", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Maria_Fanshawe", "wikipedia_page": {"main": "Catherine Maria Fanshawe (1765–1834) was an English poet, whose work was praised by Walter Scott. She and her sisters were also artists.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Catherine Maria Fanshawe (1765–1834, E)"]}, {"page": "Putney", "response": ["*Catherine Maria Fanshawe, poet, died at Putney Heath in 1834"]}, {"page": "Anne Grant", "response": ["In a letter to Catherine Maria Fanshawe, dated February 18, 1809, Grant said:—"]}, {"page": "Oxford period poetry anthologies", "response": ["Miles Peter Andrews – Joanna Baillie – Samuel Bamford – Anna Laetitia Barbauld – Thomas Beck – William Blake – William Lisle Bowles – Robert Burns – George Gordon, Lord Byron – Thomas Campbell – George Canning – John Clare – Samuel Taylor Coleridge – Hannah Cowley – William Cowper – George Crabbe – George Croly – William Crowe – Charlotte Dacre – George Darley – Erasmus Darwin – Ebenezer Elliott – Catherine Maria Fanshawe – John Hookham Frere – William Gifford – Felicia Dorothea Hemans – James Hogg – William Hone – Thomas Hood – Leigh Hunt – Sir William Jones – John Keats – Charles Lamb – Mary Lamb – Laetitia Elizabeth Landon – Walter Savage Landor – Joseph Lees – Matthew Gregory Lewis – Charles Lloyd (poet) – Henry Luttrell – John Herman Merivale – Robert Merry – Mary Russell Mitford – James Montgomery – Thomas Moore – John Moultrie – Caroline Oliphant – Amelia Opie – Sydney Owenson – William Parsons – Thomas Love Peacock – Richard Polwhele – Winthrop Mackworth Praed – William Probert – Bryan Waller Procter – Edward Quillinan – Ann Radcliffe – Mary Robinson – Samuel Rogers – William Roscoe – Thomas Russell – Walter Scott – Anna Seward – Percy Bysshe Shelley – Charlotte Turner Smith – Horace Smith – James Smith – Robert Southey – Thomas Tod Stoddart – Ann Taylor – Jane Taylor – William Taylor – William Tennant – Alfred Tennyson – John Thelwall – Mary Tighe – Helen Maria Williams – John Wolcot – Charles Wolfe – William Wordsworth – Ann Yearsley"]}, {"page": "Chipstead, Surrey", "response": ["*The poet Catherine Maria Fanshawe (1765–1834) was born at Shabden in Chipstead.ODNB Retrieved 4 September 2018."]}, {"page": "Catherine Fanshaw", "response": ["#REDIRECT Catherine Maria Fanshawe"]}, {"page": "Barbarina Brand", "response": ["Barbarina Brand, Lady Dacre (née Ogle; 1768 – May 17, 1854), was an English poet, playwright, and translator. In addition to her writing, she sculpted, rode, was proficient in both French and Italian, and maintained an extensive correspondence with a circle of other literary women, including Joanna Baillie, Mary Russell Mitford, and Catherine Maria Fanshawe."]}, {"page": "Catherine Fanshawe", "response": ["#REDIRECT Catherine Maria Fanshawe"]}, {"page": "Fanshawe (surname)", "response": ["*Catherine Maria Fanshawe (1765–1834), English poet"]}, {"page": "William Harness", "response": ["While on a visit to one of his former curates, Edward Neville Crake, dean of Battle, Harness died in a fall down the stone staircase of the deanery, on 11 November 1869. He was buried at Bath, Somerset. A brass tablet was erected to his memory in All Saints' Church, Knightsbridge, and a prize with his name was founded by the subscriptions of his friends at Cambridge for the study of Shakespearean literature. His close friends included Sarah Siddons, Fanny Kemble, Mr. and Mrs. Charles Kean, Robert Southey, William Wordsworth, Miss Mitford, Catherine Maria Fanshawe, Joanna Baillie, Harriet Martineau, and Thomas Hope. The Rev. A. G. L'Estrange wrote The Literary Life of the Rev. William Harness (1871)."]}, {"page": "Women Painters of the World", "response": ["*Catherine Maria Fanshawe"]}, {"page": "List of women writers (A–L)", "response": ["*Catherine Maria Fanshawe (1765–1834, England), poet"]}]}}