{"wiki_id": "http://www.wikidata.org/entity/Q506301", "itemLabel": "Andrew Meikle", "itemDescription": "Scottish engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Meikle", "wikipedia_page": {"main": "Andrew Meikle (5 May 1719 – 27 November 1811) was a Scottish mechanical engineer credited with inventing the threshing machine, a device used to remove the outer husks from grains of wheat. He also had a hand in assisting Firbeck in the invention of the Rotherham Plough. This was regarded as one of the key developments of the British Agricultural Revolution in the late 18th century. The invention was made around 1786, although some say he only improved on an earlier design by a Scottish farmer named Leckie.\nMichael Stirling is said to have invented a rotary threshing machine in 1758 which for forty years was used to process all the corn on his farm at Gateside, no published works have yet been found but his son William made a sworn statement to his minister to this fact, he also gave him the details of his father's death in 1796.Earlier (c.1772), he also invented windmill \"spring sails\", which replaced the simple canvas designs previously used with sails made from a series of shutters that could be operated by levers, allowing windmill sails to be quickly and safely controlled in the event of a storm.\nMeikle worked as a millwright at Houston Mill in East Linton, East Lothian, and inspired John Rennie to become a noted civil engineer.\nHe died at Houston Mill and is buried in East Linton's Prestonkirk Parish Church kirkyard, close to Rennie's father, George Rennie, who farmed the nearby Phantassie estate by the River Tyne.\nIn 2011 he was one of seven inaugural inductees to the Scottish Engineering Hall of Fame.", "link_mentions": [{"page": "List of Scots", "response": ["* Andrew Meikle (1719–1811), mechanical engineer, inventor of the threshing machine"]}, {"page": "Industrial Revolution", "response": ["Joseph Foljambe's Rotherham plough of 1730 was the first commercially successful iron plough. The threshing machine, invented by the Scottish engineer Andrew Meikle in 1784, displaced hand threshing with a flail, a laborious job that took about one-quarter of agricultural labour.  It took several decades to diffuse"]}, {"page": "November 27", "response": ["*1811 – Andrew Meikle, Scottish engineer, designed the threshing machine (b. 1719)"]}, {"page": "18th century", "response": ["* 1786: Threshing machine invented by Andrew Meikle"]}, {"page": "1811", "response": ["* November 27 – Andrew Meikle, Scottish engineer (b. 1719)"]}, {"page": "Threshing machine", "response": [" Mechanization of this process removed a substantial amount of drudgery from farm labour. The first threshing machine was invented circa 1786 by the Scottish engineer Andrew Meikle, and the subsequent adoption of such machines was one of the earlier examples of the mechanization of agriculture. During the 19th century, threshers and mechanical reapers and reaper-binders gradually became widespread and made grain production much less laborious."]}, {"page": "Timeline of historic inventions", "response": ["* 1786: Andrew Meikle invents the threshing machine."]}, {"page": "Scottish Enlightenment", "response": ["* Andrew Meikle (1719–1811) engineer and inventor"]}, {"page": "East Lothian", "response": ["*Andrew Meikle, inventor of the Threshing machine, 1719–1811"]}, {"page": "John Rennie the Elder", "response": ["He was born the younger son of James Rennie, a farmer near Phantassie, near East Linton, East Lothian, Scotland. John showed a taste for mechanics at a very early age, and was allowed to spend much time in the workshop of Andrew Meikle, a millwright and the inventor of the threshing machine, who lived at Houston Mill on the Phantassie estate. After receiving a normal basic education at the parish school of Prestonkirk Parish Church, he was sent to the burgh school at Dunbar, and in November 1780 he matriculated at the University of Edinburgh, where he remained until 1783. His older brother George remained to assist in the family agricultural business, achieving notability in this arena."]}, {"page": "List of mechanical engineers", "response": ["* Andrew Meikle (1719–1811) – contributions include threshing machine and windmill sails"]}, {"page": "1786 in science", "response": ["* Scottish millwright Andrew Meikle invents a practical threshing machine."]}, {"page": "1772 in science", "response": ["* Andrew Meikle invents spring sails for windmills."]}, {"page": "East Linton", "response": ["*Andrew Meikle (1719-1811) mechanical engineer, credited with inventing the mechanical threshing machine died here."]}, {"page": "Threshing", "response": ["True industrialization of threshing began in 1786 with the invention of the threshing machine by Scot Andrew Meikle.  In this the loosened sheaves were fed, ears first, from a feeding board between two fluted revolving rollers to the beating cylinder. This cylinder or \"drum\" was armed with four iron-shod beaters or spars of wood parallel to its axle, and these striking the ears of corn as they protruded from the rollers knocked out the grain. The drum revolved at 200 to 250 revolutions per minute and carried the loose grain and straw on to a concave sieve beneath another revolving drum or rake with pegs which rubbed the straw on to the concave and caused the grain and chaff to fall through. Another revolving rake tossed the straw out of the machine. The straw thus passing under one peg drum and over the next was subjected to a thorough rubbing and tossing which separated the grain and chaff from it. These fell on to the floor beneath, ready for winnowing."]}, {"page": "Meikle", "response": ["*Andrew Meikle (1719–1811), Scottish mechanical engineer credited with inventing the threshing machine", "*Andrew Meikle Bryan FRSE (1893–1988), Scottish mining engineer"]}, {"page": "William Playfair", "response": ["Playfair was born in 1759 in Scotland. He was the fourth son (named after his grandfather) of the Reverend James Playfair of the parish of Liff & Benvie near the city of Dundee in Scotland; his notable brothers were architect James Playfair and mathematician John Playfair. His father died in 1772 when William was 13, leaving the eldest brother John to care for the family and his education. After his apprenticeship with Andrew Meikle, the inventor of the threshing machine, Playfair became draftsman and personal assistant to James Watt at the Boulton and Watt steam engine manufactory in Soho, Birmingham.Ian Spence and Howard Wainer (1997). \"Who Was Playfair?\". In: Chance 10, p. 35–37."]}, {"page": "History of agriculture", "response": ["The mechanisation and rationalisation of agriculture was another important factor. Robert Bakewell and Thomas Coke introduced selective breeding, and initiated a process of inbreeding to maximise desirable traits from the mid 18th century, such as the New Leicester sheep. Machines were invented to improve the efficiency of various agricultural operation, such as Jethro Tull's seed drill of 1701 that mechanised seeding at the correct depth and spacing and Andrew Meikle's threshing machine of 1784. Ploughs were steadily improved, from Joseph Foljambe's Rotherham iron plough in 1730 to James Small's improved \"Scots Plough\" metal in 1763. In 1789 Ransomes, Sims & Jefferies was producing 86 plough models for different soils. Powered farm machinery began with Richard Trevithick's stationary steam engine, used to drive a threshing machine, in 1812. Mechanisation spread to other farm uses through the 19th century. The first petrol-driven tractor was built in America by John Froelich in 1892."]}, {"page": "Scottish inventions and discoveries", "response": ["* Threshing machine improvements: James Meikle (c.1690-c.1780) & Andrew Meikle (1719–1811)Annual report of the Indiana State Board of Agriculture, Volume 2 By Indiana. State Board of Agriculture, Indiana. Geological Survey"]}, {"page": "1811 in the United Kingdom", "response": ["* 27 November – Andrew Meikle, Scottish mechanical engineer (born 1719)"]}, {"page": "Alec Meikle", "response": ["#REDIRECT Andrew Meikle"]}, {"page": "George Rennie (agriculturalist)", "response": ["On leaving school he was sent by his father, at the age of sixteen, to Tweedside to make a survey of a new system of farming which had been adopted by Lord Kames, Hume of Ninewells, and other landed gentry of the district. In 1765 he became superintendent of a brewery which his father had erected. The elder Rennie died in 1766, and, after leasing the business for some years, the son conducted it on a large scale from 1783 to 1797, when he finally relinquished it to a tenant. Rennie then devoted himself to the pursuit of agriculture on the Phantassie farmland and in 1787 he employed Andrew Meikle, the eminent millwright (to whom his brother, John Rennie, the engineer, had been apprenticed) to erect one of his drum thrashing-machines. This was driven by water. When Meikle's claims as the inventor were disputed, Rennie wrote a letter in his favour, which was printed in A Reply to an Address to the Public, but more particularly to the Landed Interest of Great Britain and Ireland, on the subject of the Thrashing Machine."]}, {"page": "1786 in Great Britain", "response": ["* Scottish millwright Andrew Meikle invents a practical threshing machine."]}, {"page": "Glossary of mill machinery", "response": ["Spring Sails, invented in 1772 by Andrew Meikle, have shutters adjusted by a spring. Each sail is adjusted individually and, as with Common Sails the mill has to be stopped to enable an adjustment to be made."]}, {"page": "Windmill sail", "response": ["Spring sails were invented by Scottish millwright Andrew Meikle in 1772. The sail is divided into a number of bays, each having a number of shutters. All the shutters are joined together by a shutter bar, and the force required for the wind to open the shutters is adjusted by a separate spring on each sail. Although automatic in operation, the mill must be stopped in order to adjust the reefing of the sail."]}, {"page": "Prestonkirk Parish Church", "response": ["*Andrew Meikle, the inventor of the threshing machine", "Image:Prestonkirk churchyard.jpg|Andrew Meikle, George Rennie and John Rennie are buried here"]}, {"page": "Preston Mill", "response": ["The engineer and millwright Andrew Meikle maintained the mill in the 18th century. In 1948 a flood submerged the buildings, and in 1950 a local land owner gave the mill to the National Trust for Scotland. "]}, {"page": "List of British innovations and discoveries", "response": ["* The threshing machine is invented by Andrew Meikle."]}, {"page": "Montfode Castle", "response": ["As stated, the old castle was robbed of stone to build the dam and threshing mill in the early 19th century. Threshing is the separation of the grain of a crop from the straw. Originally by hand, the Scot Andrew Meikle of East Linton in 1786 developed a threshing machine, housed in a threshing mill. The corn was fed in at the first floor level and rollers with grid-like brushes on separated the grain from the straw. The grain passed through the grid. The grain was bagged up for the millstones, the straw taken to the straw barn. A gathering or mill pond, leats and sluices were needed.Keys to the Past  Retrieved : 2012-06-22 The water supply came from the hill above and remains of the control sluice are still visible, with an overflow running through a pipe to the Montfode Burn and the 'spent' water from the mill leaving via a substantial stone lined outflow that exited below the main farm buildings. A turbine may have been used as no signs of a waterwheel and associated equipment exist."]}, {"page": "History of agriculture in Scotland", "response": ["Early improvement was carried out with the traditional tools, but new technology was increasingly important. Lighter ploughs were adopted, including from 1763 James Small's cast iron and curved mould board. It was first adopted in the south-east and spread to rest of the country in the 1770s. From 1788 Andrew Meikle's automated threshing mill speeded up a vital part of the harvesting process.G. Sprot, \"Agriculture, 1770s onwards\", in M. Lynch, ed., Oxford Companion to Scottish History (Oxford: Oxford University Press, 2011), , pp. 321–3. There was increasing regional specialisation. The Lothians became a major centre of grain, Ayrshire of cattle breading and the Borders of sheep."]}, {"page": "Scottish Engineering Hall of Fame", "response": ["*Andrew Meikle"]}, {"page": "1811 in Scotland", "response": ["* 27 November – Andrew Meikle, mechanical engineer and inventor (born 1719)"]}, {"page": "List of British engineers", "response": ["* Andrew Meikle (1719–1811), inventor of an innovative mechanical threshing machine"]}, {"page": "1719 in Scotland", "response": ["* 5 May – Andrew Meikle, mechanical engineer and inventor (died 1811)"]}, {"page": "1786 in Scotland", "response": ["* Millwright Andrew Meikle invents a practical threshing machine."]}]}}