{"wiki_id": "http://www.wikidata.org/entity/Q50676555", "itemLabel": "Flo Bilton", "itemDescription": "English association football player (1921-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Flo_Bilton", "wikipedia_page": {"main": "Florence \"Flo\" Bilton (1921 – 22 July 2004) was an English association football coach and administrator. She was an officer of the Women's Football Association (WFA) from its formation in 1969 until its incorporation into The FA in 1993.\nBilton's involvement in football began in 1963, when she put together a female team from the Reckitt & Colman factory where she worked to play a nearby Smith & Nephew factory. Reckitt & Colman won 2–1, with Bilton playing as a veteran goalkeeper. She remained as Reckitt & Colman manager and was secretary of the nascent Hull League. She later helped local players Carol Thomas and Gail Borman progress to the England national team.As a founding member of the WFA, Bilton undertook a variety of unglamorous but important off-field roles during the organisation's 24-year history. She borrowed an England national football team cap from her neighbour Raich Carter and then made copies for England's female national team players.Former England player Wendy Owen praised Bilton in her 2005 autobiography: \"She was a wonderful person who could and did turn her hand to just about anything that might help other women to get enjoyment out of the game.\" In 1997 Sue Lopez declared: \"Flo Bilton is one of the unsung heroines and one of the greatest supporters of women's football.\"In 2018 Bilton was awarded a commemorative plaque by her home city of Kingston upon Hull. At the Guildhall unveiling, former England captains Karen Walker and Carol Thomas both made speeches in Bilton's honour.", "link_mentions": [{"page": "Carol Thomas", "response": ["Thomas's first competitive game was at the age of 11 in September 1966, having been inspired by the World Cup success of that year, for BOCM Ladies as a traditional right winger. She was also encouraged by watching her father Percy, who had been a keen amateur footballer and a founder member of a local team called Air Street United. Her talents were quickly recognised and she was snapped up by Reckitts Ladies, then under the tutelage of Flo Bilton. A move to local rivals Hull Brewery Ladies followed, gaining recognition with the Hull and District Representative team, the North of England squad and an eventual England call up."]}, {"page": "Bilton (surname)", "response": ["* Flo Bilton (1921–2004), English association football coach and administrator"]}]}}