{"wiki_id": "http://www.wikidata.org/entity/Q506805", "itemLabel": "Andrew Ranicki", "itemDescription": "British mathematician and professor", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Ranicki", "wikipedia_page": {"main": "Andrew Alexander Ranicki (born Andrzej Aleksander Ranicki; 30 December 1948 – 21 February 2018) was a British mathematician who worked on algebraic topology.  He was a professor of mathematics at the University of Edinburgh.", "link_mentions": [{"page": "Knot theory", "response": ["*History of knot theory (on the home page of Andrew Ranicki)"]}, {"page": "Marcel Reich-Ranicki", "response": ["From 1948 to 1949 he was a Polish diplomat and intelligence worker (operating under the pseudonym \"Ranicki\") in London. The couple's only child, Andrew Ranicki, who became a notable topologist and mathematics professor, was born in London in 1948. Reich was recalled from London in 1949, sacked from the intelligence service, and expelled from the Party on charges of \"ideological estrangement\", for which he was also jailed for a short time.", "Marcel's son, Andrew Ranicki (1948–2018), was a professor of mathematics at the University of Edinburgh. Marcel's wife, Teofila Reich-Ranicki, predeceased her husband by two years, dying in 2011.\"Teofila Reich-Ranicki ist tot\" (in German), hr-online.de]  According to The Economist, \"He appreciated Jewish culture, especially its way with words, but found religion pointless and, after Warsaw, God inconceivable.\"https://www.economist.com/obituary/2013/09/28/marcel-reich-ranicki Marcel Reich-Ranicki", "*Memorial website for Marcel and Teofila Reich-Ranicki maintained by their son Andrew Ranicki"]}, {"page": "Exotic sphere", "response": ["*Exotic sphere home page on the home page of Andrew Ranicki. Assorted source material relating to exotic spheres."]}, {"page": "Hauptvermutung", "response": ["*Andrew Ranicki (ed.) The Hauptvermutung Book  ", "*Andrew Ranicki High-dimensional manifolds then and now"]}, {"page": "Surgery theory", "response": ["*Andrew Ranicki's homepage"]}, {"page": "Whitehead Prize", "response": ["* 1983 Jeff Paris, Andrew Ranicki"]}, {"page": "Surgery structure set", "response": ["*Andrew Ranicki's homepage"]}, {"page": "Assembly map", "response": ["induces a long exact sequence of homotopy groups which may be identified with the surgery exact sequence of M. This may be called the fundamental theorem of surgery theory and was developed subsequently by William Browder, Sergei Novikov, Dennis Sullivan, C. T. C. Wall, Frank Quinn, and Andrew Ranicki."]}, {"page": "Twisted Poincaré duality", "response": ["*The online book Algebraic and geometric surgery by Andrew Ranicki."]}, {"page": "Jonathan Rosenberg (mathematician)", "response": ["*Editor Steven C. Ferry, Andrew Ranicki: Novikov Conjectures, Rigidity and Index Theorem, London Mathematical Society Lecture Notes Series 226, Cambridge University Press, 1995, 2 volumes (Oberwolfach Meeting 1993)", "*Editor with Sylvain Cappell, Andrew Ranicki: Surveys on Surgery Theory. Papers dedicated to CTC Wall, Princeton University Press, 2 vols, 2001"]}, {"page": "Deaths in February 2018", "response": ["*Andrew Ranicki, 69, British mathematician, leukaemia.Zum Tod von Andrew Ranicki, Sohn von Teofila und Marcel Reich-Ranicki", "*Waldo R. Tobler, 87, American geographer and cartographer.Zum Tod von Andrew Ranicki, Sohn von Teofila und Marcel Reich-Ranicki"]}, {"page": "Andrew Alexander Ranicki", "response": ["#REDIRECT Andrew Ranicki"]}, {"page": "Andrzej Aleksander Ranicki", "response": ["#REDIRECT Andrew Ranicki"]}, {"page": "Samuel James Patterson", "response": ["David Kazhdan, and Andrew Ranicki.Mathematics: International Conference on Questions of Number Theory University of Göttingen A commemorative volume, Contributions in Analytic and Algebraic Number Theory (Springer 2012), edited by Valentin Blomer & Preda Mihăilescu, collecting articles related to or developed at the conference, was issued as a Festschrift for him.Festschrift for S. J. Patterson The text that comprises this volume is a collection of surveys and original works from experts in the fields of algebraic number theory, analytic number theory, harmonic analysis, and hyperbolic geometry. A portion of the collected contributions have been developed from lectures given at the \"International Conference on the Occasion of the 60th Birthday of S. J. Patterson\""]}]}}