{"wiki_id": "http://www.wikidata.org/entity/Q506242", "itemLabel": "Michael G. Coney", "itemDescription": "British writer (1932-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_G._Coney", "wikipedia_page": {"main": "Michael Greatrex Coney (September 28, 1932 - November 4, 2005) was a British science fiction writer, best known for his novel  Hello Summer Goodbye.", "link_mentions": [{"page": "Eric Brown (writer)", "response": ["He has publicly admired the science fiction writing of Michael G. Coney, Robert Silverberg, Richard Paul Russo and Robert Charles Wilson, amongst others."]}, {"page": "BSFA Award", "response": [":Novel: Brontomek! by Michael G. Coney"]}, {"page": "Syzygy", "response": ["* Syzygy, a novel by Michael G. Coney"]}, {"page": "List of Canadian science fiction and fantasy authors", "response": ["* Michael G. Coney"]}, {"page": "Coney", "response": ["* Michael G. Coney (1932–2005), English science fiction writer"]}, {"page": "2005 in literature", "response": ["*November 4 – Michael G. Coney, Canadian science-fiction writer (born 1932)"]}, {"page": "Deaths in November 2005", "response": ["*Michael G. Coney, 73, Canadian science fiction author, mesothelioma."]}, {"page": "Michael Coney", "response": ["#redirect Michael G. Coney"]}, {"page": "The Last Dangerous Visions", "response": ["*\"Suzy is Something Special\" by Michael G. Coney† (8000)"]}, {"page": "Random Quest", "response": ["In Michael G. Coney's Charisma (1975) the protagonist travels among the alternate timelines, again and again meeting the same girl and falling in love with her – only to have her get killed again and again, in all kinds of accidents."]}, {"page": "Immortality in fiction", "response": ["In Joe Haldeman's 1974 novel The Forever War, immortality is caused by paradoxes arising from time travel. Immortality of the mind is sometimes accomplished by periodically moving it to a new physical body, transferring either just the consciousness as in A. E. van Vogt's 1948 novel The World of Null-A or transplanting the entire brain as in Michael G. Coney's 1974 novel Friends Come in Boxes. Similarly, personality traits are transferred from one person to another using the malaria parasite as a vector to attain a form of immortality in Indian author Amitav Ghosh's 1995 novel The Calcutta Chromosome. A kind of non-physical digital immortality is also achieved by transferring a person's consciousness to a computer in works such as William Gibson's Sprawl trilogy starting with the 1984 novel Neuromancer. Cryonic freezing is used as a means to extend life until such a time that immortality is expected to be available in some stories such as Clifford D. Simak's 1967 novel Why Call Them Back from Heaven?."]}, {"page": "New Writings in SF 9", "response": ["*\"Symbiote\" (Michael G. Coney) - from UK edition of New Writings in SF 15"]}, {"page": "New Writings in SF", "response": ["Dozens of prolific authors contributed stories, some in series, such as James White's Sector General. Authors whose stories were featured more than once included Colin Kapp (12), Keith Roberts (11; two as by David Stringer, one as by John Kingston), Brian W. Aldiss (10), Douglas R. Mason (10; six as by John Rankine), John Rackham (9), Michael G. Coney (8), Joseph Green (8; one in collaboration with James Webbert), Vincent King (7), E. C. Tubb (7; one as by Charles Grey), John Baxter (6), Sydney J. Bounds (6), James White (6), R. W. Mackelworth (5), Donald Malcolm (5), Christopher Priest (5), Lee Harding (4), H. A. Hargreaves (4), M. John Harrison (4), Grahame Leman (4), Dan Morgan (4), Arthur Sellings (4), William Spencer (4), Dennis Etchison (3), David S. Garnett (3), Ernest Hill (3), Charles Partington (3), Martin I. Ricketts (3), Ritchie Smith (3; two in collaboration with Thomas Penman), Michael Stall (3), Cherry Wilder (3), Eddy C. Bertin (2), Paul Corey (2), Robert P. Holdstock (2), Laurence James (2), John Kippax (2), David A. Kyle (2), G. L. Lack (2), Peter Linnett (2), Thomas Penman (2, in collaboration with Ritchie Smith), Robert Presslie (2), David Rome (2), Ian Watson (2),and Keith Wells (2)."]}, {"page": "New Writings in SF 21", "response": ["*\"The Tertiary Justification\" (Michael G. Coney)"]}, {"page": "New Writings in SF 20", "response": ["*\"Oh, Valinda!\" (Michael G. Coney)"]}]}}