{"wiki_id": "http://www.wikidata.org/entity/Q506453", "itemLabel": "Tony Sheridan", "itemDescription": "British recording artist; singer-songwriter, musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Sheridan", "wikipedia_page": {"main": "Anthony Esmond Sheridan McGinnity (21 May 1940 – 16 February 2013), known professionally as Tony Sheridan, was an English rock and roll singer-songwriter and guitarist who spent much of his adult life in Germany. He was best known as an early collaborator of the Beatles (though the record was labelled as being with \"The Beat Brothers\"), one of two non-Beatles (the other being Billy Preston) to receive label performance credit on a record with the group, and the only non-Beatle to appear as lead singer on a Beatles recording which charted as a single.\n\n", "link_mentions": [{"page": "February 16", "response": ["*  2013   – Tony Sheridan, English singer-songwriter and guitarist (b. 1940)"]}, {"page": "May 21", "response": ["*1940 – Tony Sheridan, English singer-songwriter and guitarist (d. 2013) "]}, {"page": "Pete Best", "response": ["The reunited Beatles returned to Hamburg in April 1961. While they played at the Top Ten Club, singer Tony Sheridan recruited them to act as his backing band on a recording for the German Polydor label, produced by bandleader Bert Kaempfert, who signed the group to a Polydor contract at the first session on 22 June 1961. On 31 October 1961, Polydor released the recording \"My Bonnie\" (Mein Herz ist bei dir nur/My heart is only for you) which appeared on the German charts under the name \"Tony Sheridan and the Beat Brothers\"—a generic name used for whoever happened to be in Sheridan's backup band. The song was later released in the UK.\"My Bonnie\"/\"The Saints\" 23 April 1962. Polydor NH 66833 (Tony Sheridan and the Beat Brothers) There was a second recording session on 23 June that year, and a third in May 1962.", "Epstein negotiated ownership of the Decca audition tape, which was then transferred to an acetate disc, to promote the band to other record companies in London. In the meantime, Epstein negotiated the release of the Beatles from their recording contract with Bert Kaempfert and Polydor Records in Germany, which expired on 22 June 1962.Tune In by Mark Lewisohn The record producer at EMI, George Martin, met with Epstein on 9 May 1962 at the Abbey Road studios, and was impressed with his enthusiasm. He agreed to sign the Beatles on a recording contract, based on listening to the Decca audition tape, without having met them or having seen them perform live. As a part of this contract, the Beatles recorded at Polydor's Studio Rahlstedt on 24 May 1962 in Hamburg as a sessions band, backing Tony Sheridan. thumb|left|270px|alt=Studio Two, Abbey Road Studios|Studio Two of Abbey Road Studios (in 2008) where Pete Best recorded with the Beatles in a test session on 6 June 1962"]}, {"page": "Ringo Starr", "response": ["By early 1960, the Hurricanes had become one of Liverpool's leading bands.; . In May, they were offered a three-month residency at a Butlins holiday camp in Wales. Although initially reluctant to accept the residency and end his five-year machinist apprenticeship that he had begun four years earlier, Starr eventually agreed to the arrangement.; ; . The Butlins gig led to other opportunities for the band, including an unpleasant tour of US Air Force bases in France about which Starr commented: \"The French don't like the British; at least I didn't like them.\" The Hurricanes became so successful that when initially offered a highly coveted residency in Hamburg, they turned it down because of their prior commitment with Butlins.; . They eventually accepted, joining the Beatles at Bruno Koschmiders Kaiserkeller on 1 October 1960, where Starr first met the band.: Starr first met the Beatles in Hamburg; : Starr first met the Beatles in Hamburg; : Bruno Koschmider; : arriving in Hamburg on 1 October 1960. Storm's Hurricanes were given top-billing over the Beatles, who also received less pay.: the Hurricanes were paid more than the Beatles; : the Hurricanes were given top-billing over the Beatles. Starr performed with the Beatles during a few stand-in engagements while in Hamburg. On 15 October 1960, he drummed with John Lennon, Paul McCartney and George Harrison, recording with them for the first time while backing Hurricanes singer Lu Walters on the George Gershwin/DuBose Heyward aria \"Summertime\".: Starr recording with the Beatles for the first time; : Starr performed with the Beatles during a few stand-in engagements while in Hamburg; : Starr recording with the Beatles for the first time. During Starr's first stay in Hamburg he also met Tony Sheridan, who valued his drumming abilities to the point of asking Starr to leave the Hurricanes and join his band.; ."]}, {"page": "The Beatles", "response": ["During the next two years, the Beatles were resident for periods in Hamburg, where they used Preludin both recreationally and to maintain their energy through all-night performances. In 1961, during their second Hamburg engagement, Kirchherr cut Sutcliffe's hair in the \"exi\" (existentialist) style, later adopted by the other Beatles. When Sutcliffe decided to leave the band early that year and resume his art studies in Germany, McCartney took up the bass. Producer Bert Kaempfert contracted what was now a four-piece group until June 1962, and he used them as Tony Sheridan's backing band on a series of recordings for Polydor Records. As part of the sessions, the Beatles were signed to Polydor for one year. Credited to \"Tony Sheridan & the Beat Brothers\", the single \"My Bonnie\", recorded in June 1961 and released four months later, reached number 32 on the Musikmarkt chart.", "Epstein courted the band over the next couple of months, and they appointed him as their manager in January 1962. Throughout early and mid-1962, Epstein sought to free the Beatles from their contractual obligations to Bert Kaempfert Productions. He eventually negotiated a one-month early release in exchange for one last recording session in Hamburg. On their return to Germany in April, a distraught Kirchherr met them at the airport with news of Sutcliffe's death the previous day from a brain haemorrhage. Epstein began negotiations with record labels for a recording contract. To secure a UK record contract, Epstein negotiated an early end to the band's contract with Polydor, in exchange for more recordings backing Tony Sheridan. After a New Year's Day audition, Decca Records rejected the band, saying, \"Guitar groups are on the way out, Mr. Epstein.\" However, three months later, producer George Martin signed the Beatles to EMI's Parlophone label."]}, {"page": "1940", "response": ["* May 21 – Tony Sheridan, British singer, songwriter, and musician (d. 2013)"]}, {"page": "Fifth Beatle", "response": ["===Tony Sheridan===", "Tony Sheridan employed various backup bands while performing in Hamburg between 1960 and 1963. In 1961 the Beatles (comprising Lennon, McCartney, Harrison, and Best), who had met Sheridan during their first visit to Hamburg in 1960, worked with him on their second. When German Polydor agent Bert Kaempfert saw the pairing on stage, he suggested that they make some recordings together. (At that period, Sheridan was the bigger name, with the Beatles as his backing band.) In 1962, after a series of singles (the first of which, \"My Bonnie\"/\"The Saints\" made it to no. 5 in the Hit Parade), Polydor released the album My Bonnie across Germany. The word \"Beatles\" was judged to sound too similar to the German \"Pidels\" (pronounced peedles), the plural of a slang term for penis, so the album was credited to \"Tony Sheridan and The Beat Brothers\". After The Beatles had gained fame, the album was re-released in the UK, with the credit altered to \"Tony Sheridan and The Beatles\"."]}, {"page": "Paul is dead", "response": ["Before the end of October 1969, several record releases had exploited the phenomenon of McCartney's alleged demise. These included \"The Ballad of Paul\" by the Mystery Tour; \"Brother Paul\" by Billy Shears and the All Americans; \"So Long Paul\" by Werbley Finster, a pseudonym for José Feliciano; and Zacharias and His Tree People's \"We're All Paul Bearers (Parts One and Two)\". Another song was Terry Knight's \"Saint Paul\", which had been a minor hit in June that year and was subsequently adopted by radio stations as a tribute to \"the late Paul McCartney\". According to a report in Billboard magazine in early November, Shelby Singleton Productions planned to issue a documentary LP of radio segments discussing the phenomenon. In Canada, Polydor Records exploited the rumour in their artwork for Very Together, a repackaging of the Beatles' pre-fame recordings with Tony Sheridan, using a cover that showed four candles, one of which had just been snuffed out."]}, {"page": "Brian Epstein", "response": ["Epstein first noticed the Beatles in issues of Mersey Beat and on numerous posters around Liverpool created by his commercial artist associate Tony Booth, before he asked Mersey Beat editor Bill Harry who they were. Harry had previously convinced Epstein to sell the magazine at NEMS, with the Beatles featured on the front page of its second issue. The Beatles had recorded the \"My Bonnie\" single with Tony Sheridan in Germany, and some months after its release Epstein asked his personal assistant Alistair Taylor about it in NEMS. Epstein's version of the story was that customer Raymond Jones walked into the NEMS shop and asked him for the \"My Bonnie\" single, which made Epstein curious about the group. Taylor later claimed that he had used the name of Jones (a regular customer) to order the single and paid the deposit, knowing that Epstein would notice it and order further copies. Harry and McCartney later repudiated Epstein's story, as Harry had been talking to Epstein for a long time about the Beatles—the group that he promoted the most in Mersey Beat—with McCartney saying, \"Brian knew perfectly well who the Beatles were; they were on the front page of the second issue of Mersey Beat\". On 3 August 1961, Epstein started a regular music column in the Mersey Beat called \"Stop the World—And Listen To Everything in It: Brian Epstein of NEMS\"."]}, {"page": "1962 in music", "response": ["*January 5 – The first album on which The Beatles play, My Bonnie, credited to \"Tony Sheridan and the Beat Brothers\" (recorded last June in Hamburg and produced by Bert Kaempfert), is released by Polydor.", "*My Bonnie – Tony Sheridan"]}, {"page": "1940 in music", "response": ["*May 21 – Tony Sheridan, singer-songwriter (d. 2013)"]}, {"page": "Brenda Lee", "response": ["Brenda Lee first visited England for three days in April 1959 as a last-minute replacement on \"Oh Boy!\". She first toured the UK in March and April 1962 with Gene Vincent and Sounds Incorporated (as her backing group), and she toured the country for a second time in March 1963, this time supported by the Bachelors, Sounds Incorporated, Tony Sheridan, and Mike Berry."]}, {"page": "The Beatles bootleg recordings", "response": ["Other than the commercially released songs with Tony Sheridan issued on In the Beginning (Circa 1960), only three recordings made by the group prior to 1962 have become public.Unterberger (2006), pp. 4–10.", "Additional material from the Star-Club tapes has been bootlegged, including \"Road Runner\", \"Money (That's What I Want)\" (with Tony Sheridan singing lead), a portion of \"Red Hot\", and alternate performances of several songs."]}, {"page": "The Beatles discography", "response": ["! scope=\"row\"| The Beatles with Tony Sheridan and Their Guests"]}, {"page": "Polydor Records", "response": ["In the early 1960s, orchestra leader Bert Kaempfert signed unknowns Tony Sheridan and The Beat Brothers - who later became known as The Beatles—to Polydor. Popular International entertainers such as James Last, Bert Kaempfert, Kurt Edelhagen, Caterina Valente and the Kessler Twins appeared on the Polydor label, as well as many French, Spanish and Latin-American figures."]}, {"page": "MGM Records", "response": ["* The Beatles  with Tony Sheridan (US)"]}, {"page": "Bert Kaempfert", "response": ["In his capacity as record producer, Kaempfert played a part in the rise of The Beatles. In 1961, he hired the Beatles to back Tony Sheridan on an album called My Bonnie. Sheridan had been performing in Hamburg, and needed to recruit a band to play behind him on the proposed tracks.  Kaempfert auditioned and signed the Beatles, and recorded two tracks with them during his sessions for Sheridan: \"Ain't She Sweet\" (sung by rhythm guitarist John Lennon) and \"Cry for a Shadow\" (an instrumental written by Lennon and lead guitarist George Harrison). The album and its singles, released by Polydor Records, were the Beatles' first commercially released recordings.", "On 28 October 1961, a man walked into the Liverpool music store owned by Brian Epstein and asked for a copy of \"My Bonnie\", a song recorded by the Beatles but credited to Tony Sheridan. The store did not have it, but Epstein noted the request. He was so intrigued by the idea of a Liverpool band releasing a record that he investigated. That event led to his discovery of the Beatles and, through his efforts, their signing by George Martin to Parlophone Records after Kaempfert helped them avoid any contractual claim from Polydor.", "Another contributor to Kaempfert's music was guitarist/bassist Ladislav \"Ladi\" Geisler, who popularized the famous \"knackbass\" (crackling bass) sound, using the Fender Telecaster Bass Guitar, which became the most distinctive feature of many Kaempfert recordings — a treble staccato bass guitar sound in which the bass string was plucked with a pick and immediately suppressed to cancel out any sustain. An acoustic bass played a simple pattern in unison with this staccato electric bass, which created a unique sound. It was Geisler who lent his guitar amplifier to The Beatles for their recording session with Tony Sheridan, after the band's own equipment proved to be inadequate for recording purposes. ."]}, {"page": "Malcolm Young", "response": ["The \"big freeze\" of 1963 was one of the worst winters on record in Scotland, with snow  deep. A TV advertisement shown in Scotland at that time offered assisted travel for families to start a different life in Australia. Fifteen members of the Young family left Scotland in late June 1963, including fifth son George (1946–2017) and younger brothers Malcolm and Angus (b. 1955). Also in tow were his eldest brother Stephen (1933–1989), his only sister Margaret Horsburgh (1935–2019) and brother William Jr (b. 1940). Another elder brother, Alex (1938–1997), who was a member of Tony Sheridan's backup group The Bobby Patrick Big Six, stayed in Europe and was later a member of London-based group Grapefruit. Another brother, John (b. 1937), had migrated to Australia separately."]}, {"page": "Template talk:The Beatles/Archive 2", "response": ["|| Yoko Ono • Billy Preston • Tony Sheridan • Chas Newby • Andy White • Jimmy Nicol • Astrid Kirchherr • Klaus Voormann"]}, {"page": "Hank Marvin", "response": ["He moved to London in April 1958 after persuading his parents to let him do so in pursuit of a career in the music business.Hank Marvin: My family values - The Guardian. 13 June 2014. Retrieved 30 January 2022. Sixteen-year-old Marvin and his Rutherford Grammar School friend, Bruce Welch, met Johnny Foster, Cliff Richard's manager, at The 2i's Coffee Bar in Soho, London. Foster was looking for a guitarist for Cliff Richard's UK tour and was considering Tony Sheridan. Instead he offered Marvin the position. Marvin agreed to join the Drifters, as Cliff Richard's group was then known, provided there was a place for Welch."]}, {"page": "Hound Dog (song)", "response": ["The Complete Beatles Chronicles (Harmony Books, 1992) pp. 15, 23, 363. On August 30, 1972, Lennon performed the song with the Plastic Ono Elephant's Memory Band  at Madison Square Garden, New York City, in one of his last charity concerts, and was released on his Live in New York album on January 24, 1986. John Lennon also recorded \"Hound Dog\" during his huge rehearsal of early Rock and Roll classics (for the Madison Square Garden concert) that was released on the unauthorized album S.I.R. John Winston Ono Lennon. Tony Sheridan (who was asked to join the young Beatles) also recorded the Presley version of \"Hound Dog\"."]}, {"page": "Vagabond (disambiguation)", "response": ["*Vagabond, by Tony Sheridan"]}, {"page": "Atco Records", "response": ["In 1964, ATCO released a single in the US by The Beatles, \"Ain't She Sweet\" (flip side \"Nobody's Child\", with lead singer Tony Sheridan), which had been recorded in Hamburg in 1961. With lead vocals by John Lennon, \"Ain't She Sweet\" reached No. 19 on the Billboard Hot 100 chart in August 1964. ATCO also released an album entitled Ain't She Sweet which featured the other two tracks by Sheridan and The Beatles from the Hamburg session and filled out by eight other songs covered by The Swallows."]}, {"page": "Anthology 1", "response": ["Disc One, tracks 10–12, were recorded at a session in Hamburg where the Beatles served as the back-up band to the English rock and roll musician Tony Sheridan. Some songs from this session were released on the 1962 album My Bonnie, credited to Tony Sheridan and the Beat Brothers. The song \"My Bonnie\" would be their introductory single in England, featuring Sheridan on lead vocal and guitar. Tracks 21–22 are the only surviving recordings of the Beatles' first EMI session. Track 22 is the original recording of \"Love Me Do\", which would be re-recorded by the group four months later for their first single. Track 24 features EMI session drummer Andy White, in place of Ringo.", "* Tony Sheridan – lead vocal and lead guitar (guitar solo) on \"My Bonnie\""]}]}}