{"wiki_id": "http://www.wikidata.org/entity/Q5077350", "itemLabel": "Maxwell Eley", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Maxwell_Eley", "wikipedia_page": {"main": "Charles Ryves Maxwell Eley  (16 September 1902 – 15 January 1983) was a British rower who competed in the 1924 Summer Olympics, winning a gold medal with the British coxless four.", "link_mentions": [{"page": "East Bergholt", "response": ["*Maxwell Eley (1902 – 1983), Olympic gold medal winning rower."]}, {"page": "Great Britain at the 1924 Summer Olympics", "response": ["| Maxwell Eley  James MacNabb  Robert Morrison  Terence Sanders"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Maxwell EleyJames MacNabbRobert MorrisonTerence Sanders"]}, {"page": "Rowing at the 1924 Summer Olympics", "response": ["|Maxwell EleyJames MacNabbRobert MorrisonTerence Sanders"]}, {"page": "Bridget Cracroft-Eley", "response": ["On 31 October 1959, she married Robert Peel Charles Eley (1931-1996), son of Charles Ryves Maxwell Eley. They had two children, one son and one daughter. Cracroft-Eley became a Commander of the Royal Victorian Order (CVO) in the 2008 New Year Honours. She died in August of that year at her home in Hackthorn, aged 74, of a brain tumour."]}, {"page": "Stewards' Challenge Cup", "response": ["| 1922 || Eton Vikings Club || {{small| Maxwell Eley, James MacNabb, Robert Morrison, Terence Sanders || 8:25       E    || Grasshopper Club Zürich, Switzerland", "| 1923 || Third Trinity, Cambridge || {{small|Maxwell Eley, James MacNabb, Robert Morrison, Terence Sanders || 7:30       E    || Magdalen College, Oxford", "| 1924 || Third Trinity, Cambridge || {{small|Maxwell Eley, James MacNabb, Robert Morrison, Terence Sanders ||  8:37       3L    || Leander Club"]}, {"page": "James MacNabb", "response": ["MacNabb was born at Keighley, West Yorkshire, the son of Rev. James Frederick MacNabb, and his wife Margaret Elizabeth Waterworth. He was educated at Eton and first rowed at Henley in 1920 as a member of the Eton Crew that reached the semi-finals of the Ladies' Challenge Plate. He then went to Trinity College, Cambridge.  At Cambridge, MacNabb, Maxwell Eley, Robert Morrison and Terence Sanders, who had rowed together at Eton, made up the coxless four that in 1922 at Henley won the Stewards' Challenge Cup as Eton Vikings and the Visitors' Challenge Cup as Third Trinity Boat Club. They won the Stewards' Challenge Cup again in 1923. MacNabb rowed for Cambridge in the Boat Race in 1924 and also won Silver Goblets at Henley in 1924 partnering Maxwell Eley.Henley Royal Regatta Results of Final Races 1839–1939   The coxless four crew won Stewards' at Henley again in 1924 and went on to win the gold medal for Great Britain  rowing at the 1924 Summer Olympics.Sports Reference Olympic Sports – James MacNabb"]}, {"page": "Robert Morrison (rower)", "response": ["Morrison was born at Richmond on Thames, and he was educated at Eton College and at Trinity College, Cambridge, where he was a member of the Pitt Club.  At Cambridge, Morrison, James MacNabb, Maxwell Eley and Terence Sanders, who had rowed together at Eton, made up the coxless four that in 1922 at Henley won the Stewards' Challenge Cup as Eton Vikings and the Visitors' Challenge Cup as Third Trinity Boat Club.Henley Royal Regatta Results of Final Races 1839–1939 Morrison rowed for Cambridge in the Boat Race in 1923 and was again in the winning crew for the Stewards' Challenge Cup  The coxless four crew won Steward's at Henley again in 1924 and went on to win the gold medal for Great Britain  rowing at the 1924 Summer Olympics.Sports Reference Olympic Sports – Robert Morrison In 1925 at Henley Morrison won the Stewards's Challenge Cup, the Visitors' Challenge Cup and the Silver Goblets  partnering Edric Hamilton-Russell."]}, {"page": "Terence Sanders", "response": ["Sanders was born in Charleville, Cork, Ireland. He was educated at Eton and Trinity College, Cambridge.  At Cambridge, Sanders, Maxwell Eley, Robert Morrison and James MacNabb, who had rowed together at Eton, made up the coxless four that in 1922 at Henley won the Stewards' Challenge Cup as Eton Vikings and the Visitors' Challenge Cup as Third Trinity Boat Club Sanders stroked the Cambridge in the Boat Race in 1923 which was won by Oxford.  The coxless four  won the Stewards' Challenge Cup at Henley again in 1923 crew won Steward's at Henley again in 1924 and went on to win the gold medal for Great Britain  rowing at the 1924 Summer Olympics.Sports Reference Olympic Sports – Terence Sanders"]}]}}