{"wiki_id": "http://www.wikidata.org/entity/Q5077261", "itemLabel": "Charles Edward Cawley", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Edward_Cawley", "wikipedia_page": {"main": "Charles Edward Cawley (1812 – 9 April 1877) was a British civil engineer and Conservative Party politician.\nHe was the only son of Samuel Cawley of Goodden House, Middleton, Lancashire and his wife Mary Jones of Packington, Warwickshire. He became involved in Conservative politics and was for many years was an alderman on Salford Borough Council. In 1842 he married Harriet Motley.\nUnder the Representation of the People Act 1867 the parliamentary borough of Salford was given a second Member of Parliament, and Cawley was elected at the 1868 general election by a small majority. He comfortably retained his seat at the 1874 general election.\nCharles Cawley died at his residence in Higher Broughton, near Manchester, in April 1877 aged 64.", "link_mentions": [{"page": "Bridgewater Canal", "response": ["Upon completion of the Rochdale Canal in 1804, the two canals were joined at Castlefield.  This connection may have been a factor in the failure of the Manchester Bolton & Bury Canal Company's rival scheme to build a canal between Bury and Sladen.  The River Medlock, a major source of water for the canal and which was almost as badly polluted as the nearby Irwell, was diverted through a tunnel under the canal at Castlefield by Charles Edward Cawley, a civil engineer for the Salford Corporation and later a Member of Parliament (MP) for Salford.  The canal was from that point supplied by the much purer water of the Rochdale Canal."]}, {"page": "Salford (UK Parliament constituency)", "response": ["|rowspan=\"1\"| Charles Edward Cawley"]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| Charles Edward Cawley"]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|Charles Edward Cawley"]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Charles Edward Cawley"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1868 || Salford || Roderick Anderson; Jesse Bryant; and Edward Charlton Harding || Charles Edward Cawley and William Thomas Charley || Bribery, etc.; hiring cabs to convey voters to the poll || Duly elected || The cabs were to convey canvassers to workplaces. The respondents hired a gang of roughs after hearing rumours about Irish interference, which the Judges criticised. 2s. 6d. of bribery by an agent was proved in isolated acts, but this did not upset the election. || 1 O'M & H 133; HCP 1869 120 p. 138-144"]}, {"page": "1877 Salford by-election", "response": ["The Salford by-election of 1877 was fought on 19 April 1877.  The byelection was fought due to the death of the incumbent Conservative MP, Charles Edward Cawley.  It was won by the Conservative candidate Oliver Ormerod Walker."]}]}}