{"wiki_id": "http://www.wikidata.org/entity/Q5078804", "itemLabel": "Charles Harrison", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Harrison_(British_politician)", "wikipedia_page": {"main": "Charles Harrison (1 August 1835 – 24 December 1897) was a British Liberal Party politician.\nHarrison was born in Muswell Hill, Middlesex, and was the third son of Frederick Harrison, a stockbroker, and his wife, Jane Brice. He was educated at King's College School and King's College London. In 1858 he entered business as a solicitor at the firm of his uncle, also named Charles Harrison. He acquired a large practice in his own right, with major clients being the London Chatham and Dover Railway and the Law Fire Insurance Society. He became an advocate of the rights of tenants to purchase their properties and of the provision of housing for the working classes. In this he was in agreement with the policies of the Radical wing of the Liberal Party. In 1886, he married Lady Harriet Barlow.\nHis active involvement with politics came with the creation of the London County Council in 1889. He was elected as one of the council's first members, representing Bethnal Green South West as a member of the Liberal-backed Progressive Party. He was a leading member of the council, and vice-chairman from 1892 – 1895. His interests in the government of the capital led him to call for the municipalisation of the London docks and the unification of the City of London with the county.\nOn two occasions Harrison stood for election to the United Kingdom House of Commons on behalf of the Liberals. In 1892 he failed to be elected at Plymouth. He stood again at the ensuing general election in 1895, and became one of the town's two members of parliament, while continuing to hold his seat on the London County Council.\nHarrison became suddenly ill with inflammation of the throat at the funeral of Sir Frank Lockwood on 23 December 1897 and died at his London home on the following day from heart failure.\n\n", "link_mentions": {}}}