{"wiki_id": "http://www.wikidata.org/entity/Q5078396", "itemLabel": "Charles Green", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Green_(businessman)", "wikipedia_page": {"main": "Charles Alexander Green  is a British businessman and was the Chief Executive of Rangers Football Club. Born in Mexborough in South Yorkshire he started his career as a professional footballer but failed to make a first-team appearance at either Sheffield United or Doncaster Rovers before drifting into non-league. Following a switch to business he has since held a number of positions before taking over at Rangers, including a period as Chief Executive of Sheffield United.", "link_mentions": [{"page": "Rangers F.C.", "response": ["Charles Green agreed a deal with the administrators of The Rangers Football Club plc to purchase the company for £8.5 million if a proposed CVA was agreed or to purchase its business and assets for a £5.5million if the proposed CVA were to be rejected. On 14 June 2012, the formal rejection of the proposed CVA meant that the company would enter the liquidation process. The accountancy firm BDO was appointed to investigate the years of financial mismanagement at the club.", "On 14 June 2012, hours after the CVA's rejection, Sevco Scotland Ltd, a new company formed by Charles Green's consortium for this eventuality, completed the purchase of the business and assets of The Rangers Football Club Plc and then, on 18 June 2012, formally applied to acquire the SPL share of The Rangers Football Club plc. On 4 July, SPL clubs voted by 10–1 to reject the application with Kilmarnock abstaining and the old Rangers company voting in favour. Thereafter, an application to the Scottish Football League was successful with Rangers securing associate membership on 13 July 2012 at an SFL meeting by a vote of 29–1. The SFL member clubs voted that Rangers should enter the fourth tier of Scottish Football, Scottish Third Division for the 2012–13 season, rather than the Scottish First Division."]}, {"page": "Scottish Premier League", "response": ["In March 2013, Rangers chief executive Charles Green suggested that Rangers could join the Football Conference and that EU competition law banning restraints of trade could be used to overcome any legal barriers to such a plan. Green also suggested that Rangers and Celtic would not be playing in the Scottish league system in ten years time. Scotland manager Gordon Strachan said he believed the Old Firm clubs would join a future new 38-club two-division European Super League.", "SPL clubs were badly affected by the late 2000s financial crisis and UK economic recession. The 21st PWC annual review found that SPL clubs made a collective loss of £22 million during the 2008–09 season, although this loss was almost entirely due to problems at two clubs. Rangers incurred a £14 million loss after losing most of their European revenues due to an early defeat by FBK Kaunas, while Hearts lost £8 million. In 2010, Hearts was described by The Scotsman as the only true financial \"basket case\" in the SPL, with the club having a wages-to-turnover ratio of 126% and debt of over three times turnover. Rangers stabilised financially in the next two seasons, thanks to income generated from Champions League participation. Rangers entered administration on 14 February 2012, owing an approximate £9 million in unpaid taxes and with an ongoing tribunal with HMRC. HMRC blocked a proposed Company Voluntary Arrangement in June 2012, forcing preferred bidder Charles Green to use a new company to buy out the business and assets of Rangers. Weeks before the SPL merged into the Scottish Professional Football League, Hearts became the sixth SPL club to enter administration."]}, {"page": "Ibrox Stadium", "response": ["Rangers became insolvent in February 2012 and was unable to reach a company voluntary arrangement with its creditors, principally HM Revenue and Customs. Ibrox Stadium, along with the business and other assets of Rangers, was sold in June 2012 to a new company run by Charles Green. The new company obtained the SFA membership of the old Rangers FC company and gained entry to the Scottish Football League Third Division."]}, {"page": "Ally McCoist", "response": ["Following the rejection of a company voluntary arrangement by HM Revenue & Customs, the business and assets of the company running Rangers were sold to a consortium led by Charles Green. McCoist decided to stay after talks with Green. McCoist then worked alongside Green as the club were placed in the Scottish Third Division."]}, {"page": "Walter Smith", "response": ["Rangers entered administration in February 2012. An attempt to take the club out of administration by means of a creditors voluntary arrangement was rejected by HM Revenue & Customs, the largest creditor, putting the club into liquidation in June 2012. The administrator, Duff & Phelps, sold the assets of Rangers to a consortium led by Charles Green. Smith said that he was leading a consortium offering a deal to buy the assets from Green, but this offer was withdrawn days later. On 11 November 2012, Smith returned to Ibrox taking on a role with the new Rangers company as a non-executive director. Smith was appointed non-executive chairman in May 2013, but he resigned from the board in August."]}, {"page": "Carlos Bocanegra", "response": ["After Rangers FC went into administration, in June 2012 the company's assets, including the players' contracts, were purchased by Charles Green's consortium. Although many players departed because of this, Bocanegra's future was uncertain after not attending training, as he wanted to leave in order to play at a higher level. A few weeks later, on July 29, 2012, McCoist appointed Bocanegra captain for the first round of the Challenge Cup- a 2–1 win over Brechin City. After the game Bocanegra announced his intention to stay, vowing not to walk away from the club. He then made six appearances at the start of the season. After being dropped by the national team, Bocanegra joined Racing de Santander on a season-long loan in an attempt to keep his international career alive."]}, {"page": "Rangers Training Centre", "response": ["On 14 June 2012, after the Administration and liquidation of The Rangers Football Club Plc, the training facility was sold along with other Rangers' assets, in a deal worth £5.5m, to The Rangers Football Club Ltd - a consortium led by Charles Green. In July 2014, there was speculation that the Rangers board was looking to sell the facility in order to raise money, due to a fan boycott of season tickets.", "The use of the name Murray Park significantly reduced after the club was sold to Craig Whyte in 2011. Moreover, after the liquidation of the company running the club and its assets, many fans held David Murray partly or wholly responsible, and so began calling the facility Auchenhowie (after the geographic area where it is based). In June 2012, the then Rangers Chief executive Charles Green stated he would ask Rangers season ticket holders to vote on renaming the club's training ground. Green proposed that it could be renamed the Moses McNeil Academy or the Davie Cooper Academy after former Rangers players. In June 2016, then chairman Dave King revisited the issue of the renaming of Murray Park and asked Rangers fans to suggest an alternative name."]}, {"page": "Charles Green", "response": ["Charles Green may refer to:", "* Charles Green (painter) (1840–1898), English painter and illustrator", "* Charles Green Shaw (1892–1974), American abstract artist and writer", "* Sir Charles Green, 1st Baronet (1749–1831), British Army general", "* Charles Green (Australian soldier) (1919–1950)", "* Charles Green (cricketer) (1846–1916), English cricketer", "* Charlie Phil Rosenberg or Charles Green (1902–1976), American boxer, world champion bantamweight", "* Charles Green (bobsleigh) (1914–1999), British Olympic bobsledder", "* Charles Green (athlete) (1921–2009), Australian Olympian", "* Charles Green (astronomer) (1734–1771), British astronomer, traveled with James Cook", "* Charles Green (balloonist) (1785–1870), England's most famous balloonist of the 19th century", "* Charles Green (bishop) (1864–1944), Archbishop of Wales", "* Charles Green (cook) (1888–1974), British ship's cook on Shackleton's Endurance expedition", "* Charles Green (archaeologist) (1901–1972), English archaeologist", "* Charles Green (businessman) (born 1953), British businessman with Rangers F.C. and Sheffield United F.C.", "* Charles Greene (disambiguation)"]}, {"page": "Lee McCulloch", "response": ["His commitment to the cause was never under question, and he made it clear from the outset that no matter what happened to the club, he would be staying at Ibrox. The business and assets of Rangers, including player registrations, were purchased by a brand new company led by Charles Green. While many players opted out of joining the new company, McCulloch was one of the few senior players who accepted the transfer. Rangers entered the Scottish Football League Third Division, the fourth tier of the Scottish football league system. He scored in extra time to give Rangers a 2–1 victory against Brechin City in the Scottish Challenge Cup on 29 July 2012. McCulloch was given the captaincy on 1 September 2012 after the departure of Carlos Bocanegra to Racing Santander on a season-long loan and on 31 October, he signed a contract extension with Rangers committing him until 2015."]}, {"page": "Steven Whittaker", "response": ["Rangers entered administration in February 2012 and were subsequently liquidated. Charles Green, who bought the business and assets of Rangers from the administrator, attempted to transfer the player contracts to a new Rangers company. Whittaker was one of several players to object to this proposal. PFA Scotland had previously commented that players were entitled to become free agents if they objected to the transfer. Whittaker explained himself in a news conference, saying, \"I'm 28 and I want to play at the top level for as much as I can. It doesn't look like Rangers will be in the SPL and there's no European football. We owe no loyalty to the new club. There is no history there for us.\""]}, {"page": "John Brown (footballer, born 1962)", "response": ["Brown made an unsuccessful attempt to take control of Rangers from the Sevco consortium, led by Charles Green, in July 2012; earlier he had spoken to the media regarding the problems at the club, and made an passionate speech to a crowd of fellow supporters at the main entrance to Ibrox Stadium."]}, {"page": "Neil Alexander", "response": ["Rangers entered administration and were subsequently liquidated in 2012. Charles Green purchased the business and assets of Rangers, including player contracts, from the administrator. Alexander was one of three senior players who agreed to have his contract switched to Green's company, and was one of 13 players who turned up for the club's first training session following the sale. Allan McGregor refused to transfer his contract, which meant that Alexander became first choice 'keeper at Rangers as they embarked on a campaign in the fourth tier of the Scottish football league system. Alexander later commented that he did not see himself as a \"Third Division player\" but had decided to remain with the club for the \"chance to be number one at such a massive club.\" He remained ever present through the 2012–13 league campaign for Rangers as the club dominated the Third Division, winning the league title by 24 points from second place Peterhead."]}, {"page": "History of Rangers F.C.", "response": ["On 13 May it was reported that Whyte sold his controlling interest in The Rangers Football Club Plc for £2 to a consortium led by Charles Green. Green offered the creditors a settlement, in the form of a company voluntary arrangement (CVA), in an attempt to exit administration. On 12 June 2012, it emerged that HMRC would reject the CVA put forward by Green. Green's takeover of the club depended on the CVA being accepted by HMRC, which would have seen £8.5m of the total debt repaid. The formal rejection of the CVA, two days later, meant that The Rangers Football Club plc entered the liquidation process. The company's business and assets were sold to a company called Sevco Scotland Ltd, a consortium led by Green, in a deal worth £5.5m. Sevco was subsequently renamed The Rangers Football Club Ltd at the end of July 2012.Rangers crisis: Dave King flies into Glasgow to hold talks over newco club STV TV, 18 June 2012", "Rangers fan discontent was demonstrated with a during a Championship game against Queen of the South at Ibrox, with fans holding up red cards in the 18th and 72nd minutes and this was not improved when, on 3 September, it was reported that Mike Ashley bought the naming rights to Ibrox Stadium for just £1 in a deal with Charles Green in 2012. Concurrently, Rangers former commercial director Imran Ahmad finally succeeded in a bid to have £620,000 of club assets frozen prior to pursuing litigation over an alleged unpaid £500,000 bonus. A few days later the club were granted leave to appeal this decision yet, on 12 September, the club agreed to a settlement with Ahmad much to the dismayed of fans. As some Rangers supporters groups considered boycotting home matches in protest at the board, it was reported that Ashley would not be participating in the share offer.", "The spectre of the previous board loomed large at the beginning of the season as Police Scotland's investigation into the sale of Rangers' assets to a consortium led by Charles Green led to arrests and seven indictments. On 1 September, both Craig Whyte and Green were arrested as part of the inquiry into the \"alleged fraudulent acquisition\" of Rangers' assets in 2012. Just over two weeks later indictments were served on seven accused, including Green and Whyte, David Whitehouse, Paul Clark, David Grier, who were all working for administrators Duff and Phelps at the time, Gary Withey who worked for a law firm involved in the purchase of Rangers by Whyte and Imran Ahmad, a former Rangers commercial director. Indeed, the latter indidcated that he would not co-operate with the proceedings, subsequently a warrant was issued for his arrest and charges against him were temporarily stopped. A week later, Green took the company to the Court of Session in an attempt to force the PLC to pay his legal fees with regards to the forthcoming trial, however, the action was dismissed by Lord Doherty a few months later and an appeal to the Inner House was also refused in March 2016.", "On 30 October, Rangers announced it was not appropriate to proceed with a share issue and listing on the ISDX market until the criminal proceedings being brought against Charles Green, Imran Ahmed, Craig Whyte and others was concluded. On 5 February 2016, prosecutors have withdrawn six of 15 charges brought against six men in the alleged Rangers fraud case which resulted in all charges against Duff and Phelps administrators David Whitehouse and Paul Clark being dropped, although prosecutors indicated there would be filing fresh charges against the pair. Charges against Green were also dropped meaning that the former chief executive of the club was not facing any. A few months later, in May 2016, it was announced that charges against Gary Withey and David Grier were dropped and they would not stand trial alongside former Rangers owner Craig Whyte, the only person still facing charges.", "Away from football, the board instigated court proceedings against four of its former executives and investor Mike Ashley. The case against former chief executives Charles Green and Derek Llambias, former commercial director Imran Ahmad, former financial director Brian Stockbridge and Ashley was brought regarding a loss of income caused by retail deals agreed between the company that owns the club and Sports Direct from 2012 to 2015. Details of Rangers legal claim was revealed on 12 August after Ashley's lawyers succeeded in a bid to the documents disclosed. According to the papers lodged with the Court of Session, Rangers sought approximately £4.1m in damages caused by alleged negligence by Green and other club staff from which Ashley unfairly benefited. Rangers regained representation at a domestic football level as Managing director Stewart Robertson was appointed to the SFA professional game board, although Robertson had initially signalled his intent to stand for the SPFL board but withdrew due to a lack of support. Meanwhile, the former Rangers owner Craig Whyte was the only person facing fraud charges relating to the liquidation of The Rangers Football Club Plc, proceedings began in June. In a bizarre twist, former Rangers vice-chairman Donald Findlay QC was appointed to Whyte's legal team and defended Whyte when he faced charges relating to the acquisition of the club in May 2011 and its subsequent financial mismanagement. On 22 December, at his pre-trial Whyte entered a not guilty plea at the High Court in Glasgow. The trial concerning accusations of fraudulent acquisition of the club began in April 2017, with former Rangers managers Walter Smith and Ally McCoist called to give evidence about the financial situation at the Oldco preceding Whyte's reign."]}, {"page": "Dorin Goian", "response": ["After Rangers FC went into administration in June 2012, the companies's assets were purchased by Charles Green's consortium including the players' contracts. After insisting he would stay no matter what, when news broke that Rangers were set to play in the Third Division, Goian had a change of heart.The Daily Telegraph However, he featured for Rangers in their 2–1 win against Brechin City in the Challenge Cup. At the end of the 2012–13 season, Goian announced his intention to play in England in near future. Eventually, Goian, along with Carlos Bocanegra was released by the club, ending his two years at the club and in total, Goian made 30 appearance; scoring once. Upon his release, The Herald reports that Goian received £430,000 (€500,000), according to his agent."]}, {"page": "Kyle Lafferty", "response": ["In June 2012, Lafferty lodged an objection against his contract being transferred from Rangers to the new company set up by Charles Green. PFA Scotland had previously commented that players were entitled to become free agents if they objected to the transfer. Lafferty later raised a constructive dismissal claim against Rangers. ", "Lafferty signed a three-year contract with Swiss Super League club FC Sion on 30 June 2012. He was unable to play in the league match against Grasshoppers on 15 July because the Scottish Football Association refused to provide clearance for the transfer, having received an objection from Rangers' owner Charles Green. On 20 July, Lafferty received provisional international clearance from FIFA which allowed him to play while arbitration over his move from Rangers continued. On 22 July 2012, Lafferty made his debut for Sion, coming on as a substitute in a 1–0 win over Servette. He scored his first goal a week later in a 3–0 win over Luzern."]}, {"page": "Allan McGregor", "response": ["Rangers entered administration in February 2012. After its creditors rejected a CVA in June 2012, the company was liquidated. The administrator sold the assets, including player contracts, to a new Rangers company set up by Charles Green. McGregor made a legal objection (under the \"TUPE\" regulations) to his contract being transferred to the new company, and became a free agent."]}, {"page": "Juanma Ortiz (footballer, born 1982)", "response": ["Following Rangers' liquidation after they entered administration, several players refused to have their contracts transferred to a new company set up by Charles Green, and both Ortiz and the club agreed on having his link terminated. On 10 July 2012, he signed a two-year contract with Granada CF."]}, {"page": "John Fleck (footballer)", "response": ["In June 2012, Fleck lodged an objection against his contract being transferred to the newco set up by Charles Green. PFA Scotland had previously commented that players were entitled to become free agents if they objected to the transfer."]}, {"page": "Timeline of Scottish football", "response": ["*Rangers enter administration with debts attaining several tens of millions of pounds, including amounts due to HM Revenue & Customs (HMRC). Rangers FC plc is liquidated after HMRC rejects a CVA offer from Charles Green, the preferred bidder. Green instead buys the business and assets of Rangers from the administrator and forms a new Rangers company, which is denied entry to the Scottish Premier League and is instead admitted into the Scottish Football League Third Division."]}, {"page": "Francisco Sandaza", "response": ["After admitting to a telephone hoaxer, who claimed to be a football agent, that he was only at Rangers for the money and would leave if an alternative offer was made, suitable for the club as well, he was suspended by the club. He did not appear in training or play for the club again after that incident. During his suspension, Sandaza feared his Rangers career might be over as he suspected that club owner Charles Green wished to sell him. That fear was proven correct as the club, after an investigation into the 'hoax agent' incident, terminated his contract subject to the right of appeal. Shortly after his release, Sandaza attempted to sue the club over this breach of contract. On 18 July 2013, Sandaza dropped his lawsuit against the club and the hoaxer."]}, {"page": "Kyle Hutton", "response": ["In October 2012, after returning from loan spells with Partick Thistle and Dunfermline Athletic, Hutton hoped his performances could see him feature more regularly for the first team. Ahead of the 2012–13 season Hutton agreed to transfer to Charles Green's new holding company saying, \"For me, it is in my best interests to stay where I am and to try to establish myself in the side next season. I feel I've got a lot more to give the club.\" After starting in Rangers' first league game of the season against Brechin City in late July, Hutton wouldn't feature again till late September, coming on as a substitute in the League Cup against Motherwell for the injured Francisco Sandaza. His performance earned many plaudits, with Hutton saying afterwards he was 'in the dark' over why he hadn't featured more. In November 2013, Hutton suffered a broken leg, ruling him out of action on a long-term basis."]}, {"page": "2011–12 Rangers F.C. season", "response": ["On 13 May it was revealed that Whyte sold his controlling interest in The Rangers Football Club Plc for £2 to a consortium led by Charles Green. Green offered the creditors a settlement, in the form of a company voluntary arrangement (CVA), in an attempt to exit administration. On 12 June 2012, it emerged that HMRC would reject the CVA put forward by Green. Green's takeover of the club depended on the CVA being accepted by HMRC, which would have seen only £8.5m of the total debt repaid. The formal rejection of the CVA, two days later, meant that the Rangers Football Club Plc entered the liquidation process and the clubs corporate owner would have to be transferred to a new company. The oldco's assets, including Rangers F.C., Ibrox Stadium and Rangers Training Centre, were sold to Sevco 5088 Ltd, a consortium led by Green, in a deal worth £5.5m.| url=http://news.stv.tv/scotland/106688-rangers-crisis-dave-king-flies-into-glasgow-to-hold-talks-over-newco-club/  | title=Rangers crisis: Dave King flies into Glasgow to hold talks over newco club | publisher=STV sport | date=18 June 2012| accessdate=19 June 2012}}"]}, {"page": "2012–13 Rangers F.C. season", "response": ["Turmoil continued inside Ibrox Stadium despite the return of Walter Smith as a non-executive director in November 2012. The company owning the club, Rangers Football Club Ltd, was floated on the stock exchange the following month, raising over £22m from an Initial public offering. The tenure of Charles Green as chief executive proved volatile, with a number of contentious issues arising throughout the season.  This included the sacking of Spanish striker Francisco Sandaza for reportedly attempting to negotiate transfer away from the club, and allegations from former chairman Craig Whyte that he and Green had an agreement over the purchase of Rangers that allowed Whyte to retain a stake in the company. An internal investigation by the club later concluded that there was no link between Green and Whyte. The culmination of Green's tenure resulted in him resigning as chief executive after the club launched an internal investigation into alleged racist remarks Green had made to commercial director Imran Ahmad.", "On a busy day in April, the SFA wrote to Rangers chief executive Charles Green seeking clarification about his business dealings with Craig Whyte, the Police carried out a series of searches relating to the purchase of Rangers Football Club by Craig Whyte from Sir David Murray and Whyte was ordered to pay £18m to the finance firm Ticketus after he lost a claim against him at the High Court in London."]}, {"page": "Administration and liquidation of The Rangers Football Club plc", "response": ["The refusal of the CVA forced the administrators to sell the business and assets of Rangers to a new company, operated by Charles Green. The other member clubs of the Scottish Premier League refused to allow the new company to adopt the league membership of the old company. Green then successfully applied for membership of the Scottish Football League. After obtaining the old company's Scottish Football Association (SFA) membership, Rangers (now trading as The Rangers Football Club Ltd) entered the Third Division (the fourth tier of the Scottish football league system) in time for the 2012–13 season. Rangers gained promotion to the first tier of the Scottish leagues in 2016, and in 2021 won their first Scottish league title since the insolvency.", "Following the rejection of the CVA, the business and assets of Rangers were sold to Sevco Scotland Ltd, a company owned by a consortium led by Charles Green. While the manager, Ally McCoist and a number of players were willing to transfer, other first team players such as team captain Steven Davis, Steven Naismith and Steven Whittaker refused to have their contracts transferred under TUPE regulations and became free agents. This was disputed by Duff & Phelps, who stated that Green purchased the players contracts and registrations. Rangers subsequently agreed a fee for Davis with Southampton, while Charles Green pursued claims in relation to Naismith and Whittaker.", "Another consortium, led by former Rangers manager Walter Smith, made a last minute bid for the assets. This was rejected by Duff & Phelps, who already had a binding agreement to sell them to Charles Green. Walter Smith's consortium, including Scottish businessmen Douglas Park and Jim McColl, made a £6million offer that was also turned down. Charles Green then offered Walter Smith a role and the opportunity for his consortium to invest in the club. On 19 June 2012, Walter Smith and his consortium pulled out from trying to acquire the relaunched club. Smith's consortium was originally hostile to Charles Green's consortium but stated that \"We wish the new Rangers Football Club every good fortune.\"", "Charles Green responded by ridiculing what he saw as the posturing of Walter Smith and John Brown: \"It's not right that every two weeks a Mel Gibson appears, delivers a Braveheart statement, then doesn't deliver anything.\" Malcolm Murray, installed as Chairman of Rangers, appealed for an end to \"factionalism\" and said: \"The vicious bloodlust must end, not only for Rangers’ sake but for Scottish football.\"", "As a result of the Rangers business and assets being sold to a new company when The Rangers Football Club plc entered liquidation, the extent to which the sporting identity of the relaunched Rangers can be regarded as a continuation of the club founded in 1872 has been disputed. Rangers Football Club post-2012 was described by some in the mainstream media as a \"new club\", whilst Charles Green maintained \"this is still Rangers\", and the SPL chief executive Neil Doncaster stated \"it is an existing club, even though it's a new company\".", "In late 2012, the SPL set up an investigation, chaired by Lord Nimmo Smith, into alleged use of dual contracts by Rangers through the EBT scheme. David Murray denied any cheating took place during his ownership of Rangers, while Alastair Johnston and Charles Green questioned the independence of the investigation. The enquiry found that Rangers had deliberately failed to disclose the trust payments to withhold information from HMRC and fined the old company £250,000. It had been anticipated that the investigation would revoke honours won by Rangers during the period between 2001 and 2009 when the trust payments were made (three League titles, four Scottish Cups and four League Cups), but this was not done because it was considered that Rangers had not obtained any sporting advantage by withholding information.", "On 2 September 2015 Whyte appeared at Glasgow Sheriff Court along with Charles Green; Whyte was charged with conspiracy as well as a charge under Criminal Justice and Licensing (Scotland) Act 2010 Section 28(1). On 6 June 2017, after a lengthy trial at Glasgow High Court (with Donald Findlay acting as his defence attorney), Whyte was acquitted of all charges."]}, {"page": "Ownership of Rangers F.C.", "response": ["Sevco Scotland Ltd was formed on 29 May 2012 as a means for Charles Green to acquire the assets of Rangers FC. Sevco Scotland Ltd (subsequently renamed The Rangers Football Club Ltd.) was formed to ensure that if the formation of a new company was required in the event of a CVA being rejected, then the club's corporate entity would be a Scottish registered company as it has always been. When the CVA failed the assets of The Rangers Football Club Plc (subsequently renamed RFC 2012 plc) were then sold for £5.5 million. Charles Green also incorporated another company, Sevco 5088 Limited, on 29 March 2012, which lent some money to The Rangers Football Club Ltd in May 2012.", "As a result of the liquidation process, the extent to which Rangers can be regarded as a continuation of the club founded in 1872 has been interpreted differently. Rangers Football Club has been described by some in the mainstream media as a \"new club\", whilst Chief Executive Charles Green has maintained \"this is still Rangers\", with the SPL chairman Neil Doncaster saying \"it is an existing club, even though it's a new company\".", "Towards the end of August 2012, it was reported that Arif Naqvi, chief executive of private equity firm Abraaj Capital, owned just under 18% of The Rangers F.C. Ltd's shares via Blue Pitch Holdings, after having agreed to invest £2m in June 2012. Other investors included Imran Ahmad and Richard Hughes, from Zeus Capital, owning 9.8% each (Hughes has a 6.8% stake in Rangers). Rangers manager Ally McCoist was reported to own a share of about 4.5% with Scottish-based businessman Ian Hart, who was part of the Blue Knights group, also owning a shareholding of 1.3%. The Blue Knights were one of several groups or individuals that had expressed an interest in taking over the club. Other shareholders in the club revealed included Alessandro Celano and Chris Morgan.Charles Green Statement Rangers.co.uk, 14 June 2012 ", "After the formation of new holding and listed company for the club: Rangers International F.C. plc (RIFC), it was reported in an AIM announcement on 5 December 2012 that Charles Green owned a 14.9% shareholding in the club, with Newcastle United owner Mike Ashley having an 8.9% stake. Green and Ashley's shares were projected to fall to 8.67% and 5.20% of the share capital of RIFC respectively after the company's flotation on the stock market and acquisition of the entire share capital of the club. Other shareholders, both before and after the flotation, were also revealed including Blue Pitch Holding, Margarita Funds Holding Trust, Craig Mather, Norne Anstalt, Legal & General Investment Management Limited, Insight Investment Management (Global) Limited, Cazenove Capital Management Limited, Hargreave Hale Limited and Artemis Investment Management LLP.", "After departing as Chief Executive, Charles Green sold his shareholding to Sandy Easdale, co-owner of McGill's Bus Services. Easdale increased his stake to 4.52% in November 2013, and then to 5.21% in September 2014.  Easdale also holds the voting rights for 20.94% of the company, giving him control of 26.15% of the issued share capital in total."]}, {"page": "Malcolm Murray (businessman)", "response": ["On 14 June 2012, following the financial difficulties of  Rangers and subsequent takeover by Charles Green's consortium, Murray was appointed as new chairman of the club. It was revealed that Murray is a lifelong fan of Rangers and a season ticket holder."]}, {"page": "Craig Mather", "response": ["Mather joined the club in 2012, shortly after it fell into administration, purchasing a 10% stake for £1 million.Rangers: Craig Mather makes 'emotional' investment - BBC Sport, 18 July 2012 In April 2013 he was appointed CEO following the departure of Charles Green, on a salary of £500,000.Rangers: Craig Mather defiant over move to oust him - BBC Sport, 3 August 2013Rangers: Concern over chief executive Craig Mather's salary - BBC Sport, 22 July 2013 He left the club in October 2013, citing \"incessant attempts to destabilise the operations of the club\".Rangers chief executive Craig Mather resigns with Bryan Smart - BBC Sport, 16 October 2013 He was replaced as CEO by Graham Wallace, COO of Manchester City. Rangers Announce New CEO   - Rangers FC, 20 November 2012"]}, {"page": "2013–14 Rangers F.C. season", "response": ["Off the field issues continued to overshadow the team, although initially things seemed to have pacified when former manager Walter Smith was appointed as chairman of the Plc board in May, however, he lasted less than two months before resigning. Smith's departure coincided with the return of former Chief executive Charles Green in a consultant capacity. Green became embroiled in a row with Rangers manager Ally McCoist after her suggested that McCoist had to win a cup as well as League One that season to save his job. Ultimately, Green's influence was seen to be more damaging than positive and he agreed to resign his position and sell his remaining shares in the club to Sandy Easdale. A second former board member, Imran Ahmad, also sold his remaining shares in the club as it was reported he was preparing to sue the club for £3.4m in unpaid bonus money. Meanwhile, a group of Rangers shareholders, led by former director Paul Murray, requisitioned an EGM to vote on the removal of Plc board directors including chief executive Craig Mather. This was partly the result of shareholders being concerned over Mather's £500,000 annual salary. The Rangers board opening negotiations with the requisitioners in late August to delay the EGM and combine it with AGM business and after prolonged and fictitious meetings the requisitioners withdrew the request for an EGM. Nevertheless, the requisitioners were not to be deterred and wrote to Rangers with a proposal to have four new directors appointed at the AGM, however the board failed to put this motion on the agenda forcing the requisitioners to seek an interim interdict in order for a new agenda to be sent out thus delaying the AGM."]}]}}