{"wiki_id": "http://www.wikidata.org/entity/Q5079476", "itemLabel": "Charles Jasper Joly", "itemDescription": "Irish mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Jasper_Joly", "wikipedia_page": {"main": "Charles Jasper Joly (27 June 1864 – 4 January 1906) was an Irish mathematician and astronomer who became Royal Astronomer of Ireland.", "link_mentions": [{"page": "William Rowan Hamilton", "response": ["When he died, Hamilton was working on a definitive statement of quaternion science. His son William Edwin Hamilton brought the Elements of Quaternions, a hefty volume of 762 pages, to publication in 1866. As copies ran short, a second edition was prepared by Charles Jasper Joly, when the book was split into two volumes, the first appearing 1899 and the second in 1901. The subject index and footnotes in this second edition improved the Elements accessibility."]}, {"page": "Quaternion", "response": ["*Hamilton (1899) Elements of Quaternions volume I, (1901) volume II. Edited by Charles Jasper Joly; published by Longmans, Green & Co.."]}, {"page": "John Joly", "response": ["Joly was born in Holywood House (the Church of Ireland Rectory), Bracknagh, County Offaly, Ireland. He was a second cousin of Charles Jasper Joly, the astronomer. He entered Trinity College, Dublin in 1876, graduating in Engineering in 1882 in first place with various special certificates in branches of engineering, at the same time obtaining a First Class Honours in modern literature. He worked as a demonstrator in Trinity's Engineering and Physics departments before succeeding William Johnson Sollas in the Chair of Geology and Mineralogy in 1897, a position which he held until his death in 1933 in Dublin."]}, {"page": "Hyperbolic quaternion", "response": ["In 1899 Charles Jasper Joly noted the hyperbolic quaternion and the non-associativity property while ascribing its origin to Oliver Heaviside."]}, {"page": "E. T. Whittaker", "response": ["In 1906, Whittaker was appointed Andrews Professor of Astronomy at Trinity College Dublin, which came with the title Royal Astronomer of Ireland. He succeeded Charles Jasper Joly at the post and was appointed upon recommendation from the astronomer Robert Stawell Ball. Ball's recommendation, which was published in a collection of his letters in 1915, stated that Whittaker was the only person he knew who could \"properly succeed Joly\" and that the role would \"suit him in every way\". He then describes Whittaker as \"modest\" and \"charming\" and as \"a man who has infinite capacity for making things go\". Ball claims that Whittaker was a world leading expert in theoretical astronomy and that, in relation to Whittaker's discovery of a general solution to Laplace's equation, notes that he \"has already made one discovery which the greatest mathematician of the last two centuries would be proud to have placed to his credit\". The Royal Astronomers acted as directors for the Dunsink Observatory, which used outdated astronomy equipment; it was understood that the primary responsibility of the role was to teach mathematical physics at Trinity College. During this time, the relative leisure of his post allowed him to complete the reading required to write his third major book A History of the Theories of Aether and Electricity, from the age of Descartes to the close of the nineteenth century. Also during this time, he wrote the book The Theory of Optical Instruments, published six astronomy papers, and published collected astronomical observations."]}, {"page": "Biquaternion", "response": ["Hamilton's primary exposition on biquaternions came in 1853 in his Lectures on Quaternions. The editions of Elements of Quaternions, in 1866 by William Edwin Hamilton (son of Rowan), and in 1899, 1901 by Charles Jasper Joly, reduced the biquaternion coverage in favor of the real quaternions.", "*Hamilton (1899) Elements of Quaternions volume I, (1901) volume II. Edited by Charles Jasper Joly; published by Longmans, Green & Co.."]}, {"page": "Dunsink Observatory", "response": ["|1897–1906 ||data-sort-value=\"Joly\"| Charles Jasper Joly || Andrews Professor of Astronomy, Royal Astronomer of Ireland  || Died in office"]}, {"page": "Joly", "response": ["*Charles Jasper Joly (1864–1906), Irish mathematician and astronomer "]}, {"page": "History of quaternions", "response": ["* 1899 Charles Jasper Joly: Elements vol 1, vol 2 1901Hamilton (1899) Elements of Quaternions volume I, (1901) volume II. Edited by Charles Jasper Joly; published by Longmans, Green & Co., now in Internet Archive", "* 1905 C.J. Joly's Manual for QuaternionsCharles Jasper Joly (1905) A Manual for Quaternions (1905), originally published by Macmillan Publishers, now from Cornell University Historical Math Monographs"]}, {"page": "Quaternion Society", "response": ["The first president was Robert Stawell Ball, and Alexander Macfarlane served as secretary and treasurer. In 1905 Charles Jasper Joly took over as president and L. van Elfrinkhof as treasurer, while Macfarlane continued as secretary. In 1909 Macfarlane became president, James Byrnie Shaw became secretary, and van Elfrinkhof continued as treasurer. The next year Macfarlane and Shaw continued in their posts, while Macfarlane also absorbed the office of treasurer. When Macfarlane died in 1913 after nearly completing the issue of the Bulletin, Shaw completed it and wound up the association."]}, {"page": "List of fellows of the Royal Society J, K, L", "response": ["| Charles Jasper Joly||5 May 1904||27 June 1864 – 4 January 1906"]}, {"page": "List of fellows of the Royal Society elected in 1904", "response": ["*Charles Jasper Joly (1864–1906)"]}, {"page": "C. J. Joly", "response": ["#REDIRECT Charles Jasper Joly"]}]}}