{"wiki_id": "http://www.wikidata.org/entity/Q5076029", "itemLabel": "Charles Cadogan, 2nd Earl Cadogan", "itemDescription": "British earl", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Cadogan,_2nd_Earl_Cadogan", "wikipedia_page": {"main": "Charles Henry Sloane Cadogan, 2nd Earl Cadogan (29 November 1749 – 23 December 1832) was a British nobleman, styled Viscount Chelsea from 1800 to 1807.\nThe eldest child of Charles Cadogan, 3rd Baron Cadogan and Frances Bromley, he was baptised on 13 December 1749 at St George's, Hanover Square. He became 2nd Earl Cadogan on the death of his father in 1807.He served briefly in the British Army in his youth. By the time he had inherited, he had already become a lunatic. He died unmarried in Enfield and so his title passed to his half-brother George Cadogan, 3rd Earl Cadogan. He was buried at Chelsea on 3 January 1833 and his will was probated in July that year.", "link_mentions": [{"page": "George Cadogan, 3rd Earl Cadogan", "response": ["The untimely deaths of six of Cadogan's seven brothers brought him the title of Earl Cadogan (which his father had been awarded in 1800) on the death of his eldest brother Charles Cadogan, 2nd Earl Cadogan in 1832. Cadogan took his seat in the House of Lords, but remained a prominent naval officer, continuing to rise in the service and serving as aide-de-camp to King William IV between 1830 and 1837 and Queen Victoria between 1837 and 1841. By 1851, Cadogan was a vice-admiral1 July 1851. The Navy List, 1853. and in 1852 he became a fellow of the Society of Antiquaries of London."]}, {"page": "Charles Henry Sloane Cadogan, 2nd Earl Cadogan", "response": ["#REDIRECT Charles Cadogan, 2nd Earl Cadogan"]}, {"page": "Charles Cadogan", "response": ["* Charles Cadogan, 2nd Earl Cadogan (1749–1832), British nobleman, styled Viscount Chelsea from 1800 to 1807"]}, {"page": "Charlotte Paget, Marchioness of Anglesey", "response": ["She was the daughter of the former Mary Churchill and Charles Cadogan, 1st Earl Cadogan, MP for Cambridge and Master of the Mint.  Among her siblings were Henry Cadogan (who was killed at the Battle of Vitoria), George Cadogan, 3rd Earl Cadogan, and Lady Emily Cadogan (who married Gerald Valerian Wellesley, a brother of her first husband, both sons of Garret Wesley, 1st Earl of Mornington). Her father's first wife, the former Hon. Frances Bromley (a daughter of Henry Bromley, 1st Baron Montfort) and from that marriage, she had several older half-siblings, including Charles Cadogan, 2nd Earl Cadogan, Rev. William Cadogan, Thomas Cadogan (a naval officer lost at sea aboard HMS Glorieux), and George Cadogan (who was killed in India while an officer in the HEIC Army)."]}]}}