{"wiki_id": "http://www.wikidata.org/entity/Q5076591", "itemLabel": "Charles Cunliffe", "itemDescription": "English cricketer (1858-1884)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Cunliffe", "wikipedia_page": {"main": "Charles Morley Cunliffe (2 September 1858 – 15 October 1884) was an English amateur cricketer who played for Kent County Cricket Club from  1877 to 1880. Cunliffe was one of Kent's leading slow bowlers of the time but was forced to give up cricket due to ill health. He died at a young age after suffering from tuberculosis.", "link_mentions": [{"page": "Cunliffe", "response": ["*Charles Cunliffe (1858–1884), English cricketer"]}, {"page": "E. Miller (Sussex cricketer)", "response": ["Miller made a single first-class cricket appearance for Sussex County Cricket Club against Kent at the County Ground, Hove in 1878. In Sussex's first-innings, he was dismissed for a single run by Charles Cunliffe. In their second-innings, he was dismissed for the same score by George Hearne. In Kent's first-innings, Miller bowled five wicketless overs. This was his only major appearance for Sussex."]}, {"page": "George Grundy", "response": ["Grundy made two first-class appearances for Sussex in 1880 against Kent and Surrey.  In the match against Kent, Grundy was dismissed for 4 runs in Sussex's first-innings by Charles Cunliffe, while in their second-innings he was dismissed by the same bowler for 20 runs.  Kent won the match by 10 wickets.  Against Surrey, he was dismissed for 3 runs in Sussex's first-innings by Joseph Potter, while in their second-innings he scored 4 runs before he was caught by George Elliott off the bowling of Walter Read.  Surrey won the match by 4 wickets."]}, {"page": "Rivers Turnbull", "response": ["Turnbull made two first-class appearances for Sussex against Lancashire at Old Trafford in 1877, and Kent at the Old County Ground, Town Malling. In his first match, Lancashire won the toss and elected to bat, making 345 all out, during which Turnbull bowled nine wicketless overs, conceding 31 runs. In Sussex's first-innings of 241 all out, Turnbull was dismissed for a duck by Alexander Watson. Forced to follow-on in their second-innings, Sussex were dismissed for just 73 all out, with Turnbull again dismissed for a duck, this time by William McIntyre. Lancashire won the match by an innings and 31 runs. In his second match, Sussex won the toss and elected to bat, making 146 all out, with Turnbull scoring 2 runs before he was dismissed by Dick Penn. Kent responded in their first-innings by making 209 all out, with Turnbull bowling 12.3 overs for 23 runs and taking the wickets of George Hearne and James Bray. In their second-innings, Sussex were dismissed for 147 all out, Turnbull being dismissed for a duck by Charles Cunliffe. Set 88 for victory, Kent were dismissed for just 73, handing Sussex victory by 11 runs."]}, {"page": "Cunliffe, Charles", "response": ["#redirectCharles Cunliffe"]}]}}