{"wiki_id": "http://www.wikidata.org/entity/Q5076594", "itemLabel": "Charles Curran", "itemDescription": "British politician (1903-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Curran_(politician)", "wikipedia_page": {"main": "Leslie Charles Curran (1903 – 16 September 1972) was a barrister and British Conservative Party politician.", "link_mentions": [{"page": "1966 United Kingdom general election", "response": ["*Charles Curran (Uxbridge)"]}, {"page": "Michael Shersby", "response": ["Shersby was first elected to Parliament at a 1972 by-election that followed the sudden death of Charles Curran, who had re-taken the seat for the Conservatives from Labour's John Ryan in the 1970 general election.  This was a by-election Shersby had not been expected to win since it took place in the depths of unpopularity of the Heath Government and on the same night that Shersby was elected to Parliament (7 December 1972) the Conservatives lost the considerably safer seat of Sutton and Cheam by a large majority after a huge swing against the party there to the Liberal party but in Uxbridge Shersby managed to hang on to a seat taken back from Labour for the Conservatives by Charles Curran in 1970, even though the majority fell from 1970's 3,646 votes to a rather less comfortable 1,178 votes that night.  His local roots as an Ickenham born lad probably helped him considerably in that election and over the years he consistently built up his majority to a high point of 15,970 votes in the 1987 general election by establishing a reputation as an extremely committed and hardworking backbench MP more interested in being able to pursue single issues he believed in rather than pursuing the trappings of power as a minister at what would have been the expense of his political independence."]}, {"page": "Uxbridge (UK Parliament constituency)", "response": ["| Charles Curran", "| Charles Curran"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Charles Curran"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Charles Curran"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Charles Curran"]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Charles Curran"]}, {"page": "Charles Curran", "response": ["Charles Curran may refer to:", "* Charles Curran (broadcaster) (1921–1980), BBC Director-General 1969–1977", "* Charles Curran (politician) (1903–1972), British Conservative politician, MP for Uxbridge 1959–1966", "* Charles Curran (theologian) (born 1934), American Catholic moral theologian"]}, {"page": "In His Own Write", "response": ["One of the few negative responses to the book came from the Conservative Member of Parliament Charles Curran. On 19 June 1964, during a House of Commons debate on automation, he quoted the poem \"Deaf Ted, Danoota, (and me)\", then spoke derisively about the book, arguing that Lennon's verse was a symptom of a poor education system. He suggested that Lennon was \"in a pathetic state of near-literacy\", adding that \"[h]e seems to have picked up bits of Tennyson, Browning, and Robert Louis Stevenson while listening with one ear to the football results on the wireless.\" The most unfavourable review of the book came from critic Christopher Ricks, who wrote in New Statesman that anyone unaware of the Beatles would be unlikely to draw pleasure from the book., quoted in ."]}, {"page": "Beverley Baxter", "response": ["A first night disaster that became a stock theatrical anecdote played a role in Baxter's losing the job in 1951. In Shulman's account, Gavin Lambert wrote an anonymous \"sardonic knifing of all of Fleet Street's working theatre critics but was particularly derisive about the 'merciless volubility' of Beverley Baxter\", published in an undergraduate magazine Panorama edited by Kenneth Tynan. Shulman showed the article to Charles Curran, the features editor, who passed it to Baxter. "]}, {"page": "United Kingdom general election records", "response": ["* 1970: William Clark, Albert Cooper, Julian Critchley, Charles Curran, Patrick Duffy, Anthony Fell, Edward Gardner, Alan Glyn, Alan Green, Patricia Hornsby-Smith, Geoffrey Howe, James Kilfedder, Martin McLaren, Anthony Meyer, Peter Thomas, Richard Thompson, David Walder, Montague Woodhouse"]}, {"page": "1972 Uxbridge by-election", "response": ["The Uxbridge by-election was held on 7 December 1972 after Conservative Member of Parliament (MP) Charles Curran had died on 16 September of the same year. The seat was retained by the Conservatives by Michael Shersby. Shersby would hold the seat until his sudden death just days after the 1997 general election.Full result "]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Charles Curran"]}, {"page": "Leslie Charles Curran", "response": ["#REDIRECT Charles Curran (politician) "]}]}}