{"wiki_id": "http://www.wikidata.org/entity/Q5079251", "itemLabel": "Charles Hutton Gregory", "itemDescription": "British civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Hutton_Gregory", "wikipedia_page": {"main": "Sir Charles Hutton Gregory  (14 October 1817 – 10 January 1898) was an English civil engineer.  He was president of the Institution of Civil Engineers between December 1867 and December 1869.Charles was the son of Dr Olinthus Gilbert Gregory, a master of mathematics at the Royal Military Academy, Woolwich.  The  chair of mathematics at that time was held by Charles Hutton, who acted as Dr. Gregory's patron.  It was in Hutton's honour that Charles was named.Gregory was consulting engineer of several major railway construction works, including those in Ceylon, Trinidad, Cape Colony, Perak and Selangor.  He was the first to use railway semaphore signalling which he employed first at New Cross on the London and Croydon Railway in 1841, and the South Eastern Railways in 1842-3.  This method later superseded all others and was dominant from 1870.  In 1882 he was a member of the Channel Tunnel Committee and in 1886 was a Royal Commissioner for the Colonial and Indian Exhibition.With these uses in mind, he was interested in the properties of the less usual timbers. In 1886 he, in the company of other leading figures such as Sir Philip Cunliffe-Owen, Sir John Coode and Sir Frederick Bramwell, attended an exhibition at the Chelsea works of A. Ransome and Co, manufacturers of woodworking equipment. There they saw experiments on more than 40 different varieties of colonial timber, including Karri wood and Jarrah from Western Australia, and Padouk from India.Gregory was instrumental in furthering the careers of many fellow engineers, e.g.\nFrederick George Slessor (1831-1905) -- in 1874, appointed to the staff of Cape Government Railways, first as Chief Officer of Surveys and Resident Engineer, and then Chief Resident Engineer of the Eastern system.\nFrank Alexander Brown Geneste (1842-1888) – in 1877, appointed as an Assistant (later District) Engineer on Cape Government Railways, in the construction of the Beaufort West Extension.\nHenry David Alexander Reid (1856-1899) – in 1878, to take charge of the construction of a section of the Kandy and Matalit Railway in Ceylon.\nWilliam Hugh Woodcock (1844-1908) -- In 1892, appointed to report to the Cape Government on the condition of the bridges on the railways throughout the Colony;  the best method complete the Cape Town Harbour Works.Gregory was a Freemason for much of his working life, and was a member of at least six Lodges. On 7 December 1869 he was given Freedom of the City of London by the Worshipful Company of Turners. He was Master Turner of the Company in 1879, when King Leopold II of the Belgians was presented with honorary membership for \"his skill and keenness as an amateur turner\". Gregory was appointed a Companion of the Order of St Michael and St George (CMG) in 1876, and appointed KCMG in May 1884.In 1894, Sir Charles married Fanny Stirling, an actress who died the following year.  Gregory died in London on 10 January 1898, and was buried beside his wife. “The grave is on the west side of the main avenue of Brompton Cemetery, not very far from the Richmond Road entrance”.In his will, Sir Charles bequeathed £1,000 to \"Thomas Olinthus Donaldson, of Lee\". This was the son of Thomas Leverton Donaldson, architect and co-founder of the Royal Institute of British Architects. Thomas Olinthus was presumably a godson of Sir Charles's father, Olinthus Gregory.", "link_mentions": [{"page": "Woolwich", "response": ["* Charles Hutton Gregory (1817–1888), civil engineer, born in Woolwich.", "* Olinthus Gregory (1774–1841), mathematician (and father of Charles Hutton Gregory), lived and died in Woolwich."]}, {"page": "Manchester Piccadilly station", "response": ["Store Street was designed by M&BR's chief engineer, George W. Buck, who designed many of the line's structures including the Stockport Viaduct. Charles Hutton Gregory was the assistant engineer. The station was shared from the beginning with the Sheffield, Ashton-under-Lyne and Manchester Railway (SA&MR) following an agreement made by the promoters in 1837."]}, {"page": "Railway signal", "response": ["Semaphore signals were developed in France at the end of the 18th century, before being later adopted by the railways. The first railway semaphore was erected by Charles Hutton Gregory on the London and Croydon Railway (later the Brighton) at New Cross Gate, southeast London, in 1841.Solomon, p. 19 It was similar in form to the optical telegraphs then being replaced on land by the electric telegraph. Gregory's installation was inspected and approved for the Board of Trade by Major-General Charles Pasley. Pasley had invented a system of optical telegraphy through semaphores in 1822 for the British military, and appears to have suggested to Gregory the application of the semaphore to railway signaling.Calvert, J.B. \"The Origin of the Railway Semaphore.\" Railways: History, Signalling, Engineering. 2007-05-04. The semaphore was afterwards rapidly adopted as a fixed signal nearly universally. Disc signals, such as those made by the Hall Signal Company, were sometimes used,Solomon, p. 37 but semaphores could be read at much longer distances. The invention of the electric light, which could be made brighter than oil lamps and hence visible both by night and day, resulted in the development of position light signals and colour-light signals at the beginning of the 20th century,Solomon, p. 50 which gradually displaced semaphores.Solomon, p. 49 A few remain in modern operations in the United Kingdom."]}, {"page": "Olinthus Gregory", "response": ["Gregory married, first, Rebecca Marshall on 4 March 1798 in Yaxley, with whom he had a son James and a daughter Eliza; Rebecca died in June 1807.  His second marriage was to Anne Beddome on 20 December 1809 at St Mary, Newington, with whom he had two sons and a daughter. Their elder son, Boswell Robert was accidentally drowned in the Thames at Woolwich in the summer of 1834, aged 21. Letitia Elizabeth Landon included a poem commiserating with this event in Fisher's Drawing Room Scrap Book, 1835. Their second son, Charles Hutton Gregory, who later became president of the Institution of Civil Engineers, was named after Charles Hutton, Gregory's patron.New York Times Obituary (11 January 1898)"]}, {"page": "London and Croydon Railway", "response": ["The line into London Bridge became increasingly congested so at Corbetts Lane a white disc was installed, to be operated by the pointsman. If the disc was face on, or a red light at night, the route was set for Croydon; edge on or a white light, the junction was set for Greenwich. It is believed that this was first fixed signal used to control a junction. Greenwich trains ran every 15 minutes, Croydon trains were hourly. The first railway semaphore signal was erected by Charles Hutton Gregory on the railway at New Cross, about 1842.Dendy Marshall (1963) p.50."]}, {"page": "Mary Anne Stirling", "response": ["In later years Mrs Stirling gained a new popularity as the nurse in Irving's presentation (1882) of Romeo and Juliet where she was said to \"steal the show\" from a cast that included Ellen Terry but she returned to the role in 1884 with Mary Anderson; and she was the Martha in Irving's production of Faust (1885). She died on 28 December 1895, having in the previous year married Sir Charles Hutton Gregory (1817–1898)."]}, {"page": "Engineer and Logistic Staff Corps", "response": ["The founding civil engineers comprised George Parker Bidder, John Hawkshaw, John Robinson McClean, John Fowler, Charles Hutton Gregory, Joseph Cubitt, Thomas Elliot Harrison, George Willoughby Hemans, George Robert Stephenson, Charles Blacker Vignoles, William Henry Barlow, Charles Manby and the general managers included James Joseph Allport."]}, {"page": "Bristol and Exeter Railway", "response": ["The B&ER felt alienated from the GWR. Brunel saw that his position as Engineer to both companies was compromised, and resigned from the B&ER at the end of September 1846, being succeeded by Charles Hutton Gregory.", "Charles Hutton Gregory was responsible for the locomotives until May 1850, when James Pearson was appointed as Locomotive Engineer. He designed several classes of tank engines, including his distinctive large 4-2-4T locomotives, the first of which were introduced in 1854."]}, {"page": "Gregory (surname)", "response": ["* Charles Hutton Gregory, British civil engineer"]}, {"page": "Bristol and Exeter Railway locomotives", "response": ["The engineer was Charles Hutton Gregory until May 1850, when James Pearson was appointed as Locomotive Engineer. He designed several classes of tank engines, including large 4-2-4T locomotives."]}, {"page": "Railway semaphore signal", "response": ["The first railway semaphore signal was erected by Charles Hutton Gregory on the London and Croydon Railway (later the London Brighton and South Coast Railway) at New Cross, southeast London, about 1842 on the newly enlarged layout also accommodating the South Eastern Railway.. John Urpeth Rastrick claimed to have suggested  the idea to Hutton Gregory.The National Archives RAIL 386.58."]}, {"page": "Telford Medal", "response": ["| Charles Hutton Gregory |||| 'On Railway Cuttings and Embankments'"]}, {"page": "Charles Gregory", "response": ["* Charles Hutton Gregory (1817–1898), British civil engineer"]}, {"page": "Yeovil–Taunton line", "response": ["At the end of September 1846, Brunel resigned his position as engineer to the B&ER and he was superseded by Charles Hutton Gregory."]}, {"page": "Frederick Slessor", "response": ["In December 1874, following nomination by Sir Charles Hutton Gregory, he was appointed by Cape Government Railways, first as Chief Officer of Surveys and Resident Engineer, and then as Chief Resident Engineer of the Eastern system. After 16 years' service at the Cape he retired on a"]}, {"page": "Charles Hutton (disambiguation)", "response": ["* Charles Hutton Gregory, civil engineer"]}, {"page": "1883 Birthday Honours", "response": ["*Charles Hutton Gregory  Past President of the Institution of Civil Engineers, Consulting Engineer to several Colonial Governments"]}, {"page": "Bricklayers Arms railway station", "response": ["The viaduct at the eastern end of the Bricklayers Arms branch was originally constructed on timber trestles instead of brick arches. The junction between the  branch and the main line was the first in the world to be controlled by a signal box. The signals and points were installed by Charles Hutton Gregory, and were the first to contain some elements of interlocking. A boiler explosion by a SER locomotive on 11 December 1844 caused damage to the timber viaduct and killed the driver and fireman."]}]}}