{"wiki_id": "http://www.wikidata.org/entity/Q5078698", "itemLabel": "Charles Haliday", "itemDescription": "Irish antiquarian and reformer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Haliday", "wikipedia_page": {"main": "Charles Haliday (1789–1866) was an Irish historian and antiquary who made significant contributions to the study of the history of Dublin, being particularly interested in the Scandinavian antiquities of the city. He was born in Carrick-on-Suir in County Tipperary in 1789. In 1812, after spending a short time in London as a clerk in Lubbock's Bank, he settled in Dublin and became a wealthy man trading in bark on Arran Quay — a business his late brother's father-in-law gave up to him. William Haliday his younger brother was a noted Irish language enthusiast.\n\nIn 1832, when cholera first appeared in Dublin, he became a campaigner for improved living conditions among the city's poor, a role he was to play for the remainder of his life. The following year, he was elected a Member of the Ballast Board, a corporation for improving Dublin harbour and superintending the lighthouses on the Irish coast. He also served for many years as consul for Greece, Honorary Secretary of the Chamber of Commerce in Dublin, and a Director of the Bank of Ireland.\nIn 1834 Haliday moved to Monkstown, County Dublin. In 1843 he bought Monkstown Park, previously the residence of Lord Ranelagh, which he demolished and rebuilt. His new house had a large library to house his growing collection of books, pamphlets and tracts on Irish history. It also included a large facade and a tower folly which both are protected structures today. Haliday was an avid collector of antiquities and compiled one of the largest private collections of Irish historical works. At his death his library comprised more than 29,000 pamphlets relating to Ireland, in addition to innumerable books, tracts, ballads, and broadsides.\nIn 1847 he was elected a member of the Royal Irish Academy. In 1850 he began to research the history of the port of Dublin on behalf of the Ballast Board. It was this work which led him to undertake a detailed study of the city's Scandinavian history — a period that had hitherto been almost entirely neglected by scholars.\nCharles Haliday died at Monkstown Park on 14 September 1866; he was buried nearby in Carrickbrennan Churchyard. His work on the early history of Dublin, The Scandinavian Kingdom of Dublin, was published posthumously in 1881. His vast collection of antiquities was inherited by his widow, Mary Hayes, who presented it to the Royal Irish Academy the following year.\nHis estate at Monkstown Park has since been used as an education premises. Corrig School {Monkstown Park School} operated there from the 1880s until the early 1920s. Since 1950 it has operated as the location for CBC Monkstown Park.", "link_mentions": [{"page": "Fingal", "response": ["*The Scandinavian Kingdom of Dublin, by Charles Haliday, edited by John P. Prendergast, published by Alex. Thom & Co., Printers and Publishers, Dublin, 1881."]}, {"page": "Monkstown, County Dublin", "response": ["Christian Brother's College is based on the old estate of Charles Haliday at Monkstown Park. It consists of two schools; an Independent preparatory school with 200 students and a fee paying secondary school with more than 500 students. CBC caters for boys from junior infants through sixth year. The college recently completed a major development which saw existing buildings upgraded and a new extension built."]}, {"page": "Halliday", "response": ["*Charles Haliday (1789–1866), Irish historian and antiquary"]}, {"page": "Privy Council of Ireland", "response": ["Most of the council's records were lost in either a 1711 fire or the 1922 destruction of the Public Record Office of Ireland. Exceptions include the 1556–1571 council book bequeathed by Charles Haliday to the Royal Irish Academy and published in 1897 by the Historical Manuscripts Commission, and a portion of the 1392–3 proceedings owned by the Marquess of Ormond and published in 1877 in the Rolls Series.;  A calendar of the 1581–1586 council book made in the 1860s by John P. Prendergast was published in 1967."]}, {"page": "Turgesius", "response": ["Turgesius (died 845) (also called Turgeis, Tuirgeis, Turges, and Thorgest) was a Viking chief active in Ireland during the 9th-century. Turgesius Island, the principal island on Lough Lene, is named after him. It is not at all clear whether the names in the Irish annals represent the Old Norse Thurgestr or Thorgísl.The Vikings In Scotland And Ireland In The Ninth Century (Donnchadh Ó Corráin. 1998)W.E.D. Allen, The Poet and the Spae-Wife: An Attempt to Reconstruct Al-Ghazal's Embassy to the Vikings Dublin: Figgis, Viking Society for Northern Research, 1960, OCLC 557547145, p. 46. John O'Donovan and Charles Haliday independently identified him with Ragnar Loðbrók, but the identification is not generally accepted.Charles Haliday, ed. John Patrick Prendergast, The Scandinavian Kingdom of Dublin, Dublin: Thom, 1882, repr. Shannon, Irish University Press, 1969, ; see Allen, pp. 58-60 and notes 203, 204, p. 93 (calling him Halliday). The theory was first published by John O'Donovan in 1860, prior to the posthumous publication of Haliday's papers."]}, {"page": "Early Scandinavian Dublin", "response": ["For more than a dozen years in the middle of the 9th century, most of the Viking raids in Ireland appear to have been part of a co-ordinated effort to conquer the country on behalf of the King of Laithlind. If later accounts are to be believed, this campaign was initially masterminded by a warlord referred to in Irish annals as Turgesius, Turgéis or Turges.The Old Norse form was Þurgestr. Variant forms that are sometimes found include Þorgest (Thorgest), Þorgils, Þorgisl and Þorgerr. The Old Norse forms of personal names, attested in the 12th or 13th century, are often quite different from the original Proto-Norse forms; the names recorded in contemporary British and Irish sources have the virtue of being contemporaneous with the original Scandinavian forms. According to the medieval Icelandic historian Snorri Sturluson, Thorgils was a son of the first King of Norway Haraldr hárfagri (Harald Fairhair). However, that this son of Harald should be Turgesius is chronologically impossible, as Harald was born around 851. Turgesius’s identity remains uncertain to this day. Some commentators have identified him with the semi-legendary Danish warlord Ragnar Lodbrok.John O'Donovan (1860), pp. liii ff. and p. 124; Charles Haliday (1884), pp. 30 ff; Todd (1867), p. liii; . According to Saxo Grammaticus,Saxo Grammaticus, Gesta Danorum Book 9 Ragnar raided Ireland, killing a king called Melbricus. This has been identified with a raid on Conaille Muirthemne in 831 in which the king Máel Brigte was abducted by Vikings.AU 831.6. Conaille Muirthemne was a dynastic sept that ruled a minor kingdom in County Louth in the overkingdom of Ulaid or Ulster. Turgesius has also been identified with a son of GuÞfriÞ or Gudfred, the Danish king who fought against Charlemagne between 804 and 810.Montgomery (2006). It is thought unlikely, however, that he or any other Viking rulers in Ireland can be linked to native Norwegian dynasties.Ó Corráin (1998): \"The kings and sons of kings mentioned in the Irish annals cannot, therefore, be linked to any Norwegian dynasty.\"", "In late 869 the Great Heathen Army wintered in Thetford, East Anglia. In November they defeated Edmund the King of East Anglia and seized his kingdom.ASC(A) 870 [=late 869]. At this time the army was led by Ingware and Ubba, but the following year the army's two heathen kings are called Bachsecg and Halfdene (Halfdan Ragnarsson).ASC(A) 871, 872. In 870 Ímar was campaigning with his brother Amlaíb in Scotland,AU 870.6. so it appears that his kinsman Hálfdan took his place as one of the leaders of the Great Heathen Army in England. According to Aethelweard's Chronicon Igwares (Ingware) died in 870 – a detail which must be accounted for by those historians who believe that Ímar and Iguuar were one and the same individual.Æthelweard, p. 26. Charles Haliday (1884), p. 40, believed that the discrepancy of three years between the death of Igwares and Ímar (AU 873.3) was insignificant, and he actually cited the early deaths of the two men as \"strong evidence\" that they were one and the same individual. Curiously, however, Haliday did not identify Æthelweard's Igwares with the Anglo-Saxon Chronicle's Ingware, whom he believed was an illegitimate brother of Igwares. Halfdene continued the conquest of northern England with the assistance of the Great Summer Army, which arrived in 871. Repton was taken in 873, which led to the fall of eastern Mercia. In the winter of 874 he settled on the Tyne in Northumbria, from which numerous attacks on the Picts and Strathclyde were launched.ASC(A) 875. In 875 or 876 Halfdene divided Northumbria in two: the northern kingdom of Bernicia remained a puppet state ruled by Angles, while the southern kingdom of Deira or Jórvík was ruled directly by the Danes. Halfdene then disappears from the Chronicle. In 875 Albdann (Hálfdan) is reported to have \"deceitfully killed\" Amlaíb's son Oistín (Eysteinn) and taken Dublin.AU 875.4; CGG 25.", "This period of Dublin's history is still very obscure. Despite the existence of a wealth of documentary evidence for Viking activity in the Dublin region throughout the 9th century, relatively little archaeological evidence has been unearthed to corroborate the testimony of contemporary annalists. The pioneering 19th-century historian Charles Haliday bewailed the silence of contemporary Irish sources \"respecting the social position, religion, laws, and monuments of those who occupied Dublin for more than three hundred years on all facts ... excepting such as relate to their inroads and devastations\".Haliday (1884), p. 4. Most of our knowledge concerning the day-to-day lives of the Norse settlers in Dublin has been learned from extensive excavations at Wood Quay and in the neighbourhoods of Winetavern Street and Fishamble Street. The Norse built their houses almost exclusively out of perishable materials such as wood and straw, but many early buildings have been preserved in this area in a two-metre-thick waterlogged layer of estuarine mud, making Dublin one of the most important Norse sites in Europe. To date, more than two hundred houses have been excavated."]}, {"page": "Carrickbrennan Churchyard", "response": ["Carrickbrennan Churchyard () located on Carrickbrennan Road, Monkstown, County Dublin, Ireland is a graveyard that can still be seen today, but is no longer in use. It is notable as the burial place of many people who perished in local maritime disasters. The graveyard stands beside the grounds of Monkstown Park, former estate of Lord Ranelagh and latterly the historian Charles Haliday, now used as rugby pitches by CBC Monkstown Park.", "Charles Haliday (1789–1866) was an Irish historian and antiquary who made significant contributions to the study of the history of Dublin, being particularly interested in the Scandinavian antiquities of the city. He died on 14 September 1866 and is buried here."]}, {"page": "John Patrick Prendergast", "response": ["Prendergast issued for private circulation The Tory War in Ulster (1868, Dublin, 2 pts.). In 1881 he prefixed a notice of the life of Charles Haliday to the latter's Scandinavian Kingdom of Dublin, and in 1887 he published Ireland from the Restoration to the Revolution."]}, {"page": "Haliday, Charles", "response": ["#redirectCharles Haliday"]}, {"page": "William Haliday", "response": ["He died aged 24, on 26 October 1812 and is buried in Taney Parish, graveyard, Dundrum, with an inscription on his tomb by Dr. Lanigan. His younger brother was the historian Charles Haliday."]}]}}