{"wiki_id": "http://www.wikidata.org/entity/Q5076526", "itemLabel": "Charles Craig", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Craig_(tenor)", "wikipedia_page": {"main": "Charles James Craig (3 December 1919 – 23 January 1997) was an English operatic tenor. In the army during World War II, he joined the Entertainments Unit in India and performed operatic arias. He was encouraged by Thomas Beecham, and was included on his 1952 recording of A Mass of Life", "link_mentions": [{"page": "English National Opera", "response": ["Recordings of individual scenes and numbers were made by Sadler's Wells singers from the company's earliest days. In 1972 an LP set was issued bringing together many of these recordings, prefaced with a tribute to Lilian Baylis recorded in 1936. Among the singers in the set are Joan Cross, Heddle Nash, Edith Coates, Joan Hammond, Owen Brannigan, Peter Pears, Peter Glossop and Charles Craig. The conductors include Lawrance Collingwood,  Reginald Goodall and Michael Mudie.Blyth, Alan. \"Historical Stars of The Old Vic and Sadler's Wells\", The Gramophone, November 1972, p. 126"]}, {"page": "Benvenuto Cellini (opera)", "response": ["The Carl Rosa Opera Company, a British touring company, brought it into its repertoire in 1956, giving two performances to packed houses at London's Sadler's Wells Theatre in 1957. The title role was sung by tenor Charles Craig, then at the start of a notable international career.The Musical Times, June 1957 The Royal Opera House in London staged the work on December 15, 1966, followed by its Italian premiere in Naples in 1967."]}, {"page": "The Land of Smiles", "response": ["Sadler's Wells Opera produced it in London in the late 1950s, after the success of Lehár's The Merry Widow starring June Bronhill had rescued the company from bankruptcy. Starring Charles Craig, Elizabeth Fretwell and Bronhill, the show did not attract the same audiences as The Merry Widow."]}, {"page": "Carl Rosa Opera Company", "response": ["Phillips died in 1950.The Times, obituary, 20 March 1950, p. 7 In 1953 the Carl Rosa Trust was formed in association with the Arts Council, who agreed to subsidise the company, now directed by Phillips's widow, Annette. The company gave seasons at Sadler's Wells in 1955 and 1956.  In the 1950s, the musical director was Arthur Hammond.  Singers during this period included the dramatic soprano Ruth Packer, the tenor Charles Craig and the baritone Joseph Ward.\"The Carl Rosa Opera\", BBC, accessed 16 December 2016 The productions were traditional, but the repertory included some operatic rarities such as Puccini's Manon Lescaut and Berlioz's Benvenuto Cellini.Hope-Wallace, Philip. \"Manon Lescaut\", The Manchester Guardian, 23 April 1958, p. 5; and  \"A Neglected Masterpiece,\" The Manchester Guardian, 10 April 1957, p. 7"]}, {"page": "The Record of Singing", "response": ["*Jussi Björling, Henri Legay, Léopold Simoneau, Albert Lance, Eugenio Fernandi, João Gibin, Richard Lewis, Charles Craig, Giuseppe Campora, Fritz Wunderlich, Ronald Dowd, Alfredo Kraus, Luigi Alva, Wilfred Brown, Jess Thomas, Franco Corelli, Peter Schreier, Nicolai Gedda, James King, Luciano Pavarotti"]}, {"page": "Charles Craig", "response": ["*Charles Craig (tenor) (1919–1997), English opera singer", "*Charles Craig (actor) (fl. 1900s–1930s), American actor", "*Charles Craig (British politician) (1869–1960), Northern Irish politician, Member of Parliament for South Antrim 1903–1922 and Antrim 1922–1929", "*Charles Craig (athlete) (born 1942), American triple jumper", "*Charles Craig Cannon (1914–1992), US Army officer"]}, {"page": "Neil Howlett", "response": ["*Verdi: Otello – Charles Craig (Otello), Rosalind Plowright (Desdemona), Neil Howlett (Iago), Shelagh Squires (Emilia), Bonaventura Bottone (Cassio); English National Opera Orchestra and Chorus; Mark Elder (conductor). Live recording, London 1983; remastered release 2001. Label: Chandos Records CDChandos Records (2001)"]}, {"page": "Monica Sinclair", "response": ["* Delius: A Mass of Life (with Rosina Raisbeck, Charles Craig and Bruce Boyce, under Sir Thomas Beecham)"]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Charles Craig||Who's Who||Bed||more"]}, {"page": "Ava June", "response": ["In 1953, when she adopted the stage name Ava June, she joined the Sadler's Wells Opera chorus at the age of 19. June was initially a mezzo but was later persuaded by her teacher Clive Carey to switch to soprano roles. She won the Queen's Prize at the Royal College of Music in 1955. June's performances in the chorus led to her appointment as a principal soloist for the 1957–58 season. Her solo career began with “a promising Musetta” in La bohème and followed this by playing The Foreign Women in The Consul by Gian Carlo Menotti. June's 1958 Covent Garden debut saw her perform as the Heavenly Voice in Luchino Visconti's production of Don Carlos by Giuseppe Verdi and was conducted by Carlo Maria Giulini. When Fidelio returned the next year under Rudolf Schwarz, June sang Marcellina and repeated this performance in 1960 but with Colin Davis as the conductor. That same year, she made her first (and only) appearance with the Royal Scottish National Orchestra under Alexander Gibson as Abigaille in Verdi's Nabucco with concert performances in Edinburgh and Glasgow. Also in 1960, June participated in a production of Georges Bizet's Les pêcheurs de perles with the tenor Charles Craig."]}, {"page": "1919 in British music", "response": ["*3 December – Charles Craig, operatic tenor (died 1997)Forbes, Elizabeth, Obituary: Charles Craig, The Independent, 25 January 1997"]}]}}