{"wiki_id": "http://www.wikidata.org/entity/Q5079256", "itemLabel": "Charles Hyde Villiers", "itemDescription": "British businessman, 1912-1992", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Hyde_Villiers", "wikipedia_page": {"main": "Sir Charles English Hyde Villiers, MC (14 August 1912 – 22 January 1992) was a British businessman and chairman of British Steel Corporation from 1976 till 1980.\nVilliers was the grandson of Francis Hyde Villiers and the great-grandson of George Villiers, 4th Earl of Clarendon.  His father, Algernon Hyde Villiers, was killed in action in 1917 during World War I.  His mother, Beatrix Eleanor Paul, was the daughter of Liberal M.P. Herbert Paul, and she later married Walter Durant Gibbs, who later became 4th Baron Aldenham.  Villiers was educated at St Cyprian's School, Eton and New College, Oxford, before joining the Grenadier Guards in 1936.  He became Lieutenant-Colonel during World War II, served with the Special Operations Executive from 1943 to 1945 and was awarded the MC.\nVilliers was a managing director of Helbert Wagg from 1948, and of J. Henry Schroder Wagg from 1968 to 1971. He was also a director of Courtaulds, Sun Life Assurance and Bass Charrington. He was Chairman of Guinness Mahon from 1971 to 1976, and Chairman of British Steel from 1976 to 1980.  In 1985 he launched the British-American Project, which promotes Anglo-American ties.\nHe married firstly Pamela Constance Flower and had two sons, and secondly Countess Marie-José de la Barre d’Erquelinnes and had two daughters. He was an Officer, Most Venerable Order of the Hospital of St. John of Jerusalem (O.St.J.), and was decorated with the Order of the People of Yugoslavia in 1970 and Grand Officer, Order of Leopold of Belgium in 1974.\nHis daughter Diana Villiers Negroponte is adjunct professor of law at Fordham University.  She is married to former Deputy U.S. Secretary of State John Negroponte.", "link_mentions": [{"page": "St Cyprian's School", "response": ["*Sir Charles Hyde Villiers (1912–1992) – Businessman; one-time Chairman of British Steel"]}, {"page": "Charles Villiers", "response": ["* Charles Hyde Villiers (1912–1992), British businessman and chairman of British Steel"]}, {"page": "1975 Birthday Honours", "response": ["*Charles Hyde Villiers, M.C., Chairman, Guinness Mahon and Company Ltd. For services to Industry."]}]}}