{"wiki_id": "http://www.wikidata.org/entity/Q5078774", "itemLabel": "Charles Harford Lloyd", "itemDescription": "English composer and organist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Harford_Lloyd", "wikipedia_page": {"main": "Charles Harford Lloyd (Thornbury, 16 October 1849 – Eton, 16 October 1919) was an English composer who became a well-known organist in his time.\nHis most successful area was organ and choral works but he wrote three clarinet pieces for his friend Randle Fynes Holme (1864–1957), (a talented amateur musician), a number of chamber works, a Festival Overture for orchestra, an organ concerto with orchestra and a number of songs for voice and piano.\nHe served as organist and choir-master at Gloucester Cathedral, Christ Church Cathedral in Oxford, Eton College Chapel and organist at the Chapel Royal. His most frequently performed works today are his settings of the Anglican Church liturgy.\nHe had a lifelong friendship with Hubert Parry.", "link_mentions": [{"page": "Falfield", "response": ["A Saxon charter signifies that village was originally an ancient settlement. In 1608 a document \"Men & Armour\",John Smyth (1908) [1608] Men & Armour for Gloucestershire in 1608, A. Sutton, Gloucester   compiled by John Smyth (1567–1641), the Steward of the Gloucestershire lands of Lord Berkeley, recorded that the majority of the men in the village were weavers and others being husbandmen (farmers) or tailors. Ecclesiastically the village was part of the Thornbury Parish and was served by a Chapel of Ease, which was recorded as being dilapidated during the 18th century. In 1860 the present St George's Church was built a short distance from where the Chapel of Ease stood. The organist Charles Harford Lloyd served in the village in his youth. Registers containing marriages, baptisms and burials at Falfield Parish Church are in existence from 1860. Prior to this date they are included under Thornbury Parish records."]}, {"page": "Frederick Septimus Kelly", "response": ["Kelly studied music at Eton under Charles Harford Lloyd, and was awarded a Lewis Nettleship musical scholarship at Oxford in 1899. At Balliol College, Oxford (BA, 1903; MA, 1912) he was mentored by Donald Tovey and became president of the university musical club and a leading spirit at the Sunday evening concerts at Balliol.Latham, Christopher. 'F.S. Kelly, Genius Interrupted', notes to Toccata CD 0524 (2020)  He was a protégé of Ernest Walker."]}, {"page": "Andromeda", "response": ["* Andromeda, 1886 cantata for the Three Choirs Festival by English composer Charles Harford Lloyd"]}, {"page": "Rangeworthy", "response": ["Rangeworthy was historically a chapelry in the ancient parish of Thornbury, a detached part of that parish.  It became a separate civil parish in 1866. The organist Charles Harford Lloyd served there in his youth."]}, {"page": "Bon Voyage", "response": ["*Bon Voyage!, composition by Charles Harford Lloyd (1849–1919)"]}, {"page": "Walter Galpin Alcock", "response": ["Between 1917 and 1924, Alcock, with Charles Harford Lloyd, juggled the post of Director of the Madrigal Society, to assist the ageing Sir Frederick Bridge, who had been appointed to the role in 1888."]}, {"page": "Clarinet-cello-piano trio", "response": ["*Charles Harford Lloyd (1849–1919)"]}, {"page": "Charles Lloyd", "response": ["* Charles Harford Lloyd (1849–1919), English composer and organist"]}, {"page": "List of compositions for viola: L to N", "response": ["* Charles Harford Lloyd (1849–1919)"]}, {"page": "George Robertson Sinclair", "response": ["1879 Sinclair became assistant organist to Charles Harford Lloyd at Gloucester Cathedral and parish organist of St Mary-de-Crypt, Gloucester. It had been expected that he would become an Anglican priest, but when he was seventeen his father died, and Sinclair was obliged to earn an income at once. In 1880, Edward White Benson, first Bishop of Truro, asked Ouseley for advice on a suitable organist for the new Truro Cathedral. Ouseley recommended Sinclair, who was appointed, aged 17. He designed a high-specification four-manual organ built by Father Willis, and assembled and trained a choir."]}, {"page": "Toccata Classics", "response": ["*  Charles Harford Lloyd"]}, {"page": "Choral Songs in honour of Her Majesty Queen Victoria", "response": ["| Charles Harford Lloyd"]}, {"page": "October 1919", "response": ["* Died: Charles Harford Lloyd, English composer, known for his chamber and organ compositions for Anglican church music (b. 1849)"]}, {"page": "List of musicians at English cathedrals", "response": ["* 1876 Charles Harford Lloyd", "* 1882 Charles Harford Lloyd"]}, {"page": "List of music students by teacher: K to M", "response": ["===Charles Harford Lloyd==="]}, {"page": "St John the Baptist Church, Windsor", "response": ["The replacement of the Gray and Davison organ was a three-manual Hunter organ which was half-funded by Andrew Carnegie. The organ was opened by Charles Harford Lloyd, Precentor of Eton College, on Easter Day 1906. The specification has been superseded by subsequent renovations: by Hunter from 1921 to 1926, by Rushworth and Dreaper in 1936, and by Bishop & Son in 2009. A full restoration is proposed, and the fundraising target was reached in 2020."]}]}}