{"wiki_id": "http://www.wikidata.org/entity/Q5079284", "itemLabel": "Charles Inglis", "itemDescription": "Royal Navy officer during the French Revolutionary and Napoleonic Wars (died 1833)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Inglis_(Royal_Navy_officer,_died_1833)", "wikipedia_page": {"main": "Charles Inglis (died 27 February 1833) was an officer of the Royal Navy who saw service during the French Revolutionary and Napoleonic Wars, rising to the rank of post-captain.\nInglis was born into a naval family, the son of an officer who would die a rear-admiral, and followed his father into the navy. He rose through the ranks, and was a lieutenant aboard a frigate by 1798, when his ship fought an action against a French frigate, and succeeded in capturing it. Inglis had to take over command during the battle when his captain was injured, and was subsequently highly praised for his efforts. He then went to the Mediterranean, serving on a frigate forming part of Rear-Admiral Horatio Nelson's squadron. He again acquitted himself well in battle, when his ship attacked a much larger French warship, delaying her enough for more British ships to arrive on the scene and force her surrender. Nelson himself congratulated Inglis for his part.\nPromoted to commander, and then captain, Inglis commanded several small cruisers, before becoming flag captain to Rear-Admiral George Martin. It was the start of an enduring relationship, with Martin retaining Inglis to be his flag captain on all his flagships. He served in several further engagements with the French fleets in the Mediterranean during the war, and also off the coast of Portugal during Martin's time in command there. He returned to Martin's side as late as 1824, when Martin became Commander-in-Chief at Portsmouth, flying his flag aboard HMS Victory, and with Inglis once more his flag captain. Stepping down on the expiration of Martin's post in 1827, Inglis died several years later, in 1833.", "link_mentions": [{"page": "Inglis (surname)", "response": ["*Charles Inglis (c. 1731–1791), Royal Navy officer", "*Charles Inglis, Royal Navy officer", "*Charles Inglis (1734–1816), the first Church of England bishop of the Diocese of Nova Scotia", "*Charles Inglis (1875–1952), British civil engineer and academic", "*James Charles Inglis (1851–1911), British civil engineer"]}, {"page": "Charles Inglis (d. 1833)", "response": ["#REDIRECT Charles Inglis (Royal Navy officer, died 1833)"]}, {"page": "Charles Inglis (Royal Navy captain)", "response": ["#REDIRECT Charles Inglis (Royal Navy officer, died 1833)"]}, {"page": "Battle of Maguelone", "response": ["| align= left | Rear-Admiral George MartinCaptain Charles Inglis"]}]}}