{"wiki_id": "http://www.wikidata.org/entity/Q507900", "itemLabel": "Trevor Griffiths", "itemDescription": "British playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Griffiths", "wikipedia_page": {"main": "Trevor Griffiths (born 4 April 1935, Ancoats, Manchester) is an English dramatist.", "link_mentions": [{"page": "Thomas Paine", "response": ["* In 2005, Trevor Griffiths published These are the Times: A Life of Thomas Paine, originally written as a screenplay for Richard Attenborough Productions. Although the film was not made, the play was broadcast as a two-part drama on BBC Radio 4 in 2008, with a repeat in 2012. In 2009, Griffiths adapted the screenplay for a production entitled A New World at Shakespeare's Globe theatre on London's South Bank. "]}, {"page": "Laurence Olivier", "response": ["After this Olivier played three more stage roles: James Tyrone in Eugene O'Neill's Long Day's Journey into Night (1971–72), Antonio in Eduardo de Filippo's Saturday, Sunday, Monday and John Tagg in Trevor Griffiths's The Party (both 1973–74). Among the roles he hoped to play, but could not because of ill-health, was Nathan Detroit in the musical Guys and Dolls. In 1972 he took leave of absence from the National to star opposite Michael Caine in Joseph L. Mankiewicz's film of Anthony Shaffer's Sleuth, which The Illustrated London News considered to be \"Olivier at his twinkling, eye-rolling best\"; both he and Caine were nominated for the Academy Award for Best Actor, losing to Marlon Brando in The Godfather."]}, {"page": "Reds (film)", "response": ["Beatty was awarded the Academy Award for Best Director and the film was nominated for Best Picture, but lost to Chariots of Fire. Beatty, Keaton, Nicholson, and Stapleton were nominated for Best Actor, Best Actress, Best Supporting Actor and Best Supporting Actress, respectively. Stapleton was the only one of the four to win. Beatty became the third person to be nominated for Academy Awards in the categories Best Actor, Director, and, with co-writer Trevor Griffiths, Original Screenplay—losing again to Chariots of Fire—for a film nominated for Best Picture.", "Beatty came across the story of John Reed in the mid-1960s and executive producer and film editor Dede Allen remembers Beatty's mentioning making a film about Reed's life as early as 1966. Originally titled Comrades, the first script was written by Beatty in 1969, but the process stalled. In 1973, Beatty was offered the role of Reed in Sergei Bondarchuk's Soviet film production Red Bells, but declined and was further driven to make his own biopic about Reed to compete with the Soviet version. In 1976, Beatty found a suitable collaborator in Trevor Griffiths who began work but was delayed when his wife died in a plane crash. The preliminary draft of the script was finished in 1978. Beatty still had problems with it and he and Griffiths spent four and a half months fixing it. Beatty also collaborated with his friends Robert Towne, Peter Feibleman and Elaine May to continue polishing the script after shooting had begun.", "| Warren Beatty and Trevor Griffiths", "| Warren Beatty and Trevor Griffiths", "| Warren Beatty and Trevor Griffiths", "| Warren Beatty and Trevor Griffiths", "| Warren Beatty and Trevor Griffiths"]}, {"page": "Antonio Gramsci", "response": ["* Occupations – Gramsci is a central character in Trevor Griffiths's 1970 play Occupations about workers taking over car factories in Turin in 1920."]}, {"page": "Warren Beatty", "response": ["|Best Original Screenplay shared with Trevor Griffiths|| "]}, {"page": "Mike Nichols", "response": ["Nichols returned to the stage with two moderately successful productions in 1976; David Rabe's Streamers opened in April and ran for 478 performances. Trevor Griffiths's Comedians ran for 145 performances. In 1976 Nichols also worked as Executive Producer to create the television drama Family for ABC. The series ran until 1980."]}, {"page": "Jonathan Pryce", "response": ["Despite finding RADA \"strait-laced\" and being told by his tutor that he could never aspire to do more than playing villains on Z-Cars,(10 July 2001). \"Life with lots of Doolittles\". The Daily Telegraph. Retrieved 15 June 2008. Pryce joined the Everyman Theatre in Liverpool upon graduation and eventually became its artistic director. He performed with the Royal Shakespeare Company and the Nottingham Playhouse.(6 March 2007).  \"Jonathan Pryce is Sherlock Holmes\". BBC.co.uk. Retrieved 28 October 2007.\"Jonathan Pryce Mini Biography\". Ön Sayfa. Retrieved 28 October 2007. To gain his Equity card, he made his first screen appearance in a minor role in \"Fire & Brimstone\", a 1972 episode of the science fiction drama series Doomwatch. He then starred in two television films directed by Stephen Frears: Daft as a Brush and Playthings. After leaving Everyman, Pryce joined Sir Richard Eyre at the Nottingham Playhouse and starred in Trevor Griffiths' play Comedians, in a role specially written for him. The production moved to the Old Vic Theatre in London. Price reprised the role on Broadway in 1976, this time directed by Mike Nichols, and for which Price won the 1977 Tony Award for Best Featured Actor in a Play. It was around this time that he appeared in his first film role, playing the character Joseph Manasse in the drama Voyage of the Damned, starring Faye Dunaway. He did not, however, abandon the stage, appearing from 1978 to 1979 in the Royal Shakespeare Company's productions of The Taming of the Shrew as Petruchio, and Antony and Cleopatra as Octavius Caesar.The RSC Shakespeare – Plot summaries, The Taming of the Shrew . Retrieved 18 June 2008.The RSC Shakespeare – Plot summaries, Antony and Cleopatra . Retrieved 18 June 2008."]}, {"page": "Mark Thomas", "response": ["After graduating, Thomas subsequently embarked on his comedy career, initially supporting himself through working on building sites with his father. Thomas' early exposure to comedy was through watching and listening to Dave Allen, Steptoe and Son, The Goon Show and Tony Hancock; his biggest influence was hearing a recording of Alexei Sayle: \"It was like someone had kicked the door in – just listening to that tape and thinking that someone could do this stuff\". He also cited the playwright Trevor Griffiths as an early influence, describing him as \"an absolute genius\". He went on to write material for Dave Allen."]}, {"page": "Stephen Rea", "response": ["| Trevor Griffiths"]}, {"page": "1981 in film", "response": ["| Reds || Paramount Pictures / Barclays Mercantile / Industrial Finance / JRS Productions || Warren Beatty (director/screenplay); Trevor Griffiths (screenplay); Warren Beatty, Diane Keaton, Edward Herrmann, Jerzy Kosinski, Jack Nicholson, Gene Hackman, Paul Sorvino, Maureen Stapleton, Nicolas Coster, William Daniels, M. Emmet Walsh, Ian Wolfe, Bessie Love, Max Wright, George Plimpton, Kathryn Grody, Dolph Sweet, Dave King, Roger Sloman, Jan Triska, Harry Ditson, Leigh Curran, Nancy Duiguid, Stuart Richman, Oleg Kerensky, John J. Hooker || Epic, Historical, Drama || Live action"]}, {"page": "1975 in literature", "response": ["*Trevor Griffiths – Comedians"]}, {"page": "1970 in literature", "response": ["*Trevor Griffiths – Occupations"]}, {"page": "University of East Anglia", "response": ["In 2010 the Thomas Paine Study Centre was opened by playwright Trevor Griffiths. Named after the local luminary and visionary thinker, the building became home to the Norwich Business School. In 2012 the university won its second Queen's Anniversary Prize for its distinguished creative writing programme, having won one previously for its School of International Development. The award helped bolster the region's reputation as a literary hub, and helped Norwich to achieve its status as England's first UNESCO City of Literature in 2012."]}, {"page": "Gary Oldman", "response": ["Saved proved to be a major breakthrough for Oldman. Max Stafford-Clark, artistic director of the Royal Court Theatre, had seen Oldman's performance and cast him as Scopey, the lead role of Bond's The Pope's Wedding, in 1984. For his acclaimed performance, he won two of British theatre's top honours: the Time Out Fringe Award for Best Newcomer, and the Drama Theatre Award for Best Actor—the latter of which was shared with future film co-star Anthony Hopkins for his performance in Pravda. Oldman's turn in The Pope's Wedding led to a run of work with the Royal Court, and from 1984 to 1986 he appeared in Rat in the Skull (Ron Hutchinson), The Desert Air (Nicholas Wright), Cain and Abel, The Danton Affair (Pam Gems), Women Beware Women (Thomas Middleton), Real Dreams (Trevor Griffiths) and all three of Bond's The War Plays: Red Black and Ignorant, The Tin Can People and Great Peace. Oldman was a member of the Royal Shakespeare Company from 1985 to 1986."]}, {"page": "James Fox", "response": ["After an absence from acting of several years, in 1981 Fox appeared on TV in the Play for Today \"Country\" by Trevor Griffiths, a comedy drama set against the 1945 UK parliamentary elections. On film he starred in Stephen Poliakoff's Runners (1983), A Passage to India (1984), and Comrades (1986). He played Anthony Blunt in the  BBC play by Alan Bennett, A Question of Attribution (1992). He also portrayed the character of Lord Holmes in Patriot Games (1992), as well as Colonel Ferguson in Farewell to the King and the Nazi-sympathising aristocrat Lord Darlington in The Remains of the Day (1993)."]}, {"page": "List of British playwrights since 1950", "response": ["*Trevor Griffiths"]}, {"page": "List of British playwrights", "response": ["*Trevor Griffiths"]}, {"page": "Writers Guild of America Awards", "response": ["* 1982: Reds – Warren Beatty and Trevor Griffiths"]}]}}