{"wiki_id": "http://www.wikidata.org/entity/Q5076944", "itemLabel": "Charles Douglas-Home, 13th Earl of Home", "itemDescription": "Scottish noble (1873-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Douglas-Home,_13th_Earl_of_Home", "wikipedia_page": {"main": "Charles Cospatrick Archibald Douglas-Home, 13th Earl of Home,  (29 December 1873 – 11 July 1951), styled Lord Dunglass between 1881 and 1918, was a British peer and banker. He served as Lord Lieutenant of Berwickshire from 1930 to 1951. He was the father of British prime minister, Sir Alec Douglas-Home.", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": ["*****Lady Lilian Lambton (1881–1966), married Charles Douglas-Home, 13th Earl of Home (1873–1951), Lord Lieutenant of Berwickshire (1930–1951)"]}, {"page": "List of Knights and Ladies of the Thistle", "response": ["|Charles Douglas-Home, 13th Earl of Home||75px||1873–1951||1930|| "]}, {"page": "Frederick Lambton, 4th Earl of Durham", "response": ["*Lady Lilian Lambton (8 December 1881 – 26 September 1966), married Charles Douglas-Home, 13th Earl of Home and had issue."]}, {"page": "Rachel Douglas-Home, 27th Baroness Dacre", "response": ["She married on 26 July 1951 The Hon William Douglas-Home, third son of Charles Douglas-Home, 13th Earl of Home, and a younger brother of the 14th Earl of Home, better known as Sir Alec Douglas-Home, former Prime Minister of the United Kingdom. Lady Dacre and her husband lived in Hampshire, had four children:"]}, {"page": "Charles Cospatrick Archibald Douglas-Home, 13th Earl of Home", "response": ["#REDIRECT Charles Douglas-Home, 13th Earl of Home"]}, {"page": "William Douglas Home", "response": ["Douglas-Home (he later dropped the hyphen from his surname) was the third son of Charles Douglas-Home, 13th Earl of Home, and Lady Lilian Lambton, daughter of the 4th Earl of Durham. His eldest brother was Sir Alec Douglas-Home, Prime Minister from 1963 to 1964."]}, {"page": "Douglas, South Lanarkshire", "response": ["The only remains of the castle are those of a 17th-century corner tower, still known as \"Castle Dangerous\", after the Walter Scott novel which took Douglas Castle as its inspiration. In the 1930s Charles Douglas-Home, 13th Earl of Home allowed the mining of coal in the park near to the castle, in a philanthropic effort to alleviate local unemployment. The Lanarkshire coal industry, once the mainstay of Scotland's production, had seen its output almost halved by 1937, with catastrophic consequences for local communities.  As a consequence of the mining works the castle was considered to be at risk of subsidence and had to be demolished in 1938."]}, {"page": "Douglas Castle", "response": ["From 1757, the Duke began construction of an enormous castellated mansion at Douglas. The architects of this, the final Douglas Castle, were the Adam Brothers (James Adam, John Adam, and Robert Adam). Had it been completed the castle would have been the largest in Scotland.  As it was the Duke of Douglas died in 1761, and only around half of the original design was ever completed.  The five storey building had round towers to the front and square towers to the rear facade, and stood in a very extensive park spanning the valley of the Douglas Water.  The Duke's estate became the subject of a famous and bitter legal dispute, known as the \"Douglas Cause\", between his nephew Archibald James Edward Douglas and the Duke of Hamilton. Douglas was eventually victorious and ennobled as Baron Douglas in 1790, and the castle descended through his daughter, and granddaughter, to the Earls of Home. In the 1930s Charles Douglas-Home, 13th Earl of Home allowed the mining of coal in the park adjacent to the castle, in an attempt to relieve desperate levels of local unemployment. Sadly, the mining caused dangerous subsidence to the castle and it had to be demolished in 1938."]}, {"page": "Charles Douglas-Home", "response": ["*Charles Douglas-Home, 13th Earl of Home (1873–1951)"]}, {"page": "Lord William Montagu-Douglas-Scott", "response": ["In 1937 he married Lady Rachel Douglas Home (10 April 1910 – 4 Apr 1996), younger daughter of Charles Douglas-Home, 13th Earl of Home. The couple had one son and four daughters, and lived at Eildon Hall, St Boswells, Roxburghshire."]}, {"page": "John Montagu Douglas Scott, 7th Duke of Buccleuch", "response": ["* Lord William Walter Montagu Douglas Scott (17 January 1896 – 30 January 1958); he married Lady Rachel Douglas-Home (daughter of Charles Douglas-Home, 13th Earl of Home and sister of future Prime Minister Sir Alec Douglas-Home) on 27 April 1937, had five children. "]}, {"page": "Lady Margaret Douglas-Home", "response": ["In 1931, Lady Margaret married Hon. Henry Montagu Douglas-Home (1907–1980), second son of the Charles Douglas-Home, 13th Earl of Home and a brother of Alec Douglas-Home, who served as Prime Minister of the United Kingdom in 1963–1964. The marriage was dissolved in 1947. They had two sons, Robin (died 1968) and Charles (died 1985). Their daughter Fiona married first Gregory Martin and secondly the merchant banker Sir Ian James Fraser (1923–2003), former chairman of Lazard. Lady Margaret was a great-aunt of Diana, Princess of Wales, and a close friend of Queen Elizabeth The Queen Mother. She died at Wells-next-the-Sea, Norfolk, in 1996."]}, {"page": "13th Earl of Home", "response": ["#redirect Charles Douglas-Home, 13th Earl of Home"]}, {"page": "Lilian Douglas-Home, Countess of Home", "response": ["#REDIRECT Charles Douglas-Home, 13th Earl of Home"]}]}}