{"wiki_id": "http://www.wikidata.org/entity/Q5076972", "itemLabel": "Charles Draper", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Draper_(musician)", "wikipedia_page": {"main": "Charles Draper (23 October 1869 – 21 October 1952) was a British classical clarinettist, sometimes described as the grandfather of English clarinettists.Draper was born in Odcombe, Somerset.  He came from a musical family, his father and brother, having been cellists and clarinettists, respectively.  In 1888, he studied with Henry Lazarus, and he won a scholarship to the Royal College of Music where he continued as a student of Lazarus until the latter's retirement.  He also studied for a year under Julian Egerton.  He premiered Stanford's Clarinet Concerto in 1903 with the Bournemouth Municipal Orchestra.  Stanford's Clarinet Sonata was also dedicated to Draper.  Draper was also a notable teacher, teaching at the Royal College of Music, Trinity College of Music, and Guildhall School of Music & Drama, and counting Frederick Thurston among his students.  His son, Paul Beaumont Draper, was also an accomplished bassoonist.  Draper died in Surbiton, aged 82.", "link_mentions": [{"page": "William Walton", "response": ["Among the audience were Evelyn Waugh, Virginia Woolf and Noël Coward. The last was so outraged by the avant-garde nature of Sitwell's verses and the staging, that he marched out ostentatiously during the performance.Hoare, p. 120. The players did not like the music: the clarinettist, Charles Draper asked the composer, \"Mr Walton, has a clarinet player ever done you an injury?\"Kennedy, p. 33 Nevertheless, the work soon became accepted, and within a decade Walton's music was used for the popular Façade ballet, choreographed by Frederick Ashton.Kennedy, p. 62"]}, {"page": "Jack Brymer", "response": ["Although he had no formal tuition as a clarinettist, Brymer maintained that nobody was entirely self-taught: \"I learnt from everyone I heard play. Frederick Thurston and Reginald Kell unwittingly betrayed their methods to me, but I also decided that I wanted to play in certain ways that they had never done. The ability to play the clarinet is the ability to overcome the imperfections of the instrument. There's no such thing as a perfect clarinet, never was and never will be.\" Other clarinettists whose technique Brymer observed and learned from were Charles Draper and Haydn Draper. Brymer wrote of his predecessors, \"They would have been astounded at the things they taught me, without a penny piece changing hands.\""]}, {"page": "National Gramophonic Society", "response": ["The most prolific NGS recording artists were three string quartets: the Spencer Dyke String Quartet and André Mangeot's Music Society String Quartet and International String Quartet. Well-known musicians who also recorded for the Society included John Barbirolli (as both cellist and conductor), the clarinettists Charles Draper and Frederick Thurston, the oboist Leon Goossens, the violinist Adila Fachiri, and the pianists Donald Francis Tovey, Harold Craxton, Kathleen Long, and Bartlett and Robertson."]}, {"page": "1952 in British music", "response": ["*21 October – Charles Draper, clarinetist, 82"]}, {"page": "Frederick Thurston", "response": ["From the age of 7 he was taught by his father and he won an open scholarship to the Royal College of Music, becoming a pupil of Charles Draper.  During the 1920s he played with the orchestra of the Royal Opera House and the BBC Wireless Orchestra before becoming principal clarinettist of the newly formed BBC Symphony Orchestra.  He left the BBC Symphony Orchestra in 1946 to concentrate on chamber music.Robert Philip/Pamela Weston, 'Thurston, Frederick', Grove Music Online, accessed 30 June 2007"]}, {"page": "Draper (surname)", "response": ["* Charles Draper (musician) (1869–1952), British clarinetist"]}, {"page": "Léner Quartet", "response": ["* Beethoven: Septet in E flat major op 20 (Léner, Roth and Hartmann with Claude Hobday (bass), Charles Draper (clarinet), E.W. Hinchcliffe (bassoon), Aubrey Brain (French horn)). (LX 109-113). (Before 1933).", "* Mozart: Quintet in A major K581, with Charles Draper, clarinet (L 2252-2255). (Before 1933).", "* Schubert: Octet in F major op 166, with Claude Hobday (bass), Charles Draper (clarinet), E.W. Hinchcliffe (bassoon), Aubrey Brain (French horn). (L 2108-2113). (For Schubert centenary 1928).", "* Brahms: Quintet in B minor op 115, with Charles Draper, clarinet (L 2228-2232). (Before 1933)."]}, {"page": "Spencer Dyke Quartet", "response": ["*Mozart: Clarinet Quintet in A major K 581, with Charles Draper, clarinet (NGS XX,YY,ZZ,AAA+: 7 sides)"]}, {"page": "Claude Hobday", "response": ["He also appears with the Léner Quartet in the Columbia Records electric microphone recordings of the Beethoven Septet in E flat major and the (1928) Schubert Octet in F major, with Charles Draper (clarinet), E.W. Hinchliffe (bassoon) and Aubrey Brain (French horn)."]}, {"page": "Julian Egerton", "response": ["Egerton was born in London. Despite contracting polio at the age of eight, he went on to have a lengthy, productive career, performing until the age of 93.  He first studied under his father, William Egerton, and then with George Tyler of the Royal Philharmonic Society.  He was the first British clarinetist to perform Brahms' Clarinet Quintet Op. 115. He was professor at the Royal College of Music in succession to Henry Lazarus from 1894 until 1910, and at Kneller Hall from 1889.  His students included Charles Draper and Haydn Draper."]}, {"page": "List of clarinetists", "response": ["* Charles Draper"]}, {"page": "Charles Draper", "response": ["Charles Draper  may refer to:", "* Charles Draper (musician) (1869–1952), British classical clarinetist"]}, {"page": "Ria Ginster", "response": ["The program of a recital at Wigmore Hall in London on 7 February 1934 with pianist George Reeves began with Italian arias, followed by groups of songs by Schubert, Brahms, Debussy and Hugo Wolf. In a recital at Grotrian  Hall in London on 11 January 1938, with Reeves and clarinetist Charles Draper, she sang works by Mozart (\"Das Veilchen\"), Brahms (\"Meine Liebe ist grün\"), Schubert (\"Der Hirt auf dem Felsen\"), Hans Pfitzner, and Reger (\"Mariae Wiegenlied\")."]}]}}