{"wiki_id": "http://www.wikidata.org/entity/Q5076075", "itemLabel": "Charles Campbell Ross", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Campbell_Ross", "wikipedia_page": {"main": "Charles Campbell Ross (born London 1849; died 9 July 1920, Whitechapel) was a British politician and banker based in Penzance, Cornwall. The grandson of the banker Joseph Carne through his eldest daughter Mary (who married, 9 August 1836, Dr Archibald Campbell Colquhoun Ross, of Lanarkshire), he was educated at Brighton College, he was leading member of the Penzance Borough Council in the 1880s serving as mayor five times in 1877, 1878, 1879, 1881 and 1883. During this period he was also member of parliament for the St Ives constituency (1881–1885) as a member of the Conservative Party. The General Election of 1885 was \"fiercely contested\" and he was defeated by the Liberal candidate, Sir John St Aubyn.His family home and estate in Penzance are now the Morrab Library and Morrab Gardens. He also held the positions of borough magistrate, county magistrate and Hon Secretary of the West Cornwall Infirmary. The Ross bridge in Penzance is named after Charles Ross.Charles Ross was a major partner in the Penzance Bank (otherwise known as Batten, Carne and Carne) which had major branches in Penzance and Devonport. He inherited the position from his grandfather the well known Cornish banker and geologist Joseph Carne FRS. In 1896 the Penzance bank ceased trading, and was wound up by 1897. Following the collapse of the bank Charles Ross moved to London and became a curator of a museum in the east of the city.He married in 1870 his cousin Isabella Emily Carne (d 1888). Their son Archibald Campbell Carne Ross was the father of the linguist Alan S C Ross.", "link_mentions": [{"page": "Penzance", "response": ["In 1875 a local newspaper described the railway station as a large dog's house of the nastiest and draughtiest kind but a series of works improved this part of the town during the 1880s. The original railway station was rebuilt with the present buildings and train shed over the platforms (1880). The lower end of Market Jew Street was widened and a new road was built to link the station with the harbour over the Ross Swing Bridge (1881) (named after Charles Campbell Ross),P. A. S. Pool's History of the Borough and Town of Penzance, 1974 allowing the construction of proper sewers beneath. A larger dry dock replaced Matthews' original facility (1880), and a floating harbour was made (1884) with lock gates to keep in the water at low tide."]}, {"page": "Charles Ross", "response": ["* Charles Campbell Ross (1849–1920), British politician and banker"]}, {"page": "Helena Modjeska", "response": ["On 20 August 1877 Modjeska debuted at the California Theatre in San Francisco in an English version of Ernest Legouvé's Adrienne Lecouvreur. She was seen by theatrical agent Harry J. Sargent who signed her for a tour on the east coast where she made her New York debut.San Francisco Chronicle (October 17, 2010) \"Modjeska – Woman Triuimphant\" She then spent three years abroad (1879–82), mainly in London, attempting to improve her English, before returning to the stage in America. In 1880, she visited the Lizard Peninsula in Cornwall and on hearing that the parish church of Ruan Minor was in need of an organ she collaborated with Mr J Forbes-Robertson to put on a performance. Romeo and Juliet was performed on a temporary stage in the vicarage garden and watched by many local people. A resident of Penzance and soon-to-be member of parliament for the St Ives constituency, Charles Campbell Ross, played the part of Friar Laurence."]}, {"page": "Morrab Gardens", "response": ["Morrab House with its walled garden was built in 1841 for brewer Samuel Pidwell. The house is described as \"...a large stucco villa in the Georgian manner with columned porch\". Shortly after the Pidwell family moved to Portugal the property was purchased by Charles Campbell Ross banker, and Member of Parliament for the St Ives Constituency. In September 1881, Ross advertised Morrab House for rent. There was also, a cottage suitable for a coachman or gardener, stables for three horses, a conservatory with a hot water apparatus, a dairy, coach-house, lawn, fruit and flower gardens, lawn and meadow land. Morrab House was auctioned on 29 August 1887 and was purchased for £2,800 by Mr King, who was Her Majesty's Inspector of Schools for the district. At that time a tenant was paying £115 rent for the house and  of gardens and meadow."]}, {"page": "St Ives (UK Parliament constituency)", "response": ["| Charles Campbell Ross"]}, {"page": "List of people educated at Brighton College", "response": ["*Charles Campbell Ross (1849–1920), banker and politician, Conservative MP for St Ives 1881–85"]}, {"page": "List of mayors of Penzance", "response": ["*1877–1879 Charles Campbell Ross", "*1881 Charles Campbell Ross", "*1883 Charles Campbell Ross (also MP for the St Ives (UK Parliament constituency) )"]}, {"page": "Morrab Library", "response": ["The Morrab Library is housed within Morrab House in the Morrab Gardens, which was built in 1841 for the brewer Samuel Pidwell. The house is described as \"...a large stucco villa in the Georgian manner with columned porch\" and is a grade II listed building. Shortly after the Pidwell family moved to Portugal, it became the home of Charles Campbell Ross, Member of Parliament for the St Ives constituency from 1881–1885. On 16 July 1888 the house and walled gardens were bought by the Corporation of Penzance for £3,120 for use as a municipal park. The gardens opened on 27 September 1889 with a half day holiday and a procession through the streets. The library moved into Morrab House in the same year."]}, {"page": "Alan S. C. Ross", "response": ["A patrilineal descendant of Robert the Bruce, he was the elder son of Archibald Campbell Carne Ross of Penzance and Brecon (through whom he descended also from Joseph Carne, of the Batten, Carne and Carne bank), and Millicent Strode Cobham. His paternal grandfather was Charles Campbell Ross. He was educated at Lindisfarne in Blackheath, Naish House in Burnham-on-Sea, Malvern College and Christ College, Brecon. He also attended Balliol College, University of Oxford after winning a Henry Skynner Scholarship in Astronomy in 1925, however he transferred to the School of English Language and Literature and graduated with first class honours in 1929. He also possessed a master's degree from the University of Birmingham."]}, {"page": "Joseph Carne", "response": ["This work led to the collection of Cornish minerals, which he left in his Will to the care of his daughter Elizabeth. After her death in 1873, they became part of the family estate in the possession of Charles Campbell Ross, formerly MP for St. Ives. The Carne Mineral Collection was purchased for Cambridge University, by a coalition of sponsors and patrons keen to see it preserved, from the bankruptcy sale of the Carne bank's assets in the 1890s. See 'Fall of the House of Carne' on-line. The Carne Collection forms part of the large geological collections exhibited in the Sedgwick Museum of Earth Sciences, Cambridge."]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|Charles Campbell Ross"]}, {"page": "Penzance Natural History and Antiquarian Society", "response": ["Fifty-three members joined the society after it was revived in June 1880 following a public meeting on 8 May. A petition, dated 26 April, had been made to the Mayor of Penzance, Charles Campbell Ross following concern that the museum had accumulated arrears of nearly £100 and was in danger of being sold. A new series of Reports and Transactions was published annually until 1890 and intermittently until 1899. The annual excursion and lectures continued into the 20th century and the 1935 AGM reported a membership of 160 and a credit balance of £55 10s 10d. The Penzance Natural History and Antiquarian Society ceased to exist in 1961.Tregelles, G.F. 1890 Report to the AGM. In (1889–90) Transactions of the Natural History and Antiquarian Society of Penzance. New Series.Pool, P.A.S. (1974) The History of the Town and Borough of Penzance. Penzance: The Corporation of Penzance.", "* 1880–81 Charles Campbell Ross, M.P."]}]}}