{"wiki_id": "http://www.wikidata.org/entity/Q507452", "itemLabel": "Oliver Gavin", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Gavin", "wikipedia_page": {"main": "Oliver Benjamin Gavin (born 29 September 1972), is a British racing driver who joined Corvette Racing in 2002. He has won five American Le Mans Series class championships, five 24 Hours of Le Mans class wins, five 12 Hours of Sebring class wins and five Petit Le Mans class wins.", "link_mentions": [{"page": "September 29", "response": ["*1972 – Oliver Gavin, English race car driver"]}, {"page": "Huntingdon", "response": ["*Oliver Gavin (born 1972), racing car driver, was born in Huntingdon."]}, {"page": "Grand Prix of Long Beach", "response": ["|  Oliver Gavin Olivier BerettaChevrolet Corvette C6.R", "|  Oliver Gavin Olivier BerettaChevrolet Corvette C6.R", "|  Oliver Gavin Tommy MilnerChevrolet Corvette C6 ZR1", "| colspan=\"2\"|  Oliver Gavin Tommy MilnerChevrolet Corvette C7.R", "| colspan=\"2\"|  Oliver Gavin Tommy MilnerChevrolet Corvette C7.R", "| GT Le Mans (GTLM) || 1:17.215 || Oliver Gavin || Chevrolet Corvette C7.R || 2019 BUBBA Burger Sports Car Grand Prix"]}, {"page": "Bertrand Gachot", "response": ["Gachot stayed with Pacific for 1995, with the new PR02 chassis, Cosworth ED engines and an influx of experienced personnel after a merger with the remains of Team Lotus. There were only 26 entrants; hence, he was a guaranteed starter, and the reliable package meant the car could at least finish races, though Gachot and teammate Andrea Montermini were largely left battling at the back of the grid. The team's finances were tight, and Gachot stood down mid-season so that pay drivers Giovanni Lavaggi and Jean-Denis Délétraz could take his seat and bring some money to Pacific. After Délétraz's sponsors defaulted on payments, the team planned to rent the drive to Formula Nippon driver Katsumi Yamamoto for the two races in Japan, but he was not granted a superlicence, so Gachot retook the seat. Gachot also intended to hand the car over to the team's test driver Oliver Gavin for the season finale in Australia; however, the Englishman was also refused a superlicence and the Frenchman was forced back into the car, equalling the team's best result with 8th place after much of the field had retired. It was Gachot's final Grand Prix, for Pacific folded at the end of the season."]}, {"page": "1995 Australian Grand Prix", "response": ["The race marked the end of Pacific Racing, as the team went back to International Formula 3000 for 1996. In a last gasp effort, Pacific tried to have their test driver Oliver Gavin in the seat, but he was not granted an FIA Super License and shareholder Bertrand Gachot raced instead. It was only the second time in Formula One history that the winner won by two laps– the first time was at the 1969 Spanish Grand Prix when Jackie Stewart won. Hill, who had been criticised for his performances in all of the three previous races, was praised by commentator Murray Walker for this performance, with Walker saying that, with Schumacher and Coulthard's imminent moves to Ferrari and McLaren respectively, Hill would be a strong favourite to win the title in 1996 if he could continue to perform in the way he had done so in this particular race. This would also be the last race for a V12 engine. Only Ferrari used this configuration, but would switch to a more fuel-efficient V10 engine for 1996."]}, {"page": "Max Papis", "response": ["|align=\"left\"|  Oliver Gavin Olivier Beretta", "|align=\"left\"|  Oliver Gavin Olivier Beretta"]}, {"page": "Olivier Beretta", "response": ["|align=\"left\"|  Oliver Gavin Jan Magnussen", "|align=\"left\"|  Oliver Gavin Jan Magnussen", "|align=\"left\"|  Oliver Gavin Jan Magnussen", "|align=\"left\"|  Oliver Gavin Max Papis", "|align=\"left\"|  Oliver Gavin Max Papis", "|align=\"left\"|  Oliver Gavin Marcel Fässler", "|align=\"left\"|  Oliver Gavin Emmanuel Collard"]}, {"page": "Jan Magnussen", "response": ["Magnussen has participated in various classes in the 24 hours of Le Mans every year since 1999. His best results so far are the victories in the GTS class in 2004 and GT1 class in 2005, 2006, and 2009, each time in a Chevrolet Corvette with Oliver Gavin and Olivier Beretta as teammates in 2005 and 2006, and Johnny O'Connell and Antonio García in 2009.", "|align=\"left\"|  Oliver Gavin Olivier Beretta", "|align=\"left\"|  Oliver Gavin Olivier Beretta", "|align=\"left\"|  Oliver Gavin Olivier Beretta", "|align=\"left\"|  Oliver Gavin Richard Westbrook", "|  Antonio García Oliver Gavin Richard Westbrook"]}, {"page": "Ralph Firman", "response": ["Educated at Gresham's School between 1988 and 1993, Firman went straight into motor racing on leaving school. Despite leading much of the 1995 British F3 championship, he lost the title at the final round to Oliver Gavin. However, he continued in the championship in 1996 and captured the title at his second attempt."]}, {"page": "Pacific Racing", "response": ["They were unable to enter F1 until 1994. The year was a disaster. Paul Belmondo and former Jordan driver Bertrand Gachot started the season as drivers, with Oliver Gavin testing. The PR01, designed for the 1993 season, had undergone none of the vital wind tunnel testing required to refine the car's aerodynamics, had seen only a few dozen miles of track testing and its Ilmor 3.5 L V10 engine was underpowered by 1994 standards. That season the team failed to score a point or finish a single race, and from the French Grand Prix onwards, neither car qualified.", "Aiming for a fresh start in 1995, Pacific made a deal with the owner of the former Team Lotus to enter as \"Pacific Team Lotus\".  Although no staff, equipment or technology came to the team as a result, the aim was for Pacific to benefit from association with the famous Lotus name. The obsolete Ilmor engines had been replaced by Ford ED V8s and a whole host of new sponsors were brought in. Good news also came when the PR02 was guaranteed a start each race, with Larrousse and Lotus disappearing from the entry lists and only Forti coming in. Belmondo had been replaced with Andrea Montermini. Having had no luck in the first half of the season, team partner Gachot vacated his seat in mid-1995, making way for paydrivers Giovanni Lavaggi (four races, four DNFs) and Jean-Denis Délétraz (two races, one DNF, one NC). Gachot later returned after the money of the two pay-drivers dried up and two drivers Wiggins wanted to run (Formula Nippon driver Katsumi Yamamoto for Okayama and Suzuka and test driver Oliver Gavin for Australia) were denied superlicences. Pacific's best finishes that season were 8th in the German and Australian Grands Prix."]}]}}