{"wiki_id": "http://www.wikidata.org/entity/Q5077400", "itemLabel": "Charles Enrique Dent", "itemDescription": "British biochemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Enrique_Dent", "wikipedia_page": {"main": "Charles Enrique Dent,  (25 August 1911 – 19 September 1976) was a British professor of human metabolism at University College. After studying chemistry at Imperial College London, he gained a PhD for his work on copper phthalocyanin, then worked for ICI Dyestuffs Group in Manchester and also studied secret writing, which he later made use of during the Second World War. \nHe completed his medical studies in 1944. The following year, he was sent by the Medical Research Council to the recently liberated concentration camp at Belsen together with Janet Vaughan and Rosalind Pitt-Rivers, to study if starvation could be treated with protein hydrolysates. \nFrom 1946, his career focused on several inborn errors of metabolism. He was appointed a Commander of the Order of the British Empire in the 1976 New Year Honours", "link_mentions": [{"page": "List of eponymous diseases", "response": ["* Dent disease – Charles Enrique Dent"]}, {"page": "Charles Dent", "response": ["* Charles Enrique Dent (1911–1976), physician and biochemist"]}, {"page": "Canada Gairdner International Award", "response": ["*1965 Jerome W. Conn, Robin R.A. Coombs, Charles Enrique Dent, Charles P. Leblond, , Frederick Horace Smirk"]}, {"page": "List of lay Catholic scientists", "response": ["* Charles Enrique Dent (1911–1976) – British biochemist who defined new amino-acid diseases such as various forms of Fanconi syndrome, Hartnup disease, argininosuccinic aciduria and homocystinuria"]}, {"page": "Dent's disease", "response": ["Dent's disease was first described by Charles Enrique Dent and M. Friedman in 1964, when they reported two unrelated British boys with rickets associated with renal tubular damage characterized by hypercalciuria, hyperphosphaturia, proteinuria, and aminoaciduria. This set of symptoms was not given a name until 30 years later, when the nephrologist Oliver Wrong more fully described the disease."]}, {"page": "List of fellows of the Royal Society D, E, F", "response": ["| Charles Enrique Dent||15/03/1962||25 August 1911 – 19 September 1976"]}, {"page": "Dent (surname)", "response": ["*Charles Enrique Dent (1911–1976), British biochemist"]}, {"page": "1976 New Year Honours", "response": ["* Charles Enrique Dent, , Professor of Human Metabolism, University College Hospital Medical School, University of London."]}, {"page": "Harry Harris (geneticist)", "response": ["While at the Galton Laboratory Harris focused on a number of diseases including diabetes mellitus, a disease that he would later develop.  In collaboration with Charles Enrique Dent and William Warren, Harris focused on cystinuria.  Using 2D paper chromatography and polarimetry, state-of-the-art technology at that time, they elucidated the genetics of the disease and other amino-acidurias diseases."]}, {"page": "List of fellows of the Royal Society elected in 1962", "response": ["*Charles Enrique Dent"]}, {"page": "List of people educated at Bedford School", "response": ["*Professor Charles Enrique Dent CBE FRCP FRS (1911–1976), physician and biochemist who gave his name to Dent's Disease"]}, {"page": "Emma Dent Coad", "response": ["Dent Coad was born in Stepney, the youngest of six children. Her father, Charles Enrique Dent CBE, was a professor of medicine of half Spanish descent, and her mother, Margaret Ruth Coad, was an Anglican vicar's daughter who converted to Catholicism to marry him. She went to Sacred Heart High School, a selective grammar school in Hammersmith, London."]}, {"page": "List of London medical students who assisted at Belsen", "response": ["* Charles Enrique Dent"]}]}}