{"wiki_id": "http://www.wikidata.org/entity/Q5077996", "itemLabel": "Charles George Bonner", "itemDescription": "English recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_George_Bonner", "wikipedia_page": {"main": "Charles George Bonner  (29 December 1884 – 7 February 1951) was an English recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nOn 8 August 1917 in the Bay of Biscay, Atlantic, Lieutenant Bonner, now a lieutenant in the Royal Naval Reserve, was with HMS Dunraven (one of the 'Q' or 'mystery' ships playing the part of an unobservant merchantman) when she was shelled by an enemy submarine. The lieutenant was in the thick of the fighting and throughout the whole of the action his pluck and determination had a considerable influence on the crew. For his actions, Bonner was awarded the Victoria Cross. Ernest Herbert Pitcher also received the Victoria Cross for his involvement.\nHe later achieved the rank of captain in the Merchant Navy.", "link_mentions": [{"page": "HMS Dunraven", "response": ["In recognition, two Victoria Crosses were awarded, one to the ship's First Lieutenant, Lt. Charles George Bonner RNR, and the other, by ballot, to a gunlayer, Petty Officer Ernest Herbert Pitcher."]}, {"page": "Aldridge", "response": ["Charles George Bonner VC, DSC (29 December 1884 – 7 February 1951), born in Aldridge, was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. Bonner Grove is a well-maintained neighbourhood of social housing flats and privately owned houses in Aldridge that remembers his name."]}, {"page": "List of English Victoria Cross recipients", "response": ["| Charles George Bonner || Royal Navy || 1917 || First World War || Bay of Biscay"]}, {"page": "James Thompson (VC)", "response": ["His Victoria Cross is displayed at the Royal Green Jackets (Rifles) Museum in Winchester, England. In December 2009, a memorial plaque to Thompson and two other recipients of the Victoria Cross, John Henry Carless and Charles George Bonner, was unveiled at the Town Hall in Walsall, England."]}, {"page": "Gordon Campbell (Royal Navy officer)", "response": ["Campbell also commanded HMS Dunraven during the action of 8 August 1917 when she was sunk by SM UC-71. Victoria Crosses were awarded to two members of the crew who were selected by ballot from amongst the crew of Dunraven, Lieutenant Charles George Bonner and Petty Officer Ernest Herbert Pitcher. Campbell received his second Bar to his Distinguished Service Order (DSO).Gazette Issue 30363 published on 30 October 1917 p11315"]}, {"page": "Charles Bonner", "response": ["#REDIRECT Charles George Bonner"]}, {"page": "John Henry Carless", "response": ["In December 2009, a memorial plaque to Carless and two other recipients of the Victoria Cross, James Thompson and Charles George Bonner, was unveiled at Walsall Town Hall. "]}, {"page": "Ernest Herbert Pitcher", "response": ["Petty Officer Pitcher was captain of the 4-inch gun crew. When the magazine below them blew up the crew were blown into the air, but Pitcher and another man landed on mock railway trucks made of wood and canvas, which cushioned their falls and saved their lives. His VC was awarded by ballot of the gun crew. Lieutenant Charles George Bonner was also awarded the VC. Pitcher also received the Croix de Guerre and the Médaille Militaire."]}, {"page": "The Coleshill School", "response": ["* Charles George Bonner VC"]}, {"page": "Shuttington", "response": ["* Charles George Bonner VC, DSC (1884 – 1951) recipient of the Victoria Cross was born in Shuttington"]}, {"page": "Warriston Cemetery", "response": ["* Captain Charles George Bonner (1884–1951), Royal Navy Victoria Cross recipient World War I.Burial Location VC holders Staffordshire (headstone in St Mary's Churchyard, Aldridge).  At time of writing he is not entered on the page for Edinburgh."]}, {"page": "Bonner (name)", "response": ["* Charles George Bonner (1884–1951), English recipient of the Victoria Cross"]}, {"page": "Walsall Town Hall", "response": ["Also inside the building are a memorial to organist and composer Charles Swinnerton Heap, sculpted by Albert Toft, and a 2009 memorial plaque to Walsall's three recipients of the Victoria Cross, John Henry Carless, James Thompson and Charles George Bonner."]}, {"page": "Walsall Silver Thread Tapestries", "response": ["* Charles Holland, cyclist, and Charles George Bonner VC"]}]}}