{"wiki_id": "http://www.wikidata.org/entity/Q5075255", "itemLabel": "Charles Augustus Tulk", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Augustus_Tulk", "wikipedia_page": {"main": "Charles Augustus Tulk (1786–1849) was an English Swedenborgian and politician.", "link_mentions": [{"page": "Leicester Square", "response": ["In 1848, the land was subject to the significant legal case of Tulk v Moxhay. The plot's previous owner, Moxhay, had agreed upon a covenant not to erect buildings but the law would not allow buyers who were not \"privy\" to the initial contract to be bound by subsequent promises. The judge, Lord Cottenham, decided that future owners of land could be bound by promises to abstain from activity, subject to the doctrine of notice (actual or constructive). Otherwise, a buyer could (re-)sell land to himself to undermine an initial promise.Tulk v. Moxhay (1848) 41 ER 1143 (Court Rolls) James Wyld bought the assets of the garden from the Tulk and Moxhay's death estates in 1849 to erect the Great Globe, though buried the statue of George I under 12 feet of earth with the globe stuck on top. The statue was uncovered following the globe's demise, but by 1866 it had deteriorated due to vandalism and was sold for £16. Arguments continued about the fate of the garden, with Charles Augustus Tulk's heirs erecting a wooden hoarding around the property in 1873. These were quickly removed after the Master of the Rolls ordered that the land must be preserved for its original purpose."]}, {"page": "Poole (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Charles Augustus Tulk"]}, {"page": "Sudbury (UK Parliament constituency)", "response": ["| Charles Augustus Tulk"]}, {"page": "Wyld's Great Globe", "response": ["Wyld made an agreement with the owner of the gardens, Pheobe Moxhay, to acquire the freehold for £3,000, but the Tulk family, who owned the buildings on three sides of the square and already had a judgement against Moxhay's late husband, Edward Moxhay, would have been able to prevent Wyld building. They used this hold over him to negotiate a favourable deal for themselves: they would allow Wyld to use the land for ten years from 25 April 1851, after which he would remove any buildings that he had erected within six months, and each branch of the Tulk family would have a one-year option to buy half the land for £500.The Tulk family had bought part of the Leicester Square estate around 1758 and by an agreement in 1807 John Augustus Tulk had divided the estate with his eldest son Charles Augustus Tulk. Although Wyld and the Tulks attempted to negotiate with the owner of the buildings on the north side of the square, Henry Webb, they were not able to reach an agreement, and they eventually signed the contract without his assent. When Wyld began to prepare the site, Webb announced his intention to take out an injunction to prevent the building work proceeding. Wyld restarted negotiations with Webb and eventually (in July 1851, over a month after the building had been completed) Webb agreed to allow the ten-year agreement with the Tulks to stand."]}, {"page": "Augustus H. Tulk", "response": ["Tulk was born in Richmond, Surrey, England, the son of Charles Augustus Tulk and his wife Susannah, and received a solid classical education at Winchester College. He emigrated from England to Australia for medical reasons in 1854."]}, {"page": "Tulk", "response": ["* Augustus H. Tulk (1810–1873), Australian librarian, son of Charles Augustus Tulk", "* Charles Augustus Tulk (1786–1849), English Swedenborgian and politician"]}, {"page": "St John's Lodge, London", "response": ["St John's Lodge is the first villa to be built in Regent's Park in 1812 and was designed for Charles Augustus Tulk by architect John Raffield. The Royal Parks service described St John's Lodge and The Holme as the only two villas remaining from John Nash's original conception of Regent's Park,Regent's Park: History Royal Parks which would have included a royal palace. "]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|Charles Augustus Tulk||14/11/1822||2 June 1786 – 16 January 1849"]}, {"page": "Tulk v Moxhay", "response": ["In 1808, Charles Augustus Tulk, the owner of several parcels of land in Leicester Square,'Leicester Square Area: Leicester Estate', Survey of London: volumes 33 and 34: St Anne Soho (1966), pp. 416-440. URL: http://www.british-history.ac.uk/report.aspx?compid=41119 Date accessed: 23 February 2012. sold one of the plots to another person who made a covenant to keep the Garden Square \"uncovered with buildings\" such that it would remain a pleasure ground. Over the following years the land was sold several times over (passed through successive owners), eventually to the defendant, Edward Moxhay, in a contract which did not recite (nor expressly stipulate) the covenant."]}, {"page": "Introduction (Blake, 1794)", "response": ["Coleridge marked the poem with the symbol “H” that meant “still greater” than just “gave me pleasure”.See: Letter to Charles Augustus Tulk, 12 February 1818 Anonymous Blake's contemporary reviewer (C. A. Tulk? 1830) wrote:"]}, {"page": "Samuel Noble", "response": ["In addition to his regular duties Noble worked as a lecturer in London and the provinces. His leadership of his denomination was not undisputed. His first controversy was with Charles Augustus Tulk, who was excluded from the society. Noble developed a doctrine which was viewed as a heresy by many of his co-religionists: he held that Jesus Christ was not resuscitated in the same body, but rather his body dissipated in the grave, and replaced at the resurrection by a new and divine frame. Hence arose the controversy between \"resuscitationists\" and \"dissipationists\"; John Clowes and Robert Hindmarsh rejected Noble's view, and his major antagonist was William Mason (1790–1863). In support of his position, a \"Noble Society\" was formed."]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|Charles Augustus Tulk||"]}, {"page": "Scrope Berdmore Davies", "response": ["Davies was a noted Georgian and Regency period wit: his recorded witticisms include put-downs of Charles Augustus Tulk and Frederick Goulburn. Byron put one of his jokes, made against Beau Brummell's efforts to learn French, into Beppo. "]}, {"page": "Mary Hume-Rothery", "response": ["She wrote and published a biography of Charles Augustus Tulk and an explanation of his ideas. Tulk was a friend of her father's who had persuaded her to become a Swedenborgian. He was not a member of this New Church, but his writings on the church founder's ideas about the 'law of correspondence' were addressed to the church members."]}, {"page": "Edward Moxhay", "response": ["The Tulk family had acquired the gardens in the centre of Leicester Square in the eighteenth century with a legal agreement that they had an obligation to maintain the gardens \"uncovered by any buildings\" and in 1808 Charles Augustus Tulk, foolishly sold the gardens to a local dentist, Charles Elms for £210 passing on this obligation. Elms subsequently sold to Robert Barren, who later sold to John Inderwick. When Moxhay bought the gardens in 1839 he was an established speculative builder, so clearly had development in mind, and being unable to remove this restrictive covenant chose to ignore it. After four years of legal wrangling, in 1848 Moxhay paid Barren's widow £120 to release Inderwick from the covenant and the freehold of the garden was finally conveyed by Inderwick to Moxhay without any obligation to maintain it or even to keep it \"uncovered with any buildings\". Moxhay immediately started felling the square's trees and in October 1848 Charles Augustus Tulk, whose folly in selling the garden for £210 forty years earlier was the main cause of this deplorable state of affairs, sought an injunction in Chancery to restrain Moxhay from despoiling the square or building on the garden. Moxhay argued that nearby development had made the square \"entirely dependent for its prosperity upon trade and commerce\" and that the residents no longer used the garden, which had become an unsightly disgrace to the neighbourhood, though he admitted that he had considered erecting a bazaar in the garden as early as 1845. In December 1848 the Master of the Rolls made an order restraining Moxhay from using the garden in any way which \"might be inconsistent with the use of it as an open garden and pleasure ground\", and this decision was subsequently upheld by the Lord Chancellor. This legal decision, Tulk v Moxhay, has become a landmark case in establishing that covenants bind subsequent owners of land.'Leicester Square Area: Leicester Estate', in Survey of London: Volumes 33 and 34, St Anne Soho, ed. F H W Sheppard (London, 1966), pp. 416-440. British History Online http://www.british-history.ac.uk/survey-london/vols33-4/pp416-440 [accessed 27 May 2021]."]}]}}