{"wiki_id": "http://www.wikidata.org/entity/Q507440", "itemLabel": "Andrew Simpson", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Simpson_(actor)", "wikipedia_page": {"main": "Andrew Gerard Simpson (born 1 January 1989) is an actor from Northern Ireland. He was spotted while performing in a festival by talent scout Patrick Duncan, who was working for Aisling Walsh, the director of Song for a Raggy Boy. He is best known for playing Steven Connolly in Notes on a Scandal.", "link_mentions": [{"page": "Nicholas Nickleby", "response": ["In 2012, the novel was adapted as a modern drama (with several changes to the plot and characters) for the BBC, filmed in Belfast, Northern Ireland, with mainly local actors. The five-part series was titled Nick Nickleby. In this version, the title character is played by Andrew Simpson, with Linda Bassett as Mrs Smike, Adrian Dunbar as Ralph Nickleby, Jonathan Harden as Newman Noggs (also narrating the series), Bronagh Gallagher as Mrs Nickleby and Jayne Wisener (Kat Nickleby) also starring. It was aired on BBC One from 5–9 November at 2:15pm. Each episode was 45 minutes long and produced by Kindle Entertainment Ltd and distributed by Indigo Film and Television."]}, {"page": "Song for a Raggy Boy", "response": ["*Andrew Simpson ... Gerard Peters 458"]}, {"page": "Kōki Uchiyama", "response": ["| Notes on a Scandal || Steven Connolly || Voice dub for Andrew Simpson || "]}, {"page": "Fahan", "response": ["* Andrew Simpson, actor"]}, {"page": "List of Donegal people", "response": ["*Andrew Simpson, actor"]}, {"page": "Notes on a Scandal (film)", "response": ["* Andrew Simpson as Steven Connolly"]}, {"page": "Simpson (name)", "response": ["* Andrew Simpson (disambiguation), several people", "** Andrew Simpson (animal trainer) (born 1966/1967), Scottish animal trainer", "** Andrew Simpson (sailor) (1976–2013), British sailor", "** Andrew Simpson (actor) (born 1989), Irish actor", "* Andrew Simpson (Neighbors), from the soap opera Neighbours"]}, {"page": "Perrier's Bounty", "response": ["* Andrew Simpson as Teen 2"]}, {"page": "Chris Newman (actor)", "response": ["In 2003, Newman landed a role in the TV series, The Clinic, alongside a young Saoirse Ronan, who played his sister. For the next few years, he juggled school work with roles in Love is the Drug, Stardust and Aisling's Diary. In 2009, he undertook a role in the crime-drama Love/Hate. In 2010, Newman had a small part in the comedy gangster film, Perrier's Bounty, starring Cillian Murphy, Brendan Gleeson and Jim Broadbent before working with Joe Flanigan and John Rhys-Davies on the sci-fi TV movie, Ferocious Planet. In 2012 he played William Kelly, an assistant electrician in Saving the Titanic alongside Andrew Simpson, his co-star in Song for a Raggy Boy. Chris Newman made his debut in the Abbey Theatre in February with two twenty-minute plays about love, life and relationships called Love in a Glass Jar and Ribbons. In 2013 he appeared in Quirke. Since 2015, Newman has played the corrupt Detective Rory Walsh in Red Rock."]}, {"page": "Andrew Simpson", "response": ["Andrew Simpson may refer to:", "* Andrew Simpson (actor) (born 1989), Irish actor", "* Andrew Simpson (sailor) (1976–2013), British sailor", "* Andrew Simpson (animal trainer) (born 1966/1967), Scottish animal trainer", "* Andrew Simpson (Neighbours), a fictional character from the soap opera Neighbours"]}, {"page": "List of Western films of the 2010s", "response": ["|Heathen and Thieves || Megan Peterson, John Douglas Sinclair || Andrew Simpson, Gwendoline Yeo, Don Swayze || || United States || traditional Western"]}, {"page": "Abner Pastoll", "response": ["In the summer of 2014, he shot the France-UK co-production Road Games  (aka Fausse Route), starring Andrew Simpson, Joséphine de La Baume, Frédéric Pierrot and genre legend Barbara Crampton. The film has been described as a 'taut Euro thriller'. It world premiered in August 2015 at FrightFest in London, and was released theatrically in the US on 4 March 2016 by IFC Films to an overall positive reaction. Bloody Disgusting called it \"a wonderful thriller; a layered character-driven narrative with great writing and equally-great tension – a very pleasant surprise.\" The film currently retains an 83% Fresh position on Rotten Tomatoes."]}, {"page": "White Heat (TV series)", "response": ["* Connor - Andrew Simpson"]}, {"page": "Good Vibrations (film)", "response": ["* Andrew Simpson as Colin \"Getty\" Getgood"]}, {"page": "Road Games (film)", "response": ["Road Games (also known as Fausse Route) is a 2015 British-French co-production thriller film written and directed by Abner Pastoll. The film stars Andrew Simpson as a British hitchhiker travelling through France. IFC Films released the film theatrically in the US on March 4, 2016. Icon Film Distribution released the film in the UK and Ireland on August 26, 2016.", "*Andrew Simpson as Jack", "Scenes were also filmed at St Clere, Kent, where Jack (Andrew Simpson), Veronique (Joséphine de La Baume) and Grizard (Frédéric Pierrot) arrive at the house and meet Mary (Barbara Crampton). Scenes also took place at Falconhurst in Kent, where Delacroix (Féodor Atkine) drugs Jack and takes him in to the van to his barn, where he feeds him and then puts him back into truck room which Jack escapes. Shooting also took place at Castle Farm - Lavendar, Kent where Jack (Andrew Simpson) and Veronique  are seen running across the field away from Grizard and Mary."]}, {"page": "The Survivalist (2015 film)", "response": ["* Andrew Simpson as the Gaunt Man"]}, {"page": "List of British films of 2019", "response": ["|| Director: Abner Pastoll  Cast: Sarah Bolger, Edward Hogg, Andrew Simpson, Jane Brennan"]}]}}