{"wiki_id": "http://www.wikidata.org/entity/Q5076061", "itemLabel": "Charles Calvert Bowring", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Calvert_Bowring", "wikipedia_page": {"main": "Sir Charles Calvert Bowring   (20 November 1872 – 13 June 1945) was a British colonial administrator, mainly in Kenya, who was later Governor and Commander in Chief of the Nyasaland Protectorate from 1923 to 1929.", "link_mentions": [{"page": "Nyasaland", "response": ["* Sir Charles Calvert Bowring: 27 March 1924 – 30 May 1929"]}, {"page": "List of colonial governors and administrators of Kenya", "response": ["| Sir  Charles Calvert Bowring(1872–1945)", "| Sir  Charles Calvert Bowring(1872–1945)", "|Sir  Charles Calvert Bowring(1872–1945)"]}, {"page": "List of colonial governors of Nyasaland", "response": ["|27 March 1924 to 30 May 1929||Charles Calvert Bowring, Governor||"]}, {"page": "Index of Malawi-related articles", "response": ["Charles Calvert Bowring -"]}, {"page": "Bowring", "response": ["*Charles Calvert Bowring (1872–1945), British colonial administrator (East Africa), son of J. C. Bowring"]}, {"page": "Robert Laws", "response": ["In October 1925, the Governor of Nyasaland, Charles Calvert Bowring, laid the foundation stone for additional buildings at Livingstonia, which Dr Robert Laws wanted to develop into a university for African students in Nyasaland and neighboring colonies. Bowring wrote \"Livingstonia appeals to me enormously as a training centre because of its comparative isolation and at the same time easy accessibility. The students are away from the many temptations of town life, and within easy reach by the lake and in touch by telegraph\"."]}, {"page": "Charles Bowring", "response": ["* Charles Calvert Bowring (1872–1945), British colonial administrator"]}, {"page": "Launcelot Ward", "response": ["Ward joined the Oxfordshire Light Infantry from school and was commissioned a second lieutenant on 1 December 1897. He saw active service in India, where he took part in the Tirah Campaign under Sir William Lockhart 1897–98, and was promoted a lieutenant on 28 October 1898 . In April 1902 he was seconded for service under Foreign office, and joined the King's East African Rifles in Uganda. He later transferred to this regiment, eventually commanding the regiment and, at the start of the First World War, being in charge of all forces in East Africa. He held the rank of Lieutenant-Colonel but was made an acting brigadier-general in operations in Western Europe later in the War, being twice wounded and twice mentioned in dispatches. He retired from the Army at the end of the war and from 1924 to 1929 was ADC to the Governor-General of Nyasaland, Sir Charles Calvert Bowring; his obituary states that he had bought property in what is now Malawi and was intending to retire there, but he died after an operation in London."]}, {"page": "1908 Birthday Honours", "response": ["*Charles Calvert Bowring, Esq., Treasurer of the East Africa Protectorate."]}, {"page": "Sir Charles Calvert Bowring", "response": ["#REDIRECT Charles Calvert Bowring"]}, {"page": "1919 Birthday Honours", "response": ["*Charles Calvert Bowring  Chief Secretary to the Government, East Africa Protectorate, for services as President of the War Council and Acting Governor of the Protectorate"]}, {"page": "1925 Birthday Honours", "response": ["*Sir Charles Calvert Bowring  Governor and Commander-in-Chief, Nyasaland Protectorate"]}, {"page": "Governor Bowring", "response": ["*Charles Calvert Bowring (1872–1945), Governor of Nyasaland from 1924 to 1929"]}]}}