{"wiki_id": "http://www.wikidata.org/entity/Q5078867", "itemLabel": "Charles Hayter", "itemDescription": "British artist (1761-1835)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Hayter", "wikipedia_page": {"main": "Charles Hayter (24 February 1761 – 1 December 1835) was an English painter.\nHe was the son of Charles Hayter (1728–1795), an architect and builder from Hampshire, and his wife, Elizabeth Holmes. He first trained with his father, but showed an inclination for drawing by producing some small pencil portraits, principally of family members. He was enrolled in the Royal Academy Schools in London in 1786 at the late age of about 25. From then on, he worked as a painter of portrait miniatures in London, and also Essex, and in 1832 in Winchester. He exhibited 113 portrait miniatures between 1786 and 1832, principally at the Royal Academy, and had a reputation for creating a good likeness.\nHayter married Martha Stevenson in 1788. His two sons and daughter were all successful artists; Sir George Hayter (1792–1871), John Hayter (1800–1895), and Anne Hayter who, like her father, was a miniature painter.\nCharles Hayter taught perspective (on which he was an authority) to Princess Charlotte, King George IV's daughter, to whom he was later appointed Professor in Perspective and Drawing. He also dedicated to her his book An Introduction to perspective, adapted to the capacities of youth, in a series of pleasing and familiar dialogues, first published in 1813 in London. He later published A New Practical Treatise on the Three Primitive Colours Assumed as a Perfect System of Rudimentary Information (London 1826), in which he described how all colours could be obtained from just three.\n\nAn album containing 443 studies for miniature portraits is in the Victoria and Albert Museum. Hayter noted inside the cover that these were sketches which he 'placed behind the Ivory, which being transparent, gave the artist the aid in making his outline on the ivory'.", "link_mentions": {}}}