{"wiki_id": "http://www.wikidata.org/entity/Q5075872", "itemLabel": "Charles Bullen", "itemDescription": "British Royal Navy admiral (1769-1853)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Bullen", "wikipedia_page": {"main": "Admiral Sir Charles Bullen  (10 September 1769 – 2 July 1853) was a highly efficient and successful naval officer who served in the Royal Navy during the French Revolutionary and Napoleonic Wars and distinguished himself at the Glorious First of June, the battle of Camperdown and the battle of Trafalgar.", "link_mentions": [{"page": "Chatham Dockyard", "response": ["* 1830–1832, Captain Charles BullenClowes. p.187."]}, {"page": "Battle of Camperdown", "response": ["Delft, captured in the early stages of the battle, was under the command of the Dutch Lieutenant Heilberg and the British Lieutenant Charles Bullen, with a small prize crew of 69 men. Ninety-three Dutch prisoners had been removed, and among the remaining Dutch sailors were 76 wounded men. As the gale intensified, it rapidly became clear that despite a tow line attached from Veteran the ship would never reach Britain, and a large board was raised on deck with the chalked message \"The ship is sinking\". Reacting at once, boats from nearby ships organised an evacuation and began loading the Dutch prisoners for transfer to more seaworthy vessels. Bullen offered a place in the first rescue boat, from Veteran, to Heilberg, but the Dutch officer refused, gesturing to the immobile wounded who had been brought onto the maindeck as the lower decks had flooded and replying \"But how can I leave these men?\". In response, Bullen cried out \"God bless you, my brave fellow! Here is my hand; I give you my word I will stay here with you!\". The prize crew left on the second rescue boat sent from Russell, and Bullen and Heilberg waited for a third trip to bring them off with the remaining 30 wounded men and three junior Dutch officers who had also elected to stay. Before further help could arrive, however, Delft suddenly foundered, Bullen and Heilberg throwing themselves clear as the ship sank. Both were seen in the water but only Bullen reached safety, swimming to Monmouth alone.James, p. 77"]}, {"page": "William Carnegie, 7th Earl of Northesk", "response": ["Carnegie continued his stint of brief frigate commands into 1793, taking command of HMS Beaulieu in January and sailing her to the Leeward Islands before returning to England later in the year in HMS Andromeda escorting a convoy.Winfield, British Warships 1714-1792, p. 984Winfield, British Warships 1714-1792, p. 1017 His next true command was of the brand new 64-gun third rate HMS Monmouth from September 1796, with Charles Bullen as his first lieutenant.Winfield, British Warships 1793-1817, p. 260Marshall, Royal Naval Biography, p. 591 Carnegie and Monmouth were assigned to the North Sea Fleet of Admiral Adam Duncan the same year.Marshall, Royal Naval Biography, p. 200 On 12 May 1797 many ships of the fleet including Monmouth were at the Nore when the Nore Mutiny began. Carnegie was confined to his cabin by his mutinous crew, until 6 June when he was brought before the committee of delegates that the mutineers had set up on Sandwich. Carnegie was selected by the committee to carry their terms to the king because of his reputation as a friend to seamen. While refusing to guarantee any success, Carnegie agreed to convey the terms and left the Nore for London. He took the mutineers' terms to the Admiralty from where the First Lord of the Admiralty Lord Spencer took him to the king. The demands were rejected, and a different officer returned to the mutineers with the reply.", "Carnegie was promoted to rear-admiral on 23 April 1804 as a rear-admiral of the white, keeping Britannia as his flagship and taking Charles Bullen as his flag captain.Marshall, Royal Naval Biography, p. 202 He stayed on the Brest blockade until detached with Vice-Admiral Robert Calder and twenty ships of the line to reinforce the fleet of Vice-Admiral Cuthbert Collingwood at Cádiz in August 1805, where the combined fleet of Admiral Pierre-Charles Villeneuve was sheltering.Lee, Nelson and Napoleon, p. 283 By October Carnegie was third in command of the Mediterranean Fleet commanded by Vice-Admiral Lord Nelson off Cádiz. The combined fleet sailed on 18 October and the British fleet came up with them on 21 October to fight what would become the Battle of Trafalgar.Schom, Trafalgar: Countdown to Battle, pp. 301-6 Nelson looked to pierce the combined fleet with two columns and for this purpose Britannia was in the windward column lead by Nelson in HMS Victory."]}, {"page": "Order of battle at the Battle of Trafalgar", "response": ["| align= left  | Rear-Admiral The Rt Hon. Earl of Northesk Capt Charles Bullen"]}, {"page": "Pembroke Dockyard", "response": ["* Captain Charles Bullen, July 1830 – 1832"]}, {"page": "Bullen", "response": ["* Charles Bullen, British military officer", "* Charles Bullen (Utah politician), American politician"]}, {"page": "1769 in Great Britain", "response": ["* 10 September – Charles Bullen, admiral (died 1853)"]}, {"page": "HMS Bullen", "response": ["HMS Bullen (K 469) was a  Captain-class frigate of the Royal Navy during World War II. She was named after  Charles Bullen who was captain of  at the battle of Trafalgar."]}, {"page": "HMS Monmouth (1796)", "response": ["HMS Monmouth was commissioned in September 1796 under the command of the Captain William Carnegie, Earl of Northesk. She was initially assigned to serve in the North Sea, and in May 1797 was one of the ships involved in the Nore mutiny. The crew took her first lieutenant, Charles Bullen, prisoner and threatened to execute him. Northesk intervened and Bullen was able to carry messages from the crew that are said to have helped end the mutiny.  After the mutiny Northesk resigned his commission. Order was restored in a matter of weeks, and Monmouth was placed under Commander James Walker, in an acting captaincy. Walker had been planning to attack the mutinous ships at anchor with a squadron of gunboats only a few weeks previously."]}, {"page": "HMS Wasp (1800)", "response": ["Now named HMS Wasp she was commissioned in July 1801 under Commander Charles Bullen, and sent to Sierra Leone at the end of the year. At Freetown, Bullen landed guns and sailors to reinforce soldiers and militias composed of free blacks resettled from Nova Scotia and Jamaica (the Maroons), who were engaged in a campaign against the local Temne people. After the Temne signed a peace treaty in December and the situation had settled down, in March 1802 Wasp sailed from Sierra Leone. She sailed to the West Indies where she was paid off in July."]}, {"page": "Sir Charles Bullen", "response": ["#REDIRECT Charles Bullen"]}, {"page": "Culture of Dorset", "response": ["The notable, 19th century, Royal Navy admirals, and brothers; Samuel and Alexander Hood, were born in Thorncombe.Hilliam (p133) Other notable mariners from Dorset include: Henry Digby, Charles Bullen and Thomas Masterman Hardy all of whom commanded ships at Trafalgar and played a major part in the victory.Cullingford (p86) The county became the birthplace of the trade union movement when, in 1843, the Tolpuddle Martyrs formed the Friendly Society of Agricultural Labourers, and swore an oath of loyalty to one another.Hilliam (p10) In 1686, Thomas Erle hosted a secret meeting in the ice house at Charborough Park. The discussion led directly to the Glorious Revolution of 1688.Hilliam (p146) The Soviet spy Anthony Blunt was born in Bournemouth in 1907. He was stripped of his knighthood in 1979 for treason. Dorset has produced two archbishops: John Morton and William Wake.Collins Pocket Guide to English Parish Churches; the South. London: Collins; (1968) p. 172"]}, {"page": "HMS Cambrian (1797)", "response": ["On 13 December British 350 sailors and 250 marines from Cambrian, the 74-gun third rates Kent and  again attacked Palamós. (The sloops  and  covered the landing.) The landing party destroyed six of eight merchant vessels with supplies for the French army at Barcelona, as well as their escorts, a national ketch of 14 guns and 60 men and two xebecs of three guns and thirty men each. The vessels were lying inside the mole under the protection of 250 French troops, a battery of two 24-pounders, and a 13\" mortar in a battery on a commanding height. Although the attack was successful, the withdrawal was not. The British lost 33 men killed, 89 wounded, and 86 taken prisoner, plus one seaman who took the opportunity to desert.James (1837), Vol. 5, pp.259-60. Cambrian alone lost one man killed, seven wounded, and four men missing, among them Fane, who had been taken prisoner. Captain Charles Bullen of Volontier then took command of Cambrian on 1 January 1811.Broadley & Bartelot (1906) p.255-6."]}, {"page": "List of Captain-class frigates", "response": ["|Charles Bullen"]}, {"page": "HMS Minorca (1805)", "response": ["In September Minorca was in company with Captain Charles Bullen and his frigate Volontaire as they reconnoitred the Spanish east coast towards the Medes Islands, which they had not yet visited."]}, {"page": "List of Knights Commander of the Royal Guelphic Order", "response": ["|Captain Charles Bullen"]}, {"page": "List of Royal Navy admirals (1707–current)", "response": ["| Sir Charles Bullen GCB"]}, {"page": "Bullen, Charles", "response": ["#redirectCharles Bullen"]}]}}