{"wiki_id": "http://www.wikidata.org/entity/Q507809", "itemLabel": "Andrew Sullivan", "itemDescription": "English-American journalist, writer, blogger", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Sullivan", "wikipedia_page": {"main": "Andrew Michael Sullivan (born 10 August 1963) is a British-American author, editor, and blogger. Sullivan is a political commentator, a former editor of The New Republic, and the author or editor of six books. He started a political blog, The Daily Dish, in 2000, and eventually moved his blog to platforms, including Time, The Atlantic, The Daily Beast, and finally an independent subscription-based format. He announced his retirement from blogging in 2015. From 2016 to 2020, Sullivan was a writer-at-large at New York. His newsletter The Weekly Dish was launched in July 2020.Sullivan has stated that his liberal conservatism is rooted in his Catholic background and in the ideas of the British political philosopher Michael Oakeshott. In 2003, he wrote he was no longer able to support the American conservative movement, as he was disaffected with the Republican Party's continued rightward shift towards social conservatism on social issues during the George W. Bush era.Born and raised in Britain, he has lived in the United States since 1984 and currently resides in Washington, D.C., and Provincetown, Massachusetts. He is openly gay and a practicing  Catholic.", "link_mentions": [{"page": "August 10", "response": ["*  1963   – Andrew Sullivan, English-American journalist and author"]}, {"page": "Abu Zubaydah", "response": ["The Bush administration relied on some of Zubaydah's claims in justifying the invasion of Iraq. U.S. officials stated that the allegations that Iraq and al-Qaeda were linked in the training of people on chemical weapons came from Zubaydah.Ron Hutcheson and James Kuhnhenn, \"Iraq deal with Congress nears, Bush says\", Milwaukee Journal Sentinel, September 26, 2002\"Bush Says He and Congress Will Band Together on Iraq; Capitol Hill Still Sour\", Knight Ridder/Tribune Business News, September 27, 2002 (Access My Library Link, requires free membership)Andrew Sullivan, \"One tortured lie: that's all it took for war\", The Sunday Times, April 26, 2009 The officials noted there was no independent verification of his claims."]}, {"page": "Political correctness", "response": ["Other examples include the television program Politically Incorrect, George Carlin's \"Euphemisms\" routine, and The Politically Correct Scrapbook. The popularity of the South Park cartoon program led to the creation of the term \"South Park Republican\" by Andrew Sullivan, and later the book South Park Conservatives by Brian C. Anderson. In its Season 19 (2015), South Park introduced the character PC Principal, who embodies the principle, to poke fun at the principle of political correctness.For South Park's usage see:"]}, {"page": "South Park", "response": ["While some conservatives have condemned South Park for its vulgarity, a growing population of people who hold center-right political beliefs, including teenagers and young adults, have embraced the show for its tendency to mock liberal viewpoints and lampoon liberal celebrities and icons. Political commentator Andrew Sullivan dubbed the group South Park Republicans, or South Park conservatives. Sullivan averred that members of the group are \"extremely skeptical of political correctness but also are socially liberal on many issues\", though he says the phrase applied to them is meant to be more of a casual indication of beliefs than a strong partisan label. Brian C. Anderson describes the group as \"generally characterized by holding strong libertarian beliefs and rejecting more conservative social policy\", and notes that although the show makes \"wicked fun of conservatives\", it is \"at the forefront of a conservative revolt against liberal media\" and Hollywood's \"liberal hegemony.\""]}, {"page": "Provincetown, Massachusetts", "response": ["* Andrew Sullivan (b.1963—) author, writer, blogger"]}, {"page": "The Economist", "response": ["In 1991, James Fallows argued in The Washington Post that The Economist used editorial lines that contradicted the news stories they purported to highlight. In 1999, Andrew Sullivan complained in The New Republic that it uses \"marketing genius\" to make up for deficiencies in original reporting, resulting in \"a kind of Reader's Digest\" for America's corporate elite. The Guardian wrote that \"its writers rarely see a political or economic problem that cannot be solved by the trusted three-card trick of privatisation, deregulation and liberalisation\"."]}, {"page": "Gay village", "response": ["Provincetown, Massachusetts, was ranked by the US Census Bureau as \"the gayest city in America\". Provincetown, or Ptown, was also voted \"Best Resort Town in 2011\" by Gaycities.com. The town had far more gay marriages than straight marriages performed since 2003 when Massachusetts legalized same-sex marriage. The town's various businesses sponsor Gay Men's Week, Women's Week, Bear Week, Family Week (for same-sex families), and their version of a gay pride parade, Carnival. Famous gay residents currently include journalist Andrew Sullivan, filmmaker John Waters, and comedian Kate Clinton."]}, {"page": "Queer", "response": ["Queer people, particularly queer people of color, began to reclaim queer in response to a perceived shift in the gay community toward liberal conservatism, catalyzed by Andrew Sullivan's 1989 piece in The New Republic, titled Here Comes the Groom: The Conservative Case for Gay Marriage. The queer movement rejected causes viewed as assimilationist, such as marriage, military inclusion and adoption. This radical stance and rejection of U.S. Imperialism continued the tradition of earlier Lesbian and Gay anti-war activism, and solidarity with a variety of leftist movements, such as seen in the positions taken at the first two National Marches on Washington in 1979 and 1987,  the radical direct action of groups like ACT UP, and the historical importance of events like the Stonewall riots. The radical Queer groups following in this tradition of LGBT activism contrasted firmly with, \"the holy trinity of marriage, military service and adoption [which had] become the central preoccupation of a gay movement centered more on obtaining straight privilege than challenging power.\" Commentators noted that it was exactly these \"revolting queers\" (who were now being pushed aside) who had made it safe for the assimilationists to now have the option of assimilation."]}, {"page": "Allan Bloom", "response": ["In an article on Bloom for The New Republic in 2000, conservative commentator Andrew Sullivan wrote that \"reading [Bloom] ... one feels he has not merely understood Nietzsche; he has imbibed him. But this awareness of the abyss moved Bloom, unlike Nietzsche, toward love and political conservatism. Love, whether for the truth or for another, because it can raise us out of the abyss. Political conservatism because it best restrains the chaos that modernity threatens\".Longing: Remembering Allan Bloom, The New Republic, April 17, 2000. More recently, Bloom's book also received a more positive re-assessment from Jim Sleeper in the New York Times.", "Of the work, Andrew Sullivan wrote \"you cannot read [Bloom] on Romeo and Juliet or Antony and Cleopatra without seeing those works in a new light. You cannot read his account of Rousseau's La nouvelle Heloise without wanting to go back and read it—more closely—again ... Bloom had a gift for reading reality—the impulse to put your loving face to it and press your hands against it\". Recollecting his friend in an interview, Bellow said \"Allan inhaled books and ideas the way the rest of us breathe air ... People only want the factual truth. Well, the truth is that Allan was a very superior person, great-souled. When critics proclaim the death of the novel, I sometimes think they are really saying that there are no significant people to write about. [But] Allan was certainly one.\""]}, {"page": "Piglet (Winnie-the-Pooh)", "response": ["In 1982, whilst studying at Oxford University as an undergraduate, the columnist and commentator Andrew Sullivan adopted the persona of Piglet in holding office in the University Pooh Sticks Club as cited in the 1987 book The Oxford Myth."]}, {"page": "Defense of Marriage Act", "response": ["The New York Times said the question was \"all but dormant\" until the late 1980s when, according to gay activists, \"the AIDS epidemic... brought questions of inheritance and death benefits to many people's minds.\" In May 1989, Denmark established registered partnerships that granted same-sex couples many of the rights associated with marriage. In the same year, New York's highest court ruled that two homosexual men qualified as a family for the purposes of New York City's rent-control regulations. Within the movement for gay and lesbian rights, a debate between advocates of sexual liberation and of social integration was taking shape, with Andrew Sullivan publishing an essay \"Here Comes the Groom\" in The New Republic in August 1989 arguing for same-sex marriage: \"A need to rebel has quietly ceded to a desire to belong.\"  In September 1989, the State Bar Association of California urged recognition of marriages between homosexuals even before gay rights advocates adopted the issue."]}, {"page": "American Enterprise Institute", "response": ["Supported by the Bradley Foundation, AEI has hosted since 1989 the Bradley Lecture Series, \"which aims to enrich debate in the Washington policy community through exploration of the philosophical and historical underpinnings of current controversies\". Notable speakers in the series have included Kristol, Novak, Allan Bloom, Robert Bork, David Brooks, Lynne Cheney, Ron Chernow, Tyler Cowen, Niall Ferguson, Francis Fukuyama, Eugene Genovese, Robert P. George, Gertrude Himmelfarb, Samuel P. Huntington (giving the first public presentation of his \"clash of civilizations\" theory in 1992), Paul Johnson, Leon Kass, Charles Krauthammer, Bernard Lewis, Seymour Martin Lipset, Harvey C. Mansfield, Michael Medved, Allan H. Meltzer, Edmund Morris, Charles Murray, Steven Pinker, Norman Podhoretz, Richard Posner, Jonathan Rauch, Andrew Sullivan, Cass Sunstein, Sam Tanenhaus, James Q. Wilson, John Yoo, and Fareed Zakaria."]}, {"page": "The Atlantic", "response": ["In 2006, Bradley hired James Bennet as editor-in-chief; he had been the Jerusalem bureau chief for The New York Times. He also hired writers, including Jeffrey Goldberg and Andrew Sullivan. Jay Lauf joined the organization as publisher and vice-president in 2008; as of 2017, he was publisher and president of Quartz."]}, {"page": "Rhodes Scholarship", "response": ["According to Schaeper and Schaeper,Schaeper, Thomas and Kathleen Schaeper. \"Rhodes Scholars: Oxford, and the Creation of an American Elite,\" 2010. Berghahn Books: New York, p. 280. \"From 1904 to the present, the programme's critics have had two main themes: first, that too many scholars were content with comfortable, safe jobs in academe, in law, and in business; second, that too few had careers in government or other fields where public service was the number-one goal.\" Andrew Sullivan wrote in 1988 that \"of the 1,900 or so living American scholars ... about 250 fill middle-rank administrative and professorial positions in middle-rank state colleges and universities ... [while] another 260...have ended up as lawyers.\"Schaeper, Thomas and Kathleen Schaeper. \"Rhodes Scholars: Oxford, and the Creation of an American Elite,\" 2010. Berghahn Books: New York, p. 282."]}, {"page": "David Brooks (commentator)", "response": ["His dismissal of the conviction of Scooter Libby as being \"a farce\" and having \"no significance\" was derided by political blogger Andrew Sullivan."]}, {"page": "Newsweek", "response": ["* Andrew Sullivan"]}, {"page": "Neoconservatism", "response": ["In February 2009, Andrew Sullivan wrote he no longer took neoconservatism seriously because its basic tenet was defense of Israel: "]}, {"page": "2000 United States presidential election recount in Florida", "response": ["Conservative writer Andrew Sullivan in a contemporaneous article:"]}, {"page": "The New Republic", "response": ["In 1991, Andrew Sullivan, a 28-year-old gay, self-described conservative from Britain, became editor. He took the magazine in a somewhat more conservative direction, but the majority of writers remained liberal or neoliberal. Hertzberg soon left the magazine to return to The New Yorker. Kinsley left the magazine in 1996 to found the online magazine Slate.", "The New Republic gradually became much less left-wing under Peretz, which culminated in the editorship of the conservative Andrew Sullivan. The magazine was associated with the Democratic Leadership Council (DLC) and \"New Democrats,\" such as Bill Clinton and Joseph Lieberman, who received the magazine's endorsement in the 2004 Democratic primary.", "# Andrew Sullivan (1991–1996)"]}, {"page": "Stephen Glass", "response": ["Also in 2003, Glass briefly returned to journalism, writing an article about Canadian marijuana laws for Rolling Stone. On November 7, 2003, Glass participated in a panel discussion on journalistic ethics at George Washington University, along with the editor who had hired him at The New Republic, Andrew Sullivan, who accused Glass of being a \"serial liar\" who was using \"contrition as a career move.\""]}, {"page": "Gary Johnson", "response": ["Commentator Andrew Sullivan quoted a claim that Johnson \"is highly regarded in the state for his outstanding leadership during two terms as governor. He slashed the size of state government during his term and left the state with a large budget surplus.\" In an interview in Reason in January 2001, Johnson's accomplishments in office were described as follows: \"no tax increases in six years, a major road building program, shifting Medicaid to managed care, constructing two new private prisons, canning 1,200 state employees, and vetoing a record number of bills.\" According to one New Mexico paper, \"Johnson left the state fiscally solid\" and was \"arguably the most popular governor of the decade... leaving the state with a $1 billion budget surplus.\" The Washington Times reported that when Johnson left office, \"the size of state government had been substantially reduced and New Mexico was enjoying a large budget surplus.\" In a 2016 National Review article, Johnson was criticized for claiming to have balanced New Mexico's budget every year. The Constitution of New Mexico requires that the state budget be balanced, with its debt in a separate \"capital outlay\" budget. The article stated that under Johnson New Mexico's debt increased from $1.8 billion to $4.6 billion and its budget increased from $4.397 billion to $7.721 billion."]}, {"page": "Robert Novak", "response": ["The New York Post's widely read Page Six gossip column claimed that he was converted to Christianity by Father C. John McCloskey, a leader of Opus Dei, \"the secretive sect which drew so much attention with The Da Vinci Code.\"Johnson, Richard, et al. \"Robert Novak's 'Da Vinci Code' Link.\"  New York Post. Published August 24, 2009. Accessed August 24, 2009. Actually, McCloskey was one of the two priests—the other was Vaghi—from whom Novak received instruction in the Catholic faith. Andrew Sullivan claimed that Novak was a member of Opus Dei. John L. Allen Jr., however, in his authoritative study, Opus Dei, wrote that Novak was not a member.John L. Allen, Jr. \"Q & A on Opus Dei\", National Catholic Reporter, December 16, 2005. Accessed May 8, 2010. Novak felt that his new faith did not influence his personal behavior or his political views, saying, \"I'm a Christian now, but I still have some bad traits.\""]}, {"page": "Dick Durbin", "response": ["Former The New Republic editor Andrew Sullivan praised Durbin for raising serious moral issues about U.S. policy. Other commentators, including commentator Markos Moulitsas Zúniga of Daily Kos, condemned Durbin for apologizing to his critics, arguing he made a mistake in making himself, rather than detention and torture concerns at Guantanamo Bay, the focus of media coverage."]}, {"page": "Human Rights Campaign", "response": ["Critics of the HRC have accused the organization of favoring the Democratic Party. Andrew Sullivan, a gay political columnist and blogger, has been critical of the HRC, calling it \"a patronage wing of the Democratic party.\" It has received backlash and criticism for several nominations of Republicans, when their Democratic opponents scored higher on HRC's own index."]}, {"page": "Murder of Jesse Dirkhising", "response": ["Commentator Andrew Sullivan wrote an article in The New Republic accusing the liberal media of political correctness and using Dirkhising's death to attack the Human Rights Campaign for its support of hate-crime legislation.Limbaugh 2003 The Human Rights Campaign (HRC), however, complained that The Washington Times \"omitted a key piece of information\" for its front-page story on Dirkhising: The HRC had provided a statement strongly condemning the crime and called for the perpetrators to be punished \"to the fullest extent of the law.\"Smith Sullivan also criticized some aspects of the conservative coverage of the Dirkhising case equating gay sex with child molestation as \"ugly nonsense\". Sullivan squarely summed up the differences in media coverage as being due to political interests. Sullivan stated that whereas the Shepherd case was used to support including LGBT people in federal hate-crime law the Dirkhising case was ignored for concerns of inciting anti-gay prejudice. In November 1999, E. R. Shipp, ombudsman at The Washington Post, noted that \"readers, prodded by commentators who are hostile to LGBT people and to what they view as a 'liberal' press\" had raised questions about the Dirkhising case. Shipp said, however, that she \"made a clear distinction\" between the Dirkhising and Shepard cases: \"Matthew Shepard's death sparked public expressions of outrage that themselves became news. . . . That Jesse Dirkhising's death has not done so is hardly the fault of The Washington Post.\" Shipp also noted that the Shepherd story was newsworthy because of the debate it fostered on hate crimes and the level of intolerance towards LGBT people in the United States."]}, {"page": "Harvard Kennedy School", "response": ["* Andrew Sullivan (MPA, PhD '90) – journalist, The Atlantic Monthly"]}, {"page": "Frank (magazine)", "response": ["In May 2013, Bate announced an intention to revive Frank as an online publication in September or October 2013.\"Political satire magazine Frank to return\". CBC News, May 27, 2013. Frank relaunched as a digital publication on October 1 with a metered paywall, in a blog format described as similar to Andrew Sullivan’s The Dish, with a subscription price between $10–15 per month.\"Frank magazine will be back from the grave in October\". canada.com, May 24, 2013."]}, {"page": "Michael Oakeshott", "response": ["* Andrew Sullivan, Intimations Pursued: The Voice of Practice in the Conversation of Michael Oakeshott (Imprint Academic, 2007)"]}, {"page": "Nicholas Kristof", "response": ["Kristof was criticized at the time for reporting that Iraqis opposed an American invasion; Andrew Sullivan was among Kristof's critics and in 2018, on the 15th anniversary of the war, he apologized to Kristof in a tweet."]}, {"page": "Gay bar", "response": ["A few commentators have suggested that gay bars are facing decline in the contemporary age due to the pervasiveness of technology. Andrew Sullivan argued in his essay \"The End of Gay Culture\" that gay bars are declining because \"the Internet dealt them a body blow. If you are merely looking for sex or a date, the Web is now the first stop for most gay men\"."]}, {"page": "Lesbian Avengers", "response": ["Sometimes their positions seem to change, as well.  In the early years, the group opposed attempts to legitimize gay marriage, protesting the notion at an Andrew Sullivan book signing in 1995.Cross-Hairs The Atlantic, January 11, 2011"]}, {"page": "The Stranger (newspaper)", "response": ["Writers closely associated with the newspaper include Sherman Alexie, Charles D'Ambrosio, Sarah Vowell, Dave Eggers, Jonathan Raban, Heather McHugh, Rebecca Brown, Edmund White, Gary Shteyngart, Miranda July, Tao Lin, Travis Jeppesen, Andrew Sullivan, Stacey Levine, Mistress Matisse, and JT LeRoy."]}, {"page": "Larry Kramer", "response": ["In 2000, Reynolds Price wrote that the novel's lasting relevance is that \"anyone who searches out present-day responses on the Internet will quickly find that the wounds inflicted by Faggots are burning still\". Although the novel was rejected by the people from whom Kramer expected praise, the book has never been out of publication and is often taught in gay studies classes. \"Faggots struck a chord,\" wrote Andrew Sullivan, \"It exuded a sense that gay men could do better if they understood themselves as fully human, if they could shed their self-loathing and self-deception....\""]}, {"page": "Warblog", "response": ["Warblogging was popularized by Glenn Reynolds, whose Instapundit was one of the most popular political blogs on the web.  Some prominent warblogs, such as Little Green Footballs by Charles Johnson and Daily Dish by Andrew Sullivan existed before September 11, but made the war on terror their primary focus afterwards. Other notable warblogs included Dynamist by Virginia Postrel, KausFiles by Mickey Kaus, Talking Points Memo by Josh Marshall, KenLayne.com by Ken Layne, and Lileks.com by James Lileks."]}, {"page": "Anderson Cooper", "response": ["Cooper is openly gay; according to The New York Times, he is \"the most prominent openly gay journalist on American television\". For years, Cooper avoided discussing his private life in interviews. On July 2, 2012, however, he gave Andrew Sullivan permission to publish an email that stated, in part:"]}, {"page": "The Advocate (LGBT magazine)", "response": ["* Andrew Sullivan"]}]}}