{"wiki_id": "http://www.wikidata.org/entity/Q5077240", "itemLabel": "Charles Edmond Knox", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Edmond_Knox", "wikipedia_page": {"main": "Lieutenant General Sir Charles Edmond Knox, KCB (28 February 1846 – 1 November 1938) was an Anglo-Irish soldier of the British Army.", "link_mentions": [{"page": "List of Old Etonians born in the 19th century", "response": ["* Sir Charles Edmond Knox (1846–1938), Lieutenant-General"]}, {"page": "King's Shropshire Light Infantry", "response": ["* Lieutenant-General Sir Charles Edmond Knox KCB (6 January 1907)"]}, {"page": "8th King's Royal Irish Hussars", "response": ["In October 1899, war broke out between the United Kingdom and the Boer republics in South Africa. The regiment sailed to South Africa on the SS Norseman in February 1900, arriving in Cape Town early the next month. Along with the 7th Dragoon Guards and the 14th Hussars they formed the 4th Cavalry Brigade under Brigadier General Dickson. On 1 May 1900, the Boers made a stand in a strong position at Houtnek, where the forces of Ian Hamilton faced stiff competition. In a telegram of 2 May Lord Roberts said: \"Hamilton speaks in high terms of the services of the 8th Hussars under Colonel Clowes and a made-up regiment of Lancers, which came into Broadwood's brigade and assisted in making the Boers evacuate their position\". The 8th then marched from Machadodorp to Heidelberg with the 14th Hussars and M Battery, under the command of Colonel Mahon. On 13 October, Mahon \"became heavily engaged near Geluk with a body of 1100 men with four guns.\" Mahon succeeded in holding his position until the French came to his assistance when the Boers were driven back in a south-easterly direction, having sustained some losses. The 8th lost 2 officers, Lieutenants P A T Jones and F H Wylam and 7 men, with 2 officers and 8 men wounded. Eight officers and 8 non-commissioned officers were mentioned in Lord Roberts' final despatches of 2 April and 4 September 1901. In the first three months of 1901, the 8th was in the column of Colonel Charles Edmond Knox, at one point sweeping to the Swazi border."]}, {"page": "Robert Knox (bishop)", "response": ["On 5 October 1842, Knox married Catherine Delia FitzGibbon, daughter of Thomas Gibbon FitzGibbon of Ballyseeda, County Limerick. They had three sons, including Charles Edmond Knox, who became a lieutenant-general of the British Army, and also two daughters."]}, {"page": "Sir Charles Edmond Knox", "response": ["#REDIRECT Charles Edmond Knox"]}, {"page": "Lieutenant General Sir Charles Edmond Knox KCB", "response": ["#REDIRECT Charles Edmond Knox"]}, {"page": "Charles Knox (disambiguation)", "response": ["* Charles Edmond Knox (1846–1938), Anglo-Irish soldier of the British Army"]}, {"page": "General Knox (disambiguation)", "response": ["*Charles Edmond Knox (1846–1938), British Army lieutenant general"]}]}}