{"wiki_id": "http://www.wikidata.org/entity/Q5077226", "itemLabel": "Charles Ede", "itemDescription": "British publisher", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Ede", "wikipedia_page": {"main": "Charles Richard Montague Ede (22 October 1921 – 29 May 2002) was the founder of The Folio Society.\nDuring World War II, Ede was commissioned into the Royal Tank Regiment and saw service at the Siege of Malta, Palestine, Egypt, and Italy, before transferring to the Intelligence Corps.\nAfter the War, instead of going up to Oxford University as originally intended, he registered with the London School of Printing and after completing his course founded The Folio Society in 1947.\nIn 1971 Ede sold his share in The Folio Society and set up as an ancient art dealer. The eponymous dealership, Charles Ede Ltd. continues to offer the highest level of scholarship and material at their Mayfair gallery in the heart of London, and at eminent international art fairs such as TEFAF Maastricht and TEFAF New York.", "link_mentions": [{"page": "Imperial Service College", "response": ["**Charles Ede: founder of the Folio Society"]}, {"page": "1921 in the United Kingdom", "response": ["** Charles Ede, publisher (died 2002)"]}, {"page": "Folio Society", "response": ["The Folio Society is a privately owned London-based publisher, founded by Charles Ede in 1947 and incorporated in 1971.The Folio Society: About Us.. The Folio Society, 2011. Retrieved 19 December 2011. It produces illustrated hardback editions of classic fiction and non-fiction books, poetry and children's titles. Folio editions feature specially designed bindings and include artist-commissioned illustrations (most often in fiction titles) or researched artworks and photographs (in non-fiction titles). Most editions come with their own slipcase.", "The Folio Society was founded in 1947 by Charles Ede, Christopher Sandford (of Golden Cockerel Press), and Alan Bott (founder of Pan Books). The firm's goal was to produce \"editions of the world's great literature, in a format worthy of the contents, at a price within the reach of everyman.\"Charles Ede Obituary in The Telegraph, 6 June 2002. Retrieved 21 December 2011. Archived here. Folio and the Golden Cockerel Press shared premises in Poland Street until 1955. Subsequent offices were located in the Mayfair and Borough areas of London. The Folio Society moved to its location in 44 Eagle Street, Holborn, in 1994 – in 2017, their offices moved to 4 Maguire Street, London."]}, {"page": "New Beacon School", "response": ["*Charles Ede, founder of the Folio Society"]}, {"page": "Ede", "response": ["* Charles Ede (1921–2002), British publisher, founder of the Folio Society"]}, {"page": "Fine press", "response": ["* Folio Society - Founded by Charles Ede in 1947"]}, {"page": "Barber Cup and Crawford Cup", "response": ["The one-handled cup was acquired by the Belgian collector Baron Adolphe Stoclet in Paris during the 1920s. In 2004, The Art Fund and other donors acquired this cup for British Museum via the antiquities dealer Charles Ede for , and named it the Barber Cup after the former chairman of the British Museum Friends, Nicholas Barber. The Barber Cup has a low-relief design of a vine and grapes, and may have been intended as a trulla, or dipper. It measures 15 cm high (13.5 cm without the handle) by 9.5 cm wide (at the rim). The foot is 6.4 cm in diameter."]}, {"page": "Deaths in May 2002", "response": ["*Charles Ede, 80, English founder of the Folio Society, publisher of quality editions of classic literature affordable to \"everyman\"."]}, {"page": "Ede, Charles", "response": ["#redirectCharles Ede"]}]}}