{"wiki_id": "http://www.wikidata.org/entity/Q5079163", "itemLabel": "Charles Howard, 17th Earl of Suffolk", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Howard,_17th_Earl_of_Suffolk", "wikipedia_page": {"main": "Charles John Howard, 17th Earl of Suffolk, 10th Earl of Berkshire (7 November 1805 – 14 August 1876), styled Viscount Andover between 1820 and 1851, was a British peer and Whig politician.", "link_mentions": [{"page": "Redvers Buller", "response": ["In 1882 at the age of 43 he married Lady Audrey Jane Charlotte Townshend (d. 1926), widow of Greville Howard (son of Charles Howard, 17th Earl of Suffolk) by whom she had issue, and daughter of John Townshend, 4th Marquess Townshend by his wife Elizabeth Jane Crichton-Stuart, daughter of Lord George Stuart, younger son of John Crichton-Stuart, 1st Marquess of Bute. By his wife he had issue an only child and daughter:"]}, {"page": "John Townshend, 4th Marquess Townshend", "response": ["*Lady Audrey Jane Charlotte Townshend (d. 1926), married firstly, Greville Howard, son of Charles Howard, 17th Earl of Suffolk and had issue. She married secondly, General Redvers Henry Buller."]}, {"page": "Charles Howard", "response": ["*Charles Howard, 17th Earl of Suffolk (1805–1876), British MP for Malmesbury"]}, {"page": "Greville Howard, Baron Howard of Rising", "response": ["A member of the influential Howard family, Howard is the son of Lieutenant-Colonel Henry Redvers Greville Howard (1911–1978), the son of Sir Charles Alfred Howard, the second son of the Hon. Greville Howard, who was the second son of Charles Howard, 17th Earl of Suffolk.Patrick W. Montague-Smith (ed.), Debrett's Peerage and Baronetage (Debrett's Peerage Ltd, 2000), p. 1600. His mother is Patience, daughter of Lieutenant-Colonel Charles Rice Iltyd Nicholl, TD (1880–1950), a solicitor, army officer and mason.\"Photograph Albums of Charles Nicholl, 1900–1903\", Magdalen College, Oxford. Retrieved 27 July 2021."]}, {"page": "Thomas Howard, 16th Earl of Suffolk", "response": ["*Charles Howard, 17th Earl of Suffolk (07 Nov 1804–14 Aug 1876)"]}, {"page": "Charles John Howard, 17th Earl of Suffolk", "response": ["#REDIRECT Charles Howard, 17th Earl of Suffolk"]}, {"page": "Henry Howard, 18th Earl of Suffolk", "response": ["Suffolk was the eldest son of Charles Howard, 17th Earl of Suffolk, and Isabella Catherine, daughter of Lord Henry Thomas Howard-Molyneux-Howard."]}, {"page": "Henry Howard, 19th Earl of Suffolk", "response": ["His paternal grandparents were Charles Howard, 17th Earl of Suffolk and his wife, Isabella Howard (daughter of Lord Henry Howard, and niece of Bernard Howard, 12th Duke of Norfolk). His maternal grandparents were Capt. Hon. Henry Amelius Coventry (son of George Coventry, 8th Earl of Coventry and Lady Mary Beauclerk, the only daughter of Aubrey Beauclerk, 6th Duke of St Albans) and the former Caroline Stirling Dundas (second daughter of James Dundas, 28th of Dundas Castle and Hon. Mary Tufton Duncan, a daughter of Adam Duncan, 1st Viscount Duncan)."]}, {"page": "Lord Henry Howard-Molyneux-Howard", "response": ["*Isabella Catherine Mary Howard (29 September 1806 – 20 June 1891), wife of Charles Howard, 17th Earl of Suffolk and had issue."]}, {"page": "Henry Howard (1802–1875)", "response": ["Howard was born on 25 July 1802. He was the eldest son of Lord Henry Howard-Molyneux-Howard and Elizabeth Long. His sisters included Henrietta Molyneux-Howard (wife of Henry Herbert, 3rd Earl of Carnarvon), Isabella Howard (wife of Charles Howard, 17th Earl of Suffolk), Charlotte Howard (wife of James Wentworth Buller), and Juliana Howard (wife of Sir John Ogilvy, 9th Baronet)."]}, {"page": "Landguard Manor", "response": ["The later manor-house was erected by Colonel Francis Henry Atherley (1831–1897) on the site of the older one. His wife, Lady Isabella Julia Elizabeth Howard (c. 1843–1910), was the daughter of Charles Howard, 17th Earl of Suffolk. Their son, Arthur Harry Howard Atherley was born at the manor house in 1865. Landguard Manor was the constant host to Riflemen of the 60th Rifles and Rifle Brigade."]}, {"page": "Robert Mowbray Howard", "response": ["His maternal grandparents were Henry Lawes Long and Catharine Long of Hampton Lodge. His paternal grandparents were Lord Henry Howard-Molyneux-Howard and Elizabeth Long (a daughter of Edward Long, the British colonial administrator). Among his extended family were aunts Henrietta Molyneux-Howard (wife of Henry Herbert, 3rd Earl of Carnarvon), Isabella Howard (wife of Charles Howard, 17th Earl of Suffolk), Charlotte Howard (wife of James Wentworth Buller), and Juliana Howard (wife of Sir John Ogilvy, 9th Baronet). Howard's great-uncle, Bernard Howard inherited the Dukedom of Norfolk in 1815 and his grandfather was granted the courtesy title \"Lord\", the style of a younger son of a duke, in 1817."]}, {"page": "Charles Howard (Serjeant-at-Arms)", "response": ["Born on 29 July 1878, Howard was a member of the prominent Howard family. He was the son of the Hon. Greville Theophilus Howard (1836–1880; a younger son of Charles Howard, 17th Earl of Suffolk) and Lady Audrey Jane Charlotte (died 1926), daughter of John Townshend, 4th Marquess Townshend. Howard's sister Joyce was married to Sir Arthur Doyle, 4th Baronet.Burke's Peerage (2003), vol. 3, pp. 3816, 3926. His half-sister from his mother's second marriage to General Sir Redvers Henry Buller was Dame Georgiana Buller, DBE, RRC.\"Buller, Dame (Audrey Charlotte) Georgiana\". Who Was Who (online ed., Oxford University Press, 2021). Retrieved 24 July 2021."]}]}}