{"wiki_id": "http://www.wikidata.org/entity/Q5077837", "itemLabel": "Charles Frederick Carter", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Frederick_Carter", "wikipedia_page": {"main": "Sir Charles Frederick Carter  (15 August 1919 – 27 June 2002) was an English academic known primarily for his role as the founding Vice-Chancellor of Lancaster University.\nCarter was born in Rugby to a father who was an electrical engineer and the developer of the Carter coefficient, and a mother who was an active member of the Society of Friends. He was educated at Rugby School and St John's College, Cambridge, where he read Mathematics and Economics and attained a First.\nIn World War II Carter refused to fight, being a conscientious objector, and because he refused to accept any conditions for his exemption he spent three months in Strangeways Prison, Manchester. When released, he joined the Friends' Relief Service, where he met Janet Shea, whom he married in 1944.\nIn 1945, he returned to Cambridge, where he became a lecturer in statistics and, from 1947, a fellow of Emmanuel College, Cambridge. He remained at Cambridge until 1952, when he took the Chair of Applied Economics at Queen's University, Belfast. Whilst in Northern Ireland he became a student of The Troubles, and concluded that a Protestant monopoly on power was unacceptable and could not be sustained. He also chaired the Northern Ireland Economic Development Council. In 1959 he moved to the Stanley Jevons chair in Manchester, remaining there for four years.\nAs an economist, he was a follower of G.L.S. Shackle, and was concerned about the impact of expectations in human decisions.\nIn 1963, he became the founding Vice-Chancellor of the new University of Lancaster. He managed to admit the first 264 students in 1964, a year ahead of schedule, by utilising disused buildings as temporary accommodation and teaching facilities. Carter's vision was for Lancaster to be a university for the whole North West, commenting that the people of Lancashire thought of it as their university. He refused \"discrimination on the grounds of race, colour, politics or any other thing\" and established links with various Higher Education Colleges, thus pre-empting the drive for widening participation forty years later.\nHis tenure at the University of Lancaster ended in 1979, the same year he was knighted. He retired to Seascale, Cumbria, and continued to work on projects he deemed to be worthwhile.", "link_mentions": [{"page": "British Science Association", "response": ["* 1981–82: Prof Sir Charles Frederick Carter, economist"]}, {"page": "Charles Carter", "response": ["*Charles Frederick Carter (1919–2002), English economist and university administrator"]}, {"page": "G. L. S. Shackle", "response": ["* Arrow, Kenneth J., and Hurwicz, L. et al. (1972) in Charles Frederick Carter and J.L. Ford (eds.), Uncertainty and Expectations in Economics. Essays in Honour of G.L.S. Shackle. Oxford: Basil Blackwell, New York: Augustus M. Kelley."]}, {"page": "Swarthmore Lecture", "response": ["|Charles Frederick Carter"]}, {"page": "Charles F. Carter", "response": ["#REDIRECT Charles Frederick Carter "]}, {"page": "1978 New Year Honours", "response": ["* Charles Frederick Carter, . Vice-Chancellor, University of Lancaster."]}, {"page": "Fred Carter (disambiguation)", "response": ["*Charles Frederick Carter (1919–2002), British academic and Vice-Chancellor of Lancaster University"]}, {"page": "C. F. Carter", "response": ["#REDIRECT Charles Frederick Carter"]}, {"page": "Gabriel Epstein", "response": ["walkway known as \"The Spine\",McClintock, Marion. University of Lancaster: Quest for Innovation (University of Lancaster) which ran from north to south and was covered for most of its length.Lancaster University: Origins and growth http://www.lancaster.ac.uk/unihistory/growth/ Retrieved 9 March 2014 The campus design was described by Sir Charles Frederick Carter, the founding vice-chairman, as \"one of the major achievements of British architecture\",Laubinger, Hans-Dieter; Epstein, Gabriel ; Architekt Hochschullehrer Deutschland Grossbritannien, Hommage à Gabriel Epstein (Institut für Oeffentliche Bauten und Hochschulplanung, Stuttgart, 1987), p 16. OCLC number: 636878915 which \"set new standards and precepts for all University and Urban Plans\".Hommage à Gabriel Epstein, op. cit., p 16."]}, {"page": "Marcus Brumwell", "response": ["Brumwell established in the early 1950s through informal dinner parties a \"group of VIP scientists\", where his friends in science like Waddington, Blackett, and Bernal met together with elites in other fields like academics like Charles Frederick Carter and C. P. Snow, and Harold Wilson and Richard Crossman in politics. Brumwell's cause notably escalated in the late 1950s, where these discussions led to a short document, A Labour Government and Science, published in 1959, which driven by Wilson became the Labour Party's basic policy science in the run up to the general election in 1964, most famously in the \"white heat of technology\" speech in September 1963."]}]}}