{"wiki_id": "http://www.wikidata.org/entity/Q5079111", "itemLabel": "Charles Hooman", "itemDescription": "cricketer (1887-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Hooman", "wikipedia_page": {"main": "Charles Victor Lisle Hooman (3 October 1887 – 20 November 1969), often known as Chubby Holman, was an English amateur sportsman who played cricket for Oxford University and Kent County Cricket Club between 1907 and 1910. He won Blues for golf, rackets and cricket and later represented the Great Britain and Ireland golf team in the Walker Cup in 1922 and 1923. He served in the Royal Naval Reserve during World War I and the RAF Volunteer Reserve during World War II.", "link_mentions": [{"page": "Hooman", "response": ["* Charles Hooman (1887-1969), English amateur sportsman"]}, {"page": "List of Old Carthusians", "response": ["*Charles Hooman (1887–1969), English cricketer who played 38 first-class matches"]}, {"page": "Ditton, Kent", "response": ["Charles Hooman, often known as Chubby Holman, was born in Ditton in 1887. He was an English amateur sportsman who played cricket for Oxford University and Kent County Cricket Club between 1907 and 1910.Charles Hooman, CricInfo. Retrieved 2017-03-10. He won Blues for golf, rackets and cricket and later represented the Great Britain and Ireland golf team in the Walker Cup in 1922 and 1923. He served in the Royal Naval Reserve during World War I and the RAF Volunteer Reserve during World War II."]}, {"page": "List of male golfers", "response": ["| Charles Hooman||1887–1969"]}, {"page": "Thomas Hooman", "response": ["Thomas Charles Hooman (28 December 1850 – 22 September 1938) was a leading English association football player of the Victorian era. He played for Wanderers in the 1872 FA Cup Final and was also chosen to represent England on several occasions."]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Charles Hooman (1910)"]}, {"page": "Kent County Cricket Club in 1910", "response": ["Former captain Cloudesley Marsham made his last first-class appearance for Kent before the First World War against Cambridge University and did not play in a Championship match during the season. Keith Barlow played against both Cambridge and Oxford University, the only first-class appearances of his career. Other than Barlow, four players made their senior debuts for Kent during 1910: Eric Hatfeild, Charles Hooman, Freddie Knott and Percy Morfee. Hooman appeared 15 times for the county during the season, his only season of first-class cricket with Kent."]}, {"page": "List of Marylebone Cricket Club players (1895–1914)", "response": ["* Charles Hooman (1910) : C. V. L. Hooman (Kent)"]}, {"page": "England–Scotland Amateur Match", "response": ["* Charles Hooman 1910", "* Charles Hooman 1922"]}, {"page": "Hooman, Charles", "response": ["#redirectCharles Hooman"]}, {"page": "Wilfrid Reay", "response": ["The son of J. H. Reay, a civil servant, he was born at Wallington in June 1891. He worked in the London Stock Exchange as an authorised clerk, and was married to Dorothy Katherine Livermore. He made a single appearance in first-class cricket for the Gentlemen of England against Oxford University at Eastbourne in June 1910. Batting once in the match, he scored 5 not out in the Gentlemen of England first-innings, while with the ball he took a single wicket in the Oxford first-innings when he dismissed Charles Hooman, finishing with figures of 1 for 51 from eleven overs. He served in the First World War with the Royal Fusiliers as part of The Stockbrokers' Battalion, enlisting in August 1914 as a lance corporal. He landed in Boulogne in on 30 July 1915, with his battalion sent to Tilques. He was killed in action nearby on 8 October 1915. His body was never recovered and he is commemorated at the Thiepval Memorial. His brother, Gilly, was also a first-class cricketer."]}, {"page": "Chubby Hooman", "response": ["#REDIRECT Charles Hooman"]}]}}