{"wiki_id": "http://www.wikidata.org/entity/Q5072635", "itemLabel": "Chantel Woodhead", "itemDescription": "English footballer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chantel_Woodhead", "wikipedia_page": {"main": "Chantel Marie \"Channy\" Woodhead (born 17 September 1974 in Leeds, England) is a former English international football player. She played as a left back for clubs including Doncaster Belles and Everton Ladies. Woodhead won a single cap for the senior England team.", "link_mentions": [{"page": "Channy", "response": ["*Chantel Woodhead (born 1974), English female footballer"]}, {"page": "Bronte L.F.C.", "response": ["When the Women's Football Association formed a National League in 1991–92, North West Women's Regional Football League Bronte were admitted to the new Northern Division. The club narrowly beat Sheffield Wednesday to the title and took their place in an enlarged 10-team National Division for 1992–93. However Bronte's stalwart defender and captain Clare Taylor left for Knowsley United in the close season and without her the team performed poorly in the top division. A violent altercation on the team bus saw Chantel Woodhead being throttled and Samantha Britton punching the assailant. The club were relegated and in the subsequent player exodus Woodhead signed for Doncaster Belles, Britton and Rebecca Lonergan signed for Arsenal and Issy Pollard joined Millwall Lionesses."]}, {"page": "1994 FA Women's Cup Final", "response": ["|DF |||| Chantel Woodhead"]}, {"page": "Chantel", "response": ["*Chantel Woodhead (born 1974), former English international football player"]}, {"page": "Issy Pollard", "response": ["Bronte's stalwart defender Clare Taylor left for Knowsley United in the close season and without her the team performed poorly in the top division. A violent altercation on the Bronte team bus saw Chantel Woodhead being throttled and Samantha Britton punching the assailant. The club were relegated and Pollard signed for Millwall Lionesses in the subsequent player exodus.", "After brief spells in Sweden with Betsele IF and back at Bronte, Pollard was signed by Doncaster Belles in 1995. The transfer was agreed by outgoing manager Paul Edmunds prior to his departure, after Pollard attended a Doncaster Belles match as a guest of her former Bronte team-mate Chantel Woodhead. Pollard was the captain of the Leeds United team who reached the Women's FA Cup semi-final in 2000 and won promotion to the FA Women's Premier League National Division for the first time in 2001."]}]}}