{"wiki_id": "http://www.wikidata.org/entity/Q5075532", "itemLabel": "Charles Benham", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Benham", "wikipedia_page": {"main": "Charles Edwin Benham JP (; 15 April 1860 in Colchester, Essex, England – 1 April 1929, also in Colchester) was a journalist who edited for many years the Essex County Standard, a published author of works such as Essex Ballads, and an amateur scientist-cum-inventor, which led him to create Benham's top, which was named after him.", "link_mentions": [{"page": "Gustav Fechner", "response": ["In 1838, he also studied the still-mysterious perceptual illusion of what is still called the Fechner color effect, whereby colors are seen in a moving pattern of black and white. The English journalist and amateur scientist Charles Benham, in 1894, enabled English-speakers to learn of the effect through the invention of the spinning top that bears his name, Benham's top. Whether Fechner and Benham ever actually met face to face for any reason is not known."]}, {"page": "Fechner color", "response": ["The effect was noted by Gustav Fechner and Hermann von Helmholtz and propagated to English-speakers through Charles Benham's invention of his top.  Florence Winger Bagley was one of the early investigators of this phenomenon. ", "Benham's top is named after the English newspaper-man, amateur scientist, and toymaker Charles Benham, who in 1895 sold a top painted with the pattern shown. Benham was inspired to propagate the Fechner color effect through his top after his correspondence with Gustav Theodor Fechner, who had observed and demonstrated the said effect. Benham's top made it possible for speakers of the English language to learn of the Fechner color effect, about which Fechner's original reports were written in German."]}, {"page": "Charles E. Benham", "response": ["#REDIRECT Charles Benham"]}, {"page": "Benham (surname)", "response": ["* Charles Benham (1860-1929) Author, newspaper editor and amateur scientist"]}, {"page": "Benham, Charles", "response": ["#redirectCharles Benham"]}]}}