{"wiki_id": "http://www.wikidata.org/entity/Q5079478", "itemLabel": "Charles Jasper Selwyn", "itemDescription": "English lawyer, judge and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Jasper_Selwyn", "wikipedia_page": {"main": "Sir Charles Jasper Selwyn PC (13 October 1813 – 11 August 1869) was an English lawyer, politician and Lord Justice of Appeal.", "link_mentions": [{"page": "A. P. Herbert", "response": ["Herbert was born at Ashtead Lodge, Ashtead, Surrey, on 24 September 1890. His father, Patrick Herbert Coghlan Herbert (1849–1915), was a civil servant (assistant secretary of the Judicial and Public Department)The India List and India Office List, p. 519.A. P. Herbert: A Biography, Reginald Pound, 1976, p. 17. in the India Office, of Irish origin, and his mother, Beatrice Eugenie (née Selwyn), was the daughter of Sir Charles Jasper Selwyn, a Lord Justice of Appeal.Pound, pp. 16–17. His two younger brothers both died in battle: Owen William Eugene, Second lieutenant, Royal Field Artillery, killed at Mons in 1914, and Sidney Jasper, Captain R.N., killed 1941 aboard HMS Hood. His mother died of tuberculosis when he was eight, shortly before he left for The Grange in Folkestone, a preparatory school.Pound, pp. 21–22."]}, {"page": "Solicitor General for England and Wales", "response": ["*Sir Charles Jasper Selwyn 1867–1868"]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Sir Charles Jasper Selwyn (1813–1869)"]}, {"page": "Cambridge University (UK Parliament constituency)", "response": ["| Charles Jasper Selwyn || Conservative"]}, {"page": "George Selwyn (bishop of Lichfield)", "response": ["Selwyn was brother of Charles Jasper Selwyn, and of William Selwyn (1806–1875)."]}, {"page": "John Goldsborough Ravenshaw II", "response": ["Some sources claim that Ravenshaw was educated at his father's college, Trinity College, Cambridge, but there is no documentary evidence of this.Ravenshaw, John Goldsborough , in Alumni Cantabrigienses, ed. John Venn & J. A. Venn, Cambridge University Press In 1801 he married Hannah Bond, a daughter of Commodore Charles John Bond, of the British East India Company's Bombay Marine. They had 12 children, including John Hurdis (father of Major General Hurdis Ravenshaw) and Hester (wife of Sir Charles Jasper Selwyn). The family lived on Harley Street in London, England. Ravenshaw became first one of the directors of the British East India Company in 1819, Deputy Chairman from 1829 to 1831, and chairman in 1832. He remained as director until his death in 1840."]}, {"page": "Francis Hughes-Hallett", "response": ["In 1871, Hughes-Hallett married Catherine Rosalie Greene, the widow of Sir Charles Jasper Selwyn and of Reverend Harry Dupuis. They had three children: Frank Victor (1872-1937, married Hilda Marion Cook and Katherine Gameson Swinnerton), Egerton (1873-1890), and Sybil Rosalie (1875-1958, married Graham Brown). Catherine Hughes-Hallett, who died in childbirth in 1875, also brought to the marriage four children from her previous marriage, a son, Harry Jasper Selwyn (1870-1919), a stepson, Charles William Selwyn (1858-1893, married Isabella Constance Dalgety), and two stepdaughters, Edith Adriana Selwyn (1859-1910, married Edward Grant Fraser-Tytler) and Beatrice Eugénie Selwyn (1865-1898, married Patrick Herbert)."]}, {"page": "Charles William Selwyn", "response": ["He was the eldest son of the Rt Hon. Sir Charles Jasper Selwyn, Lord Justice of Appeal, and his first wife, Hester née Ravenshaw. He was educated at Eton and Trinity College, Cambridge, before being commissioned in the Royal Horse Guards in 1878.  He served with distinction with the regiment in the Anglo-Egyptian War of 1882. He made his home at Selwyn Court, Richmond, Surrey. In 1884 he married Isabella Constance Dalgety of Lockerley Hall, Romsey, Hampshire, the second daughter of Frederick Dalgety. He was promoted captain in 1885."]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Charles Jasper Selwyn", "|Charles Jasper Selwyn", "|Charles Jasper Selwyn"]}, {"page": "Sir Charles Jasper Selwyn", "response": ["#REDIRECT Charles Jasper Selwyn"]}, {"page": "The Boat Race 1840", "response": ["Following heavy defeats in the 1836 and 1839 races, and in order to improve the selection of the crew, Oxford University Boat Club was formed on 23 April 1839,Burnell, p. 4 to which anyone at the university could subscribe and which was governed by the various college boat club captains.MacMichael, p. 69  The initial letter of challenge was delivered to Cambridge from Oxford in February.  After considerable discussion, mainly about the restriction of crew selection to undergraduates only, the date of the race, 15 April 1840, was agreed sixteen days prior to the race itself.MacMichael, pp. 69–70  The umpires for the race were Calverley Bewicke (for Oxford) and Charles Jasper Selwyn (for Cambridge), while W. H. Harrison, the Commodore of the Royal Thames Yacht Club, was the referee.Burnell p. 49  The race was to take place on a five-and-three-quarter-mile (9.2 km) stretch of the Thames between Westminster Bridge and Putney Bridge."]}, {"page": "The Boat Race 1846", "response": ["The 8th Boat Race between crews from the University of Oxford and the University of Cambridge took place on the River Thames on 3 April 1846.  Umpired by Charles Jasper Selwyn, Cambridge won in a time of 21 minutes 5 seconds, with a winning margin of three lengths.  The race was held on the ebb tide, starting in Mortlake and ending in Putney.  For the first time, outriggers were used by both crews.", "Following their ten-length defeat in the previous year's race, Oxford sent their challenge to Cambridge in February 1846, proposing that the race should take place at Easter.MacMichael, p. 133  The umpire for the race was Charles Jasper Selwyn.MacMichael, p. 134Burnell p. 49  Cambridge went into the race leading the contest overall, with five wins to Oxford's two since the inaugural race in 1829. On one of only a handful of occasions, the race was rowed on the ebb tide, from Mortlake to Putney."]}, {"page": "The Boat Race 1852", "response": ["The umpire for the race was Charles Jasper Selwyn and the starter was Edward Searle.Burnell p. 49"]}, {"page": "The Boat Race 1854", "response": ["thumb|right|upright|Sir Charles Jasper Selwyn (standing) was the umpire for the fifth time.MacMichael, p. 213", "Although Oxford arrived at Putney as favourites to win the race, Cambridge's style was enough to force the odds to evens.  However, in a practice race, the Dark Blues defeated a watermen scratch crew easily and restored their position as pre-race favourites.Drinkwater, p. 40 Both crews rowed in  long boats manufactured by Searle.MacMichael, p. 214  The umpire for the race was Charles Jasper Selwyn and the starter was Edward Searle.Burnell p. 49"]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["|Charles Jasper Selwyn", "|Charles Jasper Selwyn"]}, {"page": "Selwyn (name)", "response": ["* Charles Jasper Selwyn (1813–1869), Judge, Lord Justice, M.P. & privy counsellor"]}]}}