{"wiki_id": "http://www.wikidata.org/entity/Q5076142", "itemLabel": "Charles Catton", "itemDescription": "British artist (1728-1798)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Catton", "wikipedia_page": {"main": "Charles Catton RA (1728 in Norwich – 28 August 1798, in London), sometimes referred to as Charles Catton the elder, was a notable English coach painter, landscape, animal and figure painter of the late 18th century, and one of the founder members of the Royal Academy of Arts.", "link_mentions": [{"page": "Royal Academy of Arts", "response": ["The instrument of foundation, signed by George III on 10 December 1768, named 34 founder members and allowed for a total membership of 40. The founder members were Reynolds, John Baker, George Barret, Francesco Bartolozzi, Giovanni Battista Cipriani, Augustino Carlini, Charles Catton, Mason Chamberlin, William Chambers, Francis Cotes, George Dance, Nathaniel Dance, Thomas Gainsborough, John Gwynn, Francis Hayman, Nathaniel Hone the Elder, Angelica Kauffman, Jeremiah Meyer, George Michael Moser, Mary Moser, Francis Milner Newton, Edward Penny, John Inigo Richards, Paul Sandby, Thomas Sandby, Dominic Serres, Peter Toms, William Tyler, Samuel Wale, Benjamin West, Richard Wilson, Joseph Wilton, Richard Yeo, Francesco Zuccarelli. William Hoare and Johann Zoffany were added to this list by the King in 1769."]}, {"page": "Somerset House", "response": ["Inside, most of the offices were plain and business-like, but in the North Wing the formal rooms and public spaces of the learned societies were enriched with painted ceilings (by Cipriani, Benjamin West, Angelica Kauffman, J. F. Rigaud, Charles Catton and Joshua Reynolds), ornamental plasterwork (by Thomas Collins and Thomas Clerk) and casts of classical sculptures. John Papworth did the plasterwork in the great Royal Academy Room; many of the ceiling paintings were removed by the Royal Academy when they vacated their premises."]}, {"page": "Catton", "response": ["* Charles Catton the elder (1728 – 1798), English artist", "* Charles Catton the younger (1756-1819), English artist "]}, {"page": "1798 in art", "response": ["* August 28 – Charles Catton, English painter (born 1728)"]}, {"page": "1769 in art", "response": ["* Charles Catton – Self-portrait"]}, {"page": "1728 in art", "response": ["** Charles Catton, English painter (died 1798)"]}, {"page": "Animal painter", "response": ["* Charles Catton (1728-1798)"]}, {"page": "Charles Catton the younger", "response": ["Charles Catton the younger (30 December 1756 – 24 April 1819) was an English-born American slave owner, topographical artist, illustrator and theatrical scene-painter.", "Catton, was born in London, the son of Charles Catton the elder. He received art tuition from his father and also studied at the Royal Academy schools. He travelled extensively through England and Scotland, making sketches, some of which were afterwards engraved and published. He was known as a scene-painter for the theatre, and also as a topographical artist."]}, {"page": "Charles Catton the elder", "response": ["#REDIRECT Charles Catton"]}, {"page": "List of Royal Academicians", "response": ["| Charles Catton   ||align=\"center\" |  1768  ||  Foundation member"]}, {"page": "John Durand (painter)", "response": ["Nothing is known of Durand's origins, training or upbringing, as is often the case with colonial American painters. As he is referred to in two different known sources as \"monsieur Duran\" it has been assumed that he was of French descent. This assumption has been bolstered by the rococo colors used in his paintings, which some sources have taken to suggest that if not born in France he was at least trained there. It appears more likely, however, that he is the same \"John Durand\" that was apprenticed to Charles Catton in London on September 15, 1760, for a seven-year term. Just when Durand emigrated is unknown; he is first recorded in Virginia in 1765, but by 1766 was in New York City, where an entry in the account book of James Beekman records payment to the artist for portraits of the six Beekman children. In 1767 he advertised the opening of a drawing school in New York, on Broad Street. New York remained his base of operations for some years, although signatures on a number of portraits indicate that he returned to Virginia in 1769, 1771, 1775, and 1780. According to his nephew, Robert Sully, he was prolific there; Sully wrote of him that \"He painted an immense number of portraits in Virginia; his works are hard and dry, but appear to have been strong likenesses, with less vulgarity of style than artists of his calibre generally possess.\"  He is known to have traveled to Connecticut twice for work; a 1768 advertisement from the Connecticut Journal survives, and suggests that he planned on a sojourn of at least a few months in the colony. A trip to Bermuda is also known. By 1770 he was in Virginia, working in Williamsburg and later in Petersburg. Durand drops out of sight as an artist after 1775, when he signed and dated a pair of portraits of Mr. and Mrs. Gray Briggs of Dinwiddie County, Virginia. It has been suggested that he remained in Virginia, as the only other references to him after that point are a painting from Virginia dated 1781 and an entry in the Dinwiddie County tax rolls of 1782. It has also been claimed that he was working in Chesterfield County in 1780. One source claims that he returned to England after this point, an assertion which does not appear to be supported anywhere else."]}, {"page": "Catton's English Peerage", "response": ["#REDIRECT Charles Catton"]}, {"page": "Street names of Holborn", "response": ["* Catton Street – after the 18th century painter Charles Catton who lived nearbyFairfield, S. The Streets of London – A dictionary of the names and their origins, p61Bebbington, G. (1972) London Street Names, p76"]}, {"page": "Catton, Charles", "response": ["#redirectCharles Catton"]}, {"page": "Elizabeth Caslon", "response": ["Caslon's likeness was captured by Charles Catton and a stipple engraving of this by William Satchwell Leney. A copy of this is in the National Portrait Gallery in London."]}, {"page": "The Academicians of the Royal Academy", "response": ["* Charles Catton (the Elder)"]}]}}