{"wiki_id": "http://www.wikidata.org/entity/Q5085507", "itemLabel": "Charlie Siem", "itemDescription": "violinist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Siem", "wikipedia_page": {"main": "Charles Maximilian Siem (born 14 January 1986) is an English contemporary classical violinist and model.", "link_mentions": [{"page": "Tony Banks (musician)", "response": ["On 26 March 2012, Banks's second classical album was released (also on Naxos), entitled Six Pieces for Orchestra, performed by the City of Prague Philharmonic Orchestra conducted by Paul Englishby. Tracks are: \"Siren\" featuring Martin Robertson on alto saxophone, \"Still Waters\", \"Blade\" with Charlie Siem on violin, \"Wild Pilgrimage\", \"The Oracle\" and \"City of Gold\"."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Charlie Siem (born 1986), contemporary violinist and model"]}, {"page": "Wigmore Hall", "response": ["Instrumentalists and chamber groups performing at the hall include Leslie Howard, Vladimir Ashkenazy, Charlie Siem, Stephen Kovacevich, András Schiff, Joshua Bell, Maxim Vengerov, Angela Hewitt, Steven Isserlis, Pierre-Laurent Aimard, Steven Osborne, Stephen Hough, Bruce Brubaker, the Nash Ensemble, the Beaux Arts and Florestan Trios and the Artemis, Aviv, Belcea, Emerson, Endellion, Hagen, Jerusalem, Takács and Zehetmair Quartets. In recent years, artists and ensembles such as Igor Levit, Iestyn Davies, the Doric String Quartet, The Elias String Quartet, Ning Feng, Francesco Piemontesi, Alina Ibragimova, Mahan Esfahni, Arcangelo, Hilary Hahn, Thomas Ades, Sir George Benjamin, Julia Fisher, Nicola Benedetti, Isabele Faust, Bretton Brown, and Christian Gerharher have all become associated with and connected to Wigmore Hall through concert series and artistic residencies. The Hall is noted for helping young artists launch and develop their international careers."]}, {"page": "Howard Goodall", "response": ["Steadfast, with music and lyrics by Goodall, was released on 14 October 2014, in aid of Global's Make Some Noise, a charity that helps disadvantaged children in the UK. Steadfast included performance contributions from Katherine Jenkins, Laura Wright, Milos, Charlie Siem, Alfie Boe, Myleene Klass and Alexander Armstrong."]}, {"page": "Giuseppe Guarneri", "response": ["Charlie Siem, "]}, {"page": "Night of the Proms", "response": ["* Charlie Siem (2010)"]}, {"page": "Black Cab Sessions", "response": ["*Charlie Siem"]}, {"page": "Siem", "response": ["*Charlie Siem (born 1986), British violinist"]}, {"page": "List of contemporary classical violinists", "response": ["* Charlie Siem (born 1986)"]}, {"page": "Sasha Siem", "response": ["Sasha Siem was born in London, England, to Kristian Siem, a Norwegian businessman, and his South African wife Karen Ann, née Moross. Her brother is violinist Charlie Siem."]}, {"page": "Limelight (club night)", "response": ["Several Brit and Emmy award winners have appeared at Limelight so far, with some returning for repeat appearances. Artists have included Leif Ove Andsnes, Natasha Paremski, Joanna MacGregor, Nicola Benedetti, Jack Liebeck, Daniel Hope, Charlie Siem, Natalie Clein and Matthew Barley.", "* Violinist Charlie Siem: \"There was a really nice atmosphere, really relaxed. When you play concerts in a big symphony hall, there is a much more serious attitude. Everyone has to be quiet, pay their respects. It reminded me of the jazz clubs in New York, like Norwood in West Village.\""]}, {"page": "No Plan B (band)", "response": ["In 2011, the band embarked on the Tommy Reborn tour, which included a special benefit show for the Teenage Cancer Trust (of which Daltrey is a patron) at the Royal Albert Hall in London on March 24, 2011. Pete Townshend joined the band onstage at this show for the songs \"The Acid Queen\" and \"Baba O'Riley\", and violinist Charlie Siem played the violin solo in \"Baba O'Riley\". In 2011 the band toured the UK performing The Who's Tommy, followed by dates in Europe, the US and Canada.  The AEG Live-produced tour North American tour launched in Hollywood, Florida, at the Seminole Hard Rock September 13 and wrapped in Calgary, Alberta at the Scotiabank Saddledome. All shows were well-received, and the band booked additional dates in Europe and Japan for 2012."]}, {"page": "List of alumni of Girton College, Cambridge", "response": ["|Charlie Siem"]}, {"page": "Six Pieces for Orchestra", "response": ["Six Pieces for Orchestra is the fifth studio album by English keyboardist and songwriter Tony Banks. It was released on 26 March 2012 on Naxos Records as his second album of classical music, following Seven: A Suite for Orchestra in 2004. The suite is performed by the City of Prague Philharmonic Orchestra and conducted by Paul Englishby. Two of the pieces feature soloists: Martin Robertson plays alto saxophone on \"Siren\", and Charlie Siem plays violin on \"Blade\".", "*Charlie Siem – violin on \"Blade\""]}, {"page": "CBS Watch", "response": ["The magazine commissioned British violinist Charlie Siem to create a musical score for marketing and promotional purposes in 2014.  Siem recorded a five-minute song called \"Canopy\" in a church in London with the 22-member English Chamber Orchestra.  The magazine commissioned a second five-minute behind-the-scenes video that featured Siem and the orchestra performing the piece in its entirety.\"Charlie Siem’s Busy Year\". from WWD issue 03/12/2014\"Magazine Has a Soundtrack, and It's Classical\". Fishbowl NY on Adweek."]}, {"page": "Charles Siem", "response": ["#REDIRECT Charlie Siem"]}]}}