{"wiki_id": "http://www.wikidata.org/entity/Q5083205", "itemLabel": "Charles Douglas", "itemDescription": "Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_W._H._Douglas", "wikipedia_page": {"main": "General Sir Charles Whittingham Horsley Douglas,  (17 July 1850 – 25 October 1914) was a British Army officer who served in the Second Anglo-Afghan War, the First Boer War, the Suakin Expedition, the Second Boer War and the First World War. He was Chief of the Imperial General Staff during the first three months of the First World War but died from strain and overwork without having any meaningful influence on the outcome of the war.", "link_mentions": [{"page": "Douglas (surname)", "response": ["* Charles Douglass (1910–2003), an American sound engineer", "* Rear-Admiral Sir Charles Douglas, 1st Baronet of Carr, officer in the Royal Navy", "* Charles Douglas, 5th Lord Mordington (died after 1746)", "* Charles Douglas, 6th Marquess of Queensberry (1777–1837), great-great-great-great-grandson of the 1st Earl of Queensberry", "* Charles Douglas, 3rd Duke of Queensberry and 2nd Duke of Dover (1698–1778)", "* Henry Douglas, Earl of Drumlanrig (1722.1754), son of Charles Douglas, 3rd Duke of Queensberry, 2nd Duke of Dover and a soldier", "* Charles Douglas, 3rd Baron Douglas (1775–1848), MP for Lanarkshire, and a cricketer", "* Charles Douglas (mayor) (1852–1917), Mayor of Vancouver", "* Charles Douglas III (born 1942), U.S. Representative from New Hampshire and New Hampshire Supreme Court Associate Justice"]}, {"page": "Kensal Green Cemetery", "response": ["The cemetery contains the graves of 473 Commonwealth service personnel of the First World War—half of whom form a war graves plot in the south-west corner, the remainder in small groups or individual graves scattered throughout the grounds—and 51 of the Second who are all dispersed. In the First World War plot, at Section 213, a Screen Wall memorial lists casualties of both world wars whose graves could not be marked by headstones, besides five Second World War servicemen who were cremated at Kensal Green (also known as West London) Crematorium. The highest-ranking person buried here who is commemorated by the CWGC is General Sir Charles Douglas (1850–1914), Chief of the Imperial General Staff in early months of the First World War."]}, {"page": "John French, 1st Earl of Ypres", "response": ["While sorting out some papers for his successor Charles Douglas, French told Wilson (3 April) that Asquith had promised him command of the BEF in the event of war, although nobody realised how quickly this would come.Jeffery 2006, p. 123 Margot Asquith wrote that he would soon be \"coming back\", suggesting that Asquith may have promised to appoint French Inspector-General. Churchill described him as \"a broken-hearted man\" when he joined the trial mobilisation of the fleet in mid-July. French was still seen as a potential Commander-in-Chief of the BEF, although even in early August French himself was uncertain that he would be appointed.Terraine 1960, p. 33Heathcote, p. 133", "The \"Precautionary Period\" for British mobilisation began on 29 July, the day after Austria-Hungary declared war on Serbia. French was summoned by Sir Charles Douglas (CIGS) and told (30 July) he would command the British Expeditionary Force (BEF).Holmes 2004, pp. 196–198 There was no other serious candidate for the position.Holmes 2004, p. 203 He was first briefly re-appointed Inspector-General of the Army (1 August). Sir John spent much of 2 August in discussions with French Ambassador Paul Cambon. British mobilisation began at 4 pm on 4 August.Holmes 2004, pp. 199–201 Until Germany invaded Belgium it was unclear whether Britain would join in the war, but she did so at midnight on 4 August."]}, {"page": "Sir Henry Wilson, 1st Baronet", "response": ["During the July Crisis Wilson was mainly preoccupied with the apparent imminence of civil war in Ireland and vainly lobbied the new CIGS Charles Douglas to flood not just Ulster but the whole of Ireland with troops (29 June).Jeffery 2006, pp. 126–7. By the end of July it was clear that the continent was on the brink of hostilities, with Wilson being lobbied by Milner and the diplomat Eyre Crowe about Edward Grey's reluctance to go to war. Wilson (1 August) called on de la Panouse (French Military Attaché) and Paul Cambon (French Ambassador) to discuss the military situation.Jeffery 2006, pp. 131–2. Wilson may well have been keeping the Conservative leadership informed of discussions between Cambon and Foreign Secretary Grey.Clark 2012, p. 541.Clark gives no specific cite for this claim, which appears just before a discussion of how Grey, following a Cabinet meeting at which John Morley and the neutralists had had the upper hand, told Cambon (1 August) that Britain would probably stay out. The same day, Conservative MP George Lloyd then had a meeting with Cambon, who told him that Grey was – there was a hung Parliament at the time – using alleged lack of Conservative support as an excuse for Britain staying out. That evening there were meetings of leading Conservatives, and the following day (2 August), a letter to the Government urging them to fight. Clark does not specifically link Wilson to these events and also mentions how Conservative-leaning newspapers such as \"The Times\" were urging British intervention (Clark 2012, pp. 540–3). The German invasion of Belgium provided a casus belli and Britain mobilized on 3 August and declared war on 4 August.Jeffery 2006, pp. 127, 131."]}, {"page": "1st Infantry Division (United Kingdom)", "response": ["9th Brigade Maj-Gen Charles Douglas"]}, {"page": "2nd Infantry Division (United Kingdom)", "response": ["In response to the lessons learnt from the war, which included the army's failings in the opening months, the Secretary of State for War, St John Brodrick, set out to reform the standing army. He intended to create six army corps, three of which would be composed of permanent standing formations that consisted of the army's regulars. They would be ready for immediate dispatch in light of an imperial crisis or in the event of European war. In 1902, three corps were formed that would allow up to nine divisions, each of two brigades, to be created. This included the 2nd Division formed on 1 April 1902, under the command of Major-General Charles Douglas. The division consisted of the 3rd and the 4th Brigades, and was based in Aldershot. The division was part of the 1st Army Corps, of only two divisions (the 3rd Division would be mobilised in the event of war)., , , and  In 1907, the Haldane Reforms further restructured the regular army into six infantry divisions, each with three brigades. These would form the basis of any British Expeditionary Force (BEF) that would be dispatched to Europe in the case of war. This included the 2nd Division, which then consisted of the 4th (Guards), the 5th, and the 6th Brigades. The 1st and the 2nd Divisions were allocated to Aldershot Command, a military district based at Aldershot. On the outbreak of war, Aldershot Command would form the nucleus of a new I Corps, which would then be dispatched with the BEF. The 2nd Division took part in the Army Manoeuvres of 1912 and 1913."]}]}}