{"wiki_id": "http://www.wikidata.org/entity/Q5080036", "itemLabel": "Charles Lambe", "itemDescription": "British naval officer of the Royal Navy (1900-1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Lambe", "wikipedia_page": {"main": "Admiral of the Fleet Sir Charles Edward Lambe,  (20 December 1900 – 29 August 1960) was a senior Royal Navy officer. He fought in the Second World War in command of a cruiser, as Director of Naval Plans and then in command of an aircraft carrier. He served as First Sea Lord and Chief of the Naval Staff from 1959 until 1960 when he was forced to retire early because of a heart condition. He died only a few months later.", "link_mentions": [{"page": "Newport-on-Tay", "response": ["*Sir Charles Lambe, First Sea Lord, Admiral of the Fleet; born in Dorset, residence Newport, died Newport 1960"]}, {"page": "Admiral of the Fleet (Royal Navy)", "response": ["| ||  || Lambe CharlesSir Charles Lambe  || 1900 || 1960 || First Sea Lord 1959–1960  ||"]}, {"page": "John Fisher, 1st Baron Fisher", "response": ["William Fisher sold his commission the year John was born, and became a coffee planter and later chief superintendent of police. He incurred such debt on his two coffee plantations that he could barely support his growing family. At the age of six John (who was always known within the family as \"Jack\") was sent to England to live with his maternal grandfather, Charles Lambe, in New Bond Street, London. His grandfather had also lost money and the family survived by renting out rooms in their home. John's younger brother, Frederic William Fisher, joined the Royal Navy and reached the rank of admiral, and his youngest surviving sibling Philip became a navy lieutenant on  before drowning in an 1880 storm."]}, {"page": "Second Sea Lord and Deputy Chief of Naval Staff", "response": ["* Admiral Sir Charles Lambe, 1955–1957"]}, {"page": "HMS Illustrious (87)", "response": ["Her sister ships, the Indomitable and the  arrived at the end of June although only the latter's pilots were combat-ready. Captain Charles Lambe was appointed as the new captain of the Illustrious on 21 May, but he could not join his new ship until 9 July. Somerville decided to attack Sabang again (Operation Crimson), although the ships of the East Indies Fleet would bombard the port while the fighters from the Illustrious and the Victorious spotted for them and protected the fleet. As the Barracudas were needed only for anti-submarine patrols, the former embarked only nine while the latter ship flew off all her Barracudas. On the early morning of 25 July, Illustrious launched 22 Corsairs for CAP and to observe the naval gunfire and take photos for post-attack damage assessments. The bombardment was very effective, sinking two small freighters, and severely damaging the oil storage and port facilities. One Corsair was shot down by Japanese flak although the pilot was rescued after ditching. As the fleet was withdrawing, Illustriouss CAP intercepted and shot down a Nakajima Ki-43 (codenamed \"Oscar\") fighter and a Mitsubishi Ki-21 \"Sally\" medium bomber on reconnaissance missions. Later in the day her Corsairs intercepted 10 Ki-43s and shot down two of them while driving off the remainder. After arriving in Trincomalee, 1837 Squadron was transferred to the Victorious.Brown 1971, p. 257; Brown, J. D., pp. 81–83; McCart, p. 27; Sturtivant, p. 417"]}, {"page": "Far East Fleet (United Kingdom)", "response": ["|2 ||Vice-Admiral|| 25px ||Sir Charles Lambe||March 1953 – April 1955 "]}, {"page": "Mediterranean Fleet", "response": ["| align = left | Admiral Sir Charles Lambe"]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**Sir Charles Lambe, Second Sea Lord", "**Sir Charles Lambe, Second Sea Lord", "**Sir Charles Lambe, First Sea Lord", "**Sir Charles Lambe, First Sea Lord"]}]}}