{"wiki_id": "http://www.wikidata.org/entity/Q5085610", "itemLabel": "Charlie Timmins", "itemDescription": "English footballer (1922-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Timmins", "wikipedia_page": {"main": "Charles Timmins (29 May 1922 – 13 April 2010) was an English footballer.Born in Birmingham, Timmins signed for Birmingham City before the Second World War. However, his registration papers were lost after heavy bombing in the Birmingham area. In the summer of 1948, Timmins signed for Coventry City.Timmins had given up hope of pursuing a career in top-flight football and was playing for non-league Jack Moulds Athletic in Birmingham when Coventry manager Harry Storer turned up unannounced at the Timmins family home and persuaded him to sign for Coventry City. Timmins spent 11 years at Coventry, including three years as club captain. During the 1955–56 season, Timmins was touted by press as the \"best full back outside the top flight\" and speculation grew that he would join teammate Reg Matthews in the England squad. Coventry turned down a substantial bid from Newcastle United for Timmins during his time at Highfield Road. He played a total of 165 games (161 in the Football League) and scored five goals before leaving Coventry to join Leamington in 1959, aged 37.Timmins then spent the 1960–61 season coaching Evesham United before finally retiring aged 39. Timmins was a member of the Coventry City Former Players Association and was a regular at the club's official 'Legends' Days. After retiring from football, he worked for the Rover service department in Solihull and played for the works team.Timmins was diagnosed with prostate cancer and died at the Queen Elizabeth Hospital, Birmingham, during the early hours of 13 April 2010.", "link_mentions": [{"page": "Coventry City F.C.", "response": ["Around 50 former stars of the club attended the launch including Coventry City legends George Hudson, Cyrille Regis, Charlie Timmins and Bill Glazier. The association's first newsletter was published in autumn 2007 and a website launched. The launch of 2007 was followed by subsequent Legends' Days. The 2009 event, held at the home game against Doncaster Rovers was attended by 43 former players including the first visit to Coventry for many years of Roy Barry and Dave Clements. In March 2012 the membership had increased past the 200 mark with former captain Terry Yorath inducted as the 200th member at the 2012 Legends' Day."]}, {"page": "List of people from Birmingham", "response": ["*Charlie Timmins – Footballer"]}, {"page": "Sparkhill", "response": ["*Charlie Timmins, Coventry City captain."]}, {"page": "Evesham United F.C.", "response": ["Evesham United FC was founded shortly after World War II by returning servicemen, replacing the town's earlier club Evesham Town, who had reached the FA Amateur Cup final in 1923.  The new club started life in the Worcester League before switching to the Worcestershire Combination in 1951, winning the league title in their second season in the league.  After a second title win in 1955 they switched to the Birmingham & District League where they were coached by former Coventry City captain Charlie Timmins during the 1960–61 season."]}, {"page": "2010 in association football", "response": ["* 13 April - Charlie Timmins, English footballer (87)"]}, {"page": "2009–10 in English football", "response": ["*13 April 2010 – Charlie Timmins, 87, former Coventry City full-back who spent his entire ten-year professional career at Highfield Road.Sad death of City old boy Charlie Timmins , Coventry Telegraph. Retrieved 23 April 2010."]}, {"page": "2009–10 Coventry City F.C. season", "response": ["*12 – Former Coventry City captain Charlie Timmins passes away following a long battle with cancer."]}, {"page": "Deaths in April 2010", "response": ["*Charlie Timmins, 87, English footballer (Coventry City), cancer."]}, {"page": "Timmins (surname)", "response": ["*Charlie Timmins (1922–2010), English footballer  "]}]}}