{"wiki_id": "http://www.wikidata.org/entity/Q5083399", "itemLabel": "Charles Watts", "itemDescription": "English secularist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Watts_(secularist)", "wikipedia_page": {"main": "Charles Watts (27 February 1836 – 16 February 1906) was an English writer, lecturer and publisher, who was prominent in the secularist and freethought movements in both Britain and Canada.", "link_mentions": [{"page": "Freethought", "response": ["The principal organ of the free thought movement in Canada was Secular Thought (Toronto, 1887–1911). Founded and edited during its first several years by English freethinker Charles Watts (1835–1906), it came under the editorship of Toronto printer and publisher James Spencer Ellis in 1891 when Watts returned to England. In 1968 the Humanist Association of Canada (HAC) formed to serve as an umbrella group for humanists, atheists, and freethinkers, and to champion social justice issues and oppose religious influence on public policy—most notably in the fight to make access to abortion free and legal in Canada."]}, {"page": "National Secular Society", "response": ["The National Secular Society was founded in 1866 with Charles Bradlaugh as President and Charles Watts as secretary. There were a number of secularist groups around the UK and they joined up to coordinate and strengthen their campaigns.  The word secularism was coined by George Holyoake in 1851. The NSS's principles asserted that \"this is the only life we have, and that we should work for its improvement\".", ":1866: Charles Watts"]}, {"page": "George Holyoake", "response": ["After an 1877 split with Charles Bradlaugh and Annie Besant, leaders of the National Secular Society (NSS), Holyoake, Charles Watts and Harriet Law founded the British Secular Union, which remained active until 1884."]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["*Charles Watts"]}, {"page": "Charles Watts", "response": ["* Charles Watts (cricketer, born 1894) (1894–1979), English cricketer", "* Charles Watts (cricketer, born 1905) (1905–1985), English cricketer", "* Charles Watts (secularist) (1836–1906), English writer, publisher and secularist"]}, {"page": "Charles Albert Watts", "response": ["Charles Albert Watts (27 May 1858 – 15 May 1946) was an English secularist editor and publisher.  He founded the journal Watts's Literary Guide, which later became the New Humanist magazine, and the Rationalist Press Association.  His father Charles Watts was also a prominent secularist writer. Father and son are sometimes confused with each other, and Charles Albert Watts is sometimes referred to as C. A. Watts or Charles Watts Jr.", "Charles Albert Watts was the son of Charles Watts and his first wife Mary Ann Watts, and was the nephew of John Watts, all of whom were active in the rationalist and secularist movement in London, based around Charles Bradlaugh.  John and Charles Watts both edited the National Reformer, and founded a radical publishing house, Watts & Co., in London in 1864.  Charles Watts co-founded the National Secular Society in 1866, and became a leading spokesman for the group after his brother's death, but broke with Bradlaugh in 1877 and, in 1883, emigrated to Toronto, Ontario, Canada, leaving his son Charles Albert to run his publishing house and continue his editorial work. Madalyn Murray O'Hair, Biography of Charles Watts, American Atheists"]}, {"page": "Joseph Wheless", "response": ["* Charles Watts"]}, {"page": "Secular Thought", "response": ["Secular Thought (1887–1911) was a Canadian periodical, published in Toronto, dedicated to promoting the principles of freethought and secularism. Founded and edited during its first several years by English freethinker Charles Watts, the editorship was assumed by Toronto printer and publisher James Spencer Ellis in 1891 when Watts returned to England. During that period, Secular Thought was the principal organ of the freethought movement in Canada, publishing large amounts of material from England and the United States in addition to commenting on Canadian affairs.Ramsay Cook, The Regenerators: Social Criticism in Late Victorian English Canada (Toronto: University of Toronto Press, 1985), pp. 46–64."]}, {"page": "Secular Review", "response": ["In February 1877, Charles Watts assumed the editorship.  A new series was started in June 1877, merging it with Foote's Secularist, under joint editorship, to form the Secular Review and Secularist.  Foote served as co-editor with Watts until March 1878, after which Watts edited the paper on his own until 1882."]}, {"page": "William Stewart Ross", "response": ["In London in 1872, Ross established his own publishing company, W. Stewart & Co., and for some years primarily issued educational works and magazines.Joseph McCabe, A Biographical Dictionary of Modern Rationalists (London: Watts & Co., 1920), p. 684.  But Ross also became a leading advocate of freethought, agnosticism, rationalism and secularism, and served as president of the Lambeth Radical Association.  In 1880 he chaired a lecture by Charles Bradlaugh, with whom he disagreed over the issue of birth control, and soon became associated with the branch of secular thought led by Charles Watts and his son C. A. Watts."]}, {"page": "Harriet Law", "response": ["Law fell out with Bradlaugh and Besant and left the NSS in 1877. George Holyoake, Charles Watts and Harriet Law then founded the British Secular Union, which remained active until 1884."]}, {"page": "Kate Watts", "response": ["She was born in London to William and Eunice Nowlan, a freethinking family.England & Wales, FreeBMD Birth Index, 1837-1915, Holborn, Mar Qtr 1849 In 1870 she married Charles Watts (after the death of his first wife, Mary Ann), and their daughter Kate Eunice Watts was born in May 1875.FreeBMD. England & Wales, FreeBMD Marriage Index, 1837-1915, St Saviour Southwark She was a committed advocate of female education and emancipation. Her series of articles 'The Education and Position of Women' in the Secular Review in 1879 argued that women should have the freedom to earn their own living, live in equal terms with their husbands if they chose to marry, and live a single life without fear of social opprobrium. She also wrote the pamphlet Christianity: Defective and Unnecessary  Madalyn Murray O'Hair, Biography of Charles Watts, American Atheists"]}, {"page": "British Secular Union", "response": ["The British Secular Union had broadly the same goals as the National Secular Society but distanced themselves from Bradlaugh's style, especially when it came to the Knowlton Pamphlet, which advocated birth control.Edward Royle, Radicals, Secularists, and Republicans: Popular Freethought in Britain, 1866-1915, Manchester University Press, 1980, p.20. Even though Charles Watts owned the rights to the Knowlton pamphlet (and had no intention of publishing it), Charles Bradlaugh and Annie Besant broke with Watts and published the pamphlet anyway, subsequently facing prosecution.Edward Royle, The Infidel Tradition from Paine to Bradlaugh, MacMilian Press Ltd, 1976, p.68. The issue of birth control was a contentious one within the secular movement. Bradlaugh managed to steer opinion away from the birth control element and instead made secularism a freedom of speech issue.Edward Royle, The Infidel Tradition from Paine to Bradlaugh, MacMilian Press Ltd, 1976, p.68."]}, {"page": "London Dialectical Society", "response": ["The Society had a broad remit to all \"the most absolute freedom of debate\" with no topic excluded from discussion (except on the grounds of \"triviality\"). It therefore hosted debates on a wide variety of topics, examples of which include 'Over-population and Public Health' (July 1868) at which Charles Bradlaugh and Charles Robert Drysdale both spoke, 'On Marriage' (April 1871) led by Moncure D. Conway, and 'The Philosophy of Secularism' (December 1872) opened by Charles Watts. The format of these sessions was usually that an eminent speaker gave an opening lecture, which was followed by a debate open to all attendees. In 1868-69 the Society published a pamphlet explaining its purpose, history, and rules, as well as a report covering its activities and members in 1866-68."]}, {"page": "Austin Holyoake", "response": ["At these premises, known as Fleet Street House, The Reasoner was produced and Austin Holyoake acted as secretary. Edward Royle describes howThe work of the Fleet Street House was divided into three business departments. In 1856 these were Publishing, under Frederick Farrah; the News Agency, under Thomas Wilks; and Printing, under John Watts. [George Jacob] Holyoake was the Director, and his brother Austin, secretary and general assistant...The printing and publishing business was taken over by Austin in 1859, lapsed in 1862 when the  Fleet Street House was sold, but was revived as 'Austin & Co.' at 17 Johnson's Court in 1864. This business then passed successively to Charles Watts, Charles Albert Watts and the Rationalist Press Association.Austin Holyoake was a member of multiple radical and reformist groups, including the Reform League, and the author of many tracts and pamphlets. A member of the Association for the Repeal of Taxes on Knowledge, he was the last printer in England prosecuted under the Newspaper Stamp Act. Holyoake was sub-editor of Charles Bradlaugh's National Reformer from 1866 to his death, also co-editing with Bradlaugh the Secular Almanac. The two were 'intimate friends and co-workers.'  Holyoake was a vice-president, and the first treasurer, of the National Secular Society, founded by Bradlaugh in 1866."]}]}}