{"wiki_id": "http://www.wikidata.org/entity/Q5085359", "itemLabel": "Charlie Parry", "itemDescription": "Welsh footballer (1870-1922)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Parry", "wikipedia_page": {"main": "Charles Frederick Parry (1870 – 4 February 1922) was a Welsh footballer who played as a defender for Everton in the 1890s, helping them to win the Football League championship in 1891. He also made thirteen appearances for the Wales national football team including four as captain. Later in his career, he returned to Wales where he won the Welsh Cup with Aberystwyth Town in 1900. He subsequently fell on hard times and was the beneficiary of three testimonial matches.", "link_mentions": [{"page": "Charles Parry", "response": ["*Charlie Parry (1870–1922), Welsh footballer with Everton F. C."]}, {"page": "List of Everton F.C. players", "response": ["|align=\"left\"|Charlie Parry||||FB||1889–1895||94||5||*Inclusion reason required*"]}, {"page": "1893–94 in English football", "response": ["Wales opened the scoring after 10 minutes, but by half-time England had taken the lead with a goal from John Veitch and an own goal from Everton's Charlie Parry. Veitch scored again early in the second half and completed his hat-trick in the 80th minute, thus joining a select band to score a hat-trick on his début. The fifth goal came from Robert Cunliffe Gosling as England ran out comfortable 5–1 victors.", "|John Veitch (Old Westminsters) (30, 55 & 80 mins), Charlie Parry (Own goal) (31 mins) and Robert Cunliffe Gosling (Old Etonians) (85 mins)"]}, {"page": "Fred Geary", "response": ["Everton had finished in a disappointing eighth position in the inaugural Football League season, having scored only 35 goals and the directors \"were determined to improve upon their indifferent performances\", especially in front of the goal, by recruiting Geary, along with Scotsman Alex Latta (from Dumbarton) and Welshman Charlie Parry (from Chester St Oswalds). Geary had first been spotted at Grimsby Town, but had moved back to Notts Rangers before he was persuaded to join Everton."]}, {"page": "John Veitch (footballer)", "response": ["Wales opened the scoring after 10 minutes, but by half-time England had taken the lead with a goal from Veitch and an own goal from Charlie Parry. Veitch scored again early in the second half and completed his hat-trick in the 80th minute, thus joining a select band to score a hat-trick on his début. The fifth goal came from Robert Cunliffe Gosling as England ran out comfortable 5–1 victors. Veitch is one of five players to have scored a hat-trick on his England debut, yet not make a second appearance.The other four are Albert Allen, John Yates, Walter Gilliat and Frank Bradshaw."]}, {"page": "1889–90 Everton F.C. season", "response": ["Such was the transition at Everton over the summer that just four of the previous season's first choice eleven, Smalley, Farmer, Holt and Chadwick remained in place, the latter being the only player to play in every Everton League game since the formation of the competition. Twenty-five-year-old right back, Andrew Hannah was brought from Renton to replace the retired George Dobson. A disappointed Nick Ross returned to Preston having missed their double winning season and was replaced by the Bolton veteran left back, Dan Doyle. Charlie Parry arrived from Chester St Oswalds, pushing James Weir out of the side and striker Frank Sugg was also pushed out as Fred Geary was brought in from Notts County. Joe Davies returned to his hometown club Chirk to be replaced by Alex Latta from Dumbarton meaning that no less than five new signings made their debut on the opening day of the season with two of them, Geary and Parry both becoming instant heroes by scoring the goals in a 3–2 victory over Blackburn. ", "|Fred Geary (2), Charlie Parry", "|Charlie Parry, Fred Geary", "|Charlie Parry", "|Charlie Parry, ALEX LATTA (3), Edgar Chadwick"]}, {"page": "1890–91 Everton F.C. season", "response": ["Having finished the previous season as runners up Everton made just one signing of note during the summer when William Campbell was brought from Bootle to fill the centre half role, which had remained unsettled since George Farmer had been dropped the previous November. Robert Smalley's position in goal was also under threat from an emerging twenty-year-old Scot named Jack Angus while David Kirkwood having lost the battle to secure the inside right birth to Alec Brady, now shared the centre back duties with Charlie Parry"]}, {"page": "1894–95 Everton F.C. season", "response": ["Bob Howarth was the biggest name to leave Goodison Park during the summer as he returned to Preston North End. This gave Charlie Parry the chance to win back the left back shirt that he had lost when Howarth had arrived two years earlier. Reserve goalkeepers, John Whitehead and David Jardine both moved on, to Liverpool and Nelson respectively to seemingly cement Richard Williams' place between the posts. Two other fringe players, defender, Billy Lindsay and half back, Jack Walker left in search of regular first team football at Grimsby and Ardwick respectively. The only major inclusion to the first team squad was the signing of Tom McInnes from Scottish side Third Lanark. He instantly slotted into the inside right birth while Jack Bell moved out to outside left with Alf Milward making way.", "|Fred Geary, Charlie Parry"]}, {"page": "Aberystwyth Town F.C.", "response": ["* Charlie Parry, capped 13 times by Wales prior to joining the club in 1899, won Welsh Cup with Aberystwyth in 1900."]}, {"page": "1891–92 Ardwick A.F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Charlie Parry"]}, {"page": "Robert Watson (footballer)", "response": ["Watson was a sprightly forward, with good control, he was then switched to inside—right and had a sound first season of League action before losing his place to Welsh International Charlie Parry. He moved in 1889 to Gorton Villa FC. (registration & fee required)"]}, {"page": "1895–96 Everton F.C. season", "response": ["The Everton board kept faith in the squad that had finished runners up the previous season with no major signings or departures during the summer. This meant that Jack Hillman was the undisputed first choice goalkeeper for the season and would go on to play all bar the final game in which Harry Briggs made his club debut in a 2–1 victory at Stoke. Bob Kelso, Charlie Parry and James Adams resumed their battle for the two full back positions from the previous season. Adams missed the first game of the season but returned to miss just one other game as he established himself as the first choice full back but Both Kelso and Parry fell out of favour as reserve, Smart Arridge emerged as a solid full back partner to Adams. Kelso, who played the first five games of the season, made just one further appearance for the club in the half back line before leaving to join Dundee in February. Parry's long love, hate relationship with the Goodison Park club finally came to an end after his second appearance of the season when he gave away a penalty, which was missed, in a 3–4 defeat at Aston Villa in September.Liverpool Mercury Newspaper 1 October 1895 Before the year was out the Welsh International defender had moved on to Ardwick.", "|align=\"left\"|FB||align=\"left\"| Charlie Parry"]}, {"page": "Chester St Oswalds F.C.", "response": ["* Charlie Parry - Wales International, later played for Everton."]}]}}