{"wiki_id": "http://www.wikidata.org/entity/Q5084787", "itemLabel": "Charlie Dove", "itemDescription": "English footballer (1879-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Dove", "wikipedia_page": {"main": "Charles Dove (1879–?) was an English footballer.", "link_mentions": [{"page": "West Ham United F.C.", "response": ["The team played on a strictly amateur basis for 1895 at least, with a team featuring a number of works employees. Thomas Freeman was a ships fireman and Walter Parks, a clerk. Johnny Stewart, Walter Tranter and James Lindsay were all boilermakers. Other employees included William Chapman, George Sage and Fred Chamberlain, as well as apprentice riveter Charlie Dove, who was to have a great influence on the club's future at a later date.", "One story suggests that Thames Ironworks right-half Charlie Dove received the Aston Villa kit from William Belton, who was a professional sprinter of national repute, as well as being involved with the coaching at Thames Ironworks. Belton had been at a fair in Birmingham, close to Villa Park, the home ground of Aston Villa and was challenged to a race against four Villa players, who wagered money that one of them would win. Belton defeated them and, when they were unable to pay the bet, one of the Villa players who was responsible for washing the team's kit offered a complete team's \"football kits\" to Belton in payment. The Aston Villa player subsequently reported to his club that the kit was \"missing.\" This, however, is often disputed.", "|  Charlie Dove"]}, {"page": "1895–96 Thames Ironworks F.C. season", "response": ["Other players likely to have been involved in this first game were Iron Works employee Charlie Dove, who had played at full-back and centre forward during his time as a school player, and Essex cricketer John Wood, who was the cousin of jockey Fred Archer. Dove was mainly used as a defender by The Irons, but would play every position for them during his stay there.", "|Charlie Dove"]}, {"page": "1896–97 Thames Ironworks F.C. season", "response": ["|Charlie Dove"]}, {"page": "Thames Ironworks F.C.", "response": ["The Ironworks played their first fixture against Royal Ordnance reserves on 7 September 1895, the game ending 1–1. One of the players likely to have been involved in this first game was Iron Works employee Charlie Dove, who had played at full-back and centre forward during his time as a junior player. Dove would be mainly used as a right-half, but would play every position for The Irons during his time with them.  Looking to bolster their attacking strength, the Irons had also recruited Ironworks employee George Gresham, an inside-forward who had played for Gainsborough Trinity, who would go on to score many goals for the club in the following four seasons.", "Their highest scoring game of the season came on 15 January 1898, with a 'ten goal thriller' against Bromley going The Ironworks' way 7–3.  Their impressive league run continued until the penultimate fixture of the London League season against second placed Brentford.  Brentford were only one point behind \"The Irons\" and the game caused much local interest, including a newspaper article on Thames Ironworks' rising star Charlie Dove.  At Shooters Field on 23 April 1898, Thames lost the tie 0–1, and Brentford leap-frogged \"The Irons\" and were now one point ahead with one game left to play.", "They kicked off the season on 10 September 1898 away to Shepherd's Bush, and were in fine form, beating the West London outfit 3–0.  In a Southern League game away to Wycombe Wanderers on 29 October, The Irons missed their train and arrived at the ground an hour late.  The obviously unsettled side lost the game 1–4.  This was to be Thames Ironworks' last defeat of the season, and they could go on to win an impressive 17 of their last 18 games, drawing the other game.  In an away game against Maidenhead on 31 December 1898, which Thames Ironworks won 4–0, Charlie Dove completed the distinction of playing in every position for the club when he deputised for goalkeeper Tommy Moore.", "On 5 July 1900 they reformed under the new name of West Ham United and accepted an offer of the Southern League place left vacant by Thames Ironworks. Lew Bowen, a Welsh clerk at the Iron Works Company was appointed as the first West Ham United club secretary. Bowen had previously written Thames Ironworks match reports for the Thames Iron Works Gazette, also known as TIWG.  He would retain twelve Thames Ironworks players for the following season. These included goalkeeper Tommy Moore, full-backs Syd King and Charlie Craig, wing-halves Charlie Dove and Roddy McEachrane, as well as wingers Frank Taylor, Bob Allan and Fred Corbett. Former club secretary and Ironworks defender George Neil was also retained for the new season ahead. Tom Bradshaw's close friends Bill Joyce and Kenny McKay left for Portsmouth and Fulham respectively, while Albert Carnelly joined arch-rivals Millwall.", "The original colours of the team were dark blue due to Arnold Hills being a former student and football Blue of Oxford University, although the team used a variety of kits. They often used the claret and sky blue house colours of the actual Iron Works and would also wear all sky blue or white uniforms. They permanently adopted claret and blue for home games in the summer of 1899. Irons right-half Charlie Dove had got the kits for the club from William Belton, who was a professional sprinter of national repute, as well as being involved with the coaching at Thames Ironworks. Belton had been at a fair in Birmingham, close to Villa Park, the home ground of Aston Villa and was challenged to a race against four Villa players, who wagered money that one of them would win. Belton defeated them, and when they were unable to pay the bet, one of the Villa players who was responsible for washing the team's kit offered a complete side's 'uniforms' to him in payment of the bet. The Aston Villa player subsequently reported to his club that the kit was 'missing'. Thames Ironworks, and later West Ham United, would continue to use their previously favoured colours for their away kits. In recent years the club have committed to a sky blue-white-dark blue rotation, each kit having a one-season shelf life.", "#92 Charlie Dove 1895–1900", "#11 Charlie Dove 1895–1900", "| Charlie Dove ||align=\"center\"| 1899–1900"]}, {"page": "1897–98 Thames Ironworks F.C. season", "response": ["The penultimate fixture of the London League season was against second placed Brentford who were only one point behind \"The Irons\".  The game caused much local interest, including a newspaper feature in the East Ham Echo prior to the game, containing an article on Thames Ironworks' rising star Charlie Dove.  At Shooters Field on 23 April 1898, Thames lost the tie 0–1, and Brentford leap-frogged \"The Irons\" and were now one point ahead with one game left to play.", "|Charlie Dove"]}, {"page": "Upton Park F.C.", "response": ["Famous players for the side included Charles Alcock, later president of the Football Association, FA Cup Final referees Alfred Stair and Segar Bastard (who was also an England international), and Charlie Dove, one of the early leading players for Thames Ironworks. Upton Park also supplied two other England internationals, Clement Mitchell and Conrad Warner. Claude Buckenham, who played in the Olympic team of 1900, represented England at cricket."]}, {"page": "History of West Ham United F.C.", "response": ["The team played on a strictly amateur basis for 1895 at least, with a team featuring a number of works employees. Thomas Freeman was a ships fireman and Walter Parks, a clerk. Johnny Stewart, Walter Tranter and James Lindsay were all boilermakers. Other employees included William Chapman, George Sage and Fred Chamberlain, as well as apprentice riveter Charlie Dove, who was to have a great influence on the club's future at a later date."]}, {"page": "1898–99 Thames Ironworks F.C. season", "response": ["This was to be Thames Ironworks' last defeat of the season, and they could go on to win an impressive 17 of their last 18 games, only drawing away at Watford 0–0.  The year ended with The Irons biggest win of the season so far, in an away game against Maidenhead on 31 December 1898, which Thames Ironworks won 4–0.  It was in this game that Charlie Dove completed the distinction of playing in every position for the club when he deputised for goalkeeper Tommy Moore, and it is perhaps even more impressive that he managed to keep a clean sheet.", "|Charlie Dove"]}, {"page": "1899–1900 Thames Ironworks F.C. season", "response": ["They adopted claret and blue 'uniforms' for the first time. Charlie Dove had got the kits for the club at a very cheap price of £3.10s.  They had come from William Belton, who was a professional sprinter, as well as being one of the coaches at Thames Ironworks. During the summer of 1899, Belton had been at a fair in Birmingham, close to Villa Park, the home ground of Aston Villa. Belton had been challenged to a race against four Villa players, who wagered money that one of them would win. He defeated them, and when they were unable to pay the bet, one of the Villa players who was responsible for washing the team's kit offered a complete side's 'uniforms' to Belton in payment of the bet.  The Aston Villa player subsequently reported to his club that the kit was 'missing'.  Thames Ironworks, and West Ham United would continue to use their previous favoured colours of white, sky blue or navy for their away kit.", "In June 1900, club chairman Arnold Hill's  Thames Ironworks and Shipbuilding Company acquired another engineering firm in financial takeover and became a limited company for the first time.  4,000 ten shilling shares (50p)Equivalent to £ in today's pounds. were sold to Iron Works staff and the general public, with Hills generous enough to match sales of any shares one-to-one.  At the end of June, Thames Ironworks F.C. resigned from the Southern League and were officially wound up.  On 5 July 1900 they reformed under the new name of West Ham United F.C. and accepted an offer of the Southern League place left vacant by Thames Ironworks. Lew Bowen, a Welsh clerk at the Iron Works Company was appointed as the first West Ham United club secretary. Bowen had previously written Thames Ironworks match reports for the Thames Iron Works Gazette, also known as TIWG.  He would retain twelve Thames Ironworks players for the following season.  These included goalkeeper Tommy Moore, full-backs Syd King and Charlie Craig, wing-halves Charlie Dove, Roddy McEachrane and James Bigden, left-wingers Frank Taylor and Len Walker and right-wingers Bob Allan and Fred Corbett.  Former club secretary and Ironworks defender George Neil was also retained for the new season ahead.  Tom Bradshaw's close friends Bill Joyce and Kenny McKay left for Portsmouth and Fulham respectively, while Albert Carnelly joined arch-rivals Millwall.", "|Charlie Dove"]}, {"page": "List of Thames Ironworks F.C. records and statistics", "response": ["|Charlie Dove", "Charlie Dove (10) 1895–1900"]}, {"page": "Dove (surname)", "response": ["* Charlie Dove ((1879–?), English footballer"]}, {"page": "Millwall F.C.–West Ham United F.C. rivalry", "response": ["*  Charlie Dove"]}, {"page": "1900–01 West Ham United F.C. season", "response": ["Many of the playing staff continued with the new club. The likes of Bill Joyce, Kenny McKay and Albert Carnelly had departed, but Tommy Moore, Syd King, Charlie Craig, Charlie Dove, George Neil, Bob Allan, Roddy McEachrane, Fred Corbett, Frankie Taylor and Len Walker all played a part in the season. Players signed from other clubs before the start of the season included Hugh Monteith from Bristol City, Billy Grassam and Jimmy Reid from Burslem Port Vale, Luke Raisbeck from Middlesbrough, Fergus Hunt from Woolwich Arsenal, Fred Fenton from Gainsborough Trinity, and Albert Kaye from Chatham. Walter Tranter, who had played for the Ironworks before spending the previous season at Chatham, was also signed. Tom Robinson, the previous trainer, also remained, and Abe Norris was appointed. Of the former Ironworks players, only Tranter, Craig, Dove, and captain McEachrane, featured in the opening fixture against Gravesend United.", "Former Thames Ironworks club secretary George Neil would play his only game for the new club on 13 October, replacing the injured Bob Allan against Watford. West Ham won 2–0, with goals from Corbett and Fenton, which saw the club placed third in the table after six games. On 3 November, West Ham played their first FA Cup game, a third qualifying round fixture against local amateur club Olympic at the Memorial Grounds. The match was a one-sided affair, with the away team goalkeeper Meates performing well to keep the scoreline at 1–0, after Fenton had scored 10 minutes in with a ball that had appeared to be meant as a cross. After an injury to Charlie Dove, the club signed Willie Kelly from Hamilton Academical. His debut came against Bristol Rovers on 24 November. The Hammers also signed George Ratcliffe from Grimsby Town, then of the Football League Second Division. He scored on his debut against Reading on 1 December.", "The club then embarked on an eight-match unbeaten run, which included victory over Millwall, and would take them through to the season’s penultimate fixture, away to Reading. Grassam scored the last of his 12 league goals in the match, but three goals from the Royals in the second half ended the run. On 28 April, West Ham finished their first season with a 2–0 win over New Brompton. The match marked the final appearance of Charlie Dove – the only player to have remained at the club since its inception as Thames Ironworks six years previously – who left for Millwall. With that win, the Hammers ensured a sixth-place finish.", "|data-sort-value=\"5\"|CH||data-sort-value=\"Dove, Charlie\"|Charlie Dove || 13 || 0 || 3 || 0 || 16 || 0"]}]}}