{"wiki_id": "http://www.wikidata.org/entity/Q5082486", "itemLabel": "Charles Shepherd", "itemDescription": "English photographer and printer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Shepherd_(photographer)", "wikipedia_page": {"main": "Charles Shepherd (fl. 1858–1878) was an English photographer and printer who worked in India in the second half of the 19th century. His photographs include scenes of soldiers and civilians, both English and indigenous.\n\nIn 1862, Shepherd and Arthur Robertson established a photographic studio called Shepherd & Robertson in Agra. The firm moved to Simla in 1864, at which point Samuel Bourne joined the business to work as principal photographer. At about this time, the firm changed its name to Howard, Shepherd & Bourne, and after the departure of Howard it became Bourne & Shepherd around 1868. Shepherd and Bourne opened a second branch in Calcutta (now Kolkata), where they operated a portrait studio, and their work was widely retailed throughout the subcontinent by agents and in Britain through wholesale distributors.Bourne returned to England in 1870, but the firm continued under the Bourne & Shepherd name. He was replaced as head photographer in 1872 by Colin Murray.Shepherd, who had primarily worked as the printer for his firms, finally left Bourne & Shepherd in 1885. Bourne & Shepherd continues to operate in Kolkata.", "link_mentions": [{"page": "List of photographers", "response": ["* Charles Shepherd (fl. 1858–1878)"]}, {"page": "Samuel Bourne", "response": ["Samuel Bourne (30 October 1834 – 24 April 1912)Photographs of India. circa 1862 - circa 1872 - Samuel Bourne Biography Cambridge University Library. was a British photographer known for his prolific seven years' work in India, from 1863 to 1870.Early Photographs and Early Photographers: A Survey in Dictionary Form, by Oliver Mathews. Edition: illustrated. Published by Reedminster Publications, 1973. . Page 37. Together with Charles Shepherd, he set up Bourne & Shepherd first in Shimla in 1863 and later in Kolkata (Calcutta); the company closed in June 2016.http://www.thehindu.com/news/cities/kolkata/Oldest-running-studio-in-the-world-shuts-down/article14433884eceBourne & Shepherd, Esplanade , Kolkata, India - Image FlickrPhotography bastion in a shambles  Indian Express, 19 July 2007.", "He initially set up in partnership with an already established Calcutta photographer, William Howard. They moved up to Simla, where they established a new studio ‘Howard & Bourne’, to be joined in 1864 by Charles Shepherd, to form ‘Howard, Bourne & Shepherd’. By 1866, after the departure of Howard, it became ‘Bourne & Shepherd’, which became the premier photographic studio in India, and until it closed in June 2016  was perhaps the world’s oldest photographic business. Charles Shepherd evidently remained in Simla, to carry out the commercial and portrait studio work, and to supervise the printing and marketing of Bourne’s landscape and architectural studies, whilst Bourne was away travelling around the sub-continent."]}, {"page": "Charles Shepherd", "response": ["Charles Shepherd may refer to:", "*Charles Shepherd (photographer) (died 1878), British photographer", "*Charles Shepherd (character), a character in Ice, a Christian science fiction novel", "*Charles Shepherd (boxer) (born 1970), former British, Commonwealth and World Super Featherweight boxing champion", "*Charles Shepherd (field hockey) (1887–1968), Welsh field hockey player"]}, {"page": "James Robertson (photographer)", "response": ["In 1860, after Felice Beato left for China to photograph the Second Opium War and Antonio Beato went to Egypt, Robertson briefly teamed up with Charles Shepherd back in Constantinople. The firm of Robertson & Beato was dissolved in 1867, having produced images - including remarkable multiple-print panoramas - of Malta, Greece, Turkey, Damascus, Jerusalem, Egypt, the Crimea and India. Robertson possibly gave up photography in the 1860s; he returned to work as an engraver at the Imperial Ottoman Mint until his retirement in 1881. In that year he left for Yokohama, Japan, arriving in January 1882. He died there in April 1888."]}, {"page": "Bourne & Shepherd", "response": ["Though some sources consider its inception to be 1862, when noted British photographer Charles Shepherd established a photographic studio, with Arthur Robertson, called 'Shepherd & Robertson' in Agra,The British Empire from Photographs: India, by John Fabb. Published by Batsford, 1986.Page 16 which later moved to Shimla and eventually became the part of ‘Howard, Bourne & Shepherd’, set up by Samuel Bourne, Charles Shepherd, along with William Howard, first established in Shimla around 1863, Howard's studio in Kolkata dates back to 1840,Magicians of Light: Photographs from the Collection of the National Gallery of Canada, by National Gallery of Canada, James Borcoman. Published by The Gallery, 1993. . 94Re-visioning the Past: Early Photography in Bengal 1875–1915, by Malavika Karlekar. Edition: illustrated. Oxford University Press, 2005. . Page 50-51. at Esplanade Row, in Esplanade, Kolkata (CalcuttaBourne & Shepherd, Esplanade , Kolkata, India – Image FlickrDOWN MEMORY LAN E: Bourne and Shepherd Studio  Indian Express, 19 July 2007. Today some of their earlier work is preserved at Cambridge University Library, the National Portrait Gallery, London, the National Geographic Society's Image Collection and the Smithsonian Institution.Bourne and Shepherd −113 images Smithsonian Institution.", "Samuel Bourne came to India in 1863, and set up a partnership with the Calcutta photographer William Howard, and they set up a new studio 'Howard & Bourne' at Shimla. Meanwhile, Charles Shepherd, had already established a photographic studio, with Arthur Robertson, called 'Shepherd & Robertson' in Agra in 1862, and subsequently he too moved to Shimla in 1864. At some point Robertson left the business and Charles Shepherd, joined Bourne company to form 'Howard, Bourne & Shepherd'. In 1863, he made first of three major Himalayan photographic expeditions, followed by another one 1866, prior to which he took an expedition to Kashmir in 1864, in fact all photographic histories of that era carry his works.Digital Heritage: Applying Digital Imaging to Cultural Heritage, by Lindsay MacDonald. Edition: illustrated. Published by Butterworth-Heinemann, 2006. . Page 566 He was known to travel heavy, as he moved with a large retinue of 42 coolies carried his cameras, darkroom tent and chests of chemicals and glass plates, he was to become one of India's greatest photographers of that era.Samuel Bourne, who went to India in 1863, became one of the great India photographers... Telegraph, 5 February 2001. Charles on the other hand became known as a master printer, he stayed back in Shimla and managed the commercial distribution and printing aspects of the business.The History of Photography from the Earliest Use of the Camera Obscura in the Eleventh Century Up to 1914: From the Earliest Use of the Camera Obscura in the Eleventh Century Up to 1914, by Helmut Gernsheim, Alison Gernsheim. Published by Oxford University Press, 1955.Page 216 Through the 1860s, Bourne's work was exhibited in public exhibition in Europe and was also part of the Paris Universal Exposition in 1867. He also wrote several despatches for 'The British Journal of Photography between' 1863–1870,The British Journal of Photography, by Liverpool Photographic Society. Published by H. Greenwood, 1982. Page 426. and the company became an avid provider of the Indian landscape views to the common visitors to the country and also to Britishers back home,Encyclopedia of Photography: Encyclopedia Photography, by International Center of Photography. Edition: illustrated, Published by Crown, 1984. . Page 75. and not just survived but the thrived in an era of fierce competition between commercial photographers.", "In 1870, the year when Bourne went back to England,The Dictionary of Art, by Jane Turner. Published by Grove, 1996. .Page 587. Bourne and Shepherd were operating from Shimla and Calcutta. Soon he started cotton-doubling business at Nottingham, and founded the Britannia Cotton Mills, and also become a local magistrate. He sold off his shares in studios, and left commercial photography all together; we also left behind his archive of some 2,200 glass plate negatives with the studio, which were constantly re-printed and sold, over the following 140 years, until their eventual destruction, in a fire at Bourne & Shepherd's present studio in Calcutta, on 6 February 1991.Kolkata studio since 1840 After Bourne's departure, new photographic work was undertaken by Colin Murray from 1840 to 84, following which in the 1870s Charles Shepherd continued to photograph and at least sixteen Europeans are listed as assistants.", "Later the Bombay branch was opened in about 1876, operated by Charles Shepherd until his own departure from India around 1879, the branch continued operations till about 1902. In 1880, they even brought their services to as far as Lahore for a month, where they advertised in a local newspaper, in fact newspaper advertising has been a primary reason of the success of many photographers of that era.Samuel Bourne harappa.com. Soon their work was widely retailed throughout the subcontinent by agents and in Britain through wholesale distributors. Between 1870 and 1911 the firm sent photographers to Ceylon (Sri Lanka), Burma, Nepal and Singapore, had also become Art Publishers, with titles like 'Photographs of Architecture of Gujarat and Rajputana' (1904–05),Report for the Year Ended ..., by India Office Library and Records, Published by India Office Library & Records, 1985. Page 25, 99. and were now employing Indian photographers as well.The Corporeal Image: Film, Ethnography, and the Senses, by David MacDougall. Published by Princeton University Press, 2006. . Page 160.", "* Album of early photographs of India, by Charles Shepherd, Samuel Bourne, James Robertson. Published by s.n."]}]}}