{"wiki_id": "http://www.wikidata.org/entity/Q5085511", "itemLabel": "Charlie Short", "itemDescription": "English footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Short", "wikipedia_page": {"main": "Charles Short (after 1866 – after 1891) was an English professional footballer who played in the Football Alliance for Small Heath. He played as a forward.\nShort played football for Birmingham Excelsior before he signed for Small Heath in 1889, and played one game in the Football Alliance in March 1890. He then played a few games for Unity Gas before returning to Small Heath later the same year. Short, a natural goal poacher, played and scored regularly in the 1890–91 Football Alliance season. He also appeared in the 1890–91 FA Cup, taking part in the 8–0 defeat of Hednesford Town and then scoring the opening goal in a 2–0 victory against Wednesbury old Athletic in the Second Qualifying Round. However, following a complaint, it emerged that his registration, which had lapsed after he left the club, had not been renewed for that season's FA Cup, so Small Heath were disqualified from the competition for fielding an unregistered player.Short's older brother George also played professionally for Small Heath.", "link_mentions": [{"page": "Jack Hallam (footballer)", "response": ["In 1890, he moved to Small Heath, then playing in the Football Alliance, and made more than 150 appearances for the club in all competitions. The strength of Hallam's game lay in his speed, and he formed fine partnerships on the right side with both Charlie Short and Billy Walton. In Small Heath's first Football League season, they won the inaugural Second Division championship; Hallam contributed 17 goals, and was only outscored by future England international Fred Wheldon.Matthews, Complete Record, p. 141. He also helped them to runners-up spot and promotion to the First Division the following year and played a further 18 months in the top flight.Matthews, Complete Record, pp. 142–43."]}, {"page": "Arthur Turner (footballer, born 1867)", "response": ["Arthur Samuel Turner (1867 – after 1890) was an English footballer who played in the Football Alliance for Small Heath. Born in Birmingham, Turner joined Small Heath after he was released by Aston Villa without playing for their first team. An inside right, he played one game in Small Heath's second season in the Football Alliance, deputising for Charlie Short in a 4–3 defeat at home to Darwen in November 1890.Matthews, p. 140. He was not retained at the end of the 1890–91 season."]}, {"page": "1890–91 Small Heath F.C. season", "response": ["Small Heath used twenty-two different players in nationally organised competitive matches during the season and had eight different goalscorers. Five players – the full-back pairing of Tom Bayley and Fred Speller and forwards Jack Hallam, Fred Wheldon and captain Will Devey – were ever-present over the 24-match season. The top scorer in the Alliance was centre-forward Charlie Short with 16 goals; if the FA Cup is included, Short and Devey each scored 17.", "New arrivals included forward Charlie Short, who had played one match for Small Heath in March before finishing the season with Unity Gas,Matthews (1995), pp. 123, 140. full-back Tom Bayley from Walsall Town Swifts,Matthews (1995), p. 71. and goalkeeper Charles Partridge from Wednesbury Old Athletic.Matthews (1995), p. 116.", "The Football Alliance fined Small Heath and three other clubs £1 each for not notifying the secretary of their results,Football. The Football Alliance. Birmingham Daily Post. p. 5. 24 October 1890. a minor failure in administrative competence compared with what was to follow. In the second qualifying round of the FA Cup, Small Heath had a harder time than perhaps they expected in beating Wednesbury Old Athletic by two goals. Credit was as much due to Charsley, Speller and Jenkyns in defence as to the goalscorers.Notes on Sport. Birmingham Daily Post. p. 5. 27 October 1890. But their efforts were in vain, as Wednesbury's protest, that Charlie Short had not been registered in time to play in the match, was upheld, and Small Heath were disqualified from the competition.Football Association Challenge Cup. Manchrster Guardian. p. 6. 30 October 1890. The local press was scathing: the Post called it \"quite the most egregious blunder which has been perpetrated in football circles this season\", and supposed that \"the veriest tyro in the winter pastime would have known better than to spoil the club's chances for fame in such an absurd way\".Notes on Sport. Birmingham Daily Post. p. 7. 3 November 1890.", "March began with an even game against Newton Heath. The visitors took the lead early in the first half when the ball was adjudged over the line before Charsley cleared, and Wheldon equalised shortly before the interval. Constant pressing in the second half was repulsed by the Newton Heath defence, and Wheldon failed to convert with only the goalkeeper to beat, then, two minutes from time, Wheldon was successful from a similar position and Small Heath won 2–1.The Alliance. Small Heath v. Newton Heath. Birmingham Daily Post. p. 7. 9 March 1891. Their defence was much weakened by the inclusion of Fred Heath in place of Caesar Jenkyns, and Birmingham St George's won the postponed match quite easily.Football. St. George's v. Small Heath. Birmingham Daily Post. p. 7. 17 March 1891. At home to Bootle, Ward came in for Charsley in goal, and Albert Evers, making his league debut, and Charsley's brother Walter came in to the half-back line instead of Heath and the still-absent Jenkyns.Alliance Matches. Small Heath v. Bootle. Birmingham Daily Post. p. 7. 23 March 1891. The scores were level at one apiece until nearing half-time, when Charlie Short scored three goals in as many minutes; another three in the second half, for Devey, Hands and Wheldon, secured a 7–1 win and lifted Small Heath to ninth place in the table.The Alliance. Bootle v. Smallheath. Liverpool Mercury. p. 7. 23 March 1891.", ": * Small Heath disqualified for fielding the unregistered player Charlie Short"]}, {"page": "Ronnie Chamberlain", "response": ["Chamberlain was an early member of the Jive Bombers., from an article in Jazz Journal.  He also recorded with four different line-ups of the Melody Maker All-Stars (1951, 1952, 1954 & 1955) coinciding with, variously, many of the major names in British jazz, including Kenny Baker (tp), Gordon Langhorn (tb), Henry McKenzie (cl), Ronnie Scott (ts), Johnny Dankworth (as), Dave Shand (bs), Victor Feldman (vib), Ralph Sharon (p), Ivor Mairants (g), Charlie Short (b), Jack Parnell (d), Jackie Armstrong (tb), Vic Ash (cl), Les Gilbert (as), Martin Slavin (vib), Bill McGuffie (p), Johnny Hawksworth (b), Don Lusher (tb), Harry Klein (bs), Tito Burns (acc), Eric Delaney (d), Keith Christie (tb), Tommy Whittle (ts), Bert Weedon (g), Joe Muddel (b), and Joe Harriott (as)."]}, {"page": "1889–90 Small Heath F.C. season", "response": ["New arrivals included forward Charlie Short, who had played one match for Small Heath in March before finishing the season with Unity Gas, full-back Tom Bayley from Walsall Town Swifts, and goalkeeper Charles Partridge from Wednesbury Old Athletic.Matthews (1995), pp. 71, 116, 123, 140. The club decided to change to a new kit – a plain royal blue shirt and stockings with white knickerbockers – because the black kit had proved difficult to see for players and spectators alike."]}]}}