{"wiki_id": "http://www.wikidata.org/entity/Q5084503", "itemLabel": "Charlie Bates", "itemDescription": "English footballer (1889-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Bates", "wikipedia_page": {"main": "Charles Bates (1889 – 20 March 1937) was an English professional footballer who played as a centre forward. After his retirement from football, Bates qualified as a chiropodist.\nAs a youth, Bates played local football in the Birmingham leagues. He later had a spell with Darlington, before joining Football League Second Division side Burnley in May 1910. He made his debut for the club on 3 December 1910 in the 2–1 win over Leicester Fosse at Turf Moor, in place of Tommy Mayson, and kept his place in the team for the next two matches. After four games out of the team Bates was selected for the first match of 1911, away at Glossop, and scored his first League goal in the 1–1 draw. He scored twice in the following game, securing a 2–1 victory against Huddersfield Town with a penalty kick four minutes from time. During the remainder of the season Bates made sporadic appearances for Burnley; his two goals in the 5–3 win against Stockport County on 18 March 1911 meant he ended the campaign with a record of 5 goals in 13 games.Hampered by injury, Bates played just two first-team matches for Burnley during the 1911–12 season. His final league appearance for the club came on 9 December 1911 in the 5–1 win away at Leeds City. Following his retirement from professional football in 1912, he was appointed assistant trainer at Burnley, and in 1919 he was promoted to senior trainer after the departure of Ernest Edwards. Bates acted as trainer to the England national team for the 1–2 defeat to Wales at Turf Moor on 28 November 1927. He left Burnley in 1934, later becoming trainer at Newport County, before returning to live in Burnley.", "link_mentions": [{"page": "Billy Dougall", "response": ["After studying physiotherapy, Dougall was appointed as a coach at Football League Third Division South outfit Thames before moving to Charlton Athletic to become the assistant manager. In 1932 he returned to Turf Moor as the reserve team coach and went on to succeed Charlie Bates as first team coach two years later. Following the resignation of manager Tom Bromilow in 1935, Dougall was part of a selection committee that managed Burnley for four seasons until football in England was suspended due to the outbreak of the Second World War."]}, {"page": "Jonathon Woods", "response": ["Jonathon Woods (1889 – after 1911) was an English professional footballer who played as a forward. He played for his hometown club Workington before joining Football League Second Division side Burnley in January 1911. Woods made his league debut for Burnley on 20 March 1911, deputising at for centre forward Charlie Bates in the 1–3 loss to Bolton Wanderers at Turf Moor.Simpson (2007), pp. 120–121 He made one further appearance for the club, playing at outside-left in the 0–1 defeat away at Gainsborough Trinity on 6 January 1912.Simpson (2007), pp. 124–125 Woods left Burnley shortly afterwards."]}, {"page": "Chanute Athletics", "response": ["|1947 || 44–80 ||.354|| Dave Dennis/Charlie Bates ||7th|| None", "|1949 || 65–60 ||.520|| James Hansen/Charlie Bates ||5th|| None", "|1950 ||35–89 ||.282|| Charlie Bates/Thomas Imfeld/Chuck Hostetler ||8th|| None", "* Charlie Bates (1947, 1949-1950, MGR)"]}]}}