{"wiki_id": "http://www.wikidata.org/entity/Q5084697", "itemLabel": "Charlie Chuck", "itemDescription": "British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Chuck", "wikipedia_page": {"main": "Charlie Chuck is the stage name of British comedian David Kear.", "link_mentions": [{"page": "Malcolm Hardee", "response": ["Hardee was also renowned as a talent spotter and owner of clubs which gave vital early exposure to up-and-coming comedians including Charlie Chuck, Alan Davies, Harry Enfield, Harry Hill, Paul Merton, Vic Reeves, Frank Skinner, Johnny Vegas and Jo Brand, with whom he had a two-year affair and whom he persuaded to become a comedian. He hosted the first-ever outing of the new circus group Ra-Ra Zoo, who performed comedy mime to a, for once, silenced audience. He also worked for a time as the manager of Jerry Sadowitz and was an occasional promoter and tour manager for his friend and neighbour Jools Holland."]}, {"page": "28 Acts in 28 Minutes", "response": ["* Charlie Chuck"]}, {"page": "The Smell of Reeves and Mortimer", "response": ["Played by comedian Charlie Chuck, Uncle Peter was a big-haired, battered-suit wearing lunatic with a bizarre gait and an unnerving habit of shouting incomprehensibly (\"DONKEY!\") He was in a band, which featured himself and an unidentified piano player played by Trevor Peacock. The band saw Peter shout random nonsense before completely destroying his drumkit. Peter was always wary of being sent back \"to t'dark place\" by the duo."]}, {"page": "David Kear", "response": ["#REDIRECT Charlie Chuck"]}, {"page": "Nozstock: The Hidden Valley", "response": ["The comedy stage has hosted names such as Reginald D. Hunter, Seann Walsh, Russell Howard, Henning Wehn, Richard Herring, Howard Marks, Josh Widdicombe, Cardinal Burns, Phil Kay, The Rubberbandits, Brendan Burns, Devvo, Charlie Chuck, Stephen Frost of Whose Line is it Anyway? fame."]}, {"page": "Dean Wilkinson", "response": ["His first TV scripts were performed by Charlie Chuck (Uncle Peter from The Smell of Reeves and Mortimer) on The James Whale Show."]}, {"page": "Foxwood School, Seacroft", "response": ["*Charlie Chuck (the stage name of David Kear) is a comedian and musician."]}]}}