{"wiki_id": "http://www.wikidata.org/entity/Q5083713", "itemLabel": "Charles Woollcombe", "itemDescription": "British army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Woollcombe", "wikipedia_page": {"main": "Lieutenant General Sir Charles Louis Woollcombe  (23 March 1857 – 6 May 1934) was a British Army General during World War I.", "link_mentions": [{"page": "Battle of Cambrai (1917)", "response": ["The battle began at dawn, approximately 06:30 on 20 November, with a predicted bombardment by  on German defences, followed by smoke and a creeping barrage at  ahead to cover the first advances. Despite efforts to preserve secrecy, the Germans had received sufficient intelligence to be on moderate alert: an attack on Havrincourt was anticipated, as was the use of tanks. The attacking force was six infantry divisions of the III Corps (Lieutenant-General Pulteney) on the right and IV Corps (Lieutenant-General Charles Woollcombe) on the left, supported by nine battalions of the Tank Corps with about  In reserve was one infantry division in IV Corps and the three divisions of the Cavalry Corps (Lieutenant-General Charles Kavanagh). Initially, there was considerable success in most areas and it seemed as if a great victory was within reach; the Hindenburg Line had been penetrated with advances of up to . On the right, the 12th (Eastern) Division advanced as far as Lateau Wood before being ordered to dig in. The 20th (Light) Division forced a way through La Vacquerie and then advanced to capture a bridge across the Canal de Saint-Quentin at Masnières. The bridge collapsed under the weight of a tank halting the hopes for an advance across the canal. In the centre the 6th Division captured Ribécourt and Marcoing but when the cavalry passed through late, they were repulsed from Noyelles."]}, {"page": "11th (Northern) Division", "response": ["* Lieutenant General Sir Charles Woollcombe (July–December 1916)"]}, {"page": "IV Corps (United Kingdom)", "response": ["* 1916–1918 Lieutenant-General Charles WoollcombeThe Cambrai operations"]}, {"page": "Order of the White Eagle (Serbia)", "response": ["* Charles Woollcombe"]}, {"page": "Order of battle for the Battle of the Somme", "response": ["| style=\"background:#FFFFCC;\" |11th (Northern) Division   ||colspan=\"2\" |Major-General Charles Woollcombe"]}, {"page": "Eastern Command (United Kingdom)", "response": ["*1914 – 1915 Lieutenant General Sir Charles Woollcombe", "*1918 – 1919 Lieutenant General Sir Charles Woollcombe"]}, {"page": "Charles Louis Woollcombe", "response": ["#REDIRECT Charles Woollcombe"]}, {"page": "Capture of Stuff Redoubt", "response": ["On the right flank of the II Corps (Lieutenant-General Claud Jacob), the 11th (Northern) Division (Lieutenant-General Charles Woollcombe) was to capture Hessian Trench on top of the ridge and Stuff Redoubt; if possible patrols were to be sent forward to take Stuff Trench. The 34th Brigade (Brigadier-General J. Hill) on the right would have to capture Mouquet Farm, advance up the old German second position trenches to Zollern Redoubt and thence to Stuff Redoubt. Two tanks were attached, to move from positions west of Pozières, arrive at Mouquet Farm at zero hour and then drive north onto the second position. On 28 September the Reserve Army issued instructions that Stuff and  redoubts were to be captured by 29 September and Stuff Trench on 1 October."]}, {"page": "Woollcombe", "response": ["*Charles Woollcombe KCB KCMG (1857–1934), British Army General during World War I"]}, {"page": "Woollcombe, Charles", "response": ["#redirectCharles Woollcombe"]}, {"page": "John Irvine Murray", "response": ["Their daughter Agnes Meade Murray married Lt.-Gen. Sir Charles Woollcombe, and had two sons and a daughter. Agnes's younger son was killed in action in the First World War while serving with the  King's Own Scottish Borderers at the Battle of La Bassée. Their daughter, Brigadier Mary Stewart Murray  of the Salvation Army, was decorated for her work in the Second Boer War and was awarded the Mons Star in the First World War."]}]}}