{"wiki_id": "http://www.wikidata.org/entity/Q5082357", "itemLabel": "Charles Saumarez Smith", "itemDescription": "British art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Saumarez_Smith", "wikipedia_page": {"main": "Sir Charles Robert Saumarez Smith  (born 28 May 1954) is a British cultural historian specialising in the history of art, design and architecture. He was the Secretary and Chief Executive of the Royal Academy of Arts in London from 2007 until he stepped down in 2018. He was replaced by Axel Rϋger, who took up the position in 2019.Before, he was director of the National Portrait Gallery from 1994 to 2002 and director of the National Gallery from 2002 to 2007. He has published various articles and books, including The Company of Artists:The Origins of the Royal Academy of Arts in London and was a judge at the World Architecture Festival 2014 in Singapore and the Young Masters 2014 awards in London.\nSaumarez Smith was knighted in the 2018 Queen's Birthday Honours List.", "link_mentions": [{"page": "May 28", "response": ["*  1954   – Charles Saumarez Smith, English historian and academic"]}, {"page": "National Gallery", "response": ["In the 21st century there have been three large fundraising campaigns at the Gallery: in 2004, to buy Raphael's Madonna of the Pinks, in 2008, for Titian's Diana and Actaeon, and in 2012, Titian's Diana and Callisto. Both Titians were bought in tandem with the National Gallery of Scotland for £95 m. Both of these major works were sold from the collection of the Duke of Sutherland. The National Gallery is now largely priced out of the market for Old Master paintings and can only make such acquisitions with the backing of major public appeals; the departing director Charles Saumarez Smith expressed his frustration at this situation in 2007.", "|Sir Charles Saumarez Smith||2002–2007"]}, {"page": "Rolf Harris", "response": ["In 2001 and 2004, Harris presented Rolf on Art, a television series that highlighted the work of a selection of his favourite artists, including van Gogh, Degas, Monet and Gauguin. In November and December 2002, under the direction of Charles Saumarez Smith, London's National Gallery exhibited a collection of Harris's art."]}, {"page": "Royal Academy of Arts", "response": ["In September 2007, Sir Charles Saumarez Smith became Secretary and Chief Executive of the Royal Academy, a newly created post. Saumarez Smith stepped down from the role at the end of 2018, and it was announced that Axel Rüger, director of the Van Gogh Museum in Amsterdam, would fill the position from June 2019."]}, {"page": "Queen Mary University of London", "response": ["*Charles Saumarez Smith – British art historian"]}, {"page": "Gresham College", "response": ["* 2001: Dr Charles Saumarez Smith – 'Commerce and Culture in the Late Twentieth Century'"]}, {"page": "National Portrait Gallery, London", "response": ["*1994–2002: Charles Saumarez Smith"]}, {"page": "Anthony Caro", "response": ["Caro was 89 when he died of a heart attack on 23 October 2013. He was lauded as a \"gentle man with a pioneering spirit\" by BBC arts editor Will Gompertz and \"one of the greatest sculptors in the second half of the twentieth century\" by Royal Academy of Arts chief executive Charles Saumarez Smith."]}, {"page": "Slade Professor of Fine Art", "response": ["* Charles Saumarez Smith (2001–02)"]}, {"page": "Charles Smith", "response": ["*Charles Saumarez Smith (born 1954), British art historian"]}, {"page": "Museums Association", "response": ["The MA is governed by a board of trustees, from all parts of the UK museum community, elected by members. In April 2018, Maggie Appleton replaced David Fleming as president; she is also the CEO of the RAF Museum. Previous presidents include David Anderson, David Fleming, Stuart Davies, Charles Saumarez Smith, Jane Glaister, Max Hebditch, Barbara Woroncow and Virginia Tandy."]}, {"page": "Art UK", "response": ["*Dr Charles Saumarez Smith"]}, {"page": "Nicholas Penny", "response": ["Between 1984 and 1989 Penny was keeper of the department of Western art at the Ashmolean Museum, Oxford and professorial fellow of Balliol College, Oxford. In 1990 he began a long association with the National Gallery, joining the institution as Clore Curator of Renaissance Painting. Shortly afterwards, in 1991, he identified the Madonna of the Pinks belonging to the Duke of Northumberland as a genuine Raphael, and not a copy of a lost original as was previously supposed. The painting came to public prominence in 2002 when the Gallery undertook a major fundraising campaign in order to prevent the painting's sale to the Getty Center in Los Angeles. Earlier that year Penny made an unsuccessful bid for the directorship of the National Gallery, the post going to Charles Saumarez Smith. Again in 2002, Penny was appointed senior curator of sculpture at the National Gallery of Art in Washington, D.C. Following Saumarez Smith's early resignation from his post, Penny was once again a candidate for heading the London National Gallery, and this time he succeeded."]}, {"page": "St Ronan's School", "response": ["* Charles Saumarez Smith, British cultural historian specialising in the history of art, design and architecture"]}, {"page": "List of Old Marlburians", "response": ["* Charles Saumarez Smith, art historian, former Director of the National Gallery"]}, {"page": "Liberatum", "response": ["Notable figures who have attended and taken part in Liberatum events include Peter Donohoe, Stephen Frears, Sir Norman Rosenthal, Charles Saumarez Smith, Shekhar Kapur, Valery Gergiev, Thomas Ades, Tilda Swinton, Pharrell Williams, Kirsten Dunst, Michael Nyman, Michael Stipe, Philip Treacy, Sir VS Naipaul, Zaha Hadid, Daphne Guinness, Wole Soyinka, Richard Branson, Annie Lennox, Clare Short, Shabana Azmi, Marianne Faithfull, Shashi Tharoor, Courtney Love, Gore Vidal and Goldie Hawn.'Michael Douglas, Sharon Stone and Zoe Saldana on Board to Launch Liberatum Conversation Series', 'The Hollywood Reporter', 8 August 2020"]}, {"page": "Adam Birtwistle", "response": ["Dr Charles Saumarez Smith, secretary and chief executive of the Royal Academy and formerly director of the National Gallery, regarded Adam Birtwistle as “one of the best of his generation” (*), while art critic Godfrey Barker called him “…one of our most distinguished portrait painters in what is, presently, a Golden Age of Portraiture in Britain.”"]}, {"page": "Artparks Sculpture Park", "response": ["It shows up to 200 mostly contemporary sculptures every year by approximately 70-80 artists from the United Kingdom and around the world.  It was opened by Charles Saumarez Smith CBE, who at the time was the director of the National Portrait Gallery in London.  The selection of sculpture is set in a sub tropical garden and changes every year with a grand opening, usually around the third week in May. Amenities include free parking, a bus stop and a cafe."]}]}}