{"wiki_id": "http://www.wikidata.org/entity/Q5083049", "itemLabel": "Charles Turner", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Turner_(composer)", "wikipedia_page": {"main": "Charles Turner (1907 – 1977) was an English composer and part-time spy, who took the last recorded British pre-World War II photographs of Adolf Hitler.\nBorn in the early 1900s, Turner's life changed when his father died and his godfather Henry Pelham, 7th Duke of Newcastle took care of the young boy. Turner attended Worksop College, the public school endowed by the Duke of Newcastle. He gained a place at Cambridge university to study music. In the late 1920s into the 1930s he became a broadcast composer and fluent German speaker.\nIn 1934 Turner made the first of a series of annual visits to the Wagner festival in Bayreuth in Bavaria. In 1938 the British secret service MI5, convinced war was imminent, needed to urgently examine and assess the German threat. Approached by mutual friend Alan Angles, later of the War Office and Directorate of Ministry of Aircraft Production, Turner was recruited to infiltrate Hitler's entourage at the 1939 Bayreuth Festival. Registered as a guest of the Führert, Turner was hosted by Dr Fritz streit Chairman of the Bavarian Chamber of Commerce, through whom he received an invitation to follow the Führer's itinerary on Wednesday 26 July 1939. This unexpected opportunity allowed Turner to photograph Hitler and his intimates throughout the day. He took photographs of Hitler and other leading Nazis including propaganda Minister Joseph Goebbels, Hitler's Deputy, Rudolf Hess and \"Strength Through Joy\" leader Dr Robert Ley. Turner subsequently delivered a report back to London which is still regarded as top secret, if indeed it still exists.\nHaving married in 1941 and started a family, Turner's work post war often took him to Moscow. Reportedly on one occasion he took his son on tour of a housing estate in a search for the British spy Kim Philby. This may mean that Turner was still working in the interests of British Intelligence. His son is at pains to say that his father may have gathered Intelligence but was never a spy.\nCharles Turner died in 1977, and his photographs of Hitler were released to the public in 2007.", "link_mentions": [{"page": "Charles Turner", "response": ["Charles Turner may refer to:", "*Charles Turner Jr. (1760–1839), U.S. Representative from Massachusetts", "*Charles Turner (MP) (1803–1875), MP for Liverpool, South Lancashire and South West Lancashire", "*Sir Charles Turner, 1st Baronet, of Warham (1666–1738), British Member of Parliament for King's Lynn, 1695–1738", "*Sir Charles Turner, 1st Baronet, of Kirkleatham (c. 1727–1783), British Member of Parliament for York, 1768–1783", "*Sir Charles Turner, 2nd Baronet (1773–1810), British Member of Parliament for Hull, 1796–1802", "*Charles Turner (Canadian politician) (1916–1993), Liberal MP for London East, then Senator from Ontario", "*Charles Turner (engraver) (1774–1857), English engraver", "*Charles Turner (composer) (1907–1977), minor English composer, who took the last pre-war photographs of Hitler", "*Charles Turner (musician) (1936–2006), American jazz trumpeter", "*Charles Turner (engineer) (1901–1994), New Zealand mechanical and civil engineer, engineering administrator and consultant", "*Charles Turner (Australian cricketer) (1862–1944), Australian cricketer", "*Charles Turner (English cricketer) (1862–1926), English cricketer", "*Charles Turner (water polo) (born 1953), Australian water polo player in the 1980 and 1984 Olympics", "*Charles Turner (British Army officer) (died 1826), British soldier and colonial administrator", "*Charles Turner (bishop) (1842–1923), suffragan Bishop of Islington", "*Charles Turner (merchant) (1773?–1856), British businessman, now known as a collector and gardener"]}, {"page": "David Leisner", "response": ["Leisner is co-chairman of the guitar department at the Manhattan School of Music. He taught at the New England Conservatory for twenty-two years. A graduate of Wesleyan University, he studied guitar with John Duarte, David Starobin, and Angelo Gilardino and composition with Richard Winslow, Virgil Thomson, Charles Turner, and David Del Tredici."]}, {"page": "1977 in British music", "response": ["**Charles Turner, composer and spyA day at the opera with Hitler: the secret agent who captured rare moments for MI5 | The Guardian | Guardian Unlimited"]}, {"page": "Lee Venora", "response": ["She made her Broadway debut as Molly Bixby in October 1959 in the short-lived musical Happy Town. On March 14, 1960, she performed the world premiere of four song cycles, one each by composers Stanley Hollings-Worth, Paul Ramsier, Charles Turner, and Lee Hoiby respectively, in recital at Carnegie Hall. In January 1961 she sang the role of Drusilla in Claudio Monteverdi's L'incoronazione di Poppea with the American Opera Society under conductor Nicola Rescigno. The following June she sang Zerbinetta in Strauss's Ariadne auf Naxos at the Cincinnati Opera with Eleanor Steber in the title role, and in July she was seen as Leïla in Bizet's Les pêcheurs de perles at the Empire State Music Festival. In November 1961 she returned to Broadway as Anna Danby in Robert Wright and George Forrest's Kean. She also sang on the cast recording of the show made with Columbia Records."]}, {"page": "1907 in British music", "response": ["*date unknown – Charles Turner, composer and Second World War spy (died 1977)"]}]}}