{"wiki_id": "http://www.wikidata.org/entity/Q5081954", "itemLabel": "Charles Read", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Read_(mathematician)", "wikipedia_page": {"main": "Charles John Read (16 February 1958 – 14 August 2015) was a British mathematician known for his work in functional analysis. In operator theory, he is best known for his work in the 1980s on the invariant subspace problem, where he constructed operators with only trivial invariant subspaces on particular Banach spaces, especially on \n  \n    \n      \n        \n          ℓ\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle \\ell _{1}}\n  . He won the 1985 Junior Berwick Prize for his work on the invariant subspace problem.Read has also published on Banach algebras and hypercyclicity; in particular, he constructed the first example of an amenable, commutative, radical Banach algebra.\nAt the time of his death, Read was a Professor of Pure Mathematics at the University of Leeds after having been a fellow of Trinity College, Cambridge for several years. He completed his PhD thesis entitled Some Problems in the Geometry of Banach Spaces at the University of Cambridge under the supervision of Béla Bollobás. He died in Winnipeg in August 2015 while on a research visit at the University of Manitoba.", "link_mentions": [{"page": "Invariant subspace", "response": ["In the more general case where V is assumed to be a Banach space, there is an example of an operator without an invariant subspace due to Per Enflo (1976).  A concrete example of an operator without an invariant subspace was produced in 1985 by Charles Read."]}, {"page": "Béla Bollobás", "response": ["Bollobás's research students have included Keith Ball at Warwick, Graham Brightwell at LSE, Timothy Gowers (who was awarded a Fields Medal in 1998 and is Rouse Ball Professor of Mathematics), Imre Leader at the University of Cambridge, Jonathan Partington at Leeds, and Charles Read at Leeds, who died in 2015."]}, {"page": "Read (surname)", "response": ["* Charles Read (1840–1890), U.S. and Confederate naval officer", "* Charles Read (1958–2015), British mathematician", "* Charles Read (squash player) (fl. 1920s), English"]}, {"page": "Charles Read", "response": ["Charles Read may refer to:", "* Charles Read (Australian politician) (1814–1910), politician in Geelong, Victoria, Australia", "* Charles Read (Medal of Honor) (1840–?), American Civil War sailor and Medal of Honor recipient", "* Charles Read (naval officer) (1840–1890), American, lieutenant in the Confederate States Navy", "* Charles Read (squash player) (1889–?), British professional squash player", "* Charles Read (RAAF officer) (1918–2014), commander in the Royal Australian Air Force", "* Charles Read (mathematician) (1958–2015), British mathematician", "* Charles Read (Philadelphia) (died 1736), merchant and mayor of Philadelphia", "* Charles Reade (disambiguation)"]}, {"page": "2015 in the United Kingdom", "response": ["**Charles Read, 57, mathematician."]}, {"page": "Deaths in August 2015", "response": ["*Charles Read, 57, British mathematician.Professor Charles Read"]}]}}