{"wiki_id": "http://www.wikidata.org/entity/Q5081730", "itemLabel": "Charles Powlett", "itemDescription": "English cricketer (1728-1809)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Powlett", "wikipedia_page": {"main": "The Reverend Charles Powlett (1728 – 29 January 1809) was a noted patron of English cricket who has been described as the mainstay, if not the actual founder, of the Hambledon Club.  Powlett held an important position in the administration of cricket and was a member of the committee which revised and codified the Laws of Cricket in 1774.Powlett (sometimes spelled Paulet) was the eldest son, born illegitimately, of Charles Powlett, 3rd Duke of Bolton and Lavinia Fenton, who were not married until 1751 when he was 23.  Powlett was educated at Westminster School and Trinity College, Cambridge, where he graduated as MA in 1755.  Having been ordained, he was Curate of Itchen Abbas from 1763 to 1792; and Rector of St Martin-by-Looe in Cornwall from 1785 to 1790.Powlett acted as a Steward at Hambledon, was \"the life and soul of the club for many years\" and \"when the end came, was the last to abandon the sinking ship\". He died in Marylebone, London.\nDespite being ordained and a Steward of the club and a member of the Laws of Cricket committee, Powlett was not above gambling on the outcome of matches or of betting against his own team.  In 1775, when Hambledon/Hampshire hosted Surrey on Broadhalfpenny Down, the match situation at one point of the Hampshire second innings was such that a Surrey victory seemed certain.  Powlett and his associate Philip Dehany, another Hambledon member, decided to bet heavily on Surrey to win.  But then John Small was joined at the wicket by his captain Richard Nyren and the two put on a massive century partnership which turned the game around.  Nyren was out for 98 and Small went on to make 136, which is the earliest known century in the history of first-class cricket.  Surrey then collapsed and Hampshire won a famous victory.  When Nyren was out, he was confronted by Powlett and Dehaney who complained that he and Small had cost them their money.  Nyren, disgusted with them, retorted: \"Another time, don't bet your money against such men as we are\".", "link_mentions": [{"page": "Laws of Cricket", "response": ["On Friday, 25 February 1774, the Laws were revised by a committee meeting at the Star and Garter. Chaired by Sir William Draper, the members included prominent cricket patrons the 3rd Duke of Dorset, the 4th Earl of Tankerville, Charles Powlett, Philip Dehany and Sir Horatio Mann. The clubs and counties represented were Kent, Hampshire, Surrey, Sussex, Middlesex and London."]}, {"page": "Paulet", "response": ["*Charles Powlett, 3rd Duke of Bolton (1685–1754)", "*Charles Powlett, 5th Duke of Bolton (1718–1765)", "*Charles Powlett (1728–1809), English clergyman and cricket administrator"]}, {"page": "Lavinia Fenton", "response": ["She appeared in several comedies, and then in numerous repetitions of the Beggar's Opera. After her last appearance as Polly on 19 April 1728, she ran away with her lover Charles Powlett, 3rd Duke of Bolton, a man twenty-three years older than herself, who, after the death of his wife in 1751, married her at Aix-en-Provence. John Gay discussed her marriage in a letter to Jonathan Swift: \"The Duke of Bolton, I hear, has run away with Polly Peachum, having settled £400 a year on her during pleasure, and upon disagreement £200 a year.\" They already had three sons: Charles, Percy, and Horatio Armand,G.E. Cokayne; with Vicary Gibbs, H.A. Doubleday, Geoffrey H. White, Duncan Warrand and Lord Howard de Walden, editors, The Complete Peerage of England, Scotland, Ireland, Great Britain and the United Kingdom, Extant, Extinct or Dormant, new ed., 13 volumes in 14 (1910-1959; reprint in 6 volumes, Gloucester, U.K.: Alan Sutton Publishing, 2000), volume II, page 213. who entered the church, the navy, and the army respectively. The duchess survived her husband and died in 1760 at Westcombe House in Greenwich, being buried in St Alfege's Church, Greenwich on 3 February 1760. Peachum Road, close to the site of Westcombe House, was named after her role as Polly Peachum."]}, {"page": "Kingsclere", "response": ["The actress Lavinia Fenton, most famous for her role as the first Polly Peachum in John Gay's The Beggar's Opera, was lover and then wife of Charles Powlett, 3rd Duke of Bolton of the parish. Their eldest son, Rev. Charles Powlett, was briefly vicar of Kingsclere.", "3rdDukeOfBolton.jpg|Lt-Gen. Charles Powlett (Paulet), 3rd Duke of Bolton & 8th Marquess of Winchester, KG, PC (1685–1754).Constable of the Tower of London and lord-lieutenant of the Tower Hamlets. Seemingly from near today's Anchor road showing the duke in front of the pre-1848 church of St. Mary's, Kingsclere, and the back of Swan street. This picture is now in the Government Art Collection on loan to the Royal Armories in Leeds.  Possibly painted by James Seymour, but probably not.", "*The Reverend Charles Powlett, (1728-1809),Eldest natural son of the 3rd Duke of Bolton by Lavinia Fenton. Vicar of Kingsclere, 19 July 1769 - 15 February 1773. Chaplain to his nephew dukes of Bolton. Cricket pioneer.One of the committee which revised the laws of cricket, at the Star and Garter in Pall Mall, February 25, 1774 and a renowned Hampshire hunting man. Author of many hunting songs. (http://db.theclergydatabase.org.uk/)", "*Thomas Orde-Powlett, 1st Baron Bolton, PC (1740 – 1807),  MP (1780–1796). Governor of the Isle of Wight (1791–1807) and Lord Lieutenant of Hampshire (1800–1807), inherited (c. 1794) estates, including Hackwood Park, Bolton Castle and Bolton Hall, of the Dukes of Bolton through his wife, Jean Mary Browne-Powlett, love-child, natural, illegitimate daughter of Charles Powlett, 5th Duke of Bolton KB, PC (c. 1718 – 1765)."]}, {"page": "Broadhalfpenny Down", "response": ["The 1772 season is notable in English cricket history because it is from then that surviving scorecards are common and three exist of 1772 matches organised by the Hambledon Club which commence a continuous statistical record. Those three matches were all between a Hampshire XI and an England XI, the first played at Broadhalfpenny on 24 and 25 June. The two leading online archives begin their first-class coverage with this match which is numbered \"first-class no.1\" by ESPNcricinfo and \"f1\" by CricketArchive.alt=Cricket pavilion with players watching on a summers day|thumb|Broadhalfpenny Down Pavilion in Summer 2019On 13 July 1775, Small scored 136 not out and Nyren 98 for Hampshire against Surrey at Broadhalfpenny and Small's innings is the earliest known century in first-class cricket.Underdown, p. 112. Despite being ordained, a Steward of the Hambledon Club and a member of the Laws of Cricket committee, the Reverend Charles Powlett was not above gambling on the outcome of matches or of betting against his own team. At one point in the match against Surrey, the situation was such that a Surrey victory seemed certain. Powlett and his associate Philip Dehaney, another Hambledon member, decided to bet heavily on Surrey to win. Then Small was joined at the wicket by his captain Nyren and the two put on a massive century partnership which turned the game around, for Surrey collapsed and Hampshire won a famous victory. When Nyren was out, he was confronted by Powlett and Dehaney who complained that he and Small had cost them their money. Nyren, disgusted with them, retorted: \"Another time, don't bet your money against such men as we are.\"Underdown, p. 118.alt=Batsman hits out in front of the Bat & Ball public house|thumb|Batsman hits out in front of the Bat & Ball public houseBroadhalfpenny Down continued in regular use by Hambledon/Hampshire teams until 1781. At the end of that season, the Hambledon Club moved to Windmill Down, which is closer to the village. According to John Nyren, Windmill was \"one of the finest places for playing on I ever saw\".Underdown, p. 152. A key difference was that Windmill was under the club's control as they rented it from a farmer at ten guineas a year, whereas Broadhalfpenny was common land in use as sheep pasture, for fairs and other gatherings. It could be said that Broadhalfpenny belonged to the community and Windmill to the club, whose members may not have been happy about the \"raucous, boisterous crowds that gathered (on the Down)\". The move was done at the behest of the Duke of Dorset, chief among club members, and David Underdown saw it as the first step in a process which removed professional cricket from a truly rural setting and ultimately concentrated it in an urban environment, for it was Dorset's successors George Finch, 9th Earl of Winchilsea and Colonel Charles Lennox who were the key players in the establishment of the White Conduit Club in Islington and subsequently Marylebone Cricket Club at Lord's.Underdown, p. 153."]}, {"page": "Richard Nyren", "response": ["Nyren made 4 known first-class appearances in 1775, but did not take part in one of the most famous matches in history. This was the single wicket \"fives\" game at the Artillery Ground when a Hambledon Five defeated a Kent Five by one wicket, the not out batsman being John Small who was beaten three times by Lumpy Stevens, only for the ball to go through the two-stump wicket without disturbing the bail. As a result of Lumpy's protests, the middle stump was legalised, though its introduction was gradual.Haygarth, p. 21-22. However, Nyren did play against Surrey at Broadhalfpenny Down on 13 July and made his highest known score of 98, sharing a century partnership with Small for the 5th wicket and turning the match in Hampshire's favour. Small went on to make 136, the earliest definitely recorded century in the history of first-class cricket, and Hampshire eventually won by 296 runs having looked certain to lose before Nyren and Small came together.Haygarth, p. 25. When Nyren was out, he was confronted by Hambledon stewards Charles Powlett and Philip Dehaney who had bet heavily against Hampshire when the match looked lost. They remonstrated that they would lose their money because of Nyren and Small, but Nyren told them he was glad and said: \"Another time, don't bet your money against such men as we are\".Mote, p. 88.  It may be added that Powlett was a Reverend and that both he and Dehaney had been on the committee which revised the Laws of Cricket only the previous year.", "The success of Hambledon owed much to the co-operation of its subscribing members on one hand and the players on the other. Just as Nyren, supported by Small and others, was the principal figure in the team, the mainstays among the membership were the Reverend Charles Powlett, Philip Dehany and John Richards.Ashley-Cooper, pp. 148–156. After Nyren finished playing he became the Club Secretary, working closely with Richards who was the Treasurer.Ashley-Cooper, p. 156. They tried to keep things going in rural Hampshire but, as Ashley-Cooper points out in respect of Powlett, \"found destiny too strong\".Ashley-Cooper, p. 21."]}, {"page": "Charles Powlett, 3rd Duke of Bolton", "response": ["Charles Powlett (sometimes spelled Paulet), 3rd Duke of Bolton  (3 September 168526 August 1754), styled Earl of Wiltshire from 1685 until 1699, and Marquess of Winchester from 1699 until 1722, was a British Whig politician who sat in the English House of Commons from 1705 to 1708 and in the British House of Commons between 1708 and 1717 when he was raised to the peerage as Lord Powlett and sat in the House of Lords..", "Winchester, Charles Powlett, Marquess of", "Winchester, Charles Powlett, Marquess of", "Winchester, Charles Powlett, Marquess of", "Winchester, Charles Powlett, Marquess of", "Winchester, Charles Powlett, Marquess of"]}, {"page": "Charles Paulet", "response": ["*Charles Powlett, 3rd Duke of Bolton (1685–1754), British peer", "*Charles Powlett, 5th Duke of Bolton (1718–1765), British peer", "*Charles Powlett, 2nd Baron Bayning (1785–1823), British peer and Tory Member of Parliament", "*Charles Powlett  (1728–1809), priest and patron of English cricket "]}, {"page": "The Cricketers of My Time", "response": ["| Charles Powlett || align=\"center\" | 21 October 1832 || align=\"right\" | 74–76"]}, {"page": "Frederick Powlett", "response": ["Powlett was born in Shropshire, England, the son of the Reverend Charles Powlett and descendant of cricket administrator Charles Powlett (1728–1809). Frederick Powlett travelled with John Franklin to Van Diemen's Land (later renamed Tasmania) in 1837. Powlett then moved to the Port Phillip District being  Commissioner of Crown Lands from 1838 to 1860"]}, {"page": "Philip Dehany", "response": ["Dehany was at school and university with the Rev Charles Powlett, son of Charles Powlett, 3rd Duke of Bolton.  In  1763 Powlett became curate of a parish near Hambledon where Delany helped him establish the Hambledon Club based on the local cricket team. The club was as much about drinking and gambling as cricket.Martin Williamson The Cradle of Cricket Cricinfo Dehany was a member of the  Committee which revised the Laws of Cricket at the Star and Garter Hotel in Pall Mall in 1774."]}, {"page": "Powlett, Charles", "response": ["#redirectCharles Powlett"]}]}}