{"wiki_id": "http://www.wikidata.org/entity/Q5081256", "itemLabel": "Charles Noel, 1st Earl of Gainsborough", "itemDescription": "British politician and peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Noel,_1st_Earl_of_Gainsborough", "wikipedia_page": {"main": "Charles Noel Noel, 1st Earl of Gainsborough (2 October 1781 – 10 June 1866), known as Charles Edwardes until 1798, as Charles Noel between 1798 and 1823 and as the Lord Barham between 1823 and 1841, was a British peer and Whig politician.", "link_mentions": [{"page": "Roden Noel", "response": ["He was the youngest son of Charles Noel, 1st Earl of Gainsborough and, his fourth wife, Lady Frances Jocelyn. His only full sibling was Lady Victoria Noel, who married Sir Fowell Buxton, 3rd Baronet, later Governor of South Australia. From his father's earlier marriages, he had several half-siblings including Charles Noel, 2nd Earl of Gainsborough (who married Lady Ida Harriet Augusta, a daughter of William Hay, 18th Earl of Erroll and Elizabeth FitzClarence, an illegitimate daughter of King William IV), Gerard James Noel, MP, Capt. Henry Lewis Noel, Lady Mary Arabella Louisa Noel (wife of Sir Andrew Agnew, 8th Baronet), and Lady Catherine Hamilton Noel (the first wife of James Carnegie, 9th Earl of Southesk)."]}, {"page": "Earl of Gainsborough", "response": ["*Charles Noel, 1st Earl of Gainsborough (1781–1866)"]}, {"page": "Conrad Noel", "response": ["Noel was born on 12 July 1869 in Royal Cottage, Kew Green, Kew, London, into an aristocratic family. He was the eldest son of the poet and essayist Roden Noel, who served as Groom of the Privy Chamber, and his wife Alice Maria Caroline Noel (née de Broë). His paternal grandfather was Charles Noel, 1st Earl of Gainsborough, and his paternal grandmother Lady Gainsborough was a lady-in-waiting to Queen Victoria. Noel's parents were both Anglican, though in his youth, Noel repudiated the Calvinism of his mother and attended higher-church services with his father."]}, {"page": "Sir Fowell Buxton, 3rd Baronet", "response": ["He attended Harrow School and Trinity College, Cambridge. He was commissioned captain in the Tower Hamlets Rifle Volunteers (No. 3) on 4 May 1860. He married Lady Victoria Noel, daughter of Charles Noel, 1st Earl of Gainsborough, and Lady Frances Jocelyn, daughter of Robert Jocelyn, 3rd Earl of Roden on 12 June 1862.  Of their 13 children, ten survived infancy:"]}, {"page": "James Carnegie, 9th Earl of Southesk", "response": ["On 19 June 1849, Sir James married Lady Catherine Hamilton Noel (1829–1855) at Exton Park, Rutland, England. Lady Catherine was the second daughter of Charles Noel, 1st Earl of Gainsborough and, his third wife, Annabella Hamlyn-Williams (second daughter of Sir James Hamlyn-Williams, 2nd Baronet of Clovelly Court). Before Catherine's death in 1855, at the age of twenty-six, they had one son and three daughters:"]}, {"page": "Gerard Noel (politician)", "response": ["Noel was the eldest son of Charles Noel, 1st Earl of Gainsborough and, his third wife, Arabella, daughter of Sir James Hamlyn-Williams, 2nd Baronet. From his father's second marriage to Elizabeth Grey (a second daughter of Sir George Grey, 1st Baronet), he had an elder half-brother Charles, who married Lady Ida Harriet Augusta (a daughter of William Hay, 18th Earl of Erroll and Elizabeth FitzClarence, an illegitimate daughter of King William IV) who succeeded their father as the 2nd Earl of Gainsborough. From his parents marriage, he had three siblings, Henry Lewis Noel (who married their cousin Emily Elizabeth Noel), Lady Mary Arabella Louisa Noel (the wife of Sir Andrew Agnew, 8th Baronet), and Lady Catherine Hamilton Noel (the wife of James Carnegie, 9th Earl of Southesk). From his father's fourth marriage in 1833 to Lady Frances Jocelyn (the second daughter of Robert Jocelyn, 3rd Earl of Roden), he had two younger half-siblings: Roden Noel (a Groom of the Privy Chamber) and Lady Victoria Noel (the wife of Sir Fowell Buxton, 3rd Baronet, the Governor of South Australia)."]}, {"page": "Henry Lowther (politician)", "response": ["* Lady Augusta Mary Lowther (d. 1916), who married the Hon. Gerard Noel, a son of Charles Noel, 1st Earl of Gainsborough."]}, {"page": "William Lowther (diplomat)", "response": ["Lowther was the third, but second surviving, son of the Hon. Henry Cecil Lowther and his wife Lady Lucy Eleanor. Among his siblings were brother Henry Lowther, 3rd Earl of Lonsdale and sister Augusta Mary Lowther (wife of Hon. Gerard Noel, a son of Charles Noel, 1st Earl of Gainsborough). His father, a longtime MP for Westmorland, was Father of the House of Commons from 1862 until his death in 1867."]}, {"page": "Bargate", "response": ["| Noel || Sir Gerard Noel, 2nd Baronet & Charles Noel, 1st Earl of Gainsborough || "]}, {"page": "Sir Thomas Buxton, 4th Baronet", "response": ["The great-grandson of Sir Thomas Fowell Buxton, a Member of Parliament (United Kingdom) and social reformer, his paternal grandparents were Catherine (née Gurney) Buxton (daughter of Samuel Gurney) and Sir Edward North Buxton, also an MP. His maternal grandfather was the Charles Noel, 1st Earl of Gainsborough and Lady Frances Jocelyn (daughter of Robert Jocelyn, 3rd Earl of Roden).Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes (Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003), volume 1, page 626."]}, {"page": "Sir Andrew Agnew, 8th Baronet", "response": ["On 20 August 1846, he married Lady Mary Arabella Louisa Noel (d. 1883), daughter of Charles Noel, 1st Earl of Gainsborough, and Arabella Hamlyn-Williams. From her father's second marriage to Elizabeth Grey (a second daughter of Sir George Grey, 1st Baronet), she had an elder half-brother Charles, who married Lady Ida Harriet Augusta (a daughter of William Hay, 18th Earl of Erroll and Elizabeth FitzClarence, an illegitimate daughter of King William IV) who succeeded their father as the 2nd Earl of Gainsborough. From her parents marriage, she had three siblings, Gerard Noel (who married Lady Augusta Mary Lowther, sister of Henry Lowther, 3rd Earl of Lonsdale), Henry Lewis Noel (who married their cousin Emily Elizabeth Noel), and Lady Catherine Hamilton Noel (the wife of James Carnegie, 9th Earl of Southesk). From her father's fourth marriage in 1833 to Lady Frances Jocelyn (the second daughter of Robert Jocelyn, 3rd Earl of Roden), she had two younger half-siblings: Roden Noel (a Groom of the Privy Chamber) and Lady Victoria Noel (the wife of Sir Fowell Buxton, 3rd Baronet, the Governor of South Australia). Together, Sir Andrew and Lady Mary had thirteen children, eight daughters and five sons, including:"]}, {"page": "Victoria Buxton", "response": ["She was the daughter of Charles Noel, 1st Earl of Gainsborough and Lady Frances Jocelyn, daughter of Robert Jocelyn, 3rd Earl of Roden. She spent her early years at the Noel family's ancestral home at Exton Hall, Rutland and later at Barham Court, Maidstone. She was educated by governess and travelled extensively on the continent. Her parents were of strong evangelical faith and placed great emphasis on community work in which Lady Victoria also participated."]}, {"page": "Charles Carnegie, 10th Earl of Southesk", "response": ["Carnegie was the son of the explorer and poet James Carnegie, 9th Earl of Southesk and his first wife Catherine Hamilton Noel, daughter of the Charles Noel, 1st Earl of Gainsborough. He had three older sisters, Lady Arabella Charlotte (wife of Samuel Romilly), Lady Constance Mary (wife of Victor Bruce, 9th Earl of Elgin) and Lady Beatrice Diana Cecilia Diana Cecillia (wife of the Rev. Henry Holmes Stewart). After his mother's death in 1855 at the age of twenty-six, his father remarried to Lady Susan Catherine Mary Murray (eldest daughter of the 6th Earl of Dunmore) in 1860. From his father's second marriage, he had seven younger half-siblings, including: Sir Lancelot Douglas Carnegie, Lady Dora Susan (wife of Maj. Ernest de Rodakowski-Rivers), Lady Elizabeth Erica, Lady Helena Mariota, Lady Katherine Agnes Blanche (wife of Courtenay Morgan, 1st Viscount Tredegar), Hon. Robert Francis (who married Violet Fraser), and Hon. David Wynford Carnegie."]}, {"page": "Charles Noel Noel, 1st Earl of Gainsborough", "response": ["#REDIRECT Charles Noel, 1st Earl of Gainsborough"]}, {"page": "Charles Noel, 2nd Earl of Gainsborough", "response": ["Gainsborough was the only child of Charles Noel, 1st Earl of Gainsborough, by his second wife Elizabeth, daughter of Sir George Grey, 1st Baronet. His mother died two weeks after he was born. He was the half-brother of Gerard Noel. He was educated privately and at Trinity College, Cambridge."]}, {"page": "William Noel", "response": ["Noel was the third son of Sir Gerard Noel, 2nd Baronet, and Diana, Baroness Barham, daughter of Admiral Charles Middleton, 1st Baron Barham. Charles Noel, 1st Earl of Gainsborough, was his elder brother."]}, {"page": "Charles Noel, 3rd Earl of Gainsborough", "response": ["His father was the son of Charles Noel, 1st Earl of Gainsborough, and his second wife Elizabeth, herself the daughter of Sir George Grey, 1st Baronet.  His mother was the daughter of William Hay, 18th Earl of Erroll and Elizabeth FitzClarence, an illegitimate daughter of King William IV and Dorothea Jordan.  His nephew (the son of his younger brother Edward) was Lieutenant-Colonel Edward Noel, a British spy active in the Caucasus and Caspian area during the Russian Revolution."]}, {"page": "Charles Noel", "response": ["*Charles Noel, 1st Earl of Gainsborough (1781–1866), aka Charles Edwardes and Lord Barham; British peer and Whig politician"]}, {"page": "Sir George Grey, 1st Baronet", "response": ["* Elizabeth Grey (1800–1818) who married Charles Noel, 1st Earl of Gainsborough and died after the birth of their son, Charles George Noel, 2nd Earl of Gainsborough."]}, {"page": "Thomas Henry Clifton", "response": ["On 7 February 1867, he married Madeline Agnew at St George's, Hanover Square in London. Madeline was one of thirteen children born to the former Lady Mary Arabella Louisa Noel (a daughter of Charles Noel, 1st Earl of Gainsborough) and Sir Andrew Agnew, 8th Baronet, MP for Wigtownshire. Together they had seven children, including:Townend, Peter. Burke's Genealogical and Heraldic History of the Landed Gentry, 18th edition. 3 volumes. London, England: Burke's Peerage Ltd, 1965-1972. p. 190.", "* Madeline Edith Clifton (1867–1946), who married her cousin Gerard Cecil Noel (1864–1925), a son of Gerard Noel, MP for Rutland, and Lady Augusta Mary (the second daughter of Col. Hon. Henry Cecil Lowther). He was also the nephew of Henry Lowther, 3rd Earl of Lonsdale and a grandson of Charles Noel, 1st Earl of Gainsborough. "]}, {"page": "Emilia Frances Noel", "response": ["Born in Kensington,England & Wales, Civil Registration Birth Index, 1837-1915 she was the youngest daughter of Hon. Henry Lewis Noel and granddaughter of Charles Noel, 1st Earl of Gainsborough. She was educated at Somerville College, Oxford. She traveled internationally, and is noted for her writings about and collection of Kashmir plants; her journals are now in the National Archives. She was elected a Fellow of the Linnean Society of London in 1905."]}, {"page": "Thomas William Goff", "response": ["* Ethel Anne Goff (1864–1928), who married Henry de Courcy Agnew, a son of Sir Andrew Agnew, 8th Baronet of Lochnaw and Lady Mary Arabella Louisa Noel (a daughter of Charles Noel, 1st Earl of Gainsborough), in 1885. After his death, she married, secondly, Edmund Charrington in July 1911.Mosley, Charles, editor. Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes. Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003. p. 48."]}, {"page": "Catmose House", "response": ["The house was designed as a hunting lodge known as Catmose Lodge and was completed in 1781. It became the home of Sir Gerard Noel Edwards, MP for Rutland in the early 19th century. It passed to Edwards' son Charles Noel, 1st Earl of Gainsborough in 1838 and then to Edwards' grandson, the Rt Hon Gerard James Noel, also MP for Rutland, in 1866; Gerard Noel substantially rebuilt the house laid out the gardens as well, in the 1870s. The design of the building, following the rebuilding, involved a main frontage of eight bays facing north east; there were round-headed windows on the ground floor and square windows on the first floor with a pediment containing a clock above. "]}]}}