{"wiki_id": "http://www.wikidata.org/entity/Q5080735", "itemLabel": "Charles Maule Ramsay", "itemDescription": "British army officer and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Maule_Ramsay", "wikipedia_page": {"main": "Lieutenant-Colonel the Honourable Charles Maule Ramsay (27 January 1859 – 7 April 1936) was a British army officer and briefly a Liberal Unionist Member of Parliament (MP).", "link_mentions": [{"page": "John Ramsay, 13th Earl of Dalhousie", "response": ["Dalhousie was born at Aberdour House at Fraserburgh, Aberdeenshire on 29 January 1847. He was the eldest son of Admiral George Ramsay, 12th Earl of Dalhousie, and Sarah Frances, daughter of William Robertson of Logan House. The Hon. Charles Maule Ramsay, MP for Forfarshire, was his younger brother. He gained the courtesy title of Lord Ramsay in 1874 when his father succeeded in the earldom of Dalhousie on the death of his first cousin, Fox Maule-Ramsay, 11th Earl of Dalhousie.John William Ramsay, 13th Earl of Dalhousie profile, thepeerage.com; accessed 3 April 2016."]}, {"page": "George Ramsay, 12th Earl of Dalhousie", "response": ["Dalhousie's fourth son the Honourable Charles Maule Ramsay was a soldier and politician. Dalhousie died in July 1880, aged 74, and was succeeded by his eldest son, John."]}, {"page": "Forfarshire (UK Parliament constituency)", "response": ["|  Charles Maule Ramsay  Conservative"]}, {"page": "List of Grand Master Masons of the Grand Lodge of Scotland", "response": ["# 1904–1907: Hon. Charles Maule Ramsay"]}, {"page": "List of United Kingdom by-elections (1885–1900)", "response": ["|Charles Maule Ramsay"]}, {"page": "1894 Forfarshire by-election", "response": ["The Liberals chose Henry Robson to defend the seat.  Robson, although Scottish born, had made his living as a stockbroker in London.  The choice of the \"stranger\", Robson, rather than the popular Dundee merchant, Martin White, was resented locally. The Unionists, by contrast, chose a local landowner, the Honorable Charles Maule Ramsay. Ramsay was the younger brother of the late Earl of Dalhousie, who had sat as a Liberal MP for Liverpool."]}, {"page": "List of American heiresses", "response": ["*The Hon. Mrs Charles Maule Ramsay (née Martha Estelle Garrison) on 28 May 1885"]}, {"page": "Charles Ramsay", "response": ["*Charles Maule Ramsay (1859–1936), British Army officer and politician"]}, {"page": "Charles Ramsay (MP)", "response": ["#REDIRECT Charles Maule Ramsay"]}]}}