{"wiki_id": "http://www.wikidata.org/entity/Q5081078", "itemLabel": "Charles Morgan", "itemDescription": "British Managing Director of the Morgan Motor Company", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Morgan_(automaker)", "wikipedia_page": {"main": "Charles Peter Harry Morgan was the managing director of the Morgan Motor Company, a UK car manufacturer.\nThe grandson of the founder of the company, H.F.S. Morgan, and the son of the company's former chairman Peter Morgan, Charles Morgan joined the family firm full-time in 1985. Previously he had worked for 10 years as a news cameraman for ITN and then briefly in the publishing industry. After the Morgan Motor Company was featured on the BBC's Troubleshooter in 1991, he obtained an MBA. In 2013, he was removed as Morgan's managing director and continued as strategy director until October 2013, when he was voted off the company's board. He remains a minority shareholder.With Gregory Houston Bowden, Morgan is the author of Morgan – 100 Years: The Official History of the World's Greatest Sports Car, published in 2008.", "link_mentions": [{"page": "Morgan Motor Company", "response": ["Charles Morgan (son of Peter), Matthew Parkin, Tim Whitworth and Steve Morris made up the new management team, and in 2010, after Parkin's resignation, Charles Morgan was named managing director. In 2010, the MMC became dormant and all assets were sold to a new company called Morgan Technologies for an unpaid 15 million and which took over all the former assets of the Morgan Motor Company, Aero Racing, the Morgan M3W Company and all other companies bearing the Morgan name. This cured the negative equity that had occurred over the Charles Morgan tenure. UK Company House", "In May 2012, Manhattan Motorsports took delivery of Charles Morgan's Superdry edition Morgan 3-Wheeler and prepared it for its first major American trial. This vehicle was driven across the States, from New York to Los Angeles by Charles Morgan and his wife, covering 3000 miles, in the Gumball 3000. At the end of the seven-day drive, the Morgan 3 Wheeler was awarded the \"Spirit of Gumball\" prize.", "*Sir John Harvey Jones famously visited the firm in the 1990s BBC documentary series Troubleshooter in which he advised the firm to modernise. The company, then under Peter Morgan, rejected the advice but began other changes, completed under Charles Morgan after his father's passing and following the late Sir John's advice in every way."]}, {"page": "Charles Morgan", "response": ["Charles Morgan may refer to:", "* Sir Charles Morgan, 1st Baronet (1726–1806), Member of Parliament for Brecon, 1778–1787, and Breconshire, 1787–1806", "* Charles Morgan (1736–1787), Member of Parliament for Brecon, 1763–1769", "* Sir Charles Morgan, 2nd Baronet (1760–1846), Member of Parliament for Brecon, 1787–1796, and Monmouthshire, 1796–1831", "* Charles Morgan, 1st Baron Tredegar (1792–1875), MP for Brecon, 1812–1818, 1830–1832 and 1835–1847", "* Charles Morgan (Australian politician) (1897–1967), Australian politician", "* Charles Morgan (coach) (c. 1890–19??), American football coach in the United States", "* Charles Morgan (Surrey cricketer) (1839–1904), English cricketer", "* Charles Morgan (Queensland cricketer) (1877-1942), Australian cricketer", "* Charles Morgan (Victoria cricketer) (1900–1965), Australian cricketer", "* Charles Morgan (Nottinghamshire cricketer) (1917–2001), English cricketer", "* Charles Morgan (racing driver), American racing driver, see 2007 Rolex Sports Car Series season", "* Charles Morgan (British Army officer) (1741–1818), Commander-in-Chief, India", "* Charles Morgan (military governor) (c. 1575–1643), military governor of Bergen op Zoom", "* Charles Morgan (American soldier), spy during the Revolutionary War", "* Charles Morgan (Master of Clare College, Cambridge) (1678–1736), Master of Clare 1726–1736", "* Charles Morgan (businessman) (1795–1878), American railroad and shipping magnate", "* Charles Morgan Jr. (1930–2009), U.S. civil rights attorney", "* Charles Morgan (actor) (1909–1994), Welsh actor", "* Charles Morgan (automaker), ex-MD of Morgan Motor Company"]}, {"page": "Morgan Aero 8", "response": ["The Aero 8 shape evolved in the traditional Morgan way of form follows function and the main players were Chris Lawrence, Charles Morgan and other members of the Morgan Engineering Team, and Norman Kent of Survirn Engineering Ltd - especially for the tooling of the Aero wings.", "The AeroMax, Aero Supersports and Aero Coupe were designed by the firm's designer Matthew Humphries. Matthew  sent the basic design of it to Charles Morgan when he was at Coventry University and joined Morgan on a KTP programme.", "Morgan's first supercar, the first run of Aero models was unveiled at the Geneva motorshow in 2000 by Charles Morgan, it was in his words \"the result of the biggest development project ever undertaken by the Morgan Motor Company\". The result of many years of hard work, a development programme that included racing in the FIA GT series and a partnership with BMW.", "Initially presented at the 2005 Geneva Motor Show as a bespoke car built for a well respected Morgan customer Prince Eric Sturdza of Banque Baring Sturdza in Geneva, the AeroMax was the next development of the Aero chassis. The car is named after Charles Morgan’s son Max. ", "Charles Morgan visited Jay Leno's Garage in a Supersports"]}, {"page": "1997 FIA GT Championship", "response": ["| rowspan=5|  Charles Morgan", "|  Charles Morgan"]}, {"page": "1996 BPR Global GT Series", "response": ["|rowspan=4|  Charles Morgan", "|  Charles Morgan"]}, {"page": "1995 BPR Global GT Series", "response": ["|  Charles Morgan"]}, {"page": "1997 FIA GT Silverstone 4 Hours", "response": ["|rowspan=2|  Charles Morgan William Wykeham"]}, {"page": "1997 FIA GT Helsinki 3 Hours", "response": ["|rowspan=2|  Charles Morgan William Wykeham"]}, {"page": "1997 FIA GT Spa 4 Hours", "response": ["|rowspan=2|  Charles Morgan William Wykeham"]}, {"page": "1997 FIA GT Donington 4 Hours", "response": ["|rowspan=2|  Charles Morgan William Wykeham"]}, {"page": "Morgan Eva GT", "response": ["Launched at the 2010 Pebble Beach Concours d'Elegance show in California with a display of a clay mockup, it was to share the chassis of the Aeromax SuperSports, but with an elongated body. The car also was to have a  twin-turbo straight six, making the car Euro 6-emissions compliant. The car's official press release noted it was expected to achieve 40 mpg and would have been offered with a 6-speed automatic or 6-speed manual transmission, and rear wheel drive only. With aluminum body panels, Morgan expected the car to weigh . Along with these specifications it was speculated the Eva GT would accelerate from 0-60 mph (97 km/h) in 4.5 seconds, with a top speed of . The car is named after Charles Morgan's daughter Eva."]}, {"page": "1996 BPR 4 Hours of Spa", "response": ["| rowspan=2 |  Charles Morgan", "| rowspan=2 |  Charles Morgan William Wykeham Steve Lawrence"]}]}}