{"wiki_id": "http://www.wikidata.org/entity/Q5082183", "itemLabel": "Charles Ross", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Ross_(historian)", "wikipedia_page": {"main": "Charles Derek Ross (1924 – 1986) was an English historian of the Late Middle Ages. He was educated at Wakefield Grammar School and Brasenose College, Oxford, where he completed a doctoral thesis on the baronage in Yorkshire in the early fifteenth century under the supervision of K.B. McFarlane. He published predominantly on the history of the later medieval English nobility, royalty, and the Wars of the Roses. Originally teaching alongside Margaret Sharp (daughter of T.F. Tout), he became reader and then Professor of Medieval History at the University of Bristol. His pupils included Michael Hicks, Anne Crawford and Ralph Griffiths. He remained at Bristol until his death in 1986, when he was killed by an intruder in his own home.Ross's best-known works are his biographies of Edward IV and Richard III in the Yale English Monarchs series. These influential books were the first modern comprehensive studies of the Yorkist kings' politics, retinues and landownership.", "link_mentions": [{"page": "Battle of Bosworth Field", "response": ["Discontent with Richard's actions manifested itself in the summer after he took control of the country, as a conspiracy emerged to displace him from the throne. The rebels were mostly loyalists to Edward IV, who saw Richard as a usurper. Their plans were coordinated by a Lancastrian, Henry's mother Lady Margaret, who was promoting her son as a candidate for the throne. The highest-ranking conspirator was Buckingham. No chronicles tell of the duke's motive in joining the plot, although historian Charles Ross proposes that Buckingham was trying to distance himself from a king who was becoming increasingly unpopular with the people. Michael Jones and Malcolm Underwood suggest that Margaret deceived Buckingham into thinking the rebels supported him to be king."]}, {"page": "Richard III of England", "response": ["Some twentieth-century historians have been less inclined to moral judgement, seeing Richard's actions as a product of the unstable times. In the words of Charles Ross, \"the later fifteenth century in England is now seen as a ruthless and violent age as concerns the upper ranks of society, full of private feuds, intimidation, land-hunger, and litigiousness, and consideration of Richard's life and career against this background has tended to remove him from the lonely pinnacle of Villainy Incarnate on which Shakespeare had placed him. Like most men, he was conditioned by the standards of his age.\" The Richard III Society, founded in 1924 as \"The Fellowship of the White Boar\", is the oldest of several groups dedicated to improving his reputation. Other contemporary historians still describe him as a \"power-hungry and ruthless politician\" who was still most probably \"ultimately responsible for the murder of his nephews.\""]}, {"page": "Edward IV of England", "response": ["While the War of the Roses has been documented by numerous historians, Edward as an individual is less well known; 19th century historians like William Stubbs generally dismissed him as a bloodthirsty nonentity. The most comprehensive modern biography was written by Charles Ross in 1974, who concluded the peace and stability of his later reign was squandered in short-term aggrandisement. He further suggests that Edward \"remains the only king in English history since 1066 in active possession of his throne who failed to secure the safe succession of his son. His lack of political foresight is largely to blame for the unhappy aftermath of his early death.\""]}, {"page": "Battle of Barnet", "response": ["Edward IV was normally at the forefront of his armies. Standing , he was an inspiring figure in combat, attacking foes while wearing a suit of gilded armour. Medieval texts describe the King as handsome, finely muscled and with a broad chest. He was personable and charismatic, easily winning people to his cause. Edward was a capable tactician and leader in battles. He frequently spotted and exploited defensive frailties in enemy lines, often with decisive results. By 1471 the young king was a highly respected field commander. He received some criticism, however; after winning the throne in 1461, he proved indecisive about putting down rebellions. Historian Charles Ross praises Edward's leadership and skill in close combat rather than his strategies and tactics. With his good looks and capable leadership, Edward was popular among the common people, especially compared to Henry VI. His trade policies, which aimed to expand and protect markets for English commerce, pleased local merchants, who were also won over by the Yorkist king's personality. By 1469 Edward's groundswell of popular support had eroded. The euphoria of a change in government had ebbed and the people blamed Edward for failing to \"bring the realm of England in[to] great popularity and rest\" and allowing Yorkist nobles to go unpunished for abuses. When Edward invaded England in 1471, not many common people openly celebrated his return."]}, {"page": "Battle of Towton", "response": ["A newsletter dated 4 April 1461 reported a widely circulated figure of 28,000 casualties in the battle, which Charles Ross and other historians believe was exaggerated. The number was taken from the heralds' estimate of the dead and appeared in letters from Edward and the Bishop of Salisbury, Richard Beauchamp. Letters from an ambassador and a merchant from the duchy of Milan broke this number down into 8,000 dead for the Yorkists and 20,000 for the Lancastrians; in contrast, bishops Nicholas O'Flanagan (Elphin) and Francesco Coppini reported only 800 dead Yorkists. Other contemporary sources gave higher numbers, ranging from 30,000 to 38,000; Hall quoted an exact figure of 36,776. An exception was the Annales rerum anglicarum, which stated the Lancastrians had 9,000 casualties, an estimate Ross and Wolffe found to be more believable. A more recent analysis of the sources and archaeological evidence, which posits accounts of Towton were combined with those of the actions of Ferrybridge and Dintingdale, suggests total casualty figures in the range 2800 - 3800."]}, {"page": "Dominic Mancini", "response": ["*Charles Ross, Richard III, University of California Press, Berkeley, CA (1981) "]}, {"page": "John Neville, 1st Marquess of Montagu", "response": ["In spite of Montagu's and Warwick's northern successes in the years following Towton, a not-insubstantial Lancastrian army was still active in the area; it had been slowly been re-taking castles, like Bamburgh, Hexham, Langley, Norham, and Prudhoe Castles, between February and March 1464. This threatened Newcastle, a major Yorkist supply centre. Local Lancastrians were returning to their estates, such as the Cliffords, who regained their castle at Skipton Craven with no royal response, military or otherwise. They \"virtually controlled most of the country immediately south of the Scottish border\", wrote Charles Ross, although very few local gentry directly supported them. The situation was severe enough that in April 1464 he was too occupied with the northern situation to travel to London, and was exempted from attending the Order of the Garter Chapter meeting on the 29th of the month. He has been described as the king's 'resident commander' in the north and a \"confident and aggressive commander.\""]}, {"page": "Edward of Middleham, Prince of Wales", "response": ["Edward was born at Middleham Castle, a stronghold close to York that became Richard and Anne's principal base in northern England.Panton, p. 162-163 His birth date is usually given as around December 1473, but he may have been born as late as 1476. Professor Charles Ross wrote that the date 1473 \"lacks authority. In fact, he was probably not born until 1476.\"Ross, Charles. Richard III (Univ. of California Press, 1981) , p. 29, n22, citing P. W. Hammond Edward of Middleham, Prince of Wales (1973) pgs. 12, 35–6, and also T. B. Pugh, Glamorgan County History III (1971) p 687. The act of Parliament that settled the dispute between George of Clarence and Richard over Anne Beauchamp's inheritance just as if the Countess of Warwick \"was naturally dead\" was dated May 1474.Ross, C.D., Richard III, St. Ives 1981, p.30 The doubts cast by Clarence on the validity of Richard and Anne's marriage were addressed by a clause protecting their rights in the event they were divorced (i.e. of their marriage being declared null and void by the Church) and then legally remarried to each other, and also protected Richard's rights while waiting for such a valid second marriage with Anne.C. Given-Wilson [ed.], Parliament Rolls of Medieval England, Edward IV – October 1472 – 2nd roll There were no provisions, however, for their heirs in case of this said divorce, which seems to confirm Richard and Anne had no children as of 1474. However, such provision was the provence of the ruling king for those of royal blood, so would have been moot."]}, {"page": "Charles Ross", "response": ["Charles Ross may refer to:", "* Charles Ross (British Army officer, born 1667) (1667–1732), Scottish general and MP", "* Charles Ross (politician, born 1721) (1721–1745), Scottish soldier and MP", "* Charles Ross (Royal Navy officer) (1776–1849)", "* Charles Ross (politician, born 1799) (1799–1860), British Member of Parliament for Orford, St Germans and Northampton", "* Charles Ross (British Army officer, born 1864) (1864–1930), First World War divisional commander", "* Sir Charles Lockhart-Ross, 8th Baronet, son of Sir Charles Lockhart-Ross, 7th Baronet and father of Sir Charles Ross, 9th Baronet", "* Sir Charles Ross, 9th Baronet (1872–1942), inventor of the Ross rifle, used by the Canadian army during World War I", "* Charles Ross (Washington politician), politician from the US state of Washington", "* Charles Ross (Australian cricketer) (1863–1935)", "* Charles Ross (English cricketer) (1852–1911)", "* Charles Ross (historian) (1924–1986), English historian, biographer of Edward IV and Richard III", "* Charles Ross (artist) (born 1937), American sculptor", "* Charles Ross (born 1934), astronomy benefactor after whom the asteroid 25944 Charlesross is named"]}, {"page": "John Mowbray, 3rd Duke of Norfolk", "response": ["The Lancastrian army marched on London, but were refused entry. On 3 March 1461 Mowbray attended a great council at Baynard's Castle, organised small group of Yorkist loyalists, and agreed to offer Edward, Earl of March the throne. The following day—indicating the urgency for resolution felt by the Yorkists by this stage— Mowbray was sent to East Anglia to \"prepare for the war on the party of King Edward\". The Lancastrian army had returned to the north where, on 29 March 1461, York and Lancaster met at the Battle of Towton. It was to be one of the longest and bloodiest battles fought on British soil, and \"fought in bitter Yorkshire weather and no less bitter spirit\", according to historian Charles Ross. On Mowbray's advice, Edward followed the Lancastrian army north with a new army."]}, {"page": "Queen Elizabeth Grammar School, Wakefield", "response": ["* Charles Ross (historian) (1924-1986), Professor of Medieval History, Bristol University, and author"]}, {"page": "John of Gloucester", "response": ["John was one of two persons knighted on 8 September 1483 in York during the celebrations which invested his half-brother Edward of Middleham as Prince of Wales.Richard III by Charles Ross (Univ. of California Press, 1981) pgs. 150-151"]}, {"page": "William Herbert, 2nd Earl of Pembroke", "response": ["He succeeded his father in the earldom in 1469. In 1479, he was forced by Edward IV to surrender the earldom with its accompanying lands in Wales to Edward's son, the future Edward V, and was created Earl of Huntingdon. William had hoped to restore to his family the Earldom of Pembroke. Awarding lands in the south-west of England meant that Edward had moved the family influence out of Wales.Michael Hicks, The Wars of the Roses, (Yale University Press, 2012), 212. A Yorkist, he married Mary Woodville, sister of the queen, Elizabeth Woodville,Charles Ross, Edward IV, (University of California Press, 1974), 93. and they had one daughter, Elizabeth Herbert, 3rd Baroness Herbert.", "Herbert remained loyal to Richard III. After the rebellion of 1483 he received the post of Chief Justice of South Wales, which had been the Duke of Buckingham's. After his marriage to his second wife, Katherine, an illegitimate daughter of Richard III in 1484, he received an annuity of some £1,000 pounds a year, nearly doubling his income.'Bosworth: The Birth of the Tudors; by Chris Skidmore; Phoenix Press (2013), p. 204Charles Ross, Richard III, (University of California Press, 1981), 158. Katherine is presumed to have died by 1487, because when William participated in the coronation of his first wife's niece, Elizabeth of York, he was noted to have been a widower.", "When Henry of Richmond landed in south Wales in 1485 Herbert's position forced Henry to take a roundabout route into England. It is likely that a Herbert agent first notified Richard III of Henry's landing.Charles Ross, Richard III, 211. Herbert did not, however, fight at Bosworth."]}, {"page": "Richard III (biography)", "response": ["Historical writers Desmond Seward and Alison Weir, both hostile to Richard, disagree; Seward refers to Kendall as Richard III's \"romantic apologist,\",Desmond Seward, The Wars of the Roses, New York: Penguin (1995), p. 261 superseded by Charles Ross's 1981 biography. Ross himself both praised and criticised Kendall's work, stating: \"Although the author admits that at times he goes beyond the facts and 'reconstructs'..., and in spite of an empurpled prose style which tends to enhance his partisanship, the book is soundly based on a wide range of primary sources, for which it shows a proper respect.\"Charles Ross, Richard III, London (1981), p. li, note 95."]}, {"page": "George Plantagenet, 1st Duke of Bedford", "response": ["George was born in Windsor Castle in March 1477, and was created Duke of Bedford in infancy, probably in 1478, after the former holder of the title, George Neville, was deprived of the title by act of Parliament, ostensibly for lack of money to maintain the style of a duke.  He was appointed the Lord Lieutenant of Ireland in 1478, one of a series of nominal and largely absent lieutenants.Edward IV by Charles Ross (Univ. of California, 1974, ) p. 204."]}, {"page": "Michael Hicks (historian)", "response": ["Hicks studied under Charles Ross while a final-year undergraduate student at the University of Bristol (1969–70),Hicks. M. A., Richard III & his Rivals: Magnates and their Motives in the War of the Roses, London, 1991, ix. T. B. Pugh for his M.A. at Southampton (1971), and C. A. J. Armstrong for his DPhil. at the University of Oxford (1975),Hicks, M. A., Richard III & his Rivals: Magnates and their Motives in the War of the Roses London, 1991, ix. which he had originally began under J. R. L. Highfield.Clarke, L. (ed.), The Fifteenth Century XIV: Essays Presented to Michael Hicks, Woodbridge, 2015, xi.Hicks, M .A., False, Fleeting, Perjur'd Clarence: George, Duke of Clarence, 1449-78, Gloucester, 1980, 9. In his own words, his research was – and remainedClarke, L. (ed.), The Fifteenth Century XIV: Essays Presented to Michael Hicks, Woodbridge, 2015, xvi. – firmly placed within \"the school of history founded by the late K. B. McFarlane ... the Master\" although with a heavy \"biographical bent\". His first published article, however, was on an aspect of law in the seventeenth century.. Hicks, M. A., Richard III & his Rivals: Magnates and their Motives in the War of the Roses, London, 1991, x; Hicks, M. A., \"Draper v. Crowther: The Prebend of Brownswood Dispute 1664–1692\", Transactions of the London and Middlesex Archaeological Society, 28 (1977). Having worked for the Victoria County History project between 1974 and 1978, he joined King Alfred's College, Winchester, later the University of Winchester. A proposed joint paper with his former tutor, Charles Ross, on bastard feudalism had come to nothing by 1978,Hicks, M. A., Richard III & his Rivals: Magnates and their Motives in the War of the Roses, London, 1991, x, xi. and a suggestion by Gerald Harriss for a joint study with Christine Carpenter, Michael Hicks and himself \"foundered on [their] incompatible points of view\".Hicks, M. A., Richard III & his Rivals: Magnates and their Motives in the War of the Roses, London, 1991, xii."]}, {"page": "Humphrey Stafford, 1st Earl of Devon", "response": ["Stafford was considered over-ambitious and unscrupulous by many contemporaries. This can be seen both by Warkworth implicating him in the downfall of Henry Courtenay, and Warwick targeting him as one of King Edward's evil councillors. This thread has also been picked up by modern historians; Charles Ross calls him a \"greedy and ambitious man\".Ross (1997), p. 78. At the same time, his skills as an administrator can hardly be doubted, as evidenced by King Edward's heavy reliance on him. He could also show a more human and sympathetic side. Michael Hicks describes his activity, from 1467 onwards, in adding codicils to his will \"to right the wrongs that he was conscious of committing\"the last of these he added as he faced his own execution."]}, {"page": "William Collingbourne", "response": ["Tudor author Edward Hall relates that he was executed merely \"for making a small rhyme\",Edward Hall, Union of the Two Illustre Families of Lancaster and York, ed. H. Ellis (1809), p. 398. a claim taken up by later authors.,Brian Vickers. English Renaissance Literary Criticism New York: Oxford University Press, 1999, p. 129–130. but historian Charles Ross pointed out, that Hall \"carefully suppresses the fact that the real indictment against him was that he had been encouraging Henry Tudor to land at Poole\".Charles Ross, Richard III. (1981), p. xxxiii, 202–203."]}, {"page": "William Bonville, 1st Baron Bonville", "response": ["Courtenay, by his actions at St Albans, had earned the support of Henry's powerful Queen, Margaret, who was by now implacably opposed to the Yorkist party. His son Thomas, who inherited the earldom, married the Queen's cousin, Marie de Maine, and in 1458 Bonville's grandson married Katherine Neville, daughter of the powerful northern magnate Richard Neville, Earl of Salisbury. The modern historians Roskell and Woodger in the History of Parliament suggest that throughout this period Bonville managed to conceal any sympathy for the Duke of York and remained \"outwardly loyal to Henry VI\". The historian Charles Ross has described Bonville during this period as \"a veteran servant of the House of Lancaster, who had been promoted to his peerage by King Henry VI [and who] clung to the court he had always served\". He swore to uphold the rights of young Edward, Prince of Wales against the Yorkists at the 1459 Parliament, and in early 1460 he was commissioned to raise an army in the south-west."]}, {"page": "John Dynham, 1st Baron Dynham", "response": ["He was made High Sheriff of Devon and Lord Chancellor of Ireland in 1460. After Edward IV's accession he became a member of the Privy Council and was created Baron Dynham in 1467, although no grant of lands accompanied the title, as was usual. RossCharles Ross  Edward IV   Eyre Methuen Ltd. 1974 suggests that he did not become a leading figure in government until the death of Humphrey Stafford, Earl of Devon. During the years of crisis from 1469 to 1471 Dynham remained wholly loyal to Edward, and following Edward's return to power became one of the foremost members of the Government; he was Commander-in-Chief of naval forces during the brief Anglo-French War in 1475.Ross Edward IV On the other hand, the Crown was somewhat grudging with grants of land, his estates being confined to Devon and Cornwall. Nor did he have a powerful network of family alliances: two of his sisters married into the Carew and Arundell families who were of purely local importance; the others married into the Zouche and Fitzwarin families, who were peers but not, until the accession of Richard III, of wide influence."]}]}}