{"wiki_id": "http://www.wikidata.org/entity/Q5085557", "itemLabel": "Charlie Stayt", "itemDescription": "English Television Journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Stayt", "wikipedia_page": {"main": "Charles Jeffaries \"Charlie\" Stayt (born 19 June 1962) is an English newsreader and broadcaster. He is a journalist with the BBC as a presenter for BBC Breakfast.", "link_mentions": [{"page": "BBC News (TV channel)", "response": ["The simulcasting of the main national news bulletins has led to the presenters of those bulletins appearing on the channel and offer relief on the news channel including Huw Edwards, Victoria Derbyshire, Fiona Bruce, George Alagiah, Sophie Raworth, Kate Silverton and Mishal Husain. The main Breakfast presenters have also appeared on the channel since it was first launched as a simulcast programme in 2000, with the current presenters being Dan Walker, Louise Minchin, Charlie Stayt and Naga Munchetty."]}, {"page": "Birmingham City University", "response": ["Notable graduates of the University and its predecessor institutions working in broadcasting include children's television presenter Kirsten O'Brien,  sports TV presenter Mary Rhodes, radio and TV presenters Fiona Phillips, Zoë Ball, Margherita Taylor and Phil Upton, investigative journalist Mark Williams-Thomas. Laurie Baker (1917–2007), British-born architect, Patrick le Quément, Chief of Design, Renault, Saiman Miah, designer of the £5 Olympic coins for London 2012 Games and Yemisi Akinbobola, founder IQ4News and African Women in the Media. Several work in broadcast journalism, such as Sky News news presenter Marverine Cole  and BBC news presenter Charlie Stayt."]}, {"page": "Clive James", "response": ["In a BBC interview with Charlie Stayt, broadcast on 31 March 2015, James described himself as \"near to death but thankful for life\". In October 2015, he admitted to feeling \"embarrassment\" at still being alive thanks to experimental drug treatment."]}, {"page": "L!VE TV", "response": ["* Charlie Stayt"]}, {"page": "BBC Breakfast", "response": ["On 12 December 2011, the first of several presenter changes was announced. Louise Minchin would, with the studio move to Salford, join the other main presenters of BBC Breakfast: Bill Turnbull, Susanna Reid and Charlie Stayt. Carol Kirkwood, on 26 March 2012, would remain in London presenting weather. Sports presenters Mike Bushell and Sally Nugent and business presenter Steph McGovern would locate to Salford. The first Breakfast edition from Salford occurred on Tuesday 10 April 2012. London-based newspapers have reported extensive criticism of the BBC move but a decrease in audience did not occur, with the retention of an approximate average of 1.5 million viewers.", "The 2012 Summer Olympics prompted BBC Breakfast to temporarily broadcast from a temporary studio near the Olympic Park in Stratford. During the Games, former presenters Sian Williams and Chris Hollins also returned to lead the morning programme, in addition to Bill Turnbull, Charlie Stayt, Louise Minchin, and BBC Sport presenter Hazel Irvine. The show ended its temporary London return with broadcasting from the BBC News Channel's studio on the morning following the closing ceremonies before rebroadcasting from Salford the next day.", "In 2014, Susanna Reid left the programme to join a revamped Good Morning Britain on ITV. Naga Munchetty became a regular presenter, hosting with Charlie Stayt from Thursday- Saturday every week, after a number of years as a relief presenter, including regularly presenting Sundays programme.", "On 23 July 2014, the show went on location again, this time to Glasgow to showcase highlights from the 2014 Commonwealth Games. In the hours leading up to the opening ceremony, Carol Kirkwood reported from Celtic Park. The day after the end of the Games, Charlie Stayt presented from Glasgow Cathedral in the lead up to ceremonies marking 100 years since the start of World War I.", "|Charlie Stayt", "On 30 April 2010, Charlie Stayt presented the programme from the University of Birmingham following the final leaders' debate of the election campaign.", "On 19 May 2012, Louise Minchin presented the 1st day of the 2012 Olympics Torch Relay from Lands End with Charlie Stayt presenting from the BBC Breakfast studio.", "On 17 April 2013, Charlie Stayt presented the show from St Paul's Cathedral, London for a special split edition in the build-up of the funeral of Baroness Margaret Thatcher.", "Charlie Stayt and Sally Nugent presented live from Westminster the day after the 2017 terror attack.", "Charlie Stayt and Louise Minchin spoke to MPs in Westminster on 10 June 2017 about the hung Parliament result from 8 June.", "Naga Munchetty and Charlie Stayt presented a special on the Grenfell Tower fire that happened during the night, followed by a broadcast the next day with Charlie live from West London and Naga in the studio talking to people.", "On 13 December 2018, Naga Munchetty and Charlie Stayt presented live from College Green, Westminster focusing on the unsuccessful vote of no confidence in Prime Minister Theresa May by Conservative Party MPs.", "Charlie Stayt and Steph McGovern presented live from Endcliffe Park in Sheffield when a flypast took place for the 75th anniversary of the \"Mi Amigo\" crash.", "On 17 April 2021 Charlie Stayt presented BBC Breakfast from Windsor Castle on the day of Prince Philip, Duke of Edinburgh funeral with Naga Munchetty presenting the show from the studio."]}, {"page": "Wycliffe College, Gloucestershire", "response": ["* Charlie Stayt, presenter of BBC Breakfast on BBC One"]}, {"page": "Louise Minchin", "response": ["In 2006 and 2007, Minchin was a relief presenter on BBC Breakfast while Kate Silverton covered for main anchor Sian Williams. After Williams returned, she continued to co-host the programme, and from May 2009 until April 2012 was the regular weekend presenter of the show.Methven, Nicola,\"Newsreader Louise Minchin lands BBC Breakfast sofa spot\", Daily Mirror, 9 December 2011 In December 2011, the BBC announced that Minchin would replace Williams as a main presenter of BBC Breakfast along with Bill Turnbull and Charlie Stayt when the programme moved to Salfordthe first edition was presented on Tuesday 10 April 2012. On Tuesday 8 June 2021, she announced live on BBC Breakfast that she would be stepping down from the role later that year to concentrate on other interests. Her final appearance on the show was on 15 September 2021."]}, {"page": "Saturday Kitchen", "response": ["* Charlie Stayt"]}, {"page": "Susanna Reid", "response": ["Susanna Victoria Reid (born 10 December 1970) is an English television presenter and journalist. She was a co-presenter of BBC Breakfast from 2003 until 2014 alongside Bill Turnbull and Charlie Stayt. In 2013, she finished as a runner-up on the eleventh series of Strictly Come Dancing. Since 2014, Reid has been the lead presenter of the ITV Breakfast programme Good Morning Britain alongside Ben Shephard, Kate Garraway and formerly Piers Morgan. She also presented Sunday Morning Live on BBC One from 2010 to 2011.", "Reid was one of the main presenters on BBC Breakfast, presenting with Bill Turnbull on Mondays, Tuesdays and Wednesdays and previously presenting with Charlie Stayt on Fridays, Saturdays and Sundays. She held that role from 2012, when she replaced lead presenter Sian Williams. In 2010, Reid stepped down from presenting Breakfast on Saturdays and Sundays to take a role on a new programme Sunday Morning Live.Sunday Morning Live  BBC One As of the final episode of the first series on 21 November 2010, she resumed her weekend presenting duties on BBC Breakfast within 2 weeks.Susanna Reid  Twitter post, dated 20 November 2010"]}, {"page": "Simon McCoy", "response": ["In 2006, McCoy stopped regular appearances on BBC Breakfast upon Charlie Stayt's arrival at the BBC, but continued to be a relief presenter on the BBC Weekend News.  Since 2008, McCoy made a number of appearances as a stand-in presenter on Breakfast."]}, {"page": "5 News", "response": ["| 1997–2005 || Charlie Stayt"]}, {"page": "Sally Nugent", "response": ["Sally Nugent (born 5 August 1971) is an English journalist, newsreader and television presenter. Since October 2021, she has presented BBC Breakfast along with Dan Walker, Naga Munchetty and Charlie Stayt.", "On 27 October 2021, it was announced that Nugent would become a permanent presenter of BBC Breakfast alongside Dan Walker, Charlie Stayt, and Naga Munchetty; she is to replace Louise Minchin following Minchin's departure after 20 years on the programme."]}, {"page": "Jailbreak (TV series)", "response": ["Jailbreak was a reality television game show. It was hosted by Craig Charles, and co-presented by Charlie Stayt and Ruth England. It was shown in 2000 by Five in the United Kingdom. Original host Ulrika Jonsson had to pull out of the project due to health concerns over her newborn child.BBC news story on host change for new series Jailbreak"]}, {"page": "List of current BBC newsreaders and reporters", "response": ["| Charlie Stayt "]}, {"page": "Total Wipeout", "response": ["The fifth series kicked off with another two celebrity editions on 27 August 2011 and 3 September 2011. The first episode featured Dalton Grant, Ricky Groves, Gail Emms, Charlie Stayt, Roxanne Pallett, Simon Day, Brian Belo, Camilla Dallerup, Nicola McLean and Julie Peasgood. It was won by Dalton Grant, with Ricky Groves in second and Gail Emms in third place."]}, {"page": "2000 in British television", "response": ["**Debut of Jailbreak, a reality television show described as Channel 5's answer to Big Brother, in which contestants can win £100,000 by escaping from a mock prison. The three-week show, presented by Craig Charles, Ruth England and Charlie Stayt is criticised by prisoners' groups. Roberta Woodhouse, Hannah Davies and Laura Hawkins become the first contestants to escape on 23 September."]}, {"page": "Children in Need 2009", "response": ["* Four female BBC Newsreaders (Sophie Raworth, Fiona Bruce, Susanna Reid and Kate Silverton) performed a medley of Beyoncé Knowles songs including \"Crazy in Love\" and \"Single Ladies (Put a Ring on It)\". They were then joined by four male newsreaders (Charlie Stayt, Ben Brown, Bill Turnbull and Nicholas Owen) for a dance off against Diversity. During the second half of the television broadcast a behind the scenes video was shown of the rehearsals before a repeat of the dance itself"]}, {"page": "List of Birmingham City University people", "response": ["*Charlie Stayt — BBC newsreader"]}, {"page": "2013 Challenge Cup", "response": ["The draw for the quarter-finals took place on 18 May with the draw shown on BBC Breakfast on BBC One by presenters Louise Minchin and Charlie Stayt. Matches took place over four days between 12 and 15 July 2013 with matches on Saturday 13 and Sunday 14 July shown live on BBC Two and the matches on Friday 12 and Monday 15 July shown live by Sky Sports."]}, {"page": "2014 in British television", "response": ["|BBC Breakfast confirms that Naga Munchetty will leave BBC World News to join the presenting team full-time to present shows alongside Charlie Stayt from Thursdays to Saturdays. Bill Turnbull and Louise Minchin will continue to present from Mondays to Wednesdays."]}, {"page": "2016 in British television", "response": ["|BBC Breakfast presenters Charlie Stayt and Naga Munchetty apologise after footage of a gorilla was shown while introducing an item concerning First Minister of Scotland Nicola Sturgeon."]}, {"page": "Red Nose Day Actually", "response": ["* Charlie Stayt as Reporter"]}, {"page": "Ben Rich (weather forecaster)", "response": ["He was described by Charlie Stayt on BBC Breakfast on 30 May 2020 as having a smile like the Cheshire Cat. Rich then stated after the comment that nobody had previously described his smile in such a way before."]}, {"page": "Timeline of breakfast television in the United Kingdom", "response": ["**14 July – BBC Breakfast confirms that Naga Munchetty will leave BBC World News to join the presenting team full-time to present shows alongside Charlie Stayt from Thursdays to Saturdays. Bill Turnbull and Louise Minchin will continue to present from Mondays to Wednesdays."]}, {"page": "Stayt", "response": ["*Charlie Stayt (born 1962), British journalist"]}]}}