{"wiki_id": "http://www.wikidata.org/entity/Q5085059", "itemLabel": "Charlie I'Anson", "itemDescription": "British footballer (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_I%27Anson", "wikipedia_page": {"main": "Charlie Dean I'Anson (born 1 July 1993), known in Spain as simply Charlie, is an English professional footballer who plays as a centre back for Spanish club UCAM Murcia.\nHe started his career at Grimsby Town, with whom he spent two years in the Conference. In 2012, he moved to Elche, whom he represented in La Liga.", "link_mentions": [{"page": "Grimsby Town F.C.", "response": ["* Charlie I'Anson"]}, {"page": "List of foreign La Liga players", "response": ["*Charlie I'Anson – Elche – 2013–14"]}, {"page": "I'Anson", "response": ["*Charlie I'Anson (born 1993), English footballer "]}, {"page": "Isco", "response": ["Isco was born in Benalmádena, Málaga, Andalusia. As a child he played for Atlético Benamiel, where his teammates included Charlie I'Anson. A product of Valencia's youth system, he spent the 2009–10 season with the club's reserve team in Segunda División B, netting once in 26 games and suffering relegation."]}, {"page": "Liam Hearn", "response": ["Grimsby's biggest win of the season came on 29 November 2011 in a 7–0 thrashing over Stockport County, Hearn scored his third hat-trick, on 22 minutes Grimsby were 2–0 up when Jamie Green from inside the box squared to the unmarked Hearn who scored a tap-in to the bottom left corner of the goal inside the area, on 45 minutes Hearn put Grimsby 5–0 up when Anthony Elding found Hearn who struck from 10 yards out, on 58 minutes Jamie Green took a corner which was met by Charlie I'Anson providing the knockdown to Hearn who then rifled into the roof of the net from a few yards for the 6th goal."]}, {"page": "Shaun Pearson", "response": ["In August 2011 Pearson and Town teammate Charlie I'Anson were called up to the England C team to face the India Under-23's team."]}, {"page": "List of Spanish football transfers winter 2017–18", "response": ["|  ||  Charlie I'Anson ||  Granada ||  Murcia ||  Free"]}, {"page": "List of foreign Segunda División players", "response": ["*Charlie I'Anson – Alcorcón, Granada  – 2014–15, 2017–18"]}]}}