{"wiki_id": "http://www.wikidata.org/entity/Q5083724", "itemLabel": "Charles Wreford-Brown", "itemDescription": "English cricketer (1866-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Wreford-Brown", "wikipedia_page": {"main": "Charles Wreford-Brown (9 October 1866 – 26 November 1951) was an English sportsman. He captained the England national football team and was a county cricketer during the Victorian age, and later acted as a sports legislator during the 20th century. Wreford-Brown is usually credited with inventing the term soccer as an abbreviation for association football.", "link_mentions": [{"page": "University of Oxford", "response": ["Oxford students have also excelled in other sports. Such alumni include American football player Myron Rolle (NFL player); Olympic gold medalists in athletics David Hemery and Jack Lovelock; basketball players Bill Bradley (US Senator, NBA player, and Olympic gold medalist) and Charles Thomas McMillen (US Congressman, NBA player, and Olympic silver medalist); figure skater John Misha Petkevich (national champion); footballers John Bain, Charles Wreford-Brown, and Cuthbert Ottaway; fencer Allan Jay (world champion and five-time Olympian); modern pentathlete Steph Cook (Olympic gold medalist); rugby footballers Stuart Barnes, Simon Danielli, David Humphreys, David Edward Kirk, Anton Oliver, Ronald Poulton-Palmer, Joe Roff, and William Webb Ellis (allegedly the inventor of rugby football); World Cup freestyle skier Ryan Max Riley (national champion); polo player Claire Tomlinson (highest ranked woman world-wide); and tennis player Clarence Bruce."]}, {"page": "Charterhouse School", "response": ["In the early years of the FA Cup, teams formed of ex-pupils from these schools dominated the competition. The Old Carthusians F.C. (the name for the team composed of Charterhouse alumni) won the cup in the 1880–81 season, beating the Old Etonians in the final, and were semi-finalists in the two years that followed. The public school system also provided many of the first England internationals. They included Charles Wreford-Brown, who is often credited for inventing the word \"soccer\". He was a pupil at Charterhouse in the early 1880s, and played football for the Old Carthusians and for the national side in the 1890s, including several appearances as captain."]}, {"page": "Football at the 1920 Summer Olympics", "response": ["The Czechoslovaks were also unhappy with the performance of the 65-year-old English referee, John Lewis, who had already refereed the Belgian semi-final victory over the Netherlands, a match observed by the Czechoslovaks (it had taken place on the same day and in the same stadium as their own victory against France), as well as the English linesmen, Charles Wreford-Brown and A. Knight, who had allowed a contentious second Belgian goal in the 30th minute that Henri Larnoe had converted."]}, {"page": "Names for association football", "response": ["The rules of association football were codified in England by the Football Association in 1863, and the nickname association football was coined in England to distinguish the game from the other versions of football played at the time, in particular rugby football. The word soccer is an abbreviation of association (from assoc.) and first appeared in English private schools and universities in the 1880s (sometimes using the variant spelling \"socker\"). The word is sometimes credited to Charles Wreford-Brown, an Oxford University student said to have been fond of shortened forms such as brekkers for breakfast and rugger for rugby football (see Oxford -er). However, the attribution to Wreford-Brown in particular is generally considered to be spurious. Clive Toye noted \"they took the third, fourth and fifth letters of Association and called it SOCcer.\""]}, {"page": "Category talk:Chess players", "response": ["Charles Wreford-Brownnot yet classified"]}, {"page": "Charles Brown", "response": ["* Charles Wreford-Brown (1866–1951), British footballer"]}, {"page": "Football (word)", "response": ["The word \"soccer\" originated as an Oxford \"-er\" slang abbreviation of \"association\", and is credited to late nineteenth century English footballer, Charles Wreford-Brown. Ekblom mentions that while he was up at Oxford, Charles Wreford-Brown was asked at breakfast if he was playing rugger \"No\" he replied \"I'm playing soccer\" (Granville, 1969, p. 29). But Ekblom opinions that like the William Webb Ellis rugby story it is most likely apocryphal. However, like the William Webb Ellis rugby story, it is believed to be most likely apocryphal. There is also the sometimes-heard variation, \"soccer football\"."]}, {"page": "Football Tasmania", "response": ["Soccer was first played in Tasmania during the colonial period, but was never as popular as cricket, and the advent of Australian rules football in the mid-nineteenth century, soon saw that code surpass both rugby and football in popularity within the island colony. The code was generally referred to as British Association Football, to distinguish it from Rugby, and Australian rules, which soon became known locally as 'football' or 'footy'. The term soccer originated in England, first appearing in the 1880s as a slang abbreviation of the word \"association\", often credited to former England captain Charles Wreford-Brown. It is not clear when the term 'soccer' came into common use in Tasmania, but by the early twentieth century it was the more common term."]}, {"page": "Oxford University A.F.C.", "response": ["*Charles Wreford-Brown (1 cap)"]}, {"page": "List of England national football team captains", "response": ["|66||style=\"text-align:left;\"|||1889–1898||2 or 3Sources differ concerning the captaincy for England vs Wales, 12 March 1894. It was either Charles Wreford-Brown or Cunliffe Gosling ||4||18 March 1895"]}, {"page": "Old Carthusians F.C.", "response": ["*Charles Wreford-Brown (3 caps)"]}, {"page": "Sheriff of London Charity Shield", "response": ["In 1898 a shield was offered by Sir Thomas Dewar, the Sheriff of London at the time, with the understanding that it would pit the best professional side and amateur side against each other with proceeds going to charity. A high profile committee of Football Association and amateur football representatives, politicians and England players past and present was formed composed of Sir Dewar; Lord Kinnaird (President of the FA); Sir Reginald Hanson (Lord Mayor of London); Sir Francis Marindin (Former President of the FA); Sir William Bromley-Davenport (Member of Parliament and former England international footballer); Colonel Harry McCalmont (Member of Parliament), R. Cunliffe Gosling (former England captain), Dr. Kemp (a former player for the London-based United Hospitals side), N. L. Jackson (FA Honorary Secretary and Founder of Corinthian), John Bentley (President of the Football League), and Charles Wreford-Brown (former England captain and FA Council member).", "The match was later resurrected in the 1930s over four years at the suggestion of Charles Wreford-Brown, a member of the original Shield committee, to raise funds for the National Playing Fields Association. The trophy was again competed for in the 1960s for three years with funds supporting Corinthians Casuals Football Club, the successor to the original Corinthian side. The most recent match for the shield trophy was a one-off game played between Watford and Corinthian Casuals in 1983, marking the centenary of Corinthians original formation. Watford ran out as 6–1 winners. All seven matches in the post-1907 era were London-only affairs."]}, {"page": "List of Old Carthusians", "response": ["*Charles Wreford-Brown (1866–1951), English international football captain and cricketer"]}, {"page": "Herbie Hewett", "response": ["Following the close of the 1891 County Championship, Hewett was part of Lord Hawke's party which toured North America, playing six matches in the United States of America and two in Canada. Sammy Woods wrote that Hewett, along with Charles Wreford-Brown and George Ricketts, became very seasick on the journey there.Woods (1925), p. 45. The first two matches were first-class fixtures against the Gentlemen of Philadelphia. Hewett scored 30 and 49 in the first, an eight wicket loss which Woods blamed on taking place too soon after their arrival, claiming the team \"had hardly found our land-legs.\" The first match had yielded an aggregate of 861 runs, the second contained only 352, of which Hewett scored 10 and 29. His captain, Lord Hawke, was the only other batsman to reach double figures in both innings as the touring side won by four wickets. None of the remaining fixtures on the tour had first-class status, and not all were eleven-a-side contests. Hewett scored 113 against the sixteen man All New York on Staten Island, a match in which he was standing in as captain due to Lord Hawke being ill.Woods (1925), p. 46. Woods rated Hewett, along with Lord Hawke and Brown, as the best batsmen on the tour.Woods (1925), p. 47."]}, {"page": "1860s in association football", "response": ["* 9 October – Charles Wreford-Brown (d.  1951), England international in four matches (1889–1898)."]}, {"page": "List of Oriel College, Oxford, people", "response": ["*Charles Wreford-Brown – Captained the English national football team several times between 1894 and 1895, credited with inventing the word soccer."]}, {"page": "Oxford \"-er\"", "response": ["The term \"soccer\", derived from a transformation/emendation of the \"assoc\" in Association football, was popularised by a prominent English footballer, Charles Wreford-Brown (1866–1951). Ekblom mentions that while he was up at Oxford, Charles Wreford-Brown was asked at breakfast if he was playing rugger \"No\" he replied \"I'm playing soccer\" (Granville, 1969, p. 29). But Ekblom opinions that like the William Webb Ellis rugby story it is most likely apocryphal. The first recorded use of \"soccer\" was in 189519th Cent. Nov. 862. \"When the boat~race, sports, and 'soccer' are in most men's minds.\" OED (soccer) (or even earlier in 1892). Two years earlier The Western Gazette reported that \"W. Neilson was elected captain of 'rugger' and T. N. Perkins of 'socker'\"1893 Westm. Gaz. 17 Oct. 5/3. OED (rugby). and Henry Watson Fowler recommended socker in preference to \"soccer\" to emphasise its correct pronunciation (i.e. hard \"cc/ck\").A Dictionary of Modern English Usage, 1926. See also Susie Dent on Countdown, Channel 4 TV, 30 June 2009. In this context, he suggested that \"baccy\", because of the \"cc\" in \"tobacco\", was \"more acceptable than soccer\" (there being no \"cc\" in \"Association\"). \"Socker\" was the form that appeared in the first edition of the Concise Oxford Dictionary (1911).The Times, 18 August 2011"]}, {"page": "John Lewis (referee)", "response": ["The Czech delegation made the following statement in regard to their protest:  \"2. The majority of the decisions of the referee Mr. Lewis were distorted and it was obvious that it gave the public the wrong impression in regard to our game. Also both Belgian goals were the result of incorrect decisions of the referee and we seek a rigorous investigation on that point.\"  They had also complained about the inclusion and performance of an English linesman, Charles Wreford-Brown, and the provocative influence of the troops lining the field."]}, {"page": "Charles Wreford Brown", "response": ["#REDIRECT Charles Wreford-Brown"]}, {"page": "1897–98 British Home Championship", "response": ["|align=left|Charles Wreford-Brown"]}, {"page": "1894–95 British Home Championship", "response": ["|align=left|Charles Wreford-Brown"]}, {"page": "List of University of Oxford people in sport, exploration, and adventuring", "response": ["*Charles Wreford-Brown (Oriel)"]}, {"page": "Arthur Melmoth Walters", "response": ["Despite the promise made to their parents, the brothers made a return to the Corinthians for a multi-sport tournament against the Barbarians rugby club in April 1892. Arthur played in the soccer match (without Percy) which Corinthian won 6–0, with Tinsley Lindley scoring a hat-trick. The clubs also played a rugby match, which Corinthian won 16–13, although the match was not a very serious encounter and was described by The Times newspaper as \"a very amusing game\".Quoted in  The rugby match was followed by an athletics meeting in which C. B. Fry was prominent, winning both the long jump and high jump. Finally, the two clubs met a few weeks later in a cricket match in which Percy played alongside several other prominent Corinthians, including Fry, Lindley and Charles Wreford-Brown."]}, {"page": "Percy Melmoth Walters", "response": ["Despite the promise made to their parents, the brothers made a return to the Corinthians for a multi-sport tournament against the Barbarians rugby club in April 1892, although Percy did not play in the soccer match which Corinthian won 6–0, with Tinsley Lindley scoring a hat-trick. The clubs also played a rugby match, which Corinthian won 16–13, although the match was not a very serious encounter and was described by The Times newspaper as \"a very amusing game\".Quoted in  The rugby match was followed by an athletics meeting in which C. B. Fry was prominent, winning both the long jump and high jump. Finally, the two clubs met a few weeks later in a cricket match in which Percy played alongside several other prominent Corinthians, including Fry, Lindley and Charles Wreford-Brown."]}, {"page": "Frank Forman", "response": ["Forman was not selected for the match against Wales on 28 March, but was picked for the match against Scotland on 2 April, when he played alongside Charles Wreford-Brown who was making his final appearance for the national team. The match, which would decide who would win the 1898 British Home Championship, was played at Celtic Park in Glasgow. The Scots were defeated by a fast and powerful England side who ran out 3–1 winners and took the trophy, with goals from Steve Bloomer (2) and Fred Wheldon.Scotland 1 – England 3; 2 April 1898 (Match summary)"]}, {"page": "List of English cricket and football players", "response": ["| Charles Wreford-Brown"]}, {"page": "List of people with surname Brown", "response": ["*Charles Wreford-Brown (1866–1951), captain of the English national association football team"]}, {"page": "George Cotterill", "response": ["In April 1892, Corinthians played a multi-sport tournament against the Barbarians rugby club. Cotterill played at inside right in the soccer match which Corinthian won 6–0, with Tinsley Lindley scoring a hat-trick. Cotterill also played in the rugby match, which Corinthian won 16–13, although the match was not a very serious encounter and was described by The Times newspaper as \"a very amusing game\". The rugby match was followed by an athletics meeting in which C. B. Fry was prominent, winning both the long jump and high jump, with Cotterill winning the \"Putting the Weight\" with a distance of 34 ft 1in. Finally, the two clubs met a few weeks later in a cricket match in which Cotterill played alongside several other prominent Corinthians, including Fry, Lindley and Charles Wreford-Brown, with the Barbarians winning by four wickets."]}, {"page": "Moturoa AFC", "response": ["The English Amateur XI toured New Zealand in 1937 accompanied by the seventy year old Charles Wreford-Brown arriving in Auckland on the . The English were proclaimed, \"the Greatest Exponents of Football.\" and player Ted Collins, \"the Fastest Man on a Football Field. He owns Greyhounds and trains with them. Terry Huddle, goalkeeper, 6ft 3in of muscle, can throw the ball as far as the average kick. Every player a star attraction,\" in an advertisement before the game against Wellington. Arthur Stollery, the future Notts County F.C. manager would be the trainer for the English Amateurs. The Taranaki region would not see a visit from the international English team though a few players were invited to join a Wanganui/Taranaki team that played the English XI on 17 June at Cooks Gardens in Wanganui. 2000+ spectators watch a 12 - 0 lesson handed out by the English on a sodden ground in steady rain. The match report from Wanganui in the New Zealand Herald started under the headline \"Goalkeeper's Holiday\" with the report further explicating, \"The Englishmen led 5-nil at halftime, their positional play, and short, snappy passing repeatedly undoing everything that their opponents accomplished. It was a treat to watch the cross-field tactics of the visitors and to note how carefully each kick placed the ball to a waiting team mate. But for the Wanganui goalkeeper, Alex Healey, the score would have been well in the twenties. His performance was remarkable considering that 90 per cent, of the play hovered around his goal. In contrast the English goalkeeper had time to sign autograph books while play was in progress.\" Apart from Healey, Whiting, left-half, and Proudfoot, left-back, were outstanding in the Wanganui-Taranaki team, which was never anything but a side of individuals. The paper then followed, \"The outstanding player on the English side was Bernard Joy, centre-half, who was never extended throughout the match but gave glimpses of what he would be capable of if pressed. The English team never passed the ball to disadvantage, whereas the home players would attempt combination only to find an Englishman ready to accept a pass not intended for him. Roy Matthews scored six goals, Bernard Joy two, William Parr two, and Fred Davies and Tommy Leek one each. Roy Matthews the English forward from Walthamstow Avenue F.C. reached an incredible 26 goals in the nine games of the New Zealand leg of the tour before the side left for Sydney. 1937 tour members, Lester Finch, Frederick Riley, John Sutcliffe, Louis Terry Huddle, Bernard Joy and Corporal Stan Eastham had all been members of the Great Britain Olympic team at the 1936 games in Berlin, Germany."]}, {"page": "Lord Hawke's XI cricket team in North America in 1891–92", "response": ["| Charles Wreford-Brown || Gloucestershire ||  || Right-handed || Right arm slow || ", "The party left Liverpool on 16 September 1891, and during the voyage Herbie Hewett, George Ricketts and Charles Wreford-Brown suffered badly from seasickness.  Sammy Woods, who was not affected by such ailments, attempted to get the three men to take dinner with him on the fourth evening.  He served champagne and vegetable soup, but an American who was also suffering from nausea commented \"Say steward, did you bring this up or did I?\"  None of Woods' three team-mates ate the dinner.Woods (1925), p45. The party landed in New York on the evening of 23 September and immediately made their way to Philadelphia for a half-day's practice before their first match."]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* Charles Wreford-Brown (1886–1898) : C. Wreford-Brown"]}, {"page": "Charles Wredford Brown", "response": ["#REDIRECT Charles Wreford-Brown "]}, {"page": "Charles Wreford", "response": ["#REDIRECTCharles Wreford-Brown"]}]}}