{"wiki_id": "http://www.wikidata.org/entity/Q5083588", "itemLabel": "Charles William Selwyn", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_William_Selwyn", "wikipedia_page": {"main": "Captain Charles William Selwyn DL (7 March 1858, London – 1 March 1893, Auckland, New Zealand) was a British army officer and Conservative politician.\nHe was the eldest son of the Rt Hon. Sir Charles Jasper Selwyn, Lord Justice of Appeal, and his first wife, Hester née Ravenshaw. He was educated at Eton and Trinity College, Cambridge, before being commissioned in the Royal Horse Guards in 1878.  He served with distinction with the regiment in the Anglo-Egyptian War of 1882. He made his home at Selwyn Court, Richmond, Surrey. In 1884 he married Isabella Constance Dalgety of Lockerley Hall, Romsey, Hampshire, the second daughter of Frederick Dalgety. He was promoted captain in 1885.In 1885 Selwyn was selected as Conservative candidate to contest the new constituency of Wisbech, but was defeated by his Liberal opponent John Rigby.  A further general election was held in 1886, and he again stood against Rigby, this time winning the seat to become Member of Parliament for Wisbech. He was called to the Bar at the Inner Temple in 1886. Captain Selwyn threatened to horsewhip his younger sister's seducer, Colonel Francis Hughes-Hallett MP, if they ever crossed paths in the House of Commons. In 1890 he was appointed a deputy lieutenant of Cambridgeshire.In October 1890 Selwyn informed the local Conservative and Unionist Association that his health would not allow him to undertake a contested election. His health deteriorated to such a degree that he was forced to resign from the Commons on 4 July 1891 by accepting the office of Steward of the Chiltern Hundreds. It has been suggested that his resignation was also, in part, due to pique at being refused a baronetcy.He died aged 34 in Auckland, New Zealand on 1 March 1893. He was buried at St John's College, Auckland, which was established in 1843 by his uncle George Augustus Selwyn, the first Bishop of New Zealand.", "link_mentions": {}}}