{"wiki_id": "http://www.wikidata.org/entity/Q5080586", "itemLabel": "Charles Magniac", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Magniac", "wikipedia_page": {"main": "Charles Magniac (1827 – 23 November 1891) was a British financier and  Liberal politician who sat in the House of Commons in two periods between 1868 and 1886.\nMagniac was the eldest son of Hollingworth Magniac of Colworth, Bedfordshire. Following education at Eton College and the University of Cambridge, he worked in finance in the City of London, becoming a partner in Matheson and Company of Lombard Street. He was appointed a deputy lieutenant for the city, and was the first president of the London Chamber of Commerce. In about 1869 Magniac purchased Chesterfield House the great Mayfair townhouse built 1747-52 by Philip Stanhope, 4th Earl of Chesterfield, which had been threatened with demolition.", "link_mentions": [{"page": "Francis Younghusband", "response": ["In 1897 Younghusband married Helen Augusta Magniac, the daughter of Charles Magniac, MP. Augusta's brother, Vernon, served as Younghusband's private secretary during the expedition to Tibet.Fleming, Peter (2012). Bayonets to Lhasa - the British invasion of Tibet. Tauris Parke, London. . The Younghusbands had a son who died in infancy, and a daughter, Eileen Younghusband (1902–1981), who became a prominent social worker.Dictionary of National Biography"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Charles Magniac"]}, {"page": "Bedford (UK Parliament constituency)", "response": ["|Charles Magniac ||Liberal"]}, {"page": "St Ives (UK Parliament constituency)", "response": ["| Charles Magniac"]}, {"page": "Biggleswade (UK Parliament constituency)", "response": ["|Charles Magniac || Liberal"]}, {"page": "Christ Crowned with Thorns (Bosch, London)", "response": ["It was in the collection of Hollingworth Magniac, known as the Colworth collection, and then sold from the estate of his son Charles Magniac in 1892 and bought by Robert Thompson Crawshay (the fourth son of Robert Thompson Crawshay).  It was later bought by an art dealer, the Galleria San Giorgio in Rome, and it was bought by the National Gallery in 1934."]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Charles Magniac"]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Charles Magniac"]}, {"page": "Hollingworth Magniac", "response": ["*Charles Magniac, Member of Parliament for St. Ives 1868-74 and for Bedford 1880-85"]}, {"page": "Chesterfield House, Westminster", "response": ["Faced with the prospect of demolition in 1869, the house was purchased by the City merchant Charles Magniac, who considerably curtailed the grounds in the rear, and erected a row of  buildings overlooking Chesterfield Street, named Chesterfield Gardens."]}, {"page": "Leconfield House", "response": ["The site at the junction of South Audley Street and Curzon Street was occupied in the second half of the 18th century, all of the 19th century and the first part of the 20th century by Chesterfield House, which was built in 1749 for Philip Stanhope, 4th Earl of Chesterfield. In 1869 Chesterfield House was purchased by the City of London merchant Charles Magniac, who considerably curtailed the grounds in the rear, and erected a row of buildings overlooking Chesterfield Street, named Chesterfield Gardens; the first occupier at No. 9 Chesterfield Gardens was Lord Leconfield."]}, {"page": "Magniac, Charles", "response": ["#redirectCharles Magniac"]}]}}