{"wiki_id": "http://www.wikidata.org/entity/Q5080648", "itemLabel": "Charles March Gere", "itemDescription": "British artist (1869-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_March_Gere", "wikipedia_page": {"main": "Charles March Gere RA RWS (5 June 1869 – 3 August 1957) was an English painter, illustrator of books, and stained glass and embroidery designer associated with the Arts and Crafts movement.\nA member of the Birmingham Group of Artist-Craftsmen that formed around Joseph Southall, Gere taught at the Birmingham School of Art under Edward R. Taylor and illustrated many books for William Morris's Kelmscott Press, including the frontispiece of Morris's own News from Nowhere.Gere painted a signal work in 1897 entitled The Lady of Grey Days. The painting was bought in 1912 and given to Aurora Howard by her mother. She was a descendant of the Earl of Carlisle, of Castle Howard. The painting was last seen in public in 1988, when it was included in an exhibition called The Last Romantics at the Barbican. It was used as a poster to advertise the exhibition on most London Underground stations. It is illustrated on the internet and is now in a private collection.", "link_mentions": [{"page": "Gere", "response": ["* Charles March Gere (18691957), English painter, illustrator, stained glass and embroidery designer"]}, {"page": "Madresfield Court", "response": ["The chapel was decorated in the Arts and Crafts style by Birmingham Group artists including Henry Payne, William Bidlake and Charles March Gere. The decoration was a 1902 wedding present from Lady Lettice Grosvenor to her bridegroom the 7th Earl, although work on it continued until 1923. Murals on the chapel's walls incorporate images of the couple, as well as their seven children, in scenes rife with Christian symbolism. The critic Jonathan Meades, in the BBC TV series Travels with Pevsner, contrasted the \"inviting prose\" used by Waugh to describe the chapel at Brideshead with the \"prosaic list\" written by Nikolaus Pevsner to describe Madresfield's chapel."]}, {"page": "Birmingham Guild of Handicraft", "response": ["The Guild also published fine books under the imprint of the \"Press of the Birmingham Guild of Handicraft, Limited\"; and a periodical titled The Quest. The Quest began in November 1894 and aimed to appear three times a year, but was short-lived. William Morris was a contributor. Those involved with the press were Ernest Treglown, Arthur Gaskin, and Charles March Gere. Charles Carr and Mary Newill were book illustrators for the Guild. The press was still active in 1919, when it published Memorials: The Work of the Architect and Craftsman in the Design and Execution of War Memorials."]}, {"page": "Birmingham Group (artists)", "response": ["They began to form in an informal manner in the 1890s. Many were later to become teachers in Birmingham (especially the great Birmingham Municipal School of Art under Edward R. Taylor), and this meant that the Edward Burne-Jones style influenced all those who studied at the Birmingham art schools.  Many were also heavily influenced by the ideas and practices of John Ruskin and William Morris, and had indeed personally known those men.  Several had undertaken work for the Kelmscott Press, with Charles March Gere producing the famous frontispiece to News from Nowhere. Many, unable to support themselves only through their art, also became fine crafts makers as well as teachers.", "* Charles March Gere (1869–1957)"]}, {"page": "Henry Payne (artist)", "response": ["In common with most of the Birmingham Group he worked across a wide variety of media, producing book illustrations for the Birmingham Guild of Handicraft and interior decoration for the Bromsgrove Guild of Applied Arts. Although most prolific in stained glass, Payne's most notable achievements were arguably in the field of decorative painting. Between 1902 and 1923 he worked on the wall paintings of the chapel at Madresfield Court near Malvern in Worcestershire. Painted as fresco in tempera and sitting alongside work by other figures of the Birmingham Arts and Crafts movement such as William Bidlake, Georgie Gaskin and Charles March Gere, Madresfield Court is \"not only Payne's most important scheme of decorative painting, but probably the most famous of all such Arts and Crafts schemes.\""]}, {"page": "List of Birmingham City University people", "response": ["*Charles March Gere"]}, {"page": "Gere, Charles March", "response": ["#REDIRECTCharles March Gere"]}, {"page": "Art of Birmingham", "response": ["The first indication of the rise of a distinctive group artists was the 1893 commission of a set of murals for Birmingham Town Hall from artists including Kate Bunce, Henry Payne, Charles March Gere, Sidney Meteyard and Bernard Sleigh, while most were still students. The group's greatest collective work was the later decoration of the interior of the chapel of Madresfield Court near Malvern in 1902, which featured frescoes and stained glass by Payne, an altarpiece by Gere and a crucifix designed and made by Arthur and Georgie Gaskin.", "The results of this revolution in art education were far-reaching. Over the course of the 1880s and 1890s the Birmingham School of Art became the focus of a generation of distinguished designers, all of whom had studied there and most of whom went on to teach there, who became known as the Birmingham Group. This included the stained glass designers Henry Payne, Sidney Meteyard, Florence Camm and Bernard Sleigh; the wood engravers and book illustrators E. H. New and Charles March Gere; the jewellers and metalworkers Arthur Dixon, Arthur Gaskin and Georgie Gaskin; and the furniture designers Ernest Barnsley and Sidney Barnsley.;  The influence of the school's teaching also permeated beyond this inner circle, and important work in an Arts and Crafts style was also produced by organisations such as the Birmingham Guild of Handicraft, the Bromsgrove Guild of Applied Arts, the Kynoch Press and the Ruskin Pottery; and commercial firms such as the silversmiths A. E. Jones, the stained glass workshops of T. W. Camm and Co. and the metalworkers Henry Hope and Son."]}, {"page": "Margaret Gere", "response": ["Gere studied at the Birmingham School of Art during the 1890s under her brother, painter Charles March Gere. Later in life, she would accompany him on painting trips aboard. From 1900 she studied Italian painting in Florence. In 1905 she enrolled at the Slade School of Art, where she became friends with both Virginia Woolf and Ethel Walker. Gere exhibited works at the New English Art Club, and had solo shows at galleries including the Cotswold Gallery (1922) and the Beaux Arts Gallery (1929). A retrospective was held at Cheltenham Art Gallery in 1984."]}, {"page": "Mary J. Newill", "response": ["Mary Jane Newill was born in Shropshire, England in 1860. She studied at the Birmingham School of Art in the 1880s and 1890s. Fellow students included Charles March Gere, Sidney Meteyard, and Henry Payne. Awarded a John Skirrow Wright scholarship in 1880, Newell continued her studies in Paris.  She returned to Birmingham and was hired to teach embroidery and design at the Birmingham School of Art in 1892, a position she occupied until 1919."]}, {"page": "Holcombe House", "response": ["Holcombe House was originally built for a wealthy clothier from Painswick in the late 1600s, and was later enlarged and remodelled in the early 1900s by Detmar Blow in the Arts and Crafts manner. The house was subject of a painting by Charles March Gere in 1926."]}, {"page": "John Gere", "response": ["Gere was born on 7 October 1921 to Edward Arnold Gere, a patent examiner, and Catherina (née Giles), who moved in Vorticist circles; on his father's side, his half-uncle Charles March Gere and two aunts (Margaret Gere and Edith Payne, the wife of H. A. Payne) were artists of the Birmingham School. By the time he started school at Winchester College, he was already immersing himself in art, reading and culture. In 1939, he joined the British Army, but was forced to leave for health reasons and attended Balliol College, Oxford, from 1940 to 1943; he read English under John Bryson,Christopher White, \"John Arthur Giles Gere, 1921–1995\", Proceedings of the British Academy, vol. 90 (1996), pp. 367–371. achieved a third and received his BA in 1945.Sir Ivo Elliott, The Balliol College Register, 3rd ed. (Oxford: Oxford University Press, 1953), p. 408."]}]}}