{"wiki_id": "http://www.wikidata.org/entity/Q5085863", "itemLabel": "Charlotte Bray", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlotte_Bray", "wikipedia_page": {"main": "Charlotte Bray (born 1982) is a British composer.  She was championed by the Royal Opera House Covent Garden, London Sinfonietta and Birmingham Contemporary Music Group, BBC Symphony Orchestra.  Her music has been performed by many notable conductors such as: Sir Mark Elder, Oliver Knussen, Daniel Harding, and Jac van Steen.", "link_mentions": [{"page": "High Wycombe", "response": ["*Charlotte Bray, composer was brought up in High Wycmobe"]}, {"page": "List of women composers by birth date", "response": ["* Charlotte Bray (born 1982)"]}, {"page": "Oliver Knussen", "response": ["*Charlotte Bray – Caught in Treetops, Birmingham Contemporary Music Group, NMC (2014)\t\t"]}, {"page": "Piano quartet", "response": ["*Charlotte Bray"]}, {"page": "List of 21st-century classical composers", "response": ["|Charlotte Bray || 1982 || || British ||  ||"]}, {"page": "Ruth Ellis", "response": ["The story was also the inspiration for the 2015 opera Entanglement by the composer Charlotte Bray."]}, {"page": "List of composers for the classical guitar", "response": ["| data-sort-value=\"Bray, Charlotte\"| Charlotte Bray || align=center | 1982 || align=center data-sort-value=\"9999\" |  || align=center | United Kingdom || || "]}, {"page": "Clarinet-violin-piano trio", "response": ["| Charlotte Bray || 2017 || Chant for Clarinet, Violin and Piano || "]}, {"page": "Guy Johnston", "response": ["In August 2016, Johnston performed the world premiere of Charlotte Bray's cello concerto Falling in the Fire at The Proms."]}, {"page": "List of compositions for guitar", "response": ["*2012 Charlotte Bray (born 1982) Passing Shadows"]}, {"page": "CBSO Youth Orchestra", "response": ["In line with CBSO programming policy, the Youth Orchestra has a policy of performing music that is outside of the standard repertoire, and often more ambitious than that usually associated with youth orchestras.  This has included Shostakovich's Eleventh Symphony, John Foulds' Le Cabaret, Mahler's Seventh Symphony, Julian Anderson's Alhambra Fantasy, Ligeti's Concert Romanesc, Korngold's Violin Concerto, Stravinsky's Pulcinella, Alban Berg's Seven Early Songs and Jörg Widmann's Con brio.  In February 2007 it gave the world premiere of Streamlines by Tansy Davies, a work commissioned by the Feeney Trust specifically for the CBSO Youth Orchestra. Subsequent commissions have included Più Mosso by Luke Bedford (premiered October 2009) and Leckey by Ben Foskett (premiered October 2011). New works from Charlotte Bray and Mark Anthony Turnage are scheduled for February and November 2014 respectively."]}, {"page": "Piano trio repertoire", "response": ["*Charlotte Bray"]}, {"page": "Amy Rosenthal", "response": ["She won The Sunday Times Drama Award with her debut play Henna Night in 1999. In 2015, she wrote the libretto to the opera Entanglement by the composer Charlotte Bray. Rosenthal was shortlisted for the Susan Smith Blackburn Prize for female dramatists. Rosenthal teaches playwriting on the Arvon courses, and at Birkbeck College, University of London."]}, {"page": "Kensington Symphony Orchestra", "response": ["Other contemporary composers performed in recent years by the orchestra include James McMillan, Anna Clyne, Joan Tower, John Adams, Joseph Phibbs, Brett Dean, Colin Matthews, Judith Weir, Seán Doherty, Charlotte Bray, Stephen Montague, Magnus Lindberg, Richard Ayres, HK Gruber and Thomas Adès."]}, {"page": "Aldeburgh Music", "response": ["A particular strand of Aldeburgh Residencies entitled the Composer Residency Scheme enables three composers each year to spend three weeks working on individual new projects. Amongst the composers and librettists participating in this programme have been Anna Meredith, Larry Groves, Simon Limbrick, Mark Ravenhill and Conor Mitchell, Man Fang, Tansy Davies, Christian Mason and Charlotte Bray."]}, {"page": "Alexandra Wood (violinist)", "response": ["In 2011, Wood premiered a violin concerto “Caught in Treetops” by Charlotte Bray at the Aldeburgh Festival."]}, {"page": "Richard Williams (theatre director)", "response": ["He is currently (2020) Course Leader of the BA Acting at Drama Centre London,'Richard Williams', at Central Saint Martins website. and remains associated with Dartington.See short biographical notice in Dartington August 2018 blurb for Oh! What a Lovely War. Williams' recent work includes directing the British premiere of Vivaldi’s opera L'Olimpiade at the Bath International Music Festival,'Opening Night Gala Opera', Bath Abbey website. also presented at the Eilat Festival. His work with Nova Music Opera under George Vass includes stage direction of several contemporary operas, including Stephen McNeff's Prometheus Drown'd (2014, to Williams's libretto),P. Reed, 'Nova Music Opera double-bill,' Classical Source 29 July 2014. Charlotte Bray and Amy Rosenthal's Entanglement (2015),'UK Tour, 2015', Nova Music - Opera. and Joseph Phibbs and Laurie Slade's Juliana (2018).A. Clements, 'Juliana review - Miss Julie reworking makes for a convincing, effective new opera', The Guardian, 17 July 2018."]}, {"page": "2015 in British music", "response": ["* Charlotte Bray and Amy Rosenthal – Entanglement"]}, {"page": "2015 in classical music", "response": ["* Charlotte Bray and Amy Rosenthal – Entanglement"]}, {"page": "At the Speed of Stillness", "response": ["At the Speed of Stillness is an orchestral composition in one movement by the British composer Charlotte Bray.  The work was commissioned by The Proms for the conductor Sir Mark Elder and the Aldeburgh World Orchestra.  It was first performed July 29, 2012 at the Proms by the Aldeburgh World Orchestra under Sir Elder.  The piece is dedicated to the British composer Mark-Anthony Turnage.Bray, Charlotte (2012). At the Speed of Stillness: Program Note. Retrieved August 3, 2015.", "Category:Compositions by Charlotte Bray"]}, {"page": "Caught in Treetops", "response": ["Caught in Treetops is a concerto for solo violin and chamber ensemble by the British composer Charlotte Bray.  The work was commissioned by the Birmingham Contemporary Music Group and Sound and Music.  It was first performed on 14 November 2010 at the CBSO Centre, Birmingham by the violinist Alexandra Wood and the Birmingham Contemporary Music Group under conductor Oliver Knussen.  The piece is dedicated to the Birmingham Contemporary Music Group.Bray, Charlotte (2010). Caught in Treetops: Program Note. Retrieved August 4, 2015.", "Reviewing the world premiere, Stephen Walsh of The Arts Desk called the music \"intricate and self-absorbed, sonorities like birdsong in the upper branches, seldom coming to the ground but finely heard and very cleverly scored for a dozen instruments.\"  Ivan Hewett of The Daily Telegraph similarly lauded, \"Charlotte Bray’s light-footed mini-violin concerto Caught in Treetops seized the image of the moon in Dante Gabriel Rossetti sonnet.\"  Igor Toronyi-Lalic of The Arts Desk called the work \"intriguing\" and wrote:", "Category:Compositions by Charlotte Bray"]}, {"page": "Fire Burning in Snow", "response": ["Fire Burning in Snow is a composition for mezzo-soprano solo and chamber ensemble by the British composer Charlotte Bray.  The work was commissioned by the Birmingham Contemporary Music Group with the support of individual donors in memory of the arts administrator Jack Phipps.  It was first performed on June 18, 2013 at the Aldeburgh Festival by mezzo-soprano Lucy Schaufer and the Birmingham Contemporary Music Group.  The piece is set to three poems by Nicki Jackowska.  Bray dedicated the composition to Jackowska and to the memory of the composer Jonathan Harvey.Bray, Charlotte (2013). Fire Burning in Snow: Program Note. Retrieved August 4, 2015.", "Category:Compositions by Charlotte Bray"]}, {"page": "Black Rainbow (composition)", "response": ["Black Rainbow is an orchestral composition in two movements by the British composer Charlotte Bray.  The work was commissioned by the City of Birmingham Symphony Orchestra and was first performed in Birmingham on February 23, 2014 by the CBSO Youth Orchestra under conductor Jac van Steen.Bray, Charlotte (2013). Black Rainbow: Program Note. Retrieved August 4, 2015.", "Category:Compositions by Charlotte Bray"]}, {"page": "The Sun Was Chasing Venus", "response": ["The Sun Was Chasing Venus is a composition for string quintet by the British composer Charlotte Bray.  The work was commissioned by the violinist Daniel Hope and the Savannah Music Festival.  It was first performed at the Savannah Music Festival on 3 April 2014 by the Dover Quartet and violist Daniel Lee.Bray, Charlotte (2012). The Sun Was Chasing Venus: Program Note. Retrieved August 5, 2015.", "Category:Compositions by Charlotte Bray"]}, {"page": "2016 in British music", "response": ["* Charlotte Bray"]}, {"page": "2016 in classical music", "response": ["* Charlotte Bray", "* Philippe de Monte, William Byrd, Roxanna Panufnik, Francis Pott, Alexander L'Estrange, Owain Park, Charlotte Bray, Roderick Williams – Upheld by Stillness (ORA Choir)"]}, {"page": "Entanglement (opera)", "response": ["Entanglement is a one-act chamber opera by the British composer Charlotte Bray and the librettist Amy Rosenthal.  The work was commissioned by the Nova Music Opera and was first performed on 6 July 2015 at the Cheltenham Music Festival, with the conductor George Vass leading soprano Kirsty Hopkins, baritone Howard Croft, tenor Greg Tassell, and the Nova Music Opera Ensemble.Bray, Charlotte (2015). Entanglement: Program Note. Retrieved January 7, 2016.", "Category:Operas by Charlotte Bray"]}, {"page": "Falling in the Fire", "response": ["Falling in the Fire is a cello concerto by the British composer Charlotte Bray.  The work was commissioned by BBC Radio 3 for The Proms.  Its world premiere was performed by the cellist Guy Johnston and the BBC Symphony Orchestra conducted by Sakari Oramo at the Royal Albert Hall on 14 August 2016.  The piece was inspired by the destruction of the ancient city of Palmyra by ISIL in August 2015.  Falling in the Fire is composed in a single movement and has a duration of approximately 21 minutes.Bray, Charlotte (2015). Falling in the Fire: Program Note. Retrieved August 19, 2016.", "Category:Compositions by Charlotte Bray"]}, {"page": "2017 in British music", "response": ["* Charlotte Bray – Blaze and FallSt John's Smith Square, 27 April 2017 programme"]}, {"page": "2017 in classical music", "response": ["* Charlotte Bray – Blaze and FallSt John's Smith Square, 27 April 2017 programme"]}, {"page": "2018 in classical music", "response": ["* Charlotte Bray – Reflections in TimeLondon Sinfonietta, 16 May 2018 program"]}, {"page": "2018 in British music", "response": ["* Charlotte Bray – Reflections in TimeLondon Sinfonietta, 16 May 2018 program"]}, {"page": "2019 in classical music", "response": ["* Solo or Duo: Charlotte Bray – Invisible Cities"]}, {"page": "2021 in British music", "response": ["* Charlotte Bray – When Icebergs Dance Away"]}, {"page": "2021 in classical music", "response": ["* Charlotte Bray – When Icebergs Dance Away"]}]}}