{"wiki_id": "http://www.wikidata.org/entity/Q5082750", "itemLabel": "Charles Stuart Parker", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Stuart_Parker", "wikipedia_page": {"main": "Charles Stuart Parker (1 June 1829 – 18 June 1910) was a British academic, writer and Liberal politician.", "link_mentions": [{"page": "Charles Parker", "response": ["*Charles Stuart Parker (1829–1909), British Member of Parliament for Perth, 1878–1892"]}, {"page": "List of Privy Counsellors (1901–1910)", "response": ["*Charles Stuart Parker (1829–1910)"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Charles Stuart Parker"]}, {"page": "Perth (UK Parliament constituency)", "response": ["|rowspan=3|  Charles Stuart Parker"]}, {"page": "List of UK minor party and independent MPs elected", "response": ["| Charles Stuart Parker"]}, {"page": "Perthshire (UK Parliament constituency)", "response": ["| Charles Stuart Parker"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Charles Stuart Parker"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Charles Stuart Parker"]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|Charles Stuart Parker"]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Charles Stuart Parker"]}, {"page": "James Parker (judge)", "response": ["Parker was born in Glasgow, the son of Charles Stuart Parker and his wife Mary Rainey. He was educated at Glasgow Grammar School and Trinity College, Cambridge, where he stood seventh wrangler in the Tripos in 1825. He contributed Arithmetic and Algebra  in fours parts (1827–1830) to the Library of Useful Knowledge (authorship by a Mr. Parker, AM, is identified in an edition in 1847, and clinched, for example, in advertisements on 16 January and 17 July 1860 in Publishers' Circular and Bookseller's' Record ). In 1829, he was called to the bar at Lincoln's Inn and was an equity draftsman and conveyancer. He practiced on the Northern circuit and became Queen's Counsel in 1844.  Parker purchased the estate of Rothley Temple from his father-in-law Thomas Babington in 1845.", "Parker married Mary Babington, third daughter of Thomas Babington in 1829. Their daughter Susan Emma Parker  married Archibald Smith and their son James Parker was a successful rower.  Parker was the uncle of Charles Stuart Parker MP."]}, {"page": "1878 Perth by-election", "response": ["The Perth by-election of 1878 was fought on 29 January 1878.  The byelection was fought due to the succession to a peerage of the incumbent Liberal MP, Arthur Kinnaird.  It was won by the Liberal candidate Charles Stuart Parker."]}, {"page": "Sandbach, Tinne & Company", "response": ["The origins of Sandbach, Tinne & Company, together with its related firms, can be traced to James McInroy, a Scot from near Pitlochry who was trading in Grenada from 1782. Another of the original partners was Charles Stuart Parker, who arrived in Grenada to work as a clerk for his merchant uncle, George Robertson, in 1789. These men, too, were of Scots origin and within months of Parker's arrival arrangements were being made for them to form a trading partnership with a third Scotsman, a Mr Gordon. That partnership began operations in 1790 but soon hit difficulties as both uncle and nephew became upset with Gordon's behaviour. Gordon ceased to be a partner and McInroy joined them while continuing also independently to operate a business in the Dutch colony of Demerara. In 1792, the partnership was expanded to include Samuel Sandbach, an Englishman who had arrived in Grenada in 1788 to work for his uncle, who shared the same name and was also an established merchant there. Sandbach had gravitated to being a clerk for the McInroy, Parker and Robertson partnership and had impressed them so much that they invited him to join their firm on an equal standing.", "George Rainy, a nephew of Robertson and brother of Parker's wife, also became a partner and was the main representative in Demerara from around 1808 to 1837, when he returned to Britain.  Other notable relations of the four founding partners include Charles Stuart Parker and Emily Tinne."]}]}}