{"wiki_id": "http://www.wikidata.org/entity/Q5082192", "itemLabel": "Charles Rowan", "itemDescription": "British police commander", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Rowan", "wikipedia_page": {"main": "Lieutenant-Colonel Sir Charles Rowan  (circa 1782 – 8 May 1852) was an officer in the British Army, serving in the Peninsular War and Waterloo and the joint first Commissioner of Police of the Metropolis, head of the London Metropolitan Police.", "link_mentions": [{"page": "Scotland Yard", "response": ["The Metropolitan Police was formed by Robert Peel with the implementation of the Metropolitan Police Act, passed by Parliament in 1829. Peel, with the help of Eugène-François Vidocq, selected the original site on Whitehall Place for the new police headquarters. The first two commissioners, Charles Rowan and Richard Mayne, along with various police officers and staff, occupied the building. Previously a private house, 4 Whitehall Place () backed onto a street called Great Scotland Yard."]}, {"page": "Metropolitan Police", "response": ["The force is led by the Commissioner, whose formal title is the Commissioner of Police of the Metropolis. The Commissioner is answerable, responsible and accountable to The Queen, the Home Office and the Mayor of London, through the Mayor's Office for Policing and Crime. The post of Commissioner was first held jointly by Sir Charles Rowan and Sir Richard Mayne. Dame Cressida Dick was appointed Commissioner in April 2017."]}, {"page": "Commissioner of Police of the Metropolis", "response": ["|Sir Charles Rowan"]}, {"page": "Edmund Henderson", "response": ["Henderson immediately endeared himself to his men by abolishing or relaxing some of the petty regulations imposed by Mayne and his first colleague, Sir Charles Rowan. For the first time, for instance, officers were permitted to grow facial hair. They were also allowed to vote for the first time, having initially been prevented by regulations forbidding them to take part in political activity. Henderson clashed with Receiver Maurice Drummond over an increase in pay for his men, a rivalry which was to continue for the rest of his tenure."]}, {"page": "Richard Mayne", "response": ["As a rising star of the English Bar, Mayne applied in 1829 to be one of the Joint Commissioners of the new Metropolitan Police, and was selected without interview. His senior colleague was to be Lieutenant-Colonel Charles Rowan. Rowan was to provide the discipline and organisational skills, while Mayne was to provide the legal expertise. They took up their new appointments on 7 July 1829 and were to become firm friends, working closely together until Rowan's retirement 21 years later. Later that month, they moved into their offices in 4 Whitehall Place and set about the monumental task of creating the new police force from nothing. On 29 August, they were sworn in as Justices of the Peace by Lord Chief Baron Sir William Alexander. On 16 September, the two Commissioners personally swore in their new constables at the Foundling Hospital. The new force first took to the streets at 6:00 p.m. on 29 September."]}, {"page": "William Hay (police commissioner)", "response": ["Having then lived for two years in Surrey, followed by seven in Scotland, Hay then came to London, where on 10 December 1839 he took up an appointment as the first inspecting superintendent of the Metropolitan Police. This post was effectively the chief deputy to the two joint commissioners, Lieutenant-Colonel Sir Charles Rowan and Richard Mayne, and broke the rule established by Sir Robert Peel that, apart from the two commissioners, all police officers should be promoted from the ranks. This was not the first time Hay had served under Rowan, who was his senior in the 52nd Light Infantry during the Peninsular War.", "In 1850, on the retirement of Sir Charles Rowan, Hay was made one of the joint commissioners of the Metropolitan Police and sworn in as a Justice of the peace. His position was junior to Richard Mayne, who had been appointed along with Rowan in 1829. Mayne and Hay did not get along, and Hay was soon complaining to the Home Office about his colleague. He was particularly angered that Mayne took personal charge of the policing of the Great Exhibition in 1851, a job which Hay, as a military man, thought should have gone to him. Hay was, however, appointed Companion of the Order of the Bath (CB) in 1851 for his involvement in the Exhibition, although Mayne was appointed to the higher grade of Knight Commander for his involvement at the same time."]}, {"page": "John Wray (civil servant)", "response": ["As Receiver, he had equal authority with the two Joint Commissioners, Charles Rowan and Richard Mayne, and worked in harmony with them in establishing the new police force. His function in persuading parishes to turn over funds to the Metropolitan Police was invaluable. He retired in April 1860, aged 78. He is buried in the churchyard of St Mary's parish church, Cottingham.Photograph of the Wray family memorial"]}, {"page": "John May (police officer)", "response": ["Superintendent John May (1775–1855) was the first commander of the Metropolitan Police \"A\" Division, which policed the Whitehall area of London. Since the divisional station house was adjacent to the offices of the Joint Commissioners, Charles Rowan and Richard Mayne, May began to serve as unofficial second-in-command of the force, providing a link between the Commissioners and their men. It was he who interviewed the first candidates for the force, sifting them before Rowan and Mayne made their final selection.T. A. Critchley, A History of Police in England and Wales, Constable: London, 1967"]}, {"page": "William Rowan", "response": ["Born the son of Robert Rowan of Mullans, County Antrim and Elizabeth Rowan (née Wilson), Rowan was the younger brother of Sir Charles Rowan (c.1782–1852), Commissioner of the Metropolitan Police in London, and formerly an officer of the 52nd Light Infantry, a regiment in which their brother Robert and Uncle Charles were also officers.Biographica.ca - William Rowan"]}, {"page": "County Police Act 1839", "response": ["The legislation was based on the recommendations of a royal commission appointed in 1836 to \"inquire into the best means of establishing an efficient constabulary force in the counties of England and Wales\". The three members of the commission, or \"Constabulary Commissioners\" as they were informally called were Colonel Charles Rowan, Commissioner of the Metropolitan Police, Edwin Chadwick and Charles Shaw Lefevre. The commission was appointed against a background of unrest and violence in some areas of the country, with protests against the New Poor Law and agitation by Chartists for social and political reform. Chadwick was strongly in favour of the creation of a single centralised force, but this was opposed by not only the two other commissioners but also by the Home Secretary, Lord John Russell. Russell wrote to the magistrates of the various counties asking them to support the resolution passed in Shropshire to establish a body of constables paid for out of the county rate and under the control of the magistrates. The commission's report, issued in 1839, followed the lines favoured by Russell. It recommended that \"a properly trained and equipped preventative police force\" based on the pattern of the existing Metropolitan Police, should be established in all counties where the magistrates were in favour. Each force should be funded mostly by local rates, with 25% of the cost met by central government. The force would be under the supervision of the county magistrates, who would have the power to employ or remove officers, subject to statutory regulations."]}, {"page": "1852 in Ireland", "response": ["*8 May – Charles Rowan, joint first Commissioner of Police of the Metropolis, head of the London Metropolitan Police (b. c1782)."]}, {"page": "Duchess of Richmond's ball", "response": ["* Colonel Rowan, 52nd Regiment of Foot (wounded, afterwards Sir Charles Rowan, Chief Commissioner of Police)"]}, {"page": "52nd (Oxfordshire) Regiment of Foot", "response": ["Returning to England in 1818, the 52nd were stationed in the Midlands, where they were responsible for domestic peacekeeping and policing under the command of Lt. Col. Charles Rowan, experience which fitted Rowan for his 1829 posting to establish a military-style metropolitan police service under Sir Robert Peel.F. E. C. Gregory, ‘Rowan, Sir Charles (1782?–1852)’, Oxford Dictionary of National Biography, Oxford University Press, September 2004; online edn, January 2008 , accessed 29 July 2009"]}, {"page": "Merville House", "response": ["Merville was in the permanent status of Dorothea since 1800 until the estate was sold to the future Sir Edward Coey in October 1849.  John Rowan was the eldest brother of Sir Charles Rowan KCB (1783-1852), the joint founding Commissioner of the London Metropolitan Police.  The Rowans originated from Ballymoney, County Antrim."]}, {"page": "Mary Pilon", "response": ["At the Times, Pilon authored \"Tomato Can Blues,\" a true-crime story of Charles Rowan; the story was the first-ever graphic novel for the paper and its first audiobook, narrated by actor Bobby Cannavale. Her 2016 investigative reporting on sexual harassment in the trucking industry helped fuel a class action lawsuit by women truckers. In reporting on the NFL's domestic violence policies for Bleacher Report/CNN the next year, Pilon found that the league seldom enforced its own policies. She has also reported on the circumstances surrounding runner Steve Prefontaine`s death for ESPN's Grantland and was among the first to report on Donald Trump's immigrant mother in June 2016.", "At the Times, Pilon wrote \"Tomato Can Blues,\" a true-crime story of Charles Rowan, an amateur cage fighter who faked his own death. The story was the first-ever graphic novel for the paper and the first audiobook, narrated by actor Bobby Cannavale."]}, {"page": "History of the Metropolitan Police", "response": ["Lieutenant-Colonel Sir Charles Rowan and Sir Richard Mayne were appointed the new force's first Commissioners and this has remained its highest rank, unlike other modern British police forces, which are led by Chief Constables. The two Commissioners' original headquarters was near Government, at 4 Whitehall Place, with a back entrance on Great Scotland Yard. Scotland Yard soon became established as a name for the force itself. Once formed, the force became the third official non-paramilitary city police force in the world, after the City of Glasgow Police and the Paris Police. Due to public fears concerning the deployment of the military in domestic matters, Robert Peel organised the force along civilian lines, rather than paramilitary. To appear neutral, the uniform was deliberately manufactured in blue, rather than red which was then a military colour, along with the officers being armed only with a wooden truncheon and a rattle to signal the need for assistance. Until 1864, police officers also wore top hats, to complete the civilian look. Along with this, police ranks did not include military titles, with the exception of Sergeant.Taylor, J. \"The Victorian Police Rattle Mystery\"/  The Constabulary (2003) The original standard wage for a Constable was one guinea (£1.05) a week. Recruitment criteria required applicants to be under the age of 35, in good health, and to be at least . Working shifts lasted 12 hours, 6 days a week, with Sunday as a rest day. Until 1897, Metropolitan Police officers did not receive a boot allowance.", "When Sir Charles Rowan died, another army officer, William Hay, was drafted in to jointly run the force with Mayne. However, tensions between them meant that on Hay's death in 1855 a new system of a single Commissioner and two Assistant Commissioners was established. In 1857 Matne was paid a salary of £1,883 (roughly equivalent to £1.2m in 2009), and his two Assistant Commissioners were paid salaries £800 each, approximately £526,000 in 2009."]}, {"page": "John Shipp (British Army officer)", "response": ["In 1830, Shipp was offered an inspectorship in the Stepney division of metropolitan police by Sir Charles Rowan; he was shortly afterwards appointed superintendent of the night watch at Liverpool, and in 1833 was elected master of the workhouse at Liverpool, where he was highly esteemed."]}, {"page": "Rowan (name)", "response": ["* Sir Charles Rowan ( – 1852), officer in the British Army and Commissioner of Police of the (London) Metropolis"]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* Sir Charles Rowan KCB (1783–1852)"]}, {"page": "The Railway Detective", "response": ["The Detective Department of the Metropolitan Police Force (the Met) was founded in 1842 and so was only nine years old in 1851, when the story is set. Richard Mayne, who was the joint first commissioner of the Met, is depicted in meetings with Tallis, Colbeck and Leeming. His co-commissioner, Charles Rowan, had retired the year before. Mayne was in charge of policing at The Great Exhibition which opened on 1 May and was an outstanding success, thanks in no small part to effective policing. Mayne is the only real person who plays an active part in the novel."]}, {"page": "Rowan, Charles", "response": ["#redirectCharles Rowan"]}]}}