{"wiki_id": "http://www.wikidata.org/entity/Q5081084", "itemLabel": "Charles Morley Wenyon", "itemDescription": "British protozoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Morley_Wenyon", "wikipedia_page": {"main": "Charles Morley Wenyon  (1878–1948) was a distinguished English protozoologist.", "link_mentions": [{"page": "List of fellows of the Royal Society W, X, Y, Z", "response": ["|Charles Morley Wenyon||12/05/1927||24 March 1878 – 24 October 1948"]}, {"page": "Manson Medal", "response": ["| 1947 || Charles Morley Wenyon"]}, {"page": "Cecil Hoare", "response": ["In 1923, he joined the Wellcome Bureau of Scientific Research in London, under Charles Morley Wenyon. Hoare was appointed Protozoologist, and in later Head of the Department of Protozoology, a post he held for 34 years until his retirement in 1957."]}, {"page": "List of fellows of the Royal Society elected in 1927", "response": ["*Charles Morley Wenyon"]}, {"page": "Cystoisospora belli", "response": ["Isospora belli was discovered by Rudolf Virchow in 1860 and was named by Charles Morley Wenyon in 1923. The parasite is now known as Cystoisospora belli."]}, {"page": "1918 New Year Honours", "response": ["*Tmp Lt.-Col. Charles Morley Wenyon  RAMC"]}, {"page": "List of Makdougall Brisbane Prize winners", "response": ["*1924–26 – Charles Morley Wenyon, protozoologist"]}, {"page": "Chilomastix", "response": ["The nomenclature of this genus has been under much dispute throughout history, switching between many different taxonomic names. The first known report of this genus was in 1854 when patients in Paris showed infection by a parasitic flagellate. The human parasite was classified under the name of Cercomonas hominis var. 1 by Davaine (1854). In 1910, it was reclassified as its own species and named Macrostoma mesnili by Charles Morley Wenyon, an English protozoologist. It was again renamed to Chilomastix davainei (syn. Chilomastix mesnili) in 1920 by Kofoid. The origin of the name Chilomastix however, was before 1920. The initial proposal of Chilomastix being its own genus was urged by Alexeieffe in 1912 who was the first to thoroughly describe a species belonging to this genus. Although he initially called it Tetramitus caulleryi in 1910, he then referred it is as its own genus, Chilomastix in 1912. "]}, {"page": "Wenyon", "response": ["* Charles Morley Wenyon (1878–1948), English protozoologist"]}, {"page": "C. Morley Wenyon", "response": ["#REDIRECT Charles Morley Wenyon"]}]}}