{"wiki_id": "http://www.wikidata.org/entity/Q5084984", "itemLabel": "Charlie Hanson", "itemDescription": "British producer and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Hanson", "wikipedia_page": {"main": "Charlie Hanson is a British producer and director. His award-winning work includes television shows such as Desmond's, Chef!, The Big Impression, The Sketch Show and Whites, and the 2003 feature film A Way of Life.", "link_mentions": [{"page": "Ricky Gervais", "response": ["On 9 May 2018, it was announced that Netflix had given a production order for the first season of the comedy-drama After Life. It was created and directed by Gervais, who also starred in it and executive-produced it with Charlie Hanson. On 14 January 2019, it was announced that the series would premiere on 8 March 2019, that Duncan Hayes would be an additional executive producer, and that Hanson would actually serve as a producer. On 3 April 2019, Netflix renewed the series for a second season. In May 2020 it was announced that Gervais had signed a new deal with Netflix, including a third season of After Life. Before the announcement Gervais said, \"For the first time ever, I would do a series three, because the world’s so rich. I love the characters, I love all the actors in it, I love my character, I love the town, I love the themes… I love the dog!\""]}, {"page": "Desmond's", "response": ["Desmond's is a British television situation comedy broadcast by Channel 4 from 1989 to 1994. Conceived and co-written by Trix Worrell, and produced by Charlie Hanson and Humphrey Barclay, Desmond's stars Norman Beaton as barber Desmond Ambrose, whose shop is a gathering place for an assortment of local characters. The show is set in Peckham, London, and features a predominantly black British Guyanese cast. With 71 episodes, Desmond's became Channel 4's longest running sitcom in terms of episodes.Paul Jackson, \"Desmond's\", Britain in a Box, BBC Radio 4, 11 May 2013."]}, {"page": "The Real McCoy (TV series)", "response": ["The producer of the first two series, Charlie Hanson, was the co-founder of the Black Theatre Co-operative (now NitroBeat) and had produced No Problem! and Desmond's before creating The Real McCoy. He was working with a double act named Curtis and Ishmael (Curtis Walker and Ishmael Thomas) at the 291 Club at the Hackney Empire and suggested making a television version. However, the BBC opted for a totally new sketch series, launching The Real McCoy.  Llewella Gideon and Collette Johnson, who were also in a double act named Short Sharp and Shocking, made up the main initial quartet of writer-performers. Soul II Soul frontman Jazzie B co-wrote the title theme."]}, {"page": "Mustapha Matura", "response": ["In 1978, he co-founded the Black Theatre Co-operative (now NitroBeat) together with British director Charlie Hanson. \"Frustrated by the lack  of interest from London Fringe theatres in Matura's new play Welcome Home Jacko, Matura and Hanson set up their own theatre company. Welcome Home Jacko was presented at The Factory in Paddington, west London, in May 1979 and marked the beginnings of the Black Theatre Co-operative. The company supported, commissioned and produced work by black writers in Britain.\"Black Plays Archive, National Theatre."]}, {"page": "Hanson (surname)", "response": ["* Charlie Hanson, British producer and director"]}, {"page": "Julian Dutton", "response": ["In 2000 he co-created, wrote and performed in Alistair McGowan's Big Impression, later to be renamed The Big Impression, which was BBC One's first sketch show for many years and their first impressions show since Mike Yarwood's. The show, produced by Charlie Hanson, proved a massive hit: in addition to writing the series Dutton was one of the supporting performers along with Ronni Ancona, Alan Francis, Roger Blake and Duncan Wisbey, and performed impressions of, among others, Dustin Hoffman, John Le Mesurier and James Stewart. He wrote and performed in four series of the show and two Christmas Specials, and won a British Comedy Award in 2001, and a BAFTA.https://uk.imdb.com/title/tt0211948/awards A spin-off series, Ronni Ancona & Co was commissioned in 2007, which Dutton wrote with Ancona, Alan Francis and Alex Lowe."]}, {"page": "The Old Red Lion, Islington", "response": ["In 1979 a small studio theatre opened on the pub's first floor, as the Old Red Lion Theatre Club. Under artistic director Charlie Hanson, it became a place for actors, directors, designers, writers and technicians to experiment. After the King's Cross fire in 1987, the theatre was threatened with closure due to the tightening of fire regulations. Artistic Director Ken McClymont raised funds to keep the theatre from closing.", "*Charlie Hanson (1979–1981)"]}, {"page": "British Urban Film Festival", "response": ["On 26 January 2015, it was announced that the BAFTA award-winning producer Damian Jones was appointed to the board of the British Urban Film Festival. On 2 March 2015, it was announced that the award-winning writers of Run Daniel Fajemisin-Duncan and Marlon Smith were appointed as script judges for the British Urban Film Festival. On 1 April 2015, it was announced that the first ever British Urban Film Festival awards (supported by Channel 4) will take place in London on Thursday 17 September. On 5 June 2015, it was announced that the award-winning film and TV producer Charlie Hanson was the latest industry figure appointed as a patron to the board of the British Urban Film Festival. On 21 August 2015, London Live will begin screening films previously shown by the British Urban Film Festival in a 2-year broadcast deal.", "The film stars Adele Oni, Kadeem Pearse, Clare Anyiam-Osigwe, Algie Salmon-Fattahian, Sharea Samuels and Jade Asha. Also starring are Fred Lancaster, Lonyo Engele, Paula Masterton, Veronica Jean Trickett, Joel Grizzle, Chris Preddie OBE, Tenisha White, Zephryn Taitte, Justin Chinyere, Kele Le Roc and Judith Jacob. \"No Shade\" will open the 2018 British Urban Film Festival with a UK premiere screening at the Rio cinema in Dalston on 5 June. On 8 March 2018, the festival announced that director Amma Asante is to be honoured at the BUFF Awards in recognition for her film work as director of A United Kingdom (screened by the festival in October 2016) and also for her previous films Belle (produced by BUFF patron Damian Jones) and A Way of Life (produced by BUFF patron Charlie Hanson)."]}, {"page": "Life's Too Short (TV series)", "response": ["The series was produced by Charlie Hanson, who previously produced Extras, and Michelle Farr. Gervais and Merchant were executive producers, along with Mark Freeland. On 17 September 2010 the BBC announced, via the BBC Two Controller Janice Hadlow and the Controller of BBC Comedy Commissioning Cheryl Taylor, that the six-part series had been commissioned and filmed in 2011. Gervais reported in his blog on the progress of writing Life's Too Short throughout November 2010: \"Had a great week writing Life's Too Short. It's the hardest bit, the most important bit and the most invigorating bit\", and in a later entry \"Wrote one of the funniest sketches we've ever done for Life's Too Short. Six hours hard labour for a potential two minutes screen time.\" In January 2011 he reported that he was still working on the scripts for the show, and in February that he and Merchant were trying to finish writing the series."]}, {"page": "Amma Asante", "response": ["Asante was previously married to producer Charlie Hanson. She is now married to Søren Pedersen, spokesman for European police in The Hague.", "Asante used Tantrum Films to make her directorial debut with a feature film, A Way of Life (2004). It was developed and financed through the UK Film Council and produced by Peter Edwards, Patrick Cassavetti and Golden Globe Award and BAFTA Award winner Charlie Hanson. Her first film, A Way of Life, focused on the life of a single mother, played by Stephanie James. It details the reality of a woman who recounts the suicidal death of her mother and the presence of foster care. It also introduces her brother Gavin, played by Nathan Jones, who was also taken into foster care. As a young 17-year-old, Leigh Anne (Stephanie James), finds it difficult to get by, especially due to the medical expenses that her daughter Eli Williams, incurred. It also touches on the theme of cultural conflict, with their neighbour Hassan Osman (played by Oliver Haden), who had been the victim of a beating, after being accused of reporting Leigh Anne to social services for child neglect. The film has been described as \"one of the most warmly received UK titles in the London Film Festival in the autumn and a harrowing drama in social realist mode\". On 17 January 2005, the Times said: \"She is one of the most exciting prospects in British cinema to emerge in the past 12 months.\""]}, {"page": "Jess Robinson", "response": ["She appeared in various sketches in the first two series of The Impressions Show with Culshaw and Stephenson. In 2010, director Angie De Chastelai Smith  collaborated with producer Charlie Hanson at ITV to make It's Paul Burling! in which Robinson co-starred as the main female impressionist. Her impressions included Cheryl Cole, Stacey Solomon and Kerry Katona. The show, which aired in December 2010 to a television audience of 3.7 million viewers, was a one-hour Christmas special on ITV following Burling's success on talent show BGT."]}, {"page": "Primetime Emmy Award for Outstanding Television Movie", "response": ["| Ricky Gervais, Stephen Merchant and Jon Plowman, executive producers; Charlie Hanson, producer"]}, {"page": "Parents of the Band", "response": ["The six episode series was commissioned by Lucy Lumsden, BBC Controller, Comedy Commissioning. The show was a co-venture between BBC Vision Productions and Serious Entertainment Productions. The latter company is owned by the series co-creators, Jimmy Nail and Tarquin Gotch. The series was written by David Cummings, and the script was edited by the writing partners, Dick Clement and Ian La Frenais. The producer is Charlie Hanson and executive producer is Kenton Allen, BBC Creative Head of Comedy Talent and Comedy North."]}, {"page": "British Academy Television Award for Best Comedy (Programme or Series)", "response": ["| Chef! || Charlie Hanson, John Birkin, Peter Tilbury", "| rowspan=\"4\" style=\"text-align:center;\"|2003 || style=\"background:#B0C4DE;\"|Alistair McGowan's Big Impression || style=\"background:#B0C4DE;\"|Gareth Carrivick, Charlie Hanson, Alistair McGowan || style=\"background:#B0C4DE;\"|BBC One"]}, {"page": "Charles Hanson", "response": ["* Charlie Hanson, British producer and director"]}, {"page": "Olivia Poulet", "response": ["Poulet has also appeared on stage productions including  The Queef of Terence and The Bird Flu Diaries. She has also voiced roles in video game Dragon Age II by BioWare. In 2011, Poulet and her comedy partner Sarah Solemani wrote a sitcom for the BBC, which will be produced by Charlie Hanson. She also completed a screenplay called Ocean Road for producer Harriet Rees."]}, {"page": "British Academy Television Award for Best Scripted Comedy", "response": ["| Extras  (series 1)|| Charlie Hanson, Ricky Gervais, Stephen Merchant || BBC Two"]}, {"page": "Where Hands Touch", "response": ["Where Hands Touch is a 2018 British-Belgian-Canadian-Irish romantic war drama film directed and written by Amma Asante and starring Amandla Stenberg, George MacKay, Abbie Cornish, Christopher Eccleston, and Tom Sweet. It was produced by Charlie Hanson, and tells the story of Leyna (Stenberg), a biracial girl under threat because of her race, due to her living in Nazi Germany."]}, {"page": "After Life (TV series)", "response": ["On 9 May 2018, it was announced that Netflix had given the production a series order for a first season consisting of six episodes. The series was created and directed by Ricky Gervais, who is also executive producer, alongside Charlie Hanson. On 14 January 2019, it was announced that the series would premiere on 8 March 2019. It was further announced that Duncan Hayes would serve as an additional executive producer and that Hanson would actually serve as a producer. On 3 April 2019, it was announced that the series was renewed for a second season, which premiered on 24 April 2020. On 6 May 2020, the show was renewed for a third season, the first time a fictional series created by Gervais had been extended beyond two seasons. "]}, {"page": "2021 in British television", "response": ["|Producer Charlie Hanson is removed from Netflix comedy series After Life and suspended from the British Academy of Film and Television Arts following allegations of sexual assault."]}, {"page": "List of songs written by Justin Tranter", "response": ["| Charlie Hanson || \"Chosen Family\""]}, {"page": "List of songs written by Julia Michaels", "response": ["| Charlie Hanson || \"Toxins\" || "]}]}}