{"wiki_id": "http://www.wikidata.org/entity/Q5085109", "itemLabel": "Charlie Kemp", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Kemp", "wikipedia_page": {"main": "Charlie Kemp is a British actor who is best remembered for playing the young character Max King in the ITV soap opera Emmerdale in 2005. His character was only in the series for a few months, dying in early October when he was passenger in a crashed car which exploded into flames.\nHe also appeared in Is Harry on the Boat? as Robbie Cooper. He has guest starred in Casualty as Dean Forrest and as Gordon in an episode of Doctors, broadcast 14 November 2008.\nOn 28 July 2014 he appeared in Coronation Street as Oliver Porter, acting as mediator in a dispute between Nick and Leanne Tilsley.", "link_mentions": [{"page": "Jack Sugden", "response": ["Jack later begins dating Woolpack landlady Diane Blackstock (Elizabeth Estensen). When Andy discovers Robert (now Karl Davies) is having an affair with his wife, Katie (Sammy Winward), he waits for Robert in his caravan with a shotgun, intending to shoot him but accidentally shoots Jack instead. Having almost died, Jack initially disowns Andy but they reconcile and Jack and Diane plan to marry but she reveals that she had colon cancer and undergoes chemotherapy. The couple married and enjoy a honeymoon in Las Vegas while Diane recovered. Further drama ensues when Jack learns Andy is the father of 15-year-old Debbie Dingle's (Charley Webb) daughter, Sarah, but supports Andy when he said he wanted to be a hands-on father, impressed with how responsible Andy had become. After a revenge attempt against Andy for killing Sarah backfires, resulting in the tragic death of Max King (Charlie Kemp), Jack banishes Robert from the village."]}, {"page": "Zoe Tate", "response": ["Effie reveals her feelings for Zoe and shortly before she is due to stand trial, Zoe plans to run away with her and the children. At the airport, Sadie King (Patsy Kensit) appears and blackmails Zoe into returning home and selling Home Farm to her at a reduced price. When Zoe returns home, Effie pleads with her to understand, but Zoe punches her. She stands trial for attempted murder and is freed when Paddy reveals that Scott was angry on the night of the attack and had threatened him. Zoe packs up Home Farm and plans to leave with Callum, who refuses to stay behind with the Kings. Zoe and Callum break a gas pipe and set a timer to go off just as Tom (Ken Farrington), Jimmy (Nick Miles) and Max King (Charlie Kemp) arrive. Callum stops the car and he and Zoe watch the house explode before driving away."]}, {"page": "Robert Sugden", "response": ["During his first stint, Robert has embarked on a longstanding feud with his brother Andy (Kelvin Fletcher) after discovering he started the fire that killed their mother Sarah (Alyson Spiro). Their rivalry led to the events of Robert having an affair with Andy's wife Katie (Sammy Winward), whom he later cheated on by sleeping with her rival Sadie King (Patsy Kensit), and culminated with him causing the tragic death of Max (Charlie Kemp) after the pair tried to kill each other by running the other down in their own vehicle. Robert subsequently left the village to avoid going to prison for Max's death, but came back briefly for Jack's funeral in February 2009.", "Feeling guilty, Katie ends the affair the day before her wedding to Andy in February 2004, leaving him devastated. However, they resume the affair after the wedding, despite Robert's reconciliation with Donna. They intend to run away together but Robert insists they tell Andy the truth when he finds Katie's farewell note, leaving him distraught. Donna is also devastated by the revelation and feels betrayed by her boyfriend and best friend. The aftermath of the affair leads to Andy waiting in Robert's caravan with a shotgun, planning to kill them both. However, he accidentally shoots Jack instead, leaving him fighting for his life. Robert initially refuses to forgive Andy but when he realizes that he is responsible for the situation, they reconcile and embrace in the hospital. Jack survives the gunshot wound and sticks to the coverup story the boys told the police, but unable to see Andy unpunished for trying to do such a thing to Robert disowns him and he returns alone to Butler's Farm. Robert also continues his relationship with Katie. In early 2005, Robert proposes to Katie and she accepts, and the pair plan to marry later that year. However, Robert is seduced by Sadie King (Patsy Kensit), a woman sixteen years his senior. Robert and Sadie embark on an affair and Robert thinks he can keep it a secret. However, Daz sees Robert kissing Sadie and he tells Andy who confronts Robert in the garage and attacks him. He tries to force Robert to tell Katie about his affair with Sadie, but Robert insists that Andy is lying. Katie eventually learns the truth when she finds erotic text messages on Robert's phone from Sadie. Heartbroken, Katie ends the relationship and Andy comforts her, leading to them sleeping together. Despite Robert begging her to stay, Katie leaves the village the following day. Heartbroken and enraged by Andy and Katie sleeping together, Robert vows to get revenge on Andy, and helps Jimmy King (Nick Miles) and Cain Dingle (Jeff Hordley), set fire to the barn at Butler's Farm. Robert sees Jimmy and Cain beat up Andy and stops them. Daz accidentally stabs Jimmy with a pitchfork while trying to protect Andy. Robert and Cain take Jimmy away and Jimmy's brother, Max (Charlie Kemp), patches him up at the vets. However, the truth soon comes out and Jack throws Robert out, disowning him and calls him a traitor. Robert and Andy's feud is reignited by this and Robert starts dating Debbie Dingle (Charley Webb), the mother of Andy's daughter, Sarah (Lilly-Mae Bartley). Robert and Debbie plan to go to London, along with Max who was leaving the village after poisoning cows belonging to the Briggs family for his father, Tom (Ken Farrington). However, on the day that they plan to leave in October 2005, Andy finds out about Robert and Debbie's plan and forces her to tell him where she is going to meet Robert, he goes there and confronts him, and they start fighting. Max is forced to separate them and Robert tells Debbie that he doesn't care about her and was only interested in her because of Sarah and wanted to hurt Andy by taking his daughter away. Debbie leaves and returns to the village, heartbroken.", "Karl Davies's reign as Robert increased the character's popularity as well as establishing the character as a sex symbol. Much of Davies's time on Emmerdale centred upon his long-standing feud with adoptive brother Andy Sugden (Kelvin Fletcher), which was used by Emmerdale producers to compete with rival soap opera EastEnders. His popular relationships with Donna Windsor, Andy's wife Katie Sugden and Debbie Dingle, established him as a bad boy, but the storyline which saw him leave his love interest Elaine Marsden for dead in a car accident, led to him being described as \"an out-and-out villain\" by critics. In mid–2005 it was announced that either Robert or Andy Sugden. Max King (Charlie Kemp) would be killed in a car accident that would take place in October of that year. The decision to kill off one character came after actor Charlie Kemp quit the show and producers decided to have Karl Davies written out of the soap. The episode which took place on 2 October 2005 saw Max killed while in Andy's land rover, after he grabbed the wheel when Andy and Robert began driving towards each other at high speed after Andy thwarted Robert's plan to escape the village with Andy's daughter Sarah and Sarah's mother Debbie Dingle. The following episode saw Robert leave the serial to avoid trouble with the police."]}, {"page": "Marlon Dingle", "response": ["The grief suffered by Marlon was prolonged close to a year until he developed a friendship with Donna Windsor (Verity Rushworth). It was thanks to Donna's kind heart that Marlon moved on from his loss. Although he rebuffed her attempts to snare him early in the year, Donna proved she was the woman for Marlon when she helped him look after his cousin, Lilith Dingle's (Amanda Hennessy), children when she suddenly left them with him. It didn't take long for Marlon and Donna to fall in love. When he proposed to her en route to a chef's competition in Newcastle, Donna agreed and it looked like there was a happy ending in sight. However, being so young, marriage was a big thing for Donna to consider. She'd also recently become close to Max King (Charlie Kemp) and his death left her absolutely devastated."]}, {"page": "Jo Stiles", "response": ["Jo arrives in the village as new receptionist at the vets' surgery and is soon noticed by the local men, especially Max King (Charlie Kemp) and Danny Daggert (Cleveland Campbell). Jo and Danny went on a date but they agree he is far too tame for a bad girl like her. Jo settles into her job and needing somewhere to live, moves into Connelton View with Dawn Woods (Julia Mallam) and her son, TJ (Connor Lee). After seeing chemistry between Dawn and Danny, Jo sets the pair up. However, Jo’s carefree, single life inspires Dawn to quickly end things with Danny."]}, {"page": "Is Harry on the Boat?", "response": ["* Charlie Kemp as Robbie Cooper"]}, {"page": "List of former Emmerdale characters", "response": ["|Max King || Charlie Kemp || 2005"]}, {"page": "List of Emmerdale characters (2005)", "response": ["Amy Carter was the girlfriend of Max King (Charlie Kemp). Max and Amy had spent time traveling and arrive in the village for his father Tom's (Kenneth Farrington) ill-fated wedding to Charity Dingle (Emma Atkins) before intending to travel to Thailand after visiting Amy's parents in Cornwall. The King family treats her with open contempt. The wedding ends in disaster, and Tom re-evaluates his life and demands that Max stay and get a job. Max agrees, and an upset Amy says she will wait for him. However, he tells her to go to Cornwall without him. She tells him that they will keep in touch, but as she leaves the village in a taxi, Max deletes her number from his mobile phone. ", "Libby and her sister Tamsin (Jenny Gleave) are first glimpsed on horseback by Andy and his younger brother Daz (Luke Tittensor). The sisters come from money, and Libby asks Andy about renting out his stables. Andy hopes for a date, but is disappointed to learn she has a boyfriend. Libby begins working as a receptionist at the vets and has to fend off the flirtations of Max King (Charlie Kemp). When she loses interest in her boyfriend, she begins dating Andy. She's rattled when she learns he had a relationship with underage Debbie Dingle (Charley Webb), but she and Andy become closer and closer, with Libby even planning to open a business on his farm, giving pony rides to children. Their happy relationship ends when Andy learns Debbie has given birth to his child. Andy wants to do right by the baby, so he breaks up with Libby to be with Debbie. Libby puts up a good front, but is clearly hurt. A few weeks later, she announces her plans to spend the summer in Italy with her sister Tamsin. She offers to give Paddy Kirk (Dominic Brunt) her notice, but he fires her with immediate effect and she leaves.", "Sandra is married to Craig, a local farmer. When Tom King (Ken Farrington) wants to buy their land, he sends his son Max (Charlie Kemp), a vet, to kill their livestock. Sandra and Craig are furious with the Kings but are unable to tell the police for insurance reasons, so Max's boss Paddy Kirk (Dominic Brunt) takes the blame. Sandra needs more money so she gets a job at Eric Pollard (Christopher Chittell)'s factory as a machinist. She works with Val Lambert (Charlie Hardwick) and  Delilah Dingle (Hayley Tamaddon). "]}, {"page": "Donna Windsor", "response": ["Donna forms an attraction to  widower Marlon Dingle (Mark Charnock) but he is not interested in pursuing a relationship and she dates Danny Daggert (Cleveland Campbell)  instead. However, The relationship does not last long and they both agree to a mutual break-up. Donna begins getting close to Marlon again and they begin a relationship. After a year together, Marlon proposes, much, to the surprise of Donna, who accepts. They plan their wedding but they are overshadowed when Viv insists they have a double wedding as she and Bob are remarrying. Prior to the wedding, Donna strikes up a close friendship with Max King (Charlie Kemp), whom she enjoys flirting with. When Max is killed in a car crash, caused by Robert, Donna is devastated and Marlon tries to help her through her grief. She keeps a recording of Max's voice on her phone which she regularly listens to. On the morning of the wedding, Donna confesses she has feelings for Max. After some soul-searching, Marlon decides to forgive Donna and they marry along with Viv and Bob."]}, {"page": "Max King (Emmerdale)", "response": ["Max King is a fictional character from the British ITV soap opera, Emmerdale, portrayed by Charlie Kemp."]}, {"page": "Tom King (Emmerdale)", "response": ["Born into a family of successful businessmen, Thomas Albert King grew up in Emmerdale where his father Albert ran a successful business. As an adult, Tom grew away from the family business and founded his own haulage firm, becoming familiar with fellow businessmen such as Frank Tate (Norman Bowler) and Alan Turner (Richard Thorp). Tom fell in love with a Scottish woman named Mary, and he went on to marry her. From their marriage they produced four sons: Jimmy (Nick Miles), Matthew (Matt Healy), Carl (Tom Lister) and Max (Charlie Kemp). When his sons grew up Tom began running his haulage firm with them (with the exception of Max who became a vet), renaming the firm King & Sons."]}, {"page": "Jimmy King (Emmerdale)", "response": ["Jimmy King is a fictional character from the British ITV soap opera, Emmerdale, played by Nick Miles. He made his first appearance on 19 February 2004 and has appeared on the show ever since. Introduced alongside brothers Matthew (Matt Healy), Max (Charlie Kemp) and Carl (Tom Lister), as well as his father Tom (Ken Farrington), Jimmy has evolved from a hard, cold businessman to a devoted husband and a comical character. This personality transformation followed the deaths of all his brothers in 2005, 2008 and 2012 respectively, his father's demise in 2006 and a marriage to Nicola Blackstock (Nicola Wheeler)."]}, {"page": "Sadie King", "response": ["Sadie has sex with Cain, but later rejects his advances. Cain takes his revenge on Sadie by killing her dog, Damon. When Jimmy and Carl's youngest brother Max King (Charlie Kemp) dies in a road collision, Sadie uses Tom's vulnerability to her advantage and is back in the fold after blackmailing his business rival Zoe Tate (Leah Bracknell) into selling Home Farm to the Kings. This impresses Tom as he sought to own Home Farm to further establish his family empire. Later on, Tom becomes so grateful to Sadie that he kisses her, much to her shock. The kiss is witnessed by Jimmy. "]}, {"page": "Sugden family", "response": ["When Andy discovered Robert (now Karl Davies) was having an affair with his wife, Katie (Sammy Winward), he waited for Robert in his caravan with a shotgun, intending to shoot him but accidentally shot Jack instead. Having almost died, Jack initially disowned Andy but they reconciled and Jack and Diane planned to marry but she revealed that she had colon cancer and underwent chemotherapy. The couple married and enjoyed a honeymoon in Las Vegas while Diane recovered. Andy soon got 15-year-old Debbie Dingle's (Charley Webb) pregnant and she gave birth to their daughter Sarah. After a revenge attempt against Andy for killing Sarah backfired, resulting in the death of Max King (Charlie Kemp), Robert fled from the village."]}]}}