{"wiki_id": "http://www.wikidata.org/entity/Q5081259", "itemLabel": "Charles Noel, 3rd Earl of Gainsborough", "itemDescription": "British earl", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Noel,_3rd_Earl_of_Gainsborough", "wikipedia_page": {"main": "Charles William Francis Noel, 3rd Earl of Gainsborough DL (20 October 1850 – 17 April 1926) was a British peer and soldier.", "link_mentions": [{"page": "Maurice Dease", "response": ["Dease is buried at St Symphorien Military Cemetery, 2 kilometres east of Mons, in Belgium. He is remembered with a plaque under the Nimy Railway Bridge, Mons and in Westminster Cathedral. His name is also commemorated on the Wayside Cross at the Catholic priory in Woodchester, near Stroud, Gloucestershire, where his aunt, Lady Mostyn, was a parishioner. He is further commemorated on a cross at Exton, Rutland\"Exton and Whitwell War Memorial\" Grantham Journal Saturday 7 October 1922, page 11; Dease was a nephew of Charles Noel, 3rd Earl of Gainsborough and on a plaque installed in St Martin's Church, Culmullen, County Meath, Ireland.Irish war memorials His Victoria Cross is displayed at the Royal Fusiliers Museum in the Tower of London.Daily Express Victoria Cross holders are being honoured with commemorative paving stones;Victoria Cross commemorative paving stones  Dease's was the first to be unveiled on 23 August 2014 at Glasnevin Cemetery, Dublin.\"First WWI Victoria Cross winner to get memorial in Glasnevin\" Irish Times 22 August 2014"]}, {"page": "Charles William Francis Noel, 3rd Earl of Gainsborough", "response": ["#REDIRECT Charles Noel, 3rd Earl of Gainsborough"]}, {"page": "Charles Noel", "response": ["*Charles Noel, 3rd Earl of Gainsborough (1850–1926), British peer and Member of Parliament"]}, {"page": "Arthur Noel, 4th Earl of Gainsborough", "response": ["Arthur Noel was the son of Charles Noel, 3rd Earl of Gainsborough and his wife Mary Elizabeth Dease, (her sister was the writer Alice Dease), and a great-great-grandson of King William IV.  He succeeded to the earldom on his father's death in 1926."]}]}}