{"wiki_id": "http://www.wikidata.org/entity/Q5087502", "itemLabel": "Phipps Hornby", "itemDescription": "British Royal Navy officer (1785-1867)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phipps_Hornby", "wikipedia_page": {"main": "Admiral Sir Phipps Hornby,  (27 April 1785 – 19 March 1867) was a prominent and experienced Royal Navy officer of the nineteenth century. Hornby served on frigates throughout most of his wartime experience, which included witnessing the Nore Mutiny first hand aged 12 in 1797. Later, commanding his own sixth-rate HMS Volage in 1811, Hornby played a vital role in the British victory at the Battle of Lissa. At Lissa a British squadron under William Hoste overwhelmed a French force more than twice their own strength, Volage combating a much larger ship alone for several minutes and taking numerous casualties, including Hornby, who was wounded.\nLater in life, Hornby accepted a succession of home and seagoing positions to ensure the promotion prospects for his son in the navy as well as to support his close allies in Parliament under the Earl of Derby, to whom he was related. These positions included a period in command of the Pacific Fleet and later a role as one of the Lords of the Admiralty. During his career, Hornby accrued numerous awards and accolades, being made a Knight Grand Cross of the Order of the Bath and a full admiral before his death in 1867.", "link_mentions": [{"page": "Second Sea Lord and Deputy Chief of Naval Staff", "response": ["* Vice-Admiral Sir Phipps Hornby, 1852–1853"]}, {"page": "Pacific Station", "response": ["|Rear Admiral Phipps Hornby || style=\"text-align:right;\"| 25 August 1847 || style=\"text-align:right;\"| 21 August 1850 ||"]}, {"page": "George Tryon", "response": ["Each year the fleet held a regatta where officers and men from different ships competed against each other, training for months in advance. It was customary for the admiral to provide a cup to be presented to the winner of a sailing race between bona fide service boats of all types. In November 1891 the regatta took place at Suda Bay and the winner of 'the admiral's cup' from 60 boats was Lieutenant Evan-Thomas. The race was initially instituted by admiral Phipps Hornby in 1872 with the intention of encouraging skill in sailing, which was becoming a sideline in a steam powered navy.Fitzgerald pp. 326–328"]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**Phipps Hornby, Second Naval Lord"]}, {"page": "Geoffrey Hornby", "response": ["Admiral of the Fleet Sir Geoffrey Thomas Phipps Hornby GCB (10 February 1825 – 3 March 1895) was a Royal Navy officer. As a junior officer, he saw action at the capture of Acre in November 1840 during the Egyptian–Ottoman War. As a captain he arrived at Vancouver Island with a naval brigade and found that a unit of American troops was about to take over the San Juan Islands in a dispute known as the Pig War: he used his powers of diplomacy to facilitate a peaceful handover of the islands to the United States.", "Born the son of Admiral Sir Phipps Hornby and Sophia Maria Hornby (daughter of General John Burgoyne), Hornby was educated at Winwick Grammar School and Southwood's School in Plymouth and joined the Royal Navy in March 1837. He was appointed, as a first class volunteer, to the first-rate HMS Princess Charlotte, flagship of the Commander-in-Chief, Mediterranean Fleet and saw action at the capture of Acre in November 1840 during the Egyptian–Ottoman War.Heathcote, p. 118 He transferred to the fourth-rate HMS Winchester, flagship of the Commander-in-Chief, Cape of Good Hope Station, in August 1842. He went on to be mate in the sixth-rate HMS Cleopatra, in the West Africa Squadron, and took part on anti-slavery operations. Promoted to lieutenant on 15 June 1845, he became flag-lieutenant in the second-rate HMS Asia, flagship of his father, who was Commander-in-Chief, Pacific Station, in September 1847. He was promoted to commander on 12 January 1850 and to captain on 18 December 1852."]}, {"page": "Rear-Admiral of the United Kingdom", "response": ["*Sir Phipps Hornby 26 November 1866 – 19 March 1867"]}, {"page": "Hornby's storm petrel", "response": ["Hornby's storm petrel (Hydrobates hornbyi), also known as the ringed storm petrel, is a seabird that ranges in the Humboldt Current off the coasts of South America. The species is a very distinctive member of the storm petrel family, with a dark cap, white face and underparts, forked tail and a black band across the chest. It is relatively common in the seas off Peru, Chile and Ecuador. The species is named after Admiral Sir Phipps Hornby."]}, {"page": "Hornby Lighthouse", "response": ["The tower construction ended in 1858, and it was the third lighthouse built in New South Wales, following Macquarie Lighthouse in 1818 and Nobbys Head Light in 1858. It was opened by Sir William Denison, Governor of New South Wales, and named after the family of his wife Caroline, daughter of Admiral Sir Phipps Hornby, though it was known as the \"Lower Light\", to distinguish it from Macquarie Lighthouse, the \"Upper Light\"."]}, {"page": "HMS Volage (1807)", "response": ["In 1810 Captain Phipps Hornby took command and she served in the Adriatic, fighting at the Battle of Lissa and driving off a much larger French ship during the action. The action cost Volage 13 men killed and 33 wounded. Volage was badly cut-up in the battle. On 2 June she sailed from Malta for England in company with  and the prizes from the battle. She carried with her Lord Byron as a passenger."]}, {"page": "Battle of Lissa (1811)", "response": ["| align= left |Captain Phipps Hornby"]}, {"page": "HMS Spartan (1806)", "response": ["In 1814, Spartan returned to Portsmouth, where command passed to Phipps Hornby, who briefly served with her in the Mediterranean.Hornby, Sir Phipps, Oxford Dictionary of National Biography, J. K. Laughton. Retrieved 1 April 2008 While commander of Spartan, Hornby participated in the capture of Elba from the French, for which he was invested with the Austrian order of St Joseph of Würzburg."]}, {"page": "Dalton Hall, Cumbria", "response": ["*Admiral Sir Phipps Hornby (1785-1867), younger brother of Edmund Hornby (1773-1857)."]}, {"page": "James John Hornby", "response": ["Hornby was born at Winwick, the third son of Admiral Sir Phipps Hornby and his wife Sophia Maria Burgoyne, eldest daughter of Sir John Burgoyne.The Times James John Hornby, Obituary 3 November 1909  He was educated at Eton, where he did not row, but played in the Eton cricket eleven in 1845.Wisden Obituaries in 1909"]}, {"page": "Phipps Hornby (cricketer)", "response": ["Phipps was the son of Admiral Sir Phipps Hornby and Sophia Maria Burgoyne, Phipps' brothers were Geoffrey and James. Geoffrey had a notable career in the Royal Navy, where he became Admiral of the Fleet. James was a notable rower who rowed for Oxford and was later the headmaster of Eton College.Hornby at thepeerage.com"]}, {"page": "Robert Fanshawe Stopford", "response": ["In 1843 he married Emily Anna Wilbraham; they had five sons and two daughters.The Peerage.com Following the death of his first wife in 1862, he married Lucy Hester Hornby, the daughter of Admiral Sir Phipps Hornby, in 1865."]}, {"page": "William Evelyn Denison", "response": ["Denison was the eldest son of Sir William T. Denison (1804–71), a British colonial governor and brother of Speaker Evelyn Denison. His mother was Caroline née Hornby, daughter of Admiral Sir Phipps Hornby. At the age of 3 he moved to Van Diemen's Land, where his father had been appointed Lieutenant-Governor. In 1854 Sir William was promoted to Governor of New South Wales, and the family moved to Sydney."]}, {"page": "Stanhope Medal", "response": ["The \"Stanhope Medal\" is named after British Royal Navy officer Chandos Scudamore Scudamore Stanhope (1823–1871). He served as a naval officer mate from November 1842 after he passed his officer's exam. He was promoted to lieutenant in March 1846. Stanhope was also a personal assistant to First Lord of the Admiralty Hugh Childers. He served on , a 50-gun ship with captains Sir John Hay and Sir Provo William Parry Wallis. He was appointed in December 1846 to , a 110-gun ship of Sir John West at Devonport. Stanhope later served from August 1847 in the Pacific on , an 84-gun ship commanded by Rear-Admiral Phipps Hornby. Stanhope became a captain in August 1858. He commanded  from Rio de Janeiro to Singapore in 1867."]}, {"page": "Geoffrey Hardinge Phipps-Hornby", "response": ["He was born on 4 April 1889, the son of Captain Geoffrey Stanley Phipps-Hornby, an officer of the Rifle Brigade, and his wife Jessie (née Gunston), members of a distinguished family of landed gentry.Adams – Birley – Hornby: Col. Geoffrey Hardinge Phipps Hornby C.B.E. He was the grandson of Admiral of the Fleet Sir Geoffrey Phipps Hornby,Adams – Birley – Hornby: Capt. Geoffrey Stanley Phipps Hornby J.P. great-grandson of Admiral Sir Phipps Hornby,Adams – Birley – Hornby: Admiral of the Fleet Sir Geoffrey Thomas Phipps Hornby G.C.B., J.P. great-great-grandson of General John Burgoyne,Adams – Birley – Hornby: Lady Maria Sophia Burgoyne nephew of General Edmund Phipps-Hornby, VC, and Admiral Robert Phipps Hornby,See children of Admiral of the Fleet Sir Geoffrey Thomas Phipps Hornby G.C.B., J.P. and great-nephew of Captain Cowper Coles,Brother of Emily Frances Coles designer of the ill-fated HMS Captain, and James Hornby, headmaster of Eton.See children of Admiral Sir Phipps Hornby G.C.B Cousins on his father's side included the Rt. Rev. Hugh Leycester Hornby,See children of Admiral Sir Phipps Hornby G.C.B the latter's son Richard Hornby, MP, and the Earls of Derby and other members of the Stanley family.By way of his great-great-grandmother, "]}, {"page": "Hornby (surname)", "response": ["*Geoffrey Thomas Phipps Hornby (1825–1895), British admiral of the fleet", "*Phipps Hornby (1785–1867), British naval officer", "*Phipps Hornby (cricketer) (1820–1848), English cricketer"]}, {"page": "HMS Minorca (1805)", "response": ["Minorca then served off Cadiz in 1807, with Commander Phipps Hornby replacing Waldegrave in March. She sailed home at the end of the year."]}, {"page": "Spouse of the Governor of New South Wales", "response": ["| Lady Denison (née Hornby) was the daughter of Sir Phipps Hornby and was appointed to the Order of the Crown of India (CI) in 1878 for her and her husband's services in Madras. "]}, {"page": "1861 Birthday Honours", "response": ["*Admiral Sir Phipps Hornby "]}, {"page": "List of Royal Navy admirals (1707–current)", "response": ["| Sir Phipps Hornby GCB", "|Sir Geoffrey Thomas Phipps Hornby GCB", "|Robert Stewart Phipps Hornby CMG"]}, {"page": "Edmund Hornby (politician)", "response": [" by his wife Lucy Smith-Stanley (d.1833) a daughter of James Smith-Stanley, Lord Strange (1716–1771), (son and heir apparent of Edward Stanley, 11th Earl of Derby (1689-1776) of Knowsley Hall in Lancashire) and a sister of Edward Smith-Stanley, 12th Earl of Derby (1752-1834). Edmund's sister Charlotte Margaret Hornby (d.1817) married her first cousin Edward Smith-Stanley, 13th Earl of Derby  (1775-1851), KG, and was the mother of Edward Smith-Stanley, 14th Earl of Derby (1799-1869), thrice Prime Minister of the United Kingdom (1852, 1858–9, 1866–8), thus Edmund's nephew. One of Edmund's younger brothers was Admiral Sir Phipps Hornby (1785-1867)."]}]}}