{"wiki_id": "http://www.wikidata.org/entity/Q5082906", "itemLabel": "Charles Thomas-Stanford", "itemDescription": "British politician and historian (1858-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Thomas-Stanford", "wikipedia_page": {"main": "Sir Charles Thomas-Stanford, 1st Baronet (3 April 1858 – 7 March 1932), born Charles Thomas, was a British Conservative Party politician from Brighton. He sat in the House of Commons from 1914 to 1922.", "link_mentions": [{"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Charles Thomas-Stanford"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Charles Thomas-Stanford"]}, {"page": "Brighton (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Charles Thomas-Stanford"]}, {"page": "Thomas-Stanford baronets", "response": ["#REDIRECT Charles Thomas-Stanford"]}, {"page": "Cooper Rawson", "response": ["He was elected Member of Parliament (MP) for Brighton at the 1922 general election, replacing the Conservative MP Charles Thomas-Stanford, who had retired. He stood down from local government on his election to Westminster and held his seat in the Commons at the next five general elections. Rawson holds the record for the largest number of votes ever polled by a candidate at a British general election, a record he achieved in the 1931 election by polling 75,205 votes. Such a feat also makes Rawson the record holder for the largest majority for an MP, at 62,253. This record was typical of a wider contest which saw an overwhelming Conservative victory."]}, {"page": "Semley", "response": ["By 1839 Benett's estate at Semley amounted to , but by 1847 about  of the land bought from the Arundells had been re-sold. The bulk of Benett's acquisitions at Semley remained with his heirs until his grandson Vere Fane Benett-Stanford died in 1894 and his widow married Charles Thomas-Stanford in 1897. The estate then passed to John Benett's great-grandson John Fane-Benett-Stanford, who died in 1947. "]}, {"page": "Sir Charles Thomas-Stanford, 1st Baronet", "response": ["#REDIRECT Charles Thomas-Stanford"]}, {"page": "Sir Charles Thomas-Stanford", "response": ["#REDIRECT Charles Thomas-Stanford"]}, {"page": "Round Hill, Brighton", "response": ["In 1800, Round Hill was a steep-sided, round-topped hill rising to  and ploughed up for use by farmers.  Some poorly defined tracks crossed it, linking Preston village to the road to Lewes. Two of the largest landowners in the Brighton and Hove area, Thomas Read Kemp and William Stanford (an ancestor of Charles Thomas-Stanford of the Thomas-Stanford Baronetcy of Preston Manor), owned most of the land between them.  In the late 19th century, the Stanford family sold some of their land—which almost completely encircled Brighton, Preston and Hove to the north—for housing development, and retained much of it to develop themselves."]}, {"page": "Thomas-Stanford Baronets", "response": ["#REDIRECT Charles Thomas-Stanford"]}, {"page": "1914 Brighton by-election", "response": ["The Brighton by-election of 1914 was held on 29 June 1914.  The by-election was held due to the resignation of the incumbent Conservative MP, John Edward Gordon.  It was won by the Conservative candidate Charles Thomas-Stanford, who was unopposed."]}, {"page": "1929 New Year Honours", "response": ["*Charles Thomas-Stanford  For public services in Brighton and district."]}, {"page": "Thomas-Stanford, Charles", "response": ["#redirectCharles Thomas-Stanford"]}, {"page": "William Roe (civil servant)", "response": ["Roe's notebooks and diaries, recorded from 1775 to 1809, were edited by Charles Thomas-Stanford and published as The Private Memorandums of William Roe (Brighton, 1928).William Matthews, British Diaries: An Annotated Bibliography of British Diaries Written Between 1442 and 1942 (University of California Press, 2021), p. 112."]}]}}