{"wiki_id": "http://www.wikidata.org/entity/Q5082125", "itemLabel": "Charles Robins", "itemDescription": "English cricketer (born 1935)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Robins", "wikipedia_page": {"main": "Robert Victor Charles Robins (born 13 March 1935), known as Charles Robins, is a former English cricketer and insurance executive. He is the eldest son of Walter Robins, who played Test cricket for England in the 1930s.", "link_mentions": [{"page": "Walter Robins", "response": ["Whatever his difficulties in coming to terms with the cricket of a later era, Robins was widely recognised as one of the most dynamic cricketers of his time, a fact that was acknowledged in the tributes paid after his death, in 1968, by his former playing colleagues. His son, Charles Robins, played for Middlesex from 1953 to 1960, as a leg-spin and googly bowler in the manner of his father.", "Walter Robins's son, Robert Victor Charles, known as Charles Robins and, like his father, a leg-spin and googly bowler, was captain of the Eton XI in 1953, and played for Middlesex between 1953 and 1960. Walter's grandson Charles William Veral (born 1965) played for Middlesex 2nd XI in 1983."]}, {"page": "R.V.C.Robins", "response": ["#REDIRECT Charles Robins"]}, {"page": "R. V. C. Robins", "response": ["#REDIRECT Charles Robins"]}, {"page": "Don Bennett (cricketer)", "response": ["He later served as Chairman of the Cricket Committee and as a member of the General Committee. He was awarded a Life Vice-Presidency and he began a two-year term as president at the 2007 Annual General Meeting, succeeding Charles Robins. He was a popular coach and administrator with the players, respected by several who would enjoy international careers, \"including such characters as Mike Gatting, John Emburey, Angus Fraser, Phil Edmonds, Mike Selvey, Mark Ramprakash and Phil Tufnell.\" \"Not confident\" with first team coaching according to Brearley, he instead focused on introducing young players to the club. \"Don [was] a good judge of a cricketer, was tough with the younger players but also kind and well-disposed to them.\" The Daily Telegraph remarked that \"His greatest talent, however, was for spotting young talent. Kept in touch by a network of trusted informants, he criss-crossed the country, visiting schools festivals and minor counties matches. There he was to be found unobtrusively sitting on a bench or leaning against a tree.\""]}, {"page": "Robert Victor Charles Robins", "response": ["#REDIRECT Charles Robins"]}, {"page": "Keith Adams (cricketer)", "response": ["While studying at the University of Cambridge, Adams made a single first-class appearance for Cambridge University against Middlesex at Fenner's in 1954.  Adams opened the batting for Cambridge University, being dismissed for a duck by Don Bennett in their first-innings, while in their second-innings he was dismissed for 34 runs by Charles Robins.  Middlesex won the match by 4 wickets."]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Charles Robins (1959)"]}, {"page": "Charles Robbins", "response": ["* Charles Robins (born 1935), English cricketer"]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Charles Robins (1954–1962) : R. V. C. Robins (Middlesex)"]}, {"page": "Robins, Charles", "response": ["#redirectCharles Robins"]}, {"page": "Derek Lister", "response": ["Born at Norwood, Lister played minor counties cricket for Wiltshire in 1951, making two appearances in the Minor Counties Championship. He later studied at the University of Cambridge, where he made a single appearance in first-class cricket for Cambridge University against Middlesex at Fenner's in 1954. Batting twice during the match, Lister was dismissed by Ronnie Bell for 31 runs in the Cambridge first-innings, while in their second-innings he was dismissed for 4 runs by Charles Robins. He died at Northampton in November 1980."]}]}}