{"wiki_id": "http://www.wikidata.org/entity/Q509448", "itemLabel": "John Harle", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Harle", "wikipedia_page": {"main": "John Harle (born 20 September 1956) is an English saxophonist, composer, educator and record producer. He is an Ivor Novello Award winner and has been the recipient of two Royal Television Society awards.", "link_mentions": [{"page": "September 20", "response": ["*  1956   – John Harle, English saxophonist, composer, conductor, and producer"]}, {"page": "Michael Nyman", "response": ["Among Nyman's other works are the opera Noises, Sounds & Sweet Airs (1987), for soprano, alto, tenor and instrumental ensemble (based on Nyman's score for the ballet La Princesse de Milan); Ariel Songs (1990) for soprano and band; MGV (Musique à Grande Vitesse) (1993) for band and orchestra; concertos for saxophone, piano (based on The Piano score), violin, harpsichord, trombone, and saxophone & cello recorded by John Harle and Julian Lloyd Webber; the opera The Man Who Mistook His Wife for a Hat (1986), based on a case-study by Oliver Sacks; and five string quartets. In 2000, he produced a new opera on the subject of cloning on a libretto by Victoria Hardie titled Facing Goya, an expansion of their one-act opera Vital Statistics. The lead, a widowed art banker, is written for contralto and the role was first created by Hilary Summers. His newest operas are Man and Boy: Dada (2003) and Love Counts (2005), both on libretti by Michael Hastings."]}, {"page": "Silent Witness", "response": ["The theme music from series 2 onwards is entitled Silencium and is performed by John Harle. The arrangement, for chamber orchestra and soprano saxophone solo, was first performed as part of the Canterbury Festival on 22 October 2011. The vocal section is performed by Sarah Leonard."]}, {"page": "1997 in music", "response": ["| Terror & Magnificence || Elvis Costello and John Harle ||-"]}, {"page": "Marc Almond", "response": ["Almond released three albums throughout 2014. First was The Tyburn Tree with composer John Harle, a concept album about dark historical London. This was followed by The Dancing Marquis album, made with a number of collaborators including Jarvis Cocker, Carl Barât and Jools Holland, featuring production from Tony Visconti on some tracks. Finally, Almond released a studio recording of his 2011 show, Ten Plagues - A Song Cycle."]}, {"page": "Tom Pickard", "response": ["In 2004 Pickard was commissioned by Sage Gateshead and Folkworks to write a libretto, Ballad of Jamie Allan, for the composer John Harle. The opera was premiered in 2005. A CD of Ballad of Jamie Allan (with Omar Ebrahim, Sarah Jane Morris, Kathryn Tickell, Bill Paterson, the Northern Sinfonia with Steve Lodder and Neil MacColl).", "Pickard collaborated with John Harle again in 2009, writing the words for A Song for London Bridge, a piece for saxophone and choir and organ. It had its premiere on 22 June at Southwark Cathedral with Harle on saxophone, the King's College Choir, Cambridge, conducted by Stephen Cleobury and with the organ played by David Goode."]}, {"page": "List of 21st-century classical composers", "response": ["|John Harle || 1956 ||  || English ||  ||"]}, {"page": "Joe Boyd", "response": ["| 1987 || John Harle || Habanera ||  || "]}, {"page": "The King's Singers", "response": ["|George Shearing (piano), Neil Swainson (double bass), John Harle (saxophone)"]}, {"page": "Soprano saxophone", "response": ["Notable classical soprano saxophonists include Carina Rascher, Christine Rall, Michael Hernandez, Eugene Rousseau, Kenneth Tse,  Jean-Yves Fourmeau, Jean-Denis Michat, Vincent David, Rob Buckland, John Harle, Mariano Garcia, Claude Delangle, Arno Bornkamp, Timothy McAllister, and Christopher Creviston."]}, {"page": "Lamia (poem)", "response": ["The poem was dramatized on BBC Radio 4 on 1 January 2010 on the Afternoon Play series (later re-broadcast on 5 January 2012).  The production was directed by Susan Roberts with original music composed and performed by John Harle.  The cast included:"]}, {"page": "Huddersfield Philharmonic Orchestra", "response": ["The years 2000 and 2001 saw the Phil produce a CD of significant performances whilst planning major concerts, including performances of Sally Beamish’s concerto for saxophone, The Imagined Sound of Sun on Stone, with John Harle as soloist and another huge Mahler symphony, his third. When John Harle was taken ill, a potential problem became the beginning of a new musical friendship when his place was taken by Jack Liebeck, in a performance of the Mendelssohn Violin concerto. “Victory snatched from the jaws of defeat “read the headline in the Huddersfield Examiner, and the reviewer commented “Clearly, members knew this piece but, to dust it down in one hour and give such a performance demonstrates the talent which the Huddersfield Philharmonic has in its ranks.” If this concert tested the abilities of the players, the plans for Mahler’s Third Symphony were to With the sudden unavailability of Rupert D’Cruze, Nicholas Cleobury stepped in to take on the task of performing Mahler’s Third Symphony and, following this success, he was appointed as Principal Guest Conductor within two years. He has attracted comments including:"]}, {"page": "Royal Grammar School, Newcastle upon Tyne", "response": ["* John Harle (born 1956), saxophonist and composer"]}, {"page": "Bournemouth Sinfonietta", "response": ["*Gavin Bryars: The Green Ray (John Harle/ Ivor Bolton)", "*Michael Nyman: Where the Bee Dances (John Harle/ Ivor Bolton)", "*Mike Westbrook: Bean Rows and Blues Shots (John Harle/ Ivor Bolton)"]}, {"page": "The Three Ravens", "response": ["\"The Three Ravens\" and \"Twa Corbies\" have been performed and recorded by artists such as Heather Alexander, Annwn, A Chorus of Two, Ayreheart, Damh the Bard, Bishi, Boiled in Lead, Scott Boswell, Djazia Satour, Cécile Corbel, Clam Chowder, The Corries, Crooked Mouth, Alfred Deller, The Duplets, Frances Faye, Richard Dyer-Bennet, Fiddler's Dram, Ray Fisher & Archie Fisher, John Fleagle and Ewan MacColl, John Harle, The Hare and The Moon, Peter, Paul and Mary, Bert Jansch, Joel Cohen, Kalin Sivov, Andrew King, Mandala Folk, Marie Little, Malinky, Old Blind Dogs, Omnia, Kate Price, Schelmish, Sol Invictus, Sonne Hagal, Sequester, Steeleye Span, Andreas Scholl, Hamish Imlach, Libera (choir), Richard Thompson, Ariella Uliano, Diana Obscura, Terre di mezzo, Kenneth McKellar, Custer LaRue and The Baltimore Consort, Merry Wives of Windsor, Sportive Tricks, The Creepy Bard, The Sands Family, Alice Moving Under Skies, Astral Weeks, Winterfylleth and Faun. The album Farewell Aldebaran contains a song clearly based on Three Ravens but the lyric credits go to Judy Henske, music by Jerry Yester.", "*The song, in a version by John Harle, features in Simon Schama's A History of Britain, particularly in the episodes \"The Body of the Queen\", \"The British Wars\" and \"The Two Winstons\".", "*The Three Ravens sung by Sarah Leonard on John Harle's CD Terror and Magnificence"]}, {"page": "Prospero's Books", "response": ["*John Harle, soprano & alto saxophone"]}, {"page": "Harle", "response": ["* John Harle (born 1956), saxophonist and composer"]}, {"page": "Toyota Crown", "response": ["The S180 model of the Crown, released in late 2003, was based on the Zero Crown concept car. The engine was changed to a V6 for the new Royal and Athlete models, while the Crown Majesta used the V8 only, now in 4.3-liter form with 4WD optional.  The new engines gave more performance while also giving better fuel economy. Radar Pre-Collision System added a single digital camera to improve the accuracy of collision forecast and warning and control levels. (Really Playing it Safe) In television commercials in Japan a song was written by composer John Harle titled \"How should I my true love know?\". G-BOOK was introduced in May 2006."]}, {"page": "Geoffrey Burgon", "response": ["* Silent Witness (1996) series 1 only. [From series 2 the opening titles music, prominently featuring contralto vocals, was composed by John Harle"]}, {"page": "A History of Britain (TV series)", "response": ["The series was produced in conjunction with The History Channel and the executive producer was Martin Davidson. The music was composed by John Harle, whose work was augmented by vocal soloists such as Emma Kirkby and Lucie Skeaping. Schama's illustrative presentation was aided by readings from actors, including Lindsay Duncan, Michael Kitchen, Christian Rodska, Samuel West and David Threlfall."]}, {"page": "BBC Young Musician", "response": ["The 2018 finals were held at the Symphony Hall, Birmingham, on 13 May 2018. The judges were Kerry Andrew (chair), Alpesh Chauhan, Natalie Clein, John Harle and Sunwook Kim."]}, {"page": "Sinan Savaskan", "response": ["Savaskan won the 1988 Dio Fund Award of Arts Council of Great Britain for Composition with his quartet for saxophones, The Street – originally commissioned and premiered by John Harle with his Myrha Saxophone Quartet."]}, {"page": "Dominic Muldowney", "response": ["* Saxophone Concerto (John Harle/London Sinfonietta)/Diego Masson (EMI)"]}, {"page": "Peter King (saxophonist)", "response": ["* John Harle, The Shadow of the Duke (EMI, 1992)"]}, {"page": "Terror & Magnificence", "response": ["Terror & Magnificence is a 1997 classical album by John Harle, featuring Elvis Costello, Sarah Leonard, and Andy Sheppard."]}, {"page": "The Juliet Letters", "response": ["# \"O Mistress Mine\" (with John Harle) (Harle) – 4:03 released on Terror & Magnificence by John Harle May 1997", "# \"Come Away, Death\" (with John Harle) (Harle) – 4:30 released on Terror & Magnificence by John Harle May 1997"]}, {"page": "Elvis Costello discography", "response": ["| align=\"left\" | John Harle featuring Elvis Costello, Sarah Leonard, and Andy Sheppard", "|Songs from a History of Britain by John Harle"]}, {"page": "Vocalise (Rachmaninoff)", "response": ["* for saxophone and piano, arranged by John Harle"]}, {"page": "Andy Sheppard", "response": ["* John Harle, Terror and Magnificence (Argo, 1996)", "* John Harle, The Ship (BBC, 2002)"]}, {"page": "Music for Youth", "response": ["Throughout the years MFY has had many guest performers including John Dankworth, Ronnie Scott, Don Lusher, Humphrey Lyttelton, Andrew Lloyd Webber, John Williams, Rick Wakeman, Tim Rice, Julian Lloyd Webber, Kenny Baker and Malcolm Arnold. Past performers include Evelyn Glennie, Nigel Kennedy, Thomas Adès, John Harle and Gary Barlow."]}, {"page": "Roy Babbington", "response": ["* John Harle, Elvis Costello, Terror and Magnificence (Argo, 1996)"]}, {"page": "Il Sogno", "response": ["* John Harle – saxophone"]}, {"page": "Michael Nyman Band", "response": ["Many of the current and former band members, including John Harle, Alexander Balanescu, Dave Lee, Madeleine Mitchell, Andrew Findon, and Simon Haram, have released solo albums that include performances of Nyman's music.", "*John Harle (1981–1999), soprano saxophone, alto saxophone, tenor saxophone"]}, {"page": "À la folie", "response": ["*John Harle – soprano/alto saxophones"]}]}}