{"wiki_id": "http://www.wikidata.org/entity/Q5091957", "itemLabel": "John Doyle", "itemDescription": "political cartoonist, caricaturist, painter and lithographer (1797-1868)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Doyle_(artist)", "wikipedia_page": {"main": "John Doyle (Dublin 1797 – 2 January 1868 London), known by the pen name H. B., was an Irish political cartoonist, caricaturist, painter and lithographer.\nHe was the eldest son of a Dublin silk mercer, and came from a Roman Catholic family which in the 17th century had been granted extensive estates, possibly in County Offaly or County Laois, and their own coat of arms, but had suffered for their religion and since been dispossessed. In his youth he learned to paint landscapes under Gaspare Gabrielli, and miniature portraits at the Royal Dublin Society's drawing school under John Comerford. He won a gold medal in 1805. He was commissioned to paint equestrian portraits of the Marquess of Sligo and Lord Talbot, the Irish viceroy, and in 1822 he produced six prints entitled The Life of a Racehorse. That year he moved to London with his wife, Marianna Conan. His painting Turning out the Stag brought him recognition when it was exhibited at the Royal Academy in 1825.\nMarianna died in 1832, giving birth to their seventh child. Doyle continued to exhibit miniatures until 1835, but by then he was experiencing greater success with his political cartoons, printed using the new reproductive medium of lithography, beginning in 1827. These were issued once a month during parliamentary sessions, and continued for twenty-two years. His caricatures were mostly faithful likenesses of their subjects, with little exaggeration, treated with sarcastic humour, often alluding to popular plays. They were signed with the letters H. B., constructed out of two Js and two Ds, Doyle's own initials. By 1840 he was prosperous enough to afford a fashionable house in Hyde Park, moving in the same circles as David Wilkie, Walter Scott, Samuel Taylor Coleridge, Charles Dickens, William Makepeace Thackeray, Thomas Macaulay, Thomas Moore and Samuel Rogers – but H. B.'s true identity remained a closely guarded secret until he revealed it in 1843 in a seventeen-page letter to Sir Robert Peel.\nIn the 1840s, at the height of his popularity, indices of H.B.'s prints were published in The Times and by the publisher McLean, but his reputation faded. His later prints were gentle in their humour and drawn in a soft, indistinct style. Thackeray said his cartoons, although clever and witty, were too \"genteel\" to raise more than a gentlemanly smile – \"You will never hear any laughing at 'H. B.'\" When he died in 1868, his obituary in The Art Journal did not appear until three months after his death, and a posthumous sale of his sketches at Christie's in 1882 was cancelled for lack of buyers. However, he is considered a founder of the school of British cartoon satirists represented by John Leech, John Tenniel, and his son Richard Doyle, which established the style made famous by Punch magazine. The British Museum has over 900 of his drawings in its collections.\nHe died at Maida Hill, 2 January 1868, and was buried at West Norwood Cemetery. His sons included the illustrator James William Edmund Doyle (1822–1892); the painter, illustrator and cartoonist Richard Doyle (1824–1883); Henry Edward Doyle, (1827–1892) who became director of the National Gallery of Ireland; and the painter Charles Altamont Doyle (1832–1893), through whom he was a grandfather of Sir Arthur Conan Doyle, the novelist and creator of Sherlock Holmes.", "link_mentions": [{"page": "List of caricaturists", "response": ["* John Doyle (1797–1868)"]}, {"page": "Richard Doyle (illustrator)", "response": ["Born at 17 Cambridge Terrace, London, one of seven children of Irish cartoonist John Doyle (known as 'H.B'), a noted political caricaturist, Doyle had three brothers, James, Charles and Henry Edward Doyle, who were also artists. The young Doyle had no formal art training other than his father's studio, but from an early age displayed a gifted ability to depict scenes of the fantastic and grotesque. Throughout his life he was fascinated by fairy tales. He produced his first complete illustrated book, Home for the Holidays, when he was twelve; it was published posthumously in 1887."]}, {"page": "John Doyle", "response": ["John Doyle may refer to:", "* John Doyle (artist) (1797–1868), Irish artist and grandfather of Arthur Conan Doyle", "* John Doyle (Canadian artist) (born 1950), Toronto artist", "* John Doyle (comedian) (born 1953), Australian comedian and writer", "* John Doyle (critic) (born 1957), Canadian television critic", "* John Doyle (director) (born 1953), British theatre director", "* John Doyle (drummer) (born 1959), drummer for bands Magazine and the Armoury Show", "* John Doyle (musician) (born 1971), member of band Solas, 1994–2000", "* John Doyle, a pen-name of Robert Graves", "* John Doyle (British Army soldier) (1828–1892), Irish cavalryman in the Charge of the Light Brigade", "* John Doyle (RAF officer) (1895–1974), World War I flying ace", "*Sir John Doyle, 1st Baronet (1756–1834), Irish officer, Lieutenant-Governor of Guernsey, Private Secretary to George IV", "*John Doyle (Australian politician) (1875–1951), New South Wales politician", "*John Doyle (West Virginia politician) (born 1942), member of the West Virginia House of Delegates", "* John Doyle (baseball) (1858–1915), Canadian Major League Baseball player", "* John Doyle (hurler) (1930–2010), Irish", "* John Doyle (Carlow hurler) (born 1992), Irish", "* John Doyle (Gaelic footballer) (born 1977), Kildare", "* John Doyle (rugby league) (born 1977), Australian", "* John Doyle (soccer, born 1946), Australian ", "* John Doyle (soccer, born 1966), American", "* John Doyle (engineer) (born c. 1955), developed techniques used by NASA to test space shuttles for damage", "* John Doyle (judge) (born 1945), Chief Justice of South Australia", "* John Doyle (police officer) (died 1913), New Zealand police officer killed in the line of duty", "* John Doyle (announcer), American announcer whose voice is used by the National Institute of Standards and Technology radio station WWV", "* John Doyle Group, a British civil engineering contractor"]}, {"page": "1822 in art", "response": ["*John Doyle – The Life of a Racehorse (prints)"]}, {"page": "1825 in art", "response": ["*John Doyle – Turning out the Stag"]}, {"page": "Charles Altamont Doyle", "response": ["Doyle was the son of artist John Doyle, the political cartoonist known as H.B., and Marianna Conan Doyle. Three of his older brothers in the family of seven children were artists: James William Edmund Doyle, Richard \"Dickie\" Doyle, and Henry Edward Doyle."]}, {"page": "The Lion and the Mouse", "response": ["In 19th century Britain the political cartoonist John Doyle adapted the fable to one of his monthly series of prints in February 1844. In it the mouse nibbling at the net is Earl Russell, who prevailed on the House of Lords to free the leonine Daniel O'Connell from the imprisonment he had incurred for trying to repeal the Irish Act Of Union. In the United States the fable was applied to a case of corrupt lobbying in a Puck cartoon for 23 July 1913. Under the title 'Even a rat may help free a lion', the House of Representatives is shown enmeshed in the nets of \"Lobbyism\", from which Colonel (Martin) Mulhall is about to free it by his revelations of bribe-taking.Mark Grossman, Political Corruption in America, ABC-CLIO 2003 p.408"]}, {"page": "List of editorial cartoonists", "response": ["* John Doyle (\"H.B.\")"]}, {"page": "1797 in Ireland", "response": ["*John Doyle, artist (died 1868)."]}]}}