{"wiki_id": "http://www.wikidata.org/entity/Q509678", "itemLabel": "Janet Nelson", "itemDescription": "English historian and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Janet_Nelson", "wikipedia_page": {"main": "Dame Janet Laughland Nelson  (born 1942), also known as Jinty Nelson, is a British historian. She is Emerita Professor of Medieval History at King's College London.", "link_mentions": [{"page": "Alfred the Great", "response": ["Osferth was described as a relative in King Alfred's will and he attested charters in a high position until 934. A charter of King Edward's reign described him as the king's brother – mistakenly according to Keynes and Lapidge, and in the view of Janet Nelson, he probably was an illegitimate son of King Alfred."]}, {"page": "Winchester", "response": ["The consensus among historians of Anglo-Saxon England is that the court was mobile in this period and there was no fixed capital. Martin Biddle has suggested that Winchester was a centre for royal administration in the 7th and 8th centuries, but this is questioned by Barbara Yorke, who sees it as significant that the shire was named after Hamtun, the forerunner of Southampton. However, Winchester is described by the historian Catherine Cubitt as \"the premier city of the West Saxon kingdom\" and Janet Nelson describes London and Winchester as Alfred the Great's \"proto-capitals\"."]}, {"page": "Ecgberht, King of Wessex", "response": ["Ecgberht's wife's name is unknown. A fifteenth-century chronicle now held by Oxford University names Ecgberht's wife as Redburga who was supposedly a relative of Charlemagne who he married when he was banished to Francia, but this is dismissed by academic historians in view of its late date.The chronicle (Hardy, Vol III, No. 326) describes Ecgberht's wife as \"Redburga regis Francorum sororia\" (sister or sister-in-law of the Frankish Emperor). Some nineteenth-century historians cited the manuscript to identify Redburga as Ecgberht's wife, such W. G. Searle in his 1897 Onomasticon Anglo-Saxonicum and (as Rædburh) in his 1899 Anglo-Saxon Bishops, Kings and Nobles. Other historians of that time were sceptical, such as William Hunt, who did not mention Redburga in his article about Ecgberht in the original Dictionary of National Biography in 1889 (Hunt, \"Egbert\", pp. 619–620). In the twentieth century, popular genealogists and historians have followed Searle in naming Redburga as Ecgberht's wife, but academic historians ignore her when discussing Ecgberht, and Janet Nelson's 2004 article on his son Æthelwulf in the Online Oxford Dictionary of National Biography states that his mother's name is unknown. Æthelwulf is their only known child."]}, {"page": "Æthelwulf, King of Wessex", "response": ["When Æthelwulf succeeded to the throne of Wessex in 839, his experience as sub-king of Kent had given him valuable training in kingship, and he in turn made his own sons sub-kings. According to the Anglo-Saxon Chronicle, on his accession \"he gave to his son Æthelstan the kingdom of the people of Kent, and the kingdom of the East Saxons [Essex] and of the people of Surrey and of the South Saxons [Sussex]\". However, Æthelwulf did not give Æthelstan the same power as his father had given him, and although Æthelstan attested his father's charters as king, he does not appear to have been given the power to issue his own charters. Æthelwulf exercised authority in the south-east and made regular visits there. He governed Wessex and Kent as separate spheres, and assemblies in each kingdom were only attended by the nobility of that country. The historian Janet Nelson says that \"Æthelwulf ran a Carolingian-style family firm of plural realms, held together by his own authority as father-king, and by the consent of distinct élites.\" He maintained his father's policy of governing Kent through ealdormen appointed from the local nobility and advancing their interests, but gave less support to the church. In 843 Æthelwulf granted ten hides at Little Chart to Æthelmod, the brother of the leading Kentish ealdorman Ealhere, and Æthelmod succeeded to the post on his brother's death in 853. In 844 Æthelwulf granted land at Horton in Kent to Ealdorman Eadred, with permission to transfer parts of it to local landowners; in a culture of reciprocity, this created a network of mutual friendships and obligations between the beneficiaries and the king. Archbishops of Canterbury were firmly in the West Saxon king's sphere. His ealdormen enjoyed a high status, and were sometimes placed higher than the king's sons in lists of witnesses to charters. His reign is the first for which there is evidence of royal priests, and Malmesbury Abbey regarded him as an important benefactor, who is said to have been the donor of a shrine for the relics of Saint Aldhelm."]}, {"page": "Æthelbald, King of Wessex", "response": ["Historians give varying explanations for both the marriage and the rebellion. D. P. Kirby and Pauline Stafford see the match as sealing an anti-Viking alliance. Another factor was Judith's descent from Charlemagne: union with her gave Æthelwulf a share in Carolingian prestige. Kirby describes her anointing as \"a charismatic sanctification which enhanced her status, blessed her womb and conferred additional throne-worthiness on her male offspring.\" These marks of a special status implied that a son of hers would succeed to at least part of Æthelwulf's kingdom, and explain Æthelbald's decision to rebel. He may also have feared that he would be disadvantaged if his father returned to rule Wessex while his brother kept Kent. Michael Enright argues that an alliance against the Vikings between such distant territories would have served no useful purpose. He sees the marriage as following Æthelbald's rebellion and being a response to it, intending that a son of Judith would displace Æthelbald as successor to the throne. Janet Nelson goes further, seeing Æthelwulf's pilgrimage as intended from the start to enhance his prestige to assist him in facing down filial resentments. Kirby and Sean Miller argue that it is unlikely that Charles would have agreed to his daughter being taken to a country in a state of civil war, so Æthelbald's revolt was probably a response to the marriage, which threatened to produce sons who had a stronger claim to the throne than he had. Richard Abels argues that Æthelbald probably hoped that his rule would be permanent: \"All knew the dangers that attended a pilgrimage to Rome and were aware of the possibility that Æthelwulf would not return. His departure to Rome all but invited the prowling of hungry æthelings.\" Charles may have agreed to the marriage because he was under attack both from Vikings and from a rising among his own nobility, and Æthelwulf had great prestige due to his victories over the Vikings. The marriage added the West Saxon king to the network of royal and princely allies that Charles was creating."]}, {"page": "Æthelstan", "response": ["William of Malmesbury wrote that Alfred the Great honoured his young grandson with a ceremony in which he gave him a scarlet cloak, a belt set with gems, and a sword with a gilded scabbard.Foot, Æthelstan: The First King of England, pp. 31–33 Medieval Latin scholar Michael Lapidge and historian Michael Wood see this as designating Æthelstan as a potential heir at a time when the claim of Alfred's nephew, Æthelwold, to the throne represented a threat to the succession of Alfred's direct line,Lapidge, Anglo-Latin Literature, p. 68, n. 96; Wood, In Search of England, pp. 157–158; but historian Janet Nelson suggests that it should be seen in the context of conflict between Alfred and Edward in the 890s, and might reflect an intention to divide the realm between his son and his grandson after his death.Nelson, Rulers and Ruling Families, pp. 63–64 Historian Martin Ryan goes further, suggesting that at the end of his life Alfred may have favoured Æthelstan rather than Edward as his successor.Ryan, \"Conquest, Reform and the Making of England\", p. 296 An acrostic poem praising prince \"Adalstan\", and prophesying a great future for him, has been interpreted by Lapidge as referring to the young Æthelstan, punning on the old English meaning of his name, \"noble stone\".Lapidge, Anglo-Latin Literature, pp. 60–68 Lapidge and Wood see the poem as a commemoration of Alfred's ceremony by one of his leading scholars, John the Old Saxon.Lapidge, Anglo-Latin Literature, p. 69; Wood, In Search of England, p. 158 In Michael Wood's view, the poem confirms the truth of William of Malmesbury's account of the ceremony. Wood also suggests that Æthelstan may have been the first English king to be groomed from childhood as an intellectual, and that John was probably his tutor.Wood, In Search of England, p. 157; Wood, \"Stand strong against the monsters\", p. 199; Wood, \"A Carolingian Scholar in the Court of King Æthelstan\", p. 137 However, Sarah Foot argues that the acrostic poem makes better sense if it is dated to the beginning of Æthelstan's reign.Foot, Æthelstan: The First King of England, pp. 32, 110–112", "Even after Ælfweard's death there seems to have been opposition to Æthelstan in Wessex, particularly in Winchester, where Ælfweard was buried. At first Æthelstan behaved as a Mercian king. A charter relating to land in Derbyshire, which appears to have been issued at a time in 925 when his authority had not yet been recognised outside Mercia, was witnessed only by Mercian bishops.Foot, Æthelstan: The First King of England, pp. 73–74; Keynes, \"England c. 900–1016\", pp. 467–468 In the view of historians David Dumville and Janet Nelson he may have agreed not to marry or have heirs in order to gain acceptance.Dumville, Wessex and England, p. 151; Nelson, \"Rulers and government\", p. 104 However, Sarah Foot ascribes his decision to remain unmarried to \"a religiously motivated determination on chastity as a way of life\".Foot, Æthelstan: The First King of England, p. 249", "Æthelstan was a noted collector of relics, and while this was a common practice at the time, he was marked out by the scale of his collection and the refinement of its contents.Brooke, The Saxon and Norman Kings, p. 115 The abbot of Saint Samson in Dol sent him some as a gift, and in his covering letter he wrote: \"we know you value relics more than earthly treasure\".Nelson, \"Rulers and government\", p. 112 Æthelstan was also a generous donor of manuscripts and relics to churches and monasteries. His reputation was so great that some monastic scribes later falsely claimed that their institutions had been beneficiaries of his largesse. He was especially devoted to the cult of St. Cuthbert in Chester-le-Street, and his gifts to the community there included Bede's Lives of Cuthbert. He commissioned it especially to present to Chester-le Street, and out of all manuscripts he gave to a religious foundation which survive, it is the only one which was wholly written in England during his reign.Foot, Æthelstan: The First King of England, pp. 117–124; Keynes, \"King Æthelstan's Books\", p. 180 This has a portrait of Æthelstan presenting the book to Cuthbert, the earliest surviving manuscript portrait of an English king.Karkov, The Ruler Portraits of Anglo-Saxon England, p. 55 In the view of Janet Nelson, his \"rituals of largesse and devotion at sites of supernatural power ... enhanced royal authority and underpinned a newly united imperial realm\"."]}, {"page": "Peter Brown (historian)", "response": ["Janet Nelson, the distinguished British historian of the early Middle Ages, has said: \"He took the study of medieval history into fields of cultural history and social history, social psychological history. He was interested in religion but not in an old-fashioned ecclesiastical history, institutional sort of way, but what made people think in this way: how did they conceptualise God? How did they think about religious symbols and rituals in the ways that they did? Why did these things change? That was his agenda. He wrote mostly about late antiquity, the very early period, but he sometimes ventured into the Middle Ages and whenever he did he transformed the scene. The great area he’s famous for doing is the cult of the saints.\"\"Dame Janet Nelson, Interview Transcript,  30 May 2008\" online"]}, {"page": "Æthelwold ætheling", "response": ["After Alfred's death in 899, Æthelwold made a bid for the throne. Janet Nelson comments that \"in the eyes of many Englishmen as well as Scandinavians this ætheling had claims stronger than Edward's own.\" According to the 'A' version of the Anglo-Saxon Chronicle, Æthelwold abducted a nun from her convent without the permission of King Edward and against the command of the bishop. Her identity is not known, but it must have been intended to strengthen his claim, and in the view of the historian Pauline Stafford, the Chronicles account is biased in favour of Edward and might have been intended to delegitimise a politically important marriage. Æthelwold took her to the royal manors of Twynham (now Christchurch) and then Wimborne Minster, symbolically important as his father's burial place, and declared that \"he would live or die there\". Lavelle sees Wimborne as strategically significant, close to Roman roads to Dorchester and Salisbury, and at a crossing point of the rivers Allen and Stour; it was the southernmost point for control of access to western Wessex and Æthelwold may have intended a division of the kingdom."]}, {"page": "Ermentrude of Orléans", "response": ["In August 866, Ermentrude was consecrated, over twenty years after becoming queen. It has been suggested that this reflected her husband's desire for more children.Jane Hyam, 'Ermentrude and Richildis', in Charles the Bald, Court and Kingdom, ed. Margaret Gibson and Janet Nelson (London, 1981), 153. Ermentrude died on 6 October 869. She was buried in the Basilique Saint-Denis, Paris, France."]}, {"page": "Desiderata of the Lombards", "response": ["Desiderata was the second wife of Charlemagne, although there are some questions over the nature of Charlemagne's relationship to Himiltrude, his first wife. Carolingian historian Janet Nelson states that the marriage and resulting alliance with the Lombards was directed against Carloman, leaving Charlemagne's brother encircled as a result. The marriage received opposition from Pope Stephen III, who in the summer of 770 wrote a letter to Charlemagne and Carloman voicing his discontent at the potential union between \"the most notable race of the Franks and that fetid brood of the Lombard's that had brought leprosy into the land.\" There is no mention of this marriage in the Royal Frankish Annals nor the revised version, however, it is mentioned briefly in chapter 18 of Einhard's Life of Charlemagne biography when he states that \"at the urging of his mother he married a daughter of Desiderius.\"", "Although she is commonly referred to by the name Desiderata there is some debate surrounding her name. One school of thought is that the name derives from an editorial error in a 19th-century copy of the Monumenta Germaniae Historica which capitalized the 'D' in desideratam filiam (Latin for 'desired daughter'). Janet Nelson argues that it is far more likely that Desiderata's name is actually 'Gerperga.' Nelson provides multiple reasons as to why this is the case, firstly, the name fits in with the names of Desiderius' other daughters, all of which end in the suffix 'perga.' Secondly, Carloman's wife was called Gerberga, and this, Nelson believes, explains why when Gerberga fled to Desiderius after Carloman's death, the Annals of Lobbes believed that she was fleeing to her father, due to confusion over the similarities of their names. Additionally, in Pope Stephen III's letter to Charlemagne and Carloman, he is not sure of which brother is marrying Gerperga, Nelson argues that this confusion is also caused by the similarity in the names of Desiderius' Daughter and Carloman's wife."]}]}}