{"wiki_id": "http://www.wikidata.org/entity/Q5092760", "itemLabel": "Cheryl Murray", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Cheryl_Murray", "wikipedia_page": {"main": "Cheryl Murray (born Cheryl Frayling-Wright 13 July 1952 in Liverpool, Lancashire) is an English actress, best known for her role as Suzie Birchall on the soap opera Coronation Street, which she played from 1977 to 1979 and again in 1983.\nShe played the eldest daughter of Billie Whitelaw and sister of Smiths fan Lucette Henderson in the video \"Everyday Is Like Sunday\" by Morrissey - which was filmed in and around Southend-on-Sea and Westcliff. She also appeared in the fourth series of David Croft's Hi-de-Hi! as Joan Wainwright and alongside Ronnie Corbett in an episode of Sorry!.\nMurray has been diagnosed with multiple sclerosis and had her first MS attack while working on Coronation Street.", "link_mentions": [{"page": "Hi-de-Hi!", "response": ["*Joan Wainwright (Cheryl Murray) (Series 4) Controller of Yellowcoats – Joan Wainwright was one of Joe Maplin's lovers. She was sports organiser at the Camber Sands camp during the 1958 season, and moved into Joe Maplin's house in Hampstead after beginning an affair with him. He promoted her and sent her to the Crimpton-on-Sea camp to act as an overall controller of Yellowcoats during the 1959 season. She was an arrogant and selfish woman who used her association with Joe Maplin to gain promotion and authority. She immediately clashed with Gladys, whom she believed was bad at her job because of her lack of sports qualifications. She took away Gladys's authority and made Tracey Bentwood chief Yellowcoat and sports organiser, causing Gladys to resign. Gladys was saved by Ted, who knew Wainwright from years before when they performed together at \"The Palace\" at Attercliffe. Her real name was Beryl Green, and she was assistant to a magician called \"The Great Ming\" whom she became pregnant by. Ted threatened to reveal her past to Joe Maplin unless she resigned and left the camp."]}, {"page": "Elsie Tanner", "response": ["After her third failed marriage, Elsie surrounded herself with youngsters and acted as mother figure to Suzie Birchall (Cheryl Murray) and Gail Potter (Helen Worth), who lodged with her during the late 1970s. Elsie saw a lot of herself in young Suzie, who was somewhat gregarious and enjoyed the company of men, but it was Elsie's relationship with Gail that was inevitably the strongest."]}, {"page": "Murray (surname)", "response": ["*Cheryl Murray (born 1952), British actress"]}, {"page": "Gail Platt", "response": ["After the warehouse they work in burns down, Gail and Tricia work in the Corner Shop, but when Renee Bradshaw (Madge Hindle) buys the shop and flat in June 1976, the girls are evicted. Tricia leaves Weatherfield and Elsie Tanner (Pat Phoenix) returns. Elsie ensures that Gail can stay in the flat. Elsie and Gail find work at Sylvia's Separates and move into No 11. She loses her virginity to Roy Thornley but discovers that he is married and Gail is cited in a messy divorce. In December 1976, Sylvia's Separates is taken over by Mike Baldwin (Johnny Briggs) and renamed the Western Front. Elsie is moved from boutique manager to factory supervisor and Gail is promoted to manager with Suzie Birchall (Cheryl Murray), working for her. In early 1977, Suzie joins Elsie and Gail at No 11, and the three women become one of the programme's most popular groups.", "The character of Gail was first portrayed as a teenager who liked to have fun with her best friends, first Tricia, then later Suzie Birchall (Cheryl Murray). However, following her first marriage to mechanic Brian Tilsley (Christopher Quinten) her storylines have seen her constantly suffer many blows and misery. She has had five husbands, three children, and four grandchildren, although her grandson died in infancy. Her storylines have seen her feuding with a domineering mother-in-law, deal with affairs, three divorces, being widowed three times, deal with traumas from each of her children, marry a serial killer who in turn tried to kill her and her family, and even been imprisoned to await a murder trial after being falsely accused of murdering her fourth husband. Throughout each of these ordeals, her personality altered from laid back to a bitter, miserable, whiny and bossy woman, a clone of her former mother-in-law Ivy Tilsley (Lynne Perrie). She has been known to interfere in her children's lives as family is important to her and she didn't come from a stable family background. Her mother gave birth to her at 18 because she thought it would help her get the baby back that she had been forced to give up for adoption two years previously. Gail's father was never told about her and as a result, she was mostly brought up by her grandmother or to fend for herself while her mother went out with a string of men. This caused Gail to become a headstrong, independent young woman.  However, she always swore that her own children would have a proper family life, living with both their parents. However this hasn't worked out and she has been left with repeated failed marriages and being a single mother to her children. In early storylines, Gail appeared to know both her parents and it was suggested they were married. At the time of her affair with Roy Thornley in the episode broadcast on 30 August 1976, she was particularly anxious about what her father would think, stating that he always read the newspaper out loud to her mother over breakfast. However, as the character of Gail became more established and prominent in the series, her background was 'retconned' to introduce her single mother Audrey and to provide a more consistent back story. She interferes in her children's lives, thinking she is helping and knows what's best, causing many arguments in the process and feuding with whoever gets involved with her children, just like her own relationship with Ivy. Particularly after marrying a serial killer and putting her children's lives in danger, Gail's interfering has increased immensely. Actress Helen Worth has stated that she loves Gail's storylines as the many traumas give her great opportunities as an actress."]}, {"page": "Everyday Is Like Sunday", "response": ["The video features clips from the film Carry On Abroad. Billie Whitelaw appears in a supporting role as does Cheryl Murray and Lucette Henderson as a young fan. The seaside town used as the location was Southend-on-Sea."]}, {"page": "List of former Coronation Street characters", "response": ["|Suzie Birchall || Cheryl Murray || 1977–1979, 1983"]}, {"page": "List of Coronation Street characters (1977)", "response": ["Suzanne \"Suzie\" Goodwin (née Birchall) was played by actress Cheryl Murray from January 1977 to December 1979 and then again in 1983. Suzie was a cynical peroxide blonde teenager who was more interested in having fun than being responsible. She made fast friends with Gail Potter and shared a room with her at Elsie Tanner's house. Her first storyline involved her getting her foot stuck through Hilda Ogden's ceiling. Her father Bob was a control freak and he came to take her home. When he tried to take her by force, Steve Fisher intervened, getting a punch in the face before Bob washed his hands of his daughter and drove off alone. She later kept company with a sugar daddy and found fleeting romance, which was her ticket out of the Street. Off-screen, she married Terry Goodwin but the marriage soon soured when it was revealed that Goodwin abused her, leading to her return to Weatherfield in early 1983. She moved back in with Elsie and as soon as she filed for divorce, went back to her old fun-loving ways.  After Suzie tried to seduce Gail's husband, Brian Tilsley, Elsie threw her out and she left the Street again, and this time for good."]}, {"page": "Zigger Zagger", "response": ["The National Youth Theatre's original production of Zigger Zagger opened at the Jeanetta Cochrane Theatre in August 1967 and was broadcast on television by the BBC in the same year.Zigger Zagger (1967), bufvc.ac.uk; accessed 22 March 2018.Zigger Zagger - Christopher Cameron's Archive on the BBC Plays Department: Single Drama 1965 - 1987 The play opened at the Strand Theatre in the West End in March 1968 with a professional cast which included Anthony May, Michael Cashman, Alun Lewis, Peter DenyerPeter Denyer: actor and scriptwriter - The Times, 2 October 2009Obituaries - Peter Denyer: Actor who played the slow but lovable Dennis in 'Please Sir! - The Independent and Esta Charkham but closed after two weeks.Peter Jobin, Beyond Walls: Theatre Passe Muraille 1968 - 1975, The Porcupine's Quill (2018)- Google Books pg. 101 The play received eight revivals and tours over the next 20 yearsZigger Zagger, Zigger Zagger, Oi, Oi, Oi! - Wilton's Music Hall Productions including in 1975 when it was revived at the Shaw Theatre again directed by Michael Croft. A studio production was filmed by BBC Schools and featured Michael Tarn in the title role, Cheryl Murray as Edna while sisters Gillian Taylforth and Kim Taylforth played Sandra and Glennis, and Peter Turner playing Harry.Zigger Zagger (1975) - BBC School Broadcasting - British Film Institute database"]}]}}