{"wiki_id": "http://www.wikidata.org/entity/Q5095984", "itemLabel": "Chichester Bell", "itemDescription": "British chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Chichester_Bell", "wikipedia_page": {"main": "Chichester Alexander Bell (1848–1924) was a chemist, first cousin of Alexander Graham Bell, and instrumental in developing improved versions of the phonograph.", "link_mentions": [{"page": "Bell Labs", "response": ["In 1880, when the French government awarded Alexander Graham Bell the Volta Prize of 50,000 francs (approximately US$10,000 at that time; about $ in January 2019's dollars) for the invention of the telephone, he used the award to fund the Volta Laboratory (Alexander Graham Bell Laboratory) in Washington, D.C. in collaboration with Sumner Tainter and Bell's cousin Chichester Bell.Bruce, Robert V. Bell: Alexander Bell and the Conquest of Solitude. Ithaca, New York: Cornell University Press, 1990. . The laboratory was variously known as the Volta Bureau, the Bell Carriage House, the Bell Laboratory and the Volta Laboratory."]}, {"page": "Phonograph", "response": ["Edison's patent specified that the audio recording be embossed, and it was not until 1886 that vertically modulated incised recording using wax-coated cylinders was patented by Chichester Bell and Charles Sumner Tainter. They named their version the Graphophone.", "One interesting exception was a horizontal seven inch turntable. The machine, although made in 1886, was a duplicate of one made earlier but taken to Europe by Chichester Bell. Tainter was granted  on July 10, 1888. The playing arm is rigid, except for a pivoted vertical motion of 90 degrees to allow removal of the record or a return to starting position. While recording or playing, the record not only rotated, but moved laterally under the stylus, which thus described a spiral, recording 150 grooves to the inch."]}, {"page": "Thomas Edison", "response": ["His first phonograph recorded on tinfoil around a grooved cylinder. Despite its limited sound quality and that the recordings could be played only a few times, the phonograph made Edison a celebrity. Joseph Henry, president of the National Academy of Sciences and one of the most renowned electrical scientists in the US, described Edison as \"the most ingenious inventor in this country... or in any other\".Edison, Thomas A. 1989. Menlo Park: The early years, April 1876 – December 1877. Edited by P. B. Israel, K. A. Nier and L. Carlat. Vol. 3, The papers of Thomas A Edison. Baltimore: Johns Hopkins University Press. Doc. 1117 In April 1878, Edison traveled to Washington to demonstrate the phonograph before the National Academy of Sciences, Congressmen, Senators and US President Hayes.Baldwin, Neil. 2001. Edison: Inventing the century. Chicago: University of Chicago Press. pp. 97–98 The Washington Post described Edison as a \"genius\" and his presentation as \"a scene... that will live in history\".Washington Post. 1878. Genius before science. The Washington Post, April 19. Although Edison obtained a patent for the phonograph in 1878,Edison, Thomas A. 1877. Telephones or speaking-telegraphs. US patent 203,018 filed December 13, 1877, and issued April 30, 1878. he did little to develop it until Alexander Graham Bell, Chichester Bell, and Charles Tainter produced a phonograph-like device in the 1880s that used wax-coated cardboard cylinders."]}, {"page": "Optical disc", "response": ["The first recorded historical use of an optical disc was in 1884 when Alexander Graham Bell, Chichester Bell and Charles Sumner Tainter recorded sound on a glass disc using a beam of light."]}, {"page": "Phonograph cylinder", "response": ["Following seven years of research and experimentation at their Volta Laboratory, Charles Sumner Tainter, Alexander Graham Bell, and Chichester Bell introduced wax as the recording medium and engraving, rather than indenting, as the recording method. In 1887, their \"Graphophone\" system was being put to the test of practical use by official reporters of the US Congress, with commercial units later being produced by the Dictaphone Corporation. After this system was demonstrated to Edison's representatives, Edison quickly resumed work on the phonograph. He settled on a thicker all-wax cylinder, the surface of which could be repeatedly shaved down for reuse. Both the Graphophone and Edison's \"Perfected Phonograph\" were commercialized in 1888. Eventually, a patent-sharing agreement was signed and the wax-coated cardboard tubes were abandoned in favor of Edison's all-wax cylinders as an interchangeable standard format.Schoenherr, S. (1999) \"Charles Sumner Tainter and the Graphophone\" (via the Audio Engineering Society). Retrieved 2014-05-04."]}, {"page": "Charles Sumner Tainter", "response": ["Charles Sumner Tainter (April 25, 1854 – April 20, 1940) was an American scientific instrument maker, engineer and inventor, best known for his collaborations with Alexander Graham Bell, Chichester Bell, Alexander's father-in-law Gardiner Hubbard, and for his significant improvements to Thomas Edison's phonograph, resulting in the Graphophone, one version of which was the first Dictaphone.", "*  Reproducing Sounds from Phonograph Records (without using a stylus), filed November 1885, issued May 1886 (with Alexander and Chichester Bell)", "*  Transmitting And Recording Sounds By Radiant Energy, filed November 1885, issued May 1886 (with Alexander and Chichester Bell)", "*  Recording and Reproducing Speech and Other Sounds (improvements include compliant cutting head, wax surface, and constant linear velocity disk), filed June 1885, issued May 1886 (with Chichester Bell)"]}, {"page": "Constant linear velocity", "response": ["In optical storage, constant linear velocity (CLV) is a qualifier for the rated speed of an optical disc drive, and may also be applied to the writing speed of recordable discs. CLV implies that the angular velocity (i.e. rpm) varies during an operation, as contrasted with CAV modes. The concept of constant linear velocity was patented in 1886 by phonograph pioneers Chichester Bell and Charles Tainter."]}, {"page": "Graphophone", "response": ["It took five years of research under the directorship of Benjamin Hulme, Harvey Christmas, Charles Sumner Tainter and Chichester Bell at the Volta Laboratory to develop and distinguish their machine from Thomas Edison's Phonograph."]}, {"page": "Chichester A. Bell", "response": ["#REDIRECT Chichester Bell"]}, {"page": "Chichester (disambiguation)", "response": ["* Chichester Bell (1848–1924), chemist, cousin to Alexander Graham Bell, and instrumental in developing improved versions of the phonograph"]}, {"page": "Volta Laboratory and Bureau", "response": ["The Volta Laboratory was founded in 1880–1881 with Charles Sumner Tainter and Bell's cousin, Chichester Bell, for the research and development of telecommunication, phonograph and other technologies.", "The Volta Laboratory Association, or Volta Associates, was created by formal legal agreement on October 8, 1881 (backdated to May 1 of the same year), constituting the Volta Laboratory Association to be the owner of its patents. It was dissolved in 1886 when its sound recording intellectual property assets were transferred into the Volta Graphophone Company. The association was composed of Alexander Graham Bell, Charles Sumner Tainter and Bell's cousin, renowned British chemist Dr. Chichester Bell.", "Shortly after the creation of the Bell Telephone Company, Bell took his bride, Mabel Hubbard, to Europe for an extended honeymoon. At that time he asked Tainter to move from Cambridge to Washington to start up the new laboratory. Bell's cousin, Chichester Bell, who had been teaching college chemistry in London, also agreed to come to Washington as the third associate. The establishment of the laboratory was comparatively simple; according to Tainter's autobiography:", "One interesting exception was a horizontal seven inch turntable. Although made in 1886, the machine was a duplicate of one made earlier but taken to Europe by Chichester Bell. Tainter was granted Patent No. 385886 for it on July 10, 1888. The playing arm is rigid except for a pivoted vertical motion of 90 degrees to allow removal of the record or a return to starting position. While recording or playing, the record not only rotated but moved laterally under the stylus which thus described a spiral, recording 150 grooves to the inch."]}]}}