{"wiki_id": "http://www.wikidata.org/entity/Q5096101", "itemLabel": "Chick Cray", "itemDescription": "English cricketer (1921-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chick_Cray", "wikipedia_page": {"main": "Stanley James Cray (29 May 1921 – 10 October 2008) was an English cricketer. Cray was a right-handed batsman and known to fellow players as Chick. He was born in Stratford, Essex.\nCray made his first-class debut for Essex against Worcestershire in the 1938 County Championship. He became a regular in the Essex team in 1939, but the start of the Second World War abruptly ended his first-class career with Essex in its tracks. Serving in the war, Cray served in the British Raj, while stationed there he played two first-class matches for a Services XI against an Indian XI and a Bengal Governor's XI, both in 1944. Following the war, Cray returned to Essex, where he played first-class cricket once more from 1946 to 1950. As well as his appearances for Essex and a Services XI, he also played a single first-class match for a combined Essex and Middlesex team against a combined Surrey and Kent team in 1947. Cray was a member of the Essex team which tied with Northamptonshire in 1947, a match in which he scored a century in the Essex first-innings.In total he made 99 first-class appearances for the county, scoring 4,062 runs at a batting average of 24.46, with sixteen half centuries, seven centuries and a high score of 163. His highest first-class score came against Nottinghamshire in 1950. Cray passed 1,000 runs for a season twice, in 1947 and 1949. Following the 1950 season, Cray coached in South Africa when out of the blue he received a phonecall informing him his services were no longer required by Essex.Following his release he played Minor Counties Championship cricket for Devon on two occasions, firstly in 1954 against the Surrey Second XI and secondly against Oxfordshire in 1957. While in Devon he was the professional at Paignton Cricket Club. He retired fully from playing and coaching in 1961, following problems with a hand injury he had sustained in a car accident. He had a number of jobs outside of cricket, including as a postman and a kitchen assistant.One of the few cricketers to have played first-class cricket before the war, Cray died in Torquay, Devon on 10 October 2008.\n\n", "link_mentions": {}}}