{"wiki_id": "http://www.wikidata.org/entity/Q5105923", "itemLabel": "Chris Bolt", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Bolt", "wikipedia_page": {"main": "Christopher Bolt CB is a British economist and, formerly non-executive chairman of the Office of Rail Regulation, the national economic and safety regulatory authority for Britain's railways, and (separately) the arbiter for the London Underground public-private partnership.", "link_mentions": [{"page": "Railtrack", "response": ["Railtrack was severely criticised for both its performance in improving the railway infrastructure and for its safety record. Between its creation and late 1998, the company had a relatively calm relationship with its first economic regulator, John Swift QC, whose strategy was to encourage Railtrack to make commitments to improvement.Railtrack to give further commitments  Office of Rail Regulation, 16 July 1998 But critics said that the regulator was not tough enough and that the company had, as a result, been able to abuse its monopoly position. In particular, its customers, the passenger and freight train operators, were desperate for regulatory action to force the company to improve its stewardship of the network and its performance. Swift had been appointed rail regulator in 1993 by the then Conservative transport secretary John MacGregor MP. When the Labour government took over after the general election in May 1997, the new transport secretary (and deputy prime minister) John Prescott took a much harder line. When Swift's five-year term of office expired on 30 November 1998, he was not reappointed.Rail Regulator to go BBC News, 21 September 1998 After an interim holding period, during which Chris Bolt, Swift's chief economic adviser and effective deputy, filled the regulator's position, in July 1999 a new rail regulator began a five-year term, and a new, much tougher regulatory era began.City lawyer will be the new rail regulator The Independent, 24 March 1999"]}, {"page": "Tom Winsor", "response": ["In July 1999, John Prescott MP, Secretary of State for the Environment, Transport and the Regions and Deputy Prime Minister, appointed Winsor as Chris Bolt's successor as Rail Regulator and International Rail Regulator."]}, {"page": "Rail Regulator", "response": ["Because Nolan rules on the making of public appointments take months, Prescott appointed Chris Bolt, Swift's chief economic adviser, as regulator on an interim basis from 1 December 1998 on a seven-month contract, to allow him to go through the process for a full-term appointment."]}, {"page": "John Swift (barrister)", "response": ["Upon the change of British government on 2 May 1997, Swift's chances of being reappointed as Rail Regulator diminished, and when Deputy Prime Minister John Prescott MP announced at the September 1998 Labour Party conference that he intended to carry out a 'spring clean of the regulators', Swift knew his days were numbered.  He was succeeded as Rail Regulator by Chris Bolt (December 1998 - July 1999) and then by Tom Winsor (July 1999 - July 2004)."]}, {"page": "Bolt (surname)", "response": ["*Chris Bolt (b. 1953), British economist"]}, {"page": "Anna Walker (civil servant)", "response": ["Walker succeeded Chris Bolt as chair of the Office of Rail Regulation on 5 July 2009 when Bolt's five-year term of office expired. In this role, Walker was the IRG-Rail Chair for 2013; the members of IRG-Rail consist of the independent Regulatory Bodies of twenty-one countries inside and outside the European Union. She stepped down from this role in 2015 and was replaced by Stephen Glaister."]}, {"page": "Christopher Bolt", "response": ["#REDIRECT Chris Bolt"]}]}}