{"wiki_id": "http://www.wikidata.org/entity/Q5106119", "itemLabel": "Chris Cattlin", "itemDescription": "English footballer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Cattlin", "wikipedia_page": {"main": "Christopher John Cattlin (born 25 June 1946 in Milnrow, Lancashire) is a former professional footballer who played as a defender for Huddersfield Town, Coventry City and Brighton & Hove Albion.He became manager of Brighton & Hove Albion on 1 October 1983, and left that position on 30 April 1986, and now runs a rock shop in the city. He also co-owns a racehorse, Ajigolo, with former Southampton and England forward Mick Channon.", "link_mentions": [{"page": "Brighton & Hove Albion F.C.", "response": ["*  Chris Cattlin 1983–1986"]}, {"page": "Mick Channon", "response": ["Among owners who have had their horses with Channon are old colleagues and acquaintances from his footballing days, including Kevin Keegan, Alan Ball, Chris Cattlin and Sir Alex Ferguson."]}, {"page": "Jimmy Melia", "response": ["He went on to manage Brighton & Hove Albion during the 1982–83 season - being promoted from his former role as Albion's chief scout - where his greatest managerial feat occurred when he took them to the 1983 FA Cup Final. The run took Melia back to his old stomping ground of Anfield where a goal from another ex-Liverpool player Jimmy Case won the game. During the cup run Melia became famous for his 'disco' style of dress and his glamorous younger girlfriend, Val Lloyd. Brighton drew the final, and then lost the replay, to Manchester United and were also relegated from the first division. Melia, who had only been appointed as an interim manager, resigned his post on 19 October 1983, reportedly due to his disdain at backroom meddling by first-team coach Chris Cattlin."]}, {"page": "1967–68 Huddersfield Town A.F.C. season", "response": ["|Chris Cattlin||||DF||23||0||1||0||7||1||31||1"]}, {"page": "1966–67 Huddersfield Town A.F.C. season", "response": ["|Chris Cattlin||||DF||35 (1)||1||1||0||0||0||36 (1)||1"]}, {"page": "1965–66 Huddersfield Town A.F.C. season", "response": ["|Chris Cattlin||||DF||0 (1)||0||0||0||0||0||0 (1)||0"]}, {"page": "1964–65 Huddersfield Town A.F.C. season", "response": ["|Chris Cattlin||||DF||1||0||0||0||0||0||1||0"]}, {"page": "History of Brighton & Hove Albion F.C.", "response": ["Brighton's first Second Division campaign for four years began with a three straight defeats, but then things perked up with a run of five games unbeaten, including an amazing 7–0 victory over Charlton. However, another run of three defeats was enough to cost Melia his job, with former player Chris Cattlin stepping up to replace him and steering Brighton to mid-table safety. 1984–85 saw Brighton nearly return to the top flight, missing out on promotion by only two points. However, the following season saw Brighton slump to 11th place which, along with purported complaints from the players about Cattlin's management style, caused the board to axe him in favour of returning hero Alan Mullery. However, Mullery resigned at the start of 1987 due to a combination of indifferent form and unhappiness over the club's financial situation, and after his resignation Brighton would only win two more games all season, resulting in them being relegated again – this time to the Third Division."]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Chris Cattlin||||1964–1968||59 (2)||1||2||0||7||1||0||0||0||0||68 (2)||2"]}, {"page": "Christopher John \"Chris\" Cattlin", "response": ["#REDIRECT Chris Cattlin"]}, {"page": "Christopher John Cattlin", "response": ["#REDIRECT Chris Cattlin"]}, {"page": "Harry Wilson (footballer, born 1953)", "response": ["Wilson went straight into the starting eleven, and after two games, John Vinicombe of the Evening Argus was impressed: he \"is looking something of a fire-eater. He has a rare zest for the game and relishes the close, physical contact that is synonymous with his position. He knows how to destroy and create, and does both in a manner befitting a five-year background at the academy of fine footballing arts.\"Vinicombe, John (December 1973). Evening Argus. Brighton, quoted in  He kept his place for two-and-a-half seasons before being dislodged by Chris Cattlin, but still made 17 appearances for the 1976–77 Third Division promotion squad, taking his totals to 146 appearances in all competitions."]}]}}