{"wiki_id": "http://www.wikidata.org/entity/Q5105986", "itemLabel": "Chris Brooker", "itemDescription": "English rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Brooker", "wikipedia_page": {"main": "Chris Brooker (born 31 May 1986) is an English rugby union player, currently playing for Bristol in the RFU Premiership.\nBrooker's position of choice is as a hooker. He can also operate as a prop.\nHe has previously played for Bath Rugby.\nOn 11 January 2012, Chris Brooker was included in the England Saxons squad for the first time as reward for a fine season with Harlequins in the Aviva Premiership and Heineken Cup. Also included in the EPS squad, before suffering an injury which sidelined him for over 19 months. Was put in the same bracket as Joe Launchbury by Stuart Lancaster as a potential star of the future but was never present again due to his injury.\nIn May 2013, it was announced that from the beginning of the 2013/14 season that Brooker would play for Worcester Warriors after signing a long term deal that would see him leave Harlequins. After appearing over 94 times for the club.\nBrooker left Worcester over the summer of 2014 to join his hometown club, Bristol in their quest for promotion.", "link_mentions": [{"page": "Brooker (surname)", "response": ["*Chris Brooker (born 1986), English rugby union player"]}, {"page": "Diego Zarzosa", "response": ["In 2007, Zarzosa signed a six-months contract with English giants Harlequins after Samoan Tani Fuga was called to the World Cup squad and Chris Brooker suffered a shoulder injury. He was not able to debut in the Premiership. Later that year, he became the second Spanish-born rugby player to play for the Barbarians."]}, {"page": "Cleve RFC", "response": ["* Chris Brooker – Bristol"]}, {"page": "List of 2013–14 Premiership Rugby transfers", "response": ["* Chris Brooker to  Worcester Warriors ", "* Chris Brooker from  Harlequins "]}, {"page": "2014–15 RFU Championship", "response": ["|HK ||2 || Chris Brooker || ", "|HK ||2 || Chris Brooker || "]}, {"page": "List of 2014–15 RFU Championship transfers", "response": ["* Chris Brooker from  Worcester Warriors", "* Chris Brooker to  Bristol Rugby"]}, {"page": "List of 2017–18 RFU Championship transfers", "response": ["* Chris Brooker released"]}]}}