{"wiki_id": "http://www.wikidata.org/entity/Q5106578", "itemLabel": "Chris Foster", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Foster_(folk_singer)", "wikipedia_page": {"main": "Chris Foster (born 23 April 1948), is an English singer and guitarist known for his interpretations of traditional and contemporary songs.He was born in Yeovil, Somerset, England. It is there that he first heard and started singing traditional songs.  He trained as an artist at the Norwich, and Chelsea Schools of Art. His professional \"break\" came in the early 1970s when a music agent spotted him singing at Dingles Folk Club in London. This led to eight years as a professional solo folk singer/guitarist.\nHe recorded two, highly regarded albums in the late 1970s: Layers (1977) and All Things in Common (1979). Both featured mainly traditional songs with often complex fingerstyle accompaniments (some in open tunings) on a Fylde acoustic guitar.\nHe stopped full-time touring in the 1980s, to work on various arts-based projects and settled in Salisbury, where he co-founded Mobile Arts, a mixed media community arts company. Since September 1999 he has been the Co-ordinator of the Baring-Gould Heritage Project. He is a founding member and director of the annual Vaka Folk Arts Festival in Iceland, where he currently resides. He has continued to produce solo albums, tour (both in the UK and abroad), and collaborate with other artists, including his current partner, the Icelandic folk singer and composer Bára Grímsdóttir, as Funi.", "link_mentions": [{"page": "Bill Caddick", "response": ["His songs, such as John O'Dreams, \"Unicorns\" and \"She Moves Among Men\", have been recorded by numerous other musicians including June Tabor, Chris Foster, Alex Campbell, Christy Moore, Priscilla Herdman, Dan Evans, Peter Rowan, John Kirkpatrick, Artisan, Coope Boyes and Simpson and The Yetties."]}, {"page": "Sandra Kerr", "response": ["*'Nuclear Power No Thanks' with Frankie Armstrong, Roy Bailey, Martin Carthy, Ron Elliott, Howard Evans, Chris Foster, John Kirkpatrick, Alison McMorland, Brian Pearson, Geoff Pearson, Leon Rosselson & Roger Williams (Plane Label IMP2 LP, 1981)"]}, {"page": "Jim Causley", "response": ["* Chris Foster (folk singer) - Hadelin - 2017"]}, {"page": "List of Peel sessions", "response": ["* Chris Foster: (1 session, 1977)"]}, {"page": "Langspil", "response": ["By the 1960s, the singer Anna Þórhallsdóttir realized that the langspil was slowly disappearing from Icelandic musical traditions and as a response she spearheaded its revival, which is still ongoing.Anna Þórhallsdóttir, \"Langspil\". Tíminn. 19. August. 1961. p.11. Today a number of bands and performers include the langspil in their repertoire, including Spilmenn Ríkinís, Sigurður Rúnar Jónsson, Bára Grímsdóttir, Chris Foster and Þórður Tómasson á Skógum. The langspil also has an important place on the yearly folk-song festival on Siglufjörður. "]}, {"page": "Cris Cheek", "response": ["Cheek lived in Hackney and Canning Town between 1981 and 1994. Whilst working for dance and performance artists and improvising music groups, he began writing songs with Sianed Jones, performing and recording with Philip Jeck as Slant. Slant released three albums. Jones and Cheek later moved to Lowestoft. He was an active member of poetics e-list communities for the following twenty years. During this time, he taught performance writing at Dartington College of Arts, working alongside Caroline Bergvall as well as many others. cheek also made contemporary vaudeville shows with folk musician Chris Foster that toured to village halls and community centers around England."]}, {"page": "Chris Foster", "response": ["Chris Foster may refer to:", "*Chris Foster (soccer), American soccer player", "*Chris Foster (folk singer) (born 1948), English folk singer and guitarist"]}, {"page": "Folk music festival of Siglufjordur", "response": ["Among artists that have given concerts at the Folk Music Festival in Siglufjord are Steindór Andersen, Sigur Rós, Bára Grímsdóttir and Chris Foster, Ensemble Unicorn, Astri Skarpengland, Jerry Rockwell,  Susanne Lundeng, Tómas R. Einarsson, Björn Thoroddsen, Eddie Walker, Minna Raskinen, Spilmenn Ríkinis, Marit Steinsrud and Stein Villa, Sturm und Drang, Voces Thules, Maria and Olof Misgeld, Tranotra amongst many others."]}]}}