{"wiki_id": "http://www.wikidata.org/entity/Q5106145", "itemLabel": "Chris Chester", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Chester_(rugby_league)", "wikipedia_page": {"main": "Chris Chester (born 8 October 1978) is an English professional rugby league coach who is the former head coach of Wakefield Trinity in the Betfred Super League and Scotland at international level, and a former professional rugby league footballer.\nAs a player, Chester played in the forwards for the Halifax, Wigan Warriors, Hull F.C. (with whom he won the 2005 Challenge Cup) and Hull Kingston Rovers in the Super League.He was the head coach of Hull Kingston Rovers in the Super League, however his resignation was announced in February/March 2016. \nOn 10 August 2021, A statement from Wakefield Trinity said that they had parted ways with Head Coach Chris Chester, with Willie Poaching talking over as interim coach.", "link_mentions": [{"page": "Hull Kingston Rovers", "response": ["Despite making several big name signings for the 2014 season, Rovers failed to make any kind of impact in the league and with 8 games remaining they parted company with Sandercock, appointing assistant coach and ex-player Chris Chester as the new First Team Coach of Hull KR. Chester could not steer the club to a playoff spot in his first 8 games in charge and they finished the season in 9th position.", "* Chris Chester", "* Chris Chester 2014–2016"]}, {"page": "Scotland national rugby league team", "response": ["| John Duffy  Chris Chester"]}, {"page": "Wakefield Trinity", "response": ["Chris Chester was appointed head coach 16 March 2016 and revitalised the squad. Compared to the previous season when the team were fighting for survival, Chester guided them to a top 8 finish and a place in the Challenge Cup semi final.", "In the 2021 Super League season, Wakefield Trinity finished 10th in the competition. Towards the end of the season, the club terminated head coach Chris Chester. Wakefield later appointed Willie Poching as the new head coach.", "|align=center| Chris Chester"]}, {"page": "2005 Challenge Cup", "response": ["* 17. Chris Chester"]}, {"page": "Richard Pell", "response": ["Richard Pell (17 October 1966) is an English former professional rugby league footballer who played in the 1980s and 1990s, and coached in the 2000s and 2010s. He played at club level for Wakefield Trinity (Heritage № 953), Doncaster (two spells), and Hunslet, as a , i.e. number 8 or 10, and coached at club level for Lock Lane ARLFC (in Castleford), Castleford Tigers (Under-18s, and Assistant Reserve Grade Coach under Chris Chester), Wakefield Trinity (Under-18s), and Gateshead Thunder, he was a Commercial Manager at The Coca-Cola Company, Head of Talent Identification at Huddersfield Giants, Director of Rugby at Castleford RUFC, and since 2013 is the General Manager at Castleford Tigers."]}, {"page": "James Webster (rugby league)", "response": ["In March 2016, Webster was named Interim Coach of Hull Kingston Rovers replacing the sacked Chris Chester."]}, {"page": "2000 Super League Grand Final", "response": ["|| Chris Chester"]}, {"page": "2001 Super League Grand Final", "response": ["|| Chris Chester"]}, {"page": "Chris Chester (rugby league player)", "response": ["#REDIRECT Chris Chester (rugby league)"]}, {"page": "Stanley Rangers", "response": ["*Chris Chester: Halifax, Wigan Warriors, Hull FC, Hull Kingston Rovers"]}, {"page": "2009 Hull Kingston Rovers season", "response": ["| Chris Chester"]}, {"page": "2010 Hull Kingston Rovers season", "response": ["|Chris Chester"]}, {"page": "Chris Chester", "response": ["Chris Chester may refer to:", "*Chris Chester (American football) (born 1983), American football player", "*Chris Chester (rugby league) (born 1978), English rugby league footballer"]}]}}