{"wiki_id": "http://www.wikidata.org/entity/Q5107249", "itemLabel": "Chris Lines", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Lines", "wikipedia_page": {"main": "Christopher John Lines (born 30 November 1985) is an English professional footballer who plays as a midfielder for EFL League Two club Stevenage.\nLines turned professional at Bristol Rovers, and made his first team debut in January 2006. He played in the 2007 Football League Trophy final defeat and was an unused substitute in the League Two play-off final victory, before becoming a first team regular from the 2007–08 season. He was sold on to Sheffield Wednesday for £50,000 in August 2011, and was a key first team player as the \"Owls\" won promotion to the Championship at the end of the 2011–12 campaign. However, he lost his first team place the following season, and was loaned out to Milton Keynes Dons in January 2013.\nHe signed with Port Vale in July 2013. A key first team player in the 2013–14 season, he lost his first team place and returned to Bristol Rovers on loan in March 2015, helping Rovers to win promotion out of the Conference Premier via the play-offs before rejoining Rovers on a permanent basis in the summer. He helped Rovers to achieve a second successive promotion in the 2015–16 campaign and left the club, in May 2019, for the second time then he joined Northampton Town. He helped Northampton to win promotion out of League Two via the play-offs in 2020 and then moved on to Stevenage in January 2021.", "link_mentions": [{"page": "Bristol Rovers F.C.", "response": ["In the past, rivalries also emerged with Severnside rivals Cardiff City known as the Severnside derby. Rovers most recent meeting against Cardiff was a League Cup match on 11 August 2016, which Rovers won 1–0 with Chris Lines scoring the winner. The last time Cardiff and Bristol Rovers were in the same league was in the 1999–2000 season.", "The Bristol Rovers Academy currently operates at The City Academy Bristol and Sir Bernard Lovell School. Current first-team squad members Cameron Hargreaves, Alfie Kilgour and Luca Hoole both graduated from the Academy to earn professional contracts. In May 2021, U16s player Kyrie Pierre joined Aston Villa for an undisclosed six-figure fee, a record fee received by the Academy for a player.  Perhaps the most successful former member of the academy is Scott Sinclair, who was signed by Chelsea in 2005 for £200,000, with further payments to the club possible, depending on performance. He currently plays for Championship club Preston North End. Other former Academy players currently contracted to teams in the Premier League or English Football League include Ryan Broom (Plymouth Argyle), Ellis Harrison (Fleetwood Town), Chris Lines (Stevenage), Tom Lockyer (Luton Town), Matt Macey (Hibernian) and Ollie Clarke (Mansfield Town)."]}, {"page": "Micky Adams", "response": ["In preparation for League One football, Adams signed winger Kaid Mohamed to replace the departing Ashley Vincent. He also signed defenders Chris Robertson and Carl Dickinson, midfielders Chris Lines and Anthony Griffith, and forward Gavin Tomlin. On 22 September, Rob Page was put in temporary charge of first team affairs at Vale Park after Adams took the decision to take time off work to have hip replacement surgery. The club overstretched itself financially, meaning that as they lay outside the play-offs in January Adams could only sign largely untried youngsters on loan whilst releasing higher paid players either on free transfers or on loan. Their promotion push fell away but they ended the season in ninth place – far exceeding their original aim of avoiding relegation. During this time he had to deal with issues such as sacking defender Daniel Jones for physically attacking captain Doug Loft during training, and had to deal with months of speculation over his own future after chairman Norman Smurthwaite took until May before offering him a new one-year rolling contract. He signed the contract the following month."]}, {"page": "South Gloucestershire and Stroud College", "response": ["* Chris Lines, English footballer who plays for Bristol Rovers"]}, {"page": "David Edwards (footballer, born 1986)", "response": ["Edwards re-signed for League One club Shrewsbury Town on 7 January 2019 on a two-and-a-half-year contract. Four days later he made his second debut in a 3–0 home loss to Charlton Athletic, replacing Oliver Norburn for the final 12 minutes. In his next game on 9 February, he was shown a straight red card for a foul on Chris Lines in a 1–1 draw at Bristol Rovers. Shrewsbury unsuccessfully appealed the dismissal. His season ended in April after six games with an ankle injury in training, and manager Sam Ricketts said that Edwards would improve following a pre-season."]}, {"page": "Jon Otsemobor", "response": ["In the 2011–12 season, Otsemobor appeared in the first four matches before suffering an injury. Otsemobor made his first team return from injury on 31 December 2011, where he set up a goal for Ben Marshall in the 42nd minute, in a 2–0 win over Preston, followed up setting up another goal in the next goal for Chris Lines, in a 2–1 win over Tranmere Rovers. Otsemobor suffered an injury that kept him out for the 2011–12 season. Otsemobor ended his second season at Sheffield Wednesday, with eleven appearances."]}, {"page": "Orchard School Bristol", "response": ["* Chris Lines – professional footballer"]}, {"page": "2007–08 Bristol Rovers F.C. season", "response": ["|align=\"left\"|Chris Lines||2||0||2", "|align=\"left\"|Chris Lines||0||1"]}, {"page": "Anthony Griffith (footballer)", "response": ["He returned to Port Vale on loan in March 2013 until the end of the 2012–13 season. After a slow start, he soon returned to top form and won plaudits and 'man of the match' awards for his performances. He made ten appearances during his loan spell, helping the club to win promotion into League One with a third-place finish in League Two. He re-joined Port Vale on a permanent basis in July 2013, signing a one-year contract. He went on to build an impressive partnership in midfield with Chris Lines in the 2013–14 season; Griffith providing the tough-tackling and Lines providing the creative playmaking. Despite making 45 appearances across the season he was not offered a new contract in the summer. In summer 2014 Griffith had a trial with League Two club Mansfield Town. He later returned to Vale Park to train, with coach Mark Grew saying \"The manager is always ready to help someone like Griff who has been such a good servant to the club.\" He was voted onto Port Vale's team of the 2010s by readers of The Sentinel, alongside Doug Loft, in February 2020."]}, {"page": "2008–09 Oldham Athletic A.F.C. season", "response": ["The Latics began the month of October in first place, where they had remained for most of the season. Oldham played a Friday night match versus local rival Stockport County, who sat in 7th place at the time. Oldham controlled the first half of the match, as an Andy Liddell goal in the 24th minute gave them a 1–0 halftime lead. However, Stockport dominated the second half, scoring three goals en route to giving Oldham their first defeat of the season. An 82nd-minute goal from Stockport defender Michael Raynes secured the victory, as the Hatters defeated Oldham 3–1. After dropping to third place, Oldham looked to regain the top spot in the league versus Hereford United. Lee Hughes got the action started quickly, scoring his fourth goal in the fifth minute of the game. Oldham continued their early pressure against the Hereford defence, which included Hughes earning Oldham a penalty kick after he was taken down in the area by Frenchman Bruno Ngotty—with Andy Liddell converting on the penalty to give Oldham a 2–0 advantage. Wolves loaned defender Daniel Jones netted in the 36th minute for the Latics, giving the home side a 3–0 lead at the halftime break. Stephen O'Leary picked up a yellow card in the 81st minute for taking down Jones with a bad challenge, and was sent off only a minute later, forcing Hereford to play out the final minutes with only ten men. Danny Whitaker took advantage of the sending off, netting the final goal in the 90th. Oldham played their third game of the month on 18 October against Leicester. A lackluster first half of action led to scoreless action until the 54th minute, when a Steve Howard header gave the visitors a 1–0 lead. Danny Whitaker equalised a quarter-hour later, earning a 1–1 draw as Oldham maintained an unbeaten home record. Three days later, Oldham traveled to Memorial Stadium to face Bristol Rovers. A solid attack was stifled by Rovers goalkeeper Steve Phillips, who stopped all seven shots that were on target. Rickie Lambert netted his 11th goal of the season in the 16th minute, which led the way to a Chris Lines goal in the 35th minute. Phillips and Oldham's Mark Crossley both kept out the opposition for the remainder of the match, as Oldham dropped their second consecutive away match. For their second straight away match, Oldham faced Swindon Town who sat in 18th place in League One. Oldham looked to be in control in the first 20 minutes of the match, putting pressure on Swindon's net without any success. Shortly after their barrage on the goal, defender Sean Morrison scored for Swindon. A handball in the penalty area by Lee Hughes gave Swindon the opportunity to net another in the 34th minute, which was converted by Jack Smith to double Swindon's lead. The ball was bogged down in midfielder for second half, as neither side put pressure on goal—letting Swindon wrap up their third home victory of the season. A Lewis Alessandra assured that Oldham would end October on a high note, as the striker scored his first hat trick in a 3–0 victory over Scunthorpe United. The 19-year-old led Oldham struck first in the 26th, before quickly earning his hat trick in the second half with goals in the 50th and 60th minutes. Oldham's 3–0 win over the Iron was Scunthorpe's first loss since 16 October, and helped the Latics move to 4th place in the league to end October."]}, {"page": "2008–09 Bristol Rovers F.C. season", "response": ["|align=\"left\"|Chris Lines||4||0||4", "|Chris Lines||1||3"]}, {"page": "2007 Football League Trophy Final", "response": ["|MF || 22 || Chris Lines || || "]}, {"page": "2007 Football League Two play-off Final", "response": ["|MF ||22 ||Chris Lines"]}, {"page": "2010–11 Bristol Rovers F.C. season", "response": ["|align=\"left\"|4||align=\"left\"|MF||align=\"left\"| Chris Lines"]}]}}