{"wiki_id": "http://www.wikidata.org/entity/Q5107532", "itemLabel": "Chris Mullin", "itemDescription": "British Labour politician and diarist (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Mullin_(politician)", "wikipedia_page": {"main": "Christopher John Mullin (born 12 December 1947) is a British journalist, author and Labour politician.\nAs a journalist in the 1980s, Chris Mullin led a campaign that resulted in the release of the Birmingham Six, victims of a miscarriage of justice. Mullin is the author of four novels, including A Very British Coup (1982), which was later adapted for television, and its sequel The Friends of Harry Perkins. Mullin is also a celebrated diarist.\nMullin was the Member of Parliament (MP) for Sunderland South from 1987 until 2010. In Parliament, he served as Chairman of the Home Affairs Select Committee and as a Minister in the Department for Environment, Transport and the Regions, the Foreign and Commonwealth Office and in the Department for International Development.", "link_mentions": [{"page": "December 12", "response": ["*1947 – Chris Mullin, English journalist and politician"]}, {"page": "Somaliland", "response": ["According to Abou Jeng and other scholars, the Barre regime rule was marked by a targeted brutal persecution of the Isaaq clan. Mohamed Haji Ingiriis and Chris Mullin state that the clampdown by the Barre regime against the Hargeisa-based Somali National Movement targeted the Isaaq clan, to which most members of the SNM belonged. They refer to the clampdown as the Isaaq Genocide or Hargeisa Holocaust. A United Nations investigation concluded that the crime of genocide was \"conceived, planned and perpetrated by the Somali Government against the Isaaq people\". The number of civilian casualties is estimated to be between 50,000 and 100,000 according to various sources, while some reports estimate the total civilian deaths to be upwards of 200,000 Isaaq civilians. Along with the deaths, Barre regime bombarded and razed the second and third largest cities in Somalia, Hargeisa and Burao respectively. This displaced an estimated 400,000 local residents to Hart Sheik in Ethiopia; another 400,000 individuals were also internally displaced."]}, {"page": "Harold Wilson", "response": ["In March 1987, James Miller, a former agent, claimed that the Ulster Workers Council Strike of 1974 had been promoted by MI5 to help destabilise Wilson's government. In July 1987, Labour MP Ken Livingstone used his maiden speech to raise the 1975 allegations of a former Army Press officer in Northern Ireland, Colin Wallace, who also alleged a plot to destabilise Wilson. Chris Mullin, MP, speaking on 23 November 1988, argued that sources other than Peter Wright supported claims of a long-standing attempt by MI5 to undermine Wilson's government.House of Commons Hansard Debates for 23 November 1988  Retrieved 1 July 2012."]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["*Chris Mullin"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Chris Mullin", "| Chris Mullin"]}, {"page": "Charlotte Atkins", "response": ["Atkins joined the Labour Party in 1965. In 1982, she was elected as a councillor in the London Borough of Wandsworth, and was the Deputy Leader of the Labour Group from 1983 to 1986. In 1981 she wrote a book with Chris Mullin entitled How to Select or Reselect Your MP.", "* How to Select or Reselect Your Member of Parliament by Chris Mullin and Charlotte Atkins, 1981, Institute of Workers' Control "]}, {"page": "Tony Benn", "response": ["Benn was a prolific diarist. Nine volumes of his diaries have been published. The final volume was published in 2013.\"Happy Birthday Tony Benn, 87\" , The Times, 3 April 2012. Collections of his speeches and writings were published as Arguments for Socialism (1979), Arguments for Democracy (1981), (both edited by Chris Mullin), Fighting Back (1988) and (with Andrew Hood) Common Sense (1993), as well as Free Radical: New Century Essays (2004). In August 2003, London DJ Charles Bailey created an album of Benn's speeches () set to ambient groove.", "* & Chris Mullin, Arguments for Democracy, Jonathan Cape (1981); "]}, {"page": "ITV Granada", "response": ["Granada's boldness was seen in ambitious documentaries such as Seven Up!, which premiered in 1964. The programme was a social experiment which followed the lives of 14 British children aged seven. It tracked their lives at seven-year intervals to discover whether their hopes and aspirations had been achieved. The documentary was voted the greatest ever by esteemed film-makers and its latest installment, 63 Up, premiered in 2019. Seven Up was part of the World in Action documentary series between 1963 and 1998, which won awards but was controversial. It garnered a reputation for hard-hitting investigative journalism and its producer Gus Macdonald commented that the programme was 'born brash.' Paul Greengrass said that David Plowright told him, \"don't forget, your job's to make trouble.\" World in Action demonstrated hard-hitting investigative journalism and explored issues such as police corruption at the Metropolitan Police in 1985 and the Royal Family's tax loophole in 1991. The programme led a campaign to prove the innocence of the Birmingham Six in 1985 when researcher Chris Mullin questioned the convictions; by 1991 the men had been released from prison."]}, {"page": "Sunderland A.F.C.", "response": ["Sunderland were mentioned in the May 1997 State Opening of Parliament when Chris Mullin, MP for Sunderland South, stated in his seconding of Queen Elizabeth II's Gracious Speech:"]}, {"page": "1982 in literature", "response": ["*Chris Mullin – A Very British Coup"]}, {"page": "Gareth Williams, Baron Williams of Mostyn", "response": ["As part of the celebrations to mark the fiftieth anniversary of the Life Peerages Act, Lord Williams was voted by the current members of the House of Lords as the outstanding life peer since the creation of the life peerage. In his book A View from the Foothills Chris Mullin wrote that he thought that Gareth Williams was most likely to succeed Derry Irvine as Lord Chancellor; the position was next filled  by Charles Falconer."]}, {"page": "Valerie Amos, Baroness Amos", "response": ["Amos was elevated to the peerage in August 1997 as Baroness Amos, of Brondesbury in the London Borough of Brent. In the House of Lords, she was a co-opted member of the Select Committee on European Communities Sub-Committee F (Social Affairs, Education and Home Affairs) from 1997 to 1998. From 1998 to 2001, she was a Government Whip in the House of Lords and also a spokesperson on Social Security, International Development and Women's Issues as well as one of the Government's spokespersons in the House of Lords on Foreign and Commonwealth Affairs. Baroness Amos was appointed Parliamentary Under-Secretary for Foreign & Commonwealth Affairs on 11 June 2001, with responsibility for Africa; Commonwealth; Caribbean; Overseas Territories; Consular Issues and FCO Personnel. She was replaced by Chris Mullin."]}, {"page": "Seven Days in May", "response": ["* A Very British Coup, a 1988 three-episode serial, based on Chris Mullin's novel about an attempted right-wing overthrow of a left-wing British government"]}, {"page": "Birmingham Six", "response": ["The trial began on 9 June 1975 at the Crown Court sitting at Lancaster Castle, before Mr Justice Bridge and a jury. After legal arguments the statements made in November were deemed admissible as evidence. The unreliability of these statements was later established. Thomas Watt provided circumstantial evidence about John Walker's association with Provisional IRA members.p229 Chris Mullin Error of Judgement", "In March 1976 their first application for leave to appeal was dismissed by the Court of Appeal, presided over by Lord Widgery CJ.Miscarriages of Justice; Bob Woffinden (1987) Journalist Chris Mullin investigated the case for Granada TV's World in Action series. In 1985, the first of several World in Action programmes casting doubt on the men's convictions was broadcast. In 1986, Mullin's book, Error of Judgment: The Truth About the Birmingham Pub Bombings, set out a detailed case supporting the men's claims that they were innocent. It included his claim to have met some of those who were actually responsible for the bombings.", "On 28 March 1990, ITV broadcast the Granada Television docudrama, Who Bombed Birmingham?, which re-enacted the bombings and subsequent key events in Chris Mullin's campaign. Written by Rob Ritchie and directed by Mike Beckham, it starred John Hurt as Mullin, Martin Shaw as World in Action producer Ian McBride, Ciarán Hinds as Richard McIlkenny, one of the Six, and Patrick Malahide as Michael Mansfield (QC).BFI Screenonline – World in ActionSimon Coward, Richard Down & Christopher Perry The Kaleidoscope British Independent Television Drama Research Guide 1955–2010, Kaleidoscope Publishing, 2nd edition, 2010, p.3304,  It was repackaged for export as The Investigation – Inside a Terrorist Bombing, and first shown on American television on 22 April 1990.– Who Bombed Birmingham? – British Film Institute– The Investigation: Inside a Terrorist Bombing – IMDB Granada's BAFTA-nominated follow-up documentary after the release of the six men, World in Action Special: The Birmingham Six – Their Own Story, was telecast on 18 March 1991.– World in Action Special: The Birmingham Six – Their Own Story British Film Institute It was released on DVD in 2007 in Network's first volume of World in Action productions.World in Action Volume 1, networkdvd.net; accessed 6 April 2017.", "In January 1988 after their first appeal failed, the Sun said \"LOONY MP BACKS BOMB GANG\" and an editorial said, 'If the Sun had its way, we would have been tempted to string 'em up years ago.Error of Judgement, by Chris Mullin, Poolbeg Press, 1990, p.310.", "*Error of Judgment: The Truth About the Birmingham Bombings; Chris Mullin"]}, {"page": "Michael Havers, Baron Havers", "response": ["In his submission to Sir John May's Inquiry into the Guildford and Woolwich bombings in 1989, Labour MP Chris Mullin cast doubt on Havers's integrity in the matter:Evidence to Sir John May's Inquiry into the Guildford and Woolwich bombings - 1989 ePolitix"]}, {"page": "Viscount Stansgate", "response": ["Stansgate is a hamlet near the village of Steeple, Essex, on the southern side of the River Blackwater estuary. The village has been home to several generations of the Benn family since about 1900. They live in Stansgate Abbey, described by Chris Mullin as \"an ungainly, rambling 1920s house in a stunning location\"."]}, {"page": "Birmingham pub bombings", "response": ["In 1982, Patrick Hill was visited by civil rights lawyer Gareth Peirce, who agreed to act on his behalf. Peirce also encouraged Hill and his co-accused to continue to compile evidence attesting to their innocence and to write to media personnel such as journalist Chris Mullin, and politicians such as Sir John Farr in an effort to garner support for a review of their case. Farr responded to this correspondence in March 1983, and later thoroughly reviewed all documents relating to the men's conviction, concluding that the forensic evidence which existed against the six men was \"not worth the paper it was written on\".", "In 1986, British Labour politician and journalist Chris Mullin published Error of Judgement: Truth About the Birmingham Bombings, which provided further evidence that the men had been wrongly convicted. The book included anonymous interviews with some of those who claimed to have been involved in the bombings, and who claimed the protocol 30-minute warning bomb warning had been delayed because the preselected telephone box had been vandalised, and that by the time another telephone box was found, the advance warning had been significantly delayed.", "The made-for-TV film Who Bombed Birmingham? was first broadcast in 1990. Directed by Mike Beckham, the film is directly inspired by the painstaking efforts of then-journalist Chris Mullin to prove the six men convicted of the bombing had been the victims of a miscarriage of justice, as detailed in his 1986 book Error of Judgement: The Truth about the Birmingham Bombings. The film casts John Hurt as Mullin and Martin Shaw as Granada Television World in Action producer and fellow researcher Ian McBride, as they investigate the convictions of the \"Birmingham Six.\"", "* Error of Judgement: The Truth about the Birmingham Bombings, by Chris Mullin ()"]}, {"page": "Socialist Campaign Group", "response": ["* Chris Mullin (joined the government 1997)"]}, {"page": "Tribune (magazine)", "response": ["Clements resigned as editor in 1982 to become a political adviser to Foot (by now Labour leader), a role he continued under Foot's successor as Labour leader, Neil Kinnock. Clements was succeeded in the Tribune chair by Chris Mullin, who steered the paper into supporting Tony Benn (then just past the peak of his influence on the Labour left) and attempted to turn it into a friendly society in which readers were invited to buy shares, much to the consternation of the old Bevanite shareholders, most prominent among them John Silkin and Donald Bruce, who attempted unsuccessfully to take control of the paper. A protracted dispute ensued that at one point seemed likely to close the paper.For a detailed account of the Silkin takeover attempt, see articles by Chris Mullin, New Statesman, January 11 and 18, 1985.", "#Chris Mullin (1982–1984)"]}, {"page": "Alice Mahon", "response": ["Mahon was first elected for the Halifax constituency at the 1987 general election. In 1994, Mahon told Chris Mullin: \"‘I’m in the Stop Blair camp'. To which I replied, 'I am in the Win the Next Election camp'.\" "]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Chris Mullin"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Chris Mullin"]}, {"page": "Shaun Woodward", "response": ["Woodward was criticised by his former colleagues in the Conservative Party, including leader William Hague, Conservative former Deputy Prime Minister Michael Heseltine and party chairman Michael Ancram. Other critics included backbench Labour MPs Tony Benn and Jeremy Corbyn, and ten years later, former Labour government minister Chris Mullin, in his political diaries. ", "In the June 2001 general election, Woodward decided not to contest his Witney seat as a Labour candidate and instead found a safe Labour seat in St Helens South. Chris Mullin wrote with shock of \"the awful Shaun Woodward\" defecting to Mullin's own side, calling \"the New Labour elite parachuting [Woodward] into a safe seat ... one of New Labour's vilest stitch-ups ... made my flesh creep\". His successor in Witney was David Cameron, who subsequently became Prime Minister in 2010."]}, {"page": "Mike O'Brien (British politician)", "response": ["O’Brien described to a colleague the chaos he discovered in the department on being appointed as Immigration Minister: “Once, on a visit to IND, he opened a cupboard and found it full of unanswered mail, having just been assured there were no more outstanding letters.  A hapless junior official was summoned. His explanation? ‘We put them there so that the Minister wouldn’t see them’”.Chris Mullin “View from the Foothills” Profile Books Ltd 2009. Page 264", "At a ministerial meeting, O’Brien joined Chris Mullin in warning the Prime Minister that his education reforms were “hectoring” teachers.Chris Mullin “A View from the Foothills” Profile Books Ltd 2009 Page 50", "Mike O’Brien changed the rules so that cosmetics could not be tested on animals, but considered resigning after the Home Secretary refused to have an inquiry into animal rights complaints about Huntingdon Life Sciences.Chris Mullin “View from the Foothills” Profile Books Ltd 2009. Page 142", "Chris Mullin says that privately when Mullin asked for advice about what to say to Blair at an NEC meeting Mike O’Brien said, “Tell him not to make any more promises to George Bush. Somewhere along the line he’s promised Bush that we will be there with him and now he can’t back down because his integrity is at stake”.Chris Mullin “View from the foothills.” Profile Books Ltd 2009 Page 384", "In May 2003, Chris Mullin says Mike O’Brien intended to resign as a Foreign Office Minister over Iraq, “Because I don’t believe what I am being asked to say about the existence of weapons of mass destruction. The Security Service is still saying they will be found, but I don’t believe them.” Mullin, who opposed the war, convinced him to “stay put” because it was unnecessary “self immolation” to resign.Chris Mullin “View from the foothills” Profile Books Ltd 2009. Page 408 Mike O’Brien was not criticised in the various reports into the Iraq war."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Chris Mullin"]}, {"page": "Audrey Wise", "response": ["Audrey Wise (née Brown; 4 January 1932Wise gave her age as thirty-nine when nominated for the Coventry parliamentary seat, though she had just turned forty-two when she was elected in February 1974. Her date of birth was routinely reported as 1935 after this date, which often caused her \"enormous difficulty\" when asked in later years. See  and Chris Mullin in A View from the Foothills: The Diaries of Chris Mullin (Profile Books, 2009, p127) – 2 September 2000) was a British Labour politician and Member of Parliament."]}, {"page": "University of Hull", "response": ["Alumni of the University of Hull are especially prominent in the fields of politics, academia, journalism and drama. They include former MP and later Deputy Prime Minister Lord Prescott (John Prescott), former MP and Deputy Leader of the Labour Party Lord Hattersley (Roy Hattersley) and former Labour MP and deputy leader Tom Watson, former Labour MP and author Chris Mullin, vaccinologist Dame Sarah Gilbert who was Project Lead on the Oxford–AstraZeneca COVID-19 vaccine, social scientist Lord Giddens (Anthony Giddens), poet Roger McGough, journalist John McCarthy, film director, playwright and screenwriter the late Anthony Minghella. "]}, {"page": "World in Action", "response": ["Although in its early days World in Action was reputed never to employ anyone who was on first-name terms with any politician, a number of subsequent British parliamentarians have World in Action on their curricula vitae. The most recent is the Conservative MP Adam Holloway, elected to the House of Commons in 2005. The former British cabinet minister Jack Straw worked on World in Action as a researcher, as did Margaret Beckett who served as Tony Blair's last Foreign Secretary. Chris Mullin, Labour MP for Sunderland South from 1987 to 2010, played a major role in the programme's campaign on behalf of the Birmingham Six. Gus Macdonald, now Baron Macdonald of Tradeston, and from 1998 to 2003 a government minister, was formerly an executive on the programme. John Birt (by then ennobled as Baron Birt), was personal adviser to the British Prime Minister Tony Blair between 2001 and 2005.", "*Chris Mullin (1990), Error of Judgement: Birmingham Bombings, Dublin: Poolbeg Press."]}, {"page": "Alan Plater", "response": ["He also contributed to the BBC series Dalziel and Pascoe, and adapted Chris Mullin's novel A Very British Coup (1988) for television. He was the driving force behind the TV version of Flambards, which under his influence was claimed to be slanted well to the political left of K. M. Peyton's original books. Jazz is a recurring motif through much of Plater's work, often referenced explicitly as well as underpinning his story structures. Among his few feature films he collaborated twice with Christopher Miles on two successful D.H.Lawrence projects The Virgin and the Gypsy and Priest of Love.DVD – 'Virgin and the Gypsy' Arrow Classics FCD 434 –  \"An audience with Honor Blackman and Christopher Miles\" – released 2010Butler, Ivan. \"Cinema in Britain\" South Brunswick & New York A.S. Barnes & Company –  'Best Lawrence-based film to date' – (pg 289 The Tantivy Press) "]}, {"page": "Guildford Four and Maguire Seven", "response": ["Following the failure of the 1977 court appeal, a number of 'lone voices' publicly questioned the conviction; among them David Martin in The Leveller, Gavin Esler and Chris Mullin in the New Statesman and David McKittrick in the Belfast Telegraph. On 26 February 1980, BBC One Northern Ireland aired Spotlight: Giuseppe Conlon and the Bomb Factory, which contained an interview by Patrick Maguire and the BBC's Gavin Esler."]}, {"page": "A Very British Coup", "response": ["A Very British Coup is a 1982 novel by British politician Chris Mullin. The novel has twice been adapted for television; as A Very British Coup in 1988 and as Secret State in 2012.", "The book was written in 1981, at a time when Tony Benn looked likely to become deputy leader of the Labour Party which at the time was strongly challenging the government of Margaret Thatcher in the opinion polls. It also has strong echoes of the persistent rumours that have circulated over the years about attempts by members of the British security services, and other wings of the British Establishment, to undermine and depose Harold Wilson's Labour government of the mid-1970s.Chris Mullin: When the threat of a coup seemed more than fiction  The Guardian, 7 March 2006 This first became widespread public knowledge around 1986 with the controversy over Spycatcher, after the publication of the novel but before the broadcast of the TV version. The story also has echoes of the 1975 Australian constitutional crisis in which there was alleged CIA involvement to remove a government proposing to close US military bases on Australian soil."]}, {"page": "Bearskin", "response": ["In 2005, the Ministry of Defence began a two-year test of artificial fur for the hats.  The army has already replaced beaverskin caps and leopard skins, worn by some of its soldiers, with artificial materials.  In March 2005, Labour MP Chris Mullin called for an immediate ban on bearskins stating that they \"have no military significance and involve unnecessary cruelty.\"Call to ban British royal guards from wearing bearskin hats gains support"]}, {"page": "West Midlands Serious Crime Squad", "response": ["Throughout the 1980s, there were concerns about the safety of the Birmingham Six convictions. Chris Mullin campaigned as an MP to see their convictions reviewed. Concerns about the Bridgewater Four, who had been investigated by the sister No 4 Regional Crime Squad, were investigated by Paul Foot.", "Gibbs, Samuels and Francis were arrested, accused of being involved with the death of PC Tony Salt. Salt had been on duty with PC Mark Berry on 16 April 1989 in Small Heath, supposedly watching an illegal nightclub from a flat. According to Chris Mullin, recounting the events in Parliament, Salt most likely died after a bout of heavy drinking while on duty led to his collapse. Mullin states that Berry made four statements, which gradually increased the number and involvement of one to three black men in the incident, one of whom was said to have dreadlocks."]}, {"page": "Parachute candidate", "response": ["*Shaun Woodward defected from the Conservative Party to the Labour Party in 1999. He faced much criticism from former Conservative colleagues, particularly when he refused to resign and fight a by-election. Woodward did not run for re-election in his safe Conservative seat of Witney in Oxfordshire, instead being selected for the ultra-safe Labour seat of St Helens South in Merseyside. Labour Minister Chris Mullin wrote later in his diaries that \"the New Labour elite parachuting [Woodward] into a safe seat ... [was] one of New Labour's vilest stitch-ups ... [it] made my flesh creep.\""]}, {"page": "Parliamentary Under-Secretary of State for Foreign Affairs", "response": ["|Chris Mullin"]}]}}