{"wiki_id": "http://www.wikidata.org/entity/Q5109339", "itemLabel": "Christian Blackshaw", "itemDescription": "British pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Christian_Blackshaw", "wikipedia_page": {"main": "Christian Charles Blackshaw  (born 18 January 1949, in Cheshire, England) is a British classical pianist.\nHe was educated at The King's School, Macclesfield. In his teens he played oboe (as well as piano) in the Stockport Youth Orchestra in Greater Manchester. He studied at the Royal Northern College of Music, and at the Royal Academy of Music with Gordon Green. He then studied at the Saint Petersburg Conservatory under Moisei Halfin. He was later tutored in London by Clifford Curzon.\nBlackshaw lives between London and Suffolk, and has three daughters. After the death of his wife of cancer, Blackshaw quit the concert hall for many years and returned to play in public in 2011-2012 performing a series of concerts of the complete Sonatas by MozartHe was appointed a Member of the Order of the British Empire (MBE) in the 2019 New Year Honours for services to music.", "link_mentions": [{"page": "King's School, Macclesfield", "response": ["* Christian Blackshaw (born 1949), classical pianist"]}, {"page": "Royal Birmingham Conservatoire", "response": ["* Christian Blackshaw - pianist"]}, {"page": "St George's Church, Brandon Hill", "response": ["St George's Bristol is particularly known for presenting classical, jazz, folk, world music and opera and stages more than 200 events every year, regularly attracting artists of international note including Angela Hewitt, Nicola Benedetti, Mark Padmore, plus The Orchestra of the Age of Enlightenment (in Spring/Summer of 2010) and Viktoria Mullova, Stephen Hough, Paul Lewis, Christian Blackshaw, Janis Ian, Abdullah Ibrahim and Marc Almond (in Autumn 2011). In addition, regular performances are given by local professional groups such as the Bristol Ensemble and amateur orchestras and choirs."]}, {"page": "Stockport Youth Orchestra", "response": ["It was formed in 1956, and has provided orchestral experience for many players who have gone on to achieve professional success, such as Christian Blackshaw, Jennifer Pike, and Nicholas Kenyon.  The orchestra maintains a diverse and challenging repertoire and has a substantial library of orchestral music."]}, {"page": "Alice Coote", "response": ["* 2016: Schumann Lieder (incl. Frauenliebe und -leben, Dichterliebe) – Alice Coote, Christian Blackshaw (piano); Harmonia Mundi"]}, {"page": "Blackshaw (surname)", "response": ["*Christian Blackshaw (born 1949), British classical pianist"]}]}}