{"wiki_id": "http://www.wikidata.org/entity/Q5108432", "itemLabel": "Chris Watmough", "itemDescription": "cricketer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Watmough", "wikipedia_page": {"main": "Christine Joy Watmough (born 22 March 1947) is an English former cricketer who played primarily as a left-handed batter. She appeared in 13 Test matches and 28 One Day Internationals for England between 1968 and 1985. She was a member of the England team that won the inaugural World Cup in 1973. She played domestic cricket for Kent and Surrey.", "link_mentions": [{"page": "1982 Women's Cricket World Cup", "response": ["* Chris Watmough"]}, {"page": "1978 Women's Cricket World Cup", "response": ["* Chris Watmough"]}, {"page": "Kent Women cricket team", "response": ["* Chris Watmough (1968)"]}, {"page": "Watmough", "response": ["*Chris Watmough, English cricketer"]}, {"page": "Surrey Women cricket team", "response": ["* Chris Watmough (1968)"]}, {"page": "1982 Women's Cricket World Cup Final", "response": ["The final was played at Lancaster Park, in Christchurch, New Zealand, on 7 February, in front of a crowd of around 3,000. The match was umpired by a New Zealander, Fred Goodall, and the English umpire, Dickie Bird. By officiating in the match, Bird became the only umpire to stand in both a men's and women's World Cup final, having previously umpired the 1975 Cricket World Cup Final. The England captain, Susan Goatman, won the toss, and chose to bat first on a pitch described as \"placid\" by the Australian press. The England opening batters, Brittin and Goatman, scored slowly, putting on 42 runs together before Brittin was dismissed by a diving catch from Marie Cornish off her own bowling for 17 runs. England scored another 12 runs before Goatman was bowled by Lyn Fullston for 29. Fullston was also the bowler for the next wicket; Chris Watmough was caught at mid-on by Kennare for 9, and England were 63 for three. England's experienced partnership of Jan Southgate and Rachael Heyhoe-Flint aimed to recover the England innings, but were restricted by Australia's spin bowling. Southgate in particular was described in The Age as being \"uncomfortable against the spin\", while The Times criticised Heyhoe-Flint for \"not forcing the pace when England had wickets in hand.\" In the final ten overs, the England batters began to score more quickly; but both were dismissed shortly before the close of the innings. Southgate, who made the team's highest score, 53 runs, was caught by Sharyn Hill off the bowling of Sharon Tredrea, while Heyhoe-Flint was caught by Fullston off Tredrea's bowling for 29. England finished with 151 for five.", "! scope=\"row\" style=\"font-weight: normal; text-align: left;\" | Chris Watmough", "! scope=\"row\" style=\"font-weight: normal; text-align: left;\" | Chris Watmough "]}, {"page": "Australian women's cricket team in England in 1976", "response": ["* Chris Watmough"]}, {"page": "English women's cricket team in Australia and New Zealand in 1968–69", "response": ["* Chris Watmough", "* Chris Watmough"]}, {"page": "West Indies women's cricket team in England in 1979", "response": ["* Chris Watmough"]}, {"page": "New Zealand women's cricket team in England and the Netherlands in 1984", "response": ["* Chris Watmough"]}]}}