{"wiki_id": "http://www.wikidata.org/entity/Q5107677", "itemLabel": "Chris Pallis", "itemDescription": "British doctor and libertarian socialist", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Pallis", "wikipedia_page": {"main": "Christopher Agamemnon Pallis (2 December 1923, in Bombay – 10 March 2005, in London)  was an Anglo-Greek neurologist and libertarian socialist intellectual. Under the pen-names Martin Grainger and Maurice Brinton, he wrote and translated for the British group Solidarity from 1960 until the early 1980s. As a neurologist, he produced the accepted criteria for brainstem death, and wrote the entry on death for Encyclopædia Britannica.", "link_mentions": [{"page": "Libertarian socialism", "response": ["In the mid-20th century, some libertarian socialist groups emerged from disagreements with Trotskyism which presented itself as Leninist anti-Stalinism. As such, the French group Socialisme ou Barbarie emerged from the Trotskyist Fourth International, where Cornelius Castoriadis and Claude Lefort constituted a Chaulieu–Montal tendency in the French Parti Communiste Internationaliste in 1946. In 1948, they experienced their \"final disenchantment with Trotskyism\",, p. 133 leading them to break away to form Socialisme ou Barbarie, whose journal began appearing in March 1949. Castoriadis later said of this period that \"the main audience of the group and of the journal was formed by groups of the old, radical left: Bordigists, council communists, some anarchists and some offspring of the German \"left\" of the 1920s\"., p. 134 Also in the United Kingdom, the group Solidarity was founded in 1960 by a small group of expelled members of the Trotskyist Socialist Labour League. Almost from the start it was strongly influenced by the French Socialisme ou Barbarie group, in particular by its intellectual leader Cornelius Castoriadis, whose essays were among the many pamphlets Solidarity produced. The intellectual leader of the group was Chris Pallis, who wrote under the name Maurice Brinton.Brinton, Maurice (Goodway, David ed). For Workers' Power: the selected writings of Maurice Brinton. AK Press. 2004. "]}]}}