{"wiki_id": "http://www.wikidata.org/entity/Q5105869", "itemLabel": "Chris Beckett", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Beckett", "wikipedia_page": {"main": "Chris Beckett (born 1955) is a British social worker, university lecturer, and science fiction author. He has written several textbooks, dozens of short stories, and six novels.", "link_mentions": [{"page": "Anglia Ruskin University", "response": ["* Chris Beckett, academic, author and science-fiction novelist"]}, {"page": "Dark Eden", "response": [":Dark Eden is also a novel by Chris Beckett."]}, {"page": "Beckett", "response": ["*Chris Beckett (born 1955), English writer, social worker and academic"]}, {"page": "Old Bryanstonians", "response": ["* Chris Beckett (born 1955), science fiction author"]}, {"page": "Edge Hill University", "response": ["The Edge Hill Short Story Prize is purported to be the only UK award that recognises excellence in a single author, published short story collection. The prize attracts established authors who compete alongside relative newcomers. Previous winners have been John Burnside, Kevin Barry, Colm Tóibín, Claire Keegan, Chris Beckett, Jeremy Dyson, Graham Mort, Sarah Hall and Jessie Greengrass. The prize is co-ordinated by Ailsa Cox, Reader in Creative Writing and English, and has three categories, the main literary award of £5,000 as well as a £1,000 Reader’s Prize judged by BA Creative Writing students, and a £500 award for students on the University's MA Creative Writing course."]}, {"page": "Elastic Press", "response": ["In 2005 and 2009 Elastic received British Fantasy Awards for Best Small Press. They also won the British Fantasy Society Best Anthology award in 2005, 2006, and 2007.British Fantasy Award#Best Anthology British Fantasy Award In 2008, their title Other Voices by Andrew Humphrey won an East Anglian Book award. In 2009, their title The Turing Test by Chris Beckett won the Edge Hill Short Story Prize, beating many Booker-nominated authors to do so.", "*The Turing Test by Chris Beckett"]}, {"page": "List of fictional gynoids", "response": ["*Lucy, the 'syntec' (robot with living human skin) prostitute in The Holy Machine by Chris Beckett (2004)"]}, {"page": "Novacon", "response": ["|Chris Beckett"]}, {"page": "Year's Best SF 5", "response": ["*Chris Beckett: \"Valour\" (First published in Interzone, 1999)"]}, {"page": "Year's Best SF 6", "response": ["*Chris Beckett: \"The Marriage of Sky and Sea\" (First published in Interzone, 2000)"]}, {"page": "Robots (anthology)", "response": ["*Chris Beckett: \"La Macchina\" (1991)"]}, {"page": "The Year's Best Science Fiction: Twenty-Third Annual Collection", "response": ["*Chris Beckett: \"Picadilly Circus\""]}, {"page": "The Year's Best Science Fiction: Nineteenth Annual Collection", "response": ["*Chris Beckett: \"Marcher\""]}, {"page": "The Ant Men of Tibet and Other Stories", "response": ["*Chris Beckett: \"The Warrior Half-and-Half\" (1995)"]}, {"page": "Richard Webster (British author)", "response": ["Chris Beckett writes that while Webster accepts that abuse occurs, he considers many convictions against former residential workers were miscarriages of justice and sees them as similar to witch-hunts. Beckett sees Webster's case against the widespread belief that the residential care system was infiltrated by paedophile rings as well-argued. According to Beckett, Webster argues that police procedures in North Wales dangerously reverse normal police methods, by starting with suspects and then interviewing large numbers of people to find out whether a crime was committed; this process is flawed since former residents of residential homes may have motives to make false accusations."]}, {"page": "The Year's Best Science Fiction: Ninth Annual Collection", "response": ["*Chris Beckett: \"La Macchina\""]}, {"page": "Christopher Beckett", "response": ["* Chris Beckett (born 1955), British writer, social worker, and academic"]}, {"page": "SFeraKon", "response": ["SFeraKon's many famous guests of honor have included Joe Haldeman,  Robert Silverberg (1999), Walter Jon Williams (2001),http://dns1.vjesnik.hr/Pdf/2001%5C04%5C19%5C17A17.PDF  Lois McMaster Bujold (2002), George R. R. Martin (2003), Ken MacLeod (2004),http://www.vjesnik.hr/pdf/2004%5C04%5C26%5C22A22.PDF  Michael Swanwick (2006), Bruce Sterling (2007), Richard Morgan (2008), R. Scott Bakker (2009),http://www.vjesnik.hr/Pdf/2009%5C04%5C24%5C35A35.PDF  Ian McDonald (2010), Milena Benini (2010), Dave Lally (2011), Goran Skrobonja (2011), Oto Oltvanji (2011), Darko Tuševljaković (2011), Charles Stross (2012), Tim Powers (2012), Cheryl Morgan (2012), Dmitry Glukhovsky (2012), Danielle Trussoni (2013), Esad Ribić (2013), Chris Beckett (2014), Kate Elliott (2015), James Lovegrove (2017), and Adrian Tchaikovsky (2018)."]}, {"page": "Atlantic Books", "response": ["In 2013, Dark Eden by Chris Beckett, published by Corvus, won the Arthur C. Clarke Award — the most prestigious award for Science Fiction in Britain. \"Chris Beckett at Atlantic\"Flood, Alison (1 May 2013), \"Chris Beckett wins Arthur C Clarke award for Dark Eden\", The Guardian. The same year, Alif the Unseen by G. Willow Wilson won the World Fantasy Award for Best Novel.\"2013 World Fantasy Award Nominees and Life Achievement Award Winners\"."]}, {"page": "Lord Ashcroft International Business School", "response": ["* Chris Beckett, academic, author and science-fiction novelist"]}, {"page": "List of people associated with Goldsmiths, University of London", "response": ["*Chris Beckett"]}, {"page": "James White Award", "response": ["In 2019, the judges also awarded a special commendation to runner up Property Crime by Michael Donoghue – who missed out by the narrowest margin in the Award’s history. The judging panel consisted of Justina Robson, Chris Beckett, and Donna Scott."]}, {"page": "The Year's Best Science Fiction: Twenty-Eighth Annual Collection", "response": ["*Chris Beckett: \"The Peacock Cloak\""]}, {"page": "Dark Eden (novel)", "response": ["Dark Eden is a social science fiction novel by British author Chris Beckett, first published in the United Kingdom in 2012. The novel explores the disintegration of a small group of a highly inbred people, descendants of two individuals whose spaceship crashed on a rogue planet they call Eden. It is the first in the Eden trilogy, followed by Mother of Eden and Daughter of Eden.", "Dark Eden was author Chris Beckett's second novel.  Reviews were generally very positive in the United Kingdom. Stuart Kelly in The Guardian called it a \"superior piece of theologically nuanced science fiction\", although he noted that the novel drew a little heavily on Russell Hoban's Riddley Walker and Will Self's The Book of Dave. Author Paul Di Filippo, reviewing the book for Locus magazine, described the plot as uninventive but \"so splendidly [written] it feels brand new and remade\". He pointed out that the novel's \"harsh oasis\" plot device resembled the work of Fritz Leiber, Stephen Baxter, Larry Niven, and Karl Schroeder. But that didn't matter: \"[A]ll this heavy categorizing misses the essence of the reader’s first contact with the book, which is pure astonishment and pleasure, a storytelling ride full of brio and wonder. ... The reader is swiftly seduced by two things that are intrinsic to, but separate from, the powerful plot: the Carrollian language, and the freaky ecology.\" He had high praise for the character of John Redlantern, who was a metaphor (in De Filippo's mind) for both Moses and Cain. David Langford in The Daily Telegraph said Dark Eden contained \"A classic theme, beautifully told\"."]}, {"page": "The Year's Best Science Fiction: Twentieth Annual Collection", "response": ["*\"To Become a Warrior\" (Chris Beckett)"]}, {"page": "Mother of Eden", "response": ["Mother of Eden is a social science fiction novel by British author Chris Beckett, first published in the United Kingdom in June 2015 and later in the United States in January 2016. It is the sequel to the novel Dark Eden and follows events of the first book several generations later."]}, {"page": "Edge Hill Short Story Prize", "response": ["| 2010 || Chris Beckett || Katharine Fry || Professor Tanya Byron", "Colm Toibin was the first winner of the Edge Hill Short Story Prize in 2007. His winning collection, Mothers and Sons, explores the family relationships of several individuals during significant times in their lives. The following year Claire Keegan won the prize with her collection entitled Walk the Blue Fields. The collection's stories illustrate the yearning of the human heart against the backdrop of a nation wrestling with its past. The 2009 prize was awarded to Chris Beckett for The Turing Test. This science fiction collection captures readers' attention with tales about robots, alien planets, genetic manipulation, virtual reality, and artificial intelligence. Jeremy Dyson won the 2010 prize for his third short story collection The Cranes that Build the Cranes. A compilation of ghoulish stories, The Cranes that Build the Cranes is full of black humour and dark stories that received significant praise from critics. In 2011 judges awarded the prize to Professor Graham Mort for his collection entitled Touch. The stories in Touch are set in a variety of backgrounds including Africa, France, and northern England, and they convey an understanding and respect of the natural world and human relationships. Sarah Hall's The Beautiful Indifference won the prize in 2012. The collection includes erotic and disarming stories that span across centuries and diverse landscapes, all emphasizing the importance of survivalism. Dark Lies the Island by Kevin Barry was awarded the prize in 2013. This collection explores the tragedies and comedies of everyday life, and includes moving tales of misspent love and crimes gone wrong. The 2014 prize was given to John Burnside for his collection entitled Something Like Happy. Stories in Something Like Happy are often set in coastal towns during the winter, and include tales of menace, violence, and hallucinations. The 2015 prize was awarded to Professor Kirsty Gunn for Infidelities. The collection centres on stories of infidelity and includes tales of lust, love, resentment, and regret. ", "| 2009 || Chris Beckett || The Turing Test"]}, {"page": "A.I.s", "response": ["*\"The Turing Test\" (Chris Beckett)"]}, {"page": "Audie Award for Science Fiction", "response": ["| Dark Eden (2012) by Chris Beckett"]}]}}