{"wiki_id": "http://www.wikidata.org/entity/Q5108308", "itemLabel": "Chris Tremlett", "itemDescription": "Cricket player of England. (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Tremlett", "wikipedia_page": {"main": "Christopher Timothy Tremlett (born 2 September 1981) is a former English cricketer who played international cricket for England and domestically for Hampshire and Surrey. He was a 6 feet 7 inches (2.01 m) tall fast-medium bowler able to extract bounce on most surfaces. Tremlett started his playing career with Hampshire in 2000 and was awarded his county cap in 2004. He made his One Day International debut in 2005, and two years later played his first Test. Tremlett played three Tests in 2007 before injury interrupted.\nTremlett moved to Surrey for the start of 2010 after struggling with injury. Following this move, he forced his way back into the Test team and participated in England's victory in the 2010–11 Ashes in Australia. He was a competent number 8 or 9 batsman, with seven first-class fifties to his name and has a strong arm from the deep.\nHe retired from all forms of cricket on 21 August 2015 due to injury. Tremlett had been affected by back and knee injuries in recent years and was restricted to three Championship appearances for Surrey in 2015. In retirement he took up weightlifting and in June 2017 he shared a picture of his body transformation which went viral on the internet.", "link_mentions": [{"page": "September 2", "response": ["*  1981   – Chris Tremlett, English cricketer"]}, {"page": "Otterbourne", "response": ["Famous people from Otterbourne include Chris Tremlett who plays cricket for England and Surrey and novelist Charlotte Mary Yonge."]}, {"page": "List of International cricket families", "response": ["* Chris Tremlett"]}, {"page": "Warwickshire County Cricket Club in 2005", "response": ["Warwickshire were set to chase 291 to win, and Carter fulfilled his job as a pinch hitter well, scoring four fours and one six en route to 32, and Nick Knight and Ian Bell kept up with the required run rate well. However, Bell suffered cramps just before he reached 50, and that limited his movements – he succumbed shortly afterwards, chipping a simple catch to Chris Tremlett and was gone for 54. The other batsmen tried to add runs with Knight, but yielded to the Hampshire bowling and fielding effort, and when Knight was finally dismissed for 118 Warwickshire needed 40 runs for the last three wickets. Shane Watson effectively stopped that, having Dougie Brown and Ashley Giles out bowled, leaving Warwickshire to hit about 20 runs in the last over. It was too much for Makhaya Ntini, who was bowled by Chris Tremlett with the second ball of the last over, and thus Hampshire took an 18-run victory."]}, {"page": "2005 English cricket season", "response": ["September began with Australia's women recording a four-run win in the final ODI of the five-match series – Clare Connor out as last woman when England needed five to win off the last over. Karen Rolton then hit 96 not out in the second women's Twenty20 international ever to be played, as Australia won by seven wickets. On 3 September, Hampshire batted first to make 290 in the C&G Trophy final, and Andy Bichel, Shane Watson and Chris Tremlett combined to bowl their final opponents Warwickshire out for 272 to win the Trophy, becoming the third club to win a major trophy in England this season. Meanwhile, former England Under-19 player Alastair Cook took the Australian bowlers on for 270 in a drawn non-first class tour match."]}, {"page": "Gloucestershire County Cricket Club in 2005", "response": ["The third day saw yet another change in fortunes, which just about left Hampshire on top. The bowlers dominated the first two days, but the start of the third day was dominated by Hampshire's bowlers batting. Warne increased his score to 62, Chris Tremlett got 64 and Richard Logan 28 through aggressive batting as Hampshire closed their second innings on 275. This left Gloucestershire a challenging target of 252. Spearman and Phil Weston then put on 129 for the first wicket, only for five wickets to fall in quick succession before bad light stopped play, with the visitors on 149 for 5, needing 103 for victory.", "On the second day, Alex Gidman posted 115 and Steve Adshead 73 to lift Gloucestershire from 191 for 6 to 363. Hampshire then collapsed again, falling to 23 for 3 (including the wicket of nightwatchman Chris Tremlett) before John Crawley and Shane Watson rescued them with a 120-run partnership, as spinners Bandara and Ian Fisher toiled away to little effect. Hampshire eventually declared on 388 for 7, with four of their batsmen passing fifty, which left Gloucestershire 411 to win in a day. That never looked likely, but attritional cricket from Ramnaresh Sarwan and Matt Windows lifted Gloucestershire to 156 for 2, and then Gidman came in to add a further 39 for the fourth wicket. However, Shane Watson got a vital breakthrough with the wicket of Gidman, Shaun Udal unleashed a spell of furious off-spin on the tail, taking six for 61, and Gloucestershire were bowled out with an hour to spare.", "Mark Hardinges took four for 40 to help Gloucestershire Gladiators record a thumping victory over Hampshire Hawks, after tying down and frustrating the opponents' batsmen. Hardinges was the main culprit as Hampshire lost their last nine wickets for exactly 100 runs to post a total of 178, despite Nic Pothas, Sean Ervine and Shane Watson all making at least 40. In reply, William Weston and Matt Windows paired up for 106 runs for the second wicket, and not even Chris Tremlett, who took three for 34, could stop Gloucestershire from reaching the target with more than ten overs to spare."]}, {"page": "Essex County Cricket Club in 2005", "response": ["André Nel and Danish Kaneria conceded runs at less than four runs an over to help Essex Eagles to victory over Hampshire Hawks at Chelmsford, and the four points for the win increased their lead in the National League to an unassailable 14 points and secured the National League title for Essex. After an opening stand of 70 between William Jefferson and Ronnie Irani, Hampshire got four wickets for 31 as three Essex batsmen were dismissed in single figures before James Middlebrook put on 68 with Jefferson. However, three wickets fell for three runs and the score was 172 for 7, with Jefferson caught for 88, but Hampshire could only take two more wickets in the last half-hour as contributions from Ryan ten Doeschate, Graham Napier and Kaneria propelled Essex to 222 for 9 at the end of their 45 overs. Hampshire and England fast bowler Chris Tremlett got Napier, ten Doeschate and James Middlebrook out to end with three wickets for 48. Despite John Crawley and Nic Pothas recording a first-wicket partnership of 95, Kaneria dismissed Pothas and went on to concede 26 in nine overs – well short of the required run rate at five an over, and boundaries were rare after Pothas and Crawley were dismissed. In the end, Hampshire finished on 210 for 8, 13 runs short of victory – with their overseas players Shane Watson and Andy Bichel contributing four runs off 18 deliveries, for a run rate of 1.33 an over."]}, {"page": "Glamorgan County Cricket Club in 2005", "response": ["Zimbabwean all-rounder Sean Ervine and wicket-keeper Nic Pothas made the most impact with ball and bat respectively for Hampshire as they defeated Glamorgan at Cardiff. Mike Powell was the only batsman to pass 40, making 56 runs in a little over an hour in a Glamorgan total of 214, while Ervine took five for 50 from his ten overs – admittedly mostly tail-enders, but he got the most wickets – while Chris Tremlett also took three for 32. Pothas then notched up the first limited-over century of the Hampshire season, scoring 114 not out off 127 balls and standing tall while Glamorgan's fast bowlers Andrew Davies and Simon Jones made inroads with the ball – Hampshire were 89 for 4 before England prospect Kevin Pietersen came in to hit 69 off 64 balls, including four sixes, as he shared a 130-run partnership with Pothas. Thanks to the quick scoring of Pothas and Pietersen, Hampshire won with nearly 11 overs to spare.", "Amid rains at Southampton, Hampshire batted their way to the big lead they were expected to get against Glamorgan, who had lost four games in the Championship before this. Former England batsman John Crawley took a day for his century, while in contrast Kevin Pietersen took two and a half hours for his, making a century off 99 balls and ending with 126. Hampshire eventually made 401 for 8 declared to get full batting points before attacking Glamorgan. Chris Tremlett reaped Glamorgan wickets in the next innings, removing David Hemp, Mike Powell and Jonathan Hughes among others to take four for 42 and reduce Glamorgan to 229 – a score that would have been much lower but for Darren Thomas, who blitzed his way to 63. Following on, Glamorgan got to 77 for 1 at stumps on day three, but wickets tumbled in the morning, reducing Glamorgan to 147 for 5. Robert Croft and Mike Powell rebuilt, but when Australian batsman Simon Katich had Croft caught by skipper Shane Warne and Powell went a few overs later, Glamorgan ended on a total of 250 as Zimbabwe all-rounder Sean Ervine picked up the last three wickets, finishing with five for 60, while Tremlett took three for 48. In reply, Hampshire reached the target of 79 inside fifteen overs, with Katich – unusually – opening the batting. With Nottinghamshire losing to Kent and Warwickshire and Surrey not playing, Hampshire took the lead in the Championship with their emphatic full-score win."]}, {"page": "Northamptonshire County Cricket Club in 2005", "response": ["At Northampton, Northamptonshire Steelbacks' Bilal Shafayat struck a career-best 74 from 82 balls as Northants stormed to 266 for 9. Shafayat was dropped on 11 and 56, but congratulated by Hampshire captain, Shane Warne, who was taken for 53 in nine overs. Hampshire fell to 44 for 4 in reply and, despite 42 from Shaun Udal batting number eight, were never in the game as the Hawks were all out for 168. Northamptonshire seamer Ben Phillips took his second List A four-wicket-haul, removing Kevin Pietersen, John Crawley, Warne and Chris Tremlett on his way to four for 48. (BBC scorecard)", "Hampshire Hawks batted first at The Rose Bowl, and despite an unbeaten 100 from Greg Lamb – the first of his List A career – Hampshire were tied down to 226 for 7 off their 45 overs, mainly thanks to three for 30 from Australian Damien Wright. Six wides from Chris Tremlett, who conceded 51 runs off his eight overs then cost Hampshire the game after Shaun Udal had taken three wickets to set Northamptonshire Steelbacks back to 135 for 5. David Sales added 49 with Wright before Ben Phillips guided Northamptonshire to four points with 26 off 12 balls and secured a win with ten balls to spare."]}, {"page": "Sussex County Cricket Club in 2005", "response": ["Hampshire finished the first day on top at Hove. Sussex, despite a century from Michael Yardy, were all out for 252, with Chris Tremlett taking 6 for 44. In reply, the visitors reached 67 for 1. Only for the position to be reversed on the second day, as they were dismissed for 280, with James Kirtley claiming 4 and Robin Martin-Jenkins 3 wickets. Sussex finished on 101 for 2.", "Kirtley and Naved-ul-Hasan continued to pile on the pressure on the third morning, as they eked out two catches and reduced Hampshire to 28 for 5, a lead of 21. However, once again, the all-rounders fought back. Australian Shane Watson made 82, while Pothas added 74, and number 11 Chris Tremlett made an unbeaten 44 to ensure that Hampshire set a competitive target of 271, despite Kirtley's five for 67. Ian Ward made 60 and Murray Goodwin an unbeaten 51 as Sussex cruised to 167 for 3 after only 38 overs on day three, needing 104 more to win on the fourth day."]}, {"page": "Nottinghamshire County Cricket Club in 2005", "response": ["Hampshire pulled off a close win on the final day against their title rivals. There was no play on the first day at Trent Bridge because of rain. When play did get underway, Hampshire batted first, making 277 as Andrew Harris took 6 for 83. Nine Hampshire batsmen made double-figure scores, with only Kevin Pietersen (two-ball 0) and No. 11 Richard Logan dismissed for a one-digit score. More rain meant that Nottinghamshire were only on 222 for 5 in reply by the end of the third day. With both teams eager for the 14 points on offer for an outright victory, terms were agreed to between the two sides. Nottinghamshire declared overnight, and Hampshire replied by hitting  220 for 4 off 28.3 overs. These overs were bowled by Jason Gallian, David Hussey and Darren Bicknell - players who on average bowled a couple of overs a match, but who now bowled as Hampshire were invited to score quickly. Hussey got career best figures of four for 105. Nottinghamshire were set 276 to win, and a century from Stephen Fleming saw the hosts to 227 for 3, but after that they collapsed, losing their last five wickets for three runs, with Chris Tremlett taking 5 for 80, including a hat-trick as Hampshire edged the victory. (Cricinfo scorecard)"]}, {"page": "Lancashire County Cricket Club in 2005", "response": ["Despite an economical bowling performance from England prospect James Anderson who took two for 18 off 7.5 overs, Lancashire Lightning imploded with the bat at home against Hampshire Hawks who moved out of the relegation zone as they took a 79-run win at Old Trafford. Hampshire batted first, and Derek Kenway top-scored with 65 as they were bowled out for 200, but Lancashire could only muster 121 against Hampshire's strong bowling attack, Chris Tremlett taking three for 30 while off-spinner Shaun Udal took three tail-enders for 11. "]}, {"page": "Hampshire County Cricket Club in 2005", "response": ["*  Chris Tremlett", "The third day saw yet another change in fortunes, which just about left Hampshire on top. The bowlers dominated the first two days, but the start of the third day was dominated by Hampshire's bowlers batting. Warne increased his score to 62, Chris Tremlett got 64 and Richard Logan 28 through aggressive batting as Hampshire closed their second innings on 275. This left Gloucestershire a challenging target of 252. Spearman and Phil Weston then put on 129 for the first wicket, only for five wickets to fall in quick succession before bad light stopped play, with the visitors on 149 for 5, needing 103 for victory.", "Hampshire finished the first day on top at Hove. Sussex, despite a century from Michael Yardy, were all out for 252, with Chris Tremlett taking 6 for 44. In reply, the visitors reached 67 for 1. Only for the position to be reversed on the second day, as they were dismissed for 280, with James Kirtley claiming 4 and Robin Martin-Jenkins 3 wickets. Sussex finished on 101 for 2.", "At Northampton, Northamptonshire Steelbacks' Bilal Shafayat struck a career-best 74 from 82 balls as Northants stormed to 266 for 9. Shafayat was dropped on 11 and 56, but congratulated by Hampshire captain, Shane Warne, who was taken for 53 in nine overs. Hampshire fell to 44 for 4 in reply and, despite 42 from Shaun Udal batting number eight, were never in the game as the Hawks were all out for 168. Northamptonshire seamer Ben Phillips took his second List A four-wicket-haul, removing Kevin Pietersen, John Crawley, Warne and Chris Tremlett on his way to four for 48. (BBC scorecard)", "Billy Taylor, however, played a special knock. Lasting 116 balls, he scored only 9 runs, but his stamina proved invaluable. He forged good partnerships with Katich and Crawley, giving Hampshire a good platform to hit loose from. Wicketkeeper Nic Pothas was top-scorer with 65, but Zimbabwe all-rounder Sean Ervine (30) and Dimitri Mascarenhas (44) also chipped in to lift Hampshire to 304. A spirited reply from Middlesex was always tampered by the Hampshire bowlers chipping away at their line-up patiently, and despite 52 from former Kent batsman Ed Smith, Middlesex were defeated as Chris Tremlett ripped out the tail, ending with four for 59 – just outperformed by Warne, who took four for 58.", "Zimbabwean all-rounder Sean Ervine and veteran wicket-keeper Nic Pothas made the most important contributions as Hampshire overpowered Glamorgan at Cardiff. Only Mike Powell showed some sort of resistance, scoring 56 in Glamorgan's 214, while Ervine took five for 50 from his ten overs – admittedly mostly tail-enders, but he got the most wickets. Chris Tremlett also took three for 32. Pothas then notched up the first limited-over century of the Hampshire season, scoring 114 not out off 127 balls and standing tall while Glamorgan's fast bowlers Andrew Davies and Simon Jones made inroads with the ball. England prospect Kevin Pietersen continued his fine form with 69 off 64 balls, including four sixes, as he shared a 130-run partnership with Pothas. Thanks to the quick scoring of Pothas and Pietersen, Hampshire won with nearly 11 overs to spare.", "Amid rains at Southampton, Hampshire batted their way to the big lead they were expected to get against Glamorgan, who had lost four games in the Championship before this. Former England batsman John Crawley crawled his way to a day-long century, while Kevin Pietersen took care of the fast scoring, making a century off 99 balls and ending with 126. Hampshire eventually made 401 for 8 declared to get full batting points before attacking Glamorgan. Chris Tremlett bowled well in the attempt, removing David Hemp, Mike Powell and Jonathan Hughes among others to take four for 42 and reduce Glamorgan to 229 – a score that would have been much lower but for Darren Thomas, who blitzed his way to 63. Following on, Glamorgan batted more casually, getting to 77 for 1 at stumps on day 3, but wickets tumbled in the morning, reducing Glamorgan to 147 for 5. Robert Croft and Mike Powell rebuilt, but when Australian batsman Simon Katich had Croft caught by skipper Shane Warne and Powell went a few overs later, Glamorgan imploded to 250 all out as Zimbabwe all-rounder Sean Ervine picked up the last three wickets, finishing with five for 60, while Tremlett took three for 48. In reply, Hampshire brushed aside the target of 79 inside fifteen overs, with Katich – unusually – opening the batting. With Nottinghamshire losing to Kent and Warwickshire and Surrey not playing, Hampshire took the lead in the Championship with their emphatic full-score win.", "Hampshire Hawks batted first at The Rose Bowl, and despite an unbeaten 100 from Greg Lamb – the first of his List A career – Hampshire were tied down to 226 for 7 off their 45 overs, mainly thanks to three for 30 from Australian Damien Wright. Six wides from Chris Tremlett, who conceded 51 runs off his eight overs then cost Hampshire the game after Shaun Udal had taken three wickets to set Northamptonshire Steelbacks back to 135 for 5. David Sales added 49 with Wright before Ben Phillips guided Northamptonshire to four points with 26 off 12 balls and secured a win with ten balls to spare.", "Hampshire pulled off a close win on the final day against their title rivals. There was no play on the first day at Trent Bridge because of rain. When play did get underway, Hampshire batted first, making 277 as Andrew Harris took 6 for 83. Nine Hampshire batsmen made double-figure scores, with only Kevin Pietersen (two-ball 0) and No. 11 Richard Logan dismissed for a one-digit score. More rain meant that Nottinghamshire were only on 222 for 5 in reply by the end of the third day. With both teams eager for the 14 points on offer for an outright victory, terms were agreed to between the two sides. Nottinghamshire declared overnight, and Hampshire replied by hitting  220 for 4 off 28.3 overs. These overs were bowled by Jason Gallian, David Hussey and Darren Bicknell – players who on average bowled a couple of overs a match, but who now bowled as Hampshire were invited to score quickly. Hussey got career best figures of four for 105. Nottinghamshire were set 276 to win, and a century from Stephen Fleming saw the hosts to 227 for 3, but after that they collapsed, losing their last five wickets for three runs, with Chris Tremlett taking 5 for 80, including a hat-trick as Hampshire edged the victory. (Cricinfo scorecard)", "Despite an economical bowling performance from England prospect James Anderson who took two for 18 off 7.5 overs, Lancashire Lightning imploded with the bat at home against Hampshire Hawks who moved out of the relegation zone as they took a 79-run win at Old Trafford. Hampshire batted first, and Derek Kenway top-scored with 65 as they were bowled out for 200, but Lancashire could only muster 121 against Hampshire's strong bowling attack, Chris Tremlett taking three for 30 while off-spinner Shaun Udal took three tail-enders for 11.", "In a bonus 12-over match, arranged in haste as Hampshire were bowled out for 85 in the first match, Hampshire – led by hired-in Vikram Solanki who made 41 – scored 110 for 4, but were still beaten by a massive smash from Kevin Pietersen for England, as he scored 46 from 15 balls. However, that was not all – Chris Tremlett's three wickets threatened to ruin England's chase, but Simon Jones and Darren Gough saw them to the target on the last ball.", "A great team effort, despite Martin Bicknell being out of form, resulted in Surrey winning their third game of the season and sharing third place in the table with Hampshire. A healthy opening partnership between Scott Newman and Richard Clinton worth 100 was to be the highest of the entire match, and despite Chris Tremlett taking wickets regularly, he also conceded a lot of runs, as he ended with four for 106 off twenty overs. Newman eventually finished with 111 and Australian David Thornely made 73 to see Surrey to a final score of 361 – in just 81.4 overs. The first two days at The Rose Bowl were hampered by rain, but amid the showers, Indian bowler Harbhajan Singh took six for 36 as Hampshire crumbled in a rather unimpressive heap for 146. Only two batsmen passed 20, and seven were out in single figures. Hampshire's second innings began with the first ball of the third day, and James Ormond ripped out two wickets quickly, Mohammad Akram got a five-for, and only John Crawley's 67 – off 62 balls with thirteen boundaries, slightly out of place in the situation – passed 25. Thus, the two teams were tied on 100 points in the Championship, allowing Warwickshire and Kent to run away further on the table.", "Kirtley and Naved-ul-Hasan continued to pile on the pressure on the third morning, as they eked out two catches and reduced Hampshire to 28 for 5, a lead of 21. However, once again, the all-rounders fought back. Australian Shane Watson made 82, while Pothas added 74, and number 11 Chris Tremlett made an unbeaten 44 to ensure that Hampshire set a competitive target of 271, despite Kirtley's five for 67. Ian Ward made 60 and Murray Goodwin an unbeaten 51 as Sussex cruised to 167 for 3 after only 38 overs on day three, needing 104 more to win on the fourth day.", "On the second day, Alex Gidman posted 115 and Steve Adshead 73 to lift Gloucestershire from 191 for 6 to 363. Hampshire then collapsed again, falling to 23 for 3 (including the wicket of nightwatchman Chris Tremlett) before John Crawley and Shane Watson rescued them with a 120-run partnership, as spinners Bandara and Ian Fisher toiled away to little effect. Hampshire eventually declared on 388 for 7, with four of their batsmen passing fifty, which left Gloucestershire 411 to win in a day. That never looked likely, but attritional cricket from Ramnaresh Sarwan and Matt Windows lifted Gloucestershire to 156 for 2, and then Gidman came in to add a further 39 for the fourth wicket. However, Shane Watson got a vital breakthrough with the wicket of Gidman, Shaun Udal unleashed a spell of furious off-spin on the tail, taking six for 61, and Gloucestershire were bowled out with an hour to spare.", "Mark Hardinges took four for 40 to help Gloucestershire Gladiators record a thumping victory over Hampshire Hawks, after tying down and frustrating the opponents' batsmen. Hardinges was the main culprit as Hampshire lost their last nine wickets for exactly 100 runs to post a total of 178, despite Nic Pothas, Sean Ervine and Shane Watson all making at least 40. In reply, William Weston and Matt Windows paired up for 106 runs for the second wicket, and not even Chris Tremlett, who took three for 34, could stop Gloucestershire from reaching the target with more than ten overs to spare.", "Economical bowling from André Nel and Danish Kaneria gave Essex Eagles the victory over Hampshire Hawks at Chelmsford, and the four points for the win increased their lead in the National League to an unassailable 14 points and secured the National League title. Essex opener William Jefferson kept his calm while the rest of the top order deserted him, making 88, but when three wickets fell for only three runs and the score was 172 for 7 Hampshire would have fancied their chances of bowling Essex out. Only two more wickets fell, though, as contributions from Ryan ten Doeschate, Graham Napier and Kaneria propelled Essex to 222 for 9 at the end of their 45 overs. Hampshire and England fast bowler Chris Tremlett got Napier, ten Doeschate and James Middlebrook out to end with three wickets for 48. Despite John Crawley and Nic Pothas recording a first-wicket partnership of 95, Kaneria kept his calm, only allowing 26 runs off his nine overs, and boundaries were rare after Pothas and Crawley were dismissed. In the end, Hampshire finished on 210 for 8, 13 runs short of victory – they could put some of the blame on their overseas players, as Australians Shane Watson and Andy Bichel contributed only four runs off 18 deliveries.", "Warwickshire were set to chase 291 to win, and Carter fulfilled his job as a pinch hitter well, scoring four fours and one six en route to 32, and Nick Knight and Ian Bell kept up with the required run rate well. However, Bell suffered cramps just before he reached 50, and that limited his movements – he succumbed shortly afterwards, chipping a simple catch to Chris Tremlett and was gone for 54. The other batsmen tried to add runs with Knight, but yielded to the Hampshire bowling and fielding effort, and when Knight was finally dismissed for 118 Warwickshire needed 40 runs for the last three wickets. Shane Watson effectively stopped that, having Dougie Brown and Ashley Giles out bowled, leaving Warwickshire to hit about 20 runs in the last over. It was too much for Makhaya Ntini, who was bowled by Chris Tremlett with the second ball of the last over, and thus Hampshire took an 18-run victory.", "Two days after their win in the C&G Trophy Final, Hampshire Hawks were defeated by Middlesex Crusaders, to move closer to relegation in the National League. They were put in to bat, and lost wicket-keeper Nic Pothas for 5 early on, but John Crawley and Sean Ervine fought back with a 101-run partnership for the second wicket. The Middlesex bowlers frequently interrupted with wickets, though, and Crawley failed to hit the ball hard enough to end with only six fours in his 122-ball 92. Hampshire closed on 227 for 6, with five Middlesex bowler. Middlesex lost Paul Weekes in the first over, but a blistering 139-run stand between Owais Shah and Jamie Dalrymple turned the match around. Despite three wickets each from Hampshire's Chris Tremlett and Greg Lamb, Middlesex' Chris Peploe held his head calm, and with 14 not out he guided Middlesex to a two-wicket victory with 11 balls to spare."]}, {"page": "Surrey County Cricket Club in 2005", "response": ["A great team effort, despite Martin Bicknell being out of form, resulted in Surrey winning their third game of the season and sharing third place in the table with Hampshire. A healthy opening partnership between Scott Newman and Richard Clinton worth 100 was to be the highest of the entire match, and despite Chris Tremlett taking wickets regularly, he also conceded a lot of runs, as he ended with four for 106 off twenty overs. Newman eventually finished with 111 and Australian David Thornely made 73 to see Surrey to a final score of 361 – in just 81.4 overs. The first two days at The Rose Bowl were hampered by rain, but amid the showers, Indian bowler Harbhajan Singh took six for 36 as Hampshire crumbled in a rather unimpressive heap for 146. Only two batsmen passed 20, and seven were out in single figures. Hampshire's second innings began with the first ball of the third day, and Jason Ormond ripped out two wickets quickly, Mohammad Akram got a five-for, and only John Crawley's 67 – off 62 balls with thirteen boundaries, slightly out of place in the situation – passed 25. Thus, the two teams were tied on 100 points in the Championship, allowing Warwickshire and Kent to run away further on the table."]}, {"page": "Middlesex County Cricket Club in 2005", "response": ["Billy Taylor, however, played a special knock. Lasting 116 balls, he scored only 9 runs, but his stamina proved invaluable. He forged good partnerships with Katich and Crawley, giving Hampshire a good platform to hit loose from. Wicketkeeper Nic Pothas was top-scorer with 65, but Zimbabwe all-rounder Sean Ervine (30) and Dimitri Mascarenhas (44) also chipped in to lift Hampshire to 304. A spirited reply from Middlesex was always tampered by the Hampshire bowlers chipping away at their line-up patiently, and despite 52 from former Kent batsman Ed Smith, Middlesex were defeated as Chris Tremlett ripped out the tail, ending with four for 59 – just outperformed by Warne, who took four for 58.", "Two days after their win in the C&G Trophy Final, Hampshire Hawks were defeated by Middlesex Crusaders, to move closer to relegation in the National League. They were put in to bat, and lost wicket-keeper Nic Pothas for 5 early on, but John Crawley and Sean Ervine fought back with a 101-run partnership for the second wicket. The Middlesex bowlers frequently interrupted with wickets, though, and Crawley failed to hit the ball hard enough to end with only six fours in his 122-ball 92. Hampshire closed on 227 for 6, with five Middlesex bowler. Middlesex lost Paul Weekes in the first over, but a blistering 139-run stand between Owais Shah and Jamie Dalrymple turned the match around. Despite three wickets each from Hampshire's Chris Tremlett and Greg Lamb, Middlesex' Chris Peploe held his head calm, and with 14 not out he guided Middlesex to a two-wicket victory with 11 balls to spare."]}, {"page": "National League Division One in 2005", "response": ["At Northampton, Northamptonshire Steelbacks' Bilal Shafayat struck a career-best 74 from 82 balls as Northants stormed to 266 for 9. Shafayat was dropped on 11 and 56, but congratulated by Hampshire captain, Shane Warne, who was taken for 53 in nine overs. Hampshire fell to 44 for 4 in reply and, despite 42 from Shaun Udal batting number eight, were never in the game as the Hawks were all out for 168. Northamptonshire seamer Ben Phillips took his second List A four-wicket-haul, removing Kevin Pietersen, John Crawley, Warne and Chris Tremlett on his way to four for 48. (BBC scorecard)", "Hampshire Hawks batted first at The Rose Bowl, and despite an unbeaten 100 from Greg Lamb – the first of his List A career – Hampshire were tied down to 226 for 7 off their 45 overs, mainly thanks to three for 30 from Australian Damien Wright. Six wides from Chris Tremlett, who conceded 51 runs off his eight overs then cost Hampshire the game after Shaun Udal had taken three wickets to set Northamptonshire Steelbacks back to 135 for 5. David Sales added 49 with Wright before Ben Phillips guided Northamptonshire to four points with 26 off 12 balls and secured a win with ten balls to spare.", "Despite an economical bowling performance from England prospect James Anderson who took two for 18 off 7.5 overs, Lancashire Lightning imploded with the bat at home against Hampshire Hawks who moved out of the relegation zone as they took a 79-run win at Old Trafford. Hampshire batted first, and Derek Kenway top-scored with 65 as they were bowled out for 200, but Lancashire could only muster 121 against Hampshire's strong bowling attack, Chris Tremlett taking three for 30 while off-spinner Shaun Udal took three tail-enders for 11.", "Mark Hardinges took four for 40 to help Gloucestershire Gladiators record a thumping victory over Hampshire Hawks, after tying down and frustrating the opponents' batsmen. Hardinges was the main culprit as Hampshire lost their last nine wickets for exactly 100 runs to post a total of 178, despite Nic Pothas, Sean Ervine and Shane Watson all making at least 40. In reply, William Weston and Matt Windows paired up for 106 runs for the second wicket, and not even Chris Tremlett, who took three for 34, could stop Gloucestershire from reaching the target with more than ten overs to spare.", "Economical bowling from André Nel and Danish Kaneria gave Essex Eagles the victory over Hampshire Hawks at Chelmsford, and the four points for the win increased their lead in the National League to an unassailable 14 points and secured the National League title. Essex opener Will Jefferson kept his calm while the rest of the top order deserted him, making 88, but when three wickets fell for only three runs and the score was 172 for 7 Hampshire would have fancied their chances of bowling Essex out. Only two more wickets fell, though, as contributions from Ryan ten Doeschate, Graham Napier and Kaneria propelled Essex to 222 for 9 at the end of their 45 overs. Hampshire and England fast bowler Chris Tremlett got Napier, ten Doeschate and James Middlebrook out to end with three wickets for 48. Despite John Crawley and Nic Pothas recording a first-wicket partnership of 95, Kaneria kept his calm, only allowing 26 runs off his nine overs, and boundaries were rare after Pothas and Crawley were dismissed. In the end, Hampshire finished on 210 for 8, 13 runs short of victory – they could put some of the blame on their overseas players, as Australians Shane Watson and Andy Bichel contributed only four runs off 18 deliveries.", "Two days after their win in the C&G Trophy Final, Hampshire Hawks were defeated by Middlesex Crusaders, to move closer to relegation in the National League. They were put in to bat, and lost wicket-keeper Nic Pothas for 5 early on, but John Crawley and Sean Ervine fought back with a 101-run partnership for the second wicket. The Middlesex bowlers frequently interrupted with wickets, though, and Crawley failed to hit the ball hard enough to end with only six fours in his 122-ball 92. Hampshire closed on 227 for 6, with five Middlesex bowler. Middlesex lost Paul Weekes in the first over, but a blistering 139-run stand between Owais Shah and Jamie Dalrymple turned the match around. Despite three wickets each from Hampshire's Chris Tremlett and Greg Lamb, Middlesex' Chris Peploe held his head calm, and with 14 not out he guided Middlesex to a two-wicket victory with 11 balls to spare."]}, {"page": "Bangladeshi cricket team in England in 2005", "response": ["Chris Tremlett, England's ODI debutant, started well with good pace - near 140 km/h - while Jon Lewis served up full tosses and wides from the other end. In the tenth over, Tremlett got his due reward, first having Shahriar Nafees gone with an inside edge and then followed up with having Tushar Imran caught behind for a golden duck. Mohammad Ashraful was then given another life, misreading a ball from Tremlett which ended up on the stumps - incredibly, the bails stayed on, so Ashraful survived. The next 20 balls he faced were duly dispatched for runs - he particularly took a liking to Steve Harmison, who conceded more in 17 balls today than in the entire match against Australia - and he made the fastest ODI fifty by a Bangladeshi off just 21 balls. He looked to be on his way to the fifth-fastest ODI century, having hit 94 off 51 balls, but eventually hit one expansive stroke too many as he was bowled by Collingwood."]}, {"page": "James Anderson (cricketer)", "response": ["Anderson played in all three Tests of the series with India, coming into the side for the injured Matthew Hoggard and leading a pace attack comprising himself, Ryan Sidebottom and Chris Tremlett with only 20 caps between them. Retrieved on 31 May 2008. In the first Test of the series, Anderson claimed his 50th Test wicket when he dismissed Mahendra Singh Dhoni for 0; Retrieved on 21 December 2008. the feat was achieved in Anderson's 17th Test match and after the match he had 53 wickets at an average of 35.67. Retrieved on 21 December 2008. He became the first England bowler to dismiss Rahul Dravid, Sachin Tendulkar, and Sourav Ganguly in the same innings. Although England lost the series, Anderson demonstrated greater consistency than before and managed 14 wickets, at 35.57 and getting the Man of the Series award. Retrieved on 31 May 2008. He also managed to get his name on the honours board at Lord's for the second time with his best Test figures of 5/42. Retrieved on 31 May 2008. The ODI series which followed was England's first ODI series win at home in three years. Anderson was the leading wicket-taker of either side with 14 wickets at an average of 22.57. Retrieved on 31 May 2008. In the first ODI of the series, Anderson claimed his 100th ODI wicket when he dismissed Gautam Gambhir for 3; Retrieved on 21 December 2008. after the match, he had taken 103 wickets from 70 matches at an average of 27.02. Anderson was also included for the England squad for the World Twenty20, held in September 2007, replacing an injured Ravi Bopara. Retrieved on 31 May 2008. He played in all four of England's matches, taking three wickets at 34.00, as England failed to progress beyond the second stage of the competition. Retrieved on 27 December 2008. Following a successful summer, he was one of twelve players awarded a central contract for 2007/08 by the ECB. Retrieved on 31 May 2008."]}, {"page": "Australian cricket team in England in 2005", "response": ["Australia squared the ODI series by winning a game where England missed their captain Michael Vaughan due to injury. Marcus Trescothick, the stand-in captain, won the toss and decided to chase at the Riverside Ground, thus giving his own side the task of batting under floodlights. Chris Tremlett who had made an impressive debut against Bangladesh, struggled early on with his line and length, and the Australian openers Matthew Hayden and Adam Gilchrist punished him for runs. In his fifth over, however, Tremlett got a breakthrough, Gilchrist mistiming a cut and Geraint Jones taking the catch behind. However, Ricky Ponting did not toss his wicket away early, leaving it to Hayden to hit the runs, and at the end of 15 overs the Australians were 73 for 1. Andrew Flintoff and Steve Harmison, the change bowlers, kept the pressure up on the batsmen, however, not letting too many runs away even though they bowled the occasional wide, and they could reap the rewards with two quick wickets, Ponting for 27 and Hayden for 39, and people began to remember the last ODI between the sides."]}, {"page": "One-Day Internationals in England in 2005", "response": ["Chris Tremlett, England's ODI debutant, started well with good pace - near 140 km/h - while Jon Lewis served up full tosses and wides from the other end. In the tenth over, Tremlett got his due reward, first having Shahriar Nafees gone with an inside edge and then followed up with having Tushar Imran caught behind for a golden duck. Mohammad Ashraful was then given another life, misreading a ball from Tremlett which ended up on the stumps - incredibly, the bails stayed on, so Ashraful survived. The next 20 balls he faced were duly dispatched for runs - he particularly took a liking to Steve Harmison, who conceded more in 17 balls today than in the entire match against Australia - and he made the fastest ODI fifty by a Bangladeshi off just 21 balls. He looked to be on his way to the fifth-fastest ODI century, having hit 94 off 51 balls, but eventually hit one expansive stroke too many as he was bowled by Collingwood.", "Australia squared the ODI series by winning a game where England missed their captain Michael Vaughan due to injury. Marcus Trescothick, the stand-in captain, won the toss and decided to chase at the Riverside Ground, thus giving his own side the task of batting under floodlights. Chris Tremlett who had made an impressive debut against Bangladesh, struggled early on with his line and length, and the Australian openers Matthew Hayden and Adam Gilchrist punished him for runs. In his fifth over, however, Tremlett got a breakthrough, Gilchrist mistiming a cut and Geraint Jones taking the catch behind. However, Ricky Ponting didn't toss his wicket away early, leaving it to Hayden to hit the runs, and at the end of 15 overs the Australians were 73 for 1. Andrew Flintoff and Steve Harmison, the change bowlers, kept the pressure up on the batsmen, however, not letting too many runs away even though they bowled the occasional wide, and they could reap the rewards with two quick wickets, Ponting for 27 and Hayden for 39, and people began to remember the last ODI between the sides."]}, {"page": "2005 Ashes series", "response": ["* Chris Tremlettb"]}, {"page": "English cricket team in Pakistan in 2005–06", "response": ["Michael Vaughan suffered an injury in the second warm-up match against Pakistan A in Bagh-e-Jinnah, Lahore. He was replaced by Marcus Trescothick as captain for the 1st Test at Multan. Simon Jones of Glamorgan and Chris Tremlett of Hampshire were originally selected but withdrew due to injury on 4 October and 13 October respectively. Liam Plunkett of Durham was announced as a replacement for Jones on 11 October. Tremlett was not replaced.", "Simon Jones was also named in the squad, but did not travel due to fitness problems. Chris Tremlett was named in the squad and withdrew through injury on 13 October. Udal and Ali were named as replacements. Ashley Giles (hip surgery) and Michael Vaughan (knee surgery) flew home before the ODI series started, with Bell staying in Pakistan and Blackwell coming in as a replacement. Kevin Pietersen played the first two ODIs, but withdrew with a rib injury on 13 December, and was not replaced."]}]}}