{"wiki_id": "http://www.wikidata.org/entity/Q5106477", "itemLabel": "Chris Edwards", "itemDescription": "English boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Edwards_(boxer)", "wikipedia_page": {"main": "Chris Edwards (6 May 1976 – 30 March 2018) was a British professional boxer who competed from 1998 to 2012. He held the British super flyweight title in 2007, the British flyweight title twice between 2009 and 2012, and the Commonwealth flyweight title from 2009 to 2010.", "link_mentions": [{"page": "Chris Edwards", "response": ["Chris Edwards or Christopher Edwards may refer to:", "* Chris Edwards (bishop) (born 1961), Anglican bishop of North Sydney from 2013", "* Chris Edwards (boxer) (1976–2018), British flyweight boxer", "* Chris Edwards (musician) (born 1980), bassist for Kasabian", "* Chris Edwards (Oregon politician) (born 1973), Oregon State House, District 14 Representative", "* Chris Edwards (Nevada politician), member of the Nevada Assembly", "* Chris Edwards (skater) (born 1973), California-based inline skater"]}, {"page": "List of British flyweight boxing champions", "response": ["|align=left | Chris Edwards", "|align=left | Chris Edwards"]}, {"page": "Lee Haskins", "response": ["Haskins made his professional debut in March 2003 when he took on and defeated Ben Cornthwaite stopping him in the first round at Stadium the home of Bristol City FC.  In his very next contest he defeated future British champion Chris Edwards this time over 6 rounds at the same venue.  By the time he had compiled a winning ledger of 9–0 he challenged journeyman fighter Delroy Spencer for the English Flyweight title and claimed the belt after Spencer retired after the third round of the 10 round contest.  In February 2006 almost three years from his professional debut and now with a winning record of 13–0 Haskins challenged the Tanzanian fighter Anthony Mathias for the vacant Commonwealth Flyweight title.  He stopped Mathias in the 2nd round at The Pavilions in Plymouth to pick up his second career title.", "|style=\"text-align:left;\"| Chris Edwards"]}, {"page": "Andy Bell (boxer)", "response": ["The toughest fight of his career so far took place in March 2008 when Bell fought reigning British champion Chris Edwards for the national super flyweight belt live on Sky Sports.  The fight took place at the Barnsley Metrodome and ended with victory for the man from Doncaster who won a unanimous decision over the champion."]}, {"page": "Shinny Bayaar", "response": ["Bayaar fought twice in 2008 beating Ghanain journeyman Sumaila Badu in April and Spaniard Jordi Gallart in November.Oldham Advertiser | Stubbs powers to title victory - also Bayaar vs. Gallart  In 2009 Bayaar trod water with a win over journeyman Daniel Thorpe before having his application for British citizenship granted and being given the opportunity to fight for the British Flyweight title.  The fight for the title on 23 October 2009 took place at the Bolton Arena and pitted Bayaar against reigning champion Chris Edwards.  Bayaar extended his winning run with a split decision victory over Edwards who later said he was \"gobsmacked\" by the verdict.Oldham Advertiser | Shinny shinesThe Sentinel | Edwards puts titles on the line", "Shinny's first fight of 2010 pitched him against Najah Ali at the Indoor Sports Center in Leigh, the fight was only a six rounder and not a title fight although Bayaar only scored a narrow points victory.  The first defence of his title was set for Dagenham on 14 May 2010 against the unbeaten English champion Ashley Sexton.Boxingnews24 | Sexton is up for a bit of Ussie bashing  The fight resulted in a draw with Bayaar suffering a nasty cut in the later rounds.Sky sports | Draw enough for Bayaar  On 15 December 2010 Bayaar lost the title to Paul Edwards after an accidental clash of heads in the first round of their fight in Belfast resulted in a deep cut opening in the center of Bayaar's head and the fight being called off.Liverpool Echo | British victory is short and sweet for Edwards  Bayaar next fought on 10 December 2011 and went straight back into British championship action facing former opponent Chris Edwards who had defeated Paul Edwards to reclaim the title earlier in the year.  The fight went the distance and resulted in another loss for Bayaar as Edwards successfully defended the title.BBC Sport | Ashley Theophane and Chris Edwards defend British titles"]}, {"page": "Usman Ahmed", "response": ["Ahmed lost on his professional debut via points decision over six rounds to Chris Edwards on 30 September 2006, at the Kings Hall in Stoke-on-Trent.", "In his eighth fight, with a record of 5–1–1, he fought Chris Edwards in a rematch on 29 May 2009 at the Fenton Manor Sports Complex, Stoke-on-Trent, with Edwards' British and Commonwealth flyweight titles on the line. Ahmed lost the fight by unanimous decision, with two judges scoring the bout 118–109 and the third scoring it 117–111."]}, {"page": "Abmerk Shindjuu", "response": ["He encountered Englishman Chris Edwards for the Commonwealth flyweight titles and fell to a defeat in his homeland and home city. He returns to action against Smangaliso Madonsela in Namibia."]}, {"page": "Jamie McDonnell", "response": ["McDonnell's first fight outside his home town saw him travel to the York Hall in London to defeat Nikita Lukin on 21 September 2007 in an eight-round fight. His next fight was to be for the British super-flyweight title at the Robin Park Centre in Wigan on 8 December 2007.  The fight with Chris Edwards would be the first time the British super-flyweight had been contested making this the inaugural contest for the belt. The experienced Edwards eventually won the title via split decision after twelve hotly contested rounds handing a first defeat for the Doncaster man.", "|align=left| Chris Edwards"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Chris Edwards (2)", "|align=left |  Chris Edwards (1)"]}, {"page": "Paul Edwards (boxer)", "response": ["On 11 June 2011, Edwards made the first defence of his British flyweight title against Chris Edwards at the Olympia, Liverpool. Edwards lost the title by split decision, with one judges’ scorecard reading 115–114, and the other two 113–115.", "|align=left| Chris Edwards"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Chris Edwards (born 1976), flyweight boxer."]}, {"page": "Kevin Satchell", "response": ["|align=left| Chris Edwards"]}, {"page": "Dale Robinson", "response": ["Dale Robinson (born 9 April 1980) born in Huddersfield is an English amateur flyweight and professional fly/super fly/bantam/super bantamweight boxer of the 1990s and 2000s, who as an amateur won the 1999 Amateur Boxing Association of England (ABAE) flyweight title, against Anthony Joyett (West Ham ABC), boxing out of Hard and Fast ABC (Barnsley), and 2000 Amateur Boxing Association of England (ABAE) flyweight title, against D. Bennett (St. Mary's ABC), boxing out of Hard and Fast ABC (Barnsley), and as a professional won the British Boxing Board of Control (BBBofC) Central Area flyweight title, and Commonwealth flyweight title, drew with Chris Edwards for the vacant BBBofC British flyweight title, and vacant Commonwealth flyweight title, and was a challenger for the International Boxing Organization (IBO) super flyweight title against Jason Booth, BBBofC British bantamweight title against Martin Power, and BBBofC English flyweight title against Chris Edwards, his professional fighting weight varied from , i.e. flyweight to , i.e. super bantamweight. Dale Robinson was trained by Chris Aston, and managed by Tommy Gilmour."]}, {"page": "List of British super-flyweight boxing champions", "response": ["| align=\"left\" |Chris Edwards"]}, {"page": "2018 in the United Kingdom", "response": ["**Chris Edwards, 41, British boxer, heart attack."]}, {"page": "2018 in England", "response": ["**Chris Edwards, 41, British boxer, heart attack."]}, {"page": "Deaths in March 2018", "response": ["*Chris Edwards, 41, British boxer, heart attack.Shock as champion boxer Chris Edwards dies aged 41"]}, {"page": "Chris Edwards (British boxer)", "response": ["#REDIRECT Chris Edwards (boxer)"]}, {"page": "2018 BBC Sports Personality of the Year Award", "response": ["*Scott Westgarth Dean Francis Chris Edwards"]}]}}