{"wiki_id": "http://www.wikidata.org/entity/Q5106399", "itemLabel": "Chris Difford", "itemDescription": "British musician, singer, songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Difford", "wikipedia_page": {"main": "Christopher Henry Difford (born 4 November 1954) is an English singer, musician, songwriter, and record producer. He is a founding member and songwriter of the British group Squeeze.", "link_mentions": [{"page": "Elvis Costello", "response": ["In 1981, Glenn Tilbrook from Squeeze and Martin Belmont from the Rumour guested on the song \"From a Whisper to a Scream\" from the album Trust. Around this time he also collaborated with Chris Difford, also of Squeeze, to write additional lyrics for the song \"Boy With A Problem\", which appeared on Costello's 1982 album Imperial Bedroom. In 1984, Daryl Hall provided backing vocals on the song \"The Only Flame In Town\" from the album Goodbye Cruel World. The following year he sang with Annie Lennox on the song \"Adrian\" from the Eurythmics record Be Yourself Tonight."]}, {"page": "November 4", "response": ["*1954 – Chris Difford, English singer-songwriter, guitarist, and producer"]}, {"page": "Stiff Records", "response": ["In 2007, ZTT and its parent company SPZ Group reactivated the label. Stiff quickly broke one of the UK's hottest new indie acts, The Enemy. It then released a string of well-received albums of new work from legacy Stiff artists, including as Wreckless Eric, Henry Priestman, Any Trouble, and Chris Difford. Brand new acts signed to the label included The Tranzmitors and Eskimo Disco. Swedish designer Tobbe Stuhre was appointed official Stiff Records designer."]}, {"page": "Squeeze (band)", "response": ["The vast majority of their material is composed of lyrics by Chris Difford and music by Glenn Tilbrook, who are guitarists and vocalists in the band. The duo were hailed as \"the heirs to Lennon and McCartney's throne\" during the band's initial popularity in the late 1970s. The group formed in Deptford, London, in 1974, and first broke up in 1982. Squeeze then reformed in 1985, and disbanded again in 1999.", "The band's founding members in March 1974 were Chris Difford (guitar, vocals, lyrics), and Glenn Tilbrook (vocals, guitar, music). Difford claims that in 1973, he stole 50p from his mother's purse to put a card in a local sweetshop window to advertise for a guitarist to join his band, although he was not actually in a band at the time. Tilbrook was the only person who responded to the advert. Difford and Tilbrook began writing songs together, and soon added Jools Holland (keyboards) and Paul Gunn (drums) to form an actual band. The group performed under several names, most frequently \"Captain Trundlow's Sky Company\" or \"Skyco\", before selecting the band name \"Squeeze\" as a facetious tribute to the Velvet Underground's oft-derided 1973 album Squeeze.", "For the 1998 album Domino, the band was again a quintet consisting of Difford, Tilbrook, bassist Hilaire Penda, ex-Del Amitri drummer Ashley Soan, and yet another returning keyboardist in the person of Christopher Holland. Nick Harper often performed with this version of Squeeze as a guest touring musician, providing additional guitar and vocals. In January 1999, just days before a planned tour, Chris Difford suddenly announced that he was taking a \"hiatus\" from Squeeze. The last venue at which Squeeze played with Difford was at The Charlotte, Leicester, England. The band subsequently continued as a quartet led by Tilbrook, with Jim Kimberley replacing Soan on some tour dates, and Christopher Holland exiting in the autumn to be replaced by Tilbrook's other frequent writing partner Chris Braide.", "*Chris Difford – rhythm guitar, vocals "]}, {"page": "Beatlesque", "response": ["*Squeeze – The British band's songwriting pair Chris Difford and Glenn Tilbrook have attracted comparisons to the Lennon–McCartney partnership."]}, {"page": "1954 in music", "response": ["*November 4 – Chris Difford, singer, songwriter and record producer (Squeeze)"]}, {"page": "The Old Grey Whistle Test", "response": ["Harris chatted to Whistle Test alumni, including Gary Numan, Dave Stewart, Joan Armatrading, Ian Anderson, Toyah Willcox, Dennis Locorriere, Chris Difford and Kiki Dee, as well as fan Danny Baker."]}, {"page": "Judie Tzuke", "response": ["In 2018, Tzuke joined with Beverley Craven and Julia Fordham to record \"Safe\", a song that she had written with Beth Nielsen Chapman, whilst on a Chris Difford songwriting retreat. Following the success of the single, which was well received, an album was released titled Woman to Woman, together with a tour of the same name in late 2018 with 20 of 22 dates sold out. Several dates at larger venues included orchestras. The planned April 2019 second leg of the tour was postponed due to chemotherapy treatment Beverley Craven undertook following a double mastectomy. The tour was rescheduled for June 2019."]}, {"page": "Sailing to Philadelphia", "response": ["Sailing to Philadelphia is the second solo studio album by British singer-songwriter and guitarist Mark Knopfler, released on 26 September 2000 by Vertigo Records internationally, and by Warner Bros. Records in the United States. The album contains featured vocal performances by James Taylor,  Van Morrison, and Chris Difford and Glenn Tilbrook of Squeeze.", "* Glenn Tilbrook and Chris Difford – vocals (International 6)"]}, {"page": "East Side Story (Squeeze album)", "response": ["In the studio, Costello, in the line of his longtime producer Nick Lowe, served more as a creative advisor while Bechirian handled the technical aspect of production. Bechirian explained, \"Elvis sat there and pontificated a lot about this, that, and the other and I got on with getting the stuff down and rallying the band. I mean, Elvis did have an influence to some extent, but it wasn't that great\". Chris Difford spoke glowingly of Costello's influence, saying, \"I was in complete awe of working with him. It was a great challenge to come in every day with a lyric that would be better than the one he might come up with. ... I could tell which were the weak ones just by looking at his face\".", "In 1989, the Toronto Star music critics took a look over the albums they had reviewed in the past four years to include in a list based on \"commercial impact to social import, to strictly musical merit.\" East Side Story was placed at number 2 on the list, only being beaten by Thriller by Michael Jackson. The Toronto Star went on to note that \"songwriters Chris Difford and Glenn Tilbrook hit their creative peak in 1981, grafting Motown rhythms, country melodies and close harmonies onto a nervy New Wave soundtrack. At once ironic and sentimental, East Side Story is a masterpiece of kitchen-sink drama, from the shattered war bride in \"Labelled With Love\" to the harried housewife of \"Woman's World\".\" The New York Times praised the album as an \"exceptionally satisfying pop record\".", "All tracks written by Chris Difford and Glenn Tilbrook except where noted.", "*Chris Difford – rhythm guitar, backing vocals, lead vocal on \"Someone Else's Heart\" and \"Heaven\""]}, {"page": "Frank (Squeeze album)", "response": ["All songs written by Chris Difford and Glenn Tilbrook except as indicated.", "*Chris Difford – guitar, backing vocals; lead vocals on 5, 8"]}, {"page": "Sweets from a Stranger", "response": ["Sweets from a Stranger is the fifth studio album by the British new wave group Squeeze, released in May 1982 through A&M. The album peaked at number 20 in the UK Albums Chart. The band split up soon after a world tour for the record, and the two main songwriters went on to record 1984's Difford & Tilbrook. Squeeze reunited and released Cosi Fan Tutti Frutti in 1985. As with all Squeeze albums, Chris Difford wrote the words first and Glenn Tilbrook would write the music afterwards often editing Difford's material to create a streamlined narrative. Tilbrook would record a demo afterwards and play it for Difford.David Bailey, CD notes for expanded edition of \"Sweets For A Stranger\" 2008", "All songs written by Chris Difford and Glenn Tilbrook.", "*Chris Difford – rhythm guitar, backing vocals, lead vocals on \"His House Her Home\""]}, {"page": "Imperial Bedroom", "response": ["# \"Boy with a Problem\" (music: Costello; lyrics: Chris Difford; additional lyrics: Costello) – 2:12"]}, {"page": "Squeeze (Squeeze album)", "response": ["Chris Difford's approach to writing the lyrics for the album was different as well. According to an interview with Bud Scoppa, Difford found the process of working with their producer John Cale to be challenging: \"I remember, he came up and said, 'Lyrically, you’re quite soft; have you ever thought about writin’ about musclemen?' I said, 'That’s never occurred to me, actually.' And he said, 'Well, go away and do it – I wanna see songs like that on the album.' So my perception of what the band was at that point was completely different from the way he saw it, obviously.  He had us doing some awfully strange things.\"", "All songs written by Chris Difford and Glenn Tilbrook except as indicated.", "*Chris Difford – rhythm guitar, vocals"]}, {"page": "María Elena Holly", "response": ["In 2010, Santiago-Holly co-founded, with Peter Bradley, the Buddy Holly Educational Foundation. The foundation is a charitable corporation whose mission is to keep Buddy Holly's legacy alive by providing musical education to new generations regardless of income, ethnicity or educational limitations. Among the areas in the musical education provided are songwriting, production, arranging, orchestration and performance education. The Buddy Holly Educational Foundation co-hosts worldwide songwriting retreats with Chris Difford. They are organized by Peter Bradley Jr, board Director of the Buddy Holly Educational Foundation."]}, {"page": "While My Guitar Gently Weeps", "response": ["Rolling Stone ranked \"While My Guitar Gently Weeps\" 136th on its list of \"The 500 Greatest Songs of All Time\", seventh on the \"100 Greatest Guitar Songs of All Time\", and at number 10 on its list of \"The Beatles 100 Greatest Songs\". Clapton's performance was ranked 42nd in Guitar Worlds 2008 list of the \"100 Greatest Guitar Solos\". Among other critics' lists of the best Beatles songs, Paste magazine and Ultimate Classic Rock each ranked it at number 4, while Mojo placed it at number 17. In his commentary for the Mojo selection, English songwriter Chris Difford said that he had only come to fully appreciate the lyrics following Harrison's death in 2001; describing them as a \"riposte\" to Harrison's bandmates, particularly Lennon and McCartney, Difford added: \"George was the one who came back from India with the spiritual awakening and carried it through to the rest of his life, whereas the others came back with the postcards.\" In 2018, the music staff of Time Out London ranked \"While My Guitar Gently Weeps\" 20th on their list of the best Beatles songs. Coinciding with the 50th anniversary of the White Album's release, Jacob Stolworthy of The Independent listed it at number 1 on his ranking of the album's 30 tracks. He said the song was \"hands down one of The Beatles' greatest\" and, having been conceived through \"disharmony – in the world, as well as in the band he'd grown up with\", \"testament to Harrison's genius\"."]}, {"page": "Boo Hewerdine", "response": ["In 1985 Hewerdine, working once again in a record shop in Cambridge (The Beat Goes On), formed The Bible with jazz drummer Tony Shepherd, later recruiting former Great Divide bandmate Kevin Flanagan.Ankeny, Jason \"Boo Hewerdine Biography\", Allmusic. Retrieved 30 December 2012Cobley, Mike (2008) \"Chris Difford & Boo Hewerdine Set To Link Up @ Komedia\", The Brighton Magazine, 27 March 2008. Retrieved 30 December 2012Schulps, Dave \"The Bible/Boo Hewerdine & Darden Smith\", The Trouser Press Record Guide. Retrieved 30 December 2012Buckley, Peter (2003) The Rough Guide to Rock, Rough Guides, , pp. 88–89Hornby, Nick (2003) 31 Songs, Penguin,  They released an album of songs in 1986 through the independent Norwich label Backs Records called Walking The Ghost Back Home.", "In 2010 he appeared with Chris Difford and Justin Currie on BBC Four programme Songwriters' Circle.Hodgkinson, Will (2010) \"Tonight's TV highlights\", The Guardian, 8 October 2010. Retrieved 31 December 2012", "Hewerdine first performed with Cambridge-based American guitarist Brooks Williams in 2010 after adding him to the bill of his annual Christmas show in his home town of Ely at the last minute when guests Chris Difford and Barry McGuigan were unable to attend due to weather conditions.Wood, Michael (2012) \"Chance creates the perfect Union\", Birmingham Mail, 23 November 2012. Retrieved 30 December 2012 In 2011, Hewerdine teamed up with Williams to form the band State of the Union.\"State of the Union, Selby Town Hall, December 15\", York Press, 7 December 2012. Retrieved 30 December 2012 Their plan was to record an album using vintage microphones and equipment live at Kyoti Studio with Mark Freegard Glasgow studio in just five days, although they completed the album in only a day and a half.Bruce, Keith (2012) \"State of the Union, State of the Union (Reveal Records)\", Glasgow Herald, 11 April 2012. Retrieved 31 December 2012  They followed the album with the EP Rent, the title track of which (a cover version of the Pet Shop Boys' song) was performed on The Andrew Marr Show in December 2012.\"Music on Marr: State of the Union\", BBC, 9 December 2012. Retrieved 31 December 2012", "His other production work includes albums with The Corrs, Heidi Talbot, and Laurie Freelove.\"Boo Hewerdine\", ABC, 2002. Retrieved 30 December 2012Foege, Alec (1991) \"Born Freelove\", Spin, November 1991, p. 36. Retrieved 30 December 2012Pareles, Jon (1991) \"Review/Pop; Drawing the Listener Into Dreamscapes\", The New York Times, 26 November 1991. Retrieved 31 December 2012Long, Siobhan (2009) \"Heidi Talbot, John McCusker and Boo Hewerdine\", The Irish Times, 9 October 2009. Retrieved 31 December 2012  He co-wrote and produced Chris Difford's 2008 album The Last Temptation of Chris.Bray, Elisa (2007) \"The 5-Minute Interview: Chris Difford, Musician\", The Independent, 9 January 2007. Retrieved 31 December 2012"]}, {"page": "I'm with Stupid (album)", "response": ["* Chris Difford – Backing Vocals (2,10,11)", "Glenn Tilbrook and Chris Difford from the band Squeeze appear as background vocalists and musicians on \"That's Just What You Are\", \"Frankenstein\", and \"It's Not Safe\", and they allowed Mann to use a riff from their song \"Up the Junction\" on \"Long Shot\".  Juliana Hatfield provides backing vocals on \"You Could Make a Killing\" and \"Amateur.\"  Neil Innes, from The Bonzo Dog Doo Dah Band, Monty Python and The Rutles, provides backing vocals on \"It's Not Safe\"."]}, {"page": "Liverpool Institute for Performing Arts", "response": ["*2017: Woody Harrelson; Chris Difford; John Caird; Jon Burton; Kay Hilton; Jo Collins; Mary Ward; Jon Driscoll. Tony Wood was also presented as an honoured friend."]}, {"page": "Glenn Tilbrook", "response": ["Glenn Martin Tilbrook (born 31 August 1957) is the lead singer and guitarist of the English band Squeeze, a band formed in the mid-1970s who broke through in the new wave era at the decade's end. He generally wrote the music for Squeeze's songs, while his writing partner, Chris Difford, wrote the lyrics. In addition to his songwriting skills, Tilbrook is respected both as a singer and an accomplished guitarist.  He was born in Woolwich, London.", "During Squeeze's first hiatus, from approximately 1983 to 1985, Tilbrook wrote, recorded, and toured with Chris Difford, his songwriting partner from Squeeze. Their album, Difford & Tilbrook was originally released in 1984, and remastered and reissued in 2006."]}, {"page": "Louise Goffin", "response": ["In 2008, Goffin launched her own label Majority Of One Records to put out her first independent release, the eight-song Bad Little Animals. She has continued to release her recordings through Majority Of One, including Songs From The Mine, which features backing vocals from Alice Cooper and Johnny Depp on \"Watching The Sky Turn Blue\"; Appleonfire, a tribute EP to her late father; The Essential Louise Goffin, Vol. 1, combining highlights from her previous three records with new recordings; and many singles. Her album All These Hellos, co-produced with Dave Way and featuring performances by Chris Difford from Squeeze, Rufus Wainwright, Van Dyke Parks and Billy Harvey, was released in fall 2018. Her subsequent album Two Different Movies, released in 2020, was also co-produced by Dave Way and featured contributions from Billy Harvey, Van Dyke Parks, Benmont Tench, and Greg Leisz. The album cover art is a sketch of Louise drawn by Joni Mitchell."]}, {"page": "Charity record", "response": ["|\"NHS Voices\": Alexandra Burke, Ali Campbell, Astro, Aston Merrygold, Ben Willis, Beverley Knight, Blue, Chris Difford, Coleen Nolan, Danny Jones, Dennis Greaves, Engelbert Humperdinck, Gabrielle, Gary Stringer, Glenn Tilbrook, Guy Garvey, HRVY, Jack and Tim, Lewisham and Greenwich NHS Choir, Louisa Johnson, Marina and the Diamonds, Mark Feltham, Mark King, Myleene Klass, Nile Rodgers, Rick Astley, Seal, Simon Hanson, Tom Smith, Tony Hadley, Una Healy"]}, {"page": "Get Happy!! (Elvis Costello album)", "response": ["Squeeze guitarist Chris Difford named the album as an inspiration, stating, \"Get Happy!! was a big album for me. I just loved the lyrics. I loved the performances on that record. It’s brilliant.\" Costello would produce Squeeze's 1981 album East Side Story."]}, {"page": "Trust (Elvis Costello album)", "response": ["# \"Boy with a Problem\" (solo demo version) (Costello, Chris Difford) – 2:31"]}, {"page": "Golden Globe Award for Best Original Song", "response": ["* \"The Flame Still Burns\" performed by Chris Difford, Marti Frederiksen and Mick Jones – Still Crazy"]}, {"page": "Cool for Cats (album)", "response": ["All songs written by Chris Difford and Glenn Tilbrook except \"Hop, Skip & Jump\", by Difford and Jools Holland.", "* Chris Difford – composer, guitar, rhythm guitar, vocals"]}, {"page": "Argybargy", "response": ["Argybargy is the third album by the UK new wave band Squeeze. Written and recorded after the band's successful sophomore release, Cool for Cats, the album's lyrics were written by Chris Difford while living with his wife in New York City. The band reunited with Cool for Cats producer John Wood and, after Glenn Tilbrook composed music for Difford's new lyrics, recorded the album in late 1979.", "Following the Cool for Cats tour, Chris Difford married and spent the summer of 1979 in the US with his wife. There he wrote over forty new lyrics, inspired by his new marriage and his time spent in Greenwich Village. He recalled, \"I would sit in the flat all day while [wife] Cindy went to work and this fluidity of lyricism came gushing forth. The whole of the Argybargy album came in one fell swoop and lots more besides that never saw the light of day.\"", "* Chris Difford – rhythm guitar, vocals, lead vocal on \"Here Comes That Feeling\", co-lead vocals on \"If I Didn't Love You\" & \"I Think I'm Go Go\""]}, {"page": "David Jackson (rock musician)", "response": ["David Jackson was born in Stamford, Lincolnshire. His daughter is singer Dorie Jackson, who works with Chris Difford, Francis Dunnery and William Topley among others. His son is recording engineer Jake Jackson."]}, {"page": "Squeeze (The Velvet Underground album)", "response": ["In recent years however, the album has been revisited by both critics and musicians with more sympathetic and favorable reviews.  In 2011 music writer Steven Shehori included Squeeze in his \"Criminally Overlooked Albums\" series for The Huffington Post, and in a lengthy review of the album, offered the following positive assessment of Squeeze: \"if you pluck it from the shackles of its murky back-story, Squeeze is nothing short of a quintessential listening experience.\" The UK band Squeeze took their name from its title according to band member Chris Difford, who also offered the following opinion of the album in a 2012 interview: \"It's an odd record, but the name came from that, definitely. […] In a retrospective way I really enjoy it. It has kind of a naivety about it\". In 1995, Doug Yule described the recording of Squeeze being \"like the blind leading the blind, me leading myself. That's what came out of it, I don't even have a copy of it. But it's kind of a nice memory for me and kind of an embarrassment at the same time. I wish I had my eyes wider open, but it was nice to get my name and my songs out there.\""]}, {"page": "Magnolia (soundtrack)", "response": ["The song \"One\", written by Harry Nilsson and originally made popular by Three Dog Night, is played during the first five minutes of the movie, and contains several obscure musical references to other Nilsson songs. It opens with a sample of Nilsson saying \"Okay, Mr. Mix!\" taken from the start of his song \"Cuddly Toy\". This version of the song also includes lyrics from Nilsson's song \"Together\" sung in the background. (\"Life isn't easy when two are divided / and one has decided / to bring down the curtain / and one thing's for certain / there's nothing to keep them together.\"). Furthermore, the opening vocal motif from Nilsson's song \"Good Old Desk\" is used as a background vocal line (at approximately 1:54 into the song). Neil Innes, from The Bonzo Dog Doo Dah Band and The Rutles, and Chris Difford of Squeeze provide backing vocals. This track originally appeared on the For the Love of Harry: Everybody Sings Nilsson tribute album."]}, {"page": "Cosi Fan Tutti Frutti", "response": ["Cosi Fan Tutti Frutti is a 1985 album by the British new wave group Squeeze. It is the band's sixth album, and the first recorded since their breakup in 1982. It reunited songwriters Glenn Tilbrook and Chris Difford with drummer Gilson Lavis and keyboardist Jools Holland (now credited as \"Julian\"). Keith Wilkinson, who played bass on the 1984 Difford & Tilbrook album, joined Squeeze for the first time. He would stay with the band for over a decade, making him the longest-lasting bassist in Squeeze's history. Laurie Latham produced the album. The album peaked at number 31 in the UK Albums Chart.", "All songs written by Chris Difford and Glenn Tilbrook except as indicated. The time listed in parenthesis indicates the version used on the 1997 remaster.", "*Chris Difford – guitar, backing vocals (lead vocal on Track 9)"]}, {"page": "Babylon and On", "response": ["The album was released in September 1987 and gave them their biggest US hit single, \"Hourglass.\" The song became an unexpected US hit for the band, reaching number 15 on the Billboard Hot 100, which Chris Difford attributed to the video for the song as much as the song itself: \"I would think that the video has had a lot to do with it.  It’s been played a lot, and everybody you speak to compliments you on it.  When you meet fans after gigs, they say, “Your video’s great.”  They don’t say, “Your album’s great.”  So it’s the first thing they think of.\"Bud Scoppa with Darryl Morden Music Connection, 25 January 1988", "All songs written by Chris Difford and Glenn Tilbrook.", "*Chris Difford – guitar, backing vocals, lead vocal on 8, co-lead vocal on 3"]}, {"page": "Play (Squeeze album)", "response": ["All songs written by Chris Difford and Glenn Tilbrook.", "*Chris Difford – guitar, backing vocals"]}, {"page": "Some Fantastic Place", "response": ["Some Fantastic Place is the tenth studio album by the British new wave group Squeeze, released in 1993 by A&M Records. Their first album since the departure of original Squeeze drummer Gilson Lavis, it features Pete Thomas and the brief return of keyboardist/vocalist Paul Carrack, who had previously appeared on East Side Story (1981). \"Loving You Tonight\" became only the second Squeeze song cut in thirteen years to feature Carrack singing a lead part. Additionally, bassist Keith Wilkinson wrote and sang \"True Colours (The Storm)\", the first song on a Squeeze album not written by Glenn Tilbrook, Chris Difford, Jools Holland, or any combination of those three.", "The album features a pop rock style and was produced by Squeeze and Peter Smith. Recorded in Tilbrook's recently built personal studios, the recording sessions involved a larger deal of debate concerning song structures, which the band said helped contribute towards the album's passionate sound. Unusually, Glenn Tilbrook and Chris Difford wrote songs together rather than apart, which they suggested helped revitalise their working relationship. The album was released to critical acclaim, and the title track remains Difford and Tilbrook's favourite Squeeze song. The album reached number 26 in the UK Albums Chart.", "Squeeze, at the time consisting of songwriters Chris Difford and Glenn Tilbrook and bassist Keith Wilkinson, originally intended to record Some Fantastic Place as a trio with the addition of programmed drum and keyboard instruments, but ultimately opted to add several members. When Difford and Tilbrook were performing an acoustic show, they noticed Paul Carrack, who had been with the band for less than a year in 1981 and had played keyboards on East Side Story while singing its hit single \"Tempted\", was nearby. They asked him to open live for them, thinking it would be unlikely, but nonetheless he agreed. When the band were rehearsing for Some Fantastic Place, Difford suggested the band readmit Carrack into the band, which they put \"to the test\". Difford later said \"it's worked out marvellously.\"", "All songs written by Chris Difford and Glenn Tilbrook except as indicated.", "*Chris Difford – backing vocals; guitar on 3, 5, 6, 7, 9"]}, {"page": "Ridiculous (album)", "response": ["Ridiculous is an album by the British new wave group Squeeze. It was the band's eleventh studio album, and it introduced their latest drummer Kevin Wilkinson (no relation to bassist Keith Wilkinson). As on the previous album, Some Fantastic Place, the band recorded one song penned by Keith Wilkinson. This time, however, Wilkinson did not perform the lead vocals. That song, \"Got to Me\", is the last Wilkinson would write with Squeeze. Chris Difford sang lead on two songs, \"Long Face\" and \"Fingertips\". He had not performed lead on an album cut since \"Slaughtered, Gutted and Heartbroken\" and \"Love Circles\" on the 1989 album Frank. This record was produced by Glenn Tilbrook and Peter Smith.", "All songs written by Chris Difford and Glenn Tilbrook except as indicated.", "*Chris Difford – guitar, backing vocals"]}, {"page": "Domino (Squeeze album)", "response": ["Domino is a 1998 album by the British new wave group Squeeze. It was the band's twelfth studio album. After a career struggling with various major record labels, the band decided to record and release Domino independently, on Glenn Tilbrook's own Quixotic Records. Core members Tilbrook and Chris Difford were joined by three brand new Squeeze members for this album: drummer Ashley Soan, bassist Hilaire Penda, and keyboardist Christopher Holland (Jools's younger brother).", "All songs written by Chris Difford and Glenn Tilbrook.", "*Chris Difford – rhythm guitar, vocals"]}, {"page": "Take Me I'm Yours", "response": ["\"Take Me I'm Yours\" is the debut single by English new wave band Squeeze. It established the band's trademark vocal style, with Chris Difford singing an octave lower than Glenn Tilbrook.", "Category:Songs written by Chris Difford"]}, {"page": "Goodbye Girl (Squeeze song)", "response": ["Category:Songs written by Chris Difford"]}, {"page": "Cool for Cats (song)", "response": ["\"Cool for Cats\" was the second single released from the English rock band Squeeze's Cool for Cats album. The song features a rare lead vocal performance from cockney-accented Squeeze lyricist Chris Difford, one of only three occasions he sang lead on a Squeeze single A-side (the others were 1979's \"Slap & Tickle\" and 1989's \"Love Circles\") The song, slightly edited from the album track, peaked at No. 2 on the UK Singles Chart in 1979, making \"Cool for Cats\" one of the band's biggest hits.", "* Chris Difford – rhythm guitar, lead vocals", "Category:Songs written by Chris Difford"]}, {"page": "Up the Junction (song)", "response": ["Up the Junction is also the name of a collection of short stories by Nell Dunn, first published in 1963. Lyricist Chris Difford said that the title phrase was lifted from the 1965 TV play version of the work, directed by Ken Loach, and the subsequent 1968 movie version. The film had a soundtrack by Manfred Mann, and a song by them, also called Up the Junction.", "Chris Difford wrote the lyrics in New Orleans while Squeeze were on tour. Difford passed the lyrics to Glenn Tilbrook who then wrote the music. The song is known for its use of half-rhymes, such as \"ready\" and \"telly\" or \"kitchen\" and \"missing\". The title is not sung until the final line. Difford has been quoted as saying that he took the lead from Roxy Music's Virginia Plain, in which the title also appeared only at the end. Glenn Tilbrook has said that the music was partly inspired by the Bob Dylan song Positively 4th Street, and the lack of a chorus or lyrical repetitionunusual in a mainstream pop hitwas due to Tilbrook feeling that a repeated section would upset the flow of Difford's narrative lyrics.", "Category:Songs written by Chris Difford"]}, {"page": "Slap and Tickle", "response": ["\"Slap And Tickle\" was the fourth and final single released from Squeeze's second album, Cool for Cats. Co-written by Chris Difford and Glenn Tilbrook, the song took influence lyrically from the crowd that the band had been associating with at the time. Its synth-heavy arrangement was inspired by Kraftwerk and Giorgio Moroder.", "\"Slap and Tickle\" was co-written by Chris Difford and Glenn Tilbrook. On \"Slap and Tickle\", Difford took lyrical inspiration from the \"seedy crew\" that the band had become friendly with when they became successful. Difford explained, \"I loved being with them because they were the kind of people I'd shied away from at school. Now I had the authority of being in a successful band, I was hanging out with them.\" Difford also cited the lyrical style of Ian Dury and future Squeeze producer Elvis Costello as influences in developing the song's rhymthic metre. \"Slap and tickle\" is a British euphemism for sexual activity.", "Category:Songs written by Chris Difford"]}, {"page": "Ist (band)", "response": ["In 2008, Kenton Hall from Ist was one of the co-writers of Chris Difford's Christmas single for BBC1's The One Show, \"Let's Not Fight This Christmas\". Songs co-written by Hall have also appeared on releases from other artists, including the song \"Grace\" on Madelaine Hart's \"LAA\" EP, released on the Creative Commons label modifythevan. He is currently working on songs with a number of other artists, including Chaz Jankel."]}]}}