{"wiki_id": "http://www.wikidata.org/entity/Q5107384", "itemLabel": "Chris McCart", "itemDescription": "Scottish footballer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_McCart", "wikipedia_page": {"main": "Christopher McCart (born 17 April 1967 in Baillieston) is a Scottish former footballer who played as a defender.", "link_mentions": [{"page": "Celtic F.C.", "response": ["|Head of Youth Academy || Chris McCart"]}, {"page": "Scotland national football B team", "response": ["|Chris McCart"]}, {"page": "Rob McKinnon", "response": ["In January 1992 McKinnon returned to Scotland and joined Scottish Premier Division club Motherwell. He formed part of a strong team built by manager Tommy McLean and his successor Alex McLeish - Motherwell achieved third place in 1993–94 and were runners-up in 1994–95, and McKinnon gained international recognition along with teammates Chris McCart, Brian Martin and Paul Lambert."]}, {"page": "Dougie Arnott", "response": ["On 11 September 2008, Arnott's belated testimonial match went ahead against an Old Firm select. Other players lined up for Arnott's side included former goalkeeper Sieb Dijkstra and defenders Chris McCart and Fraser Wishart, while the Old Firm team included Ally McCoist and Gordon Durie. The Old Firm side won 5–4, in a game which saw Arnott score the first of the match, and Ally McCoist net a hat-trick.Dougie Arnott stats "]}, {"page": "1991 Scottish Cup Final", "response": ["|DF |||| Chris McCart"]}, {"page": "Celtic F.C. Under-20s and Academy", "response": ["|Head of Youth Academy || Chris McCartCeltic youth chief Chris McCart tells the secrets behind the 7 academy graduates to make Scotland history Michael Gannon, Daily Record, 20 November 2020"]}, {"page": "James Forrest (footballer, born 1991)", "response": ["On 30 August 2009, Forrest signed a four-year contract with Celtic. Their Head of Youth development, Chris McCart, hailed him as one of the best players in Celtic's U19 squad. Forrest had always excelled at Celtic, with a match program from 2004 singling him out for exceptional performances in the under-13 squad. He made his first team debut for Celtic on 1 May 2010, coming on as a late substitute against Motherwell. He scored the third of Celtic's goals in a 4–0 win."]}, {"page": "McCart", "response": ["*Chris McCart (born 1967), Scottish footballer"]}, {"page": "1996–97 Motherwell F.C. season", "response": ["| Chris McCart"]}, {"page": "Jamie McCart", "response": ["He is the son of former Motherwell defender Chris McCart, who is now the Head of Celtic's Youth Academy."]}, {"page": "Christopher Mccart", "response": ["#REDIRECT Chris McCart"]}]}}