{"wiki_id": "http://www.wikidata.org/entity/Q5109983", "itemLabel": "Christian O'Connell", "itemDescription": "British radio personality and DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Christian_O%27Connell", "wikipedia_page": {"main": "Christian Liam O'Connell (born 7 April 1973 in Winchester, Hampshire) is a British-Australian radio disc jockey, television host, writer and comedian who presents The Christian O'Connell  Breakfast Show on weekday mornings on Gold 104.3 in Melbourne and the Christian O'Connell Show on weekday evenings on Gold 104.3 in Melbourne, 101.7 WSFM in Sydney, 97.3 FM in Brisbane, Mix 102.3 in Adelaide and 96FM in Perth. He previously presented The Christian O'Connell Breakfast Show on Virgin Radio on weekday mornings from March 2006 which became Absolute Radio in September 2008 until May 2018.\nHe has won a record-breaking number of radio awards, including 11 Sony Radio Academy Gold awards, the Radio Academy Gold Award in May 2018 and runner up in the Crabbie's Ginger Wine Grand National in 2014. In 2014 he was the youngest radio presenter to be inducted into the UK Radio Academy Hall of Fame. He has performed three sold-out tours of the International Edinburgh Fringe Comedy festival in 2013. 2014 and 2015.  In September 2008 he published a book The Men Commandments (Harper Collins) and in 2017 he published a children's book \"Radio Boy\" (Harper Collins){{Citation needed|date=December 2011}, which was Oxfam's most-donated children's book of the year in 2017. He is a popular international guest speaker and has collaborated with European, Australian and US radio shows. He hosted the MacMillan Cancer comedy show at the London Palladium 2016 and the Stand Up to Cancer show at the London Palladium in November 2017. He has hosted the Q Awards between 2013 and 2017.\nIn February 2018, O'Connell announced he would be leaving Absolute Radio and emigrating to Australia to host the Gold 104.3 breakfast programme in Melbourne. He left The Christian O'Connell Breakfast Show on 18 May 2018, before starting the new breakfast show on Gold 104.3 on 4 June 2018, featuring his long-running quiz 'Yay or Neigh'.In April 2020, ARN announced that The Christian O'Connell Show will be syndicated across the country from Monday 27 April, airing for one hour from 7PM until 8PM on weeknights on Gold 104.3 in Melbourne, WSFM in Sydney, 97.3 FM in Brisbane, Mix 102.3 in Adelaide and 96FM in Perth.", "link_mentions": [{"page": "April 7", "response": ["*  1973   – Christian O'Connell, British radio DJ and presenter"]}, {"page": "1973", "response": ["* April 7 – Christian O'Connell, British radio DJ and presenter"]}, {"page": "Dorking", "response": ["* Absolute Radio DJ Christian O'Connell lived in Dorking for several years until 2018."]}, {"page": "Peter Symonds College", "response": ["* Christian O'Connell—Radio presenter on The Christian O'Connell Breakfast Show on Absolute Radio"]}, {"page": "Chris Evans (presenter)", "response": ["In August 2002 Chris Evans set up a radio and television production company, UMTV, with the aim of specialising in live, cutting-edge, entertainment programming. Over the next 3 years UMTV produced more than 375 hours of television, with mixed success. TV shows included Boys and Girls hosted by Vernon Kay for Channel 4, Johnny Vegas: 18 Stone of Idiot for Channel 4 / E4; OFI Sunday for ITV; Live with Christian O'Connell and Live with Chris Moyles for Five; and the BAFTA award-winning School of Hard Knocks for 4 Learning."]}, {"page": "Graham Coxon", "response": ["In March 2006 he released his sixth solo album, called Love Travels at Illegal Speeds, again produced by Stephen Street. It marked Coxon's first album away from his now-defunct indie label 'Transcopic'. The LP was preceded by the singles \"Standing on My Own Again\" on 27 February and \"You & I\". Coxon embarked on a tour of the UK, starting at Newcastle University. He was also involved in a single supporting the England national football team at the 2006 FIFA World Cup. The song was a re-working of the Sham 69 hit \"Hurry Up Harry\", and was released as \"Sham 69 and The Special Assembly\" (as well as Coxon and Sham 69, Virgin Radio DJ Christian O'Connell, who had run a competition on his show to find a band to record a song in support of the team, was involved in the recording of the song). \"Hurry Up England\" entered the UK Singles Chart at No. 10."]}, {"page": "Chris Moyles", "response": ["Moyles has branched out his work into television. In 2002, his own Channel 5 show, Live With Chris Moyles, ran five shows a week for 13 weeks. Chris was replaced by Christian O'Connell, before the programme was shelved altogether."]}, {"page": "Nottingham Trent University", "response": ["* Christian O'Connell – Broadcaster"]}, {"page": "Brian Blessed", "response": ["In 1999, Blessed provided both the voice and live-action reference for the CGI character Boss Nass in Star Wars: Episode I – The Phantom Menace, and also provided the voice of the villainous hunter Clayton in Disney's animated feature film Tarzan, a role he later reprised in the video game based on the film and in the critically acclaimed Kingdom Hearts in 2002. He voiced \"Sir Morris\" in the 1999 cartoon series The Big Knights. He read the story \"The White City\" for the album series Late Night Tales, recording it in four parts released over four albums, and was also the voice of Jean Valjean in Focus on the Family Radio Theatre's audio adaptation of Victor Hugo's Les Misérables. Blessed was one of the narrators for Story Teller, a children's magazine partwork series in the 1980s. He has further provided vocal links for the Sony-Award-winning Christian O'Connell Breakfast Show on Virgin Radio, and introduced advertisements for Orange mobile phones."]}, {"page": "Absolute Radio", "response": ["Other past presenters on the network include Danny Baker, Robin Banks, Kelly-Anne Smith, Vicki Butler-Henderson, Robin Burke, Martin Collins, Gary Davies, Daryl Denham, Chris Evans (who also owned the station), Ben Jones, Neil Francis, Alan Freeman, Tony Hadley (from Spandau Ballet), Nicky Horne, Janey Lee Grace, Kevin Greening, Gary King, Jason King, Phil Kennedy, Jeremy Kyle, Allan Lake, Iain Lee, Geoff Lloyd, Tim Lovejoy, James Merritt, Pete Mitchell, Al Murray, Christian O'Connell, John Osborne, Lynn Parsons, Steve Penk, Annabel Port, Vic Reeves, Joel Ross, Jo Russell, Holly Samos, Harriet Scott, Tim Shaw, Graeme Smith, Suggs, David Tennant, Clive Warren, Ray Cokes, Dave Gorman and Pete Donaldson."]}, {"page": "Radio Academy Awards", "response": ["|The Christian O'Connell Breakfast Show with Wickes", "|Christian O'Connell", "|The Christian O'Connell Breakfast Show with Wickes", "|Fighting Talk, presented by Christian O'Connell", "|Christian O'Connell's Breakfast Show", "|Christian O'Connell's Rock School", "|Christian O'Connell's Breakfast Show", "|Christian O'Connell", "|Christian O'Connell's Breakfast Show"]}, {"page": "Hospital radio", "response": ["* Christian O'Connell - presenter, Gold 104.3"]}, {"page": "Dave Berry (presenter)", "response": ["In April 2017, Berry left Capital and subsequently has been replaced on the Capital Breakfast (London) show by Roman Kemp. He began presenting 4-7pm on Absolute Radio from 2 October 2017 with his co-host Matt Dyson. Berry also presented a 7-10pm show on Absolute Radio's sister station Absolute Radio 90s every Monday-Thursday. In March 2018, it was confirmed that Berry would replace Christian O'Connell as the host of the Absolute Radio Breakfast Show. Berry began presenting the Absolute Radio Breakfast Show on 4 June 2018 where he was joined by Dyson and the show's newsreaders Glenn Moore and Emma Jones. As of October 2019, The Dave Berry Breakfast Show had 2.2 million listeners, a record for the station."]}, {"page": "Capital Liverpool", "response": ["* Christian O'Connell"]}, {"page": "Lauren Laverne", "response": ["She became host of the XFM breakfast show on 31 October 2005 after Christian O'Connell moved to Virgin Radio, but left suddenly in April 2007 to pursue her television interests. However, Laverne went on to guest present on BBC Radio 2."]}, {"page": "Patrick Allen", "response": ["He was also the voice of the Christian O'Connell Breakfast Show on XFM, the late show on 103.2 Power FM, Hirsty's Daily Dose on Galaxy Yorkshire and briefly Virgin Radio."]}, {"page": "David Tennant", "response": ["In early 2009, Tennant narrated the digital planetarium space dome film \"We Are Astronomers\" commissioned by the UK's National Space Centre. On 13 March 2009, he presented Red Nose Day 2009 with Davina McCall. He joined Franz Ferdinand onstage to play the guitar on their song \"No You Girls\" on a special Comic Relief edition of Top of the Pops. In summer 2009, Tennant filmed St. Trinian's II: The Legend of Fritton's Gold. The film was released in December 2009. From October 2009, he hosted the Masterpiece Contemporary programming strand on the American Public Broadcasting Service. In December 2009, he filmed the lead in an NBC pilot, Rex Is Not Your Lawyer, playing Rex, a Chicago lawyer who starts to coach clients to represent themselves when he starts suffering panic attacks. The pilot was not picked up and the project was shelved. In November 2009, he co-hosted the Absolute Radio Breakfast Show with Christian O'Connell for three consecutive days. He returned to cohost the show for one day in October 2010. On 7 March 2010, he also appeared as George in a one-part BBC Radio 4 adaptation of Of Mice and Men in the Classic Serial strand. In October 2010 he starred as Dave, a man struggling to raise five children after the death of his partner, in the British drama Single Father. For this role he was nominated as Best Actor at the Royal Television Society Programme Awards 2010."]}, {"page": "Kevin Greening", "response": ["In June 2002, he joined London's Rock station XFM, sitting in for Christian O'Connell on the Breakfast Show.  One month later, he took over the station's mid-morning slot from 10am to 1pm, where he remained until December 2003."]}, {"page": "Radio X (United Kingdom)", "response": ["The station has employed a number of personalities that have since gone on to greater fame including Russell Brand, Karl Pilkington, Ricky Gervais, Stephen Merchant, Simon Pegg, Christian O'Connell, Justin Lee Collins, Adam and Joe, Alex Zane, Tim Lovejoy, Dermot O'Leary and Josh Widdicombe.", "Capital Radio attempted to increase XFM's listening figures, recruiting DJs such as Zoe Ball, former BBC Radio 1 presenter, and re-recruiting comedians Ricky Gervais and Stephen Merchant who took voluntary redundancy when Capital bought the station, after the pair rose to significance with the first airing of The Office. Together with talent such as Zane Lowe and Christian O'Connell, this yielded growing listening figures. The music was, and is today, a play-listed mix of popular indie and soft rock.", "*Christian O'Connell"]}, {"page": "Pete and Geoff", "response": ["On 28 November 2005 the duo announced that they were splitting up and leaving the Breakfast Show on Virgin Radio.  Their final show together took place on 16 December. Geoff Lloyd remained at Virgin Radio, hosting the Late Show, whilst Pete Mitchell left the station to pursue other projects. Christian O'Connell, from the Breakfast Show on Xfm London, replaced the pair as host of the Breakfast Show."]}, {"page": "Gold 104.3", "response": ["The current presenters include Christian O'Connell, Craig Huggins, Toni Tenaglia and Dave ‘Higgo’ Higgins.", "* Jun 2018–present – The Christian O'Connell Show"]}, {"page": "Geoff Lloyd", "response": ["In May 2005, the duo announced that they were splitting up, and left the breakfast show at the end of the year. Their final show together took place on 16 December 2005.Adam Bowie, \"A Brief History of Virgin Radio,\" adambowie.com, 12 March 2014. Virgin Radio programming director Paul Jackson called them \"great radio talents.\" The duo were replaced as hosts of the breakfast show by Christian O'Connell. Lloyd remained at Virgin Radio, taking over the late night slot."]}]}}