{"wiki_id": "http://www.wikidata.org/entity/Q5106998", "itemLabel": "Chris Jarvis", "itemDescription": "Children's television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Jarvis_(presenter)", "wikipedia_page": {"main": "Martin Christopher Jarvis (born 20 April 1969) is an English actor, presenter and writer who has appeared mainly on children's television for the BBC since 1992, apart from 2000–2002 when he was working with ITV and Channel 4. In 2019 he started a radio station for children called Little Radio.", "link_mentions": [{"page": "Brentwood School, Essex", "response": ["*Chris Jarvis (born 1969), television presenter"]}, {"page": "CBeebies", "response": ["* Chris Jarvis (2002-2009)", "From 3 April to 19 December 2004, each weekend afternoon was divided into five segments, which were presented by one of the then-current presenters, namely Chris Jarvis, Nicole Davis, Pui Fan Lee, Sidney Sloane, and Sue Monroe. Each was given a core theme (for instance Sid's segment included \"building and making\" programmes such as Bob the Builder, Sue's included arts and crafts theme programmes and so on). The five segments aired from 1:00 pm until 6:00 pm; the segmentation was later dispensed in December 2004, although the presenters still wore their respective colours for several months afterwards. They also cropped up in props used in links, such as coloured plates.", "A new strand entitled the Carrot Club was introduced in 2003, which had a female voiceover presenting where we are shown to toddlers running around and playing with toys. A new strand entitled Pic and Play was shown for the first time in June 2004, in which viewers contacted CBeebies via the website and other means to suggest programmes they would like to see. Also, in September 2005, a new strand called Bear and Butterfly launched, showing on weekend mornings. Presented by a cartoon bear (voiced by Chris Jarvis) and butterfly (voiced by Sue Monroe), and with an occasional appearance from a caterpillar, the characters interacted in an animated environment. They also showed pictures that had been sent in on their Message Tree.", "When these segments were initially introduced, each segment featured its own presenting team and set, with Chris Jarvis and Pui Fan Lee (Alex Winters and Cerrie Burnell after they left in January 2009) presenting Discover and Do in the CBeebies \"living room\"; Lunch Time in the \"kitchen\"; Bedtime Hour in the \"bedroom\"; Sidney Sloane (plus Andy Day when he joined the channel later in 2007) presenting Get, Set, Go! in the \"living room\" and Big Fun Time in the \"garage\". However, since moving production to Manchester this is no longer the case, with the exception of Bedtime Hour which is presented from the area nearest the house's bed."]}, {"page": "List of game show hosts", "response": ["| Chris Jarvis || United Kingdom || Look Sharp (1995–96), Jungle Run (2001–02), Maths Mansion (2002)"]}, {"page": "Sarah Thomas (actress)", "response": ["In December 2007, Thomas starred in Cinderella at the Assembly Hall Theatre, Tunbridge Wells as the Fairy Godmother, appearing with Tom Vaughan, from Hollyoaks, and Barney Harwood.  In 2008/09, she again starred as the Fairy Godmother in Cinderella, at the Grand Theatre in Swansea, alongside Su Pollard and Chris Jarvis."]}, {"page": "Debra Stephenson", "response": ["She would later appear in other CBBC programmes such as The Friday Zone (in which she was a regular presenter) and was a backing singer on Chris Jarvis's 1997 charity single \"Glasses\"."]}, {"page": "Pui Fan Lee", "response": ["Pui Fan Lee is a British actress and presenter. Along with Sue Monroe, Chris Jarvis, and Sidney Sloane she was one of the first CBeebies presenters. She is known for portraying Po in the original 1997–2001 run of the children's television series Teletubbies, and for presenting the CBeebies preschool education series Show Me Show Me.", "Lee was born in Birmingham, and grew up in Nottingham. She moved to London to study drama. She took on the role of Po shortly after leaving Drama school. She was the first presenter, alongside Chris Jarvis to introduce programming on the BBC digital channel CBeebies."]}, {"page": "Jungle Run", "response": ["Jungle Run is a British children's television adventure series that aired on CITV as part of the ITV network from 10 September 1999 to 29 November 2006. It was a game show similar to shows such as Fort Boyard and The Crystal Maze. The show has had three presenters, referred to as the \"Jungle Guide\": Dominic Wood from 1999 to 2000, Chris Jarvis from 2001 to 2002 and Michael Underwood from 2003 to 2006. It was recorded at the disused air base, RAF Newton, near Nottingham.", "| 3 || 22 October 2001 || 2 November 2001 || 10 || rowspan=\"2\" | Chris Jarvis"]}, {"page": "Catchphrase (British game show)", "response": ["In the Weir era, Chris Jarvis was the show's announcer and in the Curry daytime series, Peter Dickson took over the role in series 17."]}, {"page": "Paul Patterson (composer)", "response": ["CD releases have included The Three Little Pigs and Little Red Riding Hood, narrated by the TV presenter Chris Jarvis, with the London Philharmonic under David Parry, the Cello Concerto with Raphael Wallfisch and the South West German Chamber Orchestra (Pforzheim), Mass of the Sea with Ann Mackay, Christopher Keyte and the Royal Philharmonic Orchestra conducted by Geoffrey Simon, and his Phoenix Concerto with Emily Pailthorpe and the English Chamber Orchestra."]}, {"page": "Step Inside", "response": ["The only human character in the show is Mr Mopple (portrayed by Chris Jarvis), a groundsman. Whilst doing his jobs, Mr Mopple unknowingly hears a noise from the house which tells him there must be a story to be narrated. The house magically appears to come to life with a CGI face appearing on the house. As he steps inside, a face appearing on the outside wall saying, \"Step inside, all those who love stories, look, and listen, we've tales to tell, of fun, excitement, magic, adventure, tears, fears and laughter. Surprises as well. Step Inside.\""]}, {"page": "Fully Booked", "response": ["The fourth series had a new logo, title sequence and set introduced, along with a remix of the theme music. The presenters and characters of the show's previous incarnation were all removed, with a new presentation team consisting of Chris Jarvis, Gail Porter and Tim Vincent. The show continued to use the magazine format, with guests, games, features, inserts and music; however, the 'hotel' gimmick was largely dropped in favour of relatively straightforward magazine presentation.", "The show was still hosted by Kate Heavenor, but Chris Jarvis and Tim Vincent were not involved, and were replaced by Vernon Kay (previously a presenter on digital channel UK Play) and former Boyzone member Keith Duffy."]}, {"page": "Sit Down (song)", "response": ["The chorus of \"Sit Down\" was sung in the CBeebies programme Show Me Show Me, when trying to see which toy would come sit next to presenter Chris Jarvis, except the last line \"in sympathy\" was replaced with \"next to me\"."]}, {"page": "Underground Ernie", "response": ["* Dan and Sam (voiced by Chris Jarvis and Tim Whitnall) are Ernie's mischievous nephews, They like to cause a lot of trouble around the international underground.", "* City (voiced by Chris Jarvis) is Hammersmith's twin brother, and is also fast and furious, but is an expert in mathematics and finances (presumably a reference to the City, where many of the banks and financial businesses in London and the United Kingdom are based). He wears pink spectacles. Hammersmith and City are usually coupled back end to back and travel together as one train. ", "* Circle (voiced by Chris Jarvis) is a \"hippy chick\"—always helpful and rarely loses her cool.", "*Paris (voiced by Chris Jarvis) is from France. He's snooty, but kind."]}, {"page": "Chris Jarvis (children's TV)", "response": ["#REDIRECT Chris Jarvis (presenter)"]}, {"page": "Chris Jarvis", "response": ["Chris Jarvis may refer to:", "*Chris Jarvis (presenter) (born 1969), British presenter of children's television programmes", "*Chris Jarvis (actor) (born 1980), British actor best known for his role in The Bill", "*Chris Jarvis (rower) (born 1980), Canadian Olympic rower"]}, {"page": "Martin Jarvis", "response": ["* Chris Jarvis (presenter) (born 1970), née Martin Jarvis"]}, {"page": "Dream Street (British TV series)", "response": ["* Hot Rodney – a brash, naughty, and reckless hot rod car. In the episode \"Building Block Blunder\", he shows a helpful side by shunting the building blocks to allow Buddy and Hot-Air to get free after the blocks had collapsed. He has teal livery with flames. He is voiced by Chris Jarvis.", "* The Gossips – a pair of traffic lights respectively named Scarlet & Amber who like to make the road safe and sometimes cause serious accidents. They are smart and responsible too. They are both voiced by Chris Jarvis."]}, {"page": "Jarvis (name)", "response": ["* Chris Jarvis, several people including:", "** Chris Jarvis (presenter), British presenter of children's television programmes", "** Chris Jarvis (actor), British actor", "** Chris Jarvis (rower), Canadian Olympic rower"]}, {"page": "List of CBBC presenters", "response": ["| Chris Jarvis || 1993–97 ||"]}, {"page": "John Shuttleworth (character)", "response": ["* Fully Booked (BBC One, 1998) – Shuttleworth made a guest appearance on this Sunday morning CBBC show, at the instigation of co-presenter Chris Jarvis, a long time Shuttleworth fan"]}, {"page": "Wipeout (British game show)", "response": ["| 31 March 1999 || Jenny Powell, Les Dennis and Chris Jarvis"]}, {"page": "Show Me Show Me", "response": ["Show Me Show Me is a television show on CBeebies presented by Chris Jarvis and Pui Fan Lee. Aimed at pre-school children, the shows teach and show children and read stories about their toys. It began in 2009. Show Me Show Me is also available on BBC iPlayer.", "On 7 September 2016, cast member Chris Jarvis was alleged to have used profanity during a song about kites, sparking outrage among parents and resulting in the CBeebies Facebook page releasing a statement saying \"It's kite everyone, kite! We make shows for your little ones so it's always going to be kite.\""]}, {"page": "AIR 107.2", "response": ["AIR began streaming via its website on Wednesday 11 May 2011. The station was endorsed by many celebrities including Chris Evans, Jonathan Ross, Lorraine Kelly, Carol Vorderman, Chris Jarvis and many more."]}, {"page": "Sue Monroe", "response": ["Monroe presented and voiced and puppeteered Poppy the Cat in Playdays from 1990 to 1997. In February 2002, she became one of the first presenters on CBeebies, with Chris Jarvis, Sidney Sloane, and Pui Fan Lee. She voiced Tigs the Tiger in the CBeebies show The Shiny Show. In 2006, Monroe presented Wakey Wakey on GMTV."]}, {"page": "Justin's House", "response": ["* Chris Jarvis as Himself (S1-3)"]}, {"page": "List of continuity announcers in the United Kingdom", "response": ["| Eva Alexander, Cerrie Burnell, Nicole Davis, Justin Fletcher, Sarah-Jane Honeywell, Chris Jarvis, Pui Fan Lee, Sue Monroe, Ryan Russell, Sidney Sloane, Alex Winters"]}]}}