{"wiki_id": "http://www.wikidata.org/entity/Q5106958", "itemLabel": "Chris Huston", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Huston", "wikipedia_page": {"main": "Christopher John Huston (born 25 June 1943) is a British born record engineer, record producer and guitarist.\nHuston arrived in Wallasey, near Liverpool, toward the end of World War II from an orphanage in North Wales. As a teenager he began studies at the Liverpool College of Art, where he became friends with John Lennon and, like Lennon, began copying the American R&B music imported through the city. In 1961 he joined The Undertakers, one of the leading local Merseybeat bands, as lead guitarist, shortly before Jackie Lomax joined as the group's singer.The Undertakers released a string of singles in the early 1960s and toured widely, but had little chart success.  They split up in the United States in 1965, and Huston stayed behind.  Initially he toured as a member of Joey Dee and the Starliters, before linking up with The Young Rascals to start a new career as a record producer and engineer.As engineer, he won a gold disc for the Rascals' \"Groovin'\", and in the late 1960s engineered a string of successful albums with The Who, Led Zeppelin, Todd Rundgren, Patti LaBelle and H.P. Lovecraft.  He worked particularly extensively with Eric Burdon and War on their albums through the 1970s and 1980s, winning a Grammy Nomination for The World Is a Ghetto (1973).  He also worked with James Brown, Ben E. King and many others.Huston has subsequently become a consultant and lecturer on acoustics, building design, recording techniques and record production, based near Nashville, Tennessee.", "link_mentions": [{"page": "Led Zeppelin II", "response": ["The album used a wide variety of recording studios in the UK and the US. Some of these were ill-equipped; one studio in Vancouver, credited as \"a hut\", had an 8-track set-up without even proper headphone facilities. A more favourable set-up was Mystic Studios in Hollywood, Los Angeles with Chris Huston engineering. Lead singer Robert Plant later complained that the writing, recording, and mixing sessions were done in many different locations, and criticized the writing and recording process. \"Thank You\", \"The Lemon Song\" and \"Moby Dick\" were overdubbed during the tour, while the mixing of \"Whole Lotta Love\" and \"Heartbreaker\" was also done on tour. Page later stated, \"In other words, some of the material came out of rehearsing for the next tour and getting new material together.\"", ": Chris Huston at Mirror Sound, Los Angeles: \"The Lemon\", \"Moby Dick\""]}, {"page": "Nazz (album)", "response": ["* Chris Huston – associate producer"]}, {"page": "List of people from Merseyside", "response": ["*Chris Huston:  Record producer, with The Who and Led Zeppelin albums and others ."]}, {"page": "All Day Music", "response": ["*Jerry Goldstein, Chris Huston, War – producers", "*Chris Huston, Richard Moore – engineers"]}, {"page": "H. P. Lovecraft (band)", "response": ["In June 1968, H. P. Lovecraft decamped to I.D. Sound Studios in Los Angeles with engineer Chris Huston to record their second album.  Due to the intensive touring that the band had undertaken during the first half of 1968, there was a lack of properly arranged new material and consequently much of the album was improvised in the studio.  Huston was pivotal in enabling the underprepared band to complete the recording sessions and was also responsible for creating many of the album's psychedelic sound effects."]}, {"page": "Jeff Simmons (musician)", "response": ["Simmons stayed in Los Angeles and completed two solo albums for Straight in 1969. These were the soundtrack for the Roger Corman biker film Naked Angels and the album Lucille Has Messed My Mind Up. The recording engineer and de facto producer was Chris Huston, formerly with the British band The Undertakers. Also featured were guitarist Craig Tarwater of The Daily Flash and drummer Ron Woods from The Dynamics."]}, {"page": "The Undertakers (band)", "response": ["Then they became the Vegas Five formed in 1959, a group led by drummer Bob Evans with Geoff Nugent, died 12 October 2014; Chris Huston (ex the Casuals); lead vocalist Jimmy McManus (ex the Topspots); bassist Mushy Cooper (born David Cooper died in 1998) (ex the Topspots) and Les Maguire, who was later in Gerry and the Pacemakers, replaced by alto / tenor sax player, vocalist Brian (Sax) Jones (ex the Rebels) (born 27 November 1940 in Wallasey, Cheshire). This was one of the first rock and roll groups in the Liverpool area.", "*Chris Huston - (lead guitar, vocals) (born 25 June 1943)"]}, {"page": "Stop (Eric Burdon Band album)", "response": ["*Recording engineers: Chris Huston, Dieter Dierks", "*Remix engineers:  Chris Huston, Ed Barton"]}, {"page": "H. P. Lovecraft II", "response": ["Recording sessions for the album began in June 1968 at I.D. Sound Studios in Los Angeles, with the band's manager George Badonsky producing and British-born Chris Huston serving as audio engineer.  H. P. Lovecraft had toured intensively during the first half of 1968 and consequently, there was a lack of properly arranged new material for the album.  As a result, much of H. P. Lovecraft II was improvised in the studio, with Huston playing a pivotal role in enabling the underprepared band to complete the recording sessions."]}, {"page": "David Kalmusky", "response": ["Kalmusky is currently partner at Addiction Sound Studios, in Nashville TN, which he helped design and build with Chris Huston (Led Zeppelin, The Who) and Jonathan Cain (The Babys, Bad English, Journey). His private production and mixing room have been featured in publications such as Pro Sound News, Billboard Magazine, GrammyPro.com and several high end audio manufacturers such as Fab Filter, AVID, Miktek, Output Sounds, and Metric Halo."]}, {"page": "Paul Moak", "response": ["Relocating his studio to the Berry Hill area of Nashville in 2009, Moak re-opened The Smoakstack at the former Platinum Labs facility, a 3,000 square-foot recording facility designed by recording engineer and studio designer Chris Huston. The control room monitoring was designed and tuned by Carl Tatz using his Phantom Focus System."]}, {"page": "Soul Finger (Bar-Kays album)", "response": ["Soul Finger is the debut album of the Bar-Kays, issued three months after the single of the same name. It was recorded by Tom Dowd and Chris Huston on Friday, June 23, 1967, at the Stax studio in Memphis. Though all but one member of the group were black (Ronnie Caldwell being the only white member), the album cover art, by Loring Eutemey, suggests an interracial pop music party feeling. The instrumental band, after being signed in early 1967, was tutored by Al Jackson, Jr. and the other members of Booker T. & the M.G.'s, which shows in the tightness of the rhythm section. That summer they also were selected by Otis Redding as his new backup band.https://itunes.apple.com/us/artist/the-bar-kays/id382848"]}]}}