{"wiki_id": "http://www.wikidata.org/entity/Q5107076", "itemLabel": "Chris Keeble", "itemDescription": "British army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Keeble", "wikipedia_page": {"main": "Christopher Patrick Benedict Keeble, DSO, MSc, FCMI (born 14 November 1941) is a former British Army soldier, who fought in the Falklands War.", "link_mentions": [{"page": "Battle of Goose Green", "response": ["After the attack began in the early hours of 28 May 1982, the 2 Para advance was stalled by fixed trenches with interlocking fields of fire. Jones was killed during a solo charge on an enemy machine-gun post. The Argentinian garrison agreed to a ceasefire and formally surrendered the following morning. As a result of their actions, both Jones and his successor as commanding officer of the battalion, Major Chris Keeble, were awarded medals: Jones received a posthumous Victoria Cross and Keeble received the Distinguished Service Order.", "With the death of Jones, command passed to  Major Chris Keeble. Following the failure of this initial attack and the death of Jones, it took Keeble an additional two hours to reorganize and resume the attack.  Former Para officer and military theorist Spencer Fitz-Gibbon wrote in 1995 that despite his undoubted courage, H. Jones did more to hinder than to help 2 Para, losing sight of the overall battle picture and failing to allow his sub-unit commanders to exercise mission command, before his fatal attempt to lead A Company forward from the position where they had become bogged down.Fitz-Gibbon, Spencer. Not mentioned in despatches : the history and mythology of the Battle of Goose Green.  Cambridge: Lutterworth Press, 1995. ", "Major Chris Keeble, who took over command of 2 Para when Jones was killed, was awarded the DSO for his actions at Goose Green.London Gazette Keeble's leadership was one of the key factors that led to the British victory, in that his flexible style of command and the autonomy he afforded to his company commanders were much more successful than the rigid control, and adherence to plan, exercised by Jones. Despite sentiment among the soldiers of 2 Para for him to remain in command, he was superseded by Lieutenant-Colonel David Robert Chaundler, who was flown in from the UK to take command of the battalion."]}, {"page": "Goose Green", "response": ["** Chris Keeble"]}, {"page": "H. Jones", "response": ["Command of 2 PARA passed to Major Chris Keeble. Jones' body was buried in a battlefield grave at Ajax Bay on 30 May. After the war it was exhumed and re-buried at the Blue Beach War Cemetery in San Carlos on 25 October 1982."]}, {"page": "Royal Agricultural University", "response": ["*Colonel Chris Keeble DSO. Soldier, The Parachute Regiment and Harris Manchester College, University of Oxford"]}, {"page": "Douai School", "response": ["*Colonel Chris Keeble DSO (1941– ) soldier, Parachute Regiment."]}, {"page": "Keeble", "response": ["* Chris Keeble, British Army veteran"]}, {"page": "List of people from Quetta", "response": ["* Chris Keeble"]}, {"page": "Christopher Patrick Benedict Keeble", "response": ["#REDIRECT Chris Keeble"]}]}}