{"wiki_id": "http://www.wikidata.org/entity/Q510190", "itemLabel": "Richard Friend", "itemDescription": "British physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Friend", "wikipedia_page": {"main": "Sir Richard Henry Friend  (born 18 January 1953) is a British physicist who is Cavendish Professor of Physics at the University of Cambridge and Tan Chin Tuan Centennial Professor at the National University of Singapore. Friend's research concerns the physics and engineering of carbon-based semiconductors. He also serves as Chairman of the Scientific Advisory Board of the National Research Foundation (NRF) of Singapore.", "link_mentions": [{"page": "Cavendish Laboratory", "response": ["# Sir Richard Friend FRS FREng 1995–present", " the laboratory is headed by Andy Parker   and the Cavendish Professor of Physics is Sir Richard Friend. ", "# Sir Richard Friend FRS, FREng, Cavendish Professor of Physics and Fellow of St John's College, Cambridge"]}, {"page": "University of Surrey", "response": ["The current Director of the university's Advanced Technology Institute, Ravi Silva, is known for his work in Nanotechnology. In 2003, he was awarded the Albert Einstein Silver Medal and the Javed Husain Prize by UNESCO for contributions to electronic devices. The 2011 Clifford Paterson Lecture was given by Silva because of his outstanding contributions to basic science and engineering in the field of carbon nanoscience and nanotechnology. The lecture is given annually on any aspect of engineering. The General Electric Company Limited endowed the lecture in 1975 in honour of Clifford Paterson who undertook the creation of the GEC Research Laboratories in 1919. Other notable academics who have delivered the lecture include Frank Kelly and Richard Friend, both from the University of Cambridge."]}, {"page": "Steve Furber", "response": ["Furber was appointed Commander of the Order of the British Empire (CBE) in the 2008 New Year HonoursBBC Micro designer gets New Year's Honour ZDNet 2 January 2008 and was elected as one of the three laureates of Millennium Technology Prize in 2010 (with Richard Friend and Michael Grätzel), for development of ARM processor. In 2012, Furber was made a Fellow of the Computer History Museum \"for his work, with Sophie Wilson, on the BBC Micro computer and the ARM processor architecture.\""]}, {"page": "Millennium Technology Prize", "response": ["| Richard Friend (finalist and laureate)", "|Committee's reasoning: \"The initial innovation of Professor Sir Richard Friend, organic Light Emitting Diodes (LEDs), was a crucial milestone in plastic electronics. Electronic paper, cheap organic solar cells and illuminating wall paper are examples of the revolutionary future products his work has made possible.\" Professor Sir Richard Friend was awarded a prize of 150,000 euros."]}]}}