{"wiki_id": "http://www.wikidata.org/entity/Q5107021", "itemLabel": "Chris Johnson", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Johnson_(presenter)", "wikipedia_page": {"main": "Christopher David Johnson (often credited as Chris \"Yonko\" Johnson) (born 25 January 1991) is a British television presenter and actor. He began presenting on the CBBC Channel in January 2010, and continued until April 2016. His first television appearance was for BBC Three, introducing Family Guy. Chris also makes content on YouTube under the user name OfficialCDJ.He voiced Dennis the Menace for the 2013 series Dennis the Menace and Gnasher.\nJohnson also has a podcast which he co-hosts called BigDamnCast. He also started up a podcast called Out of the Broom Cupboard (OOTBC for short) where he talks to previous and current presenters, actors, voice actors, puppeteers and more about their careers in and around CBBC. The name Out of the Broom Cupboard refers to the nickname given to the CBBC office due to the size.", "link_mentions": [{"page": "Swinton, Greater Manchester", "response": ["* CBBC Presenter Chris Johnson who attended between 2000 and 2002, Who went on to attend Moorside High School."]}, {"page": "Chris Johnson", "response": ["Chris Johnson may refer to:", "*Chris Johnson (presenter) (born 1991), BBC television presenter", "*Chris Johnson (cornerback) (born 1979), American football cornerback", "*Chris Johnson (running back) (born 1985), American football running back", "*Chris Johnson (safety, born 1960), American football strong safety", "*Chris Johnson (safety, born 1971), American football free safety", "*Chris Johnson (footballer, born 1976), Australian rules footballer for Fitzroy and Brisbane", "*Chris Johnson (footballer, born 1986), Australian rules footballer for Melbourne and Carlton", "*Chris Johnson (baseball) (born 1984), American third and first baseman", "*Chris Johnson (basketball, born 1985), American forward/center from Louisiana State University who has played in the NBA", "*Chris Johnson (basketball, born 1990), American forward/guard from University of Dayton who has played in the NBA", "*Chris Johnson (boxer) (born 1971), Jamaican boxer", "*Chris Johnson (rugby league), rugby league footballer of the 1980s for Great Britain, Leigh, and Swinton", "*Chris Johnson (rugby union) (born 1986), English rugby union footballer", "*Chris Johnson (Maine politician), American politician from Maine", "*Chris Johnson (Mississippi politician), American politician from Mississippi", "*Chris Johnson (architect), British architect that designed \"The Doughnut\", the headquarters of the GCHQ (Government Communications Headquarters"]}, {"page": "The Sarah Jane Adventures", "response": ["For the tenth anniversary of the show, an event was held 29 July 2017 at Cardiff University Students' Union, with proceeds going to Ty Hafan Hospice for Children. A total of £6643.35 was raised by the sale of tickets to the event and merchandise. Members of the cast and crew that took part in the event were Tommy Knight, Anjli Mohindra, Yasmin Paige, Sinead Michael, Mina Anwar, Katy Manning, Paul Marc Davis, Phil Ford, Gary Russell, Joe Lidster, Sam Watts, Richard Wisker, Cheryl Rowlands, Scott Handcock, Brian Miller, John Leeson, Mat Irvine and Chris Johnson. The event was recorded and was released onto DVD and Blu-ray and could be bought exclusively through the event's website."]}, {"page": "Ed Petrie", "response": ["Ed presented weekend links on the CBBC Channel with new CBBC presenter Chris Johnson as of January 2010 whilst Oucho (Warrick Brownlow-Pike) was replaced by Dodge T Dog (Warrick Brownlow-Pike)."]}, {"page": "Moorside High School, Swinton", "response": ["*Actor & former CBBC Presenter Chris Johnson who attended between 2002 and 2007"]}, {"page": "Warrick Brownlow-Pike", "response": ["On 11 March 2011, Chris Johnson was asked via his Formspring account if Oucho T. Cactus would be returning. Johnson replied: \"Since Oucho's puppeteer, Warrick, is still with us as Dodge, it's likely that the little cactus will keep popping up from time to time. However it seems unlikely he'll return as a presenter. The times, they are a changin!\"", "Dodge started in April 2010 by presenting the afternoons with Iain Stirling, while Hacker T. Dog was away filming series 2 of Scoop. When Hacker returned to the CBBC Office, Ed Petrie left continuity. This left Chris Johnson with no co-host, so Dodge stepped in to present with Chris. Hacker then returned to weekdays with Iain.", "On 24 March 2011 Dodge left CBBC, according to the BBC he was \"Travelling The World\", to let Brownlow-Pike film series two of Mongrels. Dodge returned to CBBC on 19 July 2011 and his shift was Holiday Morning with Chris Johnson and London Hughes. Dodge went back to presenting with Johnson after Hughes' departure."]}, {"page": "Pendleton College", "response": ["* Chris Johnson, actor and CBBC presenter"]}, {"page": "Celebrity Mastermind", "response": ["|Chris Johnson ||The Films of Monty Python  ||=3rd"]}, {"page": "List of CBBC presenters", "response": ["| Chris Johnson|| 2010-16 ||"]}, {"page": "Doctor Who: The Adventure Games", "response": ["*Chris Johnson as Barnaby He previously appeared in the fourth series of Gallifrey and in Bernice Summerfield: Epoch as Darion."]}, {"page": "Christopher David Johnson (presenter)", "response": ["#REDIRECT Chris Johnson (presenter)"]}, {"page": "Chris johnson (presenter)", "response": ["#REDIRECT Chris Johnson (presenter) "]}, {"page": "Dennis the Menace and Gnasher", "response": ["| Dennis & Gnasher (2009, BBC) || Glenn Kirkpatrick || - || Sophie Aldred (S1)Chris Johnson (S2)", "* Later in 2009, Dennis re-appeared on television again in a series once again called Dennis & Gnasher. His behaviour was toned down far more showing quite a different personality to that of the comic Dennis, which was changed to match the TV series but has since gradually changed back. This Dennis preferred fun over mischief and often did menacing inadvertently. The first season ran for 52 episodes on CBBC. However, in mid-2013, the show has currently returned but with a new name called Dennis the Menace and Gnasher. Dennis's behaviour has improved by making him behave and sound more menacingly and as of recent, the second season is also running for 50 episodes on the CBBC channel. Dennis was voiced by Sophie Aldred in the first series, and Chris Johnson in the second series."]}, {"page": "All Over the Place (TV programme)", "response": ["All Over the Place is a children's television programme produced by the BBC. It is similar in ways to the discontinued programme Wonderful World of Weird, however All Over the Place is not principally a game show. It features the former CBBC links presenter Ed Petrie as lead presenter, joined across the series by various other CBBC hosts including Chris Johnson, Ceallach Spellman, Richard Wisker, Barney Harwood, Naomi Wilkinson, Sam and Mark, Michelle Ackerley, Lauren Layfield, Johny Pitts and Iain Stirling.", "| Chris Johnson || 2012, 2015–2018 || 2, 5, 6, 7 and 8", "Ed Petrie confirmed on Facebook that All Over the Place Asia Part 2, began filming in 2017 and will be broadcast in 2018. He then later announced that the new series would start on Saturday 6 January 2018 at 9.00am, on CBBC. This series was also the first one to not have Ed Petrie appear in every section as some co-presenters doubled up, such as Chris Johnson with Lauren Layfield and Johnny Cochrane with Inel Tomlinson. The new series contained returning presenter Barney Harwood from Blue Peter, whose last All Over the Place series was Series 6 in Europe, and new presenters Ricky Martin from Art Ninja, Tee Cee from "]}, {"page": "Hacker T. Dog", "response": ["Hacker was introduced as a character in the CBBC television programme Scoop, performed by Andy Heath. The character became popular, and began to appear as a weekday presenter at the CBBC office in May 2009, with the puppetry and voice now being performed by Phil Fletcher. His \"half-brother\" Dodge T. Dog joined the following year.  In July, he began presenting on weekdays with Scottish comedian Iain Stirling. He presented with Stirling until his departure in 2013, when they began presenting with Chris Johnson."]}, {"page": "Sam & Mark's Big Friday Wind-Up", "response": ["| 4 || 7 February 2014 || The Vamps and Chris Johnson", "|| The Overtones, Chris Johnson, Akai Osei, Leona Vaughan and Amy-Leigh Hickman"]}, {"page": "Strange Hill High", "response": ["*Chris Johnson as Ken Kong"]}, {"page": "The Beano timeline", "response": ["| 2013 || 8 July || The Dennis and Gnasher animated series is relaunched, with the new name of Dennis the Menace and Gnasher, effectively reversing the \"softy\" changes made to the Menace in the last series, but retains some of the characters. CBBC Presenter, Chris Johnson has taken over the voice role of Dennis the Menace. ||"]}, {"page": "The Dog Ate My Homework", "response": ["* Chris Johnson"]}]}}