{"wiki_id": "http://www.wikidata.org/entity/Q5105804", "itemLabel": "Chris Bambery", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Bambery", "wikipedia_page": {"main": "Chris Bambery is a Scottish political activist, socialist, author, journalist, and TV presenter and producer, most recently with the Islam Channel where he hosts their current affairs programme The Report. Prior to the 2017 UK General Election he was the Parliamentary Assistant to Scottish National Party MP George Kerevan.  A leading member of the International Socialist Group, he was a member of the Central Committee of the Socialist Workers Party until 2011 when he resigned from the party.", "link_mentions": [{"page": "People's history", "response": ["* A People's History of Scotland by Chris Bambery (Verso, 2014)"]}, {"page": "Modern Records Centre, University of Warwick", "response": ["Papers of individuals associated with Trotskyist organisations include those of Chris Bambery, Colin Barker, Alan Clinton, Jimmy Deane, Reg Groves, Alistair Mutch, Geoff Pugh, Bob Purdie, Tony Whelan, and Harry Wicks."]}, {"page": "Convention of the Left", "response": ["*Chris Bambery (former editor, Socialist Worker)"]}, {"page": "Tom Behan", "response": ["Behan was an active member of the British Socialist Workers Party for over 30 years.Tom Behan 1957-2010 by Chris Bambery in Socialist Worker]", "*Tom Behan in his own words (Tom Behan told Chris Bambery about his life) in Socialist Worker"]}, {"page": "International Socialist Group (Scotland)", "response": ["In April 2011, 39 members of the Socialist Workers Party in Scotland, including Central Committee member Chris Bambery, the majority of the elected Scottish leadership, and the circulation officer for Socialist Worker, resigned from the SWP, stating that the party had no credible strategy to fight the government's cuts agenda. Members of the International Socialist Group argued that a realignment of the Scottish left with other progressive forces was possible. The ISG set itself the challenge of demonstrating successful cooperation with such forces which they believed was not possible or credible within the SWP which they left."]}, {"page": "James P. Cannon", "response": ["* The Politics of James P. Cannon by Chris Bambery, International Socialism 36 (1987)"]}, {"page": "Socialist Worker", "response": ["After 2004 it was edited by Chris Bambery, who was succeeded by Charlie Kimber in 2009, and Judith Orr late in 2010.Peter Manson \"Another one bites the dust\" , Weekly Worker, 6 January 2011 When Margaret Thatcher died, the newspaper printed \"Rejoice\" over her headstone, gaining much international comment."]}]}}