{"wiki_id": "http://www.wikidata.org/entity/Q5107239", "itemLabel": "Chris Lightfoot", "itemDescription": "English footballer and manager (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Lightfoot_(footballer)", "wikipedia_page": {"main": "Chris Lightfoot (born 1 April 1970) is an English former professional footballer who played in the Football League for four clubs. He later managed in non-league football.\nLightfoot spent much of his career with Chester City, where he came through the youth ranks to make his debut as a 17-year-old on 19 September 1987 in a 1–0 win over Grimsby Town. He scored his first goal in his next appearance against Walsall in November 1987 and ended the season with 17 first team appearances to his name. Lightfoot joined fellow youngsters such as Brian Croft, Robbie Painter and Colin Woodthorpe in emerging from the Chester youth set-up to become first-team regulars during this period.\nIn future seasons Lightfoot was a regular in the Chester side, making more than 30 league appearances in each season until 1993–94. By this point Lightfoot had been converted by Graham Barrow from a central defender to an attacking midfielder, reflected in his 14 goals as Chester won promotion from Division Three.\nIn the summer of 1995 Lightfoot followed Barrow to Wigan Athletic for a tribunal fee of £87,500. However, by March 1996 he was on the move again when he joined Crewe Alexandra. In May 1997 Lightfoot appeared as a substitute as Crewe beat Brentford in the Division Two play-off final at Wembley Stadium, giving Lightfoot his first chance to play in the second tier in English football.\nLightfoot's final taste of league football came during a loan spell with Oldham Athletic in the early weeks of the 2000–01 season. At the end of the campaign he left Crewe and joined Conference side Morecambe, where he played for one season. In 2002, he joined Runcorn, who he became manager of in October 2003 \n.\nHe was sacked 12 months later \n.After spells with Marine and Leek Town, Lightfoot ended his playing days with two appearances for NEWI Cefn Druids.Chris is now a taxi driver in Warrington", "link_mentions": [{"page": "Harry McNally", "response": ["During his early years at the club, McNally had given Football League debuts to several players who went on to have long professional careers. Graham Abel, Barry Butler, Carl Dale and David Pugh were successfully captured from non-league football, while Brian Croft, Chris Lightfoot, Aidan Newhouse, Robbie Painter and Colin Woodthorpe all progressed through the youth ranks."]}, {"page": "Cliff Sear", "response": ["Other players to emerge from Sear's youth system and enjoy successful league careers include Brian Croft, twins Paul and Ron Futcher, Chris Lightfoot, Robbie Painter, Mike Williams and Colin Woodthorpe."]}, {"page": "Phil Charnock", "response": ["In December 1996 he left Liverpool on a free transfer to sign for Crewe Alexandra, following a successful loan spell. He made 36 appearances in 1996–97, scoring his first senior goal on 20 December, in a 3–0 win over Notts County at Gresty Road. He also featured in the play-off final, as Alex beat Brentford 1–0 at Wembley to win promotion out of the Second Division; he was replaced by Chris Lightfoot on 65 minutes. He made 35 appearances in 1997–98, as Crewe finished in the top half of the First Division. He played 50 games in 1998–99, as the \"Railwaymen\" again retained their second tier status. He played 21 times at the start of the 1999–2000 campaign, but did not feature past November. He made nine league appearances towards the end of the 2000–01 season and featured 26 times in 2001–02, but was released in April 2002, after manager Dario Gradi informed him he did not feature in his first team plans."]}, {"page": "Chris Lightfoot", "response": ["Chris Lightfoot  (4 August 1978 – 11 February 2007) was an English scientist and political activist. He was the first developer, with Tom Steinberg, at e-democracy charity mySociety."]}, {"page": "Brian Croft", "response": ["Croft joined Chester as a schoolboy, with his debut coming as a 17-year-old substitute away at Peterborough United on 24 August 1985. Although that was to be his only league appearance during Chester's promotion season from Division Four, he started two matches in the Associate Members' Cup. Croft became much more involved in first team duty in 1986–87 when he featured in 21 league games, scoring his first league goal in a 3–1 win over Bristol Rovers in November 1986. This same period saw several other youngsters such as Chris Lightfoot and Colin Woodthorpe break through the Chester youth ranks and go on to enjoy long professional careers."]}, {"page": "Eddie Bishop", "response": ["He returned to football as assistant manager to Nigel Gleghorn at Nantwich Town, where he continued his playing days, leaving in the summer of 2002. He then had a spell assisting his former Chester teammate Chris Lightfoot at Runcorn F.C. Halton, with the pair being sacked together in October 2004"]}, {"page": "Robbie Painter", "response": ["Painter was just 16 when he made his Football League debut as a substitute for Chester City at Bristol City on 21 November 1987. Although he appeared again from the bench a fortnight later against Doncaster Rovers, Painter then had to wait more than a year for his next first-team action. He began to play regularly towards the end of the 1988–89 season, alongside fellow homegrown youngsters Aidan Newhouse, Chris Lightfoot and Colin Woodthorpe. He remained involved in first-team duties for the next two years but at the end of the 1990–91 season he opted to join Fourth Division club Maidstone United for an initial £30,000 along with teammate Neil Ellis."]}, {"page": "1997 Football League Second Division play-off Final", "response": ["|DF || ||Chris Lightfoot || "]}, {"page": "List of Wigan Athletic F.C. records and statistics", "response": ["|July 1995|| Chris Lightfoot|| Chester City||£87,500"]}, {"page": "1999–2000 Crewe Alexandra F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Chris Lightfoot"]}, {"page": "Lightfoot (surname)", "response": ["* Chris Lightfoot (footballer) (born 1970), former English footballer"]}]}}