{"wiki_id": "http://www.wikidata.org/entity/Q5102850", "itemLabel": "Chloe Ashcroft", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Chloe_Ashcroft", "wikipedia_page": {"main": "Chloe Ashcroft (born 7 August 1942) is an actor and former presenter of several BBC children's TV programmes, including Play School, Play Away, Hokey-Cokey, Excuse Me, All Change, and Pie in the Sky. She also appeared in the Doctor Who story Resurrection of the Daleks, playing Professor Laird.Before her television career, she appeared in several stage plays in the 1960s, and returned to the stage in the 1980s. Outside of acting, she has worked as a teacher. She now lives in Whiteshill and Ruscombe in Gloucestershire with her husband, the actor David Hargreaves, with whom she has two children.", "link_mentions": [{"page": "Chloe", "response": ["* Chloe Ashcroft (born 1942), British TV presenter"]}, {"page": "Play Away", "response": ["Presenters during the 13-year run included familiar Play School presenters such as Brian Cant, Toni Arthur, Derek Griffiths, Lionel Morton, Chloe Ashcroft, Floella Benjamin, Johnny Ball, Carol Chell and Julie Stevens, as well as lesser known presenters including Janine Sharp, Matthew Devitt and Kim Goodey. Play Away also played host to future stars such as Jeremy Irons, Julie Covington, Anita Dobson, Tony Robinson and Alex Norton."]}, {"page": "Ashcroft", "response": ["* Chloe Ashcroft, British television presenter"]}, {"page": "Derek Griffiths", "response": ["Griffiths was known in his early years for his Play School appearances alongside the likes of Chloe Ashcroft, Johnny Ball and Brian Cant. A talented multi-instrumentalist, he voiced over and sang the theme tune to Heads and Tails, a series of short animal films for children produced by BBC Television, and also sang and played the theme tune to the cartoon Bod. Another children's TV role was in Granada Television's early 1980s series Film Fun, in which he played the entire staff of a cinema (the manager, the commissionaire (with the catchphrase \"Get on with it!\"), the projectionist, the usherette and also himself) while also showing cartoons such as Bugs Bunny, Daffy Duck and Wile E. Coyote and Road Runner. He appeared on Crown Court (1973) as an accused fraudster Raoul Lapointe, from the Belgian Congo. In 1975, Griffiths played Ko-Ko in The Black Mikado at London's Cambridge Theatre. He was also the English voice of SuperTed (SuperTed was originally made in Welsh)."]}, {"page": "Edward the Seventh", "response": ["*Chloe Ashcroft as Eugénie, Empress of the French (episode 2)"]}, {"page": "Play School (British TV series)", "response": ["* Chloe Ashcroft and her husband David Hargreaves", "Only four of these presenters presented the programme during all three decades of its existence, namely Brian Cant (1964–85), Carol Chell (1966–88), Johnny Ball (1967–84 & 1986–87) and Chloe Ashcroft (1969–88). Chell was both the longest-serving presenter and the one who made the most appearances on the programme (763 in total). In addition, two regular presenters from the 1960s and 1970s, namely Lionel Morton and Colin Jeavons, made a few guest appearances on the programme during the 1980s. Other presenters who were on the programme for 10 or more years included Julie Stevens, Derek Griffiths, Fred Harris, Don Spencer, Sarah Long, Floella Benjamin, Stuart McGugan and Carol Leader.*Paul R Jackson Here's A House – A Celebration of Play School Kaleidoscope", "* Hamble was a little doll and one of the original five toys but dropped from the show during the 1980s to be replaced by Poppy. According to Joy Whitby, creator of Play School, Hamble was chosen as representative of a more \"downtrodden\", humble background than the \"middle-class\" associations that the teddy bears had.Joyce Whitby, Creator of Play School, Children's TV on Trial. BBC Television, broadcast 28 May 2007 She was disliked by presenters as she could not be cuddled.The Reunion: Play School BBC Radio 4, 19 September 2010 on BBC iPlayer According to the BBC website Chloe Ashcroft \"did a terrible thing to Hamble. She just would not sit up...so one day I got a very big knitting needle, a big wooden one, and I stuck it right up her bum, as far as her head. So she was completely rigid, and she was much much better after that.\" "]}, {"page": "David Hargreaves (actor)", "response": ["* 1985, \"Pie in the Sky\" (Children's Series), -Presenter, dir. Sharon Miller, (from an idea by David Hargreaves/Chloe Ashcroft/Peter Gosling), for BBC; ", "He married in 1966 in Buckinghamshire, meeting his wife, Chloe Ashcroft, at the National Theatre. They live in Whiteshill and Ruscombe in Gloucestershire and have a son (born 1968) and daughter (born April 1971)."]}]}}