{"wiki_id": "http://www.wikidata.org/entity/Q5106631", "itemLabel": "Chris Gascoyne", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Gascoyne", "wikipedia_page": {"main": "Christopher Gascoyne (born 31 January 1968) is an English actor, who is known for his role as the seventh Peter Barlow in the soap opera Coronation Street from 2000 . Gascoyne has been nominated for several accolades at the British Soap Awards for his portrayal of Peter Barlow.", "link_mentions": [{"page": "Coronation Street", "response": ["In July 2002, Gail married Richard Hillman (Brian Capron), a recently-introduced financial advisor who had already left Duggie Ferguson (John Bowe) to die after he fell down a set of ladders during an argument, and murdered his ex-wife Patricia (Annabelle Apsion), before going on to kill neighbour Maxine Peacock (Tracy Shaw); and attempt to kill both his mother-in-law Audrey Roberts (Sue Nicholls) and her longtime friend, Emily Bishop (Eileen Derbyshire), for financial gain due to his mounting debts. After confessing his crimes to Gail in a two-episode handler in February 2003, Hillman left the street for two weeks before returning with the intent of killing himself as well as Gail, her children Sarah and David (Jack P. Shepherd), and grand-daughter Bethany, before driving them into a canal – though the Platt family survived whilst Richard drowned. This came just months after Sarah had survived serious injuries after being passenger in a stolen car which crashed. The storyline received wide press attention, and viewing figures peaked at 19.4 million, with Hillman dubbed a \"serial killer\" by the media. Todd Grimshaw (Bruno Langley) became Corrie's first regular homosexual character. In 2003, another gay male character was introduced, Sean Tully (Antony Cotton). The bigamy of Peter Barlow (Chris Gascoyne) and his addiction to alcohol, later in the decade, Maya Sharma's (Sasha Behar) revenge on former lover Dev Alahan (Jimmi Harkishin), Charlie Stubbs's (Bill Ward) psychological abuse of Shelley Unwin (Sally Lindsay), and the deaths of Mike Baldwin (Johnny Briggs), Vera Duckworth (Liz Dawn) and Fred Elliott (John Savident). In 2007, Tracy Barlow (Kate Ford) murdered Charlie Stubbs and claiming it was self-defence; the audience during this storyline peaked at 13.3 million. At the 2007 British Soap Awards, it won Best Storyline, and Ford was voted Best Actress for her portrayal. Other storylines included Leanne Battersby (Jane Danson) becoming a prostitute and the show's first bisexual love triangle (between Michelle Connor (Kym Marsh), Sonny Dhillon (Pal Aron), and Sean Tully (Antony Cotton))."]}, {"page": "Ken Barlow", "response": ["thumb|right|160px|Chris Gascoyne plays Ken's son Peter BarlowKen was disdainful of his parents, Frank (Pemberton) and Ida (Dyson). Their strained familial relationship was apparent from his very first scene, in which conflict arose over his reluctance to eat a meal with brown sauce. Roache called it \"good character-defining stuff\", which established the antagonism between Ken and his father, borne from Ken's snobbery and desire to abandon his roots.Roache 2010, p.53. The death of his mother further illuminated the father-son relationship. Roache recalls that, \"although their relationship could often be stormy, with Ken's views and attitude rubbing Frank up the wrong way on a number of issues, the fact was that they had been thrown together by her death and they had to get used to living with each other without the buffer that Ida had often provided.\"Roache 2010, pp.65–66. While Dyson left the series under her own volition, Pemberton later became one of several cast members fired under Aspinall's tenure as producer. By 1984, both of Ken's parents had left the Street.Roache 2010, pp.75–78. Ken was originally intended to have a sister named Enid. Warren decided against her inclusion, and instead created a younger brother, professional footballer David (Rothwell), to enable the show to represent teenage males.Egan 2010, pp.15–16. Rothwell feels that an \"underlying antagonism\" existed between Ken and David, which stemmed from the fact Ken had the advantage of a university education, while his brother did not.Egan 2010, p.25.", "Ken was bored with looking after the children, Peter and Susan, before Valerie's death. Afterwards, further problems occurred and Ken was no longer able to cope. The writers were initially uncertain whether to continue with Ken as a single father, or dispatch the children and pursue a less-encumbered lifestyle.Roache 2010, p.107 Roache said, \"Ken tried to bring up the kids on his own, but he wasn't doing so good. So he sent them up to Glasgow to live with his mother-in-law.\" Ken still remained in contact; Roache recalled Ken often saying: \"Right, I'm off to Scotland.'\" Roache has suggested that the subsequent problems in his children's adulthood were Ken's fault: \"I blame Ken for how they've all turned out. He shoved his kids up in Scotland, didn't really look after them. But you don't want a happy family in the Street. You want a wonderful dysfunctional one like the one I've got, they're great and Deirdre is wonderful.\" The animosity between Ken and his children has been explored throughout the programme's duration. Chris Gascoyne, who took on the role of Peter in the 2000s, has suggested that there is a lot of tension between Ken and Peter due to the dysfunctional nature of the Barlow family. Guilt over the twins' upbringing led Ken to dote on his youngest son, Daniel, as he was keen to avoid repeating his past mistakes. Their close relationship resulted in Roache challenging the series producers when a script required Ken to allow Daniel to be taken away by his mother. The actor felt that Ken would not accept this; he would fight. The scriptwriters apologised, but it was too late to re-write the plot.Roache 2010, pp.189–190.", "In March 2017, Ken was at the centre of a \"whodunit\" storyline which saw an unknown assailant push him down the stairs of his house after striking him over the head with a blunt object. The suspect list was initially narrowed down to six: Adam Barlow (Sam Robertson), Peter Barlow (Chris Gascoyne), Tracy Barlow (Kate Ford), Daniel Osbourne (Rob Mallard), Pat Phelan (Connor McIntyre) and Sinead Tinker (Katie McGlynn). However, other suspects such as Amy Barlow (Elle Mulvaney), Simon Barlow (Alex Bain), Rob Donovan (Marc Baylis) and Chloe Tipton (Jo-Anne Knowles) were later added into the frame."]}, {"page": "Adrian Mole", "response": ["| colspan=\"2\" | Chris Gascoyne"]}, {"page": "Endgame (play)", "response": ["In 2016, Coronation Street actors David Neilson and Chris Gascoyne starred in a staging of the play at both the Citizens Theatre in Glasgow and HOME in Manchester."]}, {"page": "Deirdre Barlow", "response": ["In January 2001, Ken tells Deirdre that his daughter Susan Barlow (Joanna Foster) had a child, Adam Barlow (Iain De Caestecker) fathered by Mike with information from Ken's son and Susan's twin brother Peter Barlow (Chris Gascoyne). Deirdre tells Dev Alahan (Jimmi Harkishin) and he informs Mike. Susan dies in a car crash, Adam is injured, and Mike later gets custody of Adam to Ken's anger."]}, {"page": "Soldier Soldier", "response": ["*Chris Gascoyne as Fusilier Tony Rossi (Series 7)"]}, {"page": "Hayley Cropper", "response": ["In 2003, while Hayley is away, nursing her sick aunt, scheming Tracy Barlow (Kate Ford) bets Bev Unwin (Susie Blake) that she can bed the man supposedly least likely to be unfaithful — Roy. Tracy drugs Roy at Peter Barlow (Chris Gascoyne) and Shelley Unwin's (Sally Lindsay) wedding reception and claims to have slept with him. Roy is desperate to keep this from Hayley but breaks down and admits everything. Upon confronting Tracy, the Croppers are stunned when Tracy tells them that she is pregnant with Roy's baby and plans to have a termination if the Croppers do not want to adopt it. Roy and Hayley see an opportunity to raise a child and pay Tracy £25,000. The Croppers' relationship becomes increasingly strained, including a suicide attempt by Roy, but they pull through. Roy gets suspicious when Tracy goes on holiday for 3 weeks and realizing how easy it would be for Tracy to disappear with the cash and the baby, Roy insists she marry him (giving him parental responsibility of the baby) or the deal is off. She agrees and they marry. After the baby is born, Tracy admits to Peter that Steve McDonald (Simon Gregson) is the father (they had a one-night stand shortly before she spent the night with Roy). The baby's true paternity is revealed at Steve's wedding to Karen (Suranne Jones), when Tracy demands baby Patience be returned to her and the Croppers, heartbroken, do so and Tracy repays the cash to Roy and Hayley. Steve and Karen marry, despite Tracy's bombshell, and Karen gets her revenge by gatecrashing the christening. Patience Cropper is renamed Amy Barlow and the Croppers are her godparents."]}, {"page": "Nikki Sanderson", "response": ["Since leaving Coronation Street she has appeared in episodes of the BBC television series' Holby City and New Street Law alongside fellow Coronation Street alumni Chris Gascoyne and Chris Bisson. In 2006, Sanderson appeared in a touring production of The Vagina Monologues with Jerry Hall amongst others and an episode of Kay Mellor's Strictly Confidential."]}, {"page": "Steve McDonald (Coronation Street)", "response": ["In December 2013, when Michelle's friend, Carla Connor (Alison King), marries Steve's friend, Peter Barlow (Chris Gascoyne), Steve and Michelle help plan the wedding, which prompts them to begin a party planning business together. However, a few months later, Steve is shocked to discover that Peter is having an affair with Tina McIntyre (Michelle Keegan). When the truth is revealed, Carla says that she is going to kill Tina and is prime suspect in her murder investigation when she is found lying dead on the pavement. When Michelle discovers that Steve knew about Tina and Peter's affair, she dumps him, packs her bags and moves in with Carla. However, they get back together within a week and begin to save up for a holiday home in Spain."]}, {"page": "Blanche Hunt", "response": ["When her granddaughter Tracy falls pregnant, she tells Roy Cropper (David Neilson) and his wife Hayley (Julie Hesmondhalgh), that Roy is the father and tells them that she will have a termination if they do not want to adopt it. Blanche tries to persuade Tracy to keep the baby by buying No. 7 Coronation Street for them to live in, upsetting Deirdre, who wonders why Blanche never bought a house for her. Tracy gives birth to a daughter and gives the baby to the Croppers, who name her Patience; Blanche sees through Tracy's \"indifference\" and encourages her to fight for her daughter. Tracy breaks down and Blanche enlists Ken and Deirdre's help to get the baby back. Although they are disgusted when Hayley reveals Tracy sold her daughter for £25,000. Blanche, Ken and Deirdre stand by Tracy, who reclaims her daughter and renames her Amy (Elle Mulvaney). Blanche is relieved when Tracy later admits Roy isn't the real father. When Tracy and Amy visit Peter (Chris Gascoyne) in Portsmouth, Blanche moves back in with Ken and Deirdre, renting (and later selling) the house to Danny Baldwin (Bradley Walsh). Struggling with a bad hip, Blanche considers using some of the money for a private hip replacement operation but later has the operation in Poland where it is cheaper."]}, {"page": "Jack Duckworth", "response": ["On 8 November 2010, Tyrone organises a party for Jack's 74th birthday in the Rovers Return. Jack reveals to Molly that he overheard her and Kevin discussing baby Jack's paternity. Jack does not condemn Molly and he admits he and Vera had both done the same as she had to each other, but tells her that Tyrone never would and pleads with her to move the family away from Weatherfield. Later, after seeing Tyrone and Molly happy together with baby Jack, he decides to quietly slip out of his own party saying his final words to Peter Barlow (Chris Gascoyne) and then waving goodbye to Ken Barlow (William Roache), who raises a glass to him as he leaves. Jack goes home and whilst listening to a Matt Monro record \"Softly As I Leave You\", which Tyrone had given him as a present, he dies in his armchair and is joined by the ghost of Vera, who tells him off, yet again, for his scruffy appearance. She tells Jack she'll be late for a bus and Jack's spirit leaves his body and gets out of his chair and dances with Vera and they share a kiss. Some time later, Tyrone, Molly and Connie return home to find Jack dead in his chair, and a tearful Tyrone says his last words to him \"Good Night Dad\". Jack and Vera's ashes are later scattered off Blackpool Pier by Tyrone and Connie."]}, {"page": "Roy Cropper", "response": ["Everything goes swimmingly for the Croppers, but in 2013, Roy tries to find his estranged father online, but learns that his father, St. John, has died just months earlier. He struggles to come to terms with his father's death, and begins sleepwalking. Hayley agrees to go through medical tests with Roy for support, but her own test results detect abnormal liver function, and is then diagnosed with stage-two pancreatic cancer. While the pair are on holiday to take Hayley's mind off things, Sylvia leaves a note explaining that she has left Weatherfield but does not give a specific reason. A while after, Roy and Hayley are dealt with the news that her cancer is terminal. Hayley then reveals that she wants to die before the cancer reverts her back to her old self, but Roy struggles to accept her decision. Arguments ensue regularly over her decision, and this leads to Hayley leaving Roy temporarily. While she is living with Fiz and her boyfriend Tyrone Dobbs (Alan Halsall), Hayley collapses and is told she has an infection. In December, the couple are told that she has weeks left to live, much to their devastation. Hayley tells Roy to only break the news to a selected few, including Anna, Carla, Peter Barlow (Chris Gascoyne), Fiz, Tyrone, Rita Tanner (Barbara Knox) and Dennis Tanner (Philip Lowrie)."]}, {"page": "Tracy Barlow", "response": ["On 23 October 2002, it was reported that Tracy would be reintroduced later that year. A show spokesman says the new Tracy will be sexy, sassy and opinionated. She will make a beeline for womanising bookie Peter Barlow (Chris Gascoyne), her own stepbrother, before moving on to former sailor Ciaran McCarthy (Keith Duffy) and knicker factory boss Joe Carter (Jonathan Wrather). Tracy returns home to Weatherfield at Christmas after turning to her mother, Deirdre Barlow (Anne Kirkbride), when her marriage breaks down - she left the Street after marrying Robert Preston (Julian Kay) at Weatherfield Register Office. The character was last played by Dawn Acton. A Coronation Street spokesman said: \"We are looking at other actresses because the character has changed so much - she's going to be explosive.\""]}, {"page": "Charlie Stubbs (Coronation Street)", "response": ["During his time on the programme, Charlie gradually became the show's main antagonist after being transpired to have a narcissistic, manipulative and despicable streak. This became evident during most of the character's story arc, which saw Charlie spark a relationship local landlady Shelley Unwin (Sally Lindsay) - whom he ends up mistreating, up to the point where he clashes with her interfering mother Bev (Susie Blake), before she eventually jilts him at their wedding. He then went on to proceed in forming a close friendship with his colleague Jason Grimshaw (Ryan Thomas); instigate a feud with Shelley's ex-husband Peter Barlow (Chris Gascoyne) after assaulting him; embark on an affair with Jason's girlfriend Maria Sutherland (Samia Smith); attempt to drown local teenager David Platt (Jack P. Shepherd) in retribution for the latter trying to blackmail him; and repeatedly clashes with Maria's best friend Claire Peacock (Julia Haworth) over his antagonistic nature."]}, {"page": "Charles Lawson", "response": ["In 2010, Lawson revealed that he would be returning to Coronation Street for its fiftieth anniversary celebrations. He speculated that bosses may be planning to kill his character off, however, this never happened.Charles Lawson (Jim McDonald) to return to Coronation Street  He stayed until April 2011. Lawson then returned for a three-month stint on the soap between August and November 2014. His brief return coincided with the imprisonment of Peter Barlow (Chris Gascoyne) after he was wrongly accused of murdering Tina McIntyre."]}, {"page": "Ashley Peacock", "response": ["Claire then goes to stay with her mother and leaves Joshua and Freddie with Ashley. Ashley is angry with Sunita when she comes into the butchers to ask after Claire and he orders her to leave. When the truth is revealed about Simon causing Aadi's injury, Ashley angrily confronts Simon's father Peter Barlow (Chris Gascoyne) and accuses Simon of lying to cover his tracks and causing Claire's problems. Peter apologises to Ashley. When Claire returns home, Sunita comes round to apologize but the Peacocks do not accept it and Ashley orders Sunita to leave."]}, {"page": "Shelley Unwin", "response": ["Shelley's storylines included a bigamous marriage to Peter Barlow (Chris Gascoyne) and an abusive and controlling relationship with Charlie Stubbs (Bill Ward), who later left her pregnant.", "Shelley falls in love with Peter Barlow (Chris Gascoyne) after he leaves the navy and returns to the Street over Christmas 2001. They move into the flat over the bookies on Rosamund Street together and Peter buys the bookies. They have a rough patch and break up for a while after Peter's friend, Ciaran McCarthy (Keith Duffy), visits and makes a pass at Shelley. She doesn't tell Peter initially but when he does finds out, Ciaran blames Shelley. Peter gets very jealous and Shelley, hurt that Peter didn't believe her, leaves. Once Peter realizes that Ciaran is lying, Peter ends the friendship and he and Shelley reconcile. Ciaran returns to Weatherfield for Peter and Shelley's engagement party and stays, much to Shelley's chagrin. Peter and Ciaran renew their friendship and Shelley accepts it but never really trusts Ciaran, who later gets engaged to Sunita.", "In January 2001 it was announced that a new barmaid and friend of Duggie Ferguson (John Bowe) was to join and that she would be played by actress Sally Lindsay. She made her first appearance on the soap on 9 May 2001 as a new feisty barmaid. During Shelley's six years on the show she was friends with Sunita Alahan (Shobna Gulati) and was involved in high-profile storylines such as discovering her husband Peter Barlow (Chris Gascoyne) is a bigamist and later being beaten up by her then boyfriend Charlie Stubbs (Bill Ward)."]}, {"page": "Rovers Return Inn", "response": ["* 27 May 2014: Peter Barlow (Chris Gascoyne) tells his wife Carla Connor (Alison King) about his affair with Tina McIntyre (Michelle Keegan) in the backroom. She storms into the pub, shouting that she wants to \"kill\" Tina. When Tina is later attacked and dies, Carla becomes the prime suspect.", "(Chris Gascoyne and Georgia Taylor)", "In 2017, Michelle Connor (Kym Marsh) separates from Steve McDonald (Simon Gregson) after discovering that he secretly fathered Leanne Battersby's (Jane Danson) son Oliver while they had temporarily split up earlier. She demands that he sell his half of The Rovers and split the money of the sale with her as part of their divorce settlement, to which he agrees. Liz McDonald (Beverley Callard), not wanting to go into business partnership with a stranger, also decides to sell up, and the pub is eventually bought by Leanne's ex-husband Peter Barlow (Chris Gascoyne), who becomes its new landlord and installs his girlfriend and Leanne's stepsister Toyah Battersby (Georgia Taylor) as the landlady.", "Following Peter Barlow (Chris Gascoyne) and Toyah Battersby's (Georgia Taylor) split, The Rovers is put up for sale. The pub is eventually bought by Johnny Connor (Richard Hawley) and his wife Jenny (Sally Ann Matthews) due to sentimental reasons as it was the last place they saw Johnny's son, Aidan Connor (Shayne Ward), before he committed suicide.  After Jenny cheats on him, Johnny ends their marriage and puts his 50% share of The Rovers up for sale."]}, {"page": "Leanne Battersby", "response": ["Leanne's storylines include numerous affairs, prostitution, drug abuse, insurance fraud, discovering her biological mother was Stella Price (Michelle Collins), a miscarriage, an abortion and a custody battle for Peter Barlow (Chris Gascoyne) son, Simon (Alex Bain). Leanne has had numerous relationships within the show. She married Nick Tilsley (Adam Rickitt/Ben Price) in 1998, but they divorced a year later. She later married Peter in the show's live 50th anniversary episode, but later split from him, after his affair with Carla Connor (Alison King) was exposed. After a volatile reconciliation, she and Nick married for the second time in January 2013, but in late January 2014, Nick decided it was best for them to be apart, as he was suffering from long-term brain damage. After a one-night stand, Leanne becomes pregnant with Steve McDonald's (Simon Gregson) baby and gives birth to a son, Oliver Battersby. In November 2020, Oliver dies from Mitochondrial disease.", "Leanne hires Paul Clayton (Tom Hudson) as a chef and he develops feelings for her, which she rejects. However, after realising that Valandro's is losing money; she and Paul burn the restaurant down for the insurance money in March 2008. Leanne sleeps with Paul to persuade him to torch the restaurant, which he does on 31 March 2008. Meanwhile, Leanne is dating Dan Mason (Matthew Crompton). When the police question her and Paul about the fire, Dan gives her an alibi. Paul, however, is arrested and released on bail but goes on the run to avoid being imprisoned. In September, Dan needs £10,000 to buy the betting shop from his father, Harry (Jack Ellis), and Leanne offers him the money after Janice won £25,000 in a lottery scam. However, when Dan learned where the money came from, he breaks up with Leanne. Peter Barlow (Chris Gascoyne) returns to the Street with his five-year-old son, Simon (Alex Bain), and buys the betting shop. On 17 December 2008, a drunken Peter tries to kiss Leanne but she rejects him. However, she forgives him when he promises to give up alcohol and they start dating. In early 2009, Peter struggles to stay sober and starts a rehabilitation programme which Leanne supports, running the betting shop in his absence. Leanne thinks that he is having an affair and confronts him in the Rovers, but is mortified to learn that he was planning to propose. The reappearance of Leanne's ex-fiancé, Nick (now played by Ben Price), is another challenge to her relationship with Peter. After an explosion at the bar and a tram derailment, Nick, Peter, and Ashley are trapped in the office. Peter is seriously hurt and taken to hospital where he and Leanne marry but moments later, Peter goes into cardiac arrest brought on by a pericardial effusion and has to be resuscitated. To Leanne's relief, he survives and successfully comes through surgery to stop internal bleeding, but it is later revealed that he has damaged his spine and it could be some time before he can walk again. Noticing that Carla has romantic feelings for Peter, Leanne warns her to stay away from them and takes Peter on an impromptu honeymoon on New Year's Eve."]}, {"page": "Janice Battersby", "response": ["On 6 December 2010, a tram crashes onto the cobbles, following an explosion at 'The Joinery' Bar. Janice puts her first aid training to use, helping the injured in the Rovers. She also witnesses stepdaughter Leanne's wedding to Peter Barlow (Chris Gascoyne), which takes place in hospital as he was injured in the disaster."]}, {"page": "Eileen Grimshaw", "response": ["On 12 December 2008, Eileen's father Colin (Edward DeSouza) arrives. He meets Peter Barlow (Chris Gascoyne) in the bookies and as he places a bet, Eileen phones him wanting to know where he is and he lies, claiming to be on the bus to Weatherfield. He was known for his betting and drinking and this causes a row when they meet."]}, {"page": "Weatherfield", "response": ["Peter Barlow (Chris Gascoyne) goes to see his son, Simon, perform in the nativity play in December 2008; however, he is refused entry as he is drunk. He fights his way through and ruins the play. In 2013, Kylie Platt (Paula Lane) arrives drunk at her son Max's nativity play and the Platt family is removed immediately when Kylie tries to drag Max off the stage. In June 2014, Kylie and her husband, David, are called in as Max has been disruptive during lessons. This later leads to him being diagnosed with ADHD.", "In April 2012, after Frank is found dead in the factory, his 40% share is to be purchased by Sally. After meeting with Frank's lawyers, Carla discovers that Frank has left his share of the factory to her, having forgotten to change his will after the rape, much to the happiness of her sister-in-law, Michelle Connor (Kym Marsh). In December 2013, Carla gives 50% of the business to her husband Peter Barlow (Chris Gascoyne) after he loses the bookies but demands the shares back after uncovering his affair with Tina McIntyre (Michelle Keegan). In January 2014, the factory loses one of its much-loved staff members, as Hayley passes away from pancreatic cancer.", "Viaduct Bistro is situated on Viaduct Street under the viaduct. It was formerly a joiners' workshop before it was renovated and became The Joinery Wine Bar in 2010. The Joinery was first opened in early 2010 by Peter Barlow (Chris Gascoyne) and Leanne Barlow (Jane Danson), but was owned by George Wilson (Anthony Valentine). On its first night Peter's alcoholism gets the better of him when he becomes drunk and violent, leaving Leanne devastated, so its first night is also its last.", "Preston's Petals is the florist on Rosamund Street and is owned by Tracy Barlow (Kate Ford). Peter Barlow (Chris Gascoyne) originally bought the shop in late 2008 from Dan (Matthew Crompton) and Harry Mason (Jack Ellis) after his return to Weatherfield. Shortly after, he moves into the flat above the Shop. In early 2009, Peter gets drunk while his son Simon Barlow (Alex Bain) is sleeping, he then lights a cigarette before dropping it and setting the place alight. Simon awakes to find it alight and manages to call Deirdre Barlow, who rushes out to the street and, seeing the blazing shop and flat, she fetches Luke Strong (Craig Kelly) and Tony Gordon (Gray O'Brien) to help rescue Peter, Simon and Leanne, Simon's pet rabbit."]}, {"page": "Amy Barlow", "response": ["By the time Amy turns 10, it is clear that she has inherited troublemaking traits from her mother. This starts when Amy taunts Simon when his father, Peter Barlow (Chris Gascoyne), is sent to prison for the murder of Tina McIntyre (Michelle Keegan). Whilst being looked after by Sophie Webster (Brooke Vincent) and her girlfriend, Maddie Heath (Amy James-Kelly), Amy becomes jealous of the amount of attention that Simon is getting. After Maddie berates Amy for bullying Simon, Amy sneaks off to see Tracy and lies that Maddie has threatened to hit her. A week later, Simon and Amy are once again looked after by Maddie and Sophie and again, Amy is jealous of the attention that Maddie shows to Simon. When they stop at The Kabin to get some sweets, Amy deliberately lets Deirdre's dog, Eccles, off her lead, knowing that the dog going missing would greatly upset Simon. Later, Sophie and Maddie find the dog and return her home to a relieved Deirdre and Simon. In September 2014, Amy causes more trouble when she cuts her hand on the back door and lies that the dog has bitten her. Tracy is furious and insists that the dog must be put down. Simon is devastated and tells Sophie and Maddie about what has happened. Maddie and a reluctant Sophie agree to try to help and they take the dog and hide her in No. 4. The Barlows begin searching for the dog and a couple of days later, Ken spots Sophie and Maddie taking her for a walk. Ken brings the dog home and Tracy again insists that the dog has to go. Ken tries to get Amy to tell the truth about her injury and she eventually reveals that she lied about the dog biting her. Maddie praises Amy for admitting the truth, telling her that she was very brave."]}, {"page": "Fiz Brown", "response": ["John meets one of his ex-teacher colleagues, Colin Fishwick (David Crellin), in the café, who invites him and Fiz to his leaving party before he emigrates to Canada. Whilst at the party, Colin makes it clear to John that he wants to stop teaching.  John thinks up a plan to start teaching again himself, by stealing Colin's identity as he has a clean CRB. Fiz is initially incredulous when John tells her about his plans but, because she loves John, she soon weakens and agrees to go along with his plan. They both agree to keep the truth from Chesney, who has not been particularly fond of John since his affair with Rosie. Eventually, Fiz sees what risk John is taking and they begin to row. Fiz later leaves to go on holiday, alone. Fiz returns from her holiday and announces that she is 12 weeks pregnant with their first child. The couple make up and John promises to never lie to her again. Fiz goes into labour only six months into her pregnancy following injury in the explosion of Nick Tilsley (Ben Price) and Leanne Battersby's (Jane Danson) bar, The Joinery, so she is sent to hospital and gives birth to a baby girl, whom she names Hope. Straight after her birth, Hope is transferred into an incubator as she is three months premature. Due to her prematurity, her immune system is failing and is diagnosed with an infection. Fiz is told that Hope will need a transfusion in order to fight the infection. John has a breakdown following his involvement in three deaths, unbeknownst to Fiz. Fiz is left at home alone with baby Hope, who has now been allowed to leave the hospital. Joy Fishwick (Doreen Mantle), Colin's mother, asked her solicitor to track down her son before her death, and \"Colin\" is tracked at Number 5. Horrified, Fiz forces herself to pretend to be Mrs. Fishwick. The solicitor informs Fiz of Joy's death and that she has left her fortune to Colin. John returns home in March 2011 and things seem to look up, but John realises all of the new things that Fiz has bought, which she dishonestly explains are from money she received when the factory girls had a whip-round for her. In April 2011, John decides to stop taking his medication, despite Dr. Matt Carter's (Oliver Mellor) objection. Joy's solicitor turns up at No. 5, with Fiz having to pose as Mrs. Fishwick again. The solicitor reveals that Joy's house had been sold and the money is to be transferred into Fiz's (i.e. Mrs. Fishwick's) bank account. John is furious with Fiz for what she has done, thinking it is all over for him. John suffers another breakdown, locking himself in the bookies, after which he runs away. Peter Barlow (Chris Gascoyne) and Dr. Carter suggest that they call the police, but Fiz, knowing the potential imprisonment of both her and John, decides to wait and see if he returns."]}, {"page": "Adam Barlow", "response": ["Adam first appears aged 12 when he is visiting his uncle Peter Barlow (Chris Gascoyne), grandfather Ken Barlow (William Roache) and Ken's partner Deirdre Rachid (Anne Kirkbride), with his mother, Susan Barlow (Joanna Foster). It is revealed that Ken's arch-enemy and Susan's former husband, Mike Baldwin (Johnny Briggs), is Adam's father. Adam was injured in a car crash that killed Susan. Adam goes to live with Mike but leaves to go to boarding school in Scotland, but returns after doing his Highers exams.", "In July 2016, it was announced that Coronation Street would be extending the Barlow family by reintroducing Adam along with Peter Barlow and Daniel Osbourne. It was announced that Chris Gascoyne had reprised his role as Peter and Rob Mallard had taken over the role as Daniel, followed by Robertson reprising his role as Adam. Addressing the plans, producer Kate Oates told Digital Spy: \"One of the things I am most excited about and something I consider a real privilege is that I am lucky enough to work on the longest-running soap. One of the longest-running families on that soap is the Barlows and why would you not want to strengthen that family? I love the idea of Ken as the head of the family which has Tracy, Simon and Amy. I am excited to bring Peter back to the show. I am delighted to meet Daniel Osborne, who is Ken’s child with Denise and I am excited to bring back Adam, who is Mike Baldwin’s son and Ken’s grandson. I think that strong family dynasty - the first family on the soap, as it were -  here, big, strong and sending ripples through the street, is really exciting and I am really looking forward to seeing that.”"]}, {"page": "Nick Tilsley", "response": ["Nick's storylines have included his adolescent problems and his role in the fraught relationship between his parents, his teenage marriage to Leanne Battersby (Jane Danson) and their divorce, and his engagement to Maria Connor (Samia Smith). Since his return in 2009 his storylines have featured him remarrying and once again divorcing Leanne, his one-night stand with David's wife Kylie Platt (Paula Lane), suffering brain damage after being involved in a lorry crash which was caused by David, and his business partnership with and later one-day marriage to Carla Connor (Alison King). In late-May 2017, after a trip to the seaside with his enemies Peter Barlow (Chris Gascoyne) and Steve McDonald (Simon Gregson), he became trapped in quicksand. Since his return in 2018 his storylines have included: stealing £80,000 from grandmother Audrey, reuniting with ex-wife Leanne, going into business with Carla, opening a barber shop called A Trim Up North with brother David, using stolen money and discovering that he has a son with his ex-girlfriend Natasha Blakeman (Rachel Leskovac).", "On Christmas Day 2009, Nick (now played by Ben Price) returns to Weatherfield. He becomes interested in buying a share of Underworld but Carla Connor (Alison King) declines his offer. He briefly meets Leanne, who has told Carla not to trust Nick but she accepts and he becomes a partner. Nick ends his partnership with Carla a few months later and decides to open a bar/restaurant, calling it The Joinery. Leanne, although disgusted initially, agrees to become manager. It is clear that Nick still has strong feelings for Leanne. Although Leanne is dating Peter Barlow (Chris Gascoyne), Nick is still in love with her and asks her to leave Peter, but despite sharing a kiss, she refuses. Eventually, Nick succeeds in seducing Leanne and they have an affair. After Leanne ends it, Nick pretends to be Peter's friend to annoy Leanne and threatens to tell Peter about their affair. In December 2010, when Peter is critically injured in a gas explosion that destroys The Joinery and the subsequent tram crash, he and Leanne marry in hospital. When Peter learns of the affair in February 2011, he forgives Leanne. In February 2012, Leanne eventually ends her marriage to Peter after his affair with Carla and reconciles with Nick in June 2012."]}, {"page": "Bethany Platt", "response": ["The police visit the Platts and Bethany overhears the police explaining that the crime will be difficult to prove with Bethany being over the age of consent, but with her testimony, Nathan could be charged with rape or controlled prostitution for gain. Nathan breaks bail by seeing Bethany and Bethany keeps him updated as well as agreeing to keep Nathan's connection with Neil quiet. Bethany makes a move on Peter Barlow (Chris Gascoyne), but he rejects her and Sarah catches Bethany about to self-harm with a cigarette, believing she is in the wrong, not Nathan. Mary catches Bethany trying to leave with her belongings, who is planning to leave with Nathan, and Mary fails to talk Bethany out of going. Bethany finds out she is going to Belgium alone and Bethany asks a family to phone the police. Nathan is arrested and at the police station, Neil threatens Bethany to keep quiet about his involvement, which she does when she is interviewed. Sarah is told by the police that the CPS has dropped the case against Nathan due to lack of evidence, which Sarah passes onto Bethany. Bethany self-harms by picking at her cigarette burn after hearing this news. Sarah arranges for Neil to speak to Bethany and he reminds her to keep quiet, but Bethany finally reveals to Craig that Neil knows Nathan and was forced to have sex with him. Shona tries to talk to Bethany about Nathan, but Bethany believes nothing will change no matter who she talks to. Craig compliments Bethany over her handling of the situation, prompting her decision to get support over what she has been through. Craig gets a recording of Neil confessing to what he and Nathan did, sharing it with Bethany, Sarah and the police, who later inform Bethany the CPS have a case. Sarah and Bethany go to Weatherfield High to enrol Bethany in the sixth form, but Bethany is annoyed that she would have to retake Year 12, so Audrey offers Bethany an apprentice as a beautician. Mel turns up unexpectedly and tells Bethany that she was one of Nathan's victims, but cannot go to the police and Bethany persuades her family to let Mel stay. Mel secretly contacts Nathan, who wants Mel to keep Bethany away from court and Mel pretends to give into Bethany's persuasion to go to the police. Mel takes Bethany near train tracks and Bethany tries to persuade Mel that she is a victim of Nathan's. Mel allows Bethany to go to court and Bethany becomes emotional when she is cross-examined, feeling she has messed up. Craig, Nathan, and Neil are cross-examined and Bethany and Sarah are relieved that Nathan, Neil, and the other perpetrators are found guilty."]}, {"page": "Kirk Sutherland", "response": ["Kirk helps Tyrone come to terms with the fact that baby Jack is not his son as he and Maria visit him on Christmas Day. He is later kicked out along with Maria by a frustrated and angry Tyrone. Kirk attends Peter Barlow's (Chris Gascoyne) wedding renewal to Leanne Battersby (Jane Dawson) he arrives with Maria and her boyfriend Chris Gray (Will Thorp) he informs Peter that everyone has arrived and that they can start the ceremony. Kirk, Tyrone, Gary, and Tommy abduct Leon Southam, whose girlfriend is harassing Fiz in prison. They hold him hostage in the empty butcher's shop and figure out how they will get out of it, only for Norris to find Leon and perform a citizen's arrest on him. Leon is sent back to jail for violating his parole and Norris is hailed as a hero, only for his fifteen minutes to expire immediately when a drunken Carla crashes into the bookies and almost kills Stella Price (Michelle Collins)."]}, {"page": "Claire Peacock", "response": ["On 6 December 2010, a huge explosion tears through 'The Joinery' bar and seriously damages the viaduct above, which leads to a tram derailing and crashing into the neighbouring corner shop and causes the Peacock's house to catch fire. Claire escapes unharmed along with her children and other children she had been babysitting and takes refuge in Roy's Rolls cafe along with other residents. She then proceeds to call Ashley to tell him what has happened but she gets no signal and leaves a message. Ashley listens to the message and sends one back just before the roof of the bar collapses and falls on him killing him just as he saves Peter Barlow's (Chris Gascoyne) life. Claire is left devastated in the wake of the tragedy and moves in at The Rovers with Steve and Becky."]}, {"page": "James Hooton", "response": ["In 1985, at the age of 12, he made his television debut in the children's TV series Your Mother Wouldn't Like It. He has also appeared in several other programmes, including Peak Practice, The Bill, Heartbeat and Touching Evil. In 1995, he was cast in the ITV soap opera Emmerdale as Sam Dingle. He filmed his first scene on 10 January 1995. In 1997, he appeared in director Shane Meadows' first feature film, Twenty Four Seven, where he played the character 'Wolfman' Knighty. Then a year later, he announced his decision to leave Emmerdale. He subsequently starred in The Loneliness of the Long-Distance Runner after Chris Gascoyne dropped out of the show, with Hooton having ten days to prepare for the role. In 2009, he attended the Eurogamer Expo alongside co-star Alex Carter where he revealed that he was trying to get sponsorship for a video game show he was planning to pitch to television studios. Hooton returned to Emmerdale in 2000. In 2012, Hooton returned to the stage after 15 years to star in a stage production titled Our Style is Legendary."]}, {"page": "White Wedding (song)", "response": ["The track also appeared on an advert for Coronation Street in 2003, promoting the climax of a bigamous storyline involving the character Peter Barlow. Barlow, portrayed by Chris Gascoyne, was seated at a table, reflectively spinning his two wedding rings around."]}, {"page": "The British Soap Awards", "response": ["| \"Best Actor\" || Scott Maslen (Jack Branning in EastEnders) || Chris Gascoyne (Peter Barlow in Coronation Street)Nitin Ganatra (Masood Ahmed in EastEnders)Danny Miller (Aaron Livesy in Emmerdale)", "| \"Best Dramatic Performance\" || Lacey Turner (Stacey Branning in EastEnders) || Chris Gascoyne (Peter Barlow in Coronation Street)Danny Miller (Aaron Livesy in Emmerdale)Glen Wallace (Malachy Fisher in Hollyoaks)", "| \"Best Actor\" || Danny Miller (Aaron Livesy in Emmerdale) || Chris Gascoyne (Peter Barlow in Coronation Street)Shane Richie (Alfie Moon in EastEnders)Emmett J. Scanlan (Brendan Brady in Hollyoaks)", "| \"Best Actor\" || Danny Miller (Aaron Livesy in Emmerdale) || Chris Gascoyne (Peter Barlow in Coronation Street)Shane Richie (Alfie Moon in EastEnders)Emmett J. Scanlan (Brendan Brady in Hollyoaks)"]}, {"page": "Sunita Alahan", "response": ["Sunita later leaves the shop and gets a job working at The Rovers Return Inn public house as a barmaid. She begins dating Ciaran McCarthy (Keith Duffy), causing problems between her and her friend, Shelley Unwin (Sally Lindsay), as he tried to wreck her relationship with his friend, Peter Barlow (Chris Gascoyne) but Ciaran is arrested for being absent without leave as he is still serving in the Navy. He is away for a while and Sunita starts developing feelings for Dev but Ciaran returns and they reconcile. Ciaran proposes and she accepts but he changes his mind about getting married and can't tell her so Tracy Barlow (Kate Ford) does it for him. Sunita then confronts him before ending their relationship. She briefly dates Danny Baldwin (Bradley Walsh) but ends it after discovering he is married."]}, {"page": "New Street Law", "response": ["*Chris Gascoyne as Al Ware"]}, {"page": "Lloyd Mullaney", "response": ["In December 2010, Lloyd is celebrating Peter Barlow's (Chris Gascoyne) stag night in The Joinery, when a fight erupts between him and Chris after he provokes him several times during the evening. The fight intensifies before a huge explosion ends the fight and tears through The Joinery. Lloyd, however, escapes relatively unhurt and even rescues his enemy, Chris. Lloyd kicks down the front door of number 13 only to be blasted back by huge flames. He still manages to save Josh and Freddie Peacock from the inferno along with Russ. Lloyd is left heartbroken when Chris and Cheryl tell him that they are back together. Lloyd throws Chris, Russ and Cheryl out of his house and tells Cheryl he never wants to see her again. Steve speaks to him and tells him that he should not let them get to him and that if they annoy him, then they have won. The conversation helps Lloyd see sense, and he tells Steve that he is grateful for helping him cope through the confession. Lloyd struggles to cope with losing Cheryl and Russ and at one point he grabs Karl Munro (John Michie) by the throat when he jokes about Cheryl. Lloyd sets fire to his sofa in the street as Cheryl and Chris watch. Lloyd and Chris have a fight and Chris hits his head, Cheryl learns he has been lying about his tumour and decides to leave with Russ."]}, {"page": "Peter Barlow (Coronation Street)", "response": ["Peter Barlow is a fictional character from the British ITV soap opera, Coronation Street, played by Chris Gascoyne from 2000. The character of Peter was born on screen during an episode broadcast on 5 April 1965, he was born along with his twin sister Susan (Katie Heannau, Wendy Jane Walker, Suzy Patterson, Joanna Foster) to parents Ken (William Roache) and Valerie Barlow (Anne Reid). Gascoyne made his first appearance in the role during the 40th anniversary live episode airing on 8 December 2000. Gascoyne left the role in 2003 and returned in 2007 for a brief stint before returning full-time in 2008. In January 2014 it was confirmed that Gascoyne would be leaving once again.  His final scenes aired on 14 November 2014. In April 2015, it was announced that Gascoyne would reprise the role for two episodes for the funeral of Deirdre Barlow (Anne Kirkbride) and Peter returned on 15 July 2015 and left once again the following day. In July 2016, it was announced that Peter would be returning as a regular character, with his return airing on 17 October 2016.", "Upon the character's return to the show in October 2008, Chris Gascoyne spoke of his character's destructive personality in an interview with Digital Spy, he stated, \"He's been trying against the odds to sort his life out, but he can't. And when it doesn't work and it all goes wrong for him, he has a drink. There are hurdles in his way all the time. He's stubborn and resents people telling him what to do. He'll listen to advice, but he won't take any notice if he thinks the person giving it isn't in a place to do so. That happens a lot with Ken.\"", "In an interview with ITV Chris Gascoyne said, \"Drink is becoming an issue and his self-esteem is low. He can’t see a way out and he can’t imagine doing this for the rest of his life (fatherhood).\" During the storyline he described his character as being seen as a coward, adding, \"He has the potential to be a very good dad but at the minute he feels like everything is conspiring against him and he hasn’t got the confidence or the self-esteem to cope.\""]}, {"page": "Jim McDonald (Coronation Street)", "response": ["Jim is tracked down in prison by fellow inmate Peter Barlow (Chris Gascoyne). Jim has the nickname \"The Landlord\" in prison due to his reputation of illegally selling alcohol to other prisoners. Jim agrees to give him booze, but then proceeds to cruelly blackmail Peter in a bid to get in contact with his son Steve in order to repair their relationship. He also wants to reconcile with Liz and be a part of his granddaughter Amy's (now played by Elle Mulvaney) life. Liz later visits Jim in prison and tells him that she and Steve want nothing more to do with him and that he lost his family years ago. A short while later, Jim finds Peter passed out from the booze he gave him and saves his life by calling the medical services."]}, {"page": "Karen McDonald", "response": ["Karen arrived in Coronation Street in June 2000 as a friend of Linda Sykes (Jacqueline Pirie) who she used to work with at Wheelers. Karen was taken on as a new machinist at Underworld. She quickly found herself popular with the men of the street and had a fling with Vikram Desai (Chris Bisson). Over Christmas, she was drinking alone in The Rovers Return Inn and ended up spending the night with Peter Barlow (Chris Gascoyne)."]}, {"page": "Michelle Connor", "response": ["Michelle leaves to do another tour with JD for six months. The night before she left, she sleeps with Peter Barlow (Chris Gascoyne) and she and Ryan walk in on Maria and Tony kissing and furiously storm out. She later apologises to Maria and helps her tell Michelle's parents, Helen (Dearbhla Molloy) and Barry Connor (Frank Grimes) about her new relationship. She returns in September 2009 and has a brief fling with Jake Harman (Kenny Doughty). Michelle catches the eye of Ciaran McCarthy (Keith Duffy), who relentlessly pursues her, despite Michelle giving him the cold shoulder in an attempt to mask her true feelings. Ciaran is leaving for a cruise and persuades her to go too and she accepts. Michelle and Ciaran return and are shocked when a shaken Carla tells her that while she was away, her partner, Frank Foster (Andrew Lancel), raped her and that he is on bail, awaiting trial. Michelle and Ciaran help Carla cope and persuade her not to sell the factory because of Frank's lies. Carla eventually returns to work, much to Ciaran and Michelle's relief but Underworld suffers as Carla struggles, and Michelle gratefully accepts help from Nick Tilsley (Ben Price). Michelle and Ciaran's romance also suffers as they realise that they want different things and Ciaran has doubts about Michelle. Ciaran tells Michelle that he is returning to the cruise ships and Michelle decides to go too but changes her mind, feeling that she can't leave Carla. Michelle tells Ciaran she will always love him and tearfully watches as Ciaran leaves."]}, {"page": "Lee Whitlock", "response": ["In 1987, he had a short appearance in the British movie Wish You Were Here by David Leland, and he became further notable in the television drama Two of Us - about a gay relationship between two schoolboys.BBC Genome Project - Scene Play Special: Two of Us The following year he starred alongside Coronation Street star Chris Gascoyne in Central Television's series for schools, Starting Out."]}, {"page": "Carla Connor", "response": ["Carla returns to Weatherfield and is shocked when her business partner, Nick Tilsley (Ben Price), sets up a rival factory underneath the viaduct, and refuses to work with her, but before long, Underworld is eventually repaired. Carla later invites her boyfriend, Trevor Dean (Steve Jackson) to become a trainee manager in the factory, much to Nick's annoyance. Trevor finds working in the office difficult, however, and punches Nick as Carla watches on. Nick decides to leave the factory and demands that Carla buys his shares back which cost £150,000, while Trevor leaves her to reunite with Janice Battersby (Vicky Entwistle). Carla begins drinking heavily, and is stopped by Peter Barlow (Chris Gascoyne) getting into her car. Peter decides to support her as he is also a recovering alcoholic and understands her. After being arrested for drink-driving and being collected from the police station by Peter, Carla confesses her feelings for him. Although he admits he is attracted to her, he remains faithful to Leanne Battersby (Jane Danson), his girlfriend. When Nick decides to set up a wine bar on Viaduct Street, he pressures Carla into giving him the money for his share, and she eventually remortgages her flat to get the money. Michelle later gives Carla a new idea for a product she could create in the factory. When Carla's buyer loves the idea, Carla offers Michelle a job in the office. In July 2011, Carla spends the night with her client Frank Foster (Andrew Lancel).", "In July 2010, The Sun newspaper reported that an upcoming storyline would see Carla face a drinking problem after King was pictured filming a visit to alcoholics anonymous. An insider told the paper: \"She sees Peter Barlow (Chris Gascoyne) at the meeting and backs out, pretending she is meant to be in a Spanish class next door.\"", "In May 2012, it was reported that Carla would depart with her boyfriend Peter Barlow (Chris Gascoyne) in 2012, for four months. Speaking of her departure King said: \"It's three years since I had a baby and I've been working for all of that time so I haven't been able to spend too much time with my family. I plan to have a nice holiday and spend time at home getting jobs done on the house, all very normal stuff. King insisted that she still enjoys playing Carla and has no plans to depart for good. King's exit scenes aired on 16 July 2012, she returned to filming on 1 October 2012 and was back on screen in December, and shows boss announced that Carla and Peter would return at Christmas with big news."]}, {"page": "Ieuan Rhys", "response": ["He has also appeared in many pantomimes including Snow White at The Coliseum, Aberdare and tours with Stan Stennett in Cinderella and Owen Money in three productions of Aladdin, Jack and the Beanstalk and Cinderella (directed by Michael Bogdanov). He has played Dame twice for the Welsh-language panto's Hansel & Gretel and Aladdin with Martyn Geraint. Christmas 2012, Rhys appeared in Sleeping Beauty at the New Marlowe Theatre in Canterbury with Gareth Gates and Toyah Willcox and for the 2013 Season he appeared alongside Stephen Mulhern in Cinderella at The Hawth Theatre Crawley and in 2014–15, he played King Dafydd in The Octagon Theatre, Yeovill's Jack & The Beanstalk. In 2015–16, he appeared alongside Coronation Street's Chris Gascoyne in Aladdin at The Lyceum Theatre in Sheffield. In the 2017–18, pantomime season he appeared in Sleeping Beauty at the Grove Theatre, Dunstable, as King Cuthbert, alongside, Sally Lindsay and John Partridge. 2018–19 saw Ieuan with CBeebies' Katrina Bryan and Sam Rabone in Dick whittington at the Garrick Theatre, Lichfield and for the 2019–20 season he played dame for the first time in England at Northwich Memorial Court in Peter Pan alongside John Altman from EastEnders and Katie McGlynn from Coronation Street."]}, {"page": "Huthwaite", "response": ["* Chris Gascoyne, Coronation Street actor"]}, {"page": "Inside Soap Awards", "response": ["| Alison King and Chris Gascoyne (Carla Connor and Peter Barlow, Coronation Street)Max Bowden and Tony Clay (Ben Mitchell and Callum \"Halfway\" Highway, EastEnders)Bradley Johnson and Lisa Riley (Vinny Ashdale and Mandy Dingle, Emmerdale)Haeisha Mistry and Ellis Hollins (Yasmine Maalik and Tom Cunningham, Hollyoaks)"]}]}}