{"wiki_id": "http://www.wikidata.org/entity/Q5108452", "itemLabel": "Chris Westwood", "itemDescription": "British footballer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Westwood", "wikipedia_page": {"main": "Christopher John Westwood (born 13 February 1977) is an English retired footballer.", "link_mentions": [{"page": "Dudley", "response": ["* Chris Westwood (born 1977 in Dudley) footballer, SoccerBase Database retrieved December 2017 made over 500 appearances, most for Hartlepool United F.C."]}, {"page": "Wrexham A.F.C.", "response": ["*2012–2013  Chris Westwood"]}, {"page": "Hartlepool United F.C.", "response": ["The club finished sixth in the league again in the 2004–05 season, despite the departure of Cooper just before the end of the season due to personal issues. In the play-off semi-final, they defeated Tranmere Rovers 6–5 on penalties after the sides had each won their home leg 2–0. The club failed to win promotion, losing 4–2 to Sheffield Wednesday after extra time in front of an attendance of 59,808 in the play-off final. Hartlepool had been leading 2–1 with eight minutes of regular time to go, but a controversial penalty decision in the 82nd minute, which also saw Chris Westwood sent off, allowed Sheffield Wednesday to level the scores making it 2–2 at the end of 90 minutes. Hartlepool missing a key defender, struggled in extra time and conceded two goals. Following this achievement Cooper's assistant Martin Scott was appointed as manager.", "* 2002–03  Graeme Lee,  Chris Westwood,  Mark Tinkler,  Ritchie Humphreys"]}, {"page": "Point Horror", "response": ["**11) Closeness (Chris Westwood)"]}, {"page": "Michael Nelson (footballer)", "response": ["The following season, Nelson joined Hartlepool United on the same day that Neale Cooper was appointed manager for a fee of around £70,000. Nelson was seen as natural replacement for Graeme Lee who had joined Sheffield Wednesday. Nelson started strongly for Hartlepool and scored the winner from 30 yards during his debut in Hartlepool's 4–3 win over Peterborough. This goal almost earned him another award as it was on the shortlist for Hartlepool's Goal of the Season. He was also voted September's Player of the Month on the official Hartlepool website. Nelson began to form a strong partnership with Chris Westwood and the pair played together for the majority of Hartlepool's games. Nelson went on to play in 40 of Hartlepool's league matches and played in both legs of Hartlepool's play-off semi-final match against Bristol City. Nelson was in contention for Hartlepool's Fans and Players' Player of the season but he missed out to Jim Provett on both occasions."]}, {"page": "Jude Kuring", "response": ["In 1981, she and Chris Westwood formed a women's subgroup in the APG. The two had been discussing the lack of women's roles in Australian theater, often relegated to the stereotypical \"hooker with a heart of gold\", or as a mother, and began organizing members at Nimrod Theatre. They were also given a $110,000 Limited Life Project grant from the Theatre Board of the Australian Council, which they used for a variety of projects including two sets of play readings, a series of acting workshops and included hosting a seminar on women, comedy and music.Watson, Sophie. Playing the State: Australian Feminist Interventions. London: Verso, 1990. (pg. 219); "]}, {"page": "Paul Arnison", "response": ["During the 2001–02 season, Arnison was limited to 19 league games, but helped Hartlepool to reach the play-off semi-finals. Arnison scored his first goal of the season during the play-off semi-final second leg against Cheltenham Town. However, after the result finished 2–2 on aggregate, Arnison and Hartlepool were knocked out on penalties. During the summer, Arnison signed a contract extension, along with fellow defender Chris Westwood and top goalscorer Gordon Watson, to stay at Hartlepool for another season. Arnison was offered another deal at the end of the following season by new boss Mike Newell after Pools had secured promotion to Division Two."]}, {"page": "2007–08 Peterborough United F.C. season", "response": ["|Chris Westwood", "| Chris Westwood || 0||3 "]}]}}