{"wiki_id": "http://www.wikidata.org/entity/Q5107053", "itemLabel": "Chris Joyce", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Joyce", "wikipedia_page": {"main": "Chris Joyce (born 11 October 1957, Manchester, England) is known for being drummer with various groups, and with Simply Red in the 1980s.\nComing from Chorlton, Manchester, he adopted the hippie lifestyle. His most remote band was Fast Breeder, a short-lived late 1970s punk group from Manchester formed by him on drums and Dave Rowbotham on guitar, and managed by Tony Wilson. Wilson called Joyce and Rowbotham to form a band alongside guitarist Vini Reilly and bass guitarist Tony Bowers, The Durutti Column. That line-up released only two songs from Factory's first EP, A Factory Sample, before Joyce. Rowbotham and Bowers quit the band to form another post-punk band around 1979, The Mothmen.\nThe Mothmen released only two studio albums and a number of singles, before disbanding in the 1980s. During his time with The Mothmen, Joyce worked with Pink Military, London Underground and Judy Nylon. By the mid-1980s, he was working with Suns of Arqa, playing drums on their second LP Wadada Magic.  He later formed Simply Red, alongside his bandmate Tony Bowers and singer Mick Hucknall.\nJoyce shares further details of his life and career, up to and beyond his work with Simply Red, in his biography on Chris Joyce School of Drums.", "link_mentions": [{"page": "The Durutti Column", "response": ["In 1978 Tony Wilson and Alan Erasmus, later partners in Factory Records, assembled a band around the remnants of local punk rock band Fast Breeder, drummer Chris Joyce and guitarist Dave Rowbotham. The name was derived from a misspelling of the Durruti Column, an anarchist military unit in the Spanish Civil War, named after Buenaventura Durruti. The name was also taken from a four-page comic strip entitled \"Le Retour de la Colonne Durruti\" (\"The Return Of The Durruti Column\")Shadowplayers, p. 49 by André Bertrand, which was handed out amidst student protests in October 1966 at Strasbourg University.Shadowplayers, p. 29"]}, {"page": "Simply Red", "response": ["The initial Simply Red line-up consisted of Mick Hucknall (vocals), David Fryman (guitar), Tony Bowers (bass), Fritz McIntyre (keyboards and vocals), Tim Kellett (brass and live backing vocals) and Chris Joyce (drums). Bowers and Joyce had both previously been members of post-punk bands The Durutti Column and The Mothmen; Kellett had also been a member of The Durutti Column, though not at the same time as Bowers and Joyce.", "*Chris Joyce – drums, percussion (1985–1991)"]}, {"page": "Buckinghamshire New University", "response": ["*Chris Joyce – Actor"]}, {"page": "Something Got Me Started", "response": ["Simply Red had achieved considerable commercial and critical success from the mid-1980s onwards with their own blue-eyed soul style that saw them repeatedly reach the top 10 around the world. Despite the 1989 album A New Flame selling over two million copies in the UK alone, frontman Mick Hucknall was keen to develop the sound of the band further. The same year A New Flame was released, a number of dance-orientated records had started to infiltrate the UK singles chart, most notably the songs from the group Soul II Soul. In 2005, when interviewed for the Classic Albums episode on the making of the Stars album, Hucknall commented that he wanted a programmed drum sound that didn't sound synthetic. This led him to working with new musicians, including musician Gota Yashiki whose expertise with drum programming effectively replaced founder drummer Chris Joyce. Producer Stewart Levine also introduced Hucknall to Heitor Pereira which changed the guitar sound on the record, putting more emphasis on rhythm than melody. An early version of the song \"Something Got Me Started\" was premiered in a March 1990 concert in Didsbury, Manchester, whilst the group were promoting A New Flame (later released on the VHS/Laserdisc Let Me Take You Home)."]}, {"page": "The Mothmen", "response": ["The Mothmen were a short-lived post-punk band from England, formed around 1979 by Dave Rowbotham, Chris Joyce and Tony Bowers, shortly after they left The Durutti Column, including ex-Alberto Y Lost Trios Paranoias singer Bob Harding.", "In 1978, Tony Wilson and Alan Erasmus cofounded The Durutti Column, with guitarists Vini Reilly and Dave Rowbotham, bassist Tony Bowers (formerly of Alberto Y Lost Trios Paranoias), drummer Chris Joyce, and vocalist Phil Rainford. After releasing two songs in a various artists compilation, A Factory Sample, that year, the Durutti Column became the sole concern of Reilly and Bowers, as Rowbotham and Joyce departed and formed The Mothmen, alongside former Alberto Y Lost Trios Paranoias singer Bob Harding. So, the first lineup comprised Joyce on drums; Bowers on guitar, bass, vocals, violin, and percussion; Rowbotham on guitar and bass; and Bob Harding on bass, organ, guitar, vocals, and percussion. In 1979, they released their debut single on Absurd Records, \"Does It Matter Irene?\"", "In 1991, founding guitarist Dave Rowbotham was murdered. Tony Bowers lives between Italy and Ireland where he works on various musical projects . Chris Joyce shares further details of his life and career, up to and beyond his work with Simply Red, on his biography in Chris Joyce School of Drums."]}, {"page": "Wadada Magic", "response": ["Founder Michael Wadada performs on this album with koto, piano, acoustic guitar, temple blocks, percussion and vocals.  The band also comprises Pulse & Chris Joyce on drums, Spliff on bass, Aziz Zeria on harmonium, swar mandal and vocals, Kalu & Papu Zeria on tablas, Big Red on fiddle, banjo and mandolin, Helen Watson on vocals, Mustaphafakir on dilruba, electric Spanish and Hawaiian guitars, marimba, Jew's harp and vocals."]}, {"page": "Picture Book (Simply Red album)", "response": ["# \"I Won't Feel Bad\" (Hucknall, McIntyre, Tim Kellett, Chris Joyce, Tony Bowers, Sylvan Richardson)", "*Chris Joyce – drums and percussion"]}, {"page": "Men and Women (album)", "response": ["*Chris Joyce – drums and percussion"]}, {"page": "A New Flame", "response": ["* Chris Joyce – drums"]}, {"page": "A Factory Sample", "response": ["*Chris Joyce – drums"]}, {"page": "Dave Rowbotham", "response": ["Born in Didsbury, Manchester, England, he went to school at Elm Grove Primary School and then Parrswood High School. He left school to train as an electrician and in 1970 he started playing rhythm guitar with his pals in a four piece rock cover band called Flashback. He later adopted the hippie lifestyle. During the punk era, he, alongside drummer Chris Joyce, played in a band called Fast Breeder and was managed by Alan Erasmus, who later co-founded Factory Records with Tony Wilson. In 1978, the pair, alongside Alberto Y Lost Trios Paranoias bassist Tony Bowers, singer Phil Rainford (replaced after months by Colin Sharp), and former Nosebleeds guitarist Vini Reilly, founded the post-punk band The Durutti Column. "]}]}}