{"wiki_id": "http://www.wikidata.org/entity/Q5102875", "itemLabel": "Chloe Moss", "itemDescription": "English playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/Chloe_Moss", "wikipedia_page": {"main": "Chloë Moss (born 1976 in Liverpool) is an English playwright and screenwriter.\n\n", "link_mentions": [{"page": "Chloe", "response": ["* Chloe Moss (born 1976), British playwright"]}, {"page": "List of British playwrights since 1950", "response": ["*Chloe Moss"]}, {"page": "How Love is Spelt", "response": ["How Love is Spelt is a 2005 play written by Chloe Moss.  "]}, {"page": "Bush Theatre", "response": ["* 2006 Christmas Is Miles Away by Chloe Moss", "* 2004 How Love Is Spelt by Chloe Moss"]}, {"page": "Moss (surname)", "response": ["*Chloe Moss (born 1976), British dramatist"]}, {"page": "Summer Play Festival", "response": ["Artists included Ally Sheedy, Mary Beth Peil, Marin Hinkle, John Gould Rubin, Annie Parisse, Katherine Waterston, Stew, Annie Golden, Adam Gwon, Jeremy Schonfeld, Georgia Stitt, Sam Gold, Beau Willimon, Christopher Gattelli, Trip Cullman, Jordan Harrison, Chloe Moss, Evan Cabnet, Kristoffer Diaz, Adam Driver, J.T. Rogers, and Quiara Hudes."]}, {"page": "April De Angelis", "response": ["*Catch (with Stella Feehily, Tanika Gupta, Chloe Moss and Laura Wade) (2007, Royal Court Theatre)"]}, {"page": "Joe Armstrong (actor)", "response": ["In 2003, Armstrong had the dual roles of Adam and Jeff in Protection by Fin Kennedy at the Soho Theatre.Fisher, Philip. Review of Protection, The British Theatre Guide, 2003. Retrieved 2011-01-30. He appeared in How Love Is Spelt by Chloe Moss at the Bush Theatre in 2004Sierz, Aleks. Review of How Love Is Spelt, The Stage, 4 October 2004. Retrieved 2011-01-30. and in A Night at the Dogs by Matt Charman at the Soho Theatre in 2005.Neill, Heather. Review of A Night at the Dogs , What's On Stage, 13 April 2005. Retrieved 2011-01-30.", "| Chloe Moss"]}, {"page": "Ian Redford (actor)", "response": ["* Mike in The Gatekeeper by Chloe Moss. Directed by Tessa Walker at the Royal Exchange, Manchester (2012)"]}, {"page": "Susan Smith Blackburn Prize", "response": ["*Chloe Moss 2004–05†"]}, {"page": "The Way Home", "response": ["* The Way Home (play), a 2006 play by Chloe Moss"]}, {"page": "Amy McAllister", "response": ["Film credits include the Oscar-nominated Philomena, Ruby Strangelove, and the forthcoming romantic comedy For Love Or Money. She has appeared on television as teenage runaway Mary in BBC drama Call the Midwife, as cancer patient Annabelle Taylor in BBC drama Holby City, as Ruth in The Great Fire, and as Della Morgan in Doctors. McAllister's other theatre work includes Brighton Beach Memoirs, The Lion, the Witch, and the Wardrobe, Don Juan Comes Back from the War, The Tinker's Wedding, and The Way Home by award-winning writer Chloe Moss."]}, {"page": "Anne Kauffman", "response": ["Past Off-Broadway productions include Maple and Vine by Jordan Harrison (2011) and Pulitzer Prize finalist play Detroit by Lisa D'Amour (2012) at Playwrights Horizons;.Healy, Patrick. \"Staging a Sisterhood\". The New York Times, January 31, 2013 Stunning by David Adjmi (2009) and Slowgirl by Greg Pierce (2012) at LCT3 ;\"INTERVIEW: Slowgirl's Anne Kauffman Takes a Direct Approach\". TheaterMania, 2012 You'd Better Sit Down: Tales From My Parents' Divorce (Written with The Civilians) at The Flea Theater (2012); This Wide Night by Chloe Moss by Naked Angels Theater Company (2010); Sixty Miles to Silver Lake by Dan Le Franc at Soho Rep (2009); Have You Seen Steve Steven by Ann Marie Healy with 13P (2007); God's Ear by Jenny Schwartz at The Vineyard and New Georges (2007); and The Ladies by Anne Washburn  at the Cherry Lane Theater and Dixon Place (2004).\"The Go-To Two: Ken Rus Schmoll and Anne Kauffman \". The Village Voice February 4, 2009", "She was nominated for the 2011 Lucille Lortel Award, Outstanding Director for This Wide Night by Chloe Moss.This Wide Night, lortel.org, accessed October 26, 2016"]}, {"page": "Lisa Goldman", "response": ["Notable new writing during her Soho programme (Jan 2007-May 2010) included the multi-award winning Baghdad Wedding by Hassan Abdulrazzak, Baghdad Wedding video excerpt and links to reviews the first British play about the war on Iraq to be written by an Iraqi; The Guardian, 18 January 2008  Everything Must Go, the first UK plays written in response to the economic crash of 2008; The Guardian, 27 June 2009  Orphans by Dennis Kelly, Pure Gold by Michael Bhim, Static by Dan Reballato, The Long Road by Shelagh Stevenson (co-pro Synergy), Midsummer by David Greig (co-production Traverse Theatre) ; Aalst and Venus as a Boy (co productions National Theatre of Scotland), White Boy by Tanika Gupta (co-production National Theatre of Scotland), An Oak Tree by Tim Crouch, Kim Noble will Die, Marisa Carnesky’s Magic War, Roaring Trade by Steve Thompson, This isn’t Romance by In-sook Chappell (winner of the Verity Bargate Award 2007); A Couple of Poor Polish Speaking Romanians by Dorota Maslowska, English version by Lisa Goldman and Paul Sirett; Piranha Heights (Runner-up What's On Stage Best Production and Writers Guild Best Play) and Leaves of Glass by Philip Ridley, Moonwalking in Chinatown by Justin Young; Iya Ile by Oladipo Agboluaje (co-production Tiata Fahodzi, runner up Olivier Award Olivier Awards website); This Wide Night by Chloe Moss (winner of Susan Smith Blackburn Award Susan Smith Blackburn Award); Joe Guy by Roy Williams (co-production Tiata Fahodzi); God in Ruins by Anthony Neilson (RSC) and Edward Gant’s Amazing Feats of Loneliness (Headlong); The Kitchen (Gob Squad); The Diver (co-production Setagaya Theatre, Japan with Kathryn Hunter and Hideki Noda); Fathers Inside (National Youth Theatre); Bette Bourne & Mark Ravenhill: A Life in Three Acts; Promises, Promises by Douglas Maxwell; Shraddha by Natasha Langridge Meyer-Whitworth Award; Behud by Gurpreet Kaur Bhatti runner up Index on Censorship Award; Blasted by Sarah Kane (Graeae Theatre Company); Spill Festival including Forced Entertainment's Void Story."]}, {"page": "Dante or Die Theatre", "response": ["* Handle With Care (2016), a co-commission between The Lowry, Harlow Playhouse, South Street Arts Center, Reading and The Lighthouse (Poole). Staged in local self storage containers, this production explores how we accumulate objects and how they can create a sense of home throughout our lives. Production written by Chloe Moss and inspired by consultations with a University College London psychologist who specialised in memory.", "* I Do (2013), a jigsaw production displayed across six hotel rooms depicting the moments before a wedding ceremony, co-written by Chloe Moss. Commissioned by Almeida Theatre and South Street Arts, Reading, this production has been performed in Hilton Hotels and Malmaison hotels."]}]}}