{"wiki_id": "http://www.wikidata.org/entity/Q5107548", "itemLabel": "Chris Murtagh", "itemDescription": "English cricketer (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Murtagh", "wikipedia_page": {"main": "Christopher Paul Murtagh (born 14 October 1984) is an English cricketer who played for Surrey County Cricket Club before being released in 2009. He is a right-handed batsman. Murtugh attended the selective The John Fisher School and made his first-class cricket debut for Loughborough UCCE in 2005, turning out for Surrey in some one-day games later in the season. A prolific season in 2007 earned him his first full contract for the 2008 season. He is the younger brother of Tim Murtagh.\nIn 2010, Murtagh was selected as one of 21 players to form the first Unicorns squad to take part in the Clydesdale Bank 40 domestic limited overs competition against the regular first-class counties. He played for Shropshire County Cricket Club in the 2010, 2011 and 2013 seasons, having also played club cricket with Reigate Priory Cricket Club.", "link_mentions": [{"page": "Warwickshire County Cricket Club in 2005", "response": ["Warwickshire Bears hammered the Surrey Lions' bowlers at Edgbaston, which resulted in the Bears recording 292 for 8 batting first. Neil Carter set that pace, taking eleven fours in a blitzing thirty-ball 51 – his fourth half-century in List A cricket. Jade Dernbach had him caught, however, but that did not stop Warwickshire, as Jamie Troughton slashed five sixes and six fours before brothers Tim and Chris Murtagh combined to remove him for 82 – caught Chris, bowled Tim. However, Troughton had added 144 with Jonathan Trott, and not even four late wickets from Rikki Clarke could stop the flow of runs, and both Jade Dernbach and Azhar Mahmood conceded 61 in their nine overs. Surrey had six batsmen going into double figures in their reply, but no partnership was worth 50, as Jamie Anyon and Trott got three wickets each. Extras were the second highest scorer, with 32, behind Clarke's 42."]}, {"page": "Surrey County Cricket Club in 2005", "response": ["Warwickshire Bears hammered the Surrey Lions' bowlers at Edgbaston, which resulted in the Bears recording 292 for 8 batting first. Neil Carter set that pace, taking eleven fours in a blitzing thirty-ball 51 – his fourth half-century in List A cricket. Jade Dernbach had him caught, however, but that didn't stop Warwickshire, as Jamie Troughton slashed five sixes and six fours before brothers Tim and Chris Murtagh combined to remove him for 82 – caught Chris, bowled Tim. However, Troughton had added 144 with Jonathan Trott, and not even four late wickets from Rikki Clarke could stop the flow of runs, and both Jade Dernbach and Azhar Mahmood conceded 61 in their nine overs. Surrey had six batsmen going into double figures in their reply, but no partnership was worth 50, as Jamie Anyon and Trott got three wickets each. Extras were the second highest scorer, with 32, behind Clarke's 42."]}, {"page": "National League Division Two in 2005", "response": ["Warwickshire Bears hammered the Surrey Lions' bowlers at Edgbaston, which resulted in the Bears recording 292 for 8 batting first. Neil Carter set that pace, taking eleven fours in a blitzing thirty-ball 51 – his fourth half-century in List A cricket. Jade Dernbach had him caught, however, but that did not stop Warwickshire, as Jamie Troughton slashed five sixes and six fours before brothers Tim and Chris Murtagh combined to remove him for 82 – caught Chris, bowled Tim. However, Troughton had added 144 with Jonathan Trott, and not even four late wickets from Rikki Clarke could stop the flow of runs, and both Jade Dernbach and Azhar Mahmood conceded 61 in their nine overs. Surrey had six batsmen going into double figures in their reply, but no partnership was worth 50, as Jamie Anyon and Trott got three wickets each. Extras were the second highest scorer, with 32, behind Clarke's 42."]}, {"page": "The John Fisher School", "response": ["* Tim and Chris Murtagh, Professional cricket playersTim Murtagh player profile at Cricinfo, accessed 26 April 2009.Chris Murtagh player profile at Cricinfo, accessed 26 April 2009. (both attended during the selection policy)"]}, {"page": "Murtagh", "response": ["*Chris Murtagh, English cricketer, brother of Tim, nephew of Andy"]}, {"page": "Andy Murtagh", "response": ["His nephews, Tim and Chris Murtagh, have played first-class and List-A cricket – Tim for Surrey, Middlesex and Ireland, Chris for Surrey."]}, {"page": "List of people from the London Borough of Lambeth", "response": ["* Chris Murtagh (born 1984) cricketer who has played for Surrey County Cricket Club, the Reigate Priory Llamas and Shropshire County Cricket Club"]}, {"page": "List of Surrey Twenty20 cricket records", "response": ["|  Chris Murtagh || v Kent || Canterbury || 2008"]}, {"page": "Chris Russell", "response": ["Having played for the Worcestershire Second XI since 2008, Russell made his full debut for Worcestershire in a List A match against the Unicorns in the 2010 Clydesdale Bank 40, claiming his maiden List A wicket when he dismissed Chris Murtagh.  He made a further appearance in that competition against Surrey.  Russell didn't feature for Worcestershire in the 2011 season. A notable appearance in the 2012 season saw Russell gain match figures of 6-72 in a drawn two-day tour match against South Africa - only days after England had only managed to take two wickets in a five-day test match."]}, {"page": "List of Unicorns List A players", "response": ["*Chris Murtagh (2010): CP Murtagh"]}]}}