{"wiki_id": "http://www.wikidata.org/entity/Q5108096", "itemLabel": "Chris Smith", "itemDescription": "cricketer born in 1958", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Smith_(cricketer,_born_1958)", "wikipedia_page": {"main": "Christopher Lyall Smith (born 15 October 1958) was a cricketer for Hampshire and England. He also played one match for Glamorgan in 1979, while playing in the South Wales League, and in South Africa he played for Natal B (then a first-class team).", "link_mentions": [{"page": "Chris Smith", "response": ["Chris Smith may refer to:", "*Chris Smith (composer) (1879–1949), American composer and performer", "*Chris Smith, lead guitarist/vocalist in the band Keelhaul", "*Chris Smith, vocalist in Mythology", "*Chris Smith, touring drums in Short Stack", "*Chris Smith, keyboardist in Jefferson Starship", "*Chris Smith, drummer and producer, member of The Internet", "*Chris Smith (broadcaster), Australian talkback radio broadcaster and radio host", "*Chris Smith (filmmaker) (born 1970), American filmmaker", "*Chris Smith (newsreader), British radio journalist", "*Chris Smith (EastEnders), fictional soap opera character", "*Chris Smith (New Jersey politician) (born 1953), U.S. Representative from New Jersey", "*Chris Smith (Florida politician) (born 1970), Florida state senator", "*Chris Smith, Baron Smith of Finsbury (born 1951), former British Member of Parliament and government minister", "*Chris Smith (footballer, born 1981), English footballer", "*Chris Smith (footballer, born 1986), Scottish footballer", "*Chris Smith (footballer, born 1988), Scottish footballer", "*Chris Smith (footballer, born 1990), English footballer", "*Chris Smith (footballer, born 1998), English footballer", "*Chris Smith (first baseman) (born 1957), American baseball player", "*Chris Smith (pitcher, born 1981), American baseball player", "*Chris Smith (pitcher, born 1988), American baseball player", "*Chris Smith (basketball, born 1939), American college basketball player at Virginia Tech", "*Chris Smith (basketball, born 1970), American basketball player in the 1990s", "*Chris Smith (basketball, born 1987), American basketball player, attended Manhattan and Louisville", "*Chris Smith (basketball, born 1999), American basketball player, attended UCLA", "*Chris Smith (defensive back) (born 1987), American football player", "*Chris Smith (defensive end) (born 1992), American football player", "*Chris Smith (running back, born 1963), American football player", "*Chris Smith (running back, born 1999), American football player", "*Chris Smith (safety) (born 1985), American football safety in the Canadian Football League", "*Chris Smith (tight end) (born 1966), American football player", "*Chris Smith (rugby league, born 1975), Welsh rugby league footballer", "*Chris Smith (rugby league, born 1994), Australian rugby league footballer", "*Chris Smith (rugby union) (born 1994), South African rugby union player", "*Chris Smith (Australian footballer) (born 1955), Australian rules footballer for Fitzroy", "*Chris Smith (Australian footballer, born 1988), Australian rules footballer from Queensland, drafted by Fremantle", "*Chris Smith (cricketer, born 1958) (born 1958), English cricketer", "*Chris Smith (cricketer, born 1973), Australian-born former Dutch cricketer", "*Chris Smith (racing driver) (born 1966), race car driver, 1992 Atlantic Series Champion", "*Chris Smith (golfer) (born 1969), American PGA Tour golfer", "*Chris Smith (science communicator) (born 1975), medical doctor and radio broadcaster on the BBC", "*Chris Smith (professor), professor of biology", "*Chris Smith (priest) (born 1963), archdeacon of Morgannwg", "*Chris Smith (American academic) (born 1958), American legal academic"]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Chris Smith"]}, {"page": "List of International cricket families", "response": ["* Chris Smith"]}, {"page": "Hampshire County Cricket Club", "response": ["Again, however, Hampshire were disappointing until Barry Richards joined the county in 1968, when they rose from tenth to fifth in the Championship and established themselves as a power in limited-overs cricket. Bob Cottam was the second-highest first-class wicket-taker in 1968 and the highest in 1969, but did not maintain this excellence before joining Northamptonshire and in 1970 and 1971 Hampshire fell to mid-table. In the 1973 County Championship Hampshire won the County Championship for a second time, winning the competition by 31 points from Surrey. The club won 10 of their 20 matches and drew the other 10. During this season they were led by Richard Gilliat with Gordon Greenidge scoring the most runs for the club with 1,620. Bob Herman and Mike Taylor both took 63 wickets. This remains Hampshire's last success in the tournament.  In 1979 West Indian Malcolm Marshall, widely regarded as one of the best bowlers to grace the game joined the club. This was to be the start of a 14-year stay with the club. During that time Marshall would go on to take 824 first-class wickets at an average of 18.64 and 239 wickets at 24.88 in one-day cricket. 1984 also saw the last game of Venezuelan captain Nick Pocock (Maracaibo, 1951) and the arrival of another West Indian, Cardigan Connor who would spend 14 years with the club. Regarded as one of the best players not to play Test cricket, Connor took 614 first-class wickets for Hampshire at an average of 31.74 and 411 wickets at 25.07 in one-day cricket.  In 1985 Hampshire finished second in the County Championship, finishing 18 points behind winners Middlesex. Chris Smith led the way with the bat, scoring 1,720 runs. and was well backed up by the bowling of Malcolm Marshall who took 95 wickets at the impressive average of 17.68.  Later in, 1988 the club won the Benson & Hedges Cup by beating Derbyshire by 7 wickets at Lord's, largely thanks to a five wicket haul by Stephen Jefferies. The 1990s brought about further success in the first half of the decade, and later struggles in the latter half. In the 1991 County Championship season Hampshire won the NatWest Trophy, defeating Surrey by 4 wickets, with Shaun Udal claiming the man of the match award. This was the clubs first one day honour in this competition. Hampshire again repeated their 1988 success in the Benson & Hedges Cup by winning the 1992 competition. In the final at Lord's they beat Kent by 41 runs, including 90 runs from Robin Smith and three wickets each from Malcolm Marshall and Shaun Udal.  This marked Hampshire's second success in the competition. In 1996 Malcolm Marshall returned to coach the club. In 1997 work begun on Hampshire's long-awaited new ground. The realisation of this move almost led the club to financial ruin, as encouragement from financial partners Sport England and the hiring of architect Sir Michael Hopkins had led the then part-time voluntary committee running the club to lose control of the budget."]}, {"page": "Neil Foster", "response": ["Foster made his Test debut against New Zealand at Lord's in 1983, with Jeremy Coney becoming his first wicket and only wicket of that game. Foster made his debut alongside other debutants, Nick Cook and Chris Smith, and it was the first time since 1959 that England had fielded three new players in a home Test."]}, {"page": "1983 English cricket season", "response": ["*Wisden - Mohinder Amarnath, Jeremy Coney, John Emburey, Mike Gatting, Chris Smith"]}, {"page": "Northwood School (Durban North, South Africa)", "response": ["*Chris Smith"]}, {"page": "South Africans in the United Kingdom", "response": ["|Chris Smith"]}, {"page": "Arundel Castle Cricket Ground", "response": ["Many matches have been played at the ground over the years by Sussex, often as part of the Arundel Festival, an annual event held in August. Arundel Castle's first List A match was a 1972 match between Sussex and Gloucestershire in the John Player League. Gloucestershire won the match by 2 wickets, helped by a five-wicket haul from Mike Procter. In 1990, Arundel Castle hosted its first County Championship match. The match was between Sussex and Hampshire and ended in a draw, after Colin Wells scored a century for Sussex and Chris Smith scored a century for Hampshire."]}, {"page": "List of Hampshire County Cricket Club first-class cricket records", "response": ["| 1st || 347 || Paul Terry & Chris Smith || Warwickshire || Edgbaston, Birmingham || 1987"]}, {"page": "List of Hampshire County Cricket Club List A cricket records", "response": ["* Most Runs in Season: 1,004 Chris Smith, 1991", "|Chris Smith|||| 6,301"]}, {"page": "Paul Whittaker (cricketer)", "response": ["Whittaker made his debut for Norfolk in the 1983 MCCA Knockout Trophy against Berkshire.  Whittaker played Minor counties cricket for Norfolk from 1983 to 1989, which included 27 Minor Counties Championship matches and 13 MCCA Knockout Trophy matches.   He made his List A debut against Hampshire in the 1984 NatWest Trophy.  In this match, he ended the Norfolk innings not out on 4, while with the ball he took the wicket of Chris Smith for the cost of 5 runs from 7 overs.  He made a further List A appearance against Leicestershire in the 1985 NatWest Trophy.  In this match, he was dismissed for a single run by Les Taylor, while with the ball he bowled 10 wicket-less overs."]}, {"page": "Boughton Hall Cricket Club Ground", "response": ["* Highest individual innings: 159 by Chris Smith for Hampshire v Cheshire, 1989"]}, {"page": "List of international cricket five-wicket hauls by Richard Hadlee", "response": ["*Chris Smith"]}, {"page": "List of Glamorgan County Cricket Club players", "response": ["* Chris Smith (1979) : C. L. Smith"]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["* Chris Smith (1984) : C. L. Smith (Hampshire)"]}, {"page": "List of English international cricketers born outside of England", "response": ["|Basil D’Oliviera, Tony Greig, Ian Greig, Allan Lamb, Chris Smith, Robin Smith, Andrew Strauss, Kevin Pietersen, Matt Prior, Jonathan Trott, Craig Kieswetter, Jade Dernbach, Stuart Meaker, Nick Compton, Michael Lumb, Jason Roy, Keaton Jennings, Tom Curran, Brydon Carse"]}]}}