{"wiki_id": "http://www.wikidata.org/entity/Q5106501", "itemLabel": "Chris England", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_England", "wikipedia_page": {"main": "Chris England (born 20 January 1961 in Oldham) is an English writer and actor. He is best known for the comedy play An Evening with Gary Lineker, which he wrote with Arthur Smith, and the book Balham to Bollywood.", "link_mentions": [{"page": "Alternate history", "response": ["In Nick Hancock and Chris England's 1997 book What Didn't Happen Next: An Alternative History of Football it is suggested that, had Gordon Banks been fit to play in the 1970 FIFA World Cup quarter-final, there would have been no Thatcherism and the post-war consensus would have continued indefinitely."]}, {"page": "Gary Lineker", "response": ["He participated in Prince Edward's charity television special The Grand Knockout Tournament in 1987. Lineker also appeared in the 1991 play An Evening with Gary Lineker by Arthur Smith and Chris England, which was adapted for television in 1994. He presented a six-part TV series for the BBC in 1998 (directed by Lloyd Stanton) called Golden Boots, with other football celebrities. It was an extensive history of the World Cup focusing on the 'Golden Boots' (top scorers)."]}, {"page": "1990 in film", "response": ["| A Man Called Sarge || The Cannon Group || Stuart Gillard (director/screenplay); Gary Kroeger, Gretchen German, Jennifer Runyon, Marc Singer, Bobby DiCicco, Andy Bumatai, Howard Busgang, Chris England, Jeffry Wickham, Peter Dennis, Natasha Lyonne, Bruce Jenner, Don LaFontaine, Andy Greenhalgh, Michael Mears, Travis McKenna, Yehuda Efroni || Comedy || Live action"]}, {"page": "Fred Karno", "response": ["Karno's comedy companies were the basis of a trilogy of novels by Chris England."]}, {"page": "Lagaan", "response": ["*Chris England as Yardley, an English fast bowler. England also wrote a book about his experience making the film titled Balham to Bollywood"]}, {"page": "Michael Beckley", "response": ["Beckley continued to enjoy a run of successful and critical theatre roles. He returned to the West End for nearly a year to play Ernst Ludwig in Rufus Norris' wildly successful Cabaret at the Lyric Theatre on Shaftesbury Avenue. He played leading man Matt Holden in Chris England's play Breakfast With Jonny Wilkinson for the (then newly successful) Menier Chocolate Factory and would reprise the role in the film version in 2012."]}, {"page": "Netaji Subhas Chandra Bose: The Forgotten Hero", "response": ["* Chris England as CID Chief"]}, {"page": "All Change", "response": ["All Change is an English children's television show on ITV in two series. Originally broadcast in 1989 and 1991, it starred Frankie Howerd, Peggy Mount, Maggie Steed, Tony Haygarth and Pam Ferris. The series was devised by Morwenna Banks and Chris England."]}, {"page": "Room 101 (radio series)", "response": ["*Chris England (18 March 1994)"]}, {"page": "Debbie Gates", "response": ["*Revolting Animals, written and told by Morwenna Banks, Chris England, Andy Taylor and Chris Lang. The program was  shot on location at the London Zoo and shown in 1988.", "*Jellyneck, written and told by Morwenna Banks, Chris England, Andy Taylor and Chris Lang. The program was  shot on location and shown in 1989."]}, {"page": "An Evening with Gary Lineker", "response": ["An Evening with Gary Lineker is a 1991 stage play and 1994 television film both written by Arthur Smith and Chris England.", "*Chris England as Man in toilet"]}, {"page": "Menier Chocolate Factory", "response": ["*Breakfast With Jonny Wilkinson by Chris England April 2006"]}, {"page": "Laurence Olivier Award for Best New Comedy", "response": ["| Arthur Smith and Chris England"]}, {"page": "Bostock's Cup", "response": ["Bostock's Cup was a one-off British television comedy drama about a football team which appeared on ITV on the eve of the 1999 European Cup final. It was written by Chris England, directed by Marcus Mortimer and produced by Mark Robson. It starred Tim Healy as the club's manager, Neil Pearson as a veteran sportscaster, and Nick Hancock as his upstart rival. The film featured innovative use of old footage of 1970s football matches to recreate the era. It was aired on 25 May 1999."]}, {"page": "A Man Called Sarge", "response": ["* Chris England as Fergus"]}, {"page": "1992 Laurence Olivier Awards", "response": ["** An Evening with Gary Lineker by Chris England and Arthur Smith – Duchess"]}, {"page": "Blind Men", "response": ["Written by the duo Chris England and Nick Hancock, the series starred Jesse Birdsall and Roger Blake as Phil Carver and Bob as the window blind salesmen and Graham Holdcroft (Jeremy Swift) is a hard-working but not too successful window blinds people. Rival salesmen Tony, Neil and Bob compete with him for sales, encouraged by their young and verbally abusive boss Ian Stapleton. Things go downhill for the team when wonder-salesman Phil Carver is transferred in and the rivalry really intensifies."]}]}}