{"wiki_id": "http://www.wikidata.org/entity/Q5112560", "itemLabel": "Christopher Holland", "itemDescription": "English keyboardist, singer, songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Holland", "wikipedia_page": {"main": "Christopher William Holland is an English keyboard player, singer and songwriter. He is the younger brother of pianist and band-leader Jools Holland.", "link_mentions": [{"page": "Squeeze (band)", "response": ["The new LP featured complex double-tracked keyboard parts which could not be duplicated by a single keyboard player in a live setting; hence, Jools' brother Christopher Holland, then aged 17, played and toured as a second keyboardist in 1985. Christopher had also played Hammond organ on the album's fourth single \"Heartbreaking World\", which was sung by Jools Holland. However, Christopher Holland's tenure was short-lived, for he had signed to I.R.S. Records and was pursuing a solo career, so he was replaced by an official new member: Andy Metcalfe of The Soft Boys and The Egyptians. A bassist in those groups, Metcalfe played keyboards with Squeeze. His tenure as the band's sixth member lasted until 1988.", "For the 1998 album Domino, the band was again a quintet consisting of Difford, Tilbrook, bassist Hilaire Penda, ex-Del Amitri drummer Ashley Soan, and yet another returning keyboardist in the person of Christopher Holland. Nick Harper often performed with this version of Squeeze as a guest touring musician, providing additional guitar and vocals. In January 1999, just days before a planned tour, Chris Difford suddenly announced that he was taking a \"hiatus\" from Squeeze. The last venue at which Squeeze played with Difford was at The Charlotte, Leicester, England. The band subsequently continued as a quartet led by Tilbrook, with Jim Kimberley replacing Soan on some tour dates, and Christopher Holland exiting in the autumn to be replaced by Tilbrook's other frequent writing partner Chris Braide."]}, {"page": "Jools Holland", "response": ["In 1987, Holland formed the Jools Holland Big Band, which consisted of himself and for the show Gilson Lavis from Squeeze. This gradually became the 18-piece Jools Holland's Rhythm and Blues Orchestra. The Orchestra includes singers Louise Marshall and Ruby Turner and his younger brother, singer-songwriter and keyboard player, Christopher Holland."]}, {"page": "Green on Red", "response": ["A major-label deal with Phonogram/Mercury followed, with the 7-song EP No Free Lunch released in summer 1986. A strong country music direction was evident, which music critic Ira Robbins remarked \"should finally erase the group's original misassociation with the dreaded paisley underground\". The album The Killer Inside Me appeared  year later, produced by Jim Dickinson at Ardent Studios in Memphis. The band split up afterwards; Cacavas began recording albums under his own name. When Stuart returned to recording he decided to use the Green on Red name. In 1989, the band released Here Come the Snakes; Stuart and Prophet hired backing including Christopher Holland on keyboards. In 1991 they released Scapegoats, but after the 1992 album Too Much Fun Stuart stopped using the name"]}, {"page": "Domino (Squeeze album)", "response": ["Domino is a 1998 album by the British new wave group Squeeze. It was the band's twelfth studio album. After a career struggling with various major record labels, the band decided to record and release Domino independently, on Glenn Tilbrook's own Quixotic Records. Core members Tilbrook and Chris Difford were joined by three brand new Squeeze members for this album: drummer Ashley Soan, bassist Hilaire Penda, and keyboardist Christopher Holland (Jools's younger brother)."]}, {"page": "List of Hammond organ players", "response": ["|Christopher Holland"]}]}}