{"wiki_id": "http://www.wikidata.org/entity/Q5110974", "itemLabel": "Christine Collister", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Christine_Collister", "wikipedia_page": {"main": "Christine Collister (born 28 December 1961) is a Manx folk, blues and jazz singer-songwriter. She was born and grew up on the Isle of Man and first came to public attention in 1986 as the singer of the theme song for the BBC's television adaptation of Fay Weldon's book The Life and Loves of a She-Devil.", "link_mentions": [{"page": "List of folk musicians", "response": ["*Christine Collister"]}, {"page": "Patty Griffin", "response": ["Griffin's songs have been recorded by numerous artists, including the Irish-born singer Maura O'Connell (\"Long Ride Home\"), Linda Ronstadt (\"Falling Down\"), The Chicks (\"Truth No. 2\", \"Top of the World\", \"Let Him Fly\", \"Mary\"), Bette Midler, Melissa Ferrick and Missy Higgins (\"Moses\"), Beth Nielsen Chapman, Christine Collister, and Mary Chapin Carpenter (\"Dear Old Friend\"), Jessica Simpson (\"Let Him Fly\"), Martina McBride (\"Goodbye\"), Emmylou Harris (\"One Big Love\", \"Moon Song\"), Bethany Joy Galeotti (\"Blue Sky\"), the Wreckers (\"One More Girl\"), Keri Noble and Ruthie Foster (\"When It Don't Come Easy\"), Joan Osborne (\"What You Are\"), Solomon Burke (\"Up to the Mountain\"), and Miranda Lambert (\"Getting Ready\"). Kelly Clarkson performed \"Up to the Mountain\" with Jeff Beck on guitar, accompanied by some orchestration on the \"Idol Gives Back\" episode of American Idol, and the live recording was released as a single immediately afterwards, reaching number 56 on the Billboard Hot 100 in its first week and giving Griffin her highest-charting position as a songwriter. (The audience gave Clarkson a standing ovation following her performance.) Griffin's version of the song was featured in episode 11 of the fourth season of the ABC television show Grey's Anatomy."]}, {"page": "Any Trouble", "response": ["Gregson decided to throw everything into Any Trouble's second effort for EMI America, producing an ambitious double album (an 11-track single LP in the US) that featured a mixture of new and previously recorded material to highlight the band's diverse range of material. The new release, titled Wrong End of the Race, also failed to chart despite support from the record company. After the failure of their second EMI album, Clive Gregson broke the band up again. He recorded a solo album and joined Richard Thompson's band for a time before starting a successful folk-rock duo with Christine Collister in the mid-1980s, on the dissolution of which he resumed his solo career from 1992 to the present. Gregson has also toured and recorded in various combinations of musicians, including Boo Hewerdine, Eddi Reader, Nanci Griffith, Andy Roberts, Ian Matthews and Dennis Locorriere. Andy Ebsworth was one of the members of Ryder, the purpose-made pop group which represented the United Kingdom at the 1986 Eurovision Song Contest."]}, {"page": "Barb Jungr", "response": ["In the early 1990s, Jungr developed themed shows which have become her speciality: \"Hell Bent Heaven Bound\" (with Ian Shaw, Christine Collister and Michael Parker) was Perrier Pick of the Fringe, \"Money the Final Frontier\" (with Helen Watson, Christine Collister and Michael Parker) was invited to the Canadian Music Festivals."]}, {"page": "Boo Hewerdine", "response": ["As Hewerdine's star rose, he started to write for other artists, among them Eddi Reader, Clive Gregson and Christine Collister. The Bible reformed in 1993 for a tour the following year and also released an EP of new material (The Dreamlife EP) and an album of b sides and extra's called Random Acts of Kindness.Smith, Giles (1994) \"Major miracle ; The Bible, Borderline\", The Independent, 23 December 1994. Retrieved 31 December 2012  The band split again in December 1994 and a new album remained unreleased (the title was used for a later compilation), although songs from the album were re-recorded by Hewerdine on his John Wood-produced 1996 album Baptist Hospital, which featured contributions from Eddi Reader and Richard Thompson.Larkin, Colin (1998) The Virgin Encyclopedia of Indie & New Wave, Virgin Books, , p. 43 Thanksgiving followed in 1999, which featured a guest appearance from Martha Wainwright and was described by Allmusic writer Rick Anderson as \"sometimes very pretty in a Beatlesque way and sometimes moving\", and Anon in 2002.Anderson, Rick \"Thanksgiving Review\", Allmusic. Retrieved 30 December 2012Lake, Kirk (2009) There Will Be Rainbows: A Biography of Rufus Wainwright, Orion Books, "]}, {"page": "Cooking Vinyl", "response": ["*Clive Gregson & Christine Collister"]}, {"page": "John Surman", "response": ["With Christine Collister"]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Clive Gregson / Christine Collister"]}, {"page": "Danny Thompson", "response": ["*Christine Collister: The Dark Gift of Time (1998); An Equal Love (2001)"]}, {"page": "Across a Crowded Room", "response": ["* Christine Collister, Phil Barnes, Clive Gregson  and The Soultanas – backing vocals"]}, {"page": "Daring Adventures", "response": ["*Christine Collister and Clive Gregson  - backing vocals"]}, {"page": "Amnesia (Richard Thompson album)", "response": ["*Christine Collister - backing vocals"]}, {"page": "Sweet Talker (soundtrack)", "response": ["*Christine Collister - backing vocals"]}, {"page": "Rumor and Sigh", "response": ["*Christine Collister and Clive Gregson  – backing vocals"]}, {"page": "Mirror Blue", "response": ["*Christine Collister – backing vocals"]}, {"page": "More Guitar", "response": ["*Christine Collister - backing vocals"]}, {"page": "Ducknapped!", "response": ["* Christine Collister - backing vocals on Bank Vault In Heaven and Can't Win"]}, {"page": "Faithless (album)", "response": ["The backing band for the 1985 tour included the duo of Clive Gregson and Christine Collister whose vocals had been a feature of Across A Crowded Room. The band lineup for this tour placed most of the burden for instrument colour on Thompson and his guitar playing, but Gregson trades solos with Thompson on \"Tear Stained Letter\".", "*Christine Collister - backing vocals, percussion and acoustic guitar on Wall Of Death"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Christine Collister"]}]}}