{"wiki_id": "http://www.wikidata.org/entity/Q5111957", "itemLabel": "Christopher Blake", "itemDescription": "British actor (1949-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Blake", "wikipedia_page": {"main": "Christopher Blake (born Peter Ronald Gray, 23 August 1949 – 11 December 2004) was an English actor and screenwriter. He is perhaps best remembered for starring in the British sitcoms Mixed Blessings (1978–80) and That's My Boy (1981–86).", "link_mentions": [{"page": "Muswell Hill", "response": ["* The Yorkshire Television sitcom That's My Boy (1981–1986), starring Mollie Sugden and Christopher Blake, made frequent references to Muswell Hill, as the family lived in the area throughout the first four seasons."]}, {"page": "Blake (surname)", "response": ["*Christopher Blake (1949–2004), English actor", "*Christopher Blake (archer) (born 1953), Australian archer"]}, {"page": "Give Us a Clue", "response": ["A revived version was broadcast by BBC One in 1997 over 30 episodes, hosted by Tim Clark. Teams were captained by Christopher Blake and Julie Peasgood and the show introduced a lateral thinking puzzle (which the host could \"give clues to\"). Give us a Clue returned for a special Comic Relief episode in March 2011 with Sara Cox, Christopher Biggins, Lionel Blair, Una Stubbs, Holly Walsh, Jenni Falconer and David Walliams."]}, {"page": "The Mill on the Floss", "response": ["The story was adapted as a film, The Mill on the Floss, in 1937, and as a BBC series in 1978 starring Christopher Blake, Pippa Guard, Judy Cornwell, Ray Smith and Anton Lesser."]}, {"page": "Aces High (film)", "response": ["* Christopher Blake as Lieutenant Roberts"]}, {"page": "The Mutant Phase", "response": ["*Professor Ptolem — Christopher Blake"]}, {"page": "Gilbert Blythe", "response": ["In the 1919 film adaption, Gilbert was portrayed by Paul Kelly. In the 1934 film adaption, Gilbert was portrayed by Tom Brown. In the 1940 sequel Anne of Windy Poplars, Gilbert was portrayed by Patric Knowles. In the 1972 BBC TV adaptation, the young Gilbert was played by Robin Halstead, and in the follow-up series, Anne of Avonlea, the adult Gilbert was played by Christopher Blake."]}, {"page": "The Window (1949 film)", "response": ["The story \"The Boy Cried Murder\" was published in 1947 and optioned by RKO who assigned Fredrick Ullman to produce. Ullman had been head of RKO's documentary and shorts department. Dickie Tyler, who had been in The Bells of St Marys and Christopher Blake was mentioned as a possible star. The film was to be made at RKO's Pathe Studio in New York."]}, {"page": "Anne of Green Gables (miniseries)", "response": ["* Christopher Blake - Gilbert Blythe"]}, {"page": "That's My Boy (1981 TV series)", "response": ["*Christopher Blake – Robert Price", "When Ida Willis (Mollie Sugden) gets a new job as housekeeper to Robert Price (Christopher Blake) and his wife Angie (Jennifer Lonsdale), she moves into their London flat and soon discovers that Robert is the son she gave up for adoption when he was a baby, and she proceeds to call him Shane, the name she gave him when he was born. Other characters include Ida's troublesome brother Wilfred (Harold Goodwin) and Robert's adoptive mother Cecilia Price (Clare Richards), an upmarket widow with whom Ida doesn't get on. In the fourth series, they have moved to the fictitious Yorkshire village of Little Birchmarch, where Ida befriends Robert's mousy receptionist, Miss Parfitt (Deddie Davies)."]}, {"page": "Sammy Rogers", "response": ["The character was used to portray the issue of alcoholism. Sammy becomes an addict after she is involved in a car crash which leaves Owen paralysed. Writers depicted Sammy as an alcoholic throughout her entire duration. They also used Sammy and Owen's daughter, Louise, to provide Sammy with more dramatic stories such as child abandonment and depression. In 1996, producers chose to further explore the issue of child abandonment. Sammy leaves Louise home alone while she goes on holiday abroad and is arrested for neglecting her. The story outraged viewers and the show received numerous complaints. Sammy also has a relationship with an older man Tim Derby (Christopher Blake) and develops an obsession with Max Farnham (Steven Pinder), after they have a one-night stand. Lindsay decided to leave the role in 1993, but returned in 1996 and again in 2001 and remained until the series was cancelled by Channel 4. Sammy has received a mixed response from critics of the genre. Andy Medhurst from The Observer described Sammy as a \"deceitful\" and \"neglectful slattern\" for her parental skills. The Guardian's Stuart Jeffries branded her \"the mother from hell\" and criticised her characterisation, while other critics have praised her headstrong persona.", "Writers wasted no time pairing the duo with other characters in the series. Though off-screen Lindsay and McCall began a relationship together. Sammy begins a relationship with an older man, Tim Derby (Christopher Blake). Tim had divorced his wife and has a daughter the same age as Sammy. Their relationship causes problems with Frank who cannot accept their age difference. Their feud causes Sammy to become estranged from her family and she moves in with Tim. Frank warns Tim that he will get revenge if he hurts his daughter. Tim decides to introduce Sammy to his children Chloe and Adam but the evening ends awkwardly. He realises that Sammy is immature and he breaks up with her. She refuses to leave and he takes her back to Brookside Close and throws her belongings over the pavements. Sammy tries to win Tim back but he throws water over her. She then pretends to be pregnant but Tim is aware of her lies. Sammy retaliates by throwing a house brick through Tim's home window. drives McCall told Tibballs that it was \"horrendous\" to watch Sammy move on with another man. He added, \"It made me sick to watch this old man with Owen's girlfriend.\" McCall noted that when he met Blake, he \"felt no venom\" towards him because he was completely different from Tim."]}, {"page": "Love for Lydia", "response": ["Love for Lydia was adapted into a 13-part serial by London Weekend Television, first broadcast in 1977. It featured several actors in performances which were early in their television careers, including Christopher Blake, Mel Martin, Christopher Hancock, Peter Davison, Jeremy Irons, Ralph Arliss and Sherrie Hewson. It also featured Rachel Kempson, Beatrix Lehmann and Michael Aldridge, as Lydia's eccentric relations, plus David Ryall and Sam Kydd."]}, {"page": "The Lost Boys (miniseries)", "response": ["*George Llewelyn Davies - Barnaby Holm, Paul Holmes, Philip Kassler, Mark Benson, and Christopher Blake"]}, {"page": "East London Cemetery", "response": ["* Christopher Blake"]}, {"page": "Tim Clark (comedian)", "response": ["When the BBC tried to revive the show Give Us a Clue (originally on rival network ITV), Clark was called on to host the show. The format of the show basically followed the games of charades with one member of the team miming in order to convey to the rest of the team a popular phrase, book, TV or film. If their team was unable to guess it was passed over to the other team who could steal the points. The teams were captained by Christopher Blake and Julie Peasgood. It was broadcast in the afternoon it ran from 10 November until 19 December 1997 before being axed."]}, {"page": "Pawsey Medal", "response": ["| Christopher Blake"]}, {"page": "Mixed Blessings (British TV series)", "response": ["Mixed Blessings is a British sitcom starring Christopher Blake and Muriel Odunton that aired on ITV from 3 March 1978 to 7 June 1980. It was created by comedy writer Sid Green and produced for the ITV network by LWT.", "The show starred Christopher Blake (later of That's My Boy fame) and Muriel Odunton as newlyweds Thomas Simpson, who was white, and Susan Lambert, who was black. Most plots revolved around both families' disapproval of their inter-racial marriage.", "*Christopher Blake – Thomas Simpson"]}, {"page": "Deaths in December 2004", "response": ["*Christopher Blake, 55, English actor and screenwriter, Non-Hodgkin lymphoma."]}, {"page": "Stigma (1977 film)", "response": ["*Christopher Blake as Richard"]}, {"page": "Down to Earth (1995 TV series)", "response": ["Richard Briers played Tony Fairfax, who upon graduating from Oxford University had been appointed as a \"cultural advisor\" in a South American banana republic (as a university friend was its president) and was used to a life of luxury, only to be exiled back to Britain when the regime was overthrown at the start of the series.  He moves in with his brother Chris (Christopher Blake), who finds him work at his landscape gardening business with limited success."]}, {"page": "Kenneth Young (New Zealand composer)", "response": ["Kenneth Young works regularly as a conductor throughout New Zealand and Australia.  In New Zealand he works with the New Zealand Symphony Orchestra, New Zealand Chamber Orchestra and all regional orchestras including the Auckland Philharmonia Orchestra, Christchurch Symphony Orchestra and Orchestra Wellington.  In his capacity as conductor, he has recorded with EMI, Atoll Records, Continuum, Trust Records, ABC Classics and Naxos with Best Classical Album releases in 2002 and 2012.  He is widely regarded for his interpretation and recordings of New Zealand composers. These include Douglas Lilburn, Edwin Carr, David Farquhar, Lyell Cresswell, Anthony Ritchie, Gareth Farr, Christopher Blake, Jack Body and many others. He also regularly conducts seasons with the Royal New Zealand Ballet Co. and the Australian Ballet.", "* Christopher Blake: Angel at Ahipara: Atoll Records ACD441, New Zealand Symphony Orchestra Strings (2012), Winner, Best Classical Album, New Zealand Music Awards, 2012"]}, {"page": "To Be the Best", "response": ["* Christopher Blake as Sandy Barkstone"]}, {"page": "Blake, Christopher", "response": ["#redirectChristopher Blake"]}, {"page": "List of Jackanory episodes", "response": ["|2617|| The Snake Whistle: Part 1 - Belas Knap || Margaret Greaves || Christopher Blake || 10-Nov-80", "|2618|| The Snake Whistle: Part 2 - The Servant of the Snake || Margaret Greaves || Christopher Blake || 11-Nov-80", "|2619|| The Snake Whistle: Part 3 - Master of Magic || Margaret Greaves || Christopher Blake || 12-Nov-80", "|2620|| The Snake Whistle: Part 4 - Challenge || Margaret Greaves || Christopher Blake || 13-Nov-80", "|2621|| The Snake Whistle: Part 5 - The Master of Men || Margaret Greaves || Christopher Blake || 14-Nov-80"]}, {"page": "Love for Lydia (TV series)", "response": ["*Christopher Blake as Edward Richardson "]}, {"page": "List of alumni of the Royal Central School of Speech and Drama", "response": ["* Christopher Blake"]}]}}