{"wiki_id": "http://www.wikidata.org/entity/Q51138872", "itemLabel": "Nilüfer Yanya", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Nil%C3%BCfer_Yanya", "wikipedia_page": {"main": "Nilüfer Yanya (; born 11 May 1995) is an English singer, songwriter and musician.", "link_mentions": [{"page": "Newport Folk Festival", "response": ["* 2019: Dolly Parton, Kacey Musgraves, Trey Anastasio, Sheryl Crow, Portugal. The Man, Kermit the Frog with Jim James and Janet Weiss, Phil Lesh, Jeff Tweedy, Amy Ray, Hozier, Judy Collins, Maggie Rogers, Stephen Marley, Lucy Dacus, Dawes, Lukas Nelson & Promise of the Real, Haley Heynderickx, Lake Street Dive, Preservation Hall Jazz Band, Noname, Ramblin' Jack Elliott, Benmont Tench, Cedric Burnside, I'm with Her, Todd Snider, Courtney Marie Andrews, Warren Haynes, Gregory Alan Isakov, The Highwomen, Bonny Light Horseman (Anaïs Mitchell, Eric D. Johnson, and Josh Kaufman), Our Native Daughters (Rhiannon Giddens, Allison Russell, Leyla McCalla, and Amythyst Kiah), The Infamous Stringdusters, The Milk Carton Kids, Parker Millsap, Liz Cooper & The Stampede, Kevin Morby, Mountain Man, John Cohen, Phosphorescent, Billy Strings and Molly Tuttle, Adia Victoria, Jade Bird, Susto, Alice Gerrard, Jupiter & Okwess, Charley Crockett, Yola, Rayland Baxter, J.S. Ondara, Nilüfer Yanya, The Down Hill Strugglers, Ari Hest, Angie McMahon, Erin Rae."]}, {"page": "Bowlie Weekender", "response": ["* Nilüfer Yanya"]}, {"page": "Pitchfork Music Festival", "response": ["Saturday: Paul Cherry, Berhana, Zola Jesus, Kaitlyn Aurelia Smith, Nilüfer Yanya, Circuit des Yeux, Moses Sumney, Raphael Saadiq, Girlpool, Blood Orange, This Is Not This Heat, The War on Drugs, Kelela, Fleet Foxes", "Friday: Barrie, Nilüfer Yanya, Weyes Blood, John Talabot", "Tuesday: Nilüfer Yanya, Mabel, Fickle Friends", "Hackney Church: Moses Boyd, Nilüfer Yanya, Emma-Jean Thackray, cktrl"]}, {"page": "British African-Caribbean people", "response": ["A Mercury Prize and Grammy Awards-nominated artist, rapper Slowthai has Afro-Barbadian, English and Irish ancestry. Nilüfer Yanya has the same background, and also Turkish heritage."]}, {"page": "Osheaga Festival", "response": ["Sunday: Nilüfer Yanya, Alec Benjamin, Normani, Metric, Tame Impala"]}, {"page": "Haldern Pop", "response": ["| Adam French (GB), Alabaster dePlume (GB), Amyl and The Sniffers, Aquilo, Ariel Pink, Astronautalis, Big Thief, Broen (NO), Canshaker Pi (NL), Cantus Domus (DE), Chad Lawson (US), Claus van Bebber (DE), Curtis Harding, Das Paradies (DE), Deerhoof, De Staat, Dirty Projectors, DJ St. Paul (NL), Fabrizio Cammarata (IT), Fink, Fortuna Ehrenfeld (DE), Gisbert zu Knyphausen, Hannah Williams & the Affirmations (GB), Hatis Noit (JP), Hope (DE), Housewives (GB), Infidelix (US), Jade Bird, Jake Bugg, Jenny Lewis, John Maus, Jordan Mackampa (GB), Julian Sartorius (CH), Kettcar, Kevin Morby, King Gizzard & The Lizard Wizard, Landlady (US), Lewsberg (NL), Lisa Hannigan, Love A (DE), Mario Batkovic & Friends (CH), Marius Bear (CH), Marlon Williams, Matteo Myderwyk (NL), Moncrieff (GB), Nilüfer Yanya, Nils Frahm, Philipp Poisel, Phoebe Bridgers, Protomartyr, Public Service Broadcasting, Reverend Beat-Man and the New Wave (CH), Rival Consoles, Rolling Blackouts Coastal Fever, Sampa the Great, Schnellertollermeier (CH), Seamus Fogarty, Seun Kuti & Egypt 80 (NG), Shortparis, Sleaford Mods, Someday Jacob (DE), stargaze & guests: Hip Hop Orchestral , Stefan Florian (IT), Tamino, Terra Profonda (HU), The Barr Brothers, The Inspector Cluzo (FR), The Lemon Twigs, The Lytics (CAN), The Slow Readers Club, Tinpan Orange, Tristan Brusch (DE), Villagers, White Wine (DE), Wood River (US)"]}, {"page": "Nilüfer", "response": ["* Nilüfer Yanya (born 1996), a British-Turkish singer-songwriter from London"]}, {"page": "List of British Turks", "response": ["*Nilüfer Yanya, singer-songwriter, composer and musician (Turkish father) "]}, {"page": "Sound of...", "response": ["| ALMA, Billie Eilish, Jade Bird, Lewis Capaldi, Nilüfer Yanya, Not3s, Sam Fender, Superorganism, Tom Walker, yaeji, Yxng Bane", "The longlist for the Sound of 2018 was revealed on 27 November 2017. The acts nominated were ALMA, Billie Eilish, IAMDDB, Jade Bird, Khalid, Lewis Capaldi, Nilüfer Yanya, Not3s, Pale Waves, Rex Orange County, Sam Fender, Sigrid, Superorganism, Tom Walker, yaeji and Yxng Bane. On 12 January 2018, Sigrid was announced as the winner on Radio 1 by Clara Amfo."]}, {"page": "Immergut Festival", "response": ["* 2019: Alli Neumann, Balthazar, Bilderbuch, Black Midi, Blvth, Boy Harsher, Cate Le Bon, Dagobert, Deerhunter, Dena, Die Wände, Fenster, Fontaines D.C., Frittenbude, Gewalt Band, Giulia Becker, Heinz Strunk, Hope, International Music, Isolation Berlin, Isolée, Kala Brisella, Karen Gwyer, Karies, Komfortrauschen, Kommode, Lauer, Leoniden, Linus Volkmann, Mavi Phoenix, Monako, Nilüfer Yanya, Priests, Roosevelt, Shelter Boy, Some Sprouts, Sophia Kennedy"]}, {"page": "Liam Howe", "response": ["*2017  Nilüfer Yanya – Sliding Doors (Blue Flowers Music) inc. writing", "In 2017/18, Howe worked with Lissie, Jessie Ware, Nilüfer Yanya, Aurora, and BEA1991."]}, {"page": "List of Later... with Jools Holland episodes", "response": ["|Ronnie Wood (co-host) / Imelda May (co-host) / Lewis Capaldi / Foals / Nilüfer Yanya / Sudan Archives"]}, {"page": "Coachella Festival line-ups", "response": ["*Nilüfer Yanya", "*Nilüfer Yanya"]}, {"page": "Wilma Archer", "response": ["* Nilüfer Yanya - \"WWAY Health™\", “Paralysed\", \"Experience?\", \"Warning\", \"'Sparkle' God Help Me\", \"The Unordained\", and \"Give Up Function\" from Miss Universe (2019)"]}, {"page": "All Points East", "response": ["* Nilüfer Yanya"]}, {"page": "Yanya (disambiguation)", "response": ["*Nilüfer Yanya (born 1996), British rock composer, singer and guitarist"]}, {"page": "Miss Universe (album)", "response": ["Miss Universe is the debut album by English singer Nilüfer Yanya. It was released on March 22, 2019 on ATO Records.", "Miss Universe is Nilüfer Yanya's first full-length album. Yanya eschewed using any of her material from previous EPs, choosing instead to write an album using entirely new material, although some of the songs, such as \"Monsters Under the Bed\", had been written long beforehand.", "* Nilüfer Yanya – vocals, guitar , keyboards , piano "]}, {"page": "Connie Constance", "response": ["Constance's debut album English Rose was released on 22 March 2019. Reviewing, Pitchfork noted that \"Constance’s voice takes on scratchy, sonorous depth that brings to mind the subterranean soul of fellow London artists Nilüfer Yanya and King Krule.\" Clash noted that her songs have been described as 'indie-soul'. The BBC described her as a \"rising UK pop star\"."]}, {"page": "Nilüfer Yanya discography", "response": ["#REDIRECT Nilüfer Yanya#Discography"]}, {"page": "Alffa", "response": ["The band are recording their first album following the success of their digital releases, and are also planning international performances. They are to perform at Sŵn festival in October 2019 alongside Gruff Rhys, The Comet Is Coming, and Nilüfer Yanya."]}, {"page": "Do You Like Pain?", "response": ["#REDIRECT Nilüfer Yanya"]}, {"page": "Do You Like Pain", "response": ["#REDIRECT Nilüfer Yanya"]}, {"page": "Man Alive! (King Krule album)", "response": ["* \"Airport Antenatal Airplane\" and \"(Don't Let the Dragon) Draag On\" contain elements of \"Small Crimes\", written, recorded and performed by Nilüfer Yanya."]}, {"page": "Primavera Sound 2019", "response": ["*Nilüfer Yanya"]}, {"page": "List of 2022 albums", "response": ["| Nilüfer Yanya"]}, {"page": "Painless (album)", "response": ["#REDIRECT Nilüfer Yanya#Discography"]}, {"page": "Painless (Nilüfer Yanya album)", "response": ["#REDIRECT Nilüfer Yanya#Discography"]}]}}