{"wiki_id": "http://www.wikidata.org/entity/Q5112430", "itemLabel": "Christopher Green", "itemDescription": "English writer and performer", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Green_(writer-performer)", "wikipedia_page": {"main": "Christopher Green (born c. 1968 in Matlock, Derbyshire) is an English writer and performer whose work covers comedy, cabaret, theatre and live art.", "link_mentions": [{"page": "Anni-Frid Lyngstad", "response": ["On 16 February 2011, BBC Radio 4 broadcast a 45-minute play featuring Frida and the play's writer, long term fan and performer Christopher Green. The play, Like an Angel Passing Through My Room, was billed as \"a story about love. The unconditional love of a devoted fan ... about a real and an imagined intimacy.\" It was a project several years in the making; what started as an upbeat reflection on fame and the notion of being a fan, developed into a meditation on the communication between two people and coping with the blows life deals. In an interview with Frida she and Green talked about her long recovery following the death of her husband in 1999. The play is reflective but with a comic sensibility. Frida stated in 2004 that she never intended to return to the music industry, although this was short-lived, and future studio albums were discussed in 2010."]}, {"page": "Spymonkey", "response": ["In 2011, Spymonkey created Love In, a cabaret show bringing together some of the funniest routines from previous shows. These included Petra Massey's pole-dancing Joan of Arc from Bless, and her orgasmic ping-pong ball firing act, which featured in both Zumanity and Cooped. There was also new material, in which the quartet appeared as the 'Love In Organisation', wearing cream outfits and beatific expressions. According to Dominic Maxwell in The Times, 'There's some nice new material here, with their New Age talk, coy high fives – 'mid-fives', if you will – and the sort of audience participation that loosens you up rather than freezes you up. Mostly though it's a framing device for self-contained bits of business. This is proper clowning, conveyed with a sinewy physicality and a relish for upstaging: Jacques Lecoq meets Little and Large.'Dominic Maxwell, 'Spymonkey's Love-In', The Times, 30 June 2011 The show was directed by Christopher Green, with original material by Cal McCrystal."]}, {"page": "Tina C", "response": ["#REDIRECT Christopher Green (writer-performer)"]}, {"page": "Christopher Green", "response": ["Christopher Green may refer to:", "*Christopher Green (physician) (1652–1741), Regius Professor of Physic at Cambridge", "*Christopher Green (art historian) (born 1943), art history professor", "*Christopher Green (paediatrician) (born 1948), Australian author of best-selling books on raising toddlers.", "*Christopher Green (legal scholar), professor of Constitutional Law", "*Christopher Green (author), Australian speculative fiction author", "*Christopher Green (writer-performer) (born c. 1968), British comedian and writer", "* Christopher Green (Sacramento mayor) from 1872 to 1877"]}, {"page": "Ida Barr", "response": ["#REDIRECT Christopher Green (writer-performer)"]}, {"page": "1968 in British radio", "response": ["*Approximate date – Christopher Green, comedy performer"]}, {"page": "Chris Green (writer/performer)", "response": ["#REDIRECT Christopher Green (writer-performer)"]}, {"page": "Christopher Green (comedian)", "response": ["#REDIRECT Christopher Green (writer-performer)"]}, {"page": "Christopher Green (writer/performer)", "response": ["#REDIRECT Christopher Green (writer-performer)"]}, {"page": "Ida Barr (singer)", "response": ["*Ida Barr's name was appropriated more than 40 years after her death by Christopher Green for an unrelated, non-tribute drag act."]}]}}