{"wiki_id": "http://www.wikidata.org/entity/Q5112008", "itemLabel": "Christopher Budd", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Budd_(mathematician)", "wikipedia_page": {"main": "Christopher John Budd  (born 15 February 1960) is a British mathematician known especially for his contribution to non-linear differential equations and their applications in industry. He is currently Professor of Applied Mathematics at the University of Bath, and Professor of Geometry at Gresham College.\nBudd gained his Bachelor's degree in mathematics at St John's College, Cambridge where he was senior wrangler. He went on to be awarded a D.Phil. from Oxford University, studying numerical methods for nonlinear elliptic partial differential equations under the supervision of John Norbury. He spent three years as a fellow of St John's College, Oxford working in numerical analysis at the Oxford University Computing Laboratory and as a fellow sponsored by the CEGB developing numerical methods for third-order partial differential equations. He went on to a permanent post as a lecturer in numerical analysis at the University of Bristol before gaining a position as Professor of Applied Mathematics at the University of Bath in 1995. He was appointed the Professor of Geometry at Gresham College in 2016, where he delivered a series of public lectures on Mathematics and the Making of the Modern World.His research interests involve the analysis, application and numerical analysis of the solution of nonlinear differential equations with a particular emphasis on problems which arise in industry. His recent work has been in geometric integration which aims to develop numerical methods which reproduce qualitative structures in differential equations.\nHe is co-director of the interdisciplinary Centre for Nonlinear Mechanics at the University of Bath and is active in promoting interdisciplinary collaboration both nationally and internationally.\nBudd is a passionate populariser of mathematics, reflected in his appointment as Chair of Mathematics of the Royal Institution of Great Britain in 2000.  He works on a number of projects with schools and  has  written a book, \"Mathematics Galore\", based on his series of popular talks. He has also made numerous guest appearances on national radio and television, such as on the BBC's The One Show[1] and popular science panel comedy game show It's Only a Theory[2].\nHe won the Leslie Fox Prize for Numerical Analysis in 1991. In 1999 he was one of ten scientists awarded the title of \"Scientist for the new century\" by the Royal Institution.  In 2001 he was one of 20 lecturers in the UK to be awarded an ILT Teaching Fellowship, and he was nominated the LMS popular lecturer in applied mathematics. He was awarded the Order of the British Empire (OBE) in the Queen's Birthday Honours List in 2015 for services to science and maths education. He has supervised at least 9 students for a PhD.", "link_mentions": [{"page": "University of Bristol", "response": ["Past academics of the university include, Patricia Broadfoot, vice-chancellor of the University of Gloucestershire, Nigel Thrift, vice-chancellor of the University of Warwick, and Wendy Larner, provost of Victoria University of Wellington. Anthony Epstein, co-discoverer of the Epstein-Barr virus, was Professor of Pathology at the university from 1968 to 1982, Sir John Lennard-Jones, discoverer of the Lennard-Jones potential in physics and Alfred Marshall, one of the University College's principals and influential economist in the latter part of the 19th century. Mathematicians and philosophers Rohit Parikh and Brian Rotman lectured in the mathematics department, and philosophers of science Paul Feyerabend and Alexander Bird taught in the department of philosophy. Another notable current academic in the department of philosophy includes Havi Carel. Notable mathematicians who have worked in the department of mathematics include Hannes Leitgeb, Philip Welch, Ben Green, Andrew Booker, Julia Wolf, Jens Marklof, John McNamara, Howell Peregrine, Christopher Budd John Hogan, Jeremy Rickard, Richard Jozsa, Corinna Ulcigrai, David Evans and the statistician Harvey Goldstein."]}, {"page": "Wrangler (University of Cambridge)", "response": ["Until 1909, the university made the rankings public. Since 1910 it has publicly revealed only the class of degree gained by each student. An examiner reveals the identity of the Senior Wrangler \"unofficially\" by tipping his hat when reading out the person's name, but other rankings are communicated to each student privately. Therefore, the names of only some 20th-century Senior Wranglers (such as Crispin Nash-Williams, Christopher Budd, Frank P. Ramsey, Donald Coxeter, Kevin Buzzard, Jayant Narlikar, George Reid and Ben J. Green) have become publicly known."]}, {"page": "St Albans School, Hertfordshire", "response": ["The school also has a long scientific tradition, stretching back to the Norman era, when Alexander Neckam became master of the school. Since the advent of modern science, the school has produced many famous scientists and mathematicians including cognitive scientist Colin Cherry, physicist Ian Grant, cosmologist Stephen Hawking (inspired by Dikran Tahta, a teacher at the school who later worked at the Open University), and mathematician Christopher Budd.  In the light of its long scientific heritage, the school was awarded a large sum of money in 2007 by the Wolfson Foundation to rebuild its physics laboratories to university standards.St Albans School Foundation Annual Report 2009-2010. Issuu.com (29 June 2011). Retrieved on 13 December 2011.", "* Christopher Budd (b. 1960), mathematician"]}, {"page": "List of Cambridge mathematicians", "response": ["*Christopher Budd, Gresham Professor of Geometry, student at St John's College  1979-1983"]}, {"page": "Joint Policy Board for Mathematics", "response": ["*2020: Christopher Budd and James Tanton"]}, {"page": "Leslie Fox Prize for Numerical Analysis", "response": ["* 1991 - Christopher Budd and J. F. B. M. Kraaijevanger"]}, {"page": "Senior Wrangler", "response": ["Many Senior Wranglers have become world-leading figures in mathematics, physics, and other fields. They include George Airy, Jacob Bronowski, Christopher Budd, Kevin Buzzard, Arthur Cayley, Donald Coxeter, Arthur Eddington, Ben Green, John Herschel, James Inman, J. E. Littlewood, Lee Hsien Loong, Jayant Narlikar, Morris Pell, John Polkinghorne, Frank Ramsey, Lord Rayleigh (John Strutt), George Stokes, Isaac Todhunter, and Sir Gilbert Walker."]}, {"page": "Christopher Budd", "response": ["Christopher Budd may refer to:", "* Christopher Budd (mathematician) (born 1960), British mathematician", "* Christopher Budd (cricketer) (born 1978), former English cricketer", "* Christopher Budd (bishop) (born 1937), British Roman Catholic prelate"]}, {"page": "Budd (surname)", "response": ["*Christopher Budd (mathematician) (born 1960), British mathematician", "*Christopher Budd (cricketer) (born 1978), English cricketer", "*Christopher Budd (bishop) (born 1937), British Roman Catholic prelate"]}, {"page": "Philip Drazin", "response": ["* Drazin's obituary by Christopher Budd"]}]}}