{"wiki_id": "http://www.wikidata.org/entity/Q5111815", "itemLabel": "Christopher \"Fangorn\" Baker", "itemDescription": "English artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Baker_(artist)", "wikipedia_page": {"main": "Christopher Baker (usually known as Chris Baker but also professionally as Fangorn), (born 17 August 1960 in Birmingham, England) is a cover artist for British and German versions of the Redwall books, as well as a storyboard and film conceptual artist, most notably with filmmakers Stanley Kubrick and Tim Burton.\nBaker's pseudonym \"Fangorn\" is derived from the name of a forest in J. R. R. Tolkien's The Lord of the Rings novel.\n\n", "link_mentions": [{"page": "A.I. Artificial Intelligence", "response": ["In early 1994, the film was in pre-production with Christopher \"Fangorn\" Baker as concept artist, and Sara Maitland assisting on the story, which gave it \"a feminist fairy-tale focus\". Maitland said that Kubrick never referred to the film as A.I., but as Pinocchio. Chris Cunningham became the new visual effects supervisor. Some of his unproduced work for A.I. can be seen on the DVD, The Work of Director Chris Cunningham. Aside from considering computer animation, Kubrick also had Joseph Mazzello do a screen test for the lead role. Cunningham helped assemble a series of \"little robot-type humans\" for the David character. \"We tried to construct a little boy with a movable rubber face to see whether we could make it look appealing,\" producer Jan Harlan reflected. \"But it was a total failure, it looked awful.\" Hans Moravec was brought in as a technical consultant. Meanwhile, Kubrick and Harlan thought A.I. would be closer to Steven Spielberg's sensibilities as director. Kubrick handed the position to Spielberg in 1995, but Spielberg chose to direct other projects, and convinced Kubrick to remain as director. The film was put on hold due to Kubrick's commitment to Eyes Wide Shut (1999)."]}, {"page": "BSFA Award", "response": [":Artwork: Angelbot, cover of Time Pieces, by Christopher \"Fangorn\" Baker"]}, {"page": "BSFA Award for Best Artwork", "response": ["*2006: Christopher \"Fangorn\" Baker – 'Angelbot', cover of Time PiecesMatrix issue 184 (2007) p5"]}]}}