{"wiki_id": "http://www.wikidata.org/entity/Q5111998", "itemLabel": "Christopher Bryan", "itemDescription": "Turks and Caicos footballer (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Bryan", "wikipedia_page": {"main": "Christopher Bryan (born 17 November 1960) is a former association football player who played as a defender for the Turks and Caicos Islands national team.\nHe was educated at Kingston Grammar School, Kingston-upon-Thames, England.\nBetween 1999 and 2006, he won six caps and scored two goals for his country. He was the first player from the Islands to score in an international fixture.\nAfter retiring from playing internationalfootball in 2006, he became the President of the Turks and Caicos Islands Football Association.\nBryan continued to play club football and in 2020, aged 59, it was recognised that he is one of only four players, in different top national leagues, older than 50 years who continue their careers and have played at least one game after turning 50.", "link_mentions": [{"page": "Turks and Caicos Islands", "response": ["* Christopher Bryan (born 1960 in the Turks and Caicos Islands) is a former association football player. In 2006 he became the President of the Turks and Caicos Islands Football Association"]}, {"page": "Turks and Caicos Islands national football team", "response": ["|align=\"left\"|Christopher Bryan"]}, {"page": "Kingston Grammar School", "response": ["* Christopher Bryan — international football player, Turks and Caicos"]}, {"page": "Turks and Caicos Islands Football Association", "response": ["Its current president is Sonia Bien-Aime, who replaced Christopher Bryan in 2014."]}, {"page": "Sonia Bien-Aime", "response": ["Bien-Aime became general secretary of the TCIFA in 2006, and was elected president of the Association in July 2014, succeeding Christopher Bryan. She was the first woman to be elected president of the TCIFA."]}, {"page": "Bryan, Christopher", "response": ["#redirectChristopher Bryan"]}, {"page": "Alex Bryan", "response": ["Bryan is the son of former Turks and Caicos Islands national football team player Christopher Bryan. "]}]}}