{"wiki_id": "http://www.wikidata.org/entity/Q5115828", "itemLabel": "James Hannigan", "itemDescription": "British film, television and video game composer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Hannigan", "wikipedia_page": {"main": "James Hannigan  (born 23 July 1971) is a multi-award winning British composer, whose credits include entries in the Harry Potter, The Lord of the Rings, Dead Space, Warhammer, Wing Commander, Space Hulk, Evil Genius, Grand Prix, Command & Conquer, Cloudy With a Chance of Meatballs, and Theme Park game series; themes such as \"Soviet March\" (the main theme of Command and Conquer: Red Alert 3), the Audible and DC Comics adaptations of Neil Gaiman's The Sandman, BBC America's Primeval, and more.  He has scored or contributed to EA Sports titles in the FIFA and F1 series, and his music can also be heard in RuneScape, Conquest: Frontier Wars, Freelancer, Nintendo's Art Academy, Super Smash Bros. for Nintendo 3DS and Wii U, Catwoman, Reign of Fire, Saints Row 4, Privateer: The Darkening and others. In the early years of his career, Hannigan worked as Composer for Electronic Arts Europe before basing his studio at Pinewood Studios in England for ten years between 1997 and 2007, where he sometimes worked as a Sound Designer on films such as Lost in Space alongside composing.\nJames Hannigan's other music credits include Audible's Audie Award winning Alien dramas (2016 - 2019), Unseen Academicals (Discworld 37) and the acclaimed BBC Radio 4 adaptations of Neil Gaiman’s Good Omens and Neverwhere. His music is heard in trailers and television shows, such as the BBC's Top Gear, Amazon's The Grand Tour, Netflix's 100 Humans and Floor is Lava, and Disney's The World According to Jeff Goldblum. In March 2020, it was announced that James Hannigan would be scoring the DC Comics and Audible adaptation of Neil Gaiman's The Sandman. In June 2020, Rebellion Developments announced that Hannigan would return to score Evil Genius 2. James Hannigan's popular main theme to Command & Conquer: Red Alert 3, \"Soviet March\" has garnered hundreds of millions of plays on YouTube and other streaming services. \nOn January 28th 2021, online entertainment news and media outlet Variety announced Seasons 2 and 3 of The Sandman, which will include scores by James Hannigan.\nHannigan has posted videos on the subject of his early interactive music system design for titles such as the BAFTA nominated Republic: The Revolution (designed by Google DeepMind founder Demis Hassabis) and entries in the Theme Park series of games on Youtube.", "link_mentions": [{"page": "The Sandman (comic book)", "response": ["On July 15, 2020, Audible released an adaptation of the comic book series as a multi-part audio drama directed by Dirk Maggs with music by James Hannigan. The voice cast included Gaiman as the Narrator, James McAvoy as Dream, Kat Dennings as Death, Taron Egerton as John Constantine, Michael Sheen as Lucifer, Riz Ahmed as the Corinthian, Andy Serkis as Matthew the Raven, Samantha Morton as Urania Blackwell, Bebe Neuwirth as The Siamese Cat, Arthur Darvill as William Shakespeare, and Justin Vivian Bond as Desire."]}, {"page": "Alien 3", "response": ["In 2019, Audible released an audio drama of Gibson's script, adapted by Dirk Maggs and with Michael Biehn and Lance Henriksen reprising their roles.Alien III Teaser The production had music by James Hannigan."]}, {"page": "RuneScape", "response": ["RuneScape has original music and ambient soundscapes. The music was designed to define the underlying cultures of the various locations accessible, and ambient sounds, such as the cry of seagulls flying over the ocean, occur in logical places. The game also incorporates voice acting in certain areas and situations. The RuneScape 3 update included orchestral music recorded in Bratislava, Slovakia, and was scored by James Hannigan.", "Category:Video games scored by James Hannigan"]}, {"page": "Richard Joseph", "response": ["He then went on to set up Audio Interactive at Pinewood Studios and, along with composer James Hannigan, helped Electronic Arts to win the BAFTA Award for best audio in 2000 for Theme Park World. From 1990 onwards Richard was a frequent musical collaborator with Jon Hare with whom he co-wrote and arranged all of Sensible Software's best known musical tracks including the soundtrack for Cannon Fodder the GBC version of which was also nominated for a BAFTA in 2000, and is still the only small-format soundtrack to be recognised by BAFTA to this day. In 1995 Hare and Joseph embarked upon an epic 32 track soundtrack for the multimedia product Sex 'n' Drugs 'n' Rock 'n' Roll, signed to Warner Interactive, however in 1998 Warner bowed out of the games market and their Magnum Opus was only ever released as a limited edition audio CD.", "After working as Audio Director on Republic: The Revolution and Evil Genius for Elixir Studios (music composed by James Hannigan), both winning BAFTA nominations for Hannigan's scores, Richard moved to France where he ran SoundTropez, a company offering next-technology soundtracks."]}, {"page": "List of film score composers", "response": ["* James Hannigan (born 1971)"]}, {"page": "Video game music", "response": ["Sequencing samples continue to be used in modern gaming where fully recorded audio is not viable. Until the mid-2000s, many larger games on home consoles used sequenced audio to save space. Additionally, most games on the Game Boy Advance and Nintendo DS used sequenced music due to storage limitations. Sometimes a cross between sequencing samples, and streaming music is used. Games such as Republic: The Revolution (music composed by James Hannigan) and Command & Conquer: Generals (music composed by Bill Brown) have utilised sophisticated systems governing the flow of incidental music by stringing together short phrases based on the action on screen and the player's most recent choices (see dynamic music). Other games dynamically mixed the sound on the game based on cues of the game environment.", "From April 20–27, 2007, Eminence Symphony Orchestra, an orchestra dedicated to video game and anime music, performed the first part of their annual tour, the \"A Night in Fantasia\" concert series in Australia. Whilst Eminence had performed video game music as part of their concerts since their inception, the 2007 concert marked the first time ever that the entire setlist was pieces from video games. Up to seven of the world's most famous game composers were also in attendance as special guests. Music performed included Red Alert 3 Theme: Soviet March by James Hannigan and Shadow of the Colossus by Kow Otani."]}, {"page": "List of video game musicians", "response": ["*James Hannigan – Harry Potter and the Deathly Hallows, Command and Conquer 4: Tiberian Twilight, The Lord of the Rings: Aragorn's Quest, Command and Conquer: Red Alert 3, Cloudy With a Chance of Meatballs, Primeval (ITV), Harry Potter and the Half-Blood Prince, Red Alert 3 Uprising, Harry Potter and the Order of the Phoenix, Republic: The Revolution, Freelancer, Art Academy, Sim Theme Park, Mr Bean, Grand Prix 4, Reign of Fire, Jetix, Evil Genius, Catwoman, Warhammer: Dark Omen, FIFA Soccer Manager, Conquest: Frontier Wars, Sim Coaster, F1 Manager, Evil Genius 2"]}, {"page": "Freelancer (video game)", "response": ["Freelancers soundtrack was released by Sumthing Else Music Works on November 18, 2003.  Composed by award-winning composer James Hannigan, music group Visual Music Incorporated, and Digital Anvil's musician and programmer Andrew Sega,Freelancer - behind the scenes  on youtube.com (video) it includes a bonus DVD that contains the game's alternative introduction movies, concept art, scripts, and deleted content.", "Category:Video games scored by James Hannigan"]}, {"page": "Republic: The Revolution", "response": ["The BAFTA-nominated score for the game was composed by James Hannigan.", "Category:Video games scored by James Hannigan"]}, {"page": "Warhammer: Shadow of the Horned Rat", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Evil Genius (video game)", "response": ["Evil Genius music score, composed by James Hannigan, received a BAFTA nomination for Best Original Music in 2004. Hannigan has spoken of how the work he did for the game stands out amongst his oeuvre, on account of its \"uniqueness\"."]}, {"page": "Dirk Maggs", "response": ["On July 15, 2020, Audible released an adaptation of the comic book series as a multi-part audio drama directed by Dirk Maggs with music by James Hannigan. The voice cast included Gaiman as the Narrator, James McAvoy as Dream, Kat Dennings as Death, Taron Egerton as John Constantine, Michael Sheen as Lucifer, Riz Ahmed as the Corinthian, Andy Serkis as Matthew the Raven, Samantha Morton as Urania Blackwell, Bebe Neuwirth as The Siamese Cat, Arthur Darvill as William Shakespeare, and Justin Vivian Bond as Desire. The production spent two months at #1 in The New York Times Best Seller list"]}, {"page": "Jesper Kyd", "response": ["| rowspan=\"4\" | 2003||Brute Force||with James Hannigan"]}, {"page": "Grand Prix 4", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Brute Force (video game)", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Conquest: Frontier Wars", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Music of the Harry Potter films", "response": ["The music of the Harry Potter film series was recorded and released in conjunction with the post-production and releases of each of the eight corresponding films. The scores were composed by John Williams, Patrick Doyle, Nicholas Hooper, and Alexandre Desplat. Though Williams only scored the first three films, several motifs he created were incorporated into later scores, in particular Hedwig's Theme, which can be heard in all eight films. Other musicians credited with writing source music include Jarvis Cocker, The Ordinary Boys, and Nick Cave and the Bad Seeds. Jeremy Soule and James Hannigan wrote the music for the Harry Potter video games."]}, {"page": "Theme Park World", "response": ["left|thumb|James Hannigan, Richard Joseph and Nick Laviers after receiving the award on stage for Sound at the BAFTA Interactive Awards, 2000.", "Theme Park World for PC was awarded the 2000 BAFTA Interactive Entertainment Award for Sound  at the time recognising all aspects of Sound and Music in games. The award was collected on stage by composer James Hannigan, Richard Joseph and Nick Laviers of Electronic Arts.", "Category:Video games scored by James Hannigan"]}, {"page": "Space Hulk: Vengeance of the Blood Angels", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Beasts and Bumpkins", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Catwoman (video game)", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Theme Park Inc", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Harry Potter and the Philosopher's Stone (soundtrack)", "response": ["James Horner was approached to compose the score for the film but he turned it down. \"Hedwig's Theme\" is the leitmotif for the film series. Often labelled as the series's main theme, it first appeared in Harry Potter and the Philosopher's Stone in the track \"Prologue\". A concert arrangement of the same name is included in the end credits. \"Hedwig's Theme\" has been interpolated in the fourth through eighth Harry Potter film scores, including in those by Patrick Doyle, Nicholas Hooper, and Alexandre Desplat. It also appears in the scores to the last four Harry Potter video games, all composed by James Hannigan. \"Hedwig's Theme\" has achieved significant pop culture status, being featured as ring tones, trailer music, and other forms of multimedia."]}, {"page": "Hannigan", "response": ["*James Hannigan, British composer"]}, {"page": "Reign of Fire (video game)", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Harry Potter and the Order of the Phoenix (video game)", "response": ["The game's soundtrack was composed by James Hannigan and conducted by Allan Wilson. Hannigan wrote themes for the various characters and incorporated \"Hedwig's Theme\" by John Williams into the score. IGN has given the game's music a rating of 9.5 out of 10. A small number of tracks present in the Order of the Phoenix video game were also featured in The Philosopher's Stone, The Chamber of Secrets and The Prisoner of Azkaban video games, composed by Jeremy Soule. The Harry Potter and the Order of the Phoenix game soundtrack featuring James Hannigan's music was released on the E.A.R.S. label in 2007, with references to John Williams' Hedwig's Theme removed, to much critical acclaim from fans of film and game soundtracks. For reasons unknown, the soundtrack, along with Hannigan's later Harry Potter and the Half-Blood Prince soundtrack and the earlier game scores by Jeremy Soule, was withdrawn from sale in 2009. It has been speculated that market confusion involving multiple soundtracks with the same title may have led to the withdrawal, but others have speculated that reviews by various soundtrack critics describing Hannigan's work as superior to the score of the Harry Potter and the Order of the Phoenix film may have contributed to the decision.  Hannigan's soundtracks for the last two games in the series were never officially released.", "In 2020, the soundtrack album was re-released under the title of EA Music Composer Series: James Hannigan, Vol. 2, and many of the references to the Harry Potter series are censored in the track titles.", "Category:Video games scored by James Hannigan"]}, {"page": "Command & Conquer: Red Alert 3", "response": ["James Hannigan and Timothy Michael Wynn wrote the bulk of the game's remaining 114 minutes of music, with Hannigan composing the \"Soviet March\" menu theme along with music for the Empire of the Rising Sun faction, and Wynn the music of the Allies and the remaining Soviet tracks. Music4Games has also covered the game's music score. The band From First to Last composed several remix versions of \"Hell March\" and \"Hell March 2\", featured on the Red Alert 3 soundtrack shipped with the Red Alert 3 'Premier Edition'. A song in the soundtrack by James Hannigan is called \"All Your Base Are Belong To Us\", a reference to Zero Wing and the internet meme of the same name.", "Category:Video games scored by James Hannigan"]}, {"page": "Harry Potter and the Half-Blood Prince (video game)", "response": ["The Harry Potter and the Half-Blood Prince Video Game Soundtrack was composed by James Hannigan and recorded with the Philharmonia Orchestra at Air Studios in London. The BAFTA-nominated and IFMCA (International Film Music Critics Association) Award-winning soundtrack was released on 17 March 2009. However, the soundtrack is no longer available because EA Recordings decided to stop selling all of their Harry Potter video game soundtracks in late 2009. Hannigan's soundtracks for the last two games in the series were never officially released.", "In 2020, the soundtrack album was re-released under the title of EA Music Composer Series: James Hannigan, Vol. 1, and many of the references to the Harry Potter series are censored in the track titles.", "Category:Video games scored by James Hannigan"]}, {"page": "Music of the Command & Conquer series", "response": ["In November 2008, Crispy Gamer reported that James Hannigan and Timothy Michael Wynn wrote the bulk of the game's remaining 114 minutes of music, with Hannigan composing the \"Soviet March\" menu theme along with music for the Empire of the Rising Sun Faction, and Wynn the music of the Allies and the remaining Soviet tracks. Music4Games has also covered the game's music score.", "The expansion pack, Uprising, scored mostly by James Hannigan and Timothy Michael Wynn, introduced a new track called Yuriko's Theme by Hannigan, featuring two singers: Miriam Stockley and Satomi Morimoto. This theme was later remixed by Menno de Jong into a trance version, and it was later played at many great Trance festivals."]}, {"page": "Command & Conquer: Red Alert 3 – Uprising", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "Cutthroat Island (video game)", "response": ["Category:Video games scored by James Hannigan"]}, {"page": "The Lord of the Rings: Aragorn's Quest", "response": ["Category:Video games scored by James Hannigan"]}]}}