{"wiki_id": "http://www.wikidata.org/entity/Q5112167", "itemLabel": "Christopher Crabb Creeke", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Crabb_Creeke", "wikipedia_page": {"main": "Christopher Crabb Creeke (11 March 1820 – 22 May 1886) was an architect and surveyor who was largely responsible for shaping the early development of Bournemouth.", "link_mentions": [{"page": "Boscombe", "response": ["The house at Boscombe was extensively rebuilt for Sir Percy, and extended to include a 200-seat (later 300 seats) theatre, to the designs of Christopher Crabb Creeke, who later became surveyor to the Bournemouth Improvement Commissioners and was responsible for both the layout of much of central Bournemouth's roads, and for several local buildings."]}, {"page": "History of Bournemouth", "response": ["In 1856, Parliament approved the Bournemouth Improvement Act. Under the Act, a board of 13 Commissioners was established to organise all the things involved in the running of a small but growing town, such as paving, sewers, drainage, street lighting and street cleaning. Under the guidance of their surveyor, Christopher Crabb Creeke, the Bournemouth Commissioners quickly launched a programme of work designed to improve the amenities of their town and make it more attractive to visitors. The Commissioners continued to govern the town until 1890 and were the forerunners of the Bournemouth Borough Council of today."]}, {"page": "Charminster, Bournemouth", "response": ["Mel suttons house was the first original house to be developed the 1860s the Earl of Malmesbury, working with the architect and designer Christopher Crabb Creeke, drew up plans to build over Charminster. These plans were suspended in 1866, however, when the Tories returned to power, Malmesbury taking up the position of Lord Privy Seal in the 14th Earl of Derby's third administration.M. Stead, Charminster, pp. 3-4. Consequently, the 1870 Ordnance Survey map shows little more than tumuli and brickfields at Charminster, while the suburb of Springbourne was developing independently to the south.'M. Stead, Charminster, p. 4."]}, {"page": "Wimborne Road Cemetery, Bournemouth", "response": ["The Wimborne Road Cemetery is located at Wimborne Road, Bournemouth.http://www.bournemouth.gov.uk/BirthsDeathsMarriages/CemeteriesCrematoriums/BournemouthCemeteriesAndBurials.aspx It is grade II listed with Historic England. The cemetery was opened in 1878 and laid out by the architect Christopher Crabb Creeke.", "* Christopher Crabb Creeke (1820–1886), architect"]}, {"page": "Creeke", "response": ["* Christopher Crabb Creeke (1820–1886), British architect and surveyor"]}, {"page": "List of people from Bournemouth", "response": ["* Christopher Crabb Creeke (1820–1886) architect and surveyor, shaped the early development of Bournemouth."]}, {"page": "Royal Bath Hotel", "response": ["The 1878 extension was designed by Christopher Crabb Creeke."]}, {"page": "St. Mark's School, Bournemouth", "response": ["The school was built in 1862, and designed by Christopher Crabb Creeke. In 1962, the schools centenary, the school saw a large expansion. The expanded building was officially opened by local Member of Parliament John Eden in March 1967."]}]}}