{"wiki_id": "http://www.wikidata.org/entity/Q5112785", "itemLabel": "Christopher M. Tuckett", "itemDescription": "British New Testament scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_M._Tuckett", "wikipedia_page": {"main": "Christopher M. Tuckett is a British biblical scholar and Anglican priest. He holds the Title of Distinction of Professor of New Testament Studies at the University of Oxford and is a Fellow of Pembroke College, Oxford.", "link_mentions": [{"page": "Rylands Library Papyrus P52", "response": ["𝔓 is small, and although a plausible reconstruction can be attempted for most of the 14 lines represented, the proportion of the text of the Gospel of John for which it provides a direct witness is necessarily limited, so it is rarely cited in textual debate.Tuckett 2001:544New Testament Manuscripts: Papyri\"The oldest New Testament: P52\" Historian.net. There has, however, been some contention as to whether the name  (Jesus) in the 'missing' portions of recto lines 2 and 5 was originally written as ; in other words, was it contracted to  or  in accordance with otherwise universal Christian practice in surviving early Gospel manuscripts. On the assumption that the nomina sacra were absent from 𝔓, Roberts originally considered that the divine name was more likely to have been written in full,Roberts(1935), p. 18. but later changed his mind.Hurtado, p. 6. This latter view is also the view of Larry W. Hurtado,Hurtado, Larry W. P52 (P.Rylands Gr 457) and the Nomina Sacra; Method and Probability, Tyndale Bulletin 54.1, 2003 with Christopher M. Tuckett maintaining Roberts' original opinion.Christopher M. Tuckett, P52 and Nomina Sacra, New Testament Studies 47, 2001 pp 544–48 The verses included in 𝔓 are also witnessed in Bodmer Papyrus 𝔓 – usually dated to the beginning of the 3rd century CE – and there is also some overlap with 𝔓 and 𝔓 of the 7th and 2nd centuries respectively. No two of the four contain the same exact text as reconstructed for John 18:31–38, but 𝔓 seems to represent an example of the same proto-Alexandrian text-type. Kurt Aland described it as a \"Normal text\", and placed it in Category I, due to its age."]}, {"page": "Mark 7", "response": ["Biblical commentator Christopher M. Tuckett notes that verses 9, 14, 18 and 20 all open with  \"he said to them\", suggesting that several texts have been brought together in this section, and the changes of venue and audience in verses 14 and 17 suggest \"that different traditions are being brought together\".Tuckett, C. M., Mark in Barton, J. and Muddiman, J. (2001), The Oxford Bible Commentary, p. 899"]}, {"page": "International Greek New Testament Project", "response": ["    Christopher M. Tuckett (British 2001–6)"]}, {"page": "Crucifixion of Jesus", "response": ["The crucifixion of Jesus occurred in 1st-century Judea, most likely in either AD 30 or AD 33. Jesus' crucifixion is described in the four canonical gospels, referred to in the New Testament epistles, attested to by other ancient sources, and is considered an established historical event by many, although there is no consensus among historians on the exact details.Christopher M. Tuckett in The Cambridge companion to Jesus edited by Markus N. A. Bockmuehl 2001 Cambridge Univ Press  pp. 123–124", "The baptism of Jesus and his crucifixion are considered to be two historically certain facts about Jesus.Jesus of Nazareth by Paul Verhoeven (2010)  p. 39 James Dunn states that these \"two facts in the life of Jesus command almost universal assent\" and \"rank so high on the 'almost impossible to doubt or deny' scale of historical facts\" that they are often the starting points for the study of the historical Jesus.Jesus Remembered by James D. G. Dunn (2003)  p. 339 Bart Ehrman states that the crucifixion of Jesus on the orders of Pontius Pilate is the most certain element about him.A Brief Introduction to the New Testament by Bart D. Ehrman (2008)  p. 136 John Dominic Crossan states that the crucifixion of Jesus is as certain as any historical fact can be. Eddy and Boyd state that it is now \"firmly established\" that there is non-Christian confirmation of the crucifixion of Jesus. Craig Blomberg states that most scholars in the third quest for the historical Jesus consider the crucifixion indisputable.Jesus and the Gospels: An Introduction and Survey by Craig L. Blomberg (2009)  pp. 211–214 Christopher M. Tuckett states that, although the exact reasons for the death of Jesus are hard to determine, one of the indisputable facts about him is that he was crucified.The Cambridge Companion to Jesus by Markus N. A. Bockmuehl (2001)  p. 136"]}, {"page": "C.M. Tuckett", "response": ["#REDIRECT Christopher M. Tuckett"]}, {"page": "Christopher Tuckett", "response": ["#REDIRECT Christopher M. Tuckett"]}, {"page": "Tuckett", "response": ["* Christopher M. Tuckett, British Professor of New Testament Studies"]}, {"page": "C. M. Tuckett", "response": ["#REDIRECT Christopher M. Tuckett"]}, {"page": "Rylands Professor of Biblical Criticism and Exegesis", "response": ["*Christopher M. Tuckett, 1991–1996"]}, {"page": "List of Pembroke College, Oxford, people", "response": ["* Christopher M. Tuckett, biblical scholar, Professor of New Testament Studies and Fellow"]}, {"page": "Studiorum Novi Testamenti Societas", "response": ["| Christopher M. Tuckett"]}, {"page": "Sources for the historicity of Jesus", "response": ["Van Voorst states that although the question of who was referred to in various points in the Talmud remains subject to debate among scholars, in the case of Sanhedrin 43a (generally considered the most important reference to Jesus in rabbinic literature), Jesus can be confirmed as the subject of the passage, not only from the reference itself, but from the context that surrounds it, and there is little doubt that it refers to the death of Jesus of Nazareth.In Jesus: The Complete Guide edited by J. L. Houlden (2006)  pp. 693–694Van Voorst, Robert E. (2000). Jesus Outside the New Testament: An Introduction to the Ancient Evidence Wm. B. Eerdmans Publishing Co..  p. 177–118 Christopher M. Tuckett states that if it is accepted that death narrative of Sanhedrin 43a refers to Jesus of Nazareth then it provides evidence of Jesus' existence and execution.In The Cambridge Companion to Jesus by Markus N. A. Bockmuehl 2001  p. 123"]}]}}