{"wiki_id": "http://www.wikidata.org/entity/Q5110861", "itemLabel": "Christina Reid", "itemDescription": "British writer (1942-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christina_Reid", "wikipedia_page": {"main": "Christina Reid (12 March 1942 – 31 May 2015) was an Irish playwright.", "link_mentions": [{"page": "1983 in literature", "response": ["*Christina Reid – Tea in a China Cup"]}, {"page": "List of writers from Northern Ireland", "response": ["*Christina Reid"]}, {"page": "Giles Cooper Awards", "response": ["* Christina Reid — Last of a Dyin' Race"]}, {"page": "1989 in Northern Ireland", "response": ["*3 May - Christina Reid's play The Belle Of Belfast City is premiered at the Lyric Theatre, Belfast."]}, {"page": "1983 in Northern Ireland", "response": ["*9 November - Christina Reid's first play, Tea In A China Cup, is premiered at the Lyric Theatre, Belfast."]}, {"page": "1942 in Northern Ireland", "response": ["*12 March – Christina Reid, playwright (died 2015)."]}, {"page": "Josie Rourke", "response": ["|Christina Reid"]}, {"page": "Roland Jaquarello", "response": ["From 1988–1991, Roland Jaquarello was Artistic Director of The Lyric Theatre Belfast. During his tenure, four new plays by Robin Glendinning, Christina Reid, John McLelland and Robert Ellison were produced. There was also the premiere of a 'glasnost' play Threshold by Alexei Dudarev which was directed and designed by a visiting Belarusian team. During this time, The Lyric Theatre also visited The Glasgow Mayfest with his production of Sam Thompson's Over The Bridge, a play about sectarianism in the Belfast shipyards. They also visited The International Ibsen Festival in Oslo, Norway with Ghosts and instigated a new Summer Festival presenting work by international writers such as Václav Havel and the Argentinian playwright Eduardo Pavlovsky. Innovative classical revivals of Sean O' Casey's The Plough and the Stars, Oscar Wilde's The Importance of Being Earnest with Conleth Hill as Algernon and J. M. Synge's 'The Playboy of the Western World' were also produced. However at the centre of his progressive artistic leadership were his own ambitious productions of three American classics: After the Fall by Arthur Miller, with Tim Woodward and Claire Hackett giving memorable performances in the leading roles, The Iceman Cometh with Peter Marinker as a fine Hickey and Cat on a Hot Tin Roof with strong performances from Sara Stewart as Maggie and Patrick O'Kane as Brick.", "In 1996 he became senior producer for Radio Drama at BBC Northern Ireland.  He worked in Belfast for three years in broadcasting and then turned freelance, basing himself in London. His productions include work for BBC Radio 4 and 3 by experienced writers like John Arden, Brian Friel, Sebastian Barry, Mark Lawson, Gary Mitchell, Carlo Gébler, Robin Glendinning, Christopher Fitz-Simon, Christina Reid, Jonathan Myerson and Larry Gelbart, writer of TV's M*A*S*H. He also produced and directed William Trevor's The Property of Colette Nervi, which was nominated for the Prix Italia Play Section, 1999, and Martin Lynch's modern Belfast version of Henrik Ibsen's An Enemy of the People. The latter won a ZeBBie Award for Best Radio Script 2007 from the Irish Playwrights and Screenwriters Guild. A Whistle in the Dark by Tom Murphy, which he produced and directed for BBC Radio 3, also won a ZeBBie Award from the same guild for Best Radio Script 2011."]}, {"page": "List of Irish writers", "response": ["*Christina Reid (1942–2015)"]}, {"page": "The Troubles in literature and popular culture", "response": ["*Did You Hear the One About the Irishman...? by Christina Reid", "*Joyriders by Christina Reid"]}, {"page": "Acting Irish International Theatre Festival", "response": ["|  Christina Reid"]}, {"page": "National Theatre Connections", "response": ["*A Year and A Day by Christina Reid", "*King of the Castle by Christina Reid"]}, {"page": "2015 in the United Kingdom", "response": ["**Christina Reid, 73, playwright."]}, {"page": "List of Irish women writers", "response": ["*Christina Reid (1942–2015), playwright "]}, {"page": "Deaths in May 2015", "response": ["*Christina Reid, 73, Northern Irish playwright."]}, {"page": "List of biographical dictionaries of women writers in English", "response": ["** 75 entries, by over 35 contributors, on: Linda Anderson, Ivy Bannister, Mary Beckett, Sara Berkeley, Maeve Binchy, Caroline Blackwood, Eavan Boland, Angela Bourke, Elizabeth Bowen, Clare Boylan, Elizabeth Brennan, Frances Browne, Mary Rose Callaghan, Moya Cannon, Marina Carr, Juanita Casey, Mary (Catherine Gunning Maguire) Colum, Julia Crottie, Geraldine Cummins, Ita Daly, Suzanne Day, Teresa Deevy, Anne Devlin, Eilis Dillon, Emma Donoghue, Mary Dorcey, Ellen Mary Patrick Downing, Maria Edgeworth, Ruth Dudley Edwards, Anne Enright, Mary E. (Mary Blundell) Frances, Miriam Gallagher, Sarah Grand, Augusta, Lady Gregory, Anne Le Marquand Hartigan, Rita Ann Higgins, Norah Hoult, Jennifer Johnston, Biddy Jenkinson, Marie Jones, Molly Keane, Eva Kelly, Rita Kelly, Mary Lavin, Emily Lawless, Joan Lingard, Deirdre Madden, Joy Martin, Medbh Mcguckian, Janet McNeill, Paula Meehan, Maire Mhac an tSaoi, Alice Milligan, Susan L. Mitchell, Lady Morgan, Val Mulkerns, Iris Murdoch, Eilean Ni Chuilleanain, Nuala Ni Dhomhnaill, Eilis Ni Dhuibhne, Aine Ni Ghlinn, Mairead Ni Ghrada, Edna O'Brien, Kate O'Brien, Mary O'Donnell, Julia O'Faolain, Nuala O'Faolain, Mary O'Malley, Christina Reid, Somerville and Ross, Eithne Strong, Mary Tighe, Katharine Tynan, Lady Wilde, Sheila Wingfield"]}, {"page": "List of women writers (M–Z)", "response": ["*Christina Reid (1942–2015, Ireland), pw."]}]}}