{"wiki_id": "http://www.wikidata.org/entity/Q5111846", "itemLabel": "Christopher Allmand", "itemDescription": "British medieval historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Allmand", "wikipedia_page": {"main": "Christopher Thomas Allmand (born 1936) is an English medieval historian, with a special focus on the Late Middle Ages in England and France, and the Hundred Years' War. He was Professor of Medieval History at the University of Liverpool until his retirement in 1998, and is now Honorary Senior Fellow at the university. He has written a much-used monograph on the Hundred Years' War, a biography of King Henry V of England, and he has edited the seventh and final volume of The New Cambridge Medieval History.", "link_mentions": [{"page": "Halloween", "response": ["Christian minister Prince Sorie Conteh linked the wearing of costumes to the belief in vengeful ghosts: \"It was traditionally believed that the souls of the departed wandered the earth until All Saints' Day, and All Hallows' Eve provided one last chance for the dead to gain vengeance on their enemies before moving to the next world. In order to avoid being recognized by any soul that might be seeking such vengeance, people would don masks or costumes\". It is claimed that in the Middle Ages, churches that were too poor to display relics of martyred saints at Allhallowtide let parishioners dress up as saints instead. Some Christians observe this custom at Halloween today.\"Eve of All Saints\", Using Common Worship: Times and Seasons – All Saints to Candlemas (David Kennedy), Church House Publishing, p. 42 Lesley Bannatyne believes this could have been a Christianization of an earlier pagan custom.Bannatyne, Lesley. Halloween: An American Holiday, an American History. Pelican Publishing, 1998. p. 9 Many Christians in mainland Europe, especially in France, believed \"that once a year, on Hallowe'en, the dead of the churchyards rose for one wild, hideous carnival\" known as the danse macabre, which was often depicted in church decoration.Perry, Edward Baxter. Descriptive Analyses of Piano Works; For the Use of Teachers, Players, and Music Clubs. Theodore Presser Company, 1902. p. 276 Christopher Allmand and Rosamond McKitterick write in The New Cambridge Medieval History that the danse macabre urged Christians \"not to forget the end of all earthly things\". The danse macabre was sometimes enacted at village pageants and court masques, with people \"dressing up as corpses from various strata of society\", and this may be the origin of Halloween costume parties."]}, {"page": "Michael Allmand", "response": ["Michael Allmand was born in Golders Green, London, to Professor Arthur John MC and Marguerite Marie Allmand on 22 August 1923. Allmand's brother is the medieval historian Christopher Allmand. He was educated at Ampleforth College, a Catholic boarding school in North Yorkshire, England, before attending Oxford University in 1941 where he studied history. While at Oxford, Allmand served as the founding editor of a literary review journal called The Wind and the Rain, and began writing a biography of Edmund Burke.."]}, {"page": "Battle of Pontvallain", "response": ["Knolles's campaign has been estimated to have cost Edward at least £66,667 (), based on his known requests for loans. The historian May McKisack suggests that the  that preceded the battle yielded \"plunder but little military benefit\". Maurice Keen notes that even though Knolles had reached the gates of Paris, \"he had little to show for it when he reached Brittany\", which illustrated how much the Hundred Years' War had changed in character. According to Christopher Allmand, \"the days of Crécy and Poitiers were over\". Pontvallain, argues Alexander Gillespie, \"destroyed the reputation the English had for invincibility on the battlefield\"."]}, {"page": "The New Cambridge Medieval History", "response": ["* Volume 7, c.1415–c.1500. Edited by Christopher Allmand. 1998."]}, {"page": "Allmand, Christopher", "response": ["#redirectChristopher Allmand"]}]}}