{"wiki_id": "http://www.wikidata.org/entity/Q5112092", "itemLabel": "Christopher Chessun", "itemDescription": "Bishop of Southwark; Bishop of Woolwich", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Chessun", "wikipedia_page": {"main": "Christopher Thomas James Chessun (born 5 August 1956) is a British Anglican bishop. Since 2011, he has been Bishop of Southwark in the Church of England.", "link_mentions": [{"page": "August 5", "response": ["*1956 – Christopher Chessun, English Anglican bishop"]}, {"page": "Streatham", "response": ["*Christopher Chessun, bishop of Southwalk- official residence in Streatham"]}, {"page": "Anglican Diocese of Southwark", "response": ["Alongside the diocesan Bishop of Southwark (Christopher Chessun), the diocese has three area (suffragan) bishops: Richard Cheetham, area Bishop of Kingston; Jonathan Clark, area Bishop of Croydon; and Karowei Dorgu, area Bishop of Woolwich. Since 1994 the Bishop of Fulham (currently Jonathan Baker, since 2013) has provided 'alternative episcopal oversight' in the diocese (along with those of London and Rochester) to those parishes which do not the ordination of women to the priesthood. Baker is licensed as an honorary assistant bishop in Southwark diocese in order to facilitate his ministry there."]}, {"page": "Valid but irregular", "response": ["* The ordination of three men from London in Kenya in May 2011. The men, who have not been named as of 21 July 2011, are part of a church-planting group led by Richard Coekin (also mentioned above). Again, a rationale for these ordinations being considered irregular was put forward by the current Bishop of Southwark, Christopher Chessun who takes a more tolerant view towards homosexuality than that taken by the men at the time of their ordination. The men will be linked with the Anglican Mission in England, a network of churches that separated from the Church of England and the Anglican Communion shortly after the ordinations and that seeks to promote . The events were criticised in a statement by Lambeth Palace."]}, {"page": "Anglican Bishop of Southwark", "response": ["The current bishop is Christopher Chessun, the 10th Bishop of Southwark, who signs +Christopher Southwark. He had previously been the area Bishop of Woolwich (2005–2011). When the post-holder ranks among the longest-serving 21 bishops heading a diocese, he or she will qualify for a place in the House of Lords, joining the other five who qualify ex officio, including the two archbishops.", "| 60px Christopher Chessun "]}, {"page": "Bishop of Woolwich", "response": ["|align=\"center\"| 2005 ||align=\"center\"| 2011 || Christopher Chessun || Translated to Southwark"]}, {"page": "Richard Cheetham", "response": ["He began his career as curate at Holy Cross, Fenham, Newcastle upon Tyne and from 1990 until 1999 he was vicar of St Augustine of Canterbury's Church, Luton and additionally (from 1995) Rural Dean of the area. From 1999 to 2002 he was Archdeacon of St Albans.Debrett's People of Today 2008 On 17 October 2002, at Southwark Cathedral, he was one (with David Hamid and David Hawkins) of the last three people to be ordained and consecrated a bishop by George Carey before his retirement as Archbishop of Canterbury; Cheetham was then enthroned as area Bishop of Kingston in Southwark Cathedral on 27 October 2002. As the senior suffragan bishop in post at the time of Tom Butler's retirement on 5 March 2010, Cheetham served as Acting Bishop of Southwark from then until his fellow suffragan Christopher Chessun became Bishop of Southwark on 17 January 2011.Diocese of Southwark — Tenth Bishop of Southwark is announced  (Accessed 17 December 2015)"]}, {"page": "List of alumni of University College, Oxford", "response": ["* Christopher Chessun, Bishop of Southwark 2011–present, Bishop of Woolwich 2005-2011"]}, {"page": "Christopher Thomas James Chessun", "response": ["#REDIRECT Christopher Chessun"]}]}}