{"wiki_id": "http://www.wikidata.org/entity/Q5112498", "itemLabel": "Christopher Hartley", "itemDescription": "British priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Hartley", "wikipedia_page": {"main": "Christopher Hartley (born 1959) is a British-Spanish Catholic missionary priest who worked from 1997 to 2006 to improve the working and living conditions of the Haitian sugar cane workers in San José de los Llanos in the province of San Pedro de Macorís, Dominican Republic. His work there was the subject of the documentary film The Price of Sugar (2007), produced and directed by Bill Haney.\n\n", "link_mentions": [{"page": "The Price of Sugar (2007 film)", "response": ["The Price of Sugar is a 2007 Uncommon Productions film directed by Bill Haney and produced by Haney and Eric Grunebaum about exploitation of Haitian immigrants in the Dominican Republic involved with production of sugar, and the efforts of Spanish priest Father Christopher Hartley to ameliorate their situation.  It is narrated by actor Paul Newman. The documentary shows the poor working conditions in the sugar cane plantations, and political control exerted by the Vicini family to stifle efforts to change the situation.", "While the documentary highlights the efforts of Father Christopher Hartley to bring medicine, education, and human rights to Haitian workers, it also shows the widespread resentment of his actions held by Dominican people."]}, {"page": "Christopher Heartly", "response": ["#REDIRECT Christopher Hartley"]}, {"page": "Father Heartly", "response": ["#REDIRECT Christopher Hartley"]}, {"page": "Father Hartly", "response": ["#REDIRECT Christopher Hartley"]}, {"page": "Rev. Christopher Hartley", "response": ["#REDIRECT Christopher Hartley"]}, {"page": "Rev. Heartley", "response": ["#REDIRECT Christopher Hartley"]}, {"page": "Rev. Hartley", "response": ["#REDIRECT Christopher Hartley"]}, {"page": "Hartley, Christopher", "response": ["#redirectChristopher Hartley"]}, {"page": "Francisco Ozoria Acosta", "response": ["On 1 February 1997, at the creation of the Diocese of San Pedro de Macorís, Pope John Paul II named him its bishop. He received his episcopal consecration on 15 March from Cardinal Nicolás de Jesús López Rodríguez, Archbishop of Santo Domingo. As bishop he built a strong reputation for developing vocations for the priesthood. In 2006, in an action that attracted press attention and political controversy, he ordered Christopher Hartley, a New York priest whose activism among Haitian immigrants he had long defended, to leave the diocese, apparently because Hartley had attempted to interfere in the process of episcopal appointments."]}]}}