{"wiki_id": "http://www.wikidata.org/entity/Q5126262", "itemLabel": "Clare Tomlinson", "itemDescription": "British news reporter", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Tomlinson", "wikipedia_page": {"main": "Clare Louise Tomlinson (born 6 September 1968) is a presenter for the British satellite broadcast sports network Sky Sports.  She was born in Grantham, Lincolnshire.born September 6 1968 makes Claire 53years", "link_mentions": [{"page": "Grantham", "response": ["*Clare Tomlinson (born 1968), news presenter"]}, {"page": "List of sports announcers", "response": ["* Clare Tomlinson – Sky Sports 1998–present"]}, {"page": "Bryan Robson", "response": ["Robson married Denise Brindley on 2 June 1979. The couple have three children: Claire (born 17 September 1980),Robson (2007), p. 43. Charlotte (born 17 June 1982),Robson (2007), p. 61. and Ben (born 2 September 1988). In 2000, Robson reportedly had an affair with Sky Sports reporter Clare Tomlinson."]}, {"page": "Stephen Bywater", "response": ["He has also been involved in several controversies. In an October 2007 interview with Clare Tomlinson on Sky Sports' Goals on Sunday programme he spelt out the word \"cunt\" whilst live on air as part of an anecdote."]}, {"page": "Geoff Shreeves", "response": ["Shreeves went to Verulam School in St Albans. He made his reporting debut in 1999 alongside Clare Tomlinson, and now reports on the touch-line in Premier League matches on Sky Sports. He also reports for Fox Sports before Champions League games, and is a regular presenter for The Debate on Sky Sports."]}, {"page": "Kesteven and Grantham Girls' School", "response": ["* Clare Tomlinson – Sky Sports presenter"]}, {"page": "Goals on Sunday", "response": ["Kamara has formerly co-presented the show with Ian Payne, Rob McCaffrey, Clare Tomlinson and Ben Shephard.", "*Clare Tomlinson (2007)"]}, {"page": "Arsène Wenger", "response": ["Malicious rumours concerning Wenger's private life surfaced during November 1996, to the extent the City of London reported that his exit from Arsenal was imminent. Having returned from a trip to Strasbourg to visit his parents, Wenger attended a press meeting and strongly refuted the claims: \"If something comes out that is wrong, I will attack. It is a serious matter if you can just create things that are not right.\" Arsenal's press officer Clare Tomlinson, who was present at the news conference, recalled Wenger phoning the next day and demanding why he could not take action against the press for printing the story. The culprit responsible for spreading gossip in the City later apologised to Wenger. During this, Arsenal had led the Premier League, but poor form in February 1997 caused Wenger to rule out his team's chances of winning the title. They finished third in his first season, missing out on UEFA Champions League qualification to Newcastle United on goal difference – the tiebreaker used to determine the ranking between teams equal on points."]}]}}