{"wiki_id": "http://www.wikidata.org/entity/Q5120555", "itemLabel": "Cindy Levinson", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Cindy_Levinson", "wikipedia_page": {"main": "Levinhurst is an independent music band formed by British musician Lol Tolhurst, a founding member of The Cure, and his wife Cindy Levinson. Levinson provides vocals while Tolhurst writes the majority of the tracks, musically and lyrically, and programmes the drums and keyboards. To date, Levinhurst have released three studio albums - Perfect Life (2004); House by the Sea (2007); and Blue Star (2009) - and two extended plays - The Grey (2006) and Somewhere, Nothing Is Everything (2014). The Grey includes a cover of The Cure song \"All Cats Are Grey\", a song for which Tolhurst claims to have written the lyrics.", "link_mentions": [{"page": "Lol Tolhurst", "response": ["In the early 2000s, Tolhurst and his second wife, Cindy Levinson, formed a band called Levinhurst. A few months before the release of their debut album, Tolhurst said in an interview that he had reconciled with Robert Smith and that the two were friends again. Shortly afterward, Levinhurst released their debut album, Perfect Life, in 2004. Since then, they have released an EP called The Grey featuring a cover of The Cure's \"All Cats are Grey\"—for which he claimed credit for writing the lyrics—and two other songs. Their second album, House by the Sea, was released in April 2007. Their third album, called Blue Star and featuring original Cure bassist Michael Dempsey, was released in the U.S. in June 2009 and worldwide in February 2010. Tolhurst also composed music for the film 9,000 Needles, a documentary that won Best Documentary at the 2010 Phoenix Film Festival. The second part of the European tour, \"Blue Star Over Europe\", occurred in October 2010, followed by a South and North American tour in early 2011.", "Shortly after leaving the Cure in 1989, Lol Tolhurst met Cindy Levinson in Hollywood where Levinson was working as a hairdresser."]}, {"page": "Presence (band)", "response": ["Since the breakup of Presence, Roberto Soave and Rob Steen have played in another band called Babacar along with Boris Williams of The Cure and Caroline Crawley of Shelleyan Orphan. Tolhurst is focusing on his current project Levinhurst with his wife Cindy Levinson on vocals."]}, {"page": "Levinhurst", "response": ["Levinhurst is an independent music band formed by British musician Lol Tolhurst, a founding member of The Cure, and his wife Cindy Levinson. Levinson provides vocals while Tolhurst writes the majority of the tracks, musically and lyrically, and programmes the drums and keyboards. To date, Levinhurst have released three studio albums - Perfect Life (2004); House by the Sea (2007); and Blue Star (2009) - and two extended plays - The Grey (2006) and Somewhere, Nothing Is Everything (2014). The Grey includes a cover of The Cure song \"All Cats Are Grey\", a song for which Tolhurst claims to have written the lyrics.2007 Cure fanclub interview with Tolhurst  (viewed 11 June 2009)", "The band was formed in the early 2000s by Lol Tolhurst, a founding member of The Cure and his wife Cindy Levinson. Their debut album, Perfect Life, was released in March 2004. This was followed in October 2006 by an EP called The Grey. Their second album, House by the Sea, was released in April 2007.", "*Cindy Levinson - vocals"]}, {"page": "Perfect Life (Levinhurst album)", "response": ["Jo-Ann Greene of Allmusic gave Perfect Life 4 out of 5 stars, calling it \"a highly coherent selection of electro numbers that range from clubby dance songs to more ambient soundscapes, some instrumental, others given added atmospheres by Cindy Levinson's dreamy vocals.\"", "*Cindy Levinson - vocals"]}, {"page": "House by the Sea (album)", "response": ["*Cindy Levinson - vocals"]}, {"page": "Eric Bradley", "response": ["In addition to fronting The Young Royals, Bradley also serves as the guitarist and backup vocalist for Levinhurst, an independent musical project that blends the surnames of vocalist Cindy Levinson and her husband Lol Tolhurst, former drummer and keyboardist for The Cure. Bradley first appeared on their second album House by the Sea, on which he also plays bass guitar, released in 2007. They were later joined by Michael Dempsey, another founding member of The Cure, and released a third album in 2009 called Blue Star."]}]}}