{"wiki_id": "http://www.wikidata.org/entity/Q5126253", "itemLabel": "Clare Smyth", "itemDescription": "chef", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Smyth", "wikipedia_page": {"main": "Clare Smyth   (born 1978) is a Northern Irish chef. She is the Chef Patron of Core by Clare Smyth which opened in 2017. Previously she was Chef Patron at Restaurant Gordon Ramsay from 2012 to 2016, won the Chef of the Year award in 2013, and achieved a perfect score in the 2015 edition of the Good Food Guide. Smyth has also appeared on television shows such as Masterchef and Saturday Kitchen. Smyth also notably catered at Prince Harry and Meghan Markle's 2018 wedding.In 2017, Smyth opened her first restaurant, Core, in London. It was awarded three Michelin stars in the 2021 Michelin Guide, which made her the first Northern Irish woman to have a restaurant awarded three Michelin stars. Her second restaurant, Oncore, opened in Sydney in 2021.", "link_mentions": [{"page": "List of Irish people", "response": ["* Clare Smyth"]}, {"page": "Notting Hill", "response": ["The district adjoins two large public parks, Holland Park and Kensington Gardens, with Hyde Park within  to the east. The gentrification has encompassed some streets that were among the 1980s' most decrepit, including the now expensive retail sections of Westbourne Grove and Ledbury Road, as well as Portobello Road's emergence as a top London tourist attraction and Chamberlayne Road as a local shopping street with its boutique independent shops. Notting Hill has a high concentration of restaurants, including the two Michelin-rated The Ledbury and Core by Clare Smyth."]}, {"page": "Gordon Ramsay", "response": ["In November 2007, Ramsay installed 29-year-old Clare Smyth as head chef at his three-Michelin-starred flagship restaurant on Royal Hospital Road. Smyth is the second high-profile appointment of a female chef by Ramsay, after Angela Hartnett. Smyth was the first female three-Michelin-starred; she moved on to start her own restaurant in 2017."]}, {"page": "Great British Menu", "response": ["*Northern Ireland: Danny Millar (won heat) vs Clare SmythRichard Corrigan as mentor"]}, {"page": "Saturday Kitchen", "response": ["* Clare Smyth"]}, {"page": "The Catey Awards", "response": ["* 2016 Clare Smyth"]}, {"page": "1978 in Northern Ireland", "response": ["*Clare Smyth, chef"]}, {"page": "List of chefs", "response": ["* Clare Smyth"]}, {"page": "List of Michelin 3-star restaurants", "response": ["| London || Core by Clare Smyth || Clare Smyth || 2021"]}, {"page": "Roux Scholarship", "response": ["The Current Judging panel for the competition includes Michel Roux, Jr. and Alain Roux as the chairmen, alongside Brian Turner as vice chairman and chefs James Martin, Clare Smyth, Angela Hartnett, Rachel Humphrey, as well as former Roux Scholarship winners André Garrett, Sat Bains & Simon Hulstone. "]}, {"page": "Le Louis XV (restaurant)", "response": ["Several chefs who went on to lead Michelin starred restaurants underwent training at Le Louis XV, including Alexis Gauthier, Massimo Bottura, Clare Smyth-  and Thierry Laborde."]}, {"page": "List of Michelin 3-star restaurants in the United Kingdom", "response": ["There are currently seven restaurants in the UK which hold three Michelin stars, including the aforementioned Waterside Inn. The remaining six restaurants are Hélène Darroze at the Connaught, Core by Clare Smyth, Alain Ducasse at the Dorchester, Restaurant Gordon Ramsay, Sketch (The Lecture Room & Library) and The Fat Duck. Out of the restaurants, five are located in London, while the other two are located in Bray, Berkshire.", "!scope=\"row\"|Core by Clare Smyth"]}, {"page": "Category talk:Head chefs of Michelin starred restaurants", "response": ["***Sometimes it gets a bit more confusing than that, for instance both Gordon Ramsay (chef patron) and Clare Smyth (head chef) are credited with Michelin stars for Restaurant Gordon Ramsay. Other chef patrons that do the same include Joël Robuchon and Alain Ducasse who are chef patrons of multiple Michelin starred restaurants. Miyagawa (talk) 22:47, 29 December 2012 (UTC)"]}, {"page": "Northern Irish cuisine", "response": ["* Clare Smyth"]}, {"page": "2013 Birthday Honours", "response": ["*Ms Clare Smyth, Chef Patron, Restaurant Gordon Ramsay. For services to the Hospitality Industry."]}, {"page": "MasterChef Australia (series 9)", "response": ["| Clare Smyth ", "|  Six-Course Meal Service Challenge - The other contestants faced an individual three-hour service challenge on a commercial kitchen with three-starred Michelin chef Clare Smyth as their mentor. Each had the responsibility of cooking a dish of a six-course meal for 50 diners and the judges. Clare assigned a pair of ingredients for each contestant, which they had to highlight in their dish. By knife pull, Tamara (with marron and ras el hanout) and Eliza (mushrooms and spruce) were assigned to cook entrées, Diana (who had venison and pear) and Karlie (duck and Tasmanian mountain pepper) cooked the mains & Sarah (assigned with sheep's milk yoghurt and bergamot leaf) and Ben (pineapple and coriander seeds) were tasked with making the desserts. The best performers of the challenge joined Arum in the Finals. The time pressure was great for the contestants as they struggled to prep their dishes. Ben's performance in the kitchen resulted in him delivering the dish of the day and he advanced to the Finals. Tamara failed to highlight her second ingredient: ras el hanout while her couscous was undercooked which derailed the overall grade of her dish, Karlie's duck was cooked inconsistently and Sarah's savoury dessert was imbalanced with the use of roasted fennel. They were named the Bottom 3 as a result, but Eliza, who overpowered the spruce flavour in her dish with her Parmesan custard, had never been in any previous Elimination Challenges (including Pressure Tests) and therefore, she would face her first if Sarah decided to use her immunity pin."]}, {"page": "List of female chefs with Michelin stars", "response": ["Following the Second World War, Marguerite Bise became the third woman to win three Michelin stars, at her restaurant Auberge du Père Bise in 1950. It is then often reported that there was a 50-year gap before Anne-Sophie Pic became the fourth woman to win a set of three stars, despite Bise's granddaughter Sophie regaining the family restaurant's three stars in 1985, and similar awards made by Michelin to female chefs such as Nadia Santini, Elena Arzak and Clare Smyth in the interim."]}, {"page": "MasterChef Australia (series 11)", "response": ["| Clare Smyth", "| Pressure Test: Clare Smyth's Pear and Lemon Verbena Vacherin – Clare Smyth gave Derek, Jess and Leah four hours to replicate her intricate dessert, consisting of meringue, pears and a lemon verbena and 10 minutes to plate it. Derek made the best dish and Leah also impressed but her pear discs were too thin. Jess' meringue was fragile and thin, while her cream was loose, and her dish had collapsed after plating, resulting in her elimination."]}, {"page": "CORE by Clare Smyth", "response": ["#REDIRECT Clare Smyth"]}, {"page": "MasterChef Australia (series 13)", "response": ["| Clare Smyth", "| Clare Smyth's Michelin Mystery Box Challenge — In the Mystery Box Challenge, the contestants had 75 minutes to make a dish using ingredients selected by Clare Smyth: scampi, peas, wasabi, brandy, lemon, chives, tomatoes and rose geranium, inspired by one of her dishes. Aaron's lasagna, Depinder's bombe Alaska, Conor's koulourakia, Linda's tortellini and Pete's scampi with tomato tartare were the top five dishes and won the opportunity to compete for immunity."]}]}}