{"wiki_id": "http://www.wikidata.org/entity/Q5126557", "itemLabel": "Clarence Hackney", "itemDescription": "Scottish-American rofessional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Clarence_Hackney", "wikipedia_page": {"main": "Clarence W. Hackney (March 10, 1894 – January 4, 1941) was a Scottish-American professional golfer.", "link_mentions": [{"page": "Ryder Cup", "response": ["The British team was: George Duncan (captain), James Braid, Arthur Havers, Abe Mitchell, James Ockenden, Ted Ray, James Sherlock, J.H. Taylor, Josh Taylor, and Harry Vardon. The American team was: Emmet French (captain), Clarence Hackney, Walter Hagen, Charles Hoffner, Jock Hutchison, Tom Kerrigan, George McLean, Fred McLeod, Bill Mehlhorn and Wilfrid Reid. Gold medals were presented by Katharine Stewart-Murray, Duchess of Atholl, to each member of the teams at the conclusion of the Glasgow Herald tournament on Saturday afternoon. The medals \"had on one side crossed flags, The Union Jack and Stars and Stripes surmounted by the inscription \"For Britain\" or \"For America\" as the case may be, and on the other side \"America v Britain. First international golf match at \"The Glasgow Herald\" tournament, Gleneagles, 6 June 1921\""]}, {"page": "Canadian Open (golf)", "response": ["| 1923 ||  Clarence Hackney || align=center|295 || align=center|+7 || 5 strokes ||  Tom Kerrigan || align=right|350 || align=right|580 || Lakeview"]}, {"page": "Western Open", "response": ["| 1920 ||  Jock Hutchison || align=center|296 || align=center|+4 || 1 stroke ||  Jim Barnes Clarence Hackney Harry Hampton || Olympia Fields || Olympia Fields, Illinois"]}, {"page": "New Jersey State Open", "response": ["*1926 Clarence Hackney", "*1925 Clarence Hackney", "*1924 Clarence Hackney"]}, {"page": "List of male golfers", "response": ["|  Clarence Hackney||1894–1941"]}, {"page": "Philadelphia Open Championship", "response": ["*1931 Clarence Hackney", "*1930 Clarence Hackney", "*1923 Clarence Hackney"]}, {"page": "1921 U.S. Open (golf)", "response": ["|rowspan=3 align=center|T4 || | Clarence Hackney ||  || rowspan=3 align=center|74  || rowspan=3 align=center|+4 ", "| Clarence Hackney ||  || 74-76=150", "| Clarence Hackney ||  || 74-76-78=228", "|Clarence Hackney || According to his naturalization certificate (available at Ancestry.com) Hackney became a U.S. citizen in May 1921 || 74-76-78-77=305"]}, {"page": "1921 Open Championship", "response": ["The entries included an unusually large number of U.S.-based players following a funding-raising campaign by an American golf magazine. On 27 September 1920 Golf Illustrated wrote a letter to the Professional Golfers' Association of America with a suggestion that a team of twelve to twenty American professionals be chosen to play in the British Open, to be financed by popular subscription. At that time no American golfer had won the British Open. The idea was that of James D. Harnett, who worked for the magazine. The PGA of America made a positive reply and the idea was announced in the November 1920 issue. The fund was called the British Open Championship Fund. By the next spring the idea had been firmed-up. A team of 12 would be chosen, who would sail in time to play a warm-up tournament at Gleneagles (the Glasgow Herald 1000 Guinea Tournament) prior to the British Open at St Andrews, two weeks later. The team of 12 was chosen by PGA president George Sargent and PGA secretary Alec Pirie, with the assistance of USGA vice-president Robert Gardner. A team of 11 sailed from New York on the RMS Aquitania on 24 May, together with James Harnett, Harry Hampton deciding at the last minute that he could not travel. The American team was: Jim Barnes, Emmet French, Clarence Hackney, Walter Hagen, Charles Hoffner, Jock Hutchison, Tom Kerrigan, George McLean, Fred McLeod, Bill Mehlhorn, and Wilfrid Reid."]}, {"page": "1916 PGA Championship", "response": ["Following the completion of qualifying one of the two qualifiers from the North and Southwest section withdrew. An extra place was allocated to the Metropolitan section. A playoff was arranged on October 4 at Englewood Golf Club between Jack Dowling, Clarence Hackney and Macdonald Smith who had tied for 13th place in the qualifying event on September 29. Smith arrived too late to play and Dowling beat Hackney by a score of 147 to 165 over 36 holes."]}, {"page": "1920 PGA Championship", "response": ["Two-time defending champion Jim Barnes lost in the second round to Clarence Hackney, 5 and 4."]}, {"page": "Hackney (surname)", "response": ["* Clarence Hackney (1894–1941), Scottish-American professional golfer"]}, {"page": "Philadelphia PGA Championship", "response": ["The Philadelphia PGA Championship is the annual section championship of the Philadelphia Section of the PGA of America. It has been played since 1922 on courses throughout the Philadelphia area, including courses in Delaware and New Jersey.  The most notable winner of this event is 1959 Masters Tournament champion Art Wall Jr., who won this event five times. In addition, several PGA Tour pros have had victories in this tournament, including Henry Williams, Jr. (three times), Ed Dougherty (three times), Clarence Hackney (two times), Al Besselink (two times), Gene Kunes (two times), Marty Furgol, and noted golf course designer George Fazio. ", "|align=center|1928 || Clarence Hackney || Philmont Country Club || Huntingdon Valley, Pennsylvania", "|align=center|1924 || Clarence Hackney || Linwood Country Club || Linwood, New Jersey"]}, {"page": "Tom Kerrigan (golfer)", "response": ["Kerrigan was twice the runner-up in the Canadian Open championship. In the 1922 Canadian Open, held at Mt. Bruno Golf Club in Saint-Bruno, Quebec, Kerrigan shot 304 and Al Watrous was on 303, beating Kerrigan by a single shot. Kerrigan returned to play in the 1923 Canadian Open, held on the Herbert Strong-designed Lakeview Golf Club in Toronto, Ontario, and once again finished in the second spot, this time losing to Clarence Hackney by the score of 295 to 300."]}, {"page": "Jack Dowling", "response": ["Dowling had managed to gain entry into the tournament when a west coast player defaulted.  To fill the open spot, the PGA held a playoff between Dowling and Clarence Hackney, the result of which was 72-75=147 for Dowling and a 165 total for Hackney. Macdonald Smith was to have been the third player competing for the open spot but he showed up late after the other two players had finished and was disqualified."]}, {"page": "Willie Ogg", "response": ["The  1922 PGA Championship was the fifth PGA Championship, held August 14–18 at Oakmont Country Club in Oakmont, Pennsylvania, a suburb northeast of Pittsburgh. The match play field of 64 competitors qualified by sectional tournaments. This was the first PGA Championship with a field of 64 in the bracket, the previous four had fields of 32 players. In the Friday final, Gene Sarazen defeated Emmet French, 4 and 3. Ogg began the tournament with a 2 up victory over Clarence Hackney in his first round match. In the second round, he battled Sarazen in a closely contested match before finally losing 2 and 1.  Ogg's final place in the event was a tie for 17th."]}]}}