{"wiki_id": "http://www.wikidata.org/entity/Q51290309", "itemLabel": "Julie Berry", "itemDescription": "American writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Julie_Berry_(author)", "wikipedia_page": {"main": "Julie Berry (born September 3, 1974) is an author of children's and young adults books and winner of several national book awards.", "link_mentions": [{"page": "Carnegie Medal (literary award)", "response": ["* Julie Berry, All the Truth That's in Me (Templar), 14+"]}, {"page": "Medina, New York", "response": ["*Julie Berry (author), children's author"]}, {"page": "Maynard, Massachusetts", "response": ["*Julie Berry, author of ten children's and young adults books; currently living in California"]}, {"page": "List of Rensselaer Polytechnic Institute people", "response": ["*Julie Berry, children's author"]}, {"page": "Golden Kite Award", "response": ["|Julie Berry"]}, {"page": "Vermont College of Fine Arts", "response": ["*Julie Berry"]}, {"page": "AML Awards", "response": [":*The Scandalous Sisterhood of Prickwillow Place by Julie Berry", "::*The Passion of Dolssa by Julie Berry", "::*Wishes and Wellingtons by Julie Berry (Sourcebooks Young Readers)", ":* Lovely War by Julie Berry (Viking Press)", ";Julie Berry"]}, {"page": "List of people from Pasadena, California", "response": ["* Julie Berry, children's author"]}, {"page": "ALA Best Fiction for Young Adults", "response": ["|Julie Berry", "|Julie Berry", "|Julie Berry"]}, {"page": "Simmons University", "response": ["* Julie Berry (author), children's author"]}, {"page": "Julie Berry", "response": ["Julie was born on December 15, 1980, in Lewiston, Maine. A Native American from the Maliseet tribe, she was later adopted at the age of four by Les Berry, an engineer, and his wife Judith, an adoption lawyer. As a result of the adoption, Julie Berry gained an older brother, Chris, but she also was separated from her biological sister, whom she would not see again for another two decades."]}, {"page": "All the Truth That's in Me", "response": ["All the Truth That's in Me is a 2013 young-adult novel by Julie Berry. The novel tells the story of Judith, a young woman from a deeply religious community who is taken for two years and brought back with her tongue partially removed. The story deals with her life after returning and how she is treated by the village."]}, {"page": "List of women writers (A–L)", "response": ["*Julie Berry (US), ch. & YA wr."]}, {"page": "Lovely War", "response": ["Lovely War is a young adult romance novel by Julie Berry, published March 5, 2019 by Viking Books for Young Readers. The book is a New York Times Bestseller, received starred reviews from various sources (i.e., Kirkus Reviews, Publishers Weekly, and Booklist), and was named best book of the year by several sources (i.e., The Wall Street Journal, BookPage, Kirkus Reviews, Buzzfeed, Shelf Awareness, and The Young Folks)."]}]}}