{"wiki_id": "http://www.wikidata.org/entity/Q5129278", "itemLabel": "Claudia Webbe", "itemDescription": "British politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Claudia_Webbe", "wikipedia_page": {"main": "Claudia Naomi Webbe (born 8 March 1965) is a British politician who has served as Member of Parliament for Leicester East since 2019. Born in Leicester, she was a councillor in the London Borough of Islington from 2010 until her resignation in March 2021, having served as its cabinet member for environment and transport. She was a member of the National Executive Committee of the Labour Party from 2016 until her election to Parliament.\nWebbe is the first female Member of Parliament for Leicester East. She was elected to Parliament for the Labour Party in 2019, but was suspended from the party whip in September 2020 after being charged with harassment of a woman. She was convicted of harassment in October 2021 and expelled from Labour on 3 November 2021.", "link_mentions": [{"page": "Politics of the United Kingdom", "response": ["*As of May 2021, there are five Independent MPs. One is the Speaker, Lindsay Hoyle who revoked his Labour affiliation after the 2019 Speaker election, whilst the other four have had the whip revoked. Jonathan Edwards was elected as a Plaid Cymru MP, but had the whip withdrawn in May 2020 after he was arrested on suspicion of assault. He currently sits as an Independent MP after the party's disciplinary panel suspended him from the party. Claudia Webbe and former party leader Jeremy Corbyn have both had the Labour whip removed, whilst Margaret Ferrier was suspended from the SNP as well."]}, {"page": "1965", "response": ["** Claudia Webbe, British politician"]}, {"page": "Leicester", "response": ["Leicester is divided into three Parliamentary constituencies: Leicester East, represented by Claudia Webbe, Leicester South, represented by Jon Ashworth, and Leicester West represented by Liz Kendall. Ashworth and Kendall are members of the Labour Party, while Webbe sits as an Independent MP after being expelled from the Labour Party in November 2021. In April 2011 the then Leicester South MP Sir Peter Soulsby left the House of Commons to seek election as Mayor of Leicester."]}, {"page": "De Montfort University", "response": ["* Claudia Webbe, British politician, MP for Leicester East"]}, {"page": "Jeremy Corbyn", "response": ["Trade union officials such as Len McCluskey and Dave Ward, wrestler Sami Zayn as well as politicians Claudia Webbe, Laura Pidcock, Ken Livingstone, Pablo Iglesias Turrión, Rafael Correa, Dr. Jill Stein, Diane Abbott, John McDonnell, Salma Yaqoob, Kate Osborne, Mercedes Villalba, Mary Foy, Nadia Whittome, Apsana Begum, Liam Byrne, Zarah Sultana and Richard Burgon called for the suspension to be revoked. Campaign group Momentum held a virtual rally entitled 'Stand with Corbyn' where they described Corbyn's suspension as \"a naked attack on the left\"."]}, {"page": "Socialist Campaign Group", "response": ["|Claudia Webbe"]}, {"page": "Leicester East (UK Parliament constituency)", "response": ["Leicester East is a  constituency represented in the House of Commons of the UK Parliament since December 2019 by Claudia Webbe, who was elected as a Labour MP, but now sits as an Independent due to her expulsion from the party in November 2021 after she was charged with harassment.", "| rowspan=\"2\" | Claudia Webbe"]}, {"page": "List of Parliamentary constituencies in Leicestershire and Rutland", "response": ["|Claudia WebbeElected from Labour in 2019, expelled by the party in 2021."]}, {"page": "Simon Webbe", "response": ["Webbe has a daughter, Alanah (born 1996), with ex-girlfriend Nicola Jones, a shop assistant from Solihull. She is the inspiration for his 2007 single \"Grace\". He is reportedly a cousin of the former Sugababes singer, Keisha Buchanan.Simon Webbe: I'm A Celebrity Top 10 facts. Mirror.co.uk (11 November 2008). Retrieved 22 March 2013. His brother Duane Bryan was a contestant on the 2012 series of The Apprentice. He is related to Labour Party politician Claudia Webbe."]}, {"page": "Foreign Affairs Select Committee", "response": ["|Claudia Webbe"]}, {"page": "Human Appeal", "response": ["During the COVID-19 pandemic, the organisation worked with boxer Amir Khan; with Liam Byrne MP  and with Claudia Webbe MP  to promote relief efforts. The organisation worked to deliver food to key workers and people in need during the emergency."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Claudia Webbe, Leicester East, 2019–suspended 2020"]}, {"page": "Webbe", "response": ["*Claudia Webbe (born 1965), English politician"]}, {"page": "Gateway College", "response": ["* Claudia Webbe, Labour MP"]}, {"page": "1965 in the United Kingdom", "response": ["*8 March – Claudia Webbe, Labour politician and MP"]}, {"page": "Environmental Audit Select Committee", "response": ["|Claudia Webbe MP"]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Claudia Webbe (Labour Party MP)"]}, {"page": "Template talk:Constituencies in the East Midlands", "response": ["I have moved Leicester East into a new section for independents as Claudia Webbe has had the Labour whip suspended. Dunarc (talk) 18:17, 28 September 2020 (UTC)"]}, {"page": "Backbench Business Committee", "response": ["|Claudia Webbe MP"]}, {"page": "Claudia (given name)", "response": ["*Claudia Webbe, British politician"]}, {"page": "Courtenay Griffiths", "response": ["On 16 March 2021, whilst representing Claudia Webbe, Griffiths was taken to hospital by ambulance."]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Claudia Webbe"]}, {"page": "List of ethnic minority politicians in the United Kingdom", "response": ["|rowspan=2|Claudia Webbe"]}, {"page": "Shooting of Mark Duggan", "response": ["There was a long history of tension between black communities and the police before and since the Broadwater Farm riot in 1985, in which, according to David Lammy, Labour MP for Tottenham, the \"cracks that already existed between the police and the community became deep fissures\". Since 1985 \"there had been some progress made in the relationship between the local community and the police\", but the shooting \"raised tension\". Lammy stated that Duggan's death occurred as part of \"a history in Tottenham that involves deaths in police custody\". Claudia Webbe, the chairperson of Operation Trident, asserted that many black people see Duggan's shooting as \"yet another unjust death in custody\" and that young black people in Tottenham are \"still six, seven, eight times more likely to be stopped and searched than their white counterparts\"."]}, {"page": "Keskidee Centre", "response": ["* Cllr Claudia Webbe, \"Memories of the Keskidee\", Islington Labour, 16 March 2012."]}, {"page": "March 1965", "response": ["*Born: Claudia Webbe, British Labour Party politician"]}, {"page": "List of people associated with Birkbeck, University of London", "response": ["* Claudia Webbe, Labour MPLabour suspends MP Claudia Webbe over harassment charge | UK news | The Guardian"]}, {"page": "Momentum (organisation)", "response": ["In the 2016 elections for the National Executive Committee, it emerged that Momentum, the Campaign for Labour Party Democracy and other leftist groups had formed a joint slate under the Centre-Left Grassroots Alliance (CLGA), and were backing six representatives for the NEC: Rhea Wolfson, former chair of the Jewish Society who replaced Ken Livingstone; Christine Shawcroft, a senior Momentum figure who had been an NEC member for fifteen years and was briefly suspended from the party after defending Lutfur Rahman (gaining media attention for jocular comments about dialogue with ISIS instead of air strikes); Peter Willsman; Claudia Webbe; Ann Black, and Darren Williams. All six candidates were elected."]}]}}