{"wiki_id": "http://www.wikidata.org/entity/Q5125237", "itemLabel": "Claire Keelan", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Claire_Keelan", "wikipedia_page": {"main": "Claire Keelan (born 8 May 1975) is an English actress. She played Claire Ashcroft in Nathan Barley and Electroclash in No Heroics.", "link_mentions": [{"page": "Nathan Barley", "response": ["Nathan Barley is a British Channel 4 television sitcom written by Charlie Brooker and Chris Morris, starring Nicholas Burns, Julian Barratt, Claire Keelan, Richard Ayoade, Ben Whishaw, Rhys Thomas and Charlie Condou. The series of six weekly episodes began broadcasting on 11 February 2005 on Channel 4. Described by his creator as a \"meaningless strutting cadaver-in-waiting\", the character originated on Brooker's TVGoHome – a website parodying television listings – as the focus of a fly-on-the-wall documentary called Cunt.", "The humour derives from the rapid rise of both the Internet and digital media, and the assumption by publishers and broadcasters that almost any such work is worthy of attention. Barley and his peers are often hired ahead of actual journalists and talented writers trying to make intelligent points, such as the earnest documentary filmmaker Claire Ashcroft (Claire Keelan), and her brother Dan (Julian Barratt), the series' two other central characters.  Claire seeks to highlight the plight of the inner city's homeless and drug-dependent; Dan is a jaded, opinionated and apathetic hack who, having written an article for Sugar Ape entitled \"The Rise of the Idiots\", is appalled to find that \"the idiots\" in question – Nathan and his contemporaries – have adopted him as their spiritual leader, failing to see that they are the very people he was criticising.", "*Claire Keelan as Claire Ashcroft"]}, {"page": "Pierrepoint (film)", "response": ["*Claire Keelan as Jessie Kelly"]}, {"page": "Perfect Day (2005 film)", "response": ["Centered on a group of university friends who reunite five years later for the wedding of Tom (Tom Goodman-Hill)(10 December 2005). Red Revolution, The TimesMoran, Caitlin (12 December 2005). The irresistible rise of the ginger men, The Times and Amy (Claire Goose), it tells the story of old loves rekindled, marriages falling apart and the problems of career women finding love. It also starred Rob James-Collier, Aidan McArdle, Kate Ashfield, Rhashan Stone, Claire Keelan, Bruce Mackinnon and Chris Bisson."]}, {"page": "Simon Farnaby", "response": ["Farnaby is married to actress Claire Keelan (his second wife) with whom he has a daughter, Eve, born in 2014. "]}, {"page": "List of American films of 2007", "response": ["| Pierrepoint: The Last Hangman || IFC Films || Adrian Shergold (director); Jeff Pope, Bob Mills (screenplay); Timothy Spall, Juliet Stevenson, Eddie Marsan, Ben McKay, Michael Norton, Lizzie Hopley, Cavan Clerkin, Mary Jo Randle, Christopher Fulford, Ian Shaw, Ann Bell, Robin Soans, Nicholas Blane, Maggie Ollerenshaw, Bernard Kay, Claire Keelan, Clive Francis, Sheyla Shehovich, Keiran Flynn, Tobias Menzies, Mary Stockley, James Corden || Biography, Drama"]}, {"page": "No Heroics", "response": ["* Sarah, \"Electroclash\" – Claire Keelan", "The series contains a lot of references to comics in the props, touching on both American comic books as well as British comics like 2000 AD – the latter being the home of Grant Morrison's Zenith, which was \"the germ of it\", according to the writer Drew Pearce.The greatest cape, The Guardian, 13 September 2008 The actors Nicholas Burns and Claire Keelan had previously appeared together as main characters in Nathan Barley, with Burns as the title character."]}, {"page": "How Not to Live Your Life", "response": ["The pilot featured a number of actors who did not appear as regular characters in the series – Sally Bretton, Rich Fulcher, Claire Keelan and Bruce Mackinnon. Although, Isabel Fay who also appeared in the pilot was in the final episode of the first series, \"The Break Up\", as Fiona. The BBC then commissioned a full series, which was filmed in a studio in Glasgow. Clark wrote each episode and directed four episodes. The first series started broadcasting on BBC Three on 12 August 2008 with the first episode, \"Home Sweet Home\", which introduces the four main characters of Don, Abby, Karl and Eddie. BBC Three showed the first series on Tuesday evenings at 10:30pm."]}, {"page": "The Trip (2010 film)", "response": ["* Claire Keelan as Emma"]}, {"page": "List of comedy films of the 2010s", "response": ["|The Trip||Michael Winterbottom||Steve Coogan, Rob Brydon, Claire Keelan||United Kingdom||"]}, {"page": "Line of Duty", "response": ["* Claire Keelan as DS Leah Janson"]}, {"page": "Kelly + Victor", "response": ["* Claire Keelan as Victoria"]}, {"page": "The Last Weekend (TV series)", "response": ["Ian (Shaun Evans) and Em (Claire Keelan) receive a surprise invitation from an old friend. Ollie (Rupert Penry-Jones) invites the couple to spend a weekend in the Suffolk countryside with him and Daisy (Genevieve O'Reilly). The couples expect an idyllic holiday, but the competitive edge to the men's relationship soon rises to the surface, with irreversible consequences.", "* Claire Keelan as Em"]}, {"page": "Mai Fuchigami", "response": ["| Hush || Wendy || Claire Keelan || Film ||"]}, {"page": "Mister John", "response": ["Mister John is a 2013 drama film by Joe Lawlor and Christine Molloy (who are also known by the name of their creative partnership - Desperate Optimists). It was their second feature film following their debut Helen and stars Aidan Gillen, Zoe Tay, Michael Thomas, and Claire Keelan.", "* Claire Keelan as Kathleen Devine"]}, {"page": "The Trip to Italy", "response": ["*Claire Keelan as Emma"]}, {"page": "Carnage (2017 film)", "response": ["* Claire Keelan as Lindsay Graber"]}, {"page": "The Trip to Spain", "response": ["* Claire Keelan as Emma"]}, {"page": "List of British films of 2017", "response": ["|| Director: Michael Winterbottom  Cast: Steve Coogan, Rob Brydon, Claire Keelan, Marta Barrio, Kyle Soller"]}, {"page": "Line of Duty (series 1)", "response": ["* Claire Keelan as DS Leah Janson"]}, {"page": "The Trip to Greece", "response": ["* Claire Keelan as Emma"]}]}}