{"wiki_id": "http://www.wikidata.org/entity/Q512681", "itemLabel": "Joan McAlpine", "itemDescription": "Scottish journalist and politician (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joan_McAlpine", "wikipedia_page": {"main": "Joan McAlpine (born 28 January 1962) is a Scottish journalist and former Scottish National Party politician.  She was a Member of the Scottish Parliament (MSP) for the South Scotland region from 2011 to 2021. She has a newspaper column in The Daily Record and is author of the blog Go Lassie Go, which won a Scottish media blog award.\nMcAlpine is known for her opposition to reforming the Gender Recognition Act and for her views on sex and gender.\n\n", "link_mentions": [{"page": "East Ayrshire", "response": ["|Joan McAlpine"]}, {"page": "Tommy Sheridan", "response": ["From within Militant, he was the public face of a mass non-payment campaign against the Community Charge in Scotland (where it was introduced a year earlier than other parts of the UK \"as an experiment\"). The campaign involving the refusal to pay the tax, together with resistance to warrant sales which local councils held to try to recoup the money, was ultimately successful and Sheridan became a popular political figure. Sheridan denounced those who fought the police in the large-scale riot against the poll tax in London – which took place on 31 March 1990, the day before the tax was introduced in England and Wales – and publicly threatened to \"name names\". The police widely advertised for people to tell them the names of alleged rioters, and partly as a result of police acting on such information, over 100 individuals were jailed. With Joan McAlpine, he published A Time to Rage which chronicled the anti-poll tax movement of the late-1980s and early-1990s. McAlpine has since written about the Sheridan she became close to during that turbulent youthful period, with reference in particular to the defamation case."]}, {"page": "Pat Kane", "response": ["Kane was formerly married to Joan McAlpine, an SNP Member of the Scottish Parliament for the South of Scotland region. They have two daughters, Grace and Eleanor, who were educated at a private school."]}, {"page": "Ian Davidson (British politician)", "response": ["A member of the SNP politician Joan McAlpine's staff, Gail Lythgoe, was found to have emailed a women's equality group, supporting Whiteford and alleging that Davidson has a history of bullying women and called on them to demonstrate against him whilst asking them not to reveal SNP involvement in its instigation. The email was later leaked and Lythgoe publicly apologised for making unsubstantiated allegations, with the Labour Party alleging that this was a result of an SNP \"dirty tricks campaign\" against Davidson and calling for an investigation."]}, {"page": "Jim Gellatly", "response": ["He appeared on Scottish TV in STV's search for Scotland's Greatest Album. The show was a joint venture between STV, Real Radio and The Sun who convened a panel of music industry experts to select an initial short list of 60 tracks. The public chose the final tracks to appear on the Album. Alongside Gellatly, the panel consisted of T in the Park supremo Geoff Ellis, SNP MSP Joan McAlpine, Real Radio DJ Steve McKenna, songwriter John McLaughlin, and football pundit and now popular DJ Pat Nevin."]}]}}