{"wiki_id": "http://www.wikidata.org/entity/Q5126542", "itemLabel": "Clarence Graham", "itemDescription": "Northern Irish businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Clarence_Graham", "wikipedia_page": {"main": "Sir Clarence Johnston Graham, 1st Baronet (8 May 1900 – 22 December 1966) was a businessman and an Ulster Unionist Party politician in Northern Ireland.", "link_mentions": [{"page": "Ulster Unionist Party", "response": ["Lord Brookeborough, despite having felt that Craigavon had held on to power for too long, was Prime Minister for one year longer. During this time he was on more than one occasion called to meetings of the Grand Orange Lodge of Ireland to explain his actions, most notably following the 1947 Education Act which made the government responsible for the payment of National Insurance contributions of teachers in Catholic Church-controlled schools. Ian Paisley called for Brookeborough's resignation in 1953 when he refused to sack Brian Maginess and Clarence Graham, who had given speeches supporting re-admitting Catholics to the UUP. He retired in 1963 and was replaced by Terence O'Neill, who emerged ahead of other candidates, Jack Andrews and Faulkner."]}, {"page": "Dromore, County Down", "response": ["* Sir Clarence Graham, Bt., former Ulster Unionist Party politician"]}, {"page": "Graham baronets", "response": ["The Graham Baronetcy, of Dromore in the County of Down, was created in the Baronetage of the United Kingdom on 23 January 1964 for Clarence Graham. He was a director of John Graham, Ltd, engineering contractors, and Chairman of the Standing Committee of the Ulster Unionist Council from 1947 to 1963. The title became extinct on the death of the second baronet in 2020."]}, {"page": "Brian Maginess", "response": ["In December 1959, Ian Paisley led a demonstration of Ulster Protestant Action members to Stormont Castle to protest at Lord Brookeborough's refusal to dismiss Maginess and Sir Clarence Graham. They had made speeches at an Ulster Young Unionist Council event supporting Catholic membership of the Ulster Unionist Party."]}, {"page": "Young Unionists", "response": ["In 1959, Brian Maginess, Q.C., and Sir Clarence Graham, Bt., spoke to the Young Unionists advocating an increase in Roman Catholic membership of the UUP.  This was regarded as controversial at the time."]}]}}