{"wiki_id": "http://www.wikidata.org/entity/Q51278422", "itemLabel": "Emily Blathwayt", "itemDescription": "UK suffragette supporter and gardener", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Blathwayt", "wikipedia_page": {"main": "Emily Marion Blathwayt (née Rose; 1852 – 1940) was a British suffragette  and mother of Mary Blathwayt. She and her husband, Linley, a retired Colonel from the Indian Army  lived at Eagle House in Somerset and established a welcome and garden summerhouse for women in the movement, that became known as the \"Suffragette's Rest\".", "link_mentions": [{"page": "Emily (given name)", "response": ["*Emily Blathwayt (1852–1940), British suffragette, mother of Mary Blathwayt"]}, {"page": "Rose (surname)", "response": ["* Emily Blathwayt née Rose (1852–1940), British suffragette, mother of Mary Blathwayt; Eagle House home was \"Suffragette's Rest\", planted trees for hunger strikers"]}, {"page": "Mary Phillips (suffragette)", "response": ["Phillips showed other suffragettes different forms of protest, including getting Charlie Marsh to help her pavement chalking in Lambeth, whom Philips noted  'gamely stood the jeering and rough handling' the women got in the process.  Her next location from January 1909, was in Newcastle and then back south to Cornwall and Devon.  She was among the welcoming party for another released prisoner Emmeline Pethick-Lawrence, in April 1909, with the Pankhursts, two Kenney sisters, Vera Wentworth, Minnie Baldock and Mary Gawthorpe. They were taken to join 500 suffragettes at a celebration lunch at the Criterion, Picadilly Circus restaurant.  Phillips was arrested later in 1909 again with Vera Wentworth and Elsie Howie for attempting to force their attendance at a men's meeting in Exeter where Lord Carrington in charge of the Agriculture and Fisheries Board was speaking. During her seven days imprisoned she went on hunger strike and was released after four days 'in a dangerous state'. Other WSPU leaders Mary Blathwayt, Emily Blathwayt, wrote in their diaries about Phillips suffering from fainting, and Emmeline Pankhurst wrote to her \"my dear girl take care of yourself and do everything in your power to recover your health and strength.\"  Phillips also carried out  what Christabel Pankhurst called a 'splendid protest' showing ' pluck and ingenuity' by hiding under the stage overnight, jumping out shouting 'Votes for Women' and objecting to Patricia Woodlock's imprisonment when two Cabinet Ministers were being awarded honorary degrees in Liverpool St George's Hall."]}, {"page": "Mary Blathwayt", "response": ["Mary Blathwayt was born 1 February 1879 in Worthing, Sussex, the daughter of Colonel Linley Blathwayt, an army officer who had served in India and Emily Blathwayt (née Rose) who were first cousins. ", "* View an (out of copyright) picture of Mary Blathwayt, Emily Blathwayt and Annie Kenney at Pankhurst Pond in 1910."]}, {"page": "Jessie Kenney", "response": ["Jessie Kenney, along with her sister Annie, was invited to Mary Blathwayt's home, Eagle House at Batheaston where the leading suffragettes met. Their significant visitors to Batheaston was asked to plant a tree to record their achievements on behalf of the cause e.g. a prison sentence. It was this attack on government ministers which led Mary's mother Emily Blathwayt to withdraw from WSPU due to its militant tactics. This event also led Gladstone to consider surveillance and forming a special branch of police to be able protect cabinet ministers  from militant action by advance information. "]}, {"page": "Vera Wentworth", "response": ["In 1908 Wentworth joined the Women's Social and Political Union (WSPU), having formally changed her name to 'Vera Wentworth' in 1907.Wilfrid reputedly said that this was undertaken on the orders of their Father so that the family name wasn't brought into disrepute. The Spinks were wealthy established chemists in Holborn and Westminster, London. The name carried weight. She lived with Caprina Fahey in London. Soon afterwards she was arrested during a demonstration outside the House of Commons. She was sentenced to six weeks' imprisonment. On her release she became a close friend of Mary Blathwayt. In 1908 she joined the Women's Social and Political Union. She was quickly arrested demonstrating outside parliament. Her sentence was six weeks in prison and she had to stay an extra day because she had carved votes for women into her cell wall. She and others were met by Mary Blathwayt and the two of them became friends. Following her release, Vera threw herself into things and joined a secret spin-off group called the Young Hot Bloods, pledging to undertake \"danger duty\" in the name of women’s suffrage. Of the older suffragettes, only Emmeline Pankhurst was permitted to sit in on their meetings at a tea shop on London’s Strand. Indeed, elder suffragist Emily Blathwayt found Vera so charming but wayward that she affectionately referred to her as \"the young hooligan we know\". In June she was arrested again for demonstrating outside the House of Commons. This time she was given a three month sentence. After her release she published \"Should Christian Women Demand the Vote\" and \"Three Months in Holloway\". Wentworth was a writer with an ambition to attend university. She joined the Women Writer's Suffrage League which was founded in 1908."]}, {"page": "Eagle House (suffragette's rest)", "response": ["When Emily Blathwayt and her husband Colonel Linley Blathwayt owned the house, it was used, from 1909 to 1912, as a refuge for suffragettes who had been released from prison after hunger strikes. It became known as the Suffragette's Retreat. Emily Blathwayt was a suffragette and member of the Women's Social and Political Union.", "In 1882 Eagle House became home to Colonel Linley Blathwayt, his wife Emily, and their children William and Mary Blathwayt. Linley Blathwayt had been a Colonel in the army in India and moved into the house when he retired. He had interests in insects and in photography. Emily Blathwayt's interest was in the garden and they had an extensive library of books, including hundreds on botany and nature.", "On 28 April 1909, Emily Blathwayt wrote in her diary that \"the idea of a field of trees grows\". The site chosen was a two-acre field on the side of Solsbury Hill. This was not to be a simple wood or even an arboretum. They planted individual holly trees to celebrate women working for the cause whereas those militant women who had been imprisoned were celebrated with a particular conifer. Each had a different species and floral rings were planted around each tree. The planting was achieved by a visit from the suffragette who then posed by a purpose made lead plaque. This was photographed by Colonel Lindley and he would also capture a portrait of the suffragette. These portraits were signed and sold at the WSPU shop in Bath. Blathwayt's diary also includes details of the sexual relationships between some participants of the movement which took place at Eagle House.", "When Vera Wentworth and Elsie Howey assaulted H. H. Asquith (the Prime Minister), this proved too much for the Blathwayt family. The Blathwayts were also distressed by arson and other attacks on property carried out by the suffragettes, including one near Eagle House. Emily Blathwayt resigned from the WSPU and Linley Blathwayt wrote letters of protest to Christabel Pankhurst, Howey and Wentworth. Pankhurst was told that Howey and Wentworth could not visit their house again. Wentworth sent them a long reply expressing regret at their reaction but noting that \"if Mr. Asquith will not receive deputation they will pummel him again\"."]}, {"page": "Clara Mordan", "response": ["Mordan was invited to Eagle House in Batheaston on 27 April 1910 to plant a holly tree. Eagle House was where Mary Blathwayt's family entertained visitors at their \"Suffragette's Rest\". Many notable supporters were invited to the house. Emily Blathwayt planted trees and shrubs in \"Annie's Arboretum\" to commemorate achievements and her husband recorded these in photographs. The arboretum was named after Annie Kenney and she had a room at Eagle House."]}, {"page": "Helen Kirkpatrick Watts", "response": ["Watts achievements for the cause were recognised by Mary Blathwayt and her parents Linley and Emily Blathwayt. She was invited to their house", "Eagle House which was also in Somerset. Emily Blathwayt had chosen a field in the grounds of their house where suffragettes who had been imprisoned were celebrated with a particular conifer. Like other famous suffragette's Watts' visit was recorded with a purpose-made lead plaque. She was photographed by Colonel Lindley Blathwayt planting a Juniper plant on 17 March 1911. His portraits were signed and sold at the WSPU shop in Bath."]}, {"page": "Millicent Browne", "response": ["Brown was invited to Emily Blathwayt's home at Batheaston where the leading suffragettes recouped. Significant visitors were asked to plant a tree to record their achievements on behalf of the cause e.g. a prison sentence. On 4 July 1909 Browne planted not a tree but a holly bush at Eagle House where Linley Blathwayt took her picture and recorded the planting. Most of the trees were destroyed in the 1960s but Brown's plaque is one of the few to have survived."]}, {"page": "Marie Naylor", "response": ["In 1909 and 1910 she stayed at Eagle House with Linley and Emily Blathwayt. On 9 April 1910 she was given the honour of planting a tree in \"Annie's Arboretum\"."]}, {"page": "Lillian Forrester", "response": ["In 1911 Forrester was invited to Eagle House near Bath by Linley and Emily Blathwayt. The Blathwayts invited leading suffragettes to visit their house. They created over 40 memorial trees to celebrate these visits in what was known as 'Annie's Arbour'."]}]}}