{"wiki_id": "http://www.wikidata.org/entity/Q5125303", "itemLabel": "Claire Rutter", "itemDescription": "English soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Claire_Rutter", "wikipedia_page": {"main": "Claire Rutter (born 1972 in  South Shields) is an English operatic soprano.", "link_mentions": [{"page": "Guildhall School of Music and Drama", "response": ["* Claire Rutter (born 1972), soprano"]}, {"page": "South Shields", "response": ["* Claire Rutter – leading operatic soprano"]}, {"page": "Gramophone Classical Music Awards", "response": ["*Choral – Elgar The Kingdom Claire Rutter; Susan Bickley; John Hudson; Iain Paterson; Hallé Choir & Orchestra / Sir Mark Elder"]}, {"page": "List of people from South Shields", "response": ["* Claire Rutter, operatic soprano"]}, {"page": "National Opera Studio", "response": ["*Claire Rutter"]}, {"page": "Rutter (name)", "response": ["* Claire Rutter (born 1976), English operatic soprano"]}, {"page": "Grange Park Opera", "response": ["Singers who have performed with Grange Park Opera include Bryn Terfel, Simon Keenlyside, Joseph Calleja, Claire Rutter, Rachel Nicholls, Bryan Register, Susan Gritton, Wynne Evans, Sally Matthews, Alfie Boe, Robert Poulton, Jeffrey Lloyd-Roberts, Sara Fulgoni, Clive Bayley and Alistair Miles. In recent years, the repertoire has included musicals: Fiddler on the Roof in 2015 and Oliver! in 2016. Fiddler on the Roof was subsequently staged in the Royal Albert Hall as part of the 2015 BBC Proms."]}, {"page": "British Youth Opera", "response": ["British Youth Opera was started by Denis Coe, MP in 1987, to give high-standard performance opportunities to singers straight out of music college. Denis was a member of the board of the National Youth Theatre and had seen that the practical experience participants were receiving was greatly enhancing their opportunity for entering the profession. In the days before the opera companies had young artists’ programmes, British Youth Opera was conceived as a ‘bridge’ organisation, to offer young singers performance opportunities in a fully professional but nurturing environment, in which they could train on the job and perform before a paying audience of the public, and before industry professionals whose influence could help them in their ongoing careers. Alumni have gone on to advanced training courses at the Royal Opera House and the National Opera Studio, and to professional careers. Alumni include Peter Auty, Lucy Crowe, Rosemary Joshua, Katarina Karnéus, Sally Matthews, Christopher Maltman, Claire Rutter, Nicky Spence, Matthew Stiff, and Mark Stone."]}, {"page": "Claire (given name)", "response": ["* Claire Rutter (born 1976), English soprano "]}, {"page": "Southampton Operatic Society", "response": ["Several past members have moved onto the professional stage including Barry Clark, Valerie Nunns, Anne Osborne. and Claire Rutter (who is Vice President of the Society).http://www.sotonopera.org/whoarewe.html"]}, {"page": "List of operas performed at the Wexford Festival", "response": ["|2016 ||  Vanessa || Barber || English || 1958  || Timothy Myers || Rodula Gaitanou || Cordelia Chisholm || Claire Rutter, Rosalind Plowright"]}, {"page": "Opera North: history and repertoire, seasons 1997–98 to 2003–04", "response": ["|1999–00 || La Gioconda ||  Ponchielli ||  Claire Rutter (Gioconda), David Maxwell Anderson (Enzo), Katja Lytting (Laura), Jonathan Summers (Barnaba) ||  Oliver vonDohnányi || colspan=\"2\"|  Revival of 1992–3 production"]}, {"page": "The Northumbria Anthology", "response": ["Claire Rutter,"]}, {"page": "David Charles Abell", "response": ["|La bohème (selections)Madama Butterfly (selections) || CD: Tring Records || Royal Philharmonic OrchestraClaire Rutter, Paul Charles Clarke, Stephen Gadd"]}, {"page": "List of Geordie singers", "response": ["* Claire Rutter - 20C/21C singer of many dialect songs including \"My Sunderland Lass\" (with Graeme Danby) from the CD From Tees to Tyne (MWMCDSP51)"]}, {"page": "List of operas performed at the Santa Fe Opera", "response": ["|2008 || Falstaff || Verdi || Italian || 1893 || Paolo Arrivabeni || Kevin Newbury || Allen Moyer,Clare Mitchell,Duane Schuler || Laurent Naouri /Anthony Michaels-Moore,Nancy Maultsby,Claire Rutter,Kelley O'Connor"]}, {"page": "Liao Changyong", "response": ["In 2005 Liao portrayed the role of Renato to Claire Rutter's Amelia and Patrizia Patelmo's Ulrica for his debut at the Florida Grand Opera. In 2007 he sang the title role in Verdi's Rigoletto in Shanghai. In 2008 he was a featured soloist in the opening of the Beijing Music Festival. In 2010 he was a guest soloist in the New York Philharmonic's concert series \"Concerts In the Park\", performing Rossini arias with the Shanghai Symphony Orchestra. That same year he was the baritone soloist in Carl Orff's Carmina Burana with the Hong Kong Philharmonic Orchestra. He sang that work again in 2013 with the Sydney Symphony Orchestra under conductor Long Yu."]}, {"page": "Wasfi Kani", "response": ["Singers who have performed with the company include Bryn Terfel, Simon Keenlyside, Joseph Calleja, Claire Rutter, Rachel Nicholls, Bryan Register, Susan Gritton, Wynne Evans, Sally Matthews, Alfie Boe, Robert Poulton, Jeffrey Lloyd-Roberts, Sara Fulgoni, Clive Bayley and Alastair Miles. The festival has also included musicals with productions of Fiddler on the Roof in 2015 and Oliver! in 2016. Fiddler on the Roof was subsequently staged in the Royal Albert Hall as part of the 2015 BBC Proms."]}, {"page": "Ruth (opera)", "response": ["*Ruth, Jean Rigby (mezzo-soprano), Mark Tucker (tenor), Yvonne Kenny (soprano), Claire Rutter (soprano), Roderick Williams (baritone) Joyful Company of Singers, City of London Sinfonia, Richard Hickox ChandosThe Gramophone - Volume 83, Issue 2 - Page 61  2005 -  I should like to receive Lennox Berkeley's opera Ruth, since I have waited for this first recording for almost 50 years. Its sensitively drawn biblical drama, with a fine cast under Richard Hickox, is a reflection of the composer's own religious ..."]}]}}