{"wiki_id": "http://www.wikidata.org/entity/Q5129067", "itemLabel": "Claude W. Kinder", "itemDescription": "British engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Claude_W._Kinder", "wikipedia_page": {"main": "Claude William Kinder,  (simplified Chinese: 金达; traditional Chinese: 金達; pinyin: Jin Da; 10 August 1852 – 9 August 1936 in Churt, England) was an English engineer. For over thirty years he was engineer-in-chief of the Kaiping Tramway and Imperial Railways of North China.Claude William Kinder was the third son of Major Thomas William Kinder who served as Master of the Hong Kong Mint from 1863 to 1868 and the Director of the Imperial Japanese Mint in Osaka between 1870 and 1875.Tutored by his father, Claude later studied railway engineering in St. Petersburg before obtaining his first professional appointment as an assistant engineer with Imperial Japanese Railways in 1873. Forced to leave Japan because of civil war in 1878 he moved to Shanghai where he met Tong King-sing who appointed him as an engineer with the Chinese Engineering and Mining Company at Tangshan near to the ancient walled city of Kaiping. Kinder's initial brief was to help with the sinking of coal mine shafts at the new colliery and to construct a railway from the mines to the nearest navigable river. Chinese politics initially prevented the building of this railway and in consequence Kinder surveyed and built a canal for coal barges to operate between the river at Lutai and Hsukochuang (Xugezhuang) from where a short tramway was constructed to Tangshan.The government authority for the tramway had intended that only mules were to be used for hauling coal wagons but Kinder (with Tong King Sing's connivance) secretly constructed a home-built steam locomotive which was christened “The Rocket of China”, the first steam locomotive ever made in China. From these early beginnings the ‘Kaiping Tramway’ evolved into China’s first major railway line and administration known as Imperial Railways of North China and later, after the overthrow of the Qing dynasty, the Peking-Mukden Railway. Kinder served this railway as Engineer-in-Chief for some thirty years until retirement in 1909.The Chinese Government appointed Kinder as an Honorary Chinese official and he was decorated with the Imperial Order of the Double Dragon. In 1900 Kinder was made a Companion of the Order of St Michael and St George by the British Government in recognition of his services to the development of railways (and British financial interests) in China. He died in Churt, England on 9 August 1936, a day short of his eighty-fourth year.", "link_mentions": {}}}