{"wiki_id": "http://www.wikidata.org/entity/Q5125292", "itemLabel": "Claire Rayner", "itemDescription": "British writer (1931-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Claire_Rayner", "wikipedia_page": {"main": "Claire Berenice Rayner, OBE (; née Chetwynd; 22 January 1931 – 11 October 2010) was an English journalist, broadcaster, novelist and nurse, best known for her role for many years as an agony aunt.", "link_mentions": [{"page": "Funeral", "response": ["Humanists UK organises a network of humanist funeral celebrants or officiants across England and Wales, Northern Ireland, and the Channel Islands and a similar network is organised by the Humanist Society Scotland. Humanist officiants are trained and experienced in devising and conducting suitable ceremonies for non-religious individuals. Humanist funerals recognise no \"afterlife\", but celebrate the life of the person who has died. In the twenty-first century, humanist funerals were held for well-known people including Claire Rayner, Keith Floyd, Linda Smith, and Ronnie Barker."]}, {"page": "Radio Active (radio series)", "response": ["* unsympathetic agony aunt Anna Rabies (known as \"Joanna Jaundice\" in series one, and \"Claire Rabies\" in series three) (Atkinson-Wood), the names perhaps alluding to Anna Raeburn and Claire Rayner"]}, {"page": "Wembley", "response": ["* Nurse, journalist, broadcaster and novelist Claire Rayner lived in Wembley."]}, {"page": "Television Wales and the West", "response": ["TWW also launched the careers of many famous faces, who appeared on their early broadcasts. These include John Humphrys and Claire Rayner. TWW was the first to showcase Adge Cutler – his appearances on the TWW programme 'The Cider Apple' led to Adge's fame spreading and the formation of The Wurzels. Michael Palin was one of the presenters of TWW's pop show 'NOW!'. Bruce Lewis was one of TWW's main news presenters; he went on to write various books about his experience during the Second World War, \"Aircrew, a Few of the First\", plus other titles such as How to be A TV Presenter – his son, Peter Lewis, hosted Movie Magazine and went on to announce for TWW, HTV West, and most famously, LWT."]}, {"page": "City of London School for Girls", "response": ["* Claire Rayner, journalist"]}, {"page": "Republicanism in the United Kingdom", "response": ["In January 1997, ITV broadcast a live television debate Monarchy: The Nation Decides, in which 2.5 million viewers voted on the question \"Do you want a monarch?\" by telephone. Speaking for the republican view were Professor Stephen Haseler, (chairman of Republic), agony aunt Claire Rayner, Paul Flynn, Labour MP for Newport West and Andrew Neil, then the former editor of The Sunday Times. Those in favour of the monarchy included author Frederick Forsyth, Bernie Grant, Labour MP for Tottenham, and Jeffrey Archer, former deputy chairman of the Conservative Party. Conservative MP Steven Norris was scheduled to appear in a discussion towards the end of the programme, but officials from Carlton Television said he had left without explanation. The debate was conducted in front of an audience of 3,000 at the National Exhibition Centre in Birmingham, with the telephone poll result being that 66% of voters wanted a monarch, and 34% did not."]}, {"page": "List of feminists", "response": ["|1875–1939||data-sort-value=\"Rayner, Claire\"|Claire Rayner||United Kingdom||1931||2010||||"]}, {"page": "HM Prison Holloway", "response": ["In October 1999, it was announced that healthcare campaigner and agony aunt Claire Rayner had been called in to advise on an improved healthcare provision at Holloway Prison. Rayner's appointment was announced after the introduction of emergency measures at the prison's healthcare unit after various failures."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Claire Rayner"]}, {"page": "Humanists UK", "response": ["| colspan=\"1\" |Claire Rayner"]}, {"page": "Claire Berk", "response": ["#redirect Claire Rayner"]}, {"page": "Claire Berenice Berk", "response": ["#redirect Claire Rayner"]}, {"page": "Claire Bernice Berk", "response": ["#REDIRECT Claire Rayner"]}, {"page": "List of nurses", "response": ["*Claire Rayner (born 1931), British journalist, agony aunt and activist"]}, {"page": "Motorcycle safety", "response": ["#  Quit riding. Or ban motorcycling; this is the belief that motorcycling is too dangerous. Some former motorcyclists had an epiphany due to an accident involving themselves or a person they know, which permanently upends their view of motorcycling. Some are adamant in their opposition to motorcycling, unwilling to consider the merits or pleasures of riding due to their strongly held views. The late advice columnist Claire Rayner, in her review of Melissa Holbrook Pierson's motorcycling book The Perfect Vehicle, admitted she was unable to review the book objectively, because nothing Pierson wrote could change her loathing of motorcycling that originated when she was a \"hospital casualty [emergency room] nurse and spent so much time dealing with bikers who were scraped off the road like so much raspberry jam after accidents\", so that she \"became an implacable hater of the machine... The danger to which bikers constantly put themselves, however well-wrapped in their urban armour of studded leather, and however horrendously helmeted, seems to me a reason for banning the infernal machines. ...a smell of blood and smashed muscle and bone mixed with engine oil. That is what motor cycle means to me. And, I'm afraid, always will.\" However, Kevin Williams, a well-known UK-based advanced motorcycle instructor and rider skills advocate has said \"Often the bare bones of facts are backloaded with a subjective, uninformed, emotive and ultimately prejudicial judgment: “they know the risk of riding a motorcycle, but they still choose to ride rather than use a much safer car”. For example, agony aunt Claire Rayner, in her review of Melissa Holbrook Pierson’s motorcycling book...\". Some safety experts have advocated banning motorcycling altogether as being untenably dangerous."]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Claire Rayner"]}, {"page": "List of breast cancer patients by survival status", "response": ["*Claire Rayner, British nurse, journalist, and activist. She also suffered from Grave's disease. She never recovered from emergency intestinal surgery she received in May 2010, and died in hospital on October 11, 2010, aged 79."]}, {"page": "2006 Liberal Democrats leadership election", "response": ["*Other notable supporters: Rosie Boycott, former Liberal MP Sir Clement Freud, Claire Rayner, Sandi Toksvig, Polly Toynbee"]}, {"page": "List of Peter Simple characters", "response": ["* Clare Howitzer — socialist agony aunt. Based partly on Claire Rayner."]}, {"page": "Jay Rayner", "response": ["Jason Matthew Rayner was born on 14 September 1966. He is the younger son of Desmond Rayner and journalist Claire Rayner. His family is Jewish. He was raised in the Sudbury Hill area of Harrow and attended the independent Haberdashers' Aske's Boys' School. He studied politics at the University of Leeds, where he was editor of the Leeds Student newspaper, graduating in 1988."]}, {"page": "List of people associated with the University of London", "response": ["* Claire Rayner (KCL)"]}, {"page": "Women's Library", "response": ["Personal archives held at the Women's Library include those of Lesley Abdela, Adelaide Anderson, Elizabeth Garrett Anderson, Louisa Garrett Anderson, Margery Corbett Ashby, Lydia Becker, Helen Bentwich, Rosa May Billinghurst, Chili Bouchier, Elsie Bowerman, Josephine Butler, Barbara Cartland, Jill Craigie, Emily Wilding Davison, Charlotte Despard, Emily Faithfull, Millicent Garrett Fawcett, Vida Goldstein, Teresa Billington-Greig, Elspeth Howe, Mary Lowndes (see also Artists' Suffrage League Papers), Constance Lytton, Harriet Martineau, Edith How-Martyn, Angela Mason, Hannah More, Helena Normanton, Eleanor Rathbone, Claire Rayner, Sheila Rowbotham, Maude Royden, Myra Sadd Brown, Nancy Seear, Baroness Seear, Elaine Showalter, William Thomas Stead, Mary Stott, Louisa Twining and Henry Wilson."]}, {"page": "List of people with breast cancer", "response": ["| Claire Rayner"]}, {"page": "Humanist celebrant", "response": ["Humanist funerals have reportedly been held in recent years for Claire Rayner, Jennifer Lipman, Agony aunt Claire Rayner dies at age 79, Jewish Chronicle, 12 October 2010 Keith Floyd, Haroon Siddique, Mourners pay tribute to TV chef Keith Floyd at humanist funeral, The Guardian, 30 September 2009Bristol Evening Post, Keith Floyd funeral in Bristol, 30 September 2009 Linda Smith, Ronnie Barker, BBC, Family funeral for Ronnie Barker, 13 October 2005 Lynsey de Paul,BBC News, \"Lynsey de Paul: Singer-songwriter's funeral held\", 8 October 2014.  Accessed 3 March 2015 and Terry Jones, Victoria Wood, Doris Lessing, John Noakes, David Nobbs, Cynthia Payne, Dale Winton, and Bob Monkhouse, among others. The humanist funeral for former First Minister of Wales Rhodri Morgan in 2017 was the first national funeral in the United Kingdom to be led by a humanist celebrant, former AM Lorraine Barrett, as well as the first national funeral held in Wales."]}, {"page": "Mega (magazine)", "response": ["'Mega Mouth' was the letters pages which featured letters from readers.  The best letter of the month would be given a prize along with the title 'Mega Star' above their letter, whereas the letter that was deemed unintelligible would be titled with 'Mega Moron'.  Also included in these pages were other columns such as 'Excerpts From The Diary of a Stunt Mega Drive', 'Blagged' and 'The Curious Letters of Harold S Bloxham', which followed the unsuccessful exploits of imaginary Harold S Bloxham and his crusade against video game nasties and the evil they inflict on our younger generation.  His letters were sent out to various celebrities and politicians in the hope that they would agree with his views and join his cause. Letters and replies came back from the likes of Claire Rayner, Blue Peter editor Lewis Bronze, Jason Donovan, Sir Patrick Moore, Magnus Magnusson, Kenny Dalglish and Lloyd Grossman. All correspondence replied back, politely, disagreeing with his views and stating their reasons. Once it was realised to Harold that his efforts were going unheeded he gave up.  It was then revealed that Harold S. Bloxham didn't exist after all, it was Neil West and Andy Dyer playing devil's advocate on the game playing scene."]}, {"page": "List of British Jewish entertainers", "response": ["*Claire Rayner (1931–2010), agony aunt and broadcaster"]}, {"page": "The Personality Test", "response": ["* 02-05 - 04.01.2007 - Claire Rayner"]}, {"page": "List of British Jewish writers", "response": ["* Claire Rayner, agony aunt"]}, {"page": "Victoria Wood: As Seen on TV", "response": ["Wood hired many actors she had previously worked with and felt she could trust, such as Peter Ellis, Meg Johnson, Kay Adshead and Sue Wallace. Wood hired several celebrities for the show including Frank Bruno, Denis Healey, Claire Rayner, Pete Postlethwaite, Maureen Lipman, Hope Jackman, Molly Weir, Henry Kelly, Dora Bryan and Anne Reid (who would star with Wood again in her sitcom dinnerladies in 1999. Kelly and Bryan made guest appearances in the sitcom)."]}, {"page": "List of rose cultivars named after people", "response": ["*Claire Rayner (1931 — Jones, United Kingdom)"]}, {"page": "Tony Bastable", "response": ["During his career, Bastable produced and presented many one-off programmes, including historical documentaries and current affairs programmes, and presented and commentated on many outside and sporting events. He presented two series of Problems (1976-77), a programme on sexual difficulties, screened late, and with Claire Rayner in the first series, and Jenny Conway and Paul Brown for the entire run. For Thames he presented the Drive-In programme with Shaw Taylor from 1973 to 1978, and also its successor Wheels from 1980 to 1981. In 1976 he presented Miss Thames Television; he also wrote and presented 1776, the ITV programme on the US bicentenary, and he provided the commentaries for the award-winning historical series English Garden, which were delivered by Sir John Gielgud. For nine years Bastable presented the consumer protection series Money-Go-Round, and also presented shows such as Mind Over Matter, a programme he devised with Kit Pedler that investigated the paranormal, and the computing series Database as well as 4 Computer Buffs. In addition, he was a panellist on radio shows and he narrated the Channel 4 nature programme Profiles Of Nature."]}, {"page": "Rayner", "response": ["*Claire Rayner (1931–2010), British journalist and agony aunt"]}, {"page": "Ruth Martin", "response": ["*Claire Rayner (1931–2010), English writer who used the pseudonym Ruth Martin"]}, {"page": "List of alumni of King's College London", "response": ["*Claire Rayner – journalist and agony aunt"]}, {"page": "List of atheist authors", "response": ["* Claire Rayner OBE (1931–2010): British journalist best known for her role for many years as an agony aunt.\"I tell you something, in case anyone wonders, not a single out-of-body experience, no long corridors of light, I was an atheist when it started and I've remained one. People used to say to me, 'You wait until something really bad happens, you'll start praying', but I didn't and I can't. I don't put this down to any superior being, I put it down to the superb training and skill of the people looking after me. I remain the humanist I always was.\" Claire Rayner, interviewed by Libby Brooks, The Guardian, September 12, 2003, Features Pages, p. 6."]}, {"page": "Claire (given name)", "response": ["* Claire Rayner (born 1931), English journalist and agony aunt"]}]}}