{"wiki_id": "http://www.wikidata.org/entity/Q5126150", "itemLabel": "Clare Daniels", "itemDescription": "English international rugby union referee", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Daniels", "wikipedia_page": {"main": "Clare Daniels (born 1974 (age 47–48)) is an English international rugby union referee and is the world's most capped female Test referee.\nShe has played scrum-half for Tor RFC in Glastonbury for a few years in the late 1990s before the team disbanded and Daniels decided to take part in a training course run by the Somerset Rugby Referees’ Society.Her international debut was on 2 July 2005, when she refereed the Canada Cup match between Canada and Scotland. Since then she has been selected to officiate at Women's Rugby World Cup in 2006 and 2010, 2009 Rugby World Cup Sevens, Women's Six Nations in 2007, 2008, 2009 and 2010 and other tournaments, including some men's matches in National League 2 North and National League 2 South.After working as a Bath Chronicle sports writer for seven years, Daniels took up a full-time role with the RFU refereeing team as the new Southern Region Referee Development Manager on 2 August 2010.", "link_mentions": [{"page": "2006 Women's Rugby World Cup", "response": [": Clare Daniels (England)"]}, {"page": "2010 Women's Rugby World Cup", "response": ["England's Clare Daniels officiated the opening match between Canada and Scotland, while Australian Sarah Corrigan refereed the final between England and New Zealand.", "*  Clare Daniels"]}, {"page": "2014 Women's Rugby World Cup", "response": ["In April 2014 the IRB announced a panel of 14 match officials for the tournament, including eight referees and six assistant. New Zealand provided two of the referees in the form of Jess Beard and Nicky Inwood, while there will be one each from United States, England, South Africa, Ireland, Australia and Canada. England provided  two assistant referees with the others coming from Italy, France, Scotland and Spain. Nicky Inwood, Sherry Trumbull and Clare Daniels were selected for 2010 Women's Rugby World Cup, which took place in England. Indeed, Inwood and Daniels also refereed at the 2006 edition in Canada.", "*  Clare Daniels"]}, {"page": "2010 Women's Rugby World Cup Pool B", "response": ["Clare Daniels (England)"]}, {"page": "2011 end-of-year women's rugby union tests", "response": ["Clare Daniels (England)"]}, {"page": "2013 Women's Six Nations Championship", "response": ["Clare Daniels (England)"]}, {"page": "2013 mid-year women's rugby union tests", "response": ["Clare Daniels (England)", "Clare Daniels (England)"]}, {"page": "Claire Daniels", "response": ["#REDIRECT Clare Daniels"]}, {"page": "2020 Women's Six Nations Championship", "response": ["Clare Daniels (England)", "Clare Daniels (England)"]}]}}