{"wiki_id": "http://www.wikidata.org/entity/Q5133079", "itemLabel": "Clifford Woodward", "itemDescription": "Bishop of Gloucester", "wikipedia_url": "https://en.wikipedia.org/wiki/Clifford_Woodward", "wikipedia_page": {"main": "Clifford Salisbury Woodward MC (12 August 1878 – 14 April 1959) was Bishop of Bristol from 1933 to 1946 and Bishop of Gloucester from 1946 to 1953.", "link_mentions": [{"page": "St John's, Smith Square", "response": ["*1926–1933 Clifford Woodward (later Bishop of Bristol then Gloucester)"]}, {"page": "Trevor Huddleston", "response": ["Huddleston was the son of Ernest Huddleston and was born in Bedford, Bedfordshire, and educated at Lancing College (1927–1931), Christ Church, Oxford, and at Wells Theological College. He joined an Anglican religious order, the Community of the Resurrection (CR), in 1939, taking vows in 1941, having already served for three years as a curate at St Mark's Swindon. He had been made a deacon at Michaelmas 1936 (27 September) and ordained a priest the following Michaelmas (26 September 1937) — both times by Clifford Woodward, Bishop of Bristol, at Bristol Cathedral."]}, {"page": "Bishop of Gloucester", "response": ["| 60px Clifford Woodward"]}, {"page": "List of alumni of Jesus College, Oxford", "response": ["Former students of the college to have become bishops outside England and Wales include Rowland Ellis (Bishop of Aberdeen and Orkney from 1906 to 1911), Richard Meredith (Bishop of Leighlin from 1579 to 1597), and John Rider (Bishop of Killaloe 1612 to 1632). In the twentieth century, bishops to have studied at the college include Kenneth Cragg (assistant Bishop of Jerusalem from 1970 to 1973), John Dickinson (assistant Bishop of Melanesia from 1931 to 1937), Gordon Roe (Bishop of Huntingdon from 1980 to 1997), Alwyn Williams (Bishop of Durham from 1939 to 1952 and Bishop of Winchester from 1952 to 1961), and Clifford Woodward (Bishop of Bristol from 1933 to 1946 and Bishop of Gloucester from 1946 to 1953)."]}, {"page": "Box, Gloucestershire", "response": ["The first place of worship in the village was a mission church built in 1880. The corrugated iron building was originally used for an infant school. After the First World War, the building began to house the village Sunday School and weekly Evensong service. The church lacked an altar and organ; musical accompaniment was played on a harmonium. The church was expanded in the 1920s by the rector of Minchinhampton, who oversaw the installation of a piano and provided the use of a portable altar, and the building itself was extended in the 1930s. By the outbreak of the Second World War, the village had begun to fundraise to build a permanent church. The foundation stone was laid by Bishop of Gloucester Clifford Woodward in 1951, and the building completed the following October. The church was consecrated by Woodward's successor, Wilfred Askwith. The church is dedicated to St Barnabas, and now offers a Eucharist service on Sundays and Holy Communion on Wednesdays."]}]}}