{"wiki_id": "http://www.wikidata.org/entity/Q5131390", "itemLabel": "Clement Power", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Clement_Power", "wikipedia_page": {"main": "Clement Power (born 20 August 1980 in London) is a British conductor.", "link_mentions": [{"page": "List of University of Cambridge people", "response": ["*Clement Power (Caius)"]}, {"page": "List of Old Carthusians", "response": ["*Clement Power (born 1980), conductor"]}, {"page": "Đuro Živković", "response": ["On the Guarding of the Heart was commissioned by and dedicated to Das Klangforum Wien. The premiere was led by British conductor Clement Power. The piece represents Živković's highest achievement in his compositional technique, complexity and musical accessibility. He was awarded the 2014 Grawemeyer Award for Music Composition for the work.http://grawemeyer.org/news-updates/zivkovic-wins-grawemeyer-music-prizeŽivković offers a Utopia of new stability and order that, within the social chaos, can be found only in society’s ‘antipode’: the individual. However, the ‘information’ about their own depths to which they allegedly descend is conveyed to the individuals through a work of art, a phenomenon whose ontological and phenomenological foundation relies on institutional support and social engagement – in other words, it stems from the place it occupies in a society’s production structure. Also, the knowledge of ‘the depths of the heart’ comes from a composer who mastered the technique, and is not likely to use all of those fantasies to snap the audience out of their lethargy and confront them with the current problems. On the contrary, by eliminating uncertainty he induces us to ‘descend’ somewhere where ‘eternity’ overpowers current problems, and that place he calls ‘the heart’ of ‘the spiritual.’ Živković, therefore, as a creator, builds the image of a guardian of tradition who, thanks to his technical skills, transcends national boundaries, proving the ‘propriety’ and ‘extra-temporality’ of his construction of Serbian heritage, which, if adequately mediated, will demonstrate its value by closeness to universal ‘truths’.Excerpt from: M. Milojkovic: New Sound: International Magazine for Music;2012, Issue 39, p81"]}, {"page": "Ensemble Musikfabrik", "response": ["The musicians of Ensemble Musikfabrik have collaborated with both the younger generation of conductors, composers, directors and choreographers as well as the more renowned ones. The guest list of the ensemble includes Mark Andre, Louis Andriessen, Stefan Asbury, Oscar Bettison, Sir Harrison Birtwistle, Unsuk Chin, Péter Eötvös, Brian Ferneyhough, Heiner Goebbels, Toshio Hosokawa, Michael Jarrell, Mauricio Kagel, György Kurtág, Helmut Lachenmann, David Lang, Liza Lim, Benedict Mason, Mouse on Mars, Carlus Padrissa (La Fura dels Baus), Emilio Pomàrico, Enno Poppe, Clement Power, Wolfgang Rihm, Peter Rundel, Rebecca Saunders, Karlheinz Stockhausen, Ilan Volkov and Sasha Waltz. Since 2012 they have performed a number of works by Harry Partch, using a set of replicas of Partch's instruments built for the ensemble by Thomas Meixner."]}, {"page": "List of Royal College of Music people", "response": ["*Clement Power (born 1980), conductor"]}, {"page": "Ensemble Contrechamps", "response": ["The ensemble has premiered works by George Benjamin, Unsuk Chin, Hugues Dufourt, Beat Furrer, Stefano Gervasoni, Heinz Holliger, Michael Jarrell, György Kurtág, Jimmie LeBlanc, Martín Matalon, Tristan Murail, Isabel Mundry and Rebecca Saunders, amongst others.  Conductors and artists associated with the ensemble include Péter Eötvös, Stefan Asbury, Pascal Rophé, Pierre-Laurent Aimard, Michael Wendeberg, Jurjen Hempel, Clement Power, and Peter Hirsch."]}, {"page": "APRA Music Awards of 2017", "response": ["| Ensemble Musikfabrik; Cologne Opera, Clement Power (conductor), Massimo Furlan (director)"]}, {"page": "On the Guarding of the Heart", "response": ["On the Guarding of the Heart for chamber orchestra is the most known instrumental work by Serbian-Swedish composer Djuro Zivkovic. The work was commissioned by the Klangforum Wien, written in 2011, and premiered on 14 November 2011 in the Terazije Theatre, Belgrade, during the International Composers' Festival held that year. The conductor for the premiere was Clement Power conducting the Klangforum Wien. The piece has received the world's largest prize for musical composition the Grawemeyer Award in 2014. Since its premiere, despite the complexity of the work, the piece was performed around the world more than 40 times. The music is composed during July–October 2011, partly in Gagnef and in Stockholm."]}]}}