{"wiki_id": "http://www.wikidata.org/entity/Q5132784", "itemLabel": "Cliff Twemlow", "itemDescription": "English actor, nightclub bouncer, horror paperback author and library music composer (1937-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cliff_Twemlow", "wikipedia_page": {"main": "Cliff Twemlow (14 October 1937 – 5 May 1993) was an English actor, nightclub bouncer, horror paperback author and library music composer.", "link_mentions": [{"page": "1993 in film", "response": ["| style=\"text-align:center;\"| 5 || Cliff Twemlow || style=\"text-align:center;\"| 59 || style=\"text-align:center;\"|UK || style=\"text-align:center;\"| Conductor, Actor || Dawn of the Dead"]}, {"page": "John Wyman", "response": ["He played Cliff (based very loosely on nightclub bouncer Cliff Twemlow in the 1982 film Tuxedo Warrior, and in 1991 he appeared as Donnor, the captain of the spaceship Firestar, in the film Firestar - First Contact for Ice International Films directed by David Kent-Watson."]}, {"page": "Cliff twemlow", "response": ["#REDIRECT Cliff Twemlow "]}, {"page": "Dawn of the Dead (soundtracks)", "response": ["Much of the music used in the film was licensed from the De Wolfe Music Library, a much-utilized source of stock music for film and TV projects.  Although the Goblin score has been variously available since the film's release, it was not until 2004 that any of the highly sought-after 60-plus cues of library music used in the film were released on a compilation album from Trunk Records. In 2009, virtually all the cues used (actually 74 of a total 86 library music pieces) were researched, identified & catalogued by Robert McLaine, Darren Stuart, John Toman, Allen Lighthiser, Patrick J. Doody, Llyswen Vaughn & Chris Stavrakis, and published on the Dawn Of The Dead Ultimate Soundtrack website.  The album included 'Cause I'm a Man' written by Cliff Twemlow and Peter Taylor under the pen name Peter Reno and recorded by the Pretty Things, and Herbert Chappell's 1965 composition \"The Gonk\" which plays over the final credits. The track is used in many references to the film including Shaun of the Dead and a variation (performed in chicken clucks) is used as the end theme to Robot Chicken. The early part of the tune to \"The Gonk\" was used in \"The Ladies' Bras\", a track by Jonny Trunk and Wisbey which, at only 36 seconds long, became the shortest ever UK top 40 single when it made number 27 on 30 September 2007. Shaun of the Dead opens with the track \"Figment\" which also features on the compilation. The album's cover is taken from a Belgian promotional poster for the film."]}, {"page": "Twemlow (surname)", "response": ["*Cliff Twemlow (1937–1993), English actor, nightclub bouncer, horror paperback author, and library music composer"]}, {"page": "Brian Sterling-Vete", "response": ["Sterling began working as a TV & Film Stunt Performer when offered work on projects by the Mancunian author, songwriter, composer and film producer Cliff Twemlow.", "Projects in collaboration with writer and producer Cliff Twemlow included: The Pike", "2015, August 6, Sterling published the book Tuxedo Warriors. which is his autobiography and also the biography of author, music composer, actor, and cult film producer, Cliff Twemlow, between 1977 and Twemlow's death in 1993. The book is published through MajorVision Ltd.", "2017, 12 December, Sterling re-published the book: The Tuxedo Warrior.  This the re-published biography of cult movie-maker Cliff Twemlow, which includes an extended prologue and epilogue section by Sterling.  The book is published through MajorVision Ltd.", "2017, 12 December, Sterling re-published the book: The Pike.  This is a horror novel written by cult movie-maker Cliff Twemlow, which includes an extended prologue and epilogue section by Sterling. The book is published through MajorVision Ltd.", "2017, 27 December, Sterling re-published the book: The Beast of Kane.  This is a horror novel written by cult movie-maker Cliff Twemlow, which includes an extended prologue and epilogue section by Sterling.  The book is published through MajorVision Ltd.", " Sterling's work was again honoured at the Manchester and Salford Film Festival in 2009 and 2010 and in the book The Lost World of Cliff Twemlow: The King of Manchester Exploitation Movies by C.P. Lee and Andy Willis (as featured in the Manchester Evening News. Sterling was part of the pioneering movie making team led by Twemlow from the late 70s into the 90s.  This 3-decade era was dubbed in the book as being 'The Golden Age of Video Cinematography' in Britain."]}, {"page": "Peter Taylor (composer)", "response": ["Peter Taylor is a musician and composer born in Manchester, England. He has worked with the BBC and Granada Television, and together with Cliff Twemlow formed one half of the composition partnership Peter Reno."]}, {"page": "Peter Reno", "response": ["Peter Reno was a prolific musical composition partnership between Peter Taylor (composer) and his business associate, Cliff Twemlow. They were active throughout the sixties and seventies and had music included in popular TV shows including Queenie's Castle and Crown Court (TV series) and several films including Dawn Of The Dead. "]}]}}