{"wiki_id": "http://www.wikidata.org/entity/Q51319", "itemLabel": "Glen Matlock", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Glen_Matlock", "wikipedia_page": {"main": "Glen Matlock (born 27 August 1956) is an English musician, best known for being the bass guitarist in the original line-up of the punk rock band the Sex Pistols. He is credited as a songwriter on 10 of the 12 songs on the Sex Pistols' only album, Never Mind the Bollocks, Here's the Sex Pistols, although he had left the band early in the recording process.\nSince leaving the Sex Pistols in 1977, he has performed with several other bands, as well as presented his own work. After the death of his replacement in the Sex Pistols, Sid Vicious, Matlock has resumed bass guitar duties for subsequent Sex Pistols reunions, including the 1996 Filthy Lucre Tour, the 2002 concert to commemorate the Golden Jubilee of Elizabeth II, their 2003 North American Piss Off Tour, and their 2007–08 UK and Europe Combine Harvester Tour.", "link_mentions": [{"page": "August 27", "response": ["*1956 – Glen Matlock, English singer-songwriter and bass player "]}, {"page": "Rickenbacker", "response": ["The sound of Rickenbacker basses featured early on in the UK punk/New wave music explosion of the late 1970s and early 80s and was used by: Glen Matlock (Sex Pistols), Paul Simonon (The Clash), Bruce Foxton (The Jam), Paul Gray (The Damned, Eddie & the Hot Rods), Tony James (Generation X), Mike Mills (R.E.M.), Michael Bradley (The Undertones), Youth (Killing Joke) and in the U.S., Kira Roessler (Black Flag)."]}, {"page": "Sex Pistols", "response": ["The Sex Pistols originally comprised vocalist John Lydon (known at the time by his stage name \"Johnny Rotten\"), guitarist Steve Jones, drummer Paul Cook and bassist Glen Matlock. Matlock was replaced by Sid Vicious in early 1977. Under the management of Malcolm McLaren, the band attracted controversies that both captivated and appalled Britain. Through an obscenity-laced television interview in December 1976 and their May 1977 single \"God Save the Queen\", the latter of which attacked Britons' social conformity and deference to the Crown, they popularised punk rock in the UK. \"God Save the Queen\" was banned not only by the BBC but also by nearly every independent radio station, making it the \"most heavily censored record in British history\".", "In early 1974, Jones asked McLaren to manage The Strand. Effectively agreeing, McLaren paid for their first formal rehearsal space. Glen Matlock, an art student who occasionally worked at 'Too Fast to Live, Too Young to Die', was recruited as the band's regular bassist.Savage, Jon. England's Dreaming, pp. 70–80. In November, McLaren temporarily relocated to New York City. Before his departure, he and Westwood had conceived a new identity for their shop: renamed SEX, it changed its focus from retro couture to S&M-inspired \"anti-fashion\", with a billing as \"Specialists in rubberwear, glamourwear & stagewear\".Savage, Jon. England's Dreaming, pp. 83, 92; Robb, John, Punk Rock, pp. 83–89, 102–105. After informally managing and promoting the New York Dolls for a few months, McLaren returned to London in May 1975.Savage, Jon. England's Dreaming, pp. 87–88, 97;  Inspired by the punk scene that was emerging in Lower Manhattan—in particular by the Ramones and the radical visual style and attitude of Richard Hell, then with Television—McLaren began taking a greater interest in The Strand members.Savage, Jon. England's Dreaming, pp. 88–90, 92, 97.", "* Glen Matlock – bass, backing vocals (1975–1977, 1996–2001, 2002–2003, 2007–2008)"]}, {"page": "The Clash", "response": ["Mick Jones played guitar in protopunk band London SS, which rehearsed for much of 1975 without ever playing a live show and recording only a single demo. London SS were managed by Bernard Rhodes, a sometime associate of impresario Malcolm McLaren and a friend of the members of the McLaren-managed band, the Sex Pistols. Jones and his bandmates became friendly with Sex Pistols Glen Matlock and Steve Jones, who would assist them as they tried out potential new members. Among those who auditioned for London SS without making the cut were Paul Simonon, who tried out as a vocalist, and drummer Terry Chimes. Nicky Headon drummed with the band for a week, then quit."]}, {"page": "The Damned (band)", "response": ["In 2006, The Damned released the single \"Little Miss Disaster\", and a live DVD MGE25 documenting a 2004 Manchester concert celebrating the 25th anniversary of Machine Gun Etiquette. On 21 October 2006, BBC Radio 2 broadcast an hour-long documentary titled Is She Really Going Out With Him? concerning the recording of the Damned's first single \"New Rose\" and the group's place in the 1976 London punk scene. Featuring interviews with James, Sensible, Scabies, Glen Matlock, Don Letts and Chrissie Hynde, the programme discussed the bands and personalities around the scene, particularly the Anarchy in the U.K. tour."]}, {"page": "Cockney", "response": ["*Glen Matlock, rock and punk rock musician, from Paddington"]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["| 75px|The Sex Pistols in Amsterdam in 1977 (L–R: Paul Cook, Glen Matlock, Johnny Rotten and Steve Jones)", "| Paul Cook, Steve Jones, Glen Matlock, John Lydon, and Sid Vicious."]}, {"page": "Public Image Ltd", "response": ["In 1993, Lydon worked on his memoirs, first published in 1994 as Rotten: No Irish, No Blacks, No Dogs, and in 1996 he regrouped with Steve Jones, Glen Matlock and Paul Cook for the Sex Pistols' Filthy Lucre Tour. Lydon released a solo album, Psycho's Path, in 1997. 1999 saw the release of the 4-disc PiL compilation Plastic Box; it offered a more comprehensive retrospective of PiL's recorded output than the single-disc The Greatest Hits, So Far. Plastic Box contained a mixture of previously released and unreleased material spanning PiL's entire career, although no material from Commercial Zone or PiL's two live albums was included (in the compilation's liner notes, Lydon wrote that \"this collection represents a comma not a full stop, I fully intend to carry on with PiL, and there will be more in the future.\")."]}, {"page": "Malcolm McLaren", "response": ["From 1974, McLaren had advised SEX customers Paul Cook and Steve Jones on their musical aspirations, having proposed that one of his shop assistants, Glen Matlock, join them as the bass-player in a group McLaren named Kutie Jones and his Sex Pistols. In the summer of 1975, McLaren ejected the bespectacled guitarist/singer Wally Nightingale from the line-up because he lacked visual appeal.The Lost Pistol, Nick Kent, Punk: The Whole Truth, Mojo Special Edition, May 2005", "In a coffin sprayed with the slogan \"Too Fast To Live Too Young To Die\", McLaren's funeral was attended by Westwood, Sex Pistols bandmates Paul Cook and Glen Matlock, and celebrities such as Bob Geldof, Tracey Emin and Adam Ant. The funeral was held at One Marylebone, a deconsecrated church in central London.Singh, Anita. (22 April 2010) \"Malcolm McLaren's funeral\". The Daily Telegraph. Retrieved on 9 July 2011."]}, {"page": "Heaven 17", "response": ["During October 2016, Heaven 17 undertook a dual headline tour with their British Electronic Foundation (B.E.F.) The dates included venues in Liverpool, Birmingham, Glasgow, Gateshead, Manchester, Bury St Edmunds, Basingstoke and London. B.E.F. enlisted Mari Wilson, Glen Matlock (Sex Pistols), and Peter Hooton (The Farm) to present new arrangements of songs from the B.E.F. back catalogue. The tour was significant in that it was the first time that Heaven 17 had played the Sheffield City Hall; having not performed there during the 1980s."]}, {"page": "Dexys Midnight Runners", "response": ["In February 2012, Rowland officially announced the imminent release of a fourth studio album for Dexys. The band also released a preview of \"Now\", the album's first track. The album, entitled One Day I'm Going to Soar, was released by BMG on 4 June 2012. All but one song were co-written by Rowland and Talbot, usually with other co-writers such as Paterson or Glen Matlock; the album continued in the same style as Don't Stand Me Down (featuring spoken sections in the songs), which led the album to be described as \"a concept album with an unreliable narrator\"."]}, {"page": "Sid Vicious", "response": ["Simon John Ritchie (10 May 1957 – 2 February 1979), known professionally as Sid Vicious, was an English musician best known as the bassist for the punk rock band Sex Pistols. He replaced Glen Matlock, who had fallen out of favour with the other members of the group.", "Vicious was asked to join the Sex Pistols after Glen Matlock's departure in February 1977, due to Vicious being present at every gig.", "With Spungen acting as his \"manager\", despite McLaren legally still being his real representation, Vicious embarked on a solo career during which he performed with musicians including Mick Jones of the Clash, Sex Pistols bassist Glen Matlock, Rat Scabies of the Damned and the New York Dolls' Arthur Kane, Jerry Nolan, and Johnny Thunders. He performed the majority of his performances at Max's Kansas City and drew large crowds, though some performances were \"hellish\", especially when Vicious insulted some of the audience. Examples of this can be heard in the in-between tracks on his live album Sid Sings. Guitarist Steve Dior said in the documentary film Who Killed Nancy? that he \"got good money for those shows.\"  His gigs at Max's would turn out to be his last performances before he died the following February.", "Though regarded by many including Steve Jones and original Sex Pistols bassist Glen Matlock as a talented vocalist, Vicious was initially a poor bass player. During an interview for Guitar Hero III, when Jones was asked why he, instead of Vicious, recorded the bass parts of Never Mind the Bollocks, Jones responded, \"Sid was in a hospital with hepatitis, so he couldn't really play, not that he could play anyway.\" According to producer Chris Thomas, Sid played bass on \"Bodies\" and \"God Save The Queen\". Vicious asked Lemmy, the leader and bassist of Motörhead, to teach him how to play with the words, \"I can't play bass,\" to which Lemmy replied, \"I know.\""]}, {"page": "Bromley Contingent", "response": ["Sid Vicious, the bassist who replaced Glen Matlock in Sex Pistols, claimed in interviews of the time that he despised the Bromley Contingent. This was in spite of his having played drums for Siouxsie and the Banshees' debut live appearance at the 100 Club Punk Festival in 1976 and regularly socializing with the group. In a 1977 interview for BBC Wales, Vicious claimed to have invented the Pogo as a means to knock them over at the 100 Club, though subsequent books have said it came about as a result of others copying him when he was attempting to see an early Sex Pistols concert from the back of the room."]}, {"page": "1977 in music", "response": ["*February 15 – Sid Vicious replaces Glen Matlock as the bassist of the Sex Pistols."]}, {"page": "1956 in music", "response": ["*August 27 – Glen Matlock, guitarist (Sex Pistols)"]}, {"page": "Faces (band)", "response": ["The original Small Faces would have a reunion during the mid to late 1970s with Marriott, Jones, and McLagan joined by Rick Wills on bass guitar, as Lane withdrew early due to his illness. A number of partial reunions of the Faces were rumored throughout the 2000s, with various one-off performances involving surviving members occurring.  In 2010-2011 a brief reunion tour occurred with Mick Hucknall and Glen Matlock on vocals and bass respectively. In 2021, Jones, Stewart, and Wood reunited to record a new record.", "On 25 May 2010, it was announced that the Faces had officially reformed with Hucknall taking on vocal duties, and Glen Matlock of the Sex Pistols on bass. The band played festival dates in both 2010 and 2011, with dates in the UK, Belgium, the Netherlands and Japan.", "*Glen Matlock – bass guitar (2010–2012)"]}, {"page": "Never Mind the Bollocks, Here's the Sex Pistols", "response": ["The band's internal relationships were always volatile, and the lineup saw changes during the recording of the album.  Original bass guitarist Glen Matlock left the band early in the recording process, and while he is credited as a co-writer on all but two of the tracks, he only performed bass on \"Anarchy in the U.K.\".  Recording sessions continued with a new bass player, Sid Vicious, who is credited on two of the songs the band wrote after he joined.  While Vicious's bass playing appeared on two tracks, his lack of skill on the instrument meant that many of the tracks were recorded with guitarist Steve Jones playing bass instead.  Drummer Paul Cook and singer Johnny Rotten appear on every track.  The various recording sessions were led alternately by Chris Thomas or Bill Price, and sometimes both together, but as the songs on the final albums often combined mixes from different sessions, or were poorly documented who was present in the recording booth at the time, each song is jointly credited to both producers.", "John Lydon, Steve Jones & Paul Cook wrote the album's 12 tracks between August of 1975 and June of 1976, with Glen Matlock acting as a co-writer on most of the tracks, written before his departure in February of 1977, and Sid Vicious co-writing the two written after his entry into the group.", "In February of 1977, founding member and original bassist Glen Matlock quit, Gimarc, George, Punk Diary, p. 56. reportedly over the lyrics to God Save The Queen.Lydon, John, Rotten, p. 3. See also pp. 82, 103. Matlock had co-written a majority of the album's tracks and was replaced by Sid Vicious.", "Close to completing a deal with A&M Records, in March 1977 the Sex Pistols entered Wessex Sound Studios to record with producer Chris Thomas and engineer Bill Price. New bassist Sid Vicious played on the tracks \"Bodies\" and \"God Save the Queen\", but his performing skills were not considered fit to record the full album, so the band asked manager Malcolm McLaren to convince previous bassist Glen Matlock to perform the instrument for the sessions. Matlock agreed on the condition that he was paid beforehand. When payment was not received, he declined to attend. As a result, Thomas asked guitarist Steve Jones to play bass so work could begin on the basic tracks. Jones' playing was so satisfactory that Thomas had him play the bass tracks for all the remaining songs recorded during the sessions.", "Before Virgin could release Never Mind the Bollocks, Branson discovered that two other Sex Pistols albums were competing with his label's. In October, a bootleg named Spunk featuring high-quality recordings of Sex Pistols demos and recording sessions with Dave Goodman was released on a label called Blank. Among the rumours of who was behind the release of the tapes included Goodman, Glen Matlock and McLaren, who has always considered Goodman's versions to be a more accurate representation of the band. Meanwhile, the French pressing of Never Mind the Bollocks on Barclay had added \"Submission\" to the slated 11-song track list, and was due for release a week before Virgin's edition. As McLaren's separate deal with Barclay meant that the French release could not be halted and given the Virgin head was aware of how easy it was for import records to arrive in Britain, Branson rushed production of Never Mind the Bollocks to ensure it would come out a week earlier than intended. Nevertheless, the Barclay version was already available in the UK at the time Virgin had its version ready. Ten thousand copies of Virgin's pressing erroneously only listed 11 tracks on the sleeve yet contained 12 on the actual record.", "*Glen Matlock – bass on \"Anarchy in the UK\""]}, {"page": "Deep Sea Skiving", "response": ["#\"No Feelings\" – 2:33  (Paul Cook, Steve Jones, Glen Matlock, Johnny Rotten) "]}, {"page": "Blank Generation (album)", "response": ["Punk became a phenomenon in England, with the quick rise and fall of the Sex Pistols and with longer lasting bands such as the Clash. Glen Matlock was inspired to write \"Pretty Vacant\" in 1976 after seeing a handbill containing the names of Hell's songs, including \"(I Belong To The) Blank Generation\", that Malcolm McLaren had brought back to England with him from the United States. Matlock, nor any of the other Pistols, had actually heard Hell's song, as it wasn't released on an album until September 1977. By then, \"Pretty Vacant\" had already recorded and released as a single two months earlier. Hell was at first offended at how much McLaren had taken from him—musically, lyrically, and visually—but came to accept it, as he believed \"ideas are free property\", and praised the band's vocalist Johnny Rotten for taking his nihilist persona further than he felt himself able to do. The Voidoids toured England with the Clash in 1977, and during one show, Rotten appeared on stage and goaded the audience into demanding an encore from Hell and his band. The nihilism of \"Blank Generation\" was echoed in other songs in the early British punk scene such as the Sex Pistols' \"Anarchy in the U.K.\", the Clash's \"London's Burning\" and Generation X's \"Your Generation\"."]}, {"page": "Gary Oldman", "response": ["Oldman has had a keen interest in music from an early age. He is a proficient pianist and stated in a 1995 interview with Charlie Rose that he would rather be a musician than an actor. Oldman sang several tracks on the Sid and Nancy soundtrack, on which he performed alongside original Sex Pistols bassist Glen Matlock, and sang and played live piano in the 1988 movie Track 29. He traced over Beethoven compositions in 1994's Immortal Beloved, and tutored Harry Potter actor Daniel Radcliffe on bass guitar. Oldman appeared on Reeves Gabrels' album The Sacred Squall of Now, performing a vocal duet with David Bowie on the track \"You've Been Around\". He produced a live performance by former White Stripes member Jack White in conjunction with Vevo and YouTube. At the 2016 Brit Awards in London, Oldman paid tribute to Bowie, before receiving the Brits \"Icon Award\" on behalf of the singer and his family."]}, {"page": "Nancy Spungen", "response": ["Alan G. Parker directed the 2010 documentary film Who Killed Nancy?, which includes interviews with Vicious and Spungen's associates, including John Holmstrom, Don Letts, Glen Matlock, and Howie Pyro."]}, {"page": "Sid and Nancy", "response": ["In a later interview, Lydon was asked the question, \"Did the movie get anything right?\" to which he replied: \"Maybe the name Sid.\"Fine, Marshall. Rotten to the Core: An Interview With John Lydon. drdrew.com. Cox's attitude toward his subjects was negative; one of the reasons he was attracted to the project was that he was afraid that if someone else made it, it would portray its subjects as \"real exemplars of Punk, rather than sold-out traitors to it.\" He acknowledged that Lydon's hatred of the movie was \"understandable, given that it was based on incidents from his life and centred around one of his friends.\" Neither original bassist Glen Matlock nor guitarist Steve Jones have been as outspoken about the movie as Lydon, although Lydon claimed that drummer Paul Cook was more upset over the movie than he was."]}, {"page": "Barry Andrews (musician)", "response": ["Barry Andrews (born 12 September 1956 in West Norwood, London) is an English singer, songwriter, musician, and keyboardist, formerly of the bands XTC and League of Gentlemen, who co-founded Shriekback.Strong, Martin C. (2003) The Great Indie Discography, Canongate, , p. 185Kellman, Andy \"[ Barry Andrews Biography]\", AllMusic, Retrieved 2010-01-23 He has collaborated with Brian Eno on several projects, most recently guesting on keyboards for the 2005 album Another Day on Earth. Andrews also played on the 1980 Iggy Pop album Soldier with David Bowie, Ivan Kral, Glen Matlock and Klaus Kruger.Strong, Martin C. (2002) The Great Rock Discography, Canongate, , p. 815"]}, {"page": "Ultravox", "response": ["With the band seemingly over, Ultravox were then revitalised by Midge Ure, who joined the band as vocalist, guitarist and keyboardist. He had already achieved minor success with semi-glam outfit Slik and Glen Matlock's The Rich Kids, and in 1979, he was temporarily playing with hard rock band Thin Lizzy on their American tour, replacing Gary Moore."]}, {"page": "Anarchy in the U.K.", "response": ["In 2007, the surviving members (not including original Pistols bassist Glen Matlock) re-recorded \"Anarchy in the U.K.\" for the video game Guitar Hero III: Legends of Rock because the multi-track master could not be found (it was rediscovered along with the rest of the Never Mind The Bollocks masters during a move in January 2012). The Guitar Hero version also appears in the film adaption of the A-Team. The song was also featured in the video game Tony Hawk's Pro Skater 4 as part of the soundtrack. The song also appears in the Constantine TV series during the episode \"The Devil's Vinyl\".", "* Glen Matlock – bass, backing vocals", "Category:Songs written by Glen Matlock"]}, {"page": "Midge Ure", "response": ["By October 1977, Ure had left PVC2 to join former Sex Pistol Glen Matlock in Rich Kids. He moved to London and soon found himself immersed in a scene he had previously only read about in the pages of the NME. Musical tensions within the band led to Ure's departure. Having acquired a Yamaha CS50 synthesiser, Ure – alongside bandmate Rusty Egan – wanted to integrate the new instrument into the band's sound. With Glen Matlock and Steve New preferring to remain with the traditional guitars and drums approach, the band split."]}, {"page": "Steve Jones (musician)", "response": ["Jones co-founded The Strand (named after a Roxy Music song) with Paul Cook and Wally Nightingale in the early 1970s but later changed its name to The Swankers. After dropping Wally Nightingale in August 1975, Jones went on to co-found Sex Pistols with Paul Cook, Glen Matlock, and John Lydon."]}, {"page": "Creation Records", "response": ["* Glen Matlock"]}, {"page": "Shane MacGowan", "response": ["*\"I Put a Spell on You\" (Haiti Charity Song) (with Nick Cave, Bobby Gillespie, Chrissie Hynde, Mick Jones with actor Johnny Depp, Glen Matlock, Paloma Faith and Eliza Doolittle) (2010)"]}, {"page": "God Save the Queen (Sex Pistols song)", "response": ["The single was released on 27 May 1977, and was regarded by many of the general public as an assault on Queen Elizabeth II and the monarchy. The song's title is taken directly from the national anthem of the United Kingdom of the same name. At the time, it was highly controversial for its equation of the queen with a \"fascist regime\" and for the lyric \"there is no future in England's dreaming\". According to Glen Matlock, who had co-written the song—although he was no longer a member of the band by the time it was released—the bass was inspired by The Move's \"Fire Brigade\". Guitarist Steve Jones stated that when Matlock first played him the song it did not sound like 'God Save The Queen': \"It was like 'Love Me Do' or something\".Archived at Ghostarchive and the Wayback Machine: ", "#\"God Save the Queen\" (Paul Cook, Steve Jones, John Lydon, Glen Matlock)", "Category:Songs written by Glen Matlock"]}, {"page": "The Great Rock 'n' Roll Swindle", "response": ["The footage was filmed in early to mid-1978, between the departure of singer John Lydon from the band and their subsequent split. The movie was finally released nearly two years later. Lydon (who was listed in the credits as \"The Collaborator\") and original bass guitarist Glen Matlock only appear in archive footage — Lydon refused to have anything to do with the production."]}]}}