{"wiki_id": "http://www.wikidata.org/entity/Q5131647", "itemLabel": "Cleo Sylvestre", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Cleo_Sylvestre", "wikipedia_page": {"main": "Cleo Sylvestre (born 19 April 1945) is an English actress in film, stage and television. She was the first black woman ever to play a leading role at the National Theatre in London.", "link_mentions": [{"page": "Crossroads (British TV series)", "response": ["The series also saw black characters appearing regularly - a follow-on from the 1960s BBC soap Compact, also created by Hazel Adair and Peter Ling. Melanie Harper (Cleo Sylvestre) arrived at the motel in 1970 as Meg's foster daughter (itself a taboo issue). Sylvestre was given the role by producer Reg Watson after press coverage of racial tensions in the Birmingham area at that time.http://www.crossroadsnetwork.co.uk/society/cleosylvestre.htm . In 1978, garage mechanic Joe MacDonald (Carl Andrews) arrived. The year before, an interracial summer romance took place between Cockney garage mechanic Dennis Harper (Guy Ward) and motel receptionist Meena Chaudri (Karen David)."]}, {"page": "Tube Tales", "response": ["Cast: (in alphabetical order) Ed Allen (Youth 2); Frank Harper (Station Guard); Morgan Jones (Youth 1); Alan Miller (Old Man); Cleo Sylvestre (Woman)."]}, {"page": "The Expert (TV series)", "response": ["| Vicky Hammond || Cleo Sylvestre || colspan=\"3\"| "]}, {"page": "1967 in the United Kingdom", "response": ["* 10 October – Simon Gray's first stage play, Wise Child, opened at the Wyndham's Theatre, London, with Alec Guinness, Gordon Jackson, Simon Ward and Cleo Sylvestre."]}, {"page": "Wise Child", "response": ["*Janice – Cleo Sylvestre"]}, {"page": "List of former Coronation Street characters", "response": ["|Cilla Christie || Cleo Sylvestre || 1966"]}, {"page": "List of Grange Hill characters", "response": ["| Cleo Sylvestre "]}, {"page": "I.D. (play)", "response": ["*Cleo Sylvestre as Helen Daniels, Daisy"]}, {"page": "The Alf Garnett Saga", "response": ["* Cleo Sylvestre ...  Conductress"]}, {"page": "The Smashing Bird I Used to Know", "response": ["* Cleo Sylvestre as Carlien"]}, {"page": "Juliet Ace", "response": ["In October, 2013, Ace was diagnosed with terminal cancer – her radio plays The Captain’s Wife and Skin had reflected on earlier bouts with the disease – and was given a fifty-fifty chance of surviving until Christmas that year. Nearly five years later, in May, 2018, she saw her play Moving the Goalposts performed at London's Southbank Centre as part of B(old]Moving the Goalposts at Southbank Centre's {B}old Festival, 2018 a season celebrating age and creativity.  At the festival she was even photographed dancing, holding on to her three-wheeled mobility aid, to the music of another featured artist, Cleo Sylvestre."]}, {"page": "List of Crossroads characters", "response": ["|Cleo Sylvestre"]}, {"page": "Rosemary Branch Theatre", "response": ["The Rosemary Branch Theatre is a pub theatre located in Islington, London. It has been operating for 35 years. It was originally known as the Rosemary Theatre in 1986. In late spring of 1986 the upstairs of the Rosemary Branch was converted into a theatre. The same space has always been used but the technical area was originally between the stage left entrance corridor and the central aisle just adjacent to the entrance.  The first production, starring Mark Heath and directed by James Marcus (from London's Burning and others) was \"Napoleon Noir\", describing the heroic feats of Toussaint L'Ouverture, who in the late 18th century fought to abolish slavery in Saint-Domingue. The next play was the well-received dark comedy \"Curtains\" by Tom Mallin. This had its premiere at the Edinburgh Festival in 1970 with Nigel Hawthorne as one of a couple made murderous by the introduction of a third party. Lastly, before the Theatre's initial season closed, Cavada Humphrey presented her autobiographical solo performance \"Walking Papers\"; a powerful and focused work. From 1996 to 2016 it was co-directed by Cleo Sylvestre. The building was previously a Victorian music hall."]}, {"page": "The Rough with the Smooth", "response": ["* Cleo Sylvestre as Rosalie"]}, {"page": "Allelujah!", "response": ["* Cora - Cleo Sylvestre"]}]}}