{"wiki_id": "http://www.wikidata.org/entity/Q5131427", "itemLabel": "Clement W. Payton", "itemDescription": "English World War I flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Clement_W._Payton", "wikipedia_page": {"main": "Lieutenant Clement Wattson Payton  (13 April 1897 – 2 October 1918) was an English World War I flying ace credited with 11 official victories.\n\n", "link_mentions": [{"page": "List of World War I aces credited with 11–14 victories", "response": ["| Clement W. Payton"]}, {"page": "Solomon Clifford Joseph", "response": ["He was first assigned to No. 12 Squadron RNAS, but was transferred to No. 10 Squadron RNAS in February 1918 as a Sopwith Camel pilot. He scored his first aerial victory on 7 May 1918, and continued to string out a dozen wins stretching through 3 September 1918; he teamed up to share victories with such fellow aces as Alfred Williams Carter and Clement W. Payton in several cases. On 10 August he was appointed a flight commander, with its accompanying temporary promotion to captain. On 21 September, he was awarded the Distinguished Flying Cross. Three days later, he was wounded in action. He recovered in time to round off his victory string with a final win on 30 October 1918. Three days later, he was granted a Bar to his DFC in lieu of a second award. In the final analysis, Joseph had destroyed five enemy aircraft by himself, shared in destroying two others, drove three down out of control, and teamed up to drive another one down out of combat. He also was a balloon buster, being one of three pilots responsible for destroying a German observation balloon."]}, {"page": "Payton (surname)", "response": ["*Clement W. Payton (1897–1918), English World War I flying ace"]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Clement W. Payton"]}, {"page": "Clement Wattson Payton", "response": ["#REDIRECT Clement W. Payton"]}, {"page": "Clement Payton", "response": ["#REDIRECT Clement W. Payton"]}]}}