{"wiki_id": "http://www.wikidata.org/entity/Q513883", "itemLabel": "Simon Scarrow", "itemDescription": "British fiction writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Scarrow", "wikipedia_page": {"main": "Simon Scarrow (born 3 October 1962) is a British author. Scarrow completed a master's degree at the University of East Anglia after working at the Inland Revenue, and then went into teaching as a lecturer, firstly at East Norfolk Sixth Form College, then at City College Norwich.\nHe is best known for his Eagles of the Empire series of Roman military fiction set in the territories of the Roman Empire, covering the second invasion of Britain and the subsequent prolonged campaign undertaken by the rump of the Julio-Claudian dynasty. As of December 2019, there are 18 books in the series; the latest, \"Traitors of Rome\", was published in 2019.He has also written another series, Revolution, focusing on Wellington and Napoleon, whose first title, Young Bloods, was published in 2006. The second volume, The Generals, was released on 31 May 2007 and the third volume Fire and Sword was released in January 2009. The fourth and final novel of the series was released in Jun 2010 and is called The Fields of Death. He began publishing a new series in 2011 titled Gladiator.", "link_mentions": [{"page": "October 3", "response": ["*  1962   – Simon Scarrow, Nigerian-English novelist"]}, {"page": "Vitellius", "response": ["The son of Lucius, Aulus Vitellius, played a minor part in Henryk Sienkiewicz's novel Quo Vadis, set at the end of Nero's reign. Although he survived as a character in the 1900 Broadway production,Broadway World and in the Italian films based on it of 1913 and 1924, he disappeared from later adaptations. But some later novels deal with incidents in the military career of this Vitellius. In Simon Scarrow's Eagles of the Empire series, he is introduced as a rival to Vespasian during the Roman invasion of Britain. And in later chapters of Henry Venmore-Rowland's novel The Last Caesar (2012) he figures as the newly appointed Governor of Lower Germania and something of a glutton."]}, {"page": "Napoleonic Wars", "response": ["* Simon Scarrow – Napoleonic series. Rise of Napoleon and Wellington from humble beginnings to history's most remarkable and notable leaders. Four books in the series."]}, {"page": "Caratacus", "response": ["*Caratacus appears in several volumes of Simon Scarrow's Eagle series, including Under the Eagle, The Eagle's Conquest, When the Eagle Hunts, The Eagle and the Wolves, The Eagle's Prey, Blood Crows and Brothers In Blood."]}, {"page": "Ofonius Tigellinus", "response": ["*Tigellinus appears in Simon Scarrow's 2011 novel Praetorian (taking place in 51 AD) as an optio (junior officer) of the Praetorian Guard; at the end of the novel, he is promoted to second-in-command to Prefect Burrus, and expects to succeed him after Nero ascends to the throne."]}, {"page": "Aulus Plautius", "response": ["Plautius is a character in Henryk Sienkiewicz's novel Quo Vadis, and in Simon Scarrow's novel The Eagle's Conquest."]}, {"page": "List of historical novels", "response": ["*Under the Eagle and others in the Cato series by Simon Scarrow (Roman invasion, AD 42)", "*Revolution series by Simon Scarrow (Wellington and Napoleon)"]}, {"page": "Matala, Crete", "response": ["*In Simon Scarrow's historical adventure novel, The Gladiator, the protagonists beach their damaged ship just outside Matala after it is damaged by a tsunami."]}, {"page": "Legio II Augusta", "response": ["*It is also the Legion in which Optio Quintus Licinius Cato and Centurion Lucius Cornelius Macro serve during the first five books of the Eagles of the Empire series by Simon Scarrow. The books also cover Vespasian's career as commander of the legion and the invasion of Britain."]}, {"page": "Gnaeus Domitius Corbulo", "response": ["* Two of Simon Scarrow's Eagles of the Empire series, The Blood of Rome (2018) and Traitors of Rome (2019) feature Corbulo's involvement in the East."]}, {"page": "Fiction set in ancient Rome", "response": ["* The Eagle series by Nigerian-born British novelist Simon Scarrow.  The first book Under the Eagle (part of the Eagle series) was published 2000 by Simon Scarrow.  Story of Roman invasion of Britain, featuring a young Vespasian. Other books in the series include The Eagle's Conquest (2001 set in 42 AD (introducing Boudicca at the end);  When the Eagle Hunts (2002) set in 44 AD.  Other books in the series include The Eagle and the Wolves (2003), The Eagle's Prey (2004), The Eagle's Prophecy (2005), The Eagle in the Sand (2006), and the forthcoming Centurion (January - 2008).", "* The Eagle series by Simon Scarrow (see above)"]}, {"page": "Claudia Acte", "response": ["Acte appears as a character in Henryk Sienkiewicz's novel Quo Vadis, and in Myself My Sepulchre (also titled Nero) by Mary Teresa Ronalds, and is depicted as being a secret Christian in both.  She also appears in the movie Nero, played by Rike Schmid. Acte is also the main character in Alexandre Dumas' novel Acte.  Acte appears also as a character in Louis de Wohl's novel, \"The Glorious Folly: A Novel of the days of St. Paul\". Acte's life and her relationship with Nero are also depicted in the novel \"The False Nero\" by Lion Feuchtwanger.  She is also a principal character in Simon Scarrow's 2020 novel: \"The Emperor's Exile\".  \"The Emperor's Exile\" (Eagles of the Empire XIX) Copyright © 2020 Simon Scarrow. Published by Headline Publishing Group. ISBN 978 1 4722 5844 1"]}, {"page": "Sharpe (novel series)", "response": ["Sharpe possibly appears in Simon Scarrow's The Fields of Death, although his surname is not confirmed.  A major in the 95th Rifles called Richard and who, \"unusually for an officer... carries a rifle like his men,\" delivers captured French orders to the Duke of Wellington indicating the enemy's intention to fall back to Vitoria."]}, {"page": "Cultural depictions of Napoleon", "response": ["*Napoleon is one of the two main characters in Simon Scarrow's The Revolution Quartet, which details Napoleon's life from his birth to his defeat at the Battle of Waterloo alongside that of Arthur Wellesley's."]}, {"page": "The Eagle's Conquest", "response": ["The Eagle's Conquest  is a 2001 novel by Simon Scarrow, about the Roman invasion of Britain in 43 AD.  It is the second book in the Eagles of the Empire series."]}, {"page": "UEA Creative Writing Course", "response": ["*Simon Scarrow (MA, 1992), author"]}, {"page": "Arena (disambiguation)", "response": ["* Arena, a 2013 novel by Simon Scarrow and T.J. Andrews"]}, {"page": "Tiberius Claudius Narcissus", "response": ["* Simon Scarrow's Eagles of the Empire series of historical novels. "]}, {"page": "Fort Saint Elmo", "response": ["* The fort plays a key role in the novel Sword and Scimitar by Simon Scarrow."]}, {"page": "Pomponia Graecina", "response": ["Pomponia is portrayed in When the Eagle Hunts, a novel of historical fiction from the Eagle Series by Simon Scarrow.  In the story, Pomponia and her two children are captured and held hostage by Druids resisting the Roman invasion of Britain, while a rescue is attempted by the series' two main characters."]}, {"page": "Simon Langton Grammar School for Boys", "response": ["In 2006, Simon Scarrow took up the newly formed position of writer in residence at SLBS, a position he said he was \"honoured to accept\". In 2011, the school became one of the first school sites to utilise the kinetic energy from the students' walking over pressure pads in a corridor with Pavegen systems technology that converts the energy from footsteps into electricity."]}, {"page": "Kent College", "response": ["* Simon Scarrow, historical fiction author"]}, {"page": "Under the Eagle", "response": ["Under the Eagle is the first book in the Eagles of the Empire series, by Simon Scarrow and is his debut novel, introducing the characters of Quintus Licinius Cato and Lucius Cornelius Macro.  It was published in 2000."]}, {"page": "Young Bloods (novel)", "response": ["Young Bloods is the first volume in Simon Scarrow's Wellington and Napoleon Quartet, which narrates mostly in alternate chapters, the story of a young Anglo-Irish nobleman Arthur Wellesley and the Corsican cadet Napoleone Buonaparte."]}, {"page": "British Empire in fiction", "response": ["* Young Bloods (2006) by Simon Scarrow narrates mostly in alternate chapters, the story of a young Anglo-Irish nobleman Arthur Wesley and the Corsican cadet Naboleone Buonaparte.", "* The Generals (2007) by Simon Scarrow sequel to Young Bloods."]}, {"page": "Second Battle of Porto", "response": ["The battle of Porto is depicted by Bernard Cornwell in Sharpe's Havoc, Simon Scarrow in Fire and Sword, Allan Mallinson in An Act of Courage, Iain Gale in Keane's Company and by Martin McDowell in the historical novel The Plains of Talavera."]}, {"page": "When the Eagle Hunts", "response": ["When the Eagle Hunts is a 2002 novel by Simon Scarrow, set in 44 AD during the Roman invasion of Britain.  It is the third book in the Eagles of the Empire series."]}, {"page": "The Generals (novel)", "response": ["The Generals is the second volume in Simon Scarrow's Wellington and Napoleon Quartet, which narrates mostly in alternate chapters, tells the story of  Sir Arthur Wellesley (the future Duke of Wellington) and the Corsican Brigadier Napoleon Bonaparte (the future Emperor of France)."]}, {"page": "Robyn Young", "response": ["Young was one of the founding members of the \"Historical Writers Association\". She also took part in the inaugural HWA festival, together with Simon Scarrow and Michael Morpurgo."]}, {"page": "Eagles of the Empire", "response": ["Eagles of the Empire is a series of historical military fiction novels written by Simon Scarrow. The series began in July 2000 with the publication of Under the Eagle, and as of January 2021 there have been 19 novels released in the series, with the 20th novel due in 2021."]}]}}