{"wiki_id": "http://www.wikidata.org/entity/Q5145016", "itemLabel": "Colin Cramphorn", "itemDescription": "British chief constable", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Cramphorn", "wikipedia_page": {"main": "Colin Ralph Cramphorn CBE, QPM, DL, FRSA (1 April 1956 – 30 November 2006) was the Chief Constable of West Yorkshire Police from September 2002 to November 2006.\nColin Cramphorn was educated at Strode's Grammar School, Egham, before joining the Surrey Constabulary in 1975. In September 1981 he went as a Bramshill scholar to the Faculty of Law (as it then was), King's College London, to study for the LL.B., and successfully graduated in June 1984. In 1995 he was appointed an Assistant Chief Constable with West Mercia Constabulary. \nIn 1998 he moved to the Royal Ulster Constabulary and he was briefly Acting Chief Constable of the RUC's successor, the Police Service of Northern Ireland, prior to the appointment of Sir Hugh Orde in May 2002. Cramphorn continued as Orde's deputy until September 2002, when he was appointed Chief Constable of West Yorkshire Police. \nColin Cramphorn died of prostate cancer in November 2006 at the age of 50.", "link_mentions": [{"page": "Police Service of Northern Ireland", "response": ["|Colin Cramphorn"]}, {"page": "Hugh Orde", "response": ["Hugh Orde was appointed Chief Constable of the PSNI (which replaced the Royal Ulster Constabulary) on 29 May 2002, taking over from Acting Chief Constable Colin Cramphorn. He was knighted for his services to policing in 2005."]}, {"page": "Murder of Sharon Beshenivsky", "response": ["On 18 August 2006, the rugby league club Bradford Bulls made a presentation on the pitch at their home stadium during the half-time interval of a match with Castleford Tigers, in Beshenivsky's honour. Her widower Paul, along with the Chief Constable of West Yorkshire Police Colin Cramphorn, were guests as Bradford Bulls chairman Peter Hood unveiled a memorial bench in her honour, which was to be placed in the club's reception area. On 8 May 2009 a memorial to Beshenivsky was unveiled at the location of her death. At the unveiling, Prime Minister Gordon Brown paid tribute to the officer's \"dedication, professionalism and courage\". Michael Winner, chairman of the Police Memorial Trust, also praised Beshenivsky and police officers across the country, saying: \"Take them away and there's total anarchy and we are devoured by the forces of evil.\""]}, {"page": "West Yorkshire Police", "response": ["On 12 December 2006, Sir Norman Bettison was announced as the new chief constable, replacing Colin Cramphorn and resigned from his post on 24 October 2012. He was replaced by Temporary Chief Constable John Parkinson until the appointment of Mark Gilmore as chief constable on 1 February 2013.", "* Colin Cramphorn (September 2002 to November 2006)"]}, {"page": "Deaths in November 2006", "response": ["*Colin Cramphorn, 50, British Chief Constable for West Yorkshire, prostate cancer."]}, {"page": "Strode's College", "response": ["*Colin Cramphorn, policeman "]}, {"page": "Dean Godson, Baron Godson", "response": ["In 2005, Godson edited Replacing the Routemaster: how to undo Ken Livingstone's destruction of London's best ever bus. The study, which featured contributions from Colin Cramphorn, Simon Jenkins, Andrew Gilligan and many others, was the first major critique of Ken Livingstone's policy of scrapping the Routemaster bus. The report heavily influenced Boris Johnson's subsequent 'New Routemaster' policy in the 2008 London Mayoral elections. and was attacked by outgoing Labour mayor Ken Livingstone in his memoirs.", "Godson founded the Colin Cramphorn Memorial Lecture, to celebrate the life of the late Chief Constable of West Yorkshire. The inaugural lecture was delivered by Peter Clarke, then head of the Metropolitan Police Counter Terrorism Command. In 2009, the lecture was delivered by Charles Farr, Director General of the Office of Security and Counter Terrorism in the Home Office. In September 2009, it was delivered by General David Petraeus, then Commander, United States Central Command.", "In 2011, Gen James N. Mattis, then head of CENTCOM, gave the sixth Colin Cramphorn Memorial Lecture."]}, {"page": "List of alumni of King's College London", "response": ["*Colin Cramphorn – Chief Constable of West Yorkshire Police"]}, {"page": "Salford Business School", "response": ["*Colin Cramphorn, former Chief Constable, West Yorkshire Police"]}]}}