{"wiki_id": "http://www.wikidata.org/entity/Q5145015", "itemLabel": "Colin Cramb", "itemDescription": "Scottish footballer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Cramb", "wikipedia_page": {"main": "Colin Cramb (born 23 June 1974 in Lanark) is a Scottish former professional footballer and coach who played as a forward from 1991 and 2009.\nHe notably played for Hamilton Academical, Doncaster Rovers, Bristol City and Stirling Albion. Cramb also had spells with Southampton, Falkirk, Hearts, Walsall, Crewe Alexandra, Notts County, Bury, Fortuna Sittard, Shrewsbury Town, Grimsby Town, Stenhousemuir and East Stirlingshire. Cramb is the only player to have played in all four divisions in both England and Scotland.", "link_mentions": [{"page": "Doncaster Rovers F.C.", "response": ["| 1996–97 ||  Colin Cramb ||"]}, {"page": "Shrewsbury Town F.C.", "response": ["Northwich Victoria manager Jimmy Quinn was appointed Shrewsbury manager in May 2003, with the aim of getting them promoted back to the Football League at the first attempt. With most of the previous year's players released, Quinn assembled a whole new squad, with experienced non-league players such as Darren Tinson and Jake Sedgemore being joined by Colin Cramb, Scott Howie and former League Cup finalist Martin O'Connor. The league title went to Chester City, but with 74 points, Shrewsbury finished third in the league and defeated Barnet in the playoff semi-finals to set up a playoff final against Aldershot Town, at the neutral venue of the Britannia Stadium, home of Stoke City. The two teams played out a 1–1 draw which went to a penalty shootout. Shrewsbury goalkeeper Scott Howie saved three consecutive Aldershot penalties and defender Trevor Challis scored the winning penalty."]}, {"page": "Stirling Albion F.C.", "response": ["Stirling Albion went into the play-offs after a run of four defeats against Stranraer, Brechin City, Ayr United and Peterhead. The Binos played Raith Rovers in the playoffs semifinals. The first game was at Starks Park, where the game finished with a goal less draw. In the second game of the tie the Binos defeated Raith Rovers at Forthbank with Chris Aitken scoring two goals and Colin Cramb scoring a third, to secure a play-off final tie with Airdrie United. In the first game of the play-off final the Binos had to come from 2 goals behind at half time, to go into the second game all square at 2 each. On Saturday 12 May 2007 the Binos travelled to Airdrie to play the final game of the season and play for promotion to Scottish Division One. The game was played in front of a shared support of 3,465 people. Stirling Albion secured the win with Robert Snodgrass two goals and Stewart Devine scoring the third goal to gain the Binos promotion from the Scottish Second Division to the Scottish First Division."]}, {"page": "Wishaw", "response": ["*Colin Cramb, footballer"]}, {"page": "Michael Reddy", "response": ["In July 2004 Reddy signed for Grimsby Town as one of the first new signings under the newly installed manager Russell Slade. He was a huge signing for the cash strapped and relegation hit club, as well as the addition of winger Andy Parkinson who had joined the club a few days previously. Reddy's first season was somewhat disappointing as the player was still recovering from a medial ligament injury and struggled to regain full fitness. Despite this Reddy was utilised as Town's favoured striker, mainly playing alongside Martin Gritton, Matt Harrold or Colin Cramb throughout this season. Notably though he did finish the season on a high scoring a hat trick against already doomed Kidderminster Harriers. He managed 9 goals throughout the season which was seen as a slightly disappointing season for all at the club, having seen the club finish in a lowly 18th place."]}, {"page": "Derek Asamoah", "response": ["On 2 April 2009, it was confirmed that he had a trial at Scottish side Hamilton Academical becoming the third Shrewsbury Town player to feature on their books after Colin Cramb and cult hero Victor Kasule. Asamoah made his debut for the Scottish side against Celtic, in a 6–0 thumping. At the end of the season Asamoah decided change would be best for him and left Hamilton for Bulgaria.Asamoah makes Accies move"]}, {"page": "Lee Bell", "response": ["In January 2001 he had a training ground bust-up with Colin Cramb, who subsequently left Gresty Road and indeed the country. Despite this, Bell was awarded a professional contract in February 2001. He made his debut for the first team, coming on as a substitute on the opening day of the 2002–03 season against Northampton Town. A week later to his debut, Bell scored his first professional goal, in a 2–0 win over Colchester United. His playing time at Crewe soon earned him a new contract in February 2003. He made 22 appearances in the 2002–03 promotion campaign, mostly as a substitute."]}, {"page": "List of Grimsby Town F.C. players", "response": ["|align=\"left\"|Colin Cramb||||FW||2004–2005||11||2"]}, {"page": "Clint Marcelle", "response": ["In a reward for his consistency in the previous season, Slade contacted Marcelle again and was invited for a pre-season trial with his new club Grimsby Town. Following a trial month, in which Marcelle never really got a look in, in any of the teams friendly games, he was still offered a short-term deal and joined Ashley Sestanovich and Glen Downey as one of three players taken to Blundell Park from his former club. Grimsby was to be his first professional football club in two years. Despite being offered a contract, Marcelle found it extremely hard to break into the team and was often looked past in favour for Michael Reddy, Andy Parkinson and Darren Mansaram, and would often find it very difficult on winning a place on the substitute bench. Marcelle made his only start for the Mariners against Carlisle United in the Football League Trophy, and following only four other sub appearances, Marcelle would not play again for Grimsby. Slade decided to bring in two more strikers in Martin Gritton and Colin Cramb, and that coupled with loan signings such as Jon Daly and Chris Williams, Marcelle was eventually released by Grimsby on 31 October 2004."]}, {"page": "2006–07 Scottish Second Division", "response": ["| Colin Cramb || style=\"text-align:center;\"|14 || Stirling Albion"]}, {"page": "2004 Football Conference play-off Final", "response": ["|FW ||10||Colin Cramb || || "]}, {"page": "2005–06 Scottish Third Division", "response": ["|style=\"text-align:left;\"| Colin Cramb"]}, {"page": "1996–97 Football League", "response": ["|4||align=left|  Colin Cramb ||align=left| Doncaster Rovers ||18"]}, {"page": "2004–05 Grimsby Town F.C. season", "response": ["|29 ||  Colin Cramb || Hamilton Academical || 30 || Free Transfer"]}, {"page": "List of Hamilton Academical F.C. players", "response": ["|Colin Cramb||||1991–1993, 2005||58||12||"]}, {"page": "1993–94 Southampton F.C. season", "response": ["|Colin Cramb", "| Colin Cramb"]}]}}