{"wiki_id": "http://www.wikidata.org/entity/Q5145413", "itemLabel": "Colin Middleton", "itemDescription": "British artist (1910-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Middleton", "wikipedia_page": {"main": "Colin Middleton MBE, ARHA, HRUA  (29 January 1910 – 23 December 1983) was an Irish artist and surrealist.", "link_mentions": [{"page": "1983", "response": ["* December 23 – Colin Middleton, Northern Irish artist (b. 1910)"]}, {"page": "County Down", "response": ["* Colin Middleton, Irish artist and surrealist, lived in Bangor"]}, {"page": "List of Irish artists", "response": ["*Colin Middleton (1910–1983)"]}, {"page": "1983 in Ireland", "response": ["* 23 December – Colin Middleton, artist (born 1910)."]}, {"page": "1938 in Ireland", "response": ["* Colin Middleton first exhibits at the Royal Hibernian Academy."]}, {"page": "1910 in Ireland", "response": ["* 29 January – Colin Middleton, artist (died 1983)."]}, {"page": "Irish art", "response": ["In Northern Ireland notable artists have included John Luke, Colin Middleton, William Scott, Neil Shawcross, Gladys Maccabe (artist), Basil Blackshaw and Frank McKelvey."]}, {"page": "Markey Robinson", "response": ["Robinson entered two works to the Civil Defence Art Exhibition in 1943. Bomb Crater in Eglington Street and Fire at the International were accepted from the 1,300 works submitted to the juried exhibition and went on display at Belfast Museum and Art Gallery. They were later amongst twelve works including Romeo Toogood's Gleno and James McCord's McAdam's Farm, forwarded to London for inclusion in the Civil Defence Exhibition on Bond Street that summer. The Council for the Encouragement of Music and the Arts sponsored a group exhibition in the textile business of William Ewart & Sons on Bedford Street in Belfast in 1944 when Robinson showed alongside Colin Middleton, Sidney Smith, George Campbell and Gerard Dillon."]}, {"page": "1983 in art", "response": ["* 23 December – Colin Middleton, Irish artist (b.1910)."]}, {"page": "Basil Blackshaw", "response": ["Blackshaw held a joint exhibition with Martin MacKeown at the Council for Encouragement of Music and the Art's Donegall Place gallery in 1952. In the following year three of Blackshaw's paintings were accepted for show at the Young Contemporaries Exhibition in London. Blackshaw's work was also shown at the inaugural show of the Association of Past Pupils and Staff at the Belfast College of Art in 1954 alongside T P Flanagan, Colin Middleton and Violet McAdoo."]}, {"page": "1910 in art", "response": ["* January 29 – Colin Middleton, Irish artist (d. 1983)."]}, {"page": "List of artists from Northern Ireland", "response": ["*Colin MiddletonSnoddy, 2002 pp.421-424 (1910–1983)"]}, {"page": "Jim Manley (artist)", "response": ["*the late Colin Middleton"]}, {"page": "1983 in the United Kingdom", "response": ["* 23 December – Colin Middleton, artist (born 1910)"]}, {"page": "John Hewitt (poet)", "response": ["*Colin Middleton (Arts Council/An Chomhairle Ealaíon and the Arts Council of Northern Ireland, 1976)"]}, {"page": "1983 in Northern Ireland", "response": ["*23 December - Colin Middleton, artist (born 1910)."]}, {"page": "1910 in the United Kingdom", "response": ["* 29 January – Colin Middleton, artist (died 1983)"]}, {"page": "Neil Shawcross", "response": ["Neil Shawcross , RHA, HRUA(born 15 March 1940) is an artist born in Kearsley, Lancashire, England, and resident in Northern Ireland since 1962. Primarily a portrait painter, his subjects have included Nobel prize winning poet Seamus Heaney, novelist Francis Stuart (for the Ulster Museum), former Lord Mayor of Belfast David Cook (for Belfast City Council), footballer Derek Dougan and fellow artists Colin Middleton and Terry Frost. He also paints the figure and still life, taking a self-consciously childlike approach to composition and colour.http://jameswray.ie/artist/neil-shawcross/  His work also includes printmaking, and he has designed stained glass for the Ulster Museum and St. Colman's Church, Lambeg, County Antrim. He lives in Hillsborough, County Down."]}, {"page": "December 23", "response": ["*1983 – Colin Middleton, Irish painter and illustrator (b. 1910)"]}, {"page": "Middleton (name)", "response": ["*Colin Middleton (1910–1983), Irish artist and surrealist"]}, {"page": "John Luke (artist)", "response": ["He excelled at the college under the tutelage of Seamus Stoupe and Newton Penpraze. His contemporaries included Romeo Toogood, Harry Cooke Knox, George MacCann, and Colin Middleton. In 1927 he won the coveted Dunville Scholarship which enabled him to attend the Slade School of Art in London, where he studied painting and sculpture under the celebrated Henry Tonks, who greatly influenced his development as a draughtsman."]}, {"page": "Ulster History Circle", "response": ["*Colin Middleton, artist"]}, {"page": "List of Ulster University people", "response": ["*Colin Middleton MBE (1910–1983), artist and surrealist*"]}, {"page": "Gladys Maccabe", "response": ["In 1945 Maccabe and her husband Max joined the Campbell brothers Arthur and George, the Henry sisters, Olive and Margaret, Colin Middleton, Tom Carr, Maurice Wilks, James McIntyre and others, in the only official exhibition from the Ulster branch of the Artists' International Association sponsored by the Council for the Encouragement of Music and the Arts (NI) at the Belfast Museum."]}, {"page": "List of painters by name beginning with \"M\"", "response": ["*Colin Middleton (1910–1983), Irish artist"]}, {"page": "1968 Birthday Honours", "response": ["* Colin Middleton, Artist."]}, {"page": "Mercy Hunter", "response": ["In 1965 Hunter joined twelve Ulster artists including Alice Berger Hammerschlag, Basil Blackshaw, Colin Middleton, Romeo Toogood, and Olive Henry in an exhibition of diverse landscape paintings at the Arts Council Of Northern Ireland Gallery. Hunter donated a picture to an exhibition to raise funds for victims of civil disturbances in Belfast  in the autumn of 1969. The exhibition at Queen's University was organised by Sheelagh Flanagan and showed the of work T P Flanagan, William Scott and F E McWilliam, Deborah Brown, Cherith McKinstry, and Carolyn Mulholland as well as more than twenty others."]}, {"page": "Alicia Boyle", "response": ["Boyle began exhibiting at the Leicester Galleries in London in 1944. She was to show annually in their Artists of Fame and Promise exhibition for more than a quarter of a century. Boyle held her first solo exhibition in the Peter Jones Gallery in London in 1945, which afforded her the luxury of reducing her teaching hours. As the decade drew to a close Boyle became inspired by her native land after visits to Donegal and Connemara when she began to portray Irish subjects and scenes. A second masterpiece of this era, White Horse was inspired by a chance meeting with locals near Claidhneach, Connemara in 1949. The Council For the Encouragement for Music and the Arts (CEMA) purchased the painting in 1950, and displayed in an exhibition of CEMA purchases at their 55a Donegall Place gallery in 1954. The 24 picture collection consisted of work from Romeo Toogood, Colin Middleton and Sidney Smith amongst others."]}, {"page": "Olive Henry", "response": ["In 1937 Henry was elected an Associate of the Ulster Academy of Arts. In 1938 Henry presented three watercolours to the Ulster Academy of Arts. Commenting on Henry's watercolours the Northern Whig's journalist writes:\"Miss Henry in especial has a rare command of her medium and an ability to make it expressive in a way that is different from the water-colour exhibitionists at the Academy. She has two very Breton studies -one Breton Departure Piece (No.165) is conceived plainly as decoration, while the other Sea Mill (No.190) has an emotional as well as decorative appeal and both are characterised by firmness of drawing and a lovely sense of colour.\"The exhibition was opened by Oliver St. John Gogarty with participants such as John Luke, Maurice Wilks, James Humbert Craig, Rosamund Praeger and Colin Middleton who showed three Surrealist works including Angelus.", "In 1945 Henry and her sister Margaret joined the Campbell brothers Arthur and George, Colin Middleton, Gladys and Max Maccabe, Tom Carr, Maurice Wilks, James McIntyre and others, in the only official exhibition from the Ulster branch of the Artists' International Association sponsored by the Council for the Encouragement of Music and the Arts (NI) at the Belfast Museum.", "In 1965 Henry joined twelve Ulster artists including Alice Berger-Hammerschlag, Basil Blackshaw, Colin Middleton, Romeo Toogood, and Mercy Hunter in a diverse exhibition of landscape paintings at the Arts Council Of Northern Ireland Gallery. In the same year Henry completed a commission from the Sullivan Association of Former Pupils to design a window for Sullivan Upper School in Holywood, County Down."]}, {"page": "T.P. Flanagan", "response": ["In 1960 Flanagan was appointed one of seven trustees of the newly formed Lyric Players Trust including Deborah Brown and John Hewitt, a position he was to hold for five years. That same year he displayed his work at the new CEMA Gallery. An invited artist, he showed alongside several others including Colin Middleton, Deborah Brown, Gerard Dillon and William Conor, at the inaugural exhibition in the gallery designed by the architect Robert McKinstry. In 1961 Flanagan was patronised with a one-man show at CEMA's Chicester Street Gallery of which the Belfast Telegraph's Kenneth Jamison writes,\"Light is the artist's theme, its flux rain-filtered over moist fields, spilling an irregular pattern on low lough-side hills, mirrored again from the still lough's face...Always one is conscious of the infinite subtle modulations of light and colour. He does not refine forms. Rather he simplifies in terms of light and paint to reveal the sheer mood and poetry of the experience;  but there is nothing casual about the structure of his pictures.\"Flanagan produced the set for the Lyric's production of JM Synge's Deirdre of the Sorrows in 1963. Flanagan had a one-man exhibition at the Richie Hendricks Gallery in Dublin and showed two works at the Irish Exhibition of Living Art's twenty-fifth anniversary show in 1964. He showed in the Four Ulster Painters exhibition at the Arnolfini Gallery in Bristol in 1964.", "Deborah Brown invited Flanagan on to the committee to oversee an arts bursary scheme set-up in memory of patron of the arts, Alice Berger-Hammerschlag in 1970 which aided many younger artists to travel and to purchase equipment and materials. The Arts Council of Northern Ireland's gallery was the venue for Flanagan's 1966 solo exhibition. In 1968 Flanagan's work travelled to John Hewitt's Herbert Art Gallery for a joint show where he exhibited with Colin Middleton. Flanagan donated a picture to an exhibition to raise funds for victims of civil disturbances in Belfast in the autumn of 1969. The exhibition at Queen's University was organised by his wife, and showed work from thirty artists, including Deborah Brown, Cherith McKinstry, William Scott and F E McWilliam."]}, {"page": "Dennis H. Osborne", "response": ["Osborne had a parallel career as an art teacher. He began teaching leisure classes in Dungloe, in the Rosses, County Donegal in 1951. In Donegal Dennis and Jean found accommodation in the gate lodge of Glenveagh Castle which was owned by American art collector and millionaire Henry Plumer McIlhenny. In Ontario Osborne delivered art classes at St. Catharine's Collegiate and Smithville High School, in addition to portraits and landscapes at Lakehead Area Art Association. Osborne and his family returned to Northern Ireland in 1959. His first employ was as Head of the Art Department at Portadown Technical College. In 1962 Osborne settled in Lisburn, County Antrim. The Osbornes bought a property in the town when Dennis became Head of Art and Design at Lisnagarvey Boys County Secondary School where he continued to teach until his retirement in 1983. The Osbornes moved into a house adjacent to established artist and fellow pedagogue Colin Middleton where they became friends. Osborne was later to show a portrait of Middleton at the RUA in 1965. Osborne continued to exhibit frequently throughout the 1960s when he held solo shows at the Council for the Encouragement of Music and Art (CEMA) gallery in 1962 and another at the Arts Council of Northern Ireland (ACNI) gallery in 1968.", "Osborne cemented his place in the local arts community by exhibiting in the First Open Painting Exhibition at the Ulster Museum in 1962, and at the New Gallery Painters Exhibition in 1963 alongside Colin Middleton, Jean Osborne, Tom Carr and TP Flanagan. His works were shown in Dublin with the Irish Exhibition of Living Art of 1963, 1964 and 1965. He also began a fifty-year association with the Royal Ulster Academy who elected him an Associate Member in 1965 at the same time as Gladys MacCabe, James MacIntyre and George MacCann."]}, {"page": "Jean Osborne", "response": ["The Osborne's new residence was in Portadown, County Armagh, where Dennis had secured a teaching position at Portadown Technical College. When Dennis was appointed as Head of Art at Lisnagarvey High School in 1962 the couple purchased a house in Lisburn, next door to the artist and teacher Colin Middleton. The two families became closely acquainted. The Osbornes exhibited alongside Middleton at New Gallery Painters Exhibition in 1963, with further works from TP Flanagan, Crawford Mitchell, Thomas Carr, Cherith McKinstry, David Crone, and Wilfred Stewart."]}, {"page": "Crawford Mitchell", "response": ["Mitchell was one of the original members of the Ulster Unit and showed 5 etchings in their inaugural exhibition at Locksley House, Belfast in December 1934. His contemporaries at the Ulster Unit included John Hewitt, Colin Middleton, John Luke, John Hunter, George MacCann and Kathleen Bridle. Mitchell's works in the exhibition were described by one critic as \"each soundly competent\" whilst another describes his Wayward Tree as \"promising for this young artist\".", "In 1963 Mitchell showed alongside Colin Middleton, Dennis Osborne, Jean Osborne, TP Flanagan, Tom Carr, Cherith McKinstry, Wilfred Stewart, and David Crone in the Arts Council of Northern Ireland's New Gallery Painters Exhibition."]}, {"page": "George Galway MacCann", "response": ["In 1934 MacCann became a member of the ground-breaking Ulster Unit, a close relation of Paul Nash's Unit One, along with John Luke, Colin Middleton, Mercy Hunter, Romeo Toogood, and Crawford Mitchell amongst others, which had evolved from the short-lived Ulster Society of Painters. The group exhibited on just one occasion, at Locksley Hall, Belfast in December 1934. Middleton and MacCann commanded their own section where they displayed the most abstract paintings on show.", "The critics were still talking of the 1934 exhibition when the artists were re-united for an exhibition in aid of the Youth Hostel Association, with the reviewer in the Northern Whig remarking, \"Not since Colin Middleton, Edward Mansfield, George MacCann, Romeo Toogood and other young artists held their first exhibition in Belfast has there been so stimulating a show as that which Lady Cushendun opened yesterday in John Magee's Gallery, Donegall Square West.\"MacCann exhibited several experimental works at the exhibition, including The Sleeper which the critic calls \"rather immature in concept\", and the head of Mercy Hunter previously shown at Locksley House in 1933."]}, {"page": "Romeo Toogood", "response": ["In 1933 Toogood joined the newly formed Northern Ireland Guild of Artists inaugural exhibition at the State Buildings on Arthur Street, Belfast. Exhibiting alongside old stalwarts William Conor, John Hunter, Morris Harding and Edward Mansfield, as well as the younger generation such as Colin Middleton, Kathleen Bridle and the sculptor Betty Clements. Toogood showed a painting of Larne and three lino-cuts of which the critic in the Northern Whig stated that they \"all have a vitality and purposefulness that are individual.\"", "He presented three paintings with the Ulster Academy of Arts, the successor to the Belfast Art Society, in 1934, Islandmagee, Dungannon, and The Backyard, at the Old Museum Arts Centre. Of greater significance that year was when Toogood became a member of the avant-garde Ulster Unit, a close relation of Paul Nash's Unit One. The group had evolved from the short-lived Ulster Society of Painters and included artists such as John Luke, Colin Middleton, Mercy Hunter, George MacCann and Crawford Mitchell. They showed together on just one occasion at Locksley Hall, Belfast in December 1934. SB Kennedy of the Ulster Museum listed Toogood as one of the most influential artists in the exhibition. Toogood displayed two oils, one of which, The Backyard, was also shown at the Old Museum in the same month.Kennedy, (1991), p.257 The second was an interior of a theatre, simply entitled Theatre. In the catalogue Toogood set-out his artistic philosophy:", "\"The painter's aim, I think, is to find in nature some sense of formal order, and to translate the same in terms of form and colour into a pattern which relates to the size and shape of his canvas, the degree of abstraction used depending on the individual painter.\"Snoddy, (2002), p.658The Academy elected Toogood an associate in 1935, inaugurated with Kathleen Bridle, Colin Middleton, Helen Brett, Patrick Marrinan, Maurice Wilks and William St. John Glenn.  In the same year Toogood's 1933 oil, Dan Nancy's, Cushendun was displayed in an exhibition at the Mansion House in Dublin by the Haverty Trust, before becoming one of ten works donated to the Belfast Museum and Art Gallery. In 1936 Toogood showed two paintings at the Royal Hibernian Academy, his only showing with the society. He was also elected a member of ruling council at the Ulster Academy of Arts in 1936, and again in 1944. The critics were still talking of the 1934 exhibition of four years earlier, when the participants were re-united for a show in aid of the Youth Hostel Association, where the reviewer in the Northern Whig remarked,\"Not since Colin Middleton, Edward Mansfield, George MacCann, Romeo Toogood, and other young artists held their first exhibition in Belfast has there been so stimulating a show as that which Lady Cushendun opened yesterday in John Magee's Gallery, Donegall Square West.\"Toogood displayed a painting of Glencoe which the same reviewer refers to as \"one [of] the most interesting in the exhibition, mainly because of its colouring and its naiveté.\"", "In the year following his retirement in 1964, Toogood exhibited thirty-four watercolours and nine oils at the Magee Gallery in Belfast. All but one were landscapes. He had exhibited there once before in a group show of 1949. Toogood returned to the Magee Gallery in July 1964 with contributions to the Summer Exhibition, alongside Frank McKelvey, Dennis Osborne, Colin Middleton and William Conor."]}, {"page": "Sheelagh Flanagan", "response": ["Flanagan established the Shambles Gallery in Hillsborough, County Down, in 1971. Her husband, Patric Stevenson, who at the time was President of the Royal Ulster Academy, and the Lisburn industrialist Robert Wilson served as directors. The inaugural exhibition showed the works of F E McWilliam, William Scott, George Campbell, Gerard Dillon, Norah McGuinness and Colin Middleton amongst a dozen artists. Flanagan became a promoter of her husband's work, in addition to acting as an agent for other Ulster artists including F E McWilliam. The gallery was closed in 1973 due to civil unrest and reopened in 1985. F E McWilliam showed a bronze of Sheelagh Flanagan at the Royal Ulster Academy of Arts annual exhibition of 1978."]}, {"page": "Violet McAdoo", "response": ["McAdoo was one of fourteen artists' work including pictures by Colin Middleton, Romeo Toogood and Kathleen Bridle purchased by the Council for the Encouragement of Music and the Arts in 1946. McAdoo's work was also shown at the inaugural show of the Association of Past Pupils and Staff at the Belfast College of Art in 1954 alongside T P Flanagan, Colin Middleton and Basil Blackshaw."]}, {"page": "Renée Bickerstaff", "response": ["Bickerstaff showed an interior of St James' Church on the Antrim Road at the Ulster Academy of Art's Spring Exhibition of 1942, a subject she had previously captured in 1934. The church had been destroyed in the Belfast Blitz of the previous year. At the same exhibition Bickerstaff displayed The Baptistry, St Peters, Belfast which was shown at the Ulster Academy of Arts Annual Exhibition later that year. When St Peter's Church celebrated their fiftieth anniversary in 1950, Bickerstaff's watercolour was displayed in the church hall, alongside depictions of the church by other leading Ulster artists including Colin Middleton and William St John Glenn."]}]}}