{"wiki_id": "http://www.wikidata.org/entity/Q5144896", "itemLabel": "Colin Blumenau", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Blumenau", "wikipedia_page": {"main": "Colin Blumenau (born London, 7 August 1956) is a British writer and theatre director. He is the son of Tom Blumenau OBE and Eva Blumenau, both founder members of Amnesty International. He is the Artistic Director of The Production Exchange.\nDuring his early career as an actor he came to public notice playing Francis \"Taffy\" Edwards in The Bill between 1984 and 1990. After leaving the programme having appeared in more than 150 episodes he turned his hand to theatre management. He was variously Artistic Director of The Angles Theatre in Wisbech [1991-1993] and The Brewhouse Theatre & Arts Centre in Taunton [1993-1996].\nHe was Artistic Director of the Theatre Royal, Bury St Edmunds between 1996 and 2012 and spearheaded its restoration project. During this period, under the banner of Restoring the Repertoire, he also led the Theatre Royal's initiative to rediscover and restore the much neglected English Drama repertoire of the 18th and early 19th centuries to the stage. Productions included Black-Eyed Susan by Douglas Jerrold, Wives as they Were and Maids as they Are by Elizabeth Inchbald, The London Merchant by George Lillo and the world premiere of Inchbald's The Massacre two centuries after it was written. In addition there were public readings of some seventy five plays by authors as  diverse as Hannah Cowley and John le Planché,\nSince 2012 he has resumed a freelance career as well as being the Artistic Director of The Production Exchange a theatre production charity whose objective is to provide support, mentoring and opportunities for early-career practitioners in Theatre and Dance. The current Chair is Angela Smith, Baroness Smith of Basildon.\nUnder the pseudonym of Daniel O'Brien he is a prolific writer of work for the stage and his pantomime scripts are performed annually in a number of theatres notably at The Riverfront Arts Centre in Newport, Wales and the Theatre Royal, Wakefield.\nIn 2020, Blumenau shared his memories of working on the first three series of The Bill for the book Witness Statements. He has also recorded two Video Commentaries for The Bill Podcast Patreon Channel, where he was also reunited with eight of his Sun Hill co-stars for a three-part Zoom reunion.\nIn 2021, Blumenau returned to television acting, guest-starring in an episode of EastEnders.\nHe is married to Casting Director Debbie O'Brien and has three sons Dan, who works for Disney in Paris, academic Jack and Casting Director Harry.", "link_mentions": [{"page": "Blumenau (disambiguation)", "response": ["* Colin Blumenau (born 1956), British writer and theatre director"]}, {"page": "Ashwell, Hertfordshire", "response": ["*Colin Blumenau, actor, lived in the village"]}, {"page": "Woodentop (The Bill)", "response": ["\"Woodentop\" has an unusual place in the history of The Bill due to the original premise of this being a one-off play. After broadcast, Thames commissioned a full series to be shown the following year, under the name The Bill as the show had the potential to appeal to a mass audience. Although The Bill is clearly a continuation from this episode, the main series contradicts it in a number of ways. For instance, in Woodentop Litten has completed his secondment to CID and is close to securing his place in the detective branch, whereas in The Bill he does not gain his CID secondment until halfway through Series One. In addition many central characters in \"Woodentop\" - such as Sergeant Wilding and Inspector Deeping - vanish between the pilot and the series.  Deeping does gain one mention in Series One, in the episode \"It's Not Such a Bad Job After All\", where Ackland is informed that he is coming to meet her on the scene of a suicide - a later radio transmission, however, reports that Sgt. Bob Cryer is to meet her instead.  Although Wilding is not mentioned following Woodentop, he shares several characteristics with Sgt. Cryer - including a position as the \"father figure\" of the Sun Hill relief, and an apparently tumultuous relationship with Roy Galloway, whom both Cryer and Wilding refer to as a \"bloody superstar\".  In the first episode of Series One, \"Funny Ol' Business - Cops and Robbers\", Galloway and Cryer make apparent reference to the events of Woodentop in regards to Jim Carver.  Galloway suggests that it is Cryer who requested the favour, further suggesting that Cryer and Wilding are in fact the one character, and that, like PC Taffy Morgan (later Taffy Edwards), Jack Wilding's name has merely been changed to Bob Cryer. There are also discrepancies with the naming of some of the characters. In the 2003 live episode of The Bill, made to celebrate the twentieth anniversary of broadcast, Carver and Ackland discuss events from the pilot, whereupon Carver incorrectly refers to the character of Taffy by the surname Morgan, a name that was dropped for the series proper in favour of \"Edwards\". There are also mistakes made in some of the uniforms the cast wore during the episode, for example, in one scene, PC Dave Litten is on foot patrol with PC Jim Carver, and PC Litten's helmet has GR on the helmet badge where it should have had ER, the same that was on PC Carver's helmet. Also the tunics the male officers wore had buttoned down epaulettes, whereas they should have just had the insignia placed on the shoulder of the tunic as this is what the Metropolitan Police wore at the time.  Only four of the cast of \"Woodentop\" would go on to be regulars in the main series of The Bill: Mark Wingett, Trudie Goodwin, Gary Olsen and Colin Blumenau, while a number of characters were re-cast, including Roy Galloway.Colin Blumenau", "* PC \"Taffy\" Morgan - Colin Blumenau"]}, {"page": "List of Old Carthusians", "response": ["*Colin Blumenau (born 1956), theatre director"]}, {"page": "Jack Blumenau", "response": ["Blumenau was born to casting director Debbie O'Brien, and director/actor Colin Blumenau, so it was natural for him to follow an acting career. He began acting at age 12. He spent his early youth in Ashwell, Hertfordshire, attending Ashwell JMI until 1998, and The Highfield School in Letchworth from 1998 to 2008."]}, {"page": "List of The Bill characters", "response": ["The largest proportion of the cast play uniformed police constables. Gary Olsen appeared as Dave Litten in \"Woodentop\", the series pilot, as well as the entire first series, before returning as a guest star in 1986. He was the actor who appeared in the fewest episodes as a series regular. Colin Blumenau also appears in the pilot episode, as Taffy Edwards, though his character was then called Taffy Morgan. Jeff Stewart, as Reg Hollis, appeared in 1,021 episodes between 1984 and 2008, while Graham Cole appeared as Tony Stamp in 1,204 episodes between 1984 and 2009 . Hollis and Stamp are the series' longest-serving characters, though Stamp did not become a regular member of the cast until series 4. The series finale, \"Respect,\" features five PCs: Micah Balfour as Benjamin Gayle, Dominic Power as Leon Taylor, John Bowler as Roger Valentine, Rhea Bailey as Mel Ryder and Sarah Manners as Kirsty Knight. Ben Richards starred in Series 26 as Nate Roberts, but did not appear in \"Respect\". ", "| Francis \"Taffy\" Edwards || Colin Blumenau || 1983-1990 || style=\"text-align:center;\"|111 || P.C."]}, {"page": "Evacuation (The Bill)", "response": ["* PC Francis 'Taffy' Edwards – Colin Blumenau"]}, {"page": "The Bill (series 5)", "response": ["A number of The Bill Video/Audio Commentaries for Series 5 episodes have been recorded with cast and crew, including actors Colin Blumenau (P.C. Taffy Edwards), Larry Dann (Sgt. Alec Peters), Trudie Goodwin (W.P.C. June Ackland), Robert Hudson (P.C. Yorkie Smith), Chris Humphreys (P.C. Richard Turnham), Jon Iles (D.C. Mike Dashwood), Andrew Mackintosh (D.S. Alastair Greig) Nick Reding (P.C. Pete Ramsey) and Barbara Thorn (Insp. Christine Frazer), writers Garry Lyons, Christopher Russell and J.C. Wilsher, directors Niall Leonard and Jan Sargent."]}, {"page": "The Bill (series 3)", "response": ["Many of the cast and crew shared their memories of making this third series for the book Witness Statements, including stars John Salthouse, Eric Richard, Trudie Goodwin, Mark Wingett, Peter Ellis, Nula Conwell, Jon Iles, Larry Dann, Colin Blumenau, Robert Hudson, Mark Powley, Sonesh Sira and Graham Cole; along with writers Barry Appleton, Lionel Goldstein, Edwin Pearce and Christopher Russell, producer Peter Cregeen and director Michael Ferguson.  "]}, {"page": "The Bill (series 2)", "response": ["Many of the cast and crew shared their memories of making this second series for the book Witness Statements, including stars John Salthouse, Eric Richard, Trudie Goodwin, Mark Wingett, Peter Ellis, Nula Conwell, Jon Iles, Larry Dann, Colin Blumenau, Robert Hudson, Ashley Gunstock and Ralph Brown; along with writers Barry Appleton, Lionel Goldstein, Ginnie Hole and Christopher Russell, producer Peter Cregeen and directors Michael Ferguson and John Woods.  "]}, {"page": "The Bill (series 1)", "response": ["Many of the cast and crew shared their memories of making this first series for the book Witness Statements, including stars John Salthouse, Eric Richard, Trudie Goodwin, Mark Wingett, Peter Ellis, Nula Conwell, Jon Iles, Larry Dann, Colin Blumenau, Robert Hudson and Ashley Gunstock; along with costume designer Jennie Tate, stage managers Nigel Wilson and Marilyn Edwards, floor manager Julian Meers, production manager Derek Cotty, designer Philip Blowers, writer & technical advisor Barry Appleton and director Peter Cregeen. ", "PC Morgan's name was changed to PC Edwards, although still played by Colin Blumenau.", "* PC Taffy Edwards - Colin Blumenau"]}]}}