{"wiki_id": "http://www.wikidata.org/entity/Q5144864", "itemLabel": "Colin Barlow", "itemDescription": "English footballer (1935-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Barlow", "wikipedia_page": {"main": "Colin James Barlow (14 November 1935 – 19 December 2018) was an English professional footballer who played as a Winger for Manchester City, Oldham Athletic and Doncaster Rovers.", "link_mentions": [{"page": "Collyhurst", "response": ["* Colin Barlow, Manchester City footballer"]}, {"page": "List of Manchester City F.C. players", "response": ["|align=\"left\"|Colin Barlow||  || Winger || 1957–1963||189||80|| ||"]}, {"page": "Glyn Pardoe", "response": ["Pardoe was raised in the Cheshire town of Winsford, where his father worked for a tailor. In his youth he played for Mid-Cheshire Boys, and received approaches from both Everton and Manchester City.Schindler, George Best and 21 Others, p90 He chose City as his cousin Alan Oakes was on the books at the club, and so joined the club as an amateur in July 1961. He made his first team debut in April 1962 against Birmingham City. Aged 15 years and 314 days, he became Manchester City's youngest ever player. Though Pardoe played at full-back during most of his career, his first appearances were at centre-forward. On his debut he replaced Colin Barlow in the line-up, and he had represented England Schoolboys as a centre-forward. He also won 4 England under 23 caps. After his City debut, he played a further three consecutive matches."]}, {"page": "Paddy Fagan", "response": ["In his first season at Manchester City Fagan made only seven appearances, but in the 1954-55 season he became a first team regular, playing under the tactical system known as the Revie Plan. The 1954–55 season proved to be Fagan's most successful for Manchester City, playing 42 times and scoring 11 goals, including two goals against Manchester United at Old Trafford, as City reached the 1955 FA Cup final. However, his Wembley appearance ended in a 3–1 defeat to Newcastle United. Manchester City reached the final again the following season, but Fagan did not play in the final, and missed out on a winners' medal. After continuing to play regularly for a further three seasons, Fagan lost his first team place to Colin Barlow in the 1959-60 season, and was transferred to Derby County for £8,000 in March 1960, after a total of 165 appearances and 35 goals for the Manchester club. Fagan was capped twice by the Irish national team while at City. The first of these international caps came on 7 November 1954 against Norway."]}, {"page": "List of Manchester City F.C. seasons", "response": ["|align=left|Colin Barlow"]}, {"page": "Barlow (surname)", "response": ["*Colin Barlow (1935–2018), English football player"]}, {"page": "United Kingdom in the Eurovision Song Contest 2009", "response": ["On 18 October 2008, BBC announced an open application for interested artists to submit their applications in the form of a video recording of themselves performing a cover version of a popular song or a self-written song. Eligible artists were those being 17 years old by 1 January 2009 and living in a country within the European Economic Area. The application period lasted until 21 November 2008. All applicants were presented to a professional panel consisting of Andrew Lloyd Webber (composer of the British song) and Colin Barlow (record company executive) that ultimately selected six artists to compete in the national final.Eurovision: Your Country Needs You: Introduction Show. British Broadcasting Corporation (2009-01-03). Retrieved on 2009-01-03. An introduction show was broadcast on 3 January 2009 which involved the background preparation processes of the national final. The six contestants were also announced during the show: Charlotte Finlay, Damien Flood, Emperors of Soul, Francine and Nicola Gleadall, Jade Ewen and Mark Evans."]}, {"page": "History of Manchester City F.C. (1928–1965)", "response": ["|align=left|Colin Barlow"]}, {"page": "Up (James Morrison song)", "response": ["Though the first person Morrison himself thought of for the duet was Adele, it was his longstanding A&R man, Colin Barlow who actually suggested the collaboration with Jessie J. \"Not that I was doubting Jessie's ability in any way,\" the singer said, \"But I was worried whether she was the right character for the song. She got in the booth and did all this stuff that was amazing – she is a ridiculously good singer, so in tune she's like Autotune. I wanted to tap into the side of her character that is just a normal girl. I was like, you're a Ferrari, Jessie, you're in fifth gear – take it down to third. In the end it worked amazingly: she sang the chorus the way I should've sung it!\""]}, {"page": "2018–19 in English football", "response": ["* 20 December 2018: Colin Barlow, 83, Manchester City, Oldham Athletic and Doncaster Rovers winger."]}, {"page": "Deaths in December 2018", "response": ["*Colin Barlow, 83, English football player and executive (Manchester City).Former Man City player and chief executive Colin Barlow dies"]}]}}