{"wiki_id": "http://www.wikidata.org/entity/Q5145623", "itemLabel": "Colin Tommis", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Tommis", "wikipedia_page": {"main": "Colin Tommis (born 1958) is a Welsh composer, songwriter, session guitarist and teacher. He is chairman of the European Guitar Teachers Association (EGTA). His guitar music has been published by the Associated Board of the Royal Schools of Music, Chanterelle, Corda Music, Mel Bay and Bardic Edition.\nTommis started playing in folk music circles in the 1970s before joining the Ian Campbell Folk Group, with whom he worked from 1977 to 1982. In 1979, he embarked on studies of classical music with Harold Taylor, John Bache and John Woolfe (Music Director for Stratford's Royal Shakespeare Company) before graduation under the professorship of William Mathias at the University College of North Wales, Bangor. As a solo guitarist, he commissioned a new guitar sonata from Gareth Glyn and premiered pieces written especially for him by John Pickard, Jochen Eisentraut and Andy Crowdy.  This last was a guitar concerto.\nHe founded the Anglesey Guitar Ensemble in 1993 and this became, under his leadership, a successful group of young musicians. They won two national ensemble competitions and appeared on the BBC's Blue Peter television show, before disbanding in 1997. In the late 1990s, Tommis joined the experimental band Ogam, which aimed to present traditional Welsh melodies in unusual arrangements.\nSince then Tommis has collaborated with musicians such as Huw Warren, Gwyn Evans, and Lleuwen Steffan in the recording of many of his own songs. There are two CDs of Tommis' songs: The Cat Lover and Main Beam Blinded. Performances of Tommis' music have been heard in France, Australia, Canada, Argentina and Denmark.\nAs chair of the European Guitar Teachers Association (EGTA), Tommis has had a decisive and pivotal role in developing the National Youth Guitar Ensemble (NYGE). The NYGE has performed Tommis' ensemble music in numerous concerts across the UK. As chairman he has steered the organisation to Charitable Status.\nTommis has recently collaborated on a children's story for narrator and classical guitarist called “The Pink Feather”, for which he wrote 30 minutes of brand new solo classical guitar music. This project is now being recorded and performed at schools and festivals around the country.", "link_mentions": [{"page": "List of composers for the classical guitar", "response": ["| data-sort-value=\"Tommis, Colin\"| Colin Tommis || align=center | 1958 || align=center data-sort-value=\"9999\" |  || align=center | United Kingdom || || "]}, {"page": "Ian Campbell Folk Group", "response": ["The group found two new members in 1977 when Ian's sister Lorna separated from her husband Brian Clark, who had been a singer and guitarist in the group since 1963. These two were Aiden Forde and Colin Tommis. The band continued to perform across Britain and in Scandinavia, appearing several times on BBC Radio 2 shows and Pebble Mill at One. Adam's Rib, an album of Campbell's songs, was re-recorded in Copenhagen with guest musicians in 1979. Mike Hadley and Andy Smith continued to play with them and Neil Cox joined for their tour of North America. "]}]}}