{"wiki_id": "http://www.wikidata.org/entity/Q5145571", "itemLabel": "Colin Sinclair", "itemDescription": "professional footballer (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Sinclair_(footballer)", "wikipedia_page": {"main": "Colin MacLean Sinclair (born 1 December 1947) is a Scottish former professional footballer who played in the Scottish Football League for Raith Rovers and Dunfermline Athletic, and in the English Football League for Darlington, Hereford United and Newport County. A forward, he made more than 300 League appearances in all, and ended his career where it had begun, with Scottish junior club Linlithgow Rose.Sinclair was a member of the Darlington \"Dream Team\" selected in 2003 via a competition in the club's match programme, as part of the \"Farewell to Feethams\" celebrations when the club left its longtime home ground.After retiring from football he went on to develop a successful career in both the licensed and hotel trades from his base in Linlithgow.", "link_mentions": [{"page": "Darlington F.C.", "response": ["As part of the 2003 \"Farewell to Feethams\" celebrations, a competition in the club programme selected the following all-time \"Dream Team\": Mark Prudhoe, Ron Greener, Craig Liddle, Kevan Smith, John Peverell, Andy Toman, David McLean, Alan Sproates, Alan Walsh, Marco Gabbiadini and Colin Sinclair. Gabbiadini, scorer of 53 goals in his two seasons at Darlington, was voted greatest ever player."]}, {"page": "Colin Sinclair", "response": ["Colin Sinclair may refer to:", "* Colin Sinclair (footballer) (born 1947), Scottish former footballer", "* Colin Sinclair (boxer) (1890–1970), Australian boxer", "* Colin Sinclair (politician) (1876–1956), Australian politician", "* Colin Sinclair (tennis) (born 1994), Northern Mariana Islands tennis player", "* Colin Sinclair (minister), Church of Scotland minister and Moderator of the General Assembly of the Church of Scotland (2019-2020)"]}, {"page": "List of Darlington F.C. players", "response": ["Ten men listed heregoalkeeper Mark Prudhoe, defenders Ron Greener, Liddle, Kevan Smith and John Peverell, midfielders Andy Toman, Alan Sproates and David McLean, and forwards Walsh and Colin Sinclairwere voted by supporters into a \"Dream Team\" as part of the 2003 Farewell to Feethams celebrations, when the club left its long-time home. The eleventh man, Marco Gabbiadini, played only 98 times for Darlington. Ron Ferguson's goal that eliminated Sheffield Wednesday from the 1976–77 FA Cup was chosen best goal ever scored at the ground."]}, {"page": "Paul Hutchinson", "response": ["Hutchinson was born in Eaglescliffe, County Durham. He began his football career as a junior with Darlington, and made his senior debut on 23 October 1971, as a substitute for Colin Sinclair in a 3–0 defeat away to Aldershot in the Fourth Division. He made nine more appearances, all in the league in 1972–73, before moving into non-league football with Billingham Town."]}]}}