{"wiki_id": "http://www.wikidata.org/entity/Q5145612", "itemLabel": "Colin Taylor", "itemDescription": "English footballer born 1940", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Taylor", "wikipedia_page": {"main": "Colin Taylor (24 August 1940 — June 2005) was a Stourbridge-born English footballer who played for Walsall F.C. in three different spells, with whom he made at least 459 league appearances by the end of the 1972–73 season, scoring at least 169 goals. He also made 33 appearances in league games for Newcastle (7 goals) in season 1963-64 and 34 appearances in league games for Crystal Palace (8 goals), in season 1968–69, in which he helped Palace achieve promotion to the top flight for the first time. His haul of 32 goals for Walsall in season 1959–60 remains a record from the left wing.\nTaylor was a flame-haired, barrel-chested left-winger who was a member of Walsall's first team during their golden days of the 1950s and 1960s. Taylor was best known for his powerful shooting skills and the accuracy of his left foot and as a result of this, he was nick-named \"Cannonball Colin\" by Walsall`s fans. Such was the power in his left boot, Walsall fans of his era would claim that \"his left leg was out of proportion to his right\". Supporters would also eulogise that, when he shot at the \"Railway End\" goal at Fellow's Park, and happened to miss, the speed of the ball would be such, as to knock the rust off an old tea-sales caravan, permanently parked at that end.\nOn his retirement from professional football, Taylor, a quiet, modest man, worked as a painter and decorator.\nFollowing his death in 2005, Walsall F.C. promised to build a permanent memorial for Taylor.", "link_mentions": [{"page": "Walsall F.C.", "response": ["1970–71 saw the first league meeting between Walsall and their very first opponents Aston Villa. The two clubs met in the Third Division with Walsall winning the home tie 3–0, thanks to two goals from Geoff Morris and a Colin Taylor penalty. The away tie at Villa Park later in the season ended goalless.", "*  Colin Taylor (503) ", "*  Colin Taylor (189) "]}, {"page": "1969–70 Football League", "response": ["|34||align=left|  Colin Taylor ||align=left| Walsall ||9||4||0||13"]}, {"page": "1970–71 Football League", "response": ["|22||align=left|  Colin Taylor ||align=left| Walsall ||13||0||0||13"]}, {"page": "List of people with surname Taylor", "response": ["* Colin Taylor (1940–2005), association (soccer) footballer of the 1950s, 1960s and 1970s", "* Colin Taylor (footballer, born 1971) association (soccer) footballer of  the 1990s", "* Colin Taylor (rugby league), rugby league footballer of the 1960s"]}, {"page": "List of Walsall F.C. seasons", "response": ["|Colin Taylor", "|Colin Taylor", "|Colin Taylor", "|Colin Taylor", "|Colin Taylor", "|Colin Taylor"]}, {"page": "The Death Train", "response": ["* Colin Taylor as Herbert Cook"]}]}}