{"wiki_id": "http://www.wikidata.org/entity/Q5144990", "itemLabel": "Colin Clarke", "itemDescription": "English rugby league footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Clarke_(rugby_league)", "wikipedia_page": {"main": "Colin Clarke is an English former professional rugby league footballer who played as a hooker in the 1960s and 1970s, and coached in the 1980s. He played at representative level for Great Britain, and at club level for Wigan (two spells), Salford and Leigh, and coached at club level for Wigan.", "link_mentions": [{"page": "Wigan Warriors", "response": ["|Colin Clarke/Alan McInnes"]}, {"page": "Phil Clarke", "response": ["He is the son of Colin Clarke, the Wigan and England  of the 1960s and 1970s, and Wigan coach of the 1980s."]}, {"page": "Mike Gregory", "response": ["Following the departure of the Wigan Warriors' head coach Stuart Raper in July 2003, Gregory was appointed head coach until the end of 2003's Super League VIII. After Raper's announcement, Gregory had announced his intention to run for the job permanently. It was the first time since Colin Clarke in 1985 that a Wigan-born man has coached Wigan. Gregory spent three months as caretaker coach, remaining unbeaten for 11 matches and guiding the Wigan Warriors to the 2003 Super League Grand Final – becoming the first side from outside the top two to make it all the way – before being awarded the job full-time on a 2-year contract. The grand final was lost to the Bradford Bulls."]}, {"page": "1984–85 Challenge Cup", "response": ["|colspan=\"4\"| Colin Clarke  Alan McInnes"]}, {"page": "History of the Wigan Warriors", "response": ["In 1985, now coached by Colin Clarke and Alan McInnes, Wigan returned to Wembley this time as victors beating Hull 28–24 in front of a crowd of 99,801 in one of the best finals in the competition's history. Brett Kenny won the Lance Todd trophy as man of the match, scoring a memorable try to add to other exciting scores by John Ferguson (2), Henderson Gill and Shaun Edwards."]}, {"page": "1982 Kangaroo tour of Great Britain and France", "response": ["|colspan=\"4\"| Colin Clarke"]}]}}