{"wiki_id": "http://www.wikidata.org/entity/Q514041", "itemLabel": "Dulcie Gray", "itemDescription": "Actress, singer, writer (1915-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dulcie_Gray", "wikipedia_page": {"main": "Dulcie Winifred Catherine Denison,  (née Bailey; 20 November 1915 – 15 November 2011), known professionally as Dulcie Gray, was a British singer and actress of stage, screen and television, a mystery writer and lepidopterist.", "link_mentions": [{"page": "Miss Marple", "response": ["On 21 September 1977, while Murder at the Vicarage was still running at the Fortune, a stage adaptation by Leslie Darbon of A Murder Is Announced opened at the Vaudeville Theatre, with Dulcie Gray as Miss Marple.Vaudeville Theatre programme, No.29 February 1978 The show ran to the end of September 1978 and then went on tour.'On the Way', The Stage, 10 August 1978"]}, {"page": "Josephine Tey", "response": ["# The Franchise Affair (1948)  [Inspector Grant appears briefly at the beginning, mentioned a few times] (filmed in 1950 starring Michael Denison and Dulcie Gray)"]}, {"page": "Wallingford, Oxfordshire", "response": ["*Dulcie Gray, actress"]}, {"page": "Richard Todd", "response": ["*An Ideal Husband by Oscar Wilde (1965) – Strand Theatre, London with Margaret Lockwood, Michael Denison, Dulcie Gray and Roger Livesey – also toured South Africa"]}, {"page": "Francis Brett Young", "response": ["Several of his books were adapted for film and television, including My Brother Jonathan (1948) starring Michael Denison, Dulcie Gray and James Robertson Justice; and Portrait of Clare (1950) starring Margaret Johnston, Richard Todd and Robin Bailey.  Both films used Aston Rowant railway station in Oxfordshire as a filming location."]}, {"page": "Jessie Matthews", "response": ["Her warbling voice and round cheeks made her a familiar and much-loved personality to British theatre and film audiences at the beginning of World War II. She was one of many British-born stars in the Hollywood film Forever and a Day (1943) (in whose cast Matthews was virtually unique, by virtue of not being an expat: while in New York City preparing for a Broadway role, Matthews had been recruited to film a role originally intended for Greer Garson in Hollywood over three days). Matthews' popularity waned in the 1940s after several years' absence from the screen, followed by an unsatisfactory thriller, Candles at Nine (1944). She directed and featured in the short film, Victory Wedding (1944), starring John Mills and Dulcie Gray.Victory Wedding. British Film Institute. Retrieved 29 April 2020Lant, Antonia Caroline. (1991). Blackout: Reinventing Women for Wartime British Cinema. Princeton University Press. p. 261 ."]}, {"page": "The Diary of a Nobody", "response": ["In September 1954 a stage version of the Diary, by Basil Dean and Richard Blake, was presented at London's Arts Theatre  with a cast that included George Benson and Dulcie Gray as the Pooters and Leslie Phillips as Lupin. Anthony Hartley, writing in The Spectator, classed this production as \"fair-to-middling\", with sympathetic performances from the principals: \"[I]t is a precondition of this kind of play that everybody concerned should have a heart of gold: only in the case of Mr. Pooter's employer, Mr. Perkupp, do we actually hear the metal chinking.\""]}, {"page": "Brighton Rock (novel)", "response": ["Richard Attenborough and Dulcie Gray starred in the original theatrical production, which ran for 100 performances at the Garrick Theatre in 1943. (There had been one-week try-outs at the Grand Theatre, Blackpool and Bristol Hippodrome). Gray's performance as the luckless waitress Rose led to her being offered a contract with Gainsborough Pictures. However, she was passed over for the role of Rose in the 1947 film version of Brighton Rock, in favour of Carol Marsh."]}, {"page": "An Ideal Husband", "response": ["A London revival in 1965–66 ran at three West End theatres in succession; it starred Michael Denison as Sir Robert Chiltern, Dulcie Gray as Lady Chiltern, Margaret Lockwood as Mrs Cheveley and Richard Todd as Lord Goring. The play was again seen at the Westminster in 1989 in a short-lived revival, and in 1992 a new production was presented at the Globe Theatre which was subsequently seen in four other London theatres and on Broadway between November 1992 and March 1999. It was directed by Peter Hall, and the original cast featured David Yelland as Sir Robert Chiltern, Hannah Gordon as Lady Chiltern, Anna Carteret as Mrs Cheveley, Martin Shaw as Lord Goring, Michael Denison as Lord Caversham and Dulcie Gray as Lady Markby. The various stagings of the production ran for an aggregate three years, the longest running production of a Wilde play."]}, {"page": "Howards' Way", "response": ["Other major characters introduced during the first series are Kate Harvey (Dulcie Gray), Jan's sensible and supportive mother, the millionaire businessman Charles Frere (Tony Anholt) and the wealthy but unhappy Urquhart family. Gerald (Ivor Danvers) is the right-hand man of Charles Frere. Polly (Patricia Shakesby), a friend of Jan, is a bored corporate wife preoccupied with preserving her social status, and their daughter Abby (Cindy Shelley) is a socially awkward young woman who has returned to Tarrant after completing her education at a Swiss finishing school and who establishes a friendship with Leo Howard. Unlike the comparatively close and secure Howard family, the Urquharts have secrets to hide. Gerald and Polly's marriage is a sham—an arrangement to cover the fact that Gerald is bisexual, to give him respectability in the business world and give a name to Abby, Polly's illegitimate daughter after an affair at university. Abby herself is pregnant, after a brief relationship in Switzerland.", "| scope=\"col\" colspan=\"1\" style=\"background:#F0F8FF\"| Dulcie Gray"]}, {"page": "Play of the Month", "response": ["|Jeremy Irons,Brewster Mason,Jeremy Child,Julie Covington,Dulcie Gray,Barbara Leigh-Hunt"]}, {"page": "Ron Randell", "response": ["*Sweet Peril (December 1952) – London – with Michael Denison and Dulcie GrayReview of play at Variety"]}, {"page": "List of female movie actors by name: G", "response": ["*Dulcie Gray (1915–2011)"]}, {"page": "Kingdom of Redonda", "response": ["Actors ennobled during Gawsworth's reign were Michael Denison, Dulcie Gray, Barry Humphries, Diana Dors, Dirk Bogarde, Mai Zetterling, Vincent Price, Joan Greenwood, and Robert Beatty. Also honoured were broadcasters Libby Purves, Roy Plomley and Alan Coren. King Xavier's peers include Pedro Almodóvar, Francis Ford Coppola, A. S. Byatt, Alice Munro, Umberto Eco, George Steiner, Ray Bradbury, Frank Gehry, J. M. Coetzee, Éric Rohmer, and Philip Pullman. The artist Stephen Chambers was ennobled in 2017."]}, {"page": "List of Old Harrovians", "response": ["*Michael Denison (1915–1998), English actor who appeared in several films with his wife Dulcie Gray"]}, {"page": "Michael Denison", "response": ["John Michael Terence Wellesley Denison  (1 November 191522 July 1998)\"Screen gent Denison dies\", BBC News, 22 July 1998 was an  English actor. He often appeared in films with his wife, Dulcie Gray. He is best known for roles in films such as The Glass Mountain, Angels One Five and the 1952 adaptation of the Oscar Wilde play The Importance of Being Earnest.", "After graduating, Denison attended the Webber Douglas Academy of Dramatic Art, where he met Dulcie Gray, a fellow student, who later became his wife in 1939 and his acting partner. They appeared in more than 100 West End productions, together in some 28 plays in London and countless tours of Britain and elsewhere. They also appeared together in several films. Their intertwined professional lives reached their pinnacle in 1996 with their first appearance together on Broadway, in the Peter Hall production of Oscar Wilde's An Ideal Husband. Their last appearance together was in Curtain Up, an evening of reminiscences at the Jermyn Street Theatre in London, shortly before he died.", "He was the subject of This Is Your Life on two occasions, in February 1977 when he was surprised by Eamonn Andrews in the foyer of the Inn on the Park in London's Park Lane; and in April 1995, when Michael Aspel surprised him and his wife Dulcie Gray, on board the Sir Thomas More motorboat at Teddington Lock, for a joint tribute."]}, {"page": "The Mill at Sonning", "response": ["The theatre's first artistic director was Peter Egan. Productions have included performances by Anthony Valentine, Judi Dench, June Whitfield, Adam Faith, Michael Denison, Dulcie Gray, John Junkin and Brian Cant."]}, {"page": "Angharad Rees", "response": ["She toured in the Bill Kenwright production of Oscar Wilde’s An Ideal Husband, directed by Peter Hall, with Michael Denison and Dulcie Gray and appeared regularly with John Mortimer in Mortimer’s Miscellany, his self-devised anthology of poetry and prose presented at theatres around Britain."]}, {"page": "Robert Flemyng", "response": ["In 1980 Flemyng played Sorin in The Seagull with Barbara Jefford as Arkadina,\"Play Reviews\", The Stage,14 February 1980, p. 23 and the following year he co-starred in William Douglas-Home's The Kingfisher with Michael Denison and Dulcie Gray.Wardle, Irving and Ned Chaillet. \"Theatre\",  The Times 16 October 1981, p. 33 He appeared for two years at the Savoy Theatre in Michael Frayn's Noises Off, taking over the role of Selsdon Mowbray from Michael Aldridge in early 1983 and handing it over to Hugh Paddick at the end of 1984.Masters, Anthony. \"Helpless laughter\", The Times, 15 February 1983, p. 11; and \"Theatres\", The Times, 12 December 1984, p. 35 In 1988 he played Colonel Pickering in My Fair Lady to the Higgins of Denis Quilley and the Eliza of Liz Robertson.\"Theatre Week\", The Stage, 14 January 1988, p. 8 The following year he appeared with Michael Gambon and Jack Lemmon at the Haymarket in Veterans' Day in which they played veterans of, respectively, the First and Second World Wars and the Vietnam War.\"Theatre\", The Illustrated London News, 1 September 1989, p. 96"]}, {"page": "Three Up, Two Down", "response": ["*Dulcie Gray as Nanny"]}, {"page": "Gray (surname)", "response": ["*Dulcie Gray, British actress"]}, {"page": "A Man Could Get Killed", "response": ["* Dulcie Gray as Mrs. Mathieson"]}, {"page": "The Glass Mountain (film)", "response": ["The Glass Mountain is a 1949 black and white British romantic film drama.  It starred Michael Denison, Dulcie Gray and Valentina Cortese. The film was a popular success of its day, and was re-released in the UK in 1950 and 1953. It  features acclaimed classical vocalist Tito Gobbi as himself, with the orchestra and chorus of the Venice Opera House. The theme music by Nino Rota is memorable, and was also a contemporary hit. It was mainly filmed on location in the Dolomites and at Venice's La Fenice Opera House. Co-producer Joseph Janni also co-produced another film shot in Italy, the comedy Honeymoon Deferred, in 1951.", "When the war ends, Richard returns to England and his loving wife Anne (Dulcie Gray). He begins composing an opera based on the legend of Dolomite, the Glass Mountain, which has begun to haunt him.", "*Dulcie Gray as Anne [Wilder]"]}, {"page": "Angels One Five", "response": ["Angels One Five is a 1952 British war film directed by George More O'Ferrall and starring Jack Hawkins, Michael Denison, Dulcie Gray, John Gregson, Cyril Raymond and Veronica Hurst. Based on the book What Are Your Angels Now? by Pelham Groom (who was also technical adviser to the film under his full title of W/Cdr. A. J. C. Pelham Groom), the plot centres on a young fighter pilot immediately before and during the Battle of Britain in the Second World War. Some scenes in the film were shot at RAF Uxbridge, home to a wartime operations room.", "Eventually, a reinstated Septic joins in Pimpernel's operations, but he is mortally wounded while shooting down an enemy aircraft. His last words are heard over the Sector control room tannoy (public-address system), when he tells Small that their planned return foot race will have to be \"postponed indefinitely\". Small replies \"Your message received and understood. Out.\" The final shot is of Squadron Leader Clinton's wife Nadine (Dulcie Gray) hanging an oil lamp in the ruins of their bungalow to aid returning pilots.", "* Dulcie Gray as Nadine Clinton "]}, {"page": "A Place of One's Own", "response": ["A Place of One's Own is a 1945 British film directed by Bernard Knowles. An atmospheric ghost story based on the 1940 novel of the same title by Osbert Sitwell, it stars James Mason, Barbara Mullen, Margaret Lockwood, Dennis Price and Dulcie Gray. Mason and Mullen are artificially aged to play the old couple. It was one of the cycle of Gainsborough Melodramas.", "* Dulcie Gray as Sarah "]}, {"page": "The Franchise Affair (novel)", "response": ["The novel was adapted for the film The Franchise Affair in 1951, starring Michael Denison as Blair, Dulcie Gray as Marion Sharpe, Marjorie Fielding as Mrs. Sharpe, and Ann Stephens as Betty Kane. It has also been adapted twice for television, in 1962 and 1988, and once for radio in 2005."]}, {"page": "Giles Cooper (playwright)", "response": ["His last play was Happy Family was first presented at the Hampstead Theatre in 1966 starring Wendy Craig; it then transferred to the West End with Michael Denison, Dulcie Gray and Robert Flemyng. A revival in 1984 directed by Maria Aitken opened in Windsor and transferred to the Duke of York's Theatre in the West End, starring Ian Ogilvy, Angela Thorne, James Laurenson and Stephanie Beacham."]}, {"page": "Denville Hall", "response": ["*Dulcie Gray"]}, {"page": "Madonna of the Seven Moons", "response": ["* Dulcie Gray as Nesta Logan"]}, {"page": "Agatha Christie's Partners in Crime", "response": ["|Dulcie Gray (as Lady Laura Barton) Arthur Cox (as Inspector Marriott) William Hootkins (as Hamilton Betts) Graham Crowden (as Colonel Kingston Bruce) Susannah Morley (as Beatrice Kingston Bruce) Lynda La Plante (as Phyllis Betts)"]}, {"page": "List of British films of 1945", "response": ["|They Were Sisters||Arthur Crabtree ||James Mason, Phyllis Calvert, Dulcie Gray ||Melodrama ||"]}, {"page": "List of British films of 1946", "response": ["|Wanted for Murder||Lawrence Huntington||Eric Portman, Dulcie Gray||Thriller||"]}, {"page": "List of British films of 1947", "response": ["|A Man About the House||Leslie Arliss ||Dulcie Gray, Margaret Johnston, Kieron Moore ||Drama ||", "|Mine Own Executioner||Anthony Kimmins||Burgess Meredith, Dulcie Gray||Drama||"]}, {"page": "List of British films of 1948", "response": ["|My Brother Jonathan||Harold French ||Michael Denison, Dulcie Gray||Drama ||"]}, {"page": "List of British films of 1949", "response": ["|The Glass Mountain||Edoardo Anton, Henry Cass ||Michael Denison, Dulcie Gray ||Drama ||"]}, {"page": "List of British films of 1951", "response": ["|The Franchise Affair||Lawrence Huntington ||Michael Denison, Dulcie Gray ||Thriller||"]}, {"page": "List of British films of 1953", "response": ["|There Was a Young Lady||Lawrence Huntington||Michael Denison, Dulcie Gray||Comedy||"]}, {"page": "Ashcroft Theatre", "response": ["The Ashcroft Theatre was opened on 5 November 1962 by Dame Peggy Ashcroft. The opening ceremony included the reading of a monologue specially penned by Sir John Betjeman called ‘Local Girl Makes Good'. The first play was ‘Royal Gambit' starring Dulcie Gray. Those to have trodden the boards at The Ashcroft Theatre include Richard Todd, Rex Harrison and Dame Peggy herself."]}, {"page": "2011 in film", "response": ["| style=\"text-align:center;\"| 15 || Dulcie Gray || style=\"text-align:center;\"| 95 || style=\"text-align:center;\"| British || style=\"text-align:center;\"| Actress || "]}, {"page": "Gainsborough melodramas", "response": ["A large number of actors appeared in the films, but they are particularly associated with James Mason,The Wicked Lady - The Criterion Channel Margaret Lockwood,Odd man out|Film|The Guardian Phyllis Calvert,Madonna of the Seven Moons - The Criterion Channel Stewart Granger, Patricia Roc, Jean Kent,Jean Kent: Suffolk Gainborsough melodramas actress dies - BBC News Anne Crawford, Dennis Price and Dulcie Gray. Leslie Arliss directed several of the most successful films. Other directors included Arthur Crabtree, Anthony Asquith and Bernard Knowles."]}, {"page": "Johnny Douglas (conductor)", "response": ["Moira Anderson, Shirley Bassey, The Bachelors, John Boulter, June Bronhill, Dora Bryan, Max Bygraves, Stuart Gillies, Dulcie Gray, John Hanson, Dickie Henderson, Vince Hill, Frankie Howerd, Teddy Johnson, Denis Lotis, Vera Lynn, Janie Marden, Alfred Marks, Kenneth McKellar, Lita Roza, Mike Redway, Joan Regan, Malcolm Roberts, Patricia Routledge, Harry Secombe, Semprini, Anne Shelton, Jimmy Tarbuck, Bruce Trent, Dickie Valentine, Frankie Vaughan, David Whitfield, Rita Williams, Mark Wynter and Jimmy Young, Shirley Jones, Howard Keel, Al Martino, Barbra Streisand, Tex Ritter."]}, {"page": "The Years Between (film)", "response": ["* Dulcie Gray as Judy  "]}, {"page": "List of British actors", "response": ["* Dulcie Gray (1915–2011)"]}, {"page": "My Brother Jonathan", "response": ["My Brother Jonathan is a 1948 British drama film directed by Harold French and starring Michael Denison, Dulcie Gray, Ronald Howard and Beatrice Campbell. It is adapted from the 1930 novel My Brother Jonathan by Francis Brett Young, later turned into a television series of the same title.", "*Rachel Hammond – Dulcie Gray"]}, {"page": "Mine Own Executioner", "response": ["* Dulcie Gray as Patricia Milne"]}]}}