{"wiki_id": "http://www.wikidata.org/entity/Q51506", "itemLabel": "Richard Attenborough", "itemDescription": "English actor, film director and producer (1923-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Attenborough", "wikipedia_page": {"main": "Richard Samuel Attenborough, Baron Attenborough  (; 29 August 1923 – 24 August 2014) was an English actor, filmmaker, and entrepreneur. He was the president of the Royal Academy of Dramatic Art (RADA) and the British Academy of Film and Television Arts (BAFTA), as well as the life president of Chelsea FC. He joined the Royal Air Force during the Second World War and served in the film unit, going on several bombing raids over Europe and filming the action from the rear gunner's position. He was the older brother of broadcaster Sir David Attenborough and motor executive John Attenborough. He was married to actress Sheila Sim from 1945 until his death.\nFor his directorial debut, 1969's Oh! What a Lovely War, Attenborough was nominated for the BAFTA Award for Best Direction, and he was nominated for his films Young Winston, A Bridge Too Far, and Cry Freedom. He won two Academy Awards for Gandhi in 1983: Best Picture and Best Director. The BFI ranked Gandhi the 34th greatest British film of the 20th century. Attenborough also won four BAFTA Awards, four Golden Globe Awards, and the 1983 BAFTA Fellowship for lifetime achievement. As an actor, he is best remembered for his roles in Brighton Rock (1948), I'm All Right Jack (1959), The Great Escape (1963), The Sand Pebbles (1966), Doctor Dolittle (1967), 10 Rillington Place (1971), Jurassic Park (1993), and Miracle on 34th Street (1994).", "link_mentions": [{"page": "August 24", "response": ["*2014 – Richard Attenborough, English actor, director, producer, and politician (b. 1923)"]}, {"page": "August 29", "response": ["*1923 – Richard Attenborough, English actor, director, and producer (d. 2014)"]}, {"page": "Anthony Hopkins", "response": ["In 1968, Hopkins achieved recognition in film, playing Richard the Lionheart in The Lion in Winter. In the mid-1970s, Richard Attenborough, who directed five Hopkins films, called him \"the greatest actor of his generation.\" In 1991, he portrayed Hannibal Lecter in the psychological horror film The Silence of the Lambs, winning the Academy Award for Best Actor. He reprised the role in its sequel Hannibal and the prequel Red Dragon. Other notable films include The Elephant Man (1980), 84 Charing Cross Road (1987), Howards End (1992), Bram Stoker's Dracula (1992), Shadowlands (1993), Legends of the Fall (1994), Meet Joe Black (1998), The Mask of Zorro (1998), Thor (2011), Thor: The Dark World (2013), Transformers: The Last Knight (2017), and Thor: Ragnarok (2017). He received four more Academy Award nominations for The Remains of the Day (1993), Nixon (1995), Amistad (1997) and The Two Popes (2019) before winning a fourth BAFTA Award and a second Academy Award for Best Actor for his portrayal of an elderly man diagnosed with dementia in The Father (2020), becoming the oldest Best Actor Oscar winner to date.", "In 1968, Hopkins got his break in The Lion in Winter playing Richard the Lionheart, a performance which saw him nominated for the BAFTA Award for Best Actor in a Supporting Role. Making a name for himself as a screen actor, he appeared in Frank Pierson's neo-noir action thriller The Looking Glass War (1970), and Étienne Périer's When Eight Bells Toll (1971). In 1972 he starred as British politician David Lloyd George in Young Winston, and in 1977 he played British Army officer John Frost in the World War II-set film A Bridge Too Far. Both of these films were directed by Richard Attenborough, who described Hopkins as \"unquestionably the greatest actor of his generation\". He then starred in a film adaptation of the Henrik Ibsen play A Doll's House (1973) alongside Claire Bloom, Ralph Richardson, Denholm Elliott, and Edith Evans. He then appeared in the comedy The Girl from Petrovka (1974) with Goldie Hawn and Hal Holbrook and also starred in the Richard Lester suspense film Juggernaut opposite Richard Harris and Omar Sharif. In 1978 he starred in the sequel to National Velvet (1944), entitled International Velvet with Tatum O'Neal, Christopher Plummer, which was directed by Bryan Forbes. In 1978 he also starred in Attenborough's psychological horror film Magic about a demonic ventriloquist's puppet with Gene Siskel adding it as one of the best films of the year.", "Richard Attenborough, who directed Hopkins on five occasions, found himself going to great lengths during the filming of Shadowlands (1993) to accommodate the differing approaches of his two stars (Hopkins and Debra Winger), who shared many scenes. Whereas Hopkins preferred the spontaneity of a fresh take and liked to keep rehearsals to a minimum, Winger rehearsed continuously. To allow for this, Attenborough stood in for Hopkins during Winger's rehearsals, only bringing him in for the last one before a take. The director praised Hopkins for \"this extraordinary ability to make you believe when you hear him that it is the very first time he has ever said that line. It's an incredible gift.\"", "Hopkins has also been honored with various life time achievement awards for his work in film and television. In 2006, Gwyneth Paltrow presented him with the Golden Globe Cecil B. DeMille award In 2008, Richard Attenborough presented Hopkins with the BAFTA Fellowship for lifetime achievement from the British Academy of Film and Television Arts. Hopkins has also received a star on the Hollywood Walk of Fame in 2003. In 2021, Hopkins won the Oscar for the Best Actor for The Father. He became the oldest nominee and winner of the award."]}, {"page": "Charlie Chaplin", "response": ["As a filmmaker, Chaplin is considered a pioneer and one of the most influential figures of the early twentieth century. He is often credited as one of the medium's first artists. Film historian Mark Cousins has written that Chaplin \"changed not only the imagery of cinema, but also its sociology and grammar\" and claims that Chaplin was as important to the development of comedy as a genre as D.W. Griffith was to drama. He was the first to popularise feature-length comedy and to slow down the pace of action, adding pathos and subtlety to it. Although his work is mostly classified as slapstick, Chaplin's drama A Woman of Paris (1923) was a major influence on Ernst Lubitsch's film The Marriage Circle (1924) and thus played a part in the development of \"sophisticated comedy\". According to David Robinson, Chaplin's innovations were \"rapidly assimilated to become part of the common practice of film craft\". Filmmakers who cited Chaplin as an influence include Federico Fellini (who called Chaplin \"a sort of Adam, from whom we are all descended\"), Jacques Tati (\"Without him I would never have made a film\"), René Clair (\"He inspired practically every filmmaker\"), François Truffaut (\"My religion is cinema. I believe in Charlie Chaplin…\"), Michael Powell, Billy Wilder, Vittorio De Sica, and Richard Attenborough. Russian filmmaker Andrei Tarkovsky praised Chaplin as \"the only person to have gone down into cinematic history without any shadow of a doubt. The films he left behind can never grow old.\" Indian filmmaker Satyajit Ray said about Chaplin \"If there is any name which can be said to symbolize cinema—it is Charlie Chaplin… I am sure Chaplin's name will survive even if the cinema ceases to exist as a medium of artistic expression. Chaplin is truly immortal.\" French auteur Jean Renoir's favourite filmmaker was Chaplin.", "Chaplin is the subject of a biographical film, Chaplin (1992) directed by Richard Attenborough, and starring Robert Downey Jr. in the title role and Geraldine Chaplin playing Hannah Chaplin. He is also a character in the historical drama film The Cat's Meow (2001), played by Eddie Izzard, and in the made-for-television movie The Scarlett O'Hara War (1980), played by Clive Revill. A television series about Chaplin's childhood, Young Charlie Chaplin, ran on PBS in 1989, and was nominated for an Emmy Award for Outstanding Children's Program. The French film The Price of Fame (2014) is a fictionalised account of the robbery of Chaplin's grave."]}, {"page": "Crane shot", "response": ["* The closing take of Richard Attenborough's film version of Oh! What a Lovely War begins with a single war grave, gradually pulling back to reveal hundreds of identical crosses."]}, {"page": "Dave Brubeck", "response": ["At its peak in the early 1960s, the Brubeck Quartet was releasing as many as four albums a year. Apart from the \"College\" and the \"Time\" series, Brubeck recorded four LP records featuring his compositions based on the group's travels, and the local music they encountered. Jazz Impressions of the U.S.A. (1956, Morello's debut with the group), Jazz Impressions of Eurasia (1958), Jazz Impressions of Japan (1964), and Jazz Impressions of New York (1964) are less well-known albums and they produced Brubeck standards such as \"Summer Song\", \"Brandenburg Gate\", \"Koto Song\", and \"Theme from Mr. Broadway\". (Brubeck wrote, and the Quartet performed, the theme song for this Craig Stevens CBS drama series; the music from the series became material for the New York album.) In 1961, Brubeck appeared in a few scenes of the British jazz/beat film All Night Long, which starred Patrick McGoohan and Richard Attenborough. Brubeck merely plays himself, with the film featuring close-ups of his piano fingerings. Brubeck performs \"It's a Raggy Waltz\" from the Time Further Out album and duets briefly with bassist Charles Mingus in \"Non-Sectarian Blues\"."]}, {"page": "Cinema of the United Kingdom", "response": ["Other films during the early 1970s included the Edwardian drama The Go-Between (1971), which won the Palme d'Or at the Cannes Film Festival, Nicolas Roeg's Venice-set supernatural thriller Don't Look Now (1973) and Mike Hodges' gangster drama Get Carter (1971) starring Michael Caine. Alfred Hitchcock returned to Britain to shoot Frenzy (1972), Other productions such as Richard Attenborough's Young Winston (1972) and A Bridge Too Far (1977) met with mixed commercial success. The British horror film cycle associated with Hammer Film Productions, Amicus and Tigon drew to a close, despite attempts by Hammer to spice up the formula with added nudity and gore. Although some attempts were made to broaden the range of British horror films, such as with The Wicker Man (1973), these films made little impact at the box office, In 1976, British Lion, who produced The Wicker Man, were finally absorbed into the film division of EMI, who had taken over ABPC in 1969. The duopoly in British cinema exhibition, via Rank and now EMI, continued.", "Among the more successful British films were the Merchant Ivory productions Howards End (1992) and The Remains of the Day (1993), Richard Attenborough's Shadowlands (1993), and Kenneth Branagh's Shakespeare adaptations. The Madness of King George (1994) proved there was still a market for British costume dramas, and other period films followed, including Sense and Sensibility (1995), Restoration (1995), Emma (1996), Mrs. Brown (1997), Basil (1998), Shakespeare in Love (1998) and Topsy-Turvy (1999)."]}, {"page": "Franklin J. Schaffner", "response": ["Screenwriter William Goldman identified Schaffner in 1981 as being one of the three best directors (then living) at handling \"scope\" (a gift for screen epics) in films. The other two were David Lean and Richard Attenborough.John Bradey, \"The craft of the screenwriter\", 1981. Page 168"]}, {"page": "Harry Secombe", "response": ["In 1958 he appeared in the film Jet Storm, which starred Dame Sybil Thorndike and Richard Attenborough and in the same year Secombe starred in the title role in Davy, one of Ealing Studios' last films.", "|Richard Attenborough, Stanley Baker"]}, {"page": "Jawaharlal Nehru", "response": ["There have been many documentaries about Nehru's life, and he has been portrayed in fictionalised films. The canonical performance is probably that of Roshan Seth, who played him three times: in Richard Attenborough's 1982 film Gandhi, Shyam Benegal's 1988 television series Bharat Ek Khoj, based on Nehru's The Discovery of India, and in a 2007 TV film entitled The Last Days of the Raj. Benegal directed the 1983 documentary film Nehru, covering his political career. Indian film director Kiran Kumar made a film about Nehru titled Nehru: The Jewel of India in 1990 starring Partap Sharma in the titular role. In Ketan Mehta's film Sardar, Benjamin Gilani portrayed Nehru. Naunihal (), a 1967 Indian Hindi-language drama film by Raj Marbros, follows Raju, an orphan, who believes that Jawaharlal Nehru is his relative and sets out to meet him. Similarly, in the 1957 film Ab Dilli Dur Nahin () by Amar Kumar, Rattan, a young boy, travels to Delhi and seeks to avert the death sentence of his wrongly convicted father by asking Prime Minister Nehru for help."]}, {"page": "Boulting brothers", "response": ["During the Spanish Civil War, John served with the International Brigades as an ambulance driver, where—according to Richard Attenborough—Boulting was nearly captured.", "John joined the RAF Film Unit, where he made Journey Together in 1945, a dramatised documentary about the training and combat experience of a bomber crew with Richard Attenborough in the lead part. Terence Rattigan worked on the script.", "Also well liked was the comedy The Guinea Pig (1948), starring Richard Attenborough as a young working-class boy sent to a public school. It was made for Pilgrim Pictures who the Boultings left shortly afterwards."]}, {"page": "Jon Voight", "response": ["Also in 2001, he appeared in the television mini-series Jack and the Beanstalk: The Real Story along with Vanessa Redgrave, Matthew Modine, Richard Attenborough, and Mia Sara."]}, {"page": "Liv Ullmann", "response": ["She became better known once she started to work with Swedish movie director Ingmar Bergman. She later acted, with acclaim, in 10 of his movies, including Persona (1966), The Passion of Anna (1969), Cries and Whispers (1972), and Autumn Sonata (1978), in the last of which her co-actress Ingrid Bergman resumed her own Swedish cinema career. She co-acted often with Swedish actor and fellow Bergman collaborator Erland Josephson, with whom she made the Swedish television drama Scenes from a Marriage (1973), which was also edited to feature-movie length and distributed theatrically. Ullmann acted with Laurence Olivier in A Bridge Too Far (1977), directed by Richard Attenborough.", "| Richard Attenborough"]}, {"page": "Musical film", "response": ["In the 1970s, film culture and the changing demographics of filmgoers placed greater emphasis on gritty realism, while the pure entertainment and theatricality of classical-era Hollywood musicals was seen as old-fashioned. Despite this, Fiddler on the Roof and Cabaret were more traditional musicals closely adapted from stage shows and were strong successes with critics and audiences. Changing cultural mores and the abandonment of the Hays Code in 1968 also contributed to changing tastes in film audiences. The 1973 film of Andrew Lloyd Webber and Tim Rice's Jesus Christ Superstar was met with some criticism by religious groups but was well received. By the mid-1970s, filmmakers avoided the genre in favor of using music by popular rock or pop bands as background music, partly in hope of selling a soundtrack album to fans. The Rocky Horror Picture Show was originally released in 1975 and was a critical failure until it started midnight screenings in the 1980s where it achieved cult status. 1976 saw the release of the low-budget comic musical, The First Nudie Musical, released by Paramount. The 1978 film version of Grease was a smash hit; its songs were original compositions done in a 1950s pop style. However, the sequel Grease 2 (released in 1982) bombed at the box-office. Films about performers which incorporated gritty drama and musical numbers interwoven as a diegetic part of the storyline were produced, such as Lady Sings the Blues, All That Jazz, and New York, New York. Some musicals made in Britain experimented with the form, such as Richard Attenborough's Oh! What a Lovely War (released in 1969), Alan Parker's Bugsy Malone and Ken Russell's Tommy and Lisztomania."]}, {"page": "Mahatma Gandhi", "response": ["A five-hour nine-minute long biographical documentary film, Mahatma: Life of Gandhi, 1869–1948, made by Vithalbhai Jhaveri in 1968, quoting Gandhi's words and using black and white archival footage and photographs, captures the history of those times. Ben Kingsley portrayed him in Richard Attenborough's 1982 film Gandhi, which won the Academy Award for Best Picture.  It was based on the biography by Louis Fischer.Louis Fischer,  The Life of Mahatma Gandhi (1957) online The 1996 film The Making of the Mahatma documented Gandhi's time in South Africa and his transformation from an inexperienced barrister to recognised political leader. Gandhi was a central figure in the 2006 Bollywood comedy film Lage Raho Munna Bhai. Jahnu Barua's Maine Gandhi Ko Nahin Mara (I did not kill Gandhi), places contemporary society as a backdrop with its vanishing memory of Gandhi's values as a metaphor for the senile forgetfulness of the protagonist of his 2005 film, writes Vinay Lal."]}]}}