{"wiki_id": "http://www.wikidata.org/entity/Q515883", "itemLabel": "Paul Epworth", "itemDescription": "British music producer, musician, and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Epworth", "wikipedia_page": {"main": "Paul Richard Epworth (born 25 July 1974) is an English record producer, musician, and songwriter. His work with artists include Adele, Florence and the Machine, Rihanna and Maxïmo Park amongst many others. He is a member of the Music Producers Guild and is the founder and owner of the independent record label Wolf Tone, having released music from Glass Animals, Rosie Lowe and The Horrors. He has won 'Producer of the Year' at the BRIT Awards three times, the most recent in 2015.He has won five Grammy Awards, as well as the Academy Award for Best Original Song for \"Skyfall\". He released his debut studio album Voyager in 2020.\nEpworth has had a long-standing working relationship with Adele. He has stated that \"working with Adele brings new pressures as a result of the early success the pair enjoyed.\"\n\n", "link_mentions": [{"page": "Grammy Award for Song of the Year", "response": ["|Adele AdkinsPaul Epworth"]}, {"page": "U2", "response": ["Throughout the 360° Tour, the band worked on multiple album projects, including: a traditional rock album produced by Danger Mouse; a dance record produced by RedOne and will.i.am; and Songs of Ascent. However, the latter was not completed to their satisfaction, and by December 2011, Clayton admitted it would not come to fruition.MacDonald (2014), pp. 232–235 The sessions with Danger Mouse instead formed the foundation of U2's next album, and they worked with him until May 2013 before enlisting the help of producers Paul Epworth, Ryan Tedder, Declan Gaffney, and Flood. The band suspended work on the album late in 2013 to contribute a new song, \"Ordinary Love\", to the film Mandela: Long Walk to Freedom. The track, written in honour of Nelson Mandela, won the 2014 Golden Globe Award for Best Original Song. In November 2013, U2's long-time manager Paul McGuinness stepped down from his post as part of a deal with Live Nation to acquire his management firm, Principle Management. McGuinness, who had managed the group for over 30 years, was succeeded by Guy Oseary. In February 2014, another new U2 song, the single \"Invisible\", debuted in a Super Bowl television advertisement and was made available in the iTunes Store at no cost to launch a partnership with Product Red and Bank of America to fight AIDS. Bono called the track a \"sneak preview\" of their pending record."]}, {"page": "Coldplay", "response": ["In 2014, Ghost Stories saw the group collaborating with Paul Epworth. Producers Tim Bergling and Madeon were involved as well, which resulted in some tracks having a more \"danceable flavor\", especially the single \"A Sky Full of Stars\". Made available in 2015, A Head Full of Dreams featured producing and songwriting duo Stargate. Other long-time partners include Davide Rossi, Bill Rakho, Rik Simpson and Daniel Green. The latter three are referred as \"The Dream Team\" on Everyday Life (2019) and all four work with the band since Viva la Vida or Death and All His Friends. For their ninth album, Music of the Spheres (2021), Coldplay invited producer Max Martin. The song \"People of the Pride\" is noted for having an orchestral introduction inspired by a Beyoncé performance at the Global Citizen Festival, while \"Coloratura\" drew comparisons to Pink Floyd."]}, {"page": "Band Aid (band)", "response": ["*Paul Epworth – producer"]}]}}