{"wiki_id": "http://www.wikidata.org/entity/Q515506", "itemLabel": "Chris Irwin", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Irwin", "wikipedia_page": {"main": "Chris Irwin (born 27 June 1942 in Wandsworth, London) is a British former racing driver.  He participated in 10 Formula One World Championship Grands Prix, debuting on 16 July 1966.  He scored two championship points.\nIrwin's career was ended prematurely by an accident he sustained when driving a Ford P68 sports prototype during practice for the 1968 1000km Nürburgring endurance race. He lost control of the notoriously twitchy car at the Flugplatz, the P68 flipping end over end after landing on its tail following a jump. He suffered severe head injuries but eventually recovered. However, it prevented him from racing again.\nIrwin is still alive and reasonably well, but his whereabouts are largely unknown as he stays out of the public eye and away from motor racing events. In 2006 it was reported that he had become re-acquainted with a racing rival from the 1960s after a chance meeting in London, and that he sometimes still suffers flashbacks to his accident. Irwin was reported, however, to be in generally good condition.\nIn a rare appearance at a race meeting, Irwin attended the Thruxton Circuit's 40th anniversary celebrations in April 2008. A three-quarter page interview and a current photograph of him posing with old 1960s rivals and a Formula 2 car appeared in the June 2008 issue of Motor Sport magazine. He is currently living in rural Rutland in the UK.", "link_mentions": [{"page": "Nürburgring", "response": ["Although by no means the most fearsome, Flugplatz is perhaps the most aptly (although coincidentally) named and widely remembered. The name of this part of the track comes from a small airfield, which in the early years was located close to the track in this area. The track features a very short straight that climbs sharply uphill for a short time, then suddenly drops slightly downhill, and this is immediately followed by two very fast right-hand kinks. Chris Irwin's career was ended following a massive accident at Flugplatz, in a Ford 3L GT sports car in 1968. Manfred Winkelhock flipped his March Formula Two car at the same corner in 1980. This section of the track was renovated in 2016 after an accident in which a Nissan GTR flew over the fence and killed a spectator. The Flugplatz is one of the most important parts of the Nürburgring because after the two very fast right-handers comes what is possibly the fastest part of the track: a downhill straight called Kottenborn, into a very fast curve called Schwedenkreuz (Swedish Cross). Drivers are flat out for some time here."]}, {"page": "1966 British Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 Dutch Grand Prix", "response": ["This was the last Grand Prix for the Lotus 25. Chassis R4 being driven by Chris Irwin, was the same chassis used by Jim Clark to win the 1963 World Title.", "|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 Belgian Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 French Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 British Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 German Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 Canadian Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 Italian Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 United States Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 Mexican Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1968 Monaco Grand Prix", "response": ["Richard Attwood was promoted from Reg Parnell Racing to the BRM works team after Mike Spence's replacement, Chris Irwin, suffered career-ending head injuries at the 1000km Nürburgring endurance race. Brian Redman, who had produced a solid performance in the previous race by finishing third, was racing at the 1000 km Spa and was therefore replaced at Cooper by Lucien Bianchi. With the Indianapolis 500 taking place just five days after the grand prix, McLaren's Denny Hulme was busy flying back and forth to attend both the Monaco Grand Prix as well as qualifying at Indianapolis."]}, {"page": "1967 Formula One season", "response": ["|  Chris Irwin", "|  Chris Irwin", "|align=\"left\"|  Chris Irwin"]}, {"page": "1966 Formula One season", "response": ["|  Chris Irwin", "|align=\"left\"|  Chris Irwin"]}, {"page": "Piers Courage", "response": ["Signed by the BRM works Formula 1 team for 1967, alongside Chris Irwin, his wild driving style caused him to repeatedly crash out of races and his tendency to spin at crucial moments led to the team dropping him after the 1967 Monaco Grand Prix. He completed the remainder of the season concentrating on his alternative drive, as was common in the 1960s, in John Coombs's F2 McLaren M4A, finishing fourth in the unclassified drivers' championship. At the end of the season he purchased the car from Coombs. A good run in the McLaren during the winter Tasman Series, including a win at the last race, resulted in Tim Parnell offering a drive in his works-supported Reg Parnell Racing BRM team for 1968. In addition to a good run in F1 in 1968 – including points-scoring finishes in France and Italy – Courage also drove for old friend Frank Williams's F2 team. When Frank Williams Racing Cars decided to make the step up to F1 in 1969, Courage was their first choice as driver."]}, {"page": "Eifelrennen", "response": ["|1968 ||  Chris Irwin || Lola-Ford || Formula 2, Südschleife"]}, {"page": "Lotus 25", "response": ["In 1964, Reg Parnell Racing began racing the 25, using the BRM P56 V8 engine, with limited success. Chris Irwin placed Reg Parnell Racing's 25/33 hybrid 7th in its final World Championship race at the 1967 Dutch Grand Prix, scene of the model's debut five years earlier.", "| Chris Irwin"]}, {"page": "Mallory Park", "response": ["|  Chris Irwin"]}, {"page": "1968 24 Hours of Le Mans", "response": ["1968 would be a terrible year for racing accidents. As well as the career-ending injuries to Willy Mairesse and Mauro Bianchi at this race, a number of other Le Mans veterans were killed or seriously injured over the racing season. These included Ludovico Scarfiotti (Rossfeld hillclimb), Jo Schlesser (French Grand Prix), Brian Redman (injured at Belgian Grand Prix), Mike Spence (Indianapolis), Chris Irwin (Nürburgring) and the great Jim Clark at Hockenheim. Circuit safety would become a greater and greater priority at Le Mans and in motor-racing in the next few years."]}, {"page": "1967 24 Hours of Le Mans", "response": ["Also rewarded for their work with the Ford GT project, Lola Cars returned to Le Mans with the new T70. John Surtees had won the inaugural Can Am series in North America with a Chevrolet V8 engine. The Mk3 GT version was taken to Le Mans, now powered by an Aston Martin engine developing 450 bhp. Surtees had David Hobbs as co-driver, with a second car for Chris Irwin/Peter de Klerk", "|  Peter de Klerk Chris Irwin"]}, {"page": "Walkden", "response": ["*Chris Irwin, rugby player"]}, {"page": "1967 European Formula Two Championship", "response": ["|  Chris Irwin", "|  Chris Irwin", "|  Chris Irwin", "|align=\"left\"|  Chris Irwin"]}, {"page": "1964 British Formula Three season", "response": ["Runner Up: Chris Irwin", "|  Chris Irwin", "|  Chris Irwin"]}, {"page": "Ford P68", "response": ["This promise was never to be fulfilled. With Mike Spence's death during practice for the 1968 Indianapolis 500, fellow Brit Chris Irwin was drafted in for the P68's next race: the 1968 1000km Nürburgring. He was lucky to escape death when he lost control of his car at the Flugplatz during practice, although his injuries were severe enough for his career to be ended. The car was destroyed.Series of photos at 20832.com In the race, once again the remaining P68 failed to finish due to mechanical gremlins. This was to be the pattern during all the remaining races for which the P68 was entered during 1968. One tantalising highlight occurred when Frank Gardner, who performed much of the P68's limited developmental testing, took pole position at the 1000km Spa race. However, once again the car flattered to deceive, as it stuttered to a halt on the first lap of the race with faulty electrics. By this time the P68's faults were all too apparent, and Alan Mann Racing decided not to travel to the Zeltweg race.", "|  Chris Irwin", "|  Chris Irwin Pedro Rodríguez"]}, {"page": "Reg Parnell Racing", "response": ["|align=\"left\"|  Chris Irwin"]}, {"page": "1968 European Formula Two Championship", "response": ["|  Chris Irwin"]}, {"page": "Brabham Grand Prix results", "response": ["|align=\"left\"|  Chris Irwin"]}, {"page": "BRM Grand Prix results", "response": ["|align=\"left\"|  Chris Irwin", "|align=\"left\"|  Chris Irwin"]}, {"page": "Lotus Grand Prix results", "response": ["|style=\"text-align:left\"|  Chris Irwin"]}, {"page": "BRM P261", "response": ["Rather than sending the full works team down under for the 1967 Tasman Series season, BRM chose to lend their support to the private Reg Parnell Racing team. The Parnell team prepared two P261s, for works driver Stewart and previous year's race winner Richard Attwood. With the 2.1-litre V8 engine fitted, Stewart again made certain of a BRM victory in the season opening New Zealand GP. Despite scoring four straight podium finishes, Attwood was replaced by Piers Courage and Chris Irwin for the Australian rounds. Although Courage failed to make a mark, Irwin finished the season by taking third place in Longford. Stewart finished equal second in the series standings, but with fewer than half the points of Championship-winner Jim Clark.", "Parnell continued to run a 2.1-litre P261 for Chris Irwin and Piers Courage during the subsequent 1967 Formula One season, and Bernard White ran another for David Hobbs at the British and Canadian Grands Prix. However, with the P83 now the main works car, the Bourne works team only fielded a P261 twice in the World Championship, although Stewart did manage third place at the 1967 French Grand Prix in his.", "| Chris Irwin"]}, {"page": "1967 Tasman Series", "response": ["|align=\"left\"| Chris Irwin"]}, {"page": "Buenos Aires Grand Prix (motor racing)", "response": ["|  Chris Irwin"]}, {"page": "1967 BRDC International Trophy", "response": ["|  Chris Irwin"]}, {"page": "1967 Syracuse Grand Prix", "response": ["|  Chris Irwin"]}, {"page": "1966 Buenos Aires Grand Prix", "response": ["|  Chris Irwin", "|  Chris Irwin"]}, {"page": "1967 Australian Grand Prix", "response": ["|  Chris Irwin"]}, {"page": "1967 Race of Champions", "response": ["|  Chris Irwin", "|  Chris Irwin", "|  Chris Irwin", "* As well as his Lotus-BRM, Chris Irwin was entered in a Lola-BMW which was not used."]}, {"page": "1968 Deutschland Trophäe", "response": ["Lola driver Chris Irwin was following around 250 yards behind Clark when the accident happened. \"Suddenly Jim's car broke out,\" he said. \"It looked like something mechanical.\"", "|  Chris Irwin"]}]}}