{"wiki_id": "http://www.wikidata.org/entity/Q5158073", "itemLabel": "Conal Gregory", "itemDescription": "British politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Conal_Gregory", "wikipedia_page": {"main": "Conal Robert Gregory (born 11 March 1947) was Conservative Party (UK) Member of Parliament for York from 1983 to 1992, when he lost the seat to Labour Party candidate Hugh Bayley.\nHe was educated at King's College School, Wimbledon and the University of Sheffield. He is a Master of Wine and has worked for many years in the wine trade. He is the author of a number of publications on the subject. He became a journalist writing for the Financial Times, Guardian and was made the personal Financial Editor of the Yorkshire Post winning Regional Financial Journalist of the Year Award in 2016\n\n", "link_mentions": [{"page": "1983 United Kingdom general election", "response": ["|Conal Gregory"]}, {"page": "1992 United Kingdom general election", "response": ["|Conal Gregory"]}, {"page": "Hugh Bayley", "response": ["Hugh Bayley was nominated as the Labour candidate for York at the 1987 general election but was defeated by just 147 votes by the Conservative Conal Gregory. After the election, Hugh Bayley became a Health Economics Research Fellow at the University of York, and became a member of the local health authority.", "Conal Gregory and Hugh Bayley again fought it out at the 1992 general election in York and this time Bayley won by a comfortable margin. After his election he made his maiden speech on 7 May 1992 and joined the Health Select committee. The name of the York constituency was changed (though with unaltered boundaries) and Bayley won a majority of over 20,000 at the 1997 general election."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Conal Gregory"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Conal Gregory"]}, {"page": "City of York (UK Parliament constituency)", "response": ["| style=\"background-color: \" | || 1983 || Conal Gregory || Conservative"]}, {"page": "Alex Lyon (politician)", "response": ["He was defeated in the 1983 General Election by the Conservative Conal Gregory."]}, {"page": "Gregory (surname)", "response": ["* Conal Gregory"]}, {"page": "King's College School", "response": ["*Conal Gregory, (1947–) politician, MP for York"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Conal Gregory"]}, {"page": "Conal (given name)", "response": ["*Conal Gregory (born 1947), UK Conservative Party MP for York 1983–1992"]}]}}