{"wiki_id": "http://www.wikidata.org/entity/Q515966", "itemLabel": "Jessica Clarke", "itemDescription": "Association footballer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessica_Clarke", "wikipedia_page": {"main": "Jessica Anne Clarke (born 5 May 1989) is an English footballer who plays as a winger or forward for FA Women's Championship club Sheffield United and the England national team. After beginning her career with hometown team Leeds United (known as Leeds Carnegie between 2008 and 2010), Clarke joined Lincoln Ladies in 2010 and remained with the club when it re-branded as Notts County four years later. After six seasons at Notts County, Clarke signed for league rivals Liverpool in April 2017. Since making her senior England debut in 2009, Clarke has won over 50 caps. She has represented her country at two editions of the UEFA Women's Championship and at the 2011 FIFA Women's World Cup.\n\n", "link_mentions": [{"page": "Karen Carney", "response": ["In her late teens, Carney won FA Young Player of the Year in 2005 and 2006. In August 2009, she was named to Powell's national team squad for Euro 2009. In the semi-final win over the Netherlands, Powell utilised 20-year-old Jessica Clarke's pace and energy to tire the Dutch full-backs, before introducing substitute Carney to decisive effect."]}, {"page": "Rachel Yankey", "response": ["In May 2009, Yankey was one of the first 17 female players to be given central contracts by The Football Association. However, in August 2009 she was surprisingly left out of coach Hope Powell's 22–player squad for Euro 2009 with Powell believing that her form did not justify a call–up. Yankey was also overlooked for the 2011 Women's World Cup qualifiers against Malta and Turkey. But after a return to form with Arsenal Ladies, she was recalled by Powell for the 2010 Cyprus Cup and won her 90th and 91st caps – as a 76th-minute substitute for Jessica Clarke in a 1–0 win over South Africa and as a starter in a 1–0 defeat to Canada."]}, {"page": "UEFA Women's Euro 2009", "response": ["|FW ||21|| Jessica Clarke || ||"]}, {"page": "Jill Scott (footballer)", "response": ["In May 2009, Scott was one of the first 17 female players to be given central contracts by The Football Association. She was named in coach Hope Powell's squad for the 2009 UEFA Women's European Championships, scoring a late winner as England beat the Netherlands in the semi-final, having come on as a substitute for Jessica Clarke at the beginning of extra-time."]}, {"page": "2008 FIFA U-20 Women's World Cup squads", "response": ["| 11 ||align=left|Jessica Clarke ||align=left|  Leeds Carnegie ||align=left|  ||0 ||0 ||0 ||0 ||0"]}, {"page": "Gemma Davison", "response": ["Davison played for England regularly at Under-19, Under-21 and Under-23 level. In April 2009 she received her first call-up to the England senior squad. Her England debut came in July 2009 when she came on as a substitute for Jessica Clarke in the 2–0 defeat at home to Iceland."]}]}}