{"wiki_id": "http://www.wikidata.org/entity/Q51515", "itemLabel": "John Chadwick", "itemDescription": "English linguist and classical scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Chadwick", "wikipedia_page": {"main": "John Chadwick,  (21 May 1920 – 24 November 1998) was an English linguist and classical scholar who was most notable for the decipherment, with Michael Ventris, of Linear B.", "link_mentions": [{"page": "Asia", "response": ["The Mycenaean states were destroyed about 1200 BCE by unknown agents, though one school of thought assigns the Dorian invasion to this time. The burning of the palaces caused the  clay tablets holding the Mycenaean administrative records to be preserved by baking. These tablets were written in a Greek syllabic script called Linear B. This script was deciphered by a number of interested parties, most notably by a young World War II cryptographer, Michael Ventris, subsequently assisted by the scholar, John Chadwick."]}, {"page": "Bletchley Park", "response": ["A Middle East Intelligence Centre (MEIC) was set up in Cairo in 1939. When Italy entered the war in June 1940, delays in forwarding intercepts to Bletchley via congested radio links resulted in cryptanalysts being sent to Cairo. A Combined Bureau Middle East (CBME) was set up in November, though the Middle East authorities made \"increasingly bitter complaints\" that GC&CS was giving too little priority to work on Italian cyphers. However, the principle of concentrating high-grade cryptanalysis at Bletchley was maintained.Hinsley, Harry British Intelligence in the Second World War, Volume One: Its Influence on Strategy and Operations (1979, Her Majesty's Stationery Office, London) pp. 191221, 57072  John Chadwick started cryptanalysis work in 1942 on Italian signals at the naval base 'HMS Nile' in Alexandria. Later, he was with GC&CS; in the Heliopolis Museum, Cairo and then in the Villa Laurens, Alexandria.\"Life of John Chadwick : 1920 - 1998 : Classical Philologist, Lexicographer and Co-decipherer of Linear B\" , Faculty of Classics, Cambridge University"]}, {"page": "Demeter", "response": ["Though Demeter is often described simply as the goddess of the harvest, she presided also over the sacred law, and the cycle of life and death. She and her daughter Persephone were the central figures of the Eleusinian Mysteries, a religious tradition that predated the Olympian pantheon, and which may have its roots in the Mycenaean period c. 1400–1200 BC.John Chadwick, The Mycenean World. Cambridge University Press, 1976. One of the most notable Homeric Hymns, the Homeric Hymn to Demeter, tells the story of Persephone's abduction by Hades and Demeter's search for her.", "Demeter's character as mother-goddess is identified in the second element of her name meter () derived from Proto-Indo-European (PIE) *méh₂tēr (mother). In antiquity, different explanations were already proffered for the first element of her name. It is possible that Da (),. a word which corresponds to Gē  () in Attic, is the Doric form of De (), \"earth\", the old name of the chthonic earth-goddess, and that Demeter is \"Mother-Earth\". Liddell & Scott find this \"improbable\" and Beekes writes, \"there is no indication that [da] means \"earth\", although it has also been assumed in the name of Poseidon found in the Linear B inscription E-ne-si-da-o-ne, \"earth-shaker\"..R. S. P. Beekes.  Etymological Dictionary of Greek, Brill, 2009, p. 324.Adams, John Paul, Mycenean divinities – List of handouts for California State University Classics 315. Retrieved 7 March 2011. John Chadwick also argues that the dā element in the name of Demeter is not so simply equated with \"earth\".Chadwick, The Mycenaean World, Cambridge University Press, 1976, p. 87) \"Every Greek was aware of the maternal functions of Demeter; if her name bore the slightest resemblance to the Greek word for 'mother', it would inevitably have been deformed to emphasize that resemblance. [...] How did it escape transformation into *Gāmātēr, a name transparent to any Greek speaker?\" Compare the Latin transformation Iuppiter and Diespiter vis-a-vis *Deus pater."]}, {"page": "Decipherment", "response": ["|Michael Ventris, John Chadwick, and Alice Kober"]}, {"page": "Greek language", "response": ["Linear B, attested as early as the late 15th century BC, was the first script used to write Greek. It is basically a syllabary, which was finally deciphered by Michael Ventris and John Chadwick in the 1950s (its precursor, Linear A, has not been deciphered and most likely encodes a non-Greek language). The language of the Linear B texts, Mycenaean Greek, is the earliest known form of Greek."]}, {"page": "Hera", "response": ["The name of Hera has several possible and mutually exclusive etymologies; one possibility is to connect it with Greek ὥρα hōra, season, and to interpret it as ripe for marriage and according to Plato ἐρατή eratē, \"beloved\"LSJ s.v. ἐρατός. as Zeus is said to have married her for love.Plato, Cratylus, 404c According to Plutarch, Hera was an allegorical name and an anagram of aēr (ἀήρ, \"air\").On Isis and Osiris, 32 So begins the section on Hera in Walter Burkert's Greek Religion.Burkert, p. 131. In a note, he records other scholars' arguments \"for the meaning Mistress as a feminine to Heros, Master.\" John Chadwick, a decipherer of Linear B, remarks \"her name may be connected with hērōs, ἥρως, 'hero', but that is no help since it too is etymologically obscure.\"Chadwick, The Mycenaean World (Cambridge University Press) 1976:87. A. J. van Windekens,Windekens, in Glotta 36 (1958), pp. 309-11. offers \"young cow, heifer\", which is consonant with Hera's common epithet βοῶπις (boōpis, \"cow-eyed\"). R. S. P. Beekes has suggested a Pre-Greek origin.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 524. Her name is attested in Mycenaean Greek written in the Linear B syllabic script as  e-ra, appearing on tablets found in Pylos and Thebes,  as well in the Cypriotic dialect in the dative e-ra-i.Blažek, Václav. \"Artemis and her family\". In: Graeco-Latina Brunensia vol. 21, iss. 2 (2016). p. 47. ", "Though greatest and earliest free-standing temple to Hera was the Heraion of Samos, in the Greek mainland Hera was especially worshipped as \"Argive Hera\" (Hera Argeia) at her sanctuary that stood between the former Mycenaean city-states of Argos and Mycenae,Pausanias, Description of Greece 3.13.6Her name appears, with Zeus and Hermes, in a Linear B inscription (Tn 316) at Mycenean Pylos (John Chadwick, The Mycenaean World [Cambridge University Press] 1976:89). where the festivals in her honor called Heraia  were celebrated.  \"The three cities I love best,\" the ox-eyed Queen of Heaven declares in the Iliad, book iv, \"are Argos, Sparta and Mycenae of the broad streets.\" There were also temples to Hera in Olympia, Corinth, Tiryns, Perachora  and the sacred island of Delos. In Magna Graecia, two Doric temples to Hera were constructed at Paestum, about 550 BCE and about 450 BCE. One of them, long called the Temple of Poseidon  was identified in the 1950s as a second temple there of Hera.P.C. Sestieri, Paestum, the City, the Prehistoric Acropolis in Contrada Gaudo, and the Heraion at the Mouth of the Sele (Rome 1960), p. 11 etc. \"It is odd that there was no temple dedicated to Poseidon in a city named for him  (Paestum was originally called Poseidonia). Perhaps there was one at Sele, the settlement that preceded Paestum,\" Sarantis Symeonoglou suggested (Symeonoglou, \"The Doric Temples of Paestum\" Journal of Aesthetic Education, 19.1, Special Issue: Paestum and Classical Culture: Past and Present [Spring 1985:49-66] p. 50."]}, {"page": "Linear A", "response": ["Michael Ventris, who (with John Chadwick) successfully deciphered Linear B, also believed in a link between Minoan and Etruscan. The same perspective is supported by S. Yatsemirsky in Russia and Raymond A. Brown."]}, {"page": "Linear B", "response": ["The grid developed during decipherment by Michael Ventris and John Chadwick of phonetic values for syllabic signs is shown below.Ventris and Chadwick (1973), Fig. 4 on page 23 states the \"Proposed values of the Mycenaean syllabary\", which is mainly the same as the table included in this article. The \"grid\" from which it came, which was built up in \"successive stages\", is shown in Fig. 3 on page 20. (Note that \"q\" represents the labialized velar stops [ɡʷ, kʷ, kʷʰ], not a uvular stop of IPA.)", "Michael Ventris and John Chadwick performed the bulk of the decipherment of Linear B between 1951 and 1953. At first Ventris chose his own numbering method, but later switched to Bennett's system. His initial decipherment was achieved using Kober's classification tables, to which he applied his own theories. Some Linear B tablets had been discovered on the Greek mainland. Noticing that certain symbol combinations appeared only on the tablets found in Crete, he conjectured that these might be names of places on the island. This proved to be correct. Working with the symbols he could decipher from this, Ventris soon unlocked much text and determined that the underlying language of Linear B was in fact Greek. This contradicted general scientific views of the time, and indeed Ventris himself had previously agreed with Evans's hypothesis that Linear B was not Greek.", "* Ventris, Michael, and John Chadwick. 2008. Documents in Mycenaean Greek. 2nd ed. Cambridge, UK: Cambridge University Press."]}, {"page": "Michael Ventris", "response": ["Michael George Francis Ventris,  (; 12 July 1922 – 6 September 1956) was an English architect, classicist and philologist who deciphered Linear B, the ancient Mycenaean Greek script. A student of languages, Ventris had pursued decipherment as a personal vocation since his adolescence. After creating a new field of study, Ventris died in a car crash a few weeks before the publication of Documents in Mycenaean Greek, written with John Chadwick."]}, {"page": "Philology", "response": ["Linear B, a script used in the ancient Aegean, was deciphered in 1952 by Michael Ventris and John Chadwick, who demonstrated that it recorded an early form of Greek, now known as Mycenaean Greek. Linear A, the writing system that records the still-unknown language of the Minoans, resists deciphering, despite many attempts."]}, {"page": "Persephone", "response": ["In a Linear B Mycenaean Greek inscription on a tablet found at Pylos dated 1400–1200 BC, John Chadwick reconstructed the name of a goddess, *Preswa who could be identified with Perse, daughter of Oceanus and found speculative the further identification with the first element of Persephone. At Google Books. Persephonē (Greek: ) is her name in the Ionic Greek of epic literature. The Homeric form of her name is Persephoneia (Περσεφονεία, Persephoneia). In other dialects, she was known under variant names: Persephassa (), Persephatta (), or simply Korē (, \"girl, maiden\").H.G. Liddell and R. Scott, A Greek-English Lexicon On 5th century Attic vases one often encounters the form () Plato calls her Pherepapha () in his Cratylus, \"because she is wise and touches that which is in motion\". There are also the forms Periphona (Πηριφόνα) and Phersephassa (). The existence of so many different forms shows how difficult it was for the Greeks to pronounce the word in their own language and suggests that the name may have a Pre-Greek origin.Martin P. Nilsson (1967), Die Geschichte der Griechische Religion, Volume I, C.F. Beck Verlag, p. 474.", "There is evidence of a cult in Eleusis from the Mycenean period;G. Mylonas (1932). Eleusiniaka. I,1 ff however, there are not sacral finds from this period. The cult was private and there is no information about it. As well as the names of some Greek gods in the Mycenean Greek inscriptions, also appear names of goddesses, like \"the divine Mother\" (the mother of the gods) or \"the Goddess (or priestess) of the winds\", who don't have Mycenean origin . In historical times, Demeter and Kore were usually referred to as \"the goddesses\" or \"the mistresses\" (Arcadia) in the mysteries .Nilsson (1967), pp. 463–465 In the Mycenean Greek tablets dated 1400–1200 BC, the \"two queens and the king\" are mentioned. John Chadwick believes that these were the precursor divinities of Demeter, Persephone and Poseidon.John Chadwick (1976).The Mycenean World. Cambridge University Press"]}, {"page": "Pylos", "response": ["In addition to the archaeological remains of the palace, Blegen also found there thousands of clay tablets with inscriptions written in Linear B, a syllabic script used between 1425 and 1200 BC for writing Mycenaean Greek. Pylos is the largest source in Greece of these tablets with 1,087 fragments found on the site of the Nestor's Palace. In 1952, when self-taught linguist Michael Ventris and John Chadwick deciphered the script, Mycenaean Greek turned out to be the earliest attested form of Greek, some elements of which have survived in the language of Homer thanks to a long oral tradition of epic poetry.John Chadwick (1990) [1958]. The Decipherment of Linear B (2nd ed.). Cambridge UP.  Thus, these clay tablets, generally used for administrative purposes or for recording economic transactions, clearly demonstrate that the site itself was already called \"Pylos\" by its Mycenaean inhabitants (Pulos in Mycenaean Greek; attested in Linear B as 30x30px30x30px pu-ro, ). "]}, {"page": "Paean", "response": ["In Homer, PaeonMycenaean Greek , pa-ja-wo-ne /pajāwonei/ (dat.), written in Linear B and attested on the KN V 52 tablet found at Mycenaean Knossos, attests the name as referring to an individual Mycenaean deity. See John Chadwick, The Mycenaean World [Cambridge University Press] 1976, p. 88). was the Greek physician of the gods. In Iliad V he heals the wounded Ares and Hades with his herbal lore. In time Paeon (or Paean) became an epithet (\"byname\") of Apollo as a god capable of bringing disease and propitiated as a god of healing. Hesiod identifies Paeon as a separate god, and in later poetry Paeon is invoked independently as a health god. Later, Paean becomes a byname of Asclepius, another healer-god.Eustathius on Homer §1494; Virgil, Aeneid vii. 769."]}, {"page": "History of Crete", "response": ["By about the 15th century BC a massive volcanic explosion known as the Minoan eruption blew the island of Thera apart, casting more than four times the amount of ejecta as the explosion of Krakatoa and generating a tsunami in the enclosed Aegean that threw pumice up to 250 meters above sea level onto the slopes of Anaphi, 27 km to the east. Any fleet along the north shore of Crete was destroyed and John Chadwick suggests that the majority of Cretan fleets had kept the island secure from the Greek-speaking mainlanders. The sites, save Knossos, were destroyed by fires. Mycenaeans from the mainland took over Knossos, rebuilding some parts to suit them. They were in turn subsumed by a subsequent Dorian migration."]}, {"page": "Perseus", "response": ["The further origin of perth- is more obscure. J. B. Hofmann lists the possible root as *bher-, from which Latin ferio, \"strike\". This corresponds to Julius Pokorny’s *bher-(3), \"scrape, cut.\" Ordinarily *bh- descends to Greek as ph-. This difficulty can be overcome by presuming a dissimilation from the –th– in pérthein, which the Greeks would have preferred from a putative *phérthein. Graves carries the meaning still further, to the perse- in Persephone, goddess of death. John Chadwick in the second edition of Documents in Mycenaean Greek speculates about the Mycenaean goddess  pe-re-*82, attested on the PY Tn 316 tablet (Linear B: ) and tentatively reconstructed as *Preswa."]}, {"page": "Corpus Christi College, Cambridge", "response": ["|John Chadwick"]}, {"page": "East Sheen", "response": ["* John Chadwick FBA (1920–1998), linguist and classical scholar, was born in East Sheen."]}, {"page": "Sea Peoples", "response": ["Subsequent critical analysis focused on the fact that the destructions were not simultaneous and that all the evidence of Dorians comes from later times. John Chadwick championed a Sea Peoples hypothesis,Chadwick, p. 178. which asserted that, since the Pylians had retreated to the northeast, the attack must have come from the southwest, the Sea Peoples being, in his view, the most likely candidates. He suggests that they were based in Anatolia and, although doubting that the Mycenaeans would have called themselves \"Achaeans\", speculates that \"it is very tempting to bring them into connexion.\" He does not assign a Greek identity to all of the Sea Peoples.", "Although some advocates of the Philistine or Greek migration hypotheses identify all the Mycenaeans or Sea Peoples as ethnically Greek, John Chadwick (founder, with Michael Ventris, of Linear B studies) adopts instead the multiple ethnicity view."]}, {"page": "Dorian invasion", "response": ["Ernst Risch lost no time in proposing that there was never more than one migration, which brought Proto-Greek into Greece. Proto-Greek is the assumed last common ancestor of all known varieties of Greek and then dissimilated into dialects within Greece. The argument is summarized, and Risch is cited, in .  Meanwhile, the linguists closest to the decipherment were having doubts about the classification of Proto-Greek. John Chadwick summarizing in 1976 wrote:Let us therefore explore the alternative view. This hypothesis is that the Greek language did not exist before the twentieth century B.C., but was formed in Greece by the mixture of an indigenous population with invaders who spoke another language .... What this language was is a difficult question ... the exact stage reached in development at the time of the arrival is difficult to predict."]}, {"page": "1920 in the United Kingdom", "response": ["** John Chadwick, cryptanalyst and classical scholar (died 1998)"]}, {"page": "Mycenaean Greek", "response": ["Such theories are also connected with the idea that the Mycenaean language constituted a type of a special koine representing the official language of the palace records and the ruling aristocracy. When the 'Mycenaean linguistic koine' fell into disuse after the fall of the palaces because the script was no longer used, the underlying dialects would have continued to develop in their own ways. That view was formulated by Antonin Bartonek.Bartoněk, Antonín, Greek dialectology after the decipherment of Linear B. Studia Mycenaea : proceedings of the Mycenaean symposium, Brno, 1966. Bartoněk, Antonín (editor). Vyd. 1. Brno: Universita J.E. Purkyně, 1968, pp. [37]-51BARTONEK, A. 1966 'Mycenaean Koine reconsidered', Cambridge Colloquium on Mycenaean Studies' (CCMS) ed. by L. R. Palmer and John Chadwick, C.U.P. pp.95-103 Other linguists like Leonard Robert Palmer (1980),Palmer, L.R. (1980), The Greek Language, London. and :de:Yves Duhoux (1985)Duhoux, Y. (1985), ‘Mycénien et écriture grecque’, in A. Morpurgo Davies and Y. Duhoux (eds.), Linear B: A 1984 Survey (Louvain-La-Neuve): 7–74 also support this view of the 'Mycenaean linguistic koine'.Stephen Colvin, ‘The Greek koine and the logic of a standard language’, in M. Silk and A. Georgakopoulou (eds.) Standard Languages and Language Standards: Greek, Past and Present (Ashgate 2009), 33-45 (The term 'Mycenaean koine' is also used by archaeologists to refer to the material culture of the region.) However, since the Linear B script does not indicate several possible dialectical features, such as the presence or absence of word-initial aspiration and the length of vowels, it is unsafe to extrapolate that Linear B texts were read as consistently as they were written.", "*Ventris, Michael, and John Chadwick. 2008. Documents in Mycenaean Greek. 2nd ed. Cambridge, UK: Cambridge University Press."]}, {"page": "Safflower", "response": ["Chemical analysis of ancient Egyptian textiles dated to the Twelfth Dynasty (1991–1802 BC) identified dyes made from safflower, and garlands made from safflowers were found in the tomb of the pharaoh Tutankhamun. John Chadwick reports that the Greek name for safflower (, ) occurs many times in Linear B tablets, distinguished into two kinds: a white safflower (ka-na-ko re-u-ka, , ), which was measured, and red (ka-na-ko e-ru-ta-ra, , ) which was weighed. \"The explanation is that there are two parts of the plant which can be used; the pale seeds and the red florets.\"John Chadwick, The Mycenaean World (Cambridge: University Press, 1976), p. 120"]}, {"page": "Ancient Greek literature", "response": ["This period of Greek literature stretches from Homer until the fourth century BC and the rise of Alexander the Great. The earliest known Greek writings are Mycenaean, written in the Linear B syllabary on clay tablets. These documents contain prosaic records largely concerned with trade (lists, inventories, receipts, etc.); no real literature has been discovered. \"The glimpse we have suddenly been given of the account books of a long-forgotten people...\" Michael Ventris and John Chadwick, the original decipherers of Linear B, state that literature almost certainly existed in Mycenaean Greece, but it was either not written down or, if it was, it was on parchment or wooden tablets, which did not survive the destruction of the Mycenaean palaces in the twelfth century BC."]}, {"page": "Thebes tablets", "response": ["The Thebes tablets, with inscriptions in Mycenaean Greek using Linear B, were discovered in Thebes, Greece. They belong to the Late Helladic IIIB context, contemporary with finds at Pylos. A first group of 21 fragments was found in the 1963–64 campaign;They were published by John Chadwick in Minos 10 1970:115-37. A further 19 tablets were found in 1970 and 1972.Theodoros G. Spyropoulos and John Chadwick. The Thebes Tablets II (Salamanca: Universitad de Salamanca) 1975. Using Near Eastern cylinder seals associated with the finds, the editors of the published corpus of the whole archive now date the destruction of the Kadmeion, the Mycenaean palace complex at Thebes, and thus the writing of the tablets, some of which were still damp when they were unintentionally fired, to shortly after 1225 BC. Chadwick identified three recognizable Hellenic divinities, Hera, Hermes and Potnia \"Mistress\", among the recipients of wool. He made out a case for ko-ma-we-te-ja, also attested at Pylos, as the name of a goddess."]}, {"page": "A Greek–English Lexicon", "response": ["LSJ was the basis of the project of John Chadwick and James Diggle at Cambridge to publish the Cambridge Greek Lexicon of 2021. Initially conceived as a mere update of LSJ, the editors eventually decided to start afresh since they considered LSJ \"too antiquated in concept, design and content\". The Cambridge Greek Lexicon uses contemporary language for its definitions and, unlike the LSJ, no longer elides the meaning of words considered offensive in Victorian times."]}, {"page": "List of University of Cambridge people", "response": ["*John Chadwick (Corpus Christi)"]}, {"page": "Robert Bacher", "response": ["In the second year of his National Research Council Fellowship, Bacher moved across the country to the Massachusetts Institute of Technology to work with John C. Slater, who had taught Bacher at Harvard. While there, Slater asked him to conduct a seminar on John Chadwick's recent discovery of the neutron. Reading Chadwick's paper, he realized that anomalies in then-current theory would be resolved if the spin of the neutron was ½. This became the subject of a letter he submitted to the Physical Review with visiting scholar Edward Condon.  A year later, Bacher became the first to suggest the neutron had a magnetic moment equal to about minus one nuclear magneton, based on the unusually small magnetic moment of nitrogen determined from its hyperfine structure."]}, {"page": "Darwin from Insectivorous Plants to Worms", "response": ["Darwin's Westminster Abbey funeral expressed a public feeling of national pride, with the Pall Mall Gazette proclaiming that Great Britain had \"lost a man whose name is a glory to his country\". Religious writers of all persuasions praised his \"noble character and his ardent pursuit of truth\", calling him a \"true Christian gentleman\". In particular the Unitarians and free religionists, proud of his Dissenting upbringing, supported his naturalistic views. William Benjamin Carpenter carried a resolution praising Darwin's unravelling of \"the immutable laws of the Divine Government\", shedding light on \"the progress of humanity\". The Unitarian preacher John Chadwick from New York wrote that \"The nation's grandest temple of religion opened its gates and lifted up its everlasting doors and bade the King of Science come in.\""]}]}}