{"wiki_id": "http://www.wikidata.org/entity/Q5168102", "itemLabel": "Coote Hedley", "itemDescription": "Soldier, engineer, and sportsman (1865-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Coote_Hedley", "wikipedia_page": {"main": "Colonel Sir Walter Coote Hedley  (12 December 1865 – 27 December 1937) was a British Army officer who began his career in the Royal Engineers and later moved into military intelligence. He was also a gifted amateur sportsman who played first-class cricket for several County Championship sides and competed to a high level in rackets and golf.\nHedley was commissioned into the Royal Engineers in 1884. He became a surveyor in the 1890s and was attached to the Ordnance Survey. This work was interrupted by service in South Africa throughout the Second Boer War, and from 1906 to 1908 by his appointment as an advisor to the Survey of India. In 1911 he was appointed to command MO4, also known as the Geographical Section of the General Staff. During the First World War this organisation was responsible for producing all the maps required by British Empire forces around the world, and in particular mapping the ever-changing trench system on the Western Front. Following the end of the war, he retired from the army in 1920. He was also a Fellow of the Royal Geographical Society and served on the society's council.\nHedley's first-class cricket career began in 1888 with the Gentlemen of England and Kent County Cricket Club. The majority of his county matches were for Somerset County Cricket Club whom he first represented in 1886 in non-first-class games. His first County Championship games for them were in 1892, and he had a regular place in the side from June of that year. Hedley was also a useful rackets player—reaching the final of the amateur championships, held at the Queen's Club, in 1890. In later life he turned to golf, playing off a scratch handicap.", "link_mentions": [{"page": "1937", "response": ["* December 27 – Sir Coote Hedley, British army officer and sportsman (b. 1865)"]}, {"page": "Charles Close", "response": ["Close served as head of MO4, the Geographical Section of the General Staff, at the War Office until 1911, when he handed over to Lieutenant-Colonel Walter Coote Hedley."]}, {"page": "1937 in the United Kingdom", "response": ["* 27 December – Sir Coote Hedley, army officer and sportsman (born 1865)"]}, {"page": "James Fellowes (cricketer)", "response": ["He was employed by the Ordnance Survey in Southampton and in March 1883 was elected a Fellow of the Royal Astronomical Society.Meeting of the Royal Astronomical Society, Astronomical register, vol. 21, pp. 75–82, 9 March 1883. Retrieved 2017-06-19. His daughter Anna, married Walter Coote Hedley who also served in the Royal Engineers and later joined the Ordnance Survey.Lewis P (2013) For Kent and Country, pp. 203–206. Brighton: Reveille Press. Fellowes died in Castle House in Dedham, Essex on 3 May 1916 aged 74. He is buried in the churchyard of St John the Evangelist at Hale, Surrey."]}, {"page": "Walter Hedley", "response": ["#REDIRECT Coote Hedley"]}, {"page": "Walter Coote Hedley", "response": ["#REDIRECT Coote Hedley"]}, {"page": "William Collins (cricketer, born 1868)", "response": ["Collins made a single first-class appearance for Middlesex in the 1892 County Championship against Somerset at the County Ground, Taunton. He was dismissed twice in the match for ducks, firstly by Coote Hedley in Middlesex's first-innings and then by George Nichols in their second."]}, {"page": "Hedley (surname)", "response": ["* Colonel Sir Walter Coote Hedley (1865–1937), English army officer and amateur cricketer"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Coote Hedley (1890–1892)"]}, {"page": "Rosalind Heywood", "response": ["Heywood was born in Gibraltar, the daughter of Coote Hedley and his wife Anna, and attended the University of London. In 1938, Heywood joined the Society for Psychical Research. She is most well known for her book The Sixth Sense (1959) and her autobiography, The Infinite Hive (1964). Heywood would later become the Vice-President of the SPR. The psychical researcher Renée Haynes wrote that her books have \"illuminated the subject matter of parapsychology for thousands of readers inside the Society and beyond.\"Haynes, Renée. (1982). The Society for Psychical Research, 1882-1982: A History. Macdonald. p. 207. "]}, {"page": "1915 Birthday Honours", "response": ["*Colonel Walter Coote Hedley, General Staff, War Office."]}, {"page": "1917 Birthday Honours", "response": ["*Colonel Walter Coote Hedley, ."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Coote Hedley (1890–1893) : W. C. Hedley ()"]}]}}