{"wiki_id": "http://www.wikidata.org/entity/Q5165820", "itemLabel": "Control", "itemDescription": "chraracter by John le Carré", "wikipedia_url": "https://en.wikipedia.org/wiki/Control_(fictional_character)", "wikipedia_page": {"main": "Control is a fictional character created by John le Carré.  Control is an intelligence officer who acts as the head of \"The Circus\" (Cambridge Circus, London), the British overseas intelligence agency. He is a character in the novels The Spy Who Came in from the Cold, The Looking Glass War and Tinker Tailor Soldier Spy, and is referred to in several others, usually by association with le Carré's recurring protagonist George Smiley, who has served as Control's right-hand man.\n\"Control\" is a nom de guerre; the character's real name is never given, and it is suggested that he successfully kept his true identity secret even from his inner circle of advisors, also that he has a wife who believes him to be a minor civil servant in the Ministry of Agriculture and Fisheries. In the original screenplay for the film adaptation of Tinker Tailor Soldier Spy, Smiley muses that Control had once told him that Howard Staunton was the greatest chess master Britain had ever produced. \"Staunton\" later turns out to be the name that Control used for the rental of a flat he uses.\nThe real chief of the Secret Intelligence Service (the equivalent of Le Carre's Circus) is known by a similar name: \"C\". This originates from the initial used by Captain Sir Mansfield Smith-Cumming, RN, an early chief of the service, who signed his letters \"C\" in green ink. This custom has been upheld throughout the history of the service.", "link_mentions": [{"page": "The Spy Who Came in from the Cold", "response": ["Alec Leamas, a former SOE operative during World War II who fought in the Nazi-occupied Netherlands and Norway,The Spy Who Came In from the Cold, p. 65. is recalled from his posting as Station Head of Berlin Station, West Berlin's operational branch of the Circus, and returns to London in despair after watching the death of his final undercover operative, Karl Riemeck, a member of the praesidium in East Germany's Socialist Unity Party, at the hands of Hans-Dieter Mundt. Mundt, formerly a lower level intelligence operative who is known to the Circus for his involvement in the murder of Foreign Office official Samuel Fennan a few years earlier, has risen to become the head of the East German Abteilung on account of his brilliant counter-intelligence aptitude, a skill demonstrated with his liquidation of Leamas' entire network. Finding himself with no operatives left, Leamas visits Circus chief Control and expresses a desire to get out of the intelligence community and \"come in from the cold\". Control asks him to instead stay \"in the cold\" for one last mission: defect to East Germany and frame Mundt as a double agent for SIS. Mundt's deputy, Jens Fiedler, Control explains, is beginning to believe that Mundt may be a turncoat, and could be a useful target for Leamas in this endeavour. In exchange for this, Leamas will keep anything he makes on the mission, in addition to a pension pot, and will be granted leave to retire from the service.", "In order to convince the East Germans' of Leamas' potential defection, the Circus demotes Leamas to the finance department, where he starts to exhibit signs of alcoholism. He eventually is sacked abruptly on rumours he was stealing money from the Circus' accounts to support the small pension he was granted by his superiors, and is forced to go on the dole. Eventually he takes a job in a small run-down library, whilst living in a low quality flat. Whilst there, he meets Liz Gold, the secretary of her local Communist Party of Great Britain organisation, and the two gradually strike up a friendship, and eventually become lovers. After a period of illness reveals the extent of Liz's feelings for him, Leamas confides in her that a day is coming where he will say goodbye and she must not look for him. A few days later, he says goodbye, and takes the \"final plunge\" into Control's plan, getting arrested for assault and sentenced to three months in prison. Before fully involving himself in the scheme, he makes Control promise to leave Liz alone and out of the remit of the Circus.", "* Control: Head of The Circus", "Writing in the Daily Telegraph, spy writer Jon Stock wrote: 'The plot of The Spy Who Came In from the Cold is assembled with more precision than a Swiss watch. The heartless way in which Alec Leamas is manipulated; Control's ruthless playing of Mundt and Fiedler; and of course the dramatic ending on the Berlin Wall, immortalised in the film starring Richard Burton. My favourite le Carré, it gets better with each re-read.'"]}, {"page": "Control", "response": ["Control may refer to:", "* Control (management), an element of management", "* Control, an element of management accounting", "* Controlling interest, a percentage of voting stock shares sufficient to prevent opposition", "* Control (optimal control theory), a variable for steering a controllable system of state variables toward a desired goal", "* Controlling for a variable, in statistics", "* Control network, in geodesy and surveying, a set of reference points of known geospatial coordinates", "* Control room, a room where a physical facility can be monitored", "* Control, according to the ICD-10-PCS, in the Medical and Surgical Section (0), is the root operation (# 3) that means stopping, or attempting to stop, post-procedural bleeding", "** Chlordiazepoxide, also sold under the trade name Control", "** Lorazepam, sold under the trade name Control", "* Control character, or non-printing character, in a character set; does not represent a written symbol, but is used to control the interpretation or display of text", "* Control engineering, a discipline of modeling and controlling of systems", "* Control system, the ability to control some mechanical or chemical equipment", "* Control theory, the mathematical theory about controlling dynamical systems over time", "* Control flow, means of specifying the sequence of operations in computer programs", "* Control key, on a computer keyboard", "* Control (psychology)", "* Control freak, a person who attempts to dictate", "* Control (political), Civilian control of the military", "* Control point (orienteering), a marked waypoint in orienteering and related sports", "* Control (linguistics), a relation between elements of two clauses", "* Control, Alberta", "* Control (novel), a 1982 novel by William Goldman", "* Control (fictional character), in the 1974 British spy novel Tinker, Tailor, Soldier, Spy", "* Control (1987 film) or , a 1987 made-for-television film starring Burt Lancaster", "* Control (2004 film), starring Ray Liotta, Willem Dafoe and Michelle Rodriguez", "* Control (2005 film), an Australian short written and directed by Jon Cohen", "* Control (2007 film), a film about Joy Division singer Ian Curtis, directed by Anton Corbijn", "* Control (2013 film), a Chinese–Hong Kong film written and directed by Kenneth Bi", "* Kontroll, a 2003 Hungarian film, released as Control internationally", "* Control, a UK comedy short by Frank Miller", "* Control (House), a 2005 episode of the television series House", "* Control, a Spanish-language series aired on Univision", "* Control, a recurring character in the sketch programme A Bit of Fry & Laurie", "* Control, a character on the science fiction crime drama Person of Interest", "* [C] - The Money of Soul And Possibility Control, or [C] - Control, a 2011 anime", "* Control and control-bid, features of the game contract bridge", "* Control (video game), a 2019 video game by Remedy Entertainment", "* Control (Starlight Express), a character from the rock musical", "* Control (GoodBooks album), 2007", "* Control (Janet Jackson album), 1986", "* Control (Pedro the Lion album), 2002", "* Control, a 2011 album by Abandon", "* Control, a 2014 album by The Brew", "* Control, a 1981 album by Conrad Schnitzler", "* Control, a 2013 EP by Disclosure", "* Control, a 1994 album by Hellnation", "* Control, a 2012 EP by The Indecent", "* Control, a 1971 album by John St Field", "* Control, a 2012 album by Uppermost", "* Control, a 2003 album by Where Fear and Weapons Meet", "* \"Control\" (Big Sean song), 2013", "* \"Control\" (Garbage song), 2012", "* \"Control\" (Janet Jackson song), 1986", "* \"Control\" (Kid Sister song), 2007", "* \"Control\" (Matrix & Futurebound song), 2013", "* \"Control\" (Metro Station song), 2007", "* \"Control\" (Mutemath song), 2004", "* \"Control\" (Poe song), 1998", "* \"Control\" (Puddle of Mudd song), 2001", "* \"Control\" (Traci Lords song), 1994", "* \"Control\" (Zoe Wees song), 2020", "* \"Control\", by Basement from Colourmeinkindness, 2012", "* \"Control\", by the Black Dahlia Murder from Everblack, 2013", "* \"Control\", by Delta Goodrem from Child of the Universe, 2012", "* \"Control\", by Disclosure from The Face, 2012", "* \"Control\", by División Minúscula, 2008", "* \"Control\", by Earshot from Two, 2004", "* \"Control\", by Feder, 2018", "* \"Control\", by Halsey from Badlands, 2015", "* \"Control\", by London Grammar Truth Is a Beautiful Thing, 2017", "* \"Control\", by Metro Station from Metro Station, 2007", "* \"Control\", by Poe from Haunted, 2000", "* \"Control\", by Stabbing Westward from Ungod, 1994", "* \"Control\", by Wisin from El Regreso del Sobreviviente, 2014", "* \"Control (Somehow You Want Me)\", by Tenth Avenue North from Followers, 2016", "* Control point (disambiguation)", "* Control unit (disambiguation)", "* Controller (disambiguation)"]}, {"page": "Tinker Tailor Soldier Spy", "response": ["As the tension of the Cold War is peaking in 1973, George Smiley, former senior official in Britain's Secret Intelligence Service (known as \"the Circus\" because its London office is at Cambridge Circus), is living unhappily in forced retirement, following the failure of an operation codenamed Testify in Czechoslovakia which ended in the capture and torture of agent Jim Prideaux. Control, chief of the Circus, had suspected that one of the five senior intelligence officers at the Circus was a Soviet mole, and had assigned them code names for Prideaux to relay back to the Circus, derived from the English children's rhyme \"Tinker, Tailor\":Tinker, tailor,", "The failure resulted in the dismissal of Control, Smiley, and allies such as Connie Sachs and Gerald Westerby, and their replacement by a new guard consisting of Percy Alleline, Toby Esterhase, Bill Haydon, and Roy Bland. Control has since died, and Smiley's former protege, Peter Guillam, has been demoted to the \"scalphunters\".", "Smiley examines Operation Witchcraft, an operation in which Soviet intelligence was obtained through a key source \"Merlin\", which was treated with suspicion by both Smiley and Control. Alleline obtained ministerial support to circumvent Control's authority, and his post-Testify promotion supporters Haydon, Esterhase, and Bland have sponsored it. Smiley also learns that this 'The Magic Circle' have obtained a safe house somewhere in London where they obtain information from a Merlin emissary posted in London under a diplomatic cover, whom Smiley concludes is Polyakov himself.", "Smiley suspects a link between Merlin and the botched Operation Testify. Sam Collins, who was duty officer that night, tells Smiley that Control ordered him to relay the report of the Czech operation only to him, but that when he did so, Control froze up, and that Bill Haydon's sudden arrival was the only reason the hierarchy didn't fall apart that night. Smiley then visits Max, a Czech operative who served as a legman for Jim on the operation, who tells Smiley that Prideaux gave him instructions to leave Czechoslovakia any way he could if Jim didn't surface at the rendezvous at the appointed time. Next, Smiley pays a visit to Jerry Westerby, who tells Smiley of his trip to Prague where he picked up a story about Jim by a young army conscript, who insisted that the Russians were in the woods waiting a full day before the ambush.", "Finally, Smiley tracks down Prideaux. Prideaux tells him Control believed there was a mole in the Circus, and had whittled it down to five men, Alleline (Tinker), Haydon (Tailor), Bland (Soldier), Esterhase (Poorman), and Smiley himself (Beggarman), and that his orders were to obtain the identity from a defector in Czech intelligence who knew. He tells Smiley he almost didn't make the rendezvous with Max because he noticed he was being tailed, and that when he arrived to meet the defector, he was ambushed, taking two bullets to his right shoulder. During his captivity, both Polyakov and Karla interrogated him, focussing solely on the extent and status of Control's investigation. Prideaux suggests that the Czech defector was a plant, contrived by Karla to engineer Control's downfall through Testify's failure, all conceived to protect the mole.", "* Sir Percy Alleline: Chief of the Circus following Control's ousting. Alleline spent his early career in South America, northern Africa and India. He is seen to be vain and overambitious, and is despised by Control. Alleline is knighted in the course of the book in recognition of the quality of the intelligence provided by the source codenamed Merlin. A Lowland Scot, son of a Presbyterian minister, Alleline came to the Circus from a City company.Tinker Tailor Soldier Spy, John le Carré, Sceptre, 2011, pp. 148-149", "* Control: Former head of the Circus and now dead. Before the war he was a Cambridge don.", "| Agents who handle assassination, blackmail, burglary, kidnapping; the section was sidelined after Control's dismissal."]}, {"page": "George Smiley", "response": ["Smiley next reappears as a minor but pivotal character in The Spy Who Came In from the Cold, his third novel. Smiley is revealed to have come back into the service of the Circus as the top aide to Control, Maston's mysterious successor as the Circus' chief. It's revealed that, following the events of Call for the Dead, Smiley and Guillam succeeded in turning Mundt, the sole survivor of the spy ring, into a British double agent, and sent him back to East Germany. Fearing that Mundt's cover is about to be blown, Smiley and Control manipulate agent Alec Leamas into posing as a defector and sending him to Germany under the assumption that he is going to orchestrate Mundt's death. Along the way, Smiley learns that Leamas blew his own cover to his girlfriend, a nineteen-year-old communist sympathiser named Liz Gold, and arranges to incorporate her into the plot. Although Liz's unwitting role ultimately ensures the mission's success, it also results in her death, prompting a grief-stricken Leamas to give up and let himself be shot dead at the Berlin Wall as Smiley attempts to extricate him.", "Smiley plays a small but pivotal role in The Looking Glass War, le Carré's fourth novel, occupying the \"North European desk\" at the Circus. He appears sporadically throughout the book as a liaison to The Department, a military intelligence agency, which attempts to surreptitiously conduct a dangerous and unnecessary operation without the Circus' knowledge. Smiley's appearance here is notable in that War is the only book of the series to depict his and Control's personal relationship in great detail. The climax of the novel bears witness to Smiley's ruthlessness, as he is dispatched by the Circus to end the Department's operation and force the abandonment of a Department employee to ameliorate the damage they have caused.", "Several years pass between Smiley's appearance in The Looking Glass War, set circa 1964, and Tinker Tailor Soldier Spy, which takes place in 1973. During this period, Smiley's position in the Circus comes to be threatened by his contemporary Bill Haydon, proteges Toby Esterhase and Roy Bland, and ambitious newcomer Percy Alleline. Alleline develops a personal feud with Control due to the latter's class and ethnic prejudice against Percy's Scottish heritage, prompting factions to form within the Circus, with Control, Smiley, and Peter Guillam on one side and Alleline, Haydon, Esterhase, and Bland on the other. When Control is eased out of the Circus in late 1972 after the capture of agent Jim Prideaux in Czechoslovakia, Smiley too is forced out. The Circus is taken over by Alleline, with Haydon running \"London Station\", a branch overseeing all of the service's spy networks. Guillam remains in the Circus as Smiley's sole resource/ally, albeit in a greatly diminished position."]}, {"page": "The Honourable Schoolboy", "response": ["* Mrs. Matthews – unofficial widow of Control"]}, {"page": "The Looking Glass War", "response": ["During the early 1960s, the formerly renowned British military intelligence organisation known colloquially as \"The Department\" is floundering. Surviving on long past memories of its aerial reconnaissance missions during the Second World War the organisation has been reduced to a skeleton crew consisting of Leclerc, a nostalgic former air commander who now languishes in bureaucracy as Director, John Avery, his 32 year old aide who took the job after failing as a publisher, Taylor, an elderly man who views the job as his last chance at glory, and Haldane, a pompous intellectual in ailing health whose research on the Soviet Union and East Germany has been the sole reason for departmental funding from Whitehall. Languishing in the mundanity of bureaucratic battles and inconsequential desk work, the organisation desperately desire the opportunity to regain their standing in the intelligence community, as well as to gain a one up against their now superior rivals in the Circus, headed by chief \"Control\" and his second-in-command, George Smiley. ", "During his first transmission, Leiser again falls under the strain of the operation and forgets to change frequency regularly whilst transmitting on account of the death of the border guard. As a result he spends 6 minutes on the frequency slowly transmitting, instead of the maximum of two. Combined with his old equipment, this quickly alerts the East Germans, who converge on his hotel. News reaches Smiley and Control of the situation, and the conversation strongly implies Leiser's failure may have been engineered by Control.", "Now fully aware of the Department's plan, Smiley is sent by Control to bring The Department's men stationed in West Germany  back to London and terminate the operation. Smiley explains that Leiser's total ineptitude,  combined with his old equipment, will make it easier for him to say he is not a spy. Leclerc and Haldane are tempted further by an extension of The Department's research section at the Circus with more funding, whilst only Avery weeps bitterly about the mission's failure. Having successfully escaped the hotel, Leiser takes refuge with the girl he met. The police encircle him and storm the apartment, the last time that Leiser is seen.", "* Control: Director (\"operational control\") of The Circus."]}, {"page": "Bill Haydon", "response": ["After the war, Haydon holds positions of increasing importance in the Circus, becomes its premier expert on the Soviet Union, and eventually rises to the senior staff of Control, the unnamed Chief of the Circus. In the early years of the Cold War, he limits his espionage activities to 'selected gifts of intelligence' that advance the Soviet cause over the American one without harming British interests. The Suez crisis of 1956 convinces him that Britain has lost all influence as a world power and leads him to become a 'full-time Soviet mole with no holds barred.' In 1961, he formally receives Soviet citizenship, then achieves the rank of Soviet intelligence colonel and is awarded further Soviet decorations over the next ten years.", "Control has come to suspect that there is a mole deep in the organization. By 1972, alone in this belief, he has ruled out all but his five senior lieutenants: Percy Alleline, Roy Bland, George Smiley, Toby Esterhase, and Haydon. To save his agent, Karla engineers the professional ruin of Control and Smiley whom he reckons to be the most likely to unmask Haydon. Karla is aware of Smiley's one personal weakness — his unreciprocated love for his wife Ann, who is a habitual adulteress — and orders Haydon to have an affair with her to cloud Smiley's judgment further. As Control is about to discover the truth, Karla lures him into ordering a doomed operation in Czechoslovakia to learn the identity of the mole from a (fake) Czech defector. Control picks Jim Prideaux for the operation and Haydon chooses to sacrifice his close friend to save himself. Prideaux is captured and reveals under duress the full extent of Control's knowledge of the mole to Karla before being repatriated to Britain and discharged from the Circus. Control is dismissed and dies soon afterwards, Smiley is forced into retirement, and Alleline becomes Chief. Haydon assumes control of London Station, in control of all foreign operations, effectively giving him unfettered access to intelligence worldwide."]}, {"page": "Toby Esterhase", "response": ["Easterhase is motivated by a desire to be accepted by his peers as a true English gentleman, a weakness exploited by Percy Alleline to coax Toby into supporting him in a coup against Control, the head of the Circus. Smiley later uses the same desire for acceptance to convince Esterhase to switch alliances and support him in exposing Alleline as a fraud whose arrogance has blinded him to the presence of a mole in his inner circle. Esterhase also has a penchant for making extra money on the side through small-time criminal enterprises, nominally selling forged art. Those around him look the other way due to his competence and value as a spy.", "When the Circus became polarised between supporters of the ailing Chief, \"Control\", and his rival, Percy Alleline, Esterhase gravitated towards Alleline out of ambition, forgetting his past loyalty to Smiley, who was Control's supporter. During Smiley's attempt to salvage Control's career and maintain control of the Circus, Esterhase is one of the first people Smiley appeals to, citing their past friendship; Esterhase demurs, citing Control's habit of allowing younger personnel to mistreat him. After Control is ousted and Alleline installed as the new chief of the Circus, Esterhase, along with Bill Haydon and Roy Bland, forms part of the \"magic circle,\" an elite group of spies with access to the Soviet intelligence operation code-named \"Witchcraft,\" which receives Soviet intelligence from the mysterious spy \"Merlin.\"Tinker Tailor Soldier Spy, 137-145, 314-315.", "Esterhase is one of the five high-ranking Circus officers Control suspects of being a Soviet mole.Tinker Tailor Soldier Spy, 283.  After Control's death, Esterhase embraces the new Alleline regime and allows his Lamplighters to be almost entirely given over to serving Operation Witchcraft, which is in fact nothing but a disinformation campaign orchestrated by Soviet spymaster Karla. Esterhase's own role is to pretend to be a Soviet mole when meeting with the Soviets. They know he is not, but his pretense provides a cover story for Alleline, Bland, and Esterhase himself, justifying his role as a courier between the real mole, Haydon, and his Soviet controllers.Tinker Tailor Soldier Spy, 314-321.", "David Dencik played Esterhase in the 2011 film version of Tinker Tailor Soldier Spy. Dencik's Esterhase spoke with a subtle but difficult-to-place Eastern European accent. The details of Esterhase's past are altered slightly in the film. In the film, it was Control, rather than Smiley, who first recruited Esterhase in Vienna. When Smiley confronts Esterhase about Operation Witchcraft, he states that Esterhase was a \"wanted man\" at the time of his recruitment and implies that Esterhase is still a fugitive. Although it is not specified why or by whom Esterhase is wanted, it is suggested that his fugitive status may have to do with his \"war experience,\" which Smiley cryptically states Esterhase \"survived [...] because of [his] ability to change sides, serve any master.\""]}, {"page": "Peter Guillam", "response": ["Guillam is a major character in Tinker Tailor Soldier Spy, which retcons the chronology of Call for the Dead to make Guillam only forty in 1973. At the outset of the book, the failure of a major operation called \"Testify\" has resulted in Smiley and the former head of the Circus, Control, being fired. Guillam survives the purge of personnel loyal to Smiley, but is demoted to the head of the \"Scalphunters\", fieldmen used in operations that require physical action and/or violence. The position is seen as one of the least desirable in the Circus, described humorously by Smiley as \"cosh and carry\". One of Guillam's agents, Ricki Tarr, inadvertently learns that the failure of Operation Testify—and Smiley's subsequent termination from the Circus—was due to the presence of a mole in the highest echelons of British intelligence. When contacted by Tarr and unsure of whom to trust, he goes to senior Civil Servant Oliver Lacon and, acting as his link man, Guillam facilitates Smiley's secret return from retirement in order to conduct a surreptitious investigation into the identity of the mole. Guillam is motivated not only by his loyalty to Smiley but also because, as a result of the Mole's actions, a network of secret agents he ran in the former French North Africa were identified and executed. Guillam acts as Smiley's man on the inside in the investigation, which involves his actually stealing files from the Circus Registry at Smiley's request. Over the course of the novel, Guillam grows progressively paranoid and anxious regarding the investigation, at one point doubting the veracity of Tarr's allegations. When the mole is finally identified, Guillam loses his temper and physically attacks him, having to be restrained by the other men in the room. "]}, {"page": "The Spy Who Came In from the Cold (film)", "response": ["The West Berlin office of MI6, under station chief Alec Leamas, has suffered from reduced effectiveness. He is recalled to London shortly after the death of one of his operatives and is seemingly drummed out of the agency. In reality, a carefully staged transformation of Leamas has been arranged by Control, the agency's chief. Appearing to be depressed, embittered and alcoholic, Leamas takes work as an assistant at a local library. There he begins a relationship with co-worker Nan Perry, a young and idealistic member of the British Communist Party. Leamas spends most of his small salary on alcohol, leaving him constantly low on funds. He drunkenly assaults a shopkeeper who refuses him credit and is briefly jailed. His predicament attracts the attention of the East German Intelligence Service, which sees him as a potential defector."]}, {"page": "Connie Sachs", "response": ["Sachs is an eccentric alcoholic with an incredible memory and intellect who works in the research department of the Circus. \"A don's daughter\", her brothers were also dons, and she herself \"some sort of academic\".The Honourable Schoolboy, John le Carré, Bantam, 1978, p. 58 Her family lived at Millponds, a \"beautiful Palladian house\" with \"lovely grounds, near Newbury\", later owned by one of her brothers.Tinker Tailor Soldier Spy, John le Carré, Sceptre, 2011, p. 130 According to legend, Control met her while she was at university and was so impressed that he invented a job so as to hire her. Her personal and professional life is devoted to the study of Soviet intelligence and most notably the Soviet spymaster known as Karla."]}, {"page": "Tinker Tailor Soldier Spy (film)", "response": ["In 1973 \"Control\", head of British intelligence (\"The Circus\"), sends Jim Prideaux to Budapest to meet a Hungarian general who has the name of a mole at the top of British Intelligence. Prideaux, realising the meeting is a trap, is shot as he tries to leave. Control and his right-hand man George Smiley are forced to retire, and Control dies soon after. Percy Alleline becomes the new Chief, Bill Haydon his deputy, and Roy Bland and Toby Esterhase his lieutenants. They had already begun receiving Soviet Intelligence from a secret source (Operation \"Witchcraft\").", "Field agent Ricki Tarr warns undersecretary Oliver Lacon that there is a mole at the top of the Circus. Knowing that Control had the same theory, Lacon asks Smiley to investigate, helped by Tarr's boss Peter Guillam and retired Special Branch officer Mendel.", "Smiley tells Guillam that in 1955 he had urged Moscow's spymaster Karla to defect, begging him to \"think of his wife\" and realised too late that he had revealed his own weak spot: his love for his wife. Former duty officer Jerry Westerby tells Smiley of how Prideaux's shooting sent Control into shock. Westerby left a message with Ann Smiley - Haydon then arrived and took charge. Guillam wonders how Haydon could have learned of the emergency, but Smiley tells him he was having an affair with Ann.", "Prideaux, who is in fact alive and now a schoolmaster, tells Smiley that his Budapest mission was to relay the identity of the mole to Control via code names. He was tortured by the KGB, and saw Irina shot in front of him."]}, {"page": "Tinker Tailor Soldier Spy (TV series)", "response": ["The mission proves to be a trap, and Prideaux is captured and brutally tortured by the Soviets. The Chief of the Circus, known only as Control, is disgraced for his role in Testify, and is replaced by his rival Percy Alleline. Control's obsession with the possibility of a Soviet mole at the Circus is not shared by others in the organization, who insist that any leaks and failures at the Circus were due to Control's incompetence. On the contrary, Alleline and the rest of the new leadership team at the Circus believe that they have a mole, code-named Merlin, working for them in Moscow Centre, the KGB headquarters, passing them secrets in an operation code-named Witchcraft.  Others in the British and American intelligence communities have been impressed with the information produced by Witchcraft, and Alleline and his team are regarded as a refreshing change from Control.", "More than a year after Testify and the shake-up at the Circus, Ricki Tarr, a British agent gone missing in Lisbon, turns up in England with new evidence backing up Control's theory of a mole at the Circus.  While on a routine mission Tarr had been approached by Irina, a low-level Soviet agent who claimed to know the identity of the mole and wanted to trade it for permission to defect.  As soon as Tarr had informed the Circus of Irina's offer, she was abducted and spirited back to Russia. Tarr, convinced he had been betrayed by the mole Irina was going to identify, believed that he would also be targeted and disappeared.  Returning to London secretly, Tarr contacts Oliver Lacon, a senior civil servant who is the liaison between the Circus and the British Cabinet.", "Before his ousting, Control had narrowed his list of suspects to five men – Roy Bland, Toby Esterhase, Bill Haydon, Percy Alleline, and George Smiley – all of whom occupied high positions in the Circus. Knowing the Soviet spy is highly placed in the Circus, Lacon cannot trust the Circus to uncover the mole or even allow its personnel to know of the investigation.  Smiley, who had been fired along with Control while Control's other four suspects were promoted, is recalled by Lacon and given instructions to expose the mole.", "* Alexander Knox as Control"]}, {"page": "Jim Prideaux", "response": ["Prideaux served in World War II, with his record being called \"distinguished.\" Following the war, he briefly worked as a teacher before rejoining the Circus. Eventually, he was appointed head of \"Scalphunters\", a section of reckless and volatile agents kept on retainer for particularly dangerous missions involving violence and assassinations. Prideaux's military background, harsh bearing, and professional competence serve to make him an ideal head of the section, and it flourishes under his command. When the head of the Circus, Control, comes to suspect that it has been infiltrated by the KGB, he sees Prideaux as the ideal candidate to travel to Czechoslovakia on a secret operation code-named \"Testify\" to interrogate an alleged defector about the mole's identity. \"Testify\" turns out to be a trap set up by the mole and his controller to disgrace the Circus, and Prideaux is shot and captured, enduring months of torture. Control is forced into retirement for making the Circus appear paranoid and for losing Prideaux behind enemy lines. Prideaux is presumed dead by a large part of the Circus, though Haydon (who is actually the mole) arranges to have Prideaux repatriated. In compensation for his torture, and to distance him from the Circus, Prideaux is given a small pension and a gratuity, with which he acquires an Alvis. He is set up with a post as supply teacher, teaching French at a remote prep school. His gunshot wounds have permanently damaged his spine, which was shoddily repaired by incompetent surgeons, and left him with a curvature resembling a hunchback, although he keeps fit through solitary games of squash and walks through the surrounding countryside. Prideaux's release and exile from The Circus act as the jumping-off point for the events of Tinker Tailor."]}]}}