{"wiki_id": "http://www.wikidata.org/entity/Q516396", "itemLabel": "Kadamba Simmons", "itemDescription": "British actor-model (1974-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kadamba_Simmons", "wikipedia_page": {"main": "Kadamba Simmons (7 May 1974 – 13/14 June 1998) was a British actress and model.", "link_mentions": [{"page": "1996 in film", "response": ["| Mary Reilly || TriStar Pictures || Stephen Frears (director); Christopher Hampton (screenplay); Julia Roberts, John Malkovich, Michael Sheen, George Cole, Michael Gambon, Glenn Close, Kathy Staff, Bronagh Gallagher, Linda Bassett, Henry Goodman, Ciaran Hinds, Tim Barlow, Stephen Boxer, Bob Mason, Isabella Marsh, Richard Leaf, Wendy Nottingham, Ellie Crockett, Robbi Stevens, Kadamba Simmons, Evelyn Doggart, Pui Fan Lee, Mimi Potworowska, Samantha Hones, Julia Hagen || Horror || Live action"]}, {"page": "Kadamba", "response": ["* Kadamba Simmons, a British actress and model"]}, {"page": "Mary Reilly (film)", "response": ["* Ellie Crockett, Robbi Stevens, Kadamba Simmons, Evelyn Doggart, Pui Fan Lee, Mimi Potworowska, Samantha Hones and Julia Hagen as Farraday Girls"]}, {"page": "Isobel (song)", "response": ["CD1 featured the B-side \"Charlene\", a mid-tempo song with sexually suggestive and ambiguous lyrics inspired by friend Kadamba Simmons. It also included the techno track \"I Go Humble\", which LFO released without the vocals under the title \"Shove Piggy Shove\" in the 1996 album Advance, and a slowed-down version of \"Venus as a Boy\" with Guy Sigsworth playing the harpsichord. CD2's B-sides are three remixes of \"Isobel\": one by Eumir Deodato featuring \"Brazilian sensibilities\", a \"vaguely ambient\" one by Sigtryggur Baldursson of The Sugarcubes, and a jungle one by Goldie."]}, {"page": "Stop the World (Extreme song)", "response": ["The video features the late model Kadamba Simmons running away from a man pursuing her. She was murdered a few years later by a male known to her."]}, {"page": "List of horror films of 1997", "response": ["| Paul Matthews || Samantha Womack, Clifton Lloyd Bryan, Kadamba Simmons || United Kingdom || "]}, {"page": "Deaths in June 1998", "response": ["*Kadamba Simmons, 24, British actress and model, murdered."]}]}}