{"wiki_id": "http://www.wikidata.org/entity/Q5162640", "itemLabel": "Conrad Wolfram", "itemDescription": "Information technologist and businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Conrad_Wolfram", "wikipedia_page": {"main": "Conrad Wolfram (born 10 June 1970) is a British technologist and businessman known for his work in information technology and mathematics education reform. In June 2020, Conrad released his first book, The Math(s) Fix: An Education Blueprint for the AI Age.", "link_mentions": [{"page": "Wolfram", "response": ["* Conrad Wolfram (born 1970), British technologist and businessman, brother of Stephen Wolfram"]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Conrad Wolfram (born 1970), technologist"]}, {"page": "Traditional mathematics", "response": ["The use of calculators became common in United States math instruction in the 1980s and 1990s. Critics have argued that calculator work, when not accompanied by a strong emphasis on the importance of showing work, allows students to get the answers to many problems without understanding the math involved. However, others such as Conrad Wolfram argue for a more radical use of computer-based math in a complete departure from traditional math."]}, {"page": "Computational thinking", "response": ["Current integration computational thinking into the K–12 curriculum comes in two forms: in computer science classes directly or through the use and measure of computational thinking techniques in other subjects. Teachers in Science, Technology, Engineering, and Mathematics (STEM) focused classrooms that include computational thinking, allow students to practice problem-solving skills such as trial and error. Valerie Barr and Chris Stephenson describe computational thinking patterns across disciplines in a 2011 ACM Inroads article However Conrad Wolfram has argued that computational thinking should be taught as a distinct subject."]}, {"page": "Computer-Based Math", "response": ["Computer-Based Math is an educational project started by Conrad Wolfram in 2010We need to base maths lessons on computers The Telegraph, 03 Dec 2009Revival Plan The New Indian ExpressComputers do it better, Times Higher Education Supplement, 30 March 2012Closing the gap between modern life and the math curriculum New York Times, 10 Feb 2013 to promote the idea that routine mathematical calculations should be done with a computer.", "Conrad Wolfram believes that mathematics education should make the greatest possible use of computers for performing computation leaving students to concentrate on the application and interpretation of mathematical techniques.Reinventing Math for the Computational Knowledge Economy Big Think, Jan 2013  Wolfram also argues that computers are the basis of doing math in the real world and that education should reflect that   Times Educational Supplement and that programming should be taught as part of math education.ICT teaching upgrade expected in 2014 The Guardian, 20 Aug 2012"]}, {"page": "Kate Friedlander", "response": ["She was the mother of philosopher Sybil Wolfram (born Sybille Misch). The scientist and entrepreneur Stephen Wolfram and technologist Conrad Wolfram are her grandchildren.Smith, M. E. (1993). Obituary. Anthropology Today, 9(6), 22–22. Retrieved from https://www.jstor.org/stable/2783224"]}, {"page": "Computational knowledge economy", "response": ["The term was coined by Conrad Wolfram to describe the extension to the knowledge economy caused by ubiquitous access to automated computation. Wolfram argues \"The value- chain of knowledge is shifting. The question is not whether you have knowledge but know how to compute new knowledge from it, almost always applying computing power to help.\""]}]}}