{"wiki_id": "http://www.wikidata.org/entity/Q51694990", "itemLabel": "Celia Wray", "itemDescription": "British suffragist (1872-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Celia_Wray", "wikipedia_page": {"main": "Celia Wray (30 May 1872 – 30 November 1954) was an English suffragette and an architect. For many years she was in a lesbian relationship with scientist Alice Laura Embleton.", "link_mentions": [{"page": "Women's Social and Political Union", "response": ["* Celia Wray"]}, {"page": "List of suffragists and suffragettes", "response": ["* Celia Wray (1872–1954) – suffragette and architect"]}, {"page": "Suffragette", "response": ["* Celia Wray"]}, {"page": "Evelina Haverfield", "response": ["although during 1919 Holme was living in Kirkcudbright where she had an affair with the artist Dorothy Johnstone.Vera ‘Jack’ Holme – one of the stars of the Women’s Library Collection, Gillian Murphy, LSE, Retrieved 15 March 2017 With cancer scientist Alice Laura Embleton, Vera Holme and Celia Wray Haverfield set up the private 'Foosack League' between themselves. Its membership was restricted to women and suffragists; the internal evidence suggests the Foosack League was a lesbian secret society.Emily Hamer, Britannia's Glory: A History of Twentieth Century Lesbians, Bloomsbury Academic (2016) - Google Books pgs. 56-57 Certainly, the four were close friends - as evidenced by the many letters written between them, particularly during World War I.Papers of Vera Holme - Women's Library Archive - London School of Economics"]}, {"page": "List of people from Barnsley", "response": ["* Celia Wray (1872-1954), architect and suffragette"]}, {"page": "Vera Holme", "response": ["With cancer scientist Alice Laura Embleton, Evelina Haverfield and Celia Wray Holme set up the private 'Foosack League' between themselves the membership of which was restricted to women and suffragists; the internal evidence suggests the Foosack League was a lesbian secret society.Emily Hamer, Britannia's Glory: A History of Twentieth Century Lesbians, Bloomsbury Academic (2016) - Google Books pgs. 56-57 Certainly, the four were close friends as evidenced by the many letters written between them, particularly during World War I.Papers of Vera Holme - Women's Library Archive - London School of Economics"]}, {"page": "Alice Laura Embleton", "response": ["Embleton was connected with a number of noted suffragists, including Evelina Haverfield, Vera Holme, and Celia Wray. The 1911 census shows that Embleton was visiting Wray at Fairfield House, Barnsley on the day of the census. Like many suffragists, the two women defaced the census paper by recording their occupation as \"Getting votes for women\"."]}]}}