{"wiki_id": "http://www.wikidata.org/entity/Q5163506", "itemLabel": "Constance Benson", "itemDescription": "British actress (1864-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Constance_Benson", "wikipedia_page": {"main": "Gertrude Constance Cockburn Benson (née Samwell; 26 February 1864 – 19 January 1946) was a British stage and film actress. Before her marriage to Frank Benson, she was known by the stage name Constance Featherstonhaugh, pronounced \"Fanshaw\" ().\nBorn in British India into a military family, and christened Gertrude Constance Cockburn Samwell, she took to the stage under the name of Featherstonhaugh, which was the middle name of her father, Morshead Featherstonhaugh Samwell. She married the actor Frank Benson in 1886, and they had two children, Eric William (1887–1916), killed at the battle of the Somme, and Brynhild Lucy (1888–1974).When Benson played Cleopatra in 1898, reviewers were astonished by her \"terrible rage\", one commenting that she treated a struck-down messenger so violently that only the intervention of Charmian had saved his life. One critic later claimed that \"Benson and his companies never shook off the aura of amateurism\", and that some of the parts Constance Benson had played \"owed more to her husband's loyalty than to her talent\".As an actress, Constance Benson worked in the theatre, but in 1911 she also appeared in leading roles in four silent films, all adaptations of William Shakespeare plays: Richard III, Julius Caesar, Macbeth, and The Taming of the Shrew.\nIn 1916 Constance became Lady Benson. After F. R. Benson's love affair with the young actress Genevieve Townsend (d. 1927), the couple separated but did not divorce, and in 1940 Benson attended her husband's funeral as his widow.\nDuring the First World War, in which her son Eric was killed, Benson worked in a canteen for soldiers in France. In 1917 her daughter Brynhild married firstly Charles Chalmers, in 1931 secondly Harold G. Janion, and in 1951 thirdly Richard C. Kelly.In the 1920s, Benson became a writer, and her published books are her autobiography Mainly Players (1926); two novels, The Chimera (1928), about \"an ice-cold, egotistical, twenty-eight-year-old artist\", with a frustrated wife, and Cuckoo Oats (1929). She also wrote an acting manual and in the 1920s began a drama school, at which one of her students was Elvira Mullens, later Elvira Barney.Benson's autobiography Mainly Players has an introduction by Arthur Machen, who had been a member of the Benson company from 1901 to 1909.\n\n", "link_mentions": [{"page": "Arthur Machen", "response": ["*Constance Benson's autobiography Mainly Players (Butterworth, 1926) has an introduction by Machen, who had been a member of the Benson company from 1901 to 1909.Arthur Machen & Montgomery Evans: Letters of a Literary Friendship, 1923-1947 (1994), p. 170"]}, {"page": "Henry VI, Part 1", "response": ["After the original 1592 performances, the complete text of 1 Henry VI seems to have been rarely acted. The first definite performance after Shakespeare's day was on 13 March 1738 at Covent Garden, in what seems to have been a stand-alone performance, as there is no record of a performance of either 2 Henry VI or 3 Henry VI.Hattaway (1990: 43) The next certain performance in England did not occur until 1906, when F.R. Benson presented the play at the Shakespeare Memorial Theatre in a production of Shakespeare's two tetralogies, performed over eight nights. As far as can be ascertained, this was not only the first performance of the octology, but was also the first definite performance of both the tetralogy and the trilogy. Benson himself played Henry and his wife, Constance Benson, played Margaret.Halliday (1964: 216–18)"]}, {"page": "Henry VI, Part 2", "response": ["After the original 1592 performances, the complete text of 2 Henry VI seems to have been rarely acted. The first recorded performance after Shakespeare's day was on 23 April 1864 (Shakespeare's tercentenary) at the Surrey Theatre in London, as a stand-alone performance, with director James Anderson playing York and Cade. Of this production, The Illustrated London News wrote, \"It is a revival, or rather restoration to the stage, of an utterly neglected work, which has not been played for 270 years.\"Knowles (1999: 5) The next definite performance was in 1889, when George Osmond Tearle directed another stand-alone production at the Shakespeare Memorial Theatre in Stratford-upon-Avon, starring Erskine Lewis as Henry and Ellen Cranston as Margaret.Hattaway (1991: 43) In 1899, F.R. Benson directed another stand-alone production of the play at the Shakespeare Memorial Theatre. In 1906, he revived the play, and included 1 Henry VI and 3 Henry VI in a production of Shakespeare's two tetralogies, performed over eight nights. As far as can be ascertained, this was not only the first performance of the octology, but was also the first definite performance of both the tetralogy and the trilogy. Benson himself played Henry and his wife, Constance Benson, played Margaret.Hattaway (11991: 43)"]}, {"page": "Henry VI, Part 3", "response": ["After the original 1592 performances, the complete text of 3 Henry VI seems to have been very rarely acted. The first definite performance in England after Shakespeare's day did not occur until 1906, when F. R. Benson presented the play at the Shakespeare Memorial Theatre in a production of Shakespeare's two tetralogies, performed over eight nights. As far as can be ascertained, this was not only the first performance of the octology, but was also the first definite performance of both the tetralogy and the trilogy. Benson himself played Henry and his wife, Constance Benson, played Margaret.Halliday (1964: 216–18)"]}, {"page": "Henry Ainley", "response": ["Ainley was born in Morley, near Leeds, on 21 August 1879, the only son and eldest child of Richard Ainley (1851–1919), a textile worker, and his wife, Ada née Hinchliffe (1850–1928). After education at the church school of St Peter's, Morley, Ainley became a bank clerk in Sheffield, where he took part in amateur dramatics. When the actor-manager George Alexander was on tour in 1899 in H. A. Jones's play The Masqueraders, Ainley obtained his permission to \"walk on\" (i.e. appear as a non-speaking extra). He made his professional stage début in F. R. Benson's company as a messenger in Macbeth.Parker, p. 205 He remained with Benson for two years, making his London début at the Lyceum Theatre as the Duke of Gloster to Benson's king in Henry V, in a cast that also featured Constance Benson, Leslie Faber, Harcourt Williams, Charles Doran and Oscar Asche.Parker, pp. 206–208\"The Lyceum Theatre\", The Morning Post, 16 February 1900, p. 6"]}, {"page": "Frank Benson (actor)", "response": ["in 1911 Benson appeared in four films of Shakespeare plays, much abbreviated:  Richard III, in the title role; Julius Caesar, in which he played Antony; The Taming of the Shrew as Petruchio; and Macbeth, in the title role.\"Lady Constance Benson\", Shakespeare and the Players. Retrieved 31 July 2021"]}, {"page": "Benson (surname)", "response": ["*Constance Benson (1864–1946), British stage and film actress"]}, {"page": "Macbeth (1911 film)", "response": ["*Constance Benson as Lady Macbeth"]}, {"page": "The Taming of the Shrew on screen", "response": ["The earliest cinematic adaptation of the play is D.W. Griffith's eleven-minute The Taming of the Shrew, made for Biograph in 1908, starring Florence Lawrence as Katherina and Arthur V. Johnson as Petruchio. The blurb for the film stated \"if we could see ourselves as others see us what models we would become.\" Also released in Italy in 1908 was the seven-minute La bisbetica domata, directed by Azeglio Pineschi and Lamberto Pineschi. There is no known cast list for this film. Unlike all other silent adaptations, this version retains the Katherina/Bianca sibling rivalry. In 1911, F.R. Benson directed a twelve-minute silent filmed extract from his own Shakespeare Memorial Theatre production, starring himself and his wife, Constance Benson. The film presented a heavily truncated pantomime version of the story, with pieces of Shakespeare's original text used as intertitles throughout. It is now believed lost, although several stills survive in the library archives of the Shakespeare Birthplace Trust.  Also released in France in 1911 was La mégère apprivoisée, directed by Henri Desfontaines and starring Madeleine Barjac and Romauld Joubé. It is thought to be the first version to show scenes which take place off-stage in the play; in this case, the wedding and the journey to Petruchio's house. A 1913 Italian version, the twenty-two-minute La bisbetica domata, was directed by Arrigo Frusta and starred Gigetta Morano and Eleuterio Rodolfi. This version also shows scenes not in the play. Another English adaptation was released in 1915, directed by and starring Arthur Backner. This version is also lost. Intended more as a showcase for a new type of sound system than an adaptation of the play, the film consisted entirely of the scene where Petruchio and Katherina first meet. Shot using a process known as Voxograph, the actors spoke the complete text during filming, and when the film was played at the theatre, \"the same actors, one at each side of the screen but unseen, repeated the words in what was supposed to be synchronisation. It was expected that the operator, after rehearsal, would be able to project the film so that picture and voice would jibe.\" The earliest surviving British filmic adaptation is Edwin J. Collins' 1923 version, adapted by Eliot Stannard, and starring Dacia Deane and Lauderdale Maitland. One of a series of forty-minute adaptations of classic texts released under the Gems of Literature banner, only the second half of the film survives, and the final scene is incomplete as a result of print damage. This version very much adopts Petruchio's perspective, and one of the intertitles reads \"by noon the next day, though famished and weary for want of food and rest, the Shrew deep in her heart admired the man whose temper is greater than her own.\""]}, {"page": "The Taming of the Shrew in performance", "response": ["The first major production in England after Daly's success was that of F.R. Benson. Originally performed in the Prince's Theatre, Manchester in 1889, the production then moved to the Adelphi Theatre in London in 1890, before settling at the Shakespeare Memorial Theatre in 1893, where it became one of the most popular and often performed plays in Benson's repertory. The play was regularly performed there until the 1920s and was revived at theatres around the country up to 1932. Starring Benson's wife, Constance Benson and Benson himself as Petruchio, Benson followed Daly's example in rewriting and restructuring, such as truncating the Bianca subplot. Unlike Daly, however, Benson also removed the Induction. The production was very much a farce, with the emphasis on broad physical comedy in which Petruchio athletically leaps about the stage terrorizing a relatively passive Katherina. In its early days, it received generally strong reviews, but by 1910, the political climate had changed somewhat; the 1909 Stratford by-election had seen suffragette protests, and henceforth some critics expressed discomfort with Benson's use of farce to depict what had now become a socially relevant situation. Indeed, in the 1912 season, suffragette activist Violet Vanbrugh replaced Constance Benson in the role of Katherina, although her performance was roundly criticised for failing to bring the anticipated political edge to the character."]}, {"page": "Elvira Barney", "response": ["In 1924, Elvira attended Lady Benson's Drama Academy, studying under Constance Benson. During this time, she was engaged to Charles Patrick Graves. During the 1924–25 theatre season she appeared  in The Blue Kitten at the Gaiety Theatre."]}, {"page": "Ruby Ginner", "response": ["Ginner founded the Ruby Ginner School of Dance in London during World War I. She later partnered with mime Irene Mawer, and the school was known as the Ginner-Mawer School of Dance and Drama. Among her students was Australian health advocate Thea Stanley Hughes, Canadian dancer Gweneth Lloyd, actress and dancer Irene Mulvany-Gray (and her sister Hilda Mulvany-Gray) and dance educator Beatrice \"Bice\" Bellairs.\"Pioneer Women: early British modern dancers\" National Resource Centre for Dance (2008-2010). She taught movement to actors at Constance Benson's studio, including a young John Gielgud. "]}, {"page": "Otho Stuart", "response": ["In 1891 he was touring with the Company of F. R. Benson and at the time of the 1891 Census he was staying in the same boarding house with Benson and his wife Constance Benson in Nottingham.1891 England Census for Otho S Andreae: Nottinghamshire, St Mary, Nottingham North West - Ancestry.com  In the same year he appeared at Benson's season at the Shakespeare Memorial Theatre in Stratford-upon-Avon, playing Horatio in Hamlet,Cast of Hamlet (1891) - Royal Shakespeare Company website Claudio in Much Ado About Nothing,Cast of Much Ado About Nothing (1891) - Royal Shakespeare Company website Bertie Fitzurse in New Men and Old Acres,Cast of New Men and Old Acres (1891) - Royal Shakespeare Company website and Ferdinand in The Tempest.Cast of The Tempest (1891) - Royal Shakespeare Company website During 1892 Stuart was the leading man for Mrs. Bernard Beere in her Australian tour.Who's who in the theatre: a biographical record of the contemporary stage, compiled and edited John Parker. London: Sir Isaac Pitman & Sons, 1912 (p. 469) In Benson's 1893 Stratford season Stuart was Tullus Aufidius in CoriolanusCast of Coriolanus (1893) - Royal Shakespeare Company website and Renaud in The Corsican Brothers.Cast of The Corsican Brothers (1893) - Royal Shakespeare Company website"]}, {"page": "Constance Featherstonhaugh", "response": ["#REDIRECT Constance Benson"]}]}}