{"wiki_id": "http://www.wikidata.org/entity/Q516671", "itemLabel": "Richard Wilson", "itemDescription": "Scottish actor, theatre director and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Wilson_(Scottish_actor)", "wikipedia_page": {"main": "Richard Wilson  (born Iain Carmichael Wilson; 9 July 1936) is a Scottish actor, theatre director and broadcaster.  He is most famous for playing Victor Meldrew in the BBC sitcom One Foot in the Grave. Another notable role was as Gaius, the court physician of Camelot, in the BBC drama Merlin.\n\n", "link_mentions": [{"page": "One Foot in the Grave", "response": ["The series features the exploits of Victor Meldrew, played by Richard Wilson, and his long-suffering wife, Margaret, played by Annette Crosbie. Wilson initially turned down the part of Meldrew and David Renwick considered Les Dawson for the role, until Wilson changed his mind. The programmes invariably deal with Meldrew's battle against a long series of problems, some of which he creates for himself. Set in an unnamed town in southern England, Victor takes involuntary early retirement. His various efforts to keep himself busy while encountering various misfortunes and misunderstandings are the themes of the sitcom. Indoor scenes were filmed at BBC Television Centre with most exterior scenes filmed on Tresillian Way in Walkford in Christchurch, Dorset.One Foot in the Grave Series 6 DVD Commentary Despite its traditional production, the series subverts its domestic sitcom setting with elements of black humour and surrealism.", "Victor Meldrew (Richard Wilson) – Victor is the main protagonist of the sitcom and finds himself constantly battling against all that life throws at him as he becomes entangled in complicated misfortunes and farcical situations. Renwick once pointed out in an interview that the name \"Victor\" was ironic, since he almost always ends up a loser.I Don't Believe It! The 'One Foot in the Grave' Story, BBC documentary, 2000 From being buried alive to being prosecuted for attacking a feisty pit bull terrier with a collection of coconut meringues, Victor tries to adjust to life after an automatic security system made him redundant at the office where he worked as a security guard, but to no avail. He believes everything is going wrong for him all the time and he has the right to be upset because it is always someone else's fault. Victor does not see himself as retired and is always trying to find another job, but most of his attempts end in failure. Victor is a tragic comedy character and sympathy is directed towards him as he becomes embroiled in complex misunderstandings, bureaucratic vanity and, at times, sheer bad luck. The audience sees a philosophical ebb to his character, however, along with a degree of optimism. Yet his polite façade collapses when events get the better of him and a full verbal onslaught is forthcoming. \"Victor-isms\" include \"I do not believe it!\", \"I don't believe it!\", \"Un-be-lievable!\", \"What in the name of bloody hell?\", \"In the name of sanity!\". Despite his grumpy demeanour Victor isn't totally devoid of compassionin \"Hearts of Darkness\" he liberates elderly nursing-home residents who were being mistreated by staff, and in \"Descent into The Maelstrom\" he calls the incident-room number and gives the location of an emotionally disturbed girl that abducted a baby and stole Margaret's pearl earrings, which resulted in the girl getting picked up by the police. However, because the girl was a friend of Margaret's and knowing she meant a lot to her, Victor never said anything. Victor has also shown a vast amount of loyalty to Margaret as, throughout their entire 42 years of lifelong marriage together, not once has the thought of infidelity ever occurred to him. In \"Rearranging the Dust\", Victor and Margaret recollect the days of their courtship at a party after which Victor says \"You were always my first choice\", which leaves Margaret stunned. In another episode, Margaret recounts the time Victor took her to the funfair and they ended up getting stuck in the hall of mirrors for over an hour. Victor had said he didn't mind as he was happy to stay there and look at all the reflections of her. Victor's very best act of compassion came in the episode \"The Wisdom of the Witch\" in which he ends up saving Patrick's life from his new secretary's psychopathic boyfriend by forcing Patrick's would-be murderer, with himself along with him as well, out of the window of the house in which they were trapped during a snowstorm.", "The One Foot in the Grave theme song was written, composed and sung by Eric Idle. A longer version was produced for the special \"One Foot in the Algarve\", released as a single with five remixes and a karaoke version in November 1994.Amazon.com: One Foot In The Grave: Eric Idle feat. Richard Wilson: MP3 Downloads Idle included a live version of the song on his album Eric Idle Sings Monty Python. It is preluded by a similar adaptation of \"Bread of Heaven\" to that used in the episode \"The Beast in the Cage\" by disgruntled car mechanics.\"The Beast in the Cage\", One Foot in the Grave, Series 3, episode 4, wr. D. RenwickIt is reprised in the fourth series episode \"Warm Champagne\"", "The programme received a number of prestigious awards. In 1992, it won a BAFTA as Best Comedy (Programme or Series). During its ten-year run, the series was nominated a further six times. Richard Wilson also won Best Light Entertainment Performance in 1992 and 1994 and Annette Crosbie was nominated for the same award in 1994."]}, {"page": "Victor Meldrew", "response": ["Victor Meldrew is a fictional character in the BBC One sitcom One Foot in the Grave, created by David Renwick and portrayed by Richard Wilson. The character epitomised the archetypal grumpy old man. Meldrew is a foil for the bothersome aspects of children, cars, animals, power cuts and next-door neighbours (his particular example being Patrick Trench, played by Angus Deayton). ", "Meldrew's name is associated with aggression or grumpiness; the journal Age and Ageing notes that \"Viewers of Victor Meldrew (One Foot in the Grave) would not be surprised that hostility contributes to mortality in grumpy old men.\"Age and Ageing: News and Reviews. Hostility, age and mortality in patients with cardiac disease. Volume 35, Issue 1, January 2006. pages 3–4. doi:10.1093/ageing/afi213 Similarly The Daily Telegraph uses Richard Wilson's Meldrew to refer to people who enjoy \"a good moan\",Richard Alleyne. The Telegraph: The Victor Meldrew effect: a good moan makes elderly feel better. 31 August 2010. while Jenny Turner in the London Review of Books can observe that \"the timing and rhythm (of Geoff Dyer's Jeff in Venice, Death in Varanasi) have the flippancy of stand-up comedy. The voice has Eeyore in it, and Morrissey and Victor Meldrew, and could only be English and from that postwar, post-punk generation\".[Jenny Turner. How Dare He?. London Review of Books. Volume 31, Number 11. 11 June 2009, pages 24–25.", "The BBC recalls first that \"the role of Victor Meldrew transformed Scottish TV-actor Richard Wilson into a household name and award-winning comedy performer.\" In addition, \"So popular was his character that 'Victor Meldrew' has endured as a cultural reference for any grumpy old man.\" And finally and more loosely, \"many viewers identified with his rages at the irritants of modern life: litter, junk mail, traffic, rudeness, streetlamps and car mechanics and to some, Victor Meldrew was a champion of the people, albeit a very grumpy one.\"BBC: One Foot in the Grave. Retrieved 2 June 2012.", "Victor Meldrew's persona is so powerful that Richard Wilson is perceived as \"99 per cent Meldrew\" by at least one critic, and when taking on a serious role as Malvolio in Shakespeare's Twelfth Night, another critic felt that Wilson's \"performance was overly influenced by his desire to 'shed the Victor Meldrew stereotype'\".What's On Stage: Review Round-up. Wilson's Festive First Night. 12 January 2010."]}, {"page": "Waiting for Godot", "response": ["In June 1999 the Royal Exchange, Manchester staged a production directed by Matthew Lloyd with Richard Wilson as Vladimir, Brian Pettifer as Estragon and Nicky Henson."]}, {"page": "University of Glasgow", "response": ["All students at the university are eligible to vote in the election of the Rector (officially styled \"Lord Rector\"), who holds office for a three-year term and chairs the University Court. In the past, this position has been a largely honorary and ceremonial one, and has been held by political figures including William Gladstone, Benjamin Disraeli, Bonar Law, Robert Peel, Raymond Poincaré, Arthur Balfour, Charles Kennedy and 1970s union activist Jimmy Reid, and latterly by celebrities such as TV presenters Arthur Montford and Johnny Ball, musician Pat Kane, and actors Richard Wilson, Ross Kemp and Greg Hemphill. In 2004, for the first time in its history, the university was left without a Rector as no nominations were received. When the elections were run in December, Mordechai Vanunu was chosen for the post, even though he was unable to attend due to restrictions placed upon him by the Israeli government. In 2014, Edward Snowden, an American computer specialist, a former Central Intelligence Agency (CIA) employee, and former National Security Agency (NSA) contractor—who came to international attention when he disclosed a large number of classified NSA documents to several media outlets—was elected. In 2017, Aamer Anwar a Scottish lawyer and former student of the university was elected rector  until 2020 when rector elections had to be postponed due to the COVID-19 pandemic. On April 21, 2021, Rita Rae, Lady Rae a Scottish lawyer, judge and former Senator of the College of Justice was appointed Rector after a decisive victory."]}, {"page": "David Jason", "response": ["Jason starred in London Weekend Television's Lucky Feller (1975–76), written by Terence Frisby and produced by Humphrey Barclay. About two brothers in south-east London, the series was in many ways a forerunner to Only Fools And Horses, only Jason was in the more dopey 'Rodney' role with Peter Armitage playing the cleverer of the two. The brothers drove around in a comical bubble car, a precursor to the famous Trotters' van; and there was even the joke where, just as he was trying to impress the girl (Cheryl Hall), Jason casually leaned back against the bar, without his knowing that barman had just lifted it behind his back, and fell through. This situation was re-enacted in Only Fools And Horses. He played the lead role of Peter Barnes in the ATV sitcom A Sharp Intake of Breath (1977–81), alongside Alun Armstrong and Richard Wilson. In 1979, he appeared as Buttons in the pantomime Cinderella at Newcastle's Theatre Royal, starring Leah Bell and Bobby Thompson, produced by Michael Grayson and directed by John Blackmore."]}, {"page": "An Inspector Calls", "response": ["In 1986 Richard Wilson directed a production at the Royal Exchange, Manchester with Geraldine Alexander as Sheila Birling, Hugh Grant as Eric Birling and Graeme Garden as Inspector Goole."]}, {"page": "List of British comedians", "response": ["*Richard Wilson (born 1936), Only When I Laugh, One Foot in the Grave"]}, {"page": "Les Dawson", "response": ["He made many appearances on BBC Television's variety show, The Good Old Days in the 1970s and 1980s. Dawson co-hosted Prince Edward's charity television special The Grand Knockout Tournament in 1987. When Richard Wilson turned down the part of Victor Meldrew in the BBC sitcom One Foot In The Grave, writer David Renwick considered Dawson for the role, but Wilson changed his mind before it was offered."]}, {"page": "Hitler Diaries", "response": ["In 1986 the journalist Robert Harris published an account of the hoax, Selling Hitler: The Story of the Hitler Diaries. Five years later Selling Hitler, a five-episode drama-documentary series based on Harris's book, was broadcast on the British ITV channel. It starred Jonathan Pryce as Heidemann, Alexei Sayle as Kujau, Tom Baker as Fischer, Alan Bennett as Trevor-Roper, Roger Lloyd-Pack as Irving, Richard Wilson as Nannen and Barry Humphries as Murdoch. Later that year, Hamilton published the second book to investigate the forgeries: The Hitler Diaries. In 1992 the story of the diaries was adapted to the big screen by Helmut Dietl, in his satirical German-language film Schtonk! The film, which starred Götz George and Uwe Ochsenknecht as characters based respectively on Heidemann and Kujau, won three Deutscher Filmpreis awards, and nominations for a Golden Globe and an Academy Award."]}, {"page": "Prunella Scales", "response": ["For ten years, Scales appeared as \"Dotty\" Turnbull, together with Jane Horrocks as her character's daughter, Kate Neall, in advertisements for UK supermarket chain Tesco. In 1996, Scales starred in the television film, Lord of Misrule, alongside Richard Wilson, Emily Mortimer and Stephen Moyer. The film was directed by Guy Jenkins and filming took place in Fowey in Cornwall. Also in 1996, she appeared as Miss Bates in Jane Austen's Emma. In 1997, Scales starred in Chris Barfoot's science-fiction film short Phoenix which was first aired in 1999 by NBCUniversal's Sci Fi Channel. Scales played 'The Client', an evil government minister funding inter-genetic time travel experiments. The same year she played Minny Stinkler in the comedy film Mad Cows, directed by Sara Sugarman. In 1993 Scales voiced Mrs Tiggy-Winkle in The World of Peter Rabbit and Friends."]}, {"page": "Royal Academy of Dramatic Art", "response": ["* Richard Wilson – (One Foot in the Grave, Merlin)"]}, {"page": "Some Mothers Do 'Ave 'Em", "response": ["Guest cameo roles were played by actors such as George Baker, James Cossins, Peter Jeffrey, Richard Wilson, Fulton Mackay, Bernard Hepton, Christopher Timothy, George Sewell, Bryan Pringle, Christopher Biggins, Milton Johns, Diane Holland, John Ringham, David Ryall, Gretchen Franklin, Geoffrey Chater, Royston Tickner, Michael Redfern, Babar Bhatti, Norman Chappell, Geoffrey Whitehead, Desmond Llewelyn and Elisabeth Sladen (who, in her autobiography, mentions that she was considered for the role of Betty).", "|Features Richard Wilson as the insurance man. First appearance of Columbo, Frank's dog."]}, {"page": "1997 in film", "response": ["| The Man Who Knew Too Little || Warner Bros. Pictures / Regency Enterprises || Jon Amiel (director); Robert Farrar, Howard Franklin (screenplay); Bill Murray, Peter Gallagher, Joanne Whalley, Alfred Molina, Richard Wilson, Geraldine James, John Standing, Anna Chancellor, Nicholas Woodeson, Simon Chandler, John Thomson, Cliff Parisi, Dexter Fletcher, Sheila Reid, Eddie Marsan || Comedy || Live action"]}, {"page": "Hugh Grant", "response": ["Bored with small acting parts, Grant created a sketch-comedy group called The Jockeys of Norfolk, a name taken from Shakespeare's Richard III, with friends Chris Lang and Andy Taylor. The group toured London's pub comedy circuit with stops at The George IV in Chiswick, Canal Cafe Theatre in Little Venice and The King's Head in Islington. The Jockeys of Norfolk proved a hit at the 1985 Edinburgh Festival Fringe after their sketch on the Nativity, told as an Ealing comedy, gained them a spot on Russell Harty's BBC2 TV show Harty Goes to.... In 1986 he played Eric Birling in a production of An Inspector Calls at the Royal Exchange Theatre in Manchester, directed by Richard Wilson, giving a performance that Grevel Lindop, writing in the Times Literary Supplement, described as \"outstanding\".Lindop, Grevel. \"A modern morality: J. B. PRIESTLEY, An Inspector Calls; Royal Exchange Theatre, Manchester\". Times Literary Supplement. 11 April 1986. p. 394."]}, {"page": "1984 in film", "response": ["| A Passage to India || Columbia Pictures / Thorn EMI Screen Entertainment / HBO Films || David Lean (director/screenplay); Judy Davis, Peggy Ashcroft, Victor Banerjee, James Fox, Alec Guinness, Nigel Havers, Michael Culver, Clive Swift, Art Malik, Saeed Jaffrey, Ann Firbank, Roshan Seth, Richard Wilson, Dina Pathak, Mohammed Ashiq, Ishaq Bux, Antonia Pemberton, Sandra Hotz, H. S. Krishnamurthy, Ashok Mandanna, Z. H. Khan, Rashid Karapiet || Epic, History, Drama || Live action"]}, {"page": "Mr. Bean", "response": ["Although Mr. Bean is the only significant character in the programme, others appear usually as foils for his various antics. Other than his girlfriend Irma Gobb (Matilda Ziegler), there are more characters in each episode. However several notable British actors and comedians appear alongside Atkinson in the series as various one-off supporting characters, including Owen Brenman, Richard Briers, Roger Sloman, Angus Deayton, Stephen Frost, Nick Hancock, Christopher Ryan, Paul Bown, Caroline Quentin, Danny La Rue, Roger Brierley, Roger Lloyd-Pack, Rupert Vansittart, David Battley, David Schneider, Richard Wilson and Rudolph Walker. Vansittart and Walker later appeared alongside Atkinson in The Thin Blue Line.Credits at the Internet Movie Database. Retrieved 17 April 2008."]}, {"page": "Annette Crosbie", "response": ["Crosbie's next major role was as Margaret Meldrew, the long-suffering wife of Victor Meldrew (Richard Wilson) in the BBC sitcom One Foot in the Grave (1990–2000) for which she is best known. She also played Janet, the housekeeper to Dr. Finlay, in the 1993–96 revival of A. J. Cronin's popular stories. She also had a poignant role in the thriller The Debt Collector (1999)."]}, {"page": "Durham Cathedral", "response": ["Richard Wilson: On the Road, saw actor Richard Wilson visit the cathedral on this travelogue show following the Shell Guides from the 1930s. The Grayson Perry documentary, All Man, culminated in the unveiling of his artwork in the cathedral."]}, {"page": "Alastair Campbell", "response": ["In 2018 Campbell became part of the top table team at the People's Vote campaign fighting for a referendum on the Brexit deal. This included overseeing the production of campaign films including one written by and starring his daughter Grace, called The Brexit Special, for which Campbell persuaded actor Richard Wilson to revive his most famous character, Victor Meldrew."]}, {"page": "Enn Reitel", "response": ["He also played two roles in different episodes of long-running sitcom One Foot in the Grave. In the first Christmas special, he played \"Mr. Starkey\", a down and out who holds Victor Meldrew (Richard Wilson) and his neighbour Pippa's father, Reverend Croker (Geoffrey Chater) at gunpoint to wait for Armageddon on Christmas Day. In the second episode of series 3, \"Dreamland\", he played a tramp who took a fancy to Victor's shoes, but drew the line at his Noel Edmonds-esque sweater."]}, {"page": "Queens' College, Cambridge", "response": ["*In Kingdom (2007–2009 TV series), created by Simon Wheeler and Alan Whiting, solicitor Peter Kingdom (played by Stephen Fry) and his brother (Dominic Mafham) are both Cambridge graduates. In the fourth episode of the first series, Kingdom returns to Cambridge and meets his old tutor (Richard Wilson), when one of his clients alleges that her daughter has been rejected by his old college purely because of her working-class background. Although the college is never identified, it is Queens', where Fry himself was a student, that appears on screen."]}, {"page": "Ross Kemp", "response": ["After training at Webber Douglas Academy of Dramatic Art, Kemp received his Equity card when appearing alongside John Thaw and Richard Wilson at the Palace Theatre, Westcliff-on-Sea."]}, {"page": "Greenock", "response": ["Other Greenockians include the composers Hamish MacCunn and William Wallace, violinist Henri Temianka, musician John McGeoch, mathematician William Spence, poets Denis Devlin, W. S. Graham and Jean Adam, merchant Matthew Algie, actors Richard Wilson, David Ashton, Martin Compston and Stella Gonet, artists William Scott and Alison Watt, playwrights Bill Bryden, Neil Paterson and Peter McDougall, comedian Charles 'Chic' Murray, opera singer Hugh Enes Blackmore, broadcaster Jimmy Mack, American football player Lawrence Tynes, children's theatre performer Ruairidh Forde, PGA Pro golfer Colin Robinson, Antarctic explorer Henry Robertson 'Birdie' Bowers and portrait painter Leonard Boden."]}, {"page": "It Sticks Out Half a Mile", "response": ["There were two attempts to adapt the show for television – without the Dad's Army characters. The first was a BBC pilot, Walking the Planks, starring Michael Elphick, but the BBC did not commission a series. Knowles and Snoad took the concept to Yorkshire Television who produced a seven-part series under a new title, High & Dry. In the role previously performed by Elphick, Bernard Cribbins was cast. Richard Wilson and Vivienne Martin appeared in both versions."]}, {"page": "The Sweeney", "response": ["When Haskins is absent, other senior officers step in to manage the squad, including Detective Chief Inspector Stephen Quirk (Bill Maynard) and Detective Chief Inspector Anderson (Richard Wilson). ", "*Richard Wilson"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Richard Wilson", "|Richard Wilson", "|Richard Wilson", "|Richard Wilson", "|Richard Wilson"]}, {"page": "Dorothy-Grace Elder", "response": ["She is also a former Glasgow University Scottish Nationalist Association candidate for the post of rector of the University of Glasgow, losing to the actor Richard Wilson in 1996. She was known for her campaigning abilities."]}]}}