{"wiki_id": "http://www.wikidata.org/entity/Q5169444", "itemLabel": "Coral Atkins", "itemDescription": "British actress (1936-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Coral_Atkins", "wikipedia_page": {"main": "Coral Rosemary Atkins (13 September 1936 – 2 December 2016) was an English actress who opened and ran a home for disadvantaged children. She cared for 37 children over a period of 26 years.", "link_mentions": [{"page": "The Likely Lads", "response": ["|Guest stars:Susan JamesonCoral Atkins."]}, {"page": "Survivors (1975 TV series)", "response": ["* Coral Atkins as Penny (eps. 3-4)"]}, {"page": "The Sweeney", "response": ["*Coral Atkins"]}, {"page": "Coral (name)", "response": ["*Coral Atkins"]}, {"page": "Bucklebury", "response": ["*Coral Atkins (1936–2016), actress known for A Family at War and Emmerdale."]}, {"page": "Sarah Lancashire", "response": ["On 1 January 2000, Lancashire returned to Coronation Street for one episode in which Raquel asks Curly for a divorce. Lancashire felt it was an apt time to return, as she was now a more confident actress and wanted to portray Raquel again before she aged significantly. The series' producer at the time, Jane Macnaught, deemed Raquel one of Coronation Street most popular ever characters and her return an opportunity for her \"millions of fans\" to learn what had become of her. Lancashire and Kennedy were the sole actors in the episode, the first to feature just two characters. From late January, Lancashire appeared as factory employee Yvonne Kolakowski, a widow with a dysfunctional personal life, in the BBC One drama series Clocking Off. Lancashire used her own experiences as a single mother in her characterisation. In March, she played actress Coral Atkins in the television film Seeing Red."]}, {"page": "A Family at War", "response": ["* Coral Atkins as Sheila Ashton"]}, {"page": "Shadows (TV series)", "response": ["Starring: Coral Atkins, Sally Lahee, Neville Barber, Brenda Cowling, Elaine Button, Katrina Rose, Craig McFarlane"]}, {"page": "Atkins (surname)", "response": ["* Coral Atkins (1936–2016), British actress"]}, {"page": "Jeremy Young", "response": ["Young was married to actress Coral Atkins in 1960, and later to Kate O'Mara from 1971 to 1976."]}, {"page": "Peter Whitehead (filmmaker)", "response": ["While a student at Cambridge Whitehead met Diane Cottrill and had two daughters, Tamsin and Sian. In 1959 he met Swedish student Britt Svensson and married her in Stockholm in 1960. They moved to London and divorced in 1964. In the 1960s he met the actress Coral Atkins and had a son, Harry."]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Coral Atkins"]}, {"page": "List of former Emmerdale characters", "response": ["|Ruth Jameson || Coral Atkins|| 1993"]}, {"page": "2000 in British television", "response": ["*19 March – Debut of Seeing Red, an ITV drama based on the book of the same name by Coral Atkins, and starring Sarah Lancashire and Richard Dillane."]}, {"page": "Death a la Carte", "response": ["* Coral Atkins as Josie "]}, {"page": "BBC2 Playhouse", "response": ["| Maurice O'ConnellCoral AtkinsChristine HargreavesDerek MartinEric MasonRichard IresonAlan FordTrevor LairdLeslie GranthamJimmy Winston"]}, {"page": "2016 in the United Kingdom", "response": ["**Coral Atkins, 80, actress (A Family at War, Emmerdale)."]}, {"page": "2016 in British television", "response": ["|Coral Atkins"]}, {"page": "Deaths in December 2016", "response": ["*Coral Atkins, 80, English actress (A Family at War, Emmerdale), cancer.Coral Atkins obituary"]}, {"page": "Sarah Lancashire filmography", "response": ["| Seeing Red || Coral Atkins || Television film"]}]}}