{"wiki_id": "http://www.wikidata.org/entity/Q5162233", "itemLabel": "Conor Gough", "itemDescription": "English footballer (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Conor_Gough", "wikipedia_page": {"main": "Conor John Joseph Gough (born 9 August 1993 in Ilford, Essex) is an English footballer who plays as a goalkeeper for Coggeshall Town.", "link_mentions": [{"page": "2011–12 Bristol Rovers F.C. season", "response": ["*  – Conor Gough signed for Bristol Rovers on an emergency seven-day loan from Charlton Athletic. Rovers had already agreed to sign Gough permanently in the summer.", "| Conor Gough", "|align=\"left\"|20||align=\"left\"|GK||align=\"left\"| Conor Gough"]}, {"page": "2011–12 Charlton Athletic F.C. season", "response": ["| Conor Gough", "| Conor Gough"]}, {"page": "2012–13 Bristol Rovers F.C. season", "response": ["*  – Goalkeeper Conor Gough joined Rovers from Charlton Athletic on a two-year contract.", "| Conor Gough", "|Conor Gough", "|align=\"left\"|20||align=\"left\"|GK||align=\"left\"| Conor Gough"]}, {"page": "2012–13 Charlton Athletic F.C. season", "response": ["| Conor Gough"]}, {"page": "2013–14 Bristol Rovers F.C. season", "response": ["*  – Rovers' retained list confirmed that 12 players, Fabian Broghammer, David Clarkson, Seanan Clucas, Steven Gillespie, Jordan Goddard, Conor Gough, Mitch Harding, Pat Keary, Jim Paterson, Eliot Richards, Josh Southway and Danny Woodards, were to be released on completion of their contracts. Ellis Harrison was placed on the transfer list. Lee Brown and Alefe Santos were offered new contracts and Michael Smith was offered a contract extension.", "| Conor Gough"]}, {"page": "Lamar Johnson (footballer)", "response": ["In January 2014, following an off the field incident against Bury Town that had occurred on 25 September 2013, Johnson was given a year long ban by The Football Association. Upon the completion of his ban, Johnson re-signed for Grays, going out on loan to Tilbury in order to gain match fitness. Whilst at Grays, loans to Soham Town Rangers and Harlow Town followed, before departing in 2016, re-joining tenants Aveley. On 24 March 2017, Johnson, alongside Canvey Island goalkeeper Conor Gough, joined Chelmsford City on dual-registration as cover for Ross Fitzsimons during Chelmsford's National League South run-in. During the 2017–18 season, Johnson re-signed for Grays, having spells at Hertford Town, Basildon United, Waltham Abbey and Aveley in the following campaign. In July 2019, Canvey Island signed Johnson. In the summer Johnson moved to Canveys near neighbour's Bowers & Pitsea"]}]}}