{"wiki_id": "http://www.wikidata.org/entity/Q5163846", "itemLabel": "Constantine Richard Moorsom", "itemDescription": "British Royal Navy officer (1792-1861)", "wikipedia_url": "https://en.wikipedia.org/wiki/Constantine_Moorsom", "wikipedia_page": {"main": "Constantine Richard Moorsom (22 September 1792 – 26 May 1861) was a Vice-Admiral in the Royal Navy. He commanded HMS Fury a Hecla-class bomb vessel which saw wartime service in the Bombardment of Algiers, an attack on Barbary pirates at Algiers in HMS Fury in August, 1816. Moorsom was the son of Admiral Sir Robert Moorsom, a veteran of Trafalgar. Moorsom was on the roster of HMS Revenge, his father's ship, when it was at the Battle of Trafalgar. However records show that Constantine was actually at school at the time of the battle. Moorsom rose to be chairman of the London & North Western Railway.", "link_mentions": [{"page": "Toby Young", "response": ["Born in Buckinghamshire, Young was brought up in Highgate, North London, and in South Devon. His mother Sasha (1931–1993), daughter of Raisley Stewart Moorsom, a descendant of Admiral Sir Robert Moorsom, who fought at the Battle of Trafalgar, through his son, Vice-Admiral Constantine Richard Moorsom, chairman of the London and North-Western Railway,Burke's Peerage and Baronetage 1999, vol. 2, p. 3093 was a BBC Radio producer, artist and writer, and his father was Michael Young (later  Lord Young of Dartington), a Labour life peer and pioneering sociologist who coined the word meritocracy.Michael Young \"Down with meritocracy\", The Guardian, 29 June 2001. Retrieved 14 February 2010. Although entitled to use the style The Hon. Toby Young, he does not."]}, {"page": "William Moorsom", "response": ["With his experience of military surveying, Moorsom assisted in the construction of the London and Birmingham Railway construction of which had begun in 1833 and of which his eldest brother, Constantine Richard Moorsom was Secretary to the Board. Moorsom's survey of the valley of the Ouse allowed the railway line to be straightened, and eliminated the need for a large embankment.  This feat attracted the attention of Robert Stephenson. He then spent two years studying new railway lines all over the country and in 1836 undertook a survey of the country between Birmingham and Gloucester in order to build a railway. The Birmingham and Gloucester Railway had found Brunel's proposals out of its financial reach.  Moorsom's brief in 1836 was to build the line as cheaply as possible, which he did by following open country, thereby avoiding populated areas where land prices were higher.  Arriving at the Lickey Hills there was no option but to climb, using cable assistance if necessary."]}, {"page": "Robert Moorsom", "response": ["Robert Moorsom died peacefully in 1835 as a full Admiral of the Blue22 July 1830 and a Knight Commander of the Order of the Bath2 January 1815 and was buried at St Peter's Church, Cosgrove, Northamptonshire,Memorial plaque: St Peter’s Church where a memorial plaque to him and his wife Eleanor (sister of cotton milling entrepreneur Jonathan Scarth) can still be seen. Robert's legacy included his talent for poetry and drawing which he passed on to his two sons, Vice Admiral Constantine Richard Moorsom 1792-1861 and Captain William Scarth Moorsom, an early railway engineer.Jehanne Wake, Kleinwort, Benson: the history of two families in banking, p.89, accessed 18 November 2008 A descendant (via Constantine) is the English journalist Toby Young and Canadian journalist Richard Moorsom Harrison."]}]}}