{"wiki_id": "http://www.wikidata.org/entity/Q5162047", "itemLabel": "Connor Scarlett", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Connor_Scarlett", "wikipedia_page": {"main": "Connor Scarlett (born 1992) is an English actor from Crowborough, East Sussex.\nHe is best known for his role in the teenage drama series The Cut from the BBC. He joined the series at the beginning of Series 2, alongside Lara Goodison, Matt Kane, Samuell Benta and Tosin Cole and has become one of the leading characters in the show. He portrays Alex Fitzpatrick and resumed his role for Series 3. He also plays recurring character Quinn in Wizards vs Aliens.", "link_mentions": [{"page": "The Cut (British TV series)", "response": ["Alex Fitzpatrick (played by Connor Scarlett) is Tommy's younger brother, who is a 'nasty piece of work', possibly misunderstood."]}, {"page": "Lara Goodison", "response": ["Goodison is from Oxshott, Surrey, and was educated at St Teresa's School Effingham and Hurtwood House. She first gained public attention when she became a contestant on Shipwrecked in 2008, aged 18. During this she was placed 18th by Nuts in their list of the 50 Sexiest Reality TV Babes in May 2008. Prior to Shipwrecked, she had worked part-time in an old people's home, but after returning she pursued a career in acting, despite having no professional training. She appeared in the Doctor Who episode \"The Next Doctor\", before being cast alongside Samuell Benta, Matt Kane, Connor Scarlett and Tosin Cole in a main role as 17-year-old Marla Mackinnon in the BBC series The Cut, a role she continued in for the second and third series as well. She is the only actor to have appeared in every single episode of the drama series."]}, {"page": "Scarlett (surname)", "response": ["* Connor Scarlett (born 1992), British actor"]}, {"page": "List of The Cut characters", "response": ["|Alex Fitzpatrick || Connor Scarlett  || 2x01 - 3x12 || 25"]}, {"page": "Matt Kane", "response": ["Kane is best known for playing the main role of 18-year-old Stephen MackinnonStephen Mackinnon in the BBC teen drama series The Cut, alongside Samuell Benta, Lara Goodison, Connor Scarlett and Tosin Cole. He appeared prominently in the first two seasons of the drama series, but had a less important role in Series 3, appearing in four episodes out of twelve. His acting experience includes appearances in the BBC drama Casualty, Channel 4's Skins, the independent film The Dinosaur Project as Luke, Jace in ABC Family's Switched at Birth and as John Darling in Season 3 of ABC's Once Upon a Time. His feature directorial debut Auggie was released by Samuel Goldwyn Films in 2019."]}, {"page": "Wizards vs Aliens", "response": ["* Connor Scarlett as Quinn Christopher – Tom and Benny's classmate who used to tease Benny but eventually befriends him. Like Katie, he has no idea of Tom's true nature."]}]}}