{"wiki_id": "http://www.wikidata.org/entity/Q51756759", "itemLabel": "Melissa Courtney-Bryant", "itemDescription": "British female distance runner", "wikipedia_url": "https://en.wikipedia.org/wiki/Melissa_Courtney-Bryant", "wikipedia_page": {"main": "Melissa Courtney-Bryant (born 30 August 1993) is a British middle-distance runner who competes in the 1500 metres and 5000m. She holds personal bests of 4:01.81 minutes for the 1500m and 14:53.82 for the 5000m.Born in Poole, Dorset, she initially focused on swimming, but switched to running . She joined Poole Athletic Club (Poole AC) and worked under coach Mark Pauley from the age of twelve, as well as her father Mark as more runners joined the club. She credits her partner and fellow athlete, Ashley Bryant, which encouraging her to up her performance after a period of stagnation. After graduating from Brunel University London with a degree in sports psychology, she moved to train at Loughborough in 2017 to work with Rob Denmark.Courtney made big improvements to her 800 m and 1500 m bests in 2013 and won the latter event at the BUCS Championships indoor and out that year. In the 2014 indoor season she won the Welsh indoor title and placed third at the 2014 British Indoor Athletics Championships. The 2015 season saw her drop her 800 m and 1500 m bests to 2:05.48 and 4:09.74 minutes and she made her international debut at the 2015 European Athletics U23 Championships, placing tenth in the 1500 m. Though she placed seventh nationally at the 2016 British Athletics Championships, she ran a best of 4:07.55 minutes and gained selection for the 2016 European Athletics Championships, competing in the first round only. She teamed up with Cameron Boyek, Sarah McDonald, and Tom Marshall to take a gold medal in the inaugural mixed relay event at the 2017 European Cross Country Championships.After winning the 1500 m British Universities title, she represented Great Britain at the 2017 Universiade and placed fifth in the final. The winter, she travelled to train in Iten in Kenya. Courtney was chosen to represent Wales at the 2018 Commonwealth Games and she came away with the bronze medal in a personal best time of 4:03.44 minutes, beaten only by Caster Semenya and Beatrice Chepkoech.She won the 3000m event at the Karlsruhe meeting of the 2019 IAAF World Indoor Tour with a time of 8:43.36. In March that year she took bronze over the same distance in the European Indoor Championships, setting her personal best in the process.\n\n", "link_mentions": [{"page": "Paavo Nurmi Games", "response": ["|Melissa Courtney-Bryant"]}, {"page": "2020 in the sport of athletics", "response": ["| 9 || 4:01.81 || Melissa Courtney-Bryant ||align=left|"]}, {"page": "2020 British Indoor Athletics Championships", "response": ["|Melissa Courtney-Bryant || 9:48.54"]}, {"page": "Melissa Courtney", "response": ["#REDIRECT Melissa Courtney-Bryant"]}]}}