{"wiki_id": "http://www.wikidata.org/entity/Q5171067", "itemLabel": "Hugh Wheeler", "itemDescription": "British screenwriter (1912–1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Wheeler", "wikipedia_page": {"main": "Hugh Callingham Wheeler (19 March 1912 – 26 July 1987) was a British novelist, screenwriter, librettist, poet and translator. He resided in the United States from 1934 until his death and became a naturalized citizen in 1942. He had attended London University.Under the noms de plume Patrick Quentin, Q. Patrick and Jonathan Stagge, Wheeler was the author or co-author of many mystery novels and short stories.  In 1963, his 1961 collection, The Ordeal of Mrs. Snow was given a Special Edgar Award by the Mystery Writers of America. He won the Tony Award and the Drama Desk Award for Outstanding Book of a Musical in 1973 and 1974 for his books for the musicals A Little Night Music and Candide, and won both again in 1979 for his book for Sweeney Todd.\nWheeler is credited as \"research consultant\" for the film Cabaret, though numerous sources list him as co-writer of the screenplay.", "link_mentions": [{"page": "A Little Night Music", "response": ["A Little Night Music is a musical with music and lyrics by  Stephen Sondheim and book by Hugh Wheeler. Inspired by the 1955 Ingmar Bergman film Smiles of a Summer Night, it involves the romantic lives of several couples. Its title is a literal English translation of the German name for Mozart's Serenade No. 13, K. 525, Eine kleine Nachtmusik. The musical includes the popular song \"Send In the Clowns\".", "*The Quintet: Mr. Lindquist, Mrs. Nordstrom, Mrs. Anderssen, Mr. Erlanson and Mrs. Segstrom. A group of five singers that act as a Greek chorus. Sometimes referred to as the Liebeslieder Singers (love song singers) although Stephen Sondheim and Hugh Wheeler did not script them to have that title, using Quintet instead. The first usage of Liebeslieder for the Quintet came during the 1990 New York City Opera production. Prince said that these characters represent \"people in the show who aren't wasting time ... the play is about wasting time.\"", "| Hugh Wheeler", "| Hugh Wheeler", "Category:Musicals by Hugh Wheeler"]}, {"page": "Candide", "response": ["The operetta Candide was originally conceived by playwright Lillian Hellman, as a play with incidental music. Leonard Bernstein, the American composer and conductor who wrote the music, was so excited about the project that he convinced Hellman to do it as a \"comic operetta\".Peyser (1987), p. 247 Many lyricists worked on the show, including James Agee, Dorothy Parker, John Latouche, Richard Wilbur, Leonard and Felicia Bernstein, and Hellman. Hershy Kay orchestrated all the pieces except for the overture, which Bernstein did himself.  Candide first opened on Broadway as a musical on 1 December 1956. The premier production was directed by Tyrone Guthrie and conducted by Samuel Krachmalnick.Peyser (1987), p. 248 While this production was a box office flop, the music was highly praised, and an original cast album was made. The album gradually became a cult hit, but Hellman's libretto was criticised as being too serious an adaptation of Voltaire's novel.Peyser (1987), pp. 249–251 Candide has been revised and reworked several times. The first New York revival, directed by Hal Prince, featured an entirely new libretto by Hugh Wheeler and additional lyrics by Stephen Sondheim. Bernstein revised the work again in 1987 with the collaboration of John Mauceri and John Wells. After Bernstein's death, further revised productions of the musical were performed in versions prepared by Trevor Nunn and John Caird in 1999, and Mary Zimmerman in 2010."]}, {"page": "Stephen Sondheim", "response": ["Sweeney Todd: The Demon Barber of Fleet Street (1979), Sondheim's most operatic score and libretto (which, with Pacific Overtures and A Little Night Music, has been produced in opera houses), explores an unlikely topic: murderous revenge and cannibalism. The book, by Hugh Wheeler, is based on Christopher Bond's 1973 stage version of the Victorian original.Berkvist, Robert. \"Stephen Sondheim Takes a Stab at Grand Guignol\" . New York Times, February 25, 1979Wheeler, Hugh; Sondheim, Stephen. \"Sweeney Todd script, Introduction by Christopher Bond\". Hal Leonard Corporation, 1991, , p. 1Brown, Larry. \"'Sweeney Todd' Notes\" . Larryavisbrown.homestead.com. Retrieved March 22, 2010 The show has since been revived on Broadway twice (1989, 2005), and has been performed in musical theaters and opera houses alike. It ran off-Broadway at the Barrow Street Theatre until August 26, 2018.", "Around 1960, Sondheim has mentioned, he and Burt Shevelove considered making a musical of the film Sunset Boulevard, and had sketched out the opening scenes when they approached the film's director Billy Wilder at a cocktail party on the possibility. Wilder rejected the idea, believing the story was more suited to opera than musical theater. Sondheim agreed, and resisted a later offer from Hal Prince and Hugh Wheeler to create a musical version starring Angela Lansbury. This occurred several years before a musical version was produced by Andrew Lloyd Webber.Sondheim, Stephen (2011). Look I Made a Hat: Collected Lyrics (1981-2011) with Attendant Comments, Amplifications, Dogmas, Harangues, Digressions, Anecdotes and Miscellany. Alfred A. Knopf. p. 146", "|1973 || A Little Night Music || Music & lyrics || colspan=2 align=\"center\"|Stephen Sondheim || align=\"center\"|Hugh Wheeler ||", "|1979 || Sweeney Todd || Music & lyrics || colspan=2 align=\"center\"|Stephen Sondheim || align=\"center\"|Hugh Wheeler || "]}, {"page": "Sweeney Todd", "response": ["The original tale became a staple of Victorian melodrama and London urban legend. A barber from Fleet Street, Todd murders his customers with a straight razor and turns their bodies over to Mrs. Lovett, his partner in crime, who bakes their flesh into meat pies. The tale has been retold many times since in various media, most notably in the Tony award–winning Broadway musical Sweeney Todd: The Demon Barber of Fleet Street by Stephen Sondheim and Hugh Wheeler. The 1979 musical and its 2007 film adaptation, both based on Christopher Bond's 1973 play of the same name, significantly deepened Todd’s character. They depict him as former prisoner Benjamin Barker, who becomes obsessed with murdering Turpin, the judge who unjustly convicted him and destroyed his family.", "* Sweeney Todd: The Demon Barber of Fleet Street. A Musical Thriller (1979), is a musical adaptation of Bond's play by Stephen Sondheim and Hugh Wheeler. The show opened on Broadway in 1979 and in London's West End in 1980. The show won multiple awards including the Tony Award for Best Musical and the Laurence Olivier Award for Best New Musical. There have since been several revivals in the West End, on Broadway and elsewhere."]}, {"page": "Shirley Jackson", "response": ["*Jackson's 1962 novel, We Have Always Lived in the Castle, was adapted for the stage by Hugh Wheeler in the mid-1960s. Directed by Garson Kanin, starring Shirley Knight, it opened on Broadway on October 19, 1966. The David Merrick production closed after only nine performances at the Ethel Barrymore Theatre, but Wheeler's play continues to be staged by regional theater companies. "]}, {"page": "1979 in music", "response": ["* Sweeney Todd (Music and Lyrics: Stephen Sondheim, Book: Hugh Wheeler) – Broadway production opened at the Uris Theatre on March 1 and ran for 557 performances"]}, {"page": "Royal National Theatre", "response": ["* Sweeney Todd by Stephen Sondheim and Hugh Wheeler, directed by Declan Donnellan (1993)", "* A Little Night Music by Stephen Sondheim and Hugh Wheeler, directed by Sean Mathias, with Judi Dench (1995)"]}, {"page": "John Gielgud", "response": ["During the early 1960s Gielgud had more successes as a director than as an actor. He directed the first London performance of Britten's opera A Midsummer Night's Dream (1961) at Covent Garden and Hugh Wheeler's Big Fish, Little Fish on Broadway, the latter winning him a Tony for Best Direction of a Play in 1961. His performance as Othello at Stratford in the same year was less successful; Franco Zeffirelli's production was thought ponderous and Gielgud \"singularly unvehement\".Hope-Wallace, Philip. \"Zeffirelli's Othello\", The Guardian, 11 October 1961, p. 9 As Gaev in The Cherry Orchard to the Ranevskaya of Ashcroft he had the best of the notices; his co-star and the production received mixed reviews.\"Uneasy Compromise on Chekhov\", The Times, 15 December 1961, p. 16; and Tynan, Kenneth. \"Orchard in the waste land\", The Observer, 17 December 1961, p. 21 The following year Gielgud directed Richardson in The School for Scandal, first at the Haymarket and then on a North American tour, which he joined as, in his words, \"the oldest Joseph Surface in the business\".Miller, p. 185"]}, {"page": "1980 in film", "response": ["| Nijinsky || Paramount Pictures / Hera Productions || Herbert Ross (director); Hugh Wheeler, Romola Nijinsky, Vaslav Nijinsky (screenplay); Alan Bates, Leslie Browne, George de la Peña, Alan Badel, Colin Blakely, Carla Fracci, Ronald Pickup, Vernon Dobtcheff, Frederick Jaeger, Janet Suzman, Siân Phillips, Ronald Lacey, Jeremy Irons, Anton Dolin, Hetty Baynes || Biography || Live action"]}, {"page": "1977 in film", "response": ["| A Little Night Music || New World Pictures || Harold Prince (director); Hugh Wheeler (screenplay); Elizabeth Taylor, Diana Rigg, Len Cariou, Lesley-Anne Down, Hermione Gingold, Laurence Guittard, Christopher Guard, Lesley Dunlop, Heinz Marecek, Chloe Franks, Jonathan Tunick || Musical || Live Action "]}, {"page": "1961 in literature", "response": ["*March 15 – Hugh Wheeler's comedy Big Fish, Little Fish opens at the ANTA Theater in New York City, directed by Sir John Gielgud. It is one of the early Broadway plays to explore frankly the issue of male homosexuality."]}, {"page": "Lillian Hellman", "response": ["* Candide (1956) (book, with Hugh Wheeler)"]}, {"page": "Travels with My Aunt", "response": ["The novel was adapted, with large departures from the original story, for a film in 1972, written by Jay Presson Allen and Hugh Wheeler, and directed by George Cukor, starring Maggie Smith and Alec McCowen."]}, {"page": "Cabaret (1972 film)", "response": ["As production neared, Fosse became increasingly dissatisfied with Allen's script which was based on Joe Masteroff's original book of the stage version. Fosse hired Hugh Wheeler to rewrite and revise Allen's work. Wheeler was referred to as a \"research consultant,\" and Allen retained screenwriting credit. Wheeler, a friend of Christopher Isherwood, knew that Isherwood had been critical of the stage musical due to its bowdlerizations of his material. Wheeler went back to Isherwood's original stories in order to ensure a more faithful adaptation of the source material. In particular, Wheeler restored the subplot about the gigolo and the Jewish heiress. Wheeler also drew on gay author Christopher Isherwood's openness about his homosexuality to make the leading male character a bisexual man \"rather than the heterosexual as he had been in the stage musical.\""]}, {"page": "Tony Award for Best Musical", "response": ["| Hugh Wheeler", "| Hugh Wheeler", "| Hugh Wheeler"]}, {"page": "Tony Award for Best Revival", "response": ["| Hugh Wheeler"]}, {"page": "Tony Award for Best Revival of a Musical", "response": ["| Lillian Hellman & Hugh Wheeler", "| Hugh Wheeler", "| Hugh Wheeler"]}, {"page": "Wheeler (surname)", "response": ["* Hugh Wheeler (1912–1987), English writer"]}, {"page": "Christopher Bond", "response": ["Christopher Godfrey Bond (born in Uckfield, Sussex, England, 1945) is a British actor, playwright and theatre director whose 1970 retelling of the Victorian tale Sweeney Todd formed the basis of Stephen Sondheim's musical of the same name, with book by Hugh Wheeler. He wrote this while he was Resident Dramatist at Victoria Theatre, Stoke-on-Trent 1970 – 1971. He was Artistic Director of the Everyman Theatre, Liverpool 1976 – 1978, Director of Liverpool Playhouse 1981 – 1983, and Artistic Director of Half Moon Theatre 1984 – 1989.Chris Bond – Stages of Half Moon He lives in West Cornwall."]}, {"page": "Denis Quilley", "response": ["Quilley returned to musicals in 1980, playing the title role in the first London production of Hugh Wheeler and Stephen Sondheim's Sweeney Todd. He won his second SWET award for the performance. He continued to divide his time between the musical and non-musical theatre. In 1983 he played Jupiter/Napoleon III in the BBC television production of Orpheus in the Underworld.\"Orpheus in the Underworld\", British Film Institute, retrieved 10 April 2013. In 1984 Quilley appeared on the original concept album for the musical Chess as Molokov. In 1985 at the Chichester Festival he co-starred with Diana Rigg in Antony and Cleopatra.Wardle, Irving. Theatre, The Times, 16 May 1985, p. 10 Later that year he was in a BBC Mini-series Murder of a Moderate ManO'Connor, John. TV Review \"Mini-Series From BBC, Murder of Moderate Man\", New York Times, 22 January 1988 and a West End thriller, Fatal Attraction, before returning to musical theatre, in La Cage aux Folles in 1986. He played Georges, the partner of the flamboyant Albin (George Hearn). In The Guardian Michael Billington wrote that Quilley made his character \"dapper, ebullient and tender: he persuades you he might have both sired a son and loved a man.\"Billington, Michael. \"A gay night at home with the boys\", The Guardian, 9 May 1986, p. 12 In 1989 he played Francisco Pizarro in a national tour of The Royal Hunt of the Sun. Billington commented that Quilley \"conveys Pizzaro's journey from tough, hard brutal commander to enraptured idolater and, finally, grieving lover: he is at once indisputably masculine and a figure skittishly enlivened by his rival's physical presence.\"Billington, Michael. \"An Indian love story\", The Guardian, 6 September 1989, p. 46"]}, {"page": "List of musicals: A to L", "response": ["| Hugh Wheeler"]}]}}