{"wiki_id": "http://www.wikidata.org/entity/Q5174245", "itemLabel": "Cosmo Bonsor", "itemDescription": "British politician (1848-1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cosmo_Bonsor", "wikipedia_page": {"main": "Sir Henry Cosmo Orme Bonsor, 1st Baronet, DL  (2 September 1848 – 4 December 1929) was an English brewer and businessman and a Conservative politician who sat in the House of Commons from 1885 to 1900.\nBonsor was the son of Joseph Bonsor of Polesden Lacey. He was educated at Eton and with his father and brother became a partner in the brewing firm of Combe & Co. He was a director of the Bank of England, and a Governor of Guy's Hospital.In 1885 Bonsor was elected M.P. for Wimbledon and held the seat until 1900.  Also in 1885, Bonsor purchased the estate of Kingswood Warren, Surrey from Sir John Cradock Hartopp and lived there until 1906 when he put it on the market because of the rising cost of maintenance.In 1897 Bonsor became chairman of the South Eastern Railway and in the same year the railway line was extended from Purley railway station to Kingswood railway station. In 1898 he organised the brewery amalgamation to form Watney Combe & Reid, of which he remained chairman until 1928. In 1899 he arranged the amalgamation of the South Eastern Railway and the London Chatham & Dover Railway, and became chairman of the managing committee. In the same year he formed a private syndicate to extend the Tattenham Corner Line from Kingswood to Tattenham Corner railway station to take the racegoing traffic to Epsom Downs Racecourse. A train named in his honour formerly ran as part of the Southern services to London Bridge. The train stock was of Class 456.Bonsor was created a baronet on 26 January 1925. He died four years later at the age of 81 in Nice. He was buried in St Andrew's churchyard. Bonsor was a public benefactor and was loved locally for his kindness and generosity to all.Bonsor married Emily Gertrude Fellowes in 1872. His son Reginald succeeded to the baronetcy.", "link_mentions": [{"page": "South Eastern Railway (England)", "response": ["During the early 1890s competition between the SER and the LCDR reached ruinous proportions with both companies offering nearly identical services to and from the same towns, which inevitably lost money for both companies. However, following the resignation of Watkin in 1894, relations between the two companies gradually improved under his successors Sir George Russell (1895) and, most notably, under Cosmo Bonsor (1897). Bonsor managed to persuade the two boards of governors to see sense and from 1 January 1899 the South Eastern and Chatham Railways Joint Management Committee was formed to oversee joint working, with Bonsor as its chairman. On 5 August 1899 the South Eastern and London, Chatham and Dover Railway Companies Act was passed, which resulted in the formation of the South Eastern and Chatham Railway (SE&CR). This was not a true merger since each company kept its individual board of directors within the organisation."]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Cosmo Bonsor "]}, {"page": "Tattenham Corner line", "response": ["The line was opened in two parts. The first stage was built from Purley as far as Kingswood as the Chipstead Valley Railway. Local MP and Chairman of the South Eastern Railway at the time, Sir Cosmo Bonsor proposed the line in 1893. However, given the difficult terrain of the route which would have involved deep cuttings and tight bends, the idea was met by some opposition from his fellow directors. Despite this, construction eventually began in 1896 and on 2 November 1897 a single-track line to Kingswood (originally Kingswood and Burgh Heath) was complete.", "In 1899 Sir Cosmo Bonsor formed a private syndicate to have the line extended from Kingswood to its current terminus at Tattenham Corner in order to catch the racegoing traffic. By Derby Day on 4 June 1901, the extension to Tattenham Corner was opened, during which time the line was also upgraded from single to double track."]}, {"page": "Wimbledon (UK Parliament constituency)", "response": ["||1885 || Cosmo Bonsor || Conservative"]}, {"page": "South Eastern Main Line", "response": ["In 1903, the SECR obtained powers to electrify their lines. At a meeting in 1913, SECR chairman H. Cosmo Bonsor expressed the opinion that the time was not right for the company to incur the heavy expenditure that electrification would incur. The outbreak of war meant the postponement of any plans to electrify suburban lines. With the passing of the Trades Facilities Act 1922, the SECR proposed to electrify a number of lines in three stages. The SEML was to be partly electrified as follows - Charing Cross and  to Orpington as part of Stage 1. Orpington to Tonbridge as part of Stage 2, which also included the electrification of the former SEML between Redhill and Tonbridge. Both stages only covered the working of local passenger trains on the lines that were electrified. Stage 3 was to extend the working to through passenger trains and freight. Permission was sought in 1922 to build an electricity generating station at Charlton, London. This was refused by the Electricity Commissioners, who insisted that the company bought electricity from an existing supply company. Objections to this by the SECR were not entertained. On 1 January 1923, the SECR became part of the Southern Railway (SR). "]}, {"page": "Alfred Downing Fripp (surgeon)", "response": ["In 1883, on a visit to Cambridge to visit his sister, Fripp called on his godfather, John Neale Dalton, at Trinity, where the Canon was acting as 'chaperone' to Prince Albert Victor to whom Fripp was introduced. A year later he spent a few days at Cambridge in Prince \"Eddy's\" company. Six years passed in medical studies, sporting activities and theatre-going, when he accepted a two-week job as a locum tenens for Dr. Jalland, M. D., and an old Guy's man - in York. As Prince Eddy was stationed in the area and had to be attended to, they met up again. The Prince insisted that he accompany him to Deeside where Fripp became an accepted, if unofficial, doctor-in-residence to the Prince and other members of the Royal Family. Fripp was sent with Eddy on a Royal Tour to South Wales - with only the Prince's equerry, George Holford, in attendance. At the age of twenty-four, and still with exams to pass, he had the seal of Royal approval. When his \"hope of hopes\",Alfred Fripp by Cecil Roberts Prince Albert Victor, died in the 'flu' epidemic of 1892, he thought his Royal days were over; but four years later Edward, Prince of Wales, made him his Surgeon-in-Ordinary. With Holford's help and his own persistence, he persuaded Edward to preside over the Guy's Hospital Fund, ensuring the financial security of the Hospital - before he had been given a post there. However, after this Cooper Perry and Cosmo Bonsor persuaded the Board to create an Assistant Surgeon post for him. This, and his private practice in his brother-in-law's house in Harley Street, established him as a doctor, teacher and surgeon. A year later, just before his marriage, he set up as a consultant in his own home, 19 Portland Place. For the next thirty years aristocrats, plutocrats and famous stage personalities were frequent visitors - most as patients and friends."]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Cosmo Bonsor "]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Cosmo Bonsor "]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Cosmo Bonsor "]}, {"page": "Henry Bonsor", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "Henry Cosmo Orme Bonsor", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "Sir Henry Cosmo Orme Bonsor, 1st Baronet", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "HCO Bonsor", "response": ["#REDIRECT Cosmo Bonsor "]}, {"page": "Sir (Henry) Cosmo Orme Bonsor, 1st Baronet", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "Henry Cosmo Orme Bonsor, 1st Baronet", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "Cosmo Orme Bonsor", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "Cosmo (name)", "response": ["* Cosmo Bonsor, 1st Baronet (1848–1929), British MP, chairman of the South Eastern Railway"]}, {"page": "Charles Surtees", "response": ["His wife died on 5 November 1882. Surtess died on 22 December 1906 at the Charing Cross Hotel in London. His funeral was held on 27 December at Long Ditton and was attended by Lady Paget, Col. Surtees, Horace Avery K.C., Mr. Sheath (Secretary of the South Eastern Railway Company), and Cosmo Bonsor among others."]}, {"page": "Sir Cosmo Bonsor, 1st Baronet", "response": ["#REDIRECT Cosmo Bonsor"]}, {"page": "Reginald Hildyard", "response": ["On 23 November 1911, Hildyard married Muriel Mary Bonsor (1887–1975), the daughter of Sir Cosmo Bonsor, 1st Baronet, by his second marriage to Mabel Grace Brand., Retrieved 15 February 2011"]}, {"page": "William Herbert Fowler", "response": ["Fowler's brother-in-law, Sir Cosmo Bonsor approached him in 1899 about the possibility of making a golf course on Walton Heath, in Surrey, England. Three years later, Bonsor bought the ground and gave Fowler the task of designing the course. Fowler's first opinion was that \"there was very little to make one suppose that a first-class course could be made upon it [Walton Heath].\" When the course was opened in 1904, it was an instant success. He believed strongly that courses should follow the contours of the land, and have a natural feeling, shunning the use of \"man-made contrivances\", believing that topography could test the world's best golfers just as adequately. He had strong views on many aspects of a golf course, including bunkers, which he believed should have gradual slopes to allow the ball to roll to the base. Contemporaries suggested that he designed large courses that would favour big hitters such as himself, but Fowler strenuously denied this, always claiming that they were designed with fairness in mind. He was described in a book by Bernard Darwin as \"perhaps the most daring and original of all golfing architects, and gifted with an inspired eye for the possibility of a golfing country\". He designed a number of other golf courses in the United Kingdom and the United States, including the Crystal Springs Course, Beau Desert Course, and in 1922 he redesigned the 18th hole of the Pebble Beach Golf Links. He had been hired to redesign the Del Monte Golf Course, but also made some suggestions to update the Pebble Beach course, which were ignored. However, during a 1921 championship, the course owners received complaints about the short 18th hole, and asked Fowler to resolve the problem. He added just under 200 yards to the hole, transforming it from a 379-yard par 4 to a 548-yard par 5."]}, {"page": "Bonsor", "response": ["*Sir Cosmo Bonsor (1848–1929), English brewer, businessman and politician"]}, {"page": "List of Vanity Fair (British magazine) caricatures (1895–1899)", "response": ["|1898-06-3030 Jun 1898||Bonsor-CosmoCosmo Bonsor MP||The Wimbledon Division||Spy||S 697||25px"]}, {"page": "List of places of worship in Reigate and Banstead", "response": ["Restoration work was not the only theme of the 19th century. The growth of the main towns in the Victorian era and into the 20th century prompted the building of many more Anglican churches.  In Reigate, St Mark (1860) and St Luke (1871) supplemented the old parish church, and St Philip (1863) was built a chapel of ease to St Mark. Redhill could no longer rely on Reigate's churches as the opening of the railway transformed it from \"a country common into one of the most important towns in Surrey\", so St John the Evangelist (1843), St Matthew (1866) and Holy Trinity (1906) were provided. A church once existed in Burgh Heath in Banstead parish, but as early as 1725 \"no service [had] been held there within living memory\" and the last traces of it disappeared in the late 19th century. A replacement dedicated to St Mary was built in 1908–09. Kingswood was originally a liberty and an exclave of Ewell parish; churches were built in the village (St Andrew, 1848–52) and at Lower Kingswood (originally dedicated to St Sophia, then to Jesus Christ the Wisdom of God). The latter, opened as a mission church in 1891 by Cosmo Bonsor, is a remarkable Byzantine-style building decorated with many types of marble and with remains taken from ancient sites in the Near and Middle East. Among these are capitals retrieved from such places as the northern quarter of Ephesus and the Monastery of Stoudios, St Mary's Church at Blachernae, the Palace of Blachernae, the Church of the Pantocrator and another church which is now the Eski Imaret Mosque, all in Constantinople. More modest Anglican churches were provided in the early 20th century at Tadworth (originally in Kingswood parish) in 1912 and Nork (1930), and in the Victorian era at Sidlow (1861) and South Merstham (1898). The last named church was destroyed by a World War II bomb and had to be rebuilt; designed by E.F. Starling and opened in 1951, the new building may have been the first postwar church built for the Diocese of Southwark. Nearby, the Church of the Epiphany was founded in 1955 on a housing estate built by London County Council near Merstham railway station, and in the same year St Peter's Church was built to serve housing development south of Reigate town centre. (Both of the 1955 churches closed within 60 years: St Peter's went out of use in 2008, and the Diocese of Southwark closed the Church of the Epiphany in January 2015 and revoked its marriage licence with effect from 30 April that year.) Horley's rapid postwar growth also necessitated the opening of two churches to supplement St Bartholomew's: St Francis and St Wilfrid date from 1958 and 1970 respectively; and at Salfords, a residential area north of Horley, a church was completed in 1967. Two unusual Anglican churches can be found on Reigate Heath: a tin tabernacle opened in 1907, and 27 years earlier the roundhouse of an 18th-century windmill was converted into the Chapel of St Cross (now Reigate Mill Church). English Heritage state that this is \"probably the only windmill in England in use as a church\".", "|A \"most remarkable\" church, especially for its opulent interior, this was designed by Sidney Barnsley in 1891 at the request of Edwin Freshfield and Cosmo Bonsor.  The Free Byzantine brick exterior leads to a nave and chancel without any separation and a polygonal apse. Corinthian capitals inside include some from the 4th and 6th centuries, retrieved from churches and other sites in Ephesus and Constantinople."]}]}}