{"wiki_id": "http://www.wikidata.org/entity/Q51754519", "itemLabel": "Jeannette Ng", "itemDescription": "British fantasy writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeannette_Ng", "wikipedia_page": {"main": "Jeannette Ng (Chinese: 吳志麗) is a British fantasy writer best known for her 2017 novel Under the Pendulum Sun, for which she won the Sydney J Bounds Award for Best Newcomer at the 2018 British Fantasy Awards. She was the winner of the 2019 John W. Campbell Award for Best New Writer, shortly afterward renamed the Astounding Award for Best New Writer.", "link_mentions": [{"page": "John W. Campbell", "response": ["Shortly after Campbell's death, the University of Kansas science fiction program — now the Center for the Study of Science Fiction — established the annual John W. Campbell Memorial Award for Best Science Fiction Novel and also renamed after him its annual Campbell Conference. The World Science Fiction Society established the annual John W. Campbell Award for Best New Writer. All three memorials became effective in 1973. However, following Jeannette Ng's August 2019 acceptance speech of the award for Best New Writer at Worldcon 77, in which she criticized Campbell's politics and called him a fascist, the publishers of Analog magazine announced that the John W. Campbell Award for Best New Writer would immediately be renamed to \"The Astounding Award for Best New Writer\"."]}, {"page": "Astounding Award for Best New Writer", "response": ["Between its founding in 1973 and 2019, the award was named after Astoundings long-time editor John W. Campbell, one of the most influential figures in the early history of science fiction. In the aftermath of 2019 winner Jeannette Ng's acceptance speech, in which she described Campbell as a fascist, the science fiction fandom community discussed whether it was appropriate to continue honoring Campbell in this way; the editor of Analog subsequently announced that the award had been renamed."]}, {"page": "Jeanette (given name)", "response": ["* Jeannette Ng, Hong Kong-born British fantasy author"]}, {"page": "Ng (name)", "response": ["*Jeannette Ng, Hong Kong-born British fantasy author"]}, {"page": "British Fantasy Award", "response": ["* Under the Pendulum Sun, by Jeannette Ng (Angry Robot)", "* Jeannette Ng, for Under the Pendulum Sun (Angry Robot)"]}, {"page": "Fantasticon", "response": ["2018: Jeannette Ng, Lavie Tidhar"]}, {"page": "Hugo Award for Best Related Work", "response": ["| * || \"2019 John W. Campbell Award Acceptance Speech\" || Jeannette Ng"]}, {"page": "Alec Nevala-Lee", "response": ["Analog editor Trevor Quachri partially credited the critical picture of John W. Campbell in Nevala-Lee's book with the decision to rename the John W. Campbell Award for Best New Writer, which became the Astounding Award in August 2019. “Reading an early draft of Alec’s book is when I realized that the name change would need to happen eventually,” Quachri told The New York Times, and Nevala-Lee stated that he supported the change: “It was clearly the right call. At this point, the contrast between Campbell’s racism and the diversity of the writers who have recently received the award was really just too glaring to ignore.” In her acceptance speech for the 2020 Hugo Award for Best Related Work, writer Jeannette Ng, whose speech criticizing Campbell the previous year was widely seen as catalyzing the name change, thanked Nevala-Lee, \"who wrote the book and brought the receipts.\""]}, {"page": "77th World Science Fiction Convention", "response": ["* John W. Campbell Award for Best New Writer: Jeannette Ng, for Under the Pendulum Sun", "Following Jeannette Ng's acceptance speech of the award for Best New Writer, in which she called out Campbell's politics, referring to him as a \"fascist\", the publishers of Analog magazine announced that the John W. Campbell Award for Best New Writer would immediately be renamed to \"The Astounding Award for Best New Writer\"."]}, {"page": "78th World Science Fiction Convention", "response": ["* Best Related Work: \"2019 John W. Campbell Award Acceptance Speech\", by Jeannette Ng"]}, {"page": "Jeanette Ng", "response": ["#REDIRECT Jeannette Ng"]}, {"page": "Under the Pendulum Sun", "response": ["Under the Pendulum Sun is a 2017 fantasy novel by British writer Jeannette Ng. Ng's debut novel, it was published by Angry Robot.", "Publishers Weekly considered it \"intriguing but unfocused,\" with \"possibilities (that) are fascinating\" and \"period touches (that) satisfy,\" but an \"unwieldy\" plot. Under the Pendulum Sun, reviewed at Publishers Weekly; published October 30, 2017; retrieved September 16, 2018 James Nicoll called it \"engaging,\" with Arcadia being an \"odd and melancholy world,\" and lauded Ng's choice to reveal only the \"shadow of (her) worldbuilding, (such that readers) are left to puzzle out the larger implications on their own.\"Sometimes In My Dreams: Under the Pendulum Sun, by Jeannette Ng, reviewed by James Nicoll, published March 13, 2018; retrieved September 16, 2018  Jeff Somers, listing it among his \"50 of the Greatest Science Fiction & Fantasy Debut Novels Ever Written,\" called it \"a truly original fantasy debut built on a truly genius premise.\""]}]}}