{"wiki_id": "http://www.wikidata.org/entity/Q5181048", "itemLabel": "Craig Hinchliffe", "itemDescription": "Scottish association football player (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Hinchliffe", "wikipedia_page": {"main": "Craig Hinchliffe (born 5 May 1972) is a Scottish former professional footballer who played as a goalkeeper. He is currently the goalkeeping coach at Motherwell.", "link_mentions": [{"page": "Motherwell F.C.", "response": ["| Goalkeeping Coach || Craig Hinchliffe"]}, {"page": "Partick Thistle F.C.", "response": ["McNamara and assistant Simon Donnelly guided Thistle to a sixth-place finish in 2011–12 season. The following season Thistle started well and emerged as promotion candidates, competing with Dunfermline and Greenock Morton for a place in the following season's top flight. On 29 January 2013 the club gave permission to Dundee United to speak to McNamara about becoming their new manager. The following day McNamara and his assistant Simon Donnelly resigned, to become the new management team at United. Along with Donnelly, Jackie McNamara brought goalkeeper Craig Hinchliffe, Paul Paton and Chris Erskine to Tannadice. Thistle were second in the league at the time and, because McNamara was under contract, compensation was owed to the club."]}, {"page": "Chris Smith (footballer, born 1986)", "response": ["He then signed a contract to keep him at St Mirren until the summer of 2011. Following the departure of Tony Bullock and Craig Hinchliffe, he became the first choice goalkeeper for the Buddies, although he suffered a cruciate ligament injury in March 2009. He was a regular in the Scotland under-21 squad. For the 2009–10 season, Smith's number 1 shirt was given to new signing Paul Gallacher and he was given 30 instead."]}, {"page": "2007–08 St Mirren F.C. season", "response": ["| Craig Hinchliffe || Partick Thistle || Free "]}, {"page": "2007–08 Partick Thistle F.C. season", "response": ["|Craig Hinchliffe||13||0||0||0||0"]}, {"page": "2008–09 Partick Thistle F.C. season", "response": ["|Craig Hinchliffe||3||0||0||0||0", "|Craig Hinchliffe||3||1||0||0||0"]}, {"page": "2005 Scottish Challenge Cup Final", "response": ["|GK ||17 || Craig Hinchliffe"]}, {"page": "2009–10 Partick Thistle F.C. season", "response": ["| Craig Hinchliffe||1 (0)||0||0||0", "|  Craig Hinchliffe || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 0 || 0 "]}, {"page": "2011–12 Partick Thistle F.C. season", "response": ["|||GK|| Craig Hinchliffe"]}, {"page": "2005–06 St Mirren F.C. season", "response": ["|align=\"left\"|GK||align=\"left\"| Craig Hinchliffe"]}, {"page": "Hinchliffe", "response": ["*Craig Hinchliffe (born 1972), Scottish footballer"]}, {"page": "2015–16 York City F.C. season", "response": ["Lowe left the club by mutual consent, having earlier been made available for loan by McNamara. Goalkeeping coach Andy Leaning left the club, and was replaced by Craig Hinchliffe, who worked with McNamara at Dundee United. Lussey's loan came to a premature end, after he tore a muscle. York dropped to the bottom of the table after being beaten 2–1 away by Bristol Rovers, in which they took the lead on 41 minutes with an eight-yard volley scored by Oliver. Jermaine Easter equalised for Rovers on 71 minutes, before Matty Taylor scored their winning goal in stoppage time. Cresswell and Greening left the club by mutual consent, while Steve Torpey returned as youth-team coach. York won for the first time in 10 matches after beating Morecambe 2–1 at home, which saw them move out of the relegation zone. Winfield opened the scoring with a header from Berrett's cross on 38 minutes, and Berrett doubled the lead in the 52nd minute with a low shot from the edge of the penalty area, before Jamie Devitt scored a consolation goal for Morecambe two minutes later. York drew 1–1 away to Mansfield, taking the lead on 10 minutes when Winfield touched in Summerfield's free kick, before the home team equalised later in the first half through Krystian Pearce."]}, {"page": "Craig Hinchcliffe", "response": ["#REDIRECT Craig Hinchliffe"]}]}}