{"wiki_id": "http://www.wikidata.org/entity/Q518970", "itemLabel": "John Craxton", "itemDescription": "British artist (1922-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Craxton", "wikipedia_page": {"main": "John Leith Craxton RA, (3 October 1922 – 17 November 2009) was an English painter. He was sometimes called a neo-Romantic artist but he preferred to be known as a \"kind of Arcadian\".", "link_mentions": [{"page": "Chania", "response": ["* John Craxton (1922–2009), painter and British honorary consul"]}, {"page": "List of oboists", "response": ["* Janet Craxton (1929–1981), English * (Sister of the painter John Craxton)"]}, {"page": "Landscape", "response": ["The term neo-romanticism is applied in British art history, to a loosely affiliated school of landscape painting that emerged around 1930 and continued until the early 1950s.It was first labeled in March 1942 by the critic Raymond Mortimer in the New Statesman. These painters looked back to 19th-century artists such as William Blake and Samuel Palmer, but were also influenced by French cubist and post-cubist artists such as Pablo Picasso, André Masson, and Pavel Tchelitchew.   This movement was motivated in part as a response to the threat of invasion during World War II. Artists particularly associated with the initiation of this movement included Paul Nash, John Piper, Henry Moore, Ivon Hitchens, and especially Graham Sutherland. A younger generation included John Minton, Michael Ayrton, John Craxton, Keith Vaughan, Robert Colquhoun, and Robert MacBryde."]}, {"page": "Lucian Freud", "response": ["In 1943, the poet and editor Meary James Thurairajah Tambimuttu commissioned the young artist to illustrate a book of poems by Nicholas Moore entitled The Glass Tower. It was published the following year by Editions Poetry London and comprised, among other drawings, a stuffed zebra and a palm tree. Both subjects reappeared in The Painter's Room on display at Freud's first solo exhibition in 1944 at the Lefevre Gallery. In the summer of 1946, he travelled to Paris before continuing to Greece for several months to visit John Craxton.\"From late 1946 to early 1947, he and Freud painted on Poros\" – John Craxton Guardian Obituary In the early fifties he was a frequent visitor to Dublin where he would share Patrick Swift's studio.\"He had met Freud by 1949...the acquaintance was well-developed by 1950 when we shared the ground-floor of a house in Hatch Street together. Lucian, who was staying in Ireland, used to come around in the mornings to paint, so that sometimes when I would surface around ten or eleven I would find them both at work in the studio next door.\" — Anthony Cronin, Patrick Swift (1927–83), IMMA Retrospective Catalogue, 1993; \"Freud… came to Dublin in 1948… In September 1951 Kitty Garman wrote to her mother… She mentions Freud working on a painting in Paddy Swift's Hatch Street studio, Dead Cock's Head 1951\" – Freud: Prophet of Discomfort , Mic Moroney, Irish Arts Review, 2007 He remained a Londoner for the rest of his life."]}, {"page": "Neo-romanticism", "response": ["In British art history, the term \"neo-romanticism\" is applied to a loosely affiliated school of landscape painting that emerged around 1930 and continued until the early 1950s. It was first labeled in March 1942 by the critic Raymond Mortimer in the New Statesman. These painters looked back to 19th-century artists such as William Blake and Samuel Palmer, but were also influenced by French cubist and post-cubist artists such as Pablo Picasso, André Masson, and Pavel Tchelitchew (; ). This movement was motivated in part as a response to the threat of invasion during World War II. Artists particularly associated with the initiation of this movement included Paul Nash, John Piper, Henry Moore, Ivon Hitchens, and especially Graham Sutherland. A younger generation included John Minton, Michael Ayrton, John Craxton, Keith Vaughan, Robert Colquhoun, and Robert MacBryde ."]}, {"page": "List of British painters", "response": ["*John Craxton (1922–2009)"]}, {"page": "List of dance personalities", "response": ["* John Craxton"]}, {"page": "Chelsea College of Arts", "response": ["* John Craxton (Neo-Romantic artist)"]}, {"page": "1922 in the United Kingdom", "response": ["* 3 October – John Craxton, painter (died 2009)"]}, {"page": "Geoffrey Grigson", "response": ["In 1946 Grigson was one of the founders of the Institute of Contemporary Arts (ICA) in London, together with Roland Penrose, Herbert Read, Peter Watson and Peter Gregory.\"History\", ICA website.Barry Miles, London Calling: A Countercultural History of London since 1945, Atlantic Books, 2010. In 1951 Grigson curated an exhibition of drawings and watercolours drawn from the British Council Collection, which for three decades toured worldwide to 57 art galleries and museums.\"British Drawings and Watercolours of the 20th Century from the Collection of the British Council\", Visual Arts, British Council The exhibition consisted of more than 100 works, including those of David Bomberg, Edward Burra, Cecil Collins, John Craxton, Frances Hodgkins, Barbara Hepworth, Augustus John, David Jones, Wyndham Lewis, John Minton, Henry Moore, Paul Nash, Ben Nicholson, Eduardo Paolozzi, John Piper, Graham Sutherland and Edward Wadsworth.", "In 2007 Pallant House Gallery in Chichester presented the exhibition Poets in the Landscape: The Romantic Spirit in British Art. The exhibition explored \"the creative links between poetry, the pastoral vision and British art in the work of Romantic artists of the 18th and 19th centuries, and the Neo-Romantic artists of the mid-20th century\", with exhibits of Grigson’s anthology The Poet's Eye, featuring lithographs by John Craxton, and copies of New Verse.Simon Martin, Martin Butlin & Robert Meyrick, “Poets In The Landscape”, Pallant House Gallery, 31 March to 10 June 2007."]}, {"page": "Daphnis and Chloe", "response": ["* The music by Ravel was also used in the ballet of the same name by Frederick Ashton, first performed by the Sadler's Wells Ballet (now The Royal Ballet) at Covent Garden on 5 April 1951, with Margot Fonteyn as Chloe and Michael Somes as Daphnis. Decor was by John Craxton.Arnold Haskell (ed.) 'Gala Performance' (Collins 1955) p226."]}, {"page": "Art of the United Kingdom", "response": ["Henry Moore emerged after World War II as Britain's leading sculptor, promoted alongside Victor Pasmore, William Scott and Barbara Hepworth by the Festival of Britain.  The \"London School\" of figurative painters including Francis Bacon, Lucian Freud, Frank Auerbach, Leon Kossoff, and Michael Andrews have received widespread international recognition,Walker, 219-225 while other painters such as John Minton and John Craxton are characterized as Neo-Romantics. Graham Sutherland, the Romantic landscapist John Piper (a prolific and popular lithographer), the sculptor Elisabeth Frink, and the industrial townscapes of L.S. Lowry also contributed to the strong figurative presence in post-war British art."]}, {"page": "Académie de la Grande Chaumière", "response": ["|Maxwell Armfield – Olivia Mary Bryden – John Craxton – Keith Henderson - Vivien John – Jacques Kupfermann - Lowes Dalbiac Luard – Lewis Morley – Isabel Nicholas – Viola Paterson - Basil Rakoczi – Isabel Rawsthorne – Mary Remington – John Walker – Josefina de Vasconcellos"]}, {"page": "1922 in art", "response": ["* October 3 – John Craxton, English painter (d. 2009)."]}, {"page": "Richard Olney (food writer)", "response": ["Olney was born in Marathon, Iowa. He lived in a house above the village of Solliès-Toucas in Provence, France, for most of his adult life, where he wrote many classic and influential cookbooks of French country cooking. He had first moved to France in 1951, to Paris, where he was close friends with (and painted many of) the American and English bohemian expatriate set, including James Baldwin, filmmaker Kenneth Anger, painter John Craxton, poet John Ashbery, and composer Ned Rorem."]}, {"page": "Peter Watson (arts benefactor)", "response": ["Watson was an avid art collector acquiring works by such artists as Miró, Klee, and Pablo Picasso, which were displayed in his Paris apartment in the 1930s. He was the principal benefactor of the Institute of Contemporary Arts in London and also provided financial assistance to English and Irish painters including Francis Bacon, Lucian Freud and John Craxton. In 1930, society photographer, artist and set designer Sir Cecil Beaton began a lifelong obsession with Watson, though the two never became lovers. One chapter from Hugo Vickers' authorized biography of Cecil Beaton is titled \"I Love You, Mr. Watson\". "]}, {"page": "Nikos Hadjikyriakos-Ghikas", "response": ["thumb|The tomb of the Ghikas family Today in Greece he is celebrated as one of the most important modern Greek painters. His house has been converted to a museum and is being run by the Benaki Museum. In 2018, the British Museum hosted an exhibition which focuses on the friendship of Ghika, the artist John Craxton, and the writer Patrick Leigh Fermor; their shared love of Greece was fundamental to their work."]}, {"page": "Westminster School of Art", "response": ["* John Craxton "]}, {"page": "Clayesmore School", "response": ["* John Craxton, painter"]}, {"page": "Craxton", "response": ["#REDIRECT John Craxton"]}, {"page": "Harold Craxton", "response": ["Craxton and his wife Essie had one daughter and five sons, including the artist John Craxton,Obituary of John Craxton the BBC Television Producer Antony Craxton and the distinguished oboist Janet Craxton."]}, {"page": "2009 in art", "response": ["*November 17 – John Craxton, 87, English painter"]}, {"page": "Horizon (magazine)", "response": ["*John Craxton"]}, {"page": "The Salisbury Museum", "response": ["* In the summer of 2012, Salisbury Museum presented 'Circles And Tangents' featuring the work of artists connected with Cranborne Chase, including Augustus John, Henry Lamb, Ben Nicholson, John Craxton, Lucian Freud, Stanley Spencer, Elisabeth Frink, William Nicholson and over 25 others."]}, {"page": "2009 in the United Kingdom", "response": ["**John Craxton, painter (b. 1922)"]}, {"page": "David Attenborough filmography", "response": ["| BBC's Culture Show – John Craxton || - || align=\"left\" | Sir David Attenborough comments the work of British painter John Craxton"]}, {"page": "Craxton (surname)", "response": ["* John Craxton (1922–2009), English painter, son of Harold"]}, {"page": "Deaths in November 2009", "response": ["*John Craxton, 87, British painter."]}, {"page": "Patrick Hennessy (painter)", "response": ["On arrival in Dublin Hennessy was offered an exhibition in December 1939 at the Country Shop on St Stephens Green which was opened by Mainie Jellett. This attracted favourable attention.Source:Dictionary of Irish Biography Hennessy Patrick by Rebecca Minch During the early forties he lived at various addresses in and around Dublin city with frequent trips to Cork. In 1940 he was invited to join the Society of Dublin Painters and held regular annual  exhibitions of his work there during the forties and early fifties. These exhibitions were supplemented by an eclectic mix of commissions, mostly portraits which he undertook during this period. In 1941 Hennessy had three of his paintings accepted by the Royal Hibernian Academy, RHA, for their annual exhibition. This was the beginning of a long relationship with the RHA. He exhibited there virtually every year from 1941 until 1979 the year before his death. During the late 1940s, Hennessy undertook a portrait of Francis Bacon, which remains unfinished, but which also serves to link Hennessy to the artistic social network connected with Bacon, including Lucian Freud, John Craxton, Peter Watson, Edward James, Salvador Dalí, and Cyril Connolly. From the early 1940s onwards, Hennessy's work sometimes incorporated a homosexual visual subtext.IMMA Modern Irish Masters: Patrick Hennessy  He re-united with Harry Robertson Craig in 1946 and soon after they moved to Crosshaven Co.Cork and later to Cobh Co. Cork. In 1947, Time magazine selected Hennessy as one of Irelands outstanding painters, in recognition of the important position he had then attained in the art world.Guildhall Galleries Ltd Chicago - Patrick Hennessy brochure In 1948 he had an exhibition at the Victor Waddington Gallery, Dublin and that same year was elected an associate of the Royal Hibernian Academy and a full member the following year. In 1950 his painting De Profundis was selected for the Contemporary Irish Painting exhibition that toured North America. As a result of this tour, the American public and critics began to take notice of his work. In 1951 the Dublin Painters Society held a Retrospective Exhibition of his work covering the period 1941 to 1951. Also in 1951 Hennessy visited Italy taking in Venice and Sicily and returning to Dublin with many of his canvases painted abroad. One of these paintings Bronze Horses of St. Marks was exhibited at the Royal Academy London in 1954. Hennessy spent a lot of his summer months during this period on trips abroad to France, Italy, Greece and Spain.Patrick Hennessy,De Profundis - "]}, {"page": "Janet Craxton", "response": ["Janet Helen Rosemary CraxtonOxford Dictionary of National Biography (17 May 192918 July 1981) was an English oboe player and teacher.  She was the youngest of the six children and the only daughter of the pianist and teacher Harold Craxton.  Her older brothers included the artist John Craxton.  She married the composer Alan Richardson in 1961."]}, {"page": "List of people associated with Goldsmiths, University of London", "response": ["*John Craxton"]}, {"page": "Ingram Collection of Modern British Art", "response": ["The collection spans over a hundred years of British art and includes works in oil and on paper, sculptures, installations and videos. The main focus of the collection is on the art movements which developed in the early and middle decades of the 20th Century, art which responded to the influence of the two world wars, and art which challenged the usual and the regular. The collection features a broad base of artists with particularly strong groups of works by William Roberts, Edward Burra, Keith Vaughan, John Tunnard,  John Craxton, and Richard Eurich. The sculpture holdings are significant, featuring works by artists such as, amongst others, Robert Adams, Kenneth Armitage, Reg Butler, Lynn Chadwick, Geoffrey Clarke, Robert Clatworthy, Sir Jacob Epstein, Eric Gill, Bernard Meadows, Eduardo Paolozzi, William Turnbull and Leon Underwood.", "*John Craxton"]}, {"page": "List of alumni of the Central School of Art and Design", "response": ["* John Craxton"]}, {"page": "A Time to Keep Silence", "response": ["This was an early publication from the Queen Anne Press,  a small private press, created in 1951 by Lord Kemsley, proprietor of the Sunday Times. In 1952 Kemsley made Leigh Fermor's friend Ian Fleming its managing director.Pearson, John. The Life of Ian Fleming, p.188. McGraw-Hill, 1966.  The press concentrated on producing finely printed and bound editions, often with small limitations. A Time to Keep Silence was printed in a limited edition of 500 copies with illustrations by John Craxton."]}, {"page": "The Broken Road (travel book)", "response": ["The cover design is by Ed Kluz; John Craxton who designed the other volumes, had died in 2009.\"The story of a cover: The Broken Road by Patrick Leigh Fermor\", The Beagle blog of John Murray"]}, {"page": "John McDermott (Scottish artist)", "response": ["McDermott started his career with the Royal Navy in 1972. According to him, during his tenure from 1972 to 2000, he traveled significantly around the world and experiencing military conflict and the self-destructive nature of mankind which often feature prominently in his arts. He was also a UN Military Observer serving in Cambodia, and West Africa. During this period, he met the late John Craxton RA who greatly influenced his art works."]}]}}