{"wiki_id": "http://www.wikidata.org/entity/Q518960", "itemLabel": "Emily Beecham", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Beecham", "wikipedia_page": {"main": "Emily Beecham (born 12 May 1984) is an English actress and singer. She is best known for her role in the Coen Brothers film Hail, Caesar!, the AMC series Into the Badlands, and the title role in the 2017 film Daphne. She starred in the 2019 film Little Joe, for which she received the Best Actress award at the Cannes Film Festival.", "link_mentions": [{"page": "Beecham", "response": ["* Emily Beecham (born 1984), English actress"]}, {"page": "The Pursuit of Love", "response": ["In 2019 the BBC announced plans for another adaptation, The Pursuit of Love directed by Emily Mortimer and starring Lily James and Emily Beecham. The miniseries began filming in 2020; it was disrupted by the COVID-19 pandemic, and premiered on BBC One in May 2021."]}, {"page": "Brenda Blethyn", "response": ["Also in 2009, Blethyn played a Benedictine nun in Jan Dunn's film The Calling, also starring Joanna Scanlan and Pauline McLynn. Dunn's third feature film, it tells the story of Joanna, played by Emily Beecham, who after graduating from university, goes against her family and friends when she decides to join a closed order of nuns. Released to film festivals in 2009, the independent drama was not released to UK cinemas until 2010, when it was met with mixed to negative reviews by critics, some of which declared it \"half Doubt, half Hollyoaks\". Blethyn however, earned positive reviews for her performance; The Guardian writer Catherine Shoard wrote that \"only she, really, manages to ride the rollercoaster jumps in plot and tone.\" Her last film of 2009 was Alex De Rakoff's crime film Dead Man Running alongside Tamer Hassan, Danny Dyer, and 50 Cent, in which she portrayed the wheelchair-using mother of a criminal who is taken hostage. The film received universally negative reviews from film critics, who deemed it to be full of \"poor performances, stiff dialogue, [and] flat characters\"."]}, {"page": "Cruella de Vil", "response": ["Cruella, a live-action film that explores De Vil's backstory by Disney, was announced in 2011. Screenwriter Aline Brosh McKenna, best known for writing The Devil Wears Prada, was hired to write the screenplay, with Glenn Close serving as the executive producer, Andrew Gunn and Marc Platt as the producers, and Alex Timbers as director, while Kelly Marcel was set to revise the script originally written by McKenna. Emma Stone was cast in the titular role of Estella \"Cruella\" de Vil in 2016. Timbers dropped to direct the live-action Cruella de Vil film due to scheduling conflicts in December 2018 and was replaced with Craig Gillespie. The following year, Emma Thompson joined the film as Baroness von Hellman, while Tony McNamara and Dana Fox were hired to write the recent version of the screenplay. Joel Fry, Paul Walter Hauser, Mark Strong, Emily Beecham and Kirby Howell-Baptiste joined the cast.Disney’s ‘Cruella’ Casts Joel Fry as Jasper (EXCLUSIVE)‘Cruella’: Cannes Best Actress Winner Emily Beecham Joins Disney Live-Action Prequel With Emma Stone The film was simultaneously released to theatres and on premium video on demand through Disney+ on May 28, 2021."]}]}}