{"wiki_id": "http://www.wikidata.org/entity/Q5189602", "itemLabel": "Crowther Charlesworth", "itemDescription": "English cricketer (1875-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Crowther_Charlesworth", "wikipedia_page": {"main": "Crowther Charlesworth (12 February 1875 – 15 June 1953) was an English cricketer. He was a right-hand batsman and right-arm fast-medium bowler who played for Warwickshire.\nBorn in Swinton, Lancashire, Charlesworth began his first-class career in 1898 and played regularly for Warwickshire until 1921. Despite missing a number of seasons because of the First World War, he still made 372 matches for the county scoring 14,289 at an average of 23.61 and taking 295 wickets at 30.09.\nDescribed by Wisden as 'A brilliant batsman specially strong in driving', Charlesworth passed 1,000 runs in a season five times. His most productive season came in 1911 when he scored 1,376 runs at 38.22, including four centuries. These runs assisted Warwickshire to their first County Championship title.Charlesworth scored 15 first-class centuries, two of which he converted into doubles. The first of these came in 1910 when he scored 216 against Derbyshire, the innings lasting three hours and forty minutes. The second came in 1914 when he struck 206 against a strong Yorkshire attack including George Hirst and Wilfred Rhodes.Charlesworth's pace bowling garnered seven five-wicket hauls, the first two of these came in the same match when he took match figures of 10/135 in a 16-run victory over Surrey in 1901. Later that season he recorded the best innings figures of his career when taking 6/45 against Derbyshire.\nIn 1920 he was awarded a benefit match which generated £1041, the figure was a Warwickshire record which remained unsurpassed until 1945. In his final season, after Charlesworth had made a fine 81 out of 138 v Somerset, he suffered a nasty injury to his eye, being hit by a shot played by Jack MacBryan whilst fielding at short leg.In 1925 and 1926 Charlesworth was on the umpires list, standing in 42 matches. He died in Halifax, West Yorkshire, aged 78.", "link_mentions": {}}}