{"wiki_id": "http://www.wikidata.org/entity/Q5181025", "itemLabel": "Craig Heaney", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Heaney", "wikipedia_page": {"main": "Craig Heaney (born August 1973) is a British screen, stage and radio actor. He may be best known as Private Roy W. Cobb in the award-winning ten-part mini-series Band of Brothers (2001). He played Phil in Danny Cannon's 2005 football movie Goal! and its 2009 sequel, Goal III: Taking on the World. He also appeared in the 2008 Christopher Nolan film The Dark Knight as a ferry passenger.\nHeaney's other television roles include the sweet-hearted Billy Breeze in Breeze Block, Larry Boyd in P.O.W and Mick in Distant Shores. He has also had appearances in such British television mainstays as Casualty, Peak Practice and Heartbeat. His radio work includes Two Planks and a Passion, written and co-directed by Anthony Minghella for BBC Radio 4.\nHe trained at the Academy Drama School, where he was the recipient of the Stage Scholarship.", "link_mentions": [{"page": "Band of Brothers (miniseries)", "response": ["* Craig Heaney as Private Roy W. Cobb"]}, {"page": "Heaney", "response": ["* Craig Heaney, British actor of screen, stage and radio"]}, {"page": "Believe Nothing", "response": ["| style=\"background:aliceblue\"| Craig Heaney"]}, {"page": "Goal III: Taking on the World", "response": ["Also following the tournament around Germany in their St. George's Cross festooned camper van are the \"Geordie Boys\", Newcastle United die-hards Gordon (Mike Elliott), Foghorn (Christopher Fairbank), Walter (Jack McBride), and Phil (Craig Heaney), showing their drunken, womanizing adventures in Germany.", "* Craig Heaney as Phil, one of the Geordie Boys"]}, {"page": "Megamaths", "response": ["The fifth series, which was produced in 1999, comprised five episodes focusing on fractions and decimals (and was the first to be set at the Superhero School space station). The trainee superhero, Maths Man (played by Craig Heaney), was guided by his mathematical tutor Her Wholeness (played by Kim Vithana), with recurring sketches of quiz show Find that Fraction with Colin Cool and sports show Sports Stand with Sue Harker and Harry Fraction. Each week, Her Wholeness would also receive a call from Earth about mathematical problems caused by supervillain The Diddler, and send Maths Man down to Earth to solve them (in the final episode, she was revealed to actually be Her Wholeness in disguise). This was also the only series that was reissued as a DVD Plus Pack."]}, {"page": "P.O.W. (TV series)", "response": ["* Craig Heaney as Larry Boyd"]}, {"page": "Breeze Block (TV series)", "response": ["*Craig Heaney – Billy Breeze"]}, {"page": "Goal! (film series)", "response": ["| colspan=\"3\" | Craig Heaney"]}]}}