{"wiki_id": "http://www.wikidata.org/entity/Q519332", "itemLabel": "Prince Arthur of Connaught", "itemDescription": "British prince (1883-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/Prince_Arthur_of_Connaught", "wikipedia_page": {"main": "Prince Arthur of Connaught  (Arthur Frederick Patrick Albert; 13 January 1883 – 12 September 1938) was a British military officer and a grandson of Queen Victoria. He served as Governor-General of the Union of South Africa from 20 November 1920 to 21 January 1924.", "link_mentions": [{"page": "Hirohito", "response": ["The departure of Prince Hirohito was widely reported in newspapers. The Japanese battleship Katori was used and departed from Yokohama, sailed to Naha, Hong Kong, Singapore, Colombo, Suez, Cairo, and Gibraltar. It arrived in Portsmouth two months later on 9 May, and on the same day they reached the British capital London. He was welcomed in the UK as a partner of the Anglo-Japanese Alliance and met with King George V and Prime Minister David Lloyd George. That evening, a banquet was held at Buckingham Palace and a meeting with George V and Prince Arthur of Connaught. George V said that he treated his father like Hirohito, who was nervous in an unfamiliar foreign country, and that relieved his tension. The next day, he met Prince Edward (the future Edward VIII) at Windsor Castle, and a banquet was held every day thereafter. In London, he toured the British Museum, Tower of London, Bank of England, Lloyd's Marine Insurance, Oxford University, Army University, and Naval War College. He also enjoyed theater at the New Oxford Theatre and the Delhi Theatre.小田部雄次 『天皇・皇室を知る事典』211頁（東京堂出版・2007年） At Cambridge University, he listened to Professor Tanner's lecture on \"Relationship between the British Royal Family and its People\" and was awarded an honorary doctorate degree. He visited Edinburgh, Scotland, from the 19th to the 20th, and was also awarded an Honorary Doctor of Laws at the University of Edinburgh. He stayed at the residence of John Stewart-Murray, 8th Duke of Atholl, for three days. On his stay with Stuart-Murray, the prince was quoted as saying, \"The rise of Bolsheviks won't happen if you live a simple life like Duke Athol.\""]}, {"page": "1920", "response": ["* November 20 – Prince Arthur of Connaught is appointed the 3rd Governor-General of South Africa."]}, {"page": "Saxe-Coburg and Gotha", "response": ["Alfred's only son, also named Alfred, died in 1899, so when Duke Alfred died in 1900 he was succeeded by his nephew the Duke of Albany, the 16-year-old son of Queen Victoria's youngest son, Leopold, as Duke Alfred's next brother Prince Arthur, Duke of Connaught and his son Prince Arthur of Connaught had renounced their own claims to the succession. Reigning as Duke Carl Eduard, Charles Edward, because of his age, began under the Regency of Prince Ernst von Hohenlohe-Langenburg until he came of age in 1905. The new Duke also continued to use his British title, the Duke of Albany. But, because he chose to side with the Germans against the British in the First World War, he was stripped of his British titles in 1919.Fitzroy, Almeric. Clerk of the Privy Council, \"The Titles Deprivation Act, 1917\", The London Gazette, Her Majesty's Stationery Office, London, England, 28 March 1919, Issue No 31255, page 4000", "**** Prince Arthur of Connaught (1883–1938)"]}, {"page": "Prince Arthur, Duke of Connaught and Strathearn", "response": ["|align=center| 90px ||Prince Arthur of Connaught||13 January 1883||12 September 1938||married, 15 October 1913, Princess Alexandra, 2nd Duchess of Fife; had issue"]}, {"page": "Duke of Connaught and Strathearn", "response": ["| 2 || Alastair Windsor |||| 9 August 1914Mayfair, Londonson of Prince Arthur of Connaught and Princess Alexandra, 2nd Duchess of Fife || 26 April 1943 in Ottawa,aged 28 || Never married || 1942–1943 || Earl of Sussex (1874) || 100px "]}, {"page": "Royal Marriages Act 1772", "response": ["| 12 August 1913 || Prince Arthur of Connaught || Princess Alexandra, 2nd Duchess of Fife || "]}, {"page": "Cenotaph", "response": ["In Livingstone there is a cenotaph at the Eastern Cataract of The Victoria Falls with the names of the men of Northern Rhodesia who died during the Great War 1914–18. It was unveiled by Prince Arthur of Connaught on 1 August 1923."]}]}}