{"wiki_id": "http://www.wikidata.org/entity/Q5209025", "itemLabel": "Dai Parker", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dai_Parker", "wikipedia_page": {"main": "Dai Parker (8 August 1904 – 16 June 1965) was a Welsh international rugby union prop who played club rugby for Swansea. He won ten caps for Wales and was selected to play in the 1930 British Lions tour of New Zealand and Australia.", "link_mentions": [{"page": "David Parker", "response": ["* Dai Parker (1904–1965), Welsh international rugby union player"]}, {"page": "Swansea RFC", "response": ["*  Dai Parker 1930"]}, {"page": "1924–25 New Zealand rugby union tour of Britain, Ireland and France", "response": ["Wales: Tom Johnson (Cardiff), Ernie Finch (Llanelli), Albert Jenkins (Llanelli), Albert Stock (Newport), Rowe Harding (Swansea), Jack Wetter (Newport) capt., Eddie Williams (Neath), Bobby Delahay (Cardiff), Dai Parker (Swansea), Jack Gore, (Blaina), Charlie Pugh (Maesteg), Steve Morris (Cross Keys), Cliff Williams (Llanelli), Douglas Marsden-Jones (London Welsh), Dai Hiddlestone (Neath) "]}, {"page": "1965 in Wales", "response": ["*16 June – Dai Parker, Wales and British Lion rugby player, 60"]}, {"page": "1904 in Wales", "response": ["*8 August - Dai Parker, Wales and British Lion rugby player (died 1965)"]}, {"page": "Llansamlet", "response": ["*Dai Parker, Wales and British Lion rugby player, brother of Tom Parker, Welsh international rugby union captain"]}, {"page": "Frank Williams (rugby union)", "response": ["Williams was first selected for Wales on 2 February 1929 in a game against Scotland at St Helens. Wales won 14-7, ending a run of four consecutive home defeats by Scotland. Williams was reselected in Wales's next two games, a victory over France and a trip to Ireland for the final game of the 1929 Championship. Williams was among the majority of the Welsh players to wake up feeling ill on the morning of the Ireland game, with only tee-totalers Morley and Peacock unaffected. Ireland took an early lead in a brutal, defensive encounter. Williams managed to break through the Irish defence to score his first international try, which Dai Parker converted to give Wales a draw."]}, {"page": "1930 British Lions tour to New Zealand and Australia", "response": ["* Dai Parker (Swansea and Wales)"]}, {"page": "List of international rugby union families", "response": ["*Dai Parker and Tom Parker; brothers"]}]}}