{"wiki_id": "http://www.wikidata.org/entity/Q5200802", "itemLabel": "Cyril Lovesey", "itemDescription": "British aerospace engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Lovesey", "wikipedia_page": {"main": "Alfred Cyril Lovesey CBE, AFRAeS, was an English engineer who was a key figure in the development of the Rolls-Royce Merlin aero engine.", "link_mentions": [{"page": "Rolls-Royce RB211", "response": ["Hugh Conway (managing director RR Gas Turbines), persuaded Stanley Hooker to come out of retirement and return to Rolls Royce. As technical director he led a team of other retirees - including Cyril Lovesey and Arthur Rubbra - to fix the remaining problems on the RB211-22. The engine was finally certified on 14 April 1972, about a year later than originally planned, and the first TriStar entered service with Eastern Air Lines on 26 April 1972. Hooker was knighted for his role in 1974."]}, {"page": "Rolls-Royce R", "response": ["The R was a physically imposing engine designed by a team led by Ernest Hives and including Cyril Lovesey, Arthur Rowledge and Henry Royce. The R shared the Buzzard's bore, stroke and capacity, and used the same 60-degree V-12 layout. A new single-stage, double-sided supercharger impeller was designed along with revised cylinders and strengthened connecting rods.Eves 2001, p. 225. The wet-liner cylinder blocks, crankcase and propeller reduction gear castings were produced from \"R.R 50\" aluminium alloy; and because of the short life expectancy of these engines, forged aluminium was used to replace bronze and steel in many parts.[Staff author] 2 October 1931. \"The Rolls-Royce Racing Engines\" Flight, p. 990. www.flightglobal.com.  Retrieved: 14 November 2009. ", "Overseen by Cyril Lovesey, flight testing commenced on 4 August 1929 in the new Supermarine S.6 at RAF Calshot, a seaplane and flying boat station on Southampton Water in Hampshire.Eves 2001, p. 177. During pre-race scrutineering tests, metal particles were found on two of the engine's 24 spark plugs indicating a piston failure which would require an engine re-build or replacement. The competition rules did not allow an engine change, but due to the foresight of Ernest Hives, several Rolls-Royce engineers and mechanics that were familiar with the R had travelled down to Southampton to witness the trials, and with their assistance one cylinder bank was removed, the damaged piston replaced and the cylinder refurbished. This work was completed overnight and allowed the team to continue in the competition.Holter 2002, p. 36."]}, {"page": "Hucknall Aerodrome", "response": ["During the early 1930s, it had been recognised that Rolls-Royce (RR) would need an area of open land for the test and validation of new engine designs and modifications. Mr Cyril Lovesey, a private pilot at Nottingham Airport (later RAF Tollerton) had seen the potential at RAF Hucknall. A request to the Air Ministry was made to share the land with the RAF and also for the use of two General Service Sheds for engine development and test flying purposes. Permission was granted and the RR Flight Test Establishment started operating in December 1934. The Chief Test Pilot was Captain Ronald Thomas Shepherd (Ronnie Shephard), who had been a member of the RFC."]}]}}