{"wiki_id": "http://www.wikidata.org/entity/Q5208082", "itemLabel": "Dadie Rylands", "itemDescription": "British theatre director (1902-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dadie_Rylands", "wikipedia_page": {"main": "George Humphrey Wolferstan Rylands  (23 October 1902 – 16 January 1999), known as Dadie Rylands, was a British literary scholar and theatre director. \nRylands was born at the Down House, Tockington, Gloucestershire, to Thomas Kirkland Rylands, a land agent, and Bertha Nisbet Wolferstan (née Thomas). His grandfather was the Liberal politician Peter Rylands. Educated at Eton College and King's College, Cambridge, he was a Fellow of King's from 1927 until his death. While at Cambridge, he became a friend of John Maynard Keynes, also a student and Fellow at King’s. He also befriended Cecil Beaton there.\nAs well as studying Shakespeare, he was actively involved in the theatre. He directed and acted in many productions for The Marlowe Society, and was chairman of the Cambridge Arts Theatre from 1946 to 1982.Rylands' 1939 Shakespeare anthology Ages of Man was the basis of John Gielgud's one-man show of the same title. Though Rylands specialised in directing university productions at Cambridge, he also directed Gielgud in professional productions of The Duchess of Malfi and Hamlet in London in 1945.He was made a Commander of the Order of the British Empire (CBE) in 1961 and a Companion of Honour (CH) in 1987.\n\n", "link_mentions": [{"page": "Ian McKellen", "response": ["In 1958, McKellen, at the age of 18, won a scholarship to St Catharine's College, Cambridge, where he read English literature.Inside the Actors Studio. Bravo. 8 December 2002. No. 5, season 9 He has since been made an Honorary Fellow of the College. While at Cambridge, McKellen was a member of the Marlowe Society, where he appeared in 23 plays over the course of 3 years. At that young age he was already giving performances that have since become legendary such as his Justice Shallow in Henry IV alongside Trevor Nunn and Derek Jacobi (March 1959), Cymbeline (as Posthumus, opposite Margaret Drabble as Imogen) and Doctor Faustus. During this period McKellen had already been directed by Peter Hall, John Barton and Dadie Rylands, all of whom would have a significant impact on McKellen's future career."]}, {"page": "1902 in literature", "response": ["*October 23 – Dadie Rylands (George Rylands), English Shakespeare scholar (died 1999)"]}, {"page": "1999 in literature", "response": ["*January 16 – Dadie Rylands (George Rylands), English Shakespearean scholar (born 1902)"]}, {"page": "Maurice Bowra", "response": ["In 1919 Bowra took up a scholarship he had won to New College, Oxford. He took a first class in Honour Moderations in 1920 and a first class, with formal congratulations, in Literae Humaniores in 1922. Bowra was very sociable as an undergraduate, and his circle included Cyril Radcliffe (with whom he shared lodgings),Hollis, p. 20 Roy Harrod, Robert Boothby, L. P. Hartley, Lord David Cecil, J. B. S. Haldane and Christopher Hollis. He also became a friend of Dadie Rylands. The teachers who influenced him included Gilbert Murray and Alic Smith.Times obituary, 3 July 1971, reprinted as Chapter 1 in Lloyd-Jones. The treatment he received from one of his tutors in philosophy, H. W. B. Joseph, was said by Isaiah Berlin to have \"undermined his faith in his own intellectual capacity\".Memorial Address, in Lloyd-Jones, p. 17"]}, {"page": "Peter Hall (director)", "response": ["Hall began acting as a student at Cambridge University, where Dadie Rylands taught him to speak Shakespearean verse. He was also influenced in his understanding of Shakespeare by the literary critic and teacher F. R. Leavis. He subsequently acted in three German films in the 1970s: Der Fußgänger (The Pedestrian, directed by Maximilian Schell, 1973), Als Mutter streikte (When Mother Went on Strike, 1974) and Der letzte Schrei (The Last Word, 1974)."]}, {"page": "Cyril Connolly", "response": ["He established a reputation as an intellectual and earned the respect of Dadie Rylands and Denis King-Farlow. Connolly's particular circle included Denis Dannreuther, Bobbie Longden and Roger Mynors. In summer 1921, his father took him on a holiday to France, initiating Connolly's love of travel. The following winter he went with his mother to Mürren, where he became friends with Anthony Knebworth."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Dadie Rylands (1902–1999), Cambridge don and member of the Bloomsbury Group"]}, {"page": "Argo Records (UK)", "response": ["Taking advantage of the capacity of the longer playing time of LP records, Argo embarked on recording the complete works of William Shakespeare. Cambridge University's Marlowe Players participated in the series, which was the responsibility of Dadie Rylands, a fellow at King's College, Cambridge. Recording began in 1957 and was completed by 1964. Initially professional actors had been reluctant to work for the project, but in time Judi Dench, Derek Jacobi and Prunella Scales participated."]}, {"page": "Francis Haskell", "response": ["In 1948, after serving in the Royal Army Educational Corps, Haskell matriculated into King's College, Cambridge. He read history before switching to English, and among his tutors were Eric Hobsbawm and Dadie Rylands. At Cambridge, he was a member of the semi-secretive Cambridge Apostles society, a debating club largely reserved for the brightest students."]}, {"page": "Enemies of Promise", "response": ["\"Renaissance\" marks a settled period for Connolly at the end of his second year establishing his popularity and friendship with others with a shared interest in literature, Dadie Rylands among others. It includes the start of a semi-romantic brother substitute friendship with \"Nigel\". The chapter digresses into extensive details of school personalities, politics and intrigues, an insight into the world of Eton. \"The art of getting on at school depends on a mixture of enthusiasm with moral cowardice and social sense\". The chapter concludes with Connolly's \"first trip abroad\" to Paris and a mortifying experience when he was lured into a brothel."]}, {"page": "George Rylands", "response": ["#Redirect Dadie Rylands"]}, {"page": "G. H. W. Rylands", "response": ["#REDIRECT Dadie Rylands"]}, {"page": "George Humphrey Wolferstan Rylands", "response": ["#Redirect Dadie Rylands"]}, {"page": "List of members of the Order of the Companions of Honour", "response": ["|13 June 1987||75px||Dadie Rylands||1902–1999||Academic and theatre director"]}, {"page": "Demetrios Capetanakis", "response": ["In 1939 with a scholarship from the British Council he came to Britain, to study at the University of Cambridge under Dadie Rylands."]}, {"page": "Cambridge Arts Theatre", "response": ["Dadie Rylands went on to be the theatre's chairman from 1946 to 1982.  The theatre hosted the world première of Harold Pinter's The Birthday Party in 1958. Other premières have included Secrets Every Smart Traveler Should Know and Someone Like You. In September 2008 it hosted the world premiere of a new stage adaptation of Tracy Chevalier's play Girl with a Pearl Earring, prior to a transfer to the West End. Artists to have appeared here include Ian McKellen (in a Marlowe Society production of Cymbeline), Derek Jacobi, and, more recently Susan Hampshire, Nigel Havers, Simon Callow, and Warren Mitchell."]}, {"page": "Peter Rylands", "response": ["Rylands married twice. He had three sons by his second wife Caroline Reynolds, whom he married in 1861. His eldest son, the author L. Gordon Rylands, published an edition of his letters.\"The Man of Philanthropy, Politics and Clogs\". Warrington Museum & Art Gallery. A grandson was the academic Dadie Rylands."]}, {"page": "Mark Lancaster (artist)", "response": ["Invited to be the first Artist in Residence at King's College, Cambridge from 1968 to 1970, he became friends with E.M. Forster, Dadie Rylands and other Bloomsbury survivors including Duncan Grant, whose decorations in King's for Maynard Keynes he had restored, in rooms then occupied by Bernard Williams. His paintings refer to the ambience of Cambridge, the architecture of King's, and  bear the mark of American Modernist art as well as references to \"pop\" imagery, and his own photography.Examples from this period include: Cambridge Green (Tate Britain) and Cambridge Red and Green (Pallant House Gallery, gift of Colin St John Wilson), and James Gibbs, named for the architect of the Gibbs building where he lived. A notable painting referencing the assassination of President John F. Kennedy, called Zapruder  (1967) is in the collection of the British Council."]}, {"page": "Rylands", "response": ["*Dadie Rylands (1902–1999), British literary scholar and theatre director"]}, {"page": "Ray Strachey", "response": ["Strachey painted her sister-in-law, Pernel Strachey, around the year 1930, and the young Fellow of King's College, Cambridge, Dadie Rylands at about the same time. Both paintings are in the National Portrait Gallery in London."]}, {"page": "Deaths in January 1999", "response": ["*Dadie Rylands, 96, British literary scholar and theatre director."]}, {"page": "Philip Gaskell", "response": ["He was born on 6 January 1926 in Highgate, London, the son of John Wellesley Gaskell, director of an engineering company, and his wife, Olive Elizabeth Baker, who was a Quaker. He was educated at the Dragon School, Oxford, and at Oundle School. In 1947, after army service, he went to King's College, Cambridge, and studied English under Dadie Rylands."]}, {"page": "L. Gordon Rylands", "response": ["Rylands was born in Warrington, Lancashire. His father was the politician Peter Rylands.\"The Man of Philanthropy, Politics and Clogs\". Warrington Museum & Art Gallery. He was educated at Charterhouse and University College London (B.A., B.Sc). After completing his studies, he was secretary of the family business, Rylands Brothers wire manufacturers from 1884 to 1887, then from 1897 to 1898 was science master at the Royal Grammar School, Newcastle upon Tyne. He worked as a private tutor from 1898 to 1924. At the time of his death he was assistant registrar of Grimes's Manchester Tutorial College.Who was Who: A companion to Who's Who, A. & C. Black, 1967, pg 1015 In 1887, he married Katherine Edwards; they had a daughter. Rylands was an uncle of the academic Dadie Rylands.Who was Who: A companion to Who's Who, A. & C. Black, 1967, pg 1015"]}]}}