{"wiki_id": "http://www.wikidata.org/entity/Q5200803", "itemLabel": "Cyril Luckham", "itemDescription": "British actor (1907-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Luckham", "wikipedia_page": {"main": "Cyril Alexander Garland Luckham (25 July 1907 – 8 February 1989) was an English film, television and theatre actor. He was the husband of stage and screen actress Violet Lamb.", "link_mentions": [{"page": "The Wind in the Willows", "response": ["* Single 90 minute play, dramatised by A.A. Milne under the name Toad of Toad Hall, on 21 April 1973, BBC Radio 4, with Derek Smith, Bernard Cribbins, Richard Goolden, and Cyril Luckham."]}, {"page": "Toad of Toad Hall", "response": ["A serialised radio adaptation of the play was broadcast on Children's Hour in 1948; Norman Shelley played Toad, Goolden was Mole and Leslie French Rat.\"Toad of Toad Hall\", Radio Times, 26 April 1948, p. 10 A 1973 radio version featured Goolden with Derek Smith as Toad, Bernard Cribbins as Rat, Cyril Luckham as Badger and Hugh Paddick as the Judge. This version was broadcast again in 1973, 1976, 1979, 1981 and 1990.\"Toad of Toad Hall\", BBC Genome. Retrieved 23 April 2021"]}, {"page": "Some Mothers Do 'Ave 'Em", "response": ["|Guest starring Cyril Luckham and Bryan Pringle.  This episode probably shows one of the series's riskiest stunts where after crashing upwards through the church's roof, Frank has to be rescued by helicopter."]}, {"page": "Michael Hordern", "response": ["During a short visit to Liverpool in 1943, Hordern proposed to Eve; they married on 27 April of that year with the actor Cyril Luckham as best man. After the honeymoon, Hordern resumed his duties on Illustrious while Eve returned to repertory theatre in Southport. In the months after the end of the war in 1945, he was transferred to the Admiralty where he worked briefly as a ship dispatcher.Hordern, pp. 78–79. The Horderns rented a flat in Elvaston Place in Kensington, London, and he began to seek work as an actor.Hordern, p. 78. After a short while, he was approached by André Obey who cast him in his first television role, Noah, in a play adapted from the book of the same name. Hordern was apprehensive about performing in the new medium and found the rehearsal and live performance to be exhausting; but he was generously paid, earning £45 for the entire engagement.Hordern, p. 80."]}, {"page": "The Famous Five (novel series)", "response": ["The  Famous Five television series was produced by Southern Television and Portman Productions for ITV in the UK, in 26 episodes of thirty minutes (including time for advertisements). It starred Michele Gallagher as Georgina, Marcus Harris as Julian, Jennifer Thanisch as Anne, Gary Russell as Dick, Toddy Woodgate as Timmy, Michael Hinz as Uncle Quentin and Sue Best as Aunt Fanny. It also starred Ronald Fraser, John Carson, Patrick Troughton, James Villiers, Cyril Luckham and Brian Glover. The screenplays were written by Gloria Tors, Gail Renard, Richard Carpenter and Richard Sparks. The episodes were directed by Peter Duffell, Don Leaver, James Gatward and Mike Connor. The series was produced by Don Leaver and James Gatward. Most of the outdoor filming was done in the New Forest and parts of Dorset and Devon.The series was set in the present day, fifteen years after Blyton's last novel in the series."]}, {"page": "1977 in film", "response": ["| Providence || Cinema 5 Distributing || Alain Resnais (director); David Mercer (screenplay); Dirk Bogarde, Ellen Burstyn, John Gielgud, David Warner, Elaine Stritch, Cyril Luckham, Denis Lawson, Kathryn Leigh Scott, Milo Sperber, Anna Wing, Peter Arne, Tanya Lopert || Drama || Live Action "]}, {"page": "The Pumpkin Eater", "response": ["* Cyril Luckham - Doctor"]}, {"page": "John Spencer-Churchill, 7th Duke of Marlborough", "response": ["Marlborough was portrayed by Cyril Luckham in the 1974 Thames Television mini-series Jennie: Lady Randolph Churchill."]}, {"page": "List of Doctor Who supporting characters", "response": ["*White Guardian (Cyril Luckham; Gerald Cross [voice only])"]}, {"page": "Blandings Castle", "response": ["* Cyril Luckham played Lord Emsworth and John Savident played Beach in the 1981 BBC television film Thank You, P. G. Wodehouse."]}, {"page": "Lord Emsworth", "response": ["* He was portrayed by Cyril Luckham in the 1981 BBC television film Thank You, P. G. Wodehouse."]}, {"page": "Judith Anderson", "response": ["In 1960, she played Madame Arkadina in Chekhov's The Seagull first at the Edinburgh Festival, and then at the Old Vic, with Tom Courtenay, Cyril Luckham and Tony Britton."]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Cyril Luckham"]}, {"page": "Enlightenment (Doctor Who)", "response": ["Valentine Dyall had originally played the Black Guardian in the 1979 serial The Armageddon Factor, the character's first appearance in the series, and reprised the role for season 20, appearing in Mawdryn Undead, Terminus and Enlightenment. Similarly, Cyril Luckham reprised the role of the White Guardian that he had previously played in the 1979 serial The Ribos Operation."]}, {"page": "The Wednesday Play", "response": ["| John CarsonCharles Lloyd-PackPeter CopleyJoseph FurstCyril LuckhamJohn LeeJohn PaulJohn AbineriGraham LeamanJeffry Wickham", "| Keith BarronValerie GearonJohn BaileyCyril LuckhamDonald HewlettBetty BowdenAimée Delamain"]}, {"page": "Return of the Saint", "response": ["| 1–16 || 7 January 1979 || \"Collision Course Part I: The Brave Goose\" || Gayle Hunnicutt, Stratford Johns, Derren Nesbitt, Prentis Hancock, Cyril Luckham, Michelle Newell, Edward Brayshaw, John Hallam, Michael Robbins", "| 1–17 || 14 January 1979 || \"Collision Course Part II: The Sixth Man\" || Gayle Hunnicutt, Stratford Johns, Derren Nesbitt, Prentis Hancock, Cyril Luckham, Michelle Newell, Edward Brayshaw, John Hallam"]}, {"page": "Billy Budd (film)", "response": ["* Cyril Luckham as Hallam, Captain of Marines"]}, {"page": "Play of the Month", "response": ["|Eric Porter,Maggie Smith,Adrienne Corri,Rachel Kempson,Cyril Luckham,Angharad Rees,Tony Selby,Godfrey Quigley", "|Ian Holm,Francesca AnnisRonald Hines,Ronald Fraser,Donal McCann,Angela Pleasence,Cyril Luckham,Geoffrey Bayldon,Vickery Turner,Daphne Heard,Jay Neill"]}, {"page": "White Guardian", "response": ["The White Guardian is a character in the long-running British science fiction television series Doctor Who. He was played by Cyril Luckham, with the exception of a vocal message in The Stones of Blood which was performed by Gerald Cross."]}, {"page": "The Barchester Chronicles", "response": ["* Cyril Luckham as Bishop Grantly"]}, {"page": "The Omega Factor", "response": ["Crane joins Department 7 as a means of finding and getting revenge on Edward Drexel (Cyril Luckham), a powerful rogue psychic who is responsible for the death of Crane's wife in a car crash. Crane's work with the department, and his own psychic gift, lead Crane to suspect a deadly conspiracy by a mysterious organisation called Omega to take over the world using mind control. The members of Department 7 include physicist Dr Anne Reynolds (Louise Jameson), an old friend of Crane's wife, and the secretive head of the department, psychiatrist Dr Roy Martindale (John Carlisle). Most episodes see the driven and impetuous Crane in impatient conflict with the cautious Martindale, with Anne (who falls in love with Crane, though she also has a brief relationship with Martindale) caught in the middle. Various subplots develop over the course of the series - notably Crane's hunt for Drexel, his growing suspicions about the Omega conspiracy and his developing relationship with Anne."]}, {"page": "Espionage (TV series)", "response": ["| Do You Remember Leo Winters? || 29 January 1964 || Robert Butler || George A. Cooper, Peter Madden, Cyril Luckham, Rhoda Lewis, Brian Peck, Mostyn Evans, Alan Haywood, David Healy"]}, {"page": "The Naked Runner", "response": ["* Cyril Luckham as Cabinet minister"]}, {"page": "Providence (1977 film)", "response": ["* Cyril Luckham as Doctor Mark Eddington"]}, {"page": "The Venturers", "response": ["Geoffrey Keen starred as director Gerald Lang, in a virtual reprise of his role as oil executive Brian Stead in Mogul / The Troubleshooters. Other major cast members included James Kerry, David Buck, Cyril Luckham and William Squire.", "* Cyril Luckham as Lord Kilvern"]}, {"page": "A Man for All Seasons (1966 film)", "response": ["* Cyril Luckham as Archbishop Thomas Cranmer"]}, {"page": "List of The Omega Factor episodes", "response": ["| Cyril Luckham (as Edward Drexel)  Colin Douglas (as Alfred Oliphant) <Br> Joanna Tope (as Julia Crane)", "| Cyril Luckham (as Edward Drexel)  Bruce Boa (as Masson)   Joanna Tope (as Julia Crane)"]}, {"page": "List of The Professionals episodes", "response": ["| Lisa Harrow, Michael Billington, Christopher Ellison, Cyril Luckham, Art Malik, Michael Mundell, Robert James, Robert Lankesheer, Charles Pemberton, Trevor Adams, Allan Surtees"]}, {"page": "The Dark Island", "response": ["*Cyril Luckham — Brigadier"]}, {"page": "The Great War (TV series)", "response": ["The Great War is a 26-episode documentary series from 1964 on the First World War. The documentary was a co-production of the Imperial War Museum, the British Broadcasting Corporation, the Canadian Broadcasting Corporation and the Australian Broadcasting Commission. The narrator was Michael Redgrave, with readings by Marius Goring, Ralph Richardson, Cyril Luckham, Sebastian Shaw and Emlyn Williams. Each episode is  long."]}, {"page": "The Scales of Justice", "response": ["|4. \"Position of Trust\" || 1963 || Derrick Sherwin, Imogen Hassall, Edward Atienza, Peter Barkworth, Geoffrey Chater, Cyril Luckham, Robert Lankesheer || Lionel Harris || B&W || The extrovert son of a powerful industrialist meets a pretty French girl called Yvonne at a Bohemian night spot, becoming infatuated, gradually growing their relationship resulting in an illicit weekend away from his fiancée. The weekend begins promisingly but after their first night together a man barges into their Brighton hotel bedroom, claiming to be a private detective acting for Yvonne's husband."]}, {"page": "Stanley Ellin", "response": ["*1980 - \"The Orderly World of Mr. Appleby\" - Adapted by Robin Chapman for Roald Dahl's Tales of the Unexpected, 7 June 1980 (Season 2, Episode 15), starring Robert Lang, Elizabeth Spriggs, and Cyril Luckham."]}, {"page": "The Alphabet Murders", "response": ["* Cyril Luckham as Sir Carmichael Clarke"]}, {"page": "Yangtse Incident: The Story of H.M.S. Amethyst", "response": ["* Cyril Luckham as Commander-in-Chief, Far Eastern Station"]}, {"page": "Man from the South", "response": ["* Cyril Luckham as Rawlsden"]}, {"page": "Who Killed Cock Robin? (Randall and Hopkirk (Deceased))", "response": ["*Cyril Luckham ...  Laverick"]}, {"page": "The Potting Shed", "response": ["A 1981 television production of the play was written by Pat Sandys and produced by Yorkshire Television for the London Weekend Television series Celebrity Playhouse. The cast, directed by David Cunliffe, included Paul Scofield as James Callifer and Anna Massey, Maurice Denham, Celia Johnson, David Swift, Allan Cuthbertson, and Cyril Luckham in supporting roles."]}, {"page": "The Guardians (British TV series)", "response": ["Edward Petherbridge, Derek Smith, John Collin, Cyril Luckham, Lynn Farleigh, David Burke, Gwyneth Powell, Robin Ellis"]}, {"page": "The Birthday Present", "response": ["* Cyril Luckham as Magistrate  "]}, {"page": "Out of the Clouds", "response": ["* Cyril Luckham as The Doctor"]}]}}