{"wiki_id": "http://www.wikidata.org/entity/Q5200899", "itemLabel": "Cyril Trigg", "itemDescription": "footballer (1917-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Trigg", "wikipedia_page": {"main": "Cyril Trigg (8 April 1917 – 9 April 1993) was an English professional footballer who made 268 appearances in the Football League playing for Birmingham, which was renamed Birmingham City in 1943.Trigg was born in Measham, Leicestershire. He spent the whole of his League career – nineteen years – with Birmingham City, for whom he made 291 appearances and scored 72 goals in all competitions. The Second World War started when he was 22 years old, so his career was severely disrupted by the conflict, in which he served in the Royal Air Force in India and Burma. He also appeared as a guest player for West Ham United during the war. He was twice Birmingham's leading scorer, firstly in the 1946–47 season, despite playing a third of his matches at right back, and again in 1950–51, by which time he was exclusively a centre forward.He moved to Stourbridge in 1954 as player-coach, and retired in 1957. He died in Birmingham aged 76.", "link_mentions": [{"page": "Trigg", "response": ["* Cyril Trigg (1917–1993), footballer"]}, {"page": "Measham", "response": ["*Cyril Trigg (1917–1993), Measham born, was also with Birmingham City and other teams."]}, {"page": "Harold Bodle", "response": ["Bodle played one first-team game for his new club before the outbreak of the Second World War put an end to League football. He made occasional appearances for the club in wartime competition, as well as guesting for Rotherham and Doncaster, for whom he scored 27 goals. He returned to Birmingham to play a full season (and score 16 goals) in the 1945–46 regional competition Football League South, which Birmingham won, and contributed three goals in their run to the FA Cup semifinal.Matthews, pp. 181, 236–240. By this time he was a fixture in the side. He scored 16 goals in all competitions in the first post-war League season – only Cyril Trigg got more for Birmingham – and 14 the following year, which made him the club's leading scorer and helped them to promotion back to the top flight. Once in the First Division Bodle's goals stopped coming, and in March 1949 the club accepted an offer for his services of £9,500 from Second Division Bury."]}, {"page": "Samuel Bellamy (footballer)", "response": ["He made his first senior competitive appearance for the club on 13 November 1937, deputising for the injured Cyril Trigg against Blackpool in the First Division. Birmingham won 3–0, which was their first away win of the season. He was retained for the 1938–39 season, and was a regular in the reserve team in the Central League, mainly at left back; in the last match of the season, he suffered a concussion and was taken to hospital. He made no more first-team appearances before the Football League was suspended for the duration of the Second World War."]}, {"page": "Fred Slater", "response": ["Slater was born in 1925 in Burton upon Trent, Staffordshire. He played football while in the Army as well as for home-town club Burton Albion, and had a reputation as a \"rough and tumble striker\", by the time Birmingham City signed him on professional forms on 13 November 1947. He was prolific in reserve-team football, scored in first-team friendlies in Scotland and Switzerland, and made his senior debut on 13 November 1948a year to the day after signingstanding in for Cyril Trigg. Ten minutes into the match, at home to Huddersfield Town in the First Division, he injured a leg in a tackle. He played on, in increasing discomfort, went to hospital after the match, and X-rays revealed a broken bone, just above the ankle. He said afterwards, \"I thought it was a bit painful, but had not realised it was as bad as that.\" He missed only four months of the season, but by the time he was fit again, Jimmy Dailey had taken over at centre forward. It was the first instance of what the Sports Argus dubbed \"an unhappy knack of bumping into trouble\". Over the next 18 months, he injured himself tripping on the stairs, twisted his ankle when he trod on a brick, and what he thought was \"just a cold\" had turned into pneumonia that left him hospitalised for weeks. He played just five first-team games for Birmingham, and was transfer-listed at the end of the 1950–51 season."]}, {"page": "1950–51 Birmingham City F.C. season", "response": ["Twenty-two players made at least one appearance in nationally organised competitive football during the season, and there were thirteen different goalscorers. Goalkeeper Gil Merrick, full-back Arthur Atkins and winger Johnny Berry were ever-present in the 48-game season, and Cyril Trigg was the leading goalscorer with 19 goals, of which 17 came in league matches."]}, {"page": "1945–46 Birmingham City F.C. season", "response": ["!scope=\"row\"| Cyril Trigg"]}, {"page": "1946–47 Birmingham City F.C. season", "response": ["Twenty-five players made at least one appearance in nationally organised competition, and there were fourteen different goalscorers. Goalkeeper Gil Merrick missed only one of the 45 matches over the season, and Cyril Trigg was leading scorer with 19 goals, of which 17 came in the league."]}, {"page": "1938–39 Birmingham F.C. season", "response": ["Birmingham began the 1939–40 Football League season in the Second Division, but the onset of the Second World War caused the League to be abandoned after three Second Division matches had been played. They fielded the same eleven for all three matches: Harry Hibbs, Cyril Trigg, Billy Hughes, James Bye, Arthur Turner, Ray Shaw, Jackie Brown, Don Dearson, Ted Duckhouse, Fred Harris and Tom Farrage. Farrage was killed in action in September 1944, serving as a private in the 10th Battalion, the Parachute Regiment during Operation Market Garden."]}, {"page": "1937–38 Birmingham F.C. season", "response": ["Twenty-four players made at least one appearance in nationally organised competition, and there were thirteen different goalscorers. Half-back Norman Brunskill played in 37 of the 43 matches over the season, and full-back Cyril Trigg, half-back Dai Richards, and forwards Don Dearson and Frank White played in 36. Dearson and Charlie Wilson Jones were joint leading scorers with nine goals, all scored in the league. This was the last season under the chairmanship of Howard Cant, who first took office in 1911. He was succeeded by Harry Morris, son of the former player and director, also called Harry Morris."]}, {"page": "1936–37 Birmingham F.C. season", "response": ["Twenty-nine players made at least one appearance in nationally organised competition, and there were thirteen different goalscorers. Goalkeeper Harry Hibbs played in 40 of the 43 matches over the season; among outfield players, full-back Cyril Trigg played in one fewer. Seymour Morris was leading scorer with 16 goals, of which 15 came in the league."]}, {"page": "1939–40 Birmingham F.C. season", "response": ["Birmingham began the 1939–40 Football League season in the Second Division, but the onset of the Second World War caused the League to be abandoned after three rounds of Second Division matches had been played. They fielded the same eleven for all three matches: Harry Hibbs, Cyril Trigg, Billy Hughes, James Bye, Arthur Turner, Ray Shaw, Jackie Brown, Don Dearson, Ted Duckhouse, Fred Harris and Tom Farrage. Farrage was killed in action in September 1944, serving as a private in the 10th Battalion, the Parachute Regiment during Operation Market Garden. With two wins and a draw, they stood second in the table, behind Luton Town on goal average.", "!scope=row|Cyril Trigg"]}]}}