{"wiki_id": "http://www.wikidata.org/entity/Q5210495", "itemLabel": "Dale Jasper", "itemDescription": "English footballer (1964-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dale_Jasper", "wikipedia_page": {"main": "Dale William Jasper (14 January 1964 – 30 January 2020) was an English professional footballer who played in the Football League in defence and in midfield for Chelsea, Brighton & Hove Albion and Crewe Alexandra.Jasper signed as a professional for Chelsea in January 1982 from Chelsea Juniors. He captained the Chelsea Reserves in The Football Combination. He found it difficult to break into the first team, partly because the two established centre backs were captain Colin Pates and Joe McLaughlin, who were ever-present. He made his first team debut at Cardiff City in March 1984. He played midfield, fullback and centre-half in his first three games for Chelsea - all regarded as dramatic games for Chelsea, for whom contemporary Pat Nevin wrote a 2020 tribute likening Jasper to David Luiz for his defensive midfield passing abilities.While a Chelsea player, Jasper interested Stoke City having been recommended by Alan Hudson, the ex-Chelsea star. However, Jasper's father did not want his son leaving London, so no move to Stoke ensued.Jasper was a versatile defender who moved on a free transfer to Brighton & Hove Albion in 1986. There he played under managers Alan Mullery and Barry Lloyd, and was part of the squad who won promotion from Division Three in his second season (1987-88).Jasper joined Crewe Alexandra in 1988 and made over 100 first-team midfield appearances as \"a stylish passer and creator\" under manager Dario Gradi, helping the team win promotion in his first season. He moved to Crawley Town in 1992.", "link_mentions": [{"page": "The Archbishop Lanfranc Academy", "response": ["*Dale Jasper, footballer"]}, {"page": "2019–20 in English football", "response": ["* 30 January 2020: Dale Jasper, 56, Chelsea, Brighton & Hove Albion and Crewe Alexandra defender/midfielder."]}, {"page": "2020 in the United Kingdom", "response": ["**Dale Jasper, 56, English footballer (Chelsea, Brighton, Crewe Alexandra)."]}, {"page": "Deaths in January 2020", "response": ["*Dale Jasper, 56, English footballer (Chelsea, Brighton, Crewe Alexandra).Dale Jasper 1964-2020"]}]}}