{"wiki_id": "http://www.wikidata.org/entity/Q5218639", "itemLabel": "Daniel Rowlinson Ratcliff", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Rowlinson_Ratcliff", "wikipedia_page": {"main": "Daniel Rowlinson Ratcliff (2 October 1837 – 1923) was an English lock and safe manufacturer and a Liberal politician who sat in the House of Commons in 1880.\nRatcliff was born in Birmingham, the son of Joseph Ratcliff of Edgbaston, to a family of machinists and founders. He was a partner in the safe-making firm of Thomas Milner and Son. He was a J.P. for Worcestershire and Warwickshire.At the 1880 general election Ratcliff was elected Member of Parliament for Evesham. His election was declared void in June 1880.Ratcliff was living at Mansion House, Great Alne, Warwickshire with his wife Jane and several children in 1881. In 1889 he established the company of Ratner Safe with his son William Milner Ratcliff and John Horner.He died at the age of 85.\nRatcliff married Jane Milner only daughter of Thomas Milner in 1862.", "link_mentions": [{"page": "Evesham (UK Parliament constituency)", "response": ["| Daniel Rowlinson Ratcliff"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Daniel Rowlinson Ratcliff"]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|rowspan=2|Daniel Rowlinson Ratcliff"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1880 || Evesham || Edward Charles Rudge and Joseph Masters || Daniel Rowlinson Ratcliff || Bribery, etc. || Void election || Ratcliffe had made many charitable gifts nationwide, including at Evesham. His agent, Ballinger, had made sure that anything given in Evesham was conditional on the recipient promising their vote. || 3 O'M & H 94; HCP 1880 228"]}, {"page": "James John Hill", "response": ["Hill had five children altogether. His first child – also James John Hill – was born to an unknown mother in 1838, and the other four – Daniel, Emily, Thomas and Alfred – to Harriet Parsons. His eldest son went on to become a marine engineer and had many children of his own. Hill's brother, Daniel Rowlinson Hill, was an architect based in Birmingham, and his cousin was Daniel Rowlinson Ratcliff, a lock and safe manufacturer and also an MP."]}]}}