{"wiki_id": "http://www.wikidata.org/entity/Q5211996", "itemLabel": "Damaris Hayman", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Damaris_Hayman", "wikipedia_page": {"main": "Damaris Hayman (16 June 1929 – 3 June 2021) was an English actress, often cast in upper class or eccentric roles. She made numerous performance in films and television series from the 1950s onwards.", "link_mentions": [{"page": "1977 in film", "response": ["| The Haunting of Julia || Astral Films / Cinema International Corporation / Canadian Film Development Corporation || Richard Loncraine (director); Dave Humphries (screenplay); Mia Farrow, Keir Dullea, Tom Conti, Jill Bennett, Robin Gammell, Cathleen Nesbitt, Anna Wing, Edward Hardwicke, Mary Morris, Pauline Jameson, Arthur Howard, Peter Sallis, Damaris Hayman, Sophie Ward, Hilda Fenemore, Nigel Havers, Samantha Gates, Denis Lill, Julian Fellowes, Michael Bilton, Susan Porrett || Horror || Live Action"]}, {"page": "The Dæmons", "response": ["The cast included David Simeon who himself was from Wiltshire where the story was being filmed. He had previously appeared in the Inferno story a year earlier. Comedy actress Damaris Hayman starred throughout the five episodes as Miss Hawthorne in a central role. Hayman herself had an interest in the supernatural and helped out during production as an unofficial adviser. A friend of hers was a practicing witch who had commended the scripts for their accuracy. Veteran British actor Robin Wentworth played Professor Horner. Future television presenter and Sooty puppeteer, Matthew Corbett had a brief role in the final episode as a hooded coven member who objects to the sacrifice of Jo Grant, and was suggested to the production team by friend Katy Manning. Other guest actors in the story include Don McKillop as the pub landlord, John Joyce as Garvin and Stephen Thorne as Azal. Thorne would go on to appear in the show again as costumed villains in The Three Doctors, Frontier in Space and The Hand of Fear.", "The incantation that the Master uses in summoning Azal is actually the nursery rhyme \"Mary Had a Little Lamb\" said backwards, as well as Damaris Hayman's name said backwards.\"Doctor Who: The Daemons\" DVD audio commentary, Episode 2"]}, {"page": "Doctor Who spin-offs", "response": ["Companies who have released videos of this kind include Reeltime Pictures (also known for the long-running Myth Makers series of documentaries) and BBV (who have also released a number of Doctor Who-related audio adventures on the same basis). The first spinoff of this nature was Wartime, a half-hour film produced by Reeltime in the late 1980s and starring John Levene as Benton, a UNIT soldier who appeared on Doctor Who in the early to mid-1970s. In the 1990s, Reeltime distributed P.R.O.B.E., a series of four made-for-video movies featuring Caroline John as her Pertwee-era character Liz Shaw. BBV, on their part, produced and released a trilogy of movies, Auton, Auton 2: Sentinel and Auton 3: Awakening that featured UNIT battling the Nestene Consciousness.  Author Terrance Dicks also wrote and produced Shakedown: Return of the Sontarans in 1994, which not only featured the reappearance of one of the series' most famous monsters, but also starred series alums Carole Ann Ford, Sophie Aldred, and Michael Wisher.  Jan Chappell played Lisa Deranne, captain of the solar racing yacht Tiger Moth, whose shakedown cruise is interrupted by a Sontaran attack squad furiously searching for a Rutan infiltrator.  Another spinoff, Downtime, featured the return of Nicholas Courtney as Brigadier (Ret.) Lethbridge-Stewart and Elisabeth Sladen as Sarah Jane Smith, along with Deborah Watling as Troughton-era companion Victoria Waterfield.  More of a nostalgia trip for fans than anything, Downtime provided a more detailed look at Lethbridge-Stewart's family and legacy than had ever been seen before. Reeltime Pictures also produced three other Doctor Who-universe related videos, Dæmos Rising, Mindgame and Mindgame Trilogy. In November 2016 they want to release White Witch of Devil's End, a Reeltime Pictures independent drama starring Damaris Hayman as Olive Hawthorne, who made her original appearance in Doctor Who in the Jon Pertwee story \"The Dæmons\"."]}, {"page": "David Renwick", "response": ["Joanna Bacon, Enn Reitel, Owen Brenman, Damaris Hayman, Angus Deayton, Paul Merton, Katharine Page, Tony Millan and Bill Gavin all appeared in both One Foot in the Grave and If You See God, Tell Him."]}, {"page": "Comedy Playhouse", "response": ["Current Affairs (31 May 1968) starring Harold Goodwin, Robert Dorning, Damaris Hayman, Bruce Wightman, Roger Avon and Eric Francis"]}, {"page": "Reeltime Pictures", "response": ["*White Witch of Devil's End (2017) – an independent drama starring Damaris Hayman as Olive Hawthorne, who made her original appearance in Doctor Who in the Jon Pertwee story The Dæmons. This DVD is a collection of monologue stories. Writers are Sam Stone, David J. Howe, Raven Dane, Suzanne Barbieri, Debbie Bennett and Jan Edwards; script editors Sam Stone, David Howe and Matt Fitton."]}, {"page": "The Pink Panther Strikes Again", "response": ["* Damaris Hayman as Fiona"]}, {"page": "Here Come the Double Deckers", "response": ["* Georgina Simpson, Brian Hayes, Damaris Hayman, John Clive, Lucy Griffiths, Bryan Hunt in episode 17."]}, {"page": "Cheltenham Ladies' College", "response": ["*Damaris Hayman, actress"]}, {"page": "Confessions of a Driving Instructor", "response": ["*Damaris Hayman     ....    Tweedy Golfing Lady "]}, {"page": "Clarence (British TV series)", "response": ["*Damaris Hayman as Lady in Loo (Ep.6)"]}, {"page": "Comedy Playhouse (series 2)", "response": ["| style=\"font-size: 100%;\" |Lionel Hogg (played by Alfred Marks) is an unemployed, but highly qualified machine minder who is given a temporary job as handyman at a health clinic. Also starring Anthony Sharp as Dr Dennison, Damaris Hayman as Matron, Frank Williams as the Labour Exchange clerk, Edwin Apps as the first card player, Julian Orchard as the second card player and John Harvey."]}, {"page": "List of people from Cheltenham", "response": ["*Damaris Hayman (1929–2021), character actress, was educated at Cheltenham Ladies' College."]}, {"page": "Doctor at Large (TV series)", "response": ["Left to mind the practice Dr Upton has to deal with a government minister (Basil Henson), a hysterical (and he thinks, suicidal) girl (Maureen Lipman) jilted by Dick Stuart Clark, and three toy bears. (Also with Damaris Hayman.)"]}, {"page": "You Must Be Joking! (1965 film)", "response": ["* Damaris Hayman - Fan Club Employee - (uncredited)"]}, {"page": "Mutiny on the Buses", "response": ["*Damaris Hayman as Mrs Jenkins"]}, {"page": "Smokescreen (film)", "response": ["* Damaris Hayman as Mrs Roper's nurse (uncredited)"]}, {"page": "Love Thy Neighbour (1973 film)", "response": ["* Damaris Hayman as Woman on Bus"]}, {"page": "Hayman", "response": ["*Damaris Hayman (1929–2021), actress best known for character roles on television"]}, {"page": "Screen Two", "response": ["Cast: Maggie Smith, Michael Hordern, Renée Asherson, Stephanie Cole, Maurice Denham, Thora Hird, Zoë Wanamaker, Damaris Hayman, Leonard Maguire, Anna Cropper, Preston Lockwood, Arthur Hewlett, John Baskcomb, Walter Sparrow, Aimée Delamain"]}, {"page": "Damaris", "response": ["*Damaris Hayman (1929–2021), British actress"]}, {"page": "List of Steptoe and Son characters", "response": ["|Damaris Hayman"]}, {"page": "2021 in film", "response": ["| style=\"text-align:center;\"| 3 || Damaris Hayman || style=\"text-align:center;\"| 91 || style=\"text-align:center;\"| English || style=\"text-align:center;\" | Actress || "]}, {"page": "2021 in British television", "response": ["|Damaris Hayman"]}, {"page": "2021 in the United Kingdom", "response": ["**Damaris Hayman, English actress (b. 1929)."]}, {"page": "Deaths in June 2021", "response": ["*Damaris Hayman, 91, English actress (Doctor Who, Steptoe and Son, The Young Ones).Damaris Hayman obituary"]}]}}