{"wiki_id": "http://www.wikidata.org/entity/Q5213602", "itemLabel": "Dan Grech-Marguerat", "itemDescription": "English record producer and sound engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dan_Grech-Marguerat", "wikipedia_page": {"main": "Daniel James Grech-Marguerat, also known as Dan Grech, (born 11 July 1981 in Bedford), is an English recording engineer, record producer and mixer. His production style pulls together a blend of alternative and pop genres. He is recognized for bringing a contemporary a sound to alternative music and a left-leaning edge to pop music.\nPast work includes Liam Gallagher, Halsey, George Ezra, The Vaccines, Lana Del Rey, Keane, Hurts, The Kooks, Scissor Sisters, Dragonette, Moby and Howling Bells. A mutual admiration led to work with Keane who quoted his work with The Vaccines as one of the inspirations of their 2012 album Strangeland.", "link_mentions": [{"page": "Amnesiac (album)", "response": ["* Dan Grech-Marguerat – engineering "]}, {"page": "Grammy Award for Album of the Year", "response": ["| Nigel Godrich, producer; Nigel Godrich, Dan Grech-Marguerat, Hugo Nicolson & Richard Woodcraft, engineers/mixers; Bob Ludwig, mastering engineer"]}, {"page": "The Remote Part", "response": ["* Sawmills Studios:  Eringa, with engineer Guy Massey, produced nearly all of the final recordings on the album; him and Massey produced \"Live in a Hiding Place\" together, while Street produced \"Tell Me Ten Words\" while Cenzo Townshend as engineer. Sixteen tracks were recorded in total across all of the studios. Eringa mixed all of the recordings in January 2002 with assistant Dan Grech-Marguerat, prior to the album being mastered by Howie Weinberg at Masterdisk in New York City the following month.", "* Dan Grech-Marguerat – assistant"]}, {"page": "A New Morning", "response": ["* Dan Grech-Marguerat – engineering "]}, {"page": "Chaos and Creation in the Backyard", "response": ["* Dan Grech-Marguerat – production assistant"]}, {"page": "Absent Friends (album)", "response": ["The album was recorded at RAK Studios and Konk Studios in London by Guy Massey, with help from Raj Das and Chris Bolster. It was mixed at Mayfair Studios by Nigel Godrich, who was assisted by Dan Grech-Marguerat."]}, {"page": "Howling Bells", "response": ["Howling Bells parted ways with Bella Union and, in 2008, signed a deal with record label Independiente.Strange, Francesca (March 2009). \"Howling Bells: Interview\". 4orTheRecord.com. Archived from the original on 13 April 2011. Retrieved 17 February 2011. The band worked with producer and mixer Dan Grech-Marguerat (Radiohead, Paul McCartney) and recorded its follow-up album, Radio Wars, at several different recording studios. \"Producers – Dan-Grech Marguerat – Producer / Mixer\". Solar Management Ltd. (2008). Archived from the original on 6 December 2008. Retrieved 2 April 2011. At times, the members found it difficult to work with their new producer. However, they have stated that in retrospect, they learned a great deal from him and felt fortunate for having the experience of collaborating with him."]}, {"page": "Nude (song)", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "5:55", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "Regeneration (The Divine Comedy album)", "response": ["*Dan Grech-Marguerat - recording assistant"]}, {"page": "In Rainbows", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "Forget the World (Afrojack album)", "response": ["* Dan Grech-Marguerat - engineer, mixing, mixing engineer (^)"]}, {"page": "All I Need (Radiohead song)", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "I Get Around (Dragonette song)", "response": ["* Dan Grech-Marguerat – mixing"]}, {"page": "Galore (Dragonette album)", "response": ["* Dan Grech-Marguerat – mixing ; vocal recording "]}, {"page": "X (Kylie Minogue album)", "response": ["* Dan Grech-Marguerat – recording engineering "]}, {"page": "Reckoner", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "Jigsaw Falling into Place", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "House of Cards (Radiohead song)", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "Bodysnatchers (song)", "response": ["* Dan Grech-Marguerat – engineering"]}, {"page": "51st Annual Grammy Awards", "response": ["** Nigel Godrich, producer; Nigel Godrich, Dan Grech-Marguerat, Hugo Nicolson & Richard Woodcraft, engineers/mixers; Bob Ludwig, mastering engineer"]}, {"page": "The Penelopes", "response": ["The album Never Live Another Yesterday has an electro, indie-pop infused sound. The first single was “Now Now Now”, followed by “Sally in the Galaxy”, and “Summer Life”.  The album “Never Live Another Yesterday” was produced by Dan Grech-Marguerat, who also produced for acts such as Scissor Sisters, The Vaccines, Lana Del Rey, and Keane. Ollie Evans from Partizan (Tom Vek, Gossip, Foals, Klaxons) directed the first video “Now Now Now”. The video “Sally in the Galaxy” was directed by Saman Keshavarz, who also directed for !!!, Russ Chimes, and Placebo. The singles were remixed by Gigamesh, Viceroy, Miguel Campbell, and The C90s and \"Summer Life\" Gigamesh remix got on #2 on Hype Machine."]}, {"page": "Radio Wars (album)", "response": ["Radio Wars is the second studio album by London-based Australian indie rock band Howling Bells. It was released through Independiente in the United Kingdom on 2 March 2009 to mixed reviews. Recorded at four different studios, it was produced by Dan Grech-Marguerat except one track by Howling Bells.", "Howling Bells sought a producer that had experience working on electronic-sounding records.Fungus, Slender (14 May 2009). \"Howling Bells Interview – We Talked to Juanita Stein from Coldplay's Latest Support Act\". Coldplay-official website. EMI (IP) Ltd. Archived from the original on 24 May 2009. Retrieved 26 February 2011. Producer and mixer, Dan Grech-Marguerat, who had previously worked with Howling Bells' manager, had listened to demos of the new tracks. The band knew of his collaborations with Radiohead and Air, and thought he could help develop their new sound. He came to their rehearsal studio with handwritten notes about the new songs and expressed what he could add. This encouraged the band, and they agreed to let him produce the album.", "*Dan Grech-Marguerat – producer"]}, {"page": "Fixin to Thrill", "response": ["* Dan Grech-Marguerat – mixing"]}, {"page": "If You Wanna", "response": ["*Producers – Dan Grech-Marguerat"]}, {"page": "All in White", "response": ["*Producers – Dan Grech-Marguerat"]}, {"page": "Magic (The Sound of Arrows song)", "response": ["*Mixed By – Dan Grech-Marguerat"]}, {"page": "Nørgaard (song)", "response": ["*Producers – Dan Grech-Marguerat"]}, {"page": "Voyage (The Sound of Arrows album)", "response": ["*Dan Grech-Marguerat – mixing, producer (tracks: 1–3, 1–8, 2–3, 2–8)"]}, {"page": "Young Kato", "response": ["On 28 October 2013, the EP \"Drink, Dance, Play\" was released. The re-issued lead track which was recorded/produced/mixed by Dan Grech-Marguerat received playlisting on XFM and support from BBC Radio 1 DJ's including Fearne Cotton and Zane Lowe, reaching number 58 in the Alternative UK Airplay Chart. In November of that year, the band embarked on their biggest tour to date in support of the \"Drink, Dance, Play\" re-release, with the London show held at Dingwalls in Camden. Later that month they also went on to play two nights at KOKO supporting Australian pop punk band, 5 Seconds of Summer."]}, {"page": "Born to Die (song)", "response": ["* Dan Grech-Marguerat – mixing"]}, {"page": "Born to Die", "response": ["* Dan Grech-Marguerat – mixing "]}, {"page": "Wetsuit / Tiger Blood", "response": ["*Produced by – Dan Grech-Marguerat (\"Wetsuit\"), Albert Hammond Jr. & Gus Oberg (\"Tiger Blood\")"]}, {"page": "Deep Sea Arcade", "response": ["Deep Sea Arcade are currently preparing to launch the next stage of their careers following the outstanding reception given to Outlands. They resided in London over the English Spring and Summer of 2013 to work on their follow-up record, working with UK heavyweight producer/mixer Dan Grech-Marguerat (Lana Del Rey, The Vaccines)."]}, {"page": "Strangeland (album)", "response": ["Keane began working on demo tracks for Strangeland in 2010. In May 2011 the band met up with English producer Dan Grech-Marguerat, who according to Tim Rice-Oxley is \"a massive Keane fan\". The producer said the band wanted to \"[go] back to the songwriting of their first two albums\", while making an album that sounded \"rich and simpler\". According to Rice-Oxley, the album is inspired by The Vaccines' album What Did You Expect from the Vaccines? (2011), which was produced by Grech-Marguerat: \"We loved what Dan Grech did on The Vaccines album. It had just come out. He'd also done stuff with Radiohead and produced the second Howling Bells album, which I loved.\"", "Strangeland received generally mixed reviews from music critics. At Metacritic, which assigns a normalised rating out of 100 to reviews from mainstream critics, the album received an average score of 60 based on 17 reviews, which indicates \"mixed or average reviews\". Chuck Campbell of the Knoxville News Sentinel stating that Strangeland features \"songs [that] are more complex, their messages more complicated and the sonic nuance saturated in emphatic shine\", praising producer Dan Grech-Marguerat for \"giving balance to the drama and letting melody and message envelop the listeners and carry them away.\" Sputnikmusic gave the album three and a half stars out of five, commenting that while \"there is nothing overtly impressive going on in the instrumental department here (or on the entire album)\", Strangeland had \"varied song structures, interesting lyrical concepts, and a cohesive feel\", concluding that it \"is a good but not great album that will be enjoyed by fans of classic Keane.\"", "*Dan Grech-Marguerat – producer, engineer, mixer"]}, {"page": "Silenced by the Night", "response": ["\"Silenced by the Night\" is a song by English rock band Keane from their fourth studio album Strangeland. It was released worldwide as the album's lead single on 13 March 2012, except for the United Kingdom where it was released on 15 April 2012. The song was written by Tim Rice-Oxley, Tom Chaplin, Richard Hughes, Jesse Quin and produced by Dan Grech-Marguerat. "]}, {"page": "Ways to Forget", "response": ["*Dan Grech-Marguerat – mixing tracks 5–9"]}, {"page": "Bodyparts (album)", "response": ["* Dan Grech-Marguerat – additional vocal recording and production"]}, {"page": "Exile (Hurts album)", "response": ["Exile is the second studio album by English synth-pop duo Hurts. It was released on 8 March 2013 by Major Label. The album was produced by Hurts, along with Jonas Quant—with whom the duo worked on their debut album, Happiness (2010)—and Dan Grech-Marguerat. \"Miracle\" was released on 11 January 2013 as the lead single from the album, followed by \"Blind\" on 10 May 2013 and \"Somebody to Die For\" on 21 July 2013. Upon release, the album debuted at number nine on the UK Albums Chart, while charting inside the top 10 in eight other countries.", "* Dan Grech-Marguerat – production ; engineering , engineering ; mixing "]}, {"page": "Long Way Down (Tom Odell album)", "response": ["Odell came in to RAK Studios in St Johns Wood with producer Dan Grech-Marguerat to record the album in the summer of 2012.", "All tracks written by Tom Odell (except where indicated) and produced by Dan Grech-Marguerat."]}, {"page": "Miracle (Hurts song)", "response": ["* Dan Grech-Marguerat – engineer, producer"]}]}}