{"wiki_id": "http://www.wikidata.org/entity/Q52160430", "itemLabel": "Cassyette", "itemDescription": "British singer, songwriter, model, DJ and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Cassyette", "wikipedia_page": {"main": "Cassyette is a British rock singer and songwriter\nHer debut single \"Jean\" was released 6 September 2019. She has been described by Clash Magazine as a Nu Metal \"pop provocateur\"  and \"The electro-pop princess to keep on your radar\".\nIn Rankin's Hunger Magazine. MTV say \"her style is hardcore, women-fuelled rock\". \"Cassyette is the brand new up and coming rockstar\".", "link_mentions": [{"page": "Download Festival", "response": ["Cassyette ", "Cassyette "]}, {"page": "Brentwood Ursuline Convent High School", "response": ["* Cassyette, musician"]}, {"page": "Frank Carter and the Rattlesnakes", "response": ["Following the cancellation of any further tour plans in support of End of Suffering due to the COVID-19 pandemic, the band began working on new music. This culminated in the release of the single \"My Town\", featuring Idles frontman Joe Talbot in April 2021. The band then announced their fourth album, Sticky, alongside its eponymous single in July 2021. The record, released on 15 October 2021, was produced by guitarist and primary band member Dean Richardson and features further guest appearances from Lynks, Cassyette and Bobby Gillespie."]}, {"page": "Sticky (album)", "response": ["Sticky was recorded throughout lockdown, with guitarist and primary band member Dean Richardson acting as producer on the record and features guest appearances from Lynks, Cassyette, Joe Talbot and Bobby Gillespie. Speaking about \"My Town\" following its April 2021 release, Carter stated that it was about \"our collective mental health falling apart\" under lockdown, further elaborating that \"it's easy to dissociate when it's someone else's problem but we are each responsible for keeping the streets clean, looking out for our fellow neighbors and acting with kindness and respect as we walk through life. We can look into this town and see the seedy underbelly, the dirt, the disdain, the undercurrent of hate and despair. And then we are reminded that 'My Town' looks just like yours, and no one gives a fuck at all and if we don't start looking after ourselves soon then we are all going to be in big trouble.\" ", "The first single from the album was \"My Town\", released on 27 April 2021. The track features a verse sung by Idles' frontman Joe Talbot, who features in the song's music video and also joined Carter and the rest of the band onstage to perform the song at the Download pilot in June 2021. The eponymous second single was released on 4 July, receiving its debut radio play on Dan P. Carter's BBC Radio 1 show the same day. The single was accompanied by the announcement of a 12-date tour of the UK and Ireland scheduled to take place throughout November 2021, with further dates in London and Europe in January and February 2022. The album's third single, \"Go Get a Tattoo\", was released on 10 August; the track features electronic artist Lynks, described by Carter as \"the most exciting person in music right now.\" On 4 October, \"Off with His Head\" featuring Cassyette was released as the album's fourth single.", "*Cassyette – guest vocals (track 7)"]}]}}