{"wiki_id": "http://www.wikidata.org/entity/Q521947", "itemLabel": "André Morell", "itemDescription": "British actor (1909-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Andr%C3%A9_Morell", "wikipedia_page": {"main": "Cecil André Mesritz (20 August 1909 – 28 November 1978), known professionally as André Morell, was an English actor. He appeared frequently in theatre, film and on television from the 1930s to the 1970s. His best known screen roles were as Professor Bernard Quatermass in the BBC Television serial Quatermass and the Pit (1958–59), and as Doctor Watson in the Hammer Film Productions version of The Hound of the Baskervilles (1959). He also appeared in the films The Bridge on the River Kwai (1957) and Ben-Hur (1959), in several of Hammer's horror films throughout the 1960s and in the acclaimed ITV historical drama The Caesars (1968).\nHis obituary in The Times newspaper described him as possessing a \"commanding presence with a rich, responsive voice… whether in the classical or modern theatre he was authoritative and dependable.\"", "link_mentions": [{"page": "Cicero", "response": ["Cicero was portrayed on the motion picture screen by British actor Alan Napier in the 1953 film Julius Caesar, based on Shakespeare's play. He has also been played by such noted actors as Michael Hordern (in Cleopatra), and André Morell (in the 1970 Julius Caesar). Most recently, Cicero was portrayed by David Bamber in the HBO series Rome (2005–2007) and appeared in both seasons."]}, {"page": "Spike Milligan", "response": ["Milligan's involvement transformed the play. The first night started poorly, Joan Greenwood played Olga and later recalled that her husband André Morell thought the show was so appalling, they should get her out of the play. According to Scudamore:"]}, {"page": "The Hound of the Baskervilles", "response": ["| 1959 || The Hound of the Baskervilles ||  ||Terence Fisher || Peter Cushing || André Morell"]}, {"page": "Tiberius", "response": ["* In the 1968 ITV historical drama The Caesars, Tiberius (by André Morell) is the central character for much of the series and is portrayed in a much more balanced way than in I, Claudius."]}, {"page": "Antonia Minor", "response": ["In the 1968 ITV historical drama The Caesars, Antonia was indirectly mentioned by Tiberius (played by André Morell), who noted that Germanicus was a blood relative of Augustus on his mother's [Antonia] side."]}, {"page": "Joan Greenwood", "response": ["In 1960, Greenwood appeared as the title character in a production of Hedda Gabler at the Oxford Playhouse. Starring opposite her as Judge Brack was the actor André Morell. They fell in love and flew in secret to Jamaica, where they were married, remaining together until his death in 1978.", "Greenwood married André Morell in 1960. Their son, Jason Morell, is an actor, writer and film/theatre director. In 1987, nine years after her husband's death, Greenwood died as the result of acute bronchitis and asthmaRachel Low, \"Greenwood, Joan Mary Waller (1921–1987)\", Oxford Dictionary of National Biography, Oxford University Press, Jan 2011 available online. Retrieved 4 August 2020. at her home in London, less than a week before her 66th birthday."]}, {"page": "Equity (British trade union)", "response": ["* 1973: André Morell"]}, {"page": "Laurence Harvey", "response": ["|André Morell "]}, {"page": "Arthur Wing Pinero", "response": ["There have been many adaptations of Pinero's works for broadcasting. Television versions include The Gay Lord Quex (1946, 1953 and 1983, starring respectively  Ronald Ward, André Morell and Anton Rogers); The Magistrate (1946, 1951 and 1972, Desmond Walter-Ellis, Richard Goolden and Michael Hordern); Trelawny of the \"Wells\" (1949, 1971 and 1985, Bransby Williams,  Roland Culver, Michael Hordern); Dandy Dick (1948, directed by Athene Seyler) and The Second Mrs Tanqueray starring Elizabeth Sellars (1962).\"Pinero\", BBC Genome. Retrieved 17 February 2019"]}, {"page": "1979 in film", "response": ["| The First Great Train Robbery || United Artists / Dino De Laurentiis Company / Starling Films || Michael Crichton (director/screenplay); Sean Connery, Donald Sutherland, Lesley-Anne Down, Alan Webb, Malcolm Terris, Robert Lang, Michael Elphick, Wayne Sleep, Pamela Salem, Gabrielle Lloyd, George Downing, James Cossins, André Morell, Peter Benson, Janine Duvitski, Peter Butterworth || Heist, Neo-Noir, Crime || Live Action"]}, {"page": "1978 in film", "response": ["| style=\"text-align:center;\"| 28 || André Morell || style=\"text-align:center;\"| 69 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1967 in film", "response": ["* The Mummy's Shroud, starring André Morell and John Phillips – (U.K.)"]}, {"page": "1966 in film", "response": ["* The Plague of the Zombies, starring André Morell – (U.K.)"]}, {"page": "1961 in film", "response": ["* Cash on Demand, starring Peter Cushing and André Morell – (U.K.)"]}, {"page": "1959 in film", "response": ["*The Giant Behemoth, starring Gene Evans and André Morell"]}, {"page": "1956 in film", "response": ["*The Black Tent, directed by Brian Desmond Hurst, starring Donald Sinden, Anthony Steel, Anna Maria Sandri & André Morell – (U.K.)"]}, {"page": "Hammer Film Productions", "response": ["* André Morell was employed mainly in supporting parts in British films of the 1950s and 1960s, but took lead roles for Hammer in films like The Shadow of the Cat and The Plague of the Zombies."]}, {"page": "Summertime (1955 film)", "response": ["* André Morell as Englishman in train compartment (uncredited)"]}, {"page": "The Second Mrs Tanqueray", "response": ["The play was adapted for the cinema in 1916, with Alexander in his original role.\"The Second Mrs Tanqueray (1916)\", British Film Institute. Retrieved 10 December 2020 A later film version was released in 1952, with Pamela Brown as Paula and Hugh Sinclair as Tanqueray.\"The Second Mrs Tanqueray (1952)\", British Film Institute. Retrieved 10 December 2020 The BBC has broadcast several radio adaptations of the play, starring Margaret Rawlings and Nicholas Hannen (1940), Coral Browne, Malcolm Keen and Jack Buchanan (1944), Joyce Redman and André Morell (1951), Gladys Cooper and André Morell (1954), Margaret Robertson and Tony Britton (1967) and Michelle Newell and Gary Bond (1992). A BBC television adaptation was broadcast in 1962, starring Elizabeth Sellars and Peter Williams.\"The Second Mrs Tanqueray\", BBC Genome. Retrieved 10 December 2020"]}, {"page": "Bernard Quatermass", "response": ["| André Morell", "The director assigned to the serial, which was eventually named The Quatermass Experiment, was Rudolph Cartier. A few months beforehand he had directed a play entitled It Is Midnight, Dr. Schweitzer for the BBC, and he offered the role of Quatermass to one of the stars of that play, André Morell. Morell considered the offer but declined the part, which Cartier then offered to Reginald Tate, another actor who had appeared in the play, who accepted.", "By the summer of 1957, Kneale was working on the scripts for a third and final BBC serial.Pixley, p. 27. Titled Quatermass and the Pit and again produced and directed by Cartier, this was eventually broadcast in December 1958 and January 1959.Pixley, p. 47. John Robinson was no longer available to play Quatermass, so the role was offered instead to Alec Clunes.Murray, p. 67. Clunes turned down the part, and it was offered once more to André Morell, who this time accepted. Morell has been praised by several reviewers as having given the definitive portrayal of Quatermass. The serial itself has been praised by the BBC's own website as \"simply the first finest thing the BBC ever made. It justifies licence fees to this day.\" Despite this success, Kneale was unsure about whether the character would ever return, later telling an interviewer: \"I didn't want to go on repeating because Professor Quatermass had already saved the world from ultimate destruction three times, and that seemed to me to be quite enough.\"Pixley, p. 36."]}, {"page": "Stage Fright (1950 film)", "response": ["* André Morell as Inspector Byard"]}, {"page": "The Lord of the Rings (1978 film)", "response": ["At Rivendell, Frodo is healed by Elrond (André Morell). He meets Gandalf again, after the latter escapes the corrupt wizard Saruman (Fraser Kerr), who plans to ally with Sauron but also wants the Ring for himself. Frodo volunteers to go to Mordor, where the Ring can be destroyed. Thereafter Frodo sets off from Rivendell with eight companions: Gandalf; Aragorn; Boromir (Michael Graham Cox), son of the Steward of Gondor; Legolas; Gimli (David Buck) the dwarf, along with Pippin, Merry, and Sam.", "* Elrond – André Morell"]}, {"page": "Quatermass and the Pit", "response": ["For the third time in as many serials the title role was played by a different actor, this time by André Morell; the part had initially been offered to Alec Clunes, but he declined. Morell had a reputation for playing authority figures, such as Colonel Green in The Bridge on the River Kwai (1957), and had previously worked with Kneale and Cartier when he appeared as O'Brien in their BBC television adaptation of Nineteen Eighty-Four (1954). He had been the first actor offered the part of Quatermass, for the original serial The Quatermass Experiment in 1953; he turned the part down. Morell's portrayal of Quatermass has been described as the definitive interpretation of the character."]}, {"page": "The Quatermass Experiment", "response": ["Quatermass was played by the experienced Reginald Tate, who had appeared in various films, including The Way Ahead (1944). He died two years later, while preparing to take the role of the Professor again in Quatermass II. Tate was the second choice for the part; Cartier had previously offered it to André Morell, who declined the role. (Morell did later play Quatermass in the third instalment of the series, Quatermass and the Pit.) Victor Carroon was played by Scottish actor Duncan Lamont, who later appeared in the film Mutiny on the Bounty (1962), and as a different character in the film adaptation of Quatermass and the Pit (1967). He enjoyed working on The Quatermass Experiment so much that, although he was not required for the final episode, he went to Alexandra Palace to lend moral support. While there, he helped Kneale and Kerr to prepare their 'monster' prop."]}, {"page": "Reginald Tate", "response": ["After the end of the war he continued to perform for theatre and increasingly for television. He met the Austrian television director Rudolph Cartier when Cartier cast him in his BBC production of It Is Midnight, Dr Schweitzer in February 1953. Cartier was impressed with Tate's performance, and later that year offered him the lead role in The Quatermass Experiment, a science-fiction serial he was directing, written by BBC staff scriptwriter Nigel Kneale. Tate was the second choice for the part of Professor Bernard Quatermass; Cartier had previously offered it to his co-star It Is Midnight, Dr Schweitzer, André Morell, who declined the role.Murray, p. 28. Morell would later play Quatermass for the third instalment of the series, Quatermass and the Pit. Tate however was a success in the part, and in a 1986 interview Nigel Kneale named him as his favourite of all the actors to have played the character. The serial itself was also a success, with the British Film Institute later describing it as \"one of the most influential series of the 1950s.\" Tate took an increased interest in television, and later in 1953 enrolled on the BBC's staff training course to become a television producer.Pixley, p. 15. He also began to spend much of his spare time teaching acting classes at the Royal Academy of Dramatic Art (RADA), feeling that he had experience which might be useful to younger actors."]}, {"page": "John Robinson (English actor)", "response": ["Robinson was not available to reprise the part for the third serial, Quatermass and the Pit, in 1958, and André Morell took over the role.Murray, p. 67. In the 1960s Robinson starred in another science-fiction series, R3, which had some similarities to Quatermass."]}, {"page": "Quatermass and the Pit (film)", "response": ["* Andrew Keir as Professor Bernard Quatermass: Nigel Kneale had long been highly critical of Brian Donlevy's interpretation of Quatermass and lobbied for the role to be recast, arguing that enough time had passed that audiences would not resist a change of actor.Murray, p. 95. Several actors were considered for the part, including André Morell, who had played Quatermass in the television version of Quatermass and the Pit.Hearn & Barnes, p. 117. Morell was not interested in revisiting a role he had already played. The producers eventually settled on the Scottish actor Andrew Keir, who had appeared in supporting roles in other Hammer productions, including The Pirates of Blood River (1962), The Devil-Ship Pirates (1964) and Dracula: Prince of Darkness (1966). Keir found the shoot an unhappy experience: he later recalled, \"The director—Roy Ward Baker—didn't want me for the role. He wanted Kenneth More ... and it was a very unhappy shoot. [...] Normally I enjoy going to work every day. But for seven-and-a-half weeks it was sheer hell.\"Mayer, p. 40. Roy Ward Baker denied he had wanted Kenneth More, who he felt would be \"too nice\" for the role,Kneale & Baker, DVD Commentary saying, \"I had no idea he [Keir] was unhappy while we were shooting. His performance was absolutely right in every detail and I was presenting him as the star of the picture. Perhaps I should have interfered more.\"Baker, p. 125. Keir went on to appear for Hammer in The Viking Queen (1967) and Blood from the Mummy's Tomb (1971). He reprised the role of Quatermass for BBC Radio 3 in The Quatermass Memoirs (1996), making him the only actor other than Donlevy to play the role more than once.Murray, p. 177."]}, {"page": "Andre Morell", "response": ["#REDIRECT André Morell"]}, {"page": "Nineteen Eighty-Four (British TV programme)", "response": ["Other cast members included Yvonne Mitchell, who had starred in the Kneale/Cartier Wuthering Heights, as Julia, and André Morell as O'Brien. Wilfrid Brambell, later known for his roles in Steptoe and Son and as Paul McCartney's grandfather in A Hard Day's Night, appeared in two roles, as the old man Winston speaks with in the pub and as a prisoner later on when Winston is incarcerated. Nigel Kneale who had briefly acted in the 1940s before turning to scriptwriting, had a small voice-over role as an announcer. The face of Big Brother was Roy Oxley, a member of the BBC design department whose inclusion was something of an in-joke on the part of the production team."]}, {"page": "Theatre 625", "response": ["|Alan Dobie,Doris Wellings,Eve Pearce,Eileen Winterton,Derek Benfield,André Morell,Sian Davies,John Dearth,Reginald Barratt,Donald Eccles,Frazer Hines,Harry Littlewood,Kevin Stoney,Brian Peck,Jeremy Spenser,David Valla,Malcolm Taylor,Michael Davis"]}, {"page": "His Majesty O'Keefe", "response": ["His Majesty O'Keefe is a 1954 American adventure film directed by Byron Haskin and starring Burt Lancaster. The cast also included Joan Rice, André Morell, Abraham Sofaer, Archie Savage, and Benson Fong. The screenplay by Borden Chase and James Hill was based on the novel of the same name by Laurence Klingman and Gerald Green (1952)."]}, {"page": "Bernard Spilsbury", "response": ["In the 1956 film The Man Who Never Was, about Operation Mincemeat, André Morell played Spilsbury."]}, {"page": "The Man Who Never Was", "response": ["* André Morell as Sir Bernard Spilsbury"]}, {"page": "Ben-Hur (1959 film)", "response": ["* André Morell as Sextus"]}, {"page": "Terence Fisher", "response": ["For the rest of his career, Fisher worked almost exclusively within the horror genre. The Hound of the Baskervilles (1959), with Cushing, Lee, and André Morell was an adaptation of the famous Sherlock Holmes novel given a horror slant, whilst Cushing and Lee also starred in The Mummy (1959), a pastiche of the Universal Mummy movies of the 1940s. The Revenge of Frankenstein (1958), with Cushing and Francis Matthews, was a successful sequel to The Curse of Frankenstein, whilst The Man Who Could Cheat Death (1959) was a remake of The Man in Half Moon Street (1945), and featured Lee in a more heroic role than usual, opposite Anton Diffring. Fisher directed another hit sequel, The Brides of Dracula (1960) starring Cushing, Freda Jackson, Martita Hunt and David Peel, whilst The Two Faces of Dr. Jekyll (1960) had Paul Massie in the title role with Lee and Dawn Addams in support, but it was one of the first Hammer horrors to perform disappointingly at the box office."]}, {"page": "The Plague of the Zombies", "response": ["The Plague of the Zombies is a 1966 British horror film directed by John Gilling and starring André Morell, John Carson, Jacqueline Pearce, Brook Williams, and Michael Ripper. The film's imagery influenced many later films in the zombie genre."]}, {"page": "Play of the Month", "response": ["|Paul Daneman,Hannah Gordon,Joyce Carey,Heather Chasen,Annette Crosbie,Robert Lang,André Morell,Stephen Murray,Donald Pickering,Alan Rowe,Michael Cashman"]}, {"page": "Alec Clunes", "response": ["Clunes played Governor Woodes Rogers, the lead in the first three episodes of The Buccaneers in 1956. He was also offered the lead part of Professor Bernard Quatermass in the famous BBC science-fiction serial Quatermass and the Pit in 1958, but declined the role (André Morell was cast instead)."]}, {"page": "So Long at the Fair", "response": ["Under questioning by the police, Madame Hervé reveals where Johnny has been taken. It turns out that he became sick with bubonic plague during the night. The news would have been disastrous for the Exposition, so he was secretly taken away to a hospital. George brings along Doctor Hart (André Morell), who tells Vicky her brother has a chance of living.", "*André Morell as Doctor Hart"]}, {"page": "Judith (1966 film)", "response": ["The film stars Sophia Loren, Peter Finch and Jack Hawkins with Hans Verner, Frank Wolff, Shraga Friedman, André Morell, Zaharira Harifai, Terence Alexander, Arnoldo Foà and Daniel Ocko."]}, {"page": "1984 (1956 film)", "response": ["In 1954, Peter Cushing and André Morell starred in a BBC-TV made-for-TV adaptation which was extremely popular with British audiences, leading to the production of the 1956 film version. Donald Pleasence had also appeared in the BBC television version, playing the character of Syme, which for the film was amalgamated with that of Parsons. The script was co-written by William Templeton, who had previously adapted the novel for the US Studio One TV series in 1953."]}, {"page": "Harold Hecht", "response": ["Hecht's final Warner Brothers commitment was His Majesty O'Keefe, filmed in mid-1952 but only released in early 1954. His Majesty O'Keefe was granted another large budget for remote location shooting in Technicolor. This time the crew headed to Viti Levu in the Republic of Fiji, where production costs skyrocketed. The film was directed by Byron Haskin and starred Lancaster, Joan Rice and André Morell. It was scored by Dimitri Tiomkin and was the first time that Hecht and Lancaster collaborated with writer James Hill who later became a partner in the company. In December 1952 Hecht joined the Academy of Motion Pictures Arts and Sciences.\"18 Added to Academy\", Box Office, December 20, 1952, p56"]}, {"page": "Alcoa Presents: One Step Beyond", "response": ["*André Morell (\"The Avengers\")"]}, {"page": "High Treason (1951 film)", "response": ["High Treason is a 1951 British spy thriller. It is a sequel to the film Seven Days to Noon (1950) from the same team. Director Roy Boulting, co-director (with his brother John) and co-writer of the first film also directed and co-wrote this one. Frank Harvey, Boulting's co-writer, was also a co-writer of the earlier film.  André Morell reprises his role as Detective Superintendent Folland of Scotland Yard's Special Branch from the first film, though in High Treason he is subordinate to the head of Special Branch, Commander Robert \"Robbie\" Brennan, played by Liam Redmond.", "*André Morell as Superintendent Folland"]}, {"page": "The Message (1976 film)", "response": ["Released in both separately-filmed Arabic and English-language versions, The Message serves as an introduction to early Islamic history. The international ensemble cast includes Anthony Quinn, Irene Papas, Michael Ansara, Johnny Sekka, Michael Forest, André Morell, Garrick Hagon, Damien Thomas, and Martin Benson. It was an international co-production between Libya, Morocco, Lebanon, Syria and the United Kingdom.", "* André Morell as Abu Talib"]}]}}