{"wiki_id": "http://www.wikidata.org/entity/Q5216822", "itemLabel": "Daniel Cohalan", "itemDescription": "Roman Catholic bishop (1858-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Cohalan_(bishop_of_Cork)", "wikipedia_page": {"main": "Daniel Cohalan (1858–1952) was an Irish Roman Catholic clergyman who served as the Bishop of Cork from 1916 to 1952.", "link_mentions": [{"page": "Turners Cross, Cork", "response": ["Largely residential, one of the key features of the area is the iconic church created by architect Barry Byrne and sculptor John Storrs, the Church of Christ The King. It was commissioned in 1927 by Rev Daniel Cohalan D.D., Bishop of Cork. The church was the first Irish church to be built from concrete instead of brick, and is one of the largest suspended-ceiling churches in Europe. Opened in 1931, the church is based on the principles of Art Deco which makes strong use of symmetric and geometric forms.Turners Cross Parish Website - About the church Turners Cross is part of the Cork South-Central Dáil constituency."]}, {"page": "St Finbarr's College, Farranferris", "response": ["In 1916, the Bishop of Cork, Thomas A. O'Callaghan, died and was replaced by Daniel Cohalan; Cohalan was the first bishop of Cork who had previously passed through Farranferris as a student.", "* Daniel Cohalan, Bishop of Cork"]}, {"page": "Denny Barry", "response": ["Prior to his body arriving in County Cork, the Bishop of Cork, Daniel Cohalan (bishop of Cork) issued a letter to the Catholic Churches which forbid them to open their doors to the body of Barry. Bishop Cohalan expressed far different opinions on the 1920 death (also by hunger strike) of the Lord Mayor of Cork Terence MacSwiney: \"Terence MacSwiney takes his place among the martyrs in the sacred cause of the Freedom of Ireland. We bow in respect before his heroic sacrifice. We pray that God may have mercy on his soul.\"Flynn, pg 80.  "]}, {"page": "Burning of Cork", "response": ["At midday mass in the North Cathedral the Bishop of Cork, Daniel Cohalan, condemned the arson but said the burning of the city was a result of the \"murderous ambush at Dillon's Cross\" and vowed, \"I will certainly issue a decree of excommunication against anyone who, after this notice, shall take part in an ambush or a kidnapping or attempted murder or arson\". No excommunications were issued, and the bishop's edict was largely ignored by pro-republican priests and chaplains."]}, {"page": "Daniel Cohalan", "response": ["Daniel Cohalan may refer to:", "* Daniel Cohalan (bishop of Cork) (1858–1952), Irish Roman Catholic bishop", "* Daniel Cohalan (bishop of Waterford and Lismore) (1884–1965), Irish Roman Catholic bishop"]}, {"page": "Francis Gleeson (priest)", "response": ["Gleeson then returned once more to Ireland and his position at the Church of Our Lady of Lourdes. He encountered hostility from Irish republicans due to his association with the British Army; it is said that the Bishop of Cork, Daniel Cohalan, a fervent nationalist, deliberately placed Gleeson in pro-republican parishes. Gleeson was appointed curate in St Michael's Parish, Dún Laoghaire on 13 July 1920. On 4 June 1922 he attended the dedication of Étreux British Cemetery which holds the remains of 110 men of the Royal Munster Fusiliers who were killed in the defence of Étreux against superior German forces whilst acting in a rearguard action for the Great Retreat of August 1914. Thanks to his previous military experience Gleeson received an appointment as command chaplain to Dublin Army Command of the Irish Free State Army in February 1923, and was with them through the Irish Civil War."]}, {"page": "Daniel Cohalan (Bishop of Cork)", "response": ["#REDIRECT Daniel Cohalan (bishop of Cork) "]}, {"page": "Patrick MacSwiney", "response": ["Towards the end of 1922, MacSwiney's time in Cork came to an abrupt end due to a conflict with his bishop, Dr Daniel Cohalan. Mary MacSwiney was the unwitting cause of her cousin being banished to act as chaplain to the workhouse and to a convent in the remote parish of Dunmanway."]}, {"page": "Vaga (Tunisia)", "response": ["* Daniel Cohalan from 25 May 1914 to 29 August 1916 (Appointed Bishop of Cork)"]}, {"page": "John Collins (nuncio)", "response": ["On 9 April 1934, the day the Prefecture became a Vicariate, Pope Pius appointed Collins titular bishop of Thala and Vicar Apostolic of Liberia. He received his episcopal consecration on 30 September 1934 from Bishop Daniel Cohalan of Cork."]}]}}