{"wiki_id": "http://www.wikidata.org/entity/Q5219011", "itemLabel": "Daniel Wakefield", "itemDescription": "English economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Wakefield", "wikipedia_page": {"main": "Daniel Wakefield (1776–1846) was a writer on political economy.", "link_mentions": [{"page": "2000 in film", "response": ["| Our Lips Are Sealed || Warner Home Video / Dualstar Entertainment Group / Tapestry Films / Courage Films Pty Ltd || Craig Shapiro (director/screenplay); Elizabeth Kruger (screenplay); Mary-Kate Olsen, Ashley Olsen, Jim Meskimen, Tamara Clutterbuck, Robert Miano, Jason Clarke, Richard Carter, Harold Hopkins, Ernie Hudson Jr., Willie Garson, Ryan Clark, Chris Foy, Daniel Wakefield, Pete Callan, Marguerite MacIntyre, J.P. Manoux, Kenneth Davitian, Brett Blewitt, Jo Phillips, Jade Bronneberg, Scott Swalwell, Nina Schultz, Prudie Quigley, Chris Stapley, Katie Fountain, Randall Rapstine, Garth Holcombe, Boomer || Comedy || Live action"]}, {"page": "Our Lips Are Sealed (film)", "response": ["* Daniel Wakefield as Ray"]}, {"page": "Adelaide city centre", "response": ["*Wakefield – Daniel Bell Wakefield, barrister who drafted the South Australia ActDaniel Bell Wakefield should not to be confused with his uncle, Daniel Wakefield. Note that the street is named after him, not after his better known brother Edward Gibbon Wakefield - Refer Wakefield Street  in \"Streets Named on 23 May 1837\", HistorySouthAustralia.net."]}, {"page": "Australian Idol (season 1)", "response": ["In the wildcard show, a contestant named Daniel Wakefield was originally meant to be in the top 12, but due to his contract, he wasn't able to be in the top 12. Instead of having one contestant chosen by the judges and the other chosen by Australia, three contestants were chosen, two by Australia and one by the judges. Rhett Butler was unlucky to miss out on the top 20.", "* Daniel Wakefield – \"You'll Never Walk Alone\"  (Gerry & the Pacemakers)", "Advancing to the Top 12: Daniel Wakefield and Peter Ryan"]}, {"page": "Priscilla Wakefield", "response": ["The Wakefields had five children, of whom three survived to adulthood. The two surviving sons were Edward Wakefield (1774–1854) and Daniel Wakefield. The surviving daughter, Isabella (3 March 1773 – 17 October 1841), married Joshua Head of Ipswich on 12 September 1794. Her grandchildren included Edward Gibbon Wakefield, Daniel Bell Wakefield, William Hayward Wakefield, Arthur Wakefield and Felix Wakefield."]}, {"page": "Edward Wakefield (statistician)", "response": ["Edward was the eldest son of Edward Wakefield (1750–1826) and Priscilla Bell and was born in 1774. He was the brother of Daniel Wakefield (1776–1846) and Isabella Wakefield (3 Mar 1773–17 October 1841) who married Joshua Head of Ipswich on 12 Sep 1794."]}, {"page": "Wakefield (surname)", "response": ["*Daniel Wakefield (1776–1846), writer on political economy"]}, {"page": "Wakefield, Daniel", "response": ["#redirectDaniel Wakefield"]}]}}