{"wiki_id": "http://www.wikidata.org/entity/Q5218728", "itemLabel": "Daniel Sedgwick", "itemDescription": "British hymnologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Sedgwick", "wikipedia_page": {"main": "Daniel Sedgwick (1814–1879) was an English hymnologist and bookseller.", "link_mentions": [{"page": "Anne Steele", "response": ["In 1760, she published Poems on Subjects Chiefly Devotional under the name Theodosia. This book had a second edition (3 vols. Bristol, 1780), for which Caleb Evans wrote a preface. Her complete works were published in one volume by Daniel Sedgwick (London, 1863), as Hymns, Psalms, and Poems by Anne Steele, with a memoir by John Sheppard. It comprised 144 hymns, thirty-four metrical psalms and fifty moral poems. Some of them, e.g. \"Father of mercies, in Thy word,\" have found their way into the collections of other churches. She has been called the Frances Ridley Havergal of the 18th-century. Several of Anne Steele's hymns appear in the Sacred Harp. In 1780, a new edition of the Poems, comprising a third and posthumous volume of Miscellanies, was published by Dr. Caleb Evans, the profits of which were to be given to the \"Bristol Education Society\", also known as the Baptist College of Bristol, of which he was at that time President; to that volume, the Editor prefixed a biography of \"Mrs. Steele\", as she was more commonly called."]}, {"page": "List of Australian films of 1979", "response": ["| This Woman Is Not a Car || Margaret Dodd|| Phil Colson, Richard Morecroft, Daniel Sedgwick|| Short||IMDb"]}, {"page": "Come Thou Almighty King", "response": ["The earliest known publication of this hymn is a leaflet that was bound into the 6th edition of George Whitefield's Collection of Hymns for Social Worship, 1757. In this leaflet, the hymn had five verses of seven lines each, and was titled \"An Hymn to the Trinity.\" The leaflet also contained the hymn \"Jesus, Let Thy Pitying Eye\" by Charles Wesley, and because of this hymnologist Daniel Sedgwick attributed \"Come Thou Almighty King\" to Wesley as well. However, there is no record of this hymn in any of Wesley's collections of hymns, nor is there any hymn known to be Wesley's that uses the same meter as this hymn does (6,6,4,6,6,6,4)."]}, {"page": "Sedgwick, Daniel", "response": ["#redirectDaniel Sedgwick"]}]}}