{"wiki_id": "http://www.wikidata.org/entity/Q5217351", "itemLabel": "Daniel Griffiths", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dan_Griffiths_(rugby_union,_born_1979)", "wikipedia_page": {"main": "Daniel Phillip Griffiths (born 1 February 1979) in Carmarthen, Wales is a rugby union player for Bridgend Ravens. He previously played for Whitland RFC and Aviron Bayonnais.  He then played over 150 games for Newport RFC and became the highest all time points scorer for the club in February 2008 at Maesteg.  In doing so, he beat Paul Turner's record which had stood since 1992.  He has also appeared twice for the Newport Gwent Dragons, coming on as a replacement against Munster and the Ospreys in 2005. In June 2010 he joined Bridgend Ravens, later taking up a coaching role, and in November 2012, he was appointed Elite Youth Performance Manager at the Ospreys.", "link_mentions": [{"page": "Bridgend Ravens", "response": ["The future of the club looks brighter now since significant investment is being made by a company called Llandarcy Park Ltd which is believed to have secured the long-term future of the club.  In addition, the club appointed Steve Tandy as their new head coach from season 2010–11.  In 2011, Bridgend won the WRU Division One West title with 4 games to spare, tries from Gareth Howells, Steve Tandy and Luke Morgan, plus 10 points from the boot of Daniel Griffiths gave them a 25–19 victory over Bonymaen RFC to take the title.  The club won a play-off final against Glamorgan Wanderers RFC with the scoreline of 38–19, meaning that they returned to the Welsh Premier Division for 2011–12 season after a two-year absence from the top flight.", "For 2012–13 season, the club changed playing personnel. New signings include Alex Jones (Newport), Ashleigh James (Neath), Scott Hicks (Tonmawr) among others.  There was also a change in coaching personal, Steve Tandy left the club during the second half of the previous season to become the new head coach of the Ospreys, with player Ben Rose named as his replacement, initially on an interim basis, but then was handed the job on a permanent basis.  Daniel Griffiths retired from playing to become backs coach, whilst ex-Cardiff hooker Paul Young joined as forwards coach. The club also made its debut in the British and Irish Cup, battling with rivals Cardiff, as well as English championship powerhouse Bristol RFC and Ulster Ravens, a team composed of academy and local players from the Ulster province. At the end of the 2012–13 season Head Coach Ben Rose decided to step down from his role. Backs coach Dan Griffiths was appointed an Ospreys coach and leaving coaching vacancies at the club."]}, {"page": "Dan Griffiths (rugby union, born 1857)", "response": ["Daniel Griffiths (20 June 1857 – 29 October 1936) was a Welsh international rugby union forward who played club rugby for Llanelli and international rugby for Wales. Morgan was a collier by profession.", "*Not to be confused with Daniel Griffiths who is also of Welsh decent and currently plys his Rugby trade at Warrington RUFC."]}]}}