{"wiki_id": "http://www.wikidata.org/entity/Q5217399", "itemLabel": "Daniel Hahn", "itemDescription": "British translator, editor and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Hahn", "wikipedia_page": {"main": "Daniel Hahn  (born 26 November 1973) is a British writer, editor and translator.He is the author of a number of works of non-fiction, including the history book The Tower Menagerie, and one of the editors of The Ultimate Book Guide, a series of reading guides for children and teenagers., the first volume of which won the Blue Peter Book Award. Other titles include Happiness Is a Watermelon on Your Head (a picture-book for children), The Oxford Guide to Literary Britain and Ireland (a reference book), brief biographies of the poets Samuel Taylor Coleridge and Percy Bysshe Shelley, and a new edition of The Oxford Companion to Children's Literature.His translation of The Book of Chameleons by José Eduardo Agualusa won the Independent Foreign Fiction Prize in 2007. His translation of A General Theory of Oblivion, also by José Eduardo Agualusa, won the 2017 International Dublin Literary Award, with Hahn receiving 25% of the €100,000 prize. His other translations include Pelé's autobiography and work by novelists José Luís Peixoto, Philippe Claudel, María Dueñas, José Saramago, Eduardo Halfon, Gonçalo M. Tavares, and others.\nA former chair of the Translators Association and the Society of Authors, as well as national programme director of the British Centre for Literary Translation, he currently serves on the board of trustees of the Society of Authors and a number of other organisations working with literature, literacy and free expression, including English PEN, The Children's Bookshow and Modern Poetry in Translation.\nIn 2017, Hahn donated half his winnings from the International Dublin Literary Award to help establish a new prize for debut literary translation - the TA First Translation Prize.Hahn was appointed Officer of the Order of the British Empire (OBE) in the 2020 Birthday Honours for services to literature.", "link_mentions": [{"page": "International Dublin Literary Award", "response": ["| A General Theory of Oblivion(translated by Daniel Hahn)"]}, {"page": "Royal Society of Literature", "response": ["| Daniel Hahn OBE"]}, {"page": "Translators Association", "response": ["Previous committee members include Anthea Bell, Peter Bush, Robert Chandler, Charlotte Collins, Howard Curtis, Daniel Hahn, Nicky Harman, Antonia Lloyd-Jones, Ruth Martin, Samantha Schnee, Ros Schwartz, Jamie Lee Searle, Trista Selous, Deborah Smith, Ruth Urborn, Helen Wang."]}, {"page": "International Booker Prize", "response": ["*José Eduardo Agualusa (Angola), Daniel Hahn (translator), for A General Theory of Oblivion (Teoria Geral do Esquecimento)", "The 2017 prize was judged by Nick Barley (Chair), Daniel Hahn, Helen Mort, Elif Shafak and Chika Unigwe. The longlist for the eighth Man Booker International Prize was announced on 14 March 2017, and the shortlist on 20 April 2017. The winner was announced on 14 June 2017. Grossman became the first Israeli author to win the prize, sharing the £50,000 award with Cohen. Nick Barley, who is the director of the Edinburgh International Book Festival, described the book as \"an ambitious high-wire act of a novel [that] shines a spotlight on the effects of grief, without any hint of sentimentality. The central character is challenging and flawed, but completely compelling.\" The novel won over 126 other contenders."]}, {"page": "José Eduardo Agualusa", "response": ["Agualusa writes predominantly in his native language, Portuguese. His books have been translated into twenty-five languages, most notably into English by translator Daniel Hahn, a frequent collaborator of his. Much of his writing focuses on the history of Angola.", "* A sociedade dos sonhadores involuntários (2017) The Society of Reluctant Dreamers, trans. Daniel Hahn (2019).", "These novels were all translated into English by Daniel Hahn:", "In June 2017, Agualusa, alongside Daniel Hahn, his translator, was awarded the International Dublin Literary Award for his novel A General Theory of Oblivion. Agualusa's work beat a shortlist of ten titles from around the world, including one written by Irish author Anne Enright, to claim the €100,000 prize. Agualusa was awarded €75,000 personally, as the translator, Daniel Hahn, was entitled to a €25,000 share of the prize money.", "* \"A General Theory Of Oblivion by José Eduardo Agualusa; trans. Daniel Hahn, book review\", The Independent, 2 July 2015"]}, {"page": "Independent Foreign Fiction Prize", "response": ["*  José Eduardo Agualusa, The Book of Chameleons, (Portuguese, trans. Daniel Hahn)", "* Jose Eduardo Agualusa, My Father's Wives (translated by Daniel Hahn from the Portuguese)"]}, {"page": "Chloe Aridjis", "response": ["Her debut novel Book of Clouds was published in the US by Grove Press in winter 2009, and by Chatto and Windus in the UK in July 2009, in the Netherlands, and by Mercure de France in September 2009. It was published in Mexico, Spain, Romania and Croatia in 2011 and as a graphic novel in French in early 2012. In his review of Book of Clouds for The Independent, Daniel Hahn described it as an \"exceptional debut novel\". In The New York Times, Wendy Lesser described it as \"a stunningly accurate portrait of Berlin\". Regina Marler in the Los Angeles Times drew attention to Aridjis's \"magic and poetry\", and described \"an unsettling atmosphere unlike anything in recent fiction.\""]}, {"page": "Blue Peter Book Award", "response": ["** Best Book with Facts: The Ultimate Book Guide edited by Daniel Hahn (A & C Black)", "** The Ultimate Book Guide edited by Daniel Hahn (A & C Black)"]}, {"page": "List of translators into English", "response": ["*Daniel Hahn"]}, {"page": "Hampshire Book Awards", "response": ["**Happiness is a Watermelon on your Head by Stella Dreis, translated by Daniel Hahn"]}, {"page": "Tina Kover", "response": ["She is the co-founder, with Charlotte Coombe, of the YouTube channel Translators Aloud, which features literary translators reading from their own work. Contributors have included Jennifer Croft, Daniel Hahn, Antonia Lloyd-Jones, Ros Schwartz, and Frank Wynne."]}, {"page": "The Ultimate Book Guide", "response": ["The Ultimate Book Guides are an award-winning series of reading guides for children and teenagers. The guides are edited by Leonie Flynn, Daniel Hahn, and Susan Reuben and published in the U.K. by A&C Black. The reading guides comprise book recommendations written by children's authors and illustrators including Jacqueline Wilson, Terry Pratchett, Quentin Blake, Susan Cooper, and Dick King-Smith."]}, {"page": "Daniel hahn", "response": ["#REDIRECT Daniel Hahn "]}, {"page": "English PEN", "response": ["* \tDaniel Hahn OBE, writer, editor and translator"]}, {"page": "My Father's Wives", "response": ["My Father's Wives is a novel by the Angolan author José Eduardo Agualusa published in 2008 by Arcadia Books (London, England). It was translated by Daniel Hahn from Portuguese: As Mulheres do Meu Pai, published in 2007 by Editora Língua Geral (Rio de Janeiro, Brazil) and Publicações Dom Quixote (Lisbon, Portugal)."]}, {"page": "Arnold House School", "response": ["* Daniel Hahn, writer, editor and translator"]}]}}