{"wiki_id": "http://www.wikidata.org/entity/Q5216541", "itemLabel": "Daniel Bentley", "itemDescription": "English association football player (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Bentley", "wikipedia_page": {"main": "Daniel Ian Bentley (born 13 July 1993) is an English professional footballer who plays as a goalkeeper for EFL Championship club Bristol City. He has played in the English Football League for Southend United and Brentford.", "link_mentions": [{"page": "Bristol City F.C.", "response": ["|2020-21|| Daniel Bentley||Goalkeeper"]}, {"page": "July 13", "response": ["*1993 – Daniel Bentley, English footballer"]}, {"page": "1993", "response": ["** Daniel Bentley, English footballer"]}, {"page": "Wycombe Wanderers F.C.", "response": ["Following the near-relegation of the previous season, Gareth Ainsworth released seven players from the club, including defender Leon Johnson who had made 200 appearances in 7 years. During the summer break, Ainsworth rebuilt his squad, with the addition of Paul Hayes for a second spell at the club. The 2014–15 season saw the club spend the majority of the season in the automatic promotion places. However, two costly home defeats to Morecambe and local rivals Oxford United led to a finishing position of 4th, setting up a play-off fixture against Plymouth Argyle. The play-off final took place on 23 May and within five seconds of kick-off Wycombe midfielder Sam Saunders pulled his calf muscle and had to be substituted for Matt Bloomfield in the fourth minute. During the regular 90 minutes both teams had a goal disallowed, but neither managed to score. Four minutes into extra time Wycombe were awarded a free kick just outside the Southend penalty area. Joe Jacobson took the free kick and the ball rebounded off keeper Daniel Bentley and into the net. Southend continued to put pressure on Wycombe until Joe Pigott scored in the 122nd minute to tie the game at 1–1 and send it to a penalty shoot out. Southend won the shoot out 7–6 when Sam Wood's effort was saved by Bentley."]}, {"page": "Southend United F.C.", "response": ["|2014–15||Daniel Bentley"]}, {"page": "Luke Daniels", "response": ["On 24 May 2017, Daniels joined Championship club Brentford on a free transfer and signed a three-year contract, with an option for a further year, effective 1 July 2017. Daniels appeared in each of the club's four cup matches during the 2017–18 season and made his league debut versus Hull City on the final day, in which he helped preserve a 1–1 draw by saving a second-half penalty. Aside from cup appearances and two league starts, Daniels was again backup to Daniel Bentley for the majority of the 2018–19 season, until a season-ending shoulder injury suffered by Bentley in March 2019 allowed Daniels a run in the team in league matches and he finished the season with 19 appearances in all competitions."]}, {"page": "Branislav Ivanović", "response": ["Although suffering a minor injury in the beginning of pre-season, Ivanović returned during Chelsea's tour of the United States and continue to rotate throughout the games with young right back Ola Aina. Ivanović continued his role as the right-back in the 2–1 during the season opener against West Ham United. However, preceding Chelsea's 3–0 defeat against Arsenal in September, Ivanović was replaced by Victor Moses for the foreseeable future. This, therefore, forced manager Antonio Conte to switch to his favored 3–4–3 formation in their 2–0 victory over Hull City. Ivanović went on to score his last goal in his final appearance for Chelsea in their 4–0 home victory against Championship side Brentford in the FA Cup, driving a low, hard shot past goalkeeper Daniel Bentley."]}, {"page": "The Bromfords School", "response": ["* Brentford F.C. goalkeeper Daniel Bentley"]}]}}