{"wiki_id": "http://www.wikidata.org/entity/Q5217273", "itemLabel": "Daniel Gibson Harris", "itemDescription": "British agent and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Gibson_Harris", "wikipedia_page": {"main": "Daniel Gibson Harris (1915–2007) was an accountant, a British agent during World War II and a writer on Swedish naval history.\nHe was born in Great Missenden, Buckinghamshire, England and, after attending Sherborne School, trained as a chartered accountant. He joined the Royal Naval Supplementary Volunteer Reserve but, having learned Swedish, was sent in 1940 to the British embassy in Stockholm as Assistant Naval Attache, and remained there for the rest of the war. During Operation Rheinübung, together with his superior, Captain Henry Denham, he obtained details of the current position of the Bismarck - this information then led to its chase and eventual sinking by the British Navy. In 1943, he met and married Marianne Syk - their marriage continued until his death. Towards the end of his life, he wrote and published a memoir, Observed Secretly: Northern Window about his experiences during the War.After the war, Harris remained in Stockholm for a while as an employee of the English Steel Corporation, and then moved first to New York City and then to Alberta, Canada. In 1960, he joined the National Energy Board and in 1963, moved to Ottawa where he helped found the Canadian Nordic Society.After he retired in the early 1980s, Harris took a BA in history at Carleton University and started seriously pursuing his interest in Swedish naval history. In 1989, he published his first book F H Chapman: The First Naval Architect and his work. He also published a number of papers and articles on Swedish naval history, continuing to do so until his final years. In 1991, he was awarded the Silver Medal of Merit of the Swedish Royal Society of Naval Sciences.Harris died on 19 November 2007 at Bells Corners, Ottawa, Ontario, Canada.", "link_mentions": {}}}