{"wiki_id": "http://www.wikidata.org/entity/Q5214019", "itemLabel": "Dan Michaelson", "itemDescription": "musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dan_Michaelson", "wikipedia_page": {"main": "Dan Michaelson (born 1976) is a British musician who originally found success as singer with Absentee, before recording with Dan Michaelson and The Coastguards and as a solo artist.", "link_mentions": [{"page": "Absentee (band)", "response": ["Absentee were an English alternative rock band from London, England, signed to Memphis Industries. The band members were Dan Michaelson (vocals/guitar), Melinda Bronstein (vocals, keyboards, melodica, glockenspiel), Babak Ganjei (guitar/lap steel), Laurie Earle (bass) and Jon Chandler (drums, later replaced by Che Albrighton).Fulton, Katherine \"Absentee Biography\", AllMusic. Retrieved 3 January 2018", "When not recording and touring with Absentee, all the band members had side projects, Michaelson with Dan Michaelson and The Coastguards, Ganjei, Bronstein and Earle with Wet Paint, and Bronstein with The Bronsteins. In 2011, Michaelson released his debut solo album, Sudden Fiction.Nicholson, Rebecca (2011) \"Dan Michaelson: Sudden Fiction – review\", The Guardian, 3 November 2011. Retrieved 3 January 2018"]}, {"page": "The Broken Family Band", "response": ["Adams' second solo album, Old Magick, which was produced by Dan Michaelson, was released in March 2016 on Fortuna Pop!."]}, {"page": "Valgeir Sigurðsson", "response": ["| 2009 || Dan Michaelson & The Coastgrds || Saltwater || Producer"]}, {"page": "Memphis Industries", "response": ["* Dan Michaelson & The Coastguards"]}, {"page": "Schmotime", "response": ["*Dan Michaelson - vocals"]}, {"page": "The Climbers (band)", "response": ["The band is a part of the Willkommen Collective, featuring members of The Leisure Society, Sons of Noel and Adrian, The Miserable Rich and many more. The album also features guest vocals from Sharon Lewis of Pooka, Dan Michaelson of Absentee and Dan Michaelson & The Coastguards. The band have also recorded with Alessi Laurent-Marke of Alessi's Ark."]}, {"page": "Lorne Balfe", "response": ["| Composed with Dan Michaelson"]}, {"page": "Blindspot (album)", "response": ["Blindspot is the fourth album by Dan Michaelson  Dan Michaelson and The Coastguards and was released in March 2013 by the London independent label The State 51."]}, {"page": "Dan Michaelson and The Coastguards", "response": ["Dan Michaelson and The Coastguards is a name under which singer-songwriter Dan Michaelson records and performs. They have previously stated that they are inspired by Leonard Cohen, Johnny Cash, Etta James and Dusty Springfield.", "===Dan Michaelson===", "| Dan Michaelson and The Coastguards || Saltwater (2009) || Memphis Industries || CD, Download", "| Dan Michaelson and The Coastguards || Shakes (2010) || Editions || CD, Download", "| Dan Michaelson || Sudden Fiction (2011) || Editions || LP, CD, Download", "| Dan Michaelson and The Coastguards || Blindspot (2013) || The state51 Conspiracy || CD, Download ", "| Dan Michaelson and The Coastguards || Distance (2014) || The state51 Conspiracy || LP, CD, Download", "| Dan Michaelson and The Coastguards || Memory (2016) || The state51 Conspiracy || LP, CD, Download", "*Dan Michaelson and The Coastguards official site", "*Dan Michaelson and The Coastguards myspace page"]}, {"page": "Sudden Fiction (album)", "response": ["Sudden Fiction is the third album by Dan Michaelson aka Dan Michaelson and The Coastguards and was released by indie label Editions in 2011.Nicholson, Rebecca (2011) \"Dan Michaelson: Sudden Fiction – review\", The Guardian, 3 November 2011. Retrieved 28 January 2012"]}, {"page": "Steven Adams (musician)", "response": ["Adams's second solo album, Old Magick, which was produced by Dan Michaelson, was released in March 2016 on Fortuna Pop!."]}, {"page": "Distance (Dan Michaelson and The Coastguards album)", "response": ["Distance is the fourth album by Dan Michaelson aka Dan Michaelson and The Coastguards. Released by London label The state51 Conspiracy in August 2014."]}, {"page": "The Songs of Leonard Cohen Covered", "response": ["Dan Michaelson – \"Avalanche\""]}, {"page": "Memory (Dan Michaelson and The Coastguards album)", "response": ["Memory is a 2016 album by Dan Michaelson and The Coastguards. It is the final installment in an album trilogy that commenced with 2013's Blindspot and continued with Distance in 2014.The Guardian May 5, 2016 Dan Michaelson and the Coastguards: Memory review – magical, melancholy songs The album was written and produced by Michaelson and mixed by Ash Workman (Metronomy, Christine and the Queens). The album was recorded at The Premises, London and is available on CD, vinyl and digital. Joining the Coastguards (Henry Spenner, Laurie Earle and Horse) are Romeo Stodart of The Magic Numbers and Johnny Flynn.thelineofbestfit.com Track By Track: Dan Michaelson on Memory, his new album with the Coastguards ", "\"I went looking for a way to carry what I'd written. Memory is the end point of this particular story. In my small world, Blindspot is the script, Distance is the play, and Memory is the widescreen movie.\" — Dan Michaelson", "*Dan Michaelson (vocals, guitar, piano)", "*Dan Michaelson"]}]}}