{"wiki_id": "http://www.wikidata.org/entity/Q5218480", "itemLabel": "Daniel Powell", "itemDescription": "British footballer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Powell", "wikipedia_page": {"main": "Daniel Vendrys Powell (born 12 March 1991) is an English professional footballer who plays as a winger or a striker for National League club Barnet.Powell started his career with Milton Keynes Dons, and made his first-team debut aged 17 in 2008. He had loan spells with Crawley Town, Forest Green Rovers and Darlington. In both 2010–11 (during which he scored 10 goals) and 2011–12 (11 goals), he helped Milton Keynes Dons reach the play-offs. Powell was a member of the Milton Keynes Dons team that won promotion to the Championship in 2015. Released by Milton Keynes Dons in 2017, he joined Northampton Town before moving to Crewe Alexandra two years later.", "link_mentions": [{"page": "Milton Keynes Dons F.C.", "response": ["Striker Sam Baldock was the first notable academy graduate who, after making 102 appearances, moved on to West Ham for a seven-figure sum. Since then he became captain of Bristol City and now plays for Derby County. , Daniel Powell, Tom Flanagan and George Baldock, brother of Sam, all played regularly for the MK Dons first team."]}, {"page": "Jabo Ibehre", "response": ["Ibehre returned to MK Dons for the 2010–11 season, where he appeared briefly in the opening day win over Walsall as an 88th-minute substitute. He started in a League Cup victory over Dagenham & Redbridge on 10 August, netting a brace to give the Dons a 2–1 win. He didn't score again until 8 January 2011 when he grabbed an equaliser in a 1–1 draw with Exeter. One week later, he was handed a start against Tranmere and suitably scored again for his fourth goal of the campaign, providing the assist for Daniel Powell's opener before getting on the scoresheet himself, rifling home in the second half. He scored his last goal of the season on 15 February as the Dons hosted Ibehre's former club Leyton Orient at Stadium mk, a result of 3–2 to Orient, which brought Ibehre's tally to five goals in 48 appearances. Although the majority of his appearances came from the substitutes bench, his performances proved good enough to convince manager Karl Robinson to hand Ibehre a two-year contract extension in June 2011."]}, {"page": "Barry Cogan (footballer)", "response": ["Crawley Town manager Steve Evans signed Cogan on 8 June following his release from Grays Athletic. Evans admitted he tried signing Cogan three times the previous season, but had his attempts rejected. Cogan had other offers, but Crawley assistant manager Paul Raynor stated that the club's South London location appealed to him. He made his debut for Crawley on 8 August, in the 4–0 away defeat to Mansfield Town, replacing Daniel Powell as a substitute in the 52nd minute. Having made only three appearances in the 2010–11 season, Cogan was released by mutual consent on 16 November 2010. Evans stated that Cogan wanted to \"play some first team football\"."]}, {"page": "Jonathan Grounds", "response": ["Grounds recognised that in order to play regularly he needed to leave Middlesbrough. His contract expired at the end of the season, and he turned down an offer of a permanent move to Yeovil, before signing a two-year deal with League One club Oldham Athletic. He made a mixed start to his Oldham career: he scored the winner against Manchester City in a pre-season friendly, but in the opening league fixture, Milton Keynes Dons' Daniel Powell \"terrorised\" him. He started every game but twoa league match in November through suspension for five yellow cards, and the final match of the season, having injured his neck in the previous fixtureand scored once, at home to Shrewsbury Town. Playing on the wing in place of the suspended Cristian Montaño, he touched home a parried cross for the only goal of the match. He was ever-present through Oldham's 2012–13 FA Cup run, in which they eliminated Nottingham Forest and Liverpool, drew with Everton in the fifth round through Matt Smith's stoppage-time header from Grounds's corner, before losing 3–1 in the replay."]}, {"page": "Danny Green (footballer, born 1988)", "response": ["Green returned to Milton Keynes Dons on 23 May 2014, signing a two-year contract. Manager Karl Robinson said \"he gives us another exciting option out wide, to go along with Daniel Powell and Dean Bowditch\". He made 18 appearances and scored twice in all competitions during the 2014–15 season, as the Dons won promotion to the Championship as runners-up in League One. He left Stadium mk in July 2015 after Milton Keynes Dons agreed to cancel Green's contract a year early."]}, {"page": "2010–11 Milton Keynes Dons F.C. season", "response": ["| 1 October 2010 || FW ||  Daniel Powell || Darlington || November 2010 || "]}, {"page": "George Baldock", "response": ["Baldock made his first-team debut for Milton Keynes Dons on 1 May 2010 in the League One clash with Brighton & Hove Albion at the Stadium:mk which ended in 0–0 draw, coming on as a substitute for Daniel Powell in the 81st minute."]}, {"page": "2011 Football League One play-off Final", "response": ["Peterborough United's opponents for their play-off semi-final were Milton Keynes Dons with the first match of the two-legged tie taking place at Stadium MK in Milton Keynes on 15 May 2011.  Craig Mackail-Smith gave the visitors the lead in the 8th minute, scoring after MK Dons goalkeeper David Martin pushed away a strike from Nathaniel Mendez-Laing.  In the 47th minute, Daniel Powell levelled the score from close range after a defensive error from Tommy Rowe and three minutes later MK Dons went ahead 2–1 after Sam Baldock's free-kick went through the wall into the Peterborough net.  Ángelo Balanta made it 3–1 in the 56th minute after beating Peterborough goalkeeper Paul Jones at the near post.  Charlie Lee was then sent off for Peterborough after receiving two yellow cards, the second for a foul on Powell.  With nine minutes remaining, Stephen Gleeson was also sent off, for a foul on Mark Little, and Grant McCann converted the subsequent penalty to make the final score 3–2 to MK Dons.  The second leg was held four days later at London Road in Peterborough.  McCann scored in the 11th minute from a free-kick to put Peterborough into the lead before Mackail-Smith's close-range strike made it 2–0 and sent his side to the final with a 4–3 aggregate victory."]}, {"page": "2012 Football League One play-off Final", "response": ["Huddersfield Town faced Milton Keynes Dons in the other play-off semi-final with the first leg being played at Stadium MK in Milton Keynes on 12 May 2012.  Midway through the first half, Jordan Rhodes gave the visitors the lead when he scored with a header from Lee Novak's cross.  In the second half, an exchange of passes between Jack Hunt and Kallum Higginbotham led to Hunt striking from inside the MK Dons penalty area past David Martin in goal to make it 2–0.  The second leg took place at the Galpharm Stadium in Huddersfield three days later.  Rhodes put the visitors ahead with a free kick before Daniel Powell equalised from around .  Alan Smith scored a late header to give MK Dons a 2–1 win but Huddersfield progressed to the final with a 3–2 aggregate victory."]}]}}