{"wiki_id": "http://www.wikidata.org/entity/Q5217819", "itemLabel": "F. C. Burnand", "itemDescription": "British comic writer and dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/F._C._Burnand", "wikipedia_page": {"main": "Sir Francis Cowley Burnand (29 November 1836 – 21 April 1917), usually known as F. C. Burnand, was an English comic writer and prolific playwright, best known today as the librettist of Arthur Sullivan's opera Cox and Box.\nThe son of a prosperous family, he was educated at Eton and Cambridge and was expected to follow a conventional career in the law or in the church, but he concluded that his vocation was the theatre. From his schooldays he had written comic plays, and from 1860 until the end of the 19th century, he produced a series of more than 200 Victorian burlesques, farces, pantomimes and other stage works. His early successes included the burlesques Ixion, or the Man at the Wheel (1863) and The Latest Edition of Black-Eyed Susan; or, the Little Bill that Was Taken Up (1866).  Also in 1866, he adapted the popular farce Box and Cox as a comic opera, Cox and Box, with music by Sullivan. The piece became a popular favourite and was later frequently used by the D'Oyly Carte Opera Company as a curtain raiser; it remains regularly performed today.\nBy the 1870s, Burnand was generating a prodigious output of plays as well as comic pieces and illustrations for the humour magazine Punch. Among his 55-stage works during the decade was another frequently revived hit, Betsy (1879). For Punch, among other things, he wrote the popular column \"Happy Thoughts\", in which the narrator recorded the difficulties and distractions of everyday life. Also admired were his burlesques of other writers' works. Burnand was a contributor to Punch for 45 years and its editor from 1880 until 1906 and is credited with adding much to the popularity and prosperity of the magazine. His editorship of the original publication of The Diary of a Nobody by the brothers George and Weedon Grossmith was a high point of his tenure in 1888–89. Many of his articles were collected and published in book form. His stage successes in the 1890s included his English-language versions of two Edmond Audran operettas, titled La Cigale and Miss Decima (both in 1891). His last works included collaborations on pantomimes of Cinderella (1905) and Aladdin (1909).\nKnown generally for his genial wit and good humour, Burnand was nevertheless intensely envious of his contemporary W. S. Gilbert but was unable to emulate his rival's success as a comic opera librettist. In other forms of theatre Burnand was outstandingly successful, with his works receiving London runs of up to 550 performances and extensive tours in the British provinces and the US.  He published several humorous books and memoirs and was knighted in 1902 for his work on Punch.", "link_mentions": [{"page": "Arthur William à Beckett", "response": ["*With F. C. Burnand he co-authored:"]}, {"page": "Gilbert and Sullivan", "response": ["Sullivan's first foray into comic opera was Cox and Box (1866), written with the librettist F. C. Burnand for an informal gathering of friends. Public performance followed, with W. S. Gilbert (then writing dramatic criticism for the magazine Fun) saying that Sullivan's score \"is, in many places, of too high a class for the grotesquely absurd plot to which it is wedded.\"Harris, pp. X–XI Nonetheless, it proved highly successful, and is still regularly performed today. Sullivan and Burnand's second opera, The Contrabandista (1867) was not as successful.", "Fred Sullivan was the prototype for the \"patter\" (comic) baritone roles in the later operas. F. C. Burnand wrote that he \"was one of the most naturally comic little men I ever came across. He, too, was a first-rate practical musician.... As he was the most absurd person, so was he the very kindliest....\"Ayer p. 408 Fred's creation would serve as a model for the rest of the collaborators' works, and each of them has a crucial comic little man role, as Burnand had put it. The \"patter\" baritone (or \"principal comedian\", as these roles later were called) would often assume the leading role in Gilbert and Sullivan's comic operas, and was usually allotted the speedy patter songs.", "Sullivan's old collaborator on Cox and Box (later the editor of Punch magazine), F. C. Burnand, wrote to the composer: \"Magnificento!...I envy you and W.S.G. being able to place a piece like this on the stage in so complete a fashion.\"Baily, p. 344 The opera enjoyed a run longer than any of their other joint works except for H.M.S. Pinafore, Patience and The Mikado. There was a command performance of The Gondoliers for Queen Victoria and the royal family at Windsor Castle in 1891, the first Gilbert and Sullivan opera to be so honoured. The Gondoliers was Gilbert and Sullivan's last great success."]}, {"page": "1917", "response": ["* April 18 – F. C. Burnand, British playwright and comic writer (b. 1836)"]}, {"page": "1866", "response": ["* May 26 – First production of the comic opera Cox and Box by F. C. Burnand and Arthur Sullivan at Moray Lodge, Kensington"]}, {"page": "Arthur Sullivan", "response": ["Sullivan's first attempt at opera, The Sapphire Necklace (1863–64) to a libretto by Henry F. Chorley, was not produced and is now lost, except for the overture and two songs that were separately published.Jacobs, pp. 42–43 His first surviving opera, Cox and Box (1866), was written for a private performance.Ainger, p. 65 It then received charity performances in London and Manchester, and was later produced at the Gallery of Illustration, where it ran for an extraordinary 264 performances. W. S. Gilbert, writing in Fun magazine, pronounced the score superior to F. C. Burnand's libretto.Young, p. 63 Sullivan and Burnand were soon commissioned by Thomas German Reed for a two-act opera, The Contrabandista (1867; revised and expanded as The Chieftain in 1894), but it did not do as well.Young, p. 63; and Rollins and Witts, p. 15 Among Sullivan's early part songs is \"The Long Day Closes\" (1868).Sullivan, Marc. \"Discography of Sir Arthur Sullivan: Recordings of Hymns and Songs\", the Gilbert and Sullivan Discography, 11 July 2010, accessed 9 September 2011 Sullivan's last major work of the 1860s was a short oratorio, The Prodigal Son, first given in Worcester Cathedral as part of the 1869 Three Choirs Festival to much praise.\"Worcester Music Festival\", The Times, 9 September 1869, p. 10", "With the aid of an intermediary, Sullivan's music publisher Tom Chappell, the three partners were reunited in 1892.Ainger, p. 328 Their next opera, Utopia, Limited (1893), ran for 245 performances, barely covering the expenses of the lavish production,Ainger, p. 346 although it was the longest run at the Savoy in the 1890s.Coles, Clifton. \"Mirette: Introduction\", the Gilbert and Sullivan Archive, 28 May 1998, accessed 28 July 2018 Sullivan came to disapprove of the leading lady, Nancy McIntosh, and refused to write another piece featuring her; Gilbert insisted that she must appear in his next opera.Ainger, p. 352 Instead, Sullivan teamed up again with his old partner, F. C. Burnand. The Chieftain (1894), a heavily revised version of their earlier two-act opera, The Contrabandista, flopped.Ainger, p. 357 Gilbert and Sullivan reunited one more time, after McIntosh announced her retirement from the stage, for The Grand Duke (1896). It failed, and Sullivan never worked with Gilbert again, although their operas continued to be revived with success at the Savoy.Young, p. 201"]}, {"page": "Richard D'Oyly Carte", "response": ["Between 1868 and 1877, Carte wrote and published the music for several of his own songs and instrumental works, as well as three short comic operas: Doctor Ambrosias – His Secret (1868), Marie (1871), and Happy Hampstead (1876). On tour in 1871 he conducted Cox and Box by Arthur Sullivan and F. C. Burnand, in tandem with English adaptations of two one-act pieces by Offenbach, The Rose of Auvergne and Breaking the Spell, in which Carte's client Selina Dolaro starred.\"Theatres\", Liverpool Mercury, 5 September 1871, p. 1. Carte's musical talent would be helpful later in his career, as he was able to audition singers himself from the piano.Stedman, p. 170", "Utopia was Carte's most expensive production to date, but it ran for a comparatively disappointing 245 performances, until June 1894. Carte then played first Mirette, by Messager, then The Chieftain, by F. C. Burnand and Sullivan. These ran for 102 and 97 performances, respectively.Rollins and Witts, pp. 14–15 The company then toured the London suburbs, and the Savoy was leased to other managements until November, when Carte presented a revival of The Mikado.Seeley, Chapter 8 This was followed in 1896 by The Grand Duke, which ran for 123 performances and was Gilbert and Sullivan's only financial failure. The Gondoliers turned out to be Gilbert and Sullivan's last big hit, and after The Grand Duke, the two men never collaborated again. At the Savoy, Carte produced His Majesty (1897), The Grand Duchess of Gerolstein (1897), The Beauty Stone (1898) and The Lucky Star (1899), as well as revivals of the Gilbert and Sullivan operas.Rollins and Witts, pp. 16–18"]}, {"page": "Cleopatra", "response": ["In Victorian Britain, Cleopatra was highly associated with many aspects of ancient Egyptian culture and her image was used to market various household products, including oil lamps, lithographs, postcards and cigarettes. Fictional novels such as H. Rider Haggard's Cleopatra (1889) and Théophile Gautier's One of Cleopatra's Nights (1838) depicted the queen as a sensual and mystic Easterner, while the Egyptologist Georg Ebers's Cleopatra (1894) was more grounded in historical accuracy. The French dramatist Victorien Sardou and Irish playwright George Bernard Shaw produced plays about Cleopatra, while burlesque shows such as F. C. Burnand's Antony and Cleopatra offered satirical depictions of the queen connecting her and the environment she lived in with the modern age. Shakespeare's Antony and Cleopatra was considered canonical by the Victorian era. Its popularity led to the perception that the 1885 painting by Lawrence Alma-Tadema depicted the meeting of Antony and Cleopatra on her pleasure barge in Tarsus, although Alma-Tadema revealed in a private letter that it depicts a subsequent meeting of theirs in Alexandria. Also based on Shakespeare's play was Samuel Barber's opera Antony and Cleopatra (1966), commissioned for the opening of the Metropolitan Opera House. In his unfinished 1825 short story The Egyptian Nights, Alexander Pushkin popularized the claims of the 4th-century Roman historian Aurelius Victor, previously largely ignored, that Cleopatra had prostituted herself to men who paid for sex with their lives. Cleopatra also became appreciated outside the Western world and Middle East, as the Qing-dynasty Chinese scholar Yan Fu wrote an extensive biography of her."]}, {"page": "Savoy opera", "response": ["Gilbert, Sullivan, Carte and other Victorian era British composers, librettists and producers,Such as German Reeds, Frederic Clay, Edward Solomon and F. C. Burnand as well as the contemporary British press and literature, called works of this kind \"comic operas\" to distinguish their content and style from that of the often risqué continental European operettas that they wished to displace. Most of the published literature on Gilbert and Sullivan since that time refers to these works as \"Savoy Operas\", \"comic operas\", or both.See, e. g., Crowther, Stedman, Bailey, Bradley, Ainger and Jacobs. Gilbert & Sullivan described 13 of their 14 collaborations as \"operas\" or \"operatic\":", "|The Chieftain || F. C. Burnand || Arthur Sullivan || Savoy", "|His Majesty || F. C. Burnand, R. C. Lehmann, & Adrian Ross ||Alexander Mackenzie || Savoy", "|F. C. Burnand"]}, {"page": "Aestheticism", "response": ["In Britain the best representatives were Oscar Wilde, Algernon Charles Swinburne (both influenced by the French Symbolists), James McNeill Whistler and Dante Gabriel Rossetti. These writers and their style were satirised by Gilbert and Sullivan's comic opera Patience and other works, such as F. C. Burnand's drama The Colonel, and in comic magazines such as Punch, particularly in works by George Du Maurier."]}, {"page": "1917 in literature", "response": ["*April 21 – F. C. Burnand, English dramatist and editor (born 1836)Stedman, Jane W. \"Burnand, Sir Francis Cowley (1836–1917)\", Oxford Dictionary of National Biography, Oxford University Press, September 2004, accessed 8 June 2014,  "]}, {"page": "Tom Taylor", "response": ["Some, like Ellen Terry, praised Taylor's kindness and generosity; others, including F. C. Burnand, found him obstinate and unforgiving. Terry wrote of Taylor in her memoirs:"]}, {"page": "1867 in music", "response": ["*May 11 – The first comic opera with a score by Arthur Sullivan to be publicly performed, the one-act Cox and Box with libretto by F. C. Burnand, opens at the Adelphi Theatre in London and runs for 300 performances. It is followed by the two-act The Contrabandista, or The Law of the Ladrones by the same partnership which opens on December 18 at St. George's Hall, London.  ", "*Arthur Sullivan (libretti by F. C. Burnand)"]}, {"page": "George Grossmith", "response": ["Grossmith had become the most popular solo entertainer of his day, and his tours earned him far more than he had earned while performing with the D'Oyly Carte Opera Company. He also continued to compose music, including the comic opera Castle Bang (1894) and the sketches The Ibsenite Drama (1895) and Do We Enjoy Our Holidays? (1897) and songs like \"The Baby on the Shore\" (1893), \"Johnnie at the Gaiety\" (1895), \"Tommy's First Love\" (1897), and \"The Happy Old Days at Peckham\" (1903). In 1894–95, however, Gilbert enticed Grossmith to take the role of George Griffenfeld in His Excellency, with music by Frank Osmond Carr.  Also in 1897, he played briefly as King Ferdinand V of Vingolia in F. C. Burnand's His Majesty at the Savoy Theatre and made two more short London stage appearances thereafter, as Scoones in Young Mr Yarde (1898) and Lambert Simnel in The Gay Pretenders (1900).Who's Who in the Theatre, First Edition, London, Sir Isaac Pitman and Sons, 1912, p. 214 An 1896 interview of Grossmith reveals him feeling his age and considering the end of his touring career, while enjoying time spent at home with his family, dogs and antique piano collection.Banfield, p. 550 Grossmith suffered from depression after the death of his wife of cancer in 1905, and his health began to fail, so that he increasingly missed engagements.  He was nevertheless persuaded to continue giving his entertainments, which he did on a less frequent basis, until November 1908. The following year, Grossmith retired to Folkestone, Kent, a town that he had visited for many years, where he wrote his second volume of reminiscences, Piano and I (1910).", "Grossmith was followed, in the Gilbert and Sullivan comic roles, by a number of other popular performers; those who played his roles at the Savoy Theatre for an extended period of time have included Henry Lytton, Martyn Green, Peter Pratt and John Reed, among others. Over forty of the songs that Grossmith wrote or performed in his one-man shows have been recorded by baritone Leon Berger (a British Gilbert & Sullivan singer and Grossmith scholar), accompanied by Selwyn Tillett (G&S scholar) on two CDs: A Society Clown: The Songs of George Grossmith and The Grossmith Legacy. The latter also contains the recorded voice of Grossmith's son, George Grossmith Jr. Both are on the Divine Art Label.Information from the Divine-Art website, accessed 9 March 2008 No recordings of Grossmith's voice are known to exist, although wax cylinder recording technology was available during his lifetime.Shepherd, Marc. Author index, Gilbert and Sullivan Discography, accessed 20 November 2013 Cups and Saucers was recorded by Retrospect Opera in 2016, together with F. C. Burnand and Edward Solomon's Pickwick.Chandler, David. \"Pickwick by Burnand & Solomon and Cups and Saucers by George Grossmith\",  Retrospect Opera, 2016, accessed 13 October 2017"]}, {"page": "Charles Hawtrey (actor, born 1858)", "response": ["From Rugby, Hawtrey went briefly to a crammer in London, to study for a career in the army, but soon abandoned the idea. He worked as a private tutor from 1876 to 1879 and then he began his theatrical career. It started badly: he broke his collar-bone while playing football and had to withdraw from the cast before the opening night.Hawtrey, p. 88 In February 1881 he matriculated at Pembroke College, Oxford, but withdrew in October, having been cast in the supporting role of Edward Langton in F. C. Burnand's The Colonel at the Prince of Wales's Theatre, London. Uncertain of success, he temporarily adopted the stage name Charles Bankes. He was well received in the play, and was given valuable lessons in stagecraft from the producer:"]}, {"page": "Burlesque", "response": ["Victorian burlesque, sometimes known as \"travesty\" or \"extravaganza\",According to the Grove Dictionary of Music and Musicians, \"the various genre terms were always applied freely\", and by the 1860s their use had become \"arbitrary and capricious\": see \"Burlesque,\" Grove Music Online. Oxford Music Online, accessed 3 February 2011 .  In an 1896 article on Burlesque in The Theatre, the three terms are used interchangeably: see Adams, W. Davenport. \"Burlesque: Old v. New\", The Theatre, 1 March 1896, pp. 144–45 was popular in London theatres between the 1830s and the 1890s. It took the form of musical theatre parody in which a well-known opera, play or ballet was adapted into a broad comic play, usually a musical play, often risqué in style, mocking the theatrical and musical conventions and styles of the original work, and quoting or pastiching text or music from the original work. The comedy often stemmed from the incongruity and absurdity of the classical subjects, with realistic historical dress and settings, being juxtaposed with the modern activities portrayed by the actors. Madame Vestris produced burlesques at the Olympic Theatre beginning in 1831 with Olympic Revels by J. R. Planché.Adams, W. Davenport. A Book of Burlesque (London: Henry and Co., 1891), p. 44 Other authors of burlesques included H. J. Byron, G. R. Sims, F. C. Burnand, W. S. Gilbert and Fred Leslie."]}, {"page": "May Whitty", "response": ["|1891-01-07||Private Enquiry||F. C. Burnand (based on Albert Valabrègue’s La Sécurité des Familles)||London||Royal Strand||Mrs. Buckleigh"]}, {"page": "St James's Theatre", "response": ["Following this the theatre had a succession of managements. F. B. Chatterton became the lessee for two years from 1858. He presented a season, mainly of Shakespeare, by the popular actor Barry Sullivan, and staged F. C. Burnand's first major play, a burlesque called Dido, which ran for 80 performances.Duncan, pp. 109–110 Alfred Wigan, who had been a member of Braham's original company, briefly took over the house in 1860, and was succeeded, equally briefly, by George Vining (1824–1875).Knight, Joseph. \"Wigan, Alfred Sydney (1814–1878), actor and Reynolds, K. D. \"Vining family (per. 1807–1915), actors\", Oxford Dictionary of National Biography, Oxford University Press. Retrieved 9 February 2019   Under Frank Matthews, who took over in December 1862, the theatre had its longest-running production thus far: Lady Audley's Secret, which ran for 104 nights.Mander and Mitchenson, p. 461 Matthews ended his tenancy in July 1863 and was followed by Benjamin Webster, who mounted a series of revivals and a few new burlesques and extravaganzas, which were financially unsuccessful.Duncan, p. 122"]}, {"page": "Opera Comique", "response": ["The first home-grown production at the theatre was a musical play in 1871, Marie, with music by Richard D'Oyly Carte and a libretto by E. Spencer Mott. This accompanied an English adaptation of Molière's Le Médecin malgré lui. The production was not a success.Ainger, p. 92; and \"Original Correspondence\", The Era, 10 September 1871 Opéras bouffes by Hervé, Offenbach and Lecocq, and extravaganzas by F. C. Burnand followed.\"The Opera Comique Theatre\", The Era, 15 October 1898, p. 11 After short seasons starring the Italian tragedienne Adelaide Ristori and then the English operetta star Emily Soldene, Carte became manager of the theatre in 1874, and presented The Broken Branch, an English version of Gaston Serpette's operetta La branch cassée, starring Pauline Rita.\"Opera Comique!, The Graphic, 29 August 1874, p. 211; and \"Opera Comique\",  The Pall Mall Gazette, 29 August 1874, p. 11 Carte's first attempt to found \"a permanent abode for Light Opera\" failed, and the theatre passed into other hands for the next three years."]}, {"page": "Comic opera", "response": ["Nevertheless, an 1867 production of Offenbach's The Grand Duchess of Gerolstein (seven months after its French première) ignited the English appetite for light operas with more carefully crafted librettos and scores, and continental European operettas continued to be extremely popular in Britain in the 1860s and 1870s, including Les Cloches de Corneville, Madame Favart and others into the 1880s, often adapted by H. B. Farnie and Robert Reece.  F. C. Burnand collaborated with several composers, including Arthur Sullivan in Cox and Box, to write several comic operas on English themes in the 1860s and 1870s."]}, {"page": "Eva Moore", "response": ["In 1894, she joined Charles Hawtrey and Lottie Venne in F. C. Burnand's A Gay Widow.Sharp, Robert Farquharson. A short history of the English stage, Walter Scott Publishing, 1909 Other stage roles included Mabel Vaughn in The Wilderness (1901); Lady Ernestone in Esmond's My Lady Cirtue and Wilhelmina Marr in his Billy's Little Love Affair (both 1903); and Kathie in Old Heidelberg (1902 and 1909) with George Alexander. In 1907, she took the name part in Sweet Kitty Bellaire (1907) and played Mrs. Errol in Little Lord Fauntleroy, Mrs. Crowley in The Explorer in 1908, the Hon. Mrs. Bayle in Best People and Mrs. Rivers in The House Opposite in 1909."]}, {"page": "List of Old Etonians born in the 19th century", "response": ["* F. C. Burnand (1836–1917), librettist, translator and dramatist"]}, {"page": "Henry James Byron", "response": ["From 1876 to 1879, he wrote several successful burlesques for the Gaiety Theatre, London, such as a burlesque of Dion Boucicault's Don Caesar de Bazan called Little Don Caesar de Bazan,Information about Little Don Caesar de Bazan and the Gaiety Theatre at VictorianWeb.org and The Gaiety Gulliver (1879).  Also during that period, he edited the humour magazine Mirth. In 1878, he co-wrote a highly successful charity pantomime, The Forty Thieves, together with Robert Reece, W. S. Gilbert and F. C. Burnand. In 1880, four volumes of his plays were published, with fourteen plays in each book.Byron, Henry James. \"Plays Volumes One to Four\", Samuel French & Thomas Lacy (1880) After 1880, as his health greatly declined, so did Byron's playwriting output. The popular three-act comedy The Guv'nor, credited to \"E. G. Lankester\" and first performed in the 1880s, has been attributed to Byron on stylistic grounds."]}, {"page": "The Grand Duke", "response": ["Gilbert and Sullivan's penultimate opera, Utopia, Limited (1893), was a very modest success compared with their earlier collaborations.  It introduced Gilbert's last protégée, Nancy McIntosh, as the heroine, who received generally unfavourable press.Ainger, pp. 349–50  Sullivan refused to write another piece if she was to take part in it.Ainger, p. 352  Discussions over her playing the role of Yum-Yum in a proposed revival of The Mikado led to another row between Gilbert and Sullivan that prevented the revival, and Gilbert's insistence upon her appearing in his 1894 opera, His Excellency, caused Sullivan to refuse to set the piece.Wolfson, pp. 61-62  After His Excellency closed in April 1895, McIntosh wrote to Sullivan informing him that she planned to return to concert singing, and so the obstacle to his further collaboration with Gilbert was removed.Ainger, p. 356  Meanwhile, Sullivan had written a comic opera for the Savoy Theatre with F. C. Burnand, The Chieftain, but that had closed in March 1895.Ainger, p. 357"]}, {"page": "List of University of Cambridge people", "response": ["*F. C. Burnand (Trinity)"]}, {"page": "T. W. Robertson", "response": ["Robertson's farcical sketch The Cantab, staged as an after-piece at the Strand Theatre in February 1861, attracted the attention of a Bohemian literary set, and led to his becoming a member of the Savage, Arundel and Reunion Clubs, where, in the words of his biographer Joseph Knight, \"he enlarged his observation of human nature, and whence he drew some curious types\". Among the up-and-coming writers with whom he mixed were F. C. Burnand, W. S. Gilbert, Tom Hood and Clement Scott. When Byron founded the magazine Fun in 1861, Robertson was a contributor from the outset. Writers for magazines and papers were seldom well paid, and to maintain a modest income Robertson wrote copiously: Pemberton lists a dozen publications to which he contributed in this period, ranging from Beeton's Englishwoman's Domestic Magazine and The Boy's Own Magazine to London Society and The Illustrated Times.Pemberton (1893), p. 84 Success remained elusive, and Robertson considered giving up writing and becoming a tobacconist."]}, {"page": "Henry Kemble", "response": ["On 31 January 1880 he appeared at the Haymarket Theatre as Mr Stout on the opening night of Bulwer-Lytton's Money. After two years alternating between the Haymarket and touring the provinces, first with Ellen Terry and then with Mrs Scott-Siddons, he reappeared in February 1882 at the Court Theatre as the Revd Mr Jones in Dion Boucicault's adaptation of My Little Girl and as Mr Justice Bunby in F. C. Burnand's farce The Manager. In 1885 he played his old part of Mr Snarl in Masks and Faces, by Charles Reade and Tom Taylor."]}, {"page": "Clement Scott", "response": ["He became the dramatic writer for The Sunday Times in 1863 but held the position for only two years because of the intemperance of his published opinions and his unpopular praise of the French theatre. In 1871, Scott began his nearly thirty years as a theatre critic with The Daily Telegraph. He also contributed regularly to The Theatre, a magazine that he edited from 1880 to 1889, and wrote sentimental poetry and song lyrics (including \"Oh Promise Me\"), which were often published in the magazine Punch by his friend, the editor, F. C. Burnand. Scott continued to work at the War Office until 1879, when he finally decided to earn his living entirely by writing."]}, {"page": "Patience (opera)", "response": ["The opera is a satire on the aesthetic movement of the 1870s and '80s in England, part of the 19th-century European movement that emphasised aesthetic values over moral or social themes in literature, fine art, the decorative arts, and interior design. Called \"Art for Art's Sake\", the movement valued its ideals of beauty above any pragmatic concerns.Smith, Steve. \"A Satire With Targets Not So Well Remembered\", The New York Times, 5 January 2014 Although the output of poets, painters and designers was prolific, some argued that the movement's art, poetry and fashion was empty and self-indulgent.Fargis, p. 261Denney, p. 38 That the movement was so popular and also so easy to ridicule as a meaningless fad helped make Patience a big hit. The same factors made a hit out of The Colonel, a play by F. C. Burnand based partly on the satiric cartoons of George du Maurier in Punch magazine. The Colonel beat Patience to the stage by several weeks, but Patience outran Burnand's play. According to Burnand's 1904 memoir, Sullivan's friend the composer Frederic Clay leaked to Burnand the information that Gilbert and Sullivan were working on an \"æsthetic subject\", and so Burnand raced to produce The Colonel before Patience opened.Burnand, p. 165In fact, many stage works prior to 1881 had satirised the aesthetic craze.  A review of Patience in The Illustrated London News noted: \"By this time the [English] stage is thickly sown all over with a crop of lilies and sunflowers\". June 18, 1881, p. 598, discussed and quoted in Williams, pp. 153–54. Modern productions of Patience have sometimes updated the setting of the opera to an analogous era such as the hippie 1960s, making a flower-child poet the rival of a beat poet.Bradley, 2005"]}, {"page": "Francis Cowley Burnand", "response": ["#REDIRECT F. C. Burnand"]}, {"page": "Charles Wyndham (actor)", "response": ["In London, Wyndham became known for his comic skills, both in light comedy and farce. He took over the management of the Criterion Theatre in 1876 and remained in charge there for more than 20 years. \"Criterion farce\" became a familiar feature of the West End theatre, usually risqué French pieces toned down to avoid shocking the Victorian British audience. Later, Wyndham was known for his appearances in period costume dramas, most of all T. W. Robertson's David Garrick, which he revived frequently. Among the authors who wrote for him were W. S. Gilbert, F. C. Burnand and Henry Arthur Jones. Oscar Wilde wrote The Importance of Being Earnest with Wyndham in mind, but circumstances prevented him from playing in it.", "Wyndham joined the company of the Royalty in May 1866 under the management of Patty Oliver. He played Sir Arthur Lascelles in Maddison Morton's well-known play, All That Glitters Is Not Gold, given as a supporting piece to a new extravaganza.Pemberton, p. 36 Of his later roles during the season, the most prominent was as the smuggler, Hatchett, in F. C. Burnand's new and immensely popular burlesque on Douglas Jerrold's nautical comedy, Black-Eyed Susan, with Oliver and Nelly Bromley. Burnand was impressed by Wyndham – his dancing as much as his acting.Burnand, p. 302"]}, {"page": "Sir Francis Burnand", "response": ["#REDIRECT F. C. Burnand"]}, {"page": "His Majesty (comic opera)", "response": ["His Majesty, or, The Court of Vingolia is an English comic opera in two acts with dialogue by F. C. Burnand, lyrics by R. C. Lehmann, additional lyrics by Adrian Ross and music by Alexander Mackenzie.  ", "Carte assembled a high-quality team for His Majesty, including the well-known dramatist and writer F. C. Burnand and the well-respected composer Alexander Mackenzie.  Lyrics were supplied by Rudolph Lehmann, though his career gave no hint of a particular talent at writing verse."]}, {"page": "Cox and Box", "response": ["Cox and Box; or, The Long-Lost Brothers, is a one-act comic opera with a libretto by F. C. Burnand and music by Arthur Sullivan, based on the 1847 farce Box and Cox by John Maddison Morton. It was Sullivan's first successful comic opera. The story concerns a landlord who lets a room to two lodgers, one who works at night and one who works during the day. When one of them has the day off, they meet each other in the room and tempers flare. Sullivan wrote this piece five years before his first opera with W. S. Gilbert, Thespis.", "The Moray Minstrels were an informal gathering of notable men involved in London society and the arts, including painters, actors and writers, who were mostly amateur musicians. They would meet for musical evenings at Moray Lodge, in Kensington, the home of Arthur James Lewis (1824–1901), a haberdasher and silk merchant (of the firm Lewis & Allenby), who married the actress Kate Terry in 1867.Gielgud, p. 5; and \"Arthur James Lewis, 1824-1901\", The Correspondence of James McNeill Whistler, University of Glasgow, accessed 15 June 2013 The Minstrels would discuss the arts, smoke and sing part-songs and other popular music at monthly gatherings of more than 150 lovers of the arts; their conductor was John Foster. Foster, as well as the dramatist F. C. Burnand and many other members were friendly with young Arthur Sullivan, who joined the group.Walker, Raymond. \"The Original Cox and Box\", The Gilbert & Sullivan News, vol. II, no. 13, Autumn–Winter 1998; pp. 13–15 On one occasion in early 1865, they heard a performance of Offenbach's short two-man operetta Les deux aveugles (\"The Two Blind Men\").\"Leisure Hours of the Art World\". The Musical World, p. 174, 25 March 1865 After seeing another operetta at Moray Lodge the following winter, Burnand asked Sullivan to collaborate on a new piece to be performed for the Minstrels.Armstrong, pp. 20–21"]}, {"page": "John Lawrence Toole", "response": ["*F. C. Burnand's Stage Dora; or, Who Killed Cock Robin (1883), a burlesque of Sardou's Fédora, starring Toole"]}, {"page": "John Maddison Morton", "response": ["Morton lived in Chertsey for many years.Chertsey, Surrey, Literature Reference, accessed 17 January 20111865,  Newspaper Detectives, accessed 17 January 2011 It was there that he wrote Box and Cox (1847), which The New York Times in 1891 called \"the best farce of the nineteenth century\".\"Obituary: The Author of 'Box and Cox'\", The New York Times, 22 December 1891 Box and Cox, was wildly successful, earning him about £7000, and was translated into many European languages. A musical version, Cox and Box (1867), was created by F. C. Burnand and Arthur Sullivan, but Morton received no royalties from it. However, it brought him a measure of fame as it is often revived by Gilbert and Sullivan fans, helping to make it his best known work."]}, {"page": "Harry Greenbank", "response": ["Greenbank first placed one of his works, Captain Billy, at the Savoy Theatre, set to music by the company's musical director François Cellier.  The piece was staged as a curtain-raiser to The Nautch Girl beginning in 1891.  He continued to write such small-scale pieces over the following couple of years, both for the Savoy (Mr. Jericho in 1893 and Old Sarah in 1897) and for the Lyric Theatre, where Horace Sedger asked him to supply the English lyrics to F. C. Burnand's adaptation of the French operetta Le coeur et la main (Incognita).thumb|Cover of the Vocal Score"]}, {"page": "Beefsteak Club", "response": ["The Beefsteak became an essential after-theatre club for such men as the dramatists F. C. Burnand and W. S. Gilbert, performers Corney Grain, J. L. Toole, John Hare, Henry Irving and W. H. Kendal, and theatre managers and writers Henry Labouchère and Bram Stoker, and their peers. Restaurant critic Nathaniel Newnham-Davis was also a member around the turn of the 20th century. The club moved to Green Street, in Mayfair, and, in 1896, to its present address. There were 250 members, some of whom occasionally performed amateur plays for their own amusement and to raise funds for charities. For example, in 1878, they performed The Forty Thieves, written by members Robert Reece, Gilbert, Burnand, and Henry J. Byron. In 1879 there was a much-reported court case following a fracas on the doorstep of the club between Labouchère and Edward Levy-Lawson, proprietor of The Daily Telegraph. The committee of the club expelled Labouchère, who successfully sought a court ruling that they had no right to do so.\"High Court of Justice, Nov. 28, Chancery Division\", The Times, 29 November 1879, p. 4"]}, {"page": "Hermann Vezin", "response": ["Apart from a brief professional tour of the United States in 1857–58, the majority of Vezin's acting career took place on the English stage.  Though primarily an actor, in 1866 he collaborated with the playwrights W. G. Wills and James Albery to write the vaudeville inspired play Doctor Davey based on the 1842 play Le Docteur Robin by French writer Jules de Prémaray in which he also played the title role. The following year he starred as a troubled Scottish poet James Harebell in Wills' Man o' Airlie (1867) to overwhelmingly positive reviews. Vezin followed up with other successful showings, such as The Turn of the Tide by F. C. Burnand (1869), Son of the Soil (1872); As You Like It (1875); and W. S. Gilbert's Dan'l Druce, Blacksmith, which ran for one hundred and nineteen performances at the Haymarket Theatre (1876, also a revival in 1884); pp. 141–2 He acted with Charles Fechter, Samuel Phelps, Henry Irving, and in 1878 played Dr. Primrose alongside actress Ellen Terry in Wills' Olivia, Vicar of Wakefield (1878),* a highly successful adaptation of Oliver Goldsmith's novel, The Vicar of Wakefield (1766)."]}, {"page": "Lucy Isabella Buckstone", "response": ["In December 1882 Buckstone joined Genevieve Ward at the Olympic Theatre playing Alice in the Merivale and Grove drama, Forget-Me-Not, and the following year she played Abigail Hill in The Queen’s Favorite by Sydney Grundy, followed by Gladys Grant in Rachel, Lucy Bertram in Guy Mannering and Bertha de Mottrville in A Great Catch. In 1884 Buckstone played Edith Marsland at the Prince Theatre in Charles Hawtrey's The Private Secretary, and the following year, she was Blanche Denham in The Denhams, adapted from The Crisis by Thomas Holcroft. In February 1891 at the Globe Theatre she was Gwendolen Pettigrew in the George William Godfrey comedy The Parvenu, and that July at the Criterion Theatre, she was Flora in Miss Decima, by F. C. Burnand, from the French.The Theatre, 2 June 1884, p. 322. Retrieved 29 July 2013Adams, William Davenport.   Dictionary of the Drama, (The Crisis), 1904, p. 355. Retrieved 28 July 2013Godfrey, George William.   \"The Pavenu; an Original Comedy in three Acts\". Retrieved 28 July 2013"]}, {"page": "German Reed Entertainments", "response": ["The entertainments were held at the intimate Royal Gallery of Illustration, Lower Regent Street, and later at St. George's Hall, Langham Place, in London.  Thomas and Priscilla German Reed usually appeared in them, together with a small group of players.  They engaged talented newcomers, such as Frederic Clay, W. S. Gilbert and Arthur Law, as well as established writers such as F. C. Burnand, to create many of the entertainments.  Thomas German Reed composed the music for many of the entertainments himself.", "The Gallery was an intimate 500-seat theatre.  The accompaniment consisted of piano at first, and later also a harmonium and sometimes a harp.  At first, the entertainments utilized a cast of three; but by the mid-1860s, they had expanded to pieces with a cast of four.  Often the pieces' plots involved mistaken identities and disguises.  From 1860 to 1868, the German Reeds were assisted by John Orlando Parry, a pianist, mimic, parodist and humorous singer (one of George Grossmith's inspirations).The Times obituary of George Grossmith, 2 March 1912  He created a new type of musical and dramatic monologue that became popular.  The earliest entertainments included Holly Lodge and The Enraged Musicians (1855); William Brough's A Month from Home and My Unfinished Opera (1857); The Pyramid by Shirley Brooks (1864); The Peculiar Family by Brough (1865); The Yachting Cruise by F. C. Burnand (1866); Our Quiet Chateau by Robert Reece (1867); and Inquire Within by Burnand (1868).", "The dramatist W. S. Gilbert wrote the librettos for six entertainments presented by the German Reeds from 1869 to 1875, some of them with music by Reed himself, including No Cards, Ages Ago, Our Island Home, A Sensation Novel, Happy Arcadia, and Eyes and No Eyes.  Several of these pieces had ideas in embryonic form that would later re-appear in the Savoy Operas. Ages Ago, for instance, had a gallery of portraits that come to life, an idea re-used in Ruddigore.  Mrs. German Reed's performances inspired Gilbert to create some of his famous contralto roles.  German Reed also mounted the first professional production of Arthur Sullivan and F. C. Burnand's Cox and Box and commissioned a second opera from the pair, The Contrabandista.  Given the German Reeds' role in both Gilbert's and Sullivan's first operatic successes, one wag commented that the Gilbert and Sullivan operas were \"cradled among the Reeds.\"Smith, J. Donald. \"W. S. Gilbert's Operas for the German Reeds\", Gilbert and Sullivan Discography, 7 November 2001, accessed 7 February 2017"]}, {"page": "F.C. Burnand", "response": ["#REDIRECT F. C. Burnand"]}, {"page": "The Beauty Stone", "response": ["When the Gilbert and Sullivan partnership collapsed after the production of The Gondoliers in 1889, their producer Richard D'Oyly Carte struggled to find successful new works to show at the Savoy Theatre.  Carte produced Sullivan's grand opera, Ivanhoe at another theatre, and afterwards, he turned to Sullivan to create more comic operas for the Savoy.  With Sydney Grundy, Sullivan wrote the nostalgic and sentimental Haddon Hall (1892) then, reunited with W. S. Gilbert, he produced Utopia, Limited (1893).  He next returned, with his earlier collaborator F. C. Burnand, with The Chieftain (1894) and collaborated for the last time with Gilbert on The Grand Duke (1896).  None of these had proved to be more than modestly successful, and Carte's other new pieces for the Savoy in the 1890s had done no better.  Following the success of Sullivan's ballet Victoria and Merrie England in 1897, Carte asked Sullivan to work on another new opera for the Savoy.Coles, Clifton. Notes on the text of The Beauty Stone, The Gilbert & Sullivan Archive, accessed 5 October 2011"]}]}}