{"wiki_id": "http://www.wikidata.org/entity/Q5218579", "itemLabel": "Daniel Rigby", "itemDescription": "English television actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Rigby", "wikipedia_page": {"main": "Daniel Rigby (born 6 December 1982) is an English actor and comedian. He received a BAFTA TV Award for his leading role as Eric Morecambe in the 2011 television film Eric and Ernie.", "link_mentions": [{"page": "List of comedians", "response": ["* Daniel Rigby (born 1982)"]}, {"page": "Victoria Wood", "response": ["A memorial service was held for Wood on 4 July 2016 at St James, Piccadilly. The event was accessible via invitation only and tributes were given by Jane Wymark, Daniel Rigby, Harriet Thorpe and Julie Walters. Ria Jones and Michael Ball each performed one of Wood's songs and Nigel Lilley accompanied on the piano.", "In 2017, Wood was the subject of a seven-part show dedicated mainly to extracts from her TV and live work. The main series, titled Our Friend Victoria, aired on BBC One between 11 April and 9 May and concluded later in the year with a Christmas special on 23 December 2017. The seven episodes were presented by Julie Walters, Richard E. Grant, Michael Ball, Maxine Peake, The League of Gentlemen, Daniel Rigby and Anne Reid."]}, {"page": "Jim Broadbent", "response": ["In 2015, Broadbent along with Daniel Rigby, Antonia Thomas, Fearne Cotton and Jane Horrocks are revealed to be the new cast with Broadbent as a Voice Trumpet in the reboot of classic British children's television series Teletubbies. Since 2016, Broadbent narrates Kevin the Carrot Christmas adverts for the UK branch of Aldi. In the 2020 advert, Broadbent portrayed Santa Claus, who was revealed to be the narrator."]}, {"page": "David Walliams", "response": ["In 2017, Walliams, along with Rochelle Humes, were both confirmed as Voice Trumpets, joining the existing cast of Daniel Rigby, Antonia Thomas, Jim Broadbent, Fearne Cotton and Jane Horrocks In series 2 of the reboot of classic British children's television series Teletubbies."]}, {"page": "Royal Exchange, Manchester", "response": ["* Breaking the Code by Hugh Whitemore (Manchester Theatre Award). Directed by Robert Hastie with Daniel Rigby (Manchester Theatre Award),Natalie Dew(Manchester Theatre Award) Phil Cheadle, Dmitri Gripari and Geraldine Alexander (2016)"]}, {"page": "Cheadle Hulme School", "response": ["* Daniel Rigby actor and comedian, BAFTA award winner"]}, {"page": "Eric and Ernie", "response": ["* Daniel Rigby as Eric Morecambe", "Daniel Rigby won the BAFTA TV Award for Best Actor at the 2011 BAFTAs for his performance as Eric Morecambe."]}]}}