{"wiki_id": "http://www.wikidata.org/entity/Q5228208", "itemLabel": "Dave Adams", "itemDescription": "British musician and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Adams_(musician)", "wikipedia_page": {"main": "David Malcolm Adams (27 November 1938 – 19 March 2016) was a British singer, keyboard player and songwriter.\nBorn in Jersey, he began working with Joe Meek in 1958 and continued to work with him until Meek's death in 1967. In the early 1960s, he helped build up Meek's studio. He recorded singles with him under various pseudonyms and wrote songs for him. He was part of the production of Telstar; a \"second stage demo\" of him playing the tune exists. He was also a member of Heinz Burt's backing band The Wild Boys along with Ritchie Blackmore.He later lived in Buffalo, New York. His daughter, Dee Adams writes and performs music as a solo artist, with a country-rock band called Dee and the Housecats, and with a jazz band called The Funny Valentines.", "link_mentions": [{"page": "Joe Meek", "response": ["Meek's inability to play a musical instrument or write notation did not prevent him writing and producing successful commercial recordings. For songwriting, he was reliant on musicians such as Dave Adams, Geoff Goddard or Charles Blackwell to transcribe melodies from his vocal \"demos\". He worked on 245 singles, 45 of which reached the top fifty. He pioneered studio tools such as multiple over-dubbing on one- and two-track machines, close miking, direct input of bass guitars, the compressor, and effects like echo and reverb, as well as sampling. Unlike other producers, his search was for the 'right' sound rather than for a catchy musical tune, and throughout his brief career he single-mindedly followed his quest to create a unique \"sonic signature\" for every record he produced."]}, {"page": "Telstar (instrumental)", "response": ["*Dave Adams – transcription of Meek's composition recording"]}, {"page": "Ritchie Blackmore", "response": ["*1963 Dave Adams – \"Like A Bird Without Feathers\" (the B-side of single)", "*1963 Dave Adams – \"You Made Me Cry\" (the B-side of single)", "*1963 Dave Adams – \"It Feels Funny, It Feels Good\"; \"You Just Can't Do It on Your Own\"; \"Clean, Clean, Clean\"; \"The Birds and the Bees\"; \"Don't Put All Your Eggs in One Basket\"; \"Oh What A Party\"; \"Let Me In\"; \"They're All Up To It\"; \"Signs And Posters\"; \"Out Behind The Barn\"; \"There's Something at the Bottom of the Garden\"; \"The Bathroom\""]}, {"page": "David Adams", "response": ["* Dave Adams (naval officer), officer in the US Navy", "* Dave Adams (Canadian football) (1920–2011), Canadian football guard", "* Dave Adams (musician) (1938–2016), British musician from Saint Helier, Jersey"]}, {"page": "Adams (surname)", "response": ["*Dave Adams (1938–2016), English musician and songwriter"]}, {"page": "A Life in the Death of Joe Meek", "response": ["*Dave Adams"]}, {"page": "List of people from Jersey", "response": ["*Dave Adams, musician (1938–2016)"]}]}}