{"wiki_id": "http://www.wikidata.org/entity/Q5220258", "itemLabel": "Danny Cullip", "itemDescription": "English footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Cullip", "wikipedia_page": {"main": "Danny Cullip (born 17 September 1976) is an English former professional footballer. Cullip, a centre-back, made more than 350 appearances in the Football League, including more than 200 appearances for Brighton & Hove Albion.\n\n", "link_mentions": [{"page": "Dennis Bergkamp", "response": ["Bergkamp started in 29 league matches in the 2004–05 season, but Arsenal's title defence ended unsuccessfully. The team finished second, 12 points behind Chelsea. At home against Middlesbrough on 22 August 2004, Bergkamp acted as captain for the injured Vieira in a match where Arsenal came back from 1–3 down to win 5–3 and equal Nottingham Forest's record of 42 league matches undefeated. Against Sheffield United in the FA Cup on 19 February 2005, Bergkamp was shown a straight red card by referee Neale Barry for shoving defender Danny Cullip. His appeal of the decision was rejected by The Football Association (FA), meaning he missed the club's next three domestic games. In Arsenal's final home match of the season, against Everton, Bergkamp had a man of the match game, scoring once and assisting three of the goals in a 7–0 win. Bergkamp was moved by Arsenal supporters chanting \"one more year\", describing it as \"quite special\". \"They obviously feel there is another year left in me, so that's great as it shows they're really behind me,\" he said. Following Arsenal's penalty shootout victory over Manchester United in the 2005 FA Cup Final, he signed a one-year contract extension."]}, {"page": "Danny Webber", "response": ["Webber initially joined Sheffield United on loan in March 2005 with Danny Cullip moving in the opposite direction. He scored after 93 seconds on his debut in a 4–0 away win over rivals Leeds United, and four days later, scored two goals against Queens Park Rangers. At the end of the 2004–05 season, he signed a permanent three-year contract with Sheffield United for a transfer fee of £500,000."]}, {"page": "Adam Bolder", "response": ["In January 2007 Bolder signed a two-and-a-half-year-long contract for Queens Park Rangers, where he was reunited with his former boss, John Gregory. QPR were struggling at the time, and there was a lack of grit and determination within the team. Bolder came in, and added steel to the midfield, with some good tackling performances and an excellent range of passing. Combined with the signings of Danny Cullip and Lee Camp (on loan), Bolder helped QPR to avoid relegation, quite comfortably in the end and was named as club captain. On 27 October 2007, Bolder scored his first goal for Queens Park Rangers in a 1–0 win over Charlton Athletic at The Valley which lifted QPR off the bottom of the table. On 8 February 2008, it was announced that Bolder would be joining fellow Championship side Sheffield Wednesday on a month's loan, which was later extended to the end of the 2007–08 season. On 8 April 2008 Bolder scored his first goals in an Owls shirt, netting twice in the Steel City Derby against Sheffield United in a 2–2 draw."]}, {"page": "Andy Crosby", "response": ["Crosby was sold on to Brighton & Hove Albion for a fee of £10,000 in July 1999. He recovered from a \"mysterious illness\" that kept him in hospital for two nights in September 1999; it turned out to be caused by a virus in his left ear. He went on to make 41 appearances across the 1999–2000 campaign. He formed a strong centre-back partnership with Danny Cullip during the 2000–01 season as Brighton won promotion out of the Third Division as champions; he scored two goals in 39 games, including one goal scored with his ear against Blackpool. He had a \"clear the air meeting\" with manager Micky Adams in September 2001 after being dropped for Matt Wicks. Following the meeting he was transfer-listed at his own request after finding his first-team chances at the Withdean Stadium limited."]}, {"page": "West London derby", "response": ["* Danny Cullip – first Fulham, then Brentford."]}, {"page": "2005 FA Cup Final", "response": ["Arsenal's opponent in the fifth round was Sheffield United. After 35 minutes Dennis Bergkamp was sent off for his apparent push on Danny Cullip. With eleven minutes of normal time remaining, Robert Pires scored for Arsenal, but the team conceded a late penalty which Andy Gray converted. The equaliser for Sheffield United meant the match was replayed at Bramall Lane on 1 March 2005. Both teams played out a goalless draw after full-time and throughout extra-time, so the tie was decided by a penalty shootout. Arsenal goalkeeper Manuel Almunia saved two penalties, which ensured progress into the quarter-finals."]}, {"page": "Patrick Kanyuka", "response": ["Born in Kinshasa, Kanyuka started his career with Leyton Orient as a youth player in 2003 before joining Queens Park Rangers the following year. Source Neilson N. Kaufman - historian Leyton Orient FC . Queens Park Rangers after signing a professional contract on 19 July 2004. His early career was plagued by injuries, but towards the end of the 2005–06 season he held down a regular place in John Gregory's side due to an injury to Danny Cullip."]}, {"page": "Damion Stewart", "response": ["Bradford manager Colin Todd had hoped to keep Stewart on, but his form earned him a six-figure transfer to Championship side Queens Park Rangers. After a shaky start to life in the Championship, Stewart hit form after the arrival of Danny Cullip from Nottingham Forest. He soon cemented his place in the Queens Park Rangers side and played more than 80 games in the 2006–07 and 2007–08 seasons. In the 2007–08 season, Stewart scored five goals, but was also sent off twice. He memorably scored the only goal as QPR knocked Aston Villa out of the 2008–09 League Cup with a 1–0 victory at Villa Park.Archived at Ghostarchive and the Wayback Machine: "]}]}}