{"wiki_id": "http://www.wikidata.org/entity/Q5220449", "itemLabel": "Danny Hollands", "itemDescription": "English footballer (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Hollands", "wikipedia_page": {"main": "Daniel Timothy Hollands (born 6 November 1985) is an English professional footballer who plays as a midfielder for Eastleigh.", "link_mentions": [{"page": "Paolo Di Canio", "response": ["In January 2013, with Swindon under a transfer embargo and in financial difficulty, Di Canio offered to pay £30,000 of his own money to keep loan players John Bostock, Chris Martin and Danny Hollands at the club."]}, {"page": "Chris Powell", "response": ["Powell signed 19 new players in summer 2011, including midfielders Danny Green, Danny Hollands, Dale Stephens, defenders Matt Taylor, Rhoys Wiggins and goalkeeper Ben Hamer. Bradley Pritchard was signed from non-league Hayes & Yeading United Football Club and has excelled in midfield, with Yann Kermorgant forming a formidable strike partnership alongside Wright-Phillips. Captain Johnnie Jackson has been a talisman all season despite numerous injuries, and Chris Solly, a product of the youth academy has made the right back berth his own. Clever loan signings were made throughout the season including Hogan Ephraim, Darel Russell, Dany N'Guessan and the return of Lee Cook. Charlton finished strongly into the second half of the 2011–12 season and sealed promotion back to the Championship as champions of League One. Charlton finished the 2012–13 season in 9th place, ending with a 4–1 victory over already relegated Bristol City and three points off a play-off position."]}, {"page": "Eastleigh F.C.", "response": ["In October 2018, following 4 victories manager Andy Hessenthaler left to join Dover Athletic. Ben Strevens was appointed as the new manager. Some good form in early 2019 contributed to Eastleigh finishing the season 7th and in the playoffs. Eastleigh faced a tie at Wrexham and won 1–0 in extra time through a superb Danny Hollands strike. In the semi-final, Eastleigh travelled to Salford. The game finished 1–1 after 120 minutes. Eastleigh led early in the penalty shoot out but eventually lost 4–3 after Chris Zebroski missed the decisive penalty."]}, {"page": "Hollands", "response": ["* Danny Hollands (born 1985), English footballer"]}, {"page": "Rhoys Wiggins", "response": ["Despite Watford's continuing interest, it was League One club Charlton Athletic who agreed an undisclosed fee with Bournemouth. Wiggins signed a three-year contract on 30 June 2011, and made his debut in the starting eleven for a 3–0 opening-day win against his former club Bournemouth. He established himself in the left-back position ahead of fellow newcomer Cedric Evina. On 17 September, Wiggins scored his first goal for the club in the away win against Rochdale. He was nominated for League One Player of the Month award for October but lost out to Huddersfield Town's Jordan Rhodes. Wiggins set up two goals for Bradley Wright-Phillips in a 4–0 win over Hartlepool United on 29 October and one for Danny Hollands in a win over Preston North End a week later. He then helped the team's defence keep five clean sheets during January 2012, and maintained his contribution to the team's defensive strength with a run of six clean sheets from mid-March to mid-April 2012, the last of which, a 1–0 win away to Carlisle United, confirmed Charlton's promotion to the Championship. They went on to finish as League One champions, and Wiggins was one of four Charlton players named in the PFA League One Team of the Year. He missed just one matchrested for the penultimate fixture of the season once the title was securedso made 47 appearances in all competitions."]}, {"page": "Jason Pearce", "response": ["On 9 August 2007, Pearce joined AFC Bournemouth on a two-year contract. He helped get Bournemouth promoted to League One from League Two during the 2009–10 season. On 4 January 2010, Pearce replaced Danny Hollands as first team captain, in a new-look structure that saw veteran striker Steve Fletcher become club captain."]}, {"page": "Harry Arter", "response": ["The sales of Danny Hollands and Anton Robinson during the 2011 summer transfer window allowed Arter to gain increased first team experience with Bournemouth. On 13 August 2011, Arter replaced Mark Molesley in the 66th minute of a match against Sheffield Wednesday at Dean Court, and 17 minutes later confirmed a 2–0 win with his first goal for the club. going on to score in his two following appearances, a 3–1 defeat to Stevenage and a 2–1 victory over his former team Carlisle. His performances attracted the attention of several Championship clubs and Bournemouth rejected enquiries from two clubs, before handing him an improved contract."]}, {"page": "Felpham Community College", "response": ["*Danny Hollands, footballer"]}, {"page": "2010–11 Plymouth Argyle F.C. season", "response": ["Midfielder Craig Noone joined Brighton & Hove Albion for an undisclosed fee. Lee Molyneux and Jordan Trott were released after being told that their contracts weren't being renewed. The club's first match of the new year ended in a 0–0 draw with Yeovil Town, which was the first ever league meeting between the two clubs.\"Plymouth 0–0 Yeovil\". BBC Sport. 1 January 2011. Retrieved 19 January 2011. Defender Réda Johnson was transferred to Sheffield Wednesday for an undisclosed fee. Will Hoskins gave Bristol Rovers a two-goal lead in Argyle's next game before they responded through Bradley Wright-Phillips, Joe Mason and Stéphane Zubar to claim a 3–2 win.\"Bristol Rovers 2–3 Plymouth\". BBC Sport. 4 January 2011. Retrieved 19 January 2011. Peter Ridsdale confirmed that the tax debt which led to the club being presented with a winding-up petition had been paid.\"Plymouth Argyle clear initial tax bill\". BBC Sport. 6 January 2011. Retrieved 19 January 2011. A 3–0 defeat by Bournemouth followed, who scored goals either side of half time through Danny Hollands, Liam Feeney and Marc Pugh.\"Bournemouth 3–0 Plymouth\". BBC Sport. 8 January 2011. Retrieved 19 January 2011. The loan deal for Sean Kinsella with Stafford Rangers was extended until the end of April. The club had two players sent off for the second time this season as they were defeated 3–2 at Huddersfield Town. Defenders Curtis Nelson and Stéphane Zubar were dismissed in a match which saw Argyle take a two-goal lead thanks to Joe Mason. The home side scored three before half time thanks to an own goal from Kári Árnason, Jordan Rhodes and Peter Clarke.\"Huddersfield 3–2 Plymouth\". BBC Sport. 11 January 2011. Retrieved 19 January 2011."]}, {"page": "2009–10 AFC Bournemouth season", "response": ["|align=\"left\"|14||align=\"left\"|MF||align=\"left\"| Danny Hollands"]}, {"page": "2011–12 Charlton Athletic F.C. season", "response": ["|4||MF||||22||Danny Hollands||7||1||0||0||8", "|Danny Hollands", "| Danny Hollands"]}, {"page": "2011–12 AFC Bournemouth season", "response": ["| Danny Hollands"]}, {"page": "2012–13 Swindon Town F.C. season", "response": ["| Danny Hollands || 2 || 0 || 0 || 0 || 2", "| Danny Hollands || 2 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 0", "| Danny Hollands"]}, {"page": "2012–13 Charlton Athletic F.C. season", "response": ["| Danny Hollands", "| Danny Hollands"]}, {"page": "George Ray (footballer, born 1993)", "response": ["In March 2017, Ray revealed that he had considered leaving Crewe, declaring \"the first six months (of the current season) were the worst times of my career,\" but was now playing for a new contract under Crewe's new manager. David Artell had replaced Steve Davis in January 2017 and he recalled Ray to the first team and then made him team captain following an injury to Danny Hollands in February 2017. On 9 May 2017, Crewe announced that Ray had been offered a new contract by the club,Crewe Alexandra Retained List 2017, CreweAlex.net. Retrieved 9 May 2017. and in June 2017 he signed a two-year deal running to June 2019."]}, {"page": "2013–14 Portsmouth F.C. season", "response": ["| Danny Hollands", "| 2 || MF ||  || 29 || Danny Hollands || 6 || 0 || 0 || 0 || 6", "| 29 ||  || MF || Danny Hollands || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0"]}, {"page": "2013–14 Charlton Athletic F.C. season", "response": ["|Danny Hollands", "| Danny Hollands", "| Danny Hollands"]}]}}