{"wiki_id": "http://www.wikidata.org/entity/Q5228496", "itemLabel": "Dave Carroll", "itemDescription": "Scottish footballer (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Carroll", "wikipedia_page": {"main": "David Francis Carroll (born 20 September 1966 in Paisley, Scotland) is a former footballer who spent 14 seasons at Wycombe Wanderers. An attacking midfielder, Carroll played more than 600 first-team games for Wycombe in all competitions, and scored exactly 100 goals. He was nicknamed \"Jesus\" by the Wycombe supporters.Carroll joined Wycombe, then a recently promoted Conference side, in the summer of 1988, having previously played for Ruislip Manor of the Isthmian League. He went on to become a key member of the Wycombe side that won promotion to Football League in 1993. The following season, Wycombe won a second successive promotion as Carroll scored twice in Wycombe's 4-2 victory against Preston in the playoff final at Wembley.In November 1997, Carroll was rewarded for his long service to the Chairboys with a  testimonial match against Leicester City. Near the end of his career at Adams Park, no longer a first-team regular, Carroll played the final ten minutes of Wycombe's famous FA Cup semi-final against Liverpool in 2001.\nIn March 2002, Carroll left Wycombe on a free transfer to join Aldershot Town. He spent eight months at Aldershot, and finished his career at Windsor & Eton.\nDave Carroll now works as Manager for Space Station plc.", "link_mentions": [{"page": "Timmins", "response": ["* Dave Carroll and Don Carroll, country/pop/folk band Sons of Maxwell"]}, {"page": "London Rangers F.C.", "response": ["* Dave Carroll"]}, {"page": "List of Wycombe Wanderers F.C. players", "response": ["| Dave Carroll"]}, {"page": "1999–2000 Wycombe Wanderers F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Dave Carroll"]}, {"page": "Lloyd Johnson (businessman)", "response": ["Johnson and his wife have revived the La Rocka! label as La Rocka 79 with street-fashion entrepreneur Dave Carroll."]}, {"page": "1994 Football League Third Division play-off Final", "response": ["The referee for the match, played in front of 40,109 spectators, was Keith Cooper.  Wycombe dominated the first half but in the 32nd minute, Preston took the lead through Ian Bryson with a overhead kick which beat Paul Hyde in the Wycombe goal.  Wycombe equalised straight from the subsequent kick-off with Steve Thompson's shot being put into the net by Jamie Squires for an own goal.  In the 37th minute, Preston took the lead once more, with Paul Raynor's diving header; the half ended 2–1.  Wycombe drew level two minutes into the second with a goal from Simon Garner.  Ten minutes later, a four-man play from Wycombe concluded with Steve Guppy's cross being passed by Garner to Dave Carroll who scored at the far post to make it 3–2.  Fifteen minutes later Carroll scored his second after beating David Moyes  out from goal, making it 4–2.  No further goals were scored and Wycombe were promoted to the Second Division at their first attempt.", "Wycombe Wanderers faced Carlisle United in the second semi-final; the first leg took place at Brunton Park in Carlisle on 15 May 1994.  The visitors took the lead in the 33rd minute:  David Titterton played a one-two with Steve Guppy before striking a low cross to Simon Garner, whose shot was blocked by Tony Gallimore, but the ball fell to Steve Thompson, who scored from close range.  Carlisle dominated the second half but were caught in the 86th minute by Garner on the break who made it 2–0, the final score.  The second leg of the semi-final was played three days later at Adams Park in High Wycombe.  The home side took an early lead with Dave Carroll heading in a Guppy cross in the eleventh minute.  Garner then doubled the lead in the 57th minute after wrong-footing Tony Caig in the Carlisle goal.  With ten minutes remaining, Rod Thomas was brought down in the penalty area and awarded a penalty.  Simon Davey scored from the spot to make it 2–1, but Wycombe progressed to the final with a 4–1 aggregate win.", "|CM || 7 ||Dave Carroll "]}]}}