{"wiki_id": "http://www.wikidata.org/entity/Q5229699", "itemLabel": "Dave Roberts", "itemDescription": "English television executive and sports commentator (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Roberts_(sports_broadcaster)", "wikipedia_page": {"main": "Dave Roberts (full name David Robert Roberts; born 31 July 1964 in Middlesbrough, England) is a UK-based former TV executive and ex-presenter and commentator specialising in association football. He previously worked for Fox Sports News and ESPN Star Sports in Singapore, ESPN in the USA and Sky Sports in the UK as well as a host of UK radio stations. As well as his broadcast work, he is a fully qualified International football referee. He owns and operates his own UK based broadcast production company X-Cel Broadcast Limited. Roberts was also the BBC commentator on West Indian cricketer Brian Lara's world record breaking innings of 501 not out. He now provides coach travel for Middlesbrough’s away matches.", "link_mentions": [{"page": "Middlesbrough F.C.", "response": ["Middlesbrough was the first football club in the world to launch its own TV channel – Boro TV. The first broadcasts were tied to the club's first ever major cup final appearance in 1997, a full year ahead of Manchester United's MUTV, which still claims to be the first in the world. The channel was the brainchild of then NTL marketing director, Peter Wilcock. The programme became synonymous with former Middlesbrough star Bernie Slaven and radio commentator Alastair Brownlee who proved to be as popular on TV as they were on radio. Its programmes were not live initially but were pre-recorded and hosted by local radio/TV broadcaster & Boro fan, Dave Roberts. Boro TV went on to claim another first when in August 2001 it became the first English football club to broadcast time-delayed full-match footage of their league games on its own channel. Boro TV ran through NTL cable television until July 2005. The club now shows match highlights through a subscription-based scheme on its official website."]}, {"page": "Talksport", "response": ["Talk Radio made its first foray into the world of sports radio rights bidding by purchasing from BBC Radio 5 Live the rights to broadcast the Football League for the 1997–98 season. In addition, the station broadcast its first FIFA World Cup from France in 1998, bringing in the Sky Sports commentary team of Alan Parry and Andy Gray to commentate on the major matches. Dave Roberts covered additional games in France. Talk Radio also acquired up the rights to broadcast Manchester United's matches in the Champions League for the 1998–99 season.", "On 12 November 1998, TalkCo Holdings – whose chairman and chief executive was Kelvin MacKenzie, former editor of The Sun – purchased Talk Radio. This led to a mass clearout of presenters including Nick Abbot, Anna Raeburn, Tommy Boyd and Peter Deeley, the new owner putting in place a more sports-oriented programming schedule—including The Sportszone with Alan Parry, Gary Newbon, Tony Lockwood, Tom Watt, and former Century Radio sports editor Dave Roberts presenting the weekend edition of The Sports Breakfast."]}, {"page": "Heart North East", "response": ["The station has previously broadcast extensively on football, a passion in the north east, and had a particularly close relationship with both Newcastle United and Middlesbrough. The station began its association with the game with the 1994 launch of 'The Big Mal Football Phone-In' hosted by Teesside presenter and Boro fan Dave Roberts and flamboyant ex-manager Malcolm Allison. The station then signed an exclusive radio rights deal with Middlesbrough FC with Roberts and Allison joined by local BBC broadcaster Ali Brownlee and the resultant 'Roberts & Brownlee Show' was born – a radio show biased in its commentary style towards Middlesbrough, so much so that Roberts was attacked in his commentary position by a disgruntled Newcastle fan at half time during a Tyne Tees derby at St James's Park.", "*Dave Roberts "]}, {"page": "Juninho Paulista", "response": ["In October 1995, Juninho signed for English club Middlesbrough for £4.75 million, just months after they had been promoted to the English top-flight FA Premier League. Then aged 22, Juninho had been tracked by numerous European top clubs, and it was a major surprise when he signed for \"the Teessiders\". Juninho became known as TLF (The Little Fella) by Boro fans, after local radio broadcaster Dave Roberts nicknamed the player on his football talk show. The nickname alludes to his height: only . During his time with Middlesbrough, Juninho lived in Levendale and Ingleby Barwick with his parents. He was known for playing football with school children on the streets and is still considered one of the greatest players to have played for Middlesbrough in the modern era."]}, {"page": "David Roberts", "response": ["David or Dave Roberts may refer to:", "* Dave Roberts (musician), English musician", "* Dave Roberts (American actor), American actor", "* Dave Roberts (broadcaster) (David Thomas Boreanaz, born 1936), American television personality", "* Dave Roberts (EastEnders), a fictional character in the British television series EastEnders", "* Dave Roberts (outfielder) (born 1972), American baseball manager and former player", "* Dave Roberts (first baseman) (1933-2021), Panamanian former baseball player", "* Dave Roberts (pitcher) (1944–2009), American baseball player", "* Dave Roberts (third baseman) (born 1951), American former baseball player", "* Dave Roberts (American football) (born 1947), US college football coach", "* Dave Roberts (sports broadcaster) (born 1964), TV and radio sports broadcaster and football referee", "* Dave Roberts (English footballer) (fl. 1923–1926), English centre forward", "* Dave Roberts (Welsh footballer) (born 1949), played for Fulham, Oxford United, Hull City, and Cardiff City", "* Dave Roberts (California politician) (born 1960), politician in San Diego County, California"]}, {"page": "List of British football commentators", "response": ["|Dave Roberts"]}, {"page": "PressPass", "response": ["Former presenters of the program include Derek Rae, Dave Roberts and Alison Bender.Real Madrid TV  Football Barbie, March 29, 2010Press Pass - World Cup Breakdown: USA vs England Preview  ESPN, June 10, 2010"]}, {"page": "Robbie Mustoe", "response": ["Mustoe moved to the USA after retiring from playing where he worked as a commentator/analyst for ESPN television for five years.    He was invited into ESPN by former Boro commentator Dave Roberts. where the two worked side by side in both the TV studio and conducting soccer commentaries. Mustoe also worked alongside Adrian Healey for ESPN's La Liga and UEFA Champions League coverage as well as working the 2010 FIFA World Cup in which he partnered with Healey and Derek Rae, and Euro 2012 where he worked with Healey. He also regularly appeared as a pundit on ESPN FC and made sporadic appearances for the network's Premier League coverage working in the studio."]}, {"page": "SportsCenter Asia", "response": ["SportsCenter Asia was officially launched on May 27, 2002, with Jason Dasey as its original anchor. It was recognised as the region's number one show of its kind by winning the 'Best Sports Program' category at the 2003 Asian Television Awards and received a commendation for 'Best News Program' at the 2005 Asian Television Awards. Other past anchors of the program include Uday Joshi, Bethan Evans, Cheryl Liew, David Basheer and Arnold Gay. Former CNBC Asia correspondent Colette Wong became a co-anchor in March 2004 with Steve Dawson joining in late 2004, employed initially as an assistant producer. Dez Corkhill was the original executive producer and sometimes appeared on the show as a football pundit. ESPN International football commentator Dave Roberts returned to Singapore in late 2011 to take over as Senior Executive Producer for SportsCenter and other news and production programs before leaving in early 2015."]}, {"page": "Dave Roberts (Sports Broadcaster/Referee)", "response": ["#REDIRECT Dave Roberts (sports broadcaster)"]}, {"page": "United Football League (Philippines)", "response": ["In cooperation with the Philippine Football Federation, the league directed its referees to undergo a training module to better their decision making and player management. The training was facilitated by Football Association of Singapore committee member Augustine Arlando, a former FIFA match official, and Football Association national referee tutor Dave Roberts."]}, {"page": "David Roberts (sports broadcaster)", "response": ["#REDIRECT Dave Roberts (sports broadcaster)"]}, {"page": "Dave Budd (politician)", "response": ["Mayor Budd won the election by 252 votes, beating hedge fund millionaire and philanthropist Andy Preston into second place. Other candidates included former radio and television presenter Dave Roberts and two former Labour Councillors running as independents."]}]}}