{"wiki_id": "http://www.wikidata.org/entity/Q5221910", "itemLabel": "Dar Lyon", "itemDescription": "English cricketer (1898-1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dar_Lyon", "wikipedia_page": {"main": "Malcolm Douglas Lyon (22 April 1898 – 17 February 1964), generally known as Dar Lyon was an English first-class cricketer who played for Somerset County Cricket Club through the 1920s.  He was a right-handed top order batsman known for his beautiful driving who occasionally captained and kept wicket for the county.\nHe also became a politician, barrister, and later a magistrate, colonial administrator and judge in various British colonies.  He was Chief Justice of the Seychelles from 1948 to 1957.", "link_mentions": [{"page": "Dar", "response": ["* Dar Lyon, an English first-class cricketer"]}, {"page": "List of British Jews", "response": ["* Dar Lyon, England, cricketer (brother of Bev)"]}, {"page": "Caterham", "response": ["The composer Mátyás Seiber lived at 169, Stafford Road from 1935 until his death in 1960. Television presenter Angus Deayton grew up in Caterham; he attended both Oakhyrst Grange and Caterham Schools. Notable sportspeople from Caterham include the footballers Nicky Forster and David Price and cricketer Dar Lyon, all of whom were born in the town. Actors Bill Nighy and Jon Finch were also born in Caterham; Michael Robbins, another actor, died there."]}, {"page": "List of Jews in sports", "response": ["* Dar Lyon, England, cricketer (brother of Bev)"]}, {"page": "Royal Field Artillery", "response": ["*Dar Lyon (1898–1964). first-class cricketer"]}, {"page": "List of Seychellois people", "response": ["* Dar Lyon - Chief Justice of the Seychelles, and first class cricketer"]}, {"page": "List of alumni of Trinity College, Cambridge", "response": ["* Geoffrey Hopley, cricketer* Dar Lyon (1898–1964), first class cricketer; Chief Justice of the Seychelles"]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Dar Lyon (1920–1938) 123 matches CA"]}, {"page": "List of Old Rugbeians", "response": ["* Dar Lyon, first class cricketer"]}, {"page": "Denys Hill", "response": ["He made his debut for the Army at Fenner's, in a drawn match against Cambridge University, at the end of May 1922; he claimed the solitary wicket of Cambridge wicket-keeper Dar Lyon. Two further Army appearances that summer produced one more wicket in each of his four bowling innings, while a single match for Free Foresters in 1923 brought him 2-65; he did not score more than 5 in any of his six visits to the crease during those two seasons."]}, {"page": "Frederick Baitup", "response": ["Baitup made a single first-class appearance for Somerset, during the 1924 season, against Derbyshire at Burton-upon-Trent. Playing as a tailender, Baitup picked up eleven runs in the only innings in which he batted, as Somerset picked up an innings victory thanks to a century and a double-century from Jack MacBryan and Dar Lyon respectively. Baitup bowled two overs in Derbyshire's first innings, including one maiden, conceding eight runs. He also took one catch."]}, {"page": "List of English people", "response": ["* Dar Lyon, cricketer"]}, {"page": "Malcolm Douglas Lyon", "response": ["#REDIRECT Dar Lyon"]}, {"page": "Malcolm Lyon", "response": ["* Dar Lyon (Malcolm Douglas Lyon, 1898–1964), English cricketer"]}, {"page": "Guy Earle", "response": ["Earle's only century for Somerset came in his first regular season, 1923. In the match against Gloucestershire at Bristol, he came to the wicket with Somerset at 331 for five, with Dar Lyon having already scored a century. Wisden, normally staid in its prose, reported that Earle was \"amazing\": he made 76 in \"just over half an hour\" to the close of play and then, when Somerset batted on into the second day, went on himself to finish with 111.", "Earle was married three times, his first two marriages ending in divorce. In 1918, he married Isabel Bridget Broughton-Knight, known as Bridget. They had a daughter, Audrey, in 1920, but divorced in 1922. He then married Helen Elliot in 1924, but they divorced in 1927. The next year she married Earle's Somerset cricket colleague Dar Lyon. Finally, he married Bridget Joan Sherston in 1935 and they had two daughters and a son between 1940 and 1945."]}, {"page": "Portal talk:Law/Nominate/Did you know", "response": ["*Dar Lyon"]}, {"page": "Lyon (surname)", "response": ["* Dar Lyon (1898–1964), English cricketer"]}, {"page": "James Jones (cricketer, born 1885)", "response": ["Jones was a left-handed lower- or middle-order batsman and a wicketkeeper. He appeared for Somerset in a single match in the 1922 season, and then became a regular player as a professional for the first two-thirds of the 1923 season, though he kept wicket only when amateur players, in particular Dar Lyon were not available. In addition to occasionally keeping wicket, Jones often made useful runs. In the match against Gloucestershire at Taunton he batted at No 7 and top-scored in the first innings with 70, which was his highest score for Somerset. He batted at No 3 in other matches and from there he made 50 in the match against Worcestershire at Kidderminster."]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Dar Lyon (1923–1930)"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* Dar Lyon (1927–1930) : M. D. Lyon (Somerset)"]}]}}