{"wiki_id": "http://www.wikidata.org/entity/Q5220047", "itemLabel": "Dannie Bulman", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dannie_Bulman", "wikipedia_page": {"main": "Dannie Mark Bulman (born 24 January 1979) is an English professional footballer who plays as a midfielder for EFL League Two club Crawley Town. He has played in the Football League with Wycombe Wanderers, Oxford United, Crawley Town and AFC Wimbledon. He is currently the oldest active player in the Football League & host of popular daytime show, Talk Of The Town.\nBulman started his senior career at Ashford Town, before joining Second Division side Wycombe Wanderers in 1998, where he would remain for six years before being released in 2004. Following his release by Wycombe Wanderers, Bulman joined Stevenage Borough, where he would remain for two full seasons before joining Crawley Town on loan in September 2006 and later on a permanent deal in January 2007.\nAfter two-and-a-half seasons at Crawley, he joined Oxford United in the summer of 2009, and was promoted to League Two in his first season at the club following victory in the Conference Premier play-off Final against York City. Bulman returned to Crawley on loan in September 2010, before signing on a permanent basis in January 2011, as Crawley would get promoted to the Football League for the first time in their history that season. He joined AFC Wimbledon in 2014, helping the club win promotion to League One via the play-offs in 2016, before returning to Crawley Town in 2017.", "link_mentions": [{"page": "Stevenage F.C.", "response": ["* 2005   Dannie Bulman"]}, {"page": "Joe Burnell", "response": ["Burnell joined Wycombe Wanderers in July 2004 after Tony Adams' summer clearout which saw the departure of Michael Simpson, Dannie Bulman, Steve Brown and Darren Currie. Burnell was hoping to gain a regular first team place and after a season blighted by injury and illness he formed a midfield trio with Matt Bloomfield and Keith Ryan. Burnell scored his first and only goal for the club in an FA Cup tie against future club Northampton Town."]}, {"page": "Tom Evans (footballer, born 1976)", "response": ["He was released by Scunthorpe in May 2006 and joined Conference National club York City on 31 July after making a good impression on manager Billy McEwan during several weeks on trial. He said that he believed promotion could be achieved for York with 20 clean sheets. He was sent off in the 16th minute of an away match against Crawley Town on 9 September 2006 after fouling Dannie Bulman outside the penalty area, which York lost 3–0 with second choice goalkeeper Arran Reid brought on to replace him. He was offered a new contract by York at the end of 2006–07."]}, {"page": "Matt Sparrow", "response": ["On 10 January 2013, Sparrow signed for League One and fellow Sussex side Crawley Town on a free transfer. Sparrow made his Crawley debut only two days later on 12 January, coming on in the 67th minute as a substitute replacing fellow midfielder Dannie Bulman, in a 2–0 defeat against Tranmere Rovers. He made his home debut on 2 February in a 1–1 draw against Swindon Town. He scored his first goal for the club on 9 February in a 2–1 defeat against his former club Scunthorpe United. He scored his second goal for the club in a 2–2 draw against Yeovil Town. He played 17 times for Crawley in the league that season, scoring three goals as they finished in 10th place, their highest-ever league placing."]}, {"page": "2005 Conference National play-off Final", "response": ["|MF ||15||Dannie Bulman"]}, {"page": "Graham Westley", "response": ["As was the case in previous seasons, Westley made wholesale changes at the end of the season, releasing several of the players he had originally signed from Farnborough, and replacing them with a mixture of players with Football League experience – in the form of Brian Quailey, Dannie Bulman, and Matt Hocking, as well as players from lower divisions such as Jon Nurse and Craig McAllister. Westley also gave first team opportunities to players who had progressed through the club's youth system, which included George Boyd. The new squad lost five games of the opening eight games of the club's league season. Following a 4–1 home defeat to  part-time Canvey Island, with Stevenage supporters calling for Westley to leave the club, he walked across the pitch to  the East Terrace and told supporters he \"would turn it around\". The team responded with four consecutive victories, and stayed close to the play-offs places. Stevenage went into the final day of the season needing to beat already-relegated Leigh RMI, and had to rely on Tamworth to hold Morecambe, who were currently occupying the final play-off spot. Stevenage beat Leigh 2–0, while Tamworth held Morecambe to a goalless draw, ultimately meaning Westley's team had reached the play-offs on the final day of the season. Stevenage overcame second-placed Hereford United 2–1 on aggregate, before losing 1–0 to Carlisle United at the Britannia Stadium in the final."]}, {"page": "Ritchie Hanlon", "response": ["Hanlon made his debut for Southend United in the First Division on 18 January 1997, away to Sheffield United in the 3–0 defeat. After just two League appearances for Southend, he then dropped down into the Conference National with Welling United in 1997. In 1998, Hanlon joined Rushden & Diamonds and then Peterborough United in December. He made his debut for Peterborough in the 3–1 home win against Scarborough in Division Three, replacing Matthew Etherington as a substitute in the 87th minute. Whilst on the books with Peterborough, Hanlon had two spells on loan with non-League club Welling United. He then joined Rushden & Diamonds in 2001, where he made 62 appearances scoring seven goals in three-years. Hanlon joined Stevenage Borough in June 2004 along with Dannie Bulman from Wycombe Wanderers. He played 18 games in the Conference National for Stevenage, scoring twice. In December 2004, Lincoln City signed Hanlon on a one-month loan deal, after being transfer listed by Stevenage manager, Graham Westley. His move was made permanent days later. After his time at Lincoln, he moved to Conference South club Weymouth where he made four appearances before joining Cambridge United in September 2005. Hanlon made 37 appearances, scoring three goals for Cambridge in two seasons in the Conference National. He was forced to retire in January 2007 due to a persistent knee injury."]}, {"page": "List of footballers in England by number of league appearances", "response": ["!scope=row data-sort-value=\"Bulman, Dannie\"|Dannie Bulman"]}, {"page": "2009–10 Oxford United F.C. season", "response": ["|align=\"left\"|4||align=\"left\"|MF||align=\"left\"|Dannie Bulman"]}, {"page": "Hope Akpan", "response": ["Akpan scored on his Crawley Town debut but was sent-off in the last minutes for a second bookable offence, in a 3–2 win over AFC Wimbledon in the qualification round of the League Cup. After serving a one match suspension, Akpan returned to the first team and set up a goal for Wes Thomas, in a 2–0 win over Macclesfield Town on 13 August 2011. After being sidelined from the first team for a month, he then scored again on 29 October 2011, in a 1–1 draw against Accrington Stanley. Despite being left out of the squad for the second time this season, Akpan, nevertheless, remained in the first team, forming a midfield partnership with Dannie Bulman However, although the club were promoted to League One, Akpan ended the season when he was sent-off in the sixth minutes for lunging Jason Prior, who had to be substituted, in a 1–1 draw against AFC Wimbledon on 14 April 2012. For this, he was suspended and never played for the remainder of the season. At the end of the 2011–12 season, Akpan went on to make thirty-three appearances and scoring two times in all competitions."]}, {"page": "Dannie", "response": ["* Dannie Bulman (born 1979), English football midfielder"]}, {"page": "2010–11 Oxford United F.C. season", "response": ["|align=\"left\"|4||align=\"left\"|MF||align=\"left\"|Dannie Bulman", "| 1 January 2011 || Dannie Bulman || Crawley Town || style=\"text-align:center;\"| Free || style=\"text-align:center;\"|", "| 25 September 2010 || Dannie Bulman || Crawley Town || style=\"text-align:center;\"| 31 December 2010 || style=\"text-align:center;\"|"]}, {"page": "2010 Conference Premier play-off Final", "response": ["|RM ||4||Dannie Bulman"]}, {"page": "2010–11 Crawley Town F.C. season", "response": ["|align=\"left\"|15||align=\"left\"|MF||align=\"left\"|Dannie Bulman", "| 30 December 2010|| Dannie Bulman|| style=\"text-align:center;\"| Oxford United || style=\"text-align:center;\"| Free||"]}, {"page": "2011–12 Crawley Town F.C. season", "response": ["|= ||MF || ||15 ||Dannie Bulman || 3 || 0 || 0 || 0 || 3", "|15 || ||MF ||Dannie Bulman || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0", "|align=\"center\"| Player of the Year ||align=\"center\"| Dannie Bulman"]}, {"page": "Ricky Wellard", "response": ["Wellard was born in Hammersmith, London. He came through the ranks of the Ashford Town (Middlesex) and made his debut for the Tangerines against Stourport Swifts on 8 January 2005, as a late sub for Anthony Eggington. He went on to make 190 first team appearances for Ashford Town including scoring the winning goal in the 2009 Surrey Senior Cup final. During his time at the club Wellard was also groundsman at Short Lane. In the summer of 2008, AFC Wimbledon had a transfer bid rejected which was described as 'derisory' by the Ashford board. However, the Dons second bid the following summer was more successful for an undisclosed fee plus add-ons. At the time of the transfer, Wellard was one of only three players to have ever commanded a transfer fee at Ashford, with the others being Dannie Bulman and Richard Butler."]}, {"page": "1999–2000 Wycombe Wanderers F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Dannie Bulman"]}, {"page": "2012–13 Crawley Town F.C. season", "response": ["|Dannie Bulman"]}, {"page": "List of AFC Wimbledon records and statistics", "response": ["|8||align=\"Centre\"| Dannie Bulman||2014–2017||||||||||||"]}, {"page": "2013–14 Crawley Town F.C. season", "response": ["|Dannie Bulman"]}, {"page": "Moussa Sanoh", "response": ["On 5 June 2017, Sanoh agreed to join English side Crawley Town on a two-year deal with the option of an extra year. On 8 August 2017, Sanoh made his Crawley debut during their EFL Cup first round 5–1 defeat against Championship side Birmingham City. A month later, he made his league debut in their 1–0 home defeat against Notts County, replacing Dannie Bulman in the 68th minute. Sanoh scored his first goal for Crawley in their 3–1 away defeat against Portsmouth in an EFL Trophy group stage tie. On 3 July 2018, it was announced that Sanoh would leave Crawley, following a mutual termination in his contract."]}]}}