{"wiki_id": "http://www.wikidata.org/entity/Q5225436", "itemLabel": "Darryl Read", "itemDescription": "British actor, writer and musician (1951-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Darryl_Read", "wikipedia_page": {"main": "Darryl Michael Roy Read (19 September 1951 – 23 June 2013) was a British singer, guitarist, drummer, actor, poet and writer. In the late 1960s, Read was a member of Crushed Butler, considered by some to be amongst the forerunners of punk rock. He collaborated with musicians such as Bill Legend, Mickey Finn and Ray Manzarek.\nRead appeared as a child actor in a number of films, including, aged 14, in Daylight Robbery (1964), for which he won a silver medal for best actor at the Venice Film Festival. He also appeared on stage in two rock-based plays and a number of television programmes. He was a published author of poetry as well as a biographical novel.\nRead was killed in a motorcycle incident in Thailand in 2013.", "link_mentions": [{"page": "June 23", "response": ["*  2013   – Darryl Read, English singer-songwriter, drummer, and actor (born 1951)"]}, {"page": "List of people who died in traffic collisions", "response": ["|align=\"left\"| Darryl Read"]}, {"page": "Ray Manzarek", "response": ["His memoir, Light My Fire: My Life with the Doors, was published in 1998. The Poet in Exile (2001) is a novel exploring the urban legend that Jim Morrison may have faked his death. Manzarek's second novel, Snake Moon, released in April 2006, is a Civil War ghost story. In 2000, a collaboration poetry album entitled Freshly Dug was released with British singer, poet, actor and pioneer punk rocker Darryl Read. Read had previously worked with Manzarek on the Beat Existentialist album in 1994, and their last poetical and musical collaboration was in 2007 with the album Bleeding Paradise. Also in 2000, he co-wrote and directed the film Love Her Madly, which was credited to a story idea by Jim Morrison.  The film was shown at the closing night of the 2004 Santa Cruz Film Festival, but otherwise received limited distribution and critical review.", "With Darryl Read"]}, {"page": "Tony Meehan", "response": ["*Darryl Read – \"High Rise Angry Young Man\" – 1981 (on \"Collectomatic vol I\" – LP—1997 (white label))"]}, {"page": "The Gorillas", "response": ["Jesse Hector (born in 1947, in Kilburn, northwest London, England) played in bands from the age of 11, first the Rock and Roll Trio, and then the R&B-influenced band the Cravats.Ankeny, Jason \"[ Jesse Hector Biography]\", Allmusic, Macrovision Corporation Cravats bassist Adrian Stambach joined mod outfit the Clique in 1963. Hector reformed the Rock and Roll Trio before starting two more short-lived bands, the Way of Life and the Mod Section, and went on to form the proto-punk band Crushed Butler in 1969 with drummer Darryl Read and bassist Alan Butler. After a brief flirtation with EMI Records, the band was renamed Tiger, until Darryl left to join the glam rock group Dizzy, then they changed name again to Helter Skelter. With the addition of drummer Gary Anderson, the band became the Hammersmith Gorillas, taking their name from London's pro-Castro activist group the Hammersmith Guerillas. ", "Crushed Butler's recordings were compiled by Darryl Read on the Uncrushed album in 2005 by RPM Records."]}, {"page": "Dave Goodman (record producer)", "response": ["In 2000 he appeared in the cult underground film Remember a Day, as The Mime Troupe Leader, he also provided the incidental music soundtrack with Darryl Read who starred in the film as Roger Bannerman.", "Goodman produced several other early punk rock acts, including Eater, Chelsea, The Cannibals, Maniacs, UK Subs and in 2002 with Darryl Read. He subsequently produced and performed with very many other artists, and eventually ran his own studio and record label in Malta, Mandala Music."]}, {"page": "Lou Martin", "response": ["Martin started learning the piano at the age of six, and joined his first professional band, Killing Floor, in April or May 1968. In 1969 Martin and Stuart McDonald were recruited by 17-year-old Darryl Read who formed a band for Emperor Rosko's brother (Jeff Pasternak) called Crayon Angels, which Read put together and played drums, while Rosko acted as manager.  Martin later left Killing Floor to play alongside Gallagher, and is featured on several of Gallagher's albums, including Blueprint, Tattoo, Irish Tour '74, Against the Grain, Calling Card, Defender and Fresh Evidence. He also played rhythm guitar on one track, \"Race the Breeze\" from Blueprint."]}, {"page": "Neil Christian", "response": ["*Darryl Read"]}, {"page": "List of British films of 1964", "response": ["|Daylight Robbery||Michael Truman||Kirk Martin, Darryl Read,Trudy Moors, Janet Hannington||Crime|| ", "|Five Have a Mystery to Solve||Ernest Morris||David Palmer, Darryl Read||Family||"]}, {"page": "2013 in film", "response": ["| style=\"text-align:center;\"| 23 || Darryl Read || style=\"text-align:center;\"| 61 || style=\"text-align:center;\"| English || style=\"text-align:center;\"| Actor, Singer || "]}, {"page": "Five Have a Mystery to Solve", "response": ["A 6-part Children's Film Foundation film serial was produced in 1964, directed by Ernest Morris. The film starred David Palmer (Julian), Amanda Coxell (George), Darryl Read (Dick), Paula Boyd (Anne), and Michael Wennink (Wilfrid). Filmed mainly on location in Cornwall, United Kingdom, and at Bushey Studios, Hertfordshire, United Kingdom. On one occasion, Blyton visited the set during the filming and spent the day with all the cast and crew."]}, {"page": "Crushed Butler", "response": ["Crushed Butler were a British protopunk/hard rock band that existed between 1969 and 1971. According to 2008's Pretty Vacant: A History of UK Punk, the band \"was, in many ways, Britain's first proto-punk band.\" Band members went on to form The Hammersmith Gorillas aka The Gorillas and The Darryl Read Group, as well as pursue solo careers.", "Crushed Butler formed in 1969 with a line-up of Jesse Hector (guitar, lead vocals, songwriter), Alan Butler (bass guitar) and Darryl Read (drums, backing vocals, songwriter).Heibutzki, Ralph \"[ Crushed Butler Biography]\", AllMusic, retrieved 27 September 2009 In 1967 Jesse Hector's (ex Jesse Hector And The Rock 'N' Roll Trio, The Cravats, and The Clique) original group, The Way Of Life broke up which lead to Hector forming the late mod group entitled The Mod Section in 1968. Around the same time in 1967, Darryl Read formed his first group The Orange Illusion with future Silverhead frontman, Michael Des Barres. Both Read and Des Barres were working actors who formed the band on campus at the Corona Theatre School (formerly Corona Academy) the same drama school which they both attended. Some months later after the Corona Academy Acting Director forces Darryl and Michael to disband The Orange Illusion, Read is asked by BBC Radio 1 & Radio Caroline host and disc jockey, Emperor Rosko to assemble a new band for his brother.", "Darryl Read comes up with the name Crushed Butler unlike any of the other thirty band names he jots down, including (unused at the time) the band moniker, The Clash, which he deemed too corny! The band moniker chosen is an anagram of sorts: Alan's surname, Butler, Darryl's initials, D.R.  end the words, and Ray Hector's (\"Ray\", the first name that Jesse was known by at this time) first and last name initials, R.H. are also imbedded. As well as SHED, named after The Chelsea Shed Boys (now known as The Chelsea Headhunters), who are a notorious English football hooligan firm linked to the London football club Chelsea.", "Crushed Butler boasted a striking, heavily idiosyncratic, futuristic visual style. They dressed in hand-cut, slash neck, blood red T-shirts and straight legged, drainpipe, blue or black Levi's trousers with studded belts slung low on the hip. Jesse Hector had short cropped on top hair with massive mutton chops. Hector styled his hair with a skinhead at the back, mod on top, rockabilly sideburns, and a parting in the middle. Alan Butler had a crop cut centre parting hairdo and large sideburns. Darryl Read had a lion's shag of dark hair and continually sported a black leather vintage motorbike jacket, with a blue/white hooped T-shirt and Cuban heels. Altogether their image resembled bovver boys and they looked liked The Clash several years before The Clash formed, and Hector's voice sounded like John Lydon of Sex Pistols only in 1969. Overall the fully formed and modern image of Crushed Butler predated the British punk rock visual aesthetic of 1976 by seven years earlier.", "Barry Mitchell was the same size as the rest of the band, his hair was startling blonde and spikey, not dissimilar to Paul Simonon of The Clash. He played a Gibson SG bass, creating a raw but powerful rhythm section with Darryl Read.", "In autumn 1970, the band changed their name to Tiger, and the line-up also changed to include Arthur Anderson. Darryl Read specifically enlisted  Arthur Anderson in the band because of his Glaswegian thug abilities, and also because he impressed the band with his aggressive bass style. Anderson cut his hair off and looked like a droog from A Clockwork Orange one year before the film was released in the UK. A friend of Darryl Read, David Palmer (Read and Palmer who both attended Corona Film School together) takes new black and white band photos for the group in late 1970, again in Kilburn, near Jesse Hector's mother's council house, as Hector wields bricks, Darryl sports braces, and Arthur sports Converse Chuck Taylor All-Stars sneakers. As Tiger they were managed by Neil Christian of The Crusaders as the bands second manager. Neil Christian knew Dave Siddle at the new De Lane Lea studios in Wembley and got Tiger some free studio time as guinea pigs testing the new studio equipment. Tiger recorded five songs at De Lane Lea Studio in October 1970 that remain missing and unreleased as of 2021.", "In summer 1971, Jesse Hector forms new band Helter Skelter with Gary Anderson on drums who previously played in the band Albert Monk. With Vic Allen drafted in on bass, Helter Skelter record three songs at Regent Sound Studio in Denmark Street (the first studio Crushed Butler recorded at back in October 1969). The three songs recorded include \"I Need You\", \"Goodbye Baby\", and \"I Live In Style In Maida Vale\". David Kassner, son of President Records owner David Kassner, produces the session. The session was deemed too aggressive for public consumption at the time in late 1971. However, a Helter Skelter single was released posthumously on President Records subsidiary, Sticky Records, six years later in 1977. Upon the departure of Vic Allen, Alan Butler joined Helter Skelter and the band played many gigs between 1972 and 1973. With a name change (suggested by Darryl Read) inspired by the song \"Hammersmith Guerilla\" by the political proto punk band, Third World War (who were the second British proto punk band after Crushed Butler), Hector and Butler went on to form The Hammersmith Gorillas in 1973, later to be shortened to The Gorillas in early 1976.", "After his stint as drummer, backing vocalist, an co-songwriter in Crushed Butler, Darryl Read was employed by Chris Stamp at Track Records as a professional songwriter working with John \"Speedy\" Keen from Thunderclap Newman. Thunderclap Newman had a number one British hit three years earlier with Something In The Air. In early 1972, Read also formed a songwriting collaboration with Terry Stamp and Jim Avery from Third World War and a new group, \"Stamp, Read 'n' Avery\" was briefly touted but did not come to fruition. However, Darryl and Terry recorded Terry's song \"Razor City\" at Regent Sounds Studio in late 1972. Subsequently, the \"Razor City\" demo helped Stamp get a solo deal with A&M Records. In 1973, Read joined a new group named \"Dizzy\" (featuring Steve Forest, ex guitarist from glam band Silverhead) and in 1975, he formed \"The Darryl Read Group\". The Darryl Read Group (with Steve Forest on lead guitar and Charlie Harty on bass) recorded demos in 1975 and 1976 that lead to a publishing deal with Kenny Barker of Chappell & Co. (now known as Warner Chappell Music). On completion of recording the batch of demos Barker and Read proceeded to play them for Nick Mobbs at  EMI Records, however were unsuccessful in securing a record deal. Later Read pursued a solo career, as well as working as an actor. Read's works included four albums Book Of The Dead (1989) and Beat Existentialist (1991) both with Terry Stamp from Third World War, Freshly Dug (1999) with and Bleeding Paradise (2007) both recorded with Ray Manzarek from The Doors. Read's last studio album was \"All The Ghost's Of Rock 'N' Roll (2010)   Darryl Read was killed in a motorcycle accident in June 2013 in Thailand.", "1. It's My Life (Jesse Hector/Darryl Read/Graham Breslau), 2. Let It Ring aka Waiting For You (Graham Breslau)", "E.M.I. Demo Studios, EMI House, Manchester Square, London, Produced By Roger Ferris, Surviving EMIDisc Acetate, Mono, Stan Aldous On Bass, 1. Love Is All Around Me (Roger Ferris/Gloria Macari), 2. Factory Grime (Jesse Hector/Darryl Read/Graham Breslau)", "Decca Recording Studios, West Hampstead, London, Produced And Engineered By Graham Breslau And Crushed Butler, Surviving Master Tape, Mono, Barry Mitchell On Bass, 1. My Son's Alive (Jesse Hector/Darryl Read), 2. Love Fighter (Jesse Hector/Darryl Read), (2 Additional Songs Recorded Are Missing From Master Tape)", "1. High School Dropout (Version 1) (Jesse Hector/Darryl Read)", "1. High School Dropout (Version 2) (Jesse Hector/Darryl Read)"]}, {"page": "The Lost Continent (1968 film)", "response": ["Sarah (Dana Gillespie), a mysterious native girl from a nearby island, suddenly  appears, walking on the morass of seaweed, prevented from sinking by air buoyancy balloons attached to her shoulders and odd pads attached to her feet. She is being chased by a bunch of fur-clad barbarians but she warns Captain Lansen of an impending attack. The crew and passengers defend the Corita, with the surviving fur-clad attackers returning to a dilapidated large wooden Spanish galleon, marooned nearby. Child leader \"El Supremo\" (Darryl Read), the princely descendant of the Spanish Conquistadors, along with members of the Spanish Inquisition had ordered the attack in order to steal their supplies.", "* Darryl Read as El Supremo"]}, {"page": "Teenage Dream (T. Rex song)", "response": ["\"Teenage Dream\" was recorded and released as a single in 1994 by Darryl Read, with T.Rex drummer Bill Legend repeating his performance from the original. Reissued in 2009, the single had a promotional video filmed at the Roundhouse, London with T. Rex fans. It was also recorded by former T. Rex drummer Mickey Finn on his 2002 album Renaissance. In a 2007 concert to commemorate the 30th anniversary of Bolan's death, \"Teenage Dream\" was performed by Marc Almond.Sinclair, David (2007) \"Marc Bolan: the celebration\", The Times, 17 September 2007, retrieved 26 July 2010"]}, {"page": "Five Have a Mystery to Solve (film)", "response": ["*Darryl Read as Dick"]}, {"page": "2013 in the United Kingdom", "response": ["**Darryl Read, 61, musician, poet and actor."]}, {"page": "2013 in British music", "response": ["*23 June – Darryl Read, English singer-songwriter, drummer (with Crushed Butler) and actor, 61 (motorcycle accident)"]}, {"page": "List of British films of 2013", "response": ["| style=\"text-align:center;\"| 23 || Darryl Read || style=\"text-align:center;\"| 61 || style=\"text-align:center;\"| English || style=\"text-align:center;\"| Actor, singer || "]}, {"page": "Deaths in June 2013", "response": ["*Darryl Read, 61, British musician, poet and actor, motorcycle accident.Pattaya Musician Darryl Read killed in road accident"]}, {"page": "26th Venice International Film Festival", "response": ["**Daylight Robbery (Darryl Read)"]}, {"page": "The Rock Pub", "response": ["* Darryl Read"]}]}}