{"wiki_id": "http://www.wikidata.org/entity/Q5225047", "itemLabel": "Darren McDermott", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Darren_McDermott", "wikipedia_page": {"main": "Darren McDermott is an English middleweight boxer.  He is the current holder of the English middleweight title and has previously held the Midlands Area title at the same weight.  In 2008 he competed for the full British title and in 2009 competed for the Commonwealth.", "link_mentions": [{"page": "Dudley", "response": ["* Darren McDermott (born 1978 in Dudley) English middleweight boxer and the current holder of the English middleweight title "]}, {"page": "McDermott", "response": ["*Darren McDermott (born 1978), English boxer"]}, {"page": "Wayne Elcock", "response": ["Elcock was managed by Frank Maloney at the start of his career and promoted by Panix promotions before moving after 2 winning fights to Frank Warren, then later to Mick Hennessy. Elcock was trained in Leicester to begin with by Jez brogan, before moving to London to be trained by both Frank Maloney and Alan Smith, along with several visits to america to build on his skills, where Wayne worked with Goody Petronelli the trainer of former world champions Marvelous Marvin Hagler and Steve Collins at his famous Brockton gym. Wayne came back to his home town to team up with Birmingham's most successful boxing trainers brothers Paddy & Tommy Lynch. Knocking out fellow contender Darren Rhodes in 1 minute 30 seconds in Elcocks homecoming and first ever fight with the Lynch brothers in Birmingham at a sold out Aston Events Centre, this setting up his first attempt at the prestigious British title Lonsdale Belt against Plymouth's Scott Dann (boxer) in the first British title fight to ever be scored by three judges, after defeat Wayne bounced back with two back to back knockout victories one of them a British title eliminator winning by TKO against Scotland's Lawrence Murphy, who was the only other boxer to have beaten Elcock, In Wayne's next contest he faced the English champion Steven Bendall who was to be yet another stopped, but this time over eight punishing rounds and setting up his next contest where he would become the first British boxer to beat long standing British and Commonwealth champion Howard Eastman to win the coveted Lonsdale Belt in 2007, Elcock also won the Commonwealth title and the minor WBU World Middleweight title becoming the first Birmingham born fighter to ever hold a version of a World title. Elcock challenged for the IBF middleweight title against the unbeaten World champion Arthur Abraham on 8 December 2007, losing by a fifth round knockout. Wayne bounced back from his world title attempt defending the lonsdale belt with a TKO win against local Dudley rival Darren McDermott, before losing the next defence to fellow Birmingham fighter Matthew Macklin in the Battle of Brum Elcock retired after this contest at the age of 36 with a record of 23 -19 - 9 KO’s to concentrate fully on his other businesses, today Wayne can be found mentoring in schools and behind the counter at Mad Dog's Boxing shop located in Sutton Coldfield, Birmingham, as well as coaching in the evening at the multi award winning company Wayne Elcock's Box Clever and training professional fighters at his Kronk Birmingham gym in Chelmsley Wood, which is not far from where he grew up in Shard End.", "|style=\"text-align:left;\"| Darren McDermott"]}, {"page": "Darren Barker", "response": ["On 14 November 2007 Barker fought for his first major title, the vacant Commonwealth Middleweight belt.  His opponent, the undefeated Australian Ben Crampton had won 20 fights to date with only one draw.  Barker won the fight at the York Hall by unanimous decision over 12 rounds to lift the title.Barker wins Commonwealth title. Fox Sports (15 November 2007). Retrieved 2012-05-26. His first defence saw him beat former British & European title challenger Steve Bendall with a seventh round stoppage.  Barker then travelled to Canada in August 2008 and beat local man Larry Sharpe, a former Canadian champion and Commonwealth challenger, in a non-title fight over 10 rounds.Barker impresses on Canadian debut. The Telegraph. Retrieved 2012-05-26.Darren Barkers Official Website. Dazzlingdarrenbarker.com. Retrieved 2012-05-26. On 13 December 2008, Barker defended his title for the second time against Northern Ireland's Jason McKay forcing him to retire at the end of round six.  Barker's third defence of the title took place on 23 May 2009 against Dudley's Darren McDermott in a fight which was also billed as a British title eliminator.  The fight which was held at the Watford Colosseum ended with a fourth round stoppage for the champion.BBC Sport | Barker crushes McDermott ambition. BBC News (23 May 2009). Retrieved 2012-05-26.", "On 28 November 2009 Barker defeated Danny Butler, at the Brentwood Centre in Brentwood to lift the vacant British Middleweight title with the fight also doubling as a fourth defence of his Commonwealth crown. The original opponent for the fight Wayne Elcock, a former champion, had withdrawn due to a stomach virus meaning that Butler had come into the contest at short notice. Barker's class showed, and the referee called a stop to the fight in round 7 deciding that Butler, who had recently lost to Darren McDermott in a challenge for the English title, was in no position to continue.BBC Sport | Barker far too good for Butler. BBC News (29 November 2009). Retrieved 2012-05-26.", "|style=\"text-align:left;\"| Darren McDermott"]}]}}