{"wiki_id": "http://www.wikidata.org/entity/Q5228737", "itemLabel": "Dave Eringa", "itemDescription": "English record producer, sound and mix engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Eringa", "wikipedia_page": {"main": "David James Eringa (born 30 July 1971 in Brentwood, Essex) is an English record producer, sound and mix engineer.\nEringa has worked and played on albums by artists including Manic Street Preachers, Idlewild, Wilko Johnson and Roger Daltrey, The Who, Gyroscope, BB Brunes, Calogero, Kylie Minogue, Tom Jones, 3 Colours Red, South and Nine Black Alps. His association with the Manic Street Preachers stretches through their entire career starting with tea making duties on their first single \"Motown Junk\", playing keyboards on \"Generation Terrorists\", producing & mixing \"Gold Against The Soul\", playing keyboards live with the band 1993–94, producing & mixing two tracks on \"Everything Must Go\" (\"Australia\" & \"No Surface All Feeling\"), producing & mixing half of \"This Is My Truth, Tell Me Yours\" (including No. 1 single \"If You Tolerate This Your Children Will Be Next\"), producing & mixing the first No. 1 of the millennium (\"Masses Against The Classes\"), producing & mixing \"Know Your Enemy\", & producing \"Send Away The Tigers\". He also has a long association with Idlewild producing & mixing \"100 Broken Windows\", \"The Remote Part\" & \"Make Another World\", as well as contributing to \"Warnings & Promises\" and more recently \"Post Electric Blues\". In 2014 he produced the gold selling album by Wilko Johnson & Roger Daltrey \"Going Back Home\" which led to him producing The Who & working with Roger Daltrey on a solo album.", "link_mentions": [{"page": "Judge Dredd", "response": ["* The Manic Street Preachers' song, \"Judge Yr'Self\" was influenced by the comic, and was intended to appear on the Judge Dredd film soundtrack. It reached the demo stage, but after lyricist and guitarist Richey Edwards disappeared, the other members of the band said that a song for a soundtrack was the last thing on their mind.staybeautiful.net Edwards himself was heavily influenced by the Judge Dredd and 2000 AD comics (the slogan \"Be pure. Be vigilant. Behave\" from the 2000 AD strip Nemesis the Warlock was included in the song \"P.C.P.\"). A fully produced mix of \"Judge Yr'Self\" (by long time Manics producer Dave Eringa) was later released on the 2003 double-album of B-sides and rarities, Lipstick Traces. Richey was a great fan of Judge Dredd and even had one of his drawings published in the comic during his late childhood. Richey himself was later parodied as \"Clarence\" of the \"Crazy Sked Moaners\" in the Dredd story Muzak Killer: Live! Part 3 (prog 838, 5 June 1993), in a scene which parodied the infamous 1991 incident of Richey carving 4 REAL into his forearm with a razor (Clarence lasers 4 RALE into his forehead)."]}, {"page": "Manic Street Preachers", "response": ["The band also stated that the choice to work with Dave Eringa again was important for this album: \"We finished work in November and then just went straight into a demo studio and we came out about four weeks later with the album all finished. We were all happy with all the songs, we knew what they wanted to sound like, so we didn't want to use a mainstream producer because they've got their own sound and vision of what a record should be like. So we just phoned Dave up and said 'Look, come down, let's see how this works out', and everyone loved what we were doing, so we decided to stay with him.\"", "Postcards from a Young Man was recorded with producer (and longtime Manics collaborator) Dave Eringa and was mixed in America by Chris Lord-Alge. It was released in a standard version, 2 CD deluxe version, and limited edition box set. The album cover art uses a black and white photograph of British actor Tim Roth.", "The Lightning Seeds' song \"Waiting for Today to Happen\", from their fifth album, Dizzy Heights (1996), was written by Nicky Wire and Ian Broudie. That same year, James Dean Bradfield and Dave Eringa produced Northern Uproar's first single, \"Rollercoaster/Rough Boys\". The 808 State song \"Lopez\" (1997) features lyrics by Wire and vocals by Bradfield. It is featured on their greatest hits album, 808:88:98. Kylie Minogue's sixth album, Impossible Princess (1997), features two songs co-written and produced by the Manics: \"Some Kind of Bliss\" (Bradfield, Minogue and Sean Moore) and \"I Don't Need Anyone\" (Bradfield, Jones and Minogue) were produced by Bradfield and Dave Eringa. Bradfield provided backing vocals, bass guitar and production for the Massive Attack song \"Inertia Creeps\" (1998), which features on their successful third album, Mezzanine. Patrick Jones's album of poetry set to music, Commemoration and Amnesia (1999), features two songs with music written by Bradfield: the title track and \"The Guerilla Tapestry\". Bradfield plays the guitar on both songs. Furthermore, the track \"Hiraeth\" features a section called \"Spoken Word\", in which Nicky Wire talks about Welsh identity.", "* Dave Eringa – keyboards (1993–1995)"]}, {"page": "Generation Terrorists", "response": ["* Dave Eringa – piano, organ on \"Nat West–Barclays–Midlands–Lloyds\", \"You Love Us\", \"Spectators of Suicide\" and \"Crucifix Kiss\""]}, {"page": "Gold Against the Soul", "response": ["The band stated that the choice to work with Dave Eringa again was important for this album: \"We finished work in November and then just went straight into a demo studio and we came out about four weeks later with the album all finished. We were all happy with all the songs, we knew what they wanted to sound like, so we didn't want to use a mainstream producer because they've got their own sound and vision of what a record should be like. So we just phoned Dave up and said 'Look, come down, let's see how this works out', and everyone loved what we were doing, so we decided to stay with him.\"", "Both the NME and Q have since revised their opinions of Gold Against the Soul in some later articles, with the former's Paul Stokes opining that its short, \"snappy, driven and focused\" length contrasts with other albums' \"indulgently lengthy tracklistings\", and suggesting that \"with its big, radio-friendly Dave Eringa production, it's easy to see why Gold Against the Soul caused such a stir compared to the wild, almost feral rock of Generation Terrorists that preceded it a year earlier. However, with the band's more beefed up, arena-friendly sound emerging in subsequent years, this album is no longer so at odds with the general Manics aesthetic.\" The latter publication, in a retrospective review of The Holy Bible, looked back on Gold Against the Soul as \"an underrated pop-metal effort that's armed with a handful of bona-fide big tunes\", and cited \"La Tristesse Durera (Scream to a Sigh)\" as its highlight.", "* Dave Eringa – piano, Hammond organ, production, engineering, mixing", "Category:Albums produced by Dave Eringa"]}, {"page": "Everything Must Go (Manic Street Preachers album)", "response": ["* Dave Eringa – production on \"No Surface All Feeling\", mixing on \"Australia\" and \"No Surface All Feeling\""]}, {"page": "This Is My Truth Tell Me Yours", "response": ["In an interview Dave Eringa admitted that: \"James was piling on the pressure at the time. He's got this idea that I work best under pressure; it's about putting me under as much as he can all the time!\". After recording \"If You Tolerate This Your Children Will Be Next\", he also said that the song went through a four-month gestation period.", "Category:Albums produced by Dave Eringa"]}, {"page": "Know Your Enemy (Manic Street Preachers album)", "response": ["* Dave Eringa – engineering on tracks 1, 2, 4, 7, 8 and 11–14, mixing on tracks 1–4, 6–9 and 11–16, production", "Category:Albums produced by Dave Eringa"]}, {"page": "Forever Delayed", "response": ["| 3 || \"If You Tolerate This Your Children Will Be Next\" || 4:51 || This Is My Truth Tell Me Yours || 24 August 1998 (No. 1) || Dave Eringa"]}, {"page": "If You Tolerate This Your Children Will Be Next", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "The Masses Against the Classes", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "So Why So Sad", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "Found That Soul", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "Ocean Spray (song)", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "Let Robeson Sing", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "Impossible Princess", "response": ["Minogue said that James Dean Bradfield of Manic Street Preachers \"had a very clear idea\" of how he wanted her to sound during their first session at his home.;  Minogue found it \"difficult\" to re-write Bradfield's demo of \"I Don't Need Anyone\", so he had taken pieces of the original demo lyrics and mixed them with other lyrics she had written, with help from Nicky Wire, to create the finished version of \"I Don't Need Anyone\".;  She found this method of writing \"intriguing\" and wanted to do it again. She worked with Bradfield and Sean Moore on \"Some Kind of Bliss\".; ;  Commenting on this method of songwriting, Minogue said, \"He took one half of one set [of lyrics] and took another half from another set of lyrics and merged them together, which I found interesting because it was something I wouldn't have done because, in my mind they're two separate things.\" She later said she felt the lyrics worked together. Bradfield and frequent collaborator Dave Eringa produced both tracks.", "* Dave Eringa – production, string arrangements", "Category:Albums produced by Dave Eringa"]}, {"page": "The Proclaimers", "response": ["A tenth studio album, Let's Hear It for the Dogs, was released in April 2015. The album was recorded at Rockfield Studios in Wales and produced by Dave Eringa. As stated by member Charlie Reid, the decision to have Eringa produce Let's Hear It for the Dogs was brought about by an admiration for his work with Manic Street Preachers, and on the Johnson and Daltrey album Going Back Home."]}, {"page": "The Remote Part", "response": ["The Remote Part is the third studio album by Scottish rock band Idlewild, released on 15 July 2002 by Parlophone. As they were becoming increasingly aware of their label's interest in them and their demos, the band's musical direction was being steered by guitarist Rod Jones. For the first half of 2001, the band recorded songs with producers Stephen Street and Lenny Kaye. Due to the uneven nature of the songs done between tours, they spent some time reworking 20 tracks in the Scottish Highlands. They recorded at Rockfield Studios in Wales, RAK Studios in London, and Sawmills Studios in Cornwall with producer Dave Eringa. Described as an alternative rock and indie rock record, it lacked the punk rock elements of their previous work.", "Following appearances at the V and Gig on the Green festivals in August 2001, the band continued recording. By this point, they had ten songs that Woomble said \"weren't fitting together\" due to being recorded in between separate tours. They spent two and a half weeks writing and re-doing 20 songs at a cottage in Inchnadamph, located in the Scottish Highlands. The band then worked with producer Dave Eringa and at Rockfield Studios in Wales, RAK Studios in London, and Sawmills Studios in Cornwall over a period of six weeks.Citations for recording with Eringa:", "* Dave Eringa – producer, mixing", "Category:Albums produced by Dave Eringa"]}, {"page": "100 Broken Windows", "response": ["100 Broken Windows is the second studio album by Scottish rock band Idlewild, released on 9 May 2000. While touring in support of their debut studio album Hope Is Important (1998), the band wrote and recorded its follow-up in stages. Sessions were done between May and November 1999 at a variety of studios: Air in London, Jacob's in Surrey, Rockfield in Wales, and Electrical Audio, Chicago. Initial recording with Bob Weston resulted in unremarkable material, by which point they switched to working with producer Dave Eringa. Described as an indie punk album, 100 Broken Windows has been compared to R.E.M. and Hüsker Dü.", "Woomble had been enamored with bands such as June of 44 and Slint; Idlewild contacted Bob Weston and sent him some demos. Weston, who liked the demos, went to London to work with the band. Woomble said they had worked on a few tracks, \"but they were just so weird, and we weren't ready for that\". The band wanted direction, which they felt they were unable to due to Weston taking more of an engineer role instead of a producer. As their label Food Records disliked those songs, the band set about working with Dave Eringa, who had finished working with the Manic Street Preachers at Rockfield, and travelled to Jacob's to meet Idlewild.", "* Dave Eringa – producer, mixing (all except track 9), additional recording (track 12)", "Category:Albums produced by Dave Eringa"]}, {"page": "Gyroscope (band)", "response": ["Following a successful tour of South Africa, Gyroscope recorded their third major label studio album, Breed Obsession, in Liverpool during mid-2007. Dave Eringa (Idlewild, Manic Street Preachers) produced the material while mixing occurred in London. In September that year Gyroscope toured Australia supporting Fall Out Boy on that group's Australian leg of their Friends or Enemies Tour."]}, {"page": "A New Morning", "response": ["The group ultimately decided to work with Stephen Street, who was known for his collaborations with The Smiths and Blur. With Street, the band recorded most of the released material in two months. All the songs from the album were produced by Street, except \"Positivity\" which was produced by John Leckie, and \"You Belong to Me\" which was produced by Dave Eringa. Recording with Street began in January 2002, with the album finally being completed on 23 March 2002. Anderson had high praise for the producer, saying \"Stephen has just turned this whole album around, he really has. Every song he's just taken and done something special with... From the millions of other sessions we've done for this album, there's just no comparison.\"", "Category:Albums produced by Dave Eringa"]}, {"page": "Idlewild (band)", "response": ["Idlewild eventually returned to Edinburgh in 1999 to begin writing new songs, and contacted engineer Bob Weston, from Chicago, who recorded six songs with them in London. These songs held a more aggressive, emptier sound than those previously, and the band were pleased with the results; however, they remained unsure of their direction. During the summer, Idlewild were invited to play at the opening of the Scottish Parliament in Edinburgh, a momentous day for Scottish history. Scotland is where the band would remain for a while, letting the surrounding environment influence their songwriting and letting the songs represent the band as they were. Hitting a stride, the band returned to the studio with producer Dave Eringa and recorded \"Little Discourage\" and \"Roseability\" in their first session. Very happy with the results, the band continued to record what would become their second full-length album, 100 Broken Windows. The song \"Little Discourage\" was released in September and brought Idlewild a larger fan-base and much more radio play. Hope Is Important was released in America, and to support it, the band performed a small number of tour dates on the East Coast. The remainder of the year was spent mixing the new album in Glasgow.", "Idlewild eventually moved up to the highlands of Scotland and began the writing and demoing process of what would become The Remote Part. Both Allan and Jeremy joined the band in a cottage in Inchnadamph, Sutherland. Woomble began a friendship with Scottish Makar (poet laureate) Edwin Morgan who would eventually end up on the song \"Scottish Fiction,\" the album's closing track. The remainder of the year was spent recording and mixing the album in various locations with producer Dave Eringa. This period marked the band's longest absence from performing.", "The band spent many months writing new material, which was recorded with 100 Broken Windows and The Remote Part producer Dave Eringa in their rehearsal room. The album Make Another World was released on 5 March 2007 by 1960s label Sequel, which was reactivated by music group Sanctuary.. \"If It Takes You Home\" was the first single released from it and was available as a download and 7\" single. \"No Emotion\" was the second single released; it went to No. 36 in the UK Top 40 chart. \"A Ghost in the Arcade\" was the next single, released on 18 June, though only as an internet-downloadable track and not available on physical CD."]}, {"page": "Toploader", "response": ["By 1998, Toploader were picked up by S2 Records, a subsidiary of Sony Music, and signed a six-album deal. On 7 May 1999, the band made their first live TV performance on TFI Friday, hosted by Chris Evans. Later that same year their debut album, Onka's Big Moka, was released on 11 November and became a huge hit. It was produced by Dave Eringa, a long time collaborator of the Manic Street Preachers. It debuted at number five in the UK Albums Chart, until it settled at number four. \"Dancing in the Moonlight\" was the top single off the album, eventually reaching number seven in the UK Singles Chart, while \"Achilles Heel\" managed to get to number eight. They gained four nominations at the Brit Awards, despite never winning any of them. On 24 June 2000, Toploader attended the Glastonbury Festival, as part of the Saturday line-up."]}, {"page": "Warnings/Promises", "response": ["Warnings/Promises is the fourth studio album by Scottish rock band Idlewild, released on 7 March 2005 by Parlophone. Following the release of their third studio album The Remote Part (2002), Gavin Fox replaced bassist Bob Fairfoull, and touring guitarist Allan Stewart became a permanent member. They spent the majority of 2003 writing material, before traveling to Malmö, Sweden to record at Tambourine Studios with producer Dave Eringa. After finishing five tracks, they went to Los Angeles to work at Sunset Sound Recorders with producer Tony Hoffer. Due to the laidback nature of the sessions, the band had to re-record everything; recording concluded in October 2004. Described as an college rock and folk rock album, Warnings/Promises emphasized more acoustic instrumentation than its predecessor.", "Idlewild recorded with producer Dave Eringa and engineer Guy Massey at Tambourine Studios in Malmö, Sweden, where they had done five tracks. As their line-up had changed, and their songwriting had shifted, the band opted to record in a different location. Alongside this, they wanted a different producer than one they worked with on previous releases, when Tony Hoffer's name was suggested. They liked his work on Beck's albums; Hoffer proposed recording in California. Due to the favourable exchange rate, the band figured out that it would have cost the same to record there as it would have been in the UK. They travelled to Los Angeles, California to work with Hoffer and engineer Todd Burke in May 2004. The band spent some time at a rehearsal space in the city where they showed Hoffer the songs they had and deconstructed them. They rented a house in West Hollywood, California, and recorded at Sunset Sound Recorders. They spent their downtime traversing Big Sur and the Topanga Canyon. Hoffer drafted in additional musicians, such as Inara George and Greg Leisz, to enhance the recordings; George sung additional vocals on \"Love Steals Us from Loneliness\", \"I Want a Warning\", \"Too Long Awake\", and \"Goodnight\", while Leisz played pedal steel guitar on \"Goodnight\" and \"Disconnected\".", "* Dave Eringa – producer (track 4)", "Category:Albums produced by Dave Eringa"]}, {"page": "3 Colours Red", "response": ["Revolt (1999) was produced by Dave Eringa. At the peak of their success, following the band's biggest hit (the Vuckovic-penned \"Beautiful Day\") they embarked upon US tours with Marilyn Manson, Aerosmith and Silverchair. However, the group disbanded after the Reading and Leeds Festivals in 1999, citing musical and personal differences in a press release."]}, {"page": "Some Kind of Bliss", "response": ["\"Some Kind of Bliss\" is a song recorded by Australian recording artist Kylie Minogue, for her sixth studio album, Impossible Princess (1997). The song was released as the lead single from the album on 8 September 1997 through BMG, Deconstruction and Mushroom. Minogue co-wrote the track with James Dean Bradfield and Sean Moore while Bradfield and Dave Eringa produced it. Backed by guitar and drum instruments, \"Some Kind of Bliss\" is a Britpop track in which Minogue sings about feeling happy.", "\"Some Kind of Bliss\" was written by Minogue herself alongside Welsh performers James Dean Bradfield and Sean Moore, while the production was handled by Bradfield and Dave Eringa. It was recorded at Mayfair Studios, London, England in 1997, and was mixed by Alan Bremnar at Roundhouse Studios. It is a Britpop song with alternative rock and \"rock-tinged\" elements that lasts a duration of four minutes and thirteen seconds on the album. Instrumentally, \"Some Kind of Bliss\" features bass, electric and acoustic guitars, drums, string sections, flute, and a saxophone. Lyrically, the song is about Minogue's experiences while away from people and being happy, saying: \"To me the song is about being able, not necessarily shut your eyes and feel that someone is there but they way where you are close to someone [...] the ability to feel like they're with you even if they are a million miles away.\""]}, {"page": "Nine Black Alps", "response": ["Having spent much of 2008 writing new material, Nine Black Alps finished recording their third full-length album in February 2009 with producer Dave Eringa in North Wales' Bryn Derwen Studio."]}, {"page": "Lowgold", "response": ["Nude Records signed the band in late 1998 after watching one rehearsal. The band then set about recording their debut album with American producer Tony Lash. During the initial sessions at Chipping Norton Recording Studios it was agreed that Paul's heavier drumming style didn’t fit Lowgold so he left the band. Along with Ford, Lash took over drum duties for the album, with former Slowdive drummer Simon Scott joining the band after the main album sessions, appearing on \"Counterfeit\", a track recorded with Dave Eringa."]}, {"page": "Northern Uproar", "response": ["After a bidding war, the group eventually signed with Heavenly Records and in Monnow Valley Studio in Monmouth they recorded songs with Manic Street Preachers' James Dean Bradfield as producer and Dave Eringa as co-producer."]}, {"page": "A Hyperactive Workout for the Flying Squad", "response": ["A Hyperactive Workout for the Flying Squad is the seventh studio album by English rock band Ocean Colour Scene. It was originally due to be released in September 2004 but Sanctuary Records requested the band record a live album instead and it was eventually released on 21 March 2005. The album was produced by Dave Eringa and recorded at a hunting lodge near Kirriemuir, Scotland. The album's unusual title was a phrase the band heard on BBC Radio 4 and decided they liked. Critical reception to the album generally agreed that the album would please Ocean Colour Scene fans, although the album charted lower than previous albums at number 30 in the UK album chart compared to number 14 for the previous album North Atlantic Drift.", "Bassist Damon Minchella left the band in 2003. A Hyperactive Workout for the Flying Squad was recorded with producer Dave Eringa; the majority of sessions were held at Piersie Lodge in Kirriemuir, Scotland, while \"Wah Wah\" and \"Start of the Day\" were done at Battery Studios in London. Guy Massey acted as the main engineer, while Matt Hyde engineered \"Wah-Wah\". All recordings were mixed at Miloco Studios, also in London; Eringa mixed \"Everything Comes at the Right Time\", \"Wah Wah\", \"Move Things Over\", \"Have You Got the Right\", \"Start of the Day\", and \"My Time\", while Massey mixed the remainder. Howie Weinberg mastered the album at Masterdisk in New York City.", "* Dave Eringa – arranger, programmer, synthesizer (tracks 2, 5, 7 and 9), keyboards (tracks 4, 7, 9 and 10)", "* Dave Eringa – producer, mixing (tracks 1, 3, 7 and 11–13)", "Category:Albums produced by Dave Eringa"]}, {"page": "The Great Western", "response": ["* Dave Eringa – keyboards", "Category:Albums produced by Dave Eringa"]}, {"page": "With the Tides", "response": ["* Dave Eringa – synthesizer, mellotron, organ", "* Dave Eringa – production, mixing"]}, {"page": "Johnny Boy (album)", "response": ["Category:Albums produced by Dave Eringa"]}, {"page": "Well Well Well (album)", "response": ["Category:Albums produced by Dave Eringa"]}, {"page": "Manic Street Preachers discography", "response": ["|Dave Eringa"]}, {"page": "Onka's Big Moka", "response": ["Onka's Big Moka is the debut studio album by English band Toploader. It was released on 11 November 1999, through S2 Records. And produced by long time collaborator of the Manic Street Preachers, Dave Eringa. The album reached the Top 5 of the UK Albums Chart at number 4, where it stayed for six months."]}, {"page": "A Modern Way of Letting Go", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "Make Another World", "response": ["Make Another World was recorded at Sub Station in Rosyth, with producer and engineer Dave Eringa. He later mixed the recordings at Strongroom in London, before the album was mastered by Howie Weinberg at Masterdisck in New York.", "* Dave Eringa – producer, engineer, mixing", "Category:Albums produced by Dave Eringa"]}, {"page": "Bloodline (Recoil album)", "response": ["Bloodline is the third album by Recoil, released April 14, 1992. It was recorded at Konk Studio in London, during sessions that lasted from January to March 1991, being mixed later that same year. The album was produced by Alan Wilder, engineered by Steve Lyon, and assisted by Dave Eringa.", "* Dave Eringa – engineering assistant"]}, {"page": "Send Away the Tigers", "response": ["Category:Albums produced by Dave Eringa"]}, {"page": "Your Love Alone Is Not Enough", "response": ["Category:Song recordings produced by Dave Eringa"]}, {"page": "Revolt (3 Colours Red album)", "response": ["It was recorded at Rockfield Studios with producer Dave Eringa (Manic Street Preachers) and saw the band adopting a more polished and commercial sound. The album reached number 17 on the UK album chart when it was released on Creation Records in 1999, but the band split at their peak after releasing only 2 singles from it, both of which entered the UK top 40. An additional EP, Paralyse, was released prior to the album but was not eligible for the singles chart as the EP contained more than the maximum number of songs allowed.", "* Dave Eringa- Producer", "Category:Albums produced by Dave Eringa"]}, {"page": "Not Enough Night", "response": ["Category:Albums produced by Dave Eringa"]}, {"page": "Beautiful Day (3 Colours Red song)", "response": ["* Dave Eringa- Producer", "Category:Song recordings produced by Dave Eringa"]}, {"page": "Failsafe (UK band)", "response": ["Failsafe were an English melodic rock band formed in 2000. They are based in and around Preston, Lancashire, England. They released three albums independently, with their third produced by Dave Eringa."]}]}}