{"wiki_id": "http://www.wikidata.org/entity/Q5229365", "itemLabel": "Dave McPherson", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_McPherson_(musician)", "wikipedia_page": {"main": "Dave McPherson is an English singer, songwriter, guitarist and sometimes rapper from Harold Wood, London. He is best known as the frontman of the British rock band InMe. He is also the lead vocalist of the electronic metal band Centiment as well as a solo artist both under his own name and under his rap alias MC PhD.", "link_mentions": [{"page": "InMe", "response": ["The group originally formed as Drowned in 1996 when many of the band were just 14 years old. The members of the band at that time were Dave McPherson as guitarist / vocalist, Joe Morgan as bassist / backing vocalist and Simon Taylor as drummer. They played several local venues, getting their first interviews and airplay on Brentwood-based radio station, Phoenix FM. They recorded many unreleased tracks such as \"acid drop\" and \"apricot\"  The band scored their break when a scout from MFN caught the end of one of their sets, whilst attending a gig to see another band. They signed with MFN in 2001, and changed their name to InMe to avoid confusion with Drowned, an American Christian rock band of the same name.", "As was frequently confirmed by Dave McPherson on social networking site Facebook as well as on the microblogging site Twitter, InMe planned to spend the early part of 2011 working on their fifth album, which was planned for release in February 2012. The album is to be supported by a PledgeMusic campaign launching on 25 November 2011. The album exhibits  a completely different sound to its predecessor Herald Moth and has been described was \"euphoric, uplifting and very positive\" both by Dave McPherson and lead guitarist Gazz Marlow in the buildup to the album's release. In November 2011 'A Great Man' was released as a free download single via Pledge Music."]}, {"page": "Lynmouth", "response": ["The British technical modern rock band InMe make recurring references to the Lynton/Lynmouth area in their lyrical material. Lynton is mentioned in \"In Loving Memory\" on their third album Daydream Anonymous, and Lynmouth is mentioned in \"Saccharine Arcadia\" on Phoenix: The Very Best of InMe. Lead singer Dave McPherson also has a song entitled \"Sunny Lynton\" on his EP Crescent Summer Sessions and refers to Watersmeet in \"Waltzing in a Supermarket\" on I Don't Do Requests."]}, {"page": "McPherson", "response": ["* Dave McPherson (musician), English singer and guitarist for rock band InMe and drummer for metal band Centiment"]}, {"page": "Download Festival", "response": ["Dave McPherson", "Dave McPherson "]}, {"page": "List of guitarists", "response": ["*Dave McPherson (InMe)"]}, {"page": "White Butterfly (album)", "response": ["While the band's style of music is still evident in White Butterfly, their sound has changed significantly since Overgrown Eden. Dave McPherson's vocals lack the raspy angst that can be heard on the previous album and he now sings in a softer, cleaner tone. Several songs on White Butterfly also contain multiple chorused vocals that are evident in songs as \"So You Know\" and \"Faster the Chase\", and one song that is sung almost entirely by Joe Morgan, \"Almost Lost\". The album also has a lighter tone compared to the considerably darker mood of Overgrown Eden which almost had a metal-type sound to it. This would also be the last InMe studio album that would feature Joe Morgan."]}, {"page": "David McPherson", "response": ["*Dave McPherson (footballer) (born 1964), former Scottish international footballer", "*Dave McPherson (musician) (born 1982), English rock musician"]}, {"page": "Bloodstock Open Air", "response": ["Dave McPherson"]}, {"page": "Daydream Anonymous", "response": ["On 7 December 2006, the band announced over MySpace that their new album will be called Daydream Anonymous. They also placed four demos on their MySpace page: \"Myths and Photographs\", \"I Won't Let Go\", \"Soldier\" and \"Raindrops on Stones\", all recorded using Dave McPherson's Mac."]}, {"page": "Crescent Summer Sessions", "response": ["#REDIRECT Dave McPherson (musician)"]}, {"page": "Brentwood, Essex", "response": ["* Dave McPherson - musician"]}, {"page": "Herald Moth", "response": ["On 5 October 2007, lead singer Dave McPherson announced on his personal MySpace that in the next few months he will be working on a new album for InMe. From his blog:", "All songs written by Dave McPherson and InMe", "* Dave McPherson – vocals, guitar", "*Dave McPherson (normally on vocals/guitars) – drums/vocals"]}, {"page": "Y Not Festival", "response": ["*Dave McPherson"]}, {"page": "Bingley Music Live", "response": ["*Dave McPherson"]}, {"page": "Pledge: A Tribute to Kerbdog", "response": ["#Dave McPherson - J.J.'s Song (5:10)"]}, {"page": "All Terrain Vehicle/Nova Armada", "response": ["The digital download was released on 6 June 2010 via all major download retailers (iTunes, Amazon, Play.com, 7Digital). All versions of the release contain the first 4 tracks listed (All Terrain Vehicle, Nova Armada and the two alternate versions). However, the iTunes release also contains the previously unreleased track \"Ophion Luteus\", a song recorded during the Herald Moth sessions (the only InMe track recorded by an alternate line up consisting of Dave McPherson on Drums/Vocals, Greg McPherson on Guitar, Ben Konstantanovic on Guitar and Simon Taylor on Bass Guitar)."]}, {"page": "Phoenix: The Very Best of InMe", "response": ["On their \"All Terrain Armada\" tour in May/June 2010, InMe frontman Dave McPherson stated both on stage and in interviews conducted on the tour that the band had started learning older material from their first two albums (Overgrown Eden and White Butterfly) to support a 'best of' release which would follow in the winter.", "All songs arranged by Dave McPherson. Music by InMe.", "* Dave McPherson – vocals, guitar on tracks 1–15."]}, {"page": "You and What Army", "response": ["In 2010, You And What Army played at Download Festival, T in the Park, Sonisphere, Underage Festival and Hevy Music Festival and toured with Kids in Glass Houses, and Boys Like Girls. You and What Army has also performed with Hadouken!, Chase and Status, Tempah T, My Passion, Goldie Lookin Chain, Dave McPherson, and Silent Descent."]}, {"page": "The Hardship Diaries", "response": ["The Hardship Diaries is the debut full-length solo release from InMe frontman Dave McPherson. The album was released on April 10, 2011, through PledgeMusic and Graphite Records.", "All songs written and performed by Dave McPherson.", "* Dave McPherson — vocals, guitar, programming and arrangements.", "Category:Dave McPherson (musician) albums"]}, {"page": "The Pride (album)", "response": ["The development of the album started as early as 2009. Dave McPherson wrote a whole album's worth of material more in the vein of Herald Moth's technical metal style but scrapped all but two songs, which feature on the band's best of compilation.", "All songs/lyrics written by Dave McPherson. All music by InMe.", "* Dave McPherson – vocals, guitar"]}, {"page": "2011 in British music", "response": ["*10–12 June – The Download Festival 2011 takes place at Donington Park. The main stage is headlined by Def Leppard, System of a Down and Linkin Park, the second stage by Pendulum, Alice Cooper and Rob Zombie, the Pepsi Max stage by Danzig, Funeral for a Friend and Frank Turner, the Red Bull Bedroom Jam stage by Modestep, Dangerous! and H.E.A.T., and the Jägermeister Acoustic stage by Skindred, Bowling for Soup and Dave McPherson."]}, {"page": "Trilogy: Dawn", "response": ["Frontman Dave McPherson states that the original idea to release three thematically linked albums struck him during the recording of the band's 5th album, The Pride, in 2011. Each album will have a different sound and theme. Trilogy: Dawn deals with the concept of birth, youth and childhood and is an alternative rock album.", "*Dave McPherson - Vocals, guitars, programming"]}]}}