{"wiki_id": "http://www.wikidata.org/entity/Q522966", "itemLabel": "Jamie Hewlett", "itemDescription": "English comic book artist, designer, and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Hewlett", "wikipedia_page": {"main": "Jamie Christopher Hewlett (born 3 April 1968) is an English artist and director. He is the co-creator of the comic book Tank Girl with Alan Martin and co-creator of the virtual band Gorillaz, alongside Blur frontman Damon Albarn.", "link_mentions": [{"page": "April 3", "response": ["*  1968   – Jamie Hewlett, English director and performer"]}, {"page": "Gorillaz", "response": ["Gorillaz are an English virtual band created in 1998 by musician Damon Albarn and artist Jamie Hewlett, from London, England. The band primarily consists of four animated members: 2-D (vocals, keyboards), Murdoc Niccals (bass guitar), Noodle (guitar, keyboards, vocals), and Russel Hobbs (drums). Their fictional universe is presented in music videos, interviews and short cartoons. Gorillaz' music often features collaborations with a wide range of featured artists, with Albarn as the only permanent musical contributor.", "Musician Damon Albarn and comic artist Jamie Hewlett met in 1990 when guitarist Graham Coxon, a fan of Hewlett's work, asked him to interview Blur, which Albarn and Coxon had recently formed. The interview was published in Deadline magazine, home of Hewlett's comic strip Tank Girl. Hewlett initially thought Albarn was \"arsey, a wanker;\" and despite becoming acquaintances with the band, they often did not get on, especially after Hewlett began seeing Coxon's ex-girlfriend Jane Olliver. Despite this, Albarn and Hewlett started sharing a flat on Westbourne Grove in London in 1997. Hewlett had recently broken up with Olliver and Albarn was at the end of his highly publicised relationship with Justine Frischmann of Elastica.", "Albarn and Hewlett's next project together was the opera Monkey: Journey to the West based on the classical Chinese novel Journey to the West, which premiered at the 2007 Manchester International Festival. While not officially a Gorillaz project, Albarn mentioned in an interview that the project was \"Gorillaz, really but we can't call it that for legal reasons\".Jamie Hewlett : The Gorillaz-Unofficial 2008 Interview ", "* Jamie Hewlett – songwriting, executive production, artwork, character design, video direction, visuals, FX (1998–present)", "  bar:jamie  text:Jamie Hewlett"]}, {"page": "Terry Gilliam", "response": ["It was rumoured that Gilliam may direct or be involved in the production of the animated band Gorillaz movie. In a September 2006 interview with Uncut, Damon Albarn was reported to have said, \"we're making a film. We've got Terry Gilliam involved.\" However, in a more recent interview with Gorillaz-Unofficial, Jamie Hewlett, the co-creator of the band, stated that since the time of the previous interview, Damon's and his own interest in the film had lessened. In an August 2008 Observer interview, Gorillaz band members Albarn and Hewlett revealed the nature and title of the project, Journey to the West, a film adaptation of the opera of the same name, based on a 16th-century Chinese adventure story also known as Monkey.Monkey magic, The Observer, 10 August 2008 In January 2008, while on set of The Imaginarium of Doctor Parnassus, Gilliam stated that he was looking forward to the project, \"But I'm still waiting to see a script!\""]}, {"page": "2000 AD (comics)", "response": ["2000 AD gained an influx of talent from other comics. Garth Ennis and John Smith had come to prominence writing for Crisis, a 2000 AD spin-off for older readers, while artists Jamie Hewlett and Philip Bond were the stars of Deadline, an independent comics and popular culture magazine founded by Steve Dillon and Brett Ewins. Smith created Indigo Prime, a multi-dimensional organisation that polices reality, whose most memorable story was \"Killing Time\", a time travel story featuring Jack the Ripper. Garth Ennis and Philip Bond contributed Time Flies, a time-travel comedy, and Hewlett was paired with writer Peter Milligan for the surreal Hewligan's Haircut. Writer John Tomlinson and artist Simon Jacob created Armoured Gideon, an action-comedy series about a giant killer robot charged with keeping demons from invading earth.", "* Jamie Hewlett"]}, {"page": "Blur (band)", "response": ["After 13 and the subsequent tours in 1999–2000, band members pursued other projects. Graham Coxon recorded a string of solo albums, while Damon Albarn dedicated his time to Gorillaz, the animated band he had created with Jamie Hewlett. Alex James worked with Fat Les and co-wrote several songs with Sophie Ellis-Bextor and Marianne Faithfull.Mulholland, Garry. \"Special relationships\". The Observer. 21 September 2003. Retrieved 21 August 2012.\"What have Blur been up to?\". BBC News. 9 December 2008. Retrieved 10 January 2014."]}, {"page": "Damon Albarn", "response": ["Albarn formed the virtual band Gorillaz in 1998 with comic book artist Jamie Hewlett. Drawing influences from hip hop, dub, pop, trip hop and world music, Gorillaz released their self-titled debut album in 2001 to worldwide success, spawning successful follow-ups Demon Days (2005), Plastic Beach, The Fall (both released in 2010), Humanz (2017), The Now Now (2018) and the first season of their Song Machine project, Song Machine, Season One: Strange Timez (2020). Although Albarn is the only permanent musical contributor, Gorillaz albums typically feature collaborations from a range of artists. Gorillaz are cited by the Guinness Book of World Records as the \"Most Successful Virtual Band\".", "Albarn and Jamie Hewlett met in 1990 when Coxon, a fan of Hewlett's work, asked him to interview Blur. The interview was published in Deadline magazine, home of Hewlett's comic strip, Tank Girl. Hewlett initially thought Albarn was \"arsey, a wanker\", and despite becoming one of the band's acquaintances, Hewlett often did not get on with its members, especially after he started going out with Coxon's ex-girlfriend, Jane Olliver. Nonetheless, Albarn and Hewlett started sharing a flat on Westbourne Grove in London in 1997. Hewlett had recently broken up with Olliver and Albarn was also at the end of his highly publicised relationship with Frischmann.", "In November 2001, shortly after the invasion of Afghanistan in response to September 11 attacks, the MTV Europe Music Awards were held in Frankfurt, where Gorillaz won awards for Best Song and Best Dance. As Albarn and Jamie Hewlett walked onto stage to make a speech after receiving the latter award, Albarn wore a T-shirt with the Campaign for Nuclear Disarmament logo on it. In his speech, he said \"So, fuck the music. Listen. See this symbol here, [pointing to the T-shirt] this the symbol for the Campaign for Nuclear Disarmament. Bombing one of the poorest countries in the world is wrong. You've got a voice and you have got to do what you can about it alright?\""]}, {"page": "Comic Relief", "response": ["Various items of merchandise have been sold to promote and raise money for Comic Relief. In 1991, The Totally Stonking, Surprisingly Educational And Utterly Mindboggling Comic Relief Comic was published by Fleetway. Conceived, plotted and edited by Neil Gaiman, Richard Curtis, Grant Morrison and Peter K. Hogan, it featured contributions from a vast array of British comics talent, including Jamie Delano, Garth Ennis, Dave Gibbons, Mark Millar, Simon Bisley, Mark Buckingham, Steve Dillon, D'Israeli, Jamie Hewlett and Bryan Talbot. (Alan Moore, arguably Britain's most famous comics writer, was not credited as working on the book having sworn never to work for Fleetway again, but was said to have worked with partner Melinda Gebbie on her pages.) The comic was unique in that it featured appearances by characters from across the spectrum of comics publishers, including Marvel and DC superheroes, Beano, Dandy, Eagle and Viz characters, Doctor Who, the Teenage Mutant Ninja Turtles, in addition to a cavalcade of British comedy figures (both real and fictional).  These were all linked by the twin framing narratives of the Comic Relief night itself, and the tale of \"Britain's meanest man\" Sir Edmund Blackadder being persuaded to donate money to the event. The comic \"sold out in minutes\", raising over £40,000 for the charity, and is now a highly prized collectors' item. Comic Relief have also sold Fairtrade Cotton Socks from a number of vendors. This is mainly for their Sport Relief charity."]}, {"page": "Jessica Hynes", "response": ["Hynes co-wrote the pilot Phoo Action, based on the cartoons of Jamie Hewlett, which was transmitted on BBC Three in early 2008. In the same year, Hynes appeared in the film Faintheart and in a revival of Alan Ayckbourn's The Norman Conquests at the Old Vic. In 2009 she made her Broadway début in the play's transfer and was nominated for a Tony Award for her performance. Hynes stated that she planned to pursue a solo career as a stand-up comedian and was working on a children's book, Ants in the Marmalade. Later that year, she returned to the Royal Court in The Priory, a new play by Michael Wynne."]}, {"page": "Worthing", "response": ["In the visual arts, painter Copley Fielding lived at 5 Park Crescent in the mid-18th century. and more recently Jamie Hewlett and Alan Martin created cult comic figure Tank Girl while at college in the town in the 1980s./  The town has a famous work by sculptor Elisabeth Frink. Uniquely in England, Desert Quartet (1990), Frink's penultimate sculpture, was given Grade II* listing in 2007, less than 30 years from its creation. It may be seen on the building opposite Liverpool Gardens.  Hand-painted by Gary Bevans over more than five years, English Martyrs' Catholic Church in Goring has the world's only known reproduction of Michelangelo's Sistine Chapel ceiling."]}, {"page": "Tank Girl", "response": ["Tank Girl is a British comic book character created by Alan Martin and Jamie Hewlett, and first appeared in print in 1988 in the British comics magazine Deadline. After a period of intense popularity in the late 1980s and early 1990s, Tank Girl inspired a 1995 feature film. After a long hiatus, the character returned to comics in 2007 and has appeared regularly in the years since. ", "| Alan C. Martin and Jamie Hewlett", "| Alan C. Martin and Jamie Hewlett", "| Alan C. Martin and Jamie Hewlett", "| Peter Milligan and Jamie Hewlett", "| A fiction text novel with cover art by Jamie Hewlett", "| Alan C. Martin and Jamie Hewlett", "| Jamie Hewlett and Alan C. Martin", "| Alan C. Martin, Jamie Hewlett, Brett Parson, Craig Knowles, Jim Mahfood, Jonathan Edwards, Philip Bond, and Warwick Johnson-Cadwell", "| Alan C. Martin, Jamie Hewlett, Ashley Wood, and Brett Parson", "| Alan C. Martin, Jamie Hewlett, and Brett Parson", "| Jamie Hewlett and Alan C. Martin", "| Jamie Hewlett and Alan C. Martin", "| Jamie Hewlett and Alan C. Martin", "* The Nao Of Brown – Glyn Dillon (Jamie Hewlett collaborator) blog", "* Jamie Hewlett interview about influences"]}, {"page": "Think Tank (Blur album)", "response": ["Although Blur had been associated with the Britpop movement, they had experimented with different musical styles more recently, beginning with Blur (1997) which had been influenced by indie rock bands under the suggestion of guitarist Graham Coxon. Since the mid to late 1990s, Blur's members had been working on other projects as well as Blur: Albarn had co-created Gorillaz, a virtual band in 1998 with comic artist Jamie Hewlett whom Albarn had met through Coxon. Gorillaz' 2001 debut was financially successful and received critical acclaim. Since composing the Blur song, You're So Great, Coxon had started a solo career and as of 2001 had released three solo albums. The members differing musical interests had alienated some of the band members, with Coxon explaining, \"we're all very concerned for each other and we do genuinely like each other an awful lot. Because we're into so much different stuff, it becomes daunting.\" Nevertheless, Coxon, along with Alex James and Dave Rowntree were keen for a new album, whilst Albarn was more reluctant."]}, {"page": "MTV Video Music Award for Best Art Direction", "response": ["No performer has won a Moonman in this category for their work as an art director. Jamie Hewlett (\"Clint Eastwood\"), Jack White (\"Would You Fight for My Love?\"), SZA (\"The Weekend\"), and ASAP Rocky (\"Babushka Boi\") are the only performers to have been nominated as their videos' art directors in this category."]}, {"page": "Jamie-Hewlett", "response": ["#REDIRECT Jamie Hewlett"]}, {"page": "13 (Blur album)", "response": ["After his breakup, Albarn started sharing a flat with artist Jamie Hewlett whom he had met through Coxon. Around this time, Albarn had started to broaden his musical output. Whilst he was working on 13, there were various reports that he and Hewlett were working on a secret project, which turned out to be Gorillaz, a virtual band. Albarn also started working on film soundtracks, including Ravenous, Ordinary Decent Criminal and 101 Reykjavík."]}, {"page": "Peter Milligan", "response": ["By 1989 Milligan was swapping between strips such as \"Bad Company\", while still writing material in 2000AD, such as \"Hewligan's Haircut\" with artist Jamie Hewlett. Milligan and artist Jim McCarthy created the Steve Ditko-inspired \"Bix Barton\". This was first run as a black and white strip for its first outing, \"Barton's Beasts\"; the second strip was called \"Carry On Barton\" (originally \"Carry On Snuffing\"). The strip was very popular and was a precursor of \"Devlin Waugh\" and others.", "Milligan and artist Mike Deodato launched the Elektra series for Marvel Comics in November 1996. Milligan spent the remainder of the decade writing one-off specials such as Face and The Eaters, or miniseries like Egypt and Tank Girl The Odyssey (with its co-creator Jamie Hewlett providing art), as well as acting as advisory editor to Paul Honeyford's Fighting Figurines. Milligan and Brendan McCarthy's psychedelic comic Rogan Gosh was reprinted in a collected edition by Vertigo in 1996, after being first serialised six years earlier in Revolver."]}, {"page": "Side project", "response": ["* Gorillaz, a virtual band composed of four fictional animated band members, created by Damon Albarn from Blur, and Jamie Hewlett, the co-creator of the comic book Tank Girl."]}, {"page": "Gorillaz (album)", "response": ["Musician Damon Albarn and comic book creator Jamie Hewlett met in 1990 when guitarist Graham Coxon, a fan of Hewlett's work, asked him to interview Blur, a band Albarn and Coxon had recently formed. The interview was published in Deadline magazine, home of Hewlett's comic strip, Tank Girl. Hewlett initially thought Albarn was \"arsey, a wanker\"; despite becoming acquaintances with the band, they often did not get on, especially after Hewlett began seeing Coxon's ex-girlfriend Jane Olliver. Despite this, Albarn and Hewlett started sharing a flat on Westbourne Grove in London in 1997. Hewlett had recently broken up with Olliver and Albarn was at the end of his highly publicised relationship with Justine Frischmann of Elastica.", "In March 2021, to celebrate the 20th anniversary of the album's release, a vinyl box set was announced. The first edition of the boxset, which was exclusive to the band's webstore, was released on 10 December 2021. The boxset includes previously released material, including the original album, the B-sides compilation album G-Sides, and the remix album Laika Come Home (which received its first reissue since its initial press) and previously unreleased material, including live performances from the 2001 London Forum concert and five demos. Additionally, it also includes notes and early sketches by Jamie Hewlett during the making of the album. Later editions will also be released in 2022.", "* Jamie Hewlett – artwork"]}, {"page": "MTV Europe Music Awards", "response": ["2001: The ceremony was the first entertainment broadcasts following the September 11th attacks in New York City. When Damon Albarn and Jamie Hewlett from Gorillaz walked onto stage to make a speech, Albarn sported a T-shirt with the Campaign for Nuclear Disarmament logo on it. Albarn, in a response to the recent invasion of Afghanistan said \"So, fuck the music. Listen. See this symbol here, [pointing to the tee shirt] this the symbol for the Campaign for Nuclear Disarmament. Bombing one of the poorest countries in the world is wrong. You've got a voice and you have got to do what you can about it allright?\" Fred Durst took the stage with Wes Scantlin and Jimmy Page to perform the classic Led Zeppelin's song \"Thank You\"."]}, {"page": "Deadline (magazine)", "response": ["Deadline enjoyed the patronage of those who would not normally purchase comics and the support of several key bands of the time, with Blur making regular appearances in the Tank Girl strips (Tank Girl artist Jamie Hewlett was good friends with Blur's Damon Albarn), and covers including Ride, Curve, Carter USM and the Senseless Things. However, the commercial failure of the Tank Girl film and the crossing over of the alternative scene into the mainstream (around the time of Britpop, a movement it had helped to champion) saw the magazine eventually fold at the end of 1995. ", "* Tank Girl, created by the young team of writer Alan Martin and artist Jamie Hewlett"]}, {"page": "The Powerpuff Girls Movie", "response": ["The crew was against including pop songs or any musical numbers that would interfere \"in the body of the story\" in order to respect audience expectations. However, the end credits are accompanied by a punk rock version of the series' ending theme by Bis, as well as \"Pray for the Girls\" by Frank Black and \"That's What Girls Do\" by No Secrets. James L. Venable, who worked on the television series, composed the film's score, blending traditional orchestration with electronica. Venable had listened to \"old monster movie scores\" and acts such as the Chemical Brothers and Propellerheads for inspiration in developing the series' musical style, which was then poured into the movie. McCracken thought the band Gorillaz would be fitting to perform the film's ending credits song, considering that the plot was about \"evil monkeys attacking Townsville\" and that the band members are animated. Gorillaz creators Jamie Hewlett and Damon Albarn showed interest in composing the song, but their schedule made it impossible to accomplish."]}, {"page": "Frankenstein Girls Will Seem Strangely Sexy", "response": ["The cover of the album was drawn by Jamie Hewlett, the artist known for Tank Girl and Gorillaz. Hewlett offered to make a music video for a song on the album but was rejected by Elektra."]}, {"page": "Demon Days", "response": ["Demon Days is the second studio album by British virtual band Gorillaz. It was first released on 11 May 2005 in Japan and on 23 May 2005 in the United Kingdom by Parlophone and in the United States by Virgin Records. Produced by the band, Danger Mouse, Jason Cox, and James Dring, the album features contributions from De La Soul, Neneh Cherry, Martina Topley-Bird, Roots Manuva, MF Doom, Ike Turner, Bootie Brown of the Pharcyde, Shaun Ryder, and Dennis Hopper. As with the band's eponymous 2001 debut, the release of Demon Days and its respective live performances were both accompanied by various multimedia, including interactive features on the Gorillaz website, a total of four animated music videos, and animatics for select videos. Almost all visuals associated with the album were designed by Gorillaz co-creator Jamie Hewlett, under his design company Zombie Flesh Eaters.", "While Jamie Hewlett was working with his team on a script for a possible Gorillaz movie, Damon Albarn was still recording Think Tank with Blur. By the time Albarn was ready to start writing and recording material for the Gorillaz movie, the whole idea had already been scrapped, although ideas from the movie's script were still used, including the themes of being driven by ego and the world being trapped in an endless night. Despite this, the album's main source of inspiration actually came about as a result of Albarn's train journey from Beijing to Mongolia where he, his partner and six-year-old daughter spent a day travelling through what Albarn describes as a \"weird, unspoken, forgotten part of China. It was basically dead trees as far as the eye can see,\" Albarn recalls. \"Dust bowls, loose earth rapidly turning into desert. There are little satellite towns in the middle of these semi deserts that are absolutely on their knees. And it's the size of Europe this area. And then you wake up in the morning with this nightmare in your head and it's blue sky and beautiful sand, which looks fantastic now but was probably something else millions of years ago. And that will happen to us in our lifetime.\""]}, {"page": "Senseless Things", "response": ["Cover art for the first two Senseless Things albums and most single releases around the same period was provided by comic artist Jamie Hewlett, creator of Tank Girl and later Gorillaz."]}, {"page": "Virtual band", "response": ["Britain's Gorillaz was formed by Blur's Damon Albarn and Tank Girls Jamie Hewlett in 1998 and produced by Deltron 3030's Dan the Automator. The group brought virtual bands to the musical fore again, with their scoring numerous Top 20 positions around the world. The band has since released seven studio albums in addition to two B-sides albums and two EPs."]}, {"page": "List of Vertigo Comics publications", "response": ["|Jamie Hewlett"]}, {"page": "Feel Good Inc.", "response": ["The main themes of the video are intellectual freedom and the media's dumbing down of mass culture. Jamie Hewlett said in an interview that the inspiration for some scenes in the video came from Hayao Miyazaki; specifically, the windmill-powered landmass, which has been compared to that of Miyazaki's Castle in the Sky.", "* Jamie Hewlett – director", "Category:Songs written by Jamie Hewlett"]}, {"page": "Dare (song)", "response": ["The video was directed by Jamie Hewlett and Pete Candeland. The video was leaked a few days prior to its 17 July 2005 release on the official Gorillaz website. The video was later recalled from other websites and the final scene was tweaked slightly; Murdoc's Confederate Naval Jack flag was replaced with that of the Jolly Roger. (The version with the Naval Jack is played in some countries, including Canada.)", "Category:Songs written by Jamie Hewlett"]}, {"page": "Tomorrow Comes Today", "response": ["Directed by Jamie Hewlett, the video for the title track consists mainly of static drawings of the band members placed against real photographs and time-lapsed video footage of London streets. Some of the drawings are animated, especially the ones featuring 2-D singing. This is due to the video having an extremely short deadline compared to its follow-up \"Clint Eastwood\". The video finishes with the four band members, and 2-D's headache pills, flying across the screen during a fast-motion shot of a tunnel. Graffiti artwork by Banksy can be seen halfway through the video. Trellick Tower is also seen, known for being the birthplace of Gorillaz and where creators of the band Jamie Hewlett and Damon Albarn met.", "Category:Songs written by Jamie Hewlett"]}, {"page": "Clint Eastwood (song)", "response": ["The animated music video was directed by Jamie Hewlett and Pete Candeland. It starts with the Gorillaz logo in red against a black screen, and the following quote from the 1978 film Dawn of the Dead: \"Every dead body that is not exterminated, gets up and kills. The people it kills, get up and kill\" in Japanese then in English. This phrase was deemed offensive in some countries and a censored version was produced that omits this intro. The video and song name is a reference to the famous western starring actor Clint Eastwood, The Good, the Bad and the Ugly. An interpolation of the yell from the film's theme song, in particular that film's protagonist Tuco's leitmotif, can be heard at the beginning of the video, followed by sinister laughter from Murdoc. The notes that the melodica plays are also based on the yell.", "Category:Songs written by Jamie Hewlett"]}, {"page": "19-2000", "response": ["\"19-2000\" released was accompanied by a completely new version of the song, called the \"Soulchild Remix\", which was produced by music producers Damien Mendis and Stuart Bradbury. Mendis was asked to remix a track off the album in the hope that it would give it crossover potential, in the same way as the Ed Case remix of \"Clint Eastwood\" had. Mendis was given a copy of all their demos and finished tracks for the album, being told to \"pick [a song] that you can produce, remix or whatever into a hit single\". Mendis was unsure which track to choose, and only when he was told that Jamie Hewlett was already working on the video for \"19-2000\", did he make his decision. Tina Weymouth and Miho Hatori contributed backing vocals to \"19–2000\", whilst Damon Albarn performed the vocals on the verses.", "The video, directed by Jamie Hewlett and Pete Candeland, is animated, both in 2-D and 3-D. It features Gorillaz riding in their Geep (as mentioned in the 2005 MTV Cribs episode, featuring the Gorillaz) along a twisted highway, encountering roller coaster style loops, a killer UFO, and – when Murdoc decides not to take an exit leading toward a church – a giant moose. Murdoc tries to blow up the moose with a pair of missiles, but the moose sneezes right before impact, sending them back to the car, which explodes and skids along the highway on fire. The members of Gorillaz appear to have black ash all over them from the blast. In between these various encounters the Gorillaz pass and perform things in time with the rhythm—such as a field of nodding donkeys, or the light posts passing them at the beginning, and a couple of sections where the buggy does several versions of the wheelie (including side wheelies, otherwise known as Skiing) and even appears to break the sound barrier. There are two versions of this video, one to fit the original mix and one to fit the Soulchild remix. The videos are almost identical, except for a few minor changes in order for the two songs to sync up with the video. On the motorway, there are signs to Amity, a reference to Jaws, the Overlook Hotel, a reference to The Shining, and Camp Crystal, a reference to Friday the 13th. It was shown in the MTV Cribs tour of Kong Studios that the buggy actually survived the blast, and now sits in the Kong Studio's parking lot.", "Category:Songs written by Jamie Hewlett"]}, {"page": "Rock the House (Gorillaz song)", "response": ["The music video for \"Rock the House\" was directed by Jamie Hewlett and Pete Candeland. The inspiration for the video is said to have come from Hewlett's angst at the time, as the band was going through the process of being sued by another band named Monkey Tennis, nicknamed the Doppelgangerz in Rise of the Ogre, who claimed that Gorillaz was a stolen idea.", "Category:Songs written by Jamie Hewlett"]}, {"page": "A1 (comics)", "response": ["* King Pant, Philip Bond and Jamie Hewlett", "* Mr X: \"Windows\", panels by Nick Abadzis, Mark Badger, Simon Bisley, Brian Bolland, Philip Bond, Bob Burden, Paul Chadwick, Brett Ewins, Mark Farmer, Dave Gibbons, Paul Grist, Jamie Hewlett, John Higgins, Michael Kaluta, David Lloyd, Ted McKeever, Mike Mignola, Kev O'Neill, Paul Rivoche, William G. Simpson, Bryan Talbot, Charles Vess and Matt Wagner", "* Hellcity, Alan Martin and Jamie Hewlett", "* Tank Girl: \"She's Fucking Great\", Jamie Hewlett", "* Hell City II, Alan Martin and Jamie Hewlett", "* King Leon (Part One), Peter Milligan and Jamie Hewlett", "* King Leon (Part Two), Peter Milligan and Jamie Hewlett", "* King Leon (Part Three), Peter Milligan and Jamie Hewlett"]}]}}