{"wiki_id": "http://www.wikidata.org/entity/Q5228711", "itemLabel": "Dave Early", "itemDescription": "British drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Early", "wikipedia_page": {"main": "Dave Early (5 April 1957 – 14 October 1996) was an English drummer and percussionist. He was best known as the original drummer for Sade. He also worked with Chris Rea, Van Morrison, The Chieftains, Mary Black, Ananta, and others. Later he moved to Belfast, where he played with traditional Irish artists. He frequently worked with drummer-percussionist Martin Ditcham. He was originally with a band called Rookie in 1975/76 with (Gary Stoner, David Knipe and Ian Nix) they were managed by Henri Henroid.\nHe was the son of Henry and Gladys Early, he had two older brothers, John and William Early.\nHe died in a car accident in Ireland in 1996.", "link_mentions": [{"page": "The Hee Bee Gee Bees", "response": ["Two albums were subsequently released under the Hee Bee Gee Bees name, featuring parodies of various pop groups that had originally been featured on the Radio Active. Tracks included parodies of Supertramp (\"Scatological Song\" by Supertrash), Michael Jackson (\"Up the Wall\" by Jack Michaelson), Status Quo (\"Boring Song\" by Status Quid), The Police (\"Too Depressed to Commit Suicide\" by The PeeCees), David Bowie (\"Quite Ahead of My Time\" by David Bowwow), Gary Numan (\"Are Trains Electric?\" by Gary Inhuman) and others. The first album was recorded in the Strawberry Studios in Stockport, and featured 10cc and Sad Café studio musicians. The second album was recorded in and mixed at Silo Studios in London, with Les Davidson ( gtr) Steve Shone (Bass) and Dave Early ( drums). The music was written by Pope, with lyrics by Deayton and other Radio Active scriptwriters."]}, {"page": "List of people who died in traffic collisions", "response": ["|align=\"left\"| Dave Early"]}, {"page": "Sade (band)", "response": ["The band embarked on their first major UK tour, augmented by Dave Early (drums), Martin Ditcham (percussion), Terry Bailey (trumpet) and Gordon Matthewman (trombone). A third single, \"Smooth Operator\", was released from the album with a video directed by Julien Temple. The single became their first US hit in spring 1985, propelling the album in the US Top Ten. Also in 1985, the band were nominated for two MTV Video Music Awards—\"Best Female Video\" and \"Best New Artist\". ", "* Dave Early – drums (1984–1985, died 1996)"]}, {"page": "The Best of Sade", "response": ["* Dave Early – drums, percussion "]}, {"page": "Diamond Life", "response": ["* Dave Early – drums, percussion"]}, {"page": "Avalon Sunset", "response": ["*Dave Early – drums, percussion"]}, {"page": "Enlightenment (Van Morrison album)", "response": ["*Dave Early – drums (except on 4, 10)"]}, {"page": "Hymns to the Silence", "response": ["*Dave Early - drums, percussion"]}, {"page": "The Philosopher's Stone (album)", "response": ["*Gary Mallaber, Connie Kay, Lee Charlton, Dahaud Shaar, Rick Shlosser, Peter Van Hooke, Tony Day, Tom Donlinger, Roy Jones, Dave Early – drums"]}, {"page": "Tamalin (band)", "response": ["In the early 1990s the band became close friends with legendary drummer and percussionist Dave Early who had settled in Belfast and was playing with Mary Black. When not touring with Mary, Dave worked closely with Tamalin playing concerts and experimenting in the studio. An album was shaping and in July 1997 Rhythm and RhymeIrish Times (Sept 1997).  was released on the Grapevine label.", "In October 1996 Dave Early died in a car accident Irish Times (Oct 1996).  outside Dublin and never saw the release of the band's debut album.Irish Music Magazine (August 1997). \"Tamalin: Making a bold debut\" John McSherry had a parallel career for many years, being a member of Donal Lunny's Coolfin as well as co-founding the band Lúnasa along with Michael McGoldrick."]}, {"page": "Promise (Sade album)", "response": ["* Dave Early – drums, percussion"]}, {"page": "Real Real Gone", "response": ["*Dave Early – drums"]}, {"page": "Coney Island (Van Morrison song)", "response": ["*Roy Jones, Dave Earlydrums, percussion"]}, {"page": "Whenever God Shines His Light", "response": ["* Dave Early – drums, percussion"]}, {"page": "Van Morrison: The Concert", "response": ["*Dave Early – drums"]}, {"page": "Enlightenment (Van Morrison song)", "response": ["*Dave Early — drums"]}, {"page": "These Are the Days (Van Morrison song)", "response": ["*Roy Jones, Dave Earlydrums, percussion"]}, {"page": "Orangefield (song)", "response": ["*Roy Jones, Dave Earlydrums, percussion"]}]}}