{"wiki_id": "http://www.wikidata.org/entity/Q5221630", "itemLabel": "Daphne Pearson", "itemDescription": "Women's Auxiliary Air Force officer; George Cross & Empire Gallantry medals recipient", "wikipedia_url": "https://en.wikipedia.org/wiki/Daphne_Pearson", "wikipedia_page": {"main": "Joan Daphne Mary Pearson,  (25 May 1911 – 25 July 2000) was a Women's Auxiliary Air Force officer during the Second World War and one of only thirteen women recipients of the George Cross, the highest decoration for gallantry not in the face of an enemy that can, or could, be awarded to a citizen of the United Kingdom or commonwealth.", "link_mentions": [{"page": "Edna Walling", "response": ["1996 Conference Proceedings Though she had long working association with Eric Hammond and Ellis Stone, her succession of female assistants and close relationships with women including Esmé Johnston and poet Lorna Fielden and friendships with other women who lived openly in a partnership, like bookshop owner Margareta Webber with Dr Jean Littlejohn, and landscape architect Mervyn Davis (her name was Welsh) and Daphne Pearson, have led some researchers to the conclusion that she was lesbian, though Walling herself, who lived through Australia’s more conservative, homophobic cultural period, made no such admission.Martin, Sylvia. \"A Garden of Delights.\" Hecate's Australian Women's Book Review 17.2 (2005): N_A. A design commission prompted her move to Bendles in Buderim in Queensland 1967, where she was later joined by her companion Lorna Fielden, who had been a teacher at MLC and also edited Walling's writings. Walling died at Nambour on August 8, 1973, and Lorna 4 years later; she and Edna are buried there side by side under two trees."]}, {"page": "Laura Knight", "response": ["* Corporal J. D. M. Pearson, GC, WAAF (1940) – shows Corporal Daphne Pearson of the Women's Auxiliary Air Force, WAAF, a recipient of the Empire Gallantry Medal, later exchanged for the George Cross. Pearson, at Knight's insistence, sat for the portrait holding a rifle; as WAAF personal were not allowed to carry arms on duty, Knight had to paint over the rifle, which was replaced by a gas mask in the finished painting, with the hands positioned as if still holding a rifle. "]}, {"page": "No. 500 Squadron RAF", "response": ["On 7 November 1938 the squadron saw another role change as it was transferred to RAF Coastal Command and became a general reconnaissance squadron as part of 16 Group. It re-equipped with Avro Anson Mk. I twin-engine monoplanes from March 1939. The outbreak of the Second World War in September 1939 saw the squadron deployed on patrols and convoy escort operations off the coast of Essex and East Anglia, transferring to operations over the English Channel in January 1940. The Battle of France saw 500's aircraft being involved in increasingly heavy action, covering the evacuation of British and French troops from Dunkirk, and attacking German-held harbours. In the night of 30/31 May a 500 Squadron Anson crash-landed at the squadron's base at RAF Detling on returning from a raid on the Channel ports. The aircraft caught fire, and Corporal Daphne Pearson, a member of the WAAF was awarded the George Cross for rescuing the pilot from the burning aircraft before it exploded. On 1 June, three of the squadron's Ansons were patrolling off Dunkirk when they came under attack by as many as nine German Messerschmitt Bf 109 fighters. The Ansons had been modified to improve their armament by adding two beam machine guns, and one of the Ansons claimed two Bf 109s shot down. While the squadron further modified the armament of some of its Ansons in August for use against German E-boats by adding a 20 mm cannon firing through the floor, it was increasingly deployed on convoy escort duties.", "* Daphne Pearson"]}, {"page": "Index of World War II articles (D)", "response": ["# Daphne Pearson"]}, {"page": "Joan Daphne Mary Pearson", "response": ["#REDIRECT Daphne Pearson"]}, {"page": "St Brandon's School", "response": ["* Daphne Pearson"]}, {"page": "Daphne (given name)", "response": ["*Daphne Pearson (1911–2000)"]}, {"page": "List of people from Bournemouth", "response": ["* Daphne Pearson GC (1911–2000) one of only thirteen women recipients of the George Cross"]}]}}