{"wiki_id": "http://www.wikidata.org/entity/Q5224797", "itemLabel": "Darren Blewitt", "itemDescription": "British footballer (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Darren_Blewitt", "wikipedia_page": {"main": "Darren Blewitt (born 3 September 1985) is an English former footballer who played in the Football League for Southend United as a defender.", "link_mentions": [{"page": "Blewitt", "response": ["* Darren Blewitt (b. 1985), English footballer"]}, {"page": "Danny Kerrigan", "response": ["Kerrigan started his football career with Southend United, making his debut in the Third Division in the 1–1 away draw to Carlisle United on 2 October 1999, replacing Nathan Jones as a substitute in the 80th minute. He made a total of 19 appearances in all competitions for Southend, before being released in 2002. He signed for Billericay Town in summer 2002, following his release from Southend United. In April 2003, he joined Isthmian League Premier Division club Grays Athletic, following a budget cut at Billericay. George Borg then signed Kerrigan for Grays' rivals Hornchurch in September, Hornchurch were deducted one point in November, due to fielding Kerrigan in a 1–1 draw with Heybridge Swifts when he was not registered with the club. He went on to rejoin Billericay Town again, before being released along with Darren Blewitt in May 2008. Kerrigan signed for Heybridge Swifts in July 2009, before signing for Wivenhoe Town two months later in September."]}, {"page": "Ellis Remy", "response": ["He then signed for Harrow Borough in August 2006, although returned to East Thurrock United and then joined Folkestone Invicta in December. In December 2007, Neil Smith signed Remy for Conference South club Welling United from Folkestone. He went on to play for Heybridge Swifts signing in the summer of 2008, however, he left in September alongside Darren Blewitt after manager Brian Statham resigned. Remy subsequently joined Isthmian League Division One North club Enfield Town alongside former Heybridge teammate Darren Blewitt and Mark Nougher in September 2008."]}]}}