{"wiki_id": "http://www.wikidata.org/entity/Q5228931", "itemLabel": "Dave Hedger", "itemDescription": "British DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Hedger", "wikipedia_page": {"main": "Dave Hedger, from England, is a house DJ, producer and remixer. He began his musical career as a studio engineer in the late 1980s, working with house music pioneers such as David Holmes and Rocky & Diesel (now of X-Press 2). He formed the techno outfit Innersphere with Lindsay Edwards in 1993, releasing six singles and an album Outer Works in 1994, and collaborated with Andy Weatherall as the remix outfit Lords of Afford.\nIn 2001, Hedger started his house music project West London Deep, recording with Dean Thatcher until 2003 and with Ollie Jacobs since 2004, releasing five singles to date and a string of remixes.", "link_mentions": [{"page": "The Moody Boys", "response": ["Cauty and his KLF-partner Bill Drummond retired from the music industry in 1992, but Thorpe continued under the revised \"Moody Boyz\" moniker until 1994, producing in this time what is considered to be the Moody name's best work, including another \"classic\", \"Destination Africa\", and the album, Product of the Environment. A remixed version, Recycled for the Environment, was also released to acclaim. featuring contributions from many remixers, including Andrew Weatherall and Dave Hedger."]}, {"page": "Arkarna", "response": ["Jacobs has also collaborated with various well-known artists and producers including Madonna, Trevor Horn, Art of Noise, Barry Manilow, The Prodigy, Skunk Anansie, William Orbit, Tinchy Stryder, Stooshe, and Boyzone. Early on, Jacobs wrote and produced the number No. 1 hit \"Mysterious Girl\" for Peter Andre. Additionally, he has mixed the track \"Pop Your Cork\" for the Stanton Warriors (which features Twista) and also collaborated with Dave Hedger under the name West London Deep. In 2013, Jacobs was voted 'Top UK Hit Songwriter'"]}, {"page": "Dave Beer", "response": ["Many releases followed for Beer including I am Miami (You’re Looking At Him), produced under the alias Out of Order with Kriss Needs, released in July 1998 on Creation Records offshoot, Eruption Records. It gained interest from the music press including the NME and Muzik Magazine. Featuring the vocals from Stefan Frank and engineered by Dave Hedger, Beer described it as, \"Just an off the wall track. I was always into that early electro Hip Hop sound. So it was a chance to get away from house music and mix things up a bit\". The music video featured a cameo of one of the biggest producers around at the time, Arthur Baker who drove an open top Cadillac in one of the scenes."]}, {"page": "Hedger (surname)", "response": ["*Dave Hedger, English DJ"]}]}}