{"wiki_id": "http://www.wikidata.org/entity/Q522534", "itemLabel": "Iain Baxter", "itemDescription": "Canadian artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Baxter%26", "wikipedia_page": {"main": "Iain Baxter&  (born Iain Baxter on November 16, 1936) is a Canadian conceptual artist.\nBaxter& is recognized internationally as an early practitioner of conceptual art; the Canada Council Molson Prize committee stated in 2005 that his \"highly regarded conceptual installations and projects, as well as his photography, have earned him the label of 'the Marshall McLuhan of the visual arts.\" Baxter& was co-president with Ingrid Baxter of the conceptual project and legally incorporated business N.E. Thing Co., founded in 1966. Baxter& is Professor Emeritus at the School of Visual Arts University of Windsor and a member of the Royal Canadian Academy of Arts.", "link_mentions": [{"page": "Canada Council", "response": ["|Germaine Arnaktauyok, Iain Baxter&, Eleanor Bond, Edward Burtynsky, Ken Danby, Antonia Hirsch, Norval Morrisseau, Kim Ondaatje, Michael Snow, Takao Tanabe, Joanne Tod, Chih-Chien Wang, Shirley Wiitasalo, and others."]}, {"page": "University of Windsor", "response": ["* Iain Baxter&, Professor Emeritus School of Visual Arts, award-winning Canadian photographer, painter, sculptor, installation artist, and conceptual artist"]}, {"page": "Baxter (name)", "response": ["* Iain Baxter& (born 1936), Canadian conceptual artist", "* Iain Baxter (curler) (1948–2015), Scottish curler"]}, {"page": "Molson Prize", "response": ["|Iain Baxter&"]}, {"page": "List of Companions of the Order of Canada", "response": ["|Iain Baxter&"]}, {"page": "David Moos", "response": ["Moos is the former Curator of Modern and Contemporary Art at the Art Gallery of Ontario (AGO), Toronto, departing from the position in 2011. He organized the exhibitions Iain Baxter&: Works 1958-2011, Julian Schnabel: Art and Film, Wangechi Mutu: This You Call Civilization?, He Named Her Amber: Iris Häussler, Wallworks: Contemporary Artists and Place, The Shape of Colour: Excursions in Colour Field Art, 1950-2005, and co-ordinated the Toronto installation with David Cronenberg of Andy Warhol / Supernova: Stars, Deaths and Disasters, 1962-1964. He presided over the inaugural installation of the new Frank Gehry-designed Vivian and David Campbell Centre for Contemporary Art in 2008.", "* David Moos, ed., Iain Baxter&: Works 1958-2011 (Toronto, Art Gallery of Ontario, 2011)"]}, {"page": "Yukon School of Visual Arts", "response": ["* Iain Baxter&: Sense of Place Guide."]}, {"page": "List of people from Windsor, Ontario", "response": ["* Iain Baxter&, OC, Governor General Award-winning visual artist, forerunner of Canadian conceptual art"]}, {"page": "List of members of the Order of Ontario", "response": ["* Iain Baxter& – conceptual artist"]}, {"page": "List of Laureates of the Governor General's Award in Visual and Media Arts", "response": ["|data-sort-value=\"Baxter, Iain\"|Iain Baxter"]}, {"page": "Gershon Iskowitz", "response": ["| 2006 || Iain Baxter& || Windsor"]}, {"page": "Iain Baxter", "response": ["#REDIRECT Iain Baxter&"]}, {"page": "Ingrid Baxter", "response": ["Baxter was born in Spokane, Washington in 1938 under the name of Elaine (later changed to Ingrid). She studied classical piano performance at the University of Idaho and graduated with a Bachelor of Art in 1960. While studying she met artist Iain Baxter and they married in 1959. She then taught at Washington State University in Pullman, Washington along with her husband. Iain, Ingrid and John Friel established the art group \"IT\" but it only lasted one year before Iain and Ingrid split off to form N.E. Baxter Thing Co. This was later changed and legally established in 1967 to N.E.Thing Co. to maintain anonymity.  Ingrid and Iain went on to have two children, who would travel with them for art projects.", "*Baxter&, Iain, James Patten and Christophe Domino. Passing Through: Iain Baxter& Photographs, 1958–1983. Windsor, Ont.: Art Gallery of Windsor, 2006. ", "*Knight, Derek, Iain Baxter and Ingrid Baxter. N.E. Thing Co: The Ubiquitous Concept. Oakville, Ont.: Oakville Galleries, 1995. "]}, {"page": "Gaylen C. Hansen", "response": ["Between 1962 and 1964, Hansen developed a working relationship with Canadian graduate student Iain Baxter (now a noted conceptual artist) at WSU. Hansen and Baxter explored many art movements, including the work of Italian artist Giorgio Morandi, who obsessively arranged and rearranged the same ordinary objects for his canvases. Hansen described his and Baxter's investigations:"]}, {"page": "& (disambiguation)", "response": ["* Iain Baxter& (born 1936), Canadian conceptual artist"]}, {"page": "Conservation-restoration of dye diffusion transfer prints", "response": ["=== Iain Baxter& ===", "Canadian conceptual artist Iain Baxter& uses dye diffusion transfer prints as a medium of his art.IAIN BAXTER&: Works 1958-2011. (n.d.). Retrieved from https://ago.ca/exhibitions/iain-baxter-works-1958-2011 His partnership with the Art Gallery of Ontario during a 2012 exhibition of his work exemplifies a mutual understanding of the need for conservation of dye diffusion transfer prints by himself and gallery conservator Katy Whitman.Art Gallery Ontario (2012, March 29). How to Conserve a Polaroid: IAIN BAXTER&: Works 1958-2011. Retrieved from https://www.youtube.com/watch?v=QqgVBnlWFAA"]}, {"page": "2019 Canadian honours", "response": ["* Iain Baxter, C.C., O.Ont., O.B.C. - This is a promotion within the Order"]}, {"page": "AMS Art Collection", "response": ["The AMS Art Collection, or AMS Permanent Collection, is a Canadian art collection owned by the Alma Mater Society, a student organization of the University of British Columbia. The collection is one of only two university student-owned permanent art collections in Canada. It includes paintings by major Canadian artists, including E.J. Hughes, Lawren Harris, Iain Baxter&, Roy Arden, Takao Tanabe, Ann Kipling, Roy Kiyooka, Jack Shadbolt, Toni Onley, Elizabeth Wyn Wood, Lawrence Paul Yuxweluptun, Tom Borrows, and so forth. The collection was valued at around $4 million CAD in 2017.", "Under B.C. Binning’s management since 1958, the collection has acquired 23 artworks by important Canadian artists, in order to establish the Brock Hall Art Collection as a Canadian landmark. After Binning’s departure from the Brock Hall Art Committee in 1969 due to his retirement, however, the collection has stared to receive less care than it used to be under the quick change in leadership and slow selection process of the new committee. Despite the highly attempted acquisitions in post-Binning’s era, exemplified by Alvin Balkind’s suggestion to purchase a controversial piece, Bagged Landscape (1965-69) by Iain Baxter&, the overall collection was still dominated by the conservative ideology that the landscape and abstracted figurative paintings hallmark the history of Canadian Fine Art."]}]}}