{"wiki_id": "http://www.wikidata.org/entity/Q5228781", "itemLabel": "Dave Formula", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Formula", "wikipedia_page": {"main": "Dave Formula (born David Tomlinson 11 August 1946, Whalley Range, Manchester, England), is an English keyboardist and film-soundtrack composer from Manchester, who played with the post-punk bands Magazine and Visage during the end of the 1970s and the beginning of the 1980s and in the \"world music\" band The Angel Brothers.", "link_mentions": [{"page": "Kate Bush", "response": ["During the same period as the Tour of Life, Bush performed on television programs including Top of the Pops in the UK, Bio's Bahnhof in Germany, and Saturday Night Live in the United States (performing \"The Man with the Child in His Eyes\" with Paul Shaffer on piano, and later in the programme, \"Them Heavy People\"), which remains her only American television appearance. On 28 December 1979, BBC TV aired the Kate Bush Christmas Special. Bush participated in the first benefit concert in aid of The Prince's Trust in July 1982, at which she sang \"The Wedding List\" with a backing band composed of Pete Townshend, Phil Collins, Midge Ure, Mick Karn, Gary Brooker, Dave Formula and Peter Hope Evans. The performance was later released on VHS video, Laserdisc and CED disc. She performed live for British charity event Comic Relief in 1986, singing \"Do Bears... ?\", a humorous duet with Rowan Atkinson, and a rendition of \"Breathing\". In March 1987, Bush sang \"Running Up That Hill\" at The Secret Policeman's Third Ball accompanied by David Gilmour. She appeared with Gilmour again in 2002, singing the Pink Floyd song \"Comfortably Numb\" at the Royal Festival Hall in London."]}, {"page": "Bill Drummond", "response": ["Between 3 and 8 July - Drummond screened a film of his Atlantic Archipelago project, Imagine Waking Up Tomorrow And All Music Has Disappeared along the same 53.1256 degree line of latitude the original performances had been undertaken. Beginning at the home of film and gender theorist Ellen Wright, in Louth, Lincolnshire, with a version of The17 which include musicians Robert Wyatt, Hell Uberend and Dave Formula. before moving on to a dawn screening on Skegness beach, through the various locations featured in the film, taking in The Galway Film Fleadh (the only paid ticketed event on the tour), culminating in a sunset screening at Dún Aonghasa on the west coast of Ireland."]}, {"page": "Visage (band)", "response": ["Founding members Midge Ure and Rusty Egan started working on Visage to produce music to play at the clubs Egan was DJing at. Egan alongside Steve Strange was hosting David Bowie and Roxy Music club nights at Billy's nightclub in London's Soho district at the time and Egan was eager to find new music to play, ultimately opting to create music himself with Ure. Steve Strange had briefly been in the punk/new wave bands The Moors Murderers and The Photons, and Egan was working with Midge Ure in the band The Rich Kids. Ure and Egan recorded a demo which included the original track \"The Dancer\" of which a version appeared on the debut Visage album and a cover of the Zager and Evans hit \"In the Year 2525\". Strange was then brought into the band to provide the face and voice of Visage with the line-up being completed with the addition of Ultravox keyboardist Billy Currie and three-fifths of the post-punk band Magazine – guitarist John McGeoch, keyboardist Dave Formula and bassist Barry Adamson (who left the band after playing on its debut single, but returned as a session musician). Producer Martin Rushent had heard some of the band's material at Billy's nightclub and financed further recordings with a view to signing the band to his new Genetic Records label. Visage recorded their first album at Rushent's home studio in Berkshire, but Rushent's label collapsed, and the band instead signed to Radar Records, a new independent label run by Rushent's former colleague Martin Davis (the pair had worked together at United Artists Records). Visage released their first single \"Tar\" on Radar in September 1979, though the single failed to chart. By this time, however, Strange and Egan had relocated their themed club nights to the Blitz club in Covent Garden and the New Romantic movement had begun in earnest. In mid-1980, David Bowie himself visited the club and asked Strange and three other regulars to appear in the video for his single \"Ashes to Ashes\", which helped to propel the New Romantic movement into the mainstream.", "In 1984, with their contractual problems resolved, Visage returned with their third album, Beat Boy. Released in October 1984, the album was a critical and commercial failure, peaking at No.  79 in the UK. Two singles from the album, \"Love Glove\" and \"Beat Boy\", also failed to make the UK top 40. By this time, Billy Currie and Dave Formula had also left the band (though they received a \"special thanks\" credit on the album sleeve for their input), leaving only Strange and Egan from the original line-up along with Steve Barnacle and new recruits Gary Barnacle (Steve Barnacle's brother) and Andy Barnett who also was a member of FM and ASAP. A decision to make Visage a live band instead of a strictly studio-based project also failed to meet with success and the band split in 1985. Their final release was a Visage video compilation of the band's renowned promotional videos and other footage, including Strange's 1983 trip to North Africa. The compilation does not, however, include the original video for the \"Love Glove\" single which was filmed at a late-night Dockland location in London in 1984.", "Steve Strange reappeared on the music scene in 2002, after several years of battling a heroin addiction and other personal problems. He performed several Visage songs on the Here and Now Xmas Tour – a revival of 1980s pop acts. Some time after the performance, Strange decided to create a \"Mark II\" of Visage with people from several electronic bands and projects: Steven Young, Sandrine Gouriou and Rosie Harris from Seize and Ross Tregenza from Jetstream Lovers/Goteki. After the announcement of the formation of the new line-up and several television appearances, plans for reworking old material and releasing a new record made slow progress. An updated version of \"Fade to Grey\" was produced in 2005. In 2006, Strange also collaborated with the electronic duo Punx Soundcheck and provided vocals on the track \"In the Dark\", which was included on the duo's debut double album When Machines Ruled the World. The first Visage mk II track was released in 2007, entitled \"Diary of a Madman\". Written by Strange with Visage mk II member Ross Tregenza, the track was co-produced by original Visage member Dave Formula. This song was made available for download from their official website in return for a donation to the charity Children in Need. However, no further new material surfaced from this line-up.", "* Dave Formula – keyboards, synthesiser (1978–1984)"]}, {"page": "Midge Ure", "response": ["In 1978, Egan and Ure formed Visage with lead vocalist Steve Strange, and utilised their new synthesiser when they recorded a cover of the Zager & Evans classic \"In The Year 2525\" for promotional purposes. The line-up was expanded in 1979 with the addition of Magazine members Dave Formula, John McGeoch and Barry Adamson, and Ultravox keyboardist Billy Currie, and the band signed briefly to Radar Records for the release of their first single \"Tar\". Egan and Ure also formed the short-lived band The Misfits, whose career was curtailed by an approach from Thin Lizzy. Though Visage's first single was unsuccessful, they signed with Polydor Records in 1980; their second single, \"Fade to Grey\", became a hit."]}, {"page": "Magazine (band)", "response": ["\"Motorcade\" co-writer Dickinson, whose background was in classical and avant-garde music, left shortly after several gigs in late 1977. In early 1978, the band released their first single, \"Shot by Both Sides\", a song Magazine recorded as a quartet. It featured a guitar-bass-drums sound similar to punk rock. Shortly after the single's release, Dave Formula, who had played with a briefly successful 1960s rock band from Manchester called St. Louis Union, joined as keyboardist. \"Shot by Both Sides\" used a chord progression suggested by Pete Shelley, which was also used in the Buzzcocks track \"Lipstick\". The Magazine single just missed the UK Top 40. The band, with Formula on keyboards, made its first major TV appearance on Top of the Pops in February 1978, performing the single.", "*Dave Formula - keyboards (1977–1981, 2009–2011)", "   bar:Formula     text:\"Dave Formula\""]}, {"page": "Louth, Lincolnshire", "response": ["*Dave Formula, member of New Wave pioneers Magazine, lives in Louth and often plays locally with other The Finks."]}, {"page": "Howard Devoto", "response": ["After Magazine split in 1981 Devoto spent two years putting together a solo album with former Magazine keyboard player Dave Formula. Jerky Versions of the Dream reached No. 57 in the UK Albums Chart in August 1983, and was reissued in 2007 by Virgin/EMI, featuring several tracks of bonus material."]}, {"page": "ARP Instruments", "response": ["*Dave Formula played an ARP Odyssey."]}, {"page": "Winston Tong", "response": ["Tong joined Tuxedomoon in 1977.  He sporadically recorded and performed live with the group, and also recorded solo material including the electropop dance album Theoretically Chinese in 1985, a 9-song album produced by Alan Rankine featuring guests such as Stephen Morris of New Order, Dave Formula, and Jah Wobble, as well as many other familiar musicians from Tong's past. The album and its subsequent singles, \"Theoretical China\" and \"Reports From The Heart\", were released on Les Disques du Crepuscule."]}, {"page": "John McGeoch", "response": ["In 1979, while still a member of Magazine, McGeoch joined Steve Strange's electronic band Visage along with erstwhile Magazine bandmates Adamson and Dave Formula, recording songs for their first single \"Tar\" and later, in 1980, for their eponymous album Visage, McGeoch playing guitar and saxophone on the record."]}, {"page": "Noko", "response": ["In November 2008, Noko was announced as the guitarist of the reformed Magazine, joining his former collaborators Howard Devoto, Barry Adamson, John Doyle and Dave Formula.", "In 2011, Noko contributed guitar to two tracks on The Organ Of Corti, an LP by Magazine's Dave Formula and cellist Christine Hanson."]}, {"page": "The Damned Don't Cry (song)", "response": ["*Dave Formula – synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "Formula (disambiguation)", "response": ["* Dave Formula (born 1946), British musician"]}, {"page": "Real Life (Magazine album)", "response": ["The album was written over the preceding year by the band, with Howard Devoto providing all of the lyrics. The two earliest songs, \"Shot by Both Sides\" and \"The Light Pours Out of Me\", were co-written with Devoto's former Buzzcocks bandmate Pete Shelley. The majority of the material on the album was written by Devoto in collaboration with guitarist and founding member John McGeoch. \"Motorcade\" was co-written with the group's keyboardist, the classically trained composer, Bob Dickinson, who played with the group in mid-1977 before being dismissed without warning at a meeting convened by Devoto in November of that year. Dickinson has cited the influence of Satie on elements of the keyboard part in this song.In early January 1978, Dickinson was invited by Devoto to play for a few gigs but he declined the offer due to his ongoing postgrad electronic music research at Keele University.The music for the album's final track, \"Parade\", was written by Dickinson's replacement, Dave Formula, with bassist Barry Adamson. \"Definitive Gaze\" was recorded for a Peel session as \"Real Life\" on 14 February 1978.", "* Dave Formula – keyboards"]}, {"page": "Steve Strange", "response": ["Shortly after leaving the Photons, and using the alias Steve Strange, Harrington joined Visage, with Rusty Egan and Midge Ure from Rich Kids, Billy Currie from Ultravox, and Barry Adamson, John McGeoch and Dave Formula from Magazine. Intended as a studio-based side project, they signed to the small label Radar Records and released their first single \"Tar\" in 1979. The single was not a success, but the following year, Strange appeared in the video for David Bowie's no.1 hit \"Ashes to Ashes\", a song which helped to propel the burgeoning New Romantic fashion movement into the mainstream. Later that year, Visage signed a new record deal with the major label Polydor and released their second single, \"Fade to Grey\". The single became a top 10 hit in the UK and several other European countries, reaching number one in Germany and Switzerland. As the public face of the band, Strange shot to stardom in Britain and other parts of Europe. Visage enjoyed a string of hit singles and two hit albums before later commercial disappointments led to their break-up in 1985."]}, {"page": "Beat Boy", "response": ["The album was recorded and released after lead singer Steve Strange decided to make Visage a live band instead of being solely a studio-based project, a decision that left him working only with drummer Rusty Egan and a trio of newer musicians. Billy Currie (the Ultravox keyboardist who had been part of Visage for their first two albums) left the band soon after recording commenced, though co-wrote and played on the track \"Only The Good Die Young\". Keyboardist Dave Formula, who co-wrote two tracks, also departed the band during this time.", "* Dave Formula – keyboards"]}, {"page": "The Anvil (album)", "response": ["* Dave Formula – synthesizer"]}, {"page": "Visage (Visage album)", "response": ["* Dave Formula – synthesizer"]}, {"page": "Mind of a Toy", "response": ["*Dave Formula – synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "Tar (song)", "response": ["*Dave Formula — synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "Night Train (Visage song)", "response": ["*Dave Formula — synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "Visage (song)", "response": ["*Dave Formula – synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "Pleasure Boys", "response": ["*Dave Formula — synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "The Damned Don't Cry (album)", "response": ["#\"Visage\" (Steve Strange, Midge Ure, Billy Currie, John McGeoch, Rusty Egan, Dave Formula) – 3:49"]}, {"page": "Master Series (Visage album)", "response": ["#\"Damned Don't Cry\" (Steve Strange, M. Ure, B. Currie, Rusty Egan, Dave Formula) – 3:55"]}, {"page": "Secondhand Daylight", "response": ["Unlike the group's former album Real Life, Howard Devoto did not contribute to writing the music for most of the tracks. Instead, the writing credits were split between band members: Devoto, John McGeoch and Dave Formula each wrote songs alone and in collaboration with Barry Adamson and Devoto/McGeoch wrote one song together. Devoto again provided lyrics for all compositions with the exception of the instrumental \"The Thin Air\", reputedly because the group ran out of studio time.", "* Dave Formula – keyboards"]}, {"page": "Beat Boy (song)", "response": ["*Dave Formula — synthesizer", "Category:Songs written by Dave Formula"]}, {"page": "The Correct Use of Soap", "response": ["Following the release of the album, guitarist John McGeoch left Magazine and joined Siouxsie and the Banshees. McGeoch also played with Visage, formed by his Magazine bandmates Dave Formula and Barry Adamson. He was replaced by Robin Simon (ex-Ultravox, later with Ajantamusic) on the world tour promoting the album.", "All lyrics are written by Howard Devoto and all music is composed by Magazine (Barry Adamson, Howard Devoto, John Doyle, Dave Formula and John McGeoch), except where noted.", "* Dave Formula – keyboards"]}, {"page": "Magic, Murder and the Weather", "response": ["Unlike on the group's former album The Correct Use of Soap, the writing credits for Magic, Murder and the Weather were not shared equally. The majority of the music was written by keyboardist Dave Formula; only the first three songs of side two of the LP were credited to all five members. Consistent with all Magazine's albums, the lyrics were written by Howard Devoto.", "Magic, Murder and the Weather has generally been poorly received by critics. AllMusic's Stephen Thomas Erlewine wrote that the album \"finds Dave Formula's washes of cold, brittle keyboards dominating the bitter and cynical music. Occasionally, Howard Devoto's weary lyrics surface through the icy mix, but it's clear that Devoto and Magazine have both had better days. It's not a graceful way to bow out, but the album has enough strong moments to prevent it from being an embarrassment as well.\" Peter Parrish of Stylus wrote: \"Devoto sounds as though his heart is no longer in it. The vibrancy found on The Correct Use of Soap has all but ebbed away and much of the record is bogged down by leaden, uninspired sounds that would have been unimaginable on earlier releases.\"", "* Dave Formula – keyboards"]}, {"page": "Robin Simon", "response": ["He played on the song \"Saddest Quay\", from Magazine keyboards player Dave Formula's solo album, Satellite Sweetheart, in 2009.Larkin, Colin (1992) \"The Guinness Who's Who of Indie and new wave Music\", Guinness Publishing, "]}, {"page": "John Doyle (drummer)", "response": ["He also collaborated with Dave Formula, for his solo album, Satellite Sweetheart, released on 15 February 2010."]}, {"page": "David Tomlinson (musician)", "response": ["#REDIRECT Dave Formula"]}]}}