{"wiki_id": "http://www.wikidata.org/entity/Q5226212", "itemLabel": "Daryl Mitchell", "itemDescription": "English cricketer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Daryl_Mitchell_(English_cricketer)", "wikipedia_page": {"main": "Daryl Keith Henry Mitchell (born 25 November 1983) is an English former first-class cricketer. Primarily a right-handed batsman who often opened the innings, Mitchell also bowled right-arm medium pace. He played for Worcestershire. He was appointed vice-captain for the 2010 season, and made captain when Vikram Solanki resigned in mid-August.", "link_mentions": [{"page": "Matthew Hoggard", "response": ["In September 2013, Hoggard announced his retirement from cricket at the end of the season. Unfortunately, Hoggard did not pick up any wickets in his last two games making the Worcestershire captain, Daryl Mitchell, his last victim in first-class cricket, this was before he announced his retirement."]}, {"page": "Essex County Cricket Club in 2005", "response": ["A total of 19 wickets fell in four days at New Road, despite only half a day being lost to rain. Batting first, Essex made 574, with Worcestershire's Stuart Wedge taking five for 112 in his second first class game, getting Ravinder Bopara as his first wicket. Essex got two wickets in the first 40 minutes; first class debutant Jahid Ahmed got his first wicket by removing 21-year-old Daryl Mitchell for 6, and Andre Adams bowled Graeme Hick for 17, but Worcestershire's third-wicket partnership added 333 in a little over four hours, with Stephen Moore hitting 152 out of his 191 runs in boundaries. However, Worcestershire declared at the end of the third day on 424 for 3, and Essex scored 201 for one wicket in 36 overs, Alastair Cook rounding off his first season as an Essex regular with an unbeaten 117. Worcestershire were set 352 in 60 overs to win, and despite an 84-ball ton from Graeme Hick Worcestershire finished four runs short of the ten extra points a win would have given."]}, {"page": "Leicestershire County Cricket Club in 2005", "response": ["Worcestershire were on top of Leicestershire for three and a half days at Grace Road, yet lost the match. Despite Dinesh Mongia scoring a quickfire 66, Leicestershire could only scamper 225 in their first innings, Ray Price taking three for 29 with economical off-spin and Nadeem Malik taking his fourth career five-wicket-haul. In reply, Worcestershire made 323, young batsman Daryl Mitchell making a gruelling 63 not out in five hours while Zander de Bruyn top-scored with 67. Leicestershire then collapsed to 149 for 8, thanks to tight bowling from Price who got four wickets, but experienced wicketkeeper Paul Nixon lifted them with a fine 85 before being run out. The last two partnerships added 89 runs, lifting Worcestershire's target to 141 in about 50 overs - very gettable in most cases. And when Worcestershire were 95 for 4 with the two young batsmen Steven Davies and Mitchell at the crease, it still looked possible. But Davies trod on his wicket attempting to pull a short ball, Mitchell was lbw to Mongia, Ray Price was run out for a five-ball duck, and despite double-figure scores from Chaminda Vaas and Matt Mason Worcestershire fell thirteen short of their target."]}, {"page": "Worcestershire County Cricket Club in 2005", "response": ["*  Daryl Mitchell", "Worcestershire were on top of Leicestershire for three and a half days at Grace Road, yet lost the match. Despite Dinesh Mongia scoring a quickfire 66, Leicestershire could only scamper 225 in their first innings, Ray Price taking three for 29 with economical off-spin and Nadeem Malik taking his fourth career five-wicket-haul. In reply, Worcestershire made 323, young batsman Daryl Mitchell making a gruelling 63 not out in five hours while Zander de Bruyn top-scored with 67. Leicestershire then collapsed to 149 for 8, thanks to tight bowling from Price who got four wickets, but experienced wicketkeeper Paul Nixon lifted them with a fine 85 before being run out. The last two partnerships added 89 runs, lifting Worcestershire's target to 141 in about 50 overs – very gettable in most cases. And when Worcestershire were 95 for 4 with the two young batsmen Steven Davies and Mitchell at the crease, it still looked possible. But Davies trod on his wicket attempting to pull a short ball, Mitchell was lbw to Mongia, Ray Price was run out for a five-ball duck, and despite double-figure scores from Chaminda Vaas and Matt Mason Worcestershire fell thirteen short of their target.", "A total of 19 wickets fell in four days at New Road, despite only half a day being lost to rain. Batting first, Essex made 574 despite Stuart Wedge taking five for 112 in his second first class game, getting Ravinder Bopara as his first wicket. Essex got two early wickets; first class debutant Jahid Ahmed got his first wicket by removing 21-year-old Daryl Mitchell for 6, and Andre Adams bowled Graeme Hick, but Worcestershire's third-wicket partnership added 333, with Stephen Moore hitting 152 out of his 191 runs in boundaries. However, Worcestershire declared overnight on 424 for 3, and Essex scored 201 for one wicket in 36 overs, Alastair Cook rounding off his first season as an Essex regular with an unbeaten 117. Worcestershire were set 352 in 60 overs to win, and despite an 84-ball ton from Graeme Hick Worcestershire finished four runs short of the ten extra points a win would have given."]}, {"page": "University of Worcester", "response": ["*Daryl Mitchell (cricketer)"]}, {"page": "Badsey", "response": ["*English cricketer Daryl Mitchell was born in Badsey."]}, {"page": "Moeen Ali", "response": ["During the 2011 season, Moeen spent three weeks as Worcestershire's acting captain while the usual club captain, Daryl Mitchell, was injured. Though he had captained England Under-19s, it was the first time he filled the role for his county. As he was inexperienced, Moeen approached senior players Vikram Solanki and Ben Scott for advice."]}, {"page": "List of first-class cricket records", "response": ["| 55 (1 six and 54 fours) || Daryl Mitchell (298) || Worcestershire v Somerset at TauntonWorcestershire won the toss and batted first, scoring 571 (Daryl Mitchell made 298).  Somerset replied with 280 and were asked to follow on.  In their second innings, Somerset were 523 for eight (Zander de Bruyn scored 106, Gareth Andrew took five for 117) when time ran out.  The match was drawn.  Scorecard || 2009"]}, {"page": "Professional Cricketers' Association", "response": ["The committee is headed by a chairman, currently (since February 2017) Daryl Mitchell.  There are two vice-chairs, currently Heather Knight and James Harris, and representatives from each first-class county and from England women's cricket."]}, {"page": "Prince Henry's High School", "response": ["*Daryl Mitchell, Cricketer"]}, {"page": "Ben Cox", "response": ["He scored 61 in his only innings of a drawn match (sharing a century partnership with Daryl Mitchell, who scored 298); keeping wicket, his first first-class dismissal was that of Marcus Trescothick, stumped off the bowling of Moeen Ali for 72. He was awarded a four-year contract by Worcestershire later that year."]}, {"page": "2010 Twenty20 Cup", "response": ["|Daryl Mitchell"]}, {"page": "Brett D'Oliveira", "response": ["D'Oliveira made his debut for Worcestershire on 29 August 2011 in a Pro40 match against Yorkshire. D'Oliveira did not bat as Worcestershire made 230-7 from their 40 overs. In the Yorkshire innings he bowled 6 overs for 40 runs, taking one wicket, that of youngster Joe Root who was caught by Daryl Mitchell for 62. Worcestershire lost the game by 6 wickets."]}, {"page": "2012 County Championship", "response": ["| Daryl Mitchell"]}, {"page": "2012 Twenty20 Cup", "response": ["|Daryl Mitchell"]}, {"page": "2013 Twenty20 Cup", "response": ["| Daryl Mitchell"]}, {"page": "2013 County Championship", "response": ["| Daryl Mitchell"]}, {"page": "2014 T20 Blast", "response": ["| Daryl Mitchell", "| style=\"text-align:left;\" | Daryl Mitchell"]}, {"page": "2014 County Championship", "response": ["| Daryl Mitchell", "| align=\"left\"| Daryl Mitchell"]}, {"page": "2015 County Championship", "response": ["| Daryl Mitchell"]}, {"page": "2015 T20 Blast", "response": ["| Daryl Mitchell"]}, {"page": "Daryl Keith Henry Mitchell", "response": ["#REDIRECT Daryl Mitchell (English cricketer) "]}, {"page": "Daryl Mitchell", "response": ["Daryl Mitchell may refer to:", "* Daryl Mitchell (actor) (born 1965), American actor", "* Daryl Mitchell (English cricketer) (born 1983), English cricketer who has played for Worcestershire since 2005", "* Daryl Mitchell (New Zealand cricketer) (born 1991), New Zealand first-class cricketer who plays for Canterbury"]}, {"page": "2016 County Championship", "response": ["| Daryl Mitchell"]}, {"page": "2016 T20 Blast", "response": ["| Daryl Mitchell"]}, {"page": "2017 County Championship", "response": ["|Daryl Mitchell"]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["* Daryl Mitchell (2015) : D. K. H. Mitchell (Worcestershire)\t"]}, {"page": "2018 County Championship", "response": ["|Daryl Mitchell"]}]}}