{"wiki_id": "http://www.wikidata.org/entity/Q5220481", "itemLabel": "Danny Jackson", "itemDescription": "English footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Jackson_(footballer)", "wikipedia_page": {"main": "Danny Jackson (born 20 October 1979) is an English central defender/sweeper who last played for the Seattle Sounders, and served as captain from 2004–2008.", "link_mentions": [{"page": "List of foreign MLS players", "response": ["*Danny Jackson – Colorado – 2002"]}, {"page": "List of current Major League Soccer broadcasters", "response": ["|Wade Webber (select games)Danny Jackson (select games)Pete Fewing (select games)"]}, {"page": "All-time Colorado Rapids roster", "response": ["*  Danny Jackson †"]}, {"page": "2003 USL A-League", "response": ["D: Gabriel Gervais (Montreal Impact) (Defender of the Year);  Danny Jackson (Seattle Sounders); John Wilson (Charleston Battery)"]}, {"page": "Danny Jackson (soccer)", "response": ["#REDIRECT Danny Jackson (footballer)"]}, {"page": "Rich Cullen", "response": ["In 1996, Cullen, the son of an Air Force pilot, graduated from Mead Senior High School. He attended the United States Air Force Academy, playing on the men's soccer team from 1996 to 1999. He holds the Falcons' records for career saves and career shutouts. On February 6, 2000, the Colorado Rapids selected Cullen in the sixth round (67th overall) of the 2000 MLS SuperDraft.Colorado Rapids Draft History He remained at the Academy as an assistant coach while playing backup with the Rapids and on loan to the Colorado Springs Ascent.Soccer's Ascent: New Springs franchise kicks off season In 2001, Cullen joined the Seattle Sounders of the USL A-League. He spent most of the 2001 and 2002 seasons as backup before claiming a starting spot in 2003 when Preston Burpo broke his jaw in an on-field collision with Danny Jackson. Cullen backstopped the Sounders to the A-League semifinals and was named Second Team All League.2003 USL Awards However, the Sounders released him at the end of the season. During his years with the Sounders, Cullen was stationed at McChord Air Force Base as an Air Force Reservist. In 2004, the Air Force transferred Cullen back to the Academy where he spent two seasons as an assistant with the Falcons' soccer team."]}, {"page": "NCAA Division I Men's Soccer Tournament all-time individual records", "response": ["|Ryan Kneipper, North CarolinaDavid Stokes, North Carolina Danny Jackson, North CarolinaMatt Crawford, North CarolinaMichael Ueltschey, North CarolinaPat Noonan, IndianaMike Ambersley, IndianaMatt Moses, StanfordTodd Dunivant, StanfordJeff Matteo, St. John's (NY) Shalrie Joseph, St. John's (NY)"]}, {"page": "2001 North Carolina Tar Heels men's soccer team", "response": ["| Danny Jackson || 1 || 1 || 1 || 1 || Consensus", "| Danny Jackson || DF || First Team", "| Danny Jackson || DF || 2 || 16 || Colorado Rapids || "]}]}}