{"wiki_id": "http://www.wikidata.org/entity/Q5220229", "itemLabel": "Danny Cohen", "itemDescription": "British broadcasting executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Cohen_(television_executive)", "wikipedia_page": {"main": "Daniel Nicholas Cohen (born 15 January 1974) is a British television executive who currently serves as President of Access Entertainment which invests in film, television and digital companies and content. He was previously the Director of BBC Television from 2013 to 2015. Before that, he was the Controller of BBC One for three years, the BBC's principal television channel in the United Kingdom and the youngest person to be appointed as controller of the channel. During his time at the BBC, he commissioned programmes such as Poldark, Doctor Who, Strictly Come Dancing, EastEnders and The Graham Norton Show, and led BBC One's coverage of the 2012 London Olympics.", "link_mentions": [{"page": "David Jason", "response": ["On 16 September 2008, Jason announced that he would step down from his role as Jack Frost after 16 years. Three new episodes of the show were shown in autumn 2008, and were followed by a two-part finale in 2010.  Approached by BBC1 controller Danny Cohen in early 2011, he read three scripts and agreed to shoot a pilot for The Royal Bodyguard, which was shown at the Edinburgh Film Festival. The pilot episode aired on the BBC on Boxing Day but received a poor critical response. The series was axed after six episodes. In 2010, Jason starred in a made-for-TV movie Come Rain Come Shine with Alison Steadman for ITV about an elderly Millwall supporter."]}, {"page": "BBC One", "response": ["* 2010–2013: Danny Cohen"]}, {"page": "Rik Mayall", "response": ["Mayall died suddenly at his home in London on 9 June 2014 at the age of 56. BBC Television director Danny Cohen praised him as a \"truly brilliant\" comedian with a unique stage presence, whose \"fireball creativity\" and approach to sitcom had inspired a generation of comedy stars."]}, {"page": "QI", "response": ["The BBC has received criticism regarding the lack of women on their comedy panel shows. As a result, the corporation decided to ban all-male panels on comedy shows in February 2014, with BBC's director of TV Danny Cohen stating in an interview with The Observer that \"shows without women are unacceptable\". In November 2014, Mirror reported stats revealing that 38% of all QI episodes at that time had featured only men, 55.9% featured only one woman, and only the remaining 6.1% had two or three women, out of a total of three guest panellists per episode (the fourth one being regular panellist Alan Davies). Clem Bastow of The Sydney Morning Herald was supportive of BBC's decision, saying that \"left to their own devices, the producers of these shows are clearly failing massively when it comes to putting together line-ups that aren't just endless parades of the same old white men,\" and noted that this could motivate the producers to uncover some new talent. In 2017, creator of QI John Lloyd commented on BBC's decision, telling the Cheltenham Literature Festival that \"arguing a BBC quota for women panellists risked being mere tokenism\", while his wife Sarah Wallace—director of QI Limited—stated that female comedians are hesitant to appear on the show."]}, {"page": "My Family", "response": ["BBC One controller Danny Cohen, when commenting on the decision to axe the series, said \"Now that all the Harper children have flown the nest we feel it's time to make room for new comedies\". Robert Lindsay said in an interview with The Daily Telegraph: \"I'm amazed by the public's love for the series [...] When Kris Marshall left in 2005 I was convinced that was it. But somehow Zoë and I have kept the essence of it together.\"My Family dropped after 11 years BBC News, 25 March 2011"]}, {"page": "BBC controversies", "response": ["In February 2014 the television executive Danny Cohen said that there would no longer be any all male comedy panel shows on the BBC and all shows must contain a woman. The journalist Caitlin Moran referred to tokenism already existing on such shows. Dara Ó Briain, host of BBC 2 panel show Mock the Week, also referred to tokenism and \"token woman\" speaking against this idea. Comedian Milton Jones called it \"counterproductive\"."]}, {"page": "Noreena Hertz", "response": ["Hertz is married to Danny Cohen, the former Director of BBC Television. They were married in 2012 at the Bevis Marks Synagogue in the City of London. The ceremony was conducted by Lord Sacks, the Chief Rabbi, and attended by guests including Rachel Weisz, Nigella Lawson and Charles Saatchi. She lives with her husband in Primrose Hill, London."]}, {"page": "Criticism of the BBC", "response": ["Speaking at the China Exchange in Soho, the former BBC employee Jeremy Clarkson recalled when he was accused of being racist by the corporation: \"Political correctness is tiresome. We really suffered from it terribly at the Beeb.... I remember being called in to see Danny Cohen... he said, 'I understand you have a new dog and you have called it Didier Dogba. It is racist'\". In an interview with the Radio Times, Clarkson said, \"It's become so up itself, suffocating the life out of everything with its nonsense need to be politically correct\"."]}, {"page": "Lily Allen", "response": ["Allen signed a one series contract to present her own BBC Three TV show titled Lily Allen and Friends based on the social networking phenomenon that helped to launch her music career. Guests included Mark Ronson, Joanna Page, James Corden, Lauren Laverne, Roisin Murphy, Louis Walsh, and Danny Dyer. The show attracted only 2 per cent of the total multi-channel audience despite a high-profile nationwide marketing campaign. Citing Allen's rapid development as a TV host and her popularity among its target audience BBC Three announced it was renewing Lily Allen and Friends for a second season. BBC Three controller Danny Cohen later said that the show would not air in the spring of 2009 as originally scheduled because of music commitments."]}, {"page": "Daniel Cohen", "response": ["*Danny Cohen (cinematographer) (born 1963), British cinematographer", "*Danny Cohen (computer scientist) (1937–2019), Israeli-American computer scientist", "*Danny Cohen (television executive) (born 1974), Director of BBC Television"]}, {"page": "Pulling (TV series)", "response": ["Pulling was unexpectedly not renewed for a third series by BBC Three controller Danny Cohen, despite Kelly and Horgan both wanting to write another series. Instead the channel opted for a one-hour-special to \"tie up loose ends\" of the show's narrative.", "The Guardian reported that news of the cancellation \"perplexed those involved with the show\" and that \"insiders criticised Cohen's decision\" especially as Pulling had \"nearly doubled its [viewing] figures\" since the first series and had \"outperformed BBC3's average share both for the slot and for prime time in 2007, beating the slot average by 41% for the younger demographic\". The show had also fared well critically and had been nominated for a BAFTA award. The newspaper reported that they had \"sources\" who had \"claimed the decision was because the show no longer fitted in with the target audience of BBC3, which is being focused on a younger age group\". However, this reasoning was denied by a BBC spokeswoman and controller Danny Cohen. Commenting on the cancellation Cohen said: \"Pulling has had two fantastic series on BBC3 and we've committed to an hour-long finale episode as a mark of its quality\". He justified the decision by saying that he had to cancel the series to make a room for new shows on the channel: \"In an ideal world, we would recommission many more of our comedies - but on BBC3 we have to continually make room for the new. Every recommission means one less space for a new project.\""]}, {"page": "Dennis Kelly", "response": ["* Pulling, series 3: the television sitcom Pulling, which Kelly co-wrote with Sharon Horgan, was unexpectedly not renewed for a third series by BBC Three despite Kelly and Horgan both wanting to write another series. Instead, the channel opted for a one-hour special to tie up loose ends of the narrative. The sitcom had received good ratings, critical success and a nomination for a BAFTA award. BBC Three controller Danny Cohen denied claims the channel was chasing a younger audience, saying the series was cancelled to make room for new shows."]}, {"page": "Adil Ray", "response": ["The six 30-minute episodes of Citizen Khan were commissioned by Danny Cohen, BBC One Controller, and Cheryl Taylor, Controller of Comedy Commissioning, and have been produced by BBC In-House Comedy. The Executive Producer is Mark Freeland, the Producer is Paul Schlesinger (Twenty Twelve) and the Director is Nick Wood (Fresh Meat, Not Going Out, Two Pints of Lager and a Packet of Crisps). Citizen Khan is written by Anil Gupta and Richard Pinto (The Kumars at No 42, Goodness Gracious Me) with Adil Ray."]}, {"page": "List of Old Citizens", "response": ["*Danny Cohen – New Controller of BBC One, and formerly of BBC ThreeDanny Cohen named as new BBC One Controller – BBC News online (15 Oct 2010)"]}, {"page": "Coming of Age (2008 TV series)", "response": ["The show proved enormously popular with its target audience from the beginning, with Series 1 enjoying an average weekly reach of 1.2 million, and each episode appearing in the top 10 requested programmes on BBC iPlayer the day following transmission. Series 2 built on this success, with the first episode premiering to 719,000 viewers. BBC Three controller Danny Cohen (who commissioned the show) noted: \"I'm delighted that Coming Of Age has been such a hit with young viewers. The writer Tim Dawson and the young cast are bright emerging stars for the BBC.\" Despite this, the show often receives a poor reaction from television critics. Writing about the first episode, The Daily Telegraph's Culture magazine was negative: \"Crudeness abounds... but neither wit nor charm has tagged along for the ride.\" Harry Venning in The Stage"]}, {"page": "Lark Rise to Candleford (TV series)", "response": ["It was announced on 22 January 2011 that the show would not be returning for a fifth series. The decision caused viewer complaints, prompting BBC One controller Danny Cohen to say, \"Lark Rise to Candleford has been a truly wonderful part of the BBC One schedule and we are incredibly grateful to writer Bill Gallagher and the team. But we feel the time is right to make room for new dramas which we hope will be taken to the nation's hearts in the same way.\"BBC One boss defends 'Lark Rise' axe Digital Spy, 31 January 2011"]}, {"page": "Being Human (British TV series)", "response": ["Whithouse was contacted by the BBC who told him they were making a series of pilots.\"Toby Whithouse\", BBC writers room. Retrieved 18 April 2011. Whithouse was not a fan of the television pilot process, but believed that the show would never get made otherwise, so the pilot script was submitted. In 2007, Danny Cohen, the controller of BBC Three, commissioned the pilot of Being Human,Dowell, Ben, \"Cohen green lights vampire comedy\", The Guardian, 6 November 2007. Retrieved 16 April 2011. as well as West 10 LDN, Mrs In-Betweeny, The Things I Haven't Told You, Dis/Connected and Phoo Action pilots as part of the rebranding of BBC Three. Before the pilots were broadcast, Whithouse was told that only Phoo Action would be commissioned for a series. The pilot episode was broadcast on 18 February 2008. The journalist Narin Bahar of the Reading Chronicle started an online petition to lobby BBC Three commissioning editors to greenlight a full series, which was signed by over 3,000 people.Martin, Dan, \"How Being Human bit back to become BBC3's biggest hit\", The Guardian, 9 January 2010. Retrieved 17 April 2011. Phoo Action was cancelled after it was decided that the scripts for the series were not good enoughHolmwood, Leigh, \"Phoo Action replacement will be found, says BBC3's Danny Cohen\", The Guardian, 28 November 2008. Retrieved 18 November 2011. and Being Human was then commissioned.Dowell, Ben, \"BBC3 orders full series of Being Human\", The Guardian, 24 April 2008. Retrieved 18 April 2011."]}, {"page": "West 10 LDN", "response": ["Although it received critical acclaim from fans of Kidulthood and Adulthood alike, Noel Clarke later confirmed on his official MySpace page that the then controllers of BBC Three, Danny Cohen and Jane Tranter, had made the decision not to commission West 10 LDN into a full series.MySpace."]}, {"page": "How Not to Live Your Life", "response": ["How Not to Live Your Life (styled in the opening credits as \"how NOT to live your life\") is a British sitcom, written by and starring Dan Clark that aired between 27 September 2007 and 22 December 2011 on BBC Three, about a pessimistic twenty-nine-year-old man who is trying to navigate his way through life but is not helped by his bad instincts. After a pilot, the show debuted in 2008 with moderate ratings but grew over the course of the three series, doubling its ratings each series because of its cult following. The third series got viewing figures of 1.5 million across the week and was the second most watched show on BBC iPlayer. When BBC Three controller Danny Cohen left the channel, new controller Zai Bennett cancelled several comedies, including How Not to Live Your Life."]}, {"page": "Top Gear controversies", "response": ["On 31 October 2014, it was announced that the Argentine ambassador Alicia Castro met BBC Director of Television Danny Cohen to demand a formal apology, but the BBC refused to do so, making it clear that they intended to broadcast the special as a fair representation of the events that occurred. The Christmas Special, split into two parts, aired on 27 and 28 December 2014."]}, {"page": "2010 in British television", "response": ["|BBC Three Controller Danny Cohen is named as the new Controller of BBC One, replacing Jay Hunt."]}, {"page": "Tasmin Lucia-Khan", "response": ["Having produced and hosted her own sports show on Channel 5 for three years, she then landed the opportunity to present on BBC News and BBC Three. One of her mentors was Kevin Bakhurst who was the Editor of the Ten O’Clock News on BBC, and moved on to be the Controller of BBC News.  Bakhurst and Danny Cohen, then controller of BBC Three, offered her the job to be the face of the news bulletins on 60 Seconds on BBC Three, and be lead anchor of E24 on BBC News."]}, {"page": "Who Killed Archie?", "response": ["Overnight figures showed that Archie's murder on 25 December 2009 was watched by 45.9% of the viewing audience for that time, an average of 10.9 million and a peak of 11.9 million. It was the most watched TV show on Christmas Day 2009 in the UK. The following episode where the murder was discovered was also the most watched show of the day, with overnight ratings of 8.1 million, representing a 37.9% audience share. The investigation storyline helped EastEnders become the most watched soap opera on British television for the first time in three years, with average viewing figures for January 2010 of 10.8 million (40.4% audience share) compared to Coronation Street 10.4 million (38.2%). Overnight figures for the live episode indicated that it averaged 14.91 million viewers and a 54.6% audience share, peaking at 16.58 million with a 59.4% share in the final five minutes of broadcast when Stacey was revealed as the killer. The 10:30 pm repeat of the episode on BBC Three drew a further 1.42 million viewers, attaining a 7.7% share. EastEnders Live: The Aftermath drew 4.3 million viewers and a 15.9% audience share, becoming BBC Three's highest rated programme ever, as well as the most-watched multichannel programme of the day. The documentary attained a further 1.21 million viewers and a 9.4% share upon its repeat at 11 pm. Santer was delighted by the viewing figures, stating: \"To get this incredible response from the audience is truly remarkable – these numbers go far beyond what we ever hoped for. I am so proud of our cast and crew for their incredible performance last night. This rating is the icing on our silver anniversary cake.\" Jay Hunt, controller of BBC One commented: \"[The] extraordinary live episode was a fitting celebration of 25 magnificent years for EastEnders. The audience were clearly gripped by one of the greatest soap whodunnits ever.\" Discussing the ratings for EastEnders Live: The Aftermath, controller of BBC Three Danny Cohen appraised: \"It is an amazing testament to the EastEnders team and the brave and brilliant drama they provided.\""]}, {"page": "EastEnders Live", "response": ["Santer was delighted by the viewing figures, stating: \"To get this incredible response from the audience is truly remarkable—these numbers go far beyond what we ever hoped for. I am so proud of our cast and crew for their incredible performance last night. This rating is the icing on our silver anniversary cake.\" Jay Hunt, controller of BBC One commented: \"[The] extraordinary live episode was a fitting celebration of 25 magnificent years for EastEnders. The audience were clearly gripped by one of the greatest soap whodunnits ever.\" Discussing the ratings for EastEnders Live: The Aftermath, controller of BBC Three Danny Cohen appraised: \"It is an amazing testament to the EastEnders team and the brave and brilliant drama they provided.\" Yorke responded to the high consolidated ratings with the statement: \"The best birthday present EastEnders could possibly have is to know that 25 years in it can still grab the biggest audience in the UK. It's a real tribute to the show's creators that a quarter of a century on, everybody's still talking about it.\""]}, {"page": "Jason Lewis (comedian)", "response": ["During 2010 Lewis also created and starred in his own BBC online sketch comedy pilot show called SWA (Sniggers With Attitude), which featured appearances from Paul Whitehouse, Noel Clarke, Rufus Hound, and Daniel Kaluuya. In June 2010, BBC announced that Danny Cohen, controller of BBC Three, had commissioned Jason Lewis his own pilot titled The Jason Lewis Experience for the channel. The pilot featured Harry Enfield, Paul Whitehouse, Daniel Kaluuya, Trevor Nelson and David Schneider."]}, {"page": "Zen (TV series)", "response": ["Zen is a British television series produced by Left Bank Pictures for the BBC, co-produced with WGBH Boston for its Masterpiece anthology series, Mediaset and ZDF. It stars Rufus Sewell and Caterina Murino and is based on the Aurelio Zen detective novels by Michael Dibdin. The series was filmed on location in Italy, but the dialogue is in English. The series, which comprises three 90-minute films, was broadcast in the United Kingdom on Sunday evenings from 2 January 2011 on BBC One. The three films were based on the books Vendetta (1990), Cabal (1992) and Ratking (1988). The series was cancelled by BBC One in February 2011; BBC One controller Danny Cohen later said there were already enough male crime-fighters on TV. Left Bank, the show's producer, tried to find other broadcasters to fund another series but were unsuccessful."]}, {"page": "Justice (2011 TV series)", "response": ["As well as featuring individual stories, the series features an ongoing story arc throughout all five episodes. As well as looking at the work of the justice centre, plotlines also look at Coburn's troubled past and the relationship with parish priest Father Jim Kelly (Tom Georgeson). The series was released on Region 1 DVD on 25 October 2011. No further series of Justice were commissioned, due to then-BBC1 controller Danny Cohen claiming that there were \"too many crime dramas on TV\", and axing it alongside other BBC crime dramas, including Zen."]}, {"page": "The Voice UK", "response": ["On 18 June 2011, it was reported that the BBC had won the rights to The Voice UK. In mid-2011 it was revealed that BBC would be broadcasting The Voice after paying £22 million. Danny Cohen, the controller of BBC One, said he wants the programme to emulate the success of The Apprentice and defended his decision to invest in it. Cohen said, \"I thought it was really good. Every so often the BBC occasionally buys something from abroad that is peerlessly good, like The Apprentice. We adapted that for Britain with Alan Sugar and made the British version the best in the world. We hope The Voice will do similarly. We shouldn't shut the door on anything.\""]}, {"page": "Pilot (Being Human)", "response": ["Having written the Doctor Who episode School Reunion for the programme's second series (broadcast in 2006 but filmed the previous year) Whithouse was contacted by the BBC and invited to submit a pilot script for a TV show, as part of a set of pilot episodes to be made and broadcast on BBC3 with the option of possible future commissioning.\"Toby Whithouse\", BBC writers room, retrieved 18/4/11 Though not a fan of the television pilot process, Whithouse took a chance on submitting his concept for Being Human, reasoning that it might be the only chance of getting the show noticed and made. In 2007, Danny Cohen, the controller of BBC Three, formally commissioned the pilot of Being Human,Dowell, Ben, \"Cohen green lights vampire comedy\", The Guardian, 6/11/07, retrieved 16/4/11 West 10 LDN, Mrs In-Betweeny, and Phoo Action pilots as part of the rebranding of BBC Three. Even before the pilots were broadcast, Whithouse was informed that only Phoo Action would be commissioned for a series: regardless of this, Whithouse's pilot episode was broadcast on 18 February 2008.", "In spite of the BBC's initial commissioning decision, Being Human proved popular with viewers: however, the show might not have progressed further had not journalist Narin Bahar (of the Reading Chronicle) started an online petition to lobby BBC Three commissioning editors to greenlight a full series. The petition was signed by over 3000 people,Martin, Dan, \"How Being Human bit back to become BBC3's biggest hit\", The Guardian, 9/1/10, retrieved 17/4/11 and following the collapse and cancellation of the Phoo Action series in pre-production (as it was decided that the scripts for the series were not good enough),Holmwood, Leigh, \"Phoo Action replacement will be found, says BBC3's Danny Cohen\", The Guardian, 28/11/08, retrieved 18/4/11 Being Human was commissioned as a replacement.Dowell, Ben, \"BBC3 orders full series of Being Human\", The Guardian, 24/4/08, retrieved 18/4/11"]}, {"page": "2013 in British television", "response": ["|Current Director of BBC One, Danny Cohen is appointed Director of BBC Television, taking up the position from 7 May.", "|Charlotte Moore is appointed as Controller of BBC One, replacing Danny Cohen, who was given the role of Diretor of Television in April."]}, {"page": "Sophie Morgan", "response": ["In 2008, Morgan appeared in BBC Three's Britain's Missing Top Model. For the series, 8 women with disabilities competed to impress a panel of judges and \"prove that they have what it takes to become a model.\" The winner received a fashion shoot for Marie Claire magazine with photographer Rankin. Danny Cohen said that the series aimed to challenge boundaries in the beauty and fashion industries.\" Morgan was the runner-up to Kelly Knox. In 2011, Morgan was one of 12 women who were part of Stella McCartney's Adidas campaign for her 'MY2012' sportswear collection."]}, {"page": "Pompidou (TV series)", "response": ["A pilot was written in 2012, and 6 episodes were commissioned by Controller of BBC One Danny Cohen and Controller of Comedy Commissioning Shane Allen in Spring 2013. The series was written and filmed across 2013 and 2014. The first episode aired on BBC Two on 1 March 2015."]}, {"page": "The Day of the Doctor", "response": ["As the episode celebrates fifty years of the programme, it references and alludes to various concepts featured throughout the show's run. It received critical acclaim and has been described by series producer Marcus Wilson as a \"love letter to the fans\" and by the controller of BBC One, Danny Cohen, as an \"event drama\"."]}, {"page": "Atlantis (TV series)", "response": ["Announced on 11 February 2013, Atlantis was created to fill the gap left behind by Merlin, a show that was created and produced by Johnny Capps and Julian Murphy. This duo, plus Misfits creator Howard Overman, produced Atlantis through their new company Urban Myth Films. Executive producer for BBC Cymru Wales was Bethan Jones. The drama series was commissioned by Ben Stephenson, Controller of BBC Drama, and Danny Cohen, Controller of BBC One. The cast was announced on 27 March 2013."]}, {"page": "The Wright Way", "response": ["The Wright Way was commissioned by BBC One Controller Danny Cohen and Controller of BBC Comedy Commissioning Cheryl Taylor. It was originally to be titled Slings and Arrows, until it was decided viewers would mistake the title for a historical documentary. An alternative working title was ...Gone Mad, a play on the cliché saying \"It's health and safety gone mad\"."]}, {"page": "Death Comes to Pemberley (TV series)", "response": ["The series was commissioned by Controller of BBC Drama Commissioning Ben Stephenson and then-Controller of BBC One Danny Cohen,BBC media centre. Retrieved 26 December 2013 and was first broadcast from 26 to 28 December 2013 on BBC One.Susanna Lazarus. Death Comes to Pemberley's Matthew Rhys: \"The best thing about playing Mr Darcy is that shirt\" RadioTimes. Retrieved 26 December 2013."]}, {"page": "Charlotte Moore (TV executive)", "response": ["In February 2013 Moore was appointed acting controller of Daytime Television for the BBC,Georg Szalai \"BBC Confirms Charlotte Moore as Head of Flagship TV Channel\", Hollywood Reporter, 26 June 2013 and had been acting controller of BBC One since Danny Cohen's promotion to Director of BBC Television on 7 May.Jake Kanter \"Charlotte Moore named acting BBC1 controller\", Broadcast, 29 April 2013 She became controller of BBC One in June 2013.Matthew Hemley \"Charlotte Moore named new BBC1 controller\", The Stage, 26 June 2013."]}, {"page": "Truckers (2013 TV series)", "response": ["The series was announced on 11 January 2012 by Ben Stephenson, controller of drama commissioning at the BBC at the Broadcasting Press Guild lunch. The drama was commissioned with Danny Cohen."]}, {"page": "Jamaica Inn (2014 TV series)", "response": ["The three-part series was commissioned by Ben Stephenson and Danny Cohen, both from the BBC. Filming began in September 2013 in Cornwall, Yorkshire and Cumbria (Kirkby Lonsdale). It was originally decided that the series would be filmed in Northern Ireland. An investment from Screen Yorkshire was provided for the series."]}, {"page": "From There to Here", "response": ["Filming began in Manchester in September 2013. The series was commissioned by Danny Cohen and Ben Stephenson. Tim Bricknell is the producer and the executive producers are Peter Bowker, Derek Wax and Stephen Wright."]}, {"page": "The Game (British TV series)", "response": ["On 30 November 2012, BBC Cymru Wales, the division of the BBC for Wales, announced the commissioning of the series. The drama was commissioned by Danny Cohen, the controller of BBC One, and Ben Stephenson, the controller of drama commissioning for the BBC."]}]}}