{"wiki_id": "http://www.wikidata.org/entity/Q5220603", "itemLabel": "Danny McAlinden", "itemDescription": "Irish boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_McAlinden", "wikipedia_page": {"main": "Danny McAlinden (1 June 1947 – 8 March 2021) was a heavyweight boxer from Northern Ireland who was British and Commonwealth champion in 1972 when he defeated Jack Bodell in two rounds at the Aston Villa football ground. McAlinden nick named \"Dangerous Dan\" was managed by George Middleton. Middleton had lead Randolph Turpin to the World Middleweight Championship in 1951.McAlinden was born in Newry at the age of 15 he moved to Coventry. In 1966 McAlinden represented Northern Ireland at the Kingston British Empire and Commonwealth Games winning a bronze medal in the heavyweight division. In 1967 he fought at the European Championship in Rome.    He turned professional in 1969 and in his second professional fight, he stopped the future British champion Richard Dunn. On the program of the  Joe Frazier versus Muhammad Ali I bout on March 8, 1971, at the Madison Square Garden in New York, New York, United States, McAlinden outpointed Ali's brother, Rahman, who was undefeated in seven previous fights, in a contest of prospects, by decision after six rounds. He was at one time considered a potential opponent for the world champion George Foreman's first title defence. However, his form dipped and in 1973 he began to lose fights, eventually losing his title in 1975 to Bunny Johnson in nine rounds. He attempted to win back the title in 1975 when the holder was Richard Dunn, but he lost in round two. He fought on until 1981 and after refusing to face the explosive punching David Pearce he decided to retire.  In total he had 45 fights with a 31–12–2 record, winning 28 by knockout.\nIn 2010 it was reported that he was suffering from cancer of the tongue.", "link_mentions": [{"page": "Rahman Ali", "response": ["| align=left |  Danny McAlinden"]}, {"page": "Newry", "response": ["*Danny McAlinden, heavyweight boxer"]}, {"page": "Villa Park", "response": ["Many athletics and cycle events took place at the ground before the First World War,Inglis, Simon (1997) p.141 and boxing has been hosted on several occasions. On 28 June 1948, Dick Turpin, brother of Randolph Turpin, became the first non-white boxer to win a British title in a fight against Vince Hawkins in front of 40,000 spectators after the British Boxing Board of Control lifted their ban on non-whites challenging for titles.Inglis, Simon (1997), p.138 On 21 June 1972 Danny McAlinden defeated Jack Bodell in a British and Empire Heavyweight title fight.Inglis, Simon (1997), p.195"]}, {"page": "1966 British Empire and Commonwealth Games", "response": ["|Heavyweight||Men||Bill Kini ||Adonis Ray ||Danny McAlinden Benson Ocan "]}, {"page": "Richard Dunn (boxer)", "response": ["A southpaw, Dunn's professional career began with a win over Cardiff fighter Del Phillips in a heavyweight eliminator competition in Mayfair, London in July 1969. His second fight was on the same day in the semi-final. It was a first-round defeat against Danny McAlinden, who dispatched all three of his opponents in under three rounds to win the competition. However, in May 1973, Dunn defeated Billy Aird on points in an eliminator for the British Heavyweight Championship at Grosvenor House in London. He lost the final eliminator against Bunny Johnson, in October, after a tenth-round knockout at the King's Hall in Manchester. However, when he faced the same opponent at the Empire Pool at Wembley for both the British and Commonwealth titles in September 1975, he prevailed on points, after 15 rounds.", "|align=left| Danny McAlinden", "|align=left| Danny McAlinden"]}, {"page": "Jack O'Halloran", "response": ["During his boxing career, O'Halloran defeated former title contenders Cleveland Williams and Manuel Ramos. He also defeated Danny McAlinden, who won a bronze medal in boxing at the 1966 British Empire and Commonwealth Games in Kingston, Jamaica and later became the British and Commonwealth Heavyweight Champion. O'Halloran's losses included defeats to Joe Roman (twice), Joe Bugner, Ron Lyle, and future heavyweight champions George Foreman and Ken Norton.", "|align=left| Danny McAlinden"]}, {"page": "List of British heavyweight boxing champions", "response": ["|align=left | Danny McAlinden"]}, {"page": "Jack Bodell", "response": ["Born in Swadlincote, Derbyshire, Bodell started out as a light heavyweight, winning the 1961 ABA championships and a bronze medal at the European amateur championships the same year. He won the British heavyweight championship in 1969, before losing it to Henry Cooper in his first defence. Bodell regained the title a year later by outpointing Joe Bugner. He lost the European title in 1971 after a defeat by Spaniard José Manuel Urtaín, and after losing both his British and Commonwealth titles to a second-round knockout by Danny McAlinden in June 1972, he retired from professional boxing.", "|align=left| Danny McAlinden"]}, {"page": "McAlinden", "response": ["*Danny McAlinden (born 1947), Northern Ireland footballer"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Danny McAlinden"]}, {"page": "Bunny Johnson", "response": ["Bunny Johnson (born 10 May 1947 in Jamaica)Bunny Johnson - Boxer is a retired boxer who was British heavyweight Champion in 1975 beating Danny McAlinden by a knockout, becoming in the process Britain's first Black Heavyweight Boxing Champion. He also enjoyed success in the light-heavyweight division and won a Lonsdale belt outright.", "|align=left| Danny McAlinden"]}, {"page": "Dennis Avoth", "response": ["Avoth was back to winning ways in the first half of 1969, remaining unbeaten in six fights, though all were through points decision. His run was broken in May when he faced future British heavyweight champion Bunny Johnson at the Midlands Sporting Club in Solihull. The eight round fight went the full distance, with the bout being awarded to Johnson. This was followed by a draw against his amateur title opponent Del Phillips, before Avoth again faced a future British heavyweight champion, Danny McAlinden. The fight against McAlinden was part of a national heavyweight competition held in Mayfair, London for a prize of £1,000. The eight-man knockout contest was scheduled for three rounds per bout and Avoth faced Manchester-based fighter Obe Hepburn in the quarter finals. After beating Hepburn on points, he then beat Billy Wynter by the same decision in the semi-final. The other semi-final was between McAlinden and another future champion, Richard Dunn. McAlinden knocked out Dunn in the first round, and then managed to stop Avoth in the final again in the first round, but this time via technical knockout. Avoth fought once more in 1969, a loss to Central Area champion, Billy Aird, before readjusting his sights on a new challenge, the Welsh heavyweight title, held by North Walian Carl Gizzi.", "|align=left| Danny McAlinden"]}, {"page": "Deaths in March 2021", "response": ["*Danny McAlinden, 73, Northern Irish boxer.Boxing hero Danny McAlinden death announced 50 years on from beating Ali junior"]}, {"page": "2021 in Northern Ireland", "response": ["8 March - Danny McAlinden (b 1947), boxer."]}]}}