{"wiki_id": "http://www.wikidata.org/entity/Q522894", "itemLabel": "Miriam Karlin", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Miriam_Karlin", "wikipedia_page": {"main": "Miriam Karlin  (23 June 1925 – 3 June 2011) was an English actress whose career lasted for more than 60 years. She was known for her role as Paddy in The Rag Trade, a 1960s BBC and 1970s LWT sitcom, and in particular for the character's catchphrase \"Everybody out!\" Her trademark throughout her career was her deep, husky voice and well-spoken London accent.", "link_mentions": [{"page": "June 23", "response": ["*1925 – Miriam Karlin, English actress (died 2011)"]}, {"page": "Sid James", "response": ["His first major comedy role was in The Lavender Hill Mob (1951): with Alfie Bass, he made up the bullion robbery gang headed by Alec Guinness and Stanley Holloway. He also appeared in Lady Godiva Rides Again and The Galloping Major, both films were released in 1951, and as Harry Hawkins in The Titfield Thunderbolt (1953), and also had a lead role in The Wedding of Lilli Marlene. He featured in another Alec Guinness film, Father Brown (US: The Detective, 1954) and in Trapeze (1956) as Harry the snake charmer, a circus film which was one of the most successful films of its year, and he played Master Henry in \"Outlaw Money\" (also 1956), an episode of The Adventures of Robin Hood. James had a supporting part as a TV advertisement producer in Charlie Chaplin's A King in New York, a non-comic supporting role as a journalist in the science-fiction film Quatermass 2, and he performed in Hell Drivers (all 1957), a film with Stanley Baker. The next year, James starred with Miriam Karlin in East End, West End by Wolf Mankowitz, a half-hour comedy series for the ITV company Associated Rediffusion. Set within the Jewish community of London's East End, the series of six episodes was transmitted in February and March 1958, but plans for further episodes were abandoned after a disappointing response. For a while though, it had looked as if his commitment elsewhere might end his work with Tony Hancock, one of the most popular television comedians of the time.Cliff Goodwin Sid James: A Biography, London: Virgin Books, 2001, p.121-22"]}, {"page": "Fiddler on the Roof", "response": ["| style=\"text-align:center;\" | Miriam Karlin", "The original London West End production opened on February 16, 1967, at Her Majesty's Theatre and played for 2,030 performances.Fiddler On The Roof, Guide to Musical Theatre, accessed July 24, 2016. It starred Topol as Tevye, a role he had previously played in Tel Aviv, and Miriam Karlin as Golde. Alfie Bass, Lex Goudsmit and Barry Martin eventually took over as Tevye.Replacements 1967, Thisistheatre.com, accessed May 25, 2020 Topol later played Tevye in the 1971 film adaptation, for which he was nominated for an Academy Award, and in several revivals over the next four decades.Heller, Aron. \"Iconic Israeli Actor Chaim Topol Reflects Upon His Long Career\", Haaretz, April 21, 2015, accessed August 4, 2016; and Propst, Andy. \"Harvey Fierstein Replaces Topol in Fiddler on the Roof Tour\", TheaterMania.com, November 11, 2009, accessed July 24, 2016 The show was revived in London for short seasons in 1983 at the Apollo Victoria Theatre and in 1994 at the London Palladium."]}, {"page": "Room at the Top (1959 film)", "response": ["* Miriam Karlin as Gertrude (uncredited)"]}, {"page": "2001 in film", "response": ["| The Man Who Cried || Universal Focus || Sally Potter (director/screenplay); Christina Ricci, Cate Blanchett, John Turturro, Johnny Depp, Harry Dean Stanton, Oleg Yankovsky, Miriam Karlin, Salvatore Licitra, Iva Bittova || Drama || Live action"]}, {"page": "Journey into Space", "response": ["|Miriam Karlin"]}, {"page": "Chesney and Wolfe", "response": ["Around the same time, the two men created The Rag Trade (1961–63), starring Peter Jones as Harold Fenner, ungenerous head of Fenner Fashions, Miriam Karlin as the shop steward, Paddy, and Reg Varney as the foreman trying to mediate the conflict between employer and employed in a London East End sweat-shop. Sheila Hancock and Barbara Windsor were also in the cast, plus the diminutive Esma Cannon. Directed (and produced) by Dennis Main Wilson, Karlin wrote in her autobiography that Main Wilson had an \"amazing capacity for picking the right people\" for a cast.", "In 1977, following the BBC's rejection of a new pilot episode, The Rag Trade was revived by LWT for the ITV network, with Peter Jones and Miriam Karlin returning; it lasted for two series. Anna Karen was \"transplanted\" into the cast (as Anthony Hayward expressed it in 2011) to play her Olive character from On The Buses. Karlin, however, encouraged to return to the role by a promise from Chesney and Wolfe of a more ethnically diverse cast, ultimately regretted her involvement, believing the sole black character was merely a token."]}, {"page": "Torch Song Trilogy", "response": ["| align=\"center\" |Miriam Karlin"]}, {"page": "84, Charing Cross Road", "response": ["In 1981, James Roose-Evans adapted it for the stage and it was first produced at the Salisbury Playhouse with a cast headed by Rosemary Leach as Hanff and David Swift as Doel. It transferred to the West End, where it opened to universally ecstatic reviews. It toured nationally and was performed by Miriam Karlin in 1990 and later by Rula Lenska and Bill Gaunt. It returned to the Salisbury Playhouse in 2015, running 5–28 February with Clive Francis and Janie Dee in the lead roles. It was also performed at the Cambridge Arts Theatre in 2018 by Clive Francis and Stefanie Powers, before embarking on a UK tour."]}, {"page": "The Wednesday Play", "response": ["| Michael RedgraveMiriam KarlinHarold Lang"]}, {"page": "Juke Box Jury", "response": ["* 20 January 1962 – Miriam Karlin, Alan Freeman, Jimmy Henney, June Thorburn", "* 14 April 1962 - Sid James, Miriam Karlin, Carole Carr, Robert Farnon", "* 26 June 1965 - Sam Costa, Miriam Karlin, Sylvie Vartan, Bobby Vinton"]}, {"page": "The Man Who Cried", "response": ["One day, Dante is rifling through Suzie's things after a dalliance with Lola in the apartment, and deduces her Jewish heritage after finding her father's photo. An elderly Jewish neighbour downstairs, Madame Goldstein (Miriam Karlin), also knows that Suzie is Jewish and has warned her of the dangers on the horizon as the Germans invade Poland. The following year, as the Germans invade France and approach Paris, an exodus begins of Jews and other people threatened by Nazism. Crowds for the operatic show dwindle, and eventually the only cast members left are Dante and Suzie. When Dante attempts to seduce Suzie, she rebuffs him. He lashes out at her for her heritage and her relationship with Cesar, whose heritage he also scorns. Perlman comes to her defence; he reminds Dante that as an Italian in Paris at that time, should Mussolini align with the Nazis, Dante's own position in Paris would be precarious. Perlman closes down the show; the Nazis enter Paris the following morning.", "* Miriam Karlin as Madame Goldstein"]}, {"page": "A Clockwork Orange (film)", "response": ["* Miriam Karlin as \"Catlady\" Weathers"]}, {"page": "The Millionairess", "response": ["* Miriam Karlin as Mrs. Joe"]}, {"page": "The Mavis Bramston Show", "response": ["The Mavis cast, which changed considerably over its three-year run, initially featured many imported or expatriate British performers such as Gordon Chater, Carol Raye, Miriam Karlin, Ronnie Stevens and  Hazel Phillips, alongside experienced Australian actors such as John Bluthal who was becoming well known in Britain, and Australian performers such as June Salter, Barry Creyton, Ron Frazer, Barbara Angell, Noeline Brown and Reg Livermore, who were relative newcomers to TV but who, between them, had decades of experience in music, theatre, cabaret and revue.", "During its three-year run, other regular cast members and guests included June Salter (1964 pilot, 1965–1967), Miriam Karlin (1965), John Bluthal (1965), Ron Frazer (1965–1968), Hazel Phillips (1965–68), Ronnie Stevens (1965–66), Neva Carr Glyn (1966), June Thody (1966), Barbara Angell (1966–1968, also a scriptwriter), Andonia Katsaros (1966–1968), Peter Reeves (1967), Bryan Davies (1964), Dawn Lake (1967), Johnny Lockwood (1967–1968) and Reg Livermore (1968).\"The Australian Film and Television Companion\" — compiled by Tony Harrison – Simon & Schuster Australia, 1994 Barbara Wyndon and Al Thomas guest starred in some episodes. Among the crew was a young production assistant, Peter Weir, who went on to become one of Australia's best-known and most successful film directors.", "Despite the addition of a co-producer, Raye was soon exhausted by the frantic pace and she left the series midway through 1965. At this stage Seven still felt it necessary to import talent from the UK, and her place was taken by British TV star Miriam Karlin, who was well known for her role as the gravel-voiced, chain-smoking shop steward in the popular BBC sitcom The Rag Trade. In 1966, when Chater departed, Seven brought in British actor-comedian Ronnie Stevens.", "During 1965–66 the focus of the sketches gradually shifted from topical political humour to broader social satire and more conventional revue-style material. Popular sketches included Chater's famous \"Pie Eater\" routine, in which he played a stereotypical Ocker character in a singlet and handkerchief hat, who crams pies into his mouth while extolling the virtues of the \"June Dilly-Potkins School of Charm\" (a joke on the real-life deportment schools founded by former model June Dally-Watkins). Another recurring sketch was devised by and featured Miriam Karlin who, with Gordon Chater, played an elderly couple who sit on a park bench and talk to each other without communicating."]}, {"page": "Heavens Above!", "response": ["* Miriam Karlin as Winnie Smith"]}, {"page": "List of female movie actors by name: J–K", "response": ["*Miriam Karlin (1925–2011)"]}, {"page": "Garrick Theatre", "response": ["* 1960 – Lionel Bart's Fings Ain't Wot They Used T'Be began a two-year run with Miriam Karlin"]}, {"page": "The Rag Trade", "response": ["The action centred on a fictional small clothing workshop (the title is a reference to the textile industry), Fenner's Fashions in London. Although run by Harold Fenner (Peter Jones) and the foreman and pattern cutter Reg Turner (Reg Varney), the female workers are led by militant shop steward Paddy Fleming (Miriam Karlin), ever ready to strike, with the catchphrase \"Everybody out!\" Other cast members included Sheila Hancock (as Carole Taylor), Esma Cannon (as Lily Swann), Wanda Ventham (as Shirley) in series 2 and Barbara Windsor (as Gloria, during series 1, who later returned as Judy in series 3) replacing Sheila Hancock.", "* Miriam Karlin as Paddy Fleming", "* Miriam Karlin as Paddy Fleming"]}, {"page": "Fings Ain't Wot They Used T'Be", "response": ["Norman initially wrote the piece as a play (with no music), but after Joan Littlewood read it, she asked Bart to write the music and lyrics. It was first performed by Theatre Workshop, produced and directed by Littlewood in February 1959 at their home, the Theatre Royal Stratford East. It subsequently played at the Garrick Theatre in London's West End, starting on 11 February 1960. It ran for 886 performances. The cast featured Maurice Kaufmann, Wallas Eaton, Miriam Karlin, James Booth, Barbara Windsor, Toni Palmer, Bryan Pringle, Ray Ausin, Tom Chatto, Paddy Joyce, Edward Caddick, Yootha Joyce, George Sewell, Michael O'Brien, Rick Morgan, Louis Adams, Neville Munroe, Mary Davies, Mary Sheen, Barbara Cording, Donald Wilson, James Dark and Tamba Allen.", "Whilst the show was playing at the Garrick Theatre, record producer Norman Newell collected British film, television, singing and stage stars to release an all star recording of the show. Tony Osborne provided musical direction, with John Barry and His Orchestra providing backing on two songs with Adam Faith. The cast included the author Lionel Bart himself, Alfie Bass, Adam Faith, Harry Fowler, Joan Heal, Sidney James, Alfred Marks, Marion Ryan, Tony Tanner, and the Williams Singers. The finale with the entire company also had vocals with \"several celebrities present at the session\" (according to the liner notes), including Glen Mason, Sean Connery, John Burgess, Pip Wedge, Jimmy Henney, Stella Tanner, and from the Garrick Theatre original cast, Miriam Karlin. The album was released in 1960 on the HMV label (CLP 1358)."]}, {"page": "The Attic: The Hiding of Anne Frank", "response": ["*Miriam Karlin – Mrs. Samson"]}, {"page": "So Haunt Me", "response": ["Peter Rokeby (played by George Costigan) loses his job as advertising copywriter, and resolves to become a freelance writer.  Owing to this change in circumstances, he and his wife Sally (Tessa Peake-Jones) move with their children into a more modest home in Meadow Road, Willesden.  The family soon finds that the ghost of a previous owner, Yetta Feldman (Miriam Karlin), still occupies the residence, and has been scaring occupants away for years.  Yetta is a stereotypical interfering, middle-aged Jewish mother who died suddenly after choking on a chicken bone.  While Sally can both see and speak to their ghost, Peter — much to his frustration — initially cannot.  The family agrees to help Yetta find her grown-up daughter Carole (\"Carol-with-an-E\")."]}, {"page": "The Phantom of the Opera (1962 film)", "response": ["* Miriam Karlin as Charwoman"]}, {"page": "The Caretaker", "response": [":Cast: Miriam Karlin played Davies – the first time a woman performed the title role – with Mark Lewis Jones (Aston) and Gary Lilburn (Mick). Directed by Annie Castledine."]}, {"page": "Clarence Derwent Awards", "response": ["* 1998 Miriam Karlin as Zofia in Tongue of a Bird"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Miriam Karlin (Acting Diploma 1946)"]}, {"page": "Mahler (film)", "response": ["*Miriam Karlin as Aunt Rosa"]}, {"page": "Glynn Edwards", "response": ["Edwards trained professionally as an actor with Joan Littlewood's Theatre Workshop, appearing in its productions of The Good Soldier Švejk and two plays by Brendan Behan, The Quare Fellow and The Hostage, all of which transferred from the Theatre Royal Stratford East to the West End. He also appeared in that company's production of Lionel Bart's musical version of Frank Norman's play Fings Ain't Wot They Used T'Be, opposite Miriam Karlin and Barbara Windsor."]}, {"page": "Down Among the Z Men", "response": ["* Miriam Karlin as Woman in Shop"]}, {"page": "List of British Jewish entertainers", "response": ["*Miriam Karlin (1925–2011), actress"]}, {"page": "I Thank a Fool", "response": ["The film stars Susan Hayward and Peter Finch with Diane Cilento and Cyril Cusack. Also in the cast are Kieron Moore, Richard Wattis, Athene Seyler, Miriam Karlin, Laurence Naismith, J. G. Devlin, Clive Morton, Richard Leech and Brenda De Banzie.", "* Miriam Karlin as Woman in the Black Maria"]}, {"page": "Hand in Hand (film)", "response": ["*Miriam Karlin as Mrs. Mathias"]}, {"page": "Crossroads to Crime", "response": ["Crossroads to Crime is a 1960 British crime film produced and directed by Gerry Anderson and distributed by Anglo-Amalgamated (AA). Starring Anthony Oliver, George Murcell, Miriam Karlin, David Graham and Ferdy Mayne, Crossroads to Crime is about a police constable who works undercover to bring down a gang of lorry hi-jackers. Made as a B movie by Anderson's production company AP Films (APF), which made children's puppet television series, it was APF's first film production as well as its first production with live actors. It was also the  only film that Anderson directed.", "While on the beat, Police Constable Don Ross (Anthony Oliver) discovers a gang of lorry hi-jackers operating from the back of a transport café. Gang members Diamond and Johnny (George Murcell and David Graham) drive away in a car with the café owner, Connie Williams (Miriam Karlin), held hostage in the back seat. Ross tries to stop the car by jumping onto its side but is thrown to the ground and suffers a head injury. Pretending to be innocent passers-by, Diamond and Johnny take Ross home. Williams is brought before the hi-jackers' affluent ringleader, Miles (Ferdy Mayne), who warns her not to betray them to the authorities.", "According to Anderson, Ferdy Mayne sometimes misinterpreted the script, with humorous results. A scene between Ross and café owner Connie (Miriam Karlin) required several takes to film when Karlin repeatedly upstaged Oliver, altering the physical arrangement of the two shot so that the other actor ended up with his back to the camera. Terence Brook, who was known for his appearances in adverts for Strand cigarettes and was cast as gangster Harry on the basis of his \"tough guy\" image, was doubled by editor and second unit director David Elliott for a stunt that involved his character jumping off the back of a lorry. Sylvia Thamm, one of the co-directors of APF, served uncredited as script supervisor; she and Anderson were married later in 1960 after Anderson divorced his first wife."]}, {"page": "List of American films of 1971", "response": ["|A Clockwork Orange || Stanley Kubrick || Malcolm McDowell, Patrick Magee, Adrienne Corri, Miriam Karlin || drama || Warner Bros."]}, {"page": "Dark Ages (TV series)", "response": ["*Miriam Karlin - Hag"]}, {"page": "Flashbacks of a Fool", "response": ["Flashbacks of a Fool is a 2008 British drama film about a Hollywood actor who, following the death of his childhood best friend, reflects upon his life and what might have been, had he stayed in England. The film was directed by Baillie Walsh, and stars Daniel Craig, Harry Eden, Claire Forlani, Felicity Jones, Emilia Fox, Eve, Jodhi May, Helen McCrory and Miriam Karlin.", "* Miriam Karlin as Mrs. Rogers"]}, {"page": "2011 in film", "response": ["| style=\"text-align:center;\"| 3 || Miriam Karlin || style=\"text-align:center;\"| 85 || style=\"text-align:center;\"| British || style=\"text-align:center;\"| Actress || "]}, {"page": "James Roose-Evans", "response": ["In the summer of 1980, Roose-Evans went to teach a practical course in Experimental Theatre in Grand Rapids, Michigan. His assistant there, Susan Kruger, gave him a copy of Helene Hanff's 84, Charing Cross Road, which he then adapted for the stage. He directed the world premiere at the Salisbury Playhouse in the summer of 1981. It transferred to the West End, winning awards for Rosemary Leach as Best Actress and for Roose-Evans as Best Director. In 1982 he directed an American cast in the play on Broadway, with Ellen Burstyn and Joe Maher in the leading roles, where it won further awards for Best Actress, Best Actor, Best Director and Best Play. James subsequently directed tours of 84, the first with Miriam Karlin as Helene, and then Rula Lenska. In February 2015 his new production of 84 Charing Cross Road opened at Salisbury with Janie Dee as Helene and Clive Francis as Frank Doel."]}, {"page": "Ladies Who Do", "response": ["*Miriam Karlin as Mrs. Higgins"]}, {"page": "On the Fiddle", "response": ["* Miriam Karlin as WAAF Sergeant"]}, {"page": "List of British actors", "response": ["* Miriam Karlin (1925–2011)"]}]}}