{"wiki_id": "http://www.wikidata.org/entity/Q5220341", "itemLabel": "Danny Farrant", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Danny_Farrant", "wikipedia_page": {"main": "Danny Farrant (born in Weston-super-Mare, England) is the current drummer in the British punk band Buzzcocks, having joined the group following Phil Barker's departure in 2006.", "link_mentions": [{"page": "Buzzcocks", "response": ["Buzzcocks have reformed several times since 1989, featuring Shelley and Diggle with other musicians; initially with Maher and Garvey for a world tour, then briefly replacing Maher with Smiths drummer Mike Joyce. In 1992, Tony Barber joined on bass and Phil Barker on drums. This line-up toured on one of Nirvana's last tours in 1994. Buzzcocks toured as support for Pearl Jam in 2003. In April 2006, Barker left and was replaced by Danny Farrant. In March 2006, the band released their eighth studio album, Flat-Pack Philosophy, on Cooking Vinyl Records, the supporting tour found them playing on a leg of the mid-2006 Vans Warped Tour.", "* Danny Farrant – drums (2006–present)"]}, {"page": "List of drummers", "response": ["* Danny Farrant (Buzzcocks)"]}, {"page": "Farrant", "response": ["*Danny Farrant, English drummer"]}, {"page": "Dominic Green (writer and musician)", "response": ["Green is a professional jazz guitarist and arranger. Artists he has worked with include Burt Bacharach, Elvis Costello, Dionne Warwick, Sacha Distel, Big Jay McNeely, Benny Green, Deniece Williams, Bettye Lavette, Ray Gelato, John Dankworth, Doris Troy, Kym Mazelle, Gary Baldwin Portishead, Colin Edwyn (Porcupine Tree), Danny Farrant (Buzzcocks), The Karminsky Experience Inc., and the James Taylor Quartet."]}, {"page": "Flat-Pack Philosophy", "response": ["Flat-Pack Philosophy was released on 7 March 2006; it was promoted with a UK tour with support from the Adored. Between March and May 2006, the band played across Europe, which included appearances at the Bourge Festival and Festival of the Arts. Partway through this trek, drummer Phil Barker left the band and was replaced by Danny Farrant. In June 2006, they played a few US East Coast shows prior to joining that year's Warped Tour, and then headlining another month's worth of shows with support from the Adored, the Strays, and Easy Image."]}, {"page": "Morning Star (Spear of Destiny album)", "response": ["*Danny Farrant - drums"]}, {"page": "The Way (Buzzcocks album)", "response": ["* Danny Farrant – drums"]}]}}