{"wiki_id": "http://www.wikidata.org/entity/Q5237585", "itemLabel": "David Mills", "itemDescription": "British footballer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Mills_(footballer)", "wikipedia_page": {"main": "David Mills (born 6 December 1951) is an English former footballer most notable for his career with Middlesbrough and becoming England's first £500,000 footballer.He is currently working as the head scout for Leicester City.", "link_mentions": [{"page": "Jack Charlton", "response": ["Charlton took advice from Celtic manager Jock Stein, who allowed him to sign right-sided midfielder Bobby Murdoch on a free transfer. Besides Murdoch the club already had ten players who Charlton moulded into a championship winning side: Jim Platt (goalkeeper), John Craggs (right-back), Stuart Boam and Willie Maddren (centre-backs), Frank Spraggon (left-back), David Armstrong (left midfield), Graeme Souness (central midfield), Alan Foggon (attacking midfield), John Hickton and David Mills (forwards). Some of these players were already settled at the club and in their positions, whilst Charlton had to work with some of the other players. He moved Souness from left midfield to central midfield to compensate for his lack of pace and coached him to play the ball forward rather than side to side as was his instinct. Foggon was played in a new role which Charlton created to break the offside trap set by opposition defenders, an extremely fast player he was instructed to run behind defenders and latch on to the long ball to find himself one-on-one with the goalkeeper."]}, {"page": "Cyrille Regis", "response": ["Shortly after bringing Regis to Albion, Allen took over as team manager, following the resignation of his predecessor Johnny Giles. Regis made his first team debut in a League Cup match against Rotherham United on 31 August 1977, scoring twice in a 4–0 win.Matthews (2002), p. 25. Three days later Regis made his league debut in a 2–1 victory over Middlesbrough.Matthews (2007), p. 332. Again he found the net, taking the ball from the halfway line to the penalty area before scoring with a right-foot drive. Middlesbrough's David Mills, who later became a teammate of Regis at Albion, described it as \"a goal of sheer brilliance\"."]}, {"page": "Gordon McQueen", "response": ["On 29 April 2008, McQueen had returned to Boro as assistant scout, alongside  David Mills."]}, {"page": "Progression of the British football transfer fee record", "response": ["The 1970s saw a rapid increase in transfer fees. Martin Peters became the first £200,000 player in 1970, but by 1977 Kevin Keegan's move to West Germany's Hamburger SV had taken the record to £500,000. In January 1979 David Mills became the first player to be purchased for £500,000 by a British club, but just one month later Nottingham Forest paid twice that amount to acquire Birmingham City's Trevor Francis. In 1981 Bryan Robson cost Manchester United £1,500,000, but fees paid by British clubs lagged behind those paid by clubs in Italy, France and Spain to take British players abroad until 1995, when Manchester United paid Newcastle United £7,000,000 for Andy Cole. The fees paid by the Premier League's top clubs began to increase at a rapid rate, with Alan Shearer commanding the first £15,000,000 fee in 1996, and the new millennium heralding the first £30,000,000 transfer, although sources differ as to whether this barrier was broken by Rio Ferdinand's move to Manchester United in 2002 or Andriy Shevchenko's transfer to Chelsea four years later."]}, {"page": "1978–79 in English football", "response": ["7 January 1979: West Bromwich Albion pay a national record £516,000 for Middlesbrough defender David Mills.", "9 February 1979: Trevor Francis becomes Britain's first £1million footballer when he is transferred from Birmingham City to Nottingham Forest, doubling the British record fee set when West Bromwich Albion signed David Mills last month.", "3 March 1979: Chelsea débutant goalkeeper Petar Borota picks up a clean sheet against Liverpool, while Osvaldo Ardiles and David Mills score their first goals for their clubs: the Argentine internationalist bags a brace in Tottenham's 2–0 win over Derby County while Mills contributes to West Bromwich Albion's 3–1 win over Coventry City."]}, {"page": "David Mills", "response": ["David Mills may refer to:", "* David Mills (author) (born 1959), American atheist and author", "* David Mills (bass) (born 1929), Canadian bass, poet, composer and actor", "* David Mills (Canadian politician) (1831–1903), Canadian politician, author, poet and jurist", "* David Mills (comedian), British-based American comedy actor and cabaret artist", "* David Mills (cricketer) (1937–2013), former English cricketer", "* David Mills (editor) (born 1957), American editor and writer in Christian media", "* David Mills (footballer) (born 1951), English footballer", "* David Mills (solicitor) (born 1944), British lawyer", "* David Mills (rugby league) (born 1981), English rugby league footballer", "* David Mills (solar researcher) (born 1946), Australian scientist", "* David Mills (TV writer) (1961–2010), American journalist, screenwriter and television producer", "* Detective David Mills, a fictional character in the 1995 film Seven, played by Brad Pitt"]}, {"page": "List of Middlesbrough F.C. seasons", "response": ["|David Mills || 18", "|David Mills || 16", "|David Mills || 14"]}, {"page": "List of Middlesbrough F.C. players", "response": ["|Forward||1968–19791984–1985||–||||||David Mills' sale to West Bromwich Albion was a British football record transfer fee at the time, with a fee of approximately £500,000."]}, {"page": "2007–08 Middlesbrough F.C. season", "response": ["Former Boro legend David Mills and former first team coach and Sky Sports pundit Gordon McQueen returned to Middlesbrough to expand the recruitment department in April, under chief scout Dave Leadbeater, and alongside the Academy recruitment team.", "|First team scout              || David Mills"]}, {"page": "2008–09 Middlesbrough F.C. season", "response": ["|First team scout              || David Mills"]}, {"page": "1978–79 West Bromwich Albion F.C. season", "response": ["Albion made two big money signings during the course of the season, bringing in David Mills from Middlesbrough in January 1979 for a club record £516,000. Mills however struggled to get into the team and when he left the club for Sheffield Wednesday in 1983 it was for half a million pounds less than Albion had paid for him.Glen Willmore, The Hawthorns Encyclopedia, Mainstream Publishing, 1996, p. 121 Willie Johnston, who had been sent home from the 1978 FIFA World Cup after failing a drug test, left the club for Vancouver Whitecaps on a £100,000 deal.", "| David Mills || FW || 18 || 3 || 4 || 0 || 0 || 0 || 0 || 0"]}, {"page": "Len Cantello Testimonial Match", "response": ["The West Brom XI team featured Tony Godden, Paddy Mulligan, Derek Statham, Tony Brown, John Wile, Bryan Robson, Johnny Giles, John Trewick, Alistair Brown, Len Cantello, David Mills, David Stewart, Martyn Bennett and Kevin Summerfield.", "|CF || || David Mills"]}]}}