{"wiki_id": "http://www.wikidata.org/entity/Q5230137", "itemLabel": "Dave Winfield", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Winfield_(footballer)", "wikipedia_page": {"main": "David Thomas Winfield (born 24 March 1988) is an English semi-professional footballer who plays as a defender for National League South club Chelmsford City.", "link_mentions": [{"page": "Dave Winfield", "response": ["thumb|Dave Winfield in 2006", "When Winfield joined the New York Yankees, he set aside $3 million of his contracted salary for the Winfield Foundation. The foundation created a partnership with the Hackensack University Medical Center including founding The Dave Winfield Nutrition Center, near his Teaneck, New Jersey home. The Foundation also partnered with Merck Pharmaceuticals and created an internationally acclaimed bilingual substance abuse prevention program called \"Turn it Around\".", "*Dave Winfield at SABR (Baseball BioProject)", "*Dave Winfield "]}, {"page": "Gareth Ainsworth", "response": ["Ainsworth lost striker Joel Grant to Championship club Yeovil Town at the start of the 2013–14 season, and signed attackers Jon-Paul Pittman, Steven Craig, and Paris Cowan-Hall to replace him. Defenders Dave Winfield and Charles Dunne also left Wycombe for clubs in higher divisions (though Dunne was loaned back to Wycombe for the season as part of the transfer). He signed right-back Nick Arnold and midfielder Billy Knott on loan. In the January transfer window he sold 18-year-old centre-back Kortney Hause to Wolverhampton Wanderers, and signed 19-year-old former Arsenal winger Anthony Jeffrey on a free transfer. Wycombe ended an eight match run without a win with a 1–0 victory over league leaders Chesterfield on 22 February, earning Ainsworth a mention as the Football League manager of the week. On the final day of the season Wycombe needed to win at Torquay United and hope results went their way elsewhere in order to stay up; they won their match 3–0 and finished outside of the relegation zone on goal difference."]}, {"page": "List of people from Aldershot", "response": ["* Dave Winfield (footballer) - footballer"]}, {"page": "2009–10 Aldershot Town F.C. season", "response": ["| Dave Winfield"]}]}}