{"wiki_id": "http://www.wikidata.org/entity/Q5236", "itemLabel": "Edward II of England", "itemDescription": "King of England; born in Caernarfon", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_II_of_England", "wikipedia_page": {"main": "Edward II (25 April 1284 – 21 September 1327), also called Edward of Caernarfon, was King of England from 1307 until he was deposed in January 1327. The fourth son of Edward I, Edward became the heir apparent to the throne following the death of his elder brother Alphonso. Beginning in 1300, Edward accompanied his father on campaigns to pacify Scotland. In 1306, he was knighted in a grand ceremony at Westminster Abbey. Following his father's death, Edward succeeded to the throne in 1307. He married Isabella, the daughter of the powerful King Philip IV of France, in 1308, as part of a long-running effort to resolve tensions between the English and French crowns.\nEdward had a close and controversial relationship with Piers Gaveston, who had joined his household in 1300. The precise nature of their relationship is uncertain; they may have been friends, lovers, or sworn brothers. Edward's relationship with Gaveston inspired Christopher Marlowe's 1592 play Edward II, along with other plays, films, novels and media. Gaveston's power as Edward's favourite provoked discontent both among the barons and the French royal family, and Edward was forced to exile him. On Gaveston's return, the barons pressured the king into agreeing to wide-ranging reforms, called the Ordinances of 1311. The newly empowered barons banished Gaveston, to which Edward responded by revoking the reforms and recalling his favourite. Led by Edward's cousin Thomas, 2nd Earl of Lancaster, a group of the barons seized and executed Gaveston in 1312, beginning several years of armed confrontation. English forces were pushed back in Scotland, where Edward was decisively defeated by Robert the Bruce at the Battle of Bannockburn in 1314. Widespread famine followed, and criticism of the king's reign mounted.\nThe Despenser family, in particular Hugh Despenser the Younger, became close friends and advisers to Edward, but Lancaster and many of the barons seized the Despensers' lands in 1321, and forced the king to exile them. In response, Edward led a short military campaign, capturing and executing Lancaster. Edward and the Despensers strengthened their grip on power, formally revoking the 1311 reforms, executing their enemies and confiscating estates. Unable to make progress in Scotland, Edward finally signed a truce with Bruce. Opposition to the regime grew, and when Isabella was sent to France to negotiate a peace treaty in 1325, she turned against Edward and refused to return. Instead, she allied herself with the exiled Roger Mortimer, and invaded England with a small army in 1326. Edward's regime collapsed and he fled to Wales, where he was captured in November. The king was forced to relinquish his crown in January 1327 in favour of his 14-year-old son, Edward III, and he died in Berkeley Castle on 21 September, probably murdered on the orders of the new regime.\nEdward's contemporaries criticised his performance as king, noting his failures in Scotland and the oppressive regime of his later years, although 19th-century academics later argued that the growth of parliamentary institutions during his reign was a positive development for England over the longer term.", "link_mentions": [{"page": "Actaeon", "response": ["* In Christopher Marlowe's play Edward II, courtier Piers Gaveston seeks to entertain his lover, King Edward II of England, by presenting a play based on the Actaeon myth. In Gaveston's version, Diane is played by a naked boy holding an olive branch to hide his loins, and it is  the boy-Diane who transforms Actaeon into a hart and lets him be devoured by the hounds. Thus,  Gaveston's (and Marlowe's) interpretation adds a strong element of homoeroticism, absent from the original myth.    "]}, {"page": "April 22", "response": ["*1355 – Eleanor of Woodstock, countess regent of Guelders, eldest daughter of King Edward II of England (b. 1318)"]}, {"page": "April 25", "response": ["*1284 – Edward II of England (d. 1327)"]}, {"page": "Braveheart", "response": ["Category:Cultural depictions of Edward II of England"]}, {"page": "February 7", "response": ["*1301 – Edward of Caernarvon (later king Edward II of England) becomes the first English Prince of Wales."]}, {"page": "Inch", "response": ["An Anglo-Saxon unit of length was the barleycorn. After 1066, 1 inch was equal to 3 barleycorns, which continued to be its legal definition for several centuries, with the barleycorn being the base unit. One of the earliest such definitions is that of 1324, where the legal definition of the inch was set out in a statute of Edward II of England, defining it as \"three grains of barley, dry and round, placed end to end, lengthwise\"."]}, {"page": "Pope Clement V", "response": ["On 4 April 1312, a Crusade was promulgated by Pope Clement V at the Council of Vienne. Another embassy was sent by Oljeitu to the West and to Edward II of England in 1313. The same year, Philip IV \"took the cross\", making the vow to go on a Crusade in the Levant.Jean Richard, \"Histoire des Croisades\", p. 485"]}, {"page": "Robin Hood", "response": ["Although de Ville does not explicitly connect John and Robert Deyville to Robin Hood, he discusses these parallels in detail and suggests that they formed prototypes for this ideal of heroic outlawry during the tumultuous reign of Henry III's grandson and Edward I's son, Edward II of England.de Ville 1999, pp. 108–09", "# \"Robyn Hode\" who is recorded as being employed by Edward II of England during 1323."]}, {"page": "Robert the Bruce", "response": ["Bruce's involvement in John Comyn's murder in February 1306 led to him being excommunicated by Pope Clement V (although he received absolution from Robert Wishart, Bishop of Glasgow). Bruce moved quickly to seize the throne, and was crowned king of Scots on 25 March 1306. Edward I's forces defeated Robert in the battle of Methven, forcing him to flee into hiding before re-emerging in 1307 to defeat an English army at Loudoun Hill and wage a highly successful guerrilla war against the English. Bruce defeated his other opponents, destroying their strongholds and devastating their lands, and in 1309 held his first parliament. A series of military victories between 1310 and 1314 won him control of much of Scotland, and at the Battle of Bannockburn in 1314, Robert defeated a much larger English army under Edward II of England, confirming the re-establishment of an independent Scottish kingdom. The battle marked a significant turning point, with Robert's armies now free to launch devastating raids throughout northern England, while also extending his war against the English to Ireland by sending an army to invade there and by appealing to the Irish to rise against Edward II's rule.", "In March 1309, Bruce held his first parliament at St. Andrews and by August he controlled all of Scotland north of the River Tay. The following year, the clergy of Scotland recognised Bruce as king at a general council. The support given him by the church, in spite of his excommunication, was of great political importance. On 1 October 1310 Bruce wrote Edward II of England from Kildrum in Cumbernauld Parish in an unsuccessful attempt to establish peace between Scotland and England. Over the next three years, one English-held castle or outpost after another was captured and reduced: Linlithgow in 1310, Dumbarton in 1311, and Perth, by Bruce himself, in January 1312. Bruce also made raids into northern England and, landing at Ramsey in the Isle of Man, laid siege to Castle Rushen in Castletown, capturing it on 21 June 1313 and denying the English the island's strategic importance."]}, {"page": "September 21", "response": ["*1327 – Edward II of England (b. 1284)"]}]}}