{"wiki_id": "http://www.wikidata.org/entity/Q5236379", "itemLabel": "David Laws", "itemDescription": "English rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Laws_(rugby_league)", "wikipedia_page": {"main": "David Laws (birth unknown) is a former rugby union, and professional rugby league footballer who played in the 1980s. He played club level rugby union (RU) for Old Hymerians RUFC (merged to become Hull RUFC), and representative level rugby league (RL) for Great Britain, and at club level for Hull Kingston Rovers, as a wing, i.e. number 2 or 5.", "link_mentions": [{"page": "David Laws", "response": ["Laws was born in Farnham, Surrey,David Laws; Five things I have learned BBC News, 14 March 2010, son of a Conservative-voting father who was a banker, and a Labour-voting mother. He has an older brother and a younger sister, both adopted.", "Shadow Chancellor George Osborne offered Laws a seat in the Conservative Shadow Cabinet, but was rebuffed, with Laws saying \"I am not a Tory, and if I merely wanted a fast track to a top job, I would have acted on this instinct a long time ago.\"Tories step up hunt for defectors, BBC News, 23 March 2007David Laws \"Open maw not big tent\", The Guardian (London), 22 June 2007 Following the resignation of Sir Menzies Campbell on 15 October 2007, Laws announced that he would not be a candidate for the leadership of the party.", "* David Laws MP official constituency website", "* Profile: David Laws, BBC News, 17 October 2007"]}, {"page": "1986 Kangaroo tour of Great Britain and France", "response": ["|LW ||5||David Laws"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* David Laws circa-1986"]}, {"page": "Laws (surname)", "response": ["* David Laws (born 1965), British politician", "* David Laws (rugby league), rugby union and rugby league footballer of the 1980s in Great Britain"]}, {"page": "David Laws (disambiguation)", "response": ["David Laws is a civil servant.", "David Laws may also refer to:", "*David Laws (rugby league)"]}, {"page": "1984–85 Yorkshire Cup", "response": ["|Dane O'Hara||5||David Laws"]}, {"page": "1985–86 Yorkshire Cup", "response": ["|David Laws||5||Tony Spears"]}, {"page": "1984–85 League Cup (rugby league)", "response": ["|David Laws||5||Dane O'Hara"]}, {"page": "1985–86 League Cup (rugby league)", "response": ["|Henderson Gill||5||David Laws", "|Shaun Wane (1)||T||David Laws (1)"]}, {"page": "1985–86 Challenge Cup", "response": ["|LW ||5|| David Laws"]}, {"page": "1983 Queensland rugby league tour of Papua New Guinea and England", "response": ["Hull KR: George Fairbairn (c), Garry Clark, Mike Smith, John Dorahy, Gary Prohm, Steve Hartley, Gordon Smith, Roy Holdstock, David Watkinson, Mark Broadhurst, Phil Hogan, Chris Burton, David Hall. Res – David Laws, Andy Kelly, Tracy Lazenby. Coach – Roger Millward"]}, {"page": "1983–84 Rugby League Premiership", "response": ["|5|| David Laws"]}, {"page": "1984–85 Rugby League Premiership", "response": ["|5|| David Laws"]}]}}