{"wiki_id": "http://www.wikidata.org/entity/Q5234492", "itemLabel": "David Gwynn", "itemDescription": "Welsh rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Gwynn", "wikipedia_page": {"main": "David 'Dai' Gwynn (28 December 1861 – 8 March 1910) was a Welsh international rugby union wing who played club rugby for Swansea, and county rugby for Lancashire. Gwynn played for Wales on six occasions and was the brother of William Gwynn, who also played international rugby for Wales.", "link_mentions": [{"page": "Swansea RFC", "response": ["*  David Gwynn "]}, {"page": "1910 in Wales", "response": ["*8 March - David Gwynn, Wales international rugby player, 48"]}, {"page": "1861 in Wales", "response": ["*28 December - David Gwynn, Wales international rugby player (died 1897)"]}, {"page": "1887 Home Nations Championship", "response": ["Wales: Hugh Hughes (Cardiff), David Gwynn (Swansea), Arthur Gould (Newport), George Bowen (Swansea), Billy Douglas (Cardiff), Jem Evans (Cardiff), William Williams (Cardiff), Bob Gould (Newport) capt., Alexander Bland (Cardiff), William Bowen (Swansea), D Morgan (Swansea), Evan Richards (Swansea), Tom Clapp (Newport), Willie Thomas (Llandovery), Thomas William Lockwood (Newport)"]}, {"page": "1890 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Charlie Thomas (Newport), Arthur Gould (Newport) capt., Dickie Garrett (Penarth), Percy Lloyd (Llanelli), David Gwynn (Swansea), William Stadden (Cardiff), William Williams (Cardiff), David William Evans (Cardiff), William Bowen (Swansea), John Meredith (Swansea), Alexander Bland (Cardiff), Willie Thomas (London Welsh), Jim Hannan (Newport), Stephen Thomas (Llanelli)", "Wales: Billy Bancroft (Swansea), Charlie Thomas (Newport), Arthur Gould (Newport) capt., Dickie Garrett (Penarth), George Thomas (Newport), David Gwynn (Swansea), Hugh Ingledew (Cardiff), Frank Hill (Cardiff), David William Evans (Cardiff), William Bowen (Swansea), Alexander Bland (Cardiff), Willie Thomas (London Welsh), Jim Hannan (Newport), Tom Graham (Newport), Rowley Thomas (London Welsh)"]}, {"page": "1891 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Tom Pearson (Cardiff), Charlie Arthur (Cardiff), David Gwynn (Swansea), Percy Lloyd (Llanelli), Charlie Thomas (Newport), Hugh Ingledew (Cardiff), Percy Bennett (Cardiff Harlequins), David William Evans (Cardiff), Harry Packer (Newport), William Bowen (Swansea) capt., Walter Rice Evans (Swansea), Jim Hannan (Newport), Rowley Thomas (London Welsh), Edward Pegge (Neath)", "Wales: Billy Bancroft (Swansea), William McCutcheon (Swansea), Dickie Garrett (Penarth), David Gwynn (Swansea), George Thomas (Newport), Ralph Sweet-Escott (Cardiff), Hugh Ingledew (Cardiff), Percy Bennett (Cardiff Harlequins), Sydney Nicholls (Cardiff), Tom Graham (Newport), William Bowen (Swansea), Walter Rice Evans (Swansea), David Daniel (Llanelli), Rowley Thomas (London Welsh), Willie Thomas (Llanelli) capt."]}, {"page": "1883 Home Nations Championship", "response": ["Wales: Charles Lewis (Llandovery College) capt., Harry Bowen (Llanelli), William Norton (Cardiff), James Clare (Cardiff), Charlie Newman (Newport), David Gwynn (Swansea), Edward Treharne (Pontypridd), Thomas Judson (Llanelli), Frank Purdon (Swansea) Tom Clapp (Nantyglo), Bob Gould (Newport), George Frederick Harding (Newport), Alfred Cattell (Llanelli), Thomas Baker Jones (Newport), George Morris (Swansea)"]}, {"page": "James Clare", "response": ["Clare was born in London in 1857 but moved to Penarth in Wales, where he became a pilot in the Cardiff Docks, guiding ships through the harbour. While working in the Cardiff area he began playing rugby for Cardiff Rugby Club. In 1883 Clare was selected to represent his adopted country when he played for Wales in the opening game of the 1883 Home Nations Championship against England. This was only the third international game Wales had played and was the first ever game of the inaugural Six Nations Championship. Under the captaincy of Charles Lewis, Clare played three-quarters along with David Gwynn and Cardiff team-mate William Norton. Wales lost the game by two goals and four tries to nil, and Clare was not reselected to represent Wales again."]}, {"page": "William McCutcheon", "response": ["McCutcheon joined Swansea in 1886, but in 1888 moved to Oldham.Alcock (1997) While at Oldham, McCutcheon joined Oldham Rugby Union Club but still travelled to Wales, turning out for Swansea when he could. At Oldham he played on the opposite wing to fellow Swansea player David Gwynn,Marshall, Francis Football; the Rugby union game (1892) Cassell and company Ltd. pg 367 who had also moved to the area. In 1889 McCutcheon was selected for the Lancashire county, again playing alongside Gwynn, and during the 1889/90 season he was part of the team that won the Championship County."]}, {"page": "List of international rugby union families", "response": ["*David Gwynn and William Gwynn; brothers"]}, {"page": "Gwyn (name)", "response": ["*David Gwynn (1861–1910), Welsh rugby player", "*David Gwynne (1904–1934), Welsh cricketer", "*John David Gwynn (1907–1998), Irish cricketer"]}, {"page": "List of people named David", "response": ["*David Gwynn (1861–1910), Welsh rugby union footballer", "*David Gwynne-James (1937–2012), Welsh cricketer"]}, {"page": "Gwynn, David", "response": ["#redirectDavid Gwynn"]}]}}