{"wiki_id": "http://www.wikidata.org/entity/Q5236755", "itemLabel": "David Longhurst", "itemDescription": "English footballer (1965-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Longhurst", "wikipedia_page": {"main": "David John Longhurst (15 January 1965 – 8 September 1990) was an English footballer. During his career, he played for Nottingham Forest, Halifax Town, Northampton Town, Peterborough United and York City. He died on the pitch during a match for York City against Lincoln City in 1990.", "link_mentions": [{"page": "York City F.C.", "response": ["During the early 1980s, the rear of the Grosvenor Road End was cordoned off as cracks had appeared in the rear wall, and this section of the ground was later segregated and allocated to away supporters. Extensive improvements were made over the mid 1980s, including new turnstiles, refurbished dressing rooms, new referees' changing room and physiotherapist's treatment room being readied, hospitality boxes being built to the Main Stand and crash barriers being strengthened. The David Longhurst Stand was constructed over the summer of 1991, and was named after the York player who collapsed and died from heart failure in a match a year earlier. It provided covered accommodation for supporters in what was previously the Shipton Street End, and was officially opened for a friendly match against Leeds United. In June 1995, new floodlights were installed, which were twice as powerful as the original floodlights."]}, {"page": "Bootham Crescent", "response": ["The David Longhurst Stand opened in 1991 after a roof was erected on the Shipton Street End, named after the former York player David Longhurst who died during a match at the ground in 1990. Bootham Crescent hosted Football League matches from 1932 to 2004 and from 2012 to 2016, both spells ending after York were relegated into non-League football. The ground was renamed KitKat Crescent from 2005 to 2010 as part of a sponsorship deal with Nestlé. York City left Bootham Cresent and moved to the York Community Stadium in Huntington in early 2021, and the Bootham Crescent site will be used for housing.", "Bootham Crescent comprises four stands: the Main Stand, the Popular Stand, the David Longhurst Stand and the Grosvenor Road End. The ground has held a league representative match, neutral club matches, and schoolboy and youth international matches. Other than football, it has hosted a concert, firework display, American football and rugby league matches and beer festivals. The record attendance of 28,123 was set in March 1938, for an FA Cup match against Huddersfield Town. The highest seasonal average attendance of 10,412 was achieved in 1948–49.", "thumb|alt=One of the stands of the Bootham Crescent association football ground, with supporters waving flags and a grass field below|David Longhurst Stand (2007 picture) opened in 1990, after a stand was built on the Shipton Street End.", "The ground's major drawback was the lack of covered standing accommodation at the Shipton Street End, but the cost of erecting a stand had been prohibitive. The Shipton Street Roof Appeal was launched in the spring of 1988 to raise money for a stand, and fundraising schemes were put into place. On 8 September 1990, York player David Longhurst collapsed and died from heart failure during a match against Lincoln City at Bootham Crescent. With the approval of his family, the David Longhurst Memorial Fund was launched, and all donations were added to the monies already raised for the roof appeal. The Football Trust contributed half of the £150,000 cost of the stand, and it was constructed in the summer of 1991. The David Longhurst Stand was officially opened on 14 October 1991 in a friendly match against Leeds United, which was watched by a crowd of 4,374.", "The Family Stand was opened in the Main Stand in 1992, and manager John Ward ran the London Marathon to help raise funds for the project. Bootham Crescent first hosted a play-off match when York beat Bury 1–0 on 19 May 1993 in the Third Division play-off semi-final; the attendance of 9,206 was the ground's highest in seven years. During 1993–94 the Main Stand paddock was seated and covered, and the recent work to the stand cost £220,000. The ground's capacity fell to 9,459, including seating for 3,645, after the renovations to the David Longhurst and Main Stands. In May 1995, a new drainage system was installed for £11,000, to improve the quality of the pitch during winter. New floodlights were installed in June 1995 at a cost of £122,000, and despite being shorter in height were twice as powerful as the original floodlights. A water tower was installed in the late 1990s, to further help the pitch quality.", "thumb|alt=One of the stands of the Bootham Crescent association football ground, with holding up banners|David Longhurst Stand in 2008", "The ground can accommodate 8,256 supporters, including seating for 3,409, and comprises four stands; the Main Stand, the Popular Stand, the David Longhurst Stand and the Grosvenor Road End.", "The northernmost stand of the ground is the David Longhurst Stand, which is a covered terrace for home supporters and has a row of supporting pillars across its front. The stand was originally known as the Shipton Street End, but was renamed following the death of David Longhurst, and has a capacity of 3,062. Opposite is the Grosvenor Road End, an open terrace reserved for away supporters, which holds a capacity of 1,785. As well as this, away fans are permitted to use 332 seats of the Popular Stand, in the section closest to the Grosvenor Road End. The toilet facilities for away supporters consist of open air urinals and Portakabins."]}, {"page": "1990–91 in English football", "response": ["8 September 1990 – David Longhurst, 25, York City striker, died after collapsing during a Fourth Division fixture at home to Lincoln City."]}, {"page": "1990 in association football", "response": ["* January 15 – David Longhurst, English footballer. (born 1965)"]}, {"page": "1990 in the United Kingdom", "response": ["* 8 September – York City footballer David Longhurst, 24, collapses and dies during a Football League Fourth Division match."]}, {"page": "List of association footballers who died while playing", "response": ["|  David Longhurst"]}, {"page": "Longhurst", "response": ["*David Longhurst (1965–1990), English footballer"]}, {"page": "Sudden cardiac death of athletes", "response": ["* David Longhurst, 25 (1990), soccer"]}, {"page": "History of York City F.C. (1980–present)", "response": ["In September 1990, York player David Longhurst collapsed and died after suffering heart failure during a home match against Lincoln City. A few months later, a newly built, covered stand at the Shipton Street End of Bootham Crescent was named after him. York were the Fourth Division's second lowest scorers in 1990–91, as they finished 21st in the table. Douglas Craig, who had been on the board since 1978, succeeded Michael Sinclair as chairman in June 1991. York had won 2 of 11 matches by mid October 1991; Bird was dismissed and was replaced in November by Aston Villa assistant manager John Ward. York continued to be placed in lower midtable, and finished fourth from bottom for the second year running in 1991–92. They started 1992–93 with a club-record start of four wins, and led the table until late December 1992. Ward left for Bristol Rovers in March 1993, shortly after a midseason slump in which York won only 1 of 13 matches. Ward's assistant Alan Little took over and York finished the season in fourth place. They played Bury in the play-off semi-final, drawing the first leg 0–0 at Gigg Lane before winning the second leg 1–0 at home with a goal from Gary Swann.Rollin, ed. Rothmans Football Yearbook 1993–94. pp. 586–587. In the final at Wembley Stadium, York beat Crewe Alexandra 5–3 on penalties, after the score had finished 1–1 after extra time.Rollin, ed. Rothmans Football Yearbook 1993–94. p. 587. Wayne Hall scored the decisive penalty as York won promotion to the third tier, now named the Second Division after the formation of the Premier League in 1992."]}, {"page": "List of people named David", "response": ["*David Longhurst (1965–1990), English footballer"]}, {"page": "Longhurst, David", "response": ["#redirectDavid Longhurst"]}, {"page": "History of Lincoln City F.C.", "response": ["Lincoln were relegated on the last day of the following season, and the year after that they became the first team to suffer automatic relegation from the Football League. This was a dramatic decline for a club who had almost reached the Second Division four years earlier and has been linked to the trauma arising from the disaster. This marked the fourth occasion on which Lincoln were demoted from the Football League, a record that still stands. They regained their Football League place automatically via promotion as champions of the Conference (beforehand it was done by re-election) at the first attempt with a long ball game devised by eccentric manager Colin Murphy and held on to it until the end of season 2010–11. On 8 September 1990, Lincoln were the opposition when David Longhurst suffered a fatal heart attack during the first half of a game against York City at Bootham Crescent. The game was abandoned at halftime."]}, {"page": "1987–88 Northampton Town F.C. season", "response": ["|David Longhurst||FW||||Northampton||||37||7||Halifax Town||3 July 1987||£40,000", "| FW || style=\"text-align:left;\" |  David Longhurst", "| 3 July 1987 || FW ||  || David Longhurst ||  Halifax Town || £40,000"]}, {"page": "1988–89 Northampton Town F.C. season", "response": ["| FW || style=\"text-align:left;\" |  David Longhurst"]}]}}