{"wiki_id": "http://www.wikidata.org/entity/Q5232249", "itemLabel": "David Catlin-Birch", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Catlin-Birch", "wikipedia_page": {"main": "David Catlin-Birch is a British musician. He was a bass guitarist for pop/alternative rock band World Party, and was the original \"Paul\" for the March 1980 launch of The Beatles tribute band, The Bootleg Beatles.\nWith Rowland Rivron and Richard Vranch, he made up the core team for BBC Radio 2's musical comedy show Jammin' which won a Silver Sony Comedy Award in 2004. He played bass guitar with The Flight of the Conchords on their 2005 Radio 2 series. In 2006, he joined Neil Innes and the Bonzo Dog Doo-Dah Band for their UK tour as lead guitarist, taking lead vocals for a handful of songs and recording as a member of the band on its first album in 36 years, Pour l'Amour des Chiens.\nAs a session guitarist, bass guitarist, vocalist, drummer and keyboard player, he has performed with Eurythmics, Stevie Wonder, Ringo Starr, Joe Cocker and Robbie Williams. He also briefly wrote with the late Viv Stanshall from the Bonzo Dog Doo-Dah Band. In November 2002, he performed with Jim Lea, the former bass guitarist of Slade, at his one-off \"Jim Jam\" gig at the Robin 2 club in Wolverhampton when Lea played lead guitar.", "link_mentions": [{"page": "The Rutles", "response": ["* David Catlin-Birch – bass guitar and vocals (2019)"]}, {"page": "World Party", "response": ["After the 1991 EP Thank You World, Wallinger recruited guitarist David Catlin-Birch and ex-Icicle Works drummer Chris Sharrock as fully-fledged members for 1993's album Bang!. It reached no. 2 in the UK Albums Chart, with the track, \"Is It Like Today?\" (no. 19 on the UK Singles Chart) also becoming a moderately successful single in Europe. Following the success of Bang! World Party appeared at the Glastonbury Festival in 1994, at which they had previously played in 1987 and 1990.", "*David Catlin-Birch- guitars, bass (1992–1995)"]}, {"page": "The Bootleg Beatles", "response": ["In March 2011, founder member Neil Harrison announced that he was leaving the group.Hutchinson, Charles.  (11 March 2006).  'How Adam Hastings won the battle to be John Lennon in The Bootleg Beatles'.  The Press.  (Buckinghamshire, UK). On 18 July, a press release announced his replacement as Adam Hastings, a musician from Newcastle upon Tyne. It was announced in September 2012 that longtime member David Catlin-Birch was leaving the group.", "*David Catlin-Birch (Paul McCartney) – bass, vocals, keyboards (1980–1987, 2001–2012)"]}, {"page": "He Ain't Heavy, He's My Brother", "response": ["* David Catlin-Birch (World Party) – bass"]}, {"page": "Dave Catlin-Birch", "response": ["#redirect David Catlin-Birch"]}, {"page": "Andre Barreau", "response": ["Following the final show of the West End musical Beatlemania, Barreau formed The Bootleg Beatles with fellow cast members Neil Harrison and David Catlin-Birch.  The band invested their dwindling finances in two guitars – an Epiphone and a Gretsch – as well as two Vox amplifiers, four black polo-necks and a wig.The Bootleg Beatles Souvenir Programme 2004–2005"]}, {"page": "Flight of the Conchords (radio series)", "response": ["* Music: Bret McKenzie, Jemaine Clement, Mark Allis, David Catlin-Birch, Anna-Maria La Spina"]}, {"page": "Neil Harrison", "response": ["In 1979, aged 28, Harrison had joined the cast of the West End musical Beatlemania.Cast of Beatlemania: Neil Harrison, Rhythm Guitar, Beatlemaniaalumni.com In March 1980, after the musical's last West End show, Harrison formed The Bootleg Beatles with fellow cast members Andre Barreau and David Catlin-Birch.  The band invested their dwindling finances in two guitars – an Epiphone and a Gretsch – as well as two Vox amplifiers, four black polo-necks and a wig.The Bootleg Beatles Souvenir Programme 2004–2005"]}, {"page": "Pour l'Amour des Chiens", "response": ["The album was performed by original group members Neil Innes, Roger Ruskin Spear, Rodney Slater, 'Legs' Larry Smith, Vernon Dudley Bowhay-Nowell, Martin 'Sam Spoons' Ash, and Bob Kerr, with New Millennium Bonzos Adrian Edmondson, Stephen Fry, and Phill Jupitus. Also credited are Mickey Simmonds (musical director), David Catlin-Birch (guitar and vocals), Johnny Marter (drums and percussion) and Steve Barnacle (bass and jazz guitar)."]}, {"page": "Bang! (World Party album)", "response": ["# \"Radio Days\" (Wallinger, Chambers, David Catlin-Birch) – 4:53"]}, {"page": "Bonzo Dog Doo-Dah Band", "response": ["A countrywide tour, with Ade Edmondson and Phill Jupitus, followed during November 2006, starting in Ipswich and ending with two nights at the Shepherd's Bush Empire, where Paul Merton and Bill Bailey joined in for a handful of songs. David Catlin-Birch (lead guitar and vocals) joined the band for the tour; Catlin-Birch has also been a member of World Party and The Bootleg Beatles."]}, {"page": "The Justice Collective", "response": ["Vocalists include Andy Brown (of Lawson), Gerry Marsden (of Gerry and the Pacemakers), Paul Heaton (of The Beautiful South), Glenn Tilbrook (of Squeeze), John Power (of Cast and The La's), Robbie Williams (of Take That), Melanie C (of Spice Girls), Rebecca Ferguson, Holly Johnson (from Frankie Goes to Hollywood), Paloma Faith, Beverley Knight, Eliza Doolittle, Dave McCabe (of The Zutons), Peter Hooton (of The Farm), Ren Harvieu, Jon McClure (of Reverend and The Makers), Paul McCartney (of The Beatles), Shane MacGowan (of The Pogues), Bobby Elliott and Tony Hicks (both of The Hollies), Hollie Cook (from The Slits), LIPA Gospel Choir, Clay Crosse, Alan Hansen, Peter Reid, comedian John Bishop, writer Neil Fitzmaurice and footballer Kenny Dalglish. Musicians were Chris Sharrock (of Beady Eye) on drums, David Catlin-Birch (of World Party) on bass, Paul McCartney (of The Beatles) on lead guitar, Mick Jones (of The Clash) on electric guitar, Andrew \"Davo\" Davitt on acoustic guitar,  Guy Chambers on piano, Elton John on piano, Will Pound on harmonica, Liverpool Philharmonic Orchestra on strings,  Richard Blake on trumpet/flugelhorn, Matthew Lewis on trombone/euphonium, Meredith Moore on French horn and Will Roberts on tuba. Guy Chambers was producer, Richard Flack producer and engineer and Oliver Som, Liam Nolan, Chris Taylor, Jon Withnall, Tony Draper and Alec Brits as engineer."]}, {"page": "Catlin-Birch, David", "response": ["#redirectDavid Catlin-Birch"]}]}}