{"wiki_id": "http://www.wikidata.org/entity/Q5232348", "itemLabel": "David Chisholm", "itemDescription": "Scottish rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Chisholm", "wikipedia_page": {"main": "David Chisholm (St. Boswells, 23 January 1937 – Borders, 27 July 1998) was a Scottish rugby union player. He played as a fly-half.\nHe had 14 caps for Scotland, from 1964 to 1968, scoring 1 try and 4 drop goals, 15 points on aggregate. He played in the Five Nations Championship, in 1964, 1965, 1966, 1967 and 1968, playing in 11 games and scoring 2 drop goals, 6 points on aggregate. He also played for Melrose RFC.He was commonly linked with Alex Hastie, according to Allan Massie:\n\n\"They played together for Melrose for eleven seasons, in the course of which Chisholm scored more than a thousand points for the club... As a pair their understanding made them more than the sum of two individuals. Did Hastie ever lose Chisholm in any of the thirteen internationals they played together? It was their joint ability to tidy up bad ball and even turn it to advantage that made them the most secure of partnerships. Both tackled better than many wing forwards, and they would have revelled in the modern game... Their record of going ten internationals without defeat is unparalleled.\"His brother Robin Chisholm was also capped for Scotland.", "link_mentions": [{"page": "Melrose RFC", "response": ["*  David Chisholm"]}, {"page": "Allan Massie", "response": ["* Jock Turner, David Chisholm, Alex Hastie, David Rollo, Norman Bruce, Iain Paxton"]}, {"page": "Frank Laidlaw", "response": ["He was capped thirty-two times for Scotland as a hooker between 1964 and 1971Griffiths, page 2:38-2:40 and captained his country twice.McLaren, p133 His 1966 game against Wales was what was known as \"the Melrose Game\" by Bill McLaren because his club, Melrose, had four players on the national side: the others being Alex Hastie, David Chisholm and Jim Telfer. Scotland won 11–5."]}, {"page": "Robin Chisholm", "response": ["His brother David Chisholm was also capped for Scotland."]}, {"page": "Alex Hastie", "response": ["Alexander James Hastie (29 July 1935 – 7 June 2010), also known as Alex Hastie or Eck HastieMassie, p.156 was a Scotland international rugby union player. He played at Scrum-half; and was commonly linked with David Chisholm, his pairing at Fly-half for club and country.", "Of his pairing with David Chisholm, Allan Massie said:"]}, {"page": "List of Scotland national rugby union players", "response": ["|724||ChisholmDavid Chisholm||fly-half||1964-02-22||v Ireland at Lansdowne Road"]}, {"page": "Chisholm (surname)", "response": ["* David Chisholm (1937–1998), Scottish rugby union footballer"]}, {"page": "1967 New Zealand rugby union tour of Britain, France and Canada", "response": ["Scotland: 15. Stewart Wilson 14. Sandy Hinshelwood 13. Jock Turner 12. John Frame 11. Bob Keddie 10. David Chisholm 9. Alex Hastie 1. Sandy Carmichael 2. Frank Laidlaw 3. David Rollo 4. Peter Stagg 5. George Mitchell 6. James Fisher (c) 7. Derrick Grant 8. Alasdair Boyle"]}, {"page": "List of international rugby union families", "response": ["*David Chisholm and Robin Chisholm; brothers"]}, {"page": "1962–63 Scottish Inter-District Championship", "response": ["South: J.H. Gray (Hawick), Christy Elliot (Langholm), George Stevenson (Hawick) [captain], A. R. Broatch (Hawick), W. Hollands (Gala), David Chisholm (Melrose), Alex Hastie (Melrose), Norm Suddon (Hawick), Frank Laidlaw (Melrose), G. H. Willison (Hawick), Billy Hunter (Hawick), Jim Telfer (Melrose),  Rob Valentine (Hawick), Oliver Grant (Hawick), D. M. Brown (Melrose)", "South: J.H. Gray (Hawick), Christy Elliot (Langholm), George Stevenson (Hawick) [captain], A. R. Broatch (Hawick), D. Jackson (Hawick), David Chisholm (Melrose), Alex Hastie (Melrose), Norm Suddon (Hawick), Frank Laidlaw (Melrose), G. H. Willison (Hawick),  Jim Telfer (Melrose), Billy Hunter (Hawick), Rob Valentine (Hawick), Oliver Grant (Hawick), D. M. Brown (Melrose)", "Blues Trial: K. J. F. Scotland (Leicester), R. H. Thomson (London Scottish), J. J. McPartlin (Oxford University), I. H. P. Laughland (London Scottish), W. S. Robinson (Edinburgh Wanderers), David Chisholm (Melrose), J. A. T. Rodd (London Scottish), David Rollo (Howe of Fife), A. G. D. Whyte (Gordonians),  J. B. Neill (Edinburgh Academicals), F. H. ten Bos (London Scottish), Mike Campbell-Lamerton (Halifax), R. J. C. Glasgow (Dunfermline), T. O. Grant (Hawick), R. I. Marshall (London Scottish)", "Whites Trial: J. H. Gray (Hawick), J. D. Jardine (Edinburgh Academicals), R. W. Cameron (Royal HSFP), David Chisholm (Melrose), D. Jackson (Hawick), K. J. F. Scotland (Heriots) [captain], S. Coughtrie (Edinburgh Academicals), W. A. M. Crow (Edinburgh Wanderers), Frank Laidlaw (Melrose), J. B. Neill (Edinburgh Academicals), Billy Hunter (Hawick), G. W. S. Mitchell (Edinburgh University), A. Jeffrey (Langholm), John Douglas (Stewart's College F.P), ? (Kelso)", "Scottish Border XV:  J.H. Gray (Hawick), Christy Elliot (Langholm), G. D. Stevenson (Hawick) [captain], David Chisholm (Melrose), A. T. Grieve (Langholm), A. R. Broatch (Hawick), R. G. Turnbull (Hawick), A. A. Carson (Gala), Frank Laidlaw (Melrose), Norm Suddon (Hawick), Billy Hunter (Hawick), Jim Telfer (Melrose), Rob Valentine (Hawick), D. M. Brown (Melrose), C. E. B. Stewart (Kelso)", "Scottish Border XV: J. H. Gray (Hawick), C. Elliot (Langholm), G. D. Stevenson (Hawick) [captain], David Chisholm (Melrose), W. Hollands (Gala), A. R. Broatch (Hawick), R. G. Turnbull (Hawick), Norm Suddon (Hawick), F. Laidlaw (Melrose), G. H. Willison (Hawick), Billy Hunter (Hawick), C. E. B. Stewart (Kelso), T. O. Grant (Hawick), R. Valentine (Hawick)", "Provinces District: J.H. Gray (Hawick), A. T. Grieve (Langholm), A. R. Broatch (Hawick), G. D. Stevenson (Hawick), Christy Elliot (Langholm), David Chisholm (Melrose) [captain], Alex Hastie (Melrose), G. P. Hill (Gordonians), A. G. D. Whyte (Gordonians), I. C. Spence (Gordonians), Billy Hunter (Hawick), Jim Telfer (Melrose), Rob Valentine (Hawick), T. O. Grant (Hawick), R. J. C. Glasgow (Dunfermline)"]}, {"page": "Chisholm, David", "response": ["#redirectDavid Chisholm"]}, {"page": "1968 Five Nations Championship squads", "response": ["# David Chisholm"]}, {"page": "1967 Five Nations Championship squads", "response": ["# David Chisholm"]}, {"page": "1966 Five Nations Championship squads", "response": ["# David Chisholm"]}]}}