{"wiki_id": "http://www.wikidata.org/entity/Q5234696", "itemLabel": "David Hand", "itemDescription": "British statistician", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Hand_(statistician)", "wikipedia_page": {"main": "David John Hand OBE FBA (born 30 June 1950 in Peterborough) is a British statistician. His research interests include multivariate statistics, classification methods, pattern recognition, computational statistics and the foundations of statistics. He has written technical books on statistics, data mining, finance, classification methods, and measuring wellbeing, as well as science popularisation books including The Improbability Principle: Why Coincidences, Miracles, and Rare Events Happen Every Day; Dark Data: Why What You Don’t Know Matters; and Statistics: A Very Short Introduction. In 1991 he launched the journal Statistics and Computing, which is now celebrating its third decade.\nHand was a professor of statistics at the Open University from 1988 until 1999, when he moved to Imperial College London, where he is now Emeritus Professor of Mathematics. Between 2010 and 2018 he took an extended sabbatical to serve as Chief Scientific Advisor at Winton Capital Management. He served as president of the Royal Statistical Society in 2008-2009,\nthen again in 2010 after Bernard Silverman stood down. He was elected a Fellow of the British Academy in 2003.He has received various awards for his work, including being elected Honorary Fellow of the Institute of Actuaries in 1999, the Guy Medal in Silver of the Royal Statistical Society in 2002, the IEEE ICDM Outstanding Contributions Award in 2004, the Credit Collections and Risk Award for Contributions to the Credit Industry in 2012, the George Box Medal for Business and Industrial Statistics in 2016, and the International Federation of Classification Societies Research Medal in 2019. He  was appointed Officer of the Order of the British Empire (OBE) in the 2013 New Year Honours for services to research and innovation.In April 2013 he joined the board of the board of the UK Statistics Authority as a non-executive director and served on the European Statistical Advisory Committee, advising the European Commission from 2016-2021. He chaired the Administrative Data Research Network from 2014-2017 and serves on many other advisory committees, including chairing the Advisory Board of the ONS’s Centre for Applied Data Ethics.", "link_mentions": [{"page": "Murphy's law", "response": ["Similarly, David Hand, emeritus professor of mathematics and senior research investigator at Imperial College London, points out that the law of truly large numbers should lead one to expect the kind of events predicted by Murphy's law to occur occasionally.  Selection bias will ensure that those ones are remembered and the many times Murphy's law was not true are forgotten.Hand, pp. 197-198"]}, {"page": "Sod's law", "response": ["David Hand gives the example of traffic lights turning red when a driver is in a hurry, or email software crashing at the exact moment the user attempts to send an important message. Applied to individuals, he describes it as \"Sod's law\" that the composer Beethoven lost his hearing, and that drummer Rick Allen lost an arm in a car crash. Hand sees the law as an example of selection bias and the law of truly large numbers."]}]}}