{"wiki_id": "http://www.wikidata.org/entity/Q5236536", "itemLabel": "David Levine", "itemDescription": "photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Levine_(photographer)", "wikipedia_page": {"main": "David Levine (born 1960) is a British music, portrait and fashion photographer. He is best known for his work with Culture Club, ABC, Kylie Minogue and The Cure.\nDavid Levine started his career in 1977 while working as a photographer's assistant. He went on to photograph artists live in concert including Iggy Pop live at the Music Machine London and worked as a stills photographer on music videos with the director Tim Pope. As well as working with Culture Club, Levine also worked with a number of other 1980s acts including ABC, The Cure, Kylie Minogue, Jermaine Jackson, 5 Star, and Siouxsie Sioux. Levine quickly established a style of work in the studio, much copied by other music photographs in the '80s and indeed today his influence can still be seen. That style earned him the nickname 'The man who shot the 80's'. Always filming throughout his stills career, his music videos are as typically stylish and gritty as his stills. Levine's work in both stills and film achieves a style unique to him. \nLevine was invited to lecture at the University of Arts London, London College of Fashion in 2014. He lectured in Fashion Photography while continuing with his busy photography and film career.\nLevine's 2009 portrait of Paul Nicholls is held in the National Portrait Gallery. Levine is currently lecturing on The Art of Fashion and Beauty Photography and Film at the University of Arts London, London College of Fashion.Levine has never won any awards for his work, he is on the record as saying “I don’t do this to get awards, I do it so I know I’m ok at what I do” not ever one to compromise Levine puts friendship ahead of literally anything...\nHe is the younger brother of record producer Steve Levine.", "link_mentions": [{"page": "Culture Club", "response": ["The band's second album, Colour by Numbers (UK No. 1, US No. 2), was released in 1983. The first single, \"Church of the Poison Mind\", featuring backing vocalist Helen Terry, reached the UK and US Top 10. The second single, \"Karma Chameleon\", gave the band their biggest hit, peaking at No. 1 in the UK (the band's second chart-topper there), where it became the best selling single of 1983 and has sold 1.5 million copies there to date. It also peaked at No. 1 in the US for three consecutive weeks, and would ultimately hit No. 1 in 30 countries, thus becoming one of the top twenty best-selling singles of the 1980s sold up seven million copies worldwide, with one of the most iconic images of Boy George on the cover shot by photographer David Levine."]}, {"page": "ABC (band)", "response": ["Singleton left the band shortly after the release of Beauty Stab as a result of Fry and White's reluctance to spend much time touring the band's material. Fry and White then enlisted the services of Fiona Russell Powell (under the name \"Eden\") and David Yarritu in the band's new line-up. Russell Powell had been a member of the original line-up of the pre-ABC band, Vice Versa. According to an article s published on 7 March 1997,\"Pop groups should not make comebacks, says Fiona Russell Powell\" , The Times, 7 March 1997 she 'chickened out' of Vice Versa's first live gig, and the job as frontman went to Fry. The Fry-White-Russell Powell-Yarritu line-up recorded the album How to Be a ... Zillionaire!, released in 1985. The band's chart success dwindled further in the UK with this album, but they did score their first US Top 10 hit with \"Be Near Me\", which also made the UK Top 30. The album also featured the singles \"(How to Be a) Millionaire\", \"Vanity Kills\" and \"Ocean Blue\". Inspiration for the album's cartoons of the band members was taken from a photo shoot by David Levine whose work featured on many of the sleeves for singles released from this album. Keith LeBlanc from Tackhead programmed much of the beatbox work for the album."]}, {"page": "I Should Be So Lucky", "response": ["\"I Should Be So Lucky\" is a 1987 song performed by Australian recording artist and songwriter Kylie Minogue from her debut studio album Kylie (1988). Released on 29 December 1987 by Mushroom Records and PWL Records, the song became a worldwide breakthrough hit; its image of Minogue on the front cover was shot by David Levine. The song was written and produced by Stock Aitken Waterman for Minogue, and they went on to produce Minogue's first four studio albums."]}, {"page": "Levine", "response": ["*David Levine (1926–2009), American artist and illustrator", "*David Levine (photographer) (born 1960), British photographer", "*David Levine (executive), Canadian music and television executive", "*David Levine (politician) (1883–1972), Seattle, Washington politician", "*Raphael David Levine (b. 1938), Israeli chemist", "*David Levine (racing driver) (born 1993), American racing driver"]}, {"page": "Karma Chameleon", "response": ["The sleeve features work from the photographer David Levine."]}, {"page": "David Levine (disambiguation)", "response": ["David Levine (1926–2009) was an American artist and illustrator.", "David Levine may also refer to:", "*David Levine (politician) (1883–1972), Seattle, Washington politician", "*David Levine (photographer) (born 1960), British photographer", "*David Levine (executive), Canadian music and television executive", "*David Levine (racing driver) (born 1993), American racing driver", "*Raphael David Levine (born 1938), Israeli chemist"]}, {"page": "Into the Hot (Floy Joy album)", "response": ["* David Levine – photography"]}, {"page": "David Levine Photographer", "response": ["#REDIRECT David Levine (photographer)"]}, {"page": "Massive Ego", "response": ["The title of the new album was announced in a Christmas message from the band through their social media accounts. Beautiful Suicide was released on 17 February 2017. Featured vocalists include Chris Pohl (BlutEngel), Maggie K DeMonde (Scarlet Fantastic), German gothic rapper Belzebub and Gene Serene (The Frixion). Photography for the album was done by 80's photographer David Levine."]}, {"page": "Beautiful Suicide", "response": ["Photography for the album cover and booklet was done by '80s photographer David Levine and SuicideGirls model Honey Manko, who featured in the video for \"I Idolize You\" in December 2016. The booklet contains a dedication to ex-bandmember Steady (Eddie Orange Dasher), of whom the song \"Low Life\" was written about. The album was mastered by Chris Pohl and Mario Rühlicke at Fear in Motion Productions, Berlin. The release date was announced when the album was made available through Out of Line Music's website.", "*David Levine – photography"]}]}}