{"wiki_id": "http://www.wikidata.org/entity/Q5234814", "itemLabel": "David Hawkes", "itemDescription": "British sinologist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Hawkes_(sinologist)", "wikipedia_page": {"main": "David Hawkes (6 July 1923 – 31 July 2009) was a British sinologist and translator. After being introduced to Japanese through codebreaking during the Second World War, Hawkes studied Chinese and Japanese at Oxford University between 1945 and 1947 before studying at Peking University from 1948 to 1951. He then returned to Oxford, where he completed his D.Phil. and later became Shaw Professor of Chinese.  In 1971, Hawkes resigned his position to focus entirely on his translation of the famous Chinese novel The Story of the Stone (also known as Dream of the Red Chamber), which was published in three volumes between 1973 and 1980.  He retired in 1984 to rural Wales before returning to Oxford in his final years.\nHawkes was known for his translations that preserved the \"realism and poetry\" of the original Chinese, and was the foremost non-Chinese Redology expert.\n\n", "link_mentions": [{"page": "William Empson", "response": ["Just after the war Empson returned to China. He taught at Peking University, befriending a young David Hawkes, who later became a noted sinologist and chair of Chinese at Oxford University.  Then, in the late 1940s and early 1950s, he taught a summer course for the intensive study of literature at the Kenyon School of English at Kenyon College in Ohio. According to Newsweek, \"The roster of instructors was enough to pop the eyes of any major in English.\" In addition to Empson the faculty included Robert Penn Warren, John Crowe Ransom, Robert Lowell, Delmore Schwartz, Jacques Barzun, Eric Bentley, Cleanth Brooks, Alfred Kazin, Arthur Mizener, Allen Tate and Yvor Winters."]}, {"page": "List of sinologists", "response": ["* David Hawkes (1923–2009)"]}, {"page": "Chu Ci", "response": ["The scholar and translator David Hawkes divides the verses of what seem to be of the earlier (pre-Han era), into two types, each type being characterized by one of two characteristic metrical forms (with the exception of the mixed poetry and prose narratives of the \"Divination\" and of \"The Fisherman\").Hawkes, 38-39", "The Chu Ci never became a canonical work, not in the sense as did the Shi Jing. As David Hawkes puts it, \"[t]he Chu Ci poems, however popular, belonged to no canon, dealt in matters that were outlandish and unorthodox, and originated outside of the area of sanctified Western Zhou tradition.\"Hawkes (1985 [2011]), 26 However, part of the Chu Ci tradition includes a Confucian outlook, glorifying the loyal minister who prefers death over compromising his integrity. Following its Han Dynasty publication, the Chu Ci was subject to various editorial treatment, including various commentaries and editions. The order in which the sections of the Chu Ci are currently generally arranged was established through editorial re-arrangement during or following the tenth or eleventh century.Hawkes (1985 [2011]), 31 However, this is not true of The Lament. In the Wang Yi edition, it is titled \"Lisaojing\". The other works (juan) of the Chu Ci anthology generally fall in the category of zhuan, or exegesis or amplification upon the original \"classic\" text.Hawkes  (1985 [2011]), 31-32", "In addition to the translations by David Hawkes cited above, translations into English include:"]}, {"page": "Jiu Ge", "response": ["David Hawkes finds evidence for this eclectic suite of eleven poems having been written by, \"a poet (or poets) at the Chu court in Shou-chun (241-223) B.C.\"Hawkes, 98", "The \"Jiu Ge\" songs include eleven (despite the \"Nine\" in the title). Nine of the verses are addressed to deities by a type of shaman, one to the spirits of fallen warriors who died fighting far from home, and the concluding verse.Hawkes, 95 The reason for the discrepancy between the 9 verses referred to in the title and the fact that there are actually 11 is uncertain, although an important question, which has had several possible explanations put forth. Of these explanations, some may be rooted in general Chinese number magic or symbology. More specifically, David Hawkes points out that \"nine songs\" is referenced in the seminal Chu Ci work, Li Sao, referring to the nine (twice times nine?) dances of Qi of Xia.Hawkes, 97", "Critics and scholars have elaborated various hypotheses as to why the Jiu Ge (\"Nine Songs\") consists of eleven songs, rather than nine. An obvious, and common, suggestion has been that Number 1 and Number 11 songs are somehow to be classified as an introduction and a luan: examination of Song 1 and Song 11 fails to support this convenient conjecture, however.Hawkes, 99 Sinologists Masaru Aoki and David Hawkes propose that for performance purposes there were nine songs/dances performed at each a spring and at an autumn performance, with the spring performance featuring Songs 3 and 5, but not 4 or 6, and the autumnal performance 4 and 6, but not 3 or 5 (with the songs otherwise being performed in numerical order).Hawkes, 99-100 Another explanation has to do with ancient ideas about numbers and numbering, where by the use of a numeric term, an order of magnitude, estimation, or other symbolic qualities are meant, rather than a specific quantity.Hawkes, 101 11 songs could be \"about 9\" songs.", "The following table shows the eleven individual poems of the Nine Songs. The English translations are following those of David Hawkes,Hawkes, 101-118 although he uses Roman numerals for the traditional song order.", "The titles of the individual poems which follow are loosely based on David Hawkes:", "The tenth Jiu ge poem (Guo shang) is a hymn to soldiers killed in war (\"Guo shang\"). Guó (國) means the \"state\", \"kingdom\", or \"nation\". Shāng (殤) means to \"die young\". Put together, the title refers to those who meet death in the course of fighting for their country. David Hawkes describes it as \"surely one of the most beautiful laments for fallen soldiers in any language\".Hawkes, 116-117 The meter is a regular seven-character verse, with three characters separated by the exclamatory particle \"兮\" followed by three more characters, each composing a half line, for a total of nine lines of 126 characters."]}, {"page": "Wen Yiduo", "response": ["Wen was credited by David Hawkes as the initiator of the cult of Qu Yuan as \"China's first patriotic poet\", writing that, \"although Qu Yuan did not write about the life of the people or voice their sufferings, he may truthfully be said to have acted as the leader of a people's revolution and to have struck a blow to avenge them. Qu Yuan is the only person in the whole of Chinese history who is fully entitled to be called 'the people's poet'.\""]}, {"page": "Luo Changpei", "response": ["Born into a Manchu family, he graduated from the Peking University. Besides spending some years in the United States as  a visiting scholar, he spent most of his academic life at Peking University. Among his students there were the British scholars Michael Halliday and David Hawkes. In 1929, along with Y.R. Chao and Li Fang-kuei, he became a researcher at the Institute of History and Philology (歷史語言研究所) of Academia Sinica (then located at Nanjing). He also served as director of the Institute of Linguistics at the Chinese Academy of Sciences until his death in 1958."]}, {"page": "Xiangling (character)", "response": ["Xiangling (, rendered Caltrop in David Hawkes's translation) is a character in the 18th century novel Dream of the Red Chamber. She is the primary maid of the Xue household. Originally named Zhen Yinglian (), she is the lost daughter of Zhen Shiyin (甄士隱), the country gentleman in Chapter 1. Kidnapped as a young girl on the streets and sold to the Xue family under the name Xiangling (Lotus). Also an unofficial \"concubine\" to Xue Pan, she is greatly abused by him and later his wife, the cruel Xia Jingui. Xiangling is a kind girl who is much loved by Aunt Xue and Xue Baochai."]}, {"page": "Homer H. Dubs", "response": ["As a person, Dubs was characterized by his generosity and his eccentricity. He was once described as a \"Spinozan saint who had missed some of the bigger academic plums because he wouldn't press his pants\" and offended some of the Oxford dons by parking his motorcycle in the hallway. Like some others at Oxford, he also dabbled a bit in the occult. But he was an erudite and respected scholar, and his former student David Hawkes remembered \"was always able to relate what he studied as an academic with what he had lived through as a younger man and to remind us by anecdote or example that the ancient texts he taught formed part of a continuum with the living present.\"David Hawkes. \"Tribute to Prof. Homer H. Dubs.\""]}, {"page": "Hua Xiren", "response": ["Hua Xiren (, rendered Aroma in David Hawkes' translation and Pervading Fragrance in Chi-chen Wang's translation), originally called Zhenzhu, is a major fictional character from the classic 18th century Chinese novel Dream of the Red Chamber. She is the chief maid of Jia Baoyu, the novel's protagonist. Her surname Hua means \"Flower\" and her given name literally means \"assail people\". Her given name is chosen by Baoyu and is borrowed from a line of poetry."]}, {"page": "David Hawkes (scholar)", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "A Leaf in the Storm", "response": ["In 1980, the literary critic and translator David Hawkes said of Leaf in the Storm that it is \"by no means a bad novel,\" but it \"seems to me inferior to Fortress Besieged [by Qian Zhongshu]—not only because it has not the same hard intelligence, but also because in Leaf in the Storm Lin Yutang's much vaunted-humour seems for once to have deserted him.\" Parts of the novel, Hawkes continued, \"reread today like wartime propaganda,\" a shortcoming Hawkes attributed to the fact that it \"owes much of its background to the newspapers, which are strong on major horrors but have little to say about the boredom and innumerable petty privations which make up the everyday reality of war.\""]}, {"page": "Nine Changes", "response": ["According to David Hawkes, \"Sao-style poem\" is an evolution from the \"Song-style poem,\" and this new style is designed for the recitation of long narrative poems. Hawkes uses the carrier-sound \"hsi,\" the unstressed particle \"tee,\" and the mark of a content character \"tum\" to demonstrate the sentence structures of \"Sao-style poem\" and \"Song-style poem.\" The prosodic unit of a Sao-style poem is a double-line sentence separated midway by the carrier-sound \"hsi.\" The differences between the two styles become apparent when Hawkes compares two sentences of a Song-style poem with one double-line sentence of a \"Sao-style\" poem."]}, {"page": "David Hawkes", "response": ["David Hawkes may refer to:", "*David Hawkes (VC) (1822–1858), English recipient of the Victoria Cross", "*David Hawkes (sinologist) (1923–2009), British sinologist", "*David Hawkes (professor of English) (born 1964), professor of English at Arizona State University"]}, {"page": "Huò Kèsī", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "Huo Kesi", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "Huo K'o-ssu", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "Huo K'ossu", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "Huo Kossu", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "Huo Ko-ssu", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "David Hawkes (Sinologist)", "response": ["#REDIRECT David Hawkes (sinologist)"]}, {"page": "List of Chinese-English translators", "response": ["* David Hawkes (sinologist) — translator of the Chinese classic Story of the Stone or Dream of the Red Chamber, by Cao Xueqin"]}, {"page": "Oswald Tuck", "response": ["In all more than 220 students were trained at the Bedford Japanese School, including nine women. After the war some returned to their former pursuits, such as Hugh Lloyd-Jones, who became Regius Professor of Greek at Oxford and was knighted, and Maurice Wiles, who became Regius Professor of Divinity at Oxford. Others abandoned their former interests and became sinologists or japanologists, such as David Hawkes, later Professor of Chinese at Oxford, Geoffrey Bownas, later Professor of Japanese at Sheffield University, and Albert Richard Davis, who became Professor of Chinese at Sydney University. Some became famous for other reasons, such as Denise Newman, who served as the only female skipper in the Royal Navy Auxiliary Service for eight years, and sailed single-handed across the Atlantic in 1988 at the age of 64, and Wilfrid Noyce, who was a member of the 1953 British Everest Expedition and later died in a mountaineering accident in the Pamirs.For biographies of all the students see Kornicki 2019."]}, {"page": "Lingguan", "response": ["Lingguan (, rendered Charmante in David Hawkes' translation) is the stage name of a fictional Chinese opera actress from the Chinese novel Dream of the Red Chamber. She is one of the most strong-willed characters in the novel. Critics consider both Lingguan and Qingwen as doubles of Lin Daiyu."]}]}}