{"wiki_id": "http://www.wikidata.org/entity/Q5232537", "itemLabel": "David Cook", "itemDescription": "British literary critic", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Cook_(literary_critic)", "wikipedia_page": {"main": "David Cook (1929 – 30 March 2003) was a British academic, literary critic and anthologist. As a Professor of Literature at the Universities of Makerere and Ilorin, he played an important role in encouraging literature in East Africa.", "link_mentions": [{"page": "Heinemann African Writers Series", "response": ["| 15|| Cook, David|| 1965 || Origin East Africa: a Makerere anthology devised and edited by David Cook. Prose and verse. "]}, {"page": "Elvania Namukwaya Zirimu", "response": ["Elvania Namukwaya Zirimu (31 August 1938 – 31 October 1979)\"Elvania Namukwaya Zirimu\", SPLA. was a Ugandan poet and dramatist. She formed the Ngoma Players, with the policy of writing and producing Ugandan plays, and was actively concerned with the National Theatre.Martin Banham, Errol Hill & George Woodyard (eds), The Cambridge Guide to African and Caribbean Theatre, 1994, p. 126. She belonged to the early generation of English-language Ugandan writers and playwrights that includes novelist Okello Oculi, playwright John Ruganda, and novelist Austin Bukenya. Her best-known work is the one-act play Keeping up with the Mukasas, included in David Cook's 1965 anthology of East African plays, Origin East Africa."]}, {"page": "David Cook", "response": ["David Cook may refer to:", "* David Cook (writer) (1940–2015), British novelist, screenwriter, and TV presenter", "* David Cook (game designer) (active since 1980s), American game designer for TSR", "* David Cook (singer) (born 1982), winner of the seventh season of American Idol", "* David Cook (Northern Ireland politician) (1944–2020), politician of the Alliance Party of Northern Ireland", "* David Cook (Arizona politician) (active since 2016), member of the Arizona House of Representatives", "* David Cook (Texas politician) (born 1971), member of the Texas House of Representatives and former mayor of Mansfield, Texas", "* David Cook (cricketer) (born 1936), former English cricketer", "* David Cook (cyclist) (born 1969), British Olympic cyclist", "* David Cook (racing driver) (born 1975), British former racing driver", "* David Cook (literary critic) (1929–2003), British professor of East African literature", "* David Cook (Blockbuster founder) (active since 1978), American businessman", "* David Cook (historian) (active since 2003), American professor, historian of Islam at Rice University", "* E. David Cook (21st century), American religion professor at Wheaton College", "* David Cook (artist) Found object artist in Minneapolis and Chicago", "* David Cook (album), a 2008 album by David Cook", "*David Cooke (disambiguation)"]}, {"page": "Miles Lee", "response": ["Before World War II Lee was Stage Director at the Birmingham Repertory Company. After serving in the RAF during the war, he became an Advisor to the Scottish Community Drama Association. In 1951 he founded the Belgrave Mews Puppet Theatre in Edinburgh. He was a freelance producer for the BBC and commercial television, before moving to Uganda to work for Radio Uganda. In autumn 1964 Lee persuaded David Cook, a literature lecturer at Makarere University, to chair a monthly radio programme about East African writing. Lee and Cook collaborated on an anthology of East African plays in 1968, and some of the broadcasts they made together were later collected and published.David Cook, ed., In black and white: writings from East Africa with broadcast discussions and commentary, 1976.", "* (ed. with David Cook) Short East African Plays in English: ten plays in English. London & Nairobi: Heinemann Educational, 1968. African Writers Series, No. 28."]}, {"page": "Deaths in March 2003", "response": ["*David Cook, 73/4, British literary critic."]}, {"page": "List of Makerere University academics", "response": ["* David Cook (literary critic)"]}, {"page": "Sam Tulya-Muhika", "response": ["* 'Born to Die'. In David Cook & Miles Lee, eds., Short East African Plays, Heinemann, 1968."]}]}}