{"wiki_id": "http://www.wikidata.org/entity/Q5239967", "itemLabel": "David Southwood", "itemDescription": "British space scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Southwood", "wikipedia_page": {"main": "David John Southwood  (born 30 June 1945) is a British space scientist who holds the post of Senior Research Investigator at Imperial College London. He was the President of the Royal Astronomical Society from 2012–2014, and earlier served as the Director of Science and Robotic Exploration at the European Space Agency (2001–2011). Southwood's research interests have been in solar–terrestrial physics and planetary science, particularly magnetospheres. He built the magnetic field instrument for the Cassini Saturn orbiter.", "link_mentions": [{"page": "Beagle 2", "response": ["David Southwood, ESA's Director of Science, provided four scenarios of possible failures:"]}, {"page": "Colin Pillinger", "response": ["When the lander was first considered 'lost' a number of possible explanations were given by David Southwood, ESA's director of Science. The commission inquiring into the mission's apparent failure also apportioned blame towards Pillinger's management of the overall project as a contributing factor. In response, in his autobiography, Professor Pillinger highlighted a lack of support from key figures at ESA as a factor."]}, {"page": "University of Bern", "response": ["Johann Büttikofer, Hans von Euler-Chelpin, Gerold Schwarzenbach, Richard R. Ernst, David Southwood"]}, {"page": "63rd World Science Fiction Convention", "response": ["* Professor David Southwood"]}, {"page": "Science Fiction Foundation", "response": ["The Science Fiction Foundation is a Registered Charity established 1970 in England by George Hay and others. Its purpose is to \"promote science fiction and bring together those who read, write, study, teach, research or archive science fiction in Britain and the rest of the world.\" Science fiction writers Arthur C. Clarke and Ursula K. Le Guin were founding patrons; current patrons are Neil Gaiman and Professor David Southwood."]}, {"page": "Sir Arthur Clarke Award", "response": ["| Exceptional Space Achievement || Professor David Southwood"]}, {"page": "Astronomy Now", "response": ["The accompanying conference programme presents top speakers from the UK and overseas. Past speakers have included Maggie Aderin-Pocock, Alan Bond,  Ted Bowell, Jocelyn Bell Burnell, Carol Christian, Alberto Conti, Brian Cox, Carlos Frenk, Douglas Gough, Monica Grady, David A. Hardy, Lucy Hawking, David Hughes, Robin Ince, Mat Irvine, Helen Keen, Rob Kennicutt, Jim Al-Khalili, Ed Krupp, David H. Levy, Chris Lintott, Keith Mason, Brian May, Fulvio Melia, Simon Mitton, Stephen O’Meara, Martin Rees, Ian Ridpath, Chris Riley, Seth Shostak, Simon Singh, Stephen Smartt, David Southwood, Jill Tarter, David Whitehouse, and John Zarnecki.  Allan Chapman is a regular speaker."]}, {"page": "Valery Troitskaya", "response": ["In 1996, a special session was held at the spring meeting of the American Geophysical Union to honor her in anticipation of her 80th birthday. Organized by Margaret Kivelson and David Southwood, the symposium entitled “ULF Waves: A Tribute to Valeria Troitskaya”  brought together colleagues from many countries who paid tribute to their beloved and much appreciated Mme. Troitskaya and described how her work on magnetic pulsations had provided the basis for major advances in understanding the magnetosphere and its dynamics."]}, {"page": "Torquay Boys' Grammar School", "response": ["* Professor David Southwood, Science Director of the European Space Agency, President of the Royal Astronomical Society, Head of Physics Department Imperial College."]}, {"page": "David J. Southwood", "response": ["#REDIRECT David Southwood"]}, {"page": "President of the Royal Astronomical Society", "response": ["| 88 || 100px ||  David Southwood  || 2012 || 2014 || Space scientist, magnetospheres ||  "]}, {"page": "List of alumni of Queen Mary University of London", "response": ["* David Southwood – British space scientist, Senior Research Investigator at Imperial College London"]}, {"page": "List of RAeS medal recipients", "response": ["* 2005 - Professor David SouthwoodMedallist list published here."]}, {"page": "Picocon", "response": ["|Sarah Pinborough, Charles Stross, David Southwood"]}, {"page": "Southwood, David", "response": ["#redirectDavid Southwood"]}]}}