{"wiki_id": "http://www.wikidata.org/entity/Q5230528", "itemLabel": "David A. T. Stafford", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/David_A._T._Stafford", "wikipedia_page": {"main": "David Alexander Tetlow Stafford (born 10 March 1942) is projects director at Edinburgh University's Centre for the Study of the Two World Wars and Leverhulme Emeritus Professor in the University's School of History, Classics and Archaeology.\nStafford took his B.A. at Downing College, Cambridge in 1963.  He then undertook postgraduate study at the University of London, taking an M.A. and finally his Ph.D. in history in 1968.\nBeginning his career with government service, Stafford served in the British Diplomatic Service as a third secretary at the Foreign Office from 1967 to 1968, and then as second secretary in 1968.  He then took up an appointment as research associate (1968–70) at the Centre of International Studies at the London School of Economics and Political Science.  He then became assistant professor of history (1970–76) at Canada's University of Victoria in British Columbia.  He was promoted to associate professor of history (1976–82) and finally professor of history (1982–84).  He then became director of studies (1985–86) and executive director (1986–92) at the Canadian Institute of International Affairs in Toronto, Ontario, Canada.  From 1992 to 2000 Stafford became a visiting professor at Edinburgh University's Institute for Advanced Studies in the Humanities, and then, from 2000, he became projects director at the Centre for the Study of the Two World Wars.Stafford is particularly noted for his scholarly works concerning Winston Churchill and British intelligence, various aspects of the Second World War, and Twentieth Century intelligence and espionage with a focus on Britain. He now resides in Victoria, British Columbia, Canada.", "link_mentions": [{"page": "William Stephenson", "response": ["Intelligence historian David A. T. Stafford asserts that a more reliable source on Stephenson's career is H. Montgomery Hyde's The Quiet Canadian, published in 1962, before Stevenson's book. "]}, {"page": "Peter Lunn", "response": ["In 1954 Lunn was SIS head of station in Berlin, and cooperated with his CIA opposite number William King Harvey to bring about work on the Berlin Tunnel (known as Operation Gold by the Americans and Operation Stopwatch by the British). The operation was codenamed PBJOINTLY, with the P and B standing for Peter and Bill respectively. Most of the manpower and funds were provided by the Americans, while the technical skills and experience from the Vienna tunnel came from Lunn's officers. Unknown to either the SIS or the CIA, the tunnel was revealed to the Soviets from the beginning by George Blake, who worked for SIS on the project. In the event, the KGB was quite happy to let the West snoop on the Red Army, and did not use the tapped lines for disinformation, as that could have led to Blake's exposure. A full account of the operation from a British perspective is given by espionage writer David A. T. Stafford in his book Spies Beneath Berlin (2002)."]}, {"page": "David A.T. Stafford", "response": ["#Redirect David A. T. Stafford"]}, {"page": "Yugoslav coup d'état", "response": ["According to former British diplomat and Emeritus Professor of History, Classics and Archaeology of the University of Edinburgh David A. T. Stafford, writing in 1977, although supported with British intelligence and encouragement, the \"[i]nitiative came from the Yugoslavs, and only by a stretch of the imagination can the British be said to have planned or directed the coup d'etat.\" Radoje Knežević vehemently denied any British involvement at all in a series of published letters between himself and Stafford, until in 1979, Stafford apologised for his error and for any offence caused to Radoje Knežević. In 1999, Ivo Tasovac criticised Stafford's revised conclusion, pointing to evidence that the plotters were dependent on British intelligence, and that senior British officials met with both Simović and Mirković immediately before the coup was carried out. The British air attaché Group Captain A.H.H.McDonald met with Simović on 26 March, and the assistant air attaché and British intelligence agent T.G.Mappleback met with his close friend Mirković on the same day and told him that the coup had to be carried out within the next 48 hours. According to the historian Marta Iaremko, writing in 2014, \"the vast majority of researchers\" consider that the putsch was planned with the assistance of the British intelligence services, but that this, and their encouragement of the revolt, were not sufficient to ensure it was carried out."]}, {"page": "David Stafford", "response": ["* David A. T. Stafford (born 1942), British  historian"]}]}}