{"wiki_id": "http://www.wikidata.org/entity/Q5232540", "itemLabel": "David Cook", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Cook_(racing_driver)", "wikipedia_page": {"main": "David Cook (born 3 April 1975) is a British former racing driver, most notable for winning the British Formula Renault Championship in 1996, and for entering the International Formula 3000 series briefly in 1997 and 1998, driving for the family-run DC Cook Motorsports team.", "link_mentions": [{"page": "1998 International Formula 3000 Championship", "response": ["|  David Cook", "|align=\"left\"|  David Cook", "| - ||align=\"left\"|  David Cook ||align=\"left\"| Redman & Bright F3000 ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| 32 ||style=\"background:#DFDDDF;\"| R ||style=\"background:#DFBBBF;\"| 34 ||style=\"background:#DFDDDF;\"| NQ ||style=\"background:#DFBBBF;\"| 33 ||style=\"background:#DFDDDF;\"| NS ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| - ||style=\"background:#DFBBBF;\"| - ||style=\"background:#DFDDDF;\"| -"]}, {"page": "Autosport BRDC Award", "response": ["| David CookPeter DumbreckDarren MalkinTim MullenDan Wheldon"]}, {"page": "British Formula Renault Championship", "response": ["|  David Cook"]}, {"page": "List of Formula Renault 2.0 champions", "response": ["| style=\"background:#FFFFFF;\"|  David Cook"]}, {"page": "David Cook", "response": ["David Cook may refer to:", "* David Cook (writer) (1940–2015), British novelist, screenwriter, and TV presenter", "* David Cook (game designer) (active since 1980s), American game designer for TSR", "* David Cook (singer) (born 1982), winner of the seventh season of American Idol", "* David Cook (Northern Ireland politician) (1944–2020), politician of the Alliance Party of Northern Ireland", "* David Cook (Arizona politician) (active since 2016), member of the Arizona House of Representatives", "* David Cook (Texas politician) (born 1971), member of the Texas House of Representatives and former mayor of Mansfield, Texas", "* David Cook (cricketer) (born 1936), former English cricketer", "* David Cook (cyclist) (born 1969), British Olympic cyclist", "* David Cook (racing driver) (born 1975), British former racing driver", "* David Cook (literary critic) (1929–2003), British professor of East African literature", "* David Cook (Blockbuster founder) (active since 1978), American businessman", "* David Cook (historian) (active since 2003), American professor, historian of Islam at Rice University", "* E. David Cook (21st century), American religion professor at Wheaton College", "* David Cook (artist) Found object artist in Minneapolis and Chicago", "* David Cook (album), a 2008 album by David Cook", "*David Cooke (disambiguation)"]}, {"page": "Tatuus", "response": ["In 1993 Gianfranco De Bellis became co-proprietor. Tatuus then-on focused on producing Formula Renault cars. The Tatuus RC95 was the first Formula Renault car made by Tatuus. The Tatuus factory team fielded three drivers, Italian Rino Mastronardi, Norwegian Tommy Rustad and Brazilian Enrique Bernoldi. The team competed in the Eurocup Formula Renault, Tommy Rustad won three races during the inaugural season for the team. The first title for the Tatuus factory team and chassis came in 1996. Enrique Bernoldi won six out of ten races and took the title. Teammate Danilo Cascio was places seventh. David Cook entered a Tatuus customer car in the British Formula Renault championship. In this very competitive championship Cook beat Darren Turner to the 1996 title. Other customer Tatuus chassis were entered in the French Formula Renault, Antoine Brousseau achieved a second place in the championship. A Tatuus chassis also took the title in the German Formula Renault with driver Alexander Müller. 1997 was a highly successful for the team and the chassis. The team scored a one-two finish in the European championship. Jeffrey van Hooydonk and Max Busnelli were a class on their own securing the first and second place in the championship. The top ten were seven Tatuus and three Martini cars. Three Tatuus customer entries filled the podium in the German championship. Robert Lechner won the title in front of Thomas Mutsch and Michael Schröter. Marc Hynes, driving a customer Tatuus, won the British title. The French championship, however, was a different story. France, home of Mygale, Martini and Renault, had the most competitive Formula Renault championship. Benoît Tréluyer driving a Tatuus was placed sixth in the championship standings, scoring one win and four podium finishes out of 17 races. Tatuus again was the chassis to beat in the European, British and German championships. Lucas Lasserre managed to achieve a third place in the French championship, behind two factory entered Mygales. Tatuus again dominated the British championship in 1999 with Tatuus chassis winning 12 out of 13 races, Antônio Pizzonia took the title. Tatuus customer entries also won the European and German championships. Lucas Lasserre now took the title in the prestigious French championship. In heavy competition between Mygale, Martini and Tatuus, Tatuus prevailed winning 14 out of 21 races."]}, {"page": "1999 British Formula Three Championship", "response": ["* David Cook: DC Cook Motorsport → Retirement"]}, {"page": "1995 British Formula Three Championship", "response": ["|  David Cook", "|align=\"left\"|  David Cook"]}, {"page": "1998 British Formula Three Championship", "response": ["|  David Cook", "|align=left|  David Cook"]}, {"page": "David Cook (driver)", "response": ["#REDIRECT David Cook (racing driver)"]}, {"page": "Jake Cook", "response": ["Jake Cook is the nephew of former British Touring Car Championship driver Paula Cook, and is also related to former British Formula Renault champion David Cook and former Shellsport International Series driver Derek Cook. He has stated his ambition is to become a Formula 1 driver, with his hero being Ayrton Senna, and that he is a Sheffield Wednesday fan. He studies Economics at Newcastle University."]}, {"page": "1996 British Formula Two Championship", "response": ["Rees started the season in style, winning the first 5 races, but stumbled at Donington when Sascha Maassen took his only victory of the year. Werner Lupberger won the following round as Rees retired, but Gareth won the Silverstone round to tie up the championship. Luiz Garcia Jr. won the remaining two rounds after battling with Lupberger and Gonzalo Rodriguez, securing second in the standings. Lupberger ended up third, one place ahead of Rodriguez. British Formula Renault champion David Cook raced twice in Rees' absence, while future International F3000 star Jason Watt made his F3000 debut for Fred Goddard Racing in the final round. Ex-Andrea Moda F1 non-qualifier Perry McCarthy made a single seater return with DKS Racing. The future boss of International F3000 team Arden, Christian Horner, finished fifth overall after half a season with veteran team Madgwick International. Sarah Kavanagh, future Formula Nippon and BOSS Formula 1 driver, raced on a couple of occasions in a Sainsbury's and Parmalat backed Fred Goddard Racing entry.", "|  David Cook", "|align=left|  David Cook"]}, {"page": "Redman Bright", "response": ["Following his retirement from motorsport, Brian Redman was convinced by John Bright, who had been Redman's race engineer in various programs in the 1980s in the United States, to become involved in a new Formula 3000 team. Redman was convinced to join the effort as a team boss on the stipulation that it cost him no money, although he would later fund the purchase of the team's first car.  Bright was already experienced with Formula 3000, having been an engineer for Eddie Jordan Racing.  Uruguayan Gonzalo Rodríguez sign with the team for the 1997 International Formula 3000 Championship, earning the best result of sixth at the Nürburgring.  The team also participated in the British Formula 3000 Championship but it was canceled after only a single event.  Redman Bright expanded for 1998 with a second car with the aid of pay drivers, replacing the departing Rodríguez with Mark Shaw for the full season and Jonny Kane and David Cook sharing the second entry for select events.  None of their drivers were able to score points, with Kane registering the best finish of twelfth.  The team also added British Formula Renault to their program, campaigning Venezuelan Juan José Font to fifth in the championship.", "|  David Cook"]}]}}