{"wiki_id": "http://www.wikidata.org/entity/Q5235129", "itemLabel": "David Hopkins", "itemDescription": "cricketer (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Hopkins_(cricketer)", "wikipedia_page": {"main": "David Charles Hopkins (born 11 February 1957) is a former English cricketer. Hopkins was a right-handed batsman who bowled right-arm medium pace. He was born in Birmingham, Warwickshire.\nHopkins made his first-class debut for Warwickshire against Somerset in the 1977 County Championship. He made 35 further first-class appearances, the last of which came against Yorkshire in the 1981 County Championship. In his 36 first-class matches, he scored 332 runs at an average of 10.37, with a high score of 34 not out. With the ball, he took 53 wickets at a bowling average of 38.13, with best figures of 6/67. These figures, his only five wicket haul in first-class cricket, came against Somerset in the 1979 County Championship, a season in which he took 27 wickets at an average of 32.81, which was his most successful season in first-class cricket. He made his List A debut for Warwickshire against Leicestershire in the 1978 John Player League. He made 23 further List A appearances, the last of which came against Devon in the 1980 Gillette Cup. In his 24 List A appearances, he scored 60 runs at an average of 7.50, with a high score of 35 not out. With the ball, he took 22 wickets at an average of 32.36, with best figures of 3/26.Leaving Warwickshire at the end of the 1981 season he joined Buckinghamshire, making 2 appearances for the county in the 1982 Minor Counties Championship, both against Oxfordshire.", "link_mentions": [{"page": "David Hopkins", "response": ["David Hopkins may refer to:", "* David Hopkins (comic artist), webcomic artist ", "* David Hopkins (writer) (born 1977), American comic book writer and essayist", "* David Hopkins (musician) (born 1971), American singer-songwriter", "* David Hopkins (cricketer) (born 1957), former English cricketer"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* David Hopkins (1977–1981) : D. C. Hopkins (36)"]}]}}