{"wiki_id": "http://www.wikidata.org/entity/Q5236411", "itemLabel": "David Leatherdale", "itemDescription": "English cricketer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Leatherdale", "wikipedia_page": {"main": "David Antony Leatherdale (born 26 November 1967 in Bradford, Yorkshire) is a former English cricketer. He played county cricket for Worcestershire.\nLeatherdale is a fine example of the county pro who, while not good enough to play international cricket, is nevertheless of great benefit to his club. In a career stretching over 17 years with Worcestershire, he has scored more than 10,000 first-class runs at a batting average of slightly under 33, and his straightforward medium-pacers have brought him more than 130 wickets, with over another 170 in the one-day game.\nAlthough he made his first-class debut in 1988, Leatherdale did not receive his county cap for another six years. He has reached 1000 first-class runs in a season just once, in 1998 when he made 1001.\nHe was awarded a benefit by Worcestershire in 2003, and retired from first-class cricket at the end of that season, although he continued to play one-day cricket and was unexpectedly called up for the County Championship game against Derbyshire in April 2005. He finally called time on his long playing career in December of that year to concentrate on a full-time job as commercial director of the county.", "link_mentions": [{"page": "Worcestershire County Cricket Club", "response": [":1994: David Leatherdale", "*7th: 256 by David Leatherdale and Steve Rhodes v. Nottinghamshire, Nottingham, 2002"]}, {"page": "Glamorgan County Cricket Club in 2005", "response": ["Worcestershire Royals failed to defend a total of 273 for 3 – their highest of the season thus far – against Glamorgan Dragons at New Road. Winning the toss and batting first, Worcestershire captain Vikram Solanki paired up for 91 with Stephen Moore, who would go on to make 104. Zander de Bruyn also made an unbeaten fifty to lift Worcestershire to 273 for 3. The Indian international Sourav Ganguly was the only Glamorgan bowler to escape with less than five runs an over to his name, as he got one wicket for 19 in his five overs. Worcestershire dismissed Robert Croft in the second over, but Glamorgan sent out another pinch-hitter in Alex Wharf who made 38 before he was bowled by David Leatherdale, who took two for 35. Another wicket fell shortly afterwards, and Glamorgan were 67 for 3, but Sourav Ganguly made 53, Mike Powell contributed 82, and David Hemp sealed the win with his unbeaten 51 off 36 ball. The Glamorgan batsman took a particular liking to England Test spinner Gareth Batty who finished wicketless for 69 runs."]}, {"page": "Lancashire County Cricket Club in 2005", "response": ["Lancashire Lightning ensured continued survival in Division One of the National League with a victory over Worcestershire Royals in a rain-shortened match that was cut down from 45 to 33 overs. David Leatherdale and Gareth Batty took early wickets, as Lancashire lost their first four wickets for 65 runs, but Glen Chapple and Stuart Law added 84 for the fifth wicket, and Kyle Hogg also provided quick runs as Lancashire ended on 186 for 8. The six Lancashire bowlers then shared out wickets, as James Anderson ended with three for 12 including England batsman Vikram Solanki, while spinners Murali Kartik and Andrew Symonds took two each as Worcestershire were bowled out for 111. No Worcestershire batsman passed 25, and thus Worcestershire fell down into Division Two."]}, {"page": "Worcestershire County Cricket Club in 2005", "response": ["*  David Leatherdale", "The Worcestershire Royals put on 201 for 7 in their 44 overs, with David Leatherdale making 72 from 83 balls in an innings in which Graeme Hick became the heaviest scorer in the Sunday League's history. New Zealander Scott Styris took 3 wickets for Middlesex Crusaders, and kept the visitors from scoring freely. Middlesex made heavy work of overturning this total, even though they had 104 on the board before the first wicket fell. But ultimately they retained their 100% Sunday League record with 3 wickets and 1 over left. (BBC scorecard)", "Worcestershire Royals would be ruing lost opportunities after the game with Glamorgan Dragons at New Road. Winning the toss and batting first, captain Vikram Solanki paired up for 91 with Stephen Moore, who would go on to make 104. Zander de Bruyn also made an unbeaten fifty to lift Worcestershire to 273 for 3. The Indian international Sourav Ganguly was the only Glamorga bowler to come out with some credit, as he got one wicket for 19 in his five overs. Worcestershire started creditably, snaring the wicket of Robert Croft in the second over, but Glamorgan sent out another pinch-hitter in Alex Wharf who made 38 before he was bowled bu David Leatherdale who took two for 35. However, Sourav Ganguly with 53, Michael Powell with 82, and David Hemp with an unbeaten 51 off 36 balls chased down the target. The Glamorgan batsman took a particular liking to England Test spinner Gareth Batty who finished wicketless for 69 runs.", "Lancashire Lightning ensured continued survival in Division One of the National League with a victory over Worcestershire Royals in a rain-shortened match that was cut down from 45 to 33 overs. David Leatherdale and Gareth Batty took early wickets, as Lancashire lost their first four wickets for 65 runs, but Glen Chapple and Stuart Law added 84 for the fifth wicket, and Kyle Hogg also provided quick runs as Lancashire ended on 186 for 8. The six Lancashire bowlers then shared out wickets, as James Anderson ended with three for 12 including England batsman Vikram Solanki, while spinners Murali Kartik and Andrew Symonds took two each as Worcestershire were bowled out for 111. No Worcestershire batsman passed 25, and thus Worcestershire fell down into Division Two."]}, {"page": "Middlesex County Cricket Club in 2005", "response": ["The Worcestershire Royals put on 201 for 7 in their 44 overs, with David Leatherdale making 72 from 83 balls in an innings in which Graeme Hick became the heaviest scorer in the Sunday League's history. New Zealander Scott Styris took 3 wickets for Middlesex Crusaders, and kept the visitors from scoring freely. Middlesex made heavy work of overturning this total, even though they had 104 on the board before the first wicket fell. But ultimately they retained their 100% Sunday League record with 3 wickets and 1 over left. (BBC scorecard)"]}, {"page": "National League Division One in 2005", "response": ["The Worcestershire Royals put on 201 for 7 in their 44 overs, with David Leatherdale making 72 from 83 balls in an innings in which Graeme Hick became the heaviest scorer in the Sunday League's history. New Zealander Scott Styris took 3 wickets for Middlesex Crusaders, and kept the visitors from scoring freely. Middlesex made heavy work of overturning this total, even though they had 104 on the board before the first wicket fell. But ultimately they retained their 100% Sunday League record with 3 wickets and 1 over left. (BBC scorecard)", "Worcestershire Royals would be ruing lost opportunities after the game with Glamorgan Dragons at New Road. Winning the toss and batting first, captain Vikram Solanki paired up for 91 with Stephen Moore, who would go on to make 104. Zander de Bruyn also made an unbeaten fifty to lift Worcestershire to 273 for 3. The Indian international Sourav Ganguly was the only Glamorga bowler to come out with some credit, as he got one wicket for 19 in his five overs. Worcestershire started creditably, snaring the wicket of Robert Croft in the second over, but Glamorgan sent out another pinch-hitter in Alex Wharf who made 38 before he was bowled bu David Leatherdale who took two for 35. However, Sourav Ganguly with 53, Michael Powell with 82, and David Hemp with an unbeaten 51 off 36 balls chased down the target. The Glamorgan batsman took a particular liking to England Test spinner Gareth Batty who finished wicketless for 69 runs.", "Lancashire Lightning ensured continued survival in Division One of the National League with a victory over Worcestershire Royals in a rain-shortened match that was cut down from 45 to 33 overs. David Leatherdale and Gareth Batty took early wickets, as Lancashire lost their first four wickets for 65 runs, but Glen Chapple and Stuart Law added 84 for the fifth wicket, and Kyle Hogg also provided quick runs as Lancashire ended on 186 for 8. The six Lancashire bowlers then shared out wickets, as James Anderson ended with three for 12 including England batsman Vikram Solanki, while spinners Murali Kartik and Andrew Symonds took two each as Worcestershire were bowled out for 111. No Worcestershire batsman passed 25, and thus Worcestershire fell down into Division Two."]}, {"page": "Wardown Park", "response": ["* Best bowling in an innings: 2-15 by David Leatherdale, as above"]}, {"page": "1997 English cricket season", "response": ["|David Leatherdale"]}, {"page": "Alex Wylie (cricketer)", "response": ["Two years later he had Middlesex's John Emburey caught by David Leatherdale."]}, {"page": "Warwickshire County Cricket Club in 1994", "response": ["Worcestershire chose to bowl first on a gloomy first day which saw 62 overs lost to the weather. Warwickshire lost three wickets on the opening day, openers Andy Moles and Roger Twose both scored 39 with Brian Lara making five. On the second day Warwickshire lost their last seven wickets for 87 in 44 overs, Stuart Lampitt was the pick of the bowlers taking three wickets to finish with figures of 4/32. Worcestershire openers Philip Weston and Tim Curtis had both scored unbeaten half-centuries before the close. The pair had shared 208 for the opening partnership when Weston fell six short of a first century of the season, Curtis went on to score 180 in over eight hours of batting. In the post-tea session David Leatherdale (71*) and Lampitt (56*) capitalised on poor bowling to boost the total by 133 in 25 overs. A declaration left Warwickshire with a deficit of 257 and 116 overs to play, in a 14 over spell on the third evening they lost two wickets. Nightwatchman Graeme Welch (66) and Moles (67) put on 135 for the third wicket and with further half-centuries from Trevor Penney and Lara (57) Warwickshire comfortably survived the final day to draw the match."]}, {"page": "Leatherdale, David", "response": ["#redirectDavid Leatherdale"]}]}}