{"wiki_id": "http://www.wikidata.org/entity/Q5236014", "itemLabel": "David King-Wood", "itemDescription": "Stage and film actor (1913-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_King-Wood", "wikipedia_page": {"main": "David King-Wood (12 September 1913 – 3 September 2003) was a British actor.\nHe was born in Tehran, Iran (then Persia), the youngest of four children. His father was William King Wood (CIE, CBE), Director of the Indo-European Telegraph Department and his mother was Daisy Adcock, daughter of Sir Hugh Adcock (who was once the physician to the Shah of Persia).\nHe studied at Oxford University and was a keen member of OUDS (Oxford University Dramatic Society) appearing in The Radio Times in April 1936 whilst appearing as Richard II.\nDavid King-Wood (he apparently added the hyphen) appeared in British television and films during the 1950s. His Broadway credits include Friar Francis in Much Ado About Nothing (1959) and Adam Hartley in The Hidden River (1957). His British theatre credits include Measure for Measure and Richard III for The Old Vic, seasons with the Birmingham Repertory Company, the Oxford Repertory Company and the Worthing Repertory Company and the 1937 season at the Regent's Park Open Air Festival. He was also a regular performer with the Shakespeare Festival. His film credits include The Blakes Slept Here (1953) The Men of Sherwood Forest (1954) The Quatermass Xperiment (1955) and Jamboree (1957) among others.\nDuring the Second World War, his fluency in five languages, including Japanese, was used to the fore, but at the expense of his theatrical career.\nHe relocated to New York in the mid-1950s and acted on Broadway for a number of years. David was also the \"it\" male model for a time and was the \"Marlboro Man\" for a couple of years. He ended his professional life teaching English and French at St. Bernard's School in New York, as well as directing the annual Shakespeare Play there.\nDavid loved nature, and as an enthusiastic New Yorker, spent many happy hours in Central Park. More than one hundred and fifty of his friends contributed to the David King-Wood Tree Fund, and two European Linden trees have been endowed in his name. There is a paving stone by the Olmsted Flowerbed at Literary Walk, mid-park at Sixty-Seventh Street, as well as the two trees near the East Meadow.", "link_mentions": [{"page": "2003 in film", "response": ["| style=\"text-align:center;\"| 3 || David King-Wood || style=\"text-align:center;\"| 89 || style=\"text-align:center;\"| US || style=\"text-align:center;\"| Actor || "]}, {"page": "Doctor Faustus (play)", "response": ["The first television adaptation was broadcast in 1947 by the BBC starring David King-Wood as Faustus and Hugh Griffith as Mephistopheles. In 1958, another BBC television version starred William Squire as Faustus in an adaptation by Ronald Eyre intended for schools. In 1961, the BBC adapted the play for television as a two-episode production starring Alan Dobie as Faustus; this production was also meant for use in schools."]}, {"page": "The Quatermass Xperiment", "response": ["The Quatermass Xperiment (a.k.a. The Creeping Unknown in the United States) is a 1955 British science fiction horror film drama from Hammer Film Productions, based on the 1953 BBC Television serial The Quatermass Experiment written by Nigel Kneale. The film was produced by Anthony Hinds, directed by Val Guest, and stars Brian Donlevy as the eponymous Professor Bernard Quatermass and Richard Wordsworth as the tormented Carroon. Jack Warner, David King-Wood, and Margia Dean appear in co-starring roles.", "* David King-Wood as Dr. Gordon Briscoe", "Among the other actors that appear in the film are Thora Hird, Gordon Jackson, David King-Wood, Harold Lang, Lionel Jeffries, and Sam Kydd, many of whom appeared regularly in films directed by Val Guest. The Quatermass Xperiment also saw an early role for Jane Asher, who plays the little girl whom Carroon encounters when he is on the run.", "thumb|right|alt=A black-and-white screenshot from the film depicting a tall man in a white coat reading a clipboard watched by a man with a moustache wearing a dark suit. In the foreground a man is seated rigidly staring straight ahead, his eyes and face sunken into a skeletal appearance|Quatermass (Brian Donlevy) (centre) and Briscoe (David King-Wood) (left) examine Carroon (Richard Wordsworth) (seated) in a scene from The Quatermass Xperiment. Makeup artist Phil Leakey worked with cinematographer Walter J. Harvey to accentuate the shadows around Wordworth's face to give him a skeletal appearance."]}, {"page": "Private's Progress", "response": ["* David King-Wood as Gerald"]}, {"page": "A Stranger Came Home", "response": ["* David King-Wood as Sessions"]}, {"page": "Jamboree (1957 film)", "response": ["* David King-Wood as Warren Sykes"]}, {"page": "Break in the Circle", "response": ["* David King-Wood as Colonel Patchway "]}, {"page": "The Astonished Heart", "response": ["An adaptation for radio was broadcast by the BBC in the US in 1953 with Diana Churchill as Barbara, Brenda Dunrich as Leonora and David King-Wood as Chris.\" The Stars in Their Choices\", BBC Genome. Retrieved 2 April 2020"]}, {"page": "The Blakes Slept Here", "response": ["|David King-Wood"]}, {"page": "The Men of Sherwood Forest", "response": ["The Men of Sherwood Forest is a 1954 British adventure film directed by Val Guest and starring Don Taylor, Reginald Beckwith, Eileen Moore and David King-Wood. The film follows the exploits of Robin Hood and his followers.  Doreen Carwithen wrote the score for the film.", "* David King-Wood - Sir Guy Belton"]}, {"page": "The Stolen Airliner", "response": ["* David King-Wood - Controller"]}, {"page": "St. Bernard's School", "response": ["*David King-Wood, longtime former faculty member, directed the school's Shakespeare play and is the namesake of an auditorium in the school "]}, {"page": "Hugh Adcock (physician)", "response": ["There was an adopted daughter, Daisy Adcock, who was the mother of the actor David King-Wood."]}, {"page": "King-Wood, David", "response": ["#redirectDavid King-Wood"]}]}}