{"wiki_id": "http://www.wikidata.org/entity/Q5239096", "itemLabel": "David Roach", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Roach_(saxophonist)", "wikipedia_page": {"main": "David Roach (born 1955, Darlington, Co. Durham, England) is a British saxophonist who released a solo single, \"Emotional Jungle\" in 1984. His album, I Love Sax reached #73 in the UK Albums Chart in April that year. As a Coda-Landscape recording artist in the 1980s David made 2 albums 'Running with the River ' and 'The Talking City'.\nHe has played soprano and alto saxophone for the Michael Nyman Band since 1985, making his debut on The Kiss and Other Movements and appearing on nearly every album since. Prior to that he was musical director for Billy Ocean and a founding member of the Myrha Saxophone Quartet. David played oboe and saxophone for Frank Sinatra in his European tours of the early 1990s.\nHe was a member of the Apollo Saxophone Quartet and producer of the London Saxophonic.  He also co-produced Nyman's albums, After Extra Time, The Suit and the Photograph and Sangam.\nHis soprano and alto saxophone playing has featured in many Film and Television scores. David has played with most of the major London Orchestras including 25 years for the Philharmonia Orchestra and he has been a visiting professor of chamber music at the Guildhall School of Music and Drama in London and the Royal Northern College of Music in Manchester.", "link_mentions": [{"page": "The Colour of Spring", "response": ["* David Roach — soprano saxophone (tracks 2, 4, and 5)"]}, {"page": "Prospero's Books", "response": ["*David Roach, soprano & alto saxophone"]}, {"page": "Lyricon", "response": ["* David Roach"]}, {"page": "List of songs about Los Angeles", "response": ["* \"Tinsel Town\" by David Roach (saxophonist)"]}, {"page": "Facing Goya", "response": ["*David Roach, soprano, alto sax"]}, {"page": "Michael Nyman Band", "response": ["*David Roach (1985–), soprano, alto and tenor saxophones"]}, {"page": "À la folie", "response": ["*David Roach – soprano/alto saxophones"]}, {"page": "London Saxophonic", "response": ["London Saxophonic is a saxophone ensemble (with piano, bass guitar, and percussion) begun by Gareth Brady, Will Gregory and Simon Haram, while they were studying at the Guildhall School of Music and Drama.  They made their debut in 1994 on Atlantic Records with Sax Pax for a Sax, a collaboration with Moondog, who composed all of the works on the album.  In 1998, they  went to the now-defunct label Tring (primarily a budget-label of technically primitive, cheaply recorded classical music)  with a Michael Nyman retrospective titled An Eye for a Difference, produced by David Roach.", "*David Roach - soprano saxophone, alto saxophone, tenor saxophone"]}, {"page": "The Michael Nyman Songbook", "response": ["*David Roach, soprano, alto, tenor saxophone", "*David Roach, soprano and alto saxophone"]}, {"page": "Michael Nyman Live", "response": ["**David Roach, soprano/alto saxophones"]}, {"page": "The Piano (soundtrack)", "response": ["The Piano is the original soundtrack, on the Virgin Records label, of the 1993 Academy Award-winning film The Piano. The original score was composed by Michael Nyman and is his twentieth album release. Despite being called a \"soundtrack\", this is a partial score re-recording, as Nyman himself also performs the piano on the album (whereas the film version is performed by lead actress Holly Hunter). The music is performed by the Munich Philharmonic Orchestra conducted by Nyman with Michael Nyman Band members John Harle, David Roach and Andrew Findon performing the prominent saxophone work.", "*David Roach, soprano, alto saxophone"]}, {"page": "The Ogre (1996 film)", "response": ["*David Roach, soprano/alto/tenor saxophones"]}, {"page": "Noises, Sounds & Sweet Airs", "response": ["The album, Nyman's 25th release, was released by Argo Records on May 16, 1995.  It has a running time of 72:35.  It was again performed by  L'Ensemble de Basse-Normandie conducted by Dominque Debart.  The saxophones are played by David Roach and Andrew Findon.  It is the fourth release of Nyman's music that Nyman himself supervised, on which he provides liner notes and produced, but neither performs nor conducts.  The album is the first of Nyman's many collaborations with Hilary Summers.", "*David Roach, saxophone"]}, {"page": "Man and Boy: Dada", "response": ["*David Roach, soprano, alto saxophone"]}, {"page": "David Roach", "response": ["David Roach may refer to:", "*David Roach (American football) (born 1985), American football safety", "*David Roach (saxophonist) (born 1955), British classical saxophonist", "*David Roach (comics), British comics artist", "*David Roach (athletic director) (born 1949), director of athletics for Fordham University", "*David Roach of the 1996 film The Adventures of Pinocchio", "* David Roach, alias for Keith Silverstein voice actor"]}, {"page": "The Essential Michael Nyman Band", "response": ["*John Harle, David Roach, soprano & alto saxophone"]}, {"page": "The Kiss and Other Movements", "response": ["*David Roach, Soprano, Alto Saxophone"]}, {"page": "After Extra Time (album)", "response": ["*David Roach, alto (doubling tenor) sax", "*producer: Michael Nyman, with Martin Elliott and David Roach", "*David Roach, soprano & alto saxophone", "*David Roach, alto saxophone"]}, {"page": "The Suit and the Photograph", "response": ["*David Roach, soprano and alto saxophones"]}, {"page": "And Do They Do/Zoo Caprices", "response": ["*David Roach, alto, tenor saxophone"]}]}}