{"wiki_id": "http://www.wikidata.org/entity/Q5232657", "itemLabel": "David Creasser", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Creasser", "wikipedia_page": {"main": "David L. Creasser (born 1965) is an English former professional rugby league footballer who played in the 1980s and 1990s. He played at representative level for British Amateur Rugby League Association (BARLA) Young Lions (alongside Garry Schofield), and Great Britain, and at club level for Hunslet Parkside ARLFC, Leeds (Heritage № 1124), Keighley Cougars and Bramlsy, as a goal-kicking centre, i.e. number 3 or 4.", "link_mentions": [{"page": "Keighley Cougars", "response": ["* David Creasser"]}, {"page": "1990 Kangaroo tour of Great Britain and France", "response": ["|IC ||16||David Creasser"]}, {"page": "1986 Kangaroo tour of Great Britain and France", "response": ["|RW ||2||David Creasser", "Leeds were unlucky not to be awarded a try midway through the second half after it appeared that replacement forward Trevor Skerrett had managed to get the ball down after good lead up work by former Great Britain international Jeff Greyshon. However an un-sighted referee Whitfield ruled that Skerrett had been held up in-goal. Leeds only other scoring opportunity came in the first half but young winger David Creasser missed a relatively simple penalty kick from in front of the posts. Leeds' centre pairing for the game were Cronulla-Sutherland imports Andrew Ettingshausen and Mark McGaw who would play against Leeds for Australia on the 1990 Kangaroo tour.1986 Leeds vs Australia highlights"]}, {"page": "List of Leeds Rhinos international players", "response": ["* David Creasser won caps for Great Britain while at Leeds in 1985 against France (2 matches), in 1987 against France, and in 1988 against France"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* David Creasser circa-1985", "*David Creasser"]}, {"page": "1983–84 League Cup", "response": ["|David Creasser||3||Keiron O'Loughlin", "|David Creasser (5)||G||Mick Burke (1)"]}, {"page": "1987–88 League Cup (rugby league)", "response": ["|Shane Cooper||6||David Creasser", "|||T||David Creasser (1)", "|Paul Loughlin (3)||G||David Creasser (3)"]}, {"page": "1991–92 League Cup (rugby league)", "response": ["|Andy Currier||3||David Creasser"]}, {"page": "List of testimonial players at Leeds Rhinos", "response": ["|  David Creasser "]}, {"page": "1985–1988 Rugby League World Cup players", "response": ["#David Creasser"]}, {"page": "1983 Queensland rugby league tour of Papua New Guinea and England", "response": ["Leeds: Ian Wilkinson, Paul Prendiville, David Creasser, Steve Martin, Andrew Smith, John Holmes, Kevin Dick, Ron Dickinson, Russ Sowden, Keith Rayne, Kevin Rayne, Kevin Squire, David Herron. Res – David Heselwood, Colin Cooper, Garry Clark Kevin James. Coach – Robin Dewhurst"]}, {"page": "Creasser, David", "response": ["#redirectDavid Creasser"]}]}}