{"wiki_id": "http://www.wikidata.org/entity/Q5232393", "itemLabel": "David Clark", "itemDescription": "English cricketer and administrator (1919-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Clark_(cricketer)", "wikipedia_page": {"main": "David Graham Clark (27 January 1919 – 8 October 2013)  was an English cricketer and cricket administrator.\nClark was born in Barming in Kent. He played first-class cricket for five years, appearing for Kent County Cricket Club. He was Kent's captain for the last three years of his career before retiring at the end of the 1951 season. He was President of MCC in 1977–78.During World War II he was a parachute instructor at Ringway during the formation of the British Airborne Forces, and was then attached to 2nd Battalion the Parachute Regiment, with whom he fought in North Africa, Sicily and Italy. During the attack on Sicily his glider landed in the sea and he swam to shore with 3 other survivors. He was then posted to HQ 1st Airborne Division and ended up at the bridge in Arnhem with 2 Para, where he was eventually taken prisoner. A modest man, he never mentioned his wartime service.He is likely to be best remembered for chairing the committee set up by the MCC in 1965 to \"examine the future of county cricket in the widest possible terms and if thought fit to recommend alterations in the structure and playing conditions of the County Championship\". The first-class counties rejected most of the recommendations made in the so-called \"Clark Report\", including those for reducing the County Championship to sixteen games and introducing a new one-day league, also of sixteen games. However, before many years had passed changes not dissimilar to these would be introduced. According to Mike Turner, a member of the Clark committee: \"We started the ball rolling. The Clark Report was a great stimulus for fresh thinking.\"Clark was the tour manager of the 1970-71 English Ashes tour of Australia. The England fast bowler John Snow wrote that the tour \"emphasised the gulf between players and administrators\" and \"I was sick of the biased attitude and incompetence which was apparent in cricket administration\". Clark was described by the England captain Ray Illingworth as \"an amiable, but somewhat ineffectual man\" and there were soon divisions between him and the players.\nJohn Snow had bowled over 50 eight-ball overs in the First Test and was rested for the state match against Western Australia, but Clark insisted that he practice in the nets with the others. Snow bowled a couple of desultory overs and Clark berated him for five minutes after which Snow told him \"that as far as my good conduct money was concerned he could swallow it\" and went walkabout until the next day. Ray Illingworth smoothed things over, but after the Second Test Clark criticized both captains for cautious play, England for their short-pitched bowling and indicated that he would prefer to see Australia win 3-1 than see four more draws. Ray Illingworth only discovered this when he was asked for a comment by a journalist in the morning and the rest of the team when they read the newspapers at the airport. As a result, Illingworth effectively took over the running of the tour with the support of the players and Clark's influence declined.Clark's only ally was the vice-captain Colin Cowdrey, also from Kent, who became isolated as a result. In the final Test at Sydney, Clark tried to push Illingworth back onto the field when he took the team off because of the crowd throwing beer cans after the Snow–Jenner incident. A furious Illingworth said he would not return until the playing area had been cleared and the crowd had calmed down and objected to Clark constantly siding with the Australians against his own team. When the team returned to England, Illingworth said that \"all hell would break loose\" if anyone was denied his good conduct bonus, but this did not happen. However, Geoffrey Boycott and John Snow had to report to Lord's for a dressing down by the MCC Secretary Billy Griffith for their behaviour.", "link_mentions": [{"page": "Colin Cowdrey", "response": ["Cowdrey made his first first-class century in 1951, 143 for the Free Foresters vs Oxford University, soon followed by 106 for the Gentlemen vs Players at Scarborough, captained by Len Hutton with Alec Bedser leading the bowling. After the match, the former Yorkshire captain Brian Sellers told him \"If you are not playing for England and on that boat to Australia there'll only be one person to blame\".Cowdrey, p. 54 He made 1,189 runs (33.02) in the 1951 season and was awarded his county cap by captain David Clark after making 71 against the touring South Africans, at 18 the youngest man to be capped by Kent. ", "Cowdrey's return to the England team fueled speculation that he was to resume the captaincy from Illingworth, but he did not and in the Third 'Test' he was told that his rival would be made captain for the Australian tour. He was willing to accompany him as a player, but had to think about being vice-captain again as he thought a younger man should be chosen. In the end he accepted in order to help his Kent teammate David Clark with the administration. ", "Cowdrey was made vice-captain for an Australian tour for the fourth time and Illingworth's tough no-nonsense approach to the game clashed with the MCC tour manager David Clark, who had been captain of Kent in Cowdrey's youth and had given him his county cap. As a result, Illingworth effectively took over the running of the tour with the support of the players and Clark's influence declined,Snow, pp. 94–95Swanton, pp. 150–51 as did that of Cowdrey, who as his only ally he became isolated, though he still had his Kent teammates Derek Underwood, Alan Knott and Brian Luckhurst.Snow, p. 110 The players tended to avoid the press and public, even to the point of having their meals in their hotel rooms, and only Cowdrey made an effort to meet and greet the cricket fans. The rotund Cowdrey was in the sunset of his career and failed on tour, making only one century – 101 against Victoria – which was so slow that he was likened to a beached whale.Richard Whitington, Captains Outrageous? Cricket in the Seventies, Stanley Paul (1972), p. 54"]}, {"page": "John Snow (cricketer)", "response": ["Snow wrote that the series in Australia \"emphasised the gulf between players and administrators\" and \"I was sick of the biased attitude and incompetence which was apparent in cricket administration\".p3, Snow The M.C.C. tour manager was David Clark, described by Ray Illingworth as \"an amiable, but somewhat ineffectual man\".p147, Criss Freddi, The Guinness Book of Cricket Blunders, Guinness Publishing, 1996. and there were soon divisions between him and the players."]}, {"page": "Henry Blofeld", "response": ["Blofeld took a job at the merchant bank Robert Benson LonsdaleBlofeld (2001), p. 50 for three years, but it was not to his taste and he drifted into sports journalism. He reported on the England tour to India in 1963–4 for The Guardian, and was close to being picked as an emergency batsman to replace the ill Micky Stewart for the 2nd Test in Bombay. When he was told by David Clark, the tour manager, that he might have to play, Blofeld replied \"I would certainly play if needed, but if I scored 50 or upwards in either innings I was damned if I would stand down for the Calcutta Test\". On the day of the Test Stewart discharged himself from hospital and played despite his illness. After tea on the first day, Stewart was rushed back to hospital and played no further part in the tour. Blofeld continued as a print journalist until 1972 when he joined the Test Match Special team. He had also previously commentated for ITV in the 1960s."]}, {"page": "Kent County Cricket Club", "response": ["The rebuilding of the side continued under David Clark's captaincy – Clark would later become chairman the club. Colin Cowdrey, the first man to play 100 Test matches made his Kent debut in 1950 and was appointed captain in 1957, following Doug Wright who was the first professional to captain Kent. Wright took over 2,000 wickets with his brisk leg breaks and googlies between 1932 and 1957 and became the only player to take seven hat-tricks – six of them taken for Kent.Doug Wright, Obituary, Wisden Cricketers' Almanack, 1999. Retrieved 2018-10-24."]}, {"page": "David Clark", "response": ["*David Clark, Baron Clark of Windermere (born 1939), British politician", "*David Clark (Utah politician) (born 1953), Republican State Representative for Utah's 74th District", "*David Clark (New Zealand politician) (born 1973), Labour MP for Dunedin North since 2011", "*David Clark (Georgia politician), Republican State Representative for Georgia's 98th District", "*David Clark (cricketer) (1919–2013), English cricketer", "*David Clark (footballer, born 1878), Irish footballer", "*David Clark (racing driver) (born 1978), Australian race car driver", "*David Clark (rower) (born 1959), Olympic silver medal winner", "*David Clark (rugby union) (born 1940), former Australian rugby union footballer and current coach", "* David Clark (1816 ship), a convict ship", "* David Clark, 2008 winner of BBC's Mastermind quiz show", "* David Clark (cartoonist), American illustrator", "* David Clark (psychiatrist) (1920–2010), British psychiatrist who pioneered therapeutic communities in mental hospitals", "* David Clark Company, a manufacturer of headphones used in professional applications", "* David Clarke (disambiguation)"]}, {"page": "Barming", "response": ["*David Clark (1919–2013), cricketer, born here"]}, {"page": "Lou Rowan", "response": ["The Seventh Test at Sydney on 12 February to 17 February 1971 was Rowan's last, with Tom Brooks as his umpiring colleague. It was a dramatic game won by England by 62 runs to regain The Ashes. Doug Walters had to be stumped twice by Alan Knott off Derek Underwood as he was given not out by Rowan the first time when on 41, but was a few balls later by Brooks for 42.p105, John Snow, Cricket Rebel, Hamlyn, 1976 After Keith Stackpole was caught off a thick edge by Knott off Peter Lever on 13, but was given not out by Rowan, the England captain Ray Illingworth said, \"It was really unbelievable\".pp. 107–108, John Snow, Cricket Rebel, Hamlyn, 1976 Later in the innings Illingworth led the English players from the field following a crowd disturbance after John Snow had hit Australian lower-order batsman Terry Jenner on the head with a bouncer. Rowan had issued Snow with a warning for intimidatory bowling and Snow’s and Illingworth’s displeasure was clear to the crowd, who booed passionately.  When Snow finished his over and moved to his fielding position on the boundary, he was grabbed by a spectator, and had beer-cans thrown at him. Following the English walk-off, Rowan advised them to either resume or forfeit the match, and the players returned after the ground was cleared. In this Rowan was supported by the England manager David Clark and Alan Barnes of the A.B.C.pp. 104–108, John Snow, Cricket Rebel, Hamlyn, 1976"]}, {"page": "Bryan Valentine", "response": ["Valentine was educated at Repton School and Pembroke College, Cambridge. He represented Cambridge University at cricket in 1928 and 1929, and also won a Blue for soccer. His long career at Kent County Cricket Club as a right-handed batsman and occasional medium pacer spanned two decades from 1927 to 1948.  He was awarded his Kent cap in 1931 and captained the county on occasion during the 1930s in the absence of Percy Chapman; in 1937 he shared the captaincy with Ronnie Bryan.  Following Gerry Chalk's death in World War II Valentine captained Kent again between 1946 and 1948 before being succeeded by David Clark."]}, {"page": "English cricket team in Australia in 1970–71", "response": [":David Clark", "The series in Australia 'emphasised the gulf between players and administrators' and John Snow wrote 'I was sick of the biased attitude and incompetence which was apparent in cricket administration.p3, Snow David Clark was the MCC tour manager, Bernard Thomas of Warwickshire the assistant manager and physiotherapist and G.C.A. Saulez the scorer.p189, Snow Clark had been the amateur captain of Kent in 1949-51 who was described by Ray Illingworth as \"an amiable, but somewhat ineffectual man\".p147, Freddi and there were soon divisions between him and the players. John Snow had bowled over 50 eight-ball overs in the First Test and was rested for the state match against Western Australia, but Clark insisted that he practice in the nets with the other bowlers. Snow bowled a couple of desultory overs and Clark berated him for five minutes after which Snow told him \"that as far as my good conduct money was concerned he could swallow it\" and went walkabout until the next day.p93-94, Snow Ray Illingworth smoothed things over, but in Second Test Clark criticised both captains for cautious play and England for their short-pitched bowling. When asked by the press if he would prefer four more draws or a 3-1 Australian victory he replied \"I'd rather see four results\" as if they were drawn there might be no Ashes left to play for.p150, Swanton, 1977 Ray Illingworth only discovered this when he was asked for a comment by a journalist in the morning and the team when they read it in the newspapers.p88, Snow As a result, Illingworth effectively took over the running of the tour with the support of the players and Clark's influence declined.p94-95, Snowp150-151, Swanton, 1977 Clark's only ally was the vice-captain Colin Cowdrey, also from Kent, who became isolated as a result.p110, Snow Unlike his predecessors Illingworth insisted on good hotel accommodation, decent sporting facilities, better travel arrangements, higher allowances and pay and fought hard to get them, which was greatly appreciated by the players.p81, Snow In the final Sydney Test Clark tried to push Illingworth back onto the field when he took the team off because of the crowd throwing beer cans after the Snow-Jenner incident. A furious Illingworth said he would not return until the playing area had been cleared and the crowd had calmed down and objected to Clark constantly siding with the Australians against his own team. When the team returned to England Illingworth said that \"all hell would break loose\" if anyone was denied his good conduct bonus (as had happened with Fred Trueman in the West Indies in 1953-54),p171, Fred Trueman, As It Was, Pan Books, 2004 but this did not happen. However, Geoffrey Boycott and John Snow had to report to Lord's for a dressing down for their behaviour by the Secretary of the MCC Billy Griffith.p136, Snow"]}, {"page": "1919 in the United Kingdom", "response": ["** David Clark, cricketer (died 2013)"]}, {"page": "List of Kent County Cricket Club captains", "response": ["| David Clark || 1949 || 1951 || Later became an administrator of Kent, MCC and the ICC.Obituaries in 2013 - Clark, David Graham,  Wisden Cricketers' Almanack, 2014. Retrieved 2016-02-28."]}, {"page": "1970–71 Ashes series", "response": ["The Australian selectors dropped Paul Sheahan (who Don Bradman had tipped as the future captain of Australia) and Terry Jenner and brought back the experienced fast-medium bowler Alan Connolly and the off-spinner Ashley Mallett, even though he was not liked by Bill Lawry.p115, Whitington England kept the same team from Perth. Ray Illingworth won the toss and decided to field, but rain began to fall before the teams went out and after three days of continuous rain the match was abandoned without a ball being bowled. Desperate attempts to dry the boggy outfield were made by Ian Johnson and the MCG ground staff, who claimed that \"if the match had been in England the teams would have played. The outfield was good, the wicket firm and bowlers' run-ups safe\". Each day they announced that play would be able to start \"as soon as the rain stopped\" to encourage spectators to come to the ground.p 90-91, Snow One English writer said that the 8,000 people who arrived on the Thursday would have 'gladly paid a dollar each to permit the M.C.G. to buy a proper cover'.p 115, Whitington Sir Cyril Hawker, President of the MCC, and Gubby Allen, the treasurer, happened to be in Melbourne and with David Clark arranged the historic One Day International for the fifth day with Sir Donald Bradman and the Australian Board of Control. They also cancelled the second tour match between Victoria and the MCC so that an extra Test could be played. Ray Illingworth and the England players were not consulted and only found out when Bradman came into the dressing room to thank them for their co-operation.p 89, Snow The players had severe misgivings about this state of affairs as the extra Test might cost them the Ashes and cancelled one of their rest days. They now had only five rest days in the last six weeks of the tour, and these included official receptions and engagements. There was also the question of pay and it was several weeks before Clark was able to grant an extra £100, long after the Australians had agreed a pay deal with their team.p 90, Snow", "England won the toss and understandably decided to bat, with a 1–0 lead in the series they had no incentive to hurry and spent ten and a half hours making 470. Bill Lawry gave the new ball to 'Froggie' Thomason and had debutant Dennis Lillee bowling into a strong southerly wind, even so Lillee was yards faster than Thomson, and more accurate.p193, Whitington Geoff Boycott (58) and John Edrich (130) added 107 for the first wicket before Boycott was given run out despite his strong opinion to the contrary. E.W. Swanton in the commentary box shouted \"He's out!\" when Ian Chappell threw down the stumps and as he had failed to ground his bat when reaching the crease Umpire O'Connell had given him out.p158, Swanton, 1977pp194-195, Whitington Convincing Boycott that he was out was always a difficult business and his displeasure was obvious when he threw his bat to the ground, he caused further trouble when he pointedly refused to apologise to the umpires for his behaviour (Boycott later apologised to Umpire O'Connell in private).p78-79, Arnold He stormed off the field with the crowd howling in his ears and to wide condemnation by the press when a photograph showed he was clearly out. Some called on David Clark to withdraw Boycott's £150 good conduct bonus and Keith Miller said \"This will cost Boycott the England and maybe also the Yorkshire captaincy\". Keith Fletcher returned to form with 80 out of a stand of 169 with Edrich before the Surrey opener was caught by Stackpole to give Lillee his first, hard earned, Test wicket. Lillee (5/84) dismissed Alan Knott, Alan Thomson bowled Fletcher and England lost three wickets for 13 runs, but soon found their way again. Basil D'Oliveira (47), John Hampshire (55), Ray Illingworth (24) and John Snow (38) took them to 458/6 before Lillee cleared up the tail, the last four wickets falling for twelve runs.", "Terry Jenner retired hurt when he ducked into a short delivery from Snow on 8. Rowan warned the fast bowler for intimidatory bowling yet again, but Snow and Illingworth objected strongly, the captain saying \"That's the only bouncer he's bowled\" and that he would complain to the ABC,p97 and 105–106, Snow but Snow had bowled three other short balls at Jenner earlier in the over and Bob Willis had been brought in for the mis-hit.p161, Swanton, 1977 Rowan later claimed that Illingworth and Snow swore at him, which they denied. The bowler was loudly booed and \"when he returned to his fielding position at long-leg Snow was pelted with bottles, cans and partially eaten pies\". Some of the crowd wanted to shake his hand, but then he was grabbed by a drunk at Paddington Hill who was forced to let go by other spectators. In 1998 the eighty-year-old Trevor Guy told the Sydney Morning Herald that he was the man who had grabbed Snow in order to tell him what he thought about him hitting Jenner. Guy and Snow, in Australia for the 1998–99 Ashes series, agreed that they had no hard feelings about the matter. To avoid injury to his team Illingworth took his men back to the dressing room without the permission of the umpires, an unprecedented move in Test cricket. He later justified his action by saying \"I've seen people hit by bottles and it makes a bloody mess of them\".p72-74, Batty The England manager David Clark tried to push Illingworth back onto the field and Lou Rowan told them that if they did not immediately return they would forfeit the match (and the Ashes) and was supported by Alan Barnes of the ABC.p104-108, Snowp510, Firth A furious Illingworth said he would not return until the playing area had been cleared and the crowd had calmed down. Furthermore, he strongly objected to Clark constantly siding with the Australians against his own team. It took seven minutes for the groundstaff to move the debris, during which one was hit on the head with a beer-can and had to be taken to hospital, though most of the 40 cans were for soft drinks.p106-107, Snow The Australian batsmen Greg Chappell and Dennis Lillee remained at the crease throughout the incident."]}, {"page": "MCC tour of Australia in 1970–71", "response": ["On tours of Australia it was usual for state teams to be reinforced with potential Australian players to provide stronger opposition, allow the selectors to judge their ability and to entertain the crowd. Paul Sheahan of Victorian was brought over after his failures in the first two Tests, but he did not get to bat as the second and third days of the three-day game were rained off. On the first day Geoff Boycott (74) and Colin Cowdrey (64) added 98 for the first wicket and the tourists reached 184/4 from 47 overs. Manager David Clark told his team that if they continued to play as they did they would be out of a job in fives years and 'pointed the slow-scoring bone at both captains' Ray Illingworth and Bill Lawry. Frank Tyson agreed, writing \"Wake up and entertain, or you could be drawing unemployment benefits next week\".pp111-112, Whitington"]}, {"page": "2013 in the United Kingdom", "response": ["** David Clark, 94, cricket player and administrator."]}, {"page": "Deaths in October 2013", "response": ["*David Clark, 94, English cricketer and administrator.CLARK – David Graham"]}]}}