{"wiki_id": "http://www.wikidata.org/entity/Q5232811", "itemLabel": "David Daniel", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Daniel_(rugby_union)", "wikipedia_page": {"main": "David John Daniel (1871 – 30 April 1948) was a Welsh international rugby union forward who played club rugby for Llanelli and international rugby for Wales.", "link_mentions": [{"page": "1948 in Wales", "response": ["*30 April – David Daniel, Wales international rugby union player, 77"]}, {"page": "1891 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), William McCutcheon (Swansea), Dickie Garrett (Penarth), David Gwynn (Swansea), George Thomas (Newport), Ralph Sweet-Escott (Cardiff), Hugh Ingledew (Cardiff), Percy Bennett (Cardiff Harlequins), Sydney Nicholls (Cardiff), Tom Graham (Newport), William Bowen (Swansea), Walter Rice Evans (Swansea), David Daniel (Llanelli), Rowley Thomas (London Welsh), Willie Thomas (Llanelli) capt."]}, {"page": "1894 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), William McCutcheon (Oldham), Arthur Gould (Newport) capt., Conway Rees (Llanelli), Percy Phillips (Newport), Fred Parfitt (Newport), Frank Mills (Swansea), Charles Nicholl (Llanelli), David Daniel (Llanelli), Jim Hannan (Newport), Frank Hill (Cardiff), Arthur Boucher (Newport), Tom Graham (Newport), Wallace Watts (Newport)", "Wales: Billy Bancroft (Swansea), William Llewellyn Thomas (Newport), Tom Pearson (Oldham), Arthur Gould (Newport) capt., Dai Fitzgerald (Cardiff), Percy Phillips (Newport), Fred Parfitt (Newport), Frank Mills (Swansea), Charles Nicholl (Llanelli), David Daniel (Llanelli), Jim Hannan (Newport), Frank Hill (Cardiff), Harry Day (Newport), Tom Graham (Newport), Wallace Watts (Newport)", "Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), Tom Pearson (Oldham), Jack Elliott (Cardiff), Dai Fitzgerald (Cardiff), Ralph Sweet-Escott (Cardiff), Fred Parfitt (Newport), Frank Mills (Swansea), Fred Hutchinson (Neath), David Daniel (Llanelli), Jim Hannan (Newport), Frank Hill (Cardiff) capt., Harry Day (Newport), David Nicholl (Llanelli), Wallace Watts (Newport)"]}, {"page": "1898 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Pussy Jones (Cardiff), Tom Pearson (Newport), Selwyn Biggs (Cardiff), Jack Elliott (Cardiff), Hopkin Davies (Swansea), Tom Dobson (Cardiff), David Daniel (Llanelli), William Alexander (Llwynypia), George Boots (Newport), Dick Hellings (Llwynypia), Fred Cornish (Cardiff), Joseph Booth (Pontymister)", "Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Pussy Jones (Cardiff), Tom Pearson (Newport), Selwyn Biggs (Cardiff), Jack Elliott (Cardiff), Hopkin Davies (Swansea), Tom Dobson (Cardiff), David Daniel (Llanelli), William Alexander (Llwynypia), George Boots (Newport), Dick Hellings (Llwynypia), Fred Cornish (Cardiff), Dai Evans (Penygraig)"]}, {"page": "1899 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Reg Skrimshire (Newport), Llewellyn (Llwynypia), Evan James (Swansea), David James (Swansea), Jere Blake (Cardiff), Tom Dobson (Cardiff), William Alexander (Llwynypia), Fred Scrine (Swansea), David Daniel (Llanelli), Alfred Brice (Aberavon), Jehoida Hodges (Newport), Will Parker (Swansea)", "Wales: Billy Bancroft (Swansea) capt., Viv Huzzey (Cardiff), Gwyn Nicholls (Cardiff), Reg Skrimshire (Newport), Willie Llewellyn (Llwynypia), Selwyn Biggs (Cardiff), Llewellyn Lloyd (Newport), William Alexander (Llwynypia), Jere Blake (Cardiff), Fred Cornish (Cardiff), David Daniel (Llanelli), Alfred Brice (Aberavon), Jehoida Hodges (Newport), George Boots (Newport), Dick Hellings (Llwynypia)"]}, {"page": "William McCutcheon", "response": ["McCutcheon began playing rugby with Swansea playing as a full-back but was brought onto the wing. It was as a wing that McCutcheon was selected to represent Wales when he was chosen for the second game of the 1891 Home Nations Championship. Played away to Scotland at Raeburn Place, McCutcheon was one of three new Welsh caps in the game, the others being Ralph Sweet-Escott at half-back and David Daniel in the pack. Wales lost the game 15–0, and McCutcheon lost his place in the next game to Tom Pearson, who McCutcheon himself had replaced the game before. At the end of the 1890/91 season he was again part of a Championship County winning team with Lancashire."]}, {"page": "Tom Dobson", "response": ["Dobson was back in the Wales squad the next year in the 1899 Championship, joined in the pack only by David Daniel and Willie Alexander from the previous season, the other five players all being new caps. The first game of the Championship was against England, and Dobson was part of the team that secured a record win over the English, with Welsh wing Willie Llewellyn scoring four tries. Dobson's final game was the Championship encounter with Scotland in 1899 which Wales lost 21-10."]}, {"page": "Fred Miller (rugby)", "response": ["Miller found himself out of favour with the Welsh selectors until he was recalled four years later for the 1900 Championship replacing Llanelli's David Daniel. This was the beginning of the First Golden Age of Welsh rugby, and Miller was part of the team that won all three of the 1900 Championship games to lift the Triple Crown. Miller played in all three matches, and did enough to secure his reselection for the entire 1901 Home Nations Championship. Wales won the opener against England and the final game to Ireland, but were outclassed against Scotland at Inverleith. Miller was replaced in the 1902 tournament by Arthur Harding."]}, {"page": "David Daniel", "response": ["David Daniel may refer to:", "* David Daniel (rugby union) (1871–1948), Welsh rugby union forward", "* David Daniel (politician) (1903–1962), member of the Queensland Legislative Assembly"]}]}}