{"wiki_id": "http://www.wikidata.org/entity/Q5236832", "itemLabel": "David Lunn", "itemDescription": "Bishop of Sheffield (born 1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Lunn", "wikipedia_page": {"main": "David Ramsay Lunn (17 July 1930 – 19 July 2021) was a British Anglican bishop. From 1980 to 1997, he was Bishop of Sheffield in the Church of England.Lunn was born on Tyneside and educated at the Kings School, Tynemouth, where he was head boy in 1947.An Anglo-Catholic, he was opposed to the ordination of women, seeing it as an issue that needed examination at an ecumenical level. During his episcopacy, he oversaw an increase in lay ministry within the diocese, but also increased the number of clergy and improved the diocese's financial position. The period also saw the creation of the Nine O'Clock Service within one of the diocese's churches. Initially this seemed to be a successful attempt to broaden the appeal of the church, but in the end the project collapsed and required strong leadership from Lunn to heal the resulting wounds. Following the Hillsborough Disaster, he implemented the clergy disaster plan to improve the church's response to such disasters in future.In 1997 Lunn was awarded an honorary LL.D. degree by Sheffield University. After retirement, during which he settled at Wetwang, he became an assistant bishop in the Diocese of York in 1991.", "link_mentions": [{"page": "Bishop of Sheffield", "response": ["|align=center|1980 ||align=center|1997 ||David Lunn ||"]}, {"page": "Nine O'Clock Service", "response": ["By 1988, David Lunn, then Bishop of Sheffield, sanctioned a move to a new site at Ponds Forge Rotunda in the centre of Sheffield. Around the same time, Chris Brain underwent training to be ordained as a priest in the Church of England. The Planetary Mass at Pond's Forge was marked by both bold liturgical experimentation and naive hopefulness. The suspended Roman Catholic priest and American Dominican theologian Matthew Fox was consulted."]}, {"page": "Simon Bailey (priest)", "response": ["Simon Bailey's first experience of pastoral work was as a curate in the parish of Norton, Sheffield, where he stayed four years. Unusually, he chose to live not in the more middle-class suburb of Norton itself, but on a rough part of a council estate on the edge of the parish. In an article he wrote for The Guardian, he humorously described this experience.Bailey, Simon; The Guardian (19 Apr 1986), p. 20. The then Bishop of Sheffield, David Lunn, put it in stronger terms:"]}, {"page": "David Thomson (bishop)", "response": ["Thomson was made a deacon at Petertide 1981 (28 June) and ordained a priest the Petertide following (27 June 1982) – both times by David Lunn, Bishop of Sheffield, at Sheffield Cathedral. He served as assistant curate in the Maltby, South Yorkshire team ministry (1981–1984), and then Team Vicar of St Mary's Church, Banbury (1984–1994), Team Rector of Cockermouth (1994–2002) and finally, before being ordained to the episcopate, the Archdeacon of Carlisle and a canon residentiary of Carlisle Cathedral (2002–2008)."]}, {"page": "David Walker (bishop of Manchester)", "response": ["Walker was ordained in the Church of England: made a deacon at Petertide 1983 (3 July) and ordained a priest the Petertide following (1 July 1984), both times by David Lunn, Bishop of Sheffield, at Sheffield Cathedral. Walker's ordained ministry began as a curate at St Mary Handsworth, after which he was a team vicar at Maltby, then Bramley before ordination to the episcopate."]}, {"page": "David Ramsay Lunn", "response": ["#REDIRECT David Lunn"]}, {"page": "Alistair Magowan", "response": ["Magowan was made a deacon at Petertide 1981 (28 June) and ordained a priest the Petertide following (27 June 1982) — both times by David Lunn, Bishop of Sheffield. His first ministerial role (title post) was as assistant curate of St John the Baptist Owlerton, Sheffield (1981–1984), followed by a second curacy, at St Nicholas', Durham (1984–1989). He remained in Durham as chaplain to St Aidan's College (1984–1989), then moved to Surrey, where he served as vicar of St John's, Egham (1989–2000); while at Egham he was also Rural Dean of Runnymede (1993–1998) and chair of the Guildford Diocesan Board of Education (1995–2000)."]}, {"page": "Lincoln Theological College", "response": ["* David Lunn from 1966–70 - later Bishop of Sheffield"]}, {"page": "Lunn", "response": ["* David Lunn (born 1930), English bishop", "* David Lunn-Rockliffe (1924–2011), British businessman"]}, {"page": "Martyn Snow", "response": ["Snow was made a deacon at Petertide 1995 (2 July) by David Lunn, Bishop of Sheffield, at Sheffield Cathedral and ordained a priest the Petertide following (5 July 1996) by Michael Gear, Bishop of Doncaster at his title church (St Andrew's, Brinsworth). He was an assistant curate at Brinsworth with Catcliffe and Treeton before service with the Church Mission Society in Guinea. He was vicar of Christ Church, Pitsmoor from 2001 to 2010 and area dean of Ecclesfield from 2007."]}, {"page": "John Thomson (bishop)", "response": ["He was made a deacon at Michaelmas 1985 (29 September) and ordained a priest the Petertide following (29 June 1986), both times by David Lunn, Bishop of Sheffield, at Sheffield Cathedral."]}, {"page": "Cowick Hall", "response": ["To that Shaw added a two-storey, red-brick dower house in 1870. Shaw died suddenly in 1871, leaving the house to his brother Benjamin, who lived at Cowick Hall until 1889. Benjamin Shaw remodelled the interior of the main house, and during this process \"destroyed much of the splendour of the house,\" according to  the Bishop of Sheffield David Lunn, who wrote a history of the surrounding area."]}, {"page": "Lunn, David", "response": ["#redirectDavid Lunn"]}, {"page": "Deaths in July 2021", "response": ["*David Lunn, 91, British bishop, Bishop of Sheffield (1980–1997).The Passing Of The Rt Revd David Lunn"]}]}}