{"wiki_id": "http://www.wikidata.org/entity/Q5239742", "itemLabel": "David Shilling", "itemDescription": "British fashion designer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Shilling", "wikipedia_page": {"main": "David Shilling (born 27 June 1949) is a self-taught creative artist, English milliner, sculptor, fashion and interior designer. He is best known for designing extravagant hats and clothing displayed on Ladies' Day at Royal Ascot He is known as \"The Hatman” and \"the Mad Hatter.”  He is currently a Prospective Private Astronaut.", "link_mentions": [{"page": "Monte Carlo", "response": ["*David Shilling (milliner) "]}, {"page": "Hatmaking", "response": ["* David Shilling is a renowned milliner, artist and designer based in Monaco."]}, {"page": "Hat", "response": ["One of the most famous London hatters is James Lock & Co. of St James's Street.See Whitbourn, F.: 'Mr Lock of St James's St Heinemann, 1971. The shop claims to be the oldest operating hat shop in the world.Centuries of hats Another was Sharp & Davis of 6 Fish Street Hill.For an account of the Sharp family's hat-making business, see Knapman, D. – 'Conversation Sharp – The Biography of a London Gentleman, Richard Sharp (1759–1835), in Letters, Prose and Verse'. [Private Publication, 2004]. British Library. In the late 20th century, museums credited London-based David Shilling with reinventing hats worldwide. Notable Belgian hat designers are Elvis Pompilio and Fabienne Delvigne (Royal warrant of appointment holder), whose hats are worn by European royals. Philip Treacy OBE is an Irish milliner whose hats have been commissioned by top designers and worn at royal weddings.Philip Treacy: King of Royal wedding hats Irish Independent, 2011-04-29 In North America, the well-known cowboy-hat manufacturer Stetson made the headgear for the Royal Canadian Mounted Police and the Texas Rangers. John Cavanagh was one of the notable American hatters. Italian hat maker Borsalino has covered the heads of Hollywood stars and the world's rich and famous.Hats and Headwear around the World: A Cultural Encyclopedia:, Beverly Chico, ABC-CLIO, 03.10.2013, P. 155"]}, {"page": "List of fashion designers", "response": ["* David Shilling"]}, {"page": "Shilling (disambiguation)", "response": ["* David Shilling (born 1949), British artist and designer"]}, {"page": "The Crowd (band)", "response": ["The band and celebrity members included: Sir Bruce Forsyth, Denny Laine, Jim Diamond, Tony Christie, Rick Wakeman, John Conteh, The Barron Knights, Jess Conrad, Kiki Dee, the Foxes, Rolf Harris, Graham Gouldman, Kenny Lynch, Rick Wild of The Overlanders, Keith Chegwin, Tony Hicks, Colin Blunstone, Tim Hinkley, Johnny Logan, Zak Starkey, Girlschool, Black Lace, John Otway, Gary Holton, Peter Cook, the Nolans, John Entwistle of The Who, Motörhead, Dave Lee Travis, Graham Dene, Ed Stewart, Phil Lynott, Smokie, Joe Fagin, Eddie Hardin, Gerard Kenny, Tim Healy, John Verity, Rose Marie, David Shilling, Chris Norman, Bernie Winters, Robert Heaton, and Frank Allen of The Searchers."]}, {"page": "List of Old Paulines", "response": ["*David Shilling (born 1956); hat designer"]}, {"page": "Deep Blue Sea (hat)", "response": ["Deep Blue Sea drew media attention for its extravagance and for its high value both as a hat and as wearable precious opal. In so doing it joined the ranks of the world's most expensive hats, alongside works such as Louis Mariette's platinum-and-diamond ‘Chapeau d’Amour’,Chapeau d’amour – platinum and diamond hat http://www.louismariette.co.uk/hatsgallery/large/hat005.jpg Retrieved 4 November 2010‘World’s most expensive hats’, Jeremy, The Most Expensive Journal, 29 September 2010 http://most-expensive.net/hat Retrieved 4 November 2010 David Shilling's diamond, pearl and ruby encrusted hat formerly recognised by the Guinness Book of World Records as the most expensive hat ever,‘David Shilling – from Ascot to Monaco’, Michelle Nevard, Coutts Woman, May 2008 http://www.couttswoman.com/2008/may/features/david-shilling.asp  Retrieved 4 November 2010 and Brent Black's ‘The Hat’,‘The Hat by Brent Black; the world’s most expensive Montecristi Panama hat’, Men-Access http://www.men-access.com/the-hat-by-brent-black-the-worlds-most-expensive-montecristi-panama-hat/ Retrieved 4 November 2010 woven by Simon Espinal."]}, {"page": "Action on Addiction", "response": ["Celebrity supporters of the charity (and of the founding charities) from television, music and fashion at various times have included: Bryan Adams, Eric Clapton, Sir David Frost, Joanna Lumley, Emilia Fox, Patsy Palmer, Roger Black, Edward Fox, Tania Bryer, Siân Lloyd, Trinny Woodall, Susannah Constantine, Laura Bailey, Tamara Beckwith, Sophie Anderton, Caprice Bourret, Lucy Ferry, and David Shilling.BDO Stoy Hayward, Chartered Accountants, Epsom, UK (Audited August 24, 2000). Action on Addiction Annual Review 1999–2000. Patrons. p2.BDO Stoy Hayward, Chartered Accountants, Epsom, UK (Audited January 20, 2003). Action on Addiction Annual Review 2001–2002. Patrons. p2.BDO Stoy Hayward, Chartered Accountants, Epsom, UK (Audited August 28, 2003). Action on Addiction Annual Review 2002-2003. Patrons. p2.Haysmacintyre, Chartered Accountants, London, UK (Audited June 15, 2004). Action on Addiction Annual Review 2003-2004. Patrons. p2.Haysmacintyre, Chartered Accountants, London, UK (Audited June 15, 2005). Action on Addiction Annual Review 2004-2005. Patrons. p2.Haysmacintyre, Chartered Accountants, London, UK (Audited May 15, 2007). Action on Addiction Annual Review 2006-2007. Patrons. p2."]}, {"page": "Gertrude Shilling", "response": ["#REDIRECTDavid Shilling"]}, {"page": "List of people named David", "response": ["*David Shilling (born 1949), English sculptor", "*David Shillinglaw (born 1982), British artist", "*David Shillington (born 1983), Australian rugby union footballer"]}, {"page": "Shilling, David", "response": ["#redirectDavid Shilling"]}]}}