{"wiki_id": "http://www.wikidata.org/entity/Q5233727", "itemLabel": "David Forbes", "itemDescription": "Manx scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Forbes_(mineralogist)", "wikipedia_page": {"main": "David Forbes FRS (6 September 1828 – 5 December 1876) was a Manx mineralogist, metallurgist, and chemist.", "link_mentions": [{"page": "Kensal Green Cemetery", "response": ["*David Forbes FRS (1858), mineralogist"]}, {"page": "List of mineralogists", "response": ["*David Forbes (1828–1876)"]}, {"page": "Manchester Museum", "response": ["The geological collections are of more than local importance and consist of more than 9,000 mineralogical specimens and several hundred thousand fossils. Approximately one twentieth of the collection is displayed and the remainder in storage but available for study by interested persons. Much of the collecting was done in the second half of the 19th century and among the collections are the David Homfray collection from the Cambrian and Ordovician strata of Wales and the collections of George H. Hickling and D. M. S. Watson from the Silurian of the Dudley district, West Midlands and from the Old Red Sandstone. Other specimens include the fossilised plants of the Coal Measures, the S. S. Buckman collection of ammonites, an ichthyosaur from Whitby and 40,000 mammalian bones from an excavation at Creswell Crags, Derbyshire and the David Forbes World Collection of minerals. Since the 1920s there has been a policy of complementary collecting by the museum and the university Department of Geology by which the museum specialises in hard rock petrology.The Manchester Museum. Derby: English Life, 1985; pp. 14–15"]}, {"page": "David Forbes", "response": ["David Forbes may refer to:", "*David Forbes (British Army officer) (1777?–1849), Scottish soldier", "*David Forbes (mineralogist) (1828–1876), British mineralogist", "*David Forbes, singer for Canadian band Boulevard", "*David Forbes (sailor) (born 1934), Australian Olympic sailor", "*David Forbes (politician) (born 1956),  Canadian provincial politician", "*David Forbes Hendry (born 1944), British economist", "*David Forbes Martyn (1906–1970), Scottish-Australian physicist"]}, {"page": "David Forbes (British Mineralogist)", "response": ["#REDIRECT David Forbes (mineralogist)"]}, {"page": "Oplosaurus", "response": ["In 1852 geologist Thomas Wright reported the find of a large reptilian tooth from the Wealden Clay near Brixton Bay on Wight. Wright had presented the find to several experts, among them Richard Owen, David Forbes, George Robert Waterhouse and Samuel Pickworth Woodward but only Gideon Mantell came with a useful suggestion pointing to a similarity with the teeth of the dinosaur Hylaeosaurus. Not convinced by this, Wright concluded that the tooth, in view of its sharpness, belonged to a carnivorous reptile of unknown affinities.Wright, T. (1852). Contributions to the palaeontology of the Isle of Wight. Annals and Magazine of Natural History 2:87-93."]}, {"page": "David Forbes (rocks)", "response": ["#REDIRECT David Forbes (mineralogist)"]}, {"page": "List of fellows of the Royal Society D, E, F", "response": ["| David Forbes||03/06/1858||6 September 1828 – 5 December 1876", "| James David Forbes||09/06/1832||20 April 1809 – 31 December 1868"]}, {"page": "John Percy (metallurgist)", "response": ["Local industry excited his interest in metallurgy. In 1846 he worked with David Forbes and William Hallowes Miller on crystallised slags. In 1847 he became a Fellow of the Royal Society, and served on the council from 1857 to 1859. In 1851 he was elected Fellow of the Geological Society, and was appointed lecturer on metallurgy at the newly founded Metropolitan School of Science in London, under Sir Henry Thomas de la Beche; the post was later made a professorship. Percy exerted influence, while holding this position, on metallurgy as a discipline, and through his pupils. The silver process was the only metallurgical one he actually invented, but his work suggested others; and the Gilchrist-Thomas process for making Bessemer steel from iron ores containing phosphorus was an outcome of his work, and was discovered by pupils."]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* David Forbes FRS (1828–1876)"]}]}}