{"wiki_id": "http://www.wikidata.org/entity/Q5232104", "itemLabel": "David Calvert", "itemDescription": "Northern Irish politician (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Calvert", "wikipedia_page": {"main": "David Calvert (born 1946) is a Unionist politician in Northern Ireland. He worked as a director of a family shirt manufacturing company. He was a founder member of the Democratic Unionist Party (DUP) in County Armagh.He was elected to Craigavon Borough Council in 1973, and held his seat until he stood down in 1989.He stood for the party in Fermanagh and South Tyrone at the Northern Ireland Constitutional Convention election in 1975, but was not elected.He then moved to Armagh, which he contested at the 1979 UK general election, but took only 8.6% of the vote.In the early 1980s, Calvert was Deputy Chairman of the DUP, and in the 1982 Northern Ireland Assembly election, he won a seat.  In 1987, he was seriously injured in an assassination attempt on his life by the Irish National Liberation Army, but recovered fully. The INLA had also tried to kill him in 1981. He fell out with the DUP in 1993, in a dispute over candidate selection, and was expelled from the party.Calvert stood as an independent candidate in Craigavon at the 2001 local elections, and narrowly missed taking a seat. He stood again in 2005, without success.  \nIn 2006, he attended a meeting of critics of the Belfast Agreement, addressed by Robert McCartney of the UK Unionist Party, but at the 2007 Assembly election he stood as an independent again, this time in Upper Bann, taking 3.1% of the vote.Following the elections, Calvert joined Traditional Unionist Voice, and stood for the party in a by-election to Craigavon Borough Council in January 2010, taking a distant second place.", "link_mentions": [{"page": "Craigavon Borough Council", "response": ["|David Calvert", "|David Calvert"]}, {"page": "Members of the 1982 Northern Ireland Assembly", "response": ["|David Calvert", "|David Calvert"]}, {"page": "Fermanagh and South Tyrone (Assembly constituency)", "response": ["Note: Ernie Baird, David Calvert, John McKay and Harry West were all UUUC-endorsed candidates."]}, {"page": "Armagh (Assembly constituency)", "response": ["| rowspan=2|David Calvert(DUP)"]}, {"page": "Calvert (name)", "response": ["* David Calvert, unionist politician in Northern Ireland"]}, {"page": "2005 Northern Ireland local elections", "response": ["| align=\"right\" |David Calvert"]}, {"page": "2001 Northern Ireland local elections", "response": ["| align=\"right\" |David Calvert"]}, {"page": "1985 Northern Ireland local elections", "response": ["| align=\"right\" |David Calvert"]}, {"page": "1981 Northern Ireland local elections", "response": ["| align=\"right\" |David Calvert"]}, {"page": "1977 Northern Ireland local elections", "response": ["| align=\"right\" |David Calvert"]}, {"page": "Timeline of Irish National Liberation Army actions", "response": ["* 3 January: the INLA tried to assassinate Unionist politician David Calvert at his home in Lurgan, County Armagh. A gunman allegedly armed with a silenced pistol appeared at his front door 20 minutes after a phone call claiming to be from a constituent.The Belfast Telegraph, 19 September 1983.", "* 8 January: the INLA claimed responsibility for shooting and wounding Unionist politician David Calvert as he got into his car outside his business at Craigavon Shopping Centre, County Armagh. His eleven-year-old daughter narrowly escaped injury.Daily Mirror, 10 January 1987."]}, {"page": "Davy Calvert", "response": ["#REDIRECT David Calvert"]}, {"page": "2011 Northern Ireland local elections", "response": ["| align=\"right\" |David Calvert"]}, {"page": "Screen Two", "response": ["Cast: Amanda Burton, Kevin McNally, Michael Legge, Michelle Fairley, James Ellis, Margaret D'Arcy, Cara Kelly, Gavin Kennedy, Derek Halligan, Marc O'Shea, Tim Loane, Gerard Crossan, Andrew Roddy, David Calvert, Trevor Moore, Catherine Brennan, Rosemary McCauley and Catherine Higgins"]}, {"page": "John McKay (Northern Ireland politician)", "response": ["McKay was an Ulster Unionist Party member of the Northern Ireland Constitutional Convention for Fermanagh and South Tyrone.W. D. Flackes & Sydney Elliott, Northern Ireland A Political Directory 1968-1993, Blackstaff Press, 1994, p. 222 McKay had finished seventh overall in the election but was elected thanks to transfers from fellow United Ulster Unionist Council candidate David Calvert, who was not elected to the body despite finishing above McKay on first preferences. The election was determined through the single transferable vote model.Fermanagh and South Tyrone 1973-1982"]}, {"page": "Calvert, David", "response": ["#redirectDavid Calvert"]}]}}