{"wiki_id": "http://www.wikidata.org/entity/Q5235388", "itemLabel": "David J", "itemDescription": "British alternative rock musician, producer, and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_J", "wikipedia_page": {"main": "David John Haskins (born 24 April 1957, Northampton, Northamptonshire, England), better known as David J, is a British alternative rock musician, producer, and writer. He is the bassist for the gothic rock band Bauhaus and for Love and Rockets.\nHe has composed the scores for a number of plays and films, and also wrote and directed his own plays, Silver for Gold (The Odyssey of Edie Sedgwick), in 2008, which was restaged at REDCAT in Los Angeles in 2011, and The Chanteuse and The Devil's Muse in 2011. His artwork has been shown in galleries internationally, and he has been a resident DJ at venues such as the Knitting Factory.\nDavid J has released a number of singles and solo albums, and in 1990 he released one of the first No. 1 hits on the then nascent Modern Rock Tracks charts, with \"I'll Be Your Chauffeur\". His most recent single, \"The Day That David Bowie Died\" entered the UK vinyl singles chart at number 4 in 2016. The track appears on his latest double album, Vagabond Songs.", "link_mentions": [{"page": "Bela Lugosi", "response": ["In 1979, a song called \"Bela Lugosi's Dead\" was released by UK post-punk band Bauhaus and is widely considered to be a pioneering song in the Goth music genre. On choosing the topic of the song, the band's bassist David J remarked \"It’s so weird you should say that, because I’ve got this lyric about Bela Lugosi, the actor who played a vampire.” There was a season of old horror films on TV and I was telling Daniel about how much I loved them. The one that had been on the night before was Dracula [1931]. I was saying how Bela Lugosi was the quintessential Dracula, the elegant depiction of the character.\""]}, {"page": "Marilyn Manson (band)", "response": ["During their period at Nothing Records, the band's sound gathered sonic elements from other outfits on that label's roster, particularly Nine Inch Nails, with Reznor co-producing their first two studio albums. Manson has cited Queen as an influence on the band's more melodic work, while new wave and synthpop acts such as Depeche Mode and Gary Numan have been noted as influencing their electronic material. Manson said of the latter, \"I was always into his apocalyptic fiction lyrics. He pioneered electronic dance music.\" The work of gothic rock acts such as The Cure and Bauhaus has also been cited, with Twiggy saying that \"as far as guitar and bass combinations go\", Bauhaus's Daniel Ash and David J were \"a really big influence\". Manson's other influences include the Beatles, Rihanna, White Zombie, Johnny Cash, Jimi Hendrix, N.W.A, The Smashing Pumpkins, Justin Timberlake, Led Zeppelin, the occult, horror comics, and the King James Bible."]}, {"page": "1957", "response": ["** David J, British musician, producer, and writer"]}, {"page": "Bauhaus (band)", "response": ["Bauhaus are an English rock band, formed in Northampton, England, in 1978. The group consists of Daniel Ash (guitar, saxophone), Peter Murphy (vocals, occasional instruments), Kevin Haskins (drums) and David J (bass). The band was originally named Bauhaus 1919 in reference to the first operating year of the German art school Bauhaus, although they shortened the name within a year of formation. One of the pioneers of gothic rock, Bauhaus were known for their dark image and gloomy sound, although they mixed many genres, including dub, glam rock, psychedelia, and funk. ", "After Bauhaus' breakup, Murphy formed Dalis Car with Japan's bassist Mick Karn before beginning a solo career later on, while Ash and Haskins continued as Tones on Tail and, later, reunited with David J to form Love and Rockets. Both enjoyed greater commercial success in the United States than Bauhaus had, but disappeared from the charts in their homeland. Bauhaus eventually reunited for a 1998 tour, again from 2005 to 2008, and once again in 2019.", "Daniel Ash, his friend David J. Haskins, and Haskins' younger brother Kevin, had played together in various bands since childhood. Ash initially tried to convince his school friend Peter Murphy to be in a band, but nothing came out of it. According to Ash: \"Pete didn’t think about it at all, it wasn’t on his mind as such.\" One of the longer-lived of these was a band called the Craze, which performed a few times around Northampton in 1978. However, The Craze still split up fairly quickly, and Ash once again tried to convince his old school friend Murphy to join him, simply because Ash thought he had the right look for a band. Murphy, who was working in a printing factory, decided to give it a try, despite never having written any lyrics or music. During their first rehearsal, he co-wrote the song \"In the Flat Field\".", "Ash's old bandmate Kevin Haskins joined as the drummer. Ash made a point of not inviting David J, the driving force in their previous bands, because he wanted a band he could control. Instead, Chris Barber was brought in to play bass, and together the four musicians formed the band S.R. However, within a few weeks Ash relented, and replaced Barber with David J, who suggested the new name Bauhaus 1919. David J. had already agreed to tour American airbases with another band, but decided that joining his friends' group was \"the right thing to do\". With their lineup complete, the band played their first gig at the Cromwell pub in Wellingborough on New Year's Eve 1978.", "The band had chosen the name Bauhaus 1919, a reference to the German Bauhaus art movement of the 1920s, because of its \"stylistic implications and associations\", according to David J. The band also chose the same typeface used on the Bauhaus college building in Dessau, Germany, as well as the Bauhaus emblem, designed by Oskar Schlemmer. Bauhaus associate Graham Bentley said that the group was unlike any Northampton band of the time, most of which played predominantly cover songs. Bentley videotaped a performance by the group, which was sent to several record labels, in the hope of obtaining a contract. This approach was hindered partly because many record companies at the time did not have home video equipment, so the group decided to record a demo.", "Prior to the recording of their fourth album, Burning from the Inside (1983), Murphy was stricken with pneumonia, which prevented him from contributing much to the album. Ash and David J took the reins, becoming the driving forces behind the record and even performing lead vocals on several tracks. The album's lead single, \"She's in Parties\", reached No. 26 on the charts and earned Bauhaus their third and final Top of the Pops appearance. Bauhaus then embarked on an international promotional tour for the album, with dates in Europe and the Far East. David J recalled that the night before they were supposed to perform two shows at Hammersmith Palais in London, the group decided to disband.", "The band played their farewell show on 5 July 1983 at the Hammersmith Palais; dedicated fans had been warned by the band's crew not to miss the show, without telling them it was the last. After a long encore, consisting of some of their early songs, David J left the stage with the words \"rest in peace\". Burning from the Inside was released a week later. The album received largely positive reviews and reached No. 13 on the charts. Bauhaus released the single \"Sanity Assassin\" in limited quantities as a farewell gift for those who joined the group's fan club.", "After Bauhaus disbanded, the members of the band moved on to various solo work. Murphy worked briefly with bassist Mick Karn of Japan in the band Dalis Car, before going solo with such albums as 1986's Should the World Fail to Fall Apart, 1988's Love Hysteria and 1989's Deep. Ash had already started Tones on Tail with Bauhaus roadie Glen Campling as a side project in 1982; after Bauhaus broke up, Kevin Haskins joined the group, and the trio released an album and several EPs before breaking up after a 1984 American tour. During this time, David J released two solo albums and collaborated with other musicians, recording two albums with the Jazz Butcher, and also with comics writer/spoken-word artist Alan Moore in the short-lived band the Sinister Ducks.", "During a discussion about the state of their projects at the time, Ash and David J began talking about reforming Bauhaus. All four band members arranged a rehearsal, but Murphy failed to show up on the scheduled day. The other three band members rehearsed regardless, and were inspired by the chemistry they had as a trio. As a result, Ash and the Haskins brothers formed Love and Rockets in 1985. Love and Rockets scored a US hit four years later with \"So Alive\". The band broke up in 1999 after seven albums. Both Ash and David J released solo albums during the Love and Rockets years; Murphy contributed backing vocals to David J's 1992 single \"Candy on the Cross\".", "In 2008, Bauhaus released their first new studio album since 1983, Go Away White (Cooking Vinyl). It marked the band's end and the album had no promotional tour. In late 2007, Kevin Haskins said \"We were getting along really well, but there was an incident that occurred,\" and added that as a result, \"Some of us just felt that we didn't want to carry on as a working unit.\" In early 2008, Murphy claimed that he \"was most satisfied with the bonding on an emotional level. It was good to be working together and to put the past behind us and it was very positive. The result was coming out really fast, so it was exciting and it was very enjoyable\", but in the end, \"that rocky character worked and I think it was a bit right to finish it, really\". The same year, David J commented on the breakup: \"You have a test tube, and you pour in one chemical, and you pour in another chemical, and something happens. It starts to bubble. Pour in another chemical, and it starts to bubble a bit more. You pour in a fourth chemical, and it bubbles really violently, and then explodes. That's my answer\".", "In 2018, Murphy and David J announced a tour of New Zealand, Australia and Europe to celebrate the 40th anniversary of Bauhaus, with the pair performing In the Flat Field in its entirety.", "According to David J, the bands Bauhaus related to in the post-punk scene were Joy Division, Pere Ubu, Devo, Gang of Four, Cabaret Voltaire, and the Pop Group. Among bands and singers who influenced Bauhaus, they cited Siouxsie and the Banshees, David Bowie, T-Rex, Roxy Music, New York Dolls, Velvet Underground, Iggy Pop and The Stooges, The Sex Pistols, The Clash, The Residents, Captain Beefheart, Suicide, Kraftwerk, Can, Faust, The Beatles, The Rolling Stones, The Who, Bob Dylan, Tom Waits, Serge Gainsbourg, Scott Walker, and Jacques Brel. Specific recordings that were influential on the band include the compilation album Nuggets, the Bits and Pieces single by The Dave Clark Five and the Double Barrel single by Dave and Ansell Collins. In terms of live performances, Bauhaus' stage theatrics, specifically their lighting, was inspired by a Judas Priest concert that Murphy attended with Bauhaus' manager.", "Given their mixture of reggae and punk rock, Murphy said that musically, they were \"more aligned to the Clash than anything else that was going around.\" When asked about the influence of reggae on Bauhaus' music, Murphy stated that it was \"massive. We were listening to toasting music all the time, and David brought in a lot of bass lines that were very lead riffs [...] those bass lines really formed the basis of the music\"\" In particular, dub reggae was highly influential to the band, so far that David J mentioned that their signature song, \"Bela Lugosi's Dead\", was intended as dub. ", "In terms of early influences from childhood, David J said that he was interested in jazz and its musicians such as Miles Davis, Charlie Parker and Thelonious Monk. Peter Murphy cited Doris Day, Simon and Garfunkel, The Beatles, The Everly Brothers and his experiences from Mass in Catholic school as highly influential to his singing. When Daniel Ash was asked about how he developed his playing style and guitar influences, he replied: \"My style of playing comes from a mixture of extreme laziness to learn proper scales/chords and a burning desire to sound original and new. Although I am a huge fan of Hendrix and Mick Ronson, Robert Fripp on Bowie tracks is also fab, and what about Earl Slick!\"", "Bauhaus combined these influences to create a gloomy, earnest and introspective version of post-punk, which appealed to many music fans who felt disillusioned in the wake of punk's collapse. Its crucial elements included Murphy's deep and sonorous voice, Ash's jagged guitar playing and David J's dub-influenced bass. Their sound and gloomy style would eventually come to be known as gothic rock or simply \"goth\".", "\"Bela Lugosi's Dead\", was covered by numerous acts, including Until December (1986), the Electric Hellfire Club (1996), Opera IX (on 2000 album The Black Opera: Symphoniæ Mysteriorum in Laudem Tenebrarum), Sepultura (on 2001 album Nation), Nouvelle Vague (on 2006 album Bande à part), Chris Cornell (2007), Nine Inch Nails (2009), Trent Reznor with Murphy and TV on the Radio (2013), Massive Attack (2013), David J with Jill Tracy (2013), Chvrches (for the 2014 Vampire Academy soundtrack), Dead Cross (on their 2017 debut album) and The Damned (2019).", "Susie Lewis, the co-creator of the American animated series Daria, is a fan of the band and used their song \"1. David Jay 2. Peter Murphy 3. Kevin Haskins 4. Daniel Ash\" in the closing credits of episode 213, \"Write Where it Hurts\".", "* David J – bass, keyboards, percussion, backing vocals"]}, {"page": "Tones on Tail", "response": ["The band disbanded in late 1984, and Ash and Haskins quickly formed Love and Rockets with former Bauhaus bassist David J."]}, {"page": "Dub music", "response": ["The British post-punk band Bauhaus were highly influenced by dub music, so far that Bauhaus' bass player, David J mentioned that their signature song, Bela Lugosi's Dead, \"was our interpretation of dub\".Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "100 Club Punk Special", "response": ["Attendance at the event later become a badge of honour for punk rock fans, but it is probable that a lot of claims were apocryphal. Indeed, a great many people who were later to become involved in the punk scene claimed to have \"been there\" during the two-day festival, but this is unlikely to be true since the venue had only a 600-person capacity. However, amongst the verified known attendees were: Paul Weller of The Jam / The Style Council, Shane MacGowan (later of The Nipple Erectors and The Pogues), Shanne Bradley (of The Nipple Erectors and The Men They Couldn't Hang), Viv Albertine of The Slits, Chrissie Hynde (later of The Pretenders), Vivienne Westwood (McLaren's then partner and co-manager of the Chelsea boutique Sex), Kevin Haskins and his brother David J (later of Bauhaus (band)), Gaye Advert and T. V. Smith (later of The Adverts), as well as members of the Bromley Contingent, the punk fashion avant-garde, Andrew Czezowski (Ex manager of The Damned) and Susan Carrington who went on to start The Roxy with Barry Jones. Czezowski and Carrington also introduced Steve Strange and Rusty Egan to the Blitz which started the New Romantic Movement. Czezowski and Carrington later opened The Fridge an iconic club of the eighties and nineties in Brixton."]}, {"page": "Daniel Ash", "response": ["After going to concerts in his teenage years, Ash decided to perform on a stage in some way. He started playing guitar around the age of 15, but confessed to having been very lazy and learning only three chords, and nothing more, for about three years. He began playing in cover bands, often together with future band mates David J and Kevin Haskins, whom he had known since nursery school. His first gig was in the Glasgow Rangers Workman's Club.", "After nearly five years of recording and performing, Bauhaus broke up and Ash put together Tones on Tail with Bauhaus drummer Kevin Haskins. As Ash described them: \"We were a motley crew of individuals who essentially wanted to sound like a band from Venus or Mars!\"  In 1984, Tones on Tail was disbanded; Ash founded Love and Rockets in 1985 with Haskins and David J, also of Bauhaus. In an interview in June 2009, Ash emphatically stated that he had no further plans to play with Love and Rockets."]}, {"page": "Kevin Haskins", "response": ["As a child, Kevin Haskins banged on flowerpots and kitchen pots and pans.Haskins, Kevin VH1 artist biography He eventually moved to bongos and then to drums.  It wasn't until Haskins attended a Sex Pistols gig, that he and his brother David J formed a band called the Submerged Tenth. The band was short-lived, but Haskins and J collaborated again in another band which featured guitarist Daniel Ash.", "In 1978, Haskins joined Bauhaus 1919, which consisted of vocalist Peter Murphy, J and Ash.Haskins MP3Bio 5 Jan 2000  The band chose the name Bauhaus 1919, a reference to the German Bauhaus art movement of the 1920s, because of its \"stylistic implications and associations\", according to David J.Shirley, p. 21 The band also chose to use the same typeface used on the Bauhaus college building in Dessau, Germany. Although there were bands before them that pre-figured the style, Bauhaus is generally agreed to have been the first gothic rock group.", "When Daniel Ash pursued his first side project Tones on Tail with bassist Glenn Campling, he asked Haskins to play drums. He again utilized Kevin for his next band Love and Rockets which also featured David J. Despite their previous band's Goth status, Love and Rockets moved away from that genre. Their first release, Seventh Dream of Teenage Heaven (1985), leaned more towards psychedelic music. In 1987, Earth, Sun, Moon had a folkier sound and spawned the minor hit \"No New Tale to Tell\"."]}, {"page": "Cabaret Voltaire (band)", "response": ["New Order lead singer and guitarist, Bernard Sumner, said that Cabaret Voltaire influenced his songwriting, having helped him understand that one \"could make music without guitars\". In Alan Cross's 2012 biography of Skinny Puppy, Cabaret Voltaire's \"industrial-grade thumping and noise terrorism\" was cited as an influence on the band. Others who have cited Cabaret Voltaire as an influence include Horrid Red, Fluke and Front Line Assembly. Depeche Mode's Martin Gore once listed Cabaret Voltaire among his favourite bands. David J of Bauhaus named the group as one of the \"few bands on the [post-punk] scene at the time to whom we related\"."]}, {"page": "Love and Rockets (band)", "response": ["Love and Rockets were an English alternative rock band formed in 1985 by former Bauhaus members Daniel Ash (vocals, guitar and saxophone), David J (bass guitar and vocals) and Kevin Haskins (drums and synthesisers) after that group split in 1983. Ash and Haskins had recorded and performed in another band, Tones on Tail, between 1982 and 1984. Love and Rockets' fusion of underground rock music with elements of pop music provided an early catalyst for alternative rock. They released seven studio albums before breaking up in 1999 and reformed briefly in 2007 for a few live shows, before splitting again in 2009."]}, {"page": "4AD", "response": ["* Rene Halkett & David J"]}, {"page": "Shepard Fairey", "response": ["In 2004, Fairey joined artists Robbie Conal and Mear One to create a series of \"anti-war, anti-Bush\" posters for a street art campaign called \"Be the Revolution\" for the art collective \"Post Gen\". \"Be the Revolution\" kicked off with a night of performances featuring Z-Trip, Ozomatli and David J at the Avalon in Hollywood. Fairey also co-founded Swindle Magazine along with Roger Gastman."]}, {"page": "The Dandy Warhols", "response": ["This Machine was released on April 24, 2012. The album featured a collaboration with David J on the track \"Autumn Carnival\". It was seen as a more musically stripped-back and reserved album in comparison to their previous records."]}, {"page": "The Pop Group", "response": ["David J of Bauhaus named the group as one of the \"few bands on the [post-punk] scene at the time to whom we related\"."]}, {"page": "Trigger Happy TV", "response": ["14. David J - Stop This City (Episode 1)"]}, {"page": "Winston Tong", "response": ["* The Unperceived Image (ltd. 7-inch with David J) 2007"]}, {"page": "Clock DVA", "response": ["Newton had previously worked with members of Cabaret Voltaire in a collective called The Studs and with Ian Craig Marsh and Martyn Ware in a band called The Future. He formed the first lineup of Clock DVA in 1978 with Judd Turner (bass), David J. Hammond (guitar), Roger Quail (drums) and Charlie Collins (saxophone, clarinet) (born 26 September 1952, Sheffield).", "Paul Widger joined on guitar. The LP Thirst, released on Fetish Records, followed in 1981 to a favourable critical reaction, knocking Adam and the Ants' Dirk Wears White Sox from the top of the NME Indie Charts, by which time the band had combined musique concrète techniques with standard rock instrumentation. \"4 Hours\", the single from Thirst, was later covered by former Bauhaus bassist David J on his 1985 solo EP Blue Moods Turning Tail."]}, {"page": "Good God's Urge", "response": ["In addition to Watt, many guest musicians lent their musical talents to various songs. \"Porpoise Head\" featured Daniel Ash, David J and Kevin Haskins from Bauhaus, Love and Rockets and the Bubblemen. Good God's Urge also marked a reunion of ex-Jane's Addiction guitarist Dave Navarro, who played guitar on the album track \"Freeway.\" The song also featured Navarro's Red Hot Chili Peppers bandmate, Flea.", "* David J: Bass (1)"]}, {"page": "The Jazz Butcher", "response": ["The band was formed in Oxford in 1982 by Pat Fish and Max Eider.Strong, Martin C. (2003) The Great Indie Discography, Canongate, , p. 381-2 The début album in Bath of Bacon was released by Glass Records in 1983. A second album A Scandal in Bohemia, also on Glass, featured guest appearances from David J and Kevin Haskins of Bauhaus. After four albums, and two singles collections for Glass, Fish signed to Creation Records in 1988, releasing eight albums on the label, culminating in 1995's Illuminate."]}, {"page": "Ramzi Abed", "response": ["His early short film The Tunnel was screened at numerous film festivals all over the world, including the Deep Ellum and Tromadance film festivals in 2001 and 2002 respectively.http://www.filmthreat.com/index.php?section=interviews&Id=337 Film Threat interview Abed's projects include Upside Downtown, starring Masuimi Max, and The Devil's Muse, based on the unsolved murder of Elizabeth Short known as the \"Black Dahlia murder\". The Devil's Muse marked his first collaboration with David J, who created the original score and soundtrack for the film.Premonition The Devil's Muse was released digitally by Cinetic Media and theatrically and on DVD by HALO 8 Entertainment.Halo 8   His English- and Hebrew-language feature film In A Spiral State was released theatrically and on DVD through HALO 8 on September 29, 2009.Fangoria His documentary on avant-garde erotica, The New Erotic was originally slated to be released in the summer of 2011.The Hollywood Reporter Also in the works is the feature film Noirland, which stars James Duval and Twink Caplan. The film wrapped production in 2010, and is preparing for a theatrical premiere in 2014.Director Ramzi Abed Takes Us to Noirland "]}, {"page": "List of bass guitarists", "response": ["* David J (Bauhaus)"]}, {"page": "Mia Doi Todd", "response": ["* David J - \"Good to Be Loved\" from Mess Up (2002)"]}, {"page": "Situation Two", "response": ["During its 11-year history, Situation Two came to prominence as the home for a varied number of indie favourites. These included Madchester band the Charlatans, early incarnations of the Cult, Bauhaus side project Tones on Tail, the solo work of former Bauhaus member David J, and cult bands like the Associates, Fields of the Nephilim, Thee Hypnotics, Gene Loves Jezebel, Play Dead, Red Lorry Yellow Lorry and Buffalo Tom.", "* David J - Etiquette of Violence (SITU 8)", "* David J - \"Joe Orton's Wedding\" (SIT 26)"]}, {"page": "Toxic (song)", "response": ["American singer-songwriter Ingrid Michaelson covered \"Toxic\" regularly on her 2010 Everybody Tour. Michaelson's version ends with her and the band doing a dance break set to Spears's original song. American pop band Selena Gomez & the Scene performed a tribute to Spears during their 2011 We Own the Night Tour. The medley of hits included \"...Baby One More Time\", \"(You Drive Me) Crazy\", \"Oops!... I Did It Again\", \"I'm a Slave 4 U\" and \"Toxic\", mixed similar to the Chris Cox Megamix included in Greatest Hits: My Prerogative. They also performed a cover of \"Hold It Against Me\". During her debut on U.S. TV singing show The Voice, American singer Melanie Martinez sang \"Toxic\" playing an acoustic guitar and a tambourine with her foot. Three of the judges, Adam Levine, CeeLo Green, and Blake Shelton, hit the \"I Want You\" button for her. In 2014 David J covered Toxic featuring Sasha Grey.David J (April 15, 2014). , covering Britney Spears. On December 2, 2016, Madonna covered the song during a live concert broadcast through Facebook Live. Toxic was included on the 2017 \"Spoil + Destroy\" album (Dirtnap Records ZZZ-151) by Milwaukee punk band Fox Face."]}, {"page": "Bela Lugosi's Dead", "response": ["Four additional songs were also recorded during the same session: \"Boys\"; \"Bite My Hip\"; \"Some Faces\" and the ska-reggae tune \"Harry\", which was about Deborah Harry, the lead singer of Blondie. Regarding this session, Kevin Haskins said, \"There’s power pop in there, and ska too. We were trying to find our voice.\"“Big Ups: Bauhaus’ Kevin Haskins Dompe and David J Haskins Pick Their Bandcamp Favorites“. Bandcamp.com. Retrieved 2 November 2019", "* Bauhaus bassist David J, in collaboration with Jill Tracy, released \"Bela Lugosi's Dead (Undead Is Forever)\" on 31 October 2013."]}, {"page": "Spahn Ranch (band)", "response": ["Spahn Ranch continued to release albums throughout the late 1990s. Architecture, released in 1997, featured contributions from Killing Joke/Prong bassist Paul Raven and Rockats/Nancy Sinatra guitarist Danny B. Harvey. This album took an even more experimental approach to the Spahn Ranch sound, incorporating elements of drum and bass, dub and for the first time, live guitar parts. Beat Noir, in 1998, followed a similar path even further and included work with Bauhaus/Love & Rockets bassist David J. The compilation Anthology 1992-1994 was released in 2000 and contained the band's first four releases in addition to previously unreleased material."]}, {"page": "Mount Sims", "response": ["Mount Sims' second album \"Wild Light\" (Released in 2005 on International DeeJay Gigolo Records) is a much darker album than the previous release. Its themes are death and information. Major musical influences are dark wave and post-punk. David J of Bauhaus played bass on some of Wild Light's songs. Roger Joseph Manning, Jr. was responsible for some of the synth production. It contains the songs \"No Yellow lines,\" \"Lights on,\" and \"Restless,\" a single featured in Amped 3."]}, {"page": "David Haskins", "response": ["#REDIRECT David J"]}, {"page": "Panoptica", "response": ["Roberto A. Mendoza, known as Panoptica, has been one of the figures in the Mexican electronic scene since the late 80s, founding bands like electro pos-industrial outfit Artefakto and in the late 1990s being part of the Tijuana-based norteña-meets-techno Nortec Collective. He has also been releasing tracks as Panóptica and it was under this name that English DJ John Peel took notice, inviting him to do one of his Peel sessions for the BBC in 2001. In 2005 Roberto had embarked on finishing two projects, one called \"Desierto\" and the other \"Mendoza\", where friends like David J. (Bauhaus, Love and Rockets) lend a hand on bass and guitars. In late 2007 he separated from the Nortec Collective and created the \"Nortec Panoptica Orchestra\" a band for his live shows. In early 2008 Roberto decided to record a new solo album to push and further develop the electronic sound, working independently from the Tijuana collective and with new musical partners Zoell Farrujia (Ambiente), Benjamin Rivera (Grupo de Acero), Edgar Hernandez (Banda Aguacaliente), Adrian Rodriguez (Koñorteño), and special guests: Javiera Mena, Khan Oral, Yerba Buena. The album was set to be released in March 2010 in Vinyl LP and digital form"]}, {"page": "Johnny Dowd", "response": ["*Soundtrack The Devil's Muse collaboration with David J Soundtrack included on Deluxe 2-Disc DVD Set (Halo 8, 2008)"]}, {"page": "Linda Strawberry", "response": ["*2016: \"Gentrification Blues\" - David J - Production, Editing, Direction, VFX"]}, {"page": "Paris 1919 (album)", "response": ["Songs from Paris 1919 have been covered by such notable musicians as Yo La Tengo, Manic Street Preachers frontman James Dean Bradfield, Owen Pallett, the Dave Soldier String Quartet, Love and Rockets' David J, Okkervil River, Jay Bennett and Edward Burch, and Sally Timms."]}, {"page": "Bob Mothersbaugh", "response": ["| 2015–2017 || Harvey Beaks || with Ego Plum, Steve Bartek, David J."]}, {"page": "ThouShaltNot", "response": ["ThouShaltNot first signed with ADSR Musicwerks, releasing two albums of new material (a self-titled release and The Holiness of Now) as well as a rarities collection, You'll Wake Up Yesterday.   The Holiness of Now gave them their first minor hit, \"Without Faith,\" and You'll Wake Up Yesterday features their song \"If I Only Were a Goth\"; this song became quite popular and somewhat notorious at their live shows because the band traditionally limits it to the first live show in a new city as well as for its affectionate ridiculing of the gothic subculture.  They were next signed by Dancing Ferret Discs, who have released their 2003 album The White Beyond and their 2006 album Land Dispute, as well as re-issuing The Holiness of Now.  The White Beyond has been their most successful release to date, with \"Cardinal Directions\" and \"Inside of You, In Spite of You\" both receiving extensive club play.  The band has gone on several U.S. tours, sharing the stage with such artists as VNV Nation, The Dresden Dolls, and David J of Bauhaus.  They have also provided remixes for many synthpop and goth acts, including Alphaville, Hungry Lucy, Stromkern, and The Last Dance."]}, {"page": "Mistle Thrush (band)", "response": ["Aerosmith, Black Rebel Motorcycle Club, The Boo Radleys, The Brian Jonestown Massacre, The Candy Butchers, Cranes, Cindytalk, David J, The Fixx, Garbage, Gigolo Aunts, Helium, Ivy, Love and Rockets, Love Spit Love, Lush, Mercury Rev, Morphine, My Own Worst Enemy,  Amanda Palmer, The Push Stars, Rockets burst from the Streetlamps, Seven Mary Three, Slowdive, Sonic Youth, Splashdown, Spiritualized, The Strokes, Jen Trynin, Steve Wynn.A Decade of Decadence, Mike Baldino, The Weekly Dig, July 22, 2003Birds, Fish & Cow's Tongue Macrame , Sean McGonagle, Tim Ruback, Stained Pages, 1996After 18 Years of The Cure, Robert Smith Gets Happy, Jim Sullivan, The Boston Globe, C16, November 28, 1997"]}, {"page": "Jill Tracy", "response": ["She began collaborating and performing with David J (Bauhaus, Love and Rockets) in 2009, releasing two singles in 2010. Accompanying him on piano during live concerts, she developed a post-classical cinematic version of \"Bela Lugosi's Dead,\" and composed a lavish 2-minute solo piano intro which gradually revealed the rhythm of the classic tune as the band joined in. This was released as \"Bela Lugosi's Dead (Undead is Forever)\" by \"David J (with Jill Tracy)\" in 2013.  \"We recorded practically in pitch darkness,\" Jill says of the session, which was captured live in a single take. \"That's why there is such a gorgeous, seductive urgency to the piece: the band could only hear… and feel… and react.\"David J with Jill Tracy: \"Bela Lugosi's Dead\" generationbass.com November 12, 2013. Retrieved July 10, 2019.", "In 2019, she was invited by Bauhaus frontman Peter Murphy to be the opening act for his historical San Francisco and New York City residencies, as well as several of his iconic shows on the Ruby Tour, celebrating 40 Years of Bauhaus (with bassist David J). She got to perform with the band, performing her original piano arrangements on \"Bela Lugosi’s Dead,\" as well as \"Who Killed Mr. Moonlight.\"", "*\"Blood Sucker Blues / Tidal Wave Of Blood\" by David J. + Shok (2010)", "*\"Bela Lugosi's Dead (Undead is Forever)\" with David J. (2013)"]}, {"page": "Time (David Bowie song)", "response": ["* David J's Cabaret Obscura – .2 Contamination: A Tribute to David Bowie (2006)"]}, {"page": "Seventh Dream of Teenage Heaven", "response": ["* David J – vocals, bass guitar, keyboards, electric guitar on \"Saudade\", production, sleeve design"]}, {"page": "Express (album)", "response": ["* David J – bass guitar, vocals"]}, {"page": "Mask (Bauhaus album)", "response": ["* David J – bass guitar, vocals, production"]}, {"page": "Earth, Sun, Moon", "response": ["* David J – bass and vocals"]}, {"page": "Love and Rockets (album)", "response": ["Love and Rockets dismissed Earth, Sun, Moon's folk sound in favour of a stronger rock sound. Hints of the band's former psychedelic and gothic rock sound remain. Chief songwriters Daniel Ash and David J had begun concentrating strictly on their own material (rather than writing together) on Earth, Sun, Moon.", "*David J. - Vocals, Guitars, Bass, Bass Feedback, Harmonica, Keyboards"]}, {"page": "Hot Trip to Heaven", "response": ["The songs on the album are longer and possess a broader tonal range in comparison to the band's previous records. Ash's guitar work on the album has been compared to Robert Fripp and Phil Manzanera, though critic Fay Wolftree felt the shaping of his guitar sound \"owes more to Brian Eno and his bank of analogue synths than any player of stringed instruments.\" David J's bass playing largely leans towards dub, while also running with Haskins' drumming \"to maintain an insistent sense of threat or promise.\" Natacha Atlas, who had worked with earlier in the 1990s, also contributes additional vocals and percussion to the album, which Wolftree feel largely contribute to the album's \"world and ethnic feel,\" feeling Atlas' sporadic singing and warm percussion contrast well with Ash's voice.", "\"This Heaven\" flirts with an alternative house style reminiscent of Stereo MC's with its usage of a distorted rap and arousing samples, while its thrust beat and \"breathy female panting and cooing\" led Wolftree to describe it as \"the nineties answer to Donna Summer's awesome dancefloor hit 'I Feel Love', as the more enlightened club DJs in London have already realised.\" She described the song's style as \"sex trance dub or hardbeat world trance.\" \"No Worries\" features sitar sounds, while \"Voodoo Baby\" features tingling keys and a brooding bassline. \"Be the Revolution\" features wiry and wry vocals from David J and a guitar loop from Louis Metoyer. The title track, which appears halfway through the album, is the first track where Ash uses his signature fuzz bass guitar. Wolfree said of the song: \"More than a little reminiscent of Bolan in Twentieth Century Boy mode plus a twinge of Jim Foetus, it’s still a fuck-off hard dance track.\"", "* David J – bass and vocals, harmonica"]}]}}