{"wiki_id": "http://www.wikidata.org/entity/Q5235620", "itemLabel": "David Jenkins", "itemDescription": "British footballer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Jenkins_(footballer)", "wikipedia_page": {"main": "David John Jenkins (born 2 September 1946) is an English retired professional football forward who played in the Football League, most notably for Arsenal and Tottenham Hotspur.He joined Arsenal as an apprentice in 1963 and showed promise as a talented winger. He made his senior debut in a 2nd round League Cup replay against Gillingham in September 1966 shortly after turning 20. His league debut came against West Ham United in November 1967, when he came on as a sub for George Graham.Jenkins played in the 1968 League Cup final, in which he was injured in a collision with Leeds United goalkeeper, Gary Sprake. However, he did not secure a regular place in the Arsenal side until the following season when he made 14 league appearances, scoring three goals, before being swapped in mid-October for Tottenham's winger, Jimmy Robertson.\nHis final game for Arsenal was against Coventry City on 12 October 1968, when, as it happened, he came off to be replaced by George Graham. He made his debut for Tottenham seven days later against Liverpool.Both Jenkins and Robertson had limited opportunities at their new clubs and moved on after a couple of seasons, Jenkins to Brentford and Robertson to Ipswich Town.", "link_mentions": [{"page": "David Jenkins", "response": ["David Jenkins may refer to:", "* David Jenkins (composer) (1848–1915), Welsh composer", "* David Jenkins (musician) (born 1947), singer for the band Pablo Cruise", "* David Jenkins (television writer), creator of People of Earth", "* David Jenkins, set designer", "* David Jenkins (North Carolina), 18th Century North Carolina politician", "* David Jenkins (Georgia politician), American politician from Georgia", "* David Jenkins (bishop) (1925–2016), of Durham", "* David Jenkins (Archdeacon of Westmorland and Furness) (1929–2014), Anglican priest", "* David Jenkins (archdeacon of Sudbury) (born 1961), Anglican priest", "* David Jenkins (rugby, born 1904) (1904–1951), rugby union and rugby league footballer for Wales", "* David Jenkins (rugby, born 1914) (1914–1979), rugby union and rugby league footballer for Cardiff ", "* David Jenkins (figure skater) (born 1936), American figure skater", "* David Jenkins (footballer) (born 1946), English footballer for Arsenal and Tottenham Hotspur", "* David Jenkins (sprinter) (born 1952), Scottish athlete", "* David Jenkins (Olympic diving coach) (1989-2021), Team Great Britain Olympic diving coach", "* David Jenkins (Royalist) (1582–1663), Welsh judge and Royalist during the English Civil War", "* David Jenkins, Baron Jenkins (1899–1969), British Law Lord", "* David Jenkins (librarian) (1912–2002), Welsh librarian", "* David Jenkins (British Army officer), British Army major general", "* David Jenkins, journalist and editor of GameCentral"]}, {"page": "North London derby", "response": ["|align=left|David Jenkins||MF", "|align=left|David Jenkins"]}, {"page": "1968 Football League Cup Final", "response": ["   David Jenkins "]}, {"page": "Jimmy Robertson (footballer, born 1944)", "response": ["He went on to join Spurs's rivals Arsenal in October 1968, in a straight swap for David Jenkins, making him one of the few players to play for both clubs. Robertson made his debut for Arsenal in a goalless draw against West Ham United  in October 1968. Robertson in all played a total of 19 league matches in the 1968–69 English footballing season. The following 1969–70 season he made a further eight appearances to be capped a total of 27 times at and away from Highbury. Robertson then joined up with Ipswich Town in March 1970 for £50, 000. He is as well one of only two players to score for both sides in the North London derby. In total Robertson played 59 games for Arsenal, scoring eight goals altogether."]}, {"page": "1972–73 Brentford F.C. season", "response": ["Brentford's promotion to the Third Division at the end of the 1971–72 season meant that the club would compete in the third-tier for the first time since 1965–66.White, p. 288-291. Self-imposed financial austerity since the club's relegation to the Fourth Division had enabled the club's large debts to be paid off, but despite promotion and increasing attendances, manager Frank Blunstone would again be forced to maintain a small playing squad. Blunstone turned down the chance to become assistant manager at Everton during the off-season. Released in the wake of the promotion were defender Steven Tom, midfielder Brian Turner and winger Gordon Neilson and in came amateur goalkeeper Paul Priddy, midfielders David Court and Alan Murray, winger David Jenkins and Stewart Houston's loan was turned into a permanent transfer for a £15,000 fee. The Brentford youth team was also reactivated after being disbanded due to the budget cuts of 1967, with Kevin Harding, Richard Poole and Graham Pearce being taken on as apprentices. Gary Huxley would win an England Youth cap during the season.", "|David Jenkins", "| style=\"text-align:left;\" |David Jenkins", "| style=\"text-align:left;\" |David Jenkins", "| David Jenkins", "| David Jenkins"]}, {"page": "1973–74 Brentford F.C. season", "response": ["| David Jenkins"]}]}}