{"wiki_id": "http://www.wikidata.org/entity/Q5234490", "itemLabel": "Gwyn Williams", "itemDescription": "Welsh poet, novelist, translator and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Gwyn_Williams_(writer)", "wikipedia_page": {"main": "Professor David Gwyn Williams, usually known simply as Gwyn Williams (24 August 1904 – 24 December 1990) was a Welsh poet, novelist, translator and academic.Born in Port Talbot, he was educated at the University College of Wales and Jesus College, Oxford. As an academic he taught at Cairo, Alexandria where he first became Professor of English Literature, Benghazi, and Istanbul. While in Egypt he befriended a number of expat writers including Lawrence Durrell. In Egypt he began to work on translations of Welsh poetry into English, pioneering works which were published during the 1950s. On his retirement in 1969 he returned to Wales and concentrated on writing, producing a series of novels, four travel books (including one in Welsh), and numerous other works. A fluent Welsh-speaker, he was a committed member of Plaid Cymru.His friend John Ormond, produced his well-regarded 1972 and 1974 series on Welsh history, The Land Remembers, for the BBC, which was accompanied by his book of the same title.\nHis autobiography, ABC of (D.) G. W, was published in 1981, while his Collected Poems, 1936–86 were published in 1987. Williams died in 1990 in Aberystwyth. His diaries of family life in Mynydd Bach were published as Summer Journal 1951.As well as translations, poems, articles and reviews, Gwyn Williams published the following books:\nThe Rent That’s Due to Love: an anthology of Welsh poetry (Letchworth: The Garden City Press, 1950). \nAn Introduction to Welsh Poetry (London: Faber and Faber, 1953). \nIn Defence of Woman by William Cynwal. Translated by Gwyn Williams, engravings by John Petts London: Golden Cockerel Press, undated c.1955). \nThis Way To Lethe (London: Faber and Faber, 1962) (novel).\nGreen Mountain: an informal guide to Cyrenaica and its Jebel Akhdar (London: Faber and Faber, 1963). \nTurkey: A Traveller’s Guide and History (London: Faber and Faber, 1967). \nInns of Love (Swansea: Christopher Davies, 1970) (poems). \nThe Avocet (Swansea, Christopher Davies, 1970) (novel).\nEastern Turkey: a guide and history (London: Faber and Faber, 1972).\nWelsh Poems: sixth century to 1600 (London: Faber and Faber, 1973).\nFoundation Stock (Llandysul: Gomer Press, 1974) (poems).\nTwrci a’i Phobl (Caerdydd: Gwasg Y Dref Wen, 1975).\nTwo Sketches of Womanhood (Llandybie: Christopher Davies, 1975) (novellas).\nTroelus a Chresyd (Llandysul: Gwasg Gomer, 1976).\nTo Look for a Word: collected translations from Welsh poetry (Llandysul: Gomer Press, 1976).\nThe Land Remembers: a view of Wales (London: Faber and Faber, 1977).\nAn Introduction to Welsh Literature (Cardiff: University of Wales Press, 1978).\nChoose Your Stranger (Port Talbot: Alun Books, 1979) (poems and translations).\nY Ddefod Goll (Port Talbot: Llyfrau Alun, 1980) (poems, and translations into Welsh from Turkish).\nPerson and Persona: Studies in Shakespeare (Cardiff: University of Wales Press, 1981).\nABC of(D)GW: a kind of autobiography (Llandysul: Gomer Press, 1981).\nY Cloc Tywod ((Talybont: Y Lolfa, 1984) (novel).\nCollected Poems 1936–1986 (Llandysul: Gomer Press, 1987). \nFlyting in Egypt: the story of a verse war 1943–45 told by Gwyn Williams (Port Talbot: Alun Books, 1991).\nAn Introduction to Welsh Literature (revised edition) (Cardiff: University of Wales Press, 1992). \nSummer Journal 1951 (Aberystwyth: Planet, 2004) (edited and introduced by Teleri Williams and Lowri Gwilym).", "link_mentions": [{"page": "John Davies (poet, born 1944)", "response": ["In 1954, the family moved to steel-making and English-speaking Port Talbot,See   The first five poems in Davies' collection, The Visitor's Book (1985) reflect on living in Cymmer and Port Talbot, and Davies’ return journeys to both. See in particular his poem In Port Talbot. His biography in The Visitor’s Book gives the date of 1954. a town with a rich cultural tradition,For a full account, see John, A.V. (2015) pp9-65, as well as Jones, S.R. (2009). The town had an operatic society and several choirs, as well as regular competitive musical and literary festivals (eisteddfodau) held in schools, churches and chapels, and a long-standing amateur dramatic tradition that has produced, for example, Ivor Emmanuel, Richard Burton, Anthony Hopkins, Di Botcher, Michael Sheen, Rebecca Evans, Rob Brydon and many others. Both John and Jones note that cultural activity was also fostered by groups such as the Port Talbot Historical Society, the Port Talbot Writers' Circle and 'the Port Talbot Literary Society. including connections with the poets Ruth Bidgood, Sally Roberts Jones, Moelwyn Merchant, Dylan Thomas, Edward Thomas and Gwyn Williams.Port Talbot connections: see Stephens, M. ed. (1986) for the entries of Ruth Bidgood p40, Sally Roberts Jones p323, Moelwyn Merchant p395 and Gwyn Williams p646. For more on Edward Thomas and Port Talbot, see James, B. Ll. (1993) and online at . For Dylan Thomas and Port Talbot, see "]}, {"page": "David Gwyn Williams", "response": ["#REDIRECT Gwyn Williams (writer)"]}, {"page": "Dinogad's Smock", "response": ["The identity of the animal referred to in the text as llewyn has been widely debated by scholars. Some, such as Ifor Williams and John Koch, believed it to refer to the red fox, whereas Gwyn Williams and T. Conran translated it as \"wildcat\". Others, such as Alfred Owen Hughes Jarman and Eric Partridge, tentatively identified it as the lynx. "]}, {"page": "The Woodland Mass", "response": ["* Gwyn Williams' translation at Poetry Nook"]}]}}