{"wiki_id": "http://www.wikidata.org/entity/Q5235003", "itemLabel": "David Hill", "itemDescription": "English missionary, born 1840", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Hill_(missionary)", "wikipedia_page": {"main": "David Hill (1840–1896) was a British Wesleyan Methodist missionary to China. He served with the English Wesleyan Methodist Society. In Shanxi Province, he was instrumental in the conversion of the Confucian scholar Hsi to Christianity.\nFrom Days of Blessing in Inland China is the report provided orally at two meetings by Hsi (now known as Pastor Hsi) on his first meeting with Rev David Hill:\n\nSome time after this, in the time of the great famine, an Englishman of the name of Li (Rev. David Hill, of the Wesleyan Mission, Wu-ch’ang), came to help us in our extremity. When he had been here some time distributing food and money, he offered a prize of 30 taels (£7 10s.) for the best essay on given Christian subjects. The competitors had books supplied from which to read the subject up, and my essay gained the prize. The next thing was to get the money. I had heard many reports that foreigners could bewitch people, and I feared to fall under their influence. However, I went to P’ing-yang Fu with my brother, and stopped in an inn. My brother volunteered to go for me to get the money, but he came back saying the foreigner wanted to see the very man who had written the essay. Well, I was in a dilemma! On the one hand I feared bewitchment, on the other hand I feared to lose the 30 taels. At last I decided to go. On inquiring at the door, I met Mr. Sung and two men of the name of Li, all there of them natives. Addressing them, I said, “May I ask what you do here?” “Oh,” said they, “we are helping the foreigner.” “And don’t you fear being bewitched?” “No, indeed,” they replied, “nor would you if you knew him.” Mr. Sung then obtained an interview for me with Mr. Hill. One glance, one word, it was enough! As stars fade before the rising sun, so did his presence dissipate the idle rumors I had heard; all trace of my fear was gone, my mind was at rest. I beheld his kindly eye and remembered the words of Mencius, “If a man’s heart is not right his eyes bespeak it.” I realized I was in the present of a true man.", "link_mentions": [{"page": "David Hill", "response": ["David Hill may refer to:", "* David Hill (Oregon politician) (1809–1850), American politician, founder of the city of Hillsboro, Oregon", "* David Hill (cricketer) (1915–1974), Guyanese cricketer", "* David Hill (Rangers footballer) (fl. 1881–1882), Scottish international football player (Rangers and Scotland)", "* David Hill (footballer, born 1881) (1881–1928), Scottish international football player (Third Lanark and Scotland)", "* David Hill (footballer, born 1965), English footballer for Bradford City", "* David Hill (rugby league) (active 1967–78), British rugby league player (Wigan and Great Britain)", "* David Hill (tight end) (born 1954), American football player (Detroit Lions)", "* David Hill (wide receiver) (born 1977), American football player", "* David Hill (rugby union) (born 1978), New Zealand rugby union player", "* David Hill (swimmer), British Paralympic swimmer", "* David Hill (missionary) (1840–1896), Wesleyan Methodist missionary to China", "* David Hill (Mohawk) (1745–1790), Mohawk chief", "* David Hill (author) (born 1942), New Zealand author of fiction", "* David Hill (businessman) (born 1946), Australian businessman", "* David Hill (producer), American executive producer of television, mainly with the Fox organization", "* David Hill (choral director) (born 1957), British choral conductor and organist", "* David Hill (musician and businessman) (active 1994 and after), former member of the band Ballistic Brothers and founder of Nuphonic record label", "* David Hill (Labour adviser), British political adviser", "* David Hess (AKA David Hill, 1936–2011), American actor, singer, and songwriter", "* Colonel Guy Johnson and Karonghyontye (Captain David Hill), a 1776 portrait by Benjamin West", "* David Hill memorial school, a school for blind girls in Hankou, China (1883–1911)"]}, {"page": "Xi Shengmo", "response": ["David Hill, an English Methodist missionary, was instrumental in introducing Xi to Christianity. After his conversion, Pastor Xi fabricated his own medications made of morphia to treat opium addicts and many sick people were brought to him for healing. Prayer was a major factor in his treatments and a number of the recoveries were considered miraculous:Days of Blessing Inland China , Chapter 12, August 1886, includes the report provided orally at two meetings by Hsi"]}, {"page": "List of Protestant missionaries in China", "response": ["| David Hill"]}, {"page": "English Wesleyan Mission", "response": ["The Wesleyan Missionary Society sent out Revs. W. R. Beach and J. Cox to Guangzhou in 1852. It afterwards established itself in Hankow, and had its principal stations in that city and others of the province of Hupeh. Lay agency, under the direction of Rev. David Hill, was a prominent feature in the Mission at Hankow, and this Society was also trying the experiment of giving to some of its missionaries a medical training, that they might combine preaching and healing gifts in their labors. Reverend Doctors Charles Wenyon and Roderick McDonald were chief among these medical missionaries in taking up this call. In 1884 it resolved to open a college or high school in connection with their Central Mission, and the Rev. W. T. A. Barber, M.A., was appointed principal, and arrived at Hankow early in 1885. The object of the institution was to provide a liberal Western education for the sons of official and other wealthy Chinese. Attempts to purchase land for the erection of a suitable building were unsuccessful, but in 1887 a large house was rented in the main street of Wuchang, and the work begun. A ladies auxiliary society also sent out female workers. In 1890 there were twenty-five missionaries at work, with six lady agents, two ordained native pastors, thirty-three unordained native helpers, and nine hundred and seventy-five communicants.Townsend (1890), 244-246"]}, {"page": "Taiyuan massacre", "response": ["* Mr J J Turner and Mr F James travelled from Chianking on 17 Oct 1876 arriving in \"Taiyuanfu\" in April 1877 to discover the region was suffering from 3 years of famine. They left on 28 Nov, two days before the arrival of Timothy Richard with famine relief. Returning the following March 1878 with famine relief were Mr Turner, Rev A Whiting (American Presbyterian Mission) and Rev David Hill (Wesleyan Missionary Society)."]}]}}