{"wiki_id": "http://www.wikidata.org/entity/Q5238466", "itemLabel": "David Pearce", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Pearce_(boxer)", "wikipedia_page": {"main": "David \"Bomber\" Pearce (8 May 1959 – 20 May 2000) was a British heavyweight boxing champion.\nAlso known as The Welsh Rocky, Pearce held both the Welsh and the British Heavyweight titles and held the number one WBC Cruiserweight ranking from September 1983 to September 1985. In all he won 19 (15 KO) of his 22 professional bouts, losing three, with one drawn. He won two of his unlicensed bouts, losing one.", "link_mentions": [{"page": "Ossie Ocasio", "response": ["Ocasio made three successful defenses, winning 15-round decisions over Young Joe Louis and Randy Stephens, appearing on Jet Magazine the week before the Stephens bout, and knocking out John Odhiambo in the 15th round in Guaynabo, Puerto Rico. After the bout Ocasio turned down a fight with Great Britain fighter David Pearce, after Morgans Palle had provided contracts to make the fight and Ocasio had previously signed to. He decided to return to South Africa, where he lost his title to Piet Crous by a 15-round decision. One month before losing the title, his brother had been murdered."]}, {"page": "Carlos De León", "response": ["De León, a native of Trujillo Alto, Puerto Rico, first won a world title when replacing David Pearce (the Great Britain fighting man who had KO'd him in a sparring session at Angelo Dundee Boxing gym) to face the WBC world champion Marvin Camel on November 25, 1980, on the undercard of Sugar Ray Leonard and Roberto Durán's second fight in New Orleans.  De León outpointed Camel over fifteen rounds.  In a rematch later, De León knocked out Camel in eight rounds.  When his countryman Ossie Ocasio won the WBA world title, De León and Ocasio became the second pair of Puerto Ricans to share world titles in the same division at the same time; Alfredo Escalera and Samuel Serrano had achieved the feat in the 1970s in the junior lightweight division."]}, {"page": "Leon Spinks", "response": ["Spinks was due to face the World Cruiserweight number one David Pearce, but the fight was called off on 24 hours notice after the fighters had both weighed in, due to the BBBoC stance on Pearce fighting abroad in the newly formed Cruiserweight division."]}, {"page": "Newport, Wales", "response": ["The boxer David Pearce was born in Newport."]}, {"page": "List of boxing families", "response": ["*David Pearce: 1979 to ----, Welsh & British heavyweight champion"]}, {"page": "Marvin Camel", "response": ["Camel fought Mate Parlov in Yugoslavia to a draw in the first ever cruiserweight world title bout. In the rematch, in Las Vegas, Camel beat Mate Parlov for the vacant WBC world Cruiserweight title in 1980, losing the title in his first defense, to Carlos De León who replaced David Pearce. After losing in a rematch to De Leon, he became, in 1983, the IBF's first world champion, by beating Roddy McDonald who also replaced David Pearce after the BBBoC would not sanction the Cruiserweight division in the UK) and thus becoming world Cruiserweight champion for the second time when he claimed that organization's title. He later lost the title to Lee Roy Murphy."]}, {"page": "John Tate (boxer)", "response": ["Tate won the first two by KO, which included Marvin Camel before losing the final one against the exciting British heavyweight David Pearce who defeated him by a third round knockout."]}, {"page": "Newport Transporter Bridge", "response": ["The Visitor Centre is located on the west bank and features exhibits on the history of the bridge, its construction and other transporter bridges around the world. The centre has a painting of David Pearce, the former undefeated Welsh and British Heavyweight Boxing Champion 1983–1985. Pearce used to run up the steps of the Transporter Bridge during his training. The centre is generally open at weekends, but it is currently closed until Spring 2023, while extensive restoration of the bridge structure is performed and a new visitor centre is constructed."]}, {"page": "Philip Madoc", "response": ["He was a big fan of boxing and especially David Pearce, the professional boxer and was one of the 2,500 people who attended his funeral."]}, {"page": "Colin Jones (boxer)", "response": ["* On a Box Nation boxing hour show - Colin Jones was voted the best Welsh boxer not to win a world title and David Pearce was voted the unluckiest fighter never to win a world title in reference to the cruiserweight division not being active in Great Britain at that time. This was backed up by the Ring Magazine publishing the fighter in their top ten unluckiest fighters never to win a World Title."]}, {"page": "Gary Mason (boxer)", "response": ["Mason sparred with the former WBA World cruiserweight number one and avoided British heavyweight champion David Pearce. Pearce helped him with sparring in preparation for Mason's title fights during his exile from the sport. Mason praised Pearce and said he was instrumental in his helping his career."]}, {"page": "Bartley Gorman", "response": ["Bartley Gorman and David Pearce signed to fight for the World unlicensed title after Pearce KO'd former WBA World Heavyweight Champion John Tate, in California. Gorman said; \"Dave Pearce is the best gorger fighting man in Great Britain and I am King of the Gypsies, If I win I will challenge Muhammed Ali to fight for the title\". This was made possible due to the links both fighters had with former Bareknuckle fighter and friend to Ali, Paddy Monaghan."]}, {"page": "2000 in Wales", "response": ["*20 May – David Pearce, boxer, 41"]}, {"page": "1983 in Wales", "response": ["*Boxing - David Pearce of Newport wins the British heavyweight title."]}, {"page": "David Pearce", "response": ["Dave or David Pearce may refer to:", "*David Pearce (transhumanist), British transhumanist", "*David Pearce, musician with Flying Saucer Attack", "*David Pearce (economist) (1941–2005), pioneer of environmental economics", "*David Pearce (boxer) (1959–2000), Welsh former British heavyweight boxing champion", "*David Pearce (politician) (born 1960), Missouri politician", "*David Pearce (athlete), British athlete", "* David Pearce (born c. 2000), designer of the reverse of the new (2017) 12-sided UK pound coin"]}, {"page": "Dennis Andries", "response": ["Andries turned pro in 1978 and won the WBC Light Heavyweight Title in 1986 in a decision over American JB Williamson.  He defended the title once against fellow Briton Tony Sibson before losing the belt in 1987 to Thomas Hearns.  In 1989 he re-captured the Vacant WBC Light Heavyweight Title with a win over American Tony Willis, but lost the title in his first defence to Jeff Harding.  In 1990 he won a rematch with Harding via 7th-round KO, recapturing the title. He made two further defences before in 1991 losing the title again to Harding, via majority decision, capping their trilogy. Dennis Andries, lost a WBA Cruiserweight final eliminator via 7th-round KO to David Pearce in 1982, although the BBBoC did not sanction the Cruiserweight division in the UK.", "|align=left| David Pearce"]}, {"page": "Joe Erskine (Welsh boxer)", "response": ["Joe stayed involved in boxing as he was a big fan of David Pearce."]}, {"page": "Reg Gutteridge", "response": ["Gutteridge, an after-dinner speaker, often spoke of the former champion and 'unlucky' fighter David Pearce and his remarkable short successful boxing career. Pearce was rated number one by the WBC."]}, {"page": "S. T. Gordon", "response": ["Gordon became a professional boxer in 1977. He faced undefeated heavyweight prospect Gerry Cooney in 1978 but lost via a fourth-round disqualification. In 1981 he beat aging contender Yaqui Lopez for the North American Boxing Federation cruiserweight title. The next year he won the Lineal and WBC cruiserweight titles with a technical knockout victory over Carlos De León. The champion refused to defend the belt against the number one contender David Pearce in his first defence in the USA, and could not defend his belt in Great Britain because of the BBBoC reluctance to recognise the Cruiserweight division in the UK."]}, {"page": "Bernard Benton", "response": ["Known as \"The Bull\", Benton turned pro in 1981 and won the WBC and lineal cruiserweight titles with a decision win over Alfonso Ratcliff in 1985. He was due to defend against David Pearce who had knocked him out in a previous amateur bout. Benton declined to fight Pearce and subsequently lost the belt in his first defense to Carlos De León via decision the following year.  He retired in 1995."]}, {"page": "List of British heavyweight boxing champions", "response": ["|align=left | David Pearce"]}, {"page": "Paul Sykes (boxer)", "response": ["Sykes' career peaked in June 1979 when he challenged for John L. Gardner's British and Commonwealth titles at Wembley. Sykes prepared for the fight with three weeks of sparring with Leon Spinks in Michigan. This proved to be an evenly matched contest as it entered the sixth round, though the younger Gardner's stamina proved too much for the 33-year-old Sykes, and the fight was stopped when Sykes turned his back, clearly overwhelmed by Gardner's onslaught. Gardner was seven years younger than Sykes (Gardner referred to Sykes after the fight as \"an old man\"), and this was his thirty-first professional fight; in contrast, Sykes had entered the fight after just eight professional bouts. Sykes still holds the record for being the British Heavyweight title challenger with fewest professional fights, having effectively been fast tracked by people involved with the sport who had been convinced of his potential. Despite many years in prison, such was the level of interest that Sykes generated on starting his belated boxing career following his release in 1978, that he found himself in promotional photographs with Don King and Larry Holmes, and also travelled to the United States to stand in as a sparring partner for Leon Spinks.Sykes, Paul: Sweet Agony Sykes was a bodyguard to Alex Steene, and sparred the future champion David Pearce, Paul Sykes said; David \"Bomber\" Pearce was the toughest and most ferocious fighter he faced during his boxing career based on the sparring that took place at the Waterloo Boxing Gym. Sykes, became good friends with Pearce and the Pearce boxing brothers. "]}, {"page": "Dick Richardson (boxer)", "response": ["Dick Richardson, offered advice to Newport Heavyweight David Pearce.  Dick believed if David had signed with a promoter from London he would have become a World Champion. David would not leave his father due to his loyaltyhttp://www.southwalesargus.co.uk/archive/"]}, {"page": "Terry Lawless", "response": ["Famous for looking after his fighters like a father rather than a manager, Lawless often fell out with matchmaker Mickey Duff because he did not want to expose his boxers to unnecessary dangers. Duff stated in his autobiography that Lawless was always asking for opponents who would defend but not attack. This was the reason Frank Bruno never faced David Pearce for the heavyweight championship of Great Britain. While living in retirement in Marbella with his wife of more than 50 years Sylvia, Lawless often said he was happy to be remembered as the manager who did not want his boxers hurt."]}, {"page": "Boxing in Wales", "response": ["|align=left | David Pearce"]}, {"page": "Danny McAlinden", "response": ["McAlinden was born in Newry. He turned professional in 1969 and in his second professional fight, he stopped the future British champion Richard Dunn. On the program of the  Joe Frazier versus Muhammad Ali I bout on March 8, 1971, at the Madison Square Garden in New York, New York, United States, McAlinden outpointed Ali's brother, Rahman, who was undefeated in seven previous fights, in a contest of prospects, by decision after six rounds. He was at one time considered a potential opponent for the world champion George Foreman's first title defence. However, his form dipped and in 1973 he began to lose fights, eventually losing his title in 1975 to Bunny Johnson in nine rounds. He attempted to win back the title in 1975 when the holder was Richard Dunn, but he lost in round two. He fought on until 1981 and after refusing to face the explosive punching David Pearce he decided to retire.  In total he had 45 fights with a 31–12–2 record, winning 28 by knockout."]}, {"page": "Neville Meade", "response": ["Meade, now 30, was in poor shape as a contender for the British title. Since winning the Welsh belt, Meade had fought ten times, losing seven and six of them were stoppages within the distance. In an attempt to change his fortunes, Meade linked up with trainer Jimmy Bromfield, boxing out of Colin Breen's gym in Sandfields, Swansea. Meade spent a year away from professional fighting, making his comeback for a defence of his Welsh title against David Pearce in early 1980. The ten round fight, held at Caerphilly, lasted until the second, with Meade winning via a controversial stoppage. Meade followed this with an identical second round stoppage in another Welsh title defence, this time over Cardiff fighter Winston Allen. His turn in form was rewarded with a first round eliminator to choose the next challenger for the British Heavyweight title. His opponent was Stan Dermott, a London-based fighter, and their encounter was held at the Royal Albert Hall in the capital on 8 December 1980. This time Meade took his chance and stopped Dermott in the fifth round, leaving just one more fight for a shot at the belt. The final eliminator was held in Wales, at Ebbw Vale, and Meade, facing Terry Mintus from Leeds, recorded his fourth straight knockout this time in the third round.", "After winning the title Meade was signed up by boxing promoter Terry Lawless, breaking the Meade-Bromfield partnership. Meade followed up his title victory with an encounter with American Leroy Boone, less than a month later. The ten round fight went the full distance with referee Harry Gibbs giving the decision to Boone. Meade was back on winning form when he knocked out Rick Kellar in February of the next year when the two fought at the National Exhibition Centre in Birmingham. Meade's final fight was his first defence of his British title, fought at St David's Hall in Cardiff on 22 September 1983. His opponent was David Pearce, who Meade had beaten at the start of his comeback in 1980. The match was the last British title fight ever to be held over 15 rounds, as the two fighters had signed contracts before the rule change came in. The contest ended in the ninth, when Meade was stopped by a technical knockout. He never fought professionally again."]}, {"page": "List of Welsh boxing champions", "response": ["|align=left | David Pearce", "|align=left | David Pearce"]}, {"page": "Horace Notice", "response": ["As a professional, Notice won the British Boxing Board of Control (BBBofC) British heavyweight title, and Commonwealth heavyweight title, his professional fighting weight varied from 196 lb, to 212 lb. After defending both his British and Commonwealth heavyweight titles against Hughroy Currie, a retinal detachment prematurely ended his boxing career, and ruined his plans of a next defence. Horace said; \"his only regrets were not fighting for a EBU title and facing the man that Frank Bruno avoided, David Pearce\"."]}, {"page": "Gordon Ferris", "response": ["After missing out on selection for the 1976 Olympic Games, Ferris took the decision to turn professional and made his pro debut in December 1977 with a win over Keith Steve Johnson. He won 14 of his first 18 pro fights, leading to a final eliminator for the British heavyweight title in September 1980 against Tommy Kiely, with the Irish and Northern Ireland Area titles also at stake; He won on points over 12 rounds, leading to a fight with Billy Aird for the vacant British title. He won by a 15-round points decision to become British champion.\"Ferris the New Champion Heavy\", Glasgow Herald, 31 March 1981, p. 28. Retrieved 28 September 2014 He lost the title in his first defence, against Neville Meade in October 1981, losing by a first-round knockout. He attempted to get another shot at the title but was beaten in a final eliminator in June 1982 by David Pearce, after which he retired from boxing."]}]}}