{"wiki_id": "http://www.wikidata.org/entity/Q5238957", "itemLabel": "David Reekie", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Reekie", "wikipedia_page": {"main": "David Reekie is an eminent English glass sculptor who uses drawing and glass casting to express his unique vision of the human condition. His art can be found in the Victoria and Albert Museum in London and the Carnegie Museum of Art in Pittsburgh, as well as in several other public collections in the United Kingdom.\nA founding member of British Artists in Glass, now the Contemporary Glass Society, Reekie's work has featured in countless periodicals and in over 60 exhibits worldwide.", "link_mentions": [{"page": "List of glass artists", "response": ["*David Reekie (b. 1947)"]}, {"page": "Roger Kohn", "response": ["Amongst other work Kohn has undertaken filmography on Verónico Cruz and designs and produces the publicity material for African RevivalPublicity material for African Revival at Fruity Faces.com  a UK-based charity that provides Aid to 'self-sustaining projects' in Sudan, Uganda, Kenya, Malawi, Mozambique, South Africa and Zambia. He is product designer for Fruity Faces, the Dragons' Den fruit case manufacturer that encourages healthy eating and gives its profits to charity. Kohn also designs the magazine showcasing the work of British Glass Artists in the UK, produced for the Contemporary Glass Society,The Contemporary Glass Society Website and founded by David ReekieArtist's website as British Artists in Glass. The Contemporary Glass Society is an"]}, {"page": "Contemporary Glass Society", "response": ["Founded in 1997, by Peter Layton of the London Glassblowing Studio, together with Colin Reid and Tessa Clegg, the Contemporary Glass Society  rose from the ashes of British Artists in Glass, an informal association of individual Glass Artists founded in 1976 by a group of artists including the glass sculptor David Reekie.See David Reekie page Essentially an informal Craft Guild, British Artists in Glass was composed almost entirely of artists working in blown and kiln glass.  Since its demise in 1992, the representation of British Glass had been left to individual efforts. There was no overall organisation. Through discussions with other like-minded people, Peter Layton identified the need for a unified, National Society, to represent the interests of enthusiasts of glass more generally, within the national and international community. The Contemporary Glass Society was the result.  ", "Current members of the Contemporary Glass Society include: Katharine Coleman, Emma Woffenden, Anna Dickinson, Fiaz Elson, Catherine Hough, David Reekie, Colin Reid and Tessa Clegg.", "* David Reekie"]}, {"page": "Birmingham Metropolitan College", "response": ["* David Reekie ‡"]}, {"page": "Glasmuseet Ebeltoft", "response": ["Artists represented by work in the collection include Klaus Moje and Nick Mount of Australia; Louis Leloup of Belgium; Václav Ciglar, František Janák, Jiří Harcuba, Pavel Hlava, Stanislav Libenský and Jaroslava Brychtová and René Roubíček of the Czech Republic; Eva Engström, Finn Lynggaard and Tchai Munch of Denmark; Ivo Lill of Estonia; Erwin Eisch, Ursula Merker, Gerhard Ribka, Kurt Wallstab and Ann Wolff of Germany; Ursula Huber-Peer, Pino Signoretto, Bruno Pedrosa and Lino Tagliapietra of Italy; Durk Valkema and Sybren Valkema of the Netherlands; Anna Carlgren, Gunnar Cyrén, Eva Englund, Göran Wärff and Ulrica Hydman-Vallien of Sweden, Charles Bray and David Reekie of the United Kingdom; and Rick Beck, Gary Beecham, William Bernstein, Katharine Bernstein, Nicole Chesney, Dale Chihuly, Fritz Dreisbach, Shane Fero, Robert Fritz, Michael Glancy, Richard Jolley, Jon Kuhn, Marvin Lipofsky, Harvey Littleton, John Littleton/Kate Vogel, Dante Marioni, Richard Marquis, Joel Philip Myers, Mary Shaffer, Paul Stankard, Michael Taylor and Toots Zynsky of the United States."]}, {"page": "Captive audience", "response": ["* Captive Audience, a 2001 work by sculptor David Reekie"]}, {"page": "Emma Camden", "response": ["Camden graduated from Southampton Institute of Higher Education in 1985, and completed at BA (Hons) in Glass with Ceramics at Sunderland Polytechnic in 1990. She moved to Auckland, New Zealand in 1991. A master class on the lost-wax method of casting with David Reekie introduced Camden to this method, which became the focus of her work."]}, {"page": "Reekie, David", "response": ["#redirectDavid Reekie"]}]}}