{"wiki_id": "http://www.wikidata.org/entity/Q5237073", "itemLabel": "David Malin", "itemDescription": "British-Australian astronomical photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Malin", "wikipedia_page": {"main": "David Frederick Malin   (born 28 March 1941) is a British-Australian astronomer and photographer.  He is principally known for his spectacular colour images of astronomical objects.  A galaxy is named after him, Malin 1, which he discovered in 1986 and which is the largest spiral galaxy so far discovered.", "link_mentions": [{"page": "List of galaxies", "response": ["|Discovered and named by David Malin."]}, {"page": "David malin", "response": ["#REDIRECT David Malin"]}, {"page": "Astronomical Society of the Pacific", "response": ["* Noted astronomical photographer David Malin describing the transition from chemical to digital photography"]}, {"page": "Heywood, Greater Manchester", "response": ["*David Malin The noted astrophotographer grew up in the Ashworth Valley area of Heywood"]}, {"page": "Jackson-Gwilt Medal", "response": ["| David Malin"]}, {"page": "Eureka Prizes", "response": ["*Dr David Malin, author of A View of the Universe and Mary E. White, author of The Browning of Australia, shared prize"]}, {"page": "List of RMIT University people", "response": ["| David Malin, AM"]}, {"page": "Fred Watson", "response": ["* APRA Choral Work of the Year award for his contribution on Star Chant, a choral symphony by the Australian composer Ross Edwards, which also used celestial images by David Malin, and premiered at the Adelaide Festival in 2002", "*Star Chant is a collaboration with Australian Composer Ross Edwards. This was the fourth choral symphony written by Edwards, for which Watson wrote the libretto. As a multi-media work, celestial images by David Malin are included. Star Chant premiered at the Adelaide Festival in March 2002, and has also been performed at the Sydney Opera House.Star Chant received several awards, including 2008 APRA award for the Choral work of the Year."]}, {"page": "Lennart Nilsson Award", "response": ["* David Malin, Anglo-Australian Observatory  - 2000"]}, {"page": "Ben Gascoigne", "response": ["The work at Siding Spring was rewarding, but it could also be dangerous. During construction, Gascoigne constantly warned colleagues to take care on the elevated catwalks around the telescope. However, Gascoigne himself was almost killed when, while working one night around the telescope structure, he fell seven metres to the floor of the observatory, narrowly missing \"a massive steel structure with long protruding bolts\".The location inside the AAT dome is now known as \"Gascoigne's Leap\". He survived, and was the first to take a photograph using the telescope, on 26Haynes et al., p. 394 or 27 April 1974.Gascoigne et al., p. 160 Gascoigne was so pleased with the quality of the optics that he said he wanted a number describing the hyperboloid shape of the mirror (1.1717) engraved on his headstone. The site quickly became one of the world's most important astronomical observatoriesHaynes et al., p. 176 and was for many years home to world-leading astrophotographer David Malin.Gascoigne et al., pp. 209–210Haynes et al., pp. 400–401 The successes of the AAT have been documented in annual reports by its Board, while a 2008 analysis of the relative impacts of astronomical observing facilities placed the AAT in the top three, coming after only the Sloan Digital Sky Survey and the W. M. Keck Observatory (both telescopes built more than two decades later). For Gascoigne, it was \"a wonderful thing to be associated with – the high point in my life.\""]}, {"page": "Malin 1", "response": ["Malin 1 is a giant low surface brightness (LSB) spiral galaxy. It is located  away in the constellation Coma Berenices, near the North Galactic Pole. , it is the largest known spiral galaxy, with an approximate diameter of , thus over three times the diameter of our Milky Way. It was discovered by astronomer David Malin in 1986 and is the first LSB galaxy verified to exist. Its high surface brightness central spiral is  across, with a bulge of . The central spiral is a SB0a type barred-spiral."]}, {"page": "Akira Fujii", "response": ["Fujii's work is marketed by David Malin;Astronomical Photographs from David Malin Images, by David Malin; published 30 August 2009; retrieved June 22, 2011 he collaborated with Serge Brunier in the production of 2001's Great Atlas of the Stars.Nonfiction Notes at Publishers Weekly, Volume 248 Issue 40 10/01/2001; retrieved June 22, 2011"]}, {"page": "Macarthur Astronomy Forum", "response": ["* Dr. David Malin (Australian Astronomical Observatory)."]}, {"page": "Chris Impey", "response": ["As a postdoc at Caltech he worked with Greg Bothun at the University of Oregon on the properties of dim and diffuse stellar systems that tend to be missing from most galaxy surveys. Working with the noted Australian astrophotographer David Malin, they discovered the largest spiral galaxy known, dubbed Malin 1. He also continued his thesis work on BL Lac objects, using a travelling polarimeter that toured many of the world's observatories, including Kitt Peak in Arizona, Palomar in California, Las Campanas and Cerro Tololo in Chile, Sutherland in South Africa, and the Special Astrophysical Observatory in the Caucasus region of Russia."]}, {"page": "Warrick Couch", "response": ["In 1985, he returned to Sydney to take up a four-year National Research Fellowship at the Anglo-Australian Observatory (which has since been renamed as the Australian Astronomical Observatory). Over this period the advent of CCD imaging cameras on the AAT, with their greatly superior sensitivity, provided much more detailed information on distant galaxy clusters than was possible with the previous two-colour photographic approach. Couch exploited this opportunity to provide a clear picture of what the different spectral signatures told us about the underlying patterns of star formation activity.Couch, W.J., Sharples, R.M., 1987, MNRAS, 229, 423 In 1987, the brightest supernova in the modern era, SN1987a, exploded. In addition to being heavily involved in taking observations of SN1987A with the powerful suite of spectroscopic instruments on the AAT, Couch also worked with David Malin and David Allen to image and interpret the light echoes emanating from the supernova.Couch, W.J., Allen, D.A., Malin, D.F., 1990, MNRAS, 242, 555"]}, {"page": "Chris Boot", "response": ["He was editorial director at Phaidon Press from 1998 to 2000. While at Phaidon, he wrote and edited Magnum Stories; edited Robert Capa, the Definitive Collection by Richard Whelan and the Phaidon 55 series of books from 2001 onwards, which included volumes on Nan Goldin, Mary Ellen Mark, Shomei Tomatsu, Dorothea Lange and W. Eugene Smith and Walker Evans; and commissioned The Photobook: A History by Martin Parr and Gerry Badger, Boring Postcards from the collection of Martin Parr, Outland by Roger Ballen, Snaps by Elliott Erwitt, and Heaven and Earth by David Malin and Katherine Roucoux."]}, {"page": "Galerie Karsten Greve", "response": ["| Josef Albers || Lynn Davis  || David Malin || Gideon Rubin"]}, {"page": "List of people named David", "response": ["*David Malin (born 1941), British-Australian astronomer", "*David Malinowski, American make-up artist"]}, {"page": "Malin, David", "response": ["#redirectDavid Malin"]}, {"page": "NGC 1395", "response": ["David Malin and Dave Carter discovered in 1983 low contrast shells in the bright envelope of NGC 1395. The brightest shell lies 3 arcminutes northwest of the galactic centre. A perpendicular feature is seen also in deep imaging in the northwest part of the galaxy. Features like these are indicative of recent accretion of a smaller galaxy in the recent past."]}, {"page": "Malin (surname)", "response": ["* David Malin, British-Australian astronomer and photographer"]}]}}