{"wiki_id": "http://www.wikidata.org/entity/Q5235505", "itemLabel": "David J. Templeton", "itemDescription": "Northern Irish murder victim", "wikipedia_url": "https://en.wikipedia.org/wiki/David_J._Templeton", "wikipedia_page": {"main": "David J. Templeton (1954 – 24 March 1997) was a minister of the Presbyterian Church in Ireland who was murdered in 1997. He had come to public notice  when he was 'outed' as a gay man by the Sunday Life newspaper.", "link_mentions": [{"page": "Templeton", "response": ["* David J. Templeton (1954–1997), Irish Presbyterian minister, murder victim"]}, {"page": "David J Templeton", "response": ["#REDIRECT David J. Templeton"]}, {"page": "Mark Haddock", "response": ["As leader of the UVF in Mount Vernon, Haddock presided over one of the organisation's most active units in the latter stages of the Troubles. Although frequently discussed in the Sunday World by Martin O'Hagan, he was never referred to by name until 20 August 2003, when his picture appeared on the front cover of the Belfast Telegraph, alongside a story identifying him as the head of the Mount Vernon UVF.Raymond McCord, Justice for Raymond, Gill & Macmillan, 2008, p. 115. In October 2005, Labour TD Pat Rabbitte, using Dáil privilege, named Haddock as an RUC Special Branch agent and as responsible for the killings of Sharon McKenna in 1993, Catholic builders Gary Convie and Eamon Fox in 1994, the alleged informer Thomas Sheppard in 1996, Protestant clergyman Rev David J. Templeton in 1997, Billy Harbinson in 1997, Raymond McCord Jnr in 1997, former UDA commander Tommy English in 2000, and David Greer in 2000.David McKittrick, Seamus Kelters, Brian Feeney, Chris Thornton & David McVea, Lost Lives: The Stories of the Men, Women and Children Who Died as a Result of the Northern Ireland Troubles, Mainstream Publishing, 2008, p. 1416. The claim that Haddock was an informer with a Special Branch \"handler\" was also made by the Sunday World, campaigner Raymond McCord, the Belfast Telegraph,Haddock is the Tip of the IcebergHaddock wasn't the only Special Branch agent: it went all the way to the top, The Belfast Telegraph.co.uk. Retrieved 6 March 2015. The IndependentMurdered While Police Turned a Blind Eye, The Independent. Retrieved 6 March 2015. and Ulster Television.Haddock Trial Adjourned , Ulster Television website. Retrieved 6 March 2015."]}, {"page": "Paramilitary punishment attacks in Northern Ireland", "response": ["Republican and loyalist paramilitaries both targeted gay men and individuals suspected of molesting children.  Loyalist paramilitaries also deal harshly with sexual crimes. One Presbyterian minister, David J. Templeton, was caught with homosexual pornography and died after a beating by the UVF in 1997. Republican paramilitaries shot a 79-year-old man in both arms and legs after mistaking him for an accused child molester."]}]}}