{"wiki_id": "http://www.wikidata.org/entity/Q5238206", "itemLabel": "David Ogilvy Barrie", "itemDescription": "British art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Ogilvy_Barrie", "wikipedia_page": {"main": "(Charles) David (Ogilvy) Barrie CBE (born 9 November 1953) is a former British diplomat, arts administrator and campaigner.  Now an author, he is the great great nephew of the playwright, Sir James Matthew Barrie.Barrie served in the British Diplomatic Service and Cabinet Office from 1975 to 1989, and was closely involved in Anglo-Irish relations, including the negotiations that led to the Anglo-Irish Agreement of 1985. From 1989 to 1992 he was Executive Director of The Japan Festival 1991 - a nationwide celebration of Japanese culture which took place in the UK in 1991.\nBarrie was Chair of the campaigning organisation Make Justice Work from 2010 to 2013 and Director of The Art Fund (formerly the National Art Collections Fund), the UK's largest independent art charity, from 1992 to 2009.  In 2001, admission fees to all national museums and galleries were scrapped, after a four-year campaign by The Art Fund to persuade the government to give non-charging institutions the right to reclaim VAT. Barrie delivered the Arthur Batchelor Lecture at the University of East Anglia in May 2010.In 2014, his book, Sextant: A Voyage Guided by the Stars and the Men who Mapped the World's Oceans, was published in the UK by William Collins and by William Morrow in the USA. It has been translated into Italian and German.Barrie is Chair of Ruskin Today and has been a trustee of the Ruskin Foundation since 1996.  He has also served as a Council member of the Museums, Libraries and Archives Council and a trustee of the charity Butterfly Conservation.  He edited an abridged edition of John Ruskin's Modern Painters which was published by Andre Deutsch in 1987.\nBarrie was appointed Commander of the Order of the British Empire (CBE) in the 2010 New Year Honours for his services to the visual arts.Barrie's second book on navigation, Incredible Journeys: Exploring the Wonders of Animal Navigation, was published in April 2019 by Hodder & Stoughton. It was published in May 2019 in North America by The Experiment under the title Supernavigators: Exploring the Wonders of How Animals Find Their Way.", "link_mentions": [{"page": "2010 New Year Honours", "response": ["* David Ogilvy Barrie – lately Director, Art Fund. For services to the Visual Arts."]}, {"page": "Charles David Ogilvy Barrie", "response": ["#REDIRECT David Ogilvy Barrie"]}, {"page": "David Barry", "response": ["*David Ogilvy Barrie (born 1953), British diplomat and arts administrator"]}]}}