{"wiki_id": "http://www.wikidata.org/entity/Q5230433", "itemLabel": "David A. Bailey", "itemDescription": "British art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/David_A._Bailey", "wikipedia_page": {"main": "David A. Bailey  (born 1961 in London), is a British Afro-Caribbean curator, photographer, writer and cultural facilitator, living and working in London. Among his main concerns are the notions of diaspora and black representation in art.", "link_mentions": [{"page": "Institute of Contemporary Arts", "response": ["*1995:  Bear and Five Easy Pieces, films by future Turner Prize-winning artist Steve McQueen, are included in the exhibition Mirage: Enigmas of Race, Difference and Desire, curated by David A. Bailey and organised with InIVA. Other artists whose work is included are Sonia Boyce, Eddie George and Trevor Mathison of Black Audio Film Collective, Renée Green, Lyle Ashton Harris, Isaac Julien, Marc Latamie, and Glenn Ligon. An accompanying symposium, Working with Fanon, debates the legacy of Frantz Fanon within the context of art and visual representation. Speakers include Homi K. Bhabha, Paul Gilroy, Stuart Hall, bell hooks, Isaac Julien, Kobena Mercer, Raoul Peck, Ntozake Shange, Françoise Versages, and Lola Young."]}, {"page": "Sonia Boyce", "response": ["*In 2007, Boyce, David A. Bailey and Ian Baucom jointly received the History of British Art Book Prize (USA) for the edited volume Shades of Black: Assembling Black Art in 1980s Britain, published by Duke University Press in collaboration with Iniva and AAVAA.", "*David A. Bailey, Kobena Mercer, Catherine Ugwu (eds), MIRAGE: Enigmas of Race, Difference and Desire, ICA, 1995. ."]}, {"page": "David Bailey (disambiguation)", "response": ["* David A. Bailey (born 1961), British Afro-Caribbean curator, photographer and writer"]}, {"page": "Bailey (surname)", "response": ["*** David A. Bailey (born 1961), British Afro-Caribbean curator, photographer and writer"]}, {"page": "Meta Vaux Warrick Fuller", "response": ["* Powell, Richard J. and David A. Bailey. Rhapsodies in Black: Art of the Harlem Renaissance, 1997."]}, {"page": "Horace Ové", "response": ["In 2004, the exhibition Pressure: Photographs by Horace Ové, described as \"the first in-depth look at his photographic back catalogue\", curated by Jim Waters and David A. Bailey, in association with Autograph ABP,\"Horace Ove 'Pressure'\", University of Brighton Gallery, 2004. toured Britain, starting at Nottingham Castle museum,\"Pressure | Photographs by Horace Ové - invite card\", Diaspora Artists.\"Photographs By Horace Ové At Nottingham Castle\", ArtDaily. moving to the University of Brighton Gallery, the Norwich Gallery, Aberystwyth Arts Centre in Wales and the Arts Depot in London. A 34-page publication by the curators contained an extract from an interview with Ové by Michael McMillian.\"Pressure | Photographs by Horace Ové\" at Diaspora Artists. According to a description of that exhibition:"]}, {"page": "BLK Art Group", "response": ["*  David A. Bailey - contemporary"]}, {"page": "2007 Birthday Honours", "response": ["* David A. Bailey, Curator and Founder, Autograph–Association of Black Photographers. For services to the Visual Arts."]}, {"page": "Fowokan", "response": ["*1985: From Generation to Generation, Midlands Art Centre, Birmingham. Installation by the OBAALA Arts Cooperative including David A. Bailey, Sonia Boyce, Shakka Dedi, George Kelly, and Keith Piper.\"Kelly, George Fowokan\", aavad.com."]}, {"page": "Petrine Archer-Straw", "response": ["Archer-Straw published numerous books and catalogues, including Eugene Palmer (October 1993, in collaboration with Jane Norrie), New World Imagery (October 1995), Negrophilia: Avant-Garde Paris and Black Culture in the 1920s (November 2000),Michael Rogin, \"Mon Pays\", London Review of Books, Vol. 23, No. 4, 22 February 2001, pp. 21–23. Fifty Years, Fifty Artists (May 2001), and Back to Black: Art, Cinema and the Racial Imaginary (June 2005, in collaboration with David A. Bailey, and Richard J. Powell).List of Books published by Petrine Archer-Straw, on Amazon. Additionally, she taught at the Courtauld Institute at the University of London (lecturer, 1994–95), served as the first Head of Art History at the Edna Manley College of the Visual and Performing Arts in Jamaica (2002–05), and served as a Post-Doctoral Research Fellow (2005–06) and Visiting Lecturer (from 2006) at Cornell University in Ithaca, New York. She completed a two-year residency as a faculty guest in the Telluride House at Cornell. She taught the Caribbean Dialogs Live! course at TASP 2008 (Telluride Association Summer Program) with Professor Petrina Dacres.Telluride Association TASP 2008 Brochure. "]}, {"page": "Vanley Burke", "response": ["*Archer-Straw, Petrine, David A. Bailey and R. Powell (2005), Back to Black: Art, Cinema & the Racial Imaginary. London: Whitechapel Art Gallery.  "]}, {"page": "Alissandra Cummins", "response": ["* Curating in the Caribbean, The Green Box, Berlin 2012 (ed. with David A. Bailey MBE, Axel Lapp, Allison Thompson). "]}, {"page": "Mike Dibb", "response": ["In November 2011, Dibb participated in a Masterclass in conversation with David A. Bailey as part of the International Curators Forum two-day intervention at the Arnolfini in Bristol."]}, {"page": "Axel Lapp", "response": ["*Curating in the Caribbean, The Green Box, Berlin 2012 (ed. with David A. Bailey MBE, Allison Thompson, Alissandra Cummins). "]}, {"page": "Alison Donnell", "response": ["Donnell's essay \"Visibility, Violence and Voice? Attitudes to Veiling Post-11 September\" appeared in Veil: Veiling, Representation and Contemporary Art arranged by David A. Bailey.* The essay gained attention because of its discussion of the veil as a symbol of political and cultural identity in the Muslim world. Donnell discusses how the West's concentration on the veil diverts attention from other issues such as legal rights, education and access to healthcare, connecting to debates within Islamic feminism."]}, {"page": "Chila Kumari Burman", "response": ["**Owusu, Kwesi, Nadir Tharani, Pratibha Parmar, Jide Odusina, Keith Piper, Donald Rodney, David A. Bailey, Ruhi Hamid, Armet Francis, Pitika Ntuli (eds), Storms of the Heart: An Anthology of Black Arts & Culture (Camden Press, 1988)"]}, {"page": "Paul Dash", "response": ["He was a member of the black artists movement in the 1970s and 1980s,David A. Bailey, \"visual and plastic arts\", in  Alison Donnell, Companion to Contemporary Black British Culture, Routledge, 2002, p. 313. exhibiting his work in a number of exhibitions (including Caribbean Artists in England at the Commonwealth Institute in 1971, although Eddie Chambers notes that Dash was unlisted).Eddie Chambers, Black British Artists in British Art: A History Since the 1950s, I.B. Tauris, 2014, pp. 57–58. Dash's work was on display at the New English Art Club's Annual Exhibition at the Mall Galleries, London, and, most recently, features in the 2015 exhibition No Colour Bar: Black British Art in Action 1960–1990 at the Guildhall Art Gallery, City of London.FHALMA (Friends of the Huntley Archives at London Metropolitan Archives, \"The Artists' Profiles\" , Huntleys Online."]}, {"page": "Brenda Agard", "response": ["Agard was also a member of \"The Black Photographers Group\", a project organized by artist and BLK Art Group co-founder Eddie Chambers, whose objective was \"the credible insertion of black photography into mainstream art and photographic venues in Britain.\" Others in the group besides Chambers and Agard included: David A. Bailey, Marc Boothe, Godfrey Brown, Dave Lewis, Ingrid Pollard, and Suzanne Roden."]}, {"page": "Ten.8", "response": ["In the context of its physical location amongst the migrant communities of Birmingham, Ten.8 promoted the struggle for British Black and Asian social justice as reflected in photographic and media representations.Dewdney A. \"That was then, this is now: The legacy of ten:8\". In Photographies. 4(2):261–264. Ten.8, vol. 2, no. 3, 1992, titled Critical Decade: Black British Photography in the 80s, was an important edition as a retrospective guide to recent black cultural politics in times of rapid and turbulent change in which theory and practice dealt with race, politics and representation. An introduction written by David A. Bailey and Stuart Hall, is followed by their essay \"The Vertigo of Displacement: shifts within black documentary practices\",  and other contributions by Kobena Mercer, Isaac Julian, Pratibha Parmar, Aurat Shakti, Mumtaz Karimjee, Amina Patel, Gilane Tawadros, Eddie Chambers, Paul Gilroy and Sonali Fernando that pursue multiple issues of identity and the black photographic image, skin colour, diaspora, blackness as a cultural icon, racial confrontation and sexuality."]}]}}