{"wiki_id": "http://www.wikidata.org/entity/Q5237373", "itemLabel": "David McGurk", "itemDescription": "English association football player and manager", "wikipedia_url": "https://en.wikipedia.org/wiki/David_McGurk", "wikipedia_page": {"main": "David Michael McGurk (born 30 September 1982) is an English football manager and former professional player who played as a centre-back. He played in the Football League for Darlington and York City. He is the manager of Northern Premier League Premier Division club Hyde United.\nMcGurk started his career with the Darlington's youth system and broke into the first team during the 2001–02 season. He was eventually loaned out to York City in the Conference National in 2004. He had two further loan periods with York before joining the club permanently in 2006, after making 62 appearances for Darlington. He played for the team in the play-offs in his first season and won the club's Clubman of the Year award in his second season. He played in the 2009 FA Trophy Final at Wembley Stadium and returned to the stadium for the 2010 Conference Premier play-off Final.", "link_mentions": [{"page": "Daniel Parslow", "response": ["Parslow was signed by Conference National club York City on 18 August 2006 following a successful trial. He made his debut as a 67th-minute substitute for James Dudgeon in York's 3–0 away defeat by Crawley Town on 9 September 2006. At different points during 2006–07 Parslow lost his place in the team to David McGurk, Jason Goodliffe and János Kovács, but started York's last seven fixtures, including both legs of the 2–1 aggregate defeat by Morecambe in the play-off semi-final. Having finished 2006–07 with 26 appearances for York, the club exercised their option to extend his contract for 2007–08 in May 2007."]}, {"page": "Michael Ingham (footballer)", "response": ["Utook over the captaincy following the absences of Daniel Parslow and David McGurk from the team in March 2010. He signed a new two-year contract with York in the same month. Ingham was named as York's Clubman of the Year for 2009–10 before their final home match of the season prior to play-offs against Grays Athletic. He was also named the Community Player of the Year, which recognised his community work in York. He played in both legs of York's play-off semi-final victory over Luton Town, which finished 2–0 on aggregate. He started in the 2010 Conference Premier play-off Final at Wembley Stadium on 16 May, which York lost 3–1 to Oxford. He finished the season with 55 appearances for York."]}, {"page": "Hyde United F.C.", "response": ["|align=\"left\"|  David McGurk||align=centre|Manager||align=centre| 2019||align=centre| 2021"]}, {"page": "Lev Yalcin", "response": ["He attracted interest from abroad, training with Antalyaspor and Denizlespor for a period in 2004, and Royal Antwerp were also believed to be ready to give him a trial. He was reported to have joined Darlington on a one-month loan in September 2004, but it was later revealed that the deal, which saw David McGurk join York on loan, was only one way and Yalcin had not moved. He went on to score his first goal for York against Morecambe in October 2004. He had a trial at Yeovil Town in January 2005. He signed a new contract with York in June 2005."]}, {"page": "2006–07 York City F.C. season", "response": ["|David McGurk", "!scope=row|David McGurk"]}, {"page": "McGurk", "response": ["*David McGurk (born 1982), English footballer"]}, {"page": "Dave McGurk", "response": ["#REDIRECT David McGurk "]}, {"page": "2007–08 York City F.C. season", "response": ["34 players made at least one appearance in nationally organised first-team competition, and there were 16 different goalscorers. Winger Martyn Woolford played in all 57 first-team matches over the season. Onome Sodje and Woolford finished as joint top scorers with 17 goals each. Sodje scored 14 in league competition, two in the FA Cup and one in the Conference League Cup, while Woolford scored 14 in league competition, two in the FA Trophy and one in the Conference League Cup. The winner of the Clubman of the Year award was David McGurk.", "!scope=row|David McGurk"]}]}}