{"wiki_id": "http://www.wikidata.org/entity/Q5231233", "itemLabel": "David Beatty, 2nd Earl Beatty", "itemDescription": "British politician (1905-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Beatty,_2nd_Earl_Beatty", "wikipedia_page": {"main": "David Field Beatty, 2nd Earl Beatty,  (22 February 1905 – 10 June 1972), styled Viscount Borodale from 1919 to 1936, was a Royal Navy officer and British Conservative Party politician.", "link_mentions": [{"page": "Gloria Guinness", "response": ["Among Guinness's lovers were David Beatty, 2nd Earl Beatty, and the British ambassador to France Duff Cooper,Etti (Mrs Arpad) Plesch, Horses & Husbands: The Memoirs of Etti Plesch, Dorset: The Dovecote Press, 2007, page 155. who wrote of her, \"I have never loved anybody physically so much or been so supremely satisfied\".Bill Patten, My Three Fathers: And the Elegant Deceptions of My Mother, Susan Mary Alsop (Public Affairs, 2008), page 127."]}, {"page": "David Beatty", "response": ["*David Beatty, 2nd Earl Beatty (1905–1972), British politician, eldest son of the 1st Earl Beatty"]}, {"page": "Beatty", "response": ["* David Beatty, 2nd Earl Beatty (1905-1972), British politician"]}, {"page": "Chicheley Hall", "response": ["Chicheley Hall, Chicheley, Buckinghamshire, England is a country house built in the first quarter of the 18th century. The client was Sir John Chester, the main architect was Francis Smith of Warwick and the architectural style is Baroque. Later owners included David Beatty, 2nd Earl Beatty and the Royal Society. Chicheley Hall is a Grade I listed building.", "The house was purchased from the Chester family in 1952 by David Beatty, 2nd Earl Beatty. Beatty, son of Admiral Lord Beatty, began a large restoration programme and finally employed the renowned interior decorator Felix Harboard, famed for his work at Luttrellstown Castle near Dublin. Harboard's classical colour schemes accentuating moulding and panelling perfectly suit the house. Chicheley Hall remained the home of the 2nd Earl's fourth wife, Diane, after his death. She remarried, to Sir John Nutting, and was later the chairman of the Georgian Group. Together, they ran the house as a venue for weddings and conferences, and as a filming location. The house represented Bletchley Park in the 2001 film Enigma."]}, {"page": "Marshall Field", "response": ["Field married twice. In 1863, he married Nannie Douglas Scott of Ironton, Ohio. They had two sons and a daughter, but one son, Louis, died in 1866 as an infant. The surviving children were Marshall Field Jr. and Ethel Field. Their son, Marshall Jr. (1868–1905), married Albertine Huck, and they were the parents of Gwendolyn Mary Field, who married Sir Archibald Charles Edmonstone, 6th Baronet. Field's Ethel was married twice: first to Arthur Magie Tree, to whom she bore one son, Ronald Tree, and then in 1901 to David Beatty, 1st Earl Beatty, to whom she bore two sons, David Beatty, 2nd Earl Beatty and Peter."]}, {"page": "David Field Beatty, 2nd Earl Beatty", "response": ["#REDIRECT David Beatty, 2nd Earl Beatty"]}, {"page": "David Field Beatty", "response": ["#REDIRECT David Beatty, 2nd Earl Beatty"]}, {"page": "Ronald Tree", "response": ["Tree's American-born father, Arthur Tree, was an English gentleman of leisure, self-identifying as a 'horse breeder and farmer' and son of Lambert Tree, a former U.S. minister to Russia. His mother, Ethel Field, was a daughter of Marshall Field, a co-founder of Marshall Field's department store in Chicago, Illinois.Come to the Party - TIME Born in Eastbourne, he was educated at Winchester College in England.‘TREE, Ronald’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016Human Rights Commission & Marietta Peabody Tree biography  Two months after his parents divorced in 1901, Tree's mother married her lover, Capt. David Beatty, the future 1st Earl Beatty and First Sea Lord. His half-siblings were David Beatty, 2nd Earl Beatty, and the Hon Peter Beatty; he also had two full siblings, both of whom died in infancy. After the divorce, he remained with his father at Ashorne Hill House, Warwickshire, as the court had given Arthur custody of Ronald. There he was tutored by a convent girl from Cork in Ireland, his governess Kate Walsh, who was also Arthur's partner, the mother of six further half-siblings of Ronald; Dennis (1898-1969), Kathleen (1901–1975), Patrick (1905-1991), James (190?-194?), Gerald (19??-1916) and Elizabeth Waring (1914-1991). Arthur and Kate were never married and while Ronald grew up with them at Ashorne Hill, he would have had little or no contact with a Catholic, half-Irish and illegitimate family after Arthur's death in 1914, when Ronald was already at the cusp of adulthood. Dennis, Kathleen and Patrick all had issue including notable architect, Michael Blower."]}, {"page": "Peter Beatty", "response": ["Beatty died on 26 October 1949 after falling from a sixth floor window of The Ritz Hotel, London, having been informed that he was going completely blind. At the time of his death, Beatty's eyesight had failed to the point where he needed to be in the company of his valet to walk.  He was wearing his pyjamas and a robe when he told his valet he was going to the sixth floor of the Ritz to visit friends there. He then fell six floors to his death at the rear of the hotel. Beatty's most recent eye surgery was on 5 September. His brother, David Beatty, 2nd Earl Beatty, with whom he was living at the time, said that after the surgery Beatty began to lose what little sight he had left, but gave no indication that he intended to kill himself. A coroner's verdict was that Beatty had committed suicide, since he had recently learned that there was no hope of saving his sight."]}]}}