{"wiki_id": "http://www.wikidata.org/entity/Q5237216", "itemLabel": "David Mathew", "itemDescription": "Catholic archbishop", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Mathew_(bishop)", "wikipedia_page": {"main": "David James Mathew (15 January 1902 – 12 December 1975) was an English Roman Catholic bishop and historian.\nMathew was born at Lyme Regis, Dorset, and educated at the naval colleges at Osborne and Dartmouth. He served as a midshipman in the Royal Navy at the end of World War I.He entered Balliol College, Oxford, in 1920 and received a degree in modern history in 1923. He then went to Beda College in Rome, with the intention of seeking ordination and with a plan to enter the Carthusian order. He was ordained in 1929, and spent 10 months as a novice at St Hugh's Charterhouse, Parkminster, West Sussex, before concluding that he did not have a monastic vocation.After service at St David's Cathedral, Cardiff, he went to London to become chaplain to the Roman Catholic community at the University of London. In 1938 he was appointed Auxiliary Bishop of Westminster. He served in London through the Blitz. In 1945 he was named apostolic visitor to Ethiopia, and in 1946 apostolic delegate to the British colonies in Africa.This brought his consecration to the titular Archbishopric of Apamea. His service in Africa was successful, and he helped carry out the Vatican's policy of preparing for the appointment of native African bishops, acting as principal consecrator of Laurean Rugambwa after his appointment as Apostolic Vicar of Lower Kenya: Rugambwa later became the first African cardinal since the days of the early church.Upon Mathew's return to England in 1953, he was appointed bishop-in-ordinary to the British Armed Forces. (He had refused an appointment to the nunciature in Bern, hoping to receive an English diocese). Mathew retired in 1963 and spent the rest of his life writing history. He died in London on 12 December 1975, aged 73.", "link_mentions": [{"page": "Hilaire Belloc", "response": ["* Woodruff, Douglas, ed., For Hilaire Belloc, Sheed & Ward, 1942 [with contributions by Douglas Jerrold, Ronald Knox, Arnold Lunn, C. A. J. Armstrong, Christopher Hollis, Gervase Matthew, David Mathew, J. B. Morton, W. A. Pantin, David Jones]."]}, {"page": "Bishopric of the Forces in Great Britain", "response": ["|align=center |1954 || align=center|1963 || David Mathew, Titular Archbishop of Apamea in Bithynia (1946.02.20 – 1975.12.12) || Previously Apostolic Delegate (papal diplomatic envoy) of British East and West Africa. Appointed on 16 April 1954. Resigned on 23 March 1963 and died on 12 December 1975."]}, {"page": "Ford Lectures", "response": ["* 1945–46 David Mathew, The Social Structure in Caroline England"]}, {"page": "Sir David Mathew", "response": ["thumb|250px|Effigy of Sir David Mathew, side-view from north, north aisle, Llandaff Cathedral", "thumb|250px|Full-length view of effigy of Sir David Mathew, Llandaff Cathedral", "thumb|250px|Crest on helm of effigy of Sir David Mathew, Llandaff Cathedral: a heathcock, of which the head is missing", "thumb|250px|Effigies of Sir William Mathew(d.1528) and his wife. The latest of three surviving Mathew family effigies at Llandaf CathedralEarliest effigy is of David Mathew, knight(d.1484), 2nd of Sir Christopher Mathew(d.1527), eldest son of Reyborne Mathew, 2nd son of Sir David", "Sir David Mathew (1400–1484; born Dafydd ap Mathew, was a Welsh Knight. He was Lord of Llandaff and Seneschal of Llandaff Cathedral, and one of the ten Great Barons of Glamorgan, a Marcher Lord. It was said he was one of the most distinguished men of his age  and a zealous supporter of the Yorkist cause. After saving the life of King Edward IV at the Battle of Towton in 1461, he was appointed Grand Standard Bearer of England and King Edward IV granted the use of 'Towton' on his arms.", "Sir David Mathew was the son of Mathew ap Ieuan (or Evan).Sir David was the first to adopt the modern style of Welsh surname, \"Mathew\", having discontinued use of the traditional Welsh patronymic \"ap Mathew\", meaning \"son of Mathew\". The name, properly \"Mathew\", was spelt by Sir David's descendants variously, e.g., in the Funeral Entries, preserved in the Record Tower at Dublin, vol. vii., p. 18, the name of the founder of the Irish branch of the family is entered as \"George Matthewes, Oct. 1670\". Admiral Mathew of Llandaff Court, and all his descendants, spelt their name invariably \"Mathews\".", "Two different arms are recorded as having been used by the Mathew family, both consisting of a lion rampant, but with differing tinctures. The branch seated at Llandaff, thus the senior line, is generally ascribed Or, a lion rampant sable, whilst the branch seated at Radyr, descended from Sir David Mathew's younger brother, is generally ascribed Sable, a lion rampant argent. Yet confusingly the 1980 heraldic restoration of the Mathew tombs at Llandaff carried out by Hugh P. Mathew, who was recognised by the College of Arms as having proved his direct descent from Sir David Mathew, has resulted in the Radyr coat being painted on the tomb of Sir Christopher, who was head of the Llandaff branch. Rev. Murray Mathew (1895) assigns to Sir David the Radyr coat. Moreover, the Earls Landaff used the coat of the Llandaff branch even though they were descended from the Radyr branch. Unfortunately the tomb of Sir David bears no heraldry by which the confusion might be resolved. The arms of Radyr Sable, a lion rampant argent were supposedly adopted in honour of the White Rose, according to Rev Murray Mathew.", "The crest is also not without confusion, being given variously as a \"heathcock\" (another name for partridge, of the pheasant family), a \"moorcock\", a \"fieldcock\", (a vague term possibly denoting grouse), a blackcock, (of the grouse family) and is shown on the Earl Landaff memorial in a form akin to a farmyard cock or rooster. The effigy of Sir David does however show most of the bird forming the crest of his helm upon which he rests his head, but it is missing the head. The feet are short and sturdy, suggesting a grouse-type bird and are not the long legs of a roosterThe heathcock crest may be observed on the helm of the effigy of Sir David Mathew in Llandaff Cathedral. The \"Genealogy of the Earls of Landaff\" gives the crest for Sir David as a blackcock proper, although the Earls of Landaff bore as crest a \"heathcock proper\", which is however depicted akin to a rooster on the mural monument erected in 1987 in memory of Thomas James Mathew(d.1862), son and heir of Francis Mathew, 2nd Earl Landaff in the Mathew Chapel, Llandaff () A gilded bird, probably a dove, is used as a foot-rest in the effigy of St Teilo in Llandaff Cathedral.", "* (Historical romance of life of Sir David Mathew)"]}, {"page": "David Mathew", "response": ["David Mathew may refer to:", "* Sir David Mathew (1400–1484), Welsh knight and English Standard Bearer", "* David Mathew (bishop) (1902–1975), English bishop and historian", "* David Mathew (Big Brother), joint winner of Big Brother Australia 2005"]}, {"page": "Gervase Mathew", "response": ["Anthony Gervase Mathew (14 March 1905 – 4 April 1976) was a Catholic priest and British academic.  A member of the Dominican Order, he taught at Blackfriars Hall, University of Oxford. His elder brother, David Mathew, served as a bishop in the Roman Catholic Church."]}]}}