{"wiki_id": "http://www.wikidata.org/entity/Q5237551", "itemLabel": "David Michie", "itemDescription": "British artist (1928-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Michie", "wikipedia_page": {"main": "David Michie OBE, RSA, PSSA, FRSA, RGI (30 November 1928 – 24 August 2015) was a Scottish artist of international stature.\n\n", "link_mentions": [{"page": "Edinburgh College of Art", "response": ["* David Michie, artist"]}, {"page": "Anne Redpath", "response": ["The following year, 1920, she married James Michie, an architect, and they went to live in Pas-de-Calais where her first two sons were born; the eldest of whom is the painter and sculptor Alastair Michie. In 1924, they moved to the South of France, and in 1928, had a third son: now David Michie the artist."]}, {"page": "Michie", "response": ["* David Michie (1928–2015), Scottish painter"]}, {"page": "List of painters by name beginning with \"M\"", "response": ["*David Michie (1928–2015), Scottish artist"]}, {"page": "List of Scottish artists", "response": ["*David Michie (1928–2015), painter"]}, {"page": "David McClure (artist)", "response": ["McClure studied at Edinburgh College of Art from the late 1940s, where his contemporaries included Elizabeth Blackadder, John Houston and David Michie and where students came under the influences of the major Edinburgh figures of the time such as Anne Redpath, William Gillies, John Maxwell, William MacTaggart and Robert Henderson Blyth. His art was enriched by his regard for the French Post-Impressionists masters such as Matisse, Gauguin, Picasso, Braque, Chagall and Redon, painterly and richly coloured in a long-standing Scottish tradition. Always informed by an intellectual rigour and reference to the wider history of art, literature and music, it is generally celebratory of the good things in life and nature."]}, {"page": "2015 in art", "response": ["** David Michie, 87, French-born British painter. (death announced on this date)"]}, {"page": "Deaths in August 2015", "response": ["*David Michie, 87, French-born British painter.David Michie 1928 – 2015 "]}, {"page": "Michie, David", "response": ["#redirectDavid Michie"]}]}}