{"wiki_id": "http://www.wikidata.org/entity/Q5236701", "itemLabel": "David Lloyd", "itemDescription": "English former cricketer, coach, and commentator (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Lloyd_(cricketer)", "wikipedia_page": {"main": "David Lloyd (born 18 March 1947) is an English former cricket player, umpire, coach and commentator, who played county cricket for Lancashire County Cricket Club and Test and One Day International cricket for the English cricket team. He also played semi-professional football for Accrington Stanley. He is known through the cricketing world as \"Bumble\" because of the ostensible similarity between his facial profile and those of the Bumblies, characters from Michael Bentine's children's television programmes.A left-handed batsman and left-arm spin bowler, he played nine Tests, with a highest score of 214 not out, and eight One Day International matches. In first-class cricket he was a successful all-rounder, scoring a career aggregate of more than 19,000 runs and taking 237 wickets. He captained his county from 1973 to 1977. Following his retirement as a player, he became a first-class umpire, and subsequently Lancashire and England cricket coach, resigning the latter post following the 1999 Cricket World Cup. He then became a renowned cricket commentator for Test Match Special, and later Sky Sports. He is also an author, journalist and columnist. In December 2021, Lloyd announced his retirement from commentating.", "link_mentions": [{"page": "Accrington", "response": ["*David Lloyd, cricketer, now a pundit for Sky Sports"]}, {"page": "March 18", "response": ["*  1947   – David Lloyd, English cricketer, journalist, and sportscaster"]}, {"page": "David Gower", "response": ["Gower made his debut for Leicestershire on 30 July 1975, during that season's County Championship, against Lancashire at Stanley Park, Blackpool. Winning the toss, Lancashire chose to bat first and amassed 259 thanks largely to a century by David Lloyd, who would later become Gower's co-commentator. Gower, batting at number seven, scored 32 before he was dismissed by Ken Shuttleworth, Leicestershire making 321 and taking a first-innings lead. Lloyd made 90 in the second innings as Lancashire declared on 305, with Gower taking one catch to dismiss Jack Simmons for 17. The match, lasting only three days with 100 overs as a maximum limit imposed on both teams for each innings, ended in a draw, with Leicestershire reaching 90 without Gower getting to bat again. Gower continued to make little impression during the rest of the 1975 season, playing in only two more matches and ending the season with 65 runs at 13.00. He enjoyed greater success in his debut List A season, playing in eight matches, scoring 175 runs at 25.00 with two fifties."]}, {"page": "Colin Cowdrey", "response": ["Cowdrey showed he had lost none of his timing and that his bat was as straight as ever until he was bowled behind his legs by Thomson (2/45) for 22. In the second innings he volunteered to open with David Lloyd instead of the badly bruised Brian Luckhurst. Cowdrey was dropped by Ian Redpath off Lillee, hit on the arm, survived a confident appeal by Rod Marsh before he was finally caught lbw by Thomson for 41, his highest score of the series. After the Second Test Cowdrey made 78 and took 2/27 against South Australia. Before the Third Test at Melbourne Frank Tyson recalled \"Colin Cowdrey and John Edrich were unable to practice on Christmas Eve – mainly because of the drizzling rain but also because Cowdrey wanted to spend his birthday in comparative peace. Since both batsmen wanted to feel the ball on bat before the Test, I volunteered the use of the Hawthorn Indoor Cricket Centre, in which I was a partner, for a two-hour work-out on Christmas morning. It was quite a contrast to open the children's presents in the early hours and to open the bowling at the two English batsmen before lunch. My fifteen old son, Philip, thought the latter experience to be quite the best of his Christmas presents\".Tyson, p. 85 He played his 114th and last Test at Melbourne, and opened the innings again as Lloyd was injured, but only made 7. Even so, England made 529 and won by an innings, with Cowdrey dismissing Rick McCosker for his 120th catch. He was given a warm farewell by his fans in \"an impromptu little gathering on the outfield in front of the banner reading 'M.C.G. FANS THANK COLIN – 6 TOURS'. The central figure, wearing a large straw sun-hat, was signing endless autographs, posing for photographs and exchanging friendly talk with young and old in the way that has made him as popular a cricketer as has ever visited Australia\".Swanton, p. 183"]}, {"page": "List of sports announcers", "response": ["* David Lloyd – Sky Sports 1990–1992 & 1999–present, BBC Radio 1991–1995", "* David Lloyd – BBC Radio 1979-2004"]}, {"page": "Barmy Army", "response": ["Throughout the 1990s, increased spending power, via a stronger British Pound at the time, enabled fans to take the song overseas when following tours of the English national cricket team. Because of that particular song, and the fact that it seemed to represent English fans' activity of standing in the hot sun, drinking lager all day until they were sunburnt and unwell, it became a description as well as a song. David Lloyd and Ian Botham used the tag to describe the supporters whilst commentating for Sky Sports during England's tours from 1993 to 1995."]}, {"page": "Hyndburn", "response": ["* David Lloyd: 6 July 2018."]}, {"page": "Test Match Special", "response": ["* David Lloyd (\"Bumble\") (1981–1991)"]}, {"page": "Graeme Hick", "response": ["By the time the 1986 season was out, the possibility of Hick's playing at Test level was being taken seriously, and the debate was shifting from whether he would play international cricket to which country he would represent. At the time, Zimbabwe seemed a long way from Test status, so he set himself instead to fulfil the residency requirements for England qualification, and despite an offer of a four-year qualification period from New Zealand he opted to take the longer path of a seven-year wait to play for his newly adopted home. By the time he became eligible, public interest in his seeming destiny as a great batsman for country as well as county was intense; David Lloyd was later to write that he doubted \"any cricketer [had] ever come into the international game burdened by such impossible expectations\".", "David Lloyd also \"strongly fancied [Hick] to have a serious influence\" on the competition, but he was frustrated by Hick's reluctance to accept a flexible batting order, only with considerable difficulty at a \"frosty team meeting\" getting him to agree to drop down from three when required.", "David Lloyd noted, not altogether with approval, that other players would rally around Hick protectively, and that \"in Alec Stewart he had a man who would champion his cause endlessly\"."]}, {"page": "Nasser Hussain", "response": ["Hussain was picked again for a Test series against India in the summer of 1996. The number 3 batting position had been troublesome for England for some time. England had tried all manner of combinations at No. 3, from the left-field Jason Gallian to the veteran Robin Smith, via the temperamentally suspect pairing of Graeme Hick and Mark Ramprakash. \"A lot is made of your batting position,\" Hussain recalled to Cricinfo, \"but I always felt, and I did back then when David Lloyd rang me up and asked me to bat No. 3, that if you're good enough to be playing Test cricket, you should be good enough to move from No. 5 to No. 3\".", "Within hours of Hussain announcing his retirement from cricket, it was confirmed that he would join the Sky Sports commentary team on a full-time basis alongside other former England captains Bob Willis, David Gower and Ian Botham and his former England coach David Lloyd. \"We now have the most experienced line-up ever seen in a commentary box\", said Vic Wakeling of Sky. \"Four former England captains with over 400 Tests, 20,000 runs, and 700 wickets between them – and each is a former Wisden Cricketer of the Year.\" In August 2011, in a match between India and England, comments made by Hussain against the Indian side created a stir among some cricket fans: \"I would say the difference between the two side is the fielding. England are all-round a good fielding side. I do believe that India have few... 3 or 4 very good fielders and one or two donkeys in the field still.\"", "He is one of Sky Cricket's leading commentators alongside Michael Atherton, David Lloyd, Ian Ward and Rob Key."]}, {"page": "List of cricket commentators", "response": ["|  David Lloyd "]}, {"page": "Lancashire County Cricket Club", "response": ["Jack Bond became Lancashire captain in 1968 and remained in the position until 1972. During his tenure, Lancashire performed well in the championship, finishing third in 1970 and 1971. His biggest triumph as captain was the five one day trophies he secured during his five-year captaincy. Farokh Engineer joined Lancashire in 1968, and Clive Lloyd joined in 1969; together Lloyd and Engineer helped establish Lancashire as one of the best one day sides in England. The silverware included a hat-trick of Gillette Cups (1970–72) and the Sunday League twice in successive seasons (1969–1970). Mainstays of the successful one day side included Clive Lloyd, David Lloyd, Barry Wood, Harry Pilling, Frank Hayes, Peter Lever, Ken Shuttleworth, David Hughes and Jack Simmons. In the Gillette Cup semi-final against Gloucestershire in 1971, David Hughes walked to the crease at 8.45pm and hit 24 from an over in near darkness to win the match. David Lloyd was captain from 1973 to 1977 and secured Lancashire's fourth Gillette Cup in 1975, and coming runners up in 1974 and 1976. However, in the late 1970s, the team that had been so dominant in the one day format began to break up. Despite boasting international players such as Lloyd and Engineer, Lancashire's first-class performances never matched the success of the limited overs team. Retrieved on 20 October 2007."]}, {"page": "List of One Day International cricket records", "response": ["| 31 August 1974 || David Lloyd||  ||  || Scorecard || "]}, {"page": "Inzamam-ul-Haq", "response": ["Handpicked by former Pakistan captain Imran Khan for the 1992 Cricket World Cup in Australia and New Zealand, 22-year-old Inzamam was relatively unheard of before the tournament. To the surprise of many he was persevered with throughout the tournament, coming in at various positions in the batting line-up, despite not being very successful early on. Yet it was his performances at the most crucial stage of the competition that made fans and summarisers take note. Inzamam rose to fame in Pakistan's dramatic semi-final against New Zealand at Auckland. With his side in a precarious position, chasing 262 against an impressive New Zealand side, he hit a fiery 60 run innings from just 37 balls to rescue his side and guide them into the final.New Zealand v Pakistan– Cricinfo. Retrieved 23 August 2007Inzi announces his arrival– Cricinfo. Retrieved 23 August 2007 The innings was regarded as one of the finest World Cup performances. He hit a massive six in that match which was described by David Lloyd as the shot of the tournament."]}, {"page": "Ken Barrington", "response": ["Barrington managed the Derrick Robins XI tour of South Africa, a multiracial cricket team led by Brian Close and including Younis Ahmed, John Shepherd and Gordon Greenidge in an attempt to restore cricket links with South Africa. When they arrived in Cape Town he found that \"all the lads I coached twenty years ago are now big businessmen\" and he received a warm welcome.p. 148, Peel He managed another Derek Robins XI under David Lloyd the next year and although the cricket was a success they failed to re-establish international cricket in South Africa and the attempt to integrate cricket in South Africa failed.pp. 147–149, Peel"]}, {"page": "Jonathan Agnew", "response": ["On his first-class debut against Lancashire in August 1978, the 18-year-old Agnew bowled to England international David Lloyd, an opening batsman with nine Test caps. Reported in Wisden Cricketers' Almanack, Lloyd \"was halfway through a forward defensive push when his off stump was despatched halfway towards the Leicestershire wicket-keeper.\" Agnew took one wicket in each innings of the match, and did not bat; Leicestershire won by an innings."]}, {"page": "International cricket in South Africa from 1971 to 1981", "response": ["The members of touring party were (England unless stated): Phil Carrick, Trevor Chappell (Australia), Geoff Cope, John Douglas (Australia), Frank Hayes, Mike Hendrick, Geoff Howarth (New Zealand), Andrew Kennedy, Peter Lee, David Lloyd (captain), Derek Randall, Phil Slocombe, David Steele, Fred Titmus, Roger Tolchard, Gary Troup (New Zealand), Dav Whatmore (Australia)."]}, {"page": "Bob Woolmer", "response": ["Woolmer was a strong candidate to replace David Lloyd as coach of England in 1999 but wanted a break from cricket and was reluctant to lead England in a tour of South Africa so soon after having relinquished the South African coaching job. thumb|right|Woolmer speaking at a cricket dinner in Cape Town in December 1999"]}, {"page": "List of International cricket families", "response": ["*David Lloyd"]}, {"page": "Ian Bell", "response": ["Bell married wife Chantal in 2011. They honeymooned in the Maldives. She was described by David Lloyd as \"A star of a missus.\" He is a football fan and an Aston Villa supporter and can be seen regularly at Villa Park during games."]}, {"page": "Alan Mullally", "response": ["Mullally was a poor batsman, and more often than not occupied the No. 11 position in the England batting line-up. However, he struck an aggressive 16 off 15 balls, including 3 cross-batted fours off Glenn McGrath, to help England to a 12-run win against Australia at Melbourne in 1998/99.Long live the tail, Cricinfo, Retrieved on 17 May 2009 His highest Test score of 24 against Pakistan featured several airborne boundaries off Wasim Akram. Allegedly the then England coach David Lloyd had offered Mullally 30 pints of Guinness to score 30 in that match.The Jack of all rabbits, Cricinfo, Retrieved on 14 August 2020"]}, {"page": "Graeme Fowler", "response": ["He is the only batsman to score two complete hundreds in a match with the aid of a runner. Playing for Lancashire at Southport in 1982, he strained his thigh while fielding on the first day during Warwickshire's innings of 523–4 declared, but batted without a runner to score 26 not out at stumps.  He then scored exactly 100 before lunch on the second day with David Lloyd as his runner. In the second innings, Ian Folley ran for him (and acknowledged the crowd's applause for the century) when Fowler scored 128 not out on the third day. In 1987, Fowler scored an unbeaten century in a Sunday League match against Somerset, despite an injury which forced him to bat with a runner.1987 Lancashire v Somerset - Old Trafford , Matt Proctor, Old Trafford Cricket Ground, Manchester]. Retrieved 26 August 2011."]}, {"page": "List of nicknames used in cricket", "response": ["* David Lloyd – Bumble"]}, {"page": "Stan Worthington", "response": ["Worthington with Derbyshire stayed for a couple of seasons after the Second World War and then played Minor counties cricket for Northumberland.Stan Worthington at Cricket Archive He was Lancashire coach in the sixties, nurturing players like Harry Pilling. David Lloyd said he used to coach in a trilby, a cravat and a cigarette holder.Sky Sports Cricket The Cricket Lockdown Vodcast broadcast 11 June 2020 Lloyd says “he ruled the place with a rod of iron, he was feared by the players.”"]}, {"page": "David Lloyd", "response": ["David Lloyd may refer to:", "* David Lloyd (biographer) (1635–1692), author of Lloyd's Memoirs of Excellent Personages", "* David Lloyd (tenor) (1912–1969), British tenor", "* David Lloyd (writer) (1934–2009), American television writer", "* David Lloyd (comics) (born 1950), illustrator of the graphic novel V for Vendetta", "* David Lloyd (actor) (born 1955), English actor and screenwriter", "* David Lloyd (broadcaster), British radio broadcaster", "* David Lloyd (musician), singer with Uropa Lula", "* David Lloyd (sportscaster), SportsCenter anchor for ESPN", "* David Lloyd (footballer, born 1872), for Thames Ironworks", "* David Lloyd (footballer, born 1928) (1928–2000), for York City", "* David Lloyd (riflemaker and sportsman) (1910–1996)", "* David Lloyd (cricketer), (born 1947), known as \"Bumble\", England Test cricketer, coach, and commentator", "* David Lloyd (cricketer, born 1992), Glamorgan cricketer", "* David Lloyd (tennis) (born 1948), founder of the David Lloyd Tennis Clubs", "* David Lloyd (squash player) (born 1965)", "* David Lloyd (Dean of St Asaph) (1597–1663), Welsh cleric and author of The Legend of Captain Jones", "* David Lloyd (priest) (c. 1688–1747?), Welsh cleric and translator", "* David Lloyd (judge) (1656–1731), chief justice of colonial Pennsylvania", "* David Lloyd (botanist) (1937–2006), New Zealand plant scientist and victim of poisoning scandal", "* David Lloyd (diplomat) (born 1940), British ambassador to Slovenia", "* David Lloyd (Welsh politician) (born 1956), Welsh politician", "* David Lloyd (chemist) (born 1974), Irish chemist and Vice Chancellor of the University of South Australia", "* David Lloyd (academic), professor of English and political activist", "* David Lloyd (police commissioner), British police commissioner", "* David Lloyd Leisure, a franchise of gym and racquet clubs in UK and western Europe", "*David Lloyd Jones (disambiguation)", "*David Lloyd George (1863–1945), Prime Minister of the United Kingdom during World War I"]}, {"page": "Charlie Hallows", "response": ["He coached at Merchant Taylors' Boys' School, Crosby, Belvedere College, Dublin, and Kimberley High School in South Africa, before being appointed coach at Worcestershire in 1957.\"Worcestershire's new coach\", The Cricketer, 27 April 1957, p. 101. He later took up the same role at Lancashire, retiring at the age of 74 in 1969. David Lloyd says that he was headhunted by the county.Sky Sports Cricket The Cricket Lockdown Vodcast broadcast 11 June 2020 "]}, {"page": "Gary Keedy", "response": ["Keedy was signed by Lancashire's then-coach David Lloyd in a motorway service station. Although it took time for him to become a leading light of the Lancashire attack, he was awarded his county cap in 2000. It was in 2003 that Keedy first started to impress observers, taking sixty wickets in the County Championship as Lancashire narrowly missed out on their first Championship title since 1934 to Sussex. Since then he has remained on the periphery of England selection. He was considered unlucky not to win a place to tour Sri Lanka in 2003-4. The selectors chose Glamorgan's Robert Croft instead."]}, {"page": "Nine's Wide World of Sports", "response": ["* David Lloyd (2006–07, 2013–14, 2014–15 and 2015 Ashes in the UK)"]}, {"page": "Barry Wood (cricketer)", "response": ["Wood was born in Ossett, Yorkshire, England. He made his first-class debut for Yorkshire in 1964 but, due to limited opportunities, made the switch across the Pennines to Lancashire in 1966, where he became the first ever Yorkshireman to score two Roses hundreds (reaching his century with a six on both occasions) in the same season against his native county. In the 1970s, by winning more Man of the Match gold awards than any other player in the history of the game, he was arguably the most valuable player of a stellar Lancashire team that were the undisputed one day kings of English cricket. This record was finally broken by Graham Gooch. That side was captained by Jack Bond and included a number of international players: Clive Lloyd, David Lloyd and Peter Lever. This great Lancashire team won six trophies in six years – the Players County League in 1969, the John Player League in 1970 and the Gillette Cup in 1970, 1971, 1972 and 1975. Wood's highest first-class score was 198 v Glamorgan and he still holds the record at Lancashire for a fifth wicket partnership of 249 with Andy Kennedy against Warwickshire at Edgbaston in 1971."]}]}}