{"wiki_id": "http://www.wikidata.org/entity/Q5234984", "itemLabel": "David Higgins", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Higgins_(composer)", "wikipedia_page": {"main": "David Roger Higgins (September 11, 1938 – August 13, 2006) was a composer and choral conductor. Born in Sheffield, England, he began teaching music at the age of 22. During his time in Sheffield he was the organist of the Sheffield University Church and musical director of Opera 14. In 1974, he was appointed organist and choirmaster of St Oswald's Church, Durham, a position he held until his death in 2006. In 1983 a fire was started in the Organ Loft at the church resulting in the total destruction of the Harrison & Harrison Organ then in the building. This resulted in the design and installation of a new 3 manual Peter Collins organ at the rear of the church (speaking directly down the nave), built to Higgins' specification.\nHiggins' numerous compositions mainly concentrate on Anglican Sacred Music, although there is also repertoire for organ. His collected works were published in three volumes in 1999 by St Oswald's, with one piece - \"Author of Life Divine\" having also been published by the RSCM as the title piece to a small anthology.", "link_mentions": [{"page": "September 11", "response": ["*1938 – David Higgins, English composer and conductor (d. 2006)"]}, {"page": "David Higgins", "response": ["David Higgins may refer to:", "* David Higgins (composer) (1938–2006), composer and choral conductor", "* David Higgins (golfer) (born 1972), Irish professional golfer", "* David Higgins (archer) (born 1968), Australian Paralympic archer", "* David Higgins (astronomer) (born 1961), Australian amateur astronomer", "* David Higgins (businessman) (born 1954), chairman of United Utilities", "* David Higgins (merchant) (died 1783), ship's captain, merchant, early settler and political figure on St John's Island (later Prince Edward Island)", "* David Higgins (rally driver) (born 1972), British rally driver", "* David Higgins (rower) (born 1947), American rower at the 1968 Summer Olympics", "* David Higgins (sport shooter) (born 1994), American sport shooter", "* David Higgins (politician) (1789–1873), politician and judge from the U.S. State of Ohio", "* David Higgins (Event Promoter) (born 1979), Boxing Promoter from New Zealand", "* [David Higgins (Artist)] (born 1956), Australian Artist"]}, {"page": "Will Todd", "response": ["Todd was born in County Durham, attended Durham School and joined the choir of St Oswald's Church, Durham under its choirmaster David Higgins. He went on to study music at the University of Bristol. He is a pianist and regularly performs with his trio, and this played a large role in one of his best-known works, his Mass in Blue."]}, {"page": "St Oswald's Church, Durham", "response": ["In 1984, the organ and part of the chancel were destroyed by fire. A new organ was built by Peter Collins to the specifications of the organist David Higgins, and installed in a new gallery at the west end of the church. The organ was restored in 2019. ", "* David Higgins, organist and choirmaster from 1974 to 2006"]}]}}