{"wiki_id": "http://www.wikidata.org/entity/Q5233996", "itemLabel": "David Galloway", "itemDescription": "Welsh rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Galloway_(rugby_league)", "wikipedia_page": {"main": "David Galloway (fourth ¼ 1884 – 22 February 1913) was a Welsh professional rugby league footballer who played in the 1900s and 1910s. He played at representative level for Wales, and at club level for Treherbert RLFC and Hull FC, as a forward (prior to the specialist positions of; prop, hooker, second-row, loose forward), during the era of contested scrums. Treherbert RLFC completed only 12-matches during the 1909–10 season, and as defaulters, they were prevented from playing in the 1910–11 season, by which time both Alfred Francis, and David Galloway had joined Hull FC.", "link_mentions": [{"page": "David Galloway", "response": ["David Galloway may refer to:", "* David Galloway (rugby league) (1884–1913), rugby league footballer of the 1900s and 1910s", "* David Galloway (footballer) (1905–1979), association football player", "* David Galloway (writer) (born 1937), American novelist, journalist, curator", "*David Galloway (golfer) (born 1951), Australian professional golfer", "* David Galloway (American football) (born 1959), former American football player"]}, {"page": "List of defunct rugby league clubs", "response": ["*David Galloway (#9) for Wales 1909 and 1910 against England (2 caps) "]}, {"page": "Anita Gale, Baroness Gale", "response": ["Gale is the grand-niece of the rugby league footballer who played in the 1900s and 1910s for Wales, Treherbert RLFC, and Hull FC; David Galloway."]}, {"page": "Alfred Francis", "response": ["Hull Kingston Rovers first became aware of Francis when he scored a try in Treherbert RLFC's 10–22 defeat by Hull Kingston Rovers during the 1909–10 season, but he was thought by Hull Kingston Rovers to be too small, so they decided against signing him. An official of Hull Kingston Rovers then recommended him to the Hull F.C. chairman who travelled to Wales, decided that Francis' size wasn't an issue, and signed him for Hull F.C. for 75 gold sovereigns (based on increases in average earnings, this would be approximately £27,720 in 2016) Treherbert RLFC completed only 12-matches during the 1909–10 season, and as defaulters, they were prevented from playing in the 1910–11 season, by which time both Alfred Francis, and David Galloway had joined Hull FC."]}, {"page": "Treherbert RLFC", "response": ["Treherbert Rugby League Football Club was a professional rugby league club based in Treherbert, Wales playing in the Welsh League and Northern Union. Based at the Athletic Ground, Treherbert were one of the first professional Welsh teams, formed in 1908 but folding after just two seasons. Treherbert also produced a single player, David Galloway, who gained international caps directly from the team.", "Treherbert's second season was also their last, Barry, Aberdare and Mid-Rhondda had all already folded after just a single season, leaving only three clubs to contest the Welsh League. The season was a poor experience on and off the pitch, starting with a 10-22 loss to Hull Kingston Rovers, in which Alfred Francis scored one of Treherbert's two tries, which was followed by a further 11 straight losses. To complicate matters further, the attendance figures at home matches were poor, last minute team changes were frequent and their club secretary, H.R. Jones, resigned during the season. The only good news the club received was when one of their forwards, David Galloway was selected for the Wales national team, in a late 1909 away encounter with England. Galloway did enough to impress as four months later he was reselected for the national team again, again against England, but this time played on home soil at Ebbw Vale's Bridge End Field.Gate (1986), pg. 141", "*David Galloway won two caps for Wales while at Treherbert in 1909 and 1910 against England, and joined Hull F.C. in 1910"]}, {"page": "David Galloway (rugby)", "response": ["#REDIRECT David Galloway (rugby league)"]}]}}