{"wiki_id": "http://www.wikidata.org/entity/Q5231602", "itemLabel": "David Bower", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Bower_(politician)", "wikipedia_page": {"main": "David Bower (11 April 1819 – 6 July 1898) was a South Australian colonial merchant, politician and Commissioner of Public Works.\nBower was born at Upper Mill near Saddleworth, Yorkshire. In 1841 he emigrated to the Port Phillip District (now Victoria), and after a varied experience in New Zealand and New South Wales, finally settled in South Australia in 1847, where he established a successful business as a timber merchant at Port Adelaide.\nOn 1 March 1865 Bower was returned to the South Australian House of Assembly as member for Port Adelaide, a seat he held until 4 April 1870. In 1875 was again elected for Port Adelaide, which he represented until 18 March 1887. Bower was Commissioner of Public Works in the John Cox Bray Ministry from April to June 1884.  He died 6 July 1898.", "link_mentions": [{"page": "David Bower", "response": ["David Bower (born 1969) is a Welsh actor, best known for his role as David in the hit romantic comedy Four Weddings and a Funeral. Born in Wrexham, North Wales, he is deaf and a BSL user and took his degree in the British Theatre of the Deaf (established by Pat Keysell). After university he joined what became the Signdance Collective working as sign dancer and choreographer.  The collective was re-established in 2001 with Bower as Artistic Director and Isolte Avila as Dance Director. In 2012 the collective is devising a new production \"Desire\", featuring the songs of the band Dead Days Beyond Help, which will premier at the Warehouse Theatre, Croydon from 13–19 April 2012.", "Bower's deafness started with complications at birth which could have been fatal, but was not diagnosed until he was five years old. From that age he wore body hearing aids, bulky transistor radio-style devices. He later attended the Mary Hare Grammar School near his home in Berkshire. Although supported by a very caring family, Bower found himself bullied by both hearing children and other deaf children. In 1986, after attending a loud rock music gig he developed tinnitus which affected the nature of his residual hearing. His deafness progressed and years later he became profoundly deaf.Coming Home, interview with David Bower in Connect Magazine, Spring 2012, published by NDCS. He also attended Ysgol Bryn Alyn school in Wrexham.", "*Signdance Collective David Bower's U.K based Company"]}, {"page": "Electoral district of Port Adelaide", "response": ["| rowspan=3|David Bower", "| rowspan=3|David Bower "]}, {"page": "Members of the South Australian House of Assembly, 1865–1868", "response": ["|| David Bower || Port Adelaide || 1865–1870, 1875–1887"]}, {"page": "Members of the South Australian House of Assembly, 1868–1870", "response": ["|| David Bower || Port Adelaide || 1865–1870, 1875–1887"]}, {"page": "Members of the South Australian House of Assembly, 1875–1878", "response": ["|| David Bower || Port Adelaide || 1865–1870, 1875–1887"]}, {"page": "Bower, South Australia", "response": ["The area was originally the territory of the Ngadjuri people. The name Bower honours David Bower, a South Australian Member of Parliament (1865 - 1887) who donated land in the state for institutional purposes. By 1916, Bower had become a dispatch centre for mallee timber and roots. These were loaded at the railway station on the Morgan railway line and sent to Adelaide. Bower Public School operated in the town between 1917 and 1960, replacing an earlier Lutheran school forcibly closed during World War I."]}, {"page": "Members of the South Australian House of Assembly, 1878–1881", "response": ["|| David Bower || Port Adelaide || 1865–1870, 1875–1887"]}, {"page": "Members of the South Australian House of Assembly, 1881–1884", "response": ["|| David Bower || Port Adelaide || 1865–1870, 1875–1887"]}, {"page": "Members of the South Australian House of Assembly, 1884–1887", "response": ["|| David Bower || Port Adelaide || 1865–1870, 1875–1887"]}, {"page": "William Mattinson", "response": ["He was a member for Port Adelaide in the South Australian House of Assembly from April 1881 to April 1890. His colleague for the first term was David Bower and George Hopkins for the second. He stood unsuccessfully for the seat in 1890 and again in 1896."]}, {"page": "Commissioner of Public Works (South Australia)", "response": ["| David Bower"]}, {"page": "Cheltenham Cemetery (South Australia)", "response": ["* David Bower (politician)"]}]}}