{"wiki_id": "http://www.wikidata.org/entity/Q5246496", "itemLabel": "Dean Sullivan", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dean_Sullivan", "wikipedia_page": {"main": "Dean Sullivan (born 7 June 1955) is an English actor and director, best known for playing Jimmy Corkhill in the Channel 4 soap opera Brookside (1986–2003).", "link_mentions": [{"page": "Lancaster University", "response": ["* Dean Sullivan, Teaching Degree – Actor (Played Jimmy Corkhill in Brookside)"]}, {"page": "Brookside (TV series)", "response": ["This year also saw the introduction of the soap's longest-running character Jimmy Corkhill, played by Dean Sullivan. Initially a bit-part player, Jimmy was the brother of Billy Corkhill. His early appearances usually saw the character in many moneymaking schemes, along with characters such as Barry Grant, Terry Sullivan and Thomas 'Sinbad' Sweeney (Michael Starke). Jimmy Corkhill's first high-profile storyline involved an insurance job on his brother Billy's house, whilst the Corkhills and most of the Close were attending son Rod's graduation from police training. Another famous Brookside storyline occurred in November 1987 and involved Doreen and Billy's crumbling marriage reaching breaking point. When Doreen admitted to Billy she had been sexually propositioned in return to pay off the family's spiralling debts, in an iconic scene, Billy drove around the Close, churning up his neighbour's gardens in a fit of anger, and a distraught Doreen walked out on her desperate family.", "Billy Corkhill's children had remained in the series after his departure. Tracey became romantically involved with Barry Grant, leading to her aborting his baby, and Rod married Diana Spence (Paula Frances) and left the police force after being viciously beaten on his wedding night. The Rogers' divorced after Chrissy (Eithne Browne) walked out on the family to join teacher training college on Sammy and Owen's wedding day. By the end of 1991, Jimmy Corkhill (Dean Sullivan), had become a series regular and he played a central part in the show. He was joined by his estranged wife Jackie (Sue Jenkins), who appeared from 1991 working at Dixon's Trading Post, and his elder children Little Jimmy Corkhill (George Christopher) and Lindsey (Claire Sweeney) were initially seen as recurring characters. Jimmy was used to further explore the dark and devastating effects of serious drug addiction, beginning in 1993. The long-running story saw Jimmy descend into uncontrollable drug abuse, climaxing in a cocaine-induced car crash that killed Frank Rogers in November 1993. Teenager Tony Dixon (Mark Lennock) was also involved in the crash and eventually died in February 1994, sparking a feud between Jimmy and Ron that continued until the end of the series. Jimmy had taken part in endless fundraising with Ron's family in an attempt to help Tony recover from what doctors had diagnosed as a persistent vegetative state, but at Tony's funeral he could not hide his guilt any longer and he finally confessed to Ron.", "It was reported in November 2008 that the 13 properties were to be auctioned off collectively, with a guide price of £550,000–£600,000. There was speculation at this time that the series may be resurrected as Dean Sullivan (who played Jimmy Corkhill) had himself attempted to purchase the Close to revive Brookside. However, an unnamed Liverpool-based buyer purchased all 13 properties on 17 December 2008 for £735,000, although by this time the Close was in a state of severe disrepair, and speculation mounted as to what would happen to the disintegrating properties. "]}, {"page": "Daryl Denham", "response": ["In September 2013 Denham produced a new musical he'd written called 'Stand Up'. It told the stories of three comedians at different stages in their lives and starred Darren Day, Lionel Blair, Billy Pearce and Dean Sullivan. The production ran at the Floral Pavilion in New Brighton to positive reviews and showcased twenty new songs Denham had written with co-producer Maurice Cheetham."]}, {"page": "Jimmy Corkhill", "response": ["Jimmy Corkhill is a fictional character from Brookside, played by Dean Sullivan, who joined the series in 1986. Jimmy originally appeared on a recurring basis appearing alongside his on-screen brother, Billy (John McArdle), before becoming a regular character, featured in major storylines, and remained in the show until its end 17 years later. He is cited as one of the show's most popular characters, and was the longest-featured character. Jimmy has often been cited as a lovable rogue by television critics.", "Jimmy is played by Dean Sullivan. He later became the longest-serving cast member in the serial's history. Sullivan was initially only contracted to appear in six episodes as a recurring character, but due to his popularity he was taken on full-time and remained for seventeen years. When the serial was cancelled, Sullivan said he felt bereaved and it was like losing an old friend.", "The Northern Echo praised the character, stating: \"In criminal and activist Jimmy Corkhill, Dean Sullivan has created one of the soap's most memorable characters. He remains one of the few links with the Brookie heyday when it was regularly in the news. After nearly 20 years, he's closely identified by the public with the character, which was originally only scheduled to appear in six episodes.\""]}, {"page": "List of Brookside characters", "response": ["|Jimmy Corkhill || Dean Sullivan || 1986–2003"]}, {"page": "The British Soap Awards", "response": ["| \"Best Actor\" || Ross Kemp (Grant Mitchell in EastEnders) || Dean Sullivan (Jimmy Corkhill in Brookside)David Neilson (Roy Cropper in Coronation Street)Kelvin Fletcher (Andy Sugden in Emmerdale)", "| \"Best On-Screen Partnership\" || David Neilson & Julie Hesmondhalgh (Roy Cropper & Hayley Patterson in Coronation Street) || Dean Sullivan & Sue Jenkins (Jimmy & Jackie Corkhill in Brookside)Bill Tarmey & Liz Dawn (Jack & Vera Duckworth in Coronation Street)Dominic Brunt & Lisa Riley (Paddy Kirk & Mandy Dingle in Emmerdale)", "| \"Best On-Screen Partnership\" || Dean Sullivan & Sue Jenkins (Jimmy & Jackie Corkhill in Brookside)", "| \"Lifetime Achievement Award\" || Dean Sullivan (Jimmy Corkhill in Brookside)"]}, {"page": "Andrew Agnew (actor)", "response": ["Andrew appeared in the Christmas Pantomime Sleeping Beauty at Swansea's Grand Theatre between December 2009 and January 2010 starring alongside Malandra Burrows and Helen Fraser. before reprise the role in Basingstoke with Wendy Craig and Abi Titmuss.  He has also appeared twice in New Brighton in Aladdin with Dean Sullivan & Kelsey-Beth Crossley and reprised the role of Wishee alongside Bill Ward in 2018/19 season, this time also as Director."]}, {"page": "Trevor Jordache", "response": ["Once Mandy and Beth realised Trevor was dead, Mandy became very distant, but Beth hatched a plan to dispose of Trevor's body.  When night fell the two wrapped him in bin liners and Beth buried him under the patio.  Two years later however, an underground leak forced the area to be dug up and Trevor's body was found by Eddie Banks (Paul Broughton) and Jimmy Corkhill (Dean Sullivan)."]}, {"page": "Barry Grant", "response": ["In 2003, Usher reprised the role to appear in the final episode of Brookside following its cancellation. His final story features fellow former character Lindsey. The episode was broadcast on 4 November 2003. Their return story reveals that Barry and Lindsey formed a relationship off-screen and they seek the blessing of Lindsey's father, Jimmy Corkhill (Dean Sullivan). However, Barry soon gets caught up in the drama on Brookside Close involving gangster Jack Michaelson (Paul Duckworth)."]}, {"page": "Frank Rogers (Brookside)", "response": ["Frank later enters a relationship with Lyn McLoughlin. He has to fight off unwanted advances from Lyn's sister Bev McLoughlin (Sarah White). Frank's departure storyline saw him killed in a car crash caused by a \"drug-crazed\" Jimmy Corkhill (Dean Sullivan). The accident happens as Frank tries to make it to his wedding reception to Lyn McLoughlin (Sharon Power). Frank dies just after reaching hospital, and his other passenger Tony Dixon (Mark Lennock) is in a coma for three months before dying in hospital. Brookside's executive producer Mal Young defended the decision to kill Frank because it created emotional drama. He told a reporter from The Observer that \"people say they cried when Frank Rogers died. I feel that makes me successful. I feel it was therefore good drama. It is not cruel because it is not real. You do like to play with your emotions. That's entertainment.\""]}, {"page": "Tim O'Leary", "response": ["In his early years, Tim was portrayed as a \"bad lad\" and school bully. Tim dislikes Danny Simpson (Andrew Butler) because he is a snob and bullies him. He forms a friendship with Leo Johnson (Steven Cole) but becomes a bad influence on him. Tim begins to commit petty crimes such as breaking into the Simpson's house and stealing a computer. He then hides a load of stolen alcopops at the local youth group. Jimmy Corkhill (Dean Sullivan) identifies Tim as the culprit but decides to help him avoid being caught by the police. Tim's bad behaviour eventually leads to his expulsion from school, despite his mother works at the local school as a governor. Writers continued to use Jimmy in transforming Tim's character and he is portrayed investing more time trying to correct Tim's wayward behaviour. He offers Tim work delivering pizzas but is shocked to discover he has been overcharging customers for their meal. Jimmy's wife Jackie Corkhill (Sue Jenkins) tries to discourage him from helping Tim anymore. Jimmy ignores her wishes because he does not want Tim to end up like his son Little Jimmy Corkhill (George Christopher).", "Despite this Mick allowed Tinhead and Emily to continue living at No 5, until he decided to move away from the close after splitting up with Yvonne. Luckily, Jimmy Corkhill (Dean Sullivan) took pity on them and offered to let both Tinhead and Emily stay at his house. Tinhead almost ended up in prison again after supplying Ron Dixon (Vince Earl) with the gun used to shoot Clint Moffat, but Jimmy persuade Ron to tell police he got the gun from Sotto. Jimmy encouraged Tinhead to stay away from crime, but he found it impossible to get a good job with a prison record."]}, {"page": "Jim Manley (artist)", "response": ["*Dean Sullivan"]}, {"page": "Mike Dixon (Brookside)", "response": ["Writers created a romance storyline between Mike and his neighbour Lindsey Corkhill (Claire Sweeney). She is already married to Gary Stanlow (Andrew Fillis), a drug dealer who neglects Lindsey in favour of his crime business. Sweeney told Victoria Ross from Inside Soap that Lindsey \"fell in love with Mike almost at first sight\". She defended the affair noting that Lindsey was young, her husband was elsewhere and their connection means \"there's really nothing she can do about it, even though she's being unfaithful to Gary.\" Mike and Lindsey's first kiss was filmed on location on a Mersey Ferry and Sweeney revealed she was nervous about filming in public. After their kiss the two continue their affair but keep it a secret from their families. Writers had created an extended feud between the Dixon and Corkhill families, especially between the patriarchs Ron and Jimmy Corkhill (Dean Sullivan). The latter caused the death of Mike's brother, Tony (Mark Lennock), in a car accident. Ron had never forgiven Jimmy and Sweeney added \"It's a bit of a Romeo and Juliet situation, because Ron hates everyone connected to Jimmy Corkhill.\""]}, {"page": "Billy Corkhill", "response": ["Billy Corkhill is a fictional character from the British Channel 4 soap opera Brookside, played by John McArdle. The character debuted on-screen during the episode broadcast on 27 August 1985. Billy was introduced as part of the show's new family, the Corkhills, consisting of Billy, his wife Doreen Corkhill (Kate Fitzgerald) and their teenage children Rod (Jason Hope) and Tracy Corkhill (Justine Kerrigan). Billy is characterised as the reluctant husband of Doreen, an aspiring woman who wants the Corkhills to own their own home. Her mission to present a good image for the family is marred by her secret spending which gets the family into debt. Writers explored their debt issues throughout Billy's early tenure. They portrayed him as desperate to provide, tampering with the electricity and committing fraud with the help of his brother Jimmy Corkhill (Dean Sullivan).", "A controversial story for the Corkhills was created when Tracy begins a romance with her geography teacher Peter Montague (Mark Draper). After the pair return from a skiing trip, Billy goes to the school and punches Peter. Billy is arrested for assault and later given a three month prison sentence, suspended for a year.Redmond 1987, p.75. At the time, Lucy O'Brien from The Guardian described it as the \"most dramatic analysis\" of child abuse on television. She added that \"pugnacious Billy\" had to face the fact his \"wayward daughter\" was in love with her teacher; the story subsequently played out over a \"tense month\". From this producers developed an issue lead story for the Corkhills, as they deal with the problems that arise from debts. Billy is sacked from his job at Pollocks because his court case garnered negative publicity. The Corkhills mounting debts result in their utilities being cut off and their television is repossessed.Kibble-White 2002, p.38. Billy tries to help his family out of debt by tampering with the electricity supply. This causes problems with his son Rod, who is training to be a police officer.Hayward 1991, p.12. Writers continued into to develop the story into 1987. Billy's brother, Jimmy Corkhill (Dean Sullivan) convinces him to stage a burglary at his home. They also steal from the Collins family to make it appear genuine. This upsets Doreen and she discovers the stolen property and the bank begin repossession proceedings.Kibble-White 2002, p.41. After all of Billy's crimes, McArdle told Johnson (TV Guide) that \"at one time I thought I couldn't live next door to Billy Corkhill.\" He added that the supermarket robbery would continue to be an issue for Billy, adding that the writers \"can bring that up at any time.\""]}, {"page": "Doreen Corkhill", "response": ["Writers used Doreen to portray the issues that arise from debts. The Corkhills face financial difficulties after Doreen free spending without thinking of the implications.Hayward 1991, p.12. Billy loses his job and their utilities are cut off and their television gets repossessed.Kibble-White 2002, p.38. Billy tries to help his family out of debt by tampering with the electricity supply. This causes issues with their son Rod, who is training to be a police officer. Writers continued into to develop the story into 1987. Billy's brother, Jimmy Corkhill (Dean Sullivan) convinces him to stage a burglary at his home and steal from the Collins family. This upsets Doreen and she discovers the stolen property and the bank begin repossession proceedings.Kibble-White 2002, p.41."]}, {"page": "Radio City Talk", "response": ["The original team of presenters on the station included actors Margi Clarke and Dean Sullivan, horse racing commentator and drive time presenter Paul Jacobs, football personalities Ian St John and John Aldridge, broadcaster Kim Hughes who presented breakfast with Phil Easton, veteran talk show hosts Pete Price and Roy Basnett, and newspaper journalists Larry Nield and Brian Reade. Trisha Goddard also hosted a Sunday evening show called Talk to Trisha, broadcast down-the-line from the presenter's home in Norwich."]}, {"page": "Diana Corkhill", "response": ["Diana and Rod this time opt for a quiet wedding ceremony at a registry office. They attempt to keep it a secret but Rod's grandmother, Julia Brogan (Gladys Ambrose) tells Rod's uncle Jimmy (Dean Sullivan) and aunt Jackie Corkhill (Sue Jenkins). Together they organise a surprise wedding party for Diana and Rod. Frances told a reporter from TVTimes that \"for once Julia's big mouth turns out to be a blessing!\" Frances explained that the ceremony was intentionally different to their cancelled wedding. It was supposed to be a \"white wedding\" with traditional attire and horses and carriages. Frances explained that Diana and Rod \"didn't want to tempt fate, so they planned a short simple one instead.\" The wedding was filmed in a conference room inside the studio at Mersey TV. Frances was \"relieved\" to become an official member of the Corkhill family. She added that Diana \"is very conventional and marriage is something she's always wanted. She is a home-maker and really loves Rod. I think they will be very happy together.\" This time Diana and Rod's marriage is successfully with their family in attendance."]}, {"page": "Tina Malone", "response": ["Malone runs her own acting school, To Be Frank Productions, in Manchester, where she lives. The school produces plays in local Liverpool theatres such as the Everyman Theatre. The drama school is named after her late father, Frank Malone. She also used to run an agency with Dean Sullivan called DSTM. Malone has stated that she suffers from obsessive compulsive disorder and bipolar disorder."]}, {"page": "St Margaret's Church of England Academy", "response": ["* Dean Sullivan, actor, best known for his role as Jimmy Corkhill in Brookside"]}, {"page": "List of longest-serving soap opera actors", "response": ["|Dean Sullivan || Jimmy Corkhill || Brookside || 1986, 1987, 1988–2003 ||  years ||"]}, {"page": "Lindsey Corkhill", "response": ["Lindsey was introduced as the daughter of Jimmy (Dean Sullivan) and Jackie Corkhill (Sue Jenkins). Sweeney created a good rapport with her on-screen parents. She felt like her time spent with Jenkins was like that she spent with her real mother. Writers created a series of long-running storylines for the character, following her reintroduction in 1995. Lindsey is accompanied by her young daughter, Kylie and is married to Gary Stanlow (Andrew Fillis). Writers initially characterised Lindsey with an attitude of moral superiority in comparison to the rest of the Corkhill family. Through her marriage to Gary, they portrayed the more recognisable Corkhill characteristics. Gary is a drug dealer and neglects his wife favouring his life of crime. She soon begins to crave affection elsewhere and falls in love with her neighbour Mike Dixon (Paul Byatt)."]}, {"page": "Sheila Grant", "response": ["Sheila Corkhill returned, without Billy, in the straight-to-video special The Lost Weekend in 1997. She returned again the following year another straight-to-video special, Friday the 13th, to attend the wedding of her niece-in-law Lindsey Corkhill (Claire Sweeney) and Peter Phelan (Samuel Kane), however she became caught up in trouble when her brother-in-law Jimmy (Dean Sullivan) is pursued by drug-dealers intent on killing him.  Here, she reveals to sister-in-law Jackie (Sue Jenkins) that she and Billy have split up after an argument over Billy's ex-wife Doreen (Kate Fitzgerald), although Jimmy mentioned that Billy and Sheila were \"still together\" in a conversation with neighbour Diane Murray (Bernie Nolan) in 2001. This was either a continuity error, or Billy and Sheila are presumed to have reconciled."]}, {"page": "Leo Johnson (Brookside)", "response": ["Before leaving for police college, Leo attended a party held at the Murray's.  Fifteen-year-old Adele (Katy Lamont) had fancied Leo for some time.  After he witnessed his girlfriend flirting with his neighbour Jimmy Corkhill (Dean Sullivan), Leo started to drink heavily and then was seduced by Adele and the two had unprotected sex.  Leo regretted having done so immediately and worried that if anyone were to find out it could compromise his career in the police."]}, {"page": "2003 in British television", "response": ["*10 May – The 2003 British Soap Awards (aired by ITV1 on 14 May) are presented in London by Des O'Connor and Melanie Sykes, during which actor Dean Sullivan is presented with a Special Achievement Award for his role as Jimmy Corkhill in Brookside. In a press interview held after the event, Sullivan urges Channel 4 not to axe Brookside, saying it \"would be mad\" to do so."]}, {"page": "1955 in British television", "response": ["* 7 June – Dean Sullivan, actor"]}, {"page": "It's Only TV...but I Like It", "response": ["| 2x02 || 2 March 2000 || Davina McCall and Dean Sullivan || Esther Rantzen and Max Beesley || TBC"]}, {"page": "Sinbad (Brookside)", "response": ["Sinbad was first introduced into the soap in September 1984, two years after the programme began. The character was introduced as a window cleaner and friend of Edna Cross (Betty Alberge), who would place bets on horse races for her behind her husband Harry's (Bill Dean) back. Aside from window cleaning, Sinbad took sidrlines in many illegitimate deals. Over Christmas 1984 he was seen with 'Trevor the turkey', selling it for £10, and then on delivery producing a live turkey knowing that residents including Sheila Grant (Sue Johnston) and Paul Collins (Jim Wiggins)  would be too sensitive to kill it, thus keeping the deposit for himself.  He later quipped that this was Trevor's third year of doing it.  The character was a long-time friend and associate of Jimmy Corkhill (Dean Sullivan). His nickname derived from his window-cleaning days and his reluctance to clean into the corners of the windows, instead cleaning a porthole-shape in the centre of the glass.  For several years the character was billed simply as 'Sinbad'."]}, {"page": "Jackie Corkhill", "response": ["Jackie was introduced as the long-suffering estranged wife of Jimmy Corkhill (Dean Sullivan) in 1991, even though the character was first mentioned as early as 1986 when Jimmy first appeared; she continued to be mentioned regularly for the next five years.  The two became one of the soaps most popular couples."]}, {"page": "Bullets and Daffodils", "response": ["Bullets and Daffodils is a musical about the life of the war poet Wilfred Owen, created by musician and composer Dean Johnson and directed by Dean Sullivan. The musical is based on Owen's poems set to music by Johnson, with the addition of new songs written by Johnson to help narrate the story of Owen's life."]}]}}