{"wiki_id": "http://www.wikidata.org/entity/Q524865", "itemLabel": "Herbert Druce", "itemDescription": "British entomologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Druce", "wikipedia_page": {"main": "Herbert Druce, FLS (14 July 1846, in London – 11 April 1913, in London) was an English entomologist. \nHis collections were acquired by Frederick DuCane Godman (1834–1919), Osbert Salvin (1835–1898), and James John Joicey (1870–1932) before being bequeathed to the Natural History Museum, London. He is not to be confused with his son, the English entomologist Hamilton Herbert Druce (1869 – 21 June 1922), who also worked on Lepidoptera.\n\n", "link_mentions": [{"page": "Arthur Gardiner Butler", "response": ["*With Herbert Druce (1846–1913), \"Descriptions of New Genera and Species of Lepidoptera from Costa Rica\". Cistula entomologica, 1: 95–118 (1872)."]}, {"page": "Druceiella", "response": ["The genus was named in honour of the entomologist Herbert Druce (1846 - 1913)."]}, {"page": "Manduca corallina", "response": ["Manduca corallina is a moth of the family Sphingidae first described by Herbert Druce in 1883. ", "Category:Taxa named by Herbert Druce"]}, {"page": "Taraka hamada", "response": ["Category:Taxa named by Herbert Druce"]}, {"page": "Erinnyis yucatana", "response": ["Erinnyis yucatana is a moth of the family Sphingidae first described by Herbert Druce in 1888. It is found from Mexico and Belize south to at least Costa Rica."]}, {"page": "Jamides caerulea", "response": ["Jamides caerulea, the royal cerulean, is a small butterfly that belongs to the lycaenids or blues family. It was described by Herbert Druce in 1873. It is found in the Indomalayan realm.Seitz, A., 1912-1927. Die Indo-Australien Tagfalter. Theclinae, Poritiinae, Hesperiidae. Grossschmetterlinge Erde 9: 799-1107, pls. 138-175.", "Category:Taxa named by Herbert Druce"]}, {"page": "Pachylia darceta", "response": ["Pachylia darceta is a moth of the family Sphingidae first described by Herbert Druce in 1881."]}, {"page": "Nacaduba angusta", "response": ["Nacaduba angusta, the white lineblue, is a lycaenid butterfly found in South Asia. The species was first described by Herbert Druce in 1873.", "Category:Taxa named by Herbert Druce"]}, {"page": "Prosotas aluta", "response": ["Prosotas aluta, the banded lineblue, is a species of blue butterfly (Lycaenidae) found in Asia. The species was first described by Herbert Druce in 1873."]}, {"page": "Calycopis isobeon", "response": ["Category:Taxa named by Herbert Druce"]}, {"page": "Stolidoptera tachasara", "response": ["Stolidoptera tachasara is a moth of the family Sphingidae first described by Herbert Druce in 1888."]}, {"page": "James John Joicey", "response": ["He acquired the Henley Grose-Smith collection in 1910. Two years later he bought the Herbert Druce collection. To house his growing collection, he founded the Hill Museum at his Witley home in 1913. Joicey employed curators, including Alfred Noakes (from 1906) and George Talbot (from 1915), with a staff of assistants."]}, {"page": "Allanwatsonia", "response": ["Allanwatsonia is a monotypic tiger moth genus in the family Erebidae erected by Douglas C. Ferguson in 1985. Its only species, Allanwatsonia hodeva, was first described by Herbert Druce in 1897. It is found in Mexico."]}, {"page": "Diaxanthia", "response": ["Diaxanthia is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1898. Its single species, Diaxanthia lucinia, was first described by Herbert Druce in 1884. It is found in Costa Rica."]}, {"page": "Disaulota", "response": ["Disaulota is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1900. Its single species, Disaulota leptalina, was first described by Herbert Druce in 1885. It is found in Costa Rica."]}, {"page": "Druce", "response": ["*Herbert Druce (1846–1913), British entomologist", "*Hamilton Herbert Druce (1869–1922), British entomologist, son of the above"]}, {"page": "Gonotrephes", "response": ["Gonotrephes is a monotypic moth genus erected by George Hampson in 1909 in subtribe Phaegopterina and family Erebidae. Its only species, Gonotrephes friga, was first described by Herbert Druce in 1909. It is found in Peru."]}, {"page": "Hiera", "response": ["Hiera is a monotypic moth genus in the subfamily Arctiinae. It contains the single species Hiera gyge, which is found in Panama. Both the genus and species were first described by Herbert Druce in 1885."]}, {"page": "Herbert Huntingdon Smith", "response": ["The very many new species collected by Herbert Huntingdon and Daisy W. Smith were described by Frederick DuCane Godman and Herbert Druce (Lepidoptera); Samuel Wendell Williston (Diptera); William Harris Ashmead and Ezra Townsend Cresson (Hymenoptera); George Charles Champion (Coleoptera); Philip Reese Uhler and William Lucas Distant (Hemiptera)."]}, {"page": "Hypocharis", "response": ["Hypocharis is a monotypic moth genus in the family Arctiidae erected by George Hampson in 1898. Its single species, Hypocharis clusia, was first described by Herbert Druce in 1897. It is found in the Amazon region."]}, {"page": "Metaxanthia", "response": ["Metaxanthia is a genus of moths in the family Erebidae. The genus was erected by Herbert Druce in 1899."]}, {"page": "Meterythrosia", "response": ["Meterythrosia is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1900. Its single species, Meterythrosia sangala, was first described by Herbert Druce in 1885. It is found in Guatemala."]}, {"page": "Neotrichura", "response": ["Neotrichura is a monotypic moth genus in the subfamily Arctiinae erected by Herbert Druce in 1896. Its single species, Neotrichura nigripes, was first described by Franciscus J. M. Heylaerts in 1890. It is found in Panama and the Brazilian states of Paraná and Rio de Janeiro."]}, {"page": "Neozatrephes", "response": ["Neozatrephes is a genus of moths in the family Erebidae. The genus was erected by Herbert Druce in 1893."]}, {"page": "Nephelosia", "response": ["Nephelosia is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1900. Its single species, Nephelosia caecina, was first described by Herbert Druce in 1897. It is found in Guatemala."]}, {"page": "Nodozana", "response": ["Nodozana is a genus of moths in the subfamily Arctiinae erected by Herbert Druce in 1899."]}, {"page": "Phaenarete (moth)", "response": ["Phaenarete is a monotypic moth genus in the subfamily Arctiinae. Its single species, Phaenarete diana, is found in Panama and Costa Rica. Both the genus and species were first described by Herbert Druce in 1896."]}, {"page": "Phaeosia", "response": ["Phaeosia is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1900. Its only species, Phaeosia lutea, was described by Herbert Druce in 1885. It is found in Guatemala and Mexico."]}, {"page": "Phoenicoprocta", "response": ["Phoenicoprocta is a genus of tiger moths in the family Erebidae. The genus was erected by Herbert Druce in 1898."]}, {"page": "Thrix", "response": ["Thrix is a monotypic butterfly genus in the family Lycaenidae first described by William Doherty in 1891. Its one species is Thrix scopula, which was first described by Herbert Druce in 1873. It is found in the Indomalayan realm (in Borneo, Thailand, Sumatra and Peninsular Malaya)."]}, {"page": "Pseudamastus", "response": ["Pseudamastus is a monotypic moth genus in the family Erebidae described by Hervé de Toulgoët in 1985. The genus contains only one species, Pseudamastus alsa, first described by Herbert Druce in 1890. It is found on Dominica, Guadeloupe and Martinique."]}, {"page": "Pseudocharis", "response": ["Pseudocharis is a genus of tiger moths in the family Erebidae. It was erected by Herbert Druce in 1884."]}, {"page": "Urolosia", "response": ["Urolosia is a genus of moths in the subfamily Arctiinae. The genus was erected by Herbert Druce in 1898."]}, {"page": "Pseudopompilia", "response": ["Pseudopompilia is a monotypic moth genus in the subfamily Arctiinae. Its single species, Pseudopompilia mimica, is found in the Amazon region. Both the genus and species were first described by Herbert Druce in 1898."]}, {"page": "Psilopleura", "response": ["Psilopleura is a genus of tiger moths in the family Erebidae. The genus was erected by Herbert Druce in 1898."]}, {"page": "Stenucha", "response": ["Stenucha is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1901. Its only species, Stenucha dolens, was first described by Herbert Druce in 1897. It is found in Mexico."]}, {"page": "Thyromolis", "response": ["Thyromolis is a monotypic moth genus in the family Erebidae erected by George Hampson in 1901. Its only species, Thyromolis pythia, was first described by Herbert Druce in 1900. It is found in French Guiana, Guyana, Bolivia and the Brazilian state of Amazonas."]}, {"page": "Xanthomis", "response": ["Xanthomis is a monotypic moth genus in the subfamily Arctiinae erected by George Hampson in 1898. Its single species, Xanthomis grandis, was first described by Herbert Druce in 1884. It is found in Costa Rica."]}, {"page": "Xanthophaeina", "response": ["Xanthophaeina is a monotypic moth genus in the family Erebidae erected by George Hampson. Its only species, Xanthophaeina levis, was first described by Herbert Druce in 1899. It is found in Colombia and Brazil."]}, {"page": "Cleoeromene", "response": ["Cleoeromene is a monotypic moth genus of the family Crambidae described by David E. Gaskin in 1986. It contains only one species, Cleoeromene smithi, described by Herbert Druce in 1896 which is found in south-western Mexico, including Guerrero."]}, {"page": "Procymbopteryx", "response": ["Procymbopteryx  is a monotypic moth genus of the family Crambidae erected by Eugene G. Munroe in 1961. Its only species, Procymbopteryx belialis, was first described by Herbert Druce in 1899. It is found in the Mexican state of Guerrero and the US state of Arizona."]}, {"page": "Argania (moth)", "response": ["Argania is a genus of moths of the family Erebidae. The genus was erected by Herbert Druce in 1891."]}]}}