{"wiki_id": "http://www.wikidata.org/entity/Q5247940", "itemLabel": "Debbie Isitt", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Debbie_Isitt", "wikipedia_page": {"main": "Debbie Isitt (born 7 February 1966) is an English comic writer, film director and performer.", "link_mentions": [{"page": "The Hundred and One Dalmatians", "response": ["The novel has been adapted for the stage by Debbie Isitt for the Belgrade Theatre, Coventry in 2000 (followed by productions at the Royal & Derngate, Northampton in 2007 and Birmingham Repertory Theatre in 2017), by Bryony Lavery for the Chichester Youth Theatre in 2014 and was devised by the company (directed by Sally Cookson) for Tobacco Factory Theatres in 2014. The novel was also adapted into a 2009 musical which opened in Minneapolis prior to a US tour. Another stage musical adaptation was due to open at Regent's Park Open Air Theatre in 2020, before being postponed to 2021 due to the COVID-19 pandemic."]}, {"page": "Hilaire Belloc", "response": ["The tale of \"Matilda who told lies and was burned to death\" was adapted into the play Matilda Liar! by Debbie Isitt. Quentin Blake, the illustrator, described Belloc as at one and the same time the overbearing adult and mischievous child. Roald Dahl was a follower. But Belloc has broader if sourer scope. For example, with Lord Lundy (who was \"far too freely moved to Tears\"):"]}, {"page": "List of film and television directors", "response": ["*Debbie Isitt"]}, {"page": "The Mark Steel Lectures", "response": ["The lectures were originally broadcast on BBC Radio 4 over three series between 1999 and 2002. Many of the arguments were illustrated by miniature sketches. These sketches featured Mark Steel, Martin Hyder, Mel Hudson, Carla Mendonça, Femi Elufowoju Junior and Debbie Isitt. The first series was subtitled \"A series of lectures about Englishmen who changed the course of history\", with the remaining two changing this to \"A series of lectures about people with a passion\". The first series was produced by Phil Clark; the others by Lucy Armitage. The lecture on Ludwig van Beethoven (2003) was nominated for a Sony Radio Comedy Award."]}, {"page": "List of musicals: M to Z", "response": ["|Debbie Isitt and Nicky Ager"]}, {"page": "Jeremy Hardy Speaks to the Nation", "response": ["There were a series of sketches and mock interviews carried out with his two guests.  Gordon Kennedy and Debbie Isitt were the two main guests, while other guests included Meera Syal, Rebecca Front, Alison Steadman, Stephen Frost, Miranda Richardson and Harriet Walter.", "|rowspan=\"6\"|1||1||How to Stay Alive for as Long as You Possibly Can||30 Sep 1993||Debbie Isitt, Stephen Frost", "|2||How to Be Truly Free||7 Oct 1993||Debbie Isitt, Stephen Frost", "|3||How to Earn Your Place in Heaven||14 Oct 1993||Debbie Isitt, Stephen Frost", "|4||How to Be an Adult||21 Oct 1993||Debbie Isitt, Stephen Frost", "|5||How to Have Sex||28 Oct 1993||Debbie Isitt, Stephen Frost", "|6||How to Know Your Place||4 Nov 1993||Debbie Isitt, Stephen Frost", "|rowspan=\"6\"|2||1||How to Be a Popular Figure Around Town||6 Oct 1994||Debbie Isitt, Gordon Kennedy", "|2||How to Have a Baby||13 Oct 1994||Debbie Isitt, Gordon Kennedy", "|3||How to Be a Leader of Men||20 Oct 1994||Debbie Isitt, Gordon Kennedy", "|4||How to Be a Father (1)||27 Oct 1994||Debbie Isitt, Gordon Kennedy, Ben Keaton", "|5||How to Be a Father (2)||3 Nov 1994||Debbie Isitt, Gordon Kennedy", "|6||How to Meet the Challenge of the 21st Century||10 Nov 1994||Debbie Isitt, Gordon Kennedy", "|rowspan=\"6\"|3||1||How to Be a Man||6 Feb 1997||Debbie Isitt, Gordon Kennedy", "|5||How to Keep Abreast of Developments||6 Mar 1997||Debbie Isitt, Gordon Kennedy", "|rowspan=\"6\"|4||1||How to Fight Fire with Fire||6 Sep 2001||Debbie Isitt, Gordon Kennedy", "|2||How to Live||20 Sep 2001||Debbie Isitt, Gordon Kennedy", "|3||How to Work||27 Sep 2001||Debbie Isitt, Gordon Kennedy", "|4||How to See Through Others' Eyes||4 Oct 2001||Debbie Isitt, Gordon Kennedy", "|5||How to Hand the World on to the Next Generation||11 Oct 2001||Debbie Isitt, Gordon Kennedy", "|6||When Jeremy Hardy Spoke to the Nation||18 Oct 2001||Graeme Garden, Debbie Isitt", "|rowspan=\"4\"|5||1||How to Be Yourself||8 Jan 2003||Debbie Isitt, Gordon Kennedy", "|2||How to Belong||15 Jan 2003||Debbie Isitt, Gordon Kennedy", "|3||How to Maximise Your Leisure||22 Jan 2003||Debbie Isitt, Gordon Kennedy", "|4||How to Be Young||29 Jan 2003||Debbie Isitt, Gordon Kennedy"]}, {"page": "List of female film and television directors", "response": ["* Debbie Isitt (UK)"]}, {"page": "Women's cinema", "response": ["Mamma Mia! directed by Phyllida Lloyd became the #5 highest-grossing film of 2008 and the highest-grossing film ever in the United Kingdom. Lloyd's next film, the Margaret Thatcher biopic The Iron Lady (2012) grossed $114 million worldwide. Debbie Isitt has directed successful mainstream films, including \"Confetti\" and the \"Nativity!\" trilogy."]}, {"page": "Progress Theatre", "response": ["|Debbie Isitt"]}, {"page": "Confetti (2006 film)", "response": ["Confetti is a 2006 British mockumentary romantic comedy film released on 5 May 2006. It was conceived and directed by Debbie Isitt and stars many acclaimed British comedians, including Jessica Stevenson, Jimmy Carr, Martin Freeman, Mark Heap, Julia Davis, Robert Webb and Olivia Colman. It follows a bridal magazine competition for the most original wedding, the ultimate prize being a house, and the three couples who are chosen to compete. The film follows the contestants in a fly-on-the-wall documentary style, akin to The Office. The script is entirely improvised."]}, {"page": "Stephen Mangan", "response": ["Confetti, a 2006 British mockumentary romantic comedy film, was released on 5 May 2006. It was conceived and directed by Debbie Isitt and stars many British comedians, including Jessica Stevenson, Jimmy Carr, Martin Freeman, Mark Heap, Julia Davis, Robert Webb, and Olivia Colman. It follows a bridal magazine competition for the most original wedding, the ultimate prize being a house, and the three couples who are chosen to compete. Mangan plays one of the grooms, a professional tennis player."]}, {"page": "Marc Wootton", "response": ["He also played a small role in the 2006 Debbie Isitt wedding film Confetti as a best man, Snoopy, and has completed filming Frequently Asked Questions About Time Travel, a science fiction comedy film with Chris O'Dowd, Dean Lennox Kelly and Anna Faris, which was released in UK cinemas on 24 April 2009. The DVD was released in the UK on 7 September 2009.", "In Autumn 2008 he completed filming Nativity in the role of Mister Poppy. Nativity was released on 27 November 2009, and was directed by Debbie Isitt. The sequel Nativity 2: Danger in the Manger was released in November 2012."]}, {"page": "Ben Crompton", "response": ["|Debbie Isitt"]}, {"page": "The Illustrated Mum", "response": ["The television drama stars Michelle Collins as Marigold Westward, and Alice Connor and Holly Grainger as her daughters Dolphin and Star respectively. The script was by Debbie Isitt, and it was directed by Cilla Ware. Ware had previously directed the television adaptation of another of Wilson's books, Double Act, and went on to adapt a third, Best Friends.", "The drama won the Children's BAFTA award in 2005 for best schools drama, and Debbie Isitt won the award for best adapted writer.", "Also Debbie Isitt won the 2004 BAFTA award for best adapted writer for her work on this production.Entertainment | Children vote Shrek 2 best film. BBC News (29 November 2004).Channel 4 Learning – Primary – English – Jacqueline Wilson Trilogy DVD. Shop.channel4learning.com."]}, {"page": "List of Welsh films", "response": ["2012: Nativity 2: Danger in the Manger was filmed at Lake Vyrnwy, Bala and Pistyll Rhaeadr waterfall, directed by Debbie Isitt."]}, {"page": "List of British films of 2006", "response": ["|Confetti||Debbie Isitt ||Martin Freeman, Jessica Stevenson ||Mockumentary ||"]}, {"page": "Isitt", "response": ["*Debbie Isitt, English director and writer"]}, {"page": "Nativity!", "response": ["Nativity! is a 2009 British Christmas musical comedy film directed by Debbie Isitt and released on 27 November 2009 and the first instalment in the Nativity film series. The film stars Martin Freeman and Ashley Jensen. In the film teacher Paul Maddens (Freeman) lies to his rival that Hollywood are coming to watch his school's Christmas nativity, but after the lie gets out of hand, he must resolve the issue fast. The film was written by its director, Debbie Isitt, but was also partially improvised.", " A stage musical adaptation of the film written and directed by Debbie Isitt and composed by Nicky Ager opened at the Birmingham Repertory Theatre in October 2017. Since its world premiere the musical has toured the UK over the Christmas seasons, including runs at London's Hammersmith Apollo which have featured guest star celebrities such as Louis Walsh, Danny Dyer, Dani Dyer, Jo Brand, Rylan Clark-Neal and Sharon Osbourne."]}, {"page": "List of American films of 2009", "response": ["| Nativity! || E1 Entertainment || Debbie Isitt (director); Martin Freeman, Pam Ferris, Alan Carr, Jake Pratt, Bessie Cursons, Ricky Tomlinson, various child contestants on Britain's Got Talent"]}, {"page": "List of British films of 2009", "response": ["|Nativity!|| Debbie Isitt || Martin Freeman, Ashley Jensen, Jason Watkins, Marc Wootton || Comedy || 27 November ||"]}, {"page": "Marion Bailey", "response": ["As well as Leigh's films, Bailey has appeared as Mrs Peach in Debbie Isitt's Nasty Neighbours (2000), Mary in the Craig Ferguson film I'll Be There and Mrs Adams in S.J.Clarkson's \"Toast\" (2010). Bailey starred as Mrs Booth in Mr. Turner (2014) and appeared in The Lady in the Van (2015), Allied (2016), Dead In A Week (or your money back) (2018), Lady Conyngham in Leigh’s Peterloo (2018) and played Dinah in Stephen Cookson's \"Brighton\"(2019)."]}, {"page": "British Academy Children's Awards", "response": ["* 2004: Debbie Isitt (The Illustrated Mum)"]}, {"page": "Lordswood Girls' School", "response": ["*Debbie Isitt, writer, film director and performer."]}, {"page": "Paul Englishby", "response": ["Englishby has collaborated with world-class film directors, including Debbie Isitt on critically acclaimed Brit-flick Confetti, and on the film Ten Minutes Older featuring works from directors Spike Lee, Werner Herzog, Bernardo Bertolucci, Mike Figgis and Jean-Luc Godard."]}, {"page": "Birmingham Repertory Theatre", "response": ["* Nativity! The Musical (2017 world premiere) written and directed by Debbie Isitt"]}, {"page": "List of British films of 2012", "response": ["|| Director: Debbie Isitt   Cast: David Tennant, Joanna Page"]}, {"page": "List of American films of 2012", "response": ["| BBC Films || Debbie Isitt (director); David Tennant, Joanna Page, Marc Wootton, Pam Ferris, Jake Pratt, Bessie Cursons ||"]}, {"page": "Nativity 2: Danger in the Manger", "response": ["Nativity! 2: Danger in the Manger is a 2012 British comedy film written and directed by Debbie Isitt, an improvised Christmas comedy is the second instalment in the Nativity film series. The film focuses on Donald Peterson, an anxious primary school teacher, who embarks on a wild and heartwarming adventure with his class and teaching assistant, the childlike Mr Poppy, as they travel to Wales to perform in a Christmas singing competition.", "Prior to filming starting, writer/director Debbie Isitt and actor David Tennant spent a week in Coventry, spending time in real classrooms and with school choirs and plays, and helping with the auditions for the child roles. Filming began in Coventry on 15 October 2011 and filmed there for a fortnight."]}, {"page": "Snarling Beasties", "response": ["Snarling Beasties was formed in 1986 by Debbie Isitt and Mark Kilmurry. Isitt was the writer and director. Kilmurry played the lead parts in her first plays; Gangsters (1988), Punch & Judy, (1989), Femme Fatal (1990) and The Woman Who Cooked Her Husband (1992). Snarling Beasties mixed a cinematic style with total theatre and created physical, dynamic and naturalistic plays.  The company won the Time Out theatre award, the Perrier Pick of the Fringe award three times and the Independent Theatre Award."]}, {"page": "List of British films of 2014", "response": ["|| Director: Debbie Isitt   Cast: Martin Clunes, Marc Wootton, Catherine Tate, Celia Imrie, Jason Watkins"]}, {"page": "Simon Hubbard", "response": ["*Nasty Neighbours by Debbie Isitt – Trinity Players Theatre – Dublin.", "*The Woman who cooked her husband by Debbie Isitt."]}, {"page": "Nativity 3: Dude, Where's My Donkey?", "response": ["Nativity! 3: Dude, Where's My Donkey? is the third instalment of the Nativity film series by Debbie Isitt. It stars Martin Clunes, Marc Wootton, Catherine Tate with Celia Imrie and Jason Watkins. Like its predecessors, it was distributed by Entertainment One."]}, {"page": "Hank Zipzer's Christmas Catastrophe", "response": ["Hank Zipzer's Christmas Catastrophe is a 2016 standalone British Christmas television film based on the Hank Zipzer series of books by Henry Winkler and Lin Oliver and the TV series of the same name airing on CBBC. The film aired on CBBC on 12 December 2016. It is written by Joe Williams and Debbie Isitt and directed by Matt Bloom. The film is produced by Kindle Entertainment in association with Walker Productions and DHX Media with support from Screen Yorkshire's Yorkshire Content Fund. The film was nominated for an International Emmy Kids award under the category of TV Movie/Mini-Series and a BAFTA children’s award in 2017. The film then won the aforementioned International Emmy Kids award in the award’s ceremony the next year. The film was also nominated for numerous other awards. It is the fourth movie based on a CBBC programme after Tracy Beaker: The Movie of Me, Shaun the Sheep Movie, and Friday Download: The Movie. It is also the second movie based on a CBBC show, which has not been released in cinemas and only shown on TV after Tracy Beaker: The Movie of Me.", "Production on Hank Zipzer's Christmas Catastrophe began on 26 July 2016 and ended on 18 August 2016. The film was commissioned by Cheryl Taylor, Controller of CBBC. The executive producers for the film are BBC's Amy Buscombe and Anne Brogan, the writers are Joe Williams and Debbie Isitt, who had written the three films of the Nativity series, and the director is Matt Bloom. It was first shown on 12 December 2016 on CBBC. The movie then returned for viewing on CBBC on 23 December 2017, 21 December 2018, and 23 December 2019.  "]}]}}