{"wiki_id": "http://www.wikidata.org/entity/Q5240181", "itemLabel": "David Surridge", "itemDescription": "cricketer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Surridge", "wikipedia_page": {"main": "David Surridge (born 6 January 1956) is a former English cricketer. Surridge was a right-handed batsman who bowled right-arm fast-medium. He was born in Bishop's Stortford, Hertfordshire.\nSurridge made his debut in county cricket for Hertfordshire against Buckinghamshire in the 1977 Minor Counties Championship. He played Minor counties cricket for Hertfordshire till 1979. While studying for his degree, Surridge made his first-class debut for Cambridge University against Essex in 1979. During that season, he made eight further first-class appearances for the university, taking a total of 27 wickets at an average of 21.59, with best figures of 4/22. He also made his List A debut for the Combined Universities in the 1979 Benson & Hedges Cup, playing a single match against Northamptonshire. He joined Gloucestershire for the 1980 season, making his first-class debut for the county against Oxford University. He made 24 further first-class appearances for Gloucestershire, the last of which came against Somerset in the 1982 County Championship. In his 25 first-class matches for the county, he took 60 wickets at an average of 33.60, with best figures of 5/78. These figures, which was his only five wicket haul, came against Worcestershire in 1982. His List A debut for Gloucestershire came in the 1980 John Player League against Northamptonshire. He made 30 further List A appearances for the county, the last of which came against Somerset in the 1982 John Player League. In these match, he took a total of 23 wickets at an average of 47.30, with best figures of 3/35.He left Gloucestershire at the end of the 1982 season, rejoining Hertfordshire for the 1983 season. Surridge played Minor counties cricket for Hertfordshire until 1996, making 93 further Minor Counties Championship appearances and 30 MCCA Knockout Trophy appearances. He made his first List A appearance for his home county in the 1983 NatWest Trophy against Hampshire. From 1983 to 1993, he made eight List A appearances for Hertfordshire, taking 5 wickets at an average of 54.40, with best figures of 3/61. During this period, he also made appearances for the Minor Counties cricket team. He made a single first-class appearance for the team against the touring New Zealanders in 1986, taking the wickets of Evan Gray and Derek Stirling. He also appeared in List A cricket for the team, starting against Sussex in the 1983 Benson & Hedges Cup. He made twelve further List A appearances for the team, the last of which came against Derbyshire in the 1986 Benson & Hedges Cup. In his thirteen appearances for the team, he took 13 wickets at an average of 29.23, with best figures of 4/26. He retired from county cricket at the end of the 1996 season.", "link_mentions": [{"page": "Bishop's Stortford", "response": ["*David Surridge (born 1956), cricketer"]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* David Surridge (1980–1982) : D. Surridge"]}, {"page": "Surridge, David", "response": ["#redirectDavid Surridge"]}, {"page": "Philip Crowe (rugby union)", "response": ["He went up to University College at the University of Oxford as a Rhodes Scholar in 1980, where he played rugby for Oxford University RFC from 1981–83, winning blues in each year. In addition to playing rugby at Oxford, Crowe also made a single appearance in first-class cricket for Oxford University against Gloucestershire at Oxford in 1982. He batted twice in the match, being dismissed for 11 runs in the Oxford first innings by Christopher Trembath, while in their second innings he was dismissed without scoring by David Surridge. With his left-arm medium pace, he took the wicket of Paul Romaines in the Gloucestershire first innings, finishing with match bowling figures of 1 for 121."]}, {"page": "List of Hertfordshire County Cricket Club List A players", "response": ["*David Surridge (1983–1993): D Surridge"]}]}}