{"wiki_id": "http://www.wikidata.org/entity/Q5240479", "itemLabel": "David Townsend", "itemDescription": "English cricketer (1912-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Townsend_(cricketer,_born_1912)", "wikipedia_page": {"main": "David Charles Humphrey Townsend (20 April 1912 – 27 January 1997) was an English cricketer who played in three Tests in 1935.\nBorn in Norton, County Durham, David Townsend was educated at Winchester College and New College, Oxford. He was a right-handed batsman, sometimes used as an opener, who holds the record of being the last cricketer to have played Test cricket for England without playing for one of the first-class English counties. Townsend's first-class cricket was principally for Oxford University and he won his Blue in the University match in 1933 and 1934. But his other cricket was mainly for Durham, which was at that time one of the Minor Counties.\nAfter two good university seasons, Townsend was picked for a rather makeshift Marylebone Cricket Club (MCC) side that toured the West Indies in 1934-35 under Bob Wyatt. He opened in three of the four Tests but was not a success, and the series as a whole was won by the West Indian cricket team, the side's first series victory. Townsend played little first-class cricket after this tour, though his final match was not until 1948.\nTownsend was the son of Charles Townsend, also an England Test player, and his own son, Jonathan, played first-class cricket for Oxford University in the 1960s. David Townsend died at age 84 in Norton, County Durham.", "link_mentions": [{"page": "Norton, County Durham", "response": ["*David Townsend – Test cricketer"]}, {"page": "National Counties of English and Welsh cricket", "response": ["The \"true\" Minor Counties teams (i.e. not the second XI of a first-class county) were often composed entirely of amateur players, though some had a few professionals as well, especially where there were strong professional leagues locally. An example of a professional who played regular Minor Counties cricket was the England bowler Sydney Barnes. After falling out with Lancashire, he played most of his cricket outside the first-class game with Staffordshire. In early days, Minor Counties teams supplied some amateur cricketers of note too: the most recent example of a Test cricket player whose main cricket was in the Minor Counties was David Townsend in 1934–35. His county cricket was for Durham, though he played first-class cricket for Oxford University."]}, {"page": "List of International cricket families", "response": ["* David Townsend"]}, {"page": "List of Test cricketers", "response": ["David Townsend ·"]}, {"page": "English cricket team in the West Indies in 1934–35", "response": ["* David Townsend"]}, {"page": "David Townsend", "response": ["David Townsend may refer to:", "*David Townsend (art director) (1891–1935), American art director", "*David Townsend (cricketer, born 1912) (1912–1997), English cricketer", "*David Townsend (musician) (1955–2005), American musician", "*David Townsend (rower) (born 1955), British rower", "*David Townsend (Devon cricketer) (born 1965), former English cricketer"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* David Townsend (1934/35–1946) : D. C. H. Townsend (Durham). Tours: West Indies (1934/35)."]}, {"page": "Jonathan Townsend", "response": ["Townsend also played 20 games of Minor Counties cricket between 1964 and 1975 for Durham, Wiltshire and Suffolk. His grandfather Charlie Townsend and his father David Townsend played Test cricket for England."]}]}}