{"wiki_id": "http://www.wikidata.org/entity/Q5240944", "itemLabel": "David Weitzman", "itemDescription": "British politician (1898-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Weitzman", "wikipedia_page": {"main": "David Weitzman, QC (18 June 1898 – 6 May 1987) was a British Labour Party politician.\nWeitzman was born in Blackburn and educated at Hutchesons' Grammar School, Glasgow, Manchester Central School and Manchester University. He served in the Manchester Regiment in the First World War. After graduating he was called to the Bar (Gray's Inn) and became a member of the Northern Circuit. He contested Stoke Newington unsuccessfully at the 1935 general election but it was a Labour gain at the 1945 general election.\nIn October 1947, he was convicted of conspiracy related to unlawful supply of toilet preparations (lipstick) by his brothers' Newington Supply Co. contrary to wartime regulations, and was sentenced to 12 months imprisonment and fined £500.  This was quashed in March 1948.For the 1950 election his seat was reconstituted as Hackney North and Stoke Newington and he went on to represent the constituency for a further 29 years.\nFor the five years leading up to his retirement in 1979, he was the last sitting British MP born in the 19th century, the last born during the Victorian era, the oldest member of the House of Commons, and the last Member of Parliament to have served in the First World War. After his retirement, Bob Edwards became the oldest sitting British MP.\nHe was married three times and had a son and a daughter from the first marriage. He died on 6 May 1987 aged 88.", "link_mentions": [{"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|David Weitzman"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|David Weitzman"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|David Weitzman"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|David Weitzman"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|David Weitzman"]}, {"page": "Hackney North and Stoke Newington (UK Parliament constituency)", "response": ["Following a decrease in the population the two constituencies were merged by the Representation of the People Act, 1948, retaining David Weitzman as MP and becoming the current constituency in the 1950 general election.", "| David Weitzman"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| David Weitzman"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| David Weitzman"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| David Weitzman"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| David Weitzman"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| David Weitzman"]}, {"page": "Weitzmann", "response": ["*David Weitzman (1898–1987), Jewish British politician"]}, {"page": "Stoke Newington (UK Parliament constituency)", "response": ["| David Weitzman ", "* Labour: David Weitzman"]}, {"page": "List of British Jewish politicians", "response": ["*David Weitzman (1945–1979) Labour MP"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|David Weitzman||18 June 1898||Feb 1974||1979||80 2||6 May 1987||Labour||"]}, {"page": "Jewish left", "response": ["At the end of the Second World War, the Labour Party entered government again, and several newly elected Labour MPs were Jewish, and often on the socialist left of the Party, radicalised by incidents like the Battle of Cable Street. Those MPs included Herschel Lewis Austin, Maurice Edelman, and Ian Mikardo, as well as Phil Piratin, one of only four MPs in British history to have represented the Communist Party of Great Britain. Several MPs elected in the 1940s and 1950s went on to be Ministers in Harold Wilson's governments of the 1960s and 1970s: The Lord Barnett, Edmund Dell, John Diamond, Reg Freeson, The Baroness Gaitskell, Myer Galpern, Gerald Kaufman, The Lord Lever of Manchester, Paul Rose, The Lord Segal, The Baroness Serota, The Lord Sheldon, John and Samuel Silkin, Barnett Stross, and David Weitzman. A prominent Jewish Labour politician in this era was Leo Abse, who put forward the private members' bill which decriminalised homosexuality and reformed the divorce laws in Britain. Robert Maxwell, a Labour MP during the 1964–66 Wilson government, eventually became a leading newspaper publisher when his holding company purchased Mirror Group Newspapers in 1984."]}, {"page": "Weitzman, David", "response": ["#redirectDavid Weitzman"]}, {"page": "List of Queen's Counsel in England and Wales appointed in 1951", "response": ["| height=\"19\" |David Weitzman", "|\" Mr. David Weitzman.\" Times, 8 May 1987, p. 16.For details of the lipstick case, see Donald Thomas, The Enemy Within Hucksters, Racketeers, Deserters, and Civilians During the Second World War (New York, NY: New York University Press), p. 372."]}]}}