{"wiki_id": "http://www.wikidata.org/entity/Q5241123", "itemLabel": "David William Rhind", "itemDescription": "British geographer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_William_Rhind", "wikipedia_page": {"main": "Professor David William Rhind  is a British geographer and expert on geographic information systems (GIS). He was Vice-Chancellor of City University, London, until July 2007.\nRhind graduated in geography and geology from the University of Bristol in 1965 and received a PhD in geomorphology from the University of Edinburgh in 1969.Rhind held academic posts at Edinburgh, the Royal College of Art and Durham, before becoming a professor of geography at the University of London in 1982. In this position he was a major contributor to the Chorley Committee, the UK Government committee of enquiry \"Handling of Geographical Information\", which reported in 1987. He subsequently became Director General of Ordnance Survey, overseeing the completion of the digitisation of the last of its paper maps.\nWork on GIS led to the awarding of a DSc from the University of London in 1991. Rhind has also received honorary doctorates from universities including Bristol, Loughborough, Southampton, Kingston, Durham, London Metropolitan, Royal Holloway, Edinburgh University and City University London. In 2002 Rhind was elected both a Fellow of the Royal Society (the British National Academy of Sciences) and an honorary Fellow of the British Academy (the equivalent body for the social sciences and humanities). He was the first geographer elected to the Royal Society for nearly 50 years and is almost unique in also being a Fellow of the British Academy.Rhind has held many other posts including chairing the Statistics Commission and the UK Nuclear Decommissioning Authority's Socio-economic Committee, and membership of the court of directors for the Bank of England. In 2000, he gained a CBE for services to Geographical and Social Sciences.He has published several books on Geography and the Earth Sciences.", "link_mentions": [{"page": "City, University of London", "response": ["* 1998–2007: David William Rhind"]}, {"page": "Rhind", "response": ["* David William Rhind (born circa 1945), British geographer "]}, {"page": "List of fellows of the Royal Society P, Q, R", "response": ["|David William Rhind||9 May 2002||\t"]}, {"page": "2001 New Year Honours", "response": ["*Professor David William Rhind, Vice Chancellor, City University. For services to Geographical and Social Sciences."]}, {"page": "National Center for Geographic Information and Analysis", "response": ["Notable faculty involved with the NCGIA include Michael Goodchild, Michael Batty, David Mark, A. Stewart Fotheringham, Andrew Frank, Helen Couclelis, Keith Clarke, Luc Anselin, Waldo R. Tobler amongst others. David William Rhind and Mike Goodchild compare later US and the UK approach.Goodchild, Michael F., and David W. Rhind. \"The US National Center for Geographic Information and Analysis: some comparisons with the Regional Research Laboratories.\" The Association for Geographic Information Yearbook (1990): 226–32."]}]}}