{"wiki_id": "http://www.wikidata.org/entity/Q5240901", "itemLabel": "David Webster", "itemDescription": "opera manager (1903-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Webster_(opera_manager)", "wikipedia_page": {"main": "Sir David Lumsden Webster  (3 July 1903 – 9 May 1971) was the chief executive of the Royal Opera House, Covent Garden, from 1945 to 1970. He played a key part in the establishment of the Royal Ballet and Royal Opera companies.\nFrom a retail background, Webster became chairman of the Liverpool Philharmonic during the Second World War. From there he was asked to set up opera and ballet companies at Covent Garden. He persuaded the existing Sadler's Wells Ballet to move to the opera house but found no established opera company suitable to do the same, and he set up a new opera company from scratch.\nAt first, Webster presented opera in English with a permanent company, but as Covent Garden flourished and international stars were attracted to appear, the policy gradually changed to presenting operas in their original language. By the time of Webster's retirement, the Royal Opera and the Royal Ballet were world-famous.", "link_mentions": [{"page": "Benjamin Britten", "response": ["Singers and players admired Britten's conducting, and David Webster rated it highly enough to offer him the musical directorship of the Covent Garden Opera in 1952. Britten declined; he was not confident of his ability as a conductor and was reluctant to spend too much time performing rather than composing. As a conductor, Britten's repertory included Purcell, Bach, Haydn, Mozart and Schubert, and occasional less characteristic choices including Schumann's Scenes from Goethe's Faust; Elgar's The Dream of Gerontius and Introduction and Allegro; Holst's Egdon Heath and short pieces by Percy Grainger."]}, {"page": "Thomas Beecham", "response": ["Beecham, whom the BBC called \"Britain's first international conductor\",\"CD Review\", BBC Radio 3, 12 March 2011. Retrieved 12 March 2011 took the RPO on a strenuous tour through the United States, Canada and South Africa in 1950.Jefferson, Alan. \"Beecham, Sir Thomas, second baronet  (1879–1961)\", Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 24 May 2016   During the North American tour, Beecham conducted 49 concerts in almost daily succession.Procter-Gregg, p. 200 In 1951, he was invited to conduct at Covent Garden after a 12-year absence.Reid, p. 236 State-funded for the first time, the opera company operated quite differently from his pre-war regime. Instead of short, star-studded seasons, with a major symphony orchestra, the new director David Webster was attempting to build up a permanent ensemble of home-grown talent performing all the year round, in English translations. Extreme economy in productions and great attention to the box-office were essential, and Beecham, though he had been hurt and furious at his exclusion, was not suited to participate in such an undertaking.Haltrecht, p. 106 When offered a chorus of eighty singers for his return, conducting Die Meistersinger, he insisted on augmenting their number to 200. He also, contrary to Webster's policy, insisted on performing the piece in German. In 1953 at Oxford, Beecham presented the world premiere of Delius's first opera, Irmelin, and his last operatic performances in Britain were in 1955 at Bath, with Grétry's Zémire et Azor."]}, {"page": "John Barbirolli", "response": ["Barbirolli refused invitations to take up more prestigious and lucrative conductorships. Shortly after he took over the Hallé he received an offer from the sponsors of an ambitious scheme that would have put him in charge of the London Symphony Orchestra,Rigby, p. 154 and in the early 1950s the BBC sought to recruit him for the BBC Symphony Orchestra.Reid (1968), p. 353 Also in the early 1950s the head of the Royal Opera House, David Webster, wanted him to become the musical director there. Barbirolli conducted six operas for Webster, Turandot, Aida, Orfeo ed Euridice, Tristan und Isolde, La bohème and Madama Butterfly, 1951–53,\"Covent Garden Opera: 'Turandot' to Open New Season\", The Times, 5 October 1951, p. 8; \"The Covent Garden Season\", The Times,  23 December 1952, p. 2;  \"Covent Garden Opera: 'Tristan und Isolde'\", The Times, 10 January 1953, p. 8; \"Royal Opera House: 'La Bohème'\",  The Times,  5 November 1953, p. 4; and \"Covent Garden Opera:  'Madam Butterfly'\", The Times, 9 December 1953, p. 3 but he declined to be wooed away from the Hallé.Haltrecht, p. 185 and ODNB His biographer Charles Reid wrote, \"His Manchester kingdom is a kingdom indeed. He is not manacled or chivied in his choice of programmes. Broadly speaking he conducts only what he loves ... His kingdom approximates to a conductor's paradise.\"Reid (1957), p. 8 Nevertheless, in 1958, after building the orchestra up and touring continually, conducting up to 75 concerts a year, he arranged a less onerous schedule, allowing him more time to appear as a guest conductor with other orchestras.Crichton, Ronald and José A. Bowen. \"Barbirolli, Sir John (Giovanni Battista)\", Grove Music Online, accessed 7 February 2010  He also appeared at the Vienna State Opera,\"Mr. John Barbirolli: Another Invitation to Vienna\", The Manchester Guardian, 27 August 1946, p. 3 and Rome Opera House, where he conducted Aida in 1969.\"Barbirolli, John (Sir Giovanni Battista Barbirolli )\", Oxford Dictionary of Music, online version, accessed 7 February 2010  In 1960 he accepted an invitation to succeed Leopold Stokowski as chief conductor of the Houston Symphony in Texas, a post he held until 1967, conducting an annual total of 12 weeks there in early spring and late autumn between Hallé engagements.\"Sir J. Barbirolli for Texas\", The Times, 1 November 1960, p. 16, and ODNB In 1961 he began a regular association with the Berlin Philharmonic Orchestra, which lasted for the rest of his life."]}, {"page": "Royal Liverpool Philharmonic", "response": ["After the outbreak of the Second World War there was pressure to suspend the orchestra's concerts. The chairman of the management committee, David Webster, strongly resisted it, insisting that music was an essential morale-booster. He set up low-priced concerts for factory workers and members of the armed forces. The pre-war rule insisting that audiences wear formal evening dress was abolished. Webster recruited Malcolm Sargent as chief conductor; though not generally loved by orchestral players Sargent was immensely popular with the paying public.Cox, p. 164 Guest conductors included Sir Henry Wood and Charles Münch.Haltrecht, pp.. 48–49"]}, {"page": "Georg Solti", "response": ["Solti took up the musical directorship of Covent Garden in August 1961.Haltrecht, p. 264 The press gave him a cautious welcome, but there was some concern that under him there might be a drift away from the company's original policy of opera in English. Solti, however, was an advocate of opera in the vernacular,\"What Sort of Opera for Covent Garden?\", The Times, 9 December 1960, p. 18 and he promoted the development of British and Commonwealth singers in the company, frequently casting them in his recordings and important productions in preference to overseas artists.Haltrecht, p. 295 He demonstrated his belief in vernacular opera with a triple bill in English of L'heure espagnole, Erwartung and Gianni Schicchi.\"Solti's Success with Opera in English\", The Times, 18 June 1962, p. 5 As the decade went on, however, more and more productions had to be sung in the original language to accommodate international stars.\"Sir David Webster's 21 Years at Covent Garden\", The Times, 12 April 1965, p. 14", "Like his predecessor Rafael Kubelík, and his successor Colin Davis, Solti found his early days as musical director marred by vituperative hostility from a small clique in the Covent Garden audience.Haltrecht, pp. 207 (Kubelik) and 271 (Solti); and Canning, Hugh. \"Forget the booing, remember the triumph\", The Guardian, 19 July 1986, p. 11 (Davis) Rotten vegetables were thrown at him, and his car was vandalised outside the theatre, with the words \"Solti must go!\" scratched on its paintwork.Haltrecht, p. 271 Some press reviews were strongly critical; Solti was so wounded by a review in The Times of his conducting of The Marriage of Figaro that he almost left Covent Garden in despair. The chief executive of the Opera House, Sir David Webster, persuaded him to stay with the company, and matters improved, helped by changes on which Solti insisted.Haltrecht, p. 279 The chorus and orchestra were strengthened, and in the interests of musical and dramatic excellence, Solti secured the introduction of the stagione system of scheduling performances, rather than the traditional repertory system. By 1967 The Times commented that \"Patrons of Covent Garden today automatically expect any new production, and indeed any revival, to be as strongly cast as anything at the Met in New York, and as carefully presented as anything in Milan or Vienna\".\"Twenty marvellous years at Covent Garden\", The Times, 13 January 1967, p. 14"]}, {"page": "Colin Davis", "response": ["In 1970, Sir David Webster, who ran the Royal Opera and the Royal Ballet companies at Covent Garden, invited Davis to succeed Sir Georg Solti as principal conductor of the opera.Haltrecht, p. 101 At about the same time, the Boston Symphony Orchestra invited him to become its musical director, but Davis felt that if Covent Garden needed him, it was his duty to take on the post. Webster's vision was that Davis and the stage director Sir Peter Hall, formerly of the Royal Shakespeare Company, would work in equal partnership as musical director and director of productions. After early successes together, including the première of Michael Tippett's The Knot Garden in December 1970, Hall left to succeed Laurence Olivier as director of the National Theatre. Webster had retired by that time, leaving Davis, together with Webster's successor as General Administrator, Sir John Tooley, to run the Royal Opera.Haltrecht, p. 101"]}, {"page": "English National Opera", "response": ["Both Sadler's Wells and the Royal Opera House had presented no opera or ballet since 1939. The Council for the Encouragement of Music and the Arts (CEMA), the official government body charged with dispensing the modest public subsidy recently introduced, considered its options on the future of opera in Britain.  CEMA concluded that a new Covent Garden company should be established, as a year-round, permanent ensemble, singing in English, instead of the shorter international seasons of pre-war years. This was a potential path to merge the two companies, as the modus operandi of the new Covent Garden company was now similar to that of Sadler's Wells.Haltrecht, pp. 55–56 However, David Webster, who was appointed to run Covent Garden, though keen to secure de Valois' ballet company for Covent Garden, did not want the Sadler's Wells opera company. He considered Sadler's Wells to be a worthy organisation, but also \"dowdy\" and \"stodgy\". Even with a policy of singing in English, he believed that he could assemble a better company.Haltrecht, p. 56 The management of Sadler's Wells was unwilling to lose its company's name and tradition. It was agreed that the two companies should remain separate.Haltrecht, p. 59"]}, {"page": "Royal Opera House", "response": ["During the Second World War the ROH became a dance hall. There was a possibility that it would remain so after the war but, following lengthy negotiations, the music publishers Boosey & Hawkes acquired the lease of the building. David Webster was appointed General Administrator, and Sadler's Wells Ballet was invited to become the resident ballet company.  The Covent Garden Opera Trust was created and laid out plans \"to establish Covent Garden as the national centre of opera and ballet, employing British artists in all departments, wherever that is consistent with the maintenance of the best possible standards ...\"", "In October 2020, the BBC reported that the Royal Opera House has lost 60% of its income as a result of restrictions implemented in response to the COVID-19 pandemic. As a consequence, the 1971 \"Portrait of Sir David Webster\" by David Hockney, which had hung in the opera house for several decades, was put up for auction at Christy's. It eventually sold for £12.8 million. The funds raised from the sale were needed to ensure the survival of the institution. \"Significant redundancies\" and an appeal for public donations have also been made. In addition, the opera house has applied for a loan to the Culture Recovery Fund.", "* Haltrecht, Montague, The Quiet Showman: Sir David Webster and the Royal Opera House, Collins, London, 1975."]}, {"page": "Rudolf Kempe", "response": ["He was invited to succeed Georg Solti as chief conductor of the Bavarian State Opera in Munich from 1952 to 1954, and was permitted by the East German authorities to do so without severing his ties with Dresden. In 1953 Kempe appeared with the Munich company at the Royal Opera House in London, where the General Administrator, Sir David Webster, quickly decided that Kempe would be an ideal Music Director for Covent Garden. Kempe declined the appointment, and did not accept the top job at any opera house after leaving Munich in 1954. He nonetheless conducted frequently at Covent Garden and was immensely popular there, leading among other works, Salome, Elektra, Der Rosenkavalier, Der Ring des Nibelungen, Un Ballo in Maschera and Madama Butterfly, of which the critic Andrew Porter compared Kempe's operatic conducting favourably with that of Arturo Toscanini and Victor de Sabata. As a guest conductor, Kempe frequently revisited Munich conducting mostly the Italian repertory."]}, {"page": "Robert Helpmann", "response": ["At the end of the war David Webster was appointed chief executive of the Royal Opera House, tasked with reopening it for opera and ballet after its wartime closure.Haltrecht, pp. 51–52 He invited de Valois and her company to base themselves there to complement the new opera company he was setting up.Haltrecht, pp. 60 and 68 In due course the companies became The Royal Ballet and The Royal Opera.Haltrecht, pp. 210–213 and 303 Helpmann and Fonteyn led the ballet company in the opening gala performance of The Sleeping Beauty. The first new work staged at the reopened house was Adam Zero (1946), with a libretto by Benthall and music by Bliss, choreographed by and starring Helpmann as an Everyman figure.Haltrecht, p. 73 The work was well received and was revived the following year, but has not held a place in the repertoire.Sorley Walker (1998b), pp. 251–252\"Adam Zero\" . Royal Opera House performance archive. Retrieved 27 May 2019"]}, {"page": "Frederick Ashton", "response": ["After the end of the war David Webster invited de Valois to move her company from Sadler's Wells to be resident at the Royal Opera House, Covent Garden alongside the new opera company he was establishing.Haltrecht, pp. 59–60. Ashton's first ballet for the company in its new home was Symphonic Variations (1946). The historian Montague Haltrecht writes of it, \"It is a masterpiece created for the Opera House and for the company's dancers, and almost of itself defines a style of English dancing.\"Haltrecht, p. 73 Although the Covent Garden stage was much larger than that at Sadler's Wells, Ashton confined himself to six dancers, led by Margot Fonteyn and Michael Somes. The work, which remains in the repertoire as at 2013, was a success from the outset.\"New Ballet at Covent Garden\", The Times, 25 April 1946, p. 6."]}, {"page": "Margot Fonteyn", "response": ["Fonteyn and Nureyev were especially noted for their performance of classics, such as The Sleeping Beauty and Swan Lake, which Fonteyn stripped to the essence of the roles and constantly improved her performance. Nureyev insisted that Fonteyn partner with him in La Bayadère and Raymonda, and wrote his own version of Swan Lake for them to perform with the Vienna State Opera Ballet in 1964. The performance was filmed and Lord Snowdon took pictures for the 27 November 1964 issue of Life. On 20 January 1965, Fonteyn and Nureyev performed the Le Corsaire Pas de Deux at the inaugural ceremonies for President Lyndon B. Johnson in Washington, D. C. Later that year, the couple debuted the title roles in Romeo and Juliet choreographed by Sir Kenneth MacMillan. MacMillan had intended the roles to be performed by Lynn Seymour and Christopher Gable, but David Webster, the manager of the Royal Opera House, insisted on Fonteyn and Nureyev. A year after the debut, the production was still drawing queues for its nightly performances. The audiences littered the duo with flowers, demanding repeated curtain-calls. Fonteyn's depth as an actor made the performance unique, making Juliet one of her most acclaimed roles."]}, {"page": "Geraint Evans", "response": ["*Haltrecht, Montagu: The Quiet Showman - Sir David Webster and the Royal Opera House, Collins, London, 1975. "]}, {"page": "Walter Legge", "response": ["Legge had promoted some Lieder recitals before the war, but in 1945, finding his influence at Covent Garden much diminished under the management of David Webster he again ventured into promoting concerts. For these, and for recordings, he founded a new orchestra, the Philharmonia. Beecham conducted its first concert (for the fee of one cigar) but was unwilling to be the employee of his former assistant and soon founded the Royal Philharmonic in competition with the Philharmonia.Legge, Walter, \"The Birth of the Philharmonia\", The Times, 27 December 1975, p. 4 In its early years the Philharmonia became closely identified with Karajan, but when he turned his attentions to the Berlin Philharmonic, Legge worked more and more with Otto Klemperer, a prominent conductor in the 1920s and '30s whose career Legge revitalised. Other eminent musicians of the time whom Legge persuaded to conduct the Philharmonia were Wilhelm Furtwängler, Arturo Toscanini and Richard Strauss. At its peak in the 1950s the Philharmonia was widely rated as the finest British orchestra and one of the finest orchestras in the World. In 1964, concerned at what he saw as falling standards, Legge disbanded the orchestra, which at once re-formed as the New Philharmonia, without him but with Klemperer as chief conductor."]}, {"page": "The Royal Ballet", "response": ["After losing the link with the Old Vic theatre, in 1939 the company was renamed Sadler's Wells Ballet and the school became Sadler's Wells Ballet School. Both continued at Sadler's Wells Theatre until 1946, when the company was invited to become the resident ballet company of the newly re-opened Royal Opera House in Covent Garden, under the direction of David Webster. The company relocated to the opera house the same year in 1946, with their first production at the venue being The Sleeping Beauty."]}, {"page": "David Webster", "response": ["David Webster may refer to:", "* David Webster (cricketer) (born 1946), English cricketer", "* David Webster (footballer) (born 1989), Irish professional footballer", "* David Webster (rowing) (born 1987), Australian rowing cox", "* David Webster (anthropologist) (1945–1989), South African anthropologist", "* David Webster (architect) (1885–1952), Scottish-Canadian architect", "* David Webster (opera manager) (1903–1971), British general administrator of the Royal Opera House in London, 1946–1970", "* David Webster (politician) (1923–1969), British Conservative Member of Parliament for Weston-Super-Mare", "* David Webster, Australian TV producer for Ambence Entertainment, creator and writer for Erky Perky"]}, {"page": "The Royal Opera", "response": ["The company's growth under the management of David Webster from modest beginnings to parity with the world's greatest opera houses was recognised by the grant of the title \"The Royal Opera\" in 1968. Under Webster's successor, John Tooley, appointed in 1970, The Royal Opera prospered, but after his retirement in 1988, there followed a period of instability and the closure of the Royal Opera House for rebuilding and restoration between 1997 and 1999. The 21st century has seen a stable managerial regime once more in place. The company has had six music directors since its inception: Karl Rankl, Rafael Kubelík, Georg Solti, Colin Davis, Bernard Haitink and Antonio Pappano.", "There was some pressure for a return to the pre-war regime of starry international seasons.Haltrecht, p. 52 Sir Thomas Beecham, who had presented many Covent Garden seasons between 1910 and 1939 confidently expected to do so again after the war.Jefferson, 190–192 However, Boosey and Hawkes, and David Webster, whom they appointed as chief executive of the Covent Garden company, were committed to presenting opera all year round, in English with a resident company.\"Opera in English – A New Policy for Covent Garden – Mr. Rankl Appointed Musical Director\", The Times, 17 June 1946, p. 8Haltrecht, pp. 54–56 It was widely assumed that this aim would be met by inviting the existing Sadler's Wells Opera Company to become resident at the Royal Opera House. Webster successfully extended just such an invitation to the Sadler's Wells Ballet Company, but he regarded the sister opera company as \"parochial\".Haltrecht, p. 58 He was determined to set up a new opera company of his own. The British government had recently begun to give funds to subsidise the arts, and Webster negotiated an ad hoc grant of £60,000 and an annual subsidy of £25,000, enabling him to proceed.Haltrecht, p. 64", "Solti, however, was an advocate of opera in the vernacular,\"What Sort of Opera for Covent Garden?\", The Times, 9 December 1960, p. 18 and promoted the development of British and Commonwealth singers in the company, frequently casting them in his recordings and important productions in preference to overseas artists.Haltrecht, p. 295 Among those who came to prominence during the decade were Gwyneth Jones and Peter Glossop.Blyth, Alan. \"Obituaries\", The Gramophone, July 1971, p. 31 Solti demonstrated his belief in vernacular opera with a triple bill in English of L'heure espagnole, Erwartung and Gianni Schicchi.\"Solti's Success with Opera in English\", The Times, 18 June 1962, p. 5 Nevertheless, Solti and Webster had to take into account the complete opposition on the part of such stars as Callas to opera in translation. Moreover, as Webster recognised, the English-speaking singers wanted to learn their roles in the original so that they could sing them in other countries and on record.\"Sir David Webster's 21 Years at Covent Garden\", The Times, 12 April 1965, p. 14 Increasingly, productions were in the original language. In the interests of musical and dramatic excellence, Solti was a strong proponent of the stagione system of scheduling performances, rather than the traditional repertory system. By 1967, The Times said, \"Patrons of Covent Garden today automatically expect any new production, and indeed any revival, to be as strongly cast as anything at the Met in New York, and as carefully presented as anything in Milan or Vienna\".\"Twenty marvellous years at Covent Garden\", The Times, 13 January 1967, p. 14", "Webster retired in June 1970. The music critic Charles Osborne wrote, \"When he retired, he handed over to his successor an organization of which any opera house in the world might be proud. No memorial could be more appropriate\".Osborne, Charles. \"David Webster\", The Musical Times, 1 July 1971, p. 694   The successor was Webster's former assistant, John Tooley.Donaldson, p. 148 One of Webster's last important decisions had been to recommend to the board that Colin Davis should be invited to take over as musical director when Solti left in 1971. It was announced in advance that Davis would work in tandem with Peter Hall, appointed director of productions. Peter Brook had briefly held that title in the company's early days,Gilbert and Shir, pp. 83–89 but in general the managerial structure of the opera company differed markedly from that of the ballet. The latter had always had its own director, subordinate to the chief executive of the opera house but with, in practice, a great degree of autonomy.\"The Knight at the Opera\", The Times, 24 November 1980, p. 16 The chief executive of the opera house and the musical director exercised considerably more day-to-day control over the opera company Appointing a substantial theatrical figure such as Hall was an important departure.Haltrecht, p. 301 Hall, however, changed his mind, and did not take up the appointment, going instead to run the National Theatre.Waymark, Peter. \"Peter Hall will not take Royal Opera job\", The Times, 8 July 1971, p. 1, and Haltrecht, p. 301 His defection, and the departure to Australian Opera of the staff conductor Edward Downes, a noted Verdi expert, left the company weakened on both production and musical sides.", "| rowspan=\"7\" | 1946–1970David Webster"]}, {"page": "Joan Carlyle", "response": ["Other roles, which she performed throughout many seasons included Oscar in Un ballo in maschera, a performance which Montague Haltrecht, in his biography of the first ROH general administrator David Webster, describes as \"the young Joan Carlyle makes a pageboy with a delicious vocal glitter\";Haltrecht, p. 229 Ascanius in Les Troyens; and Mimi in Peter Brook's staging of La bohème which resulted in a BBC Television production of the opera. At Glyndebourne in 1965 she played the Countess in Le nozze di Figaro.", "* Haltrecht, Montague (1975),The Quiet Showman: Sir David Webster and the Royal Opera House, London:  Collins.  "]}, {"page": "Ljuba Welitsch", "response": ["David Webster, the director of the Royal Opera House, recognising Welitsch's talent, secured her services for the resident company, with whom she appeared between 1948 and 1953 in Aida, La bohème, Salome, Tosca and The Queen of Spades.\"Ljuba Welitsch\", Royal Opera House performance database, retrieved 30 August 2018 In London, as in Vienna, operas were then customarily performed in the vernacular, and Welitsch, like other German singers performing at Covent Garden, had to learn her roles in English. As Musetta in La bohème, according to The Times, \"she more often than not sang whoever was playing Mimi off the stage\", although those Mimis included Elisabeth Schwarzkopf and Victoria de los Angeles.La bohème and La bohème, Royal Opera House performance database, retrieved 30 August 2018 When Welitsch sang Donna Anna for the Glyndebourne Festival Opera at the Edinburgh Festival in 1948, the critic Frank Howes wrote that she was a tiger who could have eaten both Don Giovanni and Don Ottavio \"and still have called for more\".\"Glyndebourne Opera at Edinburgh\", The Times, 27 August 1948, p. 7 In the same year she sang in Beethoven's Ninth Symphony with the Vienna Philharmonic Orchestra conducted by Wilhelm Furtwängler at the Royal Albert Hall.\"Vienna Philharmonic Orchestra\", The Times, 7 October 1948, p. 6 In 1949 for Glyndebourne at Edinburgh she sang Amelia in Un ballo in maschera.\"Un Ballo in Maschera, 22 August 1949\", Glyndebourne performance archive, retrieved 30 August 2018"]}, {"page": "Kenneth MacMillan", "response": ["When David Webster was appointed chief executive of the Royal Opera House, Covent Garden at the end of the war, his assignment was to establish permanent opera and ballet companies for the house. He set about building the opera company from scratch but persuaded de Valois to make Covent Garden the main base for her ballet company.Haltrecht, pp. 55 and 66–67 In 1946, while still a student, MacMillan appeared in the production of The Sleeping Beauty with which Webster and de Valois reopened the opera house. At first he was a non-dancing extra, and later he was promoted to a small dancing role.Parry, p. 61 With the main company now resident at Covent Garden, de Valois established a smaller ensemble to perform at Sadler's Wells and act as a training ground for young dancers and choreographers. In April 1946 MacMillan was a founder member, and quickly made progress. He was cast by Frederick Ashton, de Valois' principal choreographer, in a leading role in a new ballet, Valses nobles et sentimentales, in October 1946.Thorpe, p. 12 The success of the piece encouraged Ashton to revive his 1933 Les Rendezvous. Although initially only in the corps de ballet for this work, MacMillan was unexpectedly promoted to the male lead because of injuries to all the eligible company principals. His biographer Jann Parry comments that he was able to take over without notice because he had a rare ability to remember and reproduce the steps of every dancer in any piece in which he appeared.Parry, pp. 77–78 He was promoted to the senior Covent Garden company at the start of the 1948–49 season,Parry, p. 81 touring in Europe and dancing Florestan in the third act pas de trois of  The Sleeping Beauty in the company's opening gala in New York in October 1949. The first new role he created was The Great Admirer of Mademoiselle Piquant in John Cranko's ballet Children's Corner (1948). He appeared in the British film Tread Softly, in 1950. Then followed his Sherlock Holmes and Professor Moriarty in Margaret Dale's The Great Detective (1953); and  Moondog, in Cranko's The Lady and the Fool, (1954)\"A guide to Sir Kenneth MacMillan\", at the Royal Opera House, retrieved 28 November 2014"]}, {"page": "Karl Rankl", "response": ["In wartime Britain Rankl was unable to obtain a permit to work as a conductor until 1944, and he devoted much of his time to composition.Harewood, p. 68 His widow later recalled that Rankl also played the viola in a string quartet during this period.Conway, Paul. \"Karl Rankl (1898–1968)\", Music Web International, accessed 3 April 2011 When he was eventually given the necessary work permit to resume his conducting career, Rankl conducted the Liverpool Philharmonic, BBC NorthernGlock, William, \"Music\", The Observer, 21 January 1945, p. 2 and London Philharmonic Orchestras.\"The Coliseum Concerts\", The Times, 6 April 1945, p. 6 He made a favourable impression; The Times  praised his \"boundless energy … clear-cut performance and with a strong feeling for the shapely line of a melody.\" William Glock in The Observer praised the \"natural firmness\" of his \"splendid\" and \"authoritative\" conducting of Beethoven. Among those whom Rankl impressed was David Webster, chairman of the Liverpool Philharmonic. In 1944, Webster was invited to set up a new opera company at the Royal Opera House, Covent Garden in London. He turned to Rankl for advice and soon decided to appoint him musical director of the fledgling company."]}, {"page": "Edgar Evans (tenor)", "response": ["A chance meeting with Henry Robinson, formerly stage manager at Sadler's Wells, resulted in Evans applying for an audition with the newly formed Covent Garden Opera Company. Singing \"E lucevan le stelle\" from Tosca and the \"Flower Song\" from Carmen, he was chosen from scores of tenor hopefuls from around the world and progressed successfully through three auditions to receive the offer of a contract from the Administrator, David Webster, in the middle of August 1946."]}, {"page": "Edward Downes", "response": ["His first conducting assignment was taking over from John Barbirolli in La bohème in Bulawayo, while at Covent Garden, it was in 1954 for Der Freischütz. Downes's first experience of conducting a new production came about by accident when the eminent elderly French conductor Désiré-Émile Inghelbrecht proved unable to hold the ensemble together, so that after the general rehearsal David Webster and the French ambassador in London persuaded Inghelbrecht to withdraw, and Downes took over from the opening night."]}, {"page": "1903 in the United Kingdom", "response": ["* 3 July – David Webster, Scottish-born arts administrator (died 1971)"]}, {"page": "Peter Gellhorn", "response": ["Working with the Vic-Wells Opera  during and after the war led to an invitation from David Webster to join the staff of Covent Garden Opera when it re-opened after the war. He became assistant to music director Karl Rankl and conducted there many times from June 1947 onward. During his later career he also conducted at Glyndebourne, and with the Carl Rosa Opera Company. From 1961 he became Director of the BBC Chorus (later BBC Singers), conducting them in works such as Holst's The Cloud Messenger and Rubbra's In Die et Nocte Canticum. In 1967 Gellhorn worked with Peter and Gillian Hunt to set up the annual educational music festival Opera Barga in central Italy, acting as the musical director.Quattrocchi, Arrigo. 'Barga', in Grove Music Online"]}, {"page": "The Greek Passion (opera)", "response": ["The opera exists in two versions.  Martinů wrote the original version from 1954 to 1957.  He offered this original version of the opera in 1957 to the Royal Opera House, Covent Garden, where the music director, Rafael Kubelík, and the general administrator, David Webster, had approved the score for production.  However, following intervention by Sir Arthur Bliss, the company then demurred on the production and did not stage the work at the time.Martin Anderson, \"ROH, Covent Garden: Martinů's The Greek Passion\".  Tempo, 213, pp. 48-49 (2000).Norman Lebrecht Covent Garden: The Untold Story : Dispatches from the English Culture War- 2001 "]}, {"page": "Steuart Wilson", "response": ["In 1937 Wilson settled for a while in the United States, teaching at the Curtis Institute of Music. He retired from singing and returned to the United Kingdom in 1942 where he began a second career as an administrator. He initially worked for the BBC, then after the war was appointed music director of the newly created Arts Council of Great Britain; in 1948 he was knighted for his services in that post. That same year he became the BBC's director of music, and engineered the enforced retirement of the BBC Symphony Orchestra's chief conductor, Sir Adrian Boult. The following year he became deputy general administrator of the Royal Opera House, in which post he secured the premiere staging of Vaughan Williams's The Pilgrim's Progress in 1951. Unhappy with being subordinate to the Royal Opera's general administrator, David Webster, Wilson resigned from his post in June 1955 and started a campaign against homosexuals in the musical profession. Wilson ended his career as principal of the Birmingham School of Music, 1957–1960.", "In 1949 Wilson, aged 60, moved to Covent Garden to take the post of deputy general administrator of the Royal Opera House. While in that position he gave support to the Polish composer Andrzej Panufnik, who had recently defected from communist Poland, by introducing him to the concert agent Harold Holt.Jacobson, p. 48 Wilson was responsible for securing the premiere of Vaughan Williams's The Pilgrim's Progress at the Royal Opera House in 1951.Vaughan Williams's letter to Wilson, 27 April 1951, reprinted in Cobbe, p. 480 Wilson resented being subordinate to the general administrator, David Webster, and he resigned from his Royal Opera House post in June 1955.Haltrecht, pp. 157–58 The following month it was announced that he was launching \"a campaign against homosexuality in British music\" and was quoted as saying: \"The influence of perverts in the world of music has grown beyond all measure. If it is not curbed soon, Covent Garden and other precious musical heritages could suffer irreparable harm.\"The People, 24 July 1955, cited in Mitchell, 2004: p. 7"]}, {"page": "Childwall Sports and Science Academy", "response": ["* Sir David Webster, Chief Executive from 1945-70 of the Royal Opera House"]}, {"page": "John Tooley", "response": ["After serving for 15 years as assistant and later deputy to Sir David Webster, the founder of the Royal Opera, Tooley succeeded him as general administrator in 1970 and served in the post (later retitled general director) until retiring in 1988.", "In 1955 the Royal Opera House underwent an internal reorganisation. The deputy general administrator, Sir Steuart Wilson, left and Tooley was appointed assistant to the general administrator, David Webster. He was promoted to assistant general administrator in 1960, and served in that post until Webster's retirement in 1970. In the late 1960s, Webster's health became uncertain, and much of the day-to-day business of running the opera house fell to Tooley.Haltrecht, p. 286 He was appointed to succeed Webster, and held the post of general administrator until 1980, when it was renamed general director. He retired from the post in 1988.", "*Haltrecht, Montague. The Quiet Showman: Sir David Webster and the Royal Opera House. London: Collins, 1975. "]}, {"page": "Emil Wolk", "response": ["Emil Wolk was born in Brooklyn, New York to opera singer Jess Walters (Josuoh Wolk) and Emma Walters (née Defina). Wolk moved from his home in New York City to London, England at a young age, when his father took up the position of Principal Baritone at the Royal Opera House, Covent Garden under Sir David Webster."]}, {"page": "List of fellows of the Royal College of Music", "response": ["* Sir David Webster, 1964"]}, {"page": "1903 in Scotland", "response": ["* 3 July – David Webster, arts administrator (died 1971 in England)"]}, {"page": "Montague Haltrecht", "response": ["Montague Haltrecht (27 February 1932 – 27 March 2010) was an English writer, literary critic, model and radio and TV presenter. Over the course of his literary career he wrote four novels, Jonah and His Mother (1964), A Secondary Character (1965), The Devil is a Single Man (1969) and The Edgware Road (1970), exploring different aspects of Jewish life, and a biography of Sir David Webster, The Quiet Showman (1975), along with several short stories and radio and TV plays.  He won the Henfield Foundation Award for his first two novels and gained a BAFTA nomination for his TV play Can You Hear Me Thinking?.", "He assumed the lease of a larger flat, shared with his brother Norman and the latter's wife Anita. Montague took in lodgers, one of whom, the novelist Colin MacInnes, agreed to show a manuscript of Haltrecht's to his own publisher André Deutsch, who had previously rejected it. To his amazement, this time the publisher accepted it for publication. Jonah and His Mother, a novel about a young man finding his sexual identity, was Montague Haltrecht's first published book and appeared in 1964 with mixed, but generally good, reviews, The Sunday Times newspaper critic calling it \"Witty, assured first novel\" and The Guardian describing it variously as \"Cool elegance, ingenious style\" and a \"small barbed masterpiece\". Film rights were even discussed with a Hollywood studio, but were subsequently not taken up. The following year, 1965, André Deutsch published his second novel A Secondary Character, for which two works combined he won the Henfield Foundation Award. Four years later Collins published his third novel, The Devil Is a Single Man in 1969, followed a year later by The Edgware Road in 1970. His fifth and final book, also published by Collins, in 1975, was The Quiet Showman, a biography of Sir David Webster and the history of opera at the Royal Opera House from World War II to the 1970s. Haltrecht also ventured into writing for the stage when in 1974 he wrote a one-woman play for Judi Dench called Ellen Terry – The Harum Scarum Girl based on the life of the English stage actress. This was later produced for the theatre with the South African actress Bess Finney in the title role and directed by Nicholas Amer at both the Buxton and Edinburgh festivals and on a tour to South Africa.", "* The Quiet Showman: Sir David Webster and the Royal Opera House (Collins, 1975)"]}, {"page": "Owners, lessees and managers of the Royal Opera House, Covent Garden", "response": ["|1944–1949  Covent Garden Opera Trust Gen. Admin David Webster Mus. Dir. Karl RanklSadlers Wells Ballet first prod. Sleeping Beauty (1946);  Covent Garden Opera Co., first prod. The Fairy Queen (1946?)"]}, {"page": "Portrait of Sir David Webster", "response": ["The Portrait of Sir David Webster is a 1971 portrait by the artist David Hockney of the arts administrator David Webster. It was commissioned to mark Webster's retirement as the General Administrator of the Royal Opera House in London. The portrait hung for several decades in the opera house. ", "The painting is signed and inscribed 'Sir David Webster with tulips Jan 1971 David Hockney'. It is executed in acrylic paint on canvas. It measures 60 ⅛ x 72 ⅝in (152.8 x 184.5 cm).", "The portrait was the first commissioned portrait that Hockney had undertaken, having previously only painted portraits of acquaintances. It was his last commission until his portrait of Glyndebourne Festival Opera manager George Christie and his wife, Mary, in 2002 for the National Portrait Gallery in London. Three studies for the Portrait of Sir David Webster are in the British Arts Council Collection."]}]}}