{"wiki_id": "http://www.wikidata.org/entity/Q5248005", "itemLabel": "Debbie Travis", "itemDescription": "British-Canadian television personality, self-taught interior decorator, and former fashion model", "wikipedia_url": "https://en.wikipedia.org/wiki/Debbie_Travis", "wikipedia_page": {"main": "Debbie Travis (born June 27, 1960 in Blackburn, Lancashire, England) is a British-Canadian television personality, self-taught interior decorator, and former fashion model. She is best known as the host of Debbie Travis' Facelift and Debbie Travis' Painted House. The shows were based out of Montreal, Quebec and Facelift was produced for Home & Garden Television Canada.", "link_mentions": [{"page": "Blackburn", "response": ["*Debbie Travis (born 1960), television host"]}, {"page": "CTV Drama Channel", "response": ["* Star Portraits, a celebrity portrait painting competition. In each episode, three different artists would compete by painting a portrait of a Canadian celebrity (who would model for the artists). Notable celebrities who have appeared on the show include Elvis Stojko, Debbie Travis, Alex Trebek, Colin Mochrie, Roméo Dallaire, and Roberta Bondar."]}, {"page": "Test the Nation", "response": ["In the Canadian version, celebrity guests are selected to represent one of six in-studio teams. The celebrity guests also take the test and the top celebrity's score is revealed on air. Test the Nation: Trivia featured celebrities: Farley Flex, Debbie Travis, Lorne Cardinal, Carlo Rota, Samantha Bee and Tricia Helfer. Test the Nation: Sports celebrity guests are Paul Coffey, Debra DiGiovanni, Alan Thicke, Brian Bailey, Victoria Pratt and Chris Murphy."]}, {"page": "King Features Syndicate", "response": ["* Debbie Travis, \"House to Home\""]}, {"page": "North Preston", "response": ["*In 2010, television personality Debbie Travis visited the community on North Preston Day to film an episode for her show All for One on CBC."]}, {"page": "Debbie Travis' Facelift", "response": ["Debbie Travis' Facelift was a home improvement reality television show that ran from January 28, 2003 to December 30, 2005. It was produced in Canada for Home & Garden Television (HGTV) and also aired in the United States on the American version of the network, Home & Garden Television. It is hosted by interior designer Debbie Travis, and was based out of Montreal, Quebec.", "*Debbie Travis' official site"]}, {"page": "Canada Reads", "response": ["|Ami McKay || The Birth House || Debbie Travis"]}, {"page": "Ami McKay", "response": ["*2010 - One of the five finalists in CBC's Canada Reads. Her book is championed by TV host and designer Debbie Travis."]}, {"page": "From the Ground Up with Debbie Travis", "response": ["From the Ground Up with Debbie Travis was a Canadian reality television series, which aired on Global, HGTV and TVtropolis. The series was a design competition hosted by interior designer Debbie Travis.", "In season 2, the goal of the 14 protégés was to complete design tasks to become the chief designer on a new Debbie Travis branded condominium. Dvira Ovadia, an interior designer from Toronto, was the winner of Season 2. This cycle originally aired on Global Television in the spring of 2007 and then HGTV in 2008, as well as in the United States on Fine Living in the summer of 2008.", "*Debbie Travis builds new home series"]}, {"page": "Carrie Olver", "response": ["Olver was nominated for a Gemini Award in 2003 for the program in the category Best Host or Interviewer in a Lifestyle/General Interest Program or Series. She lost to Debbie Travis."]}, {"page": "The Greatest Canadian Invention", "response": ["*Debbie Travis - Home decoration specialist and TV host of Painted House"]}, {"page": "Travis (surname)", "response": ["* Debbie Travis (born 1960), Canadian television personality"]}, {"page": "Buy Me", "response": ["Buy Me is a television program that has aired on HGTV in the U.S. since 2005, and on HGTV Canada since 2003, where it is that cable network's most popular show. It is also seen in Belgium and South Africa, either dubbed or with subtitles. It is produced by Whalley-Abbey Media Holdings (WHAM), which is owned by Debbie Travis and her husband, and produced Debbie Travis' Facelift."]}, {"page": "Viewer's Choice Award for Lifestyle Host (Gemini Awards)", "response": ["* Debbie Travis, Debbie Travis' Facelift"]}, {"page": "Dvira Ovadia", "response": ["Dvira Ovadia (born 1979 in Israel) is a Canadian television personality and an award-winning/celebrity designer. She is best known as winningCNW Group | GLOBAL TELEVISION | 'From the Ground Up with Debbie Travis' selects Chief Designer the 2007 show called From The Ground Up with Debbie Travis season two.'From the Ground Up with Debbie Travis' selects Chief Designer The show aired on Global TV May 31, 2007.http://www.canwestglobal.com/media/viewNews.asp?NewsroomID=599  The Global Television Season Premiere - From The Ground Up With Debbie Travis The show was re-aired on HGTV Canada in the spring of 2008. In spring of 2008, the show was also airing in the United States on the Fine Living Network, Sunday nights at 10EST. Dvira Ovadia is also known for her weekly syndicated column which appears in many blogs which readers often write in to have their decorating questions answered.", "As a result of winning the show From the Ground Up, season II, Ovadia was awarded the title of chief designer for Debbie Travis to design and develop a series of Debbie Travis condos and homes. Ovadia worked with Debbie Travis to develop 10 model homes for Tribute Communities, encompassing everything from interior design to furnishing and sourcing products from all over the world.", "*From The Ground Up with Debbie Travis", "*Debbie Travis builds new home series"]}, {"page": "List of Canadian television personalities", "response": ["*Debbie Travis"]}, {"page": "The Marilyn Denis Show", "response": ["* Debbie Travis"]}, {"page": "All for One (TV series)", "response": ["All for One was a Canadian reality television series hosted by Debbie Travis. The series aired on CBC, and followed Travis as she travelled around the country helping community heroes with their home renovations. Renovations had to be completed in 5 days, and everyone from locals in the community to Travis' own team take part."]}, {"page": "26th Gemini Awards", "response": ["*Debbie Travis, All for One with Debbie Travis"]}, {"page": "The Social (Canadian TV program)", "response": ["Grelo took a maternity leave from the program in spring 2014.\"THE SOCIAL Reveals Upcoming Guest Co-Hosts, as Melissa Grelo Takes Time to Deliver Her Biggest Story Yet\". Yahoo! Finance, March 6, 2014. A series of celebrity guest hosts appeared during her absence, including Jann Arden, Marilyn Denis, Wendy Crewson, Elisha Cuthbert, Arlene Dickinson, Arielle Kebbel, Emily Procter, Sarah Rafferty and Debbie Travis."]}, {"page": "Canadian Screen Award for Best Reality/Competition Series", "response": ["| Hans Rosenstein, Debbie Travis, Jean-François Monette", "| From the Ground Up with Debbie Travis", "| Hans Rosenstein, Debbie Travis, Kit Redmond"]}]}}