{"wiki_id": "http://www.wikidata.org/entity/Q5241082", "itemLabel": "David Wilde", "itemDescription": "English cricketer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Wilde_(cricketer)", "wikipedia_page": {"main": "David Wilde (born 3 July 1950) is a former English cricketer  who played first-class cricket for Derbyshire in 1971 and 1972.\nWilde was born in Glossop. He started playing for Derbyshire in 1969 for the junior sides and for the second XI, and became a regular bowler for the second eleven in 1970. In the 1971 season Wilde made his first-class debut against Somerset in May when he took three wickets. He played three more first-class games in the season but most of his games were for the second XI.\nIn the 1972 season, Wilde played proportionately more games for the first team and recorded his best bowling figures of 3-27 against Essex.\nWilde played limited-overs cricket with one match in 1969 and 1970 and extensive appearances throughout 1972, but left the professional game in the same year. \nWilde was a left-arm medium-fast bowler and took 23 first-class wickets at an average of 37.39 and a best performance of 3 for 27. He took ten wickets in one-day cricket with an average of 31.10 and a best performance of 3 for 31. He was a left-handed batsman and played 15 innings in 13 first-class matches at an average of 3.10 and a top score of 12. He played 3 innings in ten one-day matches and made one run.", "link_mentions": [{"page": "David Wilde", "response": ["David Wilde (born 1935 in Manchester) is an English pianist and composer. As a boy he studied with Solomon and his pupil Franz Reizenstein, who had also studied composition with Hindemith and Vaughan Williams."]}, {"page": "Derbyshire County Cricket Club in 1971", "response": ["Anthony Borrington and Ashley Harvey-Walker, who made their first-class debuts in the season, went on to play for several more seasons for Derbyshire. Harvey-Walker achieved a unique distinction by scoring a century in his debut match.  Another newcomer, David Wilde, played  in this and the following season. Leslie Bradbury made his single first-class cricket appearance in one match for Derbyshire. Harold Cartwright, only played one-day cricket for Derbyshire in this his initial season, but stayed with the club for several seasons  "]}]}}