{"wiki_id": "http://www.wikidata.org/entity/Q5240352", "itemLabel": "David Thomas", "itemDescription": "Welsh industrialist, born 1794", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Thomas_(industrialist)", "wikipedia_page": {"main": "David Thomas (November 3, 1794 – June 20, 1882) was a native of Wales who was influential in the birth of the Industrial Revolution in the United States.", "link_mentions": [{"page": "Catasauqua, Pennsylvania", "response": ["Welsh immigrant David Thomas relocated to the area and opened the Crane Iron Works.  Remembered as \"the father of Catasauqua,\" Thomas initially named the community Craneville, after his former employer in Wales.", "The wealthy, generous Thomases were responsible for many sweeping changes to the prosperity of the community.  David Thomas founded the Presbyterian Church of Catasauqua, in which residents still worship today, and his wife Elizabeth donated money and land to found the Welsh Congregational Church, which no longer exists.  Thomas organized Catasauqua's first fire company, installed its first public water system, and served as its first burgess."]}, {"page": "David Thomas", "response": ["* David Thomas (composer) (1881–1928), Welsh composer", "* David Thomas (musician) (born 1953), American musician, member of group Pere Ubu", "* David Thomas (Dewi Hefin) (1828–1909), Welsh poet and schoolteacher", "* David Thomas (bass) (born 1943), British early-music and baroque-music singer", "* David Thomas (born 1959), English author, better known under his pen name Tom Cain", "* David Thomas, pen name of Dave Thompson (author) (born 1960), English writer about music", "* David Thomas (born 1966), musician with Take 6", "* David Thomas (British businessman) (born 1963), British businessman, CEO of Barratt Developments", "* David Thomas (industrialist) (1794–1882), Welsh industrialist", "* David Thomas (New York politician) (1762–1831), American politician, Congressman from New York", "* David Thomas (Texas politician) (1795–1836), American politician, signer of Texas Declaration of Independence", "* David Thomas (British politician) (1892–1954), Welsh Labour politician", "* David Thomas (MEP) (born 1955), British Labour politician", "* David Thomas (Archdeacon of Montgomery) (1833–1916), Welsh priest and historian", "* David Thomas (Archdeacon of Cardigan) (died 1951), Welsh priest", "* David Thomas (missionary priest) (1829–1905), Welsh priest", "* David Thomas (Protestant minister, born 1813) (1813–1894), Welsh preacher and publisher", "* David Thomas (bishop) (1942–2017), Welsh bishop, Provincial Assistant Bishop for the Church in Wales", "* David Thomas (Archdeacon of Gower), Welsh Anglican priest", "* David Thomas (Canadian scientist), Canadian biochemist", "* David Thomas (geographer) (born 1958), British geographer", "* David Thomas (rugby league), rugby league footballer of the 1900s for Wales, Halifax, and Mid-Rhondda", "* David Thomas (cricketer, born 1911) (1911–2001), Welsh cricketer", "* David Thomas (cricketer, born 1959) (1959–2012), English cricketer", "* David Thomas (cricketer, born 1963), former English cricketer", "* David Thomas (American football) (born 1983), American football player", "* David Thomas (Canadian football) (born 1951), American football cornerback", "* David Thomas (beach volleyball) (born 1974), Trinidad and Tobago beach volleyball player", "* David Thomas (boxer) (born 1937), British Olympic boxer", "* David Thomas (field hockey) (born 1927), British Olympic hockey player", "* David Thomas (educationalist) (1880–1967), Welsh educationalist and politician", "* David Thomas (murderer) (died 1995), executed Vincentian criminal", "* David Thomas (jeweller) (born 1942), Crown Jeweller for the English monarchy", "* David Thomas (judge), Justice of the Supreme Court of Queensland", "* J. David Thomas (born 1931), papyrologist and classical scholar"]}, {"page": "Anthracite iron", "response": ["Unlike many seminal advances, the contributors, place and date of this epoch are well recorded within specific moments in the late 1830s.  The first repeatable and reliably successful furnaces and smelts were managed by the same person in both the United Kingdom and the United States, in the principal control and supervision of Ironmaster David Thomas who had begun experimenting with attempts to use locally available Wales anthracite deposits as early as 1820 soon after he became in charge at Yniscedewin Iron Works in Wales.  About this 1837-38 timeframe experiments were also being made in Pennsylvania near Port Carbon,", "The first American smelt of Anthracite Pig Iron was performed July 4, 1840 by principal-partners David Thomas, Josiah White and Erskine Hazard at their Lehigh Crane Iron Works in their first hot blast furnace along Catasauqua Creek aided by Samuel Thomas and the employees of the LCIW, in what became Catasauqua in Northampton County, Pennsylvania.  The technology enabled industries the chance to produce cast iron sufficient to demand and eventually adapt production to also feed the demand to generate wrought iron and steel.  These useful materials are achieved by adding additional processing — by taking pig iron as an ingredient into a reverberatory furnace (and in later years, a Bessemer converter).", "The research was proceeding along parallel lines across the Atlantic. George Crane, owner, and David Thomas, superintendent of the Yniscedwyn Iron Works, had themselves conceived of the idea of using hot blast to smelt anthracite. Thomas was sent to Scotland to examine Neilson's installation and reproduced it at Yniscedwyn. Crane filed for a British patent on smelting iron with anthracite and hot blast in 1836 and received it in 1837. By the time the patent was sealed, Yniscedwyn was producing about 35 tons of iron using anthracite only as a fuel.Bartholomew & Metz, pp. 17–18", "Inspired both by Geisenhainer and Crane (whose success was closely followed by the LC&N), experiments in the US continued. Baughman, Guiteau and Company used an old furnace near Mauch Chunk to produce some anthracite iron during late 1837. They built another experimental furnace nearby, which was worked for about two months during fall and winter 1838 and for some time in 1839,Bartholomew & Metz, p. 19Gordon, pp. 155–156 but mechanical deficiencies led them to abandon the furnace at the end of 1839.Korson, p. 107 In the meantime, Pioneer Furnace, in Pottsville, was blown in using anthracite fuel in 1839.Gordon, p. 156 It was built by William Lyman obtained the aid of a Welsh emigrant, Benjamin Perry, who was familiar with Neilson's process and the Yniscedwyn works, for the blowing-in. The furnace ran for three months on anthracite alone and fulfilled the conditions to win the $5,000 prize.Gordon p. 156Bartholomew & Metz, pp. 31–32 In the design of Pioneer Furnace, Lyman had also been assisted by David Thomas, who had arrived in the United States in May 1839. Thomas was engaged by the LC&N to set up the Lehigh Crane Iron Company and its first furnace at Catasauqua, which went into blast in 1840, along with five other anthracite furnaces. This marked the commercial establishment of anthracite iron production in the United States.Bartholomew & Metz, pp. 32–33Gordon, pp. 156–157"]}, {"page": "List of Welsh Americans", "response": ["*David Thomas (1794–1882), prominent ironmaster and philanthropist during the Industrial Revolution in Pennsylvania"]}, {"page": "American Institute of Mining, Metallurgical, and Petroleum Engineers", "response": ["* 1871: David Thomas"]}, {"page": "List of people from Swansea", "response": ["*David Thomas"]}, {"page": "Boonton Iron Works", "response": ["*David Thomas (industrialist)"]}, {"page": "Hot blast", "response": ["Independently, George Crane and David Thomas, of the Yniscedwyn Works in Wales, conceived of the same idea, and Crane filed for a British patent in 1836. They began producing iron by the new process on February 5, 1837. Crane subsequently bought Gessenhainer's patent and patented additions to it, controlling the use of the process in both Britain and the US. While Crane remained in Wales, Thomas moved to the US on behalf of the Lehigh Coal & Navigation Company and founded the Lehigh Crane Iron Company to utilize the process."]}, {"page": "Lehigh Crane Iron Company", "response": ["The new company was named 'Crane' as a nod to, a thank you to and for George Crane, a British foundry owner whose kind understanding and support backed their desire to hire away his foundry's long time superintendent, ironmaster David Thomas, who had achieved regular successes in employing the new hot blast process and successfully worked out necessary additional methods to not only smelt iron, but produce fine quality cast iron and pig iron ready to make steel. These results positioned Crane's company's strongly to dominate British steel and iron manufacturing for decades.  Crane was grateful, so with a younger Thomas assistant already on hand, allowed Thomas his big chance for fortune.  LC&CN's Hazard not only hired him and paid his expenses to come to America and set up an ironworks using the new technique, but made him a partner in the enterprise in agreement of 31 December 1838.", "In 1837, the Yniscedwyn Works in Wales became the first ironworks in Britain to produce anthracite iron in commercial quantities, by use of the hot blast method. The works were owned by George Crane, and superintended by David Thomas. This discovery promised to provide a large market for anthracite, and the managers of the Lehigh Coal & Navigation Company wished to duplicate the process in the United States. After negotiations with Crane and Thomas, they were able to hire Thomas to emigrate and manage their proposed ironworks. The company was named in honor of Crane: it was organized on April 23, 1839 and incorporated on May 16, 1839, under a general act of the Pennsylvania Legislature. The LC&N supported the new company by granting them land and rights to water power (from the LC&N's canal) for their furnace.", "In 1855, David Thomas left his post as superintendent of the Crane Iron Company to oversee the new Thomas Iron Company. His son John Thomas succeeded him, and served until he, too, took over at Thomas Iron, and was succeeded by his brother-in-law Joshua Hunt.", "This was in part facilitated by improved transportation in the area. The Crane and Thomas Iron Companies wanted a railroad to bring local ore to their furnaces, but faced strong local opposition when attempting to gain a charter. As a compromise, the Catasauqua and Fogelsville Plank Road corporation was chartered on July 2, 1853, to build a plank road from the ore pits to the furnaces. A short section of plank road was constructed, but the exceptional weight of the ore wagons quickly destroyed it. Renewed efforts to palliate the local farmers were successful, and the plank road was renamed and rechartered on April 20, 1854 as the Catasauqua and Fogelsville Railroad. The C&F began hauling ore from the mines near Fogelsville in 1857. In 1864, it was further extended to a connection with the East Pennsylvania Railroad at Alburtis and in 1865, to the magnetite mines at Rittenhouse Gap. Improvements to the physical plant also occurred, building No. 6 stack in 1868. The company survived the Panic of 1873 and the subsequent poor iron market, and No. 5 stack was rebuilt in 1877, introducing new firebrick heat exchangers (stoves) to heat the blast, rather than the iron pipes heretofore used. No. 3 stack collapsed in 1879 while out of blast, and Nos. 1 and 2 were subsequently demolished. A new No. 1 and 3 were built, and the site of No. 2 used for stoves for the new furnaces, which were built in 1880 and put in service in 1881. Joshua Hunt resigned the superintendency on January 1, 1882, six months before the death of his father-in-law, David Thomas."]}, {"page": "Thomas Iron Company", "response": ["The Thomas Iron Company was a major iron-making firm in the Lehigh Valley from its organization in 1854 until its decline and eventual dismantling in the early 20th century. The firm was named in honor of its founder, David Thomas, who had emigrated to the United States in 1839 to introduce hot blast iron making in the Lehigh Valley, and now embarked on an independent ironmaking venture. The company's main and original plant was in Hokendauqua, Pennsylvania, which grew up around it; it also came to own blast furnaces and railroads elsewhere in the Lehigh Valley and mines in both Pennsylvania and New Jersey. Changes in the iron industry in the early Twentieth Century left Thomas Iron struggling to compete, and after a failed attempt at modernization and revival from 1913 to 1916, the company's assets were sold and largely dismantled during the 1920s.", "David Thomas, a Welsh ironmaster, had been brought to America in 1839 to introduce the hot blast manufacture of anthracite iron by the Lehigh Crane Iron Company.Bartholomew & Metz, pp. 21–23 Thomas projected his own company, which was organized on February 14, 1854 and chartered on April 4, 1854; it was named in his honor. Thomas left his post as superintendent at Lehigh Crane and was replaced by his son David Jr. He became trustee of real estate, while his son Samuel was appointed superintendent.Bartholomew & Metz, p. 167"]}, {"page": "Lock Ridge Park", "response": ["The park preserves portions of the former Lock Ridge Iron Works. The first furnace at the site was built in 1868 by the Lock Ridge Iron Company, on the line of the Catasauqua and Fogelsville Railroad near its junction with the East Pennsylvania Railroad. The company was taken over the next year by the Thomas Iron Company, and a second furnace put in blast shortly thereafter. The iron industry in the Lehigh Valley was then flourishing, and the Lock Ridge furnaces (designated No. 7 and No. 8 by Thomas Iron) were typical of the time. They used a hot blast to burn anthracite fuel (rather than the hitherto common charcoal) a technology brought to the United States by the company's founder, David Thomas, in 1839. However, by the early 20th century, the furnaces were, despite sporadic improvements, technologically out-of-date,Bartholomew & Metz, p. 56 and were reputedly the last anthracite iron furnaces to operate in the United States. President B.F. Fackenthal, of Thomas Iron, recommended they be decommissioned upon his resignation in 1913."]}, {"page": "List of Welsh inventors", "response": ["*David Thomas in 1837 invented a hot blast furnace process to make iron using anthracite coal in Ystradfera (Swansea Valley). transforming the iron-making process there and later in 1839 after re-locating to Pennsylvania where he became the \"father\" of the American steel industry with his invention."]}, {"page": "1882 in Wales", "response": ["*20 June – David Thomas, industrialist, 87"]}, {"page": "1790s in Wales", "response": ["**3 November - David Thomas, industrialist (d. 1882)"]}, {"page": "1794 in Wales", "response": ["*3 November - David Thomas, industrialist (d. 1882)"]}, {"page": "List of Pennsylvania state historical markers in Lehigh County", "response": ["|David Thomas"]}, {"page": "Biery's Port Historic District", "response": ["According to Lehigh Valley historian William H. Glace, David Thomas, a native of Glamorgan, South Wales who had become an iron worker at the age of 17 and then supervisor of the blast furnaces at \"the Yniscedwyn Iron Works in the Swansea Valley\", was recruited by Pennsylvania's Lehigh Coal and Navigation Company to erect \"a furnace and run it successfully for three months by the exclusive use of anthracite coal for fuel.\" Lehigh Coal then \"selected Biery's Port along the Canal, three miles above Allentown (afterwards named Catasauqua) as the locality for their great undertaking.\" Thomas, who emigrated from South Wales in 1839 and subsequently rented a home in Allentown with his family after arriving on July 9 of that year \"until the two-story frame dwelling at Biery's Port was completed for them by the Crane Iron Co.,\" successfully completed his initial assignment for Lehigh Coal, leading to the formation of the Lehigh Crane Iron Company (which later became known simply as the Crane Iron Company) and, in the process making him a wealthy man and local philanthropist. Per Glace, Thomas \"took much interest in the political, financial, religious and charitable affairs of the town, and therefore he came to be commonly recognized as its founder,\" and was also \"particularly concerned in the establishment and success of the First Presbyterian Church of Catasauqua, and encouraged temperance and thrift amongst the numerous workingmen under him.\"Glace, William H. Early History and Reminiscences of Catasauqua in Pennsylvania, pp. 19-33. Allentown, Pennsylvania: Searle & Dressler Co., Inc., 1914."]}, {"page": "Catasauqua Creek", "response": [" for it was chosen in 1839 as a mill stream by Erskine Hazard & Josiah White, co-founders of the Lehigh Coal & Navigation Company, along which to establish their new subsidiary: the Lehigh Crane Iron Company with imported Welsh expert David Thomas as superintendent to construct and operate blast furnaces."]}]}}