{"wiki_id": "http://www.wikidata.org/entity/Q5241289", "itemLabel": "David Woolf Marks", "itemDescription": "British rabbi", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Woolf_Marks", "wikipedia_page": {"main": "Reverend David Woolf Marks (22 November 1811 – 3 May 1909) was a Hebrew scholar and minister. He was the first religious leader of the West London Synagogue, which seceded from the authority of the Chief Rabbi, where he advocated a quasi-Karaite philosophy.\n\n", "link_mentions": [{"page": "Reform Judaism", "response": ["In 1840, several British Jews formed the West London Synagogue of British Jews, headed by Reverend David Woolf Marks. While the title \"Reform\" was occasionally applied to them, their approach was described as \"neo-Karaite\", and was utterly opposite to continental developments. Only a century later did they and other synagogues embrace mainland ideas and established the British Movement for Reform Judaism."]}, {"page": "Movement for Reform Judaism", "response": ["Concurrently, wealthy members of the Sephardi Mocatta and Ashkenazi Goldsmid families, who were related by marriage, were complaining about lack of decorum and rigid regulations in the Bevis Marks and Great Synagogue of London, respectively. The Mocattas were forced to walk miles on the Sabbath as an old communal ordinance banned forming prayer groups in a radius of ten miles from Bevis; Isaac Goldsmid vied for more clout with the wardens, and repeatedly protested against the protracted blessings for family members during services. They were also inclined to worship together. Eventually, a group of Mocattas, Goldsmids, Montefiores and other supporters withdrew from their two congregations on 15 April 1840, declaring their intention to found a house of worship for neither Sephardi nor Ashkenazi, but \"British Jews\". They appointed David Woolf Marks to lead services in their new West London Synagogue, dedicated on 27 January 1842. A former reader in Liverpool, he was deeply influenced by the \"neo-Karaite\" tendency and refused to cantillate the Torah on the second day of festivals, grounded only in rabbinic tradition. His stance suited the secessionists mainly on the practical level; Most never cared much for the bibliocentric issue but were content to abolish the second day."]}, {"page": "West London Synagogue", "response": ["On 15 April 1840, 24 members of the Mocatta, Goldsmid and other families announced their secession from their respective congregations, the Sephardi Bevis Marks Synagogue and the Ashkenazi Great Synagogue of London, and their intention to form a prayer group for neither \"German nor Portuguese\" Jews but for \"British Jews\", which would allow them to worship together. The Mocattas and Goldsmids had been quarrelling with the wardens and complaining over lack of decorum for years. The new prayer group, convening in Burton Street, hired Reverend David Woolf Marks in March 1841. Marks and the congregation adopted a unique, bibliocentric approach often termed \"neo-Karaism\" by their critics, largely rejecting the authority of the Oral Torah. They abolished the second day of festivals and excised various prayers grounded in rabbinic tradition. It was only after almost a century that the congregation adopted mainstream Reform Judaism."]}, {"page": "David Marks (disambiguation)", "response": ["* David Woolf Marks (1811–1909), English Reform Jewish minister"]}, {"page": "Pittsburgh Platform", "response": ["There were many early leaders of the \"Classical Reform\" ideology, including Rabbi Kaufmann Kohler (who presided over the Hebrew Union College), Rabbi Isaac Mayer Wise (who was instrumental in creating the institutions of Reform Judaism), and Rabbi David Woolf Marks."]}, {"page": "Julia Goodman", "response": ["One of Goodman's earliest original works was a portrait of Mr. Gilbert Abbott à Beckett. Other sitters included the Earl of Westmorland (who founded the Royal Academy of Music), Sir George A. MacFarren, Sir John Erichsen, Lady Martins, David Woolf Marks, Vere Lady Isham, the Hon. Mrs. Le Poer Tench, Countess Waldegrave, Sir Henry Taylor, Joaquin Cuadras (shown at the Exhibition of the Society of Female Artists in London in 1864),Jewish Chronicle March 18th 1864. Page 3 Colonel Thorpe of Guernsey, Colonel Thurburn, Charles Bertram, Miss Fanny Corbaux, Miss Beattie Kingston, Miss Kate Rorke, Dr. Van Oven, Dr. Francis Goldsmid, Henry Lemon, Rev. Dr. Lowy, Rev. Professor Marks, various members of the Mocatta family, Sir John Simon, and Charles Kensington Salaman. Other notable works that are documented are Abraham Soloman Esq. (Liverpool Society of Fine Arts, 1859), Sir F. L. Goldsmid, Bart. (Liverpool Society of Fine Arts, 1861), The Belle of the Ball (Liverpool Society of Fine Arts, 1862), T. Solamon Esq. (Liverpool Institute of Fine Arts, 1863), and Flora (Liverpool Institute of Fine Arts, 1865).The Liverpool Academy and Other Exhibitions of Contemporary Art in Liverpool 1774 - 1867. Edward Morris & Emma Roberts. Liverpool University Press and National Museums and Galleries on Merseyside (1998). Page 262."]}, {"page": "Harry Marks (journalist)", "response": ["Harry Marks was born in London on 9 April 1855, a younger child of David Woolf Marks and his wife Cecilia.Porter (2004) lists Harry as the \"fifth of six children\"; Who Was Who, meanwhile, records that he was the fifth son. Epstein (2006) notes that the family had \"two daughters and four sons\". Given that Claud Marks was born in 1863, per Porter, it is likely that Harry was the fifth child and third son. David Woolf Marks, who came from a London merchant family, was a prominent reformist rabbi at the West London Synagogue, and the professor of Hebrew at University College London. Harry's younger brother, Claud Marks, would go on to gain distinction in the Army, being awarded the Distinguished Service Order for his service in the Boer War.Epstein (2006)"]}, {"page": "Morris Joseph", "response": ["Morris David Joseph (28 May 1848, in London – 17 April 1930)Oxford Dictionary of National Biography studied at Jews' College, London, and in 1868 was appointed rabbi of the North London Synagogue; in 1874 he went to the Old Hebrew Congregation of Liverpool, where he officiated as preacher until 1882. He became delegate senior minister of the West London Synagogue in 1893, when David Woolf Marks retired from active service. Joseph published a collection of sermons, The Ideal in Judaism, London, 1893, and a valuable popular work on Jewish theology, Judaism as Creed and Life, in 1903. His position on Jewish religious belief and practice was conservative, midway between Reform and strict Orthodox.The Jewish Encyclopedia: A Descriptive Record of the History, Religion, Literature, and Customs of the Jewish People from the Earliest Times to the Present Day, Funk and Wagnalls, New York, 1906."]}, {"page": "Selig Newman", "response": ["At the same time, Newman taught Hebrew at the University of Oxford. As a Jew, Newman was debarred from a professorship, but among his pupils were many distinguished Christian and Jewish scholars, including Morris Jacob Raphall, David Woolf Marks, and future Archbishop of Canterbury Archibald Campbell Tait.  Newman left for the United States in about 1849 and settled in New York City, gaining a livelihood as teacher and writer. He died there in February 1871, and was buried in the Beth Olam Cemetery."]}, {"page": "Balls Pond Road Cemetery", "response": ["*Reverend David Woolf Marks (1811–1909), Hebrew scholar and minister, who was the first religious leader of the West London Synagogue"]}, {"page": "Albert Löwy", "response": ["Among his friends and fellow students there were Moritz Steinschneider and Abraham Benisch, with whom in 1838 he founded 'Die Einheit,' a proto-Zionist secret society of some two hundred students of the University, most of them Jews, who were endeavouring to promote the welfare of the Jews, one of their aims being to establish Jewish settlements in Palestine. In 1840 Löwy visited England to promote the society's aims (encountering mainly indifference), and there he settled for life. On the opening on 27 January 1842 of the reform West London Synagogue of British Jews, Löwy became one of the first two ministers; David Woolf Marks was the other. He ran the ran the congregation's school, and with his colleague he edited the prayer-book of the new congregation, which he served until 1892.", "*  With David Woolf Marks.", "*  With David Woolf Marks."]}]}}