{"wiki_id": "http://www.wikidata.org/entity/Q5240026", "itemLabel": "David Staniforth", "itemDescription": "English footballer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Staniforth_(footballer)", "wikipedia_page": {"main": "David Albry Staniforth (born 6 October 1950) is a former professional footballer who played in The Football League for Sheffield United, Bristol Rovers, Bradford City, and Halifax Town.\nHe played for Nottingham County Boys as a child, and in 1966 he was offered the chance to join Huddersfield Town; an offer which he rejected in order to stay in school. He later joined Sheffield United as an apprentice, and went on to play 26 times in the Football League First Division for The Blades, scoring three times, having joined the professional ranks in 1968.Bristol Rovers signed Staniforth from Sheffield United in 1974 for a fee of £20,000, and he went on to make 151 League appearances and score 32 goals for the West Country side during a five-year stay with the club. Bradford signed him in 1979 for a fee of £24,000, and after helping them to win promotion from the Football League Fourth Division he moved to Halifax Town as a player/coach in 1982. Halifax proved to be his final club, and he retired from football in 1984.\n\n", "link_mentions": [{"page": "Staniforth", "response": ["*David Staniforth (field hockey), hockey player", "*David Staniforth (footballer) (born 1950), English footballer"]}, {"page": "Clifton All Whites F.C.", "response": ["Professional clubs attempted to persuade Clifton All Whites to become a nursery club, but still the club policy is not to become tied to any one club. David Staniforth was the first player to make a career as a professional footballer, with Sheffield United.", "Ian Benjamin played for a number of clubs in a number of positions, mostly as a forward.  Phil Starbuck scored 43 goals from 245 appearances in the Football League playing for a number of different clubs.  David Staniforth played in The Football League for Sheffield United, Bristol Rovers, Bradford City, and Halifax Town.  Bert Bowery played in England and the United States as a striker.  Dave Smith played for Gillingham, where he made over 100 Football League appearances, Bristol City, Plymouth Argyle and Notts County.  Steve Baines was a professional player and later a referee in the Football League.  Devon White played as a striker for seven different Football League clubs."]}, {"page": "David Staniforth", "response": ["David Staniforth may refer to:", "* David Staniforth (field hockey) (born 1976), South African hockey player", "* David Staniforth (footballer) (born 1950), English footballer"]}]}}