{"wiki_id": "http://www.wikidata.org/entity/Q5240956", "itemLabel": "David Wells", "itemDescription": "Scottish medium", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Wells_(medium)", "wikipedia_page": {"main": "David Wells (born 8 June 1960) is a Scottish medium and astrologer. He has been featured as the main medium on Living TV's paranormal documentary series Most Haunted as well as its spin-off Most Haunted Live!.", "link_mentions": [{"page": "Carol Thatcher", "response": ["Thatcher appeared on Living TV's Most Haunted on 13 February 2007 as a celebrity guest alongside presenter Yvette Fielding and medium David Wells as well as Joanne Gregory to search for paranormal activity at Tatton Hall in Cheshire."]}, {"page": "Most Haunted", "response": ["* David Wells (Series 4–8 & 9: 2004–2007)", "The fourth series commenced on 23 March 2004 with an investigation of Owlpen Manor. Most Haunted Extra became a 30-minute programme, broadcast for half an hour after the main show on LivingTV. This series was the first series in which guest mediums joined the team during the investigations. This took some of the pressure off Derek Acorah who had been the only medium in the first three series. The main guest mediums involved during this series were Salisbury native Brian Shepherd, David Wells and Scunthorpe's Ian Lawman.", "For series six, beginning on 22 March 2005 with an investigation of Bodmin Gaol, David Wells became one of the main mediums alongside Derek Acorah appearing in every episode. ", "This was Derek Acorah's last Most Haunted series owing to the controversy he was involved in during its production which cast doubt on his ability to perform his role. As such he did not appear in the final episode at Sinai House. The number of episodes for Series 6 was originally intended to be 18, with the last 11 being part of Series 7. Due to Acorah's departure, the series was extended. This was the first series in which the team conducted 24-hour investigations over in the USA. Acorah didn't return for the show's finale at Sinai House when David Wells was the main medium.", "An investigation of South Stack Lighthouse began the ninth series on 2 January 2007. Four episodes into the series, new episodes became known as New Most Haunted in television listings and on-screen. This is the last series of Most Haunted where Most Haunted Extra accompanied each episode. After the first few episodes, Extra was moved to Living2. Most Haunted Extra last appeared accompanying Most Haunted: Midsummer Murders. This was the last series to feature David Wells as a regular medium on the show."]}, {"page": "List of astrologers", "response": ["*David Wells"]}, {"page": "Category talk:Astrology", "response": ["David Wells (medium)Stub"]}, {"page": "David Wells (disambiguation)", "response": ["David Wells (born 1963) is an American former baseball pitcher.", "David Wells may also refer to:", "*David Wells (admiral) (1918–1983), Australian Deputy Chief of Naval Staff (1970–1971)", "*David Wells (American football), player in the National Football League", "*David Wells (footballer) (born 1940), English footballer, defender for Rochdale", "*David Wells (medium) (born 1960), British astrologer and purported medium", "*David Wells (politician) (born 1962), Canadian senator from Newfoundland and Labrador"]}, {"page": "Farnborough College of Technology", "response": ["David Wells is most famous for working as a medium for the British paranormal investigation TV programme Most Haunted. Wells studied at FCOT, undertaking an HND in Leisure and Tourism. In Series 5 of Most Haunted Live! Access All Areas, Wells mentions he did a piece on both the Kings Theatre in Southsea, and on the New Theatre Royal in Portsmouth, as part of his HND at FCOT."]}, {"page": "Gordon Smith (psychic medium)", "response": ["In October 2005, Smith was revealed as the new medium on Living TV's Most Haunted, taking over from Derek Acorah. He appeared in Series 7 and three episodes of Series 8 before being replaced by David Wells."]}, {"page": "Kelloholm", "response": ["*David Wells, astrologer and spiritual medium."]}]}}