{"wiki_id": "http://www.wikidata.org/entity/Q5240481", "itemLabel": "David Townsend", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Townsend_(rower)", "wikipedia_page": {"main": "David G. H. Townsend (born 28 August 1955) is a British rower who competed in the 1976 Summer Olympics and in the 1980 Summer Olympics.", "link_mentions": [{"page": "King's School, Worcester", "response": ["| David Townsend || (1955–) || Rower, Bronze medallist at the 1980 Olympics"]}, {"page": "Rowing at the 1980 Summer Olympics", "response": ["| John BeattieIan McNuffDavid TownsendMartin Cross"]}, {"page": "Great Britain at the 1976 Summer Olympics", "response": ["*Richard Ayling, Bill Mason, Neil Keron, David Townsend"]}, {"page": "Great Britain at the 1980 Summer Olympics", "response": ["* John Beattie, David Townsend, Ian McNuff, and Martin Cross — Rowing, Men's Coxless Fours", "* John Beattie, David Townsend, Ian McNuff, Martin Cross"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|John BeattieIan McNuffDavid TownsendMartin Cross"]}, {"page": "Martin Cross", "response": ["In 1978 along with Beattie, David Townsend and McNuff he was a member of the British coxless four boat (coached by Tanner) which won the bronze medal in the 1978 World Rowing Championships at Karapiro, New Zealand behind Russia and East Germany. The following year in 1979 he was a member of the British coxless four boat (again with Beattie, Townsend and McNuff and coached by Tanner) which won the bronze medal in the 1979 World Rowing Championships at Bled, Yugoslavia behind East Germany and Czechoslovakia. In the 1980 Moscow Olympics with Beattie, Townsend and McNuff he was a crew member of the British boat which won the bronze medal in the Olympic coxless fours event behind East Germany and Russia. Coached by David Tanner"]}, {"page": "John Beattie (rower)", "response": ["In 1978 along with McNuff, David Townsend and Martin Cross he was a member of the British coxless four boat (coached by Tanner) which won the bronze medal in the 1978 World Rowing Championships at Karipiro, New Zealand behind Russia and East Germany. The following year in 1979 he was a member of the British coxless four boat (again with Beattie, Townsend and Cross and coached by Tanner) which won the bronze medal in the 1979 World Rowing Championships at Bled, Yugoslavia behind East Germany and Czechoslovakia.", "In the 1980 Moscow Olympics Ian McNuff, David Townsend and Martin Cross he was a crew member of the British boat which won the bronze medal in the Olympic coxless fours event behind East Germany and Russia. Coached by David Tanner."]}, {"page": "Ian McNuff", "response": ["In 1978 along with John Beattie, David Townsend and Martin Cross he was a member of the British coxless four boat (coached by Tanner) which won the bronze medal in the 1978 World Rowing Championships at Karipiro, New Zealand behind Russia and East Germany. The following year in 1979 he was a member of the British coxless four boat (again with Beattie, Townsend and Cross and coached by Tanner) which won the bronze medal in the 1979 World Rowing Championships at Bled, Yugoslavia behind East Germany and Czechoslovakia.", "In the 1980 Moscow Olympics John Beattie, David Townsend and Martin Cross he was a crew member of the British boat which won the bronze medal in the Olympic coxless fours event behind East Germany and Russia. Coached by David Tanner"]}, {"page": "David Townsend", "response": ["David Townsend may refer to:", "*David Townsend (art director) (1891–1935), American art director", "*David Townsend (cricketer, born 1912) (1912–1997), English cricketer", "*David Townsend (musician) (1955–2005), American musician", "*David Townsend (rower) (born 1955), British rower", "*David Townsend (Devon cricketer) (born 1965), former English cricketer"]}, {"page": "David Townsend (rowing)", "response": ["#REDIRECT David Townsend (rower)"]}, {"page": "1979 World Rowing Championships", "response": ["|  Martin Cross (b) David Townsend (2) Ian McNuff (3) John Beattie (s) ||06:06.65", "| Martin Cross, David Townsend, Ian McNuff, John Beattie"]}, {"page": "1978 World Rowing Championships", "response": ["|   Martin Cross (b) David Townsend (2) Ian McNuff (3) John Beattie (s)", "| Martin Cross, David Townsend, Ian McNuff, John Beattie (London RC)"]}, {"page": "The Boat Race 1983", "response": ["On 7 March 1983, Cambridge issued a statement suggesting that they might boycott the race following a dispute over Oxford's selection of Boris Rankov as a member of their crew. Veteran of the previous five Boat Races, all of which were Dark Blue victories, Cambridge argued Rankov was ineligible for inclusion as he was a lecturer at the university. Coach David Townsend of the University of London offered the services of his crew to provide an opponent for Oxford, should Cambridge refuse to participate. Rankov himself had offered to withdraw from the race, but the Dark Blues' committee rejected this. Cambridge finally agreed to race after they reached an agreement with Oxford to discuss and possibly tighten the eligibility criteria. This ultimately led to establishment of the so-called \"Rankov Rule\", which states that oarsmen will compete in the race no more than four times as an undergraduate and no more than four times as a graduate."]}, {"page": "Bill Mason (rowing coach)", "response": ["In 1974 he was part of an eight that won Great Britain's silver medal at the 1974 World Rowing ChampionshipsResults: 1974 World Rowing Championships World Rowing and in 1976 went to his second Olympics, where the crew of Mason, Richard Ayling, Neil Keron and David Townsend reached the semi finals of the men's coxless four. He won at Henley Royal Regatta three times as an athlete."]}, {"page": "Rowing at the 1980 Summer Olympics – Men's coxless four", "response": ["| 4 || John Beattie, Ian McNuff, David Townsend, Martin Cross ||  || 6:42.73", "| 1 || John Beattie, Ian McNuff, David Townsend, Martin Cross ||  || 6:12.71", "|  || John Beattie, Ian McNuff, David Townsend, Martin Cross ||  || 6:16.58"]}, {"page": "1975 World Rowing Championships", "response": ["| Ian Wilson, John Burch, Gordon Rankine, Stephen Irving, David Townsend, James MacLeod, Adrian Friend, David Sprague, Simon Jefferies (cox)"]}, {"page": "Rowing at the 1976 Summer Olympics – Men's coxless four", "response": ["| Richard Ayling Neil KeronBill Mason David Townsend", "| Neil KeronDavid TownsendRichard AylingBill Mason", "| Neil KeronDavid TownsendRichard AylingBill Mason"]}]}}