{"wiki_id": "http://www.wikidata.org/entity/Q5241016", "itemLabel": "David White", "itemDescription": "association football player from Scotland (1933-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_White_(Scottish_footballer)", "wikipedia_page": {"main": "David White (23 August 1933 – 17 July 2013) was a Scottish football player and manager. He played as a wing half for Clyde for his whole career, before managing Clyde, Rangers and Dundee.", "link_mentions": [{"page": "July 17", "response": ["*  2013   – David White, Scottish footballer and manager (b. 1933)"]}, {"page": "Rangers F.C.", "response": ["| David White || 1967–1969"]}, {"page": "Old Firm", "response": ["|align=left|David White"]}, {"page": "Dundee F.C.", "response": ["In 1973 under the management of David White and captaincy of Tommy Gemmell, the League Cup returned to Dens following a 1–0 win against Celtic.", "| David White || 1972–1977"]}, {"page": "Gordon Strachan", "response": ["Strachan began his career with Dundee, having decided to sign with the Scottish club at age 14. In joining the club, he rejected an approach from Manchester United, reasoning he had a better chance to establish himself in the first team at Dens Park. His natural talent was immediately apparent and he quickly earned a reputation as an outstanding player in the second team, twice winning the Scottish Reserve Player of the Year Award. He made his mark as an 18-year-old when he outplayed Alan Ball in a friendly with Arsenal in August 1975; The Sunday Post compared him to a young Billy Bremner. Strachan became a regular player in the 1975–76 season, the inaugural season of the Scottish Premier Division, featuring in 17 of the club's 36 league matches. However David White's \"Dee\" were relegated on the last day of the season after rivals Dundee United edged ahead on goal average with an unlikely draw with champions Rangers."]}, {"page": "David White", "response": ["* David White, better known as David Jason (born 1940), English actor and comedian", "* David White (actor) (1916–1990), American television actor, Bewitched", "* David White (musician) (1939–2019), doo-wop singer, Danny and the Juniors", "* David White (artist), British collage painter", "* David White, American singer for heavy metal band Heathen", "* David White (make-up artist), British film make-up artist", "* David White (sound editor), Australian film sound editor", "* David White (U.S. politician) (1785–1834), representative from Kentucky", "* David White (MP), Member of Parliament (MP) for Salisbury, 1378–1388", "* David White (Australian politician) (born 1944), Member of the Victorian Legislative Council from 1976–1996 and a member of the Kirner Ministry", "* David White (baseball) (born 1961), American-Australian baseball player", "* David White (New Zealand cricketer) (born 1961), New Zealand batsman", "* David White (English cricketer) (born 1967), English cricketer", "* David White (English footballer) (born 1967), for Manchester City", "* David White (Scottish footballer) (1933–2013), footballer and manager, Rangers F.C.", "* David White (South African cricketer) (born 1991), South African cricketer", "* David White (rugby league) (active 2000), English rugby league player", "* David White (geologist) (1862–1935), American ", "* David White (officer of arms) (born 1961), British heraldist and genealogist"]}, {"page": "Alex Miller", "response": ["Miller started his playing career with Clydebank Strollers before he made the move to Rangers. He played for Rangers from 1967 until 1982 and made 309 appearances during his spell at Ibrox, scoring 33 goals. After being coached by David White he was promoted to the first team, and won his first medal in the 1970 Scottish League Cup Final. He impressed the supporters having played in the 1971 Scottish Cup Final against Celtic despite having a broken jaw. However, under coach William Waddell, he was mostly a second choice player and was not in the squad in one of the biggest successes of the club's history, the triumph in the 1972 European Cup Winners' Cup Final."]}]}}