{"wiki_id": "http://www.wikidata.org/entity/Q5240893", "itemLabel": "David Wearing", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Wearing", "wikipedia_page": {"main": "David Wearing is a British writer and researcher who is a Teaching Fellow in International Relations and a specialist on UK foreign relations in the Middle East at Royal Holloway, University of London. His articles on domestic and international politics have been published by The Guardian, Le Monde Diplomatique, openDemocracy, ZNet, Liberal Conspiracy, and AlJazeera. He was also a founder and co-editor of the now defunct political website New Left Project. political website New Left Project.\n\nWearing was born in Dartford, Kent, and educated at Dartford Grammar School and Anglia Ruskin University, where he studied for a BA in European Philosophy and Literature. He later obtained an MSc in International Public Policy from University College London, where he undertook postgraduate research on British foreign policy in the Middle East. He completed a PhD at the School of Oriental and African Studies, researching Britain's relationship with the states of the Gulf Cooperation Council, under the supervision of Gilbert Achcar, before joining Royal Holloway in 2017 as a teaching fellow.In 2018, Wearing published AngloArabia: Why Gulf Wealth Matters to Britain, an overview of the United Kingdom's political and economic relationship with the Gulf Cooperation Council states, and in particular Saudi Arabia. Burhan Wazir in the New Statesman called the book \"important research on the macro nature of Gulf finances in Britain\". Owen Jones noted in the Guardian that the book highlights how \"Britain’s colossal current account deficit... is being financed by Gulf petrodollars, including from Saudi Arabia.\"", "link_mentions": [{"page": "One-state solution", "response": ["In response to the common argument given by proponents of the one state solution that Israel's settlements have become so entrenched in the West Bank that a Palestinian state is effectively impossible,  scholars such as Norman Finkelstein and Noam Chomsky have countered that it is far more unrealistic to expect Israel to accept a one-state solution that would spell the end of Zionism than it is to expect it to dismantle some settlements. According to David Wearing: \"Obstacles to the decolonisation of the Palestinian territories are certainly real, but should not be overstated. The settlements themselves take up very little space. It is the settlement blocs which dissect Palestinian territory, seize key natural resources and render unviable an independent state on the land that remains. Palestinian negotiators have produced detailed maps showing how, with those obstacles largely removed, an exchange of land equivalent to 1.9% of the West Bank could leave 63% of Israeli colonists in situ, and the Palestinians with a contiguous, viable state.\" Nathan Thrall has argued that Israel could implement a unilateral withdrawal at any time of its choosing and that the facts on the ground suggest that a single state is a remote possibility, writing that:"]}, {"page": "Media Lens", "response": ["David Wearing, writing in openDemocracy in September 2015, commented that while the group has \"a vocal, dedicated following\", it also has \"a long record of alienating potential allies with their purity tests and aggressive oversimplifications\"."]}, {"page": "List of School of Oriental and African Studies people", "response": ["*David Wearing, British writer and researcher"]}, {"page": "Template talk:Infobox person/Archive 27", "response": ["* David Wearing"]}, {"page": "Wearing, David", "response": ["#redirectDavid Wearing"]}, {"page": "Natives: Race and Class in the Ruins of Empire", "response": ["David Wearing of New Humanist lauded Akala's writing style, calling it in parts \"conversational\" and \"highly engaging\", and in other parts \"analytic\" and \"alive to nuance\". He praised the book's \"intimate and striking personal stories\" as well as its \"scrupulously fair and always humane\" tone, arguing that Akala demonstrates \"constant awareness of the reader's potential counter-arguments\"."]}, {"page": "Hostile Environment: How Immigrants Became Scapegoats", "response": ["Elsa Maishman of The Scotsman reviewed that the book was both an exploration of immigration history, which is particularly critical of perceived hypocrisy of left-wing anti-immigration politics, and a \"call to arms\" over how to move forwards on the topic of immigration. Maishman found the factual content \"thoughtful and eye-opening\" and the book overall \"thorough and even-handed\". Writing for The Guardian, David Lammy lauded the book as \"one of the most profound deconstructions\" of its subject matter, praising the emotion of the \"raw experiences\" and Goodfellow's ability to use first-hand stories to turn \"outrage into action\". David Wearing of New Humanist found it \"simple but urgently necessary\" that Goodfellow gives accounts of migrant's stories and perspectives throughout the book, treating them as \"ordinary people with their own legitimate concerns\". He reviewed it as a good companion to Priyamvada Gopal's Insurgent Empire (2019). Current Historys Bridget Anderson praised the writing as \"passionate and compelling\", positively reviewing the fact that Goodfellow discusses both the present and her desired future, and E.U. migration as well as colonial migration."]}]}}