{"wiki_id": "http://www.wikidata.org/entity/Q5241697", "itemLabel": "Davie Dodds", "itemDescription": "The Ell Eee Fant Man", "wikipedia_url": "https://en.wikipedia.org/wiki/Davie_Dodds", "wikipedia_page": {"main": "David Dodds (born 23 September 1958) is a Scottish former footballer who played for Dundee United, Aberdeen and Rangers in the 1980s. With United, he was a Scottish League champion in 1983 and was in their winning 1980 Scottish League Cup Final-winning team, scoring in the match. During his playing career he scored over 100 League goals. He earned two Scotland caps.", "link_mentions": [{"page": "Dundee United F.C.", "response": ["Jim McLean took over from Kerr in 1971 and under his management the club enjoyed the most successful era in its history. McLean's era became known for his youth policy and the offering of long-term contracts that would see future Scotland international players such as Dave Narey, Paul Sturrock, Paul Hegarty, Davie Dodds, Eamonn Bannon and Maurice Malpas spend the majority of their careers at the club.", "* 1976 Davie Dodds", "*  Davie Dodds"]}, {"page": "Davie", "response": ["* David Davie Dodds (born 1958), Scottish former footballer"]}, {"page": "Alan Brazil", "response": ["His international appearances were limited as Scotland had a number of other strikers at this time such as Kenny Dalglish, Charlie Nicholas, Mo Johnston, Steve Archibald, Paul Sturrock, Joe Jordan, Frank McAvennie, Davie Dodds, Frank McGarvey and Andy Gray who were preferred to Brazil."]}, {"page": "Jim McLean", "response": ["McLean was first team coach at Dundee for 18 months. In November 1971 the club's manager John Prentice announced that he would resign at the end of that year; many outside observers assumed that McLean would become their manager. Instead he became manager of their local rivals Dundee United, where he replaced the retiring Jerry Kerr. McLean immediately started a co-ordinated youth policy which was to produce many fine young players over the two decades which followed; he had personally visited Ralph Milne, John Holt, and Davie Dodds to encourage them to sign for United rather than for Celtic, Aston Villa, and rivals Dundee respectively. In the short term, he used his knowledge of the Scottish scene to buy experienced players who would allow him to re-shape both the squad and the style of play in line with his approach to coaching."]}, {"page": "1983–84 European Cup", "response": ["|align=\"left\"| Davie Dodds"]}, {"page": "New Firm (Scotland)", "response": ["* Davie Dodds"]}, {"page": "1983–84 in Scottish football", "response": ["|John Robertson, Davie Dodds"]}, {"page": "Ralph Milne", "response": ["Milne was naturally right-footed, though trained hard with his left foot as a boy to become equally skilled with both feet. Former Dundee United teammate Paul Hegarty stated that Milne possessed great pace, as well as bravery, a good work ethic, and an ability to score important goals. Another former Dundee United teammate, Davie Dodds, said that Milne was as good a finisher as any player in Scottish football during the 1980s."]}, {"page": "Willie Pettigrew", "response": ["In 1979, Dundee United purchased Pettigrew for £100,000. He went on to win the 1979 Scottish League Cup Final with United, scoring two goals in a 3–0 replay win against Aberdeen. He also played in the winning 1980 Final team, but this time the goals were scored by the two strikers who were the club's first choice pairing for the next few seasons, Paul Sturrock and Davie Dodds."]}, {"page": "List of Dundee United F.C. records and statistics", "response": ["|3||align=left|Davie Dodds || 150 || 356 || 0.45"]}]}}