{"wiki_id": "http://www.wikidata.org/entity/Q5241730", "itemLabel": "Davies Gilbert", "itemDescription": "scientist and mathematician, President of the Royal Society, M.P.", "wikipedia_url": "https://en.wikipedia.org/wiki/Davies_Gilbert", "wikipedia_page": {"main": "Davies Gilbert  (born Davies Giddy, 6 March 1767 – 24 December 1839) was a Cornish engineer, author, and politician. He was elected to the Royal Society on 17 November 1791 and served as President of the Royal Society from 1827 to 1830. He changed his name to Gilbert in 1817.", "link_mentions": [{"page": "Cornwall", "response": ["Saint Piran's Flag is the national flag and ancient banner of Cornwall,Payton (2004), p. 262. and an emblem of the Cornish people. It is regarded as the county flag by Cornwall Council. The banner of Saint Piran is a white cross on a black background (in terms of heraldry 'sable, a cross argent'). According to legend Saint Piran adopted these colours from seeing the white tin in the black coals and ashes during his discovery of tin.Davies Gilbert in 1826 described it as anciently the flag of St Piran and the banner of Cornwall, and another history of 1880 said that: \"The white cross of St. Piran was the ancient banner of the Cornish people.\" The Cornish flag is an exact reverse of the former Breton black cross national flag and is known by the same name \"Kroaz Du\"."]}, {"page": "Charles Babbage", "response": ["Babbage now emerged as a polemicist. One of his biographers notes that all his books contain a \"campaigning element\". His Reflections on the Decline of Science and some of its Causes (1830) stands out, however, for its sharp attacks. It aimed to improve British science, and more particularly to oust Davies Gilbert as President of the Royal Society, which Babbage wished to reform. It was written out of pique, when Babbage hoped to become the junior secretary of the Royal Society, as Herschel was the senior, but failed because of his antagonism to Humphry Davy. Michael Faraday had a reply written, by Gerrit Moll, as On the Alleged Decline of Science in England (1831). On the front of the Royal Society Babbage had no impact, with the bland election of the Duke of Sussex to succeed Gilbert the same year. As a broad manifesto, on the other hand, his Decline led promptly to the formation in 1831 of the British Association for the Advancement of Science (BAAS)."]}, {"page": "Catenary", "response": ["The curve was studied 1826 by Davies Gilbert and, apparently independently, by Gaspard-Gustave Coriolis in 1836."]}, {"page": "Humphry Davy", "response": ["Davy was born in Penzance, Cornwall, in the Kingdom of Great Britain on 17 December 1778, the eldest of the five children of Robert Davy, a woodcarver, and his wife Grace Millett. According to his brother and fellow chemist John Davy, their hometown was characterised by \"an almost unbounded credulity respecting the supernatural and monstrous ... Amongst the middle and higher classes, there was little taste for literature, and still less for science ... Hunting, shooting, wrestling, cockfighting, generally ending in drunkenness, were what they most delighted in.\" At the age of six, Davy was sent to the grammar school at Penzance. Three years later, his family moved to Varfell, near Ludgvan, and subsequently, in term-time Davy boarded with John Tonkin, his godfather and later his guardian. On leaving Penzance grammar school in 1793, Tonkin paid for Davy to attend Truro Grammar School to finish his education under the Rev Dr Cardew, who, in a letter to Davies Gilbert, said dryly, \"I could not discern the faculties by which he was afterwards so much distinguished.\" Yet, Davy entertained his school friends by writing poetry, composing Valentines, and telling stories from One Thousand and One Nights. Reflecting on his school days in a letter to his mother, Davy wrote, \"Learning naturally is a true pleasure; how unfortunate then it is that in most schools it is made a pain.\" \"I consider it fortunate,\" he continued, \"I was left much to myself as a child, and put upon no particular plan of study ... What I am I made myself.\" His brother, moreover, claimed Davy possessed a \"native vigour\" and \"the genuine quality of genius, or of that power of intellect which exalts its possessor above the crowd.\"", "Thomas Beddoes and John Hailstone were engaged in a geological controversy on the rival merits of the Plutonian and Neptunist hypotheses. They travelled together to examine the Cornish coast accompanied by Davies Gilbert and made Davy's acquaintance. Beddoes, who had established at Bristol a 'Pneumatic Institution,' needed an assistant to superintend the laboratory. Gilbert recommended Davy, and in 1798 Gregory Watt showed Beddoes the Young man's Researches on Heat and Light, which were subsequently published by him in the first volume of West-Country Contributions. After prolonged negotiations, mainly by Gilbert, Mrs Davy and Borlase consented to Davy's departure, but Tonkin wished him to remain in his native town as a surgeon, and altered his will when he found that Davy insisted on going to Dr Beddoes.", "In this year the first volume of the West-Country Collections was issued. Half consisted of Davy's essays On Heat, Light, and the Combinations of Light, On Phos-oxygen and its Combinations, and on the Theory of Respiration. On 22 February 1799 Davy, wrote to Davies Gilbert, \"I am now as much convinced of the non-existence of caloric as I am of the existence of light.\" In another letter to Gilbert, on 10 April, Davy informs him: \"I made a discovery yesterday which proves how necessary it is to repeat experiments. The gaseous oxide of azote (the laughing gas) is perfectly respirable when pure. It is never deleterious but when it contains nitrous gas. I have found a mode of making it pure.\" He said that he breathed sixteen quarts of it for nearly seven minutes, and that it \"absolutely intoxicated me.\" ", "In February 1801 Davy was interviewed by the committee of the Royal Institution, comprising Joseph Banks, Benjamin Thompson (who had been appointed Count Rumford) and Henry Cavendish. Davy wrote to Davies Gilbert on 8 March 1801 about the offers made by Banks and Thompson, a possible move to London and the promise of funding for his work in galvanism. He also mentioned that he might not be collaborating further with Beddoes on therapeutic gases. The next day Davy left Bristol to take up his new post at the Royal Institution, it having been resolved 'that Humphry Davy be engaged in the service of the Royal Institution in the capacity of assistant lecturer in chemistry, director of the chemical laboratory, and assistant editor of the journals of the institution, and that he be allowed to occupy a room in the house, and be furnished with coals and candles, and that he be paid a salary of 100l. per annum.'", "Banks had groomed the engineer, author and politician Davies Gilbert to succeed him and preserve the status quo, but Gilbert declined to stand. Fellows who thought royal patronage was important proposed Prince Leopold of Saxe-Coburg (later Leopold I of Belgium), who also withdrew, as did the Whig Edward St Maur, 11th Duke of Somerset. Davy was the outstanding scientist but some fellows did not approve of his popularising work at the Royal Institution.", "In the event he was again re-elected unopposed, but he was now visibly unwell. In January 1827 he set off to Italy for reasons of his health. It did not improve and, as the 1827 election loomed, it was clear that he would not stand again. He was succeeded by Davies Gilbert."]}, {"page": "A Christmas Carol", "response": ["Celebrating the Christmas season had been growing in popularity through the Victorian era. The Christmas tree had been introduced in Britain during the 18th century, and its use was popularised by Queen Victoria and Prince Albert. Their practice was copied in many homes across the country. In the early 19th century there had been a revival of interest in Christmas carols, following a decline in popularity over the previous hundred years. The publication of Davies Gilbert's 1823 work Some Ancient Christmas Carols, With the Tunes to Which They Were Formerly Sung in the West of England and William Sandys's 1833 collection Christmas Carols, Ancient and Modern led to a growth in the form's popularity in Britain."]}, {"page": "Clifton Suspension Bridge", "response": ["These funds raised during the first few months of 1830 were not sufficient for the construction. Despite this Brunel produced a new proposal costing £10,000 less than Telford's design and gained support for it in the local press. James Meadows Rendel, William Armstrong and William Hill also submitted new, cheaper proposals, complaining that the committee had not set a budget. In 1831 a second competition was held, with new judges including Davies Gilbert and John Seaward examining the engineering qualities of the proposals. Thirteen designs were submitted; Telford's was the only one in which the chains achieved the weight per square inch required by the judges but it was rejected as being too expensive. The winner was declared to be a design by Smith and Hawkes of the Eagle Foundry in Birmingham. Brunel had a personal meeting with Gilbert and persuaded him to change the decision. The committee then declared Brunel the winner and he was awarded a contract as project engineer. The winning design was for a suspension bridge with fashionably Egyptian-influenced towers. In 2010, newly discovered letters and documents revealed that, in producing his design, Brunel had taken advice from his father, Sir Marc Isambard Brunel. The elder Brunel had recommended including a central support for the bridge, as he did not believe a single-span bridge of such length could be constructed. His son chose to ignore his advice."]}, {"page": "Saint Piran's Flag", "response": ["The earliest known evidence of this flag was recorded by Davies Gilbert in his 1838 work: The Parochial History of Cornwall, in which he gives reference to"]}, {"page": "Furry Dance", "response": ["The music is provided by Helston Town Band, augmented by members of other local bands. They play from memory, as it is suggested that the music for the dance has never been written down. However it was at various times, such as by Davies Gilbert in 1823. In 1890 Cornish antiquarian Margaret Ann Courtney wrote that the tune was sometimes known as \"John the Bone\".Courtney, M. A. (1890) Folklore and Legends of Cornwall  the following rhyme often being attached to the tune by local children,"]}, {"page": "1839 in science", "response": ["* December 24 – Davies Gilbert (born 1767), English promoter of science."]}]}}