{"wiki_id": "http://www.wikidata.org/entity/Q5242192", "itemLabel": "Davy Fogel", "itemDescription": "UDA Member", "wikipedia_url": "https://en.wikipedia.org/wiki/Davy_Fogel", "wikipedia_page": {"main": "David \"Davy\" Fogel, also known as \"Big Dave\" (born 1945), was a former loyalist and a leading member of the loyalist vigilante Woodvale Defence Association (WDA) which later merged with other groups becoming the Ulster Defence Association (UDA). Born in London, Fogel was a former British soldier who had served in Northern Ireland before marrying a local Belfast woman and settling down with his family in Woodvale, Belfast.\nIn June 1970 at a pigeon fanciers' club, he militarised the Woodvale Defence Association (WDA) and trained them as a military unit. He continued to instruct the new UDA recruits in military tactics and gave lectures on Army and police interrogation methods and urban guerrilla fighting. He was the second-in-command to the WDA's leader and the UDA's first commander, Charles Harding Smith. Fogel was the leader of the UDA's B Company, 2nd Battalion, West Belfast Brigade and enjoyed much prestige in 1972, having erected the first UDA street barricades and roadblocks in Woodvale. He left the organisation early in 1973 after he was ousted from power during an internal feud.", "link_mentions": [{"page": "Ulster Defence Association", "response": ["By this point, Charles Harding Smith had become the group's leader, with former British soldier Davy Fogel as his second-in-command, who trained the new recruits in military tactics, the use of guns, and unarmed combat. Its most prominent early spokesperson was Tommy Herron; however, Andy Tyrie would emerge as leader soon after.H. McDonald and J. Cusack, UDA – Inside the Heart of Loyalist Terror, Dublin, Penguin Ireland, 2004, pp. 64–65 Its original motto was Cedenta Arma Togae (\"Law before violence\") and it was a legal organisation until it was banned by the British Government on 10 August 1992."]}, {"page": "Loyalist Association of Workers", "response": ["The lack of a fully formalised structure meant that the LAW lost the vast majority of its membership following the formation of the Ulster Workers' Council (UWC) and ceased to exist in the middle of 1974. According to Henry McDonald and Jim Cusack the UWC was established by Harry Murray because he wanted a loyalist workers group that was nonetheless independent of paramilitary control whilst the LAW was wholly run by the UDA.McDonald & Cusack, p. 74 Davy Fogel would also claim that the LAW was \" a front organisation for us [the UDA]\".Wood, p. 16 However, the LAW was notable because it pioneered the idea of using industrial action to advance the demands of unionism, which reached fruition with the Ulster Workers Council Strike."]}, {"page": "Fogel", "response": ["* Davy Fogel (born 1945), British soldier"]}, {"page": "Billy Hull", "response": ["In 1971 Hull had co-operated closely with Jim Anderson in helping to organise a local \"defence association\" of vigilantes in the mid-Shankill area.Henry McDonald & Jim Cusack, UDA – Inside the Heart of Loyalist Terror, Penguin Ireland, 2004, p. 19 This group was swiftly merged with a number of similar like-minded groups to form the Ulster Defence Association (UDA) and from 1972–73 Hull would serve as a member of the UDA's Inner Council, the name given to a group of prominent members who met regularly to decide the direction of the movement.Michael Farrell, Northern Ireland: The Orange State Hull was prominent in the early years of the UDA and in 1972 was one of three members, along with Tommy Herron and Davy Fogel, to meet Secretary of State for Northern Ireland William Whitelaw at Parliament Buildings to discuss the growing problem of violence at interface areas in Belfast.McDonald & Cusack, UDA, p. 30 In November of the same year he also accompanied Herron on a trip to Canada where the pair hoped to present the loyalist case and develop links with groups representing Northern Irish emigrants.McDonald & Cusack, UDA, p. 39"]}, {"page": "Tommy Herron", "response": ["For much of 1972 Herron's main rival Charles Harding Smith, the leader of the West Belfast UDA, was absent from the scene after being arrested in England on gun-running charges. During his absence control on West Belfast went into the hands of Davy Fogel and his ally Ernie Elliott, both of whom had been influenced to varying degrees by left-wing rhetoric. Whilst Herron was not involved in initiatives by both men that saw dialogue with the Catholic Ex-Servicemen's Association of Ardoyne or the Official IRA he did accompany them to a meeting with representatives of the British & Irish Communist Organisation which, unusually for communist groups, followed a staunchly unionist position with regards Northern Ireland.Wood, Crimes of Loyalty, pp. 16–17"]}, {"page": "Charles Harding Smith", "response": ["A former soldier in the British Army Smith, at the time residing in Rosebank Street on the Shankill Road, called a meeting of other locals at the Leopold Street Pigeon Fanciers Club to develop a response to attacks by republicans from the neighboring Ardoyne area. The location was chosen because Smith was himself a pigeon fancier and a member of the club.Peter Taylor, Loyalist, Bloomsbury, 2000, p. 101 At the meeting, it was agreed to establish a vigilante group, the Woodvale Defence Association (WDA), with Smith in command assisted by Davy Fogel, who organised military drilling for the forty or so recruits, and Ernie Elliott.Henry McDonald & Jim Cusack, UDA: Inside the Heart of Loyalist Terror, Penguin Ireland, 2004, pp. 18–19", "By the time Smith returned to Belfast in December 1972 there had been changes in the UDA with Tommy Herron in effective control of the organisation and Davy Fogel the dominant figure amongst the WDA. Smith immediately took back control of his west Belfast stronghold, threatening Fogel with death if he didn't fall into line. Fogel, a close ally of Ernie Elliott, who was killed in circumstances that Smith had been rumoured to be involved in, although it was later determined that Elliott was shot dead after a drunken brawl on Sandy Row had descended into a gunfight, decided it was best not to go up against Smith and stood down.McDonald & Cusack, UDA, p. 34"]}, {"page": "David Fogel", "response": ["*Davy Fogel (born 1945), Northern Irish paramilitary"]}]}}