{"wiki_id": "http://www.wikidata.org/entity/Q5240967", "itemLabel": "David Wenlock", "itemDescription": "cricketer (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Wenlock", "wikipedia_page": {"main": "David Alan Wenlock (born 16 April 1959) is a former English cricketer. Wenlock was a right-handed batsman who bowled right-arm medium pace. He was born in Leicester, Leicestershire.\nWenlock made his first-class debut for Leicestershire against Oxford University in 1980. He 9 further first-class appearances for Leicestershire, the last of which came against Northamptonshire in the 1992 County Championship. He scored 148 runs in his 10 first-class matches, at an average of 16.44, with a high score of 62. This score, his only first-class half century, came against the touring Sri Lankans in 1981. With the ball, he took 7 wickets at bowling average of 38.28, with best figures of 3/50. He made his List A debut for Leicestershire in the 1980 John Player League against Sussex. He made 31 further List A appearances for Leicestershire, the last of which came against Northamptonshire in the 1982 John Player League. In his 33 limited-overs appearances for the county, he scored 126 runs at an average of 10.50, with a high score of 22. With the ball, he took 32 wickets at an average of 24.96, with best figures of 3/32.He later joined Staffordshire, making his debut for the county against Hertfordshire in the 1985 Minor Counties Championship. He played Minor counties cricket for Staffordshire in 1985 and 1986, making 2 appearances each in the Minor Counties Championship and MCCA Knockout Trophy. He made his only List A appearance for Staffordshire against Nottinghamshire in the 1985 NatWest Trophy. In this match, he was dismissed for a duck by Kevin Saxelby, while with the ball he bowled 12 wicket-less overs for the cost of 45 runs.", "link_mentions": [{"page": "List of people named David", "response": ["*David Wenlock (born 1959), English cricketer"]}, {"page": "Wenlock, David", "response": ["#redirectDavid Wenlock"]}]}}