{"wiki_id": "http://www.wikidata.org/entity/Q5258688", "itemLabel": "Dennis Main Wilson", "itemDescription": "producer (1924-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Main_Wilson", "wikipedia_page": {"main": "Dennis Geoffrey William Wilson, known as Dennis Main Wilson (1 May 1924 – 20 January 1997) was a British producer of radio and television programmes, mainly for the BBC. Main Wilson has been described by Screenonline as \"arguably the most important and influential of all comedy producers/directors in British radio and television\".", "link_mentions": [{"page": "Harry Secombe", "response": ["Secombe met Michael Bentine at the Windmill Theatre, and he was introduced to Peter Sellers by his agent Jimmy Grafton. Both Milligan and Sellers credited him with keeping the act on the bill when club owners had wanted to sack them. Together with Spike Milligan, the four wrote a comedy radio script, and Those Crazy People was commissioned\"Comedy The Goon Show\", BBC website and first broadcast on 28 May 1951. Produced by Dennis Main Wilson, this soon became The Goon Show and the show remained on the air until 1960. Secombe mainly played Neddie Seagoon, around whom the show's absurd plots developed. In 1955, whilst appearing on The Goon Show, Secombe was approached by the BBC to step in at short notice to take the lead in the radio comedy Hancock's Half Hour. The star of the show, Tony Hancock, had decided to take an unannounced break abroad the day before the live airing of the second season. Secombe appeared in the lead for the first three episodes and had a guest role in the fourth after Hancock's return. All four episodes are lost, but following the discovery of the original scripts the episodes were rerecorded in 2017, with Andrew Secombe performing the role held by his late father."]}, {"page": "The Goon Show", "response": ["The series had its premiere in May 1951 and audience figures grew rapidly, from around 370,000 to nearly two million by the end of the 17th show. No recordings of any episode of this series are known to have survived. The BBC commissioned a second series and a number of other changes occurred. The musical interludes were shortened, and Max Geldray joined the lineup. Peter Eton, from the BBC's drama department, replaced Dennis Main Wilson as producer. Eton brought stricter discipline to the show's production. He was also an expert at sound effects and microphone technique, ensuring that the show became a far more dynamic listening experience. However, a few episodes into the series Milligan suffered a major nervous breakdown. He was hospitalised in early December 1952,:136-139 just before the broadcast of episode five, but it, and the following episode, had already been written, and the next 12 episodes were co-written by Stephens and Grafton. Milligan was absent as a performer for about two months, returning for episode 17, broadcast in early March 1953. As with Series 2, all episodes were co-written by Milligan and Stephens and edited by Jimmy Grafton.", "The first two series were mostly produced by Dennis Main Wilson; none of the episodes was given an individual title and these early shows were loosely structured and consisted of four or five unconnected sketches, separated by musical items. According to later producer Peter Eton, the musical segments took up around half the programme.:113 In this formative phase the show co-starred Milligan (who played only minor roles in the early shows), Sellers, Secombe and Michael Bentine as the nominal 'hero' of each episode, madcap inventor Dr Osric Pureheart.:124 Musical performances were by virtuoso jazz harmonica player Max Geldray, singer Ray Ellington and his quartet (both of whom were recruited by Dixon) and vocal group the Stargazers, but they left after Episode 6 of Series 2, and for the remaining episodes Secombe filled in, singing a straight vocal number.:124 Incidental, theme and backing music was provided by Stanley Black and the BBC Dance Orchestra.:127 Series 2 also saw the first appearances of popular characters Minnie Bannister (Milligan) and Henry Crun (Sellers)."]}, {"page": "Kenneth Williams", "response": ["Williams's professional career began in 1948 in repertory theatre. Failure to become a serious dramatic actor disappointed him, but his potential as a comic performer gave him his break when he was spotted playing the Dauphin in Bernard Shaw's St Joan in the West End, in 1954 by radio producer Dennis Main Wilson. Main Wilson was casting Hancock's Half Hour, a radio series starring Tony Hancock. Playing mostly funny voice roles, Williams stayed in the series almost to the end, five years later. His nasal, whiny, camp-cockney inflections (epitomised in his \"Stop messing about ... !\" catchphrase) became popular with listeners. Despite the success and recognition the show brought him, Williams considered theatre, film and television to be superior forms of entertainment. In 1955 he appeared in Orson Welles's London stage production Moby Dick—Rehearsed. The pair fell out after Williams became annoyed with Welles's habit of continually changing the script."]}, {"page": "Tony Hancock", "response": ["* Omnibus: Hancock (1985): a BBC documentary which seriously looked at Hancock's life and work, and his legacy. With contributions by Beryl Vertue, Galton & Simpson, Bill Kerr and producers Dennis Main Wilson and Duncan Wood."]}, {"page": "Marty Feldman", "response": ["In 1974, Dennis Main Wilson produced a short BBC sketch series for Feldman titled Marty Back Together Again — a reference to reports about the star's health — but it never captured the impact of the earlier series. Marty proved popular enough with an international audience (the first series winning the Golden Rose Award at Montreux) to launch a film career. Feldman's first feature film role was in Every Home Should Have One (1970). "]}, {"page": "Hancock's Half Hour", "response": ["The radio version was produced by Dennis Main Wilson for most of its run. After Main Wilson departed for his television career, his role was taken by Tom Ronald. The television series was produced by Duncan Wood. The distinctive tuba-based theme tune was composed by Angela Morley, then known by her original name, Wally Stott."]}, {"page": "Citizen Smith", "response": ["John Sullivan became a scenery shifter at the BBC in 1974  because of his desire to write a sitcom outline he had called Citizen Smith; fearing rejection if he sent the idea in, he decided it would be better to get a job, any job, at the BBC, learn more about the business and then meet someone who would actually take notice of his as yet unwritten script. After he approached producer Dennis Main Wilson, the first Citizen Smith script was written. Main Wilson loved the script, and saw the potential for a series; it was put into production almost immediately as a pilot for Comedy Special—a showcase for new talent, which had succeeded Comedy Playhouse—under the title Citizen Smith. The pilot was a success, and four series and a Christmas special were produced between 1977 and 1980."]}, {"page": "Chesney and Wolfe", "response": ["Around the same time, the two men created The Rag Trade (1961–63), starring Peter Jones as Harold Fenner, ungenerous head of Fenner Fashions, Miriam Karlin as the shop steward, Paddy, and Reg Varney as the foreman trying to mediate the conflict between employer and employed in a London East End sweat-shop. Sheila Hancock and Barbara Windsor were also in the cast, plus the diminutive Esma Cannon. Directed (and produced) by Dennis Main Wilson, Karlin wrote in her autobiography that Main Wilson had an \"amazing capacity for picking the right people\" for a cast."]}, {"page": "John Sullivan (writer)", "response": ["During this time, Sullivan continued to submit scripts to the BBC. Sullivan admired Steptoe and Son, Till Death us do Part and Phil Silvers' US show, Bilko, and \"anything by Neil Simon\" before in November 1974Only Fools and Horses: The Story of Britain's Favourite Comedy – Graham McCann getting a job in the BBC props department. He was warned not to pester or approach the stars of the corporation. He eventually approached television producer Dennis Main Wilson with a script about a young Marxist. This led to a pilot for Comedy Special in 1977 which, following a positive reaction, was commissioned for a full series, Citizen Smith (1977–80). Citizen Smith ran for four series, after which Sullivan was asked to submit another idea. An initial idea for a comedy set in the world of football was rejected, so he proposed an alternative idea for a sitcom centring on a cockney market trader in working-class, modern-day London called Readies."]}, {"page": "Colfe's School", "response": ["*Dennis Main Wilson, producer of television and radio comedy.Telegraph Obituary 25 January 1997"]}, {"page": "List of The Goon Show episodes", "response": ["| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson", "| Dennis Main Wilson"]}, {"page": "The Man Who Could Work Miracles (short story)", "response": ["It was first adapted for BBC Radio in 1934 by Laurence Gilliam and broadcast on 4 June that year.Radio Times, Issue 557, 4 June 1934 It continued to be adapted on several occasions for BBC Radio, including 1956 by Dennis Main Wilson and broadcast on New Year's Day. It starred Tony Hancock as Fotheringay."]}, {"page": "1997 in the United Kingdom", "response": ["* 20 January – Dennis Main Wilson, broadcast producer (born 1924)"]}, {"page": "1924 in the United Kingdom", "response": ["* 1 May – Dennis Main Wilson, broadcast comedy producer (died 1997)"]}, {"page": "For Richer...For Poorer", "response": ["The show had many overlaps with Till Death Us Do Part. It had the same writer (Johnny Speight) and producer (Dennis Main Wilson). Both shows took their titles from the traditional wedding vows, and Bert was seen as the left-wing equivalent of Alf Garnett."]}, {"page": "1924 in radio", "response": ["*1 May – Dennis Main Wilson, English broadcast comedy producer (d. 1997)"]}, {"page": "Denis Main Wilson", "response": ["#REDIRECT Dennis Main Wilson"]}, {"page": "1997 in radio", "response": ["* 20 January – Dennis Main Wilson, 72, English broadcast comedy producer."]}, {"page": "List of people with surname Wilson", "response": ["** Dennis Main Wilson (1924–1997), British television and radio producer"]}, {"page": "Derek Roy (comedian)", "response": ["His BBC Radio show, Hip Hip Hoo Roy, was written by amongst others Spike Milligan, and was the show where Milligan's Goon Show character Eccles first appeared. Roy's unsuccessful star-vehicle Happy Go Lucky also gave the first writing break to Ray Galton and Alan Simpson, who would soon team up with the show's last producer Dennis Main Wilson to create Hancock's Half Hour."]}, {"page": "The Lady Is a Tramp (TV series)", "response": ["* Directors: Douglas Argent & Dennis Main Wilson"]}, {"page": "1997 in British radio", "response": ["*20 January – Dennis Main Wilson, 72, broadcast comedy producer"]}, {"page": "Dennis Wilson (disambiguation)", "response": ["*Dennis Main Wilson (1924–1997), British television and radio producer"]}, {"page": "British Academy Television Award for Best Scripted Comedy", "response": ["| Till Death Us Do Part || Dennis Main Wilson"]}, {"page": "Deaths in January 1997", "response": ["*Dennis Main Wilson, 72, British radio and television producer, lung cancer."]}, {"page": "Dennis Main-Wilson", "response": ["#REDIRECT Dennis Main Wilson"]}, {"page": "1924 in British radio", "response": ["*1 May - Dennis Main Wilson, broadcast comedy producer (died 1997)"]}, {"page": "British Academy Television Award for Best Entertainment Programme", "response": ["| Dennis Main Wilson || Scott on BirdsScott on MoneyThe Roy Castle ShowHere I Come Whoever I AmTill Death Do Us Part ", "| style=\"text-align:center;\"|1969 || style=\"background:#B0C4DE;\"|Dennis Main Wilson || style=\"background:#B0C4DE;\"|MartyTill Death Do Us Part"]}, {"page": "The Boys and Mrs B", "response": ["The Boys and Mrs B is a 1977 British comedy television special. Written by Ronald Chesney and Ronald Wolfe, it was originally intended as pilot for a sitcom but was made as a one off special. It was produced and directed and Dennis Main Wilson with a cast of established and upcoming comedy actors.", "Ronald Chesney and Ronald Wolfe, creators of successful comedy series such as The Rag Trade and On The Buses, pitched the idea of a sitcom set in a youth club to Dennis Main Wilson in 1976. The aim was a series that would appeal to a teenage and young adult audience, and be a vehicle for young comedy actors. A pilot was commissioned, however only days before it was to be recorded the BBC decided not to proceed with a series. With only very minor changes to the script it was made as a one off television special."]}]}}