{"wiki_id": "http://www.wikidata.org/entity/Q5258462", "itemLabel": "Dennis Gray", "itemDescription": "mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Gray", "wikipedia_page": {"main": "Dennis Gray was born 1935 in Yorkshire and started climbing when he was 11, after seeing the great Arthur Dolphin in action at Cow and Calf rocks on Ilkley Moor. He then climbed with a group who called themselves the 'Bradford Lads'. When called up for National Service Gray volunteered to work as a pay clerk and was posted to Manchester, where he was able to climb with the Rock and Ice club members on a regular basis. He has climbed with some of the best British climbers of the day;  Tom Patey, Don Whillans, Joe Brown, Harold Drasdo, Robin Campbell, Eli Moriarty, Nat Allen, Slim Sorrell, Ron Moseley and many more.\nGray was on the first ascents of Frisco Bay at Stoney Middleton, Grond on Dinas y Gromlech, Wombat and Macabre at Malham, and North Crag Eliminate on Castle Rock. After several forays into the Alps, in 1961 Gray was invited to join a group of Derby climbers to the Kulu Himalaya, which led to the first ascent of the Manikaran Spires. In 1964 he and Don Whillans took a small expedition to Gauri Sankar, failing to reach the summit by a few hundred feet. Next in 1966 he led an expedition to film the first complete ascent of the north ridge of Alpamayo in the Andes. Five members of the team reached the summit and that the film won first prize in an International Competition. He then led the expedition which made the first ascent of Mukar Beh in the Indian Himalaya in 1968, a project which had first captured his imagination in 1961. The climb turned out to be a race against the weather, and the Monsoon broke the day after the summit was reached.\nHe was best known as the first General Secretary of the British Mountaineering Council, a post he held for 18 years until his retirement in 1989. Two serious falls, first at Glen Nevis and then at Font, Switzerland, meant that Gray's climbing these days is less ambitious than it was. Now a lecturer and trek leader, Gray lives in Leeds, Yorkshire.\nGray has written a multi-volume autobiography described by Jim Perrin as the \"perfect counterpoint to the Bonington Saga\".", "link_mentions": [{"page": "Gray (surname)", "response": ["*Dennis Gray (born 1935), English mountain climber"]}, {"page": "Digby Rumsey", "response": ["Made in collaboration with author Dennis Gray, Windows (1974) explores the inner space of a man staring at the world from his armchair. In a landscape of alienation and fear, the central character is on a quest – within himself. In God and the Evil (1986), inspired by Friedrich Nietzsche's story about “The Madman with the Lamp”, Rumsey assembles and layers words, images and locations in an attempt to prompt the viewer to reflect on the great opposing forces which have exercised human thought for millennia: the distinction between God and Man, and between Good and Evil."]}]}}