{"wiki_id": "http://www.wikidata.org/entity/Q5258374", "itemLabel": "Dennis Eadie", "itemDescription": "British stage actor (1869-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Eadie", "wikipedia_page": {"main": "Dennis Eadie (14 January 1869 – 10 June 1928) was a British stage actor who also appeared in three films during the silent era. Eadie was a leading actor of the British theatre, appearing in plays by Edward Knoblauch and Louis N. Parker. In 1916 he became the first man to play the British prime minister Benjamin Disraeli in a feature film. In 1918 he starred in the hit West End comedy The Freedom of the Seas by Walter C. Hackett.\nIn 1928 Eadie played Hanaud in a London revival of the popular play At the Villa Rose.", "link_mentions": [{"page": "List of biographical films", "response": ["||Dennis Eadie"]}, {"page": "Royalty Theatre", "response": ["Again, the theatre was threatened with closure by the authorities, but Santley had it rebuilt again in 1906 to meet safety requirements. After redecoration in French Regency style, which increased the capacity of the theatre to 657 seats, the Royalty reopened on 4 January 1906 with a season of Theatre Français directed by Gaston Mayer. Sarah Bernhardt led her own company in La Tosca, Phedre and La Dame aux Camelias in 1907. In 1911, J. E. Vedrenne and Dennis Eadie acquired the theatre, and in 1912, they staged Milestones, by Arnold Bennett and Edward Knoblauch (later Knoblock), which had over 600 performances. Owen Nares, Gladys Cooper and Lynn Fontanne appeared at the theatre early in their careers. The Man Who Stayed at Home was a hit at the Royalty in 1914, playing for 584 performances. Henry Daniell starred as Bobby Gilmour in The Man from Toronto at the theatre in May 1918."]}, {"page": "List of British films before 1920", "response": ["| The Man Who Stayed at Home || Cecil M. Hepworth || Dennis Eadie, Violet Hopson, Alma Taylor || Thriller ||", "|Disraeli||Charles Calvert  Percy Nash||Dennis Eadie, Mary Jerrold||Biopic|| Based on a play by Louis N. Parker"]}, {"page": "Margaret Morris (dancer)", "response": ["In 1912 she created the part of Guinevere Megan in The Pigeon by John Galsworthy at the Royal Theatre, acting with Gladys Cooper and Dennis Eadie. That same year she had a season at The Royal Court Theatre, London where she performed such ballets as Callisto by Maurice Hewlett and The Little Dream by John Galsworthy. She started the first small theatre in London - Kings Road, Chelsea - giving Christmas Seasons for Children performed by children, including Angela and Hermione Baddeley and Phyllis Calvert. She won acclaim from the press as the first woman 'actor, manager' and the youngest, as she was only 21. In 1913 she took a troupe to Paris to dance at the Théâtre Marigny on the Champs Elysees. In 1915, she produced at her theatre an interpretation of Beethoven's 7th Symphony, costumes designed by J D Fergusson and subsequently performed with full orchestra at Bournemouth Winter Gardens and at Harrogate."]}, {"page": "At the Villa Rose (novel)", "response": ["Mason's stage version of the novel, also called At the Villa Rose, opened at the Strand Theatre, London, on 10 July 1920, with Arthur Bourchier in the role of Hanaud, Kyrle Bellew as Celia [sic] and Harcourt Williams as Wethermill. It was reported to be unusual in that the identity of the murderer was revealed from the start but with the tension maintained until the end. The play was a success with 227 performances, and became the most profitable of any that Mason wrote. Dennis Eadie played Hanaud in a 1928 London revival."]}, {"page": "The Freedom of the Seas (play)", "response": ["The Freedom of the Seas is a 1918 British comedy play by Walter C. Hackett. A downtrodden London clerk joins the Royal Navy during the First World War. Given command of a tramp steamer he rises to the occasion and thwarts the plans of a German spy.British Literature of World War I, Volume 5, Volume 5. p.xc It appeared at the Royalty Theatre before transferring to the Theatre Royal, Haymarket where the cast included Dennis Eadie, Billie Carleton, Tom Reynolds, Marion Lorne, Randle Ayrton, Sydney Valentine and James Carew."]}, {"page": "J. B. Fagan", "response": ["His first production at the Oxford Playhouse was a restaging of Heartbreak House and numbered Shaw among the audience.  Flora Robson, John Gielgud, Raymond Massey, Margaret Rutherford, Robert Donat and Tyrone Guthrie were among his players there.Oxford Playhouse website  He produced The Cherry Orchard, at various theatres, to favourable reviews, popularising Chekhov in Britain.  From 16 November 1925, with Dennis Eadie, he presented Juno and the Paycock at the Royalty Theatre, thus bringing Seán O'Casey to the attention of London's theatre-going public.\"Riotous conduct at Abbey Theatre\" Sydney Morning Herald 13 February 1926 p.15  O'Casey's The Plough followed the next year."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1910–1914)", "response": ["|1913-02-26 26 Feb 1913||Eadie Dennis Dennis Eadie||Mr Eadie||WH||M 2312||"]}, {"page": "Disraeli (1916 film)", "response": ["Disraeli is a 1916 British silent biographical film directed by Charles Calvert and Percy Nash and starring Dennis Eadie, Mary Jerrold and Cyril Raymond. The film was based on the 1911 play Disraeli by Louis N. Parker, which was adapted twice more, as a 1921 silent version and most famously in 1929 as an early sound film. It was made at Ealing Studios.Low p.87", "* Dennis Eadie as Benjamin Disraeli"]}, {"page": "Disraeli (play)", "response": ["The play was adapted for the screen on three occasions. The first was a 1916 British film, Disraeli, starring the stage actor Dennis Eadie. Arliss then managed to acquire the film rights to the work for $3,000 and in 1921 he appeared in the silent film version, Disraeli."]}, {"page": "The Man Who Stayed at Home (1915 film)", "response": ["The Man Who Stayed at Home is a 1915 British silent thriller film directed by Cecil M. Hepworth and starring Dennis Eadie, Violet Hopson and Alma Taylor.Palmer p.367 It is based on the play by Lechmere Worrall and J. E. Harold Terry.", "* Dennis Eadie as Christopher Brent  "]}, {"page": "Lady Madcap", "response": ["*Major Blatherswaite (of the East Anglian Hussars) – Dennis Eadie"]}, {"page": "The Man Who Stayed at Home (play)", "response": ["Directed by Eille Norwood, the play ran for 584 performances in London between December 1914 and July 1916. This was initially at the Royalty Theatre before transferring to the Apollo for the final four months of its run. The theme of German spies in England played on the fears of the British public at the time leading to the Daily Mail describing it as: \"more than a play of the moment; it is a play of the very second, pregnant with the insistence of a tremendous and nationally important question\". Although some reviewers considered it to be an ordinary detective play made popular by it topical setting, other newspapers also gave the play more positive reviews and many of the London cast became notable for their work in films. Dennis Eadie and Jean Cadell both reprised their roles in the 1915 film version of the play. The success of the play led to a book version of the play being produced in 1915 and a sequel The Man who went Abroad in 1917.", "| Christopher Brent    || Dennis Eadie    || Stanley Logan  ||colspan=\"2\" | Frank Harvey "]}, {"page": "Alderson Burrell Horne", "response": ["Beginning an involvement with theatre, initially as a backer, Horne ultimately became an actor-manager. He supported Johnston Forbes-Robertson in 1905 at the Scala Theatre, which was enlarged by F. T. Verity and continued to 1911, when it became a cinema. Again, in 1911, he supported John Eugene Vedrenne and Dennis Eadie, who took over the Royalty Theatre. He requested a curtain raiser from his friend A. A. Milne, around the beginning of 1914."]}, {"page": "Milestones (play)", "response": ["*John Rhead – Dennis Eadie"]}]}}