{"wiki_id": "http://www.wikidata.org/entity/Q5257746", "itemLabel": "Denise Ramsden", "itemDescription": "English sprinter", "wikipedia_url": "https://en.wikipedia.org/wiki/Denise_Ramsden_(athlete)", "wikipedia_page": {"main": "Denise Irene Ramsden (née Castle) (11 February 1952 in Wakefield – 19 April 2003) was an English Olympian sprint athlete of the 1960s and 1970s, running at club level for the Dorothy Hyman Track Club, as a child she attended Stanley St. Peter's School in Stanley, West Riding of Yorkshire.\nDenise Ramsden's personal best time for the 100 metres was 11.67 seconds set at Meadowbank Stadium, Edinburgh on 6 August 1976, and her personal best time for the 200 metres was 23.48 seconds set at Crystal Palace, London on 21 August 1976,Her best time for the 4 × 100 metres relay was in the team running 43.44 seconds for Great Britain and Northern Ireland Olympic team in the 1976 Summer Olympics in the Olympic Stadium, Montreal, Quebec, Canada on 30 July 1976, the team that set the British record and finished eighth in the final was; Wendy Hoyte (née Clarke), Denise Ramsden, Sharon Colyear (née Danville), Andrea Lynch (née Saunders).She won a bronze medal in the 4 × 100 metres relay, the team running 44.39 seconds for Great Britain and Northern Ireland Athletic team  in the 1969 European Athletics Championships in the Karaiskakis Stadium, Athens, Greece, the team was; Anita Neil, Denise Ramsden, Sheila Cooper, Val Peat (née Wild).", "link_mentions": [{"page": "1969 European Athletics Championships", "response": ["|Anita NeilDenise RamsdenSheila CooperVal Peat||44.39"]}, {"page": "Paul Sampson", "response": ["He is the cousin of sprinter Denise Ramsden, and former England rugby league international Dean Sampson. Paul's father is Brian Sampson, Malcolm, and Dave Sampson's elder brother."]}, {"page": "Dean Sampson", "response": ["Sampson is the son of the rugby league footballer, and coach; Dave Sampson and Mavis (née Dean), the nephew of the rugby league footballer; Malcolm Sampson, and the cousin of the sprinter; Denise Ramsden, and the rugby union, and rugby league footballer; Paul Sampson."]}, {"page": "List of European Athletics Championships medalists (women)", "response": ["|Anita NeillDenise RamsdenSheila CooperVal Peat"]}, {"page": "Malcolm Sampson", "response": ["Mal Sampson was the older brother of the rugby league footballer, and coach David Sampson, and uncle of the sprinter Denise Ramsden, rugby league footballer Dean Sampson, and rugby union and rugby league footballer Paul Sampson."]}, {"page": "List of family relations in rugby league", "response": ["Other relatives include: Olympic sprinter Denise Ramsden & TV presenter & model Kirsty Gallacher"]}, {"page": "Ramsden (surname)", "response": ["*Denise Ramsden (athlete), English Olympian sprint athlete of the 1960s and 1970s"]}, {"page": "David Sampson (rugby league)", "response": ["Dave Sampson was the father of the rugby league footballer Dean Sampson, younger brother of the rugby league footballer Malcolm Sampson, and uncle of the sprinter Denise Ramsden, and rugby union and rugby league footballer Paul Sampson."]}, {"page": "Athletics at the 1976 Summer Olympics – Women's 4 × 100 metres relay", "response": ["|• Wendy Clarke• Denise Ramsden• Sharon Colyear• Andrea Lynch   ", "|• Wendy Clarke• Denise Ramsden• Sharon Colyear• Andrea Lynch   "]}, {"page": "Denise Ramsden", "response": ["Denise Ramsden may refer to:", "* Denise Ramsden (cyclist) (born 1990), Canadian road bicycle racer", "* Denise Ramsden (athlete) (1952–2003), English sprint athlete"]}, {"page": "1969 European Athletics Championships – Women's 4 × 100 metres relay", "response": ["|bgcolor=\"CC9966\"|Bronze|| Anita NeilDenise RamsdenSheila CooperVal Peat  ", "|   || align=left |  || align=left| Anita NeilDenise RamsdenSheila CooperVal Peat || 44.39 || ", "| 1  || align=left |  || align=left| Anita NeilDenise RamsdenSheila CooperVal Peat || 45.0 || Q"]}, {"page": "1974 European Athletics Championships – Women's 4 × 100 metres relay", "response": ["| 4  || align=left |  || align=left| Linda BarrattDenise RamsdenHelen GoldenAndrea Lynch || 43.94 || "]}, {"page": "List of British champions in 200 metres", "response": ["|Denise Ramsden"]}]}}