{"wiki_id": "http://www.wikidata.org/entity/Q52586072", "itemLabel": "Suzanne Cooper", "itemDescription": "British Modernist painter and wood-engraver.", "wikipedia_url": "https://en.wikipedia.org/wiki/Suzanne_Cooper", "wikipedia_page": {"main": "Suzanne Cooper (1916-1992) was a British Modernist painter and wood-engraver. Her 1936 oil painting \"Royal Albion,\" at the Auckland Art Gallery (NZ), is noted for the \"artist's use of simplified blocks of form and colour.\" She grew up in Frinton-on-Sea and studied at the Grosvenor School of Modern Art in London.  Between 1935 and 1939, she exhibited her oil-paintings and wood-engravings at the Redfern Gallery, the Zwemmer Gallery, the Wertheim Gallery and the Stafford Gallery, and with the National Society of Painters, Sculptors & Print-Makers and the Society of Women Artists.  The influential collector Lucy Wertheim, in addition to exhibiting her work, bought two of Cooper's oil paintings.", "link_mentions": [{"page": "Grosvenor School of Modern Art", "response": ["* Suzanne Cooper (1916–1992)"]}, {"page": "Alexander Sverjensky", "response": ["From 1938 he became a piano teacher at the New South Wales Conservatorium of Music, and had a profound influence on a generation of Australian and New Zealand pianists and their own students. These included Nancy Salas, Malcolm Williamson, Larry Sitsky, Romola Costantino, Roger Woodward, Richard Farrell, Stephanie McCallum,Elision Ensemble  Anne Harvey (mother of Michael Kieran Harvey),Australian National Eisteddfod  Neta Maughan (mother and teacher of Tamara Anna Cislowska), Daniel Herscovitch,Sydney Conservatorium of Music: Keyboard Staff  Julie Adam, Grant Foster,Southern Highlands International Piano Competition  Rhondda Gillespie, Robert Weatherburn, Tamás Ungár, David Miller,Sydney Conservatorium of Music: Teaching Staff  Helen Quach, Alison Bauld, Garry Laycock, Pamela Sverjensky, Suzanne Cooper, Julia Brimo, Vladimir Pleshakov, Helen Priestner EdmondsPilbara Music Festival  and Edward Theodore. He retired from his teaching position in 1969."]}]}}