{"wiki_id": "http://www.wikidata.org/entity/Q5257072", "itemLabel": "Denis Alexander, 6th Earl of Caledon", "itemDescription": "British Army officer and Irish peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Denis_Alexander,_6th_Earl_of_Caledon", "wikipedia_page": {"main": "Denis James Alexander, 6th Earl of Caledon (10 November 1920 – 20 May 1980) was a soldier and landowner\nHe was the son of Lt.-Col. Hon. Herbrand Charles Alexander and Millicent Valla Meredyth and grandson of James Alexander, 4th Earl of Caledon. He was educated at Eton College and at the Royal Military College, Sandhurst. He gained the rank of Major in the service of the Irish Guards.", "link_mentions": [{"page": "Rory Peck", "response": ["His first marriage, in 1981, was to Jane, daughter of Denis Alexander, 6th Earl of Caledon, and they had two sons, James and Alexander. The marriage was dissolved in 1987.thePeerage.com  His second marriage, in 1991, was to Juliet Elizabeth Crawley (1961–2007). They had a daughter, Lettice. Juliet Peck (died 2007), with John Gunston, helped establish the Rory Peck Trust after her husband's death."]}, {"page": "James Alexander, 4th Earl of Caledon", "response": ["*Lt.-Col. the Hon. Herbrand Charles Alexander DSO (28 November 1888 – 6 May 1965), who fought with the 5th Lancers during the First World War and was mentioned in despatches three times, and in the Second World War as a Lieutenant Colonel of the Pioneer Corps. He married, firstly, Millicent Meredyth, only daughter of Sir Henry Meredyth, 5th Baronet, in 1919 (divorced 1927), and had issue: (i) Denis Alexander, 6th Earl of Caledon. He married, secondly, the Hon. Ada Kate Bellew (who died in 1994), daughter of the Hon. Richard Eustace Bellew and granddaughter of Edward Bellew, 2nd Baron Bellew, in 1937."]}, {"page": "Roland Cubitt, 3rd Baron Ashcombe", "response": ["* The Hon. Henry Edward Cubitt (1924–2013) (who succeeded as the 4th Baron Ashcombe on the death of his father) m. Ghislaine Alexander (née Dresselhuys, later  the Rt. Hon. The Baroness Foley) (ex-wife of Denis Alexander, 6th Earl of Caledon)"]}, {"page": "Henry Cubitt, 4th Baron Ashcombe", "response": ["*  Ghislaine (née Dresselhuys) Countess of Caledon (ex-wife of Denis Alexander, 6th Earl of Caledon) was married to Lord Ashcombe from 1955 to 1968.  In 1972, she married Adrian Foley, 8th Baron Foley."]}, {"page": "Ghislaine Alexander", "response": ["Alexander was the only daughter of Cornelius William Dresselhuys and Edith Merandon du Plessis, born at the Dutch consulate in London, where her father was consul. Her parents divorced when Ghislaine was young, and her mother married newspaper publisher Lord Kemsley, who became Alexander's stepfather. She was married three times, first to Major Denis Alexander, 6th Earl of Caledon, then to Henry Cubitt, 4th Baron Ashcombe; both marriages ended in divorce. At the time of her death she was married to Adrian Foley, 8th Baron Foley, a former composer and pianist."]}, {"page": "List of alumni of the Royal Military Academy Sandhurst", "response": ["* Denis Alexander, 6th Earl of Caledon (Irish Guards)"]}]}}