{"wiki_id": "http://www.wikidata.org/entity/Q5257288", "itemLabel": "Denis Hills", "itemDescription": "British writer and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Denis_Hills", "wikipedia_page": {"main": "Denis Cecil Hills (8 November 1913 – 26 April 2004) was a British author, teacher, traveller and adventurer. He came to international prominence in 1975 while he was living in Uganda and was sentenced to death for espionage and sedition following comments about President Idi Amin in a book which Hills wrote. After Amin rebuffed appeals for clemency by Queen Elizabeth, Hills was released and allowed to return to the UK following the intervention of the British government.", "link_mentions": [{"page": "1975", "response": ["** In Uganda, British author and adventurer Denis Hills is sentenced to death by firing squad for referring to Idi Amin as a 'village tyrant'."]}, {"page": "Bolesław Leśmian", "response": ["Leśmian and Chylińska had two daughters, one of who, Wanda \"Dunia\" Leśmianówna, would later marry British adventurer and traveller Denis Hills. Actress and singer Gillian Hills - famous for her brief appearances in Antonioni's Blowup and Kubrick's A Clockwork Orange in two similar scenes - was born of this marriage in 1944. Leśmian was also nephew of the famous poet and writer of the Young Poland movement, Antoni Lange, and the cousin of another notable poet of the epoch, Jan Brzechwa."]}, {"page": "P. K. van der Byl", "response": ["One of the most conspicuous features of Van der Byl was his manner of speech: although his ancestry was Cape Dutch and his early life was in Cape Town, South Africa, he had what were described (by Chris Whitehead, editor of Rhodesians Worldwide) as \"what he thought was an aristocratic English nasal drawl and imperial English mannerisms\".PK, Chris Whitehead Rhodesian personalities Whitehead was of the opinion that Van der Byl had \"adopted\" this accent, in common with others who heard him like Denis Hills, who wrote of Van der Byl having \"a flow of mannered phrases which he delivers in a flawed Guards officer accent\".Rebel People, Denis Hills, George Allen and Unwin, 1978, page 204 This Rhodesian newspaper cartoon shows another reaction."]}, {"page": "July 1975", "response": ["*Foreign Minister (and future Prime Minister) James Callaghan of the United Kingdom flew to Uganda to personally request Ugandan dictator Idi Amin to release Briton Denis Hills, who had been threatened with execution for his criticism of Amin.  Hills and Callaghan would leave Uganda the next day.\"British lecturer Denis Hills is freed by Uganda's Amin\", St. Petersburg Times, July 11, 1975, p1"]}, {"page": "Rise and Fall of Idi Amin", "response": ["Despite being branded as an exploitation film, it is reasonably accurate with the facts and dates of the events depicted, including the Israeli raid, the war with Tanzania, and the capture and imprisonment of British journalist Denis Hills (who portrays himself in the film)."]}, {"page": "Poles in the United Kingdom", "response": ["*Denis Hills, Return to Poland, The Bodley Head Ltd; First Edition (28 Jan 1988)"]}, {"page": "Hills (disambiguation)", "response": ["* Denis Hills (1913–2004), British teacher, traveller, author and adventurer"]}, {"page": "Gillian Hills", "response": ["Born in Cairo, Kingdom of Egypt,  Hills is the daughter of teacher, traveller, author, and adventurer Denis Hills. Her mother was Wanda \"Dunia\" Leśmianówna, daughter of Polish poet Bolesław Leśmian. She spent her early years in Nice (France), where she was discovered at 14 by Roger Vadim, the director of And God Created Woman and  Barbarella, who saw her as the next Brigitte Bardot and cast her in a version of Les liaisons dangereuses (1959)."]}, {"page": "List of book-based war films (1945–2000 wars)", "response": ["|Rise and Fall of Idi Amin || 1981 || Sharad Patel|| UK ||The White Pumpkin || Denis Hills || 1976 || Non-fiction", "|Rise and Fall of Idi Amin || 1981 || Sharad Patel|| UK ||The White Pumpkin (uncredited) || Denis Hills ♠ (uncredited) || 1976 || Non-fiction"]}, {"page": "Chandos Blair", "response": ["In 1959, he was appointed commanding officer of the 4th Battalion the King's African Rifles. He was made General Officer Commanding 2nd Division in British Army of the Rhine in 1968 and then became Defence Services Secretary in 1970. His last appointment was as General Officer Commanding Scotland and Governor of Edinburgh Castle in 1972; in that capacity, Prime Minister Harold Wilson dispatched him as a Special Envoy to secure the release of Denis Hills, a British subject held on spying charges by President Idi Amin of Uganda.\"Uganda: The British Must Kneel at My Feet!\", Time, 7 July 1975. Blair retired in 1976."]}, {"page": "June 1975", "response": ["*Uganda's dictator, Idi Amin, postponed the execution of British citizen Denis Hills, a day before Hills was set to go before a firing squad for statements made in the unpublished manuscript of The White Pumpkin.  Amin's decision came after he hosted two British envoys at his hometown of Arua.  The envoys, bearing a written appeal from Queen Elizabeth II, had been Amin's commanding officers when Amin had been a sergeant in the King's African Rifles in the colonial British Army.\"Briton's execution delayed\", Spokane Spokesman-Review, June 23, 1975, p9  Hills would be released by Amin on July 10.\"British lecturer Denis Hills is freed by Uganda's Amin\", St. Petersburg Times, July 11, 1975, p1"]}, {"page": "Dennis Cecil Hills", "response": ["#REDIRECT Denis Hills"]}, {"page": "Juma Butabika", "response": ["Butabika chaired several prominent tribunals, such as when he sentenced British author Denis Hills to death in 1975 for calling Amin a \"village tyrant\". Two years later, he chaired the tribunal that sentenced 12 men to death for conspiring to murder Amin; this trial in particular was described as \"travesty of justice, a 'show', since the conventions and pleas of guilt were obtained by force from the accused\". He did, however, acquit Wod Okello Lawoko, senior manager of Radio Uganda, after the latter had fallen out of favor with Amin and been arrested on charges of treason. Though Butabika was once dismissed as chairman on one tribunal for misconduct, namely corruption in late 1976, he was later reinstated."]}, {"page": "List of Makerere University academics", "response": ["* Denis Hills"]}]}}