{"wiki_id": "http://www.wikidata.org/entity/Q5258181", "itemLabel": "Dennis Barden", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Barden", "wikipedia_page": {"main": "Dennis Barden is a mathematician at the University of Cambridge working in the fields of geometry and topology. He is known for his classification of the simply connected compact 5-manifolds and, together with Barry Mazur and John R. Stallings, for having proved the s-cobordism theorem. Barden received his Ph.D. from Cambridge in 1964 under the supervision of C. T. C. Wall.", "link_mentions": [{"page": "H-cobordism", "response": ["Precisely, the s-cobordism theorem (the s stands for simple-homotopy equivalence), proved independently by Barry Mazur, John Stallings, and Dennis Barden, states (assumptions as above but where M and N need not be simply connected):"]}, {"page": "Barden", "response": ["*Dennis Barden, mathematician"]}, {"page": "List of Cambridge mathematicians", "response": ["*Dennis Barden, fellow of Pembroke College, Cambridge"]}, {"page": "Kingswood, Surrey", "response": ["* Dennis Barden - Mathematician"]}, {"page": "D. Barden", "response": ["#REDIRECT Dennis Barden"]}, {"page": "Denis Barden", "response": ["#REDIRECT Dennis Barden"]}, {"page": "5-manifold", "response": ["Non-simply connected 5-manifolds are impossible to classify, as this is harder than solving the word problem for groups.. Simply connected compact 5-manifolds were first classified by Stephen Smale and then in full generality by Dennis Barden, while another proof was later given by Aleksey V. Zhubr. This turns out to be easier than the 3- or 4-dimensional case: the 3-dimensional case is the Thurston geometrisation conjecture, and the 4-dimensional case was solved by Michael Freedman (1982) in the topological case, but is a very hard unsolved problem in the smooth case."]}, {"page": "Timeline of manifolds", "response": ["| 1965 || Dennis Barden || Completes the classification of simply connected, compact 5-manifolds, started by Smale in 1962."]}]}}