{"wiki_id": "http://www.wikidata.org/entity/Q5259843", "itemLabel": "Denys Bullard", "itemDescription": "British politician (1912-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Denys_Bullard", "wikipedia_page": {"main": "Denys Gradwell Bullard (15 August 1912 – 2 November 1994) was a British farmer and politician. Although he was an entertaining speaker, his political career was a precarious one as he was only elected in marginal constituencies.\n\n", "link_mentions": [{"page": "1964 United Kingdom general election", "response": ["*Denys Bullard (King's Lynn)"]}, {"page": "South West Norfolk (UK Parliament constituency)", "response": ["South West Norfolk has been held solidly by Conservatives since 1964 but for twenty years before then, it had been ultra-marginal: Labour first held it from 1929–31, and Sidney Dye won it for Labour in 1945 with a tiny majority of 53, holding it at the 1950 election by 260. He lost it to Denys Bullard in 1951 by 442 votes and won it back in 1955 with a majority of 193. Dye died at the end of 1958, and in the by-election Albert Hilton retained the seat for Labour by a margin of 1,354 votes. In the 1959 general election that soon followed, his majority was cut to 78.", "| Denys Bullard"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Denys Bullard"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Denys Bullard"]}, {"page": "Wisbech Grammar School", "response": ["Other alumni include author John Gordon (1925-2017), known for his children's novel The Giant Under The Snow;Fenland fantasy leads the field, wgs.cambs.sch.uk. Retrieved 2 October 2010. economist Professor Stephen Littlechild, who developed the price-cap system of electricity regulation;University of East Anglia honours, Fenland Citizen, 14 May 2004.The International Who's Who 2004. Edition 16. Europa Publications, Routledge, 2003. , p.1013 Denys Bullard (1912–1994), MP for South West Norfolk,Cosgrave, Patrick, \"Obituary: Denys Bullard\", The Independent, 7 November 1994. Ray Palma (later known as Ray DaSilva), founder of the Norwich Puppet Theatre;Norwich Puppet Theatre. Retrieved 20 October 2010; Richard Blakesley, joint inventor of the Kymera wand, which won £200,000 backing on Dragons' Den,\"Wizard idea for TV winner\", Fenland Citizen, 14 September 2010. Mike Stevens, musical director and record producer and Will Millard, writer, explorer and presenter of BBC2's Hunters of the South Seas.. Retrieved 9 May 2015;. Retrieved 9 May 2015"]}, {"page": "King's Lynn (UK Parliament constituency)", "response": ["| Denys Bullard"]}, {"page": "Bullard", "response": ["* Denys Bullard (1912–1994), British farmer and politician"]}, {"page": "Philip Hocking", "response": ["During his tenure in the House of Commons he was Parliamentary Private Secretary (PPS) to the Foreign Office. Hocking's victory in Coventry was certainly an achievement as the constituency was seen as a fairly strong Labour Party area and indeed he remains to this day the only Conservative to have won the seat. He became a close friend of Denys Bullard, another Conservative MP with agricultural interests whose seat depended on a small and hard-won majority in a difficult constituency. Hocking's most memorable contribution to the politics of the day was when he appeared on BBC Television following the Profumo affair. Hocking was asked if Harold Macmillan was finished politically; Hocking compared Macmillan to a pheasant once it has been shot. \"It may have been shot,\" he said, \"but it is still going to run and run.\" Having replaced Elaine Burton at the 1959 general election with the song \"High Hopes\" as his anthem, Hocking lost the 1964 election to William Wilson."]}, {"page": "Denys Gradwell Bullard", "response": ["#REDIRECT Denys Bullard"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Denys Bullard; MP for South West Norfolk (1951–1955) and King's Lynn (1959–1964)"]}, {"page": "List of people from King's Lynn", "response": ["*Denys Bullard (1912–1994), Conservative politician and agriculturalist"]}, {"page": "List of alumni of Fitzwilliam College, Cambridge", "response": ["*Denys Bullard — Conservative politician"]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Denys Bullard"]}]}}