{"wiki_id": "http://www.wikidata.org/entity/Q5256864", "itemLabel": "Dene Cropper", "itemDescription": "English footballer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dene_Cropper", "wikipedia_page": {"main": "Dene Cropper (born 5 January 1983) is an English former professional footballer who notably played in the Football League for Lincoln City and Boston United after starting his career with Sheffield Wednesday. He has also played for Worksop Town, Gainsborough Trinity and Matlock Town.", "link_mentions": [{"page": "Keith Alexander (footballer)", "response": ["Remaining at the club were former Tottenham Hotspur youngsters Alan Marriott and Peter Gain, Northern Ireland B international centre-back Paul Morgan along with midfielders Adam Buckley, Mark Camm and Ben Sedgemore and wing-backs Mark Bailey and Stuart Bimson and Alexander complemented their talents with a series of signings from outside of the Football League. After just one week in the job, Alexander completed his first two signings bringing Ben Futcher and Dene Cropper to the club on initial one-year contracts. One week later, Alexander made a second double swoop with Simon Weaver and Simon Yeo joining the ranks."]}, {"page": "Ben Futcher", "response": ["After playing in only two games for Rovers, manager Dave Penney released Futcher two months later at the end of the season. On 10 May 2002, he along with Dene Cropper became Lincoln City manager Keith Alexander's first signings of his second spell in charge at Sincil Bank. With The Imps struggling in the previous season, it was to be a different string of events in the new season, despite a rocky start, Lincoln climbed the league, and with the help of Futcher, for his goals more than anything, The Imps qualified for the play-offs. As well as this, Ben finished the season as the club's top goal scorer, scoring eleven goals, the majority of them being close range headers, from set pieces. In honour of this he was voted \"Young Player of the Season\" by the Club's management team. A Simon Yeo inspired Lincoln dumped Scunthorpe United out of the Play-off semi-final and thus giving them the task of overcoming AFC Bournemouth in the final at the Millennium Stadium. Lincoln lost the match 5–2, with Ben amongst the City scorers. For the next two years, Futcher was at the heart of the Lincoln defence and faced two more Play-off defeats: losing out in the semi finals to Huddersfield Town in 2003/2004 and going down 2–0 after extra time against Southend United the following season in yet another final at the Millennium Stadium."]}, {"page": "Brookfield Community School, Chesterfield", "response": ["* Dene Cropper, professional football player "]}, {"page": "Cropper (surname)", "response": ["*Dene Cropper (born 1983), English former professional footballer"]}, {"page": "Ark Kings Academy", "response": ["* Dene Cropper, Footballer – Teacher (Kings Norton High School/ARK Kings Academy)"]}, {"page": "Dene (disambiguation)", "response": ["* Dene Cropper (born 1983), English footballer"]}, {"page": "2003 Football League Third Division play-off Final", "response": ["|CF ||9||Dene Cropper || || "]}]}}