{"wiki_id": "http://www.wikidata.org/entity/Q5259847", "itemLabel": "Denys Carnill", "itemDescription": "Olympic field hockey player (1926-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Denys_Carnill", "wikipedia_page": {"main": "Denys John Carnill (11 March 1926 – 30 March 2016) was a British field hockey player who competed in the 1952 Summer Olympics, in the 1956 Summer Olympics, and in the 1960 Summer Olympics. He also played one first-class cricket match for Oxford University in 1950.Denys Carnill was born on 11 March 1926 and educated at Hitchin Grammar School (now Hitchin Boys' School).  His National Service was between 1944 and 1948 in the RAF. Subsequently, he went up to Worcester College, Oxford, where he read History.\nHe showed considerable sporting talent from an early age. He gained an Oxford Blue for Hockey in the 1950-51 season and went on to play for Gloucestershire, the West of England, England (captain, 45 caps) and finally Great Britain (captain, 27 caps). He captained the national side in the Olympics at Helsinki (1952, where the team won a Bronze Medal), Melbourne (1956) and Rome (1960), when E. S. Hoare, another Dean Close teacher, was manager, and also during which Denys spent a year at Geelong Grammar School, Victoria, on exchange. He was also a very good cricketer and played for Hertfordshire for a number of years.", "link_mentions": [{"page": "Field hockey at the 1952 Summer Olympics", "response": ["| width=150 | Denys Carnill (capt) John CockettJohn ConroyGraham DaddsDerek DayDennis EaganRobin FletcherW A Lindsay-SmithRoger MidgleyRichard NorrisNeil NugentAnthony NunnAnthony John RobinsonP D R SmithJohn Paskin TaylorS T TheobaldEric Claude Newby"]}, {"page": "Great Britain at the 1952 Summer Olympics", "response": ["* Denys Carnill, John Cockett, John Conroy, Graham Dadds, Derek Day, Dennis Eagan, Robin Fletcher, Roger Midgley, Richard Norris, Neil Nugent, Anthony Nunn, Anthony Robinson, and John Taylor — Field Hockey, Men's Team Competition"]}, {"page": "List of Olympic medalists in field hockey", "response": ["|valign=top|Denys CarnillJohn CockettJohn ConroyGraham DaddsDerek DayDennis EaganRobin FletcherRoger MidgleyRichard NorrisNeil NugentAnthony NunnAnthony John RobinsonJohn Paskin Taylor"]}, {"page": "Denys", "response": ["* Denys Carnill (1926–2016), British field hockey player"]}, {"page": "Stanley Hoare", "response": ["He read Mathematics and Geography at Queens' College, Cambridge. Playing at centre-half, he won Blues for hockey (1924-6) and played for England (1926–37) winning 30 caps.Cheltenham Hockey Club History  He captained Cambridge University and England and was the School’s first international hockey player. In 1956, when another member of staff, Denys Carnill, captained the Great Britain Olympic hockey team in Melbourne, Australia, Hoare was the coach and manager."]}, {"page": "2016 in the United Kingdom", "response": ["**Denys Carnill, 90, field hockey player, Olympic bronze medalist (1952)."]}, {"page": "Deaths in March 2016", "response": ["*Denys Carnill, 90, British field hockey player, Olympic bronze medallist (1952).Hockey family mourns deaths of Denys Carnill and Pierre Belmer"]}, {"page": "Field hockey at the 1956 Summer Olympics – Men's team squads", "response": ["* Denys Carnill"]}, {"page": "Field hockey at the 1960 Summer Olympics – Men's team squads", "response": ["* Denys Carnill"]}]}}