{"wiki_id": "http://www.wikidata.org/entity/Q5252883", "itemLabel": "Del Dettmar", "itemDescription": "musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Del_Dettmar", "wikipedia_page": {"main": "Del Dettmar (born 20 April 1947 in Thornton Heath, Surrey, England) is best known as synthesizer and keyboard player with the English space rock band Hawkwind from 1971 to 1974.\nAfter leaving school he had a number of jobs including working in a bank, digging potatoes on Jersey, and punting tourists up and down the river in Cambridge. Eventually he got a job as roadie with The Pretty Things and subsequently worked as road manager for Edgar Broughton Band, Arthur Brown, Juicy Lucy, Pete Brown, and then Cochise.He was recruited as road manager for Hawkwind by their manager Doug Smith. While attending to his road manager duties, he also sat out front at gigs operating a synthesizer and mixing the band. He was brought into the band proper to replace a temporarily absent Dik Mik in May 1971. He co-produced (with Dave Brock) the album Doremi Fasol Latido and is credited as composer of the tracks \"One Change\" (Doremi Fasol Latido), \"Electronic No. 1\" (Space Ritual), and \"Goat Willow\" (Hall of the Mountain Grill).He left Hawkwind in June 1974 to emigrate to the East Shore of Kootenay Lake, in B.C. Canada, where he still lives. He recorded two albums with the Vancouver-based experimental group Melodic Energy Commission in 1979 and 1980 (with help from fellow ex-Hawkwinder Paul Rudolph). He is an occasional contributor to the band Space Ritual.", "link_mentions": [{"page": "Hawkwind", "response": ["Their follow-up album, 1971's In Search of Space, brought greater commercial success, reaching number 18 on the UK album charts. This album offered a refinement of the band's image and philosophy courtesy of graphic artist Barney Bubbles and underground press writer Robert Calvert, as depicted in the accompanying Hawklog booklet, which would be further developed into the Space Ritual stage show. Science fiction author Michael Moorcock and dancer Stacia also started contributing to the band. Dik Mik had left the band, replaced by sound engineer Del Dettmar, but chose to return for this album giving the band two electronics players. Bass player Dave Anderson, who had been in the German band Amon Düül II, had also joined and played on the album but departed before its release because of personal tensions with some other members of the band. Anderson and Lloyd-Langton then formed the short-lived band Amon Din. Meanwhile, Ollis quit, unhappy with the commercial direction the band were heading in.Carol Clerk, The Saga of Hawkwind, p. 95."]}, {"page": "Thornton Heath", "response": ["*Del Dettmar, musician"]}, {"page": "Space Ritual", "response": ["#\"Electronic No. 1\" (Michael \"Dik Mik\" Davies, Del Dettmar) – 2:26", "*Del Dettmar – synthesizer"]}, {"page": "Captain Lockheed and the Starfighters", "response": ["* Del Dettmar - synthesizer"]}, {"page": "EMS VCS 3", "response": ["*Del Dettmar & Dik Mik of Hawkwind"]}, {"page": "Urban Guerrilla", "response": ["As far as the music is concerned, many of the band weren't happy with it anyway. Del Dettmar commented \"The mix is too toppy. I'd like to re-do the ending. Ah well, it's not a very good song anyway. And it isn't very well played.\",Disc, 14 July 1973 - Blowin' In The Wind whilst Simon King stated \"I didn't like the idea of doing a single, and I didn't like the song to be quite honest.\"Sounds, 1 September 1973  Simon King In The Talk In Lemmy liked the song: \"We didn't make commercial records - the best thing we made was 'Urban Guerrilla', but that got pulled off the racks because it was when the IRA bombed Harrods. Went down like a concrete parachute, that.\""]}, {"page": "Nik Turner", "response": ["In 1993 Turner was approached by Pressurehed and Helios Creed to record another version of his Sphynx project using the original flute tracks, resulting in the album Sphynx. This partnership then developed further, regularly touring in the US performing a set of Hawkwind-centred material sometimes featuring Genesis P-Orridge, Jello Biafra and former Hawkwind members Simon House, Del Dettmar and Powell. One studio album Prophets of Time was released in 1994 followed by the live CD and DVD Space Ritual 1994 Live and another live CD Past or Future? in 1996. Out of this set of musicians formed the band Anubian Lights, centred on Len Del Rio and Tommy Greñas from Pressurehed with contributions from Turner, Dettmar and House, as did the band Spiral Realms centred on House and Rio."]}, {"page": "In Search of Space", "response": ["Bass player John A Harrison left just after recording the first album, replaced by Thomas Crimble who in turn was replaced by Dave Anderson from Amon Düül II for this album, and who in turn would be gone before its release. Electronics player Dik Mik Davies had also temporarily leftDel Dettmar left his position at the mixing desk and joined the line-up on stage, initially to cover the departure of Dik Mik, who kept leaving and rejoining. Dik Mik played on in Search of Space (United Artists UAG 29202) which was recorded in the Summer of 1971 and released in October, and then left before the cover was made. He came back again after the cover was done which is why his picture appears on the sleeve as part of the background instead of in a 'frame' like the others. – Brian Tawn, May 1986, Approved History of Hawkwind so the band's live sound engineer Del Dettmar was pulled in as a replacement, whilst Huw Lloyd-Langton had departed after a bad LSD experience at the Isle of Wight Festival.The Saga of Hawkwind – Carol Clerk (pp 44)", "*Del Dettmar – synthesizer", "Category:Albums produced by Del Dettmar"]}, {"page": "Hall of the Mountain Grill", "response": ["In the wake of Robert Calvert's departure, lead vocals for the album were performed by Dave Brock, along with Lemmy on \"Lost Johnny\" and Nik Turner on \"D-Rider\". The band's line-up would continue to shift during the year. Del Dettmar left prior to the release of Hall of the Mountain Grill to live in Canada, and Alan Powell joined as an additional drummer. Science fiction author and friend of the group Michael Moorcock stepped in to read poetry at their concerts.", "After the release of the successful live album Space Ritual and single \"Urban Guerrilla\" in 1973, vocalist Robert Calvert and electronics player Dik Mik Davies left, leaving the group as a five-piece. In November and December 1973, Hawkwind undertook their first live tour of North America taking in ten dates. During this time, Del Dettmar bought land near Calgary in Canada and signalled to the group his intent that he and his pregnant wife were to emigrate.", "* Del Dettmar – keyboards, synthesizer, kalimba"]}, {"page": "Del (disambiguation)", "response": ["* Del Dettmar (born 1947), English rock keyboardist"]}, {"page": "Doremi Fasol Latido", "response": ["\"One Change\" is a brief sedate instrumental featuring a heavily echoed keyboard contribution from Del Dettmar.", "*Del Dettmar – synthesizer, production"]}, {"page": "The Weird Tapes", "response": ["*Track 1: studio 1973: Dave Brock; Lemmy; Nik Turner; Del Dettmar; Dik Mik; Simon King.", "*Tracks 2–4: The Roundhouse, 12 February 1972: Robert Calvert; Dave Brock; Lemmy; Nik Turner; Del Dettmar; Dik Mik; Simon King. Included on 2007 re-mastered Greasy Truckers Party 3CD.", "*Track 8: Brixton Sundown, 30 December 1972: Robert Calvert; Dave Brock; Lemmy; Nik Turner; Del Dettmar; Dik Mik; Simon King.", "*Track 1: Brixton Sundown, 30 December 1972: Robert Calvert; Dave Brock; Lemmy; Nik Turner; Del Dettmar; Dik Mik; Simon King."]}, {"page": "BBC Radio 1 Live in Concert (Hawkwind album)", "response": ["* Del Dettmar – Synthesizer"]}, {"page": "The 1999 Party", "response": ["Hawkwind first toured North America in November and December 1973 undertaking 10 dates performing the Space Ritual set, albeit without Robert Calvert and Dik Mik who had left in July.NME, 10 November 1973  On that tour Del Dettmar had bought land in Canada with the intention of emigrating, but remained with the band playing from the mixing desk rather than the stage until eventually leaving in June 1974.NME; 29 June 1974 - Del quits Hawkwind Simon House, who had known the band from his time with High Tide, was brought in playing alongside Dettmar and accompanied the band on this tour but, not being able to get the correct work permit in time, his participation was strictly unofficial.Sounds, 1 June 1974  - Baptism of Fire", "*Del Dettmar – Synthesizer"]}]}}