{"wiki_id": "http://www.wikidata.org/entity/Q5254404", "itemLabel": "Delphi Lawrence", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Delphi_Lawrence", "wikipedia_page": {"main": "Delphi Lawrence (23 March 1932 – 11 April 2002) was an English actress.\nShe was educated at Halidon House School in Slough, Berkshire whilst living in Colnbrook. Of Hungarian ancestry, Lawrence trained as a concert pianist before becoming an actress. She made her first film in 1952 and over the next decade established a following in British films. She graduated to lead roles, but almost exclusively in \"B\" films.", "link_mentions": [{"page": "Mame (musical)", "response": ["Juliet Prowse, who in August 1969 subbed for Ginger Rogers in the original West End production of Mame, would subsequently reprise the title role in a number of U.S. productions, led off by a 1970 Dallas Summer Musicals production whose cast included Jane Connell as Gooch, Ruth Gillette as Mrs. Burnside/ Mrs. Upson, and William LeMassena as Babcock. In the autumn of 1970 Prowse headlined Mame at the Westgate Las Vegas (then known as the International Hotel) in a production featuring reprises by Jane Connell and Ruth Gillette, with Upson being played by Connell's husband Gordon Connell and Vera played by Anne Francine who had replaced Beatrice Arthur in the original Broadway production: by 1983, which year Francine reprised (briefly) the role on Broadway, Francine had played Vera some 800 times. The Westgate production of Mame also featured John McCook as adult Patrick. Prowse resumed headlining Mame in a 1989-1990 North American tour whose cast included Meghan Duffy as Gooch Meghan Duffy as Gooch, Thomas Hill as Upson, and Delphi Lawrence as Vera. Subsequent to headlining Mame at Harrah's Lake Tahoe in the summer of 1992, Prowse headlined a production of Mame which played the Alex Theatre (Glendale) and also Spreckels Theater (Sand Diego) in respectively April and May 1994 with a cast which included Franklin Cover as Babcock and Marsha Kramer as Gooch.https://www.abouttheartists.com/artists/318101-juliet-prowse", "| align=center|Delphi Lawrence"]}, {"page": "The Wednesday Play", "response": ["| David HemmingsDelphi LawrenceKevin StoneyJanice DinnenKatherine SchofieldJonathan BurnGertan Klauber"]}, {"page": "Beat Girl", "response": ["The next day Nichole plans to meet Jennifer at Saint Martin's School of Art, where she is studying, so they can have lunch together. At lunchtime, Nichole arrives at St Martin's, but is told that Jennifer has left and gone to the Off-Beat. Nichole goes to the café and confronts Jennifer in front of her friends, who are impressed by Nichole's youth, good looks, and knowledge of modern jazz. The fact that her friends, especially Dave, seem to like Nichole upsets Jennifer. Nichole leaves, reminding Jennifer to be home for her father's important business dinner that night. As Nichole leaves, she passes Greta (Delphi Lawrence), the star performer at the strip club across the street.  Greta recognises Nichole and greets her by name, but Nichole ignores her, to Greta's annoyance. Jennifer and her friends see this encounter and wonder how Greta and Nichole might know each other. Jennifer suspects that Nichole was also a stripper before meeting her father.", "* Delphi Lawrence as Greta"]}, {"page": "List of female movie actors by name: L", "response": ["*Delphi Lawrence (1926–2002)"]}, {"page": "Sir Francis Drake (TV series)", "response": ["*Delphi Lawrence as the Countess"]}, {"page": "Cops and Robbers (1973 film)", "response": ["* Delphi Lawrence as Rich Lady"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Delphi Lawrence"]}, {"page": "The Adventures of William Tell", "response": ["* Delphi Lawrence"]}, {"page": "The Man Who Could Cheat Death", "response": ["* Delphi Lawrence as Margo Phillipe"]}, {"page": "Cone of Silence (film)", "response": ["| Delphi Lawrence || Joyce Mitchell"]}, {"page": "List of American films of 1973", "response": ["|Cops and Robbers|| Aram Avakian || Joseph Bologna, Cliff Gorman, Delphi Lawrence|| Crime, Comedy|| United Artists. Written by Donald E. Westlake"]}, {"page": "List of Western films of the 1960s", "response": ["|The Last Challenge || Richard Thorpe || Glenn Ford, Angie Dickinson, Chad Everett, Gary Merrill, Jack Elam, Delphi Lawrence, Royal Dano, Frank McGrath || United States || traditional Western"]}, {"page": "Too Many Crooks", "response": ["*Delphi Lawrence as Beryl"]}, {"page": "List of British films of 1955", "response": ["| Barbados Quest || Bernard Knowles ||  Tom Conway, Delphi Lawrence || Crime ||"]}, {"page": "List of British films of 1957", "response": ["|Strangers' Meeting||Robert Day||Peter Arne, Delphi Lawrence||Crime||"]}, {"page": "List of British films of 1958", "response": ["|Blind Spot||Peter Maxwell||Robert MacKenzie, Delphi Lawrence||Drama||"]}, {"page": "List of British films of 1961", "response": ["|Seven Keys|| Pat Jackson ||Alan Dobie, Jeannie Carson, Delphi Lawrence, John Carson ||Crime ||"]}, {"page": "Colin Tapley", "response": ["| 1955 || Barbados Quest || Lord Valchrist || Bernard Knowles || Tom Conway, Delphi Lawrence, Brian Worth ||"]}, {"page": "List of lost films", "response": ["|| Farewell Performance || Robert Tronson || David Kernan,Frederick Jaeger,Delphi Lawrence || On the BFI 75 Most Wanted list of lost films ||"]}, {"page": "Blind Spot (1958 film)", "response": ["Blind Spot is a 1958 British drama film directed by Peter Maxwell and starring Robert MacKenzie, Delphi Lawrence, Gordon Jackson, John Le Mesurier, and Michael Caine.\"Review: 'Blind Spot' (1958).\" British Film Institute. Retrieved: 28 August 2016.", "After regaining his eyesight, Adams finds himself framed on a diamond-smuggling charge. He sets out to track down the real thieves, pretending that he is still blind in order to catch them off guard. Encountering an aircraft mechanic (Gordon Jackson) and the Brent family, with father (John Le Mesurier) and sister (Delphi Lawrence), Adams realises that a pilot thought to be dead is really Johnny Brent (Michael Caine) who knows more about the theft and murders. Finally unravelling the mysterious death and smuggling operation, Adams proves his innocence.", "* Delphi Lawrence as Yvonne Dubar", "The Movie Scene gave the film three out of five stars, noting, \"Robert MacKenzie appeared to make only three movies yet going on what he does as Dan Adams in 'Blind Spot' makes me think he could have had a solid movie career...after a decent set up \"Blind Spot\" quickly unravels into an ordinary 1950s crime drama with nothing to make it stand out except that it features a young Michael Caine.\"\"Movie review: 'Blind Spot' (1958) starring Robert MacKenzie, Delphi Lawrence, Gordon Jackson, Anne Sharp directed by Peter Maxwell.\" The Movie Scene. Retrieved: 28 August 2016."]}, {"page": "The Greeneyed Elephant", "response": ["* Delphi Lawrence - Lisa"]}, {"page": "The Last Challenge", "response": ["* Delphi Lawrence as Marie Webster"]}, {"page": "Seven Keys (film)", "response": ["* Delphi Lawrence as Natalie Worth"]}, {"page": "Blood Orange (1953 film)", "response": ["* Delphi Lawrence as Chelsea"]}, {"page": "Strangers' Meeting", "response": ["Strangers' Meeting is a 1957 crime drama film directed by Robert Day and starring Peter Arne and Delphi Lawrence.", "*Delphi Lawrence as Margot Sanders"]}, {"page": "It's Never Too Late (1956 film)", "response": ["* Delphi Lawrence as Mrs Madge Dixon"]}, {"page": "Crane (TV series)", "response": ["2. T.N.T. Men unskilled in the use of explosives put Crane's life in danger. Edwin Richfield as Steve Hanna, Delphi Lawrence as Lisa Martes, Barry Linehan as Harvey Troop, Henry Lincoln as Mogista."]}, {"page": "Just My Luck (1957 film)", "response": ["* Delphi Lawrence as Miss Daviot"]}, {"page": "Farewell Performance", "response": ["Farewell Performance is a 1963 British crime film directed by Robert Tronson and starring David Kernan, Frederick Jaeger and Delphi Lawrence. It is considered a lost film and is on the BFI National Archive's 75 Most Wanted List of missing films. It features musical interludes from Joe Meek acts like The Tornados and Heinz.", "* Delphi Lawrence – Janice Marlon"]}, {"page": "The Feminine Touch (1956 film)", "response": ["The Feminine Touch is a 1956 British drama film directed by Pat Jackson and starring George Baker, Belinda Lee and Delphi Lawrence. The film is based on the bestselling novel A Lamp Is Heavy by Canadian former nurse Sheila Mackay Russell, and consequently it was released as A Lamp Is Heavy in Canada, while it was given the title The Gentle Touch in the United States, when it was released there in December 1957.IMDb: The Feminine Touch – release info Linked 2015-05-15", "Susan (Belinda Lee) is reliable and sensible; Pat (Delphi Lawrence) is flighty and open; Maureen (Adrienne Corri) is Irish and loud; Ann (Henryetta Edwards) is a typical public school girl; and Liz (Barbara Archer) comes from a typical working class background. As they get to know each other, they bond in spite of their differences.", "* Delphi Lawrence – Pat Martin"]}, {"page": "The Man Who Finally Died (TV series)", "response": ["The Man Who Finally Died is a 1959 television drama. The seven-part serial aired on ITV, and was produced by ATV. Each episode was 30 minutes long. It was later remade as the 1963 film of the same name. Cast included Richard Pasco and Delphi Lawrence. The series still exists in its entiretyLost UK TV Shows Search Engine"]}, {"page": "Doublecross (1956 film)", "response": ["* Delphi Lawrence - Anna Krassin"]}, {"page": "Meet Mr. Callaghan", "response": ["* Delphi Lawrence as Effie "]}, {"page": "Barbados Quest", "response": ["*Delphi Lawrence as Jean Larson"]}, {"page": "Deaths in April 2002", "response": ["*Delphi Lawrence, 76, English actress."]}, {"page": "The Winds of Green Monday", "response": ["*Delphi Lawrence as Marha Nugent"]}, {"page": "Frozen Alive (film)", "response": ["Frank and Helen are affectionate, but Frank is married to Joan (Delphi Lawrence), an alcoholic fashion journalist. Her lover, Tony Stein (Joachim Hansen), is a newspaper crime reporter.", "*Delphi Lawrence as Joan Overton"]}]}}