{"wiki_id": "http://www.wikidata.org/entity/Q5259239", "itemLabel": "Denny Termer", "itemDescription": "British pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Denny_Termer", "wikipedia_page": {"main": "Dennis William \"Denny\" Termer (1 October 1925 – 1 December 2011) was an English pianist and accompanist. Born in London, England, Termer began his musical career at the age of 15.\nTermer met Stanley Watson, who introduced him to Laurie Morgan while at Tottenham Technical College. Watson played guitar and Morgan drums. Termer was learning piano so they got together and later found Don Rendell, who had a battered old alto sax at the time. During the war it was normal practice to keep playing during an air raid, which had its own unique, character building lessons, for a young musician.\nA relative of Termer's, Hal Moss, violinist and impresario, had a show on the road called Scandals and Scanties and when his musicians got called up he asked Termer, Watson, Rendell and Morgan to help out. They quickly learnt how to play as they went along.\nTermer was eventually called up into the army which by this time he had been playing the theatres with Watson, Rendell and Morgan as The Rhythm Racketeers. Watson, Rendell and Morgan went into U.S. Army camp shows. They used to send Termer cartons of cigarettes. During this period, Termer practised with Johnny Dankworth, Tony Crombie and Ronnie Scott while they were in their teens.\nTermer's first job after the war was with Ken Turner at the Plaza Ballroom, Derby, with Kenny Graham, tenor sax, Terry Brown, trumpet and Phil Seaman, drums. Termer learned a lot from Graham about writing. From there he went with Duncan Whyte, Carl Barriteau, Nat Temple plus gig bands on the scene, and society gigs.\nThen taking a residence at the Stork Club, London for seven years he formed a trio with Monty Babson on drums and Bill Bramwell on bass. It was a haunt for show people and they got to accompany such names as Danny Kaye, Billie Holiday, Pearl Bailey, and Sarah Vaughan.\nOn leaving the Stork Club, Termer freelanced around, but mainly he accompanied Diana Dors, whenever she did cabaret. Also Marlene Dietrich, Matt Monro and his greatest personal thrill was playing for Judy Garland at the London Palladium, in August 1960.\nOver the years, Termer performed on many TV and radio broadcasts, shows, concerts, gigs and recording sessions, including a track on the Melody Maker Jazz Poll Winners album 1957 with The Vic Ash Quintet.", "link_mentions": {}}}