{"wiki_id": "http://www.wikidata.org/entity/Q5259130", "itemLabel": "Dennistoun Burney", "itemDescription": "British politician (1888-1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennistoun_Burney", "wikipedia_page": {"main": "Sir Charles Dennistoun Burney, 2nd Baronet  (28 December 1888 – 11 November 1968, in Bermuda) was an English aeronautical engineer, private inventor and Conservative Party politician.", "link_mentions": [{"page": "Bristol Aeroplane Company", "response": ["During early 1912, a highly secret separate design office, known as the \"X-Department\", was set up to work on Dennistoun Burney's ideas for naval aircraft. Frank Barnwell was taken on as the design engineer for this project, and took over as Bristol's chief designer when Coandă left the company in October 1914. Barnwell was to become one of the world's foremost aeronautical engineers, and was to work for the company until his death in 1938."]}, {"page": "Glide bomb", "response": ["In 1939 Sir Dennistoun Burney and Nevil Shute Norway, worked together on an air-launched gliding torpedo, the \"Toraplane\", and a gliding bomb, \"Doravane\". Despite much work and many trials the Toraplane could not be launched with repeatable accuracy and it was abandoned in 1942."]}, {"page": "High-explosive squash head", "response": ["HESH was developed by Dennistoun Burney in the 1940s for the UK's war effort, originally as an anti-fortification \"wallbuster\" munition for use against concrete. He also led British developments in recoilless rifles as a means to deliver the shell. An early application of the HESH principle was the Royal Engineers AVRE's 165mm demolition gun."]}, {"page": "List of United Kingdom MPs: B", "response": ["* Dennistoun Burney (1922–1929)"]}, {"page": "R100", "response": ["R100 was built as part of a British government programme to develop airships to provide passenger and mail transport between Britain and the countries of the British Empire, including India, Australia and Canada.  This had its origin in Dennistoun Burney's 1922 proposal for a civil airship development programme to be subsidised by the Government and carried out by a specially established subsidiary of Vickers.  When the General Election of 1923 brought Ramsay MacDonald’s Labour administration to power, the new Air Minister, Lord Thomson formulated the Imperial Airship Scheme in its place.  This called for the building of two experimental airships: one, R101, to be designed and constructed under the direction of the Air Ministry, and the other, R100, to be built by the Vickers subsidiary under a fixed price contract."]}, {"page": "Burney", "response": ["* Burney guns, recoilless rifles designed by Sir Charles Dennistoun Burney"]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Dennistoun Burney  "]}, {"page": "Uxbridge (UK Parliament constituency)", "response": ["| Dennistoun Burney"]}, {"page": "Streamline Cars", "response": ["Sir Dennistoun Burney rose to fame as an airship designer, best known for his work at Howden on the R100 for Vickers."]}, {"page": "Frank Barnwell", "response": ["In 1907 he returned to Scotland and established the Grampian Motors & Engineering Company in Stirling in partnership with his brother Harold.  The brothers had built an unsuccessful glider in 1905, and between 1908 and 1910 they constructed three experimental powered aircraft.  The first lacked sufficient power to fly, but the second, a canard biplane, made the first powered flight in Scotland, piloted by Harold in July 1909.Flying in ScotlandFlight 31 July 1909 but was wrecked on the second attempt to fly it.  The third, a mid-wing monoplane, was built during 1910 and flown by to win a prize for the first flight of over a mile in Scotland on 30 January 1911 at Causewayhead under the Wallace Monument.  In late 1911 Barnwell was hired to work as a designer for a secret department set up by the British and Colonial Aeroplane Company to work on an unconventional seaplane project for the Admiralty in collaboration with Dennistoun Burney, resulting in the unsuccessful Bristol-Burney seaplanes.  He then co-designed the Bristol Scout with Harry Busteed.  When war broke out in 1914 Barnwell enlisted in the Royal Flying Corps and after qualifying as a pilot at the Central Flying School, Upavon, he joined 12 Squadron RFC but in August 1915 was released from service to become chief designer at Bristol.  Here he put his experience of service conditions to use by designing the Bristol Fighter, one of the outstanding aircraft of the war.  With the exception of a short period between October 1921 and October 1923, when he briefly emigrated to Australia to work as an aviation advisor to the Australian Government,Side WindsFlight 6 October 1921 he worked as Bristol's head of design for the rest of his life, designing aircraft such the Bristol Bulldog and Bristol Blenheim."]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Dennistoun Burney "]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["| Dennistoun Burney "]}, {"page": "Imperial Airship Scheme", "response": ["In 1922 the Vickers company – which had been involved in British airship construction since His Majesty's Airship No. 1 in 1911 – proposed a scheme for the development of large commercial airships to provide a passenger service to link the countries of the British Empire.  Named the \"Burney scheme\" after its creator Dennistoun Burney, it involved the construction of six airships at an estimated cost of £4 million, to be built and operated by Vickers.\"The Airship Scheme\" Flight 6 April 1922  £1.2 million would be raised by the issue of shares paying 6% per annum, and a further £2.2 million by the issue of debentures. Both would be guaranteed by the British government and by India and Australia, the total public liability being estimated at £119,000 per annum.Higham 1961, p 237"]}, {"page": "Burney baronets", "response": ["*Sir (Charles) Dennistoun Burney, 2nd Baronet (1888–1968)", "*Sir Cecil Dennistoun Burney, 3rd Baronet (1923–2002)", "*Sir Nigel Dennistoun Burney, 4th Baronet (born 1959)"]}, {"page": "Charles Dennistoun Burney", "response": ["#REDIRECT Dennistoun Burney"]}, {"page": "Cecil Burney", "response": ["In 1884 Burney married Lucinda Burnett; they had two daughters, and a son. His son Dennistoun Burney became a marine and aeronautical engineer, and his daughter Sybil Katherine Neville-Rolfe was founder of the Eugenics Society."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Dennistoun Burney; MP for Uxbridge (1922–1929)"]}, {"page": "Paravane (water kite)", "response": ["The paravane weapon was developed by the British inventor Sir Dennistoun Burney as a means to sweep enemy mines. Towed behind a ship, the paravane wire would either cut the mine's mooring cable or bring the mine and paravane together, detonating the mine. There are offensive and defensive paravanes.  There are main paravanes and auxiliary protector paravanes. Some paravanes are equipped with cable cutters that cut the moored mines.  Explosive paravanes are essentially a towable or controllable mine.  The US Department of Defense continues to have interest in paravanes."]}, {"page": "M18 recoilless rifle", "response": ["During World War II, the U.S. Army's Artillery Section was working on a 105 mm recoilless cannon, based on captured models of the German 10.5 cm Leichtgeschütz 40 that used a plastic blow out plug in the cartridge case. At the same time, there was a freelance research by the U.S. Army's Infantry Section of a man-portable recoilless 57 mm cannon by two engineers, named Kroger and Musser. Instead of a blowout plug, the infantry section's recoilless cannon used a British development, Ordnance, RCL, 3.45 in developed by Dennistoun Burney, from in which the cartridge case had hundreds of small holes in the side walls with a lining of plastic on the inside of the cartridge case walls to keep water and other elements out until the round was fired. Another unique innovation was the use of pre-engraving bands on the 57 mm projectile that engaged the barrel's rifling.While many sources claim the pre-engraving on the M18 projectiles drive band in 1943 was a first, the Germans in World War I had this feature on projectiles for their famous Paris Gun. Later it was discovered that pre-engraving the band gave no advantage and future rounds were produced without this feature. The belief was this feature would reduce friction on firing, allowing more of the propellant gases to be used to force the shell towards the target and less being used to achieve the recoilless effect and therefore giving their design a much higher muzzle velocity than most recoilless cannon at that time period had achieved.Ian Hogg The Guns 1939-45 page 151 Ballantine Books 1970.With most recoilless cannon, there is a 1-to-9 ratio—meaning that when the weapon is fired, one part of the propellant gases is used to force the shell forward and the other 9 parts of the propellant gases are expelled to the back to counter act that forward force, achieving a recoilless effect."]}, {"page": "Sir Dennistoun Burney, 2nd Baronet", "response": ["#REDIRECT Dennistoun Burney"]}, {"page": "Dennis Burney", "response": ["#REDIRECT Dennistoun Burney"]}, {"page": "Charles Burney (disambiguation)", "response": ["*Dennistoun Burney (Sir Charles Dennistoun Burney, 2nd Baronet, 1888–1968), English aeronautical engineer, private inventor and Conservative Party politician"]}, {"page": "Burney (surname)", "response": ["*Dennistoun Burney (1888–1968), British engineer and inventor"]}, {"page": "Bristol-Burney seaplanes", "response": ["The Bristol-Burney seaplanes were a pair of experimental seaplanes produced by a collaboration between Lt. Dennistoun Burney and the Bristol and Colonial Aeroplane Company during 1912–14.  The aircraft, neither of which was successfully flown, featured a novel hydroplane undercarriage. Although not a success, their development was the basis of Burney's later invention of the paravane.", "Dennistoun Burney was a naval officer who had become convinced of the possibilities of naval aviation and who had a number of  technical ideas on the subject.  Wanting to develop these but lacking the technical resources to do so, he approached Bristol who expressed an interest and, having been assured of support from the Admiralty, set up a highly secret separate design office, called the X Department, to develop these at the end of 1911. Frank Barnwell was hired to act as designer, with Clifford Tinson as his assistant.Barnes 1988 p.87  Their first proposal, designated X.1 was an adaptation of a Bristol G.E. 1 biplane.Lewis 1962 p. 154  The aircraft was to be supported in the water by five streamlined airbags under the wings but for takeoff used the hydrofoil principle recently pioneered by Enrico Forlanini using three sets of hydrofoils, each consisting of a central leg bearing a stack of lifting planes, an assembly referred to as a \"hydroped\". In addition to the air propeller the aircraft was to be driven by water propellers for use at take-off,  driven via a clutch so they could be disengaged when the aircraft was in flight."]}, {"page": "Cecil Dennistoun Burney", "response": ["Sir Cecil Dennistoun Burney, 3rd Baronet (8 January 1923 – 19 April 2002) was a British businessman and politician in Zambia (1959-1970), having emigrated in 1951 but returning to Britain in 1970.", "Burney was born in London in 1923 to the British naval officer and politician Dennistoun Burney (a Conservative Party MP for Uxbridge) and his American wife Gladys. He was educated at Eton College and then joined the Royal Navy in 1942, serving as a radar officer in the Arctic convoys. After the war he attended Trinity College, Cambridge and studied engineering, also rowing for the college. After leaving university, Burney moved to Northern Rhodesia to work for Anglo American in the Nchanga Mines in 1948. In 1951 he established a car dealership named Northern Motors, and in 1957 he married Hazel Coleman, with whom he had two sons. Between 1956 and 1959 he was President of the Northern Rhodesia Motor Traders' Association."]}, {"page": "Sybil Neville-Rolfe", "response": ["She was born Sybil Katherine Burney in Queen's House, Royal Naval College, on 22 June 1885. She was the daughter of Admiral Sir Cecil Burney and Lucinda Marion Burnett. Her brother was Dennistoun Burney, a marine, aeronautical engineer, and Conservative MP. As a child, she often lodged in different naval quarters, but these moves were always temporary. She was home-schooled by French and English women who were privately hired governesses. She knew multiple languages as she travelled to France and Germany as a teenager, however even this knowledge did not compare to her yearning for a University education."]}]}}