{"wiki_id": "http://www.wikidata.org/entity/Q5259876", "itemLabel": "Denys Whitehorn Reid", "itemDescription": "British Indian Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Denys_Whitehorn_Reid", "wikipedia_page": {"main": "Major-General Denys Whitehorn Reid  (24 March 1897 – 28 November 1970) was an officer in the British Army and the British Indian Army during World War I and World War II.", "link_mentions": [{"page": "5th Infantry Division (India)", "response": ["* Brigadier Denys Whitehorn Reid (Oct 1941 – Jun 1942)"]}, {"page": "10th Indian Infantry Division", "response": ["In August, command passed to Major General Alan Bruce Blaxland while the division was sent to Cyprus with the responsibility of protecting the island. In July 1943, Major General Wilfrid Lewis Lloyd took command. In August, the 10th had relocated to the Middle East, now incorporating the 1st Greek Brigade, composed of royalist Greek and Yugoslavian troops along with the 20th and 25th Indian Brigades. During the summer it underwent training for a planned invasion of Rhodes, but the Allied defeat in the Dodecanese campaign put an end to those plans. In November it was placed on security duty in Lebanon. On 27 November, it began training for amphibious assault and mountain warfare in preparation for its role in the Italian Campaign. In January 1944, Lloyd was killed in a car accident while overseeing a training exercise in Egypt; command passed to Major General Denys Whitehorn Reid."]}, {"page": "Denys", "response": ["* Denys Whitehorn Reid (1897–1970), officer in the British Army"]}, {"page": "Gothic Line order of battle", "response": [":*10th Indian Infantry Division (Major-General Denys Whitehorn Reid) (from February 1945)", ":*10th Indian Infantry Division (Major-General Denys Whitehorn Reid) (until October 1944)"]}, {"page": "Dennis Whitehorn Reid", "response": ["#REDIRECT Denys Whitehorn Reid"]}, {"page": "Index of World War II articles (D)", "response": ["# Denys Whitehorn Reid"]}]}}